[
  {
    "id": 5325,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Paul Bois",
    "title": "Elon Musk ‘Has Decided Not’ to Join Twitter’s Board of Directors"
  },
  {
    "id": 5972,
    "mediaId": 2741,
    "date": "2022-04-14",
    "sentence": "Troy Nehls, a Texas Republican, simply wrote, “Make Twitter Great Again,” while Rep. <span class='selected-term'>Jim Jordan</span> praised Musk on Fox, painting him as the embodiment of “free speech.”\nLast Saturday, Musk rejected an offer from Twitter to join the company’s board—a move that would have barred him from acquiring a Twitter stake greater than 14.9%.",
    "author": "Caleb Ecarma",
    "title": "Right-Wingers Are Absolutely Eating Up the Idea of Elon Musk Taking Over Twitter"
  },
  {
    "id": 5616,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "Ranking member <span class='selected-term'>Jim Jordan</span> (R-Ohio) made the formal request to the Twitter Board Chair Bret Taylor in one of the letters.",
    "author": "Mike Miller",
    "title": "House Judiciary Republicans 'Ask' Twitter Board to Preserve Records Related to Musk Takeover Bid"
  },
  {
    "id": 5706,
    "mediaId": 2632,
    "date": "2022-04-22",
    "sentence": "\"As Congress continues to examine Big Tech and how to best protect Americans' free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk's offer to purchase Twitter, including Twitter's consideration and response to this offer, and Twitter's evaluation of its shareholder interests with respect to Musk's offer,\" said the letter, led by ranking member <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Lauren Feiner",
    "title": "House Republicans Demand Twitter's Board Preserve All Records About Musk's Bid to Buy the Company"
  },
  {
    "id": 5811,
    "mediaId": 2642,
    "date": "2022-04-22",
    "sentence": "“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter, led by Ranking Member <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Missy Crane",
    "title": "GOP Just Came Out Swinging Against Twitter’s Woke Board…They’re Officially On Notice"
  },
  {
    "id": 5471,
    "mediaId": 2539,
    "date": "2022-04-22",
    "sentence": "“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter, led by ranking member <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Lauren Feiner",
    "title": "House Republicans demand Twitter’s board preserve all records about Musk’s bid to buy the company"
  },
  {
    "id": 5494,
    "mediaId": 2924,
    "date": "2022-04-22",
    "sentence": "\"Among other things, the Board’s reactions to Elon Musk’s offer to purchase Twitter, and outsider opposition to Musk’s role in Twitter’s future are concerning,” <span class='selected-term'>Jim Jordan</span> (R-Ohio) and the other 17 lawmakers wrote.",
    "author": "Riley Gutiérrez McDermid",
    "title": "Elon Musk Bid For Twitter Gets Political As Lawmakers Demand Records"
  }
]