[
  {
    "id": 3680,
    "mediaId": 2614,
    "date": "2022-01-16",
    "sentence": "",
    "author": "Red Voice Media",
    "title": "Biden Gets Wrecked In 11 Seconds On CNN Of All Places, His 2022 Is Off To That Bad Of A Start [VIDEO]"
  },
  {
    "id": 4188,
    "mediaId": 2540,
    "date": "2022-01-21",
    "sentence": "The shift in the balance of power within the House GOP conference -- from institutionalists like John Boehner to conservative rabble-rousers like <span class='selected-term'>Jim Jordan</span> -- is reflected in McCarthy's own evolution from young establishment Republican to dedicated Trump ally.",
    "author": "Michael Warren and Melanie Zanona",
    "title": "Kevin McCarthy's path to speakership enters final but treacherous leg"
  },
  {
    "id": 2764,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "The committee has also sought testimony from Republican members of Congress, including House Minority Leader Kevin McCarthy and Ohio GOP Rep. <span class='selected-term'>Jim Jordan</span>, but so far it has yet to issue subpoenas to compel testimony from the lawmakers.",
    "author": "Gloria Borger",
    "title": "Exclusive: Trump WH spokesman is sent subpoena by January 6 committee"
  },
  {
    "id": 2620,
    "mediaId": 2664,
    "date": "2022-02-04",
    "sentence": "The House committee investigating the Capitol riot has obtained evidence showing new details about then-President Donald Trump's phone call to Ohio GOP Rep. <span class='selected-term'>Jim Jordan</span> on Jan. 6, 2021.",
    "author": "Sky Palma",
    "title": "New evidence shows Trump and Jim Jordan had lengthy phone conversation on Jan. 6"
  },
  {
    "id": 2322,
    "mediaId": 2621,
    "date": "2022-02-04",
    "sentence": "“I mean I’ve talked the president so many, I can’t remember all the days I have talked to him, but I have certainly talked to the president.”\nIn a long rambling answer, <span class='selected-term'>Jim Jordan</span> admits he talked to Trump on January 6th.",
    "author": "Alex Griffing",
    "title": "CNN Confirms Jim Jordan Spoke With Trump Morning of Jan. 6 – A Fact Jordan Has Just Not Been Able to Remember"
  },
  {
    "id": 1917,
    "mediaId": 2664,
    "date": "2022-02-04",
    "sentence": "\"According to White House call records that have been obtained by the January 6th committee, and have been reviewed by two different sources that spoke to CNN, there was a phone call placed by the White House, by President Trump to <span class='selected-term'>Jim Jordan</span> on the morning of January 6th,\" said Nobles.",
    "author": "Matthew Chapman",
    "title": "White House call log 'directly contradicts' Jim Jordan's claims to Rules Committee: report"
  },
  {
    "id": 1947,
    "mediaId": 2643,
    "date": "2022-02-04",
    "sentence": "Republican Ohio Representative <span class='selected-term'>Jim Jordan</span> talked with President Donald Trump on the phone during the morning of January 6, 2021, during the Capitol riots, according to CNN.",
    "author": "Daniel Villarreal",
    "title": "Jim Jordan Spoke With Trump in 10-Minute Phone Call on 1/6, Records Show"
  },
  {
    "id": 2114,
    "mediaId": 2688,
    "date": "2022-02-04",
    "sentence": "Over and over again, Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) has gone back and forth on the answer to a simple question: did he speak with President Trump on Jan. 6?",
    "author": "Cristina Cabrera",
    "title": "CNN: Trump, Jordan Spoke For 10 Mins On Jan. 6"
  },
  {
    "id": 1828,
    "mediaId": 2590,
    "date": "2022-02-05",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) spoke to former President Donald Trump for 10 minutes the morning of the Capitol riot last January, according to a new report from CNN citing records obtained by investigators in the House.",
    "author": "Sara Boboltz",
    "title": "Jim Jordan Spoke To Trump For 10 Minutes Before Capitol Riot: Report"
  },
  {
    "id": 1905,
    "mediaId": 2664,
    "date": "2022-02-06",
    "sentence": "Why has <span class='selected-term'>Jim Jordan</span> wanted to pretend that pre-attack call didn't happen?https://www.cnn.com/2022/02/04/politics/jim-jordan-trump-january-6/index.html\\u00a0\\u2026\n— Bill Kristol (@Bill Kristol) 1644001901\nSpeaking to CNN, former U.S. Attorney and Deputy Assistant Attorney General Harry Litman also echoed McGovern's concerns as he agreed that the damning phone call may be \"a big piece of evidence.\"",
    "author": "Meaghan Ellis",
    "title": "'A lot of explaining to do': Jim Jordan slammed for contradictory remarks about 1/6 call to Trump"
  },
  {
    "id": 2133,
    "mediaId": 2512,
    "date": "2022-02-06",
    "sentence": "Why has <span class='selected-term'>Jim Jordan</span> wanted to pretend that pre-attack call didn't happen?https://www.cnn.com/2022/02/04/politics/jim-jordan-trump-january-6/index.html\\u00a0\\u2026\n— Bill Kristol (@Bill Kristol) 1644001901\nJust a casual 10-minute chat with the president on the morning of the insurrection.",
    "author": "Meaghan Ellis",
    "title": "'A lot of explaining to do': Jim Jordan slammed on Twitter for contradictory remarks about 1/6 call to Trump"
  },
  {
    "id": 2293,
    "mediaId": 2540,
    "date": "2022-02-07",
    "sentence": "",
    "author": "Alexandra Meeks",
    "title": "5 things to know for Feb. 7: Covid, Capitol riot, Electoral count, Jubilee, Joe Rogan"
  },
  {
    "id": 2199,
    "mediaId": 2672,
    "date": "2022-02-10",
    "sentence": "The committee has established that Trump spoke to several figures in this circle on Jan. 6, including Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), who admitted last summer he spoke to Trump on the day of the riot.",
    "author": "Ryan Bort",
    "title": "The White House Reportedly Didn’t Log Some of Trump’s Jan. 6 Calls — for Some Strange Reason"
  },
  {
    "id": 1729,
    "mediaId": 2540,
    "date": "2022-02-13",
    "sentence": "A call earlier that morning with GOP Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, first reported by CNN, was noted in the official log.",
    "author": "Gloria Borger",
    "title": "Trump's unorthodox phone habits complicate January 6 investigation"
  },
  {
    "id": 1093,
    "mediaId": 2621,
    "date": "2022-02-17",
    "sentence": "“Could you be excited about a Speaker <span class='selected-term'>Jim Jordan</span>,” Gaetz then asked.",
    "author": "Alex Griffing",
    "title": "Lou Dobbs Says ‘Outright RINO’ Kevin McCarthy Should Not Be Speaker of the House If GOP Wins in 2022"
  },
  {
    "id": 12676,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Tim Lister *",
    "title": "Fears grow for Ukrainian civilians after checkpoint is shelled and evacuations fail for a second day"
  },
  {
    "id": 9246,
    "mediaId": 2540,
    "date": "2022-03-29",
    "sentence": "CNN first reported that the records show that Trump had a phone call with Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span> the morning of January 6.",
    "author": "Veronica Stracqualursi",
    "title": "Washington Post and CBS News: White House records of January 6 show more than seven-hour gap in Trump’s calls"
  },
  {
    "id": 5237,
    "mediaId": 2618,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Alexander Connell",
    "title": "Secret Recording: Kevin McCarthy Told Liz Cheney He Would Tell Trump To Resign In Shocking Leaked Audio"
  }
]