[
  {
    "id": 1814,
    "mediaId": 2590,
    "date": "2022-02-06",
    "sentence": "— GoFundMe (@gofundme) February 5, 2022\n Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) also complained on Twitter, and Elon Musk gushed: “Canadian truckers rule.”\nIn addition, Louisiana Attorney General Jeff Landry and West Virginia Attorney General Patrick Morrisey, both Republicans, indicated Saturday that they’re investigating the issue.",
    "author": "Mary Papenfuss",
    "title": "Gov. Ron DeSantis Going After GoFundMe For Dumping Anti-Vaccine Ottawa Truckers"
  },
  {
    "id": 1255,
    "mediaId": 2618,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Christina Coulter",
    "title": "Florida woman, 33, 'used $15,000 pandemic relief loan to bankroll a hit on TSA agent who stole her boyfriend': Victim, 24, was gunned down outside her Miami home in front of her three-year-old daughter"
  },
  {
    "id": 12546,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Cristina Laila",
    "title": "Far-Left Actress Patricia Arquette Demands Russia be Kicked Out of….NATO – Then Blames Her ‘Dyslexia’ After Getting Roasted For Her Stupidity"
  },
  {
    "id": 12494,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Chris Queen",
    "title": "Hate-Hoaxing Atlanta Rioters Who Tried to Frame Trump Supporters Convicted"
  },
  {
    "id": 7374,
    "mediaId": 2745,
    "date": "2022-04-07",
    "sentence": "",
    "author": "",
    "title": "Will Elon Musk bring Trump back to Twitter?"
  },
  {
    "id": 5325,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Paul Bois",
    "title": "Elon Musk ‘Has Decided Not’ to Join Twitter’s Board of Directors"
  },
  {
    "id": 5449,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "Must See: Engelbrecht and Phillips on the Charlie Kirk Show on 2020 Fraud and “2000 Mules” – Cross-State Ballot Traffickers ID’ed – Brian Kemp Implicated – 1155 Ballot Traffickers in PA (Video)"
  },
  {
    "id": 5344,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "“I’m Defending the Right to Express Your Views Under the First Amendment” – Alan Dershowitz Speaks Out in Defense of J6er He Is Representing who Was Waved in to US Capitol (Video)"
  },
  {
    "id": 5272,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Josh Boswell",
    "title": "Exclusive: 'Hunter is a grifter!' Senator Ron Johnson SLAMS President's son for running up Secret Service costs after DailyMail.com revealed agents' $30k-a-month Malibu mansion and trip with his wife to Brazil"
  },
  {
    "id": 5707,
    "mediaId": 6676,
    "date": "2022-04-14",
    "sentence": "For example, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said on Fox Business that social media platforms are “the public square today.”\n“This is where we have debate in our culture and in our country today.",
    "author": "Rebecca Klar",
    "title": "How an Elon Musk-led Twitter could change social media"
  },
  {
    "id": 5972,
    "mediaId": 2741,
    "date": "2022-04-14",
    "sentence": "Troy Nehls, a Texas Republican, simply wrote, “Make Twitter Great Again,” while Rep. <span class='selected-term'>Jim Jordan</span> praised Musk on Fox, painting him as the embodiment of “free speech.”\nLast Saturday, Musk rejected an offer from Twitter to join the company’s board—a move that would have barred him from acquiring a Twitter stake greater than 14.9%.",
    "author": "Caleb Ecarma",
    "title": "Right-Wingers Are Absolutely Eating Up the Idea of Elon Musk Taking Over Twitter"
  },
  {
    "id": 5727,
    "mediaId": 2736,
    "date": "2022-04-17",
    "sentence": "From The Atlantic:\nThe day after Glenn Youngkin won the Virginia governor’s race last November, a Wall Street Journal headline declared: “Youngkin Makes the GOP the Parents’ Party.” Representative <span class='selected-term'>Jim Jordan</span> of Ohio exulted in this new party line on Twitter: “The Republican Party is the party of parents.”\nKendi is wrong here.",
    "author": "Sam Janney",
    "title": "‘Kinda gives the game away here, no’? Ibram X. Kendi goes straight-up #BlueAnon ranting about white supremacist grooming and LOL"
  },
  {
    "id": 5453,
    "mediaId": 2818,
    "date": "2022-04-18",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) spoke with Fox News’ Jimmy Failla about billionaire Elon Musk’s bid to buy Twitter; Jordan is a big fan of the move, saying “I hope it goes through.”\n“I think this is tremendous.",
    "author": "The First",
    "title": "‘A WIN FOR THE FIRST AMENDMENT’: Jordan Says Musk Buying Twitter Would Be ‘Tremendous’"
  },
  {
    "id": 5769,
    "mediaId": 2664,
    "date": "2022-04-21",
    "sentence": "His call for more “free speech” on Twitter is being taken up with enthusiasm by conservatives like US Reps. <span class='selected-term'>Jim Jordan</span> and Lauren Boebert, who see Musk as an ally in turning Twitter into a place where hateful and abusive speech are common and encouraged.",
    "author": "Noah Berlatsky",
    "title": "Elon Musk wants 'his speech to trump everyone else’s'"
  },
  {
    "id": 5811,
    "mediaId": 2642,
    "date": "2022-04-22",
    "sentence": "“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter, led by Ranking Member <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Missy Crane",
    "title": "GOP Just Came Out Swinging Against Twitter’s Woke Board…They’re Officially On Notice"
  },
  {
    "id": 5706,
    "mediaId": 2632,
    "date": "2022-04-22",
    "sentence": "\"As Congress continues to examine Big Tech and how to best protect Americans' free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk's offer to purchase Twitter, including Twitter's consideration and response to this offer, and Twitter's evaluation of its shareholder interests with respect to Musk's offer,\" said the letter, led by ranking member <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Lauren Feiner",
    "title": "House Republicans Demand Twitter's Board Preserve All Records About Musk's Bid to Buy the Company"
  },
  {
    "id": 5616,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "Ranking member <span class='selected-term'>Jim Jordan</span> (R-Ohio) made the formal request to the Twitter Board Chair Bret Taylor in one of the letters.",
    "author": "Mike Miller",
    "title": "House Judiciary Republicans 'Ask' Twitter Board to Preserve Records Related to Musk Takeover Bid"
  },
  {
    "id": 6022,
    "mediaId": 2937,
    "date": "2022-04-22",
    "sentence": "Article content\n“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter signed by the top Republican on the House Judiciary Committee, <span class='selected-term'>Jim Jordan</span>, and others on the committee.",
    "author": "David Shepardson",
    "title": "House Republicans ask Twitter board to retain records tied to Musk offer"
  },
  {
    "id": 6107,
    "mediaId": 2599,
    "date": "2022-04-22",
    "sentence": "According to a Friday letter seen by CNBC, House Judiciary Committee Republicans led by ranking member Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) have asked Twitter board chairman Bret Taylor to preserve any communications from both official and personal accounts – including those sent using encryption – that have anything to do with Musk’s offer.”",
    "author": "Glenn Reynolds",
    "title": "House Republicans Demand Twitter Board Preserve All Records Related To Musk Buyout Bid."
  },
  {
    "id": 5471,
    "mediaId": 2539,
    "date": "2022-04-22",
    "sentence": "“As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,” said the letter, led by ranking member <span class='selected-term'>Jim Jordan</span>, R-Ohio.",
    "author": "Lauren Feiner",
    "title": "House Republicans demand Twitter’s board preserve all records about Musk’s bid to buy the company"
  },
  {
    "id": 5494,
    "mediaId": 2924,
    "date": "2022-04-22",
    "sentence": "\"Among other things, the Board’s reactions to Elon Musk’s offer to purchase Twitter, and outsider opposition to Musk’s role in Twitter’s future are concerning,” <span class='selected-term'>Jim Jordan</span> (R-Ohio) and the other 17 lawmakers wrote.",
    "author": "Riley Gutiérrez McDermid",
    "title": "Elon Musk Bid For Twitter Gets Political As Lawmakers Demand Records"
  },
  {
    "id": 5309,
    "mediaId": 2641,
    "date": "2022-04-22",
    "sentence": "Big Tech in the Crosshairs\n\"As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,\" said the letter signed by the top Republican on the House Judiciary Committee, <span class='selected-term'>Jim Jordan</span>, and others on the committee.",
    "author": "",
    "title": "House Republicans Ask Twitter to Retain Musk Records"
  },
  {
    "id": 4995,
    "mediaId": 2642,
    "date": "2022-04-23",
    "sentence": "House Republicans led by Ohio Rep. <span class='selected-term'>Jim Jordan</span> (R) wrote a letter to Twitter’s board of directors on Friday asking that they get ready to submit information regarding their activities aimed at preventing billionaire Elon Musk from purchasing the social media site.",
    "author": "WD Staff",
    "title": "Republicans Draft Letter To Twitter Requesting They Save Records Of Elon Musk’s Attempts To Purchase Company"
  }
]