[
  {
    "id": 4539,
    "mediaId": 2615,
    "date": "2022-01-11",
    "sentence": "Seth takes a closer look at Congressman <span class='selected-term'>Jim Jordan</span> refusing to cooperate with the January 6 investigation and Sen. Ted Cruz debasing himself on Fox News.",
    "author": "Charles Johnson",
    "title": "Seth Meyers: Ted Cruz Humiliates Himself by Groveling to Tucker Carlson on Fox News"
  },
  {
    "id": 4555,
    "mediaId": 2605,
    "date": "2022-01-14",
    "sentence": "Gen. Eric Schmitt (R); Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio); author James O’Keefe (“American Muckraker”).",
    "author": "",
    "title": "Guests on Sunday talk shows: Rep. James Clyburn on CNN’s ‘State of the Union’"
  },
  {
    "id": 3610,
    "mediaId": 2621,
    "date": "2022-01-20",
    "sentence": "No more crazy people.” Kayleigh McEnany responded: “Yes 100%.”\nA few days later, on January 10, 2021, Mr. Hannity wrote to the White House Chief of Staff and Congressman <span class='selected-term'>Jim Jordan</span> with the following message:\n“Guys, we have a clear path to land the plane in 9 days.",
    "author": "Alex Griffing",
    "title": "Hannity Texted White House a Five-Point Plan for How to Deal With Trump on Jan. 7: ‘No More Stolen Election Talk’"
  },
  {
    "id": 4105,
    "mediaId": 2562,
    "date": "2022-01-20",
    "sentence": "He was right up front with <span class='selected-term'>Jim Jordan</span> and all of the others.",
    "author": "NationalWatch",
    "title": "Trump: Rift With Gov. DeSantis ‘Totally Fake News’"
  },
  {
    "id": 3739,
    "mediaId": 2636,
    "date": "2022-01-20",
    "sentence": "Ever,” Mr. Hannity wrote on Jan. 10, 2021, to Mr. Meadows and Representative <span class='selected-term'>Jim Jordan</span>, an Ohio Republican.",
    "author": "",
    "title": "After Jan. 6, Sean Hannity Advised Trump: ‘No More Stolen Election Talk’"
  },
  {
    "id": 3752,
    "mediaId": 2641,
    "date": "2022-01-20",
    "sentence": "He was right up front with <span class='selected-term'>Jim Jordan</span> and all of the others.",
    "author": "Eric Mack",
    "title": "Trump: Rift With Gov. DeSantis 'Totally Fake News'"
  },
  {
    "id": 3758,
    "mediaId": 2702,
    "date": "2022-01-20",
    "sentence": "The letter to Ivanka Trump asking her to sit with the committee as soon as early February is the latest in a string of voluntary requests from the panel, including those sent to House Minority Leader Kevin McCarthy (R-Calif.) and Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Scott Perry (R-Pa.).",
    "author": "Rebecca Beitsch",
    "title": "Jan. 6 committee asks Ivanka Trump to sit for interview"
  },
  {
    "id": 4052,
    "mediaId": 2569,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them; they were fantastic.",
    "author": "",
    "title": "‘Totally fake news’: Donald Trump downplays any split with Ron DeSantis"
  },
  {
    "id": 3625,
    "mediaId": 2658,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them.”\nWhen he served in Congress, DeSantis was one of Trump’s staunchest defenders on Fox News as former Special Counsel Robert Mueller investigated alleged Russian interference in the 2016 election.",
    "author": "",
    "title": "Trump calls feud with DeSantis ‘fake news’"
  },
  {
    "id": 4437,
    "mediaId": 2569,
    "date": "2022-01-21",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them; they were fantastic.",
    "author": "",
    "title": "‘Remove Ron’ trolls Donald Trump for not keeping DeSantis in line"
  },
  {
    "id": 4380,
    "mediaId": 2730,
    "date": "2022-01-21",
    "sentence": "He was right up front along with <span class='selected-term'>Jim Jordan</span>, and all of the rest of them, they were fantastic.",
    "author": "Madeline Leesman",
    "title": "Trump Responds to Reports Claiming That He Has Conflict with DeSantis"
  },
  {
    "id": 3835,
    "mediaId": 4091,
    "date": "2022-01-24",
    "sentence": "I will help reinforce.”\nAlso, Hannity said he believed it was “key” to keep Trump away from certain people, texting: “No more crazy people,” leading McEnany to respond: “Yes, 100%.”\nHannity also wrote in a text to Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and then-White House Chief of Staff Mark Meadows:\nGuys, we have a clear path to land the plane in 9 days.",
    "author": "JD Heyes",
    "title": "More leaked texts from the Jan. 6 Committee show messaging coordination between Hannity, McEnany"
  },
  {
    "id": 3700,
    "mediaId": 2724,
    "date": "2022-01-27",
    "sentence": "He was right in front along with <span class='selected-term'>Jim Jordan</span> and all of the rest of them.”\nFurther, Trump has blamed talk of a feud on Mitch McConnell and his allies.",
    "author": "John Hanson",
    "title": "DeSantis Blames ‘Corporate Media’ For Trying To ‘Manufacture’ Feud Between Him And Trump"
  },
  {
    "id": 3058,
    "mediaId": 2572,
    "date": "2022-02-03",
    "sentence": "Why didn't they call up knowing large crowds were coming, knowing tensions were high, coming off a summer of rioting, how come they are not being brought into this sham committee to kick off <span class='selected-term'>Jim Jordan</span> and Jim Banks to put on the two biggest Republican Trump haters they could find?",
    "author": "",
    "title": "'Hannity' on Whoopi Goldberg's Holocaust remarks, Joe Rogan"
  },
  {
    "id": 2322,
    "mediaId": 2621,
    "date": "2022-02-04",
    "sentence": "“I mean I’ve talked the president so many, I can’t remember all the days I have talked to him, but I have certainly talked to the president.”\nIn a long rambling answer, <span class='selected-term'>Jim Jordan</span> admits he talked to Trump on January 6th.",
    "author": "Alex Griffing",
    "title": "CNN Confirms Jim Jordan Spoke With Trump Morning of Jan. 6 – A Fact Jordan Has Just Not Been Able to Remember"
  },
  {
    "id": 2529,
    "mediaId": 2629,
    "date": "2022-02-05",
    "sentence": "Records that former President Donald Trump attempted to hide from public scrutiny have now revealed that he spoke on the phone with Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) on Jan. 6, 2021.",
    "author": "Oliver Willis",
    "title": "Records Trump Tried To Hide Reveal Call To Jim Jordan Before Capitol Attack"
  },
  {
    "id": 1793,
    "mediaId": 2573,
    "date": "2022-02-09",
    "sentence": "Here with the very latest is the ranking member of the House Judiciary Committee, Congressman <span class='selected-term'>Jim Jordan</span>, along with former White House chief of staff and former congressman, Mark Meadows, is with us.",
    "author": "",
    "title": "'Hannity' on Capitol Police"
  },
  {
    "id": 2170,
    "mediaId": 6621,
    "date": "2022-02-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) stopped by Fox News’ The Ingraham Angle to absolutely destroy the Democratic narrative that Republicans and Donald Trump are a threat to Democracy.",
    "author": "",
    "title": "‘AMERICANS HAVE HAD IT WITH ELITE MINDSET’: Watch Jim Jordan Go SCORCHED EARTH on Dems"
  },
  {
    "id": 2356,
    "mediaId": 2699,
    "date": "2022-02-10",
    "sentence": "Ted Cruz (R-TX) and Marsha Blackburn (R-TN), and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) called for an end to “government-funded crack pipes,” other politicians insisted this was part of Biden’s plans for racial justice.",
    "author": "Justin Baragona",
    "title": "How the White House Caved to Fox News’ Biden ‘Crack Pipe’ Faux-Scandal"
  },
  {
    "id": 1069,
    "mediaId": 2547,
    "date": "2022-02-13",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> amplified Trump's dangerous threats with a retweet, which Mediaite noticed.",
    "author": "John Amato",
    "title": "Jordan Amplifies Trump's Call To Execute Hillary Operatives"
  },
  {
    "id": 975,
    "mediaId": 2590,
    "date": "2022-02-14",
    "sentence": "Donald Trump is calling for the execution of some who worked on Hillary Clinton’s 2016 presidential campaign - and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) seems to be on board.",
    "author": "",
    "title": "Jim Jordan Appears To Embrace Trump's Call To Execute Hillary Clinton Campaign Aides"
  },
  {
    "id": 1401,
    "mediaId": 2548,
    "date": "2022-02-14",
    "sentence": "(RELATED : ‘As Wrong As It Gets’: Rep. <span class='selected-term'>Jim Jordan</span> Calls Out Liberal Media And Democrats For Denying That Trump Was Spied On)\n“Jacqui, my answer is not going to change, I refer you to the Department of Justice,” Jean-Pierre repeated.",
    "author": "Nicole Silverio",
    "title": "‘Can’t Speak To That’: Karine Jean-Pierre Repeatedly Dodges Questions On Durham Report When Pressed By Fox News Reporter"
  },
  {
    "id": 1570,
    "mediaId": 2627,
    "date": "2022-02-14",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, seemed to agree Sunday with a statement from former President Donald Trump that suggested some of Hillary Clinton's associates deserve to be executed.",
    "author": "Ja'han Jones",
    "title": "Rep. Jim Jordan seems to back Trump's comment about executing Clinton aides"
  },
  {
    "id": 1644,
    "mediaId": 8369,
    "date": "2022-02-16",
    "sentence": "Perhaps then, following on the tendentiously ideological “findings” of the January 6 Commission which will surface conveniently prior to the election, the House decides to expel some members who are already in congress (e.g.. Rep <span class='selected-term'>Jim Jordan</span>) who supposedly had “contact” with the “insurrectionists”?",
    "author": "Boyd D. Cathey",
    "title": "Nightmare Scenario for the 2022 Congressional Elections?"
  },
  {
    "id": 895,
    "mediaId": 2573,
    "date": "2022-02-16",
    "sentence": "When <span class='selected-term'>Jim Jordan</span> and myself said that they were spying on his campaign, we were ridiculed.",
    "author": "",
    "title": "'Hannity' on Durham findings, Canadian truckers"
  },
  {
    "id": 1689,
    "mediaId": 2512,
    "date": "2022-02-16",
    "sentence": "That concern was shared by an unidentified member of the House Freedom Caucus, who wrote to Meadows on January 2nd that “if POTUS allows this to occur… we’re driving a stake in the heart of the federal republic.”\nThree days later, former Defense Department Inspector General Joseph Schmitz wrote to election objector Congressman <span class='selected-term'>Jim Jordan</span> (R-Ohio) that “on January 6, 2021, Vice President Mike Pence, as President of the Senate, should call out all electoral votes that he believes are unconstitutional as no electoral votes at all -- in accordance with guidance from founding father Alexander Hamilton and judicial precedence.",
    "author": "Brandon Gage",
    "title": "Text messages showcase the chaos and desperation inside Trumpworld on January 6th"
  },
  {
    "id": 988,
    "mediaId": 2550,
    "date": "2022-02-18",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> hurried to agree that the death penalty was completely appropriate for this crime of … of … they’d figure that out later.",
    "author": "Mark Sumner",
    "title": "John Durham issues court filing to disown the Fox News fake conspiracy that he started"
  },
  {
    "id": 642,
    "mediaId": 2540,
    "date": "2022-02-20",
    "sentence": "For example, GOP Rep. <span class='selected-term'>Jim Jordan</span> appeared on Fox News last week to declare that Clinton's (non-existent) spying on Trump was \"worse than we thought.\"",
    "author": "Dean Obeidallah",
    "title": "'Hillary Clinton Derangement Syndrome' is worse than ever"
  },
  {
    "id": 12575,
    "mediaId": 2573,
    "date": "2022-03-02",
    "sentence": "Joining us now is House Minority Whip Steve Scalise, House Judiciary Committee Ranking Member <span class='selected-term'>Jim Jordan</span>, and Molly Hemingway Editor in Chief of the Federalist Fox News Contributor.",
    "author": "",
    "title": "'The Ingraham Angle' on Biden's State of the Union"
  },
  {
    "id": 13228,
    "mediaId": 2548,
    "date": "2022-03-02",
    "sentence": "(RELATED: Rep. <span class='selected-term'>Jim Jordan</span> Says Biden Might Want To Change His Policies, But The ‘Radical Left’ In His Party Will Never Let Him)\nSanctioning Russian energy has gained bipartisan support from lawmakers, political commentators and elites.",
    "author": "Nicole Silverio",
    "title": "Gutfeld Says US Government Is ‘Acting Like White Knights’ As They Purchase Russian Oil"
  },
  {
    "id": 12928,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Jack Wright & Harriet Alexander",
    "title": "Parents grieve over toddler killed by shrapnel hours before 'ceasefire' intended to let them evacuate - which Putin's troops ignored anyway: Civilians attempting to escape Mariupol are forced back by shelling as Russians break pledge"
  },
  {
    "id": 12676,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Tim Lister *",
    "title": "Fears grow for Ukrainian civilians after checkpoint is shelled and evacuations fail for a second day"
  },
  {
    "id": 11107,
    "mediaId": 2557,
    "date": "2022-03-11",
    "sentence": "https://t.co/KLL7SoYIzP\n— Donald Trump Jr. (@DonaldJTrumpJr) March 10, 2022\nRep. <span class='selected-term'>Jim Jordan</span> tweeted Tuesday, “Keystone Pipeline.",
    "author": "",
    "title": "VIDEO: Americans blast Biden for halting Keystone Pipeline: ‘Killed our economy’"
  },
  {
    "id": 10701,
    "mediaId": 8322,
    "date": "2022-03-14",
    "sentence": "REP. <span class='selected-term'>JIM JORDAN</span> (R-OH): No, this is the great divide in America today, Sean, you got the, quote, elite and the crazy left who think that there's no problem having four and five dollar gas.",
    "author": "",
    "title": "'Hannity' on Jen Psaki, inflation"
  },
  {
    "id": 11024,
    "mediaId": 2641,
    "date": "2022-03-14",
    "sentence": "The letter, authored by GOP Reps. <span class='selected-term'>Jim Jordan</span> of Ohio, John Katko of New York, Michael McCaul of Texas and Mike Turner of Ohio, stated that ''Burkov has been described as an 'asset of supreme importance' and 'one of the most connected and skilled malicious hackers ever apprehended by U.S.",
    "author": "Jeremy Frankel",
    "title": "Republicans Demand Answers on Release of Russian Cyber Criminal"
  },
  {
    "id": 11339,
    "mediaId": 2818,
    "date": "2022-03-15",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) celebrate the moment on Twitter:\n“Ohio just became the 23rd state in the nation to enact constitutional carry legislation.",
    "author": "The First",
    "title": "OHIO GREENLIGHTS CONSTITUTIONAL CARRY: Jordan Says ‘Big Win for Second Amendment’"
  },
  {
    "id": 9589,
    "mediaId": 2641,
    "date": "2022-03-23",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, says FBI Director Christopher Wray needs to explain why an internal audit of the FBI has found violations of its own policies when conducting surveillance investigations, The Washington Examiner reported.",
    "author": "Peter Malbin",
    "title": "Rep. Jim Jordan: 'Pattern of Misconduct and Mismanagement Within the FBI'"
  },
  {
    "id": 9245,
    "mediaId": 2572,
    "date": "2022-03-24",
    "sentence": "PONTE VEDRA, Fla. – Rep. <span class='selected-term'>Jim Jordan</span> said First Amendment rights are \"under assault\" by Democrats, telling Fox News that Republicans need to \"make sure\" that the average voter \"fully understands\" that before going to the polls for the midterm elections in November.",
    "author": "Brooke Singman",
    "title": "Jim Jordan: GOP must make case that First Amendment is 'under assault'"
  },
  {
    "id": 9679,
    "mediaId": 2626,
    "date": "2022-03-29",
    "sentence": "According to Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) the only thing fake about Hunter Biden’s laptop is that “fake news” that claimed that it was full of Russian disinformation.",
    "author": "Eric Scheiner",
    "title": "Rep. Jordan: Hunter’s Laptop Is Real - ‘Fake News’ Pushed ‘Total Garbage’"
  },
  {
    "id": 7134,
    "mediaId": 2621,
    "date": "2022-04-03",
    "sentence": "",
    "author": "Katherine Huggins",
    "title": "Fox News’ Trey Gowdy Blasts Cawthorn Over Orgy Comments: ‘Can’t Blame the Media for Something That Came Out of Your Mouth’"
  },
  {
    "id": 7211,
    "mediaId": 2547,
    "date": "2022-04-04",
    "sentence": "",
    "author": "John Amato",
    "title": "Border Patrol Council Embraces 'Great Replacement' Theory To Criticize Biden"
  },
  {
    "id": 7910,
    "mediaId": 2548,
    "date": "2022-04-05",
    "sentence": "(RELATED: ‘This Is Intentional’: Rep. <span class='selected-term'>Jim Jordan</span> Rips Biden Administration’s Handling Of Southern Border, COVID-19)\nSources tell me w/ parole releases, the migrants are asked to turn themselves into ICE in a city of their choice.",
    "author": "Nicole Silverio",
    "title": "Video Reportedly Shows ‘Mass Release’ Of Illegal Migrants Into Texas City"
  },
  {
    "id": 7817,
    "mediaId": 2724,
    "date": "2022-04-06",
    "sentence": "Breaking: Following @FDRLST reporting that Adam Schiff and his staff doctored a text message between <span class='selected-term'>Jim Jordan</span> and former WH chief of staff Mark Meadows, the House Jan. 6 committee has just admitted that it did, in fact, doctor the text message.https://t.co/78aRNyOib7\n— Mollie (@MZHemingway) December 15, 2021\nIt seems there isn’t much that Kinzinger isn’t willing to believe if it casts a negative pall on his political adversaries.",
    "author": "Rusty Weiss",
    "title": "Never Trumper Adam Kinzinger Falls For Fake Tucker Carlson Quote Shared By Fellow ‘Never Trumper’ Joe Walsh"
  },
  {
    "id": 5432,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Megan Myers",
    "title": "LinkedIn reinstates Air Force vet's post after wrongfully calling it 'hate speech,' apologizes"
  },
  {
    "id": 5740,
    "mediaId": 2522,
    "date": "2022-04-12",
    "sentence": "SIGN UP HERE\n(Video: Fox News)\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) joined Fox News’ “Fox and Friends” Tuesday and said he believes President Joe Biden was most certainly involved in his son Hunter’s business dealings with foreign entities though the president predictably continues to deny it.",
    "author": "Frank Webster",
    "title": "Jim Jordan vows to expose Joe’s role in corrupt Biden ‘family enterprise’"
  },
  {
    "id": 5341,
    "mediaId": 2550,
    "date": "2022-04-19",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> was elevated to omnipresence when he was exposed as one of the many, many athletic coaches in America who knew his athletes were being sexually molested and worked to cover it up.",
    "author": "Hunter\nDaily Kos Staff",
    "title": "'Libs of TikTok' founder exposed: Surprise, it's just another"
  },
  {
    "id": 5756,
    "mediaId": 2934,
    "date": "2022-04-22",
    "sentence": "However, there was no justification for some of the language included in the letter.”\nThe letter noted that the “voices of parents … should and must continue to be heard when it comes to decisions about their children’s education, health, and safety.”\nThe following month, Republican Rep. <span class='selected-term'>Jim Jordan</span> sent a letter to Garland saying that information from a Justice Department whistleblower called into question the accuracy of Garland’s testimony that “the Department of Justice and Federal Bureau of Investigation were not using federal counterterrorism tools to target concerned parents at local school board meetings.”\nJordan said a “protected disclosure” from the whistleblower showed “that the FBI’s Counterterrorism Division is compiling and categorizing threat assessments related to parents, including a document directing FBI personnel to use a specific ‘threat tag’ to track potential investigations.”\nSpecifically, Jordan cited an FBI email that said in response to Garland’s Oct. 4 memo, “the Counterterrorism and Criminal Divisions created a threat tag, EDUOFFICIALS, to track instances of related threats.” It directed FBI offices to apply that threat tag to “investigations and assessments of threats specifically directed against school board administrators, board members, teachers, and staff.”\nAccording to Jordan, “This disclosure provides specific evidence that federal law enforcement operationalized counterterrorism tools at the behest of a left-wing special interest group against concerned parents.”\nBut the email does not say that the FBI ought to apply tags to parents merely speaking out at school board meetings.",
    "author": "Robert Farley",
    "title": "Attorney General Never Called Concerned Parents ‘Domestic Terrorists’"
  }
]