[
  {
    "id": 4365,
    "mediaId": 2688,
    "date": "2022-01-22",
    "sentence": "Again, on Jan. 10, Hannity texted Meadows and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), expressing some anxiety over a conversation he had had with Trump that day.",
    "author": "Josh Kovensky",
    "title": "‘No More Crazies’: Trump’s Final Days In Office, As Documented By The Jan. 6 Committee"
  },
  {
    "id": 3203,
    "mediaId": 2748,
    "date": "2022-02-02",
    "sentence": "",
    "author": "bigprick",
    "title": "MORE THAN 100 CONSTITUENTS OPEN INVESTIGATIONS INTO 2020 ELECTION FRAUD"
  },
  {
    "id": 1470,
    "mediaId": 2569,
    "date": "2022-02-11",
    "sentence": "The Lincoln Project is coming out Friday with a new ad targeting congressional Republicans for their participation in the 2022 “Coward Olympics” by continuing to promote falsehoods about the Jan. 6 Capitol riot and standing for Donald Trump‘s electoral “big lie.”\nExplicitly named in the minute-long spot — House Minority Leader Kevin McCarthy, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, and Rep. Marjorie Taylor Green of Georgia.",
    "author": "Peter Schorsch",
    "title": "Sunburn — The morning read of what’s hot in Florida politics — 2.11.22"
  },
  {
    "id": 1461,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Rebecca Downs",
    "title": "Clever New Ad Uses Raphael Warnock's Own Words Against Him"
  },
  {
    "id": 21,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "The \"Take Back Congress Candidate Forum” will be littered with 10 congressional Trump acolytes like Representative <span class='selected-term'>Jim Jordan</span> of Ohio and 13 hopefuls such as United States Senate candidate Herschel Walker of Georgia.",
    "author": "Brandon Gage",
    "title": "Donald Trump to host ‘Magapalooza’ at Mar-a-Lago on Wednesday"
  },
  {
    "id": 13256,
    "mediaId": 2640,
    "date": "2022-03-01",
    "sentence": "Reps. Scott Perry and <span class='selected-term'>Jim Jordan</span> would only offer vague criticism of racism, without criticizing Fuentes, Gosar, or Greene, while Rep. Chip Roy didn't hesitate to be more blunt.",
    "author": "Jenn Gidman",
    "title": "McCarthy, McConnell Slam Fellow GOPers Over America First Event"
  },
  {
    "id": 13172,
    "mediaId": 2550,
    "date": "2022-03-02",
    "sentence": "Leaders of the “Stop the Steal” movement were also participating and according to a tweet from Republican Rep. Mo Brooks of Alabama that evening, over 50 congresspeople were on the call, including Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "",
    "title": "Coterie of Trump's election fraud lawyers hit with Jan. 6 committee subpoenas"
  },
  {
    "id": 12885,
    "mediaId": 2641,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday that poor decisions about energy by President Joe Biden have led Russian President Vladimir Putin to use oil and gas as leverage.",
    "author": "Luca Cacciatore",
    "title": "Jim Jordan to Newsmax: 'Putin Is Using Energy as Leverage' on US, NATO"
  },
  {
    "id": 12960,
    "mediaId": 2746,
    "date": "2022-03-06",
    "sentence": "The bill would require jurisdictions to get “approval from unelected people in the Justice Department before changing its election process — that’s some scary stuff,” Rep. <span class='selected-term'>Jim Jordan</span>, Ohio Republican, said last August.",
    "author": "Kerry Picket",
    "title": "Harris compares Republicans to 1960s Alabama state troopers on ‘Bloody Sunday’"
  },
  {
    "id": 12697,
    "mediaId": 2866,
    "date": "2022-03-07",
    "sentence": "The bill would require jurisdictions to get “approval from unelected people in the Justice Department before changing its election process — that’s some scary stuff,” Rep. <span class='selected-term'>Jim Jordan</span>, Ohio Republican, said last August.",
    "author": "Fix This Nation Staff",
    "title": "Kamala Compares Republicans To 1960s Alabama State Troopers"
  },
  {
    "id": 9656,
    "mediaId": 2636,
    "date": "2022-03-27",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> of Ohio, dressed down in a fleece vest, stood in one corner while Representative Marjorie Taylor Greene of Georgia hustled in and out of the reception area.",
    "author": "",
    "title": "Elise Stefanik, Reinvented in Trump’s Image, Embodies a Changed G.O.P."
  },
  {
    "id": 9108,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "Other previously reported phone calls that did not show up on the White House logs include a phone call with Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), a heated exchange with House minority leader Kevin McCarthy (R-CA) and a conversation with Sen. Tommy Tuberville (R-AL).",
    "author": "Travis Gettys",
    "title": "Handwritten notes may reveal 'unknown person' in last Trump call before mysterious seven-hour gap"
  },
  {
    "id": 7497,
    "mediaId": 6512,
    "date": "2022-04-05",
    "sentence": "Many of Trump's Republican allies have continued to prompt such narrative about the Presidential Election 2020, namely Reps. <span class='selected-term'>Jim Jordan</span>, Jim Banks, Paul Gosar, and Marjorie Taylor Greene.",
    "author": "Mary Webber",
    "title": "Donald Trump Admits He Didn't Win Presidential Election 2020 During Interview With Presidential Historians"
  },
  {
    "id": 7456,
    "mediaId": 2562,
    "date": "2022-04-06",
    "sentence": "Trump Endorses Reps. Greene, Jordan for Reelection\n(Douglas P. DeFelice/Getty Images)\nBy Luca Cacciatore | Wednesday, 06 April 2022 09:42 PM\nFormer President Donald Trump continued his string of endorsements on Wednesday, announcing support for two of his most notable allies: Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "NationalWatch",
    "title": "Trump Endorses Reps. Greene, Jordan for Reelection"
  },
  {
    "id": 7408,
    "mediaId": 6676,
    "date": "2022-04-06",
    "sentence": "But many of Trump’s Republican allies in Congress, including Reps. <span class='selected-term'>Jim Jordan</span> (Ohio), Jim Banks (Ind.",
    "author": "Kelsey Carolan",
    "title": "Trump gets attention for saying he lost election"
  },
  {
    "id": 7278,
    "mediaId": 2641,
    "date": "2022-04-06",
    "sentence": "Former President Donald Trump continued his string of endorsements on Wednesday, announcing support for two of his most notable allies: Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Luca Cacciatore",
    "title": "Trump Endorses Reps. Greene, Jordan for Reelection"
  },
  {
    "id": 7778,
    "mediaId": 2618,
    "date": "2022-04-07",
    "sentence": "Former President Donald Trump endorsed Georgia’s first-term Rep. Marjorie Taylor Greene and Ohio Rep. <span class='selected-term'>Jim Jordan</span>, along with five other House Republicans who are up for reelection this November.",
    "author": "Heather Hamilton",
    "title": "Trump endorses ‘warrior’ Marjorie Taylor Greene and ‘fighter’ Jim Jordan"
  },
  {
    "id": 5397,
    "mediaId": 2594,
    "date": "2022-04-11",
    "sentence": "“Do you think it was a mistake for [House Republican Minority Leader] Kevin McCarthy to remove all of the Republicans on the January 6 committee once [Speaker Nancy] Pelosi took off [Illinois Representative] Jim Banks and [Ohio Representative] <span class='selected-term'>Jim Jordan</span>?” Mr Wong asked.",
    "author": "Gustaf Kilander",
    "title": "Marjorie Taylor Greene defends Jan 6 because it ‘only happened one time’ as she berates journalist on video"
  },
  {
    "id": 5449,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "Must See: Engelbrecht and Phillips on the Charlie Kirk Show on 2020 Fraud and “2000 Mules” – Cross-State Ballot Traffickers ID’ed – Brian Kemp Implicated – 1155 Ballot Traffickers in PA (Video)"
  },
  {
    "id": 5677,
    "mediaId": 2746,
    "date": "2022-04-22",
    "sentence": "Ohio protesters have also held demonstrations to keep Rep. <span class='selected-term'>Jim Jordan</span>, a Republican, off the ballot this year for the same reason, though little has come out of the effort in Ohio.",
    "author": "Mica Soellner",
    "title": "Marjorie Taylor Greene tells courtroom that she’s a ‘victim’ of the Jan. 6 riot"
  },
  {
    "id": 4863,
    "mediaId": 2679,
    "date": "2022-04-23",
    "sentence": "On a planning call that included Mark Meadows, White House chief of staff; Rudy Giuliani, Trump’s personal lawyer; Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio; and other Freedom Caucus members, the group discussed the idea of encouraging supporters to march to the Capitol, according to one witness’s account.",
    "author": "ALAN FEUER",
    "title": "Filing provides new details on Trump White House planning for Jan. 6"
  },
  {
    "id": 4921,
    "mediaId": 2862,
    "date": "2022-04-23",
    "sentence": "a request that the judge in the case issue a ruling without a full trial), Pelosi et al.’s lawyers pointed to the presence of high-profile Republican lawmakers among those who sat in meetings with the Republican president’s officials, either in person or by phone.Among the officials cited by the filing were Ohio Congressman <span class='selected-term'>Jim Jordan</span>, Florida Representative Matt Gaetz, and Pennsylvania Congressman Scott Perry.“Mr.",
    "author": "Ilya Tsukanov",
    "title": "January 6 Probe Deposition Accuses High Profile Republicans of Involvement in Trump ‘Coup’ Plot"
  }
]