[
  {
    "id": 3861,
    "mediaId": 2748,
    "date": "2022-01-24",
    "sentence": "",
    "author": "",
    "title": "Must See: Tucker SLAMS Kamala's Illegitimate Election Claims"
  },
  {
    "id": 973,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "Marsha Blackburn, Bill Hagerty, James Lankford and Marco Rubio; and Reps. Andy Biggs, Lauren Boebert, Ken Buck, Madison Cawthorn, Byron Donalds, Matt Gaetz, Jody Hice, Ronny Jackson, <span class='selected-term'>Jim Jordan</span>, Billy Long, Barry Loudermilk, Scott Perry and Greg Steube.",
    "author": "Jennifer Harper",
    "title": "Michele Tafoya leaves sports, jumps into politics"
  },
  {
    "id": 1015,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Laura Collins & Elizabeth Elkind &",
    "title": "Exclusive: Clinton cornered: Hillary refuses to answer questions about Durham revelation she paid to spy on the Trump campaign as she arrives at daughter Chelsea's Manhattan home ahead of the New York Democratic Convention"
  },
  {
    "id": 13228,
    "mediaId": 2548,
    "date": "2022-03-02",
    "sentence": "(RELATED: Rep. <span class='selected-term'>Jim Jordan</span> Says Biden Might Want To Change His Policies, But The ‘Radical Left’ In His Party Will Never Let Him)\nSanctioning Russian energy has gained bipartisan support from lawmakers, political commentators and elites.",
    "author": "Nicole Silverio",
    "title": "Gutfeld Says US Government Is ‘Acting Like White Knights’ As They Purchase Russian Oil"
  },
  {
    "id": 5286,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Emily Crane",
    "title": "NY, Calif. failed in handling of COVID — but Florida was among best: study"
  },
  {
    "id": 5449,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "Must See: Engelbrecht and Phillips on the Charlie Kirk Show on 2020 Fraud and “2000 Mules” – Cross-State Ballot Traffickers ID’ed – Brian Kemp Implicated – 1155 Ballot Traffickers in PA (Video)"
  },
  {
    "id": 5344,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "“I’m Defending the Right to Express Your Views Under the First Amendment” – Alan Dershowitz Speaks Out in Defense of J6er He Is Representing who Was Waved in to US Capitol (Video)"
  }
]