[
  {
    "id": 1843,
    "mediaId": 2578,
    "date": "2022-02-06",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 1, 2022\nA federal firearm registry is explicitly banned by law.",
    "author": "Mike LaChance",
    "title": "Democrats Are Quietly Building A Gun Registry As A First Step In Gun Ban"
  },
  {
    "id": 957,
    "mediaId": 2578,
    "date": "2022-02-11",
    "sentence": "Completely devoid of any ethics or integrity, Schiff was caught red-handed only weeks ago editing the text messages of former White House Chief of Staff Mark Meadows as well as Congressman <span class='selected-term'>Jim Jordan</span> in the January 6th Witch Hunt.",
    "author": "Joe Hoft",
    "title": "ROGER STONE EXCLUSIVE: Liar Adam Schiff Faces Challenge from Fiery Conservative Woman Attorney, Descendant of Slaves"
  },
  {
    "id": 979,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "https://t.co/gGZwcIiczZ\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 13, 2022\nSenator Marsha Blackburn of Tennessee accused Sullivan of a ‘conflict of interest’ in his current efforts trying to de-escalate with Moscow.",
    "author": "Joe Hoft",
    "title": "Republican Leaders Jim Jordan and Marsha Blackburn Raise Concerns with Jake Sullivan as Biden’s National Security Advisor"
  },
  {
    "id": 10942,
    "mediaId": 2578,
    "date": "2022-03-08",
    "sentence": "I was concerned that vocal proponents who exposed voter fraud like Matt Gaetz, <span class='selected-term'>Jim Jordan</span>, Ted Cruz, Paul Gosar, Andy Biggs, Louie Gohmert, Mo Brooks, Bernard Kerik and I would later be targeted.",
    "author": "Joe Hoft",
    "title": "EXCLUSIVE: Roger Stone Strikes Back at Washington Post Attack – Calls out Deep Fake Video"
  },
  {
    "id": 11121,
    "mediaId": 2578,
    "date": "2022-03-12",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) sent a letter to FBI Director Chris Wray on Wednesday regarding the investigation of the DC pipe bomber on January 5, 2021.",
    "author": "Jim Hoft",
    "title": "BREAKING: FBI Whistle-Blower Steps Forward to Reveal Secrets on DC Pipe Bombs to Jim Jordan – FBI Is Withholding Information"
  }
]