[
  {
    "id": 4219,
    "mediaId": 2605,
    "date": "2022-01-19",
    "sentence": "“And my guess is those who support it will regret it when people like [Ohio] Congressman <span class='selected-term'>Jim Jordan</span> get the gavel and then decide to use that same authority on them.”\nFor McCarthy, there’s little political incentive to appear before the committee.",
    "author": "Arit John",
    "title": "Will Jan. 6 committee subpoena McCarthy? Congress could set up a political and legal showdown"
  },
  {
    "id": 3254,
    "mediaId": 2528,
    "date": "2022-01-30",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, an Ohio Republican and Trump ally, also recently listed a slew of investigations he would launch into the Biden administration if Republicans take control of the House and he becomes chair of the House Judiciary Committee.",
    "author": "Alia Shoaib",
    "title": "Trump vows the GOP will investigate 'Biden corruption' if they retake Congress in the midterm elections"
  },
  {
    "id": 3058,
    "mediaId": 2572,
    "date": "2022-02-03",
    "sentence": "Why didn't they call up knowing large crowds were coming, knowing tensions were high, coming off a summer of rioting, how come they are not being brought into this sham committee to kick off <span class='selected-term'>Jim Jordan</span> and Jim Banks to put on the two biggest Republican Trump haters they could find?",
    "author": "",
    "title": "'Hannity' on Whoopi Goldberg's Holocaust remarks, Joe Rogan"
  },
  {
    "id": 2323,
    "mediaId": 2748,
    "date": "2022-02-04",
    "sentence": "On Tuesday, Republican Rep. <span class='selected-term'>Jim Jordan</span> of Ohio appeared on Just the News’ self-titled news show and mounted a strong defense of Trump throughout the first impeachment.",
    "author": "STATION GOSSIP",
    "title": "Email Hidden for 5 Years Declared Hunter Biden 'Undercut' US Efforts to Fight Ukraine Corruption - Report"
  },
  {
    "id": 2381,
    "mediaId": 2547,
    "date": "2022-02-07",
    "sentence": "",
    "author": "John Amato",
    "title": "Jim Jordan Is An Absurd Hypocrite, Part Infinity"
  },
  {
    "id": 1951,
    "mediaId": 2592,
    "date": "2022-02-09",
    "sentence": "Meanwhile Americans: pic.twitter.com/8VqnOPnTa7\nRep. Marjorie Taylor Greene (@RepMTG) February 9, 2022\nBiden is sending free meth & crack pipes to minority communities in the name of ‘racial equity’\nThere is no end in sight for this lunacy https://t.co/RLv6cAuLCt pic.twitter.com/WdlzOojkdF\nMarco Rubio (@marcorubio) February 8, 2022\n“Will you have to show your vaccine passport to get your crack pipe?” Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, posted on Twitter.",
    "author": "Maggie Valenti",
    "title": "Biden Enrages Conservatives By Supporting Harm Reduction With Safe Drug Kits"
  },
  {
    "id": 12542,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Zeke Miller",
    "title": "White House: Congress must act soon to replenish COVID funds"
  },
  {
    "id": 12492,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Joe Hoft",
    "title": "And There It Is: Biden Asks for Billions for COVID and Ukraine – Where Will This Money Really Go?"
  },
  {
    "id": 10871,
    "mediaId": 8484,
    "date": "2022-03-17",
    "sentence": "'Told ya,' Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, quipped on Twitter.",
    "author": "Morgan Phillips",
    "title": "'The cover-up may be an even bigger crime than the contents of Hunter's laptop': Trump's office and Republicans tear into 'Big Tech, the liberal media and Biden' after New York Times finally confirmed his son's laptop is real"
  },
  {
    "id": 10781,
    "mediaId": 2644,
    "date": "2022-03-18",
    "sentence": "Rep. Lauren Boebert (R-Colo.) raged on Twitter: “Now that the New York Times has even confirmed the Hunter Biden laptop’s veracity, can we begin to admit that Joe Biden is, by definition, a compromised politician?”\nMeanwhile, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) tweeted a link to a Post story on the Times’ confirmation, saying simply: “Told ya.”\nAnd the House Judiciary GOP linked the laptop scandal to claims by Democrats that former President Donald Trump colluded with Russia ahead of the 2016 presidential election.",
    "author": "Emily Crane",
    "title": "GOP fury at Big Tech, Dems after NYT admits Hunter Biden laptop is real"
  },
  {
    "id": 11464,
    "mediaId": 2861,
    "date": "2022-03-18",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) March 18, 2022\nYahoo reporter Michael Isikoff was mocked by conservatives for tweeting Thursday “In the category of – didn’t see this coming : The ?",
    "author": "",
    "title": "Rep. Jordan “Hunter Biden’s laptop was real. The emails were real. The eyewitness was real.”"
  },
  {
    "id": 9302,
    "mediaId": 2724,
    "date": "2022-03-22",
    "sentence": "“Let’s get to the facts, let’s figure out exactly how much Joe Biden knew about this,” Representative <span class='selected-term'>Jim Jordan</span> (R-OH) told Fox News at the time as he called for a special counsel investigation into the business dealings revealed by the discovery of the device.",
    "author": "Rusty Weiss",
    "title": "Bill Barr: Joe Biden ‘Lied To The American People’ About Hunter’s Laptop Being ‘Russian Disinformation’"
  },
  {
    "id": 9366,
    "mediaId": 2877,
    "date": "2022-03-23",
    "sentence": "But the Kremlin can.” —Congressman <span class='selected-term'>Jim Jordan</span>\nNon Compos Mentis Awards\n“I can’t.",
    "author": "Jordan Candler",
    "title": "Wednesday Short Cuts"
  },
  {
    "id": 9378,
    "mediaId": 2548,
    "date": "2022-03-25",
    "sentence": "(RELATED: ‘The News Was Fake’: Rep. <span class='selected-term'>Jim Jordan</span> Takes Shots The Media For Disavowing Hunter Biden’s Laptop)\n“I would like to announce on behalf of the American people, we have to make sure that our leaders are held accountable,” Greene said.",
    "author": "Nicole Silverio",
    "title": "Rep. Jim Jordan Says Republicans Need To Discuss Possible Impeachment Of Biden"
  },
  {
    "id": 9314,
    "mediaId": 2877,
    "date": "2022-03-25",
    "sentence": "You know — the committee that kicked Republican Congressmen <span class='selected-term'>Jim Jordan</span> and Jim Banks off of it because, as Pelosi put it, “With respect for the integrity of the investigation, with an insistence on the truth and with concern about statements made and actions taken by these Members, I must reject the recommendations of Representatives Banks and Jordan to the Select Committee.”\nYeah, because nothing says “integrity” and “truth” like a committee stacked with partisan hacks and liars.",
    "author": "",
    "title": "Top J6 Staffer Is a Russian Disinformationer"
  },
  {
    "id": 9408,
    "mediaId": 2642,
    "date": "2022-03-26",
    "sentence": "",
    "author": "Missy Crane",
    "title": "Richard Grenell Announces Big News On The Hunter Biden Saga"
  },
  {
    "id": 8927,
    "mediaId": 2526,
    "date": "2022-03-28",
    "sentence": "When it came to the National School Board Association letter, those were questions that I asked on the House Intelligence Committee that <span class='selected-term'>Jim Jordan</span> then followed up with on the Committee on the Judiciary really probing.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Elise Stefanik on Biden Family Subpoenas: ‘I Would Support Those’"
  },
  {
    "id": 9370,
    "mediaId": 2748,
    "date": "2022-03-29",
    "sentence": "When it came to the National School Board Association letter, those were questions that I asked on the House Intelligence Committee that <span class='selected-term'>Jim Jordan</span> then followed up with on the Committee on the Judiciary really probing.",
    "author": "Blarp Blog",
    "title": "Exclusive — Elise Stefanik on Biden Family Subpoenas: ‘I Would Support Those’"
  },
  {
    "id": 9679,
    "mediaId": 2626,
    "date": "2022-03-29",
    "sentence": "According to Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) the only thing fake about Hunter Biden’s laptop is that “fake news” that claimed that it was full of Russian disinformation.",
    "author": "Eric Scheiner",
    "title": "Rep. Jordan: Hunter’s Laptop Is Real - ‘Fake News’ Pushed ‘Total Garbage’"
  },
  {
    "id": 9328,
    "mediaId": 6449,
    "date": "2022-03-30",
    "sentence": "And I’m working with [Rep.] <span class='selected-term'>Jim Jordan</span> from the Judiciary Committee on draft legislation that would remove those Section 230 provisions for the larger companies and hold them accountable for a new set of rules, while protecting those liability protections for the smaller startups, the new innovators, the Parlers, the Gettr, the Truth media of the future.",
    "author": "Virginia Allen",
    "title": "Rep. Cathy McMorris Rodgers Targets Big Tech’s Censorship of Free Speech"
  },
  {
    "id": 9541,
    "mediaId": 2877,
    "date": "2022-03-31",
    "sentence": "Or it will be the story of how the people of the United States, the freest, most prosperous and successful nation in the history of the world, rallied around the truth the country was founded on and ushered in a century of liberty and justice and prosperity.” —Senator Marco Rubio\n“The Left will attack Ginni Thomas for exercising her political beliefs, but let Hunter Biden off the hook for his influence peddling.” —Congressman <span class='selected-term'>Jim Jordan</span>\nCOVID Swamp Doctor\n“I think the restrictions … certainly prevented a lot of infections, prevented a lot of hospitalizations, and prevented a lot of deaths.",
    "author": "Jordan Candler",
    "title": "Thursday Short Cuts"
  },
  {
    "id": 7766,
    "mediaId": 2563,
    "date": "2022-03-31",
    "sentence": "Congressman <span class='selected-term'>Jim Jordan</span> said, “the mainstream press, along with Big Tech and Democrats, all colluded to keep this important information from the American people just days before our most important election, the presidential election.” That about sums it up.",
    "author": "The Daily Skirmish - Liberato.US",
    "title": "The ‘Laptop from Hell’ Burns Our Devilish Elites"
  },
  {
    "id": 7477,
    "mediaId": 2548,
    "date": "2022-03-31",
    "sentence": "In this episode, Vince and Jason sit down with Ohio Republican Representative <span class='selected-term'>Jim Jordan</span> to discuss invoking the 25th amendment on Joe Biden, Trump vs. Biden on the border and inflation crises’, and some extreme Hunter Biden drama.",
    "author": "",
    "title": "Invoking The 25th Amendment & Hunter Biden Drama | Guest Rep. Jim Jordan | Vince & Jason Save The Nation"
  },
  {
    "id": 7130,
    "mediaId": 2631,
    "date": "2022-03-31",
    "sentence": "Everybody’s concerned about that story,” said Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, a Trump loyalist who is likely to chair the Judiciary Committee if Republicans win the House back in November.",
    "author": "",
    "title": "Republicans squirm as Trump presses Putin for dirt on Bidens"
  },
  {
    "id": 7156,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Thursday that if Republicans take back the House this year, they will answer the two \"why\" questions on the Hunter Biden laptop story.",
    "author": "Luca Cacciatore",
    "title": "Rep. Jim Jordan: Big Tech, Big Media Colluded to Censor Hunter Biden Story"
  },
  {
    "id": 7383,
    "mediaId": 2662,
    "date": "2022-03-31",
    "sentence": "“Big Tech, Big Democrat Party and Big Media all colluded to keep critical information from the American people in the run up to the most important election we have — the presidential election, so we’re launching an investigation,” <span class='selected-term'>Jim Jordan</span> said.",
    "author": "Cristina Laila",
    "title": "House Judiciary Republicans Launch Investigation Into Facebook and Twitter For Blocking Links to Hunter Biden’s Laptop From Hell Story"
  },
  {
    "id": 7243,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "In letters posted on Twitter, 10 Republicans, led by Rep. <span class='selected-term'>Jim Jordan</span>, the ranking member of the House Judiciary Committee, wrote to Facebook CEO Mark Zuckerberg and Parag Agrawal, Twitter's CEO.",
    "author": "Jeffrey Rodack",
    "title": "House Republicans Probing Big Tech 'Suppression' of Hunter Biden Laptop Story"
  },
  {
    "id": 7242,
    "mediaId": 2557,
    "date": "2022-03-31",
    "sentence": "“Big Tech, Big Democrat Party, and Big Media all colluded to keep critical information from the American people in the run-up to the most important election we have, the presidential election, so we’re launching an investigation,” said Ranking Member <span class='selected-term'>Jim Jordan</span> (R-OH) Thursday on Fox Business.",
    "author": "DML News App",
    "title": "NEWS ALERT: Judiciary GOP Investigating Facebook, Twitter for Suppressing Hunter Laptop"
  },
  {
    "id": 7216,
    "mediaId": 2641,
    "date": "2022-04-01",
    "sentence": "His comments come after 10 committee Republicans, led by ranking member Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, wrote to Twitter CEO Parag Agrawal and Facebook CEO Mark Zuckerberg, quoting a 2020 article from The New York Post about Hunter Biden's laptop and noting that mainstream outlets like The Washington Post, The New York Times and others are now reporting on the matter.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Steube to Newsmax: GOP Will Win, Subpoena Big Tech on Hunter Biden"
  },
  {
    "id": 7208,
    "mediaId": 2562,
    "date": "2022-04-01",
    "sentence": "OAN Newsroom\nUPDATED 1:11 PM PT – Friday, April 1, 2022\nCongressman <span class='selected-term'>Jim Jordan</span> (R-Ohio) said House Judiciary Committee Republicans have launched a probe into claims Facebook and Twitter suppressed information about the contents of Hunter Biden’s laptop.",
    "author": "NationalWatch",
    "title": "Rep. Jordan on Hunter Biden laptop: There was a conspiracy to keep information from American people"
  },
  {
    "id": 7483,
    "mediaId": 2645,
    "date": "2022-04-01",
    "sentence": "OAN Newsroom\nCongressman <span class='selected-term'>Jim Jordan</span> (R-Ohio) said House Judiciary Committee Republicans have launched a probe into claims Facebook and Twitter suppressed information about the contents of Hunter Biden’s laptop.",
    "author": "",
    "title": "Rep. Jordan on Hunter Biden laptop: There was a conspiracy to keep information from American people"
  },
  {
    "id": 7420,
    "mediaId": 2766,
    "date": "2022-04-01",
    "sentence": "Signing the letter were Reps. <span class='selected-term'>Jim Jordan</span>, Steve Chabot, Louie Gohmert, Darrell Issa, Ken Buck, Matt Gaetz, Mike Johnson, Andy Biggs, Tom McClintock, W. Gregory Steube and others.",
    "author": "Bob Unruh",
    "title": "GOP Launches Review Of Facebook’s Censorship Of Hunter Biden Scandal"
  },
  {
    "id": 7725,
    "mediaId": 2833,
    "date": "2022-04-02",
    "sentence": "The letter concludes, “This irresponsible conduct demands a thorough investigation so that we may understand how Big Tech wields its enormous power over the free flow of information to the detriment of free and fair elections.”\nAppearing on Fox Business Thursday, ranking GOP Rep <span class='selected-term'>Jim Jordan</span> declared that “Big Tech, Big Democrat Party and Big Media all colluded to keep critical information from the American people in the run up to the most important election we have — the presidential election, so we’re launching an investigation.”\nWatch:",
    "author": "Sean Adl-Tabatabai",
    "title": "Congress Launches Investigation Into Facebook & Twitter for Censoring Hunter Biden Pedophile Story"
  },
  {
    "id": 7139,
    "mediaId": 2557,
    "date": "2022-04-03",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) April 1, 2022\nThe Media Research Center pointed out that none of the “fact-checkers” on social media have updated their “checks” on the Hunter Biden laptop scandal.",
    "author": "DML News App",
    "title": "REPORT: Republicans take victory lap after media confirms Hunter Biden laptop"
  },
  {
    "id": 7877,
    "mediaId": 2548,
    "date": "2022-04-03",
    "sentence": "(RELATED: ‘The News Was Fake’: Rep. <span class='selected-term'>Jim Jordan</span> Takes Shots At The Media For Disavowing Hunter Biden’s Laptop)\nA grand jury in Delaware is in the midst of investigating possible tax violations, money laundering and foreign lobbying.",
    "author": "Nicole Silverio",
    "title": "‘Had It Wrong’: Chris Christie Calls Out The New York Times And Washington Post Over Misreporting Hunter Biden’s Laptop"
  },
  {
    "id": 7056,
    "mediaId": 2572,
    "date": "2022-04-04",
    "sentence": "REP. DONALDS CALLS FOR HUNTER BIDEN SPECIAL COUNSEL TO INVESTIGATE ‘CORRUPTION’ IN WHITE HOUSE\nREP. <span class='selected-term'>JIM JORDAN</span>: Well, we all know they colluded 18 months ago to keep this information from the American people in the run-up to our most important election, the presidential election.",
    "author": "Fox News Staff",
    "title": "Jim Jordan torches media's Hunter Biden blackout in 2020: 'Only thing fake was the news'"
  },
  {
    "id": 7601,
    "mediaId": 2818,
    "date": "2022-04-05",
    "sentence": "We know he took millions of dollars from energy companies in Ukraine and millions of dollars from companies in China with ties to the Chinese Communist Party,” said Congressman <span class='selected-term'>Jim Jordan</span>.",
    "author": "The First",
    "title": "JORDAN: Hunter Biden ‘Took Millions of Dollars’ from Moscow, Ukraine, Chinese Communists"
  },
  {
    "id": 7958,
    "mediaId": 2600,
    "date": "2022-04-05",
    "sentence": "",
    "author": "IWB",
    "title": "Jim Jordan comes out hot… FBI needs to answer on Hunter Biden coverup…"
  },
  {
    "id": 7068,
    "mediaId": 2572,
    "date": "2022-04-05",
    "sentence": "\"<span class='selected-term'>Jim Jordan</span>, my colleagues and I are ready to see this through to the end.\"",
    "author": "Andrew Mark Miller",
    "title": "House Republicans send letter to Hunter Biden law firm seeking preservation of records"
  },
  {
    "id": 7951,
    "mediaId": 2645,
    "date": "2022-04-06",
    "sentence": "OAN Newsroom\nCongressman <span class='selected-term'>Jim Jordan</span> (R-Ohio) said he has seen an “interesting progression” in how the media is treating the Hunter Biden laptop story.",
    "author": "",
    "title": "Rep. Jordan sees interesting progression of media treatment of Hunter Biden"
  },
  {
    "id": 7602,
    "mediaId": 2744,
    "date": "2022-04-06",
    "sentence": "House Judiciary Committee Republicans, led by Rep. <span class='selected-term'>Jim Jordan</span>, sent letters to each signatory, asking them to “identify all people with whom you communicated about the inception, drafting, editing, signing, publishing, or promotion” of the ex-intelligence officials' letter and directing them to “produce all documents and communications referring or relating to” the public statement.",
    "author": "Jerry Dunleavy",
    "title": "House GOP demand records from ex-intel officials about Hunter Biden laptop letter"
  },
  {
    "id": 7089,
    "mediaId": 2572,
    "date": "2022-04-06",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> said the media peddled fake news about the Bidens as it claimed the Hunter Biden laptop story was \"Russian disinformation\" on \"The Ingraham Angle\" Tuesday.",
    "author": "Hannah Grossman",
    "title": "Jim Jordan on Hunter laptop story: The only thing fake 18 months ago was the news"
  },
  {
    "id": 7233,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, who will chair the powerful House Judiciary Committee if Republicans regain control of the House in this year's elections, told Newsmax there will be a \"number of things\" that will come under investigation, including the details behind the discoveries being made about President Joe Biden's son Hunter and the moves to cover up details about his laptop and actions during the 2020 election.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Jordan to Newsmax: GOP Will Investigate Hunter Biden If House Is Won"
  },
  {
    "id": 6057,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> said on Sunday it \"sure seems\" the president's son is on his way to being indicted, though the congressman acknowledged he could not say for certain.",
    "author": "Daniel Chaitin",
    "title": "'Something is up': Jim Jordan spots major shift in Hunter Biden story"
  },
  {
    "id": 6023,
    "mediaId": 2671,
    "date": "2022-04-10",
    "sentence": "Bartiromo had Rep. <span class='selected-term'>Jim Jordan</span> on air this morning, and the two of them delivered maybe the best segment on Hunter Biden and the laptop and Joe Biden complicity that I’ve seen on TV news.",
    "author": "Fred T",
    "title": "MUST SEE: Maria Bartiromo & Jim Jordan DESTROY Dem/Media collusion on Hunter Biden, SLAP Chris Wallace for good measure"
  },
  {
    "id": 6010,
    "mediaId": 2671,
    "date": "2022-04-10",
    "sentence": "Earlier y’all saw her absolutely stellar story on Hunter Biden and interview with <span class='selected-term'>Jim Jordan</span>.",
    "author": "Fred T",
    "title": "WATCH: Kevin McCarthy signals on Fox there’s NO impeachment ahead if GOP takes House."
  },
  {
    "id": 5746,
    "mediaId": 2644,
    "date": "2022-04-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> said The Post’s story revealing how Hunter Biden covered expenses for his president dad shows how “involved” Joe Biden was in his son’s shady business dealings.",
    "author": "Mark Moore",
    "title": "GOP Rep. Jordan: Hunter Biden’s text messages ‘tie in the entire family’"
  },
  {
    "id": 5267,
    "mediaId": 2562,
    "date": "2022-04-10",
    "sentence": "(Spencer Platt/Getty Images)\nBy Sandy Fitzgerald | Sunday, 10 April 2022 01:41 PM\nThe left may be dismissing reports concerning Hunter Biden's old laptop as being conspiracy theories, but the real conspiracy was big tech and big media \"keeping this story from the American people just days before the most important election we have, the election for president of the United States,\" Rep. <span class='selected-term'>Jim Jordan</span> insisted Sunday.",
    "author": "NationalWatch",
    "title": "Rep. Jim Jordan: Tech, Media, Intel Officers Staged Laptop Conspiracy"
  },
  {
    "id": 5234,
    "mediaId": 2641,
    "date": "2022-04-10",
    "sentence": "The left may be dismissing reports concerning Hunter Biden's old laptop as being conspiracy theories, but the real conspiracy was big tech and big media \"keeping this story from the American people just days before the most important election we have, the election for president of the United States,\" Rep. <span class='selected-term'>Jim Jordan</span> insisted Sunday.",
    "author": "Sandy Fitzgerald",
    "title": "Rep. Jim Jordan: Tech, Media, Intel Officers Staged Laptop Conspiracy"
  },
  {
    "id": 5751,
    "mediaId": 2681,
    "date": "2022-04-11",
    "sentence": "Top House Republican <span class='selected-term'>Jim Jordan</span> said on Sunday he thinks “something is up” with the MSM’s recent flip-flop on the Hunter Biden laptop story – which was originally branded as Russian disinformation right before the 2020 US election, only to be validated as authentic in recent weeks amid a grand jury investigation into the First Son.",
    "author": "",
    "title": "“Something Is Up”: Rep. Jim Jordan Suggests Hunter Biden Indictment Could Be Coming"
  },
  {
    "id": 5740,
    "mediaId": 2522,
    "date": "2022-04-12",
    "sentence": "SIGN UP HERE\n(Video: Fox News)\nRep. <span class='selected-term'>Jim Jordan</span> (R-OH) joined Fox News’ “Fox and Friends” Tuesday and said he believes President Joe Biden was most certainly involved in his son Hunter’s business dealings with foreign entities though the president predictably continues to deny it.",
    "author": "Frank Webster",
    "title": "Jim Jordan vows to expose Joe’s role in corrupt Biden ‘family enterprise’"
  },
  {
    "id": 5847,
    "mediaId": 2690,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Admin Dee",
    "title": "CHILLS: Jim Jordan EXPOSES what Hunter Biden’s laptop is REALLY about"
  },
  {
    "id": 5876,
    "mediaId": 2690,
    "date": "2022-04-12",
    "sentence": "(TeaParty.org Exclusive) – Top House GOP member <span class='selected-term'>Jim Jordan</span> stated over the weekend that he believes “something is up” with the MSM’s flip-flopping concerning the Hunter Biden laptop story, which the radical left all referred to as “Russian disinformation” just before the 2020 presidential election, only to be confirmed to be authentic as a grand jury continues to investigate the youngest son of Joe Biden.",
    "author": "",
    "title": "‘Something Is Up’: Top House Republican Suggests Hunter Biden Indictment Could Be Coming"
  },
  {
    "id": 5268,
    "mediaId": 2618,
    "date": "2022-04-12",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) joined Fox News’ “Fox and Friends” Tuesday and said he believes President Joe Biden was most certainly involved in his son Hunter’s business dealings with foreign entities though the president predictably continues to deny it.His statement comes on the heels of a House Oversight Committee’s call for further investigation into the text messages allegedly stored on Hunter Biden’s infamous laptop that was abandoned to a Wilmington, DE, repair shop in 2019.",
    "author": "Frank Webster",
    "title": "Jim Jordan vows to expose Joe’s role in corrupt Biden ‘family enterprise’"
  },
  {
    "id": 5272,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Josh Boswell",
    "title": "Exclusive: 'Hunter is a grifter!' Senator Ron Johnson SLAMS President's son for running up Secret Service costs after DailyMail.com revealed agents' $30k-a-month Malibu mansion and trip with his wife to Brazil"
  },
  {
    "id": 5765,
    "mediaId": 6687,
    "date": "2022-04-15",
    "sentence": "“Well, that didn’t happen, so now the United States can look into it when the Republicans take over and have a special counsel to get to the bottom of it.”\nThe candidate was joined by U.S. Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) during the interview, who endorsed Wardynski earlier this week.",
    "author": "Yaffee",
    "title": "AL-5 candidate Casey Wardynski: We need a ‘special counsel to get to the bottom of’ Hunter Biden’s emails"
  },
  {
    "id": 5583,
    "mediaId": 2553,
    "date": "2022-04-20",
    "sentence": "Maybe Obama will beat Special Counsel John Durham to the punch by revealing the truth behind the phony Steele Dossier, the Clinton campaign’s role in the entire affair, and divulging details of who else was involved in what appears to be a cover-up and scandal involving allegations that were, as Congressman <span class='selected-term'>Jim Jordan</span> (R-OH) said on Monday, “it was made up.”\nAt the very least, Obama could apologize to former Trump campaign advisor Carter Page for the fact that FBI agents made “serious errors” that allowed the FISA court to grant the DOJ permission to spy on Page.",
    "author": "Tim Meads",
    "title": "Obama’s Warning About Disinformation Again. Let’s Take A Look At Some Examples, Shall We?"
  },
  {
    "id": 5340,
    "mediaId": 2641,
    "date": "2022-04-21",
    "sentence": "Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Andy Biggs, R-Ariz., were among the letter's signatories.",
    "author": "Eric Mack",
    "title": "House GOP Asks If Hunter Biden Ties Spared Rich Russian From Sanctions"
  },
  {
    "id": 5754,
    "mediaId": 2562,
    "date": "2022-04-21",
    "sentence": "Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Andy Biggs, R-Ariz., were among the letter's signatories.",
    "author": "NationalWatch",
    "title": "House GOP Asks Why Late Moscow Mayor’s Wife Not Sanctioned"
  }
]