[
  {
    "id": 2081,
    "mediaId": 2636,
    "date": "2022-02-07",
    "sentence": "Another Republican from Ohio, Representative <span class='selected-term'>Jim Jordan</span>, who claims that Dr. Fauci knew the coronavirus “came from a lab,” has vowed that Republicans will investigate him if they win control of the House.",
    "author": "",
    "title": "Republicans, Wooing Trump Voters, Make Fauci Their Boogeyman"
  },
  {
    "id": 2411,
    "mediaId": 2679,
    "date": "2022-02-07",
    "sentence": "Another Republican from Ohio, Rep. <span class='selected-term'>Jim Jordan</span>, who claims that Fauci knew the coronavirus “came from a lab,” has vowed that Republicans will investigate him if they win control of the House.",
    "author": "SHERYL GAY STOLBERG",
    "title": "Republicans, wooing Trump voters, make Fauci their boogeyman"
  },
  {
    "id": 11811,
    "mediaId": 8491,
    "date": "2022-03-22",
    "sentence": "“Fighters like Ted Cruz, <span class='selected-term'>Jim Jordan</span>, and Donald Trump.”\nVance, who was a Trump critic during the 2016 election cycle, said his past remarks were “stupid” and Trump was “the greatest president of my lifetime.”\nTimken lauded her work for Trump’s 2020 campaign as state GOP chair speaking at rallies, writing op-eds, and putting 150,000 miles on her car, and Gibbons mentioned his fundraising efforts for Trump in 2016.",
    "author": "Ben Orner",
    "title": "Gas prices, Ukraine and Trump: Ohio GOP Senate field debates issues in primetime"
  },
  {
    "id": 11713,
    "mediaId": 8480,
    "date": "2022-03-22",
    "sentence": "“Fighters like Ted Cruz, <span class='selected-term'>Jim Jordan</span>, and Donald Trump.”\nVance, who was a Trump critic during the 2016 election cycle, said his past remarks were “stupid” and Trump was “the greatest president of my lifetime.”\nTimken lauded her work for Trump’s 2020 campaign as state GOP chair speaking at rallies, writing op-eds, and putting 150,000 miles on her car, and Gibbons mentioned his fundraising efforts for Trump in 2016.",
    "author": "Ben Orner",
    "title": "Gas prices, Ukraine and Trump: Ohio GOP Senate field debates issues in primetime"
  },
  {
    "id": 6080,
    "mediaId": 2621,
    "date": "2022-04-14",
    "sentence": "From the report:\n‘The Mandel people hit the roof,’ one Republican with knowledge of the discussions told NBC News, noting that Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span> tried to dissuade Trump on behalf of Mandel, whom the congressman supports.",
    "author": "Ken Meyer",
    "title": "Trump Reportedly Plans to Endorse J.D. Vance in Crucial Ohio Senate Race"
  },
  {
    "id": 6064,
    "mediaId": 2688,
    "date": "2022-04-14",
    "sentence": "The source noted that Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), one of Trump’s staunchest allies in Congress, tried to warn the former president against backing Vance on behalf of Mandel, whom Jordan supports.",
    "author": "Matt Shuham",
    "title": "Trump Set To Endorse JD Vance After Ohio GOPer Spent Months Repenting For Anti-Trump Past"
  }
]