[
  {
    "id": 2043,
    "mediaId": 2740,
    "date": "2022-02-08",
    "sentence": "Ohio Rep. <span class='selected-term'>Jim Jordan</span>, who now serves as the lead Republican on the House Judiciary Committee, fumed that “Hillary Clinton gets treated different than anybody else.” Another member of the panel stated, “This is the reason for this hearing – the sloppiness, the messiness, and the ability for a secretary of State to do something that shouldn’t have been done.” Another Republican weighed in, “I want to know about the destruction – the hammering of BlackBerrys.” The panel’s chairman at the time, Jason Chaffetz, who can now be seen espousing self-righteous nonsense of Fox News, attacked Clinton, “The secretary had a choice.",
    "author": "Kurt Bardella",
    "title": "The 'but Hillary’s emails' crowd goes silent about Trump’s document destruction"
  },
  {
    "id": 2445,
    "mediaId": 2707,
    "date": "2022-02-09",
    "sentence": "",
    "author": "The Associated Press",
    "title": "Jan. 6 committee subpoenas ex-Trump adviser Navarro"
  },
  {
    "id": 2232,
    "mediaId": 2523,
    "date": "2022-02-09",
    "sentence": "",
    "author": "The Associated Press",
    "title": "Jan. 6 committee subpoenas ex-Trump adviser Navarro"
  },
  {
    "id": 12742,
    "mediaId": 2547,
    "date": "2022-03-04",
    "sentence": "But WHY did he want pardons for <span class='selected-term'>Jim Jordan</span> and Josh Hawley?",
    "author": "Frances Langum",
    "title": "Roger Stone Cusses Out Trump On Inauguration Day Over Lack Of Pardon"
  },
  {
    "id": 12961,
    "mediaId": 2584,
    "date": "2022-03-04",
    "sentence": "Discussing a plan in which Trump would issue a blanket pardon to co-conspirators in the attempt to overturn the election, Senator Ted Cruz and congressman <span class='selected-term'>Jim Jordan</span> among them.",
    "author": "Martin Pengelly",
    "title": "Roger Stone raged at ‘disgrace’ Trump over failure to overturn election – report"
  },
  {
    "id": 9034,
    "mediaId": 8484,
    "date": "2022-03-25",
    "sentence": "She also took aim at Republican lawmakers who refused to support Trump, as evidenced by a message seemingly referencing GOP Reps. Louie Gohmert of Texas, <span class='selected-term'>Jim Jordan</span> of Ohio, Paul A. Gosar of Arizona and Chip Roy of Texas.",
    "author": "Morgan Phillips",
    "title": "Supreme Court justice Clarence Thomas, 73, is discharged from hospital a week after he was admitted for 'flu-like symptoms' and treated with antibiotics for an infection"
  },
  {
    "id": 9406,
    "mediaId": 2509,
    "date": "2022-03-29",
    "sentence": "Trump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other lawmakers.",
    "author": "MARY CLARE JALONICK",
    "title": "8-hour gap in Trump's Jan. 6 White House phone records"
  },
  {
    "id": 7108,
    "mediaId": 2644,
    "date": "2022-04-07",
    "sentence": "Trump confirmed that he spoke with House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and multiple other people, adding that he has a “very good memory.”\nPublic reports also reveal that Trump accidentally called Sen. Mike Lee (R-Utah), believing he was contacting Sen. Tommy Tuberville (R-Ala.), during the call log gap.",
    "author": "Callie Patteson",
    "title": "Trump blasts Jan. 6 panel’s 8-hour questioning of Ivanka as ‘harassment’"
  },
  {
    "id": 7415,
    "mediaId": 2685,
    "date": "2022-04-07",
    "sentence": "Trump said that he remembered talking to House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and other people during that period.",
    "author": "Josh Dawsey Washington Post",
    "title": "Trump deflects blame for Jan. 6 silence, says he wanted to march to Capitol"
  },
  {
    "id": 7751,
    "mediaId": 2713,
    "date": "2022-04-07",
    "sentence": "Trump said that he remembered talking to House Minority Leader Kevin McCarthy, Republican <span class='selected-term'>Jim Jordan</span> and other people during that period.",
    "author": "Josh Dawsey",
    "title": "Trump deflects blame for January 6 silence, says he wanted to march to Capitol"
  },
  {
    "id": 7695,
    "mediaId": 2634,
    "date": "2022-04-08",
    "sentence": "Other Trump allies, like Congressmen <span class='selected-term'>Jim Jordan</span> and Scott Perry, have refused the committee’s invitation to sit down for interviews.",
    "author": "Daniel Strauss",
    "title": "January 6 Recap: Exactly What Did Ivanka Trump Talk About for Eight Long Hours?"
  },
  {
    "id": 7929,
    "mediaId": 2696,
    "date": "2022-04-08",
    "sentence": "Trump said that he remembered talking to House Minority Leader Kevin McCarthy, R-Calif., Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and other people during that period.",
    "author": "David Epstein",
    "title": "Trump deflects blame for Jan. 6 silence, says he wanted to march to Capitol"
  },
  {
    "id": 5341,
    "mediaId": 2550,
    "date": "2022-04-19",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> was elevated to omnipresence when he was exposed as one of the many, many athletic coaches in America who knew his athletes were being sexually molested and worked to cover it up.",
    "author": "Hunter\nDaily Kos Staff",
    "title": "'Libs of TikTok' founder exposed: Surprise, it's just another"
  }
]