[
  {
    "id": 9127,
    "mediaId": 2557,
    "date": "2022-03-27",
    "sentence": "Full stop.” pic.twitter.com/KDL1r3BmDV\n— The Recount (@therecount) March 27, 2022\nRepublican Rep. <span class='selected-term'>Jim Jordan</span> said Biden’s speech in Poland Saturday night was “more than confusing, it’s dangerous.”\n“Here’s the president potentially having more war-triggering type language than probably any president in American,” Jordan warned.",
    "author": "DML News App",
    "title": "WATCH: World leader joins lawmakers scolding Biden for escalating tensions with Russia"
  },
  {
    "id": 9042,
    "mediaId": 2557,
    "date": "2022-03-28",
    "sentence": "Full stop.” pic.twitter.com/KDL1r3BmDV\n— The Recount (@therecount) March 27, 2022\nRepublican Rep. <span class='selected-term'>Jim Jordan</span> said Biden’s speech in Poland Saturday night was “more than confusing, it’s dangerous.”\n“Here’s the president potentially having more war-triggering type language than probably any president in American,” Jordan warned.",
    "author": "DML News App",
    "title": "BREAKING: Biden: ‘I’m not walking anything back’ on whether Putin should be in power"
  },
  {
    "id": 7731,
    "mediaId": 4024,
    "date": "2022-04-05",
    "sentence": "In light of the refusal of the D.C. police to investigate potential violations of federal law, the Republican lawmakers wrote in their letter, according to The Daily Wire, that they “demand that a thorough investigation is conducted into the death of each child.” They added that “in order to accomplish such [an] investigation, we request and fully expect the city to preserve all of the children’s remains as evidence and conduct autopsies.”\nLed by James Lankford of Oklahoma and <span class='selected-term'>Jim Jordan</span> of Ohio, the letter also was signed by Thom Tillis of North Carolina, James Risch of Idaho, Mike Braun of Indiana, Jim Inhofe of Oklahoma, Roger Marshall of Kansas, Josh Hawley of Missouri, and Mike Crapo of Idaho.",
    "author": "",
    "title": "US lawmakers call for DC mayor, Dept. of Justice to investigate abortions of late-term babies"
  }
]