[
  {
    "id": 2265,
    "mediaId": 2550,
    "date": "2022-02-04",
    "sentence": "pic.twitter.com/lyPMbe5WbF\n— Joel Lawson (@JoelLawsonDC) July 27, 2021\nJust a day later, <span class='selected-term'>Jim Jordan</span> was pressed again by another reporter about whether or not he spoke to Trump on Jan. 6 and more specifically, when.",
    "author": "",
    "title": "White House Jan. 6 call log confirms what Jim Jordan"
  },
  {
    "id": 2629,
    "mediaId": 2594,
    "date": "2022-02-04",
    "sentence": "The House select committee investigating the riot on January 6 obtained documents showing that former presidentDonald Trump spoke with arch-conservative Rep <span class='selected-term'>Jim Jordan</span> for 10 minutes the morning of the insurrection, CNN reported.",
    "author": "Eric Garcia",
    "title": "Trump and Jim Jordan spoke for 10 minutes on the morning of Jan 6, new documents reveal"
  },
  {
    "id": 1822,
    "mediaId": 2643,
    "date": "2022-02-05",
    "sentence": "Representative Jim McGovern, a Massachusetts Democrat, has suggested that Representative <span class='selected-term'>Jim Jordan</span>, an Ohio Republican, may be \"trying to hide\" something after a report this week revealed phone records show that the GOP congressman spoke with former President Donald Trump for about 10 minutes on the morning of January 6, 2021.",
    "author": "Jason Lemon",
    "title": "Jim Jordan 'Trying to Hide' Something on 1/6 Trump Call, Suggests McGovern"
  },
  {
    "id": 1812,
    "mediaId": 2643,
    "date": "2022-02-06",
    "sentence": "Attorney Neal Katyal, who previously served as principal deputy solicitor general and acting solicitor general for the Justice Department, said that former President Donald Trump, Representative <span class='selected-term'>Jim Jordan</span> and Trump allies are utilizing \"bad mob tactics\" in response to the House select committee investigating the January 6, 2021 attack against the U.S. Capitol.",
    "author": "Jason Lemon",
    "title": "Trump, Jordan Using 'Bad Mob Tactics' in Face of 1/6 Probe: Ex-DOJ Official"
  },
  {
    "id": 2133,
    "mediaId": 2512,
    "date": "2022-02-06",
    "sentence": "Why has <span class='selected-term'>Jim Jordan</span> wanted to pretend that pre-attack call didn't happen?https://www.cnn.com/2022/02/04/politics/jim-jordan-trump-january-6/index.html\\u00a0\\u2026\n— Bill Kristol (@Bill Kristol) 1644001901\nJust a casual 10-minute chat with the president on the morning of the insurrection.",
    "author": "Meaghan Ellis",
    "title": "'A lot of explaining to do': Jim Jordan slammed on Twitter for contradictory remarks about 1/6 call to Trump"
  },
  {
    "id": 1905,
    "mediaId": 2664,
    "date": "2022-02-06",
    "sentence": "Why has <span class='selected-term'>Jim Jordan</span> wanted to pretend that pre-attack call didn't happen?https://www.cnn.com/2022/02/04/politics/jim-jordan-trump-january-6/index.html\\u00a0\\u2026\n— Bill Kristol (@Bill Kristol) 1644001901\nSpeaking to CNN, former U.S. Attorney and Deputy Assistant Attorney General Harry Litman also echoed McGovern's concerns as he agreed that the damning phone call may be \"a big piece of evidence.\"",
    "author": "Meaghan Ellis",
    "title": "'A lot of explaining to do': Jim Jordan slammed for contradictory remarks about 1/6 call to Trump"
  },
  {
    "id": 418,
    "mediaId": 2643,
    "date": "2022-02-20",
    "sentence": "Protestors in Ohio rallied outside of GOP Representative <span class='selected-term'>Jim Jordan</span>'s local office, urging the secretary of state to remove him from the ballot and prevent him from seeking another term in Congress.",
    "author": "Jason Lemon",
    "title": "Jim Jordan Should Be Disqualified From Ballot Over Jan. 6: Protestors"
  }
]