[
  {
    "id": 4310,
    "mediaId": 2745,
    "date": "2022-01-24",
    "sentence": "When the House decided to impanel a committee anyway, McCarthy proposed staffing it with people like Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), a Trump ally.",
    "author": "",
    "title": "The Jan. 6 probe gets the ‘Russia hoax’ treatment"
  },
  {
    "id": 1906,
    "mediaId": 2746,
    "date": "2022-02-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, Ohio Republican, defended arbitration as a cheaper, quicker alternative to litigation, which could limit victims from directly talking about their experiences.",
    "author": "Mica Soellner",
    "title": "Congress passes bipartisan bill ending forced arbitration in sexual misconduct cases"
  },
  {
    "id": 111,
    "mediaId": 2550,
    "date": "2022-02-24",
    "sentence": "Jim Banks of Indiana, Rep. Vern Buchanan of Florida, Rep. Mike Carey of Ohio, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, Rep. Debbie Lesko of Arizona, Rep. Mary Miller of Illinois, Rep. Mike Waltz of Florida, Sen. Marsha Blackburn of Tennessee, Sen. Ted Cruz of Texas, and Sen. Lindsey Graham of South Carolina—should definitely be getting questions about what conversations they had with Trump about the issue and how they felt about being at an event that boosted his stature in the Republican Party and was sandwiched between times he praised Putin for invading Ukraine.",
    "author": "Laura Clawson",
    "title": "Republicans don't want to talk about Trump calling Putin 'smart.' Time for the media to make them"
  },
  {
    "id": 8915,
    "mediaId": 2526,
    "date": "2022-03-29",
    "sentence": "GOP leader Rep. Kevin McCarthy (R-CA) has called the JCPA “the antithesis of conservatism,” while Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) has warned it would give the media “cartel power.”\nSens.",
    "author": "Allum Bokhari",
    "title": "Lindsey Graham Backs Democrat Led Bailout for Corporate Media"
  },
  {
    "id": 7130,
    "mediaId": 2631,
    "date": "2022-03-31",
    "sentence": "Everybody’s concerned about that story,” said Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, a Trump loyalist who is likely to chair the Judiciary Committee if Republicans win the House back in November.",
    "author": "",
    "title": "Republicans squirm as Trump presses Putin for dirt on Bidens"
  },
  {
    "id": 7733,
    "mediaId": 2650,
    "date": "2022-04-02",
    "sentence": "The thinking: It will be much easier to blunt the RINO impulse with <span class='selected-term'>Jim Jordan</span> as Speaker and somebody like Marsha Blackburn helming the Senate.",
    "author": "Mark Ellis",
    "title": "Is Conservative Commentary Getting Too Cocky About the Midterms?"
  }
]