[
  {
    "id": 4365,
    "mediaId": 2688,
    "date": "2022-01-22",
    "sentence": "Again, on Jan. 10, Hannity texted Meadows and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), expressing some anxiety over a conversation he had had with Trump that day.",
    "author": "Josh Kovensky",
    "title": "‘No More Crazies’: Trump’s Final Days In Office, As Documented By The Jan. 6 Committee"
  },
  {
    "id": 2395,
    "mediaId": 2522,
    "date": "2022-02-08",
    "sentence": "He was an original member of the Jan. 6 select committee, but Republicans decided not to participate after Pelosi refused to seat Reps. <span class='selected-term'>Jim Jordan</span> and Jim Banks.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Fuming GOP rep accuses Capitol Police of ‘illegally’ investigating his office, says staffer ‘caught them in the act’"
  },
  {
    "id": 2032,
    "mediaId": 2699,
    "date": "2022-02-08",
    "sentence": "In July, House Majority Leader Kevin McCarthy nominated Nehls to the Jan. 6 committee, along with Reps. <span class='selected-term'>Jim Jordan</span> (R-OH), Rodney Davis (R-IL), Kelly Armstrong (R-ND), and Jim Banks (R-IN).",
    "author": "Roger Sollenberger",
    "title": "GOP Rep. Claims Capitol Police Secretly Broke Into His Office"
  },
  {
    "id": 422,
    "mediaId": 2550,
    "date": "2022-02-19",
    "sentence": "It cannot be emphasized enough: This was coming from a caucus that counts among its members the likes of Reps. <span class='selected-term'>Jim Jordan</span>, Andy Biggs, Paul Gosar, Matt Gaetz, Jody Hice, Marjorie Taylor Greene, Louie Gohmert, Madison Cawthorn, and Lauren Boebert.",
    "author": "Darrell Lucus\nCommunity",
    "title": "Freedom Caucus member: Jan. 6 could have been 'a stake in the heart of the federal republic'"
  },
  {
    "id": 12567,
    "mediaId": 2658,
    "date": "2022-03-02",
    "sentence": "House Minority Leader Kevin McCarthy, Rep. Scott Perry (R-Pa.) and Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) have all refused, despite evidence showing they witnessed or participated in significant aspects of Trump’s effort.",
    "author": "",
    "title": "Jan. 6 probe points lawmakers more and more toward GOP colleagues"
  },
  {
    "id": 9337,
    "mediaId": 2528,
    "date": "2022-03-24",
    "sentence": "\"House and Senate guys are pathetic too... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy,\" Thomas texted Meadows, seemingly referencing GOP Reps. Louie Gohmert of Texas, <span class='selected-term'>Jim Jordan</span> of Ohio, Paul Gosar of Arizona, and Chip Roy of Texas, per The Post.",
    "author": "Oma Seddiq",
    "title": "Supreme Court justice Clarence Thomas' wife called GOP lawmakers 'pathetic' for not challenging the 2020 election results"
  },
  {
    "id": 9340,
    "mediaId": 2726,
    "date": "2022-03-24",
    "sentence": "\"House and Senate guys are pathetic too ... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy,\" wrote Thomas, appearing to refer to Reps. Louie Gohmert, <span class='selected-term'>Jim Jordan</span>, Paul Gosar, and Chip Roy.",
    "author": "Cheryl Teh",
    "title": "Clarence Thomas' wife urged Mark Meadows to rally Republicans around Trump after the 2020 election and get those who hung on Trump's 'coattails' to pitch in"
  },
  {
    "id": 9260,
    "mediaId": 2699,
    "date": "2022-03-29",
    "sentence": "“I don’t know anything about what Madison referenced,” said Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), a leader of the right-most flank of the conference that includes Cawthorn.",
    "author": "Sam Brodey",
    "title": "Angry GOP Responds to Cawthorn’s ‘Bizarre’ D.C. Orgy Claims: ‘Name Names’"
  },
  {
    "id": 9601,
    "mediaId": 2550,
    "date": "2022-03-29",
    "sentence": "A very mysterious mystery that we are all going to pretend to be quite mystified by as the party rallies around <span class='selected-term'>Jim Jordan</span> and Matt Gaetz for reasons just as mysterious.",
    "author": "Hunter\nDaily Kos Staff",
    "title": "Nebraska Republican apologizes for falling for bizarre school 'furries' hoax"
  },
  {
    "id": 9715,
    "mediaId": 2646,
    "date": "2022-03-30",
    "sentence": "Cover-up specialist Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) refused to defend Cawthorn’s alleged sexcapades, telling The Daily Beast that he doesn’t “know anything about what Madison referenced”\nEven the perennial front runner for dumbest Congressman, Texas Republican Louis Gohmert called the North Carolina freshman’s remarks “bizarre.”\nCawthorn is facing pressure from all sides now, inside and outside the party.",
    "author": "Ty Ross",
    "title": "WHODUNNIT? GOP clamors for names in Cawthorn “Orgy-gate” accusations"
  },
  {
    "id": 7944,
    "mediaId": 2602,
    "date": "2022-03-31",
    "sentence": "Present at the talk were Senator Mike Lee (R-UT) and Congressmen <span class='selected-term'>Jim Jordan</span> (R-OH), Louis Gohmert (R-TX), Andy Harris (Maryland), Andy Barr (R-KY), Doug Lamborn (R-CO), Bill Johnson (R-OH), Barry Moore (R-AL) and Russ Fulcher (R-ID).",
    "author": "JERUSALEM POST STAFF",
    "title": "Netanyahu tells Congressmen that the Iran Deal is bad for the US"
  },
  {
    "id": 7422,
    "mediaId": 2699,
    "date": "2022-04-07",
    "sentence": "One was Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), the influential de facto dean of the party’s right flank in Congress, the House Freedom Caucus.",
    "author": "Sam Brodey",
    "title": "Sarah Palin Is Back. Her GOP May Have Moved On."
  },
  {
    "id": 6114,
    "mediaId": 2658,
    "date": "2022-04-22",
    "sentence": "Lawmakers who attended meetings, in person or by phone, included Reps. Scott Perry (R-Pa.), Louie Gohmert (R-Texas), <span class='selected-term'>Jim Jordan</span> (R-Ohio), Matt Gaetz (R-Fla.) and numerous members of the House Freedom Caucus, according to Cassidy Hutchinson, an aide to Meadows who provided key testimony about the conversations and meetings Meadows had in December 2020.",
    "author": "",
    "title": "GOP lawmakers were deeply involved in Trump plans to overturn election, new evidence suggests"
  },
  {
    "id": 4801,
    "mediaId": 2664,
    "date": "2022-04-23",
    "sentence": "Politico's Kyle Cheney and Nicholas Wu reported, \"Lawmakers who attended meetings, in person or by phone, included Reps. Scott Perry (R-Pa.), Louie Gohmert (R-Texas), <span class='selected-term'>Jim Jordan</span> (R-Ohio), Matt Gaetz (R-Fla.) and numerous members of the House Freedom Caucus.\"",
    "author": "Tom Boggioni",
    "title": "GOP lawmakers plotted with White House to prevent Joe Biden from taking office: Mark Meadows aide"
  },
  {
    "id": 4916,
    "mediaId": 2570,
    "date": "2022-04-23",
    "sentence": "Friday: Then, hard-right Rep. Marjorie Taylor Greene (R-Ga.) gave testimony in a challenge to her candidacy over her alleged participation in efforts to overturn the 2020 election, claiming that she thought that rioters breaking into the Capitol on January 6, 2021, were members of “antifa or BLM.”\nFriday afternoon: Politico published photos showing Cawthorn, who claims he lives by traditional Christian values, drinking and wearing women's lingerie at a party, which he later defended as “goofy vacation photos during a game on a cruise.”\nFriday night: Yet more troubling news broke when the January 6 committee filed deposition excerpts alleging several prominent House Republicans, including Reps. <span class='selected-term'>Jim Jordan</span> (Ohio), Louie Gohmert (Tex.)",
    "author": "Nicholas Reimann",
    "title": "Kevin McCarthy’s Awful Few Days: Embarrassing Leaks—And More Unwanted Cawthorn And Marjorie Taylor Greene Stories"
  },
  {
    "id": 4987,
    "mediaId": 2738,
    "date": "2022-04-23",
    "sentence": "Professional nuisances and Beavis and Butt-Head lookalikes Matt Gaetz and <span class='selected-term'>Jim Jordan</span> have never been quiet about spreading misinformation about the 2020 election.",
    "author": "Matt Prigge",
    "title": "Matt Gaetz, Jim Jordan, And More Were Reportedly Even More Involved In Plans To Overturn The Election Than Previously Thought"
  },
  {
    "id": 5176,
    "mediaId": 6656,
    "date": "2022-04-23",
    "sentence": "Among the GOP lawmakers named by Hutchinson as taking part in such discussions were Reps. Scott Perry, R-Pa., Louie Gohmert, R-Texas, <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Matt Gaetz, R-Fla.",
    "author": "Don Jacobson",
    "title": "Ex-aide: GOP lawmakers met with Meadows on Trump's Jan. 6 plans"
  },
  {
    "id": 4952,
    "mediaId": 2629,
    "date": "2022-04-24",
    "sentence": "The GOP lawmakers who took part in these meetings and phone calls, according to Hutchinson, were Reps. Scott Perry (R-PA), Louie Gohmert (R-TX), <span class='selected-term'>Jim Jordan</span> (R-OH), and Matt Gaetz (R-FL).",
    "author": "Chibueze Godwin",
    "title": "New Evidence Shows GOP Lawmakers Deeply Involved In Trump Coup"
  }
]