[
  {
    "id": 2803,
    "mediaId": 2618,
    "date": "2022-02-01",
    "sentence": "Monday on FNC’s “The Ingraham Angle,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) condemned the Biden administration’s use of government power to infringe on the exercise of First and Second Amendment rights.",
    "author": "Jeff Poor",
    "title": "Jordan: ‘Scary Stuff’ What the Biden Administration Has Done with First Amendment Rights, Second Amendment Liberties"
  },
  {
    "id": 1255,
    "mediaId": 2618,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Christina Coulter",
    "title": "Florida woman, 33, 'used $15,000 pandemic relief loan to bankroll a hit on TSA agent who stole her boyfriend': Victim, 24, was gunned down outside her Miami home in front of her three-year-old daughter"
  },
  {
    "id": 12511,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Katie Weston",
    "title": "Vladimir Putin says Western sanctions on Russia are almost a declaration of WAR and anyone imposing no-fly zone on Ukraine would be considered to have entered the conflict"
  },
  {
    "id": 12526,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Natasha Anderson &",
    "title": "Nearly there! People's Convoy rolls into Maryland as 30 mile caravan of anti-mandate protesters approach their final destination of Washington DC and tease possible visit to WHITE HOUSE"
  },
  {
    "id": 12542,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Zeke Miller",
    "title": "White House: Congress must act soon to replenish COVID funds"
  },
  {
    "id": 12956,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Kevin Haggerty",
    "title": "Biden claims he enjoyed ‘teaching’ and misses ‘being a professor at Penn’. Except he never taught there."
  },
  {
    "id": 13165,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "(Snip) Ohio congressman <span class='selected-term'>Jim Jordan</span> (R) indicates an investigation into Fauci is a priority if they regain a majority in November’s midterms.",
    "author": "Leslie Eastman",
    "title": "Where in the World Has Dr. Anthony Fauci Gone?"
  },
  {
    "id": 12532,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Karol Markowicz",
    "title": "Why we must demand that leaders who got COVID wrong admit it and apologize"
  },
  {
    "id": 12485,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Janon Fisher",
    "title": "Fears Putin will use WNBA All-Star Brittney Griner, 31, as a 'high-profile hostage' after she was detained on arrival at Moscow airport three WEEKS ago with 'cannabis-filled vape pen': Faces 10 YEARS in jail"
  },
  {
    "id": 12505,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Melissa Koenig",
    "title": "Former UN Ambassador Nikki Haley claims Biden's Afghan exit debacle and the Nord Stream 2 pipeline are to blame for emboldening Putin to invade Ukraine: Says it is 'lunacy' to continue to buy Russian oil"
  },
  {
    "id": 12494,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Chris Queen",
    "title": "Hate-Hoaxing Atlanta Rioters Who Tried to Frame Trump Supporters Convicted"
  },
  {
    "id": 11156,
    "mediaId": 2618,
    "date": "2022-03-08",
    "sentence": "",
    "author": "Claire Giangravé",
    "title": "Archbishop Viganò pushes conspiracy theories about Ukraine and Russia in 10,000-word letter"
  },
  {
    "id": 11054,
    "mediaId": 2618,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Jordan Dixon-Hamilton",
    "title": "Report: Oz Looks to Exit Senate Race, Return to Television"
  },
  {
    "id": 9420,
    "mediaId": 2618,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Lahav Harkov",
    "title": "US offering $1 million to report on Israeli human rights violations"
  },
  {
    "id": 6057,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> said on Sunday it \"sure seems\" the president's son is on his way to being indicted, though the congressman acknowledged he could not say for certain.",
    "author": "Daniel Chaitin",
    "title": "'Something is up': Jim Jordan spots major shift in Hunter Biden story"
  },
  {
    "id": 5277,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Mack Cogburn",
    "title": "Photos: Elaborate, Staged Photoshoots In The Middle Of A War Zone Are Impossible Yet Here’s Zelensky Making One"
  },
  {
    "id": 5449,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "Must See: Engelbrecht and Phillips on the Charlie Kirk Show on 2020 Fraud and “2000 Mules” – Cross-State Ballot Traffickers ID’ed – Brian Kemp Implicated – 1155 Ballot Traffickers in PA (Video)"
  },
  {
    "id": 5432,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Megan Myers",
    "title": "LinkedIn reinstates Air Force vet's post after wrongfully calling it 'hate speech,' apologizes"
  },
  {
    "id": 5268,
    "mediaId": 2618,
    "date": "2022-04-12",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) joined Fox News’ “Fox and Friends” Tuesday and said he believes President Joe Biden was most certainly involved in his son Hunter’s business dealings with foreign entities though the president predictably continues to deny it.His statement comes on the heels of a House Oversight Committee’s call for further investigation into the text messages allegedly stored on Hunter Biden’s infamous laptop that was abandoned to a Wilmington, DE, repair shop in 2019.",
    "author": "Frank Webster",
    "title": "Jim Jordan vows to expose Joe’s role in corrupt Biden ‘family enterprise’"
  },
  {
    "id": 5230,
    "mediaId": 2618,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Harriet Alexander",
    "title": "NYPD identifies person of interest in NYC subway shooting and reveals he made 'concerning posts' on social media about homelessness, New York and Mayor Eric Adams: Cops say 62-year-old rented the U-Haul connected to the attack"
  },
  {
    "id": 5272,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Josh Boswell",
    "title": "Exclusive: 'Hunter is a grifter!' Senator Ron Johnson SLAMS President's son for running up Secret Service costs after DailyMail.com revealed agents' $30k-a-month Malibu mansion and trip with his wife to Brazil"
  },
  {
    "id": 5344,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "“I’m Defending the Right to Express Your Views Under the First Amendment” – Alan Dershowitz Speaks Out in Defense of J6er He Is Representing who Was Waved in to US Capitol (Video)"
  }
]