[
  {
    "id": 2248,
    "mediaId": 2688,
    "date": "2022-02-10",
    "sentence": "But despite the missing call records, the Jan. 6 committee has reportedly unearthed information on at least one of Trump’s most highly scrutinized calls: A call between him and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Cristina Cabrera",
    "title": "Report: Jan. 6 Panel Finds Holes In Trump’s Official Call Logs On Day Of Insurrection"
  },
  {
    "id": 1660,
    "mediaId": 2664,
    "date": "2022-02-11",
    "sentence": "\"I mean, I talked to Kevin McCarthy, I have talked to <span class='selected-term'>Jim Jordan</span> and I have talked to other members who were speaking to the president, the former president that day,\" he reported.",
    "author": "Tom Boggioni",
    "title": "Here's why Trump may be headed for a 'criminal referral'"
  },
  {
    "id": 117,
    "mediaId": 2564,
    "date": "2022-02-23",
    "sentence": "The Texas Republican senator posted two images of himself at Mar-a-Lago\nHe's in Florida to speak at the Conservative Political Action Conference Thurs\nTrump was hosting a fundraiser for 2022 GOP congressional candidates\nCruz moderated a chat with Georgia Senate candidate Herschel Walker\nTennessee House candidate Morgan Ortagus was also there, along with former Florida AG Pam Bondi, Florida Rep. Mike Waltz and Ohio Rep. <span class='selected-term'>Jim Jordan</span>\nTop-dollar VIP access cost $250,000 per seat, and basic attendance ran $3,000\nTexas Senator Ted Cruz revealed he was at Donald Trump's Mar-a-Lago club in on Wednesday, along with a host of national Republican figures who gathered at the Florida resort for a high-profile fundraiser.",
    "author": "Elizabeth Elkind",
    "title": "Trump meets Ted Cruz at Mar-a-Lago ahead of C-PAC: Republicans and conservative donors mingle at private Florida private club ahead of ex-President's prime-time Saturday night speech"
  },
  {
    "id": 21,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "The \"Take Back Congress Candidate Forum” will be littered with 10 congressional Trump acolytes like Representative <span class='selected-term'>Jim Jordan</span> of Ohio and 13 hopefuls such as United States Senate candidate Herschel Walker of Georgia.",
    "author": "Brandon Gage",
    "title": "Donald Trump to host ‘Magapalooza’ at Mar-a-Lago on Wednesday"
  },
  {
    "id": 9480,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Melanie Zanona",
    "title": "Leaning on her Trump ties, Elise Stefanik plots future inside House GOP"
  },
  {
    "id": 7366,
    "mediaId": 2590,
    "date": "2022-04-07",
    "sentence": "He said he spoke to House Minority Leader Kevin McCarthy, Rep. <span class='selected-term'>Jim Jordan</span> and others, but maintained he did not destroy any records or use other phones.",
    "author": "Marita Vlachou",
    "title": "Trump Regrets Not Marching To Capitol On Jan. 6, Blames Pelosi For Violence"
  },
  {
    "id": 4983,
    "mediaId": 2547,
    "date": "2022-04-23",
    "sentence": "\"Oh, McCarthy lied to us but I'm sure <span class='selected-term'>Jim Jordan</span> won't.\"",
    "author": "NewsHound Ellen",
    "title": "McCarthy Was Caught Lying About Trump’s J6 Guilt. Now What?"
  }
]