[
  {
    "id": 12511,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Katie Weston",
    "title": "Vladimir Putin says Western sanctions on Russia are almost a declaration of WAR and anyone imposing no-fly zone on Ukraine would be considered to have entered the conflict"
  },
  {
    "id": 12928,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Jack Wright & Harriet Alexander",
    "title": "Parents grieve over toddler killed by shrapnel hours before 'ceasefire' intended to let them evacuate - which Putin's troops ignored anyway: Civilians attempting to escape Mariupol are forced back by shelling as Russians break pledge"
  },
  {
    "id": 10795,
    "mediaId": 2526,
    "date": "2022-03-18",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) March 17, 2022\nLast week, the TSA announced the decision to extend the mask mandate — which was set to expire Friday, March 18 — another month.",
    "author": "Hannah Bleau",
    "title": "Jim Jordan: ‘End’ the TSA Mask Mandate"
  },
  {
    "id": 7130,
    "mediaId": 2631,
    "date": "2022-03-31",
    "sentence": "Everybody’s concerned about that story,” said Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, a Trump loyalist who is likely to chair the Judiciary Committee if Republicans win the House back in November.",
    "author": "",
    "title": "Republicans squirm as Trump presses Putin for dirt on Bidens"
  },
  {
    "id": 7596,
    "mediaId": 2803,
    "date": "2022-04-09",
    "sentence": "Also in 2018, Rep. <span class='selected-term'>Jim Jordan</span>, one of Trump’s fiercest allies and a co-founder of the hardline conservative Freedom Caucus, became embroiled in a scandal over his time as a wrestling coach at Ohio State University, where a team doctor named Richard Strauss, who committed suicide in 2005, was found to have sexually abused more than 177 male student athletes.",
    "author": "Jordan Weissmann",
    "title": "So, Let’s Talk About Republicans and Sex Crimes"
  },
  {
    "id": 5449,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "Must See: Engelbrecht and Phillips on the Charlie Kirk Show on 2020 Fraud and “2000 Mules” – Cross-State Ballot Traffickers ID’ed – Brian Kemp Implicated – 1155 Ballot Traffickers in PA (Video)"
  },
  {
    "id": 5286,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Emily Crane",
    "title": "NY, Calif. failed in handling of COVID — but Florida was among best: study"
  },
  {
    "id": 5344,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Jim Hoft",
    "title": "“I’m Defending the Right to Express Your Views Under the First Amendment” – Alan Dershowitz Speaks Out in Defense of J6er He Is Representing who Was Waved in to US Capitol (Video)"
  }
]