[
  {
    "id": 2620,
    "mediaId": 2664,
    "date": "2022-02-04",
    "sentence": "The House committee investigating the Capitol riot has obtained evidence showing new details about then-President Donald Trump's phone call to Ohio GOP Rep. <span class='selected-term'>Jim Jordan</span> on Jan. 6, 2021.",
    "author": "Sky Palma",
    "title": "New evidence shows Trump and Jim Jordan had lengthy phone conversation on Jan. 6"
  },
  {
    "id": 2529,
    "mediaId": 2629,
    "date": "2022-02-05",
    "sentence": "Records that former President Donald Trump attempted to hide from public scrutiny have now revealed that he spoke on the phone with Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) on Jan. 6, 2021.",
    "author": "Oliver Willis",
    "title": "Records Trump Tried To Hide Reveal Call To Jim Jordan Before Capitol Attack"
  },
  {
    "id": 2575,
    "mediaId": 2636,
    "date": "2022-02-10",
    "sentence": "The committee did receive evidence in the documents requested from the National Archives that Mr. Trump had a call with Representative <span class='selected-term'>Jim Jordan</span>, Republican of Ohio, who led the floor strategy on Jan. 6 of objecting to Joseph R. Biden Jr.’s victory in key states, according to two people familiar with the investigation.",
    "author": "",
    "title": "Trump’s Missing Call Logs Present a Challenge for Jan. 6 Investigators"
  },
  {
    "id": 2248,
    "mediaId": 2688,
    "date": "2022-02-10",
    "sentence": "But despite the missing call records, the Jan. 6 committee has reportedly unearthed information on at least one of Trump’s most highly scrutinized calls: A call between him and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH).",
    "author": "Cristina Cabrera",
    "title": "Report: Jan. 6 Panel Finds Holes In Trump’s Official Call Logs On Day Of Insurrection"
  },
  {
    "id": 2342,
    "mediaId": 2512,
    "date": "2022-02-10",
    "sentence": "It has been well-documented that Trump spoke with several people, including Rep. <span class='selected-term'>Jim Jordan</span> on January 6, but the incomplete records are leaving investigators “with gaps so far in their understanding of what transpired that day,” according to CNN.",
    "author": "David Badash",
    "title": "Gaps: Trump’s White House records missing calls made to and from president during Jan. 6 insurrection"
  },
  {
    "id": 1956,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), for example, finally answered that he spoke to Trump on Jan. 6.",
    "author": "Sarah K. Burris",
    "title": "Documents handed to the Jan. 6 committee don't contain details about who was calling in and out of the White House: report"
  },
  {
    "id": 1889,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "\"How wonderful to have prime-time hearings that actually have people talking about Donald Trump taking records, official White House records, shredding them up, shoving them down the toilet, staff members coming in to testify and showing clips of [Rep.] <span class='selected-term'>Jim Jordan</span>, showing clips of everybody else on that committee talking about how sacred these official documents are and how horrible it was that Hillary Clinton, you know, did what we've found out it seems like so many people in the Trump administration did with their email accounts, and then again, the destruction of these documents and have the staff members running behind saying, 'Yeah, we always had to run in and grab the documents out of the trash can and piece them together, the ones we could, the ones that Donald wasn't flushing down the toilet.\"",
    "author": "Travis Gettys",
    "title": "Democrats can expose GOP ‘hypocrisy’ using Jim Jordan’s playbook: Morning Joe"
  },
  {
    "id": 9683,
    "mediaId": 2862,
    "date": "2022-03-29",
    "sentence": "Conservatives have pointed out that the FBI’s investigation into the 6 January events found no evidence of a conspiracy and also the Select Committee had refused to include lawmakers such as Congressman <span class='selected-term'>Jim Jordan</span> that would be critical of its activities and narrative.",
    "author": "",
    "title": "Trump Denies Use of 'Burner Phone' on 6 Jan. as Seven-Hour Gap in Phone Logs Raises Questions"
  },
  {
    "id": 9108,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "Other previously reported phone calls that did not show up on the White House logs include a phone call with Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), a heated exchange with House minority leader Kevin McCarthy (R-CA) and a conversation with Sen. Tommy Tuberville (R-AL).",
    "author": "Travis Gettys",
    "title": "Handwritten notes may reveal 'unknown person' in last Trump call before mysterious seven-hour gap"
  },
  {
    "id": 9290,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "\"The committee is debating whether to subpoena members of Congress such as [House minority leader Kevin] McCarthy (R-CA) and Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), who also talked to Trump on Jan. 6,\" wrote Post columnist Greg Sargent.",
    "author": "Travis Gettys",
    "title": "Columnist: Bombshell report on missing call logs could make it easier for Jan. 6 committee to get records from Trump allies"
  }
]