[
  {
    "id": 3190,
    "mediaId": 2746,
    "date": "2022-01-31",
    "sentence": "The signers are House Republican Whip Steve Scalise, plus Reps. James Comer, <span class='selected-term'>Jim Jordan</span>, Mark E. Green, Nicole Malliotakis and Mariannette Miller-Meeks.",
    "author": "Jennifer Harper",
    "title": "CBP shows American heroism on the southern border"
  },
  {
    "id": 2704,
    "mediaId": 2573,
    "date": "2022-01-31",
    "sentence": "In addition to Scalise and Comer, the top Republican on the House Oversight Committee, the letter was signed by Reps. <span class='selected-term'>Jim Jordan</span> of Ohio, Mark Green of Tennessee, Nicole Malliotakis of New York and Mariannette Miller-Meeks of Iowa.",
    "author": "Marisa Schultz",
    "title": "Republicans challenge CDC coronavirus mask, school guidelines for children"
  },
  {
    "id": 1792,
    "mediaId": 2572,
    "date": "2022-02-06",
    "sentence": "Democrats often cry foul on alleged Republican gerrymandering, but they are silent as they engage in similar conduct on a larger scale, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, said this week on \"Life, Liberty & Levin.\"",
    "author": "",
    "title": "Jim Jordan: Gerrymandering apparently only exists when GOP does it"
  },
  {
    "id": 7552,
    "mediaId": 2701,
    "date": "2022-04-06",
    "sentence": "“The White House has denied that Wolosky was involved in the Afghanistan Central Bank assets deliberations,” acknowledged Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, Mike Johnson, R-La., and Nicole Malliotakis, R-N.Y., in their joint letter sent Tuesday.",
    "author": "Tristan Justice",
    "title": "Did Biden Funnel $3.5 Billion Payout Away From Terror Victims And Toward Ex-Staff? Republicans Demand Answer"
  },
  {
    "id": 7599,
    "mediaId": 8484,
    "date": "2022-04-06",
    "sentence": "'President Biden must rescind his executive order and direct these funds into existing mechanisms to ensure that all victims of terrorism are treated fairly,' the letter, signed by Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, Nicole Malliotakis, R-N.Y., and Mike Johnson, R-La., and addressed to chief of staff Ron Klain.",
    "author": "Morgan Phillips",
    "title": "Republicans write to Biden urging him to divide seized Taliban assets equally among 9/11 victims"
  }
]