[
  {
    "id": 2803,
    "mediaId": 2618,
    "date": "2022-02-01",
    "sentence": "Monday on FNC’s “The Ingraham Angle,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) condemned the Biden administration’s use of government power to infringe on the exercise of First and Second Amendment rights.",
    "author": "Jeff Poor",
    "title": "Jordan: ‘Scary Stuff’ What the Biden Administration Has Done with First Amendment Rights, Second Amendment Liberties"
  },
  {
    "id": 2643,
    "mediaId": 2599,
    "date": "2022-02-07",
    "sentence": "Other prominent Republican lawmakers, including Tennessee Sen. Marsha Blackburn and Ohio Rep. <span class='selected-term'>Jim Jordan</span>, have signaled their intent to scrutinize the crowdfunding site.”",
    "author": "Ed Driscoll",
    "title": "GoFundMe and How the Left Came to Despise the Working Class"
  },
  {
    "id": 2341,
    "mediaId": 2641,
    "date": "2022-02-09",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax that House Speaker Nancy Pelosi, D-Calif., was wrong to tell athletes at the 2022 Beijing Winter Olympics not to protest.",
    "author": "Nick Koutsobinas",
    "title": "Rep. Jim Jordan to Newsmax: Pelosi Wrong to Tell Olympians Not to Speak Out"
  },
  {
    "id": 12676,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Tim Lister *",
    "title": "Fears grow for Ukrainian civilians after checkpoint is shelled and evacuations fail for a second day"
  },
  {
    "id": 12551,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Brittany Bernstein",
    "title": "Russian Banks to Switch to Chinese Card System after Visa, Mastercard Suspend Operations in Russia"
  },
  {
    "id": 12558,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Philip Lenczycki",
    "title": "Christian Fugitives Face Martyrdom In Communist China"
  },
  {
    "id": 10760,
    "mediaId": 2573,
    "date": "2022-03-15",
    "sentence": "Joining me now is House Minority Whip Steve Scalise; Ohio Congressman <span class='selected-term'>Jim Jordan</span>, Ranking Member of the House Judiciary Committee.",
    "author": "Fox News Staff",
    "title": "'The Ingraham Angle' on China's role in Russia-Ukraine war"
  },
  {
    "id": 7766,
    "mediaId": 2563,
    "date": "2022-03-31",
    "sentence": "Congressman <span class='selected-term'>Jim Jordan</span> said, “the mainstream press, along with Big Tech and Democrats, all colluded to keep this important information from the American people just days before our most important election, the presidential election.” That about sums it up.",
    "author": "The Daily Skirmish - Liberato.US",
    "title": "The ‘Laptop from Hell’ Burns Our Devilish Elites"
  },
  {
    "id": 7601,
    "mediaId": 2818,
    "date": "2022-04-05",
    "sentence": "We know he took millions of dollars from energy companies in Ukraine and millions of dollars from companies in China with ties to the Chinese Communist Party,” said Congressman <span class='selected-term'>Jim Jordan</span>.",
    "author": "The First",
    "title": "JORDAN: Hunter Biden ‘Took Millions of Dollars’ from Moscow, Ukraine, Chinese Communists"
  }
]