[
  {
    "id": 4464,
    "mediaId": 2658,
    "date": "2022-01-10",
    "sentence": "QUICK LINKS\nRep. <span class='selected-term'>Jim Jordan</span> says he won’t cooperate with Jan. 6 committee’s interview request, from Nicholas and Kyle\nTRANSITIONS\nOmair Mirza is joining J.P. Morgan Chase as VP of federal government relations.",
    "author": "",
    "title": "Dems eye voting rights fight, filibuster changes"
  },
  {
    "id": 4484,
    "mediaId": 2590,
    "date": "2022-01-13",
    "sentence": "When members of the House Select Committee on Jan. 6 asked Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) to meet with them, they probably should’ve known that he wouldn’t comply with their request.",
    "author": "Nathalie Baptiste",
    "title": "It's Time For Democrats To Accept That Norms Are Dead"
  },
  {
    "id": 3728,
    "mediaId": 2618,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Leslie Eastman",
    "title": "Sen. Ron Johnson Hosts “Second Opinion” Panel on America’s Problematic Pandemic Response"
  },
  {
    "id": 1793,
    "mediaId": 2573,
    "date": "2022-02-09",
    "sentence": "Here with the very latest is the ranking member of the House Judiciary Committee, Congressman <span class='selected-term'>Jim Jordan</span>, along with former White House chief of staff and former congressman, Mark Meadows, is with us.",
    "author": "",
    "title": "'Hannity' on Capitol Police"
  },
  {
    "id": 13310,
    "mediaId": 2609,
    "date": "2022-03-04",
    "sentence": "Ohio congressman <span class='selected-term'>Jim Jordan</span> (R) indicates an investigation into Fauci is a priority if they regain a majority in November’s midterms.",
    "author": "Leslie Eastman",
    "title": "Where in the World Has Dr. Anthony Fauci Gone?"
  },
  {
    "id": 7139,
    "mediaId": 2557,
    "date": "2022-04-03",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) April 1, 2022\nThe Media Research Center pointed out that none of the “fact-checkers” on social media have updated their “checks” on the Hunter Biden laptop scandal.",
    "author": "DML News App",
    "title": "REPORT: Republicans take victory lap after media confirms Hunter Biden laptop"
  },
  {
    "id": 6023,
    "mediaId": 2671,
    "date": "2022-04-10",
    "sentence": "Bartiromo had Rep. <span class='selected-term'>Jim Jordan</span> on air this morning, and the two of them delivered maybe the best segment on Hunter Biden and the laptop and Joe Biden complicity that I’ve seen on TV news.",
    "author": "Fred T",
    "title": "MUST SEE: Maria Bartiromo & Jim Jordan DESTROY Dem/Media collusion on Hunter Biden, SLAP Chris Wallace for good measure"
  },
  {
    "id": 5272,
    "mediaId": 2618,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Josh Boswell",
    "title": "Exclusive: 'Hunter is a grifter!' Senator Ron Johnson SLAMS President's son for running up Secret Service costs after DailyMail.com revealed agents' $30k-a-month Malibu mansion and trip with his wife to Brazil"
  }
]