[
  {
    "id": 3803,
    "mediaId": 2547,
    "date": "2022-01-25",
    "sentence": "No, it's going to be the days of <span class='selected-term'>Jim Jordan</span> and Matt Gaetz and Marjorie Taylor Greene.\"",
    "author": "David",
    "title": "Gaetz Flips Out About His Possible Sex-Trafficking Prosecution"
  },
  {
    "id": 3580,
    "mediaId": 2658,
    "date": "2022-01-26",
    "sentence": "The plant is outside Turner’s Dayton-based congressional district, instead belonging to Republican <span class='selected-term'>Jim Jordan</span>‘s district.",
    "author": "",
    "title": "Lawmakers' answer to the Russia-Ukraine crisis: Weapons made in their states"
  },
  {
    "id": 3495,
    "mediaId": 2748,
    "date": "2022-01-28",
    "sentence": "#ReleaseTheTranscript\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 28, 2022\nThe White House released the following statement on the call:\n“President Joseph R. Biden, Jr. spoke today with President Volodymyr Zelenskyy of Ukraine.",
    "author": "",
    "title": "‘RELEASE THE TRANSCRIPT’: GOP Demands Biden-Zelensky Call Transcript, 'Joe Asked Trump to Do It!'"
  },
  {
    "id": 3196,
    "mediaId": 6621,
    "date": "2022-01-28",
    "sentence": "#ReleaseTheTranscript\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 28, 2022\nThe White House released the following statement on the call:\n“President Joseph R. Biden, Jr. spoke today with President Volodymyr Zelenskyy of Ukraine.",
    "author": "",
    "title": "‘RELEASE THE TRANSCRIPT’: GOP Demands Biden-Zelensky Call Transcript, 'Joe Asked Trump to Do It!'"
  },
  {
    "id": 2698,
    "mediaId": 2573,
    "date": "2022-02-01",
    "sentence": "REP. <span class='selected-term'>JIM JORDAN</span> (R-OH): No, this is frightening.",
    "author": "Fox News Staff",
    "title": "'The Ingraham Angle' on Biden's handling of Russia-Ukraine tensions"
  },
  {
    "id": 2838,
    "mediaId": 2644,
    "date": "2022-02-02",
    "sentence": "“Because in impeachment proceedings, the American public has the right to know all the evidence.”\nUS Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) also called it “frightening” to learn that Trump “wasn’t allowed to have information that he’s entitled to have to put on his defense.”\nA State Department spokesperson said, “We do not comment on matters under litigation.”",
    "author": "Bruce Golding",
    "title": "Classified 2016 email shows US diplomat warning of Hunter Biden deals in Ukraine"
  },
  {
    "id": 2323,
    "mediaId": 2748,
    "date": "2022-02-04",
    "sentence": "On Tuesday, Republican Rep. <span class='selected-term'>Jim Jordan</span> of Ohio appeared on Just the News’ self-titled news show and mounted a strong defense of Trump throughout the first impeachment.",
    "author": "STATION GOSSIP",
    "title": "Email Hidden for 5 Years Declared Hunter Biden 'Undercut' US Efforts to Fight Ukraine Corruption - Report"
  },
  {
    "id": 2293,
    "mediaId": 2540,
    "date": "2022-02-07",
    "sentence": "",
    "author": "Alexandra Meeks",
    "title": "5 things to know for Feb. 7: Covid, Capitol riot, Electoral count, Jubilee, Joe Rogan"
  },
  {
    "id": 2381,
    "mediaId": 2547,
    "date": "2022-02-07",
    "sentence": "",
    "author": "John Amato",
    "title": "Jim Jordan Is An Absurd Hypocrite, Part Infinity"
  },
  {
    "id": 1992,
    "mediaId": 2572,
    "date": "2022-02-09",
    "sentence": "The second issue is what you just mentioned with <span class='selected-term'>Jim Jordan</span>, and that is the apparent double standard here, which is that we have these giant tech giants, and they seem to have one standard for one political persuasion and one for the other.",
    "author": "Fox News Staff",
    "title": "'Special Report All-Star Panel' react to Joe Biden's handling of Ukraine crisis"
  },
  {
    "id": 1794,
    "mediaId": 2572,
    "date": "2022-02-09",
    "sentence": "The second issue is what you just mentioned with <span class='selected-term'>Jim Jordan</span>, and that is the apparent double standard here, which is that we have these giant tech giants, and they seem to have one standard for one political persuasion and one for the other.",
    "author": "",
    "title": "'Special Report' on Winter Olympics"
  },
  {
    "id": 1533,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Chris Pleasance & Harriet Alexander",
    "title": "Russia says it is WITHDRAWING some troops from Ukraine in first sign of a climbdown after US intelligence said units were in 'attack positions' and warned of invasion 'by end of week' - but is it all just another one of Putin's deceptions?"
  },
  {
    "id": 917,
    "mediaId": 2618,
    "date": "2022-02-18",
    "sentence": "",
    "author": "Monica Showalter",
    "title": "Wrong-way Biden dispatches Kamala Harris ... to the Ukraine border"
  },
  {
    "id": 59,
    "mediaId": 2573,
    "date": "2022-02-21",
    "sentence": "We heard from Congressman <span class='selected-term'>Jim Jordan</span> on Twitter today, who wrote: \"It's not a vast right-wing conspiracy.",
    "author": "",
    "title": "'Your World' on Russia-Ukraine, Hillary Clinton in New York"
  },
  {
    "id": 341,
    "mediaId": 2618,
    "date": "2022-02-23",
    "sentence": "",
    "author": "Monica Showalter",
    "title": "Doddering Biden volunteers America for higher energy prices to defend Ukraine's borders"
  },
  {
    "id": 573,
    "mediaId": 2629,
    "date": "2022-02-24",
    "sentence": "Jim Banks of Indiana, Rep. Vern Buchanan of Florida, Rep. Mike Carey of Ohio, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, Rep. Debbie Lesko of Arizona, Rep. Mary Miller of Illinois, Rep. Mike Waltz of Florida, Sen. Marsha Blackburn of Tennessee, Sen. Ted Cruz of Texas, and Sen. Lindsey Graham of South Carolina—should definitely be getting questions about what conversations they had with Trump about the issue and how they felt about being at an event that boosted his stature in the Republican Party and was sandwiched between times he praised Putin for invading Ukraine.",
    "author": "Laura Clawson",
    "title": "Incoherent On Ukraine, Republican Officials Try To Ignore Trump Praise For Putin"
  },
  {
    "id": 150,
    "mediaId": 2672,
    "date": "2022-02-24",
    "sentence": "But only a few days later, during a segment with Rep. <span class='selected-term'>Jim Jordan</span>, Tucker voiced the same sentiment more clearly: “I think we should probably take the side of Russia,” he said, “if we have to choose between Russia and Ukraine.”\nDespite saying that he was \"just kidding\" about rooting for Russia over Ukraine, Tucker just doubled down on supporting the Russians in the conflict.",
    "author": "Tim Dickinson",
    "title": "These Are the American Right-Wingers Covering for Putin as Russia Invades Ukraine"
  },
  {
    "id": 24,
    "mediaId": 2564,
    "date": "2022-02-25",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, added on Twitter.",
    "author": "Morgan Phillips",
    "title": "Republican Senator Ben Sasse tears into 'evil' Putin and tells Biden to sanction 'lifestyles of the rich and famous a**hole mobsters and oligarchs' who enable the Russian leader's 'madness'"
  },
  {
    "id": 49,
    "mediaId": 2526,
    "date": "2022-02-26",
    "sentence": "On Friday’s broadcast of the Fox News Channel’s “Hannity,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) stated that poor decisions in the past by the Biden administration have put us in a bad spot in the crisis in Ukraine and remarked that it would be helpful if some of the weapons and equipment the U.S. left behind in Afghanistan “was in Ukraine right now” to better arm the Ukrainian people to repel the invasion by Russia.",
    "author": "Ian Hanchett",
    "title": "Jordan: It Would Be Nice if Equipment We Left in Afghanistan Was in Ukraine"
  },
  {
    "id": 7,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "",
    "author": "",
    "title": "Ukraine showdown: Volodymyr Zelenskyy challenges Vladimir Putin"
  },
  {
    "id": 13,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "",
    "author": "Caitlin McFall",
    "title": "Ukraine invasion: Russia 'increasingly frustrated' by lack of momentum: US defense official"
  },
  {
    "id": 12704,
    "mediaId": 2746,
    "date": "2022-02-26",
    "sentence": "Prior to Mr. Trump, several other conservative and GOP speakers took the stage, including Ohio Rep. <span class='selected-term'>Jim Jordan</span>, Florida Sen. Rick Scott, and Louisiana Sen. John Kennedy.",
    "author": "Mica Soellner",
    "title": "Trump condemns Russian invasion of Ukraine as an ‘atrocity,’ blames Biden"
  },
  {
    "id": 12967,
    "mediaId": 2679,
    "date": "2022-02-26",
    "sentence": "Rep. Jim Banks, R-Ind., after saying he would “never, ever apologize for objecting” to Biden’s victory Jan. 6, said he and Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, were victimized when they were removed from the House committee investigating that day’s attack on the U.S. Capitol.",
    "author": "Astead W. Herndon",
    "title": "At CPAC, Ukraine and policy take a back seat to cultural grievances"
  },
  {
    "id": 13187,
    "mediaId": 2748,
    "date": "2022-02-27",
    "sentence": "On Friday’s broadcast of the Fox News Channel’s “Hannity,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) stated that poor decisions in the past by the Biden administration have put us in a bad spot in the crisis in Ukraine and remarked that it would be helpful if some of the weapons and equipment the U.S. left behind in Afghanistan “was in Ukraine right now” to better arm the Ukrainian people to repel the invasion by Russia.",
    "author": "STATION GOSSIP",
    "title": "Jordan: It Would Be Nice if Equipment We Left in Afghanistan Was in Ukraine"
  },
  {
    "id": 13219,
    "mediaId": 2724,
    "date": "2022-02-28",
    "sentence": "“It would have been nice if the $85 billion in weapons left in Afghanistan could’ve been sent to Ukraine.” ~ Rep. <span class='selected-term'>Jim Jordan</span> (Ohio – R)\nRELATED: Newspaper Editorial Blames Right-Wing Rhetoric For Assassination Attempt On Louisville Mayoral Candidate After BLM Activist Was Charged\nJordan: State Department Too Focused On ‘Pronouns’ And ‘Gender-neutral Passports’\nJordan then said the U.S. government should concentrate more on “real diplomacy” than political correct nonsense.",
    "author": "John Hanson",
    "title": "Video: Jim Jordan Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine"
  },
  {
    "id": 12773,
    "mediaId": 2724,
    "date": "2022-03-01",
    "sentence": "— Sahil Kapur (@sahilkapur) February 22, 2022\nRELATED: Video: <span class='selected-term'>Jim Jordan</span> Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nTrump and other conservatives have been accused of supporting Russia\n“We could use that on our southern border.",
    "author": "John Hanson",
    "title": "Joy Behar Claims Trump Supports Russia And It’s Because Of ‘White Supremacy’"
  },
  {
    "id": 12556,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "Lawmakers across the political spectrum support a significant boost in funding for the Ukrainian military.”\nFunding and arming Ukraine has widespread bipartisan support in Congress, as evidenced by the fact that Rep. KATIE PORTER (D-Calif.) and Rep. <span class='selected-term'>JIM JORDAN</span> (R-Ohio) — who see eye to eye on very little, if anything — clapped about the same things they were told in a classified hearing.",
    "author": "",
    "title": "Tell us how the Ukraine war ends"
  },
  {
    "id": 12575,
    "mediaId": 2573,
    "date": "2022-03-02",
    "sentence": "Joining us now is House Minority Whip Steve Scalise, House Judiciary Committee Ranking Member <span class='selected-term'>Jim Jordan</span>, and Molly Hemingway Editor in Chief of the Federalist Fox News Contributor.",
    "author": "",
    "title": "'The Ingraham Angle' on Biden's State of the Union"
  },
  {
    "id": 13228,
    "mediaId": 2548,
    "date": "2022-03-02",
    "sentence": "(RELATED: Rep. <span class='selected-term'>Jim Jordan</span> Says Biden Might Want To Change His Policies, But The ‘Radical Left’ In His Party Will Never Let Him)\nSanctioning Russian energy has gained bipartisan support from lawmakers, political commentators and elites.",
    "author": "Nicole Silverio",
    "title": "Gutfeld Says US Government Is ‘Acting Like White Knights’ As They Purchase Russian Oil"
  },
  {
    "id": 12692,
    "mediaId": 2724,
    "date": "2022-03-03",
    "sentence": "",
    "author": "RealClearWire",
    "title": "Are We Nuts? American Energy Is Key To Undermining Putin’s War"
  },
  {
    "id": 12790,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Eric R. Mandel",
    "title": "While America watches the war in Ukraine, Biden finalizes a dangerous Iran deal"
  },
  {
    "id": 12928,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Jack Wright & Harriet Alexander",
    "title": "Parents grieve over toddler killed by shrapnel hours before 'ceasefire' intended to let them evacuate - which Putin's troops ignored anyway: Civilians attempting to escape Mariupol are forced back by shelling as Russians break pledge"
  },
  {
    "id": 12541,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "David Hookstead",
    "title": "NASCAR Legend Richard Childress Is Sending A Million Rounds Of Ammo To Ukraine"
  },
  {
    "id": 12546,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Cristina Laila",
    "title": "Far-Left Actress Patricia Arquette Demands Russia be Kicked Out of….NATO – Then Blames Her ‘Dyslexia’ After Getting Roasted For Her Stupidity"
  },
  {
    "id": 12531,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Staff",
    "title": "Ukraine parades Russian prisoners of war as Putin's forces step up bombing and missile attacks on cities"
  },
  {
    "id": 12511,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Katie Weston",
    "title": "Vladimir Putin says Western sanctions on Russia are almost a declaration of WAR and anyone imposing no-fly zone on Ukraine would be considered to have entered the conflict"
  },
  {
    "id": 12492,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Joe Hoft",
    "title": "And There It Is: Biden Asks for Billions for COVID and Ukraine – Where Will This Money Really Go?"
  },
  {
    "id": 12497,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Melanie Wilcox",
    "title": "US Ammo Company To Send 1 Million Bullets To Ukraine"
  },
  {
    "id": 13165,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "(Snip) Ohio congressman <span class='selected-term'>Jim Jordan</span> (R) indicates an investigation into Fauci is a priority if they regain a majority in November’s midterms.",
    "author": "Leslie Eastman",
    "title": "Where in the World Has Dr. Anthony Fauci Gone?"
  },
  {
    "id": 12505,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Melissa Koenig",
    "title": "Former UN Ambassador Nikki Haley claims Biden's Afghan exit debacle and the Nord Stream 2 pipeline are to blame for emboldening Putin to invade Ukraine: Says it is 'lunacy' to continue to buy Russian oil"
  },
  {
    "id": 12513,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Gina Martinez",
    "title": "'This is a massive crime against humanity': Trump says we 'can't let' the situation in Ukraine continue and slams 'paper tiger' NATO for its inaction"
  },
  {
    "id": 12519,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Olafimihan Oshin",
    "title": "Russia looks to recruit Syrians into Ukraine war: report"
  },
  {
    "id": 12536,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Keith Griffith *",
    "title": "US gives Poland the 'green light' to give Ukraine MIG fighter jets as Russia warns it is at WAR with ANY country hosting Kyiv's aircraft and points finger at Romania as top American general inspects troops in Europe"
  },
  {
    "id": 12524,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Anthony",
    "title": "Amazing Video Shows The People’s Convoy Stretched Out Over 60 Miles"
  },
  {
    "id": 12545,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Wayne Allyn Root",
    "title": "Here's Your 'Red Pill' Moment for the Russia-Ukraine War"
  },
  {
    "id": 12561,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Elizabeth Elkind & Katelyn Caralle",
    "title": "Ukraine has a ‘continuity of government’ plan if its Zelensky is assassinated, US Secretary of State Antony Blinken says"
  },
  {
    "id": 12565,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Brittany Bernstein",
    "title": "Ukrainian Evacuation Efforts Halted by Russian Shelling"
  },
  {
    "id": 12572,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "George Rowe",
    "title": "War Crimes Caught On Video: Russian Troops Fire Mortar Round At Civilians They Promised They Would Let Leave In Irpin, 3 Dead Including 2 Children"
  },
  {
    "id": 12656,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Emily Smith",
    "title": "Vladimir Putin hiding lover Alina Kabaeva and their kids in Switzerland"
  },
  {
    "id": 12676,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Tim Lister *",
    "title": "Fears grow for Ukrainian civilians after checkpoint is shelled and evacuations fail for a second day"
  },
  {
    "id": 11428,
    "mediaId": 2724,
    "date": "2022-03-07",
    "sentence": "Rogers’ comments are similar to those of Rep. <span class='selected-term'>Jim Jordan</span>, who argued last week that Biden is essentially being held hostage by the far-left of his party.",
    "author": "John Hanson",
    "title": "Republican Rep. Mike Rogers: Every Barrel Of Russian Oil U.S. Buys Has ‘Ukrainian Blood On It’"
  },
  {
    "id": 11466,
    "mediaId": 2629,
    "date": "2022-03-08",
    "sentence": "Anyone telling you otherwise is lying,\" Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) tweeted on Monday.",
    "author": "Emily Singer",
    "title": "Biden Approval Rises Despite GOP Attacks On Ukraine Policy"
  },
  {
    "id": 11156,
    "mediaId": 2618,
    "date": "2022-03-08",
    "sentence": "",
    "author": "Claire Giangravé",
    "title": "Archbishop Viganò pushes conspiracy theories about Ukraine and Russia in 10,000-word letter"
  },
  {
    "id": 10959,
    "mediaId": 2641,
    "date": "2022-03-09",
    "sentence": "Russian President Vladimir Putin has taken advantage of a lack of leadership in the White House to carry out his invasion of Ukraine, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday.",
    "author": "Brian Freeman",
    "title": "Rep. Jim Jordan to Newsmax: Putin Takes Advantage of WH Weakness"
  },
  {
    "id": 11033,
    "mediaId": 2641,
    "date": "2022-03-09",
    "sentence": "Russian President Vladimir Putin has taken advantage of a lack of leadership in the White House to carry out his invasion of Ukraine, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday.",
    "author": "Brian Freeman",
    "title": "Rep. Jim Jordan to Newsmax: Putin Takes Advantage of WH Weakness"
  },
  {
    "id": 11081,
    "mediaId": 2550,
    "date": "2022-03-10",
    "sentence": "In the midst of trying to defend Trump, Rep. <span class='selected-term'>Jim Jordan</span> called Ukraine “one of the three most corrupt countries on the planet.” He also condemned efforts to fight corruption in Ukraine as themselves corrupt because Biden was involved.",
    "author": "Laura Clawson",
    "title": "Republicans suddenly claim to be the biggest allies of the nation they once denounced as corrupt"
  },
  {
    "id": 11233,
    "mediaId": 2644,
    "date": "2022-03-10",
    "sentence": "During the 2019 impeachment proceedings — which culminated with Trump being acquitted in a party-line vote — Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) said Ukraine was regarded by accounting firm Ernst & Young as “one of the three most corrupt countries on the planet.”\nCawthorn is running for re-election in North Carolina’s 11th District, where he is facing seven Republican primary challengers.",
    "author": "Evan Simko-Bednarski",
    "title": "GOP Rep. Madison Cawthorn slams Zelensky as a ‘thug’ overseeing ‘evil’ government"
  },
  {
    "id": 10867,
    "mediaId": 2550,
    "date": "2022-03-11",
    "sentence": "Going back a little further than that, during Trump’s first Ukraine-centered impeachment, a standard Republican talking point was that Ukraine was incredibly corrupt, “one of the three most corrupt countries on the planet,” according to Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "",
    "title": "Cawthorn isn't alone as a Republican crapping on Ukraine. He just has bad timing"
  },
  {
    "id": 11036,
    "mediaId": 2724,
    "date": "2022-03-11",
    "sentence": "",
    "author": "RealClearWire",
    "title": "Will Dems’ Green Dream Fuel GOP Red Wave?"
  },
  {
    "id": 10951,
    "mediaId": 2618,
    "date": "2022-03-14",
    "sentence": "",
    "author": "Mike LaChance",
    "title": "NYC Academics and Activists Want Theodore Roosevelt Statue Melted Down"
  },
  {
    "id": 10701,
    "mediaId": 8322,
    "date": "2022-03-14",
    "sentence": "REP. <span class='selected-term'>JIM JORDAN</span> (R-OH): No, this is the great divide in America today, Sean, you got the, quote, elite and the crazy left who think that there's no problem having four and five dollar gas.",
    "author": "",
    "title": "'Hannity' on Jen Psaki, inflation"
  },
  {
    "id": 10731,
    "mediaId": 2573,
    "date": "2022-03-14",
    "sentence": "\"Burkov has been described as an ‘asset of supreme importance’ and ‘one of the most connected and skilled malicious hackers ever apprehended by U.S. authorities,’\" Reps. <span class='selected-term'>Jim Jordan</span>, Michael McCaul, John Katko, and Mike Turner wrote to Sullivan, in a letter obtained by Fox News.",
    "author": "Brooke Singman",
    "title": "House GOP investigating US release of Russian cyber criminal"
  },
  {
    "id": 10760,
    "mediaId": 2573,
    "date": "2022-03-15",
    "sentence": "Joining me now is House Minority Whip Steve Scalise; Ohio Congressman <span class='selected-term'>Jim Jordan</span>, Ranking Member of the House Judiciary Committee.",
    "author": "Fox News Staff",
    "title": "'The Ingraham Angle' on China's role in Russia-Ukraine war"
  },
  {
    "id": 11090,
    "mediaId": 2618,
    "date": "2022-03-16",
    "sentence": "",
    "author": "Terresa Monroe-Hamilton",
    "title": "Biden to announce $1B arms package, weighs giving Ukraine tank-killing Switchblade ‘kamikaze’ drones"
  },
  {
    "id": 10700,
    "mediaId": 2572,
    "date": "2022-03-17",
    "sentence": "",
    "author": "Tyler Olson",
    "title": "Over 50 House Republicans back Banks' resolution opposing Iran nuclear deal amid Russia-Ukraine war"
  },
  {
    "id": 10982,
    "mediaId": 2594,
    "date": "2022-03-17",
    "sentence": "Even <span class='selected-term'>Jim Jordan</span> got in on the action, asking on Twitter, \"where’s Fauci?\"",
    "author": "Justin Vallejo",
    "title": "Where’s Fauci? ‘Witness protection’ quip leads to internet conspiracy"
  },
  {
    "id": 11811,
    "mediaId": 8491,
    "date": "2022-03-22",
    "sentence": "“Fighters like Ted Cruz, <span class='selected-term'>Jim Jordan</span>, and Donald Trump.”\nVance, who was a Trump critic during the 2016 election cycle, said his past remarks were “stupid” and Trump was “the greatest president of my lifetime.”\nTimken lauded her work for Trump’s 2020 campaign as state GOP chair speaking at rallies, writing op-eds, and putting 150,000 miles on her car, and Gibbons mentioned his fundraising efforts for Trump in 2016.",
    "author": "Ben Orner",
    "title": "Gas prices, Ukraine and Trump: Ohio GOP Senate field debates issues in primetime"
  },
  {
    "id": 11713,
    "mediaId": 8480,
    "date": "2022-03-22",
    "sentence": "“Fighters like Ted Cruz, <span class='selected-term'>Jim Jordan</span>, and Donald Trump.”\nVance, who was a Trump critic during the 2016 election cycle, said his past remarks were “stupid” and Trump was “the greatest president of my lifetime.”\nTimken lauded her work for Trump’s 2020 campaign as state GOP chair speaking at rallies, writing op-eds, and putting 150,000 miles on her car, and Gibbons mentioned his fundraising efforts for Trump in 2016.",
    "author": "Ben Orner",
    "title": "Gas prices, Ukraine and Trump: Ohio GOP Senate field debates issues in primetime"
  },
  {
    "id": 8886,
    "mediaId": 2572,
    "date": "2022-03-24",
    "sentence": "Ohio Congressman <span class='selected-term'>Jim Jordan</span>, ranking member of House Judiciary, is right in the middle of all this and joins me now.",
    "author": "",
    "title": "'The Ingraham Angle' on Kamala Harris, Ketanji Brown Jackson"
  },
  {
    "id": 9403,
    "mediaId": 2671,
    "date": "2022-03-26",
    "sentence": "“Just look at the border,” <span class='selected-term'>Jim Jordan</span> tells the Washington Times.",
    "author": "Fred T",
    "title": "DO IT!!! Jim Jordan says GOP should IMPEACH Biden after taking the House BACK in November"
  },
  {
    "id": 9109,
    "mediaId": 2643,
    "date": "2022-03-27",
    "sentence": "Several Republican lawmakers in the U.S. criticized Biden for his comment, with Ohio Representative <span class='selected-term'>Jim Jordan</span> calling it \"war-triggering,\" while Indiana Senator Jim Risch said it was a \"horrendous gaffe.\"",
    "author": "Natalie Colarossi",
    "title": "Macron Warns Biden Against Escalating Ukraine War With 'Words or Actions'"
  },
  {
    "id": 9696,
    "mediaId": 2627,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Steve Benen",
    "title": "Why it matters that Jim Jordan is talking about impeaching Biden"
  },
  {
    "id": 9293,
    "mediaId": 2584,
    "date": "2022-03-30",
    "sentence": "“Here’s the thing: we know the former president spoke to people like Kevin McCarthy and <span class='selected-term'>Jim Jordan</span> during those seven hours and 37 minutes,” Colbert said.",
    "author": "Adrian Horton",
    "title": "Stephen Colbert on Trump’s missing phone logs: ‘A poorly executed cover-up’"
  },
  {
    "id": 7766,
    "mediaId": 2563,
    "date": "2022-03-31",
    "sentence": "Congressman <span class='selected-term'>Jim Jordan</span> said, “the mainstream press, along with Big Tech and Democrats, all colluded to keep this important information from the American people just days before our most important election, the presidential election.” That about sums it up.",
    "author": "The Daily Skirmish - Liberato.US",
    "title": "The ‘Laptop from Hell’ Burns Our Devilish Elites"
  },
  {
    "id": 7601,
    "mediaId": 2818,
    "date": "2022-04-05",
    "sentence": "We know he took millions of dollars from energy companies in Ukraine and millions of dollars from companies in China with ties to the Chinese Communist Party,” said Congressman <span class='selected-term'>Jim Jordan</span>.",
    "author": "The First",
    "title": "JORDAN: Hunter Biden ‘Took Millions of Dollars’ from Moscow, Ukraine, Chinese Communists"
  },
  {
    "id": 7817,
    "mediaId": 2724,
    "date": "2022-04-06",
    "sentence": "Breaking: Following @FDRLST reporting that Adam Schiff and his staff doctored a text message between <span class='selected-term'>Jim Jordan</span> and former WH chief of staff Mark Meadows, the House Jan. 6 committee has just admitted that it did, in fact, doctor the text message.https://t.co/78aRNyOib7\n— Mollie (@MZHemingway) December 15, 2021\nIt seems there isn’t much that Kinzinger isn’t willing to believe if it casts a negative pall on his political adversaries.",
    "author": "Rusty Weiss",
    "title": "Never Trumper Adam Kinzinger Falls For Fake Tucker Carlson Quote Shared By Fellow ‘Never Trumper’ Joe Walsh"
  },
  {
    "id": 7067,
    "mediaId": 2572,
    "date": "2022-04-07",
    "sentence": "(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nREP. <span class='selected-term'>JIM JORDAN</span>, (R-OH) HOUSE OVERSIGHT COMMITTEE RANKING MEMBER: We're launching an investigation because the real thing here was how Facebook and Twitter suppressed this information.",
    "author": "Fox News Staff",
    "title": "'Special Report' All-Star Panel on Russian war crime claims"
  },
  {
    "id": 5277,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Mack Cogburn",
    "title": "Photos: Elaborate, Staged Photoshoots In The Middle Of A War Zone Are Impossible Yet Here’s Zelensky Making One"
  },
  {
    "id": 5216,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Dan Negrea",
    "title": "The Breakup: Will Russia Splinter Over War in Ukraine?"
  },
  {
    "id": 6103,
    "mediaId": 2724,
    "date": "2022-04-21",
    "sentence": "RELATED: Video: <span class='selected-term'>Jim Jordan</span> Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nNothing New\nIt’s not that we are sending aid and equipment to Ukraine that causes me consternation.",
    "author": "Kathleen J. Anderson",
    "title": "Has Our Government Learned Its Lesson From The Afghan Withdrawal?"
  }
]