[
  {
    "id": 3680,
    "mediaId": 2614,
    "date": "2022-01-16",
    "sentence": "",
    "author": "Red Voice Media",
    "title": "Biden Gets Wrecked In 11 Seconds On CNN Of All Places, His 2022 Is Off To That Bad Of A Start [VIDEO]"
  },
  {
    "id": 3667,
    "mediaId": 2690,
    "date": "2022-01-20",
    "sentence": "pic.twitter.com/6zVW0lE0Ni\n— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) January 3, 2022\nREPORTER: \"Should members of congress and their spouses be banned from trading individual stocks while serving in congress?\"",
    "author": "",
    "title": "SHOWDOWN: Ex-Navy SEALs Running For Congress Unite To Take Down ‘Grave Threat’ Nancy Pelosi"
  },
  {
    "id": 3861,
    "mediaId": 2748,
    "date": "2022-01-24",
    "sentence": "",
    "author": "",
    "title": "Must See: Tucker SLAMS Kamala's Illegitimate Election Claims"
  },
  {
    "id": 4107,
    "mediaId": 2600,
    "date": "2022-01-24",
    "sentence": "Ohio Republican Rep. <span class='selected-term'>Jim Jordan</span> says the Democrats committee investigating the incident at the U.S. Capitol last January is a “complete assault on Americans’ liberty.”\nJordan said the Dem-led investigation is a “political operation” designed to stop Donald Trump from running for the White House again.",
    "author": "IWB",
    "title": "Jordan Demands Investigation Into Nancy Pelosi After Disturbing Revelation"
  },
  {
    "id": 3728,
    "mediaId": 2618,
    "date": "2022-01-26",
    "sentence": "",
    "author": "Leslie Eastman",
    "title": "Sen. Ron Johnson Hosts “Second Opinion” Panel on America’s Problematic Pandemic Response"
  },
  {
    "id": 3580,
    "mediaId": 2658,
    "date": "2022-01-26",
    "sentence": "The plant is outside Turner’s Dayton-based congressional district, instead belonging to Republican <span class='selected-term'>Jim Jordan</span>‘s district.",
    "author": "",
    "title": "Lawmakers' answer to the Russia-Ukraine crisis: Weapons made in their states"
  },
  {
    "id": 3190,
    "mediaId": 2746,
    "date": "2022-01-31",
    "sentence": "The signers are House Republican Whip Steve Scalise, plus Reps. James Comer, <span class='selected-term'>Jim Jordan</span>, Mark E. Green, Nicole Malliotakis and Mariannette Miller-Meeks.",
    "author": "Jennifer Harper",
    "title": "CBP shows American heroism on the southern border"
  },
  {
    "id": 3321,
    "mediaId": 8322,
    "date": "2022-02-01",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, joined \"The Ingraham Angle\" on Monday to discuss what he believes are unprecedented moves from the Biden administration against law-abiding Americans.",
    "author": "Fox News Staff",
    "title": "Rep. Jim Jordan: Second Amendment under attack by Biden administration"
  },
  {
    "id": 3072,
    "mediaId": 2748,
    "date": "2022-02-01",
    "sentence": "Monday on FNC’s “The Ingraham Angle,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) condemned the Biden administration’s use of government power to infringe on the exercise of First and Second Amendment rights.",
    "author": "Women System",
    "title": "Jordan: ‘Scary Stuff’ What the Biden Administration Has Done with First Amendment Rights, Second Amendment Liberties"
  },
  {
    "id": 2838,
    "mediaId": 2644,
    "date": "2022-02-02",
    "sentence": "“Because in impeachment proceedings, the American public has the right to know all the evidence.”\nUS Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) also called it “frightening” to learn that Trump “wasn’t allowed to have information that he’s entitled to have to put on his defense.”\nA State Department spokesperson said, “We do not comment on matters under litigation.”",
    "author": "Bruce Golding",
    "title": "Classified 2016 email shows US diplomat warning of Hunter Biden deals in Ukraine"
  },
  {
    "id": 2754,
    "mediaId": 2643,
    "date": "2022-02-03",
    "sentence": "Furthermore, other names—such as staunchly pro-Trump GOP Representative <span class='selected-term'>Jim Jordan</span> of Ohio—have been floated for the top post in the legislative body.",
    "author": "Jason Lemon",
    "title": "Trump, Kevin McCarthy Have Equal Support to Be Next House Speaker: Poll"
  },
  {
    "id": 3308,
    "mediaId": 2526,
    "date": "2022-02-03",
    "sentence": "Politico also acknowledges that Republican lawmakers have flocked to Breitbart to condemn the legislation:\nBut the bill has also attracted major GOP critics such as Florida Sen. Marco Rubio, Tennessee Sen. Marsha Blackburn, House Minority Leader Kevin McCarthy and House Judiciary ranking member <span class='selected-term'>Jim Jordan</span> of Ohio, all of whom have done interviews with Breitbart opposing the legislation.",
    "author": "Allum Bokhari",
    "title": "Politico Attacks Breitbart for Not Joining Media Cartel Bandwagon"
  },
  {
    "id": 3116,
    "mediaId": 2910,
    "date": "2022-02-03",
    "sentence": "Devin Nunes, <span class='selected-term'>Jim Jordan</span>, Kash Patel and others point out how the greatest hoax in American political history was carried out.",
    "author": "",
    "title": "“The Plot Against The President”"
  },
  {
    "id": 1843,
    "mediaId": 2578,
    "date": "2022-02-06",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 1, 2022\nA federal firearm registry is explicitly banned by law.",
    "author": "Mike LaChance",
    "title": "Democrats Are Quietly Building A Gun Registry As A First Step In Gun Ban"
  },
  {
    "id": 1897,
    "mediaId": 2590,
    "date": "2022-02-07",
    "sentence": "Ron DeSantis, Sen. Ted Cruz (R-Texas), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Republican attorneys general who want to launch an investigation into GoFundMe for its police-requested action against a foreign protest organization.",
    "author": "Mary Papenfuss",
    "title": "Christian Fundraiser For Kyle Rittenhouse Now Collecting Millions For Ottawa Trucker Mob"
  },
  {
    "id": 2381,
    "mediaId": 2547,
    "date": "2022-02-07",
    "sentence": "",
    "author": "John Amato",
    "title": "Jim Jordan Is An Absurd Hypocrite, Part Infinity"
  },
  {
    "id": 2463,
    "mediaId": 2526,
    "date": "2022-02-07",
    "sentence": "The Democrats’ green card giveaway was repeatedly blasted by GOP leaders, including Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), and House GOP leader Kevin McCarthy, who said:\nThey call it the American Competes Act.",
    "author": "Neil Munro",
    "title": "Republican Sen. Todd Young: Migration Should Not Hurt Americans’ Wages"
  },
  {
    "id": 2341,
    "mediaId": 2641,
    "date": "2022-02-09",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax that House Speaker Nancy Pelosi, D-Calif., was wrong to tell athletes at the 2022 Beijing Winter Olympics not to protest.",
    "author": "Nick Koutsobinas",
    "title": "Rep. Jim Jordan to Newsmax: Pelosi Wrong to Tell Olympians Not to Speak Out"
  },
  {
    "id": 1797,
    "mediaId": 2573,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Kyle Morris",
    "title": "DHS tracking reports of potential truck convoy in America amid Canada trucker protests"
  },
  {
    "id": 1995,
    "mediaId": 2625,
    "date": "2022-02-09",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) February 9, 2022",
    "author": "Matt Reynolds",
    "title": "Fauci Says “Full-Blown” Pandemic Is Almost Over"
  },
  {
    "id": 2170,
    "mediaId": 6621,
    "date": "2022-02-10",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) stopped by Fox News’ The Ingraham Angle to absolutely destroy the Democratic narrative that Republicans and Donald Trump are a threat to Democracy.",
    "author": "",
    "title": "‘AMERICANS HAVE HAD IT WITH ELITE MINDSET’: Watch Jim Jordan Go SCORCHED EARTH on Dems"
  },
  {
    "id": 1628,
    "mediaId": 4064,
    "date": "2022-02-11",
    "sentence": "Other prominent conservatives, such as Dinesh D’Souza, Sean Hannity, and Representative <span class='selected-term'>Jim Jordan</span>, soon followed.",
    "author": "",
    "title": "What Are the Details of the Trump Media and Rumble Partnership?"
  },
  {
    "id": 1302,
    "mediaId": 2664,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Chauncey Devega",
    "title": "Joe Walsh on what the left doesn't get: TrumpWorld 'would happily burn this country down'"
  },
  {
    "id": 977,
    "mediaId": 2590,
    "date": "2022-02-12",
    "sentence": "Ron DeSantis, Elon Musk, Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), and Donald Trump and son Donald Trump Jr.\nGoFundMe earlier this month shut down a site that had raised close to $10 million for the truckers after Ottawa police reached out to the company to complain of illegal activity by the truckers.",
    "author": "Mary Papenfuss",
    "title": "Canadian Judge Blocks Money For Truckers From U.S. Right-Wing Christian Fundraising Site"
  },
  {
    "id": 1192,
    "mediaId": 8322,
    "date": "2022-02-14",
    "sentence": "",
    "author": "",
    "title": "Biden ATF suggests Americans report current, former partners' 'illegal gun activity' for Valentine’s Day"
  },
  {
    "id": 997,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Rob Crilly",
    "title": "'I can't speak to that': Biden's Deputy Press Secretary Karine Jean-Pierre tells reporter THREE times to go to the DOJ when pressed on Durham's bombshell allegations Hillary spied on Trump when he was president and Biden knew about it"
  },
  {
    "id": 1255,
    "mediaId": 2618,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Christina Coulter",
    "title": "Florida woman, 33, 'used $15,000 pandemic relief loan to bankroll a hit on TSA agent who stole her boyfriend': Victim, 24, was gunned down outside her Miami home in front of her three-year-old daughter"
  },
  {
    "id": 983,
    "mediaId": 2618,
    "date": "2022-02-17",
    "sentence": "",
    "author": "Paul Sperry",
    "title": "The Checkered Past of the FBI Cyber Contractor Who 'Spied' on Trump"
  },
  {
    "id": 1433,
    "mediaId": 2866,
    "date": "2022-02-18",
    "sentence": "Ohio Rep. <span class='selected-term'>Jim Jordan</span>, the top Republican on the House Judiciary Committee, is requesting the Justice Department provide information about its new domestic terrorism office, considering the agency’s plans last year regarding parents at school board meetings.",
    "author": "Fix This Nation Staff",
    "title": "Are School Parents A Target With DOJ’s New Domestic Terror Office?"
  },
  {
    "id": 1475,
    "mediaId": 2584,
    "date": "2022-02-18",
    "sentence": "The Ohio congressman <span class='selected-term'>Jim Jordan</span> similarly decried GoFundMe.",
    "author": "Sergio Olmos",
    "title": "Republicans who opposed racial justice protests hope truckers ‘clog up’ US cities"
  },
  {
    "id": 18,
    "mediaId": 8322,
    "date": "2022-02-21",
    "sentence": "Ric Grenell\nFormer Rep. Tulsi Gabbard, D-Hawaii, and former Democratic presidential candidate\nSaturday, Feb. 26\nRep. Marjorie Taylor Greene, R-Ga.\nRepublican National Committee Chair Ronna McDaniel\nRep. Ronny Jackson, R-Texas\nFormer Assistant Secretary of the Treasury for Public Affairs Monica Crowley\nSen. Bill Hagerty, R-Tenn.\nSen. Rick Scott, R-Fla.\nRep. <span class='selected-term'>Jim Jordan</span>, R-Ohio\nSen. John Kennedy, R-La.",
    "author": "",
    "title": "CPAC to kick off under banner of 'Awake not Woke,' serve as 'starting gun' for Republicans ahead of midterms"
  },
  {
    "id": 592,
    "mediaId": 6621,
    "date": "2022-02-22",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) has written a letter to House Judiciary Committee Chairman Jerrold Nadler (D-NY) imploring him to investigate the disastrous “soft on crime” policies that have triggered a spike in shoplifting crimes nationwide.",
    "author": "",
    "title": "JORDAN ON SHOPLIFTING SPREES —DO SOMETHING! ‘Stores Suffering,’ Urges Judiciary Committee Action"
  },
  {
    "id": 341,
    "mediaId": 2618,
    "date": "2022-02-23",
    "sentence": "",
    "author": "Monica Showalter",
    "title": "Doddering Biden volunteers America for higher energy prices to defend Ukraine's borders"
  },
  {
    "id": 150,
    "mediaId": 2672,
    "date": "2022-02-24",
    "sentence": "But only a few days later, during a segment with Rep. <span class='selected-term'>Jim Jordan</span>, Tucker voiced the same sentiment more clearly: “I think we should probably take the side of Russia,” he said, “if we have to choose between Russia and Ukraine.”\nDespite saying that he was \"just kidding\" about rooting for Russia over Ukraine, Tucker just doubled down on supporting the Russians in the conflict.",
    "author": "Tim Dickinson",
    "title": "These Are the American Right-Wingers Covering for Putin as Russia Invades Ukraine"
  },
  {
    "id": 325,
    "mediaId": 2594,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Andrew Naughtie",
    "title": "Trump news: White House slams Putin ‘scheme’ as ex-president rejects House speaker plan"
  },
  {
    "id": 473,
    "mediaId": 2702,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Morgan Chalfant",
    "title": "Biden says Jackson will bring ‘uncompromising integrity’ to Supreme Court"
  },
  {
    "id": 13280,
    "mediaId": 6449,
    "date": "2022-02-26",
    "sentence": "But as Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, explains, the committee has abandoned that job in favor of trying to “get” President Donald Trump.",
    "author": "Douglas Blair",
    "title": "Rep. Jim Jordan: Jan. 6 Committee ‘Totally Out to Get President Trump’"
  },
  {
    "id": 12955,
    "mediaId": 2584,
    "date": "2022-02-28",
    "sentence": "",
    "author": "David Smith",
    "title": "Trump ignores Farage – and risks midterm elections farrago – with insistence on big lie"
  },
  {
    "id": 13206,
    "mediaId": 2724,
    "date": "2022-03-01",
    "sentence": "https://t.co/rJ4GDf6hlH\n— Gary Weiss (@gary_weiss) February 28, 2022\nRELATED: Video: <span class='selected-term'>Jim Jordan</span> Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nPsaki then touted Biden’s leadership abilities.",
    "author": "John Hanson",
    "title": "ABC’s George Stephanopoulos Breaks The News To Psaki That A Majority Of Americans ‘Question The President’s Mental Capacity’"
  },
  {
    "id": 12556,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "Lawmakers across the political spectrum support a significant boost in funding for the Ukrainian military.”\nFunding and arming Ukraine has widespread bipartisan support in Congress, as evidenced by the fact that Rep. KATIE PORTER (D-Calif.) and Rep. <span class='selected-term'>JIM JORDAN</span> (R-Ohio) — who see eye to eye on very little, if anything — clapped about the same things they were told in a classified hearing.",
    "author": "",
    "title": "Tell us how the Ukraine war ends"
  },
  {
    "id": 12773,
    "mediaId": 2724,
    "date": "2022-03-01",
    "sentence": "— Sahil Kapur (@sahilkapur) February 22, 2022\nRELATED: Video: <span class='selected-term'>Jim Jordan</span> Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nTrump and other conservatives have been accused of supporting Russia\n“We could use that on our southern border.",
    "author": "John Hanson",
    "title": "Joy Behar Claims Trump Supports Russia And It’s Because Of ‘White Supremacy’"
  },
  {
    "id": 12692,
    "mediaId": 2724,
    "date": "2022-03-03",
    "sentence": "",
    "author": "RealClearWire",
    "title": "Are We Nuts? American Energy Is Key To Undermining Putin’s War"
  },
  {
    "id": 13263,
    "mediaId": 2745,
    "date": "2022-03-03",
    "sentence": "Two of the senior House Republicans leading the drafting effort, Reps. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Cathy McMorris Rodgers (R-Wash.), previewed other potential planks this week.",
    "author": "",
    "title": "Republican clash shows the enduring appeal, and dubious benefit, of campaign platforms"
  },
  {
    "id": 13310,
    "mediaId": 2609,
    "date": "2022-03-04",
    "sentence": "Ohio congressman <span class='selected-term'>Jim Jordan</span> (R) indicates an investigation into Fauci is a priority if they regain a majority in November’s midterms.",
    "author": "Leslie Eastman",
    "title": "Where in the World Has Dr. Anthony Fauci Gone?"
  },
  {
    "id": 12956,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Kevin Haggerty",
    "title": "Biden claims he enjoyed ‘teaching’ and misses ‘being a professor at Penn’. Except he never taught there."
  },
  {
    "id": 13165,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "(Snip) Ohio congressman <span class='selected-term'>Jim Jordan</span> (R) indicates an investigation into Fauci is a priority if they regain a majority in November’s midterms.",
    "author": "Leslie Eastman",
    "title": "Where in the World Has Dr. Anthony Fauci Gone?"
  },
  {
    "id": 12790,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Eric R. Mandel",
    "title": "While America watches the war in Ukraine, Biden finalizes a dangerous Iran deal"
  },
  {
    "id": 12812,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Ashe Schow",
    "title": "San Francisco Becomes First City To See $5 Per Gallon At The Pump"
  },
  {
    "id": 12726,
    "mediaId": 2727,
    "date": "2022-03-06",
    "sentence": "One of the endorsees, <span class='selected-term'>Jim Jordan</span> of Ohio, was so prominent in the events surrounding the January 6 insurrection, which led to deadly violence, that he has been invited to testify before the congressional committee investigating the event.",
    "author": "JTA and TOI staff",
    "title": "AIPAC slammed for endorsing Republicans who refused to certify Biden’s election"
  },
  {
    "id": 12676,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Tim Lister *",
    "title": "Fears grow for Ukrainian civilians after checkpoint is shelled and evacuations fail for a second day"
  },
  {
    "id": 12482,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Tanaya Macheel",
    "title": "U.S. crude oil tops $130 a barrel, a 13-year high on possible Western ban of Russian oil"
  },
  {
    "id": 12524,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Anthony",
    "title": "Amazing Video Shows The People’s Convoy Stretched Out Over 60 Miles"
  },
  {
    "id": 12536,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Keith Griffith *",
    "title": "US gives Poland the 'green light' to give Ukraine MIG fighter jets as Russia warns it is at WAR with ANY country hosting Kyiv's aircraft and points finger at Romania as top American general inspects troops in Europe"
  },
  {
    "id": 12532,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Karol Markowicz",
    "title": "Why we must demand that leaders who got COVID wrong admit it and apologize"
  },
  {
    "id": 12513,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Gina Martinez",
    "title": "'This is a massive crime against humanity': Trump says we 'can't let' the situation in Ukraine continue and slams 'paper tiger' NATO for its inaction"
  },
  {
    "id": 11428,
    "mediaId": 2724,
    "date": "2022-03-07",
    "sentence": "Rogers’ comments are similar to those of Rep. <span class='selected-term'>Jim Jordan</span>, who argued last week that Biden is essentially being held hostage by the far-left of his party.",
    "author": "John Hanson",
    "title": "Republican Rep. Mike Rogers: Every Barrel Of Russian Oil U.S. Buys Has ‘Ukrainian Blood On It’"
  },
  {
    "id": 15207,
    "mediaId": 8413,
    "date": "2022-03-07",
    "sentence": "An opponent, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, said the bill was unnecessary because \"under current law, if a person's hairstyle or hair texture is associated with a person's race or national origin and is used as a pretext for discrimination, that conduct is unlawful.\"",
    "author": "Targeted News Service",
    "title": "Here's a look at how area members of Congress voted"
  },
  {
    "id": 10786,
    "mediaId": 2573,
    "date": "2022-03-08",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, slammed President Biden on \"Fox & Friends\" Tuesday for being \"afraid\" to stand up to Democrats on increasing U.S. energy production as gas prices skyrocket amid the Russia-Ukraine war.",
    "author": "Fox News Staff",
    "title": "Jim Jordan blasts Biden over oil: He's talking to other countries because he's afraid to stand up to his party"
  },
  {
    "id": 11156,
    "mediaId": 2618,
    "date": "2022-03-08",
    "sentence": "",
    "author": "Claire Giangravé",
    "title": "Archbishop Viganò pushes conspiracy theories about Ukraine and Russia in 10,000-word letter"
  },
  {
    "id": 10706,
    "mediaId": 2572,
    "date": "2022-03-09",
    "sentence": "Crabtree said that his fellow guest, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, was the only person to voice disapproval at a congressional hearing with major companies' CEOs that saw promises to halt energy production.",
    "author": "",
    "title": "Rising gas prices have 'everything to do' with Biden says former Keystone XL pipeline worker"
  },
  {
    "id": 10745,
    "mediaId": 2594,
    "date": "2022-03-09",
    "sentence": "But then House Speaker Nancy Pelosi vetoed the membership of Reps Jim Banks of Indiana and <span class='selected-term'>Jim Jordan</span> of Ohio.",
    "author": "Eric Garcia",
    "title": "Republican National Committee sues the January 6 Committee for ‘unlawfully seizing information’"
  },
  {
    "id": 11088,
    "mediaId": 2664,
    "date": "2022-03-09",
    "sentence": "\\n\\n\"Which U.S. President had discussions with <span class='selected-term'>Jim Jordan</span> just prior to his supporters attacking the U.S. Capitol in an attempted coup?\"",
    "author": "Travis Gettys",
    "title": "'Bootlicker' Jim Jordan soundly mocked for one-word 'Trump' tweet: 'Really? That's the tweet?'"
  },
  {
    "id": 11226,
    "mediaId": 2846,
    "date": "2022-03-09",
    "sentence": "",
    "author": "",
    "title": "Report: Biden Tried To Ask Saudis And UAE For More Oil But They REFUSED To Take His Calls"
  },
  {
    "id": 11231,
    "mediaId": 2590,
    "date": "2022-03-10",
    "sentence": "Biden “shut off the Keystone Pipeline,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) declared in an interview last week.",
    "author": "Chris D'Angelo",
    "title": "The GOP's Biggest Whoppers About Biden And Fossil Fuels"
  },
  {
    "id": 11107,
    "mediaId": 2557,
    "date": "2022-03-11",
    "sentence": "https://t.co/KLL7SoYIzP\n— Donald Trump Jr. (@DonaldJTrumpJr) March 10, 2022\nRep. <span class='selected-term'>Jim Jordan</span> tweeted Tuesday, “Keystone Pipeline.",
    "author": "",
    "title": "VIDEO: Americans blast Biden for halting Keystone Pipeline: ‘Killed our economy’"
  },
  {
    "id": 11026,
    "mediaId": 2625,
    "date": "2022-03-11",
    "sentence": "Biden “shut off the Keystone Pipeline,” Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) declared in an interview last week.",
    "author": "Chris D’Angelo",
    "title": "The GOP’s Four Biggest Lies About Joe Biden and Fossil Fuels"
  },
  {
    "id": 11267,
    "mediaId": 2866,
    "date": "2022-03-11",
    "sentence": "Pelosi and the committee are weaponizing and abusing Congress’ investigatory power.”\nWe here have long maintained that Pelosi’s committee is illegitimate, having rejected two Republicans that McCarthy appointed to the Committee – Reps. <span class='selected-term'>Jim Jordan</span> (R-OH) and Jim Banks (R-IN) – an abuse of power for purely political reasons.",
    "author": "Bill Sheridan",
    "title": "RNC Sues Nancy Pelosi and Jan. 6 Committee for Overreach!"
  },
  {
    "id": 11024,
    "mediaId": 2641,
    "date": "2022-03-14",
    "sentence": "The letter, authored by GOP Reps. <span class='selected-term'>Jim Jordan</span> of Ohio, John Katko of New York, Michael McCaul of Texas and Mike Turner of Ohio, stated that ''Burkov has been described as an 'asset of supreme importance' and 'one of the most connected and skilled malicious hackers ever apprehended by U.S.",
    "author": "Jeremy Frankel",
    "title": "Republicans Demand Answers on Release of Russian Cyber Criminal"
  },
  {
    "id": 11090,
    "mediaId": 2618,
    "date": "2022-03-16",
    "sentence": "",
    "author": "Terresa Monroe-Hamilton",
    "title": "Biden to announce $1B arms package, weighs giving Ukraine tank-killing Switchblade ‘kamikaze’ drones"
  },
  {
    "id": 11444,
    "mediaId": 2668,
    "date": "2022-03-16",
    "sentence": "House Judiciary Committee Ranking Member Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and Rep. Dan Bishop (R-N.C.) also went off, according to the DC, with Jordan calling it “crazy” and pointing out that everything about the Capitol is taxpayer-funded, and Bishop calling it “absurd” and noting that “the new normal for Democrats [is] to treat working-class Americans with disdain.”\nSen. Marshall also took shots at Politico for its breathless reporting:\nPulitzer Prize-winning article right here ?",
    "author": "Sister Toldjah",
    "title": "Kansas Senator Responds Accordingly to 'Hill Aide' Who Reported His Trucker Convoy Tour to the DOJ"
  },
  {
    "id": 10700,
    "mediaId": 2572,
    "date": "2022-03-17",
    "sentence": "",
    "author": "Tyler Olson",
    "title": "Over 50 House Republicans back Banks' resolution opposing Iran nuclear deal amid Russia-Ukraine war"
  },
  {
    "id": 10720,
    "mediaId": 2664,
    "date": "2022-03-18",
    "sentence": "Opponents of the bill, like the Republican <span class='selected-term'>Jim Jordan</span>, accused Democrats of \"avoiding the issues the American people care about,\" like inflation and the soaring cost of gasoline.",
    "author": "Agence France-Presse",
    "title": "US Congress moves to ban discrimination of race-related hairstyles"
  },
  {
    "id": 11439,
    "mediaId": 2771,
    "date": "2022-03-18",
    "sentence": "That’s why I cannot stand idly by when an organization that claims to speak for me — and claims to support American and Israeli democracy — endorses candidates such as <span class='selected-term'>Jim Jordan</span> of Ohio who have excused and justified insurrection.",
    "author": "Nathan Wolfson",
    "title": "AIPAC’s far-right endorsements show how out of touch they are with American Jews"
  },
  {
    "id": 11530,
    "mediaId": 2712,
    "date": "2022-03-18",
    "sentence": "\"Fourteen months of chaos and we're doing a bill on hair,\" Republican Rep. <span class='selected-term'>Jim Jordan</span> of Ohio said on the House floor.",
    "author": "Jennifer Roback",
    "title": "What is the Crown Act?"
  },
  {
    "id": 9652,
    "mediaId": 2909,
    "date": "2022-03-20",
    "sentence": "",
    "author": "Deneen Borelli",
    "title": "Liberal Media Silent Over Hunter Biden Laptop – Again"
  },
  {
    "id": 9425,
    "mediaId": 2748,
    "date": "2022-03-20",
    "sentence": "House Judiciary Committee Ranking Member <span class='selected-term'>Jim Jordan</span> (R-OH) said on the House floor ahead of the vote that Americans already cannot be discriminated against their hairstyle and that Congress should focus on pressing issues such as inflation, Russia, and rising gas prices.",
    "author": "Blarp Blog",
    "title": "House Democrats Vote on Alleged Anti-Hair Discrimination amid Ukraine Crisis, Rising Inflation"
  },
  {
    "id": 9420,
    "mediaId": 2618,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Lahav Harkov",
    "title": "US offering $1 million to report on Israeli human rights violations"
  },
  {
    "id": 9475,
    "mediaId": 2728,
    "date": "2022-03-23",
    "sentence": "Other Republicans involved in the effort to overturn the 2020 election — Reps. <span class='selected-term'>Jim Jordan</span> of Ohio and Scott Perry of Pennsylvania — have refused requests from the panel for interviews.",
    "author": "Luke Broadwater",
    "title": "Mo Brooks says Donald Trump asked him to illegally ‘rescind’ the 2020 election"
  },
  {
    "id": 9366,
    "mediaId": 2877,
    "date": "2022-03-23",
    "sentence": "But the Kremlin can.” —Congressman <span class='selected-term'>Jim Jordan</span>\nNon Compos Mentis Awards\n“I can’t.",
    "author": "Jordan Candler",
    "title": "Wednesday Short Cuts"
  },
  {
    "id": 9775,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "She added that Republicans plan to fire “lame duck” House Speaker Nancy Pelosi (D-NY) “once and for all.”\nThe Task Force Leaders of each topic are as follows:\nJobs and the Economy: Rep. Patrick McHenry (R-NC)\nBig Tech Censorship and Data: Rep. Cathy Rodgers (WA)\nFuture of American Freedoms: Rep. <span class='selected-term'>Jim Jordan</span> (R-OH)\nEnergy, Climate and Conservation: Rep. Garret Graves (R-LA)\nAmerican Security: Rep. John Katko (R-NY)\nHealthy Futures: Rep. Brett Guthrie (R-KY) and Rep. Vern Buchanan (R-FL)\nChina Accountability: Rep. Michael McCaul (R-TX)\nDuring the press conference, each Republican member provided a brief preview of the agenda items of their task force .",
    "author": "Hannah Bleau",
    "title": "House Republican Leadership Announces Taskforce Leaders to Fix Biden’s Failures"
  },
  {
    "id": 8970,
    "mediaId": 2745,
    "date": "2022-03-24",
    "sentence": "She wrote, “House and Senate guys are pathetic too... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy.” She appeared to be referring to Republican House members Louie Gohmert of Texas, <span class='selected-term'>Jim Jordan</span> of Ohio, Paul A. Gosar of Arizona and Chip Roy of Texas.",
    "author": "",
    "title": "Virginia Thomas urged White House chief to pursue unrelenting efforts to overturn the 2020 election, texts show"
  },
  {
    "id": 9567,
    "mediaId": 2644,
    "date": "2022-03-25",
    "sentence": "If it’s constitutional, that’s what his job should be — it’s him.”\nRep. <span class='selected-term'>Jim Jordan</span> (R-Ohio), who was seated next to McCarthy at the event, agreed with the minority leader, saying, “Totally.”\nWhile Wyden remains the only lawmaker to call on Thomas to recuse himself, several legal experts have made similar comments.",
    "author": "Callie Patteson",
    "title": "Clarence Thomas called to recuse himself over wife’s alleged texts"
  },
  {
    "id": 9755,
    "mediaId": 2753,
    "date": "2022-03-25",
    "sentence": "Future of American Freedoms\nThe Biden administration has put American freedoms in jeopardy, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, said.",
    "author": "WND News Services",
    "title": "GOP lawmakers cite 7 ways the left has failed Americans"
  },
  {
    "id": 9552,
    "mediaId": 8290,
    "date": "2022-03-27",
    "sentence": "When the progressive establishment asks, “why can’t we all just get along,” or “how do we heal America?” what they are really saying is they long to return to the day when everyone knew their place and today’s MAGA fighters like Jenny Beth Martin, Kimberly Fletcher, Tom Fitton, James O’Keefe, Charlie Kirk, <span class='selected-term'>Jim Jordan</span>, Chip Roy, Lauren Boebert, Louie Gohmert, Josh Hawley, Mike Lee, Rand Paul, Ted Cruz, Ron DeSantis and Donald Trump were not rocking the boat and effectively opposing their ”woke” agenda.",
    "author": "Richard A. Viguerie",
    "title": "Why Can’t We All Get Along?"
  },
  {
    "id": 8927,
    "mediaId": 2526,
    "date": "2022-03-28",
    "sentence": "When it came to the National School Board Association letter, those were questions that I asked on the House Intelligence Committee that <span class='selected-term'>Jim Jordan</span> then followed up with on the Committee on the Judiciary really probing.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Elise Stefanik on Biden Family Subpoenas: ‘I Would Support Those’"
  },
  {
    "id": 8921,
    "mediaId": 2618,
    "date": "2022-03-29",
    "sentence": "",
    "author": "Callie Patteson",
    "title": "AOC: Clarence Thomas should resign or face impeachment over wife’s texts"
  },
  {
    "id": 8999,
    "mediaId": 2526,
    "date": "2022-03-29",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) said last week.",
    "author": "Wendell Husebø",
    "title": "Poll: Trump Leads Biden by 6 Points in 2024 Potential Matchup"
  },
  {
    "id": 9121,
    "mediaId": 2745,
    "date": "2022-03-29",
    "sentence": "8:34 a.m. — Kurt Olsen\n8:37 a.m. — Stephen K. Bannon\n8:45 a.m. — Rudy Giuliani\n8:56 a.m. — Requests White House Chief of Staff Mark Meadows\n9:02 a.m. — Requests Vice President Mike Pence\n9:16 a.m. — Requests Senate Majority Leader Mitch McConnell (R-Ky.) (a call that an aide says the senator declined)\n9:24 a.m. — Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio)\n9:39 a.m. — Requests Sen. Josh Hawley (R-Mo.)",
    "author": "",
    "title": "The inexplicable gap in the Trump White House’s Jan. 6 records"
  },
  {
    "id": 9683,
    "mediaId": 2862,
    "date": "2022-03-29",
    "sentence": "Conservatives have pointed out that the FBI’s investigation into the 6 January events found no evidence of a conspiracy and also the Select Committee had refused to include lawmakers such as Congressman <span class='selected-term'>Jim Jordan</span> that would be critical of its activities and narrative.",
    "author": "",
    "title": "Trump Denies Use of 'Burner Phone' on 6 Jan. as Seven-Hour Gap in Phone Logs Raises Questions"
  },
  {
    "id": 9706,
    "mediaId": 2694,
    "date": "2022-03-30",
    "sentence": "PSYOP.”\nThe communications between Meadows and Thomas disclosed her anger that so few Republicans were rallying behind Trump in the way that Representatives Louie Gohmert, <span class='selected-term'>Jim Jordan</span>, Paul Gosar, and Chip Roy were.",
    "author": "Peter Wehner",
    "title": "A Glimpse Into a Fearful, Angry, Imaginary World"
  },
  {
    "id": 7944,
    "mediaId": 2602,
    "date": "2022-03-31",
    "sentence": "Present at the talk were Senator Mike Lee (R-UT) and Congressmen <span class='selected-term'>Jim Jordan</span> (R-OH), Louis Gohmert (R-TX), Andy Harris (Maryland), Andy Barr (R-KY), Doug Lamborn (R-CO), Bill Johnson (R-OH), Barry Moore (R-AL) and Russ Fulcher (R-ID).",
    "author": "JERUSALEM POST STAFF",
    "title": "Netanyahu tells Congressmen that the Iran Deal is bad for the US"
  },
  {
    "id": 7854,
    "mediaId": 2523,
    "date": "2022-03-31",
    "sentence": "By her account, when McCarthy told Trump it was his own supporters breaking into the building, Trump responded: “Well, Kevin, I guess these people are more upset about the election than you are.”\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "The Associated Press",
    "title": "Mapping out Donald Trump’s 8-hour gap in the phone records"
  },
  {
    "id": 9531,
    "mediaId": 2727,
    "date": "2022-03-31",
    "sentence": "I will call out people like Rep. <span class='selected-term'>Jim Jordan</span> and Matt Gaetz and the like for their dangerous libel and the manipulative manner that they are subverting the democracy they are sworn to uphold.",
    "author": "",
    "title": "I’m sticking with AIPAC. You should too!"
  },
  {
    "id": 7130,
    "mediaId": 2631,
    "date": "2022-03-31",
    "sentence": "Everybody’s concerned about that story,” said Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, a Trump loyalist who is likely to chair the Judiciary Committee if Republicans win the House back in November.",
    "author": "",
    "title": "Republicans squirm as Trump presses Putin for dirt on Bidens"
  },
  {
    "id": 7263,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "On Tuesday, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, hailed Burkov's initial capture as a major coup for U.S. law officials.",
    "author": "Jason Clemons",
    "title": "Russian Hacker's Mysterious Status Raises Concerns of US Cyberattack"
  },
  {
    "id": 7814,
    "mediaId": 2607,
    "date": "2022-03-31",
    "sentence": "By her account, when McCarthy told Trump it was his own supporters breaking into the building, Trump responded: “Well, Kevin, I guess these people are more upset about the election than you are.”\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "Colleen Long",
    "title": "Trump’s 8-hour gap: Minute-by-minute during Jan. 6 riot"
  },
  {
    "id": 7572,
    "mediaId": 2707,
    "date": "2022-03-31",
    "sentence": "By her account, when McCarthy told Trump it was his own supporters breaking into the building, Trump responded: “Well, Kevin, I guess these people are more upset about the election than you are.”\nTrump also talked to Ohio Rep. <span class='selected-term'>Jim Jordan</span> and Sen. Tommy Tuberville of Alabama, among other GOP lawmakers.",
    "author": "The Associated Press",
    "title": "Mapping out Donald Trump’s 8-hour gap in the phone records"
  },
  {
    "id": 7464,
    "mediaId": 2562,
    "date": "2022-03-31",
    "sentence": "On Tuesday, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, hailed Burkov's initial capture as a major coup for U.S. law officials.",
    "author": "NationalWatch",
    "title": "Russian Hacker’s Mysterious Status Raises Concerns of US Cyberattack"
  },
  {
    "id": 7477,
    "mediaId": 2548,
    "date": "2022-03-31",
    "sentence": "In this episode, Vince and Jason sit down with Ohio Republican Representative <span class='selected-term'>Jim Jordan</span> to discuss invoking the 25th amendment on Joe Biden, Trump vs. Biden on the border and inflation crises’, and some extreme Hunter Biden drama.",
    "author": "",
    "title": "Invoking The 25th Amendment & Hunter Biden Drama | Guest Rep. Jim Jordan | Vince & Jason Save The Nation"
  },
  {
    "id": 7268,
    "mediaId": 2526,
    "date": "2022-04-04",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> said two weeks ago in relation to winning back the House.",
    "author": "Wendell Husebø",
    "title": "Democrat Strategist: U.S. Has ‘Lost Confidence’ in Joe Biden, ‘Heading into a Recession’"
  },
  {
    "id": 7530,
    "mediaId": 2557,
    "date": "2022-04-05",
    "sentence": "“<span class='selected-term'>Jim Jordan</span>, my colleagues and I are ready to see this through to the end.”\nThe article goes on to state the following:\nIn the letter, the House Republicans reference a bombshell report from the New York Post published in the weeks leading up to the 2020 presidential election detailing the contents of Hunter Biden’s laptop that suggested he was using his father’s position of power for his own financial gain.",
    "author": "DML News App",
    "title": "REPORT: House Republicans put Hunter Biden’s legal team on notice over business dealings"
  },
  {
    "id": 7497,
    "mediaId": 6512,
    "date": "2022-04-05",
    "sentence": "Many of Trump's Republican allies have continued to prompt such narrative about the Presidential Election 2020, namely Reps. <span class='selected-term'>Jim Jordan</span>, Jim Banks, Paul Gosar, and Marjorie Taylor Greene.",
    "author": "Mary Webber",
    "title": "Donald Trump Admits He Didn't Win Presidential Election 2020 During Interview With Presidential Historians"
  },
  {
    "id": 7649,
    "mediaId": 2618,
    "date": "2022-04-06",
    "sentence": "",
    "author": "Star Parker",
    "title": "Gibson's Bakery Scores a Victory for Truth"
  },
  {
    "id": 7422,
    "mediaId": 2699,
    "date": "2022-04-07",
    "sentence": "One was Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), the influential de facto dean of the party’s right flank in Congress, the House Freedom Caucus.",
    "author": "Sam Brodey",
    "title": "Sarah Palin Is Back. Her GOP May Have Moved On."
  },
  {
    "id": 7942,
    "mediaId": 2663,
    "date": "2022-04-08",
    "sentence": "— Rep. <span class='selected-term'>Jim Jordan</span> (@Jim_Jordan) April 7, 2022\nJordan, who recently won Donald Trump‘s endorsement in his bid for re-election, was quoting an interview Eric gave earlier this week to NDT’s “Capitol Report” about Hunter Biden’s laptop.",
    "author": "Graham Gremore",
    "title": "Eric Trump is trending because of Jim Jordan so you know something stupid happened"
  },
  {
    "id": 5949,
    "mediaId": 6746,
    "date": "2022-04-10",
    "sentence": "According to Ohio Republican Representative for Ohio, <span class='selected-term'>Jim Jordan</span>; he said it was a veiled attempt to take away a possible victory of Donald Trump in 2014 again, cited Florida News.",
    "author": "Ed Forster",
    "title": "January 6 Committee Driven by Political Motives To Prevent Donald Trump From a 2024 White House Bid"
  },
  {
    "id": 5432,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Megan Myers",
    "title": "LinkedIn reinstates Air Force vet's post after wrongfully calling it 'hate speech,' apologizes"
  },
  {
    "id": 5363,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Nikolas Lanum",
    "title": "Washington Post column calls for gender to be removed from U.S. passports"
  },
  {
    "id": 5341,
    "mediaId": 2550,
    "date": "2022-04-19",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span> was elevated to omnipresence when he was exposed as one of the many, many athletic coaches in America who knew his athletes were being sexually molested and worked to cover it up.",
    "author": "Hunter\nDaily Kos Staff",
    "title": "'Libs of TikTok' founder exposed: Surprise, it's just another"
  },
  {
    "id": 5583,
    "mediaId": 2553,
    "date": "2022-04-20",
    "sentence": "Maybe Obama will beat Special Counsel John Durham to the punch by revealing the truth behind the phony Steele Dossier, the Clinton campaign’s role in the entire affair, and divulging details of who else was involved in what appears to be a cover-up and scandal involving allegations that were, as Congressman <span class='selected-term'>Jim Jordan</span> (R-OH) said on Monday, “it was made up.”\nAt the very least, Obama could apologize to former Trump campaign advisor Carter Page for the fact that FBI agents made “serious errors” that allowed the FISA court to grant the DOJ permission to spy on Page.",
    "author": "Tim Meads",
    "title": "Obama’s Warning About Disinformation Again. Let’s Take A Look At Some Examples, Shall We?"
  },
  {
    "id": 6103,
    "mediaId": 2724,
    "date": "2022-04-21",
    "sentence": "RELATED: Video: <span class='selected-term'>Jim Jordan</span> Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nNothing New\nIt’s not that we are sending aid and equipment to Ukraine that causes me consternation.",
    "author": "Kathleen J. Anderson",
    "title": "Has Our Government Learned Its Lesson From The Afghan Withdrawal?"
  },
  {
    "id": 5769,
    "mediaId": 2664,
    "date": "2022-04-21",
    "sentence": "His call for more “free speech” on Twitter is being taken up with enthusiasm by conservatives like US Reps. <span class='selected-term'>Jim Jordan</span> and Lauren Boebert, who see Musk as an ally in turning Twitter into a place where hateful and abusive speech are common and encouraged.",
    "author": "Noah Berlatsky",
    "title": "Elon Musk wants 'his speech to trump everyone else’s'"
  },
  {
    "id": 5901,
    "mediaId": 2532,
    "date": "2022-04-22",
    "sentence": "\"The American people deserve answers and accountability for the Biden administration's lawlessness along the southwest border\" Ohio Congressman <span class='selected-term'>Jim Jordan</span>, the top Republican on the Judiciary Committee, said earlier this week when announcing Mayorkas' appearance before the panel on April 28.",
    "author": "Camilo Montoya-Galvez",
    "title": "Mayorkas says U.S. is preparing for \"significant challenges\" along the border, asking countries to accept deportees"
  },
  {
    "id": 5494,
    "mediaId": 2924,
    "date": "2022-04-22",
    "sentence": "\"Among other things, the Board’s reactions to Elon Musk’s offer to purchase Twitter, and outsider opposition to Musk’s role in Twitter’s future are concerning,” <span class='selected-term'>Jim Jordan</span> (R-Ohio) and the other 17 lawmakers wrote.",
    "author": "Riley Gutiérrez McDermid",
    "title": "Elon Musk Bid For Twitter Gets Political As Lawmakers Demand Records"
  },
  {
    "id": 5237,
    "mediaId": 2618,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Alexander Connell",
    "title": "Secret Recording: Kevin McCarthy Told Liz Cheney He Would Tell Trump To Resign In Shocking Leaked Audio"
  },
  {
    "id": 5309,
    "mediaId": 2641,
    "date": "2022-04-22",
    "sentence": "Big Tech in the Crosshairs\n\"As Congress continues to examine Big Tech and how to best protect Americans’ free speech rights, this letter serves as a formal request that you preserve all records and materials relating to Musk’s offer to purchase Twitter, including Twitter’s consideration and response to this offer, and Twitter’s evaluation of its shareholder interests with respect to Musk’s offer,\" said the letter signed by the top Republican on the House Judiciary Committee, <span class='selected-term'>Jim Jordan</span>, and others on the committee.",
    "author": "",
    "title": "House Republicans Ask Twitter to Retain Musk Records"
  },
  {
    "id": 4960,
    "mediaId": 2643,
    "date": "2022-04-24",
    "sentence": "Meanwhile, after the recordings of the House minority leader were leaked, multiple Trump supporters, including those who have long criticized his leadership, suggested that GOP Representative <span class='selected-term'>Jim Jordan</span> of Ohio should replace him as the party's leader with the possibility that he could become House speaker if Republicans regain control of the legislative chamber after the midterm elections.",
    "author": "Fatma Khaled",
    "title": "Audio Leak Shows Kevin McCarthy 'Is a Liar and a Traitor': Elizabeth Warren"
  }
]