[
  {
    "id": 3413,
    "mediaId": 2746,
    "date": "2022-01-28",
    "sentence": "The four-page letter was signed by Reps. Andy Biggs of Arizona; Chip Roy of Texas; Cliff Bentz of Oregon; Dan Bishop of North Carolina; Darrell Issa of California; <span class='selected-term'>Jim Jordan</span> of Ohio; Ken Buck of Colorado; Louie Gohmert of Texas; Matt Gaetz of Florida; Michelle Fischbach of Minnesota; Mike Johnson of Louisiana; Scott Fitzgerald of Wisconsin; Tom McClintock of California; Tom Tiffany of Wisconsin; W. Gregory Steube of Florida and Victoria Spartz of Indiana.",
    "author": "Emily Zantow",
    "title": "House Republicans press DOJ on ‘racial discrimination’ in COVID-19 treatment policies"
  },
  {
    "id": 3471,
    "mediaId": 2746,
    "date": "2022-02-02",
    "sentence": "“The only way to fix this is by encouraging competition and allowing it and promoting it, not eliminating it, and certainly not giving people a hall pass to engage in contact that would challenge, threaten, and undermine it.”\nMr. Lee’s opposition to the legislation echoed complaints last year by Rep. <span class='selected-term'>Jim Jordan</span>, Ohio Republican, against the House version of the bill.",
    "author": "Ryan Lovelace",
    "title": "Antitrust panel examines bill to give news publishers more negotiating power against Big Tech"
  },
  {
    "id": 2403,
    "mediaId": 2707,
    "date": "2022-02-05",
    "sentence": "",
    "author": "Associated Press",
    "title": "Trump’s GOP: Party further tightens tie to former president"
  },
  {
    "id": 7108,
    "mediaId": 2644,
    "date": "2022-04-07",
    "sentence": "Trump confirmed that he spoke with House Minority Leader Kevin McCarthy (R-Calif.), Rep. <span class='selected-term'>Jim Jordan</span> (R-Ohio) and multiple other people, adding that he has a “very good memory.”\nPublic reports also reveal that Trump accidentally called Sen. Mike Lee (R-Utah), believing he was contacting Sen. Tommy Tuberville (R-Ala.), during the call log gap.",
    "author": "Callie Patteson",
    "title": "Trump blasts Jan. 6 panel’s 8-hour questioning of Ivanka as ‘harassment’"
  }
]