[
  {
    "id": 4471,
    "mediaId": 2658,
    "date": "2022-01-03",
    "sentence": "And House Minority Leader Kevin McCarthy and Judiciary Committee ranking member <span class='selected-term'>Jim Jordan</span> (R-Ohio) have expressed objections to many of the antitrust proposals, casting doubts on the future of these efforts if the GOP takes over the House next year.",
    "author": "",
    "title": "2022 kicks off with tech nomination do-overs"
  },
  {
    "id": 5574,
    "mediaId": 2594,
    "date": "2022-04-22",
    "sentence": "On those calls, according to Hutchinson, were representatives from Trump's legal team, including Rudy Giuliani, Jenna Ellis and Sidney Powell, as well as Reps. <span class='selected-term'>Jim Jordan</span> and Scott Perry.",
    "author": "Via AP news wire",
    "title": "Official: Meadows had been warned of possible 1/6 violence"
  },
  {
    "id": 5059,
    "mediaId": 2862,
    "date": "2022-04-23",
    "sentence": "In a December filing, Mark Meadows requested the invalidation of two “overly broad and unduly burdensome” subpoenas issued by the House panel probing the Jan... 23.04.2022, Sputnik International\nhttps://cdnn1.img.sputniknews.com/img/07e6/04/17/1094999985_0:0:3073:1728_1920x0_80_0_0_a8c9b5795920773e041faf2a45445b2a.jpg.webp\nWhite House Chief of Staff Mark Meadows was warned of impending violence in association with the certification of Electoral College votes in the 2020 US presidential election, claimed Cassidy Hutchinson, a special assistant in the Trump White House who recently testified before the House Select Committee to Investigate the January 6th Attack on the US Capitol.Hutchinson told the 9-member panel of seven Democrats and two Republicans that Anthony Oranto, assistant director of the US Secret Service Office of Training, informed Meadows that there were concerns of violence surrounding the certification of Electoral College votes led by then-Vice President Mike Pence.The details of their conversation was not made clear in the testimony, which was included in the Jan. 6 panel’s Friday court filing.Texts messages from Meadows’ phone were also released by the panel, including one authored by Rep. <span class='selected-term'>Jim Jordan</span> (R-OH), who told Meadows on Jan. 5 that Pence, as president of Congress, “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”Meadows has passed over 2,319 relevant text messages to the Jan. 6 panel, but has withheld some 1,000.",
    "author": "Evan Craighead",
    "title": "Mark Meadows Was Warned of Possible Violence Ahead of Jan. 6, Ex-Official Tells Panel"
  },
  {
    "id": 4715,
    "mediaId": 2532,
    "date": "2022-04-23",
    "sentence": "On those calls, according to Hutchinson, were representatives from Trump's legal team, including Rudy Giuliani, Jenna Ellis and Sidney Powell, as well as Reps. <span class='selected-term'>Jim Jordan</span> and Scott Perry.",
    "author": "",
    "title": "Meadows had been warned of possible Jan. 6 violence, official says"
  }
]