[
  {
    "id": 1533,
    "mediaId": 2618,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Chris Pleasance & Harriet Alexander",
    "title": "Russia says it is WITHDRAWING some troops from Ukraine in first sign of a climbdown after US intelligence said units were in 'attack positions' and warned of invasion 'by end of week' - but is it all just another one of Putin's deceptions?"
  },
  {
    "id": 117,
    "mediaId": 2564,
    "date": "2022-02-23",
    "sentence": "The Texas Republican senator posted two images of himself at Mar-a-Lago\nHe's in Florida to speak at the Conservative Political Action Conference Thurs\nTrump was hosting a fundraiser for 2022 GOP congressional candidates\nCruz moderated a chat with Georgia Senate candidate Herschel Walker\nTennessee House candidate Morgan Ortagus was also there, along with former Florida AG Pam Bondi, Florida Rep. Mike Waltz and Ohio Rep. <span class='selected-term'>Jim Jordan</span>\nTop-dollar VIP access cost $250,000 per seat, and basic attendance ran $3,000\nTexas Senator Ted Cruz revealed he was at Donald Trump's Mar-a-Lago club in on Wednesday, along with a host of national Republican figures who gathered at the Florida resort for a high-profile fundraiser.",
    "author": "Elizabeth Elkind",
    "title": "Trump meets Ted Cruz at Mar-a-Lago ahead of C-PAC: Republicans and conservative donors mingle at private Florida private club ahead of ex-President's prime-time Saturday night speech"
  },
  {
    "id": 111,
    "mediaId": 2550,
    "date": "2022-02-24",
    "sentence": "Jim Banks of Indiana, Rep. Vern Buchanan of Florida, Rep. Mike Carey of Ohio, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, Rep. Debbie Lesko of Arizona, Rep. Mary Miller of Illinois, Rep. Mike Waltz of Florida, Sen. Marsha Blackburn of Tennessee, Sen. Ted Cruz of Texas, and Sen. Lindsey Graham of South Carolina—should definitely be getting questions about what conversations they had with Trump about the issue and how they felt about being at an event that boosted his stature in the Republican Party and was sandwiched between times he praised Putin for invading Ukraine.",
    "author": "Laura Clawson",
    "title": "Republicans don't want to talk about Trump calling Putin 'smart.' Time for the media to make them"
  },
  {
    "id": 150,
    "mediaId": 2672,
    "date": "2022-02-24",
    "sentence": "But only a few days later, during a segment with Rep. <span class='selected-term'>Jim Jordan</span>, Tucker voiced the same sentiment more clearly: “I think we should probably take the side of Russia,” he said, “if we have to choose between Russia and Ukraine.”\nDespite saying that he was \"just kidding\" about rooting for Russia over Ukraine, Tucker just doubled down on supporting the Russians in the conflict.",
    "author": "Tim Dickinson",
    "title": "These Are the American Right-Wingers Covering for Putin as Russia Invades Ukraine"
  },
  {
    "id": 573,
    "mediaId": 2629,
    "date": "2022-02-24",
    "sentence": "Jim Banks of Indiana, Rep. Vern Buchanan of Florida, Rep. Mike Carey of Ohio, Rep. <span class='selected-term'>Jim Jordan</span> of Ohio, Rep. Debbie Lesko of Arizona, Rep. Mary Miller of Illinois, Rep. Mike Waltz of Florida, Sen. Marsha Blackburn of Tennessee, Sen. Ted Cruz of Texas, and Sen. Lindsey Graham of South Carolina—should definitely be getting questions about what conversations they had with Trump about the issue and how they felt about being at an event that boosted his stature in the Republican Party and was sandwiched between times he praised Putin for invading Ukraine.",
    "author": "Laura Clawson",
    "title": "Incoherent On Ukraine, Republican Officials Try To Ignore Trump Praise For Putin"
  },
  {
    "id": 325,
    "mediaId": 2594,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Andrew Naughtie",
    "title": "Trump news: White House slams Putin ‘scheme’ as ex-president rejects House speaker plan"
  },
  {
    "id": 716,
    "mediaId": 2676,
    "date": "2022-02-25",
    "sentence": "The people that were benefiting from that were Mitch McConnell, Kevin McCarthy, <span class='selected-term'>Jim Jordan</span>, Matt Gaetz, Marjorie Taylor Greene, and the cuckoo caucus that is going to be a much larger part of that Republican demo in the coming year.",
    "author": "Dean Obeidallah",
    "title": "Former GOP strategist Rick Wilson on Putin's deep appeal to \"dictator-friendly\" Republicans"
  },
  {
    "id": 24,
    "mediaId": 2564,
    "date": "2022-02-25",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, added on Twitter.",
    "author": "Morgan Phillips",
    "title": "Republican Senator Ben Sasse tears into 'evil' Putin and tells Biden to sanction 'lifestyles of the rich and famous a**hole mobsters and oligarchs' who enable the Russian leader's 'madness'"
  },
  {
    "id": 7,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "",
    "author": "",
    "title": "Ukraine showdown: Volodymyr Zelenskyy challenges Vladimir Putin"
  },
  {
    "id": 13,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "",
    "author": "Caitlin McFall",
    "title": "Ukraine invasion: Russia 'increasingly frustrated' by lack of momentum: US defense official"
  },
  {
    "id": 12967,
    "mediaId": 2679,
    "date": "2022-02-26",
    "sentence": "Rep. Jim Banks, R-Ind., after saying he would “never, ever apologize for objecting” to Biden’s victory Jan. 6, said he and Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, were victimized when they were removed from the House committee investigating that day’s attack on the U.S. Capitol.",
    "author": "Astead W. Herndon",
    "title": "At CPAC, Ukraine and policy take a back seat to cultural grievances"
  },
  {
    "id": 13219,
    "mediaId": 2724,
    "date": "2022-02-28",
    "sentence": "“It would have been nice if the $85 billion in weapons left in Afghanistan could’ve been sent to Ukraine.” ~ Rep. <span class='selected-term'>Jim Jordan</span> (Ohio – R)\nRELATED: Newspaper Editorial Blames Right-Wing Rhetoric For Assassination Attempt On Louisville Mayoral Candidate After BLM Activist Was Charged\nJordan: State Department Too Focused On ‘Pronouns’ And ‘Gender-neutral Passports’\nJordan then said the U.S. government should concentrate more on “real diplomacy” than political correct nonsense.",
    "author": "John Hanson",
    "title": "Video: Jim Jordan Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine"
  },
  {
    "id": 12556,
    "mediaId": 2658,
    "date": "2022-03-01",
    "sentence": "Lawmakers across the political spectrum support a significant boost in funding for the Ukrainian military.”\nFunding and arming Ukraine has widespread bipartisan support in Congress, as evidenced by the fact that Rep. KATIE PORTER (D-Calif.) and Rep. <span class='selected-term'>JIM JORDAN</span> (R-Ohio) — who see eye to eye on very little, if anything — clapped about the same things they were told in a classified hearing.",
    "author": "",
    "title": "Tell us how the Ukraine war ends"
  },
  {
    "id": 12773,
    "mediaId": 2724,
    "date": "2022-03-01",
    "sentence": "— Sahil Kapur (@sahilkapur) February 22, 2022\nRELATED: Video: <span class='selected-term'>Jim Jordan</span> Says It Would Be Nice If Weapons We Left In Afghanistan Were Instead In Ukraine\nTrump and other conservatives have been accused of supporting Russia\n“We could use that on our southern border.",
    "author": "John Hanson",
    "title": "Joy Behar Claims Trump Supports Russia And It’s Because Of ‘White Supremacy’"
  },
  {
    "id": 12885,
    "mediaId": 2641,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday that poor decisions about energy by President Joe Biden have led Russian President Vladimir Putin to use oil and gas as leverage.",
    "author": "Luca Cacciatore",
    "title": "Jim Jordan to Newsmax: 'Putin Is Using Energy as Leverage' on US, NATO"
  },
  {
    "id": 12557,
    "mediaId": 2550,
    "date": "2022-03-02",
    "sentence": "Republican Senate Minority Leader Mitch McConnell offered only a statement from his office: “There’s no place in the Republican Party for white supremacists or anti-Semitism.” GOP national committee chair Ronna McDaniel would only offer a similarly generic condemnation: “White supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.”\nThe far-right House Freedom Caucus’ newly elected leader, Congressman Scott Perry of Pennsylvania, and its cofounder, <span class='selected-term'>Jim Jordan</span> of Ohio, responded along similar lines asked about Greene and Gosar: They condemned racism, but declined to criticize either by name, or to criticize Fuentes.",
    "author": "David Neiwert",
    "title": "Republicans’ Nutcase Caucus undaunted by party leadership’s feckless response to extremism"
  },
  {
    "id": 12575,
    "mediaId": 2573,
    "date": "2022-03-02",
    "sentence": "Joining us now is House Minority Whip Steve Scalise, House Judiciary Committee Ranking Member <span class='selected-term'>Jim Jordan</span>, and Molly Hemingway Editor in Chief of the Federalist Fox News Contributor.",
    "author": "",
    "title": "'The Ingraham Angle' on Biden's State of the Union"
  },
  {
    "id": 12692,
    "mediaId": 2724,
    "date": "2022-03-03",
    "sentence": "",
    "author": "RealClearWire",
    "title": "Are We Nuts? American Energy Is Key To Undermining Putin’s War"
  },
  {
    "id": 12970,
    "mediaId": 2724,
    "date": "2022-03-04",
    "sentence": "",
    "author": "RealClearWire",
    "title": "John Kerry: Putin’s Useful Climate Idiot"
  },
  {
    "id": 12928,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Jack Wright & Harriet Alexander",
    "title": "Parents grieve over toddler killed by shrapnel hours before 'ceasefire' intended to let them evacuate - which Putin's troops ignored anyway: Civilians attempting to escape Mariupol are forced back by shelling as Russians break pledge"
  },
  {
    "id": 12541,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "David Hookstead",
    "title": "NASCAR Legend Richard Childress Is Sending A Million Rounds Of Ammo To Ukraine"
  },
  {
    "id": 12511,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Katie Weston",
    "title": "Vladimir Putin says Western sanctions on Russia are almost a declaration of WAR and anyone imposing no-fly zone on Ukraine would be considered to have entered the conflict"
  },
  {
    "id": 12531,
    "mediaId": 2618,
    "date": "2022-03-05",
    "sentence": "",
    "author": "Staff",
    "title": "Ukraine parades Russian prisoners of war as Putin's forces step up bombing and missile attacks on cities"
  },
  {
    "id": 12505,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Melissa Koenig",
    "title": "Former UN Ambassador Nikki Haley claims Biden's Afghan exit debacle and the Nord Stream 2 pipeline are to blame for emboldening Putin to invade Ukraine: Says it is 'lunacy' to continue to buy Russian oil"
  },
  {
    "id": 12545,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Wayne Allyn Root",
    "title": "Here's Your 'Red Pill' Moment for the Russia-Ukraine War"
  },
  {
    "id": 12561,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Elizabeth Elkind & Katelyn Caralle",
    "title": "Ukraine has a ‘continuity of government’ plan if its Zelensky is assassinated, US Secretary of State Antony Blinken says"
  },
  {
    "id": 12656,
    "mediaId": 2618,
    "date": "2022-03-06",
    "sentence": "",
    "author": "Emily Smith",
    "title": "Vladimir Putin hiding lover Alina Kabaeva and their kids in Switzerland"
  },
  {
    "id": 10853,
    "mediaId": 2658,
    "date": "2022-03-07",
    "sentence": "Angulo has spent the past decade on the Hill and is a Joint Economic Committee, David Schweikert and <span class='selected-term'>Jim Jordan</span> alum, and helped establish the Congressional Blockchain Caucus.",
    "author": "",
    "title": "Brownstein forms practice to help clients navigate infrastructure law"
  },
  {
    "id": 11156,
    "mediaId": 2618,
    "date": "2022-03-08",
    "sentence": "",
    "author": "Claire Giangravé",
    "title": "Archbishop Viganò pushes conspiracy theories about Ukraine and Russia in 10,000-word letter"
  },
  {
    "id": 10959,
    "mediaId": 2641,
    "date": "2022-03-09",
    "sentence": "Russian President Vladimir Putin has taken advantage of a lack of leadership in the White House to carry out his invasion of Ukraine, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday.",
    "author": "Brian Freeman",
    "title": "Rep. Jim Jordan to Newsmax: Putin Takes Advantage of WH Weakness"
  },
  {
    "id": 11088,
    "mediaId": 2664,
    "date": "2022-03-09",
    "sentence": "\\n\\n\"Which U.S. President had discussions with <span class='selected-term'>Jim Jordan</span> just prior to his supporters attacking the U.S. Capitol in an attempted coup?\"",
    "author": "Travis Gettys",
    "title": "'Bootlicker' Jim Jordan soundly mocked for one-word 'Trump' tweet: 'Really? That's the tweet?'"
  },
  {
    "id": 11033,
    "mediaId": 2641,
    "date": "2022-03-09",
    "sentence": "Russian President Vladimir Putin has taken advantage of a lack of leadership in the White House to carry out his invasion of Ukraine, Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, told Newsmax on Wednesday.",
    "author": "Brian Freeman",
    "title": "Rep. Jim Jordan to Newsmax: Putin Takes Advantage of WH Weakness"
  },
  {
    "id": 10867,
    "mediaId": 2550,
    "date": "2022-03-11",
    "sentence": "Going back a little further than that, during Trump’s first Ukraine-centered impeachment, a standard Republican talking point was that Ukraine was incredibly corrupt, “one of the three most corrupt countries on the planet,” according to Rep. <span class='selected-term'>Jim Jordan</span>.",
    "author": "",
    "title": "Cawthorn isn't alone as a Republican crapping on Ukraine. He just has bad timing"
  },
  {
    "id": 11036,
    "mediaId": 2724,
    "date": "2022-03-11",
    "sentence": "",
    "author": "RealClearWire",
    "title": "Will Dems’ Green Dream Fuel GOP Red Wave?"
  },
  {
    "id": 10701,
    "mediaId": 8322,
    "date": "2022-03-14",
    "sentence": "REP. <span class='selected-term'>JIM JORDAN</span> (R-OH): No, this is the great divide in America today, Sean, you got the, quote, elite and the crazy left who think that there's no problem having four and five dollar gas.",
    "author": "",
    "title": "'Hannity' on Jen Psaki, inflation"
  },
  {
    "id": 9656,
    "mediaId": 2636,
    "date": "2022-03-27",
    "sentence": "Representative <span class='selected-term'>Jim Jordan</span> of Ohio, dressed down in a fleece vest, stood in one corner while Representative Marjorie Taylor Greene of Georgia hustled in and out of the reception area.",
    "author": "",
    "title": "Elise Stefanik, Reinvented in Trump’s Image, Embodies a Changed G.O.P."
  },
  {
    "id": 9127,
    "mediaId": 2557,
    "date": "2022-03-27",
    "sentence": "Full stop.” pic.twitter.com/KDL1r3BmDV\n— The Recount (@therecount) March 27, 2022\nRepublican Rep. <span class='selected-term'>Jim Jordan</span> said Biden’s speech in Poland Saturday night was “more than confusing, it’s dangerous.”\n“Here’s the president potentially having more war-triggering type language than probably any president in American,” Jordan warned.",
    "author": "DML News App",
    "title": "WATCH: World leader joins lawmakers scolding Biden for escalating tensions with Russia"
  },
  {
    "id": 9109,
    "mediaId": 2643,
    "date": "2022-03-27",
    "sentence": "Several Republican lawmakers in the U.S. criticized Biden for his comment, with Ohio Representative <span class='selected-term'>Jim Jordan</span> calling it \"war-triggering,\" while Indiana Senator Jim Risch said it was a \"horrendous gaffe.\"",
    "author": "Natalie Colarossi",
    "title": "Macron Warns Biden Against Escalating Ukraine War With 'Words or Actions'"
  },
  {
    "id": 9042,
    "mediaId": 2557,
    "date": "2022-03-28",
    "sentence": "Full stop.” pic.twitter.com/KDL1r3BmDV\n— The Recount (@therecount) March 27, 2022\nRepublican Rep. <span class='selected-term'>Jim Jordan</span> said Biden’s speech in Poland Saturday night was “more than confusing, it’s dangerous.”\n“Here’s the president potentially having more war-triggering type language than probably any president in American,” Jordan warned.",
    "author": "DML News App",
    "title": "BREAKING: Biden: ‘I’m not walking anything back’ on whether Putin should be in power"
  },
  {
    "id": 9379,
    "mediaId": 2553,
    "date": "2022-03-28",
    "sentence": "So you get the worst of all possible worlds.” Cotton added that the pattern of Biden making problematic off-script remarks was “not reassuring for our safety or to our allies.”\nOhio Republican Congressman <span class='selected-term'>Jim Jordan</span> expressed his concerns late Saturday, warning that Biden’s comments were not just confusing, but that they were actually dangerous.",
    "author": "John Rigolizzo",
    "title": "‘Worst Of All Possible Worlds’: Tom Cotton, Jim Jordan, Other GOP Leaders Blast Biden For ‘Horrendous Gaffe’ In Poland Speech"
  },
  {
    "id": 8915,
    "mediaId": 2526,
    "date": "2022-03-29",
    "sentence": "GOP leader Rep. Kevin McCarthy (R-CA) has called the JCPA “the antithesis of conservatism,” while Rep. <span class='selected-term'>Jim Jordan</span> (R-OH) has warned it would give the media “cartel power.”\nSens.",
    "author": "Allum Bokhari",
    "title": "Lindsey Graham Backs Democrat Led Bailout for Corporate Media"
  },
  {
    "id": 9541,
    "mediaId": 2877,
    "date": "2022-03-31",
    "sentence": "Or it will be the story of how the people of the United States, the freest, most prosperous and successful nation in the history of the world, rallied around the truth the country was founded on and ushered in a century of liberty and justice and prosperity.” —Senator Marco Rubio\n“The Left will attack Ginni Thomas for exercising her political beliefs, but let Hunter Biden off the hook for his influence peddling.” —Congressman <span class='selected-term'>Jim Jordan</span>\nCOVID Swamp Doctor\n“I think the restrictions … certainly prevented a lot of infections, prevented a lot of hospitalizations, and prevented a lot of deaths.",
    "author": "Jordan Candler",
    "title": "Thursday Short Cuts"
  },
  {
    "id": 7130,
    "mediaId": 2631,
    "date": "2022-03-31",
    "sentence": "Everybody’s concerned about that story,” said Rep. <span class='selected-term'>Jim Jordan</span>, R-Ohio, a Trump loyalist who is likely to chair the Judiciary Committee if Republicans win the House back in November.",
    "author": "",
    "title": "Republicans squirm as Trump presses Putin for dirt on Bidens"
  },
  {
    "id": 7268,
    "mediaId": 2526,
    "date": "2022-04-04",
    "sentence": "“I think that’s definitely a discussion we have to have,” Rep. <span class='selected-term'>Jim Jordan</span> said two weeks ago in relation to winning back the House.",
    "author": "Wendell Husebø",
    "title": "Democrat Strategist: U.S. Has ‘Lost Confidence’ in Joe Biden, ‘Heading into a Recession’"
  },
  {
    "id": 7067,
    "mediaId": 2572,
    "date": "2022-04-07",
    "sentence": "(COMMERCIAL BREAK)\n(BEGIN VIDEO CLIP)\nREP. <span class='selected-term'>JIM JORDAN</span>, (R-OH) HOUSE OVERSIGHT COMMITTEE RANKING MEMBER: We're launching an investigation because the real thing here was how Facebook and Twitter suppressed this information.",
    "author": "Fox News Staff",
    "title": "'Special Report' All-Star Panel on Russian war crime claims"
  },
  {
    "id": 5216,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Dan Negrea",
    "title": "The Breakup: Will Russia Splinter Over War in Ukraine?"
  },
  {
    "id": 5499,
    "mediaId": 2618,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Ramsey Touchberry",
    "title": "Voters blame Putin, oil companies for inflated gas prices, poll says"
  },
  {
    "id": 5754,
    "mediaId": 2562,
    "date": "2022-04-21",
    "sentence": "Reps. <span class='selected-term'>Jim Jordan</span>, R-Ohio, and Andy Biggs, R-Ariz., were among the letter's signatories.",
    "author": "NationalWatch",
    "title": "House GOP Asks Why Late Moscow Mayor’s Wife Not Sanctioned"
  }
]