[
  {
    "id": 4583,
    "mediaId": 8251,
    "date": "2022-01-05",
    "sentence": "Former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span>, a Democrat who was ousted in the 2020 election, has said he was interviewed by Brnovich’s investigators.",
    "author": "",
    "title": "'Correcting the Record': Maricopa County blasts Senate GOP's election review in point-by-point takedown. Here's what we know"
  },
  {
    "id": 4556,
    "mediaId": 8361,
    "date": "2022-01-06",
    "sentence": "Speakers are Marco Lopez, Democratic candidate for governor; <span class='selected-term'>Adrian Fontes</span>, Democratic candidate for secretary of state; Rep. Jennifer Pawlik (LD-17) and AJ Kurdoglu, candidate for AZ senate, LD 17.",
    "author": "",
    "title": "Calendar of Events"
  },
  {
    "id": 4296,
    "mediaId": 8439,
    "date": "2022-01-19",
    "sentence": "Democratic contenders <span class='selected-term'>Adrian Fontes</span> and state Rep. Reginald Bolding each raised more than the other two Republican candidates: Sen. Michelle Ugenti-Rita, R-Scottsdale, and Rep. Shawnna Bolick, R-Phoenix.",
    "author": "Mary Jo Pitzl",
    "title": "Money pours into Arizona secretary of state race after 2020 ballot review"
  },
  {
    "id": 3672,
    "mediaId": 2578,
    "date": "2022-01-19",
    "sentence": "Now, if you want to join me, and you want to help me clean this mess that Katie Hobbs and <span class='selected-term'>Adrian Fontes</span> created.",
    "author": "Jordan Conradson",
    "title": "AZ State Rep. Mark Finchem Speaks At Save America Rally: “The Arizona Election Should Be DECERTIFIED With Cause By The Legislature”"
  },
  {
    "id": 3950,
    "mediaId": 2748,
    "date": "2022-01-20",
    "sentence": "Now, if you want to join me, and you want to help me clean this mess that Katie Hobbs and <span class='selected-term'>Adrian Fontes</span> created.",
    "author": "",
    "title": "AZ State Rep. Mark Finchem Speaks At Save America Rally: “The Arizona Election Should Be DECERTIFIED With Cause By The Legislature”"
  },
  {
    "id": 3797,
    "mediaId": 2672,
    "date": "2022-01-23",
    "sentence": "Bill Gates, the Republican supervisor in Maricopa County, and <span class='selected-term'>Adrian Fontes</span>, the county’s former Recorder and a Democrat, say they spotted multiple inaccuracies and misperceptions in Waldron’s emails.",
    "author": "Andy Kroll",
    "title": "Start the Steal: New MAGA Emails Reveal Plot to Hand Arizona to Trump"
  },
  {
    "id": 4294,
    "mediaId": 2668,
    "date": "2022-01-24",
    "sentence": "That’s more than the combined fundraising totals of the two leading Democrats, former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> and state House Minority Leader Reginald Bolding, who respectively raised about $385,000 and $200,000 for the year.",
    "author": "streiff",
    "title": "The Left Starts to Panic as 'Election Deniers' Begin to Dominate Critical Secretary of State Contests"
  },
  {
    "id": 3566,
    "mediaId": 2658,
    "date": "2022-01-24",
    "sentence": "That’s more than the combined fundraising totals of the two leading Democrats, former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> and state House Minority Leader Reginald Bolding, who respectively raised about $385,000 and $200,000 for the year.",
    "author": "",
    "title": "Trump followers zero in on secretary of state campaigns"
  },
  {
    "id": 3980,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "That bill didn’t get any Democratic backing on the committee but had support from an unlikely source, former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span>.",
    "author": "Jeremy Duda",
    "title": "Lies about the 2020 election propel Arizona bills aimed at combating non-existent fraud"
  },
  {
    "id": 3887,
    "mediaId": 2603,
    "date": "2022-01-25",
    "sentence": "We need to keep this office away from Donald Trump,” former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> told Politico.",
    "author": "Caitlin Cruz",
    "title": "This Terrifying Woman Hopes to Run Michigan's Elections"
  },
  {
    "id": 4126,
    "mediaId": 8475,
    "date": "2022-01-25",
    "sentence": "That bill didn’t get any Democratic backing on the committee but had support from an unlikely source, former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span>.",
    "author": "Jeremy Duda",
    "title": "Lies about the 2020 election propel Arizona bills aimed at combating non-existent fraud"
  },
  {
    "id": 4021,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "Former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span>, who facilitated the shady, corrupt 2020 election, recently said that “AZ must go 100% ballot by mail.” Rogers responded by calling him a “crook” and telling him her plans for this session.",
    "author": "Jordan Conradson",
    "title": "AZ State Senator Wendy Rogers Drops 88 Bills: “We Are Going Back to In-Person One Day One Vote NO MACHINES And Paper Ballots With Watermarks”"
  },
  {
    "id": 4057,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "Former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span>, who facilitated the shady, corrupt 2020 election, recently said that “AZ must go 100% ballot by mail.” Rogers responded by calling him a “crook” and telling him her plans for this session.",
    "author": "",
    "title": "AZ State Senator Wendy Rogers Drops 88 Bills: “We Are Going Back to In-Person One Day One Vote NO MACHINES And Paper Ballots With Watermarks”"
  },
  {
    "id": 3219,
    "mediaId": 8396,
    "date": "2022-02-01",
    "sentence": "Jumping right into the 2022 election, the PebbleCreek Democratic Club will hear from <span class='selected-term'>Adrian Fontes</span>, candidate for Arizona secretary of state at their Feb. 2 meeting.",
    "author": "",
    "title": "Democratic Club Welcomes Adrian Fontes as February 2 Meeting Speaker"
  },
  {
    "id": 2646,
    "mediaId": 8475,
    "date": "2022-02-04",
    "sentence": "Democratic County Recorder <span class='selected-term'>Adrian Fontes</span> led Republican challenger Stephen Richer for four days, falling behind over the weekend after the election, one of several countywide Democratic candidates who saw their leads evaporate in the days after the election.",
    "author": "Jeremy Duda",
    "title": "Arizona GOP ballot measure would restrict early voting to speed up ballot counting"
  },
  {
    "id": 2448,
    "mediaId": 8347,
    "date": "2022-02-06",
    "sentence": "Friday, former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span>, who is running as a Democratic candidate for Secretary of State, sent an official request to the Department of Justice accusing Kelli Ward and the eleven people who signed on as electors of making false claims to federal and state officials in an attempt to change the electoral college votes in Arizona.",
    "author": "Mark Phillips",
    "title": "Candidate for Secretary of State asks DOJ to investigate Kelli Ward and fake Republican electors"
  },
  {
    "id": 1829,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Democratic County Recorder <span class='selected-term'>Adrian Fontes</span> led Republican challenger Stephen Richer for four days, falling behind over the weekend after the election, one of several countywide Democratic candidates who saw their leads evaporate in the days after the election.",
    "author": "Jeremy Duda",
    "title": "GOP ballot measure in Arizona would restrict early voting to speed up ballot counting"
  },
  {
    "id": 2650,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "In 2018, then-Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> made it easier for such people to vote, opening emergency voting centers in Mesa, Scottsdale, Avondale and Tolleson, in addition to the usual emergency voting site at the Maricopa County Recorder’s Office in downtown Phoenix.",
    "author": "Laurie Roberts",
    "title": "The Easier to Vote, Harder to Cheat Act? Anonymous Republicans think we'd fall for that?"
  },
  {
    "id": 2550,
    "mediaId": 8476,
    "date": "2022-02-08",
    "sentence": "",
    "author": "",
    "title": "No title"
  },
  {
    "id": 1855,
    "mediaId": 8451,
    "date": "2022-02-09",
    "sentence": "Latino Victory recently endorsed Arizona gubernatorial candidate Marco Lopez, and has done the same with other prominent Arizona politicians such as <span class='selected-term'>Adrian Fontes</span> and Daniel Hernandez.",
    "author": "Javier Arce",
    "title": "'A slap in the face to the voters': Voto Latino launches campaign to replace Sen. Kyrsten Sinema"
  },
  {
    "id": 1651,
    "mediaId": 2911,
    "date": "2022-02-16",
    "sentence": "Former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> (who used to oversee elections in Arizona’s most populous county) and state House Minority Leader Reginald Bolding are the two Democratic candidates and the only two candidates in the race who have acknowledged Biden’s victory as legitimate.",
    "author": "Jean Yi",
    "title": "Democracy Is On The Ballot In These 11 Secretary Of State And Attorney General Elections"
  },
  {
    "id": 784,
    "mediaId": 8344,
    "date": "2022-02-21",
    "sentence": "Also speaking was state Rep. Daniel Hernandez, who is running for Congress in the district that represents Graham and Greenlee counties; former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span>, who is running for Secretary of State; and former state Rep. Aaron Lieberman, who is running for Governor.",
    "author": "David Bell",
    "title": "Candidates descend on Graham County"
  },
  {
    "id": 177,
    "mediaId": 2520,
    "date": "2022-02-22",
    "sentence": "602-954-2507. https://renatashearth.com\nA basement speakeasy and intimate music hall in the heart of downtown Phoenix that offers cocktails in honor of Arizona luminaries and politicos including \"The (John) McCain\" and \"The <span class='selected-term'>Adrian Fontes</span>,\" two drinks made with mezcal.",
    "author": "",
    "title": "Mezcal in metro Phoenix: Here are some places to sample the Mexican spirit"
  },
  {
    "id": 47,
    "mediaId": 2658,
    "date": "2022-02-22",
    "sentence": "Secretaries of state races in Arizona, Nevada, Michigan and Georgia are receiving lots of attention, said <span class='selected-term'>Adrian Fontes</span>, a candidate for secretary of state in Arizona.",
    "author": "",
    "title": "Dems fear for democracy. Their big donors aren’t funding one of its main election groups."
  },
  {
    "id": 664,
    "mediaId": 2520,
    "date": "2022-02-23",
    "sentence": "Marlene Woods serves as chair of the <span class='selected-term'>Adrian Fontes</span> for Arizona Secretary of State Campaign and has over 20 years of experience as a broadcast journalist.",
    "author": "Marlene Woods",
    "title": "If Arizona Democrats blink in 2022 primaries, it could be a disaster in the fall"
  },
  {
    "id": 701,
    "mediaId": 8476,
    "date": "2022-02-24",
    "sentence": "We don’t want to be in the business of redaction.”\nInterestingly, Democrat <span class='selected-term'>Adrian Fontes</span>, the former Maricopa County recorder and current candidate for Arizona Secretary of State, has come out in favor of this legislation.",
    "author": "Jake Dean",
    "title": "Trust Busters: A Slate of New Election Laws Sweeps Arizona in Response to ‘Voter Fraud’ Conspiracy Theories"
  },
  {
    "id": 12733,
    "mediaId": 2662,
    "date": "2022-02-28",
    "sentence": "On November 5th, 2020, The Arizona Supreme Court ruled that leftist Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> “acted unlawfully” by creating his own voter guidelines that were not authorized by the Elections Procedures Manual.",
    "author": "Jordan Conradson",
    "title": "BREAKING: Arizona GOP Sues Secretary of State Katie Hobbs To Ban Unconstitutional Drop Boxes, And No-Excuse Mail-In Voting In Arizona"
  },
  {
    "id": 12646,
    "mediaId": 2662,
    "date": "2022-03-01",
    "sentence": "On November 5th, 2020, The Arizona Supreme Court ruled that leftist Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> also “acted unlawfully” by exceeding his constitutional authority and making up his own election instructions.",
    "author": "Jordan Conradson",
    "title": "Judge Denies Arizona Secretary of State Katie Hobbs’ Request To Block Arizona AG Brnovich From Potentially Prosecuting Election Law Violations"
  },
  {
    "id": 10787,
    "mediaId": 2578,
    "date": "2022-03-12",
    "sentence": "And I think humbly you know that that may be part of why we’ve been able to keep this team together because they’ve seen us, they’ve seen Stephen Richer, our new recorder and just for those who don’t know Stephen Richer, as David mentioned, he beat <span class='selected-term'>Adrian Fontes</span>, the Democrat recorder in 2020.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Maricopa County Supervisor Bill Gates Continues to Play Victim and Refuses to Turn Election Routers Over to Inspectors… Why Is That? (VIDEO)"
  },
  {
    "id": 14057,
    "mediaId": 2605,
    "date": "2022-03-15",
    "sentence": "In the combustible days and weeks following the November 2020 election, <span class='selected-term'>Adrian Fontes</span> was threatened so many times he lost count.",
    "author": "",
    "title": "Column: ‘It’s a calling.’ It’s also scary. That’s why so many election officials are quitting"
  },
  {
    "id": 11407,
    "mediaId": 2520,
    "date": "2022-03-18",
    "sentence": "Still, Democratic secretary of state candidate <span class='selected-term'>Adrian Fontes</span> is right to ask legislative leaders to explore impeaching Brnovich, who’s seeking the GOP nomination for U.S. Senate.",
    "author": "Elvia Díaz",
    "title": "Attorney General Mark Brnovich has abused his office. Why not impeach him?"
  },
  {
    "id": 10869,
    "mediaId": 2578,
    "date": "2022-03-18",
    "sentence": "The Gateway Pundit reported that Stephen Richer ran on exposing former Recorder <span class='selected-term'>Adrian Fontes</span>’ “criminal” actions.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Teneo Network, FDD, Koch, And Bill Kristol – AZ Attorney General Mark Brnovich Caught Hanging Out With #NeverTrumpers at Secret AZ Gathering"
  },
  {
    "id": 13844,
    "mediaId": 2607,
    "date": "2022-03-18",
    "sentence": "In the combustible days and weeks following the November 2020 election, <span class='selected-term'>Adrian Fontes</span> was threatened so many times he lost count.",
    "author": "Mark Barabak",
    "title": "‘It’s a calling,’ but it’s also scary. That’s why so many election officials are quitting"
  },
  {
    "id": 12193,
    "mediaId": 8475,
    "date": "2022-03-22",
    "sentence": "Former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span>, a Democrat who is currently running for secretary of state, said the study isn’t valid if it didn’t use the correct signatures for comparisons.",
    "author": "Jeremy Duda",
    "title": "Here we go again: Townsend issues subpoena to Maricopa County for election records"
  },
  {
    "id": 9038,
    "mediaId": 2578,
    "date": "2022-03-23",
    "sentence": "He told voters that former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> is a “criminal.”\nOne year before his election, Richer wrote,\nThis confidence has been further damaged by the fact that Fontes has not given a full accounting for his actions in the election, and his Office has failed to produce documents in response to the multiple records requests put forward by the Republican and its surrogate (me).",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Leaked Emails From Maricopa County Recorder Stephen Richer Reveal Voter Fraud Concerns Before 2020 Election"
  },
  {
    "id": 12008,
    "mediaId": 2658,
    "date": "2022-03-26",
    "sentence": "“It would be an abject disaster,” said <span class='selected-term'>Adrian Fontes</span>, the former Maricopa County recorder now running in the Democratic primary for secretary of state in Arizona.",
    "author": "",
    "title": "Trump backers push election change that would make counting slower, costlier and less accurate"
  },
  {
    "id": 9179,
    "mediaId": 2732,
    "date": "2022-03-27",
    "sentence": "",
    "author": "",
    "title": "Eastern Pittsburgh suburban real estate transactions for the week of March 27, 2022"
  },
  {
    "id": 9734,
    "mediaId": 2528,
    "date": "2022-03-29",
    "sentence": "There are real fears that election workers will be physically assaulted or even die during the 2022 general elections, said <span class='selected-term'>Adrian Fontes</span>, the former recorder of Maricopa County in Arizona.",
    "author": "Camila DeChalus",
    "title": "Texas secession? Civil war? Threats of violence — or worse — loom over the 2022 midterm elections"
  },
  {
    "id": 9522,
    "mediaId": 2875,
    "date": "2022-03-29",
    "sentence": "Abraham Hamadeh, a Republican candidate in Arizona’s attorney general election, attacked the former recorder in the state’s most populous county (<span class='selected-term'>Adrian Fontes</span>, a Democrat now running for secretary of state in Arizona) for unspecified “unconstitutional” actions “to hijack our elections.” Ashley Moody, the Republican incumbent in Florida’s attorney general race, urged the U.S. Supreme Court to hear a motion from Texas’ attorney general seeking to overturn the Electoral College results from other battleground states, saying “the process” was not followed, but not citing evidence.",
    "author": "Steven Rosenfeld",
    "title": "More than 80 election-denying candidates running for governor, attorney general and secretary of state in 2022’s primaries"
  },
  {
    "id": 9195,
    "mediaId": 2512,
    "date": "2022-03-29",
    "sentence": "Abraham Hamadeh, a Republican candidate in Arizona’s attorney general election, attacked the former recorder in the state’s most populous county (<span class='selected-term'>Adrian Fontes</span>, a Democrat now running for secretary of state in Arizona) for unspecified “unconstitutional” actions “to hijack our elections.” Ashley Moody, the Republican incumbent in Florida’s attorney general race, urged the U.S. Supreme Court to hear a motion from Texas’ attorney general seeking to overturn the Electoral College results from other battleground states, saying “the process” was not followed, but not citing evidence.",
    "author": "",
    "title": "More than 80 election-denying candidates running for governor, attorney general and secretary of state in 2022’s primaries"
  },
  {
    "id": 10157,
    "mediaId": 2679,
    "date": "2022-03-31",
    "sentence": "“Election administrators have been fighting misinformation and disinformation for years now, and they’ve been trying desperately to keep up with the shenanigans of the extreme political right,” said <span class='selected-term'>Adrian Fontes</span>, former election administrator for Maricopa County and a Democratic candidate for secretary of state in Arizona.",
    "author": "NICK CORASANITI",
    "title": "Arizona passes proof-of-citizenship law for voting in presidential elections"
  },
  {
    "id": 7535,
    "mediaId": 2735,
    "date": "2022-04-02",
    "sentence": "Abraham Hamadeh, a Republican candidate in Arizona’s attorney general election, attacked the former recorder in the state’s most populous county (<span class='selected-term'>Adrian Fontes</span>, a Democrat now running for secretary of state in Arizona) for unspecified “unconstitutional” actions “to hijack our elections.” Ashley Moody, the Republican incumbent in Florida’s attorney general race, urged the U.S. Supreme Court to hear a motion from Texas’ attorney general seeking to overturn the Electoral College results from other battleground states, saying “the process” was not followed, but not citing evidence.",
    "author": "Chris Walker",
    "title": "More Than 80 Candidates in 2022 Primaries Are Spreading Trump’s “Big Lie”"
  },
  {
    "id": 7332,
    "mediaId": 2578,
    "date": "2022-04-06",
    "sentence": "Regarding signature verification standards, the report states, “the early ballot affidavit signature verification system in Arizona, and particularly when applied to Maricopa County, may be insufficient to guard against abuse.”\nUnder County Recorder <span class='selected-term'>Adrian Fontes</span>, Maricopa County saw a massive decrease in the number of ballots rejected due to missing signatures or mismatched signatures.",
    "author": "Assistant Editor",
    "title": "BREAKING: Arizona Attorney General Releases Maricopa County 2020 Election Interim Report – Individuals To Be Prosecuted For Election Fraud"
  },
  {
    "id": 7659,
    "mediaId": 2543,
    "date": "2022-04-07",
    "sentence": "Democrat <span class='selected-term'>Adrian Fontes</span>, who was the Maricopa County recorder during the 2020 election, accused Republican Brnovich of engaging in politics through the release of the report.",
    "author": "Randy DeSoto",
    "title": "AZ AG Releases Report Finding 'Fraud' and Problems with Handling of Over 100K Mail-in Ballots in Maricopa County"
  },
  {
    "id": 7103,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Senator Mark Kelly (D. AZ) and his fellow Arizona Democrats campaigns:\nKatie Hobbs for Governor\nAaron Lieberman for Governor\nMarco Lopez for Governor\nMark Kelly for Senate\nReginald Bolding for Secretary of State\n<span class='selected-term'>Adrian Fontes</span> for Secretary of State\nKristin Mayes for Attorney General\nArizona Democratic Party",
    "author": "",
    "title": "Surprising No One, MAGA AG's \"2020 Election Fraud\" Investigation Turns Out To Be A Bust"
  },
  {
    "id": 8882,
    "mediaId": 8476,
    "date": "2022-04-07",
    "sentence": "He also copied and pasted a section of his brief in the failed AZGOP lawsuit to kill off early voting that argued that former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> rejected fewer ballots than his Republican predecessor.",
    "author": "Rachel Leingang and Hank Stephenson",
    "title": "The Daily Agenda: If You Wanna Make Laws, Join the Legislature"
  },
  {
    "id": 8715,
    "mediaId": 8350,
    "date": "2022-04-08",
    "sentence": "Richer, a Republican who unseated Democrat <span class='selected-term'>Adrian Fontes</span> in November 2020, said he was “100%” certain the election was handled properly.",
    "author": "MARCIA HAMMOND",
    "title": "Maricopa County Recorder Richer ‘sick of’ ongoing election challenge"
  },
  {
    "id": 7120,
    "mediaId": 2593,
    "date": "2022-04-08",
    "sentence": "Democrat <span class='selected-term'>Adrian Fontes</span>, who was the Maricopa County recorder during the 2020 election, accused Republican Brnovich of engaging in politics through the release of the report.",
    "author": "Randy DeSoto",
    "title": "AZ AG Releases Report Finding 'Fraud' and Problems With Handling of Over 100K Mail-in Ballots in Maricopa County"
  },
  {
    "id": 6802,
    "mediaId": 8408,
    "date": "2022-04-15",
    "sentence": "Two Democrats are running in the primary for secretary of state: current state Representative Reginald Bolding, who represents South Phoenix, and <span class='selected-term'>Adrian Fontes</span>, the former Maricopa County Recorder.",
    "author": "Katya Schwenk",
    "title": "Kari Lake, Wendy Rogers, Other Far-Right Politicians Rake in Cash in First Quarter"
  },
  {
    "id": 5177,
    "mediaId": 8476,
    "date": "2022-04-18",
    "sentence": "On the Democratic side, Reginald Bolding raised $160,000, edging out the $139,000 that former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> raised.",
    "author": "Dillon Rosenblatt",
    "title": "The haves and the have nots become clear in governor, secretary of state races"
  },
  {
    "id": 4790,
    "mediaId": 8475,
    "date": "2022-04-18",
    "sentence": "On the Democratic side, Reginald Bolding raised $160,000, edging out the $139,000 that former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> raised.",
    "author": "Dillon Rosenblatt",
    "title": "The haves & have nots become clear in Arizona governor, secretary of state races"
  },
  {
    "id": 4896,
    "mediaId": 2658,
    "date": "2022-04-18",
    "sentence": "On the Democratic side, former Maricopa County Recorder <span class='selected-term'>Adrian Fontes</span> and state House Minority Leader Reginald Bolding are vying for the nomination, with national groups largely sitting out the contested primary so far.",
    "author": "",
    "title": "Who will run the 2024 election? They’re on your ballot in 2022."
  },
  {
    "id": 4758,
    "mediaId": 8326,
    "date": "2022-04-22",
    "sentence": "",
    "author": "",
    "title": "Secretary of state debate: Democrats Reginald Bolding and Adrian Fontes"
  }
]