{
  "id": 1498,
  "mediaId": 2627,
  "date": "2022-04-07",
  "headline": "GOP’s ‘Putin wing’ takes a bizarre stand on war crimes resolution",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220407-Thomas-Massie-al-0809-ad7d38.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/gops-putin-wing-takes-bizarre-stand-war-crimes-resolution-rcna23374",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    2903,
    3709,
    3840,
    4582,
    878,
    1157,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "The list, comprised entirely of Republicans, features some familiar names:\nAndy Biggs of Arizona\nWarren Davidson of Ohio\nPaul Gosar of Arizona\nMarjorie Taylor Greene of Georgia\nThomas Massie of Kentucky\nScott Perry of Pennsylvania\nSince Russia’s invasion of Ukraine, there have been a series of House votes on measures related to the attack, each of which have been approved easily, despite opposition from the contingent that Rep. Liz Cheney labeled the GOP’s “Putin wing.”\nIt was about a month ago, for example, when the House voted overwhelmingly to ban oil imports from Russia.",
    "The Kentucky Republican is perhaps best known for being derided by Donald Trump as a “third-rate grandstander.”\nPostscript: Republican Rep. Liz Cheney of Wyoming is currently listed as having voted against the resolution, but her office confirmed that her vote was cast in error.",
    "The measure approved by the House would specifically require the Biden administration to outline the process for the U.S. government to collect and preserve evidence of war crimes committed during Russia’s invasion of Ukraine that began in late February.",
    "As for the Venn diagram, how many House GOP members voted against the resolution in support of Ukrainians, the ban on Russian oil imports, the suspension of normal trade relations with Russia, and the resolution on Russian war crimes?",
    "Much of the world has been horrified by evidence of Russia committing gruesome war crimes in Ukraine, so it came as no surprise when the U.S. House voted yesterday on the Ukraine Invasion War Crimes Deterrence and Accountability Act.",
    "It would also require the Biden administration to submit a report to Congress about the process for a domestic, foreign or international court or tribunal should one request information from the U.S. about war crimes.",
    "The Hill reported:\nThe House passed bipartisan legislation on Wednesday that would require the Biden administration to detail its efforts to collect evidence of war crimes committed by Russian forces in Ukraine....",
    "The resolution was introduced by Democratic Rep. Gregory Meeks of New York, the House Foreign Affairs Committee chairman, and his panel’s ranking Republican, Texas Rep. Michael McCaul.",
    "Soon after, the House voted to suspend normal trade relations with Russia, and that measure was only opposed by eight Republicans, three of whom also voted “no” yesterday.",
    "A week earlier, the House easily passed a non-binding resolution in support of Ukrainians, which three Republicans opposed, most of whom also voted “no” yesterday.",
    "The measure also enjoyed the support of every member of both parties’ leadership teams, en route to passing the chamber 418 to 6.",
    "In all, 15 House Republicans opposed the measure — including most of the members who voted “no” yesterday.",
    "Recommended\nNote, in each of these instances, the far-right members knew the bills would pass easily.",
    "The official record will be amended to reflect her support for the measure.",
    "But they nevertheless wanted to go on the record voting against them.",
    "And who thought it’d be a good idea to oppose such a resolution?",
    "The surprising part was the fact that the vote wasn’t unanimous.",
    "On the surface, this was a welcome example of bipartisanship.",
    "Just one: Thomas Massie."
  ]
}