{
  "id": 1723,
  "mediaId": 2537,
  "date": "2022-04-04",
  "headline": "The Ohio primary is here, sort of. What to know as early voting starts",
  "image": "https://www.gannett-cdn.com/presto/2021/04/29/PCIN/cbfc7e87-7c50-4757-a065-001e5d214885-042821EarlyVoting_1.jpg?crop=3594,2022,x0,y240&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/politics/2022/04/05/ohio-primary-senate-congress-county-races-ballot/7237099001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Wartman",
  "authorUrl": "https://www.cincinnati.com/staff/2646301001/scott-wartman/",
  "termIds": [
    0
  ],
  "sentences": [
    "Mike DeWine (incumbent)\nJim Renacci, former Congressman\nRon Hood, former state Rep.\nAttorney General\nDemocrat\nState Rep. Jeff Crossman\nRepublican\nDave Yost (incumbent)\nAuditor of State\nDemocrat\nTaylor Sappington, Nelsonville City Auditor\nRepublican\nKeith Faber (incumbent)\nSecretary of State\nDemocrat\nChelsea Clark, Forest Park Councilmember\nRepublican\nJohn Adams\nFrank LaRose (incumbent)\nTreasurer of State\nDemocrat\nScott Schertzer, Mayor of Marion\nRepublican\nRobert Sprague (incumbent)\nOhio Supreme Court Chief Justice\nDemocrat\nJennifer Brunner\nRepublican\nSharon Kennedy\nOhio Supreme Court Justice\nDemocrat\nJudge Terri Jamison\nJudge Marilyn Zayas\nRepublican\nJustice Pat DeWine\nJustice Pat Fischer",
    "Local congressional races\nU.S. House, 1st Congressional District(Hamilton County, Warren County)\nDemocrat\nGreg Landsman\nRepublican\nSteve Chabot(incumbent)\nJenn Giroux\nU.S House, 8th Congressional District(Hamilton County, Butler County)\nDemocrat\nVanessa Enoch\nRepublican\nWarren Davidson(incumbent)\nPhil Heimlich\nU.S. House, 2nd Congressional District(Clermont County)\nDemocrat\nAlan Darnowsky\nSamantha Meadows\nRepublican\nJames Condit Jr.\nBrad Wenstrup(incumbent)\nDavid Windisch\nLocal primaries\nCountywide offices and judicial races are up for election this year.",
    "Democrat\nTraci \"TJ\" Johnson, businesswoman\nMorgan Harper, attorney\nU.S. Rep. Tim Ryan\nRepublican\nMatt Dolan, state Senator\nMike Gibbons, businessman\nJosh Mandel, former State Treasurer\nNeil Patel, businessman\nMark Pukita, businessman\nJane Timken, former chair of Ohio Republican Party\nJD Vance, author and businessman\nGovernor\nDemocrat\nJohn Cranley, former Mayor of Cincinnati\nNan Whaley, former Mayor of Dayton\nRepublican\nJoe Blystone, farmer and businessowner\nGov.",
    "Hamilton County Clerk of Courts\nDemocrat\nPavan Parikh (incumbent)\nRepublican\nSteve Goodin\nRaj Rajagopal\nClermont County Auditor\nDemocrat\nNone\nRepublican\nLinda Fraley (incumbent)\nTim Rudd\nWarren County Commissioner\nDemocrat\nNabila Babar\nRepublican\nAmy Brewer\nTom Grossman (incumbent)\nButler County Auditor\nDemocrat\nNone\nRepublican\nBruce Jones\nRoger Reynolds (incumbent)\nStatewide races on upcoming ballot\nU.S. Senate\nCurrent U.S.",
    "April early in-person voting hours\nApril 5-8: 8:00 a.m. - 5:00 p.m.\nApril 11-15: 8:00 a.m. - 5:00 p.m.\nApril 18-22: 8:00 a.m. - 5:00 p.m.\nApril 25-29: 8:00 a.m. - 7:00 p.m.\nApril 30: 8:00 a.m. - 4:00 p.m.\nMay Early in-person voting hours\nMay 1: 1:00 p.m. - 5:00 p.m.\nMay 2: 8:00 a.m. - 2:00 p.m.\nHow to vote by mail\nThe deadline to request an absentee ballot is three days before the election.",
    "Fill out the online application, print it and mail it to your local county board of elections\nCall the board of elections and request an application is mailed to you\nWrite a letter to county board of elections with your full name, date of birth, and address where you are registered to vote.",
    "Poland and Hemmer-Haight said they are awaiting guidance from the Ohio Secretary of State on what, if any, notification or advisory they'll have at the polling locations informing voters of about the absence of state legislative races.",
    "Giroux, owner of the Catholic Shop in Madeira and outspoken opponent of abortion, told The Enquirer in March she wasn't decided whether she would actually run, waiting to see the boundaries of the district.",
    "April 30: Deadline to request absentee ballot\nHow to vote in-person\nYou can find your polling location by visiting your local county board of election's website or the Secretary of State's directory.",
    "Hamilton County will be split between the 8th Congressional District, represented by Rep. Warren Davidson, R-Troy, and 1st Congressional District, represented by Rep. Steve Chabot, R-Westwood.",
    "Voters will likely have another primary in August to decide those races once the courts and General Assembly can come to an agreement on the legislative district boundaries.",
    "Mike DeWine to postpone it at the last minute until April 28\nWhile this doesn't rise to pandemic levels of confusion, it's still not been easy for elections officials.",
    "Democrat Greg Landsman, the Cincinnati City Councilman who is running against Chabot in November's general election, does not have a primary challenger.",
    "Congressional races still a go\nLike the state legislative districts, legal questions swirl around the boundaries of the congressional districts.",
    "That district includes all of Butler County and extends up to Davidson's home of Troy in Miami County more than 70 miles north of Cincinnati.",
    "\"No one has been talking about the fact there's a primary coming,\" Jen Miller, executive director of the League of Women Voters of Ohio.",
    "In Clermont County, maybe 25-30% of voters will turn out, said Stephanie Hemmer-Haight, board of elections director.",
    "You will be able to vote in the primaries for the U.S. House and Senate, governor, county races and all other races.",
    "That's a high number as early voting begins, said Sherry Poland, director of the Hamilton County Board of Elections.",
    "Cincinnati and the eastern half of Hamilton County are under Chabot's district, which still includes Warren County.",
    "\"We received feedback from poll workers,\" said Sherry Poland, director of the Hamilton County Board of Elections.",
    "The boundaries passed in the most recent map by lawmakers will remain in effect for at least this election.",
    "Nor any of the state central committee races – races that determine who controls each political party.",
    "Former Hamilton County Commissioner Phil Heimlich has challenged Davidson in the Republican Primary.",
    "\"They were hesitant to confirm because of hearing the news stories surrounding the primary.",
    "\"With all the confusion, we're not sure what people are gonna think,\" Hemmer-Haight said.",
    "A statement identifying the election and stating you are a qualified voter are required.",
    "Here are some notable contested primaries on the May 3 ballot in the Cincinnati region.",
    "A full list of required information is available on the Secretary of State's website.",
    "Unlike the state districts, the primaries for Congress in Ohio won't get pushed back.",
    "If you're confused by what will end up being two primaries in Ohio, you're not alone.",
    "The pandemic arrived at the same time as Ohio's March 17, 2020 primary, forcing Gov.",
    "Hamilton County needs to find 500 poll workers to have the 2,200 needed for May 3.",
    "Indian Hill Republican Jenn Giroux has filed to run against Chabot in the primary.",
    "Elections officials in the Cincinnati region are scrambling to find poll workers.",
    "Absentee ballots should be dropped off no later than 7:30 p.m. on election day.",
    "April 5: Absentee voting by mail begins\nApril 5: Early in-person voting beings.",
    "Clermont County will serve as the 2nd Congressional District's western edge.",
    "The new maps put the western part of Hamilton County in Davidson's district.",
    "Senator Rob Portman's news of retirement brings with it an open senate seat.",
    "But you will not see the Ohio House and Ohio Senate races on the ballots.",
    "Rep. Brad Wenstrup will no longer represent Hamilton County's east side.",
    "In Hamilton County, elections officials haven't predicted turnout yet.",
    "\"Everyone has been waiting to see if we had one primary pushed back.",
    "Normally by this time they need to find 250 or fewer, she said.",
    "This means voter registration rates and poll workers are down.",
    "Ohio has become accustomed to weird primaries in recent years.",
    "Early voting begins on Tuesday, April 5 for the May 3 primary.",
    "Local boards of election will be open until 9 p.m. on Monday.",
    "Here are the candidates appearing on the May primary ballots.",
    "That doesn't affect the races for Congress this election.",
    "She did not return a message seeking comment on Friday.",
    "Important dates\nApril 4: Deadline to register to vote.",
    "Here's what you should know for the May 3 primary.",
    "They aren't sure what to expect as far as turnout.",
    "You can register online until 11:59 p.m. Monday.",
    "The chaos has voting rights groups concerned.",
    "Many races don't have contested primaries.",
    "Ballots must be postmarked by May 2.",
    "There are three ways to do this.",
    "What will be on the ballot?",
    "There will be a primary.\"",
    "That's concerning.\""
  ]
}