{
  "id": 1768,
  "mediaId": 2688,
  "date": "2022-04-07",
  "headline": "Tennessee GOPers Add Age Limit To Hetero-Only Marriage Bill After Outcry",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/04/GettyImages-1219182893.jpg",
  "link": "https://talkingpointsmemo.com/morning-memo/tennessee-gopers-add-age-limit-to-hetero-only-marriage-bill-after-outcry?utm_source=rss&utm_medium=rss&utm_campaign=tennessee-gopers-add-age-limit-to-hetero-only-marriage-bill-after-outcry",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Cabrera",
  "authorUrl": "https://talkingpointsmemo.com/profile/cristina-cabrera",
  "termIds": [
    1694,
    1926,
    1934,
    2371,
    2576,
    3500,
    4628,
    5348
  ],
  "sentences": [
    "A new law that invites child brides would have come at an awkward time for a party that’s trying to resurrect homophobic tropes to vilify LGBTQ+ people as “groomers.”\nWith that minor hiccup dealt with, let’s take a look at what the legislation’s supposed to do: Oh, it’s a homophobic and very weird bill that would invent a new type of marital contract that can only legally be established “between one man and woman,” a special kind of state-approved marriage that The Gays can’t touch.",
    "The proceedings will be led by former Indiana Attorney General Curtis Hill (R), who, in addition to getting his law license temporarily suspended due to groping allegations, also performs as an Elvis impersonator:\nTwo Biden Cabinet Members Test Positive For COVID\nThe Justice Department and the Commerce Department announced on Wednesday that Attorney General Merrick Garland and Commerce Secretary Gina Raimondo had tested positive for COVID-19 earlier in the day.",
    "First Acquittal In Jan. 6 Trial\nYesterday saw the first time a Jan. 6 Capitol insurrectionist was found not guilty in their criminal case: A judge acquitted a federal contractor who admitted to entering the Capitol building but claimed that he didn’t know he was there illegally even though there was teargas and alarms going off.",
    "Congress Passes Bipartisan Call For Investigation Into Alleged Russian War Crimes In Ukraine\nThe House approved a call on Wednesday for an investigation into war crimes allegedly being committed by Russian forces in Ukraine after the Senate passed a similar bill last month.",
    "Again:\nWeird how Gosar keeps getting accidentally and unknowingly involved in white nationalist parties, like the America First Political Action Conference (AFPAC), where congressman sent a pre-recorded welcome video that he now claims was sent by accident by a staffer.",
    "House Approves Contempt Charges For More Trump Goons\nThe House voted on Wednesday to greenlight the House Jan. 6 Committee’s recommendation that ex-Trump officials Peter Navarro and Dan Scavino be held in contempt of Congress for flouting the committee’s subpoenas.",
    "Gosar Promoted White Nationalist Event Where He Was To Be Guest Of Honor\nFar-right Rep. Paul Gosar (R-AZ) was touting his own appearance at a gathering of the white nationalist group American Populist Union, which was scheduled on Adolf Hitler’s birthday.",
    "That vote makes four Trump cronies who have been referred to DOJ for contempt of Congress in the Jan. 6 panel’s investigation into the Capitol attack, including former White House chief of staff Mark Meadows and ex-White House strategist Steve Bannon.",
    "Only six House lawmakers (all Republicans) voted against the measure: Reps. Marjorie Taylor Greene (R-GA), Paul Gosar (R-AZ), Thomas Massie (R-KY), Andy Biggs (R-AZ), Warren Davidson (R-OH) and Scott Perry (R-PA).",
    "America’s Grand Jury “is the official template for Attorney Generals and Prosecutors on any level to not have any excuses not to prosecute Fauci and his bandits,” according to its website.",
    "Sen. Mike Lee (R-UT) griped on the Senate floor yesterday that Jackson’s nomination was “needlessly rushed.” I don’t think you need me to explain just how unserious that complaint is.",
    "“America’s Grand Jury,” organized by anti-vaxxers and an ex-attorney general/Elvis impersonator, will hold a mock prosecution next week, and for just $25, you can be on the jury!",
    "Gosar’s campaign told the Arizona Mirror after the story published that the GOP congressman isn’t going, and that the campaign has no idea how he was listed as a special guest.",
    "Jackson About To Make History\nSupreme Court nominee Ketanji Brown Jackson is slated to be confirmed today as the first Black woman justice on the high court.",
    "Fauci Haters Get To Pay To Be On Fake Grand Jury To Fake Indict Fauci\nAre you still really mad at public health official Dr. Anthony Fauci in the year 2022?",
    "Tennessee Republicans are pushing a bill that protests same-sex marriage by establishing a new “special” hetero-only common law marriage in the state.",
    "Now the recommendation heads over to the Justice Department, where Attorney General Merrick Garland might do…something with it….maybe…perhaps.",
    "In fact, there’s an opportunity to pay $10,000 to be a “VIP juror” for those truly committed to bring Fauci to justice for, uh, something!",
    "But Republicans will have time to fire some final shots at Jackson before the Senate can cut off debate for the final vote.",
    "Senate Majority Leader Chuck Schumer (D-NY) announced Wednesday night that the vote is expected to take place at 1:45 p.m.",
    "But oopsie!, they failed to include any kind of age restriction for the new special martial status.",
    "American Populist Union never contacted Gosar, the campaign or his staff, the campaign claimed.",
    "Do you wish you could spend your money pretending to indict him for, uh, something?",
    "But after a local news report about the event, the backtracking began.",
    "Lawmakers on Wednesday amended the bill to include age limits.",
    "Police officers had let him in, the contractor claimed.",
    "Cleanup On Aisle Four\nA lot going on here.",
    "This definitely isn’t a giant grift!",
    "Gosar announced it on Instagram.",
    "Here are some of the things.",
    "This is TPM’s Morning Memo.",
    "A lot of things happened.",
    "Do you like Morning Memo?",
    "Let us know!",
    "Good news!",
    "ET today."
  ]
}