{
  "id": 2389,
  "mediaId": 2658,
  "date": "2022-03-24",
  "headline": "House GOP returns to the state where Cheney fell — in a brighter mood this time",
  "image": "https://static.politico.com/81/83/15243f734d2e91fcab8d1e68a00e/https-delivery.gettyimages.com/downloads/1386263723",
  "link": "https://www.politico.com/news/2022/03/24/house-gop-mccarthy-cheney-mood-00020241",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "House Minority Leader Kevin McCarthy talks to reporters during his weekly news conference on March 18, 2022, in Washington, D.C. | Chip Somodevilla/Getty Images\nBy Olivia Beavers and Sarah Ferris\n 03/24/2022 05:56 PM EDT\nPONTE VEDRA BEACH, Fla. — Rep. Richard Hudson remembers warning Rep. Liz Cheney, minutes before she took the stage at last year’s House GOP retreat, that she would likely get asked whether Donald Trump was still considered the leader of the party.",
    "When asked last week about how this year’s Florida trip would compare to the previous year’s, McCarthy replied: “Won’t see any fallout.”\nAnd Republicans are growing more jubilant about their prospects in November, even as GOP leaders warn them not to be complacent.",
    "“I’m sure it’s more comfortable for GOP leadership without Liz there telling the truth about Trump and the anti-Semitic, white supremacist, pro-Putin members of the Conference,” Adler said in a statement for this story, referring to Russian leader Vladimir Putin.",
    "In many ways, the party is in a dramatically different place than a year ago, when McCarthy vowed that his party was more unified than ever in the wake of the Capitol insurrection and Cheney ended up undermining that message whenever the topic was broached.",
    "“Everyone is in a good mood.”\nAs the GOP gleefully looks to that November election, House Minority Leader Kevin McCarthy is working intently to make sure this year’s retreat doesn’t resemble last year’s intraparty rupture centering around Cheney (R-Wyo.)",
    "It’s part of the GOP’s new political focus on building a brand in traditionally Democratic circles — battleground districts in critical states like Florida and Texas, for instance — that they believe could cement their midterm victory in November.",
    "If Republicans win 18 seats, Emmer said, they would have a majority larger than the one they gained after the 1994 election that some in the party still consider the “Gingrich revolution.” If they take 30 seats, they would exceed the 2010 wave.",
    "Those included two GOP members attending a white nationalist rally, intraparty plotting to oust members from key committee spots over votes on the bipartisan infrastructure bill and the push to remove Cheney from the GOP conference altogether.",
    "Rep. Tom Emmer (R-Minn.), chair of the House GOP campaign arm, went as far as to hand out t-shirts that said “No mercy.” House Minority Whip Steve Scalise walked around Thursday in his own shirt that read “Take Back the House” on the sleeve.",
    "This time, House Republicans have decamped to a seaside resort town, aiming for a do-over in an annual gathering typically all about unity — a goal far simpler as the GOP’s chances of retaking the chamber seem to grow by the day.",
    "Now, just months away from their chance to knock Democrats out of power, House Republicans are optimistic that they can unite the party’s two ideological sides — seeking to train their firepower on Biden, instead of each other.",
    "It included new members, like Florida Reps. María Elvira Salazar and Carlos Giménez, as well as senior lawmakers like Rep. Mario Díaz-Balart, who spoke about the inroads that the GOP has made in Hispanic communities.",
    "During a closed-door session on Wednesday, Emmer stressed that seven months out from Election Day, the conference needs to keep the pressure on Democrats, according to a Republican aide familiar with his remarks.",
    "When Trump withdrew his endorsement of Rep. Mo Brooks (R-Ala.) in that state’s Senate race, Trump blamed Brooks’ calls for the former president that it was time to move on from claims the election was stolen.",
    "“Now that she’s no longer in the leadership picture ... we are as a party more unified and focused,” continued Banks, who said he’s never seen so many members show up to participate in the policy sessions.",
    "Republican leaders have set up roughly a half-dozen policy “task forces” that members say has energized the famously-fractious conference around a common goal that goes beyond taking swipes at Democrats.",
    "But privately, some believe his influence is waning as the candidates he’s endorsed in GOP primaries begin to fall behind, challenging his allies’ claim that he remains the party’s self-styled kingmaker.",
    "Some firebrand members of the House Freedom Caucus, like freshman Rep. Marjorie Taylor Greene of Georgia, rallied MAGA followers to attack members of their own party over votes that Trump opposed.",
    "Republicans are watching — and at times, cringing — as they watch Trump roll out endorsements of candidates they believe either lack the ability to win or who would bring turmoil to their ranks.",
    "And longtime Republicans would rather focus on another way the conference has changed in the last few years — including a more high-profile focus on the conference’s increasingly diverse ranks.",
    "McCarthy and his leadership team have sought to turn the three-day gathering into something of a brainstorming session for the governing powers that are now within the House GOP’s reach.",
    "But when he urged Cheney to respond with a joke and pivot to hitting President Joe Biden, saying she missed the former president, she told him she wouldn’t do it, according to Hudson.",
    "But even though Republicans have moved on from Cheney in the past year, they’re still facing the same question that triggered her ouster: Is Trump the leader of the Republican party?",
    "“I think his endorsement is still very useful in most seats, but it’s not what it used to be without him on social media,” said one GOP member, granted anonymity to speak candidly.",
    "For instance, House Republican Conference Chair Elise Stefanik (R-N.Y.) held what she called the group’s first-ever bilingual press conference focused on engaging Hispanic voters.",
    "“It’s not as powerful as he used to be.”\nIt’s not just Trump’s approval that seems to have lessened in importance — his influence over policy may be losing steam as well.",
    "“The difference between now and a year ago is that Liz Cheney was a distraction from the concerted focus on winning back the majority,” said Rep. Jim Banks (R-Ind.",
    "The North Carolina Republican ended up in the background as his Wyoming colleague fielded that Trump question and instead used it to roast the former president.",
    "“We’re not just coming off of him being president,” said Freedom Caucus member Warren Davidson (R-Ohio), who noted that Trump still has sway on some issues.",
    "Still, Republican leaders have had to repeatedly remind their conference to stay focused after a year of various avoidable scandals.",
    "Some House Republicans have a different theory — that Trump was embarrassed by his endorsed candidate lagging in the polls.",
    "Duck?”\nNearly one year ago, Cheney’s relationship with most of her party imploded on camera in another sunny vacation spot.",
    "Multiple GOP members say it is not a matter of if they take back the majority, but a matter of how many seats they’ll gain.",
    "“One thing I will say to the American public: You may not have looked at the Republican Party in the last couple years.",
    "He also spoke about the possibility of winning 35 seats — which would create the largest majority in nearly 100 years.",
    "Fallout from her ouster plagued the party for months, and it was far from the GOP’s only road bump over the past year.",
    "“[She] just went off on Trump,” Hudson, who serves as the GOP conference secretary, said in an interview Thursday.",
    "Days before this year’s retreat, McCarthy sought to dismiss the idea of another high-profile fissure.",
    "We want you to re-look at us,” McCarthy told reporters at his opening press conference Wednesday.",
    "In the meantime, GOP leadership seems content to remain quiet about those tensions.",
    "“So there’s not as much tied extremely inextricably to the legislative agenda.”",
    "Cheney spokesperson Jeremy Adler, meanwhile, offered his own perspective.",
    "But even he couldn’t help theorizing how many seats were on the table.",
    "“And it was Drew Ferguson, Mike Johnson and me standing behind her.",
    "Publicly, most House Republicans will answer in the affirmative.",
    "), who leads the Republican Study Committee.",
    "“This feels different,” Hudson said.",
    "Should we walk off the stage?",
    "and her criticisms of Trump.",
    "Hudson was stunned."
  ]
}