{
  "id": 2965,
  "mediaId": 2537,
  "date": "2022-03-15",
  "headline": "Ohio and Kentucky lawmakers among those suing CDC over mask requirement on airplanes",
  "image": "https://www.gannett-cdn.com/presto/2021/11/23/NTEG/85b1b9d5-1ee6-4e5c-869a-9282f79a1daf-AP_air_travel.jpg?crop=5699,3206,x0,y290&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/03/15/rep-thomas-massie-sues-cdc-over-mask-requirement-airplanes/7048527001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Berry",
  "authorUrl": "https://www.cincinnati.com/staff/5524867002/rachel-berry/",
  "termIds": [
    0
  ],
  "sentences": [
    "Other plaintiffs in the lawsuit include:\nRep. Andy Biggs, R-Ariz.\nRep. Dan Bishop, R-N.C.\nRep. Lauren Boebert, R-Colo.\nRep. Andrew Clyde, R-Ga.\nRep. Bob Good, R-Va.\nRep. Paul Gosar, R-Ariz.\nRep. Marjorie Taylor Greene, R-Ga.\nRep. Brian Mast, R-Fla.\nRep. Alex Mooney, R-W. Va.\nRep. Barry Moore, R-Ala.\nRep. Ralph Norman, R-S.C.\nRep. Bill Posey, R-Fla.\nRep. Matt Rosendale, R-Mont.",
    "\"Americans are fed up with political measures linked to public health and deserve representation that will take action to bring these unconstitutional mask mandates to an end,\" Davidson said in a press release.",
    "Three Ohio and Kentucky lawmakers are among 17 members of Congress suing the Centers for Disease Control and Prevention over its rule requiring masking on airplanes and other forms of public transportation.",
    "For the next month, the CDC will work with government agencies to revise the policy, issuing new guidance for when masks will be required, according to a press release.",
    "Among the other plaintiffs in the lawsuit are Sen. Rand Paul, R-Ky, and Rep. Warren Davidson, a Republican representing southwest Ohio, including Butler County.",
    "The federal lawsuit, which was filed Monday in the Western District of Kentucky, alleges the CDC doesn't have the authority to implement or enforce the order.",
    "The order requires masking in transportation facilities and on public transportation including airplanes, buses and trains.",
    "The CDC's media relations department didn't immediately respond Tuesday to a phone message and email requesting comment.",
    "In addition to the lawsuit, Paul is also sponsoring a joint resolution that would nullify the CDC's order.",
    "Rep. Thomas Massie, a Republican representing Northern Kentucky, is the lead plaintiff on the lawsuit.",
    "Northern Kentucky reporter Rachel Berry can be reached at rberry@enquirer.com.",
    "It was first issued in January 2021 and was recently extended until April 18.",
    "Follow her on Twitter @racheldberry.",
    "Rep. Chip Roy, R-Texas."
  ]
}