{
  "id": 3299,
  "mediaId": 2540,
  "date": "2022-03-08",
  "headline": "Republican leaders face threat of revived Freedom Caucus in GOP-led House",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220102092949-marjorie-taylor-greene-092221-file-super-tease.jpg",
  "link": "https://www.cnn.com/2022/03/08/politics/house-freedom-caucus-revived-republican-majority/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melanie Zanona",
  "authorUrl": "https://www.cnn.com/profiles/melanie-zanona",
  "termIds": [
    0
  ],
  "sentences": [
    "Lawmakers like Greene and Cawthorn -- who both regularly speak to Trump and make routine treks down to Mar-a-Lago -- have been meddling in ruby red districts all around the country to remake the conference in a more MAGA-like image, though they suffered their first major defeat in Texas last week, when their preferred candidate, Christian Collins, handily lost in an open primary race to the Kevin McCarthy-backed Morgan Luttrell.",
    "Greene, for example, has introduced numerous bills to impeach Biden, called for the GOP to form its own January 6 select committee in order to paint an alternative narrative about the insurrection and demanded that Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois be expelled from the GOP conference for their roles investigating the Capitol attack.",
    "It might help that if Republicans take back power, the House GOP will likely be more focused on passing messaging bills and conducting rigorous oversight of the Biden administration -- an area where it has far more internal agreement -- than on governing, since it will still have Biden in the White House for at least another two years.",
    "Last week alone, they drew unwanted attention to their party for heckling President Joe Biden during his State of the Union address, attending a conference organized by a known White nationalist and being the lone \"no\" votes on measures to make lynching a federal hate crime and to express support for Ukraine amid its war with Russia.",
    "Allies of McCarthy say his approach has allowed the party to maintain a sense of unity in its pursuit to take back the majority, and they also point out that Gosar and Greene have already been stripped of their committee assignments, so he has fewer tools at his disposal to punish them.",
    "But the prospect of a bigger and more emboldened House Freedom Caucus means some of the group's loudest MAGA firebrands, such as Reps. Marjorie Taylor Greene of Georgia, Lauren Boebert of Colorado, Madison Cawthorn of North Carolina and Paul Gosar of Arizona, will also be elevated.",
    "With the growing likelihood that Republicans will take over the House after elections this fall -- and the prospect of Trump running for president again in 2024 -- members of the Trump-loving House Freedom Caucus are preparing to flex their muscles in the next era.",
    "Under the new leadership of Rep. Scott Perry of Pennsylvania, the group is hoping to use its hardline tactics, connections to Trump and friendlier relationship with GOP leadership to bend their party to their will and put their MAGA-like stamp on the conference.",
    "Past iterations of the group -- which was formed as an ultra-conservative alternative to the Republican Study Committee but has since become more of a Trump loyalty club -- were more focused on process and transparency concerns, as well as fiscal conservatism.",
    "McCarthy also publicly defended Greene and Gosar when Democrats kicked them off their committees for inflammatory rhetoric, promising to give them new assignments -- and potentially even better ones -- if Republicans win back the majority.",
    "While McCarthy condemned Greene and Gosar last week for attending the White nationalist conference and said he planned to speak with them privately, there are no signs that he has any plans to formally reprimand them for their behavior.",
    "The conservative crew is also pressing GOP leaders to tap a Freedom Caucus lawmaker for the House Intelligence Committee, which became ground zero for some of the most heated and partisan battles during the Trump administration.",
    "Unlike his predecessors who ruled with more of an iron fist, House Minority Leader Kevin McCarthy has taken a more soft-touch approach with the conservative crew, a key constituency in his quest to secure the speaker's gavel.",
    "\"We need to make sure we get a good Rules package, make sure we get good leaders on all the right committees and in the leadership team,\" said Rep. Warren Davidson of Ohio, a member of the Freedom Caucus' leadership team.",
    "To keep the group in his good graces, McCarthy has invited the Freedom Caucus for numerous face-to-face sit-downs in his office to talk about various subjects and has occasionally shown up to the group's weekly meetings.",
    "Freedom Caucus members don't seem to have much of a place in a lot of the larger decision-making,\" said Perry, a staunch Trump ally who has come under scrutiny for trying to overturn the 2020 election on January 6, 2021.",
    "Even some members of the Freedom Caucus were privately frustrated with the most recent antics from Greene and Gosar, and sought to distance themselves from event organizer Nick Fuentes, a known White nationalist.",
    "But others in the GOP worry that the party's extremists have been enabled, and they warn that the problem could get worse if they're in the majority and these Freedom Caucus members have an even greater platform.",
    "\"A lot of them disagree with what she did,\" said moderate Rep. Don Bacon, a Nebraska Republican who said he's talked to Freedom Caucus members about Greene's appearance at the White nationalist conference.",
    "Greene also annoyed many of her colleagues, including some members of the Freedom Caucus, earlier last year when she repeatedly forced procedural votes on the floor without a clear strategy behind it.",
    "The Freedom Caucus denied the California Republican the speakership in 2015, and to seal the deal next time around, he may need to offer some concessions to the group, which would further empower it.",
    "Key to the Freedom Caucus' ability to hold sway in the majority is its strength in numbers and willingness to stick together, though its power ultimately depends on the size of the GOP's majority.",
    "For the Freedom Caucus to truly be influential, it needs to stick together on votes, which would give it the power to block legislation from coming to the floor if the group is not happy with it.",
    "One Freedom Caucus co-founder and Trump acolyte, Rep. Jim Jordan of Ohio, is already in line to wield the coveted House Judiciary Committee gavel -- and all the subpoena power that comes with it.",
    "Those internal schisms could widen even further when Republicans are in power and the Freedom Caucus has to make key decisions about how to wield its influence and use its megaphone.",
    "And whenever Freedom Caucus members cause trouble, McCarthy prefers to deal with them behind the scenes, like when Greene complained about him on a podcast on Thanksgiving last year.",
    "\"And then when we look at our agenda, it's going to be essential to unite Republicans in the House and Senate over what we'll go to the mat over in the appropriations process.\"",
    "Under its current rules, the caucus must vote as a unified bloc if it takes a formal position on any issue, which requires agreement from 80% of its members.",
    "The band of roughly 40 rabble-rousers added nearly a dozen members to its ranks in the last election, and is hoping to expand its troops even more this fall.",
    "\"Don't forget that we added 11 new members to the Freedom Caucus from the last election,\" said Rep. Andy Biggs of Arizona, the previous Freedom Caucus chief.",
    "That's because on any given day, it seems this extremist crew is making headlines -- and creating headaches for GOP leadership -- with their behavior.",
    "It's another thing to be the wacky conference,\" said one House GOP lawmaker, who was granted anonymity to speak more freely about his colleagues.",
    "But some of the freshmen firebrands seem more intent on grabbing headlines and turning the House into a venue for Trump's vengeance campaign.",
    "And that could pose a potential governing challenge for Republican leaders, who have so far struggled to rein in the GOP's fringe elements.",
    "Still, the group is confident that it'll have other pickup opportunities this year to get more like-minded lawmakers elected to the House.",
    "(CNN)Former President Donald Trump's most loyal allies in Congress have been relegated to the political wilderness for the past few years.",
    "In fact, Gosar attended the same conference last year and faced zero repercussions; he then addressed the gathering this year via video.",
    "The party's most prominent provocateurs have even earned a private new nickname from some of their colleagues: \"the trending caucus.\"",
    "And it's entirely possible that a caucus member runs for a seat at the leadership table, especially if there are any open positions.",
    "\"If you're Mark Green or Jeff Duncan or Ben Cline, do you really want to be associated with either Marjorie Taylor Greene or Gosar?",
    "But lawmakers who belong to the caucus insist they will be aligned not only with each other but also with their own leadership.",
    "I wouldn't think so,\" said the House GOP lawmaker, name-checking some of the more mild-mannered members of the Freedom Caucus.",
    "\"Hopefully, we'll all be on the same page and we don't have to worry about that stuff, all across the board,\" Perry said.",
    "Among the top items on their wish list: They want more of their members in positions of authority under a GOP-led House.",
    "\"We're a long ways away at this point from Jim Jordan and Mark Meadows' Freedom Caucus leading the caucus.\"",
    "Most notably, he turned Jordan, a former rival, into a key ally by promoting him for prime committee posts.",
    "\"I mean, just the State of the Union alone, Marjorie, Lauren, their antics were embarrassing for all of us.",
    "Another reason the group may hold more clout in the majority: its warmer relationship with GOP leadership.",
    "\"We're going to be pushing for a fair process; we're going to be pushing for more participation.",
    "Not to mention, these far-right members are well liked by Trump and his hard-core supporters.",
    "Some of the more veteran members of the group are still emphasizing that as a top priority.",
    "Grabbing headlines\nIt's unclear how the Freedom Caucus plans to wield its likely influence.",
    "Another caucus member is vying to lead the House Homeland Security Committee next year.",
    "\"There's no Freedom Caucus member on the Select Committee on Intelligence.",
    "So what's that going to be like next term, when it gets even worse?\"",
    "\"It's one thing to be a troublemaker, like a maverick brand, right?",
    "Seems to be that there should be a Freedom Caucus member on that.\"",
    "\"If we don't pick up five or six (next year), I'd be surprised.\"",
    "The next day, McCarthy called up Greene to hash things out.",
    "\"I don't know that they're unified on that.\"",
    "Now they're plotting their comeback."
  ]
}