{
  "id": 3365,
  "mediaId": 2528,
  "date": "2022-03-16",
  "headline": "Trump-backing congressmen and a top DC lobbyist will make their own luck at a St. Patrick's Day political fundraiser",
  "image": "https://i.insider.com/62325398de6686001829037a?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/donald-trump-congressman-ukraine-lobbyist-fundraiser-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camila DeChalus",
  "authorUrl": "https://www.businessinsider.com/author/camila-dechalus",
  "termIds": [
    0
  ],
  "sentences": [
    "US House of Representatives\nDavidson has previously taken a dim public view of for-hire political influencers, stating that \"big businesses and the well-connected employ high-priced lawyers, accountants, and lobbyists to game the system, while everyday Americans and small businesses are left footing the bill.\"",
    "Dan Crowley, a lobbyist and partner at K&L Gates, is scheduled to host the fundraising dinner on Thursday for Republican Rep. Warren Davidson of Ohio, with \"special guest\" Roger Williams, a Republican congressman from Texas, also attending, according to an invitation obtained by Insider.",
    "Crowley lobbied for a dozen companies and special interest groups in 2021, including the US Cannabis Council, California Public Employees' Retirement System, and Transatlantic Business Council, according to federal data compiled by nonprofit research organization OpenSecrets.",
    "Crowley's lobbying portfolio primarily focuses on \"public policy issues relating to financial services and capital markets, and he leads the firm's global financial services policy practice,\" according to his LinkedIn profile.",
    "Davidson made news this week after he joined 16 other Republican lawmakers in a lawsuit seeking to end a Centers for Disease Control and Prevention mandate that requires people to wear face masks while traveling on airplanes.",
    "\"Warren is all about action, not just words, pushing Republicans to: defend freedom, America first economy and security, smaller government, sound money,\" Trump wrote February 9 in his endorsement of Davidson.",
    "Political action committee representatives are asked to pay at least $1,000 while individuals are asked to pay $500, according to the invitation, which is printed over the image of a large, four-leaf clover.",
    "K&L Gates\nDavidson is running for re-election in Ohio's 8th congressional district and is almost certain to face Democratic challenger Vanessa Enoch in the 2022 general election.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "President Joe Biden has announced on Wednesday that it will provide significant security assistance to Ukraine and send the \"most cutting-edge systems\" to the country.",
    "Ukrainian President Volodymyr Zelenskyy gave a virtual address on Wednesday to US lawmakers imploring the United States to provide more financial aid to his country.",
    "Williams is running for re-election for Texas's 25th congressional district and faces Democratic challenger Julie Oliver, who previously ran against him in 2020.",
    "Tom Williams/CQ-Roll Call, Inc via Getty Images\nTwo Republican lawmakers are headlining a political campaign fundraising event Thursday for re-election efforts.",
    "Davidson, for his part, decried Putin's \"unjust\" invasion, but said \"Americans or NATO enforcing a no-fly zone would mean war with Russia — wrong direction.\"",
    "Davidson and Williams are ardent Trump supporters and were among the 147 Republican lawmakers who voted to overturn the 2020 presidential election results.",
    "But that hasn't stopped two Trump-approved Republican lawmakers from conducting a St. Patrick's Day-themed political fundraiser with a top DC lobbyist.",
    "An invitation to a political fundraiser for Rep. Warren Davidson, a Republican from Ohio, hosted by K&L Gates lobbyist Dan Crowley.",
    "Both Davidson, Williams and Crowley did not respond to Insider's request to comment about their political fundraising event.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Both Republican and Democratic lawmakers applauded the speech and called on the Biden administration to do more.",
    "Rep. Roger Williams of Texas is expected to be a special guest at a political fundraising event this week.",
    "The Republican lawmakers' political fundraising event comes amid the escalating Ukraine-Russia conflict.",
    "He's also lobbied for nonprofit donor-advised fund Vanguard Charitable, according to federal records.",
    "\"He supports Secure Borders, our Second Amendment, our Military and our Vets, and Law Enforcement.",
    "Guests are encouraged to donate up to $2,500, according to documents Insider obtained.",
    "A top lobbyist for K&L Gates is scheduled to host the event, according to documents.",
    "The war in Ukraine has dominated the national discourse on Capitol Hill this week.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Rep. Warren Davidson seen in Washington, DC, on August 24, 2021.",
    "Guests are encouraged to donate $2,500 to co-host the event.",
    "Former President Donald Trump has endorsed both men.",
    "Stay up to date with what you want to know.",
    "He has my Complete and Total Endorsement!\"",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}