{
  "id": 3738,
  "mediaId": 2658,
  "date": "2022-03-01",
  "headline": "POLITICO Playbook: Biden’s SOTU blues",
  "image": "https://static.politico.com/bb/09/f2be4a694254a8e1f46a07e49e23/gettyimages-1373741404.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/03/01/bidens-sotu-blues-00012671",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1810,
    2693,
    3975,
    4711,
    831,
    5073,
    5077,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "As Trevor Hunnicutt reports for Reuters, “many of the policies he promotes will seem familiar — raising Pell grants for education, raising the federal minimum wage to $15 and creating a national paid family medical leave program — but the messaging is different.”\nNYT’S Michael Shear reports that the plans include a call “to spend hundreds of billions of dollars on child care, elder care and prescription drugs.” He “will argue that passage of the legislation will effectively counter the inflation that is affecting people’s everyday budgets.” More on this change in direction from CNN\nThe president will also call on Congress to pass legislation to help American companies compete with China, which is already in the works in both chambers.",
    "POLITICO Playbook: Biden’s SOTU blues\nBy RACHAEL BADE, RYAN LIZZA and EUGENE DANIELS\n03/01/2022 06:23 AM EST\n Updated 03/01/2022 06:40 AM EST\n 2022-03-01T06:40-0500\nPresented by\nDRIVING THE DAY\nBREAKING OVERNIGHT IN UKRAINE — WSJ: “Russian forces struck the central square of the Ukrainian city of Kharkiv early Tuesday, as Moscow, frustrated in its plans for a quick victory, switched to a new strategy of pummeling civilian areas in an attempt to demoralize Ukrainian resistance.",
    "“For the second day in a row, the Kremlin raised the specter of nuclear war,” the AP reports, “announcing that its nuclear-capable intercontinental ballistic missiles, submarines and long-range bombers had all been put on high alert, following President Vladimir Putin’s orders over the weekend.”\n“Empire of lies.” — Putin referring (again) to Western countries that implemented the sanctions\n— A trickle of Russian elites are breaking with Putin.",
    "“I don't know about y'all, but I don't want one penny of Georgians’ money going to subsidize Vladimir Putin!” — Georgia state House Speaker DAVID RALSTON (R)\nCONGRESS\nABORTION RIGHTS BILL FALLS FLAT— As the Supreme Court gets closer to an expected decision to either eliminate or limit abortion rights established by Roe v. Wade, the Senate failed to advance the Women’s Health Protection Act with a vote of 46-48.",
    "However, British defense intelligence said early Tuesday, “The Russian advance on Kyiv has made little progress over the past 24 hours probably as a result of continuing logistical difficulties” and that “Russia has failed to gain control of the airspace over Ukraine.”\nAmnesty International accused Russia of using cluster munitions in an attack on a preschool where civilians were sheltering Friday.",
    "— Joe Kennedy III’s Groundwork Project is announcing its slate of leaders and new hires: Emily Kaufman as executive director, Julia Hoffman as senior adviser, Tracey Lewis as national organizing adviser, Charles Taylor as Southern organizing adviser, Anthony Davis as regional organizing adviser, Matt Kearney as Massachusetts organizing director, and Aspen Christian as digital director.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "The news of her retort didn’t sit well with centrists like Rep. JOSH GOTTHEIMER (D-N.J.), who told Axios that Tlaib’s response was like “keying your own car and slashing your own tires.”\nGottheimer, we’re told, is going to be speaking tonight alongside Rep. BRIAN FITZPATRICK (R-Pa.), his bipartisan Problem Solvers Caucus co-chair, at an event hosted by No Labels.",
    "MEDIAWATCH\nIT’S … LICHT —The Hollywood Reporter’s Alex Weprin profiles CHRIS LICHT, the newly tapped head of CNN, speaking with some of media’s heaviest hitters: MSNBC’s JOE SCARBOROUGH and CBS’ GAYLE KING, who describe him as a “tough middle linebacker” and someone who “has the intelligence, he has the cojones, he has the wit, to take it all on,” respectively.",
    "… Giulia Giannangeli of the House Small Business GOP … Maddison Stone … March of Dimes’ Stacey Stewart … Stephen Ezell … Medtronic’s Adam Brand … Vanessa Cadavillo … POLITICO’s Lorraine Woellert, Ali Taki and Tierra Perdue … Vayl Oxford … NBC’s Bridget Bowman … Meghan Milloy … AstraZeneca’s Elizabeth Brooks … Elizabeth Rhee … former Sens.",
    "Chris Christie slammed Donald Trump (without naming him) over 45’s post-invasion praise of Vladimir Putin: “How can anyone with any understanding of the world call Putin’s decision to invade Ukraine ‘genius’ and ‘very savvy’ as we watch him unite the rest of the world against Russia in nearly an instant?” the ex-NJ gov tweeted.",
    "McCarthy described far-fright fringe organizer NICK FUENTES’s language as ‘appalling’ and said the ‘language that he uses about antisemitism and the chanting for Putin is unacceptable.’”\nTEXAS TWO-STEP\nMIDTERM KICKOFF — Today is the official start to the midterm elections as dozens of primary elections take place.",
    "As WaPo reported Monday, administration officials have been passing around a guest essay by former Obama adviser DAVID AXELROD pushing for Biden to adopt humble tones acknowledging an ongoing “national trauma.” But not all White House aides agree with the advice.",
    "ONGOING DEMOCRATIC INFIGHTING — In perhaps a first, we’ll see Biden’s critics within his own party respond to his SOTU when Rep. RASHIDA TLAIB (D-Mich.), a progressive member of the so-called Squad, speaks on behalf of the Working Families Party.",
    "In Finland, political leaders are meeting today to discuss the country’s response to Russian aggression, including the possibility of joining NATO, a once enormously unpopular policy that now enjoys majority support, according to a recent poll.",
    "Steve Sisolak’s reelect … Natalie Szemetylo … Ryan Little … Aaron Sherinian … Lauren Vicary … Mike Bloomquist … Tom Jones … Jonathan Lipman … Raben Group’s Jessica McCall … Sally Canfield … Max Morningstar\nDid someone forward this email to you?",
    "PARTY OF TWO — Republicans are increasingly pushing Reps. PAUL GOSAR (Ariz.) and MARJORIE TAYLOR GREENE (Ga.) onto an island after their appearances at a white nationalist conference this weekend, our Burgess Everett and Olivia Beavers report.",
    "“Inside CNN, the hiring of Licht is already generating text chains about what it means for the future of the venerable news outlet, both on-air and in streaming, with the CNN+ streaming service set to launch in coming weeks,” Weprin writes.",
    "“Congress must act quickly to address these challenges, especially as we continue to face systemic racism’s disparities and inequities, as well as rising prices squeezing working people, and the climate crisis that is escalating every day.",
    "U.S. officials said that Kyiv, where a 40-mile long convoy of Russian troops and military hardware was approaching the city Tuesday morning, “would likely fall within one to four days of a full-scale Russian assault,” CNN reports.",
    "This morning, the oft-bickering heads of the House’s major Democratic caucuses will release a rare joint statement calling on Congress to reboot talks to pass at least some version of BBB — though they won’t call it that anymore.",
    "Meanwhile, as climate activists push Biden to go hard on climate change, Sen. JOE MANCHIN (D-W.Va.) on Monday night called on the Biden administration to increase domestic energy production to ease reliance on Russian oil.",
    "“I also condemn the leadership of Russia … Under the auspices of recognizing the DPR and LPR, we hid plans to unleash a full-scale war with our closest neighbor.” — VYACHESLAV MARKHAEV, member of the Russian parliament.",
    "The ruble “was trading at 93.4 per dollar … having recovered nearly all of Monday's losses helped by an emergency rate hike by Russia's central bank after the currency collapsed to a record low of 120 per dollar.",
    "— The C. Boyden Gray Center for Study of the Administrative State will announce three distinguished practitioners in residence, all big names in conservative circles: Paul Clement, Steven Engel and Don McGahn.",
    "ENGAGED — Corey Becker, legislative director for Sen. Joni Ernst (R-Iowa), and Franci Rooney, counsel to Sen. John Cornyn (R-Texas), got engaged over the weekend in Montecito, Calif., while visiting friends.",
    "KIM REYNOLDS, who has been floated as a possible 2024 running mate for DONALD TRUMP, is expected to drill down on another Achilles’ heel for Democrats: the toll that the pandemic is exacting on schoolkids.",
    "“It is very understandable that many Finns have changed or are changing their minds after Russia started waging war on Ukraine.” — Finnish PM SANNA MARIN\n— The Russia divestment campaign is growing.",
    "Pic\n— Michelle Zar, director at Brightspot and a POLITICO alum, and Zach Beecher, chief of staff at America’s Frontier Fund, got engaged Wednesday at Lulu’s Wine Bar, surrounded by the whole family.",
    "The move, which has become a central talking point for Republicans in recent days, will put Biden in a tight spot between environmentalists and people concerned about exorbitant prices at the pump.",
    "TRUMP CARDS\nAS ANTICIPATED — Trump is appealing a judgment requiring him, IVANKA TRUMP and DONALD TRUMP JR. to testify in New York state’s civil investigation into his family’s business practice.",
    "The Central Bank of Russia said it will not resume trading in shares or derivatives.”\nDuring a meeting with top officials to discuss the sanctions, Putin continued to escalate his rhetoric.",
    "ANOTHER ONE BITES THE DUST — Rep. FRED KELLER (R-Pa.) announced Monday that he is not seeking reelection after a new map put him at odds with a fellow Republican congressman, AP reports.",
    "The GOP will respond with stats like that while pointing to rising violent crime, disillusionment with the pandemic and arguments suggesting the president is “weak” on foreign policy.",
    "Our Stephanie Murray takes a look at the six most interesting races to keep your eyes on, especially on the left, where this will be the first real test of progressive strength.",
    "If Ukraine does not survive, we cannot be surprised if democracy fails next.” — Ukrainian Ambassador to the U.N. SERGIY KYSLYTSYA\n— The backlash against Russia is continuing.",
    "More from Ukraine below, but first …\nWHAT AWAITS POTUS TONIGHT — At 9 p.m., President JOE BIDEN will deliver the type of State of the Union address he never wanted to give.",
    "“When asked if he plans to take action against Gosar and Greene, [House Minority Leader KEVIN] MCCARTHY said on Monday evening he would ‘have a discussion’ with the duo.",
    "“I believe Russia is trying to put pressure [on Ukraine] with this simple method.” — Ukrainian President VOLODYMYR ZELENSKYY\n— The sanctions against Russia are working.",
    "Biden officials told House members in a classified briefing Monday that “1,500 civilian and military casualties have occurred since the invasion began,” WaPo reports.",
    "A REMINDER OF UNFINISHED BUSINESS — While Democratic leaders have largely moved on from the now-dead Build Back Better plan, many lawmakers on Capitol Hill have not.",
    "Civilian casualties in the conflict are rising as Russia, unable to penetrate Ukraine’s largest cities for several days, resorts to more indiscriminate shelling.",
    "WHAT ELSE BIDEN WILL SAY — Watch for the president to reframe BBB tonight into a four-point economic plan that he’ll ask lawmakers to work on immediately.",
    "FROM THE CHIEF’S MOUTH — NBC’s Lester Holt will interview White House chief of staff RON KLAIN in a conversation airing on “NBC Nightly News” at 6:30 p.m.",
    "and Luther Strange (R-Ala.) … Howard Altman … former Reps. Carlos Curbelo (R-Fla.) and Randy Hultgren (R-Ill.) … Jess McCarron … Arif Hasan of Nevada Gov.",
    "He’ll highlight GDP growth and historic low unemployment — but also stress that more must be done to bring costs down (more on this in a minute).",
    "Ahead of the address, RNC Chair RONNA MCDANIEL argued on a call with reporters that inflation is costing average families about $3,500 last year.",
    "Two Russian billionaires, MIKHAIL FRIDMAN and OLEG DERIPASKA, spoke out against the war in Ukraine on Monday, calling for an end to the conflict.",
    "One that comes as Americans continue to grapple not only with soaring prices, but also with the world order as we know it teetering on the edge.",
    "CNN’s Matthew Chance was doing a live hit in Ukraine when he realized he was kneeling near a grenade — then backed away like it was no biggie.",
    "Indeed, as the Russian military closes in on Kyiv, Biden will be hard-pressed to argue that the state of the union is anything but in peril.",
    "Administration officials say Biden will spotlight improvements in the economy while sympathizing with the plight of struggling Americans.",
    "Biden is expected to use his address to respond to criticism that he didn’t act quickly enough to stop Russian President VLADIMIR PUTIN.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "Similar efforts, per CBS, are sweeping through state capitals in California, Colorado, Connecticut, New Jersey, Virginia and Washington.",
    "She most recently was comms director for Sen. Chris Murphy (D-Conn.) and is a Joaquin Castro (D-Texas) and House Foreign Affairs alum.",
    "He most recently was a policy director at the Information Technology Industry Council, and is a Mike O’Rielly and Brett Guthrie alum.",
    "TEXAS PRIMARY WATCH — And Zach Montellaro breaks down the five things POLITICO is watching during Texas’ primaries Tuesday night.",
    "The president will want to tout achievements from the past year, but also not give a sense that he’s out of touch with voters.",
    "He’ll have events for the book with Maureen Dowd in New York City on Wednesday and with John King in Washington on Friday.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nWAR IN UKRAINE\nDAY SIX — What you need to know:\n— The human toll in Ukraine is mounting.",
    "He’ll emphasize his work to build an international coalition to counter Russia, as well as imposing crippling sanctions.",
    "Switzerland reversed course and endorsed the European Union’s first round of sanctions and also froze Russian assets.",
    "A residential area of Kharkiv, home to 1.4 million people, was shelled Monday, killing civilians, including children.",
    "There was a parade of denunciations of the Russian invasion from diplomats, but no prospect for meaningful action.",
    "… Dwayne Clark will be legislative assistant for Rep. Robert Aderholt (R-Ala.), handling space and agriculture.",
    "Our POLITICO Europe colleague Hannah Brenton reports that the “Moscow Stock Exchange will remain closed today.",
    "Meanwhile, both the U.N. General Assembly and Security Council met in emergency sessions late into the night.",
    "The U.N. reported that more than 500,000 refugees have streamed out of Ukraine, mostly to Poland and Moldova.",
    "Reynolds is expected to talk about how she kept schools open during the pandemic, in contrast with the left.",
    "… Air-raid sirens and the thud of explosions sounded all morning in Kyiv.” Video of the Kharkiv strike here.",
    "Instead, the situation in Ukraine has forced the West Wing to rewrite significant partitions of his speech.",
    "And with the president’s approval numbers as poor as they are right now, they’ll have a receptive audience.",
    "BOOK CLUB — Frank Bruni’s new book, “The Beauty of Dusk: On Vision Lost and Found” ($28), comes out today.",
    "PLAYBOOKERS\nVolodymyr Zelenskyy once voiced the Ukrainian version of both movies about Paddington Bear.",
    "He most recently was press secretary for the National Governors Association and is a former journalist.",
    "(The Swiss are still studying the EU’s more aggressive round of sanctions announced over the weekend.)",
    "A judge had set a March 10 deadline for the trio to sit for depositions, AP’s Michael Sisak reports.",
    "(Russia has veto power in the Security Council, and General Assembly resolutions are non-binding.)",
    "Send us good color or insights from the SOTU tonight: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "Their hope: to drown out the partisans sniping over Biden’s speech and offer a unified message.",
    "Three members of the Russian parliament also criticized Putin’s invasion Monday, per the NYT.",
    "An expert at Human Rights Watch told the NYT he was “convinced” that cluster bombs were used.",
    "…\n… Joel Miller is starting as senior manager for U.S. policy and economic graph at LinkedIn.",
    "He previously was director of executive comms at CVS Health and is a Sheldon Whitehouse alum.",
    "TRANSITIONS — Bennett Resnik is now SVP in Venn Strategies’ critical infrastructure practice.",
    "The couple met while working for their respective bosses on the Senate Judiciary Committee.",
    "He previously was counsel and director of government relations at Cardinal Infrastructure.",
    "ALMOST GIDDY REPUBLICANS — The GOP is ready to pan Biden’s address no matter what he says.",
    "Biden and his advisers had hoped to use this moment to reboot his stalled domestic agenda.",
    "Still, the rouble was down almost 30% from its best levels this year,” Reuters reports.",
    "BIDEN’S TUESDAY:\n— 9:50 a.m.: The president will receive the President’s Daily Brief.",
    "Numerous states moved to divest their assets from Russia and sanction the country.",
    "He currently is military legislative assistant for Rep. Anthony Gonzalez (R-Ohio).",
    "Their first date was over oysters at Pearl Dive just before the pandemic started.",
    "Manchin joined Republicans to block the measure, Alice Miranda Ollstein reports.",
    "Happy Fat Tuesday — though we at Playbook don’t need the excuse to be gluttons.",
    "Jill Biden wore a mask with a sunflower on it to show solidarity with Ukraine.",
    "The Biden administration is scrambling to secure funds to provide assistance.",
    "Indiana is trying to ban Russian entities from buying property in the state.",
    "Wanna know what Trump told Bill Barr the “secret of a really good tweet” is?",
    "… Jamie Geller is joining Purple Strategies as a senior director/comms lead.",
    "And he’ll unveil new plans to address supply-chain issues driving up costs.",
    "It’s a tricky balancing act, as White House officials have come to realize.",
    "Russian-Ukrainian talks at the Belarusian border yielded no breakthroughs.",
    "“[R]eal economic challenges remain for families,” the statement reads.",
    "It’s not too late to meet this moment.” Read the full letter here\n3.",
    "FIRST IN PLAYBOOK — James Nash is joining Rokk Solutions as an SVP.",
    "… Caleb Gibson is joining West Wing Writers as a senior director.",
    "It won’t all be a lesson in international relations, however.",
    "— 9 p.m.: Biden will deliver the State of the Union address.",
    "The law would have codified abortion rights in federal law.",
    "… Reps. Warren Davidson (R-Ohio) and Trent Kelly (R-Miss.)",
    "Some lawmakers in Arkansas want to boycott Russian goods.",
    "It was the same spot as their first date two years ago.",
    "SPOTTED: Bill Barr having lunch at the Palm on Monday.",
    "That’s not the only challenge awaiting Biden tonight.",
    "“Just the right amount of crazy.” (h/t Josh Dawsey).",
    "New York will no longer do business with Russia.",
    "Send Playbookers tips to playbook@politico.com.",
    "The Gazette has more on her back story here\n2.",
    "Read this glowing NYT review by Min Jin Lee.",
    "HAPPY BIRTHDAY: Sen. Deb Fischer (R-Neb.)",
    "Here are three more dynamics to watch:\n1.",
    "Other states are banning Russian booze.",
    "In the Republican response, Iowa Gov.",
    "THE HOUSE will meet at 10 a.m.",
    "— Peace talks are failing.",
    "“Have no illusions.",
    "John Breaux (D-La.)",
    "THE SENATE is in.",
    "Sign up here."
  ]
}