{
  "id": 4307,
  "mediaId": 2537,
  "date": "2022-02-28",
  "headline": "New Ohio River bridge next to Brent Spence won't require tolls, governors of Ohio and Kentucky say",
  "image": "https://www.gannett-cdn.com/presto/2022/02/28/PCIN/b557273f-0680-493a-92a0-28108967077b-022822_BRIDGE_1293.jpg?crop=4650,2616,x0,y0&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/news/2022/02/28/brent-spence-bridge-ohio-kentucky-to-seek-2-b-for-new-bridge-over-ohio-river/6972104001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rachel Berry",
  "authorUrl": "https://www.cincinnati.com/staff/5524867002/rachel-berry/",
  "termIds": [
    0
  ],
  "sentences": [
    "Both senators are Republicans\nThe bill passed the House on a largely party-line vote; all the Greater Cincinnati Republicans including Southwest Ohio's Reps. Steve Chabot, Brad Wenstrup, Warren Davidson and Northern Kentucky's Thomas Massie voted against it.",
    "Improvements to the existing bridge and building a new companion bridge would add much-needed capacity by separating local and through traffic to ease the ongoing traffic backups and accidents.",
    "In the 1990s, the Federal Highway Administration declared the Brent Spence functionally obsolete because its narrow lanes carried more cars than it was designed for – with no emergency lane.",
    "The application for funding is expected to be submitted within the next few months and a final decision on the funding could happen in the fall of 2023, officials said.",
    "A semi-truck hauling potassium hydroxide crashed into a jackknifed truck on the Brent Spence in November 2020, causing a fire that shut down the bridge for weeks.",
    "Andy Beshear announced plans to apply for two federal grants totaling up to $2 billion to fund a new bridge to carry Interstates 71 and 75 over the Ohio River.",
    "Interstate 75 is a key freight corridor reaching from Canada to Florida, so officials said slowdowns affect commerce throughout the eastern United States.",
    "Transportation officials estimated construction of the companion bridge and improvements to the Brent Spence would take about five years to complete.",
    "COVINGTON, Ky. – The Brent Spence Bridge between Ohio and Kentucky could finally be getting its companion bridge – and it won't require new tolls.",
    "The bill provides multiple grant opportunities that the bridge project would qualify for, including at least $39 billion specifically for bridges.",
    "Both states will apply for the grants together once the U.S. Department of Transportation releases guidance on the application process.",
    "The infrastructure bill, which President Joe Biden signed into law in November, provided new hope for funding the bridge.",
    "\"We believe that there is no bridge in this country that is as necessary and in needing of a change,'' DeWine said.",
    "The Brent Spence was built in 1963 to handle 80,000 vehicles a day, but is now used by double that number.",
    "\"I want to be able to break ground next year,'' said Beshear, a Democrat, during the news conference.",
    "The total cost of the new bridge would be about $2.8 billion, according to DeWine, a Republican.",
    "In a press release, Brown said he wrote the Bridge Investment Act with the Brent Spence in mind.",
    "Portman was one of the main Republicans who helped negotiate and pass the infrastructure bill.",
    "Former Presidents Barack Obama and Donald Trump were unable to secure funding for the project.",
    "Kentucky and Ohio will contribute whatever funds aren't covered by the federal government.",
    "And in 2021, the bridge was ranked as the nation's second-worst for traffic bottlenecks.",
    "Minority Leader Mitch McConnell voted for the bill, and Sen. Rand Paul voted against it.",
    "This act provides $12.5 billion in grant funding to repair or replace outdated bridges.",
    "One of these grant programs is the Bridge Investment Act, sponsored by U.S. Sens.",
    "Northern Kentucky reporter Rachel Berry can be reached at rberry@enquirer.com.",
    "Governors DeWine and Beshear said it's unclear exactly when that may be.",
    "Beshear and DeWine said the new bridge would be built without tolls.",
    "For years, everyone agreed a new bridge was needed.",
    "Sherrod Brown and Rob Portman of Ohio.",
    "At a news conference Monday, Ohio Gov.",
    "Follow her on Twitter @racheldberry.",
    "Mike DeWine and Kentucky Gov.",
    "In Kentucky, Sen."
  ]
}