{
  "id": 4512,
  "mediaId": 2570,
  "date": "2022-03-01",
  "headline": "Bitcoin Demonstrates Its Intrinsic Value To The World",
  "image": "",
  "link": "https://www.forbes.com/sites/rufaskamau/2022/03/01/bitcoin-reveals-its-intrinsic-value-to-the-rest-of-the-world/?sh=6a13c1207747",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rufas Kamau",
  "authorUrl": "https://www.forbes.com/sites/rufaskamau/",
  "termIds": [
    0
  ],
  "sentences": [
    "As a result of the events in Canada, Warren Davidson (R-Ohio), a U.S. congressman, has pushed a “Keep your coins” act to prevent the government and government agencies from ever limiting an individual’s ability to buy and sell cryptocurrencies for their own purposes through a self-hosted wallet.",
    "In Ukraine, Russia, Canada, and Turkey, the people who have turned to Bitcoin as a solution to their differing problems have come to understand the intrinsic value of the cryptocurrency and others and their unique circumstances may be a significant milestone in the Bitcoin adoption story.",
    "Even though an Ontario Superior Court has issued an order to freeze the donations making it difficult for the protestors to convert the Bitcoin to cash through banks and exchanges, the freedom and level of utility provided by Bitcoin has been well demonstrated.",
    "Even though Turkey is considering limiting the Bitcoin/Turkish Lira trades to avoid capital flight, the citizens who bought a significant exposure in Bitcoin have enjoyed an umbrella of safety from the fragile Lira, according to crypto news site, CoinDesk.",
    "Even though the Central Bank of Russia hurriedly hiked interest rates from 9.5% to 20% to control the runaway inflation, Russians could be seen queueing at cashpoints to withdraw money so they can spend it to avoid losing more value.",
    "After GoFundMe froze over $7.9 million worth of donations to the Freedom Convoy protestors in Canada, the truck drivers had to resort to censor-resistant Bitcoin and other cryptocurrencies to receive donations.",
    "For the Ukrainians who had family, friends, and well-wishers send them money via a bank, they often could not access it in time and had to resort to the Bitcoin network for transfers.",
    "On the other side, in Russia, the resulting sanctions from the Western world led to a massive increase in Russian Ruble supply which saw the Ruble collapse over 27% on Monday.",
    "This means that the only way for Ukrainians to buy food and afford travel was through the cash at hand and the lucky few who had a stash of Bitcoin in their wallets.",
    "The Ukrainian government has received over $24.6 million in crypto donations from over 26,000 donors, according to blockchain analytics firm, Elliptic.",
    "Upon learning the news of the war in Ukraine, many Ukrainians ran in fear to the closest Polish border leaving behind any belongings and pets.",
    "In recent global events, Bitcoin has continually shown its value by providing ready solutions to different people facing different challenges.",
    "This varies from the Freedom Convoy receiving donations in Canada to the Ukrainian refugees crossing to Poland to flee the Russian invasion.",
    "The Lira has lost over 40% against the dollar in the last 12 months and the Turkish people have turned to Bitcoin as a store of value.",
    "This is evidence of the utility offered by Bitcoin and other cryptocurrency projects to solve individual and statewide challenges.",
    "Rising fuel prices have mounted further pressure on the Turkish Lira which is currently undergoing a full-blown crisis.",
    "Russian savers panic sold the Ruble and bought foreign currencies that had a better store of value.",
    "In the midst of the panic exit, banks closed down and ATM machines ran out of cash.",
    "This resulted in higher demand for Bitcoin and the U.S. dollar.",
    "Disclosure: I own bitcoin and other cryptocurrencies."
  ]
}