{
  "id": 5156,
  "mediaId": 2553,
  "date": "2022-02-23",
  "headline": "43 Republican, Democrat House Members Demand Biden Seek Approval Before Sending U.S. Troops To Ukraine",
  "image": "https://dw-wp-production.imgix.net/2022/02/9BDBC78A-F34C-46E1-8AB7-045CABA198FF-scaled.jpeg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/43-republican-democrat-house-members-demand-biden-seek-approval-before-sending-u-s-troops-to-ukraine",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Rigolizzo",
  "authorUrl": "https://www.dailywire.com/author/john-rigolizzo",
  "termIds": [
    0
  ],
  "sentences": [
    "“This crossover was intentionally written by the framers of the U.S. Constitution so Congress and the President would be required to cooperate on our nation’s military affairs.” In addition, the members argued, the War Powers Resolution of 1973, passed in the aftermath of the Vietnam War and after years of “unauthorized involvement by U.S. Armed Forces” in conflicts, reinforced the need for cooperation between the president and Congress by ensuring that “‘the collective judgment of both the Congress and the President’ would be utilized before the ‘introduction of United States Armed Forces into hostilities, or into situations where imminent involvement in hostilities is clearly indicated by the circumstances.’”\n“Our nation’s laws are highly relevant to the ongoing situation in Ukraine,” the members continued.",
    "“Were an attack by Russia to be imminent or underway, the War Powers Resolution would clearly require congressional authorization before the President may command U.S. Armed Forces to engage in hostilities.” The members stressed that the guidelines would not require Congressional approval for American forces to play an advisory role, citing the administration’s recent withdrawal of 160 Florida National Guardsmen who had been training Ukranian soldiers.",
    "However, they stressed that “an imminent or active attack by Russia would compel you, under Section 8(c) of the War Powers Resolution, to seek specific Congressional authorization if you aim to leave any remaining U.S. advisers, trainers, special forces, or other U.S. military personnel in areas of these imminent or active hostilities.” They also reminded Biden that he must get the same approval in order to launch a preemptive strike against Russia.",
    "Therefore, we ask that your decisions comport with the Constitution and our nation’s laws by consulting with Congress to receive authorization before any such deployment.”\nThe letter specifically mentioned the Constitutional conflict between Congress’ power to declare war under Article I of the Constitution with the president’s authority as commander-in-chief of the armed forces under Article II.",
    "Notable co-signers included Texas Republican Rep. Louie Gohmert, Arizona Republican Reps. Andy Biggs and Paul Gosar, Kentucky Republican Thomas Massie, Florida Republican Matt Gaetz, and Progressive Democratic “Squad” members Reps. Alexandria Ocasio-Cortez, Ilhan Omar, Rashida Tlaib, Ayanna Pressley, and Cori Bush.",
    "“To date, you have rejected calls to station U.S. Armed Forces in Ukraine, stating that such an effort is ‘not on the table.’ However, if the ongoing situation compels you to introduce the brave men and women of our military into Ukraine, their lives would inherently be put at risk if Russia chooses to invade.",
    "The letter, written by Democratic Oregon Representative Peter DeFazio and Republican Ohio Representative Warren Davidson, demanded that Biden defer to the War Powers Resolution of 1973 and get approval from Congress before engaging U.S. troops in hostilities between the two nations.",
    "“As you evaluate your possible course of action to address the potential conflict between Russia and Ukraine, we write to reassert the war powers vested in Congress under the U.S. Constitution and the War Powers Resolution of 1973,” the letter reads.",
    "But until that time, “[t]he American people, through their representatives in Congress, deserve to have a say before U.S. troops are placed in harm’s way or the U.S. becomes involved in yet another foreign conflict,” the members concluded.",
    "“We strongly urge your administration to respect the separation of powers, U.S. law, and Congress’s constitutional war powers authority,” the members said, adding that Congress “stands ready” to debate the implications of a war posture.",
    "A bipartisan group of 43 members of Congress have issued a letter to President Joe Biden demanding that he seek Congressional approval before deploying troops to Ukraine in the event of an escalation between Ukraine and Russia.",
    "The letter was signed by 43 members of the House of Representatives from both parties and across the ideological spectrum.",
    "The Daily Wire is building an alternative to the leftist entertainment industry, one gripping movie at a time.",
    "The Daily Wire’s first original film, Shut In, has made its cinematic debut, being met with rave reviews.",
    "Join us in this mission and stream Shut In today by becoming a Daily Wire member."
  ]
}