{
  "id": 5376,
  "mediaId": 2684,
  "date": "2022-02-22",
  "headline": "US Lawmakers Urge Biden to Get Congressional Approval Before Involving Troops in Ukraine Crisis",
  "image": "https://cdnn1.img.sputniknews.com/images/sharing/article/eng/1093288106.jpg?10823880131645589550",
  "link": "https://sputniknews.com/20220223/us-lawmakers-urge-biden-to-get-congressional-approval-before-involving-troops-in-ukraine-crisis-1093288106.html",
  "mediaOutlet": "sputniknews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Evan Craighead",
  "authorUrl": "",
  "termIds": [
    2395,
    2430,
    2805,
    3975,
    4968,
    5088,
    5095,
    5366,
    5371
  ],
  "sentences": [
    "The latest movement of US troops already... 23.02.2022, Sputnik International\nhttps://cdnn1.img.sputniknews.com/img/07e5/03/13/1082388015_0:160:3073:1888_1920x0_80_0_0_064ebe750d4b2c5a7402b2720996687b.jpg.webp\nA bipartisan group of lawmakers issued a memo on Tuesday to US President Joe Biden reminding the commander-in-chief that he had previously pledged to not send US troops into Ukraine, although he said the decision could change.Reps.",
    "\"Today, in response to Russia's admission that it will not withdraw its forces from Belarus, I have authorized additional movements of US forces and equipment already stationed in Europe to strengthen our Baltic allies, Estonia, Latvia and Lithuania,\" Biden said earlier Tuesday, amid Western assertions that Russian President Vladimir Putin would carry out a large-scale attack on Ukraine.",
    "Nancy Mace (R-SC), Alexandria Ocasio-Cortez (D-NY), Cori Bush (D- MO) Pramila Jayapal (D-WA), Ilhan Omar (D-MN), Matt Gaetz (R-FL) and Warren Davidson (R-OH) are among the 43 lawmaker-signees.",
    "Per the reported order issued by US Defense Secretary Lloyd Austin, 800 US troops and 20 Boeing AH-64 Apache choppers already in Europe were to be moved to the Baltic region.",
    "At the moment, Biden has ruled out deploying US troops to Ukraine, although he has ordered some US forces to be repositioned to NATO's eastern flank.",
    "On Tuesday, US President Joe Biden announced the movement of US troops and equipment to Estonia, Latvia and Lithuania.",
    "Biden noted that Washington would continue to provide defensive assistance to Kiev.",
    "Ukraine is not a NATO member."
  ]
}