{
  "id": 5419,
  "mediaId": 2674,
  "date": "2022-02-18",
  "headline": "US launches crackdown on illicit crypto",
  "image": "https://cdni.russiatoday.com/files/2022.02/article/620fa94f20302734b63aa706.jpg",
  "link": "https://www.rt.com/news/549881-fbi-cryptocurrency-crimes-unit/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "mediaOutlet": "Russia Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1272,
    2395,
    2922,
    4267,
    370,
    656,
    668,
    4985,
    5371
  ],
  "sentences": [
    "The move was met with some backlash in the US, with Republican Rep. Marjorie Taylor Greene (Georgia) demanding the government “Protect crypto currency owner’s rights,” and Rep. Warren Davidson (R-Ohio) introducing a ‘Keep Your Coins Act’ that would forbid any government agency from restricting cryptocurrency transactions, and protect the rights of Americans to hold their own crypto wallets independent from financial institutions.",
    "Monaco told her audience in Munich that prosecutors and investigators will use “all available tools” to disrupt cyberattacks before they happen, and the DOJ stated that it will “coordinate with domestic and international law enforcement partners, regulatory agencies and private industry to combat the criminal use of digital assets.”\nWhat counts as criminal use varies between jurisdictions, however.",
    "“We are issuing a clear warning to criminals who use cryptocurrency to fuel their schemes.”\nThe unit will work alongside the Justice Department’s National Cryptocurrency Enforcement Team (NCET), a group of around a dozen prosecutors set up by Monaco last year after a series of devastating ransomware attacks on US infrastructure.",
    "Although ransomware attacks and money laundering are cited by the DOJ as typical crimes enabled by cryptocurrency, the Canadian government recently cracked down on the organizers of a political protest, passing emergency powers enabling the seizure of their cryptocurrency wallets.",
    "Deputy Attorney General Lisa Monaco, who also named prosecutor Eun Young Choi as the first director of the National Cryptocurrency Enforcement Team (NCET), said that the new unit would dedicate itself to analyzing virtual transactions and seizing currency involved in crime.",
    "The NCET’s newly announced director Eun Young Choi, described by the DOJ as a “seasoned prosecutor,” has experience investigating and prosecuting cyber and money laundering crimes in New York, and led the government’s case against ‘Silk Road’ founder Ross Ulbricht.",
    "The suspects behind one attack on an oil pipeline network demanded payment in bitcoin to the value of around $4.4 million, which the company paid and the DOJ later claimed it partially recovered.",
    "Ulbricht was sentenced to a double life sentence in prison for creating the notorious online marketplace, but activists argue that he committed no actual crimes.",
    "“This FBI unit will combine cryptocurrency experts into one nerve center,” Monaco said during a speech at the Munich Security Conference in Germany on Thursday.",
    "The US Department of Justice (DOJ) announced on Thursday the creation of the FBI’s ‘Virtual Asset Exploitation Unit’.",
    "Both the new FBI unit and the NCET have a broad remit to investigate any crypto-related crimes."
  ]
}