{
  "id": 5434,
  "mediaId": 2735,
  "date": "2022-02-23",
  "headline": "Lawmakers Warn Biden He Can’t Unilaterally Send US Troops to Fight Russia",
  "image": "https://truthout.org/wp-content/uploads/2022/02/2022_0223-soldiers-hangar-1200x675.jpg",
  "link": "https://truthout.org/articles/lawmakers-warn-biden-he-cant-unilaterally-send-us-troops-to-fight-russia/",
  "mediaOutlet": "Truthout",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Johnson",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“Regardless of one’s view on how the U.S. should respond to tensions over Ukraine, these are precisely the critical questions that the framers of our Constitution sought to entrust to the American people through their representatives in Congress.”\nCavan Kharrazian, a foreign policy campaigner for Demand Progress added that “by no means should the president put American troops — including embedded military advisors and special forces — into harm’s way in Ukraine without a debate and vote in Congress.”\n“While Congress remains divided on many issues,” Kharrazian added, “we are glad to see such a diverse range of representatives defending our constitutional system of checks and balances when it comes to war.”\nBefore you go — please read the important update below\nFor the last two decades, millions of readers have relied on Truthout to provide accurate, transparent journalism through moments of political and social crisis.",
    "“Were an attack by Russia to be imminent or underway, the War Powers Resolution would clearly require congressional authorization before the president may command U.S. Armed Forces to engage in hostilities.”\nSigned by an ideologically diverse cohort of lawmakers spanning from right-wing Rep. Louie Gohmert (R-Texas) to progressive Rep. Alexandria Ocasio-Cortez (D-N.Y.), the letter was delivered after Biden announced new economic sanctions against Russia and said he “authorized additional movements of U.S. forces and equipment already stationed in Europe to strengthen our Baltic allies.”\nUncompromised, uncompromising news\nGet reliable, independent news and commentary delivered to your inbox every day.",
    "Should your administration seek to introduce U.S. Armed Forces into hostilities or decline to remove any U.S. military personnel currently deployed inside Ukraine from unauthorized hostilities or imminent hostilities, Congress stands ready to deliberate over the potentially monumental implications of such scenarios.”\n“The American people, through their representatives in Congress, deserve to have a say before U.S. troops are placed in harm’s way or the U.S. becomes involved in yet another foreign conflict,” the lawmakers added.",
    "“I’m calling on President Biden to ignore the warmongers and receive authorization from Congress — as required by the Constitution and U.S. law — before even considering any involvement by the U.S. military in a conflict between Russia and Ukraine.”\nNearly a dozen advocacy groups — including the progressive anti-war organizations Just Foreign Policy, Peace Action, and Demand Progress — endorsed DeFazio’s message, hailing it as a “timely” and “level-headed” intervention amid loudening drumbeats of war.",
    "“We have no intention of fighting Russia.”\nBut no matter the president’s stated intentions, the lawmakers argued in their letter that he must “seek specific congressional authorization” in order to “leave any remaining U.S. advisers, trainers, special forces, or other U.S. military personnel in areas of these imminent or active hostilities.”\n“You must also receive congressional approval before initiating any preemptive strike,” they wrote.",
    "A bipartisan group of lawmakers and a coalition of anti-war groups reminded President Joe Biden on Tuesday that he is legally required to seek authorization from Congress before involving U.S. troops in any military conflict with Russia, which began moving forces of its own into eastern Ukraine earlier this week.",
    "“Even allowing U.S. advisers and special forces to remain in harm’s way in Ukraine without authorization creates the potential for direct conflict between the world’s leading nuclear powers,” Erik Sperling, executive director of Just Foreign Policy, said in a statement Tuesday.",
    "With congressional Republicans and hawkish Democrats clamoring for Biden to respond more forcefully to Russia’s latest aggressive actions in Ukraine, DeFazio told Politico on Tuesday that the president should instead show restraint and consult with Congress.",
    "“Our nation’s laws are highly relevant to the ongoing situation in Ukraine,” 43 U.S. House members led by Reps. Peter DeFazio (D-Ore.) and Warren Davidson (R-Ohio) wrote in a letter to the White House on Tuesday.",
    "pic.twitter.com/0RJKEi1k9u\n— Rep Peter DeFazio (@RepPeterDeFazio) February 22, 2022\nThe letter came as the situation on the ground in Ukraine continued to deteriorate and fears of an all-out war mounted.",
    "“Let me be clear: These are totally defensive moves on our part,” added Biden, who has approved the deployment of thousands of U.S. troops to Eastern Europe in recent weeks.",
    "On Wednesday, Ukraine began preparations to impose a nationwide state of emergency and instructed its citizens to leave Russia, warning of a broader invasion.",
    "I’m urging Pres Biden to follow the Constitution and the law and receive authorization from Congress before involving US forces in Russia-Ukraine conflict.",
    "Over the last year, we’ve struggled to meet our basic operating costs, as Facebook and Google have reduced the visibility of non-corporate news stories.",
    "“We strongly urge your administration to respect the separation of powers, U.S. law, and Congress’ constitutional war powers authority.",
    "“Americans are fed up with risking U.S. troops’ lives and spending taxpayer dollars on endless overseas wars,” said DeFazio.",
    "As a result, our stories are being seen by fewer people at a time when trustworthy journalism is so desperately needed.",
    "We’re working hard to mitigate these issues but we still have an immediate need for your help, especially right now.",
    "We’ve been proud to remain donor-supported — not once accepting money from advertisers or corporate funders.",
    "The American people deserve to have a say before we become involved in yet another foreign conflict.",
    "Whether you’re able to make a $5 monthly donation, or give more — we need you, today.",
    "We have just 6 days left in our fundraiser and still need to raise $37,000.",
    "Any amount of support you can spare right now will go a very long way.",
    "Please, do what you can to help us get through this trying time.",
    "But now, we face an existential threat to our survival.",
    "Donate Now"
  ]
}