{
  "id": 6306,
  "mediaId": 5308,
  "date": "2022-02-09",
  "headline": "After a series of recent crypto hacks, companies are stepping in and bailing out protocols and users.",
  "image": "https://video-images.vice.com/articles/6202e6e0d7f5c90094b85206/lede/1644358002375-gettyimages-1320843107.jpeg?image-resize-opts=Y3JvcD0xeHc6MC44NDQyMTQ4NzYwMzMwNTc5eGg7Y2VudGVyLGNlbnRlciZyZXNpemU9MTIwMDoqJnJlc2l6ZT0xMjAwOio",
  "link": "https://www.vice.com/en/article/g5qwky/corporate-bailouts-are-coming-to-crypto",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Edward Ongweso Jr",
  "authorUrl": "https://www.vice.com/en/contributor/edward-ongweso-jr",
  "termIds": [
    0
  ],
  "sentences": [
    "CryptoSec, a crypto cybersecurity resource, has tracked some 75 hacks tracking crypto’s decentralized finance (DeFi) ecosystem which have stolen $1.7 billion since 2020-about $816 million of that was stolen between August and December of 2021, a figure that doesn't even include hacks in 2022 that have amounted to hundreds of millions of dollars worth of stolen cryptocurrency so far.",
    "Besides hacks, the volatility of crypto and digital assets such as NFTs, as well as the prevalence of scams in the DeFi space (one study found 50 percent of all tokens on major decentralized exchange UniSwap are scams) can and do make quick work of anyone who is not lucky or an early adopter of a coin.",
    "That a few well-placed interventions can keep the money flowing is not something for an industry to stake its future on, and raises concerns about the risks to investors who, according to a recent NORC study, are less white, less educated, less wealthy than those who buy typical investment vehicles.",
    "The Wormhole attack would've likely caused issues for Solana (the other blockchain involved in the hack) and its own DeFi ecosystem if not for the intervention of parent company Jump Trading which simply replenished the $320 million worth of ETH reserves, Coindesk reported.",
    "Just last week, we saw one of the largest hacks in crypto history when hackers stole 120,000 ETH from Wormhole-a “bridge” that takes one blockchain’s tokens, locks them into a smart contract, and then mints the equivalent value of tokens on another chain.",
    "For a space that prides itself on offering decentralized market-based solutions to traditional finance and governance, there is seemingly a propensity to relying on the tried-and-true solution of systems past: having someone else pay for it.",
    "Given the deep pockets of everyone involved except retail investors, expect some bailouts to continue to keep up appearances and rationalizations that this in no way undermines the logic of self-sovereignty or decentralization.",
    "While this may seem like no big deal, it raises questions about whether crypto's ascendence now requires investors to side with large companies to feel safe, arguably undercutting the technology's entire reason for being.",
    "Even crypto advocates like Ohio Rep. Warren Davidson are sounding the alarm over risk in the space-in a conversation with The Block, Davidson said he considered Tether (the third-largest cryptocurrency) a “time bomb”.",
    "But now, crypto's users aren't chiefly cypherpunks playing around with a weird toy; they're just average people investing in something they heard about from Matt Damon or Jimmy Fallon, and they want customer service.",
    "There is perhaps no greater, more singular example of the potential for systemic risk in crypto than Tether-a “stablecoin” which is pegged to the U.S. dollar and helps facilitate transactions of various tokens.",
    "As Jacob Silverman writes in The New Republic, the stablecoin that sits at the heart of the crypto-economy also sits at the center of multiple inquiries, investigations, and lawsuits regarding its backing.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "The idea of a \"bailout\" is rather foreign in this world, and the first block of Bitcoin transaction data even included a message from its anonymous creator referencing the 2008 bank bailouts.",
    "Late in January, a hack targeting Crypto.com, one of the largest cryptocurrency exchanges in the world, stole 4,836.26 ETH and 443.93 BTC from 483 users' wallets (about $30 million).",
    "\"Code is law\" is a phrase that's long been thrown around in crypto circles, and that includes lawlessness and thievery; \"not your keys, not your coins\" is another common refrain.",
    "OpenSea, the world’s largest NFT marketplace, has slowly become more active in freezing NFTs that are stolen or bought through exploits that substantially reduce their price.",
    "It's also an open question as to how much capital companies might be willing to blow through in order to backstop a hack, and when the taps might get turned off.",
    "On some level, the rise of bailouts and interventions among crypto exchanges, markets, and currencies illustrates just how delicate things are and always were.",
    "The company maintained that \"no customers experienced a loss of funds\" because they \"fully reimbursed\" customers whose wallets were successfully targeted.",
    "But recently, with the emergence of DeFi and institutional money entering the space, something has changed: Crypto is getting corporate bailouts.",
    "While Tether once claimed that every token was backed with one U.S. dollar held in reserve, that story has changed significantly over time.",
    "Typically, hacks in crypto screw over exchanges, projects, and users-especially in attacks targeting specific wallets-and that’s that.",
    "Over the past year, hacks targeting crypto holders, protocols, and exchanges have grown increasingly ambitious and regular.",
    "As the world agonizes over whether there is a greater purpose for crypto, hackers seem to have found one: stealing it.",
    "Bailouts aren’t the only centralized solutions being deployed by the prophets of decentralization as of late.",
    "That's not the only recent example of a corporate bailout in crypto."
  ]
}