{
  "id": 6470,
  "mediaId": 2590,
  "date": "2022-01-12",
  "headline": "Yet Another GOP Lawmaker Compares Vaccine Mandates To The Holocaust",
  "image": "https://img.huffingtonpost.com/asset/61df56ad26000008e73d2877.jpeg?cache=uHTGRaWP5g&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/warren-davidson-vaccines-holocaust_n_61df4f25e4b0ae44b31b1978",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josephine Harvey",
  "authorUrl": "",
  "termIds": [
    1440,
    2395,
    4384,
    99,
    878,
    1153,
    5390
  ],
  "sentences": [
    "The Auschwitz Memorial said it was a “sad symptom of moral and intellectual decay” to exploit the tragedy of people who were “humiliated, tortured and murdered by the totalitarian regime of Nazi Germany in a debate and vaccines and covid limitations in the time of a global pandemic.”\nAdvertisement\n“It’s never appropriate to compare requirements for public health with the tactics of Nazi Germany,” the Anti-Defamation League tweeted.",
    "pic.twitter.com/rGlPyeKQCO\n— ADL (@ADL) January 12, 2022\nLast year, extremist Rep. Marjorie Taylor Greene (R-Ga.) was called out by dozens of Holocaust survivors after she repeatedly drew similar comparisons between public health orders intended to keep people safe and the Holocaust.",
    "Davidson drew the link by retweeting a post from Washington, D.C., Mayor Muriel Bowser about a new policy requiring residents to carry proof of vaccination should they wish to enter certain indoor establishments for food and drink, entertainment or exercise.",
    "Rep. Madison Cawthorn (R-N.C.) said last year that vaccine passports “smack of Nazi Germany.” Rep. Scott Perry (R-Pa.) compared criticism of anti-lockdown advocates and backlash against Donald Trump’s promotion of hydroxychloroquine to Nazi book burnings.",
    "She later apologized, saying she had learned more about the genocide while visiting the Holocaust Museum in Washington, D.C. Several weeks later, she made another Holocaust reference while criticizing federal efforts to get more Americans vaccinated.",
    "“As we’ve said too many times to count, minimizing the Holocaust in this way is deeply offensive and harmful.”\nIt's never appropriate to compare requirements for public health with the tactics of Nazi Germany.",
    "Rep. Warren Davidson (R-Ohio) on Wednesday joined the growing number of elected Republicans who have compared COVID-19 vaccine mandates to the horrors imposed on Jewish people by Nazis during the Holocaust.",
    "Advertisement\nNumerous 2022 Republican House candidates, Republican members of state legislatures and conservative media personalities have also invoked Nazi Germany in criticizing mask and vaccine rules.",
    "#DoNotComply.”\nHe then suggested that unvaccinated people are being “dehumanized” and segregated as Jewish people were before they were forced into labor and murdered en masse.",
    "Advertisement\nIn his retweet, the lawmaker shared a photo of a health pass that people under Nazi rule were forced to carry, adding, “this has been done before.",
    "As we've said too many times to count, minimizing the Holocaust in this way is deeply offensive and harmful.",
    "Several prominent Jewish organizations condemned the statement."
  ]
}