{
  "id": 6504,
  "mediaId": 2621,
  "date": "2022-01-29",
  "headline": "CNN’s Pamela Brown Scorns Comparisons Between Covid Requirements and Nazi Germany: ‘Not In the Same Universe Whatsoever as Public Health Measures’",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/01/Screen-Shot-2022-01-29-at-8.17.15-PM.png",
  "link": "https://www.mediaite.com/tv/cnns-pamela-brown-scorns-comparisons-between-covid-requirements-and-nazi-germany-not-in-the-same-universe-whatsoever-as-public-health-measures/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Huggins",
  "authorUrl": "https://www.mediaite.com/author/katherine-huggins/",
  "termIds": [
    1475,
    1768,
    2395,
    2879,
    234,
    4985,
    5174
  ],
  "sentences": [
    "Subscribe to\nCNN anchor Pamela Brown strongly rebuked Republican lawmakers and public figures who have compared Covid masking and vaccine requirements to the Holocaust, noting that “the deaths of 6 million Jews should not be a punchline or a way to rally supporters.”\n“For the record, it is profoundly disrespectful to the memories of survivors and the suffering of those who were killed to equate the Holocaust to anything,” Brown said on Saturday, noting that it was International Holocaust Remembrance Day earlier this week.",
    "“The deaths of 6 million Jews should not be a punchline or a way to rally supporters.”\nBrown later added that “if they want to bring up the Holocaust, maybe it should be the fight to keep books about it in school curriculums,” a reference to a recent decision by a Tennessee school district to ban the book “Maus,” a Pulitzer Prize winning graphic novel about the Holocaust.",
    "She began by noting Robert F. Kennedy Jr.‘s assertion that Covid vaccine requirements are a sign of “turnkey totalitarianism” and that “even in Hitler’s Germany, you could cross the Alps into Switzerland, you could hide in an attic like Anne Frank did.”\nKennedy’s remark was met with swift backlash and he later issued an apology.",
    "In a separate tweet Davidson wrote: “Let’s recall that the Nazis dehumanized Jewish people before segregating them, segregated them before imprisoning them, imprisoned them before enslaving them, and enslaved them before massacring them.”\nHe apologized for his comments a day later.",
    "The other examples included by Brown were Rep. Lauren Boebert (R-CO) calling people involved in a door-to-door campaign boost vaccination “Needle Nazis,” and Rep. Marjorie Taylor Greene (R-GA) referencing the Holocaust on several occasions when criticizing Covid mandates.",
    "“But that does not stop mostly Republican lawmakers and public figures from trying to compare what is going on right now to this horrible time in human history.”\nBrown then listed examples of opponents of Covid vaccine and masking requirements invoking the Holocaust.",
    "“The Holocaust should not be used to make political points.”\n“The systematic targeting and genocide of Jewish people is not in the same universe whatsoever as public health measures intended to keep people safe during a pandemic,” she continued.",
    "“In fact, we did a cursory look and found at least 32 examples from lawmakers using Holocaust comparisons just in the last two years since the beginning of the pandemic,” Brown said.",
    "“Maybe our time is better spent reading books about the history of the Holocaust instead of making insensitive, outrageous, and ahistorical comparisons to it,” Brown said.",
    "After going through those examples, Brown noted that these are just a few of the instances of public figures making Holocaust comparisons.",
    "#DoNotComply” in response to Washington, D.C. beginning to require proof of vaccination for adults entering many businesses in the city.",
    "Brown then cited Rep. Warren Davidson (R-OH), who tweeted an image of a Nazi document with the caption, “This has been done before.",
    "(Greene apologized for comparing the House floor mask mandate to Nazi Germany).",
    "Watch above, via CNN\nHave a tip we should know?",
    "367 comments\nWant to avoid video ads?",
    "tips@mediaite.com"
  ]
}