{
  "id": 6740,
  "mediaId": 2590,
  "date": "2022-01-18",
  "headline": "They Rejected Democracy. They Lied. Now The GOP Is Hailing Martin Luther King's Legacy.",
  "image": "https://img.huffingtonpost.com/asset/61e6ed12260000d9f43d30bc.jpeg?cache=e69jJP3shs&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/republicans-overturn-election-insurrection-martin-luther-king-jr-day-tweets_n_61e6eb9fe4b0c6802eec6d98",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Bendery",
  "authorUrl": "",
  "termIds": [
    1268,
    2296,
    2923,
    3118,
    3671,
    3734,
    305,
    878,
    5371
  ],
  "sentences": [
    "As Sen. Raphael Warnock (D-Ga.) told reporters Tuesday, “You cannot remember Martin Luther King Jr. and dismember his legacy at the same time.”\nHere are the names of these 147 Republicans alongside their MLK Day messages hailing King’s efforts to make America “a more perfect union.” Amid the countless images of King’s face and passages from some of his most powerful quotes, none of these lawmakers mention that it’s barely been a year since they voted to reject a democratically elected president and spread a deadly lie to justify doing so.",
    "- “Today, when some are once again trying to divide us based on identity, we must remember the wise words of Dr. Martin Luther King, Jr.”\nToday, when some are once again trying to divide us based on identity, we must remember the wise words of Dr. Martin Luther King, Jr.: “Not by the color of their skin, but by the content of their character.” pic.twitter.com/BFyvVnxLVd\n— Rep. Andy Harris, MD (@RepAndyHarrisMD) January 17, 2022\n68.",
    "They’d rather that you think of them as having the same ideals of an American hero, Martin Luther King Jr.\nAdvertisement\nHuffPost reviewed all of these Republicans’ social media accounts on Tuesday, a day after MLK Day was observed nationally, and found nearly all of them associating themselves with King’s legacy of peace, justice and sacrifice for the greater good - the complete opposite of what they did on Jan. 6, 2021.",
    "Scott Fitzgerald (Wis.) - “His courage and tireless work to make our nation a more perfect union has defined the values we hold as Americans to this day.”\nToday we celebrate the life and legacy of Dr. Martin Luther King Jr. His courage and tireless work to make our nation a more perfect union has defined the values we hold as Americans to this day.",
    "House GOP Conference Chair Elise Stefanik (N.Y.) - “Martin Luther King, Jr. inspired our nation to make great strides, and his honorable work to secure civil rights and equal opportunity for all Americans remains more important than ever.”\nToday we celebrate the life of Dr. King and remember what he courageously stood for.",
    "John Carter (Texas) - “Today we honor the legacy of Dr. Martin Luther King Jr. May we all strive to embody his passion for peace, justice, and kindness today, and everyday.”\nToday we honor the legacy of Dr. Martin Luther King Jr. May we all strive to embody his passion for peace, justice, and kindness today, and everyday.",
    "Jodey Arrington (Texas) - “In the face of persecution & hate, MLK took the road less traveled by using peace & non-violence to champion justice & civil rights for ALL Americans.”\nIt’s not just WHAT Dr. King achieved, but HOW he achieved it that gives him a special place among our great American leaders.",
    "Chris Jacobs (N.Y.) - “We must continue to live by his words and promote peace and freedom for every American.”\nToday we honor the incredible life and legacy of Martin Luther King Jr.\nHis work to end discrimination and promote equality for all Americans made our nation a more perfect union.",
    "House Minority Leader Kevin McCarthy (Calif.) - “His words and example inspire us today as we celebrate a great American on #MLKDay.”\nFrom the halls of Ebenezer Baptist Church to the steps of the Lincoln Memorial, #MLK spent his life spreading what he called \"the gospel of freedom.\"",
    "Lessons that emphasize ways to treat our peers and our neighbors with respect, despite our differences, in order to make a dream of a better, and more unified tomorrow possible.”\nOn this Martin Luther King Day, it is critical that we do not forget the many lessons he taught us.",
    "Mo Brooks (Ala.) - “‘The ultimate measure of a man is not where he stands in moments of comfort and convenience, but where he stands at times of challenge and controversy.’ - Martin Luther King”\n#MLKDay pic.twitter.com/sl01EKk1a4\n— Mo Brooks - Endorsed By President Trump ????",
    "Jay Obernolte (Calif.) - “On this #MLKDay, let us stand firm in his conviction that, in time, peace and love will prevail.”\nOur nation might sometimes seem divided, but leaders throughout our history like Martin Luther King Jr. have shared a vision for a better future.",
    "We live in a truly great nation thanks to pioneers like MLK.”\nToday we celebrate Martin Luther King, Jr., who ensured America live up to the “magnificent words of the Declaration of Independence” and deliver freedom to ALL Americans.",
    "William Timmons (S.C.) - “Today we honor the life and legacy of Dr. Martin Luther King, Jr.—his steadfast commitment to equality, his fight for freedom and justice, and his unwavering vision for a more perfect union.”\n137.",
    "He courageously called on his fellow Americans to “lift our nation from the quicksands of racial injustice to the solid rock of brotherhood.” We remember the sacrifices he made to secure liberty for every American.",
    "Just over a year ago, 147 Republican lawmakers tried to overturn the 2020 presidential election based on a lie about widespread voter fraud that, just hours earlier, had fueled a deadly attack on the U.S. Capitol.",
    "Barry Loudermilk (Ga.) - “‘The ultimate measure of a man is not where he stands in moments of comfort and convenience, but where he stands at times of challenge and controversy.’ - Dr. Martin Luther King Jr.”\n92.",
    "Rick Allen (Ga.) - “Today we celebrate the life and legacy of an outstanding Georgian, Dr. Martin Luther King Jr. #MLK was a man of deep faith with the profound conviction that God creates us all equal.”\n11.",
    "- “Mississippians and Americans come together to volunteer in a myriad of ways to work to make our nation more equitable in honor and memory of Dr. King and his invaluable contributions to our nation.”\n4.",
    "- “‘Even in the inevitable moments when all seems hopeless, men know that without hope they cannot really live, and in agonizing desperation they cry for the bread of hope.’ - Martin Luther King, Jr.”\n3.",
    "King’s vision for a nation—where we’re judged by the content of our character, not the color of our skin—set this country on a better path, and his impact on the world will not soon be forgotten.”\n15.",
    "Darrell Issa (Calif.) - “I have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin, but by the content of their character.”\n76.",
    "Doug LaMalfa (Calif.) - “In honor of the upcoming MLK Jr. Day, let our country come together as we fuse our celebration of civil rights in America with our passion for our beloved National Parks.”\n87.",
    "His biggest, most effective weapon was freedom of speech, which is clearly under attack as it was when he was tragically murdered.”\nAmerica is a more perfect union because of Dr. Martin Luther King.",
    "Beth Van Duyne (Texas) - “Today we celebrate Martin Luther King, Jr., who ensured America live up to the “magnificent words of the Declaration of Independence” and deliver freedom to ALL Americans.",
    "Tom Cole (Okla.) - “Today we remember the life & legacy of Martin Luther King Jr., whose courageous leadership during the civil rights movement will continue to inspire generations to come.”\n37.",
    "Andrew Clyde (Ga.) - “Today we honor the life and legacy of Dr. Martin Luther King Jr., a heroic leader and Civil Rights icon who fought to secure justice and equality for all Americans.”\n36.",
    "- “Today, we don’t only celebrate the dream of Dr. Martin Luther King Jr., we honor his life of sacrifice and dedication that led to America becoming a more perfect union.” (He retweeted.)",
    "Martin Luther King, Jr. inspired our nation to make great strides, and his honorable work to secure civil rights and equal opportunity for all Americans remains more important than ever.",
    "Greg Murphy (N.C.) - “Today we celebrate the life and legacy of Dr. Martin Luther King Jr., one of the greatest champions for freedom and equality in the history of our nation.”\n106.",
    "Ron Estes (Kan.) - “Today, we honor the life of Civil Rights leader Reverend Dr. Martin Luther King Jr. and remember his courageous service that is an inspiration to us all.”\n45.",
    "‘The time is always right to do what is right.’ - MLK”\nToday, we honor and remember Dr. Martin Luther King Jr. and his vision and perseverance that still inspires us to this day.",
    "Lessons that emphasize ways to treat our peers and our neighbors with respect, despite our differences, in order to make a dream of a better, and more unified tomorrow possible.",
    "Jeff Duncan (S.C.) - “The ultimate measure of a man is not where he stands in moments of convenience and comfort, but where he stands at times of challenge and controversy.”\n43.",
    "Jim Hagedorn (Minn.) - “Today, we join our nation in remembering the great Dr. Martin Luther King, Jr. We honor his courage and legacy of equality, opportunity, and hope.”\n67.",
    "- “Today, as we reflect on the life and legacy of Dr. Martin Luther King Jr, may we be reminded of his example and his commitment to loving his fellow man.”\nAdvertisement\n14.",
    "Stephanie Bice (Okla.) - “Martin Luther King Jr.’s remarkable bravery, leadership, and impactful contributions forever changed the trajectory of America for the better.”\n18.",
    "Today, most of these lawmakers are hoping you’ll forget how they lied to Americans that day and threatened the peaceful transfer of power, the very foundation of democracy.",
    "Carol Miller (W.Va.) - “As we honor & celebrate his legacy today, let’s listen to his words & come together to help our neighbors & continue to make #WV the best it can be.",
    "#MartinLutherKingDay\n\"The ultimate measure of a man is not where he stands in moments of convenience and comfort, but where he stands at times of challenge and controversy.",
    "Roger Williams (Texas) - “His commitment to justice, equality, and peace inspired millions and his legacy will continue to inspire generations to come.”\nAdvertisement\n144.",
    "August Pfluger (Texas) - “His vision of freedom, equality, and opportunity, as well as his dedication to serving others, is a legacy that will always be remembered.”\n116.",
    "Ben Cline (Va.) - “Today we celebrate the life and legacy of Dr. Martin Luther King, Jr. His impact on the fight for equality will never be forgotten.”\nAdvertisement\n34.",
    "Randy Weber (Texas) - “As we observe Martin Luther King Jr. Day, let us honor his legacy by looking out for our neighbors and serving those in need in our communities.",
    "Morgan Griffith (Va.) - “Through courage, eloquence, and commitment to nonviolence, he summoned our country to live up to the self-evident truths of our founding.”\n65.",
    "David Schweikert (Ariz.) - “Martin Luther King Jr. called on all Americans to be compassionate and loving neighbors, to be the light wherever there is darkness.”\n127.",
    "Mark Green (Tenn.) - “Today and every day, may we always remember the importance of the ‘content of our character’ as the means in which each of us should be judged.",
    "Mike Garcia (Calif.) - “In a world so divided, I hope we all take a moment to reflect on Dr. King & his legacy that will stand the test of time.”\nAdvertisement\n54.",
    "Gary Palmer (Ala.) - “His commitment to justice, civil rights, and peace between fellow citizens remain an inspiration for us in these tense political times.”\n113.",
    "Tommy Tuberville (Ala.) - “Today, we can honor his legacy by finding ways to give back and serve others, united in the purpose to make this country better for all.",
    "Burgess Owens (Utah) - “As we honor Dr. King’s dream today, let’s carry on his legacy of equality and strive to continue building a brighter future for all.”\n111.",
    "Markwayne Mullin (Okla.) - “Today, we honor the life and legacy of Dr. Martin Luther King, Jr. Now more than ever, we must strive to follow his example.”\n105.",
    "Lauren Boebert (Colo.) - “Today, we honor the life and legacy of Dr. Martin Luther King, Jr. His work to make this country a more perfect union lives on.”\n21.",
    "Debbie Lesko (Ariz.) - “On this day, we remember Dr. Martin Luther King Jr., a man who transformed our nation and stood for equal rights and justice for all.",
    "Robert Wittman (Va.) - “As we remember his legacy, may we strive to be more like him in our dedication to service, our communities, and our neighbors.”\n146.",
    "Mike Kelly (Pa.) - “On this day, we remember the life and legacy of Dr. Martin Luther King, Jr. and the impact he made on our world.”\nAdvertisement\n84.",
    "Mary Miller (Ill.) - “Today, we honor and remember Dr. Martin Luther King Jr. and his vision and perseverance that still inspires us to this day.”\n102.",
    "Lee Zeldin (N.Y.) - “Martin Luther King, Jr. encouraged fierce but peaceful protest of injustice, and acted selflessly to fight hate and intolerance.”",
    "Ted Cruz (Texas) - “We remember the sacrifices he made to secure liberty for every American.”\nWe honor the life & legacy of Dr. Martin Luther King Jr.",
    "In the face of persecution & hate, MLK took the road less traveled by using peace & non-violence to champion justice & civil rights for ALL Americans.",
    "Tom Rice (S.C.) - “Today we remember the life and contributions of Dr. Martin Luther King Jr. - a true unifier who made America a better place.”\n119.",
    "- “On this Martin Luther King Jr. Day, it is critical that we reflect on how we can learn from our nation’s history, not erase or tear it down.”\n123.",
    "Tim Walberg (Mich.) - “May his enduring message of freedom and opportunity for all continue to inspire us as a nation for generations to come.”\n140.",
    "Steve Chabot (Ohio) - “As we honor the life and legacy of Dr. Martin Luther King Jr. today, may we reflect on his words of hope, optimism and unity.",
    "Ted Budd (N.C.) - “Today we honor Martin Luther King’s dream that we judge one another by the content of our character, not the color of our skin.",
    "Brian Mast (Fla.) - “Martin Luther King, Jr.’s legacy reminds us that the fight for liberty, justice and equality is always one worth having.”\n97.",
    "Neal Dunn (Fla.) - “May we all strive to continue Dr. King’s work & to make a difference, not just this weekend but every day.”\nAdvertisement\n44.",
    "Andy Biggs (Ariz.) - “Today, we honor and remember Dr. Martin Luther King Jr. and his vision and perseverance that still inspires us to this day.",
    "- “Today, we honor Dr. King’s legacy of steadfast & passionate devotion to his Dream of freedom & equal opportunity for all.”\nAdvertisement\n114.",
    "Mike Rogers (Ala.) - “Today, we honor and remember the life and legacy of Martin Luther King Jr. and the profound impact he had on our nation.",
    "Daniel Webster (Fla.) - “He inspired us to choose love over hate & build relationships with those of different backgrounds from our own.”\n143.",
    "Martin Luther King Jr. was one of the most unifying, courageous and influential Americans to ever call this country home.”\nAdvertisement\n94.",
    "May we honor his incredible legacy by serving our communities and playing a part in the positive change in our nation and our world.”\n112.",
    "Barry Moore (Ala.) - “As we celebrate today, may we honor him by loving one another and working to heal our nation.”\nAdvertisement\n104.",
    "Ralph Norman (S.C.) - “He became the face of the Civil Rights movement and to this day, his work continues to inspire the nation.”\n108.",
    "Scott Franklin (Fla.) - “Today we celebrate the legacy of Dr. Martin Luther King, Jr.’s work for America and the civil rights movement.",
    "Brian Babin (Texas) - “Today, we join together to remember the life of Martin Luther King, Jr., and the profound legacy he left behind.",
    "Mike Bost (Ill.) - “Today we celebrate the life of Dr. Martin Luther King Jr. and his legacy of hope, service, and opportunity for all.",
    "Martin Luther King Jr.’s mission to promote equality and justice for all Americans resonates more deeply than ever.” (She retweeted.)",
    "Martin Luther King Jr.’s mission to promote equality and justice for all Americans resonates more deeply than ever.” (He retweeted.)",
    "Martin Luther King Jr.’s mission to promote equality and justice for all Americans resonates more deeply than ever.” (He retweeted.)",
    "Martin Luther King Jr.’s mission to promote equality and justice for all Americans resonates more deeply than ever.” (He retweeted.)",
    "Chuck Fleischmann (Tenn.) - “We will always remember Dr. King’s eternal dream of equality, opportunity, and service to others.”\n49.",
    "His biggest, most effective weapon was freedom of speech, which is clearly under attack as it was when he was tragically murdered.",
    "Frank Lucas (Okla.) - “Today we honor the life of Martin Luther King Jr. and his legacy of freedom and equality for all Americans.",
    "David Rouzer (N.C.) - “Today we honor the life of Martin Luther King Jr. and his legacy of freedom and equality for all Americans.",
    "#MLKDay”\nToday, we honor and remember the life and legacy of Martin Luther King Jr. and the profound impact he had on our nation.",
    "David Kustoff (Tenn.) - “Today, on Martin Luther King Jr. Day, we honor the incredible life and legacy Dr. King left behind.”\n86.",
    "Russ Fulcher (Idaho) - “In times of great division, it is imperative that we heed his words — ‘I have decided to stick with love.",
    "John Rutherford (Fla.) - “Because of his tireless commitment to freedom and equality, America became a more perfect Union.”\n125.",
    "Scott Perry (Pa.) - “Let us all remember Dr. King’s steadfast commitment to achieving justice through nonviolent protest.”\n115.",
    "- “‘The time is always right to do right.’ Join me today in celebrating the life and legacy of Dr. Martin Luther King Jr.”\n62.",
    "This is why right, temporarily defeated, is stronger than evil triumphant.’ -Martin Luther King, Jr. #MLKDay”\nAdvertisement\n5.",
    "- “Today Americans from all corners of our country honor Dr. Martin Luther King Jr. and his remarkable vision for our nation.",
    "Martin Luther King Jr challenged the nation to live up to the highest ideals of equality, civility, peace and justice.”\n100.",
    "Roger Marshall (Kan.) - “On this Martin Luther King Day, it is critical that we do not forget the many lessons he taught us.",
    "Rick Scott (Fla.) - “Today, we honor the life of Martin Luther King Jr., an incredible voice for peace, equality & love.”\n8.",
    "Cliff Bentz (Ore.) - “Today we celebrate Dr. Martin Luther King’s legacy of collective effort to advance human rights.”\n16.",
    "Kat Cammack (Fla.) - “On #MLKDay, we recognize a true visionary; a true principled leader for the betterment of our nation.",
    "Dan Bishop (N.C.) - “I join North Carolinians in honoring his legacy that should resonate with us today more than ever.",
    "Byron Donalds (Fla.) - “We are the nation we are today because of men like MLK, and we must keep his dream alive.”\n42.",
    "Martin Luther King Jr. was one of the most unifying, influential, and compassionate Americans in our Nation’s history.",
    "- “Life’s most persistent and urgent question is, ‘What are you doing for others?’” - Dr. Martin Luther King Jr.”\n70.",
    "Guy Reschenthaler (Pa.) - “I encourage everyone to take a moment to reflect on Dr. King’s unmatched courage.”\n118.",
    "Tim Burchett (Tenn.) - “Today we honor the life of Dr. Martin Luther King Jr. and the legacy he left behind.”\n25.",
    "Martin Luther King Jr. dedicated his life to unifying America and promoting equality and justice for all.”\n83.",
    "\"- Martin Luther King, Jr. pic.twitter.com/O0zVffxJWW\n— Rep. Doug Lamborn (@RepDLamborn) January 17, 2022\n88.",
    "King’s message of freedom, equality, and opportunity for every American continues to inspire our nation.”\n89.",
    "Lloyd Smucker (Pa.) - “Today we honor and reflect on the works and legacy of Dr. Martin Luther King Jr.”\n131.",
    "Madison Cawthorn (N.C.) - “Honoring the incredible life and legacy of Dr. Martin Luther King Jr. #MLKDay”\n32.",
    "He was a true visionary and a steadfast leader who dedicated his life to making our country a better place.",
    "Yvette Herrell (N.M.) - “‘A just law is a man made code that squares with the moral law or the law of God.",
    "Virginia Foxx (N.C.) - “His mission of promoting equality and justice for all continues to live on.”\n50.",
    "Doug Lamborn (Colo.) - “Today, we remember a man whose vision was honorable, powerful, and transcending.",
    "John Joyce (Pa.) - “Through his words and deeds he worked to help us create ‘a more perfect Union.’”\n82.",
    "We must continue to embody his spirit every day, especially in a time of tense political division.”\n28.",
    "#MartinLutherKingDay”\nToday, we remember a man whose vision was honorable, powerful, and transcending.",
    "Kevin Hern (Okla.) - “May his vision continue to inspire us to work together for the common good.”\n71.",
    "Pete Sessions (Texas) - “Today, we honor the life and legacy of the great Dr. Martin Luther King Jr.!",
    "Hate cannot drive out hate; only love can do that.’ - Dr. Martin Luther King Jr.”\nAdvertisement\n74.",
    "pic.twitter.com/1VV5fF3fa4\n— Congresswoman Beth Van Duyne (@RepBethVanDuyne) January 17, 2022\n139.",
    "On this #MLKDay, let us stand firm in his conviction that, in time, peace and love will prevail.",
    "Lisa McClain (Mich.) - “America would not be the country it is today without his activism.”\n99.",
    "His tireless work in the Civil Right’s movement remains an inspiration to all Americans.”\n91.",
    "#MLKDay pic.twitter.com/VMrd5XSYuX\n— Rep. Elise Stefanik (@RepStefanik) January 17, 2022\n132.",
    "Michael Burgess (Texas) - “Today, we celebrate the life and legacy of Dr. Martin Luther King.",
    "Warren Davidson (Ohio) - “America is a more perfect union because of Dr. Martin Luther King.",
    "-“‘I believe that unarmed truth and unconditional love will have the final word in reality.",
    "Buddy Carter (Ga.) - “This #MLKDay, we reflect on the life and legacy of an American hero.",
    "Martin Luther King Jr. will always be remembered for his message of unity and peace.”\n133.",
    "#MLKDay pic.twitter.com/GOJE1vUpwa\n— Mike Rogers (@RepMikeRogersAL) January 17, 2022\n121.",
    "#MLKDay pic.twitter.com/XcfgIV5rwv\n— Rep. Chris Jacobs (@RepJacobs) January 17, 2022\n78.",
    "- MLK pic.twitter.com/2CIcCiGa4J\n— Rep Andy Biggs (@RepAndyBiggsAZ) January 17, 2022\n19.",
    "#MLKDay pic.twitter.com/bj9bJe6cZE\n— Senator Ted Cruz (@SenTedCruz) January 17, 2022\n2.",
    "We must continue to live by his words and promote peace and freedom for every American.",
    "#MLK pic.twitter.com/P3hYzxnJHb\n— Rep. Paul Gosar, DDS (@RepGosar) January 17, 2022\n60.",
    "Martin Luther King dedicated his life to loving his neighbors and serving his country.",
    "And may we always pursue the better nation he imagined for us all.”\nAdvertisement\n134.",
    "pic.twitter.com/bOz8uFovcS\n— Dr. Roger Marshall (@RogerMarshallMD) January 17, 2022\n7.",
    "pic.twitter.com/FSf758HR9w\n— Rep. Jay Obernolte (@JayObernolte) January 17, 2022\n110.",
    "pic.twitter.com/xEokwlxLtZ\n— Warren Davidson (@WarrenDavidson) January 17, 2022\n39.",
    "His words and example inspire us today as we celebrate a great American on #MLKDay.",
    "Jack Bergman (Mich.) - “Darkness cannot drive out darkness: only light can do that.",
    "Every day, we must continue to strive together to form a more perfect Union.”\n141.",
    "Today, we remember him and the difference he made defending freedom and equality.",
    "An unjust law is a code that is out of harmony with the moral law.’ -MLK Jr.”\n72.",
    "Jim Jordan (Ohio) - “Darkness cannot drive out darkness; only light can do that.",
    "Thank you, Martin Luther King Jr., for courageously fighting for equality.”\n30.",
    "pic.twitter.com/vXKkbK3rzM\n— Judge Carter (@JudgeCarter) January 17, 2022\n31.",
    "Martin Luther King Jr. spent his life in the pursuit of a more perfect union.",
    "None mention that they all oppose current voting rights legislation, either.",
    "Jerry Carl (Ala.) - “Today, we honor the life of Dr. Martin Luther King Jr.",
    "Bill Johnson (Ohio) - “America is forever indebted to Dr. King’s work.”\n79.",
    "Mario Diaz-Balart (Fla.) - “The time is always right to do what is right.",
    "He dedicated his life to make our country better for generations to come.",
    "He was a giant among men who sought to make our union a more perfect one.",
    "- “Today, we celebrate the life and legacy of Dr. Martin Luther King.",
    "Marjorie Taylor Greene (Ga.) - No MLK Day comments on social media.",
    "Chris Stewart (Utah) - “May we never forget his words and actions.",
    "- “Today, we remember a titan in the fight for Civil Rights.”\n66.",
    "Michelle Fischbach (Minn.) - No MLK Day comments on social media.",
    "Diana Harshbarger (Tenn.) - “Remembering this leader today.”\n69.",
    "Scott DesJarlais (Tenn.) - No MLK Day comments on social media.",
    "- “‘Darkness cannot drive out darkness; only light can do that.",
    "- “Darkness cannot drive out darkness; only light can do that.",
    "- “In memory of Martin Luther King, Jr., and his legacy.”\n85.",
    "— Rep. Scott Fitzgerald (@RepFitzgerald) January 17, 2022\n48.",
    "Robert Aderholt (Ala.) - No MLK Day comments on social media.",
    "Michael Cloud (Texas) - No MLK Day comments on social media.",
    "Carlos Gimenez (Fla.) - No MLK Day comments on social media.",
    "Louie Gohmert (Texas) - No MLK Day comments on social media.",
    "Ronny Jackson (Texas) - No MLK Day comments on social media.",
    "Thomas Tiffany (Wis.) - No MLK Day comments on social media.",
    "We live in a truly great nation thanks to pioneers like MLK.",
    "Glenn Thompson (Pa.) - No MLK Day comments on social media.",
    "Your legacy and your mission will never be forgotten.”\n107.",
    "Lance Gooden (Texas) - No MLK Day comments on social media.",
    "Ken Calvert (Calif.) - No MLK Day comments on social media.",
    "— Rep. Jodey Arrington (@RepArrington) January 17, 2022\n12.",
    "Alex Mooney (W.Va.) - No MLK Day comments on social media.",
    "Harold Rogers (Ky.) - No MLK Day comments on social media.",
    "He was an admirable man of character and conviction.”\n128.",
    "Pat Fallon (Texas) - No MLK Day comments on social media.",
    "Matt Gaetz (Fla.) - No MLK Day comments on social media.",
    "John Rose (Tenn.) - No MLK Day comments on social media.",
    "Bill Posey (Fla.) - No MLK Day comments on social media.",
    "Joe Wilson (S.C.) - No MLK Day comments on social media.",
    "On this #MLKDay may we seek to follow in his steps.”\n26.",
    "Hate cannot drive out hate: only love can do that.”\n17.",
    "Bob Gibbs (Ohio) - No MLK Day comments on social media.",
    "We continue to fight for the dream he envisioned.”\n51.",
    "Bob Good (Va.) - No MLK Day comments on social media.",
    "I invite everyone to join me in celebrating #MLKDay.",
    "— Kevin McCarthy (@GOPLeader) January 17, 2022\n98.",
    "Hate cannot drive out hate; only love can do that.",
    "Hate cannot drive out hate; only love can do that.",
    "Today, we celebrate his honorable life and legacy.",
    "\"The time is always right to do what is right.\"",
    "Devin Nunes (Calif.) - Resigned from Congress.",
    "Paul Gosar (Ariz.) - “Still rings true today.",
    "Hate is too great a burden to bear.’”\n52.",
    "Troy Nehls (Texas) - “Thank you Dr. King.",
    "He never gave up and never preached hate.",
    "House Minority Whip Steve Scalise (La.)",
    "- No MLK Day comments on social media.",
    "Ron Wright (Texas) - Died in February.",
    "- No MLK Day comments on social media.",
    "- No MLK Day comments on social media.",
    "- “Darkness cannot drive out darkness.",
    "(@MoBrooks) January 17, 2022\n23.",
    "Nicole Malliotakis (N.Y.) - “Dr.",
    "In the Senate:\nAdvertisement\n1.",
    "#MLK”\nStill rings true today.",
    "Richard Hudson (N.C.) - “Dr.",
    "Gregory Steube (Fla.) - “Dr.",
    "Jeff Van Drew (N.J.) - “Dr.",
    "#MLKDay”\nAdvertisement\n124.",
    "Jake LaTurner (Kan.) - “Dr.",
    "Hate cannot drive our hate.",
    "Only love can do that.”\n6.",
    "#MLKDay”\nAdvertisement\n24.",
    "Daniel Meuser (Pa.) - “Dr.",
    "Tracey Mann (Kan.) - “Dr.",
    "#MartinLutherKingDay”\n41.",
    "Matthew Rosendale (Mont.)",
    "#MLKDay”\nIn the House:\n9.",
    "Cindy Hyde-Smith (Miss.)",
    "Blaine Luetkemeyer (Mo.)",
    "Fred Keller (Pa.) - “Dr.",
    "#MLKDay” (He retweeted.)",
    "Only light can do that.",
    "Jody Hice (Ga.) - “Dr.",
    "Jackie Walorski (Ind.)",
    "Steven Palazzo (Miss.)",
    "Michael Guest (Miss.)",
    "Cynthia Lummis (Wyo).",
    "Rick Crawford (Ark.)",
    "Vicky Hartzler (Mo.)",
    "Happy MLK Day!”\n142.",
    "Adrian Smith (Neb.)",
    "Garret Graves (La.)",
    "Trent Kelly (Miss.)",
    "Mike Johnson (La.)",
    "Clay Higgins (La.)",
    "John Kennedy (La.)",
    "Josh Hawley (Mo.)",
    "Andy Harris (Md.)",
    "Advertisement\n64.",
    "Greg Pence (Ind.)",
    "Jason Smith (Mo.)",
    "Sam Graves (Mo.)",
    "Billy Long (Mo.)",
    "Jim Banks (Ind.)",
    "Jim Baird (Ind.)",
    "#MLKDay”\n101.",
    "#MLKDay”\n138.",
    "#MLKDay”\n93.",
    "#MLKDay”\n90.",
    "#MLKDay”\n80.",
    "#MLKDay”\n63.",
    "#MLKDay”\n13.",
    "#MLKDay”\n33.",
    "#MLKDay”\n29.",
    "#MLKDay”\n22.",
    "#MLKDay”\n20.",
    "- “Dr.",
    "- “Dr.",
    "- “Dr.",
    "- “Dr.",
    "117.",
    "120.",
    "129.",
    "126.",
    "122.",
    "145.",
    "130.",
    "136.",
    "135.",
    "147.",
    "109.",
    "103.",
    "95.",
    "96.",
    "81.",
    "75.",
    "77.",
    "61.",
    "59.",
    "58.",
    "57.",
    "73.",
    "46.",
    "47.",
    "38.",
    "40.",
    "53.",
    "55.",
    "56.",
    "10.",
    "27.",
    "35."
  ]
}