{
  "id": 6870,
  "mediaId": 2658,
  "date": "2022-01-13",
  "headline": "POLITICO Playbook: Biden and Manchin come face to face",
  "image": "https://static.politico.com/bd/6e/a435e9af4301a5af7237f6e63d63/220113-manchin-getty-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/01/13/biden-and-manchin-come-face-to-face-495712",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1978,
    2277,
    2576,
    3267,
    3838,
    3975,
    4042,
    4466,
    831,
    4984
  ],
  "sentences": [
    "EARMARKS ARE BACK — WaPo’s Paul Kane on the return of the E-word: “More than 220 House Democrats requested more than 2,000 projects for their districts, while 108 House Republicans — a majority of their caucus — requested more than 700 projects, according to the committee.”\n“More than 60 senators have secured earmarks in their appropriations bills, including 16 Republicans, according to the Senate committee.”\nJAN. 6\nANOTHER GOP SNUB TO JAN. 6 COMMITTEE — Kyle Cheney, Nicholas Wu and Olivia Beavers report, “The Jan. 6 select committee has requested House Minority Leader Kevin McCarthy’s testimony about his interactions with Donald Trump as a mob swarmed the Capitol, describing it as crucial to understanding the former president’s state of mind.”\nMcCarthy’s response came hours later Wednesday: “As a representative and the leader of the minority party, it is with neither regret nor satisfaction that I have concluded to not participate with this select committee’s abuse of power that stains this institution today and will harm it going forward.”\nThe committee will now have to consider whether to subpoena McCarthy, who is the third Republican in the House to reject a request to testify.",
    "HAPPY BIRTHDAY: Rep. Thomas Massie (R-Ky.) … Nate Silver … Andrew Yang … Rod Rosenstein of King & Spalding … Tim Noah … Marc Thiessen … Julia Tishman … Natasha McKenzie … Andrew Riddaugh of Liberation Technology Services … Jason Chung … Tali Stein Elleithee … National Journal’s Mini Racker … Ali Tulbah … Fox News’ Christina Robbins … Kristina Schake … Britt Bepler of Monument Advocacy … Jessica Post … FEMA’s John Allen … Chris Taylor … Nora Walsh-DeVries of Rep. Katie Porter’s (D-Calif.) office … Anna Lidman … Mollie Bowman of the Partnership for American Democracy … Rich Gold of Holland & Knight … Dave O’Brien … David Rosen … POLITICO’s Alexandra Velde, Corey Jaseph and Delianny Brammer … Ken Pollack … Jordan Bell … Will Baskin-Gerwitz … Sam Cohen … Allan Rivlin … Mia Walton … Laurence Wildgoose … Katie Murtha … Liana Guerra of Rep. Darren Soto’s (D-Fla.) office … Robin Bravender … BGR’s Kristin Strobel … Ian Gilley … Vincent Pan … Maria Gavrilovic … Andrew Kossack of Sen. Todd Young’s (R-Ind.)",
    "MEANWHILE, PARTY POOH-BAHS WEIGH IN — Former President BARACK OBAMA penned an op-ed in USA Today urging the Senate to “do the right thing” and “follow JOHN LEWIS’ example.” Speaker NANCY PELOSI argued in a “Dear Colleague” letter that “nothing less than our democracy is at stake.”\nBIDEN’S HARSH RHETORIC BACKFIRES — Senate Majority Whip DICK DURBIN (D-Ill.), under tough questioning from CNN’s Jake Tapper on Wednesday night, said that Biden went too far in likening new Republican-led voting laws to “Jim Crow 2.0.”\nTapper: “Biden is comparing — and you’re not criticizing — the idea of a legislator reducing the number of days for early voting from 15 to 10, or wanting voters to present a photo ID before they vote … You’re comparing that to BULL CONNOR, who literally set dogs upon civil rights protesters.",
    "The way people describe it is they’re on a roller coaster and they want to get off.”\nMeanwhile, in a statement, Biden focused on the declines in some sectors (gas and food prices) while also noting “this report underscores that we still have more work to do, with price increases still too high and squeezing family budgets.”\nKNOWING MITCH LANDRIEU — WSJ’s Ted Mann and Julie Bykowicz profile Biden’s infrastructure czar: “In appointing Mr. Landrieu, Mr. Biden said the former mayor’s relationships with local officials across the country would be assets in overseeing the largest new federal investment in public works in decades.",
    "While Republicans aren’t expected to muscle the bill past the chamber’s 60-vote threshold, they’re “eager to leverage the issue to their political advantage.”\nNATO AND RUSSIA STILL ‘FAR FROM AGREEMENT’ — Following high-level talks this week between Russia and NATO, officials from both sides said they are still “far from agreement … though the U.S. and its allies hoped [the talks] would hold off a further Russian invasion of Ukraine and calm tensions between Moscow and the West,” NYT’s Steven Erlanger, Elian Peltier, Michael Crowley and Anton Troianovski report.",
    "“Aides to [the] president have hinted that they will ramp up economic and diplomatic pressure on Iran if a breakthrough isn’t reached soon, and some analysts are predicting a more coercive U.S. and European posture by early February.”\nTRUMP CARDS\nTHE NEW GOP — Trump is taking increased interest in the Senate this midterms cycle, hoping to get more allies elected to the chamber so he’ll have an easier time passing his agenda if he recaptures the White House in 2024, reports Meridith McGraw.",
    "A member of his non-profit board then floated the idea on Capitol Hill, where it was picked up by Hubert Humphrey, who introduced legislation to create a ‘peace corps.’ John F. Kennedy then adopted it in his 1960 campaign.”\nFIRST IN PLAYBOOK — WHITE HOUSE SCOOPLET: Katie Petrelius, currently a special assistant to the president, has been promoted to deputy director of the White House Presidential Personnel Office.",
    "The panel had subpoenaed McEnany, who was press secretary at the time of the Capitol attack, in November.”\nAMERICA AND THE WORLD\nA RUSSIA REBOOT — Sen. TED CRUZ’s (R-Texas) Nord Stream 2 Russia sanctions bill doesn’t just give the GOP an opportunity to squeeze vulnerable Democrats — it also gives them an opportunity to reclaim the party’s Russia hawkishness after four years of Trump, reports Andrew Desiderio.",
    "“‘He was one of the most engaged mayors in the United States when it came to infrastructure when I was in the White House,’ said DJ GRIBBIN, a senior operating partner at private-equity firm Stonepeak Infrastructure Partners, who was special assistant for infrastructure to former President DONALD TRUMP.”…\n“During his first two months as infrastructure czar, Mr. Landrieu has mostly been working the phones.",
    "He said he had spoken personally with 40 governors, and dozens of mayors and groups such as the U.S. Conference of Mayors, which he once led.”\nCONGRESS\nGRAHAM WARNS MCCONNELL ON TRUMP — Sen. LINDSEY GRAHAM (R-S.C.) sent a warning to MITCH MCCONNELL on Wednesday night, using an appearance on SEAN HANNITY’s show to say that the Senate GOP leader needs to repair his relationship with Trump.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "“Western officials said the Russian response was generally positive, but the Russians did not commit to more talks after this week.”\nTHE IRAN BLAME GAME — “The White House sought Wednesday to reframe the Washington debate about the Iran nuclear deal, asserting that Trump’s decision to quit the agreement is what has led to an Iran on the verge of an atom bomb,” our Nahal Toosi writes.",
    "In fact, as our Burgess Everett and Laura Barrón-López write today, “there’s a real risk that Thursday will end with Biden and his party replaying disastrous visits he made to Capitol Hill last year.” Biden whiffed not once but twice back then, failing to unify his party on a plan to link an infrastructure package with Build Back Better.",
    "“The criticism is inaccurate, unscientific, ill-founded in the facts and, increasingly, motivated by partisan politics.” Signatories include former Senate Majority Leader BILL FRIST, three Nobel Laureates, the former president of Princeton University and dozens of high-ranking academics, doctors and scientists.",
    "At a Senate hearing Tuesday, Fauci had heated exchanges with Sen. RAND PAUL (R-Ky.), whom he accused of putting his life in danger, and Sen. ROGER MARSHALL (R-Kan.), whom he called “a moron.” Video clips of the comments went viral and highlighted the GOP’s fixation with Biden’s chief medical adviser.",
    "MEETING WITH MCENANY — Nicholas Wu and Kyle Cheney report for Congress Minutes: “Former White House press secretary KAYLEIGH MCENANY appeared virtually Wednesday for an interview with the Jan. 6 select panel, according to a source familiar with the matter not authorized to speak on the record.",
    "THE HOUSE will meet at 9 a.m., with last votes at 3 p.m. Pelosi will hold her weekly press conference at 10:45 a.m. House Minority Leader KEVIN MCCARTHY will hold his at 11:30 a.m.\nPHOTO OF THE DAY\nPLAYBOOK READS\nFIRST IN PLAYBOOK — The scientific community is rallying around ANTHONY FAUCI.",
    "The letter\nSPEAKING OF THE EMANUEL FAMILY — John Harris digs into “why the Left couldn’t destroy RAHM EMANUEL,” Zeke’s brother:\n“After Rahm Emanuel limped to the end of two controversy-pocked terms as Chicago mayor in 2019, many people assumed he would be consigned at last to irrelevance.",
    "It’s no surprise we’re back at 1982 levels and we’re going to go up from here.”\nVictoria Guida notes that Wednesday’s news could “ground Biden’s big-spending plans” because inflation is one of the main arguments Manchin has made in opposing Build Back Better.",
    "POLITICO Playbook: Biden and Manchin come face to face\nBy RACHAEL BADE and RYAN LIZZA\n01/13/2022 06:15 AM EST\nPresented by\nDRIVING THE DAY\nTypically presidents head to Capitol Hill to put a final squeeze on lawmakers on the cusp of passing major legislation.",
    "WaPo’s Matt Viser and Jeff Stein note that Democrats only have a few months to change perceptions about the pace of inflation: “Studies show that attitudes about the perceived direction of the economy tend to harden in May or June of an election year.",
    "Olivia Nuzzi, New York Mag’s Washington correspondent and especially good friend of Playbook, is writing and executive producing, with Gina Mingacci, “a pitch-black satirical drama” for AMC called “A Message From the State,” Deadline reports.",
    "And with negative news tending to linger in its impact compared with positive news, Democrats view the next few months as crucial.”\nDem pollster Celinda Lake: “The volatility is so great right now that voters are almost shellshocked.",
    "Via his family: “By 1954, at age 25, he had already sent 18 young Americans to perform service work in India, Nigeria, Indonesia, and Uganda, and 502 others had applied for such placement, demonstrating the feasibility of the idea.",
    "With the Federal Reserve signaling the onset of interest rate hikes as early as March, some economists forecast that the December CPI may have marked America’s inflationary peak and that 2022 will see a gradual decrease.",
    "The conditions are very different today than they were at the time.”\nHoover Institution’s KEVIN HASSETT, who was Council of Economic Advisers chair in the Trump administration, “expects inflation to continue to tick up.",
    "HOW WE EXPECT THIS TO GO DOWN: The House will vote today on the party’s two major voting reform bills, teeing up the Senate to debate the matter using an obscure procedure we won’t bore you with before your coffee.",
    "The administration’s efforts to pass a $1.7 trillion bill would raise taxes and stifle business confidence, he said.”\nMore Hassett: “If you attack supply while feeding demand you get runaway inflation.",
    "University of Pennsylvania’s ZEKE EMANUEL and Cornell’s JOHN MOORE decided they had had enough of the attacks on Fauci and circulated a letter to scientists and medical professionals defending him.",
    "And Trump’s planning to step up his visibility this year, with up to two rallies a month (including in Nevada and Wyoming) and “some sort of counter-programming” to Biden’s State of the Union.",
    "Graham knows that McConnell hasn’t spoken to Trump since before Jan. 6, 2021, and that the GOP leader has shown no indication that he wants to make peace with the former president.",
    "The Banking Committee will hold a hearing on LAEL BRAINARD’s nomination to be Fed vice chair and SANDRA THOMPSON’s nomination to head the Federal Housing Finance Agency at 10 a.m.",
    "In keeping with his Georgia speech this week, he’s expected to call on them to do whatever it takes — including making an end run around the filibuster — to “save” democracy.",
    "IN MEMORIAM — Doug Kelley, who conceived of and ran the pilot concept that would become the Peace Corps (the International Development Placement Association), died Wednesday.",
    "Some critics, especially on the Democratic left, thought a sullen fadeaway was too good for Emanuel — he deserved some place a bit hotter to spend his political afterlife.",
    "PLAYBOOKERS\nMarco Rubio described the life of a typical liberal as watching MSNBC, riding a Peloton in the morning, drinking caramel macchiatos and eating avocado toast.",
    "JIM BAIRD, chief investment officer at Plante Moran Financial Advisors, says it will fade: “I don’t believe that we’re headed back towards another rehash of the 1970s.",
    "He still wants to pass some version of his BBB plan, but so far, Manchin has refused to return to the negotiating table because of digs at him from White House staff.",
    "So he’s being more cautious about endorsements — Arizona, Missouri, Ohio, Oklahoma and Pennsylvania are among the states where he doesn’t yet have a dog in the fight.",
    "It “follows a young reporter in DC who defects from the mainstream media.” (Deadline calls this an exclusive but, truth be told, we’ve known about it for a while.)",
    "— 10:30 a.m.: Biden will deliver remarks on the administration’s pandemic response with Defense Secretary LLOYD AUSTIN and FEMA Administrator DEANNE CRISWELL.",
    "He said the Biden administration’s economic and regulatory agenda was more to blame than pandemic-related supply problems for today’s accelerating inflation.",
    "At some point, Senate Majority Leader CHUCK SCHUMER will try to move to end debate on those bills, which Republicans will filibuster, blocking passage.",
    "She’s been on nonstop calls and Zoom meetings, hearing out pleas from her colleagues as well as civil and voting rights groups such as the NAACP.",
    "After his very aggressive speech in Georgia, it will be worth watching how hard Biden pushes in the closer confines of the Democratic conference.",
    "When Trump was president, the two men often played good cop (Graham) and bad cop (McConnell) when it came to corralling the unpredictable leader.",
    "“We are grateful for Dr. Fauci’s dedication and tireless efforts to help the country through this pandemic and other health crises,” they wrote.",
    "“I like Sen. McConnell … but here’s the question: Can Sen. McConnell effectively work with the leader of the Republican Party, Donald Trump?",
    "SPOTTED: Reps. Madison Cawthorn (R-N.C.) and Marjorie Taylor Greene (R-Ga.) in the bar area of the Trump Hotel in D.C. on Wednesday evening.",
    "“If you want to be a Republican leader in the House or the Senate, you have to have a working relationship with Donald Trump,” Graham said.",
    "The critique “came as indirect talks in Vienna between the U.S. and Iran to revive the deal remain unable to resolve critical differences.",
    "I’m not going to vote for anybody that can’t … because if you don’t do that, you will fail.”\nThe quote is noteworthy for several reasons.",
    "While she supports Democrats’ voting bill, Sinema has argued that people who love democracy can fundamentally disagree on the filibuster.",
    "And with today’s appearance unlikely to change that, the weeklong focus on voting rights will amount to little more than kabuki theater.",
    "Playbook couldn’t happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "At 1 p.m., the president will appear at a Democratic Caucus meeting to try to rally senators behind the party’s voting reform proposal.",
    "Warren Davidson, Republican congressman from Ohio, compared D.C.’s upcoming vaccine requirement to Nazism, drawing swift condemnation.",
    "WSJ’s David Harrison and Harriet Torry write about the debate over whether inflation is likely to fade or run away this year.",
    "Finally, most GOP senators and Senate candidates have sided with McConnell when asked about Trump’s push to oust McConnell.",
    "The HELP Committee will hold a markup to vote on nominations including ROBERT CALIFF as FDA commissioner, time TBA.",
    "That will prompt Schumer to begin the much-anticipated debate on Senate rules, which require a majority to change.",
    "Today, JOE BIDEN will make the trek up Pennsylvania Avenue for yet another sales pitch that’s doomed for failure.",
    "— 1 p.m.: Biden will meet with the Senate Democratic Caucus at the Capitol to discuss voting rights legislation.",
    "(h/t Daniel Lippman)\n— Kathy Grannis Allen has joined Amazon’s D.C. office to work across the devices PR team.",
    "But she’s reiterated her concern that nuking the filibuster will turn the Senate into a version of the House.",
    "Graham’s comment, however, could trigger some Republicans to change their calculation and abandon McConnell.",
    "Isn’t that a little stark?”\nDurbin, in part: “Perhaps the president went a little too far in his rhetoric.",
    "Graham’s comments are somewhat surprising given that Graham and McConnell are often allies in the Senate.",
    "Jamie Raskin thanked “friends and the democracy patriots out there” for helping his new book leap to No.",
    "USPS recently delivered a letter from an American soldier serving in Germany 76 years after it was sent.",
    "He most recently was media relations manager at Investment Company Institute, and is a Tom Graves alum.",
    "Sinema is actually looking forward to the rules debate, a person close to her told us Wednesday night.",
    "What gives?”\nTHE WHITE HOUSE\nINFLATION WATCH — Was Wednesday the last bad CPI report of the year?",
    "Press secretary JEN PSAKI will brief at 3 p.m. with national security adviser JAKE SULLIVAN.",
    "He hopes to do so by Martin Luther King Jr. Day, which will likely entail some weekend work.",
    "Stacy Eichner, a senior associate director at PPO, will be the office’s new chief of staff.",
    "Emanuel leaves on Saturday to begin his term as President Joe Biden’s newly confirmed U.S.",
    "BIDEN’S THURSDAY:\n— 9:30 a.m.: The president will receive the President’s Daily Brief.",
    "JOE MANCHIN (D-W.Va.) and KYRSTEN SINEMA (D-Ariz.) aren’t budging on the filibuster.",
    "… Shauna Hamilton is joining Squared Communications as a senior director in Boston.",
    "She most recently was director of media relations at SalientMG, and is an NRF alum.",
    "But here Graham is telling McConnell his position is simply unsustainable.",
    "Some of us do.”\nGood Thursday morning, and thanks for reading Playbook.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza, Tara Palmeri.",
    "TRANSITIONS — Garrett Hawkins is now a director at Marathon Strategies.",
    "There is incentive for him not to go too hard at Manchin and Sinema.",
    "Annual inflation came in at 7% in December, an almost 40-year high.",
    "“We deplore the personal attacks on Dr. Fauci,” the letter says.",
    "Or JEFFERSON DAVIS, the president of the traitorous Confederacy.",
    "GEORGE WALLACE, who said segregation today, segregation forever.",
    "office … Nick Butterfield\nDid someone forward this email to you?",
    "The president has only so much political capital to go around.",
    "“Less than three years later, Emanuel isn’t going to oblivion.",
    "She is principal owner at Dig Deep Investigative Group.",
    "The federal government is deregulating French dressing.",
    "And he isn’t going to hell, or at least not yet.",
    "That’s certainly what the White House is hoping.",
    "Send Playbookers tips to playbook@politico.com.",
    "Biden can’t afford to alienate him further.",
    "1 on the NYT Best Sellers list.",
    "An incredible story from WaPo.",
    "Both are Biden campaign alums.",
    "(You read that right.)",
    "Ambassador to Japan.",
    "He’s going to Tokyo.",
    "I’m paraphrasing.",
    "THE SENATE is in.",
    "Sign up here.",
    "But Sens."
  ]
}