{
  "id": 7045,
  "mediaId": 2730,
  "date": "2022-01-26",
  "headline": "Rep. Chip Roy is Willing to Shut Down Government Over Vaccine Mandates",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/106/687098dd-c14a-46af-bba4-0d9d56b787f0.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/01/26/rep-chip-roy-is-willing-to-shut-down-government-over-vaccine-mandates-n2602417",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    0
  ],
  "sentences": [
    "Paul and Johnson, as well as Reps. Scott Perry (R-PA), Warren Davidson (R-OH), Lauren Boebert (R-CO), Bob Good (R-VA), Dan Bishop (R-NC), Andy Biggs (R-AZ), Jody Hice (R-GA), Marjorie Taylor Greene (R-GA), Jeff Duncan (R-SC) Mary E. Miller (R-IL), Louie Gohmert (R-TX), Alex X. Mooney (R-WV), Matt Rosendale (R-MT), Ralph Norman (R-SC), Bill Posey (R-FL), Clay Higgins (R-LA) Randy K. Weber (R-TX), Andrew Clyde (R-GA), Paul A. Gosar, D.D.S.",
    "In a letter, Republicans plan to tell House Minority Leader Kevin McCarthy, R-Calif., and Senate Minority Leader Mitch McConnell, R-Ky., that their party is reaching another crossroads where they \"must once again decide whether they will vote to fund a federal government that is enforcing tyrannical COVID-19 vaccine mandates on the American people.\"",
    "As of January 15, in order to enter most indoor establishments, patrons in Washington, D.C. are required to show they have received at least their first vaccine dose against the Wuhan coronavirus, along with their ID to prove they are the vaccinated person.",
    "The lawmakers plan to take aim at the \"myriad municipalities and states that directly benefit from federal funding\" as a result from the vaccine orders, including in Washington, D.C.\nRoy has consistently stood up against vaccine mandates and passports.",
    "During such a conversation, the congressman also hinted that he would have more news in the coming days about these vaccine mandates, especially as the continuing resolution (CR) to fund the government is set to expire on February 18.",
    "From Fox News' Houston Keene and Kelly Laco:\nRoy told Fox News Digital in a Tuesday statement that he and his colleagues are \"going to find out\" whether the Republicans will \"unite\" and \"pledge not to fund these mandates.\"",
    "\"Most Republicans say that vax mandates are tyrannical and foolish, but will they unite before government funding expires on Feb. 18 to pledge not to fund enforcement of these mandates?\"",
    "On Tuesday, Rep. Roy shared with Fox News Digital a statement indicating he and other Republican members are willing to shut down the government over such vaccine mandates.",
    "The vaccine mandates are not only affecting liberal-run cities such as D.C., New York, Los Angeles, Boston, and Chicago, but federal employees and branches of the military.",
    "(R-AZ), Russ Fulcher (R-ID), Thomas Massie (R-KY), Barry Moore (R-AL), Brian Mast (R-FL), Troy E. Nehls (R-TX), Michael Cloud (R-TX), and David Schweikert (R-AZ).",
    "Earlier this month, the U.S. Supreme Court blocked Biden's vaccine or testing mandate for private businesses with 100 or more employers.",
    "https://t.co/W9dUAzw0Ni\n— Chip Roy (@chiproytx) January 25, 2022\nSuch mandates have found themselves tangled up in the courts.",
    "https://t.co/4o5391lr4D\n— Rebecca Downs (@RebeccaRoseGold) January 21, 2022\nOther signatories in addition to Roy include Sens.",
    "Last week, Rep. Chip Roy (R-TX) spoke with Townhall about his opposition to vaccine mandates in the nation's capitol.",
    "\"Will at least 10 of the 19 GOP senators who voted to punt last time now stand up for health care workers or not?\"",
    "The Senate also voted but ultimately failed to defund Biden's vaccine mandates, via an amendment offered by Sens.",
    "It looks like @chiproytx’s #PledgeNoVaxCard, which involved his quitting Capitol Hill Club, is catching on… ??",
    "Roy has canceled his membership at the Capitol Hill Club and has vowed to eat elsewhere than in the district.",
    "A list of signatories as of Wednesday afternoon obtained by Townhall has the number at 28, plus Roy.",
    "He was prepared to shut down the government in December, but the short-term CR ultimately passed.",
    "Paul canceled his membership at the Capitol Hill Club not long after Roy did.",
    "As Leah reported on Tuesday, OSHA is now withdrawing enforcement.",
    "This is why I am calling on the GOP to #DefundVaxMandates.",
    "It is also now a bicameral effort, thanks to Sens.",
    "Mike Lee (R-UT) and Roger Marshall (R-KS).",
    "(R-KY) and Ron Johnson (R-WI).",
    "\"We're going to find out.\"",
    "Rand Paul, M.D.",
    "he continued.",
    "Roy asked.",
    "Now."
  ]
}