[
  {
    "id": 984,
    "mediaId": 43,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "Washington Republican <span class='selected-term'>Loren Culp</span>\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "author": "",
    "title": "who refuses to accept his own 2020 defeat",
    "sentiment": "0"
  },
  {
    "id": 2280,
    "mediaId": 63,
    "date": "2/13/2022 12:00:00 AM",
    "sentence": "In Washington state, Thiel gave a much smaller amount ($2,900) to gubernatorial hopeful <span class='selected-term'>Loren Culp</span>; his campaign also spiraled.",
    "author": "Abram Brown",
    "title": "Poolside Fundraisers, Crypto And Mini-Trumps: Inside Peter Thiel's Life After Facebook",
    "sentiment": "0"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Trump's pick is 2020 gubernatorial nominee <span class='selected-term'>Loren Culp</span>, a far-right ex-cop who took in just $46,000 and had $24,000 in the bank.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising",
    "sentiment": "0"
  },
  {
    "id": 2269,
    "mediaId": 157,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The core team of ShadowGate? promoters eventually expanded to include Scott Bennett, a former military contractor who had previously been convicted of making a false and fraudulent statement to the government and for the unauthorized wearing of a military uniform by a federal jury in Florida; Stephen Pidgeon, a Washington State attorney who represented Republican gubernatorial candidate <span class='selected-term'>Loren Culp</span> in a lawsuit alleging widespread election fraud that was reportedly withdrawn after the state Attorney General warned it would ask a judge the impose sanctions; and Dennis Nathan Cain, a former FBI contractor who reportedly possessed documents said to have linked the Clinton Foundation to the 2013 sale of a Canadian-owned mining company to a Russian firm's subsidiary.",
    "author": "Jordan Green",
    "title": "Insiders flagged credibility problems for 'key witness' in lawsuits filed to overturn 2020 election",
    "sentiment": "0"
  }
]