[
  {
    "id": 56,
    "mediaId": 151,
    "date": "d2022-02-20T13:48",
    "sentence": "So I'm aware that there are people within the organization that are looking at it and are trying to figure that one out.?\nTrump made his latest endorsement in Washington state against Rep. Dan Newhouse, backing <span class='selected-term'>Loren Culp</span>, a former police chief.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries",
    "sentiment": "0.0"
  },
  {
    "id": 2217,
    "mediaId": 376,
    "date": "d2022-04-12T15:02",
    "sentence": "Trump endorsed 2020 GOP gubernatorial nominee <span class='selected-term'>Loren Culp</span>, who refused to concede that race despite losing by 13.5 points to Democratic Gov.",
    "author": "",
    "title": "New lines, interesting races in Washington state",
    "sentiment": "0.0"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "d2022-04-21T00:00",
    "sentence": "Trump's pick is 2020 gubernatorial nominee <span class='selected-term'>Loren Culp</span>, a far-right ex-cop who took in just $46,000 and had $24,000 in the bank.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising",
    "sentiment": "0.0"
  },
  {
    "id": 2269,
    "mediaId": 157,
    "date": "d2022-04-27T00:00",
    "sentence": "The core team of ShadowGate? promoters eventually expanded to include Scott Bennett, a former military contractor who had previously been convicted of making a false and fraudulent statement to the government and for the unauthorized wearing of a military uniform by a federal jury in Florida; Stephen Pidgeon, a Washington State attorney who represented Republican gubernatorial candidate <span class='selected-term'>Loren Culp</span> in a lawsuit alleging widespread election fraud that was reportedly withdrawn after the state Attorney General warned it would ask a judge the impose sanctions; and Dennis Nathan Cain, a former FBI contractor who reportedly possessed documents said to have linked the Clinton Foundation to the 2013 sale of a Canadian-owned mining company to a Russian firm's subsidiary.",
    "author": "Jordan Green",
    "title": "Insiders flagged credibility problems for 'key witness' in lawsuits filed to overturn 2020 election",
    "sentiment": "0.0"
  }
]