[
  {
    "id": 529,
    "mediaId": 129,
    "date": "d2022-02-10T18:34",
    "sentence": "Among those endorsed by Mr. Trump is <span class='selected-term'>Loren Culp</span>, a former police chief of a one-officer department in rural Washington State who lost the 2020 governor's race by more than 540,000 votes, yet claimed fraud when Gov.",
    "author": "",
    "title": "How the G.O.P.'s Censure Fight Exposes the Party's Deeper Divide",
    "sentiment": "0.0"
  },
  {
    "id": 2280,
    "mediaId": 63,
    "date": "d2022-02-13T12:29",
    "sentence": "In Washington state, Thiel gave a much smaller amount ($2,900) to gubernatorial hopeful <span class='selected-term'>Loren Culp</span>; his campaign also spiraled.",
    "author": "Abram Brown",
    "title": "Poolside Fundraisers, Crypto And Mini-Trumps: Inside Peter Thiel's Life After Facebook",
    "sentiment": "0.0"
  },
  {
    "id": 497,
    "mediaId": 129,
    "date": "d2022-02-14T00:00",
    "sentence": "In addition to Harriet Hageman, the challenger to Ms. Cheney, he is backing Joe Kent and <span class='selected-term'>Loren Culp</span>, both of whom are running against House Republicans in Washington State who voted to impeach Mr. Trump.",
    "author": "",
    "title": "The Right's Would-Be Kingmaker",
    "sentiment": "0.0"
  },
  {
    "id": 57,
    "mediaId": 238,
    "date": "d2022-02-17T00:00",
    "sentence": "Newhouse will benefit from Washington's top-two primary law as well, and Trump only recently endorsed a Newhouse opponent  <span class='selected-term'>Loren Culp</span>, the Republican nominee for Washington governor in 2020.",
    "author": "",
    "title": "Opinion: Republicans who voted to impeach Trump might be in less peril than people think",
    "sentiment": "0.0"
  },
  {
    "id": 56,
    "mediaId": 151,
    "date": "d2022-02-20T13:48",
    "sentence": "So I'm aware that there are people within the organization that are looking at it and are trying to figure that one out.?\nTrump made his latest endorsement in Washington state against Rep. Dan Newhouse, backing <span class='selected-term'>Loren Culp</span>, a former police chief.",
    "author": "",
    "title": "Defiant GOP impeachment voters gear up for Trump-backed primaries",
    "sentiment": "0.0"
  },
  {
    "id": 53,
    "mediaId": 124,
    "date": "d2022-02-22T17:55:38",
    "sentence": "It's like Magapalooza One.?\nThe list of candidates scheduled to attend include: Katie Arrington, candidate for South Carolina's 1st Congressional District; Ted Budd, candidate for U.S. Senate in North Carolina; <span class='selected-term'>Loren Culp</span>, candidate for Washington state's 4th Congressional District; Russell Fry, candidate for South Carolina's 7th Congressional District; John Gibbs, a former Housing and Urban Development official under Trump running to represent Michigan's 3rd Congressional District; Harriet Hageman, candidate for Wyoming's only congressional district; Adam Laxalt, candidate for U.S. Senate in Nevada; Max Miller, the former Trump White House aide and candidate for Ohio's 13th Congressional District; Morgan Ortagus, a former State Department spokeswoman running to represent Tennessee's 5th Congressional District; Kelly Tshibaka, candidate for U.S. Senate in Alaska; Derrick Van Orden, candidate for Wisconsin's 3rd Congressional District; Herschel Walker, candidate for U.S. Senate in Georgia; Ryan Zinke, the former Interior Secretary running in Montana's only congressional district.",
    "author": "",
    "title": "Trump's Mar-a-Lago 'Magapalooza': Boost allies, settle scores",
    "sentiment": "0.0"
  },
  {
    "id": 23,
    "mediaId": 195,
    "date": "d2022-04-05T21:49",
    "sentence": "In Rep. Dan Newhouse's (R-Wash.) district, Trump endorsed retired police chief <span class='selected-term'>Loren Culp</span>.",
    "author": "Cristina Marcos",
    "title": "Veteran lawmaker's exit has House GOP trending toward Trump",
    "sentiment": "0.0"
  },
  {
    "id": 2272,
    "mediaId": 157,
    "date": "d2022-04-09T00:00",
    "sentence": "You funny.https://twitter.com/Sessler/status/1512558618746359811\\u00a0\\u2026\n Dee Snider\\ud83c\\uddfa\\ud83c\\uddf8 (@Dee Snider\\ud83c\\uddfa\\ud83c\\uddf8) 1649488354\nDonald Trump has endorsed <span class='selected-term'>Loren Culp</span> in the race.",
    "author": "Bob Brigham",
    "title": "'Twisted Sister' represents 'traditional, conservative' values: GOP candidate",
    "sentiment": "0.0"
  },
  {
    "id": 2217,
    "mediaId": 376,
    "date": "d2022-04-12T15:02",
    "sentence": "Trump endorsed 2020 GOP gubernatorial nominee <span class='selected-term'>Loren Culp</span>, who refused to concede that race despite losing by 13.5 points to Democratic Gov.",
    "author": "",
    "title": "New lines, interesting races in Washington state",
    "sentiment": "0.0"
  }
]