[
  {
    "id": 497,
    "mediaId": 129,
    "date": "2022-00-14",
    "sentence": "In addition to Harriet Hageman, the challenger to Ms. Cheney, he is backing Joe Kent and <span class='selected-term'>Loren Culp</span>, both of whom are running against House Republicans in Washington State who voted to impeach Mr. Trump.",
    "author": "",
    "title": "The Right's Would-Be Kingmaker",
    "sentiment": "0.0"
  },
  {
    "id": 57,
    "mediaId": 238,
    "date": "2022-00-17",
    "sentence": "Newhouse will benefit from Washington's top-two primary law as well, and Trump only recently endorsed a Newhouse opponent  <span class='selected-term'>Loren Culp</span>, the Republican nominee for Washington governor in 2020.",
    "author": "",
    "title": "Opinion: Republicans who voted to impeach Trump might be in less peril than people think",
    "sentiment": "0.0"
  },
  {
    "id": 9,
    "mediaId": 43,
    "date": "2022-00-21",
    "sentence": "Trump's pick is 2020 gubernatorial nominee <span class='selected-term'>Loren Culp</span>, a far-right ex-cop who took in just $46,000 and had $24,000 in the bank.",
    "author": "",
    "title": "House Republicans all lead their challengers in recent fundraising",
    "sentiment": "0.0"
  },
  {
    "id": 2269,
    "mediaId": 157,
    "date": "2022-00-27",
    "sentence": "The core team of ShadowGate? promoters eventually expanded to include Scott Bennett, a former military contractor who had previously been convicted of making a false and fraudulent statement to the government and for the unauthorized wearing of a military uniform by a federal jury in Florida; Stephen Pidgeon, a Washington State attorney who represented Republican gubernatorial candidate <span class='selected-term'>Loren Culp</span> in a lawsuit alleging widespread election fraud that was reportedly withdrawn after the state Attorney General warned it would ask a judge the impose sanctions; and Dennis Nathan Cain, a former FBI contractor who reportedly possessed documents said to have linked the Clinton Foundation to the 2013 sale of a Canadian-owned mining company to a Russian firm's subsidiary.",
    "author": "Jordan Green",
    "title": "Insiders flagged credibility problems for 'key witness' in lawsuits filed to overturn 2020 election",
    "sentiment": "0.0"
  }
]