{
  "id": 12879,
  "mediaId": 2520,
  "date": "2022-03-05",
  "headline": "Here are the candidates running in Arizona's new 4th Congressional District",
  "image": "https://www.gannett-cdn.com/presto/2022/01/17/PPHX/1bd8f52e-2eb5-43ed-ad7c-4940ec7f73e3-MLK_Day_March002.JPG?crop=5999,3375,x0,y305&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/elections/2022/03/05/arizona-4th-congressional-district-candidates/9284667002/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melissa Estrada",
  "authorUrl": "https://www.azcentral.com/staff/5819881001/melissa-estrada/",
  "termIds": [
    4967,
    2328,
    3324,
    4185,
    1433,
    1474,
    1477,
    5949,
    6360,
    6381,
    6649
  ],
  "sentences": [
    "Supreme Court won't let Arizona voters weigh in on tax cut Brnovich takes election manual fight with Hobbs to court Karrin Taylor Robson drops fundraising tactic after questions AZ House Speaker Rusty Bowers wins award for courage\nAlex Stovall\nAlex Stovall is focusing his campaign on \"reforming the systems currently broken that have been neglecting Arizona Residents for decades.\"",
    "On his campaign website, Lopez says he will bring his experience to Washington, D.C, which he says includes his Chandler record of lowering taxes and creating a business-friendly environment and his work with the Chandler police, which he said helped create a successful policing model by offering needed resources and fostering community outreach.",
    "On a handful of other campaign issues, Cooper wants to keep the Trump administration's Remain in Mexico policy, expand school choice while removing the federal government in education, and help the federal government and local communities work together to help veterans.",
    "He formerly worked as a consultant in Scottsdale and Chandler for Wells Fargo Corp.\nRene Lopez\nChandler City Councilperson Rene Lopez has identified his top priority as empowering job creators and creating an environment for small businesses to thrive.",
    "Republicans:\nTanya Contreras Wheeless\nTanya Contreras Wheeless is running for Arizona's 4th Congressional District and, according to her campaign website, is \"ready to bring a fresh, outsider voice to Congress that is both optimistic and practice.\"",
    "He would support bills that protect Arizona and the border, along with supporting policies that would encourage innovation and enterprise and support free-market principles, stating that the government's job is \"to have oversight; not overreach.\"",
    "His experience has helped him to \"identify the needs of our community and where needed feed that information to both the state legislators as well as the federal Senators and Congress people for action,\" according to his campaign website.",
    "He also supports strong worldwide U.S leadership; keeping Americans working by removing the federal government from private sectors; and helping the U.S become energy independent through the exploration and development of energy.",
    "Other top issues include border wall completion, merit-based immigration reform, and simplifying Arizona's regulations to expand small business opportunities and create tax reforms to attract big businesses to Arizona.",
    "Prior to assuming office as a councilperson in 2015, Lopez, a U.S Navy veteran, served in several other local government positions, including as a member of the Chandler Parks and Recreations Committee.",
    "In office, Stovall would push for education reform by supporting an expansion in public charter and private school vouchers along with reforming school curriculum and reforming teachers' unions.",
    "Her campaign website says national security is a priority and she will advocate for the physical and mental health care of veterans, their families and active military members.",
    "Jerone Davison\nJerone Davison is a former NFL player, pastor and speaker who spent 10 years working in California as a liaison reuniting children with incarcerated parents.",
    "While Arizona is still waiting to officially adopt Arizona's Independent Redistricting Commissions' redrawn map, a final draft of the district outlines has been approved.",
    "With equal rights a campaign issue, Davison said that if elected, he would vote \"yes\" for bills that prohibit discrimination based on sex, race and religion in Arizona.",
    "Other campaign issues are completing the border wall and creating a merit-based immigration system to reward hard-working immigrants in pursuit of the American Dream.",
    "Davison's campaign issues are to strengthen election integrity by supporting legislation such as voter ID, banning ballot harvesting, and returning to paper ballots.",
    "Stanton shares on his campaign website that \"his singular focus in Congress is on making your life better and the results are speaking for themselves.\"",
    "Stanton was added to the Democratic Congressional Campaign Committee's list of House members who are potentially vulnerable in the upcoming election.",
    "Here are the major candidates running:\nDemocrats\nGreg Stanton\nGreg Stanton was first elected to Arizona's former 9th Congressional District in 2018.",
    "Kelly Cooper\nKelly Cooper is a Marine Corps veteran, owner of two Melting Pot restaurant franchise locations, and co-owner of BKD's Backyard Joint.",
    "Giles lists his campaign issues on his campaign website, but says his priority would be to balance the budget and work to reduce the national debt.",
    "Wheeless has worked in the business field as a business association CEO, sports executive with the Phoenix Suns, and as a small business owner.",
    "Lopez is the co-founder and chairman of a non-profit organization, CeCe's Hope Center, which helps women rescued from sex trafficking.",
    "Cooper's campaign issues, as listed on his website, include ensuring election integrity along with the \"ability to validate\" results.",
    "As an international businessman, Giles previously worked as the executive adviser and consultant to the Saudi Arabian oil minister.",
    "With the economy and inflation, Cooper aims to stop subsidizing the \"destruction of the free market\" and push those to work again.",
    "Lopez wants to provide veterans with better physical and mental health care, along with helping transition them to civilian life.",
    "As a first-time candidate, Cooper is the founder and chairman of the Maricopa County Republican Veterans Committee.",
    "Stanton sits on the House Judiciary Committee and on the House Transportation and Infrastructure Committee.",
    "Arizona's new 4th Congressional District covers most of what was previously the 9th Congressional District.",
    "In a district heavy with Republican candidates, Democratic incumbent Rep. Greg Stanton could face a fight.",
    "He vows to use taxpayer money wisely and conservatively and work to cut budgets and wasteful spending.",
    "Wheeless says she will fight for policies to grow the economy, and bring good-paying jobs to Arizona.",
    "On his campaign website, Stovall says he is focusing on \"Economic Equity, Education, and Equality.\"",
    "Prior to serving in the U.S House of Representives, Stanton was mayor of Phoenix from 2012 to 2018.",
    "Davison supports forensic audits, ballot recounts and punishment for those who commit voter fraud.",
    "Stovall is the founder and CEO of a stock and bond business that educates youth and young adults.",
    "He served in the U.S. Army from 2017 to 2019 and is now in the Army Reserve Chaplain program.",
    "Davison on his campaign website identifies his values as faith, family and freedom.",
    "Cooper says he will protect the right to vote, while making it harder to cheat.",
    "Dave Giles\nDave Giles is making another try to represent the area in Congress.",
    "Giles pledges to be \"a thorn in the side of wasteful spenders in Congress.\"",
    "Wheeless' website lists her campaign issues, including border security.",
    "It's in Maricopa County and covers parts of Tempe, Mesa and Chandler.",
    "His campaign website does not list any campaign re-election issues.",
    "He previously ran for the House in 2016, 2018 and 2020.",
    "Wheeless is also a lawyer and community advocate."
  ]
}