[
  {
    "id": 627,
    "mediaId": 675,
    "date": "d2022-02-04T15:22",
    "sentence": "Politics\nCommentary\nPatrice Lewis\nBarbara Simpson\nCraige McMillan\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nLaura Hollis\n<span class='selected-term'>Michael Brown</span>\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "author": "Bob Unruh",
    "title": "RNC votes to censure Cheney, Kinzinger over campaign against Trump",
    "sentiment": "0.0"
  },
  {
    "id": 7029,
    "mediaId": 32,
    "date": "d2022-02-15T21:52:53",
    "sentence": "In a letter to Mastriano, Thompson wrote, we understand that you spoke with former President Trump about your post-election activities.?\nCNBC Politics\nRead more of CNBCs politics coverage:\nVote on Biden Fed picks delayed as GOP presses for answers on Raskins ties to firm\nPrince Andrew settles sex abuse lawsuit by Jeffrey Epstein victim Giuffre\nRemington to pay $73 million to families of Sandy Hook shooting victims\nThe other subpoenas were issued to Michael Roman and Gary <span class='selected-term'>Michael Brown</span>, who led Election Day operations for Trumps 2020 campaign; Michigan GOP Chair Laura Cox; and Arizona State Representative Mark Finchem.",
    "author": "Kevin Breuninger",
    "title": "House probe of Jan. 6 Capitol riot subpoenas Arizona GOP leader Kelli Ward, 5 others over alternate electors",
    "sentiment": "0.0"
  },
  {
    "id": 490,
    "mediaId": 193,
    "date": "d2022-02-16T13:05:30",
    "sentence": "Investigators with the Department of Justice concluded that there was no physical evidence to support that <span class='selected-term'>Michael Brown</span> had surrendered hands raised to police officer Darren Wilson, but that Brown had likely attempted to take the officer's gun, run a short distance away after being shot in the hand, and then turned and was shot dead while facing the officer.",
    "author": "Krista Kafer",
    "title": "Kafer: In a promising year for GOP candidates, don't let the weak links spoil it",
    "sentiment": "0.0"
  }
]