{
  "id": 1287,
  "mediaId": 195,
  "date": "3/1/2022 12:00:00 AM",
  "headline": "Herschel Walker pulls out of Greene event after her speech at white nationalist conference",
  "image": "https://cdn.jwplayer.com/v2/media/LJhjeG4y/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/596357-herschel-walker-pulls-out-of-event-organized-by-greene-after-white",
  "sentiment": "0.308",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    815,
    1136,
    1577,
    1807,
    2095,
    4325,
    428,
    2672
  ],
  "sentences": [
    "Their appearances at AFPAC have since drawn widespread condemnation from Republicans, including House Minority Leader Kevin McCarthy (R-Calif.), who called the behavior appalling and wrong.? Senate Minority Leader Mitch McConnell (R-Ky.) issued a statement saying that there's no place in the Republican Party for white supremacists or antisemitism.?",
    "Georgia Republican Senate candidate and former NFL star Herschel Walker is backing out of a planned speech at an event organized by Rep. Marjorie Taylor Greene (R-Ga.) after she attended a white nationalist conference.",
    "Walker's decision to pull out of the event came just a few days after Greene appeared at the America First Political Action Conference (AFPAC), a gathering organized by Nick Fuentes, a prominent white nationalist.",
    "Walker, the frontrunner in the GOP primary to challenge Sen. Raphael Warnock (D-Ga.), was previously slated to speak at Greene's Second Amendment and Freedom Rally? in Rome, Ga. on Saturday.",
    "Just before Greene spoke at the conference on Friday, Fuentes called on the crowd to give a round of applause for Russia,? days after the country began its invasion of Ukraine.",
    "The rally is still expected to draw several other high-profile Republicans, including Sen. David Perdue (R-Ga.), who's challenging Gov.",
    "Brian Kemp in Georgia's gubernatorial primary, and Rep. Matt Gaetz (R-Fla.), a far-right Florida congressman and close ally of Greene.",
    "Another Republican member of Congress, Rep. Paul Gosar (R-Ariz.), also appeared at that conference by video.",
    "Many in the audience then began chanting the name of Russian President Vladimir Putin.",
    "His campaign confirmed on Tuesday that he will no longer address the event.",
    "Walker's decision was first reported by the Atlanta Journal-Constitution."
  ]
}