{
  "id": 1314,
  "mediaId": 195,
  "date": "2/23/2022 12:00:00 AM",
  "headline": "Herschel Walker says he doesn't support 'either' Kemp or Perdue",
  "image": "https://cdn.jwplayer.com/v2/media/KrpAHl9U/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/595556-herschel-walker-says-he-doesnt-support-either-kemp-or-perdue",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Brian Kemp (R) or former Sen. David Perdue (R) in the state's gubernatorial race, saying I'm mad at both of them.?\nWalker was asked at a University of North Georgia student gathering on Monday whom he supported in the Georgia governor's race.",
    "Polling conducted by Quinnipiac University last month found Kemp leading Perdue in the governor's race, with him getting the backing of 43 percent of likely Republican voters surveyed compared with Perdue's 36 percent.",
    "While Trump has derided Kemp as a weak governor,? the Georgia incumbent may not need Trump's blessing in order to fare well in the Republican primary, which is set for later in May.",
    "Kemp drew ire from the former president after he resisted efforts to overturn the 2020 presidential election results in Georgia, where President Biden had won.",
    "Walker's comments come as Kemp is campaigning for his political life after former President Trump endorsed Perdue in the governor's race late last year.",
    "Walker is 100 percent focused on uniting the party post-primary,? a Walker campaign aide told the news outlet regarding Walker's comments.",
    "I've known Sen. Perdue since I was 19, and this is what I want to say to everyone here: I want to bring this party together.",
    "We got to bring this party together.?\nWhat has happened now is some people get sour grapes and they don't get out and vote.",
    "The Atlanta Journal-Constitution obtained audio of his response to the gathering, saying he did not support Kemp or Perdue.",
    "Georgia Senate candidate Herschel Walker (R) says that he does not support either? Georgia Gov.",
    "Kemp or Sen. Perdue  he needs to tell his people to go vote for the other,? he added.",
    "The Hill has reached out to the Walker, Kemp and Perdue campaigns for comment.",
    "I'm mad at both of them,? Walker responded, according to the recording.",
    "But I want to say this to whoever loses that race  whether it's Gov.",
    "I speak the truth and let me tell you why.",
    "\"I don't support either one of them.",
    "Kemp since I was 16 years old.",
    "I've known Gov."
  ]
}