{
  "id": 2026,
  "mediaId": 65,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Georgia Senate race: Herschel Walker lands endorsement of leading anti-abortion group",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8f8af956-91ae-42ea-922b-3fe8806f0eeb/39440d72-2168-4e0b-9bd1-bbd8cde75458/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/georgia-senate-race-herschel-walker-endorsement-leading-anti-abortion-group",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    815
  ],
  "sentences": [
    "WALKER'S HAUL: FIRST TIME SENATE CANDIDATE'S FEROCIOUS FUNDRAISING\nWalker, a former professional and college football star running back who won a Heisman Trophy and helped propel the University of Georgia to a national championship, is the clear front-runner in next month's GOP Senate primary, thanks to his high name recognition in the Peach State and the endorsement he received from former President Donald Trump after announcing his candidacy last summer.",
    "Four other Republicans are running for the GOP Senate nomination in the Peach State: Georgia Agriculture Commissioner Gary Black; Latham Saddler, a businessman and former National Security Council official during the Trump administration and former Navy SEAL officer; Kelvin King, a U.S. Air Force veteran and businessman; and businessman and former State Rep. Josh Clark.",
    "They pointed to Walker's support for \"pro-life protections for unborn babies,\" his opposition to \"using tax dollars to pay for abortions,\" and his opposition to a congressional bill known as the Women's Health Protection Act, which, if passed into law, would codify the 1973 Supreme Court Roe v. Wade ruling, which effectively legalized abortion nationwide.",
    "But the National Right to Life Committee is endorsing Republican Senate candidate Herschel Walker, who has been outspoken in his support to outlaw abortion as he runs this year to challenge Democratic Sen. Raphael Warnock of Georgia in a crucial Senate showdown that could determine whether the GOP wins back the chamber's majority.",
    "The GOP needs a net gain of just one seat in November's midterms to win back the Senate majority, and they view Warnock  the pastor at the historic Ebenezer Baptist Church in Atlanta where Martin Luther King Jr. once preached  as one of the most vulnerable Democrats running for re-election this year.",
    "Warnock, who has called himself a \"pro-choice pastor,\" said during his 2020 campaign for the Senate, \"I have a profound reverence for life and an abiding respect for choice,\" He added, \"I happen to think that a patient's room is too small a place for a woman, her doctor and the U.S. government.",
    "Recent polling suggests Walker holds an enormous lead over his Republican rivals in the May 24 Republican Senate primary, and as Fox News first reported nationally last week, Walker hauled in an impressive $5.5 million during the January-March first quarter of 2022 fundraising.",
    "The National Right to Life Committee, in their endorsement of Walker, criticized Warnock for supporting the Women's Health Protection Act, and charged that the senator \"supports a policy of abortion on demand, and supports using tax dollars to pay for abortion.\"",
    "Brian Kemp, by a razor-thin margin 15 months ago in one of Georgia's twin Senate runoff elections, to serve the final two years of the term of former GOP Sen. Johnny Isakson, who resigned in 2019 due to health reasons.",
    "In a letter announcing their backing of Walker, which was shared first with Fox News on Tuesday, the group said, \"We commend you for your strong commitment to advancing pro-life policies in the Senate.\"",
    "WHAT THE LATEST FOX NEWS POLL SHOWS IN GEORGIA'S GOP RACE FOR SENATE\nBut beating Warnock in November won't be easy in a one-time red state that's become a top general election battleground.",
    "Walker's critics continue to note that as a first-time candidate, he is untested under fire on the campaign trail and has not made it clear where he stands on some key issues.",
    "The National Right to Life Committee said their \"endorsement reflects your commitment to building a culture of life in Washington and throughout our nation.\"",
    "They also raise concerns that Walker's political baggage could give Warnock and the Democrats plenty of ammunition in the general election.",
    "Warnock raked in a massive $13.6 million in fundraising during the first quarter and had $25.6 million cash on hand at the end of March.",
    "FIRST ON FOX: The nation's largest and oldest grassroots anti-abortion organization usually doesn't weigh into political primaries.",
    "Walker has run a carefully scripted campaign since jumping into the race and has refused to debate his primary rivals.",
    "I cannot understand how anyone in good conscience could proudly support abortion, especially as a pastor.\"",
    "Now more than ever, our great state and nation must stand for the rights guaranteed to us by the U.S.",
    "Highlighting the endorsement, Walker said, \"I am thrilled to be endorsed by National Right to Life.",
    "And Walker claimed that \"Warnock picks and chooses which of these he believes in.",
    "Warnock defeated Republican Sen. Kelly Loeffler, who was appointed by GOP Gov.",
    "Declaration of Independence  life, liberty and the pursuit of happiness.\"",
    "I think there's too many people in the room.\""
  ]
}