{
  "id": 2153,
  "mediaId": 305,
  "date": "d2022-04-07T10:55",
  "headline": "Herschel Walker Leads Raphael Warnock In Early Georgia Senate Poll",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/54453eb86c9924657f40a5cce1eef000.jpg",
  "link": "https://www.theroot.com/herschel-walker-leads-raphael-warnock-in-early-georgia-1848762441",
  "sentiment": "-0.616",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Murjani Rawls",
  "authorUrl": "https://www.theroot.com/author/murjanirawls",
  "termIds": [
    644,
    815,
    1136,
    1951,
    2095,
    4325,
    232,
    428,
    571,
    2672
  ],
  "sentences": [
    "Brian Kemp (R) leads Abrams by a 51 percent to 44 percent margin, and former Sen. David Perdue (R), who is mounting a primary challenge against Kemp, leads Abrams by a 49 percent to 44 percent margin.",
    "Republican Senate candidate Herschel Walker, the same one who claimed to have a COVID cure, is narrowly winning an early poll against Sen. Raphael Warnock (D-GA), according to The Hill.",
    "Some Republicans have also voiced concerns that Democrats will go after Walker over his past business practices and the fact that he has been accused of abuse by his ex-wife.",
    "Forty-five percent of registered voters in the Hill/Emerson College poll released Wednesday support Warnock, while Walker is backed by 49 percent of voters.",
    "Democrats are hopeful that Warnock's resume, including his service at Martin Luther King Jr.'s old church, could help him repeat his win this year.",
    "The Georgia Senate race is slated to be one of the most competitive during the 20202 midterms34 seats will be up for grabs across the country.",
    "The poll shows Abrams leading by substantial margins of about 40 points among Black voters, who make up about a third of Georgia's electorate.",
    "Six percent of voters remain undecided, and the Republican's lead is just outside the survey's margin of error of three percentage points.",
    "Biden's approval rating in Georgia is underwater, with 42 percent of voters approving of the job he's doing and 49 percent disapproving.?",
    "But her advantage among those voters is likely to grow, as more than a third of Black voters say they remain undecided.",
    "From The Hill:\nThe Republican candidates lead on the strength of their performance among white voters, the poll found.",
    "Stacey Abrams (D) is currently trailing her potential Republican opponents in her second bid to become governor.",
    "More than three-quarters of white voters say they would support either Kemp or Perdue over Abrams.",
    "Both Democratic candidates are said to be hurt by Biden's current approval rating in the state.",
    "Warnock won a tight race in the special election in 2021 and is seeking a full Senate term.",
    "There is also news concerning the gubernatorial race that Democrats should watch.",
    "Much of the support for each candidate is divided across racial lines.",
    "According to another Hill/Emerson College poll, Gov."
  ]
}