{
  "id": 3450,
  "mediaId": 151,
  "date": "d2022-05-17T08:31",
  "headline": "These 7 states will decide control of the Senate",
  "image": "https://www.politico.com/dims4/default/ac099c0/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fcf%2Fa4%2F2dc2217e4b5d988964e8be77a736%2F220516-fetterman-selfie-ap.jpg",
  "link": "https://www.politico.com/news/2022/05/17/seven-states-decide-senate-control-00032881",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    729,
    815,
    886,
    943,
    1136,
    1568,
    1770,
    2039,
    428,
    562,
    571,
    2818
  ],
  "sentences": [
    "Hes said that gargling mouthwash can kill Covid, Jan. 6 was a mostly peaceful protest and unvaccinated people around the world are being sent basically into internment camps.\nBut despite Johnsons hard turn to the right, Democratic and GOP consultants say this race is still a coin flip.",
    "Republican target: Nevada\nPrimary date: June 14\nForecast: Toss-up\nDespite Democrats winning streak in Nevada (Republicans havent won a presidential election here since 2004 or a Senate race since 2012), the political environment for Sen. Catherine Cortez Masto is brutal.",
    "Republican target: Arizona\nPrimary date: Aug. 2\nForecast: Toss-up\nThe GOP field is packed with candidates who will face off in the primary to take on Democratic Sen. Mark Kelly  one of the most vulnerable senators up for reelection this year  in a closely divided state.",
    "The campaign is attracting attention for all sorts of reasons: Last month, Hassan faced fierce criticism from all sides over her immigration stance; this month, shes one of the vulnerable Senate Democrats campaigning as a bulwark against abortion bans.",
    "After struggling for months, Donald Trumps pick Ted Budd built a commanding advantage over the final months of the primary  ending speculation that the former president badly miscalculated by endorsing the little-known House member.",
    "Republican target: Georgia\nPrimary date: May 24\nForecast: Toss-up\nDemocratic Sen. Raphael Warnock and Republican Herschel Walker are on a November collision course in the most closely divided state of the 2020 presidential election.",
    "What happens here in Nevada  a state that voted overwhelmingly in 1990 to codify Roe v. Wade  could also show whether Democrats can effectively channel the presumed demise of Roe into a turnaround win this November.",
    "Democratic target: North Carolina\nPrimary date: May 17\nForecast: Leans Republican\nA protracted GOP primary to replace retiring Sen. Richard Burr could set the stage for a competitive general election.",
    "Before we dive in, we invite you to join our Telegram channel, where well keep you posted with the most important updates around key races this year  with a special focus on control of the Senate.",
    "Democratic target: Wisconsin\nPrimary date: Aug. 9\nForecast: Toss-up\nGOP Sen. Ron Johnson announced hell seek a third term this year, giving Republicans a proven  if controversial  incumbent.",
    "The Republican race is the most crowded and uncertain, after self-funders Mehmet Oz and Dave McCormick joined the field (and longshot Kathy Barnette enjoyed a late surge in the polls).",
    "Both men have been outstanding fundraisers, which will help their messages break through in a state that also features one of the most competitive governors races this year.",
    "Chris Sununu decided not to challenge her, leaving a growing field of little-known Republican candidates  none of whom have demonstrated impressive fundraising abilities.",
    "State Attorney General Mark Brnovich was the GOP frontrunner for nearly a year, but he lost his lead as he struggled to articulate a clear position on the 2020 election.",
    "John Fetterman is leading the pack in his state's Democratic Senate primary, the party's best pickup opportunity in its fight to keep control of the chamber.",
    "| Mark Pynes/The Patriot-News via AP\nBy POLITICO Staff\n 05/17/2022 04:31 AM EDT\nControl of the Senate is the biggest storyline of the 2022 midterm elections.",
    "Democratic target: Pennsylvania\nPrimary date: May 17\nForecast: Toss-up\nThis is Democrats best pickup opportunity in their fight to hold on to the chamber.",
    "Democrats will be navigating their crowded primary into the late summer, meaning this race wont be set until three months before the November election.",
    "But Laxalt faces a spirited primary challenge from Sam Brown, a West Point grad and Army veteran who was severely injured in Afghanistan in 2008.",
    "The GOP frontrunner is former state Attorney General Adam Laxalt, whos been endorsed by both Trump and Senate Minority Leader Mitch McConnell.",
    "Meanwhile, Trump and Sen. Josh Hawley have both shown interest in Blake Masters, tech billionaire Peter Thiels former de facto chief of staff.",
    "Republican target: New Hampshire\nPrimary date: Sept. 13\nForecast: Leans Democratic\nDemocratic Sen. Maggie Hassan dodged a bullet when GOP Gov.",
    "But New Hampshire has a penchant for swinginess, which means it could be much more competitive than Bidens 7-point win there in 2020.",
    "Mandela Barnes is the Democratic frontrunner, while a pro-Bernie Sanders group is throwing its weight behind underdog Tom Nelson.",
    "The situations looking favorable for the GOP, but their path is filled with landmines  especially in primaries across the map.",
    "Hes been surpassed by wealthy solar power executive Jim Lamon, a self-funder who has spent $3.8 million on TV advertisements.",
    "Trump recruited Walker, a former football star, to run against Warnock after the Democrats victory in a special election.",
    "Join our Telegram channel to stay updated on the battle for the Senate and other key races from the 2022 midterms.",
    "GOP Sen. Pat Toomey is retiring, subjecting Republicans to a messy primary as they survey the Senate landscape.",
    "On the Democratic side, former state Supreme Court Chief Justice Cheri Beasley has cleared the primary field.",
    "An April poll from Suffolk University and the Reno Gazette Journal showed her losing to both GOP challengers.",
    "Here are the seven most competitive Senate races to watch that will determine control of the chamber.",
    "With Democrats holding a tight 50-50 majority, Republicans only need to net one seat to win control.",
    "John Fetterman leading the pack, along with Rep. Conor Lamb and state Rep. Malcolm Kenyatta.",
    "But Democrats havent won a presidential or Senate election in North Carolina since 2008.",
    "Johnson has become the face of Covid-19 and election conspiracy theories in the Senate.",
    "The Democratic race is smaller, with Lt. Gov.",
    "Pennsylvania Lt. Gov.",
    "Now lets get to it.",
    "Lt. Gov."
  ]
}