{
  "id": 5260,
  "mediaId": 129,
  "date": "4/7/2022 12:00:00 AM",
  "headline": "Four Opinion Writers on How the G.O.P. Fringe Took Over American Politics",
  "image": "https://static01.nyt.com/images/2022/04/07/multimedia/07roundtable_2/07roundtable_2-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/04/07/opinion/lbgt-rights-republicans.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    815,
    2095
  ],
  "sentences": [
    "And so I think one lesson to take away from this, should Joe Biden get another Supreme Court nomination, either in the next two years or if he serves another term, is that for as much as its clear that Democratic Party elites and people at the highest echelons of this stuff very much believe that a Supreme Court nominee must be someone with a lot of judicial experience, etc., etc., they should also be looking for people who would actually excite the public, who would get people interested and excited about whats going on in the court.",
    "And that this might actually, in terms of the domestic political pressures Putin faces, be making him more worried about the hard-liners who think he needs to go further, further, further and show Russian strength in the face of Western opposition rather than what our initial effort was, which was to try to get the more Westernized Russians  these oligarchs with their lofts in London  to pressure Putin to bring an end to this.",
    "Theyre reliant on their majority in the Senate  in particular on one senator, Joe Manchin, whose entire political brand kind of depends on him publicly being an obstacle to Democratic priorities, and then another senator, Kyrsten Sinema of Arizona, who seems to want to try to cultivate a kind of John McCain maverick energy, which for her also means publicly and visibly standing in the way of Democratic priorities.",
    "Theres a good case to make that Republicans can be successful at this precisely because they have this very sophisticated media apparatus: not just Fox News, but a broad constellation of outlets and different modes of delivery that allow them to, if not shape a message from its inception, then shape how its supporters receive any given message or any given piece of information.",
    "And on the other side you have this groomer thing, which is an attempt to take QAnons view  which is one reason its resonating on the far right  that all of politics is an effort by Democrats to protect pedophiles and then find some way to sort of wink, wink that youre on board with that view of politics while saying its actually a little bit about something else.",
    "But he essentially said that, oh, it means that an adult who wants to separate children from a normative sexual and gender identity to inspire confusion in them, which just reminds me of Anita Bryant in 1978, essentially arguing that homosexuals must recruit, and that all children are cisgender and heterosexual until something happens.",
    "Ezra Klein: Democrats are very taken, I think in general at the moment, with something political scientists like to call the median voter theorem, which is to say that the key thing in politics is getting to that median voter, the voter right in the middle, whos the most ideologically moderate, and convincing them.",
    "One thing I will say about the experience of Judge Jackson and her nomination and how this has all played out, is I think it is a point in favor of the argument that back in 2016 President Barack Obama made a grave mistake in nominating Merrick Garland for the Supreme Court in an attempt to find bipartisan support.",
    "Jamelle Bouie: An example of this, pulling from what weve been talking about, is if Joe Biden were to, on Friday, give a national speech  from the Oval Office, from the Rose Garden, wherever, a big national set piece speech denouncing the Republican Party as embracing gross homophobia, this would be controversial.",
    "I dont know that banning citizens of particular countries because they actually live in the countries of their citizenship, and those leaders are autocratic and there isnt the freedom to protest or do any of the things that you would think of in a democracy, is actually beneficial to the cause of freeing Ukraine.",
    "Because, again, if your litmus test for Trump has nothing to do with anything that is taking place in 2022, but all has to do with whether or not youre willing to say that Trump actually won the 2020 election \nHe is a losing one-term president who is existing interminably as a losing one-term president.",
    "I think this actually connects to our broader conversation about Democrats, which is that Democrats need to stop thinking of politics as some sort of mechanistic system in which, like, Good Input A gets you Good Result B. Its much more fluid, much more chaotic in that oftentimes you just need to swing.",
    "But one of the challenges is that there isnt something that the Boston Marathon organizers, or people who run an opera house, or people who work in the art world  theres not something they could do exactly that will in their view adequately punish the aggressions of the Russian government.",
    "And instead, the Republican Party, in part due to the incentives of modern media, in part due to the example offered by Donald Trump and how he shot to prominence and then ultimately to the presidency, has become extraordinarily attention-hungry among its rank-and-file legislators.",
    "And I think a story you could tell about conservatives over the past 10, 15, 20 years is this constant mainstreaming, this constant effort to figure out how to harness the energy of the most toxic parts of their coalition that two years earlier they were pushing to the side.",
    "But what seems to be happening, what Republicans seemed to have figured out, is that the actual popularity of the things youre saying may be a little less important than your ability to seize attention, drive conversations, create a strong impression in the minds of people.",
    "The Boston Athletic Association, which runs the Boston Marathon, announced that they were horrified and outraged? by the war, and they believe that they must do what they can to support the people of Ukraine.?\nI have a lot of thoughts about this, but Id like to hear yours.",
    "And so if you can create the next culture-war kernel by passing a really brutal piece of legislation  and these are brutal pieces of legislation that will hurt a lot of very just ordinary kids who need some help  then you can catapult to the center of the national debate.",
    "Screaming that your kids gay third-grade teacher is a pedophile or a groomer when you know that this person has been absolutely lovely to you, your child and your family  its not going to fly, I think, for most people or for people outside of this narrow bubble.",
    "He presented himself obviously as more of a moderate on economic policy, on the social safety net, which also appealed to voters who like Medicare, and like Medicaid, and like Social Security, and dont want to give those things up to vote for a Republican.",
    "Its very clear that the idea Democrats had going into 2021 was if they just delivered economic growth, and they delivered policies, and they kept their heads down and did hard work, then that would produce a public that was inclined to re-elect Democrats.",
    "That when you have someone like Judge Jackson, who looks like a perfectly lovely woman, and is obviously very qualified and obviously very successful, and you have Ted Cruz shouting about how she is friendly to criminals and child pornographers.",
    "But on the other hand, I dont see Democratic leaders really standing up and saying, this is the ground that Im going to die on, this is the hill that has to be crested, in the same way that the Republicans are on these very controversial bills.",
    "Because on the one hand, you have a Rod Dreher version of it, which is very, very Christian, Were trying to protect traditional gender roles.? Its why hes out there tweeting that Viktor Orban in Hungary is now the leader of the entire West.",
    "Not because Garland was not qualified to be on the court  although I think I have somewhat idiosyncratic views about what it means to be qualified  but because Garland didnt engender really any kind of popular support in his favor.",
    "Youre seeing this in other places, with Herschel Walker or something like that where, yes, Mitch McConnell has said that hes got his support, but there is some concern, I think, on the ground that that could be another losing race.",
    "And for the people who are only half in and out of that ecosystem  because Russian and Belarusian control over media is not absolute  whether were actually doing things that are going to make those wavering feel more nationalistic.",
    "If anything, it may encourage the view amongst the citizenry that the West is against them, that the West isnt simply against the government or to the governments actions, but actually actively against the citizens themselves.",
    "From a consequentialist perspective, we need to think a bit about whether we are creating pressure on citizens in these countries to pressure their governments, or whether we are hardening their support for their governments.",
    "But I think beyond the problem of winning elections and having a larger majority, which is just ultimately what the issue is here, I do think Democrats have adopted a faulty idea of what is going to drive political success.",
    "Having said that, I do think that Republicans are making something of a strategic mistake based on a misunderstanding of how Donald Trump was able to get into a position to win the presidency in the first place.",
    "Sort of draw the opposition into an argument and hope that youre able to frame the argument in your direction, and capture the attention of people who may just be marginally paying attention to the whole thing.",
    "Theyre going to have to choose which controversial things they say, such that Republicans and others engage on the other side, and the locus of American political conflict moves back onto ground theyve chosen.",
    "There doesnt seem to be an inclination to really just swing  to make what may sound like outlandish accusations, but that push strongly against the messaging and the rhetoric coming from the Republican Party.",
    "And recognizing that they live in highly censored, highly manipulated media ecosystems, I think we have to be pretty thoughtful about whether were just giving grist to their leaders to manipulate them more.",
    "But I think that one way to think about the asymmetry, or maybe the inversion of the two sides right now, is that Republicans know how to get attention, but they dont know how to be strategic about it.",
    "But if they decided to actually try, which is something Chuck Schumer wants them to do, something Elizabeth Warren wants them to do, that would be controversial enough that it would reshape the agenda.",
    "The people who are paying super close attention almost, by definition, have already made up their minds, otherwise they would not be paying such close attention because they wouldnt care that much.",
    "This is a point where the traditional Christian conservative coalition is finding a way to meet the QAnon energy and come up with this strange \nJane Coaston: Its a secular fundamentalist religion.",
    "I think weve seen over the last couple of days, some social conservatives who essentially argue that bills like in Florida, which keep being posited as being about sex ed  they arent about sex ed.",
    "Theres a very big difference between strategically trying to win over a population and just trying to punish a country because it at a certain point just feels like we need to keep punishing.",
    "Ezra Klein: I want to add something also to that, that Janes comments jogged for me, because one of the dangers is the composition and motivating energies of the Republican coalition.",
    "I mean, to coin a term here  Im in California, so theres a fair amount, or was a fair amount, of Woo-Anon out there, like yoga-doing QAnon followers  but this is Trad-Anon,? right?",
    "Lulu Garcia-Navarro: Jane, I want to think about this idea of unpopularism, that the Democrats, as Ezra says, are not wanting to push something that might not have broad support.",
    "It is important to note that Democrats want him to be more influential than he actually is because he is a major vote-driver for Democrats, as weve seen in Georgia and elsewhere.",
    "For people who are troubled by trans rights, and specifically the rights of trans kids, I think that youre seeing a lot of people who are like, Oh, youre just being homophobic.",
    "Lawmakers in Ohio this week proposed legislation that would restrict discussion of sexual orientation and gender identity in schools, borrowing from Floridas Dont Say Gay? law.",
    "I went back to some old Times pieces talking about the Southern Baptist Conventions boycott of Disney, because Disney started offering same-sex health care benefits in 1995.",
    "I think the Democratic Party is having a hard time figuring out exactly how to go about pushing against this stuff because it runs into this theory of the case they have.",
    "And I broadly support the sanctions, despite the tremendous pain theyre causing, because I do think that they are creating pressure in the long-run for Putin to end this.",
    "You can only believe what you can believe in it, but that there is rising support for Putin, that there is a rising belief that the entire West is arrayed against Russia.",
    "I will neer sin no more!?\nI think that there is an element to so much of our politics, especially on foreign policy, where weve got the we got to do something? impulse.",
    "The Boston Marathon announced this week that Belarusian and Russian citizens who reside in those countries are not allowed to run in the race as a response to the war.",
    "And that requires you to have not just a theory of what it is voters will find popular, but what it is that they will talk about, what it is the media will talk about.",
    "But I think connecting the peoples passions and their enthusiasms, can be much more successful than trying to be openly and outwardly and ostentatiously respectable.",
    "Jamelle Bouie: I largely agree that this is an attempt to do something like what Trump did: capture attention, generate energy amongst ones most fervent supporters.",
    "slammed her in the hearings with a lot of partisan attacks about C.R.T., asking her to define what a woman is and QAnon-adjacent questions about child pornography.",
    "American politics would be seized by arguments over whether or not canceling student loan debt is a good idea, and that might be territory more favorable to them.",
    "And so at a time when theres a lot of tailwinds for them, they are nevertheless pulled along by the more extreme and attention-driven members of their own caucus.",
    "The thing that strikes me about these Republican bills is that theyre staking ground on some things that are not necessarily popular with the majority of voters.",
    "Although, I will say that the point of Joe Biden is that he was going to be good at negotiating with egotistical, hard-to-deal-with members of the U.S. Senate.",
    "The Times columnists Jamelle Bouie and Ezra Klein join the Times Opinion podcast hosts Jane Coaston and Lulu Garcia-Navarro to discuss these and other issues.",
    "Youre very upset about gay and lesbian kids, gay and lesbian parents.? Thats something that we keep needing to relearn: that there is no part of the L.G.B.T.",
    "But I feel like sometimes when were talking about Democratic strategy, its like, if only they would run the offense we think they should run, they would win.",
    "But I do think it seems to be targeted at a very small group of people  as you said, it was Belarusian and Russian citizens who do reside in those countries.",
    "But Belarusian and Russian citizens who dont reside in those countries will be allowed to run, but theyre not going to recognize their affiliation or flags.",
    "And so he both leveraged and utilized nativism, and racism, and these sorts of things, but he also presented himself as pretty liberally minded on L.G.B.T.",
    "But banning the citizens, like Jane said, it seems like just doing something for the sake of doing something, and it doesnt really seem very constructive.",
    "And I think that the Republican politicians, Republican officials, they may be generating a lot of fervent enthusiasm amongst their strongest supporters.",
    "Lulu Garcia-Navarro: Jamelle, I want to ask you this, though, because weve been talking a lot about the G.O.P., but what can be said about the Democrats?",
    "But to this broader point youre making, and to something Jamelle said, the Democratic leaders have had a theory that theyre going to push popular bills.",
    "If Cal Cunningham in North Carolina had won, if Susan Collinss opponent in Maine had won, wed be looking at a very different situation than we are now.",
    "It doesnt even seem like it was particularly well thought-out, like anyone was thinking about what you actually are trying to accomplish by doing this.",
    "If you want to go as far as to say, you cant fly the flag, I actually think thats probably fair because the flag is a symbol of the government as well.",
    "But I dont know that doing things that actually target Russian citizens  without any obvious mechanism for pressuring the regime  makes a lot of sense.",
    "But as to Trump, I think what youre going to see is actually a decline in his influence, because he absolutely will not move on past the 2020 election.",
    "I think that for ordinary people who arent paying super close attention  theyre really just taking in images and impressions  it just looks ridiculous.",
    "But the idea is that if you simply do not ever let people know that there is such thing as gay or trans people, then people will not be gay or trans.",
    "Rod Dreher, the conservative writer said that, oh, no, no, when were talking about grooming, were not talking about pedophiles  which is ridiculous.",
    "But I also think that for as much as Trump held a Pride flag and made some bones out of performatively not caring about the debate? about L.G.B.T.",
    "And if you get that 50 percent plus one, or maybe you correct for the Senate bias, or its 55 percent plus one  whatever it might be  then you win.",
    "And at some point, if they want to do anything differently than that, theyre not just going to have to choose which popular things they say.",
    "I think that a lot of folks on the left and critics of Democrats underrate the importance of ideology and policy positioning in politics.",
    "They nominate the guy who is leading the birther charge a few years after most of the more sober politicians are pushing it to the side.",
    "Every Republican could spend the next couple of months just saying, Huh, gas prices are pretty high, arent they?? And that would be it.",
    "Its the latest in a raft of culture-war legislation in Republican statehouses aimed against abortion, transgender rights, L.G.B.T.Q.",
    "Ezra Klein: So, one, I dont think that its the national Republicans who are trying to make the controversial bills the center of it.",
    "I think that theres a good chance that at the end of this year they win in the midterms having an entirely different messaging set.",
    "They seem to be letting their poor relationship with Manchin simply deteriorate when they need to be figuring out how to fix it.",
    "And so I think that youre seeing a lot of Republicans who are like, Can we move on, can we move on,? and Donald Trump will not.",
    "Lulu Garcia-Navarro: Trumps influence is solidified in one very particular place, and thats on the conservative Supreme Court.",
    "I think its worth remembering that the process to enter or qualify for the Boston Marathon started for many people a year ago.",
    "That would seem to suggest to me that theres political risk in doing them, but instead these laws have been copied from G.O.P.",
    "Lulu Garcia-Navarro: I want to pivot to a piece of news that is less domestic culture wars, and more of a global culture war.",
    "Because we have him endorsing a lot of candidates, including Sarah Palin for Congress this week, targeting some major G.O.P.",
    "And youre seeing with his endorsements in the upcoming cycle  actually a number of his endorsements arent doing very well.",
    "It wasnt so long ago that same-sex marriage was legalized in this country, and it seemed that things had turned a corner.",
    "Jamelle Bouie: We should take away from that that these attacks are not some sort of, pardon the expression, trump card.",
    "And no matter what Republicans want him to say or want him to do, he will not be on any party line that is not his own.",
    "But the Republican Party doesnt have that kind of control over its own structure and its own institutional members now.",
    "Lulu Garcia-Navarro: You all seem to agree on this fundamental point that theres a great deal of danger for the G.O.P.",
    "And how should we regard Trump as a force in politics, a force in society  and, I guess, are those two the same thing?",
    "Vladimir Putin is not going to be like, Oh, no, a Russian citizen was not able to run a 2:03 at the Boston Marathon.",
    "is having now is that theyve got this wave of people who are just screaming, OK, groomer,? at literally any L.G.B.T.",
    "And then theres inflation, which theyre also really struggling with and to some degree bear some responsibility for.",
    "Jane Coaston: I mean, I want to be clear here because I dont think that the danger is not to the Republican Party.",
    "Were totally fine with everything like that.? That might have been how it was parlayed, but that was never true.",
    "Because what is always fascinating to me is that you have Democrats that have policies that enjoy broad support.",
    "You are either running for a charity or you have a time in another marathon that qualifies you to run in Boston.",
    "It would reorient things toward talking about these issues on ground that might be more favorable to Democrats.",
    "And every two years you think they cant possibly be worse at not keeping out the worst elements of their party.",
    "Meanwhile, Democrats are struggling to advance a national agenda amid spiraling inflation and energy prices.",
    "He himself presented himself as, Im a New York libertine, so of course I have no problem with the L.G.B.T.",
    "And I think broadly speaking, Joe Bidens been doing a good job, with the exception of occasional ad-libs.",
    "So on the specifics of this, I think whatever Jane thinks, and everything she said sounded correct to me.",
    "And so I think how he should be considered is, he is an angry man who wont move on and who wont go away.",
    "And so I think this picture would look very different if there was one more or two more senators, right?",
    "strategy aside, these laws are having real-world consequences, as Ezra said, that will be hard to undo.",
    "To go back to what weve been talking about, I think that something similar may happen with these bills.",
    "Their conversation, recorded Thursday morning, is available in the audio file and the transcript below.",
    "And that is, Trump  as much as he calibrates anything  calibrated the kinds of offense that he caused.",
    "But I think that part of this is because these issues have to do, one, with a conceit of what L.G.B.T.",
    "And so you need to do things that dont just control the agenda but actually echo through the country.",
    "Donald Trump will talk about how, oh, Ron DeSantis is fine, but I would absolutely beat him in 2024.",
    "Those are the sorts of nominees they should be looking for and putting forth and putting in public.",
    "And that makes people much more willing to buckle down in her defense than they would otherwise be.",
    "And what I would say for the Trumpist Republican Party is it mostly doesnt have a theory of policy.",
    "Ezra Klein: I have a hard-and-fast rule that on any sports story I just think whatever Jane thinks.",
    "One is to think about what you might imagine as the modal Republican strategy for a year like this.",
    "And then youre having National Review articles, like, Maybe dont say that?? And no ones listening.",
    "And I do worry about a sense of resignation that has set in at the White House around Joe Manchin.",
    "And the thing about the voters you need to reach is theyre often not paying super close attention.",
    "But the flip side of that, to what Jamelle is saying, is that you have to reach the median voter.",
    "So Russian and Belarusian citizens who live in their countries cannot run in the Boston Marathon.",
    "Even if that nominee may fail, the mere fact of generating that enthusiasm is an important thing.",
    "I think what Jackson has in her favor is simply that shed be the first Black woman on the court.",
    "And yet, in polling, people said that they hated the attacks, and she has a majority of support.",
    "And Im worried about some of the news I hear and some of the polling I see coming out of Russia.",
    "And agenda control in American politics comes from courting, choosing, engaging in controversy.",
    "Lulu Garcia-Navarro: So youre saying that maybe these very controversial things that the G.O.P.",
    "stuff got in the Virginia gubernatorial race, later analysis suggests that it wasnt the C.R.T.",
    "But it seems like the Democrats cant seem to get traction on things that enjoy broad support.",
    "They seem to me to be in a fundamentally quite reactive place right now \nJamelle Bouie: Yes.",
    "It has a middling theory of politics, and it is overwhelmed by its own theory of attention.",
    "For something to dominate the news, it needs the energy of not just support but opposition.",
    "rights, even though that his likely appointments and nominations were not going to be that.",
    "But its unclear to me whether this is going to really make an impact with voters at large.",
    "And, look, I want to punish Putin and those behind this war in every way that is possible.",
    "And they show you, no, no, no, no, theyre going to bring those people into the core, too.",
    "What they are not doing is the other side of populism, which I think of as unpopularism.",
    "Ezra Klein:  responding to world events, responding to every months economic news drop.",
    "Ezra Klein: So I think there are a couple of levels you can think about these bills on.",
    "I want to bring her into this because it actually fits into what weve been discussing.",
    "Countries live or fall on how well they police the fringes in their political parties.",
    "Its not as if like, Trans rights went too far, but were totally fine with gay couples.",
    "I guess I just keep thinking, like, I saw the movie Mannequin? once when I was a kid.",
    "I mean, in terms of getting policies through Congress, they just dont have the votes.",
    "The reason the Democrats cant pass bills is they dont have enough votes to pass them.",
    "Jane Coaston: I personally think that this is not quite like freedom fries territory.",
    "Say that government officials cant participate, they cant watch, they cant be there.",
    "And today, a big win for Democrats  the confirmation of Judge Ketanji Brown Jackson.",
    "They did not get Build Back Better passed, and now the child tax credit is expiring.",
    "Lulu Garcia-Navarro: Its kind of like applying the attention economy to legislation.",
    "people, thats not to say that people within the conservative caucus stopped caring.",
    "There are things that Joe Biden could do that would have that internal electricity.",
    "Its QAnon, but theyve taken  you dont hear talk about traditional marriage anymore.",
    "I do not myself understand what fights Democrats want the 2022 election to be over.",
    "Times Opinion audio produced by Lulu Garcia-Navarro, Alison Bruzek and Phoebe Lett.",
    "Audience strategy by Shannon Busta, and editorial support from Kristina Samulewski.",
    "And I think that the arguments over these bills are actually a good example of it.",
    "This is the caravan, but even more so because this has been going on for 50 years.",
    "I mean, I live in Virginia, and we just had our gubernatorial election last year.",
    "So birtherism is a relatively fringe movement that becomes the core of the party.",
    "And I see no indication that Democratic leaders are even thinking in those terms.",
    "And I am wondering about what you see his role is coming up in the 2022 midterms.",
    "So I worry that our view of this has, without anybody noting it, kind of flipped.",
    "And Democrats know how to be strategic, but they dont know how to get attention.",
    "And I dont think theres some kind of grand strategic plan happening over there.",
    "Theyre going to try to pass those bills and theyre going to try to run on them.",
    "And also, Youngkin ran on lowering the grocery tax and increasing teacher pay.",
    "I would like to see more constant efforts at trying than Im currently seeing.",
    "And so this is just one of the dimensions of it that I find really unnerving.",
    "And it may prompt people to double down in their support for the government.",
    "bills in Florida and elsewhere are dominating the news in the way they are.",
    "They tried to run using it to generate more momentum for Build Back Better.",
    "So, bread-and-butter issues are what helped attract a lot of voters to him.",
    "Lulu Garcia-Navarro: But Ezra, I want to ask you this about the Democrats.",
    "The Times is committed to publishing a diversity of letters to the editor.",
    "Jane Coaston: I know that Im probably the only extreme sports fan on here.",
    "Theres what I would want them to do, and I dont know if it would work.",
    "But they cant seem to get their agenda passed while they are in power.",
    "Ezra Klein: I think that Jamelle gets that right, on both the levels.",
    "is enacting are kind of a sideshow to what really matters for voters.",
    "Ezra Klein is the host of The Ezra Klein Show? and a Times columnist.",
    "And we may not be creating the incentive system that we had hoped to.",
    "And this maybe goes to a big through line of this whole conversation.",
    "So I dont think Mitch McConnell wants to be having this conversation.",
    "Fact-checking by Kate Sinclair, Mary Marge Locker and Alex Ellerbeck.",
    "I actually dont know what Democrats should do or what would be best.",
    "OK. That doesnt put any pressure on the leaders of those countries.",
    "Theres no mention of sex education or sexual activity in that bill.",
    "It was traditional kind of midterm backlash to the party in power.",
    "And at least from my reporting, what I can tell, Im not seeing it.",
    "Wed like to hear what you think about this or any of our articles.",
    "But of course, there is someone who loves to do that a lot: Trump.",
    "incumbents who have stood up to him, like Lisa Murkowski and Gov.",
    "Im going to start with Jane, as I know youre a sports aficionado.",
    "And this, OK, groomer? stuff, this is the mainstreaming of QAnon.",
    "I dont think Kevin McCarthy wants to be having this conversation.",
    "Brian Kemp of Georgia, all the while still peddling the big lie.",
    "So its like, the agenda is now Russia, which is a world event.",
    "You dont hear talking about sincerely held religious beliefs.",
    "Original music by Carole Sabouraud and mixing by Isaac Jones.",
    "And the Republican Party is so unbelievably bad at doing it.",
    "I dont know that they think thats a good idea at the moment.",
    "But Im interested in, Jamelle, your thoughts, and then Ezra.",
    "Lulu Garcia-Navarro: I have to say, Jane, I agree with you.",
    "are trying to mainstream, and where do you think its going?",
    "I saw Kim Cattrall and that was it, I was off to the races.",
    "I think they want to talk about how Joe Biden is a failure.",
    "You need to aim at peoples passions and see what happens.",
    "It makes no real conceptual sense why you would do this.",
    "He will put out very bad failing social media networks.",
    "Jane Coaston: Well, I mean its because we live in hell.",
    "and over the age of 30, this all seems very repetitive.",
    "And I dont think Democrats have really been doing that.",
    "But it is interesting how repetitive this strategy is.",
    "Youre yelling at teachers who mention that theyre gay.",
    "Lulu Garcia-Navarro: Ezra, Im going to start with you.",
    "Ezra noted that one of the challenges that the G.O.P.",
    "Just another boring guy you put on the Supreme Court.",
    "How much influence do you see him having these days?",
    "Lulu Garcia-Navarro is a Times Opinion podcast host.",
    "What I do think is that the real risk is to L.G.B.T.",
    "It mentions sexual orientation and gender identity.",
    "Jamelle Bouie: I think there are a few things here.",
    "I think its important to be very clear about this.",
    "Jane Coaston is the host of The Argument? podcast.",
    "You do not just decide to run the Boston Marathon.",
    "Special thanks to Lauren Kelley and Patrick Healy.",
    "And Im trying to think, what is this going to do?",
    "And now theyve fundamentally lost agenda control.",
    "community thats OK for some social conservatives.",
    "So, Jamelle, what should we take away from that?",
    "Why do you think thats happening, in your view?",
    "Why do you think this is the issue the G.O.P.",
    "They just do not have a theory of attention.",
    "Democrats have a lot of theories of policy.",
    "Jane, I want you to jump in, because G.O.P.",
    "Its not a messaging problem, fundamentally.",
    "The following conversation has been edited.",
    "They have to hear what it is youre saying.",
    "And heres our email: letters@nytimes.com.",
    "This is not the RFRA fight of 2015, 2016.",
    "stuff that drove Glenn Youngkins victory.",
    "They have a lot of theories of politics.",
    "Our executive producer is Irene Noguchi.",
    "I think that for anyone who is L.G.B.T.",
    "And for as much attention as the C.R.T.",
    "This is QAnon, but an areligious QAnon.",
    "And that theory basically has failed.",
    "They passed the American Rescue Plan.",
    "They could cancel student loan debt.",
    "in pushing these culture-war issues.",
    "Jamelle Bouie is a Times columnist.",
    "So it just seems counterproductive.",
    "And I think its kind of repulsive.",
    "Theyre still mad about Obergefell.",
    "Ezra Klein: Well, its both, right?",
    "They cant do anything about that.",
    "They are still mad about Bostock.",
    "He is physically unable to do so.",
    "And there is some truth to that.",
    "I think this was a real misstep.",
    "So I want your thoughts on this.",
    "Jamelle, what are your thoughts?",
    "rights and critical race theory.",
    "I mean, one thing is the G.O.P.",
    "Jamelle Bouie: I dont disagree.",
    "That makes people enthusiastic.",
    "But it would seize the agenda.",
    "Thats why some of these G.O.P.",
    "people as a danger once again.",
    "I mean, it is a numbers game.",
    "Youre seeing this in Georgia.",
    "They would win the midterms.",
    "There really are moderates.",
    "It was a very popular bill.",
    "people are and how L.G.B.T.",
    "people and to see L.G.B.T.",
    "And it seems unconvincing.",
    "No one was excited by him.",
    "Lulu Garcia-Navarro: Ezra?",
    "And that excites people.",
    "People would get upset.",
    "person on the internet.",
    "people become L.G.B.T.",
    "Its as simple as that.",
    "and what theyre doing.",
    "He will do interviews.",
    "statehouse to G.O.P.",
    "Here are some tips.",
    "rights and L.G.B.T.",
    "Issue a statement.",
    "Because the G.O.P.",
    "It would be done.",
    "Maybe itll work.",
    "And that was it!",
    "Of course it is.",
    "It just did it.",
    "Maybe it wont.",
    "He cant do it.",
    "It falls flat.",
    "statehouse.",
    "community.",
    "Condemn."
  ]
}