{
  "id": 5441,
  "mediaId": 124,
  "date": "3/28/2022 12:00:00 AM",
  "headline": "Midterm environment looks more like 2010 than 2018 in NBC News poll",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1120w,f_auto,q_auto:best/rockcms/2022-03/Screen-Shot-2022-03-28-d10a25.jpg",
  "link": "https://www.nbcnews.com/politics/meet-the-press/midterm-environment-looks-2010-2018-nbc-news-poll-rcna21795",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    769,
    815,
    946,
    1097,
    1147,
    2087,
    2095,
    2347,
    348,
    545,
    2672,
    2959
  ],
  "sentences": [
    "For his part, Perdue is embracing Trumps false claims about the 2020 election, telling the crowd Saturday night that in Georgia our elections in 2020 were absolutely stolen.?\nElsewhere on the campaign trail:\nNebraska 01: Republican Rep. Jeff Fortenberry is resigning from Congress at the end of the month after being convicted on campaign-finance related charges.",
    "Finally, and perhaps most importantly, our NBC News poll shows Republicans with a whopping 17-point advantage in enthusiasm, with 67 percent of Republicans indicating a high level of interest in the midterms (either a 9? or 10? on a 10-point scale), compared with 50 percent for Democrats.",
    "Jackson had the lowest name identification rate of all recent Supreme Court nominees since 2005, except for now-Attorney General Merrick Garland, who was nominated to the court in 2016 but was not confirmed (and didnt even receive a hearing from the Republican-controlled Senate).",
    "Kay Ivey is out with a folksy new spot that rattles off her work on a bunch of red-meat, base issues like sending troops to the Southern border, promoting pro-life legislation, banning critical race theory and opposing vaccine mandates.",
    "Their work is so much more important than Gibbons just making millions for himself.?\nIn a video response to the ad posted to Twitter, Gibbons highlighted his sons military service and accused Mandel of going too far? with the ad.",
    "Republicans hold a 2-point advantage among registered voters, with 46 percent preferring a Republican-controlled Congress, versus 44 percent who want Democrats in charge, which is well within the polls margin of error.",
    "Other numbers you need to know today:\n20 percent: Thats the new, proposed, minimum tax rate on households worth more than $100 million in the Biden administrations new budget, which is being released later today.",
    "22,000: The number of unionized dock employees out West who could strike if their contract isnt renewed by the end of June, a possibility that could add new difficulties to the countrys supply-chain issues.",
    "Thats the percentage of Americans surveyed in the latest NBC News national poll who said they support Judge Ketanji Brown Jacksons nomination to the Supreme Court, while 17 percent oppose it.",
    "Maryland Redistricting: A Maryland judge ruled Friday that the states new congressional map was unconstitutional, becoming the first Democratic-drawn map to be struck down in court this year.",
    "Former Ohio Treasurer Josh Mandel is out with a new ad attacking investment banker Mike Gibbons and accusing him of diminishing his military service in an altercation at a candidate forum.",
    "Former President Donald Trump traveled to Georgia over the weekend to rally his supporters around his preferred candidates, including former Sen. David Perdue, who is challenging GOP Gov.",
    "In the ad, a Gold Star mother tells viewers, Mike Gibbons has the nerve to say military service doesnt count,? before she goes on to talk about her sons service in the U.S. Marines.",
    "But first: At initial glance, the generic-ballot result in our NBC News poll doesnt seem that bad for Democrats, despite all the other rough numbers in it for Biden and the party.",
    "Republicans are ahead among independents by double digits; the GOP has a larger lead with men than Dems do with women; and white voters have gone from R+5 in 2018 to R+17 now.",
    "Former President Trump and his two sons agreed to sit for a deposition in a lawsuit from investors claiming they were tricked into making bad investments.",
    "1 in 8: Thats how prevalent political ads about inflation were between Jan. 1 and March 20, per an analysis of AdImpact data by the Wall Street Journal.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\n981,853: The number of deaths in the United States from the virus so far.",
    "Whats more, the NBC News poll shows a midterm environment that looks a lot more like 2010 (when the GOP won the House) than 2018 (when Democrats did).",
    "Ukrainian President Volodymyr Zelenskyy says hes open to considering neutrality in the negotiations to end the war with Russia as quickly as possible.",
    "The gubernatorial race is a key test of Trumps sway over GOP voters, but Perdue has still trailed Kemp in recent polls, NBCs Jonathan Allen reports.",
    "80,143,022: The number of confirmed cases of coronavirus in the United States, per the most recent data from NBC News and health officials.",
    "Dont forget: Enthusiasm ends up mattering more in a midterm environment when turnout is considerably less than in a presidential contest.",
    "Louisiana Governor: The Advocate is reporting that sources say Republican Sen. Bill Cassidy is considering a run for governor next year.",
    "Going back to 2006, the party with a double-digit edge in enthusiasm in our survey  or close to it  has made substantial midterm gains.",
    "NBC News poll: Biden hits lowest disapproval number yet\nMarch 27, 202201:39\nBut that R+2 result doesnt tell the whole midterm story.",
    "The Utah legislature overrode their governors veto on a bill that would ban transgender students from playing girls sports.",
    "The New York Times has a deep dive into West Virginia Democratic Sen. Joe Manchins ties to the coal industry.",
    "Youre desperate, youre flailing, but that doesnt mean you get to lie to the voters of Ohio,? Gibbons added.",
    "For starters, the R+2 showing is the GOPs best score on congressional preference in our poll since 2014.",
    "The mother also says, Marines like Josh Mandel, like my son, Andy, risked their lives for our country.",
    "The White House and Democrats clarify Bidens this man cannot remain in power? ad-lib aimed at Putin.",
    "A majority of those surveyed  56 percent  didnt recognize her name or werent sure how to rate her.",
    "He added that at the forum, he only noted Mandels lack of experience in the private sector.",
    "... Rep. Jeff Fortenberry, R-Neb., is resigning from Congress after conviction.",
    "Thats the highest net support rating of any Supreme Court nominee since 2005.",
    "But Jackson is also less well known than other recent Supreme Court nominees.",
    "... New NBC News poll shows Bidens approval rating falling to 40 percent.",
    "WASHINGTON  If its Monday ... President Biden unveils his FY2023 budget.",
    "The two are frontrunners for the Republican nomination for U.S. Senate.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "... Trump stumps for David Perdue in Georgia Governor.",
    "And you remember what happened in the 2014 midterms.",
    "Legislators have until Wednesday to draw new lines.",
    "The resignation will trigger a special election.",
    "Brian Kemp, and Senate hopeful Herschel Walker.",
    "Alabama Governor: Alabama Republican Gov.",
    "... And the slap seen around the world.",
    "I get it, Josh.",
    "..."
  ]
}