{
  "id": 5466,
  "mediaId": 129,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Primaries Show Limits, and Depths, of Trumps Power Over G.O.P. Base",
  "image": "https://static01.nyt.com/images/2022/05/18/multimedia/18pol-trump-photo01/18pol-trump-photo01-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/18/us/politics/trump-gop-base-primaries.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    3102,
    3103
  ],
  "sentences": [
    "The so-called MAGA movement is a bottom-up movement,? Mr. Spain said, not one to be dictated from the top down.?\nThe primaries arent the first time conservative voters in Mr. Trumps red-capped constituency have demonstrated their independence from the patriarch of the Make America Great Again movement.",
    "The tumultuous start to the Republican primary season, including a down-to-the-wire Senate race that divided conservatives in Pennsylvania on Tuesday, has shown how thoroughly Donald J. Trump has remade his party in his image  and the limits of his control over his creation.",
    "In January, some of the most influential voices in Mr. Trumps orbit openly criticized his pick for a House seat in Middle Tennessee, Morgan Ortagus  who had served in the Trump administration for two years as State Department spokeswoman but was deemed insufficiently MAGA.",
    "Outside Ms. Barnettes election night party on Tuesday, Diante Johnson, a Republican activist and the founder and president of the Black Conservative Federation, said she was proud of how the conservative author and commentator fought against the party powers that be.",
    "I didnt even see Lou Barletta fighting for it.?\nChris Christie, who is also believed to be considering a presidential campaign in 2024, suggested the results of the primaries so far demonstrate a desire to move on from the baggage that Mr. Trump imposes on the party.",
    "The late surge from Ms. Barnette, who portrayed herself as a higher-octane version of Mr. Trump, eroded support for Dr. Mehmet Oz, the longtime television personality whom Mr. Trump endorsed, from conservatives who questioned his political credentials.",
    "In some contested races, his endorsement has proved to be hugely influential, as it was in North Carolinas Senate primary on Tuesday, where Representative Ted Budd cruised to victory against a former governor and a former congressman.",
    "Even though he was elected in part as a deal-making political outsider  he had spent much of his adult life toggling between political parties  he rarely made a significant decision without considering how his base would react.",
    "But people feel they can love him and intend to follow him into another presidential run  and not agree with all of his choices this year.?\nStill, Republican candidates remain desperate to win Mr. Trumps endorsement.",
    "In each of the most contentious primary races this month  including two closely watched contests next week in Alabama and Georgia  nearly every candidate has run a campaign modeled on the former presidents.",
    "Every Trump establishment individual that came after her, she stood there and fought.?\nMs. Barnettes rise stunned Mr. Trump, who never considered the possibility of endorsing her candidacy, advisers said.",
    "In Senate contests in Ohio (where his pick won earlier this month) and Pennsylvania (which remained too close to call Wednesday morning), roughly 70 percent of Republicans voted against his endorsement.",
    "While Mr. Trump has indicated he is inclined to run for president for a third time in 2024, some advisers said the volatile and intensely fought primaries have risked alienating some of his supporters.",
    "But the emergence of an autonomous wing of the MAGA movement  one that is more uncompromising than Mr. Trump  has allowed even candidates without Mr. Trumps endorsement to claim the mantle.",
    "Those instincts prevented him from reaching a significant deal with Congress over immigration policy and fueled battles with Democratic leaders that led to repeated government shutdowns.",
    "Tony Fabrizio, a pollster who has worked with Mr. Trump for several years, described the early contests as a jumble, providing no single insight into what Mr. Trumps backing has meant.",
    "Mr. Trump criticized Mr. Barletta for losing a 2018 Senate bid and not fighting harder to back the former presidents bogus claims that Democrats stole the 2020 presidential election.",
    "Trumpism is ascendant in the Republican Party, with or without Mr. Trump, said Ken Spain, a Republican strategist and former National Republican Congressional Committee official.",
    "In the Pennsylvania governors race, Mr. Trump backed Doug Mastriano last week over Lou Barletta, a former congressman who was an early supporter of Mr. Trumps 2016 campaign.",
    "Theres no obvious heir apparent when it comes to America First  its still him,? said Kellyanne Conway, Mr. Trumps 2016 campaign manager and White House counselor.",
    "But the former president hasnt called Jim Pillen, the Republican nominee for governor in Nebraska who beat Mr. Trumps preferred candidate, Charles W. Herbster.",
    "The other time that happened was when Herbert Hoover was president.?\nOther Republicans caution against reading too much into Mr. Trumps endorsement scorecard.",
    "Only a handful of seats will determine if Democrats maintain control of the House over Republicans, and a single state could shift power in the 50-50 Senate.",
    "As a result, Mr. Oz was running neck-and-neck with David McCormick, the hedge fund executive who had withstood a flurry of criticism from Mr. Trump.",
    "In August, at one of Mr. Trumps largest post-presidential campaign rallies, the crowd booed after he urged them to get vaccinated against Covid-19.",
    "This years races could tip the balance of power in Congress to Republicans, hobbling President Bidens agenda for the second half of his term.",
    "Where in the hell is the loyalty?? said former Representative Tom Marino, another early Trump 2016 supporter, at a campaign rally last week.",
    "Republican voters distrust of authority and appetite for hard-line politics  traits Mr. Trump once capitalized on  have worked against him.",
    "These mini-rebellions have tended to flare up whenever Mr. Trumps supporters view his directives or endorsements as not Trumpy enough.",
    "What I think the majority of these primaries are going to tell you is that the party wants to go back to winning,? Mr. Christie said.",
    "Long known for being dialed into his voters, Mr. Trump increasingly appears to be chasing his supporters as much as marshaling them.",
    "This year, a lot of seats are up for grabs, including all 435 House seats, 35 of the 100 Senate seats and 36 of 50 governorships.",
    "His fear of appearing weak to his base voters drove his decision to not wear a mask in public for months into the pandemic.",
    "Some have come to see the president they elected to lead an insurgency as an establishment figure inside his own movement.",
    "Similarly, Dr. Ozs previous support for abortion rights was an impediment with Pennsylvania conservatives in the base.",
    "Midterms take place two years after a presidential election, at the midpoint of a presidential term  hence the name.",
    "MAGA does not belong to President Trump,? Kathy Barnette said during a Pennsylvania Senate primary debate in April.",
    "Candidates endorsed by Mr. Trump lost governors races in Idaho and Nebraska, and a House race in North Carolina.",
    "In contests next week, his chosen candidates for Georgia governor and Alabama senator are trailing in polls.",
    "As president, Mr. Trump governed in a constant state of concern about tending to his supporters.",
    "And in North Carolina, it is the perfect harmony of no never-Trump or ideological deficiencies.?",
    "In Ohio, about 718,000 Republicans voted for someone other than the Trump-endorsed victor, J.D.",
    "Here are 10 races to watch in the House and Senate, as well as several key governors contests.",
    "In Ohio, it was a test of Trump papering over never-Trump deficiencies,? Mr. Fabrizio said.",
    "Each race was shaped by the candidate, the rivals and the politics of the state, he said.",
    "In Georgias Senate race, Mr. Trumps support for Herschel Walker kept serious rivals away.",
    "They promote his policies, and many repeat his false claims about election fraud in 2020.",
    "Understand the 2022 Midterm Elections\nCard 1 of 6\nWhy are these midterms so important?",
    "But Mr. Trumps power over Republican voters has proved to be less commanding.",
    "In Pennsylvania it is a test of Trump papering over ideological deficiencies.",
    "In Ohio, Mr. Vances history of criticizing Mr. Trump made voters skeptical.",
    "Between 2018 and 2020, we lost the House, the Senate and the White House.",
    "Advisers have urged Mr. Trump to make amends with former primary rivals.",
    "They will also test former President Donald J. Trumps role as a G.O.P.",
    "My loyalty is to a guy that was in there fighting,? Mr. Trump said.",
    "Loyalty to what?? Mr. Trump shot back in an interview on Monday.",
    "The knife came to her and she didnt back up,? Ms. Johnson said.",
    "Their websites and advertisements are filled with his images.",
    "Thats the second time thats happened in our partys history.",
    "But his bases increasing autonomy should surprise no one.",
    "In North Carolina, however, Mr. Budd was a better fit.",
    "Heres what to know:\nWhat are the midterm elections?",
    "Still, Mr. Oz held about one-third of the vote.",
    "And Mastriano was the guy that was fighting.",
    "And there is plenty of dust still to settle.",
    "What are the races to watch?",
    "kingmaker.",
    "Vance."
  ]
}