{
  "id": 6143,
  "mediaId": 136,
  "date": "d2022-04-26T16:51",
  "headline": "Trump Sparking Fights in MAGA World With These Endorsements",
  "image": "https://d.newsweek.com/en/full/2026344/trump-endorsements-criticized-maga-world.webp?w=790&f=a8ae93b66609438235e65602362427fb",
  "link": "https://www.newsweek.com/trump-sparking-fights-maga-world-these-endorsements-1701120",
  "sentiment": "-0.375",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    815,
    1147,
    2475,
    3103,
    428,
    2537,
    2845
  ],
  "sentences": [
    "Oz is the antithesis of everything that made Trump the best president of my lifetimehe's the farthest thing from America First & he'd be very bad for PA,\" tweeted Sean Parnell, the candidate Trump first endorsed before he dropped out over domestic abuse allegations.",
    "His endorsement of former football player Herschel Walker also drew some concerns from Trump supporters, including Herschel's opponent Gary Black, who chastised him for disagreeing with the former president on some immigration policies in a 2015 USA Today interview.",
    "In Tennessee's Fifth Congressional District  a newly gerrymandered district containing parts of Nashville  Trump's endorsed candidate Morgan Ortagus was removed from the ballot by her fellow Republicans over not meeting state residency requirements.",
    "His April endorsement of Dr. Mehmet Oz in Pennsylvania was met with skepticism from supporters, who pointed to his past statements on topics like gun control, abortion and LGBTQ rights as evidence he is not sufficiently conservative.",
    "His endorsements have been long sought after by Republican candidates all over the country in hopes it could boost their odds of winning GOP primaries, and are seen by many as a sign of his continued grip on the party.",
    "His endorsements in Texas' midterm primaries carried several candidates to victory, but his supported candidate's loss in a 2021 special election called into question how much sway he still holds with Republicans.",
    "Brooks had long been one of his allies in Congress, but during a rally last August, he urged voters to move on from the 2020 election, which Trump has claimed was stolen, urging them to \"put that behind you.\"",
    "But a number of these endorsements have drawn the ire of some conservative, Trump-aligned Republicans over concerns the candidates may not be fully aligned with the former president's political message.",
    "Trump is widely viewed as having a strong grip on the GOP, but the reluctance of Republicans and \"MAGA\" voters to embrace some of his endorsed candidates could reveal cracks in his influence.",
    "He endorsed former state Representative Vernon Jones, who served as a Democrat before changing his party affiliation to Republican in 2021, in the state's 10th Congressional District.",
    "Brooks' pivot away from 2020 election theories, along with polls showing him potentially falling hind other candidates, have left him in a precarious position ahead of the primary.",
    "\"Herschel Walker's immigration policy is like an illegitimate love child of Mitt Romney and Nancy Pelosi,\" his spokesperson said, according to the Atlanta Journal-Constitution.",
    "Since leaving the White House, the former president has endorsed dozens of candidates for all types of offices, ranging from state legislators to governors races.",
    "Though those three endorsements have received the most national attention, some of Trump's others have also faced backlash from some of his Republican allies.",
    "In 2022, his endorsements in Alabama, Ohio and Pennsylvania's senate races have garnered additional attention as some supporters question Trump's choices.",
    "He wrote that Oz would get more votes in Democratic strongholds Philadelphia and Pittsburgh, \"where other candidates will just not be accepted.\"",
    "During Trump's 2016 presidential run, Vance voiced many criticisms of him but has maintained that he has since become a loyal Trump supporter.",
    "Several of former President Donald Trump's endorsements have caused rifts among his supporters ahead of the 2022 midterm elections.",
    "His endorsements in Georgia, a state he narrowly lost during his 2020 run, have also been criticized by some of his supporters.",
    "Republican state Senator Frank Nicely shunned the endorsement from the ex-president, telling NBC News: \"I voted for Trump.",
    "The endorsement even prompted some of his supporters to call for a boycott of Trump's Ohio rally over the weekend.",
    "The debacle kickstarted a series of senate endorsements that landed Trump in hot water with his own voters.",
    "Trump withdrew his endorsement in March, accusing Brooks of making \"a horrible mistake\" by going \"woke.\"",
    "Jasper County GOP Chair Mary Patrick told NBC News there was \"no sense that this was a good thing.\"",
    "Trump, meanwhile, upheld Oz as a candidate who would be able to win in Pennslyvania.",
    "Trump initially endorsed Representative Mo Brooks in Alabama's senate race.",
    "Some Trump supporters also expressed outrage over his endorsement of J.D.",
    "The endorsement was met with mixed reception from local Republicans.",
    "But I don't want him coming out here to tell me who to vote for.\"",
    "Newsweek reached out to Trump's office for comment.",
    "I was honored to have his endorsement in PA. Twice.",
    "\"I have enormous respect for President Trump.",
    "The remark was met with boos from the crowd.",
    "I'll vote for Trump as long as he lives.",
    "But I'm disappointed by this.",
    "I supported him.",
    "Vance in Ohio."
  ]
}