{
  "id": 6245,
  "mediaId": 43,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Testicle Guru, and, Amazingly, Other Equally Stupid Sh*t",
  "image": "https://images.dailykos.com/images/1061966/story_image/F5A7F480-58DF-47EC-882D-57C9C43441EB.jpeg?1650678666",
  "link": "https://www.dailykos.com/story/2022/4/22/2093551/-Tucker-Carlson-New-Age-Testicle-Guru-and-Amazingly-Other-Equally-Stupid-Sh-t",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    3103
  ],
  "sentences": [
    "Fuck yes, I hope your lil kakistocrat kingmaker costs you loads of winnable races this fall, although maybe you kids could find a moment to reflect upon just how you wound up with an electorate thats so horny to back serial abusers like Eric Greitens, Herschel Walker, and Charles Gropey? Herbster, because that shit didnt happen overnight.",
    "This paragraph is strictly for the alien archaeologists, trying to work out precisely how and why humanity mysteriously vanished from the face of the Earth around 2050: yes, this is indeed a state government lashing out vengefully at a private corporation, an enormous part of the states economy in fact, for not hating gay people enough.",
    "Now, Ill allow that decorating the brigade responsible for the atrocities in Bucha was an inspired bit of trolling, but youre in a war, not a Twitter spat, and given your performance on the battlefield to date, Im not sure that giving Ukrainians extra motivation to shoot at you was the wisest move.",
    "And war means sacrifices; Ron-Ron and his minions, in their zeal to crush dissent, casually shifted a massive tax burden onto their own constituents with their legislative conniption, because living under Republican governance means not just accepting institutional bigotry, but financing it.",
    "Meanwhile, Mark Meadows got caught registering to vote in three different states simultaneously, and a couple of Steve Bannons confederates in that dumbass wall-building scam pleaded guilty to defrauding donors, but yknow, something something populism, something something law and order.",
    "Unchastened by the blowback from her contribution to white nationalist skidmark Nick Fuentes loser sock hop, Janice McGeachin announced her intention to campaign alongside Stew Peters, an equally skeevy little freak who single-handedly blacks out the entire Racist Wingnut Bingo card.",
    "In the grand scheme of things, the Lieutenant Governor of Idaho probably has fewer day-to-day responsibilities than the manager of a reasonably busy KFC, but I guess what Im saying is, I wouldnt want my chicken fried by Nazis, either.",
    "And that tapeworm is a Twitter account called Libs of TikTok,? the ruptured cyst of oozing hatred at the center of the frenzied, manufactured grooming? panic currently spiraling out of control on the American Right.",
    "Thats why this crap with McConnell and McCarthy is so fucking infuriating; they know exactly what theyre enabling, they understand how wrong and dangerous it is; theyre just too spineless and power-mad to oppose it.",
    "Anyway, enjoy all the shiny new howitzers n things thatre headed your way; I bet it sucks to be incapable of resupplying your deteriorating war machine? on account of all those debilitating sanctions, by the way.",
    "Hey, while I have your attention, o ye extraterrestrial Lara Crofts, I should also confirm, regretfully, that yes, human males that look to mewling mediocrity Tucker Carlson for guidance on masculinity do exist.",
    "Well, it only took them two months, but the butchering clod brigade that apparently passes for an army in Moscow finally eliminated nearly all traces of human life and civilization from one city in Ukraine.",
    "Go ahead and get me started on horse dewormer, since a new study shows as many at 234,000 Americans needlessly died of Covid, because they chose not to take any of the free, safe, effective vaccines.",
    "It reflects poorly upon American culture and character that were even entertaining the thought of returning them to power, but so does the ivermectin-chugging and scrotum-tanning, I suppose.",
    "Im still loving my vacation from the Tweetymachine, but youre always invited to showercapblog.com, where you can sign up for updates, peruse the fuckery archive, and learn about my comics!",
    "Vance, who won the death cult equivalent of the Publishers Clearing House Sweepstakes: the endorsement of a man he once called Americas Hitler.? Man, that was a whole damn show, wasnt it?",
    "Theres no shortage of assholes,? my dad used to say, as a sort of catch-all explanation for the seemingly endless supply of irksome weirdos one collides with over the course of ones life.",
    "And fucking OF COURSE hes more interested in petty retribution (and equally petty grifting) than in helping the team win electionsdoes no one listen when he tells the snake story?!?!",
    "And now Republicansre worried, because the Deposed Dotard is proving to be no better at making endorsements than he is at running casinos or managing pandemics or closing umbrellas.",
    "Long-term benefits to the gene pool notwithstanding, why are we allowing the maniacs who spread the disinformation responsiblefor that horrifying statistic to set education policy?",
    "Congratulations, boys, you turned Mariupol into a mass grave so the idiot billionaire that sent you to die in a foreign land could lay momentary claim to slightly more dirt.",
    "This groomer? shit, like so much right-wing messaging these days, is designed to dehumanize political opponents, in order to justify, and even encourage violence.",
    "There are certainly no kinks in the asshole supply chain at the moment; if anything, the market is overserved, as the following paragraphs will demonstrate.",
    "Yep, even though he laughs like a cartoon marmot, and his jawline resembles nothing so much as three pounds of rancid mayonnaise in a leaky Ziploc baggie.",
    "And because everything is extremely gross these days, we can actually tie Tucker Carlsons White Power Hour directly to recent events in DeSantistan.",
    "Yes, its taken just two months to reduce Vlad the Genocidal Fuckwit to feebly staging premature missile tests, like some dime store Kim Jong-un.",
    "Now, to cut through the feigned indignation of the conservative media bubble, what Libs of TikTok does is target LGBTQ+ folks for harassment.",
    "I mean, I guess if youve survived two years of Carlsons coronavirus lies, you may as well get good n lubed up, and irradiate your scrotum.",
    "Dunno what to tell you, common sense wasnt really a thing? on the right in the early 21st centurydont get me started on horse dewormer.",
    "Kids should learn fractions from Richard Spencer!? Otherwise, why in seven hells is the DeSantis administration behaving this way?",
    "REAL men dip their ballsack in lye, every morning, with their coffee, which REAL men lace with bleach, thumbtacks, and motor oil.",
    "But thats what Republican politics IS now: morons gyrating depravedly, desperate to gain one racist game show hosts approval.",
    "Incidentally, calling your big, bad ICBM Satan II? is the act of high school freshman desperate for puberty to hit.",
    "Ok, folks, I cannot stomach one more second of this shit; I now require several beers, and I shall have them.",
    "Mitch, Kev, speaking on behalf of every patriotic American, Im real damn tired of paying for your cowardice.",
    "Soon enough, the textbooks will surely insist Florida has always been at war with the Walt Disney Company.",
    "Florida parents were aghast to discover their childrens math textbooks are insufficiently racistI guess.",
    "I mean, there mustve been a Million Mom March on Tallahassee, all voices rising as one, Hey!",
    "Hey, the next time Donald Trump and Piers Morgan fight, it should be with monkey wrenches.",
    "(Personally, Im looking forward to Satan III: Satan Goes to The Hague.)",
    "Stay safe out there if youre able, my friends, shits been real weird.",
    "Yeah, were pretty much tantruming towards extinction these days.",
    "Its straight-up Nazi shit, and it scares the piss out of me.",
    "Most mephistophelian felicitations go out to Mr. J.D.",
    "Thats what theyve decided government is for.",
    "Does that sound like a good idea to anyone?",
    "UPDATE: Young Maddy Cawthorn did WUT now?",
    "Like watching hogs fight over a turd.",
    "Its all incredibly healthy.",
    "And I think that holds up.",
    "If youre a SISSY, that is.",
    "And then theres this.",
    "These fucking people.",
    "Actually, yknow what?",
    "In a great, big bow.",
    "With a tapeworm.",
    "Ho!"
  ]
}