{
  "id": 6253,
  "mediaId": 136,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "We're Running Out of Time to Hold Trump Accountable | Opinion",
  "image": "https://d.newsweek.com/en/full/2016787/trump-under-investigation.webp?w=790&f=9542a9d5e082160affba83a7c24baa2d",
  "link": "https://www.newsweek.com/were-running-out-time-hold-trump-accountable-opinion-1699754",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Robert Reich",
  "authorUrl": "https://www.newsweek.com/authors/robert-reich",
  "termIds": [
    815,
    3103
  ],
  "sentences": [
    "To be endorsed by Trump, candidates apparently must fulfill three prerequisites: They have to be running in swing states whose primaries and general elections will attract lots of media attention; they must be totally committed to Trump and his big lie; and they must have shown themselves capable of promoting Trump and his lie with the kind of celebrity pizzaz that sells well on television.",
    "Yet it's been over a year and half since Trump has refused to concede, instead continuously spreading his big lie that the election was stolen, pushing public officials at all levels of government to overturn the election, and instigating an insurrection at the U.S. Capitol on the day Congress was to certify the election results.",
    "But failure to hold Trump accountable for what he has done would pose a far greater risk for American democracy, permanently entrenching distrust in our election system and legitimizing future battles over every contest, possibly provoking repeated rounds of violence.",
    "Moreover, immediately after the midterm elections, America will be in the gravitational pull of the 2024 presidential primaries, in which Trump will almost certainly play a leading role, unless he is indicted and convicted.",
    "As Federal District Court Judge David Carter stated in a recent opinion, \"[T]he Court finds it more likely than not that President Trump corruptly attempted to obstruct the Joint Session of Congress on January 6, 2021.\"",
    "This is a specious argument because no former president has ever before attempted to overthrow a duly elected President, the first attempted coup in the 233-year history of the United States government.",
    "Others worry that criminal charges against Trump along with a trial and possible imprisonment would only deepen the fierce partisan divide that's already drained trust out of much of American democracy.",
    "(The committee has already collected nearly 10,000 documents and conducted more than 860 depositions and interviews, including with Trump family members and his close associates.)",
    "Oz is a celebrity television doctor who has over the years come under fire for bogus on-air medical advice, which makes him perfect for promoting Trump and his big lie, too.",
    "And he is inspiring GOP-state legislatures to enact election sabotage laws that will give Trump and his supporters opportunities to rig congressional election results.",
    "And once he is a declared candidate, it will be impossible for Twitter, Facebook, and other social media platforms to stop him from engulfing them with his lies.",
    "Some say Garland should not bring criminal charges against Trump because criminal charges have never before been brought against a former president.",
    "They will be a battle between Trump acolytes and fair election supporters over the protection of the integrity of our elections and our democracy.",
    "But now that he's running for the Senate, Vance has become one of the most forceful promoters of Trump and an articulate peddler of his big lie.",
    "Sixty federal judges, along with Trump's own departments of justice and homeland security, have concluded that Biden won fair and square.",
    "Trump admires Oz's television bona fides: \"They liked him for a long time,\" Trump said of Oz at a rally in Pennsylvania last week.",
    "The upcoming 2022 congressional elections will serve as proving grounds for his attempt to steal the 2024 presidential election.",
    "He has already amassed a campaign chest of more than $120 million, more than double that of the Republican National Committee.",
    "The critical question, then, is whether Attorney General Merrick Garland will bring criminal charges against Trumpand when.",
    "The House Select Committee on January 6 will be holding public hearings in a few weeks and report its findings thereafter.",
    "Second, the lynchpin of democracy is the peaceful transition of power from those who lose elections to those who win them.",
    "The press has framed these endorsements as long-shot bets that \"could put [Trump's] desired image as a kingmaker at risk.\"",
    "First, no one to this day has produced even a shred of evidence that fraud affected the results of the 2020 election.",
    "Trump couldn't care less whether he's viewed as a \"kingmaker\" by the press and politicians inside the Beltway.",
    "What's really at stake for Trump is selling Trump and his big lie that the 2020 election was stolen from him.",
    "Vance, the celebrity author of \"Hillbilly Elegy,\" was originally appalled by Trump and his lie, and said so.",
    "And he has a knack for recognizing ambitious, unprincipled, television-savvy hucksters who will help him.",
    "He cares only about his narcissistic need to delegitimize the outcome of the 2020 presidential election.",
    "Mehmet Oz in Pennsylvania's Senate Republican primary and Herschel Walker in the Georgia Senate race.",
    "If Republicans take over the House in the midterm elections, they are sure to close down the inquiry.",
    "During the last six months of 2021, his PAC raised more money online than the GOP every day but two.",
    "The longer he goes without being held accountable for what he has done, the more danger he poses.",
    "The sooner Trump is held accountable for his criminality, the safer American democracy will be.",
    "He served in the administrations of Presidents Gerald Ford, Jimmy Carter and Bill Clinton.",
    "The upcoming midterm elections won't simply be a battle between Republicans and Democrats.",
    "Trump is already well on the way to rebuilding the Republican Party around his big lie.",
    "He is purging the GOP of critics and installing loyalists in key state positions.",
    "Robert B. Reich is an American political commentator, professor and author.",
    "Reich's latest book, The System: Who Rigged It, How We Fix It, is out now.",
    "Let me pause here to emphasize two things that are too easily forgotten.",
    "You know, when you're in television for 18 years, that's like a poll.",
    "Trump's indictment and conviction must occur as quickly as possible.",
    "Trump is a growing menace to our system of self-government.",
    "The views expressed in this article are the writer's own.",
    "On Friday, former President Trump endorsed J.D.",
    "As Trump noted about Vance, \"he gets it now.\"",
    "Vance in the Ohio Senate Republican primary.",
    "The window of opportunity is closing fast.",
    "The endorsement followed two othersDr.",
    "He was both a college and NFL star.",
    "Walker fits the criteria, as well.",
    "This is a legitimate concern.",
    "That means people like you.\"",
    "But this misses the point.",
    "\"That's like a poll."
  ]
}