{
  "id": 6313,
  "mediaId": 151,
  "date": "d2022-04-18T14:00",
  "headline": "5 numbers to know from the new FEC reports",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/04/18/5-numbers-to-know-from-the-new-fec-reports-00025768",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    886,
    946,
    971,
    1459,
    1572,
    1801,
    3103,
    183,
    403,
    2537,
    2934
  ],
  "sentences": [
    "The move came as the FEC released documents resolving a complaint about a pair of 2018 donations to DefendArizona, a super PAC that supported then-Rep. Martha McSallys (R-Ariz.) Senate bid.?\nHINDSIGHT IS 2020  Lawmakers worry 2020 will be a blueprint for stealing a future election,? by Peter Nicholas, NBC News: Both a federal judge and the top Republican on the House committee investigating the Jan. 6 riot have now reached the same stark conclusion: There is evidence to suggest Donald Trumps effort to overturn the 2020 election could be a crime.?\n Trumps Focus on 2020 Election Splits Michigan Republicans,? by Jazmine Ulloa and Nick Corasaniti, The New York Times: The shouting in the banquet hall erupted just minutes after the Macomb County Republican Party convention was called to order.",
    "Sen. Tom Cotton urged a federal court on Friday to dismiss part of a federal lawsuit challenging Arkansas' congressional redistricting map, which splits the state's most populous county into three separate districts.?\nTHE LAST FRONTIER  I Just Think Sarah These Days Is Not a Person to Be Taken Seriously,? by David Siders, POLITICO Magazine: In the race to fill the House seat left vacant by the late Rep. Don Young  a contest that, thanks to Palins entry, has suddenly drawn national interest  Palin is the embodiment of several conflicting truths in American politics.",
    "Vance, a venture capitalist and the author of Hillbilly Elegy, spent more than a year battling for Trumps endorsement alongside a handful of other candidates  including a March 2021 Apprentice-style boardroom sit-down with the former president where they auditioned for him.?\n Josh Mandel runs Ohio GOP Senate campaign through churches,? by Jill Colvin and Julie Carr Smyth, Associated Press: Before digging into his six-egg omelet at a bustling northeast Ohio diner, Republican Senate candidate Josh Mandel stopped to bow his head.",
    "A plan was afoot to oust him and his executive team, he said.?\nTHE GOLDEN STATE  Crime upstages progressive priorities in Los Angeles mayor's race,? by Alexander Nieves and Lara Korte, POLITICO California: Frustrations over crime and homelessness are setting the tone in the race to become Los Angeles next mayor, pushing progressive candidates like Rep. Karen Bass to set their liberal priorities aside  and bolstering the chances of a billionaire centrist in Californias most sprawling and diverse metropolis.",
    "Days until the Indiana and Ohio primaries: 15\nDays until the Nebraska and West Virginia primaries: 24\nDays until the Pennsylvania, North Carolina, Oregon, Idaho and Kentucky primaries: 29\nDays until the Texas runoff and the Alabama, Arkansas and Georgia primaries: 36\nDays until the California, Iowa, Mississippi, Montana, New Jersey, New Mexico and South Dakota primaries: 50\nDays until the general election: 204\nDays until the 2024 election: 932\nWant to receive this newsletter every weekday?",
    "Upton (R-Mich.) said he is confident that House Republicans will have a majority next year, but it is the open question of how large their numbers will be that could prove pivotal.?\nAS SEEN ON TV\n McConnell-tied super PAC makes early $134M play for the Senate,? by Burgess Everett, POLITICO: A Mitch McConnell -aligned super PAC is booking $134 million in fall advertisements to help turn the Senate red, a staggering sum that sets the stage for a vicious battle over the chambers control.",
    "Free Ohio PAC received $1,050,000 in the first three months of 2022, according to the Federal Election Commission.?\n RNC questions Virgin Islands GOP fundraising,? by Lachlan Markay, Axios: The Republican National Committee is threatening legal action against the former chair of the Virgin Islands GOP, who for years has used the post to rake in money spent less on candidates than political consultants and fundraising vendors.?\nPOLL POSITION\n Does Trumps endorsement matter in Georgia?",
    "But in an era of Republican politics when Donald J. Trump could survive and thrive amid accusations of sexual assault, opposing candidates are finding little traction in dwelling on the issues.?\n Im a gambler: Trump plunges into GOP primaries with risky picks,? by Josh Dawsey and Michael Scherer, The Washington Post: With his endorsements of Oz, Senate candidate Ted Budd in North Carolina, gubernatorial hopeful David Perdue in Georgia and, on Friday, author and Senate candidate J.D.",
    "Yet House Majority PAC  which is closely aligned with Speaker Nancy Pelosi  delivered an unexpected blow last week to Salinas campaign.?\n Campaign finance watchdog cracks down on untraceable super PAC donations,? by Zach Montellaro, POLITICO: The Federal Election Commission signaled Friday that it will take steps to uncover some types of virtually untraceable donations to super PACs, a potentially significant shift in the enforcement of campaign finance law.",
    "A University of Georgia poll offers an early glimpse at the power  and limits  of the former presidents support.?\nPresidential Big Board\n Mar-a-Lago Machine: Trump as a Modern-Day Party Boss,? by Shane Goldmacher, The New York Times: On any given night, Donald J. Trump will stroll onto the patio at Mar-a-Lago and say a few words from a translucent lectern, welcoming whatever favored candidate is paying him for the privilege of fund-raising there.",
    "Vance in Ohio, Trump has leaped into the middle of several competitive primaries that could put his desired image as a kingmaker at risk.?\n Fred Upton: Slim House majority could spell trouble for post-midterms GOP,? by Nick Niedzwiadek, POLITICO: Outgoing Rep. Fred Upton on Sunday said fellow Republicans may find it difficult to unite the various wings of the party if they prevail in taking back the House in the November midterms.",
    "Public safety is proving to be a potent platform for Rick Caruso, a developer and former Republican who has spent $9 million on ads vowing to crack down on criminals and corruption in City Hall ahead of the June 7 top-two primary.?\nTHE MAP LINES  Cotton calls racial gerrymandering claims baseless, urges court to dismiss part of Arkansas congressional map lawsuit,? by Dale Ellis, Ryan Tarinelli, Arkansas Democrat Gazette: U.S.",
    "CAMPAIGN INTEL\nRECRUITMENT WATCH  Defend democracy: Dems launch massive recruiting push for local election officers,? by Elena Schneider, POLITICO: A Democratic candidate recruiting group is pitching donors on an ambitious three-year program to find, train and support 5,000 candidates for local offices in charge of election administration, a sprawling national effort intended to fight subversion of future election results.",
    "Also the former head of the Environmental Protection Agency, appointed by Donald Trump, Pruitt has filed to campaign for the U.S. Senate seat being vacated by Sen. Jim Inhofe.?\nPAC ATTACK  A slap in the face: House Dems super PAC sparks Latino backlash,? by Sabrina Rodriguez, POLITICO: Andrea Salinas has endorsements from top Latino groups and from half of the Latina Democratic lawmakers in the House.",
    "He is a Jewish candidate who makes no secret of his faith, but who is centering his campaign around evangelical churches as he tries to win over religious, conservative voters.?\nENDORSEMENT ALERT  Jim Messina, the White House deputy chief of staff under former President Barack Obama, endorsed Arizona Democrat Marco Lopez for governor.",
    "Candidates Face Accusations, Rivals Tread Carefully,? by Jonathan Weisman, The New York Times: In Missouri, Georgia, Ohio and now Nebraska, Republican men running for high office face significant allegations of domestic violence, stalking, even sexual assault  accusations that once would have derailed any run for office.",
    "He could end up endangering the Dems Senate plans.? by Chris Cadelago, POLITICO: A California software magnate is preparing to spend potentially millions of his own dollars on a brutal crusade to take down Elon Musk and hes doing it all as part of a quixotic and below-the-radar campaign for the U.S. Senate.",
    "Dan ODowd, founder and chief executive of Green Hills Software and a self-described billionaire from Santa Barbara, has in recent days reserved nearly $650,000 in TV airtime to run in the state, according to data from ad-tracking services obtained by POLITICO.?\nTHE CASH DASH\n Dark-money group helping Gov.",
    "The GOP-controlled Senate Leadership Fund is reserving eight-figure ad flights starting in September to protect Republican seats in North Carolina, Pennsylvania and Wisconsin as well as to take Democratic-held seats in Arizona, Georgia and Nevada, the group told POLITICO.?\n He wants to destroy Elon Musk.",
    "The program would recruit candidates in 35 states for everything from county probate judges in Alabama to county clerks in Kansas and county election board members in Pennsylvania  all offices that handle elections and will be on voters ballots between now and 2024.",
    " For 15 months, a parade of supplicants  senators, governors, congressional leaders and Republican strivers of all stripes  have made the trek to pledge their loyalty and pitch their candidacies.?\nCODA  HEADLINE OF THE DAY  Does it pay to be outrageous?",
    "5 numbers to know from the new FEC reports\nBy STEPHANIE MURRAY\n04/18/2022 10:00 AM EDT\nTOP LINE\nMONEY MOVES  We got a peek into the bank accounts of major political campaigns this weekend, when first-quarter fundraising reports were due to the FEC.",
    "NC candidates campaign reports suggest answers?  Charlotte Observer\nFollow us on Twitter\nSteven Shepard @politico_steve\nStephanie Murray @stephanie_murr\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "$8.4 million: The Republicans competing for a chance to take on Sen. Mark Kelly (D-Ariz.) raised $8.4 million altogether, which is less than the $11.3 million Kelly raised on his own in the first quarter.",
    "Mike DeWine was funded by Republican Governors Association PAC,? by Jeremy Pelzer and Andrew Tobias, Cleveland Plain Dealer: A dark-money group thats been running a barrage of advertising supporting Gov.",
    "In a room packed with about 500 people, Mark Forton, the county party chairman and a fierce ally of former President Donald J. Trump, began railing against the establishment Republicans in the audience.",
    "In one sense, she is all potential  a celebrity candidate in the age of celebrity candidates; a mere 58 years old at a time when national leadership is contested among people pushing 80.",
    "It depends, says UGA poll,? by Greg Bluestein, The Atlanta Journal-Constitution: One of the biggest mysteries of the May primary is how much sway Donald Trump still has among GOP voters.",
    "Republicans Dave McCormick and Mehmet Oz were the largest self-funders in the first three months of 2022, lending their campaigns a combined $12.9 million in the beginning of the year.",
    "But shes also heavily encumbered with baggage, a losing candidate at the national level with a long series of tabloidy family dramas and minor scandals.?\nMIDTERM MESSAGING  As G.O.P.",
    "GETTING IN  Scott Pruitt, former Oklahoma AG, files for U.S. Senate seat,? by Randy Krehbiel, Tulsa World: Former Oklahoma Attorney General Scott Pruitt is running for U.S. Senate.",
    "Without a major primary challenge, Kelly is airing ads suited for the general election and stockpiling cash, while his could-be opponents battle ahead of the August primary.",
    "$1.1 million: Texas Democrat Jessica Cisneros outspent Rep. Henry Cuellar (D-Texas) in the first quarter of the year, which included the March primary and the weeks after.",
    "We need someone like Marco on the ticket who can excite Latinos and the diverse coalition that helped President Biden win Arizona in 2020,? Messina said in a statement.",
    "THE BUCKEYE STATE  Trump gives Vance coveted endorsement in Ohio Senate race,? by Alex Isenstadt, POLITICO: Donald Trump endorsed Ohio Republican Senate candidate J.D.",
    "The numbers tell us who raised the most cash in Q1 of the on? year, who spent the most cash and where campaigns stack up with the midterm primaries coming up fast.",
    "The group has new offices in Athens, Columbus and Brunswick, among others, with the goal of bringing in 150,000 people to participate in the November election.",
    "For more fundraising intel, POLITICOs Zach Montellaro has a roundup of FEC takeaways, and POLITICOs Steve Shepard has a Senate fundraising roundup for Pros.",
    "Mike DeWines re-election is being funded by the campaign arm of the Republican Governors Association, according to federal campaign-finance records.",
    "$90,326: Sen. Marco Rubio (R-Fla.) and Rep. Val Demings (D-Fla.) have war chests that are almost evenly matched, separated by less than $100,000.",
    "Vance on Friday afternoon, potentially shaking up a major primary and capping a long and contentious fight for the former presidents support.",
    " The scene encapsulated Mandels campaign strategy as he competes in a crowded field of Republican contenders ahead of Ohios May 3 primary.",
    "She also has backing from the Congressional Hispanic Caucus campaign arm in her bid to become Oregons first elected Latina in Congress.",
    "Email the rest of the POLITICO Campaigns team at sshepard@politico.com, zmontellaro@politico.com and amutnick@politico.com.",
    "Jim Lamon was the top raising Republican  pulling in $5.3 million  but that includes a $5 million loan from the candidate.",
    "The vulnerable incumbent lawmaker raised $13.6 million in the first three months of 2022 and spent $10.9 million.",
    "Youll also receive daily policy news and other intelligence you need to act on the days biggest stories.",
    "Cuellar had $1.4 million in cash on hand, while Cisneros ended the quarter with $1 million in the bank.",
    "Demings had $13.2 million in the bank at the end of the first quarter, while Rubio had $13.1 million.",
    "Warnock still has among the largest war chests of the midterms  hes got $25.6 million in the bank.",
    "The first quarter of the year covered Jan. 1-March 31, and reports were due to the FEC on Friday.",
    "(McCormicks report covered activity in December, when he was in the exploratory campaign phase).",
    "$13.6 million: Sen. Raphael Warnock (D-Ga.) was the top Senate fundraiser in the first quarter.",
    "Demings still has an uphill climb, as even Democrats acknowledge the state is trending red.",
    "And despite not having a serious primary challenger, Warnock was also the top spender.",
    "Demings outraised Rubio ($10.1 million to $5.8 million), but she outspent him, too.",
    "Demings spent $5 million in the first quarter, while Rubio spent $3.2 million.",
    "$12.9 million: The Pennsylvania Senate race is a battle of the bank accounts.",
    "Email me at smurray@politico.com and follow me on Twitter at @stephanie_murr.",
    "JUST PEACHY  New Georgia Project opened 11 new offices ahead of the midterms.",
    "McCormick gave his campaign $7 million, while Oz gave himself $5.9 million.",
    "Thats three times as much money as GOP primary frontrunner Herschel Walker.",
    "Follow them on Twitter: @POLITICO_Steve, @ZachMontellaro and @allymutnick.",
    "Cisneros outraised Cuellar, pulling in $1.7 million to Cuellars $753,000.",
    "Walker had $7.4 million on hand and raised $5.2 million.",
    "Here are some big numbers to know as you start the week.",
    "Cisneros and Cuellar are headed for a runoff on May 24.",
    "He was also the top GOP primary spender at $4 million.",
    "Subscribe to POLITICO Pro.",
    "Good Monday morning."
  ]
}