{
  "id": 6360,
  "mediaId": 33,
  "date": "4/16/2022 12:00:00 AM",
  "headline": "ANLISIS | La palabra que explica el respaldo de Donald Trump a J.D. Vance",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220403202323-sarah-palin-file-story-tablet.jpg",
  "link": "https://cnnespanol.cnn.com/2022/04/16/analisis-la-palabra-que-explica-el-respaldo-de-donald-trump-a-j-d-vance/",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    781,
    815,
    1147,
    1801,
    3103,
    106,
    571
  ],
  "sentences": [
    "Como escribi el diario The New York Times sobre los hbitos televisivos de Trump en abril de 2020:\nEl presidente Trump llega al Despacho Oval estos das hasta el medioda, cuando suele estar de mal humor despus de su maratn matinal de televisin.",
    "Palin, quien se desempe como gobernadora de Alaska, fue la candidata republicana a vicepresidenta en 2008 y ms tarde y quizs lo ms importante para los propsitos de Trump una estrella de telerrealidad.",
    "Trump insinu esa creencia en su declaracin del viernes, argumentando por qu Vance est mejor posicionado para vencer al probable candidato demcrata, el representante estadounidense Tim Ryan.",
    "porque, a diferencia de tantos otros pretendientes y aspirantes, l pondr a Estados Unidos primero?, dijo Trump en un comunicado el viernes anunciando el respaldo.",
    "Exclusiva CNN: Lo que revelan los mensajes de texto de Meadows sobre cmo dos aliados de Trump presionaron a la Casa Blanca para anular las elecciones\nPor qu?",
    "Ha estado despierto en el dormitorio principal de la Casa Blanca desde las 5 a.m. viendo Fox News, luego CNN, y agrega una porcin de MSNBC que ve furioso.",
    "Lo que significa que si ests en la televisin como lo han estado Vance, Walker, Palin y Oz, en diversas formas a lo largo de los aos le importas a Trump.",
    "es el que tiene ms probabilidades de eliminar al dbil pero peligroso oponente demcrata, peligroso porque tendr mucho dinero para gastar?, dijo Trump.",
    "La campaa de Vance no ha despegado exactamente, y en el pasado est ese molesto problema de que l critic a Trump (y a los votantes de Trump).",
    "La evaluacin de Trump acerca de Vance entonces, en contraste con su declaracin sobre la decisin, se basa principalmente en esta presuncin.",
    "Esta es una muestra de los apoyos de Trump hasta ahora en 2022:\nRespald a Herschel Walker en la carrera por el Senado de Georgia.",
    "Y an as ...\nEs hora de que todo el movimiento MAGA, el ms grande en la historia de nuestro pas, se una detrs de la campaa de J.D.",
    "Hace llamadas con la televisin encendida de fondo, es su rutina desde que lleg por primera vez a la Casa Blanca\".",
    "Y debido a que Vance, el famoso autor de \"Hillbilly Elegy\", ha estado en la televisin, ser bueno en esos debates.",
    "Muestra que la forma en que Trump consume e interacta con la cultura es a travs de la televisin.",
    "Cuando ests en la televisin durante 18 aos, eso es como una encuesta?, dijo el expresidente.",
    "l piensa que las personas famosas tienen \"eso\", un factor que los distingue de los normales.",
    "Vance es bueno en la televisin, ergo, en la mente de Trump, Vance es simplemente bueno.",
    "Vance en las primarias republicanas para el Senado en Ohio no tiene mucho sentido.",
    "Por supuesto, no duele que Trump se vea a s mismo ante todo como una celebridad.",
    "lo destruir en los debates y luchar por el Movimiento MAGA en el Senado?.",
    "Cuando se trata de Trump, no pienses demasiado por qu hace lo que hace.",
    "Los debates son clave para Trump porque son actuaciones televisadas.",
    "(CNN) -- A primera vista, el respaldo de Donald Trump al autor J.D.",
    "Apoy a Sarah Palin en la eleccin especial de la Cmara en Alaska.",
    "Apoy a Mehmet Oz en la carrera por el Senado de Pensilvania.",
    "Al respaldar a Oz, Trump nos dio una idea de su pensamiento.",
    "He estudiado esta contienda de cerca y creo que J.D.",
    "La respuesta ms simple es casi siempre la correcta.",
    "Trump se siente atrado por otras personas famosas.",
    "Walker era una estrella universitaria y de la NFL.",
    "Oz gan fama y notoriedad durante ms de una dcada.",
    "HAZ QUE ESTADOS UNIDOS SEA GRANDE OTRA VEZ!\"",
    "Le gusta la gente que est en el club con l.",
    "Puedo explicarlo todo en una sola palabra.",
    "Vance tiene mi respaldo completo y total.",
    "\"Eso significa que le gustas a la gente\".",
    "Esa es una cita tremendamente reveladora.",
    "Esa es su lente sobre el mundo.",
    "\"En otras palabras, J.D.",
    "Sin embargo, J.D.",
    "No lo defraudar.",
    "Es as de simple.",
    "\"Celebridad\".",
    "Listo?"
  ]
}