{
  "id": 7194,
  "mediaId": 136,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Trump Endorsement More 'Matchbox Car' Than 'Freight Train': Geoff Duncan",
  "image": "https://d.newsweek.com/en/full/2042764/geoff-duncan-dicusses-donald-trump-endorsements.webp?w=790&f=7cd8f96514b6dad893143f8ac7308dab",
  "link": "https://www.newsweek.com/trump-endorsement-more-matchbox-car-freight-train-geoff-duncan-1708941",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    815,
    821,
    1147,
    2095,
    2246,
    2303,
    3102,
    3103,
    4325,
    428,
    501,
    2672,
    2834
  ],
  "sentences": [
    "As Tuesday's primary elections approach in Georgia, Trump appears poised to be delivered a major proxy defeat in the Republican Party's gubernatorial primary, where he endorsed former Senator David Perdue against incumbent GOP Governor Brian Kemp.",
    "The former president has publicly attacked Kemp over his refusal to embrace the claims of widespread voter fraud during the 2020 presidential election, a theory pushed by Trump and his allies to explain his narrow defeat in numerous swing states.",
    "He explained that Republican candidates have become less likely to kowtow to Trump's demands to receive the endorsement, which is typically reserved for those loyalists who back his election fraud claims.",
    "\"Every day there's more and more folks that have the confidence to walk out in front of what used to look like a freight train but now is just a matchbox car,\" Duncan said, according to the newspaper.",
    "Even though polls point to a Perdue loss, Trump's endorsed candidate in the state's Senate primary, former football star Herschel Walker, remains the overwhelming favorite.",
    "He continued to say that Trump's endorsement was not the \"golden ticket\" it was in 2018, when Trump-backed candidates, including Kemp at the time, dominated GOP primaries.",
    "Donald Trump's endorsements are more comparable to a \"matchbox car\" than a \"freight train,\" Georgia's Republican Lieutenant Governor Geoff Duncan said Sunday.",
    "In North Carolina's 13th Congressional District, he endorsed incumbent Madison Cawthorn, who has been a close Trump ally in Congress.",
    "In Pennsylvania's hotly contested Senate primary, Trump-backed Dr. Mehmet Oz, appeared to hold a narrow lead of about 1,000 votes.",
    "A Perdue defeat would be the latest sign that a Trump endorsement may not guarantee a candidate's victory in a Republican primary.",
    "Vance, Pennsylvania gubernatorial candidate Doug Mastriano and North Carolina Senate candidate Ted Budd all won their primaries.",
    "In Idaho's gubernatorial race, he supported Lieutenant Governor Janice McGeachin, who lost to incumbent Governor Brad Little.",
    "Trump has accused him of being a \"RINO,\" referring to the acronym \"Republican in name only,\" despite endorsing his 2018 bid.",
    "The latest Fox News poll shows Perdue, who lost his Senate race last January, trailing Kemp by double digits.",
    "Duncan noted the former president's waning influence in remarks reported by The Atlanta Journal-Constitution.",
    "However, the congressman lost the nomination to state Senator Chuck Edwards last week.",
    "Trump's endorsements in the most competitive races have been mixed so far.",
    "But other Trump-endorsed candidates including Ohio Senate candidate J.D.",
    "The race, however, is expected to head to a recount."
  ]
}