{
  "id": 7309,
  "mediaId": 323,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Georgia GOP Primary Elections for Governor and Secretary of State Are Top Contests Today",
  "image": "https://images.wsj.net/im-550050/?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/georgia-gop-primary-elections-for-governor-and-secretary-of-state-are-top-contests-today-11653384602",
  "sentiment": "0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cameron McWhirter",
  "authorUrl": "https://www.wsj.com/news/author/cameron-mcwhirter",
  "termIds": [
    815,
    1147,
    2087,
    2095,
    2203,
    3103,
    4325,
    227,
    428,
    2537,
    2672
  ],
  "sentences": [
    "Former football star Herschel Walker has a huge lead in polling over opponents looking to take on Mr. Warnock in Georgia, while former White House press secretary Sarah Sanders is expected to easily win the GOP nomination for governor in Arkansas, a state her father, Mike Huckabee, previously led.",
    "Brian Kemp and former Sen. David Perdue, as well as Secretary of State Brad Raffensperger and Rep. Jody Hice, are among the most prominent tests so far this year of Mr. Trumps political strength within the GOP, and in particular his unproven claims that his 2020 loss here was the result of fraud.",
    "In Texas, Land Commissioner George P. Bush is waging an uphill battle to win enough conservatives to oust state Attorney General Ken Paxton, a fiery incumbent who has sued the Biden administration 33 times and faces numerous ethical and legal scandals.",
    "Ms. Greenewho has sparked controversy with her skepticism of vaccines, her false assertions that the 2020 election was fraudulent and her past embrace of the conspiracy theory QAnonhas said voters in her district support her antiestablishment style.",
    "Elsewhere in Georgia, Rep. Marjorie Taylor Greene is seeking to fend off a GOP primary challenge from healthcare executive Jennifer Strahan, who contends the incumbent has done a poor job representing the districts interests.",
    "After Mr. Trumps 2020 loss, he and his advisers pressured Mr. Raffensperger to overturn the results, including with two telephone calls from the president to Mr. Raffensperger and a state employee that later were made public.",
    "During the campaign, Mr. Kemp, 58, avoided responding publicly to attacks from Mr. Trump and focused instead on the results of Georgias recently ended legislative session, such as pay raises for teachers and state employees.",
    "Mr. Hice, 62, a congressman who is not seeking reelection to that post so he can run for secretary of state, told the Journal at a campaign stop that Mr. Raffensperger has miserably failed the state of Georgia.",
    "Mr. Trump supported Mr. Kemp in his 2018 race for governor but turned on him after the former president narrowly lost in Georgia in 2020, the first GOP presidential candidate to do so since 1992.",
    "ATLANTAGeorgia voters head to the polls Tuesday in Republican primary elections pitting an incumbent governor and secretary of state against candidates backed by former President Donald Trump.",
    "Two full state recounts and a forensic audit found no evidence of widespread fraud and concluded that Mr. Trump had lost to Mr. Biden by about 12,000 votes out of five million cast.",
    "In Texas, Rep. Henry Cuellar, the only remaining House Democrat who opposes abortion, faces immigration attorney Jessica Cisneros in a bitterly contested runoff primary election.",
    "Kay Ivey, who is facing eight challengers, has been criticized for encouraging people to get vaccinated against Covid-19 and blaming the unvaccinated for the pandemics impacts.",
    "Vance in that crowded primarys closing weeks, but his candidate for governor in Nebraska, Charles Herbster, lost his contest amid allegations of groping women, which he denied.",
    "He has also highlighted a new law that allows residents to carry a concealed firearm without a state license, as well as a law limiting what teachers can discuss about racism.",
    "The winner of the GOP primary will face Stacey Abrams, the former top Democrat in the Georgia House of Representatives and a nationally known voting-rights advocate.",
    "Former top Shelby aide Katie Boyd Britt faces Rep. Mo Brooks, who had Mr. Trumps endorsement and then lost it when his campaign appeared to be flagging.",
    "Mr. Trumps endorsement choices will also be spotlighted in the Republican primary race to succeed retiring Alabama GOP Sen. Richard Shelby.",
    "Mr. Trump and his supporters argued that widespread fraud had occurred and Mr. Kemp, as governor, should have voided the results.",
    "Mr. Raffensperger, 67, an early supporter of Mr. Trumps candidacy in 2016, investigated the claims but found no widespread fraud.",
    "After the 2020 loss by Mr. Trump, two sitting Republican senators, Mr. Perdue and Kelly Loeffler, lost in January 2021 runoffs.",
    "Mr. Perdue, 72, Mr. Kemps chief opponent, ran a campaign that centered on the 2020 election and his endorsement by Mr. Trump.",
    "Mr. Warnock is up for reelection this year because he was filling out the final two years of a six-year term of office.",
    "Early polls suggest both Messrs. Kemp and Perdue would hold a slight advantage over Ms. Abrams in the fall election.",
    "GOP primaries in other states earlier this month showed mixed results for Mr. Trumps power to influence elections.",
    "Mr. Raffensperger has held that he followed the law, saying in one campaign speech, You cant argue with numbers.",
    "Mr. Kemp defeated her by about 55,000 votes in the 2018 gubernatorial race out of more than 3.9 million cast.",
    "Mr. Raffensperger is fighting to hold on to his job against Mr. Hice, who is backed by the former president.",
    "Democrats Jon Ossoff and Raphael Warnock took the seats, winning control of the U.S. Senate for their party.",
    "Republican primaries are also the most prominent races in some other states, including Alabama, where Gov.",
    "Mr. Trump hasnt said whether he would support Mr. Kemp in the general election should he win the primary.",
    "Write to Cameron McWhirter at cameron.mcwhirter@wsj.com and Joshua Jamerson at joshua.jamerson+1@wsj.com",
    "The race is a test of how the issue could affect voter turnout and races in the November election.",
    "The incumbent has kept top Republican donors in his fold and amassed a larger campaign war chest.",
    "The former president campaigned in Georgia for Mr. Perdue and hosted virtual town-hall events.",
    "Another key statewide race is the GOP primary for secretary of state, who oversees elections.",
    "Mr. Perdue has been endorsed by former GOP vice presidential candidate Sarah Palin.",
    "In the Georgia governors race, Mr. Trump has backed Mr. Perdue against Mr. Kemp.",
    "Mr. Trump vowed revenge against Mr. Kemp and endorsed Mr. Perdue, a close ally.",
    "Ms. Cisneros is trying to win by emphasizing her support for abortion rights.",
    "Former Vice President Mike Pence attended a rally Monday for Mr. Kemp.",
    "Mr. Trump and his supporters have publicly criticized him ever since.",
    "In polls, Mr. Perdue has trailed Mr. Kemp by double digits.",
    "Some other Republican primaries are less competitive.",
    "He has created havoc with our election system.",
    "He buoyed Ohio senate candidate J.D.",
    "The races between Gov."
  ]
}