{
  "id": 7345,
  "mediaId": 1576,
  "date": "d2022-05-25T00:00",
  "headline": "Takeaways: Trump's big primary defeat; scandals for the win",
  "image": "https://www.wabe.org/app/uploads/2022/05/Untitled-design-336x189.jpg",
  "link": "https://www.wabe.org/takeaways-trumps-big-primary-defeat-scandals-for-the-win/",
  "sentiment": "0.395",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    815,
    1147,
    1434,
    1951,
    2095,
    2203,
    2303,
    3102,
    4325,
    2537,
    2672
  ],
  "sentences": [
    "Trump has scored some primary victories with election deniers  most significantly last week in Pennsylvania, when Republican voters there chose his preferred gubernatorial candidate Doug Mastriano, who said he wouldn't have certified Biden's 2020 win of the state.",
    "Unlike Madison Cawthorn, a provocative congressman who lost his GOP primary in North Carolina last week, Greene didn't change districts, have a long string of personal scandals or infuriate Washington Republicans by alleging they participate in orgies.",
    "Back in Georgia, firebrand Rep. Marjorie Taylor Greene won her Republican primary, shrugging off challengers who complained Greene was giving the party a bad name by engaging in Holocaust denial and other headline-grabbing, bombastic behavior.",
    "He lied about founding a charity to help veterans get aid with mental health  he actually is paid $300,000 a year to work as a spokesperson for a for-profit company that others founded to recruit veterans for mental health care.",
    "To rally the base, he signed laws allowing most Georgians to carry guns without a permit and banning most abortions after a fetal heartbeat is detected  something that can happen as early as six weeks into pregnancy.",
    "Yet he easily won his primary against Land Commissioner George P. Bush, powered by his ability to use his office to cater to conservative causes by, for example, investigating the parents of transgender children.",
    "The victory came a year and a half after Kemp rejected Trump's demands to help overturn the presidential election by declaring Trump the winner in Georgia instead of Joe Biden, who actually won.",
    "But although it was too early to call the race, Raffensperger was well ahead of Hice on Tuesday, and the main question was whether he'd earn more than 50% of the vote and avoid a runoff.",
    "He also was falling short of his goal of ousting Secretary of State Brad Raffensperger, who personally rejected his calls to find enough votes to declare Trump the winner of Georgia.",
    "Here are some takeaways from Tuesday's primary elections in Georgia, Alabama, Arkansas, Texas and Minnesota:\nTRUMP'S BIGGEST PRIMARY DEFEAT\nTrump had hoped to turn Georgia Gov.",
    "He claimed to have founded a chicken processing company employing hundreds but reported only eight workers when applying for a loan during the coronavirus pandemic.",
    "Georgia underscores one of Trump's big problems if/when he runs again, Brendan Buck, a former spokesperson for onetime House Speaker Paul Ryan, tweeted Tuesday.",
    "Either way, it's clear the former president's harping on 2020 simply did not speak to Republican voters in Georgia, the country's newest battleground state.",
    "Unlike Trump in 2020, Perdue accepted his defeat Tuesday night, even seeming to brush aside some supporters who took up a chant suggesting there was fraud.",
    "Eventually even Republican Senate leader Mitch McConnell ended up embracing Walker as the party's best chance to oust Democratic U.S. Sen. Raphael Warnock.",
    "Instead, Kemp on Tuesday became an example of how Republican incumbents might not have as much to fear from Trump as the former president would like.",
    "He's under investigation for corruption by the FBI and by the state bar of Texas for his role in trying to overturn the 2020 presidential election.",
    "Perdue's campaign fixated on Trump's lie that the 2020 presidential election was stolen from him, but Kemp won by flexing the power of his office.",
    "Former football great Herschel Walker, Trump's pick for U.S. Senate in Georgia, dominated the Republican challengers in his primary.",
    "Elections are usually about the future, and by the time the 2024 GOP primary rolls around, November 2020 will be ancient history.",
    "DANGER OF ELECTION DENIAL\nThe Georgia governor's race wasn't the only Trump grudge match that backfired on the former president.",
    "He earned the support of Trump's vice president, Mike Pence, who appeared with him at a Georgia rally on the eve of the primary.",
    "Kemp cruised past former U.S. Sen. David Perdue in the Republican primary, easily clearing the 50% threshold to avoid a runoff.",
    "Trump set the model in 2016, and his followers are perfecting it  never let a scandal get in the way of winning an election.",
    "Voters also demonstrated an openness to embracing scandal-plagued candidates  depending on the candidate, and the scandal.",
    "Trump recruited U.S. Rep. Jody Hice from a safe congressional seat to challenge Raffensperger in the Republican primary.",
    "I'm sorry, but what we're going to do right now is make sure Stacey Abrams is not governor of this state, Perdue said.",
    "Despite the former president's efforts, Kemp comfortably led in polls and fundraising throughout the primary campaign.",
    "Republican Attorney General Ken Paxton was indicted in 2015 on securities fraud charges and is still awaiting trial.",
    "He, of course, won't be able to let go of the 2020 nonsense, and nobody wants to hear his whining about it anymore.",
    "Brian Kemp won his primary despite rejecting Trump's entreaties to overturn his 2020 election defeat in the state.",
    "But multiple Republicans have made clear they're eyeing 2024 presidential bids, including Pence and Florida Gov.",
    "He also announced an investment by Hyundai in a new plant in the state to make batteries for electric vehicles.",
    "Former President Donald Trump's crusade for vengeance suffered a devastating blow on Tuesday after Georgia Gov.",
    "She later obtained a restraining order against him after he reportedly threatened her for dating other men.",
    "His ex-wife said that during their marriage he held a gun to her head and threatened to kill her.",
    "And they have distanced themselves in ways large and small from Trump's election allegations.",
    "That's a complication for the former president's hopes to return to the White House in 2024.",
    "Now Kemp will face Democrat Stacey Abrams in a rematch of their 2018 gubernatorial clash.",
    "The institutions of the Republican Party also swung into action to protect Kemp.",
    "The bet is that voters won't care as much about scandals in post-Trump America.",
    "Party leaders had first shied away from him because of his checkered history.",
    "Walker, in his autobiography, admits struggling with mental illness.",
    "High-profile Republican governors including former New Jersey Gov.",
    "The Republican Governors Association paid for ads supporting him.",
    "DECLINING POWER OF SCANDAL\nTrump did notch some wins Tuesday.",
    "They came with baggage, but that didn't seem to stop them.",
    "That theory certainly got a boost Tuesday in Texas, too.",
    "Brian Kemp into an example of the danger in defying him.",
    "More will win in the weeks to come.",
    "Doug Ducey campaigned with him.",
    "Pete Ricketts and Arizona Gov.",
    "Chris Christie, Nebraska Gov.",
    "Ron DeSantis."
  ]
}