{
  "id": 7369,
  "mediaId": 65,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Primary elections in Georgia, Alabama, runoff in Texas",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/d429ae3a-723b-43db-bd39-7bc0cb426cc2/53e9827a-204d-4004-80a1-d89f35413180/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/live-news/primary-elections-in-georgia-alabama-runoff-in-texas",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxnews.com/person/o/tyler-olson",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "Ahead of the election on Tuesday, leading contenders for the Republican nomination in the Alabama Senate race were Katie Boyd Britt, Shelby's former chief of staff who once led the Business Council of Alabama; Rep. Mo Brooks, R-Ala., an outspoken conservative in Congress who received an endorsement from Trump but later lost it; and Mike Durant, a business owner in the state and a former Army pilot who was involved in the \"Black Hawk Down\" incident.",
    "And on the eve of the Peach State's primary  with Trump backing Kemp challenger former Sen. David Perdue  the former president took aim at the governor one last time before voters headed to the polls\n\"Brian Kemp is truly an embarrassment to the Republican Party because of what's taken place in your great state, Georgia,\" Trump charged during a tele-rally Monday evening on behalf of Perdue.",
    "Brian Kemp held off Trump-backed challenger, former Sen. David Perdue\nTrump is also supporting GOP Rep. Jody Hice in his bid to unseat Georgia Secretary of State Brad Raffensperger\nIn Alabama, Rep. Mo Brooks, former Senate staffer Katie Britt and veteran Mike Durant are in a competitive three-way Republican primary for an open Senate seat.",
    "To read more from Fox News' Kyle Morris, click here\nTexas Attorney General Ken Paxton Tuesday successfully fought off a primary challenge from Texas Land Commissioner George P. Bush, meaning the last member of the Bush political dynasty in elected office will soon be without a job.",
    "That race represents a proxy war between the left wing of the Democratic Party and establishment supporters of Cuellar, including House Speaker Nancy Pelosi\nTexas Land Commissioner George P. Bush lost his primary challenge to Attorney General Ken Paxton.",
    "To read more from Fox News' Tyler Olson and Paul Steinhauser, click here\nTexas Attorney General Ken Paxton is facing primary challenge from George P. Bush on Tuesday in the Republican primary runoff for the Lone Star state's top law enforcement officer.",
    "To read more from Fox News' Paul Steinhauser, click here\nPolls in Alabama have closed as one candidate who recently surged in polling aims to obtain a seat held by longtime Alabama Republican Sen. Richard Shelby, who is retiring at the end of his term.",
    "Bush, twice elected to statewide office as Texas land commissioner, is the last elected member of his family's political dynasty  which over four generations has produced two family members who rose to become president, George W. Bush and George H.W.",
    "To read more from Fox News' Paul Steinhauser and Tyler Olson, click here\nRep. Marjorie Taylor Greene, R-Ga., Tuesday won the GOP nomination for her seat after an establishment-backed primary challenge from businesswoman Jennifer Strahan.",
    "Polls in Arkansas have closed as former White House press secretary Sarah Huckabee Sanders is favored to win the GOP nomination for governor and incumbent Sen. John Boozman hopes to fend off his primary challengers in a contentious race.",
    "Paxton, who is backed by former President Donald Trump, is known nationally for trying to legally upend the 2020 presidential election results and for his aggressive actions in taking on President Biden's administration in court.",
    "Trump's endorsement powered Ohio GOP Senate nominee JD Vance to a major comeback victory last month and set Pennsylvania senate candidate Mehmet Oz up as a frontrunner in his race, which isn't yet called a week after the primary.",
    "Brian Kemp Tuesday told supporters at his victory party that after his primary victory over former Sen. David Perdue, the real fight is beginning against Democrat nominee Stacey Abrams\n\"Our battle is far from over,\" he said.",
    "If no candidate gets 50%, there will be a runoff next month between the top two\nIn Texas, Democrat Rep. Henry Cuellar and AOC-backed primary challenger Jessica Cisneros are neck-and-neck in a primary runoff.",
    "Rep. Lucy McBath, D-Ga., beat Rep. Carolyn Bourdeaux, D-Ga., in a member-on-member primary in Georgia Tuesday, the Associated Press projects, making Bourdeaux the latest incumbent casualty of the midterms.",
    "To read more from Fox News' Kyle Morris, click here\nFormer football star Herschel Walker won Georgia's Republican Senate primary Tuesday, as he seeks to unseat Sen. Raphael Warnock, D-Ga., in November.",
    "But now Kemp, one of the Republicans Trump has attacked the most since 2020, is headed to a general election matchup against Democrat Stacey Abrams and Perdue is out of public office for now.",
    "Paxton is best known nationally for trying to legally upend the 2020 presidential election results and for his aggressive actions in taking on President Biden's administration in court.",
    "Perdue jumped into the race days after Abrams, a rising star in the Democratic Party and a nationally known champion of voter rights, launched her second straight gubernatorial bid.",
    "Meanwhile in Texas, George P. Bush -- the last member of the Bush family in public office -- is mounting a primary challenge against Trump-supported Attorney General Ken Paxton.",
    "Brian Kemp Tuesday beat former Sen. David Perdue in a GOP gubernatorial primary, striking the most significant blow yet to a candidate endorsed by former President Donald Trump.",
    "Ahead of Tuesday's election, Sanders, who announced she was running for governor in January 2021, consistently polled ahead of Francis \"Doc\" Washburn, her primary challenger.",
    "In Alabama, former Senate staffer Katie Britt, Rep. Mo Brooks and veteran Mike Durant are vying for what will likely be two spots in a runnoff set for next month.",
    "I am fully supporting Brian Kemptomorrow morning you are going to hear me going to work...to make damn sure Stacey Abrams is not the next governor of Georgia.\"",
    "The contentious GOP primary race for the Senate is likely to lead to a runoff election on June 21 should no candidate garner more than 50% of Tuesday's vote.",
    "ET Tuesday, with yet another test of former President Donald Trump's endorsement clout on deck in the state's gubernatorial and secretary of state primaries.",
    "Last year, Trump repeatedly urged Perdue to primary challenge the governor and endorsed him the day after the former senator announced his bid in December.",
    "Paxton's victory, projected by the Associated Press, is also a victory for former President Donald Trump, who endorsed the attorney general for reelection.",
    "Former White House press secretary Sarah Huckabee Sanders is projected to win the Arkansas Republican gubernatorial primary, the Associated Press projects.",
    "Trump traveled to Georgia in late March to headline a rally for Perdue, starred in his campaign commercials, and called into two tele-rallies this month.",
    "Bourdeaux is a member of the moderate Blue Dog Coalition, and her loss will slightly weaken the strength of moderate House Democrats in Congress.",
    "Endorsed early on in the race by former President Trump, Sanders hopes to clinch her party's nomination in an attempt to replace incumbent Gov.",
    "Kemp's victory over Perdue, projected by the Associated Press, breaks a trend of significant success for Trump with his primary endorsements.",
    "\"Tonight, the fight for the soul of our state begins to make sure that Stacey Abrams is not going to be our governor or the next president.\"",
    "He earned endorsements from both former President Donald Trump and Senate Minority Leader Mitch McConnell, R-Ky., in the GOP primary race.",
    "Bush is the last member of his family in political office, and his loss represents an end of the Bush political dynasty\nGOP Georgia Gov.",
    "Both contests will be a major test of Trump's sway in the GOP and whether Republican voters continue to be focused on the 2020 election.",
    "Georgia, a crucial general election battleground, is one of three states holding primaries on Tuesday, along with Alabama and Arkansas.",
    "Greene has apologized for many of her past comments, but nevertheless was removed from her House committees by congressional Democrats.",
    "Greene earned significant criticism from many in the GOP for her past controversial comments, including some which were anti-Semitic.",
    "But even though Trump retains immense sway over the GOP, his full court press hasn't boosted Perdue in his uphill challenge of Kemp.",
    "But Kemp earned Trump's ire after certifying the 2020 presidential election results in Georgia following two recounts of the vote.",
    "Also in Georgia, Rep. Marjorie Taylor Greene, R-Ga., is facing a primary challenge from businesswoman Jennifer Strahan.",
    "Strahan's campaign got some national GOP attention, but it's not clear if she'll be able to best the incumbent Greene.",
    "The Georgia race grabbing the most attention from coast to coast is GOP gubernatorial primary, where conservative Gov.",
    "Strahan was backed by the Republican Jewish Coalition and other establishment DC figures like Sen. Bill Cassidy, R-La.",
    "But that wasn't enough to power her over the firebrand Trump-supporter Greene in her deep-red north Georgia district.",
    "But he is saddled with a slew of corruption allegations as he seeks a third four-year term as Texas attorney general.",
    "But he is saddled with a slew of corruption allegations as he seeks a third four-year term as Texas attorney general.",
    "And voters are also heading to the polls in Texas, where there are primary runoffs for attorney general and Congress.",
    "And while Trump is not on the ballot, his presence looms large over many of the high-profile GOP showdowns.",
    "Due to redistricting in Georgia, McBath was forced out of her district and into a face-off with Bourdeaux.",
    "Walker is a rare candidate to unite both the MAGA wing and the establishment win of the Republican party.",
    "Meanwhile, Secretary of State Brad Raffensperger looks to hold off a Trump-backed Rep. Jody Hice, R-Ga.",
    "Four years ago, with the support of the then-president, Kemp narrowly defeated Democrat Stacey Abrams.",
    "Trump saw his picks in Georgia's governor race and secretary of state race lose earlier Tuesday night.",
    "To read more from Fox News' Paul Steinhauser, click here\nPolls closed for voters in Georgia at 7 p.m.",
    "Polls in Texas closed at 7 p.m. CT except for the two most Western districts, which close 7 p.m. MT.",
    "Endorsed early on in the race by former President Trump, Sanders is hoping to replace incumbent Gov.",
    "Asa Hutchinson, who is term-limited and has served as governor of the state since 2015.",
    "Asa Hutchinson, who is term-limited and has served as governor of the state since 2015.",
    "To read more from Fox News' Paul Steinhauser, click here\nGet the Best of Fox News",
    "Washburn is a former radio talk show host who now has his own national podcast.",
    "ET Tuesday, with several key primary races at stake in the two southern states.",
    "I just called the governor and I congratulated him,\" Perdue said Tuesday.",
    "Brian Kemp is being challenged by Trump-backed former Sen. David Perdue.",
    "As of May 18, 96% of Trump-supported candidates won their primaries.",
    "To read more from Fox News' Kyle Morris, click here\nGeorgia Gov.",
    "ATLANTA  Former President Donald Trump has targeted Georgia Gov.",
    "Brian Kemp, who's supported by former Vice President Mike Pence.",
    "Polls closed for primary voters in Texas and Alabama at 8 p.m.",
    "\"And David will make a massive upgrade as your governor.\"",
    "Trump-endorsed former Sen. David Perdue is taking on Gov.",
    "Bush, and one who became a senator, Prescott Bush.",
    "Abrams is unopposed in the Democratic primary.",
    "Brian Kemp for nearly a year and a half.",
    "FAST FACTS\nGOP Georgia Gov."
  ]
}