{
  "id": 7372,
  "mediaId": 151,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Kemp notches huge primary win in Georgia",
  "image": "https://www.politico.com/dims4/default/fc41d3f/2147483647/legacy_thumbnail/1200x837%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Ffe%2F60%2Fc97b7b924cffb13ce679f75968d5%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1398904951",
  "link": "https://www.politico.com/news/2022/05/24/may-24-primary-2022-results-00034888",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "Back in Georgia, Trump has also sought to put his stamp on the secretary of state race, after incumbent Republican Brad Raffensperger declined his push to subvert the 2020 election results there, and two Democratic congresswomen are battling over a single seat after redistricting.",
    "Top contenders include state Rep. Jeremy Munson, who is backed by members of the House Freedom Caucus; former state Rep. Brad Finstad, who is backed by the centrist Republican Main Street Partnership's PAC; and Jennifer Carnahan, the widow of the late incumbent.",
    "Safe-seat GOP primaries\nRepublicans will select nominees in several deep-red seats as well: the races to replace Brooks in northern Alabama and Hice in central Georgia, and the primary to fill a new, heavily Republican seat in the northern Atlanta suburbs.",
    "Here's the latest:\nKemp holds off Perdue\nTrump has been on the warpath in Georgia since his loss there in 2020, blaming Kemp and other Republicans in the state for not helping him overturn his defeat that has ripped open deep divides in the state party.",
    "Two Democratic House members face off in Georgia\nAnd in the House, GOP-controlled redistricting left Democratic Reps. Lucy McBath and Carolyn Bourdeaux fighting over one deep blue seat in the northern Atlanta suburbs.",
    "Brian Kemp clinched his GOP primary early Tuesday night despite facing a Donald Trump-endorsed challenger  a major win for the GOP governor ahead of what's expected to be a hard-fought general election campaign.",
    "Bourdeaux, the more moderate of the two, angered the Democratic base when she became a leading advocate for the push to uncouple Biden's massive social spending plan from the bipartisan infrastructure bill.",
    "She received help on the air from the crypto-backed Protect our Future group, Michael Bloomberg's gun-control super PAC and a similar group, Everytown for Gun Safety, with which McBath once had close ties.",
    "House nominations in two districts on the edge of the battlefield\nThe GOP will also choose a nominee in the special primary to replace the late Republican Rep. Jim Hagedorn in southern Minnesota.",
    "The nominee will face Stacey Abrams, who didn't face any opposition to secure the Democratic nod, in what is expected to be one of the most competitive campaigns for governor in the country.",
    "Republicans in two deep-red states are also voting in major Senate contests, while Trump-endorsed Herschel Walker is looking to sew up the nomination for the battleground race in Georgia.",
    "The former president has attacked Kemp repeatedly since the 2020 election, when Kemp refused Trump's pressure to not certify the election after President Joe Biden narrowly won the state.",
    "And in Texas, state Attorney General Ken Paxton glided past a primary challenge from George P. Bush, the state land commissioner with arguably the most famous last name in Texas politics.",
    "Ruben Ramirez, a moderate backed by the Blue Dogs, is facing the more progressive Michelle Vallejo, for the chance to take on Republican Monica De La Cruz in the state's 15th District.",
    "He endorsed a slate of statewide candidates  including Herschel Walker, who is expected to outright win the GOP nomination to face Democratic Sen. Raphael Warnock in November.",
    "A former intern in Cuellar's office making her second run against him, Cisneros is backed by prominent progressives, including Rep. Alexandria Ocasio-Cortez (D-N.Y.) and Sens.",
    "The last anti-abortion House Democrat\nIn Texas, progressives are hoping to finally oust Cuellar, one of the most conservative House Democrats, in Tuesday's primary runoff.",
    "Former football player Jake Bequette has benefited from super PAC donations from billionaire Richard Uihlein, who has sunk millions into GOP primaries in recent years.",
    "Brian Kemp speaks at a campaign event attended by former U.S. Vice President Mike Pence at the Cobb County International Airport on May 23, 2022 in Kennesaw, Georgia.",
    "All told, five states are holding primaries on Tuesday: Georgia, Alabama, Arkansas, runoffs in Texas and a primary for a special congressional election in Minnesota.",
    "Perdue's bid has been laser-focused on Trump's grievances about the 2020 election, while the conservative Kemp tried to shore up his credentials in other areas.",
    "The race to succeed retiring GOP Sen. Richard Shelby is down to three candidates on the Republican side, with two likely heading to a runoff later this summer.",
    "In South Texas, Rep. Henry Cuellar  the last House Democrat to oppose abortion rights  faces a difficult challenge from progressive attorney Jessica Cisneros.",
    "But Kemp touted other aspects of his record as a conservative governor, outraised Perdue and built a growing lead in the polls heading into primary day.",
    "The race is one of the highest profile contests where a Trump-backed election denier is trying to take the reins of a state's election infrastructure.",
    "Trump's efforts to remake Georgia's roster of statewide officeholders\nTrump's involvement in Georgia wasn't just limited to the governor's race.",
    "Trump has also endorsed candidates for attorney general and lieutenant governor, but state Attorney General Chris Carr won easily anway.",
    "Cisneros made abortion a more central part of her campaign following new of the Supreme Court's preparations to overturn Roe v. Wade.",
    "Alabama, Arkansas and Texas Republicans all go for Trump\nAlabama has a pair of big statewide Republican primaries on Tuesday as well.",
    "Brooks was once endorsed by Trump in the contest, but the former president unendorsed him after Brooks started slpping in the polls.",
    "The incumbent, a moderate Blue Dog Democrat, got support from House Democratic leadership and a duo of big-spending super PACs.",
    "| Joe Raedle/Getty Images\nBy Zach Montellaro and Ally Mutnick\n 05/24/2022 06:33 PM EDT\nUpdated: 05/24/2022 09:29 PM EDT\nGov.",
    "President Joe Biden carried it by just 7 points in 2020, and former Ted Cruz aide Cassy Garcia is the GOP primary favorite.",
    "The race is coming down to former Shelby chief of staff Katie Britt, former Army pilot Mike Durant and Rep. Mo Brooks.",
    "Trump's chosen candidate for Senate, Herschel Walker, easily won his primary to face Democratic Sen. Raphael Warnock.",
    "State Rep. Bee Nguyen has been the fundraising leader on the Democratic side, though there has been little polling.",
    "Meanwhile, Raffensperger also has a Trump-backed primary challenger for secretary of state in GOP Rep. Jody Hice.",
    "The former White House press secretary cleared the field of her most formidable Republicans opponents months ago.",
    "McBath, a gun-control advocate who lost her son to gun violence, is a rising star in the Democratic Party.",
    "The district leans Republican, but the top Democratic contender is former Hormel Foods CEO Jeff Ettinger.",
    "Cuellar, meanwhile, says his views on abortion are in line with the heavily Catholic and rural district.",
    "The contest for the open Arkansas governor race is much simpler: Sarah Huckabee Sanders is a shoo-in.",
    "Ivey, who has spread into the stolen election mythology in TV ads, has been leading in all the polls.",
    "Democrats are also picking a nominee in a competitive but conservative-leaning South Texas seat.",
    "But the big question is if she can hit the 50 percent threshold to win the nomination outright.",
    "And in Minnesota, both parties will pick nominees for a special House election later this year.",
    "Kemp defeated Trump-endorsed David Perdue after Perdue was recruited into the race by Trump.",
    "Bourdeaux currently represents more of the district but McBath is favored in this matchup.",
    "But Brooks has risen in the race in the closing weeks, and could very well make a runoff.",
    "is also leaning on Trump to help him see off a primary challenger in Arkansas.",
    "In stepped Perdue, the former senator and a one-time ally of Kemp.",
    "The Georgia race was the headliner in a five-state primary night.",
    "Republicans will target the district regardless of who wins.",
    "Kay Ivey is facing a wide field of primary challengers.",
    "Bernie Sanders (I-Vt.) and Elizabeth Warren (D-Mass.).",
    "Paxton ran with Trump's endorsement.",
    "Back in Alabama, Republican Gov.",
    "Sen. John Boozman (R-Ark.)",
    "Georgia Gov."
  ]
}