{
  "id": 7407,
  "mediaId": 136,
  "date": "5/25/2022 12:00:00 AM",
  "headline": "Trump-Backed Herschel Walker, Who Questioned Evolution, Wins in Georgia",
  "image": "https://d.newsweek.com/en/full/2043511/herschel-walker-trump-georgia.webp?w=790&f=bb4cbbacf91c6d703706a54f3624307c",
  "link": "https://www.newsweek.com/trump-backed-herschel-walker-anti-evolution-candidate-wins-georgia-1709276",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Fung",
  "authorUrl": "https://www.newsweek.com/authors/katherine-fung",
  "termIds": [
    815
  ],
  "sentences": [
    "\"After playing with the New Jersey Generals, I returned to Athens to complete my degree, but life and football got in the way,\" the GOP nominee said in a statement acknowledging the false claim to The Atlanta Journal-Constitution.",
    "Former football star Herschel Walker, who earned Donald Trump's endorsement, won his Senate primary race in Georgia, beating out five other Republican candidates to face off against Democratic Senator Raphael Warnock in November.",
    "His stances have been commended by Senator Minority Leader Mitch McConnell, who said Walker is \"a quick study and very good at bridging the divisions down there that have been on full display for the last couple of years.",
    "Walker, who was caught lying about graduating from college and refused to debate any of his opponents during his campaign, was one of the more controversial candidates Trump endorsed this midterm season.",
    "Also, Walker's campaign website said in a now-deleted reference that he \"graduated from [the University of Georgia] with a Bachelor's degree in Criminal Justice.\"",
    "Last fall, he told his predominately white supporters at a Trump rally, \"Don't let the left try to fool you with this racism thing, that this country is racist.\"",
    "Herschel's remarks are in line with the 40 percent of Americans who said they believe they were created by God in human form, according to a 2019 Gallup poll.",
    "Last year, the former Dallas Cowboys star testified to Congress that he doesn't believe in reparations, noting, \"We use Black power to create white guilt.\"",
    "Since his bid for Senate, accusations of threatening behavior previously reported to police by a number of women, including his ex-wife, have emerged.",
    "On Tuesday, the race was called for Walker after he secured more than 70 percent of the vote at the time the race was called by the Associated Press.",
    "Last year, he tweeted that \"voter suppression bills\" introduced in state legislatures were \"unlike anything we have seen since the Jim Crow era.\"",
    "Warnock, the first Black senator from Georgia, has been outspoken on racial issues, especially voting rights in his home state.",
    "Walker, who called Trump a \"good man\" during his 2016 presidential bid, has defended the former president on race.",
    "During last year's Republican National Convention, he said: \"Growing up in Deep South, I've seen racism up close.",
    "Warnock is a longtime civil rights champion and a senior pastor of Martin Luther King Jr.'s former church.",
    "Both candidates are Black, and it's highly expected that race will play a major role in the race.",
    "But he left UGA during his junior year to play with the United States Football League.",
    "Among some of his more contentious comments was a statement dismissing evolution.",
    "Walker, on the other hand, appears to have more complicated views on race.",
    "Herschel said at a March appearance at a church in Sugar Hill, Georgia.",
    "Which I think is really important going into the general [election].\"",
    "Walker will try to unseat Warnock in November's general election.",
    "\"At one time, science said man came from apes, did it not?\"",
    "Most scientists accept the theory of evolution.",
    "\"If that is true, why are there still apes?",
    "Walker has denied those charges.",
    "And it isn't Donald Trump.\"",
    "I know what it is.",
    "Think about it.\""
  ]
}