{
  "id": 7410,
  "mediaId": 195,
  "date": "d2022-05-24T23:53",
  "headline": "Herschel Walker clinches GOP Senate nomination in Georgia",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/094af8daa3e3450cbe1724f312dd8074.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3499698-herschel-walker-clinches-gop-senate-nomination-in-georgia/",
  "sentiment": "0.95",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    815,
    1136,
    1147,
    2087,
    146,
    428,
    571,
    3241,
    5621,
    2672
  ],
  "sentences": [
    "The party is already defending the narrowest possible Senate majority, and, given President Bidens sagging approval ratings and a bevy of domestic political challenges, Republicans appear well within reach of reclaiming control of the upper chamber.",
    "Warnock, whos running for his first full term in the Senate after winning a runoff election last year, is a top target for Republicans as they look to win back their Senate majority in a politically challenging year for Democrats.",
    "Beyond Trumps endorsement, Walker entered the Senate race as a star in his own right, having played football for the University of Georgia for two years before embarking on a lengthy career in the NFL.",
    "Former NFL star Herschel Walker is projected to easily clinch the Republican Senate nomination in Georgia, securing his spot on the ballot to face off against Sen. Raphael Warnock (D-Ga.) in November.",
    "Recent polling shows a tight race, with one survey from The Hill and Emerson College released last month finding Walker with a 4-point lead in a head-to-head match-up against Warnock.",
    "Still, Warnock has proven to be a prolific fundraiser and adept orator, raising Democrats hopes that hell be able to overcome tough headwinds in November.",
    "While half a dozen Republicans sought the partys Senate nomination in Georgia, Walker has long been seen as the favorite to win Tuesdays primary.",
    "He has never run for public office before, has been accused of domestic abuse and has spoken openly about his mental health struggles.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Nevertheless, he remains a beloved figure for many Georgians and has the political winds at his back this year.",
    "The general election match-up between Warnock and Walker is among the highest-stakes races in the country.",
    "He jumped into the race last summer and quickly picked up the endorsement of former President Trump.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "NBC and ABC News both called the race before 8 pm.",
    "Walker, meanwhile, has his own liabilities.",
    "ET."
  ]
}