{
  "id": 7411,
  "mediaId": 195,
  "date": "d2022-05-24T23:43",
  "headline": "Warnock easily secures Democratic Senate nomination in Georgia",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2021/12/warnockraphael_120721gn2_lead.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3499723-warnock-easily-secures-democratic-senate-nomination-in-georgia/",
  "sentiment": "0.501",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    815,
    1131,
    1136,
    1147,
    146,
    428,
    571,
    3241,
    2672
  ],
  "sentences": [
    "Democrats, who control both chambers of Congress and the White House, are fending off an aggressive push by Republicans who are eager to get back into power after disappointing elections in 2018 and 2022.",
    "Warnock, who defeated former Sen. Kelly Loeffler (R-Ga.) in an early 2021 runoff special election, is seen as one of the most vulnerable Democratic incumbents up for reelection this year.",
    "Recent polling shows a tight contest, with one survey from The Hill and Emerson College released last month finding Walker with a 4-point lead in a head-to-head matchup against Warnock.",
    "The Associated Press called the race for him at 7:41 p.m.\nWarnock faced only nominal opposition in the Democratic primary and his win on Tuesday was never in any serious doubt.",
    "Walker, a first-time candidate, has the endorsement of former President Trump and is widely viewed as the favorite to emerge from the GOP senate primary in Georgia on Tuesday.",
    "And given that the party in power tends to lose ground in midterm elections, Republicans are heading into this years campaign season with the political winds at their back.",
    "Still, hes expected to face a tough general election campaign this fall as Democrats look to maintain their paper-thin Senate majority in a tough midterm year.",
    "Sen. Raphael Warnock (D-Ga.) is projected to secure renomination on Tuesday, crossing a key hurdle in his bid for his first full term in the Senate.",
    "Hes proven himself to be a prolific fundraiser and adept public speaker, and he has the advantage of incumbency in the race.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Still, Warnock is seen as a strong candidate by both Democrats and many Republicans.",
    "Hes expected to face former NFL player Herschel Walker in the general election.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}