{
  "id": 7420,
  "mediaId": 1546,
  "date": "d2022-05-24T22:26",
  "headline": "Biden Says 'We Have to Act' After Texas School Shooting",
  "image": "https://gdb.voanews.com/03180000-0aff-0242-93b8-08da3df5a28a_w1023_r1_s.jpg",
  "link": "https://www.voanews.com/a/biden-says-we-have-to-act-after-texas-school-shooting-/6588279.html",
  "sentiment": "0",
  "mediaOutlet": "VOA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.voanews.com/author/associated-press/j_-yt",
  "termIds": [
    815,
    895,
    915,
    1024,
    2087,
    2250,
    2626,
    2672,
    2826,
    2934
  ],
  "sentences": [
    "Vice President Kamala Harris said earlier that people normally declare in moments like this, \"our hearts break  but our hearts keep getting broken ... and our broken hearts are nothing compared to the broken hearts of those families.\"",
    "It's unclear if the latest tragedy will change the political dynamic around guns after so many others  including the 2012 shooting at Sandy Hook Elementary School in Connecticut that killed 26, including 20 children  failed to do so.",
    "Greg Abbott from the presidential plane \"to offer any and all assistance he needs in the wake of the horrific shooting in Uvalde, TX,\" White House communications director Kate Bedingfield tweeted.",
    "In a reminder of the issue's divisiveness, Biden's call for gun control on Tuesday was booed at a campaign event in Georgia hosted by Herschel Walker, a Republican running for U.S. Senate.",
    "washington \nAn anguished and angry President Joe Biden called for new restrictions on firearms Tuesday night after a gunman massacred 18 children at a Texas elementary school.",
    "Just two days before Biden left on his trip, he met with victims' families after a hate-motivated shooter killed 10 Black people at a grocery store in Buffalo, New York.",
    "With first lady Jill Biden standing by his side in the Roosevelt Room, the president said, \"It's time we turned this pain into action.\"",
    "The back-to-back tragedies served as sobering reminders of the frequency and brutality of an American epidemic of mass gun violence.",
    "At least 18 students were killed in Texas, according to a state senator who said he was briefed by law enforcement.",
    "Biden directed that American flags be flown at half-staff through sunset Saturday in honor of the victims in Texas.",
    "Biden said at the White House shortly after returning from a five-day trip to Asia that was bookended by tragedy.",
    "\"We have to have the courage to take action ... to ensure something like this never happens again,\" she said.",
    "White House press secretary Karine Jean-Pierre said Biden was briefed on the shooting aboard Air Force One.",
    "\"These kinds of mass shootings rarely happen anywhere else in the world,\" Biden said.",
    "\"We have to act,\" Biden told the nation, after years of failure to pass new laws.",
    "You feel like you're being sucked into it and never going to be able to get out.\"",
    "\"To lose a child is like having a piece of your soul ripped away,\" Biden said.",
    "\"When in God's name are we going to stand up to the gun lobby?\"",
    "Shortly before landing in Washington, he spoke with Texas Gov.",
    "\"There's a hollowness in your chest.",
    "One teacher was killed.",
    "So was the gunman.",
    "\"Why?\""
  ]
}