{
  "id": 7423,
  "mediaId": 409,
  "date": "d2022-05-24T20:37",
  "headline": "Georgia Governor Kemp Defeats Perdue in GOP Primary, Setting Up Rematch against Stacey Abrams",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/05/brian-kemp-election-night.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/georgia-governor-kemp-defeats-perdue-in-gop-primary-setting-up-rematch-against-stacey-abrams/",
  "sentiment": "-0.35",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brittany Bernstein",
  "authorUrl": "https://www.nationalreview.com/author/brittany-bernstein/",
  "termIds": [
    815,
    1951,
    2095,
    4325,
    146,
    428,
    571,
    2672
  ],
  "sentences": [
    "Walker, a former University of Georgia football star, easily won the primary and will face Senator Raphael Warnock in November, despite concern from some that Walker may not be a strong general election candidate because of allegations he has faced in the past of domestic violence and making threats toward women.",
    "During his first term, Kemp  who was once a top Trump ally  became a target for attacks from former president Trump after the Georgia Republican refused to call a special session of the state legislature to appoint new slate Trump-allied electors to the 2020 Electoral College.",
    "Even when Tuesdays primary races saw record early voter turnout more than 850,000 ballots were cast in person or returned via absentee ballot in three weeks of early voting Abrams claimed that the voter turnout is not proof that the law has not caused voter suppression.",
    "Meanwhile, Trump-backed Senate candidate Herschel Walker defeated several competitors to win the Republican primary, including state Agriculture Commissioner Gary Black and military veteran Latham Saddler, the AP projected.",
    "While Kemp drew Trumps ire, he earned an endorsement from former vice president Mike Pence, who offered his full support for four more years of Brian Kemp as governor of the great state of Georgia.",
    "Georgia Governor Brian Kemp has successfully fended off a challenge from former Senator David Perdue in the states Republican gubernatorial primary, the Associated Press has projected.",
    "Increased [voter] turnout has nothing to do with suppression  suppression is about whether or not you make it difficult for voters to access the ballot, she said.",
    "Kemp bested Abrams by 55,000 votes in November 2018, though Abrams contested the race and has made repeated claims that the election was stolen from her.",
    "Abrams peddled disinformation about Georgias new election law, becoming one of many Democrats to claim the law would suppress voter turnout.",
    "Many believe Trumps rhetoric around voter fraud discouraged Georgia voters from showing up to polls, giving the two Democrats the edge.",
    "The victory sets up a rematch between the governor and Democrat Stacey Abrams, whom he defeated in the 2018 general election.",
    "She has, to this day, never conceded to Kemp and said as recently as October, Just because you win, doesnt mean you won.",
    "The former president encouraged Perdue to run against Kemp and endorsed Perdue when he announced his campaign.",
    "Perdues defeat, along with the loss of Republican Kelly Loeffler, handed control of the Senate to Democrats.",
    "Perdue, meanwhile, lost a runoff Senate election to Democratic challenger Jon Ossoff in 2021.",
    "The race was, to some extent, a test of what power Trump still holds in the party.",
    "Trump went so far as to say that Abrams might be better than Kemp."
  ]
}