{
  "id": 7427,
  "mediaId": 136,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Herschel Walker Denies Trump Ever Said Election Was 'Stolen'",
  "image": "https://d.newsweek.com/en/full/2044429/trump-hasnt-claimed-stolen-election-herschel-walker.webp?w=790&f=097f1f49804fe5268e9bb6edc5405508",
  "link": "https://www.newsweek.com/herschel-walker-donald-trump-voter-fraud-claims-1709674",
  "sentiment": "-0.845",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Stanton",
  "authorUrl": "https://www.newsweek.com/authors/andrew-stanton",
  "termIds": [
    815,
    1147,
    1951,
    2087,
    6018,
    146,
    571,
    2555,
    2672
  ],
  "sentences": [
    "His election fraud claims resulted in pushes for audits in swing states, which upheld President Joe Biden's victory, as well as the violent riot at the United States Capitol on January 6, 2021, when a large group of Trump supporters attempted to block the certification of the Electoral College votes.",
    "News anchor Russ Spencer confronted Walker about the claims during a testy exchange, noting the importance of a candidate's embrace of the claims to receive the former president's endorsement, asking Walker if he believes the election was stolen.",
    "But Walker, who received Trump's endorsement for his Senate campaign, said he has never heard Trump claim the election was stolen during an interview with Atlanta-based news station WAGA-TV this week.",
    "GOP candidate Herschel Walker, currently running to represent Georgia in the U.S. Senate, denied that former President Donald Trump has ever claimed the 2020 presidential election was stolen.",
    "Following Trump's defeat, he and his allies repeatedly claimed the election was stolen due to widespread voter fraud in key battleground states, despite any evidence to back up this theory.",
    "The race will likely become one of the most closely watched races during the November midterm elections, since Georgia has emerged as a pivotal swing state narrowly won by Biden in 2020.",
    "Republicans, including Walker, hope to capitalize on Biden's struggling poll numbers to defeat Democrat Raphael Warnock, who won the seat in a January 2021 runoff election.",
    "While speaking at the American Freedom Tour in Austin, Texas, earlier in May, he said he was writing a book about the alleged fraud called The Crime of the Century.",
    "The issue has become a test of loyalty to the former president within the GOP, and the candidates he has endorsed have largely parroted these claims.",
    "He then sought to turn the question around, noting that Democratic gubernatorial candidate Stacey Abrams did not concede during her 2018 election.",
    "Spencer then noted that while Abrams has not conceded, she has not brought it up \"on a regular basis for a year and a half\" as Trump has done.",
    "He's never said that to me,\" Walker responded, prompting Spencer to point out that Trump has \"said it over and over.",
    "Walker is likely to win the GOP nomination for the Senate race during Tuesday night's primary, according to polls.",
    "Walker hit back: \"I'm not saying the presidentbut everyone knows that something happened in the election.\"",
    "\"But in that instance right there, I said, 'Guys, there's people that they're unhappy with the election.",
    "A clip of the exchange had been viewed more than 100,000 times on Twitter by early Tuesday afternoon.",
    "Trump, indeed, has claimed numerous times that he only lost the election due to election fraud.",
    "I don't know what it wasbut something happened because people are angry,\" Walker said.",
    "The latest Fox News poll showed him winning 66 percent of the vote in the GOP primary.",
    "Walker said if he did not believe Trump's claims, he \"would disagree with him.\"",
    "Newsweek reached out to Walker's campaign for comment.",
    "I don't know whether President Trump said that.",
    "\"I think reporters said that.",
    "I think something happened.",
    "Do you know what happened?",
    "Please.\""
  ]
}