{
  "id": 7437,
  "mediaId": 223,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Here's What to Expect in the Texas Runoffs and Races in Georgia, Alabama, and Arkansas",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/139/0776093a-5327-414d-8470-6847e6ea14d9.jpg",
  "link": "https://townhall.com/tipsheet/spencerbrown/2022/05/24/live-results-texas-runoffs-and-primaries-in-georgia-alabama-and-arkansas-n2607690",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Spencer Brown",
  "authorUrl": "https://townhall.com/tipsheet/spencerbrown/",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "Also in Georgia, we'll be keeping an eye on the crowded GOP Senate primary in which Trump-endorsed former NFL player Herschel Walker is expected to win his primary against Georgia Agriculture Commissioner Gary Black, former state Representative Josh Clark, and a hat-trick of American heroes: former Navy Seal Latham Saddler, U.S. Air Force veteran Kelvin King, and former U.S. Army Special Forces brigadier general Jonathan McColumn.",
    "It's another primary election day in several states across the country as party loyalists turn out to choose who will represent their values in November's midterms  even as results from a handful of last Tuesday's primaries remain uncalled or too close to call, as is the case in the muddied Pennsylvania GOP Senate primary.",
    "Monday night saw Vice President Pence in Georgia for a final Kemp rally while reporting last week claimed President Trump has lost faith in Perdue's campaign  even as Trump re-shared his December 2021 endorsement of Perdue on Truth Social Monday afternoon and insisted again that \"Kemp can't win in General E!\"",
    "As a bonus, there's also a special primary taking place in Minnesota on Tuesday to choose contenders for the race to replace the late GOP Rep. Jim Hagedorn, who represented the North Star State's 1st Congressional District until he lost his battle with cancer earlier in 2022.",
    "Down in Georgia, incumbent Governor Brian Kemp  endorsed by former Vice President Mike Pence  squares off against former Senator David Perdue  endorsed by former President Donald Trump  in a key test of the power held by the previous administration's top two figures.",
    "Meanwhile, we'll be watching sore loser Stacey Abrams  who is running unopposed in the Peach State's Democrat gubernatorial primary  to see if she again smears the state she wishes to lead as the \"worst state in the country\" in which to live.",
    "We're also watching the Democrat runoff in Texas' 28th Congressional District where Rep. Henry Cuellar  the lone pro-life Democrat in the House of Representatives  is facing a progressive challenger from his far left in Jessica Cisneros.",
    "Incumbent Senator John Boozman is facing a challenge from former NFL player Jake Bequette and conservative commentator Jan Morgan, both of whom are attacking the incumbent for not joining efforts to invalidate 2020 election results.",
    "In Texas, eyes are on several runoffs for state and federal offices after the Lone Star State's March primary resulted in the need for a handful of final contests to determine who will carry their parties' endorsement in November.",
    "As always, live results from tonight's primaries will be posted as polls close on Townhall and exclusive analysis from Guy, Katie, Kurt, and the rest of the team will be available throughout the week for our Townhall VIP members.",
    "That leaves Senator Shelby's former Chief of Staff Katie Britt to fight it out against Brooks and Army veteran Mike Durant who, as a helicopter pilot, was captured in the 1993 \"Black Hawk Down\" crash in Somalia.",
    "Current Republican Attorney General Ken Paxton  endorsed by President Trump  is facing a challenge from Texas Land Commissioner George P. Bush, who trails the incumbent by fewer than ten points in recent polls.",
    "In the adjacent state of Arkansas, former White House Press Secretary Sarah Huckabee Sanders is seen as the shoo-in for the GOP contest for governor to replace term-limited incumbent Republican Asa Hutchinson.",
    "That race, following the unprecedented leak of a draft Supreme Court decision indicating Roe v. Wade's termination is imminent, has become something of a referendum on the Dems' views on abortion.",
    "After jumping into the race and landing an endorsement from her former boss, President Trump, Sanders cleared the field and is set to have an easy path to victory in November's general election.",
    "His widow, Jennifer Carnahan, is running in the primary field despite swirling controversies that saw her step down from her role as the chair of the state Republican Party.",
    "Over in Alabama, there are a handful of contentious GOP primaries playing out Tuesday evening, including the contest to replace retiring GOP Senator Richard Shelby.",
    "Walker has largely ignored his fellow Republican primary candidates and instead made his campaign a forward-looking case against incumbent Democrat U.S.",
    "State Rep. Jeremy Munson is also competing to succeed Hagedorn, as is Brad Finstad, the former state director for USDA rural development in Minnesota.",
    "Unlike the Pennsylvania Senate primary, President Trump hasn't picked a second-choice candidate to back.",
    "Senator Raphael Warnock who will defend his seat against the GOP nominee in November's general election.",
    "The GOP primary for U.S. Senate in deep red Arkansas, on the other hand, is a messier situation.",
    "In that race, Rep. Mo Brooks initially earned President Trump's endorsement, before losing it.",
    "Trump, however, endorsed Boozman in his reelection bid."
  ]
}