{
  "id": 7450,
  "mediaId": 157,
  "date": "d2022-05-24T00:00",
  "headline": "Amber Heard on trial: Johnny Depp's defamation case is radicalizing young men",
  "image": "https://www.rawstory.com/media-library/actor-johnny-depp.jpg?id=29717823&width=1200&coordinates=0%2C84%2C0%2C85&height=600",
  "link": "https://www.rawstory.com/amber-heard-on-trial-johnny-depp-s-defamation-case-is-radicalizing-young-men/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Marcotte",
  "authorUrl": "https://www.rawstory.com/u/amanda_marcotte_salon",
  "termIds": [
    661,
    683,
    815,
    1147,
    1539,
    3754,
    4027,
    2661,
    2704
  ],
  "sentences": [
    "This aspect of the conspiracy theory was on full display at the Conservative Political Action Conference held in Hungary over the weekend, in which \"traditional\" family structures and curtailing reproductive rights were held up as strategies to fight back against this mythical war on white Christians.",
    "Get them in the door with a story about how feminism and #MeToo have \"ruined\" women, and then hit them with a larger narrative about the \"great replacement,\" \"critical race theory,\" and other conspiracy theories the increasingly fascist right-wing media is using to radicalize their audiences.",
    "These \"elites\"  who are either Jews or progressive leaders, depending on who is telling the story  are also said to have pushed white women out of their \"natural\" roles as homemakers and into the workforce, leading to lower birth rates and the supposed destruction of the white race.",
    "For understandable reasons  the shooter was targeting Black patrons of a grocery store  most of the discussion has focused on the racist paranoia driving the conspiracy theory that holds that shadowy \"elites\" are trying to \"replace\" white Christians with people of color.",
    "We see this in the Big Lie, of course, but also in the ongoing pile-up of asinine right-wing myths and hoaxes currently taking hold like \"critical race theory,\" accusations that Disney employees are \"groomers,\" and claims that kids in schools are pooping in litterboxes.",
    "In the wake of the mass shooting in Buffalo, New York that left 10 people dead, there's been a great deal of attention paid to the \"great replacement\" conspiracy theory that inspired the alleged shooter, and how it's been mainstreamed by the right-wing press.",
    "A 2018 poll by Perry Undem, for instance, found that while most teenage girls wanted equality in the workplace and in the home, the majority of teenage boys preferred men to dominate in the workplace while women are stuck at home caring for the family.",
    "If the 2020s are shaping up to be about any one thing, it's ultimately about how this was the decade in which millions of people decided no amount of evidence or rationality could ever pry them from their dumbest, most reactionary beliefs.",
    "Right-wing media is smart to invest this much in the false narratives defending Depp because misogyny is the perfect gateway to lead young white men towards a more expansive constellation of reactionary politics.",
    "Right-wing media is smart to invest this much in the false narratives defending Depp because misogyny is the perfect gateway to lead young white men towards a more expansive constellation of reactionary politics.",
    "Not only are young married men still foisting the majority of domestic duties on their wives, but the percentage of men who openly long to have a housewife rose from 17% in 1994 to a whopping 45% in 2014.",
    "Last week it was revealed that the Daily Wire, which is shaping up to be a real competitor against Fox News, has also been spending thousands of dollars in social media ads bashing Heard.",
    "But mostly, Depp's victim status  and therefore the victim status of men generally  can be established through the sheer power of relentless repetition, drowning out all available facts.",
    "In recent weeks, the most virulent example of this hasn't come from likely culprits Donald Trump or Florida's Republican governor cursed with permanent constipation face, Ron DeSantis.",
    "Once you've got these guys on board with lies painting feminism as a conspiracy against men, it's a short jump to convincing them feminism is also a conspiracy against the white race.",
    "Once you've got these guys on board with lies painting feminism as a conspiracy against men, it's a short jump to convincing them feminism is also a conspiracy against the white race.",
    "Michael Hobbes (@RottenInDenmark) May 21, 2022\nAnd yet, under a deluge of both right-wing media and online vitriol, the preposterous notion that Depp is in the right has taken root.",
    "Heard is an imperfect person, so misogynists can derail any discussion about the case with demands that Depp's detractors defend every single life choice that Heard has ever made.",
    "As Melanie McFarland noted at Salon last month, Depp has become \"the celebrity poster model\" for the Fox News hysteria over an entirely fictional \"war on masculinity.\"",
    "As anyone who has glanced at social media can attest, the trial has become an occasion for a staggering number of men to wallow in their false sense of victimization.",
    "In the real world, as many a journalist with a high tolerance for Twitter abuse has reminded us, Johnny Depp's defamation case against Amber Heard is not legitimate.",
    "NOW WATCH: Herschel Walker argues with reporter Trump 'never said' election was stolen\nHerschel Walker argues with reporter Trump 'never said' election was stolen",
    "No, it's the nauseating defamation trial that pits the bloated remains of what used to be a handsome and promising movie star against a long-suffering actress.",
    "Any jury that actually follows the evidence should throw the case out, as investigative journalist and podcaster Michael Hobbes recently explained on Twitter.",
    "In reaction, increasing numbers of women are turning their noses up to marriage, preferring to be single rather than be with men who don't respect them.",
    "No, it's just because Depp's toxic supporters, through sheer belligerence, have willed their false narrative into the public understanding of the case.",
    "Men reject gender equality because, duh, it sounds nice having a full-time unpaid servant and emotional support system at home, all for your benefit.",
    "They long to hear that it's men who are the victims of a conspiracy of \"selfish\" women who supposedly use false accusations and other shady tactics.",
    "And once those young men have bought onto one self-pitying right-wing conspiracy theory, they have been softened up to accept all the rest of them.",
    "But no one wants to believe they're a selfish jerk, especially to someone you're supposed to love, such as a real or even hypothetical wife.",
    "Thread: I've noticed a weird reluctance on the part of liberal journalists to assess the evidence in the Johnny Depp-Amber Heard trial.",
    "The social media toxicity has largely been dismissed by the press not as a backlash to #MeToo, but as celebrity worship run amok.",
    "But this story is also being driven by right-wing media figures who don't give a single hoot about \"Pirates of the Carribean.\"",
    "As feminist Jessica Valenti noted in a 2020 article, male support for female equality has actually gone down in recent years.",
    "It's not true, of course, but we live in times where facts are increasingly discarded if they cut against a will to believe.",
    "If there's an ethos of this era, it's that you can believe whatever idiotic thing you want, so long as it's \"anti-woke.\"",
    "On Tucker Carlson's popular Fox News show alone, the conspiracy theory was hyped on over 400 separate episodes.",
    "And, of course, any effort to dislodge you from your stupid idea with annoying facts is \"cancel culture.\"",
    "Polling demonstrates that a distressingly large number of young men long for old-fashioned gender roles.",
    "Heard has become the scapegoat for all this male anger about women's independence and women's freedom.",
    "Anti-feminism makes good bait to pull young men deeper into authoritarian  and even fascist  politics.",
    "So a lot of men are open to narratives, however silly, about how it's feminists who are the bad guys.",
    "The Depp/Heard trial is perfect fascist agitprop, which is why right-wing media cannot get enough.",
    "That it's laughably false to view Depp as the victim here clearly doesn't matter.",
    "But \"great replacement\" is also a deeply misogynist conspiracy theory.",
    "It's not due to any evidence, as was already shown in a British court.",
    "The reason men want inequality is, quite obviously, entirely selfish.",
    "and so far, the left has responded with \"it's complicated!\"",
    "The right has spent weeks screaming \"she's lying!\"",
    "Let's take a look.",
    "It's not."
  ]
}