{
  "id": 7471,
  "mediaId": 19,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Herschel Walker Clinches Georgias U.S. Senate Republican Primary",
  "image": "https://media.breitbart.com/media/2022/01/GettyImages-1235507269-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/24/herschel-walker-clinches-georgias-u-s-senate-republican-primary/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    815,
    1136,
    1147,
    1312,
    1462,
    428,
    571,
    2556,
    2672
  ],
  "sentences": [
    "Walkers campaign said in a press release that running for office in his home state has been the greatest honor of my life and that he knew it was going to require hard work, sacrifice, and perseverance, which is why he wants to make sure the Republican party of Georgia is as unified as possible.",
    "The Republican Senate nominee, whom former President Donald Trump has endorsed since last year, has been a household name in the Peach State since his time playing football for the University of Georgia and winning the Heisman Trophy before going on to play in both the NFL and the Olympics.",
    "Walker, who led in every public poll against his closest challenger Agriculture Commissioner Gary Black, was expected to easily win his partys primary, with little chance that he would not breeze past 50 percent Tuesday night.",
    "Trump-backed Georgia Republican Herschel Walker, a former NFL running back and Heisman Trophy winner, won his party primary for the U.S. Senate according to the Associated Press, which called the race at 7:56 p.m. E.T.",
    "In early May, Walker appeared to acknowledge a possible blowout in the primary and invited his GOP opponents, their staff, and supporters to a unity celebration in an effort to bring everyone together on election day.",
    "Being evenly split 50-50, the Senate has been the graveyard for many far-left bills from the House Democrats looking to make campaign talking points for candidates as they hit the campaign trail.",
    "Democrats from across the county have appeared to pour money into the race to help Warnock, acknowledging that the Senate majority could very well run through the Peach State.",
    "Trump was publicly encouraging Walker to run in the early months of 2021, which more than likely persuaded him to announce his candidacy last August.",
    "The Democrats losing either the House or Senate in the midterms could mean the end for their party passing radical agenda items.",
    "As Breitbart News has reported that unlike Trumps other endorsements in the state, Walkers was uncontroversial.",
    "Walker, who will face Sen. Raphael Warnock (D-GA) in Novembers general election, has no shortage of funding.",
    "As of May 4, Walker has raised roughly $16.3 million with approximately $7.1 million cash on hand.",
    "Write to him at jbliss@breitbart.com or follow him on Twitter @JacobMBliss.",
    "However, this is compared to Warnocks war chest of just under $23 million.",
    "Jacob Bliss is a reporter for Breitbart News."
  ]
}