{
  "id": 7477,
  "mediaId": 234,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "The GOP Needs Trump-Loving Football Champ Herschel Walker to Be Teflon",
  "image": "https://media.vanityfair.com/photos/628ce6d91dca96fc8793544e/master/w_2240,c_limit/vf-522-walker.png",
  "link": "https://www.vanityfair.com/news/2022/05/gop-trump-needs-herschel-walker",
  "sentiment": "0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caleb Ecarma",
  "authorUrl": "https://www.vanityfair.com/contributor/caleb-ecarma",
  "termIds": [
    815,
    3103
  ],
  "sentences": [
    "But Walker, a former Heisman-winning running back at the University of Georgia with no prior political experience, has faced a steady stream of scandals throughout his candidacy, with the most serious stemming from allegations of domestic violence and violent threats against past romantic partners.",
    "Instead, he has relied on the local-legend image he built in 1980, when he led the Georgia Bulldogsa founding member of the SEC, the most distinguished conference in college footballand the programs rabid fanbase to their first national championship in nearly four decades.",
    "In a 2016 interview, he boasted about owning the largest upholstery company in the country, an apparent reference to either Renaissance Manufacturing or Renaissance Hospitality, two brands within the H. Walker Enterprises umbrella, according to the Daily Beast.",
    "But in a 2018 lawsuit against H. Walker Enterprises surfaced by TheAtlanta Journal-Constitution, he admitted the company does not own any chicken processing facilities, but instead merely partnered with plants to sell branded products that feature his name.",
    "He also, like Trump, markets himself as a virtuoso in the business world, saying that he built a business empire after retiring from football in 1997 and built a net worth of more than $29 million via the several affiliated with H. Walker Enterprises, LLC.",
    "And given that 32.6% of Georgias population is Blackand that Walker will likely be up against Warnock, a prominent Black leader who spurred voter turnout in the Georgia runoffs in 2021Republicans are hoping Walker can expand the Republican electorate.",
    "As for his primary strategy, Walker refused to debate his Republican opponents while mostly making media appearances with friendly conservative outlets, perhaps because everyone already knows he is winning this election, as Walker put it on Sunday.",
    "Walker has neither confirmed nor denied those allegations, though he told CNN at the time that he did not recall the incidents and claimed that may have been caused by mental blackouts related to his dissociative identity disorder.",
    "Moreover, additional questions about his financial history were raised last week after Insider reported that Walker dramatically revised his reported income in a form that all congressional candidates are required to file.",
    "In Walker, the GOP thinks its found a credible, serious candidate who is African Americanwhich will help going up against [Warnock], an African American pastor, Republican consultant Matt Mackowiak tells Vanity Fair.",
    "He will have a better shot to win the general [election] if he addresses those issues that are out there from his past, said Georgias Republican lieutenant governor, Geoff Duncan, in a recent Nightline interview.",
    "The front page of his campaign site reads: Walker is a kid from a small town in Georgia who has lived the American Dream, and now he is running for the United States Senate to keep that dream alive for you, too.",
    "Walkers campaign will spend as much time as possible talking about anything elseinflation being one of the issues theyll talk about the most to limit any damage that they may face as these questions come up.",
    "Vance and Blake Masters, two Republican Senate candidates running as America First paleoconservatives, Walker has not portrayed himself as an insurgent populist threat to the GOP establishment order.",
    "McConnell has significant access to money through his aligned super PACs, K Street support, and major donors across the country, while Trump obviously has a huge megaphone and large mailing lists.\"",
    "His most successful venture appears to be Renaissance Man Food Services, a poultry products company that Walker has described as a mini Tyson Foods that controls numerous chicken processing plants.",
    "His campaign has attempted to brush off questions about these claims by stating that Walker has been open about his dissociation issues for years and that he has fully recovered from the disorder.",
    "His campaign website features a stock set of conservative positions, including promises to secure the U.S.Mexico border, support the police and military, and stand for conservative family values.",
    "If he doesnt, then I think its going to be a tough day in Georgia when we get to the November election, and were going to send, unfortunately, another Democrat to represent us as a U.S. senator.",
    "Though, McConnell might not have had much of a choice in the matter; Walker and his high favorability numbers make him the betting favorite for a Georgia-led Republican takeover of the Senate.",
    "He will face Democratic incumbent senator Raphael Warnock, a Black religious leader in the state, in a critical November race that could tip the Senates balance of power in the GOPs favor.",
    "Everybody knows who Herschel is and practically everybody approves, which gives him a huge advantage in not having to introduce himself and not having to spend a lot of money on ads.",
    "Walker has repeatedly fabricated his accomplishments, falsely describing himself as a high school valedictorian and University of Georgia graduate, according to a CNN investigation.",
    "Voters make decisions that dont necessarily comport with what we generally assume matters to them, with [the Access Hollywood tape] being the most prominent example, Heye says.",
    "An investigation by the news outlet found no evidence to support this claim, despite Walker claiming in February that he has 250 employees sewing drapery and bedspreads for me.",
    "According to Senator Lindsey Graham, one of Walkers most steadfast supporters, the Senate minority leader has described the Trump-recruited candidate as the real deal, per CNN.",
    "Donald Trump, who handpicked Walker for the race, has spent the past year promoting his campaign and consolidating Republican support for the 60-year-old former football icon.",
    "Most of his policy stances are typical fare for the post-Trump conservative and lack the hard-line ideological substance that poses a threat to McConnells agenda.",
    "In 2002, a former Dallas Cowboys cheerleader accused Walker of stalking her, according to a police report, an allegation that Walkers campaign has said he denies.",
    "In a separate incident, a woman told police that Walker had threatened to blow her head off and then blow his head off, according to a 2012 police report.",
    "In 2008, Cindy Grossman, Walkers ex-wife, told CNN that he once held a razor to her throat and had aimed a firearm at her head on more than one occasion.",
    "Dating back to the early 2000s, Walker and his associates have struggled to pay off at least eight loans worth $9 million, per the Journal-Constitution.",
    "The duos friendship dates back to the 1980s, when Walker was playing for the Trump-owned New Jersey Generals of the old United States Football League.",
    "(No charges were filed against Walker, and the Walker campaign emphatically denied the false claims after they surfaced in April of last year.)",
    "Despite this Republicans feel they have found the golden ticket with Walker: a Black, Trump-loving, Southeastern Conference football star.",
    "(Walkers name does not appear in the business records of either company, both of which are now dissolved, according to the Daily Beast.)",
    "Walkers cemented celebrity status among Georgia voters may afford him the same kind of personal scandal immunity that Trump sustained.",
    "Certainly, Walker is not the only Republican in very recent history to be able to brush off business and personal conduct scandals.",
    "(Insider said that representatives from Walkers campaign and H. Walker Enterprises did not respond to its requests for comment.)",
    "(Though, during a campaign event last week, Walker stated that he is in favor of abortion bans with no exceptions.)",
    "According to Republican strategists, the GOP is banking on that biography carrying the party to a Senate majority.",
    "Itd be similar to if Michael Jordan decided to run in North Carolina, explains Doug Heye, a Republican strategist.",
    "He initially disclosed a combined family income of $927,886 but he has since changed that number to $4.1 million.",
    "Key to Walkers success in the Republican Party is that hes kept both Trump and Mitch McConnell in his corner.",
    "In a December statement to Axios, Walker vaguely insisted that he has been accountable for his past actions.",
    "This insular style of campaigning has allowed him to avoid verbally fleshing out most of his policy goals.",
    "I dont mean to speak of own in a technical sense, Walker said in a declaration to the court at the time.",
    "And, as Mackowiak noted, McConnells support has likely factored in Walkers high fundraising potential.",
    "His other claims have included calling it the largest minority-owned food company in the U.S.",
    "Republican Senate candidate Herschel Walker waltzed through his Georgia primary on Tuesday.",
    "In other words, if successful, Walker may be deserving of a Teflon moniker as well.",
    "His business record only becomes more suspect when it comes to his other ventures.",
    "It is still unclear what Walkers role is within the company that bears his name.",
    "It just makes sense that they come together in this race, Mackowiak says.",
    "Duncan did not endorse a candidate in the races crowded primary.",
    "Even more notable is a slate of abuse allegations against him.",
    "It looks like we're experiencing playback issues.",
    "Some Republicans are not convinced.",
    "But hes not without skeletons.",
    "(No charges were filed.)",
    "And unlike J.D.",
    "Our bad!"
  ]
}