{
  "id": 7479,
  "mediaId": 157,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Pastors confession to adultery turns into criminal probe when victim announces she was only 16",
  "image": "https://www.rawstory.com/media-library/pastor-john-lowe-ii.png?id=29844762&width=1200&coordinates=0%2C11%2C0%2C39&height=600",
  "link": "https://www.rawstory.com/pastor-john-lowe-ii/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Travis Gettys",
  "authorUrl": "https://www.rawstory.com/u/travis_gettys",
  "termIds": [
    815
  ],
  "sentences": [
    "\"This applies when people in positions of trust or authority of a child, law enforcement, mental health practitioners, or anyone with a professional relationship with the child, she says It affects children between 16 and 18 years old, again these people use their professional relationship to engage in sexual conduct with a child and that is the offense of child seduction.",
    "Pastor John Lowe II livestreamed the confession from inside the New Life Christian Church on Sunday, and he told parishioners that he \"committed adultery\" nearly two decades ago, adding that he wasn't disciplined and would not \"use the Bible\" to defend himself, reported WNDU-TV.",
    "Indiana state law sets the statute of limitations for sexual misconduct with a minor and similar offenses at the victim's 31st birthday, but legal experts say there are exceptions -- specifically for cases where a recorded confession provides enough evidence to charge a crime.",
    "Lowe announced he was stepping down from ministry responsibilities\" and asked for forgiveness, to which the congregation applauded, and the woman then admonished the pastor with her husband standing alongside her in the church.",
    "The Kosciusko County prosecutor's office confirmed that allegations against Lowe, which took place 27 years ago, and the pastor confirmed the woman's age at the time of the relationship during the livestream.",
    "An Indiana pastor confessed during church services to adultery years ago, but prosecutors are investigating after the woman who was involved told congregants she had been only 16 years told at the time.",
    "\"My wife -- its not just adultery, its another level when its a teenager, and I will not let this man talk about my wife like that,\" the man said.",
    "There is one particular offense that could apply, which is called child seduction,\" said law professor Jody Madeira, of Indiana University.",
    "The woman's husband then gave back a necklace the ministry had given his wife as a gift and the purity ring she wore as a teenager.",
    "Other congregants hugged them as the couple left the church, and several voices demanded that Lowe admit to the abuse.",
    "NOW WATCH: Herschel Walker argues with reporter Trump 'never said' election was stolen\nStories Chosen For You",
    "I know you do, and I have plenty of other stories that I can bring to your remembrance.",
    "The woman said other girls were abused by church leaders, but they were \"sent away.\"",
    "\"People knew, but were too afraid to come forward, and they have now,\" she said.",
    "\"I tried to tell someone, but all that was done was cover-up,\" she said.",
    "You did things to my teenage body that should have never been done.\"",
    "I was just 16 when you took my virginity on your office floor.",
    "This is the truth and thats all were going to say.",
    "When she was 15, 16, the sexual grooming started.",
    "It lasted until she met me and we started dating.",
    "\"The lies and the manipulation they have to stop.",
    "No one ever got me counseling.\"",
    "\"It happened for nine years.",
    "I have no defense,\" he said.",
    "\"I committed the adultery.\"",
    "\"Sixteen years old, okay?\"",
    "\"No one ever came to me.",
    "Do you remember that?",
    "\"It was wrong.\"",
    "Lowe said."
  ]
}