{
  "id": 7497,
  "mediaId": 1576,
  "date": "5/23/2022 12:00:00 AM",
  "headline": "7 things to watch on primary election night in Georgia",
  "image": "https://www.wabe.org/app/uploads/2022/05/unnamed-file-336x189.png",
  "link": "https://www.wabe.org/7-things-to-watch-on-primary-election-night-in-georgia/",
  "sentiment": "0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    727,
    815,
    1147,
    1274,
    2095,
    2203,
    2376,
    4325,
    562,
    2672,
    6039
  ],
  "sentences": [
    "The third category of Trump endorsements are incumbent Republicans in Congress and they include Georgias most extreme conservatives, Marjorie Taylor Greene, who is well known for her antagonistic approach to her office and Andrew Clyde, a gun store owner, whose campaign signs brandish an assault rifle.",
    "With Democratic State Representative Donna McLeod in the primary, the question is whether Bordeaux or McBath wins outright on Tuesday, or if they could be thrown into a June runoff because of Georgias requirement to get more than 50% of the vote to win.",
    "If Kemp wins his partys nomination, does that mean Perdues baseless claims about widespread voter fraud fell flat  or does Kemps stature as an incumbent governor with a solid, conservative record rise above voters beliefs about the 2020 election?",
    "Longtime Georgia Democratic Congressman David Scott, whose district straddles the Atlanta metros south and west sides, has three challengers in the Democratic primary, including former state Senator Vincent Fort.",
    "The state representative faces four other candidates including former Fulton County Commission Chair John Eaves, former state Senator Floyd Griffin, former state Rep. Dee Dawkins-Haigler and Michael Owens.",
    "Raffensperger has three Republican challengers in Tuesdays primary, including Trump-endorsed Congressman Jody Hice, who voted against certifying Bidens wins in Arizona and Pennsylvania on Jan. 6, 2021.",
    "Much like Trumps endorsement, well be watching whether these false claims are still resonating with voters  and the extent to which they influence how people vote and whether they vote at all.",
    "Finally, Trump endorsed Jake Evans in the race for the new 6th Congressional District and former Democratic State Representative Vernon Jones in the 10th Congressional District.",
    "As some campaigns struggle to compete for attention against a combustible GOP primary and high-profile Democratic campaigns, will Fair Fights endorsements make a difference?",
    "Congresswoman Lucy McBath switched to the 7th district after Republicans changed the lines of her neighboring 6th district and made it more friendly to Republicans.",
    "If no primary candidate gets more than 50% of the vote in a race, the top two candidates in that race will run against each other in a runoff election on June 21.",
    "Trump also endorsed three Republican U.S. House members who are running unopposed in their primaries, Congressmen Rick Allen, Buddy Carter and Barry Loudermilk.",
    "There are no shortage of candidates vying to win a primary race  races that determine who will appear on the ballot in the general election on Nov. 8.",
    "The primaries are also the first statewide elections under Georgias 2021 election law, so well be looking into how people feel about the changes.",
    "False allegations on the local level continue to pop up and we could see new challenges and allegations of voter fraud in some close races.",
    "The power of Trump over Georgias Republican party\nFormer President Donald Trump has endorsed 13 candidates in Georgias Republican primary.",
    "Fair Fight, the voting rights organization started by Stacey Abrams, has endorsed Democratic candidate Bee Nguyen for Secretary of State.",
    "The man whos been getting the most blame for any perceived election fraud in Georgia is incumbent Secretary of State Brad Raffensperger.",
    "And even if many Republicans are skeptical that the 2020 election was fair and accurate, do they feel the same about the 2022 midterms?",
    "There have been reports of some fellow Democrats in Congress voicing concern about David Scotts health, but he said they are unfounded.",
    "In fact, state lawmakers stripped his power over the state elections board in the controversial election bill they passed last year.",
    "Get all the latest Georgia election news and information on candidates before you head to the polls with our 2022 Election Hub.",
    "In the high-profile race for U.S. Senate, former UGA football star Herschel Walker is riding high with his Trump endorsement.",
    "He refused Trumps request to find 11,780 votes and swing the election after Trump lost Georgia in the 2020 general election.",
    "They fall into three categories:\nIn the first category, Trump is supporting four candidates who are up against incumbents.",
    "Absentee voting by mail is likely to drop significantly, but absentee in-person voting is already higher than in 2018.",
    "How will the organization she started wield its stature now that its founder has stepped aside to run for governor?",
    "Like its Democratic counterpart, this primary could go to a runoff if no candidate gets more than 50% of the vote.",
    "Congressional races could have implications on which party controls the U.S. House and Senate after November.",
    "And, the fallout from the 2020 election is still looming in Georgia  casting a shadow on some primary races.",
    "Despite leading the pack in polls, could Herschel Walker end up in a runoff for the U.S. Senate nomination?",
    "Well be looking for those surprises that pollsters, analysts  and yes, journalists  may not have predicted.",
    "To hear more from WABEs politics desk on the midterm elections, listen to the Georgia Votes 2022 podcast.",
    "Where Trump candidates end up after Tuesday will give us some clues about his influence on Georgias GOP.",
    "Does a surprise candidate get into a runoff in one of the crowded statewide or congressional primaries?",
    "Hes written a book about his experience and has only gotten lukewarm support from Georgia Republicans.",
    "Election fraud lies\nGeorgia has seen its share of false allegations of election fraud ever since 2020.",
    "Also, expect a lot of spin from all sides about what Tuesdays results mean for the former president.",
    "The former President has also endorsed State Senator Burt Jones in the race for lieutenant governor.",
    "These races do have other primary challengers, but these are the four Trump-endorsed challengers.",
    "Abrams has proven herself perhaps the most important power player in Georgia Democratic politics.",
    "And be sure to check back on Election Night as we get the results from each race as it develops.",
    "Congresswoman Carolyn Bordeaux has represented the 7th congressional district since last year.",
    "Races involving state and local offices could have a significant impact on laws in Georgia.",
    "Down the ballot, does an incumbent state legislator fail to win in a newly drawn district?",
    "Secretary of State Brad Raffensperger is being challenged by Congressman Jody Hice.",
    "Here are seven things to look out for on Tuesdays election night in Georgia.",
    "Fair Fight has also endorsed candidates in competitive legislative races.",
    "Hice also challenged Bidens win in Georgia, but that failed when no U.S.",
    "All five congress members are in safe Republican districts in the fall.",
    "Insurance Commissioner John King is being challenged by Patrick Witt.",
    "Republican redistricting has resulted in two current Democratic U.S.",
    "The second category is Republican endorsements in open primaries.",
    "Is Marjorie Taylor Green vulnerable enough to end up in a runoff?",
    "Most of them have been tossed out by courts or election boards.",
    "Attorney General Chris Carr is being challenged by John Gordon.",
    "Which incumbent or frontrunner ends up in a surprise runoff?",
    "Or will there be a runoff in the 7th Congressional District?",
    "Primary elections in Georgia take place on Tuesday, May 24.",
    "Both are facing several Republican challengers on Tuesday.",
    "Governor Brian Kemp is being challenged by former U.S.",
    "Can Secretary of State Brad Raffensperger survive?",
    "Will Fair Fights endorsement help candidates win?",
    "Representatives running against each other.",
    "Is Democratic Rep. David Scott vulnerable?",
    "Will it be Bordeaux or McBath?",
    "Senator joined the challenge.",
    "What surprises are in store?",
    "Senator David Perdue.",
    "1.",
    "6.",
    "5.",
    "7.",
    "3.",
    "4.",
    "2."
  ]
}