{
  "id": 7498,
  "mediaId": 157,
  "date": "5/23/2022 12:00:00 AM",
  "headline": "Trump is facing an embarrassing defeat  but here's why it might not matter",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=29839958&width=1200&coordinates=0%2C40%2C0%2C10&height=600",
  "link": "https://www.rawstory.com/trump-is-facing-a-humiliating-defeat-but-it-might-not-matter/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather Digby Parton",
  "authorUrl": "https://www.rawstory.com/u/heather_digby_parton_salon",
  "termIds": [
    815,
    1136,
    1147,
    1434,
    2095,
    2203,
    2279,
    428,
    517,
    2672
  ],
  "sentences": [
    "It's clear that this is now on the GOP agenda, and in close elections we will see Republicans seek the advantage through creating chaos and uncertainty, potentially creating circumstances that could invalidate or overturn the will of the voters:\nIn an interview with The Times, Mr. Trump acknowledged that in deciding whom to endorse in state legislative races, he is looking for candidates who want state legislatures to have a say in naming presidential electors  a position that could let politicians short-circuit the democratic process and override the popular vote.",
    "The damning statistics keep coming: about 23% of Republican legislators \"took steps to delay the vote count or overturn the election,\" 11% supported sending alternate slates of Trump electors, 7% were in favor of \"decertification\" of the election after the fact (which is not possible) and 24% voted for \"audits\" of election results, to be conducted by blatantly partisan outside firms.",
    "Their report found that \"at least 357 sitting Republican legislators in closely contested battleground states have used the power of their office to discredit or try to overturn the results of the 2020 presidential election,\" which adds up to 44% of all elected Republicans in state houses across the nine states where the election was the closest.",
    "Trump may have turbocharged the Republicans' anti-democratic strategy with his Big Lie, but the party is smoothly adjusting itself to the idea that the norms and traditions that kept power-hungry politicians from exploiting the flaws in the system, for fear of the people losing faith in democracy, are no longer necessary.",
    "Likewise, Trump has energetically endorsed Rep. Jody Hice to replace Brad Raffensperger, the Georgia secretary of state who famously released the recording of a phone call from Trump in which he asked Raffensperger to \"find\" the necessary votes to hand him the state's electoral votes.",
    "Republicans in Pennsylvania just nominated a far-right extremist and 2020 election denier for governor, who promises that if elected he will make sure that the GOP-majority legislature has the final word on which candidate is certified as the winner of the state's electoral votes.",
    "This includes allowing the state elections board, now newly controlled by appointees of the Republican State Legislature, to appoint a single person to take control of typically bipartisan county election boards, which have important power over vote counting and voter eligibility.",
    "Even without this law, there would still be a risk of election subversion: Election officials and administrators all over the country possess important powers, including certification of election results, that could be abused in pursuit of partisan gain.",
    "Back in 2000, Republicans first got a taste of how to use the levers of local political power, combined with a partisan Supreme Court majority, to declare themselves the winner in a close election.",
    "Apparently, early voting is very heavy for the Georgia primary, and many in the media see that as proof that concerns over the vote-suppression legislation enacted by Republicans was overblown.",
    "It's important to note that laws against mail-in voting and ballot drop boxes are only a small part of the assault on democracy Republicans have been conducting for the past year and a half.",
    "Trump is predicted to have at least one winner on the day: Former football star Herschel Walker will be the GOP nominee for the U.S. Senate seat currently held by Democrat Raphael Warnock.",
    "The law also gives the Legislature the authority to appoint the chair of the state election board and two more of its five voting members, allowing it to appoint a majority of the board.",
    "Unless the Congress gets off the dime and passes some reform to the Electoral Count Act, it seems more likely than not that some swing-state Republican governor is going to try this.",
    "In April of 2021, the New York Times' Nate Cohn sounded the alarm:\nBeyond any provisions on voting itself, the new Georgia election law risks making election subversion easier.",
    "He reportedly harangued former Sen. David Perdue to run in an effort to vanquish Trump's hated enemy Kemp, who refused to help the then-president overturn the 2020 election.",
    "Perhaps the voters of Georgia have accepted that they have to jump through ridiculous hoops to exercise their right to vote and are determined not to let it stop them.",
    "So it's hard to grasp just how successful Republicans have been at putting these new laws in place, or where the greatest threat of the next coup will come from.",
    "Trump's former vice president, Mike Pence, is scheduled to show up at a rally for Kemp on Monday, in one of the biggest signs of a permanent Trump-Pence split.",
    "If it's supposed to signal that the rest of the party will then reject his anti-democratic agenda, there is no evidence they have any intention of doing that.",
    "The GOP no longer has even the slightest concern about the legitimacy conferred by a popular-vote victory, since it's only won one in the last 30 years.",
    "The groundwork has been laid: In close elections, we'll see Republicans spread confusion and chaos, seeking to overturn the will of the voters.",
    "But their analysis concludes that in all the battleground states, groundwork has been laid for more robust interference with election results.",
    "This past weekend, the New York Times ran an important front-page story pulling together all the threads of this story from across the nation.",
    "(The \"independent state legislature doctrine\" that underlies this plotting was first raised in Bush v. Gore by the conservative justices.)",
    "All that means is that Trump's followers may love him but they don't think they have to follow his recommendations for other offices.",
    "The most recent polling has Raffensperger and Hice likely headed to a runoff  but Kemp is probably heading for a landslide victory.",
    "That certainly doesn't make it right, especially since there was no reason to enact any of those restrictions in the first place.",
    "The Times notes that some Republicans have resisted all this, and that many of the craziest schemes have not been enacted.",
    "The whole country has its eyes on Georgia this week in anticipation of the big Republican primary showdown between Gov.",
    "This has been happening all over the country, but the media has been strangely lackadaisical about reporting it.",
    "There are so many questions about Walker's fitness that he is far from guaranteed to win in the fall.",
    "Those things are unfair, of course, but voters can at least overcome them with effort.",
    "So Trump is looking at a possible 2022 shutout in the vital swing state of Georgia.",
    "That stuff is for losers, and they simply don't care about any of it anymore.",
    "It creates new avenues for partisan interference in election administration.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "Trump isn't actually in the race, of course but he might as well be.",
    "It strips the secretary of state of the chair and a vote.",
    "The even more serious problem is election subversion.",
    "It's their best (and perhaps only) path to victory.",
    "Subscribe to our morning newsletter, Crash Course.",
    "Brian Kemp and former President Donald Trump.",
    "Let's face facts: They don't want to.",
    "Stories Chosen For You",
    "It's very sobering.",
    "But so what?"
  ]
}