{
  "id": 7511,
  "mediaId": 21,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Trump-endorsed Senate candidate Herschel Walker supports a total abortion ban: 'there's no exception in my mind'",
  "image": "https://i.insider.com/628aac7db9dbb40018cb32c7?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/herschel-walker-supports-total-abortion-ban-no-exception-georgia-senate-2022-5",
  "sentiment": "0.0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Tangalakis-Lippert",
  "authorUrl": "https://www.businessinsider.com/author/katherine-tangalakis-lippert",
  "termIds": [
    815
  ],
  "sentences": [
    "Following a campaign event on Wednesday, Georgia GOP candidate for Senate Herschel Walker said he supports a total abortion ban with no exception for rape, incest, or the health of the mother.",
    "The Georgia state primary election is set to take place Tuesday, with Herschel, a Trump-endorsed GOP candidate, leading in the polls and likely to secure the Republican nomination for Senate.",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Walker's campaign confirmed to Insider that the former professional football player turned politician \"is unapologetically pro-life with no exceptions.\"",
    "Sean Rayford/Getty Images\nHerschel Walker on Wednesday said he supports a total abortion ban with no exceptions for rape or incest.",
    "Should he secure the nomination, Walker will face off against incumbent Democratic Sen. Raphael Warnock in November.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "\"There's no exception in my mind,\" Walker said after a campaign speech, The Hill reported.",
    "The Georgia primary takes place on Tuesday with Trump-backed Walker ahead in the polls.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Herschel Walker speaks at a September 2021 Trump rally in Georgia.",
    "\"There's no exception in my mind,\" Walker said.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "\"Like I say, I believe in life.",
    "\"Like I say, I believe in life.",
    "Loading Something is loading.",
    "I believe in life.\"",
    "I believe in life.\""
  ]
}