{
  "id": 7520,
  "mediaId": 157,
  "date": "d2022-05-22T00:00",
  "headline": "Mitch McConnell slammed for still backing 'absolute degenerate' Herschel Walker after new report",
  "image": "https://www.rawstory.com/media-library/mitch-mcconnell.jpg?id=29837149&width=1200&coordinates=0%2C4%2C0%2C71&height=600",
  "link": "https://www.rawstory.com/hershel-walker-gop/",
  "sentiment": "-0.548",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    815,
    1098,
    1136,
    1557,
    1765,
    428,
    571,
    2672
  ],
  "sentences": [
    "During an appearance on MSNBC's \"The Sunday Show,\" former Republican party campaign consultant Tara Setmayer trashed conservatives -- and Senate Minority Leader Mitch McConnell (R-KY) still backing former football player Herschel Walker's run for Georgia's open U.S. Senate seat by in light of new revelations that he is being scrutinized over his ties to a group accused of preying military vets.",
    "\"Not only that, it just came out recently in, I believe it was an AP report that there is questions about his role in a veterans charity which is something that he's used as a point is his biography and his resume as something that he's done working with veterans.",
    "\"Michael, you and I know that candidate recruitment was really important and something that the Republicans used to be prideful about ... and you have this fool as your leader for the Senate race in Georgia?\"",
    "Speaking with fill-in host Michael Steele, Setmayer went on an extended rant about Walker who seems poised to win the GOP nomination on Tuesday.",
    "\"Let's be honest, he's also has a violent history against women, police officers, he's talked openly about murderous thoughts.",
    "\"And then you compare him to an absolute degenerate like Herschel Walker,\" she continued, warming up to the subject at hand.",
    "Shame on [Senate Minority Leader] Mitch McConnell and everyone else who has put up with the sham that Herschel Walker is.",
    "There's questions about the role that he played they are and whether they preyed on veterans and scammed the government.",
    "\"You know, this just gave Senator Warnock a much greater chance at winning reelection in November,\" Setmayer replied.",
    "\"MAGA world is all gaga for him,\" host Steele prompted his guest, \"How does that shape up for you?",
    "\"He's been doing an excellent job as a senator, he's very well respected in the state.\"",
    "\"I mean, not only is he a liar, he lied about graduating top of this class in Georgia.\"",
    "And this is someone who the Republican Party has backed as their Senate candidate.",
    "How does that Senate race against Democratic Senator Raphael Warnock look to you?\"",
    "\"He is a degenerate loser, liar, fraud and domestic abuser.",
    "This is so on-brand for Donald Trump and who he supports.\"",
    "Watch below:\nMSNBC 05 22 2022 10 07 42",
    "What an embarrassment.\"",
    "she told the host.",
    "I mean, really?\"",
    "she continued."
  ]
}