{
  "id": 7525,
  "mediaId": 178,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Herschel Walker: From football stardom to troubling Senate candidate",
  "image": "https://chorus.stimg.co/23577895/merlin_67496037.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/herschel-walker-georgia-senate-republican-primary-vikings-jim-souhan/600175360/",
  "sentiment": "0",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Improbably muscular and fast, Walker benefited from and perpetuated every myth surrounding him  that he was his high school valedictorian (he wasn't), that he graduated from the University of Georgia (he didn't), that he performed 5,000 pushups and situps every night as a youth during sitcom commercials (mathematically and probably physically impossible).",
    "Walker is the latest example of an athlete that we thought we knew, but didn't, following in the unfortunate footsteps of Darren Sharper (seeming nice guy turned predator) and Brett Favre (charming small-town philosopher accused of a welfare scam in his home state of Mississippi).",
    "He wrote, specifically, \"all I could think was how satisfying it would feel  the visceral enjoyment I'd get from seeing the small entry wound and the spray of brain tissue and blood  like a Fourth of July firework  exploding behind him.\"",
    "Simply by recounting Walker's post-playing behavior and gauging the reaction of many Georgians to his candidacy, Rosengren's piece reads like a modern horror story:\nWalker asked why, if humans evolved from apes, apes still exist.",
    "On a Daily Caller podcast, when asked whether he would have voted for the $1.2 trillion bipartisan infrastructure bill that had just passed, Walker said, \"Until I can see all of the facts, you can't answer the question.\"",
    "Once, he vented to me in a long interview about being scapegoated over a trade he did not request, one that cost the Vikings a slew of draft picks and players and remains one of the most-criticized deals in NFL history.",
    "He was miscast as the player who could elevate a talented team to the Super Bowl, introduced midseason to an offense into which his skills did not fit, and frustrated as his prowess waned.",
    "Minneapolis-based author John Rosengren recently traveled to Georgia to meet Walker, who has no experience in elected office, and wrote an in-depth article for the Washington Post.",
    "Now he is leveraging his still-remarkable popularity in his home state of Georgia, where he was a high school and college star, into a run for the U.S. Senate.",
    "In the Republican primary on Tuesday, he is favored to become the GOP candidate to run against incumbent Raphael Warnock, a Democrat, for the Senate.",
    "He said that civil rights hero John Lewis' name should not be attached to a voting rights bill because \"it doesn't fit what John Lewis stood for.\"",
    "Walker was accused by his former wife, Cindy, of holding a gun to her head several times, and once holding a straight razor to her throat.",
    "\"This guy is grossly unqualified, and yet he has the support of about 60 percent of the Republicans in Georgia,\" Rosengren said.",
    "In 1991, I could not have imagined the affable, sometimes goofy Walker as a villain, nor as a villain with political clout.",
    "I covered Walker briefly for the Dallas Morning News, then moved to Minnesota to cover the Vikings for the Star Tribune.",
    "After their divorce, Walker continued to threaten to shoot Cindy, according to court documents cited in the article.",
    "In Minnesota, Walker transformed from a beloved national figure into a symbol of Vikings woes and mismanagement.",
    "In his memoir, Walker wrote that he fantasized about shooting a man who had not delivered a car to him on time.",
    "But there are many, many other reasons, I think, to be concerned about Herschel Walker as a Senate candidate.''",
    "He looked and carried himself like someone who played football as a hobby when he wasn't saving the world.",
    "Said Rosengren: \"This is a person who has a violent past and that's troubling on that plane alone.",
    "Another said: \"He's probably like every one of us; he's had his issues and had to grow.\"",
    "Rosengren interviewed Georgians who did not know about Walker's threats of violence.",
    "Will Walker's still-overwhelming popularity as a sports figure in Georgia help him?",
    "I got to know Walker a bit in Dallas and covered him intensively in Minnesota.",
    "Covering Herschel Walker in Dallas was like being Superman's stenographer.",
    "\"They said, 'Well, you know, he's still a good person,\" Rosengren said.",
    "Covering Walker in Minnesota was like being Clark Kent's therapist.",
    "Rosengren quoted two women in Georgia who defended Walker.",
    "He claimed to invent a mist that destroys COVID.",
    "One said: \"He's got the right morals.''",
    "Their response when he informed them?",
    "Can Walker win?"
  ]
}