{
  "id": 7526,
  "mediaId": 305,
  "date": "5/21/2022 12:00:00 AM",
  "headline": "Hershel Walker's Senate Bid Has Some Georgia Republicans Shook",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/3e27b9e415cbb5940054b9d67e823496.jpg",
  "link": "https://www.theroot.com/hershel-walkers-senate-bid-has-some-georgia-republicans-1848956767",
  "sentiment": "0.0",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Keith Reed",
  "authorUrl": "https://www.theroot.com/author/kreed3110",
  "termIds": [
    815
  ],
  "sentences": [
    "Despite her fealty to a party that appears intent on severing all ties to humanity and which trafficks in racist tropes that lead to violence, Barnettes rewards were Trump and Hannity supporting Dr. Ozheretofore a New Jersey residentin the race, followed by a third-place finish.",
    "The Republicans running against Herschel Walker for U.S. Senate are crisscrossing the state this week, looking for every vote they can get and making a similar argument: Walker cant win in a November general election against Democrat Raphael Warnock.",
    "Until now, thats been enough to not only make him the favorite among GOP contenders for the seat currently held by Sen. Raphael Warnock but to put him in a close race with Warnock in a hypothetical contest in November.",
    "Hes skirted questions about his mental health, past accusations of domestic violence and the fact that he barelyif at alllived in Georgia before announcing he wanted to represent the state in Washington.",
    "The angst over Walker brings to mind another Black Republican, Kathy Barnette, who is blaming her loss in the Pennsylvania GOP primary on Fox New host Sean Hannity.",
    "Barnette ran as a Trumpist who parroted 2020 election conspiracy theories and participated in the rally that preceded the Jan. 6 insurrection at the Capitol.",
    "Polls show Walker with a massive lead, despite skipping debates and largely avoiding questions about past allegations of domestic violence.",
    "That seemed to be OK with Georgia Republicans until it became clear that Walker is probably going to walk-run with next Tuesdays primary.",
    "Now some in the GOP establishment are wondering if the party has set itself up for a beating in November against Warnock.",
    "Then there was this interview:\nHis only positives are his money, Trumps endorsement and his football legend.",
    "Hes been caught in obvious lies about graduating from college, a thing about which no one ever cared.",
    "From Day One, Herschel Walkers U.S. Senate run has been amateur hour.",
    "Hes skipped every televised debate with his GOP primary opponents.",
    "That message hasnt resonated yet in the contest."
  ]
}