{
  "id": 7527,
  "mediaId": 305,
  "date": "5/21/2022 12:00:00 AM",
  "headline": "Georgia Sees Record Number of Early Votes from Minorities",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/354ed0562874eb3480095c8010a91b66.jpg",
  "link": "https://www.theroot.com/georgia-sees-record-number-of-early-votes-from-minoriti-1848956470",
  "sentiment": "0.0",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kalyn Womack",
  "authorUrl": "https://www.theroot.com/author/kalynwomack",
  "termIds": [
    815
  ],
  "sentences": [
    "Now that Stacey Abrams is back in the race to triumph her loss in the gubernatorial primary in 2018 and Herschel Walker is taking a stab at the Senate race following his glorification of former President Trump, more people seem to be interested in participating in the election.",
    "Five times as many Hispanic voters are casting Republican ballots in this years primary as they did in 2018, five times as many Asian voters are casting Republican ballots in 2022 as there were in 2018, and four times as many Black voters are casting GOP ballots this year.",
    "More from National Review:\nGeorgia does not register voters by party, but the Georgia Secretary of States office knows which party primary these voters are casting ballots in, and the numbers so far show minority voters are growing more interested in the GOP primary.",
    "As one can expect, the new law put more voting restrictions which disproportionately target Black and brown voters including new identification requirements and limited use of ballot drop boxes.",
    "According to data from the Georgia Secretary of States office, triple the amount of Black voters have casted their early votes this year in comparison to the primaries in 2018.",
    "It is possible that this early vote turnout is just taking a bite out of the election day vote, and that turnout in this years Georgia primaries wont be anything special.",
    "Legislation that Democrats insisted was a sinister plot to keep Georgians away from the polls has, so far, yielded a lot more Georgians coming out to vote.",
    "President Biden recently condemned an elections bill signed into Georgia law, calling it Jim Crow in the 21st century, CNN previously reported.",
    "Georgia is seeing early voter turnout at a higher rate than ever before among voters in minority communities, reported National Review.",
    "Per National Reviews report, Black voters now make up nearly three percent more than the total electorate in comparison to 2020.",
    "But right now, the early vote is about half of the total turnout in the 2018 primaries (not counting the GOP runoff).",
    "However, that seemed to only encourage Black Georgia voters to get ahead.",
    "About 565,000 people casted early votes in Georgia, per National Review.",
    "That is a 153 percent increase from 2018 and 189 percent from 2020."
  ]
}