{
  "id": 7567,
  "mediaId": 376,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "The case for primaries: Pennsylvania edition",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/05/GettyImages-1396765002.jpg?fit=1240,698",
  "link": "https://www.rollcall.com/2022/05/13/the-case-for-primaries-pennsylvania-edition/",
  "sentiment": "0.0",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nathan L. Gonzales",
  "authorUrl": "https://www.rollcall.com/author/nathan-l-gonzales/",
  "termIds": [
    815
  ],
  "sentences": [
    "Well see how competitive primaries, or lack thereof, impact other top Senate races this cycle, including the handful of Republicans running against each other in Arizona, whether Republican Herschel Walker was sufficiently vetted before the primary in Georgia, and whether North Carolina Democrat Cheri Beasley could have used a competitive primary to boost her operation.",
    "Even though Barnette may end up being able to avoid the questions for now and run out the clock before the primary and secure the nomination, Republicans are fortunate that these issues are coming up now rather than in September or October, because shes going to have to answer these questions at some point if she is the nominee.",
    "Writer Salena Zito of The Washington Examiner wrote about her struggles to get the Barnette campaign to answer basic questions about the candidates biography, including the name of her hometown, information about her military service and names of financial institutions where she says she worked, among other things.",
    "While primaries can sometimes expose ideological differences and drain resources, they can also be proving grounds for candidates to refine their skills, ramp up their campaign operations, and even deal with negative attacks before the bright lights of a general election.",
    "It put him in position to win North Carolina and Indiana (which werent typically within reach for Democrats) in the general election because there were two well-funded campaigns organizing voters in the primaries, and those efforts paid off later that November.",
    "Oz and McCormick have vulnerabilities, but most of those issues have been litigated through millions of dollars spent on TV ads over the course of multiple months, and their campaigns have been forced to develop responses to the attacks.",
    "Quite simply, youd rather have a candidate deal with problems early in the election process, even in a primary, rather than in a general election, when time is shorter and theres no option to find another nominee.",
    "Colleague Jacob Rubashkin detailed a history of anti-Muslim posts by Barnette on social media, including posts about then-President Barack Obama being a secret Muslim, terrorist sympathizer and potentially gay.",
    "The two candidates with the most money in the race, Mehmet Oz and Dave McCormick, might not want to attack Barnette for fear voters will sour on them as well as Barnette and consequently help the other guy.",
    "Theres a chance the questions surrounding Barnette dont have good answers and she becomes a damaged nominee in a race that is close to a must-win for Republicans in their path to Senate control.",
    "With just days to go before the May 17 Republican primary in the Keystone State, there are some significant concerns and questions about the candidate with the momentum: Kathy Barnette.",
    "Some GOP strategists must have flashbacks to 2010, a great cycle for Republicans, in which the party lost two winnable races, in Nevada and Delaware, because of flawed candidates.",
    "While it might seem like a painful process for the party, I think the Pennsylvania GOP primary will have helped Oz and McCormick to be a better nominee, should one of them win.",
    "ANALYSIS  Even though Republican and Democratic operatives and party leaders try to avoid divisive and expensive primaries, they can serve an important purpose.",
    "But that doesnt make sense considering Barnette has made her early life, including being the child of a rape of a child, a compelling part of her campaign.",
    "Up to this point, Barnette was largely viewed as an also-ran with limited resources, so she was not receiving as much attention as the top contenders.",
    "Ive argued for years that the 2008 Democratic presidential primary between Hillary Clinton and Obama helped the latter in the general election.",
    "What we do know is that its probably too late for any of Barnettes opponents to take issue with any potential inconsistencies in her resume.",
    "Running for office is difficult, and sometimes having a spirited dress rehearsal can result in a better candidate for the main event.",
    "Barnettes campaign manager told Zito, Kathy keeps her early life as private as possible as I am sure you can understand why.",
    "Neither party can avoid a misstep in a top race because, with a limited Senate battlefield, literally every seat matters.",
    "While the Barnette questions have technically come up in a primary context, its far too late for them to be fleshed out.",
    "Time is running out, and in a multi-candidate race, there can be a reluctance to attack a candidate in this situation.",
    "With multiple polls now showing her vaulting into the top tier, shes received more scrutiny.",
    "And most of Zitos questions are about what Barnette did or where she was as an adult.",
    "We dont know because there are no answers, Zito wrote about the situation.",
    "Nathan L. Gonzales is an elections analyst with CQ Roll Call.",
    "Look no further than this years Senate race in Pennsylvania.",
    "Primaries dont have to be a net negative.",
    "She could be hiding everything.",
    "She could be hiding nothing.",
    "I agree."
  ]
}