{
  "id": 7572,
  "mediaId": 136,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Raphael Warnock's Chances of Beating Herschel Walker, According to Polls",
  "image": "https://d.newsweek.com/en/full/2036435/warnock-v-walker.webp?w=790&f=5647711549ca447df11aa894a65c0c7d",
  "link": "https://www.newsweek.com/raphael-warnocks-chances-beating-herschel-walker-according-polls-1706021",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    815,
    1131,
    1136,
    1147,
    146,
    227,
    428,
    501,
    571,
    2672
  ],
  "sentences": [
    "A survey conducted by The Atlanta Journal-Constitution in April had the former NFL player with nearly two-thirds of Republican voters' support, while all his opponents were in the single digits.",
    "The GOP candidate had a slight advantage of just 1 point, with 49 percent support among registered voters as opposed to only 48 percent for the Democratic incumbent.",
    "Democratic Senator Raphael Warnock looks as if he's headed for a tough race to defend his Georgia seat against GOP contender Herschel Walker in November's midterm.",
    "Warnock hopes to hold on to his hard-won seat, which he picked up in a relatively close runoff election in January 2021 against Republican Senator Kelly Loeffler.",
    "That poll, carried out from April 1 to 3, showed Walker at 49 percent, compared with Warnock's 45 percenta lead of 4 points for the Republican challenger.",
    "Walker, who has been endorsed by former President Donald Trump, won't be the Georgia Republican Party's official nominee until after May 24's primary.",
    "That survey, conducted by WXIA-TV/SurveyUSA from April 22 to 27, puts the Democrat at 50 percent, compared with his opponent's 45 percent.",
    "The current Real Clear Politics average of Georgia polls has the Republican contender ahead of the Democrat by 0.5 percentage points.",
    "Whether Democrats can maintain the seat in traditionally red Georgia will be seen as a test of the party's growing influence there.",
    "Just over 1,000 registered voters were questioned in the survey, which had a margin of error of plus or minus 3 percentage points.",
    "Recent polls suggest that Walker is well positioned to take on Warnock and even potentially win the Senate seat back for the GOP.",
    "He declared victory in that contest with about 51 percent of the vote and a relatively narrow margin of fewer than 100,000 votes.",
    "Polling and political analysis website FiveThirtyEight assesses that Georgia has a 7.4-point partisan lean in favor of the GOP.",
    "At the same time, Democrats managed to narrowly flip the state blue in the 2020 presidential race in favor of Biden.",
    "But recent polls show that the Democratic gubernatorial candidate faces an uphill battle to victory in November.",
    "A late-January poll by Quinnipiac University showed a nearly tied contest between Warnock and Walker.",
    "Warnock and other Democrats in Georgia are also fighting against the state's strong Republican lean.",
    "Georgia's two Senate seats also switched parties in favor of the Democrats in the January runoffs.",
    "Meanwhile, the most recent poll shows Warnock with a 5-point lead over the Trump-backed candidate.",
    "An early-April survey by The Hill/Emerson College found nearly the opposite result, however.",
    "That survey had a margin of error of 2.4 percentage points and polled 1,702 respondents.",
    "It polled 1,278 likely voters and had a margin of error of plus or minus 3.4 percent.",
    "The Democrats aim to build off the energy of 2020 to maintain Warnock's seat.",
    "Walker has an average of 47.3 percent, compared with Warnock's 46.8 percent.",
    "They also hope to elect Stacey Abrams in her race for governor there.",
    "Recent polling shows that he's dominating the GOP field, however."
  ]
}