{
  "id": 7577,
  "mediaId": 233,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Trump candidate loses Nebraska GOP primary after allegations of sexual misconduct",
  "image": "https://www.gannett-cdn.com/media/2021/10/28/USATODAY/usatsports/B9348058569Z.1_20211028105723_000_GC2UJJKQC.2-0.jpg?width=1320&height=992&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/elections/2022/05/10/nebraska-primary-results/9710268002/",
  "sentiment": "0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Jackson",
  "authorUrl": "https://www.usatoday.com/staff/2647924001/david-jackson/",
  "termIds": [
    815,
    1053,
    1909,
    2136,
    350,
    428,
    588,
    2816
  ],
  "sentences": [
    "Trump stumps for Herbster: Donald Trump's Nebraska rally features candidate Charles Herbster, accused by 8 women of groping\nPillen, who is also a veterinarian and a pig farmer, enjoyed the support of more establishment Republicans in Nebraska, including current Gov.",
    "WASHINGTON  Charles Herbster, a Donald Trump-endorsed businessman who has been repeatedly accused of sexual misconduct, lost his bid to be the GOP's nominee for Nebraska governor in the state's Republican primary on Tuesday.",
    "Eight women, including a state senator, told the Nebraska Examiner during the campaign that Herbster had groped, forcibly kissed or improperly touched them at public events over the past six years.",
    "Trump's candidates have fared well in 2022 Republican primaries, but the Nebraska governor's race proved that the ex-president's endorsement is not an automatic ticket to victory.",
    "University of Nebraska Regent Jim Pillen was the winner of the gubernatorial primary, according to the Associated Press, just ahead of Herbster and state senator Brett Lindstrom.",
    "The Republican nominee for Nebraska governor will be favored in the fall election against Carol Blood, a state senator who won the Democratic primary in this GOP-leaning state.",
    "Speaking with his supporters, Herbster called the race \"one of the nastiest campaigns\" in Nebraska history, and that may have played a role in his defeat.",
    "Eric Greitens, a Republican seeking a U.S. Senate seat, and former football star Herschel Walker, a GOP member running for the U.S. Senate from Georgia.",
    "Trump, who has been repeatedly accused of sexual assault himself, re-doubled his support for Herbster in the wake of the allegations.",
    "Herbster told CNN that the allegations were a \"politically-timed smear\" and likened them to past claims against public officials.",
    "These are malicious charges to derail him long enough that the election can go by before the proper defense can be put forward.\"",
    "The former Nebraska football player also had the endorsement of former congressman and Cornhuskers coach Tom Osborne.",
    "Herbster could not overcome the many misconduct allegations lodged against him, despite his denials.",
    "Trump endorsed Herbster back in October, but several Republicans in Nebraska did not follow suit.",
    "Herbster was one of at least nine candidates nationwide facing accusations of a sexual nature.",
    "\"Tonight, we will celebrate a great victory,\" the new nominee said in a speech Tuesday night.",
    "In addition to Ricketts, Pillen had the support of the Nebraska Farm Bureau.",
    "He told a crowd at a rally in Nebraska that \"I have to defend my friends...",
    "\"Tomorrow, it's back to work in the fight to keep Nebraska great.\"",
    "Pillen adapted a familiar Trump phrase in thanking his supporters.",
    "Herbster also said he spoke to Pillen and conceded the contest.",
    "They did it to Brett Kavanaugh,\" Herbster said.",
    "The list includes former Missouri Gov.",
    "\"They did it to Donald J. Trump.",
    "Trump has endorsed Walker.",
    "Pete Ricketts."
  ]
}