{
  "id": 7592,
  "mediaId": 238,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Herschel Walkers insulting campaign is the worst kind of sports idolatry",
  "image": "",
  "link": "https://www.washingtonpost.com/sports/2022/05/06/herschel-walker-senate-georgia/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "This is a revelation about Walker that comes about as he makes the rounds as a U.S. senatorial candidate propped up by former president Donald Trump and reactionary republicans in Georgia in an attempt to unseat Sen. Raphael G. Warnock, the states first Black senator and the first Black Democratic senator from the South.",
    "In contrast, Colin Allred, a Democrat and one-time NFL linebacker before hitting law school (from which he graduated), not only demanded a televised debate in 2018 with longtime Texas Republican congressman Pete Sessions, he got it  and impressed voters so much he defeated Sessions in the aftermath.",
    "He isnt like Warnock, an ordained minister who pastors at Atlantas Ebenezer Baptist Church made famous by a former pastor, Dr. Martin Luther King, Jr., or thrice graduated  first from Morehouse and then Union Theological Seminary, where Warnock was awarded a masters and PhD.",
    "They openly campaigned for Warnock against the senator he defeated, Kelly Loeffler, who at the time was a co-owner of the WNBAs Atlanta Dream, where she caught the ire of league players for denouncing Black Lives Matter and backing antiabortion causes.",
    "Shortly after he was elected, Tuberville misidentified the three branches of government, said World War II was fought to liberate Europe from socialism and communism and fanned the flames of the lie engulfing democracy that Trump won the 2020 election.",
    "Memphis in Charles Fullers 1982 Pulitzer Prize-winning play A Soldiers Play, which examines prejudice and racial stereotypes  on both sides of the color line  through a segregated Army unit at a base in a pre-Civil Rights Movement Deep South.",
    "Former Auburn football coach Tommy Tuberville, with no political experience but a winning record against in-state rival Alabama and Trumps backing, two years ago defeated Democratic Sen. Doug Jones to represent Alabama in the Senate.",
    "Just in the past couple election cycles, Burgess Owens, who played safety for the Jets and then for the Raiders 1980 Super Bowl champion team, won a House seat from Utah as a Republican.",
    "Its reminiscent of a real-life Black man revered for his athleticism and heretofore seen as just happy-go-lucky: the great running back from the University of Georgia, Herschel Walker.",
    "The Associated Press reported Walkers ex-wife secured a protective order against him in 2005 and cited physically abusive and extremely threatening behavior in her filing for divorce.",
    "In his 2008 memoir Breaking Free, Walker admitted to violent episodes, including hunting for a man in Dallas who he said was reneging on a business deal, and playing Russian roulette.",
    "Last month, Walker appeared on a Fox News show and demonstrated all but complete incoherence while trying to repeat the talking points of the party that has adopted him like a pet.",
    "Sharice Davids, who twice fought professionally in a mixed martial arts octagon, in 2020 won her second term as a Democrat representing Kansass third congressional district.",
    "I dont know if Walker knows government is divided between the legislative, executive and judicial branches, or if he understands the reason the Second World War was fought.",
    "What I do know is that, right now, Im gonna win this seat, and, you know, everyone has complained, even Stacey Abrams complained that her race wasnt fair.",
    "Because he scored 61 touchdowns and gained 7,115 yards in three seasons in the short-lived USFL, where he played for the Trump-owned New Jersey Generals.",
    "Except in the eyes of the units Black sergeant Vernon C. Waters, who subscribes to a strident, no shuckin-and-jivin approach to Black liberation, C.J.",
    "He failed to show up for a debate three weeks ago against the other Republican hopefuls for Warnocks seat, and then repeated that dodge this week.",
    "C.J., who is Black like all but a couple of the characters, suffers all the side effects of being purposefully miseducated in a Jim Crow America.",
    "But none of that history, new or old, has stopped Walker from leading most primary polls or from being given a toss-up chance to defeat Warnock.",
    "One thing that I gotta worry about right now, that Im gonna have a fair election, that people can believe in our election when I run.",
    "And to sports fans, if its assumed they would vote for Walker merely because he was an exceptional athlete, one of the greatest.",
    "is no less an unknowing device for a part of White America attempting to nullify Black arguments for continued progress.",
    "Indeed, Walkers campaign managers late last year quietly scrubbed his biography of the claim he graduated from Georgia.",
    "Anthony Gonzalez, who caught passes from Peyton Manning in Indianapolis, won a House seat from Ohio as a Republican.",
    "is an unwitting tool for a recalcitrant White America, a means for it to invalidate calls for Black advancement.",
    "To Black voters, if its assumed they would vote for Walker merely because he was an exceptional Black athlete.",
    "But he, too, questioned the legitimacy of the last presidential election despite no evidence to do so.",
    "Because he scored 82 TDs on 8,225 rushing yards and 4,859 receiving yards in a dozen NFL seasons.",
    "Ironically, Warnock was swept into office in January 2021 with a boost from athletic bona fides.",
    "I dont know if there were problems with the 2020 election, Walker said on a radio talk show.",
    "But Walker doesnt measure up to the seriousness they displayed for the offices they sought.",
    "Walkers sole qualification for Georgias electorate, however, is his athletic notoriety.",
    "There is no other explanation: Walker is a former star from the field of athletics.",
    "But that shouldnt make him, or anyone, a legitimate candidate for elected office.",
    "It wasnt until just the other day that he changed his tune, albeit slightly.",
    "Memphis, for Walker  a good ol product of some small Southern town like C.J.",
    "He did so without debating and largely avoiding public questioning as well.",
    "He was a resident of Texas until tapped by the GOP to run against Warnock.",
    "He is hardly the first United States athlete to pursue elected office.",
    "His unearned political candidacy threatens calamitous consequences.",
    "Walker hasnt even voted more than once in the past two decades.",
    "I feel as similarly sorry for Walker as for the fictional C.J.",
    "What he doesnt know, and how hes behaved, matters not.",
    "And Ive heard a lot of people saying a lot of things.",
    "But hes likable as a standout on the baseball team.",
    "Walker should be in the Pro Football Hall of Fame.",
    "The viability of Walkers candidacy is insulting.",
    "He won a Heisman trophy there, but not a degree.",
    "Because he is a three-time all-American.",
    "Not his own, but those of WNBA players.",
    "Its difficult not to pity Private C.J.",
    "For singing to everyones delight.",
    "Sadly, it is not surprising.",
    "For playing his guitar.",
    "How?"
  ]
}