{
  "id": 7593,
  "mediaId": 136,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Democrats Campaigning in Swing States Are Reckoning With Biden's Economy",
  "image": "https://d.newsweek.com/en/full/2032165/gas-prices-inflation.webp?w=790&f=c90745e7becebf63d14775d5f6d6f086",
  "link": "https://www.newsweek.com/democrats-campaigning-swing-states-are-reckoning-bidens-economy-1703908",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Bush",
  "authorUrl": "https://www.newsweek.com/authors/daniel-bush",
  "termIds": [
    815,
    1136,
    1147,
    2087,
    146,
    571,
    2550,
    2672,
    2818
  ],
  "sentences": [
    "The Democratic Party's challenges on the economy were highlighted last month when Biden touted the economic growth on his watch while promoting the infrastructure law during a visit to New Hampshire, a state where Republicans feel confident they can pick up a Senate seat by defeating incumbent Senator Maggie Hassan in November.",
    "Democrats need to do a better job of promoting their record under Biden instead of focusing on the party's failure to pass Build Back Better, the president's ambitious social spending plan, and other progressive legislative proposals, said Jacquelyn Bettadapur, the Democratic chair of Cobb County in Georgia.",
    "Housing costs in the sales and rental markets have soared in the Phoenix area during the pandemic, and while rising interest rates may cool demand there are no signs prices will drop anytime soon, said Lee McPheters, the director of an economic outlook center at Arizona State University.",
    "Laxalt, a former Nevada attorney general who was endorsed by former President Donald Trump, has also criticized Senator Catherine Cortez Masto, the Democratic incumbent seeking reelection, for supporting covid restrictions that he said slowed Nevada's recovery from the pandemic.",
    "Despite the low unemployment rate, the number of residents who are working or actively looking for work remains below the state's pre-pandemic peak, said Phil Sletten, a senior policy analyst at the New Hampshire Fiscal Policy Institute, an independent think tank.",
    "But while the national economy looks good on paper, inflation and skyrocketing housing costs have wiped out wage gains for many middle and low-income workers  voters Democrats are relying on to help them retain control of both chambers of Congress.",
    "Warnock's early campaign messaging has focused on his work in the Senate to help pass the American Rescue Plan, the massive Covid relief bill Congress approved last year, as well as more recent legislative efforts to boost job growth in Georgia.",
    "With the primary season already underway in some states, Democrats have a limited amount of time left to convince voters they're better off now than they were under Trump, said Scala, the University of New Hampshire political science professor.",
    "\"What happens nationally in Washington, with the economy, gas prices, and inflation, is going to weigh heavily\" on the Senate and gubernatorial races in Georgia, said Chris Clark, the president and CEO of the Georgia Chamber of Commerce.",
    "The survey found Biden was also underwater in North Carolina, Pennsylvania and Wisconsin, three additional states with competitive Senate races this fall that could help determine control in the evenly divided 50-50 Senate.",
    "According to a household survey taken by the U.S. Census Bureau, 33 percent of residents last month said they found it \"somewhat or very difficult\" to pay for typical expenses, up from just 17 percent in the summer of 2021.",
    "Hassan grabbed headlines by traveling to the Southern border to slam the administration's plan to lift Title 42, a public health provision invoked by the Trump administration to block asylum seekers from entering the U.S.",
    "The White House has tried tying inflation to the Russian war in Ukraine, but Brian Seitchik, a Republican strategist based in Arizona, said voters in focus groups he's conducted laid most of the blame with the president.",
    "The uneven recovery looms as a major political problem for Democrats both nationwide and in the four states  Nevada, Arizona, Georgia and New Hampshire  where the most vulnerable Senate Democrats are up for reelection.",
    "The Phoenix area alone will likely add around 18,000 new single-family homes this year and a majority will be sold at market-rate prices, exacerbating the area's growing housing affordability problem, McPheters said.",
    "Similar issues exist in Nevada, Georgia and other swing states across the country, presenting challenges for Democrats crafting a midterm message that will turn out the party's base voters and attract independents.",
    "In Nevada, leading Republican Senate candidate Adam Laxalt told supporters at a recent rally that Washington needs to \"stop printing money and stop spending money\" in a speech blaming Democrats for high inflation.",
    "Recent polling reflects the disconnect between the economy's strong overall performance under President Joe Biden, and the public's disapproval of the way the president and Democrats have handled economic issues.",
    "Nationally, we've recovered 93 percent of the jobs we lost during the first two months of the pandemic\" in 2020, said George Hammond, the director of an economic research center at the University of Arizona.",
    "A new ABC News/Washington Post poll released Monday found that 50 percent of Americans trusted Republicans to better handle the economy, compared to 36 percent who said Democrats would do a better job.",
    "The party and president's low approval rating on a key midterm issue is also reflected in poor polling in battleground states, including the states that will likely decide control of the Senate.",
    "\"All that is well and good, but I think it's difficult to get voters to focus on infrastructure and long-term economic planning when they're stuck in the here and now and it's not very pretty.\"",
    "A Morning Consult poll taken last month showed Biden with a net disapproval rating of at least 11 percent in Nevada, Arizona, Georgia and New Hampshire, all states that he carried in 2020.",
    "Cortez Masto has touted the bipartisan infrastructure law as a significant boon for the state and national economy, while distancing herself from Biden on other issues like immigration.",
    "Democratic voters \"understand the importance of making sure Mitch McConnell isn't majority leader and isn't able to\" block any future high court picks while Biden is president, he said.",
    "But they did not keep up with inflation, he added, making it hard for middle and lower-income families who never fully recovered from the Great Recession to afford rising costs today.",
    "Republican Senate candidates have hammered Biden and Democrats for their handling of the economy and inflation, making the issues a central theme in the early stages of the midterms.",
    "\"He wanted to talk about infrastructure and how his bill laid the groundwork for a prosperous future,\" said Dante Scala, a political scientist at the University of New Hampshire.",
    "The median sale price of a single-family home in March was $440,000, according to data by the New Hampshire Association of Realtors, a 20 percent jump from March of last year.",
    "Polls in Georgia show a tight race between Warnock and Walker, with one survey by Emerson College Polling/The Hill taken last month showing Walker up four percentage points.",
    "The price of home heating oil across New England is up 83 percent compared to this same time last year, data from the federal Energy Information Administration shows.",
    "Earlier this year, a super PAC backing Walker took out billboard ads in Georgia tying incumbent Democratic Senator Raphael Warnock to inflation and high gas prices.",
    "The liberal online fundraising platform ActBlue reported receiving more than $1 million in donations in the first hours after Politico published its report Monday.",
    "In the Phoenix metropolitan area -- which is home to more than half of Arizona's population -- the year-over-year rate of inflation was 10.9 percent in February.",
    "And frankly it hasn't significantly slowed down,\" said Kelly McGowan, the deputy director of Wildfire, an organization focused on ending poverty in Arizona.",
    "The covid aid packages passed under Biden and former President Donald Trump helped keep less affluent families afloat in the early stages of the pandemic.",
    "\"Until we can get this inflation under control, we're still losing,\" Walker, another Trump-backed candidate, said in a video posted to Twitter last month.",
    "In Georgia, leading Republican Senate candidate and former football star Herschel Walker has spoken out repeatedly about rising gas prices and inflation.",
    "The poll found 68 percent of Americans disapproved of Biden's handling of inflation, and 57 percent disapproved of his overall handling of the economy.",
    "In recent weeks, Cortez Masto, Hassan and Democratic Senator Mark Kelly of Arizona have all criticized the Biden administration's immigration policies.",
    "New Hampshire's unemployment rate is just 2.5 percent, even better than the national rate of 3.6 percent  itself the lowest on record in four decades.",
    "But in a worrisome sign for the Democrat, voters said the economy was their top issue and 57 percent disapproved of Biden's handling of the economy.",
    "A strong economic recovery from the pandemic was supposed to be a bright spot for Senate Democrats heading into a difficult midterm election year.",
    "\"The major protections that were helping people, like expanded unemployment, the eviction moratorium, the expanded child tax credit, they're over.",
    "Even before the draft opinion was made public, Democrats were preparing to use a potential ruling overturning Roe v. Wade to energize supporters.",
    "Late Monday, Politico published a leaked draft opinion of a majority ruling by the Supreme Court to overturn the landmark decision Roe vs. Wade.",
    "If they haven't been formally evicted, they've gotten notice their rent will be increased so significantly beyond what they can afford.\"",
    "Wages in key sectors of the state's economy, such as retail, leisure and hospitality, and health care, went up last year, Sletten said.",
    "The Supreme Court could play \"a major factor\" in November, said Raymond Buckley, the chair of the New Hampshire Democratic Party.",
    "New permits for single and multi-family housing units are up more than 60 percent from the annual average before the pandemic.",
    "The price of gasoline has also gone up, driven by global disruptions in the oil market caused by Russia's invasion of Ukraine.",
    "The broader economic recovery \"has been overshadowed over the last half dozen months by the power of inflation,\" Scala said.",
    "\"But there's no doubt that inflation is eating away at the strong income growth we saw during the pandemic,\" Hammond said.",
    "A more recent online poll had Warnock up five points in what will be one of the most closely-watched contests this fall.",
    "But most of those government relief programs ended last year, McGowan said, leaving struggling families on their own.",
    "Some Democrats have already started focusing on other issues as they test ways to distance themselves from Biden.",
    "\"At the height of the pandemic, we were getting 800 to 1,000 phone calls asking for emergency rental assistance.",
    "Last year the median rent for a two-bedroom apartment in New Hampshire was $1,500, according to state data.",
    "The situation is more dire for low-income residents facing rental spikes in Phoenix and across the state.",
    "A poll last month found Cortez Masto leading Laxalt by 8 percentage points among registered voters.",
    "\"Our biggest challenge as Democrats is that everyone looks at it as a glass half full,\" she said.",
    "\"It is still a very open question whether this recovery will [be] more equitable,\" Sletten said.",
    "The political battle over abortion rights is also poised to be a major issue in the election.",
    "The annual rate of inflation for the U.S. was 8.5 percent in March, the highest since 1981.",
    "Many of the same economic challenges exist in other states with key 2022 Senate races.",
    "There's a lot of people on the far left who feel they didn't get what they wanted.\"",
    "Republicans argued Democrats can't run from their record, especially on inflation.",
    "\"This is solely at the feet of President Biden and the Democrats,\" Seitchik said.",
    "The things that really buffered families during the pandemic are gone,\" she said.",
    "But there are numerous warning signs beneath the surface-level signs of growth.",
    "Still, economic concerns will likely remain front and center in the midterms.",
    "But cost of living concerns tend to rise to the top of mind for folks.\"",
    "\"We're pretty much back to where we were before the pandemic began.",
    "\"People are worried about where they're going to live.",
    "\"I think there's a certain level of disappointment.",
    "Housing costs have also increased dramatically.",
    "We didn't get the Build Back Better plan.",
    "\"Some parts of the economy are good.",
    "Rents have also risen significantly."
  ]
}