{
  "id": 7599,
  "mediaId": 12,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Nikki Haley endorses 2nd District GOP candidate Jeremy Hunt",
  "image": "https://www.ajc.com/resizer/jomsZHwtT4UzmyKyyN7EpSyzLbk=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/S3A4TNCDWCUPUN3HKHGDH5LLMI.jpg",
  "link": "https://www.ajc.com/politics/nikki-haley-endorses-2nd-district-gop-candidate-jeremy-hunt/2J7CPWHOOZF47FKJ6GJTZFJASA/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tia Mitchell",
  "authorUrl": "https://www.ajc.com/staff/tia-mitchell/",
  "termIds": [
    805,
    815,
    1101,
    1448,
    1959,
    2195,
    5340,
    428,
    2672
  ],
  "sentences": [
    "Her team did not elaborate on why Hunt was chosen despite his limited ties to the region where he is running and what enticed her to get involved in this GOP primary and not the many others across Georgia.",
    "Jeremy Hunt, one of six Republicans competing in the primary in Georgias 2nd Congressional District, has received his highest profile endorsement yet via former Ambassador Nikki Haley.",
    "Hunt has raised more money and has more cash on hand than any other candidate in the race besides Bishop, but less than 20% of his cash comes from inside the 2nd District.",
    "Haley in a statement said that she decided to back Hunt in the partys effort to flip the seat held by long-time Democratic Rep. Sanford Bishop.",
    "Hunts entry into the 2nd District race in January drew criticism because at the time he was registered to vote in the metro Atlanta suburbs.",
    "Josh Hawley and Tom Cotton in backing Hunts campaign despite criticism from his opponents that his ties to southwest Georgia are thin.",
    "As a West Point grad, he understands the cost of freedom, and as a young dad he knows whats at stake with Bidens socialist agenda.",
    "I cant think of a tougher, next-generation leader to take on Sanford Bishop and bring some Georgia commonsense to Washington.",
    "The only other Georgia candidate who has Haleys backing is Herschel Walker, who is running for U.S. Senate.",
    "Jeremys a natural born leader whos devoted his life to God and public service, she said.",
    "Haleys Stand for America PAC will hold online fundraisers on Hunts behalf.",
    "He registered to vote with a Columbus address in February.",
    "She joins Newt Gingrich and U.S. Sens."
  ]
}