{
  "id": 7608,
  "mediaId": 12,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Herschel Walkers mental health battle raises questions about treatment",
  "image": "https://www.ajc.com/resizer/bjb0m-SPB7xCsZn-GRB97fWVMGk=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/GJLURXHYTBXYU3PSTPU2QHCGJE.jpg",
  "link": "https://www.ajc.com/politics/a-controversial-therapist-and-domestic-violence-herschel-walkers-mental-health-battle-raises-questions/LWCO3MUCVRFRLMCJK46REA4HNU/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Shannon McCaffrey",
  "authorUrl": "https://www.ajc.com/staff/shannon-mccaffrey/",
  "termIds": [
    815,
    1462,
    1813,
    5715,
    5893,
    501,
    2550
  ],
  "sentences": [
    "Herschel Walker wrote a book about his mental health 14 years ago, has discussed it extensively and was praised by reporters across the country for his transparency on the subject  that is, until he became a Republican Senate candidate, said Scott Paradise, Walkers campaign manager.",
    "But Walkers mental health story is complicated, interlaced with allegations of domestic violence and featuring a controversial therapist who has said a patients choice of crayon color can reveal whether he or she is gay or even possessed by demons.",
    "It would be no different from sighting at the targets Id fired at for years  except for the visceral enjoyment Id get from seeing the small entry wound and the spray of brain tissue and blood  like a Fourth of July firework  exploding behind him.",
    "Dr. Colin Ross, who has studied DID extensively and treats patients in Austin, Texas, and the Dallas-Fort Worth area, said some patients can achieve full integration of their personalities while others learn to manage the condition.",
    "Walker said he had 12 alternate personalities  or alters  including the warrior (who played football), the sentry (who avoided emotional attachments) and the thrill seeker (who played Russian roulette with a loaded gun).",
    "Walker was described in the police report as volatile, and officers said they would place the home on a caution list since Walker does have violent tendencies and has talked about having a shootout with police.",
    "Dissociative identity disorder  or DID  was first included in the Diagnostic and Statistical Manual of Mental Disorders  the handbook for mental health practitioners thats also called the DSM  in 1994.",
    "The only current member of Congress who acknowledges a mental illness is Arizona Democratic U.S. Rep. Ruben Gallego, an Iraq War veteran who says he suffers from post-traumatic stress disorder.",
    "Reporting on candidates backgrounds is part of the Atlanta Journal Constitutions commitment to providing voters the information they need to make informed choices in this years elections.",
    "When the healing takes place those areas of the brain that were showing the homosexuality showed heterosexuality, he said in an interview with Joni Lamb on the Christian network Daystar.",
    "But another side of me was so angry that all I could think about was how satisfying it would feel to step out of the car, pull out the gun, slip off the safety, and squeeze the trigger.",
    "Stigma\nA Harris Poll survey conducted for the American Psychiatric Association in 2019 found that 87% of American adults believe that mental illness is not something to be ashamed of.",
    "In September of the same year, Mungadze summoned police to the Walkers home in Irving, Texas, after becoming alarmed by something Walker told his wife, according to a police report.",
    "Walker, who wrote about his battle with dissociative identity disorder, or DID, in a 2008 memoir Breaking Free, declined an interview request from The Atlanta Journal-Constitution.",
    "When word leaked out in 1972 that vice presidential nominee Thomas Eagleton had been treated for depression with electroshock therapy he was forced from the Democratic ticket.",
    "Ronald Reagan, then the oldest person to assume the presidency, waived doctor-patient confidentiality, allowing his physicians to talk to the media about his mental fitness.",
    "An ex-pastor, Mungadze, earned a bachelors degree in Bible from the Dallas Bible College and a masters degree in biblical studies from the Dallas Theological Seminary.",
    "If Herschel Walker wins Georgias U.S. Senate seat, he would become the most prominent elected official in the nation who has struggled openly with a mental illness.",
    "In a 2008 interview with ABC News, Grossman said that while she and Walker were married he repeatedly held a gun to her head and threatened to blow her brains out.",
    "There is no medication proven to treat DID, although certain drugs can be used to alleviate other conditions, such as anxiety or depression, that can accompany it.",
    "But in writings and interviews, Mungadze  who is a licensed professional counselor but not a medical doctor  has embraced highly unorthodox beliefs and methods.",
    "The logical side of me knew that what I was thinking of doing to this man  murdering him for messing up my schedule  was not a viable alternative, Walker wrote.",
    "About this story\nA lot has changed since President Franklin Delano Roosevelt was able hide his paralysis from the public early in the 20th Century.",
    "But in 2012 a Texas woman filed a police report accusing him of threatening to blow her head off and then kill himself if she broke up with him.",
    "Jan Christianson, executive director of the Georgia Coalition Against Domestic Violence, called the allegations against Walker deeply troubling.",
    "Walker had punched a hole in the wall after being confronted there by a girlfriend and his wife, Cindy, according to a law enforcement report.",
    "Hes referring to a method he pioneered  widely debunked as unscientific  in which a person is asked to color in a drawing of the human brain.",
    "For many years, when I lived in Africa, I saw people who were demonized, Mungadze said an interview with Christian televangelist Benny Hinn.",
    "Mungadze, who is colorblind, said the shade of crayon a patient selects for various parts of the brain reveals whats wrong with him or her.",
    "That same year, a former Dallas Cowboy cheerleader accused Walker of threatening her and sneaking around outside her suburban Dallas home.",
    "The goal is to try to face the trauma that triggered the condition in the first place and to eventually integrate various personalities.",
    "Roughly four years after his diagnosis, Walkers ex-wife, now using the last name Grossman, sought a protective order against Walker.",
    "Sometimes even after patients have learned to manage the condition they must still seek out help at various points in their lives.",
    "Grossmans sister Maria Tsettos alleged in an affidavit that Walker had repeatedly threatened to kill Grossman and her boyfriend.",
    "Walker said that as a pudgy child with a stutter he was bullied by other kids in his hometown of Wrightsville in Middle Georgia.",
    "But as a spokesperson for DID, bringing more attention to a mental condition that is often misunderstood, she admires him.",
    "There, he said, doctors confirmed the diagnosis and he took part in group therapy with other DID patients, the book said.",
    "Furious with a man who was late delivering a car, Walker hopped in his Mercedes sedan with a loaded gun to hunt him down.",
    "A 2020 Rasmussen poll found that 86 percent of likely U.S. voters rate a candidates health as important to their vote.",
    "He has a doctorate in counselor education from the University of North Texas, where he says he minored in psychology.",
    "Sybill, The Three Faces of Eve and The United States of Tara have all dramatized women with fractured personalities.",
    "Violent tendencies\nIn his book, Walker wrote that his life began to unravel after he retired from football in 1998.",
    "Walker wrote that he later went to Del Amo Psychiatric Hospital in Torrance, California, for outpatient treatment.",
    "Those steeped in witchcraft and the occult, for instance, typically choose black, brown and gray crayons, he said.",
    "In a paper presented in 2000, Mungadze provided a checklist of questions practitioners should ask their patients.",
    "It shouldnt be, said Dr. J. Douglas Bremner, director of Emory Universitys Clinical Neuroscience Research Unit.",
    "Still, in the same poll, one-third of respondents said they were scared of people with mental health disorders.",
    "Mungadze worked with Walker over the next weeks, then handed down a diagnosis: dissociative identity disorder.",
    "Today, it is commonplace for presidents and other top elected officials to update the public on their health.",
    "Trujillo said she doesnt agree with Walkers politics and is unfamiliar with his brushes with law enforcement.",
    "For some, he would be an important symbol and champion for a type of illness that has long been stigmatized.",
    "In Georgia, U.S. Sen. Johnny Isakson announced in 2015 that he had been diagnosed with Parkinson diseases.",
    "Walkers campaign refused to answer questions about his current treatment or whether he still has symptoms.",
    "If one person is pivotal in that recovery narrative,its Mungadze, who wrote the forward to Walkers book.",
    "Walker did not include in his book a string of encounters with police that began around this same time.",
    "In a CNN interview that same year, Grossman said he held a straight razor to her throat and choked her.",
    "He has said in past interviews and in motivational speeches that he is healed but provided few details.",
    "A Dallas County judge granted the protective order and temporarily barred Walker from possessing guns.",
    "I consider him one of my best friends and probably the most essential, Walker wrote in Breaking Free.",
    "There is general agreement that childhood trauma  often severe physical or sexual abuse  sparks DID.",
    "Myka Dean said she was Walkers longtime girlfriend, according to a January 2012 police report.",
    "Sometimes a memory or a stressor can trigger a relapse, he said, requiring additional therapy.",
    "In May 2001, police in Bedford, Texas, were called to a building where Mungadze had an office.",
    "His doctoral thesis involved claims of demonic possession among people in his native Zimbabwe.",
    "Mungadze has also said he is able to erase all signs of homosexuality from a patients brain.",
    "A child creates alters to cope; the alter experiences the pain and abuse, sparing the child.",
    "The two had met decades earlier at a track meet and reconnected at a Dallas dinner party.",
    "He pulled to a stop after seeing a SMILE JESUS LOVES YOU sticker on the back of a truck.",
    "For instance, someone with DID may end up in a location and not know how they got there.",
    "As Walker drove to find the man, he said an internal struggle played out in his head.",
    "Walker has not denied the allegations but has said he doesnt remember the instances.",
    "Through his wife, Cyndi, Mungadze declined a request for an interview with the AJC.",
    "Something was clearly wrong with me and I had to figure out what it was, he wrote.",
    "Demons and crayons\nWalker has framed DID as another tough challenge he overcame.",
    "Among them, Have they willingly, under any circumstances, vowed to follow Satan?",
    "Mental illness, he has said, can sometimes be confused with demonic possession.",
    "Among some in the psychiatric community, DID is still a contentious diagnosis.",
    "Grossman told ABC that she saw a change in Walker after he left pro football.",
    "The Heisman Trophy winner said he reached a breaking point in February 2001.",
    "But experts say that DID is complicated, often requiring years of therapy.",
    "That doesnt surprise Olga Trujillo, who was diagnosed with DID at age 31.",
    "But I didnt know you could see demonization in the brain, which I do now.",
    "In Washington, mental illness has long been taboo for elected officials.",
    "Walker said in the ABC interview that he had his alters under control.",
    "Now 60, she said stigma surrounding mental illness is still a problem.",
    "Hes this amazing athlete who has led a successful life, Trujillo said.",
    "Before that it had been referred to as multiple personality disorder.",
    "Mungadze doesnt appear to have any specific training in neurology.",
    "No charges were filed against Walker, who has denied the claims.",
    "If Americans know about DID, its probably because of Hollywood.",
    "He described being so lonely he paid other kids to talk to him.",
    "Dr. Jerry has played an important role in my healing process.",
    "Mungadze now said he specialized in treating trauma patients.",
    "Mental illness does not excuse his behavior, she said.",
    "Mungadze has denied he is a gay conversion therapist.",
    "My first thought was that he had the devil in him.",
    "You have to take accountability for your actions.",
    "But that often takes years in therapy, he said.",
    "Instead, patients undergo intensive therapy.",
    "The call was described as a welfare check.",
    "I began to see the alters, Grossman said.",
    "He didnt have to speak out, but he did.",
    "His physical countenance would change.",
    "The public supports this transparency.",
    "No charges were filed in either case.",
    "Both reports were heavily redacted.",
    "Walker has denied the allegations.",
    "Walker went to see Jerry Mungadze.",
    "You cant hide behind a diagnosis.",
    "A key symptom is missing time.",
    "He provided few other details.",
    "Again, no charges were filed.",
    "The Walkers divorced in 2002.",
    "Its in the DSM for a reason.",
    "But he didnt know the cause.",
    "In the same interview.",
    "What is DID?"
  ]
}