{
  "id": 7625,
  "mediaId": 19,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Exclusive  National Pro-Life Group Endorses Herschel Walker for Senate, Disavows Radical Biden-Warnock Agenda",
  "image": "https://media.breitbart.com/media/2021/10/georgia-senate-candidate-herschel-walker-sept25-21-ap-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/03/exclusive-national-pro-life-group-endorses-herschel-walker-for-senate-disavows-radical-biden-warnock-agenda/",
  "sentiment": "0.282",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    815,
    1136,
    2087,
    4135,
    482,
    571,
    2979,
    3550,
    2672,
    2900
  ],
  "sentences": [
    "SBA List charged that Warnock shamefully twists scripture and cited his vote history, which the group has rated an F.\nIn addition to rubber-stamping abortion on demand until birth, paid for by taxpayers, lethal discrimination against unborn babies with Down syndrome, and even denying medical care to babies who survive abortions, the group said, Warnock has also pushed to eliminate commonsense protections for unborn children and mothers that Georgians have worked for years to enact.",
    "@SenatorWarnock voted FOR infanticide in 2021: https://t.co/bRgMCivD8D\n Susan B. Anthony List #ModernizeOurLaw (@SBAList) April 29, 2022\nWarnock, a longtime pastor at the historic Ebenezer Baptist Church, became known in part for his antithetical no-restrictions view on abortion during his first campaign for Senate in the high-profile Georgia runoffs in 2021.",
    "The forthcoming final ruling by the Supreme Court, which is anticipated sometime within the next couple months, is likely to jolt the midterm election campaigns and bring the issue of abortion to the fore, particularly in major battleground states like Georgia, Nevada, Arizona, and New Hampshire.",
    "SBA List is active nationally but has been working on the ground in Georgia since last summer  primarily educating Georgians on Warnocks positions on abortion  and recently shared a string of posts on social media about the feedback it had received from potential voters.",
    "The SBA Lists endorsement was incidentally planned right before a stunning Politico report released Monday appeared to reveal a draft majority ruling by the Supreme Court to overturn Roe v. Wade, which would effectively flip control of abortion laws back to states.",
    "Warnock said during his campaign at the time, I believe unequivocally in a womans right to choose, and that the decision is something that we dont want government engaged in  thats between her and her doctor and her minister.",
    "An SBA List spokesperson told Breitbart News the group has close to 60 canvassers in the field in the Peach State who are currently mainly active in bluer areas of Georgia, including Metro Atlanta, Savannah, and Augusta.",
    "Walker, a former University of Georgia football star, said in a statement it was an honor to have the pro-life groups endorsement and vowed to always vote to protect the sanctity of life.",
    "The Susan B. Anthony (SBA) List is throwing its weight behind Georgia Republican Herschel Walker in this years battleground race for U.S. Senate in Georgia, Breitbart News has learned.",
    "The spokesperson confirmed SBA List and its affiliated entities, such as the Women Speak Out PAC, are working with an overall budget of $72 million for the 20212022 election cycles.",
    "The group will announce Tuesday it is endorsing Walker, the frontrunner poised to face incumbent Sen. Raphael Warnock (D-GA) in the general election after Georgias May 24 primary.",
    "Herschel Walker is a pro-life champion who has what it takes to send extremist Sen. Raphael Warnock packing, SBA List President Marjorie Dannenfelser said in a statement.",
    "Its pro-life representatives on the ground have visited more than 200,000 homes since last summer, and that number is expected to double ahead of November.",
    "Hardworking, disciplined and no stranger to adversity, Walker is a leader on and off the field whose faith informs his staunch pro-life values.",
    "It goes without saying that he doesnt represent Georgia values in the Senate, so I look forward to taking his seat in November.",
    "One man was very surprised to hear about Sen. Warnocks positions on abortion and infanticide since Warnock is a preacher.",
    "I thought he was a religious man, one man told an SBA List representative of Warnock while the group was door knocking.",
    "Were honored to back him as we work tirelessly to take back the U.S. Senate and block the radical Biden-Warnock agenda.",
    "Walker added, I cant understand how anyone in good conscience could proudly support abortion, especially as a reverend.",
    "Raphael Warnock proudly says he is a pro-choice pastor and sides almost 100% of the time with Joe Biden, Walker said.",
    "Herschel Walker can deliver the win Georgians need and deserve in this competitive election year, SBA List said.",
    "Specifically, the guy I was talking to said, I thought he was a religious man.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "Follow her on Twitter at @asholiver."
  ]
}