{
  "id": 7632,
  "mediaId": 43,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Trump rallies support for Nebraska candidate, insisting he's 'innocent' of sexual assault",
  "image": "https://images.dailykos.com/images/1065008/story_image/GettyImages-1394862913.jpg?1651506674",
  "link": "https://www.dailykos.com/story/2022/5/2/2095274/-Trump-s-closing-pitch-to-Nebraska-voters-Accused-serial-groper-is-a-very-good-man",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Clawson",
  "authorUrl": "/users/laura clawson",
  "termIds": [
    815,
    1147,
    1839,
    1902,
    2136,
    2470,
    3010,
    428,
    2816
  ],
  "sentences": [
    "And in addition to the Thomas-Trump-Kavanaugh list Herbster was so eager to associate himself with, Trumps endorsements include Herschel Walker, a U.S. Senate candidate in Georgia who has been accused of threatening the lives of two women, as well as Sean Parnell, who ended his U.S. Senate campaign in Pennsylvania last year amid domestic abuse allegations, and Roy Moore, a 2017 candidate for U.S. Senate in Alabama who was accused by two women of initiating unwanted sexual encounters when Moore was in his 30s and they were 16 and 14, as The Washington Post summarizes.",
    "In addition to his endorsement from fellow groper Trump, Herbster at one point hired former Trump campaign aide Corey Lewandowski to help run his campaign  until Lewandowski was accused of sexually harassing the wife of a major Republican donor.",
    "RELATED STORIES:\nNo alleged sexual assaulter is too gross for Donald Trump to campaign with\nTrump pick for Nebraska governor attacks woman who accused him of assault in new ad\nThis is a short blurb about Daily Kos.",
    "To be treated in that way in a public event, in front of everyone, just to prove, I believe, that he could get away with it, and not having recourse, its terrifying, one woman told the Examiner.",
    "Pete Ricketts, who has endorsed a rival primary candidate and placed himself squarely in a lineup of Republican men whove faced credible sexual misconduct allegations and triumphed.",
    "I dont think theres any body to it, one Nebraska voter at the rally told the Post, while his wife agreed, People are going to say whatever theyre going to say, no matter who it is.",
    "RELATED STORY: GOP gubernatorial candidate accused of groping seven women, GOP state senator\nTrumps defense of Herbster was so heartfelt he even broke out a sir story.",
    "Charles Herbster and his top endorser\nDonald Trump was in Nebraska on Sunday rallying support for his chosen candidate in the Republican gubernatorial primary there.",
    "Republican State Sen. Julie Slama has confirmed to the Nebraska Examiner that Herbster reached up her skirt and touched her inappropriately at a 2019 event.",
    "Eight different women, including a Republican state senator, have said Charles Herbster touched them inappropriately at public events.",
    "A total of six women describe Herbster using photo ops or hellos and goodbyes as an opportunity to grabnot graze or brushtheir butts.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "According to Trump, Herbster is innocent, and a very good man whos been maligned with what Trump says are despicable charges.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Todays Republican Party: the party of coup attempts and repeatedly shrugging off sexual misconduct allegations.",
    "A witness to that was also one of three who saw Herbster grope another womans buttocks at the same event.",
    "Being a conservative Republican woman in politics, you just expect to be treated with respect.",
    "And go figure, Trumps man in Nebraska was recently reported to be a serial groper.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Another woman says Herbster once cornered her and kissed her against her will.",
    "Herbster has insisted the allegations are a political ploy by outgoing Gov.",
    "Im scared for any young women that he would be dealing with in the future.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "A lot of people, they look at you and say: You dont have to do it, sir.",
    "Trump himself has been accused of groping and worse by dozens of women.",
    "Its a playbook from the past, Herbster said on Steve Bannons podcast.",
    "They being women who objected to having been harassed or assaulted?",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Many Republican voters have decided that they just dont care.",
    "Dont send your daughters to work for this guy, she added.",
    "I defend people when I know theyre good, Trump said.",
    "Its almost like theres a pattern with these guys.",
    "Look what they did to Brett M. Kavanaugh.",
    "Look what they did to Clarence Thomas.",
    "Look what they did to Donald J. Trump.",
    "I dont really think it matters.",
    "Now, its Charles W. Herbster.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "I defend my friends.",
    "Please read it."
  ]
}