{
  "id": 7634,
  "mediaId": 1576,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Candidates test skipping debates without upsetting voters",
  "image": "https://www.wabe.org/app/uploads/2021/10/AP21300613523691-scaled.jpg",
  "link": "https://www.wabe.org/candidates-test-skipping-debates-without-upsetting-voters/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1136,
    1404,
    2419,
    427,
    428,
    571,
    2834
  ],
  "sentences": [
    "While skipping the GOP debates is unlikely to hurt Walker in the primary, a no-show strategy in the general election  when he would face Warnock, an accomplished orator who serves as pastor of one of Georgias most prominent churches  could be a different story, said Andra Gillespie, a political science professor at Emory University.",
    "But some of the Republicans who are still engaging in the process say that skipping debates could ultimately leave the eventual nominees vulnerable in a general election, unprepared to answer tough questions or engage with rivals in a way that could appeal to voters beyond the party base.",
    "He also posted odd video messages, including one in which he said his takeaway from reading the Constitution the previous night was that the people in Washington work for the American people, and we can demand and hold them accountable if we count all the legal votes.",
    "Officers responding to a 2001 report that Walker was armed and scaring his estranged wife at a suburban Dallas home later noted that Walker talked about having a shoot-out with police, according to a police report revealed by the AP in February.",
    "In Pennsylvania, which holds primary elections on May 17, Democratic Senate candidate John Fetterman skipped a debate last month, saying he chose to participate in three other debates because they will have wider reach on television.",
    "As the most competitive phase of the midterm primary season unfolds this week, many candidates for leading offices  often Republicans  are abandoning the time-honored tradition of debating their rivals before Election Day.",
    "He has wrongly referred to the late congressman John Lewis as a senator and said the voting rights activists eponymous election bill  the John R. Lewis Voting Rights Advancement Act  doesnt fit what John Lewis stood for.",
    "But after facing criticism from rivals at the first Georgia Republican Senate debate in April, including about his absence, Walker told North Georgia radio station Access WDUN that his opponents were jealous.",
    "For others, its an opportunity to snub a media ecosystem they find elitist and cast themselves in the mold of former President Donald Trump, who made a show of missing some debates during the 2016 campaign.",
    "And he told a reporter in January that asking whether he would have voted for a bipartisan infrastructure bill was unfair because he hadnt been privileged to receive all the facts about the measure.",
    "Youve got to be an Alabama fan because you asked that question there, Walker, a college football star at the University of Georgia, told the reporter for the right-wing news site The Daily Caller.",
    "The Republican National Committee is already moving toward withdrawing from the 2024 presidential debates, though the ultimate decision will likely fall on whoever emerges as the partys nominee.",
    "A spokesman for Budd, Jonathan Felts, has said instead of attending debates, Budd was focused on finishing his tour of North Carolina counties so he could speak directly to voters.",
    "asked Latham Saddler, a Navy veteran and former Trump administration official who is among five Republicans challenging Walker, referring to the Democratic incumbent.",
    "Walker did not graduate from the University of Georgia, but has said he did  a falsehood repeated initially by his campaign on a website promoting his Senate bid.",
    "And on Tuesday, Herschel Walker is expected to miss a second debate against his Republican rivals for a crucial U.S. Senate seat after skipping the first one.",
    "Walker may need to persuade some voters to win what would likely be a tight race, and that would require him to perform and answer questions, she said.",
    "He repeatedly made false claims of voting fraud on his Twitter account following Trumps loss to Democrat Joe Biden in the presidential election.",
    "If you cant get on the stage and debate fellow Republicans, how the heck are you going to debate with Raphael Warnock in the general election?",
    "In still another video, he said that anyone who wants to change the Constitution should be impeached because the Constitution has to stand.",
    "His status as a Georgia sports legend, along with Trumps endorsement, made him the GOP favorite as soon as he entered the race in August.",
    "Walker recently cast doubt on evolution at a church gathering by questioning why apes still existed if humans originated from them.",
    "GOP candidates for governor in Ohio, Nevada and Nebraska have also refused to engage with their opponents from the debate podium.",
    "He doesnt widely publicize his campaign stops and limits appearances mostly to conservative news outlets and friendly audiences.",
    "Walker led the University of Georgia football team to a national title in 1981 and won the Heisman Trophy a year later.",
    "For some gaffe-prone candidates such as Walker, avoiding the debate stage reduces the chance of an embarrassing moment.",
    "His campaign has not granted The Associated Press an interview despite repeated requests, including for this story.",
    "Because right now Herschels going to win that seat, he said during an April 20 appearance on the program Newsroom.",
    "Campaign spokeswoman Mallory Blount said in an email last week that Walker had conducted more than 105 interviews.",
    "In a protective order sought by his then-ex-wife in 2005, Walker was accused of repeatedly threatening her life.",
    "In one tweet, he suggested people in several battleground states should be given the opportunity to vote again.",
    "Though many of those who have skipped debates are Republican, some Democrats have followed a similar strategy.",
    "He does interviews and takes questions from thousands of Georgians as he travels across the state every week.",
    "Asked on WDUN whether he would debate Warnock, Walker said he was committed to doing whatever it took to win.",
    "He went on, But if we start counting illegal votes, we then start working and depending on the government.",
    "They want what people are going to do for their state of Georgia, and they cant do anything but complain.",
    "Ted Budd has skipped four Republican primary debates in his bid for a U.S. Senate seat in North Carolina.",
    "Walker has been open about his long struggle with mental illness and acknowledged violent urges.",
    "His campaign has dismissed the report of a shoot out and blamed the media for highlighting it.",
    "Still, limiting questioning and access may help avoid discussions about his turbulent past.",
    "They cant win it, so theyre going to the old politics where people are tired of that.",
    "Associated Press writer Russ Bynum in Savannah, Georgia, contributed to this report.",
    "Usually if youre hiding, youre hiding for a reason, Saddler said in an interview.",
    "Walker holds a commanding lead over his rivals heading into the May 24 primary.",
    "The suggestion that Herschel is not accessible is a lie, she said.",
    "But weve all got to rejoice in who the Lord Jesus Christ is.",
    "Warnock better get ready because Im getting ready, he said.",
    "In Walkers case, his reticence extends beyond debating.",
    "But when Walker does speak, awkward moments can ensue.",
    "But then he added, Maybe amend it a little bit.",
    "The bill was signed into law in November.",
    "Trending",
    "So Rev."
  ]
}