{
  "id": 7635,
  "mediaId": 33,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "ANLISIS: Las primarias de mayo pondrn a prueba el toque de Trump como lder del Partido Republicano",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/200513094839-paul-manafort-file-2017-story-tablet.jpg",
  "link": "https://cnnespanol.cnn.com/2022/05/02/primarias-mayo-pondran-a-prueba-trump-lider-partido-republicano-trax/",
  "sentiment": "0.0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Por Maeve Reston",
  "authorUrl": "https://cnnespanol.cnn.com/author/maeve-reston/",
  "termIds": [
    815,
    2095,
    2303
  ],
  "sentences": [
    "Los votantes en Alabama tambin acuden a las urnas el 24 de mayo, pero Trump ya no est directamente involucrado en las primarias republicanas para el Senado all despus de que rescindi su respaldo al representante republicano Mo Brooks, una vez uno de sus lugartenientes ms leales en el Capitolio, molesto tanto por la campaa agitada del congresista como por su afirmacin de que los votantes deberan dejar atrs las elecciones de 2020.",
    "Las contiendas de mayo resumen la larga sombra que las quejas personales de Trump continan arrojando sobre su partido y la medida en que ha atrapado a sus leales republicanos en un tnel del tiempo mientras, al mismo tiempo, los alienta a seguir impulsando sus afirmaciones sin fundamento de fraude electoral de 2020, en un momento en el que muchos estadounidenses tienen preocupaciones ms apremiantes.",
    "Pero Trump nunca ha mostrado mucha preocupacin por la forma en que sus ambiciones personales han descarrilado las oportunidades de enviar mensajes ms efectivamente de su partido, y 2022 le ha dado la oportunidad de elegir a candidatos que son tan implacables como l para seguir sembrando dudas sobre los resultados de 2020, a pesar de que no hay evidencia de fraude electoral generalizado.",
    "17 de mayo: las contiendas reidas para los candidatos de Trump en Pensilvania y Carolina del Norte\nLa contienda para reemplazar al senador republicano Pat Toomey, en Pensilvania, quien se jubila, est en camino de convertirse en una de las ms caras del pas, ya que el estatus perenne de estado indeciso hace que ese escao entre los ms propensos a pasar del control republicano al demcrata.",
    "Trump ha respaldado a Charles Herbster, un ranchero y hombre de negocios, y lo ha apoyado incluso despus de que el Nebraska Examiner informara, a mediados de abril, que siete mujeres, incluida la senadora estatal republicana Julie Slama, haban acusado a Herbster de manosearlas en eventos polticos o concursos de belleza, con una mujer adicional acusndolo de besarla a la fuerza.",
    "La otra competencia principal en el Senado el 17 de mayo es la carrera para reemplazar al senador Richard Burr que se retira en Carolina del Norte, donde Trump respald al representante Ted Budd, quien respald las maniobras electorales del expresidente en 2020 votando para descartar los resultados electorales en Arizona y Pensilvania, en enero de 2021.",
    "McCrory, a su vez, acus a Budd de ser \"imprudente\" con sus palabras, publicando un anuncio engaoso centrado en los comentarios de Budd sobre el presidente ruso, Vladimir Putin, e intentando vincularlo en un anuncio digital reciente con el representante republicano Madison Cawthorn, un figura polarizadora en la poltica de Carolina del Norte.",
    "Kemp, quien obtuvo importantes victorias conservadoras en la legislacin que restringe el aborto y legaliza que la mayora de los georgianos porten un arma de fuego oculta sin licencia, ha sido respaldado por grupos como la Asociacin de Gobernadores Republicanos, que emiti anuncios que lo promocionaban como un \"lder conservador comprobado\".",
    "24 de mayo: Trump intenta vengar su derrota en Georgia\nLa derrota de Trump en Georgia ha impulsado su participacin en el estado, especficamente su celo por derrocar a Kemp y al secretario de Estado, Brad Raffensperger, quien rechaz la solicitud de Trump de que \"encontrara\" ms de 11.000 votos para anular la victoria de Biden en el estado.",
    "El exrepresentante Jim Renacci, quien perdi ante el senador demcrata Sherrod Brown en la carrera por el Senado de 2018, y el agricultor Joe Blystone, quien ha criticado los mandatos de mascarillas y vacunacin contra el covid, as como lo que considera una extralimitacin del Gobierno de DeWine, parecen estar fragmentndose.",
    "Uno de los anuncios recientes de McCormick argumenta que el expresidente respald a la persona equivocada al respaldar a un mdico famoso que elogi a figuras vilipendiadas por los conservadores, incluida la exsecretaria de Estado Hillary Clinton y el Dr. Anthony Fauci, uno de los principales asesores mdicos de Biden.",
    "\"Estas primarias son realmente cruciales porque es la primera prueba que tenemos del respaldo de Trump y ver si algunos candidatos potencialmente ms dbiles a los que l ha respaldado podran terminar como los postulados\", dijo Jessica Taylor, editora del Senado y gobernadores del Cook Political Report con Amy Walter.",
    "Pero Scott Jennings, un estratega republicano y colaborador de CNN, dijo que incluso si el expresidente termina con un historial mixto, es probable que adopte lo que llam la postura tradicional de Trump de que \"de todo lo bueno que sucede, yo soy responsable\" y todo lo malo que sucede \"es culpa de otra persona\".",
    "A medida que toman forma las contiendas de las elecciones generales, Jennings predijo que el enfoque en las obsesiones electorales de Trump en 2020 comenzar a desvanecerse a medida que conectarse con las preocupaciones econmicas de los votantes se convierta en el objetivo primordial del Partido Republicano.",
    "\"Defiendo a las personas cuando s que son buenas; l es un buen hombre\", dijo Trump, siguiendo su antiguo patrn de desestimar las acusaciones de acoso y agresin sexual, incluidas las que se presentaron en su contra en su campaa de 2016 cuando dijo eran \"todas cosas falsas\" y afirmaba que l era \"una vctima\".",
    "Su anuncio promocionaba tanto a Perdue, la eleccin de Trump para gobernador, como a la exestrella de la NFL Herschel Walker, quien cuenta con el respaldo tanto de Trump como del lder republicano en el Senado, Mitch McConnell, para que el Partido Republicano se enfrente al senador demcrata Raphael Warnock.",
    "Antes de que Trump interviniera en la contienda, Mandel, que sirvi en la Reserva del Cuerpo de Marines, y Mike Gibbons, un rico hombre de negocios autofinanciado, parecan estar listos para liderar el campo: su propia rivalidad se volvi tan acalorada que aparecieron al borde de los golpes en un debate.",
    "A pesar de esos ataques, Fetterman le dijo a CNN que no ve la necesidad de moderar sus posturas, que incluyen abogar por ms control de armas, acceso al aborto y atencin mdica universal, especialmente en un momento en que los republicanos en el Congreso no han mostrado inters en comprometerse.",
    "Pero incluso despus de que Trump apoy a Vance, describindolo como \"un guerrero\" contra lo que el expresidente llama falsamente \"eleccin presidencial manipulada y robada\", varios de los rivales republicanos de Vance han clamado para demostrar que estn ms alineados con los valores de Trump.",
    "Si bien el expresidente estaba dispuesto a mirar ms all de las crticas pasadas de Vance, el brazo poltico del Club for Growth est utilizando esas declaraciones como un arma en su intento de impulsar al extesorero estatal Josh Mandel, a pesar de que esos movimientos han enojado a Trump.",
    "El impulso por complacer a Trump y a su base ha contribuido a la atraccin gravitatoria de los candidatos primarios republicanos de derecha, una vulnerabilidad que los demcratas planean capitalizar este otoo mientras buscan retener a los votantes suburbanos y moderados que Trump alien.",
    "Lamb, un centrista que ha argumentado que sus victorias pasadas en distritos de tendencia republicana demuestran su capacidad para ganar en todo el estado, ha dicho que el perfil ms progresista de Fetterman lo convertira en un riesgo demasiado grande en las elecciones generales.",
    "El gobernador republicano, Pete Ricketts, que haba instado a Trump a mantenerse al margen de la contienda, respald a uno de los rivales republicanos de Herbster, Jim Pillen, criador de cerdos y veterinario que forma parte de la Junta de Regentes de la Universidad de Nebraska.",
    "El rcord de respaldo de Donald Trump\nMuchos de los republicanos que se postulan en las primarias de mayo se han presentado como candidatos de Trump, pero las contiendas de este mes sern la primera prueba de si las apuestas de respaldo de Trump dan sus frutos con victorias.",
    "(CNN) -- La capacidad del expresidente de Estados Unidos Donald Trump para elegir a los candidatos ganadores se pondr a prueba a medida que el calendario de las primarias se ponga en marcha este mes con una serie de contiendas polmicas que comenzarn este martes en Ohio.",
    "El candidato de Trump, el famoso cirujano Mehmet Oz, est en una acalorada carrera contra, entre otros, David McCormick, exdirector ejecutivo de fondos de cobertura, que ha criticado a Oz por las inconsistencias ideolgicas que mostr a lo largo de su carrera televisiva.",
    "Y el ndice de aprobacin del presidente Joe Biden se registr en un 41% en el ltimo promedio de encuestas nacionales recientes de CNN, una situacin que histricamente ha llevado a grandes prdidas en la Cmara de Representantes para el partido en la Casa Blanca.",
    "10 de mayo: Un controvertido respaldo de Trump en Nebraska\nTrump tiene un historial de respaldo a candidatos problemticos que han causado dolores de cabeza a su partido, una dinmica en juego en las primarias para gobernador de Nebraska el 10 de mayo.",
    "Mandel ha hecho repetidamente la afirmacin falsa de que a Trump le robaron las elecciones de 2020 y dijo a los periodistas el viernes que \"deberamos auditar [los resultados electorales de] todos los estados de la nacin, incluidos los que gan Trump\".",
    "En campaa con Mandel en Ohio este fin de semana, Cruz se burl de los candidatos que \"tienen a Donald Trump tatuado en el trasero\" y dijo que los votantes deberan considerar la consistencia de los registros de los candidatos como conservadores.",
    "El enfoque ms restrictivo que DeWine adopt para las precauciones de covid-19, en comparacin con otros gobernadores republicanos, provoc que algunos conservadores y Trump criticaran a DeWine en un mitin reciente en el estado como \"terrible\".",
    "Mostrando una inclinacin por la teatralidad al estilo Trump, McGeachin capt brevemente la atencin nacional el ao pasado al usar la ausencia de Little del estado para emitir una orden ejecutiva que prohbe los mandatos de uso de mascarillas.",
    "3 de mayo: acaloradas primarias para el Senado de Ohio\nEl representante demcrata Tim Ryan ha consolidado en gran medida el apoyo de su partido detrs de su bsqueda de la postulacin para ocupar el puesto del senador republicano Rob Portman.",
    "en Virginia Occidental, la semana siguiente, cuando el candidato respaldado por Trump, el representante Alex Mooney, se enfrentar al representante republicano, David McKinley, en la primera primaria titular contra titular del ciclo.",
    "En todo el pas, Trump tambin intervino en la lucha interna del partido del 17 de mayo en la contienda por la gobernacin de Idaho, respaldando a la vicegobernadora, Janice McGeachin, en su principal desafo al gobernador Brad Little.",
    "McCormick contrat a una lista de exasesores de Trump y busc agresivamente su respaldo, prodigando elogios a las polticas de la era Trump, ya que l y sus aliados han retratado a Oz como un RINO, o \"republicano solo de nombre\".",
    "Dos de los rivales de Brooks para reemplazar al senador republicano por retirarse Richard Shelby, la exasistente de Shelby Katie Britt y Mike Durant, un veterano y ejecutivo aeroespacial, han liderado el campo republicano.",
    "Y en una muestra notable de la esclavitud que ejerce sobre su partido, la mayora de los candidatos republicanos dijeron en un debate reciente que era demasiado pronto para que su partido superara las elecciones de 2020.",
    "Un anuncio de Club for Growth Action en la ltima semana mostraba un clip antiguo de Vance refirindose a s mismo como un \"chico que nunca estar con Trump\" mientras un espectador incrdulo pregunta: \"Trump ha visto esto?\"",
    "Los esfuerzos del exsenador para animar a los leales a Trump argumentando que Kemp podra haber hecho ms para cuestionar los resultados de las elecciones hasta el momento no han demostrado ser una estrategia ganadora.",
    "McKinley vot para certificar la victoria de Biden y respald la formacin de una comisin independiente para investigar el ataque del 6 de enero de 2021 contra el Capitolio de EE.UU., un esfuerzo fallido en el Senado.",
    "Kemp seal en un debate, a fines de abril, que no \"ser sermoneado por alguien que perdi sus ltimas elecciones\", refirindose a la derrota de Perdue ante el demcrata Jon Ossoff, en la segunda vuelta de enero de 2021.",
    "La oportunidad de Trump en las elecciones intermedias\nLos votantes estn luchando con el aumento de los precios de la gasolina y los comestibles ya que las presiones inflacionarias no muestran signos de disminuir.",
    "En la carrera por la gobernacin, el titular Mike DeWine lidera a sus oponentes en las primarias republicanas, segn encuestas recientes, a pesar de que ha sido un blanco frecuente del ala pro-Trump de su partido.",
    "Georgia se convirti en el primer estado donde el programa del Comit de Accin Poltica Make America Great Again, Again!, afiliado a Trump, extendi sus esfuerzos a las ondas de radio, segn datos de AdImpact.",
    "Pero despejar el campo y navegar hacia una posible candidatura a la Casa Blanca en 2024 depender en parte de su capacidad para demostrar que sigue siendo el lder inigualable del Partido Republicano.",
    "La contienda por el Senado del Partido Republicano de Ohio es un excelente ejemplo de cmo la genuflexin ante el expresidente est impulsando el debate en muchas primarias republicanas en todo el pas.",
    "El presidente atrajo al exsenador David Perdue a la carrera contra el gobernador en ejercicio, lo que gener una reyerta interna del partido que muchos en el Partido Republicano consideraron intil.",
    "Si bien el compromiso de Trump con Walker ayud a mantener a otros importantes republicanos fuera de la carrera por el Senado, no est claro que su respaldo a Perdue haya tenido el efecto deseado.",
    "El respaldo de Trump hace casi un ao no logr despejar el campo para Budd, quien ha sido impulsado por el Club for Growth Action que publica anuncios que critican al exgobernador Pat McCrory.",
    "Eso ha significado que la mayor parte del drama ha sido en las concurridas primarias republicanas para el Senado, centrndose en los ltimos das en si Vance mereca el visto bueno de Trump.",
    "Todos estos candidatos, independientemente de si obtuvieron el respaldo de Trump o no, estn tratando febrilmente de convertirse en el molde de Make America Great Agrain\" agreg Taylor.",
    "Trump puso patas arriba lo que ya era una carrera al revs al respaldar a JD Vance, el autor de \"Hillbilly Elegy\" y antiguo crtico de Trump, quien desde entonces se ha retractado.",
    "Como Oz y McCormick y sus aliados externos han invertido sus recursos en anuncios de televisin, la carrera super la marca de los 100 millones de dlares a fines de abril.",
    "Los demcratas tienen una carrera competitiva propia entre el vicegobernador John Fetterman, el representante Conor Lamb y el representante estatal Malcolm Kenyatta.",
    "Mooney se gan el cario de Trump al objetar el recuento electoral de Pensilvania cuando el Congreso certificaba la victoria de Joe Biden en las elecciones generales.",
    "\"Mi opinin personal es que si no ests hablando de la inflacin y los precios de la gasolina, la economa, el crimen y las escuelas en el otoo, eres un idiota\", dijo.",
    "Finalmente, el 24 de mayo, Trump tendr la oportunidad de vengar al gobernador republicano de Georgia, Brian Kemp, por rechazar sus esquemas electorales de 2020.",
    "La mayora de los candidatos republicanos de este mes han intentado apelar a Trump durante sus campaas, lo que ya es una victoria para el expresidente.",
    "Como exsecretario de Estado, ha refutado los ataques de Perdue argumentando que no tena la autoridad para alterar los resultados de las elecciones.",
    "Cheri Beasley, la primera mujer negra en encabezar la Corte Suprema de Carolina del Norte como presidenta, es muy favorecida por el lado demcrata.",
    "Pero se est apoyando en otras figuras conservadoras para que lo ayuden a llevar su campaa hasta la meta, incluido el senador de Texas Ted Cruz.",
    "Fetterman se ha convertido en el candidato a vencer en virtud de su recaudacin de fondos y el reconocimiento de su nombre en todo el estado.",
    "(Vance se ha esforzado por abordar su conversin en la campaa electoral, pidiendo a los votantes que le den crdito por admitir un error).",
    "En un mitin a favor de Herbster, el domingo por la noche, Trump afirm que Herbster estaba siendo \"gravemente calumniado\".",
    "Trump ha respaldado a la representante republicana Jody Hice, quien abraz sus conspiraciones electorales, en su contra.",
    "En octubre, Little acus a McGeachin de intentar desplegar la Guardia Nacional estatal en la frontera entre EE.UU.",
    "Ricketts describi las acusaciones como \"ms que horribles\" y dijo que Herbster debera \"buscar tratamiento\".",
    "\"Es obvio lo que preocupa a la gente... Hacer de la carrera un referndum sobre Biden sobre esos temas\".",
    "Uno de los enfrentamientos senatoriales ms caros de este ao tendr lugar en Pensilvania el 17 de mayo.",
    "La lealtad a Trump jugar un papel importante en una carrera por la Cmara de Representantes de EE.UU.",
    "En seis casos, al menos un testigo corrobor las acusaciones de las mujeres, inform la publicacin.",
    "A pesar del \"respaldo completo y total\" de Trump, McGeachin no parece haber ganado mucha fuerza.",
    "Esa ha sido una dinmica comn a lo largo de muchas de las elecciones primarias de este mes.",
    "Est previsto que Trump aparezca en nombre de Oz en un mitin el prximo fin de semana.",
    "Hay nuevos indicios de que la economa podra encaminarse hacia una recesin.",
    "(Poco ms tarde, derog la orden, calificndola de \"truco poltico egosta\").",
    "Herbster ha negado las acusaciones, calificndolas de \"100% falsas\".",
    "y afirma que el expresidente \"se est equivocando\" con su respaldo.",
    "La mayor parte del gasto est del lado del Partido Republicano.",
    "y Mxico mientras estaba en el estado visitando la frontera.",
    "Pero Trump no ha respaldado en la carrera.",
    "\"l es quien conduce la narrativa.",
    "De esa manera, ya gan."
  ]
}