{
  "id": 7639,
  "mediaId": 558,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Herschel Walker, other candidates test skipping debates",
  "image": "https://s.yimg.com/uu/api/res/1.2/VnmoLW_QIcPNrIl6Y4C.Qw--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-05/43e68ab0-ca41-11ec-b17f-e164c55659cc",
  "link": "https://news.yahoo.com/candidates-test-skipping-debates-without-040750804.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "SUDHIN THANAWALA",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "But some of the Republicans who are still engaging in the process say that skipping debates could ultimately leave the eventual nominees vulnerable in a general election, unprepared to answer tough questions or engage with rivals in a way that could appeal to voters beyond the party base.",
    "As the most competitive phase of the midterm primary season unfolds this week, many candidates for leading offices  often Republicans  are abandoning the time-honored tradition of debating their rivals before Election Day.",
    "For others, it's an opportunity to snub a media ecosystem they find elitist and cast themselves in the mold of former President Donald Trump, who made a show of missing some debates during the 2016 campaign.",
    "But after facing criticism from rivals at the first Georgia Republican Senate debate in April, including about his absence, Walker told north Georgia radio station WDUN-AM that his opponents were jealous.",
    "Officers responding to a 2001 report that Walker was armed and scaring his estranged wife at a suburban Dallas home later noted that Walker according to a police report revealed by the AP in February.",
    "The Republican National Committee is already moving toward withdrawing from the 2024 presidential debates, though the ultimate decision will likely fall on whoever emerges as the party's nominee.",
    "ATLANTA (AP)  Herschel Walker is expected to skip a second debate against his Republican rivals for a crucial U.S. Senate seat on Tuesday after missing the first one.",
    "asked Latham Saddler, a Navy veteran and former Trump administration official who is among five Republicans challenging Walker, referring to the Democratic incumbent.",
    "If you cant get on the stage and debate fellow Republicans, how the heck are you going to debate with Raphael Warnock in the general election?\"",
    "GOP candidates for governor in Ohio, Nevada and Nebraska also have refused to engage with their opponents from the debate podium.",
    "For some gaffe-prone candidates such as Walker, avoiding the debate stage reduces the chance of an embarrassing moment.",
    "His campaign has not granted The Associated Press an interview despite repeated requests, including for this story.",
    "In a protective order sought by his then-ex-wife in 2005, Walker was accused of repeatedly threatening her life.",
    "Ted Budd has skipped four Republican primary debates in his bid for a U.S. Senate seat in North Carolina.",
    "Usually if youre hiding, youre hiding for a reason, Saddler said in an interview.",
    "Walker holds a commanding lead over his rivals heading into the May 24 primary.",
    "Still, limiting questioning and access may help avoid discussions about his ."
  ]
}