{
  "id": 7645,
  "mediaId": 33,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Trump defends Nebraska gubernatorial candidate facing groping allegations",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220501211142-donald-trump-0501-exlarge-169.jpg",
  "link": "https://www.cnn.com/2022/05/01/politics/trump-defends-herbster-sexual-misconduct-claims/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabby Orr and Paul LeBlanc",
  "authorUrl": "",
  "termIds": [
    815,
    1147,
    2137,
    2672,
    2799,
    2816,
    4998
  ],
  "sentences": [
    "Washington (CNN)Former President Donald Trump defended Nebraska gubernatorial candidate Charles Herbster at a rally on Sunday, dismissing recent sexual misconduct allegations against him as \"malicious\" and saying they were the main motivation for his decision to hold an event in the Cornhusker State ahead of the GOP primary later this month.",
    "The full-throated defense came just days after the Nebraska Examiner reported that seven women, including Republican state Sen. Julie Slama, had accused Herbster of groping them at political events or beauty pageants, with an additional woman accusing him of kissing her forcibly.",
    "He filed a lawsuit Friday against Slama -- who says that Herbster reached up her skirt during a Republican fundraising dinner in 2019 -- and claimed to have suffered \"grievous harm to his reputation\" from her accusation.",
    "Candidates backed by the former President are facing competitive primaries for House, Senate and governor's races in May in several states, including Ohio, West Virginia, North Carolina, Pennsylvania and Georgia.",
    "That's why I came out here,\" Trump, who has faced more than a dozen sexual misconduct allegations and denied them, said of Herbster during his remarks in Greenwood.",
    "Walker has spoken of his struggles with mental illness, and his campaign has noted that he has gotten help since the allegedly violent incidents in the early 2000s.",
    "The rally, which was rescheduled following tornado warnings on Friday night, featured several speeches from Trump-aligned figures and other GOP candidates.",
    "Former football star Herschel Walker, who is running for Senate in Georgia, has been accused of threatening multiple women over the course of a decade.",
    "Malicious charges to derail him long enough that the election can go by before the proper defense can be put forward,\" the former President said.",
    "Trump's speech Sunday lasted nearly two hours, and saw him return to a number of familiar topics including false claims about the 2020 election.",
    "The former President was also joined by informal advisers David Bossie and Matt Schlapp, and US Rep. Billy Long, a Senate hopeful in Missouri.",
    "In Ohio, House hopeful Max Miller is facing allegations of abuse from an ex-girlfriend, former White House press secretary Stephanie Grisham.",
    "The May 10 gubernatorial primary in Nebraska is one of several upcoming tests for the influence of Trump's endorsement in GOP primaries.",
    "Trump on Sunday claimed to have met several friends of Herbster who defended him before the former President took the stage.",
    "And Trump had endorsed Sean Parnell for Senate in Pennsylvania before the candidate dropped out of the race in late 2021.",
    "Parnell had lost a custody fight with his estranged wife, who had accused him of committing abusive acts against her.",
    "Herbster is not the first Trump-supported candidate this cycle to face allegations of mistreatment of women.",
    "In six cases, at least one eyewitness corroborated the women's allegations, the publication reported.",
    "And he's innocent of these despicable charges,\" Trump added, without citing any evidence.",
    "Miller has denied the allegations and has filed a defamation suit against Grisham.",
    "\"Charles W. Herbster will never bend to the RINOs, the media, or the radical left.",
    "And let's see what happens,\" Trump said of the candidates he's endorsed.",
    "He has denied allegations of threats made in at least two cases.",
    "Herbster has denied the allegations, calling them \"100% false.\"",
    "\"It would have been easy for me to say, 'I'm not gonna come.'",
    "That's why they're doing everything they can to stop him.",
    "CNN's Michael Warren contributed to this report.",
    "I defend my people when I know they're good.\"",
    "\"I could've gotten out of this one real easy.",
    "\"He's been badly maligned and it's a shame.",
    "\"But he's already got the proper defense.",
    "He doesn't even know about this stuff.",
    "Parnell has denied the allegations.",
    "I could have gone to the beach.",
    "And I'm here with Charles W.",
    "That's the proper defense.",
    "I could have played golf.",
    "\"They're all doing good.",
    "They're all doing good.",
    "Charles is a fine man.",
    "Herbster.\""
  ]
}