{
  "id": 7646,
  "mediaId": 25,
  "date": "d2022-05-01T00:00",
  "headline": "Full transcript of \"Face the Nation\" on May 1, 2022",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/05/01/d6cb90de-c3ea-431c-8b7f-a9683350f6ab/thumbnail/140x90g2/6ecb870ff99243bd7359a0d6362a8e02/kinzinger1.jpg",
  "link": "https://www.cbsnews.com/news/face-the-nation-full-transcript-05-01-2022/",
  "sentiment": "0.0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1335,
    2017,
    2214,
    4116,
    4899,
    5616,
    2707,
    2779,
    2942
  ],
  "sentences": [
    "SENATOR TIM KAINE: ... DHS laid out a pretty -- DHS laid out a pretty comprehensive plan last week with six pillars, flooding personnel to the border, which they're doing already, preparing for use of expedited removals for individuals who can't make a credible claim for asylum, for example, more work in Central America to help their economies grow, so that the push of poor economic conditions leading to migration will abate.",
    "On this \"Face the Nation\" broadcast moderated by Margaret Brennan:\nSen. Tim Kaine, Democrat of Virginia\nSamantha Power, administrator of the U.S. Agency for International Development\nRep. Adam Kinzinger, Republican of Illinois\nDr. Paul Burton, chief medical officer of Moderna\nDr. Deborah Birx, former White House coronavirus response coordinator\nClick here to browse full transcripts of \"Face the Nation.\"",
    "MARGARET BRENNAN: So, I guess the fundamental question here is, when we talk about that benchmark of 50 percent, is -- is putting a vaccine in the -- in the smallest of children who don't have any protection, right, they're too young to even wear a mask, many of them, is just getting some protection worth it, or does it need to meet that standard 50 percent benchmark the FDA says?",
    "So we have folks who are, in a sense, indirectly on the ground, but who are receiving U.S. taxpayer resources in order to provide everything from flak jackets and helmets, again, to those safe houses or the kind of training that journalists maybe had not had before about how to work in war zones or work to gather evidence of war crimes or other atrocities.",
    "But if the Russians keep up with these steamroller tactics of using artillery just to level everything in front of them, and then advancing a few kilometers and doing it all over again, the fact that the Russians aren't able to produce a victory for Putin by May 9 is going to be small consolation for the people in the path of that steamroller.",
    "MARGARET BRENNAN: And we know U.S. diplomats this week were sharing information about the strategy diplomatically or politically, to go along with the battlefield, of breaking off some of these pieces of territory, holding what the U.S. called sham elections, actually physically moving people out of areas that they decided were key.",
    "Trending News\n Transcript: Rep. Adam Kinzinger on \"Face the Nation\"\n Birx: U.S. should prepare for summer COVID surge in South\n Transcript: Dr. Deborah Birx on \"Face the Nation\"\n Kinzinger says he \"would love\" for Pence to testify before January 6 committee\n Samantha Power urges Congress to address \"desperate need\" for Ukraine aid",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: It's been more than a year since we last spoke with Dr. Deborah Birx, the White House Coronavirus Task Force coordinator during the Trump administration, and she told us about her time in the administration, spoke candidly about mistakes that had been made, especially with the CDC.",
    "And I think right now what we're doing with suppling, with (INAUDIBLE), with the financing is right, but there may be a point that we have to recognize, you know, look, this is -- world war -- prior to World War II, there were moments nobody ever wanted to get involved and eventually came to realize they had to.",
    "What I will say is that USAID is working inside Ukraine to help civil society activists, human rights activists who have received death threats or who are vulnerable to relocate, whether to safe houses or to neighboring countries, in order to ensure that they are not subjected to this level of persecution.",
    "And so people are interpreting that the fact that they are vaccinated, or vaccinated and boosted, that they cannot be infected, that they're somehow invincible and they're carrying that virus into hospital rooms, into nursing homes, and into dining room tables where their vulnerable family members sit.",
    "It's important for us to lay the whole story out in front of the American people from both what led to January 6th, the lies after the election, the fundraising, the 187 minutes the president basically sat in the Oval Office and everything since, including the response by DOD.",
    "And, again, it is going to be incumbent on those organizations that are working inside Russia to press the Russian Federation, just as we do through our sanctions and through our global pressure, to account for anybody who has traveled inside the Russian Federation.",
    "These are decisions I think that we're going to end up making from a tactical perspective in the next, you know, week or two as we basically pin down what this hearing schedule is going to look like, the content, and as we go into the full narrative of this thing.",
    "So, Margaret, we are confident that by the fall of this year we should have large amounts of that new booster vaccine that will protect against omicron and other variants and really protect Americans and people around the world as we go into the fall of 2022.",
    "You know, the Department of Justice will make decisions based on information, but the American people are going to be the ones that have to take the work we've done and decide what they want to do with it or what they want to believe after that.",
    "We've requested information from various members in terms of whether we move forward with a subpoena is going to be both a strategic, tactical decision and a question of whether or not, you know, we can do that and get the information in time.",
    "What has happened each time is we've had a summer surge across the south and a winter surge that cross -- that starts in our northern plains and moves down, accelerated by Thanksgiving and the holidays of Christmas, Kwanzaa and Hanukkah.",
    "I mean she assaulted, I think, a survivor's family from a school shooting at some point in D.C. She stood outside a congresswoman's office and yelled at her through a mail slot and said she was too scared to come out and confront her.",
    "We are super eager to get back into Ukraine to be able to see that work up close and to be in a position again to channel, for example, the new supplemental funding we hope will be coming to those partners who urgently need it.",
    "And I think the Russians would be very leery of putting ships in closer to make an amphibious assault on Odessa, simply because that's how they lost their flagship, the Moskva, when it was hit by a Ukrainian anti-ship missile.",
    "But there are vast swathes of Ukraine that have been newly liberated by Ukrainian forces where there is desperate need, everything from demining, to trauma kits, to food assistance, since markets are not back up and running.",
    "DEBORAH BIRX: Well, if you wait until hospitalizations, there is so much community spread that you cannot prevent it from getting into the nursing homes, into venerable family members, because we interact with each other.",
    "MARGARET BRENNAN: Your Democratic colleague Senator Coons was on this program a few weeks ago, and he said there at least needs to be a conversation about when the United States would use force potentially in Ukraine.",
    "So what I think we can reassure parents, and caregivers here, is that if approved, this vaccine should be able to safely and effectively protect your kids, your youngest kids, against severe disease, hospitalization.",
    "I just introduced an AUMF, an Authorization for the Use of Military Force, giving the president basically congressional leverage or permission to use it if WMDs, nuclear, biological or chemical are used in Ukraine.",
    "So, if you're going to go see your grandmother or someone that has metastatic breast cancer, or someone under treatment for Hodgkin's Disease or a family member with down syndrome, you need to test before you go.",
    "We announced a couple of weeks ago a new variant-specific booster that we've been tested, and we have an additional candidate, our lead candidate, in testing now that I believe is going to be even more superior.",
    "So, I completely masked last night because my assessment was there were probably, just by odds and science, probably 15 to 20 people infected, even though everyone was tested in the morning or within 24 hours.",
    "MARGARET BRENNAN: You mentioned safety, and I'm glad you bring that up because I know your application for the vaccine, for that age group, 6-11, 12-17, that's been pending before the FDA since June of 2021.",
    "So we're sort of turning our previous programming, which was very extensive all across Ukraine, into programming that is suited for this moment through our Ukrainian partners who are working inside Ukraine.",
    "And our focus is on playing in some of those primaries to bring at least reasonable people to the forefront and encouraging folks that are going to live, for instance, in a guaranteed Republican district.",
    "And the ICRC and other international organizations are gathering lists of those people who families are alleging to be missing, to have gone now without cell phone contact, in some cases, for many weeks.",
    "So, for Democrats, when you try to push this through, can there be a commitment to just having this be a stand-alone aid package to Ukraine, or does it have to be paired with things like COVID funding?",
    "And today on Face the Nation: a powerful show of support for Ukraine from top congressional Democrats, as the Biden administration pushes for tens of billions more in aid for that war-torn country.",
    "MARGARET BRENNAN: ... and the potential expiration that's slated for the end of May of Title 42, which is pandemic regulation that allows for asylum-seeking migrants to be denied immediate entry.",
    "The chairman for the committee investigating the January 6th attack on the U.S. Capitol announced a series of public hearings will be held in June, with the very first one scheduled for the 9th.",
    "It's not my job to talk about the security assistance that has been provided, but that has been the means by which the Ukrainians have been able to fight back and hang on as long as they have.",
    "And we are, of course, approved for over -- over six-year-olds in many other countries around the world where it's being used safely and effectively to provide protection for those young kids.",
    "So, what it means for parents, for caregivers, is that if they give the Moderna vaccine to these little kids, they would basically cut in half the risk of that child getting symptomatic Covid.",
    "And it includes very significant direct budget support for the government of Ukraine, because what we want to ensure is that that government can continue providing services for its people.",
    "And it's also flowing to third countries that are feeling these huge cascading effects of Putin's war, like the spiraling food prices, like the lower supplies of fertilizer, wheat, grain.",
    "If there were to be an invasion of a NATO country, a kinetic or even a cyberattack, or if there were to be use of chemical or nuclear weapons in Ukraine, that would change the equation.",
    "I can tell you today, if your grandmother has no antibody, don't pretend -- don't think that there are cellular or there are other side of their immune system is going to protect them.",
    "MARGARET BRENNAN: You know, we keep hearing from the committee, including the chairman, that there will be members of Congress requested to come and speak and answer your questions.",
    "MARGARET BRENNAN: The U.S. ambassador to the OSCE, Michael Carpenter, said this week Russia is going to intensify those forced transfers of people into so-called filtration camps.",
    "PAUL BURTON: When we look at the U.K. data that was released just last week, when we looked at symptomatic disease, exactly there we see vaccine effectiveness of about 50 percent.",
    "But, remember, Margaret, in the -- in the aid package that we put in a month or so ago, it was about $6.8 billion for military aid and an equivalent amount for humanitarian aid.",
    "The battalion commander said they have yet to receive any of America's promised heavy weapons, showing us-supplied Browning .50-caliber machine gun that jams every two rounds.",
    "The Ukrainian Defense Ministry said there's evidence that the Russian military is building up troops and weaponry in order to step up the assault on this region -- Margaret.",
    "Now, typically, what we then do is to package the data electronically, supply to it the FDA so, of course, they can conduct their own views, their own analysis of the data.",
    "To be frank, that's why I wrote the book because I felt like people weren't understanding what the issues were on the ground that were resulting in Americans not surviving.",
    "So why do you feel comfortable putting your vaccine in my three-year-old or someone's four-year-old if the FDA hasn't approved it to be put in the body of a 12- year-old?",
    "She and six other Democrats made a surprise visit to the region to show support and discuss the president's proposed additional $33 billion U.S. aid package to Ukraine.",
    "DEBORAH BIRX: I have to judge it every day because, like you, I have children under five, unvaccinated grandchildren, and I have a 93-year-old that lives in our house.",
    "MARGARET BRENNAN: And for adults, when do you expect a rebooted version of the vaccine to be available, a booster shot that would work against omicron, for example.",
    "MARGARET BRENNAN: But you've also been somewhat critical of the Biden administration's plan to allow for that border health restriction to expire at the end of May.",
    "Now, the number, 50 percent, I know is often lower than we are used to seeing with our vaccine, but it's because this study was conducted during a time of omicron.",
    "I think from the antibody levels that we also saw in this study, we can expect high protection against the important thing, which is hospitalization, even death.",
    "We have exerted all kinds of diplomatic pressure vis-a-vis countries that have retained influence with Putin, everything from Turkey to Israel to India to China.",
    "This is, on the calendar, at least, supposed to be a key week driving towards May 9, a holiday in Russia that Vladimir Putin apparently puts a lot of weight on.",
    "But I think there's a shared sense that, first, if Russia were to take action against any NATO's ally, Article 5 of NATO's would mandate a military response.",
    "It entails both humanitarian assistance, $3 billion of humanitarian assistance, to meet those global needs, which are famine-level, acute malnutrition needs.",
    "The U.S. is basically giving the Ukrainians everything they have on Ukrainian troop movements -- excuse me -- Russian troop movements, Russian battle plans.",
    "And if you look at a map of Ukraine before the war started and the front lines today, Russia has seized a lot of territory in Southern and Eastern Ukraine.",
    "But let me just say this, for Marjorie Taylor Greene to say she's a victim, it's amazing how, you know, folks like her attack everybody for being a victim.",
    "MARGARET BRENNAN: A lawyer for Congresswoman Marjorie Taylor Greene said this week she was not a participant in the January 6th violence, she was a victim.",
    "But, again, reassuringly, when we look at the rates of very high fever, a fever over 104 Fahrenheit, only 0.2 percent of these little kids experience that.",
    "So, first of all, on safety -- and we can talk about that -- the safety profile we see with this vaccine, in these very youngest kids, was very reassuring.",
    "MARGARET BRENNAN: OK.\nOne of the issues when it comes to COVID aid, as you know -- this has gotten fairly tangled, but what may happen at the U.S. border.",
    "I am a strong believer, whether I'm in the majority or minority, that there ought to be amendments and we ought to allow votes on amendments on the floor.",
    "There was a time, Margaret, that we --\nMARGARET BRENNAN: So do you expect the FDA to approve it for those older age groups, is that what you're saying?",
    "Then we went into that lull of May, where everybody thought it was over, and in middle of June, and then we had the predictable surge across the south.",
    "And then when Marjorie Taylor Greene is confronted, she's all of a sudden a victim and a poor, helpless congresswoman that's just trying to do her job.",
    "We should be preparing right now for a potential surge in the summer across the southern United States because we saw it in 2020 and we saw it in 2021.",
    "We awoke this morning to a stunning sight, House Speaker Nancy Pelosi being greeted by Ukrainian President Volodymyr Zelenskyy in the streets of Kyiv.",
    "SENATOR TIM KAINE: It's an emergency regulation, and it needs to be replaced by more permanent procedures and plans to do a better job at the border.",
    "That tells me that natural immunity wanes enough in the general population after four to six months that a significant surge is going to occur again.",
    "And we have received word this morning from the International Committee of the Red Cross that those evacuations are indeed taking place in Mariupol.",
    "The Ukrainian government said the Russians have suffered heavy losses for modest gains, yet the intensity of the fight has only worsened by the day.",
    "And Putin wants nothing more, of course, than to strengthen his bargaining hand here, as he exerts military pressure and financial pressure at once.",
    "MARGARET BRENNAN: Well, that 50 percent benchmark set by the FDA is key because that's usually, you know, the floor they have for -- for approval.",
    "I worry a little bit that sometimes majority parties, Democrat or Republican, slow-walk legislation to try to avoid controversial amendment votes.",
    "If somebody starts falling behind in the polls, he always finds a reason to un-endorse them because he doesn't like having a losing track record.",
    "So, look, even the spike vax, which we have now, the Moderna vaccine, does provide protection certainly against severe disease, hospitalization.",
    "Then: The committee investigating the January 6 attack on the Capitol is preparing for what they hope to be critical public hearings next month.",
    "It's part of a wider campaign for Russians trying to stop U.S. and Western weapons from reaching Ukrainian forces fighting on these front lines.",
    "According to the Moderna release, the vaccine is 37 percent effective in kids two to five, roughly 50 percent in those six months to two years.",
    "So I think we'll have a COVID aid package vote soon, in May, and I think the Republicans will ask for a Title 42 amendment vote as part of it.",
    "(End VT)\nMARGARET BRENNAN: And we begin today with CBS News foreign correspondent Charlie D'Agata, who has the latest from Eastern Ukraine.",
    "If those hand-picked candidates end up winning, is this a sign that indeed Donald Trump is still the leader and kingmaker within the party?",
    "And Putin doesn't care and is defying the will of the world to allow civilians to be evacuated, to allow food and medicine to get in there.",
    "MARGARET BRENNAN: We know the last holdout by Ukrainian forces in that southeastern city of Mariupol has been under constant bombardment.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: We're joined now by the administrator of the U.S. Agency for International Development, Samantha Power.",
    "Putin would like nothing more than the government of Ukraine to go bankrupt and not be able actually to cater to the needs of the people.",
    "MARGARET BRENNAN: We have seen a lot of images of the weapons going into Ukraine, not just from the U.S. now, from the U.K., from Poland.",
    "So, we're already spending some of that money, but the burn rate is very, very high as prices spiral inside Ukraine and outside Ukraine.",
    "ADMINISTRATOR SAMANTHA POWER: What we do, Margaret, in circumstances like this especially is, we work through our implementing partners.",
    "And so if you look at what we've been through, we went through a mini alpha variant surge in the same locations last year at this time.",
    "I would hope and think that the vice president would want to come in and tell his story because he did do the right thing on that day.",
    "But I think the key is, regardless of even what some members of Congress are going to tell us, we know a lot of information around it.",
    "Every American needs to be able to click on a website that shows them what is happening in their community with test positivity cases.",
    "This is what's left of an industrial site destroyed by the Russians after learning it was being used as a base by Ukrainian forces.",
    "MARGARET BRENNAN: Well, we woke up to those images of Speaker Pelosi and top congressional Democrats walking around downtown Kyiv.",
    "We've also just submitted our application for that six to 12-year-olds as well and now we have the data on the very youngest kids.",
    "The vaccine effectiveness against symptomatic disease, symptomatic Covid disease, about 10 weeks after the second dose of vaccine.",
    "MARGARET BRENNAN: Senator Kaine was with us, and he said it is too soon to begin talking about potential use of force in Ukraine.",
    "And I think, you know, there's -- that's going to be a big -- this primary season is going to be a big moment to figure that out.",
    "The head of U.S. Agency for International Development Samantha Power and Virginia Democratic Senator Tim Kaine will both be here.",
    "(CROSSTALK)\nSENATOR TIM KAINE: Yes, but he's also said that use of nuclear weapons or chemical weapons could alter the equation.",
    "I think those three big bills, Ukraine aid, COVID aid, and the competitiveness bill, are the three big tasks ahead of us in May.",
    "And it's important for us to be able to put that in front of the American people because, ultimately, they have to be the judge.",
    "SENATOR TIM KAINE: And then probably there will be a need to provide support to those who are really suffering under long COVID.",
    "I know you're not a fan of the former president, but he is, in some ways, playing a very large role in some upcoming primaries.",
    "So, right now, the status quo is, we are providing massive amounts of aid to Ukraine, both the U.S. and NATO allies and others.",
    "(Begin VT)\nREPRESENTATIVE NANCY PELOSI (D-California): We are here to say to you that we are with you until this fight is over.",
    "Ukrainian fighters said around 20 women and children made it out, of the hundreds of civilians who've been trapped for months.",
    "And that would be...\nMARGARET BRENNAN: But why would it be premature if President Biden has already said he won't send troops?",
    "I don't think you can say that yet, but you can certainly say that the Ukrainians are going to have an intelligence advantage.",
    "DEBORAH BIRX, M.D., FORMER WHITE HOUSE CORONAVIRUS RESPONSE COORDINATOR AND AUTHOR, \"SILENT INVASION\": Good morning, Margaret.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: Last week Moderna asked the FDA to authorize its vaccine for children under the age of six.",
    "MARGARET BRENNAN: Well, when that last $13 billion package was passed, Republican Leader Mitch McConnell was on this program.",
    "But I think my -- my colleagues in Congress on both sides, with very few exceptions, they understand how significant this is.",
    "And let's be clear, not every vulnerable family member has an effective immune response either to the vaccine or the booster.",
    "And I think that's what May needs to be about for us, is getting both of these done, together with the competitiveness bill.",
    "If you have vulnerable people in your household, whether it's children or elderly, you have to continually assess your risk.",
    "ADMINISTRATOR SAMANTHA POWER: We're deeply concerned by the Ukrainian reports of what is happening to civilians in the east.",
    "I mean, look, if you -- if you're JD Vance two years ago, you know, you're a totally different JD Vance than you are today.",
    "There were text messages revealed this week in which she was discussing martial law with Mark Meadows, then chief of staff.",
    "I think the FDA now have, you know, all of the core fundamental data they need to be able to begin that application review.",
    "I have a bizarre nerve-tingling sensation that feels like my skin is dipped in an Alka-Seltzer that's just going off 24/7.",
    "(Begin VT)\nCHARLIE D'AGATA (voice-over): From beneath the smoldering ruins of the steel plant in Mariupol, a hint of hope.",
    "JOSHUA CROPPER: I wish that they had more NATO experience, more NATO training, but...\nCHARLIE D'AGATA: More NATO weapons?",
    "MARGARET BRENNAN: And so what you're seeing in South Africa, you do think is a lead indicator of what may be coming here?",
    "DAVID MARTIN: Well, I don't think they're going to get all of the Donbass, which is what he is said he wants, by May 9.",
    "And we ought to see what the amendment is, and then vote it up or down based upon whether it's a good amendment or not.",
    "He said they're abducting, torturing, murdering local leaders, journalists, civil society activists, religious leaders.",
    "ADMINISTRATOR SAMANTHA POWER: Well, first, let me express gratitude to the Congress for the prior supplemental package.",
    "When you say \"reasonable people,\" you don't think reasonable people are voting in the Ohio Republican primary for him?",
    "And the end of big battles, you usually read a history in which intelligence turned out to be decisive in that battle.",
    "And everywhere we have gone, we have found freshly dug defensive positions, fallbacks for retreating Ukrainian forces.",
    "We will have the latest on the military maneuvers and diplomatic efforts in the war that's now entering its 10th week.",
    "If that area is in a surge, and if you assessed your risk, like we did last night, and make sure that you're negative.",
    "DEBORAH BIRX: Well, each of these surges have been a slightly different variant because, yes, our immune system wanes.",
    "In Ohio, in particular, JD Vance he's endorsed, a number of other candidates, Pennsylvania, Herschel Walker, Georgia.",
    "Do you expect this to be more of building a public narrative or will new information come to light in these hearings?",
    "DEBORAH BIRX: You know, I'm thrilled that over the last 12 months people have been giving more and more voice to it.",
    "If he doesn't, then we'll look at the options we have available to us if there's information we don't already have.",
    "You know, you have as many as 40 million people that could be pushed into poverty now just because of Russia's war.",
    "Along the front lines in the east, the fight for the Donbass region has become a battle of artillery and attrition.",
    "But this additional aid is -- is necessary to help Ukraine win and beat Russia's illegal invasion of their country.",
    "And our rural counties, those red counties that people keep talking about, they have lack of adequate health care.",
    "Congress holds the purse strings here, and it took them about three weeks to get the aid passed last time around.",
    "But we need to do more research, spread the results of the research, provide information...\nMARGARET BRENNAN: OK.",
    "In kids, we see data from Hong Kong, the rates of admission of kids to pediatric intensive care units, very high.",
    "We were going to have Title 42 expire on May 23, and then have new asylum and border rules go into place May 31.",
    "SENATOR TIM KAINE: ... that passed the Senate in a bipartisan way that the Republican House refused to take up.",
    "The issue is going to be whether that intelligence gets down to the units that need to act on the intelligence.",
    "ADAM KINZINGER: Well, I -- you know, look, from what I've seen there's one at least maybe reasonable candidate.",
    "I know President Biden has asked for that statement to be backed up with $33 billion of funding from Congress.",
    "There's already been about a billion-dollar effort underway to study it at the National Institutes of Health.",
    "I was just confused with the administration's messaging about this, but...\nMARGARET BRENNAN: Is it clear now?",
    "They have -- I think and the Pentagon thinks that the strikes on Odessa are a -- just a diversionary tactic.",
    "And if, after 28 years in office, I can't explain a vote on something, I'm not very good at what I'm doing.",
    "ADMINISTRATOR SAMANTHA POWER: Well, I don't think that's a fair characterization of what the U.S. has done.",
    "And Republicans have made plain that they want a vote on Title 42 as part of a discussion about COVID aid.",
    "Plus, we will check in with Dr. Deborah Birx, the coronavirus response coordinator under President Trump.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: We will be right back with a lot more Face the Nation, so stay with us.",
    "So are you confident that Moderna will be ready for the FDA to review your vaccine at their June meeting?",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: Next Sunday, we'll be talking with former Attorney General Eric Holder.",
    "But when you look at the data, you're doing a vaccine that's 25 micrograms, as I understand it, in size.",
    "Lower events of safety in this very young age group, even compared to the six-year-olds to 12-year-olds.",
    "Just up the road from us, battle-weary soldiers take a break after nearly two months of heavy fighting.",
    "And, typically, in this age range, for other approved vaccines, we would see rates of maybe 1 percent.",
    "That $33 billion is significantly less than what we would have to spend if we took Russia on directly.",
    "And we have to make it very clear to the American people that your protection against infection wanes.",
    "SENATOR TIM KAINE: Margaret, we'll -- we'll turn to it as soon as we get back to the Senate tomorrow.",
    "The procedure of where you put bills together or separate them is quirky and sometimes unpredictable.",
    "But when we look at vaccine effectiveness against hospitalizations, that number is 89 to 95 percent.",
    "ADAM KINZINGER: And the party has to make the decision if they want to be that kind of party or not.",
    "MARGARET BRENNAN: Vice President Mike Pence did the right thing in terms of certifying the election.",
    "You're talking about at the state level, but also at the CDC, and Health and Human Services as well.",
    "I think it's important -- you know, we've been talking about January 6th now for a year and a half.",
    "Congressman Adam Kinzinger of Illinois is a member of that committee, and he joins us this morning.",
    "MARGARET BRENNAN: Speaker Pelosi and top Democrats were in Ukraine overnight, as I'm sure you know.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: We will be right back with Republican Congressman Adam Kinzinger.",
    "But, as you know, a lot of people with long COVID have respiratory issues, heart issues, fatigue.",
    "SENATOR TIM KAINE: And we're beginning to do major research at the NIH and at other institutions.",
    "So, as a parent, I'm very interested in the explanations you have for how this vaccine will work.",
    "Well, so, look, now we've submitted additional safety data to the FDA for the 12 to 18-year-olds.",
    "But, for now, I think the right strategy is to flood the zone with military and humanitarian aid.",
    "Right after we left town, a Russian airstrike destroyed that railway bridge leading out of town.",
    "MARGARET BRENNAN: Well, the FDA said Friday it will not delay one vaccine to wait for the other.",
    "So has the city, roughly 100,000 people believed to be trapped there, running out of resources.",
    "Her 87-year-old mother, Lydia, escaped with little more than her wheelchair and her cat, Dasha.",
    "Earlier in the week, their progress was being described as plodding, slow, uneven, incremental.",
    "Obviously, we just did an aid package for Ukraine about a month ago that was about $13 billion.",
    "And if it is just a defense-oriented bill, do you need to have food security funding in there?",
    "It's where we found volunteer Joshua Cropper, an Iraq War Marine veteran from Wasilla, Alaska.",
    "You're right, not in Mariupol, where the city is besieged, not able to get that food in there.",
    "The company's chief medical officer, Dr. Paul Burton, joins us now from Princeton, New Jersey.",
    "MARGARET BRENNAN: You have begun it, but you won't have all of it in until May 9th I had read.",
    "So I'm very hopefully that the FDA will follow -- follow suit here across that full age range.",
    "I mean, look, there's -- we do have outliers of people that seem to show some Putin sympathy.",
    "Do you see impediments to getting this $33 billion that the president has asked to be passed?",
    "ADAM KINZINGER: Yes, I mean, I think, ultimately, whatever we can do to get that information.",
    "Look, history is not going to judge her or people like her that are buying the big lie well.",
    "MARGARET BRENNAN: The president did authorize U.S. diplomats to return to Ukraine this week.",
    "As I say, we know now that 50 percent means to cut in half your risk of symptomatic disease.",
    "It gives him, you know, a better flexibility, but also it is a deterrent to Vladimir Putin.",
    "In other words, they're not trying to put Pfizer and Moderna head to head here necessarily.",
    "Actual rates of safety events, even lower than we see in the six-year-olds to 12-year-olds.",
    "Look, I mean, that can't -- for me, as a Republican, that doesn't represent what I believe.",
    "MARGARET BRENNAN: And we go now to Senator Tim Kaine, who joins us from Richmond, Virginia.",
    "MARGARET BRENNAN: And that funding the president asked for this week is about $33 billion.",
    "I want to talk about the book, but we did see you last night at the Correspondents Dinner.",
    "Virtually every week, President Biden is releasing $500 million, $800 million of the aid.",
    "We know some people are escaping Russian bombardment by moving into Russia voluntarily.",
    "REP. ADAM KINZINGER (R-IL): Well, I think certainly new information will come to light.",
    "This looks more and more like the West is becoming party to this conflict in some way.",
    "We will hear from Illinois Republican Congressman Adam Kinzinger about what to expect.",
    "SENATOR TIM KAINE: Well, again, we can break it into smaller pieces or larger pieces.",
    "We're still in this BA.2 wave of a variant sweeping now throughout the United States.",
    "But for the most part, Congress is vastly and largely united on the issue of Ukraine.",
    "MARGARET BRENNAN: All right, Ambassador Power, thank you for your time this morning.",
    "They have a lot of equipment going in, and they have some U.S. intelligence as well.",
    "And when we looked at the safety, as I say, the safety profile was very reassuring.",
    "MARGARET BRENNAN: You, in your book, talk about some of these institutional issues.",
    "So now we have to figure out -- we have tools, better tools that we had a year ago.",
    "So, we have the tools now to enable every American to not only survive, but thrive.",
    "But let's think about that number, Margaret, 37, 51 percent vaccine effectiveness.",
    "JOSHUA CROPPER (U.S. Marine Veteran): It's nothing that I have experienced before.",
    "VOLODYMYR ZELENSKYY (Ukrainian President): We will win, and we will win together.",
    "But their heart is in the right place and their conviction is in the right place.",
    "And that is a dramatic escalation over what we did in 2021 and even before that.",
    "So, it's why I think we can be very reassured and very confident in this result.",
    "I tested this morning because I knew I was going to see you in person, unmasked.",
    "This is a guy that said that he, frankly, doesn't care what happens in Ukraine.",
    "As a Republican, do you want to see him come forward and actually speak to you?",
    "And what are you doing in the meantime to prevent things like a global famine?",
    "We are spending that money now in Ukraine in order to meet humanitarian needs.",
    "And the right answer for the border is not an emergency short-term regulation.",
    "That was part of our immigration reform bill in 2013...\nMARGARET BRENNAN: Yes.",
    "SENATOR TIM KAINE: Margaret, I think I would say I'm experiencing long COVID.",
    "Do you think there needs to be a discussion of authorization of use of force?",
    "It's just an example of the onslaught facing Ukrainians along the front line.",
    "But I'm elected by Virginians to vote on things, controversial or otherwise.",
    "How long can you wait for the funding that the president has asked for here?",
    "We're going deeper with richer and more detail to show the American people.",
    "And many of those details are recounted in her new book, \"Silent Invasion.\"",
    "Ukraine says they don't have time, so why not make this a stand-alone bill?",
    "So, the Ukrainians have a very good picture of what the Russians are up to.",
    "Are you saying your USAID staff are already inside and working to do this?",
    "MARGARET BRENNAN: We will continue to cover that on this program as well.",
    "DEBORAH BIRX: I like to look at the whole spectrum of the last two years.",
    "So, the 50 percent benchmark, you know, really was in a pre-omicron era.",
    "And -- so, yes, I do think the primary season is going -- going to tell.",
    "But, keep in mind the president's -- the former president's tactic here.",
    "CHARLIE D'AGATA: What is it like fighting beside these Ukrainian forces?",
    "We will talk with Dr. Paul Burton, the chief medical officer at Moderna.",
    "We need to get it to them when they need it with the weapons they need.",
    "We should do them together or separately, but we shouldn't wait around.",
    "SENATOR TIM KAINE: OK.\nMARGARET BRENNAN: We'll be back with a lot more.",
    "PAUL BURTON, M.D., CHIEF MEDICAL OFFICER, MODERNA: Thank you, Margaret.",
    "So, we have to be attentive to all Americans no matter where they live.",
    "And so we have to be able to utilize those antibody levels in some way.",
    "MARGARET BRENNAN: Hospitalizations, that's what the CDC says focus on.",
    "And he said, if the Ukrainians want more money, we'll give it to them.",
    "There's quite a bit of bipartisan resolve on the Ukraine aid package.",
    "And, finally, a vaccine for the very youngest may be just weeks away.",
    "It's a higher dose than Pfizer's vaccine, which was three micrograms.",
    "ADAM KINZINGER: Yes, I mean, I would love to ask her a few questions.",
    "ADAM KINZINGER: Well, I won't say who I think we need to talk to yet.",
    "We -- right now we're kind of not even building a broader narrative.",
    "SENATOR TIM KAINE: ... to patients, families, providers, employers.",
    "And we still have more of that first package to release to Ukraine.",
    "They are three hours from a hospital that could take care of Covid.",
    "We need -- we need a vote on the long -- on the COVID aid package.",
    "(End VT)\nCHARLIE D'AGATA: The next few days here will be critical.",
    "Now, he still has a ways to go in order to get all of the Donbass.",
    "(ANNOUNCEMENTS)\nMARGARET BRENNAN: Welcome back to FACE THE NATION.",
    "We put a significant amount of money in the American Rescue Plan.",
    "I know we hear a lot about the east, but is it that Kherson area?",
    "Nobody believes that Russia has the troops to go and take Odessa.",
    "I know you suffer from long-term effects of your COVID infection.",
    "Now, who is carrying the virus that participates in these surges?",
    "Thank you all for watching FACE THE NATION, I'm Margaret Brennan.",
    "But that means every American has to have access to these tools.",
    "And we are -- we still have some time to pass this next package.",
    "So I have to constantly be aware of my risk, yet I have to work.",
    "Do you think we are done with these massive waves of infection?",
    "So, I mean, full disclosure, I have children in this age group.",
    "MARGARET BRENNAN: Well, JD Vance, because that's what, May 3rd.",
    "It's very similar to what people like Tucker Carlson have said.",
    "Do you see it inevitable that there will be a vote on Title 42?",
    "SENATOR TIM KAINE (D-Virginia): Great to be with you, Margaret.",
    "What wins will his military actually be able to deliver to him?",
    "MARGARET BRENNAN: But, the bigger it gets, the slower it goes.",
    "MARGARET BRENNAN: Wow, that's not general consensus right now.",
    "SENATOR TIM KAINE: I think that would be premature, Margaret.",
    "MARGARET BRENNAN: David Martin, great insights and reporting.",
    "I don't think we need to be using force in Ukraine right now.",
    "These indoor gatherings are happening across the country now.",
    "I mean those applications are now under active review by FDA.",
    "What are the side effects for a toddler of a dose that size?",
    "You don't hear Republican leaders say, ask me to spend more.",
    "We turn now to national security correspondent David Martin.",
    "Do you need to have global vaccine funding in there as well?",
    "And this is what we have to be prepared for in this country.",
    "Vaccinated individuals, as well as unvaccinated individuals.",
    "On Saturday, Russian forces made no advances on any fronts.",
    "The town of Lyman is expected to be among the next to fall.",
    "Volunteers shuttled a few remaining residents in a minibus.",
    "Common side effects are injection site pain and some fever.",
    "If Vladimir Putin wants to escalate with the west, he will.",
    "Each application will be considered when the data is ready.",
    "MARGARET BRENNAN: It -- thank you for the guidance on that.",
    "Congressman Adam Kinzinger, thank you for your time today.",
    "So, I have this organization, Country 1st, Country1st.com.",
    "That aid does not go all out the door at the same moment.",
    "SENATOR TIM KAINE: I think -- I think it will, Margaret.",
    "Alina described the shelling is constant, day and night.",
    "Each of these surges are about four to six months apart.",
    "So I'll test every day for five days after an exposure.",
    "So I hope we don't have any impediments to that at all.",
    "So the data in, you know, the study has been completed.",
    "She's also the former ambassador to the United Nations.",
    "Russian forces have greater numbers and a longer reach.",
    "CHARLIE D'AGATA: Heart and conviction only goes so far.",
    "SENATOR TIM KAINE: Margaret, what I have said is this.",
    "I mean I think everybody needs to come and talk to us.",
    "I think if that takes a subpoena, it takes a subpoena.",
    "Really a lot of what all of us have after vaccination.",
    "Dr. Fauci said it was too dangerous for him to attend.",
    "They're good about sequencing and find their variants.",
    "MARGARET BRENNAN: Doctor, thank you for your insights.",
    "And, as you said, I'm aware of it because of my kids.",
    "I won't confirm or deny the text messages, of course.",
    "Is there truly nothing the U.S. can do, except watch?",
    "MARGARET BRENNAN: I'm Margaret Brennan in Washington.",
    "What evidence do you have of what's happening there?",
    "Sorry, I don't mean to get -- continue your thought.",
    "And so we need to know if they're protected or not.",
    "Lack of individuals to counsel them about vaccines.",
    "Why hasn't this administration been able to fix it?",
    "Because you're not the only person who's said this.",
    "But they have the data that they need now to begin.",
    "The right answer is permanent fixes that will help.",
    "SENATOR TIM KAINE: I don't think it does, Margaret.",
    "DAVID MARTIN: They have a lot of U.S. intelligence.",
    "And I think we need to push it very, very quickly.",
    "What is your confidence level in that performance?",
    "So, we give two 25 micrograms shots a month apart.",
    "It just says, if it is used, he has that leverage.",
    "And what you need to be looking at is global data.",
    "And so I just always know and then I keep testing.",
    "And we will be watching closely what happens next.",
    "I think it was just about 18 percent on the week.",
    "And he's extremely unlikely to get that by May 9.",
    "There is no early warning system in this country.",
    "We have depo (ph), monoclonal antibody Evusheld.",
    "We'll be back in a moment with Dr. Deborah Birx.",
    "So that's why this supplemental is so important.",
    "ADAM KINZINGER: Yes, I think it would be a sign.",
    "So they have the full spectrum of data with us.",
    "We recognize Ukraine is fighting for all of us.",
    "You know, you follow the Hill pretty carefully.",
    "SENATOR TIM KAINE: DHS has now laid out a plan.",
    "MARGARET BRENNAN: Doctor, thank you very much.",
    "We'll be back with a lot more Face the Nation.",
    "SAMANTHA POWER (USAID Administrator): Morning.",
    "MARGARET BRENNAN: How do tests throw that off?",
    "There are -- there are tools that we can use.",
    "In your book you say there is no plan b then.",
    "You think that's what's coming for the south?",
    "There are people who are really suffering it.",
    "MARGARET BRENNAN: One quick question for you.",
    "MARGARET BRENNAN: Charlie D'Agata, thank you.",
    "Good morning, and welcome to Face the Nation.",
    "How quickly do you think this will get done?",
    "MARGARET BRENNAN: I'm glad to see you again.",
    "And I think that's just what we need to do.",
    "Her new book is entitled \"Silent Invasion.\"",
    "And those are decisions we make every day.",
    "And, still, none of them have come really.",
    "So I think that's important to watch too.",
    "But I don't have any information on that.",
    "But that's exactly what's happening here.",
    "What do we know about where the focus is?",
    "And to this day there is still no plan b.",
    "DEBORAH BIRX: Lack of primary physicians.",
    "Places like Popasna have been flattened.",
    "CHARLIE D'AGATA: Good morning, Margaret.",
    "Are you in favor of subpoenaing members?",
    "And, if so, who do you need to talk to?",
    "Do you need to ask her a few questions?",
    "That would weaken Ukrainian solidarity.",
    "We're now at close to a million deaths.",
    "People are eligible now to get boosted.",
    "I hope we don't get to that point here.",
    "It's all just ahead on Face the Nation.",
    "And so I was confused about the timing.",
    "But, no, we don't -- we need COVID aid.",
    "Doesn't compel the president to do it.",
    "So, I think, overall, very reassuring.",
    "So I follow South Africa very closely.",
    "They haven't reopened the embassy yet.",
    "Good morning to you, Madam Ambassador.",
    "And I hope he would do so voluntarily.",
    "ADAM KINZINGER: I certainly hope not.",
    "He is a central player in this story.",
    "Is there a way around this roadblock?",
    "David, always great to have you here.",
    "And we hope they can continue safely.",
    "They're going to need something else.",
    "We were both there as guests of CBS.",
    "So, we submitted our data last week.",
    "That's what we'll go in by May 9th.",
    "Doctor, welcome to FACE THE NATION.",
    "Dr. Brix is here with us in studio.",
    "MARGARET BRENNAN: Do you favor one?",
    "How many people are in these camps?",
    "And so that assistance is flowing.",
    "JOSHUA CROPPER: More NATO weapons.",
    "I wouldn't call myself a sufferer.",
    "And how much more money is needed?",
    "Where should we be focusing most?",
    "Good morning to you, Congressman.",
    "You're saying, don't focus on it.",
    "I would absolutely recommend it.",
    "And I consider that an exposure.",
    "But we should be ready if we do.",
    "You know, vote in that primary.",
    "And hospitalizations are great.",
    "You're committed to that date?",
    "So, yes, we're very confident.",
    "Hospitalizations are going up.",
    "Omicron is not a mild disease.",
    "We do need to do this quickly.",
    "Good morning to you, Senator.",
    "It's a different type of war.",
    "Infection rates are going up.",
    "They're on an up slope again.",
    "PAUL BURTON: Yes, absolutely.",
    "MARGARET BRENNAN: All right.",
    "ADAM KINZINGER: No, I don't.",
    "Good morning to you, Doctor.",
    "MARGARET BRENNAN: All right.",
    "It's a statement of support.",
    "I went to Elko (ph), Nevada.",
    "That's what he called them.",
    "They're good about testing.",
    "It's easy for him to do it.",
    "What does that really mean?",
    "It's still being reviewed.",
    "DAVID MARTIN: In the east.",
    "We have to leave it there.",
    "DAVID MARTIN: Sure thing.",
    "Title 42 needs to expire.",
    "Do you think he is right?",
    "We can't let that happen.",
    "I would love to see that.",
    "We want the information.",
    "MARGARET BRENNAN: Right.",
    "MARGARET BRENNAN: Right.",
    "He's already set a line.",
    "We have those tools now.",
    "That's it for us today.",
    "Is it this new variant?",
    "And that's predictable.",
    "SENATOR TIM KAINE: Yes.",
    "Why is that not enough?",
    "MARGARET BRENNAN: Yes.",
    "When's the right date?",
    "How do you judge risk?",
    "MARGARET BRENNAN: Yes.",
    "I firmly believe that.",
    "MARGARET BRENNAN: Yes.",
    "MARGARET BRENNAN: Yes.",
    "DEBORAH BIRX: Correct.",
    "MARGARET BRENNAN: Yes.",
    "And it is a travesty.",
    "MARGARET BRENNAN: OK.",
    "I would expect we do.",
    "Absolutely, Margaret.",
    "We'll be right back.",
    "We know some things.",
    "ADAM KINZINGER: Yes.",
    "We need Ukraine aid.",
    "But it was progress.",
    "Thank you, Senator.",
    "That's what counts.",
    "I can do my thing.",
    "And we'll be back.",
    "DEBORAH BIRX: Yes.",
    "That's a warning.",
    "PAUL BURTON: Yes.",
    "PAUL BURTON: Yes.",
    "PAUL BURTON: Yes.",
    "PAUL BURTON: Yes.",
    "Happy to be here.",
    "PAUL BURTON: Yes.",
    "We have the data.",
    "PAUL BURTON: Yes.",
    "PAUL BURTON: Yes.",
    "So that's great.",
    "But I can work.",
    "I can exercise.",
    "Pick your word.",
    "Is it Odessa?",
    "You're right.",
    "Stay with us.",
    "Stay with us.",
    "Good morning.",
    "Stay with us.",
    "It's insane.",
    "It matters.",
    "Thank you.",
    "Thank you.",
    "But, no.",
    "We are.",
    "AMB."
  ]
}