{
  "id": 7647,
  "mediaId": 178,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Annual first-round feeding frenzy on quarterbacks doesn't materialize  and rightfully so",
  "image": "https://chorus.stimg.co/23430970/AP22081738791179.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/annual-first-round-feeding-frenzy-on-quarterbacks-doesnt-materialize-and-rightfully-so/600169682/",
  "sentiment": "0",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Craig",
  "authorUrl": "https://www.startribune.com/mark-craig/6370584/",
  "termIds": [
    815,
    1505,
    5750,
    5865,
    5888,
    5940,
    5948,
    5968,
    399,
    5631,
    2645
  ],
  "sentences": [
    "Someday, fairly soon, when Adam Thielen is gone and Justin Jefferson is breaking the bank, will the Vikings regret, A, not following the three-headed Bengals Way, and B, handing receivers to Detroit and Green Bay with trades at Nos.",
    "Belichick, who has bought low and sold high with backup QBs in the past, figures Zappe could fetch more later on with the right development and a few good preseason games.",
    "It feels strange suggesting there's a \"Bengals Way,\" but Cincinnati did in fact just play in a Super Bowl with three dynamic receivers all drafted in the first two rounds.",
    "102 of the third round in part because it had already traded for Tyreek Hill, one of three blockbuster deals involving mega-priced veteran receivers this offseason.",
    "New Vikings General Manager Kwesi Adofo-Mensah essentially poo-pooed the famous Jimmy Johnson trade value chart in favor of a more modern model he prefers.",
    "The formerly tried-and-true amateur algorithm that all teams that need a quarterback will always and forever panic in the first round of the draft is out.",
    "Johnson's chart, which places added value on higher picks, says the Vikings gave up 1,640 points when they traded the 12th and 46th picks to Detroit.",
    "Maybe that's why Bill Belichick drafted Western Kentucky quarterback Bailey Zappe in the fourth round a year after taking Mac Jones 15th overall.",
    "But anyone in these parts old enough to remember the name Herschel Walker knows not to dismiss Jimmy's strategy when it comes to the NFL draft.",
    "Rumors that Baltimore  an organization that knows its way around a draft board  was interested in taking him at 14 only enhanced this feeling.",
    "Big thumbs up to Philly\nThis corner of the failed mock drafting world had Georgia defensive tackle Jordan Davis going to the Vikings at No.",
    "Like Atlanta, QB-starved Carolina and its hot-seat-sitting regime waited until the third round before drafting Ole Miss' Matt Corral.",
    "A powerful, mountain-sized tackle with nimble feet and 4.78 speed seemed like a great fit anywhere along the new three-man front.",
    "Moments after the Vikings bailed from 12 to 32, Philly pounced, moving up two spots to leapfrog Baltimore and select Davis.",
    "Your Super Bowl-winning Rams Way turned many a mock draft from bad to ugly to \"You Get Paid To Do This?\"",
    "The Lions' advantage, according to Jimmy: 230 points, which is equal to the 72nd pick, a third-rounder.",
    "In a copycat league, the Rams set a new course to follow by using draft picks to buy Matthew Stafford.",
    "Carson Wentz also got dealt to Washington, his third team and second trade in about 12 months or so.",
    "It also says the Vikings got back only 1,410 points for the Lions' 32nd, 34th and 66th picks.",
    "And in the third round, they got first-round potential in Georgia linebacker Nakobe Dean.",
    "Patience and sensible draft board evaluation of the game's most important position is in.",
    "Then Cleveland sent three first-rounders to Houston as part of the Deshaun Watson trade.",
    "They couldn't care less that their first pick in this year's draft was 104th overall.",
    "Two of them  Tee Higgins and Ja'Marr Chase  were top-33 picks in 2020 and 2021.",
    "Denver sent Seattle two first-round picks as part of the Russell Wilson trade.",
    "And by pick 23, two other teams had traded their picks for veteran receivers.",
    "The first quarterback taken  Kenny Pickett to the Steelers  went at No.",
    "The second quarterback taken  Desmond Ridder to the Falcons  went No.",
    "Of course, the Rams Way already was being followed before the draft.",
    "They packaged the 18th and 101st picks for Titans receiver A.J.",
    "It was a bad quarterback class, and teams treated it as such.",
    "A record six of the top 18 picks were receivers this year.",
    "He went 78 picks later, to Tennessee in the third round.",
    "Kwesi and his chart very well could end up being right.",
    "Thanks, Stan Kroenke, Les Snead and Sean McVay.",
    "74 in the third round, the third-lowest ever.",
    "Some had him going 32nd overall (guilty).",
    "Or that it was used for depth at guard.",
    "And Miami didn't have a pick until No.",
    "And, no, Malik Willis did not go No.",
    "All it cost was three Day 3 picks.",
    "The Eagles crushed the draft.",
    "Brown, a star who's only 24.",
    "What about the Bengals Way?",
    "20, the lowest since 1997.",
    "Don't dis Jimmy's chart!",
    "8 (guilty).",
    "12 and 34?",
    "Go figure.",
    "12."
  ]
}