{
  "id": 7652,
  "mediaId": 120,
  "date": "d2022-04-29T15:26",
  "headline": "The unexpected thing Herschel Walker has in common with Dr. Oz",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220429-MB-Herschel-Walker-jg-57e679.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/unexpected-thing-herschel-walker-common-dr-oz-rcna26644",
  "sentiment": "-0.921",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    815,
    1653,
    196,
    200,
    501,
    2862
  ],
  "sentences": [
    "The AJC article added that the Republicans failures in this area were so extensive that he and his partners took on significant debts, for which creditors have repeatedly sued Walker and his associates to recover.",
    "According to the Journal-Constitutions reporting, when that beverage proved to be a flop, Walker and his business partners developed a different drink that was also portrayed as a way to ward off disease.",
    "The Atlanta Journal-Constitution reported:\nPart of the problem is that the products were commercial failures, reinforcing concerns about Walkers troubled record as a businessman.",
    "Its too soon to say whether Oz or Walker will end up on Capitol Hill, but those turning to the candidates for health-related guidance should probably exercise some caution.",
    "The New York Times reported late last year, for example, that Dr. Oz has a history of dispensing dubious medical advice and making sweeping claims based on thin evidence.",
    "The Times article added, In 2014, the British Medical Journal analyzed 80 recommendations on Dr. Ozs show, and concluded that fewer than half were supported by evidence.",
    "The article referenced controversial comments the Republican has made about everything from weight-loss pills to apple juice to cellphones.",
    "For example, he championed an aloe-based drink, which purportedly protected people from the damage caused by smoking cigarettes.",
    "More recently, of course, Walker falsely claimed that the FDA had approved an unproven dry mist mystery treatment for Covid-19.",
    "This week, however, a new similarity emerged: Theyve both been accused of making dubious claims related to medicine and health.",
    "As their statewide campaigns move forward, Georgias Herschel Walker and Pennsylvanias Mehmet Oz have quite a bit in common.",
    "Recommended\nBut more important is the fact that Walkers health-related products didnt do what he claimed theyd do.",
    "Oz even promoted hydroxychloroquine on Fox News in 2020 as a possible Covid-19 treatment.",
    "Theyre both celebrities hoping to parlay their public profiles into political power.",
    "Theyre both running in states they didnt live in until quite recently.",
    "Theyre both political rookies running for office for the first time.",
    "As it turns out, Walker has a related problem in his record.",
    "Theyve both received endorsements from Donald Trump.",
    "Theyre both Republican Senate candidates."
  ]
}