{
  "id": 7657,
  "mediaId": 43,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Dr. Jason Johnson slams GOP on Herschel Walker. Do not get Medicare Advantage. Katie Porter again.",
  "image": "https://images.dailykos.com/images/1063946/story_image/Dr.JasonJohnsonslamsGOPonHerschelWalker.DonotgetMedicareAdvantage.KatiePorteragain.jpg?1651261810",
  "link": "https://www.dailykos.com/story/2022/4/29/2094841/-Dr-Jason-Johnson-slams-GOP-on-Herschel-Walker-Do-not-get-Medicare-Advantage-Katie-Porter-again",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Podcasts: Politics Done Right | Egberto Off The Record\n Live Video: Facebook Live | Youtube Live | Periscope | Twitch\nMy books support (1) communication techniques & (2) our ability to continue delivering the progressive message: How to make America Utopia: Take away the economy from those who rigged it,\" \"It's Worth It: How to Talk To Your Right-Wing Relatives, Friends, and Neighbors\" & \"As I See It: Class Warfare: The Only Resort To Right Wing Doom.\"",
    "Medicare Advantage is a fraud\nx\nx\nx\nPolitics Done Right Live weekdays @ 11:00 AM Central\n Video Zoom: LINK  Live Calls: (346)248-7799 ID:254 0 9091\nDr. Jason Johnson slams Republicans for running Herschel Walker against Raphael Warnock: @DrJasonJohnson points out that GOP thinks black Americans are so dumb that they will run the severely flawed black football player @HerschelWalker against @ReverendWarnock.",
    "Every year, tens of thousands of people enrolled in private Medicare Advantage plans are denied necessary care that should be covered under the program, federal investigators concluded in a report published on Thursday.",
    "Medicare Advantage Plans Often Deny Needed Care, Federal Report Finds: Investigators urged increased oversight of the program, saying that insurers deny tens of thousands of authorization requests annually.",
    "Rep. Katie Porter gave it to the CEO as she slammed Big Pharma as an unregulated fraud: Dont try to bloviate with Rep. Katie Porter.",
    "Dr. Jason Johnson calls out GOP on running Herschel Walker against Raphael Warnock.",
    "Will you subscribe to our YouTube Channel to help us get to 100,000 subscribers?",
    "This CEO paid the price as she exposed him and his industry as a fraud.",
    "Katie Porter slams Big Pharma Rep. No to Medicare Advantage.",
    "It will help us deliver the progressive message widely.",
    "Would you mind joining our YouTube channel now?"
  ]
}