{
  "id": 7669,
  "mediaId": 558,
  "date": "d2022-04-27T03:00",
  "headline": "When it comes to offseason promises, Dallas Cowboys owner Jerry Jones is the GOAT",
  "image": "https://s.yimg.com/ny/api/res/1.2/M_ELIkuqu8tUYONXhQfCng--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTg4NDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/LI.mknZMmBa2UDhePUPDag--~B/aD0xNDMwO3c9MTE0MDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fort_worth_star_telegram_mcclatchy_952/ac56c441c849cc5b42c851c7eeaf3b55",
  "link": "https://news.yahoo.com/jerry-jones-had-dollar-every-100000606.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    5694,
    5818,
    5964,
    5971,
    5579
  ],
  "sentences": [
    "February 2005\nThe Cowboys were aggressive in the offseason, adding veterans such as quarterback Drew Bledsoe, defensive tackle Jason Ferguson, guard Marco Rivera and defensive back Anthony Henry.",
    "On Tuesday at The Star, Jerry joined Cowboys VP Stephen Jones and head coach Mike McCarthy to offer us all hope why what has happened thus far this offseason doesnt matter.",
    "With the Cowboys preparing for the draft, it calls to mind the previous offseasons when Jerry would offer some rather interesting assessments of his team.",
    "As frustrated, angry and despondent Dallas Cowboys were/are, Jerry Jones said Tuesday, I think we can very easily be where we were last year talent-wise.",
    "March 2002\nThis is the most excited I have been since then, Jerry said referring to the teams trade of Herschel Walker, in 1989.",
    "We are looking for players who are not at the top of the market who can contribute to our success over the next several years.",
    "Thursday kicks off the NFL Draft, and thats the vehicle that the Dallas Cowboys will use to fix it.",
    "Result: The Cowboys finished 5-11, for a third consecutive year, and fired coach Dave Campo.",
    "For instance, it would be contrarian for the Dallas Cowboys to win a playoff game, or two.",
    "... Now that we are out of that [salary-cap] trap, I dont want any more of that cheese.",
    "You cant go out and pay Rolls Royce dollars and end up with a 70 Chevy, Jones said.",
    "And then the 62-year-old Jones said, I dont have time to have a bad time now.",
    "Nothing dangerous about thinking crazy things, Jerry told us media flock.",
    "I have the same feeling right now, that its going to pay off big.",
    "I had the feeling it was going to be rewarding for the fans.",
    "We are not interested in setting the market on players.",
    "Its a little different than where I had been.",
    "If its busy, call 1-800-I-LOVE-PAIN.",
    "For tickets, call 817-892-4400.",
    "We should think outta the box.",
    "We should be contrarians.",
    "Its not on my schedule.",
    "I was excited.",
    "Forget three.",
    "All of it."
  ]
}