{
  "id": 7671,
  "mediaId": 98,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "Column: Georgia can do better than Marjorie Taylor Greene",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/418cba2/2147483647/strip/true/crop/6000x4000+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F27%2F1d%2Fb3aa130d421393a128690966539d%2Fla-photos-1staff-681295-na-pol-capitol-hill-kkn-23909.JPG",
  "link": "https://www.latimes.com/opinion/story/2022-04-27/marjorie-taylor-greene-re-election-primary-opposition",
  "sentiment": "0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Imagine being a woman and youre just trying to get your groceries out of your car to carry them in the house and you are faced with men who dont even belong in your carport and thats where they are because they invaded our country, Greene said during a news conference at the U.S.-Mexico border in which a delegation of Republican members of Congress pretended to care about the rule of law while ignoring the fact that the storyteller on the mic tried to overturn the presidential election.",
    "Right now the leading candidate in Georgias Republican primary for the Senate is Herschel Walker, a former Georgia Bulldog football star who lied about graduating from college, lied about being high school valedictorian, and earlier this year told college students in Texas that his upholstery company employs about 250 people when in fact theres no evidence of him even owning an upholstery company.",
    "Just 108,816 voters participated in the Republican primary, and fewer than 77,000 during the runoff between John Cowan and Marjorie Taylor Greene, who moved on to the general election with the support of a whopping 43,813 people.",
    "Despite what our current representative may try to lead you to believe, kindness is not a weakness, Seth Synstelien, one of the candidates looking to unseat Greene, says on his campaign page.",
    "Of course, Greene also voted against awarding congressional medals to U.S. Capitol Police and other officers who protected the Capitol during an insurrection she apparently helped organize.",
    "Greene did take time to offer condolences to the family of Bishop Evans, the 22-year-old Texas National Guard member who drowned trying to save two migrants struggling in the Rio Grande.",
    "On Jan. 17 she said: In our private chat with only Members, several are saying the only way to save our Republic is for Trump to call for Marshall law  misspelling martial.",
    "And comparing what she said under oath to what she reportedly said via text to President Trumps then-chief of staff, Mark Meadows, certainly reveals some inconsistencies.",
    "Not exactly the kind of words you want to hear from someone who listed police officer among his career experiences, but, hey, at least hes not advocating Marshall law.",
    "Its more likely she is simply the beneficiary of a small group of QAnon supporters who bothered to show up when most others were either too busy or not interested.",
    "Some opponents are hoping to keep her name off the ballot by using the Constitutions disqualification clause, because of her support for the Jan. 6 insurrection.",
    "Now, maybe her controversial and sometimes flat-out racist views are an accurate reflection of the 728,551 people who call the 11-year-old district home.",
    "But regardless of what, if anything, happens in court, getting more of the 728,551 people in her district to vote her out is the most effective method.",
    "Thats all it took for Greene  a woman who believed a laser beam from outer space started a 2018 wildfire in California  to get into Congress.",
    "Georgias 14th Congressional District has a population of 728,551, of which 468,681 were registered to vote in the 2020 general election.",
    "But theres a part of me that believes that she doesnt represent the districts best, and that if given the chance, voters will show it.",
    "All I know is that the best way to get her out of office is the same method used to get her in  the vote.",
    "So, yes, only part of me believes Georgia voters will have the wisdom to kick Greene out of Congress.",
    "There are signs that not every conservative in her district is happy to have Greene represent them.",
    "Losing in the Republican primary cant be as easily dismissed  not by Greene or future candidates.",
    "Anyway, another positive sign is that these challengers are clearly running as anti-Greenes.",
    "Its up to her district to decide whether she represents who they are and what they want.",
    "Because disqualification would be viewed as a political attack brought on by the left.",
    "That only works if the district has grown disillusioned with her, which isnt clear.",
    "They speak softly while carrying enough firepower to blow a person to kingdom come.",
    "It wont give pause to future candidates like her; it would provide them with ammo.",
    "Shes raised the most money, but its dominated by donors from outside the state.",
    "But he also says: Someone who wields true power does not throw temper tantrums.",
    "In 2018, the incumbent, Tom Graves, did not face a challenger in the primary.",
    "Greene has national name recognition, but locally, do they care if shes rude?",
    "Its amazing how shes able to do so much despite remembering so little.",
    "I will admit, watching Greene testify last Friday was entertaining.",
    "That and our habit of voting for the party instead of the person.",
    "We tried everything we could in our objection to the 6 states.",
    "On Jan. 7, 2021, she sent: Yesterday was a terrible day.",
    "He retired to run a lobbying firm in Washington.",
    "The word perjury immediately comes to mind.",
    "There are five challengers in the primary.",
    "Has a flair for racist storytelling?",
    "Its a shaky proposition, I know.",
    "Im sorry nothing worked.",
    "Or is it martial?",
    "I cant remember.",
    "Misinformed?",
    "Why?"
  ]
}