{
  "id": 7683,
  "mediaId": 238,
  "date": "d2022-04-25T13:00",
  "headline": "The enduring value of the NFL drafts most famous and misunderstood chart",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OZFRPVNT6RBRBHZNRTWLTNP4YM.jpg&w=916",
  "link": "https://www.washingtonpost.com/sports/2022/04/25/nfl-trade-value-chart/",
  "sentiment": "0.583",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sam Fortier",
  "authorUrl": "https://www.washingtonpost.com/people/sam-fortier/",
  "termIds": [
    815,
    5697,
    5888,
    5971,
    5972,
    6031,
    582,
    5567,
    5579,
    5621
  ],
  "sentences": [
    "In the three decades since  despite the leagues tremendous structural changes, despite a growing number of critics poking holes in the chart, despite many teams developing their own charts, despite McCoys own admission that he created a history textbook instead of a price list  the chart has endured, more or less controlling the trade market of draft picks.",
    "In 2005, Cade Massey of the Wharton School at the University of Pennsylvania and Nobel Prize winner Richard H. Thaler of the University of Chicago published The Losers Curse, a seminal study that concluded NFL teams were overconfident in their ability to discern between good and great players.",
    "Its always going to be slow, and certain [franchises] are going to be more aggressive in doing so, but [this year] is just another example of the league slowly but surely moving toward a different philosophy, said Brad Spielberger, a Pro Football Focus analyst and draft-chart innovator.",
    "In an email, he stressed footballs unique factors may always make judging pick trades in the NFL more difficult than in other sports  and he implied the data community must guard itself against the same overconfidence it finds so frustrating in GMs.",
    "Advertisement\nOn draft night, as other GMs, coaches, executives and scouts conspire in war rooms across the country, this GM evaluates real-time offers by having an analytics staffer plug them into a model on his computer.",
    "He remembers his dad as someone who loved information, who celebrated the advancements of computers, and when he heard the NFL may be moving away from his dads chart in favor of new data, he thought it was fitting.",
    "Advertisement\nThomas Dimitroff, the Atlanta Falcons general manager from 2008 to 2020, said even forward-thinking GMs reverted to McCoys chart because trying to use an alternative became a little bit of a cluster.",
    "So maybe one team really wants the 10th pick and 30 teams do not; the price we see for the 10th pick is not reflective of how the league values the pick, but how the team that wants it the most values that pick.",
    "In 2020, Spielberger of Pro Football Focus and Jason Fitzgerald of Over the Cap introduced one of the latest charts, which compared the value of a picks second contract to the top five players at his position.",
    "The aggressive teams must thread a needle, acquiring players at premium positions, relying on compensatory picks to maintain a level of draft capital and hitting on non-premium positions in the middle rounds.",
    "What to read about the NFL\nBlockbuster trade: Deshaun Watson will attempt to resume his NFL career with the Cleveland Browns after missing all of last season while facing accusations of sexual misconduct.",
    "In February, at the Super Bowl parade, Los Angeles Rams GM Les Snead celebrated his teams strategy of trading late first-rounders for proven players by wearing a shirt that read, [Expletive] Them Picks.",
    "Daniel Jeremiah, a draft analyst for NFL Network, suggested the value of picks arent changing and that GMs are just becoming more realistic about  and more aggressive with  the position of their teams.",
    "One by Chase Stuart addressed the lack of performance data in McCoys chart, and another by Rich Hill, a writer for SB Nation, updated McCoys premise by tracking pick trades under the rookie wage scale.",
    "In the spring of 1991, in Dallas Cowboys headquarters, a petroleum engineer named Mike McCoy sat down at his desk to devise one of the most influential innovations in the past three decades of the NFL.",
    "They see it as part of the NFLs larger analytics movement, which has manifested on the field in passing rates and fourth-down aggression and in front offices with the building out of data departments.",
    "New England Patriots Coach Bill Belichick once suggested teams started arguing over different charts in the mid-2000s, which happens to be when economists first scrutinized the way GMs valued picks.",
    "Advertisement\nMore specifically, unearned faith that they are smarter than the other 31 decision-makers, Chase Stuart of Football Perspective, an early draft-chart innovator, explained in an email.",
    "Stephen Jones, Jerrys son and the Cowboys director of player personnel, had a theory on why some teams tout their proprietary charts to the media instead of calling it a tweaked version of McCoys.",
    "In media interviews over the years, he acknowledged its flaws  lack of performance data, limited sample size  and in 2007 he told the Fort Worth Star-Telegram: To me, it wasnt that special.",
    "One general manager, who spoke on the condition of anonymity, said his staff outlines trade proposals from other teams on index cards, which he stacks up and refers to throughout the draft.",
    "If you are trading down from the 10th pick, you are likely trading it to the team that will pay the most for it compared to all other teams, Football Perspectives Stuart wrote in an email.",
    "Fred Gaudelli, the longtime football TV producer, once said the pair helped create the modern draft spectacle by transforming the event from a sleepy little meeting into a live poker game.",
    "Over the years, despite significant gains in player-tracking data, and despite his strong belief in his personnel staff, his teams hit rate in the draft has remained relatively the same.",
    "Critics of the chart have long pointed to the precipitous decline from the first pick (3,000) to the 32nd (590) and argued the importance of picking early, while high, is overstated.",
    "On Thursday night, after one of the most aggressive offseason stretches of all time, this years draft will begin with only 24 of 32 teams slated to pick in the first round.",
    "But if youre  a pass rusher short, or youre a corner short, [or] youre a left tackle short, its awful hard to find those impact players in the middle rounds at those spots.",
    "He said he considers the charts as gauges, not gospel, because he must weigh so many factors, including schemes, medical histories, interviews and dozens of opinions.",
    "While newer charts endorse collecting more picks, they also say the odds of hitting on a pick from the late fifth round through the seventh is basically a coin flip.",
    "They had shipped star running back Herschel Walker to Minnesota for a massive haul, including eight picks, and quarterback Steve Walsh to New Orleans for three more.",
    "Some in the data community are skeptical this draft will represent a notable break from McCoys chart, but Dimitroff believes the tectonic shift is already underway.",
    "The offers are almost equal on McCoys chart, and the second-rounder might catch Team Bs eye, but new charts show the two third-round picks are more valuable.",
    "A few years ago, Mike was diagnosed with progressive supranuclear palsy, a rare brain disorder that quickly erodes a persons control over his body and mind.",
    "McCoys chart will still be the language teams use to build deals, but after the draft ends, analysts believe the data could signal at least a slight shift.",
    "Back in 08, when I first took the job in Atlanta, you could literally look across the table from an owner and say: Theres something I like about this kid.",
    "Probably risk in the NFL was too low for a while, and now its recalibrating higher, Rams chief operating officer Kevin Demoff recently told the Athletic.",
    "Each chart was not only more sophisticated than McCoys but argued the same case: McCoys chart declined too quickly and undervalued the middle rounds.",
    "Advertisement\nIn 2019, Belichick told reporters the squabbling over charts had subsided and that everybody probably uses about the same value chart.",
    "Dimitroff, the former Falcons GM, believes the leagues valuing of draft picks will advance with the analytics movement over the next 10 to 15 years.",
    "But they struggled, in part because none of the charts were based on widely accepted input variables, as baseball has with Wins Above Replacement.",
    "Another general manager, who spoke on the condition of anonymity, questioned the sustainability of the Rams approach but acknowledged its appeal.",
    "For example, for all the Rams bravado about [Expletive] Them Picks, the team has had 45 picks in the past five drafts, fifth most in the league.",
    "Belichick tweaked his defensive scheme to counter league trends so that, no matter where he picked, more players who fit it would be available.",
    "Advertisement\nMcCoys chart created a currency for a league that needed one, even though quantifying draft picks is hardly an exact science.",
    "Over the previous two years, the franchises brash leaders, owner Jerry Jones and Coach Jimmy Johnson, had built a war chest for the draft.",
    "In the weeks before the draft, calls fly between NFL facilities as teams attempt to appraise how one another will value this years picks.",
    "Advertisement\nWe still use it as a baseline, said Buffalo Bills General Manager Brandon Beane, echoing the sentiment of many fellow GMs.",
    "Advertisement\nFor the first 30 years of the NFL, trading picks was arbitrary, said Gil Brandt, a Cowboys executive from 1960 to 1988.",
    "Im like, Hey, look, I want to do a deal for this second-round pick, and [another GMs] like, Well, I think it should be 300 points.",
    "Whether thats because of what weve done, or it had already changed and we were among the first to see a change, well never know.",
    "The result  the famous but misunderstood and misattributed Jimmy Johnson draft-pick value chart  revolutionized the NFL draft.",
    "Based on years of data, they recommended teams trade down to get more bites at the apple, as many draftniks now like to say.",
    "The charts just there to facilitate a trade, to be able to create a fairer transaction without [spending] too much time.",
    "We want everyone to think were figuring a little bit longer, a little bit harder and a little bit better than 31 others.",
    "It was a bold boast that underscored how the Rams were able to sacrifice draft picks and still win the sports top prize.",
    "Brandt remembered the NFL as more of a family business than a corporation, and he offered trades based on relationships.",
    "Sometimes you feel like you know more than you did before, and youre like: Hey, I know this cluster of three [players].",
    "Then it gets kind of contentious even though most of the guys are your buddies when youre in this role, Dimitroff said.",
    "Theyre increasingly trading down, targeting mid-round picks that have been traditionally undervalued by McCoys chart.",
    "The chart  basically codified gut  is seen as a symptom of a general illness plaguing front offices: overconfidence.",
    "but a growing number of NFL teams seem to be embracing data-driven principles when it comes to valuing draft picks.",
    "has no definitive answer  roster-building is highly contextual, quarterbacks are the exception to every rule, etc.",
    "But Spielberger, the PFF analyst, suspected analytically advanced teams were finding ways to outwit slow adapters.",
    "Analysis: One-time second overall pick Mitchell Trubisky is high-upside, low-cost and a perfect fit in Pittsburgh.",
    "Bradys back: Tom Brady, 44, announced his retirement Feb. 1 after 22 NFL seasons and seven Super Bowl victories.",
    "The analytics movement, a microcosm of the broader societal shift from gut to data, conflicts with McCoys chart.",
    "20 to 10, and Team B asked for two third-rounders, Team A could counter-offer a second- and a fifth-round pick.",
    "Youve got your own individual, organizational thinking, and no one wants to say, Were using some general chart.",
    "Some began trading down to recoup value with volume, and others swapped late-round picks for proven veterans.",
    "But some team executives and analysts believe teams are slowly beginning to shift away from McCoys chart.",
    "The GM said his most valuable resource is the teams draft board, effectively its internal draft curve.",
    "By comparison, the value of a veteran wide receiver who can reliably post 500 yards per year is high.",
    "Its all just a matter of wanting to think you might have a little edge by doing your own, he said.",
    "You can find those guys in the third, fourth round, and you can plug them in and you can be fine.",
    "Due to the NFLs culture of secrecy, its difficult to know when teams began tweaking McCoys chart.",
    "Now, Joness oil-and-gas business partner was trying to figure out how much the picks were worth.",
    "He plotted on logarithmic paper every trade involving a draft pick over the previous four years.",
    "Sports media: Why are NFL broadcasters shuffling networks and breaking the bank this offseason?",
    "This complexity is not lost on Michael Lopez, the NFLs director of football data and analytics.",
    "He has seen it and heard about it in meetings with owners and their data-savvier children.",
    "I say, My chart says 740 points, and hes like, Well, I dont really give a flip about that.",
    "In the past decade or so, a few GMs have tried to get other teams to use updated charts.",
    "Even with the proliferation of McCoys chart, savvy teams found ways to get an edge.",
    "1 pick a random value (3,000) and used a regression formula to calculate the rest.",
    "Jeff McCoy, the eldest son of Mike, thinks his dad wouldve liked this development.",
    "The man who had run numbers for a living told his family he had just been unlucky.",
    "He had been in the war room and saw the Cowboys use the chart to vet trade offers.",
    "From 1991 to 1993, they made a dizzying number of trades and drafted 42 players.",
    "Jones and Johnson, oil wildcatter and maverick coach, exploited the status quo.",
    "[The board] is so much more important than the minutia of the points, he said.",
    "While on aggregate we can make draft curves, reality is less static, he wrote.",
    "Advertisement\nNot long after, the data community began to develop new charts.",
    "The question at the root of every chart, What is the value of a draft pick?",
    "We do use other [charts], but we still reference it as a starting point.",
    "George Allen didnt give a crap about draft choices, he said, laughing.",
    "I know this guys one, this guys two and this guys three,  he said.",
    "Jerry Brewer: With Russell Wilson, the Seahawks changed the NFL.",
    "Its easy to find safeties, linebackers, guards, Jeremiah said.",
    "The longevity of the trade value chart surprised even McCoy.",
    "Yet none gained his charts traction or universal acceptance.",
    "In October 2021, on a hot Sunday in Dallas, he died at 73.",
    "Jeff, 54, still remembers when his dad invented the chart.",
    "Over the last five or six years, theres no way you could.",
    "Advertisement\nAdvertisement\nAdvertisement\nAdvertisement",
    "There has to be a complete discussion and explanation.",
    "In his office, McCoy created a graph, assigned the No.",
    "He wanted to quantify the value of each pick.",
    "He wouldve done the same thing, Jeff said.",
    "Im just feeling it in my gut,  he said.",
    "You cant pull that off in todays world.",
    "You could always ask for more with him.",
    "If Team A wanted to trade up from No.",
    "Now theyre trying to do it again.",
    "Barely 40 days later, hes back.",
    "But in reality, you dont know.",
    "But it became so to others.",
    "Its just, like, forget it.",
    "You really dont.",
    "Blame Tony Romo.",
    "And Amazon."
  ]
}