{
  "id": 7686,
  "mediaId": 237,
  "date": "d2022-04-24T06:30",
  "headline": "Nikki Haley wants a conservative renaissance",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/ad95e3c/2147483647/strip/true/crop/6000x3150+0+425/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F60%2Ff4%2F2f2d64f44eebb2ff3b7024694f79%2Fgettyimages-1389904143.jpg",
  "link": "https://www.washingtonexaminer.com/opinion/columnists/nikki-haley-wants-a-conservative-renaissance",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Salena Zito",
  "authorUrl": "https://www.washingtonexaminer.com/opinion/author/salena-zito",
  "termIds": [
    815,
    1077,
    1147,
    1474,
    1549,
    2195,
    5771,
    2910
  ],
  "sentences": [
    "She was a two-term governor with an excellent record on job creation and her states economy, was applauded for her leadership navigating the removal of the Confederate flag from the S.C. Statehouse grounds after the Mother Emanuel church shootings, and has demonstrated strength at the United Nations on behalf of America, he said.",
    "Education will be a huge factor going forward,\" Haley said, \"because when this pandemic hit, the idea that government stepped in [and] mandated what people could do, took away parenting from the parents, took kids out of school, masked them up, and the kids lost two years worth of school, has deeply impacted people.",
    "Haley chronicled the eventual splintering of the movement by 2012, what brought them back together by the 2014 midterm elections, what strengthened them in 2016, and, despite losing the 2020 presidential election, its lingering presence in down-ballot elections across the country won by conservative candidates.",
    "To date, she has traveled to Houston for congressional candidates Morgan Luttrell and Wesley Hunt, New Hampshire for House hopeful Matt Mowers, Georgia for Senate candidate Herschel Walker, California for Young Kim's and Michelle Steels congressional races, Iowa for the campaigns of Gov.",
    "The other thing she says voters will never forget is what happened in Afghanistan last August when the U.S. left the country so chaotically that 13 soldiers lost their lives and thousands of Afghans were left behind after having taken risks to aid American soldiers.",
    "And that's something that we've got to push Republicans really hard because seeing this return of earmarks was devastating and is not OK in a time of such heavy inflation when families are seeing higher prices at the grocery store, seeing more at the gas pump.",
    "And if you remember, it was coming from an economic frustration: It was 'taxed enough already,' it was 'government needed to get out of our way,' it was the fact that elected officials weren't listening and that the American public was frustrated,\" she said.",
    "Last year, she went to Virginia to support Glenn Youngkin for governor and was one of the few, if any, national Republican figures who went to New Jersey and recognized the insurgent candidacy of Jack Ciattarelli, who nearly pulled off a huge upset.",
    "Haley said it's not just because she credits Palin for taking her over the finish line in her primary race for governor in 2010, but also because Haley recognizes Palins influence in attracting women into the conservative movement.",
    "One of the papers reported when she came to South Carolina for me that it was the 'rock star sisterhood,' so this is one of the sisters going back and saying thank you to the other rock star sister, to say, You know what?",
    "And I think we've got to go back to that strong, core, conservative movement that says, 'We the people still get to be in control of what happens in our own lives  not mandates, not regulations, not government spending.'\"",
    "Haley says the public is moving rightward in its views about chaos at the border, inflation, crime, how the White House handled Afghanistan, and education but that Republicans need to be prepared to offer solutions.",
    "The former ambassador to the United Nations and South Carolina governor has spent the past few months not discussing herself but instead conservative candidates running for office with voters across the country.",
    "She argued that Republicans must have a better plan, saying, You better prove that you deserve to be there, and you better be willing to fight for all the things that you talked about in a campaign.",
    "It's a coalition in which she has been active since she first ran for governor of South Carolina in a 2010 primary against four establishment rivals, right at the dawn of the Tea Party movement.",
    "When he was running in the presidential primaries in South Carolina in 2016, she was more often a critic than a supporter, yet despite that tension, he named her as his choice for the U.N. job.",
    "Its those principles, and the fears over rising crime, open borders, skyrocketing inflation, and energy concerns, that she says are driving new voters, such as Hispanics, toward the Right.",
    "Haley said that while Republicans have an opportunity to make big gains in this years midterm elections, she said their message cannot simply be about saying no to President Joe Biden.",
    "I feel for every military family, and it is no coincidence that we are seeing the highest level of suicide rates among our military since the Afghanistan withdrawal, she said.",
    "In the days following the Jan. 6 Capitol riot, she, like many Trump supporters, expressed her frustration, but she also has no problem giving him a nod on things he got right.",
    "I mean, my parents just can't believe all of this illegal immigration that's happening because they put in the time, they put in the price, they came here the right way.\"",
    "People very much want to protect the reasons that they came here or their grandparents or parents came here, and they want to make sure they do what they can,\" she added.",
    "South Carolina native Bruce Haynes says Haley differentiated herself from many of the rising stars of the Tea Party by sustaining her trajectory through accomplishments.",
    "Not only that, she added, but you gave the Taliban the biggest housewarming gift you ever could by leaving all of our equipment, all of our ammunition, tons of cash.",
    "\"If you look at my parents, they are no different than any other immigrants who come here legally with such a love for America and all the freedoms it has to offer.",
    "It is also a goal that keeps Haley, who has never lost a race for elective office, front and center with the party base in states across the country.",
    "We have to make sure that we remember what it means when you allow government in your life because once they do, they start to take more and more.",
    "One of the most high-profile candidates to whom she has paid it forward is former Republican vice presidential nominee and Alaska Gov.",
    "Sarah Palin, whom Haley vigorously supports for the House seat that opened following the death of longtime Alaskan Rep. Don Young.",
    "It's paying it forward, as I always like to say it, said Haley, speaking of the work she is doing with her Stand for America PAC.",
    "I look at Republicans as being the party of really going back to the basics of what our country was intended to be,\" she said.",
    "She instead turns to talking about the conservative movement and how its people have been ridiculed in the press for years.",
    "Her goal is to encourage people to vote for candidates she believes best embody the populist conservative coalition.",
    "Kim Reynolds and Reps. Randy Feenstra and Mariannette Miller-Meeks, and Texas for House candidate Beth Van Duyne.",
    "Haley, like many supporters of former President Donald Trump, has an up-and-down relationship with his style.",
    "That has to be the Republican cause as we go forward, and we have to fight for the American family, she said.",
    "When you put in two decades, the military sacrificed for America to have honor,\" said the former ambassador.",
    "Of course, this would help her if she decides to run in the Republican presidential primary contest in 2024.",
    "\"We sacrificed for America to stand with our allies who stood shoulder to shoulder with us for two decades.",
    "Immigrant families are very aspirational, and that is part of being a conservative,\" Haley said.",
    "But most Trump supporters arent in the national spotlight being questioned about him endlessly.",
    "I'm going to do whatever it takes to help Palin get back to where she needs to be,' Haley said.",
    "Haleys husband, Michael, is a commissioned officer in the South Carolina Army National Guard.",
    "And they're going to go back to say, 'What is it that's happening in our education system?'",
    "\"And reminding everyone that government was never intended to be all things to all people.",
    "She continued, If you were a wealthy family, your kids could go to a private school.",
    "These people are now going to fight for school choice harder than they ever did.",
    "And they stand with the moral compass of ... never [leaving] an American behind.",
    "He said to me  he said, Nikki, it's not that Biden wanted to leave Afghanistan.",
    "They've gotten back into wanting government to be part of things,\" she said.",
    "\"They've gotten back into forgetting what it means to protect our freedoms.",
    "In January 2012, he shipped out for a yearlong tour of duty in Afghanistan.",
    "But anyone like where I was raised in rural South Carolina, you were stuck.",
    "We're traveling all over the country, helping other candidates get elected.",
    "I think the spirit of that is embraced by communities across the country.",
    "\"And that's why they're so appalled by what's happening at the border.",
    "If you look at the last time we had a movement, it was the Tea Party.",
    "They're going to fight for charter schools harder than they ever did.",
    "Haley's parents immigrated to the United States from Punjab, India.",
    "Its getting things done, and we have to commit to doing that.",
    "You're going to see more homeschooling than you ever have.",
    "She thinks much of the Republican Party has lost its way.",
    "The establishment has gotten back into that spending.",
    "If a president wants to leave, that's fine.",
    "Because you have to make this right.",
    "All of that went out the window.",
    "You helped me when I needed it.",
    "I watched my husband's face.",
    "He said, It's how he left.'",
    "I saw what happened.",
    "Just In...",
    "All of it."
  ]
}