{
  "id": 7702,
  "mediaId": 129,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Sections",
  "image": "https://static01.nyt.com/images/2022/04/22/lens/22onpolitics-morganthau/22onpolitics-morganthau-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/21/us/politics/rhode-island-house-race-democrats.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Rhode Islands political culture is famously insular and suspicious of perceived outsiders  so much so that Brett Smiley, a candidate for mayor of Providence who has lived in Rhode Island for 16 years, began his campaign kickoff speech last month by nodding to the fact that he grew up in Chicago.",
    "She has an impressive rsum: degrees from Barnard College and Columbia Law School, and stints at senior levels in the Peace Corps, the Department of Homeland Security and at Nardello & Company, a private security and investigations firm.",
    "When The Providence Journal asked candidates in the race to answer a series of trivia questions about Rhode Island, Morgenthau gave an answer that was nearly identical to a Wikipedia entry  and the newspaper called her out for it.",
    "Although she grew up in Boston and New York, she notes in a video announcing her candidacy that she married her husband in the backyard of the Morgenthau familys summer home in Saunderstown, a village north of Narragansett.",
    "Florida stands poised to revoke Disney Worlds longtime designation as a special tax district, as Republicans moved swiftly to punish the company for its opposition to a new education law that opponents call Dont Say Gay.",
    "What to read\nRepublican Party leaders privately condemned Donald Trump after Jan. 6 and vowed to drive him from politics, Jonathan Martin and Alex Burns reveal in an exclusive excerpt from their forthcoming book.",
    "Then came a brutal encounter early this month with a local television anchor, Kim Kalunian, who asked if Morgenthau had ever lived in the state for an entire year or enrolled her children in school there.",
    "In 2000, Clinton took a gamble by running for Senate in New York despite never having held elective office, growing up in Illinois and living for many years in Arkansas while her husband was governor.",
    "On several occasions, with the help of local Democratic Party officials, Clinton even stayed overnight in the homes of complete strangers, where she was known to pitch in on household chores.",
    "David Fahrenthold and Keri Blakinger take a look inside Crime Stoppers of Houston, a traditionally nonprofit institution that has become a mouthpiece for conservative talking points on crime.",
    "A clip of the exchange rocketed around Rhode Islands tightly knit Democratic political class, which is nervously watching the race to succeed Representative Jim Langevin, who is retiring.",
    "That family connection led Sarah Morgenthau to push the Biden administration to recognize the Armenian genocide, an initiative that won her a laudatory write-up by Politico in April 2021.",
    "While Langevin won re-election relatively easily in 2020, some Democrats fear that in a weak year for their party, a candidate lacking local ties could help hand the seat to Republicans.",
    "She had some major advantages: universal name recognition as first lady, an overwhelmingly Democratic electorate and a lackluster opponent in Rick Lazio, the Republican candidate.",
    "She also spoke about a commitment to public service that has been instilled in me since I was a young girl at the kitchen table, a theme she has highlighted while campaigning.",
    "Other out-of-state candidates  like David McCormick, Ozs chief Republican rival in Pennsylvania, as well as Herschel Walker in Georgia  have faced similar scrutiny this year.",
    "When Sarah Morgenthau entered the race for the open congressional seat in Rhode Island, she had to answer an age-old question in American politics: Are you really from here?",
    "People are very rooted in their communities, said Rich Luchette, a longtime aide to Representative David Cicilline, who represents the states other congressional district.",
    "Lazio tried hard to capitalize on the issue; an account of his campaign rollout in Time magazine said that he flashed his New York pedigree almost as often as his teeth.",
    "Clinton, reportedly a lifelong Chicago Cubs fan, was also pilloried for doffing a Yankees cap when the team came to the White House to celebrate its World Series win.",
    "In an interview, she emphasized her extensive experience in Washington and described herself as someone who will go through a brick wall if I need to get things done.",
    "Its Republicans, not Democrats, who are talking about the supposed failings of American democracy on the campaign trail, Reid Epstein and Jonathan Weisman write.",
    "Her solution, the brainchild of the pollster Mark Penn, was a listening tour of New Yorks 62 counties during the summer of 1999, as she weighed an official run.",
    "During a visit to an electronics plant outside Binghamton, protesters held signs that said Hillary Go Home and Hillary: Go Back to Arkansas, You Carpetbagger.",
    "She was national co-chair of Lawyers for Biden, a prolific fund-raiser and a volunteer on national security policy groups for the campaign, Politico reported.",
    "She also hired a team of experienced New York operatives, led by Howard Wolfson and Bill de Blasio, to help her navigate Manhattans vicious tabloid press.",
    "We purposely designed the events to be small groups, to listen to what people were worried about, recalled Patti Solis Doyle, Clintons campaign manager.",
    "I have been paying property taxes in the Second District for 40 years, Morgenthau replied, though she conceded that the answer to both questions was no.",
    "The fight song of the University of Rhode Island begins, Were Rhode Island born and were Rhode Island bred, and when we die well be Rhode Island dead!",
    "Mehmet Oz, a leading Republican candidate for Pennsylvanias open Senate seat, grew up in Wilmington, Del., and has lived for many years in New Jersey.",
    "A mere two years before running, Oz invited People magazine for a photo shoot inside his 9,000-square-foot mansion overlooking the Manhattan skyline.",
    "More than 95 percent of Morgenthaus campaign donations have come from out of state, The Boston Globe has noted, versus 27 percent of Magaziners.",
    "Henry Morgenthau Sr., her great-grandfather, documented the Armenian genocide as the U.S. ambassador to the Ottoman Empire during World War I.",
    "Being out of state isnt necessarily fatal, said Joe Caiazzo, a Democratic consultant who ran Hillary Clintons campaign in the state in 2016.",
    "She served as a surrogate who was frequently quoted in national publications about the trajectory of the race or the temperature of donors.",
    "Empire state of mind\nThere is a successful playbook for running as a carpetbagger  and it was drawn up by none other than Hillary Clinton.",
    "But it was the upstate listening tour, much mocked at the time, that ultimately allowed her to shrug off the accusations of carpetbagging.",
    "I think the way its being handled is fatal, because it highlights the lack of local connectivity, which is so important in Rhode Island.",
    "In 1988, Ruth Morgenthau ran for office in Rhode Island as a Democrat, losing to Representative Claudine Schneider, a Republican.",
    "Little wonder, then, that Morgenthau has faced incessant questions about her Rhode Island credentials from the local news media.",
    "A tight-knit political culture\nMorgenthau has much to prove in the months before the Democratic primary election on Sept. 13.",
    "And an impressive family: Her mother, Ruth, was a scholar of international politics and an adviser to President Jimmy Carter.",
    "He has since claimed his in-laws house in the Philadelphia suburbs as his residence, according to The Philadelphia Inquirer.",
    "Morgenthau, a lawyer who left a top Commerce Department job to run for office as a Democrat, does have ties to Rhode Island.",
    "While work has pulled us elsewhere, Rhode Island is the place that has remained constant in all of our lives, she says.",
    "Clintons rejoinder was to emphasize her familiarity with subjects important to New Yorkers, and to outwork Lazio.",
    "I may be new to the neighborhood, she said during her announcement speech, but Im not new to your concerns.",
    "Shell have to overcome the local favorite in the race, Seth Magaziner, who is the states general treasurer.",
    "He has already secured the backing of several major unions, and has so far outraised the rest of the field.",
    "But Clinton had never lived in New York, and she knew her lack of roots in the state would be a problem.",
    "The events were so devoid of drama that eventually, they lulled the press to sleep, Solis Doyle said.",
    "Sarah Morgenthaus uncle was Robert Morgenthau, the famed longtime district attorney for Manhattan.",
    "Her grandfather Henry Morgenthau Jr. was President Franklin Roosevelts secretary of the Treasury.",
    "None of it might matter if Morgenthau cant answer that question  Are you really from here?",
    "Its common in the state to see bumper stickers that say, I Never Leave Rhode Island.",
    "I have lived and worked elsewhere and know that what we have here is special.",
    "Running for office in a state where you havent lived is a delicate art.",
    "Carpetbaggers Raise an Age-Old Question: Do Voters Really Care?",
    "Like more and more people, I chose Providence, Smiley said.",
    "On paper, Morgenthau is an impressive candidate.",
    "By the end, she said, they were bored to tears.",
    "Blake\nIs there anything you think were missing?",
    "She said very little and took a lot of notes.",
    "Morgenthau is well aware of the skepticism.",
    "to the satisfaction of Rhode Island voters.",
    "Theres a resistance to change of any kind.",
    "The listening tour did not always go well.",
    "But their opposition faded quickly.",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "Wed love to hear from you.",
    "She isnt the only one."
  ]
}