{
  "id": 7707,
  "mediaId": 129,
  "date": "d2022-04-20T00:00",
  "headline": "Herschel Walkers Senate Bid in Georgia Is Powered by Fandom",
  "image": "https://static01.nyt.com/images/2022/04/19/multimedia/00pol-walker-photo01/00pol-walker-photo01-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/04/20/us/politics/herschel-walker-georgia-senate.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1098,
    1136,
    5956,
    571,
    584,
    2555,
    2672,
    2747,
    2934
  ],
  "sentences": [
    "Mr. Warnock, the freshman Democrat, has raised more than $13 million in the last three months, according to campaign finance data, and he will be backed by national Democrats eager to prove their 2020 victories were more than just a rejection of former President Donald J. Trump, but instead were a permanent shift in a rapidly changing Southern state.",
    "Its Herschel, Herschel, Herschel  he doesnt even have to have his last name, said Gail Hunnicutt, a Walker fan since he dominated the University of Georgia football program from 1980 to 1982, winning the Heisman Trophy and unending adoration from many in football-obsessed Georgia.",
    "It would be nice to have him be in a debate and he should sharpen his skills before he goes, Ms. Steele, the secretary of the Republican Party in Heard County, north of LaGrange, said in an interview after Mr. Walkers remarks.",
    "But unlike Mr. Trump, Mr. Walker eschews large events and spends most of his time at private fund-raisers, listening sessions and small-scale grass-roots events with limited media access.",
    "Debra Jo Steele, a county party official who attended Mr. Walkers event on Monday wearing a navy blue Trump cap, asked Mr. Walker directly why he did not attend the Senate debate.",
    "Mr. Walker campaigns as both a political outsider and a celebrity, drawing comparisons to Mr. Trump, whose friendship and early endorsement have lifted Mr. Walkers prospects.",
    "I go into these cities and give people hope, Mr. Walker said on Monday in an interview at the meet-and-greet in LaGrange, a small town about an hour south of Atlanta.",
    "In speeches, he zigzags from hot-button issues such as transgender students participation in high school sports, to riffs on the mechanics of his campaign.",
    "Gary Black, the state agriculture commissioner and next highest-polling candidate in the Senate race, is the loudest Republican voice against Mr. Walker.",
    "In his book published in 2008 and later interviews, he attributed past erratic and threatening behavior to a diagnosis of dissociative identity disorder.",
    "Mr. Walker hasnt denied the allegations, but he and his campaign have denied accusations made by two other women who say he threatened and stalked them.",
    "Mr. Walker is a risky choice for a Republican Party desperately trying to win back a Senate seat lost in the states Democratic wave two years ago.",
    "He obviously had a very public fall with mental health and has gotten back up, said Mallory Blount, a spokeswoman for Mr. Walkers campaign.",
    "It was a campaign stop for a Senate candidate, but for many Georgians who came to see Herschel Walker, politics was hardly the only draw.",
    "Blacks candidacy, Defend Georgia, has said it plans to help spend millions on ads carrying a similar message, though none have aired.",
    "Mr. Walker may be on track for victory in the May 24 primary, but he faces a harder challenge against Senator Raphael G. Warnock.",
    "Blacks campaign launched a website detailing the accusations of violence, complete with a two-minute advertisement listing them.",
    "He has been accused of domestic abuse and has acknowledged violent thoughts as part of his past struggles with mental illness.",
    "If Herschel Walker is the nominee for the Republican Party in Georgia, the race will be about Herschel Walker Mr. Black said.",
    "Im doing both, Mr. Walker said, alluding to some Republicans concerns about his appeal to Democratic and independent voters.",
    "He skipped the first primary debate in April and has not committed to attending another scheduled for May 3.",
    "Mr. Black has tried to highlight Mr. Walkers turbulent past and argue that he is unelectable in the fall.",
    "He has made exaggerated and false claims about his business success, according to local news reports.",
    "When asked if she could see herself supporting any other Republican in the race, she replied quickly.",
    "But little of this seems to matter to the Republican voters embracing his Senate primary campaign.",
    "He campaigns with no fear of his primary opponents and all the confidence of an all-star athlete.",
    "He has never held elected office, and he lived in Texas for the better part of the last decade.",
    "And his public speeches are characterized by unclear and sometimes meandering talking points.",
    "Despite his war chest, Mr. Walker has not yet bought any television or radio advertisements.",
    "If he wins the primary, hes going to have a debate, Im sure, with the Democratic contender.",
    "Hes adjusted to every circumstance in every situation, where he was, said Ms. Hunnicutt.",
    "If Im the nominee, the race will be about Raphael Warnock and why we should fire him.",
    "Recent polls show Mr. Walker winning nearly two-thirds of Republican primary voters.",
    "Their goal is to pull Mr. Walker below a 50 percent threshold, forcing a runoff.",
    "Several in the crowd hushed her down and yelled for him to call on someone else.",
    "Mr. Walkers ex-wife has accused him of attacking and threatening to kill her.",
    "In less than nine months as a candidate, he has amassed $10 million in cash.",
    "The people that want to try to deny they know who I am arent from Georgia.",
    "Mr. Walker said he was out of town, receiving a business leadership award.",
    "Mr. Walkers one-name-only fame has propelled him to the top of the field.",
    "But even some Republicans worry their party is being blinded by fandom.",
    "Im wondering why he wants to jump into the mess of Washington politics.",
    "Most came dressed in University of Georgia jerseys, hats and T-shirts.",
    "For some Republicans, that explanation is part of Mr. Walkers appeal.",
    "The senators called and said, Herschel can you raise the money?",
    "That has prompted some supporters to question his strategy.",
    "And its just kind of arrogant not to be on the stage.",
    "When I decided to run a lot of people called.",
    "Herschel can you get people to cross over?",
    "Mr. Warnocks campaign declined to comment.",
    "Some carried footballs and framed posters.",
    "Most everybody in Georgia knows who I am.",
    "But were proud to have him there.",
    "A super PAC supporting Mr.",
    "And I know who they are.",
    "No, she said.",
    "In March, Mr.",
    "Lets be real.",
    "LaGRANGE, Ga."
  ]
}