{
  "id": 7709,
  "mediaId": 195,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "National Right to Life endorses Herschel Walker",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/03/walkerherschel_092521_ap-ben-gray_black-candidates.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/3273383-national-right-to-life-endorses-herschel-walker/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Natalie Prieb",
  "authorUrl": "https://thehill.com/author/natalie-prieb/",
  "termIds": [
    815,
    1136,
    1147,
    5997,
    232,
    342,
    428,
    571,
    2672
  ],
  "sentences": [
    "The National Right to Life Committee (NRLC) pointed to Walkers support for various anti-abortion issues in the statement endorsing him, including his opposition to using tax dollars to pay for abortions or fund abortion providers.",
    "Herschel Walker will be a most effective champion for unborn babies and their mothers in Washington and he has demonstrated the passion and perseverance it takes to win the critically important Georgia Senate race.",
    "Walker, a former professional football player who received former President Trumps endorsement shortly after he entered the race last summer, is a front-runner in Georgias GOP Senate primary, set for May 24.",
    "The bill was endorsed by the White House last week and would statutorily protect both a persons ability to seek an abortion and the ability of health care providers to provide abortion services.",
    "President Biden narrowly won the state in 2020, and Warnock, as well as Sen. Jon Ossoff (D-Ga.), won their seats in extremely tight runoff races in January 2021.",
    "Georgia deserves a pro-life senator like Herschel Walker who is committed to building a culture of life, Tobias said in the NRLCs endorsement announcement.",
    "A Hill-Emerson College poll conducted earlier this month showed that Walker is narrowly leading Warnock among Georgia voters in a head-to-head race.",
    "The organization also highlighted Walkers opposition to the Womens Health Protection Act, which his opponent Sen. Raphael Warnock (D) co-sponsored.",
    "National Right to Life is pleased to endorse Herschel Walker for the U.S. Senate, Carol Tobias, the organizations president, said in a statement.",
    "Walkers stance for life stands in stark contrast to the out-of-touch record of Warnock who supports abortion for any reason until birth.",
    "Republican Georgia Senate candidate Herschel Walker received an endorsement Tuesday from a prominent anti-abortion organization.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "The Georgia Senate race is set to be one of the most-watched midterm races in the country.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}