{
  "id": 7715,
  "mediaId": 124,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Armenian Americans rally in opposition to Oz's Pennsylvania Senate bid",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220318-mehmet-oz-mjf-1213-e9c932.jpg",
  "link": "https://www.nbcnews.com/politics/politics-news/armenian-americans-rally-opposition-ozs-pennsylvania-senate-bid-rcna24084",
  "sentiment": "0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "After Biden recognized it, finally, after all these years of efforts, were really concerned about Oz, because we know the power of Turkish lobbying and Turkish interests in U.S. politics, said the founder of the United Armenian Fund, Harut Sassounian, the publisher of an Armenian newspaper in Glendale, California, which is known as \"Little Armenia.\"",
    "It isn't unusual for foreign policy disputes to enter U.S. political races  for example, questions about China and Hong Kong or about Israel and the Palestinian territories have been fixtures in U.S. elections  but the race is emerging as the highest-profile example of the Old World fights being transmuted into American politics.",
    "Oz has dismissed the question as reminiscent of slurs made in the past about Catholics and Jews, noting that President John F. Kennedy faced baseless accusations that he would be secretly loyal to the pope, while Jewish politicians have sometimes been subjected to similar questions about Israel.",
    "But some Armenian American leaders say Oz has failed to adequately answer questions about a 100-year-old dispute over the mass deportations and massacres of Armenians in the early 20th century Ottoman Empire, widely characterized as genocide, a description Turkey vigorously disputes.",
    "Critics have called attention to Ozs interactions with people and organizations linked to Turkish President Recep Tayyip Erdoan, who has been labeled a dictator, and critics like Turkish American NBA star Enes Kanter Freedom have accused Oz of being a foreign agent for Erdoan.",
    "He served in the Turkish military during medical school for just 60 days to meet the minimum requirement to retain Turkish citizenship, according to an op-ed he wrote, and he says he has continued to keep his Turkish passport to care for his ailing mother there.",
    "The U.S. ambassador to the Ottoman Empire at the time warned superiors in Washington that a campaign of race extermination is in progress,\" but Washington long avoided calling the event a \"genocide,\" as Turkey made it clear that doing so would risk its support.",
    "At the ceremony, Sassounian introduced himself and began to say something about how his ancestors who were killed a century ago would marvel to see them there, but Oz \"responded by strongly shaking his head as if he was disapproving,\" Sassounian said.",
    "His U.N. ambassador, Samantha Power, who wrote a hugely influential book about genocide before she entered government, tweeted, \"I am very sorry that, during our time in office, we in the Obama administration did not recognize the Armenian genocide.\"",
    "While the episode known as the Armenian genocide isnt well known to most Americans, the Ottoman Empires systematic destruction of its Christian minorities starting in 1915 paved the way to create an ethno-nationialist Turkish state.",
    "But prominent leaders of a minority group argue that his ties to Turkey demand further scrutiny as Oz, the celebrity physician who picked up the endorsement of former President Donald Trump, competes in the crowded Senate race.",
    "Karine Shamlian, a co-chair of the Armenian National Committee of Pennsylvania, said many in the community thought Ozs candidacy posed little threat before Trumps endorsement, because his campaign seemed to be sputtering out.",
    "For the better part of the last 100 years, we have been trying to wrestle the memory of the Armenian genocide out of Turkeys grip, said Aram Hamparian, the executive director of the Armenian National Committee of America.",
    "White House removes Dr. Oz and Herschel Walker from advisory panel after Senate runs\nMarch 24, 202200:17\nAt the root of their opposition to Oz is Turkey's insistence that what happened during World War I wasn't genocide.",
    "We have Armenians that are Republicans, Armenians that are Democrats, but when it comes down to things that affect the Armenian community and the Armenian diaspora, we rally regardless of the political party, she said.",
    "Turkey has long suppressed internal discussion of the events and retaliated diplomatically against other countries that recognize them more than 30 now do  despite copious evidence and the consensus of most scholars.",
    "Oz, who was born in Ohio to Turkish parents and holds dual U.S.-Turkish citizenship, has faced criticism from his rivals in the May 17 Republican primary and others about whether he has dual loyalties to Turkey.",
    "It took a century for the U.S. government to officially recognize an Armenian genocide  an atrocity Turkey has long denied despite the consensus of scholars and official recognition from more than 30 countries.",
    "Now, Armenian Americans worry that Turkey's campaign to deny the slaughter of 800,000 to 1 million Armenians during World War I would have a powerful champion inside the U.S. government if Oz joins the Senate.",
    "To Americans of Armenian descent, Oz is a famous Turkish American who has, over his long public career, seemed uncomfortable condemning an atrocity that is as important to them as the Holocaust is to Jews.",
    "WASHINGTON  Pennsylvania Senate hopeful Mehmet Oz has faced a barrage of questions and criticism from his Republican primary opponents about his initial refusal to relinquish his dual Turkish citizenship.",
    "Momjian, who said all four of his grandparents were born in Turkey, said the issue isnt about Oz's ethnicity but his lack of public acknowledgment that Turkey committed genocide.",
    "No one in this community will ever vote for Dr. Oz, said Mark Momjian, a prominent Philadelphia attorney and the former chair of the Armenian Center at Columbia University.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nThe killings inspired the coining of the word \"genocide\" and industrial-scale set a precedent.",
    "There appears to have never been a senator with dual citizenship, and U.S. government employees typically must revoke any foreign citizenship to gain security clearances.",
    "Dr. Mehmet Oz believes in the equality of all humans and I respect his desire to help the people of Armenia today, Batmasian said in a comment relayed by Ozs campaign.",
    "Asked for Ozs view, campaign spokesperson Brittany Yanick said in a statement: Dr. Mehmet Oz opposes genocide and the murder of innocent people in all forms.",
    "So when somebody is running for office who is close to the leader of that country, who has served in the military of that country  thats a three-alarm fire.",
    "Former President Barack Obama, for instance, promised he would recognize it as genocide during his campaign but backtracked once he was in office.",
    "Shamlian recalled that her grandmother was telling stories about her experience in the genocide until she died just three years ago at 109.",
    "However, Marta Batmasian, an Armenian American real estate investor and former adjunct professor of Middle Eastern studies, defended Oz.",
    "It took until 2019 for the House and the Senate to pass resolutions recognizing the episode as genocide after earlier attempts failed.",
    "Having a U.S. senator who denies the truth of the Armenian genocide should be very concerning to anyone who cares about human rights.",
    "Dr. Oz has been on TV for years, hes a well-known person, hes a celebrity, and Armenians everywhere know hes of Turkish origin.",
    "And President Joe Biden became the first U.S. president to formally recognize the mass killings as genocide just last year.",
    "Dr. Oz looks forward to those important discussions, as well as helping the three million people of Armenia today.",
    "He was raised secularly, played football and married a Christian woman, raising their children in that faith.",
    "We feel that this Senate seat is in jeopardy of being controlled by a foreign government, quite honestly.",
    "It asserts that the number of deaths has been inflated and that those who died were victims of civil war.",
    "We have what our president has called a genocide taking place in real time in Ukraine, Momjian said.",
    "But for Shamlian, the co-chair of the Pennsylvania Armenian community, its not about politics.",
    "We are convinced that he is part of a denial campaign when it comes to the Armenian genocide.",
    "Allies have rejected questions about Ozs Turkish heritage as racist and as dog whistles.",
    "Oz, the son of immigrants, has said his upbringing is emblematic of the American Dream.",
    "Sassounian and Oz both received an award honoring successful immigrants in 2008.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "I believe the relationship between Turks and Armenians have improved.",
    "So its caught the eye of Armenians in all 50 states, Sassounian said.",
    "Ozs campaign didnt respond to a specific question about the incident.",
    "\"Who, after all, speaks today of the annihilation of the Armenians?\"",
    "The evils of World War I should be commemorated, Yanick continued.",
    "Oz relented and said he would give up his formal ties with Turkey.",
    "His campaigns response didnt use the words \"Armenian genocide.\"",
    "Adolf Hitler told his generals before the Nazis invaded Poland.",
    "He would be the first Muslim elected to the Senate.",
    "The events by the Ottoman Turks were horrible.",
    "For me, this is personal, he said."
  ]
}