{
  "id": 7717,
  "mediaId": 43,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Midterms will be a heavy lift for the Senate GOP. One super PAC is already shelling out $141 million",
  "image": "https://images.dailykos.com/images/1036064/story_image/GettyImages-1238302006.jpg?1644433675",
  "link": "https://www.dailykos.com/story/2022/4/19/2092754/-McConnell-aligned-PAC-makes-record-early-investment-to-boost-raft-of-misfit-candidates",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nNerding out on redistricting, with Nathaniel Rakich\nThe Downballot\nFollowShare\n0:0059:53\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nThe truth is, Senate Republicans are tantalizingly closejust one seat awayto retaking the majority in a historically favorable environment, and yet they will be trying to carry a bunch of Trumpian misfits across the finish line.",
    "Here's where the GOP's Senate Leadership Fund has planned its initial investments:\nGeorgia (offense): $37 million\nNorth Carolina (defense): $27 million\nPennsylvania (defense): $24 million\nNevada (offense): $15 million\nWisconsin (defense): $15 million\nArizona (offense): $14 million\nAlaska (defense): $7.4 million\nThis is a short blurb about Daily Kos.",
    "And if fundraising is any measure, Senate Democrats have a fighting chance in November, with their four most vulnerable senatorsRaphael Warnock in Georgia, Mark Kelly of Arizona, Catherine Cortez Masto of Nevada, and Maggie Hassan of New Hampshireall surpassing the hauls of their leading GOP challengers.",
    "Take the PAC's heaviest commitment of $37 million in Georgia, where Republicans have one of their best pickup chances but are saddled with alleged wife abuser Herschel Walker, who has written about his struggles with violent episodes partially fueled by his multiple personalities.",
    "The Senate Leadership Fund's $141 million ad buy outpaces the Democratic Senate Majority PAC's early investment of $106 million by some $35 million, but it's not exactly a show of strength despite what the head of the Republican super PAC would have us believe.",
    "So Senate Republicans brightest pickup hope maintains a couple-point edge in polling, but hes carrying a load of personal baggage and is being significantly outraised by his opponent.",
    "Law admitted as much, saying Democratic candidates' advantages in fundraising nearly across the board necessitated the Senate GOP super PAC to try to level that playing field.",
    "A super PAC aligned with Senate Majority Leader Mitch McConnell has made a record-breaking amount of ad reservations, mostly starting in August, for the 2022 midterm election.",
    "Walker reported strong Q1 fundraising of $5.5 million, but it pales in comparison to the whopping $13.6 million raised by Democratic incumbent Sen. Raphael Warnock of Georgia.",
    "The only thing that ever concerns me when youre in an environment thats this good, and theres so much talk about the red wave, is that complacency sets in, Law said.",
    "Listen and subscribe to Daily Kos Elections The Downballot podcast with David Nir and David Beard\nx\nx\nYou need to enable JavaScript to run this app.",
    "However, both the McConnell- and Schumer-aligned super PACs will surely pour additional funds into the races depending on how they take shape.",
    "This is such a strong year that we need to invest as broadly and deeply as we can, Senate Leadership Fund President Steven Law told Politico.",
    "All that context puts a slightly different spin on the GOP's heavy investment in Georgia from show of strength to sign of concern.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Interestingly, Hassan didn't make the Leadership Fund's top target list after the GOP failed to recruit New Hampshire Gov.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "But the president of Democrats' Senate Majority PAC had a different take on the hefty Republican spending in 2022.",
    "\"The GOP carries the burden of bad candidates and a badly damaged brand,\" noted JB Poersch.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Even so, Law insists Senate Republicans are still huge favorites this fall.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Chris Sununu to run for the seat.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}