{
  "id": 7721,
  "mediaId": 63,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Checks And Imbalances: The Reporter's Notebook Edition",
  "image": "https://imageio.forbes.com/specials-images/imageserve/625defac93e452fcfca2adc7/0x0.jpg?format=jpg&crop=2110,1187,x0,y0,safe&width=1200",
  "link": "https://www.forbes.com/sites/zacheverson/2022/04/19/checks-and-imbalances-the-reporters-notebook-edition/",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zach Everson",
  "authorUrl": "https://www.forbes.com/sites/zacheverson/",
  "termIds": [
    815,
    979,
    1147,
    1385,
    1577,
    2303,
    2349,
    5725,
    101,
    183,
    2590,
    2934
  ],
  "sentences": [
    "Stitt at Mar-a-Lago (KTUL News Channel 8)\nJared Kushner Flaunted His Influence With Saudi Arabia, Russia in Pitch to Investors (The Intercept)\nEditors Picks\nDocumented Obtains List of 2020 Donors to Ginni Thomas Group That Supported Trumps Attempted Coup (Documented)\nRussian Legislator and Two Staff Members Charged with Conspiring to Have U.S. Citizen Act as an Illegal Agent of the Russian Government in the United States (Department of Justice)\nJamie Dimon, other JP Morgan executives donated to centrist Democrat Kyrsten Sinema (CNBC)\nManchin visits Alberta as the Canadian province ramps up US lobbying amid energy crisis (OpenSecrets)\nFollowing a Campaign Legal complaint, the FEC penalized two LLCs for funneling $200K in secret funds to a super PAC and the super PAC for accepting the illegal funds.",
    "(Twitter/Matt Corley of Citizens for Responsibility and Ethics in Washington)\nBiden to hold first road fundraisers of presidency (Axios)\nEx-Rep. Pete King registers as lobbyist for facility accused of torturing children (LegiStorm)\nGyms, restaurants, music venues among those seeking billions in pandemic relief (The Hill)\nBank records shed light on dark-money group in Florida ghost candidate scandal (Tampa Bay Times)\nHerschel Walker Claims to Own Companies That Dont Exist (The Daily Beast)\nAn 83-year-old California man was sentenced to 3.5 years in prison after stealing more than $250,000 by pretending to raise money for Bernie Sanders, Beto ORourke and others (Insider)\nIn Closing\nI own that so I pay myself (ha ha!)",
    "Alex Jones Infowars Site Files For Bankruptcy  Here Are The Lawsuits That Led To Millions In Legal Fees\nThree companies owned by far-right radio host Alex Jones, who was found liable last November for spreading false claims about the Sandy Hook elementary school shooting, filed for bankruptcy, reports Madeline Halpert for Forbes:\nFar-right website Infowars and two other firms owned by Jones, IWHealth and Prison Planet TV, have filed for Chapter 11 bankruptcy, according to filings in the U.S. Bankruptcy Court for the Southern District of Texas.",
    "(Twitter/Shane Goldmacher of The New York Times)\nCitadels Griffin Rises as Top GOP Donor, Urges Business Leaders to Join Him (The Wall Street Journal)\nTax cut provision Sen. Johnson pushed for delivered windfall to his two biggest donors (Twitter/Justin Elliott)\nBillionaire Peltz draws GOP megadonors to $5,000-a-plate fundraiser for Democrat Sen. Joe Manchin (CNBC)\nMehmet Oz loaned his campaign $5.85m last quarter, and over $11m since joining the race in Nov.accounting for nearly all of the $13m thats come into his campaign fund.",
    "(Politico)\nTom Suozzi faces possible ethics probe over his reporting of stock investments (The New York Post)\nA bipartisan group of 19 lawmakers is laying out 3 key parameters for a stock trading ban following the House's first hearing on the issue (Insider)\nSecond ethics probe of Mooney demonstrates rare level of investigative scrutiny (The Charleston Gazette-Mail)\nWhile Rep. Kevin Hern (R-Okla.) advocates for a stronger US response to Russia, he also owns defense contractor stocks Lockheed Martin and Raytheon.",
    "He has raised just $2.4m from donors, and $1.7m last quarter (Twitter/Jonathan Tamari of The Philadelphia Inquirer)\nMcCormicks Q1 haul in PA GOP primary (Axios)\nNew FEC filings reveal that a mysterious group called Defending America Together that uses an Arizona PO box address poured millions into super PACs with $3 million to the Pennsylvania Conservative Fund and $2 million to America's Promise, which gave $3M to Alabama Patriot PAC.",
    "PAC reported paying four people in a cost-share agreement with the pro-Trump dark money group MAGA Policies, Inc. last quarter: former acting members of Trumps cabinet Richard Grenell and Matthew Whitaker, former Florida Attorney General and Trump advisor Pam Bondi and Cassidy Kofoed, the 24-year-old daughter of Richard Kofoed, a major Trump donor who lived large despite having financial difficulties.",
    "(Twitter/Unusual Whales)\nThe Slime Machine Targeting Dozens of Biden Nominees (The New Yorker)\nHow the Koch machine works (Popular Information)\nFighting Trump, Dems launch plan to elect thousands of local election supervisors (Politico)\nAmmon Bundy pays himself thousands in campaign cash (Boise State Public Radio)\nHow often do American PACs straight up give money to foreign governments?",
    "Other campaigns that reported spending money at Trump properties in their latest quarterly reports include the following:\nRep. Mary Miller (R-Ill.), who Trump endorsed in January, made what appears to be her campaigns first-ever payment to a Trump property in March when it paid $17,000 for catering and event space at Mar-a-Lago.",
    "In this case, its the Lincoln Project giving $11,500 to the Ukraine military (Twitter/Roger Sollenberger of The Daily Beast)\nOracle founder Larry Ellison is the sole funder of the super PAC backing former Mike Pompeo spokesperson Morgan Ortagus in her Tennessee congressional run.",
    "The move comes several months after a judge ruled Jones was liable for defamation after the families of several victims killed in the Sandy Hook elementary school shooting sued Jones and his media outlet Infowars in Connecticut for perpetuating claims the tragedy was a hoax.",
    "Reps. Greene And Gaetz Direct $25,000 In Campaign Funds To Big Lie Peddler John Eastman\nReps. Marjorie Taylor Greene (R-Ga.) and Matt Gaetz (R-Fla.) have directed $25,000 in campaign funds to John Eastman, a proponent of Trumps Big Lie who spoke at the January 6 rally.",
    "(Politico)\nA federally registered super PAC called Americans for Secure Elections PAC that is running Facebook ads promoting OH Secretary of State Frank LaRose (and attacking his opponent) got all of its funding, more than $1 million, from dark money groups.",
    "Watch: Byron Donalds Speaks To Forbes About Midterms, Energy, And The Inner Workings Of Congress\nIntriguing Investments\nThe campaign for Rep. David Schweikert (R-Ariz.) reported paying a filing fee of $125,000 in February to the FEC.",
    "(Twitter/Brendan Fischer of Documented)\nDocuments Show US Rep. Kai Kahele Has A Special Deal With Hawaiian Airlines (Civil Beat)\nThe House Ethics committee is launching an investigation into one of its own members: John Rutherford.",
    "Among the latest developments: the January 6 committee interviewed Trump advisor Stephen Miller and the New York attorney generals office filed a motion in its investigation to compel testimony from a business partner of Trumps.",
    "Previews Bribery Defense: No Personal Benefits (The New York Times)\nThe lobbyists who gave to GOP frontrunners for Ways and Means chair (Politico)\nRep. Madison Cawthorns cash situation is even more bleak upon closer inspection.",
    "Tracking Trump\nThe gubernatorial campaign for Arizona Republican Kari Lake reported spending another $34,000 at Mar-a-Lago in the first three months of 2022, bringing its total disbursements at Trump properties to $90,000.",
    "Watch: Where Some Of The Biggest Lawsuits And Investigations Against Donald Trump Stand\nContinuing Irresolutions\nUpdates on Checks & Imbalances previous reporting\nThe campaign of former Rep. Jeff Fortenberry (R-Neb.)",
    "Greenes campaign paid Eastmans Constitutional Counsel Group $10,000 in January, while Greene and Gaetzs Put America First fundraising committee paid the firm $15,000 in the last four months of 2021.",
    "Californias state bar announced in March that it too was investigating whether Eastman engaged in conduct in violation of California law and ethics rules governing attorneys regarding the election.",
    "In recent months, the campaign made a couple of high-profile gaffes, namely using political funds to pay for Boeberts personal rent and filing a report that mistakenly said she represented Utah.",
    "The $3,000 payments continued into January 2022, according to a report filed on Friday, but the campaign didnt report any disbursements to Michele in February and just $1,500 in March.",
    "Both Richard and Cassidy were on the private flight Richard booked that whisked Trump advisor and Don Jr.s girlfriend Kimberly Guilfoyle out of D.C. on January 6, reported ProPublica.",
    "Trump pours money into a midterm race for the first time (Politico)\nMar-a-Lago Machine: Trump as a Modern-Day Party Boss (The New York Times)\nHe Couldve Taken Down the Trump Org.",
    "(Twitter/Teddy Schleifer of Puck News)\nProtect Our Future, the super PAC started by crypto billionaire Sam Bankman-Fried, raised $14 million in the first few months of this year.",
    "A spokesperson for the State Bar of California confirmed its investigation into Eastman is active but said state statutes prevent the organization from otherwise commenting.",
    "The campaign of former Director of National Intelligence and Congressman John Ratcliffe (R-Texas) continued to pay his wife to manage its sleepy books last quarter.",
    "Kelly Tshibaka, a Trump-endorsed Republican running against Sen. Lisa Murkowski (R-Alaska), spent $14,000 at Mar-a-Lago on facility rental and catering.",
    "In 2021, Ratcliffes committee reported paying $11,000 for website design to that technology firm, which created a site for his private-sector ventures.",
    "A partner at the Rockwall, Texas law firm of Lamberth Ratcliffe Covington, her total take from her husbands campaign over the past year is $34,500.",
    "In November, the Houses January 6 committee subpoenaed Eastmans records and testimony about his efforts to overturn the 2020 presidential election.",
    "*****\nRep. Lauren Boebert (R-Colo.) changed campaign treasurers, according to a filing it made with the Federal Election Commission on Thursday.",
    "Thanks For Reading Checks & Imbalances\nThis is the April 18, edition of the Checks & Imbalances newsletter, sent Mondays and Thursdays.",
    "Not reporting any disbursements at Trump properties in the first three months of 2022: the senate campaign for Rep. Mo Brooks (R-Ala.).",
    "Trumps PAC Pays Trumps Club $318,000\nFormer President Donald Trumps political action committee paid Mar-a-Lago $318,000 this February.",
    "Dr. Eastman is one of the leading constitutional attorneys in the country, a spokesperson for Greenes campaign said in a statement.",
    "sold $50k in a stock, adding he had no information related to this transaction that is unavailable to members of the public.",
    "Forbes continues to update Tracking Trump: A Rundown Of All The Lawsuits And Investigations Involving The Former President.",
    "(Twitter/Anna Massoglia of OpenSecrets)\nThis super PAC is spending almost $1 million in a contentious Democratic primary.",
    "Trumps club in Palm Beach has received at least $1.8 million in payments from federal political committees since 2016.",
    "Fortenberry has now directed a total of $778,000 of campaign funds to the law firm that represented him in his trial.",
    "Citing Brookss unwillingness to keep trying to overturn the 2020 election, Trump withdrew his endorsement in March.",
    "A month earlier, Schweikert agreed to pay the FEC a civil penalty of that same amount for misusing campaign funds.",
    "Richard Kofoed denied any knowledge of what work his daughter performs for the groups or how she landed the job.",
    "This is the first time that the FEC has penalized LLCs and super PACs for making and receiving straw donations.",
    "Starting in March 2021, the campaign began paying Michele Ratcliffe $3,000 a month for compliances services.",
    "(Twitter/Congress Trading)\nFor the first time, a Congressperson is addressing unusualness on stock trades.",
    "Trump endorsed Lake in September and featured her as a speaker at his rally in Arizona earlier this year.",
    "Payments to Mrs. Ratcliffe comprised 71% of the campaigns spending in the first three months of the year.",
    "The particular issues for which we sought his advice are protected by attorney-client privilege, however.",
    "None of the parties involved in the transactions provided any details about what work Eastman performed.",
    "Each of the three felony counts he was convicted of carries a maximum penalty of five years in prison.",
    "In July, Brooks issued a statement saying he wanted to do fundraisers at Mar-a-Lago as often as I can.",
    "The payment was the PACs largest disbursement of the quarter and comprised 23% of its total spending.",
    "His campaign hasnt reported making disbursements there, or at any other Trump property, since then.",
    "When we need advice on significant constitutional issues, we have occasionally sought his counsel.",
    "Also, the campaign did not report any additional payments to Telegraph Design last quarter.",
    "As of March 31, his campaign has $50,000 of cash on hand and $60,000 in outstanding debts.",
    "I am not privy to any information related to her position nor do I discuss this with her.",
    "So just over $115k in true cash  despite raising $3.5 million this cycle overall.",
    "It doesnt say Bankman-Fried  but rather a Las Vegas LLC that is a trust company.",
    "All told, the pro-Trump groups have paid Cassidy at least $32,000 since October.",
    "I have nothing to do with my adult daughters employment, he wrote in an email.",
    "Max Miller, a former White House advisor to Trump, paid $12,000 for catering.",
    "Today, we look at findings from a fresh batch of campaign finance reports.",
    "In March, Fortenberry was found guilty of lying to federal investigators.",
    "Eastman declined to comment further, citing attorney-client privilege.",
    "spent $598,000 on legal services in the first three months of 2022.",
    "Gatez and Eastman referred to the statement from Greenes campaign.",
    "A spokesperson for Boeberts campaign did not respond to inquiries.",
    "Please support this work, if you can, by subscribing to Forbes.",
    "(The Daily Beast)\nTrump hosting fundraiser for [Oklahoma] Gov.",
    "Boebert replaced her campaigns compliance support in January.",
    "(Twitter/Teddy Schleifer of Puck News)\nEx-New York Lt. Gov.",
    "Our filings speak for themselves, Gaetz wrote in an email.",
    "Former President Trumps Make America Great Again, Again!",
    "Spokespeople for Trump did not respond to inquiries.",
    "It appears she may have taken a pay cut though.",
    "And you can follow me on Twitter at @z_everson.",
    "To make sure you dont miss an issue, subscribe.",
    "They dont want you to know who is funding them.",
    "Welcome to the Checks & Imbalances newsletter.",
    "He resigned from Congress the following week.",
    "The campaign has not responded to an inquiry.",
    "But he also has almost $127k in unpaid bills.",
    "Neither Ratcliffe responded to an inquiries.",
    "The payments were first reported by Insider.",
    "His sentencing is scheduled for June 28.",
    "Prior to that year, it took in $54,000.",
    "Email me at zeverson@forbes.com.",
    "Yes, he has $242k cash on hand.",
    "Rep Jake Auchincloss (D-Mass.)",
    "Now Hes Taking the Blame.",
    "Any tips or suggestions?",
    "The group's donor?",
    "Jeezy, I Got Money",
    "Its free.",
    "Thanks!"
  ]
}