{
  "id": 7728,
  "mediaId": 239,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "The rise of Black conservatives is breaking the left",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/18/B3-HUNT1_c0-395-5000-3310_s885x516.jpg?231cbf3cfb642bb38077612cca935100768ed51f",
  "link": "https://www.washingtontimes.com/news/2022/apr/18/the-rise-of-black-conservatives-is-breaking-the-le/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wesley Hunt",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "I dont blame Mr. Mystal, The Nation magazine or the Democrat Party for pushing the panic button and seeing over 100 Black Republicans, like myself, run for federal, state and local office has to make them nervous  especially because we are winning.",
    "Whom I choose to support for president, what I choose to believe or what values I hold certainly does not change the color of my skin or my connection to the Black community, but it does change the way the left views my skin.",
    "Its no coincidence that Mr. Walker and other prominent Black conservatives find themselves in the crosshairs of the left just as Mr. Biden records some of the lowest approval ratings among Black Americans in history.",
    "They will have you believe that the GOP is not the party of opportunity for all Americans, yet Black, Hispanic and Asian Americans have joined the Republican Party in droves over the last 16 months.",
    "This intellectually lazy, vile and hate-filled hit piece on Herschel Walker demeans Black excellence and contributes to the Democrat Partys divisive ideology that all Black people are monolithic.",
    "There is so much to unpack in Mr. Mystals attack on the free-thinking Black American, but one thing that stands out immediately is the timing of his piece published in The Nation.",
    "Mr. Walker achieved the American dream, and now hes fighting to preserve that dream for future generations in Georgia, yet the lefts woke mob is trying to dismantle him.",
    "Whenever the left fails to win arguments based on values and policy, theres usually an irrational and highly flawed appeal to emotion just around the corner.",
    "Explain how I was able to win a Republican primary by over 25% in a predominantly white majority Texas Congressional seat, against eight white men.",
    "In fact, according to a recent Quinnipiac University Poll, Mr. Bidens approval ratings among some minorities and independents are now in the 20s.",
    "Black conservatives represent everything the left claims does not exist, and to preserve their narrative, they demean us and censor our voices.",
    "Today, theyre perfectly acceptable as long as they are uttered by a left-wing race-baiting author all in the name of cultural progressivism.",
    "Black conservative leaders like Sen. Tim Scott, Mr. Walker, J.C. Watts and Paris Dennard are an existential threat to the lefts narrative.",
    "OPINION:\nIn a recent op-ed published by The Nation, Elie Mystal writes one of the most egregious and racist articles I have ever read.",
    "The Democrat Party, along with the Biden-Harris administration, is rapidly losing credibility, especially with minority voters.",
    "Democrats may think they own our minds due to the color of our skin, but we were born free, and we will act accordingly.",
    "Who, as a candidate, reminded us, if you have a problem figuring out whether youre for me or Trump, then you aint Black.",
    "What I take issue with is personally attacking Black conservatives because our values dont align with their demands.",
    "If the Republican Party is what Mr. Mystal and other progressive race-baiters claim, then explain how we exist.",
    "Calling Mr. Walker an animated caricature of a Black person, sure doesnt seem like a logical argument to me.",
    "Its a Black insult to progressive leftists who yearn for the days of 19th-century thinking, like Mr. Biden.",
    "Dont let Democrats fool you, they only care about diversity if you share their liberal political ideology.",
    "Which party is fighting to save Black lives from on-demand abortions that target the Black community?",
    "Just look at the facts and ask yourself, which party is fighting to preserve the traditional family?",
    "Now despite what Mr. Biden, Mr. Mystal or others might believe, Ive been Black my whole life.",
    "Despite what Mr. Mystal may say, Mr. Walkers candidacy is not a white insult to Black people.",
    "Wesley Hunt is the Republican nominee for Congress in Texas District 28.",
    "Once upon a time, views like this would be considered racist.",
    "Which party is fighting for the rights of biological women?",
    "He is married with two daughters and a U.S. Army veteran.",
    "Which party is standing up for fatherhood?",
    "Follow him on Twitter at @WesleyHuntTX.",
    "The Republican Party.",
    "A white Democrat."
  ]
}