{
  "id": 7733,
  "mediaId": 238,
  "date": "d2022-04-17T00:00",
  "headline": "Who's giving to Trump's super PAC",
  "image": "https://newsletter-imgs.s3.amazonaws.com/prod/the-202s/primary/early.svg",
  "link": "https://www.washingtonpost.com/politics/2022/04/18/who-giving-trump-super-pac/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1147,
    1434,
    2305,
    2395,
    5726,
    5974,
    427,
    571,
    2850
  ],
  "sentences": [
    "Hes okay with that  Paul Schwartzman on John Fetterman: A Democrat in gym shorts tries to rally blue votes in Trump country  Missiles strike Lviv as Ukrainian forces refuse to surrender in Mariupol  but first \nUkrainian leaders have in recent days signaled that Russias destruction of Mariupol could derail peace negotiations, putting an end to the war even further out of reach.",
    "Tough crowd: Florida Sen. Rick Scott has been publicly dressed down by Republican leader Mitch McConnell, privately rebuked by his colleagues and repeatedly accused of running the National Republican Senatorial Committee in a way that benefits his own future over the candidates he was hired to get elected, our colleagues Michael Scherer and Josh Dawsey report.",
    "Among Congressional Leadership Funds other top donors: Griffin, who gave $7.5 million (and who told the Wall Street Journals John McCormick that hed given more than $18 million in total to five conservative groups this year); the investor Charles Schwab, who gave $1.5 million; and the Home Depot co-founder Bernard Marcus, who gave $1.2 million.",
    "Among the super PACs top donors in the first three months of the year: Caryn Borland, whose support for the QAnon conspiracy theory led former vice president Mike Pence to cancel a 2020 fundraiser that she and her husband were set to host for him, and the trash collection mogul Anthony Lomangino, each of whom gave $250,000.",
    "They include Rep. Lucy McBath (D-Ga.), whos facing a tough primary after Republicans drew her into the same district as Rep. Carolyn Bourdeaux (D-Ga.); Carrick Flynn, whos running for a new House seat in Oregon; and Jasmine Crockett, whos running to succeed retiring Rep. Eddie Bernice Johnson (D-Tex.).",
    "But during the seven weeks of turmoil since Scott dropped a provocative conservative policy bomb on an unsuspecting party  a plan that called for tax increases and expiration dates for all federal laws, including those establishing Social Security and Medicare  he has not once expressed regret.",
    "Here in Adams County, Pa., which borders Maryland, 66 percent of voters went for President Donald Trump in 2020  about the same that voted for him in 2016, and 3 percent more than went for Mitt Romney, the Republican nominee in 2012, our colleague Paul Schwartzman writes.",
    "He has directed a sizable share of his fundraising as NRSC chair to his own accounts, while shifting digital revenue away from Senate campaigns and buying ads promoting himself that look all but identical to spots he does for the national committee.",
    "Sen. Raphael Warnock (D-Ga.) had $25.6 million on hand on March 31, Sen. Mark Kelly (D-Ariz.) had $23.3 million, Sen. Catherine Cortez Masto (D-Nev.) had $11.1 million and Sen. Maggie Hassan (D-N.H.) has $7.6 million.",
    "John Fetterman, 52, who is the purported Democratic front-runner for the coveted U.S. Senate seat being vacated by retiring Republican Sen. Patrick J. Toomey, has made a show of not giving up on the red counties.",
    "The candidates in the races that will determine who controls the Senate next year  along with the many of the super PACs supporting them  filed their latest campaign finance disclosure on Friday.",
    "While Trumps political operation has more than twice as much cash on hand as the Republican National Committee does, the biggest Republican donors arent directing their efforts to helping Trump.",
    "The flagship super PACs on the Democratic side  Senate Majority PAC and House Majority PAC  file their disclosure reports monthly instead of quarterly, so no new donors were revealed on Friday.",
    "More than a dozen additional donors gave at least $100,000 to the super PAC, including the Texas oil magnate S. Javaid Anwar and Kent Hance, the Republican lobbyist and former congressman.",
    "As rural counties grow redder and redder, some Democrats have focused on winning over suburban swing voters turned off by Trumpism and trying to maximize turnout in Democrat-heavy cities.",
    "Some of the same Republican donors are funding a super PAC backing the former hedge fund executive David McCormick in the contentious primary to succeed retiring Sen. Pat Toomey (R-Pa.).",
    "Stephen Schwarzman, the billionaire chairman and chief executive of Blackstone, gave $10 million to Senate Leadership Fund, the flagship super PAC backing Republican Senate candidates.",
    "The super PAC brought in $4.3 million in the first quarter of the year  a fraction of the $19 million that Trumps Save America Joint Fundraising Committee raised in the same period.",
    "The four Democratic senators facing the toughest reelection races this year  two of whom have been in the Senate for barely a year  have all built up massive campaign accounts.",
    "I had a Resist sticker on my car that I took off because I dont want to deal with the harassment, Marty Wilder, a Democratic Party leader in McKean County, told Schwartzman.",
    "In todays edition From our colleague Michael Scherer: With an aggressive fundraising effort and a controversial policy plan, Sen. Rick Scott has been upsetting colleagues.",
    "The crypto outfit Prime Trust LLC gave $14 million to Protect Our Future, a super PAC backed by Sam Bankman-Fried, the billionaire chief executive of a crypto exchange.",
    "Its donors included Griffin, who chipped in $2.5 million; Buckley, who gave $1.25 million; Singer, who contributed $1 million; and Schwarzman, who gave $500,000.",
    "Dmytro Kuleba, Ukraines foreign minister, said Sunday that the siege of the southeastern port city  which has killed thousands of civilians  may be a red line.",
    "Home Depot co-founder Ken Langone; the early Home Depot investor Walter Buckley Jr.; the hedge fund billionaire Paul Singer; and Chevron each gave $1 million.",
    "McCormick is facing Mehmet Oz  who secured Trump's endorsement this month  and Carla Sands, Trump's former ambassador to Denmark, in the Republican primary.",
    "Protect Our Future has spent more than $12.9 million so far on ads, direct mail and yard signs backing Democratic House candidates in a handful of races.",
    "Among Senate Leadership Funds other top donors: the hedge fund billionaire Ken Griffin, who gave $5 million, and Rupert Murdoch, who gave $2 million.",
    "Do you know how many people have come to me and asked me, before they vote, what my opinion is on something and whether its good for my state?",
    "While many of them tout their fundraising halls well ahead of the deadline, there are always surprises tucked away in the reports themselves.",
    "Instead, the former hospital chain CEO and two-term governor, the richest man in the Senate, argues that he owes his detractors nothing.",
    "And former Nevada attorney general Adam Laxalt, whos leading in polls of the Republican Senate primary there, had $2.2 million on hand.",
    "Today's the day: President Biden, Vice President Harris and their spouses will participate in the White House Easter egg roll.",
    "(Axios' Lachlan Markay has a helpful rundown of where some of the other single-candidate super PACs are raising their money.)",
    "He kicked in another $10 million to Congressional Leadership Fund, the super PAC supporting Republican House candidates.",
    "These are the places where Trump campaign signs still sit in front yards and banners hang from flagpoles and porches.",
    "has a crucial advantage: Unlike Trumps PAC, the super PAC can accept massive checks from Trumps richest backers.",
    "Herschel Walker, whos likely to face Warnock in November, had $7.4 million in his campaign account on March 31.",
    "You cant, you shouldnt be doing this, he told Scherer and Dawsey in a recent interview at NRSC headquarters.",
    "The super PAC, Honor Pennsylvania, Inc., raised nearly $10 million in the first three months of the year.",
    "As Politicos Zach Montellaro reports, one of the top donors so far this year isnt a longtime megadonor.",
    "Inc. super PAC isnt the flagship of former president Donald Trumps political fundraising operation.",
    "Theyre giving to Republican super PACs seeking to win back the House and Senate this fall.",
    "My whole life has been people telling me that, you know, youre doing it the wrong way.",
    "Plus, on the edge of town, a banner on the side of a shed that says F--- Biden.",
    "Several are visible along Lincoln Highway, the road leading into Gettysburg.",
    "So did a company linked to the Texas road construction baron Doug Pitcock.",
    "Thats the trend in Pennsylvania, and in many parts of the country.",
    "Its pretty difficult being in such a minority.",
    "The man in gym shorts: Rural Democrats.",
    "But Make America Great Again, Again!",
    "The Make America Great Again, Again!",
    "Ive been up here for three years.",
    "Tips: earlytips@washpost.com.",
    "Thanks for waking up with us.",
    "Good morning, Early Birds.",
    "An embattled species.",
    "Its a crypto company.",
    "The muted minority.",
    "That would be zero.",
    "What were reading:"
  ]
}