{
  "id": 7740,
  "mediaId": 238,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "As the USFL restarts, a look back at the Washington Federals wild ride",
  "image": "",
  "link": "https://www.washingtonpost.com/sports/2022/04/15/usfl-washington-federals/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "They were just a very, very, very bad football team made out of a draft choice here and a spare part there, kind of one of those taxi cabs you see thats made of 16 different other cars, said David Remnick, the present-day editor of The New Yorker who covered the Federals for The Washington Post.",
    "Five weeks after Joe Gibbs helped bring the District its first professional football championship in 40 years, the Federals would make their debut against the Chicago Blitz and George Allen, the legendary Redskins coach making his return to the stadium he called home from 1971 to 1977.",
    "The teams 1984 opener against the expansion Jacksonville Bulls was even more humiliating than its 1983 debut and set the tone for what became its final season in D.C. After a 53-14 loss, the Federals primary owner, Berl Bernhard, compared his team to a group of untrained gerbils.",
    "The new league features many of the original teams  the New Jersey Generals, Birmingham Stallions, Philadelphia Stars  but not the Washington Federals, a hapless franchise both on and off the field, the kind of squad no league would want to revive or replicate.",
    "With the Federals, he shared a locker room with dreamers and misfits alike, including a fellow running back named Buddy Hardeman, who was arrested and charged with assaulting a District police officer just three days after the teams first game.",
    "D.C.s United States Football League franchise returned home from its first training camp in Jacksonville, Fla., still needing to overcome numerous barriers, including the fence around its practice field outside RFK Stadium.",
    "Late in the season, Bernhard agreed to sell the Federals to South Florida real estate developer Sherwood Woody Weiser, who planned to play in the Orange Bowl as the Spirit of Miami with Howard Schnellenberger as coach.",
    "The Federals, debuting in green, black and white with an eagle logo, failed to satiate the appetite of local fans, stumbling every step of the way to become the leagues worst team in their unique two-year run.",
    "Looking back almost 40 years later, the players who experienced the wild ride say getting to play the game they love with teammates they appreciated helped mask the on-field failures and off-field drama.",
    "However, the sale fell through when the league announced  at the behest of then-Generals owner Donald Trump  that it would compete directly with the NFL and stage its season in the fall.",
    "Guard Myke Horton and defensive back Don Burrell routinely took out their frustrations on each other throughout the 1983 season, disrupting practice with their scuffling and jawing.",
    "In search of George Allens agents of terror and espionage at the Federals first workout here yesterday, he pointed to a dark tower looming above the RFK Stadium practice field.",
    "Jauch, who made the jump to the USFL as the fourth-winningest coach in Canadian Football League history, had a rather cavalier approach to coaching, according to McQuilken.",
    "Headlined by reigning Heisman Trophy winner Herschel Walker, the first USFL also played a spring schedule and remains the last league to give the NFL a run for its money.",
    "Despite entering 1984 with hopes of improving on a disastrous first season, Washingtons sophomore campaign somehow turned out even worse, as the Federals finished 3-15.",
    "James recalled one particularly low moment when the team bus broke down and the players were stranded on the side of the road, struggling to hail cabs in full uniform.",
    "Perhaps pairing a strait-laced 22-year-old star with a 32-year-old barhopping quarterback three years removed from the NFL as roommates was not the best decision.",
    "Over the first two USFL seasons, the Federals managed a league-worst 7-29 record, while their fellow RFK Stadium tenants went 22-3 in the preceding seasons.",
    "James, one half of SMUs Pony Express backfield tandem that also included future Hall of Famer Eric Dickerson, wouldve been a first-round pick in the NFL.",
    "Sometimes I said, You know, half my teammates just got out of prison, and the other half were heading toward prison,  James joked in a recent interview.",
    "Billy [Kilmer] introduced me to all the bartenders in Georgetown, McQuilken said, and I introduced Craig James to all the same bartenders in Georgetown.",
    "The Federals were tasked with charting their own path in the shadows of a new NFL dynasty but failed to meet those expectations in spectacular fashion.",
    "The Federals lost their inaugural game, 28-7, in front of a national television audience and more than 38,000 curious souls who made the trip to RFK.",
    "The men, wearing yellow USFL staff windbreakers, said they were league film crew personnel and were given free rein to record the Federals practice.",
    "Being in Washington with the Redskins, thats a tough environment to come in there and try to steal some fans, former quarterback Mike Hohensee said.",
    "I did quickly come to understand that was a very poor strategy on [the Federals] part because all McQuilken taught me to do was how to break curfew.",
    "We had a padlock on it, and we had to hop over the fence, climb the fence to get onto the practice field, former running back Craig James recalled.",
    "That team was just a s---show, said Jeff Pearlman, author of the 2018 book Football for a Buck: The Crazy Rise and Crazier Demise of the USFL.",
    "Enthusiasm quickly dwindled as pouring rain spoiled almost every 1983 home game and the bumbling play failed to rouse many repeat customers.",
    "The franchise had hoped to catch on in a football-crazed region and build on the popularity of the burgeoning Washington Redskins dynasty.",
    "Maybe if we had more success early on, maybe we would have put a lot more people out in the stands because it is a good football town.",
    "The Renegades carried on the Federals losing tradition, managing a 5-13 record in 1985, which would be the final season of USFL 1.0.",
    "For the Federals, that meant some players lived on the fringe of the NFL while others were tiptoeing on the fringe of society.",
    "The feuding players remained on the ground for a few seconds before getting up with the entire team bursting out in laughter.",
    "Jauch was fired three days later and replaced by Bielski, his offensive coordinator, who had played and coached in the NFL.",
    "We could have had the Redskins coaching staff come over and coach us  I dont think we were going to win football games.",
    "The Federals colorful cast of characters proved to be unconventional and unpredictable  and it wasnt just the players.",
    "The Federals were eventually sold to businessman Don Dizney that October and rebranded as the Orlando Renegades.",
    "Trying to get his teams attention, Jauch turned to motivational techniques not found in most coaching manuals.",
    "Almost four decades after the USFL made its debut, the league returns this weekend with a full slate of games.",
    "Reaching into the right pocket of his green jacket, he pulled out a gun and barked, Ive had enough of this!",
    "The week of their season opener, Allen sent two Blitz employees to Washington, according to Pearlmans book.",
    "In the middle of one practice, as Burrell and Horton went at it again, the coach put himself between them.",
    "He would show up for practice and he would have his golf clubs in the back of his car, McQuilken said.",
    "And he left the assistant coaches like [offensive coordinator] Dick Bielski to conduct the meetings.",
    "And he pulls out the blanks and he shoots both of them, former wide receiver Joey Walters recalled.",
    "Years later, the hulking lineman morphed into Gemini on the hit TV game show American Gladiators.",
    "There was really nothing set up that would have said we were going to have success, James said.",
    "I vividly remember times when practice was over  where Ray would say he was going to play golf.",
    "USFL rosters were mainly composed of NFL castoffs sprinkled with some promising rookies.",
    "But thats exactly what Federals Coach Ray Jauch did with James and Kim McQuilken.",
    "Ray Jauch was looking for spies, a March 1, 1983, Washington Post article began.",
    "This old veteran, he had partying on his mind and I was trying to play football.",
    "Beset by a 10-game losing streak, the Federals finished the 1983 season 4-14.",
    "I know not all the USFL teams had that experience, but it felt like the NFL.",
    "Every once in a while hed pull out a golf club and swing a golf club.",
    "What the Federals lacked in talent, they made up for in personality.",
    "I wanted that job like I wanted a disease, Bielski told Pearlman.",
    "F---, the team couldnt put out for a decent pair of sweat socks.",
    "And then you just freeze then, like, What in the world he did?!",
    "And as it turned out, Hortons future was in front of a camera.",
    "Id been in the NFL for 21 years, and now I was in the minors.",
    "Fan interest had peaked with the Federals 1983 season opener.",
    "He walks in late at night and he opens the door, James said.",
    "And then they just got their asses kicked and that was it.",
    "That first Federals game was a huge deal, Pearlman said.",
    "Maybe they should have went into [acting] or something.",
    "They were poorly organized, poorly run, poorly managed.",
    "I turn the light on and I meet him for the first time.",
    "We didnt have some of the talent other teams had.",
    "Nothing seemed to go right, on or off the field.",
    "That, to me, set the bar in terms of respect.",
    "I can remember that like that was yesterday.",
    "The only bad experience I had: We didnt win.",
    "We needed to have more success than we did.",
    "Jauch, Burrell and Horton were in cahoots.",
    "They never recovered from that first game.",
    "Im like, This is an old man Im with here.",
    "Jauch should have trusted his instincts.",
    "It was another sign of things to come.",
    "My experience was good, Walters said.",
    "It was a lot of fun, McQuilken said.",
    "We were just a poorly stocked team.",
    "We didnt have a great, deep roster.",
    "We played in the Redskins stadium.",
    "The tension was officially broken.",
    "That overshadows everything else.",
    "But it was a great experience.",
    "It was just a total s---show.",
    "He was really good at that.",
    "Jauch saw an opportunity.",
    "They carried it on well.",
    "It felt like the NFL.",
    "We should have known.",
    "And hes an old man.",
    "Hes 32 years old.",
    "I shouldve known.",
    "It was horses---.",
    "It was big time.",
    "Fans didnt care.",
    "We didnt win.",
    "We got paid.",
    "Never."
  ]
}