{
  "id": 7743,
  "mediaId": 12,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Herschel Walkers campaign raises $5.5M for Senate bid",
  "image": "https://www.ajc.com/resizer/qh8U6w-B4I9Hwn9kRtroy1BWCxs=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/7FY5WK3WKXZR3ZTF4POK3O6BYU.jpg",
  "link": "https://www.ajc.com/politics/politics-blog/herschel-walkers-campaign-raises-55m-for-senate-bid/SYH4V27JENDAVDQ27Z6B23WTPA/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815
  ],
  "sentences": [
    "Walkers sky-high name recognition has helped him remain atop the GOP polls despite new scrutiny into his past, including reports that have detailed violence incidents against women, a pattern of exaggerating his business record and falsehoods about his academic experience.",
    "Hes ignored his GOP rivals and skipped debates and forums, running his campaign as if hes in cruise control ahead of the May 24 showdown against rivals including Agriculture Commissioner Gary Black, contractor Kelvin King and former Navy SEAL Latham Saddler.",
    "Walkers Republican opponents have criticized his campaign strategy, accusing him of trying to run an autograph tour and warning that his background would render him unelectable in November against the Democratic incumbent.",
    "If theres one thing Im good at, its putting my head down and going to work, Walker said in a statement, adding: The Republican nominee against Warnock will have to raise money and bring new voters to the table.",
    "But Warnock faces an uphill battle as he tries to rebuild the fragile electoral coalition that fueled his victory in 2021 amid rising inflation and souring approval ratings for President Joe Biden.",
    "Republican Senate front-runner Herschel Walker said his campaign committees amassed $5.5 million the first three months of the year for his bid to unseat Democratic U.S. Sen. Raphael Warnock.",
    "And Walker, who has raised nearly $15 million since launching his bid, has demonstrated he can raise the cash to compete with the Democrat in a general election if he wins the nomination.",
    "But Walker might wind up with one of the highest fundraising totals of any Republican U.S. Senate candidate -- and is expected to far outpace his GOP Senate rivals in Georgia.",
    "We have the resources to tell Georgians why they need to fire Senator Warnock, said Walker campaign manager Scott Paradise, and thats exactly what well do through November.",
    "A former football player, Walker has led his GOP primary opponents in every poll since he entered the race with former President Donald Trumps endorsement.",
    "Walkers campaign Friday said he received donations from more than 50,000 donors from all 50 states and ends the quarter with roughly $7.4 million on hand.",
    "Warnock defeated former U.S. Sen. Kelly Loeffler in a 2021 special election runoff, part of a Democratic sweep that flipped the Senate.",
    "Since then, hes also landed support from Senate Minority Leader Mitch McConnell and key Georgia figures.",
    "With a 50-50 split in the U.S. Senate, Georgia could once again determine control of the chamber.",
    "The campaigns haul lags behind Warnock, who collected $13.6 million during the first quarter.",
    "His GOP opponents had yet to disclose their latest fundraising figures."
  ]
}