{
  "id": 7748,
  "mediaId": 129,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "The U.S.F.L. Isnt Back. The U.S.F.L. Is Here.",
  "image": "https://static01.nyt.com/images/2022/04/14/sports/14usfl2/merlin_205503870_7ede53ab-cec8-4497-b03f-a7818835d71f-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/04/15/sports/football/usfl-faq.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    792,
    815,
    5804,
    5871,
    5976,
    5990,
    6020,
    6027,
    5621,
    5661
  ],
  "sentences": [
    "Other recent efforts  the United Football League (four seasons), the Fall Experimental Football League (two seasons), the Alliance of American Football (less than a season) and the second iteration of the XFL (less than a season, though it plans to return next year under new leadership)  stalled fairly quickly, despite showy launches and piles of talent.",
    "They include Jeff Fisher (Panthers), who led the Tennessee Titans to the Super Bowl in the 1999 season; Skip Holtz (Stallions), a longtime college coach and a son of Lou Holtz; and Kevin Sumlin (Gamblers), a former college coach at Arizona, Texas A&M and Houston.",
    "But its new leadership says that despite the nostalgic team and league names, this iteration of the U.S.F.L., which starts play on Saturday, wants to distinguish itself from the league that operated for three seasons in the mid-1980s.",
    "The reason for the single location is mainly financial, said Daryl Johnston, the former Dallas Cowboys fullback known as Moose who is the U.S.F.L.s executive vice president for football operations.",
    "That predecessor launched the professional football careers of Heisman Trophy winners like Herschel Walker and Doug Flutie, and future Hall of Famers like Reggie White, Jim Kelly and Steve Young.",
    "In an unusual twist, the opening game between the Generals and the Birmingham Stallions on Saturday at 7:30 p.m. Eastern time will be shown simultaneously on two broadcast networks, Fox and NBC.",
    "He also believes that this league has the timing right, not starting immediately after the Super Bowl as some spring leagues have and as the XFL hopes to do in 2023.",
    "About as big as names get is quarterback Paxton Lynch of the Michigan Panthers, who started four games for the N.F.L.s Denver Broncos in 2016 and 17.",
    "In addition to having the option of attempting a point after touchdown or a 2-point conversion, teams can line up from the 10-yard line to go for 3.",
    "The regular season will be followed by semifinals and finals on June 25 and July 3 in Canton, Ohio, site of the Pro Football Hall of Fame.",
    "will play a 10-week, 40-game regular season that will run from April 16 through June 19, getting a head start on the XFL, another N.F.L.",
    "draft last month and selected Shea Patterson, a quarterback who finished his college career in 2019 at the University of Michigan.",
    "players have yet taken advantage of that pro football gap year, though for the future, we see that being a value, Johnston said.",
    "The nicknames are familiar to those with long memories: the New Jersey Generals, the Philadelphia Stars, the Tampa Bay Bandits.",
    "Johnston said the league hoped to move the teams to their nominal home cities somewhere between the second and fourth seasons.",
    "Despite the eight teams city-specific monikers, all regular season games will be played in one location  Birmingham, Ala.",
    "Fox is an investor in the league, and games will be shown on various Fox and NBC networks and streaming platforms.",
    "Other players include Luis Perez (Generals), a former Texas A&M-Commerce quarterback who starred in the A.A.F.",
    "will experiment with some rules that differentiate their game from their long-established counterpart.",
    "The league requires players be two years removed from high school, a year less than the N.F.L.",
    "There have always been the players available to put football on in the spring, Johnston said.",
    "owners have sued the new league, claiming it has no right to the league and team names.",
    "The networks will work from one feed but have separate announcers and production crews.",
    "As an alternative to an onside kick, teams can try to convert a fourth-and-12 play.",
    "and XFL, and Jordan Taamu (Bandits) from the University of Mississippi and the XFL.",
    "Were providing an alternative route, he said, from college play to the pros.",
    "The names of some of the head coaches may be more familiar than the players.",
    "Its colorful history culminated with a hollow court victory over the N.F.L.",
    "Players will get $4,500 a week, and practice players will get $1,500.",
    "Each team will get three shots at the end zone from the 2-yard line.",
    "Dont football fans at that point want to get away from it for a bit?",
    "Overtime games will be decided by a shootout style competition.",
    "alternative league that plans to relaunch in February 2023.",
    "Can players skip college and jump straight to the U.S.F.L.?",
    "The big thing is the partnerships we have for distribution.",
    "There is no Walker or Donald Trump in the new U.S.F.L.",
    "My most important thing is getting to Year 2, he said.",
    "He noted that travel is a big cost for new leagues.",
    "The new league has said the suit is without merit.",
    "As other upstart leagues have done, the U.S.F.L.",
    "There are also victory bonuses of $850 per win.",
    "Whichever team reaches pay dirt more will win.",
    "If they make it, they will keep the ball.",
    "It cant get any better than Fox and NBC.",
    "Will there be any widely known players?",
    "We have a product we know gets ratings.",
    "Did I hear something about a lawsuit?",
    "In its new incarnation, the U.S.F.L.",
    "So is the league name: the U.S.F.L.",
    "Are there any unconventional rules?",
    "Will the U.S.F.L.s games air on TV?",
    "before the league folded in 1986.",
    "Were being fiscally responsible.",
    "What are the players being paid?",
    "Some of the original U.S.F.L.",
    "The Panthers had the No.",
    "1 choice in the U.S.F.L.",
    "Will the new U.S.F.L.",
    "games being played?",
    "Where are U.S.F.L.",
    "How about coaches?",
    "It has a shot.",
    "No U.S.F.L.",
    "he asked.",
    "last?",
    "No."
  ]
}