{
  "id": 7751,
  "mediaId": 1576,
  "date": "d2022-04-15T00:00",
  "headline": "Walker raises $5.5M in Georgia Senate race, trailing Warnock",
  "image": "https://www.wabe.org/app/uploads/2022/01/AP22026558617680-336x189.jpg",
  "link": "https://www.wabe.org/walker-raises-5-5m-in-georgia-senate-race-trailing-warnock/",
  "sentiment": "0.408",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1136,
    1312,
    2087,
    2230,
    146,
    232,
    428,
    571,
    2672
  ],
  "sentences": [
    "Football icon and Georgia Republican Herschel Walker said Friday that his U.S. Senate campaign had raised $5.5 million in the first three months of 2022, a big haul that is still dwarfed by the $13.6 million that Democratic incumbent Raphael Warnock raised in the same period.",
    "Other candidates in the GOP primary include Agriculture Commissioner Gary Black, Navy veteran and former bank executive Latham Saddler, construction company owner Kelvin King, former state Rep. Josh Clark and former Army general Jonathan Jon McColumn.",
    "Republicans had long dominated statewide races until Georgia helped elect Joe Biden to the presidency and enabled Democrats to control the Senate by electing Warnock and fellow Democrat Jon Ossoff in a January 2021 runoff.",
    "Martin Luther King Jr. preached, became Georgias first Black U.S. senator after winning a special election in 2020 to fill the unexpired term of Republican Sen. Johnny Isakson.",
    "His campaign did not immediately say Friday how much cash he had on hand, and Walkers campaign had not yet filed a report with the Federal Election Commission.",
    "Walker, a political newcomer, is a football icon who won the Heisman Trophy at the University of Georgia and went on to star in the NFL.",
    "Georgia will be a key battleground in the 2022 midterm elections to determine which party controls the U.S. Senate.",
    "Hes raised $43 million for this election cycle, after raising more than $125 million for his 2020 Senate race.",
    "The Republican nominee against Warnock will have to raise money and bring new voters to the table.",
    "In the Democratic primary, Warnock is a heavy favorite to defeat Tamara Johnson-Shealey.",
    "Walker is the GOP front-runner, but faces five other Republicans in the May 24 primary.",
    "Libertarian Chase Oliver will also be on the general election ballot in November.",
    "Walkers campaign said it received donations from more than 50,000 givers.",
    "None of the Republicans had announced or filed numbers by early Friday.",
    "A June 21 runoff, if necessary, would settle the Republican nomination.",
    "President Donald Trump, a close friend of Walkers, is backing his run.",
    "Isakson stepped down because of failing health; he died in December.",
    "Warnock, who is pastor of the Atlanta church where the Rev.",
    "Follow Jeff Amy on Twitter at http://twitter.com/jeffamy.",
    "Walker has raised $14.6 million since announcing his run.",
    "Warnock said Thursday that he has $25.6 million on hand.",
    "I am doing both, Walker said in a statement."
  ]
}