{
  "id": 7753,
  "mediaId": 129,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "As G.O.P. Candidates Face Accusations, Rivals Tread Carefully",
  "image": "https://static01.nyt.com/images/2022/04/15/us/politics/00pol-gopabuse-Hartzler-sub/00pol-gopabuse-Hartzler-sub-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/04/15/us/politics/republicans-accusations-women.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    904,
    1147,
    2365,
    3010,
    3918,
    5811,
    428,
    2799
  ],
  "sentences": [
    "Even in 2018, when women were widely seen as having delivered the House to Democrats in response to the Trump presidency, Republican women were no more likely to vote for Democrats than they had been two years before, said Erin C. Cassese, a professor of political science at the University of Delaware who studies womens voting patterns.",
    "Its a horrible problem; hell never be elected, and thats the educational process were going through right now, Gary Black, Georgias agriculture commissioner, said of domestic violence and assault allegations leveled at Herschel Walker, his Trump-backed Republican rival to take on Democratic Senator Raphael Warnock in November.",
    "On Thursday, a Republican state senator in Nebraska, Julie Slama, accused a leading Republican candidate for governor in that state, Charles Herbster, of sexually assaulting her three years ago when she was 22, saying in a statement that she had prayed I would never have to relive this trauma.",
    "Mr. Greitens resigned as Missouris governor after a hairdresser testified under oath in 2018 that he had taped her hands to pull-up rings in his basement, blindfolded her, stripped her clothes off and taken a photo of her, which he threatened to release if she revealed their affair.",
    "In February, she released an advertisement chiding her male rivals: We all know guys who overcompensate for their inadequacies, and that description fits the guys in the Senate race to a T.\nBut in an interview on Friday, she explicitly dismissed the issue of gender.",
    "Charges of misogyny, sexual harassment and even domestic abuse have become deeply partisan in terms of beliefs about what is acceptable and what is appropriate, said Kelly Dittmar, a professor at the Center for American Women and Politics at Rutgers University.",
    "Mallory Blount, a spokeswoman for Mr. Walkers campaign, said he emphatically denies the false claims from another woman who said he had been her longtime boyfriend and that when she broke up with him, he had threatened to kill her and himself.",
    "Eric Greitens is a toxic candidate unfit to hold office, Michael Hafner, a spokesman for Ms. Hartzlers Senate campaign, said, before declaring the central message of her campaign: Missouri family values, freedom, and taking back our country.",
    "It was widely believed that Mr. Trumps own confession, caught on an infamous video recorded for Access Hollywood, that he routinely grabbed women by the genitals  and the plethora of accusations that followed  would drive away women voters.",
    "Representative Billy Long, who is running in the Missouri Republican Senate primary, emphasized the $400,000 or so in costs, fines and penalties that state taxpayers have already shouldered for investigations into Mr. Greitenss activities.",
    "Mr. Walker, a former college and pro football star who has the backing not only of Mr. Trump but also much of the Republican establishment, has been accused by his ex-wife of attacking her in bed, choking her and threatening to kill her.",
    "In Missouri, Mr. Greitenss defiance spurred Rene Artman, who chairs the Republican central committee of St. Louis County, to organize other Republican women to pressure the party chairman, Nick Myers, to demand Mr. Greitens withdraw.",
    "In Missouri, Georgia, Ohio and now Nebraska, Republican men running for high office face significant allegations of domestic violence, stalking, even sexual assault  accusations that once would have derailed any run for office.",
    "The candidates who do speak of their opponents domestic violence and assault allegations often raise them not as disqualifications in looming Republican primaries, but as matters ripe for exploitation by Democrats in the fall.",
    "Mr. Greitens has blamed George W. Bushs former political aide, Karl Rove; the Senate Republican leader, Mitch McConnell; even the liberal philanthropist George Soros for the release of his ex-wifes abuse allegations.",
    "Political scientists who have studied Republican voting since the rise of Trumpism are not surprised that accused candidates have soldiered on  and that their primary rivals have approached the accusations tepidly.",
    "Max Miller, another Trump-backed candidate and a former White House aide running for an Ohio House seat, was accused by one of Mr. Trumps press secretaries, Stephanie Grisham, of hitting her the day they broke up.",
    "Mr. Walker has owned up to his mistakes, sought forgiveness, gotten treatment, and dedicated his life to helping others who are struggling, Ms. Blount said, condemning the media for surfacing past allegations.",
    "Amid his current Senate campaign, Mr. Greitens was accused last month in a sworn affidavit from his former wife that he had violently abused her and had hit one of their sons as his governorship unraveled.",
    "The #MeToo movement and the current debate over transgender rights and education are only widening the gap between Republican women and women who identify as Democrats and independents, Prof. Cassese said.",
    "One exception is Sean Parnell, Mr. Trumps pick for an open Senate seat in Pennsylvania, who suspended his campaign after his estranged wife testified that he had repeatedly abused her and their children.",
    "But in an era of Republican politics when Donald J. Trump could survive and thrive amid accusations of sexual assault, opposing candidates are finding little traction in dwelling on the issues.",
    "In this fiercely partisan moment, concerns about personal behavior are dwarfed by the struggle between Republicans and Democrats, which Republican men and women see as life-or-death.",
    "Eric Greitens last month, one of his Republican rivals for the states open Senate seat, Representative Vicky Hartzler, stepped up and called for him to end his campaign.",
    "In the Trump era, the men who are accused of wrongdoing have become adept at framing themselves as the victims of a broader conspiracy or an intolerant society.",
    "Still, a poll taken after the accusations came to light showed Mr. Greitens neck and neck with Ms. Hartzler and Eric Schmitt, Missouris attorney general.",
    "The accusations facing some Republican men are so stark that they raise the question: What would disqualify a candidate in a Republican primary?",
    "It used to be that being accused of domestic violence was an automatic disqualifier, regardless of party, Ms. Grishams lawyer, Adam VanHo, said.",
    "Mr. Miller denied the allegation, then sued Ms. Grisham for defamation, accusing her of making libelous and defamatory false statements.",
    "Theyre just bad candidates, she said of her opponents, adding that the mistreatment of women is not an issue that Im campaigning on.",
    "But in 2016, 88 percent of Republican women voted for Mr. Trump, just a percentage point below the share of Republican men who did.",
    "They certainly did it with Donald J. Trump and now theyre trying to do it with Charles W. Herbster, he told a local radio station.",
    "Jane Timken, the only woman in the Republican Senate primary in Ohio, has injected gender into the race  though delicately.",
    "For female candidates, appeals to gender solidarity or attacks on misogyny do not seem to work in Republican primaries.",
    "Increasingly, Republicans cast accusations of sexual misconduct as an attempt by liberals to silence conservatives.",
    "In several states, Republican candidates are contending with allegations of domestic violence and sexual assault.",
    "Then she moved on to an issue perhaps more resonant with Republican primary voters: transgender women in sports.",
    "Republicans running against those accused say they do see an opening, as long as its navigated carefully.",
    "WASHINGTON  When fresh allegations of domestic violence were lodged against former Missouri Gov.",
    "Ms. Blount also said he has denied a violent stalking charge by a Dallas Cowboys cheerleader.",
    "Its very hard to make those appeals, even for women candidates appealing to women, she said.",
    "Mr. Walker doesnt deny the assault and has said he was suffering from mental illness.",
    "Mr. Herbster denied the charges, claiming he was being targeted by political rivals.",
    "Im campaigning on the Biden failed policies of border security, inflation and jobs.",
    "Then theres the ongoing child custody fight between Mr. Greitens and his ex-wife.",
    "Political scientists are not surprised by Republicans tolerance for accusations.",
    "And to turn around and sue to silence your accuser was even more abhorrent.",
    "And now its fallen into the talk of cancel culture in the broader society.",
    "He linked himself to others who have beaten back similar accusations.",
    "When you take morals and God out of country, this is what happens.",
    "Electability is going to be the issue over the next six weeks.",
    "If domestic violence is proven true, hes toast, Mr. Long said.",
    "Theres a great desire for Republicans to get their seat back.",
    "Republican candidates, by and large, have remained defiant.",
    "Weve heard not a thing, not a thing, she said on Friday.",
    "Jazmine Ulloa contributed reporting from Athens, Ohio.",
    "His campaign did not respond to requests for comment.",
    "His campaign did not respond to requests for comment.",
    "I dont think you can blame this on Trump whatsoever.",
    "We dont have any sense of what messages might work.",
    "Few of their primary rivals want to talk about it.",
    "This is the breakdown of society.",
    "They did it with Brett Kavanaugh.",
    "Theyre not bad male candidates."
  ]
}