{
  "id": 7754,
  "mediaId": 19,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Mystal: Voters Need to Punish GOP for Putting Forward Clown Candidate Herschel Walker",
  "image": "https://media.breitbart.com/media/2019/08/Mystal88-640x335.jpg",
  "link": "https://www.breitbart.com/clips/2022/04/15/mystal-voters-need-to-punish-gop-for-putting-forward-clown-candidate-herschel-walker/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pam Key",
  "authorUrl": "https://www.breitbart.com/author/pam-key/",
  "termIds": [
    815
  ],
  "sentences": [
    "While reacting to Mystals column on Thursday on Fox News Channels Hannity, Walker said, I represent the people of Georgia, and Im not going to do what people tell me to do, and Im not going to have you to bully me because you cant.",
    "The Nations justice correspondent Elie Mystal said Friday on MSNBCs All In that Georgia Republican U.S. Senate candidate Herschel Walker is a clown candidate that voters should punish Republicans for putting forward.",
    "All Walker is trying to do is distract people from the fact that he does not have a policy plan and literally cannot articulate an energy policy or a COVID policy or any policy that matters to Georgia voters.",
    "I will debate or have lunch with or break bread with Herschel Walker the moment after he talks to the Senator from Georgia, Raphael Warnock, about actual issues affecting Georgia voters.",
    "He added, It is going to work for Republicans until voters start punishing them for putting forward these clown candidates.",
    "Mystal said, I will not waste the time of Georgia voters, helping Herschel Walker distract himself from their issues.",
    "We sit down and break bread because Im about bringing people together, not separating people.",
    "But what I would love to do for you to take the time to come down to Georgia.",
    "What it seems like you are is to separate people because of color.",
    "Thats not Herschel Walker."
  ]
}