{
  "id": 7763,
  "mediaId": 120,
  "date": "d2022-04-14T16:30",
  "headline": "Why Herschel Walker's constant lies aren't hurting him",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_15/3547138/220413-herschel-walker-an.jpg",
  "link": "https://www.msnbc.com/opinion/msnbc-opinion/why-herschel-walker-s-senate-bid-isn-t-hurt-his-n1294416",
  "sentiment": "-0.214",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zeeshan Aleem",
  "authorUrl": "https://www.msnbc.com/author/zeeshan-aleem-ncpn1235332",
  "termIds": [
    815,
    1136,
    1147,
    146,
    428,
    501,
    571,
    584,
    2672
  ],
  "sentences": [
    "According to the investigation, Walker has made false remarks relating to running the largest minority-owned food company in the United States; owning multiple chicken plants in another state; and starting and owning an upholstery business which was also, apparently, at one point in his telling, the countrys largest minority-owned apparel company.",
    "In March, the The Atlanta Journal-Constitution found that Herschel has made numerous false claims about the size of his companies  while making little mention of a string of defaults, settlements and lawsuits alleging that Walker and his businesses owed millions of dollars in unpaid loans.",
    "In a previous era, reporting on Walkers unending stream of lies about his business record, his educational background and his accomplishments might have torpedoed his bid to win a Senate seat from Georgia, or at least seriously damage his credibility in a crowded field.",
    "The latest reporting comes via The Daily Beast, which investigated claims that Walker has made about his experience in the private sector, which serves as the primary record on which voters can judge his abilities, since he has no experience in government.",
    "The propensity for mendacity may be part of the connective tissue between Trump and Walker, who have a friendship that dates to when Trump gave Walker a contract extension as then-owner of the United States Football League's New Jersey Generals in 1984.",
    "None of this is to suggest that politicians across the political spectrum didnt lie before Trump  indeed, equivocation and trafficking in some degree of untruth is an inevitable part of a politicians job.",
    "That's a win for Walker: Ultimately Trump's endorsement helped him stand out from the competition and generate buzz despite his cagey style of campaigning from behind closed doors.",
    "But it turns out he never graduated at all, since he dropped out to play professional football, and his academic performance before that was nowhere close to the top of his class.",
    "Hes the front-runner in recent polls of Republican primary candidates, and hes neck-and-neck with the Democratic incumbent, Raphael Warnock, who is up for re-election this fall.",
    "But Trump has changed the nature and scope of lying in mainstream political life, and in the process changed public standards for acceptably lying, particularly on the right.",
    "When Trump was sizing up whom to endorse among the Republicans running for Senate in Georgia, he certainly wouldnt have been put off by Walkers tendency to make things up.",
    "Walker has been a consistent supporter of Trumps political career, and backed Trumps efforts to overturn the 2020 election using disinformation about the results.",
    "And its even possible that his brazenness about making things up to boost his reputation is an asset  the kind of quality Trump found appealing in endorsing him.",
    "Among other things, the upholstery business seemingly doesnt exist, and Walkers food company isnt even the largest Black-owned food company in his own state.",
    "In 1987, reports that Joe Biden had plagiarized remarks from other politicians and exaggerated his academic record killed his first presidential campaign.",
    "A quickly growing stack of evidence has made something impossible to ignore: Republican Senate candidate Herschel Walker is a serial fabricator.",
    "Lying shamelessly about ones business record, personal accomplishments and how to deal with Covid  it all seems strikingly familiar, doesnt it?",
    "And as he considered Walker's Senate prospects, he may have found them affirming  an emblem of devotion to the Trumpian way of doing politics.",
    "In 2020 he peddled what he claimed was an FDA-approved aerosol which will kill any Covid on your body, even though no such treatment exists.",
    "Instead, it seems to have done little, if anything, to hurt him in one of the most important Senate races in the country.",
    "He has regularly boasted in speeches that he graduated in the top 1 percent of his class from the University of Georgia.",
    "In fact, over the course of their relationship, Trump probably recognized these tendencies as familiar.",
    "Its a testament to the Trump era of Republican politics that Walkers deceptions are unremarkable.",
    "And he wouldn't have been repelled by Walker hawking snake oil amidst a public health crisis.",
    "These days, such lying might not even register with some voters as worrying at all.",
    "These prevarications are only the latest of many."
  ]
}