{
  "id": 7765,
  "mediaId": 237,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Sen. Warnock has over $25 million in the bank for fight against GOP rival Walker",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/ff13365/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fcc%2F2c%2F031372c84777a4916b4c3febe9c7%2Fwarnock.jpg",
  "link": "https://www.washingtonexaminer.com/news/sen-warnock-has-over-25-million-in-the-bank-for-fight-against-gop-rival-walker",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cami Mondeaux",
  "authorUrl": "https://www.washingtonexaminer.com/author/cami-mondeaux",
  "termIds": [
    815
  ],
  "sentences": [
    "From fighting to cap the cost of insulin and lower prices at the gas pump to pushing for student loan debt relief, Reverend Warnocks commitment to serving the people of Georgia continues to drive the biggest grassroots fundraising effort in any Senate race this cycle.",
    "His figures have also boosted Warnocks sought reputation as someone who can attract both wealthy donors and small-dollar contributions, with the campaign noting his average donation over the last three months was $40.",
    "Georgia Sen. Raphael Warnock reported a fundraising haul of $13.6 million during the first three months of 2022, setting another fundraising record for his campaign and ending the quarter with $25.6 million.",
    "Warnock narrowly clinched the seat in a Jan. 5, 2021, runoff, alongside Democratic Sen. Jon Ossoff, which flipped control of the Senate to the Democrats after six years of Republican rule.",
    "Georgians see Reverend Warnock fighting to lower costs for hardworking families, and theyre ready to send him back to the Senate, said Warnocks campaign manager, Quentin Fulks.",
    "The numbers reflect the high-stakes nature of the Senate race between Warnock and his likely Republican opponent, former University of Georgia football star Herschel Walker.",
    "Its likely Warnock and Walker will face off in the November election in the Peach State, which is expected to be one of the most competitive and expensive midterm races.",
    "In a head-to-head race between the two, an Emerson College/Hill poll conducted during the first week of April found Walker leading Warnock 49% to 45%.",
    "The Trump-endorsed candidate ended 2021 with roughly $5 million in the bank and is expected to release updated fundraising numbers in the coming days.",
    "His latest haul is the most money ever raised by a Senate candidate during the first fundraising quarter of an election year, his campaign said.",
    "Warnock disclosed his first-quarter fundraising report before his Republican opponents, including GOP front-runner Walker.",
    "The chamber is currently tied 50-50, with Vice President Kamala Harris's tiebreaking vote giving Democrats the majority.",
    "The Washington Examiner reached out to the Warnock campaign for a comment but did not receive a response.",
    "Both parties see the Georgia seat as a linchpin in their efforts to win a Senate majority."
  ]
}