{
  "id": 7768,
  "mediaId": 12,
  "date": "d2022-04-14T12:00",
  "headline": "Warnock sets another fundraising record, ends quarter with $25.6M in the bank",
  "image": "https://www.ajc.com/resizer/TCsYHDsS4v62G1mD5uZM6d4TjsE=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/3TPDCGTYWJHOJN6XOTY552WJSU.jpg",
  "link": "https://www.ajc.com/politics/politics-blog/warnock-sets-another-fundraising-record-ends-quarter-with-256m-in-the-bank/DRB6ERQUKREP7HSXFR4DJEOFVU/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815,
    991,
    1131,
    1136,
    5799,
    141,
    146,
    571,
    2672
  ],
  "sentences": [
    "From fighting to cap the cost of insulin and lower prices at the gas pump to pushing for student loan debt relief, said Fulks, Reverend Warnocks commitment to serving the people of Georgia continues to drive the biggest grassroots fundraising effort in any Senate race this cycle.",
    "Democratic U.S. Sen. Raphael Warnock broke another fundraising record by amassing $13.6 million over the first three months of the year, ending the quarter with $25.6 million in the bank for a campaign that could decide control of the Senate.",
    "Up for election again in 2022  this time for a full six-year term  the pastor is now one of the nations most vulnerable Senate Democrats and a top target of Republicans aiming to tilt the balance of a chamber thats now split 50-50.",
    "Amid rising inflation and soaring energy prices, Warnock has focused his campaign message on proposals to cap the price of insulin, pass a federal gas tax break and pursue price-gougers in the global shipping industry.",
    "Warnocks latest fundraising figures further seals a reputation hes honed as a politician who can attract both small-dollar donations and support from the partys wealthiest contributors.",
    "Warnock, the pastor of Atlantas Ebenezer Baptist Church, is among several Senate Democrats to report strong fundraising quarters as they prepare for tough November matchups.",
    "Georgians see Reverend Warnock fighting to lower costs for hardworking families, and theyre ready to send him back to the Senate, said campaign manager Quentin Fulks.",
    "He amassed the lengthy donor list during a grueling 2020 special election campaign that ended with his narrow defeat of incumbent Republican Kelly Loeffler.",
    "The Democrat bested his own record-setting haul from the last fundraising quarter, when he collected $9.8 million in the last three months of 2021.",
    "His campaign said Thursday it was the most money ever raised by any U.S. Senate candidate in the first quarter of an election year.",
    "In this first quarter of 2022, he collected contributions from 183,000 individual donors who gave an average of $40.",
    "Warnock disclosed his fundraising figures Thursday before his Republican rivals had revealed their latest figures.",
    "Former football star Herschel Walker, the GOP frontrunner, ended 2021 with roughly $5 million in the bank.",
    "Arizona Sen. Mark Kelly raised $11.3 million in the first quarter and has $23.2 million in the bank.",
    "And Sen. Catherine Cortez Masto of Nevada collected $4.4 million and has $11 million on hand.",
    "He was one half of a Democratic sweep with Jon Ossoff that flipped control of the Senate.",
    "Other Republicans lag further behind."
  ]
}