{
  "id": 7772,
  "mediaId": 239,
  "date": "4/14/2022 12:00:00 AM",
  "headline": "Georgias Sen. Warnock raises $13.6M in 2022s first quarter",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/14/election_2022-senate-georgia_23257_c0-209-5000-3124_s885x516.jpg?97bb33537ebe846d4c08fcb503d0427a0f3e3c09",
  "link": "https://www.washingtontimes.com/news/2022/apr/14/georgias-sen-warnock-raises-136m-in-2022s-first-qu/",
  "sentiment": "0",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Amy",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "With inflation partly driving negative poll numbers for Biden and Democrats, Warnock has been trying to address rising prices, pushing a federal gas tax holiday, a $35-a-month price cap on insulin, and proposing that states should be allowed to use federal COVID-19 relief money to temporarily roll back sales taxes on some goods.",
    "Other candidates in the GOP primary include Agriculture Commissioner Gary Black, Navy veteran and former bank executive Latham Saddler, construction company owner Kelvin King, former state Rep. Josh Clark and former Army general Jonathan Jon McColumn.",
    "Republicans had long dominated statewide races until Georgia helped elect Joe Biden to the presidency and enabled Democrats to control the Senate by electing Warnock and fellow Democrat Jon Ossoff in a January 2021 runoff.",
    "Martin Luther King Jr. preached, became Georgias first Black U.S. senator after winning a special election in 2020 to fill the unexpired term of Republican Sen. Johnny Isakson, who stepped down because of failing health.",
    "Warnocks commitment to serving the people of Georgia continues to drive the biggest grassroots fundraising effort in any Senate race this cycle, campaign manager Quentin Fulks said in a statement.",
    "Warnock reported Thursday that he raised $13.6 million in the first three months of 2022, outpacing what was already a hefty $9.8 million raised in the last three months of 2021.",
    "The senators campaign said it was the most money ever raised by a U.S. Senate candidate in the first quarter of an election year, giving Warnock $25.6 million in cash on hand.",
    "ATLANTA (AP)  Democratic Sen. Raphael Warnock says his fundraising has set a new record as Georgias Senate campaign shapes up to be one of this years most expensive races.",
    "Walker has been raising large amounts of money as well, but has trailed Warnock thus far, collecting $5.4 million in the last three months of 2021.",
    "The senator is already spending heavily, although details wont be available until Warnock files his report with the Federal Election Commission.",
    "Walker, a political newcomer, is a football icon after winning the Heisman Trophy at the University of Georgia and going on to star in the NFL.",
    "From fighting to cap the cost of insulin and lower prices at the gas pump to pushing for student loan debt relief, Rev.",
    "Georgia will be a key battleground in these 2022 midterm elections to determine which party controls the U.S. Senate.",
    "Republican Herschel Walker is the frontrunner among six GOP candidates in the May 24 primary.",
    "Walker is close friends with Donald Trump, who has endorsed Walker and is promoting his run.",
    "Warnock raised more than $125 million for his 2020 Senate race, according to FEC reports.",
    "Warnock is a heavy favorite to defeat Tamara Johnson-Shealey in the Democratic primary.",
    "Despite the big fundraising quarter, Warnocks cash on hand rose only by $2.6 million.",
    "Libertarian Chase Oliver will also be on the general election ballot in November.",
    "In the 2022 campaign cycle, he has raised more than $65 million so far.",
    "Warnocks campaign said it received donations from 183,000 individuals.",
    "None of the Republicans had announced numbers as of Thursday.",
    "Warnock, pastor of the Atlanta church where the Rev.",
    "Isakson died in December."
  ]
}