{
  "id": 7778,
  "mediaId": 558,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Republican rivals try to topple Georgia football star Herschel Walker in key Senate race",
  "image": "https://s.yimg.com/ny/api/res/1.2/0ywTPeBEwNz0iDcNp.7cwg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU0MDtjZj13ZWJw/https://s.yimg.com/os/creatr-uploaded-images/2022-04/a8ac4310-bb67-11ec-9d6d-29b4dd8d8d51",
  "link": "https://ph.news.yahoo.com/republican-rivals-try-to-topple-georgia-football-star-herschel-walker-in-key-senate-race-200210812.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Wilson",
  "authorUrl": "https://www.yahoo.com/author/christopher-wilson",
  "termIds": [
    815
  ],
  "sentences": [
    "Warnock, meanwhile, is the pastor of the historic Ebenezer Baptist Church in Atlanta, a role once filled by Martin Luther King Jr.\nLast year, Warnock won a runoff election to serve out the remainder of former Sen. Johnny Isaksons term, after the Republican retired due to health concerns.",
    "Trump continues to baselessly insist that Biden won in Georgia only due to election fraud, a claim that GOP strategists say encouraged Republican voters to sit out the January 2021 Senate runoffs, in which Warnock and his fellow Democrat Jon Ossoff emerged victorious.",
    "Despite a flurry of bad press and complaints from his primary competitors that hes avoiding the campaign trail, Herschel Walker is the leading Republican contender in the race to face the Democratic incumbent, Raphael Warnock, in this falls key Georgia Senate race.",
    "Walker, a legendary former University of Georgia football star, recently moved back to the state after a decade of living in Texas, but he quickly established a comfortable lead in polling for the nomination after launching his campaign last year.",
    "Mr. Walker not showing up and not making himself available to the people of Georgia is not serving the people of Georgia, said Kelvin King, a contractor and military veteran also running for the GOP nomination.",
    "Republicans are hoping to win back both chambers of Congress in November, and McConnell that the GOP is on track to have its best midterm performance in several decades.",
    "Hes also won the support of both former President Donald Trump and Senate Minority Leader Mitch McConnell, R-Ky., who have been feuding over candidates in recent months.",
    "While enjoying broad support within the GOP, Walker has attempted to distance himself from his opponents in the May 24 primary, including skipping a debate last weekend.",
    "In August, that in 2012 an ex-girlfriend of Walkers had filed a police report in which she alleged he had threatened to blow her head off and then kill himself.",
    "His ex-wife, Cindy Grossman, claimed in divorce filings that he was physically abusive and threatened to kill her; she that he had pointed a gun at her head.",
    "Georgia's agriculture commissioner, Gary Black, Walkers closest rival in the primary, has said the accusations should disqualify Walker from consideration.",
    "Polling has been sparse in the race, but released earlier this month showed Walker with 57% of the vote and Black a distant second at 13%.",
    "Warnocks win came just two months after Joe Biden became the first Democratic presidential candidate to carry Georgia since 1992.",
    "He has also been running digital ads in which a police report mentioned Walker talking about having a shoot-out.",
    "Walker has been vague in discussing the allegations, although hes been open about his mental health issues.",
    "This is an interview process, and if you dont show up for the interview process, you dont get the job.",
    "Im going to debate Raphael Warnock, because Im going to win this primary, and Im going to the general.",
    "But that victory put him in the unenviable position of having to immediately defend his Senate seat.",
    "Im thinking about debating Raphael Warnock, because thats who I need to be debating right now,.",
    "If Walker falls below 50%, he would be pulled into a June runoff to secure the nomination.",
    "Additionally, that campaign finance experts had found issues in Walkers disclosure forms.",
    "Walker has also been accused of embellishing or outright fabricating his rsum.",
    "On Wednesday, that Walker had claimed to own companies that did not exist.",
    "Warnock has his work cut out for him if he is to remain in office.",
    "The Associated Press reported last summer that he potentially.",
    "Walker has been repeatedly accused of domestic abuse.",
    "On April 1, CNN reported that he had.",
    "Late last year, he told Axios .",
    "No charges were filed.",
    "Earlier this year,."
  ]
}