{
  "id": 7780,
  "mediaId": 234,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Trumps Former Chief of Staff Wont Be Able to (Allegedly) Commit Voter Fraud in North Carolina Anymore",
  "image": "https://media.vanityfair.com/photos/6257476d67f4b24bbe8721a3/master/w_2240,c_limit/1269390633",
  "link": "https://www.vanityfair.com/news/2022/04/mark-meadows-north-carolina-voter-fraud",
  "sentiment": "0.0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bess Levin",
  "authorUrl": "https://www.vanityfair.com/contributor/bess-levin",
  "termIds": [
    815
  ],
  "sentences": [
    "Finland debates joining NATO, which would expand the alliance Putin hates (The Washington Post)\nSuspect detained in N.Y. subway shooting that left 10 injured by gunfire (The Washington Post)\nU.S. extends transit mask mandate through May 3 amid COVID uptick (Reuters)\nIn red states, its open season on womens rights (CNN)\nJamie Dimon sees storm clouds ahead for U.S. economy later this year (CNBC)\nTed Cruz Wont Say Whether Hed Blow a Man to End Global Hunger (Jezebel)\nMan Posed as DEA Agent to Get Discount at Wendys (TSG)\n Inside the Virus-Hunting Nonprofit at the Center of the Lab-Leak Controversy\n Jared Kushner and Donald Trump Probably Wont Be Splitting a Milkshake Anytime Soon\n CNN Leaves the Drama Behind With Focus on War in Ukraine\n Trumps Truth Social Is an Even Bigger Humiliation Than Previous Business Failures\n The Clock Is Ticking on the January 6 Investigation\n The Washington Post Checks In, Finds Trump Is Still a Lying Sociopath\n A Ukrainian Woman Explains the War to Europes Skeptics\n From the Archive: How Playboy Imran Khan Became the Prime Minister of Pakistan\n Not a subscriber?",
    "The Asheville Citizen-Times reports that Meadows was removed from the states voter rolls under General Statute 163-57, which states that if a person goes into another state, county, municipality, precinct, ward, or other election district, or into the District of Columbia, and while there exercises the right of a citizen by voting in an election, that person shall be considered to have lost residence in that State, county, municipality, precinct, ward, or other election district from which that person removed.",
    "Donald Trump, of course, has spent the last 15 months baselessly claiming voter fraud cost him the 2020 election, and Meadows reportedly spent his final weeks as chief of staff trying to help his boss overturn the results, pressuring top officials to look into absurd election-fraud theories, including one about Italian satellites changing Trump votes to ones for Joe Biden and another about China using thermostats to hack voting machines.",
    "Trump-endorsed Georgia candidate follows Trumpian tradition of lying about everything all the time\nFresh off revelations that Herschel Walker lied about graduating at the top of his class from the University of Georgia when, in fact, he didnt graduate at all, comes a new report from the Daily Beast that the U.S. Senate candidate has a habit of claiming to own businesses that dont appear to exist in the literal sense.",
    "In a statement, a spokesperson for the candidate did not address the curious case of the upholstery business, saying only of the claim about being the owner of the largest minority-owned food company: This story has already been written repeatedly by CNN and others, like The Daily Beast, who want to help Raphael Warnock get re-electedyoure a couple months behind.",
    "It may not seem like a big deal compared to all the other shady, underhanded, likely criminal behavior Donald Trump and company engaged in surrounding the last election, but in case you hadnt heard, the former presidents last chief of staff, Mark Meadows, registered to vote in 2020 using the address of a North Carolina mobile home he never owned or lived in.",
    "Those claims include running the largest minority-owned food company in the United States; owning multiple chicken plants in another state; and starting and owning an upholstery business which was also, apparently, at one point in his telling, the countrys largest minority-owned apparel company.",
    "Last month the North Carolina State Bureau of Investigation said that a special investigations unit was looking into the curious case of Meadowss decision to register to vote using the address of, per The New Yorker, a 14-by-62-foot mobile home that, again, he never actually lived in.",
    "While Walkers business record has been picked over beforeincluding in an Associated Press review of exaggerated claims of financial successThe Daily Beast has reviewed documents and other records that shine new light on previously unexamined, and particularly egregious, false claims.",
    "Macon County administratively removed the voter registration of Mark Meadows under [state law], as he lived in Virginia and last voted in the 2021 election there, said Pat Gannon, a spokesman for the North Carolina State Board of Elections, according to Insider.",
    "In addition to not owning or living in the home he claimed was his permanent residence, Meadows was also registered to vote in Virginia, where he actually lived while serving as chief of staff.",
    "Greg Abbott follows through with ridiculous publicity stunt\nPence tries to differentiate himself from Trump by not calling Vladimir Putin a tactical genius with a body of the gods\nElsewhere!",
    "(That response was reminiscent of the one the campaign gave CNN re: Walkers made-up academic credentials, telling the outlet: Multiple reporters wrote about this 40 years ago.",
    "Thats something youre not actually allowed to doin fact, people have been prosecuted for less!and Meadows is now under investigation for committing voter fraud.",
    "The claims about the upholstery business appear particularly divorced from the truth, as that business, as Walker describes it, doesnt appear to exist.",
    "We also recently learned that he traded a number of text messages with Clarence Thomass wife, Ginni Thomas, re: blocking Biden from becoming president.",
    "And in the meantime, North Carolina has taken a step to ensure he wont be able to illegally vote there again (allegedly).",
    "If you have a difficult time getting in touch with them, ask yourself why you are asking such a stupid question.)",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "A spokesperson for Meadows did not respond to the Citizen-Times request for comment.",
    "If you have a problem with what they wrote, please contact them.",
    "The probe is being conducted with the state elections board.",
    "But apparently, the call was coming from inside the house!",
    "It looks like we're experiencing playback issues.",
    "Our bad!"
  ]
}