{
  "id": 7783,
  "mediaId": 19,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Poll: Republican Herschel Walker Shows 5-Point Lead over Democrat Sen. Raphael Warnock",
  "image": "https://media.breitbart.com/media/2022/01/GettyImages-1235507269-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/13/poll-republican-herschel-walker-five-point-lead-democrat-sen-raphael-warnock/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    815
  ],
  "sentences": [
    "Last month, President Joe Biden attempted to indirectly meddle in the Senate race by kicking Walker, who was appointed by former President Donald Trump, off the Presidents Council on Sports, Fitness & Nutrition.",
    "Walker, a former University of Georgia football star and Heisman Trophy winner, hammered Biden, saying it was an attempt to throw his campaign off track and called the effort unsuccessful.",
    "Republican Herschel Walker holds a five-point lead over incumbent Sen. Raphael Warnock (D-GA) in a hypothetical matchup for Georgias U.S. Senate seat, according to a recent poll.",
    "In the Emerson College Polling and the Hill poll, Walker had 49 percent support compared to Warnocks 45 percent support, with six percent of respondents undecided on a candidate.",
    "The Locals Peach State poll, conducted by Big Data Poll for April 2022, showed that Walker holds a five-point lead, with 46.7 percent of the respondents supporting him.",
    "The way they throw me off track is theyre going to have to show me these policies theyre making right now is going to be great for Georgia and great for America.",
    "The party breakdown of the poll was 37.9 percent Republican respondents, 33.9 percent Democrat respondents, and 28.2 percent independent respondents or other.",
    "As this poll showed Walker leading by five points, one of the more recent polls also showed Walker with a four-point lead over Warnock.",
    "While the Senate is equally divided, 50 to 50, races such as this one could decide the upper chambers majority and minority parties.",
    "In comparison, 41.8 percent of the respondents said they would vote for Warnock, while 11.6 percent said they were still undecided.",
    "The questions were asked to 931 likely voters in Georgia voters and saw a 3.1 percent margin of error.",
    "In recent months, the race has heated up to be one of the more competitive and watching Senate races.",
    "The questions were asked to 1,013 registered voters and saw a three percent margin of error.",
    "That poll was conducted between April 1 to 3, nearly a week before the previous poll.",
    "Locals Peach State poll by Big Data Poll was conducted between April 9 and 11.",
    "I think thats what they thought they could do  throw me off track.",
    "But this letter is not going to do that, Walker stated.",
    "Jacob Bliss is a reporter for Breitbart News.",
    "Follow him on Twitter @JacobMBliss."
  ]
}