{
  "id": 7787,
  "mediaId": 43,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Top Comments: The purpose of the lie",
  "image": "https://images.dailykos.com/images/180885/story_image/top_comments_header.jpg?1453902044",
  "link": "https://www.dailykos.com/story/2022/4/13/2091813/-Top-Comments-The-purpose-of-the-lie",
  "sentiment": "0.63",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    2331,
    4363,
    5855,
    2672,
    6053
  ],
  "sentences": [
    "Top mojo, courtesy of mik:\n1) If this battle is as important as people seem to  by Mark Sumner +205\n2) The FBI and the Secret Service keep doing things  by Leftleaner +165\n3) When the Tea Party was starting, local news was  by A Citizen +152\n4) Tough go, but you definitely have the right mind  by Mxwll +135\n5) Personally, I'm hoping to claim my rheumatologis  by kamachanda +133\n6) This is great news, particularly considering so  by Aldous J Pennyfarthing +132\n6) In a WaPo op-ed by Colbert King, he references a  by Ammo Hauler +132\n8) But its not just Blacks for Trump that annoy th  by Frank Pedraza +127\n9) Great diary!",
    "The time t  by aplus50 +79\n26) Off we go into the wild blue yonder by BOHICA +77\n27) Their home-grown manufacturing base becomes more  by Mark Sumner +75\n28) We need to promote this plan for them as much as  by Aldous J Pennyfarthing +74\n28) This seems to coincide with the new statements a  by FiredUpInCA +74\n30) Adapt, improvise, overcome by BOHICA +72\n30) Sounds like a perfect storm of awful things ha  by MamaLucia +72\nPicture quilt, created by jotter, brought back by elfling and the help desk crew:",
    "Candace Owens,  by Frank Pedraza +122\n11) [image] by Proginoskes +112\n12) Railway bridge in Belgorod sabotaged by AnotherAmericanLie +102\n13) There have been some reports that seemed to prov  by Mark Sumner +100\n14) I smell dirty secret service agents all over thi  by 4democracy +103\n15) [embed] by DRo +94\n15) Its almost as if the Secret Service was trying  by Olds88 +94\n17) Thank you thank you.",
    "Ive been watching with dismay as the rights bizarre claims about CRT indoctrination and LGBT grooming lead to situations like this:\nx\nI stood between the stranger and my son, whose life has already been so hard, who carries traumas larger than his whole small, fierce frame.",
    "The people screaming groomer at LGBT people, or babbling about CRT teaching elementary school kids to hate themselves  they cant be reasoned out of it, because they WANT it to be true.",
    "Herschel Walker by Denise Oliver Velez +84\n22) [embed] by DRo +84\n22) Ive been glued here since Feb. 24, signed up ju  by berlinerdeutsch +84\n25) Give Zelensky everything he requests.",
    "If you see a comment by another Kossack that deserves wider recognition, please send it either to topcomments at gmail or to the Top Comments group mailbox by 9:30pm Eastern.",
    "Please please please include a few words about why you sent it in as well as your user name (even if you think we know it already :-)), so we can credit you with the find!",
    "Booker T. Washington thought that former slaves needed to show that they were educated and hard-working, in order to counter the stereotype of being lazy and ignorant.",
    "[2/10]\n Robbie  (@Robbiepierce) April 13, 2022\nx\nIt was suddenly no longer an absurd, abstract attack in an online comments section or a distant legislative session.",
    "These horrors were being screamed @ my sweet bewildered son, who's worked so hard to process his grief & control his feelings, who only wants love & safety.",
    "And 60 court hearings werent enough to bring some sense to the stop the steal crowd, because they need it to be true, in order to justify their own actions.",
    "But the lazy and ignorant stereotype wasnt the cause of slavery or racism  it was an after-the-fact rationalization from people who wanted it to be true.",
    "We strive to nourish community by rounding up some of the site's best, funniest, most mojo'd & most informative commentary, and we depend on your help!!",
    "And how about Tim Sco  by Frank Pedraza +86\n21) Speaking of troop movements, apparently Russian  by 9pxot0k924vn +85\n22) Thanks Georgia.",
    "I didnt realize how  by JWC +91\n18)  the right perspective: AND the right insu  by Anakai +86\n18) Worst dinner guest imaginable.",
    "The only question left is why the media continue to report the lies as if they were some sort of deeply held belief.",
    "I think it was Amanda Marcotte who observed that in these situations, the purpose of the lie is not to be believed.",
    "Highlighted by Captain Frogbert:\nLeMoJoust gives a perfect example of the gun fetish cult grooming children.",
    "Here at Top Comments we welcome longtime as well as brand new Daily Kos readers to join us at 10pm Eastern.",
    "You wrote it so eloquently despite  by Frank Pedraza +123\n10) Of course, it doesnt stop there.",
    "When dealing with abusers and oppressors, its often tempting to try to reason them out of it.",
    "The lie gives permission for their hateful behavior, and thats all they care about.",
    "[4/10]\n Robbie  (@Robbiepierce) April 13, 2022\nBut first, a word from our sponsor!",
    "The purpose of the lie is to give permission.",
    "by Walter Einenkel +86\n18) Thanks!",
    "\"Get away from my family.\"",
    "On to Top Comments!",
    "Ill check it out.",
    "I was immovable."
  ]
}