{
  "id": 7794,
  "mediaId": 209,
  "date": "d2022-04-12T07:01",
  "headline": "Late night hosts explore Russia's sanctions pains, Don Jr.'s election texts, Trump's Dr. Oz nod",
  "image": "https://u989.theweek.com/rest/dialogues/files/efb5bc8d-78f5-4819-a89e-e3a51a4394aa/tw_us_welcome+campaign_blueconic_v1_300x150_+copy.png",
  "link": "https://theweek.com/stephen-colbert/1012445/late-night-hosts-explore-russias-sanctions-pains-don-jrs-election-texts",
  "sentiment": "0.253",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Weber",
  "authorUrl": "https://theweek.com/authors/peter-weber",
  "termIds": [
    815,
    1053,
    1147,
    1653,
    2030,
    2282,
    5756,
    2888,
    2942
  ],
  "sentences": [
    "The House Jan. 6 committee says it has enough evidence to refer crimes committed by \"our crazy ex-president\" to the Justice Department for prosecution, \"but they're hesitant to do that because they don't want it to seem politically motivated,\" Jimmy Kimmel sighed on Kimmel Live.",
    "\"Put that on a hat  and tell Don Jr.\"\nAccording to records acquired by the Jan. 6 committee, \"Don Jr. texted his dad's former chief of staff, Mark Meadows, ideas for overturning the 2020 election, before the election was even called,\" Stephen Colbert elaborated on The Late Show.",
    "\"While the rest of the world is focused on the Ukrainian victims of Putin's war, many Russian Instagram influencers, well, they feel like they're the real victims of what's happening in Ukraine,\" Trevor Noah said on The Daily Show.",
    "The Russian debt default is a big deal, but \"Russian troops are also sabotaging themselves,\" reportedly taking dangerously radioactive \"souvenirs\" from their occupation of Chernobyl, Colbert said.",
    "Donald Trump has \"racked up quite a roster of endorsees: Dr. Oz, Herschel Walker, Sarah Palin  his goal is to turn Congress into The Celebrity Apprentice,\" Kimmel said.",
    "Russia partially defaulted on its foreign debt, and The Late Show suggested Monday that Russian President Vladimir Putin hold a giant yard sale.",
    "Meanwhile, Will Smith was banned from the Oscars for 10 years  a blessing in disguise for Smith and bad news for Chris Rock, Noah explained.",
    "Cutting up Chanel bags they have already paid for is idiotic, but clearly \"the economic pressure on Russia is having an effect.",
    "It's just nice to see the Capitol being overrun by something that doesn't smear feces in Nancy Pelosi's office.\"",
    "\"But the most important Trump moment of the weekend\" was when Trump finally admitted he didn't win the election.",
    "\"If you're worried about the optics of prosecuting, why do the investigation in the first place?",
    "Also, \"COVID is ripping through Washington, D.C., right now, and you know what?",
    "\"Well of course, you can't go to Chernobyl and not check out the gift shop.\"",
    "They could at least ban him from the Oscars for 10 years, right?\"",
    "You realize that Instagram models can't even buy pants anymore.",
    "\"Pretty sure that Titanic has sailed already,\" he joked.",
    "How does this guy keep getting away with this stuff?",
    "And Trump's endorsement of Mehmet Oz?",
    "Some of the items were pretty cheap.",
    "Clearly the sanctions are working.\"",
    "\"Good for him,\" he said.",
    "He's a con man.",
    "And so is Dr.",
    "\"Come on!",
    "Oz!\"",
    "..."
  ]
}