{
  "id": 7795,
  "mediaId": 157,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Herschel Walker can't even 'pretend to be competent': analyst",
  "image": "https://www.rawstory.com/media-library/herschel-walker-registers-to-vote-in-georgia-as-he-weighs-us-senate-run.jpg?id=27718760&width=1200&coordinates=0%2C23%2C0%2C24&height=600",
  "link": "https://www.rawstory.com/herschel-walker-can-t-even-pretend-to-be-competent-analyst/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    815
  ],
  "sentences": [
    "Adding that Walker's campaign has been dogged by a multitude of issues including accusations of domestic violence and mental health issues, Benen wrote, \"Theres a reason the Georgians campaign team has tried to limit the retired football players public appearances and kept Walker 'largely behind closed doors'.\"",
    "During his appearance on Fox News, Walker, who was encouraged to run by former President Donald Trump, was asked about U.S. energy independence and told host Maria Bartiromo, \"One of the first things they [the Joe Biden administration] did is they decided they are going to give up our energy.",
    "According to Benen, a recent appearance by Walker on Fox News -- combined with his skipping a debate appearance with other Republicans seeking the nomination -- demonstrated that he has no grasp of the issues and is blatantly faking it when pressed to explain his positions.",
    "In a column for MSNBC, political analyst Steve Benen suggested that retired football player Herschel Walker is completely out of his depth as an aspiring candidate for the Republican nomination to oppose Sen. Raphael Warnock (D-GA).",
    "Benen claimed it was obvious that the former running back was just repeating GOP talking points and then made the case for how Walker was coached by his handlers before his appearance on the conservative-friendly Bartiromo show.",
    "The premise of the program was straightforward: Regular people with no meaningful experience in a given field would take a crash course in a profession that is not their own.",
    "Noting that Walker seems headed to landing the GOP nomination, he warned, \"In the BBC show I used to watch, those who struggled to fake competence failed their challenge.",
    "As pointed out, his MSNBC colleague Jahan Jones suggested Walker \"delivered a meandering response that was detached from reality and syntax.",
    "When tested, the political rookie has shown he hasnt yet reached the point at which he can pretend to be competent,\" he accused.",
    "By him going out and giving up our energy, now we're not energy independent anymore, which started the whole downfall.\"",
    "In American politics, those who fail to fake competence sometimes get to become powerful federal policymakers.\"",
    "Coaches would quickly try to help contestants master difficult tasks, and then try to fool a panel of experts.",
    "NOW WATCH: Mass shooting at Brooklyn subway station and NYPD confirms devices found\nStories Chosen For You",
    "\"In Georgias Senate race, part of the problem is that Walker isnt faking it well.",
    "The contestants would often do surprisingly well,\" the MSNBC analyst wrote.",
    "\"Several years ago, I saw a BBC reality show called, 'Faking It.'"
  ]
}