{
  "id": 7796,
  "mediaId": 43,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Black Kos, Tuesdays Chile: All my skinfolk aint my kinfolk We see you Thomas, Scott, and Walker.",
  "image": "https://images.dailykos.com/images/760717/story_image/ZoraNealeHurston.jpg?1580156080",
  "link": "https://www.dailykos.com/story/2022/4/12/2091194/-Black-Kos-Tuesday-s-Chile-All-my-skinfolk-ain-t-my-kinfolk-We-see-you-Thomas-Scott-and-Walker",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Zora Neale Hurston\nCommentary by Black Kos Editor Denise Oliver-Velez\nAnthropologist and author Zora Neale Hurston popularized the Black community wisdom captured in the saying All my skinfolk aint my kinfolk, the history of which Azizi Powell explored in What The African American Saying \"All My Skinfolk Ain't My Kinfolk\" REALLY Means\nGiven that Black folks have recently have to suffer through the slime and vile aspersions thrown at Judge and soon to officially be sworn in Supreme Court Justice Ketanji Brown Jackson, and have watched RepubliKKKlan members across the U.S attack our voting rights, spread specious bullshit about Critical Race Theory, continue its war on our community any which way they can, it becomes doubly disgusting for us to witness melanated elected officials, candidates, and a Supreme Court Justice weaponized by white supremacists to aid and assist in screwing us over.",
    "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nAttorneys, politicians, doctors and more are honored on the Gaston County Black Business Pioneers Quilt The Grio: Quilt tells the story of Black pioneers in western North Carolina\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nA quilt featuring Black pioneers of the past century from a county in western North Carolina is on display at a recently opened African American museum in the state, according to the Gaston Gazette.",
    "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nNEWS ROUND UP BY DOPPER0189, BLACK KOS MANAGING EDITOR\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nThe Environmental Protection Agency is investigating whether Louisiana's health and environmental agencies discriminated against Black residents in connection with facilities between New Orleans and Baton Rouge.",
    "Foreign Policy: Another Conflict Is Brewing in the Caribbean\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nIf Russias invasion of Ukraine has taught us anything, its that authoritarian leaders consider themselves above the lawunrestrained by the sovereignty declarations, human rights protections, and international institutions established after World War II to prevent future conflict.",
    "https://t.co/2HCtHBEaSx\nSee my interview with her below:https://t.co/Cy9I5fZa2U\n Clay 'Critical Thinking Theory' Cane (@claycane) April 7, 2022\nin spite of the anger and sense of betrayal we feel about the not-kinfolks, more important is the fact that we need white folks to reject those of their skinfolks who have kept us in this mess for centuries.",
    "US News: EPA Probes Environmental Justice in Louisiana Projects\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nThe Environmental Protection Agency is investigating whether Louisianas health and environmental agencies discriminated against Black residents in connection with air pollution from existing and proposed facilities between New Orleans and Baton Rouge.",
    "The countrys light sweet crude has drawn investors from near and far, including the U.S. oil company Hess Corp. and the China National Offshore Oil Corp. At projected rates of extraction, Guyana stands to become the highest per capita oil producer in the world by 2035possibly the next United Arab Emirates, according to some.",
    "We know what it means when someone doesnt even have to say a word about them on social media and simply responds with an animated gif like this one\nx\nThose skinfolk tap dancing for Mista or Miz Massa are anathema to the vast majority of our kinfolks, who are solid Democrats and who will not forget or forgive.",
    "But following Venezuelas independence, and then the discovery of gold in the Essequibo in the 1850s, Venezuelan authorities asserted their inherited claim, going as far as breaking diplomatic ties with the United Kingdom in 1887 until the countries could reach a compromise over the border.",
    "We remind South Carolina voters that they have a choice in November.#Election2022 pic.twitter.com/vcHP1bEyVq\n Catherine Fleming Bruce (@tnovsa) April 12, 2022\nx\nI had a wonderful time engaging with the Ballentine, Irmo, and Chapin (BIC) club today!",
    "#GeterforSenate #FrontlineLeadership pic.twitter.com/Zzh0Y0FVtj\n Angela Geter for US Senate (@geterforsenate) April 12, 2022\nx\nIf you are disgusted by Tim Scott voting against Ketanji Brown Jackson then support Krystle Matthews (@kmforsenate).",
    "Reveal: Losing Ground\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nIn 2021, the Biden administration approved $4 billion in loan forgiveness for Black farmers and other farmers of color, as part of the $1.9 trillion pandemic relief package.",
    "hugged my temples\n with slick hands \n - Nate Marshall\n my mothers hands\nby Justice Putnam, Black Kos Poetry Editor\n My mother gave birth to me, her first born, just a little less than two months shy of her nineteenth birthday.",
    "A powder keg much closer to the United States could be one of the worlds next tests: the Guyana-Venezuela border, where the two countries have been embroiled in a bitter fight over a contested region known as the Essequibo.",
    "The Gaston County Business Pioneers Quilt is being shown at the African American Museum of History and Culture, which opened in the city in 2019 to highlight the contributions and history of Black people in Gaston County.",
    "The decorative spread, measuring 5-by-6 feet, contains more than 60 squares that display headshots of business owners, medical professionals, attorneys and public leaders from Gaston County, according to the news outlet.",
    "I didnt choose a top picture for this commentary of Herschel Walker, Tim Scott, Clarence Thomas, or any of the other current quislings of color supported by the right, because even looking at them makes me bilious.",
    "The director of EPA's civil rights compliance office, Lilian Dorka, recently notified environmental groups and the state about the investigation of Louisiana's departments of health and environmental quality.",
    "#Freshwords\n LanaQuest aka RosaSparks (@LqLana) April 7, 2022\nx\nWhen will you learn that all SKINFOLK ain't KINFOLK, just because a person has BLACK SKIN that does not mean that they REPRESENT OUR RACE!!!",
    "Spain had previously claimed some of this land, yet Madrids preoccupation with independence movements across Latin America prevented Spanish authorities from contesting British occupation of the region.",
    "hugged my temples\nwith slick hands,\nas if to say son be mine\nas if to say this i give you\nas if to say we are people\ncolor of good oak but we\nwill not burn, we survive\nevery fire without becoming\nash.",
    "Now, the Essequibo regions oil fields, discovered in 2015 by ExxonMobil, have catapulted Guyana, one of the Western Hemispheres poorest countries, to join the ranks of the worlds top energy markets.",
    "In 1897, both Venezuela and British Guiana ceded jurisdiction of the Essequibo dispute to an international tribunal in Paris, composed of jurists from the United States, United Kingdom, and Russia.",
    "!https://t.co/6IPu4kdhdX\n Democratic Coalition (@TheDemCoalition) April 12, 2022\nThere are currently 3 Black women running in the Democratic Party primary in South Carolina, to take on Tim Scott.",
    "An 1899 ruling allowed Venezuela to retain the Orinoco River basin, while British Guiana was awarded more than 90 percent of the densely forested land between the Orinoco and Essequibo rivers.",
    "Its important for our children to know that the county had a lucrative business community years ago, museum founder Dot Guthrie, who led the effort to create the quilt, said, per the Gazette.",
    "Louisiana Department of Environmental Quality officials believe the agency's permit process is unbiased, press secretary Gregory Langley told The Times-Picayune/The New Orleans Advocate.",
    "However there is a sense of consensus, and most Black folks dont take lightly those skinfolks who sell us out, or work against our interests while cozying up to white racist agendas.",
    "- Nate Marshall\nmy mothers hands\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nWELCOME TO THE TUESDAY PORCH.",
    "https://t.co/E5ooiW5XtA\n Reformed Bully (@ReformedBully) May 2, 2021\nx\nHe continues to prove that he a descendent of the enslaved peoples, Harriet Tubman would have shot.",
    "Both accuse the Louisiana Department of Environmental Quality of paying too little attention to environmental justice; one also accuses the state Department of Health.",
    "Pictured: Dot Guthrie and Charles Whitesides (via Gastonia Gazette)\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nWhy do Black families make up less than 1% of American farmers?",
    "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nVoices and Soul\n  she still shone, still made\n smooth her every rough\n edge, heel to brow.",
    "The complaints involve at least seven existing plants and two huge planned projects in two parishes in the industrial corridor between Louisiana's largest cities.",
    "At the time, the British Empire was consolidating its territories along the northern coast of South America, which it had purchased from the Netherlands in 1814.",
    "The Chanteezy For Real  (@iamchanteezy) April 11, 2022\nWent back to take a look at some tweets citing not kinfolk\nx\nDear Keith - All skinfolk are not kinfolk.",
    "Not one taught their kids that pointing a stick at someone and going bang was the same as pretending you are killing someone, and how terribly wrong that is.",
    "my mothers hands\n would moisturize\nmy face from jaw inward\nthe days she had too\nmuch on her hands\nwhen what needed\nto come through\ndid or didn't show.",
    "Here For THEE Comments 1 (@forthecomments1) February 26, 2022\nThere will always be a minority sub-set of skinfolks willing to sell out their kinfolks.",
    "The two in planning are a $9.4 billion Formosa Plastics complex in St. James Parish and a $400 million grain terminal in St. John the Baptist Parish.",
    "Cyndi (@savannahpeace) April 7, 2022\nx\nPretty sure no one is surprised that Tim Scott, the America is not a racist country guy, was a no vote on KBJ.",
    "pic.twitter.com/hEknyhyWbd\n THEE Nikki Now'''' (@NikkiNikkinow2) April 5, 2022\nx\nBest example of All Skinfolk aint Kinfolk\n Are You Not Entertained?",
    "As rising fuel prices due to Russias war in Ukraine pinch consumer pockets around the globe, Guyanas export potential is quickly coming into focus.",
    "Wises story is one piece of the puzzle explaining how Black families went from owning nearly a million farms in 1920 to now fewer than 36,000.",
    "Not one parent in the neighborhood took their kids to the forest to name a tree, and then visit it for decades and decades later.",
    "Steven Russo, general counsel for the Louisiana Department of Health, told the newspaper, We take these concerns very seriously.",
    "https://t.co/WbcLIU7mn8\n Just Daryl (@daryldarylstur1) November 4, 2021\nGranted there is no one, monolithic Black community.",
    "(@CherylLynnOwen5) November 6, 2021\nx\nThought Amy Coathanger Barrett who never heard a case as a judge was highly qualified.",
    "Existing plants include the Denka Performance Elastomers plant, which the Japanese company bought in 2015 in St. John.",
    "It did seem she was more hip and cool than our friends parents, and none of them played the saxophone, like she did.",
    "However, White farmers have sued, and that aid has yet to be paid out as the issue makes it way through the courts.",
    "The Gaston County Business Pioneers Quilt on display at the African American Museum in Gastonia, North Carolina.",
    "For Russian President Vladimir Putin and his ilk, the rules of the international order were made to be broken.",
    "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nRussias war in Ukraine stirs Venezuelas dreams of conquest in oil-rich Guyana.",
    "John Biewen of Scene on Radio teamed up with Reveal to investigate Wises claim of race-based discrimination.",
    "IF YOU ARE NEW TO THE BLACK KOS COMMUNITY, GRAB A SEAT, SOME CYBER EATS, RELAX, AND INTRODUCE YOURSELF.",
    "And his latest exploits show that, without a credible deterrent, territorial conquest is on the table.",
    "A landmark class-action lawsuit on behalf of Black farmers, Pigford v. Glickman, was settled in 1999.",
    "In 1996, he and his wife, Dorothy, bought a farm with a loan from the U.S. Department of Agriculture.",
    "In 1997, a USDA report said discrimination by the agency was a factor in the decline of Black farms.",
    "I always knew we had a young mom, mostly because the neighborhood kids never let us forget about it.",
    "And moreover, a lesson Ive learned: Dont argue with people Harriet Tubman would have left behind.",
    "Another expression of this is naming them people Harriet Tubman would have left behind  or shot.",
    "In addition to the quilt, artifacts at the museum include photos and books, among other items.",
    "The area to the west of the Essequibo River was among them and became part of British Guiana.",
    "The origins of the dispute date to 1831, the year after Venezuela became a sovereign state.",
    "The best response is to call them out, and then support our true folks  like Sen. Rev.",
    "Thinks judge Jackson who has adjudicated at every level but SCOTUS isn't qualified.",
    "But Life is impermanence, and we only get one chance to sincerely convey our Love.",
    "None of them took their kids to jazz clubs and rock concerts, but our mom did.",
    "One thing about having a young mom is that when she gets old, you get old too.",
    "We have received the complaint in full from EPA and are reviewing it closely.",
    "(@WillWilkins14) April 11, 2022\nx\nClarence Thomas helped gut voting rights.",
    "Not one of our friends parents taught them about charity and volunteerism.",
    "Today, that area represents some two-thirds of Guyanas national territory.",
    "Twenty years later, the USDA foreclosed on the property and evicted him.",
    "Her memory is slipping, and shes a lot more frail than I want her to be.",
    "x\nTiffany Cross Rips Tim Scott for Remarks on Racism After Biden Speech.",
    "LDEQ handles all issues with a fair and equitable approach,\" he added.",
    "she still shone, still made\nsmooth her every rough\nedge, heel to brow.",
    "And they said mom was a wild child and maybe even a commie beatnik.",
    "x\nI am the candidate for United States Senate from Richland County.",
    "Daniel Cameron refused to indict the cops who killer Breona Taylor.",
    "That goes for media mouthpieces on the right like Candace Owens.",
    "The federal government has admitted it was part of the problem.",
    "The aid was supposed to make up for decades of discrimination.",
    "Even if you aren't in SC, you can\n still support her campaign.",
    "Eddie Wise is one farmer who claimed to face discrimination.",
    "pic.twitter.com/E63QOZvUG3\n Keep Your Covid to Yourself!!!",
    "It's clear that some US Senators want to bring 1891 back.",
    "I hope some of our South Carolina readers will weigh in.",
    "Hes a chicken George dancing, Massuh loving Negrapene.",
    "Herschel Walker IS an embarrassment to the ancestors.",
    "But advocates for Black farmers say problems persist.",
    "\"LDEQ will work with EPA to resolve this matter.",
    "Who was the last US Senator from Columbia, SC?",
    "Tim Scott voted to acquit Donald Trump.",
    "x\nHelp us re-elect Senator Warnock!",
    "He was the son of a sharecropper.",
    "All our skinfolk ain't kinfolk.",
    "\"All skin-folk ain't kinfolk.\"",
    "I even met @JuddForCongress.",
    "It involves two complaints.",
    "He refuses to vote for her.",
    "x\nLets put this on repeat.",
    "All skinfolk aint kinfolk.",
    "Thanks for a fun meeting.",
    "Kick Rocks Racists!!!",
    "And maybe she was.",
    "He voted for her.",
    "Wade Hampton III.",
    "And so we must.",
    "Maybe she was.",
    "Wear a Mask!!!",
    "Warnock.",
    "Period.",
    "."
  ]
}