{
  "id": 7798,
  "mediaId": 120,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Herschel Walker's awkward Fox News interview is hard to watch",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220411-ROB-Herschel-Walker-jg-1e1e55.jpg",
  "link": "https://www.msnbc.com/the-reidout/reidout-blog/herschel-walker-fox-news-oil-rcna23852",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ja'han Jones",
  "authorUrl": "https://www.msnbc.com/author/ja-jones-ncpn371241",
  "termIds": [
    815,
    1136,
    1147,
    2004,
    2087,
    146,
    200,
    584,
    2672,
    2945
  ],
  "sentences": [
    "Walkers claims are hard to follow here, but his rambling response is an attempt to regurgitate debunked Republican talking points arguing that President Joe Bidens policies have ruined the United States ability to rely on our own oil production to run the country.",
    "As CNN reported last year, thats why the former NFL running backs campaign has tried to keep the gaffe-prone candidate, whom former President Donald Trump endorsed in September, buoyed by conservative support and largely out of the public eye.",
    "As a result, Walker has stuck to short public appearances and quick interviews with conservative-leaning outlets and has shied away from highly anticipated events like Saturday's GOP primary debate in Georgia, which he skipped.",
    "At another point in the interview, Walker was asked to respond to reports that he had lied about graduating near the top of his class from the University of Georgia.",
    "Walker tried to do a little rhetorical trickery by volunteering that he graduated high school at the top of his class  which obviously isnt the issue being debated.",
    "Herschel Walker, the apparent GOP front-runner in this year's Senate race in Georgia, has tried to keep a low profile recently for a few obvious reasons.",
    "He couldn't even handle a softball question about why people would prefer him over Raphael Warnock, the Democratic incumbent.",
    "Namely: His political ideas are incoherent and, on top of that, hes infamously bad at communicating them.",
    "If Walker's team thought that would help him evade embarrassment, they were sorely mistaken.",
    "Instead, Walker delivered a meandering response that was detached from reality and syntax.",
    "Walker, however, did appear for an interview with Fox News host Maria Bartiromo on Sunday.",
    "Like other claims hes made, theres no evidence this one is actually true.",
    "Walker later accused his political opponents are being jealous of him.",
    "And it becomes less believable with every word he utters.",
    "(In reality, he didnt graduate at all.)"
  ]
}