{
  "id": 7800,
  "mediaId": 195,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Trump approval ratings still strong in key battleground states: poll",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/03/trumpdonald_022622upi2_lead.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/campaign/3264249-trump-approval-ratings-still-strong-in-key-battleground-states-poll/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Crisp",
  "authorUrl": "https://thehill.com/author/elizabeth-crisp/",
  "termIds": [
    815
  ],
  "sentences": [
    "The Morning Consult surveys found that in each of the states, Trump overwhelmingly ranked more favorable than other prominent Republicans, such as former Vice President Mike Pence, Senate Minority Leader Mitch McConnell (Ky.) and House GOP Leader Kevin McCarthy (Calif.).",
    "In Pennsylvania, Trump recently endorsed former television host Mehmet Oz (R) to replace retiring Sen. Pat Toomey (R)\nHe also is backing former football star Herschel Walker (R) in the Georgia race against Sen. Raphael Warnock (D).",
    "Former President Trump remains overwhelmingly popular among Republican voters in key battleground states heading into the midterm election cycle, according to a new roundup of polls released Monday.",
    "The polls suggest that Trump-backed candidates in those states could greatly benefit from the former presidents support, even as some of his recent endorsements have fallen flat.",
    "Trump hasnt yet endorsed a candidate in the increasingly bitter Ohio battle, but several candidates have courted his attention and touted their support of the former president.",
    "The former president had slightly higher favorability in Georgia (86 percent) and North Carolina (87 percent) than he did in Ohio (80 percent) and Pennsylvania (77 percent).",
    "Nearly 4 in 5 Republican voters surveyed in Georgia, North Carolina, Ohio and Pennsylvania rated Trump favorably, according to Morning Consult surveys conducted in March.",
    "In North Carolina, Trump has endorsed Rep. Ted Budd (R) for the Senate seat being vacated by Sen. Richard Burr (R), who is retiring.",
    "Each of those states have important Senate races that Trump has waded into or where he is considering endorsing a GOP candidate.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Trumps popularity in the four states has remained virtually unchanged since he left office, Morning Consult found.",
    "Morning Consult surveyed at least 855 registered Republican voters in each state from March 1-20.",
    "But it remains to be seen to what extent approval of Trump will transfer to his picks.",
    "The margin of error for each poll is about 3.7 percentage points.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}