{
  "id": 7810,
  "mediaId": 157,
  "date": "4/11/2022 12:00:00 AM",
  "headline": "Clarence Thomas is the only Supreme Court justice to take a photo with a political candidate in history: MSNBC host",
  "image": "https://www.rawstory.com/media-library/clarence-thomas-with-georgia-senate-candidate-herschel-walker-photo-walker-campaign.jpg?id=29667972&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/clarence-thomas-hershel-walker-photo/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    704,
    812,
    815,
    2367,
    6023,
    327,
    482,
    2945
  ],
  "sentences": [
    "See the opener from O'Donnell below:\nClarence Thomas first in history to take political photos with candidates\nNOW WATCH: Russian state TV floats 'revenge plan' against America that hinges on making Trump president again\nRussian state TV floats 'revenge plan' against America that hinges on making Trump president again",
    "\"There's value in members of the high court speaking to audiences outside of Washington, but that concept is corrupted when stretched to rationalize appearing at events that look and sound like political pep rallies.\"",
    "\"If Justice Barrett wants the Supreme Court not to be seen as partisan, she should avoid being hosted by a center named after the most partisan person in America,\" FTC's Gabe Roth told NPR in a statement.",
    "Herschel Walker, who is running for U.S. Senate as a Republican in Georgia, posted a photo of himself with Thomas, which MSNBC's Lawrence O'Donnell is the only one to have posed for such a photo.",
    "Recently, Supreme Court justices have spoken out about the criticism that the court has taken a dramatic turn to support right-wing politics that are out of step with mainstream American values.",
    "O'Donnell said that his research team looked for photos throughout history and that only once has a justice done such a photo and is using it for his political campaign.",
    "Supreme Court Justice Clarence Thomas is the only justice in the entire history of the High Court that has taken a photo with a political campaign candidate.",
    "By doing this, you continue to chip away at the respect of the institutions that the next generation is going to need if theyre going to have civil society.",
    "At some point the institution is going to be compromised,\" said Justice Thomas while speaking at a hotel in Salt Lake City in March.",
    "\"To say the court's reasoning is flawed is different from saying the court is acting in a partisan manner,\" Barrett said.",
    "\"Remember one Harvard law professor Elizabeth Warren was running for Senate for the first time?",
    "And she went to the supreme court for a campaign photo-op with Ruth Bader Ginsberg?\"",
    "\"No, you don't remember that because that never happened, and never could happen.\"",
    "\"I think we need to evaluate what the court is doing on its own terms.\"",
    "These comments came after he posed for the photo with Walker.",
    "You can cavalierly talk about doing this or doing that.",
    "asked O'Donnell."
  ]
}