{
  "id": 7813,
  "mediaId": 136,
  "date": "d2022-04-10T19:48",
  "headline": "Herschel Walker Claims 'There's No Food on the Shelf' in U.S., Slams Biden",
  "image": "https://d.newsweek.com/en/full/2017900/herschel-walker-weighs-food-supply.webp?w=790&f=1af41d05494e8d23e529b4aed946c36a",
  "link": "https://www.newsweek.com/herschel-walker-claims-theres-no-food-shelf-us-slams-biden-1696737",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fatma Khaled",
  "authorUrl": "https://www.newsweek.com/authors/fatma-khaled",
  "termIds": [
    815,
    1136,
    2004,
    2087,
    428,
    571,
    2945
  ],
  "sentences": [
    "The GOP candidate, who will challenge Democratic Senator Raphael Warnock in the upcoming midterm race in Georgia, blamed the Biden administration for not being energy independent enough saying that there are \"enemies negotiating deals for us,\" which he called \"ridiculous.\"",
    "Republican U.S. Senate candidate Herschel Walker claimed Sunday that the country is facing a food shortage, along with an increase in gas prices, while also targeting President Joe Biden on the country's lack of energy independence.",
    "The U.S. Department of Agriculture (USDA) said Friday that grocery store and supermarket prices will rise by another 3 to 4 percent this year and are \"expected to exceed historical averages and the inflation rate in 2021.\"",
    "Biden has been criticized for the way he is handling inflation, with around 70 percent of Americans saying they are not pleased about it, according to an ABC News/Ipsos poll last month.",
    "The figure is a little higher than the 69 percent, who disapprove of Biden's response to inflation, that was recorded in previous ABC/Ipsos polls last year and earlier this year.",
    "Senate Minority Leader Mitch McConnell has previously criticized Biden's suggestion that the increase in gas prices is to be blamed on Russian President Vladimir Putin.",
    "But in the last few days, the Biden administration has tried to invent some laugh-out-loudlaugh-out-loud revisionist history,\" he said from the Senate floor last month.",
    "The USDA also said that the Consumer Price Index, which is an overall measure of economy-wide inflation, rose by 7.9 percent between February 2021 and February 2022.",
    "The poll also found that 70 percent of respondents are unhappy with the way the president is handling the surge in gas prices compared to 28 percent that approve.",
    "Russia's invasion of Ukraine pushed oil prices up globally, while inflation in the U.S. reached 7.5 percent in January, the highest figure in four decades.",
    "However, 77 percent of Americans back the president's decision to ban Russian oil imports even if that translates into higher gas prices.",
    "You see there's no food on the shelf,\" he said during an interview with Fox News host Maria Bartiromo on Sunday Morning Futures.",
    "\"Democrats' reckless spending that's fueled across-the-board inflation have made Americans' pain at the pump even worse.",
    "Inflation is expected to reach an average 5.7 percent in the fourth quarter of this year, Bloomberg reported Sunday.",
    "\"One of the first things they did is they decided they are going to give up our energy,\" Walker explained.",
    "\"By him [Biden] going out and giving up our energy, now we're not energy independent anymore.\"",
    "\"I think people need to know that and they're blaming everyone else except themselves.\"",
    "Newsweek reached out to the White House for comments.",
    "\"Right now, gas prices are going out of the roof."
  ]
}