{
  "id": 7817,
  "mediaId": 157,
  "date": "4/10/2022 12:00:00 AM",
  "headline": "Herschel Walker cites Michael Jackson's 'Man in the Mirror' to call for more oil drilling",
  "image": "https://www.rawstory.com/media-library/herschel-walker.jpg?id=29662500&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/herschel-walker-michael-jackson/",
  "sentiment": "-0.469",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Edwards",
  "authorUrl": "https://www.rawstory.com/u/david_edwards",
  "termIds": [
    815,
    2004,
    2087,
    4453,
    428,
    2672,
    2945
  ],
  "sentences": [
    "You know, this country -- this is one of the most environmental drilling countries in the world but, yet, we're walking on all the resources we have underneath our feet.\"",
    "A day after skipping the first Republican debate for U.S. Senate in Georgia, Walker spoke about energy prices during an appearance on Fox News with host Maria Bartiromo.",
    "Walker added: \"I think they've got to remember that the song Michael Jackson said, the 'Man in the Mirror,' you've got to look at yourself and see what's going on.",
    "Republican U.S. Senate candidate Herschel Walker used Michael Jackson's \"Man in the Mirror\" anthem on Sunday to call for more oil drilling in the United States.",
    "\"One of the first things they did is they decided they are going to give up our energy,\" Walker complained in reference to President Joe Biden.",
    "\"By him going out and giving up our energy, now we're not energy independent anymore, which started the whole downfall.\"",
    "\"And I think people need to know that and they're blaming everyone else except themselves.\"",
    "The candidate insisted that he would fight for what is right because he is a Christian.",
    "Right now, you see there's no food on the shelf,\" he continued.",
    "\"I told people I'm a warrior of God,\" he explained.",
    "\"I'm going to get in there and do the right thing.\"",
    "\"Right now, gas prices are going out of the roof.",
    "Watch the video below from Fox News."
  ]
}