{
  "id": 7819,
  "mediaId": 195,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "Sunday shows preview: Ukraine, West condemn Russian attacks on civilians",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/02/sullivanjake_02112022ap.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/sunday-talk-shows/3263279-sunday-shows-preview-ukraine-west-condemn-russian-attacks-on-civilians/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lexi Lonas",
  "authorUrl": "https://thehill.com/author/lexi-lonas/",
  "termIds": [
    815,
    2303,
    3094
  ],
  "sentences": [
    "Fox News Sunday  White House press secretary Jen Psaki; Sen. Mitch McConnell (R-Ky.)\nFox News Sunday Morning Futures  Ranking member of House Judiciary Committee Rep. Jim Jordan (R-Ohio); Herschel Walker, Georgia Senate candidate; House Minority Leader Rep. Kevin Mccarthy (R-Calif.); U.S. Army combat veteran and Florida Congressional candidate Cory Mills.",
    "CBS Face the Nation  Sullivan; Oksana Markarova, Ukrainian ambassador to the U.S.; Dr. Scott Gottlieb, former Food and Drug Administration commissioner; former Homeland Security Secretary Jeh Johnson; Federal Reserve Bank of Cleveland President Loretta Mester.",
    "Indeed, I started my day today with a visit to Bucha because being in Bucha and seeing what has happened, you can tell that our humanity was shattered in Bucha, von der Leyen, who will appear on CNNs State of the Union, said.",
    "White House national security advisor Jake Sullivan detailed to the press this week a change in Russias strategy in Ukraine, saying the country will focus its attacks on the Donbas region in eastern Ukraine.",
    "International condemnation has been widespread, with the U.S. passing bipartisan legislation in the House forcing the Biden administration to reveal details of how it is tracking war crimes in Ukraine.",
    "Ukrainian Foreign Minister Dmytro Kuleba, who will appear on NBCs Meet the Press, accused the Russians this week of knowingly bombing a train that was full of civilians, killing women and children.",
    "Along with the war in Ukraine, the Biden administration this week had to contend with reports that White House Press Secretary Jen Psaki will be leaving the administration for a spot at MSNBC.",
    "); European Commission President Ursula von der Leyen; Canadian Prime Minister Justin Trudeau; Global Citizen CEO Hugh Evans; former CIA Director Gen. David Petraeus.",
    "Sullivan will appear on ABCs This Week, NBCs Meet the Press, CBS Face the Nation and CNNs State of the Union Sunday to discuss the ongoing conflict in Ukraine.",
    "Russia is repositioning its forces to concentrate its offensive operations in eastern and parts of southern Ukraine rather than target most of the territory.",
    "Ukrainian officials have been sounding alarms for weeks regarding alleged crimes Russia has committed, urging the West to do more to combat Russias attack.",
    "European Commission President Ursula von der Leyen visited Ukraine this past week and met with Ukrainian President Volodymyr Zelensky amidst the fighting.",
    "Below is the full list of guests scheduled to appear on this weeks Sunday talk shows:\nABCs This Week  White House national security adviser Jake Sullivan.",
    "This weeks Sunday show circuit will focus around the alleged war crimes Russia has committed in Ukraine and Western countries reactions to the atrocities.",
    "Russia forces have been accused of targeting civilians, raping women and kidnapping individuals during the war that began at the end of February.",
    "As the war continues, the House passed a bill this week instructing the government to collect war crimes evidence in the Russian-Ukrainian war.",
    "The bill was voted against by six Republicans as Democrats used the opportunity to paint the GOP as sympathetic to Russia during the crisis.",
    "House Minority Leader Kevin McCarthy (R-Calif.) previously had to denounce Rep. Madison Cawthorn (R-N.C.) for calling Zelensky a thug.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "NBCs Meet the Press  Sullivan; Ukrainian Foreign Minister Dmytro Kuleba; former Treasury Secretary Larry Summers.",
    "Psaki, who will appear on Fox News Sunday, is set to leave the administration in May for her new role.",
    "At this juncture we believe that Russia is revising its war aims, Sullivan said.",
    "McCarthy will appear on FOX News Channels Sunday Morning Futures.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "CNNs State of the Union  Sullivan; Rep. Liz Cheney (R-Wyo."
  ]
}