{
  "id": 7822,
  "mediaId": 98,
  "date": "4/8/2022 12:00:00 AM",
  "headline": "Guests on Sunday Talk Shows: Ukrainian President Volodymyr Zelensky will be on 60 Minutes",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/b71c5e4/2147483647/strip/true/crop/5045x2989+0+0/resize/840x498!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0a%2Ff8%2Fda9b4ad34887a06568c5752a5709%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1239750400",
  "link": "https://www.latimes.com/entertainment-arts/tv/story/2022-04-08/guests-on-sunday-talk-shows-ukrainian-president-volodymyr-zelensky-will-be-on-60-minutes",
  "sentiment": "0.0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Stockly",
  "authorUrl": "https://www.latimes.com/people/ed-stockly",
  "termIds": [
    815,
    3094
  ],
  "sentences": [
    "(N) 7 a.m. MSNBC\nFace the Nation National Security Advisor Jake Sullivan; Oksana Markarova, Ukraines ambassador to the U.S.; former FDA commissioner Scott Gottlieb; former Secretary of Homeland Security Jeh Johnson; Loretta Mester, Federal Reserve Bank of Cleveland.",
    "(N) 7 and 10 a.m. CNN\nSunday Morning Futures With Maria Bartiromo Rep. Jim Jordan (R-Ohio); U.S. Senate candidate Herschel Walker (R-Ga.); House Minority Leader Rep. Kevin McCarthy (R-Bakersfield); U.S. House candidate Cory Mills (R-Fla.).",
    "(N) 7 a.m. and noon Fox News\nThe Sunday Show With Jonathan Capehart Pierre-Richard Prosper, former U.S. ambassador-at-large to the U.N. for war crimes; Labor Secretary Marty Walsh; Mayor Eric Adams (D-N.Y.).",
    "Abigail Disney responds to right-wing media attacks against the Walt Disney Co. Study follows viewers who stop watching Fox News: David Broockman, UC Berkeley; Joshua Kalla, Yale.",
    "(N) 7:30 a.m. and Monday, 3 a.m. KCBS\nMeet the Press Ukrainian Foreign Minister Dmytro Kuleba; National Security Advisor Jake Sullivan; former Treasury Secretary Larry Summers.",
    "); Ursula von der Leyen, president of the European Commission; Justin Trudeau, prime minister of Canada; Hugh Evans, Global Citizen; former CIA director David Petraeus.",
    "Europe buying Russian energy: Author Meghan OSullivan (Windfall: How the New Energy Abundance Upends Global Politics and Strengthens Americas Power \").",
    "(N) 7 p.m. KCBS\nThe Circus: Inside the Greatest Political Show on Earth Judge Jacksons confirmation vote: White House nomination advisor Minyon Moore.",
    "CBS News Sunday Morning (N) 6 a.m. KCBS; 10 a.m. KCAL\nGood Morning America (N) 6 a.m. KABC\nState of the Union Rep. Liz Cheney (R-Wyo.",
    "4:30 p.m. and 12:35 a.m. KTLA\n60 Minutes Ukrainian President Volodymyr Zelensky; a village in El Salvador with a Bitcoin economy.",
    "(N) 8 a.m. CNN\nMediaBuzz Ben Domenech; Liz Claman; Dmitry Anopchenko, Ukrainian journalist; Charlie Gasparino; Richard Fowler.",
    "(N) 6 and 9 a.m. CNN\nFareed Zakaria GPS Russia and accusations of war crimes: Former British Prime Minister Gordon Brown.",
    "(N) 8 a.m. and 1:30 a.m. KNBC; 1 a.m. MSNB\nThis Week With George Stephanopoulos Mayor Vitali Klitschko, Kyiv, Ukraine.",
    "(N) 8 a.m. KTTV; 11 a.m. and 11 p.m. Fox News\nReliable Sources With Brian Stelter Twitter; Warner Bros.",
    "Midterm elections: Rep. Stephanie Murphy (D-Fla.); pollster Terrance Woodbury; Ted Lieu (D-Torrance).",
    "Discovery and NBC: Kara Swisher, the New York Times; Oliver Darcy; Claire Atkinson, Insider.",
    "Panel: Brit Hume; Julie Pace, Associated Press; Harold Ford Jr.; Anchored by Dana Perino.",
    "Panel: Kimberly Atkins Stohr; Rep. Carlos Curbelo (R-Fla.); Josh Lederman; Anna Palmer.",
    "The disinformation war and Russias invasion of Ukraine: Anne Applebaum, the Atlantic.",
    "(N) 8 a.m. Fox News\nFrank Buckley Interviews Author and professor William Deverell.",
    "(N) 8 a.m. and 2 a.m. KABC\nFox News Sunday Sen. Mitch McConnell (R-Ky.).",
    "Panel: Chris Christie; Donna Brazile; Rick Klein; Laura Barrn-Lpez.",
    "How Russians see the war in Ukraine: Masha Gessen, the New Yorker.",
    "National Security Advisor Jake Sullivan; Dr. Anthony Fauci.",
    "You can find more TV coverage at: latimes.com/whats-on-tv.",
    "National Institute of Allergy and Infectious Disease.",
    "The prime-time TV grid is on hiatus in print.",
    "Molly Hunter reports from Ukraine.",
    "House Press Secretary Jen Psaki.",
    "(N) 8 and 8:30 p.m. Showtime"
  ]
}