{
  "id": 7827,
  "mediaId": 12,
  "date": "4/7/2022 12:00:00 AM",
  "headline": "Cruise control? Walker ignores rivals, aims for Warnock ahead of May primary",
  "image": "https://www.ajc.com/resizer/Y1OLkYewt2TU6XFMot8fIqpH44I=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/CE335QCZHPIVASHN4MHX3RGF6Y.jpg",
  "link": "https://www.ajc.com/politics/cruise-control-walker-ignores-rivals-aims-for-warnock-ahead-of-may-primary/OS6D3EZK7BCW7FDWWXEXMKMQIE/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815
  ],
  "sentences": [
    "With near-universal name recognition in football-mad Georgia and sizable leads in the polls, hes ignored his Republican opponents, avoided many media interviews and stuck to a regimen of mostly closed-door fundraisers, private gatherings and other tightly controlled appearances.",
    "Despite his campaigns efforts to closely guard his image, a series of stumbles and fresh stories about past episodes of violence and erratic behavior have drawn heaps of attention that seem certain to follow him through a likely November matchup against Warnock.",
    "DAHLONEGA  Taking the stage of a packed gym in the foothills of North Georgia, Herschel Walker gave the audience exactly what they wanted: a raft of conservative campaign promises, including a pledge to rid the state of Democratic U.S. Sen. Raphael Warnock.",
    "Along the way, hes received endorsements from both former President Donald Trump and Senate Minority Leader Mitch McConnell, plus a cast of other state and national figures, that has his campaign so confident hes skipping debates against GOP rivals.",
    "Warnock has set a string of U.S. Senate fundraising records and reported roughly $23 million in his campaign account in his latest disclosure, money hell use to promote his reelection and unspool attacks on his opponents.",
    "And unlike other Trump-backed candidates at the former presidents March rally in northeast Georgia, he didnt bring up lies about 2020 election fraud or center his speech on his allegiance to the former president.",
    "Two outside groups aligned with Black and Saddler have pledged to work together to weaken Walkers campaign, though some political experts are skeptical theyll have the time or resources to influence the race.",
    "The Rabun County GOP became perhaps the first county organization in the state to pass a no-confidence resolution after Walker refused to engage in debates or take questions from voters at town halls.",
    "No coach would send an untested football player into the state championship who refused to practice, has no record of performance in debates, the resolution states without calling out Walker by name.",
    "Early voting starts in less than a month, lending new urgency to Walkers rivals who say the primary shouldnt be a coronation  and that Walkers baggage will render him unelectable in November.",
    "And the pro-Democratic Senate Majority PAC has reserved more than $24.4 million worth of airtime in Georgia through the final stretch of the November election, according to media buyers.",
    "Among those who packed the gym that day was Franz Mendez of Fayetteville, who confided that he didnt vote in the January 2021 Senate runoffs because he was so disgusted with politics.",
    "Any other statewide candidate might feel pressure from stinging attacks by opponents, damaging revelations about his past and a string of blunders that have made national headlines.",
    "And former Navy SEAL Latham Saddler, in third place in some GOP primary polls, aired an ad on Fox News this week framing the race as a choice between a war fighter and a celebrity.",
    "He made waves when he distanced himself slightly from U.S. Rep. Marjorie Taylor Greene by pulling out of her pro-gun rally following her appearance at a white nationalist event.",
    "Walkers best-known Republican rival, Agriculture Commissioner Gary Black, released a video of possible November attacks from Democrats that sent a stir through the Georgia GOP.",
    "Hes threading the needle between playing golf with Trump and urging people to vote, said Martha Zoller, a conservative commentator and former GOP congressional candidate.",
    "Instead, Walker said, they want to talk about my high school report card, how bad of a candidate I am and why I shouldnt be a senator because Im not a career politician.",
    "But for the Republican Senate front-runner, who has headlined only a handful of large-scale public events, it encapsulates his strategy ahead of the May 24 primary.",
    "His Republican rivals, however, have struggled to bring him under the majority-vote threshold he needs to win the GOP nomination in May and avoid a June runoff.",
    "Some polls give him more than 70% of the vote, and he has yet to mention his Republican rivals by name  a sure sign that, so far, hes not worried about threats.",
    "In public messaging, mostly in the form of statements or social media posts, Walker brushes aside the criticism leveled against him as media-made distractions.",
    "And thats when they will compare Warnock to Walker side by side, said Jason Carter, a former state senator who was the Democratic nominee for governor in 2014.",
    "Near the end of his speech in Dahlonega, Walker broke into a melancholy melody that, he related to the crowd, he sang as a child while battling depression.",
    "That includes his ex-wife telling authorities that Walker pointed a gun at her and choked her, which persuaded a judge to grant her a restraining order.",
    "Dan McLagan, a veteran GOP strategist who is advising Blacks campaign, summed up Walkers challenge this way: Attacking his opponents wont help him.",
    "Behind the scenes, Walkers campaign has tested each of the attacks against him in extensive polls, with one adviser saying none proved to be fatal.",
    "More broadly, she added, his struggles with mental illness, including dissociative identity disorder, made him a more compelling candidate.",
    "He has falsely claimed he graduated from the University of Georgia and bungled the concept of evolution, drawing widespread criticism.",
    "A separate analysis by The Atlanta Journal-Constitution showed a pattern of exaggerated claims about his business background.",
    "But Walker is running his campaign as if hes in cruise control ahead of the May showdown against several lesser-known rivals.",
    "Clint Dark of Nicholson tripped over himself at Trumps March rally in Commerce to try to get a selfie with the candidate.",
    "Hes for us\nBut Walkers soaring celebrity brings a level of unpredictability that has senior Democrats worried, too.",
    "In a recent note to campaign donors, he accused journalists of ignoring soaring inflation and illegal immigration.",
    "And hes doing the (Joe) Biden basement strategy, expecting to be handed this thing, Saddler said in an interview.",
    "Another, military veteran Kelvin King, said Walker is trying to turn the race into an autograph tour.",
    "A few days ago, he wrongly asserted that NATO wasnt supporting Ukraine in its fight against Russia.",
    "An Emerson College poll released Tuesday pegged Walker at 57%; others have put him even higher.",
    "He has issued confounding answers to questions about voting rights and infrastructure policy.",
    "He said he views Walker as a rare candidate who can motivate disenchanted Georgians like him.",
    "Walkers recent visit to the Lumpkin County GOP might have seemed like standard campaign fare.",
    "I can promise you Herschel Walker is going to be in this race, the former football star said.",
    "The power of Walkers brand was on vivid display at several of his recent public appearances.",
    "Lately, hes talked more about fighting inflation and lowering the cost of fuel and insulin.",
    "New reports have also shone a spotlight on a history of allegations of domestic violence.",
    "Kim Pyron, the owner of a local tea shop, said Walkers remarks came from the heart.",
    "There are a whole lot of other people who have a lot more problems, Pyron said.",
    "Instead, Walker continues to position himself for a general election matchup.",
    "He represents everything I stand for, Dark said, after composing himself.",
    "He abandoned Georgia, came back just to run for the United States Senate.",
    "Hes not hiding from it, and that makes him more honest and believable.",
    "True enemy\nWalker has shown little interest in changing his strategy.",
    "Once you get out of the primary, other voters start to pay attention.",
    "In a great state like ours, a U.S. Senate race should be difficult.",
    "Instead, he opened with a pledge to restrict transgender athletes.",
    "Im a longtime Herschel Walker fan, Republican and conservative.",
    "Our freedoms, our constitutional rights, the Second Amendment.",
    "Hes not doing anything that will tear down any Republicans.",
    "Some in the audience said it made them uncomfortable.",
    "If I dont stand up, who is going to stand up for us?",
    "Warnock wants to just fight for Democrats, he said.",
    "Democrats, not surprisingly, have a different view.",
    "Its time for (Warnock) to know hes in for a fight.",
    "But why would he try to do more in this primary?",
    "There are also signs of grassroots pushback.",
    "His GOP opponents are running out of time.",
    "That will be very bad for Herschel Walker.",
    "The attacks could ramp up significantly.",
    "(His leading critics see it differently.",
    "Herschel wants to fight for both sides.",
    "I didnt get in this race to play games.",
    "And its time my opponent knows that.",
    "I dont worry about his past at all.",
    "Herschels true enemy is Herschel.)",
    "Hes open and transparent about it.",
    "Hes got nowhere to go but down.",
    "I dont know if hes invincible.",
    "Others found it endearing.",
    "Hes an upstanding man.",
    "Hes not against us.",
    "Autograph tour?",
    "Zoller said.",
    "Hes for us."
  ]
}