{
  "id": 7831,
  "mediaId": 98,
  "date": "4/7/2022 12:00:00 AM",
  "headline": "The Sports Report: Whats next for the Lakers?",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/e822c1d/2147483647/strip/true/crop/5400x3600+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3c%2Fa9%2Ffdc7fa244711b61fff07739a7b94%2Flakers-jazz-basketball-95948.jpg",
  "link": "https://www.latimes.com/sports/newsletter/2022-04-07/lakers-disappointment-sports-report",
  "sentiment": "0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    5679,
    5710,
    5752,
    5766,
    5805,
    5808,
    6025,
    6028,
    5608,
    5609
  ],
  "sentences": [
    "In a season that has been one, long waiting game for the Clippers trio of injured stars to return, Wednesday marked the moment two-thirds were together for the first time, and if Norman Powells performance in his first game since Feb. 10 turned heads, his first minutes together with George as Clippers turned a 113-109 Clippers victory with otherwise little bearing on how a potential first-round series could look into one teeming with possibility for the Clippers.",
    "As Phoenix, playing on a second consecutive night, rested Chris Paul, Devin Booker and Deandre Ayton, the players most responsible for its NBA-best and franchise-record 63 victories, Powell made his first six baskets in his first action since fracturing a bone in his toe on Feb. 10, just three games after being acquired by the Clippers in a trade with Portland to become one of the teams future cornerstones alongside George and Kawhi Leonard.",
    "Now the question becomes how do Rob Pelinka, the Lakers vice president of basketball operations and general manager, and Kurt Rambis, the teams senior basketball advisor, build a team for next season that will give their fans hope for better results following this disastrous season during which the Lakers were eliminated from NBA play-in tournament contention on Tuesday night in Phoenix.",
    "He scored 17 first-half points on a mix of catch-and-shoot three-pointers and curls to the rim after taking handoffs from center Isaiah Hartenstein that he finished with the kind of bounce that attracted the Clippers to his potential playing off of George and Leonard as an dangerous, and probably overqualified, third scoring option.",
    "ANGELS\nFrom Mike DiGiovanna: This is the year the Angels have the pitching, hitting and defense to win the American League West, when they stay healthy and play well enough to snap a seven-year playoff drought and send two of baseballs most transcendent stars, Shohei Ohtani and Mike Trout, to the postseason.",
    "To which most Angels fans, hardened by years of rickety rotations, threadbare bullpens, injuries to key players, failed free-agent pursuits and an abundance of overpaid and underachieving veterans, would respond: Yeah, right.",
    "Like George in his efficient return from a 43-game absence one week earlier, Powell betrayed little rust in his own return, scoring 24 points on 10 shots, aided by nine-of-10 shooting at the free-throw line.",
    "From Dan Woike: The Lakers were built on the hope this season that the Big Three of LeBron James, Anthony Davis and Russell Westbrook could deliver the franchise an NBA-best 18th championship.",
    "Its a bustling business for Reading, selling Augusta National memorabilia out of Trends & Traditions Antique Mall just down Washington Boulevard from the worlds most exclusive golf course.",
    "I think probably starting pitching depth, Roberts told reporters on the last day of spring training in Arizona, when asked what part of the team concerns him when he unwinds every night.",
    "The Lakers have just four players under contract for next season  James ($44.4 million), Davis ($37.9 million), Talen Horton-Tucker ($10 million) and Austin Reaves ($1.5 million).",
    "CLIPPERS\nFrom Andrew Greif: With a pair of second-quarter free throws in a runaway Wednesday win, Paul George became only the 16th active NBA player with at least 15,000 points.",
    "But the real milestone  the one that alters the Clippers postseason potential, at least  was reached 10 minutes earlier when George checked in to begin the second quarter.",
    "Presumably, Westbrook will opt in, considering how much hes due to earn, and so will Nunn, since he hasnt played all season because of a bone bruise in his right knee.",
    "2014  Shabazz Napier scores 22 points and Connecticut wins its second NCAA mens title in four years, beating the freshmen-led Kentucky 60-54 in the championship game.",
    "For all the talent the Dodgers have amassed in their collection of starting pitchers, they are lacking the proven depth theyve grown accustomed to in recent years.",
    "Until they show theyre good enough and deep enough to contend for a playoff berth, they wont shed the narrative of negativity that has dogged them for seven years.",
    "If you have any feedback, ideas for improvement or things youd like to see, email me at houston.mitchell@latimes.com, and follow me on Twitter at @latimeshouston.",
    "1956  Joe Graboski scores 29 points and Paul Arizin 26 as the Philadelphia Warriors beat the Fort Wayne Pistons 99-88 to win the NBA championship in five games.",
    "Pelinka and Rambis will be challenged to put together a championship roster for next season that wont be old and slow like this current underwhelming rendition.",
    "2008  Mario Chalmers hits a 3-pointer with 2.1 seconds left in regulation to force overtime, and Kansas goes on to defeat Memphis 75-68 for the NCAA title.",
    "The Lakers were also built on the hope that aging future Hall of Famers and role players had strong enough backs to be serious contenders for the crown.",
    "Only a small percentage of people who enter the annual Masters ticket lottery actually win, so people such as Reading are there to soften the blow.",
    "While a star-studded lineup is the most impressive part of the 2022 Dodgers, the success of their starting rotation might be the most important.",
    "2009  Tina Charles scores 25 points and grabs 19 rebounds and Connecticut routs Louisville 76-54 to capture its sixth womens basketball title.",
    "2010  Don Nelson sets the NBA career record for victories by a coach in the Golden State Warriors 116-107 win over the Minnesota Timberwolves.",
    "1985  New Jerseys Herschel Walker rushes for a USFL-record 233 yards in leading the Generals to a 31-25 victory over the Houston Gamblers.",
    "The Angels are 1,600 miles from Missouri, but they open the 2022 season against the Houston Astros on Thursday night in a show-me state.",
    "Westbrook was asked late Tuesday night whether hed like to see what they can accomplish if healthy next season with that trio intact.",
    "1998  Al MacInnis has a goal and an assist in St. Louis 5-3 loss at Detroit to become the sixth NHL defenseman to reach 1,000 points.",
    "They can give a qualifying offer to Mason Jones ($1.5 million), who is a restricted free agent after his two-way contract expires.",
    "2016  The Golden State Warriors become the second team to win 70 games in a season by beating the San Antonio Spurs 112-101.",
    "1996  Dave Andreychuk scores a goal for his 1,000th career point, and the New Jersey Devils top the New York Rangers 4-2.",
    "James, Davis and Westbrook played just 21 games together this season because of multiple injuries to James and Davis.",
    "Old hat, yellowed scorecard, weathered press badge, vintage program ... CJ Reading is looking for any of those.",
    "From Jack Harris: Dave Roberts said he believes the Dodgers could have one of the best rotations in baseball.",
    "Yes, we want to be able to see what that looks like, what that entails over the course of an 82-game season.",
    "His sextuple bogey is the worst score on the first hole at the Masters, beating the old mark by two strokes.",
    "Walker breaks his own USFL record for the longest run from scrimmage by going 89 yards on his second carry.",
    "And at the dawn of a new season, it is shaping up to be perhaps the most consequential area of the roster.",
    "The onetime chain restaurant chef, as with others in the area, now turns all things Masters into green.",
    "People are just dying to go, said Reading, who got the nickname Crazy Johnny in high school, hence CJ.",
    "They went 11-10 in those games, hardly inspiring confidence that this was a championship-quality team.",
    "2016  Ernie Els, winner of four major titles, opens with a 10 on the par-4 first hole at the Masters.",
    "I think its about our starting pitching, Roberts said while making his title guarantee to Patrick.",
    "1963  Jack Nicklaus becomes the youngest Masters winner at 23, beating Tony Lema by a stroke.",
    "THIS DATE IN SPORTS\n1940  Jimmy Demaret wins the Masters by four strokes over Lloyd Mangrum.",
    "First of all, I understand the skepticism, absolutely, I do, Angels manager Joe Maddon said.",
    "UConn (39-0) wins every one of its 39 games by double digits, a first in college basketball.",
    "Two others have player options  Westbrook ($47.1 million) and Kendrick Nunn ($5.2 million).",
    "2007  Michigan State beats Boston College 3-1 for its first NCAA hockey title in 21 years.",
    "The ceiling is as high as ever for the group, but the floor also seems precariously low.",
    "Coach Geno Auriemma ties UCLAs John Wooden for the most titles in college basketball.",
    "Mangrum opens with a 64, a course record by two strokes that stands for 46 years.",
    "They also have Wenyen Gabriel signed through next season on a two-way contract.",
    "Id put us somewhere in the top 10, he said on The Dan Patrick Show last month.",
    "You may occasionally receive promotional content from the Los Angeles Times.",
    "And finally\nKansas defeats Memphis to win the mens basketball title in 2008.",
    "2015  UConns women down Notre Dame 63-53 for their 10th NCAA championship.",
    "And like Ive said all season long, you got to play the cards youre dealt.",
    "1946  Herman Keiser edges Ben Hogan by one stroke to win the Masters.",
    "2003  Syracuse wins the NCAA title with an 81-78 victory over Kansas.",
    "1951  Ben Hogan takes the Masters by two strokes over Robert Riegel.",
    "Its like if you score a Rolling Stones ticket and youre a music fan.",
    "If they happen to be autographed by a famous golfer, all the better.",
    "Its also the group that worries the seventh-year manager the most.",
    "So, I just hope that we have a chance to be able to do something.",
    "The Lakers have a team option on Stanley Johnson ($2.3 million).",
    "I think thats probably the thing that occupies my mind.",
    "After his first two shots, Els seven-putts from 2 feet.",
    "Until next time...\nThat concludes todays newsletter.",
    "To get this newsletter in your inbox, click here.",
    "You kinda gotta take one day at a time each day.",
    "Nelsons 1,333 wins surpass Lenny Wilkens total.",
    "But were not sure if thats guaranteed neither.",
    "GOLF\nFrom Sam Farmer: The Masters is old hat.",
    "He played 23 minutes, his workload capped.",
    "Howdy, Im your host, Houston Mitchell.",
    "You cant always get what you want.",
    "But nothing is promised, he said.",
    "And they have every right to be.",
    "It turned out to be false hope.",
    "Just keeping our guys healthy.",
    "Lets get right to the news.",
    "I mean, thats the plan.",
    "Watch and listen here.",
    "Yeah."
  ]
}