{
  "id": 7833,
  "mediaId": 43,
  "date": "4/7/2022 12:00:00 AM",
  "headline": "Everybody Knows",
  "image": "https://images.dailykos.com/images/763576/story_image/dunce0.jpg?1580939242",
  "link": "https://www.dailykos.com/story/2022/4/7/2090638/-Everybody-Knows",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "But they also know most people dont know diddly squat about the complex science behind sex chromosomes and the various hormones that make sex a broad spectrum and that non-binary people are WAY more common than they learned in Sunday school or their biology classes based on a 1960s understanding of genetics and human development.",
    "Everybody knows women dont negotiate as well as men, thats why they have lower pay Everybody knows the real problem with race is talking about it Everybody knows that being a cop is dangerous Everybody knows we cant do anything about climate change Everybody knows that COVID is just a bad cold And on and on and on.",
    "But theyre playing to the everybody knows that a heartbeat means youre alive and hoping they can smuggle their warped religious views into the nations laws without getting challenged on the First Amendment.",
    "Hell, Scotts entire 11 point plan to restore America is basically Everybody knows (random blather) with appeals to frightened white Americans to justify bigotry, hatred, and isolationist policies.",
    "And they get massive help from a lazy media who rarely if ever calls them out on their bullshit because theyre worried theyll be seen as elitist or suffering from liberal bias if they do.",
    "What she was really saying was everybody knows what a woman is and when pressed the GOP mostly fell in line with the two X chromosomes dodge as if science was their justification.",
    "Science shows there are electric impulses on what amounts to a bulge in an artery but it isnt a heartbeat since there is no heart and the beat is sporadic and weak.",
    "While appeals to the common man have a long history in American politics I think this recent wave is the natural outcome of Trumps election.",
    "Its part of his Big Lie about the election, he doesnt have facts he has everyone knows I was too popular to lose without Biden cheating!",
    "It's going to get worse...\nIve been watching America from the outside for several months now and Im seeing something that concerns me.",
    "When Marsha Blackburn tried to play the gotcha card in her attempt to get Ketanji Brown Jackson to define a woman she was using this.",
    "He played into these themes hard for his entire campaign and (thankfully) one term in office and still relies on it.",
    "Their real justification was God created man and woman but they know they cant say that out loud.",
    "And while he seems to be fading there are many, many wannabes eagerly embracing this strategy.",
    "There is a concerted effort by the GOP to embrace ignorance that Im calling Everybody Knows.",
    "(The Senate just confirmed her, congrats to Justice Ketanji Brown Jackson!)",
    "Again this is something they claim science proves but thats not true.",
    "There are so many of these it could be turned into a series.",
    "From Empty Greene to Herschel Walker to Rick Scott.",
    "Another example is abortion stops a beating heart.",
    "Here are some recent examples.",
    "Im seeing it everywhere.",
    "Thats his entire case.",
    "It wasnt."
  ]
}