{
  "id": 7842,
  "mediaId": 19,
  "date": "4/5/2022 12:00:00 AM",
  "headline": "More Vulnerable Democrats Blast Bidens Ending Title 42 at Border",
  "image": "https://media.breitbart.com/media/2022/04/GettyImages-1068193542-1-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/05/more-vulnerable-democrats-blast-bidens-ending-title-42-at-border/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    815
  ],
  "sentences": [
    "Sen. Raphael Warnock (D-GA), facing a challenge from Republican Senate candidate Herschel Walker, said in a statement on Tuesday that it is not the right time to end Title 42 ,as Biden set a new record for illegal immigration with more than 209,000 apprehensions in March, alone.",
    "Ending this policy without sufficient preparation risks undermining our national security  ending Title 42 is expected to cause a significant increase of migration to the United States and put more pressure on an already broken system, Tester wrote.",
    "Biden officials admit that lifting Title 42 is likely to bring a massive influx of border crossers and illegal aliens to the border, with potentially 500,000 arriving at the border every month  more than doubling current illegal immigration levels.",
    "Sen. Jon Tester (D-MT), facing re-election in 2024, warned that ending Title 42 is almost certain to spur a significant increase in illegal immigration in a letter to Bidens Department of Homeland Security (DHS) Secretary Alejandro Mayorkas.",
    "More vulnerable Democrats, representing red states and swing states, are coming out against President Joe Bidens plans to end Title 42  a border control that has stemmed waves of illegal immigration over the last two years.",
    "These problems do not only affect the southern border but put more strain on those working to secure the northern border as well  we should not end this policy without ample preparation, he continued.",
    "Democrat opposition to ending Title 42 has been echoed by former President Obamas DHS Secretary Jeh Johnson, who told Fox News on Tuesday that current illegal immigration levels are unsustainable.",
    "The broad public health authority, which serves as a border control measure, allows federal immigration officials to quickly return border crossers and illegal aliens to their native countries.",
    "If I had had my druthers, and I dont, I would have argued, can we lift this perhaps later in the summer when it gets hotter and the numbers do slow down?",
    "Title 42 has been an essential tool in combatting the spread of COVID-19 and controlling the influx of migrants at our southern border, Manchin said.",
    "We are already facing an unprecedented increase in migrants this year and that will only get worse if the administration ends the Title 42 policy.",
    "Tester and Warnock are only the latest Democrats to voice their opposition to Bidens ending Title 42 ahead of the 2022 midterm elections.",
    "Joe Manchin (D-WV), Kyrsten Sinema (D-AZ), Mark Kelly (D-AZ), and Maggie Hassan (D-NH) have all urged Biden to reverse the decision.",
    "This week, Customs and Border Protection (CBP) Commissioner Chris Magnus said the move will certainly increase illegal immigration.",
    "Bidens own agency officials, though, have conceded that more illegal immigration is on its way with plans to end Title 42.",
    "Late last week, the Centers for Disease Control and Prevention (CDC) announced that Biden would end Title 42 on May 23.",
    "The states of Arizona, Louisiana, and Missouri have since filed a lawsuit to block Bidens termination of Title 42.",
    "We need assurances that we have security at the border and that we protect communities on this side of the border.",
    "So, the lifting of Title 42, Im sure that news is circulating right now in Central America, Johnson continued.",
    "I think this is not the right time and we have not seen a detailed plan from the administration, Warnock said.",
    "It overwhelms the communities in Texas and Arizona that have to absorb this population, Johnson said.",
    "I think this is the wrong time and I havent seen a plan that gives me comfort.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Were right now in the peak season.",
    "Follow him on Twitter here.",
    "Sens."
  ]
}