{
  "id": 7844,
  "mediaId": 120,
  "date": "d2022-04-04T12:00",
  "headline": "Herschel Walkers latest fumble is over his education",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220404-herschel-walker-mb-1236-6ebee6.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/herschel-walkers-latest-fumble-education-rcna22806",
  "sentiment": "-0.843",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    815,
    2419,
    428,
    501,
    584,
    2672
  ],
  "sentences": [
    "Walker, who is a candidate in the Republican primary race for US Senate in Georgia, acknowledged in December that he did not graduate from Georgia after the Atlanta-Journal Constitution first reported that the false claim was listed on his campaign website.",
    "As part of these speeches, hes told audiences about how he turned his life around as a young man, became an avid reader, was valedictorian at his high school, and went on to graduate from the University of Georgia in the top 1 percent of his class.",
    "Rather, the Republican repeatedly claimed in a variety of forums that he was his high schools valedictorian, received a degree from the University of Georgia, and graduated in the top 1 percent of his class.",
    "The trouble is, because Walker is a first-time candidate with no meaningful background in public service, all the public has to go on is his record  and its not faring especially well.",
    "Last month, Walker suggested the existence of apes calls evolutionary biology into question and seemed to argue that in-vitro fertilization doesnt work because there has to be a God.",
    "Were reminded anew why the Georgians campaign team has tried to limit the retired football players public appearances and kept Walker largely behind closed doors.",
    "Late last year, the first-time candidate tried to argue that the late-Rep. John Lewis was a senator whod oppose the John Lewis Voting Rights Advancement Act.",
    "After retiring from professional athletics, Herschel Walker has held a handful of different jobs, including working as a paid motivational speaker.",
    "Sure, hes misstated his educational background, but in the grand scheme of things, this is just a small part of the larger U.S. Senate race.",
    "Walkers comments in 2017, and others made over the years, show the former football star repeatedly misrepresented his academic credentials.",
    "It seems likely that some of the candidates defenders will argue that the Republicans rhetorical record simply isnt that important.",
    "Circling back to our earlier coverage, many of the issues plaguing Walkers Senate candidacy have nothing to do with what hes said.",
    "We learned soon after that Walker had falsely claimed the FDA had approved an unproven dry mist mystery treatment for Covid-19.",
    "The question, however, is why Walker routinely made claims about his educational background that dont stand up to scrutiny.",
    "It now appears none of these claims is true, and his aides provided no evidence to bolster the dubious assertions.",
    "The Republican then said it was totally unfair to ask for his opinion about the bipartisan infrastructure law.",
    "Its become obvious, for example, that the Georgia Republican knows effectively nothing about public affairs.",
    "Voters have also learned about allegations of domestic violence and other dangerous personal behavior.",
    "Theres no reason to believe Walker's educational background is necessarily disqualifying.",
    "But a CNN KFile review found that Walker himself has been repeating the claim for years.",
    "After all, there are other members of Congress who never received college degrees.",
    "This is not a situation in which Walker simply misspoke at a public event or two.",
    "His failures as a businessman have also been well documented.",
    "As CNN reported, its just not a true story.",
    "Recommended\nBut his rhetoric hasnt helped.",
    "That is, to be sure, a great story."
  ]
}