{
  "id": 7848,
  "mediaId": 129,
  "date": "4/3/2022 12:00:00 AM",
  "headline": "Herschel Walker, the Worst Candidate, Trump-Approved",
  "image": "https://static01.nyt.com/images/2022/04/03/opinion/03blow1/03blow1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/03/opinion/herschel-walker-georgia.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "In his 2008 book about suffering from dissociative identity disorder, Walker says that he grew up as a fat kid who stuttered (twin sins in his judgment), that his teachers looked through him as if he hadnt been there and that the older children ridiculed him as stupid.",
    "Raphael Warnock became the first Black senator in Georgias history, as well as the first popularly elected Black Democratic senator from the South, because of Black voters, who voted him into office just one day before rioters stormed the Capitol.",
    "No one, and I mean not one person, would seriously believe that Herschel Walker, the former football star and current leading contender for the Republican Senate nomination in Georgia, was at the top of his class at the University of Georgia.",
    "Hes never held public office, doesnt attend the sort of Republican events that are mainstays on the political calendar and has bypassed the backslapping fund-raising circuit that helps decide winners and losers in the states premier races.",
    "To many in the G.O.P., his race blunts the idea that Republicans are appealing to racists, relieves the pressure on Trump supporters for supporting a racist and gives them a shot at winning more of Georgias Black voters.",
    "Now, after months of not seriously challenging Walker, some Georgia Republicans are waking up to the reality that they may have made a grave mistake and that he is likely to lose if he advances to the general election.",
    "As The Associated Press reported: When his book was released, she told ABC News that at one point during their marriage, her husband pointed a pistol at her head and said, Im going to blow your fing brains out.",
    "CNNs KFile reviewed Walkers high school yearbooks and coverage of him in local newspapers at the time and could find no evidence to support the claim that he was a high school valedictorian.",
    "The results of Warnocks race, along with Jon Ossoffs simultaneous runoff election, tipped the balance of the Senate and sent shock waves through Georgias political establishment.",
    "Furthermore, according to CNN: A profile of Walker from 1982 in The Christian-Science Monitor and an article in The New York Times said he maintained a B average at the school.",
    "As The Atlanta Journal-Constitution wrote last summer about what then was still a potential run by Walker: Herschel Walker hasnt lived in Georgia for decades.",
    "In fact, Black voters were the majority of the coalition that elected him, according to exit polls  the first time that was the case for any Black senator.",
    "Trump weighed in last March, writing in a statement: Wouldnt it be fantastic if the legendary Herschel Walker ran for the United States Senate in Georgia?",
    "But, Walker wrote: If Im proud of anything I did in my high school career, its what I did in the classroom that I reflect on and relish the most.",
    "No one wants to be insensitive about a speech impediment or any other disorder, but exaggerating is exaggerating, and lying is lying.",
    "He told the The Clay Travis & Buck Sexton Show in June that Walker had told him he was going to run, and Trump thought he would.",
    "The statement continued, He would be unstoppable, just like he was when he played for the Georgia Bulldogs, and in the N.F.L.",
    "Sure, he was an old Trump friend and ally, but he wasnt a politician and hadnt publicly expressed a desire to become one.",
    "His consistent record of inflating his academic credentials isnt the only thing to suggest that hes highly problematic.",
    "Yet Walker has claimed just that for years, saying multiple times that he graduated in the top 1 percent of his class.",
    "Well, there were a few reasons, all of them part of a callous racial calculus, one in which Trump is well trained.",
    "I shed it, erased it and rewrote it with the titles: Beta Club president and class valedictorian.",
    "Walker himself told The Chicago Tribune in 1985 he maintained a 3.0 before his grades dropped.",
    "She filed for divorce in 2001, citing physically abusive and extremely threatening behavior.",
    "I did more than just shed the stupid label placed on me as a result of my speech impediment.",
    "It goes to the character of the man much more than any physical or psychological condition.",
    "Within months, state Republicans were speculating about Walker challenging Warnock in 2022.",
    "He has also been accused by his ex-wife of making multiple threats against her life.",
    "But wait, that wasnt the only problematic boast Walker made about his grades.",
    "But no weapon  at least not this weapon  formed by Trump shall prosper.",
    "The former president said, I had dinner with him a week ago.",
    "As CNN reported Friday, Walker never graduated from college.",
    "Walkers campaign was all Trumps doing and at Trumps urging.",
    "In 2005 she secured an order of protection against him.",
    "But none of those obstacles got in the way.",
    "And they have only Donald Trump to blame.",
    "He left to play professional football.",
    "First and foremost, Walker is Black.",
    "Walker could be a tool and a weapon.",
    "Trump kept up the pressure.",
    "He is also a GREAT person.",
    "Hes a very loyal person.",
    "Lets just be blunt.",
    "Run Herschel, run!",
    "Hes a great guy.",
    "Hes a patriot.",
    "Why Walker?",
    "But why?"
  ]
}