{
  "id": 7850,
  "mediaId": 12,
  "date": "4/2/2022 12:00:00 AM",
  "headline": "Warnocks ex-wife takes legal action over child custody",
  "image": "https://www.ajc.com/resizer/8JHVi5Z12XyvpdHoIjE7XXeQrJc=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/M3MO4MWMIREB7IPIZEGA3IDMX4.jpg",
  "link": "https://www.ajc.com/politics/warnocks-ex-wife-takes-legal-action-over-child-custody/UNI2QB7HQ5CVJMIIYSBGWD37FQ/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815,
    1136,
    501,
    571,
    2555,
    2672
  ],
  "sentences": [
    "She claimed a substantial change of circumstances regarding the welfare of the children after Warnocks victory, and she alleged in the filing that her ex-husband hasnt reimbursed her for some child care costs that she incurred during time hes scheduled to be with the kids.",
    "The 11-page filing by Ouluye Ndoye wants a judge to grant her additional custody of their two young children so she can complete a Harvard University program, citing an agreement she struck with Warnock while he was campaigning for the U.S. Senate in early 2020.",
    "The fact that (Warnock) has failed to reimburse (Ndoye) has left (Ndoye) financially strapped, leaving the children in her care when she should be concentrating on work-related and school-related responsibilities, the filing states.",
    "U.S. Sen. Raphael Warnocks ex-wife is seeking changes to their child custody arrangement in court documents that claim hes in willful contempt of the agreement as she attempts to move outside of Georgia.",
    "Ndoye told Atlanta police officers that he ran over her foot with his car during a heated argument outside her townhouse, and she described him as a great actor after he denied her claims.",
    "Ndoye also claimed that when Warnock has reimbursed her, it has often been accompanied with an extended questioning regarding the value of and need for the services provided.",
    "In the court documents, she asked a judge to revisit the child support considerations because she plans to be a full-time student at Harvard University for two years.",
    "The filing singled out certain weekdays when Warnock was set to have responsibility for the children under the agreement but now cannot because of his Senate duties.",
    "The best-known GOP candidate is Herschel Walker, a former football player with a history of violence against women and erratic behavior that has dogged his campaign.",
    "Warnock spokeswoman Meredith Brasher called him a devoted father who is proud to continue to co-parent his two children as he works for the people of Georgia.",
    "A March 2020 incident between Warnock and Ndoye while their divorce filing was pending became the subject of scrutiny during his last election campaign.",
    "The most recent filing involves a child custody arrangement finalized in April 2020, as he was waging a campaign for the U.S. Senate.",
    "Ndoye and her attorney didnt return messages seeking comment, nor did she provide the documents to The Atlanta Journal-Constitution.",
    "It also asks for Warnocks child support payments to be recalculated because of his substantial increase in income after his victory.",
    "He won a special election runoff in January 2021 that was part of a Democratic sweep that flipped control of the Senate.",
    "Though the details are private, often these agreements stipulate that one spouse cannot move children out of state.",
    "Warnock wasnt charged with a crime, and medical officials didnt find visible signs of injury to the foot.",
    "He has continued to serve as the lead pastor of Atlantas Ebenezer Baptist Church after taking office.",
    "His reelection campaign in November could once again determine control of the chamber.",
    "Several Republicans are competing in the May 24 primary to face Warnock in November.",
    "She didnt comment further, and Warnock hasnt yet responded to the claims in court.",
    "The complaint, filed in February, comes as Warnock runs for a full six-year term.",
    "Warnock told the AJC in March 2020 that Ndoyes allegations didnt happen."
  ]
}