{
  "id": 7857,
  "mediaId": 124,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "For all of Bidens troubles, hes still more popular than Trump in the NBC News poll",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/110401-joe-biden-al-0805-817cb4.jpg",
  "link": "https://www.nbcnews.com/politics/meet-the-press/bidens-troubles-s-still-popular-trump-nbc-news-poll-rcna22531",
  "sentiment": "0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    886,
    1147,
    1477,
    2030,
    2087,
    3042,
    4536,
    348,
    2888,
    2942
  ],
  "sentences": [
    "The war in Ukraine continues as Russia abandons the highly contaminated Chernobyl nuclear power plant and Ukranians brace for renewed attacks, according to AP\nSen. Lindsey Graham, R-S.C., plans to vote against confirming Judge Ketanji Brown Jackson to the Supreme Court, despite his vote just last year to elevate her to a D.C. appeals court.",
    "The League of Conservation Voters is launching a new $100,000 digital and TV ad buy in four districts, targeting GOP incumbents Mike Garcia and Michelle Steel in California and Maria Salazar and Carlos Gimenez in Florida, while Climate Power is spending $200,000 on a national and DC ad hitting similar themes.",
    "The ad comes just a week after Senate Republicans attacked Judge Ketanji Brown Jackson during her Supreme Court confirmation hearings for being soft on crime as a public defender, while Democrats backed her, saying attorneys have a duty to represent clients no matter what crimes they may have committed.",
    "The ad highlights Irvins career as a defense attorney, with a narrator saying he [profited] by defending some of the most violent and heinous criminals, domestic abusers and sexual assault, a kidnapper who molested a child, reckless homicide, even accused child pornographers.",
    "Georgia Senate: Two super PACs backing GOP Senate candidates Gary Black and Latham Saddler are planning seven-figure ad buys attacking Republican frontrunner Herschel Walker ahead of the May 24 primary, in an attempt to force Walker into a primary runoff, Politico reports.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nJust as President Biden is trying to reframe rising gas prices as a story of private companies gouging workers, environmental groups are looking to make the message stick in congressional races.",
    "Sen. Mark Kelly, D-Ariz., encouraged Biden not to end the order known as Title 42 thats prevented immigrants from crossing the U.S.-Mexico border during the pandemic, amid fears that rescinding the authority would cause a surge of migrants at the southern border.",
    "Secretaries of State: Secretary of State races have drawn candidates who embrace conspiracies about the 2020 election, per the Associated Press, with seven of the eight GOP secretaries running for re-election drawing such primary challengers.",
    "$7 million: Thats how much energy executive and Arizona GOP Senate hopeful Jim Lamon will report raising in the first fundraising quarter of 2022, per the Washington Examiner, which includes a $5 million contribution from Lamon himself.",
    "They see signs in polling that Americans blame gas companies in part for high prices, a message President Biden has tried to run with by accusing companies of not using existing permits to increase production and lower prices.",
    "Michigan Attorney General: An outside group dropped a new ad in the Palm Beach, Fla., media market pushing Trump to abandon his preferred candidate for Michigan attorney general, Matt DePerno, per the Washington Examiner.",
    "Florida Governor: Agriculture Commissioner Nikki Frieds campaign is signaling that she plans to question Rep. Charlie Crists past relationship with Trump in the Democratic primary for governor, NBCs Marc Caputo reports.",
    "Republicans have highlighted gas price issues with gusto, arguing it shows the need to empower a party thats traditionally more supportive of domestic oil production, even if there may not be any one simple policy fix.",
    "At the other end of the spectrum, Russian President Vladimir Putins net negative rating was minus 87 percentage points, with 88 percent of Americans viewing Putin negatively and just 1 percent viewing him positively.",
    "But Rep. Conor Lamb still criticized Fetterman for skipping a debate this weekend, claiming Fetterman is afraid to answer questions about a 2013 incident where he pulled a gun on a Black man who was jogging.",
    "Theres this notion that Republicans are on safe footing around gas prices and that theres only a price to pay for Democrats, and its wrong, Lori Lodes, Executive Director of Climate Power, told NBC News.",
    "New York redistricting: A state judge struck down New Yorks congressional and state legislative maps as unconstitutional gerrymanders, giving legislators until April 11 to draw new district lines.",
    "Thats the net positive rating for Ukrainian President Volodymyr Zelenskyy in the latest NBC News poll  67 percent had positive views of Zelenskyy, while 7 percent viewed him negatively.",
    "Thats why this ad raises eyebrows  Democrats are putting their name on an ad attacking a conservative candidate from the right, picking a lane usually reserved for Republicans.",
    "As Vladimir Putin wages war, oil companies are making billions by price gouging us at the pump and Republicans are helping them do it, the national ad, Higher Profits, begins.",
    "Kelly and Sen. Krysten Sinema, D-Ariz., stressed that the Department of Homeland Security doesnt appear to have a plan to maintain a humane and orderly process at the border.",
    "Other numbers to know:\n6: The number of hours the House committee investigating the Jan. 6 attack on the Capitol interviewed Trumps son-in-law Jared Kushner yesterday.",
    "The poll also shows more voters say theyre less likely to vote for a candidate endorsed by Trump (47 percent say this) than a candidate endorsed by Biden (42 percent).",
    "Tommy Thompson met with former President Donald Trump at Trumps Mar-a-Lago club as Thompson weighs another run for governor, the Milwaukee Journal Sentinel reported.",
    "Trumps favorable/unfavorable rating in the poll (36 percent positive, 50 percent negative) is slightly worse than Bidens (37 percent positive, 46 percent negative).",
    "$10 million: The amount of money the super PAC Protect Our Future, which is backed by cryptocurrency executives, plans to spend on Democratic primaries this year.",
    "Republicans have long been hammering Kelly and other vulnerable Democrats on immigration, and a surge of migrants could provide another opening for GOP attacks.",
    "But it has accrued to the GOPs  with the Democratic Partys favorable/unfavorable worse than the Republican Partys for the first time in our poll since 2004.",
    "Meta, formerly known as Facebook, hired a Republican firm to spread negative stories smearing rival platform TikTok, The Washington Post reports.",
    "A federal judge blocked much of Floridas new restrictive voting law Thursday, but the ruling will likely be appealed, NBCs Jane C. Timm reports.",
    "The Democratic Governors Association is hitting Illinois Republican candidate for governor, Richard Irvin  but not from where you might expect.",
    "Michigan 10: Trump endorsed Army veteran John James, who is running in Michigans open 10th District after two unsuccessful runs for Senate.",
    "A strategy memo from Democratic pollster Geoff Garin, commissioned by LCV and Climate Power, urges Democrats to go on offense on the issue.",
    "80,303,966: The number of confirmed cases of coronavirus in the United States, per the most recent data from NBC News and health officials.",
    "For comparison, the late Princess Diana, had a net positive rating of 75 percentage points in a survey conducted shortly after her death.",
    "But environmental groups also see a unique opportunity to make the case for independence from fossil fuels on national security grounds.",
    "Whether Bidens election was fueled more by voters who supported him, or those who wanted to cast a ballot against Trump, is debatable.",
    "A surge of migrants could create yet another headache for Biden, but also for senators like Kelly, who are top GOP targets.",
    "There really is a special place in gas price hell for Republicans who are taking contributions from fossil fuel companies.",
    "I figure when you need it, it wont be there, or maybe it will, but we can get together pretty fast, he said in Georgia.)",
    "A dozen House Republicans joined Democrats to pass a bill capping the out-of-pocket cost of insulin at $35 per month.",
    "And its all coming with Biden in office and Trump out of it  when an ex-presidents numbers usually start improving.",
    "Pritzker donated $250,000 to the DGA last year, according to Politico, but his campaign downplayed the donation.",
    "(Fetterman has said he pursued the man after hearing gunshots, and he didnt know what race that individual was.)",
    "That rating put Putin just behind Saddam Hussein, who had a net negative rating of minus 91 percentage points.",
    "But first: For all of Bidens problems in this weeks NBC News poll, he has one important thing going for him.",
    "... NBC News poll shows Ukraines Zelenskyy with favorable/unfavorable numbers that rival Pope John Paul IIs.",
    "In a new ad out Thursday, the DGA hits Irvin for being soft on crime, an attack usually used by Republicans.",
    "And, even without a social media megaphone, hes making controversial statements about the news of the day.",
    "They took millions from big oil and blocked a clean energy plan that will lower costs for families.",
    "Just look at Trumps controversies over the past week:\nHe asked Putin to dig up dirt on Bidens son.",
    "Zelenskys rating is also on par with Pope John Paul II, who had a 58 percent net positive rating.",
    "WASHINGTON  If its Friday ... Peace talks between Russia and Ukraine are expected to resume.",
    "Bottom line: Bidens unpopularity one year-plus into office hasnt accrued to Trumps benefit.",
    "Hes still active on the campaign trail (hell be rallying supporters in Michigan tomorrow).",
    "Some saw it as a ploy to meddle in the GOP primary and ultimately bolster Democratic Gov.",
    "Rebecca Kleefisch, who is running for governor, also met with Trump earlier in March.",
    "The Senate is one step closer to an agreement on funding for a Covid relief package.",
    "John Fetterman announced yesterday hed participate in three Senate primary debates.",
    "The latest NBC News poll found voters favored politicians who backed more drilling.",
    "He said SCOTUS nominee Ketanji Brown Jackson was hateful to GOP senators.",
    "But Trump isnt the typical ex-president who goes quietly into retirement.",
    "Which raises this question for 2024: Is the GOP really better with Trump?",
    "Theyre leaving us dependent on oil and at the mercy of foreign dictators.",
    "985,569: The number of deaths in the United States from the virus so far.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Irwin told Politico the ad was part of a smear campaign against him.",
    "But these numbers certainly suggest many were voting against Trump.",
    "(In time, Russia may be willing to give that information, he said.)",
    "He dissed NATO  again: (Look Im not particularly thrilled with it.",
    "39 percent: Bidens approval rating in the new Marist College poll.",
    ".... Sen. Mark Kelly, D-Ariz., pushes Biden not to end Title 42.",
    "It doesnt appear that Americans have buyers remorse after 2020.",
    "Oh, and theres that 7-hour gap in Trumps phone calls on Jan. 6.",
    "... President Biden delivers remarks on the March jobs report.",
    "... A Climate group goes on offense, per NBCs Benjy Sarlin.",
    "... Vladimir Putin has numbers that match Saddam Husseins.",
    "(She had total disdain and even hatred for them.)",
    "Wisconsin Governor: Former Wisconsin GOP Gov.",
    "J.B. Pritzker, whos running for re-election.",
    "... And none of that is an April Fools joke.",
    "Pennsylvania Senate: Democratic Lt. Gov.",
    "Now, the bill heads to the Senate.",
    "Hes not Donald Trump.",
    "Or without him?",
    "Former Lt. Gov."
  ]
}