{
  "id": 7863,
  "mediaId": 43,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 4/1",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/4/1/2088107/-Daily-Kos-Elections-Live-Digest-4-1",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    769,
    815,
    1021,
    2250,
    2277,
    5362,
    5941,
    5944,
    5954,
    146
  ],
  "sentences": [
    "FL-22: Jared Moskowitz (D): $400,000 raised (in 25 days), additional $250,000 self-funded, $650,000 cash-on-hand\nMI-11: Haley Stevens (D-inc): $1 million raised, $2.6 million cash-on-hand; Andy Levin (D-inc): $750,000 raised\nNC-04: Nida Allam (D): $370,000 raised\nFriday, Apr 1, 2022  6:20:16 PM +00:00  David Nir\nNY Redistricting: A Thursday ruling by a state trial judge invalidating New York's new legislative and congressional maps has been automatically stayed due to an appeal by Democratic in the legislature.",
    "Friday, Apr 1, 2022  5:43:05 PM +00:00  Jeff Singer\nNE-01, TX-34: Thursday was the last day in the House for two congressmen who are resigning for very different reasons: Nebraska Republican Jeff Fortenberry, who was convicted last month for concealing illegal campaign funds and lying to federal investigators, and Texas Democrat Filemon Vela, who is leaving before the end of his term in order to take a job at the lobbying and law giant Akin Gump.",
    "Party leaders rather than primary voters will pick their nominees by April 22, though there should be little suspense about who theyll choose: Republican state Sen. Mike Flood is the overwhelming favorite to win the May 10 primary for the full two-year term now that Fortenberry has ended his campaign, while Democratic colleague Patty Pansing Brooks also faces only minor opposition.",
    "Friday, Apr 1, 2022  5:16:43 PM +00:00  Jeff Singer\nGA-Sen: Former football star Herschel Walker has been the undisputed frontrunner for the Republican nomination to take on Democratic Sen. Raphael Warnock from the moment he entered the race in August, but now his intra-party critics are preparing to wage an expensive ad campaign to weaken him in ahead of the May 24 primary.",
    "Georgia First PAC has also signaled it plans to go after the former football player over this topic: Allison reports that a December poll the group paid for found Walker's support among primary voters dropping to just 34% after voters were informed about his \"history of alleged domestic violence\" and his supposedly permissive views on immigration.",
    "The results are below, with the numbers from the schools January survey in parentheses:\n44-39 vs. 2020 candidate Donald Bolduc (43-36)\n43-36 vs. state Senate President Chuck Morse (41-27)\n44-34 vs. former Londonderry town manager Kevin Smith (42-24)\nBitcoin millionaire Bruce Fenton, who announced Wednesday, was not tested.",
    "Friday, Apr 1, 2022  5:52:25 PM +00:00  David Nir\nMS Redistricting: Both chambers in Mississippis Republican-run legislature have approved new legislative maps, and because they were adopted by means of a joint resolution rather than as traditional legislation, they are now law without any action by Republican Gov.",
    "Friday, Apr 1, 2022  5:52:15 PM +00:00  Jeff Singer\nAZ-AG: Former state Rep. Diego Rodriguez on Friday ended his campaign for the Democratic nomination, a move that leaves former Arizona Corporation Commission Chair Kris Mayes as Team Blues only candidate for this open GOP-held seat ahead Mondays filing deadline.",
    "Friday, Apr 1, 2022  5:47:35 PM +00:00  Jeff Singer\nOR-06: The super PAC Protect Our Future has dropped an additional $1 million to help economic development adviser Carrick Flynn in the May 17 Democratic primary for this new seat, which brings its total investment here to $4.8 million.",
    "Friday, Apr 1, 2022  5:57:57 PM +00:00  Jeff Singer\n1Q Fundraising:\nThe first fundraising quarter of the year, covering the period of Jan. 1 through March 31, has come to an end, and federal candidates will have to file campaign finance reports with the FEC by April 15.",
    "Saint Anselm also takes a look at the race for governor and shows Republican incumbent Chris Sununu beating state Sen. Tom Sherman 51-24; Sherman, who is the only notable Democrat running, also entered the race last month and was not previously polled.",
    "CNN on Friday added to the pile by reporting that Walker spent years giving speeches claiming hed graduated in the top 1% of his class at the University of Georgia despite acknowledging last year that hed never actually earned a degree from the school.",
    "The missing Republican is congressional aide Elizabeth Heng, though she is competing on Tuesday in the special election to succeed former Rep. Devin Nunes in the existing 22nd District, turf that does not overlap at all with this new constituency.",
    "Pete Ricketts has already scheduled the contest for the 1st District, which supported Trump 56-41, for June 28, and the University of Minnesotas Eric Ostermeier says this will be the first House special in the Cornhusker State since 1951.",
    "Friday, Apr 1, 2022  5:28:21 PM +00:00  Jeff Singer\nTX-Gov: Texas Lyceum shows Republican incumbent Greg Abbott with a surprisingly small 42-40 edge over Democrat Beto ORourke, with another 7% opting for an unnamed Someone Else.",
    "Friday, Apr 1, 2022  5:11:25 PM +00:00  Jeff Singer\nCalifornia: The California secretary of state's office on Thursday published an official list of candidates for the June 7 top-two primary, and there are a few updates to note.",
    "The two Democrats who are running here are Assemblyman Adam Gray and financial advisor Phil Arballo, while the trio of Republicans consists of businessman David Giglio, agribusinessman John Duarte, and Some Dude Diego Martinez.",
    "Over in the open 3rd District in Sacramento's eastern suburbs, the math got a bit better for Democrat Kermit Jones prospects of advancing to the general election in a seat that that Trump would have taken 50-48.",
    "Richmond City Councilman Demnlus Johnson had announced an intra-party challenge earlier in the year, but while he held a campaign event as recently as Thursday, the SoS does not list him as a contender.",
    "Friday, Apr 1, 2022  5:24:09 PM +00:00  Jeff Singer\nNH-Sen, NH-Gov: Saint Anselm College is out with a new poll testing Democratic Sen. Maggie Hassan against three of her declared Republican foes.",
    "The state Board of Elections says that candidates, who are currently collecting signatures to get on the June 28 primary ballot, must still submit petitions by the original deadline of April 7.",
    "The most notable omission is in the new and safely blue 8th District in the suburbs east of Oakland, where Democratic Rep. John Garamendi is seeking re-election in a seat thats 80% new to him.",
    "The rules work very differently in Texas, where an all-party primary will take place for the special election followed by a runoff should no one take a majority in the first round.",
    "Black himself warned a party gathering recently that if Walker was the nominee, Democrats would pour $140 million on top of domestic violence and threatening shootouts with police.",
    "The Democrat who will not be on the ballot, meanwhile, is Angelina Sigala, who was waging a longshot intra-party bid against Rep. Josh Harder before redistricting changed the map.",
    "Walker has been the subject of a long string of critical stories about his past, including his business failures and allegations that he threatened to kill his ex-wife in 2005.",
    "Those organizations are Georgia First PAC, which supports banking executive Latham Saddler, and Defend Georgia, which is pulling for state Agriculture Commissioner Gary Black.",
    "While it appeared after filing closed that Jones would face two little-known fellow Democrats, only one of them, small business owner David Peterson, will be on the ballot.",
    "Finally in the open 13th District in the mid-Central Valley, only two Democrats and three Republicans will be running after all in a seat Biden would have carried 54-43.",
    "However, Walkers many foes have a lot of work to do in the coming weeks if they are to keep him from taking the majority of the vote he needs to avoid a July runoff.",
    "Two early March polls for Fox 5 Atlanta and Fox News showed Walker taking 63% and 66% while all of his opponents remained mired in the single digits.",
    "Politicos Natalie Allison reports that a pair of super PACs backing two other candidates plan to drop millions of dollars in ads attacking Walker.",
    "The Trump-endorsed Walker hasnt had to contend with a serious negative ad blitz until now, but his primary foes have plenty to attack him over.",
    "The pollster, though, warns that \"the pool of registered voters producing this result [is] more diverse than the likely electorate.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Special elections will be held in both seats using the maps that have been in place for the last decade.",
    "Three other Democrats are running, but theres no indication any of them are serious foes for Garamendi.",
    "Greg Abbott has not yet said if hell schedule the special for this 52-48 Biden seat before November.",
    "But as per usual, campaigns with strong hauls are leaking numbers early, which we've gathered below.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "The two Republicans remain Sacramento County Sheriff Scott Jones and Assemblyman Kevin Kiley.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Its also a place to discuss elections, not policy.",
    "This is also an April Fools Day prank-free zone!",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "New episodes every Thursday morning.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it.",
    "Nebraska Gov.",
    "Tate Reeves.",
    "Gov."
  ]
}