{
  "id": 7864,
  "mediaId": 43,
  "date": "d2022-04-01T00:00",
  "headline": "candidate Walker claimed he graduated in the top 1% of his college class. He didn't",
  "image": "https://images.dailykos.com/images/1002620/story_image/GettyImages-1235504857.jpg?1635519867",
  "link": "https://www.dailykos.com/story/2022/4/1/2089564/-Herschel-Walker-says-he-graduated-in-the-top-1-of-his-college-class-but-he-didn-t-graduate-at-all",
  "sentiment": "0.386",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1136,
    1147,
    1603,
    1850,
    571,
    584,
    2672
  ],
  "sentences": [
    "\"There is not a single voter in Georgia who believes that whether Herschel graduated at the 'top of his class' or as Valedictorian 40 years ago has any bearing on his ability to be a great United States Senator,\" Mallory Blount, communications director for the campaign, said in a statement.",
    "That said, CNNs reporting revealed that he wasnt named valedictorian at his high school graduation, and a media review found the school didnt actually name a valedictorian until 1994.",
    "Walkers campaign was unable to back up either of these claims, but it did come really close to saying that repeatedly lying to voters to make yourself look better is no big deal.",
    "In other words, the claim that Walker graduated in the top 1% of his class from the University of Georgia, where he was a once-in-a-generation football star, seems dubious.",
    "He left to play professional football before graduating and, though having repeatedly said he was returning to obtain his degree, he never received a diploma.",
    "Hopefully Georgia wakes up before its too late, because this guy really could be the next big disgrace in a Congress thats already lousy with such characters.",
    "On the other hand, its exactly the kind of thing you'd badly mangle if there was a partially masticated olive loaf where your brain was supposed to be.",
    "That question prompted this rather surly response from Walkers campaign manager, Scott Paradise: Multiple reporters wrote about this 40 years ago.",
    "A profile of Walker from 1982 in the Christian-Science Monitor and an article in The New York Times said he maintained a B average at the school.",
    "CNN notes that the campaign was also unable to explain why it removed the bit about Walker being his high school valedictorian from its website.",
    "He holds a wide lead over his competitors in the GOP primary, despite a hefty assortment of baggage that includes allegations of domestic abuse.",
    "He's told the story, according to a review of his speeches by CNN's KFile, during motivational speeches over the years and as recently as 2017.",
    "CNN:\nFor years, Herschel Walker has told the same inspiring story: that he graduated in the top 1% of his class at the University of Georgia.",
    "Thats really all you need to know to feel justified in withholding your vote, but theres oh-so-much more, my lovely briny pickle pops.",
    "[...]\nWalker did not graduate from Georgia, where he was a star running back after entering as a prized high school recruit.",
    "It made comedian Sarah Silverman say, THIS IS FUCKING BRILLIANT, and prompted author Stephen King to shout Pulitzer Prize!!!",
    "And its the kind of thing people who graduate in the top 1% of their class at a major public university would surely know.",
    "Compared to that, his lies about his academic record are little more than a carry-on roller bag, but theyre still lies.",
    "Herschel Walker is Donald Trumps handpicked candidate for the Senate seat currently held by Democrat Raphael Warnock.",
    "I know Trump made lying tres chic among rank-and-file Republicans, but most of us actually see that as a bad trend.",
    "Walker recently wonderedapparently without ironywhy, if we evolved from apes, we still see apes in the wild today.",
    "Walker has also claimed he was the valedictorian of his high school class andyou guessed itthats not true either.",
    "If you have a difficult time getting in touch with them, ask yourself why you are asking such a stupid question.",
    "Or, if you prefer a test drive, you can download the epilogue to Goodbye, Asshat for the low, low price of FREE.",
    "If it were an extant species, Trump might have actually gotten the 80 million votes Mike Lindell claims he did.",
    "Modern apes and modern humans have a common ape-like ancestor that likely went extinct millions of years ago.",
    "Is it possible Walker believed he graduated in the top 1% of his class, even though he didnt graduate at all?",
    "Get them all, including the finale, Goodbye, Asshat: 101 Farewell Letters to Donald Trump, at this link.",
    "Of course, Walker has a very good chance of being the Republican nominee for Warnocks Senate seat.",
    "Walker himself told The Chicago Tribune in 1985 he maintained a 3.0 before his grades dropped.",
    "Its easy to grasp if you have even a rudimentary understanding of evolutionary biology.",
    "Well, Trump endorsed this very stable genius, so yes, its at least possible.",
    "And we should still care about them, particularly when theyre this brazen.",
    "Though, to be fair, he was by most accounts an accomplished student.",
    "The viral letter that launched four hilarious Trump-trolling books.",
    "Thats not just an awful and ignorant take, its not even original.",
    "If you have a problem with what they wrote, please contact them.",
    "This common ancestor thing isnt exactly an esoteric idea.",
    "Yet its exactly what Walker has been telling people.",
    "And yet you share a common ancestor with this guy.",
    "But, I would argue, its still pretty unlikely.",
    "(He is endorsed by Trump, after all.)",
    "You see, we didnt evolve from apes.",
    "Well, thats not very nice, is it?",
    "The only problem: it's not true.",
    "Because, well, it is dubious.",
    "(on Twitter, that is).",
    "How do we know that?",
    "Chilling, huh?",
    "What is it?"
  ]
}