{
  "id": 7865,
  "mediaId": 157,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Scandal-plagued MAGA candidate Herschel Walker 'repeatedly misrepresented his academic credentials': report",
  "image": "https://www.rawstory.com/media-library/trump-backed-candidate-herschel-walker-may-not-be-the-financial-success-he-claims-report.jpg?id=29524210&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/herschel-walker-2657079583/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    815
  ],
  "sentences": [
    "The most glaring falsehood that CNN found is that Walker has repeatedly falsely claimed that he graduated in the top one percent of his class at the University of Georgia, when the reality is that he never actually graduated from the University of Georgia at all.",
    "NOW WATCH: Weatherman stops live broadcast to call his children and warn them about tornado over their house\nWeatherman stops live broadcast to call his children and warn them about tornado over their house",
    "Some Georgia Republicans this week launched a last-ditch campaign to derail Walker's candidacy, as they fear that he will not be able to win in the fall given his lengthy history of violent behavior.",
    "Trump-backed Georgia Senate candidate Herschel Walker, who is already facing several allegations of abusive and violent behavior toward women, now has another scandal to contend with.",
    "He left to play professional football before graduating and, though having repeatedly said he was returning to obtain his degree, he never received a diploma.\"",
    "CNN asked Walker's campaign for proof of him graduating with a top-of-class GPA, and the campaign instead defended his record as a college athlete.",
    "\"A profile of Walker from 1982 in the Christian-Science Monitor and an article in The New York Times said he maintained a B average at the school.",
    "\"Walker did not graduate from Georgia, where he was a star running back after entering as a prized high school recruit,\" writes CNN.",
    "CNN reports that Walker for years has \"repeatedly misrepresented his academic credentials\" when talking about his past achievements.",
    "Walker himself told The Chicago Tribune in 1985 he maintained a 3.0 before his grades dropped."
  ]
}