{
  "id": 7868,
  "mediaId": 233,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "Senate candidate and TV host Dr. Oz removed from presidential fitness council",
  "image": "https://www.gannett-cdn.com/media/2021/11/26/USATODAY/usatsports/imageForEntry46-lfV.jpg?crop=1365,768,x0,y0&width=1365&height=768&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/03/30/biden-administration-fires-dr-mehmet-oz-presidential-council/7225526001/",
  "sentiment": "0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chelsey Cox",
  "authorUrl": "https://www.usatoday.com/staff/4553285002/chelsey-cox/",
  "termIds": [
    815
  ],
  "sentences": [
    "The statement also said that the Biden administration informed Oz in a second letter from the White House that he was removed from the Council \"because it is customary to replace the council with members who share the President's priorities.\"",
    "\"One week and three different explanations later, President Biden finally informed me today why he fired me from the Presidential Council on Sports, Fitness, and Nutrition,\" Oz said in a statement released by his campaign Wednesday.",
    "In a letter dated March 29, Gautam Raghavan, director of the White House Office of Presidential Personnel, told Oz that Biden is appointing former WNBA player Elena Delle Donne as member and co-chair of the council.",
    "Oz's termination from the Presidential Council on Sports, Fitness, and Nutrition came a week after President Joe Biden asked him and fellow GOP Senate candidate Herschel Walker to resign from the council.",
    "Dr. Mehmet Oz, a candidate for U.S. senator and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "A White House official said last week both Oz and Walker were asked to resign because it is against the administration's policy to have federal candidates sit on presidential councils.",
    "Oz, a cardiothoracic surgeon and Walker, a former NFL star, received letters last week informing them they would be fired if they did not resign by 6 p.m. Wednesday.",
    "It's not clear if Walker opted to resign before he was officially removed but he tweeted last week that he would not step down voluntarily.",
    "\"This was a political firing because Im calling out Biden's failures on inflation, immigration, and COVID.",
    "In a video posted to his Twitter account last week, Oz said he had no intentions of resigning either.",
    "\"It's beyond sad that Joe Biden would politicize such an important issue like health,\" Oz said.",
    "The Woke Left will not silence or stop me from being a bold, conservative voice in the U.S.",
    "The candidates are running for Senate in Pennsylvania and Georgia, respectively.",
    "\"Im not a quitter so you are going to have to fire me,\" he wrote in the tweet.",
    "\"If President Biden wants to politicize health, he'll have to fire me.\"",
    "Both were appointed to their posts by former President Donald Trump.",
    "Oz was terminated to create a vacancy for Delle Donne.",
    "Reach out to Chelsey Cox on Twitter at @therealco.",
    "Senate.\""
  ]
}