{
  "id": 7875,
  "mediaId": 151,
  "date": "3/29/2022 12:00:00 AM",
  "headline": "Debate-dodging takes off in midterm campaigns",
  "image": "https://www.politico.com/dims4/default/eb80de8/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fa6%2F54%2Fc263524e4e3889f504636c8be1b8%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1235507385",
  "link": "https://www.politico.com/news/2022/03/29/republicans-debates-midterm-00018253",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "If youve got $50 million in the pipeline to bomb your opponent back to the Stone Age, then why even put yourself out there, other than to have a very crafted message that is essentially manufactured in a PR factory, said Carl Fogliani, a Republican strategist based in Pittsburgh, who added that voters should question the qualifications of any candidate who lacks the courage to answer questions.",
    "In Minnesota, where five GOP candidates did debate, in December, Gregg Peppin, a Republican strategist in the state, said, I would hope that we dont get to a position where we cant have spirited robust debates among candidates on the challenges that face our country.",
    "The Philadelphia Inquirer headlined its piece on a recent debate, What we learned from a Pa. Republican Senate debate that Oz and [David] McCormick skipped, while in Nebraska, Ryan Horn, a Republican media strategist, said Pillen was only hurting himself.",
    "Republican candidates this year are increasingly ducking out of primary debates or demanding greater control over the terms than ever before, raising questions about the future of an institution that has long been a central part of American campaigns.",
    "He said, Just from a strategic perspective, theres not a whole lot of reason to give your opponents an opportunity to attack you or make a mistake or set yourself up on an issue that may backfire against you  Why put yourself at risk for anything?",
    "The Republican National Committee is moving forward with its threat to prohibit future presidential nominees from participating in commission-sponsored debates, pleasing Republicans who have long argued moderators are biased against them.",
    "Earlier this month, Dan Moulthrop, president of the board of the Ohio Debate Commission, penned an op-ed in The Columbus Dispatch blistering DeWine for his refusal to participate, under the headline, Its bad for democracy.",
    "Then theres the shadow of Donald Trump, whose complaints that debates are rigged is now the party line, with the Republican National Committee throwing the prospect of presidential debates in two years into question.",
    "Theres no upside to debate, said Jason Shepherd, the chair of the Republican Party in Cobb County, Ga., if youre someone like Herschel Walker who is already the frontrunner  and has no experience debating.",
    "But even Republicans who lament the decline of debates as a tentpole of political campaigns can see the logic in some candidates passing on them  and the prospect that they will increasingly elect not to.",
    "The media  a traditional arbiter of many debates  is so reviled by Republican primary voters that campaigns now recognize there may be more to gain from criticizing the process than participating.",
    "Theres also been a surge in self-funding and celebrity candidates in 2022, whose inexperience at debating and fears of campaign-ending missteps may be leading them to dodge debates altogether.",
    "Campaigns have come to the realization that no one watches debates, so the risk outweighs the reward, said John Thomas, a Republican strategist who works on House campaigns across the country.",
    "So far this year, in more than a half-dozen Senate, House and governors races across the electoral map, Republican candidates have skipped primary debates, seemingly with few repercussions.",
    "The media will fight like cats and dogs, because its the last thing in a campaign environment they have any control over, said Dave Carney, the Republican strategist who advises Texas Gov.",
    "Mehmet Oz, the TV personality-turned Pennsylvania Senate candidate, says he wants to debate Anthony Fauci  who isnt running against him  but has skipped debating the Republicans who are.",
    "| Sean Rayford/Getty Images\nBy David Siders\n 03/29/2022 07:08 PM EDT\nA time-honored staple of political campaigns, the traditional candidate debate, appears to be on life support.",
    "In the past, he said, part of the reason you would debate is you were afraid of being shamed by the voters that public discourse, campaigning and governing requires public debate.",
    "Today, just about 1 in 5 Republicans now say they trust the news media  a lower level of support than government, the scientific community, Silicon Valley and Wall Street.",
    "Meanwhile, for Republican base voters, skewering the medias role in the process is a slam dunk, especially after Trumps effective use of the media as his fake news foil.",
    "Trumps 2020 attacks on the Commission on Presidential Debates as a partisan outfit bent on undermining him also continue to color discussions surrounding debates.",
    "Now, Thomas said, Voters are totally cool with you going on Facebook Live for 20 minutes and having a conversation with them about your policies and your agenda.",
    "But in a midterm year in which Republicans are favored across the electoral map, many candidates may have little imperative to agree to a debate in the fall.",
    "Following the former presidents outsider example, other politically inexperienced millionaires or high-name-recognition individuals have crowded into races.",
    "In general, most candidates do not feel they get a fair shake from the mainstream media, said Saul Anuzis, a former chair of the Michigan Republican Party.",
    "In Pennsylvania, four GOP campaigns for governor sent a joint letter to the media recently laying out the conditions under which they would participate.",
    "A spokesperson for one of Walkers opponents in Georgia, Gary Black, was quoted in the local news saying Walker isnt smart enough to debate anybody.",
    "Instead, a confluence of factors is jeopardizing the once universally agreed notion that candidate debates are a valuable practice in elections.",
    "Former football star Herschel Walker, the front-runner in Georgias Republican Senate primary, has refused to debate his primary opponents.",
    "Moderators must be registered Republicans who live in the state, and must not have spoken negatively about any of the candidates on stage.",
    "Former football star Herschel Walker, the front-runner in Georgias Republican Senate primary, has refused to debate his primary opponents.",
    "With the electorate as polarized as it is, the number of viewers a candidate could hope to persuade in a debate is vanishingly small.",
    "In the past, debate avoidance has come at the cost of bad publicity, and some debate skippers are getting a taste of that this year.",
    "And in Nevadas race for governor, Joe Lombardo, the Clark County sheriff, was a no-show at a debate among Republicans last month.",
    "So, I think you put yourself at risk going up  against a Democrat in debates, depending on who the moderators are going to be.",
    "One of them was a no-brainer: No one who has endorsed or donated to one of the candidates on stage can serve as a moderator.",
    "So has Jim Pillen, a Republican gubernatorial candidate in Nebraska, and Mike DeWine, the incumbent governor of Ohio.",
    "In Nebraska, Pillens campaign said the only thing he was missing by declining a primary debate was political theater.",
    "Debates, Carney said, are crazy  Its like having your candidates do pet tricks for the media, and Im against them.",
    "The other criteria, however, were more constraining on the media or any other entity that sought to host a debate.",
    "It isnt just the traditional reluctance of front-runners to share a stage with their challengers thats to blame.",
    "Greg Abbott, whose campaign is suggesting he may not debate his Democratic opponent, Beto ORourke, in the fall.",
    "Thomas added, Im just waiting for campaigns to finally come to the realization that lawn signs dont work.",
    "Republicans like Walker have suggested they will debate in their general elections, if they advance.",
    "But in 10 years, when debates dont happen anymore, no one will notice, voters wont notice or care.",
    "There is also the kind of candidate that the GOP is increasingly fielding in the post-Trump era.",
    "Money and courage are only two of the factors working against debates as a lasting institution.",
    "Nor can the moderator work for an organization that has maligned one of the candidates.",
    "Were talking about [gubernatorial candidates] Charles Herbster and Theresa Thibodeau.",
    "In North Carolina, Rep. Ted Budd (R-N.C.) ducked a Senate primary debate last month.",
    "Already, its clear they no longer consider it a requirement of a campaign.",
    "If we get to that point, well have really lost something in our democracy.",
    "There could be no questions with answers shorter than 30 seconds.",
    "Winston Churchills not going to be up there, Horn said.",
    "Hes not sharing the stage with Edmund Burke.",
    "Holly Otterbein contributed to this report."
  ]
}