{
  "id": 7885,
  "mediaId": 151,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "POLITICO Playbook: Bidens 9-word ad-lib that set the world ablaze",
  "image": "https://www.politico.com/dims4/default/dce1e48/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F28%2F25%2F788cfe894f57bad07bf7664885e8%2F220327-biden-speech-ap-1160.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/03/27/bidens-9-word-ad-lib-that-set-the-world-ablaze-00020701",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    2030,
    2087,
    2095,
    2303,
    2505,
    3722,
    4035,
    5852,
    106,
    200,
    403,
    2888
  ],
  "sentences": [
    "office\nHAPPY BIRTHDAY: NPRs Mary Louise Kelly  Steve Atkiss  Rob Nabors of the Gates Foundation  Natalie (Buchanan) Joyce of House Minority Leader Kevin McCarthys office  Niki Christoff  Rachel Semmel of the Center for Renewing America  Walt Mossberg  NBC/MSNBCs Jacob Soboroff  Lisa Zhang  CNNs Meredith Artley  Liz Johnson of Sen. Mitt Romneys (R-Utah) office  Billy Moore  The 19ths Shefali Luthra  Alberto Martinez of Targeted Victory  David Mitrani  Whitney Smith of the Aerospace Industries Association  Devexs Stephanie Beasley  Lauren Dikis  Katie Johnson of Jenner & Block  Lane Bailey of the Advocom Group  Laura Driscoll  Edelmans Erin Schwille  Roll Calls John Donnelly  Sally Kohn  Iain Hart of Rep. John Garamendis (D-Calif.) office  Mara Vandlik  James Park of House Judiciary  Jonathan Beam  POLITICOs Kameryn Stanhouse and Toni DeWitt  Frank Sadler  former Rep. Susan Molinari (R-N.Y.)  Alex Aragon of Texas Gov.",
    "THE PANDEMIC\nCOVID IN THE DISTRICT  Despite the D.C. area relaxing many Covid restrictions, BA.2, the more contagious cousin of the omicron variant that has spread through Europe and other parts of the world, now represents about 30 percent of new infections in the Mid-Atlantic region that includes the District, Maryland and Virginia, according to the Centers for Disease Control and Preventions tracker for variants, WaPos Antonio Olivo, Erin Cox and Rebecca Tan report.",
    "AMERICA AND THE WORLD\nSHIFTING POWERS  Israels meeting with top diplomats from four Arab countries and the United States, set to start on Sunday, is one of the strongest signs yet that the country is beginning to reap the dividends of normalization deals reached two years ago, a profound realignment of Middle Eastern powers that has been accelerated by the war in Ukraine, NYTs Patrick Kingsley writes in Jerusalem.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Before a crowd of a few thousand supporters, Trumps rambling speech invoked familiar, false claims that he and former U.S. Sen. DAVID PERDUE got screwed in 2020 and warned that his backers wont vote in a general election against Democratic gubernatorial candidate STACEY ABRAMS if Kemp is the nominee, the Atlanta Journal-Constitutions Greg Bluestein reports.",
    "POLITICO Playbook: Bidens 9-word ad-lib that set the world ablaze\nBy RACHAEL BADE\n03/27/2022 11:33 AM EDT\nPresented by\nDRIVING THE DAY\nIF YOU READ ONE THING  CHRIS WALLACE Says Life at Fox News Became Unsustainable, by NYTs Michael Grynbaum, who sat down with the former Fox News anchor, who left the network after 18 years to join CNN+.",
    "Capping off his four-day swing in Europe, Biden issued a sharp and forceful repudiation of Russian President VLADIMIR PUTIN during a 27-minute speech in Warsaw Saturday afternoon  one that some foreign policy experts are already comparing to RONALD REAGANs famous Mr. Gorbachev, tear down this wall address.",
    "Sen. CORY BOOKER (D-N.J.) on Judge KETANJI BROWN JACKSONs confirmation hearings, on Meet the Press: What we saw though this week was to me outrageous and beyond the pale, and very different than what I've witnessed in my short time in the Senate seeing three different confirmation hearings.",
    "The minimum tax would effectively prevent the wealthiest sliver of America from paying lower rates than families who think of themselves as middle class, while helping to generate revenues to fuel Bidens domestic ambitions and keep the deficit in check relative to the U.S. economy.",
    "JAN. 6 AND ITS AFTERMATH\nA NEW ANGLE FOR INVESTIGATORS  GINNI THOMAS contact with Trump officials on Jan. 6 and the 2020 Election raises new questions about another figure at the center of Trumps gambit to subvert the 2020 election: attorney JOHN EASTMAN, Kyle Cheney reports.",
    "PLAYBOOK METRO SECTION\nLIFE IN THE BIKE LANE  Meet the Bike Man who brought the trucker convoy to a crawl, by WaPos Ellie Silverman\nPLAYBOOKERS\nSean Penn said he would publicly melt down his Oscar if Volodymyr Zelenskyy wasnt invited to speak at the Academy Awards tonight.",
    "Points of particular contention center on targeting Russian energy exports and whether new sanctions would inflict job losses and other pain on some European countries, whose trade with Russia dwarfs the U.S.s, and could incite voter anger at a time of high inflation.",
    "His decision, which he announced after he returned to his home state, caps a remarkable political fall and came after top House leaders prodded him to end his nine-term career in the lower chamber following the guilty findings Thursday night by a jury in Los Angeles.",
    "The trillion-dollar question: WaPos Jeff Stein puts all this in perspective for us, noting that the plan comes amid signs that the administrations negotiations with Sen. JOE MANCHIN III (D-W.Va.) over [the] stalled White House economic proposal may be reviving.",
    "Meanwhile, as the AP notes, Russia did not take kindly to the statement: Kremlin spokesman DMITRY PESKOV told The Associated Press that its not up to the president of the U.S. and not up to the Americans to decide who will remain in power in Russia.",
    "But Bidens budget, which comes out on Monday, is generating news: It proposes a new tax of, at minimum, 20 percent on households worth more than $100 million  which the White House says will reduce federal deficits by $1 trillion over a decade.",
    "We clearly understand in Ukraine that anyone who's a war criminal, who attacks a neighboring country, who's doing all these atrocities together with all the Russians that are involved definitely cannot stay in power in a civilized world.",
    "(h/t Ron Filipkowski)\nWHITE HOUSE DEPARTURE LOUNGE  Reggie Greer is leaving the White House, where he was a senior adviser on LGBTQ+ engagement, to join the State Department as senior adviser to U.S. LGBTQI+ Special Envoy Jessica Stern.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nALL POLITICS\nHEADLINES FROM THE LATEST TRUMP RALLY  Former President DONALD TRUMP descended on Georgia on Saturday night to boost his slate of preferred candidates and continue his campaign against Gov.",
    "Theres also a serious question about what the GOP is doing from a political standpoint: At what point does revving up parts of the conservative base alienate Republican voters who are gay  or moderate voters who object to homophobia?",
    "The revelation that [Justice CLARENCE] THOMAS wife kept in contact with Trumps chief of staff MARK MEADOWS in the weeks after Trumps defeat  pressing him to keep trying to overturn the election  adds a new wrinkle to the timeline.",
    "The war has posed an unexpected test on one of the central premises of Bidens presidencies: that the globes democracies had to prove they could not just effectively govern but also serve as a bulwark to rising autocracies.",
    "This morning, WaPos Tyler Pager and Matt Viser lead their story on the fallout by pointing out that on the campaign trail, Biden often reminded his audience about the heavy weight that the words of a president can carry.",
    "The remark, which came at the very end of the speech, sent a jolt through European allies as well as viewers at home: Was the president announcing a major change in foreign policy, calling for regime change in Russia?",
    "A GAFFE FROM THE HEART  President JOE BIDEN landed on the South Lawn of the White House just after 1 a.m. this morning following what could go down in history as one of the most significant speeches of his presidency.",
    "The unity between the U.S. and Europe is beginning to show its limits, with differences emerging over how far to press their campaign of economic sanctions, write WSJs Ian Talley, Laurence Norman and Daniel Michaels.",
    "Biden has steadied allies rocked by four tumultuous years of Donald Trump, even as many European capitals quietly wonder if his foreign policy is simply an aberration before Trump or someone like him reclaims power.",
    "Mr. Perdues sputtering start may hint at a deeper flaw in Mr. Trumps plan to punish the governor for refusing to work to overturn Georgias 2020 election results: Mr. Trumps grievances may now largely be his alone.",
    "Also at the rally, Rep. MARJORIE TAYLOR GREENE (R-Ga.) deployed a homophobic scare tactic about Transportation Secretary PETE BUTTIGIEG: He and his husband can stay out of our girls bathrooms, she told the crowd.",
    "Over the years, the presidents passion  and tendency to overspeak or speak out of turn during emotional moments  has helped him along the way, but also caused him, and especially his staff, some headaches.",
    "told POLITICO that the new details raise important questions about whether Eastman had a specific reason to believe Justice Thomas would support his radical gambit, or if he was simply voicing a hunch.",
    "The remark is jaw-dropping not just because of how ugly it is, but because it signals that the fringe of the GOP is moving beyond singling out transgender people to embracing a more anti-gay platform.",
    "Yet nine words in particular have stolen the spotlight  an ad-libbed sentence that the White House later clarified was not part of the prepared remarks: For Gods sake, this man cannot remain in power.",
    "On what type of military support NATO will provide to Ukraine: If youre asking about the Soviet-era jets, the United States has decided that the particular proposal put forward by Poland is untenable.",
    "And hes not alone: senior Republicans and Democrats agree with Graham that a judicial confirmation process that is already painfully partisan  could turn even more toxic, writes WaPos Paul Kane.",
    "WAR IN UKRAINE\n The war has been extraordinarily lethal for Russian generals, who are being killed at a rate not seen since World War II, WaPos William Booth, Robyn Dixon and David Stern write.",
    "I guess you can call this a gaffe from the heart, AARON DAVID MILLER, a longtime foreign policy hand and senior fellow at the Carnegie Endowment for International Peace, told Pager and Viser.",
    "Sen. LINDSEY GRAHAM (R-S.C.) played into the partisan proceedings that took place at Jacksons Supreme Court confirmation hearings this week, but he also wonders what the end result will be.",
    "Herschel Walker, at the Trump rally, said hes sick of schools teaching CTR  he meant CRT\nQUOTE OF THE DAY  Rep. Madison Cawthorn on his mentorship with Newt Gingrich: I have a lot of zeal.",
    "Though Biden had reinvigorated alliances and delivered a stern warning to Putin, the wars end seemed no closer as Air Force One lifted off Saturday evening from Warsaw back to Washington.",
    "And as the AP noted, before Biden could even board Air Force One to begin the flight back to Washington, aides were playing cleanup duty, clarifying that no such policy change occurred.",
    "Ukrainian Ambassador OKSANA MARKAROVA on NBCs Meet the Press, on Bidens speech: We heard President Biden loud and clear, that the U.S. will aid and will be with Ukraine in this fight.",
    "said on Saturday that he will resign his seat in Congress after being convicted of three felonies related to a federal probe of illegal campaign contributions, Olivia Beavers reports.",
    "As officials warn about potential Russia cyberattacks, experts are coming around to a hard truth: The U.S. may simply have too many targets to defend them all, Maggie Miller reports.",
    "But all previous efforts to tax billionaires have failed amid major political head winds, and it is unclear if Manchin and Sen. KYRSTEN SINEMA (D-Ariz.) will go along with the plan.",
    "Seven days in Chernihiv, a Ukrainian city under siege, by WaPos Kostiantyn Khudov, Mary Ilyushina and Siobhn O'Grady\nCONGRESS\nFORTENBERRY RESIGNS  Rep. JEFF FORTENBERRY (R-Neb.)",
    "Yet in making inroads into the political mainstream, do Gen Zs digital warriors risk sacrificing the transgressiveness that makes them a distinctive voice of their generation?",
    "Overall, about one in eight television ads in congressional races aired between Jan. 1 and March 20 has featured inflation as a topic, write WSJs John McCormick and Chad Day.",
    "Seven in 10 Americans have low confidence in the president's ability to deal with Russia's invasion of Ukraine as Biden's approval falls to 40 percent in new NBC News poll.",
    "Risch on what more he wants Congress to do vis-a-vis Russia, on State of the Union: I think that, with what's going on there, we really can't be too tough on sanctions.",
    "AS SEEN ON TIKTOK  Ian Ward writes for POLITICO Magazine about Gen-Z for Change, the group of TikTok influencers with ambitions to make inroads in Democratic politics.",
    "voters believe lies about fraud and irregularities in the 2020 election, there is little evidence that Republicans remain as fixated on the election as Mr. Trump.",
    "SUNDAY BEST \n NATO Ambassador JULIANNE SMITH on Bidens gaffe, on CNNs State of the Union: The president had spent the day visiting with Ukrainian refugees.",
    "In my view, Bidens minimum tax adds more complexity to [Democratic Oregon Sen. RON] WYDENs original billionaire income tax, which already was complicated.",
    "Sen. AMY KLOBUCHAR (D-Minn.) on Thomas situation on ABC's \"This Week\": Not only should he recuse himself, but this Supreme Court badly needs ethics rules.",
    "BACK ON THE HOME FRONT \nBREAKING THIS MORNING  Biden's job approval falls to lowest level of his presidency amid war and inflation fears, per NBC.",
    "He had harsh words for Judge KETANJI BROWN JACKSON, who he said was unbelievably disrespectful to GOP senators during her confirmation hearings.",
    "It comes as Florida is poised to enact its dont say gay bill, which would ban teachers from talking about sexual orientation in certain grades.",
    "But, honestly, if any NATO ally wanted to provide those types of pieces of equipment, the fighter jets, the MiGs, that is a sovereign decision.",
    "On whether Justice CLARENCE THOMAS should have recused himself from Jan. 6-related cases: Clearly, Justice Thomas should have recused himself.",
    "The administration, of course, they have control of Congress, and they have been very active in persuading their party not to pass sanctions.",
    "More from the AP: The introduction of the minimum tax on the wealthiest Americans would represent a significant reorienting of the tax code.",
    "Here was Trump on Saturday night, per the AJC: I hope, David, youre going to be the governor, or I just wasted a helluva lot a time tonight.",
    "ANOTHER TRUMP ENDORSEE IN TROUBLE  Perdues campaign to unseat Kemp has struggled to gain much traction, NYTs Maya King reports in Atlanta.",
    "The Presidents point was that Putin cannot be allowed to exercise power over his neighbors or the region, an administration official said.",
    "Playbook couldnt happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Allie Bice, Eli Okun and Garrett Ross.",
    "Im fine with opinion: conservative opinion, liberal opinion  But when people start to question the truth  Who won the 2020 election?",
    "But, no, as you have heard from Secretary Blinken and others, the U.S. does not have a policy of regime change in Russia, full stop.",
    "It would apply to the top 0.01% of households with half of the expected revenue coming from households worth $1 billion or more.",
    "THE WHITE HOUSE\nBIDENS MIXED BAG ON RUSSIA  Despite Saturdays speech slip-up, Bidens Russia policy is going better than planned.",
    "Due to the difficulties of my current circumstances, I can no longer serve you effectively, Fortenbrry said in a statement.",
    "BIDEN BUDGET TO PROPOSE MINIMUM TAX ON WEALTHY  Typically, an administrations budget day elicits shrugs from Capitol Hill.",
    "Biden is, after all, a foreign policy wonk himself who would clearly understand the weight of such words \nTurns out, no.",
    "Sen. JIM RISCH (R-Idaho) was less forgiving on CNNs State of the Union this morning: He gave a good speech at the end.",
    "Cook Political Reports Amy Walter asks why in a tweet  and gives an explanation: New NBC poll gives us some insights.",
    "And I would hope [Chief] Justice [JOHN] ROBERTS, who I respect, will stand up and get those ethics rules in place.",
    "Elisabeth Fox is joining the Biotechnology Innovation Organization as director of federal government relations.",
    "If Biden could close his eyes tomorrow and have 10 wishes, one would be theres a leadership change in Russia.",
    "When asked if they prefer Biden focus most on inflation/Econ or end war in Ukraine, 68% pick inflation/Econ.",
    "[Sen.] CHRIS MURPHYS leading a bill I've long been supportive of, that says basically get your act together.",
    "TRANSITIONS  Cassie Chechile is now an associate director for Finsbury Glover Herings strategic comms team.",
    "About 69% of those more than 15,800 airings were sponsored by Republicans or conservative-leaning groups.",
    "Inevitably, some attack will break through if an adversary like Russia puts enough resources behind it.",
    "That didnt work so well recently in our country, Trump said, per Insiders Katherine Tangalakis-Lippert.",
    "Can the IRS collect taxes if nothing has been sold based on the wealth, the property, of the taxpayers?",
    "In the moment, I think that was a principled human reaction to the stories that he had heard that day.",
    "Some choice quotes from Wallace:\n I just no longer felt comfortable with the programming at Fox.",
    "I think [Putin] made a big mistake, what hes done to so many people, but that was a big mistake.",
    "Ive got a lot of aggression .. but I realize at 26 years old, I dont have a lot of wisdom.",
    "The takeaway: So much for any post-SOTU bump or rally around the flag effect from Ukraine.",
    "I spent a lot of 2021 looking to see if there was a different place for me to do my job.",
    "Tax experts also have questions, including whether the proposal is even constitutional.",
    "INFLATION NATION  The hot-button issue of inflation has become central to the midterms.",
    "The document is often viewed as a laundry list of wishes that will never meet reality.",
    "But, as you pointed out already, there was a horrendous gaffe right at the end of it.",
    "We have made a good-faith effort, but came very close, but didn't quite get it done.",
    "Rep. MATT GAETZ (R-Fla.) said he plans to nominate Trump for speaker of the House.",
    "But, right now, the United States is very much focused on their air defense needs.",
    "I said, That's a hell of a way to negotiate, put 200,000 soldiers on the border.",
    "She previously was a legislative assistant for Sen. Dianne Feinstein (D-Calif.).",
    "Greg Abbotts office  Steven Newman (8-0)\nDid someone forward this email to you?",
    "The Advocate, an LGTBQ magazine, has more on why this made no sense whatsoever.",
    "And he continued his nice words for Putin: The smartest one gets to the top.",
    "The Oscars are tonight at 8, though we havent seen most of the nominees.",
    "And I think that what some of my colleagues did was just sad, frankly.",
    "VP KAMALA HARRIS SUNDAY  The VP has nothing on her public schedule.",
    "She most recently was a public affairs director at Vrge Strategies.",
    "But its ultimate success remains elusive, Jonathan Lemire writes.",
    "BIDENS SUNDAY  The president has nothing on his public schedule.",
    "BIRTHWEEK (was Saturday): Nancy Peele of Rep. Sam Graves (R-Mo.)",
    "STEVE ROSENTHAL of the nonpartisan Tax Policy Center asked Jeff.",
    "He was not discussing Putins power in Russia, or regime change.",
    "A short time later, the air raid sirens went off again in Lviv.",
    "Well that was interesting Trump said after Gaetzs remarks.",
    "Drop us a line: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "The words of a president matter, he said more than once.",
    "I'd like to see some language passed through Congress.",
    "And I actually thought he was going to be negotiating.",
    "Paging My Kevin: Another top headline from this rally?",
    "But, my gosh, I wish they would keep him on script.",
    "Obviously, I think Congress plays a role in this.",
    "THIS IS, IN MANY WAYS, TYPICAL JOE FROM SCRANTON.",
    "Whoever wrote that speech did a good job for him.",
    "Send Playbookers tips to playbook@politico.com.",
    "Biden job approve on the economy: 33/63 (-30).",
    "They can send our brave men and women to war.",
    "We just really need to bring the hammer down.",
    "I just  I wish he would stay on script.",
    "But it looked like a great negotiation.",
    "They can take that sovereign decision.",
    "That's not even at question here.",
    "JUDICIARY SQUARE\nWHAT COMES NEXT?",
    "But they ask me, Is Putin smart?",
    "They should do it themselves.",
    "While polls show many G.O.P.",
    "Thanks for reading Playbook.",
    "Was Jan. 6 an insurrection?",
    "I found that unsustainable.",
    "We have struggled with it.",
    "Get ethics rules in place.",
    "Rep. JAMIE RASKIN (D-Md.)",
    "I have a lot of charisma.",
    "So, I'd like to see more.",
    "BRIAN KEMPs reelection.",
    "Theyve got to do that.",
    "They can move markets.",
    "They can bring peace.",
    "Yes, Putin was smart.",
    "How prevalent is it?",
    "Good Sunday morning.",
    "All about the Econ.",
    "Whats your pick?",
    "Sign up here."
  ]
}