{
  "id": 7886,
  "mediaId": 136,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "Trump Rally in Georgia Helps Stacey Abrams With Fundraising Appeal",
  "image": "",
  "link": "https://www.newsweek.com/trump-rally-georgia-helps-stacey-abrams-fundraising-appeal-1692210",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Xander Landen",
  "authorUrl": "https://www.newsweek.com/authors/xander-landen",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "After Donald Trump's rally in Georgia on Saturday night, Democratic gubernatorial candidate Stacey Abrams issued a call to donors in an email, and took aim at the former president who was campaigning for GOP gubernatorial candidate David Perdue.",
    "Not surprisingly, top Georgia Republicans went right along with his every attack and every lie,\" Abrams' campaign wrote in an email, which was posted on Twitter by Greg Bluestein, a reporter for the Atlanta Journal-Constitution.",
    "The former president also went after President Joe Biden for his handling of the war in Ukraine, and said that the Biden administration was \"almost giving [Putin] an incentive\" to use nuclear weapons.",
    "During the rally, the former president blasted incumbent Georgia Republican Governor Brian Kemp, who Trump has turned on since he declined to overturn President Joe Biden's win in the state in 2020.",
    "\"If there's one thing the people of Georgia need to know about this race it's that Brian Kemp, he sold you out,\" Trump said at the rally.",
    "Herschel Walker, a former NFL star and a Trump-backed candidate, who is also running for senator, was among the speakers at the rally.",
    "\"He didn't look, he didn't want to look, didn't want anything to do with it...Kemp has repeatedly caved to Stacey Abrams.",
    "Newsweek reached out to Trump's office for comment on Sunday morning, but did not receive a response before publication.",
    "We know that Georgia is on his mindbut not because he actually cares about our state or our people,\" the email added.",
    "\"Donald Trump was in Georgia today campaigning for top Republicans, spreading the Big Lie and attacking me.",
    "On Twitter, he wrote: \"Donald Trump just finished campaigning with my potential opponent right here in GA.",
    "Abrams wasn't the only top Georgia Democrat to release a call for campaign donations following the rally.",
    "Senator Raphael Warnock, a Georgia Democrat, also posted a fundraising appeal Saturday night.",
    "\"In his remarks, Trump said a lot about himself but very little about Georgians.",
    "In December, Trump endorsed Perdue over Kemp in the state's governor's race.",
    "He included a link to a page for people to donate to his Senate campaign.",
    "\"They're handling him very badly, in my opinion,\" he added.",
    "I think he's afraid of her, why is he afraid of her?\"",
    "Can you chip in to help me win again?\"",
    "They want to flip my seat this Fall."
  ]
}