{
  "id": 7889,
  "mediaId": 237,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "'It's a vote for this country': Trump touts David Perdue for Georgia's next governor",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/979568_sd_1648241852.jpg",
  "link": "https://www.washingtonexaminer.com/politics/its-a-vote-for-this-country-trump-touts-david-perdue-for-georgias-next-governor",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather Hamilton",
  "authorUrl": "https://www.washingtonexaminer.com/author/heather-hamilton",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "He additionally dove into the culture war, touching on parents rights to control what their children are taught in school and the national debate about whether transgender people should be able to participate in womens sports.",
    "In front of a crowd in Georgia, former President Donald Trump encouraged voters to support former GOP Sen. David Perdue, who is running for governor against Republican incumbent Brian Kemp.",
    "In addition to endorsing Perdue for governor, Trump supported Jody Hice for secretary of state, Burt Jones for lieutenant governor, and Vernon Jones for Congress.",
    "The 45th president added that the stakes for Herschel Walker, a GOP Senate candidate in the Peach State and former star running back, are also high.",
    "Another top priority when Republicans take back Congress should be to pass a bill immediately terminating every single COVID mandate, he said.",
    "A vote for David Perdue is a vote to save Georgia, and really, its a vote for this country, because we have to have honest elections, he said.",
    "And Im fighting right now to find out what happened in 2020 and make sure that those people responsible for that fraud in 2020 go to jail.",
    "While speaking in the battleground state Saturday night, Trump also slammed the Left and called for an end to COVID-19 mandates.",
    "Perdue appeared as the last speaker before Trump and blasted Kemp for selling out Georgia over an absolutely stolen election.",
    "Trump encouraged voters to support both Perdue and Walker in an effort to save the state and country from radical Democrats.",
    "Trump said that Georgia is a red state and encouraged the crowd to get rid of the phony politicians currently in office.",
    "Trump also called out Supreme Court nominee Ketanji Brown Jackson for not being able to define what a woman is.",
    "\"No more lockdowns, no more restrictions, no more hysteria, and no more masks, please, finally.",
    "They cheated at a level that people havent seen before, but I think its a very red state.",
    "[Trump] knows Ive been fighting alongside him all the way, Perdue said.",
    "I happen to think that Georgia is a very red state, Trump said.",
    "We dont want our children going to school in masks.",
    "I think it is red as hell.",
    "I think they cheated.",
    "Just In..."
  ]
}