{
  "id": 7898,
  "mediaId": 19,
  "date": "d2022-03-27T00:00",
  "headline": "Raphael Warnock Fundraises with Activist Who Compared Republicans to Terrorists",
  "image": "https://media.breitbart.com/media/2021/01/GettyImages-1229686848-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/27/warnock-fundraises-activist-who-compared-republicans-terrorists/",
  "sentiment": "-0.523",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amy Furr",
  "authorUrl": "https://www.breitbart.com/author/amy-furr/",
  "termIds": [
    815,
    1136,
    2087,
    5922,
    428,
    571,
    2934,
    2945
  ],
  "sentences": [
    "In other posts, Siskind has made similar remarks about Republicans and the Taliban:\nMeanwhile, Georgia U.S. Senate candidate Herschel Walker said the Biden administration was using its call for him to step down from the Sports & Fitness Council to bolster his challenger, the incumbent Sen. Warnock.",
    "Whoever could take over this Senate race here in Georgia between  and I know its going to be myself  against Sen. Warnock can get control of the Senate, Walker stated.",
    "Activist Amy Siskind, who has made controversial remarks regarding political rivals, appeared with Sen. Raphael Warnock (D-GA) at a fundraiser over the weekend.",
    "In the days after the remaining U.S. troops left Afghanistan once the country fell to the Taliban terrorist group, Siskind wrote, LIBERTY!",
    "According to Fox News, the post appeared to suggest she was referring to the Texas Heartbeat Act that banned abortions after six weeks.",
    "In February, Walker told Breitbart News Saturday the balance of power in the U.S. Senate depends heavily on the Georgia race.",
    "In a social media post Saturday, Siskind shared photos and told followers, What an inspiring afternoon with Senator Warnock.",
    "This administration is not doing whats great for the state of Georgia, whats great for this country.",
    "I think theyre trying to help out my opponent, which is OK because Im going to beat him anyway.",
    "Its sort of like, whats good for me is not good for thee, and I think all that theyre doing.",
    "Thrilled to bring Sen. Warnock to Westchester on March 26 at 2pm!",
    "But it is OK  the bad policies that theyre doing right now.",
    "All, from the Tri-state area and beyond, are welcome!",
    "The people are sort of waking up now and know it.",
    "(except for women controlling their own bodies).",
    "Right now, Im in a tough race, he commented.",
    "The co-host committee is still in formation.",
    "Siskind wrote online February 7.",
    "Thanks to all who supported him.",
    "So, Im OK with it, he concluded.",
    "Theres a lot on the line now.",
    "GOP, Americas Taliban.",
    "#YallQaeda."
  ]
}