{
  "id": 7899,
  "mediaId": 43,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "Odds & Ends: News/Humor (with a \"Who Lost the Week?\" poll)",
  "image": "https://images.dailykos.com/images/1052011/story_image/Doodles.jpg?1648172027",
  "link": "https://www.dailykos.com/story/2022/3/27/2087101/-Odds-amp-Ends-News-Humor-with-a-Who-Lost-the-Week-poll",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Mark Robinson (R-VA), who frequently rails against abortion rights, revealed as having paid for a woman to have an abortion after impregnating her in 1989  and claiming he did not reveal this due to privacy concerns\n District attorney Alvin Bragg (D-Manhattan), revealed as being indifferent to (and returning evidence of) any Trump criminal fraud prosecutions, when the resignation letter of special prosecutor Mark Pomerantz was published\n Brian Houston, the Australian founder of the worldwide Hillsong anti-gay megachurch, resigning just before a documentary release that highlighted cases of inappropriate behavior on his part, his father and other church officials\n The Denver police department, as protesters from the racial justice rallies in 2020 were granted $14 million after a jury found that the police used excessive force on them and had their free speech rights violated\n Lev Parnas, former Giuliani associate previously convicted on campaign finance charges, now pleading guilty to wire fraud duping investors at a startup insurance company he co-founded\n The Sackler family (of Purdue Pharma opioid epidemic infamy) as the British Museum is the latest to remove the Sackler name from its walls due to past donations\n US Senate candidate Eric Greitens (R-MO), who resigned in disgrace as governor in 2018 over abusing an extra-marital partner, now having his ex-wifes custody affidavit (saying he was physically abusive) revealed in court filings\n An unnamed North Carolina high school teacher, forced out after a viral video showing him berating a student with profanity, swinging a golf club and saying shed be living off his taxes the first and 15th of every month\n State Rep. John Wheeler (R-KS), forced to apologize after he asked a Native American representative if she were using a tomahawk instead of a gavel to silence the House floor\n Raffaela Spone, facing a year in prison after being convicted of sending repeated, harassing text messages (without identifying herself) to the parents of her daughters rivals on a Pennsylvania high school cheerleading squad\n Two men arraigned for violent crimes against Oregon protestors: Proud Boys brawler Tusitala Tiny Toese, on multiple assault felonies and Benjamin Smith, one count of murder and three counts of attempted murder\n Mark Meadows wife Debra, under investigation for filing a total of two false voter forms in the 2020 election in both North Carolina and a false absentee ballot request in Virginia\n Rep. Jeff Fortenberry (R-NE), convicted on charges he lied to the FBI about an illegal $30k contribution to his campaign from a foreign billionaire at a 2016 Los Angeles fundraiser  and now set to resign his office Thursday\n Multiple names listed - or a write-in - either way, please elaborate in a comment\n 220 votes Vote Now!",
    "Senate candidate Dr. Mehmet Oz, angering conservatives for saying hell keep dual US-Turkish citizenship, then fired (along w/Herschel Walker) from the presidential fitness council for possible Hatch violations as active candidates\n Kanye West, getting a temporary Instagram suspension for bullying after posting a racial slur directed at talk-show host Trevor Noah after Noah addressed West's treatment of his ex-wife Kim Kardashian and her boyfriend, Pete Davidson\n Juan Gerardo Trevio El Huevo (The Egg), leader of the Northeast Cartel (a drug gang) and Troops of Hell (a band of assassins) by Mexican authorities and extradited to the US\n Two-time failed gubernatorial candidate Eliot Cutler (I-ME), arrested on four counts of possessing child pornography\n Ginni Thomas, sending numerous text messages to Mark Meadows urging that he pursue efforts to overturn the 2020 election\n Kentucky county clerk Kim Davis, as a federal judge ruled on Friday she violated two same-sex couples' constitutional rights when she refused to marry them back in 2015\n Ted Cruz, first having police called on him at a Montana airport over being irate that he missed his flight, then under fire for his racist/sexist questioning of judge Ketanji Brown Jackson at Senate hearings\n \"Cowboys for Trump\" leader Couy Griffin, convicted of trespassing on January 6th, now facing a lawsuit to have his post as a New Mexico county commissioner stripped\n Paul Manafort, removed from a plane at Miami International Airport (before it took off for Dubai) because he carried a revoked passport\n Rep. Mo Brooks (R-AL), having his Trump endorsement revoked due to low poll numbers and failing to insist 45 can be re-instated\n Lt. Gov.",
    "3%\n7 votes\nDistrict attorney Alvin Bragg (D-Manhattan), revealed as being indifferent to (and returning evidence of) any Trump criminal fraud prosecutions, when the resignation letter of special prosecutor Mark Pomerantz was published\n 10%\n21 votes\nBrian Houston, the Australian founder of the worldwide Hillsong anti-gay megachurch, resigning just before a documentary release that highlighted cases of inappropriate behavior on his part, his father and other church officials\n .",
    "0%\n1 vote\nRaffaela Spone, facing a year in prison after being convicted of sending repeated, harassing text messages (without identifying herself) to the parents of her daughters rivals on a Pennsylvania high school cheerleading squad\n 0%\n 0 votes\nTwo men arraigned for violent crimes against Oregon protestors: Proud Boys brawler Tusitala Tiny Toese, on multiple assault felonies and Benjamin Smith, one count of murder and three counts of attempted murder\n .",
    "2%\n4 votes\nTwo-time failed gubernatorial candidate Eliot Cutler (I-ME), arrested on four counts of possessing child pornography\n 0%\n 0 votes\nGinni Thomas, sending numerous text messages to Mark Meadows urging that he pursue efforts to overturn the 2020 election\n 33%\n73 votes\nKentucky county clerk Kim Davis, as a federal judge ruled on Friday she violated two same-sex couples' constitutional rights when she refused to marry them back in 2015\n .",
    "0%\n1 vote\nAn unnamed North Carolina high school teacher, forced out after a viral video showing him berating a student with profanity, swinging a golf club and saying shed be living off his taxes the first and 15th of every month\n 0%\n 0 votes\nState Rep. John Wheeler (R-KS), forced to apologize after he asked a Native American representative if she were using a tomahawk instead of a gavel to silence the House floor\n .",
    "2%\n5 votes\nTed Cruz, first having police called on him at a Montana airport over being irate that he missed his flight, then under fire for his racist/sexist questioning of judge Ketanji Brown Jackson at Senate hearings\n 11%\n25 votes\n\"Cowboys for Trump\" leader Couy Griffin, convicted of trespassing on January 6th, now facing a lawsuit to have his post as a New Mexico county commissioner stripped\n .",
    "1%\n2 votes\nLev Parnas, former Giuliani associate previously convicted on campaign finance charges, now pleading guilty to wire fraud duping investors at a startup insurance company he co-founded\n 0%\n 0 votes\nThe Sackler family (of Purdue Pharma opioid epidemic infamy) as the British Museum is the latest to remove the Sackler name from its walls due to past donations\n .",
    "His band in the 1960s was a training ground for many future rock stars: Eric Clapton and Jack Bruce (Cream), Peter Green, Mick Fleetwood and John McVie (Fleetwood Mac), Mick Taylor (Rolling Stones), Harvey Mandel (Canned Heat), Andy Fraser (Free), Jon Hiseman and Tony Reeves (Colosseum), Colin Allen (Stone the Crows) and more.",
    "Bouchard Pre & Fils winery\n John Heilemann (born 1966)\n...... and finally, for a song of the week ........................... just a quick shout-out to the eighty-eight year-old bluesman John Mayall, who has just performed the final two concerts of his career this weekend.",
    "1960's 5-min cartoon host (Sigourney Weaver's uncle)\nI post a weekly diary of historical notes, arts & science items, foreign news (often receiving little notice in the US) and whimsical pieces from the outside world that I often feature in \"Cheers & Jeers\".",
    "1%\n2 votes\nKanye West, getting a temporary Instagram suspension for bullying after posting a racial slur directed at talk-show host Trevor Noah after Noah addressed West's treatment of his ex-wife Kim Kardashian and her boyfriend, Pete Davidson\n .",
    "0%\n1 vote\nUS Senate candidate Eric Greitens (R-MO), who resigned in disgrace as governor in 2018 over abusing an extra-marital partner, now having his ex-wifes custody affidavit (saying he was physically abusive) revealed in court filings\n .",
    "3%\n7 votes\nRep. Jeff Fortenberry (R-NE), convicted on charges he lied to the FBI about an illegal $30k contribution to his campaign from a foreign billionaire at a 2016 Los Angeles fundraiser  and now set to resign his office Thursday\n .",
    "Senate candidate Dr. Mehmet Oz, angering conservatives for saying hell keep dual US-Turkish citizenship, then fired (along w/Herschel Walker) from the presidential fitness council for possible Hatch violations as active candidates\n .",
    "0%\n1 vote\nThe Denver police department, as protesters from the racial justice rallies in 2020 were granted $14 million after a jury found that the police used excessive force on them and had their free speech rights violated\n .",
    "Oscar Howe (1915-1983)\nYOUR WEEKEND READ #1 is this from Wired by author Garrett Graff, suggesting The pressing question for Biden is: will he succeed in giving Putin the chance to lose without destroying the world, too.",
    "Mark Robinson (R-VA), who frequently rails against abortion rights, revealed as having paid for a woman to have an abortion after impregnating her in 1989  and claiming he did not reveal this due to privacy concerns\n .",
    "0%\n1 vote\nMark Meadows wife Debra, under investigation for filing a total of two false voter forms in the 2020 election in both North Carolina and a false absentee ballot request in Virginia\n .",
    "0%\n1 vote\nJuan Gerardo Trevio El Huevo (The Egg), leader of the Northeast Cartel (a drug gang) and Troops of Hell (a band of assassins) by Mexican authorities and extradited to the US\n .",
    "THE OTHER NIGHT yours truly hosted the Top Comments diary with an update (from three years ago) of some former Fox on-air hosts  and another two whose future may be in doubt.",
    "ART NOTES  an exhibition entitled Dakota Modern: The Art of Oscar Howe  is at the National Museum of the American Indian in lower Manhattan, NYC through September 11th.",
    "Nado the Surviving Cat\nYOUR WEEKEND READ #1 is this essay from The American Prospect by Nick Hanauer on how the administration can help rural economies all on its own.",
    "1%\n2 votes\nPaul Manafort, removed from a plane at Miami International Airport (before it took off for Dubai) because he carried a revoked passport\n .",
    "6%\n13 votes\nRep. Mo Brooks (R-AL), having his Trump endorsement revoked due to low poll numbers and failing to insist 45 can be re-instated\n .",
    "SEPARATED at BIRTH  cellarmaster of the Bouchard winery of the Burgundy region of France, Frdric Weber  and NBC news analyst John Heilemann.",
    "THURSDAY's CHILD is named Nado the Cat  a Texas kitteh so-named after surviving a tornado that badly damaged the shelter he was staying at.",
    "Egg the Cat\nBRAIN TEASER  try this Quiz of the Week's News from the BBC ... and the usually easier, less UK-centered New York Times quiz.",
    "FRIDAY's CHILD is named Egg the Cat  a Washington state kitteh who reached the quarter-finals in America's Favorite Pet competition.",
    "CHEERS to Bill and Michael in PWM, our Laramie, Wyoming-based friend Irish Patti and ...... well, each of you at Cheers and Jeers.",
    "5%\n10 votes\nMultiple names listed - or a write-in - either way, please elaborate in a comment\n 19%\n41 votes",
    "Here is a song from his most recent album, with South Carolina guest guitarist Marcus King.",
    "OK, you've been warned - here is this week's tomfoolery material that I posted.",
    "x\nx\nx\n Poll\n 220 votes Show Results\n Who Lost the Fortnight ?!?!?",
    "Have a fabulous weekend .... and week ahead.",
    "Who Lost the Fortnight ?!?!?",
    "1%\n2 votes\nLt. Gov."
  ]
}