{
  "id": 7901,
  "mediaId": 65,
  "date": "3/26/2022 12:00:00 AM",
  "headline": "Warnock hosting fundraiser with activist who compared GOP to terrorist organizations",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/08a5c276-8dc3-4f7c-8f76-22b7b07105c8/b5d8494d-8ea4-4ab1-bb32-ff5bdaf5319b/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/warnock-fundraiser-activist-gop-taliban",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "REP. VAL DEMINGS, FLORIDA SENATE CANDIDATE, CAMPAIGNS WITH ACTIVIST WHO REPEATEDLY COMPARED GOP TO TALIBAN\nThe withdrawal from Afghanistan was not the first time Siskind has equated Republicans with the Taliban.",
    "Liberal activist Amy Siskind, known for her inflammatory remarks comparing political opponents to terrorist cells, will be appearing alongside Sen. Raphael Warnock of Georgia at a fundraiser Saturday.",
    "In September 2015, well before Trumps presidency, Siskind said the Republicans threatening a government shutdown at the time over Planned Parenthood funding were \"America's version of the Taliban.\"",
    "#YallQaeda\"\nThe timing of the tweet suggested Siskind was likely criticizing the Texas Heartbeat Act, which banned abortions after six weeks of pregnancy, effective Sept. 1.",
    "Warnock is facing Trump-backed candidate Herschel Walker in the upcoming election, with both candidates boasting enviable war chests heading into campaign season.",
    "Siskind, the author of \"The List: A Week-by-Week Reckoning of Trumps First Year,\" hosted Demings for a campaign event at her home in Mamaroneck, New York.",
    "On Sept. 1, two days after the last of the U.S. troops left Afghanistan following the countrys rapid collapse to the Taliban, Siskind tweeted: \"LIBERTY!",
    "Rep. Val Demings, a Florida Democrat seeking her party's nomination to unseat Republican Sen. Marco Rubio, campaigned last year with Siskind.",
    "She repeatedly made the comparison against former President Trump and the GOP on issues ranging from abortion rights to gun control.",
    "\"Oh look: the Taliban has arrived in America,\" she tweeted in January 2017 with a photo of Trump and his cabinet in the Oval Office.",
    "\"Today, we can put to rest that the GOP war on women was a cooked up phrase,\" she tweeted in March of that same year.",
    "She also hosted a virtual discussion about domestic terrorism with Demings, a former police chief, in March.",
    "The Warnock campaign did not immediately respond to Fox News Digital's request for comment.",
    "You can follow him on Twitter @timothynerozzi and can email him at timothy.nerozzi@fox.com",
    "\"Thrilled to bring Sen. Warnock to Westchester on March 26 at 2pm!\"",
    "\"The Trump regime/GOP are the America's version of the Taliban!\"",
    "\"All, from the Tri-state area and beyond, are welcome!",
    "Fox News' Jessica Chasmar contributed to this report.",
    "Timothy Nerozzi is a writer for Fox News Digital.",
    "(except for women controlling their own bodies).",
    "The co-host committee is still in formation.\"",
    "Siskind said from her Twitter account.",
    "GOP, America's Taliban."
  ]
}