{
  "id": 7925,
  "mediaId": 43,
  "date": "3/25/2022 12:00:00 AM",
  "headline": "Mark Foley. Dennis Hastert. Matt Gaetz. And Republicans want to pontificate about morals?",
  "image": "https://images.dailykos.com/images/1033519/story_image/GettyImages-1363153145.jpg?1643908274",
  "link": "https://www.dailykos.com/story/2022/3/25/2088098/-Mark-Foley-Dennis-Hastert-Matt-Gaetz-And-Republicans-want-to-pontificate-about-morals",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1135,
    1448,
    1577,
    1710,
    2347,
    5776,
    428,
    482,
    577,
    2661
  ],
  "sentences": [
    "But for all the concern Republicans are showing now, I am stuck here wondering what the hell these people are going on about while child abuse and pornography infects their own party, and they do and say absolutely nothing.",
    "Mark Foley, a Republican congressman from Florida who served as chairman of the House Committee on Missing and Exploited Children, was exposed for messaging house pages with lurid content and exploiting them sexually.",
    "Matt Gaetz, a Republican congressman from Florida, is currently tied up in a scandal where his friend admitted to paying for and helping transport an underage minor for sex.",
    "Except for the fact that years later, Republicans were more than willing to honor and revere Foley at various Republican Party-linked events and fundraisers.",
    "If youve been watching the Senate Judiciary Committees hearings on Supreme Court nominee Ketanji Brown Jackson, youve seen a whole lot of posturing.",
    "It all came to a conclusion when Speaker Dennis Hastert presided but apparently did not directly ask for resignation, and Foley resigned.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "It gets worse: Republicans in the House may have known about his proclivities for over a decade, and done absolutely nothing.",
    "I want to say upfront that child pornography is a horror, and Congress needs to look at better ways to address the situation.",
    "Dont worry though, they still had his back and no one mentioned what he was doing with young men who were his subordinates.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Josh Hawley and Ted Cruz discussed criminal penalties, and why we dont throw the book at anyone who commits such crimes!",
    "You see, Dennis Hastert, Republican speaker of the House, was later found to have been molesting 14-year-old boys.",
    "Well, then we have to talk about Dennis Hastert, the same man who told Foley to resign.",
    "But sex trafficking is apparently is not enough to make Republicans say: Not cool, bro.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "So much for locking up child abusers and throwing away the key, Josh Hawley.",
    "I think we have to go back and look at a bit of history to talk about this.",
    "He was an older man who coached a high school team and abused young boys.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "We expect you to sit down and leave our party to protect our moral code.",
    "Hastert admitted in court that he molested four high school boys.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Matt Gaetz is only the latest Republican with serious problems.",
    "Along with that, youve seen a lot of discussion about morals.",
    "Jackson came under partisan fire for her work on the U.S.",
    "You would think that is where the story would end, right?",
    "Im pretty sure that your party has your back.",
    "Current candidates like Herschel Walker?",
    "Dont expect that to happen anytime soon.",
    "This is a short blurb about Daily Kos.",
    "But dont worry, pervy Republicans.",
    "They should all be locked away!",
    "Did the judge not do enough?",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "I could continue the list.",
    "Was the judge too lenient?",
    "Want to keep it that way?",
    "His sentence: 13 months.",
    "Daily Kos is different.",
    "Sentencing Commission.",
    "Please read it.",
    "It was 2006.",
    "Pat Meehan?",
    "Jim Jordan?",
    "Roy Moore?",
    "Sens."
  ]
}