{
  "id": 7930,
  "mediaId": 233,
  "date": "3/24/2022 12:00:00 AM",
  "headline": "100,000 refugees",
  "image": "https://www.gannett-cdn.com/presto/2022/03/24/USAT/8318af69-3b9a-4d04-9393-d82e6aa087e0-AP_Romania_Russia_Ukraine_War.jpg?crop=4121,2318,x0,y60&width=3200&height=1800&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/2022/03/24/biden-nato-summit-ketanji-brown-jackson-seresto-flea-collars-passport-delays-its-thursdays-news/7135225001/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicole Fallert",
  "authorUrl": "https://www.usatoday.com/staff/7040721001/nicole-fallert/",
  "termIds": [
    815,
    1147,
    2087,
    2347,
    2498,
    557,
    2744,
    2888,
    2942,
    6041
  ],
  "sentences": [
    "With the summer travel season right around the corner, the State Department says routine passport processing times are estimated to be eight to 11 weeks  still above the pre-pandemic average of six to eight weeks but much better than the 18-week wait travelers faced last summer.",
    "After four days of Senate hearings to consider Judge Ketanji Brown Jackson's nomination to the Supreme Court, even some of her Republican critics acknowledged that she's cruising to confirmation as the first Black woman to sit on the high court in the nation's history.",
    "Jackson, who serves on the U.S. Court of Appeals for the District of Columbia Circuit, cast herself as an independent jurist who remains committed to the constitutional \"constraints\" on her authority and who would work to restore public trust in the high court.",
    "As she peppered Jackson with questions on abortion, Sen. Marsha Blackburn, R-Tenn., noted the judge might not have an impact on the issue  not because she wouldn't get the job but because the court is set to weigh in before Jackson would be seated.",
    "Also on Thursday, Biden said Russia should be kicked out of the Group of 20 nations in retaliation for its invasion of Ukraine, a major step that would further isolate the Kremlin and restrict Russia's say in the global economy.",
    "The State Department encourages U.S. citizens to apply for a passport \"well in advance\" of any expected travel, and suggests applying for or renewing a passport at least six months ahead of planned travel to avoid any problems.",
    "Biden meets with NATO allies in Brussels\nThe U.S. will accept 100,000 Ukrainian refugees and others fleeing Russias invasion and provide more than $1 billion in new humanitarian assistance, the White House said Thursday.",
    "Democrats, who narrowly control the Senate, are likely to back Jackson, and they could rely on Vice President Kamala Harris to cast a tie-breaking vote on her historic nomination if she receives no GOP support.",
    "Officials at the EPA have raised concerns for years that the agencys method of evaluating the danger of pet flea and tick products is flawed and led to the use of potentially harmful pesticides.",
    "The EPA has said it lacks data to properly evaluate whether the collar is dangerous and has requested and received more information from the collars manufacturers to further look into the risk.",
    "Russias membership in the group, which represents the worlds major economies, was discussed during an emergency meeting with key U.S. allies, Biden said, from the NATO headquarters in Brussels.",
    "Queen Elizabeth II, the most photographed and painted woman in the world, is now a British Vogue cover star for the first time  and there's also a twin cover with Anya Taylor-Joy.",
    "Baulina, 42, was working as a correspondent for The Insider when Russian troops shelled a shopping center in the citys Podil district, the site said in a statement Wednesday.",
    "New EPA documents released via Freedom of Information request show that staff has been especially concerned about Seresto, the popular flea and tick collar.",
    "Get that passport application in if you plan to travel\nIf you're planning on seeing the world any time soon, better get a move on that passport situation.",
    "Baulina was a producer for the Anti-Corruption Foundation and was forced to flee Russia when the organization was deemed an extremist group.",
    "At least four journalists killed by Russian attacks\nRussian journalist Oksana Baulina was killed while filming in Ukraine's capital, Kyiv.",
    "Colleagues shared on social media their reactions to the news of Baulinas death, remembering her as dedicated and extremely brave.",
    "Pet owners and veterinarians said dogs and cats were having skin rashes, seizures and dying after wearing the neck gear.",
    "As of March 2021, more than 75,000 reports to the EPA alerted of dangerous incidents involving the protective collar.",
    "She is at least the fourth journalist to die in the ongoing conflict in Ukraine since Russias invasion one month ago.",
    "And new concerns were revealed about the Environmental Protection Agency's ability to regulate flea and tick collars.",
    "Maricopa County's vote-counting machines weren't connected to the internet, undercutting claims of tampering.",
    "The funding will pay for food, shelter, clean water, medical supplies and other forms of assistance.",
    "A break from the news\n Review: 'Bridgerton' Season 2 is still oh so steamy, even without the duke.",
    "What everyone's talking about\nChicago businessman Willie Wilson gives away free gas to thousands.",
    "He noted that the decision on whether to boot Russia from the group is up to other G-20 members.",
    "Consider supporting our journalism and become a USA TODAY digital subscriber today.",
    "\"That is an issue that will be decided before you go to the court, Blackburn said.",
    "The ocean's frenemies: New study dives into why great white sharks make friends.",
    "All 93 Oscar best picture winners (yes, all of them), ranked from worst to best.",
    "Biden to Mehmet Oz, Herschel Walker: Resign or be fired from presidential board.",
    "Real quick\nUber will list all NYC taxis after reaching a deal with cab drivers.",
    "Here are some key takeaways from Jackson's Supreme Court confirmation hearings.",
    "She continued reporting on corruption inside Russia after leaving the country.",
    "Prince William expressed 'sorrow' for slavery but stopped short of an apology.",
    "The Short List is free, but several stories we link to are subscriber-only.",
    "It's Laura and Nicole, bringing you all the news you need to know Thursday!",
    "'Cowardly display': Alex Jones failed to testify at Sandy Hook deposition.",
    "Another civilian was killed and two others were wounded and hospitalized.",
    "Death row inmates may be entitled to touch, prayer before execution.",
    "Can the EPA determine danger of flea and tick products it regulates?",
    "This is a compilation of stories from across the USA TODAY Network.",
    "Driver in Las Vegas crash that killed 9 had cocaine, PCP in system.",
    "Ex-N.Y. prosecutor says Trump is guilty of 'numerous' felonies.",
    "President Joe Biden announced new measures to support Ukraine.",
    "Subscribe to the newsletter here or text messages here.",
    "Serestos manufacturer maintains the collar is safe.",
    "Here are 6 destinations you can visit without one.",
    "The Short List is a snappy USA TODAY news roundup.",
    "Marsha Blackburn asked Jackson to define 'woman.'",
    "Want this news roundup in your inbox every night?",
    "Ashleigh Barty is retiring from tennis at 25.",
    "Sign up for The Short List newsletter here.",
    "Bookings are bonkers and prices are high.",
    "A Russian journalist was killed in Kyiv.",
    "But first, two queens stand before me.",
    "Science says there's no simple answer.",
    "Here's how she feels about it.",
    "Haven't booked tickets yet?",
    "Will Jackson be confirmed?",
    "Here, have some answers.",
    "More questions?",
    "No passport?",
    "Don't delay.",
    "No problem."
  ]
}