{
  "id": 7934,
  "mediaId": 63,
  "date": "3/24/2022 12:00:00 AM",
  "headline": "Georgia Senate Candidate Herschel Walker Refuses To Resign From Presidential Council",
  "image": "https://imageio.forbes.com/specials-images/imageserve/623ca974a5b1373b9d41da01/Former-President-Trump-Holds-Rally-In-Perry--Georgia/0x0.jpg?fit=crop&format=jpg&crop=3381,1903,x0,y576,safe",
  "link": "https://www.forbes.com/sites/dereksaul/2022/03/24/georgia-senate-candidate-herschel-walker-refuses-to-resign-from-presidential-council/",
  "sentiment": "-0.834",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Derek Saul",
  "authorUrl": "https://www.forbes.com/sites/dereksaul/",
  "termIds": [
    815,
    1136,
    2087,
    5688,
    5815,
    232,
    428,
    571,
    2672
  ],
  "sentences": [
    "Topline\nRepublican Senate candidate Herschel Walker said Thursday he wont comply with President Joe Bidens request that he resign from the Presidents Council on Sports, Nutrition and Fitness, even though federal law dictates that the former football star step down from the role and the White House already named his replacement.",
    "The real reason for Walkers exit is likely not so political: Members of federal advisory committees are deemed special government employees and the Hatch Act bars federal employees from seeking candidacy in partisan elections.",
    "The controversial surgeon said Walker was right in his claim about the forced ousters political nature in a response tweet, and said Wednesday he also refuses to resign from the council.",
    "Mehmet Oz, the talk show host turned Republican Senate candidate in Pennsylvania and a fellow Trump appointee to the presidential council, will also be removed due to his candidacy.",
    "Biden intends to appoint WNBA star Elena Delle Donne and celebrity chef Jose Andrs as Oz and Walkers replacements on the council, the White House announced Wednesday.",
    "A Heisman Trophy Winner and former NFL All-Pro, Walker secured Trumps endorsement last September and holds a narrow edge over Warnock in most polls.",
    "Walker, who was appointed to the council by President Donald Trump in 2018, tweeted Thursday, Im not a quitter so you are going to have to fire me.",
    "Walker asserted his ouster is because Biden is scared Walker will beat incumbent Sen. Raphael Warnock (D-Ga.) in Novembers election.",
    "Elena Delle Donne, Jos Andrs to replace Herschel Walker and Dr. Oz on fitness council (Washington Post)"
  ]
}