{
  "id": 7955,
  "mediaId": 43,
  "date": "3/24/2022 12:00:00 AM",
  "headline": "Biden requests resignations of Dr. Mehmet Oz and Herschel Walker by end of day",
  "image": "https://images.dailykos.com/images/1050905/story_image/GettyImages-1239239973.jpg?1647884931",
  "link": "https://www.dailykos.com/story/2022/3/23/2087758/-Biden-requests-resignations-of-Dr-Mehmet-Oz-and-Herschel-Walker-by-end-of-day",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Oz, notorious for his pseudo-science beliefs, hucksterism, and all-around quackery, was quick to try to deflect the conversation to Dr. Anthony Fauci, noted actual medical scientist and non-violator of the Hatch Act.",
    "Dr. Mehmet Oz and Herschel Walker were both appointed to the President's Council on Sports, Fitness & Nutrition by twice-popular-voter-loser former President Donald Trump.",
    "Per the Hatch Act, special government employees like Oz and Walker are not permitted to run for partisan office while they conduct office government business.",
    "He went on to further tweet:\nWith that said, I am beyond grateful to President Trump for appointing me to this very prestigious & important position.",
    "x\nFor the non-tweeters:\nI received this letter on behalf of @POTUS requesting I resign from the Presidents Council on Sports, Fitness & Nutrition.",
    "You would think record gas prices, a 40-year inflation high, and the situation in Ukraine would be his highest priorities at the moment.",
    "I have faith that if he wins the Republican primary, Pennsylvania voters will make sure he never makes it to the Senate.",
    "I am also grateful to my colleagues on the committee & proud of everything we were able to achieve.",
    "This the president sent both of them letters asking for their resignations by the end of the day.",
    "The doctor he should ask to resign is Dr. Fauzi, for a multitude of obvious reasons.",
    "Walker has not commented publicly, but Oz had a downright tizzy on Twitter.",
    "Both are running for the Senate; Oz in Pennsylvania, Walker in Georgia.",
    "If President Biden wants to politicize health, he will have to fire me.",
    "Its sad that he would politicize such an important issue like health.",
    "He wants Biden to fire him so he can use it in his Senate campaign.",
    "Oz is simply being told to obey the rules or resign.",
    "That would interfere with his grifting gravy train.",
    "However, I have no intention of resigning.",
    "Not the best quality in a Senate hopeful.",
    "He simply refuses to abide by it.",
    "Of course he will do neither.",
    "Oz knows what the law is."
  ]
}