{
  "id": 7965,
  "mediaId": 239,
  "date": "3/23/2022 12:00:00 AM",
  "headline": "The collapse in economic confidence under President Biden",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/23/NerdWallet-Millennial-Money-Invest-Friend-Business_70457.jpg-b1fb1_c0-271-4629-2969_s885x516.jpg?4be4c76dee224a75181eef83ce2e593c11c5e857",
  "link": "https://www.washingtontimes.com/news/2022/mar/23/collapse-economic-confidence-under-president-biden/",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Harper",
  "authorUrl": "https://www.washingtontimes.com/staff/jennifer-harper/",
  "termIds": [
    815,
    1147,
    1303,
    2087,
    4325,
    5753,
    5796,
    200,
    3302
  ],
  "sentences": [
    "Among the many who will take the stage when the time comes: Reps. Marjorie Taylor Greene, Andrew Clyde and Jody Nice  all Georgia Republicans, of course  along with David Perdue, former U.S. senator from Georgia and now a candidate for governor; state Sen. Burt Jones, a candidate for lieutenant governor; and football great Herschel Walker, a Heisman Trophy winner and now a candidate for the U.S. Senate.",
    "Meanwhile, Fox Nation  the networks video streaming platform  soon will debut a new series of note titled Duck Family Treasure, according to Jason Klarman, president of the platform, which has already featured episodes of the original Duck Dynasty.",
    "The founding pair hope to raise $20-30 million, have already begun to hire people  and may debut their new project at an event timed to coincide with the annual White House Correspondents Association Dinner on April 30.",
    "The collapse in economic confidence means that President Biden and congressional Democrats are facing strong headwinds as they head into the November elections, said poll director Peter Hanson in a written statement.",
    "FOR THE LEXICON\nThis is the name of a new startup news organization founded by former New York Times media columnist Ben Smith  who left his position at the Gray Lady  and Jeff Smith, the former CEO of Bloomberg.",
    "Duck Family Treasure will spotlight the brother duo of Jase and Jep Robertson as they pursue a hunt for buried treasure alongside their Uncle Si plus history expert and treasure hunter Murry Crowe.",
    "Some 20,000 people are expected at the rally, and vendors are already in the host town  doing a brisk business selling Trump memorabilia, according to Banks News Today, a local news organization.",
    "In addition, Tom Homan, former acting director of U.S. Immigration and Customs Enforcement, plus conservative columnist and radio host Todd Starnes will also be on hand during the evening.",
    "The current survey found that 58% of respondents believe the economy will get worse in the coming 12 months, while 57% disapprove of the way President Biden has handled economic issues.",
    "POLL DU JOUR\n53% of U.S. adults approve of the job President Biden is doing in response to the coronavirus; 19% of Republicans, 51% of independents and 87% of Democrats agree.",
    "Midterm elections are frequently a referendum on the performance of the administration, and these numbers are a sign that the judgment from voters is likely to be harsh.",
    "TRUMP GOES DOWN TO GEORGIA\nFormer President Trump heads for Commerce, Georgia, on Saturday for another signature rally with all the trimmings  and some notable guests.",
    "I believe this is a reflection of the high level of uncertainty everywhere  the war in Ukraine, inflation, COVID-19 and more, she said, also in a written statement.",
    "Each episode will feature the Robertson family as they search for precious treasures, rare artifacts, and hidden gems, Fox Nation says in advance production notes.",
    "Let us look to Grinnell College, which released a poll Wednesday revealing that only a quarter of Americans  27%  believe the economy will be better in a year.",
    "Since adding the coveted series to our platform in 2020, the response from our subscribers proved they were in the market for more, Mr. Klarman said.",
    "42% overall approve of how Mr. Biden handles his overall job as U.S. president; 5% of Republicans, 38% of independents and 84% of Democrats agree.",
    "During the month, the Fox News website drew 1.4 billion views  among visitors who spent 2.9 billion minutes pursuing the news and information.",
    "Its interesting to me that the not sure factor is as high as it is, said J. Ann Selzer of Selzer & Company, which conducted the survey.",
    "James Carville  then adviser to Bill Clinton and his bid for the White House  hung a sign up in the candidates campaign headquarters.",
    "42% approve of the way he is dealing with the Russia situation; 8% of Republicans, 39% of independents and 76% of Democrats agree.",
    "Fox News drove 21 million interactions on Facebook during the month, along with 3 million on Twitter, and 21 million on Instagram.",
    "Ill be delivering remarks along with a number of other great American patriots, he said in an enthusiastic comment on Gettr.com.",
    "36% overall approve of the way he is handling the economy; 5% of Republicans, 29% of independents and 74% of Democrats agree.",
    "43% overall approve of how he handles foreign affairs; 9% of Republicans, 39% of independents and 80% of Democrats agree.",
    "Fox News Digital finished February as the top-performing news brand, according to Comscore, an industry source.",
    "Meanwhile, 52% of the respondents disapprove, 34% approve and 14% are not sure about the matter.",
    "That is a drop of 20 percentage points in a similar poll the college conducted a year ago.",
    "The four words still apply three decades later under less than ideal circumstances.",
    "Absent a major change, Republicans are well-positioned to take control of Congress.",
    "Yes, it is a take-off on the word semaphore  visual signaling with flags or lights.",
    "The Grinnell College National Poll of 1,001 U.S. adults was conducted March 15-20.",
    "It seems unlikely that Joe Biden isnt well known enough to make a judgment.",
    "It advised Mr. Clinton to talk of change and not to forget health care.",
    "FOXIFIED, DIGITAL VERSION\nFox News is dominating the online news world.",
    "Mr. Walkers current campaign motto is run, fight, win, by the way.",
    "Things were also good in the social media realm during February.",
    "Source: A Gallup poll of 1,017 U.S. adults conducted March 1-18.",
    "The emphasis will be on global news, according to Axios.",
    "And then came one more talking point from Mr. Carville.",
    "Fox News videos also drew 392 million views on YouTube.",
    "The new series will showcase familiar faces.",
    "The Fox Nation audience was very receptive.",
    "NEWS AND OPINION:\nThe year was 1992.",
    "Its the economy, stupid."
  ]
}