{
  "id": 7966,
  "mediaId": 43,
  "date": "d2022-03-23T00:00",
  "headline": "Can Raphael Warnock win Georgia a Second Time?",
  "image": "https://images.dailykos.com/images/999125/story_image/GettyImages-1342085873.jpg?1634605804",
  "link": "https://www.dailykos.com/story/2022/3/23/2087469/-Can-Raphael-Warnock-win-Georgia-a-Second-Time",
  "sentiment": "0.424",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1131,
    1136,
    3,
    146,
    428,
    571,
    2672,
    2934
  ],
  "sentences": [
    "Most voters have never been exposed to the less savory part of Walker's history, so there is a real possibility his support will take a real hit once the ads start hitting, and Walker starts getting more scrutiny in the media.",
    "The election forecast I run at RacetotheWH was one of the most accurate in the nation last cycle, and successfully predicted Democrats Double Victory in the January Senate Runoffs by late October.",
    "Walker has a graveyard packed with skeletons that could derail his candidacy, and Republicans are taking a huge risk nominating him in one of the most important Senate races of the cycle.",
    "Perversely, the fact that the polling is so close is good news for Warnock, because he has plenty of material to use against Walker and ample time to narrow the gap.",
    "Raphael Warnock is one of the Democratic party's most talented candidates, and he was able to effectively attack his last opponent, Kelly Loeffler, with far less.",
    "He is charismatic and has star power as the greatest college football player in state history, who brought the championship to the University of Georgia.",
    "If the election were today, Senator Warnock could be destined for defeat against Football Star Herschel Walker, the almost certain nominee for the GOP.",
    "He's raised an enormous amount of money, and will likely let loose with a barrage of attack ads soon after Walker secures the nomination.",
    "Among a long list of vulnerabilities, Walker has openly admitted he almost killed someone for delivering a car a day late.",
    "Walker has taken a thin 0.7% lead in the 2022 polling average as Democrats numbers have slid nationally against the GOP.",
    "She told ABC News that at one point, he pointed a pistol at her head and said, Im going to blow your fing brains out.",
    "Those threats, according to sworn testimony by her family under oath, kept happening even after they divorced.",
    "A judge found the threat serious enough to issue a restraining order against him to protect her.",
    "It was closer, on average, to the final margin in Senate races than Nate Silvers 538.",
    "In 2022, it predicts that Raphael Warnock will win by re-election by 2.6%.",
    "His issues with his ex-wife are the most dangerous to his candidacy.",
    "He moved from Texas a month before running for Senate in Georgia.",
    "Latest Predictions for the Georgia Senate Race at RacetotheWH.",
    "Its also possible that Walker might be lifted by a red wave.",
    "It also gives him a 61% chance of securing victory.",
    "Perhaps Walker can survive these attacks."
  ]
}