{
  "id": 7968,
  "mediaId": 188,
  "date": "d2022-03-23T00:00",
  "headline": "White House ousts Dr. Mehmet Oz and Herschel Walker from President's Council on Sports, Fitness & Nutrition",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTU4NjQyMS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwMTgyNjYyOH0.YqkYBzzydXXDFOea8_GV9_U075PxRDdaT0eUJTd06a8/img.jpg?width=1245&quality=85&coordinates=0%2C0%2C0%2C132&height=700",
  "link": "https://www.theblaze.com/news/oz-and-walker-asked-to-resign-from-presidential-council",
  "sentiment": "-0.833",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Nitzberg",
  "authorUrl": "https://www.theblaze.com/u/alexnitzberg",
  "termIds": [
    815,
    1147,
    1304,
    1653,
    2087,
    106,
    5638,
    2672
  ],
  "sentences": [
    "The outlet reported that according to a White House official, having federal candidates sit on presidential boards is not in keeping with Biden administration policy  the individual noted that letters to Oz and Walker on Wednesday asked them to step down by 6 p.m.\n\"On behalf of President Biden, I am writing to request your resignation as a Member of the President's Council on Sports, Fitness & Nutrition.",
    "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.pic.twitter.com/fJaVLKVWOC\n Dr. Mehmet Oz (@Dr. Mehmet Oz) 1648080535\nOz is running for a U.S. Senate seat in Pennsylvania, while Walker is running for a U.S. Senate seat in Georgia  both men are slated to compete in Republican primaries this May.",
    "\"The Presidents Council on Sports, Fitness & Nutrition (PCSFN) is a federal advisory committee that aims to promote healthy eating and physical activity for all Americans, regardless of background or ability,\" according to the U.S. Department of Health and Human Services website.",
    "The outlet also said that individuals on the council are viewed as special government employees, who according to the Hatch Act, \"may not be candidates in partisan elections\" while carrying out official government business.",
    "The White House requested for Dr. Mehmet Oz and Herschel Walker to resign from the President's Council on Sports, Fitness & Nutrition on Wednesday, or else face termination, according to CNN.",
    "\"Clearly, Joe Biden cant be around anyone who doesnt completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling.",
    "I received this letter on behalf of @POTUS requesting I resign from the President's Council on Sports, Fitness & Nutrition.",
    "Should we not receive your resignation, your position with the Council will be terminated effective 6:00 pm tonight.",
    "CNN reported that both men were appointed to the council by then-President Donald Trump in 2018 and again in 2020.",
    "It\\u2019s sad that he would politicize such an important issue like health.",
    "Please submit your resignation to me by the close of business today.",
    "I am proud of my service and will not resign,\" Oz tweeted.",
    "Thank you,\" a letter to Oz read."
  ]
}