{
  "id": 7976,
  "mediaId": 675,
  "date": "3/22/2022 12:00:00 AM",
  "headline": "GOP steps up recruitment efforts for black candidates and voters",
  "image": "https://www.wnd.com/wp-content/uploads/2020/08/herschel-walker-smiling-rnc-vid-jpg.jpg",
  "link": "https://www.wnd.com/2022/03/gop-steps-recruitment-efforts-black-candidates-voters/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    815
  ],
  "sentences": [
    "When you see the rising prices in gas or rising prices in goods and everything else, the Black community is actually coming toward accepting the idea that maybe Republican policies are better than we see in the socialist values of the Biden administration, Wesley Hunt, a black candidate who was victorious in the GOP primary for Texas 38th Congressional District, told the Hill.",
    "By Sebastian Hughes\nDaily Caller News Foundation\nRepublicans have ramped up their efforts to recruit black candidates in the hopes of securing a larger piece of the African American vote in the 2022 midterm elections, the Hill reported Sunday.",
    "The RNC announced in 2021 it would donate $2 million toward black community centers, which are designed to aid candidates with recruitment and voter outreach in their respective communities, The Hill reported.",
    "In a CBS News poll released in February, black voters gave Biden a 43% approval rating for his handling of inflation, while 55% and 52% approved his handling of the economy and crime, respectively.",
    "While black voters have traditionally supported Democrats at the polls, Republicans believe their recruitment, as well as messaging strategies, can win many over, the Hill reported.",
    "As part of the launch, Hunt endorsed black congressional candidates John James in Michigans 10th Congressional District and Jeremy Hunt in Georgias 2nd Congressional District.",
    "The Black community is seeing momentum, Paris Dennard, national spokesman and director of Black Media Affairs for the Republican National Committee (RNC), told the Hill.",
    "At least 80 black candidates have filed as Republicans this cycle to run in House races, according to the National Republican Congressional Committee, the Hill reported.",
    "Inflation rates surged to record highs in 2021, while murder increased for the first time in four years in 2020, according to FBI data released in September.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "Politics\nDiversions\nHealth\nFaith\nMoney\nMORE COMMENTARY\nPatrick J. Buchanan\nRachel Alexander\nRead all of today's COMMENTARY...\nNew Section",
    "In the Senate, black Republicans like Herschel Walker and Richard Irvin are competing in GOP primaries to challenge incumbent Democrats.",
    "The Republican Party has not done the best job in messaging to minority communities, and its something we have got to address.",
    "Republicans have also emphasized their messaging on the economy and crime in their attempts to sway black voters.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "You would be shocked at how many people send me text messages or direct messages that say, Hey, Wesley.",
    "Hunt launched Hellfire PAC in March to help elect Republicans to the House, the Hill reported.",
    "Thats because they dont see as many people of color in the party, he said.",
    "This story originally was published by the Daily Caller News Foundation.",
    "World\nCommentary\nMychal Massie\nScott Lively\nJane M. Orient, M.D.",
    "We need leadership, but we need examples, Hunt told the Hill.",
    "Theyre seeing that Black Republicans can be elected.",
    "Read all of today's COMMENTARY...\nEducation\nU.S.",
    "I just dont feel welcome in the party.'",
    "Thank you so much for saying this.",
    "I feel the same way you do."
  ]
}