{
  "id": 7979,
  "mediaId": 12,
  "date": "3/21/2022 12:00:00 AM",
  "headline": "Now solidly Republican, primary likely to decide the next 6th District representative",
  "image": "https://www.ajc.com/resizer/isuTOUWdDRcN2z_t6RyXkl9yT70=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/577EBCGMH5ALNMT2LCY4XGBXMU.jpg",
  "link": "https://www.ajc.com/politics/now-solidly-republican-primary-likely-to-decide-the-next-6th-district-representative/CINQWTN7I5B67IODCZ4JABQQUY/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tia Mitchell",
  "authorUrl": "https://www.ajc.com/staff/tia-mitchell/",
  "termIds": [
    815
  ],
  "sentences": [
    "Its been about showing a track record for delivering results and being willing to fight against the local establishment, fight against the local media, fight against the woke mob to get this country focused on what has made America the greatest country on Earth.",
    "Smart said that voters in Dawson County, a sparsely populated rural county where 95% of residents are white, want to support a candidate who backs Trump and echoes his concerns about election integrity.",
    "My entire history of service to my nation: I spent over 20 years in the military; I spent 20 years in youth ministry; I spent a lot of engagement and in my community and with my country.",
    "He launched his campaign by sharing a list of Republican incumbents in the U.S. House who had backed him when he was running in the 7th District but were not told he was switching races.",
    "My guess is Rich McCormick has a lot of people who voted for him, who have been holding his campaign signs for the last two years and are ready to put it back out, Shepherd said.",
    "Dawson County GOP Chairman Dale Smart says that is why conservative figures such as Newt Gingrich, who is backing Evans, or Vernon Jones could help voters make their decision.",
    "So I was running this America First campaign not knowing exactly what the district was going to look like but basing my campaign on conviction and not political opportunism.",
    "The McCormick campaign has publicized videos of Evans in 2016 saying he would reluctantly support then-candidate Donald Trump after the Access Hollywood tapes were released.",
    "He was also criticized for accepting an endorsement from the Republican Main Street Partnership, a political group that works to elect centrist lawmakers in swing districts.",
    "Staples has also made two trips to Trumps Mar-a-Lago resort in Florida, once with U.S. Senate candidate Herschel Walker and another with conservative activist Charlie Kirk.",
    "McCormick had initially signed up for a rematch in the 7th District against U.S. Rep. Carolyn Bourdeaux but switched to the 6th when it was redrawn as a safe GOP seat.",
    "So all that really works to its advantage, plus the fact he really never stopped fundraising, which is why I put him kind of at the top as the candidate to beat.",
    "6th Congressional District primary\nThe Republican-led General Assembly drew this seat in a way that makes it all but certain a Republican will win in November.",
    "Some conservatives criticized him for partnering with a group of Republicans in name only, or RINOs, and his name was later scrubbed from the groups website.",
    "Attorney Jake Evans and emergency physician Rich McCormick, who won the Republican nomination for the 7th District in 2020, are considered the front-runners.",
    "He has questioned McCormicks commitment to conservatism and late arrival to the race after redistricting made the 7th virtually unwinnable for a Republican.",
    "Nine Republicans are competing in the primary for Georgias 6th Congressional District, a race that is likely to determine who ultimately occupies the seat.",
    "Another Republican in the race, Mallory Staples, has often been compared to U.S. Rep. Marjorie Taylor Greene because of her ultraconservative platform.",
    "But Evans told a conservative radio host that his opinion of Trump evolved, and he is now a strong supporter of the former presidents agenda.",
    "Other candidates include former state Rep. Meagan Hanson and Eugene Yu, who lost to McCormick in the 7th District GOP primary two years ago.",
    "Evans, who lives in Roswell, is the former chairman of the state ethics commission and a lawyer specializing in election law.",
    "The conservative-leaning voters in the new 6th District motivated emergency physician Rich McCormick to enter the race.",
    "Since then, McCormick has been endorsed by conservative incumbents such as U.S. Reps. Ronny Jackson and Burgess Owens.",
    "McCormick and Evans both ended 2021 with over $1 million in the bank, far exceeding the other candidates in the race.",
    "And each has highlighted endorsements from current and former GOP officials as proof of his conservative credentials.",
    "The 6th District also includes the eastern half of Cherokee County, north Fulton County and all of Dawson County.",
    "That left the 6th District as essentially an open seat and one that is likely to be decided by the GOP primary.",
    "But Shepherd, a Kennesaw State University professor, said he considers McCormick the leader of the pack.",
    "The district now includes east Cobb County, north Fulton County and all of Dawson and Forsyth counties.",
    "As a result, incumbent U.S. Rep. Lucy McBath, a Democrat, is running in the neighboring 7th District.",
    "Former Cobb County GOP Chairman Jason Shepherd is related to Evans and has endorsed him in the race.",
    "Before that, he was going to try again in the 7th, but he is now considered the 6ths front-runner.",
    "I announced back in July, so this is well before the new district lines were drawn, Evans said.",
    "It includes parts of the old 7th, including Forsyth County and a sliver of Gwinnett County.",
    "Jones, the former Democrat who briefly ran for governor, has not backed anyone in the 6th.",
    "Some of McCormicks early endorsements didnt generate the positive attention he expected.",
    "Other candidates include attorney Jake Evans and former state Rep. Meagan Hanson.",
    "He is now running in the GOP primary for the 10th Congressional District.",
    "We ran for the same reason I ran the first time, McCormick said.",
    "He already has a volunteer network in Forsyth County, as well.",
    "Learn about the candidates\nREPUBLICANS\nDEMOCRATS\nBob Christian",
    "Evans said he is the most conservative candidate in the race.",
    "Some of them did not support him in the 6th District race.",
    "I just feel like its a natural calling to the next level.",
    "Trump has not endorsed any candidate in the race.",
    "My campaign has been about fighting, he said."
  ]
}