{
  "id": 7996,
  "mediaId": 12,
  "date": "d2022-03-17T14:00",
  "headline": "Its not an autograph tour. Herschel Walkers GOP opponents rip their rival",
  "image": "https://www.ajc.com/resizer/FvyoZSVGjNMuACazzwCIc4_YqQo=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/KXWTTRODBFEAXDHLS27VC6QROM.JPG",
  "link": "https://www.ajc.com/politics/politics-blog/its-not-an-autograph-tour-herschel-walkers-gop-opponents-rip-their-rival/UPMFT6XPIBF7DHNPRGJ5VRUZBQ/",
  "sentiment": "-0.904",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815,
    1136,
    1312,
    2087,
    5957,
    346,
    428,
    571,
    2672
  ],
  "sentences": [
    "Speaking about himself in third person, he gave mostly baffling responses to basic inquiries but what did come across loud and clear was he has zero intention of debating in the primary\nWe cannot expect a candidate to survive a vicious General Election when they spend the entire primary hiding behind celebrity status, President Trump's endorsement, softball interviews, and double bookings\" that conveniently take place when forums are scheduled.",
    "While Herschel Walkers comments questioning evolution and reproductive medicine caught national attention this week, he also spoke Tuesday at the Rotary Club of Carrollton where he appeared to falsely suggest that NATO hasnt been involved in working to deter Russias invasion of Ukraine.",
    "Heres a snippet:\nHerschel Walker talks about working hard and fighting for the interests of Georgians, yet he works behind the scenes to ensure a level of celebrity comfort and elusiveness, separating himself from the questions and engagement that Georgians demand.",
    "Military analysts estimate NATO allies have sent more than 20,000 sophisticated weapons to Ukraine since the invasion started on Feb. 24, and thousands of NATO troops are stationed in Eastern European countries to deter a broader war.",
    "All the while, Walker has tried to remain above the fray, avoiding uttering his rivals name, even as some senior Republicans increasingly worry about his matchup against Democratic U.S. Sen. Raphael Warnock.",
    "The lies from other candidates running for office are getting more ridiculous as the election gets closer and theyre failing to get any attention unless they mention Herschels name, she said.",
    "Agriculture Commissioner Gary Black was long the only GOP candidate willing to bash Walker over his history of violent behavior, confusing remarks and tightlipped approach to the media.",
    "Blount also responded to the latest Black attack: The only thing more embarrassing than Gary Blacks obsession with Herschel Walker is Garys fundraising and poll numbers.",
    "Former Navy SEAL Latham Saddler told us in an interview that Walker was running an entitlement campaign based on his celebrity as a former football player.",
    "When he officially qualified last week, reporters swarmed to the typically evasive candidate, hungry to finally have an opportunity to ask him questions.",
    "If Georgia voters are willing to give him an unearned victory, then we are broadcasting to the elites and superstars that they can have our country.",
    "Look no further than the scathing digital ad we first told you about in yesterdays jolt that outlined the potential lines of attack from Warnock.",
    "But the hard truth is, we cannot blame Herschel Walker for running his campaign like a celebrity if we continue to treat him like a celebrity.",
    "Likewise for Kelvin King, who has long resisted criticizing Walker but this week penned an op-Ed that he shared with your Insiders.",
    "So, the question is, Are you willing to settle for selfies and autographs over qualifications and policy stances?'",
    "Walker spokeswoman Mallory Blount said Kings depiction of the former football stars demands was 100% false.",
    "I think if I was Biden, which Im not because Im younger, I would really pressure NATO to get involved.",
    "With a commanding lead in the polls -- some peg him above 60% -- his campaign feels little threat.",
    "The U.S. and other NATO members are intensely involved in helping Ukraine fight Russias invasion.",
    "Not long ago, Herschel Walkers rivals were somewhat reluctant to criticize the frontrunner.",
    "Hes not as powerful as they think he is, or he wouldnt be doing what hes doing right now.",
    "So, my question to the voters out there is hows that gonna work against Raphael Warnock?",
    "In a great state like ours, a U.S. Senate race should be difficult, said Saddler.",
    "This is a campaign - not an autograph tour for those who can pay an access fee.",
    "And hes doing the Biden basement strategy, expecting to be handed this thing.",
    "He abandoned Georgia, came back just to run for the United States Senate.",
    "And NATO have to get -- Im not sure why theyre not getting involved.",
    "Heres part of his comments:\nWhats going on in Ukraine is terrible.",
    "tI am not naive to the fact Herschel Walker is ahead in the polls.",
    "Now the other top Republican contenders are getting in on the act.",
    "Insiders note: This item was ripped and expanded from the jolt",
    "Putin is threatening you, if you dont -- if you get involved.",
    "I mean, its clear hes not willing to debate any of us.",
    "And Black, of course, has only sharpened his message.",
    "Walkers aides, however, occasionally swipe back.",
    "The results were, as one might expect, puzzling.",
    "And thats what Georgians want and expect.",
    "Hes not as powerful as they think he is.",
    "You know, you let somebody threaten you.",
    "They want people that will show up.",
    "So, should we use our strength?",
    "The problem is, neither is he.",
    "It should have to be earned.",
    "They want leadership.",
    "Not a shred of truth.",
    "I'm not."
  ]
}