{
  "id": 8002,
  "mediaId": 157,
  "date": "3/17/2022 12:00:00 AM",
  "headline": "Republicans worry about pro-Trump Senate candidate's history of domestic violence",
  "image": "https://www.rawstory.com/media-library/trump-backed-candidate-herschel-walker-may-not-be-the-financial-success-he-claims-report.jpg?id=29524210&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/herschel-walker-2656976108/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Chapman",
  "authorUrl": "https://www.rawstory.com/u/matthew_chapman",
  "termIds": [
    815
  ],
  "sentences": [
    "On Thursday, POLITICO Playbook reported that Herschel Walker, the former football star running for Senate in Georgia with the endorsement of former President Donald Trump, is now facing attacks from his primary challenger, state Agriculture Commissioner Gary Black, over his history of domestic violence  and it has some GOP strategists privately scared about his viability in the general election.",
    "But privately, weve heard Republicans from across the political spectrum grumbling about spots like this, which they worry will boost Democratic Sen. Raphael Warnock in a state Republicans may need to flip in order to win back the Senate,\" said the report.",
    "\"Black ... is out with a new ad this week highlighting allegations of violence in Walkers past, including incidents when he allegedly put a razor to his ex-wifes throat, choked her and held a gun to her head,\" said the report.",
    "Recent reports indicate he may have played fast and loose with profit and debt figures on his businesses, and he also gave a recent speech denying evolutionary science, demanding to know \"why are there still apes?\"",
    "Walker has denied some of these incidents and maintains he never broke the law, but admits his history of violent behavior toward his ex-wife and attributes it to dissociative identity disorder.",
    "And Blacks campaign has no plans to step back, pointing to research suggesting the more voters learn about Walkers past, the more they turn on him.\"",
    "the female narrator voice asks after listing other incidents in which women have gone to law enforcement to report threatening behavior by Walker.\"",
    "\"Black campaign spokesman Dan McLagan told Playbook that no one in the Republican Party has asked them to take these ads down.",
    "\"'We have to wonder: how many more women are out there, and what stories might they tell?'",
    "\"Still, its likely just a taste of whats to come in the general election.",
    "Walker has come under controversy for several other reasons as well.",
    "Stories Chosen For You"
  ]
}