{
  "id": 8020,
  "mediaId": 21,
  "date": "d2022-03-15T20:00",
  "headline": "GOP Senate candidate Herschel Walker suggests evolution isn't real: 'Science said man came from apes...If that is true, why are there still apes?'",
  "image": "https://i.insider.com/6230ec6edc43bd0018948929?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/herschel-walker-evolution-isnt-real-because-there-are-still-apes-2022-3",
  "sentiment": "0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brent D. Griffiths",
  "authorUrl": "https://www.businessinsider.com/author/brent-d-griffiths",
  "termIds": [
    815,
    1136,
    1147,
    5681,
    428,
    571,
    2672
  ],
  "sentences": [
    "00:12\nWoman displays No War sign on Russian TV\n00:21\nBlack architect wins top industry award\n00:22\nComing up, we break down the latest troubles at Disney\n00:07\nWebex by Cisco\n00:12\nIdaho passes abortion ban\n00:36\nCOVID cases are rising again\n00:35\nPolice arrest suspect in homeless shootings\n00:22\nFord offers cars without some parts\n00:25\nFar-right groups met up on January 5th\n00:29\nMurder whore-nets\n00:26\nDisney and the Dont Say Gay bill\n04:56\nCheck back tomorrow!",
    "Republican Senate candidate Herschel Walker expressed skepticism over evolution during a recent event at a Georgia church, questioning whether such a thing can be real based on the current existence of apes.",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "But as Scientific America explained in 2020, evolution is far messier than Darwin could have foreseen because there is no single \"missing link\" between humans and apes.",
    "Walker is running for the Republican nomination to challenge Sen. Raphael Warnock this November, a marquee race in Republicans' quest to retake the US Senate.",
    "Walker's claim echoes one of the biggest misunderstandings of evolution that has plagued scientists and biologists since Charles Darwin first made his theory.",
    "In fact, the record has supported some of Darwin's original assumptions, including that the common ancestor between humans and apes lived in Africa.",
    "\"Asking why modern chimps don't look more like humans is like asking why the children of your cousins don't look more like you than their parents.",
    "The former football star has also received an increased welcoming from more traditional GOP figures like Senate Minority Leader Mitch McConnell.",
    "Think about it,\" Walker said in an appearance at Sugar Hill Church in Georgia on Sunday, HuffPost first reported his remarks.",
    "The theory does not state that humans descended from apes or chimpanzees or any other related animal that is alive today.",
    "While the fossil record isn't complete, scientists continue to discover common ancestors between humans and monkeys.",
    "A Georgia football legend, Walker, the 1982 Heisman Trophy winner, is viewed as the frontrunner in the GOP primary.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "00:10\nEastern European leaders travel to Kyiv\n00:18\nFox News cameraman killed in Ukraine\n00:25\nBiden to Brussels?",
    "Walker poised that if \"there are still apes\" then one of the main theories of modern science must be bunk.",
    "Sean Rayford/Getty Images\nGet the Insider App\nA personalized feed, summary mode, and ad-free experience.",
    "You may download the file here: The Refresh from Insider\nThe Refresh from Insider\nWelcome!",
    "They're on an entirely different evolutionary path,\" The Washington Post wrote in 2016.",
    "Herschel Walker questioned the existence of human evolution during a recent event.",
    "Hosts Rebeca Ibarra and Dave Smith bring you realtime news...\n00:00\n10:31\nWelcome!",
    "Subscribe to push notifications\nYour browser does not support the audio element.",
    "A spokesperson for Walker did not immediately respond to a request for comment.",
    "Rather, humans and apes shared a common ancestor millions of years ago.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Herschel Walker speaks at a September 2021 Trump rally in Georgia.",
    "Former President Donald Trump recruited Walker to run in the race.",
    "Download the app\n Close icon Two crossed lines that form an 'X'.",
    "But evolution does not suggest that humans evolved from apes.",
    "00:08\nSpooler\n Close icon Two crossed lines that form an 'X'.",
    "\"At one time, science said man came from apes, did it not?",
    "The two shared a common ancestor millions of years ago.",
    "Stay up to date with what you want to know.",
    "If that is true, why are there still apes?",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "For Mar 15.",
    "..."
  ]
}