{
  "id": 8023,
  "mediaId": 193,
  "date": "3/15/2022 12:00:00 AM",
  "headline": "Keeler: Russell Wilson isnt Herschel Walker. Broncos arent 1989 Vikings. Anybody who says George Paton got robbed is full of it.",
  "image": "https://www.denverpost.com/wp-content/uploads/2022/03/SP02BRONXSUPERBOWL1HC_7961X.jpg?w=1573",
  "link": "https://www.denverpost.com/2022/03/14/russell-wilson-john-elway-denver-broncos-seattle-seahawks-nfl-super-bowl/",
  "sentiment": "0",
  "mediaOutlet": "The Denver Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sean Keeler",
  "authorUrl": "https://www.denverpost.com/author/sean-keeler/",
  "termIds": [
    815
  ],
  "sentences": [
    "DangerRuss is walking into a locker room full of young, talented, cost-controlled weapons  Tim Patrick (28), Courtland Sutton (26), Albert Okwuegbunam (23), Jerry Jeudy (22), KJ Hamler (22), Javonte Williams (21)  who wont stay young and cost-controlled forever.",
    "Patrick, over the last three seasons, has put up similar touchdown numbers (11 scores to Kirks 14) and yards per catch (12.4 to Kirks 12.0) on a deal that costs the Broncos $10 million a year  approximately half as much.",
    "The next time your buddy says, Oh, the Broncos gave up too much, or Russell Wilsons best days are behind him, or Man, Russ wasnt worth that, heres what you do:\n1) Give the guy the mother of all death stares.",
    "That said, this roster still needs more juice at edge rusher, right tackle and inside linebacker  not necessarily in that order  before Paton can declare his spring makeover a total victory.",
    "And wish those Fins fans more, because:\n Over Bridgewaters last 20 NFL starts, during those bridge tenures in Carolina and Denver, offenses led by Steady Teddy scored a combined 415 points.",
    "According to OverTheCap.com, the Broncos still had an estimated $23.53 million in salary cap room to play with Monday morning, regardless of Wilsons $24-million hit.",
    "For realizing that the only way the Broncos were ever getting back to a Super Bowl was by finally, wholeheartedly, learning to let the last one go.",
    "While the Broncos stayed off the ticker until Monday night, old friend Teddy Bridgewater inked a one-year deal with his hometown Miami Dolphins.",
    "Even if the opening hours of NFL free-agent shopping-slash-legal-tampering on Monday were comparatively quiet here until defensive lineman D.J.",
    "Hey, once the quarterback hole was filled with gold dust instead of the usual spackle, anything else was going to feel like an anti-climax.",
    "We have a lot of young players and, so I think theres a foundation in place, where hopefully it doesnt take too long, Paton said recently.",
    "We havent won a lot of games in our division (since 2016), Broncos general manager George Paton told reporters at the combine last month.",
    "To wit: Christian Kirk just landed a four-year contract from the Jaguars reportedly worth, on average, $21 million per year.",
    "Then you remind him that, over the last 10 NFL seasons:\n Fifteen teams from the AFC West reached the playoffs.",
    "The Broncos featured four offenses that averaged at least 21 points per game, four in a row from 2012-15.",
    "The other six Broncos teams that failed to reach 21 points per game (2016-21) all missed the playoffs.",
    "Russell Wilson never led an offense in Seattle that averaged fewer than 21 points per game.",
    "The Broncos arent the 1989 Vikings, selling the farm for a busted bell cow.",
    "The opening salvos of NFL free agency are for the desperate and the lonely.",
    "Kudos to Paton for figuring out what John Elway seemingly never could.",
    "And I just think if we can add to that, you know, were not far away.",
    "All 15 of them scored, on average, at least 21 points per game.",
    "Neither the 20 Panthers or 21 Broncos reached the postseason.",
    "And that has to change for us to get where we want to go.",
    "For one, Wilson, 33 years young, isnt Herschel Walker.",
    "All four of those teams reached the postseason.",
    "Wilson brings them closer, all by himself.",
    "Those teams went 8-12 in those 20 starts.",
    "Those same six squads averaged 6.5 wins.",
    "All 10 of his teams met that benchmark.",
    "Our foundational pieces are young.",
    "Obviously, we were in a lot more.",
    "3) Whisper two words:\nTwenty-one.",
    "Eight reached the postseason.",
    "We won seven games (in 2021).",
    "For another, Paton isnt done.",
    "Four played in Super Bowls.",
    "2) Point to the scoreboard.",
    "Two played in Super Bowls.",
    "Two played in Super Bowls.",
    "Then again, it never was.",
    "Jones joined the party.",
    "Aint too much to ask.",
    "Or 20.8 per game.",
    "Every single one.",
    "Russ or no Russ.",
    "One won it all.",
    "Preach, George.",
    "One won it all.",
    "Two won it all.",
    "Sear his soul.",
    "Wish him luck.",
    "Twenty-one.",
    "Points.",
    "Points.",
    "Preach."
  ]
}