{
  "id": 8027,
  "mediaId": 157,
  "date": "d2022-03-15T00:00",
  "headline": "'Why are there still apes?' Trump-backed Senate candidate casts doubt on evolution",
  "image": "https://www.rawstory.com/media-library/police-report-herschel-walker-s-ex-girlfriend-claimed-he-threatened-her-life.jpg?id=27660634&width=1200&coordinates=0%2C23%2C0%2C24&height=600",
  "link": "https://www.rawstory.com/herschel-walker-2656963915/",
  "sentiment": "-0.739",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    815,
    1147,
    2672
  ],
  "sentences": [
    "Divorce papers obtained by the Associated Press earlier this year revealed that Walker's ex-wife, Cindy Grossman, in the past leveled several allegations of violent and abusive behavior against him.",
    "\"She told ABC News that at one point during their marriage, her husband pointed a pistol at her head and said, 'I'm going to blow your f'ing brains out.'",
    "Walker, a former college and professional football star, has been a controversial candidate given his past instances of alleged spousal abuse.",
    "In fact, the theory of evolution does not say people \"came from\" apes, only that both humans and apes have a common evolutionary ancestor.",
    "Trump-backed Georgia Senate candidate Herschel Walker recently delivered a diatribe that cast doubt on the science of evolution.",
    "As reported by Huffington Post, Walker made the remarks while speaking at the Sugar Hill Church in Georgia this past Sunday.",
    "Because of this, the evolution of human beings from this ancestor would not necessitate the disappearance of apes.",
    "The church's lead pastor, Chuck Allen, then jumped into to tell Walker, \"Now youre getting too smart for us.\"",
    "She filed for divorce in 2001, citing 'physically abusive and extremely threatening behavior.'\"",
    "\"Grossman has said she was long a victim of Walker's impulses,\" the AP reported.",
    "At one time, science said man came from apes, did it not?\"",
    "\"If that is true, why are there still apes?",
    "Herschel Walker Interview | Mar.",
    "13, 2022 | Chuck Allen | 11:00",
    "Walker asked rhetorically.",
    "Think about it.\""
  ]
}