{
  "id": 8041,
  "mediaId": 129,
  "date": "d2022-03-11T19:10",
  "headline": "With Trump in Her State, Haley Finds Some Political Distance (Gently)",
  "image": "https://static01.nyt.com/images/2022/03/11/us/politics/11pol-haley/merlin_145086279_4f9434e7-3103-41e1-b4e9-8932538c1e1d-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/03/11/us/politics/nikki-haley-trump.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1064,
    1147,
    1563,
    2117,
    2195,
    5708,
    428,
    2910,
    2959
  ],
  "sentences": [
    "Mr. Trump will be in Florence, S.C., on Saturday to rally his faithful behind Ms. Maces primary challenger, Katie Arrington, and another pro-Trump Republican, Russell Fry, who is challenging Representative Tom Rice, one of 10 Republicans who voted to impeach the former president for inciting the Jan. 6 attack on the Capitol.",
    "Further complicating matters, Ms. Arrington, the chief information security officer for acquisition and sustainment at the Department of Defense, was placed on leave last June over a suspected leak of classified information from the National Security Agency, a situation that has not gone unnoticed by Ms. Maces campaign.",
    "Ms. Mace then appeared in front of Trump Tower in Manhattan to praise the former presidents record and policies, saying, If you want to lose this seat once again in a midterm election cycle to Democrats, then my opponent is more than qualified to do just that.",
    "When he endorsed Ms. Arrington, Mr. Trump declared Ms. Mace an absolutely terrible candidate whose remarks and attitude have been devastating for her community, and not at all representative of the Republican Party to which she has been very disloyal.",
    "In South Carolina, where the former governor remains popular, the states early primary has often been decisive to presidential nominations; Ms. Haley and other Republicans in Mr. Trumps shadow are positioning for possible presidential bids in 2024.",
    "Ambassador Haleys endorsement of Congresswoman Mace was based entirely on her record as a tough-as-nails conservative on national security, the border, law enforcement and opposing mandates on our kids, Chaney Denton, a Haley spokeswoman, said.",
    "She endorsed on Thursday the re-election of Senator Ron Johnson, Republican of Wisconsin, and cut a fund-raising video with Herschel Walker, the former football star recruited by Mr. Trump to run for the Senate in Georgia.",
    "Mr. Dawson, the former state party chairman, said Ms. Haleys campaigning for Mr. Rice in 2012 made all the difference in his victory over the former lieutenant governor, Andr Bauer, in the Republican primary.",
    "But in the case of Ms. Mace, backing her early on was a way for Ms. Haley to get on the right side of Republican politics in her home state, in case Mr. Trumps endorsements falter  and he falters with them.",
    "Austin McCubbin, Ms. Maces campaign manager, responded, Our opponent has proven two things  shes the only Republican to lose this district in 40 years, and she will say just about anything.",
    "On Friday, he said in a statement he will be honoring Katie Arrington, who is running against the absolutely horrendous Nancy Mace, predicting big crowds at the Florence Regional Airport.",
    "But Mr. Rices district on the North Carolina border is far more Trump country than Ms. Maces affluent, highly educated district that touches Charleston and hugs the Lowcountry coast.",
    "Ms. Mace, a freshman who made her name as the first female cadet to graduate from The Citadel, a military college in Charleston, is unlike most of Mr. Trumps incumbent targets.",
    "In her first speech in Congress in January 2021, Ms. Mace said the House needed to hold the president accountable for the Capitol attack, but she voted against his impeachment.",
    "Just after the attack on the Capitol last year, Ms. Haley pronounced herself disgusted with her former boss, but since then, she has been trying to get back in his good graces.",
    "To Republicans in the state, Ms. Haley is playing a shrewd and careful game by seeming to distance herself from Mr. Trump and yet continuing to embrace him at the same time.",
    "She doesnt want to do anything to alienate his base, but where she can find things that appeal to that mass of Republicans that dont feel they have a home, shell grab it.",
    "WASHINGTON  Rumors were swirling in South Carolina early this February that Donald J. Trump would try to tear down a Republican congresswoman who had incurred his wrath.",
    "She headlined a fund-raiser Friday afternoon for Ms. Mace at The Harbour Club in Charleston, S.C., that raised around $300,000 as Mr. Trumps forces gathered upstate.",
    "The timing of Ms. Haleys move was widely viewed as deliberate  allowing her to exert her influence in the race without directly challenging Mr. Trumps judgment.",
    "When she heard he was going to endorse Mr. Fry, she began letting Republicans know widely that she, too, would be entering a race, with Mr. Trumps endorsement.",
    "She has been appearing on television to say that the Russian president, Vladimir V. Putin, would have never invaded Ukraine if Mr. Trump were still president.",
    "In 2018, Ms. Arrington beat then-Representative Mark Sanford in the Republican primary after he emerged as one of the few anti-Trump Republicans in Congress.",
    "She also opposed the creation of a bipartisan commission to investigate the attack, another vote that Mr. Trump has used to determine his endorsements.",
    "Nancy knows that, indicated by her tucking her tail between her legs as she flew to New York City to shoot an apology video in front of Trump Tower.",
    "On Feb. 7, Ms. Haley endorsed the congresswoman, Representative Nancy Mace, jumping ahead of Mr. Trump, who backed Ms. Maces rival two days later.",
    "South Carolina is a hugely influential political state, said Matt Moore, a Republican campaign consultant and former party chairman in the state.",
    "She has endorsed and raised funds for many pro-Trump candidates, while staying out of some of the races where he has endorsed challengers.",
    "But her aides said her endorsement of Ms. Mace had nothing to do with rumors of a pending endorsement for Ms. Arrington from Mr. Trump.",
    "Nikkis very smart  itd never occur to me that she doesnt know exactly what shes doing, said South Carolinas treasurer, Curtis Loftis.",
    "Once Ms. Haley expressed her anger over Jan. 6, she would never get back in his good graces, he said, speaking from experience.",
    "Ms. Arrington was among a small group of South Carolina Republicans who visited Mr. Trump at Mar-a-Lago the weekend of Feb. 5.",
    "Mr. Trump has endorsed only eight Republican challengers to sitting House Republicans, and two of them are in South Carolina.",
    "Republican officials in South Carolina said Ms. Arrington may have tipped Ms. Haley off about jumping into the primary race.",
    "The Lowcountry wants a pro-Trump America First conservative to represent them, her spokesman, Chris DAnna, said.",
    "Mr. Sanford, the former congressman whom Ms. Arrington defeated in 2018, said Ms. Haley had nothing to lose.",
    "Then Nikki Haley, his former United Nations ambassador and South Carolinas former governor, made her move.",
    "Mr. Fry and Ms. Arrington will share the stage, along with several conservative luminaries, including Gov.",
    "If the political winds change for President Trump, shes prepared to be there, and this is part of that.",
    "Thats loading up your gun, said Katon Dawson, a former Republican Party chairman in South Carolina.",
    "Jumping in the middle of this and holding a fund-raiser when President Trump is coming down here?",
    "Henry McMaster of South Carolina and Drew McKissick, the states Republican Party chairman.",
    "But Ms. Mace has been steadfast in saying that Mr. Trump lost the 2020 election.",
    "The stakes are high, and the foundations are being set for the next decade.",
    "Theres really no way forward for her, Mr. Sanford said of Ms. Haley.",
    "Trump is a guy who holds decided grudges and doesnt let them go.",
    "Most of her endorsements have gone to Trump-favored candidates.",
    "But Ms. Arrington then lost to a Democrat, Joe Cunningham.",
    "She pointedly has not endorsed Mr. Rice for re-election.",
    "Ms. Arrington announced her primary challenge on Feb. 8.",
    "In 2020, Mr. Cunningham then lost to Ms. Mace.",
    "Mr. Trump endorsed Ms. Arrington on Feb. 9.",
    "Ms. Arrington is still talking confidently.",
    "Ms. Haley endorsed Ms. Mace on Feb. 7.",
    "Ms. Mace, though, might have a point.",
    "Ms. Haley declined to be interviewed.",
    "You want to have folks on your team.",
    "That isnt keeping your powder dry.",
    "Ms. Haley is not shying away now.",
    "Mr. Trump will not be assuaged.",
    "Ms. Haley will not be there.",
    "Ms. Haley is no Trump foe."
  ]
}