{
  "id": 8044,
  "mediaId": 305,
  "date": "3/11/2022 12:00:00 AM",
  "headline": "Guess Whos Back: Stacey Abrams Qualifies for 2022 Georgia Governor Race",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/9520a5d2b51097e0547478bb41ef752f.jpg",
  "link": "https://www.theroot.com/guess-who-s-back-stacey-abrams-qualifies-for-2022-geor-1848641232",
  "sentiment": "0",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kalyn Womack",
  "authorUrl": "https://www.theroot.com/author/kalynwomack",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "From ABC News:\nWhen I ran for governor in 2018, I ran on a platform of opportunity for all wanting to ensure that we expand Medicaid, that we fully and permanently fund education, that we build economic development plans that work for every Georgian, she said.",
    "Abrams mentioned Medicaid seven times in her brief remarks, underlining the proposed expansion of health insurance coverage as the centerpiece of her and most other Georgia Democrats platforms in 2022.",
    "Additionally, shes one of the biggest voting rights advocates in the country, drawing hundreds of thousands of Black people to the polls in and out of her home state.",
    "In the running for state office are Senators Butch Miller or Gainesville (Republican) and Jen Jordan of Sandy Springs (Democrat).",
    "Abrams said the issues she was focused on in 2018, including expanding healthcare, are pretty much the same this time around.",
    "Sen. Ralph Warnock is also seeking to win a six-term and Republican Herschel Walker is unfortunately still trying.",
    "Kemps spokesperson Tate Mitchell said Kemp would do his damndest to block her from becoming governor or president.",
    "She was credited for turning Georgia blue during the presidential election for the first time since 1992, per ABC.",
    "Per ABCs report, Kemp plans to expand coverage to fewer people, requiring recipients to work or attend school.",
    "Stacey Abrams mentioned in December that she had intentions of running for Georgia governor again.",
    "Following the pandemic, the need for healthcare is greater now than ever before.",
    "Other Republicans including Sen. David Perdue are running against Kemp as well.",
    "She has qualified to run for the race going back up against Republican Gov.",
    "Kemp is approaching the topic of Medicaid with meanness and callousness.",
    "Luckily, her loss in the 2018 race only motivated her more.",
    "Abrams is coming in with a new slew of support, though.",
    "Sadly, those are still the issues we need to focus.",
    "The Biden administration has refused to approve it.",
    "Brian Kemp, reported ABC News.",
    "Abrams also said Gov.",
    "Now, its official."
  ]
}