{
  "id": 8045,
  "mediaId": 12,
  "date": "d2022-03-11T11:00",
  "headline": "Herschel Walkers business record reveals creditor lawsuits, exaggerated claims",
  "image": "https://www.ajc.com/resizer/dGJ77FcnJZTVeNFe3P8IJc0VWco=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/I4ALYNSRO25OIDCDGUB3MSTG6U.jpg",
  "link": "https://www.ajc.com/news/investigations/herschel-walkers-business-record-reveals-creditor-lawsuits-exaggerated-claims/D3FRT4RA7NFKTN23423ENPUP7A/",
  "sentiment": "0.728",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815,
    3880,
    428,
    600,
    5658,
    2672,
    6050
  ],
  "sentences": [
    "Walker and various business partners have defaulted or fell behind in payments on at least eight loans totaling $9 million over the past two decades, according to an AJC review of hundreds of pages of court documents, Securities and Exchange Commission filings and other public records that detail these financial issues.",
    "In our coverage of the race for U.S. Senate, The Atlanta Journal-Constitution newsroom will:\n Conduct deep background investigations on the major candidates with an eye toward past behavior and any potential conflicts that might raise questions on or provide insight into how a candidate might perform.",
    "Hes the finest gentleman\nWalker wasnt far removed from his football career when he faced a tough business truth: No amount of athletic skill or fame would be enough to push a struggling, cash-strapped business across the goal line to success.",
    "And while Walker attributes his wealth to his business acumen, much of it seems to be derived from his celebrity status as a football legend through speaking engagements and brand ambassadorships, according to campaign financial disclosures.",
    "Walker has valued the company between $25 and $50 million, and he reported that it generated roughly $3 million in income for him in recent years, according to his Senate financial disclosure documents filed in December.",
    "But Yale professor Sonnenfeld said that Walkers litigious business past and misrepresentations of his success raises questions about his trustworthiness, especially as a candidate that has no political record to run on.",
    "The companys website lists a range of experience and services offered, including food supply and services, staffing services, janitorial services, textile fabrication, security services and promotional merchandise.",
    "But an Atlanta Journal-Constitution review of court records and other public documents contradicts statements Walker has made about the number of people his companies employ, their size and the assets they own.",
    "In the business world he is not anywhere in the league of any of his Republican predecessors, said Jeffrey Sonnenfeld, the senior associate dean for leadership studies at Yale, who reviewed the AJCs findings.",
    "During the pandemic, Renaissance Man Food Services reported just eight employees on applications for two Paycheck Protection Program loans from the federal Small Business Administration totaling $180,000.",
    "One of the earliest struggles came with Renaissance Man Inc., a health food company Walker founded in 1997 to sell and promote health-conscious products starting with aloe-based health drink Aloe-Lu-Ya.",
    "The largest venture within H. Walker Enterprises appears to be Renaissance Man Food Services, a poultry products and distribution company, according to court records and Walkers own public statements.",
    "In reality, manufacturers supply chicken to Renaissance Man Food Services which the company then sells to retailers and other business under one of Walkers food brands, court documents show.",
    "His celebrity and folkloric status as the star that brought UGA a 1980 national football championship has helped Walker take a commanding lead over his Republican rivals in initial polling.",
    "Defendant Mr. Walker, although having been duly and legally served with Plaintiffs Original Petition, failed to appear and answer, and wholly made default, the judge wrote in their ruling.",
    "It is critical that voters know where each candidate stands on important issues, what moneyed interests might influence them and whether the candidates have behaved ethically in the past.",
    "The companys website lists a number of Walkers businesses and brands, including 34 Promotions, Herschels Famous 34, Herschels Mamas Cookin, Herschels Raw Talent and H. Walker Foods.",
    "In a 2018 lawsuit against his company, Walker backtracked from previous public statements hed made about the poultry business and his involvement in the chicken processing plants.",
    "His political opponents, though, say the questions about his business experience are emblematic of a greater problem in his bid to unseat Democratic U.S. Sen. Raphael Warnock.",
    "If theres nothing else you need in public office, you have to have somebody that you can trust, said Sonnenfeld, who previously taught at Emory University for nearly a decade.",
    "While football great Herschel Walkers bid for the U.S. Senate hinges on his celebrity, hes just as likely to bring up his reputation as a businessman on the campaign trail.",
    "The large estimates of employees he has made to the press over the years appear to refer to chicken processing jobs, which are not actually part of Walkers business.",
    "He acknowledged that the company didnt own any plants, but that he partnered with the company that actually owns the plants to sell his branded chicken products.",
    "Walkers campaign has downplayed his role in the company and called him a minor investor, according to an article in the Columbus Ledger-Enquirer in February.",
    "A Texas judge granted a default judgment against Walker and his business partner, Brandon Scrushy, in both cases after they ignored the court, records show.",
    "Its unclear from SEC documents when Walker left the company, but a 2008 filing lists his friend and ACMG board secretary, George Mappin, as the interim CEO.",
    "The pair were also connected by Renaissance Manufacturing, Mappins family textile business based in South Carolina that Walker was involved in until 2017.",
    "About this coverage\nAJC is committed to ensuring that Georgians are fully educated about the candidates for U.S. Senate and others who seek public office.",
    "At stops around the state and in online appeals, the Republican Senate front-runner boasts of creating several successful businesses and hundreds of jobs.",
    "The review also revealed a string of defaults, settlements and lawsuits alleging that Walker and his businesses owed millions of dollars in unpaid loans.",
    "Mini Tyson Foods\nWhen Herschel Walker retired from pro football a quarter century ago, he set about to parlay his fame into a successful business career.",
    "Attend forums and debates throughout the election cycle so you know how the candidates are staking out their positions and answering urgent questions.",
    "The merged company fell behind in payments or defaulted on at least five loans amounting to a combined $8.2 million dollars,according to SEC records.",
    "In a separate 2011 lawsuit, First Chatham Bank in Savannah sued Walker and Mappin for defaulting on a $300,000 loan related to an unnamed venture.",
    "Whenever Georgia needed somebody to speak up for their businesses, they called Herschel Walker, he told supporters at a recent rally in Dahlonega.",
    "Commitment to excellence demonstrated in my athletic achievements is now incorporated into my business endeavors, he says on the companys website.",
    "As any entrepreneur who has enjoyed any sort of success knows, some businesses do better than others, said campaign spokesperson Mallory Blount.",
    "Its website lists Herschels Famous 34 food brand as a supplier, and a Facebook promotional video from 2020 refers to Walker as a majority owner.",
    "A Delaware-based mental health care provider is paying him $330,000 this year to serve as a spokesman for its support program for veterans.",
    "In those same years, the companywhich is a separate entity from Renaissance Man Food Servicesposted net losses of $900,606 and $1,879,626.",
    "He told the Dallas Morning News in 2009 that Renaissance Man Food Services employed more than 100 people and grossed $70 million a year.",
    "Defendant Mr. Walker\nIn more recent speeches, Walker has touted his involvement and ownership stake in Zoners Pizza, Wings and Waffles.",
    "A pair of lawsuits filed in Texas over the past two years are linked to the company and allege that it defaulted on $700,000 in loans.",
    "Between July 2020 and December 2021, Walker received $415,000 from 17 speeches according to his December federal campaign disclosure.",
    "Walker has, for the most part, avoided interviews with news outlets and has recently said he would not debate his Republican rivals.",
    "He has described the company as a mini Tyson Foods and touted it as the largest minority-owned business of its kind in the country.",
    "Publish profiles of each candidate aimed at understanding each candidates personal life, background, influences and qualifications.",
    "In 2002, the company merged with American Consolidated Mining Co. and was renamed American Consolidated Management Group (ACMG).",
    "The businesss branding uses his signature 34 jersey number and a whole section of the site lists his athletic accomplishments.",
    "That same year the company stopped filing reports to the SEC and the regulatory agency revoked its securities status in 2013.",
    "One creditor sued in 2005, alleging the company had failed to repay an $800,000 loan, which was later settled for $110,744.",
    "Walker was appointed as president and CEO, but the company struggled to make a profit and the financial problems continued.",
    "He views himself as a voice for Georgias business owners as he battles for a seat that could decide control of the Senate.",
    "In a pair of statements, it defended his record but did not address specific questions about his past business problems.",
    "A marketing firm claimed in another suit that the company owed them $570,000, which was eventually settled for $65,000.",
    "The company, which lists 15 locations across Florida, Alabama, Texas and Georgia, has touted its connection to Walker.",
    "The newspaper will, over the course of this election cycle, focus on each of the candidates representing all parties.",
    "If you cant run your own business, asked Democratic state Sen. Emanuel Jones, how can you run the nations business?",
    "The creditor, Veritex Community Bank, filed suit in Fulton County last fall looking to enforce the Texas judgement.",
    "These conditions raise substantial doubt about the ability of the Company to continue, ACMG said in the filing.",
    "In a statement regarding the lawsuits, Zoners said that Walker was an original investor in the business.",
    "The company, headquartered in Savannah, serves as an umbrella for most of his other business ventures.",
    "Renaissance Man Inc. had net sales of $52,679 and $4,676 in 2000 and 2001, respectively filings show.",
    "Since then, he has launched or been affiliated with at least 12 companies and brands, records show.",
    "The bank settled with the pair several months after the suit was filed and the case was dismissed.",
    "In his December financial disclosure, Walker reported earning a $100,000 salary from the company.",
    "In 2003, the companys accountants resigned over an unpaid $4,780 bill, according to SEC filings.",
    "In the business world he is not anywhere in the league of any of his Republican predecessors.\"",
    "His campaign said Walker is extremely proud of his accomplishments and his record of success.",
    "Walker has frequently touted these businesses as evidence of his success as a jobs creator.",
    "Hes the finest gentleman that youll ever meet in your life  honorable, Mappin told the AJC.",
    "There are a lot of fine qualities in his background as an athlete to celebrate, of course.",
    "There are a lot of fine qualities in his background as an athlete to celebrate, of course.",
    "Walker, however, has told a different story in government documents and in court records.",
    "The most important thing there is that he hasnt established himself as a pillar of trust.",
    "I dont mean to speak of own in a technical sense, he said in a declaration to the court.",
    "In a more recent interview, Walker told Fox News that the company employed 600 people.",
    "In 1999, Aloe-Lu-Ya launched on the shelves of Walmart, but the drink didnt sell.",
    "It added that it is in the final stages of refinancing the loans with a new bank.",
    "Herschel will no longer be a signer on the refinanced debt, the statement said.",
    "In an interview with the AJC, Mappin declined to elaborate on the 2011 lawsuit.",
    "The first loan in April 2020 amounted to $111,300 and has since been forgiven.",
    "To access the newspapers ongoing coverage of politics, visit ajc.com/politics.",
    "He also received more than $420,000 from a pair of sports marketing companies.",
    "Walkers campaign declined an interview request to discuss his business career.",
    "The companys marketing materials say nothing about its financial struggles.",
    "A 2008 SEC filing painted a grim portrait of the companys operating losses.",
    "It accused the AJC of a witch hunt because Walker is leading in the polls.",
    "His reputation has also made him a popular figure on the speaking circuit.",
    "This product launch was a failure, the company said in a 2002 SEC filing.",
    "It shows that he will exploit false information for personal gain.",
    "His largest holding, H. Walker Enterprises, was founded in 2002.",
    "Voters must make informed choices when electing our leaders.",
    "Despite Walkers endorsement, Renaissance Man Inc. stumbled.",
    "He said that he and Walker remain close friends.",
    "Todays focus is on candidate Hershel Walker.",
    "And lawsuits followed.",
    "About the Authors"
  ]
}