{
  "id": 8047,
  "mediaId": 1576,
  "date": "3/11/2022 12:00:00 AM",
  "headline": "Candidates confirmed for 2022 election in Georgia as qualifying ends",
  "image": "https://www.wabe.org/app/uploads/2022/03/AP101028044572-336x189.jpg",
  "link": "https://www.wabe.org/candidates-for-2022-election-in-georgia-confirmed-as-qualifying-ends/",
  "sentiment": "0",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1274,
    1664,
    1776,
    1896,
    2095,
    2438,
    3082,
    5727,
    5846,
    5886,
    5934,
    5982,
    2672
  ],
  "sentences": [
    "Heres a look at candidates who signed up to run for statewide and congressional district offices:\nUNITED STATES SENATE\nDemocrats: Raphael Warnock (incumbent), Tamara Johnson-Shealey.",
    "Democrats and Republicans who have opponents in their own party will run in primaries on May 24 to settle party nominations, with party runoffs on June 21 if needed.",
    "LIEUTENANT GOVERNOR\nDemocrats: Erick Allen, Charlie Bailey, Tyrone Brooks Jr., Tony Brown, Kwanza Hall, Jason Hayes, Derrick Jackson, R. Malik, Renitta Shannon.",
    "Republicans: Jake Evans, Byron Gatewood, Meagan Hanson, Blake Harbin, Rich McCormick, Paulette Smith, Mallory Staples, Suzi Voyles, Eugene Yu.",
    "Republicans: Marjorie Taylor Greene (incumbent), Eric Cunningham, James Haygood, Charles Lutin, Jennifer Strahan, Seth Synstelien.",
    "COMMISSIONER OF LABOR\nDemocrats: William Will Boddie Jr., Thomas Dean, Nicole Horn, Lester G. Jackson III., Nadia Surrency.",
    "U.S. HOUSE DISTRICT 10\nDemocrats: Jessica Allison Fore, Tabitha Johnson-Green, Phyllis Hatcher, Femi Oduwole, Paul Walton.",
    "Republicans: Timothy Barr, Paul Broun, Mike Collins, David Curry, Vernon J. Jones, Marc McMain, Alan Sims, Mitchell Swan.",
    "STATE SCHOOL SUPERINTENDENT\nDemocrats: Currey Hitchens, Jaha V. Howard, James Morrow Jr., Alisha Thomas Searcy.",
    "Republicans: Gary Black, Josh Clark, Kelvin King, Jonathan Jon McColumn, Latham Saddler, Herschel Walker.",
    "SECRETARY OF STATE\nDemocrats: Dee Dawkins-Haigler, John Eaves, Floyd Griffin, Bee Nguyen, Michael Owens.",
    "Republicans: Vivian L. Childs, Jeremy Hunt, Wayne Johnson, Rich Robertson, Chris West, Paul Whitehead.",
    "US HOUSE DISTRICT 13\nDemocrats: David Scott (incumbent), Mark Baker, Shastity Driscoll, Vincent Fort.",
    "U.S. HOUSE DISTRICT 5\nDemocrats: Nikema Williams (incumbent), Charlotte Macbagito, Valencia Stovall.",
    "Republicans: Andrew Clyde (incumbent), Michael Boggus, John London, Ben Souther, J. Gregory Howard.",
    "Republicans: Brian Kemp (incumbent), Catherine Davis, David Perdue, Kandiss Taylor, Tom Williams.",
    "PUBLIC SERVICE COMMISSION, DISTRICT 3\nDemocrats: Shelia Edwards, Chandra Farley, Missy Moore.",
    "U.S. HOUSE DISTRICT 7\nDemocrats: Carolyn Bourdeaux (incumbent), Lucy McBath, Donna McLeod.",
    "COMMISSIONER OF INSURANCE\nDemocrats: Raphael Baker, Janice Laws Robinson, Matthew Wilson.",
    "U.S. HOUSE DISTRICT 1\nDemocrats: Joyce Marie Griggs, Wade Herring, Michelle L. Munroe.",
    "Republicans: Brad Raffensperger (incumbent), David Belle Isle, Jody Hice, T.J. Hudson.",
    "COMMISSIONER OF AGRICULTURE\nDemocrats: Winfred Dukes, Nakita Hemingway, Fred Swann.",
    "Republicans: Michael Corbin, Mark Gonsalves, Lisa McCoy, YG Nyghtstorm, Mary West.",
    "PUBLIC SERVICE COMMISSION, DISTRICT 2\nDemocrats: Patty Durand, Russell Edwards.",
    "U.S. HOUSE DISTRICT 14\nDemocrats: Wendy Davis, Marcus Flowers, Holly McCormack.",
    "Qualifying concluded Friday for the Nov. 8, 2022, general election in Georgia.",
    "U.S. HOUSE DISTRICT 4\nDemocrats: Henry C. Hank Johnson Jr. (incumbent).",
    "U.S. HOUSE DISTRICT 2\nDemocrats: Sanford Bishop (incumbent), Joe OHara.",
    "ATTORNEY GENERAL\nDemocrats: Jennifer Jen Jordan, Christian Wise Smith.",
    "Republicans: Burt Jones, Mack McGregor, Butch Miller, Jeanne Seaver.",
    "U.S. HOUSE DISTRICT 6\nDemocrats: Bob Christian, Wayne C. White.",
    "Republicans: John King (incumbent), Patrick Witt, Ben Cowart.",
    "U.S. HOUSE DISTRICT 12\nDemocrats: Elizabeth Liz Johnson.",
    "Republicans: Richard Woods (incumbent), John D. Barge.",
    "Republicans: Kartik Bhatt, Mike Coan, Bruce Thompson.",
    "Republicans: Drew Ferguson (incumbent), Jared Craig.",
    "U.S. HOUSE DISTRICT 9\nDemocrats: Michael Mike Ford.",
    "Republicans: Chris Carr (incumbent), John Gordon.",
    "U.S. HOUSE DISTRICT 8\nDemocrats: Darrius Butler.",
    "U.S. HOUSE DISTRICT 11\nDemocrats: Antonio Daza.",
    "U.S. HOUSE DISTRICT 3\nDemocrats: Val Almonord.",
    "Republicans: Earl L. Buddy Carter (incumbent).",
    "Republicans: Caesar Gonzales, Calina Plotky.",
    "Republicans: Barry Loudermilk (incumbent).",
    "Republicans: Jonathan Chavez, Surrea Ivy.",
    "Republicans: Rick W. Allen (incumbent).",
    "Republicans: Austin Scott (incumbent).",
    "Republicans: Fitz Johnson (incumbent).",
    "Republicans: Tim Echols (incumbent).",
    "GOVERNOR\nDemocrats: Stacey Abrams.",
    "Independents: Mollie Mali Beavers.",
    "Libertarians: David Raudabaugh.",
    "Libertarians: Colin McKinney.",
    "Libertarians: Emily Anderson.",
    "Republicans: Christian Zimm.",
    "Libertarians: Martin Cowen.",
    "Libertarians: Chase Oliver.",
    "Libertarians: Angela Pence.",
    "Libertarians: Ryan Graham.",
    "Libertarians: Shane Hazel.",
    "Republicans: Tyler Harper.",
    "Independents: Al Bartell.",
    "Libertarians: Ted Metz."
  ]
}