{
  "id": 8048,
  "mediaId": 43,
  "date": "3/11/2022 12:00:00 AM",
  "headline": "Trump fundraiser event promised",
  "image": "https://images.dailykos.com/images/1047322/story_image/GettyImages-1335517498.jpg?1647032409",
  "link": "https://www.dailykos.com/story/2022/3/11/2085359/-Small-donor-Trump-fundraiser-event-promised-a-meet-and-greet-Guess-who-didn-t-get-to-meet-Trump",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1147,
    525,
    2824
  ],
  "sentences": [
    "Related: New report connects Trump organization with the largest tax fraud case in New York City history\nRelated: Don't tell anyone but Trump (or Republican donors) is building a new plane (unless he's lying)\nRelated: Donald Trump, serial grifter who never gives back, has soaked up more than $100 million in donations\nSpokesman Taylor Budowich told the Post that Due to an administrative error in this individual circumstance, the contest winner was not properly notified for last weekends event in New Orleans.",
    "The Washington Post asked Save America to provide winners for a series of other contests it has held, which included meeting the president at a rally in South Carolina this weekend, meeting Trump at his palatial Florida club last year, playing golf with Trump and Georgia Senate candidate Herschel Walker in Palm Beach, or receiving commemorative memorabilia  such as a football signed by Trump and Walker, a College Football Hall of Famer.",
    "On Friday, it was reported that the Trump scam machine, besides being total hooey, has such little regard for the millions of MAGA suckers it cons that it has been fundraising off of promises of meet-and-greetsand then just blowing them off.",
    "Give a little money and you would be entered into a contest of sorts to be flown out and put up in a New Orleans hotel, with a chance to shake the short stubby hand of the disgraced, twice-impeached Trump in person.",
    "My guess is that they can produce those winners names about as readily as they can produce the evidence that millions of fraudulent votes were cast or switched to President Joe Biden during the 2020 election.",
    "Not unlike the evangelicals who gave up their God for the anti-Christ Trump and a few Supreme Court nominees, Trumps Save America PAC is willing to say and do anything to keep the expensive lights on.",
    "Every single claim has been refuted numerous times, and the hundreds of millions of dollars pulled in has not led to a single shred of meaningful election fraud evidence coming forward.",
    "In fact, Daily Kos Hunter just reported on how the conmans campaign has decided to use the engine failure of someone elses private jet to try and fundraise himself a new private plane.",
    "Considering how Trumps campaigns and foundation and inaugural committees have worked in the past, it is probably safe to say things are already steeped in swamp water.",
    "Its important to remember: For all of his bluster, the money Trump has pulled in has definitely not been used to help any of the people that call Trump their ally.",
    "How much money the PAC was able to pull in as a result of this New Orleans scam will not be known until later this year, when the PAC reports contributions.",
    "Its sort of like you promised something, took peoples money, and then just went to New Orleans using their money to pay for your trip to New Orleans.",
    "The Washington Post reports that Trumps political action groups promoted a contest for small-dollar donors in a series of more than a dozen emails.",
    "Since leaving office, Trump has soaked up hundreds of millions in donations for his pretend big lie efforts and his promises of a future campaign.",
    "Offering up false hopes, even ones like meeting the grotesque groping Trump, seems to be the basic operating procedure for Trump fundraisers.",
    "According to four people WaPo spoke with, nobody was flown out and nobody except big-check donors got a chance to meet the former president.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "But in the end, this money goes toward Trump and his minions continuing to live the lifestyle of a wealthy dictator in exile.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "In fact, your best shot at getting that cash is to do it before it ends up inside of the Trump crime familys coffers.",
    "Heres another story about the Save America PAC from The Washington Post:\n Maybe they were too lazy to vet this guy?",
    "If you arent in the inner circleand named Trumpyou are only going to get a little of the runoff from the grift.",
    "Considering that no plane arrangements or hotel arrangements were made, that seems like a rather large error.",
    "If you are using the Trumps as a part of your fundraising efforts, you are going to be fleeced, as well.",
    "Its a big business for people whose only business is trying to figure out ways to take your money.",
    "Consistent with the rules of the sweepstakes, a substitute prize will be awarded to the winner.",
    "The Word of God needs jet fuel and private accommodations in order to be spread comfortably.",
    "Part of this money is dedicated to the numerous legal issues the Trump crime family faces.",
    "The Trump machine created a large revenue stream peddling baseless election fraud claims.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Save America declined to comment but said they totally have met winners and stuff.",
    "The latter is an old scam used in recent years by evangelical Christian leaders.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "That's about as close as he's going to let you get.",
    "The Trump crime family is tight with its grift.",
    "That was supposed to happen this past weekend.",
    "This is a short blurb about Daily Kos.",
    "At least thats technically the law.",
    "Thats some cold-blooded hubris.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}