{
  "id": 8049,
  "mediaId": 409,
  "date": "d2022-03-10T13:46",
  "headline": "The Way to Beat Ilhan Omar or Marjorie Taylor Greene Is through Their Primary Opponents",
  "image": "https://www.nationalreview.com/wp-content/uploads/2020/09/omar-2019.jpg?w=1600",
  "link": "https://www.nationalreview.com/corner/the-way-to-beat-ilhan-omar-or-marjorie-taylor-greene-is-through-their-primary-opponents/",
  "sentiment": "0.0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan McLaughlin",
  "authorUrl": "",
  "termIds": [
    683,
    815,
    1134,
    1424,
    1507,
    1839,
    5777,
    5947,
    545,
    2826
  ],
  "sentences": [
    "In interviews announcing his run, Samuels is hammering Omar both on her defund-the-police stance and her abrasive style (including her vote against the Biden infrastructure bill), while stressing that he agrees with many other of her progressive stances on issues:\nUnfortunately in this case, Rep. Omars position was quite literally my way or the highway, a position that fails to recognize the tremendous infrastructural needs of our community .",
    "As for Greene, as I have previously detailed here and here, even the redrawing of Greenes district has not changed its deep-red nature (R+45, per FiveThirtyEight), but it has offered a realistic (if also uphill) primary challenger in Jennifer Strahan, who is likewise running against Greenes divisiveness and ineffectiveness while campaigning as a pro-Trump conservative.",
    "In part, that reflects the mixed demographics of her district, where Omar draws heavily on the Muslim immigrant vote, while facing challenges like this:\nMinneapolis lawyer Don Lewis, who is endorsing Melton-Meaux, says his main issue with Omar isnt her controversial comments on Israel, but her lack of connection with the districts needs.",
    "Kilgore laments the fact that Democratic donors are instead shoveling cash at the Democrat running in Georgias 14th district:\nThe good news for those who would like to get MTG out of Congress is that by the end of 2021, an estimated $6.5 million had been raised by seven people looking to challenge her in the 2022 midterms.",
    "Omars new primary challenger, Don Samuels, is a soft-spoken 72-year-old Jamaican immigrant who runs a social-services organization; he served over a decade on the Minneapolis City Council from 2003 to 2013, ran unsuccessfully for mayor in 2013, and later served a term on the school board.",
    "Greene is radioactive enough at this point that Herschel Walker pulled out of a joint appearance after Greene spoke at an event run by Holocaust-denying, Putin-cheering white nationalist Nick Fuentes  an appearance denounced by both Mitch McConnell and Kevin McCarthy.",
    "Greene preposterously claimed not to know anything about Fuentes or his event, even though the whole point of Fuentes holding a separate gathering is because he and his tiny, unrepresentative band of brown bibs got kicked out of CPAC for being white nationalists.",
    "In each of her three campaigns (going back to the state legislature), Omar has had to battle primary opponents, winning 41 percent in 2016, 48 percent in 2018, and by 57 percent to 39 percent against Antone Melton-Meaux, a well-funded opponent, in August 2020.",
    "He returned to prominence in 2021 as a leader of the movement that opposed the Omar-backed Minneapolis defund the police ballot initiative and supported an initiative to strip power from the radical, anti-police city council in favor of the mayors office.",
    "While Rep. Omar described defund the police as a policy demand, I share the view of Democrats like former President Barack Obama who believe the slogan created unnecessary alienation at a time when progress on police accountability was most needed .",
    "And the Republican with the best chance of unseating Greene in the GOP primary barely has two dimes to rub together the candidate nearly universally identified as Greenes most formidable Republican opponent hasnt raised even half of that.",
    "Omar won the district by 38.5 points in 2020 and by 56 points in 2018, and DailyKos estimates that nearly 97 percent of the voters in the redrawn district were in Omars previous district, so redistricting has not changed much.",
    "Shes running strictly on a message that the 14th deserves a congresswoman who can sit on committees and work quietly without creating a constant spectacle  you know, a performing, rather than a performative, MAGA champion.",
    "It would be comforting to think that Republicans can knock off Omar in what is shaping up as a red-wave year, and of course, Republicans would be wise to at least field a candidate in every race.",
    "Jennifer Strahan, another political novice, is being backed by three of the five commissioners in Greenes home county (Floyd) and has gotten some national attention from fellow conservatives.",
    "Greene richly deserves to be replaced in Congress, but Democrats funneling cash to her general-election opponents instead of backing Strahan are doing nothing to help make that happen.",
    "But as of the end of 2021, she had raised only $109,000 and had a paltry $60,000 in cash on hand, compared to Greenes $3.5 million (on fundraising of nearly $7.5 million).",
    "One of them, former Iowa State basketball star and (briefly) NBA player Royce White, has been making the rounds with Tucker Carlson, Steve Bannon, and Jason Whitlock.",
    "The bad news is that all but a small share of that loot was raised by Democrats, who have very little chance of winning in one of the reddest districts anywhere.",
    "Lewis, who is Black, said he views Melton-Meaux as an effective coalition builder whose background as a descendant of African enslaved people is meaningful.",
    "The more offensive and radical a member of Congress is, the more grassroots donors from the other party all across the country want to help defeat them.",
    "Both Omar and Greene have primary challengers, and partisans who want to be rid of them should swallow hard and donate to their primary opponents.",
    "This would be like showing up at the Principles First Summit and professing ignorance that they were not fans of Donald Trump.",
    "And if Omar or Greene ran for statewide office or ran in a competitive district, that would be a reasonable strategy.",
    "And that alienated a big part of the city, certainly the Northside community, and I think the votes prove that.",
    "Progressives such as Ed Kilgore of New York would love to see Marjorie Taylor Greene replaced by a Democrat.",
    "But donations made directly to a hopeless campaign are wasted money that could be better spent elsewhere.",
    "You do not need to share Samuelss left-wing politics to wish him well in this worthwhile endeavor.",
    "By FiveThirtyEights computations, the district is D+57  57 points more Democratic than the nation.",
    "Samuels won both fights, and Omars pro-defund city council allies went down to defeat.",
    "My community was experiencing trauma and we need representation to reflect our needs.",
    "Defeating Omar in a primary, while still a tough haul, is a more realistic prospect.",
    "That we need police, we need good police and we need adequate amounts of police.",
    "As a conservative, I would love to see Ilhan Omar replaced by a Republican.",
    "But Minnesotas fifth district hasnt been won by a Republican since 1960.",
    "For the parties and outside groups, that can be a boon to fundraising.",
    "Money thrown at Omars Republican opponents is likely to be wasted.",
    "Our current Congressperson thought we didnt need police.",
    "Omar already has three Republican opponents.",
    "It was held by Keith Ellison before Omar.",
    "But its not.",
    ".",
    ".",
    ".",
    "."
  ]
}