{
  "id": 8053,
  "mediaId": 193,
  "date": "3/9/2022 12:00:00 AM",
  "headline": "Does Russell Wilson trade to Broncos rank among biggest in NFL history?",
  "image": "https://www.denverpost.com/wp-content/uploads/2022/03/AP46486258356.jpg?w=1524",
  "link": "https://www.denverpost.com/2022/03/09/broncos-russell-wilson-nfl-biggest-trades/",
  "mediaOutlet": "The Denver Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan O’Halloran",
  "authorUrl": "https://www.denverpost.com/author/ryan-ohalloran/",
  "termIds": [
    815,
    5718,
    5749,
    449,
    5564,
    5567,
    5580,
    5600,
    5610,
    5621,
    5626
  ],
  "sentences": [
    "The deal: The Dallas Cowboys traded Walker (who received $1.5 million to accept the deal) to Minnesota for cornerback Issiac Holt, running back Darrin Nelson, defensive end Alex Stewart, linebackers Jesse Solomon and David Howard and what eventually became three first- and second-round picks apiece and one third- and sixth-round pick apiece.",
    "The Colts received Dickerson (from the Rams), the Bills acquired rookie linebacker Cornelius Bennett (from the Colts) and the Rams got running backs Greg Bell and Owen Gill and a total of three first- and second-round picks apiece.",
    "The Seahawks sent Wilson and a fourth-round pick this year to the Broncos for quarterback Drew Lock, tight end Noah Fant, defensive end Shelby Harris, first- and second-round picks in 2022-23 and a fifth-round pick this year.",
    "The deal: Raiders owner Al Davis traded Gruden, his coach, to the Tampa Bay Buccaneers for first- and second-round picks in 2002, a first-round pick in 03, a second-round pick in 04 and $8 million.",
    "The deal: A month after turning 27, Tarkenton was traded by Minnesota to the New York Giants for first- and second-round picks in 1967, a second-round pick in 68 and a player to be named later.",
    "The Broncos agreed-upon trade to acquire quarterback Russell Wilson from the Seattle Seahawks for three players and five draft picks was instantly regarded as one of the biggest in NFL history.",
    "Among the draft picks acquired from the Buccaneers, the Raiders added linebacker Napoleon Harris (100 games), tight end Doug Jolley (120 catches) and defensive end Tyler Brayton (141 games).",
    "The deal: Matson, a star running back for the Chicago Cardinals, was traded to the Los Angeles Rams for seven players, a second-round draft pick and a player to be named later.",
    "The result: Tarkenton was in his prime, having made the Pro Bowl in 1964-65, but in his four years with the Giants, he had only one winning record (9-5 in 70).",
    "Who won the deal: The Vikings  eventually, because they made a Super Bowl after trading Tarkenton and returned three times after getting him back.",
    "The deal: The three-team trade involved Indianapolis, Buffalo and the Los Angeles Rams and a total of four players and six draft picks.",
    "In chronological order, here are the top five trades prior to the Broncos-Seahawks megadeal:\nOllie Matson to Rams\nDate: Feb. 28, 1959.",
    "The result: Matson played four years for the Rams and rushed for 170, 181 and no yards after debuting with an 863-yard season in 59.",
    "The result: Tampa Bay won the Super Bowl in Grudens first season over Davis Raiders, but made the playoffs only twice from 2003-21.",
    "The result: Dickerson helped Indianapolis to the playoffs in 87 and won the rushing title in 88 on his way to the Hall of Fame.",
    "The Rams went 2-10, 4-7-1, 4-10 and 1-12-1 in Matsons four years and the Cardinals had one winning season during that span.",
    "New Dallas coach Jimmy Johnson said another NFL owner told him the deal was a great train robbery, and that was accurate.",
    "A future Pro Football Hall of Fame inductee, he would move on to play one year with Detroit and three with Philadelphia.",
    "Johnson acquired all of the extra picks as a condition for cutting or trading the players acquired by the Vikings.",
    "Matson was entering his age-29 season and had been named All Pro five times in his six years with the Cardinals.",
    "The result: Walker was 27 when traded and the Vikings viewed him as the final piece of their Super Bowl puzzle.",
    "Because of Wilsons age (33) and the Seahawks return, it is already among the top six before he ever dons a No.",
    "Tarkenton was flipped back to Minnesota in 1973 and helped the Vikings to three Super Bowls (all losses).",
    "He did make the Pro Bowl in four of his five years, totaling 103 touchdowns and 72 interceptions.",
    "But he played only 42 games for the team (2,264 rushing yards) and one playoff game (a loss).",
    "Bennett played nine years for the Bills (five Pro Bowls, 52 1/2 sacks and four Super Bowls).",
    "Those picks turned into the foundation of a three-time Super Bowl championship team.",
    "The Rams didnt do much with the extra draft picks, but made the playoffs in 1988-89.",
    "Who won the deal: The Bills because of Bennetts outstanding career for Buffalo.",
    "Who won the deal: The Buccaneers because of their Super Bowl title.",
    "This should be considered the biggest trade in NFL history.",
    "But where does it rank among the biggest blockbusters?",
    "The Giants, though, did not reach the postseason.",
    "Herschel Walker to Vikings\nDate: Oct. 12, 1989.",
    "Fran Tarkenton to Giants\nDate: March 7, 1967.",
    "Eric Dickerson to Colts\nDate: Oct. 31, 1987.",
    "Jon Gruden to Bucs\nDate: Feb. 18, 2002.",
    "Who won the deal: The Cowboys, period.",
    "Who won the deal: Nobody.",
    "3 Broncos jersey.",
    "A 1-for-9 swap."
  ]
}