{
  "id": 8061,
  "mediaId": 12,
  "date": "d2022-03-08T22:00",
  "headline": "Kemp and Warnock push for halt to gas taxes as prices rise",
  "image": "https://www.ajc.com/resizer/txqOYW6FLydvLKCvNbt0ziLqU30=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/GW2CWUFHKSKEGIYYYI5BWQKJLA.jpg",
  "link": "https://www.ajc.com/news/georgia-news/kemp-and-warnock-push-for-halt-to-gas-taxes-as-prices-rise/LO5NHKPYU5DBDP5WXGL4I4A6RQ/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JEFF AMY",
  "authorUrl": "",
  "termIds": [
    815,
    1136,
    2095,
    428,
    2555,
    2672,
    2888
  ],
  "sentences": [
    "Stephen Lawson, spokesperson for the 34N22 political action committee, which is supporting Republican senate candidate Herschel Walker, said in February that Warnock's record is causing Georgias gas prices to spike and our country to lose its energy independence.",
    "Brian Kemp said Tuesday he wants to suspend collections of state motor fuel taxes amid rising pump prices, on the same day Democratic President Joe Biden announced a ban on U.S. imports of Russian oil, a move likely to continue the upward pressure on prices.",
    "Democratic U.S. Sen. Raphael Warnock of Georgia has already been advocating for the federal government to suspend collection of its gas tax, responding to discontent over rising fuel prices, a marker of inflation.",
    "\"Because of our strong, fiscally conservative budgeting, I'm confident we will be able to provide relief to hardworking Georgians  both in the form of a tax refund and lower gas taxes,\" Kemp tweeted.",
    "Kemp's office said the administration was still developing details and could not say how he would replace the revenue used to build and maintain roads and other transportation infrastructure.",
    "Kemp did not say how long he would want to suspend taxes for or how much it would cost, pending a bill likely to be introduced Wednesday in the General Assembly.",
    "But Republicans attack Warnock, saying he backed Biden's plans to cancel a pipeline from Canada and suspending leasing and drilling permits on federal lands.",
    "Warnock on Tuesday said cutting off oil imports from Russia is the right move for the United States,\" but renewed his call for federal relief at the pump.",
    "It's part of a broader push by Warnock on trying to limit price increases as inflation has risen and become a drag on Democrats' political prospects.",
    "Last year, Kemp temporarily suspended state fuel taxes when a cyberattack shut down a key pipeline that delivers gas and diesel to much of the state.",
    "According to AAA, Georgia consumers were paying $4.06 per gallon of gas Tuesday including taxes, compared to a national average of $4.17.",
    "Instead, they point to rebounded demand after the shutdowns at the beginning of the COVID-19 pandemic, as well as the Russia-Ukraine war.",
    "Many experts say the cancellation of the Keystone XL pipeline, which was not yet operating, has had no effect on current gas prices.",
    "Kemp did say the plan would not imperil his proposal to give $1.6 billion in state income tax refunds out of a state budget surplus.",
    "And I think it is important to emphasize that while they are seeing record prices, oil and gas companies are seeing record profits.",
    "Warnock said Feb. 22 at a gas station in the Atlanta suburb of Sandy Springs that people are felling the pinch from rising prices.",
    "Warnock is co-sponsoring a bill, along with five other Democratic senators, to suspend federal gas tax collections until Jan. 1.",
    "We must continue to meet Russias unprovoked war in Ukraine with swift and severe consequences, Warnock said in a statement.",
    "Georgia collected $157 million in motor fuel taxes in February and $1.78 billion in the budget year that ended June 30.",
    "Georgias gasoline price includes a federal tax of 18.4 cents per gallon and a state tax of 29.1 cents per gallon.",
    "In Georgia and Washington, Republicans have been attacking Democrats as too hostile to fossil fuel development.",
    "Federal taxes on diesel fuel are 24.4 cents per gallon, while Georgias tax on diesel is 32.6 cents per gallon.",
    "Some Georgia gas stations raised their prices by as much as 50 cents a gallon over the weekend.",
    "Kemp, for example, said he was acting due to a total failure of leadership in Washington.",
    "Gas prices are significantly higher than they were just a few months ago,\" he said then.",
    "So its really important that we hold these oil and gas companies accountable.",
    "It's also unclear if the governor would seek to suspend local levies.",
    "Both Warnock and Kemp are seeking reelection this year.",
    "A number of cities and counties also charge taxes.",
    "ATLANTA (AP)  Republican Georgia Gov."
  ]
}