{
  "id": 8075,
  "mediaId": 178,
  "date": "3/7/2022 12:00:00 AM",
  "headline": "Republican 'unforced errors' threaten path to Senate control",
  "image": "https://chorus.stimg.co/23294446/merlin_66282614.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/republican-unforced-errors-threaten-path-to-senate-control/600153631/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "STEVE PEOPLES and BRIAN SLODYSKO Associated Press",
  "authorUrl": "",
  "termIds": [
    815,
    886,
    971,
    1572,
    428,
    600,
    2661,
    2818,
    2959
  ],
  "sentences": [
    "Rep. Val Demings, the leading Democrat in the race to unseat Florida Sen. Marco Rubio, acknowledged that her party has struggled to highlight its accomplishments  including sweeping coronavirus pandemic relief and a massive infrastructure package  in the face of President Joe Biden's political woes.",
    "\"Frankly, Democrats just need to hold seats in states Biden won,\" said Jessica Floyd, the president of the pro-Democratic super PAC American Bridge, which launched a $5 million paid advertising campaign late last week across four states: Arizona, Georgia, Nevada and Pennsylvania.",
    "Staffers from Scott's Senate committee moved into triage mode almost immediately, reaching out to Republican campaigns across the country to gauge their frustration while offering messaging help, according to senior Republican strategists with direct knowledge of the situation.",
    "It's much the same in New Hampshire, where Democratic Sen. Maggie Hassan placed $13 million in initial TV and radio advertising reservations for the fall, much of it in the expensive Boston media market, while three Republicans will be locked in a primary through mid-September.",
    "And a recent plan that would raise taxes on low-income Americans and seniors, released by the Republican Senate midterm chief, Florida Sen. Rick Scott, is putting GOP candidates in a difficult position across states like Wisconsin, Ohio and Florida.",
    "He said he's increasingly optimistic about the state viewed as the Democrats' best pickup opportunity, Pennsylvania, and sees competitive races in Republican-held states like North Carolina, Florida and Missouri trending in the right direction.",
    "Scott, the leader of the GOP's Senate midterm efforts, released an 11-point plan late last month that would impose a modest tax increase for many of the lowest paid Americans, while opening the door for cutting Social Security and Medicare.",
    "Rubio's campaign declined to say specifically whether he supported Scott's plan when asked, issuing a statement instead that called Demings \"a do-nothing member of Congress who has never even passed a real law, much less a tax cut.\"",
    "In Nevada, Sen. Catherine Cortez Masto, one of the nation's most endangered Democrats, reported $10.5 million cash on hand at the end of last year, compared to Republican former state Attorney General Adam Laxalt's $1.7 million.",
    "Georgia Democratic Sen. Raphael Warnock finished the year with $22.9 million in the bank, while likely Republican challenger Herschel Walker, the former football star who has been endorsed by Trump, reported $5.4 million.",
    "His decision, which leaves no obvious front-runner in a crowded Republican primary, disappointed Senate Republican leader Mitch McConnell and his allies who had spent months privately encouraging Ducey to run.",
    "WASHINGTON  As the prospect of a red wave grows, a series of Republican missteps including recruiting stumbles, weak fundraising and intense infighting is threatening the GOP's path to the Senate majority.",
    "The strategists, who requested anonymity to discuss private deliberations, said many Senate Republicans had been willing to ignore what they viewed as Scott's presidential ambitions over the last year.",
    "Scott refused to respond on Sunday when asked about McConnell's comments during an appearance on Fox News Channel's \"Sunday Morning Futures,\" offering instead a defiant defense of his broader plan.",
    "Given historic trends against the party that occupies the White House, Law predicted that a state like Colorado or Washington state could become more competitive than expected this fall as well.",
    "A February AP-NORC poll found that more people disapproved than approved of how Biden is handling his job, 55% to 44%, while just 29% of Americans thought the nation was on the right track.",
    "Warnock and Kelly pressed their financial advantages by launching an initial round of television ads in recent weeks as Republican candidates in both states focus on fighting each other.",
    "Amid such Republican infighting, Democrats are pressing their cash advantage on the ground in key states, even as GOP campaign committees in Washington report record fundraising hauls.",
    "And Arizona Democrat Kelly, a former astronaut who won a 2020 special election to serve out the final two years of the late Sen. John McCain's term, reported $18.6 million in the bank.",
    "While Biden did win all four of American Bridge's target states, the Democratic president won three of them by 1 percentage point or less and the other by just 2 percentage points.",
    "The GOP's best pickup opportunities rest in Arizona, Georgia and Nevada, according to Steven Law, a McConnell ally who leads the most powerful Republican-aligned Senate super PAC.",
    "Longer-term historical trends are no less daunting for Democrats: Over the last 40 years, the party that holds the White House has won Senate seats in only two midterm elections.",
    "And without the majority, they lose any hope of enacting Biden's plans to bolster child care, education, family leave and environmental protection while protecting voting rights.",
    "Meanwhile, in Florida, Demings offered a window into the Democrats' challenge by refusing to say whether she wanted Biden to campaign in the state on her behalf when asked.",
    "But at the end of the day, this election is going to be about the historic unpopularity of Joe Biden and his agenda, which virtually all Democrats have blindly supported.\"",
    "But that changed when the Florida senator released his latest proposal, which they considered an \"unforced error\" that triggered a wave of anger across the party.",
    "\"We will not have as part of our agenda a bill that raises taxes on half of the American people and sunsets Social Security and Medicare within five years.\"",
    "Arizona's Republican state Attorney General Mark Brnovich, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "Terry McAuliffe in Virginia's high-profile governor's race last fall, even though Biden had carried the state by 10 percentage points a year earlier.",
    "The challenges amount to an early warning sign for Republicans less than two months before the opening Senate primaries of the 2022 election season.",
    "The Senate Republican leader forcefully rebuked Scott's plan during the Republican leadership's weekly news conference, which Scott was part of.",
    "With Democrats confronting historic headwinds and the weight of an unpopular president, a Republican Senate majority is easily within reach.",
    "Doug Ducey dealt his party its latest setback late last week by announcing he would not challenge Democratic Sen. Mark Kelly this fall.",
    "\"The Democrats are simply failing American families and the voters are ready to give them a butt kicking this November,\" Scott told AP.",
    "But, sensing discord within the GOP, Democrats are suddenly optimistic they may have a path to hold  or even expand  their majority.",
    "Recruiting failures have dashed GOP hopes in reach states like Maryland and threaten a prime pickup opportunity in New Hampshire.",
    "The Senate Democrats' political arm released a radio ad within 24 hours declaring, \"If Senate Republicans win, we pay the price.\"",
    "Meanwhile, escalating tensions among Republican leaders at the highest levels threatens to undercut the party's ambitions.",
    "\"Let me tell you what would not be a part of our agenda,\" McConnell said moments after Scott stepped away from the event.",
    "The health of the economy, a Supreme Court decision on abortion and the war in Eastern Europe remain major variables.",
    "McConnell and former President Donald Trump have long sparred over Republican messaging and candidate endorsements.",
    "Back in Washington, Scott seemed to be in good spirits as he described Biden and his agenda as \"wildly unpopular.\"",
    "\"I've never depended on someone else to do the work for me or someone to give me a pass or come to rescue me.\"",
    "But she seized on Scott's plan as a clear contrast for how Democrats and Republicans would govern differently.",
    "Republican candidates in Arizona, Georgia and Nevada are struggling to keep pace with Democratic fundraising.",
    "But history suggests Democrats would be lucky to preserve their fragile Senate majority in November.",
    "This story has been corrected to show that three, not two Republicans are in New Hampshire primary.",
    "In a 50-50 Senate, Democrats would lose control of Congress' upper chamber if they lose a seat.",
    "In some states, Trump favors far-right nominees who struggle in statewide general elections.",
    "But on paper, at least, the current Senate landscape gives them an inherent advantage.",
    "\"I don't think recent challenges or setbacks or issues are going to define it at all.",
    "\"I grew up poor, Black and female in the South,\" Demings told The Associated Press.",
    "Associated Press writer Jonathan J. Cooper in Phoenix contributed to this report.",
    "But for now, a simmering feud between McConnell and Scott has taken center stage.",
    "Democratic strategists acknowledge their party's uphill odds in the months ahead.",
    "McConnell could not stay silent as he faced reporters last week on Capitol Hill.",
    "\"The fundamentals of this election cycle are still very, very good,\" Law said.",
    "With eight months until Election Day, the political landscape remains in flux.",
    "Republican Glenn Youngkin narrowly defeated former Democratic Gov.",
    "And Rubio's going to own it,\" Demings said in an interview.",
    "\"I'm excited about where we are in this race,\" she said.",
    "But the GOP's shortcomings extend well beyond Arizona.",
    "Those margins should give Democrats little comfort.",
    "There are going to be bumps in the road.",
    "___\nPeoples reported from New York.",
    "\"There's going to be other ideas.\"",
    "It would hurt working families.",
    "\"It's my ideas,\" Scott said.",
    "Arizona's Republican Gov.",
    "It would hurt seniors.",
    "\"This plan is toxic.",
    "\"The map matters.\""
  ]
}