{
  "id": 8087,
  "mediaId": 129,
  "date": "3/3/2022 12:00:00 AM",
  "headline": "In Greene and Boebert, Democrats See a Helpful Political Target",
  "image": "https://static01.nyt.com/images/2022/03/03/us/politics/03dc-repubs-1/merlin_203092122_ad90dade-2f22-4b94-b542-1887ff073cc1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/03/03/us/politics/boebert-greene-republicans.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    883,
    1147,
    1507,
    1609,
    2087,
    2185,
    3094,
    146,
    428,
    562
  ],
  "sentences": [
    "For that reason alone, Democratic operatives say they have every right to elevate the visibility of Ms. Greene and Ms. Boebert and tie them to other Republicans who have refrained from criticizing them even as they have castigated the two Republicans serving on the committee investigating the 2021 attack on the Capitol, Representatives Liz Cheney of Wyoming and Adam Kinzinger of Illinois.",
    "Jessica Floyd, the president of American Bridge, said on Thursday that the groups efforts were crafted to make the midterm elections a choice between what she called a Republican Party of extremists against a Democratic Party focused on the economy and governance  not a referendum on Mr. Biden, whose approval ratings are dangerously low.",
    "On Wednesday, a little-known Republican, Representative Van Taylor of Texas, abruptly dropped his re-election bid after operatives on the partys right flank  angered by his vote to create a bipartisan commission to examine the Jan. 6, 2021, attack on the Capitol  revealed pornographic text messages that he had sent to a paramour.",
    "Mr. McCarthy did say that Ms. Greenes appearance last week at the far-right conference was appalling and wrong, promising to have a talk with her, but that does not compare to the criticism that rained down on Ms. Omar when she used an antisemitic trope to suggest that support for Israel was driven by money.",
    "And while Democrats routinely condemn their own for statements they consider out of the mainstream, Republicans rarely do, instead providing Ms. Greene, Ms. Boebert and others on the far right with platforms to broadcast their messages, such as the recent Conservative Political Action Conference in Florida.",
    "Senator Rick Scott of Florida, the chairman of the Senate Republicans campaign arm, earned a public rebuke this week from Senator Mitch McConnell of Kentucky, the Republican leader, for putting out a campaign manifesto that called for raising taxes on the poor and cutting Social Security.",
    "Democrats dont have a clue what moves voters and are desperately trying to distract from their record of higher prices, soaring crime and a crisis along our southern border, said Michael McAdams, the communications director for the National Republican Congressional Committee.",
    "For one, Ms. Boebert and Ms. Greene intentionally provoke responses to stay front and center, she said, while she and Representatives Alexandria Ocasio-Cortez of New York, Ayanna Pressley of Massachusetts and Rashida Tlaib of Michigan were more often sought out by critics.",
    "The attack might not work in conservative-leaning districts, he said, but it could against Republicans whose seats emerged from redistricting as more Democratic, such as Representative Nicole Malliotakiss in New York and Representative Mike Garcias in Southern California.",
    "But their antics, violations of decorum and association with white nationalists have elevated their profile far beyond their positions, and Democratic operatives are determined to make them the face of the Republican Party in the looming election season.",
    "Jon Soltz, the chairman and co-founder of VoteVets, a liberal veterans organization, said the group was testing messages with voters to tie incumbent House Republicans in districts that lean Democratic to far-right figures in the Republican Party.",
    "But it is the faces of Ms. Boebert of Colorado and Ms. Greene of Georgia that are splashing across social media, political videos and advertising, after they both stood and heckled President Biden during his State of the Union address on Tuesday.",
    "Republican leaders have an easier political task than Democrats as they seek to keep voters focused on what they are seeing in their daily lives, such as inflation, soaring energy prices and ongoing frustrations with the coronavirus pandemic.",
    "Representative Sean Patrick Maloney of New York, the chairman of the Democratic Congressional Campaign Committee, said the House Democrats campaign arm had not decided how central to make the two lawmakers in the coming campaign season.",
    "Another Democratic political operation, American Bridge, is tying Ms. Greene to Herschel Walker, the former University of Georgia football star recruited by Mr. Trump to challenge Senator Raphael Warnock, Democrat of Georgia, this fall.",
    "WASHINGTON  Representatives Marjorie Taylor Greene and Lauren Boebert are two backbench freshmen in the House minority, powerless in the official hierarchy and unlikely to gain much power even in a likely Republican majority next year.",
    "Speaker Nancy Pelosi, at her weekly news conference on Thursday, repeated perhaps the only criticism that a Republican leveled at Ms. Boebert and Ms. Greene after their heckling at the State of the Union.",
    "On Monday, Ms. Greene was publicly rebuked by the House Republican leader, Representative Kevin McCarthy of California, over her appearance at a far-right conference with ties to white supremacy.",
    "Not since President Donald J. Trump used racially charged language in 2019 to castigate the liberal women of color in the Squad have freshmen House members received quite so much attention.",
    "The two are not the only Republicans bringing unwanted attention to the party, and some of the division in the partys ranks is being amplified by internal disputes, not by Democrats.",
    "The antics of Representatives Marjorie Taylor Greene and Lauren Boebert, as well as recent stumbles by other Republicans, have drawn unflattering attention to their party.",
    "There are a lot of independents in suburban districts that might have leaned to Biden by five or six points, but Democrats now have to go get those voters back.",
    "Mr. McCarthy has also said Ms. Greene will be given back the committee assignments that Democrats stripped from her if Republicans control the House next year.",
    "But, he added, their actions are disgraceful, from attending white supremacy conferences to yelling at the president when hes talking about his fallen son.",
    "The next day, she and Ms. Boebert heckled Mr. Biden and tried unsuccessfully to strike up a chant of build the wall during his State of the Union address.",
    "With us, the opinion pieces by Democratic pundits are already prewritten, and theres a lot of scolding that happens within the caucus, Ms. Omar said.",
    "Theres some rather crazy rhetoric that comes out of their mouths, and behavior like you saw from them at the State of the Union, Mr. Soltz said.",
    "Voters know and dont like the sort of extreme positions that Marjorie Taylor Greene and Lauren Boebert embody, she said.",
    "Representative Ilhan Omar, Democrat of Minnesota and Mr. Trumps favorite Squad target, said there were big differences.",
    "In December, she told the former Trump adviser Stephen K. Bannon, We are not the fringe; we are the base of the party.",
    "Ms. Boeberts staff did not respond to requests for comment, and Ms. Greene declined to speak to The New York Times.",
    "If it means ignoring them, we will do it, because the point is to win the House, not to win an argument.",
    "Ms. Boebert shouted at the president just as he was referring to the death of his son Beau Biden.",
    "She added, Thats an opportunity for Democrats, and I think that we should seize on it.",
    "The committee is making investments where they do the most good, he said.",
    "If that means making them the face of the party, we will do it.",
    "I agree with what Senator Lindsey Graham said: Shut up.",
    "But she has remained defiant in the face of criticism.",
    "Thats not what happens with their party.",
    "Let me just say this, Ms. Pelosi said.",
    "Democratic allies are not so reticent."
  ]
}