{
  "id": 8095,
  "mediaId": 43,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "\"We Will Save Democracy\"",
  "image": "https://images.dailykos.com/images/704794/story_image/22443868_sOptimized.jpg?1565194464",
  "link": "https://www.dailykos.com/story/2022/3/2/2081988/--We-Will-Save-Democracy-Good-News-Roundup-March-2-SOTU-edition",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1765,
    2087,
    2128,
    525,
    2945
  ],
  "sentences": [
    "Extend foreclosure and eviction moratoriums\nBiden directed key agencies, including the Centers for Disease Control and Prevention; the Department of Veterans Affairs; the Department of Agriculture; the Department of Housing and Urban Development; and the Federal Housing Finance Agency to extend the current pause on federal evictions and foreclosures\nBiden extends eviction ban amid fears of 'horrific crisis'\nThe Biden administration unveiled a raft of measures to prevent people who lost income during the pandemic from losing their homes on Thursday, including by extending nationwide eviction and foreclosure bans until July 31.",
    "Putin's criminal Ukraine war has transformed Russia into North Korea overnighthttps://t.co/XyzUOSxyrg\n Business Ukraine mag (@Biz_Ukraine_Mag) March 1, 2022\nx\nBig US Companies that Suspended Business in #Russia over Ukraine war\n Apple\n Nike\n Walt Disney\n GM\n Warner media\n FedEx\n UPS\n Delta (ties with Aeroflot)\n Harley Davidson\n Joyce Karam (@Joyce_Karam) March 1, 2022\nIn Conclusion, Some more timely tweets\nx\nLike a curse in a Russian fairytale, everything Putin wanted and was on the cusp of getting, hes now getting the opposite and then some.",
    "https://t.co/x5BKLsnDMM\n Chris Kiraly (@ckiraly) March 1, 2022\nx\nchina deeply unhappy with the invasion of ukraine & want ceasefire\nthe russians have made their enemies much more hostile - and weakened a lot of their friendships\n @gzeromedia world #in60secondshttps://t.co/B4jX1LLttP pic.twitter.com/djxv7Nv2Yc\n ian bremmer (@ianbremmer) March 1, 2022\n' Republicans in Disarray '\nx\nAm told NRSC chair Rick Scott got an earful about his new agenda in last nights leadership meeting.",
    "Governor JB Pritzker (@GovPritzker) February 24, 2022\nThis just feels like the right picture to finish the social justice section:\nx\nThe late afternoon sun at certain times of year, ignites Yosemite falls into an array of colours\nPhotographer Greg Harlow captured this absolutely stunning footage of a beautiful waterfall rainbow in Yosemite National Parkpic.twitter.com/6K9WakDB4F\n Science girl (@gunsnrosesgirl3) March 1, 2022\n' CGs Picks '\nHello Everybody, its me, Curlygirl!",
    "For all of these reasons I have to hope that at this very moment there are some very senior Russian intelligence and military officials, close to Putin, who are meeting in some closet in the Kremlin and saying out loud what they all must be thinking: Either Putin has lost a step as a strategist during his isolation in the pandemic or he is in deep denial over how badly he has miscalculated the strength of Ukrainians, America, its allies and global civil society at large.",
    "https://t.co/1n4mAVW69c\n Sheldon Whitehouse (@SenWhitehouse) March 1, 2022\nUS will ban Russian aircraft from US airspace\nPOTUS announced this in the SOTU, too  USA joining most of the democratic west in closing airspace to Russian aircraft:\nx\n(WSJ) - The U.S. government is expected to ban Russian aircraft from American airspace, broadening aviation restrictions as the West expands sanctions over the war in Ukraine, according to people familiar with the matter.",
    "You should read it.https://t.co/4tf9Y0SwSa\n Ben Collins (@oneunderscore__) February 28, 2022\nWestern Petroleum companies getting out of Russia\nFirst BP (UK oil company), then Shell (Dutch oil company) and now Exxon (American oil company):\nx\nHere is the official announcement from @exxonmobil: https://t.co/OCTN26mZV7\n David Gura (@davidgura) March 2, 2022\nThe west will seize oligarchs ill-gotten gains\nPOTUS mentioned this in the State of the Union address.",
    "President Biden to increase federal food benefits among executive actions aimed at stabilizing U.S. economy\nBiden is asking the Department of Agriculture to allow states to increase Supplemental Nutrition Assistance Program (SNAP) benefits  commonly known as food stamps  and to increase by 15 percent benefits awarded through a school meals program for low-income students started during the pandemic, according to Biden administration officials.",
    "More than 1 million unionized workers who were poised to lose their pensions will now receive 100 percent of their promised retirement benefits for at least the next 30 years\nthe $86 billion is a taxpayer bailout for about 185 union pension plans that are so close to collapse that without the rescue, more than a million retired truck drivers, retail clerks, builders and others could be forced to forgo retirement income.",
    "x\nJust in: Herschel Walker pulls out of Marjorie Greene event after she spoke at pro-Putin rally #gapol #gasen https://t.co/Vvd61tcpe4\n Greg Bluestein (@bluestein) March 1, 2022\nx\nMcConnell had to slap down NRSC chair Rick Scotts plan to raise taxes; Cawthorn and the Nazi Caucus introduced a bill to not fund Ukraine until the border is secure; rising Oberfuhrer Wendy Rogers was censured, and many GOP skipping the #SOTU.",
    "You have to wonder if the tensions flaring publicly go beyond Scott disobeying McConnell w/this agenda https://t.co/Vf24Htnl8l\n Rachael Bade (@rachaelmbade) March 1, 2022\nArizona Senate censures Wendy Rogers\nx\nBREAKING Arizona Senate censures Sen. Wendy Rogers by vote of 24-3 pic.twitter.com/gOBQGtO8er\n Brahm Resnik (@brahmresnik) March 1, 2022\nIts bad when even H. Walker is avoiding you!",
    "Improved the Economy in other ways too\nIts a Biden Boomand No One Has Noticed Yet\nBased on the data, President Biden and the Democratic Congress are set to preside over the strongest two-year performance on growth, jobs, and income in decadesso long as the current cycle of inflation eases, and the Omicron variant does not trigger another round of shutdowns.",
    "Disinformation explainer and some ideas on countering it (from 2016, focused on Russia) The Russian \"Firehose of Falsehood\" Propaganda Model; Why It Might Work and Options to Counter It\nIts important not to have any illusions  but equally important not to lose hope: Yes, He Would: Fiona Hill on Putin and Nukes, Maura Reynolds, Politico, February 28, 2022.",
    "Biden Effort to Combat Hunger Marks a Profound Change\nWith more than one in 10 households reporting that they lack enough to eat, the Biden administration is accelerating a vast campaign of hunger relief that will temporarily increase assistance by tens of billions of dollars and set the stage for what officials envision as lasting expansions of aid.",
    "x\nNew - The Jan. 6 cmte is issuing six more subpoenas, including for Cleta Mitchell, who worked on Trumps efforts to overturn the 2020 election\n John Bresnahan (@bresreports) March 1, 2022\n  Social Justice  \nx\nA Memphis judge ordered a new trial for Pamela Moses, a Black woman who was sentenced to six years in prison for trying to register to vote.",
    "Adam Jentleson  (@AJentleson) March 6, 2021\nx\nPoorest 20% of Americans estimated to see ~20 percent boost in income from Biden relief plan, particularly due to stimulus payments & CTC, per new Tax Policy Center analysis\nRichest 1% to receive income boost of 0%, analysis sayshttps://t.co/2WmwjszTSo\n Jeff Stein (@JStein_WaPo) March 8, 2021\n4.",
    "More than 20 providers in Poland, Australia, Slovakia, the Czech Republic, Canada, Estonia, Lithuania, Latvia, Bulgaria, and Germany have started the turning off of the propagandistic TV channels on their satellites, cable networks and across other platforms and sources, 1+1 Media Group, a Ukrainian media conglomerate, said Monday.",
    "The right-wing rallys organizer, MMA fighter and Maryland gubernatorial hopeful Kyle Sefcik, opened the gatheringwhere press and police massively outnumbered protestersby reciting the Pledge of Allegiance before launching into a lengthy speech mixing shameless self-promotion with grievances aimed at the truckers who didnt show up.",
    "x\nThe Times cartoon after just 6 days of Putins Ukraine War pic.twitter.com/YrWZRQzcFS\n Business Ukraine mag (@Biz_Ukraine_Mag) March 1, 2022\nPutin revives the trademark brutalist Soviet incompetence\nRussia's 40-mile convoy has stalled on its way to Kyiv, a U.S. official says, Bill Chappell, NPR, March 1, 2022.",
    "President Joe Biden has pledged that his administration would battle money laundering and tax evasion by kleptocrats and criminals, starting in the U.S.\nRussias unprovoked invasion of Ukraine demanded a harsh and rapid response from world powers to try and cut off funding for Putins war effort.",
    "A review of the so-called Thrifty Food Plan, ordered by Biden two days after he took office, could trigger an automatic increase in benefits as soon as Oct. 1, a day after expiration of a temporary 15% boost in food stamp payments that Biden included in his $1.9 trillion Covid-relief package.",
    "https://t.co/aofk53cxlR\n Charles P. Pierce (@CharlesPPierce) March 1, 2022\nAnd just for the heck of it:\nx\nIf youve been stockpiling weapons and ammo and preaching on this hellsite that its in case an opportunity presented itself to defend freedom and democracy, Ive got good news for you.",
    "The maniac in Moscow is costing his country dearly:\nx\nAlmost half of the worlds container ships will no longer go to and from Russia https://t.co/Osp7Di2suZ\n Bloomberg (@business) March 1, 2022\nThe ruble is nearly worthless and now Russians will have no foreign currency credit either.",
    "The battlefield is grossly uneven and another terrible day is ahead, but for now, this morning ...\nx\nThe sun has risen for a seventh day and Kyiv stands free \n Mike Madrid (@madrid_mike) March 2, 2022\nx\nPresident Putin thought he could roll into Ukraine  and the world would roll over.",
    "WASHINGTON (AP)  Addressing a concerned nation and anxious world, President Joe Biden vowed in his first State of the Union address Tuesday night to check Russian aggression in Ukraine, tame soaring U.S. inflation and deal with the fading but still dangerous coronavirus.",
    "Biden Quietly Preparing for Food Stamp Increase Without Congress\nThe Biden administration is quietly laying the groundwork for a long-term increase in food aid for tens of millions of Americans, without going through the ordeal of a fight with congressional Republicans.",
    "Brian Deese, director of the White House National Economic Council, told reporters on a call Thursday night that the measures are meant as only partial solutions, as the administration kicks off negotiations with Congress on its $1.9 trillion relief economic proposal.",
    "I wouldnt underestimate how meaningful his courage is in sustaining morale and motivating Ukrainians, be they trained soldiers operating sophisticated weapons or even college students and grandmothers producing home-made Molotov cocktails to fend off their attackers.",
    "He gained massive fame starring in the comedy satire Servant of the People, a hit TV show which he created, produced and starred in, playing a deeply honest high school teacher who becomes president of Ukraine after his rant against government corruption goes viral.",
    "Approve 78%\nDisapprove 22%@YouGovAmerica/@CBSNewsPoll, Among #SOTU watchers,https://t.co/ByZN4Vaa6I\n Political Polls (@Politics_Polls) March 2, 2022\nx\nBiden is the right man, with the right experience, with the right temperament, meeting the right moment- full stop.",
    "Biden Ousts All 10 of Trumps Union Busters From Powerful Labor Panel\nOn Tuesday, Joe Biden demanded the resignations of all 10 of Donald Trumps appointees to the Federal Service Impasses Panel, a powerful labor relations board, in a major victory for federal unions.",
    "Biden executive order takes steps to require federal contractors pay $15 minimum wage\nBiden plans to sign an executive order that will expand protections for federal workers, including putting federal agencies on a path to require a $15 minimum wage for contractors.",
    "I am writing this as I await President Bidens State of the Union speech and it has crossed my mind that with the terrible events unfolding in Ukraine, the President is going to be opening his remarks with a discussion of that topic  which is the right thing to do!",
    "However, these global events will necessarily elbow aside a number of domestic accomplishments due to time constraints (I expect POTUS will instead focus on what has yet to be done, rather than use a lot of time to highlight what has already been achieved).",
    "The campaign has increased food stamps by more than $1 billion a month, provided needy children a dollar a day for snacks, expanded a produce allowance for pregnant women and children, and authorized the largest childrens summer feeding program in history.",
    "In the opening moments of his address, Biden noted the rejection of Russia and embrace of Ukraine by Americans of all stripes as evidence of the countrys underlying commonality,\nWe fought for freedom, expanded liberty, defeated totalitarianism and terror.",
    "x\nThe Biden admin is trying to prevent evictions from public housing:\nUnder a new HUD rule, tenants in HUD-subsidized public housing cannot be evicted for nonpayment without providing 30 days' notice and info about available emergency rental assistance.",
    "I realize that this last scenario is the most unlikely of them all, but it is the one that holds the most promise of achieving the dream that we dreamed when the Berlin Wall fell in 1989  a Europe whole and free, from the British Isles to Vladivostok.",
    "The subpoenas  authorized hours before Bidens first State of the Union address  targeted documents and testimony from Cleta Mitchell, Kurt Olsen, Katherine Freiss, Phillip Kline, Kenneth Chesebro and the pro-Trump One America News host Christina Bobb.",
    "Announcement: https://t.co/kjLX5OztcA pic.twitter.com/frCEkfaj2O\n John Scott-Railton (@jsrailton) March 1, 2022\nThey may wreak havoc, but they will not ultimately win\nRussia Is a Potemkin Superpower, Paul Krugman, New York Times, February 28, 2022.",
    "From January through October, all wage and salary income paid by private businesses increased 2.4 percent aft\nIf the current high levels of economic, job, and income growth continue, the 2022 midterms could look different than most are predicting.",
    "The subpoenas reflect the panels focus on Trumps schemes to stop Bidens certification from taking place, so that the former presidents associates could buy time to co-opt state legislatures to send Trump slates of electors to return him to office.",
    "@WSJ https://t.co/y3jpXTLiAl\n Carl Quintanilla (@carlquintanilla) March 2, 2022\nAnd...\nx\nBoth Airbus and Boeing have announced suspension of parts and services to the Russian fleet, effectively cutting off maintenance support to Russian airlines.",
    "Senator Chuck Schumer, emboldened by either the majority leaders gavel or fear that hes about to be primaried by somebody who New York voters find more appealing, has stood up to Mitch McConnell, stood up to bad faith negotiating by Republicans.",
    "Now Zelensky is a Ukrainian folk hero and even a world historical figure.https://t.co/GViugN0yz1\n Steven Beschloss (@StevenBeschloss) February 28, 2022\nI See Three Scenarios for How This War Ends, Tom Friedman, New York Times, March 1, 2022.",
    "The six individuals weve subpoenaed today all have knowledge related to those matters and will help the select committee better understand all the various strategies employed to potentially affect the outcome of the election, Thompson said.",
    "Execute order designed to protect workers\nIt is focused on protecting federal workers and contractors, in part by restoring collective bargaining power and worker protections by revoking measures that President Donald Trump had signed.",
    "#LateShowLIVE pic.twitter.com/axxKy2F1xq\n The Late Show (@colbertlateshow) March 2, 2022\n International News \nThe horrific situation in Ukraine grinds on and the Ukrainian people continue to defend against the brutal Russian invasion.",
    "The select committee is seeking information about attempts to disrupt or delay the certification of electoral votes and any efforts to corruptly change the outcome of the 2020 election, said Bennie Thompson, the chairman of the panel.",
    "I know the ones that I had planned coming theyre not even allowed in because they need a commercial license and have proof of a checkoff today because of the checkpoints, so they werent even able to stage and make it look cool here.",
    "Created a record number of jobs\nx\n6.4 million jobs created in one year: a new record\nUnemployment rate drop from 6.2% to 3.9%: a new record\nThis was the greatest jobs growth year in modern American history, and its not even close.",
    "Ive been especially struck by reports that the early days of the invasion were hampered by severe logistical problems that is, the invaders had a hard time providing their forces with the essentials of modern war, above all fuel.",
    "It is monumental that you have a president sending a message to workers across the country that if you take the courageous step to start to unionize you will have allies in the administration, the NLRB, and the Labor Department.",
    "We havent had this aggressive and positive of a statement from a president of the United States on behalf of workers in decades, said Faiz Shakir, Sen. Bernie Sanders 2020 campaign manager and the founder of More Perfect Union.",
    "Despite the initial hefty estimate that upwards of 3,000 attendees would show, only 12 rally-goers had actually assembled for the gathering just hours ahead of President Joe Biden's State of the Union address Tuesday evening.",
    "Zachary Petrizzo (@ZTPetrizzo) March 1, 2022\nLOL \nx\nMarco Rubio went before the gathering of the increasingly pitiful and spouted a lot of magic gibberish knowing, somewhere in his heart, that his audience would laugh at him.",
    "Historic increase in food stamp benefits starts in October\nFood stamp recipients will see their monthly payments go up in October thanks to a major update to the program, even though a special pandemic boost has now expired.",
    "Before Putin invaded Ukraine, I might have described the Russian Federation as a medium-size power punching above its weight in part by exploiting Western divisions and corruption, in part by maintaining a powerful military.",
    "We havent seen an expansion of food assistance of this magnitude since the founding of the modern food stamp program in 1977, said James P. Ziliak, an economist at the University of Kentucky who studies nutrition programs.",
    "Under pressure from the Ukrainian government and other foreign leaders, tech giants and cable providers are issuing a flurry of measures to curb the reach of Russian state media in Europe as Russia wages war on Ukraine.",
    "Jon Ostrower (@jonostrower) March 2, 2022\nBusinesses are withdrawing from Russia\nMaersk and others are suspending their shipping services to and from Russia (except for humanitarian shipments or food, medicines, etc).",
    "Bidens support for unions if almost unprecedented\nPresident Joe Biden made a historic statement in favor of workers right to organize and against employer intimidation of workers in a video released Sunday evening.",
    "The U.S. economy added 467,000 jobs in January even as the omicron variant spiked to record heights, showing that the resilient labor market had enough momentum to power through one of the pandemics biggest surges.",
    "Microsoft likewise took action against state-sponsored disinformation campaigns Monday as it blocked RT and Sputnik content from appearing on its platform in Europe and banned advertising from Russian state media.",
    "CNBC Absolutely Loses It Over Blockbuster Jobs Report Showing Half-a-Million New Jobs https://t.co/kJYDaTQ5gs via @mediaite pic.twitter.com/9kPctYqvvp\n Tommy moderna-vaX-Topher (@tommyxtopher) February 4, 2022\n2.",
    "So while I am waiting to hear President Bidens speech, I am going to start todays GNR with a review of a 10 of the things Joe and Dems got done for regular Americans in the first year of the Biden presidency:\n1.",
    "Before this, they couldnt have gone after Putin without risking provoking him, said Sony Kapoor, a banking and finance expert who runs a think tank, the Nordic Institute for Finance, Technology & Sustainability.",
    "Mama says that this week has been the week from H-E-double hockey sticks, especially for the people of Ukraine and its my job to bring some nice stories about animals to help us remember the good in this world.",
    "The trend predated the pandemic and is a result of fading unions, serial bankruptcies and the misplaced hope that investment income would foot most of the bill so that employers and workers wouldnt have to.",
    "Let me take a moment to note the history that VP Harris and Speaker Pelosi made last night: For the 1st time, 2 women are seated behind the president during a State of the Union , Heidi Glenn, NPR, March 1.",
    "The White House and other federal agencies sprang into action amid growing concerns that state and local governments were not prepared to protect renters if the federal eviction ban expired next Wednesday.",
    "Im gonna start knocking stuff off the counter pic.twitter.com/SmkQe6Fv4e\n jonathan slater (@slater_jona) February 23, 2022\nAnd now a story for alllllllll the beautiful cats and cat aficionados in Gnuville!",
    "Putin has given the U.S. and its allies the perfect chance to crack down on the lax practices and loopholes that facilitate corruption and allow dirty money to swill around Europe, the U.S. and elsewhere.",
    "He is also launching the Test and Treat program which will enable people to walk in to a pharmacy for a covid test and, if positive, receive the new and highly effective anti-viral pills immediately/free.",
    "He didnt know then what his successor would face less than three years lateror imagine that Zelenskys remarkable courage and resolve would make him a Ukrainian folk hero or even a world historical figure.",
    "If Putin goes ahead and levels Ukraines biggest cities and its capital, Kyiv, he and all of his cronies will never again see the London and New York apartments they bought with all their stolen riches.",
    "Kyle Griffin (@kylegriffin1) March 2, 2022\nOn COvid\nThe president announced in the SOTU speech that anyone who has already ordered tests can now go and order a second batch of tests at covidtests.gov.",
    "LOL go check out the reviews  panned across the board: Kim Reynolds began GOP's SOTU response with iPhone going off  and it just got worse from there: reports, Bob Brigham, Raw Story, March 1, 2022.\n'",
    "The Kyiv Independent (@KyivIndependent) March 2, 2022\nThe Hague\nx\nBREAKING: International Court of Justice (@CIJ_ICJ\n) to hold public hearings on #Russian invasion of #Ukraine, beginning next week.",
    "Jonathan Swan (@jonathanvswan) March 1, 2022\nx\nKeep in mind on the MCCONNELL-SCOTT saga: TRUMP is trying to recruit Scott to run against McConnell for leader, as we scooped last week in Playbook.",
    "Bidens order attempts in several ways to address the surge in hunger in America during the pandemic, with approximately 50 million people, including 17 million children, considered food insecure.",
    "Biden and the Democrats protected people from foreclosure and eviction\nSo many of my favorites fit into one theme: making life better from the 99% of Americans that Republicans dont care about.",
    "#SOTU2022\n Brandon Woodard (@Woodard4Kansas) March 2, 2022\nMy guv stood up for trans kids last week:\nx\nI call on all elected officials to condemn this policy and pledge to protect trans rights.",
    "In doing so, the company joined Google, YouTube (which is owned by Google), Twitter, and Facebook, all of which have either restricted or banned state-backed media outlets from selling ads.",
    "Vice President Kamala Harris and House Speaker Nancy Pelosi sat behind Biden during his joint address to Congress last year, but that speech was not an official State of the Union address.",
    "The change stems from a revision of the Thrifty Food Plan, which determines the benefit amounts of the Supplemental Nutrition Assistance Program, or SNAP, the formal name for food stamps.",
    "https://t.co/8dgqafdThV\n David Yankovich (@DavidYankovich) March 2, 2022\nHeres the most fun reaction in my book  Stephen Colbert:\nx\n\"A roller coaster ride of rip roaring reasonableness.\"",
    "That means there were some 700,000 more jobs added at the end of last year than previously estimated, with employers working aggressively to draw in workers across a range of industries.",
    "x\nThe ferocious war cry of the desert rain frog\nSound on pic.twitter.com/LYdtZDSc8m\n Science girl (@gunsnrosesgirl3) February 24, 2022\nThats all the picks I have for you for this week.",
    "Google on Tuesday blocked the YouTube channels of RT and Sputnik, two Kremlin-owned outlets that serve as mouthpieces for Vladimir Putins propagandistic agenda across the continent.",
    "https://t.co/MczYQJsK9j\n John Kaminar (@JohnKaminar) March 2, 2022\nOUTSIDE RUSSIA, PUTINS PROPAGANDA MACHINE IS SWIFTLY CRASHING DOWN, Charlotte Klein, Vanity Fair, March 1, 2022.",
    "The comedian turned politicianwho had earned a law degree from Kyiv National Economic University before pursuing a career in comedywon the presidency with 73 percent of the vote.",
    "All told, about 1,400 of the plans cover about 10.7 million active and retired workers, often in fields like construction or entertainment where the workers move from job to job.",
    "Lisa Davis, senior vice president of Share Our Strengths No Kid Hungry campaign, said the metrics are out of date with the economic realities most struggling households face.",
    "Biden is keeping peoples homes warm in the winter\nx\nToday, we also announced a state-by-state breakdown of funding for the Low Income Home Energy Assistance Program (LIHEAP).",
    "Poroshenko had warned his fellow citizens during the campaign that Zelensky was too inexperienced to deal with Vladimir Putin, insisting, An actor cannot fight the aggressor.",
    "Biden declared that he and all members of Congress, whatever their political differences, are joined with an unwavering resolve that freedom will always triumph over tyranny.",
    "In place of the Russian channels, some of the providers are airing United News, a 24-hour newscast that 1+1 is producing in collaboration with other Ukrainian media groups.",
    "That goes double for me, Max: Opinion: Thank goodness Biden, not Trump, is president during the worst European crisis since 1945, Max Boot, Washington Post, March 1, 2022.",
    "Bidens clean sweep, which was first reported by Government Executives Erich Wagner, marks a crucial step toward ending his predecessors campaign of federal union busting.",
    "The move came a day after Meta, the parent company of Facebook and Instagram, and TikTok both said they would block RT and Sputnik content on their platforms in the E.U.",
    "@lmauricecpr has the latest: https://t.co/ZByuxfARoF\n FWRD AXIS News (@FwrdAxis) March 1, 2022\nx\nPresident @JoeBiden just told young trans kids that he has their backs.",
    "Democrats to capitulate to Republican demands like they did while negotiating the 2009 health care bill when they eliminated the public option for no fucking reason.",
    "SOTU speech recaps\nBidens State of the Union applauds unity against Russia, seeks more unity at home, Annie Linskey and Tyler Pager, Washington Post, March 1, 2022.",
    "Strong growth usually means healthy income gains, and the disposable income of Americans grew 3 percent after inflation over the 10 months from January to October.",
    "The effort to rush more food assistance to more people is notable both for the scale of its ambition and the variety of its legislative and administrative actions.",
    "As night fell on Ukraine on Tuesday, Russia's large convoy was still about 18 miles north of Kyiv  representing little or no change from Monday, the official said.",
    "Brian MD  (@bone00afide) March 2, 2022\nJanuary 6 Committee Still Working\nYou know who else was closely involved with these people (especially Cleta Mitchell)?",
    "The president will ask the USDA to consider beginning the process of revising the Thrifty Food Plan to better reflect the modern cost of a healthy basic diet.",
    "Biden and the Democrats ushered in a great covid relief bill\nThe history books will tell the story of how Democrats saved our economy from COVID/Trump damage.",
    "Trumps appointeesa group of partisan anti-labor activistshad hobbled federal unions for years, sabotaging their ability to organize and bargain collectively.",
    "x\nWere launching the Test to Treat initiative, so people can get tested at a pharmacy and if theyre positive, receive antiviral pills on the spot at no cost.",
    "The future paths of inflation and the pandemic are large and important unknownsbut if they break right, everything else points to a Biden boom through 2022.",
    "It asks agencies to take a look at which federal employees are earning less than $15 per hour and come up with recommendations to get them above that wage.",
    "What may have been an opportunity for Democrats to blame Republicans for watering down COVID relief became an opportunity for Democrats to show strength.",
    "I made it clear when I was running, that my administrations policy would be to support unions organizing and the right to collectively bargain, he said.",
    "Instead, they will all be locked in a big prison called Russia  with the freedom to travel only to Syria, Crimea, Belarus, North Korea and China, maybe.",
    "Perhaps the most significant change in this executive order is a reassessment of the USDAs Thrifty Food Plan, the basis for determining SNAP benefits.",
    "You should all remember the National Labor Relations Act didnt just say that unions are allowed to exist, it said that we should encourage unions.",
    "It also eliminates Schedule F, a class of worker that Trump had established that stripped many federal civil service employees of job protections.",
    "It seemed remarkable that such an economically underweight state could support a world-class, highly sophisticated military  and maybe it couldnt.",
    "TV giants around the world are also under pressure to limit the reach of RT and other Kremlin-controlled media outlets, CNNs Oliver Darcy reports.",
    "U.K. media regulator Ofcom on Monday said it had opened 15 new investigations into the due impartiality of news programs on the RT news channel.",
    "I agree with President Biden  we can get this country and our world back on track toward peace, environmental sustainability and human dignity.",
    "The instrument is an obscure U.S. Department of Agriculture shopping list used to determine food stamp benefits, known as the market basket.",
    "x\nIn 2019 his rival for president said he was too inexperienced to deal with Vladimir Putin, insisting, An actor cannot fight the aggressor.",
    "Its hard to quantify the impact of Zelenskys decision thus far to stay in Kyiv and fight with his countrymen against the invading Russians.",
    "The speech unfolded against a brutal backdrop as fighting intensified in what has become the biggest European land war since World War II.",
    "May we never turn a blind eye to it ever again:\nPutin's War Shows West Must Clean Up Dirty Money, Paul J Davies, Bloomberg, March 1, 2022.",
    "Logistics problems are stalling a massive Russian convoy that's pushing its way toward Kyiv, according to a senior U.S. defense official.",
    "Its almost unprecedented in American history, Erik Loomis, a labor historian at the University of Rhode Island, told The Washington Post.",
    "President Biden (@POTUS) March 2, 2022\nZelensky for Man of the Year\nA Moment for Courage and Unity, Steven Beschloss, February 28, 2022.",
    "When @POTUS talks about promoting the dignity of work, he means it.https://t.co/btS8yGdm3f\n Susan Rice (@AmbRice46) January 28, 2022\n7.",
    "The official added that some elements within the military column are \"literally out of gas\" and having difficulty feeding their troops.",
    "In addition to the robust January, the Labor Department also more than doubled its tabulations of jobs gains for November and December.",
    "The bailout targets multiemployer pension plans, which bring groups of companies together with a union to provide guaranteed benefits.",
    "It was a notable show of unity after a long year of bitter acrimony between Bidens Democratic coalition and the Republican opposition.",
    "Everyone agrees that the invasion of Ukraine has changed the landscape, not only for Joe Biden and Americans but for the whole world.",
    "pic.twitter.com/E22ojrpPMF\n Lorenzo The Cat (@LorenzoTheCat) March 1, 2022\nAnd the last item I have for you today is very surprising!",
    "A sitting @POTUS just told American children that he will fight for them and stand up against the extremists attacking their rights.",
    "The WAPO panel who were live-tweeting the SOTU seemed to generally agree that it was a good speech (Jennifer Rubin giving it an A-).",
    "Over the first three quarters of this year, real GDP increased at a 7.8 percent annual ratethats adjusted for the current inflation.",
    "Its true that supply problems are common in war; still, logistics is one thing advanced nations are supposed to be really good at.",
    "# https://t.co/dIaMAp5sy7\n Paula Chertok (@PaulaChertok) February 28, 2022\nx\nThe unintended consequences of Putin's invasion:\n1.",
    "x\nNewsweek is reporting that Zoo Poznan in Poland is taking in animals that have been evacuated from a zoo near Kyiv, Ukraine.",
    "Wages and salaries comprise nearly all of most households incomes, and those earnings also are rising much faster than normal.",
    "We built the strongest, freest and most prosperous nation the world has ever known, Biden said toward the end of his address.",
    "x\nPresident Biden & Democratic leaders deserve tremendous credit for not letting the Collins gang water down the aid package.",
    "x\nHere's my full story with @jolingkent about the new Russian influence operation targeting Ukraine with AI-generated faces.",
    "Britain and France are medium-size powers; Russias gross domestic product is only a bit more than half as large as eithers.",
    "x\nVladimir Putin signs decree to prohibiting Russians from leaving the country with more than $10,000 in foreign currency.",
    "We have the sense that previous presidents in the mid-20th century were overtly pro-union, but that really wasnt the case.",
    "The Federal Reserve expects real growth of 5.9 percent for all of 2021, followed by another 3.8 percent increase in 2022.",
    "State of the Union \nIve just finished watching the SOTU speech and am hoping to get some reaction to include in this GNR.",
    "The convoy, which has been measured as stretching for 40 miles, is apparently being hampered by fuel and food shortages.",
    "Or at least a little bit  at least this bird seems to be kind of the same color as Rascal  well mostly the green parts.",
    "Luv, CG \n Lightning Roundup \n The State of the Biden Presidency Is Strong, Timothy Noah, New Republic, March 1, 2022.",
    "and the exceptional nature of the current situation as he announced the restrictions, which prevent users across E.U.",
    "In 2019, he faced off against the real-life president, Petro Poroshenko, who dismissed him as a bright candy wrapper.",
    "Bidens video came days after a group of progressive organizations called on him to support the Amazon workers effort.",
    "Nevertheless, Biden also talked about domestic priorities and concerns and he finished with a strong unity message.",
    "For the first time, two women were seated on the platform behind the president during a State of the Union address.",
    "The embattled Kremlin-owned outlet has seen multiple public resignations amid Russias full-scale attack on Ukraine.",
    "U.S. added 467,000 jobs in January despite omicron variant surge, Eli Rosenberg, Washington Post, February 4, 2022.",
    "Thanks to the American Rescue Plan, this is the largest amount ever for LIHEAP  more than double a typical year.",
    "Biden ordered all federal contractors to pay their workers a $15 minimum wage and provide emergency paid leave.",
    "Eat nutritious food, get some rest and if at all possible, get outside for a few minutes a few times every day.",
    "More than six million renter households are behind on rent, according to a recent survey by the Census Bureau.",
    "The above items and links came from Goodys amazing One Hundred Things Biden and the Democrats Did in One Year!",
    "State of the Union: Biden vows to halt Russia, hit inflation, Zeke Miller and Colleen Long, AP, March 1, 2022.",
    "And the economy added 510,000 jobs in December, the Labor Department said, not the 199,000 initially forecast.",
    "Our test of resolve and conscience, of history itself, he said, adding I know this nation will meet the test.",
    "That could give a family of three children more than $100 in extra benefits every two months, officials said.",
    "Labor historians and worker advocates hailed the video as a major step beyond those Bidens predecessors took.",
    "The news comes as Russia continues to concentrate attacks on the large Ukrainian cities of Kyiv and Kharkiv.",
    "Much-Hyped D.C. Trucker Rally Turns Out to Be a Complete Joke, Zachary Petrizzo, Daily Beast, March 1, 2022.",
    "Six of Donald Trumps lawyers subpoenaed by Capitol attack panel, Hugo Lowell, the Guardian, March 1, 2022.",
    "So let me be really clear: Its not up to me to decide whether anyone should join a union, Biden continued.",
    "That far outpaces the gains of only 0.5 percent for the comparable period in 2019 and 1.7 percent in 2018.",
    "Literally over the counter treatment, free, that has been shown to reduce risk of hospitalization by 90%.",
    "The Stage of Freedom flop came after right-wing media stars had spent days hyping and praising the rally.",
    "Bidens Fresh Pitch for Prosperity: Fund My Agenda, Dammit, Abigail Weinberg, Mother Jones, March 1, 2022.",
    "Fred Wellman (@FPWellman) March 1, 2022\n From the Point&Laugh Department \nYou can NOT make this stuff up!",
    "He asked lawmakers crowding the House chamber to stand and salute the Ukrainians as he began his speech.",
    "The move follows the sanctions the U.S. and allies have imposed on Russia over its invasion of Ukraine.",
    "Its hard to believe in times like the last several years, but I do believe there are better days ahead.",
    "From 2000 to 2019, real GDP grew at an average annual rate of 2.2 percent and never reached 3 percent.",
    "Benefits will jump 27% above pre-pandemic levels, on average -- the largest increase in its history.",
    "Local airlines have some capability to service their own, but they will quickly become paperweights.",
    "RoundUp WindDown '\nThats it from me and CG for another Wednesday  in a week that felt like a month.",
    "And 300,000 employees on federal contracts will start to see a raise to $15 an hour over this year.",
    "Investors have noticed: From January 20 to December 7, 2021, the S&P 500 Index jumped 21.7 percent.",
    "Nick Clegg, Metas head of global affairs, cited requests from a number of governments and the E.U.",
    "And while youre at it, pass the Disclose Act so Americans can know who is funding our elections.\"",
    "But his rejection of the US offer to evacuateThe fight is here, he reportedly told the Americans.",
    "Our country is taking everything that covid has had to throw at us, and weve come back stronger.",
    "Ukrainian resistance has been fierce; Russias military has been less effective than advertised.",
    "Now they can freeze, confiscate and repatriate assets from Putin and his inner circle directly.",
    "Breathe in some fresh air and look up at the sky and dream impossible dreams of a better world.",
    "War fatigue, denial and greed: Why did it take the West so long to wake up to Putin's outrages?",
    "Before the Rescue Plan, we were on track to have unemployment above 4% all the way until 2026.",
    "President Biden (@POTUS) January 7, 2022\nx\nTake a minute to consider how significant this is.",
    "The U.S. economy added 647,000 in November, not the 249,000 the agency had earlier estimated.",
    "More details here: https://t.co/3PnxRwxlqH\n The White House (@WhiteHouse) January 7, 2022\n10.",
    "Biden and Democrats saved the pensions of over 1 million unionized workers\nProtect the 99%?",
    "Theyve already achieved more great things  in Democratic led states and on a federal level.",
    "These are very stressful times, Gnusies, so be sure to take extra gentle care of yourself.",
    "an unknown California Republican congressional candidate yells after taking to the stage.",
    "The truth is that I was being generous in describing Russia as even a medium-size power.",
    "Second, Russia is even weaker than most people, myself included, seem to have realized.",
    "20 Perfect TV Shows for Short Attention Spans, Shirley Li, the Atlantic, March 1, 2022.",
    "Their kids will be thrown out of private boarding schools from Switzerland to Oxford.",
    "Democrats held strong on the COVID relief bill\nMany cynically expected (I expected!)",
    "x\nPresident Biden: \"Tonight, I call on the Senate to: Pass the Freedom to Vote Act.",
    "x\nThis Sunday, almost 70,000 federal workers will start earning a $15 minimum wage.",
    "It shows how Facebook and Twitter snuffed out a campaign that was all over the web.",
    "countries from accessing pages or content posted by the two state-backed outlets.",
    "As the work force ages, an alarming number of the plans are running out of money.",
    "Either they collaborate to oust Putin or they will all share his isolation cell.",
    "But let me be even more clear: its not up to an employer to decide that either.",
    "It was never a foregone conclusion & sticking to their guns took a lot of guts.",
    "x\nIn general, did you approve or disapprove of the Presidents speech tonight?",
    "Even FDR never really came out and told workers directly to support a union.",
    "The international dark economy sustains our enemies and degrades our values.",
    "Cometh the Hour, Cometh the Man, Eliot A Cohen, the Atlantic, March 1, 2022.",
    "He said we will seize oligarchs yachts and luxury apartments in the west.",
    "More tk but this has been a significant source of tension inside the GOP.",
    "Reduced unemployment\nx\nToday, the nations unemployment rate fell to 3.9%.",
    "America is back to work, President Biden said Friday at the White House.",
    "https://t.co/PUncNzliYn\n Kyle Griffin (@kylegriffin1) October 8, 2021\n8.",
    "Eight members resigned, and two were fired after refusing to step down.",
    "x\nBREAKING: Visa and Mastercard cut Russian banks from their networks.",
    "Ukraine is assembling an international legion for volunteer fighters.",
    "It is the time to strike at the regimes shadowy offshore funds too.",
    "To protect freedom and liberty, to expand fairness and opportunity.",
    "x\nWeve missed this as a national security imperative for too long.",
    "Moses will be returning home to her family while she awaits trial.",
    "I think much of the world will also be tuning in for his remarks.",
    "Thats the sharpest one year drop in unemployment in U.S. history.",
    "https://t.co/dyfPIralEG\n Ronald Klain (@WHCOS) January 7, 2022\n3.",
    "This is an area where A TON has been done and it is all amazing.",
    "- @StephenAtHome on President Biden's #StateOfTheUnion speech.",
    "I need ammunition, not a ride.is already the stuff of legend.",
    "I guess the Russian army is a little short on professionals!",
    "But Russia is looking less and less like an advanced nation.",
    "My first pick is about a bird who looks just like Rascal!",
    "The choice to join a union is up to the workersfull stop.",
    "Reduced the number of hungry Americans\nProtect the 99%?",
    "That seems like a real game changer and very good news.",
    "So much misery has been caused by greed and corruption.",
    "Amateurs study tactics, professionals study logistics.",
    "History was made at the U.S. Capitol on Tuesday night.",
    "By any recent standard, these are extraordinary gains.",
    "Instead, he met a wall of strength he never imagined.",
    "Richard Stengel (@stengel) February 28, 2022\nx\nLook!",
    "A worthless ruble\nAll the the things he fears most.",
    "There will be no more Davos and no more St. Moritz.",
    "Since then, however, two things have become clear.",
    "President Biden (@POTUS) March 2, 2022\nGreat news!",
    "Hard to overstate what a watershed that could be.",
    "Americas job machine is going stronger than ever.",
    "Jesse Lee (@JesseLee46) January 7, 2022\nBut wait!",
    "Heres some noteworthy reaction to Bidens speech!",
    "I like that because animals are definitely good!",
    "The are currently in transport near the border.",
    "A stronger more unified anti-Russian Ukraine\n4.",
    "Absolutely nothing: War, What Is It Good For?",
    "I am looking forward to hearing what he says.",
    "Paul Krugman, New York Times, March 1, 2022.",
    "Biden strengthened unions\nProtect the 99%?",
    "First, Putin has delusions of grandeur.",
    "The same for the larger Russian public.",
    "So far, it hasnt worked out as planned.",
    "x\n'I've Never Seen Anything Like This!'",
    "Pass the John Lewis Voting Rights Act.",
    "Natalia Antelava, CNN, March 1, 2022.",
    "x\nDoes anybody have a clue who I am?",
    "The Soviet Union is falling apart!",
    "A stronger more unified Europe\n3.",
    "A stronger more unified NATO\n2.",
    "Id say the GOP is in disarray!",
    "Four rally goers respond, No.",
    "Our moment of responsibility.",
    "He met the Ukrainian people.",
    "Time to get some rest, Mama!",
    "Sefcik yelled at one point.",
    "This kitty is like a lion!",
    "Happy Wednesday, Gnuville!",
    "Now, it's here -- already.",
    "Now lets play it forward.",
    "You are loved and needed!",
    "Need some mental breaks?",
    "HAHAHA I like this bird!",
    "We will save democracy.\"",
    "Im keeping that promise.",
    "They stood and cheered.",
    "And he has caused them.",
    "x\nThey ran out of gas?",
    "Where are the trucks?!",
    "Where are the trucks?!",
    "So sign up or shut up.",
    "Its a profound change.",
    "ANYWAY, here it is!",
    "Good Day, Gnuville.",
    "This was step one.",
    "x\nLook how happy.",
    "Its pretty good!",
    "Protect the 99%?",
    "Now is the hour.",
    "It means a lot.",
    "But they didnt.",
    "That is huge.",
    "Ginni Thomas.",
    "It IS a lion!",
    "Bye for now!",
    "Theres more!",
    "Full stop.",
    "Listen!",
    "Again!",
    "x\nx\nx",
    "Wait!",
    "2022.",
    "GNR.",
    "5.",
    "6.",
    "9."
  ]
}