{
  "id": 8098,
  "mediaId": 12,
  "date": "d2022-03-01T13:00",
  "headline": "The Jolt: Marjorie Taylor Greene to deliver America First response to Biden speech",
  "image": "https://www.ajc.com/resizer/bFbHe74WVwkoncyjg6valhC3MsA=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/3YDLYSAGETDUOULRGVIX6JVLLI.jpg",
  "link": "https://www.ajc.com/politics/politics-blog/the-jolt-biden-to-deliver-state-of-the-union-with-war-abroad-inflation-at-home/VJL4NAO5DNE65OQHY3VDTN2INM/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tia Mitchell",
  "authorUrl": "https://www.ajc.com/staff/tia-mitchell/",
  "termIds": [
    727,
    815,
    1223,
    2030,
    2087,
    2095,
    5824,
    6005,
    545,
    2672,
    2942
  ],
  "sentences": [
    "In briefings with reporters Monday that we were privy to, White House press secretary Jen Psaki said Biden will address inflation directly by pitching his Build Back Better bill to cut costs for health care, child care, and prescription drugs- and hell push for more American manufacturing as a way to control supply chains.",
    "For Tuesday, were keeping an eye on:\nThe state Senate, which takes up SB 456, a bill to require pregnant to women to see a doctor in person before obtaining mifepristone, the abortion pill;\nThe State Board of Regents, which could vote as early as today to tap former Gov.",
    "The board hammered Greene for asserting she did not know anything about Nick Fuentes, the notorious white supremacist who hosted the gathering she spoke to over the weekend and who introduced her with praise for his groups secret sauceyoung, white men.",
    "While Perdues complaint may be about George Soros, a major Rivian investor, locals weve heard from are more worried about their drinking water supply, which they worry will be compromised by a major industrial development.",
    "But State Sen. Russ Goodman, R-Cogdell, may have had the most pointed remarks of all, alluding to the white supremacists who chanted Putins name during the conference Rep. Marjorie Taylor Greene attended over the weekend.",
    "POSTED: Georgia Senate Republican leaders announced new fundraising committees Monday, including one that will partner with ex-U.S. Sen. Kelly Loeffler ahead of the 2022 elections, the AJCs James Salzer reports.",
    "A press release announcing the committee said it will immediately begin to build a seven-figure, statewide field operation to support conservative candidates with full-time staff and resources ahead of November.",
    "In Ukraine, Russian President Vladimir Putin is one week into his unprovoked war of aggression, which has upset the global world order and put his own nuclear forces on high alert for the first time in decades.",
    "Tuesday night marks President Joe Bidens first official State of the Union address, following last years joint address to Congress, and it comes at a time of peril for the United States, at home and overseas.",
    "U.S. Rep. Nikema Williams will stream a conversation on her Facebook page at 6 p.m. with her guests, Morehouse School of Medicine President, Dr. Valerie Montgomery Rice, and two small business owners.",
    "The resolution slammed Russian leader Vladimir Putin and called for greater sanctions against his nation until the cost of this unnecessary war becomes more than can be borne and Ukraine is abandoned.",
    "The former presidents eldest son was a fixture on the Georgia campaign trail in 2020 and hell reprise that role when he speaks to crowds in Buckhead, Cumming, Tifton and Thomas County on March 7.",
    "Georgias former U.S. Sam Nunn was a guest on GPBs Political Rewind with Bill Nigut Monday, along with our always-chief Jim Galloway, when the three spoke at length about the crisis in Ukraine.",
    "We wont be surprised if his dad schedules a trip to Georgia in the next few weeks to tout the five-candidate slate hes backing, a group that also includes Senate candidate Herschel Walker.",
    "Nunn is one of the foremost experts in the Ukraine-Russia region and nuclear nonproliferation, so when he called Vladimir Putins nuclear posture ominous we listened especially carefully.",
    "Brian Kemp told us Tuesday morning, Governor Kemp believes there is absolutely no place in our state or the Republican Party for white supremacy, anti-Semitism, or hate of any kind.",
    "And not remotely unbowed from her weekend of controversy, Rep. Marjorie Taylor Greenes office said she will deliver the America First response to the speech after Biden concludes.",
    "With democracy literally under assault in Ukraine, Biden will also make the case for the United States role as the global leader in standing up for democratic and global norms.",
    "Domestically, inflation, the two-year old COVID pandemic, and the looming midterm elections are pressing Biden to settle markets and put Americans back on a path to normalcy.",
    "Although Butlers last two years have been wracked by COVID-related crises in the department, Butler said his wifes ongoing battle with cancer is the reason hes stepping back.",
    "It is unfathomable to me that anybody that calls himself an American with whats going on in the world today could chant, Putin and Russia, Goodman said on the Senate floor.",
    "Number one is to stop the warstop the killings, impose a ceasefire and basically prevent escalation up the ladder to even possible nuclear use of bombs by Russia, he said.",
    "POSTED: Three gun-related measures passed the state Senate, including SB 319, the bill to eliminate the need for a permit to carry a concealed weapon in Georgia.",
    "One of the committees will partner with Loeffler, who has been raising money to help GOP efforts since shortly after losing her U.S. Senate seat in January 2021.",
    "Speaking of Rep. Marjorie Taylor Greene, top Republicans are criticizing her decision to speak at a convention over the weekend hosted by a white supremacist.",
    "The extra stress that being an elected official puts on ones family is not something that has a place in our current situation, he wrote in a memo to staff.",
    "House Speaker David Ralston got a standing ovation from lawmakers when called on the state to divest from any and all investments with Russian companies.",
    "Sonny Perdue as the next USG Chancellor;\nRutledge, Ga., where David Perdue will headline a rally to Stop Soros-funded Rivian and protect rural Georgia.",
    "Republican state House and Senate leaders made it clear Monday theyre not joining the pro-Putin camp that Donald Trump has created for the GOP.",
    "How to watch the State of the Union\nThe speech is set for 9 p.m. EST and will be broadcast by the major networks and cable news TV channels.",
    "From the Journal:\nJust when we thought Georgia Rep. Marjorie Taylor Greene couldnt get more embarrassing for the GOP, there she goes again.",
    "And Senate GOP Leader Mitch McConnell said in a statement, Theres no place in the Republican Party for white supremacists or anti-Semitism.",
    "His office did not immediately respond when asked why he voted against the measure, nor did he did not make any public statements about it.",
    "UNDER THE GOLD DOME, Tuesday, March 1:\n8:00 a.m.: Committee work begins;\n10:00 a.m.: The House gavels in;\n10:00 a.m.: The Senate convenes.",
    "For the first time since 2020, every member of Congress has been invited to attend and well keep an eye out for Georgians in the audience.",
    "Rep. Lucy McBath will host a Roswell family whose son lives with juvenile diabetes to illustrate the need for affordable health care.",
    "Ultimately, Congresswoman Greene is accountable to the voters of the 14th Congressional district at the ballot box every two years.",
    "The 11th District GOP adopted one of the first resolutions of its kind in Georgia last night, condemning the invasion of Ukraine.",
    "The Wall Street Journal editorial board is joining the MTG pile-on with its lead editorial, Marjorie Taylor Greene Plays Dumb.",
    "Send your best scoop, gossip and insider info to patricia.murphy@ajc.com, tia.mitchell@ajc.com and greg.bluestein@ajc.com.",
    "In Washington, Republican Leader Kevin McCarthy told reporters he plans to meet with Greene about her latest controversy.",
    "Since the chamber will be closed to guests because of coronavirus precautions, two lawmakers will host virtual guests.",
    "I dont know about yall but I dont want one penny of Georgians money going to subsidize Vladimir Putin, Ralston said.",
    "Geoff Duncan called Vladimir Putin, A selfish, brutal dictator and anybody who would tell you otherwise is lying.",
    "Paul told the Washington Post on Monday that he supports the revised version, which is now headed to the Senate.",
    "The U.S. House overwhelmingly passed a bill Monday to make lynching a federal hate crime, passing it 422-3.",
    "U.S. Sen. Rand Paul, a Kentucky Republican, blocked it from being passed by unanimous consent at the time.",
    "Donald Trump Jr. is headed to Georgia next week to stump for a pair of candidates endorsed by his father.",
    "Anybody who gives aid and comfort to the enemy like thatthey are not deserving to be called an American.",
    "Georgia Rep. Andrew Clyde, R-Athens, was one of the three Republicans who were a no on the bill.",
    "Hell promote David Perdues bid for governor and Burt Jones campaign for lieutenant governor.",
    "It wont be the speech Biden would have given two months ago, or even two weeks ago.",
    "Georgia Labor Commissioner Mark Butler said Monday he wont run for a fourth term.",
    "Nunn said two steps need to happen quickly to head off an even worse disaster.",
    "The second thing is to say to Mr. Putin, Take your nuclear weapons off alert.",
    "Sign Up to receive the Morning Jolt & AJC Politics newsletters in your inbox.",
    "It stretches from Atlanta up through Cobb, Cherokee and Bartow counties.",
    "The Atlanta Journal-Constitution will offer a livestream on ajc.com.",
    "As always, Jolt readers are some of our favorite tipsters.",
    "The House passed similar legislation two years ago.",
    "The 11th is U.S. Rep. Barry Loudermilks territory.",
    "SB 319 now heads to the House for consideration.",
    "Maya Prabhu, has the details on Mondays action.",
    "The entire interview is well worth your time.",
    "This was, I think, a reckless move.",
    "This is unacceptable, he said.",
    "A spokesman for Gov.",
    "About the Authors",
    "Our colleague.",
    "Lt. Gov."
  ]
}