{
  "id": 8100,
  "mediaId": 157,
  "date": "3/1/2022 12:00:00 AM",
  "headline": "Marjorie Taylor Greene suffers more blowback as GOP Senate hopeful pulls out of her event",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29452146&width=1200&coordinates=0%2C0%2C0%2C30&height=600",
  "link": "https://www.rawstory.com/marjorie-taylor-greene-2656819324/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sky Palma",
  "authorUrl": "https://www.rawstory.com/u/sky_palma",
  "termIds": [
    815
  ],
  "sentences": [
    "U.S. Senate candidate Herschel Walker pulled out of an upcoming event organized by Georgia GOP Rep. Marjorie Taylor -- who's come under fire for speaking at an event hosted by white nationalists who praised Russian President Vladimir Putin's invasion of Ukraine, The Atlanta Journal Constitution reports.",
    "Green has come under fire from GOP figures such as House Minority Leader Kevin McCarthy, Senate Minority Leader Mitch McConnell and other top Republicans who've condemned her decision to speak at the America First Political Action Conference, a group organized by white nationalist Nick Fuentes.",
    "\"Walkers decision is just the latest sign that Republicans in Georgia and across the nation are distancing themselves from Greene, who has a long history of hateful, xenophobic and anti-Semitic remarks, along with social media posts endorsing violence against political opponents,\" AJC reports.",
    "NOW WATCH: 'It would take years': Jen Psaki reacts to Fox News host who wants Keystone pipeline to solve Ukraine crisis\n'It would take years' Jen Psaki reacts to Fox host who wants Keystone pipeline solve Ukraine crisis",
    "Walker was slated to speak at Greenes Second Amendment and Freedom Rally in Rome on Saturday alongside U.S. Rep. Matt Gaetz, Stephen Bannon and other known figures of the Trumpian far-right.",
    "Other Republicans, such as former U.S. Sen. David Perdue, say they still plan to attend."
  ]
}