{
  "id": 8102,
  "mediaId": 223,
  "date": "2/28/2022 12:00:00 AM",
  "headline": "This Black History Month, Let's Honor the Past and Present Champions of Faith and Freedom",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/308/136b412e-e74b-4146-8006-8faa2541475d.jpg",
  "link": "https://townhall.com/columnists/timothyhead/2022/02/28/this-black-history-month-lets-honor-the-past-and-present-champions-of-faith-and-freedom-n2603899",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Head",
  "authorUrl": "https://townhall.com/columnists/timothyhead/",
  "termIds": [
    812,
    815,
    1791,
    5740,
    5778,
    5902,
    5955,
    428,
    5670,
    2846,
    2953
  ],
  "sentences": [
    "Black men and women have been instrumental in advancing the cause of liberty and justice in the U.S. And with these current candidates unwavering commitment to religious liberty, small government, and the protection of innocent life, we can celebrate the future, as well, trusting that our Party is in good hands.",
    "Condoleezza Rice served as the Secretary of State from 2005 to 2009, and in that time she developed Transformational Diplomacy, an approach to diplomatic relations that aimed to help nations around the world maintain their peace and freedom.",
    "Robinson has come to faithfully serve the people of North Carolina by defending the Second Amendment, fighting for the rights of the unborn and prioritizing quality education for North Carolinas children.",
    "View Cartoon\nIn the more recent past, former University of Oklahoma quarterback J. C. Watts became Oklahomas first Black Congressman in 1995 and served for eight years in the House of Representatives.",
    "Trending\nWinsome Sears, the new Republican Lieutenant Governor of Virginia, made history last November when she became the first Black woman to be elected to statewide office in the commonwealth.",
    "A champion for economic development, Senator Scott authored the Opportunity Zones initiative that ultimately created new jobs and better opportunities for countless families around the country.",
    "Not long before Winsome Sears became a household name, another Lieutenant Governor started making headlines: Mark Robinson, the first Black Lieutenant Governor to be elected in North Carolina.",
    "From 2017 to 2021, Dr. Ben Carson served under President Trump as the Secretary of Housing and Urban Development where he worked to provide American families with new economic opportunities.",
    "And keep an eye on James White, too, a Republican member of the Texas House of Representatives with solid conservative bona fides whos running for Commissioner of Agriculture in his state.",
    "There is also the current Kentucky Attorney General, Daniel Cameron, who has been a faithful opponent of abortion as well as of government overreach in response to COVID-19 spread.",
    "As a former Marine, member of the Virginia House of Delegates, and member of the Virginia Board of Education, Winsome Sears has a history of serving her country with excellence.",
    "That includes a long list of excellent Black conservative men and women whove proven indispensable to our Partys past and present, and who will be indispensable to its future.",
    "These victories havent been confined to just Congress, as previous Black cabinet members have also played a significant role in defending faith and freedom in our nation.",
    "Also from Georgia, Army veteran Jeremy Hunt is running for a seat in the U.S. House with a promise to continue the fight for conservative family values if hes elected.",
    "Throughout the past few weeks, many have reflected on the great progress made by and for Black Americans in our country as weve celebrated Black History Month.",
    "He helped create the Renewal Community Project, which helped to limit government interference with small businesses and promote school choice for parents.",
    "She campaigned on strengthening schools and cutting costs for families, and a month into her term, her constituents are beginning to reap the benefits.",
    "Thomas was the second Black Justice appointed to the U.S. Supreme Court in 1991, and he has a proven track record as a Constitutional originalist.",
    "Consider Herschel Walker, a pro-liberty former football star endorsed by former President Donald Trump for his Senate run in Georgia.",
    "And its impossible to overlook Clarence Thomas and the critical role he has played in preserving our God-given liberties.",
    "This was historically significant, of course, but Hiram went on to accomplish much more during his political career.",
    "The GOP has long been a home for anyone committed to preserving the ideals and values that make our nation great.",
    "In his first year in office, Watts was already proving his commitment to small government and family values.",
    "We have quite a few promising Black GOP members on the ticket for upcoming races nationwide, as well.",
    "North Carolinas southern neighbor is home to Tim Scott, the first Black Senator from South Carolina.",
    "Just take a look at the first Black Republican representative in the House or Senate, Hiram Revels.",
    "Many of them have fought tirelessly for faith and freedom, and this progress is worth celebrating.",
    "He rose to fame in 2018 by expressing his support for gun rights at a city council meeting.",
    "In a recent discussion about Black History Month, she shared, I made history, sure.",
    "But, you know, the history that we want to make is that which helps people.",
    "He advocated for desegregation and quality education for Black Americans.",
    "Governor Sears is on track to do just that for the people of Virginia.",
    "Timothy Head is executive director of the Faith & Freedom Coalition.",
    "Previously a Civil Rights chaplain, he became a Senator in 1870.",
    "But lets return to the present GOP.",
    "Since then, Lt. Gov.",
    "And rightfully so.",
    "Lt."
  ]
}