{
  "id": 8118,
  "mediaId": 12,
  "date": "2/23/2022 12:00:00 AM",
  "headline": "Raphael Warnock showcases populist streak in battle for second term",
  "image": "https://www.ajc.com/resizer/8JHVi5Z12XyvpdHoIjE7XXeQrJc=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/M3MO4MWMIREB7IPIZEGA3IDMX4.jpg",
  "link": "https://www.ajc.com/politics/warnock-in-tough-election-fight-tries-to-bolster-appeal-among-georgia-independents/KVDMMTXBHVDWRCGYTPC577CELI/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815
  ],
  "sentences": [
    "Puppies and Christmas lights\nTo be certain, Warnock will have to reenergize core Democratic voters as well by amplifying a record that includes a primary role in advocating for federal voting rights legislation, an embrace of child tax credits and a vow to back the first Black female nominee to the U.S. Supreme Court.",
    "Warnocks gas station stunt is a cheap distraction from his disastrous record of skyrocketing inflation, surging crime, empty store shelves and an ongoing crisis at our southern border, said Stephen Lawson of 34N22, a super PAC that backs Herschel Walker, the Republican Senate front-runner.",
    "Along with three other at-risk Senate Democratic incumbents, Warnock is pushing the Gas Prices Relief Act to appeal to nervous voters on edge about rising inflation, supply-chain issues and the economic uncertainty tied to the pandemic and conflict in Eastern Europe.",
    "The tenuous coalition of independent voters, former Republicans in the suburbs and Black Georgians who fueled Democratic victories in the last election cycle is under duress as high inflation, legislative gridlock and economic uncertainties take a toll.",
    "Facing a tough reelection battle, Democrats hope Warnock can separate himself from President Joe Bidens sagging poll numbers with crowd-pleasing proposals that echo the message earlier this month from his debut TV ad: I see you, I hear you, I am you.",
    "Cheap distraction\nWarnock is trying to rebuild the coalition that helped him defeat GOP incumbent Kelly Loeffler in January 2021 by engaging both liberals and middle-of-the-road voters as a potential matchup against Walker or another GOP rival looms.",
    "Hes getting close to an election and hes seeing that a Walker candidacy is a lot closer than he ever thought it would be, said Martha Zoller, a conservative pundit who brought up Warnocks warm-and-fuzzy ads from the last election.",
    "Walker spokeswoman Mallory Blount said the high prices were a problem of Warnocks own making, blaming him for votes against amendments to build the Keystone XL pipeline, which Biden nixed shortly after taking office.",
    "Warnock struck a populist tone at the stop at the BP in Sandy Springs, pitching his plan to suspend the 18.4 cents-per-gallon gas tax until 2023 as an effort to pass savings directly to Americans.",
    "But facing a possible November matchup against Walker, a former football standout with near-universal name recognition, keeping swing voters in his corner might be Warnocks most pressing problem.",
    "Its a pitch designed for voters such as Amy Clark, a Powder Springs financial services worker who leans conservative but is up in the air this campaign season  and skeptical of Walker.",
    "And at a recent town hall in Decatur, Warnock sought to empathize with voters over the rising prices of groceries while touting green energy projects in conservative Dalton.",
    "A closer look showed the Democrat held double-digit leads over both Republicans among moderates and independents, two blocs of Georgia voters that often overlap.",
    "Sen. Warnock is pretending to care about the high gas prices that he became directly responsible for when he voted to kill the Keystone pipeline, Blount said.",
    "Hes listening to people complaining about rising costs, said Jason Carter, a close Warnock ally who was the Democratic Partys 2014 nominee for governor.",
    "His mental health plan would establish federal grant programs to help schools hire mental health counselors and boost access to mental health services.",
    "Warnock likes to call himself the nations most vulnerable Senate Democrat, the prime target of Republicans racing to take back control of the chamber.",
    "With Congress in recess and November approaching, Warnock has supported a spate of noncontroversial measures designed to show an independent streak.",
    "And a third measure Warnock introduced this month targets special corporate interests by capping out-of-pocket costs of insulin for diabetics.",
    "A few hours later, the Democrat stood at a Sandy Springs gas station promising to blunt rising fuel prices with a temporary gas tax holiday.",
    "In a hypothetical November matchup, he was neck and neck against Walker and had a slight edge over Agriculture Commissioner Gary Black.",
    "This month alone, Warnock demanded that Biden launch a federal investigation into apparent price gouging by global shipping carriers.",
    "An Atlanta Journal-Constitution poll in January showed Bidens approval among independent voters had dropped double-digits since May.",
    "And Democrats are already facing a battle against history that holds the presidents party usually loses ground in midterm elections.",
    "He went hard left at the beginning, and now he wants his campaign to look like puppies and Christmas lights again, she said.",
    "Go Dawgs, but I dont know enough about what he stands for to be able to say if Ill vote for him, she said of the Republican.",
    "Its important to emphasize while they are seeing record prices, oil and gas companies are seeing record profits, he said.",
    "So its really important that we hold these oil and gas companies accountable, and thats something Im determined to do.",
    "At a stop Tuesday in Columbus, U.S. Sen. Raphael Warnock touted new legislation to boost mental health funding.",
    "The same poll showed Warnock in better standing, with a 44% approval rating  and just 35% who disapprove.",
    "His message on the campaign trail is aimed at the swing Georgia voters who can help him avoid that fate.",
    "Hes promoted a partnership with Republican Texas U.S. Sen. Ted Cruz over a proposed highway expansion.",
    "He sidestepped thornier issues, such as a question about whether he supported Buckhead cityhood.",
    "He wants to do good for people, and to me, this is what a senator is supposed to do.",
    "Asked about the criticism, Warnock responded: I havent heard their solutions.",
    "His constituency is the entire state, and thats who he is trying to serve.",
    "They are feeling the pinch, Warnock said during his Sandy Springs stop.",
    "His Republican political opponents say its little more than pandering.",
    "Those were some of the best political commercials Ive ever seen.",
    "Its an advantage that both parties know can be fleeting.",
    "They sent him to do a job and hes doing it, Carter said.",
    "And I know that a lot of folks are focused on politics.",
    "Quite frankly, this is part of me trying to do my job.",
    "My job is to represent the people who sent me.",
    "How do you know its an election year?",
    "And thats meant as a compliment.",
    "Im focused on the people.",
    "Its too little too late.",
    "Im offering solutions.",
    "Hes not an ideologue."
  ]
}