{
  "id": 8126,
  "mediaId": 19,
  "date": "d2022-02-19T00:00",
  "headline": "Exclusive  Georgia GOP U.S. Senate Candidate Herschel Walker: Balance of Power Hangs on This Race",
  "image": "https://media.breitbart.com/media/2022/02/Election-2022-Senate-Walker-UAB-Georgia-Football-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/19/exclusive-georgia-gop-senate-candidate-herschel-walker-balance-power-hangs-this-race/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    815
  ],
  "sentences": [
    "Georgia Republican Senate candidate Herschel Walker, the runaway frontrunner in the primary race, told Breitbart News Saturday that the balance of power of the U.S. Senate hangs on Georgias Senate race, and vowed to stand up against the woke culture promoted by liberals such as Sen. Raphael Warnock (D-GA), whom he hopes to unseat.",
    "That same tactic should be used on the border, he said, before adding that the upcoming election is not just important on the federal level but on the local level as well, as people need to focus on school board members and tackle the woke stuff going on in schools  something Warnock has failed to do.",
    "It seems like, as you just said, Senator Warnock and President Biden think that we dont need borders, he said, noting that officials are not even vetting these people, allowing them to come into this country and go wherever they want to go, do whatever they want to do.",
    "So we want to take that Senate back and get people back to work and kids back in school where people arent trying to indoctrinate kids and do different things like that, Walker said, speaking to issues Americans are facing every day, including rising prices.",
    "We need people to be proactive rather than reactive, and the way we can do that is by electing the right people to office, he said, slamming politicians who get elected and then focus on the next election rather than governing so theyre not doing their job.",
    "On Critical Race Theory (CRT) specifically, Walker said it is sad the left is trying to separate us and get us worried about all this wokeness, get us worried about all this racism, contending that they are using it to distract from the issues.",
    "Whoever could take over this Senate race here in Georgia between  and I know its going to be myself  against Sen. Warnock can get control of the Senate, Walker said, as recent surveys show him leading his primary candidates by double digits.",
    "Notably, he pointed out, Warnock voted in lockstep with everything that Senate Majority Leader Chuck Schumer (D-NY) and President Biden have wanted him to vote for, including trillions in new spending that has led to inflation.",
    "Americans need to get people in office who are willing to come up with bright ideas and not just be reactive, he added, noting one of his latest initiatives of assisting people who do not have IDs to obtain them.",
    "Walker also mentioned one of the major bad policies Biden embraced immediately after taking office: scrapping the pipeline, which destroyed American energy independence.",
    "You can see now why people want public safety, he said, emphasizing that Democrats know the defund the police idea was bad, because they are now trying to walk it back.",
    "We have to stop that, he said, noting the importance of talking to border control and explaining that he has learned a lot through listening sessions around the state.",
    "Walker, whom Trump endorsed, also spoke about the presidents support, noting that he earned the endorsement because he [Trump] knew I was the best man for the job.",
    "Now he has to deal with splitting between himself and his clients the extra costs caused by the rise in the price of gas and other products.",
    "Unlike politicians in office now, Walker said he will look out for what is best for Americans  not for whats best for other countries.",
    "Right now, Walker said, Americans see that the policies the left is putting forth are not working for the country or for Georgia.",
    "Herschel Walker is going to do his job, because Im going to stay on it like a bulldog, he said.",
    "LISTEN:\nWalker also blasted both Warnock and Biden for rejecting the need for border security.",
    "Crime is rampant in the streets, he said, because so many people believe they are oppressed.",
    "Walker knows this firsthand, as he is a business owner who has watched prices go up.",
    "However, surveys examining the matchup between himself and Warnock are much tighter.",
    "I love the state of Georgia, and Im ready to fight for Georgia, he added.",
    "My family is in Georgia, my companys in Georgia.",
    "All the while, he said, nothing is getting done.",
    "Were going to work together as a unit, he said.",
    "Ive been a Georgian my whole life.",
    "Well I can promise you right now.",
    "First of all, we need borders.",
    "Theres a lot on the line now.",
    "Ive worked all my life.",
    "I know how to work.",
    "We cant have that.",
    "Im a Georgian."
  ]
}