{
  "id": 8133,
  "mediaId": 12,
  "date": "d2022-02-17T16:00",
  "headline": "Plans announced for Georgia High School Football Hall of Fame",
  "image": "https://www.ajc.com/resizer/HygLcMafk8Vu7TFLogtGx6jfitQ=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/LB4Q7LWTRWLMOT3U3DSA3UXVTU.jpg",
  "link": "https://www.ajc.com/sports/high-school-sports-blog/plans-announced-for-georgia-high-school-football-hall-of-fame/VKFSWQKOFBAWJN47GXTIKF47FA/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Todd Holcomb",
  "authorUrl": "https://www.ajc.com/staff/todd-holcomb/",
  "termIds": [
    815,
    5737,
    5803,
    5836,
    406,
    5576,
    5599,
    5619,
    2555,
    2672,
    2728
  ],
  "sentences": [
    "Board members will include GHSA executive director Robin Hines, former high school coaches Lynn Hunnicutt, Ed Pilcher, Jimmy Dorsey, Raymond Tweet Williams and Earl Etheridge, current coaches Maurice Freeman, Tim McFarlin, Bryan Lamar and Eric Parker, county athletic directors Jasper Jewell and Ed Shaddix, GHSA media relations director Steve Figueroa, McEachern principal Regina Montgomery, Atlanta businessman Randy Beal and sports media members Bill Hartman, Buck Belue, Craig Sager Jr. and Matt Stewart.",
    "I have been lucky to follow sports in Atlanta and around the state for almost 40 years, and now I have an opportunity to help honor these great athletes and also tell the history and impact high school football has in Georgia, said Rosenberg, a former Atlanta Journal-Constitution sports writer who started Score Atlanta in 2004.",
    "There also are Georgia high school football legends such as Commerces Monte Williams, whose post-high school career wasnt especially outstanding but whose Georgia career rushing record has stood more than 20 years.",
    "Rosenberg said the tentative plan is to break the state into regions and the states history into eras, with board members assigned to them so that each region and era get fair representation in the Hall of Fame.",
    "The board will be co-chaired by Dave Hunter, the retired former Brookwood athletic director and coach, and Rusty Mansell, a recruiting analyst for 247Sports and a former Georgia high school football player.",
    "The Georgia High School Football Hall of Fame wont have a physical structure initially, but Rosenberg said he intends to find a public space to display Hall of Fame plaques in the meantime.",
    "There are nine former Georgia high school football players in the Pro Football Hall of Fame, the most recent being Sandy Creeks Calvin Johnson, inducted last year.",
    "The Hall of Fame will take nominations, but the selection process and eligibility requirements wont be ironed out until the initial board meetings.",
    "Rosenberg sat on two committees for the Baseball Hall of Fame in Cooperstown during his time covering the Braves for the AJC in the 1990s.",
    "Four Heisman Trophy winners, including Johnson Countys Herschel Walker and Westlakes Cam Newton, played high school football in Georgia.",
    "The key here will be making sure we do a good job with the entire state and dont focus on just the names we all know, Rosenberg said.",
    "Three of Rosenbergs board members  Hunter, Pilcher and Dorsey  are members of the Georgia Athletic Coaches Association Hall of Fame.",
    "The reason the Georgia Hall of Fame is for players only, Rosenberg said, is that coaches already have a Hall of Fame in Dalton.",
    "Score Atlanta, a sports marketing group, announced the creation of the Georgia High School Football Hall of Fame on Thursday.",
    "An example is one of the buckets we will pick from is the African-American schools before the GHSA was fully integrated.",
    "The key here will be making sure we do a good job with the entire state and don't focus on just the names we all know.\"",
    "High school football in Georgia is getting a Hall of Fame, with its first induction class slated for this fall.",
    "What I learned from the Baseball Hall of Fame is to make sure to uncover every stone and dont assume anything.",
    "The first class, honoring only players and not coaches, could have as many as 35 inductees, said I.J.",
    "Our board is very diverse and has a big job in front of them, but they all are excited about it.",
    "To be settled is how much to weigh a players high school career against his entire career.",
    "The induction ceremony, the plaques, the coats and the big names are all exciting.",
    "He founded and runs the athletics Hall of Fame at Lakeside High, his alma mater.",
    "Hes modeling his latest venture after the Indiana Basketball Hall of Fame.",
    "But whats great about Hall of Fames are the stories that come out of them.",
    "Their history before integration is really incredible but not well-known.",
    "Rosenberg, the Halls founder."
  ]
}