{
  "id": 8140,
  "mediaId": 147,
  "date": "2/14/2022 12:00:00 AM",
  "headline": "Tamara Keith and Amy Walter on the Supreme Court vacancy, the fight for control of the GOP",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/assets/images/placeholder.jpg",
  "link": "https://www.pbs.org/newshour/show/tamara-keith-and-amy-walter-on-the-supreme-court-vacancy-the-fight-for-control-of-the-gop",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1824,
    1970,
    2087,
    2347,
    2407,
    146,
    428,
    482,
    507,
    2672
  ],
  "sentences": [
    "Tamara Keith, National Public Radio:\nThe White House is being very public about being deliberative, about the president meeting with members of the Senate from both parties to talk about it, about considering a wide range of candidates, the White House putting out there that he was considering a wider range of candidates than much of our reporting indicated they actually were.",
    "Tamara Keith:\nIn terms of the rift in the Republican Party, I think the midterms could begin to settle it, only if the Trump picks, the people that he's endorsed  and he has endorsed people up and down the ballot, not quite down to dogcatcher, but just about, depending on the state.",
    "Judy Woodruff:\nHow do you see the  I guess the political viability of the candidates that the more moderate Republican  more moderate side of the Republican Party, Amy, is backing by Mitch McConnell and others vs. President  former President Trump's picks?",
    "But we also know that Republicans run a risk too of overreaching, that the impact of going after her, whoever this woman may be that gets appointed, could end up backfiring and really engaging and enraging Democratic partisans and turning off swing voters.",
    "Amy Walter:\nWell, I think it would be helpful for a president who campaigned on being a unifier and has seen in the last year or so opinions about that unification or his ability to unify really trending very far down from where he started.",
    "(PHONE RINGING)\nAmy Walter:\nAnd we're already seeing Mitch McConnell, Minority Leader McConnell, trying to encourage governors, moderate governors like Larry Hogan, or Chris Sununu in New Hampshire, or we saw Doug Ducey in Arizona, to run.",
    "Judy Woodruff:\nTam, I want to turn you to the other  one of the other big questions we have today is, what we're seeing is, in the Republican Party, what has been former President Trump's apparent firm, unquestioned hold on his party.",
    "NPRs Tamara Keith and Amy Walter of the Cook Political Report with Amy Walter join Judy Woodruff to discuss the latest political news, including the Supreme Court vacancy and an intra-party fight for control of the GOP.",
    "And what it  so far, someone like that Herschel Walker in Georgia got a Trump endorsement and has been raising money blockbuster, even though he wouldn't have necessarily been the most obvious choice as a candidate.",
    "And part of that is simply no White House wants to make a mistake on what is one of the bigger decisions that a president makes in terms of a nomination, the biggest nomination a president can make.",
    "And if the people he's endorsed don't perform well, that might give an opening to people like Mitch McConnell, the Senate minority leader, who could then say, maybe Trump isn't all-powerful.",
    "All of them or most of them have been either personally attacked by the president for not doing his bidding or for criticizing him or he has been less than enthusiastic about them.",
    "And the big question is, will the Trump picks, will the people that he has said he wants, will they ultimately get the Republican nomination in these  in these various races?",
    "It's not right on voters' minds, which a lot of Democrats would like it to be on voters minds, that the president followed through on a promise he made on the campaign trail.",
    "Now we're seeing a rift open between him, Senate Minority Leader Mitch McConnell in particular, on who should be the Republican nominee in some of these key races for 2022.",
    "Judy Woodruff:\nSo, Tam, how do you look at what  and based on your reporting  at what the White House is thinking about it as it makes this very consequential decision?",
    "Read the Full Transcript\nJudy Woodruff:\nA Supreme Court vacancy  we just heard about it  an intraparty fight for control of the GOP, and a potential crisis in Ukraine.",
    "Judy Woodruff:\nSome of this still to play out, Tam, but what we're watching right now is mixed results, we have to say, on the part of the leader, Leader McConnell.",
    "As we do every Monday, let's look at the political stakes of this busy week with Amy Walter of The Cook Political Report With Amy Walter and Tamara Keith of NPR.",
    "As the White House thinks about who the pick is going to be, aside from clearly what kind of justice they're going to be, what are the political considerations?",
    "The fact that this takes place as quickly as possible also means that, by the time we hit Election Day, this is probably really far back in the rearview mirror.",
    "His decision in the Georgia run-off elections in December of 2020 ended up costing Republicans two Senate seats and the majority in the Senate.",
    "Amy Walter:\nWill Trump's been winning for these last few years, either by intimidating candidates from running or from running for reelection.",
    "That takes three seats, three really important seats, they're not off the table, but their best candidates are on the sidelines.",
    "And so it truly is just a function of finding someone who will handle herself well in meetings with senators and in hearings.",
    "As we have seen already, there's one Democratic senator for who, for health reasons, is out for the next couple of weeks.",
    "Of course, the risk of going too quickly is that you maybe don't do as good of vetting as you could have or should have.",
    "The president would really like to have something to be able to say as quickly as possible that they get it done.",
    "And most of the people that are being seriously considered have already been confirmed to lower court judgeships.",
    "But I think then the next thing, as I said about the impact, what impact is this going to have on the election?",
    "Amy, this is one of three  we believe she is one of the three finalists President Biden's talking to this week.",
    "But, right now, Trump's power is in the belief of everyone in the Republican Party that he's really powerful.",
    "Amy, how much does it matter to the White House whether Republican votes are part of this, the final vote?",
    "Democrats can't afford any other things like that happening, having any vacancies among their own party.",
    "And it could help engage  as I said, engage the Democrats in terms of election year enthusiasm.",
    "Getting in a big ugly fight over Supreme Court nominee doesn't necessarily help Republicans.",
    "And I do want to begin with Geoff Bennett's report just now on Judge Ketanji Brown Jackson.",
    "Obviously, there are a lot of Democrats who say, we need this to go as quickly as possible.",
    "But the numbers are such that it is unlikely that this is going to be a big fight.",
    "Is one side or another clearly  clearly going to have the advantage this year?",
    "Somebody like Jeff Flake, senator from Arizona, doesn't run for reelection.",
    "But in other races, the Trump picks haven't had great fund-raising.",
    "Rather than deciding to run, they all said, no, I will take a pass.",
    "And that power stays in place if his endorsements mean something.",
    "Republicans have signaled they aren't really in for a big fight.",
    "(LAUGHTER)\nTamara Keith:\nCan you hear my screaming children?",
    "And I do think it likely benefits Republicans as well.",
    "Amy Walter, The Cook Political Report:\nThat's right.",
    "So how quickly does this get through the process?",
    "And, Amy, we all sympathize with a ringing phone.",
    "Judy Woodruff:\nAnd just quickly to both of you.",
    "Nobody wants  no president wants it to blow up.",
    "Democrats pick up that Senate seat in 2018.",
    "So that's one reason for the speed.",
    "I think it's timing and impact.",
    "And will they win in November?",
    "And it's had a real impact.",
    "The other is to get a win.",
    "So, hello to both of you.",
    "And there are gaps there.",
    "We can't waste any time.",
    "(LAUGHTER)\n(CROSSTALK)"
  ]
}