{
  "id": 8146,
  "mediaId": 12,
  "date": "2/12/2022 12:00:00 AM",
  "headline": "In tough reelection fight, Warnock stresses help hes brought to struggling Georgians",
  "image": "https://www.ajc.com/resizer/JxfzUVWihRPJ-424kUfRXQvjqQQ=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/R7OYQLPUW75MBZYZ4YXWFAPGXE.jpg",
  "link": "https://www.ajc.com/politics/in-tough-reelection-fight-warnock-stresses-help-hes-brought-to-struggling-georgians/WYKNVTHKEZA4VJNREL6L6LWKAE/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tia Mitchell",
  "authorUrl": "https://www.ajc.com/staff/tia-mitchell/",
  "termIds": [
    815
  ],
  "sentences": [
    "Whether its pushing to lower gas prices, requesting money to alleviate supply-chain issues at the Port of Savannah or heralding the COVID-19 relief and infrastructure money coming to Georgia communities, U.S. Sen. Raphael Warnocks message these days focuses narrowly on a central theme.",
    "And while he has not forgotten about his liberal base, vowing to continue pushing to reduce student debt, work on criminal justice and pass federal voting legislation, Warnocks primary message most recently has been focused on his efforts to save Georgians money.",
    "I think the outsider message and having experience in the business world or anything outside of politics is actually more helpful when youre dealing with the type of landscape that the American people and Georgians are facing every single day.",
    "We supported small businesses, we provided (the Paycheck Protection Plan) for small businesses, we helped our municipalities to retrofit and to make it through the pandemic: $11 billion of support to small businesses in Georgia alone.",
    "I dont think when youre looking at a country with record-high inflation and poor job growth that saying that youve been in Washington trying to fix the problem but havent been successful with it is a winning message at all, Viar said.",
    "And they think they have a good shot at knocking off Warnock, with former University of Georgia football star Herschel Walker, who entered the race at former President Donald Trumps urging, as the likely Republican nominee.",
    "Hayes volunteered for his campaign last year and attended the open meeting to better learn what he has done in the year since, especially since she hosts a local talk show that often focuses on politics.",
    "Its a message he hopes will reach voters worried about rising prices, weary of the lingering effects of the coronavirus pandemic and disillusioned about governments ability to address their needs.",
    "His remarks and answers to a dozen questions from audience members selected at random often came back to the theme of working to help families and businesses as the coronavirus pandemic endures.",
    "The GOP strategy includes tying the incumbent to President Joe Biden, whose own approval rating has been sagging as the effects of the coronavirus pandemic, including higher prices, persist.",
    "He spoke about the coronavirus relief bill, the American Rescue Plan, that passed without Republicans support and made possible only after he and fellow Georgian Jon Ossoff were elected.",
    "I was one of his foot soldiers trying to get him in office so we can get some things changed, and we need things to change in this community and in this culture, period, she said.",
    "The party isnt choosing sides during the primary featuring a handful of GOP candidates, but Savannah Viar said any of them will be positioned as a better option than Warnock.",
    "Hayes did not go into the meeting thinking her senator would lose her support, but she said she left with a better understanding of what he has done with his first year.",
    "Nationally, Democrats are widely expected to lose seats in the House, and Republicans are bullish on their chances of also winning back control of the Senate.",
    "Democrats know they need strong turnout in November  particularly from young voters, infrequent voters and Black voters  for Warnock to succeed again.",
    "In this way, Warnock has something his challengers dont: a record of backing legislation in Washington that could bring aid to voters back home.",
    "Kerwin Swint, a political science professor at Kennesaw State University, said he sees signs Walker is trying to chip away at centrist voters.",
    "Sylvia Hayes gasped when her name was called at Warnocks recent town hall, making her the first person selected to ask him a question.",
    "Warnock carried his message to DeKalb County, a Democratic stronghold, for his first in-person town hall meeting earlier this month.",
    "Georgia is a swing state, and while Democrats here scored much success in 2020 and early 2021, their prospects for 2022 are unclear.",
    "When asked whether voters would select Warnock or Walker if the election were today, the two candidates were in a statistical tie.",
    "Once the room reached its capacity of 150, over a dozen others  nearly all of them Warnock supporters  had to be turned away.",
    "Outside the venue, young men representing a pro-Walker political committee held signs with the slogan Warnock isnt working.",
    "Voters who identified as independents in the poll were much more likely to support Warnock over either GOP candidate.",
    "Of the 872 respondents, only 34% said they approved of how Biden is doing his job, compared with 61% who disapproved.",
    "Warnock fared better in the same poll: 44% said they approved of his performance, compared with 35% who disapproved.",
    "Warnock raised $9.8 million in the final three months of 2021, ending the year with about $23 million in the bank.",
    "He doesnt have to worry about getting the Trump vote or the conservative vote; hes got that locked up, Swint said.",
    "I feel more knowledgeable of the things that hes doing, she said, and whats going on to make for a better Georgia.",
    "And so, hes trying to appeal to moderates as well, talking about representing everyone and focusing on education.",
    "What I want the people of Georgia to know is that I see you, I hear you, I am you, he says in the 60-second spot.",
    "In his campaigns first ad, titled For Georgia, Warnock looks straight into the camera and talks to voters.",
    "I think Warnock and Walker are both trying to appeal to the moderates as much as they can, which is smart.",
    "I understand the work I was sent to the Senate to do, and thats what I intend to keep doing for Georgia.",
    "But they also want to prevent Walker, from siphoning off any of the support Warnock amassed last year.",
    "An Atlanta Journal-Constitution poll released in January showed Biden underwater with Georgia voters.",
    "But today, he is considered the Senates most vulnerable member heading into the November midterms.",
    "Warnock fared better against another Republican in the race, Agriculture Commissioner Gary Black.",
    "We put shots in peoples arms; we put resources in peoples bank accounts, Warnock told the crowd.",
    "His election during the January 2021 runoffs helped flip the U.S. Senate to Democratic control.",
    "A spokeswoman for the Republican Party said that same record will help bring him down.",
    "Walker raised $5.4 million and has about $5 million in cash on hand to start 2022.",
    "Instead, the audience laughed at Warnocks jokes and clapped politely.",
    "The survey had 47% backing Walker, compared with 44% for Warnock.",
    "I see your struggles, and Im working to make things better.",
    "So Im just checking him out to see what he is all about.",
    "That fell within the polls 3.3-point margin of error.",
    "That gave Democrats a 50-vote majority in the Senate.",
    "He also has a huge fundraising advantage right now."
  ]
}