{
  "id": 8147,
  "mediaId": 112,
  "date": "2/12/2022 12:00:00 AM",
  "headline": "Texas police report provided to the AP under legal compulsion complicates the Herschel Walker redemption tale",
  "image": "https://images.mktw.net/im-484908?width=700&size=1.5005861664712778&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/texas-police-report-provided-to-the-ap-under-legal-compulsion-complicates-the-herschel-walker-redemption-tale-01644616870",
  "sentiment": "0",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.marketwatch.com/column/associated-press",
  "termIds": [
    815
  ],
  "sentences": [
    "Associated Press\nHeavily redacted records from 2001 incident at Walkers former home in a gated suburban Dallas subdivision adds another layer to an already turbulent personal history, which includes the former football stars acknowledged struggles with mental health, violent outbursts and accusations that he repeatedly threatened his ex-wife\nWASHINGTON (AP)  One warm fall evening in 2001, police in Irving, Texas, received an alarming call from Herschel Walkers therapist.",
    "Its really disturbing that a prominent individual like Walker would be seeing someone who just looks like the most dubious caregiver in terms of using methods that Ive never heard of and never seen any published literature on, Arthur Caplan, a professor of bioethics at New York Universitys Grossman School of Medicine, said while referring to Mungadzes practice of diagnosing patients based on their coloring of the brain outline.",
    "They didnt become friends until after Mungadze, who holds a doctorate in counselor education, diagnosed Walker with dissociative identity disorder following a separate 2001 episode in which Walker says he sped around suburban Dallas, hearing voices and fantasizing about executing a man who was late delivering a car he had purchased.",
    "Last week, Nikki Haley, the former South Carolina governor who served as U.S. ambassador to the United Nations during the Trump administration, tweeted that Walker would be a champion of conservative values and is living proof that hard work and determination pay off.",
    "Still, their relationship is part of the story as the former University of Georgia and NFL star turns to politics, with the enthusiastic backing of Trump, the former president who briefly owned the USFL team the New Jersey Generals, for which Walker played in 198385.",
    "What is clear, though, is that Walkers therapist, Jerry Mungadze, a licensed counselor in Texas with a history of embracing practices that experts in the field say are outside the mainstream, played a pivotal role in extracting the former player from the situation.",
    "From the archives (December 2021): Herschel Walkers son protests high gas prices, but critics say his $1,300 sweatshirt demonstrates hes full of hot air\nThe campaign declined to offer an updated health assessment or grant a request for an interview.",
    "The very same media who praised Herschel for his transparency nearly two decades ago are now running  stories, stereotyping, attacking, and going so far as to question his diagnosis, Mallory Blount, a Walker spokesperson, said in a statement.",
    "Mungadzes 1990 doctoral thesis at the University of North Texas argues that traditional healers in his native Zimbabwe are better positioned to treat those who claim to be possessed by ancestral spirits than providers of Western medicine.",
    "Much of what happened that day at the $1.9 million mansion remains shrouded from view because the report, which Irving police released to the AP only after ordered to do so by the Texas attorney generals office, was extensively redacted.",
    "In one method of analysis he has pioneered, which experts have singled out as unscientific, patients are asked to color in a drawing of the brain, with Mungadze drawing conclusions about their mental state from the colors they choose.",
    "Records filed with the federal Securities Exchange Commission show she was once part of a business venture with Walker, holding an ownership stake in a company he led called Renaissance Man Inc., which sold an aloe-based health drink.",
    "Not long after making the threat, Walker confronted Grossman in public, according to court filings, which indicate he slowly drove by in his vehicle, pointed his finger at [Grossman[ and traced [her] with his finger as he drove.",
    "And he was also featured in a 2014 British TV documentary as a practitioner of gay conversion therapy, a scientifically discredited practice that attempts to change the sexual orientation or gender identity of LGBTQ people.",
    "His professional and academic writings lean heavily into the occult, exorcism and possession by demons, which he called a theological and sociological reality in a 2000 article titled Is It Dissociation or Demonization?",
    "A former pastor, Mungadze has held a counselors license in Texas for over three decades and offers himself as an expert in treating dissociative identity disorder, which was once known as multiple personality disorder.",
    "The incident adds another layer to Walkers already turbulent personal history, which includes his acknowledged struggles with mental health, violent outbursts and accusations that he repeatedly threatened his ex-wife.",
    "After calling police to the gated subdivision where Walkers wife lived, Mungadze rushed to the scene and talked to Walker for at least 30 minutes to calm him down, according to the Sept. 23, 2001, report.",
    "Then they ordered the 1982 Heisman Trophy winner and onetime Dallas Cowboy to step out of the home, according to a police report obtained by the Associated Press through a public records request.",
    "Walker describes himself dealing with as many as a dozen personalities  or alters  that he had constructed as a defense against bullying he suffered as a stuttering, overweight child.",
    "The woman said she had a confrontation with him roughly a year earlier, which led to Walker making threatening phone calls and having her house watched, according to a police report.",
    "Walker stated unequivocally that he was going to shoot my sister Cindy and her boyfriend in the head, her sister later said in an affidavit, which the AP first reported last July.",
    "Comparing his condition to a broken leg, Walker wrote that Mungadze assured him it was possible to achieve emotional stability based on the approach and methods he had developed.",
    "In 2012, a woman named Myka Dean told Irving police that Walker lost it when she tried to end an on-off-on-off relationship with him, which she said had lasted for 20 years.",
    "When his book was released, she told ABC News that at one point during their marriage, her husband pointed a pistol at her head and said, Im going to blow your  brains out.",
    "Its very intensive treatment, said Bethany Brand, a clinical psychologist and professor at Towson University, who helped write guidelines for diagnosing the disorder.",
    "The football legend, today a Republican Senate candidate in Georgia, volatile, armed and scaring his estranged wife at the suburban Dallas home they no longer shared.",
    "The National Alliance on Mental Illness describes the disorder as alternating between multiple identities, leaving a person with gaps in memory of everyday events.",
    "About a year into his treatment, a former Dallas Cowboys cheerleader told Irving police in May 2002 that she believed Walker had been lurking outside her house.",
    "Now going by the name Cindy Grossman, she described violent outbursts in their divorce proceedings, telling of physically abusive and threatening behavior.",
    "A review of court records and police reports documents a far more turbulent path than portrayed in Walkers book, which was framed as a turnaround story.",
    "She returned to court in 2005 for a protective order after Walker repeatedly voiced a desire to kill her and her boyfriend, according to court records.",
    "The threats subsided, but, after Walker spotted her outside a Four Seasons resort in Irving, she told police that he followed her as she drove home.",
    "In a 2011 Playboy magazine profile of Walker, Mungadze said he had to call police to his office during one therapy session with Walker and his wife.",
    "In the end, police confiscated a 9mm Sig Sauer handgun from Walkers car and placed his address on a caution list because of his violent tendencies.",
    "We are very proud of the man Herschel Walker has become, Diane McKnight, Deans mother, said in a statement provided by Walkers campaign.",
    "Walkers campaign said that he emphatically denies these false claims and is on good terms with Deans parents, who support his campaign.",
    "The woman told police she was very frightened of Walker but asked them not to contact him because it would only make the problem worse.",
    "Walker, she told officers, threatened to wait outside her apartment and blow her head off, according to a January 2012 police report.",
    "Walker has at times been open about his struggle with mental illness, writing at length about it in his 2008 book, Breaking Free.",
    "They are often quite symptomatic and can relapse, even after a successful course of treatment, if they are under enough stress.",
    "He has been championed aggressively by former President Donald Trump, with other top Republicans eventually joining the fold.",
    "In 2013, he told the televangelist Benny Hinn that he can use the drawings to tell whether someone has been demonized.",
    "Though causing some initial misgivings, Walkers past has done little to deter Republican support for his candidacy.",
    "2, Sen. John Thune, both endorsed Walker in October after early concerns about his history of domestic violence.",
    "A judge granted the protective order and stripped Walker of his right to carry firearms for a period of time.",
    "I can tell them what spirit they have and what its doing in their life, he said on Hinns television show.",
    "But the officer decided to document the incident because of the extreme nature of the threat described.",
    "Officers took cover outside, noting later that Walker had talked about having a shoot-out with police.",
    "And it will test voters acceptance of Walkers assertion that he has long since been a changed person.",
    "Walkers campaign dismissed the newly surfaced information and blamed the media for highlighting it.",
    "Mungadze served as a court-approved mediator after Grossman filed for divorce in December 2001.",
    "According to the article, the incident ended with Walker hitting a door and breaking his fist.",
    "It notes that men with the disorder often exhibit more violent behavior rather than amnesia.",
    "Mungadze, too, declined to comment, but has indicated that he is no longer treating Walker.",
    "Grossman did not respond to a request for comment at a number currently listed for her.",
    "Mungadze, whom Walker has called one of my best friends, wrote the books foreword.",
    "Walker and Mungadze first met in the early 1980s when both ran college track.",
    "The book details years of struggle before an eventual diagnosis by Mungadze.",
    "Dean, who died in 2019, told police she didnt want to get Walker in trouble.",
    "There have been no reports of violence involving Walker in the past decade.",
    "Walkers ex-wife has said that she was a repeated target of his abuse.",
    "Psychologists and counselors generally do not have medical degrees.",
    "which was published in the Journal of Psychology and Christianity.",
    "Her mother and stepfather also served on the companys board.",
    "But they declined to seek charges or make an arrest.",
    "Walkers wife filed for divorce three months later.",
    "Senate Minority Leader Mitch McConnell and his No.",
    "I called 911, and the police came, Mungadze said.",
    "He threatened to kill her, myself and himself.",
    "This is the first any of us knew about this.",
    "She declined to comment for this story.",
    "By Mungadzes account it wasnt easy."
  ]
}