{
  "id": 8150,
  "mediaId": 43,
  "date": "2/12/2022 12:00:00 AM",
  "headline": "Words of Wisdom from the Late John Lewis: Saturday's Good News",
  "image": "https://images.dailykos.com/images/1020185/story_image/snow-drops.jpg?1640379390",
  "link": "https://www.dailykos.com/story/2022/2/12/2079815/-Words-of-Wisdom-from-the-Late-John-Lewis-Saturday-s-Good-News",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1147,
    2087,
    2095,
    2419,
    5821,
    2932,
    2945
  ],
  "sentences": [
    "x\nNEW: Dont look now but theres a sudden rush of bipartisan activity on Capitol Hill\n Violence Against Women Act\n Postal reform\n Forced arbitration limits\n US-China competition bill\n Approps deal\n Stock trade ban\n Preventing stolen elections https://t.co/3Byl9tZ3M3\n Sahil Kapur (@sahilkapur) February 11, 2022\nThis New Implant Reversed Paralysis Within a Single Day\nFor years now, researchers from the Swiss Federal Institute of Technology (EPFL) in Lausanne have been working on a groundbreaking approach to reverse paralysis in people with spinal cord injuries, by reactivating dormant neurons with electrical stimulation.",
    "Kyle Griffin (@kylegriffin1) February 11, 2022\nOther Good News\nAnd here is a bunch more good news that didn't fit neatly into a category:\nBlue suburban moms are mobilizing to counter conservatives in fights over masks, book bans and diversity education\nDozens of suburban moms from around the country dialed into an Ohio-based Zoom training session last month with the same goal  to learn how to combat the increasingly vitriolic rhetoric from parents whose protests over mask mandates and diversity education have turned school board meeting rooms into battlegrounds.",
    "@DemRedistrict @EliasLawGroup https://t.co/6jThzSfMp4\n Marc E. Elias (@marceelias) February 7, 2022\nx\nBREAKING: Florida Supreme Court DENIES Gov DeSantis request for redistricting advisory opinion.https://t.co/mSES14AWW1\n Marc E. Elias (@marceelias) February 10, 2022\nx\n\"Prominent Democratic attorney Marc Elias, who has pursued lawsuits in states including Georgia, North Carolina and Ohio, tweeted: 'Kansas will be sued.",
    "John S. McCain IV, son of the late senator from Arizona; retired Lt. Col. Amy McGrath, a former Marine fighter pilot who was the first woman to fly a combat mission for the branch and would later unsuccessfully challenge Mitch McConnell for his Senate seat in 2020; and retired Adm. Michelle Janine Howard, a trailblazing African American female officer who rose to become the highest-ranking woman in U.S. naval history.",
    "Biden greenlights $15 million infusion to Democratic campaign committees\nWith his party facing stiff political headwinds, President Joe Biden has authorized a transfer of $15 million from the Democratic National Committee to bolster his partys House and Senate campaign committees, part of what Democratic officials say is the largest cross-party mobilization ever for a midterm election.",
    "to investigate Trumps handling of White House records\nThe National Archives and Records Administration has asked the Justice Department to examine Donald Trumps handling of White House records, sparking discussions among federal law enforcement officials about whether they should investigate the former president for a possible crime, according to two people familiar with the matter.",
    "Biden highlights decision of Australian vehicle charging company to build plant in Tenn.\nPresident Biden on Tuesday highlighted the decision of an Australian electric vehicle charging company to build its first U.S. manufacturing facility in Tennessee as he held a White House event focused on his vision for electrifying transportation and supporting manufacturing jobs.",
    "Kyle Griffin (@kylegriffin1) February 9, 2022\nHow Democrats Already Won an Unexpected Election Battle\nWhen states started the all-important process of drawing the next decades congressional districts last year, Democratic officials were caught on the horns of a dilemma: Should they take the moral high road, or the road to a House majority?",
    "@NBCNews\n Kyle Griffin (@kylegriffin1) February 6, 2022\nBiden turns his focus to governors ahead of midterm elections\nPresident Joe Biden on Wednesday is turning his focus to making new commitments to elect more Democratic governors, a Biden adviser told CNN, following on his pledge to be deeply involved in this year's midterm elections.",
    "White House offers blueprint for union growth\nThe White House released a detailed blueprint Monday for how the federal government can work to increase union participation and strengthen workers right to organize in the absence of legislative actions, another sign of the Biden administrations historic support for organized labor.",
    "Kyle Griffin (@kylegriffin1) February 7, 2022\nAtlanta DA investigating Trump's election interference: 'We're not here playing a game'\nWillis has been investigating whether Trump or his allies committed any crimes in their campaign to convince Georgia officials to find fraud and hand Trump a victory in the Peach State in 2020.",
    "x\nNBC News: Jan. 6 Committee numbers\n Heard from more than 475 witnesses\n Received 60,000 pages of records\n In possession of 700+ pages from National Archives that Trump tried to keep hidden@NBCNews\n Kyle Griffin (@kylegriffin1) February 6, 2022\nPhone, email records for lawyer of Bannon, Giuliani sought by Justice Dept.",
    "The Justice Department has sought phone and email records of a defense attorney who represented Stephen K. Bannon, the former adviser to President Donald Trump, in his dealings with a House committee investigating the Jan. 6 Capitol riots and his subsequent indictment for contempt of Congress, his defense said.",
    "The Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act was first introduced by Sen. Kirsten Gillibrand (D-NY) in 2017\nThe House passed the legislation, sponsored by Rep. Cheri Bustos (D-IL), on a 335-97 vote earlier this week and the Senate on Thursday did the same on a voice vote.",
    "Whats remarkable is the extent to which President Putin has precipitated what he seeks to prevent: growing antipathy in Ukraine for Russia, increasing support in Ukraine for joining NATO, the alliances reinforcement of its eastern flank, and more defense spending from previously reluctant allies.",
    "Katie Paris, the founder of Red Wine and Blue  a national network of like-minded, mostly Democratic suburban women  believes the only way to fight back is to present a calm face to counter the angry groups that have dominated and disrupted board meetings and in some cases threatened officials.",
    "Blinken emphasized that everything that has been undertaken by the allies in terms of the engagement with the Russians, including the recent one-on-one call and subsequent meeting between French President Macron and Putin, has been done in a carefully coordinated way.",
    "Because of the long course of Parkinsons, many patients who receive a diagnosis today may live long enough to be eligible for this kind of treatment and find their lives spared from the harsh advanced stages of the diseaseand perhaps see their motor function restored.",
    "Her network of more than 300,000 women recently broadened its focus to fight the rising number of book bans across the country, launching a case tracker on Jan. 31, and is running training sessions to help women testify and manage highly charged government meetings.",
    "Louder please, Joe, for the folks in the back:\nx\nPunchbowl News: President Obama told House Democrats on a private conference call this afternoon:\n\"Democrats have a tendency to complain about what we didn't get done rather than talking about what we did get done.\"",
    "The 43-page report, produced by the White Houses Task Force on Worker Organizing and Empowerment, is a strikingly pro-union document, seeking to connect the history of union organizing in the United States to its importance for the countrys economic well-being.",
    "Here are just a few:\nLandmark #MeToo Bill Makes Its Way to President Biden\nA landmark #MeToo bill to end forced arbitration in cases involving sexual harassment or assault is now headed to President Joe Bidens desk, and he is expected to sign it into law.",
    "https://t.co/OcAIMeVpHL\n President Biden (@POTUS) February 8, 2022\nBiden Picks Replacements for Purged Naval Academy Board -- Including 2 Trailblazing Women\nPresident Joe Biden has nominated six new members, including some notable names, to the U.S.",
    "All three patients were able to stand, walk, pedal, swim and control their torso movements in just one day, after their implants were activated, Grgoire Courtine, a neuroscientist at EPFL and senior author of the new study, said in a press release.",
    "According to the National Health Insurance Survey, the percentage of nonelderly Americans without health insurance fell significantly between the fourth quarter of 2020 and the third quarter of 2021, bringing it almost back to its pre-Trump low.",
    "Secretary of State Antony Blinken on Russia, Ukraine, and NATOs Rebirth\nPutin may have counted on a divided NATO and weakened U.S. leadership, he has not only encountered the opposite during this crisis, he has, in Blinkens mind, miscalculated.",
    "This bill is one of the most significant workplace reforms in the last 50 years and is a major step forward toward changing a system that uses secrecy to protect perpetrators and silence survivors, Gillibrand said in a statement on Thursday.",
    "The treatment has now taken a massive leap forward, thanks to new findings published in Nature Medicine in which vertebrae implants restored the ability to walk and move around in three paralyzed patientsall in just a matter of hours.",
    "Kyle Griffin (@kylegriffin1) February 9, 2022\nNM Senate Passes Ban On Life Sentences For Juvenile Offenders\nThe New Mexico Senate has passed a bill banning life sentences without parole for juvenile first-degree murder offenders.",
    "The facility, to be built by Tritium, is expected to eventually produce as many as 30,000 electric vehicle chargers a year and create 500 local jobs, Biden said, appearing alongside the companys chief executive, Jane Hunter.",
    "The Biden-Harris Administration believes that increasing worker organizing and empowerment is critical to growing the middle class, building an economy that puts workers first, and strengthening our democracy, it begins.",
    "It increased outreach to potential enrollees, which Trumps officials had drastically scaled back, while the American Rescue Plan substantially expanded subsidies for Americans buying insurance on health care exchanges.",
    "x\nThe Cook Political Report now forecasts that House Democrats are on track for a narrow net gain of seats from redistricting nationwide, amid a cycle that has proven far more favorable to Democrats than many expected.",
    "Willis told CNN on Monday that she's not worried that the former President will try to delay her investigation, saying she plans \"to use the power of the law\" as grand jury proceedings in the case begin this spring.",
    "@CookPolitical\n Kyle Griffin (@kylegriffin1) February 5, 2022\nTop Georgia Democrats build financial edge over Republicans\nIn just two months, Democrat Stacey Abrams amassed $9.2 million, outdoing both Gov.",
    "Not all of these races will be competitive, but many Democrats are in difficult positions heading into campaign season because the President's approval rating has taken a significant hit in recent months.",
    "Kyle Griffin (@kylegriffin1) February 11, 2022\nBidens Hidden Health Care Triumph\nObamacare, which was enacted in 2010 but didnt go fully into effect until 2014, was and is a bit of a Rube Goldberg device.",
    "The probe was launched last year following Trump's call with Georgia Secretary of State Brad Raffensperger in which he pushed the Republican to \"find\" votes to overturn the election results.",
    "https://t.co/tDAlSBGuEB\n Marc E. Elias (@marceelias) February 11, 2022\nJustice is Coming\nI know people want justice to happen fast  like yesterday  but a fair system (done well) takes time.",
    "House Strikes Back At Louis DeJoy By Passing Bill To Strengthen USPS\nThe House passed legislation with a bipartisan vote that will strengthen and protect the Postal Service from insolvency.",
    "x\nPresident Biden has signed an executive order to clear a path for releasing about $3.5 billion of frozen Afghan assets held in the U.S. to be used for humanitarian aid in Afghanistan.",
    "U.S. officials with whom I spoke postulated that Zelenskys rationale for downplaying the crisis was a desire to avoid panic, not just among the population of Ukraine but in the markets.",
    "The President is also pledging to headline a fundraising event for the Democratic Governors Association and have his signature appear on quarterly email and text messages to supporters.",
    "'\"https://t.co/5QrUSVfmXW\n Marc E. Elias (@marceelias) February 9, 2022\nx\nIf you aren't following rightwing twitter and websites, you have no idea how insane this tweet has made them.",
    "A new Parkinsons treatment that uses stem cells to artificially create new dopamine-producing nerve cells is expected to enter clinical trials on human patients later this year.",
    "The administration released a federal strategy in December to build 500,000 charging stations for electric vehicles across the country and bring down the cost of electric cars.",
    "It will get rid of the requirement that the USPS has to prefund retirement benefits, and importantly, it blocks Postmaster General Louis DeJoy from gutting the Postal Service.",
    "x\nLoss for Republicans: Maryland's Republican governor, Larry Hogan, will not run for Senate in 2022  rebuffing overtures from Republicans who'd hoped to put the seat in play.",
    "And Democratic U.S. Sen. Raphael Warnock raised $9.8 million in the final three months of 2021, making him the nations top Senate fundraiser for the second quarter in a row.",
    "Avoid using the divisive language of their opponents, such as CRT for critical race theory, and instead replace it with alternatives like culturally responsive instruction.",
    "When we were getting arrested and waiting in jail or standing in unmovable lines on the courthouse steps, we didnt know what would happen, but we knew it had to happen.\"",
    "x\nI want every member of the LGBTQI+ community  especially the kids who will be impacted by this hateful bill  to know that you are loved and accepted just as you are.",
    "Biden will provide funding through the Democratic National Committee for communications staff for gubernatorial races in Connecticut, Maryland, Kansas and New Mexico.",
    "The enrollment season for 2022 coverage is just winding down now, and were seeing blockbuster numbers: More Americans are signing up for coverage than ever before.",
    "Recognizing these concerns is why, says Blinken, both the EU and the U.S. have been actively working to prepare economic as well as military aid packages for Kyiv.",
    "It fell far short of universally guaranteed coverage, but it nonetheless led to a large decline in the percentage of nonelderly Americans without health coverage.",
    "Here are some reasons to be confident of that:\nx\nRep. Jamie Raskin tells @MSNBC that he expects the Jan. 6 Committee to start holding hearings as early as April.",
    "x\nThe House Oversight Committee is launching an investigation into Trump's handling of White House documents and his adherence to the Presidential Records Act.",
    "With the redistricting process coming to a close nationwide, Democrats are expected to at least break even with Republicansmaybe even come out slightly ahead.",
    "Instead of simply paying Americans medical bills, it expanded Medicaid while using regulations and subsidies to encourage an expansion of private insurance.",
    "Never let anyone  any person or any force  dampen, dim or diminish your light  Release the need to hate, to harbor division, and the enticement of revenge.",
    "He has also announced as a target that half of the vehicles sold in the United States by 2030 be battery electric, fuel-cell electric or plug-in hybrid.",
    "But also I have the benefit of also having talked to a lot of witnesses and probably having read more on this than most people would like to,\" she said.",
    "x\n$1 million: That's how much Georgia Democratic state Rep. Bee Nguyens campaign says it's raised so far in her bid to be Georgia's secretary of state.",
    "But with 36 states electing governors this year, these state-level races could have enormous implications for Americans in their day-to-day lives.",
    "The League of Women Voters work year-round to combat voter suppression through advocacy, grassroots organizing, legal action and public education.",
    "It will give survivors their day in court, allow them to discuss their cases publicly and end the days of institutional protection for harassers.",
    "He did, however, preside over a gradual erosion of health coverage, probably reflecting a lower-profile strategy of sabotage on multiple fronts.",
    "He easily outdid Herschel Walker, his top Republican rival, whose $5.4 million haul was the most of any GOP Senate challenger in the nation.",
    "We have had, I believe, more meetings, calls, and video engagements with our allies on this than anything I can think of in recent memory.",
    "Enrollment in the A.C.A.s exchanges is limited to a few months a year, to deter people from waiting until they get sick to buy insurance.",
    "Dubbed the Second Chance bill, the legislation was passed on a 23-15 party line vote but not after an emotional at-times two hour debate.",
    "Freedom is the continuous action we all must take, and each generation must do its part to create an even more fair, more just society.\"",
    "x\nCINCINNATI (AP) -- US appeals court won't block Biden rules allowing abortion referrals by federally funded family planning clinics.",
    "This is a giant and important fight for us but, win or lose, we keep fighting and voting and organizing and spreading truth and light.",
    "really proved its worth, helping (with an assist from emergency federal programs) to sustain health coverage despite huge job losses.",
    "The legislation had strong bipartisan support in the House, and the companion bill in the Senate has a dozen Republican co-sponsors.",
    "They are taking buses around Florida to empower returning citizens, remove financial barriers to voting, and increase public safety.",
    "@PunchbowlNews\n Kyle Griffin (@kylegriffin1) February 10, 2022\nWe Can win in November if We Work Hard\nNovember is going to be tough.",
    "https://t.co/BAlMGhyijb pic.twitter.com/Pw8HbYlOCR\n emptywheel (@emptywheel) February 10, 2022\nNational Archives asks Justice Dept.",
    "In Illinois, Democrats eliminated two GOP seats, dissecting the state into a burst of ribbons extending from the Chicago area.",
    "They have on the ground work in 10 states and people from other states can write postcards, phone bank, fundraise, and text.",
    "Ours is the struggle of a lifetime, or maybe even many lifetimes, and each one of us in every generation must do our part.\"",
    "Much of the focus in midterm election years tends to be on the congressional races and which party will control Congress.",
    "Theyve made no secret of their decades-long effort to draw the most lopsided maps wherever they had the power to do so.",
    "Sign up at Democracy Docket to stay informed about the fight against voter suppression and the fight for voter rights.",
    "The lessons: Show up at meetings with fact-based speeches ready and create text groups for real-time strategizing.",
    "What you are seeing now, stated the Secretary of State, is the product of a very deliberate and sustained effort.",
    "\"Take a long, hard look down the road you will have to travel once you have made a commitment to work for change.",
    "Naval Academy's Board of Visitors, possibly closing the book on another leftover controversy from the Trump era.",
    "European diplomats confirmed this, calling the level and depth of internal NATO consultations, unprecedented.",
    "\"Former President Trump and his senior advisors must also be held accountable for any violations of the law.\"",
    "All these states have Democratic governors up for reelection except Maryland, which is led by Republican Gov.",
    "x\nI am disappointed that a 5-4 Supreme Court stayed an important court victory for Black voters in Alabama.",
    "Hold only love, only peace in your heart, knowing that the battle of good to overcome evil is already won.\"",
    "I have your back, and my Administration will continue to fight for the protections and safety you deserve.",
    "It is not some enchanted garden perched high on a distant plateau where we can finally sit down and rest.",
    "Three cheers to all of them for this beauty:\nBefore we say goodbye..\nWhat can you do to save democracy?",
    "\"Nothing can stop the power of a committed and determined people to make a difference in our society.\"",
    "Biden and the Democrats are Doing Great Things\nsooooo many great things done this week by our team.",
    "Here is some great news/reason for hope from him this week, as he fights for the right to vote!",
    "Despite this erosion, the core of the Affordable Care Act remained intact; in 2020 the AC.A.",
    "You can get involved with them at this link\nVolunteer with Black Votes Matter at this link.",
    "On the Lighter Side\nI thought this series of drawings was lovely so I wanted to share it.",
    "The New Mexico law would make all juvenile offenders eligible for parole after 15 years.",
    "This has included close coordination with President Zelensky and the leaders in Ukraine.",
    "She collected nearly $2 million more in that span than Kemp did over a six-month period.",
    "They are really amazing\nMake phone calls FROM YOUR OWN HOME to protect voter rights.",
    "\"When you see something that is not right, not fair, not just, you have to speak up.",
    "NATO has come together in a way it has seldom done since the end of the Cold War.",
    "At our next NATO summit, we hope to complete the update of our strategic concept.",
    "In New York, they wiped three Republican seats off the map with a stroke of Gov.",
    "Our current efforts, said Blinken, are producing immediate and lasting benefits.",
    "The ACLU plays a key role in filing lawsuits that often stop voter suppression.",
    "I tried to find the artist, but it appears to be a number of different artists.",
    "Half of the states in the U.S. ban lifetime sentences for juvenile offenders.",
    "Democrats are defending 16 governors' seats and Republicans are defending 20.",
    "Perdue has tallied only about $1 million since entering the race in December.",
    "An equal amount would go to relatives of the victims of the Sept. 11 attacks.",
    "Get in good trouble, necessary trouble, and help redeem the soul of America.",
    "That will lead to NATO having a clearer sense of purpose for years to come.",
    "Ours is not the struggle of one judicial appointment or presidential term.",
    "x\nDOJ used four different methods to figure out who was in the Capitol.",
    "here are some things giving me hope and the motivation to fight hard!",
    "Months later, its clear what path Democrats chose; the maps dont lie.",
    "Brian Kemp and his Republican rival, former U.S. Sen. David Perdue.",
    "In the movement, we didn't know how history would play itself out.",
    "Notable names in the new batch of six appointees include Lt. Cmdr.",
    "And the Biden administration has moved to strengthen the program.",
    "aahhhhh.. Just what I needed \nNow lets move on to the good news!",
    "Influence voters in key areas from the comfort of your own home!",
    "The fight to ensure there are legal maps in Alabama continues.",
    "Spread The Vote works to get voters IDs before voting begins.",
    "Will This Stem Cell Breakthrough Spell the End of Parkinsons?",
    "Mark Elias is Amazing\nJust had to give this hero a shoutout!",
    "Exclusively because of steps Putin has taken in the interim.",
    "\"Ours is not the struggle of one day, one week, or one year.",
    "Trump, as I said, tried but failed to undo this achievement.",
    "Throughout, the U.S. has played a central leadership role.",
    "Know that this transformation will not happen right away.",
    "Russia was, at that time, considered a strategic partner.",
    "Yet, as the Justices make clear, this case is not over.",
    "There are two important components to this legislation.",
    "There was no question about what Republicans would do.",
    "There are phone banks on Wednesdays and on Saturdays.",
    "You have to say something; you have to do something.\"",
    "That is, of course, if the treatment is successful.",
    "Donate to the AMAZING Florida Rights Restoration!",
    "Once in a while, you need some John Lewis wisdom.",
    "I am lucky and proud to be in this with you ''''",
    "Wave jazz hands if told not to clap at meetings.",
    "No longernot because of anything NATO has done.",
    "The months ahead look set to be better still.",
    "We are leaving no diplomatic stone unturned.",
    "\"You and I have listened to that phone call.",
    "We arent perfect, but they are fucking evil.",
    "You can volunteer with them at this link.",
    "Get involved with the Democratic party.",
    "And the results are greater solidarity.",
    "The last time it was updated was 2010.",
    "Get involved with Postcards to voters!",
    "\"Freedom is not a state; it is an act.",
    "We are producing a unified response.",
    "They are working on races right now!",
    "Get involved with them at this link.",
    "Most important: DON'T LOSE HOPE.",
    "But with hard work, we can win.",
    "It rarely happens all at once.",
    "Get involved with Swing Left.",
    "Change often takes time.",
    "Release all bitterness.",
    "Were About to Find Out.",
    "Run for something!",
    "Kathy Hochuls pen.",
    "You are the light.",
    "Will you join me?",
    "\"You are a light.",
    "We never give up.",
    "I need it today.",
    "it is coming.",
    "Larry Hogan.",
    "Why not you?",
    "Seriously?"
  ]
}