{
  "id": 8170,
  "mediaId": 19,
  "date": "d2022-02-10T00:00",
  "headline": "Report: Hollywood Elites Including Steven Spielberg, Mark Ruffalo Pouring Money into Senate Midterm Races",
  "image": "https://media.breitbart.com/media/2022/02/hollywood-celebs-senate-donations-640x480.jpg",
  "link": "https://www.breitbart.com/entertainment/2022/02/10/report-hollywood-elites-including-steven-spielberg-mark-ruffalo-pouring-money-into-senate-midterm-races/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Ng",
  "authorUrl": "https://www.breitbart.com/author/dng/",
  "termIds": [
    815,
    5693,
    5716,
    5784,
    5833,
    5864,
    5927,
    5952,
    5985,
    571,
    2700
  ],
  "sentences": [
    "Several celebrities, including Jennifer Garner, ABCs Scandal star Kerry Washington, and When Harry Met Sally filmmaker Rob Reiner, have donated $2,900 each  the maximum allowed for primary a primary  to Warnocks reelection bid, according to The Hill, which cited Federal Election Commission data analyzed by ITK.",
    "Rep. Val Demingss (D-FL) bid to unseat Sen. Marco Rubio (D-FL) has also piqued Hollywoods interest, with Disneys The Avengers star Mark Ruffalo among her donors, along with Cranston, Perlman, and Taylor, according to the report.",
    "Sen. Mark Kelly (D-AZ) is also attracting Hollywood money as he seeks to defend the seat that he too won in a special election in 2020, defeating incumbent Republican Martha McSally.",
    "Other Kelly donors include AMCs Better Call Saul star Bob Odenkirk, who forked over $2,900, and his former Breaking Bad co-star Bryan Cranston, who has given an undisclosed sum.",
    "The Hill reported Sen. Warnock is attracting major Hollywood donations as he seeks to defend the seat that he won a little more than a year ago in a special election.",
    "Among the field of Republican challengers is Herschel Walker, the former football star, who has earned the endorsement of former President Donald Trump.",
    "Left-wing Hollywood elites are reportedly pouring money into key Senate midterm races, including Sen. Raphael Warnocks (D-GA) bid for re-election.",
    "Among the famous names throwing cash at Senate Democrats are Steven Spielberg, Mark Ruffalo, Kerry Washington, Jennifer Garner, and Rob Reiner.",
    "Steven Spielberg and his wife, actress Kate Capshaw, have each given nearly $3,000 to Kelly, according to The Hill.",
    "Sen. Maggie Hassan (D-NH) has drawn donations from Jennifer Garner and Kate Capshaw as she seeks re-election.",
    "Acting spouses Danny DeVito and Rhea Perlman each donated $2,500 to Warnock in August.",
    "Other Warnock donors include Rosario Dawson, Holland Taylor, and Tony Goldwyn.",
    "Actress Michelle Williams has given $1,000, while Amanda Peet donated $2,900.",
    "Follow David Ng on Twitter @HeyItsDavidNg.",
    "Contact me at dng@breitbart.com",
    "Have a tip?"
  ]
}