{
  "id": 8173,
  "mediaId": 12,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "Self-proclaimed Black Donald Trump to test ex-presidents brand in rural Georgia",
  "image": "https://www.ajc.com/resizer/3SgDhps9UsuEnJ66jvSQ1gMSfzk=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/7UVB22EV4JAT35RVSYLG6H7T3M.JPG",
  "link": "https://www.ajc.com/politics/self-proclaimed-black-donald-trump-to-test-ex-presidents-brand-in-rural-georgia/NIYNI3MMW5HARD7X6AG2PJSCBE/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815,
    1147,
    2095,
    2279,
    2355,
    4325,
    146,
    571,
    2642,
    2672,
    5153
  ],
  "sentences": [
    "Even his longtime GOP critics seemed willing to overlook a long history of allegations of sexual assault that he has denied, along with accusations of harassing women uncovered in a recent Atlanta Journal-Constitution examination of his record.",
    "Collins campaign, which had prepared for weeks for Jones long-expected switch, released a digital ad detailing a long list of Jones-related controversies, noting his long liberal voting record and the accusations of harassment he has denied.",
    "Jones, the former chief executive of DeKalb County, the states most important Democratic stronghold, waged failed bids for the U.S. Senate, the U.S. House and DeKalb sheriff as a Democrat before winning a seat in the state Legislature.",
    "Trump is placing a bet that the endorsement he bestowed Wednesday is so powerful that a district of mostly rural white voters will elect to the U.S. House a former Democrat with a history of scandal while leading liberal DeKalb County.",
    "Ignored by his fellow Democrats in the Legislature, he began a political metamorphosis in early 2020 when he endorsed Trumps reelection bid and began rubbing shoulders with state GOP officials who once shunned him.",
    "Determined to remake the state GOP in his mold, Trump struck a deal with former Democrat Vernon Jones to drop out of an unwinnable race for governor and switch to the 10th Congressional District with his blessing.",
    "Brian Kemps anti-abortion legislation as a Democratic legislator and only formally switched to the GOP during a rally in Washington on Jan. 6, 2021, shortly before the deadly insurrection at the U.S. Capitol.",
    "Other contenders include Patrick Witt, an ex-Trump administration official; former U.S. Rep. Paul Broun; state Rep. Timothy Barr, who has Hices blessing; and David Curry, a onetime state revenue commissioner.",
    "He announced Monday that he was running for Congress without disclosing which district, then released a website claiming he was endorsed by Trump before the former president announced his support.",
    "Just look around  you still see Trump stickers and flags everywhere in Walton County, Clemons said of the districts GOP base, which the then-president carried with 74% of the vote in 2020.",
    "Trump taped a video endorsement that described Jones as a very special person and a true patriot that the candidate quickly promoted to hundreds of thousands of his social media followers.",
    "Almost a dozen Republican candidates are already in the race for the 10th District, which stretches from the outskirts of Henry County in metro Atlanta to the border of South Carolina.",
    "And many longtime local Republicans have already lined up behind a familiar face: Mike Collins, a pro-Trump local businessman who narrowly lost to U.S. Rep. Jody Hice in a 2014 runoff.",
    "Jones joined a growing slate of candidates endorsed by Trump, who has vowed to defeat Kemp and other Republicans who didnt heed his demands to illegally overturn his election defeat.",
    "When Jones announced his challenge to Kemp last year, he positioned himself as a far-right Republican who claimed that Trump would have still been president had he been governor.",
    "An AJC poll in January found that only 42% of Republicans, and about 20% of all registered Georgia voters, said theyd be more likely to support a candidate endorsed by Trump.",
    "Michael Flynn, Trumps former national security adviser who twice pleaded guilty to lying to investigators, withdrew his endorsement of Collins on Wednesday and backed Jones.",
    "The former president has also backed former football star Herschel Walker for the U.S. Senate, state Sen. Burt Jones for lieutenant governor and Perdue against Kemp.",
    "He struck a deal with the former presidents camp to quit the race for governor and endorse Perdue, giving the former U.S. senator a chance to unify Trump loyalists.",
    "David Clemons, the editor and publisher of The Walton Tribune, said the power of Trumps endorsement cant easily be dismissed in territory he dominated in 2020.",
    "At the Pot Luck diner in downtown Monroe, a favorite gathering spot of local leaders, the conversation was abuzz with speculation about how Jones would fare.",
    "MONROE  There may be no greater test of Donald Trumps clout in the midterm election than the congressional race he just upended in northeast Georgia.",
    "Few fought harder for election integrity in 2020 than Vernon, and hes a big supporter of a very good man running for governor, David Perdue.",
    "While both Kemp and Perdue ignored Jones in the gubernatorial race, the Republicans in the contest for Congress cant afford to overlook him.",
    "A recent local poll showed Collins, the son of former U.S. Rep. Mac Collins, with a commanding lead  and Jones with negligible support.",
    "Its the latter race  the contest for governor  that triggered the domino effect that led Jones to run for Congress with Trumps backing.",
    "Those people have values like mine, conservative values, faith-based, hardworking, entrepreneurial spirit, things of that nature.",
    "Still, Jones standing in polls, including a recent survey that showed him at 10%, gave him leverage to extract concessions.",
    "But his gubernatorial campaign got little traction, and Trumps endorsement of Perdue left Jones with no shot at victory.",
    "Jones is not well known in the district and will have to spend heavily ahead of the May 24 primary to raise his profile.",
    "Marjorie Taylor Greene ditched a suburban U.S. House race in 2020 to run for a vacant House seat in northwest Georgia.",
    "Hes an America First fighter who will never back down to either the establishment or the radical left, Trump said.",
    "He quickly landed a speaking slot at the Republican National Convention, and he crowd-surfed at Trump rallies.",
    "In exchange, senior Republicans say, Trump agreed to endorse Jones congressional bid and tape a video for him.",
    "Hice is leaving his seat in Congress to challenge Secretary of State Brad Raffensperger with Trumps support.",
    "On Fox News, he said he has a deep connection with voters in the district despite not living among them.",
    "And yet, even many Collins supporters privately admit that Jones will be a formidable challenger.",
    "But there are signs that Trumps influence, even among hardcore Republicans, is starting to fade.",
    "He wont be the first Georgia Republican who switched races to compete under a pro-Trump banner.",
    "Scandal-plagued Vernon Jones has been running for office as a Democrat since 1990, the ad said.",
    "And the only way Jones can possibly win, Clemons said, is because he has Trumps endorsement.",
    "Ill vote for Trump, but I wont vote for Vernon, said Lenny Vella, a retiree from Monroe.",
    "Soon, Jones was traveling across the nation as a Black surrogate for the then-president.",
    "A crowded contest\nClemons description of Trumps level of support was no understatement.",
    "Its uncertain whether Jones will change his residence to a 10th District location.",
    "On social media this week, Jones quickly branded himself the Black Donald Trump.",
    "Thats why I identify with the 10th Congressional District, Jones said.",
    "There are already signs the pro-Trump crowd is rallying around Jones.",
    "Jones is an excellent speaker, but hell say anything to get elected.",
    "An endorsement that strong will make people consider Vernon Jones.",
    "Clemons, the local newspaperman, said the race is up for grabs.",
    "She later won Trumps support and then moved into her district.",
    "said Flip Johns, a retiree from Monticello who backs Collins.",
    "Hes a lot of things: Conman, charlatan, chameleon, criminal.",
    "Hes putting his faith in Jones, who voted against Gov.",
    "The left has taken this country too far to the left.",
    "An awkward start also complicated Jones debut.",
    "Still, his opponents arent taking him lightly.",
    "I dont care what Trump says about this race.",
    "Its an uphill climb for Vernon Jones here.",
    "Jones faces a difficult political path.",
    "He was a Democrat up until last year.",
    "I knew Mikes daddy and I know him.",
    "A chameleon or a conservative?",
    "He found a receptive audience.",
    "His word goes a long way here.",
    "Vernon doesnt stand a chance.",
    "But hes no conservative.",
    "Hes a good, honest guy.",
    "How do we trust him?",
    "Hes from DeKalb."
  ]
}