{
  "id": 8174,
  "mediaId": 237,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "'The worst of Joe Biden will be over': McConnell pitches voters on GOP Senate",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/953387.png",
  "link": "https://www.washingtonexaminer.com/news/the-worst-of-joe-biden-will-be-over-mcconnell-pitches-voters-on-gop-senate",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "",
  "termIds": [
    815,
    1414,
    1765,
    2087,
    428,
    571,
    2550,
    2672,
    2799,
    2818
  ],
  "sentences": [
    "McConnell has lived through his share of midterm election waves, including the eight-seat Democratic gain and recapture of the Senate majority in 1986, the Republican revolution of 1994, the Democratic sweep of Congress in 2006, the historic Republican takeover of the House and recovery of seven Senate seats in 2010, winning the Senate majority with a nine-seat flip in 2014, and the Democrats reclaiming the House and flipping Senate seats in Arizona and Nevada in 2018.",
    "As long as the party nominates quality candidates in those states and avoids the likes of Todd Akin, Sharron Angle, Richard Mourdock, and Christine ODonnell (from the 2010 and 2012 cycles), the minority leader expects to run the table and is bullish on winning the majority.",
    "McConnell said the majority runs through eight states: Arizona, Georgia, Nevada, and New Hampshire (which feature vulnerable Democratic incumbents), as well as Missouri, North Carolina, Ohio, and Pennsylvania (four states where the incumbent Republican is retiring).",
    "It is possible McConnell, chastened by experience, wants to avoid a grassroots backlash that would accompany broken campaign promises, as the GOP experienced after winning control of the House in 2010 and the Senate in 2014 under President Barack Obama.",
    "Also missing, strikingly, from McConnells election-year pitch were grand promises that Republicans would deliver ambitious conservative reforms, such as past vows to repeal and replace the Affordable Care Act, also known as Obamacare.",
    "For every eventual Republican nominee, those McConnell is backing and those he might quietly worry about, he has one critical piece of unsolicited political advice: Focus on the future and talk about the issues voters care about.",
    "The Republicans control 50 Senate seats, putting them one seat shy of the majority amid a favorable political environment that McConnell is confident will not shift much, if at all, in the nine months leading up to Election Day.",
    "But the super PAC aligned with McConnell, the Senate Leadership Fund, is poised to fill that gap  and spend money that the massive war chest at its disposal against Greitens if polling suggests intervention is necessary.",
    "And the Senate minority leader seemed doubtful that much cooperation was in the offing, given their sharp differences on key issues and the presidents leftward lurch since taking up residence in the White House.",
    "Only in 2014, another GOP wave year, when a fed-up McConnell began intervening in primaries to weed out bad candidates, did Republicans finally recapture the Senate majority they had lost eight years earlier.",
    "That approach would require McConnell to at least attempt to work with Biden in the midst of a presidential cycle with his party campaigning to eject the Democratic chief executive from the White House.",
    "We havent had much to talk about the first year because he pretty much signed up with Bernie Sanderss view of what America ought to be, McConnell said, referring to the socialist Vermont independent.",
    "The first thing theyre going to get is, the worst of [President] Joe Biden will be over, Senate Minority Leader Mitch McConnell declared in an interview this week with the Washington Examiner.",
    "But McConnell, perhaps managing expectations for Republican gains in 2022, wasnt ready to predict that Bidens first midterm election might resemble a wave election from recent history.",
    "Indeed, although some independent voters and Republicans unhappy with Trump thought they were getting a centrist when they voted for Biden in 2020, McConnell had no such illusions.",
    "McConnell has faced no internal opposition or rebellion during the entirety of his tenure at the top, and that includes recently  despite Trumps aggressive campaign to depose him.",
    "But the kind of full-fledged progressivism that we saw on display in 2021, which thanks to [Democratic West Virginia Sen. Joe] Manchin stalled out at the end, is over.",
    "They were Senate colleagues for nearly a quarter-century and often negotiated an end to standoffs between Republicans and Obama when Biden was vice president.",
    "On Pennsylvania, where former hedge fund CEO David McCormick and celebrity physician Mehmet Oz are the top GOP contenders: We have an embarrassment of riches.",
    "So, what does McConnell imagine accomplishing in a government divided, with Biden in the White House and Republicans in charge on Capitol Hill?",
    "McConnell also likes what he sees at the outset in Georgia and Nevada, where he is backing Herschel Walker and Adam Laxalt, respectively.",
    "Im hard-pressed to think of how  of what the Democrats could do to dramatically turn the atmosphere in their direction, McConnell said.",
    "That certainly was the case last year when the GOP lost control of the Senate after losing twin runoff elections in Georgia on Jan. 5.",
    "Bidens job approval rating has sunk to just under 40%, and the GOP leads generic congressional ballot polling by 4 percentage points.",
    "Just In...\nWhat are voters going to get, beginning next year, if they elect a new Republican majority in the Senate this November?",
    "The National Republican Senatorial Committee is neutral in primaries, a directive of Florida Sen. Rick Scott, the chairman.",
    "Look for the things between the 40-yard lines that you can agree on and try to make some progress for the country, he said.",
    "(The initial signs are that Republican Senate candidates might decline to incorporate this advice into their strategy.)",
    "The minority leader is prepared to do the same thing this year, particularly in Missouri, where disgraced former Gov.",
    "Angle and ODonnell lost winnable Senate races in Nevada and Delaware, respectively, in 2010, a Republican wave year.",
    "Meanwhile, in just about every targeted state other than Missouri, McConnell sees virtually zero reason for concern.",
    "Some Republican insiders blame this habit of election-year overpromising for fueling Trumps rise in the GOP in 2016.",
    "But a successful partnership between the 40-yard lines also would require Biden to attempt to work with McConnell.",
    "But there was considerable doubt cast during the runoff about whether Biden was really going to be the president.",
    "So, the wind will almost certainly be at our back, but the individual states and candidates do make a difference.",
    "Avoid parroting the unsupported claims made by former President Donald Trump that the 2020 election was stolen.",
    "Greitens has pledged to vote against McConnell for Republican leader if he is elected to the Senate this fall.",
    "I may be over, already, for the rest of this Congress, but it certainly would be over in the next Congress.",
    "1 ranking Senate Republican: six as the majority leader, from 2015 to 2021, and nine heading the minority.",
    "And the big lesson in 2010 and 2012  is it makes a big difference who the nominee is in a statewide race.",
    "Look, he added, every Democratic president wants to be the next [President Franklin Delano Roosevelt.]",
    "Indeed, favorable might be inadequate to describe how good political conditions are for Republicans.",
    "Akin and Mourdock similarly tanked winnable races in Missouri and Indiana two years later.",
    "I dont think it means no progress is made with the country, the Kentucky Republican added.",
    "The ability to enact conservative legislation will be severely limited by Bidens veto pen.",
    "We wont be able to achieve our agenda because we have a Democratic president.",
    "We wanted the race to be about checks and balances against Joe Biden.",
    "It means look for things in the center you can agree on and do those.",
    "But I think we have a real good shot at winning in Arizona, period.",
    "If I were inclined to intervene, I certainly wouldnt announce it.",
    "Eric Greitens is a leading contender in the GOP primary.",
    "McConnell and Biden are quite familiar with each other.",
    "McConnell, 79, was elected to the Senate in 1984.",
    "It would be hard to defend in a general election.",
    "That was my attitude on the infrastructure bill.",
    "For the last 15 years, he has served as the No.",
    "So far, McConnell is keeping his powder dry.",
    "[Doug] Ducey would be a star candidate.",
    "Lets put it that way, McConnell said.",
    "Progressive movement will be stopped.",
    "Well, personally, hes the same guy.",
    "Lets put it this way, he said.",
    "On Arizona: Obviously, Gov.",
    "Its certainly possible.",
    "Every one of them.",
    "I like him."
  ]
}