{
  "id": 8184,
  "mediaId": 19,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "Exclusive  Watch: Herschel Walker Ad Recalls Georgia Football Legends Small-Town Roots",
  "image": "https://media.breitbart.com/media/2021/09/GettyImages-1235196725-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/08/exclusive-watch-herschel-walker-ad-recalls-georgia-football-legends-small-town-roots/",
  "sentiment": "0.815",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    815,
    5877,
    232,
    2672,
    6075
  ],
  "sentences": [
    "Walker is the frontrunning Republican candidate in the Georgia Senate race and enjoys the backing of former President Donald Trump, as well as the name recognition he acquired from his University of Georgia football days, when he achieved athletic stardom in part by winning the prestigious Heisman Trophy award and going on to play in the NFL.",
    "Georgia Republicans are solidly united behind Herschel Walker, and 34N22s focus is on sharing Herschels background as a political outsider, successful job creator, and consensus builder with independent and swing voters who will decide this election, Lawson said in a statement.",
    "Walkers closest opponent at this stage in the Republican primary race is Agriculture Commissioner Gary Black, but a recent Quinnipiac poll found Black in a very distant second-place to Walker, receiving six percent support compared to Walkers 81 percent.",
    "The ad, provided to Breitbart News in advance of its release, features testimonials from some of Walkers Johnson County High School classmates, as well as one of his high school football coaches, and will appear on YouTube, Facebook, and Instagram.",
    "The group is spending $50,000 on the purchase and is aiming for the ad to reach independent voters in Georgia who are needed to get Herschel across the finish line in his Senate race, 34N22 spokesman Stephen Lawson told Breitbart News.",
    "From skyrocketing inflation to rampant crime and a crisis at the border, its clear that Raphael Warnock isnt workingand its time to send Herschel Walker to Washington to deliver real results for the people of Georgia.",
    "A well-funded super PAC backing Republican Senate candidate Herschel Walker is releasing an online video ad titled Wrightsville on Tuesday highlighting Walkers early years as a high schooler in small-town Georgia.",
    "A hypothetical general election matchup between Walker and incumbent Sen. Raphael Warnock (D-GA) presents a much tighter race, according to that same poll, which found Walker and Warnock statistically tied.",
    "The ad runs for a minute and 15 seconds and shows one classmate recalling that Walker wasnt gonna say too much; he was just gonna go do it and another saying Walker worked hard in everything he did.",
    "Watch:\nHis former high school football coach Gary Phillips also appears in the ad, saying, Herschel was a special person because he was very humble.",
    "Others featured in the clip praise Walker as an inspiration and assert that not being a politician works in his favor.",
    "The super PAC behind the ad is called 34N22, a nod to Walkers college football jersey number.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "Follow her on Twitter at @asholiver.",
    "He was very unassuming."
  ]
}