{
  "id": 8195,
  "mediaId": 12,
  "date": "2/2/2022 12:00:00 AM",
  "headline": "Stacey Abrams raises $9.2M after entering gov race in December",
  "image": "https://www.ajc.com/resizer/zGYwxVgwmDL9ix6iSc8Ji408wOM=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/3D72VGOBLPBX4FGMOYHK75OAHE.jpg",
  "link": "https://www.ajc.com/politics/politics-blog/stacey-abrams-raised-92m-since-entering-gov-race-in-december/PZW5F4E6MJEORGJCSIKSOBP3EU/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    815,
    1147,
    1951,
    2095,
    4325,
    146,
    428,
    2672
  ],
  "sentences": [
    "The Democrat will report about $7.2 million in cash on hand at the end of the financial quarter after collecting contributions from more than 100,000 donors in just two months, a campaign aide said Wednesday.",
    "The race for governor is already on track to shatter the Georgia spending record established in 2018, when more than $100 million was spent on the contest that ended with Kemps win.",
    "Abrams disclosure is only the latest indication of the growing fundraising power of Georgia Democrats after flipping the state in 2020 and sweeping both U.S. Senate runoffs in 2021.",
    "Even so, Kemp enjoys other distinct fundraising advantages from the power of the governors office  and from a new law designed to give incumbents a significant financial boost.",
    "U.S. Sen. Raphael Warnock has amassed $23 million in his campaign account  more than four times higher than his closest Republican rival, former football star Herschel Walker.",
    "Stacey Abrams has raised more than $9.2 million since entering the race for governor in December, setting a blistering fundraising pace that eclipsed Republican Gov.",
    "The Republican, who joined the race against Kemp at former President Donald Trumps urging, has tried to downplay expectations by saying the status quo fears him.",
    "Abrams loss to Kemp in 2018 coincided with Abrams launch of the Fair Fight political organization, which has collected more than $100 million in three years.",
    "It ended 2021 with roughly $19.5 million in the bank and is expected to boost Abrams and other Democrats this election cycle, just as it did in 2020.",
    "It lets Kemp and a few other top lawmakers and party nominees create special committees that can raise unlimited contributions from donors.",
    "A federal judge is expected to soon rule on a legal challenge filed by Perdue asserting that the law creates an uneven playing field.",
    "The other top candidate for governor, former U.S. Sen. David Perdue, has yet to disclose his fundraising figures.",
    "Abrams fundraising builds off her national profile as a voting rights advocate and prominent party leader.",
    "Abrams outpaced Kemp, who raised $7.4 million over the final six months of the year.",
    "In that race, Abrams shelled out $27.4 million while Kemp spent $21.4 million.",
    "He ended the year with about $12.7 million in the bank.",
    "Both could far surpass those sums this year.",
    "Brian Kemp."
  ]
}