{
  "id": 8201,
  "mediaId": 323,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Trump Reports $122 Million Political War Chest as He Weighs 2024 Bid",
  "image": "https://images.wsj.net/im-477644?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/trump-reports-122-million-political-war-chest-as-he-weighs-2024-bid-11643722613",
  "sentiment": "0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chad Day",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "WASHINGTONFormer President Donald Trump has more than $122 million in cash spread across his post-presidency political operation and has made donations to dozens of Republican candidates for their midterm campaigns as he weighs another White House run, new Federal Election Commission filings show.",
    "The Republican National Committee has been paying some of Mr. Trumps legal fees as he and his business face state and local investigations in New York and Georgia, where a grand jury was recently approved to investigate his efforts to overturn the election results.",
    "On the Republican donation platform WinRed, Mr. Trumps political operation raised $18.3 million more than the second-largest online fundraiser, the National Republican Senatorial Committee, over the six-month period.",
    "Save America PAC made a $1 million contribution last July to the Conservative Partnership Institute, a Washington, D.C.-based nonprofit where former White House chief of staff Mark Meadows is now a senior partner.",
    "Still, it can bankroll all manner of activities meant to maintain Mr. Trumps stature within the party, including rallies, advertising, compiling donor lists, polling, staff and donations to other candidates.",
    "Reps. Ronny Jackson (R., Texas), Mr. Trumps former White House doctor, and Lauren Boebert (R., Colo.) received donations, as did Senate candidates Rep. Mo Brooks (R., Ala.) and Herschel Walker, among others.",
    "The bulk of Mr. Trumps available political cashabout $105 millionis sitting in a leadership PAC called Save America, which issues press statements, candidate endorsements and donation solicitations.",
    "The rest is housed in MAGA PAC, a multicandidate committee that formed out of Mr. Trumps presidential campaign, and a donation conduit committee called Save America joint fundraising committee.",
    "The former president raised more than $51 million during the last six months of 2021, the vast majority of which his political operation said, came from donations of less than $200 made online.",
    "In a statement announcing the fundraising figures, Taylor Budowich, the former presidents communications director, said Mr. Trump is incredibly well positioned to look beyond November.",
    "Mr. Trump has yet to definitively say whether he will run again after losing the 2020 election, but he has resumed holding political rallies and teased a potential presidential bid.",
    "Write to Chad Day at Chad.Day@wsj.com\nCorrections & Amplifications\n An earlier version of this article incorrectly spelled the name of the Conservative Partnership Institute.",
    "MAGA PAC reported paying rent or meeting expenses in the amount of $188,000 to Trump Tower Commercial, $53,000 to the Mar-A-Lago Club and $3,000 to Trump Restaurants.",
    "The latest campaign finance filings, which cover the second half of 2021, show that Mr. Trump remains the main online fundraising draw in the Republican Party.",
    "The fundraising haul was less than he raised during the first six months of last year but still the most of any GOP figure during the second half of last year.",
    "The political war chest is an unprecedented amount of money for a former president to wield as Mr. Trump seeks to maintain his hold on the Republican Party.",
    "The committee also donated a total of $145,500 to 28 state and local races, with the largest single donation of $10,000 going to Texas Lt. Gov.",
    "During the first half of 2021, Save America PAC, which can donate $5,000 per election to a campaign, made no donations to other GOP campaigns.",
    "But during the second part of the year, the committee donated $5,000 each to 41 federal campaigns of 2022 candidates Mr. Trump has endorsed.",
    "The Trump political operation spent about $1.8 million on email-list rentals through the email marketing company Conservative Connector.",
    "The cash on hand total was about the same as the Democratic and Republican national committees reported to start 2022combined.",
    "Outside of political and charitable contributions, the three primary Trump committees spent the most on fundraising expenses.",
    "An additional $1.5 million went to legal consulting, not including those expenses left over from 2020 recount efforts.",
    "Photo: Chip Somodevilla/Getty Images\nThe money in these committees cant be directly spent on a presidential campaign.",
    "About $8.2 million went to SMS text-messaging advertising spread across two companies, Tatango and Opn Sesame.",
    "Save America paid a little more than $100,000 for rental and catering fees to the Trump Hotel Collection.",
    "Sen. Chuck Grassley of Iowa was among those who received a federal campaign donation.",
    "share your thoughts\nWhat do you think are Donald Trumps goals with his fundraising?",
    "An additional nearly $4 million was spent on WinRed donation processing fees.",
    "Mr. Trumps businesses also continued to be paid by his political committees.",
    "), Rand Paul (R., Ky.) Marco Rubio (R., Fla.) and Tim Scott (R., S.C.).",
    "Copyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "Among those receiving federal campaign donations were Sens.",
    "), Chuck Grassley (R., Iowa), John Kennedy (R., La.",
    "Anthony DeBarros contributed to this article.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "(Corrected on Feb. 1, 2022.)",
    "Join the conversation below.",
    "John Boozman (R., Ark.",
    "Dan Patrick."
  ]
}