{
  "id": 8207,
  "mediaId": 43,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "candidates are getting 'crushed' in early fundraising: report",
  "image": "https://images.dailykos.com/images/920298/story_image/GettyImages-1209540367.jpg?1614032729",
  "link": "https://www.dailykos.com/story/2022/2/1/2078078/-Trump-endorsed-candidates-are-getting-crushed-in-early-fundraising-report",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "The molted Trump rind has long since been scoured from the Oval Office carpet, and the piquant McRib funk has wafted to the outer reaches of the Eastern Seaboard, but our disgraced ex-pr*sident has conspicuously hung around like a horny, face-hugging alien itching to hatch a slimy new fascist state from the hollowed-out husk of our once-hale and hearty republic.",
    "VICE News:\nMany of the GOP candidates Trump is backing in open-seat races are struggling to raise significant funds as well against better-funded opponentsand every single one of the GOP candidates Trump has endorsed against a GOP incumbent is getting crushed in fundraising, according to newly released campaign finance reports.",
    "Rep. Mo Brooks, whos running for U.S. Senate with Trumps endorsement, raised less than $400,000 from October through December, and two of his primary opponents, Katie Boyd Britt and Mike Durant, each have $4 million war chestsdouble Brooks $2 million in reserves.",
    "While many were alarmed over the weekend when Trump promised to pardon Jan. 6 protesters if reelected and directed his shambolic orc horde to recommit to violence if the gendarmes finally catch up with him, I was actually somewhat encouraged.",
    "Im not ready to say Trumps influence is definitely on the wanewe have a long way to go, a lot of work to do, and plenty of Trump wannabes to keep a watchful eye onbut I feel better about our future than I did a few months ago at this time.",
    "Sen. Lisa Murkowski, who voted to impeach Trump last yearthereby rousing his black, bloodless knot of a heart to something resembling movementhas $4.3 million in the bank, or seven times her opponent Kelly Tshibakas meager $634,000 haul.",
    "But it is a rough proxy for the relative enthusiasm surrounding a candidate, and unless that candidate is Trump himself, he or she is unlikely to catch lightning in a bottle like the logorrheic whale sphincter did in 2016.",
    "Meanwhile, North Carolina Rep. Ted Budd, whose Trump endorsement drew quizzical looks from many Republicans, is barely outraising his GOP primary opponent, former North Carolina Gov.",
    "Trump-backed Georgia Republican Senate candidate Herschel Walker raised almost $5.4 million in the past three months and has about the same amount in the bank.",
    "The law may actually be closing in on Trump, and if the courts dont squash him, Americans famously short attention span just might make him irrelevant.",
    "And I dont mean a mighty grizzly with his paw caught in leg-hold trapmore like a naked mole rat with his head stuck in a Dr. Pepper can.",
    "And now comes more bad news for the celebrated congressional thing-maker: His charges are getting murdered in the fundraising game.",
    "Thats a huge haul, but Georgia Democratic Sen. Raphael Warnock far outpaced him, bringing in $9.8 million in the same time period.",
    "Every single one of the House candidates Trump has endorsed against a GOP incumbent is getting shellacked in fundraising as well.",
    "It made comedian Sarah Silverman say, THIS IS FUCKING BRILLIANT, and prompted author Stephen King to shout Pulitzer Prize!!!",
    "Pat McCrory, and is getting whipsawed by Democratic candidate Cheri Beasley, who has raised nearly three times Budds total.",
    "As the esteemed Kerry Eleveld reports, Trumps grip on his party appears to be slowly but definitively slipping away.",
    "Or, if you prefer a test drive, you can download the epilogue to Goodbye, Asshat for the low, low price of FREE.",
    "Warnock has $22.9 million in the bank for whats sure to be one of this cycles most expensive Senate races.",
    "The dude sounds desperate, and he no doubt knows his own legal peril far more intimately than we plebs do.",
    "(In December, The Hill noted that Trump and Co. are struggling to clear the GOP primary field for Budd.)",
    "Get them all, including the finale, Goodbye, Asshat: 101 Farewell Letters to Donald Trump, at this link.",
    "You win:\nEven strong-performing Trump allies are getting lapped in fundraising.",
    "Well, I wish I could stop thinking about Trump entirely, but no such luck yet.",
    "To me, his plaintive snarling sounded like the last gasp of a wounded animal.",
    "Should I take pity on the big, dopey animal or  go in a different direction?",
    "Oh, things arent going quite so swimmingly for Bone Spurious the Betrayer?",
    "Now, as we all know, fundraising hardly determines ones electoral destiny.",
    "That said, this news will serve to cheer my heart for the time being.",
    "The viral letter that launched four hilarious Trump-trolling books.",
    "So much for Trump clearing the field to install his own candidates.",
    "And thats a big maybe.",
    "(on Twitter, that is).",
    "How should I put this?",
    "Oh, but thats not all.",
    "Dryer static, maybe.",
    "Wishful thinking?",
    "The list goes on.",
    "x\nx\nx\nOkay, Kylo.",
    "What is it?",
    "Lets see."
  ]
}