{
  "id": 8212,
  "mediaId": 120,
  "date": "1/31/2022 12:00:00 AM",
  "headline": "How many times can Herschel Walker fumble before he's benched?",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2021_51/3526811/211224-herschel-walker-ew-143p.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/how-many-times-can-herschel-walker-fumble-he-s-benched-n1288236",
  "sentiment": "0.0",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.nbcnews.com/author/steve-benen-ncpn433601",
  "termIds": [
    815
  ],
  "sentences": [
    "After all, he played football and struggled as a businessman, but he doesn't have a background in public service, so it stands to reason that he'd struggle badly when asked to discuss the basics on issues such as voting rights, public health, and infrastructure.",
    "But as things stand, Walker is nevertheless the leading U.S. Senate candidate in one of the nation's most important and most competitive contests, despite the fact that he doesn't appear to know what he's talking about.",
    "Last week, the NBC affiliate in Atlanta reported that Walker had business interests that took money through the 2020 paycheck protection program, even as he publicly ridiculed businesses that received the same funds.",
    "There were two statewide polls released last week  one from the Atlanta Journal-Constitution, the other from Quinnipiac  and both found Walker with small leads over incumbent Democratic Sen. Raphael Warnock.",
    "What's more, despite his confusion and lack of preparation, Walker has received the enthusiastic backing of Republican Party leaders, including Donald Trump and Senate Minority Leader Mitch McConnell.",
    "In case this isn't obvious, Walker launched his U.S. Senate campaign in August, which means he was a statewide candidate during the legislative debate over the infrastructure package.",
    "The same week, we learned that Walker had falsely claimed the FDA had approved unproven mystery treatments for Covid-19, including a \"dry mist\" that can \"kill any Covid on your body.\"",
    "About a month ago, for example, the first-time candidate tried to argue that the late-Rep. John Lewis was a senator who'd oppose the John Lewis Voting Rights Advancement Act.",
    "To be sure, many voters aren't yet thinking about elections that are 281 days away, and it's likely that most Georgians haven't heard about Walker's struggles as a candidate.",
    "A day later, as Yahoo News noted, the GOP Senate hopeful struggled when asked for his opinion on the bipartisan infrastructure package that became law a few months ago.",
    "After Herschel Walker moved to Georgia to launch a Republican U.S. Senate campaign, his team didn't seem especially eager about sending him out on the campaign trail.",
    "As we've discussed, the retired athlete spent months avoiding public interactions with voters and turning down interview requests with mainstream journalists.",
    "GOP officials believe Walker might win  and for a post-policy party that sees the acquisition of power as the only goal that matters, that's good enough.",
    "It's entirely possible the former running back's fumbles will catch up with him, and he has intra-party primary rivals who are eager to take his place.",
    "By this reasoning, he's ahead because much of the public knows about his on-the-field success, but doesn't know about his ignorance of public affairs.",
    "Describing his curious strategy of running for office while hiding, CNN noted in September, \"Walker's schedule keeps him largely behind closed doors.\"",
    "There's obviously reason to wonder whether Walker is prepared to serve in the Senate, but he's nevertheless asking Georgia voters to put him there.",
    "That said, I imagine some might see reports like these and think it's unfair to expect Walker to be prepared for substantive questions like these.",
    "\"I have to see all the facts,\" Walker told The Daily Caller's Jack Greenberg during an interview when asked if he would have voted for the law.",
    "In the same interview, asked for his perspective on voting rights, Walker added an indecipherable word salad.",
    "It's not \"totally unfair\" to ask him for his perspective on one of the most important laws of the last year.",
    "I think that's what is totally unfair to someone like myself to say, 'What are you going to vote for'?\"",
    "The Republican added that he \"hadn't been privileged\" to have received the relevant information.",
    "Soon after, the Georgia Republican talked about living in Texas.",
    "Finally, it's important to realize this might actually work.",
    "\"Until I see all the facts, you can't answer the question.",
    "Recommended\nBut that sets expectations far too low.",
    "And the allegations of domestic violence.",
    "And his private-sector difficulties.",
    "We're occasionally reminded why."
  ]
}