{
  "id": 8215,
  "mediaId": 12,
  "date": "1/28/2022 12:00:00 AM",
  "headline": "Belief makes Georgia Bulldogs a threat to win it all again",
  "image": "https://www.ajc.com/resizer/tr3U4DXoCq3ZCZ6PPA9z1qDwOH0=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/HUXTS5XTM3ZDS2TVDV25X4SL6U.JPEG",
  "link": "https://www.ajc.com/sports/georgia-bulldogs/belief-makes-georgia-bulldogs-a-threat-to-win-it-all-again/KEAAW4OH7JD4JDJVITI67IRHII/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chip Towers",
  "authorUrl": "https://www.ajc.com/staff/chip-towers/",
  "termIds": [
    815,
    2235,
    5673,
    5703,
    5739,
    5850,
    5996,
    3315,
    2537,
    2555,
    2672
  ],
  "sentences": [
    "But while the city of Blackshear is throwing a parade in Bennetts honor Sunday, the debate over whether his decision to come back really is a good thing for the Bulldogs continues to melt down fan-site chatrooms.",
    "Not long after the 33-18 championship result was finalized, Las Vegas handicappers posted the Bulldogs and Alabama as co-favorites to win the 2022 championship with identical 13/4 odds.",
    "There were stars such as Lindsay Scott, Jimmy Payne and Eddie Meat Cleaver Weaver, stalwarts like Wayne Radloff and Tim Crowe and up-and-comers like Freddie Gilbert and Clarence Kay.",
    "Weve got to do a tremendous job explaining to our kids how the wind blows at the top, Smart said Jan. 11, the day after Georgias 33-18 national championship win over Alabama.",
    "In the playoffs, Bennett had the best numbers of all quarterbacks for passes of more than 20 yards, going 7-of-11 for 305 yards, two touchdowns and zero interceptions.",
    "Smart told ESPNs Rece Davis in a post-championship interview that sticking with Bennett this past season taught him to trust your gut on personnel decisions.",
    "Forgotten by now is the fact that Georgia players back then were hearing as much about the national championship drought as they were this past season.",
    "I just looked around the locker room and knew we had the talent to run this thing back and do it again, said Belue, now an Atlanta sports radio host.",
    "That loss would be the only blemish until Dan Marino and Pitt ripped out Georgias hearts with a final-seconds touchdown pass in the Sugar Bowl.",
    "A junior quarterback when the Bulldogs defeated Notre Dame 17-10 on Jan. 1, 1981, Belue almost immediately thought ahead to his senior season.",
    "Only Alabama and USC have repeated as national champions since the Bowl Championship Series era began in 1998, and one of those was shared.",
    "Such unpleasant memories fade further into the background with Georgia winning it all in 2021 -- and taking down Alabama in the process.",
    "The 1982 team, featuring a Heisman-winning Herschel, was the last to go undefeated during the regular season until this past year.",
    "Not only does Georgia no longer have to answer questions about the drought, but it heads into the coming season as true believers.",
    "In Sports, this is the third in a series of stories examining how the title will impact fans, admissions, recruiting and politics.",
    "Editors Note: Georgias first national championship in 41 years will have an impact more far-reaching than the football program.",
    "Buck Belue was excited about Georgia winning the national championship in 1980, beside himself like everybody else, really.",
    "While that remains a polarizing subject within the fringes of Georgias fan base, its not for Smart or for national pundits.",
    "On Sept. 19, 1981, the Bulldogs committed nine turnovers and lost on the road to eventual national champion Clemson, 13-3.",
    "They, too, lost in agonizing fashion on fourth-and-11 to quarterback Todd Blackledges Penn State team in the Sugar Bowl.",
    "But I was so excited looking around and seeing we had the personnel to come right back and do it again the next season.",
    "He continues to like what Bennett, in combination with offensive coordinator Todd Monken, brings to Georgias offense.",
    "The 5-foot-11, 190-pound Bennett topped Aaron Murray for the best pass efficiency rating in Georgia history at 176.7.",
    "Only 12 schools have done it dating to the 1930s, including Minnesota, the only one to do it three times (1934-36).",
    "He paired with coach Monken really well, because coach Monken is a great play-action shot guy, Smart told Davis.",
    "Twelve of the players that started in the national championship game have moved on, including seven on defense.",
    "We slayed two dragons with one sword this year, said Jeff Dantzler, who hosts Georgias Dawg Talk postgame show.",
    "Alabamas Heisman Trophy winner Bryce Young was 5-of-16 for 207 yards with two TDs and two interceptions.",
    "Georgia coach Kirby Smart, himself part of five national championships at Alabama, will second that.",
    "More than anything else, Georgia winning the 2021 national championship turned doubt into belief.",
    "It had been 38 years since the last title when the Bulldogs finally broke through in New Orleans.",
    "Look, we really should have won three national titles in a row  80, 81 and 82, Belue lamented.",
    "But Ill never doubt my gut in that hes a winner and a leader and a really special player.",
    "And belief, Belue said, is half the battle when it comes to competing for championships.",
    "Everybodys excited about Georgia football, and I think thats especially true this time.",
    "I think most of the Bulldog Nation is excited to have him back, just like the team is.",
    "Georgia couldnt be in better hands than they are with Stetson coming back, Belue said.",
    "He won me over with his performance in the playoffs against Michigan and Alabama.",
    "And that complemented our football team because of our offensive weapons outside.",
    "And while Georgia was unable to repeat in 1981 or 82, it was right there again.",
    "The ability to play-action throw and run the ball helped us tremendously.",
    "Since the College Football Playoff era began in 2014, the number is zero.",
    "He finished third in the nation in yards per passing attempt at 9.97.",
    "Its a long, draining season trying to win the national championship.",
    "But like Georgias 1981 squad, a lot of key players will be back.",
    "And there are a lot of kids to replace, some tremendous leaders.",
    "But he was even more excited about what it meant going forward.",
    "To finally beat Alabama and win the natty again was incredible.",
    "Winning the title energizes the whole campus and the fan base.",
    "Notably, quarterback Stetson Bennett is among those returnees.",
    "The team believes in him, the coaching staff believes in him.",
    "The 1981 Bulldogs won 10 games by an average of 26.4 points.",
    "Most of those were mired in controversy during the poll era.",
    "It was so obvious to see then, and I think you see it now.",
    "It was going to be my senior year, and that energized me.",
    "Hopefully that will carry over into the younger ones.",
    "As you climb that mountain, it is windy up there.",
    "Indeed, there were some major pieces coming back.",
    "Unsure before, the Bulldogs know they can do it.",
    "They could do it again, he thought to himself.",
    "And I would have been a part of two of those.",
    "The rest of the season was a bunch of routs.",
    "Alas, the bloom was off that rose by Week 3.",
    "Thats because repeating is very hard to do.",
    "Oh, and a tailback named Herschel Walker.",
    "He was playing at a really high level.",
    "Hes already shown that he can do it.",
    "You have to believe in the guy now.",
    "That was the case in 1981 as well.",
    "That rejuvenated me right away.",
    "It is about belief, Belue said.",
    "So, again, repeating is hard.",
    "Thats what Stetson does best.",
    "But we werent able to do it.",
    "They should do it again.",
    "Numbers back Smarts gut.",
    "Ive seen it firsthand.",
    "And why wouldnt they?",
    "It is not easy."
  ]
}