{
  "id": 8217,
  "mediaId": 238,
  "date": "d2022-01-28T13:30",
  "headline": "Jeff Fisher returns to pro football as a head coach in the fledgling USFL",
  "image": "",
  "link": "https://www.washingtonpost.com/sports/2022/01/28/jeff-fisher-usfl-michigan-panthers/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    792,
    815,
    5793,
    5871,
    5976,
    5596,
    5614,
    5636,
    5637,
    5661
  ],
  "sentences": [
    "The league is set to kick off in April and play a 10-game schedule followed by a postseason, with all games being played in Birmingham, Ala.\nOther USFL coaches with NFL head coaching experience include Todd Haley (Bandits), who led the Kansas City Chiefs from 2009 to 2011, and Mike Riley (Generals), who ran the San Diego Chargers from 1999 to 2001.",
    "He was also on hand for the Oilers 1997 move to Tennessee and name change to the Titans, experiences that could help him handle an uncertain situation with the USFL, which will probably want to move at least some of its teams to their home markets over the next few years  assuming it lasts that long.",
    "This version of the USFL is not directly linked to the USFL that existed from 1983 to 1985 and managed to sign several marquee players who would eventually go on to star in the NFL, including Steve Young, Herschel Walker, Reggie White, Jim Kelly and Doug Flutie.",
    "The other team names being used by the new, eight-team USFL are also derived from its predecessors: the Tampa Bay Bandits, New Orleans Breakers, Houston Gamblers, New Jersey Generals, Pittsburgh Maulers, Birmingham Stallions and Philadelphia Stars.",
    "Two other spring professional football leagues have failed in recent years to finish their first seasons, although the XFL may return after hastily suspending operations when the coronavirus pandemic disrupted sports all over the world in 2020.",
    "Bart Andrus (Stars) was an assistant to Fisher for four seasons in Tennessee and has been the head coach of NFL Europes Amsterdam Admirals, the Canadian Football Leagues Toronto Argonauts and the United Football Leagues Omaha Nighthawks.",
    "Its been a while since I led a team on-field, and Ive missed it, Haley, who has been out of professional football since being fired as the Cleveland Browns offensive coordinator midway through the 2018 season, said in a statement.",
    "That approach helped the 1999 Titans reach the Super Bowl and come agonizingly close to upsetting the Greatest Show on Turf Rams, but Fisher gradually became associated, fairly or not, with relentless mediocrity.",
    "I miss the game  [and] the players, Fisher, who has maintained a relatively low profile since parting ways with the Rams, said last year in an interview with a Nashville radio station (via the Nashville Post).",
    "A former defensive back with the Chicago Bears, Fisher strove to craft an identity with his Oilers and Titans teams as hard-nosed squads that played a ball-control style and were tough to score against.",
    "The league may have signaled an intention to lure audiences with high-scoring games in the fact that seven of its eight head coaches have offensive backgrounds, with Fisher the only exception.",
    "The former coach of the Houston Oilers/Tennessee Titans and St. Louis/Los Angeles Rams, whose last NFL season came in 2016, will try to help the Michigan Panthers hit the ground running.",
    "Kirby Wilson (Maulers) is a longtime running backs coach in the NFL who had stints in New England, Washington, Tampa Bay, Arizona, Pittsburgh, Minnesota, Cleveland and Oakland/Las Vegas.",
    "Fisher spent 22 years as an NFL head coach, the final five with the Rams, including a 2016 campaign that was the first for the team in Los Angeles after it relocated from St. Louis.",
    "The new league also features three head coaches notable for their work at the college level: Larry Fedora (Breakers), Skip Holtz (Stallions) and Kevin Sumlin (Gamblers).",
    "The NFL and its rulemaking competition committee expect to consider changes to the overtime format this offseason, particularly as it relates to postseason games.",
    "Fishers 173-165-1 overall record leaves him tied with the late Dan Reeves for the most losses by an NFL head coach but also 12th in wins.",
    "However, it is using many of the same team names, such as the Michigan Panthers, who won the inaugural championship of the original USFL.",
    "The long ball remains one of the most effective plays in football, but defenses have forced the games best QBs to change their approach.",
    "Haley described his hiring by the USFL as a tremendous opportunity for me to get back into coaching at the professional level.",
    "Over his 22 seasons as a head coach, he posted winning records just six times while 12 times finishing between 6-10 and 8-8.",
    "The new USFL is owned by Fox Sports, which could bode well for its prospects of sound backing and national promotion.",
    "The USFL unveiled on Thursday the biggest name to join the fledgling league as a head coach: Jeff Fisher.",
    "The other two USFL head coaches have not held that position in the NFL or at a major college program.",
    "Its also rare that a head coach, as it was once put, gets to pick all the groceries and fix the meal.",
    "And it took every bit of artistry and belief Kansas City had to outlast Buffalo, 42-36 in overtime.",
    "The Alliance of American Football quickly collapsed in 2019 amid reports of financial instability.",
    "In the meantime, Ive been doing things I havent been able to do in a long time.",
    "The NFL postseason continues with the conference championship games.",
    "What are each teams odds to reach the Super Bowl?",
    "Read Jerry Brewer on the Chiefs playoff run.",
    "My hope is to get back on the sideline.",
    "Watching the NFL and the college game.",
    "Deep down, I dont feel like Im done.",
    "Here are the most likely matchups.",
    "Heres what you need to know.",
    "Winning, however, is an art.",
    "But if I am, thats okay.",
    "Production is a skill.",
    "Family and grandkids."
  ]
}