{
  "id": 8228,
  "mediaId": 43,
  "date": "1/27/2022 12:00:00 AM",
  "headline": "Warnock soaring to the lead in fundraising over GOP opponent, Trump lapdog Herschel Walker",
  "image": "https://images.dailykos.com/images/1031005/story_image/GettyImages-1235252634.jpg?1643291215",
  "link": "https://www.dailykos.com/story/2022/1/27/2077075/-Sen-Warnock-on-the-offensive-outraising-Trump-lapdog-ex-NFL-player-Herschel-Walker-by-millions",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebekah Sager",
  "authorUrl": "/users/rebekah sager",
  "termIds": [
    815
  ],
  "sentences": [
    "In December, Atlanta Journal-Constitution reporter Greg Bluestein called out Walker for saying he graduated from the University of Georgia with a Bachelors degree in Criminal Justice, a lie found on his Amazon author site, his Speaker Booking Agency page, and his New Georgia Encyclopedia entry, AJC reported.",
    "x\nx\nx\nWalker is up against at least three other Republican primary candidates for Warnocks seat, including the state Agriculture Commissioner Gary Black, a Navy veteran; former bank executive, Latham Saddler; and construction company owner, Kelvin King.",
    "As Reverend Warnock continues to fight for hardworking Georgia families, the enthusiasm behind Reverend Warnock's campaign continues to grow, Warnocks campaign manager Quentin Fulks said in a statement, according to the Atlanta Journal-Constitution.",
    "Walker has been beknighted by former twice-impeached former President Donald Trump and racist, vote suppressing Minority Leader Mitch McConnell, which, so far, has worked in his favorhand in hand with the fact that hes beloved in Georgia.",
    "The event was co-hosted by dubious figure Bettina Sofia Viviano-Langlaisa film producer, proud birther, and president and owner of Accelerate Entertainment, which offers a very short slate of very bad movies.",
    "I probably shouldnt tell you, Walker says, adding Do you know right now, I have something that [you can bring] into a building, that will clean you of COVID, as you walk through this, this dry mist?",
    "After driving another record-breaking fundraising haul, our strong network of grassroots support is fired up to send Reverend Warnock back to the Senate to fight for Georgia, Fulks added.",
    "The states first Black senator and Ebenezer Baptist Church pastor is seeking a full six-year term, but given Georgias divided political landscape, Warnock is far from being a shoo-in.",
    "The Daily Beast found an Aug. 2020 interview where Walker told right-wing talk show host Glenn Beck about the new FDA-approved spray that kills COVID on contact.",
    "According to Warnocks campaign, the senator raked in $9.8 million to the retired NFL stars $54.4 million in the same three-month period ending on Dec. 31.",
    "In October, Walker fumbled again when he was forced to cancel a planned fundraiser after the host was discovered to have a swastika as her profile pic.",
    "Now, heres the thing: Not everyone cares whether a senate candidate is a college graduate, but I would suspect most care if you lie about it.",
    "But all the attacks on Warnock in the world arent going to undo Herschels own history, not to mention his recent mistakes while campaigning.",
    "He leans in and adds, EPA-, FDA-approved, then continues: When you leaveit will kill the virus as you leave, this here product, Walker says.",
    "Warnocks latest haul will give him a hefty $23 million cash on hand for a reelection battle that could decide control the U.S. Senate.",
    "According to Fox Business, a super PAC supporting Walker, 34N22, spent more than $50,000 on a billboard campaign attacking Warnock.",
    "He has outraised his GOP opponent, Herschel Walker, by almost double in the last quarter of 2021, with donations averaging at $43.",
    "According to public records reviewed by Associated Press, Walker repeatedly threatened ex-wife Cindy Grossman during his divorce.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "In an interview with ABC News, Grossman said Walker held a gun to her head, saying, Im going to blow your f---ing brains out.",
    "He adds that he has a second unspecified miracle product, a spray possibly indicated for use after the dry mist treatment.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Senator Raphael Warnock (D-GA)\nGeorgia Sen. Raphael Warnock has proved once again that his reputation is warranted.",
    "In 2005, Grossman secured a protective order against him, alleging violence and controlling behavior, AP reports.",
    "Viviano-Langlais not only produces crap entertainment, but shes also a vehement right-wing anti-vaxxer.",
    "The billboards target inflation and gas prices, while a third reads, \"Crime is killing Atlanta.\"",
    "His campaign says he acquired the contributions from 130,000 donors from October to December.",
    "She filed for divorce in 2001, citing physically abusive and extremely threatening behavior.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "As you walk through the door, it will kill any COVID on your body, he continues.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Again, not a big deal, unless you have a history of domestic violence.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Walker also has a very dark history of mental health issues.",
    "This brings me to my next embarrassing Walker tidbit.",
    "Even Beck looked suspicious, but Walker rambled on.",
    "They dont want to hear about that, Walker says.",
    "This is a short blurb about Daily Kos.",
    "They dont want to talk about that.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Hes a fundraising giant.",
    "Daily Kos is different.",
    "Please read it.",
    "And Im serious."
  ]
}