{
  "id": 8232,
  "mediaId": 19,
  "date": "d2022-01-27T00:00",
  "headline": "Georgia Poll: Football Legend Herschel Walker Leads Democrat Raphael Warnock in Tight Senate Race",
  "image": "https://media.breitbart.com/media/2022/01/GettyImages-1235507269-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/01/27/georgia-poll-football-legend-herschel-walker-leads-democrat-raphael-warnock-tight-senate-race/",
  "sentiment": "0.45",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    815,
    1147,
    146,
    428,
    571,
    2555,
    2672
  ],
  "sentences": [
    "In terms of demographics in the race between Walker and Warnock, Walker received the majority of support from respondents with less formal education, while Warnock received the majority of support from respondents with a college degree or higher.",
    "While the AJC poll found Walker with a slim lead over Warnock, a Quinnipiac University poll published Wednesday had the two candidates in an even tighter race, just one point apart, with Walker at 49 percent and Warnock at 48 percent.",
    "Both Walker and Warnock are black Americans, but Warnock, senior pastor of the historic Ebenezer Baptist Church in Atlanta, has a lengthy history of spreading racially charged messages through his speeches, sermons, and writings.",
    "Black, who is currently in a distant second place to Walker, was also tested against Warnock in the AJC poll and trailed Warnock by 5.3 points in a hypothetical general election matchup, 40.7 percent to 46 percent.",
    "Newly released fundraising numbers show both candidates raked in millions in the last quarter of 2021, per the Associated Press, but Warnock outpaced Walker, raising $9.8 million compared to Walkers $5.4 million.",
    "The polls top-line results suggest the race is poised to become highly competitive, and based on current fundraising numbers, it is also set to be one of the most expensive Senate battles of the midterms.",
    "Walker had already been publicly backed by former President Donald Trump and was somewhat of a Georgia household name because of his athletic history before he decided to launch his Senate campaign.",
    "Other candidates competing with Walker in the GOP primary, which takes place May 24, include Agriculture Commissioner Gary Black, former Navy SEAL Latham Saddler, and Air Force veteran Kelvin King.",
    "Walker, a former University of Georgia football star and former NFL player, announced his bid for office in August 2021 and shot to the top of the primary field quickly thereafter.",
    "The poll, published Thursday by the Atlanta Journal-Constitution, found Walker with 47.1 percent support and Warnock with 43.6 percent in a hypothetical general election matchup.",
    "Republican candidate Herschel Walker is narrowly beating incumbent Sen. Raphael Warnock (D-GA) by 3.5 points in the race for U.S. Senate in Georgia, according to a new poll.",
    "Those in the poll whose race fell under the category other were more evenly split, with 43.8 percent supporting Warnock and 34.2 percent supporting Walker.",
    "In the poll, Warnock received the majority of support from black respondents, which aligns with black voters historically overwhelmingly voting Democrat.",
    "The AJC poll was conducted by the University of Georgias School of Public and International Affairs from January 13 to 24 among 872 registered voters.",
    "The polls margin of error is +/- 3.3 percent, meaning that the 3.5 percent difference between Walker and Warnock pits them in a statistical tie.",
    "Additionally, respondents making more than $75,000 per year favored Walker, while those making less than $75,000 per year preferred Warnock.",
    "By contrast, Warnock received 29.7 percent support from white voters, while Walker received 69.4 percent from the same.",
    "The poll showed 84.3 percent of black respondents supported Warnock, while 10.5 percent supported Walker.",
    "7.8 percent of respondents said they did not know which candidate they would vote for.",
    "Two percent of respondents said they were undecided in that poll.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "Follow her on Twitter at @asholiver."
  ]
}