{
  "id": 8253,
  "mediaId": 18,
  "date": "1/25/2022 12:00:00 AM",
  "headline": "Letters to the editor",
  "image": "https://www.bostonherald.com/wp-content/uploads/2019/05/GettyImages-615608882.jpg?w=1569",
  "link": "https://www.bostonherald.com/2022/01/25/letters-to-the-editor-318/",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Boston Herald editorial staff",
  "authorUrl": "https://www.bostonherald.com/author/boston-herald-editorial-staff/",
  "termIds": [
    815,
    5706,
    5741,
    5968,
    146,
    428,
    5213
  ],
  "sentences": [
    "Lydia Edwards double duty\nI was disappointed by the news story in Saturdays Boston Herald about Lydia Edwards and her decision about staying on as a city councilor until April (With two seats, Lydia could be sitting pretty, Boston Herald, Jan. 22).",
    "Moreover, with Bill Belichick needing just 27 total more wins to surpass Don Shula on the all-time wins list, Rodgers gives him the best chance to eclipse this record within two years.",
    "In my opinion, our capitalistic society (Democratic and Republican) majority must be convinced of the idea that the anti-vaxxers must be sent to the back of the line at triage.",
    "Eugene R. Dunn, Medford, N.Y.\nTriaging the emergency room\nThank you Dr. Ranney, for your service and thoughts expressed in your op-ed in The Washington Post on Sunday Jan. 23.",
    "Remember, during the period that Kim Janey was acting mayor, her council duties continued on with her staff finishing out the final months of her District 7 term as councilor.",
    "She believes case law lets her resign at a future date but that the charter timeline should start as of this past Friday and not the date she actually leaves her city post.",
    "The story zeroed in on whether she would be collecting two salaries for the first three months of 2022 since she is now a state senator.",
    "The biggest question I have is with the city charters timelines for calling a special preliminary election to fill her council seat.",
    "As I see it, this Rodgers to New England trade makes perfect sense and would set Patriots Nation on fire going into the 2022 season.",
    "With Rodgers behind center for the Patriots, they would instantly become a Super Bowl contender and possible first seed in the AFC.",
    "Sal Giarratani, East Boston\nPatriots moves\nMac Jones had a better-than-expected rookie season and has a bright future ahead of him.",
    "Edwards apparently believes the political world revolves around her, the way the Vatican thought the Sun revolved around the Earth.",
    "The assertion that by hanging in an extra three months that shes doing the voters in District 1 a big favor is fabricated politics.",
    "The burn-out from extremely over-taxed emergency rooms and other hospital systems is a political problem that must be solved now.",
    "The clock starts ticking when a councilor announces that she plans to give up her municipal city council seat.",
    "Beyond that, fully funded universal medical care and a hard-working board could fix the rest of it.",
    "But in the short term, hes not the answer to the New England Patriots championship aspirations.",
    "That is the day you timeline both the preliminary and general election for District 1 voters.",
    "Then a preliminary election would be held two months from notice of vacating the seat.",
    "She believes case law is on her side based on the exact wording on election timelines.",
    "Only POTUS might be able to accomplish this convincing from his bully pulpit.",
    "What the Patriots need to do is go all in on perennial MVP Aaron Rodgers.",
    "No election timeline can even begin until the seat is actually vacated.",
    "Her move isnt about good government, its about crass politics, isnt it?",
    "Edwards has announced she will be vacating her council seat by April 1.",
    "and make a Herschel Walker-like trade with the Packers.",
    "who is begging for a change of scenery.",
    "Congress could help with a resolution.",
    "and a general election 28 days later.",
    "Tom Richards, North Attleboro",
    "I believe just the opposite.",
    "Edwards can do likewise.",
    "What say you POTUS?",
    "Local reps?"
  ]
}