{
  "id": 8260,
  "mediaId": 12,
  "date": "1/21/2022 12:00:00 AM",
  "headline": "OPINION: Raphael Warnocks year of victories, defeats, and Senate prayers",
  "image": "https://www.ajc.com/resizer/ISzNuhBRjGdGvJygqzaDKdzk_R4=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/6JSZGBFWYVE4HOBBDEXSS5N7VU.jpg",
  "link": "https://www.ajc.com/politics/opinion-raphael-warnocks-senate-prayers/7BLOSGJJSNGHTIQHJEWD54DPSM/",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia Murphy",
  "authorUrl": "https://www.ajc.com/staff/patricia-murphy/",
  "termIds": [
    815,
    1136,
    1710,
    1951,
    2087,
    2230,
    428,
    571,
    2672,
    2959
  ],
  "sentences": [
    "As a part of his job, Warnock was also appointed to the Senates Agriculture, Banking and Commerce committees and pushed bills to directly help Black farmers, send money and missions to Georgia military installations, and spend more than $1 trillion to build roads, bridges, and other new infrastructure projects around the country.",
    "Along with campaigning, and doing all the things politicians need to do to keep their jobs, Warnock said he sees his primary obligation over the next year, as Georgias Black senator at this extraordinary time in history, as pushing his colleagues to see issues through the lens of the next generation, not the next election.",
    "No moment illustrates the push and pull of Warnocks job, or of American politics in this fraught moment, than the minutes after GOP senators blocked Democrats voting rights legislation Wednesday night, which Warnock had championed since he arrived in Washington.",
    "The package included billions of dollars of direct aid to individuals, free COVID vaccines deployed across the country, retrofitting schools for in-person learning, aid to farmers and small businesses, and a massive, temporary child tax credit.",
    "Among the Democrats more pleasant surprises since he got to Washington have been the Republicans hes partnered with , including U.S. Ted Cruz whom he worked with on a bill to greenlight a highway from Texas to Augusta.",
    "In an interview Thursday, Warnock said Georgias role handing the Senate to Democrats and the legislation theyd advanced since then were what made him most proud since the election.",
    "Raphael Warnock became U.S. Sen. Raphael Warnock, sworn-in on the floor of the ornate Senate chamber using the Bible hed received from his congregation at Ebenezer Baptist Church.",
    "Since then Warnock has had highs, lows, and moments of dissonance, looking for ways to work with political adversaries one moment, even as they block his priorities the next.",
    "Two weeks later, Joe Biden was sworn in as president and the Senate flipped from Republican to Democratic control when Warnock and U.S. Sen. Jon Ossoff were sworn in, too.",
    "Although a Republican Senate would likely have approved another COVID aid package, too, only Warnock and Ossoffs votes made a bill of that size possible for Biden.",
    "GOP U.S. Sen. Tim Scott, South Carolinas first Black senator, said Democrats accusations of voter suppression against his partys leaders are hyperbolic at best.",
    "On the day we passed that bill, I heard myself say words that were strange even to my ear: I want to associate myself with the words of Ted Cruz, he said.",
    "Id heard from several people in Washington that his role as pastor at Ebenezer and senator from Georgia had made him a unique figure in the upper chamber.",
    "He wants that test to apply to Medicaid expansion and veterans benefits and the cost of college for students and their soon-to-be debt-strapped families.",
    "And the Democrats retooled voting rights bill, which Warnock has pushed since his first Senate speech, suffered a high-profile loss on Wednesday night.",
    "I asked him if its hard to think about working with Republicans again after they rejected the voting rights bill hes made his highest priority.",
    "But no amount of prayer has changed the political dynamics in Washington, which have been particularly toxic in Warnocks first year.",
    "Or even which voters will turn out the midterm election, when Stacey Abrams will be on the ballot, but Donald Trump will not.",
    "Senators and staffers, no matter their political persuasion, reach out to him to pray with them, and he is happy to oblige.",
    "Im proud of the ways in which the people of Georgia stood up and made the difference for the whole country, Warnock said.",
    "Somebody asked me to pray last night as we were leaving the chamber, someone who had voted the wrong way, Warnock said.",
    "Just hours after he won election as Georgias first Black senator on Jan. 5, pro-Trump rioters ransacked the Capitol.",
    "Hell face one of four Republicans, including Herschel Walker, who have gotten into the GOP primary to challenge him.",
    "Im used to preaching every Sunday and wondering if anybodys listening, but I keep preaching, he said.",
    "That includes Bidens $1.9 trillion American Rescue Plan, which Congress passed in March of last year.",
    "But Warnock rejected that thinking and said hes just begun his fight for voting rights legislation.",
    "But Dr. King used to say that the arc of the moral universe is long, but it bends toward justice.",
    "Warnock didnt say who he prayed with or even volunteer that anecdote until I asked about it.",
    "Medicaid expansion for Georgia that he campaigned for remains blocked in the state Capitol.",
    "The aid to Black farmers he sponsored in the Senate has been stalled by court challenges.",
    "Its not clear how Bidens currently sinking poll numbers will affect the senators fate.",
    "And Im going to keep preaching the gospel of democracy because I believe in it.",
    "I want us to look deeply inside and ask ourselves, whats the right thing to do?",
    "I want to help us to see every issue through a moral and ethical lens.",
    "Last night was a setback, theres no doubt about that, he said.",
    "Most especially, he said it should apply to voting rights.",
    "Or how voters will judge him in these polarized times.",
    "But Warnocks wins have been joined by defeats, too.",
    "Warnock is up for reelection in less than a year.",
    "I still believe in us and I will fight for us.",
    "I assured him that I will indeed pray for him.",
    "He added with a laugh, Until he gets it right.",
    "So we will continue to fight until we win.",
    "Its been exactly one year since the Rev.",
    "I wont I wont accept defeat.",
    "He said no."
  ]
}