{
  "id": 8270,
  "mediaId": 1390,
  "date": "1/18/2022 12:00:00 AM",
  "headline": "Pro-Herschel Walker PAC hits Warnock over gas prices, inflation in billboard ads",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/381d0acc-448e-4c60-8c9b-bd35dec989ec/7be37f66-89e7-4437-8631-4fb434e7d210/1280x720/match/image.jpg?pubId=854081161001",
  "link": "https://www.foxbusiness.com/politics/herschel-walker-raphael-warnock-georgia-inflation-gas-prices-billboard",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tyler Olson",
  "authorUrl": "https://www.foxbusiness.com/person/o/tyler-olson",
  "termIds": [
    815,
    1765,
    101,
    5584,
    2555,
    2556,
    2672,
    2900
  ],
  "sentences": [
    "Walker is a front-runner to face Warnock in Georgia's Senate general election this fall, as the former football star is endorsed by both former President Donald Trump and Senate Minority Leader Mitch McConnell, R-Ky., two GOP bigwigs often at odds.",
    "FIRST ON FOX: A super PAC supporting Georgia GOP Senate candidate Herschel Walker is spending more than $50,000 on a billboard campaign attacking Sen. Raphael Warnock over inflation and gas prices as the midterms loom later this year.",
    "Warnock, meanwhile, is basing his campaign on issues like election reform after Georgia Republicans passed a controversial voting law last year that he and other Democrats says is designed to suppress votes by Blacks and Democrats.",
    "The Georgia senator also spent last year fighting for Medicaid expansion nationally, noting that Georgia is one of the states that didn't take advantage of expanded Medicaid provisions in the Affordable Care Act.",
    "(Kevin Dietsch/Getty Images / Getty Images)\nHOUSE DEMOCRATS TOP HOUSE GOP ELECTION COMMITTEE LAST YEAR IN MIDTERM CASH RACE\nA third billboard hits Warnock on law and order, saying, \"Crime is killing Atlanta.\"",
    "The PAC, called 34N22, after Walker's number 34 from his playing days at the University of Georgia and in the NFL, says the billboards will appear in the major cities of Atlanta, Augusta, Macon and Savannah.",
    "These endorsements came after some concerns about political baggage Walker may carry, including accusations by his ex-wife of being \"physically abusive\" and reports that he exaggerated his business success.",
    "Thirty-six percent of respondents said inflation and rising prices are the biggest issue in the U.S. economy  more than double the next-highest issue, which was government spending at 16%.",
    "Eighty-four percent of respondents said they were either extremely concerned about inflation and higher prices (55%) or very concerned about inflation and higher prices (29%).",
    "Meanwhile, 36% percent of respondents said they approve of President Biden's handling of crime, compared to 57% who disapprove.",
    "Inflation and prices are at the top of voters' minds, according to a FOX Business Poll released last month.",
    "The two economically-focused billboards say \"Inflation hurts families\" and \"Gas prices are insane.\"",
    "GET FOX BUSINESS ON THE GO BY CLICKING HERE\n\"Our elections are in serious need of protection.",
    "Voters shouldnt have to jump through hoops to cast a ballot,\" Warnock tweeted last week.",
    "Each includes the hashtag \"#WarnockIsn'tWorking.\""
  ]
}