{
  "id": 8278,
  "mediaId": 238,
  "date": "1/12/2022 12:00:00 AM",
  "headline": "Georgia Senate candidate Herschel Walker promoted a mist that he claimed would kill any covid on your body",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/georgia-senate-candidate-herschel-walker-promoted-a-mist-that-he-claimed-would-kill-any-covid-on-your-body/2022/01/12/230ec9a8-73b9-11ec-bc13-18891499c514_story.html",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Walker, a 59-year-old former University of Georgia running back and College Football Hall of Famer, officially entered the race in August and has since received support from a number of high-profile Republicans, despite having no significant experience in politics, as well as questions about his personal behavior, business record and residency.",
    "In recent months, Walker has garnered widespread support from Republican donors and lawmakers, including Senate Minority Leader Mitch McConnell (R-Ky.), who endorsed him in October despite reportedly having reservations about the allegations against him.",
    "Walker, who is vying to unseat freshman Sen. Raphael G. Warnock (D-Ga.) and has been endorsed by former president Donald Trump, did not name the supposed product, which he claimed during an August 2020 podcast appearance was EPA-, FDA-approved.",
    "These baseless allegations are surfacing a decade later purely for political mudslinging, which is irresponsible and wrong, Walker campaign spokeswoman Mallory Blount said in a statement to the Journal-Constitution after the story published.",
    "Cindy Grossman, Walkers ex-wife, claimed in divorce filings that her former husband was physically abusive and threatened to kill her, forcing her to secure a protective order against him, alleging violent and controlling behavior.",
    "The Atlanta Journal-Constitution reported last year that Myka Dean, Walkers ex-girlfriend, told police in 2012 that when she tried to end her relationship with Walker, he threatened to blow her head off and then kill himself.",
    "As the coronavirus was sweeping across the United States last summer and the country was still without a vaccine, Georgia Senate candidate Herschel Walker promoted a mist that he claimed would kill any covid on your body.",
    "The newly-unearthed comments bring renewed scrutiny to Walker, who is already facing criticism over allegations that he threatened the lives of two women, including his ex-wife, and embellished his business record.",
    "He later walked back his suggestion after doctors, lawmakers and the makers of Lysol responded with incredulity and warnings against injecting or otherwise ingesting disinfectants, which are highly toxic.",
    "So, supposing we hit the body with a tremendous, whether its ultraviolet or just very powerful light  and I think you said that hasnt been checked but youre going to test it, Trump said at the time.",
    "In the months before Walker made his remark on Becks podcast, Trump repeatedly touted supposed coronavirus treatments that were not only unproven but also had the potential to cause great harm.",
    "It can also be spread through smaller virus-containing particles that remain in the air over longer distances and time, according to the Centers for Disease Control and Prevention.",
    "This years Georgia Senate contest is certain to be one of the most competitive in a state that narrowly backed President Biden, the first Democrat to win there since 1992.",
    "In April 2020, Trump suggested that scientists should test whether Americans could ingest bleach or other household disinfectants as almost a cleaning to fight the virus.",
    "The former National Football League running back whose career was bookended with stints with the Dallas Cowboys has refused to say whether he is vaccinated.",
    "Do you know, right now, I have something that can bring you into a building that would clean you from covid as you walk through this dry mist?",
    "The winner of the Republican Senate primary will face Warnock, taking on a pastor who helped deliver the Senate majority to the Democrats.",
    "Trump also raised the possibility of using heat or light to combat the virus, a suggestion that public health experts have also dismissed.",
    "The virus is mainly spread through close contact with droplets that are released when a person coughs, sneezes, speaks or breathes.",
    "And then, I said, supposing you brought the light inside the body, which you can do either through the skin or in some other way.",
    "Walker said during the August 2020 appearance on conservative host Glenn Becks podcast.",
    "He continued: When you leave, that will kill the virus, as you leave this here product.",
    "Dean described the alleged threats made by Walker to authorities in Irving, Tex.",
    "As you walk through the door, it will kill any covid on your body.",
    "Then, I have something  you can go and spray down this product.",
    "There is no known mist or spray that can prevent covid-19.",
    "The Daily Beast reported Wednesday on the interview.",
    "The Journal-Constitution obtained the police report.",
    "No charges were filed against Walker.",
    "They dont want to talk about that.",
    "They dont want to hear about that.",
    "EPA-, FDA-approved.",
    "Do you know?"
  ]
}