{
  "id": 8280,
  "mediaId": 43,
  "date": "d2022-01-12T00:00",
  "headline": "No big shocker to learn that Herschel Walker hawked 'dry mist' spray to 'clean' you of",
  "image": "https://images.dailykos.com/images/1026058/story_image/GettyImages-1268366261.jpg?1642017169",
  "link": "https://www.dailykos.com/story/2022/1/12/2074264/-No-big-shocker-to-learn-that-Herschel-Walker-hawked-dry-mist-spray-to-clean-you-of-COVID-19",
  "sentiment": "-0.713",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebekah Sager",
  "authorUrl": "/users/rebekah sager",
  "termIds": [
    815,
    877,
    196,
    501,
    2672
  ],
  "sentences": [
    "Herschel Walker\nIf the fact that he lied about graduating from college, almost appeared at a fundraiser thrown by a woman with a Nazi insignia on her Twitter profile, or his long history of domestic violence doesnt sway you, maybe pro football star-turned-Georgia gubernatorial candidate Herschel Walkers new dry mist for COVID-19 will sell you.",
    "Even as Walkers multimillion-dollar treasure chest grew, he was headed to an October fundraiser in Parker, Texas, co-hosted by dubious figure Bettina Sofia Viviano-Langlaisa film producer, proud birther, and president and owner of Accelerate Entertainment, which offers a very short slate of very bad movies.",
    "But big props to Atlanta Journal-Constitution (AJC) reporter Greg Bluestein for pointing out something a lot of people didnt: Walkers camp has been propagating the myth that Walker graduated from the University of Georgia with a bachelors degree in criminal justice.",
    "Viviano-Langlais not only produces crap entertainment but shes also a vehement right-wing anti-vaxxer who, until she was called out about it, used a swastika symbol made of syringes on her Twitter profile.",
    "I probably shouldnt tell you, Walker says, adding Do you know right now, I have something that [you can bring] into a building, that will clean you of COVID, as you walk through this, this dry mist?",
    "According to Georgias Department of Public Health (DPH), unvaccinated people make up 60% of new COVID-19 cases and those who are boosted make up just 3% of breakthrough infections.",
    "The two-time Pro Bowl champion running back refused to say whether or not hes been vaccinated or boosted, but of course, he continues to poll high among Republicans.",
    "When the AJC asked for a comment regarding the swastika symbol on Walkers hosts page, his camp responded with: This is clearly an anti-mandatory vaccination graphic.",
    "The Daily Beast found an August 2020 interview where Walker told right-wing talk show host Glenn Beck about the new FDA-approved spray that kills COVID on contact.",
    "Viviano-Langlais defended the symbol on Twitter, saying she changed the profile picture because Its insane to think that pic was Anti-Semetic [sic].",
    "Walker is hoping to unseat Democratic U.S. Sen. Raphael Warnock in 2022, but only after going toe-to-toe with a slew of other GOP candidates.",
    "He leans in and adds, EPA-, FDA-approved, then continues: When you leaveit will kill the virus as you leave, this here product, Walker says.",
    "Warnock became Georgias first Black senator in 2020 and is also a pastor at Ebenezer Baptist Church, once led by Martin Luther King, Jr.",
    "According to public records reviewed by the Associated Press, Walker repeatedly threatened ex-wife Cindy Grossman during his divorce.",
    "A lie found on his Amazon author site, his Speaker Booking Agency page, and his New Georgia Encyclopedia entry, the AJC reported.",
    "In an interview with ABC News, Grossman said Walker held a gun to her head, saying, Im going to blow your f---ing brains out.",
    "He adds that he has a second unspecified miracle product, a spray possibly indicated for use after the dry mist treatment.",
    "It was a pic showing what happens when fascists demand people insert foreign material into their body they dont want ...",
    "In 2005, Grossman secured a protective order against him, alleging violence and controlling behavior, AP reports.",
    "Half our revenue comes from readers like you, meaning we literally couldn't do this work without you.",
    "She filed for divorce in 2001, citing physically abusive and extremely threatening behavior.",
    "x\nx\nx\nAnd all this nonsense comes from a man who has never been involved in politics.",
    "Daily Kos is the country's largest progressive, independent news and activism hub.",
    "As you walk through the door, it will kill any COVID on your body, he continues.",
    "He has zero experience, and the Republicans have cleared the field for him.",
    "It's critical that you get the booster if you're eligible,\" said Fisher.",
    "This shows you how obedient they are to former President Donald Trump.",
    "Herschel unequivocally opposes anti-semitism and bigotry of all kinds.",
    "We don't have billionaire backers like some right-wing media outlets.",
    "Can you donate $3 right now to help Daily Kos keep fighting?",
    "Georgia DPH reported 17,686 cases of COVID-19 today.",
    "We are now breaking records with cases of COVID-19.",
    "Even Beck looked suspicious, but Walker rambled on.",
    "They dont want to hear about that, Walker says.",
    "We have our hospital systems under stress.",
    "Okay, and we dont see the resemblance?",
    "Daily Kos relies on readers like you.",
    "They dont want to talk about that.",
    "Donate $3\nDonate $5 monthly",
    "We have deaths climbing.",
    "Desperate actually.",
    "And Im serious.",
    "Thats a lie."
  ]
}