{
  "id": 8286,
  "mediaId": 65,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "Chicago, teachers union reach agreement; students return to classrooms Wednesday",
  "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/01/1862/1048/Lightfoot.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/us/chicago-teachers-district-nail-down-agreement-students-able-to-return-to-classes-wednesday",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Durschlag",
  "authorUrl": "",
  "termIds": [
    815,
    2303
  ],
  "sentences": [
    "In other developments:\n- Herschel Walker leads Georgia celebration as Bulldogs beat Alabama for national title\n- Alabama's Nick Saban delivers message to Georgia's Kirby Smart after national championship loss\n- Questionable Georgia fumble leads to Alabama score in pivotal national title game moment\n- Alabama's Jameson Williams leaves national title game with apparent knee injury\nCLICK HERE TO GET THE FOX NEWS APP\nTODAY'S MUST-READS:\n- Harmony Montgomery: Uncle says he tried to alert authorities about abuse for years\n- Rep. Jim Banks: Bidens response to Russia raises concern\n- Food delivery driver rescues shivering toddler wandering Detroit in the cold\n- New Mexico teen mom throws newborn in dumpster in shocking video\n- 'Rachel Maddow Show' worried Madison Cawthorn might ask to come on show if they asked him for comment: Email\nTHE LATEST FROM FOX BUSINESS:\n- Fed chair hammers home commitment to cooling red-hot inflation\n- JPMorgan CEO Dimon sees very strong economy this year\n- Jon Ossoff exploring bill to ban Congress stock trades, rebuffing Pelosi\n- Sen. Warren demands Federal Reserve release more details on trading scandal\n- Billionaire supermarket CEO warns of potential egg and meat shortage\nSOME PARTING WORDS\nLaura Ingraham told viewers of Foxs \"The Ingraham Angle\" Monday night, \"It's only January 10th, and the web of lies woven by American agents of disinformation is beginning to unravel for all to see now from the government's response to the pandemic, to our military leadership's failures and critical points in between.\"",
    "In other developments:\n- Democrat mayors and governors embrace remain-open approach to COVID after lecturing Republicans\n- Chicago Teachers Union blocks traffic around city hall to protest lockout\n- Chicago Teachers Union delegate vows to 'report' members who show up for work\n- Chicago Teachers Union president: 'Remote learning bad' is just a 'talking point' from mayor\n- 'The Five' rip Chicago Teachers Union for throwing children's classes into chaos over COVID: 'Illegal walkout'\nJPMorgan CEO Dimon sees very strong economy this year\nJPMorgan CEO Jamie Dimon has a good feeling about where the U.S. economy is headed.",
    "In other developments:\n- NAACP, BLM, other groups silent amid disappointing jobs numbers and rise in Black unemployment rate\n- Billionaire supermarket CEO warns of potential meat, egg shortage as omicron disrupts US supply chain\n- Half of teachers consider quitting jobs, survey shows\n- Americans' inflation fears stay at record high, New York Fed survey shows\nGeorgia tops Alabama to win college football national championship\nGeorgia quarterback Stetson Bennett fired two touchdown passes in the fourth quarter to help lift the Bulldogs to their first national championship since 1980, beating Alabama 33-18.",
    "Here's what you need to know as you start your day\nChicago schools will reopen after deal reached between union, city\nLori E. Lightfoot, the Chicago mayor, announced on Twitter late Monday that public school children in the city will be able to return to classes on Wednesday after leaders from the teachers union approved a plan with the district.",
    "After a questionable fumble call that led to an Alabama score earlier in the period, Bennett would regroup and toss a 40-yard touchdown pass to wide receiver Adonai Mitchell to put the Bulldogs back up.",
    "Jesse Sharkey, the president of the teachers union, told the Chicago Sun-Times that Lightfooot \"is being relentless, but shes being relentlessly stupid, relentlessly stubborn.\"",
    "The deal, which would have students in class Wednesday and teachers a day earlier, still requires approval by the union's full 25,000 members, according to the union.",
    "Fox News Go Watch page is now available, providing visitors with Pay TV provider options in their area carrying Fox News Channel and Fox Business Network.",
    "Dimon added, \"This will be one of the strongest economies we've ever seen in 2021, and 2022 will probably be pretty good, too.\"",
    "\"After a productive day at the bargaining table, I am pleased to report, CTU will end their work stoppage,\" the mayor tweeted.",
    "The public discord between the teachers union and the city was on display up until hours before the agreement was announced.",
    "\"CPS [Chicago Public Schools] put a great proposal on the table that both bargaining teams discussed in detail today.\"",
    "With 3:33 left, Heisman Trophy-winning quarterback Bryce Young would get the ball back to try to force overtime.",
    "The full interview with Dimon will air on FOX Business Networks \"Mornings With Maria\" on Tuesday.",
    "\"I think that the table is set for a very strong economy,\" he told FOX Business' Maria Bartiromo.",
    "\"That consumer has a lot of money, businesses have a lot of money, and they are spending it.\"",
    "Bennett would strike again later in the fourth with a 15-yard touchdown pass to Brock Bowers.",
    "Mitchell had two catches for 50 yards and Bowers had four catches for 36 yards.",
    "The game was a field goal battle in the first half with Alabama leading 9-6.",
    "Bennett finished 17-for-26 with 224 passing yards and two touchdown passes.",
    "This edition of Fox News First was compiled by Fox News' Jack Durschlag.",
    "Young would throw a Pick Six to Kelee Ringo, which would seal the deal.",
    "The union did not immediately respond to an email from Fox News.",
    "Thank you for making us your first choice in the morning!",
    "\"Confidence levels are going up,\" Dimon continued.",
    "Well see you in your inbox first thing Wednesday.",
    "Click here to find out what you're missing.",
    "Good morning and welcome to Fox News First.",
    "\"Jobs are plentiful, wages are going up.",
    "CLICK HERE FOR MORE ON OUR TOP STORY.",
    "Not signed up yet for Fox News First?",
    "It's pretty strong.\"",
    "CLICK HERE FOR MORE.",
    "CLICK HERE FOR MORE."
  ]
}