{
  "id": 8294,
  "mediaId": 718,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "Georgia wins first national title in 41 years, beating Alabama 33-18",
  "image": "https://cdn.vox-cdn.com/thumbor/FOHY_U9mIvZKVa-R2l-Drz1zDys=/0x0:3018x2012/2420x1613/filters:focal(1268x765:1750x1247):format(webp)/cdn.vox-cdn.com/uploads/chorus_image/image/70373225/1363933154.0.jpg",
  "link": "https://chicago.suntimes.com/2022/1/10/22877809/georgia-wins-first-national-title-in-41-years-beating-alabama-33-18",
  "sentiment": "0",
  "mediaOutlet": "Chicago Sun-Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ralph D. Russo | Associated Press",
  "authorUrl": "https://chicago.suntimes.com/users/ralph-d-russo-associated-press-cst",
  "termIds": [
    815,
    2235,
    5871,
    5891,
    5894,
    5589,
    5648,
    2537,
    2672,
    2711
  ],
  "sentences": [
    "INDIANAPOLIS  Stetson Bennett delivered the biggest throws of his storybook career and Georgias defense sealed the sweetest victory in program history, vanquishing rival Alabama 33-18 Monday night for its first national title in 41 years.",
    "Instead of going down with a little over a minute left, Ringo took off and behind a convoy of blockers and went 79 yards for a touchdown that set off a wild celebration by the relieved Georgia fans who packed Lucas Oil Stadium.",
    "Bennett complete all three of his passes for 68 yards, including a long strike to Mitchell for a touchdown with 8:09 left that gave the Bulldogs a 19-18 lead after a failed 2-point conversion.",
    "As he has done so many times during a career that started on the scout team and took a detour through junior college in Mississippi, the small-town Georgia kid nicknamed Mailman came through.",
    "We played a heck of a game against a heck of a team for the first three quarters of the game, said Saban, who was denied his eight national title, seventh with Alabama in the last 13 years.",
    "Bennett was 13 for 22 for 141 yards as the next drive started, and you could practically hear all skeptical Georgia fans wondering why Smart didnt turn to his four-star backup QB, J.T.",
    "The Bulldogs defense clamped down on Young, forcing a three-and-out on the Tides next drive, and then Georgia went to work on sealing a long-awaited championship.",
    "For most of the first three quarters, first CFP title game to be a rematch of a regular-season game was an ol fashion Southeastern Conference defensive struggle.",
    "After James Cook broke a 67-yard run to get the Bulldogs into the red zone, three more running plays  a facemask penalty by Alabama  got them into the end zone.",
    "Theres going to be some property torn up in Indianapolis tonight, Georgia coach Kirby Smart said, paraphrasing the late Georgia play-by-play man Larry Munson.",
    "Young finished 35 for 57 for 359 yards with two interceptions and was sacked three times after Georgia didnt bring him down one in the SEC title game.",
    "3 Georgia a 19-18 lead with 8:09 left and then hooked up with Brock Bowers for a 15-yard TD on a screen to put the Bulldogs up eight with 3:33 left.",
    "Surprisingly, the ruling on the field was a fumble, recovered by the Tide and replay upheld the call, giving the Tide the ball in the red zone.",
    "A few plays later, Young eluded the rush and found Cameron Latu for a 3-yard touchdown that put Alabama up 18-13 with 10:14 left in the fourth.",
    "The Bulldogs lost two SEC championship games to Alabama, including one five weeks ago, and the 2018 CFP title game to the Tide under Smart.",
    "Zamir White went in standing up from a yard out with massive defensive tackles Jalen Carter and Jordan Davis leading the way as blockers.",
    "Nick Sabans Crimson Tide had won seven straight against the Bulldogs, including the last four against Smart, Sabans longtime assistant.",
    "Once again, it felt like Georgia would not be able to break whatever spell Alabama seemingly had on the Bulldogs.",
    "I just saw the ball in his hands and that was all she wrote, said safety Lewis Cine, the games defensive MVP.",
    "After Alabama added another field goal, the Tide caught a break on strange looking turnover by the Bulldogs.",
    "Kelee Ringo intercepted an underthrown deep ball down the sideline by Heisman Trophy winner Bryce Young.",
    "The Bulldogs (14-1) hadnt won a national title since freshman Herschel Walker led them there in 1980.",
    "Bennett, the former walk-on turned starter, finished 17 for 26 for 224 yards and no interceptions.",
    "Smart returned to his alma mater as coach in 2016 and has been chasing his mentor ever since.",
    "As Bennett was being taken down deep in Georgia territory, he tried to throw the ball away.",
    "The only way home was through them, Smart said he told his team about the Crimson Tide.",
    "Nobody can take the SEC championship away from this team, the Cotton Bowl championship.",
    "Alabamas Drew Sanders casually caught the ball as he was jogging out of bounds.",
    "The ball slipped loose, and bounced toward the sideline, seemingly harmless.",
    "The first touchdown of the game came with 1:20 left in the third quarter.",
    "Bennett connected with Adonai Mitchell on a 40-yard touchdown to give No.",
    "If simply snapping the drought wasnt good enough, doing against No.",
    "I cried, so pretty good, Bennett said when asked how it felt.",
    "The final blow came from Georgias dominant defense.",
    "1 Alabama (13-2) had to make it feel even better.",
    "We just didnt finish the way we needed to finish.",
    "The Bulldogs led for the first time, 13-9.",
    "I told them we burned the boats.",
    "Mission accomplished.",
    "Daniels, for a spark."
  ]
}