{
  "id": 8302,
  "mediaId": 178,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "Georgia snaps 41-year title drought with 33-18 win over Bama",
  "image": "https://chorus.stimg.co/23160256/FBC_CHAMPIONSHIP_34.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/georgia-snaps-41-year-title-drought-with-33-18-win-over-bama/600134629/",
  "sentiment": "0.0",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "RALPH D. RUSSO Associated Press",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "__\nFollow Ralph D. Russo at https://twitter.com/ralphDrussoAP and listen at http://www.appodcasts.com\n___\nMore AP college football: https://apnews.com/hub/college-football and https://apnews.com/hub/ap-top-25-college-football-poll",
    "Stetson Bennett delivered the biggest throws of his storybook career and Georgia's defense sealed the sweetest victory in program history, beating Alabama 33-18 in the College Football Playoff for its first title in 41 years.",
    "Bennett completed all three of his passes for 68 yards, including a long strike to Mitchell for a touchdown with 8:09 left that gave the Bulldogs a one-point lead after a failed 2-point conversion.",
    "As he has done so many times during a career that started on the scout team and took a detour through junior college in Mississippi, the small-town Georgia kid nicknamed The Mailman came through.",
    "\"We played a heck of a game against a heck of a team for the first three quarters of the game,\" said Saban, who was denied his eight national title, seventh with Alabama in the last 13 years.",
    "Bennett was 13 for 22 for 141 yards as the next drive started, and you could practically hear all skeptical Georgia fans wondering why Smart didn't turn to his four-star back-up QB, J.T.",
    "For most of the first three quarters, the first CFP title game to be a rematch of a regular-season game was an ol' fashion SEC defensive struggle in the heart of Big Ten country.",
    "With just over a minute left, Ringo took off behind a convoy of blockers and went 79 yards, Smart chasing and yelling at him to go down so he wouldn't risk a fumble.",
    "After James Cook broke a 67-yard run to get the Bulldogs into the red zone, three more running plays  and a facemask penalty by Alabama  got them into the end zone.",
    "The Bulldogs' defense clamped down on Young, forcing a three-and-out on the Tide's next drive, and then Georgia went to work on sealing a long-awaited championship.",
    "Four decades of pent-up emotion were unleashed Monday night as the Bulldogs snapped a frustrating national championship drought by vanquishing their nemesis.",
    "Smart, a Bulldogs defensive back in the mid-1990s, returned to his alma mater in 2016 after helping Nick Saban build a dynasty as an assistant at Alabama.",
    "3 Georgia a 19-18 lead with 8:09 left and then hooked up with Brock Bowers for a 15-yard TD on a screen to put the Bulldogs up eight with with 3:33 left.",
    "All-American Jameson Williams went out early in the second quarter with a knee injury, and John Metchie III was injured in the SEC title game.",
    "\"There's going to be some property torn up in Indianapolis tonight,\" Smart said, paraphrasing the late Georgia play-by-play man Larry Munson.",
    "Surprisingly, the ruling on the field was a fumble, recovered by the Tide and replay upheld it, giving the Tide the ball in the red zone.",
    "And they did it the way Alabama has broken their hearts so many times in recent years: Coming from behind and finishing with a flourish.",
    "Zamir White went in standing up from a yard out with massive defensive tackles Jalen Carter and Davis leading the way as blockers.",
    "The sophomore finished 35 for 57 for 359 yards with two interceptions, playing without his top two receivers for most of the game.",
    "A few plays later, Young eluded the rush and found Cameron Latu for a 3-yard touchdown that put Alabama up 18-13 with 10:14 left.",
    "\"I've never been around a group of players that really wanted it so bad and wouldn't be denied,\" Georgia coach Kirby Smart said.",
    "The Bulldogs lost two SEC championship games, including one five weeks ago, and the 2018 CFP title game to Alabama under Smart.",
    "Georgia has become an elite program under Smart, but has not been able to chase down its Southeastern Conference rival.",
    "\"I just saw the ball in his hands and that was all she wrote,\" said safety Lewis Cine, the game's defensive MVP.",
    "Kelee Ringo intercepted an underthrown deep ball down the sideline by Heisman Trophy winner Bryce Young.",
    "\"You put as much time as we do in this thing, blood, sweat, tears,\" Bennett said, 'it means something.\"",
    "The Bulldogs (14-1) hadn't won a national title since freshman Herschel Walker led them there in 1980.",
    "The touchdown set off a wild celebration by the relieved Georgia fans who packed Lucas Oil Stadium.",
    "Bennett, the former walk-on turned starter, finished 17 for 26 for 224 yards and no interceptions.",
    "As Bennett was being taken down deep in Georgia territory, he tried to throw the ball away.",
    "Young was sacked three times after Georgia didn't bring him down once in the first meeting.",
    "\"Nobody can take the SEC championship away from this team, the Cotton Bowl championship.",
    "After Alabama added another field goal, the Tide caught a break on strange turnover.",
    "Once again, it seemed as if Georgia would not be able to break the 'Bama curse.",
    "\"This was for all the glory, we took it,\" defensive tackle Jordan Davis said.",
    "The ball slipped loose, and bounced toward the sideline, seemingly harmless.",
    "Alabama's Drew Sanders casually caught it as he was jogging out of bounds.",
    "Bennett connected with Adonai Mitchell on a 40-yard touchdown to give No.",
    "If simply snapping the drought wasn't good enough, doing it against No.",
    "\"I told the guys in the locker room, just take a picture of this.\"",
    "\"I cried, so pretty good,\" Bennett said when asked how it felt.",
    "The first touchdown came with 1:20 left in the third quarter.",
    "\"It's a little tough that I let them down today,\" Young said.",
    "After more than 40 years, it was Georgia's time to finish.",
    "Saban's Tide had won seven straight against the Bulldogs.",
    "The final blow came from Georgia's dominant defense.",
    "\"We just didn't finish the way we needed to finish.\"",
    "The only way home was through them,\" Smart said.",
    "INDIANAPOLIS  Confetti rained down on Georgia.",
    "The Bulldogs fans chanted \"Kir-by, Kir-by!\"",
    "The Bulldogs led for the first time, 13-9.",
    "1 Alabama (13-2) made it even better.",
    "\"I told them we burned the boats.",
    "\"I've got to do better with it.\"",
    "Mission accomplished.",
    "Daniels, for a spark.",
    "Until now."
  ]
}