{
  "id": 8313,
  "mediaId": 237,
  "date": "d2022-01-10T23:58",
  "headline": "Georgia defeats Alabama in college football championship nail-biter",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/938445.png",
  "link": "https://www.washingtonexaminer.com/news/georgia-defeats-alabama-in-college-football-championship-nail-biter",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Chaitin",
  "authorUrl": "https://www.washingtonexaminer.com/author/daniel-chaitin",
  "termIds": [
    815,
    5560,
    2537,
    2672
  ],
  "sentences": [
    "After a first half of only field goals by both teams, including three by Alabama's Will Reichard, Georgia took its first lead in this game, 13-9, at the end of the third quarter with running back James Cook making a 67-yard run followed by running back Zamir White carrying the ball into the end zone.",
    "The Bulldogs have not won a national championship since 1980, when Herschel Walker, who is now a candidate for the U.S. Senate, helped carry the team to victory as running back.",
    "A last-ditch drive by Alabama in the final two minutes ended with an interception by defensive back Kelee Ringo, who ran it back for a touchdown.",
    "The Georgia Bulldogs pulled off a close victory over the Alabama Crimson Tide in the college football championship game Monday night.",
    "The win carries immense significance for Georgia, which has lost the last seven times its team faced Alabama.",
    "The final quarter was a brawl, with the score remaining close until the final moments.",
    "That left than than a minute in the game, not enough time for a comeback.",
    "The championship game was played at Lucas Oil Stadium in Indianapolis.",
    "Alabama is a regular winner of the prize, last winning in 2020.",
    "When time ran out on the clock, the final score was 33-18.",
    "Both teams had a 13-1 record in the regular season.",
    "!#NationalChampionship,\" Walker said in a tweet.",
    "\"When you make a DAWG mad, they will bite back!!",
    "CONGRATS to the @GeorgiaFootball DAWGS!!"
  ]
}