{
  "id": 8324,
  "mediaId": 12,
  "date": "1/9/2022 12:00:00 AM",
  "headline": "Champion 1980 Bulldogs have waited long enough for company",
  "image": "https://www.ajc.com/resizer/KT4t4CzOsER-vp13Gh83KCAdqho=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/YS5IDCQRZUMR27NVFA4VSEDKNA.JPG",
  "link": "https://www.ajc.com/sports/further-review-blog/champion-1980-bulldogs-have-waited-long-enough-for-company/WOSYNNTVO5AITAWVLOAIEI44FY/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Hummer",
  "authorUrl": "https://www.ajc.com/staff/steve-hummer/",
  "termIds": [
    815
  ],
  "sentences": [
    "So, it was of no surprise earlier this week when Jackson was asked about Lindsay Scott  who authored the greatest single play of Georgias 1980 championship season, the miracle 93-yard reception against Florida  that the reference sailed high over his head.",
    "The opponent this time  Alabama, led by a Heisman-winning quarterback and a coach who has rewritten the physics of winning in Einsteinian ways  is a much sterner challenge than was Notre Dame, the final opponent of that 80 season.",
    "What I feel is how do we stop Bryce Young and how do we control their front and how do we run the ball, how do we throw the ball with efficiency, how do we convert third downs and stop them in the red area, Smart said.",
    "Monday night inside Lucas Oil Stadium comes the next best chance to build a bookmark moment for the Bulldogs, one that might rival 1980 as a frame of reference for their followers for generations to come.",
    "What is out there in the short term for Georgia is a title won on the recommendation of an overwhelming regular season and confirmed by beating the source of so many tears and shortfalls, Alabama.",
    "As Jackson himself said of what awaits these Dogs should they vanquish Bama, We have to go make a statement so we can be the next ones that people are going to be talking about, the 2021 team.",
    "Asked Sunday about how much thought he gives the possibility of Monday being a legacy game, Georgia coach Kirby Smart couldnt put enough distance between himself and that thought.",
    "This is how he tackles the subject of trying to measure up to a 41-year-old memory: I know Lindsay Scott, hes from Wayne County, down there from where Im from.",
    "Frank Ros, a middle linebacker and team captain of the 1980 team, is forever talking about how Georgia has waited long enough for another championship.",
    "On the grander scale, what is in reach for these Bulldogs is the opportunity to cast themselves in bronze as a forever team, as did the 1980 bunch.",
    "In the face of such heavy possibilities, maybe thats why those with a chance to author history dare not look beyond the hard work of Monday night.",
    "So, to recap: Yes, seems like forever, thats how long Georgia has been waiting for another night like Jan. 1, 1981 at the Sugar Bowl.",
    "INDIANAPOLIS  To the bulk of those as young as, say, Georgia receiver Kearis Jackson (22), 1980 might as well be the Pleistocene Age.",
    "Ah, but hell be back in the Atlanta area watching intently, and as hopeful as he has been at any time in the last four decades.",
    "To be the first (championship team) since the drought, I tell people, youll be a Georgia legend, linebacker Nolan Smith said.",
    "Through such exchanges, the great span of time since the Bulldogs last national championship is made even clearer.",
    "Just because the specifics can sometimes get lost in the mist, that doesnt mean the ideal of 1980 ever vanishes.",
    "When you get to the finals of any championship you have to be at your best or you dont have a chance.",
    "Thus has the 1980 captain cleared room on the pedestal upon which the last championship team stands.",
    "Why, back then they were just imagining cellphones the approximate size and weight of paving stones.",
    "And I grew up listening to (late radio voice) Larry Munson highlights on YouTube, all his calls.",
    "I guess I do know the magnitude for everybody else out there because I was a fan at one point.",
    "Hes a South Georgian, with a better feel than most in that locker room for Bulldogs history.",
    "But theres a point in time when you become a player that you cant really be a fan anymore.",
    "Those Irish had a quarterback named Blair Kiel, who was solid but was nobodys Bryce Young.",
    "Its amazing a storied program like Georgia has not been able to win another one, he said.",
    "Quarterback Stetson Bennett is one win away from becoming a certified Georgia legend.",
    "Others feel a little freer to admit they see outside the narrow tunnel of game day.",
    "Talked to (1980 quarterback) Buck Belue and a few other guys on the team.",
    "(Definition of a minor surgical procedure: Any surgery youre not having).",
    "Somewhere between getting your learners permit and the birth of a child.",
    "Theyre beckoning 2021 to take a step up, to lend glory some new blood.",
    "We feel like we have an opportunity, but we have to play to our best.",
    "The Jetsons was a fantasy cartoon in 1980, but a documentary today.",
    "Such is the life of a coach, existing in the prison of the moment.",
    "I think everybody is thinking that were ready to win one, he said.",
    "Recovering from minor surgery, Ros wont be in Indy for the game.",
    "And Herschel Walker is not walking through that door, fans.",
    "Lindsay Scott, Lindsey Buckingham - all the same to him.",
    "We came in to be legendary, be special, leave your mark.",
    "This second coming of a modern title is long overdue.",
    "Weve been wanting company for a long time, Ros said.",
    "Forty-one years, its a generation (plus some).",
    "And I dont really know when that switch was.",
    "Streaming was something only water did.",
    "And obviously I know Herschel.",
    "Yeah, a pretty big life event.",
    "I know its a pretty big deal.",
    "At least not in pads."
  ]
}