{
  "id": 8327,
  "mediaId": 43,
  "date": "1/9/2022 12:00:00 AM",
  "headline": "our current voting rights threats",
  "image": "https://images.dailykos.com/images/1024823/story_image/StateTroopers.png?1641670756",
  "link": "https://www.dailykos.com/story/2022/1/9/2010879/-Georgia-s-U-S-Senators-and-our-current-voting-rights-threats-remind-me-of-Driving-Miss-Daisy",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Those thrill of those triumphs was soon followed by a severe throttling of voting rights in Georgia, by the rise of Marjorie Taylor Green (she of the Jewish Space Lasers) and by the widespread Republican endorsement of Herschel Walker as Warnocks 2022 opponent.",
    "Authors note: I realize that there is controversy in some circles about films such as Driving Miss Daisy, Green Book and others which present racially sensitive issues with themes that can be considered focused on white saviors.",
    "This article is not about the merits of the film, but merely pointing to a specific scene to show how things CAN temporarily change for the better, while always being on the precipice of falling backwards.",
    "Watching Jon Ossoff, a young Jewish son of Georgia, and Raphael Warnock, a middle aged African-American preacher, take the oath of office in the Senate on January 20, 2021 was pure joy for my wife and me.",
    "We watched in horror during the 2002 mid-terms as Senator Max Cleland, a decent, patriotic man (a Vietnam veteran and multiple amputee) was cast out of office in a red wave of post 9/11 anger.",
    "At the time, we hoped those victories would have broad and profound implications for the causes of religious tolerance and racial justice in Georgia and throughout the South.",
    "In the scene, the wealthy Jewish widow (Jessica Tandy as Miss Daisy) and her well-dressed chauffer are questioned by Alabama state troopers at the side of the highway.",
    "We lived in Atlanta two decades before that and had our fill of the dichotomy of a progressive, diverse Atlanta area surrounded by a countryside of white bigotry.",
    "The tenuous nature of gains in the long arc of history (as Barack Obama called it) is exemplified by the irony of a long-forgotten scene from Driving Miss Daisy.",
    "(Walker is remembered in Georgia for his gridiron feats, but he really is nothing but a financial dead-beat, a woman beater and an Uncle Tom personified.)",
    "Does anyone remember the scene where two State Troopers belittle Hoke (Morgan Freeman) and Miss Daisy (Jessica Tandy)?",
    "Isn't that Something\" - The same sentiment is probably felt by many rural Georgians today about their U.S.",
    "So Ossoffs and Warnocks election victories were a sweet measure of retribution.",
    "From Schmoop:\nBefore they can leave, two white cops ask Hoke about the car.",
    "Out of earshot, the police call them a \"n*****\" and an \"old Jew.\"",
    "The cops seem disgusted that everything is in legal order.",
    "It shows how bigotry persists even in the face of dignity.",
    "In Georgia, and elsewhere, it seems not much has changed.",
    "Daisy says it's her car and provides the registration.",
    "Hoke is only guilty of driving while black.",
    "Evidently not much has changed in 65 years.",
    "Shaken by the encounter, Hoke drives away.",
    "They ask about her strange last name.",
    "She says it's of German derivation.",
    "Welcome to the South in 1957.",
    "Welcome to the South in 2022.",
    "But the joy was short lived.",
    "\"A n*****and a Jew.",
    "Welcome to Alabama.",
    "Senators."
  ]
}