{
  "id": 8332,
  "mediaId": 323,
  "date": "d2022-01-07T11:00",
  "headline": "Georgia Football Has an Alabama Problem",
  "image": "https://images.wsj.net/im-463571?width=860&size=1.4988290398126465&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/georgia-alabama-college-football-playoff-national-championship-11641518058",
  "sentiment": "0.0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laine Higgins",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Photo: Brynn Anderson/Associated Press\nGeorgia coach Kirby Smart, who won three championships with the Crimson Tide as defensive coordinator before taking over in Athens in 2015, emphasized his teams losing streak does not make them unique.",
    "Not only have the Crimson Tide won seven straight against the Bulldogs, nearly all of those wins have come in games of major consequence: three Southeastern Conference championships and one previous national title game.",
    "Thats the Georgia fans default setting: Man, weve got a good game, but heres what could happen that goes wrong, said Matt Stinchcomb, a former offensive lineman for the Bulldogs in the 1990s and ESPN analyst.",
    "He [Saban] has a machine that is a problem for everybody, and it is a problem for us at very close range, said Amanda Mull, a writer for The Atlantic who says she attended her first Georgia game in the womb.",
    "According to Coffey, a national sales manager based in Durango, Colo., who podcasts about Georgia football on the side, that game was one of the most psychologically scarring for Bulldogs fans.",
    "Alabama has eight SEC crowns and six rings under Saban; Georgia has a 41-year title drought and increasingly dusty memories of Herschel Walker leading the team to glory in 1980.",
    "Coffey remembers an even bleaker scene at the SEC Championship in 2012, the first time Alabama successfully mounted a last-minute comeback to crush Georgias championship bid.",
    "At the same time, they have none of the rings or hardware to show for it because their path to greatness always runs directly into the buzz saw that is Sabans Crimson Tide.",
    "Since 2007, seven Crimson Tide receivers have heard their names called on the opening night of the draftfour more than the schools tied for second most, Clemson and LSU.",
    "Either beating a Saban-led Alabama or winning a championship would cement the legacy of this 2021 Bulldogs team and release years of pent up psychological pressure.",
    "Georgia fans have accumulated a lot of baggage since that night in Tuscaloosa and theyre bringing it all to Monday nights championship rematch against Alabama.",
    "Georgias team also has a considerably stronger veteran presence than Alabama, a group led by a sophomore quarterback whose youth Saban has stressed all fall.",
    "The Bulldogs have held leads deep into the second half of four of these games, only to see victory slip away in the final minutes of regulation or overtime.",
    "Graham Coffey has been going to Georgia football games since he was 7 years old, yet few stand out like one during his first semester of college in 2007.",
    "The Bulldogs have had nine seasons with 10 wins or more, won their division of the SEC six times and appeared in the College Football Playoff twice.",
    "Nascar driver Chase Elliott, a Georgia fan who was also on hand for that game, distinctly remembers the dread he felt as the clock ticked down.",
    "Smart also pointed to the seemingly never-ending cast of Alabama wide receivers that went on to be first-round picks in the NFL draft.",
    "The momentum had just shifted so much you could feel it in the building as a fan, said Elliott, the 2020 Nascar Cup Series champion.",
    "Saban swapped quarterbacks, trotting out untested freshman quarterback Tua Tagovailoa, and the Tide clawed back to tie the game.",
    "Sitting in the nosebleed seats at Alabamas famed Bryant Denny Stadium, he saw a scoreboard that read Georgia 26, Alabama 23.",
    "All the Alabama fans were stunned because this was their first loss under Nick Saban and he was the savior, Coffey said.",
    "Fans were still high-fiving when Tagovailoa dropped a touchdown pass into the hands of Devonta Smith to win the game.",
    "Doing both at once would be like a dam holding 41 years of Georgia fans frustration and neuroses suddenly bursting.",
    "Four of those receivers were on the field in 2018, the last time these two teams met in the national championship.",
    "Indeed, the Crimson Tide committed fewer turnovers than Georgia in five of the teams seven meetings since 2008.",
    "Alabama receiver DeVonta Smith scores the winning touchdown in overtime of the 2018 national championship game.",
    "Write to Laine Higgins at laine.higgins@wsj.com\nCopyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "The defense is historically dominant while the offense has grown sharp under quarterback Stetson Bennett IV.",
    "It isnt as if Georgia has struggled on the field since their last win over Alabama during Sabans first year.",
    "Im used to being a competitor on the trackbut as a fan it just hurts because you cant do anything about it.",
    "Coincidentally those teams are the only ones to beat Alabama in consequential games in the Saban era.",
    "In a cruel moment of symmetry, the score of that game was also 26-23, this time with Alabama on top.",
    "He was in the stands at Mercedes-Benz Stadium in Atlanta as Georgia built a 13-0 lead at halftime.",
    "Theyve also been a problem and a thorn for any team theyve played besides ours, he said on Monday.",
    "Their positivity doesnt come from the knowledge that Saban is 70 years old and cant coach forever.",
    "Georgia is perhaps the most consistent and most talented team not named Alabama during that span.",
    "Smart offered two theories for Alabamas dominance: First, they have won the turnover battle.",
    "Im talking grown adults on the verge of tears, children sobbing, dead silent, Coffey said.",
    "I remember walking out into that Atlanta night and thinking, Well Im going on a bender.",
    "This season, Georgia fans are balancing their dread with an unusual feelingoptimism.",
    "Photo: Curtis Compton/Associated Press\nThe feeling of disappointment was familiar.",
    "Then again, they were favored by 6.5 points in the SEC title game and lost 41-24.",
    "Things were going well and he remembers entertaining an unfamiliar feeling: hope.",
    "On Alabamas first play, the Bulldogs got a massive sack to set up second and 26.",
    "There is a sense that this is a very good opportunity that we should not waste.",
    "I didnt think it would be another 14 or 15 years before I saw that again.",
    "That was tough, recalled Jake Fromm, Georgias quarterback at the time.",
    "Georgia got the ball first in overtime and settled for a field goal.",
    "Smart has recruited talent that can stack up to the Crimson Tide.",
    "Georgia coach Kirby Smart chats with Alabama coach Nick Saban.",
    "What makes me nervous is not Georgia being down, Coffey said.",
    "The Bulldogs are favored by 3 points in Mondays title game.",
    "All of a sudden confetti starts flying and its not for you.",
    "Then Alabama returned from halftime in full dementor mode.",
    "I dont know if its dread, but I do know this: Its caution.",
    "I dont think there is a now or never feeling, Mull said.",
    "What makes me nervous is when everything is going well.",
    "Rather, its from the strength of the Bulldogs play.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "The writing was on the wall."
  ]
}