{
  "id": 8334,
  "mediaId": 65,
  "date": "1/6/2022 12:00:00 AM",
  "headline": "Fight for Senate majority looms one year after Dems won Georgia",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/e8a13f28-800b-4d0a-8e21-d609bbb344e5/d013c04e-fec9-4dea-9e5a-d77a43b9f37e/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/fight-senate-majority-looms-year-dems-won-georgia",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caitlin McFall",
  "authorUrl": "https://www.foxnews.com/person/m/caitlin-mcfall",
  "termIds": [
    815,
    1133,
    1147,
    1158,
    1174,
    1765,
    2087,
    428,
    571,
    2672
  ],
  "sentences": [
    "SOME DEMOCRATIC OPERATIVES KEEP TARGETING TRUMP EVEN AFTER VIRGINIA ELECTION SETBACKS\n\"Im going to need all the help I can get in order to keep my seat at the table so I can continue to fight for things that matter in our country,\" Sen. Raphael Warnock said in a video posted Wednesday.",
    "TWO GOP SENATORS HAVE YET TO SAY IF THEY'RE RUNNING FOR REELECTION IN NOVEMBER\nBiden flipped what was once known as the \"blue wall\" in the Midwest, after it became Trump terrain when Michigan, Pennsylvania and Wisconsin helped secure him the 2016 presidency.",
    "Democrats have already taken to social media to push their support of Warnock, as challengers like former football star Republican Herschel Walker and former Trump national security official Latham Saddler line up in an attempt to unseat him.",
    "One year after Senate Democrats won the traditionally red state of Georgia, lawmakers took to Twitter to ramp up what will likely be one of the most coveted races in determining who controls the upper chamber in just 11 months.",
    "With a 50-50 split Senate, Democrats will need to hold onto every seat they have or make gains elsewhere in order to hold onto their majority status with Vice President Kamala Harris as the Senate tie-breaker.",
    "The Keystone State, which voted for President Biden, is likely to be one of the most contested races between the parties as Democrats look to one of the few states where it may be able to pick up a seat.",
    "Georgia's races are sure to drive national attention once again as Democratic darling Stacey Abrams has said she will be vying for governor, which could help drive minority voters to the ballot box.",
    "Biden took Wisconsin by a .7 percent margin, but the narrow win was similarly secured by his predecessor in the 2016 race when Donald Trump won a .7 percent margin victory over Hillary Clinton.",
    "Arizona Democrat Sen. Mark Kelly, who, like Warnock, won his Senate seat during a 2020 special election, will be rejoining the fight in a state that still holds strong Trump leanings.",
    "GOP Sen. Ron Johnson, who has not said whether he will retire or seek reelection, could also face a tough fight in Wisconsin as the swing state flipped to Biden in 2020.",
    "And the announcement by North Carolina Republican Sen. Richard Burr that he will retire has spurred Democrats to take up the challenge in the traditionally red state.",
    "Arizona helped secure the Biden presidency, though the once Republican stronghold-turned-swing state means Kelly will face fierce competition to hold onto his job.",
    "As the GOP looks to hold its two vulnerable seats in Pennsylvania and Wisconsin, they will also grapple with states that have trended less red in recent elections.",
    "Republicans will be vying to hold onto Pennsylvania Sen. Pat Toomeys seat as the longtime GOP lawmaker is set to retire at the end of his term in January 2023.",
    "\"They think that because Mitch McConnell and Donald Trump are focused on this seat, trying to take it back for the Republicans, that I dont stand a chance.\"",
    "Warnock is expected to face a tough battle in his upcoming fight for the Senate after his Jan. 6, 2021 victory over then-sitting Sen. Kelly Loeffler.",
    "Michigan will not see any Senate races in 2022 after reelecting Democrat Sen. Gary Peters in November 2020 and backing Biden for the top job.",
    "The fight for the Senate majority is in full swing as lawmakers seek to maintain or flip key seats in the 2022 midterm races.",
    "Democrats are also fighting to keep two seats in Nevada and New Hampshire, both of which are firmly purple states.",
    "The 2022 midterm races will open up 20 GOP Senate seats and 14 Democratic seats for election.",
    "Florida Sen. Marco Rubio could see a tough fight from Democratic challenger Val Demings.",
    "But Senate races in Pennsylvania and Wisconsin are expected to be fiercely fought over.",
    "But Warnock is not the only senator trying to hold onto a vulnerable seat.",
    "\"There are a lot of folks who are already counting me out,\" he continued."
  ]
}