{
  "id": 8339,
  "mediaId": 43,
  "date": "1/5/2022 12:00:00 AM",
  "headline": "Democrats' Chances of Winning the Senate just Rose to 51.5%, the Highest since Virginia. Here's why:",
  "image": "https://images.dailykos.com/images/799107/story_image/AP_20042747699616.jpg?1588261592",
  "link": "https://www.dailykos.com/story/2022/1/5/2072807/-Democrats-Chances-of-Winning-the-Senate-just-Rose-to-51-5-the-Highest-since-Virginia-Here-s-why",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    886,
    1119,
    1147,
    1469,
    1765,
    5930,
    146,
    571,
    2953
  ],
  "sentences": [
    "I run a Senate Forecast at RacetotheWH, and Democrats chances of holding on to the majority just rose to their highest level, 51.5%, since the New Jersey and Virginia elections last November.",
    "Now that Trump is doing an even with Masters, I imagine it's more likely than not Masters win Trump's endorsement, so I increased the odds that he is the nominee.",
    "You can also check out how the different potential GOP nominees poll and perform in the forecast against Mark Kelly in our AZ interactive forecast.",
    "My forecast is not impressed by Masters candidacy in the general election, and it thinks he would only have a 31% chance of beating Mark Kelly.",
    "For the full Senate Forecast  which was more accurate at predicting the final margin in the Senate than Nate Silvers 538 last year  click here.",
    "Trump is supporting weak candidates like Herschel Walker, and perhaps deterring stronger ones from even running (GA, NH & PA come to mind).",
    "Trump would prefer Republicans in charge, but his primary objective is to elevate loyalists and control the party, especially the Senate.",
    "I suspect the blatant refusal of over 80% of GOP Senators to support his attempts to overturn the electoral college looms large here.",
    "The problem for the GOP is that Trump loyalists, especially those that are first-time politicians, are not the strongest candidates.",
    "Masters would be a huge drop-off for the GOP compared to the current primary front-runner, Attorney General Brnovich.",
    "It looks like Republicans might get another bad break in the primaries, this time at the hands of Donald Trump.",
    "Poll\n 1112 votes Show Results\n Do you think Donald Trump is hurting the GOP's chance of winning the Senate?",
    "Brnovich has already shown he can win tough elections, winning a second term in 2018.",
    "Republicans chance of winning Arizona shrinks to 31% if Blake Masters is the nominee.",
    "If the GOP narrowly loses the Senate, he's going to be a big part of the reason why.",
    "Do you think Donald Trump is hurting the GOP's chance of winning the Senate?",
    "Master is polling 10% behind Kelly and has never run for office before.",
    "He's doing a fundraiser with Arizona Senate candidate Blake Masters.",
    "The forecast thinks he would have a 52% chance of beating Kelly.",
    "AZ Forecast\nThis is becoming a real problem for Republicans.",
    "It's a difference in strategic goals among party leaders.",
    "Mitch McConnell wants to win back the Senate majority.",
    "Yes\n No\n 1112 votes Vote Now!",
    "Yes\n 92%\n1023 votes\nNo\n .",
    "8%\n89 votes"
  ]
}