{
  "id": 8365,
  "mediaId": 302,
  "date": "d2022-05-26T00:00",
  "headline": "Trump is in the past': Mounting losses show limits of power",
  "image": "https://www.tampabay.com/resizer//-r7NH23OvifR5Qj3iqoGfyW2mX4=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/SEJG4WUY7B4BHZ3TTJ6HEIVTN4.jpg",
  "link": "https://www.tampabay.com/news/nation-world/2022/05/25/trump-is-in-the-past-mounting-losses-show-limits-of-power/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.tampabay.com/author/associated-press",
  "termIds": [
    815,
    896,
    1147,
    1801,
    2095,
    2555,
    2672,
    2834,
    6074
  ],
  "sentences": [
    "Trump faced a series of setbacks in Tuesday's primary elections as voters rejected his efforts to unseat two top targets for retribution: Georgia's Republican governor and secretary of state, both of whom had rebuffed Trump's extraordinary pressure to overturn the results of the 2020 presidential election.",
    "Trump sought to play down the losses by his favored candidates, saying on his social media platform Wednesday that he had a very big and successful evening of political Endorsements and insisting some races were not possible to win.",
    "Former Vice President Mike Pence, who has been distancing himself from Trump, rallied with Kemp in suburban Atlanta on Monday evening and told the crowd that elections are about the future  an implicit knock on his former boss.",
    "They argue that voters may support the former president and be eager for him to run again, but may not be persuaded by his selections, especially in races with governors such as Kemp who have long histories with voters.",
    "WOODSTOCK, Ga.  Donald Trump opened May by lifting a trailing Senate candidate in Ohio to the Republican nomination, seemingly cementing the former president's kingmaker status before another possible White House run.",
    "And even without Trump on the ballot, the party has been transformed in Trump's image, with candidates adopting his America First platform, mimicking his tactics and parroting his lies about a stolen election.",
    "Other Republicans grouse that precious time and money have been wasted on an ego-driven Trump vengeance campaign, forcing incumbents to defend themselves in primaries rather than focus on general elections.",
    "Hogan, a Trump critic, said that, so far, the races have been a bit of a mixed bag,\nWe're in the middle of a battle for the soul of the Republican Party and quite frankly the battle's not over yet, he said.",
    "Nearly six years after the onetime reality television star launched what seemed to be an improbable campaign for the White House, the Make America Great Again movement Trump helmed isn't going anywhere.",
    "Georgia Secretary of State Brad Raffensperger, who defied Trump's call to find the votes to change the outcome two years ago  a call that is now under investigation  also won his party's nomination.",
    "Trump has endorsed in nearly 200 races, from governor to county commissioner, often inserting himself into contests that aren't particularly competitive and helping bolster his compilation of wins.",
    "But the magnitude of defeat in the governor's race  more than 50 percentage points  was especially stunning and raised questions about whether Republican voters are beginning to move on from Trump.",
    "I do believe Trump has an important voice still, she added, but he needs to get better advisers, and in addition to that, he needs to do better himself in remembering why we aligned with him.",
    "There's no question unnecessary fights with kind of the extremes of the party, of Trump's grievance party, have made it more difficult for us to win in November, said Maryland Gov.",
    "Trump has also spawned a new generation of candidates who have channeled his MAGA brand, but who have done so independent of his support and see themselves as its next iteration.",
    "She argued that Trump had succeeded in 2016 because he aligned himself with voters' concerns and said out loud what people were already thinking, particularly on immigration.",
    "In Alabama, Rep. Mo Brooks, whose Senate endorsement Trump rescinded as he struggled to gain traction, made it to a runoff, having gained support after Trump dropped him.",
    "But his biggest upset was in Georgia, a crucial swing state, where former Sen. David Perdue, whom Trump had lobbied to run and helped clear the field for, lost to Kemp.",
    "Republicans such as the conspiracy-embracing Rep. Marjorie Taylor Greene, who won her party's nomination for reelection Tuesday, have taken up his mantle in Washington.",
    "And that means it's less powerful than it was when he was president and it seemed like a fait accompli when he endorsed, said Mike DuHaime, a longtime GOP strategist.",
    "His early support helped football great Herschel Walker and Rep. Ted Budd sail to their respective Senate primary nominations in Georgia and North Carolina.",
    "MAGA doesn't belong to him, Kathy Barnette, the Pennsylvania Senate candidate whose late-stage surge stunned party insiders, said in an interview.",
    "After JD Vance vaulted from third to first place following Trump's late-stage endorsement in the Ohio Senate primary, the dynamics took a turn.",
    "They worry Trump has elevated some candidates who may prove unelectable in the November general election and has exacerbated divisions.",
    "Fox News host Tucker Carlson, the most watched personality on cable television, has becoming a driving ideological force in the party.",
    "Trump's pick in Nebraska's primary for governor, Charles Herbster, lost his race after allegations surfaced that he had groped women.",
    "But with Trump out of office and relegated to posting on his own social media platform, other voices are beginning to fill the void.",
    "And in Pennsylvania, a marquee Senate primary featuring Trump-endorsed celebrity heart surgeon Mehmet Oz remains too close to call.",
    "The governor was among Trump's top targets after he refused to overturn the results of the 2020 White House election in his state.",
    "Attorney General Chris Carr and Insurance Commissioner John King  both opposed by Trump  were also successful in their primaries.",
    "Some allies say Trump's endorsement tally is a poor measure of his influence, even if Trump constantly promotes that record.",
    "Still, he acknowledged that Trump is still the most influential person in the party, even if that influence has waned.",
    "While the left, she said, may see the MAGA movement as a cult of Trump voters, she said it goes far beyond one man.",
    "Sarah Huckabee Sanders, Trump's former press secretary, easily won the GOP nomination for governor in Arkansas.",
    "Larry Hogan, a potential 2024 GOP presidential candidate who has been working to protect incumbent governors.",
    "I like Trump a lot, but Trump is in the past, said David Butler of Woodstock, Georgia, who voted for Gov.",
    "In North Carolina, voters rebuffed Trump's plea to give a scandal-plagued congressman a second chance.",
    "He's ending the month, however, stinging from a string of defeats that suggests a diminishing stature.",
    "And even in Georgia, all of the candidates Trump endorsed in open races won or will head to runoffs.",
    "The Trump endorsement is helpful but it is not something that by itself can put anyone over the top.",
    "Brian Kemp on Tuesday and said Trump's endorsements had no impact whatsoever on his thinking.",
    "But voters are increasingly vocal in saying that the party's future is about more than Trump.",
    "It was the same for Will Parbhoo, a 22-year-old dental assistant who also voted for Kemp.",
    "Meanwhile, potential presidential rivals to Trump are waiting in the wings for 2024.",
    "And I think he needs to remember that so that his voice can remain relevant.",
    "Others are more confident in saying Trump's power has diminished over time.",
    "Some of his work, even in races with multiple candidates, has paid off.",
    "In Idaho a week later, the governor beat a Trump-backed challenger.",
    "Still, the pattern of high-profile defeats is hard to ignore.",
    "I don't think we can say exactly what the outcome is yet.",
    "And it wasn't because we were aligning with his values.",
    "With all the election stuff, I was like Dude, move on.'",
    "And I think we still have many more primaries to go.",
    "One thing Parbhoo liked about the current governor?",
    "By JILL COLVIN and JEFF MARTIN, Associated Press.",
    "I'm not really a Trumper, he said after voting.",
    "It was because he was aligning with our values.",
    "She said she tried in her race to do the same.",
    "Kemp is focused on Georgia, he said.",
    "Looking for real-time news alerts?",
    "I didn't like him to begin with.",
    "Colvin reported from New York.",
    "Trump coined the word.",
    "He does not own it."
  ]
}