{
  "id": 8426,
  "mediaId": 881,
  "date": "5/27/2022 12:00:00 AM",
  "headline": "Trump's Candidates Took a Beating in GeorgiaBut Don't Get Too Excited",
  "image": "https://video-images.vice.com/articles/6290e5fe4f8f30009bba3471/lede/1653663286074-gettyimages-1399107165.jpeg?crop=1xw:0.8458646616541353xh;center,center&resize=1000:*",
  "link": "https://www.vice.com/en_us/article/wxdwpn/trumps-candidates-took-a-beating-in-georgiabut-dont-get-too-excited",
  "sentiment": "0",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Todd Zwillich",
  "authorUrl": "https://www.vice.com/en/contributor/todd-zwillich",
  "termIds": [
    815,
    1147,
    2095,
    2203,
    2283,
    2303,
    3102,
    4325,
    6152,
    428,
    510,
    2550,
    2672
  ],
  "sentences": [
    "The committee will have to show that all the episodes revealed over the past yearthe months of tweets flooding stolen-election lies into the mainstream, the schemes to send fake electors from swing states to Washington (which federal prosecutors are already sniffing at), the gaps in White House phone records while violence raged at the Capitol, the plot to pressure VP Mike Pence into helping steal the election, the effort to turn the DOJ into a justice-subverting coup factory, the maneuvering to cajole state legislators into deleting votes, the wheedling of Georgia officials to find votes, and, yes, the textsall combine into a picture of a criminal conspiracy the committee believes demands prosecution in the name of protecting the Constitution and the republic.",
    "The chair of the Seminole County (Florida) GOP, a political consultant (with a record), and a former state Senate candidate were all arrested and charged with multiple felonies behind a ghost candidate scheme designed to draw support away from a local Democrat in 2020.",
    "Committee members know these hearings are their last, best chance to make a clear, easy-to-follow case to the TV- and internet-viewing public that Trump and his lieutenants committed crimes as they plotted to subvert the voters' will and preserve Trump's power.",
    "But since a federal appeals court has ruled that the 1872 Amnesty Act doesn't bar Constitutional challenges to members of Congress under 14A, other lawmakers who may have participated in Jan. 6 are now likely fair game for challenges too.",
    "He also said it was clear that people at the highest levels of the Republican Party no longer wanted him to serve on the panel, which Republicans have targeted for abolition after Biden won their state by more than 20,000 votes.",
    "A Republican on the beleaguered Wisconsin Election Commission (WEC) abruptly resigned Wednesday, apparently forced off the bipartisan body by fellow Republicans because he refused to advance their 2020 election conspiracies.",
    "THE NEW YORK TIMES\nBy signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "At first glance, that's just another example of the level of Trump's vitriol for those he considers disloyal; at second glance, it's a shocking instance of a U.S. president contemplating the summary execution of his veep.",
    "Peters was supposed to be arraigned on five misdemeanors and six felony counts stemming from her alleged scheme to impersonate a state worker and compromise voting machines, but a judge put the arraignment off this week.",
    "The panel has begun telegraphing the game plan for its long-awaited public hearings, where they'll try to make the case that Jan. 6 was the culmination of a broader criminal conspiracy to overturn the 2020 election.",
    "S.S. minnow  The leader of the neo-Nazi terror group The Base was sentenced to four years in prison this week, after plotting mayhem and violence against minorities, police, and media outlets, including VICE News.",
    "- Georgia GOP Senate nominee Herschel Walker, asked about Donald Trump's assertions that the 2020 election was stolen\nTrainWEC  Wisconsin's bid to be the swing-state king of stolen-election destruction continues.",
    "In Michigan, the state elections bureau has concluded that half of the GOP primary field for governor should be disqualified from the Aug. 2 election after the discovery of a massive signature fraud scheme.",
    "Within a day, we learned that the revelation came from former Meadows staffer Cassidy Hutchinson, who told the committee she observed Meadows torching docs after meeting with Pennsylvania Rep. Scott Perry.",
    "Longwell spends the bulk of her time running Republican and independent voter focus groups, looking for the messages that can draw those voters away from Trumpism and toward the Democrats challenging it.",
    "This content comes from the latest installment of our weekly Breaking the Vote newsletter out of VICE News' D.C. bureau, tracking the ongoing efforts to undermine the democratic process in America.",
    "The Guardian's Hugo Lowell has the scoop that committee prosecutors will do the questioning, since they know how to query witnesses and aren't genetically programmed to grandstand like lawmakers.",
    "It's an outlier, not a bellwether: Take a spin around Arizona, Pennsylvania, Michigan, and Wisconsin and you'll see the GOP pushing leading candidates who are ready to attack elections for Trump.",
    "Turns out that corporate donations are still gushing toward Stefanik, even from the very companies that pledged to speak out, and spend, against discrimination after the murder of George Floyd.",
    "Add these episodes to the list of revelations likely to come out in public hearings: The committee has been told by multiple sources that Trump watched Jan. 6 rioters chanting Hang Mike Pence!",
    "Their Trumpist candidates can shoot to nominations without challenging GOP incumbents, then switch to a parallel universe where undermining elections need not turn off less-feral Republicans.",
    "While the murders continue, one of the elected GOP's most visible purveyors of a laundered version of this slime is New York Rep. Elise Stefanik, who raised money off it earlier this year.",
    "Kari Lake, a huge supporter of conspiracy theories and the Cyber Ninjas' audit is likely to win in Arizona and take QAnon-steeped state Rep. Mark Finchem with her for secretary of state.",
    "Last week VICE News' Cameron Joseph wrote about how the racist and antisemitic great replacement theory has migrated from the white supremacist fringe to the center of GOP politics.",
    "He acted early against COVID restrictions that were unpopular with conservatives and proved his bona fides by passing a lot of voter suppression in the name of election integrity.",
    "Arraign delay  Colorado secretary of state candidate and ward of the PillowGuy Tina Peters has already been barred from administering the 2022 election as Clerk of Mesa County.",
    "Brian Kemp and Secretary of State Brad Raffensperger's wins as the first real sign that Trump's grip on the GOP is dying, and that his dream of stealing 2024 is dying with it.",
    "Together they submitted thousands of bogus signatures that, when found out, put them under the number of valid signers needed to qualify for the ballot, the bureau said.",
    "(Recall that Section 3 bars any federal office holder who's taken an oath to defend the Constitution from holding office again if they do an insurrection or rebellion.)",
    "Yep, that's the same Scott Perry who tried to help turn the DOJ into Trump's personal coup operation and now has Meadows' old job heading the right-wing Freedom Caucus.",
    "That will be important if there's to be any political price for Republicans who participated in the insurrectionor for those who tolerate, enable, or cover up for them.",
    "The primary results out of Georgia this week seemed like a rebuke of former President Donald Trump's stolen-election poison in the GOP, and a big boost for democracy.",
    "The painful truth is that President Trump lost the election in 2020, lost the election in Wisconsin in 2020, and the loss was not due to election fraud, Knudson said.",
    "The bureau said five GOP candidates should be barred from running, including potentially leading candidates who echoed Trumpist concerns about election integrity.",
    "If all that sounds like standard Trumpist purging, here's the twist: The GOP WEC commissioner bidding to take over as chairman also posed as a fake elector.",
    "As I repeat nearly every week, GOP Leader Kevin McCarthy has openly threatened telecom companies who cooperate with Jan. 6 investigators with retaliation.",
    "Tucked at the bottom of that piece was the bombshell that then-chief of staff Mark Meadows used the fireplace in his White House office to burn documents.",
    "They could lead to him spilling the beans on his financial interests in fun things like a cash-for-Trump-pardons advocacy scheme, and of course, Jan. 6.",
    "Still, Youngkin's gesture was tiny compared to previous Democratic and GOP governors, who restored voting rights to hundreds of thousands of Virginians.",
    "GOP Rep. and aboveboard crypto investor Madison Cawthorn lost his appeal to block a challenge to his fitness for office under the 14th Amendment.",
    "Both of Trump's candidates, hand-picked to exact revenge on GOP incumbents who didn't overturn the 2020 election for him, got beaten, and badly.",
    "Voters didn't respond, but Longwell says that's not because Republicans in the GOP don't like Trump, or believe Joe Biden won fair and square.",
    "Glenn Youngkin, who won election last year with the help of election-undermining Trumpists, actually did a small solid for voting this week.",
    "And Pennsylvania Republicans just nominated state Sen. Doug Mastriano, a Christian nationalist who attended the Jan. 6 riot, for governor.",
    "One reason might be that companies are on notice that Republicans will use state power to punish corporate dissent against their policies.",
    "But Georgia is also the only swing state with two passably pro-democracy GOP incumbents up for governor and secretary of state.",
    "Youngkin restored voting rights to nearly 3,500 convicted felons who otherwise would have lost those rights under Virginia law.",
    "Another installment in our ongoing coverage of voter fraud perpetrated by the folks who are Totally Serious about voter fraud.",
    "and they would say, I've never heard of her,' Longwell says of Trump's endorsed secretary of state candidate, who is a man.",
    "Cast your mind back a few mass murders ago to Buffalo, or El Paso, or Pittsburgh, for why that's really, lethally bad.",
    "She says the high that you, a democracy-loving Breaking the Vote reader, are feeling from Georgia probably won't last.",
    "Do check out the bureau's report for hilariously bad examples of totally-not-fake Michiganders lending their support.",
    "It feels risky to invest the protection of democracy in a governor who kept power by making voting harder in Georgia.",
    "There's no evidence there you've got candidates that are anything but Stop the Steal acolytes, Longwell says.",
    "Then there's Merrick Garland, the attorney general and audience-of-one for these hearings, at least legally.",
    "The ultimate decision whether to prosecute not just rioters but coup plotters, including Trump, will be his.",
    "Things are set to kick off at 8 p.m. on Thursday, June 9, and end two weeks later in prime time on June 23.",
    "Their concerns were heard, says Longwell, who also publishes the never-Trump Republican site The Bulwark.",
    "Raffensperger also worked hard to play up his conservative cred, and he benefited from Kemp's coattails.",
    "That means places like Arizona, Wisconsin, and Pennsylvania won't necessarily follow Georgia's lead.",
    "In general elections you'll see more focus on inflation and crime and stuff for normie Republicans.",
    "This Week in Subpoenas, the January 6 committee is about to turn those subpoenas into swearings-in.",
    "In Wisconsin, the leading GOP governor candidate, Rebecca Kleefisch, recently called 2020 rigged.",
    "Think Reps. Paul Gosar and Andy Biggs from Arizona, who are on activists' list for challenges.",
    "Perdue made a habit of opening his debate appearances with the refrain that 2020 was stolen.",
    "As we go into 2024, the rest of the GOP fields are decidedly anti-democracy, Longwell says.",
    "Roger, over  Celebrated GOP ratfucker and pardoned felon Roger Stone has some tax problems.",
    "Commissioner Dean Knudson stepped down just as the commission was set to elect a new chair.",
    "Instead, Kemp gave conservatives a lot of what they loved from a conservative incumbent.",
    "Trump's perceived enemies not only survived but thrived in the GOP field he dominates.",
    "LUCID\nCPAC Hungary should be a wake-up call for all Americans who care about freedom.",
    "But that would be a mistake, longtime Republican consultant Sarah Longwell told me.",
    "Why would corporations not speak out like they did after Jan. 6, or Floyd's murder?",
    "Whether or not that concern is misguided, from our perspective, is another issue.",
    "But she added, One hundred percent what people shouldn't do is overread Georgia.",
    "You would ask Georgia Republicans, What do you think of (Rep.) Jody Hice?'",
    "Cawthorn lost his primary last week, so for him, for now, it's moot.",
    "There will be four hearings in-between, on June 13, 15, 16, and 21.",
    "Kemp bludgeoned former Sen. David Perdue by more than 50 points.",
    "I think we can count on Brian Kemp not to overturn an election.",
    "MEDIAITE\nHow Trump's 2020 lies have gripped state legislatures.",
    "Republicans are using stolen-election lies as a revenge tour.",
    "But here's the case for why it could mean a lot more legally.",
    "Sometimes it's just absolutely vital to be a grammar scold.)",
    "Georgia's Marjorie Taylor Greene already beat her 14A rap.",
    "Ask Disney if Republicans are willing to follow through.",
    "It's rocket fuel and a turnout mechanism, Longwell says.",
    "It's an unmitigated win for democracy, Longwell told me.",
    "Longwell thinks he's more vulnerable than the others.",
    "on TV and remarked that maybe Pence should be hung.",
    "Sign up here to get it in your inbox every Friday.",
    "It's fair to say that's a low bar, Longwell says.",
    "Hope: The secret weapon of democracy protection.",
    "I've never heard President Trump ever say that.",
    "Sign up your friends for Breaking the Vote!",
    "He took their concerns seriously.",
    "The voters are plenty Trumpy.",
    "They really remember that.",
    "It's tempting to read Gov.",
    "And this week's a twofer!",
    "(BTW, yes, it's hanged.",
    "Happy viewing!",
    "Virginia Gov.",
    "More soon."
  ]
}