{
  "id": 8579,
  "mediaId": 151,
  "date": "d2022-05-29T11:00",
  "headline": "He doesn't speak in beautiful syntax: GOP bets the Senate that Walker is ready for prime time",
  "image": "https://www.politico.com/dims4/default/6d056d1/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fae%2Fbb%2F0c6fde474b8ca72e6c6cbeec6287%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1240865697",
  "link": "https://www.politico.com/news/2022/05/29/gop-senate-herschel-walker-georgia-00035851",
  "sentiment": "-0.858",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1101,
    1136,
    147,
    428,
    571,
    2672,
    6069
  ],
  "sentences": [
    "But his personal and business history has been the subject of unflattering media coverage, leading to harsh Democratic criticism and private concerns among Republicans about his ability to withstand scrutiny in the crucible of one of the most competitive races in the country.",
    "Former House Speaker Newt Gingrich, who talked with Walker for three hours at his campaign HQ, told POLITICO they talked about everything from being a candidate to being a senator to thinking about debating Warnock and how to handle debates.",
    "In response to a question about gun control legislation, Walker offered a rambling answer so nonsensical that it underscored longstanding concerns about whether he is ready for the rigors of a punishing, high-stakes Senate campaign.",
    "In January, when asked how he would have voted on the bipartisan infrastructure bill  a standard question for a candidate running for Senate  he said the question was totally unfair because he didnt know the facts of the bill.",
    "If his runaway primary victory offered a glimpse at his promise as a Senate candidate, then Walkers answer on guns was a fresh reminder of his risks as GOP nominee in one of the Senates most pivotal races.",
    "| Megan Varner/Getty Images\nBy Brittany Gibson\n 05/29/2022 07:00 AM EDT\nIts a standard political ploy, straight out of a challengers playbook: demand a series of debates the moment the primaries are over.",
    "Well, you know, its always been an issue, because as I said earlier on, they wanna score political points ... People see that its a person wielding that weapon, you know, Cain killed Abel, Walker said.",
    "Herschel very much looks forward to debating Raphael Warnock and his lock step support for Joe Bidens disastrous policies this fall, Walker spokesperson Mallory Blount said in a written statement.",
    "Democrats are eager to see Walker on a stage with Warnock, a minister and polished speaker with two debates under his belt after his successful 2020 campaign against GOP Sen. Kelly Loeffler.",
    "The primary took place on the same day as the mass school shooting in Uvalde, Texas, and after his victory speech, Walker was asked if he supported new gun laws in the wake of the tragedy.",
    "Only in Georgia, it was incumbent Sen. Raphael Warnock who issued the call Thursday for three televised debates, as soon as his fall Senate election match-up with Herschel Walker was set.",
    "Hes a quick study and very good at bridging the divisions down there that have been on full display for the last couple of years, which I think is really important going into the general.",
    "I mean Ive had more experience with this sort of thing than he has and its not all that different from other campaigns that weve [helped], said McConnell in an interview with POLITICO.",
    "They are telegraphing their strategy: to try to get Herschel Walker into unscripted moments where hes got to act on his feet, said Brian Robinson, a Republican consultant in Georgia.",
    "The early sparring over debates is already providing insights into each campaigns approach to the general election, and a key hurdle for Walker to overcome if he is to oust Warnock.",
    "And as a first-timer in a marquee race that could decide control of the Senate, he has received a crash course in campaigns, politics and government from top party leaders.",
    "You talk about doing a disinformation, he continued, what about getting a department that can look at young men thats looking at women, thats looking at their social media?",
    "I think what stands out to me is the timing of it and telegraphing the strategy of what they think their strengths are, and what they think Herschel Walkers weakness is.",
    "His meandering answers breathed new life into criticism he faced from his Republican primary opponents, who accused him of hiding from them and being afraid to debate.",
    "Gingrich, now a Fox News commentator, said Walker will immediately become a national figure in the Republican Party and will help the GOP appeal to Black voters.",
    "I think [people] are going to be surprised by how calmly confident he is, and how impossible it is for Warnock or anyone else to intimidate him, Gingrich said.",
    "As the clear front-runner in that contest, Walker refused to attend debates, dismissing his opponents for not working hard enough and trailing in the polls.",
    "But political journalists who staked out his campaign events  there were more than 100 across the state  rarely got the opportunity to question him.",
    "Every report and every scandal that emerges about Herschel Walker reinforces why he has absolutely no place in the U.S, Senate.",
    "Walker, a Heisman Trophy winner accustomed to the breezy fame of an athlete-celebrity, has never run for public office before.",
    "At a church event in March, Walker questioned evolution, asking if humans evolved from apes, then why are there still apes?",
    "But, you know, I think his voters will say what they said about Trump quite often, Well, I know what he was trying to say.",
    "His campaign reiterated that position after the primary, but declined to address Warnocks three-debate proposal.",
    "At one debate, attended by his five Republican rivals, one of his foes called him out for his debate-dodging.",
    "So in that regard, we think this guys wrong for Georgia, [and] we would like to have that discussion.",
    "The following day, he sat for a cable news hit with Fox News that prompted Warnocks calls for debate.",
    "He added that the GOP needs aggressive competitors who like to win and that Walker personifies it.",
    "I think a simple question for Herschel Walker is, what do you think the United States Senate does?",
    "In addition, Walker has a standing weekly check-in with Minority Leader Mitch McConnell (R-Ky.).",
    "In the primary, Walker sat for interviews with conservative press outlets and sports podcasters.",
    "Walker has previously said on the campaign trail that he plans to debate Warnock in the fall.",
    "Just plain and simple, said Dan Gottlieb, spokesperson for the Democratic Party of Georgia.",
    "Walker again tripped on his own words when asked for his policy views on gun restrictions.",
    "They [the Warnock campaign] are signaling what they think is their pathway to victory.",
    "Joni Ernst (Iowa) and Lindsey Graham (S.C.), and had regular conversations with Trump.",
    "He doesnt speak in beautiful syntax, by any means, said Robinson, the GOP consultant.",
    "What about doing that, looking into things like that, and we can stop that that way?",
    "Its what you do as a United States senator, you get up there and you debate ideas.",
    "When Walker did respond to spontaneous questions, he had a tendency to stumble.",
    "None of it, however, seemed quite as awkward as his post-election victory lap.",
    "Warnocks move made sense in light of a head-scratching moment the day before.",
    "And I said, what we need to do is look into how we can stop those things.",
    "Herschel Walker speaks at a rally on May 23, 2022 in Athens, Georgia.",
    "Sen. Ted Cruz (R-Texas) flew to Mar-A-Lago to talk shop with Walker.",
    "What I like to do is see it and everything and stuff, he told CNN.",
    "And he shouldnt be representing Georgians in the Senate.",
    "And for voters, the conclusion will be really simple.",
    "Walkers weaknesses as a candidate arent a secret.",
    "said former Navy SEAL officer Latham Saddler.",
    "Burgess Everett contributed to this report.",
    "Walker has also met with Republican Sens.",
    "Its the deliberative body of Congress.",
    "And Herschel Walker cant get up here.",
    "And thats the problem that we have.",
    "Walker is not who he says he is.",
    "Hes not for the job.",
    "Think about it."
  ]
}