{
  "id": 8741,
  "mediaId": 195,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Campaign Report  Biden confronts his most serious midterm issue",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/e6ab58c392944022970da3695a539b0e.jpg?w=900",
  "link": "https://thehill.com/news/campaign/3507047-campaign-report-biden-confronts-his-most-serious-midterm-issue/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "Democrats and activists lament that it took the draft opinion and horrific killings to amplify their rallying cries, but should the party be able to seize on the window to hammer Republicans on the issue, it would mark a reversal from the defensive posture Democrats have been on regarding issues like critical race theory, sex ed in schools and more.",
    "The blockbuster leak earlier this month of the Supreme Court's draft ruling that would essentially scrap the constitutional protections over abortion and recent mass shootings in Buffalo, N.Y., and Uvalde, Texas, thrust the two issues into the spotlight, offering a chance for Democrats to go on offense on key culture war issues.",
    "Biden's argument in his op-ed that the U.S. is in a better economic position than almost any other country, pointing to things like low unemployment and a strong stock market, could fall on deaf ears if prices for things like gas and groceries  more immediate concerns for voters  remain high.",
    "I think part of the challenge for Democrats is that they have been too quiet while Republicans just continue to bring out the culture war battle of the day, and Democrats have just shut up instead of pushing back, Democratic strategist Jared Leopold told Tal.",
    "The people who are motivated by choice as an animating issue are very committed voters to begin with, and they are voters who have the luxury to consider cultural issues, Democratic strategist Julie Roginsky told our own Niall Stanage.",
    "In a sign that the strategy to highlight inflation will be an administration-wide one, National Economic Council Director Brian Deese on Tuesday insisted that the White House is on strong footing to reduce record-high inflation.",
    "The second prong focuses on making goods more affordable, including by repairing supply chains, improving infrastructure and cracking down on the exorbitant fees that foreign ocean freight companies charge to move products.",
    "mail us tips and feedback: Max Greenwood (mgreenwood@thehill.com), Julia Manchester (jmanchester@thehill.com), Tal Axelrod (taxelrod@thehill.com), Caroline Vakil (cvakil@thehill.com) and Monique Beals (mbeals@thehill.com).",
    "Already, Democratic governors and state legislators have pushed to enact their own abortion protections should Roe v. Wade be scrapped, and Biden and Vice President Harris recently visited Uvalde and Buffalo, respectively.",
    "RECOUNT UNDERWAY IN PENNSYLVANIA\nThe recount in Pennsylvania's GOP Senate primary is underway, setting the stage for a photo finish to determine the Republican nominee in one of the nation's most critical Senate contests.",
    "Warnock, who won in a special election in 2021, is running for a full term of his own this year against former football star Herschel Walker, and former state House Minority Leader Stacey Abrams is trying to unseat Gov.",
    "Democrats are bullish that Warnock and Abrams present a powerful duo at the top of the general election ballot, but Republicans boast that this year's political atmosphere  driven mainly by inflation  could sink them.",
    "AD WATCH\nOne Nation, the nonprofit arm of Senate Leadership Fund, a super PAC affiliated with Senate GOP Leader Mitch McConnell, released a new ad in Georgia Tuesday targeting Sen. Raphael Warnock (D) over inflation.",
    "McCormick's campaign is also suing to have counted ballots that were mailed in without a written date on the envelopes, as is typically required, but that were received on or before Election Day.",
    "In an op-ed in The Wall Street Journal Monday evening, Biden laid out a three-pronged strategy to fight rising prices, which have helped keep his approval numbers in the high 30s and low 40s.",
    "The first prong involves boosting the Federal Reserve and giving it the leash he says it needs to combat inflation  delivered along a knock on his predecessor, who he says demeaned the body.",
    "The video, part of a $17.1 million blitz in the Peach State, casts Warnock as partially responsible for the surge in prices after voting for Biden's COVID-19 stimulus package last year.",
    "The official said they're requesting the hand recount to happen concurrently to the state-ordered recount so we can get a resolution to this and get behind the nominee and move forward.",
    "The new focus on both abortion and gun control presents an opportunity for Democrats to go on offense and define the difference between the parties on those issues that inspire voters.",
    "Democrats push for change on abortion, gun control\nBeyond inflation, Democrats got a new issue set in recent weeks that could allow them to go on offense: abortion and gun control.",
    "However, abortion and guns are known to also rile up Republican voters, and it's unclear if the two issues have the ability to supplant voters' concerns over the economy.",
    "When you wake up every day worrying about how to fill up the gas tank or how to pay for basic necessities, abortion is just not something you have time to worry about.",
    "The economy we have right now is in a transition from this period of historic economic growth to a period that can be more stable, resilient growth.",
    "The op-ed's release came a day before Biden met with Federal Reserve Chairman Jerome Powell to discuss strategies for combating inflation.",
    "Georgia is set to be at the center of the political universe later this year, with contested Senate and gubernatorial races up for grabs.",
    "And with Democrats' House and Senate majorities at stake, the party is increasingly desperate to reverse their fortunes before November.",
    "Pennsylvania acting Secretary of State Leigh Chapman officially announced the recall Wednesday afternoon, and the process began Friday.",
    "Polls consistently show the prices of goods are the top or among the top concerns for voters  figures that haven't budged for months.",
    "The McCormick campaign is requesting a hand recount in 12 counties, a senior McCormick campaign official told reporters Tuesday.",
    "However, Biden faces an uphill battle in convincing the American people to give him the benefit of the doubt on the economy.",
    "The issues present a welcome opportunity  politically, at least  to change the narrative from Biden's low approval ratings.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Tell Senator Warnock to stop fighting for reckless spending  and start fighting inflation, a narrator says in the ad.",
    "Biden lays out inflation strategy\nPresident Biden this week is confronting his most serious midterm issue: inflation.",
    "Celebrity surgeon Mehmet Oz is currently leading former hedge fund manager Dave McCormick by fewer than 1,000 votes.",
    "Sending inflation through the roof and raising gas and grocery prices over ten percent on hard-working Georgians.",
    "Senator Raphael Warnock was the deciding vote for President Biden's multi-trillion dollar spending spree.",
    "That requires focusing on inflation and doing so from a position of relative strength, Deese told CNBC.",
    "The final prong would lean on common-sense reforms to the tax code to reduce the federal deficit.",
    "Welcome to The Hill's Campaign Report, tracking all things related to the 2022 midterm elections.",
    "Scheduling note: With the primary season in full swing, we're expanding our newsletter schedule.",
    "Thanks for reading and check out The Hill's Campaign page for the latest news and coverage.",
    "You can expect this newsletter in your inbox each week leading up to November's election.",
    "The new strategy makes sense given voters' frustration over stubbornly high inflation.",
    "Beginning this week, you can expect to hear from us on Tuesdays and Thursdays.",
    "The recount should be done by June 7, with the results released the day after.",
    "The president will also give a speech Friday on the upcoming May jobs report.",
    "Those ballots are also dated upon receipt by election officials.",
    "The ultimate nominee will face off in November against Lt. Gov.",
    "John Fetterman (D), who is currently recovering from a stroke.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "That's it for today.",
    "See you next week.",
    "Brian Kemp (R)."
  ]
}