{
  "id": 8743,
  "mediaId": 195,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Herschel Walker mad' at Trump over remarks about Senate bid",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/094af8daa3e3450cbe1724f312dd8074.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3507012-herschel-walker-mad-at-trump-over-remarks-about-senate-bid/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    815,
    1136,
    1147,
    2095,
    4325,
    6349,
    428,
    571,
    5621,
    2672
  ],
  "sentences": [
    "The browser does not support the specified video codec\nHerschel Walker, the Georgia Republican Senate nominee and former NFL player, said he's mad at former President Trump for claiming he was the one who lured Walker into the race to unseat Sen. Raphael Warnock (D-Ga.).",
    "Walker, a well-known figure in the Peach State from his days playing football for the University of Georgia, won Trump's endorsement early on in his Senate campaign.",
    "In other high-profile contests, Trump's endorsed candidates were defeated by incumbents whom the former president had vowed to campaign against, including Gov.",
    "But Walker said that Trump did not play a role in his decision to run for Warnock's Senate seat, pointing instead to his religious beliefs.",
    "One thing that people don't know is President Trump never asked me, Walker said in an interview with the rapper Killer Mike on Revolt TV.",
    "Before Walker announced his campaign last year, Trump repeatedly hinted that the former NFL star was considering entering the race.",
    "Brian Kemp (R) who easily dispatched with a primary challenge from Trump's preferred candidate, former Sen. David Perdue (R-Ga.).",
    "Trump sought to boost Walker in the Senate primary for months, even traveling to Georgia to stump for him earlier this year.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "He clinched the GOP nomination to take on Warnock last week, facing little serious competition.",
    "So, I'm mad at him, because he never asked, but he's taking credit that he asked, Walker said.",
    "I heard it all on television that he's going to ask Herschel,' saying Hershel is going to run.",
    "And to be honest with you, I was praying that God would bring somebody else because I'm happy.",
    "Walker's victory in last week's primary was one of the few bright spots for Trump in Georgia.",
    "President Trump never came out and said Herschel, will you run for that Senate seat?'",
    "We invite you to join the discussion on Facebook and Twitter.",
    "I need to tell him that he never asked.",
    "I prayed about it, he said.",
    "My life is doing well."
  ]
}