{
  "id": 8918,
  "mediaId": 136,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "Republicans' Chances of Beating Democrats for Control of Senate in Midterms",
  "image": "https://d.newsweek.com/en/full/2050536/mitch-mcconnell-chuck-schumer.webp?w=790&f=5eb4af6877b6cdaa73e28d16f10cedd6",
  "link": "https://www.newsweek.com/republicans-chances-flipping-senate-democratic-control-midterms-1712378",
  "sentiment": "0.448",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    815,
    886,
    1136,
    1147,
    146,
    428,
    571,
    2550,
    2672,
    2818
  ],
  "sentences": [
    "As the midterms approach, Republicans feel emboldened by President Joe Biden's tanking approval rating and widespread criticism of the Democrats' leadership in Washington, D.C.giving them hope they'll be able to flip the Senate back to GOP control in November.",
    "Her GOP opponent won't be officially determined until a September primary, but recent polling shows that retired Army Brigadier General Don Bolduc is well ahead of the other Republican contenders, although many GOP voters are undecided.",
    "The seat was previously held by Martha McSally, a Republican who was appointed to serve Arizona in the Senate until the special election for the remainder of deceased GOP Senator John McCain's term.",
    "With that even split, Vice President Kamala Harris, in her role as Senate president, can cast tie-breaking votes, which gives her party narrow control of the upper chamber of Congress.",
    "A CNN/SSRS Opinion Panel carried out from May 3 to 5 showed that 49 percent of registered voters said they'd vote for a generic Republican candidate if the election were held today.",
    "That poll, carried out by The Hill/Emerson College from April 1 to 3, showed Walker at 49 percent, compared with Warnock's 45 percenta lead of 4 points for the Republican.",
    "At the same time, most of these seats are considered safe, as they are held by incumbents in states that largely vote for Democrats or Republicans, respectively.",
    "New Hampshire\nRecent polls suggest that Democratic Senator Maggie Hassan may be in for a tough battle to maintain her seat against a Republican challenger.",
    "Georgia\nThe contest between Senator Raphael Warnock and former football star Herschel Walker is looking to be one of the closest watched in the midterms.",
    "Kelly won in that race by a margin of 2.4 percent, with the support of 51.2 percent of Arizona voters, compared with 48.8 percent that backed McSally.",
    "Nevada\nDemocratic Senator Catherine Cortez Masto looks likely to face off against Trump-backed Republican former state Attorney General Adam Laxalt.",
    "But a Data for Progress poll in January, which surveyed Arizona's likely voters about a Kelly vs. Brnovich match, showed a much closer competition.",
    "As a result, the race went to a runoff in January 2021, which the Democrat won with 51 percent of the vote, compared with Loeffler's 49 percent.",
    "Seven seats are considered by analysts to be the most competitive in the 2022 election cycle, although some are more likely to flip than others.",
    "Nearly half, 49 percent, viewed the Democrat \"somewhat\" or \"very\" unfavorably, while just 46 percent viewed him \"somewhat\" or \"very\" favorably.",
    "The conservative Republican has the support of about 47.3 percent of Georgians, compared with 46.8 percent who back the Democratic incumbent.",
    "Notably, while Republicans may manage to win one or more of these races, Democrats could also pick up a seat or two held by a GOP lawmaker.",
    "That survey, conducted by WXIA-TV/SurveyUSA from April 22 to 27, puts the Democrat at 50 percent, compared with his opponent's 45 percent.",
    "The legislative body has 50 Republican members and 48 Democrats, as well as two independents who caucus with their Democratic colleagues.",
    "Meanwhile, the Real Clear Politics average of recent generic congressional ballot polls currently has the GOP in the lead by 1.9 percent.",
    "Survey data published in April by the University of New Hampshire showed that Hassan's favorability rating was significantly underwater.",
    "An early April poll conducted by The Nevada Independent found the incumbent Democrat had a lead of 8 points among registered voters.",
    "The Data for Progress poll additionally showed that more likely voters viewed Kelly unfavorably than those who viewed him favorably.",
    "Analysts are keeping their eyes most closely on Pennsylvania, Georgia, Nevada, Arizona, Wisconsin, New Hampshire and North Carolina.",
    "The leading GOP contenders are Arizona Attorney General Mark Brnovich, businessman Jim Lamon and venture capitalist Blake Masters.",
    "The Trump-backed Republican had the backing of 43 percent of likely voters, while Cortez Masto had the support of just 40 percent.",
    "The Democratic senator was supported by 47 percent of likely voters, compared with 46 percent who backed the Republican hopeful.",
    "The latest survey data from Blueprint Polling shows Kelly would perform well against any of the top three Republicans, however.",
    "But another early April poll, carried out for the Reno Gazette-Journal by Suffolk University, showed Laxalt ahead by 3 points.",
    "Neither Warnock nor former GOP Senator Kelly Loeffler secured more than 50 percent of the vote in the 2020 general election.",
    "Recent historical precedent also suggests that one or both congressional chambers are likely to flip to Republican control.",
    "Here's a closer look at the four races where Republicans appear to have the best shot at flipping the seat on November 8.",
    "The incumbent Democrat was supported by 47 percent, compared with the 49 percent who preferred the Republican challenger.",
    "In recent assessments, CNN, NPR and FiveThirty Eight have all said these Senate races as among the most likely to flip.",
    "The senator had the backing of 54 percent of registered voters, while the Republican was supported by just 39 percent.",
    "That report showed that the president's party has lost more than three Senate seats, on average, during the midterms.",
    "Former President Donald Trump formally endorsed Masters on Thursday shortly after this article initially published.",
    "Last June, the University of Virginia's Center for Politics released an analysis of midterms going back to 1946.",
    "ET: This article was updated to report that Trump endorsed Masters in Arizona shortly after initial publication.",
    "However, a previous poll conducted by Phillips Academy in April showed Hassan with a 15-point lead over Bolduc.",
    "When voters go to the polls across the country in just over five months, 35 Senate seats will be up for grabs.",
    "Just 42 percent said they'd cast ballots for generic Democratic candidatesgiving the GOP a 7-point advantage.",
    "With a zero margin of comfort, Democrats cannot lose even one seat and maintain their control of the Senate.",
    "Walker has been endorsed by Trump as well as Senate Minority Leader Mitch McConnell, a Kentucky Republican.",
    "The current Real Clear Politics average of Georgia polls shows Walker with a very narrow lead over Warnock.",
    "Recent survey results show mixed results for Cortez Masto's chances of maintaining her seat against Laxalt.",
    "Recent polls show Masters in third place among the Republican contenders, with the primary set for August.",
    "Notably, Hassan, while still in the lead, was only single digits ahead of several other GOP candidates.",
    "Laxalt, who is also endorsed by McConnell, is double digits ahead of his GOP primary rival, Sam Brown.",
    "Arizona\nDemocratic Senator Mark Kelly managed to flip a red seat blue in a special election in 2020.",
    "However, the most recent poll included in the average shows Warnock with a notable lead over Walker.",
    "The biggest loss has been 13 seats, while the largest gain has been just four seats.",
    "More than half, 51 percent, of New Hampshire's likely voters viewed her unfavorably.",
    "Meanwhile, the same survey found that Hassan would beat Bolduc by only 1 point.",
    "Overall, polling shows Republicans are favored to perform well in the midterms.",
    "She was supported by 43 percent, compared with 35 percent who backed Laxalt.",
    "Democrats currently hold the Senate with the slimmest possible majority.",
    "He had a relatively narrow margin over Trump of less than 34,000 votes.",
    "Recent polls suggest a similarly close race is possible this November.",
    "He leads all three by margins ranging from 14 percent to 17 percent.",
    "Notably, Biden won Nevada with about 50 percent of the vote in 2020.",
    "Of these, 14 are held by Democrats and 21 are held by Republicans.",
    "The Republican candidate will be determined by voters on June 14.",
    "It's unclear whom Kelly will face off against in November.",
    "An April survey had nearly opposite results.",
    "Of those seats, four are held by Democrats.",
    "Only 35 percent viewed her favorably.",
    "Updated June 2 at 3:32 p.m."
  ]
}