{
  "id": 8923,
  "mediaId": 223,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Why Herschel Walker Is 'Mad' at Trump",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/270/91508c6e-a83a-4eab-9382-a4c8ebc65e84.jpg",
  "link": "https://townhall.com/tipsheet/leahbarkoukis/2022/06/01/why-herschel-walker-is-mad-at-trump-n2608062",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Leah Barkoukis",
  "authorUrl": "https://townhall.com/tipsheet/leahbarkoukis/",
  "termIds": [
    815
  ],
  "sentences": [
    "Source: AP Photo/Ben Gray\nHerschel Walker and Donald Trump have been good friends for decades, dating back to 1983 when the Heisman Trophy winner was drafted by the New Jersey Generals, which was under Trump's ownership at the time.",
    "\"To be honest with you, I was praying that God would bring somebody else,\" he said, \"but I love the Lord Jesus, and my parents raised me that if something's going wrong[I have to look for a way] to help someone else.\"",
    "The Republican Georgia Senate nominee says he's \"mad\" at the former president for \"taking credit\" for his entrance into the political arena.",
    "He would be unstoppable, just like he was when he played for the Georgia Bulldogs, and in the NFL,\" Trump said in a statement last spring.",
    "\"One thing that people don't know is President Trump never asked me,\" Walker said during an interview with rapper Killer Mike.",
    "\"Wouldn't it be fantastic if the legendary Herschel Walker ran for the United States Senate in Georgia?",
    "According to Walker, Trump never asked him to run for Senate despite going around saying he did.",
    "\"So, I'm mad at him because he never asked, but he's taking credit that he asked,\" Walker added.",
    "I heard it all on television that he's going to ask Herschel, saying Hershel is going to run.",
    "President Trump never came out and said, 'Herschel, will you run for that Senate seat?'\"",
    "But like any close relationship, there are bound to be ups and downs.",
    "Walker said he and his wife prayed about the decision.",
    "\"I need to tell him that he never asked.",
    "Trump did publicly urge Walker to run.",
    "\"He is also a GREAT person.",
    "Run, Herschel, run!\""
  ]
}