{
  "id": 8926,
  "mediaId": 238,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Guns are all over GOP ads and social media, prompting some criticism",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/31/republicans-guns-ads-posts/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Colby Itkowitz",
  "authorUrl": "https://www.washingtonpost.com/people/colby-itkowitz/",
  "termIds": [
    815
  ],
  "sentences": [
    "Knoth did not respond directly when asked if Hartzler regrets that some of her constituents received the mailer after those tragedies, saying only that the congresswoman is praying for all those lost and their loved ones and is urging support for legislation to allow off-duty and retired law enforcement personnel to carry concealed firearms on school grounds.",
    "Olivia Troye, who was a homeland security adviser to former vice president Mike Pence and worked on mass shootings and domestic terrorism issues, warned that the promotion of guns and violence by Republican candidates and elected officials has far reaching implications, in part by normalizing and mainstreaming a weapon that is designed and meant to kill.",
    "Ron Filipkowski, a lifelong Republican who also broke with the party over former president Donald Trump and now tracks right-wing messaging, said he first noticed the uptick in gun-related GOP ads in August when he kept seeing Republican candidates sharing images of themselves with assault-style firearms and decided to tally them.",
    "McCormick and Oz, the finalists in a high-stakes Republican primary for U.S. Senate in Pennsylvania that has gone to a recount, have spent months trying to showcase their conservative bona fides to GOP base voters and head off skepticism of their elite backgrounds on Wall Street and in Hollywood, respectively.",
    "Rep. Lauren Boebert (R-Colo.), who has built her political brand in large measure around her devotion to guns, responded to Massie's tweet with a photo of her and her sons holding similar assault rifles with a message to her colleague: The Boeberts have your six  military jargon for having someone's back.",
    "While most representatives of the elected officials and candidates cited in this report did not immediately respond to a request for comment, John Kennedy, communications director for Massie, defended his boss's decision to promote his photograph and said it did not send a dangerous message.",
    "This year, an Arizona Republican running to unseat Democratic Sen. Mark Kelly released an ad that portrayed him as a sheriff and showed him in an old Western-style standoff with actors playing Kelly, President Biden and House Speaker Nancy Pelosi (D-Calif.).",
    "Although candidates in both parties have long used guns as a campaign prop, the images have in recent years become more prevalent, and intentionally provocative, in Republican advertising, holidays greetings and other forms of communication with the public.",
    "But as the nation reckons with a pair of deadly mass shootings at a Buffalo grocery store and a Texas elementary school, some are warning that these photos and videos are harmful and glorify the use and ownership of firearms designed to kill.",
    "In 2010, Sen. Joe Manchin III (D-W.Va.) famously shot a gun at a Democratic environmental and energy proposal bill in a campaign ad, and eight years later, he released another one shooting at a lawsuit challenging the Affordable Care Act.",
    "It's an illustration of where both sides are in that the more the right feels they are going to lose their Second Amendment rights, the further they're going to go to defend them, said Terry Sullivan, a veteran Republican strategist.",
    "These ads create a dangerous impression that firearms, and assault-style firearms specifically, are casual tools rather than dangerous weapons, said Kris Brown, the president of Brady, a gun violence prevention organization.",
    "Kevin Knoth, Hartzler's spokesman, said in an email that the mail was approved May 12 and sent for delivery May 13 before the deadly mass shootings at supermarket in Buffalo and an elementary school in Uvalde, Tex.",
    "If there is a breakdown of law and order, and that can happen  it's not impossible to find yourself in the modern world without any police protection, because that's just the way the times are in which we live in.",
    "In Georgia, Josh Clark, a Republican Senate candidate who recently lost the primary to former football star Herschel Walker, said in March that he planned to give away an AR-15 every week until the election.",
    "Mark McCloskey, who once pointed a gun at Black Lives Matter protesters and is now running in the Republican primary for U.S. Senate in Missouri, has images of assault weapons all over his social media.",
    "It seems to be a rite of passage now for Republicans in primaries to prove how tough they are protecting the Second Amendment, said Neil Oxman, a Democratic communications strategist in Pennsylvania.",
    "Rep. Massie's photo was so popular with his Kentucky constituents that the most commonly heard complaint we received was that this photo was not released as the actual Christmas card, Kennedy said.",
    "Last Christmas season, Rep. Thomas Massie (R-Ky.) posted a holiday photo on social media showing him and his family posed in front of a Christmas tree, all clutching military-style firearms.",
    "Last fall, Rep. Marjorie Taylor Greene (R-Ga.) gave supporters a chance to win a 50-caliber rifle she used in an ad to blow up a Toyota Prius with the word socialism emblazoned on its side.",
    "Sullivan said Republicans who highlight gun imagery in primaries where the competition for GOP base voters is intense might pay a political price in the general election.",
    "On his campaign website, he boasts that his story has empowered thousands of new gun owners across the country to purchase a firearm and learn how to defend themselves.",
    "Such placements convey a cultural and political solidarity with conservatives more powerfully than most anything else, according to Republican strategists and aides.",
    "Democrats in recent years have outpaced Republican spending on gun-related ads, a signal of the party's increasing inclination to campaign for stricter gun laws.",
    "Senator Graham is a strong supporter of the Second Amendment, Graham spokesman Kevin Bishop said, when asked about the senator's social media posts.",
    "The footage showed the massive explosion from various angles and directed viewers to a website that allowed them to enter to win Greene's rifle.",
    "It is their calling card to tell Republican voters that they are conservative, and by doing that, you don't really have to do anything else.",
    "His goal, he said, was to advance the use of AR-15 rifles, which he said should be one of the most commonly owned firearms across America.",
    "recently sent a mailer to constituents that showed her clutching an AR-15-style weapon in one picture and shooting a handgun in another.",
    "Over the past several election cycles, Democrats running in rural, conservative-leaning states have also featured guns in their ads.",
    "It used to be a cultural thing as hunting goes, but these guys aren't hunting  I'm talking about running around playing warrior.",
    "But so far this year, Republicans have aired dozens more ads about guns than Democrats, according to data analyzed by AdImpact.",
    "This is the same type of gun that TRIGGERS the Fake News Media and Democrats all across the country, Greene's webpage read.",
    "The media-tracking firm identified 121 Republican ads dealing with guns and just 18 Democratic ones that are gun-related.",
    "Last spring, Sen. Lindsey O. Graham (R-S.C.) posted a video on Twitter of himself shooting an AR-15 in a gun range.",
    "And it's the same type of gun the hate-America gun-grabbers in DC would love to BAN if they ever get the votes.",
    "By doing that, that's enough for the Republican primary voters who have gone further and further to the right.",
    "In the ad, the GOP candidate, businessman Jim Lamon, says: The good people of Arizona have had enough of you.",
    "They view that as a sport now, and to participate in that sport, you need assault weapons, Filipkowski said.",
    "Political campaigns and organizations have held contests gifting military-assault weapons to supporters.",
    "Former hedge fund CEO David McCormick first shoots the hunting rifle he says he used as a teenager.",
    "Then he points a semiautomatic assault rifle like one he says he used in Iraq at a faraway target.",
    "He said he got to about a dozen before they became too frequent to keep up with in real-time.",
    "Firearms are the ultimate equalizer, one post says, over a photo of him holding a gun.",
    "Next, he cocks the rifle he says he used at the U.S. Military Academy and fires.",
    "Former television personality and surgeon Mehmet Oz loads a shotgun and shoots.",
    "The camera then zooms in on Oz locking a magazine onto an AR-15 style rifle.",
    "Part of that strategy involved commercials showing them shooting guns.",
    "It's the posing with them in pictures to say, Hey, I'm a tough guy.",
    "Lamon points his gun and shoots the weapons out of their hands.",
    "The ad drew some criticism, including from Republican rivals.",
    "To use them to grandstand and to provocate is dangerous.",
    "The Kelly, Biden and Pelosi characters run away.",
    "Now, why would anybody need to own an AR-15?",
    "It's really become a cultural thing now.",
    "The three Democrats draw their weapons.",
    "When people say I don't support guns?",
    "Graham asked in a follow-up post.",
    "They're dead wrong, Oz says.",
    "It is a very visual example.",
    "Others took a similar view.",
    "Rep. Vicky Hartzler (R-Mo.)",
    "Come and take this away.'",
    "It's time for a showdown.",
    "I'm a badass.",
    "Pow.",
    "Pow.",
    "Pow.",
    "Pow.",
    "Pow.",
    "Pow."
  ]
}