{
  "id": 8966,
  "mediaId": 151,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "House Republicans' California peril",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/weekly-score/2022/06/06/house-republicans-california-peril-00037336",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "MCCORMICK CONCEDES, PA GENERAL IS ON  Mehmet Oz vs. John Fetterman is a clash of two personalities running as outsiders, by the Philadelphia Inquirer's Jonathan Tamari and Julia Terruso: Pennsylvania's U.S. Senate candidates, Republican Mehmet Oz and Democrat John Fetterman, are in many ways offering voters similar stories: They each promote themselves as outsiders who defy traditional, hidebound politics  while carrying elite credentials.",
    "Days until the California, Iowa, Mississippi, Montana, New Jersey, New Mexico and South Dakota primaries: 1\nDays until the Maine, Nevada, North Dakota and South Carolina primaries: 8\nDays until the D.C. and Virginia primaries: 15\nDays until the Colorado, Illinois, New York, Oklahoma and Utah primaries: 22\nDays until the general election: 155\nDays until the 2024 election: 883\nWant to receive this newsletter every weekday?",
    "END OF THE LINE  Michigan Supreme Court leaves Craig, Johnson, others off ballot, by the Detroit News' Craig Mauger and Beth LeBlanc: The Michigan Supreme Court on Friday ended the chances of at least three Republican gubernatorial candidates to appear on the August primary ballot, siding with the state Bureau of Elections in ruling a deluge of forged signatures was enough to keep them from qualifying for the primary.",
    "THE CASH DASH\n A pro-Herschel Walker gas giveaway fuels Democratic outrage, by the Atlanta Journal-Constitution's Greg Bluestein: Democrats and voting rights groups quickly criticized the stunt, questioning how offering fuel vouchers to support a political candidate could be allowed in a state that bans groups from distributing refreshments to waiting voters in line to cast ballots.",
    "THE UNCALLED CHRONICLES  Cuellar expands lead over Cisneros, by San Antonio Report's Andrea Drusch: With final votes tallied Friday, Rep. Henry Cuellar expanded his election night lead over primary challenger Jessica Cisneros  to 281 in the race for the Democratic nomination in U.S. House District 28.",
    "Comptroller Peter Franchot had 20 percent on the Democratic side, to Wes Moore's 15 percent and former Labor Secretary Tom Perez's 12 percent, while Larry Hogan-endorsed state Commerce Secretary Kelly Schultz took 27 percent of the GOP respondents to 21 percent for Donald Trump-endorsed state Del.",
    "GUN POLITICS  Rep. Chris Jacobs (R-N.Y.) ended his reelection campaign late Friday after coming out in favor of new gun laws, via POLITICO's Bill Mahoney: The Republican faced rising backlash from the right following his announcement last week that he would support new gun control measures.",
    "About those attacks: Johnson has faced more than $500,000 in spending from Drain the DC Swamp PAC, including mail, digital ads and a TV ad calling him out for accepting the 2020 election results and supporting an independent commission to investigate the Jan. 6 Capitol attack.",
    "National Republicans are so concerned about this prospect that their top super PAC has poured some $1.9 million into their districts to prevent the incumbents from finishing behind another Republican in their June 7 all-party primary and getting locked out of November.",
    "Jacobs at a Friday press conference: The last thing we need is an incredibly negative half-truth filled media attack funded by millions of dollars of special interest money coming into our community around this issue of guns and gun violence and gun control.",
    "In response, the Congressional Leadership Fund, a group aligned with House Minority Leader Kevin McCarthy, has pumped more than $370,000 into the race and on Friday aired a TV ad hitting Mathys as weak on crime, according to AdImpact, a media tracking firm.",
    "AS SEEN ON TV\n Here's another GOP incumbent primary to watch: Congressional Leadership Fund went negative on GOP challenger and extremely frequent candidate Danny Tarkanian in NV-02, calling him a perennial loser on the wrong side of Trump on a few issues.",
    "Sensing opportunity, House Majority PAC, an outside group tied to Speaker Nancy Pelosi, is airing a spot on TV and digital platforms highlighting Valadao's impeachment vote and calling Mathys a true conservative who is 100 percent pro-Trump and proud.",
    "Presidential Big Board\n Sen. Ted Cruz to headline conservative event in Milwaukee, by the Milwaukee Journal Sentinel's Bil Glauber: Cruz returns to Milwaukee June 25 to headline an organizing event for conservatives at the Wisconsin Center.",
    "With the June 21 Republican Senate runoff fast approaching, Alabama presents an excellent opportunity for Trump to determine the outcome with a late endorsement  and thus burnish his win-loss record after a series of high-profile defeats.",
    "POLL POSITION\nCODA  HEADLINE OF THE DAY  Don't Worry, It Only SEEMS Like DC Is Being Swarmed by Snakes  Washingtonian\nFollow us on Twitter\nSteven Shepard @politico_steve\nZach Montellaro @zachmontellaro\nAlly Mutnick @allymutnick\nFollow Us",
    "A TIME FOR CHOOSING, OR MAYBE A TIME FOR SITTING ONE OUT  Trump weighs a big bet in Alabama Senate race, by POLITICO's Natalie Allison: Rep. Mo Brooks' (R-Ala.) return to MAGA's good graces has placed Trump in an awkward position.",
    "Valadao, running in a district Biden carried by 13 points, is one of the six House Republicans who voted to impeach Donald Trump now running for reelection  and he's the only one who avoided getting a Trump-endorsed challenger.",
    "But in her redrawn seat post-redistricting, 80 percent of the people are new to her  and she ended up in a primary with Greg Raths, a Mission Viejo councilman and Trump fanatic who was accused of making anti-Semitic comments.",
    "Reps. David Valadao and Young Kim are two of the GOP's most highly regarded incumbents, and for good reason  they won even though President Joe Biden did better in their districts than in any other Republican seat in 2020.",
    "Other speakers include conservative radio host Michael Berry, former acting U.S. Attorney General Matt Whitaker and Missouri Attorney General Eric Schmitt, who is running in a crowded Missouri GOP U.S. Senate primary.",
    "Trump's endorsement stumper: Family friends or fierce ally, by POLITICO's Joseph Spector: In New York's gubernatorial race, Donald Trump has known Andrew Giuliani since he was in diapers,' as one close aide put it.",
    "He touts himself as a strong conservative voice in one, fires back at attacks and lies in another and, in a third, calls GOP primary opponent Taffy Howard for not passing a single bill in the state legislature.",
    "Then there is former Westchester County Executive Rob Astorino, whose long friendship with Trump dates back to the former president's local property and golf course north of Trump Tower in Manhattan.",
    "Fetterman had a previously undisclosed heart condition, by POLITICO's Holly Otterbein: The disclosure explains \"why doctors implanted a pacemaker with a defibrillator into his heart last month.",
    "Fetterman, the state's lieutenant governor, released a letter from his physician that said he was diagnosed with a decreased heart pump' in 2017 after he came in because his feet were swelling.",
    "Cisneros' campaign said she's waiting for the final canvas by the state party to make an announcement on whether she will seek a recount, which she is qualified to do under Texas law.",
    "The early hours of their matchup, after Republican David McCormick conceded the GOP primary to Oz on Friday night, showed how each nominee hopes to puncture the other's public image.",
    "WFW Action Fund joined the fray in SC-01, attacking GOP Rep. Nancy Mace's challenger Katie Arrington, saying that she voted for the largest tax increase in South Carolina history.",
    "Operatives see a scenario where Valadao gets shut out of the general election, especially if Salas siphons off some of Valadao's crossover vote while Mathys pulls from the right.",
    "But both appear to be facing uncomfortably close primary contests on Tuesday  and a loss by either could seriously endanger the GOP's hold on their swing seats in the fall.",
    "Kim and the Congressional Leadership Fund have spent a combined total of more than $2.9 million on primary ads, according to AdImpact, trying to keep her in the top-two.",
    "Kim, one of the first three Korean-American women in Congress, was one of the GOP's top recruits in 2020, when she ousted Democratic Rep. Gil Cisneros in Orange County.",
    "Langworthy appears set to run; Tompkins County Legislator Mike Sigler announced he was dropping out of the race to support Langworthy late Friday, WIVB reported.",
    "The strong Republican political environment gives the GOP lots of paths to reclaiming the House majority even if Democrats flip these two California seats.",
    "A poll from the Baltimore Sun and the University of Baltimore found a pair of tight primaries with lots of undecideds in Maryland's open race for governor.",
    "However, Democrats landed a dream recruit this cycle in Rudy Salas, who has represented much of the district for the last decade in the state Assembly.",
    "On the Democratic side, DMFI PAC went up with an attack against Rep. Marie Newman, who's facing Rep. Sean Casten in a member-versus-member primary.",
    "I was very surprised by Congressman Jacobs' surprise announcement,' state GOP Chair Nick Langworthy told reporters in Albany earlier this week.",
    "House Republicans' California peril\nBy ALLY MUTNICK and SCOTT BLAND\n06/06/2022 10:00 AM EDT\nPresented by PREMION\nTOP LINE\nCALIFORNIA DREAMING?",
    "[James] Craig said last week he was weighing the possibility of a write-in campaign if ultimately determined ineligible for the August ballot.",
    "The former president also has a trusty ally in Long Island Rep. Lee Zeldin, who sided with Trump in voting to overturn the 2020 elections.",
    "The incumbent is getting super PAC backup on TV from Defending Main Street, which attacked Howard, and from American Dream Federal Action.",
    "It is notoriously hard to accurately poll or predict California's all-party primary system, so it's possible both incumbents win handily.",
    "Wealthy former gubernatorial candidate Carl Paladino is also among those jumping into the heavily Republican seat in Western New York.",
    "But even without Trump's support or the funds to run any TV ads, Republican Chris Mathys appears to pose a serious threat to Valadao.",
    "But if Raths or Mathys (or both) advance to the general, it would be a huge blow to GOP chances of holding those Biden-won seats.",
    "Valadao and Kim are proven fundraisers and also highly touted candidates that can bring tough districts in play for Republicans.",
    "From the DCCC: a first round of general election TV reservations, totaling $21.4 million with more presumably set to come later.",
    "But a loss by either incumbent would be a notable stumble for Republicans in a year where many other things are going right.",
    "Biden carried the district by 2 points in 2020 and the likely Democratic nominee is Asif Mahmood, a physician.",
    "You'll also receive daily policy news and other intelligence you need to act on the day's biggest stories.",
    "I think everybody was caught very flat-footed by his adopting the Democrat position on gun control.'",
    "Public polling has been scarce, but private surveys suggest that outcome is possible in both races.",
    "Johnson himself has released three straight-to-camera broadcast TV ads since May 26, per AdImpact.",
    "The Together for Truth' summit is being put together by the Cruz-aligned Truth and Courage PAC.",
    "Front-runner Katie Britt is the preferred candidate of Sen. Mitch McConnell, a Trump nemesis.",
    "The spot ends with a call to vote for Trump conservative [Rep.] Mark Amodei.",
    "A pair of House Republicans could be in for a uniquely California nightmare.",
    "Valadao is known for picking up Democratic and independent voters.",
    "June 7 primary has also attracted a burst of late advertising.",
    "The ad covers an ethics investigation against Newman.",
    "CAMPAIGN INTEL\nANOTHER ONE TO WATCH TUESDAY  Rep.",
    "Thoughts on the rest of the primary landscape?",
    "Let me know at amutnick@politico.com.",
    "But his choice isn't an obvious one.",
    "Brooks is a McConnell adversary.",
    "Subscribe to POLITICO Pro.",
    "Dusty Johnson's (R-S.D.)",
    "Dan Cox."
  ]
}