{
  "id": 9002,
  "mediaId": 223,
  "date": "6/5/2022 12:00:00 AM",
  "headline": "We Now Know Who's Pushing Biden on Student Loan 'Forgiveness' and Why",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/152/832d1eba-c494-408f-9b3e-50200d328fb3.jpg",
  "link": "https://townhall.com/tipsheet/leahbarkoukis/2022/06/05/stacey-abrams-responsible-for-pushing-wh-on-student-loan-debt-n2608208",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Leah Barkoukis",
  "authorUrl": "https://townhall.com/tipsheet/leahbarkoukis/",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "According to a conversation between The Washington Posts James Hohmann and The Bulwarks Charlie Sykes, Georgia Democrats Stacey Abrams and Raphael Warnock are putting tremendous pressure on the administration to move on student loan forgiveness.",
    "I mean, seriously, where does Joe Biden think this groundswell is going to come from, except for this small group of highly-entitled college graduates who dominate the staffing and the inner workings of the Democratic party?",
    "Source: AP Photo/Evan Vucci\nPresident Biden is inching closer to forgiving student loansa move that is not only illegal but profoundly unfair to hardworking taxpayers, most of whom never went to college.",
    "(The Bulwark)\nAs Hohmann acknowledges, Biden administration officials know \"this is a complete disaster for them\" but whether they are putting up a fight against it is unclear.",
    "James Hohmann: Stacey Abrams has been browbeating the White House on this, and says that this is the only way she could win  that this is going to be a base turnout election.",
    "And the base isnt going to turn out if they dont do this, and that they have all sorts of stats about how a lot of graduates from HBCUs have all this debt.",
    "And Ive asked a lot of people in the White House this question, and essentially the answer is that this is the fault of Stacey Abrams and Raphael Warnock.",
    "Others who did go made sacrifices to pay off their loans and are now deeply resentful that a swath of borrowers may have their debts cleared.",
    "And so there are a lot of people very close to the president who privately understand that this is a complete disaster for them.",
    "Now we know why President Biden is actually entertaining such a foolish idea to cancel up to $10,000 of debt per borrower.",
    "You look at the states  like Minnesota, Wisconsin, Michigan, Ohio  what percentage of the population has college degrees?",
    "The reported plan would be limited to single borrowers making under $150,000 and married couples earning under $300,000.",
    "And yet you are asking all of those people who are experiencing high anxiety to pay for this transfer of wealth.",
    "And then Im sorry, I know that Twitter is not real life  but all of these folks saying, This is a betrayal.",
    "But the president is being pulled really hard by these woke leftists who  believe its all about the base.",
    "They just dont get it because they havent spent time in the WOW counties or in Apple Valley, Minnesota.",
    "If the Democrats are only going to forgive $10,000, well, then Im not going to vote for them.",
    "Both Abrams and Warnock are in competitive races, with the former up against Republican Gov.",
    "This isnt about persuading people in the middle, its about getting the base to turn out.",
    "Brian Kemp and the latter facing off against former NFL player Herschel Walker.",
    "Abrams argues its the only way to get the base to turn out.",
    "James Hohmann: Ive asked, Ive repeatedly asked people.",
    "Charlie Sykes: How did they not get this?",
    "James, Im sorry How do they not get this?",
    "I have $50,000 in college debt.",
    "Charlie Sykes: What?",
    "Suck it, Buttercup.",
    "Only $10,000?"
  ]
}