{
  "id": 9111,
  "mediaId": 19,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Pro-Herschel Walker Group's Gas Giveaway in Atlanta Sparks Democrat Outrage",
  "image": "https://media.breitbart.com/media/2022/06/GettyImages-1240751241-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/06/06/pro-herschel-walker-groups-gas-giveaway-in-atlanta-sparks-democrat-outrage/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    815
  ],
  "sentences": [
    "#gapol pic.twitter.com/yProirnNg3\nNguyen and MeidasTouch both backed up their claims of illegality by citing a law that states, Any person who gives or receives, offers to give or receive, or participates in the giving or receiving of money or gifts for the purpose of registering as a voter, voting, or voting for a particular candidate in any primary or election shall be guilty of a felony.",
    "Democrats have widely mischaracterized the electioneering provision of the bill as being a means to deprive thirsty voters in long lines of a basic necessity, but they continuously fail to acknowledge that unattended water coolers are permissible at polling places and that voters can bring their own water if they like.",
    "Langhofer added, Warnock's campaign is upset about 34N22's community outreach program, not because of any earnest legal concerns, but because they don't want the public to know Warnock has contributed to record gas prices and the pain Georgians are feeling at the pump.",
    "https://t.co/QxvM1IqXZk\nThe left-wing group MeidasTouch sent out on social media a breaking alert that said, Herschel Walker PAC caught potentially committing both federal and state felonies after bragging about free gas giveaway in Atlanta in an attempt to buy votes.",
    "Representatives for 34N22 could be seen at the event holding signs that read gas prices are insane and Warnock isn't working, a reference to Sen. Raphael Warnock (D-GA), who Walker is hoping to unseat in the Georgia battleground's U.S. Senate race this year.",
    "Democrats such as former Atlanta Mayor Keisha Lance Bottoms, Black Voters Matter cofounder LaTosha Brown, and secretary of state candidate Bee Nguyen all took issue with 34N22's giveaway, which took place at a gas station near downtown Atlanta.",
    "Some of the Democrats recalled Georgia's Election Integrity Act of 2021, which aimed to prevent electioneering by prohibiting individuals within a designated radius of giving out water to voters waiting in polling lines.",
    "A Walker campaign aide confirmed to Breitbart News that Walker had not been aware that the giveaway event was happening, which is in line with federal law that prohibits candidates from coordinating with super PACs.",
    "The pro-Walker group handed out at the giveaway more than $4,000 total in vouchers, right as gas prices were hitting new record highs after Memorial Day weekend strained the nation's already lacking fuel supply.",
    "Georgia Democrats are voicing their anger after a super PAC supporting Republican Herschel Walker gave out vouchers for gas, which is surging nationally in cost, in a deeply blue area of Atlanta on Friday.",
    "The group provided a memo from attorney Kory Langhofer to Breitbart News that points to the fact that the gas vouchers, which were given away in $25 increments, were given without condition.",
    "Nguyen said, In 2020, the Secretary of State sent an investigator to one of the precincts in my district  with firearm on hip  and demanded all food & water to be removed.",
    "The group shared a couple clips of the positive feedback they had received on social media:\nSeems like we struck a nerve with the Warnock campaign.",
    "They are working to discredit black groups, flood us with disinformation and give throw buy-off gimmicks and not any real needed support to people.",
    "Brown called the gas giveaway ILLEGAL, describing 34N22 as desperate and reckless and accusing its members of working to discredit black groups.",
    "#gapol pic.twitter.com/oom1iZj3GJ\nWhile #WarnockIsntWorking, voters know @HerschelWalker will help lower prices for every Georgian!",
    "Additionally, despite high turnout in this year's primary, lines appeared to be a nonissue under the new voting law.",
    "You will receive email marketing messages from Breitbart News Network to the email you provide.",
    "Maybe they shouldn't have a candidate who votes to raise gas prices on hardworking Georgians?",
    "Giving away gas vouchers & Herschel Walker flyers at the same time isn't legal.",
    "34N22 countered however that the giveaway was entirely lawful and permissible.",
    "By subscribing, you agree to our terms of use & privacy policy.",
    "Anywayshere's more content from our legal gas giveaway today!",
    "They are handing campaign cards with $25 vouchers for gas?!",
    "In Georgia, you can give away gas but not water to voters?",
    "Like y'all they are THAT desperate and reckless.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "Follow her on Twitter at @asholiver.",
    "You may unsubscribe at any time.",
    "Ohok Bottoms stated.",
    "This is ILLEGAL!!"
  ]
}