{
  "id": 9112,
  "mediaId": 195,
  "date": "6/5/2022 12:00:00 AM",
  "headline": "Republican politicians are hiding behind the Second Amendment",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/06/potw_060322_800.500_10.jpg?w=800&h=500&crop=1",
  "link": "https://thehill.com/opinion/criminal-justice/3512235-republican-politicians-are-hiding-behind-the-second-amendment/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Glenn C. Altschuler",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "Herschel Walker, the GOP candidate for the U.S. Senate from Georgia, who was accused in 2005 of holding a gun to his then-wife's head and threatening to blow her brains out, wondered, What about looking at getting a department that can look at young men that's looking at women that's looking at their social media  and funding it by cutting the budget of the department that just wants to take away your rights.",
    "In an address to the NRA, former President Trump reaffirmed his support for enhanced mental health services; training and arming teachers and administrators; fencing, metal detectors, and a single point of entry for schools; and, most of all, the Second Amendment.",
    "Hours after the mass shooting in Uvalde, Texas, Amanda Gorman, America's first National Youth Poet Laureate, gave voice to her grief and outrage about students scared to death, under desks, riddled with bullets: It takes a monster to kill children, she tweeted.",
    "Just 5 percent of the population of the world, the U.S. has 40 percent of the civilian-owned weapons; 20 million of them are AR-15-style rifles, which, along with large capacity magazines, are not designed for hunting or personal safety.",
    "Australia, which has a gun culture somewhat similar to that in the United States, enacted a mandatory gun buyback in 1996, targeting semi-automatic weapons, and then tightened the gun registration and licensing process.",
    "When Sen. Ted Cruz (R-Texas), who has accepted more money from the gun lobby for his campaigns and political action committees than any other member of Congress, was asked, Why does this happen only in your country?",
    "As Robert J. Spitzer has demonstrated in Guns Across America, states and localities have enacted hundreds of laws regulating the acquisition, sale, use, and deprivation of the use of guns since the 18th century.",
    "States and localities could limit possession of firearms by felons and mentally ill individuals, set conditions for commercial sale and regulate bringing guns into schools and public buildings.",
    "A few days later, Gorman added a hymn to the hurting: May we not just ache, but act;/ May our signed right to bear arms/ Never blind our sight from shared harm.",
    "They have no right to remain silent, change the subject, or hide behind the Second Amendment to block sensible, substantive, life-saving legislation.",
    "Rep. Mo Brooks (R-Ala.) blamed mass shootings on a decline of moral values in the United States, specifically citing single-parent households.",
    "France has 2.8; Israel 2.1; Canada 2.1; Norway 1.8; Italy 1.3; Australia 1; Germany 0.99; Great Britain 0.2; South Korea 0.08; Japan 0.06.",
    "Those are the facts: The Second Amendment need not  and should not  be used to prevent enacting substantive policies based on them.",
    "The overall per capita homicide and suicide rates are significantly higher in the United States than in other Western democracies.",
    "Between 2009 and 2020, the United States has had at least 277 mass shootings, resulting in 1,565 deaths and 1,000 wounded.",
    "In District of Columbia v. Heller (2008), the Supreme Court affirmed a constitutional right for citizens to possess guns.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "He is the co-author (with Stuart Blumin) of Rude Republic: Americans and Their Politics in the Nineteenth Century.",
    "Between 2009 and 2018, the United States had 288 school shootings (some of them not defined as mass shootings).",
    "A few examples:\nRep. Paul Gosar (R-Ariz.) identified the Uvalde shooter as a transsexual leftist illegal alien.",
    "State and federal courts have repeatedly upheld the constitutionality of a wide array of gun control measures.",
    "Glenn C. Altschuler is the Thomas and Dorothy Litwin Professor of American Studies at Cornell University.",
    "Several countries adopted gun control laws following mass shootings and dramatically reduced fatalities.",
    "But to watch monsters kill children again and again and do nothing isn't just insanity  it's inhumanity.",
    "Nor have Republicans addressed the massive evidence that supports the claim that guns are the problem.",
    "The United States has 12.2 firearm-related deaths (homicides and suicides) per 100,000 residents.",
    "In his decision, however, Justice Antonin Scalia noted that the right was by no means unlimited.",
    "But Republicans' comments on causes and remedies signal that they may ache, but will not act.",
    "responded with a non sequitur: Why is it that people come from all over the world to America?",
    "Republican politicians have every right to emphasize their support of the Second Amendment.",
    "Civilians in the United States possess 393 million firearms, 120.5 for every 100 people.",
    "They are at odds with history and conservative jurisprudence about the Second Amendment.",
    "In the 1920s and 30s, for example, 28 states enacted anti-machine gun legislation.",
    "Politicians in both parties rushed to the cameras to express their sympathy.",
    "In 1987, the UK banned semi-automatic weapons, and most handguns in 1996.",
    "Canada and France had two, Germany one  Japan, Italy, and the UK, none.",
    "The Falkland Islands ranks a distant second, with 62.1 per 100 people.",
    "Because it's the freest, most prosperous, safest country on earth.",
    "It now has one of the lowest gun-related death rates in the world.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Gun regulation is as American as the right to gun ownership.",
    "Fears of a blowback at the ballot box never materialized.",
    "Gun-related homicides and suicides plummeted.",
    "Why do you not think guns are the problem?",
    "53 Americans die each day from a firearm.",
    "Yemen is third, at 52.8."
  ]
}