{
  "id": 9115,
  "mediaId": 65,
  "date": "6/3/2022 12:00:00 AM",
  "headline": "Raphael Warnock aims to make Herschel Walker his own worst enemy in Georgia's high-stakes Senate showdown",
  "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/06/1862/1048/GettyImages-1240751241-e1654182523515.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/politics/raphael-warnock-herschel-walker-georgia-senate",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815
  ],
  "sentences": [
    "WHAT OUR LATEST FOX NEWS 2022 SENATE AND GOVERNOR POWER RANKINGS SHOW\nA recent state of the race memorandum from the Warnock campaign claimed that \"Walker enters the general election already damaged by months of reporting on his outrageous and false claims, including lies about his business record and growing questions about his readiness to serve Georgians in the U.S.",
    "The Democratic Party of Georgia went up with a video right after the primary that charged that \"Walker is not ready to represent Georgia\"\nAnd Senate Majority PAC, the top outside group that backs Senate Democratic incumbents and candidates and which is aligned with Majority Leader Chuck Schumer, has reserved a whopping $25 million to run spots in Georgia.",
    "Thanks to his legendary status among many in Georgia and his immense, favorable, name recognition in the Peach State, Walker instantly became the overwhelming front-runner for the GOP Senate nomination and basically ignored the field of lesser-known primary rivals, declining to take part in debates as he focused his campaign on Warnock.",
    "Walker, who won a Heisman Trophy and helped steer the University of Georgia to a college football national championship four decades ago, jumped into the GOP race to face off against Warnock last year after months of support and encouragement to run for the Senate by former President Donald Trump, his longtime friend.",
    "The spot by the Warnock campaign, coming just nine days after the senator and Walker each easily won their party's Senate nominations in Georgia's May 24 primaries, is the latest evidence that the Democrats intend to target the first-time candidate for what may be a treasure trove of political baggage.",
    "Aiming to make Walker his own worst enemy as he tries to defeat Warnock in battleground Georgia's high stakes Senate showdown, Warnock's campaign this week went up with a statewide TV ad that spotlights past comments by Walker saying that had a \"dry mist\" that would \"kill any COVID on your body.\"",
    "In March, one of his top rivals  Georgia agriculture commissioner Gary Black  went up with a scathing digital ad that spotlighted alleged past violent behavior by Walker, including an alleged incident where Walker held a razor to his ex-wife's throat, choked her, and later put a gun to her head.",
    "While Democrats and the Warnock campaign aim to make the general election all about Walker, his past controversies, and whether he's ready for prime time, Republican strategists insist the race will be a referendum on Warnock, fellow congressional Democrats and President Biden.",
    "The GOP needs a net gain of just one seat in November's midterm elections to win back the Senate majority they lost when they were narrowly swept by Warnock and now-Sen. Jon Ossoff in Georgia's twin Jan. 5, 2021, Senate runoff elections.",
    "Walker was dinged by numerous reports that he had over inflated the success of his chicken distribution business, and the Democratic Party of Georgia's spotlighted reports that Walker and his businesses owed millions in unpaid loans.",
    "A Georgia based Republican strategist, who asked to remain anonymous to speak more freely, told Fox News at the time that \"every Republican in Georgia now knows what the ads against Herschel will look like in the general election.\"",
    "But some Republicans in Washington and Georgia were concerned at the time that Walker was untested on the campaign trail and worried about his political baggage that could give Warnock and the Democrats plenty of ammunition.",
    "Walker, whose relationship with the former president goes back to his days playing for the Trump-owned New Jersey Generals USFL football team in the 1980s, was a major Trump supporter and surrogate in the 2020 election.",
    "It didn't take Democratic Sen. Raphael Warnock of Georgia to spotlight what his campaign argues are \"bizarre or false statements\" made by GOP challenger and former college and pro football star Herschel Walker.",
    "Black and his campaign stressed that it was \"imperative to have this discussion about Walker during the Republican primaries rather than during the general election, when it will be \"too late.\"",
    "\"This race is going to be a referendum on Raphael Warnock and Joe Biden's records and that's why we're going to win, because voters are incredibly disenchanted with their records,\" he said.",
    "CLICK HERE FOR THE LATEST FOX NEWS REPORTING FROM THE CAMPAIGN TRAIL\nWalker for years has openly discussed his struggles with a mental illness known as dissociative identity disorder.",
    "GAME ON IN GEORGIA IN HIGH STAKES GUBERNATORIAL BATTLE BETWEEN KEMP AND ABRAMS\nThe ad showcases a Walker interview from 2020  during the first year of the global coronavirus pandemic.",
    "The spot also highlighted other alleged incidents of violence with other woman before the narrator asks \"how many more women are out there, and what stories might they tell?\"",
    "Walker spotlighted his mental health challenges in a 2008 book, writing that he was able to overcome his multiple personalities with therapy and his faith in Christianity.",
    "Sending inflation through the roof and raising gas and grocery prices over ten percent on hard-working Georgians,\" the narrator claims in a new commercial by One Nation.",
    "That's the non-profit advocacy group tied to Senate Leadership Fund, the top outside group backing Senate Republicans and linked to longtime GOP Leader Mitch McConnell.",
    "While Senate Majority PAC has yet to launch a commercial taking aim at Walker in Georgia, their GOP counterpart is already up with ads targeting Warnock.",
    "Do you know right now, I have something that can bring you into a building that would clean you from COVID as you walk through this, this dry mist.",
    "That's the group's second largest reservation, behind the $26 million they plan to spend in battleground Pennsylvania's open Senate seat race.",
    "He's going to try to deflect and distract voters from his record,\" Senate Leadership Fund communications director Jack Pandol told Fox News.",
    "The ad asked GOP voters in Georgia to \"imagine what Democrats would do to Herschel Walker if he becomes the Republican nominee.\"",
    "\"Tell Senator Warnock to stop fighting for reckless spending and start fighting inflation,\" the narrator stresses.",
    "\"Senator Raphael Warnock was the deciding vote for President Biden's multi-trillion-dollar spending spree.",
    "Warnock doesn't appear until the very end of the 30-second spot, when he says \"I approve this message.\"",
    "The Warnock ad appears to be an appetizer for things to come as the general election campaign heats up.",
    "\"Sen. Warnock has a voting record that he has to defend in the general election.",
    "As you walk through the door, it will kill any COVID on your body.",
    "When you leave, it will kill the virus as you leave,\" Walker says.",
    "Now, those predictions may be coming to fruition.",
    "\"I'm gonna say something I probably shouldn't.",
    "\"They don't want to talk about that.",
    "They don't want to hear about that.\"",
    "Senate.\""
  ]
}