{
  "id": 1048,
  "mediaId": 2644,
  "date": "2022-04-06",
  "headline": "Lawmakers rage as Pentagon says it won’t put troops at Mexico border",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/04/newspress-collage-21804089-1649273585698.png?w=1024",
  "link": "https://nypost.com/2022/04/06/republicans-rage-as-pentagon-says-it-wont-put-troops-on-border/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Callie Patteson",
  "authorUrl": "",
  "termIds": [
    1298,
    2936,
    3975,
    4042,
    4277,
    1128,
    1131,
    1172
  ],
  "sentences": [
    "Additional personnel for monitoring “would have been very helpful,” Cuellar added, claiming that approximately 60% of Border Patrol agents in the Rio Grande Valley sector are “doing processing duties.”\n“So that means that we’ve only got 40% of the Border Patrol [in the field] and if the National Military, the Department of Defense is not going to help us with monitoring and helping us at the border — and we are literally working with only 40% of the Border Patrol on the field — I think that number by itself should get the Department of Defense to rethink their support mission,” the congressman said.",
    "Gen. Glen Vanherck, head of the North American Aerospace Defense Command, told the Senate Armed Service Committee that the department was planning to “provide additional capability or capacity based on the potential for additional immigration, or folks coming to the southwest border.”\nThe Department of Defense confirmed the request to The Post on Wednesday, revealing that Defense Secretary Lloyd Austin has “authorized some DoD support.”\nHowever, the support will be limited and will not include “additional personnel sent for the monitoring mission” or guarding the border.",
    "“With their decision to offer zero support to assist Border Patrol officials prevent a massive surge of illegal aliens, the Pentagon is acting as a welcome wagon by aiding and abetting the tens of thousands of lawbreakers waiting to rush the border as soon as Biden’s reckless decision to lift Title 42 is enacted, worsening the full-scale invasion of our country that is occurring because of the Biden administration’s open border policies,” Gosar told The Post.",
    "“When international threats are at their highest in recent years, President Biden is directing our military to focus on transporting and babysitting illegal immigrants instead of securing our nation,” said Rep. Debbie Lesko (R-Ariz.) “If the Biden Administration and Democrats had not taken every action they could to open our border and incentivize illegal immigration, we would not be in the position we are now.",
    "“They need Biden to take his foot off their throats and empower them to do their job by having their back and giving them the resources they have been deprived since Biden took office.”\nRep. Paul Gosar (R-Ariz.), who has repeatedly criticized the administration for planning to lift Title 42, accused the Pentagon of “acting as a welcome wagon” for migrants seeking to cross the border in the coming months.",
    "“On Saturday, Secretary Austin approved DoD support to DHS regarding the anticipated surge in irregular migration along the southwest border to help DHS execute its mission of providing appropriate humanitarian care to migrants in its custody,” Pentagon press secretary John Kirby said in a statement.",
    "As the Biden administration scrambles to prepare for an expected surge in illegal immigration after the Title 42 health authority is lifted next month, the Pentagon has promised to provide “some” support — but will not go so far as to put forces on the southwestern border.",
    "Refusing to monitor or protect our border goes against the entire point of having a military.”\n“Our southern border will become completely unrecognizable when Title 42 is lifted, and we can expect it to be a full-scale invasion,” Rep. Ronny Jackson (R-Texas) told The Post.",
    "“While the drumbeat for war in far-off lands seldom ceases among the political class at the Pentagon, these Washington insiders never want to defend our own borders from illegal immigration, illegal drugs, or dangerous criminals,” Rep. Yvette Herrell (R-NM) told The Post.",
    "Rep. Henry Cuellar (D-Texas) told The Post in an interview that he would “prefer” the department continue to support the monitoring mission, noting DoD officials have been seen at bridges and in Border Patrol vehicles in the past.",
    "“The Secretary also approved in principle providing land sites on DoD military installations for processing of migrants, and providing lodging for Federal employees supporting the mission, should it be needed,” he continued.",
    "The order was first imposed in March 2020, at the outset of the pandemic, and has allowed border officials to immediately expel nearly 2 million migrants who have attempted to enter the US without hearing asylum claims.",
    "Joe Manchin of West Virginia and Kyrsten Sinema and Mark Kelly of Arizona — have slammed the administration for lifting Title 42, citing both the ongoing pandemic and an expected migrant influx of up to 170,000 people.",
    "That support will include contracting 40 commercial buses to transport migrants from border ports of entry to other locations for processing, as well as having medical personnel on standby, Kirby said.",
    "“I see this is a little bit more limited and again, understanding that the military does not enforce immigration law, but the past support they’ve provided [is] to monitor or even assist,” he said.",
    "Currently, it has been approved for 90 days and “will be provided on a reimbursement basis.”\nRepublicans representing border states lashed out at the DoD over its statement Wednesday.",
    "Biden needs to secure our border and let our troops do the job they were trained to do.”\nEven some Democrats expressed frustration that the Pentagon was not doing more immediately.",
    "MS-13 gang members and other known criminals have already exploited Biden’s Border Crisis and they can’t wait to make matters even worse without Title 42 in place.",
    "If DHS were to send a request for continued assistance along the border, DoD would consider it,” Defense Department spokesman LTC Chris Mitchell told The Post.",
    "“The Department has been supporting this DHS-led mission since 2006, spanning the Bush, Obama, Trump, and now the Biden administrations along the way.",
    "“CBP [Customs and Border Protection] and ICE [Immigration and Customs Enforcement] do not need the DoD to carry out their obligations,” Jackson added.",
    "“Pentagon politicos who whined when asked to build a border wall are now facilitating the final mile of trafficking illegal immigrants.",
    "Last month, the Department of Homeland Security requested help as border officials brace for record-high numbers of encounters.",
    "“This does a disservice to the great men and women of our Armed Forces who honorably serve their country every day.",
    "Last week, the Centers for Disease Control and Prevention announced Title 42 would be lifted on May 23.",
    "But for some folks, you know, for the White House, they feel that the pandemic has gone at the border.”",
    "Cuellar confirmed to The Post on Wednesday that he too would like to see the order extended.",
    "In a separate statement, the Pentagon appeared open to sending troops to the area.",
    "When will the Biden administration defend America?” added Harrell.",
    "Several members of both parties — including Democratic Sens.",
    "It is unclear when the support will go into effect.",
    "It’s gotten better but I don’t think it’s gone.",
    "“I wouldn’t say that the pandemic is gone.",
    "“I mean, we still got problems,” he said.",
    "“Enough is enough!"
  ]
}