{
  "id": 2885,
  "mediaId": 2746,
  "date": "2022-03-14",
  "headline": "Women’s anti-violence law keeps transgender access provision",
  "image": "https://twt-thumbs.washtimes.com/media/image/2019/12/18/Trump_Impeachment_75150.jpg-c9274_c49-0-2761-1582_s1200x700.jpg?1eadc4e7cd341de0b5412ea482fc1e3356dba98d",
  "link": "https://www.washingtontimes.com/news/2022/mar/14/womens-anti-violence-law-keeps-transgender-access-/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Ferrechio",
  "authorUrl": "https://www.washingtontimes.com/staff/susan-ferrechio/",
  "termIds": [
    2461,
    301,
    1124
  ],
  "sentences": [
    "The measure establishes an office for determining the placement of “individuals” in federal prison, based on whether they have children as well as “any other factor the office determines to be appropriate.”\nSeveral blue states have started allowing transgender women to be housed in women’s prisons, and some female prisoners forced into cells with biological men say they have been sexually assaulted.",
    "“I think a lot of people believed fully that these definitions are gone, but unfortunately, they’re still very much enforced.”\nThe language dovetails with executive action by the Biden administration changing how transgender people are incarcerated in federal prisons.",
    "The provision means that domestic violence shelters, rape crisis centers, homeless shelters and other facilities serving vulnerable women and also accepting federal dollars under the anti-violence act cannot turn away biological men who identify as women.",
    "A program cannot isolate or separate you just because you are transgender.”\nAdvocates of the policy say transgender people have been denied access to shelters, leaving them vulnerable and lacking protection from domestic violence situations.",
    "While some Republicans had fought to remove the language from the bill, citing safety and privacy concerns for biological women seeking domestic violence help, Senate negotiators left it in the reauthorization, which expires in 2027.",
    "Mrs. Perry said “the door is left open” in the Violence Against Women Act for encoding into law Mr. Biden’s executive order allowing biological men to be housed with women in federal prisons if they identify as transgender.",
    "Trans-rights activists promote the law to transgender women, assuring them they cannot be turned away from a women’s shelter or program if it accepts Violence Against Women Act money, even though they are biologically male.",
    "A broad measure to address violence against women has cleared Congress with language that extends a provision prohibiting domestic violence shelters from denying access to biological men who identify as women.",
    "Republicans successfully fought to exclude language that would have prohibited gun ownership for anyone convicted of a misdemeanor stalking or abuse charge, which gun rights advocates said was overly broad.",
    "“In making housing unit and programming assignments, a transgender or intersex inmate’s own views with respect to his/her own safety must be given serious consideration,” the manual states.",
    "They hailed it as a victory for victims of domestic violence in need of intervention and support and said the modernized measure will increase funding, improve access and expand services.",
    "Republicans sought unsuccessfully to remove the transgender language in the House version of the bill, which passed last year and served as the basis for the Senate compromise.",
    "“Sex-segregated shelters provide a safe place for women who have been abused, often at the hands of men, and to offer them a sense of privacy and security,” she said.",
    "Lawmakers reauthorized the Violence Against Women Act, which was first passed in 1994 but lapsed this month because of a partisan battle over provisions in the bill.",
    "Organizations that accept money from the program, including the many shelters run by religious groups, are banned from turning away men who identify as women.",
    "Mrs. Lesko argued against allowing transgender women in shelters and accused Democrats of putting “leftist ideology” ahead of the needs of vulnerable women.",
    "The legislation leaves in place a prohibition on denying domestic violence services to people based on gender identity, including men who identify as women.",
    "“This bill puts partisan political priorities ahead of women in need,” said Rep. Debbie Lesko, Arizona Republican and a domestic violence survivor.",
    "The requirement in the Violence Against Women Act for accommodating transgender women is stringent for homeless and domestic violence shelters.",
    "It calls for federal prisons to consider housing transgender inmates “on a case by case basis,” and not based solely on biological gender.",
    "“It’s been sort of surprisingly under the radar,” said Sarah Parshall Perry, a constitutional scholar with The Heritage Foundation.",
    "“Under VAWA, you have the right for your gender identity to be respected,” the D.C.-based group Transequality says on its website.",
    "It defined who cannot be turned away from services by listing “gender identity” alongside race, ethnicity and sexual orientation.",
    "The Transgender Offender Manual, issued in January, restarts an Obama-era policy that was paused under the Trump administration.",
    "The provision, more than 300 pages long, represents a compromise negotiated last month between Senate Democrats and Republicans.",
    "Nondiscrimination language for transgender people was first added to the Violence Against Women Act in 2013.",
    "The language was tucked inside a massive omnibus spending bill to keep the government funded until October.",
    "You should not be asked to prove your gender with medical or legal documents.",
    "Forcing transgender women to use men’s shelters is dangerous, they say.",
    "“That means being treated as the gender you say you are."
  ]
}