{
  "id": 3730,
  "mediaId": 2658,
  "date": "2022-02-25",
  "headline": "Washington weighs Ukraine aid",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/02/25/washington-weighs-ukraine-aid-00011723",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1506,
    2599,
    2790,
    3232,
    3267,
    4682,
    262,
    5287,
    5366,
    5390
  ],
  "sentences": [
    "McCarthy's involvement suggests that this year, he won’t shy away from intervening in deep-red primaries if the outcome could determine whether he leads a majority that is largely aligned with his goals — or one with a significant faction of rabble-rousers willing to publicly stymie his plans,” report Ally Mutnick, Olivia Beavers and Elena Schneider.",
    "QUICK LINKS\nPhotos show the calamity as Russia invades Ukraine, from NPR\nAdvocates urge protections for Ukrainians in US, from Caroline Simon at CQ Roll Call\nSpare the bear: Hank the Tank avoids death, relocation thanks to DNA evidence, from The Sacramento Bee\nTRANSITIONS\nIan Mariani is now comms director for Rep. Salud Carbajal (D-Calif.).",
    "House Oversight Committee Chair Carolyn Maloney (D-N.Y) is asking the National Archives to provide information about top Trump advisers’ discussions about preserving and storing White House records — amid growing evidence that they repeatedly ran afoul of record-keeping requirements for documents and social media accounts.",
    "TRIVIA\nTHURSDAY’S WINNER: Jonathan Paret correctly answered that Firesign Theater was the comedy group that spoofed two heroes of the Russian communist party on their 1969 album cover for “All Hail Marx & Lennon.”\nTODAY’S QUESTION: The “Adams sofa” in the House collection got its name from what event?",
    "“This Committee plans to get to the bottom of what happened and assess whether further action is needed to prevent the destruction of additional presidential records and recover those records that are still missing,” Maloney said in a five-page letter to National Archivist David Ferriero.",
    "They waged separate challenges to the 2020 election results, announced their support for different candidates in Missouri’s hotly contested GOP Senate primary and bottled up separate groups of President Joe Biden’s nominees in protest of his foreign policy,” writes Burgess.",
    "Washington weighs Ukraine aid\nBy KATHERINE TULLY-MCMANUS\n02/25/2022 07:14 AM EST\nPresented by Connected Commerce Council\nWith help from Nicholas Wu\nHURRY UP AND WAIT — Is it already too late for any cash congress can come up with to help Ukraine fight the Russian invasion?",
    "Marjorie Taylor Greene (R-Ga.): “I'm all about the civil war in the GOP.”\n“This March primary for a deep-red seat pits MAGA forces against the Republican establishment, and the skirmish is part of a larger fight to determine the contours of a possible new GOP majority.",
    "A senior defense official said the move aims “to reassure NATO allies, deter Russian aggression and be prepared to support a range of requirements in the region.”\nSoccer sanctions: The Champions League final has been booted from St. Petersburg.",
    "Yesterday Biden also briefed the top four leaders in Congress: Speaker Nancy Pelosi (D-Calif.), House Minority Leader Kevin McCarthy (R-Calif.), Senate Majority Leader Chuck Schumer (D-N.Y.) and Senate Minority Leader Mitch McConnell (R-Ky.).",
    "He is the former deputy press secretary for Andrew Yang’s New York City mayoral campaign and is an alum of the office of former Bronx Borough President Ruben Diaz Jr.\nTODAY IN CONGRESS\nThe House convenes at 12:30 p.m. for a pro forma session.",
    "— Both the House and Senate blasted out guidance to employees Thursday about the potential for cyber threats related to “the current geopolitical situation” and “increased tensions in eastern Europe.” Euphemisms were bountiful.",
    "But his top GOP counterpart on HASC, Alabama Rep. Mike Rogers, wants Congress to cut recess short for votes on GOP-backed sanctions legislation that would give Kyiv millions of dollars in new foreign military financing.",
    "A DIFFERENT KIND OF PROXY — There’s a hot GOP primary in Texas that is shaping up to be a proxy war for the battle for the future of the Republican party and McCarthy has weighed in on the side of the establishment.",
    "JOSH AND TED LOOK AHEAD — “In a chamber crowded with ambitious Republicans seeking to command the conservative lane should former President Donald Trump pass on a 2024 run, [Josh] Hawley and [Ted] Cruz stick out.",
    "Among the requests is an inquiry related to White House employees or contractors finding paper in a White House toilet, a reference to an anecdote in a forthcoming book by New York Times reporter Maggie Haberman.",
    "The guidance was pretty straightforward: update your browser, software and operating systems, avoid clicking links in emails, use multifactor authentication and report suspicious or malicious activity.",
    "He has told the White House that there would be “broad bipartisan support” on the Hill for an emergency spending bill for Ukraine and that the Senate could move a measure as soon as next week.",
    "The Biden administration hasn’t formally asked Congress for additional funding for Ukraine (yet), but leaders on Capitol Hill are prepared to move quickly if the request comes.",
    "DOCUMENT DUMP?— House Democrats are stepping up their investigation into former President Donald Trump’s handling sensitive presidential records, Nicholas and Kyle report.",
    "The 87-year-old was elected to another six-year term in 2020 and would serve through the end of the year, triggering a competitive GOP primary in deep red Oklahoma.",
    "Will Congress end up where it did on sanctions before the invasion — with a bipartisan desire to counter Putin more strongly but little consensus on specifics?",
    "Already out the door: Last month the Biden administration sent $200 million worth of anti-armor missiles, ammunition and other military equipment to Ukraine.",
    "“We do need to try and help them as much as possible, and it is quite possible that what we’re looking at here is a more long-term insurgency,” he told CNN.",
    "White House staffers reportedly found pieces of paper flushed down White House toilets, leading them to believe Trump was attempting to destroy documents.",
    "House Armed Services Chair Adam Smith (D-Wash.) said Thursday that it might be too late for a short term weapons infusion to counter the Russian assault.",
    "BRIEFINGS ON BRIEFINGS ON BRIEFINGS — Next week there will be in-person classified briefings for lawmakers on the situation in Ukraine.",
    "But GOP senators are expected to try and talk Inhofe out of leaving office early, a person familiar with Inhofe’s plans told Burgess.",
    "Jeannine Bender is now legislative director for Rep. David McKinley (R-W.Va.), focusing primarily on health care and telecom.",
    "The House warning was sent to all employees while the Senate version was only sent to an opt-in cybersecurity advisory list.",
    "Sen. Jim Mountain Inhofe (R-Okla.) is expected to announce that he plans to leave the Senate at the end of the year.",
    "The Senate’s failed deterrent sanctions package would have included significant lethal military aid.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Friday, February 25.",
    "Dana Larkin is now scheduler and special projects coordinator for Sen. Elizabeth Warren (D-Mass.).",
    "Andrew, Connor O’Brien and Jenn Scholtes have more: Congress wants to go further for Ukraine.",
    "In addition, the State Department also authorized a $6 billion sale of tanks to Poland.",
    "Yana Mayayeva has been promoted to be chief of staff for Rep. Jackie Speier (D-Calif.).",
    "Just yesterday the Pentagon announced the deployment of 7,000 more troops to Germany.",
    "Those follow unclassified phone briefings held last night for the House and Senate.",
    "She most recently was a legislative policy staffer for Rep. Debbie Lesko (R-Ariz.).",
    "(h/t our defense editor Dave Brown for the “Outhofe” pun)\nHUDDLE HOTDISH\nCYBER WAR?",
    "He most recently was a professional staff member for the Senate Budget Committee.",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "Edwin Molina is now NYC press secretary for Sen. Kirsten Gillibrand (D-N.Y.).",
    "Kevin Dawson is now health policy adviser for Sen. Bill Cassidy (R-La.).",
    "We’ll be watching Ukraine all weekend before Congress returns next week.",
    "AROUND THE HILL\nLooking like a quiet Friday (at the Capitol, at least.)",
    "(FWIW, you can trust your Huddle host’s carefully curated links.)",
    "He previously was comms director for Rep. Cindy Axne (D-Iowa).",
    "“Time is not on our side,” Sen. Lindsey Graham (R-S.C.) said.",
    "Some — both Republicans and Democrats — don’t want to wait.",
    "No news on if the House wifi password will ever change.",
    "She is a former PR and comms specialist at LaRiviMedia.",
    "She most recently was legislative director for Speier.",
    "The Senate convenes at 2 p.m. for a pro forma session.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "Leaders across Washington are banking that it’s not.",
    "When it comes to weapons… There’s less consensus.",
    "GET HUDDLE emailed to your phone each morning.",
    "MORE LIKE OUTHOFE — Sometimes mountains move.",
    "Send your answers to ktm@politico.com.",
    "Anthony has more on Congress Minutes.",
    "Trump has denied the allegation.",
    "It may be too late.",
    "Flushed away?",
    "TGIF!"
  ]
}