{
  "id": 5535,
  "mediaId": 2641,
  "date": "2022-02-04",
  "headline": "Duff: Stefanik Is Results Oriented for Conservatives and it Shows",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=4d5fc102-7d1e-4fa5-bd19-b22d8b0d0129&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/sba-nra-nunes-schiff/2022/02/04/id/1055511/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Jane Duff",
  "authorUrl": "",
  "termIds": [
    1878,
    1924,
    2159,
    2201,
    4679,
    265,
    878,
    1163,
    4895
  ],
  "sentences": [
    "When Cuomo decided to seize resources from North Country hospitals with his Ventilator Order, which would undoubtedly leave the district unprepared and vulnerable in the first year of the pandemic, Elise slammed his decision and called for immediate transparency for New York's 21st congressional district .",
    "Elise also defended President Trump during both sham impeachments and partnered with the President to raise millions of dollars for conservative members of Congress and first-time candidates, with the goal of taking back the House and firing U.S. House Speaker Rep. Nancy Pelosi, D-Calif.",
    "Instead of ranting about impeaching President Trump like the previous Conference Chair, Stefanik has been disciplined, getting the Republican Conference focused on Joe Biden’s dangerous agenda, from rising inflation to unconstitutional and authoritarian mandates.",
    "She is a conservative columnist, and organizer, and is known for her contributions to, and work on, \"Day of Outrage\" (2022), a documentary about Jan. 6, 2021, airing on Newsmax, and also \"Making Money with Charles Payne\" (2014).",
    "Elise was a leader in the effort, during hearings, to expose the lives of Rep. Adam Schiff, D-Calif., and also successfully did multiple interviews defending Trump and prosecuting her case to the American People.",
    "This line of questioning opened up the inquiry with then-Rep. Devin Nunes, R-Calif., and other House Republicans to expose the Russian hoax — which was pushed by the Democrats and the corrupt media.",
    "Elise Stefanik has a proven conservative record while in Congress, earning an A plus rating from the NRA for her strong support of the Second Amendment.",
    "Unlike her predecessor, Rep. Liz Cheney, R-Wyo., Elise has been laser-focused on taking back the majority and unifying the House Republican Conference.",
    "The proof is in the polling, ever since Elise’s tenure as House GOP Conference Chair began in May, the Democrats have imploded while the GOP unifies.",
    "Elise has pushed back against Joe Biden’s unconstitutional vaccine mandate, Critical Race Theory (CRT), open border policies, and inflation crisis.",
    "Director James B. Comey on why didn't inform the intelligence committee about the counterintelligence investigation on then-candidate Donald Trump.",
    "She served as co-chair of the Trump Campaign in New York State and spoke at the Republican National Convention in support of President Trump.",
    "There are many Republicans in Congress talking a big game when it comes to standing up for President Trump’s America First agenda.",
    "She has strongly supported her colleagues on the political side, raising millions of dollars for incumbents and candidates.",
    "This includes supporting conservative Freedom Caucus members like Reps. Lauren Boebert, R-Colo., and Debbie Lesko, R-Ariz.",
    "Rep. Elise Stefanik, R-N.Y., represents and serves New York's 21st District in the U.S. House of Representatives.",
    "She has stood by him from the beginning, as one of the few female members of Congress to vote for Trump in 2016.",
    "Rep. Elise Stefanik, R-N.Y., who leads the U.S. House Republican Conference, is a proven conservative.",
    "Elise is actually doing so through unified messaging and strong fundraising for pro-Trump candidates.",
    "Andrew Cuomo were revealed, Elise was the first federal representative to call for his resignation.",
    "There's a reason Cuomo’s criminally corrupt staff targeted and harassed Elise day in and day out.",
    "Jessie Jane Duff served in the U.S. Marine Corps as a Gunnery Sergeant in the U.S. Marine Corps.",
    "She also garners an A plus from the Susan B. Anthony List, for her strong anti-abortion record.",
    "Andrew Cuomo, D-N.Y. misled his state on nursing home deaths, Elise held him accountable.",
    "Elise Stefanik continues to be one of President Trump’s strongest allies on Capitol Hill.",
    "Most impressively, Stefanik was tapped by President Trump to be on his impeachment team.",
    "March 20 2017 marks the date when Stefanik’s offensive against the Russia hoax began.",
    "House Republicans are on offense on economic, crime, and border security issues.",
    "In fact, she was viciously attacked for this in Democrat television ads.",
    "Conservatives can trust Elise to deliver wins for the American people.",
    "Additionally, she has also appeared on Newsmax's \"National Report.\"",
    "On that day, Elise was the first member of Congress to press F.B.I.",
    "Thus, have the greatest generic ballot advantage in a generation.",
    "In New York, it's clear that Elise Stefanik is a fighter.",
    "Many politicians talk about taking on Nancy Pelosi.",
    "When allegatons of sexual harassment against Fmr.",
    "The truth is very few actually produce results.",
    "She is currently in her fourth term in office.",
    "It’s because Elise took on Cuomo and won.",
    "While others watched as disgraced Gov.",
    "All rights reserved.",
    "She gets results.",
    "This isn't new.",
    "© 2022 Newsmax.",
    "Special Links:",
    "N.Y. Gov."
  ]
}