{
  "id": 58,
  "mediaId": 2512,
  "date": "2022-04-21",
  "headline": "Far-right GOP congresswoman brutally mocked for illogical attack on Biden’s immigration policies",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29702290&width=1200&coordinates=0%2C0%2C0%2C213&height=600",
  "link": "https://www.alternet.org/2022/04/far-right-gop-congresswoman-brutally-mocked-for-contradictory-post-on-bidens-immigration-policies/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    2201,
    2461,
    3975,
    4302,
    4303,
    878,
    1122
  ],
  "sentences": [
    "Tweeting a Wall Street Journal article by reporters Tarini Parti and Michelle Hackman, Lesko commented that Border Patrol agents “have apprehended more than 1,000,000,000 migrants at our southern border in just 6 months” and added, “President Biden’s open border policies are fueling this crisis!”\nBorder Patrol agents have apprehended more than 1,000,000,000 migrants at our southern border in just 6 months.\\n\\u00a0\\nPresident Biden\\u2019s open border policies are fueling this crisis!",
    "#BidenBorderCrisishttps://www.wsj.com/articles/u-s-mexico-border-arrests-top-one-million-in-six-months-11650323756?mod=politics_lead_pos1\\u00a0\\u2026\n— Congresswoman Debbie Lesko (@Congresswoman Debbie Lesko) 1650411779\nLesko’s critics have been quick to point out not only how exaggerated her figures are (presumably, she meant to say 1 million, not 1 billion), but also, how badly she contradicted herself with her clumsy attempt at racist fear-mongering.",
    "Princeton University historian Kevin M. Kruse tweeted:\nEveryone\\u2019s dunking on her for failing second grade math, but don\\u2019t overlook the fact that she\\u2019s trying to argue that a million arrests at the border means we have an \\u201copen border\\u201dhttps://twitter.com/repdlesko/status/1516563037544665097\\u00a0\\u2026\n— Kevin M. Kruse (@Kevin M. Kruse) 1650453907\nHere are some more responses to Lesko’s tweet:\nA) 1 billion immigrants?",
    "Rep. Debbie Lesko of Arizona, a GOP congresswoman and Donald Trump loyalist who is never shy about fear-mongering when it comes to the U.S./Mexico border, made that claim in an April 19 tweet — only she contradicted herself by pointing out how many arrests the U.S. Border Patrol has been making.",
    "— Yayger \\ud83c\\uddfa\\ud83c\\udde6 \\ud83c\\udf3b (@Yayger \\ud83c\\uddfa\\ud83c\\udde6 \\ud83c\\udf3b) 1650423355\nSo, even if true (obviously not), you should be celebrating that 1/7th of the population of the entire planet was stopped at the Mexican border.",
    "One of the bogus claims coming from far-right MAGA Republicans is that Democrats, including the Biden Administration, are soft on illegal immigration and favor an “open borders” policy.",
    "If the U.S. Border Patrol is apprehending huge numbers of people in the Biden era, the Biden Administration can hardly be accused of encouraging an “open borders” policy.",
    "Like, seriously?\\nB) Isn't the fact that these immigrants were apprehended proof that we do not, in fact, have an \"open border\" policy?",
    "\\nC) You do know what \"apprehended\" means, right?\\nD) You high?",
    "— Gee Eff Jay Junior (@Gee Eff Jay Junior) 1650422719",
    "Way to go, Biden."
  ]
}