{
  "id": 5909,
  "mediaId": 2629,
  "date": "2022-02-08",
  "headline": "House Republicans Now Whine About Debt They Helped To Create",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yNTkzMTkzNi9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY3Mzk1Nzc3Nn0.qPyeIYv65yxyvZ8MJTn9aUGH7RMTVcUY2lQSuasQEow/img.png?width=1200&coordinates=0%2C93%2C0%2C94&height=600",
  "link": "https://www.nationalmemo.com/debt",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Israel",
  "authorUrl": "https://www.nationalmemo.com/u/josh-israel",
  "termIds": [
    2296,
    2461,
    3267,
    3872,
    3975,
    528,
    872,
    878
  ],
  "sentences": [
    "\"We have a $30 trillion debt, larger than our economy,\" House Minority Leader Kevin McCarthy complained Thursday in a House floor speech, calling the size of our debt one of the \"two greatest threats to the future of the United States,\" along with China.",
    "In the days that followed, Republicans in Congress who helped rack up a large portion of that debt responded with outrage and were quick to try to pin the blame on President Joe Biden and their Democratic colleagues.",
    "Mason told Quartz last Wednesday that the $30 trillion figure was somewhat misleading, as $8 trillion of that is money the federal government owes to itself — such as funds borrowed from Social Security trust funds.",
    "During President Barack Obama's time in office, Republicans rebranded themselves as debt hawks and used the Tea Party movement to win a House majority in the 2010 midterms on a promise to address the budget deficit.",
    "Though the figure was already more than $27 trillion before Democrats took control of the White House and Congress at the start of 2021, some GOP lawmakers suggested that they were to blame for the entire total.",
    "Trump never put forward a plan to balance the budget and House and Senate Republicans did little to reign in his spending on defense, a border wall that Mexico did not pay for, and tax cuts for the rich.",
    "They and every other Republican in Congress then opposed Biden's Build Back Better proposals, which would have invested in climate and caregiving infrastructure but actually reduced the national debt.",
    "It’s past time to get this spending under control and ensure our children and grandchildren aren’t saddled with the consequences of Dems’ poor decision making for generations to come.\"",
    "Once COVID-19 hit the U.S., both parties joined together to spend several trillion more on public health, relief checks, and support for businesses to help them avoid layoffs.",
    "Rather than pay down the existing debt, congressional Republicans passed President George W. Bush's 2001 and 2003 tax cuts, adding more than $1.4 trillion to the deficit.",
    "But many of the same Republicans who are currently treating the debt as a calamitous existential threat were largely silent on it during the previous administration.",
    "A July 2020 assessment by Brookings Institution senior fellow David Wessel noted that \"for now\" the debt level was not a problem, but that it could become one.",
    "\"For years, I have been warning about the devastating consequences of our rapidly rising federal debt, but its [sic] fallen on deaf ears in Washington.\"",
    "\"No one really knows at what level a government's debt begins to hurt an economy; there’s a heated debate among economists on that question,\" he said.",
    "GOP leaders said standing against the plan's increased taxes on those earning $400,000 and up and on corporations was their \"red line.\"",
    "\"I mean the previous administration, debt and deficits weren't a high priority for them,\" Minority Whip John Thune admitted that March.",
    "\"I don't think anybody has a very good record for the last decade on this,\" Sen. Roy Blunt of Missouri told Fox News in April 2021.",
    "In 2016, candidate Donald Trump ran on a promise to balance the budget and get rid of the national debt entirely \"fairly quickly.\"",
    "Even before the 2020 coronavirus pandemic shut down much of the nation's economy, Trump's policies meant borrowing trillions.",
    "For the first time in American history, our country’s debt has exceeded $30,000,000,000,000,\" said Arizona Rep. Debbie Lesko.",
    "Both still voted last February for an unsuccessful amendment aimed at making Trump's individual tax cuts permanent.",
    "Their Tax Cuts and Jobs Act of 2017 meant about $1.9 trillion in additional debt spending between 2018 and 2028.",
    "Over the past 21 years, Senate Republicans voted for about $8.5 trillion in spending and revenue reductions.",
    "The Treasury Department announced last week that the national debt exceeded $30 trillion for the first time.",
    "\"Today is a sad day for the United States of America,\" Florida Sen. Rick Scott wrote on Friday.",
    "In total $7.8 trillion was added to the debt over Trump's single term in the White House.",
    "And they helped get it to the current level, through big spending and unfunded tax cuts.",
    "Oklahoma Sen. Jim Inhofe added, \"This unprecedented, reckless spending is unacceptable.",
    "Since 1990, our debt has grown tenfold and there's no indication this is the ceiling.\"",
    "But once he took office in 2017, Trump and his party quickly dropped the issue.",
    "Once Biden took office, Republicans quickly remembered the debt as an issue.",
    "\"$30T in debt under Biden,\" Louisiana Sen. John Kennedy dishonestly claimed.",
    "Some even admitted that they deserved some of the blame for the problem.",
    "They also backed his long Iraq War, at a cost of more than $2 trillion.",
    "President Bill Clinton left office in 2001 with a budget surplus.",
    "John Jay College of Criminal Justice economics professor J.W.",
    "It is unclear how big a threat the level of debt really is.",
    "\"$30,000,000,000,000,\" tweeted Iowa Rep. Randy Feenstra.",
    "\"This enormous figure should scare us all.",
    "\"This is America under a one-party rule.\"",
    "30 TRILLION !!",
    "debt",
    "\"!!"
  ]
}