{
  "id": 7223,
  "mediaId": 2742,
  "date": "2022-01-18",
  "headline": "VDARE.com Posting Full Transcript Of Trump Rally In Florence, AZ...Because No One Else Is | Blog Posts",
  "image": "https://vdare.com/public_upload/publication/featured_image/56735/trumpfloraz.jpg",
  "link": "https://vdare.com/posts/vdare-com-posting-full-transcript-of-trump-rally-in-florence-az-because-no-one-else-is",
  "mediaOutlet": "VDARE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "But Biden's made him the big, the big person he's like the king Fauci is the king\n\n20:09\n\nBut with these decisions they're making they're wrecking and devastating people's lives firing Americans from their jobs, forcing innocent children to grow up in mass education, crushing their development, demolishing their futures locking people into their homes, what they've done over the last year, wreaking havoc on our economy, going mandate crazy and running neighborhoods, if you look at what's going on, they're just running roughshod all over this country.",
    "In less than one year, Joe Biden and the radical Democrats have brought our country to the brink of fruin And all I can tell you is the people that are telling the truth in America like one American news are being threatened does everybody like one of my loved one and by the way, these cameras, you know that back then this thing, like here in this stuff, I just see the red lights, they go up one after another as soon as I'm gonna mention CNN and how bad their ratings are, you see the CNN camera go.",
    "Why Kelly voted yes on Joe Biden's brutal attacks on American energy Democrat socialist spending and really of driving runaway inflation and he's driving it through the roof and by the way, I have teleprompters that are moving all over the hell and and it seems the thing they like the best is when we just get off those damn things and talk right straight from the heart\n\n1:03:58\n\nnever read a teleprompter where it's waving like you're on a ship and you're starting to get seasick as you talk.",
    "Yet, despite all of this Biden, Pelosi Schumer, the whole group and the radical left, they're still hell bent on passing mass amnesty for illegal aliens, one of the highest priorities when Republicans take back Congress and eventually the White House will be to have a massive increase in the number of ICE officers and border patrol officers so that we can find in detain and deport every one of the illegal aliens that Joe Biden has released into our country.",
    "If you win certain number of states having to do with legislatures and state, we want all of them, every one of there's like 15 of them different, different little tests, and we want them all the only thing we didn't win was the election, you know, but I'll tell you what, if you look at 10 o'clock in the evening, on election night, you look at Pennsylvania, you look at all of these different states.",
    "We will restore patriotic education to our schools and we will teach our children to love their country, honor their history and to always respect our great American flag\n\n1:29:57\n\nand we will ban men from participating in women's sports\n\n1:30:10\n\nDid you see the swimmer that's breaking records like by 30 seconds, that a record for nine years the record held.",
    "And hopefully, the Attorney General and your state legislatures will be smart, and fair and decisive, and let the world know what the hell happened in Arizona, because it's happening in other states right now, even at a level maybe beyond Arizona elections have to be decided we have to be decided by legal votes, only legal votes only.",
    "But upon taking off his Biden cave to the radical left, and he did a job on so many things like the Paris Climate Accord, which rips off our country, and cancel the Keystone XL Pipeline, while as we said, approving the Russian pipeline, every item on the Pelosi Biden Schumer agenda is crazier and more delusional than the last.",
    "A great red wave is going to begin right here in Arizona, and it's going to sweep across this country, and is going to watch hundreds and hundreds and 1000s and 1000s of Democrat socialists out of office with an unstoppable surge of Republican patriots, and they're going to be doing it you're going to be heading to the polls.",
    "And it all happened in such a short period of time, you know, they want to knock out the filibuster and get things approved, and it's hanging by a thread, it's hanging by a thread, this is the moment the American people must take their lives and future back, we have to do it, we have to be strong, we have to be strong.",
    "After four years of Russia, Russia, Russia, Ukraine, Ukraine, Ukraine, the impeachment hoax number one impeachment hoax number two, to slandering of justice Cavanaugh, and nobody ever went through anything like he went through, and the harassment of my family, which is a wonderful family of people that are great.",
    "And by the way, he's so terrible and and remember this immense evidence of fraud impacting 10s and 10s and 10s of 1000s of ballots has also been reported out of Pima County and other counties where we weren't even lucky they weren't even looking at Pima County, and they've got 10s of 1000s of votes.",
    "But I really think that the Afghan with role the way they did it so incompetently with moving the military out first, leaving 1000s of people as hostages, leaving that equipment, I really think that the Afghan withdrawal did more to hurt our country than any single event that I've ever seen.",
    "We also saw a record number of migrant children arriving at our border because Democrats, very cruel policies are pushing vulnerable us into the arms of child smugglers, human traffickers, and very vicious criminal cartels, what the criminal cartels are doing to women and children.",
    "1:23:15\n\nWe should also pass a law that says that sanctuary city officials who knowingly release criminals will be charged as accessories and any future crimes, you know, sanctuary cities that protects some very, very evil people are in sanctuary cities totally protected is crazy.",
    "We restored America leadership, we fully rebuilt the US military, we created the first new branch of the armed forces in 75 years, and that's the Space Force 75 years, we also achieved the long sought goal of energy independence, nobody thought that was possible.",
    "We took in 10s of 1000s of totally unvetted people, we have no idea where the hell they come from, what their ideology is, and by the way, I want to wish our best wishes and good luck and Godspeed to the hostages right now, in Texas taking place right now.",
    "It's called to have a strong system, and to be doing what we're doing with the kids, leave our businesses alone, leave all of us that hell alone, tell Joe Biden, the Americans health choices are none of his business, we can make our own choices.",
    "They want their country back\n\n04:58\n\nbetween the open book waters in the bad elections and we were always thought of a beautiful country that had fair elections and now we're a laughingstock all over the world for many reasons for many reasons.",
    "With Trump banned from YouTube, about the only way you can get a transcript is to download the video from Rumble (using a Rumble Downloader) and then upload it to an automatic transcription service, which produces raw text like that below.",
    "You had an excuse not to buy Christmas gifts you said your loved one darling I'm sorry I love you very much but I just get this no merchandise and Tiffany is not wanting to buy the most beautiful ring but they don't have any rings anymore.",
    "But I said it's windy as hell here and I don't want to screw up any visions of my wonderful\n\n53:33\n\nwindy day said to her, sir, if you want to have a lot of hair blown all over the place, don't worry, you had I said give me a hot plate.",
    "57:18\n\nWeak Republicans who fail to recognize election fraud, and frankly, open borders and all of the other things they are doing now to destroy our country, they're going to be losing elections at a level that nobody thought possible.",
    "And we never had that problem that we there was no problem with Putin and Ukraine, there was no problem with President Xi in Taiwan, China, Russia and Iran are engaging in aggression and provocations they never would have dared do.",
    "And by the way, a person that comes here and we're all together, a person that comes here and has crowds that go further than any I can see this nobody that can see the end of this crowd, and has cars that stretch out for 25 miles.",
    "Less than 10 months from now Arizona is going to send the ultra left his mark Kelly out of Washington in disgrace and you're going to send a proud and tough Republican Patriot to the US Senate to make America great again again.",
    "And Arizona is to state with generations of pioneers and prospectors, miners and ranches, cowboys and cattle hands marshals and lawmen tamed the frontier, brave the blazing sun, and showed the entire world How the West Was one.",
    "But January sex has become the Democrat party's excuse to justify an unprecedented assault on American civil rights and liberties, appalling persecution of political prisoners, what's happening to those people in those jails?",
    "You know, we had legislation passed where if you're a vet, and you can't get good service, you go to a local doctor and we pay for that saved so many veterans carry will stop radical indoctrination in our children's schools.",
    "Nobody showed a\n\n36:30\n\nbunch of phony people just a very corrupt, you know, the only way you can stop this is if we had an honest media where they would report the truth, and then it would all end, then it would all end.",
    "With a Republican Congress, we will fight for more jobs for American families, fair trade for American workers and more American factories forging more product stamped with us very, very beautiful words Made in the USA.",
    "His story on mass amnesty sanctuary cities and stimulus checks for illegal immigrants that you pay for, you know, you're paying for all of this, you know, illegal immigrants now are being treated better than veterans.",
    "The January 6 rally was a protest against a crooked election carried out by unhinged Democrats, big tech and working with the fake news media or working together to defeat Republicans and your favorite president, me.",
    "Starting with your ultra left wing Senator here in Arizona, Mark Kelly, who only fights to allow your border to remain open and an open cesspool of illegal immigrants that are pouring into Arizona on a daily basis.",
    "Well, he's got to move quickly, I would say that we've all been waiting a long time, I understand what you say, but to take appropriate action, along with the state legislature regarding what we call the big steal.",
    "A website called Factba.se used to post Trump transcripts, starting with autogenerated text like that below, but they gave it up after Trump took office, which I assume led to a massive drop in traffic for them.",
    "59:22\n\nYou know, the fact is, if you want honest elections, very simple, same day, voting less, you're again, in a faraway place the military, or you're very sick, and you have really a note from the doctor.",
    "And that includes with the so called airlift that they tried to take credit for 3% of the people qualified to be on that airline 97% of the people you'll be hearing from them in years to come in many cases.",
    "And they have to cheat because with open borders, no second amendment, a bad economy, highest ever inflation, sanctuary cities, a woke bunch of military leaders that don't know what the hell they're doing.",
    "There is no victory we cannot have as long as we remember that we are strong and proud and mighty Americans with faith in our hearts, grit in ourselves and courage in our veins and that's what you have.",
    "They didn't go back to constitution says you have to go back to the state legislatures, and many of them did and they couldn't get the approval on they did it anyway, which means it's unconstitutional.",
    "You look at Chicago, you look at New York, the murder rates are in a level that nobody can believe Chicago, and B they have a holiday, some July 4 and other holidays and 83 people shot seven dead.",
    "What's going on is horrible in Washington, and also the jails are filthy, disgusting, dirty, and they're even being cited by the courts for being so horrible that brutal lockdowns, they're brutal.",
    "You know, I filled up the strategic reserves, by the way, which nobody talks about, but you know, now Biden's using what I did, to try and lower the price of energy, which is not working too well.",
    "And why are they doing it to Antifa and BlackLivesMatter and to many other left-leaning to put it mildly groups, but the blatant abuse of power to harass their political opponents is disgraceful.",
    "Now I did say that if you don't give them to us, we're going to put tariffs or the courts covering it but we don't have to go into the we expedited removals and deported dangerous criminal acts.",
    "The radical Democrat Party has spent years putting American lives in jeopardy through its extreme left wing campaign to release dangerous criminals from jail abolish cash bail, how about that?",
    "But Biden's trying to bully and intimidate people with his ridiculous, unscientific mandates because he and his entire administration have absolutely no idea what the hell is happening.",
    "We had people trying to burn down our country, including federal buildings and courthouses in Washington, DC and the church right opposite the White House and the White House itself.",
    "Why did Nancy Pelosi and the Capitol Police reject the more than 10,000 National Guard troops or soldiers that I authorized to help control the enormous crowd that I knew was coming?",
    "The only reason they would ever seek to institute nationwide ballot harvesting and unsecured dropboxes is if they really wanted to flood the system with illegal and ineligible votes.",
    "But it's far more than necessary to win the state of Georgia, just like this is far more than necessary to win the state of Arizona, and in Wisconsin, Pennsylvania, and other states.",
    "You look at the numbers of people killed and the equipment and everything that happened and as we could talk about it all night long, and the fake news won't talk about it at all.",
    "1:01:35\n\nWe need every one of you to pour out your heart and soul into ensuring the radical Democrats go down in a midterm defeat, so crushing they cannot steal it or corrupt it.",
    "Let's just put on that video about New York\n\n40:23\n\nI will never be afraid to challenge this illlegitimate president, we need to focus on Donald Trump needs to follow his money.",
    "But Fauci fought like hell to not close it to China, and then admitted that we save 10s of 1000s of lives because I closed it in January very early than we close it to Europe.",
    "So they say I lost the state of Arizona by 10,000 votes and yet the auditor is flagged more than well listen to the by the way, if I lost her, you don't have crowds like this.",
    "Not only the 13 soldiers, but the 28th grade soldiers that were absolutely so badly wounded, with legs and arms, and 250 people and $85 billion worth of equipment 85 billion.",
    "The evidence of fraud is so overwhelming, starting right here in Arizona, where your Republican state senators had the courage the great courage to do a full forensic audit.",
    "And they did it at levels that nobody can believe we must return to the historical norm of voting in person on election day, unless you have a valid reason to vote absentee.",
    "And the next Arizona Secretary of State, a man who's tough and smart and loves our country, a man who you must get elected along with carry you have to get him Mark Fincham.",
    "And you know, if you spend more than $5,600, they put you in jail, this guy spent $417 million, and most of it went to the Democrats, almost all of it, and nothing happens.",
    "Then you know, the H1N1 remember Jo use ago the H1N1 said though, but the H1N1 was handled very, very badly smaller scale, much smaller scale, not the same kind of problem.",
    "And I will say this, the court system and the court decisions that are being made and will be made, it's going to be an incredible victory, in my opinion, for common sense.",
    "By the way, we did have tremendous success in the ever here's some of the little, the little things where the Analyze elections if you win Ohio and Florida, you always win.",
    "The left is now rationing life saving therapeutics based on race, discriminating against and denigrating just denigrating white people to determine who lives and who dies.",
    "We will end chain migration, we will make sure that these people that are illegally admitted to our country have to share if they're staying they have to share our values.",
    "Because when they show when they show the kind of numbers that are represented tonight, some of the government people said it's the single biggest crowd they've seen yet.",
    "And when I'm elected, we will finish your big beautiful wall\n\n08:08\n\nThank you carrying great so what a job she's done as a politician for 22 years, she was your anchor.",
    "They're partners, look at all those people up there they came, they came to your great state, they came to your great state to say that nobody showed up for the rally.",
    "Never forget, the reason the Democrats and their media allies conduct all of these hoaxes and witch hunts is not because they think the American people are with them.",
    "What Biden did and the radical Democrats are doing with their courts have you take a look at what they've done with the COVID I call it the China virus is that okay?",
    "I wonder which one next is coming down of the original virus and is by far the most transmissible and thankfully it's also the least dangerous and the least deadly.",
    "When you look at numbers in California coming in, like in the President, I would go and you know, you're told you can't win California, think of it as a Republican.",
    "They can only be one reason your Rhino Republican Governor Doug Ducey, and a group of other rhinos that you have, they did nothing to help our country or our state.",
    "And the reason I knew it, everybody that I knew was saying, I'm going on January 6, everybody, and they never talked, by the way, they never talk about that crowd.",
    "Numerous people have called me and said, What was it like with these horrible people, they said, it was really bad, I have never been treated that way in my life.",
    "So if you really believed in him at the beginning, and I guess we can understand that, but it didn't take long than you would say, No, we're not doing it anymore.",
    "But to make these critical reforms between now and the time that's so important to make them, we have to act and we have to act fast and we have to act strong.",
    "We will stop the Biden Crime Wave in our Democrat run cities and we will crack down on violent criminals and we will give our police officers our 100% support.",
    "Together, we're standing up against some of the most sinister forces entrenched interests and corrupt opponents that anyone on our shores has ever seen before.",
    "It's all the things that they never had any intention of keeping what they've done to energy, were energy independent, what they've done to energy is so bad.",
    "My administration invested heavily in all of the above strategies, including therapeutics, you know, we have therapeutics that are so powerful and so good.",
    "But the media for whatever reason, for whatever reason, the media is a part of it, and the big tech and all group of them, but we're gonna beat him anyway.",
    "You know, a lot of the people that are talking about how honest they are, are people that throughout years have been saying how corrupt our elections are.",
    "Remember when the Democrats went out and Kamala raising money for the people that were corrupt, but they didn't have a problem because so little happened?",
    "On top of all of that, two days ago, the Supreme Court rightly declared that Joe Biden's very sinister and malicious, and I don't know what they're doing.",
    "You know we made America great and I was gonna use that I was gonna make I had a wonderful theme it was Keep America Great, but I can't use that anymore.",
    "And I think it's one of the reasons that Carrie, because I watched her on the stump the other day, and I think is one of the reasons she's doing so well.",
    "They came to me in Washington, they said, What do you think I said, he's never gonna get my endorsement, I can tell you that your governor is not good.",
    "We have some great ones I already mentioned the man that was so incredible on this election situation, senators came and they said, Wow, we heard this.",
    "And it's a very sad thing the streets of the Democrat run cities are drenched in blood with record high murderers and drug deals and human trafficking.",
    "There are four times more COVID cases remember I'm gonna get rid of cupboard I'm gonna go I'm gonna have coffee four times more cases than ever before.",
    "He talked about the corrupt election, but more and more information is coming out and it's coming out far worse than anyone ever thought it could be.",
    "One defendant was allegedly viciously and savagely beaten, resulting in numerous broken bones in his face and a loss of sight permanently in one eye.",
    "And it's happening in New York, it's all they're all taking their orders from the Democrats in Washington, but it's happening in New York and beyond.",
    "It's time for the radical Democrats to leave our families alone, leave our elderly, alone, leave our children alone with their strong immune system.",
    "Our country is going to be bigger and better and stronger than ever before we're going to stage a comeback, the likes of which nobody has ever seen.",
    "When Republicans take control of Congress, one of our very top priorities will be to stop the flood of illegal aliens across our southern border.",
    "Biden is utterly humiliated our nation on the world stage, Putin is not only threatening Ukraine, I don't know if you've been reading about this.",
    "When we knocked down and when we do what we did with the Russian pipeline, how about this, I terminate I entered the Russian pipeline in Europe.",
    "The Supreme Court should intervene shut down this flagrant civil rights violation, immediately somebody has to get it to the court immediately.",
    "And we are going to change that around and even in America, we're witnessing cruelties that can be scarcely and believe they can't be believed.",
    "They didn't go after left wing anarchists and violent criminals, including all of the people that we just mentioned, they never went after him.",
    "Because they're in the pocket of the radical left Democrats, the same people who are destroying our country and they're destroying our country.",
    "We must protect our nation from these monsters that are using law enforcement for political retribution at the local, state and federal level.",
    "The unselect committee is out of control, secretly and illegally collecting many months worth of phone records that you don't even know about.",
    "If you remember during the campaign, I said it was something that was going to happen if they get elected, which they didn't, but that's okay.",
    "The numbers that are coming out are astronomical, despite the fact that they themselves spent years claiming our elections were so vulnerable.",
    "We will hold China accountable for unleashing the virus and charge them trillions of dollars for the damage and suffering they have caused us.",
    "And then Biden comes in his first week he approves the Russian pipeline, I ended it and now they're going to be selling energy all over here.",
    "And by the way, the people that go before the unselect committee, they call me and they said, I've never been treated so horribly in my life.",
    "It's causing another big part of when you look at what's happening with the economy, the mandates are just absolutely decimating our economy.",
    "And they're truly hurting the American people like they, I don't think they've taken away their liberties, what they're doing is incredible.",
    "Now they're talking about, just go check out your governor of Virginia, your former governor of Virginia, and it's all just fine with them.",
    "They don't have those little brown alums now paper ballots, and same day voting, and a Republican Congress should conduct a forensic audit.",
    "If the unselect committee were serious about getting the facts about January's that Nixon would focus on answering the following questions.",
    "And a woman I've really gotten to know and respect and a woman that fought like hell on impeachment hoax number one, and impeachment hoax.",
    "26:47\n\nWe're done with the mandates, including the mandates for frontline health care workers, which I think you're going to do that also.",
    "Now, the radical Democrats have yet another which are no different than Russia, Russia, Russia, the unselect committee of political hacks.",
    "Another woman who has been with me from the beginning, Kelly Townsend, who I hear will be running for Congress and she will be incredible.",
    "We stand on the shoulders of red blooded American patriots who poured out their heart, sweat and soul for our country and for our freedom.",
    "And the polls show that if an election were held today, we would trounce them so badly at a landslide in every way, just as we really did.",
    "When Republicans get the chance we must act immediately to pass voter ID citizenship citizenship residency, we need confirmation of that.",
    "By now, it should be clear to everyone that today's radical Democrat Party is driven by a mean and vicious spirit of left wing fascism.",
    "I think we're talking about 10s of millions of people are pouring into this country, we see certain people and we sort of mark it down.",
    "So bad is the border we have we went from the best border we've ever had, in a period of one year to the worst border we've ever had.",
    "A woman who has been with me right from the beginning and she's been great on criminal justice reform and helping us in so many ways.",
    "We will ban it in our military we will benefit from our workplaces and we will benefit from our federal, state and local governments.",
    "Text messages, emails, location data on countless people without notifying them giving them a chance to defend their rights in court.",
    "I think it's a very easy job to do, because anybody with any comments, any common sense is going to look and they get to take a look.",
    "But we'll be making an endorsement and amid the worst border crisis in history, Kelly's voted repeatedly for open borders in Arizona.",
    "Were FBI confidential informants agents or otherwise working directly or indirectly, with an agency of the United States government.",
    "But when you get almost 300 judges, federal judges, it's I think you're seeing things a lot differently right now a lot definitely.",
    "They've taken some of the brand new beautiful equipment that was given, like, when we surrendered over there, that was a surrender.",
    "If something you want to quote from the transcription below seems to make no sense, you can compare it to the video via timestamps.",
    "He cries every time you talked, who, by the way, just dropped out of the race because he No, he didn't have the courage to run it.",
    "But this November, we have a chance to do something really spectacular, to bring these Marxist monstrosities to a screeching halt.",
    "225 Miles right here and your Senator, by the way, I think he's gonna want to take them down, we'll take let's take down the wall.",
    "1:08:54\n\nAnd I hear we have one of our at least one of our US Senate candidates and a very successful guy, a really terrific guy.",
    "It's all things that it's just not possible in a country has to be thinking to the future, it has to be thinking about greatness.",
    "They want to defund the police, they want to take away your Second Amendment, they want to raise your taxes, all of these things.",
    "We're becoming a large scale version of Venezuela, which was a very successful country 20 years ago, and now they have no food.",
    "We will defend the Second Amendment, we will proudly uphold the Judeo Christian values and principles of our nation's founding.",
    "And because of Joe Biden's utter incompetence, and really the military leaders, some of whom I know, their gross incompetence.",
    "But this one was the beauty because this one used all of the mail and phony votes and all of the things that happen to cheap.",
    "She was your highest rated anchor by the way, and people loved her and she said she just couldn't stand watching it anymore.",
    "Senator the Do Nothing on borders Mark Kelly, and we're going to elect an incredible person, Kari Lake, she is incredible.",
    "2022 Despite so far being a total catastrophe for our country is going to be a big one for the people of this great state.",
    "Look at the way look at US flags look look at what a beautiful sight in one way but in another way you say man it's windy.",
    "But it's a shame, that they're selecting leaking all sorts of information to partners in the media, that's what they are.",
    "The same people who have been lying about everything for four years claim 2020 was the most secure election in history.",
    "But it's all about America first great schools, good jobs, strong military, growing economy, and pride in our country.",
    "She's been with us from the beginning on the election fraud and everything else and she's gonna be your next governor.",
    "Our borders been abolished and illegal aliens are pouring into our country by the millions and millions and millions.",
    "We have people coming in, we have no idea where the hell they come from, and take a look at California as an example.",
    "40:48\n\nWe have numerous like that they got elected based on anything about me, I don't even know who the hell she is.",
    "I fiercely resisted mandates of any kind and always and always, well, we have to, we have to they proven ineffective.",
    "They said now, can you imagine if you own a testing company, and you go, they said, no, no, no, I want $150 A test.",
    "If I call it the\n\n19:00\n\ntyrannical agenda, it's a criminal agenda what they're doing they're handling it so badly.",
    "A forensic got it into the hundreds of millions of dollars that Mark Zuckerberg dumped into local election offices.",
    "In Georgia, the Secretary of State is now really looking at an investigation that I think is gonna be a bombshell.",
    "But no matter how big or powerful the opposition may be, you must never forget our nation does not belong to them.",
    "How much money are we giving to various, including Mexico and I have a lot of respect for the President of Mexico.",
    "But the Attorney General is now looking and hopefully he's going to do his job, all we want him to do is his job.",
    "120 3344 mail in ballots were counted despite the person no longer living at that address, little little problem.",
    "This great state was settled by some of the toughest men and strongest women ever to walk the face of the earth.",
    "On November 3, we found we found steam, if we had an honest press, that election would have been much different.",
    "Mr. President, George Washington, crossing the Delaware with a Make America Great flag at the back of the boat.",
    "What a wonderful job he did that guy, I'd watch him every day on television to say he's saying the wrong south.",
    "And the Republicans I sometimes say well, with the Republicans ever do what they did, sir, that would be good.",
    "Because I say if it's good for them, why aren't the Republicans doing the same kind of thing with the ballots?",
    "They had democratic hacks, and they are vicious, and every one of them voted to impeach me, every one of them.",
    "And I'm talking about political people, politicians, they got duped and now they're finding out what happened.",
    "And they need at&t and at&t saying that they may no longer agree to carry this network that's doing very well.",
    "But I don't think that people are going to stand for it, especially with one American is the job you've done.",
    "They wanted wires going through all parts of the wall so they can hook up high technology we gave everything.",
    "But the record said for 11 years, this weightlifter comes along he didn't even lift weights before being big.",
    "And by the way, if that happened the other way around, they'd be calling let's bring back the electric chair.",
    "And that includes drugs coming into our country, we cut it down to a number that nobody thought was possible.",
    "We have almost 300 federal judges on the bench now during my administration and three Supreme Court justices.",
    "And you know what, I would ask the press to turn the cameras around and show the kind of crowd that we have.",
    "And when Biden got elected, he didn't get elected on what they're doing now to destroy there was no mandate.",
    "We have some crazy people where they create the Russia, Russia, Russia hoax and all created, all fabricated.",
    "This race face medicine is not only anti American, it's government tyranny in the truest sense of the word.",
    "And I pass a law that if you get caught doing that you go to jail for 10 years, and there's no negotiating.",
    "Keep him grid because, frankly, whether you like it or not, and some people are like, America is not great.",
    "We have the Afghanistan crisis, the worst and most embarrassing moment in the history of the United States.",
    "When President Xi of China looks and sees what happened in Afghanistan, they don't have fear of us anymore.",
    "I spoke to Abdul Abdul was the leader I said, Abdul, you do anything with respect to our you kill anybody.",
    "Listen, Andy, when they made this statement, you know, that typical statement, I was gonna say a bad word.",
    "There's also the Afghanistan disaster, the single greatest foreign policy humiliation in American history.",
    "So he broke a record, you know, if you if you win by 1/10 of one second faster 1/10 He won by 32 seconds.",
    "Make America Great Again and all that that represents and it has only just begun we have only just begun.",
    "I just told you that in Afghanistan, we went 18 months without one American soldier being shot or killed.",
    "48:35\n\nAnd it was done in many cases without the necessary constitutional approval of state legislatures.",
    "But why are the Republic Sir, we're proud American citizens we'd never vote 10 times, you know, etc, etc.",
    "And I predict at the end of 2028 when you leave office, second term, the whole country is gonna love you.",
    "They're just afraid of him because he's bringing back the principles that this country was founded upon.",
    "In fact, in New York state, if you're white, you have to go to the back of the line to get medical help.",
    "There's no better example than their ceaseless, relentless, unending campaign of hoaxes and witch hunts.",
    "And that's why The radical Democrats are also currently waging an unprecedented attack on voting rights.",
    "He is a disaster's supports HR one, and all the Democrats corrupt schemes to destroy election integrity.",
    "But I see some young beautiful children that they made and I was also going to come in without the Hat.",
    "And it's coming out rapidly and it's come out and is coming out very big in the great state of Arizona.",
    "I call them the unlocked boxes, a lot of things have a lot of big things coming out about those boxes.",
    "But I said if they get elected, our country would become a large scale version of Venezuela, remember?",
    "So this is a record that said for 11 years that put up an ounce, a little ounce on each side announce.",
    "And we built nearly 500 miles of border wall three weeks that would have been finished in three weeks.",
    "You know if you took supply chain is not something that we even talked about and that's what happened.",
    "We have a lot of proof and they know it's proof there was talking about the big lie there the big lie.",
    "We will again be putting America first and very soon because we're not putting America first anymore.",
    "Joe Biden took this unprecedented success and he made it the greatest border calamity in the history.",
    "We will again in catch and release, we will quickly complete the border wall very quickly, very fast.",
    "But I'm proud that I was the anti mandate president and we have great successes in Texas and Florida.",
    "You listen to the fake news, saying how it was so wonderful, the rhinos on the Maricopa county board.",
    "It's not that you could also call it the quote, never let a Republican ever get elected again, Bill.",
    "He voted against the border wall against remain in Mexico against deporting violent criminal aliens.",
    "And actually the toughest country to deal with is not China or Russia, or un it's the United States.",
    "They gave everything they had to make America into the greatest country in the history of the world.",
    "from Phoenix to Tombstone, from Flagstaff to Florence from Mesa to Yuma to the red rocks of Sedona.",
    "The Commission even admitted under questioning in Congress from your great Congressman Andy Biggs.",
    "Fellas I'm stuck up here with 55,000 people or something and I got a teleprompter that's useless.",
    "I can tell you that and it can be reversed and it might be reversed and it shouldn't be reversed.",
    "You know, normally when something like that happens, you fired the generals or you fire somebody.",
    "We are going to take back the Senate and we are going to take back America this is so important.",
    "We are the Americans who will make America great again we are going to make America great again.",
    "We have to have this victory if we don't have this victory if we don't have the right decisions.",
    "But instead of letting our and letting us resume and that's what we want to do our normal lives.",
    "And that's the only way we save our country, and we save our democracy, more evidence is coming.",
    "And 284,000 Remember they say unless by 10 284,412 ballot images were quote, corrupt or missing.",
    "45:34\n\nHopefully they're gonna go down to a big beautiful defeated November you have to get out.",
    "But few could have imagined that he would be such a disaster for this country what they've done.",
    "Now our country's being totally destroyed, there's been such destruction is not even believable.",
    "00:01\n\nDONALD J. TRUMP:\n\nTo me no doubt to the hills of Tennessee from Detroit down to Houston.",
    "My people did an unbelievable job in so many ways, rebuilding the military and everything else.",
    "And all they want to do, I mean, most of them, I can tell you, they just want to do a good job.",
    "But make no mistake under a Republican Congress, they will be held accountable they have to be.",
    "Because that's the way Epstein which is where they the way they say it in his original country.",
    "You'll see what happens and you'll see who it is that's holding so dangerously those hostages.",
    "Keep our prosecutors out of politics because this could work very much in the other direction.",
    "Because the people of our country understand, in many cases, much better than the politicians.",
    "They wanted to protect him so they want to keep him he couldn't get on television fast enough.",
    "Yet when it comes to January six defendants most of whom are charged with nonviolent offenses.",
    "This crowd is a massive symbol of what took place because the people are hungry for the truth.",
    "And that's causing a big part of the inflation, the mandates of bar disaster for this country.",
    "You got to get out and vote will immediately begin our own investigations into what happened.",
    "The virus evolved and his strategy failed to evolve and it just didn't evolve with the virus.",
    "Another one is a real fighter, a lawyer tough and smart working on a lot of different things.",
    "That's why we had such great numbers even with 28,000 soldiers for nothing, we paid nothing.",
    "Those are bad people, I watch them and tell me all you have to do is just look at the files.",
    "No more unmanned and unsecured drop boxes, and no more ballot harvesting, which is illegal.",
    "But they have illegal ballot harvesting at a level that nobody could even believe possible.",
    "They had deleted he asked them why they deleted much of the data, which was under subpoena.",
    "Did any of these individuals play any role whatsoever approving or facilitating the events?",
    "If you're white, you don't get the vaccine, or if you're white, you don't get therapeutics.",
    "But the Wall Street Journal describe the practice, race based preferential COVID treatment.",
    "And you know, the trafficking is mostly in women, what they're doing to women, is horrible.",
    "Our Magga movement is by far the greatest political movement in the history of our country.",
    "These are not people that are respected by Russia, and China, and North Korea, Kim Jong-un.",
    "Again, you notice he's starting to shoot the missiles and look at all the press back there.",
    "And we want to thank Karen fed and a future state senator Anthony Kern and his wife Jenny.",
    "And they don't want to talk about it because they know it doesn't work very well for them.",
    "And most importantly, why are they investigating November 3, a rigged and stolen election?",
    "Other countries are talking about their military and their power and their this and that.",
    "And a person that I know you've never heard of because he doesn't believe in advertising.",
    "So far not a single member of the The administration has yet been fired for Afghanistan.",
    "You take a look at other states what a disaster California has been a total catastrophe.",
    "And we're done taking lectures on science from a party that tells us that men are women.",
    "Or do I go in with the military and do a job and I left him military screw to the north.",
    "an education system that failed so badly and they don't want to go to the right system.",
    "And it took two and a half years to get started because they had all of these lawsuits.",
    "Tom Holman, did you ever hear of Tom, you never want to get in a fight with Tom Holman.",
    "We've had more destruction, I think than five presidents put together in the last year.",
    "And it would be a lot easier for me to go out and enjoy my life and say you know what?",
    "Gas prices are up 50% The grocery shelves the department store shelves, they're empty.",
    "And Teddy Roosevelt would have Roosevelt would have his make America great cowboy hat.",
    "It's no wonder that the Joe Biden approval ratings have now crashed well into the 20s.",
    "Under our administration, America was respected again and respected like never before.",
    "She was the attorney general of Florida for a long time and she's never looked better.",
    "And if not, they will never trust again, and our country will be absolutely decimated.",
    "What is fueling my soul right now is Trump going into the Office of Attorney General.",
    "Usually I just post an excerpt, but Peter Brimelow said, \"Just post the whole thing.\"",
    "There's never been a time so dangerous as the time in which we are living right now.",
    "Cuz I really believe we have any more people, you know, you can't be a 5050 partner.",
    "And I think they are the greatest people I became friendly with them four years ago.",
    "Without getting to the bottom of which we will never have a fair and free democracy?",
    "I want to just thank the haringey's A here, Charles and Robert, wherever you may be.",
    "And we will start talking about greatness for our country again by fellow Americans.",
    "became American Legends is where the great American West became the American dream.",
    "You know, you got a big setback with a selection like you'd never thought possible.",
    "I don't know what did you make, but you can negotiate by advertising anytime, Mike.",
    "And they want to cancel them now, because of politics for purely political reasons.",
    "And after Nancy Pelosi and Adam shifty Schiff, they go down to a shattering defeat.",
    "They just get the Democrats to stick together and just vote and people get a pitch.",
    "We are done having our lives controlled by politicians and Washington, bureaucrats.",
    "that's a big crowd out there tell you what the cars are stretch, they say 25 miles.",
    "And, frankly, in Republican, almost all Republican states throughout the pandemic.",
    "They say you can't win New York, you can't win California, you can't win Illinois.",
    "And frankly, at least now we know what not to do, because they have done so badly.",
    "And I think maybe it's the most embarrassing moment in the history of our country.",
    "And you know, remember he gave us 28,000 soldiers while we were building the wall.",
    "We had a policy stay in Mexico, you don't have to know what it is but make sense.",
    "And we will never let any socialist or communist movement take that away from us.",
    "Because we are one movement, one people one family one glorious nation under God.",
    "They are crime ridden like we've never seen in the history of our country before.",
    "5000 people appear to have voted in more than one counted not allowed to do that.",
    "And then all of a sudden, these horrible corrupt people hit you on a local basis.",
    "also and all it takes is a few more votes, and it'll work in the other direction.",
    "They don't have the right to change our country and everything that we stand for.",
    "But even if they didn't, the margin was so tiny, it was so thin, it was so thin.",
    "But if you win, Ohio and Florida and Iowa and we won big all of them, then 100%.",
    "I added payments to all of these countries because they weren't behaving at all.",
    "And as I said, Before, we had the greatest and most secure border in US history.",
    "It's the biggest thing they've ever done, and the sanctions and everything else.",
    "But to the Arizona life coalition, I want to thank you very much for being here.",
    "I don't care if it's a third world or fourth world country, there is no border.",
    "Democrats are putting corporate profits over the rights of the American people.",
    "Nancy Pelosi turned the US House of Representatives into a stolid a show trial.",
    "And in fact, if you don't mind, we have a little video we're going to show you.",
    "And we're gonna have I think a great year.. Last year we had a rigged election.",
    "I always say we won it twice but we did a hell of a lot better the second time.",
    "13:36\n\nSo now we have the inflation crisis, we had no inflation very, very low.",
    "And they have some very, they did a good decision, a big decision on mandates.",
    "And I love Arizona we had a tremendous victory in Arizona that was taken away.",
    "And they sue us on the basis of the they run an election and they are vicious.",
    "And we did things that people thought were not possible, then we did it again.",
    "The radical Democrats want to turn the United States into a communist country.",
    "But it's, it's really, it's a shame what happened to some of our great places.",
    "47:56\n\nAnd there's massive evidence that shows exactly what I'm talking about.",
    "So now what we do is if there's a next time, we're going to do it differently.",
    "Remember, they were knocking down statues and monuments all over the country.",
    "And you take a look at what he's done, you just take a look at what they did.",
    "This is a fact that babies can be killed even after birth, right after birth.",
    "thereby ending the whole concept of sanctuary cities, and we did a lot of it.",
    "Under my administration, with the help of two great men, these are great men.",
    "We struck breakthrough agreements with Mexico and Central American countries.",
    "And you'll be back where you want to be in a hopefully, short period of time.",
    "She was just an incredible person have been with me right from the beginning.",
    "That's a lot of fake news back there to considering that they can't stand me.",
    "And if our founding fathers were here today, they would be Trump Republicans.",
    "And we had a deal with the Taliban and 18 months we didn't lose one soldier.",
    "There will be no defending of our law enforcement in any way, shape or form.",
    "If we did what they do to Republican companies, we would have no difficulty.",
    "But look at what they've done to the world what they have done to the world.",
    "The first time we did the absolute right thing, but it showed what happened.",
    "You know, for years, I'd be turning on the television or watching the news.",
    "The fake news will go crazy when you say that they don't like hearing that.",
    "You got a 5050 partner, they cheat on elections, you're not a 5050 partner.",
    "And when I took him out, the happiest woman in the world was Angela Merkel.",
    "He broke it by numbers that you wouldn't even believe how ridiculous is it?",
    "The most embarrassing moment we have the economy crisis, we have the model.",
    "On top of that all people are being persecuted for using freedom of speech.",
    "And you could look 100 yards behind the cameras, and it's a sea of people.",
    "As far as the eyes with him, forget the cars, look at the people way back.",
    "But see, they don't turn the cameras, they don't want to turn the cameras.",
    "We will break up big tech and restore the right to free speech in America.",
    "1:21:25\n\nOver 2 million illegal aliens have trespassed across our borders.",
    "The people have to be free to find the answers to a very corrupt election.",
    "I think he's a good man, I think he's going to do his job, we'll find out.",
    "It's because they know that the American people are actually against them.",
    "And supposedly, it's on tape, it's on camera, and we'll see what happens.",
    "They're being given educations, and the veterans are being given nothing.",
    "And we were really there as in an infancy, nobody knew anything about it.",
    "We won those elections, we won a big and we just and you know what it is?",
    "You think you got out with you think everything's fine, federal is good.",
    "And they had no answers, because the right man asked the right question.",
    "Their scheme has always been to erase American votes with illegal votes.",
    "And if we think they're innocent, we should help them defend themselves.",
    "I will not say boycott at&t, because I promise Robert, I will not do it.",
    "They are just, you know, you could save America, you could save America.",
    "They have magnifying lenses, they have lenses, it could have handled it.",
    "And then we have this fake election, this horrible disgraceful election.",
    "It's wonderful to be in love see where the hell are aware we're in Iowa.",
    "We will make America United again and we will make America great again.",
    "A woman who's done an incredible job and she's just starting the fight.",
    "Most of all, Carrie will be a tireless champion for election integrity.",
    "This November, you're also going to elect an outstanding new governor.",
    "You saw this a week ago where it came out, nobody can even believe it.",
    "You turn on the fake news at night and you watch what they talk about.",
    "We You have to bring our country back we have to bring our lives back.",
    "But I heard the other day how young I can't believe how young you are.",
    "I always say Mike is the single greatest purchaser of ads in history.",
    "And I didn't really you know, I said it, and I meant it a little bit.",
    "But Ducey has been a terrible, terrible representative of your state.",
    "They've taken away their dignity, they've taken away their liberties.",
    "And I say, enough is enough, and we are not going to take it anymore.",
    "And they look like a bunch of real dumb, unpatriotic, crooked people.",
    "And then you listen to these people say all everything was wonderful.",
    "We had the best night barriers we've ever had at the southern border.",
    "We didn't lose one soldier think of it, not one soldier in 18 months.",
    "But the fake news and the lamestream media refused and they refused.",
    "And nobody was here because I think the picture was taken yesterday.",
    "And we have to get rid of Mitch McConnell, by the way, just in case.",
    "Nationwide, he said disaster and you have some great people running.",
    "We're pleased to be joined tonight by many great Republican leaders.",
    "You know, the ballots, they use COVID as another method of cheating.",
    "When Republicans take it and then they say Biden is tough on Russia.",
    "But we had 11 lawsuits brought by Nancy Pelosi, mostly in Congress.",
    "The toughest country to deal with was the United States of America.",
    "You know, you take a look at New York, what a disaster that's been.",
    "They're incompetent, actually, aren't they when you think about it.",
    "You know, people ask me often president could I ask you a question?",
    "These corrupt power hungry lunatics need to hear us loud and clear.",
    "I really think she's going to be a credible for election integrity.",
    "They want to get rid of that filibuster and they want to change it.",
    "How about the one guy go in, go in and get in there everybody else?",
    "And the government number one, they'll just say whatever you want.",
    "Think of it if you're white, you go right to the back of the line.",
    "And they brought all of the Border Patrol people up to Washington.",
    "We had so much energy, we didn't know what the hell to do with it.",
    "And these are not necessarily people that we want in our country.",
    "And thanks also to the many supporters of Arizona life coalition.",
    "And he's a fighter like you haven't seen before Attorney General.",
    "It's never happened to this extent, what they're doing to people.",
    "Let them use their lawyers let them go out and defend themselves.",
    "How many of those present at the Capitol Complex in January six.",
    "If you remember, he said no mass and he became a radical masker.",
    "Leave those beautiful children with that powerful immune system.",
    "So maybe what we should do is not use at&t, you know, if we did.",
    "The New York Times showed a picture of the seats being put down.",
    "But I'll tell you what, they have some big decisions coming up.",
    "We had already done it and now we're gonna have to do it again.",
    "18:01\n\nBut they declared the mandates largely unconstitutional.",
    "I told Fauci as an example, no, I'm gonna close it up to China.",
    "How's that working out and stop charging a wide range of crime.",
    "But the auditor is flagged so we lost they say by 50 by 10,000.",
    "This is the only reason why else would they want to lock boxes.",
    "These are the greatest people what they how they have suffered.",
    "Many things are likewise happening, and they're happening fast.",
    "You know, there are a lot of countries that use paper ballots.",
    "Partisan Democrats have celebrated their indefinite detention.",
    "Let's see how he could do without The protections that he got.",
    "The ones that voted to impeach we're getting rid of them fast.",
    "Why did it prove that she's gonna be of your current governor?",
    "We will not yield we will never give in we will never give up.",
    "The woke executives, I don't know what the hell they're doing.",
    "$85 billion worth of equipment was handed over to the Taliban.",
    "And frankly, they move the cameras into a bad location for us.",
    "We know nothing about it, but you're going to pay a big price.",
    "I can tell you thank you having them all on my side was good.",
    "All Biden had to do is go to the beach, just go to the beach.",
    "Biden is trying to bully and intimidate people with his wife.",
    "So three states, big ones, the biggest three states are gone.",
    "And in many other problems, they did everything you could do.",
    "You know, the Trump administration had a 92% approval rating.",
    "And, you know, I really think the borders are a horror show.",
    "We're now anxiously awaiting for attorney general run of it.",
    "The real insurrection took place on Election Day November 3.",
    "And by the time we checked him, the second time it was gone.",
    "But that's also a fake number given by the press and others.",
    "Arizona is where Wyatt Earp and Doc Holiday they were tough.",
    "Oh my gosh, is this the greatest president we've ever known?",
    "Because they just said they've never seen anything like it.",
    "He was in the men's team, then he went on the woman's team.",
    "And I know Kerry is going to be involved water improvement.",
    "They come into an audit, they've lives have been destroyed.",
    "57,000 highly suspicious ballots for further investigation.",
    "They talk about the people that walked down to the Capitol.",
    "I believe it was the largest crowd I've ever spoken before.",
    "And then you hear there's nothing wrong with the election.",
    "But same day voting, and you'll be surprised to hear this.",
    "And all you'd see would be how badly veterans have traded.",
    "Time flies all of a sudden carry not going to be too long.",
    "By the way, how did Cuomo do is Governor really wonderful?",
    "And we had a meeting and we got the wall that they wanted.",
    "He went in there at what he was the ambassador to Germany.",
    "Just one year ago, they would never have done any of this.",
    "And we don't even know where the hell they're coming from.",
    "And you know, you see it every day, practically every day.",
    "this pride in every American heart that is time we stand.",
    "But you know what one American news has done a great job.",
    "But she's winning the fight Arizona GOP chair Kelly ward.",
    "This is maybe the most important election we've ever had.",
    "And by the way, we put those justices there for a reason.",
    "27:05\n\nSomebody said, Oh, he wants to run for the Senate.",
    "But by people did a great job on taking care of our vets.",
    "paper ballots, paper ballots, the good old fashioned way.",
    "In other words, how do we screw the Republicans they did?",
    "What's going on back there is further than the I can see.",
    "And you know, you had a thing called findings, findings.",
    "She's very tough on crime and very strong on the border.",
    "If you just take a look, you haven't seen that in years.",
    "They're being given medical they're being given housing.",
    "You know, we've made people very interested in politics.",
    "They went after police stations, they went after police.",
    "And Adam Kinzinger, he's another beautiful he's a crier.",
    "Because the number I think it'd be 10 times that amount.",
    "Nobody's ever had spirit like this or a crowd like this.",
    "And now it's up seven times more than it was a year ago.",
    "Our beautiful strong southern border from one year ago.",
    "But now he's threatening to go into Cuba and Venezuela.",
    "do us all a favor, show people what's really happening.",
    "And this is really the walk military leadership crisis.",
    "But I do believe that 2024 will be even more important.",
    "1:27:53\n\nWe will shut down Joe Biden's border disaster.",
    "And then you have Liz Cheney, who's now polling at 16%.",
    "It's unbelievable to think this, and nobody wants this.",
    "Secret Service does a great job, but they stopped them.",
    "When you don't have voter ID, they're against voter ID.",
    "But Carrie will be a warrior for the people of Arizona.",
    "With respect to the vets it's the highest by 32 points.",
    "And yet they flagged more than listen to these numbers.",
    "Do we let the Democrats handle their cities and states?",
    "The showers are disgusting, the bathrooms are horrible.",
    "And he's Congressman Andy Biggs, and he's a great guy.",
    "Four years ago, five years ago, we ran the East Coast.",
    "Black people don't want it white people don't want it.",
    "Blake masters, but\n\n1:09:09\n\nthank you like Thank you.",
    "And he's been incredible and to find a Boris by Boris.",
    "And now because of it, our country is being destroyed.",
    "I don't care how well you speak you do that it's over.",
    "And some people say they're actually much below that.",
    "This is the year we are going to take back the House.",
    "And then this guy decides to go try out for the team.",
    "And you notice we don't talk about greatness anymore.",
    "What was the toughest country and they so interested?",
    "And the people in this incredible crowd aren't happy.",
    "And again, you don't know what's going on back there.",
    "And this was a really good audit of Maricopa County.",
    "They're being they're being hounded like your hound.",
    "But I think I don't think we have to worry about it.",
    "And I'll be making an endorsement at the right time.",
    "And you know what, we still have it in other states.",
    "I thought somebody was like in trouble or something.",
    "This guy Central Casting I gotta tell you I met him.",
    "And there's another one the press never talks about.",
    "Thank you, Uncle Sam, there's Uncle Sam, everybody.",
    "Today the hospital set our record brand new record.",
    "So we all knew that Joe Biden would be not so good.",
    "And we won twice and we did better the second time.",
    "They're just cherry-picking quotes that annoy them.",
    "In 2024, we are going to take back the White House.",
    "But we didn't quite the clock ran out unexpectedly.",
    "And we built and we built almost 500 miles of wall.",
    "We will ban critical race theory in our classrooms.",
    "We don't talk about greatness anymore as a country.",
    "And then he asked them a couple of basic questions.",
    "I'm gonna vote for Trump and it comes up for Biden.",
    "She'll be stronger than the border, toughen crime.",
    "And I'll tell you, you better do a good job carry.",
    "And then I did something I had to make a decision.",
    "You had these things changed by local politicians.",
    "I'll think of it and then it turns out to be fake.",
    "We're proud Americans, you know, they won't do it.",
    "24:22\n\nWe gave Joe Biden every tool he could want.",
    "I don't think there's a worse border in the world.",
    "Sheriff, would you like to run for another office?",
    "They say while it is unsubstantiated, the big lie.",
    "Do you hear them ever talking about what happened?",
    "I mean, it's so sad because I say, do me a favor.",
    "We did much better the second time you know that?",
    "Sheriff Mark lamb\n\n1:10:36\n\nhe's popular sheriff.",
    "We ended catch and release we added asylum fraud.",
    "And together we will make America powerful again.",
    "They can't win without doing a lot of bad things.",
    "Like you're in the military, or you're very sick.",
    "And they read this statement, which was nonsense.",
    "And they're going to say this was a total fraud.",
    "That's, I think, is almost our number one issue.",
    "This guy couldn't get on television fast enough.",
    "They have a good one, you know, Baron had COVID.",
    "What we're going to be introducing some of them.",
    "And it's a very dangerous thing for our country.",
    "It's a disgrace to our country what's happening.",
    "Thank you Arizona thank you thank you Thank you?",
    "I said how much money do we give to El Salvador?",
    "Don't lose hope our country will be great again.",
    "They said Please don't mention the word boycott.",
    "A scrape, he'll get to the bottom of everything.",
    "Thank you right side, wherever the hell you are.",
    "How do you do that the only one lower is Kamala.",
    "That's one of those deals you do that it's over.",
    "Because nobody's ever had a movement like this.",
    "I just want to wish everybody a Happy New Year.",
    "You think you'll get to the bottom of it, Mark?",
    "But they know, politics and they know cheating.",
    "They were locked down as close as you could be.",
    "We love our veterans our we love our veterans.",
    "It's a disgrace what a veteran Hello, veteran.",
    "It's being run by a horrible group of killers.",
    "The guy who shot Ashley Babbitt for no reason.",
    "And people have been forced to live like that.",
    "Their legislation is not a voting rights bill.",
    "Now, we're a laughingstock all over the world.",
    "So we're going to see what happens in Georgia.",
    "Boris than most people calling column Epstein.",
    "1:33:46\n\nThere is no mountain we cannot climb.",
    "The Big Lie, The Big Lie is a lot of bullshit.",
    "In fact, the press is blocking the people out.",
    "Whereas Carrie, come up here, Carrie, come on.",
    "We're so thankful that you're here in Arizona.",
    "And by the way, more importantly, forget them.",
    "Look at the people, as far as the eye can see.",
    "But we're going to fire the radical Democrat.",
    "But take a look behind you press take a look.",
    "Ambassador, Rick Grinnell, one of the greats.",
    "at&t is a company that is in serious trouble.",
    "How much money do we give to these countries?",
    "Other than that, it was a wonderful election.",
    "They don't talk about the size of that crowd.",
    "Now carries the one she's gonna be fantastic.",
    "He's gotten to their fallen Fast and Furious.",
    "You turn on the news and watch these fakers.",
    "They just want to anything to get that test.",
    "Can you imagine I want I want $1,000 A test.",
    "And they were there to protest the election.",
    "Biden's that he's only tough on Republicans.",
    "Inflation is the worst has been in 40 years.",
    "We never even heard the term supply chains.",
    "And they're not just talking about Arizona.",
    "And that's a shame What a waste, waterways.",
    "They're either evil or they're incompetent.",
    "Yes, he may be a socialist, but I like him.",
    "You know, he looks like a little bit older.",
    "I said it we're doing a movie on sheriff's.",
    "And Karen fan has been absolutely terrific.",
    "I think it was the largest crowd I've ever.",
    "Let them see their lawyers let them go out.",
    "And Biden's people say okay, you've got it.",
    "You know, we talk about the three justices.",
    "But the problem is, I didn't listen to him.",
    "What was the toughest country to deal with?",
    "I've gone through so many witch chunks now.",
    "It's like this is like a communist country.",
    "Again, working with the federal government.",
    "We just We can't let him get away with it.",
    "Because this is being totally whitewashed.",
    "Also, the American people deserve answers.",
    "They don't have the problems that we have.",
    "And we have some angel moms with us today.",
    "She's not happy when she sees this happen.",
    "It was more real than perhaps it was fake.",
    "Thanks for Paul has been incredibly tough.",
    "He is tough that I can tell you his stuff.",
    "I think we have 10s of millions of people.",
    "And even the fake news does to dispute it.",
    "Our nation belongs to you, belongs to you.",
    "That's not somebody that lost an election.",
    "Please come Please say\n\n07:00\n\nthank you.",
    "They continue to refuse to talk about it.",
    "American liberty is your God given right.",
    "I went to home and I went to mark Morgan.",
    "They were sending us a lot of bad people.",
    "And he's a great guy, and he's a fighter.",
    "And he's got some very good poll numbers.",
    "Good job of tying up those teleprompters.",
    "If she doesn't do a great job as a carry.",
    "He's the assembler that they had deleted.",
    "And in Chicago, it's happening every day.",
    "Could it be China or perhaps North Korea?",
    "And we don't even think about it anymore.",
    "Thank you good looking veteran, you are.",
    "There's no testing, there's no anything.",
    "And that fake news never talks about it.",
    "And always support our amazing veterans.",
    "But he's a great man, a great gentleman.",
    "And then I hear Trump is soft on Russia.",
    "And I did you know, we did a good thing.",
    "So we're lucky to have him on the bench.",
    "Does anybody know what that represents?",
    "They don't have respect for us anymore.",
    "And we're gonna end Nancy Pelosi crazy.",
    "That's because no one else is doing it.",
    "They knew exactly what they were doing.",
    "In addition to Biden's border disaster.",
    "and hopefully he's going to do his job.",
    "He's a disgrace the way he shot Ashley.",
    "You know, she wants to move to Florida.",
    "I'm a professional witch hunter beater.",
    "I'll tell you what we pass legislation.",
    "We never talk about greatness anymore.",
    "Oh, I'm not supposed to be doing this.",
    "They have no water, everybody's dying.",
    "I'm not going to use the word boycott.",
    "Because people told them not to do it.",
    "You got your thank you for everything.",
    "And I mean, like football fields back.",
    "I said I want to have in our country.",
    "They were sending us their prisoners.",
    "It's what the hell are they thinking?",
    "Well, that's the number but it's not.",
    "There is no challenge we cannot meet.",
    "Because our country is going to hell.",
    "They don't have the right to do that.",
    "And it takes the meaning of the word.",
    "Why what's happening to those people?",
    "I watched this guy being interviewed.",
    "You take a look at what they've got.",
    "How the hell did you elect this guy?",
    "And we did it even more beautifully.",
    "And nothing happens to these people.",
    "And that's what's happening locally.",
    "We talk about COVID The Coronavirus.",
    "It's a victory for American freedom.",
    "And the testing has been a disaster.",
    "We're getting our asses kicked here.",
    "Remember that say, Where's the test?",
    "We did an incredible job in testing.",
    "The antibodies and antibody testing.",
    "1:11:42\n\nAnd Pam Bondi, where's Pam?",
    "They don't want to turn the cameras.",
    "And right side has done a great job.",
    "It was all said it was all finished.",
    "We did great, you know, I ran twice.",
    "And the proof is all over the place.",
    "I love this great state of Arizona.",
    "They should have been put way back.",
    "I have to say I just saw him today.",
    "Thank you very much for being here.",
    "These are exactly what they wanted.",
    "That's the Cabal that's around him.",
    "We will stand proudly for our flag.",
    "We will not bend we will not break.",
    "There is no summit we cannot reach.",
    "We will make America wealthy again.",
    "And the fake news can't dispute it.",
    "And the testing is such a disaster.",
    "We can't let them get away with it.",
    "And Big Pharma is making a fortune.",
    "It's never happened to this extent.",
    "I'll come here, I will not be nice.",
    "Oh, and they harass these auditors.",
    "And you're going to be seeing that.",
    "That's right coming out of Georgia.",
    "These people are being persecuted.",
    "That's what they'd be calling for.",
    "They couldn't answer the question.",
    "And we have to get back our lives.",
    "Some people could call them cures.",
    "We will make America strong again.",
    "I think I have a pretty good idea.",
    "It was good having her on my side.",
    "And they've been doing a good job.",
    "Remember Joe Biden uses say a lot.",
    "It's a great honor to be with you.",
    "Now will the press reported today.",
    "Nancy's crooked political career.",
    "Make sure it's not a rigged vote.",
    "12:51\n\nNo, but what do you think?",
    "I've rebuilt the entire military.",
    "We have a man from Texas with us.",
    "We will make America proud again.",
    "And it belongs to you, Christina.",
    "There's never been anything like.",
    "Babies can be killed after birth.",
    "And that would be very, very sad.",
    "We have more people than they do.",
    "This is no longer just socialism.",
    "Number two, Debbie Lesko, Debbie.",
    "And now they are doing so openly.",
    "You see that happening right now.",
    "Why aren't they looking at that?",
    "These people are living in hell.",
    "These people are living in hell.",
    "And it's coming very, very fast.",
    "31:58\n\nIt's not even believable.",
    "He's a handsome looking veteran.",
    "But they are they are fantastic.",
    "These guys are making a fortune.",
    "But we have great, great people.",
    "We will make America safe again.",
    "These cars went back 2025 miles.",
    "You've never seen one like this.",
    "And Rick Grinnell was fantastic.",
    "He's one of the greatest people.",
    "We will defend our Constitution.",
    "They cannot blow up our country.",
    "We did such a job in the border.",
    "It's a disgrace what's going on.",
    "He's starting to shoot missiles.",
    "That's exactly what's happening.",
    "And you have no doubt about it.",
    "You really should be commended.",
    "So I will not say boycott them.",
    "Biden, is that tough on Russia?",
    "They wanted steel and concrete.",
    "It's called Make America great.",
    "You know, Charlie, was Charlie.",
    "Yet he still completely failed.",
    "We're now on the sixth variant.",
    "I've never heard of her before.",
    "But Andy Biggs did a great job.",
    "They don't have names going in.",
    "And I left it to the Democrats.",
    "And the people are very angry.",
    "They couldn't answer why, why?",
    "Why did you delete everything?",
    "They don't even talk about it.",
    "We talk about the environment.",
    "People, they love our country.",
    "But I call them Boris Epstein.",
    "It seems like not nice, right?",
    "They have to love our country.",
    "We will protect innocent life.",
    "They have to love our country.",
    "And they had help from others.",
    "They refused to talk about it.",
    "And are woke military leaders.",
    "And thank you very much Kerry.",
    "06:36\n\nCome on, proud of her.",
    "No, we we've never done that.",
    "Think of it seven times more.",
    "They've done a very good job.",
    "And they're very good people.",
    "They want their country back.",
    "And you really get the truth.",
    "So I don't know what this is.",
    "They have to love our people.",
    "And I said, What do you want?",
    "You got to work hard for him.",
    "And a man named Charlie Kirk.",
    "So you had to do like we did.",
    "He's incapable of keeping up.",
    "Women are men and the babies.",
    "And we have a horrible group.",
    "sounds so nice voting rights.",
    "We want a voting rights bill.",
    "That's what we want to know?",
    "So it wasn't the same thing.",
    "I don't want her in Florida.",
    "You probably know that here.",
    "They used to talk late term.",
    "And you know what he's done?",
    "I'm picking you to the lead.",
    "You probably heard about it.",
    "And it's so unfair to women.",
    "They're hurting us so badly.",
    "We've never even come close.",
    "One sin for awareness carry.",
    "They're gonna figure it out.",
    "Country is being destroyed.",
    "Kelly, wherever you may be.",
    "One of the greatest people.",
    "Mike Lindell until Oh, man.",
    "You've got to listen to me.",
    "Listen, listen, where am I?",
    "And we just lost Catco too.",
    "What we did was incredible.",
    "You see it happen so often.",
    "Why did you delete so much?",
    "It was a big corrupt steal.",
    "Your state is so important.",
    "These Democrat run cities.",
    "But they've harassed them.",
    "That's not a bad question.",
    "And amazingly, it stopped.",
    "And they were locked down.",
    "It's called America first.",
    "I think that's a big head.",
    "We want every one of them.",
    "And these walls are tough.",
    "1:17:24\n\nDon't lose hope.",
    "1:12:41\n\nThank you, Mike.",
    "No, because he wanted it.",
    "They just wouldn't do it.",
    "You get it based on race.",
    "I don't like you anymore.",
    "That's what it really is.",
    "People want to hear this?",
    "It's a voting fraud bill.",
    "We had to do it this way.",
    "So let's move to Florida.",
    "He's so proud of himself.",
    "They never talk about it.",
    "Well, they might be evil.",
    "Turn your cameras around.",
    "We don't want to do that.",
    "That's a lack of respect.",
    "We've had more problems.",
    "You wouldn't believe it.",
    "Useless Good job fellas.",
    "We don't think about it.",
    "Nothing happened to him.",
    "It stopped very quickly.",
    "And that's what happens.",
    "We won Ohio and Florida.",
    "He's a great, great bed.",
    "He's definitely Italian.",
    "This is a great network.",
    "I watch it all the time.",
    "And we built in Arizona.",
    "These are two great men.",
    "It's so unfair to women.",
    "We will never back down.",
    "These are great people.",
    "But these are patriots.",
    "They have so much debt.",
    "Ken is a fantastic guy.",
    "And he did a great job.",
    "He was so you know why?",
    "Cuz he was pro America.",
    "You can't get anything.",
    "Please get it out fast.",
    "It should never happen.",
    "We talk about all this.",
    "Very, very interesting.",
    "And he was in Congress.",
    "Nothing happens to him?",
    "What happened with him?",
    "I hope they gotta lose.",
    "They are being treated.",
    "They're toying with us.",
    "They're toying with us.",
    "And they did it plenty.",
    "I can see it right now.",
    "very dishonest people.",
    "12 million more votes.",
    "And an out of control.",
    "I don't think we have.",
    "I did a hell of a job.",
    "Not gonna be too long.",
    "She's you know, angry.",
    "I do think so he will.",
    "You're so popular guy.",
    "So I won't mention it.",
    "I say it all the time.",
    "This is your heritage.",
    "That's a lot of news.",
    "And the weightlifter.",
    "I think of the world.",
    "Not a good situation.",
    "And it is online too.",
    "Final County Sheriff.",
    "And here's the story.",
    "But they're not nice.",
    "What a job he's done.",
    "He hates advertising.",
    "And it hasn't worked.",
    "So that's what it is.",
    "Number one they lost.",
    "But it was more real.",
    "They ruin California.",
    "What really happened?",
    "Where are you, Andy?",
    "Where the hell am I?",
    "Thank you very much.",
    "We brought him back.",
    "We just don't do it.",
    "Thank you very much.",
    "I saw Pam Pam Bondi.",
    "Thank you very much.",
    "Thank you very much.",
    "Thank you very much.",
    "And we did that job.",
    "Aliens by the 1000s.",
    "And our magnificent.",
    "So big so important.",
    "Yeah, they might be.",
    "No, it's Iowa Islam.",
    "Nobody has anything.",
    "Look at the people.",
    "That's all we want.",
    "Thank you, Charles.",
    "And with your help.",
    "And that's not him.",
    "Thank you, Anthony.",
    "And I love Italian.",
    "Pam Bondi is great.",
    "What just happened?",
    "We brought it back.",
    "We talk about race.",
    "They have no right.",
    "Also, I don't know.",
    "I'll tell you that.",
    "She wants to move.",
    "Dope, a real dope.",
    "That's what it is.",
    "These poor people.",
    "They are horrible.",
    "They stopped them.",
    "And it's very sad.",
    "That's what it is.",
    "He gets his anger.",
    "We figured it out.",
    "Alveta King Aveda.",
    "Thank you, Debbie.",
    "Thank you, Robert.",
    "Thank you, Robert.",
    "hostages in Texas.",
    "They wanted rebar.",
    "This is your home.",
    "Arizona loves you.",
    "It's all promises.",
    "And you know what?",
    "I love this state.",
    "That's what it is.",
    "That's a low one.",
    "No, you're Idaho.",
    "Get out and vote.",
    "It was beautiful.",
    "It just happened.",
    "This is horrible.",
    "Thank you, Wendy.",
    "Thank you, sonny.",
    "Thank you, Kelly.",
    "What a great job.",
    "We appreciate it.",
    "That's very good.",
    "They won't do it.",
    "The worst animal.",
    "He's a great guy.",
    "Give me a break.",
    "Give me a break.",
    "Congratulations.",
    "That is serious.",
    "Nothing happens.",
    "It's a disgrace.",
    "Nobody wants it.",
    "It's a disgrace.",
    "He's a disaster.",
    "It's a disgrace.",
    "They came to me.",
    "They're capable.",
    "It's a disaster.",
    "Please stand up.",
    "It's all online.",
    "Tough and smart.",
    "Thank you, Andy.",
    "And Mark Morgan.",
    "But getting out.",
    "State Senators.",
    "She's so great.",
    "Sunny, barelli.",
    "He's a patriot.",
    "He was so good.",
    "They're fakers.",
    "at the Capitol?",
    "Let them fight.",
    "You were there.",
    "without trial.",
    "He put in 470.",
    "Was it Russia?",
    "Boris F shine.",
    "I do think so.",
    "Where are you?",
    "And a sheriff.",
    "Thanks, Kelly.",
    "Play question.",
    "Wendy Rogers.",
    "They're here.",
    "Oh, this one.",
    "You know why?",
    "Thanks, Rick.",
    "Unbelievable.",
    "Look at that.",
    "Boy, oh, boy.",
    "That's great.",
    "Get in there?",
    "They refused.",
    "Now we have.",
    "We love you.",
    "That's true.",
    "Was it Iran?",
    "What people?",
    "So you know.",
    "Ken Paxton.",
    "Is it true?",
    "After that.",
    "11 of them.",
    "And Robert.",
    "Where am I?",
    "Guess what?",
    "Am I right?",
    "Where's it?",
    "It's crazy.",
    "Paul gosa.",
    "Thank you.",
    "Thank you.",
    "Let's see.",
    "It's true.",
    "I said no.",
    "Thank you.",
    "Thank you.",
    "Great job.",
    "Thank you.",
    "Thank you.",
    "Good luck.",
    "Thank you.",
    "Thank you.",
    "Great job.",
    "Thank you.",
    "Have you?",
    "Both you.",
    "tax rate.",
    "Go go go.",
    "Exactly.",
    "Exactly.",
    "barelli.",
    "America.",
    "Thanks.",
    "Thanks.",
    "Debbie.",
    "Right?",
    "Sunny.",
    "Again.",
    "Paul.",
    "Andy.",
    "Sir?"
  ]
}