{
  "id": 3053,
  "mediaId": 2746,
  "date": "2022-03-10",
  "headline": "Biden’s energy policies and the threat to American small business",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/10/russia_ukraine_war_gas_misinformation_45676_c0-171-4105-2565_s1200x700.jpg?0e945a66025d03af057e76c43bf79dddd137c86e",
  "link": "https://www.washingtontimes.com/news/2022/mar/10/bidens-energy-policies-and-threat-american-small-b/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelly Cooper",
  "authorUrl": "",
  "termIds": [
    3975,
    4830,
    5371
  ],
  "sentences": [
    "Not only has it had disastrous consequences for my industry, as the events of the past week have shown, but the unnecessarily reliance on other countries who do not have an aligned interest of the United States also destabilizes our world.",
    "When I am elected to Congress, I will push to re-open the Keystone XL pipeline and keep the federal government from shutting down other critical pipelines that provide oil and natural gas in the United States.",
    "With the removal of the Keystone XL pipeline and the increasing exploration restrictions, traditional energy companies are no longer investing in the development of new technologies and future exploration.",
    "As the world transitions between technological innovation for new energy, we can not lose sight of the damage we can do to our fellow citizens and the world if we move too fast.",
    "If we truly care about the “global” climate, it makes sense for the United States to lead in the energy sector and be a net exporter of energy to our friends and allies.",
    "After this announcement, oil prices continued to move upward, and it had no effect on helping the average American struggling to keep up with massive energy inflation.",
    "For our restaurant to put that steak in front of a guest, I have been forced to either increase my price to the customer or reduce the profits I use to pay employees.",
    "As we have been reminded, there will always be evil in the world, and those countries are using their energy production to blackmail the world.",
    "We need leaders who are willing to stand up for Small businesses and Americans that look to those businesses to support their families.",
    "The “going cold turkey” approach to eliminate traditional energy for green energy has proven disastrous to our communities.",
    "Among those is EO 13990: Protecting Public Health and the Environment and Restoring Science to Tackle the Climate Crisis.",
    "Without question, continuing this path will only lead to further destruction of the United States and the global economy.",
    "Our President made a politically motivated attempt at short-term relief by releasing a portion of the strategic reserve.",
    "If no changes are made, the results will be a generational struggle similar to some of the worst in history.",
    "When I am in Congress, I will not support releasing our strategic reserves for short-term political gain.",
    "On the first day of the Biden administration, he took away our energy freedom with one stroke of the pen.",
    "That same bag of corn goes to feed cattle that will pay more for fuel to grow and transport to market.",
    "I sincerely hope that President Biden will recognize the folly of his position on energy policy.",
    "In fact, every product that I buy has increased in cost, most by more than 40% since last year.",
    "President Joe Biden made a series of executive orders in the first three days of this term.",
    "In my restaurant business, energy inflation affects us in every corner of our operation.",
    "A stalk of corn requires fuel to grow, harvest, package and transport to market.",
    "We had the ability to influence energy costs based on our actions exclusively.",
    "The current economic conditions continue to damage my industry and employees.",
    "No country in the world does energy exploration cleaner or more efficient.",
    "Instead, I will support re-opening federal lands for energy exploration.",
    "OPINION:\nI am a restaurant owner with multiple stores in Arizona.",
    "Every product made or grown in our economy is touched by energy.",
    "Kelly Cooper is a Small Business Owner and Candidate for AZ-04",
    "Just over a year ago, we were energy independent as a nation.",
    "In this order is the revocation of the Keystone XL pipeline.",
    "The effect of which was like putting a bandaid on a geyser.",
    "We need America to regain its energy independence.",
    "How did we get to this reliance on foreign energy?",
    "Most restaurant profit lines are far below 40%.",
    "I look forward to doing that in Congress.",
    "I pray for our people and our country.",
    "We began this discussion with energy."
  ]
}