[
  {
    "id": 3563,
    "mediaId": 2658,
    "date": "2022-01-20",
    "sentence": "He made his first endorsement of a primary challenger to one of the 10 GOP House members who crossed him on impeachment — former and favored aide <span class='selected-term'>Max Miller</span> against incumbent Anthony Gonzalez (R-Ohio).",
    "author": "",
    "title": ""
  },
  {
    "id": 2623,
    "mediaId": 2551,
    "date": "2022-02-04",
    "sentence": "They've also subpoenaed Jeffrey Clark, a former DOJ official, former Trump advisors Stephen Miller and <span class='selected-term'>Max Miller</span>, former White House deputy press secretary Judd Deere, former White House chief of staff Mark Meadows and former White House Press Secretary Kayleigh McEnany, among others.",
    "author": "Morgan Phillips",
    "title": "GOP Rep. Jim Jordan spoke to Trump on the phone for 10 minutes on January 6, new White House records reveal"
  },
  {
    "id": 1465,
    "mediaId": 5308,
    "date": "2022-02-17",
    "sentence": "Now, the former president is currently supporting his former White House aide <span class='selected-term'>Max Miller</span> in a House campaign even though Miller’s ex-girlfriend, fellow former White House staffer Stephanie Grisham, accused him of physically and emotionally abusing her.",
    "author": "Cameron Joseph",
    "title": "Trump endorsed a congressional candidate accused of abusing her stepdaughter."
  },
  {
    "id": 57,
    "mediaId": 2550,
    "date": "2022-02-22",
    "sentence": "",
    "author": "",
    "title": "Who's who: A rolling guide to the targets of the Jan. 6 committee"
  },
  {
    "id": 5299,
    "mediaId": 2641,
    "date": "2022-04-10",
    "sentence": "Six-termer Gibbs, a strong conservative who almost always supported Trump, nonetheless opted out of re-election when a new redistricting plan placed him in the same district as <span class='selected-term'>Max Miller</span>, former Trump White House staffer and scion of a wealthy real estate family in Cleveland.",
    "author": "John Gizzi",
    "title": "'Trump Factor' Key Reason for Republican Retirements From House"
  }
]