{
  "id": 10750,
  "mediaId": 2664,
  "date": "2022-03-11",
  "headline": "Congress hates changing the clocks just like everyone else",
  "image": "https://www.rawstory.com/media-library/congressional-republicans-abandon-constitutional-heritage-and-watergate-precedents-in-defense-of-trump.png?id=24726609&width=1200&coordinates=0%2C10%2C0%2C10&height=600",
  "link": "https://www.rawstory.com/when-do-we-change-the-clocks/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ariana Figueroa",
  "authorUrl": "https://www.rawstory.com/u/arianafigueroa-statesnewsroom",
  "termIds": [
    1648,
    3266,
    3822,
    2836,
    4800,
    1433,
    392,
    1126,
    6678,
    6159,
    6709
  ],
  "sentences": [
    "He said a biannual clock switch “wreaks havoc with our sleep cycles, notably causing a 24 percent increase in heart attacks in the week after we ‘spring forward’ in March.”\nA study by researchers at Rutgers found that nearly 350 lives would be saved by moving to permanent daylight saving time year round.",
    "“Anytime you change anything to Arizona, Arizonans will be upset.”\nRepublicans object to topic\nRep. Fred Upton, a Michigan Republican, said he believed it should be up to the states if they want to move to daylight saving time, but he also expressed frustration for having the hearing in the first place.",
    "“I believe that any justifications for springing forward and falling back are either outdated or are outweighed by the serious health and economic impacts we now know are associated with the time changes,” U.S. House Energy and Commerce Committee Chair Frank Pallone of New Jersey said this week.",
    "“Obesity, diabetes, heart disease, even cancer and Alzheimer disease is linked to either sleep loss or that circadian misalignment.”\nOhio Capital Journal is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "As Americans prepare to adjust their clocks this weekend for daylight saving time, lawmakers at an Energy and Commerce subcommittee hearing on Wednesday assembled a panel of experts to discuss the health, energy and economic impacts of the shift twice a year.",
    "She asked one of the witnesses, Dr. Beth Malow, a professor of neurology and pediatrics at Vanderbilt University Medical Center in Nashville, Tennessee, if she knew of any studies on the health benefits for Arizonans who are used to living on standard time.",
    "The top GOP lawmaker on the panel, Gus Bilirakis of Florida, discussed the health effects of switching back and forth and said he is concerned about children going to school in the dark if Congress did move to make daylight saving time permanent.",
    "Rep. Bob Latta, an Ohio Republican, said the last time he got a complaint from his constituents about daylight saving time was in 2020 and said that his constituents were worried about the Russia-Ukraine conflict.",
    "He advocated for a permanent change to daylight saving time, arguing that having one more hour of sunlight in the evening would reduce crime, decrease fatal car accidents, save energy and improve heath.",
    "WASHINGTON — Republicans and Democrats in Congress can agree on sleep, or more precisely, the inconvenience of losing or gaining an hour of it each year thanks to going on and off daylight saving time.",
    "Stop switching\nSome lawmakers couldn’t decide if they wanted daylight saving time or standard time, but they all agreed that it was archaic for the United States to keep switching back and forth.",
    "Daylight saving time was used as an energy-saving measure during various points in U.S. history, such as World War I, and has become a permanent fixture since the energy crisis of the 1970s.",
    "Calandrillo said that as a parent of four young children, he did also not want them to go to school in the dark and suggested that schools start later, so children can get adequate sleep.",
    "In the last four years, 18 states have enacted or passed measures to provide for year-round daylight saving time, but without congressional approval, they can’t adopt those changes.",
    "Bilirakis agreed and said that he felt his kids going to school around 7 a.m. was “too early,” and was open to the idea of giving schools flexibility to change their start times.",
    "Daylight saving time begins at 2 a.m. on Sunday, which means clocks in most of the U.S. will be turned forward one hour and there will be more light at the end of the day.",
    "Florida Sen. Marco Rubio, a Republican, has introduced legislation that would make daylight saving time permanent, and similar legislation is pending in the House.",
    "“Coming from the Sunshine State, we value sunshine for our quality of life, recreation and our tourism economy,” Rep. Darren Soto, a Florida Democrat, said.",
    "Congress would have to authorize a change in federal law to allow permanent daylight saving time, but it’s not clear there is the momentum to do that.",
    "Malow agreed that starting school later could help children, particularly teens who are going through puberty, which can affect their sleep schedules.",
    "Malow, who is also the director of the Vanderbilt Sleep Division, said she was not aware of any, but advocated for a permanent standard time.",
    "A handful of Republicans on the panel agreed and argued that they should be focusing their time on helping Ukraine amid the Russian invasion.",
    "Lawmakers from Florida were adamant that an extra hour of daylight, would be beneficial for health, the economy and for schools.",
    "“Darkness kills and sunshine saves,” Steve Calandrillo, a law professor from the University of Washington, said at the hearing.",
    "Under federal law, states can opt out and remain on standard time, but are not allowed to change to daylight saving time.",
    "Rep. Debbie Dingell, a Michigan Democrat, asked Malow to explain the effect sleep deprivation has on overall health.",
    "He said he believed the panel should be focusing on America’s energy independence after Russia’s attack on Ukraine.",
    "Iowa’s state House recently passed a bill that would put the state on daylight saving time, pending federal action.",
    "Reps. Neal Dunn, a Florida Republican, and Cathy McMorris Rodgers, a Washington Republican, raised similar points.",
    "“Bright light in the morning is a piece of the puzzle that will help our kids get more sleep,” she said.",
    "Rep. Debbie Lesko, an Arizona Republican, said her state has been on standard time for nearly 40 years.",
    "“Please don’t mess with Arizona, we’ve been doing this for 40 years,” Lesko said to her colleagues.",
    "“Other things we should be talking about is American energy independence,” Latta said.",
    "“When we’re not sleeping well, it has a whole host of ramifications,” Malow said.",
    "Two states have passed measures to stay on standard time — Arizona and Hawaii.",
    "Contact Editor David DeWitt for questions: info@ohiocapitaljournal.com.",
    "Ohio Capital Journal maintains editorial independence.",
    "Follow Ohio Capital Journal on Facebook and Twitter.",
    "Daylight saving time will end on Nov. 6."
  ]
}