{
  "id": 10936,
  "mediaId": 2520,
  "date": "2022-03-17",
  "headline": "Rep. Andy Biggs among few to oppose bill suspending normal trade with Russia",
  "image": "https://www.gannett-cdn.com/presto/2021/10/07/PPHX/db05316f-64a4-4601-a6ed-e95eb9d9f5c7-AP21280526362419.jpg?crop=1023,576,x0,y51&width=1023&height=576&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/03/17/rep-andy-biggs-among-few-oppose-bill-suspending-trade-russia/7081904001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronald J. Hansen",
  "authorUrl": "https://www.azcentral.com/staff/2647673001/ronald-j-hansen/",
  "termIds": [
    4905,
    4185,
    2443,
    3205,
    2426,
    1601,
    1477,
    6569,
    5980
  ],
  "sentences": [
    "Our partners and allies are joining with us in this effort, taking similar steps to further isolate Putin and his regime from the rest of the civilized world.”\nAG asks court to act against Hobbs on election manual Lawmakers want cannabis testing changes following Republic report Karrin Taylor Robson drops fundraising tactic after questions 'It changed lives': How the man who brought Elvis to Phoenix shook up local country radio\nRep. Kevin Brady, R-Texas, welcomed a chance to add more pressure on Russian President Vladimir Putin.",
    "“This is another step in the right direction and includes further incentives to Russia to end its aggression.”\nBrady said he was troubled the bill didn't do more for American energy production, and, like Biggs, worried that language on human-rights abuses was \"unnecessarily vague and could lead to future abuses.\"",
    "Rep. Andy Biggs was one of only eight House members to vote Thursday against suspending normal trade relations with Russia and Belarus, saying he fears President Joe Biden will use a provision to punish opponents of abortion rights.",
    "\"This will further isolate Russia's economy from the rest of the world and will hold Belarus accountable for its complicity in Putin's brutal and illegal invasion of Ukraine.\"",
    "The bill, which now goes to the Senate, would impose tariffs on goods from Russia and Belarus and requires Biden to seek to remove Russia from the World Trade Organization.",
    "\"It actually allows our president to go to almost anybody in the world, and if they have a visa, he can take away their visa,\" Biggs said in a video explaining his vote.",
    "“We must do everything in our power to hold Russia accountable for the atrocities it is committing hourly in the nation of Ukraine,” Neal said on the floor of the House.",
    "Rep. Richard Neal, D-Mass., said the measure showed Congress responded to Ukrainian President Volodymyr Zelensky's plea to lawmakers on Wednesday for additional help.",
    "Last week, Biggs and Rep. Paul Gosar, R-Ariz., were among 17 House members — including two Democrats — to oppose expanding sanctions to include a ban on Russian oil.",
    "\"If Democrats were serious about sanctioning Russia, they would not give President Biden broad authority to waive the sanctions once they take effect.\"",
    "Specifically, Biggs cited his opposition to a provision giving the president expanded authority under an existing law targeting human-rights abusers.",
    "It is the second time in as many weeks that Biggs has voted with a small minority against bills intended to target Russia over the war in Ukraine.",
    "The House of Representatives voted 424-8 to further punish Russia economically for its invasion of Ukraine and Belarus for enabling it.",
    "It could be used even on people who are pro-life advocates elsewhere in the world if Biden thinks that pro-abortion is a human right.\"",
    "Biggs, R-Ariz., said Democrats took a broadly popular measure and added a \"couple pieces of garbage to give themselves more power.\"",
    "\"I just voted to suspend normal trade relations with Russia and Belarus,\" Stanton said in a statement afterward.",
    "Like Gosar, he said the U.S. needed to include provisions to boost domestic energy production at the same time.",
    "On Thursday, Rep. Greg Stanton, D-Ariz., cast the trade-status bill as one of accountability for rogue nations.",
    "\"This is Nancy Pelosi’s fake Russian oil sanctions bill,\" Biggs said in a statement on that measure.",
    "\"He can freeze their assets regardless of whether they have anything to do with Russia whatsoever.",
    "Reach the reporter Ronald J. Hansen at ronald.hansen@arizonarepublic.com or 602-444-4493.",
    "All eight members in the House as a whole who opposed it are Republicans.",
    "“American dollars will no longer fund Russia's war machine,” he said.",
    "All eight of Arizona's other House members voted for the bill.",
    "“This is an unprovoked horror that the world is seeing.",
    "Rep. Debbie Lesko, R-Ariz., didn't vote on that bill.",
    "Subscribe to our free political podcast, The Gaggle.",
    "Despite his concerns, Brady voted for the measure.",
    "He gets to define what a human-rights abuse is.",
    "Follow him on Twitter @ronaldjhansen.",
    "Subscribe to azcentral.com today.",
    "Support local journalism.",
    "..."
  ]
}