{
  "id": 1859,
  "mediaId": 2520,
  "date": "2022-02-10",
  "headline": "Stanton legislation aims to curb China influence on US markets",
  "image": "https://www.gannett-cdn.com/presto/2022/01/17/PPHX/1bd8f52e-2eb5-43ed-ad7c-4940ec7f73e3-MLK_Day_March002.JPG?crop=5999,3375,x0,y305&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/news/politics/arizona/2022/02/10/greg-stanton-legislation-aims-curb-china-influence-us-markets/6722867001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cami Parrish",
  "authorUrl": "https://www.azcentral.com/staff/6528856001/cami-parrish/",
  "termIds": [
    1716,
    3813,
    4185,
    3529,
    482,
    5949,
    6678,
    5967,
    6509
  ],
  "sentences": [
    "\"As federal regulators make major decisions about companies doing business here in the U.S., they should fully understand the national security implications.”\nThe Ministry of Foreign Affairs and of the People’s Republic of China held a news conference Monday during which spokesperson Zhao Lijan said that the China-related measures in the America COMPETES Act are “steeped in Cold War mentality.”\nRepublican Reps. Andy Biggs, Paul Gosar, Debbie Lesko and Dave Schweikert of Arizona on Friday voted against the passage of the COMPETES Act while Stanton and fellow Democratic Reps. Tom O’Halleran, Ann Kirkpatrick, Raúl Grijalva and Ruben Gallego voted for it.",
    "Lawmaker fined $62K for not disclosing donors, pays $1K Arizona could take oversight of toxic coal waste disposal Election deniers file lawsuit to ban machines Biggs said to push early for alternate electors\n\"Our semiconductor industry is a perfect example of why this legislation is so important for Arizona — China has a massively subsidized semiconductor industry,\" Stanton said.",
    "The panel's 2020 annual report suggested that companies that receive financial aid from a foreign government “provide the FTC with a detailed accounting of these subsidies when undergoing FTC premerger procedures.”\nIn a written statement to The Arizona Republic, Stanton said that the legislation primarily is about protecting American businesses.",
    "Stanton, D-Ariz., and Rep. Scott Fitzgerald, R-Wisc., got their bipartisan amendment included in the House-passed America COMPETES Act, legislation intended to boost the United States’ competitiveness with China by funding semiconductor research and development while also bolstering supply chains and STEM education.",
    "“We have to stand up for American businesses and consumers and ensure that Chinese government-backed enterprises cannot distort our markets and jeopardize our national security.”\nThis amendment stems from a recommendation from the U.S.-China Economic and Security Review Commission.",
    "The amendment from Stanton and Fitzgerald would require merging companies in the U.S. to disclose to federal antitrust agencies, such as the Federal Trade Commission, any aid given to the companies by foreign governments.",
    "U.S. companies would have to report any aid from foreign governments to antitrust agencies under legislation by Rep. Greg Stanton that aims to counter China's influence on U.S. markets.",
    "“The America COMPETES Act will turbocharge American technological innovation — but we can’t compete unless we ensure the playing field is level for U.S. companies,” Stanton said.",
    "The intent is to make sure that foreign governments, mainly China, are not easily able to influence U.S. markets.",
    "The House voted 222-210 to pass the bill."
  ]
}