{
  "id": 4239,
  "mediaId": 2522,
  "date": "2022-01-26",
  "headline": "Shocking video shows mostly adult male illegals released and then taken to TX airport",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/01/BusesSG-484-x-252.jpg",
  "link": "https://www.bizpacreview.com/2022/01/26/shocking-video-shows-mostly-adult-male-illegals-released-and-then-taken-to-tx-airport-1193289/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Donaldson",
  "authorUrl": "https://www.bizpacreview.com/author/chris-donaldson/",
  "termIds": [
    5096,
    4905,
    3083,
    1394,
    6678,
    6011,
    5949
  ],
  "sentences": [
    "They also said they were flying to destinations including Miami, Houston and Atlanta.”\n“In a statement to Fox News, the city of Brownsville said its Office of Emergency Management, through federal assistance from the Federal Emergency Management Agency (FEMA), works to facilitate “the transfer of these migrants to their final destination by allowing them to use services to contact their families, NGOs, or a taxicab,” he wrote.",
    "We followed the taxis to Harlingen airport, where the migrants were dropped off to get on flights around U.S. @FoxNews pic.twitter.com/HcSSwtjMnR\n— Bill Melugin (@BillFOXLA) January 25, 2022\nA second video shows another bus pulling up to the same parking garage to release “dozens of predominately singe male adult migrants,” according to Melugin; a bus driver confirmed that the location served as a drop off for ICE.",
    "While such issues as massive inflation, empty store shelves, a scheme to federalize elections under the pretense of “voting rights” and saber-rattling at Russia over Ukraine have dominated the news, the border remains porous as the administration facilitates safe passage for migrants at a time when COVID is raging out of control.",
    "In the videos which were posted to Twitter by Fox News National correspondent Bill Melugin, a large number of mostly adult males were observed in Brownsville, Texas where they were bussed to for processing at an office with a sign reading “Border Patrol drop-off” and then put into taxi cabs which then took them to the airport.",
    "SIGN UP HERE\n(Video: Fox News)\nShocking video of a large number of illegal immigrants who have been released from federal custody and then provided with transportation to a Texas airport is a reminder that President Joe Biden’s immigration policies have been a monumental disaster for America.",
    "According to Fox News,”The development comes just as CBP officially released its December border numbers — showing 178,840 encounters in December, a slight increase over November, but significantly higher than the 73,994 encountered in December 2020.”\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "— Congresswoman Debbie Lesko (@RepDLesko) January 25, 2022\nTexas Senator Ted Cruz wrote on Twitter, “The Biden-Harris Administration is rolling out the red carpet for illegal aliens.”\nThe Biden-Harris Administration is rolling out the red carpet for illegal aliens.",
    "@FoxNews pic.twitter.com/UypXYBtrGl\n— Bill Melugin (@BillFOXLA) January 25, 2022\nAccording to the Fox News report by Melugin, “Several of the migrants told Fox that they had crossed illegally that morning, paying approximately $2,000 per person to cartel smugglers.",
    "In the first video, the migrants were filmed disembarking from a federally contracted vehicle, exiting from the office where they were dropped off and entering the taxicabs which were followed to the airport to await flights to various U.S. locations.",
    "@FoxNews pic.twitter.com/njz12HM13s\n— Bill Melugin (@BillFOXLA) January 25, 2022\nIn another video posted an hour and a half later, the 4th group in the last two hours was dropped off, some of them were observed wearing ankle monitors.",
    "@FoxNews pic.twitter.com/mnneUNHFC1\n— Bill Melugin (@BillFOXLA) January 25, 2022\nMelugin provided more detail of a group that had received travel folders from an NGO, he emphasized that they were all single adult men without families.",
    "@FoxNews pic.twitter.com/c7kgs4rgyL\n— Bill Melugin (@BillFOXLA) January 25, 2022\nIn his latest bombshell piece of reporting, the intrepid Melugin detailed the mass release which was all caught on video by a Fox News team.",
    "https://t.co/GJ21l709QI\n— Senator Ted Cruz (@SenTedCruz) January 25, 2022\n“Biden’s border crisis has endangered American communities and made EVERY state a border state,” the House Republicans Twitter account wrote.",
    "Republicans took to Twitter to weigh in on Melugin’s reporting, led by Rep. Debbie Lesko of Arizona who said, “We are flying illegal immigrants around our nation while we have an escalating border crisis.",
    "BREAKING: Another federally contracted bus just pulled up to the same parking garage in Brownsville and released dozens of predominantly single adult male migrants, who went into the same unmarked office.",
    "In a statement, the city of Brownsville confirmed to me that they use this spot to work with the federal government to facilitate travel for the migrants released from federal custody.",
    "NEW: In the middle of our live shot on @FoxNews, another group of dozens of single adult male migrants were dropped off by the federal government in Brownsville.",
    "Melugin observed that there were black tarps set up to conceal the operation from public view, typical of the Biden regime’s lack of transparency.",
    "NEW: We witnessed the federal gov mass releasing single adult migrants, almost all men, at a parking garage in Brownsville.",
    "BREAKING: The federal government continues to mass release single adult male migrants at a parking garage in Brownsville.",
    "There is no record of who is coming and going.”\nShe added, “Democrats continue to put American lives in danger.",
    "A NGO then gave them travel folders and they walked to a nearby bus stop to travel elsewhere in the country.",
    "SHAMEFUL!”\nWe are flying illegal immigrants around our nation while we have an escalating border crisis.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "There are black tarps set up around the parking garage to obstruct the public’s view.",
    "What if just ONE of these individuals with no documentation is a terrorist?",
    "What if just ONE of these individuals with no documentation is a terrorist?",
    "Get the latest BPR news delivered free to your inbox daily.",
    "One of the bus drivers confirmed this was an ICE drop off.",
    "All being released to bus stations or the airport.",
    "The public will not see it and we do not share it.",
    "There is no record of who is coming and going.",
    "We’ve seen 4 of these groups in last 2 hours.",
    "Taxi cabs were then called for them.",
    "Some have ankle monitors on.",
    "#BidenBorderCrisis.",
    "Not Title 42’d."
  ]
}