{
  "id": 4533,
  "mediaId": 2746,
  "date": "2022-01-13",
  "headline": "Trump rally brings joy, high-profile guests to Arizona Republicans",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/01/13/BELTWAY_election_2020_trump_87708_c0-237-5696-3559_s1200x700.jpg?39eddf5af7c9317b3000ed4e270808b7b24270b1",
  "link": "https://www.washingtontimes.com/news/2022/jan/13/inside-beltway-donald-trump-rally-brings-joy-arizo/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jennifer Harper",
  "authorUrl": "https://www.washingtontimes.com/staff/jennifer-harper/",
  "termIds": [
    2426,
    2765,
    3083,
    3518,
    4669,
    4905,
    1126,
    99,
    5949,
    6158
  ],
  "sentences": [
    "“Whether they protect us on the battlefield, help us with medical challenges, or just lighten our spirits with an enthusiastic kiss after a hard day, dogs save and improve our lives every day,” said Robin Ganzert, American Humane’s president and CEO, in a statement shared with “Inside the Beltway.”\nWEEKEND REAL ESTATE\nFor sale: Mount Pleasant Farm, an all-brick Georgian Colonial mansion built in 1907 on three acres in Havre de Grace, Maryland.",
    "NewsmaxTV.com and the Newsmax channel, featured on cable and streaming outlets, will offer pre-rally coverage starting at 7 p.m. EST on Saturday, with live coverage of the event starting at 9 p.m.\n‘UNDERWATER JOE’\nThere is frequent talk about the persistent partisan divide between Republicans and Democrats and its influence on both society and culture.",
    "“It is self-evident that states must boldly step into this breach and do what Washington D.C. simply will not: protect the citizens of Arizona and finally put an end to the violence, chaos, and human misery caused by our unsecured border with Mexico.",
    "POLL DU JOUR\n• 47% of U.S. adults think that “some other Democrat” besides House Speaker Nancy Pelosi should be the leader of the Democrats in the U.S. House of Representatives; 72% of Republicans, 49% of independents and 31% of Democrats agree.",
    "The best way to do that is by restoring voter confidence in our elections and taking back the United States House and Senate while expanding our majorities in the state legislature and sweeping — yes, sweeping — statewide offices in November.",
    "Dog owners across the country are invited to nominate their heroic hound in one of seven categories: law enforcement and detection dogs, military dogs, therapy dogs, service dogs, shelter dogs, search and rescue dogs, and guide/hearing dogs.",
    "The top dog in each category will appear at the star-studded, red-carpet awards gala in Palm Beach on Nov. 11 — and one of the seven will be named the American Hero Dog of the year, the most prestigious honor a canine can receive.",
    "Kari Lake — a former Fox News anchor now running for governor of Arizona — is also on the rally program and has made the defense of Arizona’s 373-mile border with Mexico a pillar of both her campaign and her policy statements.",
    "“The only way I can do one more special is if it’s at the end of my television career because it will end my television career,” Steve Harvey said Thursday during an appearance before a Television Critics of America panel.",
    "The rally is considered a “continuation” of Mr. Trump’s effort to advance his signature MAGA agenda and highlight “America First” candidates and causes, according to advance information for the event.",
    "She is among 10 guest speakers — a roster that includes Arizona Republican Reps. Andy Biggs, Paul Gosar and Debbie Lesko — along with Ms. Ward, Alveda King and Mike Lindell, CEO of My Pillow.",
    "“There will be the first Save America rally of 2022 with President Donald J. Trump in Florence, Arizona,” said a beaming Arizona Republican Party chair Kelli Ward in an upbeat video message.",
    "NEWS AND OPINION:\nFormer President Donald Trump will stage one of his signature jumbo rallies on Saturday in Arizona — and Republicans in the state couldn’t be happier.",
    "Eight bedrooms, three baths, 10-foot ceilings, four fireplaces, soaring windows, grand staircase, “many unique features,” and decorative touches; 6,560 square feet.",
    "“I am so looking forward to seeing so many amazing patriots from across our state as we launch into this crucial election year,” Ms. Ward said in her message.",
    "The poll found that 42% overall believe Mr. Biden is doing more to unite the country than divide it; 5% of Republicans and 84% of Democrats agree with that.",
    "First TV, by the way, reviewed the findings and concluded that an apt nickname for Mr. Biden at the moment is “Underwater Joe.”\nTHAT’S ENTERTAINMENT\nFunny?",
    "Another longtime comedian has vowed he won’t make another TV special to showcase his craft and humor because of political and social pressures.",
    "ONE FOR THE PUPS\nAmerican Humane has announced that nominations for the 2022 American Humane Hero Dog Awards campaign are now underway.",
    "Numbers tell the story best, and here they are, courtesy of a Quinnipiac University poll of 1,313 U.S. adults conducted Jan. 7-10.",
    "• 20% think Mrs. Pelosi should remain in the role; 3% of Republicans, 12% of independents and 45% of Democrats agree.",
    "• 15% overall “don’t care” about the issue; 13% of Republicans, 18% of independents and 6% of Democrats agree.",
    "• 18% are “not sure” about the issue; 11% of Republicans, 21% of independents and 18% of Democrats agree.",
    "Original floors and woodwork, grand staircase, multiple formal gathering rooms, workshop.",
    "Priced at $625,000 through Cummingsrealtor.com; enter MDHR2005612 in the search function.",
    "Here at the Republican Party of Arizona, it is always America first,” Ms. Ward concluded.",
    "No stand-up comedian alive that is sponsor-driven can say anything he wants to.",
    "“If I had tried to continue as a stand-up, there’s no way I could maintain it.",
    "It found that 33% of U.S. adults approve of the job President Biden is doing.",
    "SOURCE: An Economist/YouGov poll of 1,500 U.S. adults conducted Jan. 8-11.",
    "As governor, I will do precisely that,” Ms. Lake said in a statement.",
    "That includes “finishing Trump’s wall,” according to the candidate.",
    "Political correctness has killed comedy,” he told the gathering.",
    "That includes 2% of Republicans and 75% of Democrats.",
    "• Helpful information to jharper@washingtontimes.com.",
    "This divide may have reached its largest schism yet.",
    "Consult Herodogawards.org for complete information.",
    "“We have got to get our country back on course.",
    "And there is one more finding of note as well.",
    "I can go down the list,” Mr. Harvey noted.",
    "Nominations are open until March 16.",
    "Property in need of a few upgrades.",
    "“We’re in the cancel culture now.",
    "We can do all of those things.",
    "Cedric the Entertainer can’t.",
    "Chris Rock can’t.",
    "Kevin Hart can’t.",
    "Hughley can’t.",
    "All of them.",
    "Forget it.",
    "D.L."
  ]
}