{
  "id": 4793,
  "mediaId": 2627,
  "date": "2022-04-21",
  "headline": "GOP has a weird habit of debunking its own ‘open borders’ claims",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220421-Debbie-Lesko-al-0858-8537b8.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/gop-weird-habit-debunking-open-borders-claims-rcna25349",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    4905,
    3083,
    1126,
    1125,
    6383,
    6678
  ],
  "sentences": [
    "Just as notable, though, is the degree to which the Arizona Republican made the same mistake the RNC made in February: In one tweet, Lesko simultaneously told the public that the White House has adopted “open border policies” and that the Biden administration successfully apprehended a billion migrants — which is to say, a million migrants — at the southern border since last fall.",
    "This came to mind on Tuesday night when Republican Rep. Debbie Lesko of Arizona published a related tweet — which has since been deleted — which read:\nPart of the problem, of course, is that the GOP congresswoman used a few too many zeroes: As Lesko saw it, more than a billion migrants were apprehended at the border.",
    "Recommended\nTo the extent that reality still matters, Lesko was referring to a Wall Street Journal report that did, in fact, note that U.S. officials have made “more than a million arrests at the U.S.-Mexico border since October,” which is certainly a large number.",
    "That said, the context matters: The busiest month was March, and as the Journal’s report added, “The numbers included a sharp rise in migrants from Cuba and Ukraine.”\nMany of these people aren’t trying to sneak into the United States.",
    "839 pounds of deadly fentanyl was seized at the southern border in January alone.”\nThe key word, of course, was “seized.” On the one hand, the RNC wants people to believe President Joe Biden has adopted an open-border policy.",
    "The Republican National Committee, for example, published an odd tweet in February that read, “Illicit drugs are flowing into the country at an alarming rate because of Biden’s open border.",
    "For example, quite a few Republicans have complained in recent months about U.S. border officials stopping illegal drugs before they enter the country.",
    "On the other hand, the RNC also pointed to illegal drugs stopped at the southern border thanks to the Biden administration’s border-security measures.",
    "On the contrary, they often seek out U.S. border officials in order to seek asylum — a process that only begins when someone reaches American soil.",
    "GOP officials effectively, if not literally, accuse the Biden administration every day of not doing enough along the U.S./Mexico border.",
    "An administration can embrace an open border, or it can stop those trying to enter the country.",
    "But if an administration is doing the latter, it obviously isn’t also doing the former.",
    "That’s more than the population of the United States and Mexico combined — times two.",
    "Debates over immigration policy are often complex, but this couldn’t be simpler.",
    "Republican complaints about border security are about as common as the sunrise.",
    "But the unfortunate arithmetical error was really just the tip of the iceberg.",
    "Lesko effectively debunked her own partisan talking point in her own tweet.",
    "In fact, they apparently hope the disconnect goes unnoticed.",
    "But occasionally, these complaints get a little weird.",
    "How do Republicans reconcile the contradiction?",
    "But both claims cannot be true.",
    "They don’t."
  ]
}