{
  "id": 5867,
  "mediaId": 2550,
  "date": "2022-04-20",
  "headline": "There are lies about migrants and the border, and then there's Arizona Rep. Debbie Lesko",
  "image": "https://images.dailykos.com/images/1061296/story_image/GettyImages-1227736497.jpg?1650479932",
  "link": "https://www.dailykos.com/stories/2022/4/20/2093040/-In-now-deleted-tweet-Arizona-lawmaker-boldly-lies-about-one-billion-migrants-at-border?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5868,
    4066,
    4370,
    5732,
    3083,
    1397,
    1359,
    1477,
    5949
  ],
  "sentences": [
    "Daily Kos' The Brief\nFollowShare\n0:001:02:00\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\n”Before the pandemic began, just 7% of people arrested at the border had crossed the border more than once, but by October 2020, 40% of all people arrested had crossed the border multiple times that year,” American Immigration Council said last October.",
    "But this too needs more explanation: Immigration policy experts have long stressed the Stephen Miller’s anti-asylum Title 42 policy “has had the counterproductive effect of significantly increasing the number of arrests at the border.” This is because desperate people unjustly blocked from their asylum rights will again try to seek safety.",
    "“Throughout Fiscal Year 2021, 1 in 3 people apprehended at the border had already crossed the border at least once that year.”\n”Last month, the Border Patrol recorded 209,906 apprehensions, the third-highest since 2000 (we don't have monthly records from before then),” Senior Policy Counsel Aaron Reichlin-Melnick tweeted on Tuesday.",
    "“Within days of the release, Republicans began to echo the same language in their messages on social media,” The American Independent’s Oliver Willis reported last year, with Republican legislators including House Minority Leader Kevin McCarthy mimicking FAIR’s “border crisis” term nearly 40 times altogether through March 2021.",
    "But instead, some squeamish Democrats have actually joined forces with Republicans to defend this white supremacist order when all that’s being asked for is a return to the same exact asylum system we had in place on March 19, 2020, the day before Miller used the novel coronavirus pandemic as his excuse to invoke the policy.",
    "No wonder she eventually deleted the message.”\nRELATED STORY: If it seems like Republicans sound like hate group, it's because they are sounding like hate group\nIn her now-deleted tweet, Lesko pointed to a report from The Wall Street Journal that claimed more than 1 million—not billion—arrests by U.S. border officials.",
    "RELATED STORIES: Border state advocates say they're ready to welcome asylum-seekers following Title 42 announcement\nGOP officials use white supremacist rhetoric in pushing Arizona governor to attack asylum-seekers\nGOP teeing up racist ads going into midterms.",
    "But back to Lesko: She’s usually much better at parroting anti-immigrant talking points, like when congressional Republicans echoed the rhetoric of anti-immigrant hate group Federation for American Immigration Reform (FAIR).",
    "“I estimate that 61,000 of them—41%—were repeat apprehensions of someone on their 2nd, 3rd, or higher attempt to cross the border.”\nIt would seem that one way to respond to this would be to end this disastrous policy.",
    "Listen to Jennifer Fernandez Ancona from Way to Win explain how Democrats must message to win on Daily Kos' The Brief podcast with Markos Moulitsas and Kerry Eleveld\nx\nx\nYou need to enable JavaScript to run this app.",
    "The Tanton network group issued a press release just one day after President Biden’s inauguration that accused him of \"inducing an immigration and border crisis.” Just one day after getting sworn in!",
    "The Arizona representative lied in a now-deleted tweet on Tuesday that \"more than 1,000,000,000 migrants\"—that’s billion with a b!—were apprehended by U.S. border officials in a span of six months.",
    "Blackburn has used “invasion” terminology to describe immigration at the southern border in Facebook ads several times in 2018, Media Matters reported in 2019.",
    "There are right-wing politicians using extremist talking points to attack Democrats on immigration and the southern border, and then there’s Debbie Lesko.",
    "Listed alongside Lesko were a number of other notorious anti-immigrant loudmouths, including Arkansas Sen. Tom Cotton and Tennessee Sen. Marsha Blackburn.",
    "That’s a lot of people—about one in seven of all living human beings, to be more specific, noted The Washington Post’s Philip Bump.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "In Lesko’s state, GOP officials have used the term in asking the state’s governor to invoke war powers against asylum-seekers.",
    "“If you have a spare bedroom, you probably would have had a knock at the door from someone from Customs and Border Protection.",
    "This is the same wording used by the white supremacist terrorist who went to El Paso that year to shoot and kill Mexicans.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Meanwhile, Lesko and Cotton opposed a bipartisan probe of the Jan. 6 insurrection, while Blackburn didn’t vote at all.",
    "Democrats can fight back by championing immigrants\nThis is a short blurb about Daily Kos.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "But they continue to push the lie that we should be afraid of asylum-seekers.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Let’s also remember how McCarthy tried to sabotage the whole thing.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n61.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "That Biden sure gets shit done.",
    "Democrats and “messaging.\"",
    "Arizona Rep. Debbie Lesko.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Donate $5 monthly",
    "Can it be solved?",
    "Please read it.",
    "Sigh."
  ]
}