{
  "id": 7888,
  "mediaId": 6511,
  "date": "2022-04-05",
  "headline": "Republicanos de la Cámara dicen que 18,000 migrantes cruzarán la frontera cuando expire Título 42",
  "image": "https://laopinion.com/wp-content/uploads/sites/3/2022/04/18000-migrantes-cruzaran-frontera-titulo-42.jpg?quality=80&strip=all&w=1200",
  "link": "https://laopinion.com/2022/04/05/republicanos-de-la-camara-dicen-que-18000-migrantes-cruzaran-la-frontera-cuando-expire-titulo-42/",
  "mediaOutlet": "LA OPINIÓN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2765,
    6678
  ],
  "sentences": [
    "Los grupos legales y de defensa de los derechos humanos, entre ellos Shaw Drake, abogada del personal y asesora de políticas para los derechos de la frontera y los inmigrantes en la Unión Americana de Libertades Civiles de Texas, acogieron con satisfacción el anuncio del gobierno de Biden, y recalcaron que habían tardado demasiado y que apuntaban injustamente a los inmigrantes negros y de color.",
    "Te puede interesar:\n*Zelensky advierte que las atrocidades podrían ser peores en Borodyanka de lo que fueron en Bucha\n*Volodimir Zelensky: “Si nos unimos a la OTAN hacemos que sea mucho más fuerte, no somos un estado débil”\n*Propietaria de pizzería en Pensilvania mató a su pareja y escondió el cuerpo en su casa por 13 días",
    "Foto: Patrick T. Fallon/AFP / Getty Images\nRepresentantes republicanos de la Cámara de los Estados Unidos han aumentado la presión al gobierno de Joe Biden de no eliminar el Título 42, ahora que se aproxima su fecha de expiración (23 mayo) porque esto empeorará la situación que se vive en la frontera sur del país.",
    "Agentes de la patrulla fronteriza alertaron que el flujo de migrantes no tendrá control cuando se expire, y que fue establecido en el gobierno de Donald Trump en el 2020, durante la pandemia y que prohibía la entrada a ciertas personas que representaban un riesgo para la salud.",
    "“Una vez que la Orden del Título 42 ya no esté en vigor, el DHS procesará a las personas que se encuentren en la frontera de acuerdo con el Título 8, que es el procedimiento estándar que utilizamos para poner a las personas en proceso de expulsión“, dijo Mayorkas.",
    "Por su parte, Debbie Lesko, representante de Arizona acusó a la administración de Joe Biden, de eliminarlo y declaró que: “Querer una frontera totalmente para cualquiera y para todos, de cualquier país, en todo el mundo: terroristas, violadores, criminales”.",
    "En un comunicado, el secretario del Departamento de Seguridad Nacional (DHS siglas en inglés), Alejandro Mayorkas, dijo que las expulsiones de migrantes adultos solos y de familias, continuarán hasta finales del próximo mes.",
    "“Las expulsiones bajo el Título 42 nunca se basaron en la salud pública, eran simplemente una excusa para negar a los que se enfrentan al peligro el acceso a la protección en este país”, detalló la abogada Drake.",
    "Desde que comenzó a funcionar el Título 42, según datos proporcionados por CNN se han devuelto de regreso a México, para que vuelvan a sus respectivos países alrededor de 1,7 millones de migrantes.",
    "El representante de Nueva York, John Katko, reveló que actualmente cruzan 8,000 migrantes ilegales desde la frontera sur, 3,000 arriba del promedio que tenía contabilizado en tiempos pasados.",
    "“Tenemos una muy buena oportunidad debido a lo que está pasando con las políticas de este presidente de tener una nación desestabilizada en nuestra frontera.",
    "Este es un problema de seguridad nacional que empeorará a medida que pase el tiempo este verano”, explicó Katko durante la reunión en la Cámara.",
    "Cuando expire el Título 42 el próximo 23 de mayo de este año, esa cifra aumentará a 18,000 migrantes que entren todos los días a EE.UU."
  ]
}