{
  "id": 101,
  "mediaId": 2641,
  "date": "2022-04-12",
  "headline": "In a Field of Buckeye State Pretenders, Timken Is the Real Deal",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=ade1ffba-83b4-4abd-b1d5-82d03f6008fd&SiteName=Newsmax",
  "link": "https://www.newsmax.com/bernardkerik/kasich-mandel-vance/2022/04/12/id/1065383/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bernard Kerik",
  "authorUrl": "https://www.newsmax.com/insiders/bernardkerik/id-270",
  "termIds": [
    1804,
    2201,
    2422,
    3555,
    4094,
    4526,
    764,
    5212
  ],
  "sentences": [
    "Mike Gibbons, the candidate spending $11 million of his own money to try and buy Ohio’s Senate seat after he lost the Senate primary in 2018, is attempting to portray himself in President Trump’s businessman-mold, yet lacks all of the charisma and agility of what MAGA is all about, and demands.",
    "Now some say he should be forgiven for having a change of heart, but I believe the MAGA movement needs someone who recognized early on that workers were being forgotten, Ohioans were being left behind, and America was being cheated by China — not a convert who jumped on the bandwagon.",
    "His anti-Life, anti-2nd Amendment policies belong on the Democratic Party ballot, not on the GOPs, and President Trump has already blasted him for bowing to the woke mob and changing his family’s baseball team, the Cleveland Indians, to the Cleveland Guardians.",
    "A closer look into the caricature that is Josh Mandel, the already twice-failed Senate contender, shows that Mandel was Marco Rubio’s top guy in Ohio and wouldn’t even say President Trump’s name during the RNC Convention in Cleveland.",
    "While other candidates in this race, especially Josh Mandel, love to talk about the 2020 election because they know it’s what President Trump wants to hear, my question to them is: where were they when it mattered?",
    "In 2020, when other states didn’t do the necessary work to make sure elections were safe and secure, Jane Timken did, and Ohio delivered by more than 8.5 points for President Trump — an increased margin from 2016.",
    "As the lead investigator for President Trump’s legal team, led by Rudy Giuliani into the 2020 election, I know that Jane Timken put in the work to make sure Ohio’s election was secure and that Ohio delivered.",
    "Back in 2016, then-governor of Ohio and failed presidential contender John Kasich had his thumb on the Ohio Republican Party scales, and his cronies wouldn’t work for the nominee, Donald J. Trump.",
    "President Trump rightfully recognized that Ohio needed a change of leadership, so he hand-picked Jane Timken, a staunch conservative and strong leader, to take on and oust the Kasich regime.",
    "Yet, when it suited him in his Senate bid in 2018, the past establishment toting Kasich-Romney-Rubio career politician became full-throated MAGA to try and bait and switch the Ohio people.",
    "She worked with the Trump campaign to have an election integrity war room, and even caught a Democrat operative trying to push ballot harvesting and referred them to the attorney general.",
    "Jane Timken is the only true MAGA conservative in Ohio who has been there for President Trump and the America First movement since 2016 and all the way through, to the present day.",
    "She then unified the Ohio Republican Party to become one of the strongest in the nation and helped turn Ohio into the pro-Trump, MAGA stronghold it is today.",
    "Bernard B. Kerik was the 40th Police Commissioner of the New York City Police Department and is a New York Times bestselling author.",
    "In the Ohio Senate primary, there’s a clash of self-proclaimed MAGA candidates all clamoring for the Trump, America First mantle.",
    "When Democrats gained seats in most states in 2018, Ohio held the line and actually increased its conservative majorities.",
    "Just this week, new evidence showed that Gibbons said the middle class \"doesn’t pay any kind of a fair share\" in taxes.",
    "Yet when he quit the Senate race in 2018, he was nowhere to be found for President Trump when it really mattered.",
    "She will win against Democrats in November and she will be a fantastic next America First, United States senator.",
    "Jane Timken has shown the dedication, consistency, and fighter spirit that the MAGA movement is about.",
    "When the legal team was looking for assistance in Ohio and Mandel was called, he ignored us.",
    "However, it only takes a closer look to see who are pretenders, and who's the real deal.",
    "Not when President Trump was passing historic trade deals for Ohio workers.",
    "Not during either of President Trump’s baseless impeachment witch-hunts.",
    "Last you have Matt Dolan, who really doesn’t even deserve a closer look.",
    "He has called the MAGA movement \"racist,\" \"uneducated,\" and \"Godless.\"",
    "Mandel refused to return the call, but Jane Timken lead the effort.",
    "He even voted for Evan McMullin over President Trump in 2016.",
    "Not when Ohio needed surrogates on the campaign trail.",
    "Mandel was anti-Trump then, and is faking it today.",
    "Vance’s anti-Trump history is well-documented.",
    "He has said President Trump is an \"idiot.\"",
    "Read Bernard Kerik's Reports — More Here.",
    "Raising taxes is the antithesis of MAGA.",
    "Not in 2018, not in 2019, not in 2020.",
    "Posts by Bernard Kerik\nSpecial Links:",
    "Dolan is obsolete and has no chance.",
    "In Ohio, the choice is clear.",
    "I know because I was there.",
    "Jane Timken did just that.",
    "Not anywhere.",
    "J.D."
  ]
}