{
  "id": 298,
  "mediaId": 2919,
  "date": "2022-04-15",
  "headline": "Trump backs GOP’s JD Vance in US Senate primary in Ohio",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/4c9861d/2147483647/strip/true/crop/4852x2547+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2Fbe%2F8d%2F249c7a9544709c18e6eb94ece197%2Fap22105609649616.jpg",
  "link": "https://www.news5cleveland.com/news/state/trump-backs-gops-jd-vance-in-us-senate-primary-in-ohio",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.news5cleveland.com/associated-press",
  "termIds": [
    1804,
    2201,
    3466,
    3920,
    4077,
    878,
    1171,
    4916,
    5212
  ],
  "sentences": [
    "Vance has been locked in a heated race against former state treasurer Josh Mandel, investment banker Mike Gibbons, former Ohio Republican Party chair Jane Timken, and state Sen. Matt Dolan, whose family owns the Cleveland Guardians.",
    "Download the News 5 Cleveland app now for more stories from us, plus alerts on major news, the latest weather forecast, traffic information and much more.",
    "COLUMBUS, Ohio (AP) — \"Hillbilly Elegy” author JD Vance has received Donald Trump’s coveted endorsement in the race for Ohio’s open U.S. Senate seat.",
    "The candidates and their affiliated super PACs have spent millions trying to paint one another as insufficiently loyal to the former president.",
    "You can also catch News 5 Cleveland on Roku, Apple TV, Amazon Fire TV, YouTube TV, DIRECTV NOW, Hulu Live and more.",
    "The decision ends months of jockeying in a Republican Senate primary where his backing could be pivotal.",
    "Dolan is the only major candidate who has not aggressively courted Trump’s endorsement.",
    "This material may not be published, broadcast, rewritten or redistributed.)",
    "Download now on your Apple device here, and your Android device here.",
    "Learn more about our streaming options here.",
    "(Copyright 2022 The Associated Press.",
    "We're also on Amazon Alexa devices.",
    "All rights reserved."
  ]
}