{
  "id": 3046,
  "mediaId": 2550,
  "date": "2022-03-14",
  "headline": "Morning Digest: Renegade Washington Democrat who bolstered GOP for years finally calls it quits",
  "image": "https://images.dailykos.com/images/1048271/story_image/AP17182165979509.jpg?1647211993",
  "link": "https://www.dailykos.com/stories/2022/3/14/2085722/-Morning-Digest-Renegade-Washington-Democrat-who-bolstered-GOP-for-years-finally-calls-it-quits?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1480,
    1545,
    1730,
    2547,
    2573,
    2739,
    3431,
    4144,
    305,
    878
  ],
  "sentences": [
    "IL-03: The first poll of the June Democratic primary in Illinois' redrawn—and open—3rd Congressional District comes from Lake Research Partners on behalf of state Rep. Delia Ramirez's allies at the Working Families Party, and it shows her leading Chicago Alderman Gilbert Villegas 19-11 with most respondents undecided; a mere 1% goes to Iymen Chehade, a history professor at the center of an ethics probe involving Rep. Marie Newman (who is seeking re-election in the 6th District).",
    "Carnahan resigned in disgrace last August after Tony Lazzaro, a close friend and party donor, was arrested on sex-trafficking charges, but she already had her share of enemies within the party: The Associated Press wrote last year that Carnahan was \"also accused of creating a toxic workplace environment in which personal and professional lines were blurred, concerns about sexual harassment ignored, and employees who didn't fall in line were subjected to retaliation.\"",
    "In his capacity as a county commissioner, Sheldon made news in 2009 when he argued that his well-armed constituents could make up for law enforcement budget cuts on their own and, in a statement purporting to be directed at local criminals, declared, \"You're on notice: if you attempt a home-invasion robbery, you may be met with armed resistance and could receive a Mason County hot lead enema.\"",
    "Faulconer for years was one of the only Republican rising stars in dark blue California, but last September's recall campaign saw him plummet hard to earth: Faulconer took a distant third place with just 8% in the race to replace Newsom, a question that didn't even end up mattering because a 62-38 majority voted against ousting the governor.",
    "It was one month after that vote, though, that Sheldon truly made himself a pariah within the Democratic Party when he and two other members, Rodney Tom and Jim Kastama, joined with the 23 Republicans to pass a budget during a special session, a move that effectively handed control of the chamber to the GOP minority.",
    "Pat McCrory 31-25 in the May Republican primary, with former Rep. Mark Walker grabbing 16%; the memo says that an unreleased June poll gave McCrory a 45-19 edge and argues that the congressman \"has a lot of room to grow thanks to President Donald Trump's endorsement.\"",
    "OH-Sen: Rich guy Mike Gibbons' newest ad attacks former state Treasurer Josh Mandel as a phony conservative, arguing he \"supported Al Gore, flip-flopped on abortion, gave tax breaks to Hollywood leftists, and used $2 million of your tax dollars to promote himself.\"",
    "Sheldon was elected to the state House back in 1990 from a seat that contained his home of Mason County, a rural area in the western part of the state, and he won a promotion in a 1997 special election after he decisively unseated an appointed Democratic senator.",
    "Democrats won a small measure of vengeance a few months later when they joined forces with Republican Pam Roach, a hardline conservative who was on the outs with her own party, and another GOP member to install Roach as president pro tem in place of Sheldon.",
    "CA-09: While astronaut Jose Hernandez, who was the Democratic candidate in a competitive 2012 race for the old 10th District, had filed paperwork last month for a potential intra-party bid against Rep. Josh Harder, he announced Friday that he wouldn't run.",
    "That first charge is accompanied by 2000 footage of Mandel, who was student body president at OSU at the time, alongside Gore during the vice president's visit to campus, video that became public in 2011 during Mandel's first failed bid for the Senate.",
    "It's possible that Sheldon's now-open seat, which would have supported Trump by a narrow 49-48 margin in 2020, could replace him with an actual Democrat, though given the way the midterms are shaping up, his successor is more likely to be a Republican.",
    "Throughout his career (which included concurrent service on the Mason County Board of County Commissioners from 2005 to 2017), he was one of the more conservative members of the Democratic caucus and even reportedly cast a ballot for George W. Bush.",
    "Those numbers, though, may have been overshadowed by the over-the-top Budd press release accompanying them, which included the line, \"Politico [sniffs disdainfully and orders another cocktail at the country club]: That can't be right.",
    "Republicans picked up Kastama's seat that fall after he embarked on a failed bid for secretary of state, but while Democrats maintained a 26-23 majority on paper, Sheldon and Tom made good on threats to permanently bolt the caucus.",
    "Pierson was elected to the legislature in 2014 and held on only 51-49 in 2020 even though Donald Trump was taking his constituency by a stronger 52-47, while Benda lost a tight race for the lower chamber all the way back in 2006.",
    "The Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "The duo, who would not be up for re-election for another two years, joined with Republicans to form an alliance called the Majority Coalition Caucus, which was essentially the West Coast version of New York's notorious IDC.",
    "If anything, headlining a fundraising event is a much bigger deal than simply slapping your name on a press release announcing you're endorsing someone: One generates actual dollars, the other generates … a press release.",
    "Their new commercial declares that one of Vladimir Putin's \"old oligarchs partnered with Jane Timken's family business to build high-capacity freight rail cars, supplying Putin's government with military-grade machinery.\"",
    "Dan McKee on Thursday picked up endorsements from two notable labor groups, the Rhode Island Building and Construction Trades Council and the Rhode Island Laborers' District Council, for the September Democratic primary.",
    "MN-01: State Rep. Nels Pierson and former Freeborn County GOP chair Matt Benda have each announced that they're joining the May special election primary to succeed the late Rep. Jim Hagedorn, a fellow Republican.",
    "WA State Senate: Tim Sheldon, a nominal Democrat who spent much of the last decade keeping the Republican minority in charge of the Washington state Senate, announced Thursday that he would retire this year.",
    "Team Blue netted four more seats the following year, and while Sheldon defeated an actual Democrat 52-48 in a seat that Donald Trump had won 47-44 in 2016, his presence no longer mattered much.",
    "The senator, who is the longest-serving member of the legislature, continued to caucus with the GOP even though his influence plummeted after Team Blue won a Sheldon-proof majority in 2017.",
    "However, Democrats only netted one seat in 2016, which allowed Sheldon to resume his role as the decisive vote to keep the GOP in charge—and put him back in the president pro tem's chair.",
    "Mandel did not actually endorse Gore, and Michael Kruse recently wrote in a long profile in Politico that \"Mandel celebrated, too, a visit to campus by Republican candidate John McCain.\"",
    "NE-Gov: University of Nebraska Regent Jim Pillen's new commercial for the May GOP primary stars Larry the Cable Guy, who at one point shouts out, \"Vote for Jimmy or you're a communist!\"",
    "MI-03: EMILY's List has endorsed 2020 Democratic nominee Hillary Scholten, who faces no serious intra-party opposition as she seeks a rematch against Republican incumbent Peter Meijer.",
    "Meanwhile, multiple Republicans tell Politico that they expect Hagedorn's widow, former state party chair Jennifer Carnahan, to enter the contest ahead of the March 15 filing deadline.",
    "That November, Democrat Manka Dhingra decisively won a special election to replace a deceased Republican senator, which gave her party the true majority it had coveted for five years.",
    "MO-Sen: When LL Cool J demanded, \"Don't call it a comeback,\" he gave us good reason to believe him with the explosive success of his fourth studio album, \"Mama Said Knock You Out.\"",
    "Parson hadn't previously weighed in on the contest, which includes a large cast of ambitious hopefuls and even one nightmare candidate that national Republicans are eager to block.",
    "Three years later, Sheldon was one of just three Democrats in the chamber to vote against legalizing same-sex marriage, a bill that passed with support from four Republicans.",
    "Mainstream Senate Democrats are going into the 2022 elections with 28 seats, so they could lose up to three members and still keep their hard-won control of the chamber.",
    "Kansas is one of 10 states that has not yet completed legislative redistricting this cycle, while five states have yet to adopt final congressional maps.",
    "Mandel's allies at the Club for Growth, meanwhile, are focusing once again on a different intra-party opponent, former state party chair Jane Timken.",
    "We have been ASSURED by some of the premier Establishmentarians in Washington that President Trump has zero juice in primaries anymore.\"",
    "Take Republican Dave Schatz, the president pro tem of the Missouri State Senate who's running to replace retiring U.S. Sen Roy Blunt.",
    "Washington state Sen. Tim Sheldon, a nominal Democrat who has sided with the Republican caucus for many years, is retiring this year.",
    "(By the way, that makes this the second Putin-related ad we’ve seen so far in a GOP Senate primary, following one in North Carolina.)",
    "Tom retired in 2014 and was replaced by an actual Democrat, but the GOP wave destroyed Team Blue's dreams of a functioning majority.",
    "Instead, Republicans emerged with an outright 1-seat edge, with the renegade Sheldon providing extra insurance as their 26th vote.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "The arrangement left Sheldon as the Senate’s ceremonial president pro tem, while Tom served as the powerful majority leader.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "In addition, in a recording of a phone call released last year, Carnahan was heard saying of her husband, \"I don't care.",
    "The trio, wrote NPR, soon returned to the caucus room like nothing had happened, but mainstream Democrats were furious.",
    "Schatz also said of Parson, \"I think anybody who would ask him to help in that way, I think he's not opposed to that.\"",
    "But if you're actually helping one of the contenders to raise money, that means you want them to win the race, right?",
    "Democrats currently hold 28 of the 49 seats in the chamber, with Sheldon and the GOP controlling the remaining 21.",
    "But unless and until that happens, Schatz is just playing a silly game—perhaps even one Parson insisted he play.",
    "CA-Gov: Former San Diego Mayor Kevin Faulconer said Thursday evening that he wouldn't challenge Democratic Gov.",
    "KS Redistricting: Kansas' Republican-run state Senate has introduced a new map for the chamber's own districts.",
    "NC-Sen: Rep. Ted Budd has dropped a Meeting Street Research internal that shows him trailing former Gov.",
    "But when a politician tells you, \"Don't call it an endorsement,\" it's probably just a load of malarkey.",
    "One colleague was particularly pissed, saying, \"There are three Democrats who are holding us hostage.",
    "(He said Wednesday of that decision, \"I've tried to make up for it in my voting the last few years.",
    "The survey argues that Ramirez will increase her lead once voters learn more about each candidate.",
    "Look, if Parson does wind up helping other candidates raise money, then we'll concede the point.",
    "She later said she'd uttered those words \"in grief\" after drinking following a long day.",
    "The narrator continues, \"Timken's family gets rich, Timken money funds her campaign.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Well, not according to Schatz, who insists, \"I wouldn't say it's an endorsement.\"",
    "It's not as though the concept of an \"endorsement\" has any legal significance.",
    "Gavin Newsom, an announcement that came just a day before the filing deadline.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "(His old ally Tom also attempted a comeback but lost in a landslide.)",
    "… I think I've been educated a lot by my daughter and my wife.\")",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Later this month, Schatz is hosting a fundraiser where Gov.",
    "Of course, that may be a far worse offense in today's GOP.",
    "The hostage situation was about to get a whole lot worse.",
    "And she has the gall to run for United State Senate.\"",
    "Mike Parson will be featured as a \"special guest.\"",
    "Jim, he's going to die of cancer in two years.\"",
    "And they have held us hostage the whole time.\"",
    "But things changed completely in 2017.",
    "Check out our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "Perhaps he wouldn't—but we would!",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Yeah, we don't think so.",
    "Daily Kos is different.",
    "Even Eric Greitens?",
    "x\nx\nLeading Off\n?",
    "That's the joke.",
    "Please read it.",
    "Redistricting\n?",
    "RI-Gov: Gov.",
    "Governors\n?",
    "Senate\n?",
    "Anybody?",
    "Really?",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}