{
  "id": 4708,
  "mediaId": 2547,
  "date": "2022-02-14",
  "headline": "GOP Candidates Vilify Fauci To Rile Their Base",
  "image": "https://crooksandliars.com/files/primary_image/22/02/screen_shot_2022-02-13_at_3.05.15_pm.png",
  "link": "https://crooksandliars.com/2022/02/dr-fauci-republican-base",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kerry Eleveld",
  "authorUrl": "https://crooksandliars.com/team/kerry-eleveld",
  "termIds": [
    2232,
    2576,
    2599,
    2908,
    3975,
    4526,
    878,
    1105,
    1171,
    5212
  ],
  "sentences": [
    "In a Republican Party dependent on ginning up its base's rage, the villain of choice has become President Joe Biden’s top medical adviser on the pandemic, Dr. Anthony Fauci, who now often supplants GOP archenemy and Democratic Speaker of the House Nancy Pelosi.",
    "Fauci, he added, “is an establishment expert intellectual who is in the media.”\nBut while demonizing Fauci could whip up the GOP base, the strategy could just as easily haunt Republicans in the general election, as Ayres noted.",
    "And Wisconsin Democrat-turned-Republican Kevin Nicholson, who's running for governor, said Fauci \"should be fired and referred to prosecutors.”\nIn Fauci, many Republicans see an amalgam of favorite conservative resentments.",
    "However, another GOP strategist, John Feehery, argued that anger at Fauci over lockdowns was an issue that could cross party lines with voters desperate to move on from the pandemic.",
    "The strong and steady U.S. recovery is starting to suggest that the nation's economy has moved beyond the reaches of the highly unpredictable pandemic.",
    "Democratic governors in Connecticut, New Jersey, and Delaware have all laid out timelines for ending statewide mask mandates in schools and elsewhere.",
    "Wackadoodle celebrity doc Mehmet Oz, who's running for Pennsylvania's open Senate seat, doesn't want to debate his opponents—he wants to debate Fauci.",
    "As the New York Times reports, \"Fire Fauci\" became the inaugural ad for Jane Timken last fall as she launched her bid to win Ohio's open Senate seat.",
    "“Populism is essentially anti: anti-establishment, anti-expertise, anti-intellectual and anti-media,” GOP strategist Whit Ayres told the Times.",
    "So while Republicans fixate on Fauci and the pandemic, Democrats are working to move the nation beyond its clutches.",
    "But it wouldn't be the first time Republicans fixated on a base strategy that saddles them in the general election.",
    "Some Democratic officials are also ending pandemic restrictions that had been in place for months on end.",
    "One big question is whether the pandemic will still have the resonance it does today."
  ]
}