{
  "id": 4746,
  "mediaId": 2745,
  "date": "2022-02-22",
  "headline": "Opinion: J.D. Vance’s repulsive spin about Putin and Ukraine faces a new test",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KXBZG2Q7VEI6PLLUHJ2CU3UTU4&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/02/22/ukraine-jd-vance-ohio-senate-timken/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1418,
    1804,
    2201,
    3434,
    3466,
    3709,
    3948,
    4526,
    5287,
    5366
  ],
  "sentences": [
    "Vance has taken a ton of heat recently for claiming, “I don’t really care what happens to Ukraine one way or the other.” In that appearance, Vance added that “Mexican fentanyl” is a much bigger problem, describing the southern border as a “total war zone.”\nWhat's happening in Ukraine has nothing to do with our national security, but it is distracting our idiot \"leaders\" from focusing on the things that actually do matter to our national security, like securing the border & stopping the flow of Fentanyl that's killing American kids.",
    "Because she’s running in a GOP primary, she’s required to blame Russian aggression on President Biden’s supposed weakness, juxtaposed against Trump’s alleged “strength.”\nBut Timken does say the United States has an important interest in seeing Ukrainian sovereignty protected against Russian aggression, and that the United States should respond forcefully with sanctions and other measures, albeit without sending in troops.",
    "In so doing, the “Hillbilly Elegy” author is testing the potency of a larger argument — that we should dramatically retreat from international commitments and obligations, and essentially shrug about democratic allies abroad — as a central tenet of the populist nationalism that Vance and others hope to make viable in the post-Donald Trump era.",
    "But the deeper point of Vance’s formulation connecting the U.S. and Ukrainian borders is this: In that version of populist nationalism, the United States should dramatically retreat on any and all international obligations, both in maintaining the liberal international order and in letting in legal immigrants, asylum seekers and refugees.",
    "It’s also Putinism.”\nIdeally, Rothkopf notes, the liberal international order allows the “free flow of people” and democratic “self-determination,” both of which are dictated by international human rights obligations that Western nations collectively will — at least to the best of their ability — continue maintaining.",
    "As Russia moved closer to an invasion, Jane Timken, the former state GOP chair, put out a statement late Monday sharply condemning Russian leader Vladimir Putin’s moves, casting them as a threat to U.S. national security and calling for a tough U.S. response to them.",
    "Yet Vance’s ugly suggestion is that immigration to the United States and this Russian invasion are somehow vaguely comparable threats to national sovereignty, and that only the former one should occupy our attention.",
    "Russia has just declared that two separatist regions in Ukraine are independent and sent in troops to them, a move that the United Nations has condemned as a violation of international law and Ukrainian sovereignty.",
    "There’s a reason Vance and others keep linking our border to that of Ukraine: Drawing this connection treats immigration to the United States as a species of invasion on a par with what Russia is threatening.",
    "“Timken’s position represents a clear embrace of the McConnell lane and will put to the test the laziness of the Vance/Mandel position with GOP primary voters,” Democratic strategist Justin Barasky told me.",
    "Vance’s favorite lines about Russian troops massing around Ukraine is this formulation, which he evidently thinks is dazzlingly clever: We should care far more about our own border than that of Ukraine!",
    "“And it’s not the world in which Putin’s acolytes and followers in the United States want to live.”\nThat’s certainly not the world in which Vance wants to live, and he wants to be a U.S. senator.",
    "So it’s notable that one of Vance’s rivals in the Ohio Senate primary is now challenging this idea by suggesting that what happens to Ukraine should actually matter to Republican voters.",
    "He and the leading candidate in the primary, former state treasurer Josh Mandel, have both offered vacuous misdirection about our border being more important than Ukraine’s.",
    "David Rothkopf, a foreign policy expert, author and commentator, notes that both represent similar retreats on the very idea of having an international order at all.",
    "But it’s hardly a severe blow to our national sovereignty, and at any rate, it’s better than Trump’s alternative, which produced a humanitarian catastrophe.",
    "Democrats think this means she might be the choice of Senate Minority Leader Mitch McConnell’s (R-Ky.) wing of the party against Vance and the Trump wing.",
    "We’re now letting in migrant kids whereas Trump tried to keep them out, and Biden is trying to end Trump’s “Remain in Mexico” policy.",
    "This challenge could help shed light on how seriously GOP voters are taking Vance’s form of right-wing nationalism these days.",
    "Vance (@JDVance1) February 22, 2022\nBuried underneath this smarmy formulation is a real argument, and it’s a repulsive one.",
    "Of course, what Vance really objects to is that Biden has undone a few of Trump’s immigration policies.",
    "“A central tenet of Trumpism was to seek the end of the international order,” Rothkopf told me.",
    "Even better, let’s hope Vance’s worldview is rejected by Republican voters — resoundingly.",
    "Rob Portman recently endorsed her, and three other Republican senators just followed suit.",
    "That has created serious logistical challenges with no easy answers, to be sure.",
    "So let’s hope the Ohio primary features a real debate about these matters.",
    "“That’s not the world in which Putin wants to live,” Rothkopf continues.",
    "If she wins, she’d face Rep. Tim Ryan, the expected Democratic nominee.",
    "To be clear, Timken’s position is in many ways silly.",
    "Vance views that catastrophe as successful policy.",
    "Timken is gaining momentum in the primary: Sen.",
    "That position is held by many in both parties.",
    "But Ohio Democrats very much took notice.",
    "These are two sides of the same coin.",
    "It also puts her at odds with Vance.",
    "This attracted no media attention.",
    "https://t.co/a6bAaRxSH7\n— J.D.",
    "“But this isn’t just Trumpism.",
    "Vance says this regularly.",
    "One of J.D."
  ]
}