{
  "id": 4767,
  "mediaId": 2636,
  "date": "2022-02-14",
  "headline": "How One of the Most At-Risk Democrats in Congress Hangs On",
  "image": "https://static01.nyt.com/images/2022/02/14/multimedia/14onpolitics-axne01/14onpolitics-axne01-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/14/us/politics/cindy-axne-iowa-democrat.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "It’s just hard for them to see some of the benefits that Democrats have delivered — because honestly, Democrats have delivered, I’ve delivered — but it’s hard to see when things still aren’t back to normal.”\nIf and when they are, Axne said, “We’ve got to be really loud about it and make people feel comfortable and understand: ‘Go back to normal, folks.’”\nAxne has had to think a lot about how to explain the major legislative packages she has helped to pass and urges the White House to break them down into relatable pieces.",
    "McCarthy and Pompeo to court megadonors\nAs Republicans gear up for midterm elections that they hope will give them control of both chambers of Congress, Representative Kevin McCarthy of California, the man who hopes to become their House speaker, is set to speak in Palm Beach, Fla. this week to some of the megadonors expected to finance the party’s efforts this fall and in 2024.",
    "The Palm Beach gathering is expected to draw candidates vying for Republican congressional nominations, including Herschel Walker (who is running for Senate in Georgia), Katie Britt (Senate in Alabama), Jane Timken (Senate in Ohio) and Morgan Ortagus (House in Tennessee).",
    "I don’t wear five-inch heels.”\nAxne would like to see Democrats break the Build Back Better Act, their stalled social policy bill, into “chunks of coordinated policy.” And in the meantime, she wants Biden to get out there and hear from his disaffected customers directly.",
    "Other donors who have been involved in the American Opportunity Alliance include the brokerage titan Charles Schwab, the hedge fund manager Kenneth Griffin and Todd Ricketts, who served as finance chairman for the Republican National Committee under Trump.",
    "The occasion is the semiannual gathering of the American Opportunity Alliance, a coalition of major donors spearheaded by the New York hedge fund billionaire Paul Singer that has worked mostly behind the scenes to shape the Republican Party.",
    "Also expected to speak is Mike Pompeo, who served as secretary of state under President Donald Trump and is said to be considering seeking the Republican presidential nomination in 2024, which could pit him against Trump.",
    "In Opinion, J. Michael Luttig, a retired judge, called on his fellow conservatives to embrace reform of the Electoral Count Act, the 1887 law that governs how Congress counts the votes of the Electoral College.",
    "But that micro level is what’s adding up across the country.”\nWhat to read\nRyan Mac and Lisa Lerer profiled Peter Thiel, the Silicon Valley investor who is seeking to become the right’s would-be kingmaker.",
    "Among the donors expected in Palm Beach are the former Trump cabinet officials Wilbur Ross, who served as commerce secretary, and Linda McMahon, who was administrator of the Small Business Administration.",
    "As she put it, “Come out and say, ‘Folks, here’s where we’re at.’”\n‘Tired’\nAnd where her customers are at right now, Axne said, can be summed up with one word: “Tired.”\nThey’re tired of the pandemic.",
    "She comes back to her infrastructure example, referring to bridges in Iowa that are so poorly maintained that they can’t bear the weight of a bus full of schoolchildren, leading to lengthy detours.",
    "Trump’s longtime accounting firm has cut ties with his family business amid an investigation into the Trump Organization’s financial practices, Ben Protess and William K. Rashbaum report.",
    "The donors in the alliance are likely to be assiduously courted by Republican candidates for a range of offices and to be solicited for donations to super PACs and party committees.",
    "It’s the kind of advice President Biden could use as he tries to reverse drooping poll numbers that threaten to bring down his entire party:\nStruggling to explain your policies?",
    "Ukraine’s president hinted at a major concession on Monday and Russia’s foreign minister said talks would continue, suggesting room for a peaceful resolution of the crisis.",
    "It takes a relentless focus on the folks back home, which is why you won’t see Cindy Axne yukking it up on “Morning Joe” or rubbing elbows with Jake Tapper on CNN.",
    "She urges the president to adopt that same retail mentality: Leave the mess in Washington behind, go into local communities and bring politics to a human scale.",
    "In 2019, when flooding devastated communities in her district along the Missouri River, Axne was everywhere: touring busted levees, lobbying for federal aid.",
    "Level with people: “Even if it’s not the answer everybody wants right now, give them the answer that you know.”\nSelling your infrastructure bill?",
    "Their giving and associations will be closely watched as the party and its donor class grapple with whether — and how — to move on from Trump.",
    "“It’s just that there’s so much happening at this high level that sometimes it’s really hard to just bring it down to that very micro level.",
    "After Iowa’s latest round of nonpartisan redistricting, they’ve become part of the district of Representative Randy Feenstra, a Republican.",
    "She doesn’t have to win them — just keep the margins small enough while pumping up votes in her stronghold of Des Moines, the Iowa capital.",
    "1 targeted race in the nation.” Forecasters rate it a “tossup,” but privately, Democratic strategists acknowledge she might be doomed.",
    "“I’ve run customer service departments and retail.”\nAnd the way she figures it, the burden is on her to earn the customer’s approval.",
    "Heck, yeah.”\nEarning counties, then losing them\nAxne was first elected to Congress in 2018, as part of that year’s anti-Trump wave.",
    "Senator Rick Scott of Florida, who heads the Republican Party’s Senate campaign arm, also spoke to the alliance’s donors last year.",
    "If you ask her what’s on the minds of Iowa farmers, be prepared for an impromptu seminar on the intricacies of soybean processing.",
    "Although Axne doesn’t articulate them explicitly, we culled these unspoken rules from an interview in her office on Capitol Hill.",
    "“I am not Nancy Pelosi,” she joked at a recent town-hall-style meeting in Ottumwa, one of 74 she’s held since her first election.",
    "Singer was among the most aggressive Republican donors in seeking to block Trump from winning the Republican nomination in 2016.",
    "She was a longtime Iowa state government official, an M.B.A. holder who started a consulting firm before running for Congress.",
    "It earned her some credit in the suburban areas around Council Bluffs and Indianola, helping her eke out that win in 2020.",
    "But Singer later donated $1 million to Trump’s inaugural fund and visited the Trump White House on multiple occasions.",
    "Other prospective 2024 Republican candidates attended a meeting of the alliance last year in Colorado, including Gov.",
    "It’s the thread running through all the complaints she hears about, whether the issue is education or jobs or masks.",
    "It takes doing who-knows-how-many hits on rural radio stations that might reach just a few hundred people at a time.",
    "She’s the lone Democrat in Iowa’s delegation to Washington, representing a state that has moved sharply rightward.",
    "Ron DeSantis of Florida, former Vice President Mike Pence and Nikki Haley, the former United Nations ambassador.",
    "But she does have to create some distance from national Democrats, which she tries to accomplish through humor.",
    "Her first task this year was to visit her new counties, which together voted for Trump by nearly 19,000 votes.",
    "“It’s my job to go to them, to show them that they can trust me and that I deserve their vote,” she said.",
    "Visualize the voter you want to reach: “Take these big things and bring it down to that one individual.",
    "That’s huge.”\nYou won’t hear much soaring rhetoric about saving American democracy from Axne, either.",
    "Holding a blue seat in a red-tinged place like Iowa’s Third Congressional District takes discipline.",
    "Thanks to redistricting, she just inherited nine additional counties that voted for Trump in 2020.",
    "In a stroke of bad luck for Axne, those areas along the river are no longer her responsibility.",
    "For more, go here for the latest updates on the diplomatic efforts to avert a Russian invasion.",
    "If that mom’s not sitting in the audience, put that mom in your head.”\nDealing with bad news?",
    "“You know, ask any parent what their mornings are like, and would they like 40 minutes more?",
    "Talk about convenience, not how many program dollars you allocated: “That doesn’t resonate.",
    "In 2020, a bad year for House Democrats, she hung on to her seat by fewer than 7,000 votes.",
    "A conservative website he financed paid for early research into Trump’s ties to Russia.",
    "This year, Axne has one of the hardest re-election tasks of any member of Congress.",
    "It resonates that I gave you 40 minutes of extra time when this bridge is repaired.",
    "“I’ve never seen anything impact our psyche so much like this, right?” she said.",
    "At town hall meetings, she proudly tells constituents that hers is “the No.",
    "Donald Trump carried her district in both of his presidential runs.",
    "The voters are her customers, reflecting her business background.",
    "Tired of the disruptions it has brought to their families.",
    "Tired of their packages not being delivered on time.",
    "“It’s not that he doesn’t understand it,” she said.",
    "“There’s just a lot that families are coping with.",
    "Axne is a living case study in political survival.",
    "“I’ve been a manager my whole life,” she said.",
    "Is there anything you think we’re missing?",
    "Email us at onpolitics@nytimes.com.",
    "Anything you want to see more of?",
    "What’s her strategy for survival?",
    "We’d love to hear from you.",
    "I’m from a different state.",
    "“I’m a foot taller."
  ]
}