{
  "id": 4961,
  "mediaId": 2745,
  "date": "2022-02-16",
  "headline": "Ohio’s Sen. Portman backs former state GOP chair Jane Timken in race to succeed him",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3FU3WSEF6QI6ZFI4DYGMG4R6KM.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/02/16/ohios-sen-portman-backs-former-state-gop-chair-jane-timken-race-succeed-him/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1804,
    2177,
    3466,
    3920,
    4526,
    764,
    878,
    1171,
    5212
  ],
  "sentences": [
    "Rob Portman (R-Ohio) on Wednesday endorsed former Ohio Republican Party chair Jane Timken in the race to succeed him, calling Timken “the best candidate to advance conservative Republican policies to help Ohio workers and families.”\nTimken has touted herself in TV ads as a “Trump conservative” and is one of several Republican candidates who have worked furiously to prove their fealty to the former president.",
    "“I am confident in her ability to win both the primary and the general elections, ensuring that this Senate seat remains Republican with a 50-50 Senate, and so much at stake.”\nTimken said she was honored to have Portman’s support and called him “a thoughtful, conservative leader who has served Ohio with distinction.”\nTrump has not yet endorsed anyone in the race.",
    "In a statement Wednesday, Portman hailed Timken’s “record of success, including working tirelessly for years to support Republicans at every level.”\n“She led the effort as Ohio Republican Party chair to elect Republicans to all statewide constitutional offices in 2018, and to win Ohio by 8 points for President Trump in 2020,” Portman said.",
    "The former president also reportedly held a meeting last March at his private golf club in West Palm Beach, Fla., where the Senate hopefuls jockeyed for his support.",
    "Two other retiring GOP senators — Sen. Roy Blunt of Missouri and Patrick J. Toomey of Pennsylvania — have not made endorsements in the GOP primaries for their seats.",
    "Former White House counselor Kellyanne Conway threw her support behind Timken on Tuesday and is joining her campaign as a senior strategist, The Hill reported.",
    "Others include former state treasurer Josh Mandel, who has called himself “President Trump’s number-one ally in Ohio”; and author and investor J.D.",
    "Portman announced last year that he would not seek a third term in the Senate, citing his frustration with “partisan gridlock” on Capitol Hill.",
    "Shelby is backing Katie Britt, his former chief of staff, even as Trump has endorsed another candidate, Rep. Mo Brooks (R-Ala.), in the race.",
    "In Alabama, another retiring Senate Republican, Sen. Richard C. Shelby, has endorsed a candidate in the race to succeed him.",
    "According to a person familiar with the matter, Trump called Timken last year and told her he would endorse her in the race.",
    "), endorsed Rep. Vicky Hartzler in the Missouri race, prompting anger from another candidate, Rep. Billy Long.",
    "Vance, who previously criticized Trump before pivoting sharply and embracing the former president.",
    "State Sen. Matt Dolan and investment banker Mike Gibbons are also running for the GOP nod.",
    "Blunt’s Senate colleague, Josh Hawley (R-Mo.",
    "Retiring Sen."
  ]
}