{
  "id": 5579,
  "mediaId": 2658,
  "date": "2022-02-04",
  "headline": "Fauci is the villain in new GOP campaign ads",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1155968404/d468a616-e151-4a8b-8e7b-69986802cf7a/7cfda0c2-adbf-463f-ae5c-13c3eb224d9a/1280x720/match/image.jpg",
  "link": "https://www.politico.com/news/2022/02/04/fauci-villain-new-gop-campaign-ads-00005430",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2131,
    2201,
    2403,
    2576,
    677,
    878,
    1171,
    5072,
    5212
  ],
  "sentences": [
    "The commercial shows clips of the doctor contradicting himself, then directs viewers to a link to DeSantis’ campaign website to “pre-order your exclusive freedom over Fauci flip-flops today.”\n“Let’s fire Fauci and take back our freedoms,” Ohio Republican Senate candidate Jane Timken said in an ad titled “Fire Fauci,” which aired last fall.",
    "Yet Fauci’s high-profile role as the face of the federal government’s coronavirus response efforts have made him especially inviting to GOP candidates looking to energize the party’s grassroots — to some elements of the base, Fauci is a pandemic-era bogeyman.",
    "Some Republicans have taken to calling for Fauci’s ouster from the National Institute of Allergy and Infectious Diseases, where he has held the same role since 1984 — through the AIDS crisis and other major events like the Swine flu in 2009 and Ebola in 2014.",
    "Fauci, the director of the National Institute of Allergy and Infectious Diseases, is appearing in spots across the airwaves this week as primary elections take shape and Republicans seek to tap into his unpopularity with the GOP base.",
    "Fauci criticized Trump’s calls to “liberate” states that implemented restrictions in 2020 in a documentary last spring, while Trump has slammed Fauci as “the king of ‘flip-flops’ and [for] moving the goalposts” during the pandemic.",
    "“I know Mike Gibbons will join me in demanding that Fauci is immediately fired and removed from office.”\nIn enlisting Paul to pad his anti-vaccine mandate credentials, Gibbons chose a top Fauci nemesis to make his point.",
    "Now, after the Omicron variant spiraled out of control over the holidays, Republicans point to it as evidence of Biden’s failures in office — despite Trump’s well-documented failures in his own handling of the response.",
    "By Stephanie Murray\n 02/04/2022 04:30 AM EST\nAnthony Fauci has been a GOP target for nearly two years, as the party cast the president’s chief medical adviser as a villain for pandemic-era policies.",
    "It’s hard to know precisely how many are using anti-Fauci messaging since the doctor’s image appears in some ads without his name being explicitly spoken in the ad transcript.",
    "House Minority Leader Kevin McCarthy mentioned Fauci in a fundraising text on Jan. 13, after the Supreme Court blocked Biden’s vaccine or test mandate for large employers.",
    "The Kentucky senator, a physician and a member of the Senate Health, Education, Labor and Pensions Committee, has been publicly at war with Fauci throughout the pandemic.",
    "That’s why I’m endorsing Mike Gibbons for Senate,” Sen. Rand Paul (R-Ky.) says in a new TV ad for Gibbons, who’s running in a crowded Republican Senate primary in Ohio.",
    "For his part, Fauci recently told the Senate health committee that Paul “kindles the crazies” with false allegations, leading to death threats and other harassment.",
    "Trump became at odds with Fauci early in the pandemic, as he pressed to reopen the economy and snubbed precautions like face masks — which Fauci advocated.",
    "Meanwhile, 41 percent of Democrats said Fauci was doing an “excellent” job in his handling of the pandemic — compared to just 6 percent of Republicans.",
    "The ads are part of a collection of anti-Fauci spots appearing across battleground states this week, according to the TV ad tracking service AdImpact.",
    "Paul has sparred with him in hearings over vaccines and masks and even penned a Fox News op-ed titled “The arrogance of Anthony Fauci” last month.",
    "Sixty-two percent of Republicans said Fauci was doing a “poor” job handling the pandemic, according to a new POLITICO/Morning Consult poll.",
    "Fueling the Republican animus is former President Donald Trump’s stance toward Fauci, who was once one of his top coronavirus advisers.",
    "Fauci’s political value as a target has also grown as the GOP has seized on the pandemic to knock President Joe Biden for his policies.",
    "“The big government medical establishment came after me because I dared to challenge Fauci on Covid,” Oz says in the 30-second spot.",
    "The celebrity physician has gone so far as to challenge Fauci to a debate, “doctor to doctor,” according to a campaign spokesperson.",
    "Fauci is a particularly useful foil for GOP candidates in primaries because of Republican hostility toward his performance.",
    "“Biden and Fauci want to mask up our kids forever.”\nNebraska gubernatorial candidate Jim Pillen got in on the action, too.",
    "Political campaigns have aired close to 750 different coronavirus ads since 2020, according to an AdImpact analysis.",
    "In Pennsylvania, Republican Mehmet Oz also attacked Fauci in a recent TV ad promoting his Senate campaign.",
    "A campaign ad paid for by Gibbons for Ohio Senate shows Anthony Fauci speaking into a microphone.",
    "A few days later, Rep. Elise Stefanik (R-N.Y.) ended a Jan. 16 fundraising email with a poll.",
    "In general, coronavirus messaging has been a significant theme in both parties’ advertising.",
    "They don’t have a clue on covid,” the Republican candidate said in a recent campaign spot.",
    "The former president even threatened to fire the doctor after the 2020 election.",
    "Ron DeSantis couldn’t have been clearer in a recent TV ad denouncing Fauci.",
    "Fauci’s office did not respond to a request for comment for this story.",
    "“I’ve stood strong against the mandates of Dr. Fauci, but I need help.",
    "Now he’s emerging as a star in Republican campaign commercials.",
    "Don’t get me started.”\nFauci has also been a fundraising tool.",
    "On the campaign trail, Biden had pledged to end the pandemic.",
    "(The poll surveyed 2,005 registered voters from Jan. 28-30).",
    "“Don’t let Fauci CANCEL your freedom again!” the text read.",
    "“DO YOU BELIEVE DR. FAUCI SHOULD BE FIRED?” she asked.",
    "What’s different now is the focus on Fauci personally.",
    "“Biden is as lost as last year’s Easter egg.",
    "“FAUCI CAN POUND SAND,” the ad read.",
    "“I’m sick of Washington.",
    "Florida GOP Gov.",
    "And Fauci?"
  ]
}