{
  "id": 5582,
  "mediaId": 2641,
  "date": "2022-02-10",
  "headline": "Josh Mandel, Jane Timken Slam Cincinnati Bell for Dropping Newsmax",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=3481f7fc-5ddf-4959-9066-795739f0c56f&SiteName=Newsmax",
  "link": "https://www.newsmax.com/us/newsmax-tv-ohio-senate-censorship-big-tech/2022/02/10/id/1056403/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luca Cacciatore",
  "authorUrl": "",
  "termIds": [
    1804,
    2085,
    4526,
    4656,
    216,
    715,
    764,
    767,
    878
  ],
  "sentences": [
    "Two Republican U.S. Senate candidates in Ohio spoke out strongly against the removal of Newsmax from the Midwestern telecom giant Cincinnati Bell in separate appearances Thursday on ''Spicer & Co.''\nJosh Mandel, the former Ohio state treasurer, asserted that he would ''take on any company'' ... ''if they're trampling our First Amendment rights.''",
    "''I will fight strong for our First Amendment, freedom of speech, and for companies like Newsmax to be on the air because you do an incredible service and get the message out to people so that they have a voice,'' she added.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\n© 2022 Newsmax.",
    "They want to live by one set of rules while people in Ohio and in the heartland live by another set of rules, and that's why I think it's important for Newsmax to have a platform wherever you can,'' he added.",
    "The comments from Mandel and Timken follow news Tuesday, that Cincinnati Bell was dropping Newsmax in a ''business decision'' after, it said, negotiations with the company failed, according to a statement.",
    "''I will take on any company, whether it's Cincinnati Bell or it's these Big Tech thugs like Facebook and Twitter and Google and others, if they're trampling on our First Amendment rights,'' he continued.",
    "The network noted that Cincinnati Bell, in the middle of those negotiations, and without notice to subscribers or Newsmax, halted transmission of the network into about 50,000 Bell customers' homes.",
    "Jane Timken, the former chair of the Ohio Republican Party, said that Big Tech companies were operating as a ''second arm of the government'' and determining acceptable speech ''by fiat.''",
    "Newsmax has encouraged its viewers to cancel their subscriptions to Cincinnati Bell and find Newsmax on another service such as Spectrum, Directv, Dish, Fubo, and AT&T TV, among others.",
    "''Organizations like Newsmax, people like yourself, people like Chris Ruddy and others, you were out there holding the powerful accountable, and they don't like that,'' Mandel said.",
    "Newsmax has stated that \"Cincinnati Bell's decision wasn't about business or price, it's all about woke politics and Bell closing down a conservative voice from their customers.\"",
    "\"Those negotiations were ongoing, and there was never any reason to claim we were making unreasonable demands as there were never any final numbers,\" a Newsmax spokesman stated.",
    "Mandel, the Republican nominee for the Ohio Senate seat in 2012, also praised Newsmax CEO Chris Ruddy, host Sean Spicer and the network for ''holding the powerful accountable.''",
    "''Second of all, I think Newsmax is at the pointy tip of the spear in opening up the airwaves for a pro-Trump, pro-gun, pro-liberty, pro-Constitution message.''",
    "Bell continues to carry 11 liberals news channels on its basic guide, most of which have lower ratings and cost the cable operator more in fees than Newsmax.",
    "Newsmax is the 4th highest-rated cable news channel and a top 20 cable channel with higher ratings than 80%t of the channels in Bell's basic cable lineup.",
    "But Newsmax noted that it never negotiated with Cincinnati Bell directly, but rather with its representative, the NCTC, a national cable cooperative.",
    "\"Cincinnati Bell is paying dozens of channels more money that have far less viewership than Newsmax,\" Newsmax stated.",
    "Newsmax urges Bell customers to complain and cancel directly by calling their toll free number, 1-877-649-6332.",
    "Newsmax noted it continues to be carried in 54 million cable homes and in most NCTC covered systems.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "Cincinnati Bell referred to Newsmax's negotiating demands as ''unreasonable.'",
    "\"Customers can draw their own conclusions about this ‘business decision.'",
    "''It's against our First Amendment,'' Timken told Spicer.",
    "''First of all, shame on Cincinnati Bell,'' Mandel said.",
    "''They don't want to be held accountable.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "All rights reserved.",
    "102, Mediacom Ch.",
    "615, Frontier Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch.",
    "Special Links:"
  ]
}