{
  "id": 597,
  "mediaId": 2658,
  "date": "2022-04-11",
  "headline": "Greitens’ fade reorders Missouri Senate race",
  "image": "https://static.politico.com/8f/4c/5c0f174542f8aa52714ce742b1fd/220411-eric-greitens-ap-773.jpg",
  "link": "https://www.politico.com/news/2022/04/11/greitens-hartzler-missouri-senate-race-00024351",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Two days after news broke of the latest Greitens allegations, Trump released a statement praising “the big, loud, and proud personality of Congressman Billy Long,” asking whether voters had considered him for Senate but clarifying his comments were “not an endorsement.”\nGOP Sen. Josh Hawley, who endorsed Hartzler, said he has discussed the race with Trump regularly in recent months.",
    "But I think there are different stakes this year with the voters and the concerns they’re having.”\nAfter Greitens was elected governor in 2016, his campaign staff set out to build a powerful social media network of Republican supporters in Missouri, amassing hundreds of thousands of Facebook followers by the time the 2018 scandals rolled around, Harris recalled.",
    "The poll, conducted by OnMessage, Hartzler’s general consulting firm, is consistent with an independent survey released last week by The Trafalgar Group, which showed Hartzler at 25 percent, Greitens at 24 percent and state Attorney General Eric Schmitt at 22 percent.",
    "| Nathan Papes/The Springfield News-Leader via AP, File\nBy Natalie Allison\n 04/11/2022 04:47 AM EDT\nRep. Vicky Hartzler is surging toward the front of the pack in Missouri’s GOP Senate primary, reordering a crowded race that’s long been marked by former Gov.",
    "As Greitens has weathered another round of media coverage of his alleged personal misconduct — prompting flashbacks of the news cycle in 2018 — Hartzler has been on air with a television ad condemning transgender athletes participating in women’s sports.",
    "Hartzler is now neck and neck with Greitens in the open seat race, according to multiple surveys conducted since Sheena Greitens filed court documents March 21 in a child custody dispute alleging her ex-husband abused her and their young son.",
    "National GOP leaders have cautioned that a Greitens endorsement could cost the party a GOP-held Senate seat this fall, or more likely force them to spend heavily on a state Donald Trump won by more than 15 percentage points in 2020.",
    "Harris said that primary voters who were willing to look the other way on the scandal that tanked Greitens’ tenure as governor are likely thinking differently about what the new allegations could mean in a general election fight.",
    "For the first time since he entered the primary a year ago, Greitens’ grip on the Republican base has lifted — a slide in support in recent weeks attributed to new allegations of domestic violence raised by Greitens’ ex-wife.",
    "A new internal poll conducted by Hartzler’s campaign April 4-6 and obtained by POLITICO shows Hartzler up 7 percentage points, to 23 percent, since they last polled in January, and Greitens down 8 points, now at 22 percent.",
    "The disgraced former governor resigned from office mid-term in 2018 following allegations that he sexually assaulted a woman and as part of an agreement with prosecutors to drop a separate computer tampering charge.",
    "A poll by Remington Research — owned by Schmitt’s consulting firm Axiom Strategies — conducted just after the new Greitens allegations put Schmitt at 24 percent, Greitens at 21 percent and Hartzler at 19 percent.",
    "OnMessage, which also provides consulting work for Hawley, has touted polling from January that found 54 percent of Republican voters in the state would be more likely to vote for a candidate he endorsed.",
    "Outside of the St. Louis, Kansas City, Springfield and Central Missouri media markets, coverage of Greitens’ downfall wasn’t saturating rural areas, and many Republicans there remained loyal to Greitens.",
    "At least two other Republican women running for Senate, Katie Britt in Alabama and Jane Timken in Ohio, have since followed Hartzler’s lead and released their own ads touching on women’s sports.",
    "The OnMessage poll showed Hartzler’s favorability rating increasing from 30 to 40 percent between January and April, as her unfavorable rating moved from 8 to 9 percent.",
    "Now we’re talking about domestic violence,” said James Harris, a Republican political strategist in Missouri, referencing the allegations against Greitens.",
    "Trump has met with multiple candidates in the race, including Greitens, Schmitt and Rep. Billy Long, who is polling a distant fourth in the race.",
    "Greitens’ favorability, meanwhile, fell from 49 to 42 percent during that time, and his unfavorable rating spiked from 23 to 35 percent.",
    "Greitens has vehemently denied his ex-wife’s most recent accusations, suggesting she raised the issue to hurt him politically.",
    "The former governor’s campaign did not immediately respond to a request for comment about Greitens’ declining poll numbers.",
    "Eric Greitens speaks at the Taney County Lincoln Day event at the Chateau on the Lake in Branson, Mo., April 17, 2021.",
    "Hartzler’s survey found Schmitt in third place with 16 percent of the vote, unchanged since the campaign’s last poll.",
    "We’re not talking about an affair now.”\nGreitens’ fade in the polls is welcome news to some in the party.",
    "But Greitens’ floor has dropped significantly in the aftermath of the most recent allegations.",
    "A potential Donald Trump endorsement continues to loom over the primary, set for Aug. 2.",
    "Sheena Greitens has said she has photographic proof of her ex-husband’s abuse.",
    "OnMessage conducted telephone interviews on 600 likely Republican voters.",
    "“We normally want to be ideologically pure and perfect and lose.",
    "“Republicans sometimes are not that smart,” Harris said.",
    "The poll’s margin of error is 4 percent.",
    "Eric Greitens’ lead in the polls.",
    "“Now we’re talking about abuse.",
    "That’s a different thing.",
    "“This is a flashpoint.",
    "Former Missouri Gov."
  ]
}