{
  "id": 6036,
  "mediaId": 2526,
  "date": "2022-02-03",
  "headline": "Bernie Moreno Suspends U.S. Senate Campaign",
  "image": "https://media.breitbart.com/media/2021/06/ohio-gop-senate-candidate-bernie-moreno-youtube-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/03/bernie-moreno-suspends-u-s-senate-campaign/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    1804,
    2131,
    2201,
    3466,
    3975,
    4526,
    666,
    878,
    1171,
    5212
  ],
  "sentences": [
    "Ohio Republican Bernie Moreno suspended his campaign for U.S. Senate on Thursday after he spoke with former President Donald Trump and concluded the race “has too many Trump candidates.”\nMoreno graciously dropped out of the crowded field of candidates for the sake of the MAGA movement.",
    "“You can’t solve problems until you call them what they are, which is why I’ve called this an invasion of our country for the past three or four months, and you can’t understand the situation unless you’re there,” Moreno said about his border visit.",
    "Moreno also said his candidacy “was never about fulfilling a personal ambition, but rather about serving the Country that gave me every opportunity to succeed.”\nMoreno, a legal immigrant to the United States, waited 13 years to become a citizen.",
    "I was very impressed with Bernie who was tough on illegal immigration which, after the Biden disaster at the Border, has become a big issue for all candidates.",
    "Bernie Moreno of Ohio is leaving the race for Senate, but I would like to thank him for his time and effort, and that of his wonderful family.",
    "After talking to President Trump we both agreed this race has too many Trump candidates and could cost the MAGA movement a conservative seat.",
    "Moreno said in a statement:\nI asked for a private meeting with President Trump this afternoon to discuss the state of the Ohio Senate race.",
    "Josh Mandel, Mike Gibbons, JD Vance, and Jane Timken are some of the Republican candidates who remain in the Senate race.",
    "As a candidate, he was extremely tough on immigration policy and emphasized the need to secure our southern border.",
    "I will focus my efforts on supporting the candidate that wins President Trump’s endorsement,” Moreno added.",
    "The former president highlighted Moreno’s tough immigration stance and his work for the MAGA movement.",
    "He earned the National Border Patrol Council’s nomination shortly before suspending his campaign.",
    "“Therefore, today I am ending my U.S. Senate campaign and will return to the private sector.",
    "“He has done much for Ohio and loves his State and our great MAGA Movement,” Trump added.",
    "“His decision will help ensure the MAGA Ticket wins BIG, as it is all over the Country.",
    "We don’t have a country if we can’t enforce our border,” Moreno told Breitbart News.",
    "Moreno often gave Breitbart News exclusive campaign updates while still in the race.",
    "Trump applauded Moreno’s decision to suspend his campaign in a statement.",
    "Moreno’s campaign visited the southern border last September.",
    "Business leaders recognize patterns before they happen.",
    "Thank you, Bernie, for your support and keep fighting!”",
    "“The border crisis is very concerning to me.",
    "I am a businessman, not a politician."
  ]
}