{
  "id": 6084,
  "mediaId": 2629,
  "date": "2022-02-03",
  "headline": "GOP Senate Hopeful Touts ‘Working Class’ Agenda — While She Campaigns At Country Clubs",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTIzMjQ3Ni9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwNTI5Nzk5N30.TCNSctq6ZxKKfVMfuZrd79T2gCFM5Wy07x8q5dabyvI/img.jpg?width=1200&coordinates=0%2C104%2C0%2C104&height=600",
  "link": "https://www.nationalmemo.com/gop-2656548701",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Israel",
  "authorUrl": "https://www.nationalmemo.com/u/josh-israel",
  "termIds": [
    4526,
    372,
    764,
    878,
    1171,
    5212
  ],
  "sentences": [
    "But according to her campaign's Federal Election Commission filings, she spent $23,691.24 on food and beverages for receptions at the Brookside Country Club, Chagrin Valley Hunt Club (a \"historic private country club\"), Hyde Park Country Club, Lake Forest Country Club, Moraine Country Club, Western Hills Country Club, and Youngstown Country Club in 2021.",
    "But while she has been spending tens of thousands of dollars at country clubs, Timken has been opposing President Joe Biden's agenda to actually help working-class Americans, calling it \"the absolute wrong policy\" and dismissing his human and physical infrastructure bills as \"a reckless path of tax-and-spend policies.\"",
    "Her country club spending comes less than a year after Sen. Ted Cruz (R-TX) proclaimed in a speech to the right-wing CPAC conference, \"The Republican Party is not the party of the country clubs, it's the party of hardworking, blue-collar men and women.\"",
    "Her campaign issues page notes that she would \"fight to return to the historic Trump-era tax cuts\" that reduced tax rates for corporations and the wealthy while increasing the tax bills of 10 million American families.",
    "Timken, a millionaire attorney and former Ohio Republican Party chair, promised in May 2021 that if elected she would fight for ordinary working people.",
    "The Youngstown Country Club calls itself the \"premier destination for first-class, private club experience\" and offers membership \"by referral only.\"",
    "In an interview with Crain's Cleveland Business in September, she asserted, \"The Republican Party is now the party of the working class.\"",
    "Timken is one of more than a dozen announced candidates seeking the GOP nomination to succeed retiring Republican Sen.",
    "Ohio Republican Senate candidate Jane Timken is running as a self-proclaimed champion of a \"working class\" agenda.",
    "But so far, her campaign has spent more than $23,000 for meals and drinks at private country clubs.",
    "\"The America First agenda is for the working class - for jobs and freedoms and the Constitution!\"",
    "A spokesperson for Timken's campaign did not immediately respond to a request for comment.",
    "Rob Portman in the 2022 midterm election, according to Politics1.com.",
    "Democrats are targeting the open seat as a potential pickup.",
    "she tweeted."
  ]
}