{
  "id": 6451,
  "mediaId": 2636,
  "date": "2022-02-01",
  "headline": "Billionaires and Big Checks Shape Battle for Congress",
  "image": "https://static01.nyt.com/images/2022/02/01/multimedia/01filings-top3/01filings-top3-facebookJumbo-v2.jpg",
  "link": "https://www.nytimes.com/2022/02/01/us/politics/midterm-elections-campaign-financing.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1684,
    1881,
    1923,
    2201,
    2298,
    3920,
    4253,
    372,
    1124,
    1171
  ],
  "sentences": [
    "In Ohio, the Senate race is crowded with wealthy Republican self-funders who have lent or donated money to their own campaigns: Mike Gibbons, an investment banker ($11.4 million); Jane Timken, a former party chair ($3.5 million); Bernie Moreno, a former car dealer ($3.75 million); and Matt Dolan, whose family owns the Cleveland Guardians ($10.5 million).",
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering, though this year’s map is poised to be surprisingly fair\nGovernors’ Races: Georgia’s contest will be at the center of the political universe, but there are several important races across the country.",
    "The disclosed donors to the House Democratic super PAC in the second half of the year included the media executive Fred Eychaner ($4 million), the LinkedIn co-founder Reid Hoffman ($1.45 million) and the philanthropist Connie Ballmer and the real estate developer George Marcus ($1 million each).",
    "Like Ms. Murkowski, Ms. Cheney out-raised her Trump-backed challenger, Harriet Hageman, collecting $2 million to Ms. Hageman’s $443,000 last quarter, though money is often not the determining factor in outcomes, especially in high-profile cases that garner significant media attention.",
    "Two moderate Democratic senators, Joe Manchin of West Virginia and Kyrsten Sinema of Arizona, who have not committed to supporting Mr. Biden’s signature domestic bill, raised bigger sums than some facing competitive contests, even though neither is up for election again until 2024.",
    "In Florida, Senator Marco Rubio, a Republican, raised $5.2 million and has $10.5 million in the bank; his expected Democratic challenger, Representative Val Demings, out-raised him by collecting $7.2 million, though she has less cash on hand, at $8.2 million.",
    "With control of both chambers up for grabs — the Senate is knotted at 50-50 and Democrats are clinging to a narrow majority in the House — the two parties were almost equally matched when it came to fund-raising last year.",
    "Big money also poured into the campaigns of some politicians who are not even on the ballot this year, reflecting the high stakes of the legislative battles that have raged on Capitol Hill over President Biden’s agenda.",
    "Among Ms. Murkowski’s donors in December was George W. Bush, who listed his occupation as “former president.” Overall, Ms. Murkowski raised nearly $1.4 million and reported entering 2022 with $4.2 million cash on hand.",
    "Senator Lisa Murkowski, the only Republican up for re-election in 2022 to have voted for former President Donald J. Trump’s impeachment, faces a right-wing challenge from Kelly Tshibaka, a Trump-endorsed rival.",
    "The billionaire liberal philanthropist George Soros seeded his own political committee with $125 million, new disclosures show, a sign that he will yet again continue to be a major financier on the left.",
    "In the House, the leading Republican super PAC and linked nonprofit announced raising twice as much money as the equivalent House Democratic groups, $110 million compared to $55 million last year.",
    "In addition, Mr. Griffin gave $5 million to a Pennsylvania-focused super PAC, which has opposed Dr. Mehmet Oz, the surgeon and former television show host running in the Republican primary there.",
    "Some of her contributions were from traditional Republican donors, including Nelson Peltz, an investor; Harlan Crow, a real estate developer; and Mike Fernandez, a health care industry investor.",
    "The top donors to the House Republican super PAC were Patrick G. Ryan, an insurance magnate who gave $10 million, and Ken Griffin, a hedge fund manager who also gave $10 million.",
    "While candidates face contribution limits of $2,900 each for the primary and general election, there is no limit on what the ultrarich can pour into campaigns through super PACs.",
    "Mr. Bush made one other symbolic donation: the legal maximum of $5,800 to Representative Liz Cheney of Wyoming, one of the most outspoken anti-Trump Republicans in Congress.",
    "The 2022 midterm elections were awash in political money even before the year began, according to new Federal Election Commission campaign disclosures made on Monday.",
    "The Democratic and Republican national committees, as well as the main House and Senate committees, pulled in nearly identical sums — about $400 million each.",
    "Dr. Oz contributed more than $5 million to his own race — one of multiple wealthy Republican candidates powering their Senate campaigns with their own money.",
    "Mr. Durant faces a former top aide to Senator Richard Shelby of Alabama, Katie Britt, who raised $1.2 million last quarter and has $4.1 million cash on hand.",
    "Among his opponents is David McCormick, who is the former chief executive of a prominent hedge fund and who entered the race after the filing deadline.",
    "In Alabama, Mike Durant, who was in one of the Black Hawk helicopters that was shot down in Somalia in 1993, put more than $4 million into his run.",
    "On the Republican side, several primary contests in the coming months will pit the Trump wing of the party against more traditional Republicans.",
    "Mr. Griffin also gave $5 million to the main Republican Senate super PAC, making him its largest donor in the second half of the year.",
    "In Georgia, Senator Raphael Warnock, a Democrat, was the top 2022 Senate fund-raiser, collecting $9.8 million in the fourth quarter.",
    "The battleground contests expected to determine which party is in the Senate majority are shaping up to be especially expensive.",
    "Mr. Walker has emerged as one of the strongest new Republican fund-raisers, raising $5.4 million, with $5.4 million in the bank.",
    "Ms. Sinema raised nearly $1.6 million in the fourth quarter — more than four times what she raised in the first quarter of 2021.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycle’s defining topics.",
    "In Arizona, Jim Lamon, a former energy executive, has put more than $8 million of his own money into his primary Senate run.",
    "Mr. Trump has endorsed a third Alabama candidate, Representative Mo Brooks, whose fund-raising has flagged.",
    "His likely Republican opponent, the former football player Herschel Walker, was urged to run by Mr. Trump.",
    "Mr. Brooks raised only $386,000 in the fourth quarter, down sharply from his previous two quarters.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "Jeff Bartos, another Republican candidate in Pennsylvania, gave his campaign $1.3 million.",
    "Mr. Manchin also raised almost $1.6 million, of which more than $300,000 came from PACs.",
    "Some of Mr. Dolan’s family members put an additional $3 million into a super PAC.",
    "Midterms Begin: The Texas primaries officially opened the 2022 election season.",
    "Big money flowed, in particular, to super PACs focused on control of Congress.",
    "Mr. Eychaner also gave $4 million to the Senate Democratic super PAC.",
    "And both political parties announced record-setting hauls in 2021.",
    "Nearly 98 percent of her money came from larger contributions.",
    "Ms. Tshibaka raised $602,000 and had $634,000 cash on hand.",
    "Mr. Warnock had nearly $23 million at the end of the year.",
    "Multimillionaires poured money into their own campaigns.",
    "Billionaires cut giant checks to super PACs.",
    "Small donors gave online in mass quantities.",
    "Here are the four incumbents most at risk.",
    "See the full primary calendar."
  ]
}