{
  "id": 5974,
  "mediaId": 4032,
  "date": "2022-02-09",
  "headline": "The Worst Thing to Be in Many GOP Primaries? A White Male Candidate.",
  "image": "https://thenewamerican.com/assets/sites/2/Slide1-26.jpeg",
  "link": "https://thenewamerican.com/the-worst-thing-to-be-in-many-gop-primaries-a-white-male-candidate/",
  "mediaOutlet": "New American",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gary Benoit",
  "authorUrl": "https://thenewamerican.com/editor/gary-benoit/",
  "termIds": [
    0
  ],
  "sentences": [
    "Doug Ducey who is running for an open Tucson seat; and Wesley Hunt, a Black Army veteran.”\nThe site then lists some additional GOP candidates in Democratic-leaning districts:\nTanya Contreras Wheeless, a Latina businesswoman challenging Democratic Rep. Greg Stanton in a Phoenix-area district; Jennifer Ruth-Green, a Black Air Force reservist, and former La Porte Mayor Blair Milo, who are both running against Democratic Rep. Frank Mrvan (D-Ind.",
    "After her surprising 2018 primary victory over a white male incumbent, partially won with the slogan, “It’s time for one of us,” the Washington Post wrote that her “appeal to the tribal identities of class, age, gender and ethnicity turned out to be a good gamble….”\nNo, the GOP candidates are explicitly running on issues, not melanin content and chromosome configuration.",
    "Thus do we hear remarks such as what was uttered by the aforementioned Tucson candidate Ciscomani, who told Politico, “The fact that I can speak Spanish, that I’m bilingual, that we can reach a broader group of voters — I think all those things matter at the end of the day.”\nWhether this is the end of the day for America, however, is the question.",
    "“‘And we are going to be in an exceptionally good position to hold these seats for some time to come.’”\n“Broadly, there are more Republican women and Hispanics running for Congress than ever before, according to figures tracked by the National Republican Congressional Campaign Committee,” Politico continues.",
    "“We even kind of see this from talking to people in our community, that even though folks might have previously voted Democrat, they’re ready to try something else.”\nWhat this marketing reflects is that “politics is the art of the possible,” as German leader Otto von Bismarck put it.",
    "Yet that non-whites (note: for purposes of simplicity, this includes here “Hispanics” even though the term references not race but ethnicity) and women are being courted for many races means that identity-politics imperatives are implicit in the selections.",
    "Among the non-white and female 2022 GOP contenders are, Politico relates, “Monica De La Cruz in Texas; Army reservist Esther Joy King, who is vying to replace retiring Rep. Cheri Bustos (D-Ill.); Juan Ciscomani, a longtime adviser to Arizona Gov.",
    "In the most important seats, roughly two dozen open and battleground districts, a leading GOP candidate is either a woman or a person of color.”\n(Whether whites are “people of no color,” and hence invisible to voters, Politico does not explain.)",
    "The deeper issue, of course, is why this is happening: Our post-1965 immigration policies have sparked radical demographic change by ensuring that 85 to 90 percent of our new arrivals come from the Third World.",
    "With this demographic having shrunk to approximately 60 percent of the population, down from close to 90 percent in the mid-1960s, Republican officeholders’ ranks will shrink unless they can attract new voters.",
    "Though an uber-charismatic and colorful longtime incumbent, far-left-wing Democrat Loretta Sanchez defeated him in 1996, aided by an influx of Latino residents (and, most likely, vote fraud) into his district.",
    "A more charitable way of putting this is that it’s “marketing.”\nIn its article, Politico profiles many of the new GOP candidates, opening with West Point graduate-turned-businessman John James in Michigan.",
    "“‘Getting these kinds of people not only defines the future of the party, but it also ensures that we are going to win these seats in 2022,’” Politico quotes GOP official Dan Conston as saying.",
    "“Every Republican who flipped a Democratic House district in 2020 was a woman or person of color, and party leaders want to replicate that success on a larger scale,” wrote Politico Tuesday.",
    "Republics are typically more homogeneous than empires, which can keep their diverse populations together via tyranny’s iron fist — until they become too weak to effect forced unity.",
    "Couple this (im)migration with certain newcomers being relatively unassimilable, and with how multiculturalism militates against assimilation, and it’s a recipe for balkanization.",
    "All are competing for districts that Biden carried by between 9 and 11 points in 2020 and could be well-positioned to bring independents and Biden voters into the party.",
    "Not that long ago — and this might have changed somewhat (and might not have) — the Republicans derived 90 percent of their votes from non-Hispanic white Americans.",
    "In fact, House Minority Leader Kevin McCarthy and top GOP strategists have been actively courting non-white and female candidates for the 2022 midterms.",
    "Republican Party leaders convinced two-time Senate candidate James to run for a Detroit-area congressional seat and consider him a lock to win it.",
    "); and Jeremy Hunt, a Black Army veteran, who launched a campaign against veteran Democratic Rep. Sanford Bishop in a southwest Georgia seat.",
    "Typically, approximately 70 percent of Hispanics and Asian-descent Americans, 90 percent of blacks, and a majority of women vote Democrat.",
    "Oh, it’s not that Republicans are quite taking a leaf out of New York Democratic Representative Alexandria Ocasio-Cortez’s book.",
    "“So far, more than 253 women and 228 people of color have filed to run as Republicans across the House map, the committee says.",
    "What’s for sure is that when American candidates have to speak a foreign language to win elections, it doesn’t bode well.",
    "Yet with the march of identity politics and demographic change, the same can now be said of many Republican primaries.",
    "Leftists welcome this because, historically, 70 to 90 percent of this group has voted Democrat upon naturalization.",
    "At this point they dissolve and, just perhaps, one or more of the resulting nations may become republics.",
    "“We will be very intentional about going into the Black community and asking for votes.",
    "A cautionary tale is the fate of former California Republican Congressman Bob Dornan.",
    "A white male candidate,” declared a June 2018 Washington Post headline.",
    "My wife and I — we grew up in the Black church,” Hunt said.",
    "“The worst thing to be in many Democratic primaries?",
    "The direct motivation?"
  ]
}