{
  "id": 11269,
  "mediaId": 2548,
  "date": "2022-03-08",
  "headline": "Rep. Stefanik Announces New Round Of Endorsements For Female Republicans",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/03/stefanik-bice-spartz-scaled-e1646693666261.jpg",
  "link": "https://dailycaller.com/2022/03/08/elise-stefanik-endorses-republican-women-e-pac/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Ginsberg",
  "authorUrl": "https://dailycaller.com/author/michael.b.ginsberg1998@gmail.com",
  "termIds": [
    3925,
    4327,
    5507,
    4835,
    4879,
    2714,
    1119,
    1126,
    5949,
    6650
  ],
  "sentences": [
    "“We have strong Republican women running from Florida, to Indiana, to Arizona, to Oregon in top battleground districts that will determine the House majority.”\n“I look forward to supporting these Rising Stars across the finish line in both their primaries and general elections.",
    "It’s clear there is no shortage of all-star Republican women this cycle–we have a record-shattering 260+ Republican women who are already running for Congress, which surpasses our record in 2020 during the historic ‘Year of the Republican Woman,’” Stefanik said in a statement.",
    "Full list of endorsements:\nTanya Contreras Wheeless (AZ-04)\nAnna Paulina Luna (FL-13)\nErin Houchin (IN-09)\nAnnie Black (NV-04)\nLiz Joy (NY-20)\nMadison Gesiotto Gilbert (OH-13)\nLori Chavez-DeRemer (OR-05)\nMorgan Ortagus (TN-05)\nCassy Garcia (TX-28)\nMayra Flores (TX-34)",
    "GOP women made history in 2020, and in 2022, Republican women are leading the Red Tsunami to Fire Nancy Pelosi once and for all.”\nEight Republican women won in Texas’ first-in-the-nation House primaries, including Garcia, Mayra Flores and Monica De La Cruz.",
    "(RELATED: Rep. Stefanik Endorses Jane Timken In Crowded Ohio Senate Race)\nEndorsed candidates gain access to Stefanik’s small-dollar donor list and communications advice from advisers and will have the opportunity to appear with Stefanik at events.",
    "Stefanik announced endorsements for eight Republican women in November, including her former communications director Karoline Leavitt, who is running in a crowded primary to face off against Democratic New Hampshire Rep. Chris Pappas.",
    "The list of 10 candidates includes former Trump State Department spokeswoman Morgan Ortagus, who is running to replace retiring Democratic Tennessee Rep. Jim Cooper, as well as former Ted Cruz aide Cassy Garcia.",
    "House Republican Conference chairwoman and New York Rep. Elise Stefanik will announce 10 new endorsements through her political action committee Elevate PAC (E-PAC) on Tuesday.",
    "E-PAC distributed the seventh-most money to Republican candidates of all House leadership PACs in the 2020 election cycle, according to Open Secrets.",
    "“I’m thrilled to add to E-PAC’s impressive slate of Republican women candidates by officially endorsing ten more Rising Star GOP women for Congress.",
    "Stefanik began E-PAC ahead of the 2020 election cycle, helping 18 female Republican candidates win their first elections to Congress.",
    "Stefanik will announce her endorsement of Flores on Tuesday and announced a De La Cruz endorsement in November.",
    "Out of 539 House and Senate seats, 144 are held by women in the 117th Congress, a record-high percentage.",
    "E-PAC has raised over $500,000 ahead of the 2022 midterms and has made contributions to 25 candidates.",
    "E-PAC raised just over $1 million in the 2020 election cycle and made contributions to 51 candidates.",
    "Leadership PACs like E-PAC allow elected officials to contribute campaign funds to their colleagues."
  ]
}