{
  "id": 5674,
  "mediaId": 8428,
  "date": "2022-04-21",
  "headline": "President Trump teases upcoming Ohio rally: ‘Crowd will be very big!’",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/04/T0PGBA-e1650555242336.jpg",
  "link": "https://www.rsbnetwork.com/news/president-trump-teases-upcoming-ohio-rally-crowd-will-be-very-big/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Summer Lane",
  "authorUrl": "https://www.rsbnetwork.com/author/summer-lane/",
  "termIds": [
    2783,
    2765,
    6107,
    5949,
    6474,
    6175,
    6456,
    6653
  ],
  "sentences": [
    "As noted in a statement by President Trump’s official Save America PAC, the rally “is a continuation of President Trump’s unprecedented effort to advance the MAGA agenda by energizing voters and highlighting America First candidates and causes.”\nFollowing Saturday’s rally in Delaware, Ohio, President Trump will deliver remarks at another upcoming Save America rally in Greenwood, Nebraska, on April 29.",
    "“Looking forward to our rally this Saturday evening in the Great State of Ohio,” he stated, “crowd will be very big – get there early!”\nPresident Trump’s Ohio rally will be held on Saturday, April 23, in Delaware, Ohio, and marks another rally on a slate of scheduled events for the 45th president.",
    "Photo: Alamy\nPresident Donald Trump teased an upcoming Save America rally in an official statement on Wednesday, saying that he was “looking forward” to the event and hinting that the crowd would be impressively big.",
    "Since January, Trump has appeared at Save America rallies in North Carolina, Arizona, Texas, and Georgia as part of a midterm elections campaign to promote strong, America First candidates.",
    "On Saturday, President Trump’s rally will also feature a string of recently-endorsed Republican candidates in Ohio as guest speakers, including U.S. Senate candidate J.D.",
    "At this time, the only scheduled speaker is American Agribusiness Executive and Nebraska gubernatorial candidate Charles W. Herbster.",
    "Vance (running for Ohio’s 15th district), Madison Gesiotto Gilbert (Ohio’s 13th district) and Max Miller (Ohio’s 7th district).",
    "You can watch the upcoming Ohio rally on Saturday, April 23, and tune into all-day coverage on RSBN HERE.",
    "More speakers will likely be added to the roster as the event gets closer."
  ]
}