{
  "id": 10729,
  "mediaId": 2526,
  "date": "2022-03-13",
  "headline": "Exclusive — Jim Bognet: China Is ‘Our Number One Strategic Enemy for the 21st Century’",
  "image": "https://media.breitbart.com/media/2020/10/Jim-Bognet-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/13/exclusive-jim-bognet-china-is-our-number-one-strategic-enemy-for-the-21st-century/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    4982,
    1907,
    2322,
    2765,
    4905,
    1297,
    188,
    1126,
    6506,
    6509,
    6595,
    6678
  ],
  "sentences": [
    "Jim Bognet, Republican candidate running to replace Rep. Matt Cartwright (D-PA) in Pennsylvania’s 8th congressional district, spoke with Breitbart News and said China is “our number one strategic enemy for the 21st century.”\nBreitbart News Saturday host Matthew Boyle began the interview with Bognet talking about the record-high level gas prices Americans are currently paying at the pump.",
    "“But even more so let me tell you what’s happening in northeastern Pennsylvania, Joe Biden and Matt Cartwright and their administration is flying ghost flights of illegal immigrants into Wilkes Barre Scranton airport.”\n“Joe Biden wants to use the place he claims to be from as a dumping ground for people and problems that he doesn’t know how to deal with.",
    "Boyle then brought up Breitbart News senior contributor Peter Schweizer’s new book, Red-Handed: How American Elites Get Rich Helping China Win, which exposes the millions of dollars Biden’s family has received from deals with individuals linked to the Chinese Communist Party (CCP).",
    "“And I wish people would wake up and realize we need to get our act together.”\nBognet concluded the interview by calling out Democrat politicians like Rep. Nancy Pelosi (D-CA) and Sen. Chuck Schumer (D-NY), who get rich off the backs of their constituents.",
    "What they can do is work hard, go hunting on the weekends try to support their family, but it’s becoming increasingly hard under Joe Biden and Matt Cartwright, who just seem like they’re against anything that would help a normal working person.",
    "China destroyed our industries here in Northeast Pennsylvania with unfair trade practices.”\nHe went on to call out China as “our number one strategic enemy for the 21st century.”\n“So first, they destroyed our economy with unfair trades.",
    "“These people get in office, they pad their own pocket through corruption, and then they tell us that Republicans are greedy.”\nBreitbart News Saturday airs on SiriusXM Patriot 125 from 10:00 a.m. to 1:00 p.m. Eastern.",
    "We want the Trump policies, which is to open up drilling on federal lands, which has allowed these pipelines every pipeline we should be trying to fast track instead Biden still cracking down the first day in office.",
    "Boyle talked about how instead of implementing policies to decrease gas prices, the Biden Administration encourages Americans to purchase expensive Tesla electric vehicles.",
    "“When Nancy Pelosi entered Congress in 1997, Or excuse me, 1987, Bon Jovi was at the top of the charts and I was playing Little League Baseball and now 30.",
    "You know, we’re not fancy folks from the big city that drive around in Teslas and beamers and all that stuff, so they can’t afford $55,000 Teslas.",
    "There’s no subways in northeastern Pennsylvania, and you can’t ride a bicycle on route at Interstate 81 trying to get to work in the morning.",
    "Bognet’s plan to deal with Biden’s CCP ties includes increasing congressional oversight and being more aggressive in the court system.",
    "LISTEN:\nBognet believes Biden and congressional Democrats, like his opponent Rep. Matt Cartwright (R-NC), want to see high gas prices.",
    "They want to rip down the sign that says Joe Biden highway that the lunatics put up to honor this guy who’s destroying our country.",
    "Boyle agreed with Bognet, adding that China imports fentanyl to Mexico, making its way to our country through the Mexican cartels.",
    "The anger is palpable, over inflation, over used car prices, over housing prices, over apartment prices, over meat prices.",
    "I mean, I go up to Scranton, and I talk to people on the streets, and they are embarrassed that Joe Biden’s from Scranton.",
    "Bognet believes that idea is unrealistic for North Carolina residents struggling to afford gas prices in the first place.",
    "Boyle called out President Joe Biden for canceling the Keystone XL pipeline and losing America’s energy independence.",
    "So I just think we need to return to the America first policies of stopping illegal immigration,” said Bognet.",
    "Instead of the Green New Deal, Bognet wants to reimplement former President Donald Trump’s energy policies.",
    "I don’t think they fought hard enough.”\nThe conversation switched gears to the ongoing opioid epidemic.",
    "“You know, Republicans have gotten schooled on redistricting in some states this time around.",
    "“The centerpiece of my campaign in 2020, as you remember were three words, make China pay.",
    "They tell us things like ride a bicycle, take the subway, let me tell you something, man.",
    "Bognet believes if we focus on securing our southern border, the opioid crisis will end.",
    "We’re not treating the Democrats the way they treat us when they’re in power,” he said.",
    "Then they started sending fentanyl into Mexico that ended up in Northeast Pennsylvania.",
    "Boyle asked Bognet what he would do about Biden’s ties to the CCP if he gets elected.",
    "“But secondly, I think we need to be much more aggressive in the courts,” he added.",
    "These guys are our number one strategic enemy for the 21st century,” Bognet said.",
    "I have never seen a Tesla on the local streets in northeastern Pennsylvania.",
    "He threw 1000s of people out of work by banning the Keystone XL pipeline.",
    "“I think number one we have to stop the southern border infiltration.",
    "My family’s in construction, we build things, we pour concrete.",
    "Boyle asked Bognet what needed to be done to end the epidemic.",
    "They worship the green raw deal like it’s a secular religion.",
    "“Well, number one, we have to bring the oversight back.",
    "People here have Ford pickup trucks, Ram pickup trucks.",
    "One time, I saw one on an interstate, and guess what?",
    "I don’t understand why when Republicans are in power.",
    "Some years later, she’s worth $200 million,” he said.",
    "“I’m so glad you brought up China,” Bognet said.",
    "We got to return to the remain in Mexico policy.",
    "And I really believe they want high gas prices.",
    "They work with their hands, they build things.",
    "We have to stop this crazy open border policy.",
    "We didn’t have it this bad since the 70s.",
    "They get on their knees and pray to it.",
    "We got to build the wall,” Bognet said.",
    "Then they send us the Wuhan flu.",
    "People here work for a living.",
    "We don’t have Teslas up here.",
    "It had DC plates on it.",
    "That’s insane."
  ]
}