[
  {
    "id": 8329,
    "mediaId": 233,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "",
    "author": "David Whitley",
    "title": "It's time for Georgia to have their day against Alabama in the College Football Playoff championship game"
  },
  {
    "id": 8330,
    "mediaId": 1460,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "",
    "author": "Mark Whicker",
    "title": "CFP National Championship: Georgia fans anxious about the onrushing Tide"
  },
  {
    "id": 8324,
    "mediaId": 12,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "And <span class='selected-term'>Herschel Walker</span> is not walking through that door, fans.",
    "author": "Steve Hummer",
    "title": "Champion 1980 Bulldogs have waited long enough for company"
  },
  {
    "id": 8325,
    "mediaId": 12,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "But during his tenure he has lifted Georgia to place it hasnt been since Vince Dooley landed <span class='selected-term'>Herschel Walker</span> in the spring of 1980 and won a national championship and three SEC championships in a row.",
    "author": "Chip Towers",
    "title": "Once again, Alabama stands in Georgias path to glory"
  },
  {
    "id": 8327,
    "mediaId": 43,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Those thrill of those triumphs was soon followed by a severe throttling of voting rights in Georgia, by the rise of Marjorie Taylor Green (she of the Jewish Space Lasers) and by the widespread Republican endorsement of <span class='selected-term'>Herschel Walker</span> as Warnocks 2022 opponent.",
    "author": "",
    "title": "our current voting rights threats"
  },
  {
    "id": 8313,
    "mediaId": 237,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "The Bulldogs have not won a national championship since 1980, when <span class='selected-term'>Herschel Walker</span>, who is now a candidate for the U.S. Senate, helped carry the team to victory as running back.",
    "author": "Daniel Chaitin",
    "title": "Georgia defeats Alabama in college football championship nail-biter"
  },
  {
    "id": 8316,
    "mediaId": 1460,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "The Bulldogs (14-1) hadnt won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "The Associated Press",
    "title": "Georgia outlasts Alabama for 1st national title in 41 years"
  },
  {
    "id": 8286,
    "mediaId": 65,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "In other developments:\n- <span class='selected-term'>Herschel Walker</span> leads Georgia celebration as Bulldogs beat Alabama for national title\n- Alabama's Nick Saban delivers message to Georgia's Kirby Smart after national championship loss\n- Questionable Georgia fumble leads to Alabama score in pivotal national title game moment\n- Alabama's Jameson Williams leaves national title game with apparent knee injury\nCLICK HERE TO GET THE FOX NEWS APP\nTODAY'S MUST-READS:\n- Harmony Montgomery: Uncle says he tried to alert authorities about abuse for years\n- Rep. Jim Banks: Bidens response to Russia raises concern\n- Food delivery driver rescues shivering toddler wandering Detroit in the cold\n- New Mexico teen mom throws newborn in dumpster in shocking video\n- 'Rachel Maddow Show' worried Madison Cawthorn might ask to come on show if they asked him for comment: Email\nTHE LATEST FROM FOX BUSINESS:\n- Fed chair hammers home commitment to cooling red-hot inflation\n- JPMorgan CEO Dimon sees very strong economy this year\n- Jon Ossoff exploring bill to ban Congress stock trades, rebuffing Pelosi\n- Sen. Warren demands Federal Reserve release more details on trading scandal\n- Billionaire supermarket CEO warns of potential egg and meat shortage\nSOME PARTING WORDS\nLaura Ingraham told viewers of Foxs \"The Ingraham Angle\" Monday night, \"It's only January 10th, and the web of lies woven by American agents of disinformation is beginning to unravel for all to see now from the government's response to the pandemic, to our military leadership's failures and critical points in between.\"",
    "author": "Jack Durschlag",
    "title": "Chicago, teachers union reach agreement; students return to classrooms Wednesday"
  },
  {
    "id": 8292,
    "mediaId": 124,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs (14-1) hadnt won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "",
    "title": "Georgia snaps 41-year title drought with 33-18 win over Alabama"
  },
  {
    "id": 8294,
    "mediaId": 718,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs (14-1) hadnt won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "Ralph D. Russo | Associated Press",
    "title": "Georgia wins first national title in 41 years, beating Alabama 33-18"
  },
  {
    "id": 8296,
    "mediaId": 65,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ryan Gaydos",
    "title": "Herschel Walker leads Georgia celebration as Bulldogs beat Alabama for national title"
  },
  {
    "id": 8297,
    "mediaId": 12,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "Bulldog fans were stuck viewing YouTube clips starring <span class='selected-term'>Herschel Walker</span>.",
    "author": "Mark Bradley",
    "title": "Mighty Georgia runs down Bama to claim its long-sought championship"
  },
  {
    "id": 8298,
    "mediaId": 233,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "It was Georgia's first national title since 1981, when <span class='selected-term'>Herschel Walker</span> and the Bulldogs capped their undefeated season with a 17-10 victory over Notre Dame in the Sugar Bowl.",
    "author": "Nancy Armour",
    "title": "Georgia shows off Bulldog mentality in beating Alabama for first title since 1980"
  },
  {
    "id": 8299,
    "mediaId": 1164,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs' last national title came more than four decades ago when freshman running back <span class='selected-term'>Herschel Walker</span> guided them to a 12-0 record and a Sugar Bowl win over Notre Dame.",
    "author": "Connor Grott",
    "title": "Georgia tops Alabama in College Football Playoff for 1st national title since 1980"
  },
  {
    "id": 8302,
    "mediaId": 178,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs (14-1) hadn't won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "RALPH D. RUSSO Associated Press",
    "title": "Georgia snaps 41-year title drought with 33-18 win over Bama"
  },
  {
    "id": 8303,
    "mediaId": 25,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs hadn't won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "",
    "title": "Georgia Bulldogs win first national title since 1980"
  },
  {
    "id": 8306,
    "mediaId": 25,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "The Bulldogs (14-1) hadn't won a national title since freshman <span class='selected-term'>Herschel Walker</span> led them there in 1980.",
    "author": "",
    "title": "Georgia Bulldogs win first college football national title since 1980, beat defending champ and longtime nemesis Alabama 33-18"
  },
  {
    "id": 8214,
    "mediaId": 21,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "Brent D. Griffiths",
    "title": "Herschel Walker says it's 'totally unfair' to ask him if he supports the bipartisan infrastructure bill that passed last year: 'I have to see all the facts'"
  },
  {
    "id": 8215,
    "mediaId": 12,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "Oh, and a tailback named <span class='selected-term'>Herschel Walker</span>.",
    "author": "Chip Towers",
    "title": "Belief makes Georgia Bulldogs a threat to win it all again"
  },
  {
    "id": 8171,
    "mediaId": 43,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "In his case, it's almost certainly going to be former NFL star <span class='selected-term'>Herschel Walker</span> and Mark Kelly against his opponents in Arizona.",
    "author": "",
    "title": "What do Bidens approval ratings mean for the midterms? (transcript)"
  },
  {
    "id": 6313,
    "mediaId": 151,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Thats three times as much money as GOP primary frontrunner <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "5 numbers to know from the new FEC reports"
  },
  {
    "id": 6143,
    "mediaId": 136,
    "date": "4/26/2022 12:00:00 AM",
    "sentence": "His endorsement of former football player <span class='selected-term'>Herschel Walker</span> also drew some concerns from Trump supporters, including Herschel's opponent Gary Black, who chastised him for disagreeing with the former president on some immigration policies in a 2015 USA Today interview.",
    "author": "Andrew Stanton",
    "title": "Trump Sparking Fights in MAGA World With These Endorsements"
  },
  {
    "id": 7069,
    "mediaId": 151,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "Meanwhile, Tuesdays Georgia primary is likely to solidify another clash of two titans this fall: Democratic Sen. Raphael Warnock and Republican <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Trump's revenge tour is put to the test in Georgia, Alabama"
  },
  {
    "id": 7482,
    "mediaId": 195,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Another Trump favorite, former football star <span class='selected-term'>Herschel Walker</span>, is all but certain to win the GOP Senate primary in Georgia on Tuesday.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump no longer holds MAGA movement in his palm"
  },
  {
    "id": 7484,
    "mediaId": 195,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Warnock is set to battle former University of Georgia football star <span class='selected-term'>Herschel Walker</span>, who has Trumps backing, while Abrams looks likely to face Kemp in a rematch of the 2018 gubernatorial election.",
    "author": "Rachel Scully",
    "title": "What time do polls close in Georgia, Texas?"
  },
  {
    "id": 7308,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Of course, theres one win that Trump can count on Tuesday: former NFL star <span class='selected-term'>Herschel Walker</span>, whos seen as the heavy favorite to clinch the GOP nod to take on Sen. Raphael Warnock (D-Ga.) this fall.",
    "author": "Max Greenwood",
    "title": "Five things to watch in the Georgia, Alabama primaries"
  },
  {
    "id": 7309,
    "mediaId": 323,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span> has a huge lead in polling over opponents looking to take on Mr. Warnock in Georgia, while former White House press secretary Sarah Sanders is expected to easily win the GOP nomination for governor in Arkansas, a state her father, Mike Huckabee, previously led.",
    "author": "Cameron McWhirter",
    "title": "Georgia GOP Primary Elections for Governor and Secretary of State Are Top Contests Today"
  },
  {
    "id": 7313,
    "mediaId": 129,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "This week, Georgia will also kick off one of the countrys most important Senate elections, between Senator Raphael Warnock, a Democrat running for re-election, and <span class='selected-term'>Herschel Walker</span>, a Republican backed by Mr. Trump who is widely expected to cruise to victory in his partys primary.",
    "author": "",
    "title": "What to Watch For in Todays Elections in Georgia and Beyond"
  },
  {
    "id": 7338,
    "mediaId": 25,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-f912f6e5</div>\n link copied\n5:40 PM\nGeorgia Senate Republican primary results\n<span class='selected-term'>Herschel Walker</span>, Gary Black, Kelvin King, Jonathan McColumn and Latham Saddler are running for the Republican nomination for U.S. Senate in Georgia.",
    "author": "",
    "title": "Primary results 2022: Georgia, Alabama, Arkansas, Texas runoff and Minnesota special election primary results"
  },
  {
    "id": 7349,
    "mediaId": 32,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump has also thrown his weight behind <span class='selected-term'>Herschel Walker</span>, a former NFL running back who is expected to advance to the general election for Senate against Democratic Sen. Raphael Warnock.",
    "author": "Kevin Breuninger",
    "title": "Georgia's primary elections on Tuesday are pivotal. Here's what to watch"
  },
  {
    "id": 7350,
    "mediaId": 129,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "And Josh Clark, a former Georgia state representative who is running a long-shot Senate campaign against <span class='selected-term'>Herschel Walker</span>, the Trump-endorsed former football star, touted his endorsement from Mike Lindell, the MyPillow chief executive who is a full-time amplifier of election conspiracy theories.",
    "author": "",
    "title": "Live Updates: What to Watch For in Today's Elections in Georgia and Beyond"
  },
  {
    "id": 7416,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Tal Axelrod\n<span class='selected-term'>Herschel Walker</span> clinches GOP Senate nomination in Georgia\n7:58 p.m.\nFormer NFL star Herschel Walker is projected to easily clinch the Republican Senate nomination in Georgia, securing his spot on the ballot to face off against Sen. Raphael Warnock (D-Ga.) in November.",
    "author": "",
    "title": "Live coverage: Polls close in Alabama, Texas"
  },
  {
    "id": 7428,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In the race for Senate in Georgia, former football star <span class='selected-term'>Herschel Walker</span> is expected to win the Republican primary, despite allegations of past violent behavior with women.",
    "author": "Isabel Martins",
    "title": "Primary Election Results for Georgia, Texas, Alabama and Other States"
  },
  {
    "id": 7430,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In Georgia, former football star <span class='selected-term'>Herschel Walker</span> is the overwhelming favorite to win the GOP Senate primarywhile Trump's former press secretary, Sarah Huckabee Sanders, is widely expected to win the Republican primary for Arkansas governor, as earlier indicated by a Remington Research Group poll from last year.",
    "author": "Ewan Palmer",
    "title": "Donald Trump Set for Slew of Primary Losses as Midterms Strategy Unravels"
  },
  {
    "id": 7435,
    "mediaId": 65,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "The most high-profile is former college and pro-football legend <span class='selected-term'>Herschel Walker</span>, who appears poised to easily capture the GOP nomination on his way to battling Democratic Sen. Raphael Warnock in a blockbuster general election showdown that could decide whether Republicans win back the Senate majority.",
    "author": "",
    "title": "Trump looms large over Tuesday primaries in Georgia, Alabama, Arkansas, and runoff in Texas"
  },
  {
    "id": 7437,
    "mediaId": 223,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Also in Georgia, we'll be keeping an eye on the crowded GOP Senate primary in which Trump-endorsed former NFL player <span class='selected-term'>Herschel Walker</span> is expected to win his primary against Georgia Agriculture Commissioner Gary Black, former state Representative Josh Clark, and a hat-trick of American heroes: former Navy Seal Latham Saddler, U.S. Air Force veteran Kelvin King, and former U.S. Army Special Forces brigadier general Jonathan McColumn.",
    "author": "Spencer Brown",
    "title": "Here's What to Expect in the Texas Runoffs and Races in Georgia, Alabama, and Arkansas"
  },
  {
    "id": 7438,
    "mediaId": 238,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Return to menu\n<span class='selected-term'>Herschel Walker</span>, the former pro football player-turned-businessman, is the front-runner in the Senate Republican primary in Georgia.",
    "author": "Mariana Alfaro",
    "title": "Primary elections live updates Big races are on the ballot in Georgia, Alabama, Arkansas and Texas"
  },
  {
    "id": 7444,
    "mediaId": 943,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump-backed former NFL star <span class='selected-term'>Herschel Walker</span> is poised to win Georgias GOP Senate nomination after fending off conservative opponents who raised questions about his history of domestic violence.",
    "author": "STEVE PEOPLES and JEFF AMY",
    "title": "What to watch in Tuesdays primaries: Trumps bid to reshape GOP faces biggest hurdles in Georgia"
  },
  {
    "id": 7446,
    "mediaId": 151,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Its one reason Trumps orbit and Senate Minority Leader Mitch McConnells political operation have united behind former football star <span class='selected-term'>Herschel Walker</span> in the Georgia Senate race: the likelihood of a close election in November against Democratic Sen. Raphael Warnock.",
    "author": "",
    "title": "Trump heads for big rebuke in Tuesdays elections"
  },
  {
    "id": 7470,
    "mediaId": 178,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "His preferred Senate candidate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won the GOP nomination despite warnings from Walker's Republican competitors about his history of domestic violence and mental health struggles.",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Kemp wins Georgia GOP gov's race in stinging rebuke of Trump"
  },
  {
    "id": 7472,
    "mediaId": 19,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "ET\nThe first votes are showing up in Georgias results, according to the New York Times, in the Senate GOP primary where <span class='selected-term'>Herschel Walker</span> has as expected taken a commanding lead out the gate.",
    "author": "Matthew Boyle",
    "title": "*** Election Night Livewire *** Georgia, Alabama, Texas, Arkansas, Minnesota Vote in Key Primaries"
  },
  {
    "id": 7345,
    "mediaId": 1576,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Former football great <span class='selected-term'>Herschel Walker</span>, Trump's pick for U.S. Senate in Georgia, dominated the Republican challengers in his primary.",
    "author": "",
    "title": "Takeaways: Trump's big primary defeat; scandals for the win"
  },
  {
    "id": 7362,
    "mediaId": 195,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> sailed to victory in Georgia's GOP Senate primary, setting up a matchup with incumbent Democratic Sen. Raphael Warnock (D-Ga.).",
    "author": "Max Greenwood",
    "title": "Five takeaways from primaries in Georgia, Alabama and beyond"
  },
  {
    "id": 7369,
    "mediaId": 65,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "To read more from Fox News' Kyle Morris, click here\nFormer football star <span class='selected-term'>Herschel Walker</span> won Georgia's Republican Senate primary Tuesday, as he seeks to unseat Sen. Raphael Warnock, D-Ga., in November.",
    "author": "Tyler Olson",
    "title": "Primary elections in Georgia, Alabama, runoff in Texas"
  },
  {
    "id": 7379,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Jones, Collins in Georgia GOP House runoff"
  }
]