[
  {
    "id": 7482,
    "mediaId": 195,
    "date": "2022-00-23",
    "sentence": "Another Trump favorite, former football star <span class='selected-term'>Herschel Walker</span>, is all but certain to win the GOP Senate primary in Georgia on Tuesday.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump no longer holds MAGA movement in his palm",
    "sentiment": "0.663"
  },
  {
    "id": 7338,
    "mediaId": 25,
    "date": "2022-00-24",
    "sentence": "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-f912f6e5</div>\n link copied\n5:40 PM\nGeorgia Senate Republican primary results\n<span class='selected-term'>Herschel Walker</span>, Gary Black, Kelvin King, Jonathan McColumn and Latham Saddler are running for the Republican nomination for U.S. Senate in Georgia.",
    "author": "",
    "title": "Primary results 2022: Georgia, Alabama, Arkansas, Texas runoff and Minnesota special election primary results",
    "sentiment": "0.0"
  },
  {
    "id": 7349,
    "mediaId": 32,
    "date": "2022-00-24",
    "sentence": "Trump has also thrown his weight behind <span class='selected-term'>Herschel Walker</span>, a former NFL running back who is expected to advance to the general election for Senate against Democratic Sen. Raphael Warnock.",
    "author": "Kevin Breuninger",
    "title": "Georgia's primary elections on Tuesday are pivotal. Here's what to watch",
    "sentiment": "0.0"
  },
  {
    "id": 7350,
    "mediaId": 129,
    "date": "2022-00-24",
    "sentence": "And Josh Clark, a former Georgia state representative who is running a long-shot Senate campaign against <span class='selected-term'>Herschel Walker</span>, the Trump-endorsed former football star, touted his endorsement from Mike Lindell, the MyPillow chief executive who is a full-time amplifier of election conspiracy theories.",
    "author": "",
    "title": "Live Updates: What to Watch For in Today's Elections in Georgia and Beyond",
    "sentiment": "0.311"
  },
  {
    "id": 7416,
    "mediaId": 195,
    "date": "2022-00-24",
    "sentence": "Tal Axelrod\n<span class='selected-term'>Herschel Walker</span> clinches GOP Senate nomination in Georgia\n7:58 p.m.\nFormer NFL star Herschel Walker is projected to easily clinch the Republican Senate nomination in Georgia, securing his spot on the ballot to face off against Sen. Raphael Warnock (D-Ga.) in November.",
    "author": "",
    "title": "Live coverage: Polls close in Alabama, Texas",
    "sentiment": "0.891"
  },
  {
    "id": 7418,
    "mediaId": 18,
    "date": "2022-00-24",
    "sentence": "OTHER DEVELOPMENTS:\nATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Arkansas Sanders mourns Texas victims",
    "sentiment": "-0.367"
  },
  {
    "id": 7421,
    "mediaId": 136,
    "date": "2022-00-24",
    "sentence": "1 hr ago 20:03 PM EDT\nTrump-backed Hershel Walker wins Senate Primary in Georgia\n<span class='selected-term'>Herschel Walker</span> will win the Georgia Republican primary for Senate.",
    "author": "Jake Thomas",
    "title": "Primary Live Updates: Sarah Huckabee Sanders Wins Arkansas Governor Primary",
    "sentiment": "0.936"
  },
  {
    "id": 7435,
    "mediaId": 65,
    "date": "2022-00-24",
    "sentence": "The most high-profile is former college and pro-football legend <span class='selected-term'>Herschel Walker</span>, who appears poised to easily capture the GOP nomination on his way to battling Democratic Sen. Raphael Warnock in a blockbuster general election showdown that could decide whether Republicans win back the Senate majority.",
    "author": "",
    "title": "Trump looms large over Tuesday primaries in Georgia, Alabama, Arkansas, and runoff in Texas",
    "sentiment": "0.481"
  },
  {
    "id": 7437,
    "mediaId": 223,
    "date": "2022-00-24",
    "sentence": "Also in Georgia, we'll be keeping an eye on the crowded GOP Senate primary in which Trump-endorsed former NFL player <span class='selected-term'>Herschel Walker</span> is expected to win his primary against Georgia Agriculture Commissioner Gary Black, former state Representative Josh Clark, and a hat-trick of American heroes: former Navy Seal Latham Saddler, U.S. Air Force veteran Kelvin King, and former U.S. Army Special Forces brigadier general Jonathan McColumn.",
    "author": "Spencer Brown",
    "title": "Here's What to Expect in the Texas Runoffs and Races in Georgia, Alabama, and Arkansas",
    "sentiment": "0.0"
  },
  {
    "id": 7438,
    "mediaId": 238,
    "date": "2022-00-24",
    "sentence": "Return to menu\n<span class='selected-term'>Herschel Walker</span>, the former pro football player-turned-businessman, is the front-runner in the Senate Republican primary in Georgia.",
    "author": "Mariana Alfaro",
    "title": "Primary elections live updates Big races are on the ballot in Georgia, Alabama, Arkansas and Texas",
    "sentiment": "-0.905"
  },
  {
    "id": 7472,
    "mediaId": 19,
    "date": "2022-00-24",
    "sentence": "ET\nThe first votes are showing up in Georgias results, according to the New York Times, in the Senate GOP primary where <span class='selected-term'>Herschel Walker</span> has as expected taken a commanding lead out the gate.",
    "author": "Matthew Boyle",
    "title": "*** Election Night Livewire *** Georgia, Alabama, Texas, Arkansas, Minnesota Vote in Key Primaries",
    "sentiment": "0.0"
  },
  {
    "id": 7372,
    "mediaId": 151,
    "date": "2022-00-25",
    "sentence": "Republicans in two deep-red states are also voting in major Senate contests, while Trump-endorsed <span class='selected-term'>Herschel Walker</span> is looking to sew up the nomination for the battleground race in Georgia.",
    "author": "",
    "title": "Kemp notches huge primary win in Georgia",
    "sentiment": "0.844"
  },
  {
    "id": 7380,
    "mediaId": 178,
    "date": "2022-00-25",
    "sentence": "His preferred Senate candidate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won the GOP nomination despite warnings from Walker's Republican competitors about his history of domestic violence and mental health struggles.",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Trump rebuked with stinging losses in Georgia GOP contests",
    "sentiment": "0.0"
  }
]