[
  {
    "id": 8325,
    "mediaId": 12,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "But during his tenure he has lifted Georgia to place it hasnt been since Vince Dooley landed <span class='selected-term'>Herschel Walker</span> in the spring of 1980 and won a national championship and three SEC championships in a row.",
    "author": "Chip Towers",
    "title": "Once again, Alabama stands in Georgias path to glory"
  },
  {
    "id": 8327,
    "mediaId": 43,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Those thrill of those triumphs was soon followed by a severe throttling of voting rights in Georgia, by the rise of Marjorie Taylor Green (she of the Jewish Space Lasers) and by the widespread Republican endorsement of <span class='selected-term'>Herschel Walker</span> as Warnocks 2022 opponent.",
    "author": "",
    "title": "our current voting rights threats"
  },
  {
    "id": 8297,
    "mediaId": 12,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "Bulldog fans were stuck viewing YouTube clips starring <span class='selected-term'>Herschel Walker</span>.",
    "author": "Mark Bradley",
    "title": "Mighty Georgia runs down Bama to claim its long-sought championship"
  },
  {
    "id": 8270,
    "mediaId": 1390,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "FIRST ON FOX: A super PAC supporting Georgia GOP Senate candidate <span class='selected-term'>Herschel Walker</span> is spending more than $50,000 on a billboard campaign attacking Sen. Raphael Warnock over inflation and gas prices as the midterms loom later this year.",
    "author": "Tyler Olson",
    "title": "Pro-Herschel Walker PAC hits Warnock over gas prices, inflation in billboard ads"
  },
  {
    "id": 8271,
    "mediaId": 12,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "A pro-<span class='selected-term'>Herschel Walker</span> outside group, 34N22, launched a statewide billboard campaign on Tuesday tying U.S. Sen. Raphael Warnock to President Joe Bidens policies and Atlantas crime rate.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Voting rights heads to Senate floor for likely defeat"
  },
  {
    "id": 8255,
    "mediaId": 12,
    "date": "1/24/2022 12:00:00 AM",
    "sentence": "Senate candidate <span class='selected-term'>Herschel Walker</span> is holding mostly closed-door events in Georgia, while collecting lucrative fees for private speeches mostly outside of the state.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Internal poll shows voter support for Buckhead cityhood down"
  },
  {
    "id": 8228,
    "mediaId": 43,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "He has outraised his GOP opponent, <span class='selected-term'>Herschel Walker</span>, by almost double in the last quarter of 2021, with donations averaging at $43.",
    "author": "Rebekah Sager",
    "title": "Warnock soaring to the lead in fundraising over GOP opponent, Trump lapdog Herschel Walker"
  },
  {
    "id": 8232,
    "mediaId": 19,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Republican candidate <span class='selected-term'>Herschel Walker</span> is narrowly beating incumbent Sen. Raphael Warnock (D-GA) by 3.5 points in the race for U.S. Senate in Georgia, according to a new poll.",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Football Legend Herschel Walker Leads Democrat Raphael Warnock in Tight Senate Race"
  },
  {
    "id": 8215,
    "mediaId": 12,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "Oh, and a tailback named <span class='selected-term'>Herschel Walker</span>.",
    "author": "Chip Towers",
    "title": "Belief makes Georgia Bulldogs a threat to win it all again"
  },
  {
    "id": 8218,
    "mediaId": 12,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "Greg Bluestein",
    "title": "Bidens sagging approval could haunt Georgia Democrats"
  },
  {
    "id": 8212,
    "mediaId": 120,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "After <span class='selected-term'>Herschel Walker</span> moved to Georgia to launch a Republican U.S. Senate campaign, his team didn't seem especially eager about sending him out on the campaign trail.",
    "author": "Steve Benen",
    "title": "How many times can Herschel Walker fumble before he's benched?"
  },
  {
    "id": 8194,
    "mediaId": 12,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "One detail that caught our eye in <span class='selected-term'>Herschel Walker</span>s fundraising report this week: His campaign paid Donald Trumps Mar-A-Lago resort roughly $135,000 in catering and venue fees last year.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Transgender sports ban introduced with high-powered support"
  },
  {
    "id": 8182,
    "mediaId": 12,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Georgia voters are on edge about rising inflation rates and economic struggles, according to an Atlanta Journal-Constitution poll that also shows Warnock in a tight race against Republican football standout <span class='selected-term'>Herschel Walker</span> in a hypothetical matchup.",
    "author": "Greg Bluestein",
    "title": "Warnock to Georgians in debut 2022 ad: I see you, I hear you, I am you."
  },
  {
    "id": 8165,
    "mediaId": 558,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Georgia Senate Walker\nFILE - Former Georgia running back and Republican Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> attends a college football game between UAB and Georgia, Sept. 11, 2021, in Atlanta.",
    "author": "BRIAN SLODYSKO",
    "title": "Police records complicate Herschel Walker's recovery story"
  },
  {
    "id": 8155,
    "mediaId": 558,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "ATLANTA (AP)  Republicans risk losing the U.S. Senate race if they nominate <span class='selected-term'>Herschel Walker</span>, two of Walker's rivals said, citing a report by The Associated Press about how police confiscated a gun from the former football great following a domestic dispute 20 years ago.",
    "author": "",
    "title": "Walker's past could let Warnock keep Senate seat, rivals say"
  },
  {
    "id": 8163,
    "mediaId": 178,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "\"It is time for <span class='selected-term'>Herschel Walker</span> to enter through the front door, make himself available to the public and have the press do interviews that test your knowledge and skills and answer the many questions that everyone has,\" Black said Friday, saying Walker needs to talk about his policy positions as well as his past.",
    "author": "JEFF AMY Associated Press",
    "title": "Walker's past could let Warnock keep Senate seat, rivals say"
  },
  {
    "id": 8133,
    "mediaId": 12,
    "date": "2/17/2022 12:00:00 AM",
    "sentence": "Four Heisman Trophy winners, including Johnson Countys <span class='selected-term'>Herschel Walker</span> and Westlakes Cam Newton, played high school football in Georgia.",
    "author": "Todd Holcomb",
    "title": "Plans announced for Georgia High School Football Hall of Fame"
  },
  {
    "id": 8112,
    "mediaId": 12,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "The Florida compound will host back-to-back fundraisers in mid-March, along with a third <span class='selected-term'>Herschel Walker</span> event.",
    "author": "Greg Bluestein",
    "title": "The Jolt: Trump stepping up focus on Georgia candidates"
  },
  {
    "id": 8106,
    "mediaId": 12,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "Former U.S. Sen. David Perdue said Russia wouldnt have invaded its neighbor if Trump was still president and Senate candidate <span class='selected-term'>Herschel Walker</span> faulted Bidens disastrous foreign policy  and Americans themselves.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Trump candidates in Georgia split from pro-Putin rhetoric"
  },
  {
    "id": 8061,
    "mediaId": 12,
    "date": "3/8/2022 12:00:00 AM",
    "sentence": "Stephen Lawson, spokesperson for the 34N22 political action committee, which is supporting Republican senate candidate <span class='selected-term'>Herschel Walker</span>, said in February that Warnock's record is causing Georgias gas prices to spike and our country to lose its energy independence.",
    "author": "JEFF AMY",
    "title": "Kemp and Warnock push for halt to gas taxes as prices rise"
  },
  {
    "id": 1217,
    "mediaId": 65,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "Also scheduled to appear at the March 26 rally with Trump is former professional and college football star running back <span class='selected-term'>Herschel Walker</span>, the clear front-runner in this year's GOP Senate primary in Georgia.",
    "author": "Paul Steinhauser",
    "title": "Trump returning to Georgia to campaign with David Perdue, Herschel Walker"
  },
  {
    "id": 8012,
    "mediaId": 12,
    "date": "3/16/2022 12:00:00 AM",
    "sentence": "The Huffington Post dug up footage of leading GOP Senate contender <span class='selected-term'>Herschel Walker</span> questioning the theory of evolution during a recent conversation with pastor Chuck Allen at Sugar Hill Church.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Washington marks anniversary of Atlanta spa shootings"
  },
  {
    "id": 8017,
    "mediaId": 43,
    "date": "3/16/2022 12:00:00 AM",
    "sentence": "RELATED STORIES:\nGOP dismisses senate candidates' records of domestic violence, sexual assault allegations\nNo big shocker to learn that <span class='selected-term'>Herschel Walker</span> hawked 'dry mist' spray to 'clean' you of COVID-19\nWalker gave a speech at Sugar Hill Church in Georgia Sunday where he actually questioned the science of evolution, not just implying but challenging the notion that if apes and humans coexisted, that means there is no evolution.",
    "author": "Rebekah Sager",
    "title": "'Why Are There Still Apes? Think About It': Herschel Walker has his doubts about evolution"
  },
  {
    "id": 8018,
    "mediaId": 1576,
    "date": "3/16/2022 12:00:00 AM",
    "sentence": "Republican Senate candidate <span class='selected-term'>Herschel Walker</span> questioned the existence of evolution this week in an appearance at a Georgia church.",
    "author": "",
    "title": "Georgia GOP Senate candidate Herschel Walker questions evolution"
  },
  {
    "id": 1176,
    "mediaId": 65,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "WHO'S UP AND WHO'S DOWN IN THE LATEST FOX NEWS MIDTERMS POWER RANKINGS\nRepublican Senate candidate Kelvin King charged in comments to the Atlanta Journal Constitution that \"<span class='selected-term'>Herschel Walker</span> talks about working hard and fighting for the interests of Georgians, yet he works behind the scenes to ensure a level of celebrity comfort and elusiveness, separating himself from the questions and engagement that Georgians demand.",
    "author": "Paul Steinhauser",
    "title": "Demolition derby in Georgia as Herschel Walker's GOP primary rivals slam the Senate front-runner"
  },
  {
    "id": 7900,
    "mediaId": 237,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "Heather Hamilton",
    "title": "Single most dangerous time: Trump blasts climate change, CRT, and KBJ"
  },
  {
    "id": 7854,
    "mediaId": 165,
    "date": "4/1/2022 12:00:00 AM",
    "sentence": "",
    "author": "William Vaillancourt",
    "title": "Turns Out Herschel Walker, Who Questioned How Evolution Is Possible, Repeatedly Lied About His Academic Record"
  },
  {
    "id": 7849,
    "mediaId": 169,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "For years now, GOP Senate candidate <span class='selected-term'>Herschel Walker</span> has boasted about graduating in the top 1% of his class at the University of Georgia; but recent evidence has come to light indicating that he actually didn't graduate at all.",
    "author": "Kelly McClure",
    "title": "GOP Senate candidate Herschel Walker lied about his college achievements"
  },
  {
    "id": 7850,
    "mediaId": 12,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "The best-known GOP candidate is <span class='selected-term'>Herschel Walker</span>, a former football player with a history of violence against women and erratic behavior that has dogged his campaign.",
    "author": "Greg Bluestein",
    "title": "Warnocks ex-wife takes legal action over child custody"
  },
  {
    "id": 7812,
    "mediaId": 43,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "By him going out, giving up all the energy, now we're not energy independent anymore, which started the whole downfall\" -- <span class='selected-term'>Herschel Walker</span>'s analysis of energy policy doesn't show a grasp of details or really anything at all pic.twitter.com/WR5GkqS8ma\n Aaron Rupar (@atrupar) April 10, 2022\nMeanwhile, although Walker was more than willing to chat up Fox News Maria Bartiromo Sunday morning, he skipped out on the first major GOP Senate debate on Saturday.",
    "author": "Rebekah Sager",
    "title": "Herschel Walker's financial reporting 'may raise questions for voters,' expert says"
  },
  {
    "id": 7788,
    "mediaId": 43,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "RELATED STORY: <span class='selected-term'>Herschel Walker</span>'s financial reporting 'may raise questions for voters,' expert says\nWalker has made mind-numbing missteps, such as referring to the late Rep. John Lewis as a senator, even implying that Lewis wouldnt have supported the bill named in his honor.",
    "author": "Rebekah Sager",
    "title": "Former NFL star, current Senate candidate Herschel Walker gets new coaches: McConnell, Cruz, Trump"
  },
  {
    "id": 7772,
    "mediaId": 239,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> is the frontrunner among six GOP candidates in the May 24 primary.",
    "author": "Jeff Amy",
    "title": "Georgias Sen. Warnock raises $13.6M in 2022s first quarter"
  },
  {
    "id": 7773,
    "mediaId": 1576,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> is the frontrunner among six GOP candidates in the May 24 primary.",
    "author": "",
    "title": "Georgia's Sen. Warnock raises $13.6M in 2022's first quarter"
  },
  {
    "id": 7707,
    "mediaId": 129,
    "date": "4/20/2022 12:00:00 AM",
    "sentence": "It was a campaign stop for a Senate candidate, but for many Georgians who came to see <span class='selected-term'>Herschel Walker</span>, politics was hardly the only draw.",
    "author": "",
    "title": "Herschel Walkers Senate Bid in Georgia Is Powered by Fandom"
  },
  {
    "id": 7639,
    "mediaId": 558,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "ATLANTA (AP)  <span class='selected-term'>Herschel Walker</span> is expected to skip a second debate against his Republican rivals for a crucial U.S. Senate seat on Tuesday after missing the first one.",
    "author": "SUDHIN THANAWALA",
    "title": "Herschel Walker, other candidates test skipping debates"
  },
  {
    "id": 7597,
    "mediaId": 558,
    "date": "5/5/2022 12:00:00 AM",
    "sentence": "Running for the U.S. Senate in Georgia, <span class='selected-term'>Herschel Walker</span> has taken a different tack, saying he doesnt want to look backward at the 2020 election.",
    "author": "DAVID KLEPPER and JEFF AMY",
    "title": "GOP works to get out the vote after calling elections rigged"
  },
  {
    "id": 7550,
    "mediaId": 21,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Republican US Senate hopeful <span class='selected-term'>Herschel Walker</span> neglected to report nearly $3.2 million in earnings in a federal financial disclosure, waiting five months to amend the sum.",
    "author": "Madison Hall",
    "title": "Republican Senate candidate Herschel Walker failed for months to report millions in earnings"
  },
  {
    "id": 7228,
    "mediaId": 129,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "This fall, Mr. Warnock is expected to face <span class='selected-term'>Herschel Walker</span>, the Republican former football star with scant political experience.",
    "author": "",
    "title": "Democrats Fight Headwinds in Georgia and Beyond: The Problem Is Reality"
  },
  {
    "id": 7260,
    "mediaId": 1576,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Their likely U.S. Senate candidate is <span class='selected-term'>Herschel Walker</span>, whos Black.",
    "author": "",
    "title": "Georgia voters showed us these 3 things about the fall election"
  },
  {
    "id": 7289,
    "mediaId": 129,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "This fall, Mr. Warnock is expected to face <span class='selected-term'>Herschel Walker</span>, the Republican former football star with scant political experience.",
    "author": "",
    "title": "Democrats are mindful of headwinds in Georgia, and everywhere else."
  },
  {
    "id": 7483,
    "mediaId": 147,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trumps candidate for U.S. Senate, football legend <span class='selected-term'>Herschel Walker</span>, appears to be cruising to the Republican nomination despite some GOP leaders warning that Walker will be unelectable in November against Democratic incumbent Raphael Warnock.",
    "author": "Jeff Amy",
    "title": "2022 Georgia Primary Election Results"
  },
  {
    "id": 7425,
    "mediaId": 558,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Also in Georgia, former football star <span class='selected-term'>Herschel Walker</span> for the Republican nomination for U.S. Senate.",
    "author": "Michael Isikoff",
    "title": "Georgia Gov. Kemp defeats Trump-backed challenger, former Senator Perdue in GOP primary"
  },
  {
    "id": 7427,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "GOP candidate <span class='selected-term'>Herschel Walker</span>, currently running to represent Georgia in the U.S. Senate, denied that former President Donald Trump has ever claimed the 2020 presidential election was stolen.",
    "author": "Andrew Stanton",
    "title": "Herschel Walker Denies Trump Ever Said Election Was 'Stolen'"
  },
  {
    "id": 7432,
    "mediaId": 305,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "The Georgia primary races have started today, and GOP Senate candidate <span class='selected-term'>Herschel Walker</span> couldnt help but give another priceless soundbite.",
    "author": "Murjani Rawls",
    "title": "Herschel Walker Claims Trump Never Said The Presidential Election Was 'Stolen'"
  },
  {
    "id": 7444,
    "mediaId": 943,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump-backed former NFL star <span class='selected-term'>Herschel Walker</span> is poised to win Georgias GOP Senate nomination after fending off conservative opponents who raised questions about his history of domestic violence.",
    "author": "STEVE PEOPLES and JEFF AMY",
    "title": "What to watch in Tuesdays primaries: Trumps bid to reshape GOP faces biggest hurdles in Georgia"
  },
  {
    "id": 7446,
    "mediaId": 151,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Its one reason Trumps orbit and Senate Minority Leader Mitch McConnells political operation have united behind former football star <span class='selected-term'>Herschel Walker</span> in the Georgia Senate race: the likelihood of a close election in November against Democratic Sen. Raphael Warnock.",
    "author": "",
    "title": "Trump heads for big rebuke in Tuesdays elections"
  },
  {
    "id": 7451,
    "mediaId": 1576,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Democratic U.S. Sen. Raphael Warnock will face Republican football legend <span class='selected-term'>Herschel Walker</span> for a coveted Senate seat in Georgia after both handily defeated primary challengers on Tuesday to set up a historic, high-stakes showdown.",
    "author": "",
    "title": "Georgia US Senate race will pit Warnock against Walker"
  },
  {
    "id": 7470,
    "mediaId": 178,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "His preferred Senate candidate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won the GOP nomination despite warnings from Walker's Republican competitors about his history of domestic violence and mental health struggles.",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Kemp wins Georgia GOP gov's race in stinging rebuke of Trump"
  },
  {
    "id": 7357,
    "mediaId": 151,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Trump was not without victories  most significantly <span class='selected-term'>Herschel Walker</span> in the U.S. Senate primary.",
    "author": "",
    "title": "Trump flops in Georgia: 5 takeaways from a big primary night"
  },
  {
    "id": 7370,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Nguyen in runoff in Democratic SoS primary"
  },
  {
    "id": 7374,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Raffensperger beats Trump-endorsed Hice"
  },
  {
    "id": 7379,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Jones, Collins in Georgia GOP House runoff"
  },
  {
    "id": 7406,
    "mediaId": 147,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA (AP)  Football great <span class='selected-term'>Herschel Walker</span>, endorsed by former President Donald Trump, won Georgias GOP Senate primary.",
    "author": "Associated Press",
    "title": "Trump pick Herschel Walker wins Georgias Republican Senate primary"
  }
]