[
  {
    "id": 4458,
    "mediaId": 129,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Ive dedicated my entire career to working in the interests of marginalized Black communities.?\n<span class='selected-term'>Herschel Walker</span>, the former football star leading the race for the Republican nomination for a Georgia Senate seat, said that a ban on abortion should have no exceptions  presumably even for rape, incest or the health of the mother.",
    "author": "",
    "title": "Midterm Stakes Grow Clearer: Election Deniers Will Be on Many Ballots"
  },
  {
    "id": 6538,
    "mediaId": 195,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span> is all but guaranteed to win the GOP Senate primary, setting up a general election match-up with Sen. Raphael Warnock (D) in November.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump faces critical popularity test in Georgia"
  },
  {
    "id": 7201,
    "mediaId": 136,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Trump has also endorsed former NFL star <span class='selected-term'>Herschel Walker</span> who is seeking to unseat Raphael Warnock in the U.S Senate.",
    "author": "Khaleda Rahman",
    "title": "Here's Who Donald Trump Has Endorsed in Next Week's Primary Elections"
  },
  {
    "id": 7245,
    "mediaId": 21,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Brian Kemp and Trump-backed former Sen. David Perdue; the GOP Senate primary where former NFL player <span class='selected-term'>Herschel Walker</span> is set to glide to the nomination and face first-term Democratic Sen. Raphael Warnock; the Georgia secretary of state race which features Raffensperger and Trump-endorsed Rep. Jody Hice; and the Democratic gubernatorial primary, where former state House minority leader Stacey Abrams is running unopposed in her second bid for the Governor's Mansion.",
    "author": "John L. Dorman",
    "title": "Early voting turnout in Georgia soars in wake of restrictive election law"
  },
  {
    "id": 7483,
    "mediaId": 147,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trumps candidate for U.S. Senate, football legend <span class='selected-term'>Herschel Walker</span>, appears to be cruising to the Republican nomination despite some GOP leaders warning that Walker will be unelectable in November against Democratic incumbent Raphael Warnock.",
    "author": "Jeff Amy",
    "title": "2022 Georgia Primary Election Results"
  },
  {
    "id": 7491,
    "mediaId": 169,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trump is predicted to have at least one winner on the day: Former football star <span class='selected-term'>Herschel Walker</span> will be the GOP nominee for the U.S. Senate seat currently held by Democrat Raphael Warnock.",
    "author": "Heather Digby Parton",
    "title": "Trump's guys may lose in Georgia  but his Big Lie is going strong"
  },
  {
    "id": 7497,
    "mediaId": 1576,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "In the high-profile race for U.S. Senate, former UGA football star <span class='selected-term'>Herschel Walker</span> is riding high with his Trump endorsement.",
    "author": "",
    "title": "7 things to watch on primary election night in Georgia"
  },
  {
    "id": 7498,
    "mediaId": 157,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trump is predicted to have at least one winner on the day: Former football star <span class='selected-term'>Herschel Walker</span> will be the GOP nominee for the U.S. Senate seat currently held by Democrat Raphael Warnock.",
    "author": "Heather Digby Parton",
    "title": "Trump is facing an embarrassing defeat  but here's why it might not matter"
  },
  {
    "id": 7501,
    "mediaId": 25,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Former star Georgia running back <span class='selected-term'>Herschel Walker</span> has led the Republican field since he entered the race with Trump's encouragement.",
    "author": "Adam Brewster, Aaron Navarro",
    "title": "Georgia primary pits Pence-endorsed Brian Kemp against Trump-backed David Perdue"
  },
  {
    "id": 7308,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Of course, theres one win that Trump can count on Tuesday: former NFL star <span class='selected-term'>Herschel Walker</span>, whos seen as the heavy favorite to clinch the GOP nod to take on Sen. Raphael Warnock (D-Ga.) this fall.",
    "author": "Max Greenwood",
    "title": "Five things to watch in the Georgia, Alabama primaries"
  },
  {
    "id": 7309,
    "mediaId": 323,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span> has a huge lead in polling over opponents looking to take on Mr. Warnock in Georgia, while former White House press secretary Sarah Sanders is expected to easily win the GOP nomination for governor in Arkansas, a state her father, Mike Huckabee, previously led.",
    "author": "Cameron McWhirter",
    "title": "Georgia GOP Primary Elections for Governor and Secretary of State Are Top Contests Today"
  },
  {
    "id": 7313,
    "mediaId": 129,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "This week, Georgia will also kick off one of the countrys most important Senate elections, between Senator Raphael Warnock, a Democrat running for re-election, and <span class='selected-term'>Herschel Walker</span>, a Republican backed by Mr. Trump who is widely expected to cruise to victory in his partys primary.",
    "author": "",
    "title": "What to Watch For in Todays Elections in Georgia and Beyond"
  },
  {
    "id": 7315,
    "mediaId": 21,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump talked up Perdue and former football star <span class='selected-term'>Herschel Walker</span>, his pick to knock off Warnock in the general election, during a rally in Commerce, Georgia on March 26.",
    "author": "Warren Rojas",
    "title": "David Perdue caps his campaign for Georgia governor with a racist remark against Stacey Abrams and a Trump tele-rally"
  },
  {
    "id": 7338,
    "mediaId": 25,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-f912f6e5</div>\n link copied\n5:40 PM\nGeorgia Senate Republican primary results\n<span class='selected-term'>Herschel Walker</span>, Gary Black, Kelvin King, Jonathan McColumn and Latham Saddler are running for the Republican nomination for U.S. Senate in Georgia.",
    "author": "",
    "title": "Primary results 2022: Georgia, Alabama, Arkansas, Texas runoff and Minnesota special election primary results"
  },
  {
    "id": 7349,
    "mediaId": 32,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump has also thrown his weight behind <span class='selected-term'>Herschel Walker</span>, a former NFL running back who is expected to advance to the general election for Senate against Democratic Sen. Raphael Warnock.",
    "author": "Kevin Breuninger",
    "title": "Georgia's primary elections on Tuesday are pivotal. Here's what to watch"
  },
  {
    "id": 7350,
    "mediaId": 129,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "And Josh Clark, a former Georgia state representative who is running a long-shot Senate campaign against <span class='selected-term'>Herschel Walker</span>, the Trump-endorsed former football star, touted his endorsement from Mike Lindell, the MyPillow chief executive who is a full-time amplifier of election conspiracy theories.",
    "author": "",
    "title": "Live Updates: What to Watch For in Today's Elections in Georgia and Beyond"
  },
  {
    "id": 7425,
    "mediaId": 558,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Also in Georgia, former football star <span class='selected-term'>Herschel Walker</span> for the Republican nomination for U.S. Senate.",
    "author": "Michael Isikoff",
    "title": "Georgia Gov. Kemp defeats Trump-backed challenger, former Senator Perdue in GOP primary"
  },
  {
    "id": 7430,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In Georgia, former football star <span class='selected-term'>Herschel Walker</span> is the overwhelming favorite to win the GOP Senate primarywhile Trump's former press secretary, Sarah Huckabee Sanders, is widely expected to win the Republican primary for Arkansas governor, as earlier indicated by a Remington Research Group poll from last year.",
    "author": "Ewan Palmer",
    "title": "Donald Trump Set for Slew of Primary Losses as Midterms Strategy Unravels"
  },
  {
    "id": 7434,
    "mediaId": 409,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Less controversial yet, perhaps, more important to Republicans is the U.S. Senate primary, where former professional football player <span class='selected-term'>Herschel Walker</span> has dominated the field with an average of 65 percent support across all major polls.",
    "author": "Arjun Singh",
    "title": "Trumps Hold Over GOP Electorate to Be Tested in Closely Watched Primaries"
  },
  {
    "id": 7436,
    "mediaId": 441,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Former University of Georgia football legend <span class='selected-term'>Herschel Walker</span>, 60, is backed by Trump and is running far ahead of any other GOP primary contender despite participating in no debates and avoiding the news media.",
    "author": "Margaret Newkirk",
    "title": "Here Are the Key Races to Watch in Georgias Tuesday Primaries"
  },
  {
    "id": 7445,
    "mediaId": 151,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "He helped recruit former football star <span class='selected-term'>Herschel Walker</span>, thus alienating another Georgia statewide official, Agriculture Commissioner Gary Black, who was already running.",
    "author": "",
    "title": "Trump sparked a GOP war in Georgia. Some arent ready to forgive and forget."
  },
  {
    "id": 7461,
    "mediaId": 98,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Those contests, along with the likely rise of football legend <span class='selected-term'>Herschel Walker</span> and a pair of battles for the direction of the Democratic Party, make up a busy night of midterm primary action.",
    "author": "Melanie MasonStaff Writer",
    "title": "Georgia has its primary today. Heres what to watch"
  },
  {
    "id": 7470,
    "mediaId": 178,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "His preferred Senate candidate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won the GOP nomination despite warnings from Walker's Republican competitors about his history of domestic violence and mental health struggles.",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Kemp wins Georgia GOP gov's race in stinging rebuke of Trump"
  },
  {
    "id": 7331,
    "mediaId": 238,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Trump notched an expected win in Georgia's Republican primary for U.S. Senate, where former NFL star <span class='selected-term'>Herschel Walker</span> won.",
    "author": "David Weigel",
    "title": "Kemp, Raffensperger win in blow to Trump and his false election claims"
  },
  {
    "id": 7345,
    "mediaId": 1576,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Former football great <span class='selected-term'>Herschel Walker</span>, Trump's pick for U.S. Senate in Georgia, dominated the Republican challengers in his primary.",
    "author": "",
    "title": "Takeaways: Trump's big primary defeat; scandals for the win"
  },
  {
    "id": 7362,
    "mediaId": 195,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> sailed to victory in Georgia's GOP Senate primary, setting up a matchup with incumbent Democratic Sen. Raphael Warnock (D-Ga.).",
    "author": "Max Greenwood",
    "title": "Five takeaways from primaries in Georgia, Alabama and beyond"
  },
  {
    "id": 7370,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Nguyen in runoff in Democratic SoS primary"
  },
  {
    "id": 7374,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Raffensperger beats Trump-endorsed Hice"
  },
  {
    "id": 8357,
    "mediaId": 129,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "In Georgia's U.S. Senate race, <span class='selected-term'>Herschel Walker</span>, the former University of Georgia football star who was also recruited by Mr. Trump, won the Republican nomination and will face Senator Raphael Warnock, a Democrat, in November.",
    "author": "",
    "title": "Primary Elections Live Updates: Voters Reject Trump Endorsed Candidates in Georgia"
  }
]