[
  {
    "id": 1319,
    "mediaId": 19,
    "date": "d2022-02-23T00:00",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Herschel Walker Doesn't Support Kemp or Perdue: I'm Mad at Both of Them'",
    "sentiment": "-0.436"
  },
  {
    "id": 8106,
    "mediaId": 12,
    "date": "d2022-02-25T13:00",
    "sentence": "Former U.S. Sen. David Perdue said Russia wouldnt have invaded its neighbor if Trump was still president and Senate candidate <span class='selected-term'>Herschel Walker</span> faulted Bidens disastrous foreign policy  and Americans themselves.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Trump candidates in Georgia split from pro-Putin rhetoric",
    "sentiment": "0.0"
  },
  {
    "id": 8047,
    "mediaId": 1576,
    "date": "d2022-03-11T00:00",
    "sentence": "Republicans: Gary Black, Josh Clark, Kelvin King, Jonathan Jon McColumn, Latham Saddler, <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Candidates confirmed for 2022 election in Georgia as qualifying ends",
    "sentiment": "0.0"
  },
  {
    "id": 7911,
    "mediaId": 19,
    "date": "d2022-03-26T00:00",
    "sentence": "Multiple Trump-endorsed candidates are scheduled to speak at Saturdays rally, including former football star and current Republican primary Senate candidate <span class='selected-term'>Herschel Walker</span> and former Senator and current gubernatorial candidate David Perdue.",
    "author": "Ethan Letkeman",
    "title": "Watch Live: Donald Trump Holds Save America Rally in Commerce, Georgia",
    "sentiment": "0"
  },
  {
    "id": 7894,
    "mediaId": 12,
    "date": "d2022-03-27T03:00",
    "sentence": "If Kemp runs, I think <span class='selected-term'>Herschel Walker</span> will be seriously and negatively impacted, Trump thundered from the stage at an old racetrack in Commerce.",
    "author": "Greg Bluestein",
    "title": "Trump brings his anti-Kemp campaign to Georgia",
    "sentiment": "-0.388"
  },
  {
    "id": 7889,
    "mediaId": 237,
    "date": "d2022-03-27T09:23",
    "sentence": "The 45th president added that the stakes for <span class='selected-term'>Herschel Walker</span>, a GOP Senate candidate in the Peach State and former star running back, are also high.",
    "author": "Heather Hamilton",
    "title": "'It's a vote for this country': Trump touts David Perdue for Georgia's next governor",
    "sentiment": "0.814"
  },
  {
    "id": 7497,
    "mediaId": 1576,
    "date": "d2022-05-23T00:00",
    "sentence": "In the high-profile race for U.S. Senate, former UGA football star <span class='selected-term'>Herschel Walker</span> is riding high with his Trump endorsement.",
    "author": "",
    "title": "7 things to watch on primary election night in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7505,
    "mediaId": 1576,
    "date": "d2022-05-23T00:00",
    "sentence": "AGRICULTURE COMMISSIONER\nAgriculture Commissioner Gary Black isnt seeking reelection, opting instead to run for U.S. Senate in the Republican primary that includes former football great <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Incumbents in Georgia face primary opponents down the ballot",
    "sentiment": "0.0"
  },
  {
    "id": 7445,
    "mediaId": 151,
    "date": "d2022-05-24T08:30",
    "sentence": "He helped recruit former football star <span class='selected-term'>Herschel Walker</span>, thus alienating another Georgia statewide official, Agriculture Commissioner Gary Black, who was already running.",
    "author": "",
    "title": "Trump sparked a GOP war in Georgia. Some arent ready to forgive and forget.",
    "sentiment": "-0.63"
  }
]