[
  {
    "id": 7821,
    "mediaId": 65,
    "date": "2022-00-08",
    "sentence": "A campaign staffer for former NFL star <span class='selected-term'>Herschel Walker</span>, who is running as a Republican for a Senate seat in Georgia, posted a photo with Clarence Thomas on Friday afternoon marking the first time Thomas has been seen since being released from a hospital on March 25 following an undisclosed illness.",
    "author": "Andrew Mark Miller",
    "title": "Clarence Thomas publicly spotted for first time since being hospitalized",
    "sentiment": "0"
  },
  {
    "id": 7823,
    "mediaId": 237,
    "date": "2022-00-08",
    "sentence": "Supreme Court Justice Clarence Thomas met with Senate candidate <span class='selected-term'>Herschel Walker</span> in his first quasi-public appearance since he was discharged from the hospital last month.",
    "author": "Kaelan Deese",
    "title": "Justice Clarence Thomas meets with Georgia GOP Senate hopeful Herschel Walker",
    "sentiment": "0"
  },
  {
    "id": 7824,
    "mediaId": 188,
    "date": "2022-00-08",
    "sentence": "Remarking on a photo of <span class='selected-term'>Herschel Walker</span> and Supreme Court Justice Clarence Thomas, Democratic Rep. Mondaire Jones of New York asked whether Thomas will recuse himself from any cases that emerge from the Peach State's 2022 Senate election contest.",
    "author": "Alex Nitzberg",
    "title": "'I think the court has crossed the rubicon': Sen. Chris Murphy sounds alarm over photo of Supreme Court Justice Clarence Thomas with US Senate candidate Herschel Walker",
    "sentiment": "0"
  },
  {
    "id": 2145,
    "mediaId": 43,
    "date": "2022-00-09",
    "sentence": "",
    "author": "",
    "title": "Democrats Raise Red Flags Over That Photo Op Of Herschel Walker (R) & Clarence Thomas",
    "sentiment": "0.264"
  },
  {
    "id": 7810,
    "mediaId": 157,
    "date": "2022-00-11",
    "sentence": "",
    "author": "Sarah K. Burris",
    "title": "Clarence Thomas is the only Supreme Court justice to take a photo with a political candidate in history: MSNBC host",
    "sentiment": "0.0"
  },
  {
    "id": 7796,
    "mediaId": 43,
    "date": "2022-00-12",
    "sentence": "I didnt choose a top picture for this commentary of <span class='selected-term'>Herschel Walker</span>, Tim Scott, Clarence Thomas, or any of the other current quislings of color supported by the right, because even looking at them makes me bilious.",
    "author": "",
    "title": "Black Kos, Tuesdays Chile: All my skinfolk aint my kinfolk We see you Thomas, Scott, and Walker.",
    "sentiment": "-0.858"
  },
  {
    "id": 7782,
    "mediaId": 43,
    "date": "2022-00-13",
    "sentence": "He gave these reasons:\nThomas posed with <span class='selected-term'>Herschel Walker</span>, a Republican candidate trying to run against Democrat Senator Raphael Warnock.",
    "author": "",
    "title": "Clarence Thomas is a politician, says Lawrence O'Donnell last night",
    "sentiment": "0.0"
  },
  {
    "id": 7726,
    "mediaId": 237,
    "date": "2022-00-18",
    "sentence": "Thomas appeared to be in good spirits earlier this month when he met Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> in his first quasipublic appearance since leaving the hospital.",
    "author": "Kaelan Deese",
    "title": "Clarence Thomas resumes hearing oral arguments after absence from Supreme Court",
    "sentiment": "0"
  },
  {
    "id": 8102,
    "mediaId": 223,
    "date": "2022-00-28",
    "sentence": "Consider <span class='selected-term'>Herschel Walker</span>, a pro-liberty former football star endorsed by former President Donald Trump for his Senate run in Georgia.",
    "author": "Timothy Head",
    "title": "This Black History Month, Let's Honor the Past and Present Champions of Faith and Freedom",
    "sentiment": "0.0"
  }
]