[
  {
    "id": 1217,
    "mediaId": 65,
    "date": "3/11/2022 12:00:00 AM",
    "sentence": "Also scheduled to appear at the March 26 rally with Trump is former professional and college football star running back <span class='selected-term'>Herschel Walker</span>, the clear front-runner in this year's GOP Senate primary in Georgia.",
    "author": "Paul Steinhauser",
    "title": "Trump returning to Georgia to campaign with David Perdue, Herschel Walker"
  },
  {
    "id": 7900,
    "mediaId": 237,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "Heather Hamilton",
    "title": "Single most dangerous time: Trump blasts climate change, CRT, and KBJ"
  },
  {
    "id": 7906,
    "mediaId": 558,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Saturdays rally in Commerce, 70 miles north-east of Atlanta and one of the most conservative parts of the state, is expected to feature <span class='selected-term'>Herschel Walker</span>, a former football player running for the US Senate; Perdue; and the congressional candidate Vernon Jones, a former Democratic state representative who began calling himself the Black Donald Trump after switching parties.",
    "author": "Edward Helmore",
    "title": "Trump heads to Georgia in high-stakes bid to shape Republican primaries"
  },
  {
    "id": 7911,
    "mediaId": 19,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Multiple Trump-endorsed candidates are scheduled to speak at Saturdays rally, including former football star and current Republican primary Senate candidate <span class='selected-term'>Herschel Walker</span> and former Senator and current gubernatorial candidate David Perdue.",
    "author": "Ethan Letkeman",
    "title": "Watch Live: Donald Trump Holds Save America Rally in Commerce, Georgia"
  },
  {
    "id": 7894,
    "mediaId": 12,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "If Kemp runs, I think <span class='selected-term'>Herschel Walker</span> will be seriously and negatively impacted, Trump thundered from the stage at an old racetrack in Commerce.",
    "author": "Greg Bluestein",
    "title": "Trump brings his anti-Kemp campaign to Georgia"
  },
  {
    "id": 2064,
    "mediaId": 65,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "EXCLUSIVE: Republican Senate candidate <span class='selected-term'>Herschel Walker</span> racked up another impressive fundraising haul for his Senate campaign as he tries to unseat Democratic Sen. Raphael Warnock of Georgia in November's midterm elections.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Herschel Walker raises $5.5M the past three months in his GOP Senate bid in Georgia"
  },
  {
    "id": 7535,
    "mediaId": 558,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "(Hyosub Shin/Atlanta Journal-Constitution via AP, File)\nWASHINGTON (AP)  <span class='selected-term'>Herschel Walker</span>, the football legend and leading Republican Senate candidate in Georgia, often boasts of his work helping service members and veterans struggling with mental health.",
    "author": "BRIAN SLODYSKO",
    "title": "Herschel Walker's ties to veterans program face scrutiny"
  },
  {
    "id": 7315,
    "mediaId": 21,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump talked up Perdue and former football star <span class='selected-term'>Herschel Walker</span>, his pick to knock off Warnock in the general election, during a rally in Commerce, Georgia on March 26.",
    "author": "Warren Rojas",
    "title": "David Perdue caps his campaign for Georgia governor with a racist remark against Stacey Abrams and a Trump tele-rally"
  }
]