[
  {
    "id": 8165,
    "mediaId": 558,
    "date": "d2022-02-10T10:39",
    "sentence": "Georgia Senate Walker\nFILE - Former Georgia running back and Republican Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> attends a college football game between UAB and Georgia, Sept. 11, 2021, in Atlanta.",
    "author": "BRIAN SLODYSKO",
    "title": "Police records complicate Herschel Walker's recovery story",
    "sentiment": "-0.85"
  },
  {
    "id": 8151,
    "mediaId": 12,
    "date": "d2022-02-11T18:00",
    "sentence": "It was updated on Feb. 11, 2022, to make clear that U.S. Senate candidate <span class='selected-term'>Herschel Walker</span>s therapist, Jerry Mungadze, holds a doctorate of philosophy in counselor education.",
    "author": "BRIAN SLODYSKO",
    "title": "Police records complicate Herschel Walker's recovery story",
    "sentiment": "-0.869"
  },
  {
    "id": 8147,
    "mediaId": 112,
    "date": "d2022-02-12T11:15",
    "sentence": "Associated Press\nHeavily redacted records from 2001 incident at Walkers former home in a gated suburban Dallas subdivision adds another layer to an already turbulent personal history, which includes the former football stars acknowledged struggles with mental health, violent outbursts and accusations that he repeatedly threatened his ex-wife\nWASHINGTON (AP)  One warm fall evening in 2001, police in Irving, Texas, received an alarming call from <span class='selected-term'>Herschel Walker</span>s therapist.",
    "author": "Associated Press",
    "title": "Texas police report provided to the AP under legal compulsion complicates the Herschel Walker redemption tale",
    "sentiment": "-0.977"
  },
  {
    "id": 7525,
    "mediaId": 178,
    "date": "d2022-05-22T00:00",
    "sentence": "But there are many, many other reasons, I think, to be concerned about <span class='selected-term'>Herschel Walker</span> as a Senate candidate.''",
    "author": "",
    "title": "Herschel Walker: From football stardom to troubling Senate candidate",
    "sentiment": "0.185"
  }
]