[
  {
    "id": 7847,
    "mediaId": 43,
    "date": "4/3/2022 12:00:00 AM",
    "sentence": "State Sen. Bruce Bostelman (R-NE), forced to apologize after he publicly cited a persistent but debunked rumor alleging schools are placing litter boxes in bathrooms to accommodate children who self-identify as cats\n Boris Johnson, as his government was among those cited by the London polices issuing some 20 fines in connection with breaches of covid-19 regulations at government buildings including 10 Downing Street\n Film star Ezra Miller (of Flash fame), arrested for disorderly conduct and harassment in a karaoke bar in Hawaii  and ha apparently been reported to police several times before\n Rep Madison Cawthorn (R-NC), upbraided by fellow conservatives not for all of his past behavior  but solely for suggesting in an interview that he has been invited to GOP orgies and cocaine sessions\n Infowars host Alex Jones, ordered by a judge to start paying $25k/day fines for failing to appear at a deposition in a civil lawsuit filed by families of Sandy Hook school shooting victims\n Will Smith, forced to resign from the Academy of Motion Picture Arts and Sciences (as a voting member) following last Sundays award ceremony\n University of Houston volleyball stars Isabel Theut and Abbie Jackson, under investigation after being in a video posted on Snapchat, laughing at a tree where two black teenagers were lynched by a mob of 700 white people in 1935\n Intel Corp, under fire after a filing revealed the stock options given to its new CEO Pat Gelsinger were $169.5m, much more than the company reported and more than the $98.7m Apple gave Tim Cook, which sparked a shareholder revolt\n Anti-abortion extremist Lauren Handy, already indicted for a blockade of abortion clinics ... found by the FBI to have kept 5 bags of fetuses at her home in D.C. that she rented from a former Trump counsel  who clerked for Clarence Thomas\n State assembly leader Robin Vos, held in contempt of court after he failed to obey an order to produce records from the investigation Vos himself launched (hiring Michael Gableman) relating to the 2020 election\n Karl Rove, after the attorney for the disgraced Senate candidate Eric Greitens claimed Rove may have committed a crime by persuading Greitens ex-wife to file an affidavit against him alleging domestic violence (that Greitens denies)\n Amazon, losing a warehouse union vote in State Island, New York despite an all-out effort to defeat the measure and without any assistance from an established union or professional organizer\n Greg Abbott, as a federal judge declared his state governments investigation into a Texas home (for sexually abused girls) possibly delving into child porn production has been slipshod and will refer the case to the US Attorney\n Ghislaine Maxwell, as her motion for a new trial based on a jurors potential bias (that he falsely stated before the trial that he had never been sexually abused) was denied\n US Senate candidate <span class='selected-term'>Herschel Walker</span> (R-GA), claiming he graduated in the top 1% from the University of Georgia  when he did not even graduate, and also lying about being a high school valedictorian\n Jamie Petrone-Codrington, an administrator at Yale School of Medicine, pleading guilty to stealing $40m in computer and electronic hardware purchased via school accounts then secretly reselling for her own profit (in $10k increments)\n Multiple names listed - or a write-in - either way, please elaborate in a comment\n 130 votes Vote Now!",
    "author": "",
    "title": "Odds & Ends: News/Humor (with a \"Who Lost the Week?\" poll)",
    "sentiment": "0"
  },
  {
    "id": 7822,
    "mediaId": 98,
    "date": "4/8/2022 12:00:00 AM",
    "sentence": "(N) 7 and 10 a.m. CNN\nSunday Morning Futures With Maria Bartiromo Rep. Jim Jordan (R-Ohio); U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> (R-Ga.); House Minority Leader Rep. Kevin McCarthy (R-Bakersfield); U.S. House candidate Cory Mills (R-Fla.).",
    "author": "Ed Stockly",
    "title": "Guests on Sunday Talk Shows: Ukrainian President Volodymyr Zelensky will be on 60 Minutes",
    "sentiment": "0"
  },
  {
    "id": 7733,
    "mediaId": 238,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Who's giving to Trump's super PAC",
    "sentiment": "0"
  }
]