[
  {
    "id": 8286,
    "mediaId": 65,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "In other developments:\n- <span class='selected-term'>Herschel Walker</span> leads Georgia celebration as Bulldogs beat Alabama for national title\n- Alabama's Nick Saban delivers message to Georgia's Kirby Smart after national championship loss\n- Questionable Georgia fumble leads to Alabama score in pivotal national title game moment\n- Alabama's Jameson Williams leaves national title game with apparent knee injury\nCLICK HERE TO GET THE FOX NEWS APP\nTODAY'S MUST-READS:\n- Harmony Montgomery: Uncle says he tried to alert authorities about abuse for years\n- Rep. Jim Banks: Bidens response to Russia raises concern\n- Food delivery driver rescues shivering toddler wandering Detroit in the cold\n- New Mexico teen mom throws newborn in dumpster in shocking video\n- 'Rachel Maddow Show' worried Madison Cawthorn might ask to come on show if they asked him for comment: Email\nTHE LATEST FROM FOX BUSINESS:\n- Fed chair hammers home commitment to cooling red-hot inflation\n- JPMorgan CEO Dimon sees very strong economy this year\n- Jon Ossoff exploring bill to ban Congress stock trades, rebuffing Pelosi\n- Sen. Warren demands Federal Reserve release more details on trading scandal\n- Billionaire supermarket CEO warns of potential egg and meat shortage\nSOME PARTING WORDS\nLaura Ingraham told viewers of Foxs \"The Ingraham Angle\" Monday night, \"It's only January 10th, and the web of lies woven by American agents of disinformation is beginning to unravel for all to see now from the government's response to the pandemic, to our military leadership's failures and critical points in between.\"",
    "author": "Jack Durschlag",
    "title": "Chicago, teachers union reach agreement; students return to classrooms Wednesday",
    "sentiment": "0"
  },
  {
    "id": 8267,
    "mediaId": 223,
    "date": "1/19/2022 12:00:00 AM",
    "sentence": "The paper decided to go through the Instagram account of Senate candidate <span class='selected-term'>Herschel Walker</span>, and they have found a number of accounts that were followed thatuh, well, I guess the reporters did not likeit seems?",
    "author": "Brad Slager",
    "title": "CNN 'Conspiracy Buster' Raves When the Network Hires a Conspiracy Source",
    "sentiment": "-0.463"
  },
  {
    "id": 7965,
    "mediaId": 239,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "Among the many who will take the stage when the time comes: Reps. Marjorie Taylor Greene, Andrew Clyde and Jody Nice  all Georgia Republicans, of course  along with David Perdue, former U.S. senator from Georgia and now a candidate for governor; state Sen. Burt Jones, a candidate for lieutenant governor; and football great <span class='selected-term'>Herschel Walker</span>, a Heisman Trophy winner and now a candidate for the U.S. Senate.",
    "author": "Jennifer Harper",
    "title": "The collapse in economic confidence under President Biden",
    "sentiment": "0.812"
  },
  {
    "id": 7885,
    "mediaId": 151,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "POLITICO Playbook: Bidens 9-word ad-lib that set the world ablaze",
    "sentiment": "0"
  },
  {
    "id": 7797,
    "mediaId": 120,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "Herschel Walker's awkward Fox News interview is hard to watch",
    "sentiment": "-0.908"
  },
  {
    "id": 7798,
    "mediaId": 120,
    "date": "4/11/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ja'han Jones",
    "title": "Herschel Walker's awkward Fox News interview is hard to watch",
    "sentiment": "-0.918"
  },
  {
    "id": 7795,
    "mediaId": 157,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "In a column for MSNBC, political analyst Steve Benen suggested that retired football player <span class='selected-term'>Herschel Walker</span> is completely out of his depth as an aspiring candidate for the Republican nomination to oppose Sen. Raphael Warnock (D-GA).",
    "author": "Tom Boggioni",
    "title": "Herschel Walker can't even 'pretend to be competent': analyst",
    "sentiment": "-0.861"
  },
  {
    "id": 7781,
    "mediaId": 43,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "But they almost never get into the specifics of the personalities of someone like <span class='selected-term'>Herschel Walker</span> or of Donald Trump making all these endorsements of people like Sean Purnell, who had to drop out of that Pennsylvania Senate race because he was an alleged wife beater and lost custody of his children.",
    "author": "",
    "title": "This week on The Brief: The GOP's 2022 strategy and how to disarm Fox News",
    "sentiment": "0"
  },
  {
    "id": 7760,
    "mediaId": 169,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Hostin also compares Oz's situation to that of former football running back <span class='selected-term'>Herschel Walker</span>, who came out as the front-runner in recent polls amid his campaign to acquire a Senate seat in Georgia.",
    "author": "Joy Saha",
    "title": "\"The View\" hosts tickled by \"Trump minions\" at Fox News who are split over Dr. Oz Senate endorsement",
    "sentiment": "0"
  },
  {
    "id": 7754,
    "mediaId": 19,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "The Nations justice correspondent Elie Mystal said Friday on MSNBCs All In that Georgia Republican U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> is a clown candidate that voters should punish Republicans for putting forward.",
    "author": "Pam Key",
    "title": "Mystal: Voters Need to Punish GOP for Putting Forward Clown Candidate Herschel Walker",
    "sentiment": "-0.861"
  },
  {
    "id": 7652,
    "mediaId": 120,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "As their statewide campaigns move forward, Georgias <span class='selected-term'>Herschel Walker</span> and Pennsylvanias Mehmet Oz have quite a bit in common.",
    "author": "Steve Benen",
    "title": "The unexpected thing Herschel Walker has in common with Dr. Oz",
    "sentiment": "-0.921"
  },
  {
    "id": 4470,
    "mediaId": 65,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "CLICK HERE FOR TOPLINE AND CROSSTABS\nFormer NFL running back <span class='selected-term'>Herschel Walker</span> dominates the field in the Republican Senate primary race.",
    "author": "",
    "title": "Fox News Poll: Georgias GOP primary race for governor sees Kemp holding wide lead over Perdue",
    "sentiment": "0"
  },
  {
    "id": 7455,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "NOW WATCH: <span class='selected-term'>Herschel Walker</span> argues with reporter Trump 'never said' election was stolen",
    "author": "David Edwards",
    "title": "'I'm just a journalist!' Fox News host Harris Faulkner clashes with Dem for exposing her 'conservative' bias",
    "sentiment": "0"
  }
]