[
  {
    "id": 8262,
    "mediaId": 12,
    "date": "1/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Greg Bluestein",
    "title": "Walker has limited public campaign stops, but hes profited from private events"
  },
  {
    "id": 1557,
    "mediaId": 12,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "But none of those military appointments, statewide elections, or traditional Republican check-list attributes have managed to compete with the sheer celebrity of <span class='selected-term'>Herschel Walker</span> since he moved back to Georgia in August and announced his run for Senate, with Donald Trump's blessing.",
    "author": "Patricia Murphy",
    "title": "OPINION: How to run for Senate when you're not Herschel Walker"
  },
  {
    "id": 8240,
    "mediaId": 12,
    "date": "1/26/2022 12:00:00 AM",
    "sentence": "This massive fundraising haul, likely the largest in the country for a non-incumbent, shows that Georgia Republicans are clearly united behind <span class='selected-term'>Herschel Walker</span> and are ready to take on Senator Warnock, said his campaign manager Scott Paradise.",
    "author": "Greg Bluestein",
    "title": "Herschel Walker raises another $5.4M for Senate bid"
  },
  {
    "id": 8155,
    "mediaId": 558,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "ATLANTA (AP)  Republicans risk losing the U.S. Senate race if they nominate <span class='selected-term'>Herschel Walker</span>, two of Walker's rivals said, citing a report by The Associated Press about how police confiscated a gun from the former football great following a domestic dispute 20 years ago.",
    "author": "",
    "title": "Walker's past could let Warnock keep Senate seat, rivals say"
  },
  {
    "id": 8156,
    "mediaId": 558,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "(AP Photo/Ben Gray, File)\nATLANTA (AP)  Republicans risk losing the U.S. Senate race if they nominate <span class='selected-term'>Herschel Walker</span>, two of Walker's rivals said, citing a report by The Associated Press about how police confiscated a gun from the former football great following a domestic dispute 20 years ago.",
    "author": "JEFF AMY",
    "title": "Walker's past could let Warnock keep Senate seat, rivals say"
  },
  {
    "id": 8163,
    "mediaId": 178,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "\"It is time for <span class='selected-term'>Herschel Walker</span> to enter through the front door, make himself available to the public and have the press do interviews that test your knowledge and skills and answer the many questions that everyone has,\" Black said Friday, saying Walker needs to talk about his policy positions as well as his past.",
    "author": "JEFF AMY Associated Press",
    "title": "Walker's past could let Warnock keep Senate seat, rivals say"
  },
  {
    "id": 1176,
    "mediaId": 65,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "WHO'S UP AND WHO'S DOWN IN THE LATEST FOX NEWS MIDTERMS POWER RANKINGS\nRepublican Senate candidate Kelvin King charged in comments to the Atlanta Journal Constitution that \"<span class='selected-term'>Herschel Walker</span> talks about working hard and fighting for the interests of Georgians, yet he works behind the scenes to ensure a level of celebrity comfort and elusiveness, separating himself from the questions and engagement that Georgians demand.",
    "author": "Paul Steinhauser",
    "title": "Demolition derby in Georgia as Herschel Walker's GOP primary rivals slam the Senate front-runner"
  },
  {
    "id": 7996,
    "mediaId": 12,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "While <span class='selected-term'>Herschel Walker</span>s comments questioning evolution and reproductive medicine caught national attention this week, he also spoke Tuesday at the Rotary Club of Carrollton where he appeared to falsely suggest that NATO hasnt been involved in working to deter Russias invasion of Ukraine.",
    "author": "Greg Bluestein",
    "title": "Its not an autograph tour. Herschel Walkers GOP opponents rip their rival"
  },
  {
    "id": 7997,
    "mediaId": 124,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "A brutal Senate primary is heating up in Georgia, where Republican Gary Blacks campaign dropped opposition research about primary opponent <span class='selected-term'>Herschel Walker</span> (former President Donald Trumps pick), highlighting a lengthy list of allegations of domestic assault, threats and violence.",
    "author": "",
    "title": "Day 22 into Russia's invasion of Ukraine: A glimmer of hope and a devastating reality"
  },
  {
    "id": 8002,
    "mediaId": 157,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "On Thursday, POLITICO Playbook reported that <span class='selected-term'>Herschel Walker</span>, the former football star running for Senate in Georgia with the endorsement of former President Donald Trump, is now facing attacks from his primary challenger, state Agriculture Commissioner Gary Black, over his history of domestic violence  and it has some GOP strategists privately scared about his viability in the general election.",
    "author": "Matthew Chapman",
    "title": "Republicans worry about pro-Trump Senate candidate's history of domestic violence"
  },
  {
    "id": 7838,
    "mediaId": 19,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> holds a narrow lead over incumbent Sen. Raphael Warnock (D-GA) in a hypothetical matchup in the race for U.S. Senate in Georgia, according to a poll published Wednesday.",
    "author": "Ashley Oliver",
    "title": "Poll: Herschel Walker Leads Raphael Warnock in Tight Georgia Senate Race"
  },
  {
    "id": 7815,
    "mediaId": 12,
    "date": "4/10/2022 12:00:00 AM",
    "sentence": "Former football great <span class='selected-term'>Herschel Walker</span> skipped the first major Republican U.S. Senate debate, but his absence at the event in Gainesville on Saturday helped shape the back-and-forth among the five candidates who showed up.",
    "author": "Greg Bluestein",
    "title": "Herschel Walkers no-show looms large over Senate GOP debate"
  },
  {
    "id": 7739,
    "mediaId": 136,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "\"<span class='selected-term'>Herschel Walker</span> will never let you down,\" Trump said in a statement last year that declared his \"complete and total endorsement\" for the candidate, CNN reported.",
    "author": "Zoe Strozewski",
    "title": "Herschel Walker Is Betting Favorite to Win Georgia Senate Seat"
  },
  {
    "id": 7743,
    "mediaId": 12,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Republican Senate front-runner <span class='selected-term'>Herschel Walker</span> said his campaign committees amassed $5.5 million the first three months of the year for his bid to unseat Democratic U.S. Sen. Raphael Warnock.",
    "author": "Greg Bluestein",
    "title": "Herschel Walkers campaign raises $5.5M for Senate bid"
  },
  {
    "id": 7751,
    "mediaId": 1576,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Football icon and Georgia Republican <span class='selected-term'>Herschel Walker</span> said Friday that his U.S. Senate campaign had raised $5.5 million in the first three months of 2022, a big haul that is still dwarfed by the $13.6 million that Democratic incumbent Raphael Warnock raised in the same period.",
    "author": "",
    "title": "Walker raises $5.5M in Georgia Senate race, trailing Warnock"
  },
  {
    "id": 7699,
    "mediaId": 305,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Somehow former football player and Republican Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> is still convincing folks that hes the man for the job.",
    "author": "Angela Johnson",
    "title": "Herschel Walker Endorsed by Pro-Life Organization"
  },
  {
    "id": 7660,
    "mediaId": 12,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Senate candidate <span class='selected-term'>Herschel Walker</span> has spent years promoting and developing health-conscious products with dubious benefits and a skepticism from the medical community, a review by The Atlanta Journal-Constitution has found.",
    "author": "Dylan Jackson",
    "title": "Herschel Walker spent years promoting health products with dubious claims"
  },
  {
    "id": 1801,
    "mediaId": 239,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "One of the problems also is if Brian Kemp gets in, I think it's going to be very, very hard for <span class='selected-term'>Herschel Walker</span> to win,? Mr. Trump said, according to the Atlanta Journal-Constitution.",
    "author": "Seth McLaughlin",
    "title": "Herschel Walker's debate avoidance in primary spurs general election questions"
  },
  {
    "id": 7614,
    "mediaId": 1576,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "Tuesdays debate among Georgia Republican Senate candidates was predictably defined by the man who wasnt there  <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Georgia GOP Senate debate focuses on Herschel Walker absence"
  },
  {
    "id": 7585,
    "mediaId": 19,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span> appeared to acknowledge a possible blowout in the primary as he dominates in the polls and invited his GOP opponents, their staff, and supporters to a unity celebration in an effort to bring everyone together on election day.",
    "author": "Jacob Bliss",
    "title": "Georgia Republican Herschel Walker Invites GOP Opponents to Unity Celebration on Primary Day"
  },
  {
    "id": 7564,
    "mediaId": 157,
    "date": "5/17/2022 12:00:00 AM",
    "sentence": "In a teaser for an ABC \"Nightline \" report on the next seven days of GOP primaries that could dictate the fate of both the Senate and the House of Representatives, Republicans in Georgia express dismay at the inevitability that they will be saddled with former football player <span class='selected-term'>Herschel Walker</span> as their nominee for an obtainable Senate seat.",
    "author": "Tom Boggioni",
    "title": "'It's going to be a tough day': Georgia Republicans concerned over Herschel Walker's Senate run"
  },
  {
    "id": 7486,
    "mediaId": 136,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Less than two months ago, State Agricultural Commissioner Gary Black was trailing former football star <span class='selected-term'>Herschel Walker</span> in the Republican Senate primary when he told a rally in Putnam County that he didn't think there was any chance Walker could beat incumbent Democrat Raphael Warnock in the fall.",
    "author": "Bill Powell",
    "title": "Why Did It Take the GOP So Long to Panic About Herschel Walker?"
  },
  {
    "id": 7424,
    "mediaId": 223,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Source: AP Photo/Ben Gray\nLess than an hour after the polls closed in Georgia on Tuesday night, former NFL player <span class='selected-term'>Herschel Walker</span>, who was endorsed by former President Donald Trump, was declared the winner in the Republican primary by Decision Desk Headquarters.",
    "author": "Rebecca Downs",
    "title": "Trump-Endorsed Herschel Walker Wins Georgia Senate Primary"
  },
  {
    "id": 7429,
    "mediaId": 21,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Appling\nAtkinson\nBacon\nBaker\nBaldwin\nBanks\nBarrow\nBartow\nBen Hill\nBerrien\nBibb\nBleckley\nBrantley\nBrooks\nBryan\nBulloch\nBurke\nButts\nCalhoun\nCamden\nGeorgia US Senate Republican Primary\nCounty Results\narrow_drop_down\nCandidate\nVotes\nPercent\n Gary Black\n 0\n 0%\n Josh Clark\n 0\n 0%\n Kelvin King\n 0\n 0%\n Latham Saddler\n 0\n 0%\n <span class='selected-term'>Herschel Walker</span>\n 0\n 0%\n Show More Candidates\n* = Incumbent\n 0 votes.",
    "author": "Grace Panetta",
    "title": "RESULTS: Trump-backed Herschel Walker vies for the GOP nomination for Senate in Georgia"
  },
  {
    "id": 7471,
    "mediaId": 19,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump-backed Georgia Republican <span class='selected-term'>Herschel Walker</span>, a former NFL running back and Heisman Trophy winner, won his party primary for the U.S. Senate according to the Associated Press, which called the race at 7:56 p.m. E.T.",
    "author": "Jacob Bliss",
    "title": "Herschel Walker Clinches Georgias U.S. Senate Republican Primary"
  },
  {
    "id": 7406,
    "mediaId": 147,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA (AP)  Football great <span class='selected-term'>Herschel Walker</span>, endorsed by former President Donald Trump, won Georgias GOP Senate primary.",
    "author": "Associated Press",
    "title": "Trump pick Herschel Walker wins Georgias Republican Senate primary"
  }
]