[
  {
    "id": 7614,
    "mediaId": 1576,
    "date": "2022-00-04",
    "sentence": "Tuesdays debate among Georgia Republican Senate candidates was predictably defined by the man who wasnt there  <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Georgia GOP Senate debate focuses on Herschel Walker absence",
    "sentiment": "-0.949"
  },
  {
    "id": 7615,
    "mediaId": 12,
    "date": "2022-00-04",
    "sentence": "Missing from the stage was GOP front-runner <span class='selected-term'>Herschel Walker</span>, a former football star who was instead hosting a fundraiser in east Georgia while his rivals mocked him as a coward for skipping the event.",
    "author": "Greg Bluestein",
    "title": "A Senate GOP debate without Herschel Walker highlights new abortion clash",
    "sentiment": "-0.927"
  },
  {
    "id": 7812,
    "mediaId": 43,
    "date": "2022-00-11",
    "sentence": "By him going out, giving up all the energy, now we're not energy independent anymore, which started the whole downfall\" -- <span class='selected-term'>Herschel Walker</span>'s analysis of energy policy doesn't show a grasp of details or really anything at all pic.twitter.com/WR5GkqS8ma\n Aaron Rupar (@atrupar) April 10, 2022\nMeanwhile, although Walker was more than willing to chat up Fox News Maria Bartiromo Sunday morning, he skipped out on the first major GOP Senate debate on Saturday.",
    "author": "Rebekah Sager",
    "title": "Herschel Walker's financial reporting 'may raise questions for voters,' expert says",
    "sentiment": "-0.753"
  },
  {
    "id": 7662,
    "mediaId": 43,
    "date": "2022-00-28",
    "sentence": "RELATED STORY: No big shocker to learn that <span class='selected-term'>Herschel Walker</span> hawked 'dry mist' spray to 'clean' you of COVID-19\nAS reported by the AJC, when Aloe-Lu-Ya failed, Walker rebranded through another company with a plant extract drink called Sunutra.",
    "author": "Rebekah Sager\nDaily Kos Staff",
    "title": "Herschel Walker didnt just hawk",
    "sentiment": "-0.211"
  }
]