[
  {
    "id": 8278,
    "mediaId": 238,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "As the coronavirus was sweeping across the United States last summer and the country was still without a vaccine, Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> promoted a mist that he claimed would kill any covid on your body.",
    "author": "",
    "title": "Georgia Senate candidate Herschel Walker promoted a mist that he claimed would kill any covid on your body"
  },
  {
    "id": 8230,
    "mediaId": 19,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "In the poll, 872 registered Georgia voters were asked: If the election were held today and the candidates for U.S. Senate were Democrat Raphael Warnock and Republican <span class='selected-term'>Herschel Walker</span>, who would you vote for?",
    "author": "Warner Todd Huston",
    "title": "Poll: Herschel Walker Holds 3-Point lead over Warnock in Georgia Senate Race"
  },
  {
    "id": 8214,
    "mediaId": 21,
    "date": "1/28/2022 12:00:00 AM",
    "sentence": "",
    "author": "Brent D. Griffiths",
    "title": "Herschel Walker says it's 'totally unfair' to ask him if he supports the bipartisan infrastructure bill that passed last year: 'I have to see all the facts'"
  },
  {
    "id": 8184,
    "mediaId": 19,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "Georgia Republicans are solidly united behind <span class='selected-term'>Herschel Walker</span>, and 34N22s focus is on sharing Herschels background as a political outsider, successful job creator, and consensus builder with independent and swing voters who will decide this election, Lawson said in a statement.",
    "author": "Ashley Oliver",
    "title": "Exclusive  Watch: Herschel Walker Ad Recalls Georgia Football Legends Small-Town Roots"
  },
  {
    "id": 8165,
    "mediaId": 558,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Georgia Senate Walker\nFILE - Former Georgia running back and Republican Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> attends a college football game between UAB and Georgia, Sept. 11, 2021, in Atlanta.",
    "author": "BRIAN SLODYSKO",
    "title": "Police records complicate Herschel Walker's recovery story"
  },
  {
    "id": 1314,
    "mediaId": 195,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> (R) says that he does not support either? Georgia Gov.",
    "author": "",
    "title": "Herschel Walker says he doesn't support 'either' Kemp or Perdue"
  },
  {
    "id": 7934,
    "mediaId": 63,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Topline\nRepublican Senate candidate <span class='selected-term'>Herschel Walker</span> said Thursday he wont comply with President Joe Bidens request that he resign from the Presidents Council on Sports, Nutrition and Fitness, even though federal law dictates that the former football star step down from the role and the White House already named his replacement.",
    "author": "Derek Saul",
    "title": "Georgia Senate Candidate Herschel Walker Refuses To Resign From Presidential Council"
  },
  {
    "id": 7837,
    "mediaId": 195,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Georgia Sen. Raphael Warnock (D) narrowly trails Republican <span class='selected-term'>Herschel Walker</span> in the Peach States marquee Senate race, according to a new The Hill/Emerson College poll.",
    "author": "Tal Axelrod",
    "title": "Herschel Walker leads Warnock in Georgia Senate race: poll"
  },
  {
    "id": 7838,
    "mediaId": 19,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> holds a narrow lead over incumbent Sen. Raphael Warnock (D-GA) in a hypothetical matchup in the race for U.S. Senate in Georgia, according to a poll published Wednesday.",
    "author": "Ashley Oliver",
    "title": "Poll: Herschel Walker Leads Raphael Warnock in Tight Georgia Senate Race"
  },
  {
    "id": 2153,
    "mediaId": 305,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Republican Senate candidate <span class='selected-term'>Herschel Walker</span>, the same one who claimed to have a COVID cure, is narrowly winning an early poll against Sen. Raphael Warnock (D-GA), according to The Hill.",
    "author": "Murjani Rawls",
    "title": "Herschel Walker Leads Raphael Warnock In Early Georgia Senate Poll"
  },
  {
    "id": 2155,
    "mediaId": 239,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> has surged ahead of Democratic Sen. Raphael Warnock in the high-profile Georgia U.S. Senate contest, according to a poll released Wednesday.",
    "author": "Valerie Richardson",
    "title": "Herschel Walker opens up lead over Raphael Warnock in Georgia Senate poll"
  },
  {
    "id": 7776,
    "mediaId": 165,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "The Associated Press reported last summer on exaggerated claims of financial success by <span class='selected-term'>Herschel Walker</span>, the Trump-endorsed Georgia Senate candidate.",
    "author": "William Vaillancourt",
    "title": "Herschel Walker Appears to Have Been Lying About His Business Record, Too"
  },
  {
    "id": 7739,
    "mediaId": 136,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "\"<span class='selected-term'>Herschel Walker</span> will never let you down,\" Trump said in a statement last year that declared his \"complete and total endorsement\" for the candidate, CNN reported.",
    "author": "Zoe Strozewski",
    "title": "Herschel Walker Is Betting Favorite to Win Georgia Senate Seat"
  },
  {
    "id": 7751,
    "mediaId": 1576,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Football icon and Georgia Republican <span class='selected-term'>Herschel Walker</span> said Friday that his U.S. Senate campaign had raised $5.5 million in the first three months of 2022, a big haul that is still dwarfed by the $13.6 million that Democratic incumbent Raphael Warnock raised in the same period.",
    "author": "",
    "title": "Walker raises $5.5M in Georgia Senate race, trailing Warnock"
  },
  {
    "id": 2026,
    "mediaId": 65,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "But the National Right to Life Committee is endorsing Republican Senate candidate <span class='selected-term'>Herschel Walker</span>, who has been outspoken in his support to outlaw abortion as he runs this year to challenge Democratic Sen. Raphael Warnock of Georgia in a crucial Senate showdown that could determine whether the GOP wins back the chamber's majority.",
    "author": "Paul Steinhauser",
    "title": "Georgia Senate race: Herschel Walker lands endorsement of leading anti-abortion group"
  },
  {
    "id": 7709,
    "mediaId": 195,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Georgia deserves a pro-life senator like <span class='selected-term'>Herschel Walker</span> who is committed to building a culture of life, Tobias said in the NRLCs endorsement announcement.",
    "author": "Natalie Prieb",
    "title": "National Right to Life endorses Herschel Walker"
  },
  {
    "id": 7701,
    "mediaId": 558,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "This follows his endorsement of Mehmet Oz in Pennsylvanias Senate Republican primary and <span class='selected-term'>Herschel Walker</span> in the Georgia Senate race.",
    "author": "Robert Reich",
    "title": "Were running out of time to hold Donald Trump accountable"
  },
  {
    "id": 7668,
    "mediaId": 237,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The microtargeting project, which is likely the most expansive and detailed survey conducted in Georgia so far this cycle, shows the dominant position that <span class='selected-term'>Herschel Walker</span> maintains over Raphael Warnock in the race for the U.S. Senate, Republican pollster Blaise Hazelwood wrote in a memorandum for 34N22, the super PAC supporting Walkers Senate bid.",
    "author": "David M. Drucker",
    "title": "GOP candidate Walker leads Democratic Sen. Warnock in Georgia Senate race: Poll"
  },
  {
    "id": 7629,
    "mediaId": 237,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "",
    "author": "Asher Notheis",
    "title": "Herschel Walker will skip second primary debate in Georgia Senate race"
  },
  {
    "id": 1704,
    "mediaId": 21,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "\"One of the problems also is if Brian Kemp gets in, I think it's going to be very, very hard for <span class='selected-term'>Herschel Walker</span> to win,\" the former president said.",
    "author": "John L. Dorman",
    "title": "Trump says it will be 'very hard' for Herschel Walker to win the Georgia Senate race if Brian Kemp is the GOP gubernatorial nominee"
  },
  {
    "id": 3312,
    "mediaId": 305,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "A recent round of polling shows that Sen. Raphael Warnock (D-GA) is looking at a close race, presuming GOP candidate <span class='selected-term'>Herschel Walker</span> wins the Republican nomination for the upcoming Georgia Senate race, according to Newsweek.",
    "author": "Murjani Rawls",
    "title": "Potential Warnock vs. Walker Georgia Senate Battle Shows It Could Be A Close Race"
  },
  {
    "id": 7537,
    "mediaId": 195,
    "date": "5/20/2022 12:00:00 AM",
    "sentence": "Georgia Senate candidate and former football star <span class='selected-term'>Herschel Walker</span> said Wednesday he supports abortion bans without any exceptions for rape, incest or the health of the mother.",
    "author": "Lexi Lonas",
    "title": "Herschel Walker says he wants total ban on abortion: Theres no exception in my mind"
  },
  {
    "id": 7424,
    "mediaId": 223,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Source: AP Photo/Ben Gray\nLess than an hour after the polls closed in Georgia on Tuesday night, former NFL player <span class='selected-term'>Herschel Walker</span>, who was endorsed by former President Donald Trump, was declared the winner in the Republican primary by Decision Desk Headquarters.",
    "author": "Rebecca Downs",
    "title": "Trump-Endorsed Herschel Walker Wins Georgia Senate Primary"
  },
  {
    "id": 7426,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> (R) declined to say on Tuesday if he voted for former Sen. David Perdue (R) or incumbent Gov.",
    "author": "Caroline Vakil",
    "title": "Walker declines to say if he backed Perdue or Kemp in Ga. gubernatorial primary"
  }
]