[
  {
    "id": 8128,
    "mediaId": 12,
    "date": "2/18/2022 12:00:00 AM",
    "sentence": "Brian Kemp is leveraging his office to strengthen his conservative credentials, <span class='selected-term'>Herschel Walker</span> is ignoring his Republican rivals in the U.S. Senate race and tempers are flaring under the Gold Dome.",
    "author": "Patricia Murphy",
    "title": "Politically Georgia: David Perdue calls in a favor from Donald Trump"
  },
  {
    "id": 5135,
    "mediaId": 12,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "In this episode of the Politically Georgia podcast, AJC political insiders Greg Bluestein and Patricia Murphy breakdown how the Democrat will use the $25 million hes amassed -- and how GOP frontrunner <span class='selected-term'>Herschel Walker</span> plans to respond.",
    "author": "Patricia Murphy",
    "title": "A tidal wave of cash hits Georgias Senate race"
  },
  {
    "id": 7698,
    "mediaId": 12,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Mallory Blount, an aide to GOP Senate frontrunner <span class='selected-term'>Herschel Walker</span>, said if this is your messaging strategy, youre already losing.",
    "author": "Greg Bluestein",
    "title": "A magician I am not. Warnock tests a different tone"
  },
  {
    "id": 4797,
    "mediaId": 157,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "And if theyre not voting for Brian Kemp, theyre not going to be able to vote for <span class='selected-term'>Herschel Walker</span>.?\nPer Bluestein, Kemp is fighting back, saying in a new statement, \"Governor Kemp is laser-focused on uniting Republicans on May 24th to make sure Stacey Abrams is never our governor or the next president.\"",
    "author": "Matthew Chapman",
    "title": "Trump tells Perdue tele-rally that Republicans will bomb in Georgia if Brian Kemp is re-nominated"
  },
  {
    "id": 7585,
    "mediaId": 19,
    "date": "5/9/2022 12:00:00 AM",
    "sentence": "Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span> appeared to acknowledge a possible blowout in the primary as he dominates in the polls and invited his GOP opponents, their staff, and supporters to a unity celebration in an effort to bring everyone together on election day.",
    "author": "Jacob Bliss",
    "title": "Georgia Republican Herschel Walker Invites GOP Opponents to Unity Celebration on Primary Day"
  }
]