[
  {
    "id": 7863,
    "mediaId": 43,
    "date": "2022-00-01",
    "sentence": "Friday, Apr 1, 2022  5:16:43 PM +00:00  Jeff Singer\nGA-Sen: Former football star <span class='selected-term'>Herschel Walker</span> has been the undisputed frontrunner for the Republican nomination to take on Democratic Sen. Raphael Warnock from the moment he entered the race in August, but now his intra-party critics are preparing to wage an expensive ad campaign to weaken him in ahead of the May 24 primary.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/1",
    "sentiment": "-0.993"
  },
  {
    "id": 1279,
    "mediaId": 19,
    "date": "2022-00-03",
    "sentence": "Usually, that signals a potential upset for the incumbent.?\nThe poll also weighed the primary field for the Senate race, which is poised to become an expensive battleground general election contest between incumbent Sen. Raphael Warnock (D-GA) and the leading Republican candidate, <span class='selected-term'>Herschel Walker</span>.",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Kemp Holds Lead over Perdue in Governor's Race; Herschel Walker Dominates Senate Primary",
    "sentiment": "0"
  },
  {
    "id": 3525,
    "mediaId": 157,
    "date": "2022-00-17",
    "sentence": "IN OTHER NEWS: 'It's going to be a tough day': Georgia Republicans concerned over <span class='selected-term'>Herschel Walker</span>'s Senate run\nThe Republican Party itself stood right beside him, having quietly invited white supremacists into their ranks in the 1970s with Nixons Southern Strategy?; doubled down on it in 1980 when Reagans first official campaign speech was in Mississippi where 3 civil rights workers were murdered; and approved of racism as an overt political strategy when they refused to ostracize Trump for his primary announcement that Mexicans were rapists and murderers.",
    "author": "Thom Hartmann",
    "title": "The Buffalo terrorist didn't shoot alone",
    "sentiment": "-0.212"
  },
  {
    "id": 8130,
    "mediaId": 43,
    "date": "2022-00-18",
    "sentence": "Then theres <span class='selected-term'>Herschel Walker</span>, gliding to the Georgia Senate nomination on Off-Brand Orbns endorsement, despite new police records shining fresh light on his extremely disturbing history of mental health issues, and domestic abuse.",
    "author": "",
    "title": "Welcome to the Bouncy Castle Insurrection (Everything is Very Stupid)",
    "sentiment": "0"
  },
  {
    "id": 7420,
    "mediaId": 1546,
    "date": "2022-00-24",
    "sentence": "In a reminder of the issue's divisiveness, Biden's call for gun control on Tuesday was booed at a campaign event in Georgia hosted by <span class='selected-term'>Herschel Walker</span>, a Republican running for U.S. Senate.",
    "author": "Associated Press",
    "title": "Biden Says 'We Have to Act' After Texas School Shooting",
    "sentiment": "0"
  },
  {
    "id": 7875,
    "mediaId": 151,
    "date": "2022-00-29",
    "sentence": "Theres no upside to debate, said Jason Shepherd, the chair of the Republican Party in Cobb County, Ga., if youre someone like <span class='selected-term'>Herschel Walker</span> who is already the frontrunner  and has no experience debating.",
    "author": "",
    "title": "Debate-dodging takes off in midterm campaigns",
    "sentiment": "-0.76"
  },
  {
    "id": 7873,
    "mediaId": 43,
    "date": "2022-00-30",
    "sentence": "Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span> has been dodging debates, and given Walker's current campaigning there's no mystery there, either.",
    "author": "",
    "title": "Republicans begin to abandon debates, just as they've abandoned moderates (and common sense)",
    "sentiment": "-0.695"
  }
]