[
  {
    "id": 6313,
    "mediaId": 151,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Thats three times as much money as GOP primary frontrunner <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "5 numbers to know from the new FEC reports"
  },
  {
    "id": 7488,
    "mediaId": 151,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "PAPER TRAIL  <span class='selected-term'>Herschel Walker</span>s ties to veterans program face scrutiny, by the Associated Press Brian Slodysko and Jeff Amy: Herschel Walker, the football legend and leading Republican Senate candidate in Georgia, often boasts of his work helping service members and veterans struggling with mental health.",
    "author": "",
    "title": "7 big 2022 midterm questions to answer this week"
  },
  {
    "id": 7507,
    "mediaId": 238,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trumps political clout will also be tested in two other races: the Senate contest where ex-NFL star <span class='selected-term'>Herschel Walker</span> is expected to win the GOP nod to face Sen. Raphael G. Warnock (D); and the secretary of state race between Brad Raffensperger and Trumps pick, Rep. Jody Hice (R).",
    "author": "Theodoric Meyer",
    "title": "Tuesday's primary fights could be the latest sign of Blue Dogs' waning influence"
  },
  {
    "id": 7308,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Of course, theres one win that Trump can count on Tuesday: former NFL star <span class='selected-term'>Herschel Walker</span>, whos seen as the heavy favorite to clinch the GOP nod to take on Sen. Raphael Warnock (D-Ga.) this fall.",
    "author": "Max Greenwood",
    "title": "Five things to watch in the Georgia, Alabama primaries"
  },
  {
    "id": 7313,
    "mediaId": 129,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "This week, Georgia will also kick off one of the countrys most important Senate elections, between Senator Raphael Warnock, a Democrat running for re-election, and <span class='selected-term'>Herschel Walker</span>, a Republican backed by Mr. Trump who is widely expected to cruise to victory in his partys primary.",
    "author": "",
    "title": "What to Watch For in Todays Elections in Georgia and Beyond"
  },
  {
    "id": 7421,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "1 hr ago 20:03 PM EDT\nTrump-backed Hershel Walker wins Senate Primary in Georgia\n<span class='selected-term'>Herschel Walker</span> will win the Georgia Republican primary for Senate.",
    "author": "Jake Thomas",
    "title": "Primary Live Updates: Sarah Huckabee Sanders Wins Arkansas Governor Primary"
  },
  {
    "id": 7428,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In the race for Senate in Georgia, former football star <span class='selected-term'>Herschel Walker</span> is expected to win the Republican primary, despite allegations of past violent behavior with women.",
    "author": "Isabel Martins",
    "title": "Primary Election Results for Georgia, Texas, Alabama and Other States"
  },
  {
    "id": 7437,
    "mediaId": 223,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Also in Georgia, we'll be keeping an eye on the crowded GOP Senate primary in which Trump-endorsed former NFL player <span class='selected-term'>Herschel Walker</span> is expected to win his primary against Georgia Agriculture Commissioner Gary Black, former state Representative Josh Clark, and a hat-trick of American heroes: former Navy Seal Latham Saddler, U.S. Air Force veteran Kelvin King, and former U.S. Army Special Forces brigadier general Jonathan McColumn.",
    "author": "Spencer Brown",
    "title": "Here's What to Expect in the Texas Runoffs and Races in Georgia, Alabama, and Arkansas"
  },
  {
    "id": 7439,
    "mediaId": 238,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "This Republican primary is crowded, but former football star <span class='selected-term'>Herschel Walker</span> is expected to win easily.",
    "author": "Amber Phillips",
    "title": "Seven primaries to watch Tuesday, while all eyes are on Georgia"
  },
  {
    "id": 7331,
    "mediaId": 238,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Trump notched an expected win in Georgia's Republican primary for U.S. Senate, where former NFL star <span class='selected-term'>Herschel Walker</span> won.",
    "author": "David Weigel",
    "title": "Kemp, Raffensperger win in blow to Trump and his false election claims"
  },
  {
    "id": 7357,
    "mediaId": 151,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Trump was not without victories  most significantly <span class='selected-term'>Herschel Walker</span> in the U.S. Senate primary.",
    "author": "",
    "title": "Trump flops in Georgia: 5 takeaways from a big primary night"
  },
  {
    "id": 7372,
    "mediaId": 151,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Republicans in two deep-red states are also voting in major Senate contests, while Trump-endorsed <span class='selected-term'>Herschel Walker</span> is looking to sew up the nomination for the battleground race in Georgia.",
    "author": "",
    "title": "Kemp notches huge primary win in Georgia"
  }
]