[
  {
    "id": 8342,
    "mediaId": 12,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> has spent the opening months on the campaign trail speaking mostly to conservative media outlets that offered him friendly questions.",
    "author": "Tia Mitchell",
    "title": "The Jolt: The Cobb homage to treason planned for Jan. 6"
  },
  {
    "id": 8262,
    "mediaId": 12,
    "date": "1/20/2022 12:00:00 AM",
    "sentence": "",
    "author": "Greg Bluestein",
    "title": "Walker has limited public campaign stops, but hes profited from private events"
  },
  {
    "id": 8212,
    "mediaId": 120,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "After <span class='selected-term'>Herschel Walker</span> moved to Georgia to launch a Republican U.S. Senate campaign, his team didn't seem especially eager about sending him out on the campaign trail.",
    "author": "Steve Benen",
    "title": "How many times can Herschel Walker fumble before he's benched?"
  },
  {
    "id": 8150,
    "mediaId": 43,
    "date": "2/12/2022 12:00:00 AM",
    "sentence": "He easily outdid <span class='selected-term'>Herschel Walker</span>, his top Republican rival, whose $5.4 million haul was the most of any GOP Senate challenger in the nation.",
    "author": "",
    "title": "Words of Wisdom from the Late John Lewis: Saturday's Good News"
  },
  {
    "id": 7995,
    "mediaId": 120,
    "date": "3/17/2022 12:00:00 AM",
    "sentence": "It was deeply unfortunate when <span class='selected-term'>Herschel Walker</span>, during a church appearance last weekend, suggested that the existence of apes disproves evolutionary biology.",
    "author": "Steve Benen",
    "title": "Herschel Walker appeared to question in vitro fertilization, too"
  },
  {
    "id": 7844,
    "mediaId": 120,
    "date": "4/4/2022 12:00:00 AM",
    "sentence": "After retiring from professional athletics, <span class='selected-term'>Herschel Walker</span> has held a handful of different jobs, including working as a paid motivational speaker.",
    "author": "Steve Benen",
    "title": "Herschel Walkers latest fumble is over his education"
  },
  {
    "id": 7792,
    "mediaId": 120,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "Former athlete <span class='selected-term'>Herschel Walker</span>, of course, was the only contender who refused to show up.",
    "author": "Steve Benen",
    "title": "Why Herschel Walkers fumble on energy policy matters"
  },
  {
    "id": 7788,
    "mediaId": 43,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "RELATED STORY: <span class='selected-term'>Herschel Walker</span>'s financial reporting 'may raise questions for voters,' expert says\nWalker has made mind-numbing missteps, such as referring to the late Rep. John Lewis as a senator, even implying that Lewis wouldnt have supported the bill named in his honor.",
    "author": "Rebekah Sager",
    "title": "Former NFL star, current Senate candidate Herschel Walker gets new coaches: McConnell, Cruz, Trump"
  },
  {
    "id": 7764,
    "mediaId": 120,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Its no secret that <span class='selected-term'>Herschel Walker</span> is running for the U.S. Senate despite not having any background in politics, policy, governing, or elected office.",
    "author": "Steve Benen",
    "title": "Herschel Walkers business claims seem divorced from the truth"
  },
  {
    "id": 7634,
    "mediaId": 1576,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "And on Tuesday, <span class='selected-term'>Herschel Walker</span> is expected to miss a second debate against his Republican rivals for a crucial U.S. Senate seat after skipping the first one.",
    "author": "",
    "title": "Candidates test skipping debates without upsetting voters"
  },
  {
    "id": 7525,
    "mediaId": 178,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "But there are many, many other reasons, I think, to be concerned about <span class='selected-term'>Herschel Walker</span> as a Senate candidate.''",
    "author": "",
    "title": "Herschel Walker: From football stardom to troubling Senate candidate"
  }
]