[
  {
    "id": 8183,
    "mediaId": 43,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "(Breaking: Glorious <span class='selected-term'>Herschel Walker</span> Wins 99 Percent Of Vote In Victory Over Raphael Warnock in Georgia Senate Race!)",
    "author": "Bill",
    "title": "Cheers and Jeers: Tuesday"
  },
  {
    "id": 8125,
    "mediaId": 65,
    "date": "2/21/2022 12:00:00 AM",
    "sentence": "The Generals were able to bring in the high-profile running backs <span class='selected-term'>Herschel Walker</span> and Mike Rozier, as well as quarterback Doug Flutie, into the league in one of the most shocking moves in the brief battle between the NFL and USFL.",
    "author": "Ryan Gaydos",
    "title": "Presidents Day: How US leaders fared in the sporting arena"
  },
  {
    "id": 7932,
    "mediaId": 112,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "President Joe Biden has axed <span class='selected-term'>Herschel Walker</span> and Dr. Mehmet Oz from advisory roles with the Presidents Council on Sports, Fitness & Nutrition due to their current candidacies for the U.S. Senate.",
    "author": "Charles Passy",
    "title": "Why President Biden fired Herschel Walker and Dr. Mehmet Oz from a federal fitness council"
  },
  {
    "id": 7897,
    "mediaId": 43,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "Kid Rock says that Trump asked him for advice on handling North Korea\n 18%\n88 votes\nRussian airstrike in Ukraine causes heavy damage to an oil refinery owned by a Russian company\n 13%\n65 votes\nQ-Anon group says the wat in Ukraine is all [art of a plan to expose Biden's criminality so that JFK, who is disguied as Donald Trump, can assume the presidency\n 32%\n158 votes\nAfter capturing 117 Russian tanks, Ukraine now has more tanks than it did at the beginning of the war\n 25%\n122 votes\n<span class='selected-term'>Herschel Walker</span> demands that schools stop teaching \"CTR\"\n 13%\n64 votes",
    "author": "",
    "title": "Tweets of the Week March"
  }
]