[
  {
    "id": 8327,
    "mediaId": 43,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Those thrill of those triumphs was soon followed by a severe throttling of voting rights in Georgia, by the rise of Marjorie Taylor Green (she of the Jewish Space Lasers) and by the widespread Republican endorsement of <span class='selected-term'>Herschel Walker</span> as Warnocks 2022 opponent.",
    "author": "",
    "title": "our current voting rights threats"
  },
  {
    "id": 8260,
    "mediaId": 12,
    "date": "1/21/2022 12:00:00 AM",
    "sentence": "Hell face one of four Republicans, including <span class='selected-term'>Herschel Walker</span>, who have gotten into the GOP primary to challenge him.",
    "author": "Patricia Murphy",
    "title": "OPINION: Raphael Warnocks year of victories, defeats, and Senate prayers"
  },
  {
    "id": 8155,
    "mediaId": 558,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "ATLANTA (AP)  Republicans risk losing the U.S. Senate race if they nominate <span class='selected-term'>Herschel Walker</span>, two of Walker's rivals said, citing a report by The Associated Press about how police confiscated a gun from the former football great following a domestic dispute 20 years ago.",
    "author": "",
    "title": "Walker's past could let Warnock keep Senate seat, rivals say"
  },
  {
    "id": 8112,
    "mediaId": 12,
    "date": "2/24/2022 12:00:00 AM",
    "sentence": "The Florida compound will host back-to-back fundraisers in mid-March, along with a third <span class='selected-term'>Herschel Walker</span> event.",
    "author": "Greg Bluestein",
    "title": "The Jolt: Trump stepping up focus on Georgia candidates"
  },
  {
    "id": 8012,
    "mediaId": 12,
    "date": "3/16/2022 12:00:00 AM",
    "sentence": "The Huffington Post dug up footage of leading GOP Senate contender <span class='selected-term'>Herschel Walker</span> questioning the theory of evolution during a recent conversation with pastor Chuck Allen at Sugar Hill Church.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Washington marks anniversary of Atlanta spa shootings"
  },
  {
    "id": 7904,
    "mediaId": 12,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Trump also wants to boost former Georgia football star <span class='selected-term'>Herschel Walker</span>, the Republican frontrunner in the race for U.S. Senate who is already looking ahead to a matchup against Democratic incumbent Raphael Warnock.",
    "author": "Greg Bluestein",
    "title": "Perdue welcomes Trump to Georgia by embracing stolen election lie"
  },
  {
    "id": 7878,
    "mediaId": 43,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Watch Herschel Walker's (R) Embarrassingly Idiotic Gaffe About Critical Race Theory"
  },
  {
    "id": 7837,
    "mediaId": 195,
    "date": "4/6/2022 12:00:00 AM",
    "sentence": "Georgia Sen. Raphael Warnock (D) narrowly trails Republican <span class='selected-term'>Herschel Walker</span> in the Peach States marquee Senate race, according to a new The Hill/Emerson College poll.",
    "author": "Tal Axelrod",
    "title": "Herschel Walker leads Warnock in Georgia Senate race: poll"
  },
  {
    "id": 7818,
    "mediaId": 195,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "Warnock is anticipated to run against former football star <span class='selected-term'>Herschel Walker</span> in a race that will see millions of dollars spent on the campaign trail to gain even the slightest edge.",
    "author": "Tal Axelrod",
    "title": "Warnock grapples with strong headwinds in Georgia"
  },
  {
    "id": 7765,
    "mediaId": 237,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "The numbers reflect the high-stakes nature of the Senate race between Warnock and his likely Republican opponent, former University of Georgia football star <span class='selected-term'>Herschel Walker</span>.",
    "author": "Cami Mondeaux",
    "title": "Sen. Warnock has over $25 million in the bank for fight against GOP rival Walker"
  },
  {
    "id": 7772,
    "mediaId": 239,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> is the frontrunner among six GOP candidates in the May 24 primary.",
    "author": "Jeff Amy",
    "title": "Georgias Sen. Warnock raises $13.6M in 2022s first quarter"
  },
  {
    "id": 7773,
    "mediaId": 1576,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> is the frontrunner among six GOP candidates in the May 24 primary.",
    "author": "",
    "title": "Georgia's Sen. Warnock raises $13.6M in 2022's first quarter"
  },
  {
    "id": 6387,
    "mediaId": 195,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "This time around, some Republicans are raising eyebrows again when they look toward Georgia, where Trump has backed former football star <span class='selected-term'>Herschel Walker</span> in the GOP Senate primary to take on Warnock.",
    "author": "Niall Stanage",
    "title": "The Memo: Democrats hope Trump will save them from midterm disaster"
  },
  {
    "id": 7745,
    "mediaId": 305,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Senate candidate <span class='selected-term'>Herschel Walker</span> skipped the first major Republican debate with less than a month until early voting begins in the Georgia primariesmostly sticking to controlled appearances and rallies.",
    "author": "Murjani Rawls",
    "title": "The Republican National Committee's Decision to Withdraw From Future Debates Is No Big Surprise"
  },
  {
    "id": 7751,
    "mediaId": 1576,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Football icon and Georgia Republican <span class='selected-term'>Herschel Walker</span> said Friday that his U.S. Senate campaign had raised $5.5 million in the first three months of 2022, a big haul that is still dwarfed by the $13.6 million that Democratic incumbent Raphael Warnock raised in the same period.",
    "author": "",
    "title": "Walker raises $5.5M in Georgia Senate race, trailing Warnock"
  },
  {
    "id": 3312,
    "mediaId": 305,
    "date": "5/13/2022 12:00:00 AM",
    "sentence": "A recent round of polling shows that Sen. Raphael Warnock (D-GA) is looking at a close race, presuming GOP candidate <span class='selected-term'>Herschel Walker</span> wins the Republican nomination for the upcoming Georgia Senate race, according to Newsweek.",
    "author": "Murjani Rawls",
    "title": "Potential Warnock vs. Walker Georgia Senate Battle Shows It Could Be A Close Race"
  },
  {
    "id": 7551,
    "mediaId": 233,
    "date": "5/19/2022 12:00:00 AM",
    "sentence": "Walker's college-aged son, Christian, is a popular conservative political commentator on social media platforms like Twitter and Twitter, where he often posts videos blasting liberal political views popular among Gen Z.\n<span class='selected-term'>Herschel Walker</span> vs. Raphael Warnock in the polls\nThe anticipated match up between Walker and Warnock is expected to be tight.",
    "author": "Orlando Mayorquin",
    "title": "Who is Herschel Walker? The former football star is running for Senate in Georgia as a Republican."
  },
  {
    "id": 7338,
    "mediaId": 25,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-f912f6e5</div>\n link copied\n5:40 PM\nGeorgia Senate Republican primary results\n<span class='selected-term'>Herschel Walker</span>, Gary Black, Kelvin King, Jonathan McColumn and Latham Saddler are running for the Republican nomination for U.S. Senate in Georgia.",
    "author": "",
    "title": "Primary results 2022: Georgia, Alabama, Arkansas, Texas runoff and Minnesota special election primary results"
  }
]