[
  {
    "id": 7765,
    "mediaId": 237,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "The numbers reflect the high-stakes nature of the Senate race between Warnock and his likely Republican opponent, former University of Georgia football star <span class='selected-term'>Herschel Walker</span>.",
    "author": "Cami Mondeaux",
    "title": "Sen. Warnock has over $25 million in the bank for fight against GOP rival Walker",
    "sentiment": "0"
  },
  {
    "id": 6155,
    "mediaId": 237,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "Polling averages have Georgia Democratic Sen. Raphael Warnock trailing Trump-endorsed <span class='selected-term'>Herschel Walker</span> in Georgia, with Hassan, Sen. Mark Kelly of Arizona, and Sen. Catherine Cortez Masto of Nevada all in competitive races.",
    "author": "Christian Datoc",
    "title": "Biden thinks Democrats can gain Senate seats this year  with Trump's help",
    "sentiment": "0"
  },
  {
    "id": 7665,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Democratic Senator Raphael Warnock of Georgia was trailing Republican challenger <span class='selected-term'>Herschel Walker</span> in an Emerson College poll conducted from April 1 to 3.",
    "author": "Darragh Roche",
    "title": "Democrats' Midterm Chances Dwindling as Republicans Gain Strength: Polls",
    "sentiment": "0.17"
  },
  {
    "id": 4797,
    "mediaId": 157,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "And if theyre not voting for Brian Kemp, theyre not going to be able to vote for <span class='selected-term'>Herschel Walker</span>.?\nPer Bluestein, Kemp is fighting back, saying in a new statement, \"Governor Kemp is laser-focused on uniting Republicans on May 24th to make sure Stacey Abrams is never our governor or the next president.\"",
    "author": "Matthew Chapman",
    "title": "Trump tells Perdue tele-rally that Republicans will bomb in Georgia if Brian Kemp is re-nominated",
    "sentiment": "-0.752"
  },
  {
    "id": 5764,
    "mediaId": 237,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "But that could change next year with Trump-endorsed candidates such as <span class='selected-term'>Herschel Walker</span> in Georgia running in the midterm elections this November.",
    "author": "Daniel Chaitin",
    "title": "'Long arm of Donald Trump' encircles Mitch McConnell in Senate",
    "sentiment": "0.318"
  },
  {
    "id": 7420,
    "mediaId": 1546,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In a reminder of the issue's divisiveness, Biden's call for gun control on Tuesday was booed at a campaign event in Georgia hosted by <span class='selected-term'>Herschel Walker</span>, a Republican running for U.S. Senate.",
    "author": "Associated Press",
    "title": "Biden Says 'We Have to Act' After Texas School Shooting",
    "sentiment": "0"
  },
  {
    "id": 8741,
    "mediaId": 195,
    "date": "5/31/2022 12:00:00 AM",
    "sentence": "Warnock, who won in a special election in 2021, is running for a full term of his own this year against former football star <span class='selected-term'>Herschel Walker</span>, and former state House Minority Leader Stacey Abrams is trying to unseat Gov.",
    "author": "Max Greenwood",
    "title": "Campaign Report  Biden confronts his most serious midterm issue",
    "sentiment": "0"
  }
]