[
  {
    "id": 8272,
    "mediaId": 1576,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "The only other Georgian to speak during primetime was <span class='selected-term'>Herschel Walker</span>, the former University of Georgia and professional football player, a longtime friend of Trumps, who also strongly defended him.",
    "author": "",
    "title": "Georgians At The RNC: An Entirely Different Republican Strategy"
  },
  {
    "id": 8122,
    "mediaId": 12,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "A spokeswoman for <span class='selected-term'>Herschel Walker</span> blamed Warnock and President Joe Biden for inflationary pressures driving up the prices across the economy.",
    "author": "Patricia Murphy",
    "title": "OPINION: The radical liberal Raphael Warnock we were warned about has not materialized"
  },
  {
    "id": 7966,
    "mediaId": 43,
    "date": "3/23/2022 12:00:00 AM",
    "sentence": "If the election were today, Senator Warnock could be destined for defeat against Football Star <span class='selected-term'>Herschel Walker</span>, the almost certain nominee for the GOP.",
    "author": "",
    "title": "Can Raphael Warnock win Georgia a Second Time?"
  },
  {
    "id": 2155,
    "mediaId": 239,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> has surged ahead of Democratic Sen. Raphael Warnock in the high-profile Georgia U.S. Senate contest, according to a poll released Wednesday.",
    "author": "Valerie Richardson",
    "title": "Herschel Walker opens up lead over Raphael Warnock in Georgia Senate poll"
  },
  {
    "id": 7767,
    "mediaId": 237,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Warnock, who was found trailing GOP challenger <span class='selected-term'>Herschel Walker</span> in a recent poll, asked the Fulton County court jointly with his ex-wife Ouleye Ndoye to make the records of their divorce and custody battle over their two children unavailable to the public.",
    "author": "Virginia Aabram",
    "title": "Embattled Democratic Sen. Warnock and ex-wife file to seal custody battle record"
  },
  {
    "id": 7768,
    "mediaId": 12,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span>, the GOP frontrunner, ended 2021 with roughly $5 million in the bank.",
    "author": "Greg Bluestein",
    "title": "Warnock sets another fundraising record, ends quarter with $25.6M in the bank"
  },
  {
    "id": 2026,
    "mediaId": 65,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "But the National Right to Life Committee is endorsing Republican Senate candidate <span class='selected-term'>Herschel Walker</span>, who has been outspoken in his support to outlaw abortion as he runs this year to challenge Democratic Sen. Raphael Warnock of Georgia in a crucial Senate showdown that could determine whether the GOP wins back the chamber's majority.",
    "author": "Paul Steinhauser",
    "title": "Georgia Senate race: Herschel Walker lands endorsement of leading anti-abortion group"
  },
  {
    "id": 7668,
    "mediaId": 237,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The microtargeting project, which is likely the most expansive and detailed survey conducted in Georgia so far this cycle, shows the dominant position that <span class='selected-term'>Herschel Walker</span> maintains over Raphael Warnock in the race for the U.S. Senate, Republican pollster Blaise Hazelwood wrote in a memorandum for 34N22, the super PAC supporting Walkers Senate bid.",
    "author": "David M. Drucker",
    "title": "GOP candidate Walker leads Democratic Sen. Warnock in Georgia Senate race: Poll"
  },
  {
    "id": 7572,
    "mediaId": 136,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "Democratic Senator Raphael Warnock looks as if he's headed for a tough race to defend his Georgia seat against GOP contender <span class='selected-term'>Herschel Walker</span> in November's midterm.",
    "author": "Jason Lemon",
    "title": "Raphael Warnock's Chances of Beating Herschel Walker, According to Polls"
  },
  {
    "id": 7411,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Hes expected to face former NFL player <span class='selected-term'>Herschel Walker</span> in the general election.",
    "author": "Max Greenwood",
    "title": "Warnock easily secures Democratic Senate nomination in Georgia"
  },
  {
    "id": 7451,
    "mediaId": 1576,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Democratic U.S. Sen. Raphael Warnock will face Republican football legend <span class='selected-term'>Herschel Walker</span> for a coveted Senate seat in Georgia after both handily defeated primary challengers on Tuesday to set up a historic, high-stakes showdown.",
    "author": "",
    "title": "Georgia US Senate race will pit Warnock against Walker"
  }
]