[
  {
    "id": 8140,
    "mediaId": 147,
    "date": "d2022-02-14T23:35",
    "sentence": "And what it  so far, someone like that <span class='selected-term'>Herschel Walker</span> in Georgia got a Trump endorsement and has been raising money blockbuster, even though he wouldn't have necessarily been the most obvious choice as a candidate.",
    "author": "",
    "title": "Tamara Keith and Amy Walter on the Supreme Court vacancy, the fight for control of the GOP",
    "sentiment": "0.0"
  },
  {
    "id": 7943,
    "mediaId": 65,
    "date": "d2022-03-24T07:58",
    "sentence": "RESIGNATIONS SOUGHT - President Biden requested two members of the President's Council on Sports, Fitness & Nutrition, <span class='selected-term'>Herschel Walker</span> and Dr. Mehmet Oz, who were appointed by former President Trump, either step down or face termination amid their U.S. Senate runs in Georgia and Pennsylvania.",
    "author": "",
    "title": "Biden demands Dr. Oz, Herschel Walker resign; The spies among us -- one former spy speaks out",
    "sentiment": "-0.17"
  },
  {
    "id": 7931,
    "mediaId": 233,
    "date": "d2022-03-24T21:03",
    "sentence": "The White House sent letters to Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span>, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, according to reports by several media outlets.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: Should Russia be kicked out of the G-20?",
    "sentiment": "0"
  },
  {
    "id": 7930,
    "mediaId": 233,
    "date": "d2022-03-24T21:52",
    "sentence": "Biden to Mehmet Oz, <span class='selected-term'>Herschel Walker</span>: Resign or be fired from presidential board.",
    "author": "Nicole Fallert",
    "title": "100,000 refugees",
    "sentiment": "0.0"
  },
  {
    "id": 7925,
    "mediaId": 43,
    "date": "d2022-03-25T00:00",
    "sentence": "Current candidates like <span class='selected-term'>Herschel Walker</span>?",
    "author": "",
    "title": "Mark Foley. Dennis Hastert. Matt Gaetz. And Republicans want to pontificate about morals?",
    "sentiment": "0.0"
  },
  {
    "id": 7899,
    "mediaId": 43,
    "date": "d2022-03-27T00:00",
    "sentence": "Senate candidate Dr. Mehmet Oz, angering conservatives for saying hell keep dual US-Turkish citizenship, then fired (along w/<span class='selected-term'>Herschel Walker</span>) from the presidential fitness council for possible Hatch violations as active candidates\n Kanye West, getting a temporary Instagram suspension for bullying after posting a racial slur directed at talk-show host Trevor Noah after Noah addressed West's treatment of his ex-wife Kim Kardashian and her boyfriend, Pete Davidson\n Juan Gerardo Trevio El Huevo (The Egg), leader of the Northeast Cartel (a drug gang) and Troops of Hell (a band of assassins) by Mexican authorities and extradited to the US\n Two-time failed gubernatorial candidate Eliot Cutler (I-ME), arrested on four counts of possessing child pornography\n Ginni Thomas, sending numerous text messages to Mark Meadows urging that he pursue efforts to overturn the 2020 election\n Kentucky county clerk Kim Davis, as a federal judge ruled on Friday she violated two same-sex couples' constitutional rights when she refused to marry them back in 2015\n Ted Cruz, first having police called on him at a Montana airport over being irate that he missed his flight, then under fire for his racist/sexist questioning of judge Ketanji Brown Jackson at Senate hearings\n \"Cowboys for Trump\" leader Couy Griffin, convicted of trespassing on January 6th, now facing a lawsuit to have his post as a New Mexico county commissioner stripped\n Paul Manafort, removed from a plane at Miami International Airport (before it took off for Dubai) because he carried a revoked passport\n Rep. Mo Brooks (R-AL), having his Trump endorsement revoked due to low poll numbers and failing to insist 45 can be re-instated\n Lt. Gov.",
    "author": "",
    "title": "Odds & Ends: News/Humor (with a \"Who Lost the Week?\" poll)",
    "sentiment": "0.0"
  },
  {
    "id": 5441,
    "mediaId": 124,
    "date": "d2022-03-28T12:47:54",
    "sentence": "Brian Kemp, and Senate hopeful <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Midterm environment looks more like 2010 than 2018 in NBC News poll",
    "sentiment": "0.0"
  },
  {
    "id": 7839,
    "mediaId": 43,
    "date": "d2022-04-06T00:00",
    "sentence": "A bunch of Republicans in Georgia trying to defeat <span class='selected-term'>Herschel Walker</span> because hes kind of a damaged candidate.",
    "author": "",
    "title": "This week on The Brief: Crucial statehouse races & how Democrats can strengthen their messaging",
    "sentiment": "0.0"
  },
  {
    "id": 7833,
    "mediaId": 43,
    "date": "d2022-04-07T00:00",
    "sentence": "From Empty Greene to <span class='selected-term'>Herschel Walker</span> to Rick Scott.",
    "author": "",
    "title": "Everybody Knows",
    "sentiment": "0.0"
  },
  {
    "id": 7796,
    "mediaId": 43,
    "date": "d2022-04-12T00:00",
    "sentence": "I didnt choose a top picture for this commentary of <span class='selected-term'>Herschel Walker</span>, Tim Scott, Clarence Thomas, or any of the other current quislings of color supported by the right, because even looking at them makes me bilious.",
    "author": "",
    "title": "Black Kos, Tuesdays Chile: All my skinfolk aint my kinfolk We see you Thomas, Scott, and Walker.",
    "sentiment": "-0.858"
  },
  {
    "id": 7726,
    "mediaId": 237,
    "date": "d2022-04-18T12:13",
    "sentence": "Thomas appeared to be in good spirits earlier this month when he met Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> in his first quasipublic appearance since leaving the hospital.",
    "author": "Kaelan Deese",
    "title": "Clarence Thomas resumes hearing oral arguments after absence from Supreme Court",
    "sentiment": "0"
  }
]