[
  {
    "id": 8097,
    "mediaId": 12,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> pulled out of a weekend event organized by U.S. Rep. Marjorie Taylor Greene after she spoke at a white nationalist rally where attendees cheered Russias invasion of Ukraine and chanted Vladimir Putins name.",
    "author": "Greg Bluestein",
    "title": "Walker wont go to Marjorie Taylor Greene event after she spoke at pro-Putin rally"
  },
  {
    "id": 8087,
    "mediaId": 129,
    "date": "3/3/2022 12:00:00 AM",
    "sentence": "Another Democratic political operation, American Bridge, is tying Ms. Greene to <span class='selected-term'>Herschel Walker</span>, the former University of Georgia football star recruited by Mr. Trump to challenge Senator Raphael Warnock, Democrat of Georgia, this fall.",
    "author": "",
    "title": "In Greene and Boebert, Democrats See a Helpful Political Target"
  },
  {
    "id": 7853,
    "mediaId": 43,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "GOP Senate Hopeful Peddled False Claims About His Education for Years\nA CNN report found that <span class='selected-term'>Herschel Walker</span>a Republican candidate for the U.S. Senate in Georgiarepeatedly made false statements when he said he graduated in the top 1 percent of his class at the University of Georgia, including as recently as 2017.",
    "author": "",
    "title": "Republicans in Disarray: Saturday's Good News"
  },
  {
    "id": 5260,
    "mediaId": 129,
    "date": "4/7/2022 12:00:00 AM",
    "sentence": "Youre seeing this in other places, with <span class='selected-term'>Herschel Walker</span> or something like that where, yes, Mitch McConnell has said that hes got his support, but there is some concern, I think, on the ground that that could be another losing race.",
    "author": "",
    "title": "Four Opinion Writers on How the G.O.P. Fringe Took Over American Politics"
  },
  {
    "id": 7819,
    "mediaId": 195,
    "date": "4/9/2022 12:00:00 AM",
    "sentence": "Fox News Sunday  White House press secretary Jen Psaki; Sen. Mitch McConnell (R-Ky.)\nFox News Sunday Morning Futures  Ranking member of House Judiciary Committee Rep. Jim Jordan (R-Ohio); <span class='selected-term'>Herschel Walker</span>, Georgia Senate candidate; House Minority Leader Rep. Kevin Mccarthy (R-Calif.); U.S. Army combat veteran and Florida Congressional candidate Cory Mills.",
    "author": "Lexi Lonas",
    "title": "Sunday shows preview: Ukraine, West condemn Russian attacks on civilians"
  },
  {
    "id": 6196,
    "mediaId": 195,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "He has endorsed a number of a candidates in GOP Senate primaries who make the party establishment uneasy  former football star <span class='selected-term'>Herschel Walker</span> in Georgia, TV personality Mehmet Oz in Pennsylvania and author J.D.",
    "author": "Niall Stanage",
    "title": "The Memo: McCarthy furor underlines Trumps grip on GOP"
  },
  {
    "id": 7689,
    "mediaId": 129,
    "date": "4/23/2022 12:00:00 AM",
    "sentence": "It launched the pro careers of <span class='selected-term'>Herschel Walker</span> and Doug Flutie, and Donald Trump owned a team.",
    "author": "",
    "title": "Melissa Clarks Saturday Recipe"
  },
  {
    "id": 5764,
    "mediaId": 237,
    "date": "5/4/2022 12:00:00 AM",
    "sentence": "But that could change next year with Trump-endorsed candidates such as <span class='selected-term'>Herschel Walker</span> in Georgia running in the midterm elections this November.",
    "author": "Daniel Chaitin",
    "title": "'Long arm of Donald Trump' encircles Mitch McConnell in Senate"
  }
]