[
  {
    "id": 8098,
    "mediaId": 12,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "We wont be surprised if his dad schedules a trip to Georgia in the next few weeks to tout the five-candidate slate hes backing, a group that also includes Senate candidate <span class='selected-term'>Herschel Walker</span>.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Marjorie Taylor Greene to deliver America First response to Biden speech"
  },
  {
    "id": 7483,
    "mediaId": 147,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trumps candidate for U.S. Senate, football legend <span class='selected-term'>Herschel Walker</span>, appears to be cruising to the Republican nomination despite some GOP leaders warning that Walker will be unelectable in November against Democratic incumbent Raphael Warnock.",
    "author": "Jeff Amy",
    "title": "2022 Georgia Primary Election Results"
  },
  {
    "id": 7488,
    "mediaId": 151,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "PAPER TRAIL  <span class='selected-term'>Herschel Walker</span>s ties to veterans program face scrutiny, by the Associated Press Brian Slodysko and Jeff Amy: Herschel Walker, the football legend and leading Republican Senate candidate in Georgia, often boasts of his work helping service members and veterans struggling with mental health.",
    "author": "",
    "title": "7 big 2022 midterm questions to answer this week"
  },
  {
    "id": 7497,
    "mediaId": 1576,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "In the high-profile race for U.S. Senate, former UGA football star <span class='selected-term'>Herschel Walker</span> is riding high with his Trump endorsement.",
    "author": "",
    "title": "7 things to watch on primary election night in Georgia"
  },
  {
    "id": 7507,
    "mediaId": 238,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Trumps political clout will also be tested in two other races: the Senate contest where ex-NFL star <span class='selected-term'>Herschel Walker</span> is expected to win the GOP nod to face Sen. Raphael G. Warnock (D); and the secretary of state race between Brad Raffensperger and Trumps pick, Rep. Jody Hice (R).",
    "author": "Theodoric Meyer",
    "title": "Tuesday's primary fights could be the latest sign of Blue Dogs' waning influence"
  },
  {
    "id": 7331,
    "mediaId": 238,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Trump notched an expected win in Georgia's Republican primary for U.S. Senate, where former NFL star <span class='selected-term'>Herschel Walker</span> won.",
    "author": "David Weigel",
    "title": "Kemp, Raffensperger win in blow to Trump and his false election claims"
  },
  {
    "id": 8357,
    "mediaId": 129,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "In Georgia's U.S. Senate race, <span class='selected-term'>Herschel Walker</span>, the former University of Georgia football star who was also recruited by Mr. Trump, won the Republican nomination and will face Senator Raphael Warnock, a Democrat, in November.",
    "author": "",
    "title": "Primary Elections Live Updates: Voters Reject Trump Endorsed Candidates in Georgia"
  }
]