[
  {
    "id": 1287,
    "mediaId": 195,
    "date": "2022-00-01",
    "sentence": "Georgia Republican Senate candidate and former NFL star <span class='selected-term'>Herschel Walker</span> is backing out of a planned speech at an event organized by Rep. Marjorie Taylor Greene (R-Ga.) after she attended a white nationalist conference.",
    "author": "Max Greenwood",
    "title": "Herschel Walker pulls out of Greene event after her speech at white nationalist conference",
    "sentiment": "0.308"
  },
  {
    "id": 8100,
    "mediaId": 157,
    "date": "2022-00-01",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> pulled out of an upcoming event organized by Georgia GOP Rep. Marjorie Taylor -- who's come under fire for speaking at an event hosted by white nationalists who praised Russian President Vladimir Putin's invasion of Ukraine, The Atlanta Journal Constitution reports.",
    "author": "Sky Palma",
    "title": "Marjorie Taylor Greene suffers more blowback as GOP Senate hopeful pulls out of her event",
    "sentiment": "0"
  },
  {
    "id": 7721,
    "mediaId": 63,
    "date": "2022-00-19",
    "sentence": "(Twitter/Matt Corley of Citizens for Responsibility and Ethics in Washington)\nBiden to hold first road fundraisers of presidency (Axios)\nEx-Rep. Pete King registers as lobbyist for facility accused of torturing children (LegiStorm)\nGyms, restaurants, music venues among those seeking billions in pandemic relief (The Hill)\nBank records shed light on dark-money group in Florida ghost candidate scandal (Tampa Bay Times)\n<span class='selected-term'>Herschel Walker</span> Claims to Own Companies That Dont Exist (The Daily Beast)\nAn 83-year-old California man was sentenced to 3.5 years in prison after stealing more than $250,000 by pretending to raise money for Bernie Sanders, Beto ORourke and others (Insider)\nIn Closing\nI own that so I pay myself (ha ha!)",
    "author": "Zach Everson",
    "title": "Checks And Imbalances: The Reporter's Notebook Edition",
    "sentiment": "0.0"
  },
  {
    "id": 7925,
    "mediaId": 43,
    "date": "2022-00-25",
    "sentence": "Current candidates like <span class='selected-term'>Herschel Walker</span>?",
    "author": "",
    "title": "Mark Foley. Dennis Hastert. Matt Gaetz. And Republicans want to pontificate about morals?",
    "sentiment": "0.0"
  }
]