[
  {
    "id": 7967,
    "mediaId": 33,
    "date": "d2022-03-23T00:00",
    "sentence": "",
    "author": "Donald Judd and Maegan Vazquez",
    "title": "Biden requests Mehmet Oz and Herschel Walker resign from presidential council or be terminated",
    "sentiment": "-0.208"
  },
  {
    "id": 7968,
    "mediaId": 188,
    "date": "d2022-03-23T00:00",
    "sentence": "The White House requested for Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span> to resign from the President's Council on Sports, Fitness & Nutrition on Wednesday, or else face termination, according to CNN.",
    "author": "Alex Nitzberg",
    "title": "White House ousts Dr. Mehmet Oz and Herschel Walker from President's Council on Sports, Fitness & Nutrition",
    "sentiment": "-0.833"
  },
  {
    "id": 7950,
    "mediaId": 43,
    "date": "d2022-03-24T00:00",
    "sentence": "Just as President Joe Biden has reportedly asked GOP Senate candidates <span class='selected-term'>Herschel Walker</span> and Mehmet Oz to resign their posts on the Presidents Council on Sports, Fitness & Nutrition, Biden has announced his intent to appoint their replacements.",
    "author": "Rebekah Sager",
    "title": "Biden moves to oust GOP Senate candidates Herschel Walker, Dr. Oz for Jos Andrs, Elena Delle Donne",
    "sentiment": "-0.403"
  },
  {
    "id": 7954,
    "mediaId": 1576,
    "date": "d2022-03-24T00:00",
    "sentence": "The White House has removed Dr. Mehmet Oz  best known as daytime TVs host of The Dr. Oz Show  and former football star <span class='selected-term'>Herschel Walker</span> from the Presidents Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "",
    "title": "Herschel Walker, Dr. Oz removed from Biden's sports council",
    "sentiment": "-0.924"
  },
  {
    "id": 7955,
    "mediaId": 43,
    "date": "d2022-03-24T00:00",
    "sentence": "Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span> were both appointed to the President's Council on Sports, Fitness & Nutrition by twice-popular-voter-loser former President Donald Trump.",
    "author": "",
    "title": "Biden requests resignations of Dr. Mehmet Oz and Herschel Walker by end of day",
    "sentiment": "-0.418"
  },
  {
    "id": 7949,
    "mediaId": 239,
    "date": "d2022-03-24T00:03:43",
    "sentence": "President Biden formally asked two Trump-appointed members of the Presidents Council on Sports, Fitness and Nutrition  <span class='selected-term'>Herschel Walker</span> and Dr. Mehmet Oz  to resign or else be fired, citing administration policy that bars candidates for federal office to serve on presidential boards.",
    "author": "Tom Howell Jr.",
    "title": "Biden tells Herschel Walker, Dr. Oz to resign from presidential fitness board",
    "sentiment": "-0.597"
  },
  {
    "id": 7948,
    "mediaId": 237,
    "date": "d2022-03-24T00:18",
    "sentence": "President Joe Biden informed Republican Senate candidates Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span> that they needed to resign from the Presidents Council on Sports, Fitness and Nutrition or they would be removed.",
    "author": "Misty Severi",
    "title": "Biden forces out Dr. Oz and Herschel Walker from fitness council",
    "sentiment": "-0.532"
  },
  {
    "id": 7946,
    "mediaId": 65,
    "date": "d2022-03-24T03:32",
    "sentence": "A similar notification was issued to Georgia Senate candidate <span class='selected-term'>Herschel Walker</span>, who is running for the Senate in Georgia.",
    "author": "",
    "title": "Biden demands Dr. Oz, Herschel Walker step down amid Senate runs",
    "sentiment": "0"
  },
  {
    "id": 7945,
    "mediaId": 124,
    "date": "d2022-03-24T03:52:41",
    "sentence": "Republican Senate candidate <span class='selected-term'>Herschel Walker</span> speaks at a rally featuring former President Donald Trump in Perry, Ga., on Sept. 25.Sean Rayford / Getty Images file\nEarlier Wednesday, the White House announced plans to name the chef Jos Andrs and the WNBA player Elena Delle Donne as co-chairs of the presidential council, of which Walker has been the chair and Oz has been a member.",
    "author": "",
    "title": "White House moves to oust Dr. Oz and Herschel Walker from presidential advisory panel",
    "sentiment": "-0.447"
  },
  {
    "id": 7944,
    "mediaId": 21,
    "date": "d2022-03-24T06:25:14",
    "sentence": "President Joe Biden's administration sent letters to television personality Dr. Mehmet Oz and former NFL player <span class='selected-term'>Herschel Walker</span> Wednesday, asking them to resign from the President's Council on Sports, Fitness & Nutrition or be terminated by the end of the day.",
    "author": "Lauren Frias",
    "title": "Biden asked Dr. Oz and Herschel Walker to resign from a presidential council or be terminated",
    "sentiment": "-0.306"
  },
  {
    "id": 7943,
    "mediaId": 65,
    "date": "d2022-03-24T07:58",
    "sentence": "RESIGNATIONS SOUGHT - President Biden requested two members of the President's Council on Sports, Fitness & Nutrition, <span class='selected-term'>Herschel Walker</span> and Dr. Mehmet Oz, who were appointed by former President Trump, either step down or face termination amid their U.S. Senate runs in Georgia and Pennsylvania.",
    "author": "",
    "title": "Biden demands Dr. Oz, Herschel Walker resign; The spies among us -- one former spy speaks out",
    "sentiment": "-0.17"
  },
  {
    "id": 7942,
    "mediaId": 136,
    "date": "d2022-03-24T10:09",
    "sentence": "Oz, best known as the host of The Dr. Oz Show, and <span class='selected-term'>Herschel Walker</span> were both sent letters on Wednesday asking them to resign by the end of the day or they would be terminated, a White House official told NBC News.",
    "author": "Khaleda Rahman",
    "title": "Dr. Oz Calls Biden 'Petty' After Being Asked to Quit President's Council",
    "sentiment": "-0.607"
  },
  {
    "id": 7940,
    "mediaId": 237,
    "date": "d2022-03-24T12:41",
    "sentence": "A White House official told CNN Wednesday that Oz, along with fellow council member and Republican Senate candidate <span class='selected-term'>Herschel Walker</span>, were in violation of the Biden administration's policy of federal candidates serving on presidential boards.",
    "author": "Heather Hamilton",
    "title": "WATCH: Dr. Oz responds to Bidens request that he resign from fitness council",
    "sentiment": "0.0"
  },
  {
    "id": 7935,
    "mediaId": 233,
    "date": "d2022-03-24T16:02",
    "sentence": "The White House sent letters to Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span>, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, a White House official said.",
    "author": "Rick Rouan",
    "title": "Biden asks GOP Senate candidates Mehmet Oz, Herschel Walker to resign from presidential board",
    "sentiment": "-0.881"
  },
  {
    "id": 7932,
    "mediaId": 112,
    "date": "d2022-03-24T18:05",
    "sentence": "President Joe Biden has axed <span class='selected-term'>Herschel Walker</span> and Dr. Mehmet Oz from advisory roles with the Presidents Council on Sports, Fitness & Nutrition due to their current candidacies for the U.S. Senate.",
    "author": "Charles Passy",
    "title": "Why President Biden fired Herschel Walker and Dr. Mehmet Oz from a federal fitness council",
    "sentiment": "-0.81"
  },
  {
    "id": 7883,
    "mediaId": 63,
    "date": "d2022-03-28T00:02",
    "sentence": "But Mehmet Oz, MD, still brought up Fauci in response to the Biden Administration asking both him and <span class='selected-term'>Herschel Walker</span> to resign from the Council.",
    "author": "Bruce Y. Lee",
    "title": "Dr. Mehmet Oz Asked To Resign From Presidents Council, Brings Up Dr. Fauci Again",
    "sentiment": "0.218"
  },
  {
    "id": 7868,
    "mediaId": 233,
    "date": "d2022-03-31T00:17",
    "sentence": "Oz's termination from the Presidential Council on Sports, Fitness, and Nutrition came a week after President Joe Biden asked him and fellow GOP Senate candidate <span class='selected-term'>Herschel Walker</span> to resign from the council.",
    "author": "Chelsey Cox",
    "title": "Senate candidate and TV host Dr. Oz removed from presidential fitness council",
    "sentiment": "-0.95"
  },
  {
    "id": 7816,
    "mediaId": 233,
    "date": "d2022-04-10T11:46",
    "sentence": "Last month, President Joe Biden asked Oz and Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> to leave the Presidential Council on Sports, Fitness, and Nutrition.",
    "author": "Katie Wadington",
    "title": "Trump endorses celebrity surgeon Dr. Oz in Pennsylvania's Senate race",
    "sentiment": "0.0"
  },
  {
    "id": 7794,
    "mediaId": 209,
    "date": "d2022-04-12T07:01",
    "sentence": "Donald Trump has \"racked up quite a roster of endorsees: Dr. Oz, <span class='selected-term'>Herschel Walker</span>, Sarah Palin  his goal is to turn Congress into The Celebrity Apprentice,\" Kimmel said.",
    "author": "Peter Weber",
    "title": "Late night hosts explore Russia's sanctions pains, Don Jr.'s election texts, Trump's Dr. Oz nod",
    "sentiment": "0.253"
  },
  {
    "id": 7793,
    "mediaId": 124,
    "date": "d2022-04-12T08:41:20",
    "sentence": "White House removes Dr. Oz and <span class='selected-term'>Herschel Walker</span> from advisory panel after Senate runs\nMarch 24, 202200:17\nBut by the time McCormick showed up Wednesday, Trump was already close to endorsing Oz, said two other Trump advisers, who said Trump wasnt swayed by the arguments of those close to him who were backing McCormick.",
    "author": "",
    "title": "Dr. Oz bets Trump endorsement can catapult him in Pa. Senate race",
    "sentiment": "0.0"
  },
  {
    "id": 7775,
    "mediaId": 238,
    "date": "d2022-04-13T18:11",
    "sentence": "Or perhaps McConnell might have been referring to <span class='selected-term'>Herschel Walker</span>, the Republican running for Georgias Senate seat whom McConnell himself has endorsed.",
    "author": "",
    "title": "Opinion: After appealing to con men, the GOP now complains about the hucksters",
    "sentiment": "-0.967"
  },
  {
    "id": 7762,
    "mediaId": 65,
    "date": "d2022-04-14T17:58",
    "sentence": "During a segment discussing the Senate candidacies of celebrity TV doctor Mehmet Oz and former star football player <span class='selected-term'>Herschel Walker</span>, Hostin decried the idea that Americans would vote to elect celebrities with no political experience, pointing to Trump as reason not to vote for them.",
    "author": "Brandon Gillespie",
    "title": "'The View's' Sunny Hostin claims Trump 'ran the country into the ground' despite multiple crises under Biden",
    "sentiment": "-0.409"
  },
  {
    "id": 7760,
    "mediaId": 169,
    "date": "d2022-04-14T22:00",
    "sentence": "Hostin also compares Oz's situation to that of former football running back <span class='selected-term'>Herschel Walker</span>, who came out as the front-runner in recent polls amid his campaign to acquire a Senate seat in Georgia.",
    "author": "Joy Saha",
    "title": "\"The View\" hosts tickled by \"Trump minions\" at Fox News who are split over Dr. Oz Senate endorsement",
    "sentiment": "0"
  },
  {
    "id": 7702,
    "mediaId": 129,
    "date": "d2022-04-21T00:00",
    "sentence": "Other out-of-state candidates  like David McCormick, Ozs chief Republican rival in Pennsylvania, as well as <span class='selected-term'>Herschel Walker</span> in Georgia  have faced similar scrutiny this year.",
    "author": "",
    "title": "Sections",
    "sentiment": "0.0"
  },
  {
    "id": 7701,
    "mediaId": 558,
    "date": "d2022-04-21T03:21",
    "sentence": "This follows his endorsement of Mehmet Oz in Pennsylvanias Senate Republican primary and <span class='selected-term'>Herschel Walker</span> in the Georgia Senate race.",
    "author": "Robert Reich",
    "title": "Were running out of time to hold Donald Trump accountable",
    "sentiment": "0.835"
  },
  {
    "id": 6253,
    "mediaId": 136,
    "date": "d2022-04-21T14:51",
    "sentence": "Mehmet Oz in Pennsylvania's Senate Republican primary and <span class='selected-term'>Herschel Walker</span> in the Georgia Senate race.",
    "author": "Robert Reich",
    "title": "We're Running Out of Time to Hold Trump Accountable | Opinion",
    "sentiment": "0.423"
  },
  {
    "id": 6155,
    "mediaId": 237,
    "date": "d2022-04-25T13:18",
    "sentence": "Polling averages have Georgia Democratic Sen. Raphael Warnock trailing Trump-endorsed <span class='selected-term'>Herschel Walker</span> in Georgia, with Hassan, Sen. Mark Kelly of Arizona, and Sen. Catherine Cortez Masto of Nevada all in competitive races.",
    "author": "Christian Datoc",
    "title": "Biden thinks Democrats can gain Senate seats this year  with Trump's help",
    "sentiment": "0.0"
  },
  {
    "id": 7652,
    "mediaId": 120,
    "date": "d2022-04-29T15:26",
    "sentence": "As their statewide campaigns move forward, Georgias <span class='selected-term'>Herschel Walker</span> and Pennsylvanias Mehmet Oz have quite a bit in common.",
    "author": "Steve Benen",
    "title": "The unexpected thing Herschel Walker has in common with Dr. Oz",
    "sentiment": "-0.921"
  },
  {
    "id": 7551,
    "mediaId": 233,
    "date": "d2022-05-19T14:16",
    "sentence": "Walker's college-aged son, Christian, is a popular conservative political commentator on social media platforms like Twitter and Twitter, where he often posts videos blasting liberal political views popular among Gen Z.\n<span class='selected-term'>Herschel Walker</span> vs. Raphael Warnock in the polls\nThe anticipated match up between Walker and Warnock is expected to be tight.",
    "author": "Orlando Mayorquin",
    "title": "Who is Herschel Walker? The former football star is running for Senate in Georgia as a Republican.",
    "sentiment": "0.333"
  }
]