[
  {
    "id": 6055,
    "mediaId": 25,
    "date": "2022-00-01",
    "sentence": "He's endorsed a number of other candidates: Pennsylvania, <span class='selected-term'>Herschel Walker</span>, Georgia.",
    "author": "",
    "title": "Transcript: Rep. Adam Kinzinger on \"Face the Nation,\" May 1, 2022",
    "sentiment": "0.431"
  },
  {
    "id": 7862,
    "mediaId": 234,
    "date": "2022-00-01",
    "sentence": "Per CNNs KFILE:\nFor years, <span class='selected-term'>Herschel Walker</span> has told the same inspiring story: that he graduated in the top 1% of his class at the University of Georgia.",
    "author": "Bess Levin",
    "title": "Jared Kushner and Donald Trump Probably Wont Be Splitting a Milkshake With Two Straws Any Time Soon",
    "sentiment": "0.0"
  },
  {
    "id": 7800,
    "mediaId": 195,
    "date": "2022-00-11",
    "sentence": "In Pennsylvania, Trump recently endorsed former television host Mehmet Oz (R) to replace retiring Sen. Pat Toomey (R)\nHe also is backing former football star <span class='selected-term'>Herschel Walker</span> (R) in the Georgia race against Sen. Raphael Warnock (D).",
    "author": "Elizabeth Crisp",
    "title": "Trump approval ratings still strong in key battleground states: poll",
    "sentiment": "0"
  },
  {
    "id": 7802,
    "mediaId": 136,
    "date": "2022-00-11",
    "sentence": "The former president's political power will be tested in the Peach State as two of his picks for office differ in the polls: former football star <span class='selected-term'>Herschel Walker</span> is dominating the Republican field for Senate while David Perdue is behind in the gubernatorial primary.",
    "author": "Alexandra Hutzler",
    "title": "Trump Hugely Popular in States With Key Senate Races",
    "sentiment": "-0.155"
  },
  {
    "id": 7733,
    "mediaId": 238,
    "date": "2022-00-17",
    "sentence": "",
    "author": "",
    "title": "Who's giving to Trump's super PAC",
    "sentiment": "0"
  },
  {
    "id": 4470,
    "mediaId": 65,
    "date": "2022-00-18",
    "sentence": "CLICK HERE FOR TOPLINE AND CROSSTABS\nFormer NFL running back <span class='selected-term'>Herschel Walker</span> dominates the field in the Republican Senate primary race.",
    "author": "",
    "title": "Fox News Poll: Georgias GOP primary race for governor sees Kemp holding wide lead over Perdue",
    "sentiment": "0.0"
  },
  {
    "id": 7329,
    "mediaId": 33,
    "date": "2022-00-23",
    "sentence": "Democratic Sen. Raphael Warnock is facing election for a full six-year term and likely to face the Trump-backed former football star <span class='selected-term'>Herschel Walker</span>, who is favored to win Tuesday's Republican primary.",
    "author": "Eric Bradner",
    "title": "Republicans look to Georgia for a path beyond Trump's 2020 grievances",
    "sentiment": "0.0"
  },
  {
    "id": 7481,
    "mediaId": 147,
    "date": "2022-00-23",
    "sentence": "But he also has <span class='selected-term'>Herschel Walker</span>, who is his chosen person for the Senate race, and there was really no ability of Republicans  other than Trump Republicans, there was no ability to pull anyone up with him.",
    "author": "PBS NewsHour",
    "title": "Tamara Keith and Amy Walter on whats at stake in Georgias primary election",
    "sentiment": "0.0"
  },
  {
    "id": 7491,
    "mediaId": 169,
    "date": "2022-00-23",
    "sentence": "Trump is predicted to have at least one winner on the day: Former football star <span class='selected-term'>Herschel Walker</span> will be the GOP nominee for the U.S. Senate seat currently held by Democrat Raphael Warnock.",
    "author": "Heather Digby Parton",
    "title": "Trump's guys may lose in Georgia  but his Big Lie is going strong",
    "sentiment": "0"
  },
  {
    "id": 7498,
    "mediaId": 157,
    "date": "2022-00-23",
    "sentence": "Trump is predicted to have at least one winner on the day: Former football star <span class='selected-term'>Herschel Walker</span> will be the GOP nominee for the U.S. Senate seat currently held by Democrat Raphael Warnock.",
    "author": "Heather Digby Parton",
    "title": "Trump is facing an embarrassing defeat  but here's why it might not matter",
    "sentiment": "-0.507"
  },
  {
    "id": 7501,
    "mediaId": 25,
    "date": "2022-00-23",
    "sentence": "Former star Georgia running back <span class='selected-term'>Herschel Walker</span> has led the Republican field since he entered the race with Trump's encouragement.",
    "author": "Adam Brewster, Aaron Navarro",
    "title": "Georgia primary pits Pence-endorsed Brian Kemp against Trump-backed David Perdue",
    "sentiment": "0.0"
  },
  {
    "id": 7299,
    "mediaId": 238,
    "date": "2022-00-24",
    "sentence": "Trumps political clout will also be tested in two other races: the Senate contest where ex-NFL star <span class='selected-term'>Herschel Walker</span> is expected to win the GOP nod to face Sen. Raphael G. Warnock (D); and the secretary of state race between Brad Raffensperger and Trumps pick, Rep. Jody Hice (R).",
    "author": "Mariana Alfaro",
    "title": "Trump and Pence take separate sides in Georgias gubernatorial primary",
    "sentiment": "0.0"
  },
  {
    "id": 7315,
    "mediaId": 21,
    "date": "2022-00-24",
    "sentence": "Trump talked up Perdue and former football star <span class='selected-term'>Herschel Walker</span>, his pick to knock off Warnock in the general election, during a rally in Commerce, Georgia on March 26.",
    "author": "Warren Rojas",
    "title": "David Perdue caps his campaign for Georgia governor with a racist remark against Stacey Abrams and a Trump tele-rally",
    "sentiment": "0.0"
  },
  {
    "id": 7438,
    "mediaId": 238,
    "date": "2022-00-24",
    "sentence": "Return to menu\n<span class='selected-term'>Herschel Walker</span>, the former pro football player-turned-businessman, is the front-runner in the Senate Republican primary in Georgia.",
    "author": "Mariana Alfaro",
    "title": "Primary elections live updates Big races are on the ballot in Georgia, Alabama, Arkansas and Texas",
    "sentiment": "-0.905"
  },
  {
    "id": 7439,
    "mediaId": 238,
    "date": "2022-00-24",
    "sentence": "This Republican primary is crowded, but former football star <span class='selected-term'>Herschel Walker</span> is expected to win easily.",
    "author": "Amber Phillips",
    "title": "Seven primaries to watch Tuesday, while all eyes are on Georgia",
    "sentiment": "-0.936"
  },
  {
    "id": 7444,
    "mediaId": 943,
    "date": "2022-00-24",
    "sentence": "Trump-backed former NFL star <span class='selected-term'>Herschel Walker</span> is poised to win Georgias GOP Senate nomination after fending off conservative opponents who raised questions about his history of domestic violence.",
    "author": "STEVE PEOPLES and JEFF AMY",
    "title": "What to watch in Tuesdays primaries: Trumps bid to reshape GOP faces biggest hurdles in Georgia",
    "sentiment": "0.0"
  },
  {
    "id": 7461,
    "mediaId": 98,
    "date": "2022-00-24",
    "sentence": "Those contests, along with the likely rise of football legend <span class='selected-term'>Herschel Walker</span> and a pair of battles for the direction of the Democratic Party, make up a busy night of midterm primary action.",
    "author": "Melanie MasonStaff Writer",
    "title": "Georgia has its primary today. Heres what to watch",
    "sentiment": "0.622"
  },
  {
    "id": 7474,
    "mediaId": 1164,
    "date": "2022-00-24",
    "sentence": "In the Georgia U.S. Senate race, former NFL star <span class='selected-term'>Herschel Walker</span>, who is backed by Trump, is expected to handily win, setting up a showdown with current Democratic Sen. Raphael Warnock.",
    "author": "Clyde Hughes",
    "title": "Georgia governor, Senate races highlight primaries in 5 states",
    "sentiment": "0.0"
  },
  {
    "id": 7476,
    "mediaId": 188,
    "date": "2022-00-24",
    "sentence": "Former NFL player <span class='selected-term'>Herschel Walker</span>, another Trump-backed candidate, secured victory in the Republican primary for U.S. Senate in Georgia, according to an AP race call, and will now go up against Democratic Sen. Raphael Warnock.",
    "author": "Alex Nitzberg",
    "title": "Georgia Gov. Brian Kemp defeats Trump-backed David Perdue in Peach State gubernatorial primary; Kemp will face off against Democrat Stacey Abrams during the general election",
    "sentiment": "0.0"
  },
  {
    "id": 7480,
    "mediaId": 157,
    "date": "2022-00-24",
    "sentence": "Abrams is unopposed in her effort to unseat Kemp in November and Warnock is expected to sail through his primary before facing a challenge from Trump-backed former football star <span class='selected-term'>Herschel Walker</span>.",
    "author": "Agence France-Presse",
    "title": "Georgia set to test Trump's US voter fraud 'Big Lie'",
    "sentiment": "0.0"
  },
  {
    "id": 7345,
    "mediaId": 1576,
    "date": "2022-00-25",
    "sentence": "Former football great <span class='selected-term'>Herschel Walker</span>, Trump's pick for U.S. Senate in Georgia, dominated the Republican challengers in his primary.",
    "author": "",
    "title": "Takeaways: Trump's big primary defeat; scandals for the win",
    "sentiment": "0.395"
  },
  {
    "id": 7357,
    "mediaId": 151,
    "date": "2022-00-25",
    "sentence": "Trump was not without victories  most significantly <span class='selected-term'>Herschel Walker</span> in the U.S. Senate primary.",
    "author": "",
    "title": "Trump flops in Georgia: 5 takeaways from a big primary night",
    "sentiment": "0.0"
  },
  {
    "id": 7377,
    "mediaId": 65,
    "date": "2022-00-25",
    "sentence": "The most high-profile candidate Trump endorsed is former college and pro-football legend <span class='selected-term'>Herschel Walker</span>, who easily captured the GOP nomination on his way to battling Democratic Sen. Raphael Warnock in a blockbuster general election showdown that could decide whether Republicans win back the Senate majority.",
    "author": "Paul Steinhauser",
    "title": "Kemp beats Perdue in Georgia governor primary, striking most significant blow to Trump's endorsement power yet",
    "sentiment": "0.0"
  },
  {
    "id": 8363,
    "mediaId": 65,
    "date": "2022-00-26",
    "sentence": "Heisman Trophy winner and former Dallas Cowboys running back <span class='selected-term'>Herschel Walker</span>, however, handily defeated his opponents, earning a Trump-endorsed win in the U.S. Senate primary.",
    "author": "",
    "title": "Georgia Gov. Kemp responds to Trump critiques, says Stacey Abrams is main focus",
    "sentiment": "0.0"
  }
]