[
  {
    "id": 8143,
    "mediaId": 178,
    "date": "2/14/2022 12:00:00 AM",
    "sentence": "Remember the <span class='selected-term'>Herschel Walker</span> trade?",
    "author": "",
    "title": "Winning the Super Bowl showed Rams made all the right moves"
  },
  {
    "id": 8053,
    "mediaId": 193,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ryan O’Halloran",
    "title": "Does Russell Wilson trade to Broncos rank among biggest in NFL history?"
  },
  {
    "id": 7984,
    "mediaId": 233,
    "date": "3/20/2022 12:00:00 AM",
    "sentence": "The last time an NFL team surrendered three first-round picks to acquire a player was in 1989, when the Minnesota Vikings traded with the Dallas Cowboys for running back <span class='selected-term'>Herschel Walker</span>, according to ESPN Stats & Information.",
    "author": "Nate Ulrich",
    "title": "Cleveland Browns comment on controversial decision to trade for Deshaun Watson"
  },
  {
    "id": 7931,
    "mediaId": 233,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "The White House sent letters to Dr. Mehmet Oz and <span class='selected-term'>Herschel Walker</span>, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, according to reports by several media outlets.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: Should Russia be kicked out of the G-20?"
  },
  {
    "id": 7766,
    "mediaId": 195,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "That bank account is anticipated to be a key advantage in his bid this year for a full term against likely GOP nominee <span class='selected-term'>Herschel Walker</span>, the former NFL star.",
    "author": "Tal Axelrod",
    "title": "Warnock raises $13.6 million in first quarter of 2022"
  },
  {
    "id": 7740,
    "mediaId": 238,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Headlined by reigning Heisman Trophy winner <span class='selected-term'>Herschel Walker</span>, the first USFL also played a spring schedule and remains the last league to give the NFL a run for its money.",
    "author": "",
    "title": "As the USFL restarts, a look back at the Washington Federals wild ride"
  },
  {
    "id": 7748,
    "mediaId": 129,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "That predecessor launched the professional football careers of Heisman Trophy winners like <span class='selected-term'>Herschel Walker</span> and Doug Flutie, and future Hall of Famers like Reggie White, Jim Kelly and Steve Young.",
    "author": "",
    "title": "The U.S.F.L. Isnt Back. The U.S.F.L. Is Here."
  },
  {
    "id": 7683,
    "mediaId": 238,
    "date": "4/25/2022 12:00:00 AM",
    "sentence": "They had shipped star running back <span class='selected-term'>Herschel Walker</span> to Minnesota for a massive haul, including eight picks, and quarterback Steve Walsh to New Orleans for three more.",
    "author": "Sam Fortier",
    "title": "The enduring value of the NFL drafts most famous and misunderstood chart"
  },
  {
    "id": 7410,
    "mediaId": 195,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Former NFL star <span class='selected-term'>Herschel Walker</span> is projected to easily clinch the Republican Senate nomination in Georgia, securing his spot on the ballot to face off against Sen. Raphael Warnock (D-Ga.) in November.",
    "author": "Max Greenwood",
    "title": "Herschel Walker clinches GOP Senate nomination in Georgia"
  }
]