[
  {
    "id": 7639,
    "mediaId": 558,
    "date": "2022-00-01",
    "sentence": "ATLANTA (AP)  <span class='selected-term'>Herschel Walker</span> is expected to skip a second debate against his Republican rivals for a crucial U.S. Senate seat on Tuesday after missing the first one.",
    "author": "SUDHIN THANAWALA",
    "title": "Herschel Walker, other candidates test skipping debates",
    "sentiment": "-0.908"
  },
  {
    "id": 8207,
    "mediaId": 43,
    "date": "2022-00-01",
    "sentence": "Trump-backed Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span> raised almost $5.4 million in the past three months and has about the same amount in the bank.",
    "author": "",
    "title": "candidates are getting 'crushed' in early fundraising: report",
    "sentiment": "0.468"
  },
  {
    "id": 7634,
    "mediaId": 1576,
    "date": "2022-00-02",
    "sentence": "And on Tuesday, <span class='selected-term'>Herschel Walker</span> is expected to miss a second debate against his Republican rivals for a crucial U.S. Senate seat after skipping the first one.",
    "author": "",
    "title": "Candidates test skipping debates without upsetting voters",
    "sentiment": "-0.755"
  },
  {
    "id": 7800,
    "mediaId": 195,
    "date": "2022-00-11",
    "sentence": "In Pennsylvania, Trump recently endorsed former television host Mehmet Oz (R) to replace retiring Sen. Pat Toomey (R)\nHe also is backing former football star <span class='selected-term'>Herschel Walker</span> (R) in the Georgia race against Sen. Raphael Warnock (D).",
    "author": "Elizabeth Crisp",
    "title": "Trump approval ratings still strong in key battleground states: poll",
    "sentiment": "0"
  },
  {
    "id": 7571,
    "mediaId": 195,
    "date": "2022-00-12",
    "sentence": "Warnock is likely to face former NFL running back <span class='selected-term'>Herschel Walker</span> (R) in the fall.",
    "author": "Reid Wilson",
    "title": "Republicans reserve $53M in TV ads in bid to win Senate",
    "sentiment": "0"
  },
  {
    "id": 7780,
    "mediaId": 234,
    "date": "2022-00-13",
    "sentence": "Trump-endorsed Georgia candidate follows Trumpian tradition of lying about everything all the time\nFresh off revelations that <span class='selected-term'>Herschel Walker</span> lied about graduating at the top of his class from the University of Georgia when, in fact, he didnt graduate at all, comes a new report from the Daily Beast that the U.S. Senate candidate has a habit of claiming to own businesses that dont appear to exist in the literal sense.",
    "author": "Bess Levin",
    "title": "Trumps Former Chief of Staff Wont Be Able to (Allegedly) Commit Voter Fraud in North Carolina Anymore",
    "sentiment": "-0.391"
  },
  {
    "id": 2064,
    "mediaId": 65,
    "date": "2022-00-15",
    "sentence": "EXCLUSIVE: Republican Senate candidate <span class='selected-term'>Herschel Walker</span> racked up another impressive fundraising haul for his Senate campaign as he tries to unseat Democratic Sen. Raphael Warnock of Georgia in November's midterm elections.",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Herschel Walker raises $5.5M the past three months in his GOP Senate bid in Georgia",
    "sentiment": "0.689"
  },
  {
    "id": 6582,
    "mediaId": 323,
    "date": "2022-00-19",
    "sentence": "The former president has been savvy with some of his endorsements, allying himself with candidates who already have high profiles (including Mehmet Oz and <span class='selected-term'>Herschel Walker</span> for Senate in Pennsylvania and Georgia, respectively) or bestowing his approval at crucial times (as he did at the last minute for Mr. Mastriano, who was already leading).",
    "author": "Kimberley A. Strassel",
    "title": "The Limits of Stop the Steal",
    "sentiment": "0.0"
  },
  {
    "id": 7712,
    "mediaId": 238,
    "date": "2022-00-19",
    "sentence": "Finally, Republicans who refuse to show up for debates, such as Senate candidates <span class='selected-term'>Herschel Walker</span> in Georgia and Rep. Ted Budd in North Carolina, should be asked at every opportunity why they are hiding.",
    "author": "",
    "title": "Opinion: The media still havent learned how to cover the GOP threat to democracy",
    "sentiment": "-0.248"
  },
  {
    "id": 6538,
    "mediaId": 195,
    "date": "2022-00-20",
    "sentence": "Former football star <span class='selected-term'>Herschel Walker</span> is all but guaranteed to win the GOP Senate primary, setting up a general election match-up with Sen. Raphael Warnock (D) in November.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump faces critical popularity test in Georgia",
    "sentiment": "0.693"
  },
  {
    "id": 8261,
    "mediaId": 43,
    "date": "2022-00-21",
    "sentence": "His Senate picks for Georgia (<span class='selected-term'>Herschel Walker</span>), Pennsylvania (Sean Parnell), and North Carolina (Ted Budd) have already muddled GOP chances in three of the most important races.",
    "author": "",
    "title": "It's starting to occur to Trump that some of his endorsements have proven subpar",
    "sentiment": "0"
  },
  {
    "id": 7194,
    "mediaId": 136,
    "date": "2022-00-22",
    "sentence": "Even though polls point to a Perdue loss, Trump's endorsed candidate in the state's Senate primary, former football star <span class='selected-term'>Herschel Walker</span>, remains the overwhelming favorite.",
    "author": "Andrew Stanton",
    "title": "Trump Endorsement More 'Matchbox Car' Than 'Freight Train': Geoff Duncan",
    "sentiment": "0.0"
  },
  {
    "id": 1551,
    "mediaId": 65,
    "date": "2022-00-26",
    "sentence": "Walker campaign manager Scott Paradise touted that \"this massive fundraising haul, likely the largest in the country for a non-incumbent, shows that Georgia Republicans are clearly united behind <span class='selected-term'>Herschel Walker</span> and are ready to take on Senator Warnock.\"",
    "author": "Paul Steinhauser",
    "title": "Trump-backed Herschel Walker reports hauling in nearly $10M since launching GOP Senate bid in Georgia",
    "sentiment": "0.906"
  },
  {
    "id": 7900,
    "mediaId": 237,
    "date": "2022-00-26",
    "sentence": "",
    "author": "Heather Hamilton",
    "title": "Single most dangerous time: Trump blasts climate change, CRT, and KBJ",
    "sentiment": "0"
  },
  {
    "id": 8365,
    "mediaId": 302,
    "date": "2022-00-26",
    "sentence": "His early support helped football great <span class='selected-term'>Herschel Walker</span> and Rep. Ted Budd sail to their respective Senate primary nominations in Georgia and North Carolina.",
    "author": "Associated Press",
    "title": "Trump is in the past': Mounting losses show limits of power",
    "sentiment": "0.0"
  },
  {
    "id": 8472,
    "mediaId": 129,
    "date": "2022-00-26",
    "sentence": "BRUNI: Thoughts on <span class='selected-term'>Herschel Walker</span> (potentially) in the Senate, in five words or less.",
    "author": "",
    "title": "The G.O.P. Has Gone Even Farther to the Right Than I Expected': Three Writers Talk About the Midterms",
    "sentiment": "0.0"
  },
  {
    "id": 8225,
    "mediaId": 237,
    "date": "2022-00-27",
    "sentence": "So far, she has backed Starbuck, Collins, Vance, Georgia Senate candidate <span class='selected-term'>Herschel Walker</span>, Illinois Rep. Mary Miller, North Carolina House candidate Bo Hines, and Florida House candidate Anthony Sabatini.",
    "author": "Paul Bedard",
    "title": "Marjorie Taylor Greene backs Robby Starbuck, Ortagus not worthy of Trump support",
    "sentiment": "0.437"
  },
  {
    "id": 7875,
    "mediaId": 151,
    "date": "2022-00-29",
    "sentence": "Theres no upside to debate, said Jason Shepherd, the chair of the Republican Party in Cobb County, Ga., if youre someone like <span class='selected-term'>Herschel Walker</span> who is already the frontrunner  and has no experience debating.",
    "author": "",
    "title": "Debate-dodging takes off in midterm campaigns",
    "sentiment": "-0.76"
  },
  {
    "id": 8562,
    "mediaId": 195,
    "date": "2022-00-29",
    "sentence": "Georgia's Raphael Warnock, the pastor at Martin Luther King's church, has proven an effective Senator and fund-raiser; his opponent, former Georgia football great <span class='selected-term'>Herschel Walker</span> has been embroiled in personal controversies, shows little grasp of issues and has been caught in lies.",
    "author": "Albert Hunt",
    "title": "Better candidates may not be enough for Democrats to retain the Senate",
    "sentiment": "0"
  }
]