[
  {
    "id": 5929,
    "mediaId": 163,
    "date": "2022-00-03",
    "sentence": "And some worry that Trump's picks, like former football star <span class='selected-term'>Herschel Walker</span> in Georgia, could prove too controversial to prevail against Democrats in November, imperiling their bid for Senate control.",
    "author": "Nathan Layne",
    "title": "Ohio Senate primary a test of Trump's grip on Republican voters",
    "sentiment": "0.0"
  },
  {
    "id": 7589,
    "mediaId": 558,
    "date": "2022-00-07",
    "sentence": "Victories in May by some of Trump's more controversial Senate picks, including former football star <span class='selected-term'>Herschel Walker</span> in Georgia and Oz in Pennsylvania, are not guaranteed successes in the Nov. 8 general elections and missteps could allow Democrats to hold onto their razor-thin Senate majority.",
    "author": "",
    "title": "Trump rallies in Pennsylvania for Senate hopeful Oz",
    "sentiment": "-0.597"
  },
  {
    "id": 7800,
    "mediaId": 195,
    "date": "2022-00-11",
    "sentence": "In Pennsylvania, Trump recently endorsed former television host Mehmet Oz (R) to replace retiring Sen. Pat Toomey (R)\nHe also is backing former football star <span class='selected-term'>Herschel Walker</span> (R) in the Georgia race against Sen. Raphael Warnock (D).",
    "author": "Elizabeth Crisp",
    "title": "Trump approval ratings still strong in key battleground states: poll",
    "sentiment": "0"
  },
  {
    "id": 5139,
    "mediaId": 63,
    "date": "2022-00-14",
    "sentence": "Polling shows Trump-endorsed Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> (R) leading incumbent Sen. Raphael Warnock (D-Ga.) despite Walkers campaign being plagued by a series of gaffes, like Walkers assertion that the existence of apes is evidence that evolution is not real.",
    "author": "Nicholas Reimann",
    "title": "Trump Reportedly Backing J.D. Vance In Ohio Senate RaceLatest Test Of Dubious Endorsement Power",
    "sentiment": "-0.892"
  },
  {
    "id": 4489,
    "mediaId": 157,
    "date": "2022-00-17",
    "sentence": "Vance in Ohio, <span class='selected-term'>Herschel Walker</span> in Georgia and Mehmet Oz in Pennsylvania -- in races around the country, and the \"Morning Joe\" host said they're unlikely to win Democratic votes and might not excite enough Republican voters.",
    "author": "Travis Gettys",
    "title": "'McConnell's worst nightmare': Morning Joe says Trump's 'bonkers' base is pushing for unelectable candidates",
    "sentiment": "0.0"
  },
  {
    "id": 6295,
    "mediaId": 409,
    "date": "2022-00-19",
    "sentence": "Collins didnt mention Georgia GOP senate candidate and football legend <span class='selected-term'>Herschel Walker</span>, but she would probably lump him in with the other celebrity candidates.",
    "author": "Jim Geraghty",
    "title": "The Medias Dirty Secret about GOP Coverage",
    "sentiment": "0.0"
  },
  {
    "id": 7224,
    "mediaId": 129,
    "date": "2022-00-22",
    "sentence": "A recent Atlanta Journal-Constitution poll of likely Republican voters shows the U.S. Senate candidate and former University of Georgia running back <span class='selected-term'>Herschel Walker</span> with a big lead in his primary race, likely aided by both Mr. Trumps endorsement and Mr. Walkers status as a football legend.",
    "author": "",
    "title": "What Donald Trump Didnt Count On in Georgia",
    "sentiment": "0"
  },
  {
    "id": 7482,
    "mediaId": 195,
    "date": "2022-00-23",
    "sentence": "Another Trump favorite, former football star <span class='selected-term'>Herschel Walker</span>, is all but certain to win the GOP Senate primary in Georgia on Tuesday.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump no longer holds MAGA movement in his palm",
    "sentiment": "0.663"
  },
  {
    "id": 6143,
    "mediaId": 136,
    "date": "2022-00-26",
    "sentence": "His endorsement of former football player <span class='selected-term'>Herschel Walker</span> also drew some concerns from Trump supporters, including Herschel's opponent Gary Black, who chastised him for disagreeing with the former president on some immigration policies in a 2015 USA Today interview.",
    "author": "Andrew Stanton",
    "title": "Trump Sparking Fights in MAGA World With These Endorsements",
    "sentiment": "-0.375"
  }
]