[
  {
    "id": 5933,
    "mediaId": 195,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "On May 24, Georgia voters are likely to make formal a fall matchup between Sen. Raphael Warnock (D) and former NFL running back <span class='selected-term'>Herschel Walker</span> (R).",
    "author": "Reid Wilson",
    "title": "Busy month of primaries to set stage for midterms"
  },
  {
    "id": 7201,
    "mediaId": 136,
    "date": "5/22/2022 12:00:00 AM",
    "sentence": "Trump has also endorsed former NFL star <span class='selected-term'>Herschel Walker</span> who is seeking to unseat Raphael Warnock in the U.S Senate.",
    "author": "Khaleda Rahman",
    "title": "Here's Who Donald Trump Has Endorsed in Next Week's Primary Elections"
  },
  {
    "id": 7482,
    "mediaId": 195,
    "date": "5/23/2022 12:00:00 AM",
    "sentence": "Another Trump favorite, former football star <span class='selected-term'>Herschel Walker</span>, is all but certain to win the GOP Senate primary in Georgia on Tuesday.",
    "author": "Niall Stanage",
    "title": "The Memo: Trump no longer holds MAGA movement in his palm"
  },
  {
    "id": 7338,
    "mediaId": 25,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-f912f6e5</div>\n link copied\n5:40 PM\nGeorgia Senate Republican primary results\n<span class='selected-term'>Herschel Walker</span>, Gary Black, Kelvin King, Jonathan McColumn and Latham Saddler are running for the Republican nomination for U.S. Senate in Georgia.",
    "author": "",
    "title": "Primary results 2022: Georgia, Alabama, Arkansas, Texas runoff and Minnesota special election primary results"
  },
  {
    "id": 7349,
    "mediaId": 32,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump has also thrown his weight behind <span class='selected-term'>Herschel Walker</span>, a former NFL running back who is expected to advance to the general election for Senate against Democratic Sen. Raphael Warnock.",
    "author": "Kevin Breuninger",
    "title": "Georgia's primary elections on Tuesday are pivotal. Here's what to watch"
  },
  {
    "id": 7418,
    "mediaId": 18,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "OTHER DEVELOPMENTS:\nATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Arkansas Sanders mourns Texas victims"
  },
  {
    "id": 7419,
    "mediaId": 129,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Raphael Warnock, the incumbent Democratic senator, will most likely cruise to a primary win and confront <span class='selected-term'>Herschel Walker</span>, the former football star, in the fall.",
    "author": "",
    "title": "Your Tuesday Evening Briefing"
  },
  {
    "id": 7421,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "1 hr ago 20:03 PM EDT\nTrump-backed Hershel Walker wins Senate Primary in Georgia\n<span class='selected-term'>Herschel Walker</span> will win the Georgia Republican primary for Senate.",
    "author": "Jake Thomas",
    "title": "Primary Live Updates: Sarah Huckabee Sanders Wins Arkansas Governor Primary"
  },
  {
    "id": 7438,
    "mediaId": 238,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Return to menu\n<span class='selected-term'>Herschel Walker</span>, the former pro football player-turned-businessman, is the front-runner in the Senate Republican primary in Georgia.",
    "author": "Mariana Alfaro",
    "title": "Primary elections live updates Big races are on the ballot in Georgia, Alabama, Arkansas and Texas"
  },
  {
    "id": 7439,
    "mediaId": 238,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "This Republican primary is crowded, but former football star <span class='selected-term'>Herschel Walker</span> is expected to win easily.",
    "author": "Amber Phillips",
    "title": "Seven primaries to watch Tuesday, while all eyes are on Georgia"
  },
  {
    "id": 7444,
    "mediaId": 943,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Trump-backed former NFL star <span class='selected-term'>Herschel Walker</span> is poised to win Georgias GOP Senate nomination after fending off conservative opponents who raised questions about his history of domestic violence.",
    "author": "STEVE PEOPLES and JEFF AMY",
    "title": "What to watch in Tuesdays primaries: Trumps bid to reshape GOP faces biggest hurdles in Georgia"
  },
  {
    "id": 7464,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Federal and state campaign records show the GOP candidates backed by the former president spent tens of thousands of dollars at the private club, and Georgia Senate candidate <span class='selected-term'>Herschel Walker</span> spent nearly $200,000 there so far during the election cycle, including a payment of more than $135,000 in December and about $65,000 last month, reported CNBC.",
    "author": "Travis Gettys",
    "title": "GOP candidates spent $400K at Mar-A-Lago asking for Trumps endorsement"
  },
  {
    "id": 7470,
    "mediaId": 178,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "His preferred Senate candidate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won the GOP nomination despite warnings from Walker's Republican competitors about his history of domestic violence and mental health struggles.",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Kemp wins Georgia GOP gov's race in stinging rebuke of Trump"
  },
  {
    "id": 7472,
    "mediaId": 19,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "ET\nThe first votes are showing up in Georgias results, according to the New York Times, in the Senate GOP primary where <span class='selected-term'>Herschel Walker</span> has as expected taken a commanding lead out the gate.",
    "author": "Matthew Boyle",
    "title": "*** Election Night Livewire *** Georgia, Alabama, Texas, Arkansas, Minnesota Vote in Key Primaries"
  },
  {
    "id": 7476,
    "mediaId": 188,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "Former NFL player <span class='selected-term'>Herschel Walker</span>, another Trump-backed candidate, secured victory in the Republican primary for U.S. Senate in Georgia, according to an AP race call, and will now go up against Democratic Sen. Raphael Warnock.",
    "author": "Alex Nitzberg",
    "title": "Georgia Gov. Brian Kemp defeats Trump-backed David Perdue in Peach State gubernatorial primary; Kemp will face off against Democrat Stacey Abrams during the general election"
  },
  {
    "id": 7362,
    "mediaId": 195,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "Republican <span class='selected-term'>Herschel Walker</span> sailed to victory in Georgia's GOP Senate primary, setting up a matchup with incumbent Democratic Sen. Raphael Warnock (D-Ga.).",
    "author": "Max Greenwood",
    "title": "Five takeaways from primaries in Georgia, Alabama and beyond"
  },
  {
    "id": 7369,
    "mediaId": 65,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "To read more from Fox News' Kyle Morris, click here\nFormer football star <span class='selected-term'>Herschel Walker</span> won Georgia's Republican Senate primary Tuesday, as he seeks to unseat Sen. Raphael Warnock, D-Ga., in November.",
    "author": "Tyler Olson",
    "title": "Primary elections in Georgia, Alabama, runoff in Texas"
  },
  {
    "id": 7374,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Raffensperger beats Trump-endorsed Hice"
  },
  {
    "id": 7380,
    "mediaId": 178,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "His preferred Senate candidate in Georgia, <span class='selected-term'>Herschel Walker</span>, easily won the GOP nomination despite warnings from Walker's Republican competitors about his history of domestic violence and mental health struggles.",
    "author": "STEVE PEOPLES and JEFF AMY Associated Press",
    "title": "Trump rebuked with stinging losses in Georgia GOP contests"
  },
  {
    "id": 8365,
    "mediaId": 302,
    "date": "5/26/2022 12:00:00 AM",
    "sentence": "His early support helped football great <span class='selected-term'>Herschel Walker</span> and Rep. Ted Budd sail to their respective Senate primary nominations in Georgia and North Carolina.",
    "author": "Associated Press",
    "title": "Trump is in the past': Mounting losses show limits of power"
  }
]