[
  {
    "id": 1279,
    "mediaId": 19,
    "date": "2022-00-03",
    "sentence": "Usually, that signals a potential upset for the incumbent.?\nThe poll also weighed the primary field for the Senate race, which is poised to become an expensive battleground general election contest between incumbent Sen. Raphael Warnock (D-GA) and the leading Republican candidate, <span class='selected-term'>Herschel Walker</span>.",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Kemp Holds Lead over Perdue in Governor's Race; Herschel Walker Dominates Senate Primary",
    "sentiment": "0"
  },
  {
    "id": 7608,
    "mediaId": 12,
    "date": "2022-00-04",
    "sentence": "If <span class='selected-term'>Herschel Walker</span> wins Georgias U.S. Senate seat, he would become the most prominent elected official in the nation who has struggled openly with a mental illness.",
    "author": "Shannon McCaffrey",
    "title": "Herschel Walkers mental health battle raises questions about treatment",
    "sentiment": "-0.582"
  },
  {
    "id": 1176,
    "mediaId": 65,
    "date": "2022-00-17",
    "sentence": "WHO'S UP AND WHO'S DOWN IN THE LATEST FOX NEWS MIDTERMS POWER RANKINGS\nRepublican Senate candidate Kelvin King charged in comments to the Atlanta Journal Constitution that \"<span class='selected-term'>Herschel Walker</span> talks about working hard and fighting for the interests of Georgians, yet he works behind the scenes to ensure a level of celebrity comfort and elusiveness, separating himself from the questions and engagement that Georgians demand.",
    "author": "Paul Steinhauser",
    "title": "Demolition derby in Georgia as Herschel Walker's GOP primary rivals slam the Senate front-runner",
    "sentiment": "-0.759"
  },
  {
    "id": 7997,
    "mediaId": 124,
    "date": "2022-00-17",
    "sentence": "A brutal Senate primary is heating up in Georgia, where Republican Gary Blacks campaign dropped opposition research about primary opponent <span class='selected-term'>Herschel Walker</span> (former President Donald Trumps pick), highlighting a lengthy list of allegations of domestic assault, threats and violence.",
    "author": "",
    "title": "Day 22 into Russia's invasion of Ukraine: A glimmer of hope and a devastating reality",
    "sentiment": "-0.953"
  },
  {
    "id": 7526,
    "mediaId": 305,
    "date": "2022-00-21",
    "sentence": "The Republicans running against <span class='selected-term'>Herschel Walker</span> for U.S. Senate are crisscrossing the state this week, looking for every vote they can get and making a similar argument: Walker cant win in a November general election against Democrat Raphael Warnock.",
    "author": "Keith Reed",
    "title": "Hershel Walker's Senate Bid Has Some Georgia Republicans Shook",
    "sentiment": "-0.762"
  },
  {
    "id": 7967,
    "mediaId": 33,
    "date": "2022-00-23",
    "sentence": "",
    "author": "Donald Judd and Maegan Vazquez",
    "title": "Biden requests Mehmet Oz and Herschel Walker resign from presidential council or be terminated",
    "sentiment": "-0.208"
  },
  {
    "id": 7471,
    "mediaId": 19,
    "date": "2022-00-24",
    "sentence": "Trump-backed Georgia Republican <span class='selected-term'>Herschel Walker</span>, a former NFL running back and Heisman Trophy winner, won his party primary for the U.S. Senate according to the Associated Press, which called the race at 7:56 p.m. E.T.",
    "author": "Jacob Bliss",
    "title": "Herschel Walker Clinches Georgias U.S. Senate Republican Primary",
    "sentiment": "0.548"
  },
  {
    "id": 8214,
    "mediaId": 21,
    "date": "2022-00-28",
    "sentence": "",
    "author": "Brent D. Griffiths",
    "title": "Herschel Walker says it's 'totally unfair' to ask him if he supports the bipartisan infrastructure bill that passed last year: 'I have to see all the facts'",
    "sentiment": "0.0"
  }
]