[
  {
    "id": 8261,
    "mediaId": 43,
    "date": "1/21/2022 12:00:00 AM",
    "sentence": "His Senate picks for Georgia (<span class='selected-term'>Herschel Walker</span>), Pennsylvania (Sean Parnell), and North Carolina (Ted Budd) have already muddled GOP chances in three of the most important races.",
    "author": "",
    "title": "It's starting to occur to Trump that some of his endorsements have proven subpar",
    "sentiment": "0"
  },
  {
    "id": 8028,
    "mediaId": 234,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Per HuffPost:\nRepublican Senate candidate <span class='selected-term'>Herschel Walker</span> cast doubt on the theory of evolution in recent remarks, saying the fact that apes and humans coexist disproves accepted science.",
    "author": "Bess Levin",
    "title": "Eric Trump: Putin Was Pants-Pissingly Terrified of My Dad, O.K.?",
    "sentiment": "-0.26"
  },
  {
    "id": 7760,
    "mediaId": 169,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Hostin also compares Oz's situation to that of former football running back <span class='selected-term'>Herschel Walker</span>, who came out as the front-runner in recent polls amid his campaign to acquire a Senate seat in Georgia.",
    "author": "Joy Saha",
    "title": "\"The View\" hosts tickled by \"Trump minions\" at Fox News who are split over Dr. Oz Senate endorsement",
    "sentiment": "0"
  },
  {
    "id": 7747,
    "mediaId": 65,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Georgia U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> asserted that the Democratic Party \"has left Brown and Black people behind\" Thursday on \"Hannity.\"",
    "author": "",
    "title": "Herschel Walker responds to Elie Mystal's attack: Democratic Party 'has left Brown and Black people behind'",
    "sentiment": "-0.897"
  },
  {
    "id": 7758,
    "mediaId": 188,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "Georgia Republican Senate candidate <span class='selected-term'>Herschel Walker</span> graciously invited progressive journalist Elie Mystal to meet him and \"break bread\" after Mystal viciously attacked Walker's candidacy, but the offer was snubbed.",
    "author": "Chris Pandolfo",
    "title": "Herschel Walker invites progressive who viciously attacked him to 'break bread,' gets an utterly contemptuous response",
    "sentiment": "-0.828"
  },
  {
    "id": 1801,
    "mediaId": 239,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "One of the problems also is if Brian Kemp gets in, I think it's going to be very, very hard for <span class='selected-term'>Herschel Walker</span> to win,? Mr. Trump said, according to the Atlanta Journal-Constitution.",
    "author": "Seth McLaughlin",
    "title": "Herschel Walker's debate avoidance in primary spurs general election questions",
    "sentiment": "0.182"
  },
  {
    "id": 7526,
    "mediaId": 305,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "The Republicans running against <span class='selected-term'>Herschel Walker</span> for U.S. Senate are crisscrossing the state this week, looking for every vote they can get and making a similar argument: Walker cant win in a November general election against Democrat Raphael Warnock.",
    "author": "Keith Reed",
    "title": "Hershel Walker's Senate Bid Has Some Georgia Republicans Shook",
    "sentiment": "-0.762"
  }
]