[
  {
    "id": 8342,
    "mediaId": 12,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> has spent the opening months on the campaign trail speaking mostly to conservative media outlets that offered him friendly questions.",
    "author": "Tia Mitchell",
    "title": "The Jolt: The Cobb homage to treason planned for Jan. 6",
    "sentiment": "0"
  },
  {
    "id": 8183,
    "mediaId": 43,
    "date": "2/8/2022 12:00:00 AM",
    "sentence": "(Breaking: Glorious <span class='selected-term'>Herschel Walker</span> Wins 99 Percent Of Vote In Victory Over Raphael Warnock in Georgia Senate Race!)",
    "author": "Bill",
    "title": "Cheers and Jeers: Tuesday",
    "sentiment": "0.929"
  },
  {
    "id": 8098,
    "mediaId": 12,
    "date": "3/1/2022 12:00:00 AM",
    "sentence": "We wont be surprised if his dad schedules a trip to Georgia in the next few weeks to tout the five-candidate slate hes backing, a group that also includes Senate candidate <span class='selected-term'>Herschel Walker</span>.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Marjorie Taylor Greene to deliver America First response to Biden speech",
    "sentiment": "0"
  },
  {
    "id": 8049,
    "mediaId": 409,
    "date": "3/10/2022 12:00:00 AM",
    "sentence": "Greene is radioactive enough at this point that <span class='selected-term'>Herschel Walker</span> pulled out of a joint appearance after Greene spoke at an event run by Holocaust-denying, Putin-cheering white nationalist Nick Fuentes  an appearance denounced by both Mitch McConnell and Kevin McCarthy.",
    "author": "Dan McLaughlin",
    "title": "The Way to Beat Ilhan Omar or Marjorie Taylor Greene Is through Their Primary Opponents",
    "sentiment": "0"
  },
  {
    "id": 5441,
    "mediaId": 124,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "Brian Kemp, and Senate hopeful <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Midterm environment looks more like 2010 than 2018 in NBC News poll",
    "sentiment": "0"
  },
  {
    "id": 7665,
    "mediaId": 136,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Democratic Senator Raphael Warnock of Georgia was trailing Republican challenger <span class='selected-term'>Herschel Walker</span> in an Emerson College poll conducted from April 1 to 3.",
    "author": "Darragh Roche",
    "title": "Democrats' Midterm Chances Dwindling as Republicans Gain Strength: Polls",
    "sentiment": "0.17"
  },
  {
    "id": 7671,
    "mediaId": 98,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Right now the leading candidate in Georgias Republican primary for the Senate is <span class='selected-term'>Herschel Walker</span>, a former Georgia Bulldog football star who lied about graduating from college, lied about being high school valedictorian, and earlier this year told college students in Texas that his upholstery company employs about 250 people when in fact theres no evidence of him even owning an upholstery company.",
    "author": "",
    "title": "Column: Georgia can do better than Marjorie Taylor Greene",
    "sentiment": "-0.413"
  },
  {
    "id": 6055,
    "mediaId": 25,
    "date": "5/1/2022 12:00:00 AM",
    "sentence": "He's endorsed a number of other candidates: Pennsylvania, <span class='selected-term'>Herschel Walker</span>, Georgia.",
    "author": "",
    "title": "Transcript: Rep. Adam Kinzinger on \"Face the Nation,\" May 1, 2022",
    "sentiment": "0.431"
  },
  {
    "id": 6556,
    "mediaId": 151,
    "date": "5/21/2022 12:00:00 AM",
    "sentence": "Why are there so few in office?? by Sabrina Rodrguez\n <span class='selected-term'>Herschel Walker</span>s ties to veterans program face scrutiny,? by APs Brian Slodysko\n And NBCs Alex Seitz-Wald has an interesting story about a planned $5 billion electric vehicle factory for the Atlanta suburbs thats emerged as a point of contention in the Kemp-Perdue primary, with Perdue decrying the woke? project.",
    "author": "",
    "title": "POLITICO Playbook: Sean Patrick Maloney dodges a bullet",
    "sentiment": "0"
  },
  {
    "id": 7466,
    "mediaId": 157,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "NOW WATCH: <span class='selected-term'>Herschel Walker</span> argues with reporter Trump 'never said' election was stolen\nHerschel Walker argues with reporter Trump 'never said' election was stolen\nStories Chosen For You",
    "author": "Sarah K. Burris",
    "title": "Appeals court rules insurrectionists can be barred from political office",
    "sentiment": "0"
  }
]