[
  {
    "id": 8272,
    "mediaId": 1576,
    "date": "1/18/2022 12:00:00 AM",
    "sentence": "The only other Georgian to speak during primetime was <span class='selected-term'>Herschel Walker</span>, the former University of Georgia and professional football player, a longtime friend of Trumps, who also strongly defended him.",
    "author": "",
    "title": "Georgians At The RNC: An Entirely Different Republican Strategy"
  },
  {
    "id": 8196,
    "mediaId": 1576,
    "date": "2/2/2022 12:00:00 AM",
    "sentence": "Last week, Democratic Sen. Raphael Warnock said he raised $9.8 million in the last three months of 2021, while his Republican challenger <span class='selected-term'>Herschel Walker</span> said donors gave him $5.4 million.",
    "author": "",
    "title": "Stacey Abrams raised $9.25 million since jumping into governor's race"
  },
  {
    "id": 8173,
    "mediaId": 12,
    "date": "2/9/2022 12:00:00 AM",
    "sentence": "The former president has also backed former football star <span class='selected-term'>Herschel Walker</span> for the U.S. Senate, state Sen. Burt Jones for lieutenant governor and Perdue against Kemp.",
    "author": "Greg Bluestein",
    "title": "Self-proclaimed Black Donald Trump to test ex-presidents brand in rural Georgia"
  },
  {
    "id": 8168,
    "mediaId": 43,
    "date": "2/10/2022 12:00:00 AM",
    "sentence": "Hice is challenging Secretary of State Brad Raffensperger, who also has Trumps support, as does another GOP-er with a long history of violence against women: <span class='selected-term'>Herschel Walker</span> for Senate.",
    "author": "Rebekah Sager",
    "title": "On Jan. 6 Vernon Jones switched parties. Trump's endorsing him for a Congressional seat in Georgia"
  },
  {
    "id": 1321,
    "mediaId": 12,
    "date": "2/22/2022 12:00:00 AM",
    "sentence": "I can promise you <span class='selected-term'>Herschel Walker</span> is going to be in this race.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Herschel Walker hits weak' U.S. leadership in Russia crisis"
  },
  {
    "id": 1319,
    "mediaId": 19,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "",
    "author": "Ashley Oliver",
    "title": "Herschel Walker Doesn't Support Kemp or Perdue: I'm Mad at Both of Them'"
  },
  {
    "id": 1279,
    "mediaId": 19,
    "date": "3/3/2022 12:00:00 AM",
    "sentence": "Usually, that signals a potential upset for the incumbent.?\nThe poll also weighed the primary field for the Senate race, which is poised to become an expensive battleground general election contest between incumbent Sen. Raphael Warnock (D-GA) and the leading Republican candidate, <span class='selected-term'>Herschel Walker</span>.",
    "author": "Ashley Oliver",
    "title": "Georgia Poll: Kemp Holds Lead over Perdue in Governor's Race; Herschel Walker Dominates Senate Primary"
  },
  {
    "id": 8073,
    "mediaId": 12,
    "date": "3/7/2022 12:00:00 AM",
    "sentence": "Senate candidate <span class='selected-term'>Herschel Walker</span> wasnt the only big name to skip U.S. Rep. Marjorie Taylor Greenes pro-gun rally.",
    "author": "Tia Mitchell",
    "title": "The Jolt: Prepare for surprises this week in Georgia politics"
  },
  {
    "id": 7979,
    "mediaId": 12,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Staples has also made two trips to Trumps Mar-a-Lago resort in Florida, once with U.S. Senate candidate <span class='selected-term'>Herschel Walker</span> and another with conservative activist Charlie Kirk.",
    "author": "Tia Mitchell",
    "title": "Now solidly Republican, primary likely to decide the next 6th District representative"
  },
  {
    "id": 7906,
    "mediaId": 558,
    "date": "3/26/2022 12:00:00 AM",
    "sentence": "Saturdays rally in Commerce, 70 miles north-east of Atlanta and one of the most conservative parts of the state, is expected to feature <span class='selected-term'>Herschel Walker</span>, a former football player running for the US Senate; Perdue; and the congressional candidate Vernon Jones, a former Democratic state representative who began calling himself the Black Donald Trump after switching parties.",
    "author": "Edward Helmore",
    "title": "Trump heads to Georgia in high-stakes bid to shape Republican primaries"
  },
  {
    "id": 7889,
    "mediaId": 237,
    "date": "3/27/2022 12:00:00 AM",
    "sentence": "The 45th president added that the stakes for <span class='selected-term'>Herschel Walker</span>, a GOP Senate candidate in the Peach State and former star running back, are also high.",
    "author": "Heather Hamilton",
    "title": "'It's a vote for this country': Trump touts David Perdue for Georgia's next governor"
  },
  {
    "id": 7430,
    "mediaId": 136,
    "date": "5/24/2022 12:00:00 AM",
    "sentence": "In Georgia, former football star <span class='selected-term'>Herschel Walker</span> is the overwhelming favorite to win the GOP Senate primarywhile Trump's former press secretary, Sarah Huckabee Sanders, is widely expected to win the Republican primary for Arkansas governor, as earlier indicated by a Remington Research Group poll from last year.",
    "author": "Ewan Palmer",
    "title": "Donald Trump Set for Slew of Primary Losses as Midterms Strategy Unravels"
  },
  {
    "id": 7370,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Nguyen in runoff in Democratic SoS primary"
  },
  {
    "id": 7374,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Raffensperger beats Trump-endorsed Hice"
  },
  {
    "id": 7379,
    "mediaId": 18,
    "date": "5/25/2022 12:00:00 AM",
    "sentence": "ATLANTA  Republican Senate nominee <span class='selected-term'>Herschel Walker</span> and U.S. Sen. Raphael Warnock have opened their contest for Senate in Georgia with sharp attacks.",
    "author": "Associated Press",
    "title": "Midterm updates | Jones, Collins in Georgia GOP House runoff"
  }
]