[
  {
    "id": 8206,
    "mediaId": 1041,
    "date": "2022-00-01",
    "sentence": "Warnock's campaign said Wednesday, Jan. 26, 2022, that he raised a hefty $9.8 million in the last quarter of 2021, nearly double the fundraising haul reported by the leading Republican contender for his seat, former football star <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "All Funds Fit to Disclose",
    "sentiment": "0"
  },
  {
    "id": 8075,
    "mediaId": 178,
    "date": "2022-00-07",
    "sentence": "Georgia Democratic Sen. Raphael Warnock finished the year with $22.9 million in the bank, while likely Republican challenger <span class='selected-term'>Herschel Walker</span>, the former football star who has been endorsed by Trump, reported $5.4 million.",
    "author": "STEVE PEOPLES and BRIAN SLODYSKO Associated Press",
    "title": "Republican 'unforced errors' threaten path to Senate control",
    "sentiment": "0.0"
  },
  {
    "id": 8041,
    "mediaId": 129,
    "date": "2022-00-11",
    "sentence": "She endorsed on Thursday the re-election of Senator Ron Johnson, Republican of Wisconsin, and cut a fund-raising video with <span class='selected-term'>Herschel Walker</span>, the former football star recruited by Mr. Trump to run for the Senate in Georgia.",
    "author": "",
    "title": "With Trump in Her State, Haley Finds Some Political Distance (Gently)",
    "sentiment": "0.0"
  },
  {
    "id": 8151,
    "mediaId": 12,
    "date": "2022-00-11",
    "sentence": "It was updated on Feb. 11, 2022, to make clear that U.S. Senate candidate <span class='selected-term'>Herschel Walker</span>s therapist, Jerry Mungadze, holds a doctorate of philosophy in counselor education.",
    "author": "BRIAN SLODYSKO",
    "title": "Police records complicate Herschel Walker's recovery story",
    "sentiment": "-0.869"
  },
  {
    "id": 7997,
    "mediaId": 124,
    "date": "2022-00-17",
    "sentence": "A brutal Senate primary is heating up in Georgia, where Republican Gary Blacks campaign dropped opposition research about primary opponent <span class='selected-term'>Herschel Walker</span> (former President Donald Trumps pick), highlighting a lengthy list of allegations of domestic assault, threats and violence.",
    "author": "",
    "title": "Day 22 into Russia's invasion of Ukraine: A glimmer of hope and a devastating reality",
    "sentiment": "-0.953"
  },
  {
    "id": 8132,
    "mediaId": 21,
    "date": "2022-00-17",
    "sentence": "The newly minted lawmaker is likely to face off against former professional football star <span class='selected-term'>Herschel Walker</span>  one of many Republican political newcomers Trump has endorsed in races around the country.",
    "author": "Warren Rojas",
    "title": "Sen. Raphael Warnock proposes slashing gas, drug, and shipping costs to beat inflation ahead of a midterm challenge from MAGA",
    "sentiment": "0"
  },
  {
    "id": 7715,
    "mediaId": 124,
    "date": "2022-00-19",
    "sentence": "White House removes Dr. Oz and <span class='selected-term'>Herschel Walker</span> from advisory panel after Senate runs\nMarch 24, 202200:17\nAt the root of their opposition to Oz is Turkey's insistence that what happened during World War I wasn't genocide.",
    "author": "",
    "title": "Armenian Americans rally in opposition to Oz's Pennsylvania Senate bid",
    "sentiment": "0.0"
  },
  {
    "id": 7535,
    "mediaId": 558,
    "date": "2022-00-20",
    "sentence": "(Hyosub Shin/Atlanta Journal-Constitution via AP, File)\nWASHINGTON (AP)  <span class='selected-term'>Herschel Walker</span>, the football legend and leading Republican Senate candidate in Georgia, often boasts of his work helping service members and veterans struggling with mental health.",
    "author": "BRIAN SLODYSKO",
    "title": "Herschel Walker's ties to veterans program face scrutiny",
    "sentiment": "0.393"
  },
  {
    "id": 7698,
    "mediaId": 12,
    "date": "2022-00-21",
    "sentence": "Mallory Blount, an aide to GOP Senate frontrunner <span class='selected-term'>Herschel Walker</span>, said if this is your messaging strategy, youre already losing.",
    "author": "Greg Bluestein",
    "title": "A magician I am not. Warnock tests a different tone",
    "sentiment": "0.0"
  },
  {
    "id": 8260,
    "mediaId": 12,
    "date": "2022-00-21",
    "sentence": "Hell face one of four Republicans, including <span class='selected-term'>Herschel Walker</span>, who have gotten into the GOP primary to challenge him.",
    "author": "Patricia Murphy",
    "title": "OPINION: Raphael Warnocks year of victories, defeats, and Senate prayers",
    "sentiment": "0.0"
  },
  {
    "id": 7973,
    "mediaId": 124,
    "date": "2022-00-22",
    "sentence": "Ex-wife accuses Missouri Senate candidate Eric Greitens of domestic abuse\nMarch 22, 202201:37\nConsider these all of these different problems:\nIn Georgia, GOP frontrunner <span class='selected-term'>Herschel Walker</span> (who is much more likely than Greitens is to win the Republican nomination and has largely consolidated the party around him) has admitted his own past violent behavior as part of his struggle with mental illness.",
    "author": "",
    "title": "The GOP's bid to retake the Senate is encountering early struggles",
    "sentiment": "-0.212"
  },
  {
    "id": 7459,
    "mediaId": 178,
    "date": "2022-00-24",
    "sentence": "In a stark reminder of the issue's divisiveness, Biden's call for gun measures was booed at a campaign event in Georgia hosted by <span class='selected-term'>Herschel Walker</span>, who won the Republican nomination for U.S. Senate.",
    "author": "ZEKE MILLER and CHRIS MEGERIAN Associated Press",
    "title": "Biden says 'we have to act' after Texas school shooting",
    "sentiment": "0.0"
  },
  {
    "id": 7388,
    "mediaId": 943,
    "date": "2022-00-25",
    "sentence": "In a stark reminder of the issues divisiveness, Bidens call for gun measures was booed at a campaign event in Georgia hosted by <span class='selected-term'>Herschel Walker</span>, who won the Republican nomination for U.S. Senate.",
    "author": "ZEKE MILLER and CHRIS MEGERIAN",
    "title": "President Biden delivers emotional plea for new gun restrictions after Texas school shooting",
    "sentiment": "0.0"
  },
  {
    "id": 6145,
    "mediaId": 124,
    "date": "2022-00-26",
    "sentence": "Trump, for his part, is sticking by Perdue, saying in a statement last night, It is not easy to beat an incumbent, however, if our voters turn out, David Perdue will win in a landslide.?\nThe poll also finds 66 percent of likely voters supporting former football player <span class='selected-term'>Herschel Walker</span>, who has Trumps backing in the Senate race, while the other candidates polled in the single digits.",
    "author": "",
    "title": "'Mean,' 'circus': Some undecided Pa. GOP voters disappointed by Senate debate",
    "sentiment": "0.0"
  },
  {
    "id": 5441,
    "mediaId": 124,
    "date": "2022-00-28",
    "sentence": "Brian Kemp, and Senate hopeful <span class='selected-term'>Herschel Walker</span>.",
    "author": "",
    "title": "Midterm environment looks more like 2010 than 2018 in NBC News poll",
    "sentiment": "0.0"
  }
]