{
  "id": 1290,
  "mediaId": 43,
  "date": "3/1/2022 12:00:00 AM",
  "headline": "Morning Digest: Join us for our liveblog tonight as the 2022 primaries get underway in Texas",
  "image": "https://images.dailykos.com/images/909275/story_image/GettyImages-578126072.jpg?1611342765",
  "link": "https://www.dailykos.com/story/2022/3/1/2083017/-Morning-Digest-Join-us-for-our-liveblog-tonight-as-the-2022-primaries-get-underway-in-Texas",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1299,
    1299,
    813,
    813,
    1454,
    1454,
    1459,
    1459,
    1560,
    1560,
    1670,
    1670,
    2277,
    2277,
    2934,
    2934,
    2703,
    2703
  ],
  "sentences": [
    "In the first version of the GOP's map, which was struck down by the state Supreme Court, Cawthorn surprised North Carolina politicos when he announced he'd hop over to the new and safely red 13th District in the Charlotte area even though he represented just 12% of it, a move that seemed mostly about bullying state House Speaker Tim Moore out of his planned campaign there; Woodhouse and Edwards responded by kicking off bids for the 14th, which made up the vast majority of Cawthorn's existing seat.",
    "Democrats in the legislature made upstate New York's 21st Congressional District even redder as part of their statewide gerrymander: Under the old lines, the 21st went for Donald Trump 54-44, but the new version would have voted for Trump 58-40.\n? OK-02: Republican Rep. Markwayne Mullin's decision to run for the Senate sets off a race to succeed him at home in Oklahoma's 2nd Congressional District, a seat in the eastern part of the state that Trump would have carried 76-22.",
    "In Pennsylvania special elections, the parties, rather than primary voters, pick their nominees, and there was some late drama when the radical anti-tax Club for Growth spent $16,000 on mailers and an opposition research packet targeting another candidate, state Rep. Jeff Wheeland: PoliticsPA added at the time that an email was sent to delegates on Friday night that \"contained a message, purportedly from someone in Wheeland's family, opposing his bid.\"",
    "As election law expert Rick Hasen explains, this theory, based on a tendentious reading of the Constitution, holds that state legislatures are \"supreme against all other actors that might run elections,\" meaning that their decisions regarding elections cannot be checked by any other branch of governmentincluding state courts interpreting their own state constitutions.",
    "? NC-01: Rocky Mount Mayor Sandy Roberson is seeking the Republican nomination for an eastern North Carolina district that would have gone for Biden 53-46.\n? NC-04: Durham County Commissioner Nida Allam and state Sen. Valerie Foushee have each confirmed that they're seeking the Democratic nomination for this safely blue seat in the Chapel Hill and Durham areas.",
    "This region, nicknamed \"Little Dixie,\" was relatively friendly turf for conservative Democrats through 2010, when Rep. Dan Boren easily won a fourth term during that year's red wave, but those days are gone: Mullin decisively won the open seat race to replace the retiring Boren two years later, and the area has only become more hostile to Democrats since then.",
    "Deutch ended up running for the 22nd while Frankel sought the 21st even though a plurality of their constituents lived in the opposite district, an arrangement that suited them both: The redrawn 21st included much of Frankel's Palm Beach County base while Deutch was well-known in the Broward County-based 22nd, and neither member had any problem winning.",
    "Redistricting\n? NC, PA Redistricting: Republicans in both North Carolina and Pennsylvania have filed similar appeals with the U.S. Supreme Court in recent days, asking the justices to overturn decisions by state courts implementing new congressional maps under a radical and dangerous legal theory known as the \"independent state legislature\" doctrine.",
    "Perhaps the most closely watched race will be the Democratic primary rematch in the Laredo-based 28th Congressional District between conservative Rep. Henry Cuellar and progressive challenger Jessica Cisneros, a race that took a sudden turn in January after the FBI raided the congressman's home and campaign office.",
    "Over in the GOP primary, which has already seen tens of millions in advertising, former hedge fund manager David McCormick's allies at Honor Pennsylvania have publicized a poll from Osage Research showing him edging out TV personality Mehmet Oz 24-21, with former Ambassador to Denmark Carla Sands in third with 11%.",
    "House\n? AL-02: It appears that Republican businessman Jeff Coleman's bid for Congress is over after a federal court rejected a request that he be allowed to intervene in an ongoing case challenging Alabama's congressional map for the purposes of clarifying whether candidate filing concluded on Feb. 7 or Feb. 11.",
    "CBSMiami, which first broke the news, says that the Florida congressman will resign at some point before the end of the 117th Congress; Deutch did not directly address that possibility in his statement, though he said he would \"fulfill my obligations in Washington until Congress recesses for the next election.\"",
    "? NM-Gov: Sandoval County Commissioner Jay Block won Saturday's chaotic Republican convention by narrowly defeating state Rep. Rebecca Dow 29-28 after he delivered a speech labeling Democratic incumbent Michelle Lujan Grisham an \"evil witch,\" a showing that gets him the top spot on the June primary ballot.",
    "? MN-01: Former Defense Department official Dan Feehan, who lost back-to-back close races for Minnesota's 1st Congressional District in 2018 and 2020, is considering a third bid in the Aug. 9 special election, according to Jim Hepworth, the chair of the local Democratic Party organization in the district.",
    "? NC-11: Far-right Rep. Madison Cawthorn announced Monday he'd run for re-election in the new 11th District, a seat in the western North Carolina mountains that includes most of the constituents he tried to leave behind after the Republicans passed their now-defunct congressional map in November.",
    "Ronchetti himself used his convention speech to tell delegates that, because he'd already collected enough signatures to advance, they should consider voting for one of the other candidates, saying, \"And let's get as many people on that ballot to take on Michelle Lujan Grisham as possible.\"",
    "? PA-09: Republican Rep. Fred Keller declared Monday that he would not seek re-election after all, an abrupt development that came just days after he announced that he'd run against fellow Rep. Dan Meuser in the primary for this safely red seat in the rural northeastern part of the state.",
    "The state GOP announced the results at 11 PM local timewhich the Albuquerque Journal says was almost eight hours after the candidates were done speakingafter what a party spokesperson called \"glitches\" forced the almost 750 delegates to switch from electronic voting to paper ballots.",
    "Texas primary preview, with Jeff Singer\nThe Downballot\nFollowShare\n0:0044:16\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLEADING OFF\n? Primary Night: A Paxton Both Your Houses: The 2022 primary season kicks off in a big way tonight in Texas, and we have plenty to watch!",
    "State party chair Steve Pearce himself called the event \"magnificent,\" to which reporter Joe Monahan wrote, \"The absurdity was not lost on his fellow Republicans and rumblings were heard expressing relief that Pearce's tenure as chairman concludes at the end of the year.\"",
    "Deutch, though, had the backing of several prominent local Democrats, including Rep. Robert Wexler, as well as labor groups, and he won the nomination 55-45 after a campaign where, in the words of the Sun-Sentinel, Slosberg lobbed \"one negative attack ad after another.\"",
    "Andrew Cuomo is using his millions in leftover campaign cash to launch what Ad Impact says is a $370,000 ad buy that features several anchors talking about how district attorneys have declined to prosecute him, with on-screen text concluding, \"Political attacks won.",
    "Embattled Attorney General Ken Paxton\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Ron DeSantis' administration as director of the Florida Division of Emergency Management, and the governor later appointed him to his current post to succeed Barbara Sharief, a fellow Democrat who resigned to unsuccessfully seek the 20th District last year.",
    "Mahmood, who says he raised $1 million in his first month on the campaign trail since launching his campaign in mid-January, is so far the only notable Democrat taking on Republican Rep. Young Kim in the redrawn 40th District in eastern Orange County.",
    "Cawthorn won't have a clear path through the May primary, though, as state Sen. Chuck Edwards and Michele Woodhouse, who leads the GOP in the old 11th District (which is barely any different from this new seat) each made it clear they're staying in.",
    "DePasquale said, \"While I had hoped for a fairer, more competitive district in which to run, the recent redistricting process has resulted in a district that, in my opinion, will continue to reward candidates who peddle in extremism and division.\"",
    "Keller's decision ends a short career in national politics that began in 2019 when the then-state representative entered the race to succeed Tom Marino, a fellow Republican who resigned after two weeks in the minority, in the old 10th District.",
    "The confusion over the deadline arose after a panel of three federal judges moved the filing deadline for House hopefuls from Jan. 28 to Feb. 11 when it struck down the GOP's new congressional map for violating the Voting Rights Act in January.",
    "Osage is a firm we've only seen numbers from once back in March of 2018 when it showed Patrick Morrisey narrowly ahead in the West Virginia Senate primary, a contest he'd win several weeks later (the general election didn't go so well for him).",
    "Over in the 3rd District in the Plano area, Republican Rep. Van Taylor and his allies are spending heavily against former Collin County Judge Keith Self, who has gone after the congressman for supporting the creation of the Jan. 6 commission.",
    "Not so lucky was 2020 Senate nominee Mark Ronchetti, who took just 16%, but he says he's submitted enough signatures to advance to the primary; far back in fifth was anti-abortion activist Ethel Maharg, who has attracted little attention.",
    "Mullin, who did some self-funding, outspent his many intra-party rivals and won the primary runoff 57-43, and he had no trouble in the general election in an ancestrally blue seat that was rapidly turning its back on the Democratic Party.",
    "State Sen. Gary Farmer, Broward County Commissioner Mark Bogen, and Fort Lauderdale Mayor Dean Trantalis also each told the South Florida Sun-Sentinel that they were considering, with Trantalis saying that \"I will soon make a decision.\"",
    "Stanford Law professor Nathaniel Persily last year called it an \"insane, anti-democratic argument,\" but as Hasen notes, it's already gained traction among several of the Supreme Court's far-right justices in a variety of earlier cases.",
    "This time, though, Deutch quickly emerged as the only serious Democratic candidate, and he had no trouble winning either the special primary and general elections or holding onto his new safely Democratic constituency in November.",
    "That didn't sit well with former Sen. Tom Coburn, who endorsed Army veteran Jarrin Jackson in the primary; the challenger raised little money and didn't come close to winning, but he held Mullin to an unimpressive 63-37 showing.",
    "The spot doesn't tout Cuomo for any office, though it notably features one clip where TV host Dan Abrams says of Attorney General Tish James, \"The New York state attorney general may have turned a blind eye to crucial details.\"",
    "Coleman, who is seeking to challenge Rep. Barry Moore in the May 24 primary, responded by asking Merrill to seek clarification from the Supreme Court, though there's no reason to think Merrill has any interest in doing so.",
    "Keller explained his about-face by saying, \"With control of Congressand the direction of our nationat stake, this election is bigger than any one person,\" though he more likely decided the primary was just too big for him.",
    "We'll also be watching several races in open House seats, including a very expensive proxy fight in suburban Houston's 8th District between what passes for the GOP establishment these days and the ultra-extremist Cruzniks.",
    "Shannon, who lost the 2014 primary to now-Sen. James Lankford, also sounds very interested, saying, \"In such a time as this my family and I are seeking God's guidance on how our gifts and talents can best serve Oklahoma.\"",
    "This time, though, the primary includes a third candidate, educator Tannya Benavides, and her presence could prevent either Cuellar or Cisneros from winning the majority of the vote they'd need to avoid a May 24 runoff.",
    "The good news for the congressman is that, because he represents all but 28 people in the new 11th, he'll have a geographic advantage  assuming he hasn't pissed off too many of the primary voters he now needs, that is.",
    "Deutch got his chance to seek a promotion in 2010 when Wexler, representing what was then numbered the 19th District, surprised politicos by resigning and later announcing he would head a Middle East policy think tank.",
    "Asked if she might run, Carnahan did not rule out the possibility, saying only, \"I'm focused right now on planning the funerals and doing everything I can to memorialize my husband and that's where my head's at.\"",
    "The court determined that, among other factors, Coleman's \"dispute is with the Alabama Republican Party, which is not a party to these lawsuits,\" thereby preventing the court from granting the requested relief.",
    "Senate\n? AR-Sen: Republican Sen. John Boozman's new commercial for the May primary features a woman named Dee Engle telling the audience how her cousin \"was murdered by an illegal immigrant in her own home.\"",
    "? GA-Sen, GA-Gov: Wick, a Georgia-based pollster we don't see too often, has released numbers from early February that show Republican Herschel Walker narrowly leading Democratic Sen. Raphael Warnock 47-46.",
    "Governors\n? MD-Gov: Former state Commerce Secretary Kelly Schulz's first commercial for the June Republican primary, which Maryland Matters says is running on cable TV, features her standing in a classroom.",
    "Deutch had no trouble claiming the new 21st District after the 2012 round of redistricting, but the court-drawn 2016 map dramatically reshaped both his seat and fellow Democratic Rep. Lois Frankel's 22nd.",
    "? ID-02: Republican Rep. Mike Simpson has launched a 15-second negative ad against attorney Bryan Smith, who is seeking a rematch against the congressman eight years after losing their first bout 62-38.",
    "There's also the heated Republican battle for attorney general, where scandal-ridden incumbent Ken Paxton has Trump's endorsement against several well-known foes, including a member of the Bush dynasty.",
    "There was no question he'd prevail in a seat Trump had carried 66-30 in 2016, though of course Trump insisted afterwards that the nominee \"was a 50-50 shot, but won in a landslide\" thanks to his rally.",
    "Meuser currently represents 66% of the new 9th compared to just 34% for Keller, and while Keller ended December with a big financial edge, the wealthy Meuser may have been able to erase that deficit.",
    "? NY-04: Nassau County Legislator Carri Solages, who has reportedly been considering a bid for New York's open 4th Congressional District, recently filed FEC paperwork ahead of a possible campaign.",
    "? IL-06: Democratic Rep. Marie Newman has released a Victoria Research poll of her June primary matchup with fellow incumbent Sean Casten that shows the two tied at 37% apiece, with 26% undecided.",
    "? TX-03: The Texas Tribune reports that a group called Defeating Communism PAC recently disclosed $436,000 it spent against Republican Rep. Van Taylor in early February ahead of Tuesday's primary.",
    "After telling the audience she's a mother, she says, \"It's why I introduced a Parental Bill of Rightsproviding real school choice, record funding, and accountability, with education transparency.",
    "? NC-13: Former Rep. Renee Ellmers has confirmed she'll seek the Republican nod for the new 13th District, a suburban Raleigh constituency that would have favored Biden by a narrow 50-48 margin.",
    "Deutch ran for office for the first time in 2006 when he sought a safely blue state Senate seat, but he faced a tough primary opponent in state Rep. Irv Slosberg, who self-funded $2.8 million.",
    "Mullin, who is a member of the Cherokee Nation, would be the first Native American to serve in the Senate since Ben Nighthorse Campbell, a Colorado Democrat-turned-Republican, retired in 2005.",
    "Florida Politics also relays that state Rep. David Silvers is considering, while Politico mentioned state Sen. Tina Polsky and Palm Beach County State Attorney Dave Aronberg as possibilities.",
    "Hasen lays out a devastating series of reasons why the court should reject the GOP's appeals in both states, not least of which is the fact that candidate filing is already underway in both.",
    "The incumbent soon announced he would indeed seek a fourth term, and this time, he earned just 54% of the votejust a few points above what he needed to avoid a runoffwhile Jackson took 25%.",
    "? NY-21: Former speedskater Bridie Farrell, who was a member of the U.S. national team, has dropped her bid against Republican Rep. Elise Stefanik \"[a]fter reviewing the new district maps.\"",
    "? NY-12: State Sen. Brad Hoylman, who recently didn't rule out a primary challenge to longtime Democratic Rep. Carolyn Maloney, instead endorsed the incumbent at an event over the weekend.",
    "? OK-Sen-B, OK-Sen-A: Rep. Markwayne Mullin on Saturday announced he would enter the June primary to succeed Sen. James Inhofe, whose resignation takes effect at the end of this Congress.",
    "? MO-Sen: Politico reports that Attorney General Eric Schmitt's allies at Save Missouri Values are spending $500,000 on an ad campaign for him well ahead of the August Republican primary.",
    "Mullin, for his part, ran a plumbing business when he first ran for office in 2012 to succeed retiring Democratic Rep. Dan Boren in the 2nd District in the eastern corner of the state.",
    "He could have instead attempted to beat a fellow incumbent in a primary on their own turf or tried to win a swing seat, but he ultimately decided that staying home was his best option.",
    "Nine women's groups quickly condemned the commercial, saying, \"Instead of accepting responsibility, serial sexual harasser Andrew Cuomo continues to challenge the accounts of victims.\"",
    "John Fetterman is running the very first TV ad of the May Democratic primary, a minute-long spot centered around his time leading the small western Pennsylvania community of Braddock.",
    "The super PAC's spot stars Texas Sen. Ted Cruz praising the attorney general for fighting the Biden administration and for standing up \"to bureaucrats who mandated masks on our kids.\"",
    "In 2018, Solages pled guilty to charges of disorderly conduct after allegedly assaulting his girlfriend and was required to participate in a 26-week \"batterer intervention program.\"",
    "? PA-10: Former state Auditor Eugene DePasquale said Monday that he wouldn't seek a rematch against Republican Rep. Scott Perry, the Freedom Caucus head who beat him 53-47 in 2020.",
    "Ronchetti on his way out torched the convention as \"just another example of a flawed process,\" and even the other contenders agreed Saturday's proceedings did not go well at all.",
    "Republican Secretary of State John Merrill said he'd allow each party to decide which deadline to honor, but the state GOP declined to forward Coleman's filing along to Merrill.",
    "Broward County Commissioner Jared Moskowitz strongly hinted he would run, saying, \"There are decisions that have to be made and I'll be making my announcement in coming days.\"",
    "? FL-22: Democratic Rep. Ted Deutch announced Monday that he would not seek re-election and would instead take over as CEO of the advocacy group the American Jewish Committee.",
    "Our live coverage will begin at Daily Kos Elections at 8 PM ET / 7 PM CT when polls close in most of Texas (the small portion in the Mountain Time Zone closes an hour later).",
    "Cruz goes on to reference Schmitt's role in an unsuccessful lawsuit to overturn Biden's victory by declaring, \"And when it mattered most, he fought to secure our elections.\"",
    "If no one takes at least 30% of the vote, the runner-up would be able to seek a July runoff; the GOP nominee will be favored to hold a seat Trump would have carried 54-44.",
    "While the GOP argued that the delay in results was done in the name of \"election integrity,\" Dow said that some delegates left before the long voting process was done.",
    "It also finds the Republicans running for governor, incumbent Brian Kemp and former Sen. David Perdue, outpacing Democrat Stacey Abrams 49-44 and 47-45, respectively.",
    "That ludicrous but unsurprising claim gave Keller the most national attention he'd ever experience until he surprised pundits with his Monday retirement announcement.",
    "There are plenty of Republicans who could get in ahead of the April filing deadline, and The Oklahoman mentions state House Speaker Charles McCall as a possibility.",
    "Deutch himself worked in real estate when he became active in Sunshine State politics in the 1990s raising money for both of Bill Clinton's presidential campaigns.",
    "State law requires candidates earn at least 20% of the convention vote in order to automatically make the ballot, and Dow and retired Army National Guard Brig.",
    "The new version of this Harrisburg-based seat, though, would have favored Trump 51-47, which makes it only a hair redder than his 51-48 score in the old 10th.",
    "The field may be about to attract another congressman, as Read Frontier Reese Gorman reports that Rep. Kevin Hern is \"expected\" to announce this week.",
    "Deutch went on to attract national attention for his gun safety advocacy in 2018 after the Parkland school massacre, which occurred in his district.",
    "However, while Mullin pledged to serve just three terms in the House, he indicated in 2016 that he was interested in sticking around much longer.",
    "The current version of the 22nd District, a South Florida seat that includes Boca Raton and northeast Broward County, supported Joe Biden 57-42.",
    "The narrator decries unnamed \"false attacks\" before saying of the challenger, \"Smith got rich targeting veterans who can't pay medical bills.\"",
    "Woodhouse's husband went the pithy route: He texted WLOS reporter Caitlyn Penter that the candidate had \"this simple statement: 'UNDETERRED!'\"",
    "? OR-05: The Oregon Education Association recently endorsed Jamie McLeod-Skinner's May Democratic primary challenge to Rep. Kurt Schrader.",
    "Wheeland dropped out right before the party assembly began, and delegates awarded Keller the nomination on the fourth round of balloting.",
    "Still, the Philadelphia Inquirer's Jonathan Tamari tweets that \"a lot of Republicans were actually looking forward to Keller vs Meuser.",
    "Mullin joins Luke Holland, who resigned as the senator's chief of staff just before he launched his own bid with Inhofe's endorsement.",
    "Then there's former state GOP chair Jennifer Carnahan, whose husband, Rep. Jim Hagedorn, died last month and created this vacancy.",
    "On the Republican side, state Rep. Jeremy Munson has now entered the race, while Austin City Councilman Jason Baskin has said no.",
    "Pastor Jackson Lahmeyer, who is currently waging a longshot bid against Lankford, also confirms he's thinking of switching races.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Block, though, argued that Ronchetti only made this appeal because he already knew he wouldn't take at least 20% of the vote.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "We've put together our preview of the night's key races in the Lone Star State ahead of our first liveblog of the year.",
    "Redistricting is still in progress in Florida, but it's very likely that this will remain a reliably blue constituency.",
    "On Feb. 7, however, the Supreme Court stayed that ruling, allowing elections to go forward this year using the new map.",
    "The work Sen. Boozman's doing will save many lives and families having to go through what our family's gone through.\"",
    "However, the map implemented by the court last week didn't give Cawthorn a dark red open seat to run for this time.",
    "And you'll want to bookmark our primary calendar, which includes the dates for primaries in all 50 states.",
    "The commercial goes on to commend him for bringing \"people hope\" and calls him a \"Democrat with backbone.\"",
    "The announcement comes a little more than two weeks ahead of the March 15 candidate filing deadline.",
    "If the court \"applies the law fairly,\" these claims \"should be dead in the water,\" he concludes.",
    "Mullin, though, rebounded in 2020 with an 80-13 primary victory against state Sen. Joseph Silk.",
    "Kim reported raising $1.2 million in the fourth quarter of 2021 and had $2.6 million on hand.",
    "In a recording of a phone call released last year, Carnahan was heard saying, \"I don't care.",
    "Engle goes on to praise the incumbent \"for fighting to get President Trump's wall finished.",
    "State Senate Minority Leader Lauren Book, though, quickly took her name out of contention.",
    "I would never place the people of Charlotte over the people of [western North Carolina].\"",
    "You can find details on these contests, as well as a whole lot more, in our preview.",
    "When two of his students were gunned down, John ran for mayor to stop the violence.\"",
    "? CA-40: Physician Asif Mahmood just picked up an endorsement from Democratic Gov.",
    "It took very little time for several local Democrats to start expressing interest.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "The narrator says of the candidate, \"Moved to Braddock to start a GED program.",
    "The congressman's outside group allies have deployed $800,000 to defend him.",
    "Edwards tweeted, \"I welcome all candidates  old and new  to the NC-11 race.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Gavin Newsom, who in 2019 appointed him to the state's medical board.",
    "Gen. Greg Zanetti, who clocked in with 23%, cleared the threshold.",
    "Cuellar, though, isn't the only incumbent who could be in danger.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Moskowitz left the state House in 2018 to join Republican Gov.",
    "You can also follow us on Twitter for blow-by-blow updates.",
    "I stand firm in my unwavering commitment to this district.",
    "And of course, schools have to be open and masks off.\"",
    "\"But,\" Hasen adds, \"these days, that's a big 'if.'\"",
    "These are the first numbers we've seen of the race.",
    "(Our next stop will be Indiana and Ohio on May 3.)",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Jim, he's going to die of cancer in two years.\"",
    "Check out our new podcast, The Downballot!",
    "Some bad blood out there toward Meuser.\"",
    "? NY-Gov, NY-AG: Disgraced former Gov.",
    "And New Yorkers lost a proven leader.\"",
    "This is a short blurb about Daily Kos.",
    "Former state House Speaker T.W.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "A forgotten steel town.",
    "? PA-Sen: Lt. Gov.",
    "Please read it."
  ]
}