{
  "id": 1962,
  "mediaId": 43,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 4/25",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/4/25/2093469/-Daily-Kos-Elections-Live-Digest-4-25",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    652,
    821,
    843,
    864,
    1574,
    1695,
    1766,
    1853,
    2095,
    2256,
    2303,
    2315
  ],
  "sentences": [
    "Steve Sisolak, by labeling them a bunch of keyboard cowboys? who talk tough about immigration.? Lombardo continues by saying that unlike his rivals, I've deported thousands.?\n Monday, Apr 25, 2022  12:54:03 PM Pacific Daylight Time  Jeff Singer\nMN-01: Republicans in the new 1st Congressional District held their convention over the weekend, but while a majority of delegates backed state Rep. Jeremy Munson, he was unable to take the requisite 60% needed to secure the party endorsement for the full two-year term.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWhy House Democrats' best defense is a good offense\nThe Downballot\nFollowShare\n0:0044:11\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\n Monday, Apr 25, 2022  11:28:14 AM Pacific Daylight Time  Stephen Wolf\nVT-Sen: University of New Hampshire: Peter Welch (D): 62, Christina Nolan (R): 27\n Monday, Apr 25, 2022  11:32:42 AM Pacific Daylight Time  Stephen Wolf\nGA-Gov: The NRA has endorsed Gov.",
    "The independent also focused on recent revelations that Lee worked to overturn Trump's 2020 defeat in his brief speech to convention delegates Saturday, saying, We will show the rest of the country how we beat people like Mike Lee who try to overturn our democracy in the shadows.? McMullin, unlike most nonaligned candidates, will have the money to make his case, though Lee still ended March with a wide $2.4 million to $847,000 cash-on-hand lead.",
    "One reason he may be holding off on making a decision, though, is that several advocacy groups and Florida voters filed a lawsuit in state court last week alleging that the new map violates the state constitution's prohibitions on partisan gerrymandering and diluting minority representation, which could result in something close to the existing 5th District getting revived if the plaintiffs prevail.",
    "Weston, whose supporters booed McMullin when he addressed the gathering, did not explicitly endorse him afterwards, though he put a statement declaring, [Let's all help defeat Mike Lee -- the sooner the better.?\nMcMullin, who took 21% in the state in the 2016 presidential race as an anti-Trump conservative, has used his new campaign to argue that Utah needs to replace the extremist Lee.",
    "Monday, Apr 25, 2022  12:57:38 PM Pacific Daylight Time  Jeff Singer\nMN-03: Navy veteran Tom Weiler defeated businessman Mark Blaxill on Saturday to win the Republican Party endorsement to take on Democratic Rep. Dean Phillips; Blaxill does not appear to have said if he'll file to compete in the August primary for a seat Biden would have carried 59-38.",
    "Lawson for three terms has represented a plurality-Black 5th District spanning from Tallahassee to Jacksonville, and Republicans targeted him with their recently enacted congressional map by breaking up the 5th District to ensure that both cities were drawn into majority-white districts that favored Republicans, leaving Lawson with no great options.",
    "Monday, Apr 25, 2022  1:30:24 PM Pacific Daylight Time  Stephen Wolf\nMA-04: Former Brookline Selectwoman Jesse Mermell, who just barely came up short by 22-21 in the crowded Democratic primary against freshman Rep. Jake Auchincloss when the current version of this seat was open in 2020, has announced that she won't seek a rematch this cycle.",
    "Monday, Apr 25, 2022  1:19:15 PM Pacific Daylight Time  Stephen Wolf\nFL-02, FL-05: Democratic Rep. Al Lawson told Politico on Sunday that if he decides to run again, he would do so in the Tallahassee-based 2nd District against Republican Rep. Neal Dunn rather than in the new 5th, which is contained to the Jacksonville area.",
    "Monday, Apr 25, 2022  1:52:47 PM Pacific Daylight Time  Stephen Wolf\nNC-11: State Sen. Chuck Edwards' latest ad for next month's Republican primary cuts right to the chase and calls far-right Rep. Madison Cawthorn an Instagramer who posts all day but doesn't actually do anything to solve the country's ongoing problems.",
    "Additionally, prior to his initial 2016 victory in the current 5th following court-ordered redistricting, Lawson made two runs for Congress in older versions of the 2nd District that contained a large majority of the new 2nd's territory, coming up short by close margins in the 2012 general election and 2010 primary.",
    "Monday, Apr 25, 2022  12:05:04 PM Pacific Daylight Time  Jeff Singer\nUT-Sen: In a surprising move, delegates to Utah's state Democratic convention voted on Saturday to back conservative independent Evan McMullin's campaign to unseat Republican Sen. Mike Lee rather than put forward their own nominee.",
    "Monday, Apr 25, 2022  12:03:15 PM Pacific Daylight Time  Stephen Wolf\nWI-Gov: Wealthy businessman Tim Michels has announced he is joining the Republican primary for governor this August, and the Wisconsin State Journal reports that he's poised to go up with a \"high-dollar\" TV ad buy soon.",
    "Monday, Apr 25, 2022  12:21:43 PM Pacific Daylight Time  Jeff Singer\nNV-Gov: Clark County Sheriff Joe Lombardo uses his very first ad for the June Republican primary to go negative intra-party foes North Las Vegas Mayor John Lee and former Sen. Dean Heller, as well as Democratic Gov.",
    "Michels co-owns a construction company and previously ran for office a couple of times in previous decades, but his last attempt way back in 2004 saw him decisively lose that year's Senate contest as the GOP nominee against former Democratic Sen. Russ Feingold, who prevailed 55-44.",
    "However Lawson argued that his ties to the area are much deeper and broader than a quick glance at the toplines might suggest: Lawson represented much of this area, including several conservative counties outside of Tallahassee, when he was in the state Senate from 2000 to 2010.",
    "Auchincloss, a relative moderate who benefitted last time from multiple more progressive opponents splitting the vote, faces no notable opponent in the September primary this time around, and time is quickly running out for one to materialize before the May 10 filing deadline.",
    "In Utah, as we've previously explained, candidates either needed to have turned in the requisite number of signatures or win enough support at their state party convention, and while contenders can simultaneously try both options, Weston only went with the convention route.",
    "The GOP did not do a convention for the special election because redistricting was completed just before Republican Rep. Jim Hagedorn died, though an endorsement for the regularly-scheduled race could still have given one of contenders a lift in the May 24 primary.",
    "Monday, Apr 25, 2022  1:19:28 PM Pacific Daylight Time  Jeff Singer\nUT-01: Retired intelligence officer Andrew Badger outpaced freshman Rep. Blake Moore 59-41 at Saturday's Republican convention, which secured the challenger a spot on the June primary ballot.",
    "Prominent Democrats, including former Rep. Ben McAdams and Salt Lake County Mayor Jenny Wilson, had previously endorsed McMullin, with Wilson explicitly urging Team Blue against fielding a candidate of its own in order to avoid splitting the anti-Lee vote.",
    "Cawthorn is also facing further opposition from a super PAC with ties to GOP Sen. Thom Tillis called Results for NC, which has allocated an additional $126,000 to bring its total ad spending here up to just over half a million in only the last few days.",
    "Monday, Apr 25, 2022  1:25:00 PM Pacific Daylight Time  Jeff Singer\nUT-03: Former state Rep. Chris Herrod led Rep. John Curtis 55-45 at the weekend's GOP convention, but Herrod heads into their June primary showdown with less than $3,000 to spend.",
    "But Weston, who was the 2020 nominee against 2nd District Rep. Chris Stewart last cycle, still went forward with his bid, and because he was the only Democratic candidate to file, it looked like he'd be on the November ballot.",
    "This will be the third face off between Curtis and Herrod for a safely red seat in the Provo area and southeastern Utah: Curtis won the 2017 special primary 43-33, and he prevailed 73-27 in their rematch the following year.",
    "The decision, which ended the campaign of Democrat Kael Weston, gives McMullin a better chance to put together a winning general election coalition in this very red state, though he'll still be in for a very tough contest.",
    "He led former Department of Agriculture official Brad Finstad 55-35 in the seventh round, but attendees voted on Sunday at 1 AM local time to disperse after concluding that no one would outright win.",
    "If Lawson does choose to run in the 2nd, he'll be facing sizable headwinds in a seat that Donald Trump would have carried by 55-44 in an area that has been trending to the right over the last decade.",
    "In a sign of which way he may be leaning, Lawson also recently told a local TV reporter that his \"plan right now is to be on the ballot,\" though that isn't quite a firm commitment to running again.",
    "Monday, Apr 25, 2022  1:35:17 PM Pacific Daylight Time  Stephen Wolf\nNC-01: Retiring Democratic Rep. G.K. Butterfield has endorsed state Sen. Don Davis to succeed him in the May 17 primary.",
    "Still, with Joe Biden sporting a low approval rating and the midterms shaping up to favor Republicans this fall, Lawson would have his work cut out for him if he chooses to run here.",
    "Edwards draws a contrast by claiming he \"fought the liberals [in state government] and won,\" pointing to how advanced conservative positions on taxes, guns, and immigration.",
    "Badger, whom Cachevalleydaily.com says delivered brief speeches that sounded more like revival meetings,? has pledged to join the far-right House Freedom Caucus.",
    "The story says that Moore, by contrast, has a carefully cultivated reputation for bipartisanship,? but he tried out more conservative rhetoric on Saturday.",
    "Rob Bishop, will also be competing in the primary because, like Moore, she collected enough signatures to advance no matter how the weekend gathering went.",
    "But it's the end of the line for both Vineland Mayor Julie Fullmer and businessman William Campbell, who were only pursuing the convention route.",
    "Cannon has faulted Moore with not living in this safely red northern Utah seat, while Badger's objections are more ideological.",
    "However, the Beehive State's unusual ballot access laws gave McMullin's Democratic allies a chance to block Weston on Saturday.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Following the news of Michels' entry into the race, GOP Rep. Tom Tiffany has reiterated his support for former Lt. Gov.",
    "Rebecca Kleefisch, who has held large leads in the few polls taken to date, though with many voters still undecided.",
    "Neither Cannon nor Badger has much money available to make their case against Moore to primary voters, however.",
    "Also in the running for Republicans are 2018 Senate candidate Kevin Nicholson and state Rep. Timothy Ramthun.",
    "Furthermore, Lawson currently represents only 31% of the redrawn 2nd's population compared to 64% for Dunn.",
    "That meant that, when delegates voted 57-43 not to nominate anyone, he had no fallback option.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "Former Morgan County Councilmember Tina Cannon, who has the support of former Rep.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "By one o'clock, everybody was getting kind of grumpy,? explained one delegate.",
    "The group recently went up with a spot calling out Cawthorn as a serial liar.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "It's also a place to discuss elections, not policy.",
    "Brian Kemp ahead of the May 24 Republican primary.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Ultimately, though, Munson fell just short.",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "New episodes every Thursday morning.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}