{
  "id": 2689,
  "mediaId": 129,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Pressure Mounts on Cawthorn as Scandals Pile Up",
  "image": "https://static01.nyt.com/images/2022/04/29/us/politics/29dc-cawthorn-1/29dc-cawthorn-1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/29/us/politics/madison-cawthorn.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    2091,
    2091,
    2303,
    1425,
    1425,
    821,
    821,
    1147,
    1147,
    428,
    562,
    562,
    428,
    2932,
    2932,
    2959,
    2834,
    2834,
    2959
  ],
  "sentences": [
    "The description is consistent with a description that Mr. Cawthorn provided in a link on Twitter, when he dismissed the photos, saying, I guess the left thinks goofy vacation photos during a game on a cruise (taken waaay before I ran for Congress) is going to somehow hurt me??\nMs. Burns also provided a link to a dating app for the cruise from someone identified as Cawthorn,? using the same photo that was published in Politico, saying, Im in search of sexy women or couples for some wild sexapades.",
    "Still, the dirt being dished is coming from Republicans  not in Washington but in North Carolina, said David B. Wheeler, president of American Muckrakers PAC, a group he said was put together to hold Cawthorn accountable.?\nMr. Wheeler's group, run by Western North Carolina Democrats, filed an incendiary ethics complaint on Wednesday that included a video of Mr. Cawthorn with a senior aide, Stephen L. Smith.",
    "I can understand the establishment attacking those beliefs, but just digging stuff up from my early 20s to smear me is pathetic.?\nAt 26 years old, Mr. Cawthorn is not far removed from his early 20s, and Republicans running to unseat him in the May 17 North Carolina primary said the drumbeat of revelations could put his seat at risk if he secures the nomination for a second term.",
    "Another former aide, Lisa Wiggins, went public in an audio recording released by Mr. Wheeler with her consent, saying, We all want the ultimate goal of him never serving again.?\nRepublicans in the state insist that accusations of lawlessness and neglect of his district are more damaging than details of his sex life.",
    "The photos of Mr. Cawthorn in women's lingerie, first published in Politico, stemmed from a bawdy game aboard a cruise that he took before he was elected to the House, said Melissa Burns, a self-described conservative Republican from Tennessee who witnessed the game, part of an onboard show.",
    "In rapid succession, Mr. Cawthorn, who entered Congress as a rising star of the party's far right, has been accused of falsely suggesting that his Republican colleagues routinely throw cocaine-fueled orgies, insider trading and an inappropriate relationship with a male aide.",
    "In the video, Mr. Cawthorn, in the driver's seat of a car, appears to say, I feel the passion and desire and would like to see a naked body beneath my hands.?\nThe camera then pans back to Mr. Smith who says, Me too? as he places his hand onto Mr. Cawthorn's crotch.",
    "After the story broke in The Daily Mail, Mr. Cawthorn posted on Twitter, Many of my colleagues would be nowhere near politics if they had grown up with a cell phone in their hands?  not exactly a denial but a suggestion that other members should not cast stones.",
    "Washington Republicans scoff at the notion that a solidly conservative district could be at risk during a year in which they are heavily favored, but early voting began this week as the avalanche of accusations against Mr. Cawthorn was gaining steam.",
    "It also suggested that Mr. Cawthorn, who, according to the complaint, lives with the aide, has violated rules put in place during the #MeToo movement that bar lawmakers from having sexual relationships with employees under their supervision.",
    "He said legal authorities have taken no action after Mr. Cawthorn's two firearms charges, his brush with law enforcement over expired licenses or his failure to obtain hunting and fishing licenses, despite boasting that he does both.",
    "You wont be disappointed.?\nLuke Ball, a spokesman for Mr. Cawthorn, did not deny Ms. Burns' description of the lingerie game, but he said the dating app was a fake that used the wrong age, wrong hometown and wrong name of the ship.",
    "And the far-right, anti-establishment wing of the party now views the first-term congressman with similar skepticism, as someone who is falsely selling himself as a gatekeeper in his state to former President Donald J. Trump.",
    "WASHINGTON  Besieged by multiplying scandals and salacious accusations, Representative Madison Cawthorn, Republican of North Carolina, is under mounting pressure from both parties to end his short career in Congress.",
    "That came just days after pictures surfaced of him wearing women's lingerie as part of a cruise ship game, imagery that might not go over well in the conservative stretches of his Western North Carolina district.",
    "The Congressional Leadership Fund, the super PAC aligned with House Republicans, and the National Republican Congressional Committee, which don't involve themselves in primaries in states where a G.O.P.",
    "Still, the former president himself endorsed Mr. Cawthorn last year and has continued to stand by him; Mr. Trump invited the congressman to appear at a rally with him this month in Selma, N.C.",
    "Mr. Wheeler provided The Times with a screenshot of the anonymous text he received that included the video, and he said he believed the tipster to be a former Cawthorn campaign aide.",
    "For the finale, the audience was divided into teams, each of which selected a man to dress as a woman, the sexier she' is, the more points you get,? Ms. Burns said in an email.",
    "A political group supporting Senator Thom Tillis, Republican of North Carolina, has been pouring money into an ad campaign accusing Mr. Cawthorn of being a fame-seeking liar.",
    "The far-right wing of the party once viewed Mr. Cawthorn, a telegenic congressman who uses a wheelchair after a car crash at the age of 18, as a young leader with potential.",
    "Representative Madison Cawthorn of North Carolina, once a bright young star in the conservative firmament, finds himself besieged by accusations and insinuations.",
    "Ms. Beach-Ferrara called Mr. Cawthorn a troubled young man.?\nI hold him in my prayers, but I believe he is not fit to serve in office,? she said in an interview.",
    "After initially blaming Democrats for the onslaught, Mr. Cawthorn on Friday said it was Republicans who were targeting him because he threatens the status quo.",
    "A legal effort led by North Carolina Democrats to label him as an insurrectionist? and constitutionally disqualify him from the ballot failed last month.",
    "This week, he was detained at an airport, where police said he tried to bring a loaded handgun onto an airplane, the second time he has attempted that.",
    "Many of them have noted that even Donald Trump Jr., a popular figure on the right, has stayed quiet and made no attempt to come to his defense.",
    "They describe Mr. Cawthorn as someone who is Twitter famous,? but who does not work the district and lacks grass-roots support at home.",
    "The group is supporting the campaign of a more mainstream Republican, State Senator Chuck Edwards, who is running against Mr. Cawthorn.",
    "Now its members keep him at arm's length and view him as a troubled individual who isn't always aligned with the base on the issues.",
    "Democrats say they are most concerned with Mr. Cawthorn's support for the protesters who attacked the Capitol on Jan. 6, 2021.",
    "He could absolutely lose,? said Michele Woodhouse, one of seven Republicans challenging Mr. Cawthorn in the primary.",
    "I don't see MAGA voters being quite this forgiving,? said Jason Miller, an adviser to the elder Mr. Trump.",
    "The ethics complaint said Mr. Cawthorn has provided loans to Mr. Smith in violation of House rules.",
    "And last month he was charged with driving with a revoked license for the second time since 2017.",
    "I want to change the GOP for the better, and I believe in America First,? he wrote on Twitter.",
    "The deluge of revelations and charges have left him on an island even within his own party.",
    "Jasmine Beach-Ferrara, continues to raise money off her Republican opponent's foibles.",
    "candidate is positioned to win a general election, are staying out of the fracas.",
    "But the revelations about his conduct are making a splash.",
    "But Mr. Wheeler said his group will keep up the pressure.",
    "The guy hasn't been held accountable,? Mr. Wheeler said.",
    "His leading Democratic opponent, the Rev.",
    "The hits are taking a toll.",
    "Mr. Cawthorn volunteered."
  ]
}