{
  "id": 2738,
  "mediaId": 195,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Cawthorn challenger knocks opponent for Instagram use in new ad",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/cawthornmadison_033022gn2_lead.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3462822-cawthorn-challenger-knocks-opponent-for-instagram-use-in-new-ad/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell/",
  "termIds": [
    821,
    821,
    1147,
    1147,
    1563,
    1563,
    2087,
    2087,
    2303,
    2286,
    2286,
    2117,
    2117,
    2303,
    2341,
    2341,
    2466,
    2466,
    262,
    262,
    428,
    539,
    539,
    428,
    2945,
    2945,
    2834,
    2834,
    2590,
    2590,
    2654,
    2654,
    2661,
    2787,
    2787,
    2661
  ],
  "sentences": [
    "Cawthorn responded to the report on Twitter, writing, I guess the left thinks goofy vacation photos during a game on a cruise (taken waaay before I ran for Congress) is going to somehow hurt me??\nThey're running out of things to throw at me,? he added before inviting his followers to share your most embarrassing vacay pics in the replies.?\nDays before that, a former district staff member who worked for the congressman accused him of improperly firing her after being denied family and medical leave.",
    "The ad released by state Sen. Chuck Edwards, one of a number of Republicans taking on Cawthorn in the Tar Heel State's primary race, features photos Cawthorn posted on Instagram of himself on a boat, smoking a cigar and drinking a pineapple drink, among others.",
    "Lisa Wiggins, the former district staff member, also said the office had more liquor bottles than they do water bottles.?\nA handful of Republicans are now challenging Cawthorn in the primary to represent North Carolina's 11th Congressional District.",
    "Edwards made headlines after securing an endorsement from Sen. Thom Tillis (R-N.C.), who said Cawthorn has fallen well short of the most basic standards Western North Carolina expects from their representatives.?\nThe primary is scheduled for May 17.",
    "The state senator said he will take the fight to Congress and leave social media to the other guys.?\nThree of the photos in the advertisement were posted by Cawthorn in 2019, before he was elected to the House.",
    "A state senator challenging Rep. Madison Cawthorn (R) in the North Carolina released a new ad on Monday knocking the congressman for his use of Instagram.",
    "The two videos featured in the ad  one of him working out and another of him punching a tree  were not immediately located on his Instagram account.",
    "They show us their workout, what they eat, where they go, but they accomplish nothing,? Edwards said at the beginning of the 30-second video.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Most recently, Politico released photos showing him wearing women's lingerie at what appears to be a party.",
    "While they post online America falls apart, prices rise, crime goes up, borders remain open,? he added.",
    "The outlet obtained the photos from a person who was previously close to Cawthorn and his campaign.",
    "The advertisement comes at a time when Cawthorn is under scrutiny for a number of controversies.",
    "It argues that Cawthorn has made a name for himself with his image but has accomplished little.",
    "Cawthorn needs to secure at least 30 percent of the vote to win the GOP nomination.",
    "The claim was made during a phone call with the head of an anti-Cawthorn PAC.",
    "They call it Instagram famous  famous for what they post online.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The Hill has reached out to Cawthorn for comment."
  ]
}