{
  "id": 2826,
  "mediaId": 43,
  "date": "4/16/2022 12:00:00 AM",
  "headline": "DKos Asheville Open Thread: Replacing Cawthorn, Meadows voter fraud, WNC judges all",
  "image": "https://images.dailykos.com/images/1059938/story_image/SDKNC-11Demdebate.jpg?1650114287",
  "link": "https://www.dailykos.com/story/2022/4/16/2092330/-DKos-Asheville-Open-Thread-Replacing-Cawthorn-Meadows-voter-fraud-WNC-judges-all-white-150-yrs",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1039,
    1039,
    2303,
    2176,
    2176,
    2303,
    571,
    301,
    301,
    571,
    2834,
    2834,
    2654,
    2654
  ],
  "sentences": [
    "North Carolina's 11th Congressional District election, 2022 (May 17 Democratic primary)\nElections in North Carolina, 2022\nPrimary date: May 17, 2022\nMail-in registration deadline: April 22, 2022\nOnline registration deadline: April 22, 2022\nIn-person registration deadline: April 22, 2022\nEarly voting starts: April 28, 2022\nEarly voting ends: May 14, 2022\nPoll times: 6:30 a.m. to 7:30 p.m.\nAbsentee/mail-in voting deadline: May 17, 2022\nOn the ballot: U.S. Senate  U.S. House  State Senate  State House  Supreme court  Appellate courts  State ballot measures  Local ballot measures  School boards  Municipal \n NC-11 Democratic Candidates 2022\n5 of 6 Democratic candidates for NC 11 face off in McDowell County debate\nWLOS, Samiar Nefzi, 4/12/2022\nMARION, N.C. (WLOS)  Five Democratic congressional candidates for North Carolina's 11th Congressional District seat went head-to-head in a debate Tuesday night at McDowell Technical Community College.",
    "Madison Cawthorn bails on congressional debate as GOP officials turn on him\nRaw Story, Matthew Chapman, 4/11/2022\nOn Monday, The Asheville Citizen Times reported that Rep. Madison Cawthorn (R-NC), facing increasing opposition from his own party for seeking a second term in office, declined to show up at a primary debate in his district.",
    "Right now, we don't have a designated caseworker to serve veterans, even though we have a lot of veterans in WNC.?\nJasmine Beach-Ferrara\nIt is about working alongside people, shoulder to shoulder, so that they can live out their dreams in their hometown,\"\nBynum Lunsford\nWe had a Black president, Black mayors, Black police chiefs.",
    "I think it's about time the people of Western North Carolina have a person who cares about them.?\nBo Hess\nI do think we need to be building better infrastructure around cybersecurity, making sure our elections are resilient to any interference both domestic and foreign,?\nJay Carey\nThat is very important,? Carey said.",
    "For the roughly hour-long debate, the five candidates answered questions on several topics, including which Republicans and Democrats they would most likely work with, the type of bills they would help sponsor in Congress and the challenges Western North Carolina faces.",
    "This comes after Cawthorn, a firebrand ally of former President Donald Trump, claimed that many of his Republican colleagues on Capitol Hill engage in cocaine-fueled sex orgies  a claim for which he has provided no evidence and which infuriated GOP leaders.",
    "Mark Meadows removed from NC voter rolls after he's caught voting in Virginia\nRaw Story, David Edwards, 4/13/2022\nFormer White House Chief of Staff Mark Meadows will no longer be allowed to vote in North Carolina after he was caught voting in Virginia.",
    "Madison Cawthorn reveals fundraising woes as Democrats try novel strategy to unseat him\nRaw Story, Bob Brigham, 4/15/2022\nControversial Rep. Madison Cawthorn (R-NC) revealed fundraising woes when his campaign finance reports were made public on Friday.",
    "Melanie Thibault, Macon County Board of Elections director, told the Asheville Citizen Times Tuesday that she consulted with the North Carolina Board of Elections staff after discovering that Meadows was registered in North Carolina and Virginia.",
    "Mark Stop the Steal' Meadows removed from voter roll in North Carolina amid voter fraud probe\nDaily Kos, Rebekah Sager, 4/13/2022\nWelp, I guess it's official: Former Trump lackey Mark Meadows has been removed from North Carolina's voter rolls.",
    "While other federal court districts in North Carolina and across the Southeast have added racial and gender diversity to their benches, the Western District's Article III? judges have remained exclusively white and male dating back to 1872.",
    "Several Democrats take on incumbent Rep. Cawthorn\nWLOS, Kimberly King, 3/30/2022\nCongressman Madison Cawthorn, who represents North Carolina's 11th District, faces his first re-election on May 17 against seven Republican challengers.",
    "In February, U.S. District Judge Max Cogburn of Asheville announced that he intends to move to senior status, which would allow him to carry a lighter case load and would create a vacancy on the Western District bench.",
    "That means he can't pretend to live in a mobile home in Scaly Mountain in Macon County, North Carolina, in order to vote there while actually living in Virginiawhere he also apparently registered to vote.",
    "Group accuses Rep. Cawthorn of violating campaign sign rules\nWLOS, 4/12/2022\n The political action committee Fire Madison Cawthorn has accused the congressman's campaign of violating rules about signs.",
    "APRIL 12, 2022 - Five Democratic congressional candidates for North Carolina's 11th Congressional District seat went head-to-head in a debate Tuesday night at McDowell Technical Community College.",
    "The 150-year-old federal court district, which stretches from east of Charlotte to the Tennessee and Virginia state lines, has never had a woman or a person of color serve as a trial judge.",
    "It's up to the Henderson County Sheriff's Office to police the signs, and the North Carolina Department of Transportation is responsible for removing the signs, if there are violations.",
    "It also comes as local North Carolina GOP leaders, including the state Senate President Pro Tempore and state Speaker of the House, have endorsed state Sen. Chuck Edwards against him.",
    "If Rep. Cawthorn wins the primary, some Democrats in the running say they're hoping to capitalize on his controversial image and flip the heavy Republican-leaning district blue.",
    "Sen. Thom Tillis (R-NC), Republican state Senate President Pro Tempore Phil Berger, and state House Speaker Tim Moore are backing state Sen. Chuck Edwards in the GOP primary.",
    "The Asheville Citizen-Times first reported that the former Trump aide had been removed from Macon County voter rolls by Board of Elections Director Melanie Thibault.",
    "We offer this space every weekend to share what we're up to in Western North Carolina and to give readers a variety of links to local and regional news of interest.",
    "DKos Asheville and other local and state groups can give us all a better sense of connection, a better understanding of who we stand with, work with and share with.",
    "Daily Kos fights for a progressive America by empowering its community and allies with information and tools to directly impact the political process.",
    "But he was also pro-Second Amendment and pro-life, stances he acknowledges Republicans felt comfortable voting and crossing party lines.",
    "Cawthorn's re-election efforts were complicated by his accusation that Republican members of congress engage in cocaine-fueled orgies.",
    "Western North Carolina University's Dr. Chris Cooper helmed the debate as moderator on behalf of the McDowell County Democratic Party.",
    "Cawthorn's team said he has already attended two Republican debates, and he's balancing his duties in Washington while campaigning.",
    "Cawthorn reported spending more money than he raised and after accounting for his debts, only has a net $115,575 cash on hand.",
    "He might do 'a couple' more but was not planning to attend the Agricultural Center event, Ball said,\" reported Joel Burgess.",
    "\"Cawthorn spokesperson Luke Ball said there were more than 10 debates scheduled and the congressman had committed to two.",
    "Shuler said he feels his position as not far-left leaning would still be the only way a Democrat could win the district.",
    "\"But with this election, we have so many candidates on the ballot that I think it's going to be more of a problem.",
    "Charlotte Observer, 4/13/2022\nThis month, President Joe Biden and the U.S. Senate made Supreme Court history.",
    "You do your time; you pay your penalties; you should be given all the rights every citizen of America has.\"",
    "Katie Dean\nI think we should have representation that reflects that fabric of our community and who we are.",
    "The reports show his campaign spent $443 on Chick-Fil-A, $1,371 on \"Papas Beer,\" and $2,560 on Amazon.",
    "\"We had Mark Meadows, an empty seat, and now we have Cawthorn,? candidate Jasmine Beach-Ferrara said.",
    "We hope this local and wider community can help leverage our orange passion for progressive politics.",
    "I'm sorry.?\nMarco Gutierrez\nInitially told organizers he would be in attendance but did not show up.",
    "North Carolina state law requires voters to be removed from the rolls if they vote in another state.",
    "Shuler was known as a moderate blue dog Democrat, focused on being a strong fiscal conservative.",
    "A common sentiment among the candidates is to unseat current Republican Rep. Madison Cawthorn.",
    "Heath Shuler was the last Democrat to hold the seat and served two terms from 2007 to 2013.",
    "Henderson County elections director Karen Hebb said guidelines are broken every year.",
    "The complaints include signs on utility poles and the size and weight of the boards.",
    "\"On any given day, he's an embarrassment,\" Sen. Thom Tillis (R-NC) said of Cawthorn.",
    "Thanks for reading and contributing, I hope your holiday weekend is a fine one.",
    "A complaint was filed Monday with the North Carolina State Board of Elections.",
    "This is the weekly DKos Asheville Open Thread for Saturday, April 16th, 2022.",
    "The last election he voted in Macon County was in 2020,\" she told the paper.",
    "Today, we are shifting gears from the past to the future, please join us.",
    "Please jump the fold for links to weekly stories I hope you find useful.",
    "\"What I found was that he was also registered in the state of Virginia.",
    "\"What I found was that he was also registered in the state of Virginia.",
    "The last election he voted in Macon County was in 2020,\" Thibault said.",
    "US courts of Western NC have had only white male judges for 150 years.",
    "But Cawthorn is ranked 18 out of 430 for missing the most House votes.",
    "Everywhere there are Blacks, I don't know what the problem is.",
    "Now it may be the Western District of North Carolina's turn.",
    "Everybody wants to get that prime location,\" Hebb said.",
    "(Latinos for Trump)\nWhat would it take to flip NC-11?",
    "It claims there are 11 locations breaking the rules.",
    "The board removed him from their voter rolls.",
    "Biden now has an opportunity to change that.",
    "Good day and welcome to DKos Asheville.",
    "And he voted in a 2021 election.",
    "And he voted in a 2021 election.",
    "There is no problem.",
    "Is that changing?"
  ]
}