{
  "id": 2869,
  "mediaId": 43,
  "date": "4/7/2022 12:00:00 AM",
  "headline": "The Downballot: How Democrats are fighting to hold the House (transcript)",
  "image": "https://images.dailykos.com/images/951832/story_image/GettyImages-182286591.jpg?1622305294",
  "link": "https://www.dailykos.com/story/2022/4/7/2090604/-The-Downballot-How-Democrats-are-fighting-to-hold-the-House-transcript",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    811,
    821,
    1147,
    1480,
    2303,
    146,
    539,
    562,
    571,
    2590,
    2666,
    2972
  ],
  "sentences": [
    "David Nir:\nAnd there's another factor here as well that we've talked about on the show before, when Republicans rolled out their first congressional map last year, Cawthorn made this crazy decision to announce that he was going to run in an essentially brand new district that he hadn't really represented at all, in a way to buttress conservative credentials, expose him to more of the state and also possibly to block another top Republican in the state legislature from running for that seat.",
    "I've watched what's gone on in Hungary these last many years, and I feel like what has happened there is what the GOP would very much like to do to America, to create a country where they can win a narrow majority of the vote or not even a majority of the vote and still win super majorities in the legislature and do exactly all the things that Orban has engaged in, especially undermining judicial independence and packing the courts with their cronies.",
    "A huge problem, the ad cited an NPR piece from a couple of years back that did, yes, describe Fetterman as a self-described socialist, except at the end of the piece, there was a huge correction that said...\nDavid Nir:\nSo we're going to migrate away from what seems to be our perversely favorite state of North Carolina, up to Pennsylvania, where just this week for the first time, the Democratic primary for Senate turned negative on the airwaves.",
    "David Beard:\nAnd we've seen in past cycles over and over again, that maybe strong campaigning and advertising maybe can't take you from a 50-seat loss to a 50-seat win or vice versa, but in every one of these waves that we've had for both Democrats and Republican, good candidates and good campaigns have withstood them and overcome those waves because they were better candidates or because they were able to successfully attack their opponents.",
    "Ali Lapp:\nWe like to save that for when the data's a little fresher and we're about to start communicating, but we're really interested in looking at important voter groups around the country and trying to listen to them and understand their frustrations and figure out what we need to do as House Democrats to better communicate with them and connect with them so that we can hold our majority and possibly expand it this November.",
    "Co-hosts David Nir and David Beard also recap elections this week in California and Wisconsin; explain why Republicans are finally turning on Madison Cawthorn (it's not really about cocaine and orgies); pick apart a huge blunder that led the first attack ad in Pennsylvania's Democratic primary for Senate getting yanked off the air the very day it debuted; and provide updates on international elections in Hungary and France.",
    "So unlike a candidate who goes out and polls and tries to figure out how do I best talk about my biography and my issues and how should I run my race, when we're polling, we're also trying to get a really good sense of a district's viability because there are limited resources even with $100 million TV reservation, and we have to make our best judgment about which districts are the best to invest in.",
    "David Beard:\nAnd Katko is one of those classics at withstanding Democratic waves, seemingly too, to their campaigns credit, they ran great campaigns and we would not be able to knock them off in the past, and luckily now, partially, maybe because of redistricting partially because of the increasing Trump nature of the caucus, he is retiring, making it a much more open runway to take that seat.",
    "David Nir:\nAli, obviously redistricting has upended the playing field across the country in so many states this year, and I'm wondering, how has the remapping process affected your planning for this year and your timeline in terms of getting involved with races, especially since we have some big states like Florida that haven't even finished the redistricting process yet?",
    "David Beard:\nSo the fact that it wasn't a terrible night for Democrats, I'm not saying it was a good night by any means, but the fact that it wasn't a terrible night does provide a little bit of hope that a wave is not imminent later in the year, but that's obviously just one factor among many that we're going to continue to keep watching.",
    "And in that wing, we also have groups like the League of Conservation Voters, EMILY's List, labor unions who have independent expenditure arms, and we all operate independently of those other two wings and do whatever we can to make sure that the House Democrat in the races that we care about is going to win their election.",
    "So you might get to the middle of October and we're running an ad in the Philadelphia market that maybe for a week we're paying $500 for, but the Republicans, because they did not reserve the time early and they just placed it in the middle of October, they might be spending $800,000 a week for that same amount of air time.",
    "David Nir:\nSo I'm curious, I know it's going back eight years now, but are there any examples from 2014 where HMP may be snatched victory from the jaws of defeat, any particular topics or ads you recall running at any specific races then that might offer instructive lessons for the environment we're facing this November?",
    "They're both expected to advance to a runoff that's going to take place two weeks later, polls have shown Le Pen narrowing her deficit in that runoff to single digits after she lost to Macron five years ago by a landslide 32% margin, it was almost two to one the degree to which Macron defeated Le Pen.",
    "While right now, Democrat Lauren Hubbard who's an official at the California Department of Water Resources, is in second with 20%, though that's not final yet because there are a couple other candidates with about 15% each, GOP businessman, Matt Stoll and another Democrat Marine veteran, Eric Garcia.",
    "We have a decently sized staff of House experts, so when these organizations who may not have as big a staff decide, \"Hey, we'd like to play in this race,\" we can immediately help them with good information, sharing our polling data, sharing our research and helping them help us win House seats.",
    "And they were always going to win the House that year, but I know that all of the outside spending they had on their side, the extra advertising, it gave them extra seats, which were then, it was much harder for us to then come back from that in 2012, because they had such an advantage in 2010.",
    "Ali Lapp:\nSo the whole mission of House Majority PAC was to even the playing field and make sure we were fighting fair and they weren't out communicating us so that no matter what the national environment, we were doing the very best we can to win as many House seats as possible for Democrats.",
    "One notable race that our friends at Bolts Magazine highlighted was that fake Trump elector Kelly Ruh, who tried to help Donald Trump steal the election in 2020 by being one of the Wisconsin electors for Donald Trump, she lost her reelection as an alderperson in De Pere, a town near Green Bay.",
    "David Beard:\nAnd in Orbn's victory speech, he lists a number of what he called left wing groups or organizations that he's overcome in this victory, amongst them, the left in Hungary, the EU, Hungarian-born billionaire George Soros, which is often the victim of antisemitic attacks in Hungary.",
    "Ali Lapp:\nIf you look back at where we were before Biden was elected, our country has moved in the right direction so enormously, whether it's from COVID or it's on the economy, things are moving in the right direction, but I don't feel like voters are giving us enough credit for that.",
    "Ali Lapp:\nSo it's a really tumultuous time, and I think voters are feeling that and voters are generally on whatever side of the aisle are angrier than they normally are, and that's something we have to reconcile and something we have to figure out if we're going to hold the majority.",
    "David Nir:\nBut one thing that stood out is there were a few media markets on your list that seemed to cover some districts that definitely got worse for Democrats during the redistricting process, for instance, Arizona's 2nd district or Michigan's 10th district, Texas' 15th district.",
    "And then we also have two brand new districts, one in the Denver suburbs in Colorado, one in the Portland suburbs in Oregon, which are both Biden-won districts, and there are primaries there, but we're really excited about the prospects of picking those seats up as well.",
    "But to bring it back to politics, there was a heartwarming photo for any Southern Democrat of Democratic governor Roy Cooper, Democratic governor Laura Kelly of Kansas at lunch, hosted by Democratic governor John Bel Edwards of Louisiana, where the Final Four was played.",
    "So I like the kinds of ad tests where voters see an ad, they'll see a couple different ads that are political, and then maybe they'll see an ad for Bounty paper towels, and they're asked, how would they vote in their congressional election or in a presidential election.",
    "In that ad, we specifically talked about the job growth we've had, the economy turning around and what we've been doing lately, Biden doing his work to lower gas prices, the House voting on Congresswoman Angie Craig from Minnesota's bill to cap the price of insulin.",
    "And I think what you'll find if you look back at the last decade is that generally when organizations, whether it's us, the DCCC, or on the Republican side, make reservations, they're adhered to with somewhere between 85 and 90% consistency at the end of the day.",
    "David Nir:\nThe big question in 2022 and one we have addressed in some way, shape or form in almost every episode of The Downballot so far is how to tackle the fact that the party in power almost always loses seats in a midterm when they control the White House.",
    "One thing that just came out this week is HMP released an ad called Rescued that touts Biden and the Democrats economic successes over the past year and a half or so, along with some research from Blue Rose Research about how positive the ad's impact would be.",
    "And as we'll talk about a little bit in France, it seems that despite a lot of concern in Europe over what Russia is doing in Ukraine and a lot of sympathy for the Ukrainian people, that hasn't really translate to changing electoral habits, at least so far.",
    "There are times when maybe a race you thought would be competitive is not competitive, or maybe one of our ally groups wants to step up and spend a million dollars in a race, and that allows us to take a million dollars and put it in into a different race.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nHow Democrats are fighting to hold the House, with Ali Lapp\nThe Downballot\nFollowShare\n0:0050:44\n15301xApr 07, 2022\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nDavid Beard:\nHello and welcome.",
    "David Nir:\nOn the flip side, even though we as Democrats are facing a difficult year, there are still a number of opportunities to go on offense, especially because Democrats were maybe surprisingly aggressive in redistricting in a number of states.",
    "And I think one of my biggest takeaways from 2014 is that you have to remember that what you're doing really matters, even when there is a big wave or a mini-wave environment, like there was in 2014, I would say there was a moderate Republican wave.",
    "And including that, he also include Ukrainian president Volodymyr Zelenskyy, which seems in incredibly strange, but Zelenskyy has attacked Orban for being one of the most reluctant of the EU leaders to support Ukraine or to provide aid to Ukraine.",
    "David Nir:\nThe Fetterman campaign's letter, these campaigns send these letters all the time, but it's essentially a veiled threat or not so veiled threat saying, \"If you don't take this ad off, we might Sue you for publishing defamatory content.\"",
    "Ali Lapp:\nSo we found, or Blue Rose Research found, that the ad that we produced on the economy increased respondent's views that America's on the right track by over 2% and approval for President Biden's handling of the economy by nearly 2.5%.",
    "You generally will send out the money literally a couple days before your reservation starts, which is a good thing because our fundraising, like all political organizations happens late and we could never put all that money down right now.",
    "We have a couple in California, anyone who follows House politics knows who David Valadao is and the Central Valley of California, a House Republican who holds a very Democratic district, but has been traditionally very challenging to beat.",
    "David Nir:\nSo we're going to migrate away from what seems to be our perversely favorite state of North Carolina, up to Pennsylvania, where just this week for the first time, the Democratic primary for Senate turned negative on the airwaves.",
    "We're thrilled to have a really strong vigorous grassroots network of supporters, which anyone who runs a big organization like ours will tell you those grassroots donations are really important because they give you a stable funding base.",
    "David Nir:\nThe thing though is that this might be a blessing in disguise because the idea that this group is attacking Fetterman for being too liberal or too far to the left in a Democratic primary, that seems completely crazy to me.",
    "The Conservative Political Action Committee, CPAC, which is one of the biggest Conservative groups in the country, they are gathering in May in Hungary where their headline speaker will be Hungarian prime minister, Viktor Orban.",
    "It's one of the main reasons I founded House Majority PAC in 2011, after the 2010 disastrous midterm election, you can see that the Republicans had all these allies on their side, American Crossroads was all the rage back then.",
    "Ali Lapp:\nThis is obviously a very tricky cycle and it's not just the historic nature of a midterm election when you hold the presidency, which as you said, traditionally is not great for the party who holds the White House.",
    "Lapp discusses HMP's role in the broader Democratic ecosystem, how the organization decides which districts to target, and promising research showing the positive impacts of a new ad touting Democrats' record on the economy.",
    "In California, there was a special election for the remainder of representative, Devon Nunes's term, former assembly minority leader, Republican Connie Conway took first place in the runoff that's going to be held June 7th.",
    "But the most important thing is that just the other day, Republican Senator Thom Tillis announced that he would be endorsing state Senator Chuck Edwards, who is running against Madison Cawthorn or in the May 17 GOP primary.",
    "David Nir:\nA Super PAC called Penn Progress started airing an ad that tried to contrast Lamb describing his background as a Marine and a prosecutor with Fetterman, and saying that Fetterman is, \"A self-described socialist.\"",
    "David Nir:\nA Super PAC called Penn Progress started airing an ad that tried to contrast Lamb describing his background as a Marine and a prosecutor with Fetterman, and saying that Fetterman is, \"A self-described socialist.\"",
    "There were some Democratic victories, some Republican victories, which is not the worst news, I think, compared to where we've seen in the past, these before November elections that take place that are maybe lower turnout.",
    "Ali Lapp:\nOne of the highest profile races last year was incumbent Democratic Congressman Max Rose was challenged by Republican Nicole Malliotakis in the Staten Island, Brooklyn area, the Republican Nicole Malliotakis won.",
    "If there are two races that are looked to be equal in terms of our ability to win them, but one of them is four times as expensive as the other, we're all about numbers at House Majority PAC, we need to get to 218 or more.",
    "David Nir:\nThe state court struck down the GOP map as an unconstitutional gerrymander and replaced it with a much fairer map, and that meant that the district Cawthorn wanted to run in, the new seat, didn't exist anymore.",
    "The real problem is that Cawthorn has just behaved like a celebrity who cares much more about the national right-wing media circuit and the attention he gets in [Washington], D.C., than about his constituents back home.",
    "Ali Lapp:\nSo we felt that we should produce this ad, release it, try to get as much play as we can and potentially show what we believe is the right path to talking about the economy as we head into the fall elections.",
    "So it might say, New York City, X million dollars, Las Vegas, Nevada, Y million dollars.? And at Daily Kos Elections, we did our best to try to figure out what districts we thought matched up with, which media markets.",
    "David Nir:\nOn today's show, our guest is Ali Lapp, who is the founder of the House Majority PAC, which is the largest Super PAC on the Democratic side that is devoted to helping Democrats win House races nationwide.",
    "Congressman Valadao is actually facing a really, really tough primary on the Right, and it's entirely possible he may not be on the ballot in November because of this right-wing Republican challenger that he's got.",
    "David Beard:\nAnd so with this forced separation from the party and the candidates and their campaigns, how does HMP stand up this whole campaign operation largely on its own in coordination with these other folks.",
    "But as we saw in Hungary, as I mentioned, that doesn't seem to be a major factor in voters' decision making in these countries, it's been much more about things like the cost of living and other domestic concerns.",
    "The second reason why I'm a big believer of reservations is, kind of addresses the question you asked earlier, Beard, how do we work with if all these other entities if we're not allowed to legally talk to them?",
    "So he tucked his tail and went back home to his district, the 11th in Western North Carolina, and the far Western tip of [District] 8, except the problem was Chuck Edwards said, \"I'm not going to defer to you.",
    "And I know that they're trying and he's got actually a lot of good things to run on and it's something that we feel strongly that they should be talking about and celebrating some of the successes even more.",
    "David Beard:\nSo the details of what House Majority PAC is and how it differs from the [Democratic Congressional Campaign Committee] DCCC or even candidate campaigns can be tough to part for a lot of people.",
    "David Nir:\nAnd the reason why this ad was vulnerable to this demand by the Fetterman campaign is that under federal law, TV stations have to air any ad that campaigns send them as long as they're paid for.",
    "David Beard:\nNow, Orbn is a right-wing autocrat who's curtailed press freedoms, he's eroded judicial independence, and he's undermined multiparty democracy both with the gerrymandering and in other ways.",
    "Ali Lapp:\nSometimes you do have a candidate who might be an amazing candidate, but they had a really tough primary, or they just don't have the fundraising network to do all that they would like to do.",
    "And so sometimes we do have to step in and do a little more, but generally, we follow the candidates lead, we try to reinforce their message, educate voters on the Republicans candidates, shortcomings.",
    "But you're doing the biggest grunt work in terms of building up these different House races, and particularly doing it as opposed to a senate or a governor's side where there's at max 30 or 50 races.",
    "David Nir:\nThere was originally a thought perhaps Lamb decided to run for Senate instead of seeking reelection because he was worried that his district in the House would be made considerably worse.",
    "You really have to understand on what's going on the ground and be very sophisticated, be willing to make tough decisions and find effective ways to communicate to voters no matter how challenging.",
    "Sadly, they have caught on and I'm expecting to see a big House reservation from our Republican counterpart any week now, but it does lock in those lower rates and media is incredibly expensive.",
    "We don't want to spend in districts that our Democratic candidate is going to win by 10 points, nor do we want to spend in districts where our Democratic candidate is going to lose by 10 points.",
    "So assuming Conway wins where she's the favorite because it's a pretty Republican leaning seat at the moment, she'll already be a lame duck Congresswoman when she's sworn in later in the summer.",
    "Though the second round is happening on the same day as the regular statewide primary, that hopefully means turnout will be higher, but I'd say this seat is very likely to remain in GOP hands.",
    "David Nir:\nOne question I have in relation to this, when you put out your press release announcing these reservations, you announced it by media market rather than by congressional districts.",
    "And certainly back in the 2012 cycle, Beard will remember this, we were waiting on states like Minnesota and others who just were taking forever in the courts to actually finalize their maps.",
    "David Nir:\nOne thing I should note is that Republican candidates combined for 65% of the vote in the first round of the special election, so that presents pretty daunting odds for Democrats.",
    "It was the Rodney Davis seat, but Congressman Davis has been put into a very safe Republican seat, and this is now a really good Democratic seat, Joe Biden got nearly 56% of the vote there.",
    "David Nir:\nNow, it's time for our weekly hits, where we discuss the stories making the headlines and those that maybe are slipping past the headlines in the world of downballot elections.",
    "We're going to be talking with her about how HMP goes about its work and the races that it's focusing on this year, as well as the role redistricting has played in Democrat's strategies.",
    "On this week's episode of The Downballot, we're joined by Ali Lapp, the founder of the House Majority PACthe largest super PAC devoted to helping Democrats win House races nationwide.",
    "And so, after Cawthorn announced that he was switching districts, that's when Chuck Edwards got into the race for Cawthorn's original seat, and then Cawthorn got screwed by reality.",
    "David Nir:\nI'm just curious since $100 million is such a large amount, even in today's politics, how do all these TV stations across the country, how does that work mechanically?",
    "But really, though the coke and orgy stuff got all of the attention, that's not really why Tillis and other Republicans finally have painted a target on Madison Cawthorn's back.",
    "And then down in Milwaukee, acting mayor and Democrat Cavalier Johnson, decisively won Tuesday's special election, beating conservative Bob Donovan by a large 72 to 28 margin.",
    "And look, first, I should say, we talked a little bit about redistricting earlier and I really should give a huge shout out to the National Democratic Redistricting Committee.",
    "They really can only talk to themselves, they cannot coordinate with any other organizations, including the candidates, or outside groups who are supporting those candidates.",
    "So we do morning clips on all of these critical House races/ They're watching and transcribing every single ad that comes out from the candidates, from the party committees.",
    "We know that, we know that we have hurdles to holding the majority, but the other factor that's playing in here is it's just a time of such uncertainty in America right now.",
    "We need to start talking about the economic successes that Democrats have brought to the American people and what we're still doing every day to make things better for them.",
    "Prime Minister Viktor Orbn won a fourth term in office with 54% of the vote, which was actually up more than four percentage points from his last selection victory in 2018.",
    "So third party ads like the one from this group Penn Progress really have to be vetted very, very carefully to make sure they aren't vulnerable to being taken off airwaves.",
    "He's been one of the last countries: once you got the rest of the countries on board, Hungary wouldn't stand in the way, but he certainly hasn't been helpful in that area.",
    "David Beard:\nThe other big news that HMP recently announced was the $100 million in TV and digital ad reservations for this fall in many media markets across the country.",
    "And Orban clearly has seen him as somebody to oppose, which is really concerning as now he's almost certainly going to be part of the EU for at least the next few years.",
    "Look, Biden's numbers as you said are not great, and the most important thing that could happen for House electoral success is for Biden to improve his approval ratings.",
    "And looking more broadly, I'm not going to go through all of the other various small elections that took place in Wisconsin, but it was overall a mixed bag, I would say.",
    "David Nir:\nAnd as a result, Fetterman's campaign sent a letter to TV stations that were airing the ad, asking them to take the ad down because it contained a falsehood.",
    "They're allowed to work with certain people who work at the Democratic Congressional Campaign Committee, they work with their state parties, they can work with the DNC.",
    "And so that's the lesson I take away, and the way I want to approach these races, this cycle, you can't just say, \"Everything's terrible, we're going to lose this race.",
    "And it's really, it's not that complicated, it's simply talking about what we've done that's gone right and what we're still doing to continue to make things better.",
    "Literally five or six years ago, a group of us got together and said, \"We need to start thinking about the redistricting that's going to happen in five or six years.",
    "So obviously, with Orbn party being such a large figure, if you're running two or three different candidates, it becomes so much harder to beat him or his candidate.",
    "Ali Lapp:\nAnd it does allow those candidates and party committees who care about the same races to know what we're doing and be able to plan a little bit around it.",
    "And of course, there's some guesswork, like you said, of course also, you don't necessarily know which races you're going to devote the money to because it's early.",
    "The way that we do it is really not that complicated, we obviously we do a lot of public opinion research in these districts, we poll, sometimes we do focus groups.",
    "They are strong candidates, they fit their districts really well, and most of them got districts that are at least a little bit better as a result of redistricting.",
    "David Beard:\nWell, this week there was a Tuesday, so that means that there were elections here in America, because we have elections almost every Tuesday somewhere.",
    "David Nir:\nSo because Cawthorn tried this whole district shopping shenanigan, he netted himself a challenger who simply just wasn't going to budge on his way home.",
    "The race is primarily a contest between two candidates, Lieutenant Governor John Fetterman and Congressman Connor Lamb, both of whom are from Western Pennsylvania.",
    "The race is primarily a contest between two candidates, Lieutenant Governor John Fetterman and Congressman Connor Lamb, both of whom are from Western Pennsylvania.",
    "David Beard:\nJohnson who made history as the first black person elected to lead Milwaukee will then have to run for a full term here in a couple years up in 2024.",
    "These are things that have a real impact on family's pocketbooks, and we think we need to be talking about them even more aggressively than we already have been.",
    "Ali Lapp:\nSo you really have to try to focus in on those ones where you are spending is going to be the decision maker and whether or not a race is won or lost.",
    "But there was a big problem, at the end of the piece, there was a huge correction that said, \"This piece said that John Fetterman is a self-described socialist.",
    "David Beard:\nYeah, it's been a strange primary Lamb obviously has a lot of positives to the fact that he's a very good candidate, he can run a strong campaign.",
    "Now, Orbn's been close with Russian dictator Vladimir Putin, though he has walked that back a bit in the past few weeks in the wake of the invasion of Ukraine.",
    "Next up, we will be talking with Lapp, the founder of the House Majority PAC, the largest Super PAC in the country to help Democrats in House races nationwide.",
    "I think they've been cowed into silence about their previous favorite autocrat who was of course Putin, and now they're transferring their affection to Orban.",
    "And in fact, they even pointed to an interview he gave a few years ago where someone asked him directly, \"Do you describe yourself as a Democratic socialist?\"",
    "Is HMP permitted to talk with other Super PACs such as those run by the League of Conservation Voters or EMILY's List, other groups that you were mentioning.",
    "What we really take away from that is that this is the kind of messaging that will work, that will improve voters' views of what's happening in the economy.",
    "And so we work very closely with EMILY's List independent/expenditure arm, which is called Women Vote, and League of Conservation Voters, as you mentioned.",
    "It really does feel like there, but for the grace of God go we, example for us, whatever is going on in Hungary, it's like an early warning system for us.",
    "There was an ad a few years ago where a campaign try to get attention by having the candidates say, \"Fuck the NRA,\" and that was actually broadcast on TV.",
    "And in fact, that's exactly something that Tillis specifically cited saying, \"It comes down to focus on the district, producing results for the district.",
    "But before we talk with Ali, we are going to be running down our weekly hits on the most recent stories making news in the world of downballot elections.",
    "And what's the rationale for an ad like that that doesn't focus so much on a specific House or House races, but really has a much broader national focus?",
    "And because of that, because they're not obligated to run them, that also means they can potentially be held liable for any defamatory or false content.",
    "And his party retained a two thirds majority in parliament thanks to some pretty significant gerrymandering that his party has implemented in the past.",
    "This is our way of saying, \"Hey, we're going to be on television these weeks at this level in Bakersfield, California, or in Los Angeles, or Phoenix.\"",
    "And I'll just add, since you already took us to North Carolina, I'll just note that I didn't take us to North Carolina; you took us to North Carolina.",
    "And I am really proud of the work that we did at HMP to understand that issue and figure out how to communicate about it in a way that was effective.",
    "But really, I think that ultimately, this is going to prove to be a mistake for Conor Lamb and that he should have sought another term in the House.",
    "House Majority PAC also known as HMP is an independent expenditure pack or Super PAC that works to elect Democrats to the House of Representatives.",
    "And then how do you decide which of these markets are going to go up now, which need to be announced and reserved now, and which do you wait on?",
    "I'll holler a couple in New York, which I think are really great out on Long Island in New York 1, which is the far Eastern side of Long Island.",
    "A lot of national Republicans were very excited about his candidacy and he had a personal scandal that broke about a month before the election.",
    "We're thrilled we were able to make such a large reservation this year, as you said, over 100 million in TV and digital reservations thus far.",
    "And this is something that frankly, our side, the Democratic side did much better than Republicans for many years, they didn't reserve rates.",
    "And then we're going to be discussing a couple of European elections that have taken place recently or are coming up on the docket very soon.",
    "There was also an interesting turn of events in the Pennsylvania Senate race, where the Democratic primary went negative for the first time.",
    "So look, I think part of it is House Majority PAC has been around for a decade now, we have a track record of being good on our commitments.",
    "Ali Lapp:\nIt does affect our planning, we have to be very flexible, which is something I think we've always been good at House Majority PAC.",
    "David Beard:\nBut unfortunately, they were unable to break through really outside the capital area and received just 34% of the vote overall.",
    "That this past week, there was a heroic victory by my alma mater, UNC, in the final four over Duke, which led to a narrow loss to Kansas.",
    "David Beard:\nHMP has actually put out a few things recently, which is exciting for us because we get the chance now to talk about them.",
    "The Downballot is a weekly podcast dedicated to the many elections that take place below the presidency, from Senate, to city council.",
    "David Nir:\nNow, that's a pretty unusual move to see a sitting Senator endorse a challenger to a member of Congress from his own state.",
    "Can you talk to us a little bit about the districts where you're looking to go on offense and what some of your top targets might be?",
    "For the lawsuits that they have filed and won, for the aggressive map making that we've had in some states, we have much fairer maps.",
    "And if you can get a gauge on that, you can get a sense of how much you're actually moving voters based on the ad that they've seen.",
    "When I look at House races, I like to think of it as a house, a literal house that someone would live in with three different wings.",
    "I know we're going to be able to provide really robust, strong advertising for our Democratic incumbents and challengers this year.",
    "Email us with your thoughts or questions you'd like us to answer at thedownballot@dailykos.com or find us on Twitter, @DKElections.",
    "This year, the opposition actually united against him for the first time, as opposed to running in a number of different parties.",
    "Yes, gerrymandering is not just for here in America, it does happen in other, in other places as well, very severely in Hungary.",
    "So we look at where we can get to the most Democratic House district, and we really have to evaluate every race in that context.",
    "Right now under the current lines, there are 224 districts that Joe Biden carried, after redistricting, there will be over 230.",
    "Ali Lapp:\nThat is not only good for 2022, it's huge for the rest of this decade, and I just couldn't be any happier about that.",
    "Ali Lapp:\nAnother wing of the house is where the Democratic Congressional Campaign Committee's independent expenditure resides.",
    "There's 435 House races, obviously you're not going to play in all of those, but you could easily play in 50 or more than that.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "David Beard:\nAnd please subscribe to The Downballot wherever you listen to podcasts and leave us a five star rating and review.",
    "And since last week was a week, that meant there was another opportunity for Madison Cawthorn to completely humiliate himself.",
    "David Nir:\nWell, I should note also that Laura Kelly kicked off the first ad of her reelection campaign during that same game.",
    "Even Edward's own polling shows him trailing, but we still have about six weeks ago until the primary, quite a lot can happen.",
    "314 Action is a great organization that supports candidates with a science background or who want to promote a science agenda.",
    "Ali Lapp:\nThe reason that House Majority PAC exists is because our campaign finance laws in this country are really confusing.",
    "And I think even broadcasts some episodes from there and has repeated and amplified his crazy antisemitic conspiracy theories.",
    "I actually never stopped caring about Western North Carolina even when you were showboating off in other parts of the state.\"",
    "But Fetterman had great name recognition and a very positive view amongst Democratic voters in a big state like Pennsylvania.",
    "And like I said, it's quite unusual for your own home state Senator to decide he wants you gone from the state's delegation.",
    "So they aren't really trying to hide their affection for him and for their desire to emulate what he's done in Hungary here.",
    "There was some hope that this would hurt him with the electorate, but unfortunately, that just didn't happen as we see here.",
    "How do you make decisions about whether a seat is worth the investment, especially when it's gotten redder in redistricting?",
    "David Beard:\nHe also hasn't been allowing any lethal arms to be either donated from Hungary or transported through Hungary.",
    "Neither one of them are running for any congressional seat in November because the seat is changing a lot in redistricting.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Can you give us a brief rundown of the unique role that HMP plays and how it functions as an independent expenditure PAC?",
    "David Beard:\nSo I saw that photo and it warmed my heart, as did the victory over Duke, the narrow loss to Kansas less so.",
    "We think about how many allies we have in a race and whether or not they're going to be able to invest in there as well.",
    "And the amazing thing was that at least one TV station in the Philadelphia area already yanked the ad off the airwaves.",
    "Then up in Wisconsin, there were a number of local elections for Wisconsin's spring election that they have every year.",
    "There is a Democratic primary in that district, but from a district that Trump won, it is now over 55% Biden district.",
    "We essentially are a critical part of these campaigns without them actually being able to tell us directly what to do.",
    "So we have some experience at dealing with the logistics of redistricting and waiting for states to finish their maps.",
    "And rather than question why and point fingers, we at House Majority PAC are just trying to make that case to voters.",
    "There are seats now that look much more enticing, districts like Illinois 13, or Michigan's 3rd, or New Mexico's 2nd.",
    "We have that crazy primary in California where the top two candidates advance from, and it's not a partisan primary.",
    "David Nir:\nYou did some research suggesting that the ad does actually have the impact that you were hoping it would.",
    "There are a lot of social and cultural issues that put people on edge around the country, it's a very divisive time.",
    "And then the third wing of the House, I think is the biggest wing of the house, is where House Majority PAC resides.",
    "Obviously we'll have the results of the first round next week, and then the results of the runoff a few weeks later.",
    "David Beard:\nLe Pen like much of the far right in Europe has been close with Putin in the past, like Orban has been.",
    "He hasn't been single handedly trying to block EU sanctions, though he has been on the more reluctant end of things.",
    "David Nir:\nThere were in fact, some elections this past week in Wisconsin and California that we are going to recap.",
    "Ali Lapp:\nWe were thrilled to get Eric Holder to lead that organization, and it has been a huge, huge game changer.",
    "There's only one Democrat on the ballot, which is really important for us to make sure that we're not locked out.",
    "So again, that sounds like a small number, but that is a pretty big number in terms of just one viewing of an ad.",
    "And Hungary is one of the countries that shares a border with Ukraine, so that has caused some obstacles at time.",
    "But Le Pen is definitely a major concern there and something to watch\nDavid Nir:\nThat concludes our weekly hits.",
    "If you haven't already, please like, and subscribe to The Downballot and leave us a five-star rating and review.",
    "By now, I'm sure you have heard about his cocaine and orgies claim, it's completely bonkers, total made-upcrap.",
    "David Beard:\nThere are still mail ballots that can be received and be counted, so that hasn't been called yet.",
    "Ali Lapp:\nI think if we had not handled that particular issue so well, we very well could have lost that seat.",
    "How do they know you're good for it since obviously you won't be paying for these ads just yet, is that right?",
    "Ali Lapp:\nWell, we think we need to start setting the table for the dialogue that needs to happen this fall.",
    "We could have really overplayed our hand, it could have backfired, it was a very tricky thing to figure out.",
    "And they came in late and put the hammer down on some Democrats that didn't even think they were vulnerable.",
    "So it's very possible, it's just something that, as you said, has to be really done on a case by case basis.",
    "David Beard:\nI'm going to wrap up our weekly hits by taking us back to a couple of international quick hits.",
    "Like it is here, where if multiple candidates run, it's just, whoever gets the most votes wins the election.",
    "But I think the expectation is that Conway and Hubbard will advance to the runoff, which is again, June 7th.",
    "She's got the election this year, the other two don't, so by all means, she should take it all that she can.",
    "And so the way that we have to operate is we are completely independent of candidates and party committees.",
    "That's probably the easiest place to go and find our Twitter handle, Facebook or ads we've run in the past.",
    "Obviously you went through the 2014 cycle, another difficult midterm under somewhat similar circumstances.",
    "And this is especially acute given that the Democrats majority right now in the House is only five seats.",
    "But man, what a huge blunder that the NPR piece in questions literally had the correction appended to it.",
    "And in my opinion, Mr. Cawthorn hasn't demonstrated much in the way of results over the last 18 months.\"",
    "We hire a political desk, a research desk, an assistant, and they take on a portfolio of 20 to 30 races.",
    "And it's largely as a result of redistricting that we do have some really good offensive opportunities.",
    "Down in Orange County, Congresswoman Michelle Steel is in a more Democratic district than she has now.",
    "The two leading candidates are centrist president Emmanuel Macron and far right leader, Marine Le Pen.",
    "Unfortunately, the filing deadline passed several weeks ago, there's no chance of him switching races.",
    "And it seems that Lamb's allies think that the only way to stop Fetterman is to attack him on TV ads.",
    "And it seems that Lamb's allies think that the only way to stop Fetterman is to attack him on TV ads.",
    "We have Madison Cawthorn on tap once more; find out why Republicans are finally turning against him.",
    "And that's in large part due to the fact that the electoral system is partially first pass the post.",
    "We are also, look, I'll be upfront with you, we have not done a ton of district by district polling.",
    "We really see ourselves as helping them understand who the candidates are, what forces are at play.",
    "But the first round of the presidential election is going to be taking place on Sunday, April 10th.",
    "He's always been very difficult to beat, one of the last legitimately moderate members of Congress.",
    "Ali Lapp:\nWell, I've always been a big fan of reserving your television time early for two reasons.",
    "Ali Lapp:\nThese are not signed in blood, they're not locked in, but this is our intention to spend.",
    "It was literally the same day it went up, according to [the] Fetterman campaign, it was taken down.",
    "So hopefully she got some warm fuzzies from associating herself with her home state school's win.",
    "And they really have to understand these races inside and out through publicly available sources.",
    "And the Democrats from really tough districts that were reelected in 2020, they're battle tested.",
    "Because you're not really going to get the reaction you would get if they saw it just naturally.",
    "How can our listeners find out more about House Majority PAC work and support what you guys do?",
    "So even though the national environment is tougher, we have more Biden districts to compete in.",
    "And we really try to help them make good decisions in their house independent expenditure work.",
    "I think following the presidency of Donald Trump has just made people retreat to their corners.",
    "Ali Lapp:\nOne race that I think back to a lot was the reelection of Scott Peters in San Diego.",
    "It's always nice to join someone who was around for the inaugural cycle of House Majority PAC.",
    "Ali Lapp:\nIt was always a Biden seat, it is now a Biden seat that he won with 59% of the vote.",
    "How speaker Tim Moore and State Senate President Pro Tempore Phil Berger are also backing him.",
    "It was turned into a very swingy district that would not suit a maniac like Cawthorn at all.",
    "Ali Lapp:\nAnd we ultimately, we also have to take into account the cost of a race, frankly.",
    "So we would love to get Florida done with good maps as soon as we can, but we have to wait.",
    "And on a personal note, she is also my former boss from when I worked at HMP back in 2012.",
    "And look, 2020 was not a great year down ballot, even though Joe Biden won the presidency.",
    "So a lot of Democrats that held some of the toughest districts were not reelected in 2020.",
    "You mentioned that the DCCC's independent expenditure arm is basically entirely isolated.",
    "So we really appreciate all of the support that we have gotten from all over the country.",
    "Senator can do to make your reelection a lot more difficult if they put their mind to it.",
    "David Nir:\nAnd of course Zelensky is a Jew, so easy for Orban to lump him in with Soros.",
    "David Beard:\nSo he had called out Orban by name earlier since the invasion had happened.",
    "Ali Lapp:\nWhen I founded House Majority PAC in 2011, it was also a redistricting cycle.",
    "We know you guys are, we hope your listeners are, and we really appreciate the support.",
    "David Beard:\nAli Lapp, founder of House Majority PAC, thank you so much for joining us.",
    "We have a couple of Democrats running there, but I feel great about winning that seat.",
    "Ali Lapp:\nSo Democrats really have been far more efficient than Republicans for years.",
    "Ali Lapp:\nWell, there's a number of different ways that research firms will test ads.",
    "Obviously, Joe Biden's approval ratings are not strong and haven't been for a while.",
    "And he was facing a relatively moderate Republican challenger who was a Councilman.",
    "We're facing the same thing this year, as you mentioned, Florida is still not done.",
    "There's really nothing good whatsoever that can be said about the situation there.",
    "We look at the strengths of the Democratic candidate and the Republican candidate.",
    "And then up in Syracuse, John Katko, Republican Congressman has held that forever.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "I'm so proud to have been one of the founding board members of that organization.",
    "And Tillis is not the only major Republican who is supporting Edward's challenge.",
    "It was a Trump plus 10 district, it is now a Biden plus 10 district, huge swing.",
    "But I think that Fetterman remains the favorite in the Democratic primary here.",
    "Ali Lapp:\nWell, that's a huge, huge part of our mission at House Majority PAC.",
    "And that's really important in a redistricting cycle more than any other kind.",
    "We've just been through this pandemic, we've had enormous economic upheaval.",
    "And it really is about understanding what's going on in a specific district.",
    "And one wing of that house are the candidate and their campaign committees.",
    "And really, if we're able to hold the House, they deserve a ton of credit.",
    "The Downballot comes out every Thursday everywhere you listen to podcasts.",
    "You can really see wipe outs one way or another when it's a big wave year.",
    "Ali Lapp:\nSo we have every confidence in their ability to win this cycle.",
    "Ali Lapp:\nI think you may have mentioned Illinois 13, which is downstate.",
    "That's not to say these reservations can't change, they can and do often.",
    "So any savings you're able to get from that is really, really important.",
    "We look at their fundraising and their ability to run a robust campaign.",
    "Whereas if you unite against one candidate, you have a much better shot.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Democrats can compete in a much better way because we have better maps.",
    "Ali Lapp:\nAnd that's really grown a lot in the last four to five years.",
    "The two states we're looking at are Wisconsin and California this week.",
    "It upset Republicans in a way that his fascistic rhetoric never could.",
    "Look, it's going to be a tough cycle, but we are up for the challenge.",
    "Florida's a big state, there's a couple of swing districts in there.",
    "We have a really, I think, systematic way of organizing House races.",
    "But this time it seems like there were finally consequences for him.",
    "And what we really had to do is figure each race out individually.",
    "You don't just show voters an ad and say, \"Hey, did you like that?",
    "And also, we'd like to get into the nitty-gritty of politics here.",
    "So Lamb's team really needs to go back to the drawing board here.",
    "So this ad was based on a claim in an article that was retracted.",
    "If anything, that might make Fetterman more popular with voters.",
    "We look at the level of Republican commitment in a race as well.",
    "And we need to make sure Democrats are better positioned there.\"",
    "I like to think of us as the air traffic control of House world.",
    "Hopefully, will not turn out as badly as Hungary has turned out.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "And of course, Tucker Carlson is completely in love with Orban.",
    "Look, we hire amazing people like you, who do this work for us.",
    "From a broad perspective, how is HMP addressing this situation?",
    "There's of course, a place where you can donate and contribute.",
    "It is a district that Joe Biden won with over 53% of the vote.",
    "We're very nimble, we're able to move quickly when we need to.",
    "And then over in France, there's a related situation going on.",
    "But third-party ads, TV stations aren't obligated to run them.",
    "David Nir:\nAnd I'm David Nir, political director of Daily Kos.",
    "I'm David Beard, contributing editor for Daily Kos Elections.",
    "And they said Fetterman has never called himself a socialist.",
    "So that's going to be something we're going to watch closely.",
    "So in Hungary, there was a general election this past Sunday.",
    "Ali Lapp:\nYou can find us online at the housemajoritypac.com.",
    "First off, why make these reservations and announcements now?",
    "Thanks to our producer, Cara Zelaya and editor, Tim Einenkel.",
    "I think the best way to do it is as organically as possible.",
    "We're joined by Ali Lapp, the founder of House Majority PAC.",
    "And this can include stuff that TV stations would never air.",
    "Can you talk a little bit about how that research was done?",
    "You're not so reliant on the whims of big donors and such.",
    "You can reach us by email at thedownonballot@dailykos.com.",
    "Literally people say how come Democrats don't plan ahead?",
    "And we largely follow the candidates lead in these races.",
    "It's an easy way of saying go negative on the Republican.",
    "David Beard:\nThere are certainly a lot of things a U.S.",
    "I was actually just thinking about this the other day.",
    "There were a lot of possible outcomes to that scandal.",
    "Over in Europe, this time, over in Hungary and France.",
    "I'm very excited about our prospects in that district.",
    "We've got so many good Democratic candidates running.",
    "So there may yet be other shoes to drop for Cawthorn.",
    "But in fact, it actually got better in redistricting.",
    "So it was always going to be tough to overcome that.",
    "One, you are able to lock in lower television rates.",
    "It was a very tough district in a tough environment.",
    "And I know that sounds simple, but it's really not.",
    "How do you manage during an environment like this?",
    "And that is obviously a very winnable seat for us.",
    "So hopefully that is a nice, safe Democratic seat.",
    "Now, Cawthorn is still likely to win renomination.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "But let's go ahead and jump into today's episode.",
    "David Beard:\nYeah, I think that's the assumption.",
    "Ali Lapp:\nSo we're watching that really closely.",
    "We work really closely with other organizations.",
    "Can you talk a little bit about those findings?",
    "She has a really strong candidate in Jay Chen.",
    "So that's something I think is very important.",
    "They are the most isolated wing of that house.",
    "And it was a very close election win for us.",
    "It's pretty much the fastest I've ever seen.",
    "Do you operate in this kind of environment?",
    "And they operate in that wing of the House.",
    "We have a great Democratic candidate there.",
    "We'll be back next week with a new episode.",
    "David Beard:\nThat's all from us this week.",
    "So that's when we're really excited about.",
    "And Republicans aren't really hiding that.",
    "So thank you so much for joining us, Ali.",
    "David Nir:\nSo just a small clarification.",
    "I fully expect that he'll win that seat.",
    "Ali Lapp:\nYeah, that's a good question.",
    "He simply has greater name recognition.",
    "He simply has greater name recognition.",
    "What are we going to be covering today?",
    "So we're incredibly grateful for that.",
    "This has been incredibly illuminating.",
    "This is a short blurb about Daily Kos.",
    "So that's a great pickup opportunity.",
    "We've got a terrific candidate there.",
    "And this is not going to help at all.",
    "CNN reports that others may as well.",
    "She took 64,000 votes and about 35%.",
    "Fetterman has led in all the polls.",
    "Fetterman has led in all the polls.",
    "So it's a bad situation all around.",
    "David Nir:\nAli, thank you so much.",
    "Thanks to Ali Lapp for joining us.",
    "There's truly no excuse for this.",
    "Beard, what have you got for us?",
    "It's come a long way since then.",
    "Ali Lapp:\nYeah, that's right.",
    "We're there to support them.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "So how did that come about?",
    "They're retiring in droves.",
    "David Beard:\nYeah, exactly.",
    "So that was very good news.",
    "Let's go ahead and dive in.",
    "But boy, did they screw up.",
    "But boy, did they screw up.",
    "Max Rose is running again.",
    "We're excited about that.",
    "Ali Lapp:\nOh, absolutely.",
    "Want to keep it that way?",
    "David Beard:\nAbsolutely.",
    "He's retiring this year.",
    "Ali Lapp:\nVery exciting.",
    "And he flat out said no.",
    "He's a great candidate.",
    "Daily Kos is different.",
    "And this is too hard.\"",
    "How do you test an ad?",
    "Ali Lapp:\nAbsolutely.",
    "Ali Lapp:\nAbsolutely.",
    "Ali Lapp:\nAbsolutely.",
    "Ali Lapp:\nAbsolutely.",
    "We're not strategic.",
    "Ali Lapp:\nThank you.",
    "David Beard:\nToday.",
    "David Beard:\nGreat.",
    "Again, if she wins.",
    "David Beard:\nYeah.",
    "David Beard:\nYeah.",
    "Ali Lapp:\nIt has.",
    "It changed a lot.",
    "David Nir:\nYeah.",
    "David Nir:\nWell.",
    "Please read it.",
    "Stay with us.",
    "Yes or no.\"",
    "He is not.\""
  ]
}