{
  "id": 2900,
  "mediaId": 195,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Cawthorn to speak at North Carolina Trump rally",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/03/cawthornmadison_033022gn2_lead.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/house/3256609-cawthorn-to-speak-at-north-carolina-trump-rally/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    1404,
    1404,
    1147,
    1147,
    2226,
    2226,
    1501,
    1501,
    428,
    428,
    562,
    562,
    2834,
    2834
  ],
  "sentences": [
    "Those latest allegations, in particular, have drawn the ire of Republican lawmakers in Washington, including House Minority Leader Kevin McCarthy (R-Calif.), who told reporters this week that Cawthorn had lost my trust, and he's going to have to earn it back.?\nMeanwhile, Sen. Thom Tillis (R-N.C.) announced that he would support Cawthorn's Republican primary challenger, state Sen. Chuck Edwards, while retiring Sen. Richard Burr (R-N.C.) called the first-term congressman an embarrassment? in comments to CNN.",
    "Cawthorn, a 26-year-old serving out his first term in the House, has become the subject of controversy in recent weeks, first after he described Ukrainian President Volodymyr Zelensky as a thug? amid Russia's invasion of Ukraine and more recently for claiming on a podcast that some of his colleagues attend orgies and use cocaine.",
    "Cawthorn will be joined by Rep. Ted Budd (R-N.C.), whom Trump has endorsed for the Republican Senate nomination in North Carolina, as well as Bo Hines, a former college football player who scored Trump's endorsement last month in the race for North Carolina's 13th Congressional District.",
    "Rep. Madison Cawthorn (R-N.C.) is slated to speak at former President Trump's upcoming rally in North Carolina, giving the embattled congressman a key audience with Trump's ultra-conservative base as he faces backlash from GOP lawmakers and much of his state's congressional delegation.",
    "Still, Cawthorn's planned appearance at Trump's April 9 rally in Selma, N.C., suggests that, despite the controversies, he still has the support of the former president, who remains the most influential figure in the modern GOP.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "We invite you to join the discussion on Facebook and Twitter."
  ]
}