{
  "id": 2914,
  "mediaId": 1576,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership",
  "image": "https://www.wabe.org/app/uploads/2022/04/AP22061039728653-336x189.jpg",
  "link": "https://www.wabe.org/rep-cawthorns-sordid-tales-of-life-in-congress-frustrate-gop-leadership/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    821,
    883,
    903,
    1090,
    1147,
    1154,
    1299,
    1454,
    1577,
    1609,
    1670,
    1882,
    2303,
    2341,
    146,
    428,
    562,
    2602,
    2834
  ],
  "sentences": [
    "Cawthorn's comments are not his first foray into controversy, but now he's facing political backlash at home\nIn August at a local GOP event in Macon County, N.C., he referred to those charged in relation to the Jan. 6 attack at the U.S. Capitol as political hostages? and said, if our election systems continue to be rigged and continue to be stolen, then it's gonna lead to one place and it's bloodshed.? Facing backlash, Cawthorn introduced a resolution broadly condemning political violence.",
    "This was a swifter-than-usual response from the GOP leader\nMcCarthy has had to step in to condemn various rhetoric and actions taken by members of his conference, from denouncing language used by Rep. Marjorie Taylor Greene that equated COVID-19 safety measures with the treatment of Jews during the Holocaust and more recently calling it appalling? that Greene and Rep. Paul Gosar of Arizona attended an event led by a white nationalist.",
    "Cawthorn tweeted a campaign ad Thursday, writing that the radical left, the establishment, and the media want to take me down,? before pledging: I'm not going anywhere.?\nWhile GOP leadership seems skeptical of Cawthorn's future in the party, Cawthorn could get a boost in support from Trump himself, who announced the North Carolina Republican will join him to speak at a rally next weekend.",
    "This felt a little too personal to them, and that's why we've seen a harsher and more public rebuke than we've seen about other behavior that would also seem appropriate to draw similar rebukes.?\nStutzman said McCarthy's rapid dressing down of Cawthorn indicates that a majority of the GOP conference wanted to see a strong admonition from their leader.",
    "He's a little bit of a different commodity that probably does not have as strong a base outside the beltway than some of those other members.?\nRepublican Sen. Thom Tillis of North Carolina has formally endorsed a primary challenger, state Sen. Chuck Edwards, in the wake of Cawthorn's latest comments.",
    "Cawthorn opened a legal expense fund in March to help pay the costs associated with legal challenges to his reelection bid, after a group, citing a constitutional provision, sought to label him an insurrectionist? for his comments leading up to Jan. 6, and have him disqualified for the ballot.",
    "Unfortunately, Madison Cawthorn has fallen well short of the most basic standards Western North Carolina expects from their representatives.?\nBut if losing Tillis' endorsement and a reprimand from House leadership was meant to temper Cawthorn's actions, it doesn't appear to have worked.",
    "Democrats have criticized McCarthy for not taking more decisive action against members who have demonstrated inappropriate behavior, pointing to Colorado Rep. Lauren Boebert's past Islamophobic comments about Minnesota Democrat Rep. Ilhan Omar.",
    "Madison Cawthorn, the freshman Republican congressman from North Carolina, found himself in hot water with GOP leadership after he made comments  without evidence  linking members of his own party with cocaine use and orgies.",
    "The 26-year-old described the sexual perversion that goes on in Washington? during an appearance of the Warrior Poet Society podcast, saying he was asked to join a sexual get-together? at a politician's home.",
    "His comments led to a backlash among his own colleagues and a swift condemnation from House Minority Leader Kevin McCarthy, who chastised Cawthorn during a meeting on Wednesday, as Politico first reported.",
    "And it's like, this is wild.?\nCawthorn, who was elected in 2020, is an ardent supporter of former President Donald Trump and has made a name for himself among the conservative House Freedom Caucus.",
    "But McCarthy's rebuke of Cawthorn came swiftly and more publicly than past episodes, where the leader has released statements distancing the conference from the rhetoric of far-right members.",
    "He added: There's some of the people that are leading on the movement to try and remove addiction in our country, and then you watch them do a key bump of cocaine right in front of you.",
    "More recently, Cawthorn referred to Ukrainian President Volodymyr Zelenskyy as a thug? and has two charges in his home state for driving with a revoked license.",
    "The difference here is that these are direct allegations or innuendo regarding [Cawthorn's] colleagues,? said Rob Stutzman, a GOP political consultant.",
    "Cawthorn does not quite have the same celebrity that Taylor Greene has developed, or Matt Gaetz, or even Lauren Boebert,? Stutzman added.",
    "The 11th Congressional District deserves a congressman who is fully dedicated to serving their constituents,? Tillis' statement read.",
    "And I'm like, What did you just ask me to come to?' And then you realize they're asking you to come to an orgy,? Cawthorn said.",
    "Afterwards, the GOP leader told reporters Cawthorn's comments were unacceptable? and lacked evidence.",
    "Cawthorn did not provide specific details that could be used to verify his claims.",
    "Politicians are always going to be more self interested than anything else.",
    "He's going to have to earn it back,? McCarthy said, as Politico reported.",
    "There's a lot of different things that can happen.",
    "But I just told him he's lost my trust.",
    "Trending"
  ]
}