{
  "id": 2922,
  "mediaId": 195,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "Tillis endorses Cawthorn's primary challenger",
  "image": "https://m104216-ucdn.mp.lura.live/iupl_lin/C87/B9F/C87B9F0B166C21C090355CA0B789B3DE.jpg?Expires=1648765196&KeyName=mcpkey1&Signature=BJ442ZutAieoJL_Jq2eMeY8jL9A",
  "link": "https://thehill.com/news/campaign/3255653-tillis-endorses-cawthorns-primary-challenger/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell/",
  "termIds": [
    2303,
    2341,
    2341,
    2356,
    2356,
    2303,
    1609,
    1609,
    2030,
    2030,
    428,
    254,
    254,
    428,
    2834,
    2834,
    2654,
    2654
  ],
  "sentences": [
    "I believe Chuck Edwards is the best choice.?\nThe senator said Edwards will put his constituents first? and never turn his back on Western North Carolina or abandon his constituents for the sake of political expediency,? calling him a hardworking conservative leader.?\nTillis's endorsement in the primary race, which is scheduled for May 17, comes as Cawthorn is drawing increased scrutiny for saying that members of Congress have invited him to orgies and done cocaine in front of him.",
    "Remember that the Ukrainian government is incredibly corrupt and is incredibly evil and has been pushing woke ideologies.?\nTillis on Thursday said Edwards will never attack Ukraine's fight for freedom or vote against sanctioning Putin's Russia and find himself being used as propaganda on Russian state television.?\nChuck Edwards has proven he's a hardworking conservative leader who delivers conservative results.",
    "Tillis appeared to reference the controversial remarks in his endorsement of Edwards, writing that the state senator will never embarrass Western North Carolina with a consistent pattern of juvenile behavior, outlandish statements, and untruthfulness.?\nChuck Edwards has demonstrated he serves with honor and integrity, and he always makes conservatives proud,? he added.",
    "Bolger said the set of numbers polling individuals who have an opinion of both men underscores that if Edwards receives enough fundraising help and support, the race will get considerably closer.?\nThe Hill reached out to Cawthorn and Edwards for comment on the Tillis endorsement.",
    "Unfortunately, Madison Cawthorn has fallen well short of the most basic standards Western North Carolina expects from their representatives, and voters now have several well-qualified candidates to choose from who would be a significant improvement,? Tillis wrote.",
    "Sen. Thom Tillis (R-N.C.) announced on Thursday that he will endorse state Sen. Chuck Edwards (R) in his primary challenge against Rep. Madison Cawthorn (R-N.C.), as the freshman congressman faces blowback from within his own party over recent comments he made.",
    "Cawthorn needs to surpass 30 percent of the primary vote to secure his party's nomination, which he easily has in the Edwards polling memo, but the Republican pollster who wrote the report is questioning the incumbent's current standing in the race.",
    "The polling, conducted by Public Opinion Strategies between March 10 and March 13, found that Cawthorn leads Edward 52 percent to 20 percent, with 11 percent of the vote going to one of the other six GOP candidates in the race.",
    "Cawthorn also made headlines this month when he called Ukrainian President Volodymyr Zelensky a thug? and said the country's government was evil? in a video obtained by local North Carolina station WRAL.",
    "McCarthy, after the discussion, told reporters that Cawthorn has to turn himself around,? while also noting that the freshman congressman did not provide any evidence to support his claims.",
    "Tillis in a statement criticized Cawthorn, a 26-year-old freshman lawmaker, and said that Edwards is the best choice? to lead the Tar Heel State's 11th Congressional District.",
    "He noted that when it comes to voters who have an opinion of both Cawthorn and Edwards, the incumbent's lead tightens to 10 points: 46 percent to 36 percent.",
    "A polling memo from the Edwards campaign obtained by The Hill suggests that the firebrand Republican may not skate to victory in his reelection bid.",
    "Cawthorn is right on the bubble of the 50% mark; incumbents who slip below that during the campaign are in danger,? Bolger wrote in the memo.",
    "He'll never give up on his day job in search of celebrity status in Washington, D.C., with no record of results to speak of,? he added.",
    "The comments frustrated GOP lawmakers, some of whom said the freshman congressman needed to specify who he was talking about.",
    "The poll, which surveyed 300 likely Republican primary voters, has a margin of error of plus or minus 5.66 percentage points.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Tillis's endorsement of Edwards could be the tip of the iceberg for Cawthorn's trouble in the Tar Heel State.",
    "The 11th Congressional District deserves a congressman who is fully dedicated to serving their constituents.",
    "The pollster, Glen Bolger, cautioned that the congressman is in worse shape compared to others incumbents.",
    "The report came during Russia's invasion of Ukraine, though it is unclear when the video was recorded.",
    "It even prompted a meeting between House Minority Leader Kevin McCarthy (R-Calif.) and Cawthorn.",
    "He made the claims during an appearance on the Warrior Poet Society? podcast.",
    "Remember that Zelensky is a thug,? Cawthorn said in the recording.",
    "Seventeen percent of those polled said they remain undecided.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Emily Brooks contributed to this report."
  ]
}