{
  "id": 2923,
  "mediaId": 233,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "More trouble for GOP Rep. Madison Cawthorn: North Carolina Republican senator endorses primary opponent",
  "image": "https://www.gannett-cdn.com/presto/2021/07/15/USAT/f252b1ef-66ba-4101-9fae-8a7487c37af7-cawthorn.jpg?crop=7969,4483,x0,y406&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/03/31/more-trouble-madison-cawthorn-nc-senator-endorses-opponent/7233168001/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Jackson",
  "authorUrl": "https://www.usatoday.com/staff/2647924001/david-jackson/",
  "termIds": [
    821,
    1147,
    1609,
    2303,
    2341,
    428,
    562,
    571,
    2834
  ],
  "sentences": [
    "Cawthorn's revoked license: GOP Congressman Madison Cawthorn charged with driving on a revoked license for 2nd time; court dates set\nIn a tweet just hours before Tillis' announcement, Cawthorn said \"the radical left, the establishment, and the media want to take me down,\" but he will move forward.",
    "Sen. Thom Tillis, R-N.C., said Cawthorn \"has fallen well short of the most basic standards Western North Carolina expects from their representatives,\" and he supports state legislator Chuck Edwards in the GOP primary scheduled for May 17.",
    "A group of opponents tried unsuccessfully to have state officials remove Cawthorn's name from the ballot because he participated in the Jan. 6, 2021, rally to back Trump's attempts to overturn the 2020 presidential election.",
    "RNC speaker would be youngest member of Congress if he wins in November\nTillis is not the only prominent North Carolina Republican opposing Cawthorn, who faces seven Republican challengers in the May 17 primary.",
    "In his statement, Tillis said \"voters now have several well-qualified candidates to choose from who would be a significant improvement\" over Cawthorn, and \"I believe Chuck Edwards is the best choice.\"",
    "WASHINGTON  Embattled North Carolina congressman Madison Cawthorn faced another problem Thursday: A Republican primary opponent won an endorsement from one of the state's Republican U.S. senators.",
    "Tillis' move came the same week that many Republicans  including House GOP leader Kevin McCarthy  criticized Cawthorn for claiming that lawmakers in Washington often use cocaine and hold orgies.",
    "The leaders of the North Carolina state Senate and state House are hosting a fundraiser this week for Edwards, who is probably the best-known and most well-funded of Cawthorn's challengers.",
    "Despite the renewed primary opposition, Cawthorn is not without political advantages,\nAn outspoken supporter of Donald Trump, Cawthorn also has fundraising and name identification.",
    "Primaries could magnify division as the number of swing districts shrinks\nMany Republicans have long taken a dim view of Cawthorn, who has had an eventful term in Congress.",
    "Recently, as Russian troops rolled into Ukraine, Cawthorn told supporters that Ukraine is \"incredibly evil\" and described President Volodymyr Zelenskyy as a \"thug.\"",
    "\"The 11th Congressional District deserves a congressman who is fully dedicated to serving their constituents,\" Tillis said.",
    "He also said the freshman House member must change his ways because \"he's got a lot of members very upset.\"",
    "\"Their attacks have been relentless,\" said Cawthorn, who at age 26 is the youngest member of Congress.",
    "Some conservative groups have rallied around him amid the criticism of his outspokenness.",
    "Cawthorn has also been criticized for trying to bring a gun through airport security.",
    "He faces a May court date over charges of driving with a revoked license.",
    "Primaries fuel partisanship:Think Congress is too partisan now?",
    "McCarthy said Cawthorn told him he \"exaggerated\" his remarks.",
    "They want to silence the America First movement.",
    "More:Who is Madison Cawthorn?",
    "I'm not going anywhere.\"",
    "\"I won't stop fighting.",
    "I won't bow to the mob."
  ]
}