{
  "id": 2926,
  "mediaId": 136,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "GOP Senators From Madison Cawthorn's State Won't Back His Re-Election Bid",
  "image": "https://d.newsweek.com/en/full/2012564/madison-cawthorn-thom-tillis.webp?w=790&f=2dd83688eee5be005eed3b307537cd61",
  "link": "https://www.newsweek.com/thom-tillis-richard-burr-want-cawthorn-out-office-1693758",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    821,
    1237,
    1501,
    2226,
    2303,
    428,
    562,
    571,
    2834,
    2942
  ],
  "sentences": [
    "The 26-year-old freshman lawmaker drew criticism from fellow Republicans in early March after he called Ukraine's President Volodymyr Zelensky \"a thug\" and his government \"incredibly evil\" during Russia's invasion of Ukraine.",
    "Then Cawthorn drew further anger from GOP lawmakers this week after he said during an interview that he's been invited to an orgy by prominent individuals in the U.S. Capitol and observed cocaine use by unnamed individuals.",
    "\"If your comments are being replayed over and over by Russian state propaganda outlets... #ncpol,\" the senator tweeted on March 17, sharing a clip of Cawthorn's criticism of Zelensky being broadcast by Russian media.",
    "Notably, Burr was one of the seven GOP senators to vote to convict former President Donald Trump in his Senate impeachment trial last year for inciting his supporters to attack the U.S. Capitol on January 6, 2021.",
    "Cawthorn's remarks angered GOP House members and drew stern criticism from House Minority Leader Kevin McCarthy, a California Republican, after he met directly with Cawthorn to discuss the controversial comments.",
    "North Carolina Republican Senator Thom Tillis told CNN this week that he intends to support Cawthorn's Republican opponent, state Senator Chuck Edwards, as he attempts to defeat Cawthorn in the May primaries.",
    "Representative Madison Cawthorn, a North Carolina Republican, is facing backlash from his state's two GOP senators after multiple recent controversieswith one senator deciding to back his primary challenger.",
    "\"It comes down to focus on the district, producing results for the district, and in my opinion, Mr. Cawthorn hasn't demonstrated much in the way of results over the last 18 months,\" Tillis said.",
    "The Republican congressman's most recent controversy came after he slammed what he described as \"sexual perversion\" in Washington, D.C. during an interview last week with Warrior Poet Society.",
    "If there's any thug in this world it's [Russian President Vladimir] Putin,\" the GOP House leader said after meeting with the freshman congressman over that controversy.",
    "And he's a very special guy and let's back him all the way, whatever he wants to do,\" Trump said in a March 2021 video as he stood next to Cawthorn.",
    "Cawthorn said that some leaders he'd \"looked up to\" in the capitol had invited him to an \"orgy\" and did a \"key bump of cocaine\" in front him.",
    "Newsweek reached out to spokespeople for Cawthorn, Tillis, Burr and McCarthy for further comment but did not immediately receive responses.",
    "Roger Stone, a prominent Trump ally, said hours later that Cawthorn had told him a different version of the conversation with McCarthy.",
    "Stone wrote in a post on his Telegram channel\nMcCarthy previously criticized Cawthorn for his remarks about Ukraine earlier in March.",
    "\"Congressman Madison Cawthorn just told me that he has NOT retracted his claims about sex-fueled orgies among DC elites.",
    "Trump endorsed Cawthorn for reelection last year as the congressman visited him at his Mar-a-Lago residence in Florida.",
    "Tillis previously called out Cawthorn for being utilized by Russia's state-run propaganda amid the invasion of Ukraine.",
    "\"On any given day, he's an embarrassment,\" Burr, who is retiring and not seeking reelection this year, said.",
    "Senator Richard Burr, a North Carolina Republican, also slammed Cawthorn in comments to CNN this week.",
    "The top House Republican added that there \"very well could be\" further action taken against Cawthorn.",
    "Cawthorn, the youngest member of Congress, is a staunch supporter of the former president.",
    "The GOP senator said that he does not plan to get involved in Cawthorn's primary, however.",
    "\"He has my endorsement, he has my complete and total, as I like to say, endorsement.",
    "Why would anyone believe anything said by RINO Kevin McCarthy or repeated by CNN?\"",
    "There's no evidence to this,\" McCarthy said Wednesday, Axios first reported.",
    "\"He did not tell the truth ... that's unacceptable,\" McCarthy said.",
    "\"This is unacceptable.",
    "\"Madison is wrong ..."
  ]
}