{
  "id": 2944,
  "mediaId": 43,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "North Carolina senator endorses effort to deny renomination to Madison Cawthorn in May",
  "image": "https://images.dailykos.com/images/921508/story_image/GettyImages-1304245882.jpg?1614365490",
  "link": "https://www.dailykos.com/story/2022/3/31/2089332/-North-Carolina-senator-endorses-effort-to-deny-renomination-to-Madison-Cawthorn-in-May",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    821,
    1480,
    1609,
    1882,
    2177,
    2303,
    2341,
    571,
    2602,
    2834
  ],
  "sentences": [
    "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nThe pollster argues that Edwards could gain ground once respondents learned more about him and were exposed to negative messaging about Cawthorn, such as that he favors cutting the U.S. military budget.? Kassel notes, The poll did not include references to some of Cawthorn's recent controversial remarks, such as describing Ukrainian President Volodymyr Zelensky as a thug.'? (Tillis also highlighted this in his statement, saying Edwards won't find himself being used as propaganda on Russian state television.?)\nThe survey was also finished well before this week, when Cawthorn infuriated House Minority Leader Kevin McCarthy and other party leaders when he claimed that an unidentified colleague invited him to an orgy? and that he'd witnessed prominent conservatives doing a key bump of cocaine.? McCarthy said that the freshman acknowledged he was lying, adding, I just told him he's lost my trust, and he's going to have to earn it back.? CNN reports that even Cawthorn's compatriots at the far-right Freedom Caucus are pissed and have considered ejecting him from their ranks, though sources acknowledge this is unlikely to happen.",
    "Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. Chuck Edwards' campaign to defeat freshman Rep. Madison Cawthorn in the May 17 Republican primary for North Carolina's 11th District, saying the next day that the incumbent has fallen well short of the most basic standards Western North Carolina expects from their representatives.?\nTillis threw in an unsubtle reference to Cawthorn's previous attempt to leave his constituents behind to run for an even more conservative district in the Charlotte area that he barely represented before a new court-drawn map foreclosed that possibility, antics that likely did him far more damage at home than his litany of embarrassing behavior.",
    "Tillis argued that Edwards will never turn his back on Western North Carolina or abandon his constituents for the sake of political expediency,? adding that the state senator also won't embarrass Western North Carolina with a consistent pattern of juvenile behavior, outlandish statements, and untruthfulness.?\nHowever, an internal poll for Edwards underscores just how tough it will be for him to deny Cawthorn his renomination.",
    "However, a few other powerful Tar Heel State Republicans are working to boost Edwards: Earlier this month, before Cawthorn's cocaine and orgy comments, state Senate President Pro Tempore Phil Berger and state House Speaker Tim Moore announced that they'd hold a fundraiser for the state senator.",
    "That's because the leading candidate in a primary only needs to clear 30% of the vote in order to avoid a July runoff, and with six other candidates running, it's very possible that Cawthorn can win outright even if he falls well short of a majority.",
    "A mid-March Public Opinion Strategies survey obtained by Jewish Insider's Matthew Kassel shows the far-right congressman defeating Edwards 52-20, while a third candidate who went unidentified in the memo took 12%.",
    "On Thursday he released an ad arguing that even as [t]he entire leftwing establishment has targeted? him as public enemy number one,? Cawthorn cannot be stopped.?\nThis is a short blurb about Daily Kos.",
    "Cawthorn's attempt to district hop seemed mostly about bullying Moore out of his planned campaign for Congress, so it probably didn't take much to persuade the speaker to come out against him now.",
    "However, even if Edwards and Cawthorn's own mouth can further weaken the congressman, the state's election laws still pose a huge obstacle for any challengers.",
    "Listen and subscribe to Daily Kos Elections' The Downballot podcast with David Nir and David Beard\nx\nx\nYou need to enable JavaScript to run this app.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "And if he does win renomination, he'll be difficult to beat in November in a seat that Trump would have carried 54-44.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWe open our mailbag and answer your questions!",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Cawthorn, for his part, shows no sign of changing.",
    "North Carolina Rep. Madison Cawthorn.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}