{
  "id": 2981,
  "mediaId": 238,
  "date": "3/17/2022 12:00:00 AM",
  "headline": "Opinion: Madison Cawthorn is in trouble. And it's entirely his own fault.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/03/18/madison-cawthorn-is-trouble-its-entirely-his-own-fault/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    747,
    747,
    2341,
    2303,
    2341,
    2185,
    2185,
    2303,
    1882,
    1882,
    1501,
    1501,
    620,
    620,
    428,
    359,
    359,
    428,
    249,
    249,
    2834,
    2834,
    2942,
    2942,
    2888,
    2888,
    2684,
    2684,
    2602,
    2602,
    2553,
    2553
  ],
  "sentences": [
    "He has signaled his opposition to supporting Ukraine, tweeting that the future of the Republican Party is Anti-Warmonger? and against endless wars? and RINOs.? He can disparage Putin all he wants, but Cawthorn has shown that he thinks supporting a democratically elected government invaded by a brutal dictator is warmongering.? I wonder what he would have thought of the Cold War.",
    "A video of him calling Ukrainian President Volodymyr Zelensky a thug? and decrying Ukraine's democratic government as evil? has earned Cawthorn rebukes from his state's Republican Sen. Thom Tillis and House Republican leader Kevin McCarthy.",
    "He first shocked his constituents and the North Carolina GOP hierarchy when he unexpectedly announced last November that he would abandon his safe seat in the state's mountains to run in an even safer seat in the Charlotte suburbs.",
    "And they are ready to make not-so-subtle attacks on Cawthorn's proposed move by saying they will fight for mountain values\" and make a contract with the people of District 11.?\nCawthorn's combative habits are adding to his woes.",
    "The fact that this move would have given Cawthorn an excuse to run television ads in North Carolina's largest media market, potentially setting himself up for a future statewide run, was not lost on savvy watchers.",
    "Some are nuisance candidates, but others are serious, such as GOP district chair Michele Woodhouse and Chuck Edwards, a state senator who represents a significant chunk of the new seat.",
    "Cawthorn didn't live in the district or have any connection to it, but he said he would run there to keep another establishment, go-along-to-get-along Republican? out of Congress.",
    "A couple of Republicans have filed to run in the seat while Cawthorn sought the Charlotte district, and they have stayed in the race even though Cawthorn has scrapped that plan.",
    "He has fit right in with fellow GOP rabble rousers Marjorie Taylor Greene (Ga.) and Lauren Boebert (Colo.), who delight angry activists with their over-the-top antics.",
    "The new, court-ordered map no longer created a new, Charlotte-based safe GOP seat, so Cawthorn returned home to run in the new version of the seat that elected him.",
    "Sixty-eight percent of Republicans think it's a good idea to send Ukraine weapons, and 80 percent say Ukraine is either an ally or a friend of the United States.",
    "Republicans in Cawthorn's district must choose either to embrace or to reject Cawthorn's ineffective outbursts and appalling disregard for democratic values.",
    "Eighty-seven percent of Republicans say Russia is either an enemy or unfriendly, and 83 percent sympathize more with Ukraine in its war than with Russia.",
    "Those plans were undone, however, when the Democratic-controlled state Supreme Court struck down that congressional map as an illegal gerrymander.",
    "Madison Cawthorn's pugnacious, in-your-face persona has earned the Republican congressman national attention, even though he is only 26 years old.",
    "Tillis's comments referenced the fact that Russian state media have been playing Cawthorn's remarks to whip up support for Vladimir Putin's war.",
    "It's political malpractice to be on the wrong side of your constituents on such a high-profile issue, yet that's exactly what Cawthorn has done.",
    "The move was pure power politics, as it sidelined an intra-party rival, state House Speaker Tim Moore, who was considering a run for the seat.",
    "He went on to oppose the multibillion-dollar package of humanitarian and military aid for Ukraine that Congress overwhelmingly passed.",
    "That brash aggressiveness might pay off online, but it might not be playing well with voters back in his North Carolina district.",
    "He has yet to face the negative ads his well-funded opponents will run castigating him for his actions and his views.",
    "Another candidate, local businessperson Bruce O'Connell, also made a bang by lending his campaign $1 million.",
    "Indeed, his campaign has already put out a poll showing him with 62 percent support in his primary bid.",
    "I have built my staff around comms rather than legislation,? he wrote to colleagues in January 2021.",
    "He arrived late to Zelensky's speech to Congress on Wednesday, missing half of the moving appeal.",
    "So instead of a coronation, Cawthorn will now have to battle against a bevy of local leaders.",
    "It's hard to see how Tillis can avoid endorsing one of Cawthorn's primary rivals.",
    "Cawthorn came to Congress with a clear objective: write tweets, not laws.",
    "But there are signs that Cawthorn's chutzpah is catching up with him.",
    "But Cawthorn's recent comments will likely make that old news.",
    "Who knows what his constituents will think after that barrage?",
    "Sixty-eight percent also have a favorable view of Zelensky.",
    "Cawthorn will surely say he has nothing to worry about.",
    "Most politicians stop digging when they are in a hole.",
    "He hasn't deviated from his strategy since.",
    "Most Republicans disagree with Cawthorn.",
    "Elections force voters to choose.",
    "But he has company.",
    "Not Cawthorn."
  ]
}