{
  "id": 2996,
  "mediaId": 409,
  "date": "3/10/2022 12:00:00 AM",
  "headline": "Madison Cawthorn Calls Zelensky a Thug,' Accuses Ukrainian Government of Pushing Woke Ideologies'",
  "image": "https://www.nationalreview.com/wp-content/uploads/2021/07/cawthorn.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/madison-cawthorn-calls-zelensky-a-thug-accuses-ukrainian-government-of-pushing-woke-ideologies/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brittany Bernstein",
  "authorUrl": "https://www.nationalreview.com/author/brittany-bernstein/",
  "termIds": [
    667,
    667,
    1147,
    1147,
    1969,
    1969,
    2030,
    2030,
    562,
    562,
    193,
    193,
    2834,
    2834,
    2945,
    2945,
    2942,
    2942,
    2888,
    2888
  ],
  "sentences": [
    "He supports Ukraine and the Ukrainian President's efforts to defend their country against Russian aggression, but does not want America drawn into another conflict through emotional manipulation.?\nShortly after WRAL published the video, Cawthorn tweeted that Russian President Vladimir Putin's actions are disgusting? but claimed that propaganda is being used to entice America into another war? and said leaders, including Zelensky, should NOT push misinformation on America.?\nNorth Carolina state senator Chuck Edwards, who is challenging Cawthorn in the Republican primary, pushed back against the congressman's claims, writing in a tweet, Let's be clear.",
    "Remember that the Ukrainian government is incredibly corrupt and is incredibly evil and has been pushing woke ideologies.?\nThe comments were made at a town hall in Asheville, N.C., last Saturday, according to an op-ed in the Wall Street Journal written by former White House deputy chief of staff Karl Rove.",
    "The Congressman was expressing his displeasure at how foreign leaders, including Zelensky, had recently used false propaganda to entice America into becoming involved in an overseas conflict,? spokesman Luke Ball said.",
    "Oh, that's wonderful.?\nOne day later, Trump spoke to a crowd at a fundraiser at Mar-a-Lago and said: They say, Trump said Putin's smart.' I mean, he's taking over a country for two dollars' worth of sanctions.",
    "Trump told conservative radio hosts Buck Sexton and Clay Travis: I went in yesterday and there was a television screen, and I said, This is genius.' Putin declares a big portion of the Ukraine  of Ukraine.",
    "Rove wrote that Cawthorn's comments don't reflect Republican opinion.?\nA spokesman for Cawthorn told the Washington Post that the North Carolina Republican was talking about pro-Ukraine misinformation.",
    "Anything less is counter to everything we stand for in America.?\nWhite House press secretary Jen Psaki declined to comment on Cawthorn's statements during her daily press briefing on Thursday.",
    "Representative Madison Cawthorn (R., N.C.) recently called Ukrainian President Volodymyr Zelensky a thug? and said the Ukrainian government is evil,? according to a newly surfaced video.",
    "The thug is Vladimir Putin.?\nWe must unite as a nation to pray for President Zelensky and the brave people of Ukraine who are fighting for their lives and their freedom,? he added.",
    "I'd say that's pretty smart.?\nFormer vice president Mike Pence said that there is no room in this party for apologists for Putin? during a speech to the GOP's top donors last week.",
    "Cawthorn appears to be alone in his criticism of Ukraine, with Zelensky and his government receiving bipartisan support since Russia invaded the country two weeks ago.",
    "GOP leaders condemned former President Trump last month when he called Putin smart? and savvy? shortly before Russia invaded Ukraine.",
    "House Minority Leader Kevin McCarthy (R., Calif.) and other top Republicans also spoke out against Trump's comments.",
    "Remember that Zelensky is a thug,? Cawthorn said in a video obtained by WRAL-TV.",
    "Putin declares it as independent."
  ]
}