{
  "id": 3406,
  "mediaId": 65,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "House primaries in NC, PA, OR cap bloody intraparty battles as Cawthorn, Lee, Schrader face tests",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/22157589-3cdc-4238-aee6-21af1ef82242/4927b44e-2dfa-443b-a591-09a1a5edff77/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/house-primaries-nc-pa-oregon-cawthorn-lee-schrader-bloody-intraparty-battles",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    821,
    2303
  ],
  "sentences": [
    "\"Instead of 'thanking' Black women, Black voters, and especially, Black organizers... give us the investments we need and deserve, redistribute wealth, ends police violence, abolish the carceral state, commit to building Black directed political power... and reparations,\" Lee tweeted in November 2020.",
    "CLICK HERE TO GET THE FOX NEWS APP\n\"At 18 years of age, Madison Cawthorn, the now 26 year old Congressman from the Great State of North Carolina, went through a life changing event the likes of which, fortunately, few people will ever have to endure,\" Trump wrote on Truth Social over the weekend.",
    "Unfortunately, Madison Cawthorn has fallen well short of the most basic standards Western North Carolina expects from their representatives, and voters now have several well-qualified candidates to choose from who would be a significant improvement,\" Tillis said.",
    "While the Republican Pennsylvania Senate primary has gobbled up much of the media coverage in the state, the Democratic primary for the state's 12th Congressional District has been a bruising battle between the party's establishment and progressive factions.",
    "Lee, a \"Squad\"-backed democratic socialist, is facing down Steve Irwin, an attorney and activist in western Pennsylvania who supports a single-payer healthcare system but has differentiated himself from Lee on account of his strong pro-Israel stance.",
    "McLeod-Skinner has staked out strong progressive positions and made the issue of abortion a central tenet of her campaign, even hitting Schrader for praising the Hyde Amendment after voting against it  an amendment McLeod-Skinner calls \"odious.\"",
    "Rep. Madison Cawthorn, R-N.C., is facing a primary blitz ahead of his first re-election bid that has seen a PAC linked to Senator Thom Tillis, R-N.C., throw hundreds of thousands of dollars against the freshman congressman.",
    "The cowboy congressman received a potential primary boon through his endorsement by President Biden, who threw his hat behind the Oregon Democrat in light of his vote against the president's $1.9 trillion spending bill.",
    "The footage surfaced amid several of the congressman's controversies, including where he claimed his GOP colleagues had ripped lines of cocaine in front of him and invited him to orgies.",
    "Trump's endorsement is a boon for Cawthorn in the ruby-red district he's running for re-election in, but whether that will trump local North Carolina endorsements is yet to be seen.",
    "Tuesday's primaries in Pennsylvania, North Carolina and Oregon mark the end of several fierce intraparty battles for House nominations ahead of this November's midterm elections.",
    "She's also endorsed several socialist ideals  including the redistribution of wealth  as well as controversial progressive policies like abolishing the \"carceral system.\"",
    "The Hyde Amendment is a federal law that prevents federal funds from going toward abortions except in the cases of incest, rape, or when the mother's life is in danger.",
    "Tillis endorsed Cawthorn's primary opponent, Republican state Senator Chuck Edwards, in March, saying he believes Edwards to be the \"best choice\" for the seat.",
    "However, Cawthorn secured the endorsement of former President Trump, who called on voters to give the freshman a \"second chance\" after his \"foolish mistakes.\"",
    "\"And in doing so, he has helped to pass much of my agenda into lawmaking a huge difference in the lives of the Oregonians he represents and all of America.\"",
    "The freshman Republican is also reportedly not seeing much public support for his re-election efforts from other members of the North Carolina delegation.",
    "Cawthorn's primary has gotten a lot of media attention after several leaks of controversial photos and videos have made their rounds online and on-air.",
    "Lee has faced scrutiny from Jewish groups for her statements about the Israel-Palestine conflict, including comparing it to the murder of George Floyd.",
    "\"We don't always agree, but when it has mattered most, Kurt has been there for me,\" Biden said in a statement released by the Schrader campaign.",
    "Other Jewish organizations, including the Democratic Majority for Israel and Pro-Israel America, have thrown their weight behind Irwin as well.",
    "Pennsylvania state Rep. Summer Lee, a far-left progressive, who is looking to take retiring Rep. Mike Doyle's, D-Penn., vacating seat.",
    "McLeod-Skinner has received backing from county Democrat officials, in contrast to Schrader's support from national Democrats.",
    "With the district's heavy lean toward the Democrats, it is likely that whoever wins the blue primary will win the new seat.",
    "The AIPAC-affiliated United Democracy Project, a pro-Israel super PAC, has dumped money into the race on behalf of Irwin.",
    "The district includes the Tree of Life synagogue, which was the site of a 2018 mass shooting that killed 11 congregants.",
    "Oregon is seeing a similar battle play out between Rep. Kurt Schrader, D-Ore., and his challenger Jamie McLeod-Skinner.",
    "\"Recently, he made some foolish mistakes, which I don't believe he'll make again...let's give Madison a second chance!\"",
    "Tillis has also called for an investigation into alleged insider trading by the young congressman via cryptocurrency.",
    "The freshman Republican called the several photo and video drops as a \"drip drip campaign\" that was \"blackmail.\"",
    "\"The 11th Congressional District deserves a congressman who is fully dedicated to serving their constituents.",
    "\"In just seconds, he lost the use of the lower half of his body, a traumatic experience to say the least.",
    "\"Now we have a lot more to do, and to get it done we need to keep a Democratic Congress,\" Biden added.",
    "When Madison was first elected to Congress, he did a great job,\" he continued.",
    "Story tips can be sent to Houston.Keene@Fox.com and on Twitter: @HoustonKeene",
    "Republicans aren't free from a potential primary shake-up, either.",
    "Lee isn't without her own heavyweight backers, including Sens.",
    "Houston Keene is a politics reporter for Fox News Digital.",
    "Bernie Sanders, I-Vt., and Elizabeth Warren, D-Mass.",
    "\"I believe Chuck Edwards is the best choice.\""
  ]
}