{
  "id": 3420,
  "mediaId": 151,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "The Easiest Way Republicans Could Stop Madison Cawthorn from Winning",
  "image": "https://www.politico.com/dims4/default/214f2d6/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F89%2Fad%2F13af00ad418fa5dbca545b1eb632%2Fgettyimages-1239877513.jpg",
  "link": "https://www.politico.com/news/magazine/2022/05/16/madison-cawthorn-ranked-choice-voting-00032160",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    821,
    2303
  ],
  "sentences": [
    "To Cawthorn, freedom includes things like bringing a loaded gun to an airport (twice), firing up the crowd at the Jan. 6 Stop the Steal? rally, promoting a Let's go Brandon? meme coin in a potential violation of securities law, driving with a suspended license (twice), calling Ukrainian president Volodymyr Zelenskyy a thug? and falsely claiming to have been invited to cocaine-fueled orgies by members of Congress.",
    "Rep. Madison Cawthorn speaks at a Trump rally, April 9, 2022, in Selma, N.C. | Allison Joyce/Getty Images\nOpinion by Patrick J. McGinnis\n 05/16/2022 11:00 AM EDT\nPatrick J. McGinnis (@pjmcginnis) is a venture capitalist, the host of the podcast FOMO Sapiens and the author of Fear of Missing Out: Practical Decision-Making in a World of Overwhelming Choice.",
    "In another, which was submitted to the Office of Congressional Ethics, he is groped by a staffer who has been identified as either his second cousin or his third cousin once removed; the staffer, with whom Cawthorn also exchanged a series of suggestive Venmo payments, has pocketed over $141,000 in taxpayer and campaign funds since 2020.",
    "But by pushing to replace the current system  which risks selecting a flawed and unpopular candidate that lacks majority support  with ranked-choice voting, the Republican Party could truly give its constituents a say over who will, and who will not, be the future of the party.",
    "Republican leaders could also leverage the work of Better Ballot North Carolina, the nonpartisan group that is leading the charge to enact RCV in the state, to attract support from across the ideological spectrum and deliver a bipartisan solution to their constituents.",
    "That's because, under the system used in North Carolina and much of the country, more choice means more candidates, a splintering of the electorate and the potential that a widely unpopular candidate can still emerge victorious with less than the majority of the vote.",
    "The group, which labels the candidate as an insurrectionist, sexual predator, Covid-denier and Hitler Fan and Casual Racist,? released the video of Cawthorn nakedly romping with his friend, asserting that it came from one of the congressman's former supporters.",
    "North Carolina Sen. Thom Tillis has led the efforts to torpedo Cawthorn, declaring that the congressman has fallen well short of the most basic standards Western North Carolina expects from their representatives.? Over the last six weeks, Tillis has been busy.",
    "In the case of North Carolina, however, a move to RCV would represent one of those very rare political events where all factions  the political establishment, the voters and even Cawthorn  could all potentially stand to benefit.",
    "The party will either be yoked with a weak candidate that could put a solidly Republican district in play in the general election, or it will spend another term enduring its fallen star's increasingly bizarre antics.",
    "That means that Cawthorn, who views himself as the future of the GOP, could secure the nomination in contravention of the clear preference of his party's voters to choose someone who is not named Madison Cawthorn.",
    "Although RCV is a politically neutral system that doesn't advantage any particular candidate or ideology, it draws opponents from both the left and the right for one simple reason: It challenges the status quo.",
    "Perhaps more importantly, by embracing this kind of election reform, he can prove to all of his critics  and to himself  that he truly is a radical for freedom? when it comes to how we run our democracy.",
    "He's also blown up the internet on multiple occasions thanks to leaked videos that Cawthorn has himself admitted are crass? and foolish.? In one, he is naked and simulating a sex act with a male friend.",
    "Despite making headlines for all the wrong reasons in the run-up to his Republican congressional primary, embattled Rep. Madison Cawthorn (R-N.C.) still looks likely to prevail on election night.",
    "While it's possible that the weight of Cawthorn's scandals may cause him to lose the primary, the war of attrition that is ripping apart the North Carolina GOP will produce no winners.",
    "While it would be reasonable to assume that all this would spell the end of his political career, Cawthorn is poised to win his primary on May 17, despite polling at just 38 percent.",
    "Then, a super PAC tied to Tillis spent more than $300,000 to cut an attack ad warning that in perpetual pursuit of celebrity, Cawthorn will lie about anything.?\nTillis is not alone.",
    "Rather than trying to destroy a deeply flawed candidate, North Carolina Republicans would be far better off attacking the root cause of their problem: their election system.",
    "Unfortunately, as the North Carolina primary shows, when it comes to elections, more choice doesn't necessarily result in an outcome that reflects the will of most voters.",
    "He will do so despite an ongoing series of self-inflicted scandals and an unrelenting campaign, waged by forces at home and in Washington, to discredit him before voters.",
    "In a given election, voters rank candidates from their favorite to their least favorite (first choice, second choice and so on), ranking as many candidates as they like.",
    "Since his core base of supporters exceeds that threshold and the opposition is fragmented among seven other candidates, it's Cawthorn's race to lose, try as he might.",
    "For the political establishment, the letters R, C and V might as well stand for Remove Cawthorn Voting,? since RCV helps to weed out divisive or extreme candidates.",
    "He sits on the steering committee of the Leadership Now Project and the board of directors of BridgeUSA, both of which seek to strengthen American democracy.",
    "As the youngest member of Congress, Cawthorn leveraged his large social media following to burnish his image as a freedom-loving opponent of the status quo.",
    "If he emerges from an RCV primary victorious, he would do so with a true mandate and a case to make that he is, in fact, the future of the Republican Party.",
    "Speaking before a wall of American flags, he called on each of his followers to be a radical for freedom? before dramatically rising from his wheelchair.",
    "That's because under North Carolina's election laws, he needs to win with at least a plurality of just 30 percent of the vote in order to avoid a runoff.",
    "At the end of each round, the last-place candidate is eliminated, and their votes are reallocated to each voter's next choice based on their ranking.",
    "A North Carolina-based super PAC called American Muckrakers has launched www.firemadison.com to serve as an online hub for all things anti-Cawthorn.",
    "Unlike Maine and Alaska, which required public referendums, North Carolina would only need to pass a bill in the GOP-controlled General Assembly.",
    "As a culture, we embrace the idea that having more choices will best allow us to pick something that actually reflects our wants and needs.",
    "For voters, RCV represents a major upgrade to the current electoral system in that it gives them a far stronger voice in their democracy.",
    "Politicians who have figured out how to win under the current rules of the game have no incentive to move to a more competitive system.",
    "Competing under RCV would allow him to prove, despite all of his baggage, that he can still win a majority in a competitive election.",
    "North Carolina  as with most states  allows a candidate to win despite falling far short of a majority, as he has in recent polling.",
    "Next, he called for the House Ethics Committee to investigate Cawthorn for insider trading related to his meme coin misadventures.",
    "That is very bad news for the GOP establishment, which is fretting at the prospect of two distinct yet equally troubling outcomes.",
    "When Cawthorn entered politics, he was unequivocal about his desire to reinvent the Republican Party as one steeped in freedom.",
    "It also debuted in 2021 in New York City, where it was widely embraced and helped to boost turnout while fostering diversity.",
    "When he secured a prime slot at the Republican National Convention, Cawthorn made his case directly to the American people.",
    "The collective pain might, however, encourage the party establishment to redirect its ire toward a more productive goal.",
    "In that way, they are never forced to compromise or worry that they are throwing away their vote on a spoiler candidate.",
    "It has been adopted in Maine, and it will soon be implemented in Alaska where it was approved in a 2020 referendum.",
    "Given this quagmire, a number of Republicans have declared all-out internecine war on Cawthorn's reelection bid.",
    "Citizens can vote knowing that even if their first choice loses, they still have a say in who represents them.",
    "It turns out that Cawthorn's brand of freedom falls well outside of the mainstream, no matter your politics.",
    "Whether it's deciding on a car or what to stream on TV, Americans are accustomed to having lots of choice.",
    "At this point, even former President Donald Trump is reportedly weirded out? by Cawthorn's controversies.",
    "This process is repeated until one candidate gets a majority of the votes and is proclaimed the winner.",
    "Once the polls close, ballots are counted in rounds under what's called an instant runoff? system.",
    "First, he endorsed Cawthorn's opponent, state Sen. Chuck Edwards, who is polling at 21 percent.",
    "First, RCV saves considerable money as it eliminates the need for future runoff elections.",
    "Second, RCV is already understood and used by millions of people across the country.",
    "RCV is not without opponents who lament that it's too expensive and too complicated.",
    "Yet if he wins, it won't be because most of his constituents looked the other way.",
    "They could achieve this by bringing ranked-choice voting to the Tar Heel state.",
    "Rather, Cawthorn can thank his state's electoral system for protecting him.",
    "It may be too late to stop Cawthorn from winning the primary this time.",
    "Why, then, should Americans accept anything less in their politics?",
    "It would also be relatively straightforward to enact into law.",
    "In contrast, RCV makes choice a virtue, not a threat.",
    "Then there's Madison Cawthorn himself.",
    "But the evidence is against them."
  ]
}