{
  "id": 3425,
  "mediaId": 136,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Donald Trump Urges Madison Cawthorn Be Given 'Second Chance' in NC Primary",
  "image": "https://d.newsweek.com/en/full/2038058/trump-support-madison-cawthorn.webp?w=790&f=94f0ef0af53f406a6fbd5e21b41cb20a",
  "link": "https://www.newsweek.com/trump-madison-cawthorn-north-carolina-primary-1706820",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    821,
    2303
  ],
  "sentences": [
    "\"At 18 years of age, Madison Cawthorn, the now 26 year old Congressman from the Great State of North Carolina, went through a life changing event the likes of which, fortunately, few people will ever have to endure,\" Trump said in reference to the car crash Cawthorn was involved in when he was 18 which left him paralyzed.",
    "The 26-year-old has also caused outrage within his own party for claiming colleagues in Washington, D.C. have invited him to orgies and took cocaine in front of him, as well as calling Ukraine President Volodymyr Zelensky a \"thug\" soon after the Russian invasion.",
    "As noted by CNN, not one of the nine Republican members of the North Carolina delegation have publicly supported Cawthorn's re-election bid, with Senator Thom Tillis endorsing State Senator Chuck Edwards' efforts to unseat the incumbent.",
    "According to a survey by the Republican GOPAC Election Fund published in April, Cawthorn's approval rating in North Carolina fell 13 percentage points from 64 to 51 compared to the previous month amid the string of controversies.",
    "There have been claims the congressman is involved in an illegal insider trader scheme related to a \"Let's Go Brandon\" cryptocoina cryptocurrency named after the Republican catchphrase used to attack President Joe Biden.",
    "The former president, who previously endorsed Cawthorn in March, once again gave his backing to the freshman following a series of controversies and antics which have threatened his chances of getting re-elected.",
    "In a statement on Truth Social, Trump said Cawthorn has made some \"foolish mistakes\" while urging voters to back him for the Republican nomination in North Carolina's 11th congressional district.",
    "The constant release of negative stories about Cawthorn ahead of his primary has led to reports the GOP is trying to oust him from office because they believe he is too damaging to the party.",
    "A spokesperson for bookmaker Betfair told Newsweek that despite recent \"slip-ups,\" Cawthorn is still at 2/5 odds to be re-elected in North Carolina in November's midterms.",
    "Over the past several months, Cawthorn has been cited for the second time for bringing a loaded gun to an airport, and was caught allegedly driving with a revoked license.",
    "As well as the legal issues, there have also been a number of potentially damaging photos and images which have leaked to the press about Cawthorn in recent weeks.",
    "Donald Trump has urged voters to give embattled North Carolina congressman Madison Cawthorn a \"second chance\" ahead of the GOP primary on Tuesday.",
    "\"There's no one thing that put me in a position to where the first time in my career I'm opposing a sitting Republican,\" Tillis told CNN.",
    "These include photos of him wearing women's lingerie and a video of the congressman naked in bed thrusting against another male.",
    "The April poll also found that 39 percent of voters said they would back Cawthorn in the primary, down from 54 percent in March.",
    "Recently, he made some foolish mistakes, which I don't believe he'll make again...let's give Madison a second chance!\"",
    "However, Cawthorn was still way ahead of his nearest rival Edwards, who was polling a distant second at 21 percent.",
    "\"In just seconds, he lost the use of the lower half of his body, a traumatic experience to say the least.",
    "When Madison was first elected to Congress, he did a great job.",
    "Cawthorn has been contacted for comment.",
    "It's a lack of seriousness.\"",
    "But it's the totality.",
    "\"I've never done it."
  ]
}