[
  {
    "id": 10666,
    "mediaId": 8468,
    "date": "2022-03-30",
    "sentence": "While doxxing underage girls is apparently par-for-the-course for Sims, it doesn’t fit into <span class='selected-term'>Josh Shapiro</span>’s clean-cut formula for winning election in November.",
    "author": "Matthew J. Brouillette",
    "title": "Matthew J. Brouillette: Josh Shapiro’s Lt. Governor problem"
  },
  {
    "id": 6573,
    "mediaId": 8314,
    "date": "2022-04-13",
    "sentence": "My office still was one of the top offices in terms of responding to unemployment, getting people rent assistance… and also all the random things that come up on a daily basis that people expect their elected officials to help them with and show up and do.”\nAttorney General <span class='selected-term'>Josh Shapiro</span>, who is running unopposed in the gubernatorial primary, spoke via Zoom about his work enacting LGBTQ nondiscrimination laws in Montgomery County, and fighting to preserve marriage equality.",
    "author": "Michele Zipkin -",
    "title": "Candidates make their case to LGBTQ voters"
  },
  {
    "id": 6538,
    "mediaId": 8500,
    "date": "2022-04-15",
    "sentence": "So when the Shapiro camp noticed \"ENDORSED <span class='selected-term'>JOSH SHAPIRO</span>,\" along with a check-marked ribbon, appeared at the end of Sims' new statewide ad, lawyers fired off a cease-and-desist order.",
    "author": "MARK SCOLFORO Associated Press",
    "title": "Shapiro: Dem candidate's ad wrongly implies endorsement"
  },
  {
    "id": 6212,
    "mediaId": 8254,
    "date": "2022-04-16",
    "sentence": "So when the Shapiro camp noticed “ENDORSED <span class='selected-term'>JOSH SHAPIRO</span>,” along with a check-marked ribbon, appeared at the end of Sims’ new statewide ad, lawyers fired off a cease-and-desist order.",
    "author": "Mark Scolforo",
    "title": "Shapiro: Dem candidate’s ad wrongly implies endorsement"
  },
  {
    "id": 4845,
    "mediaId": 8402,
    "date": "2022-04-21",
    "sentence": "An ad by Rep. Brian Sims seeking the Democratic nomination for Pennsylvania lieutenant governor this year drew a complaint Friday, April 15, 2022 and a sharply worded letter from <span class='selected-term'>Josh Shapiro</span>, the party’s presumed nominee for governor.",
    "author": "Philadelphia Sun Staff",
    "title": "Shapiro: Dem candidate’s ad wrongly implies endorsement"
  },
  {
    "id": 4920,
    "mediaId": 8500,
    "date": "2022-04-21",
    "sentence": "PITTSBURGH —\nThe democratic primary candidate for Pennsylvania governor Attorney General <span class='selected-term'>Josh Shapiro</span> and his running mate Austin Davis came to a union training facility in Pittsburgh on Thursday to talk about their plans for investing in Pennsylvania's skilled job training and jobs future.",
    "author": "Bob Mayo",
    "title": "Shapiro pledges boost in PA jobs skills training, vo-tech programs if elected PA governor"
  }
]