[
  {
    "id": 2809,
    "mediaId": 2641,
    "date": "2022-01-28",
    "sentence": "Another no-show will be state Attorney General <span class='selected-term'>Josh Shapiro</span>, who’s expected to be the Democratic nominee in the state gubernatorial race.",
    "author": "Michael Dorstewitz",
    "title": "Dems Now Avoid Their Biggest Liability — Joe Biden"
  },
  {
    "id": 3082,
    "mediaId": 2748,
    "date": "2022-01-29",
    "sentence": "John Fetterman, a leading Senate candidate, and state Attorney General <span class='selected-term'>Josh Shapiro</span>, the likely Democratic nominee in the race for governor, will be absent because of scheduling conflicts, according to their spokespeople.",
    "author": "Women System",
    "title": "Democrats Are Already Making Excuses To Not Appear In Public With Joe Biden"
  },
  {
    "id": 3229,
    "mediaId": 6404,
    "date": "2022-02-04",
    "sentence": "Several high-profile Democratic candidates have already skipped out on appearing with Biden, including Georgia gubernatorial candidate Stacey Abrams and Pennsylvania Democrats John Fetterman and <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Mike LaChance",
    "title": "Democrat Candidate for Texas Governor Beto O’Rourke ‘Not Interested’ In Help From Joe Biden"
  },
  {
    "id": 11597,
    "mediaId": 2572,
    "date": "2022-03-22",
    "sentence": "Democratic incumbent governors are running for reelection in all of those states, other than the key battleground of Pennsylvania, where the party seems to be coalescing around state Attorney General <span class='selected-term'>Josh Shapiro</span> in the race to succeed term-limited Gov.",
    "author": "",
    "title": "Under attack by Trump, Georgia Gov. Kemp gets reinforcements from pro-GOP governors group, Chris Christie"
  },
  {
    "id": 6577,
    "mediaId": 8314,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Jason Villemez",
    "title": "Your equal rights might be gone soon, in Pa. and elsewhere"
  }
]