[
  {
    "id": 2733,
    "mediaId": 8254,
    "date": "2022-02-02",
    "sentence": "HARRISBURG, Pa. (AP) — The Democratic Party’s endorsed candidate for governor of Pennsylvania, state Attorney General <span class='selected-term'>Josh Shapiro</span>, headed into 2022 with $13.4 million in his campaign account, a state record for a candidate heading into an election year.",
    "author": "Marc Levy",
    "title": "Shapiro sets campaign cash record to start election year"
  },
  {
    "id": 12880,
    "mediaId": 2631,
    "date": "2022-02-28",
    "sentence": "Democrats, meanwhile, already have a presumptive nominee in Attorney General <span class='selected-term'>Josh Shapiro</span>, who has crossover appeal and a national reputation built in part by pushing back against Trump’s election lies.",
    "author": "",
    "title": "Inside the chaotic GOP primary for governor in Pennsylvania"
  },
  {
    "id": 17239,
    "mediaId": 2512,
    "date": "2022-02-28",
    "sentence": "Please understand that this is abnormal and beyond the guardrails, like so much in our civic discourse at this time.”\nDave La Torre, a spokesperson for Corman, told the Philadelphia Inquirer that voters in Pennsylvania “deserve to know that their candidates for governor are transparent and comply with the law.”\nSeidman reports, “(A) letter Wednesday from Corman campaign lawyer Zachary M. Wallen alleged Mastriano ‘may have committed flagrant and willful violations’ of state law by ‘submitting an obviously deficient and incomplete campaign finance report.’ The Corman campaign also sent the letter to state Attorney General <span class='selected-term'>Josh Shapiro</span>, a Democrat who is also running for governor.”",
    "author": "Alex Henderson",
    "title": "Pennsylvania’s gubernatorial race turns nasty as candidate Corman demands criminal investigation of rival Mastriano"
  },
  {
    "id": 15281,
    "mediaId": 8254,
    "date": "2022-03-09",
    "sentence": "The Fox News poll did not include Democratic candidates with the party backing Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>.",
    "author": "George Stockburger",
    "title": "Pennsylvania Governor race a virtual tie; Fox News poll"
  },
  {
    "id": 13528,
    "mediaId": 8254,
    "date": "2022-03-17",
    "sentence": "HARRISBURG, Pa. (WHTM/AP) — A massive Republican primary field for governor in Pennsylvania is spurring growing discomfort among party leaders that a widely splintered primary vote could produce a winner who cannot beat Democrat <span class='selected-term'>Josh Shapiro</span> in November’s general election.",
    "author": "George Stockburger",
    "title": "Pennsylvania’s big GOP primary field for governor has party leaders worried"
  },
  {
    "id": 13433,
    "mediaId": 6571,
    "date": "2022-03-18",
    "sentence": "HARRISBURG, Pa. (AP) — Democrat <span class='selected-term'>Josh Shapiro</span> is rolling out the first tax proposal of his candidacy for governor, saying Friday that he would use surplus state cash and federal pandemic aid to eliminate state taxes on cell phone bills, send payments to car-owning households and expand Pennsylvania's rent and property tax rebate program.",
    "author": "",
    "title": "Josh Shapiro Rolls Out First Tax Relief Plan Of Governor's Race"
  },
  {
    "id": 9168,
    "mediaId": 2732,
    "date": "2022-03-22",
    "sentence": "“This is about partnering with other Republicans to make sure we have a process that doesn’t get hijacked by the media or liberal activists.”\nMurtaugh said, “the media doesn’t have an interest in picking the best Republican candidate to beat <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Associated Press",
    "title": "4 GOP candidates for Pa. governor set rules to join a debate"
  },
  {
    "id": 9271,
    "mediaId": 2732,
    "date": "2022-03-24",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span>, after all, will come through the primary season without a scratch.",
    "author": "",
    "title": "Editorial: GOP candidates should embrace better debates"
  },
  {
    "id": 10240,
    "mediaId": 8483,
    "date": "2022-03-29",
    "sentence": "Corman said there's growing momentum for a Republican to beat Democrat <span class='selected-term'>Josh Shapiro</span> in November.",
    "author": "Tom Lehman",
    "title": "One-on-one with Pennsylvania gubernatorial candidate Jake Corman"
  },
  {
    "id": 6874,
    "mediaId": 8380,
    "date": "2022-04-12",
    "sentence": "The winner of the May 17 primary will take on state Attorney General <span class='selected-term'>Josh Shapiro</span>, who is running unopposed in the Democratic primary.",
    "author": "Brian X. McCrone",
    "title": "Call with Trump Leads Pa. GOP Candidate to Stay in Race for Governor"
  },
  {
    "id": 6510,
    "mediaId": 8404,
    "date": "2022-04-13",
    "sentence": "The nine-person field has some state GOP officials worried that a badly divided primary electorate will choose a nominee who can’t beat presumptive Democratic nominee <span class='selected-term'>Josh Shapiro</span>, the state attorney general.",
    "author": "Associated Press",
    "title": "Trump intervenes in Pennsylvania GOP gubernatorial primary"
  },
  {
    "id": 4639,
    "mediaId": 8254,
    "date": "2022-04-19",
    "sentence": "Democrat <span class='selected-term'>Josh Shapiro</span>, who is running unopposed, has $12 million more cash on hand than all nine Republican candidates combined.",
    "author": "George Stockburger",
    "title": "Pennsylvania Governor race: Shapiro & White lead Q1 fundraising"
  },
  {
    "id": 5828,
    "mediaId": 2732,
    "date": "2022-04-20",
    "sentence": "All nine will appear on the May 17 primary ballots, as will Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span>, who is the only Democrat running for his party’s nomination.",
    "author": "",
    "title": "5 takeaways from Spotlight PA’s Republican gubernatorial debate"
  },
  {
    "id": 5066,
    "mediaId": 8489,
    "date": "2022-04-24",
    "sentence": "In the gubernatorial race, Pennsylvania Attorney General <span class='selected-term'>Josh Shapiro</span> is the lone Democrat on the ballot.",
    "author": "Maria Pulcinella",
    "title": "What you need to know ahead of the 2022 Pa. primary election"
  }
]