[
  {
    "id": 5889,
    "mediaId": 2732,
    "date": "2022-04-12",
    "sentence": "Bill’s record of upholding the law and going after criminals speaks for itself.”\nOn the campaign trail, McSwain points to himself as the only prosecutor in the Republican gubernatorial primary race and the opposite of the prosecutor who is running unopposed in his bid for the Democratic gubernatorial nomination: <span class='selected-term'>Josh Shapiro</span>.",
    "author": "Pennlive.Com",
    "title": "Trump weighs in on Pa. governor’s race, naming candidate he's not endorsing"
  },
  {
    "id": 5942,
    "mediaId": 8401,
    "date": "2022-04-12",
    "sentence": "READ MORE:\nAttorney General <span class='selected-term'>Josh Shapiro</span> is the presumptive Democratic nominee for governor.",
    "author": "",
    "title": "Former President Donald Trump Slams Bill McSwain, Who’d Sought His Endorsement For Pennsylvania Governor"
  },
  {
    "id": 5224,
    "mediaId": 2746,
    "date": "2022-04-12",
    "sentence": "Attorney General <span class='selected-term'>Josh Shapiro</span> is the presumptive Democratic nominee for governor.",
    "author": "",
    "title": "Trump slams McSwain, who’d sought his endorsement for gov"
  },
  {
    "id": 6510,
    "mediaId": 8404,
    "date": "2022-04-13",
    "sentence": "The nine-person field has some state GOP officials worried that a badly divided primary electorate will choose a nominee who can’t beat presumptive Democratic nominee <span class='selected-term'>Josh Shapiro</span>, the state attorney general.",
    "author": "Associated Press",
    "title": "Trump intervenes in Pennsylvania GOP gubernatorial primary"
  },
  {
    "id": 6442,
    "mediaId": 8503,
    "date": "2022-04-18",
    "sentence": "The primary election is May 17, and the winner of the Republican nomination will take on state Attorney General <span class='selected-term'>Josh Shapiro</span>, the presumed Democratic nominee.",
    "author": "",
    "title": "Bill McSwain still touts Trump connection even though the ex-president trashed him"
  }
]