[
  {
    "id": 2200,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Controversial Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) is taking a stand in a GOP primary two states to the east as Republicans battle each other in the 2022 midterms.",
    "author": "Bob Brigham",
    "title": "Paul Gosar endorses ‘dumbest guy in Congress’ in primary against Texas AG Ken Paxton"
  },
  {
    "id": 2143,
    "mediaId": 2547,
    "date": "2022-02-10",
    "sentence": "You may recall that Ali Alexander, a felon formerly known as Ali Akbar, has claimed that he planned the Jan. 6th rally preceding the Capitol insurrection with Congressmen <span class='selected-term'>Paul Gosar</span>, Mo Brooks and Andy Biggs.",
    "author": "NewsHound Ellen",
    "title": "Ali Alexander Was Mysteriously Paid Thousands Just After 1/6 Subpoena"
  },
  {
    "id": 12716,
    "mediaId": 2520,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> was one of three members of the House of Representatives on Wednesday to vote against a symbolic measure calling for a cease-fire in Ukraine and support for its people.",
    "author": "Ronald J. Hansen",
    "title": "Rep. Paul Gosar is 1 of 3 to vote against pro-Ukraine measure"
  },
  {
    "id": 11001,
    "mediaId": 2641,
    "date": "2022-03-08",
    "sentence": "Rosendale wrote on Twitter that “the American people are sick and tired of career politicians consistently putting the interests of foreign nations above our own, we must put America first.”\nLast month, Rosendale introduced the “Secure America’s Borders First Act.”\nAccording to Breitbart, Rosendale’s bill, which is co-sponsored by Reps. Andy Biggs, R-Ariz., Bob Good, R-Va., Matt Gaetz, R-Fla., <span class='selected-term'>Paul Gosar</span>, R-Ariz., Jody Hice, R-Ga., Mary Miller, R-Ill., Ralph Norman, R-S.C., Bill Posey, R-Fla., and Randy Weber, R-Texas., would require the federal government to restart building the border wall and to continue building 30-foot steel bollard barriers along the border with Mexico.",
    "author": "Jeremy Frankel",
    "title": "Rep. Rosendale Leads Effort to Stop Ukraine Funding Without Border Wall Completion"
  },
  {
    "id": 10735,
    "mediaId": 2526,
    "date": "2022-03-08",
    "sentence": "[Emphasis added]\nReps. Andy Biggs (R-AZ), Bob Good (R-VA), Matt Gaetz (R-FL), <span class='selected-term'>Paul Gosar</span> (R-AZ), Jody Hice (R-GA), Mary Miller (R-IL), Ralph Norman (R-SC), Bill Posey (R-FL), and Randy Weber (R-TX) are co-sponsoring the legislation.",
    "author": "John Binder",
    "title": "Matt Rosendale: No Taxpayer Money for Ukraine Until Border Wall Is Done"
  },
  {
    "id": 10785,
    "mediaId": 2557,
    "date": "2022-03-10",
    "sentence": "Ilhan Omar (Minn.)\nRepublicans:\nAndy Biggs (Ariz.)\nMarjorie Taylor Greene (Ga.)\nLouie Gohmert (Texas)\nDan Bishop (N.C.)\nGlenn Grothman (Wis.)\nLauren Boebert (Colo.)\nTom Tiffany (Wis.)\nMatt Gaetz (Fla.)\n<span class='selected-term'>Paul Gosar</span> (Ariz.)\nClay Higgins (La.)",
    "author": "DML News App",
    "title": "REPORT: The 17 lawmakers who voted against the Russian oil ban"
  },
  {
    "id": 13432,
    "mediaId": 8475,
    "date": "2022-03-16",
    "sentence": "Seventeen Republican members of Congress, including Arizona’s Andy Biggs and <span class='selected-term'>Paul Gosar</span>, have sued the U.S. Centers for Disease Control and Prevention, seeking an end to the federal rule requiring passengers on commercial flights and in airports to wear masks.",
    "author": "Jacob Fischler",
    "title": "Republicans in Congress file suit to end mask mandate for air travel"
  },
  {
    "id": 9648,
    "mediaId": 2676,
    "date": "2022-03-25",
    "sentence": "In a now-deleted Periscope video posted in December 2020, Alexander also claimed that Brooks was one of three members of Congress — along with Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs, both of Arizona — who had helped plan the activities of Jan. 6.",
    "author": "Kathryn Joyce",
    "title": "MAGA purge: Jan. 6 organizer labels former ally Rep. Mo Brooks as \"LOSER\" and \"piece of crap\""
  },
  {
    "id": 9244,
    "mediaId": 2664,
    "date": "2022-03-25",
    "sentence": "In a now-deleted Periscope video posted in December 2020, Alexander also claimed that Brooks was one of three members of Congress — along with Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs, both of Arizona — who had helped plan the activities of Jan. 6.",
    "author": "Kathryn Joyce",
    "title": "MAGA purge: Jan. 6 organizer labels former ally Rep. Mo Brooks as 'LOSER' and 'piece of crap'"
  },
  {
    "id": 9061,
    "mediaId": 2512,
    "date": "2022-03-27",
    "sentence": "In a now-deleted Periscope video posted in December 2020, Alexander also claimed that Brooks was one of three members of Congress — along with Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs, both of Arizona — who had helped plan the activities of Jan. 6.",
    "author": "Kathryn Joyce",
    "title": "Jan. 6 organizer labels former ally Rep. Mo Brooks a 'LOSER'"
  },
  {
    "id": 8990,
    "mediaId": 2520,
    "date": "2022-03-30",
    "sentence": "Republican Reps. Andy Biggs and <span class='selected-term'>Paul Gosar</span> of Arizona voted against the measure, which the House of Representatives passed Tuesday on a 349-63 vote.",
    "author": "Cami Parrish",
    "title": "Congress OKs Sandra Day O'Connor, Ruth Bader Ginsburg statues at US Capitol"
  },
  {
    "id": 7358,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Now Reps. Andy Biggs (R-AZ) and <span class='selected-term'>Paul Gosar</span> (R-AZ) are getting the same challenge.",
    "author": "Sarah K. Burris",
    "title": "Two more GOP ‘insurrectionists’ face ballot challenges as voters seek to disqualify them from office"
  },
  {
    "id": 7096,
    "mediaId": 2636,
    "date": "2022-04-07",
    "sentence": "In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives <span class='selected-term'>Paul Gosar</span> and Andy Biggs and State Representative Mark Finchem, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement.",
    "author": "",
    "title": "Legal Effort Expands to Disqualify Republicans as ‘Insurrectionists’"
  },
  {
    "id": 5652,
    "mediaId": 2636,
    "date": "2022-04-12",
    "sentence": "In the run-up to Jan. 6, Mr. Alexander publicly discussed a pressure campaign against lawmakers that was meant to stop the final electoral count, saying he was working with Representative Mo Brooks of Alabama and Representatives Andy Biggs and <span class='selected-term'>Paul Gosar</span> of Arizona, all Republicans.",
    "author": "",
    "title": "Before Riot, Operative Urged Trump Supporters to ‘Descend on the Capitol’ on Jan. 6"
  },
  {
    "id": 5557,
    "mediaId": 2629,
    "date": "2022-04-16",
    "sentence": "In a video made before the insurrection, Ali Alexander claimed that he and Reps. Mo Brooks, Andy Biggs, and <span class='selected-term'>Paul Gosar</span> “schemed up putting maximum pressure on Congress while they were voting.”\nThe video circulated on social media but was later deleted.",
    "author": "Lindsay Beyerstein",
    "title": "Former Stone Aide Confirms GOP Plot To Steal 2020 Election"
  },
  {
    "id": 5973,
    "mediaId": 2699,
    "date": "2022-04-22",
    "sentence": "“I do not remember” was Greene’s response to multiple questions about whether she spoke to government officials about the run-up to the Capitol attack, including election deniers Reps. Andy Biggs (R-AZ) and <span class='selected-term'>Paul Gosar</span> (R-AZ) and anyone in the White House.",
    "author": "Corbin Bolies",
    "title": "‘Oh No, Wait!’: Marjorie Taylor Greene’s Own Words Haunt Her"
  },
  {
    "id": 4798,
    "mediaId": 2754,
    "date": "2022-04-23",
    "sentence": "There are similar efforts to block members like Arizona GOP Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs from appearing on state ballots.",
    "author": "Tyler Durden",
    "title": "Destroying Democracy To Save It? Court Advances Effort To Block GOP Candidates From Ballots"
  },
  {
    "id": 4733,
    "mediaId": 2642,
    "date": "2022-04-24",
    "sentence": "A judge in Arizona has thrown out lawsuits that sought to disqualify Reps. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) and Andy Biggs (R-Ariz.) from serving in their current capacities in Congress.",
    "author": "WD Staff",
    "title": "AZ Judge Kicks Out Disqualification Complaints For Two GOP Representatives"
  }
]