[
  {
    "id": 4598,
    "mediaId": 6502,
    "date": "2022-01-06",
    "sentence": "Lawmakers including Georgia Rep. Marjorie Taylor Greene and Arizona Rep. <span class='selected-term'>Paul Gosar</span> have spoken out on the matter:\n.",
    "author": "Steve Watson",
    "title": "AP Declares Mistreatment Of Jan 6th Prisoners Is A 'Conspiracy Theory'"
  },
  {
    "id": 3725,
    "mediaId": 2512,
    "date": "2022-01-19",
    "sentence": "Trump’s recent rally in Arizona featured a who’s-who of unhinged conspiracy theorists, including MyPillow CEO Mike Lindell, Rep. <span class='selected-term'>Paul Gosar</span> and Arizona gubernatorial candidate Kari Lake.",
    "author": "Alex Henderson",
    "title": "How 'wacko' conspiracy extremists are driving the 'radicalization' of the Republican Party: conservatives"
  },
  {
    "id": 3662,
    "mediaId": 8475,
    "date": "2022-01-21",
    "sentence": "And Rep. <span class='selected-term'>Paul Gosar</span>, R-Prescott, had cast dozens of proxy votes by that time.",
    "author": "Emily Sacia",
    "title": "Capital COVID: Arizona state, federal lawmakers face different pandemic rules"
  },
  {
    "id": 3614,
    "mediaId": 2690,
    "date": "2022-01-22",
    "sentence": "Among the many speakers at President Trump’s Florence, AZ, rally were MyPillow CEO and fervent Trump supporter Mike Lindell, Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) and Arizona state lawmaker Wendy Rogers.",
    "author": "",
    "title": "Steve Bannon Drops Bombshell: Trump’s AZ Rally Is The Beginning Of 2020 Election ‘Decertification Process’"
  },
  {
    "id": 3812,
    "mediaId": 2729,
    "date": "2022-01-23",
    "sentence": "“That election was rotten to the core,” Congressman <span class='selected-term'>Paul Gosar</span> told the crowd.",
    "author": "Towleroad",
    "title": "Election fraud belief undimmed for Trump fans, despite party hopes"
  },
  {
    "id": 3695,
    "mediaId": 2584,
    "date": "2022-01-26",
    "sentence": "Once fringe, now dominant in the party, rightwing Republicans are strategizing for minoritarian rule\nThe Arizona Republican congressman <span class='selected-term'>Paul Gosar</span> had a simple message for the crowd when he recently addressed a packed Donald Trump rally in his home state – a gathering that had focused on promoting the baseless lie that Trump had been cheated out of a second term as president.",
    "author": "Sergio Olmos",
    "title": "‘The most dangerous man in Congress’: how Paul Gosar became a darling of the far right"
  },
  {
    "id": 3613,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 3619,
    "mediaId": 2512,
    "date": "2022-01-27",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> of Arizona speaking at the 2018 Arizona Manufacturing Summit, hosted by the Arizona Manufacturing Council and the Arizona Chamber of Commerce & Industry at the Renaissance Downtown Hotel in Phoenix, Gage Skidmore.",
    "author": "Meaghan Ellis",
    "title": "How Paul Gosar emerged as a far-right favorite and subsequently the 'most dangerous man in Congress’"
  },
  {
    "id": 3656,
    "mediaId": 2664,
    "date": "2022-01-27",
    "sentence": "(Biggs, along with fellow Arizona congressman, Rep. <span class='selected-term'>Paul Gosar</span>, and Rep. Mo Brooks (R-Ala.) worked with #StopTheSteal organizer Ali Alexander to pressure lawmakers to overturn the 2020 election results during the Jan. 6, 2021 joint session, according to a statement by Alexander in a now-deleted video).",
    "author": "Jordan Green",
    "title": "REVEALED: Trump-anointed Arizona candidate has questionable ties to the Bundys, the Oath Keepers and the controversial 'Constitutional Sheriffs'"
  },
  {
    "id": 1913,
    "mediaId": 2662,
    "date": "2022-02-04",
    "sentence": "— <span class='selected-term'>Paul Gosar</span> (@DrPaulGosar) February 4, 2022",
    "author": "Jordan Conradson",
    "title": "YES! Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “We Need To Sue The Federal Government For Failing To Protect Us” (VIDEO)"
  },
  {
    "id": 1839,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "— <span class='selected-term'>Paul Gosar</span> (@DrPaulGosar) February 4, 2022\nTRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nLake then called out Never-Trumper Bill Kristol, who appears to be barfing over these numbers.",
    "author": "Jordan Conradson",
    "title": "Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake Thrashes Turncoat RINO Bill Kristol Then Eats His Lunch"
  },
  {
    "id": 1818,
    "mediaId": 2662,
    "date": "2022-02-05",
    "sentence": "She also currently works for Republican Congressman <span class='selected-term'>Paul Gosar</span> of Arizona, helping to produce his ‘Gosar Minute’ segments.",
    "author": "Jordan Conradson",
    "title": "Radical Leftists Attack And Harass Congressman Paul Gosar’s Intern Faith Graham On Campus At American University — Car Vandalized MULTIPLE TIMES"
  },
  {
    "id": 1238,
    "mediaId": 2699,
    "date": "2022-02-16",
    "sentence": "Last year, U.S. Rep <span class='selected-term'>Paul Gosar</span> (R-AZ) delivered the event’s keynote address.",
    "author": "Kelly Weill",
    "title": "Arizona Politician Promotes Far-Right Event Featuring Hanukkah-Basher"
  },
  {
    "id": 1579,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "The 2021 America First Political Action Conference was addressed by Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ).",
    "author": "Bob Brigham",
    "title": "Arizona Republican hyping far-right event featuring notorious white nationalist: report"
  },
  {
    "id": 457,
    "mediaId": 8484,
    "date": "2022-02-20",
    "sentence": "+17\nView gallery\nRon Watkins, 35, who is running for Congress in Arizona, defended the messaging of the movement as mostly good but denied being Q\n+17\nView gallery\nSouth African tech journalist Paul Furber, 55, was identified as one of the earlier advocates of QAnon\n+17\nView gallery\nArizona Rep. <span class='selected-term'>Paul Gosar</span> met with Arizona congressional hopeful Ron Watkins, who was identified as one of the original authors of the QAnon movement, which he has denied\n'An accidental stylistic resemblance between Watkins and a still-to-be identified author seems quite unlikely,' said Florian Cafiero, a visiting scholar at Columbia University who co-authored the study with Jean-Baptiste Camps from the French École des Chartes.",
    "author": "",
    "title": "Forensic linguists say they now know the origin of the Q texts on the message board that began the QAnon movement"
  },
  {
    "id": 37,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "\"Arizona’s Rep. <span class='selected-term'>Paul Gosar</span> opened for Fuentes at last year’s AFPAC conference and has continued to root for the young white nationalist.",
    "author": "Bob Brigham",
    "title": "Arizona Republicans are flocking to attend white nationalist Nick Fuentes’ far-right conference: report"
  },
  {
    "id": 12748,
    "mediaId": 2520,
    "date": "2022-02-27",
    "sentence": "A pair of prominent Republicans broke the disturbing and rather deafening silence within the once-Grand Old Party over the weekend, calling out Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene for participating in a conference catering to white nationalists.",
    "author": "Laurie Roberts",
    "title": "Where Sen. Mitt Romney sees 'morons', Arizona Gov. Doug Ducey sees allies"
  },
  {
    "id": 12761,
    "mediaId": 2664,
    "date": "2022-02-27",
    "sentence": "Arizona Congressman <span class='selected-term'>Paul Gosar</span>, a Republican from Prescott, gave a brief video address, a far cry from last year, when he was the featured speaker.",
    "author": "Jim Small",
    "title": "Arizona Republican said white nationalists are ‘patriots’ and called for hanging political enemies"
  },
  {
    "id": 12838,
    "mediaId": 2528,
    "date": "2022-02-27",
    "sentence": "GOP Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona attended the third-annual America First Political Action Conference in Orlando, which was held Friday and organized by the far-right figure Nick Fuentes.",
    "author": "Connor Perrett",
    "title": "'Morons': Mitt Romney goes after Marjorie Taylor Greene and Paul Gosar for attending conference with white nationalist ties"
  },
  {
    "id": 12668,
    "mediaId": 2540,
    "date": "2022-02-27",
    "sentence": "The comment from Romney follows criticism from Wyoming Rep. Liz Cheney, a Republican, of Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona for speaking at the America First Political Action Conference that took place in Orlando, Florida and was organized by White nationalist Nick Fuentes.",
    "author": "Chandelis Duster",
    "title": "'I've got morons on my team': Romney blasts fellow GOP members for attending White nationalist event and supporting Putin"
  },
  {
    "id": 12815,
    "mediaId": 2520,
    "date": "2022-02-28",
    "sentence": "Senate lacks the votes to end early voting\nWhich matters not a hoot to the Republican Party because this isn’t really about “election integrity.” It isn’t about “restoring voter confidence” in elections that Ward, Senate President Karen Fann, Rep. <span class='selected-term'>Paul Gosar</span>, Sen. Wendy Rogers and other GOP leaders have sought at every turn to undermine.",
    "author": "Laurie Roberts",
    "title": "The Arizona Republican Party is so scared of you that it's suing to outlaw early voting"
  },
  {
    "id": 12890,
    "mediaId": 2540,
    "date": "2022-02-28",
    "sentence": "Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona received criticism for speaking at the America First Political Action Conference in Orlando, Florida.",
    "author": "Alexandra Meeks",
    "title": "5 things to know for Feb. 28: Ukraine, EPA, Covid-19, State of the Union, North Korea"
  },
  {
    "id": 17331,
    "mediaId": 8475,
    "date": "2022-02-28",
    "sentence": "Arizona Congressman <span class='selected-term'>Paul Gosar</span>, a Republican from Prescott, gave a brief video address, a far cry from last year, when he was the featured speaker.",
    "author": "Jim Small",
    "title": "Az's Wendy Rogers said white nationalists are 'patriots' & called for hanging political enemies"
  },
  {
    "id": 17014,
    "mediaId": 2822,
    "date": "2022-03-01",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span>, R-Prescott, said the exclusion of parts of Mohave County and Clark County, Nevada, was the result of an unintentional mistake.",
    "author": "Eryka Forquer Cronkite News",
    "title": "Some Arizona downwinders who blame illnesses on nuclear testing remain uncompensated"
  },
  {
    "id": 12924,
    "mediaId": 2621,
    "date": "2022-03-01",
    "sentence": "GOP Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene also spoke at his controversial conference over the weekend.",
    "author": "Alex Griffing",
    "title": "GOP-Controlled AZ Senate Censures Trump-Backed Republican Lawmaker Wendy Rogers"
  },
  {
    "id": 12958,
    "mediaId": 2643,
    "date": "2022-03-01",
    "sentence": "Rogers' censure follows rebukes by national Republican leaders against U.S. GOP Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona who also spoke at the conference.",
    "author": "Daniel Villarreal",
    "title": "GOP Senators Censure Colleague for Speaking at White Nationalist Conference"
  },
  {
    "id": 12757,
    "mediaId": 2621,
    "date": "2022-03-01",
    "sentence": "In addition to Rogers, who is expected to be censured by the Arizona State Senate, Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) appeared at AFPAC.",
    "author": "Jackson Richman",
    "title": "Arizona Republican Posted Anti-Semitic Photoshop Before Speaking at White Nationalist Event"
  },
  {
    "id": 12491,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "Besides Rogers, other Republicans such as Congressman <span class='selected-term'>Paul Gosar</span> of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "author": "David Neiwert",
    "title": "White nationalists flaunt their traction within Republican Party at annual gathering in Florida"
  },
  {
    "id": 12469,
    "mediaId": 2572,
    "date": "2022-03-02",
    "sentence": "The three no votes were Republican Reps. Thomas Massie of Kentucky, Matt Rosendale of Montana and <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Marisa Schultz",
    "title": "House passes resolution in support of Ukraine amid 'full-scale' Russian invasion"
  },
  {
    "id": 12499,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "While Lake did not respond to questions about Rogers, she has not distanced herself from Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who spoke at the same Nick Fuentes' white nationalist America First Political Action Conference in Florida.",
    "author": "Bob Brigham",
    "title": "Censured Republican is so toxic she’s become an issue in Arizona governor’s race: report"
  },
  {
    "id": 12708,
    "mediaId": 2547,
    "date": "2022-03-02",
    "sentence": "Besides Rogers, other Republicans such as Congressman <span class='selected-term'>Paul Gosar</span> of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "author": "David Neiwert",
    "title": "Neo-Nazi Nick Fuentes Is Gloating About Taking Over The GOP"
  },
  {
    "id": 12615,
    "mediaId": 6656,
    "date": "2022-03-02",
    "sentence": "Out of 429 voting members, three lawmakers -- all Republicans -- voted against affirming the resolution on Wednesday: Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana.",
    "author": "Calley Hair",
    "title": "U.S. House passes resolution declaring support for Ukraine"
  },
  {
    "id": 13338,
    "mediaId": 5308,
    "date": "2022-03-02",
    "sentence": "In addition to Rogers, two current members of Congress, Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, spoke at the conference.",
    "author": "Paul Blest",
    "title": "Republicans Have Finally Had Enough of Wendy Rogers"
  },
  {
    "id": 17198,
    "mediaId": 8475,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span>, R-Prescott, said the exclusion of parts of Mohave County and Clark County, Nevada, was the result of an unintentional mistake.",
    "author": "Eryka Forquer",
    "title": "Some Arizona downwinders who blame illnesses on nuclear testing remain uncompensated"
  },
  {
    "id": 12886,
    "mediaId": 2584,
    "date": "2022-03-03",
    "sentence": "I am proud to support the US bids to host the men’s and women’s Rugby World Cup tournaments.”\nSean Casten, an Illinois Democrat, and two Republicans, Richard Hudson from North Carolina and <span class='selected-term'>Paul Gosar</span> from Arizona, also co-sponsored the measure.",
    "author": "Martin Pengelly",
    "title": "USA Rugby World Cup bid attracts bipartisan support in Congress"
  },
  {
    "id": 12944,
    "mediaId": 8387,
    "date": "2022-03-03",
    "sentence": "A guy, by the way, who Rep. <span class='selected-term'>Paul Gosar</span> calls a friend.",
    "author": "Laurie Roberts",
    "title": "Matt Salmon blasts Wendy Rogers as unfit to serve. Where you been, Matt?"
  },
  {
    "id": 12752,
    "mediaId": 2520,
    "date": "2022-03-04",
    "sentence": "",
    "author": "Melissa Estrada",
    "title": "Here are the candidates running in Arizona's new 3rd Congressional District"
  },
  {
    "id": 12947,
    "mediaId": 2664,
    "date": "2022-03-05",
    "sentence": "Also in attendance was Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who received widespread condemnation for attending a white nationalist conference the previous weekend.",
    "author": "Bob Brigham",
    "title": "WATCH: Mike Lindell sells a GOP candidate — and his pillows — at Arizona rodeo"
  },
  {
    "id": 15397,
    "mediaId": 8345,
    "date": "2022-03-07",
    "sentence": "WASHINGTON - Republican leaders in Congress are torn over what to do with Rep. Marjorie Taylor Greene after the congresswoman spoke at a an event last month organized by a white nationalist who marveled over Russia’s invasion of Ukraine as the crowd erupted in chants of “Putin!” Rep. <span class='selected-term'>Paul Gosar</span> (R-Arizona), who represents the Kingman area, spoke to the group by video.",
    "author": "Associated Press",
    "title": "GOP torn as Green, Gosar speak to far right group"
  },
  {
    "id": 15329,
    "mediaId": 8475,
    "date": "2022-03-07",
    "sentence": "Speakers at the event included the founder and CEO of MyPillow, Mike Lindell and the controversial GOP Representative <span class='selected-term'>Paul Gosar</span>, who's tied to the alleged white nationalist and anti-Semite Nick Fuentes of the \"America First\" podcast and political action conference.",
    "author": "Michael McDaniel",
    "title": "Az gov candidate Kari Lake holds Trump-inspired rally with Mike Lindell & Rep. Paul Gosar"
  },
  {
    "id": 11045,
    "mediaId": 2746,
    "date": "2022-03-07",
    "sentence": "Mr. Ryder told The Associated Press that the tweet was a reaction to Mr. Johnson’s November 2021 House vote against censuring fellow Republican Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Kerry Picket",
    "title": "Offensive tweets force South Dakota Democrat out of House race after one day"
  },
  {
    "id": 11566,
    "mediaId": 2689,
    "date": "2022-03-08",
    "sentence": "“The first offending tweet was one he issued in November 2021, during the fallout over a video that Republican Rep. <span class='selected-term'>Paul Gosar</span> of Arizona had tweeted out which portrayed him ‘killing’ Democratic Congresswoman and socialist darling Alexandria Ocasio-Cortez of New York and attacking President Joe Biden (whose faces were superimposed on anime characters),” the report continued.",
    "author": "",
    "title": "Dem Blows Up His Campaign Just 1 Day After Announcing Over Sexual Tweet"
  },
  {
    "id": 11556,
    "mediaId": 2607,
    "date": "2022-03-09",
    "sentence": "House Republican leader Kevin McCarthy waited days before castigating Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona — who once sought to create a whites-only congressional caucus — for speaking to a white supremacist gathering in Florida.",
    "author": "Mark Barabak",
    "title": "Dealing with extremists, some GOP leaders find sorry is the hardest word"
  },
  {
    "id": 11076,
    "mediaId": 2740,
    "date": "2022-03-09",
    "sentence": "The report outlines how right-wing figures like Fox News personality Tucker Carlson and elected officials like U.S. Rep. Matt Gaetz, R-Fla., have promoted white supremacist conspiracy theories like the \"great replacement\" myth, while others – including former President Donald Trump and Republican U.S. Reps. <span class='selected-term'>Paul Gosar</span> of Arizona and Madison Cawthorn of North Carolina – have normalized threats and the use of violence as a political tool.",
    "author": "N'dea Yancey-Bragg",
    "title": "Hate groups declined in 2021, but fringe ideology is a 'powerful force' shaping US politics, SPLC warns"
  },
  {
    "id": 15354,
    "mediaId": 8475,
    "date": "2022-03-10",
    "sentence": "A newly released report by the Southern Poverty Law Center details extremism in 2021 — and how elected officials like U.S. Rep. <span class='selected-term'>Paul Gosar</span> helped white nationalists and hate groups move their views into the mainstream.",
    "author": "Jerod MacDonald-Evoy",
    "title": "White nationalism began to take a foothold in mainstream in 2021, and Arizona helped"
  },
  {
    "id": 10714,
    "mediaId": 2664,
    "date": "2022-03-10",
    "sentence": "A newly released report by the Southern Poverty Law Center details extremism in 2021 — and how elected officials like U.S. Rep. <span class='selected-term'>Paul Gosar</span> helped white nationalists and hate groups move their views into the mainstream.",
    "author": "",
    "title": "White nationalism began to take a foothold in the mainstream in 2021 -- and Arizona helped"
  },
  {
    "id": 10918,
    "mediaId": 8439,
    "date": "2022-03-12",
    "sentence": "The report outlines how right-wing figures like Fox News personality Tucker Carlson and elected officials like U.S. Rep. Matt Gaetz, R-Fla., have promoted white supremacist conspiracy theories like the \"great replacement\" myth, while others – including former President Donald Trump and Republican U.S. Reps. <span class='selected-term'>Paul Gosar</span> of Arizona and Madison Cawthorn of North Carolina – have normalized threats and the use of violence as a political tool.",
    "author": "N'dea Yancey-Bragg",
    "title": "Hate groups declined in 2021, but fringe ideology is a 'powerful force' shaping US politics, SPLC warns"
  },
  {
    "id": 11516,
    "mediaId": 2911,
    "date": "2022-03-14",
    "sentence": "The Senate has also censured nine of its own members, and in 2021, the U.S. House of Representatives censured its 24th member, Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, for, among other things, posting an anime video of himself killing a fellow member.",
    "author": "Seth Masket",
    "title": "How An Uptick In Censures Among Local Republicans Signals A Growing Radicalism"
  },
  {
    "id": 11179,
    "mediaId": 2676,
    "date": "2022-03-16",
    "sentence": "Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> or Arizona will not be punished for their participation in a white nationalist conference, according to House Republican leader Kevin McCarthy.",
    "author": "Madeleine Beck",
    "title": "Kevin McCarthy quietly gets away with holding Republicans to a lower standard than Donald Trump"
  },
  {
    "id": 9773,
    "mediaId": 2548,
    "date": "2022-03-22",
    "sentence": "An image shared on Instagram purportedly shows a tweet from Republican Arizona Rep. <span class='selected-term'>Paul Gosar</span> about being called a “moron.”\nVerdict: False\nThe tweet has been digitally fabricated.",
    "author": "",
    "title": "FACT CHECK: Did Paul Gosar Send This Tweet About Being Called A ‘Moron’?"
  },
  {
    "id": 8985,
    "mediaId": 3997,
    "date": "2022-03-22",
    "sentence": "An image shared on Instagram purportedly shows a tweet from Republican Arizona Rep. <span class='selected-term'>Paul Gosar</span> about being called a “moron.”\nVerdict: False\nThe tweet has been digitally fabricated.",
    "author": "Hannah Hudnall",
    "title": "FACT CHECK: Did Paul Gosar Send This Tweet About Being Called A ‘Moron’?"
  },
  {
    "id": 9058,
    "mediaId": 2512,
    "date": "2022-03-24",
    "sentence": "If the 2022 midterms see a major red wave, even the most extreme MAGA Republicans are likely to be reelected to the U.S. House of Representatives — including Rep. Marjorie Taylor Greene of Georgia, Rep. Lauren Boebert of Colorado, Rep. Matt Gaetz of Florida and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Alex Henderson",
    "title": "How Madison Cawthorn may have doomed his reelection campaign"
  },
  {
    "id": 9262,
    "mediaId": 2540,
    "date": "2022-03-24",
    "sentence": "That includes Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, who both recently addressed a conference organized by a known white nationalist, though McCarthy condemned their appearances at the event and said he spoke to Greene privately about it.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'"
  },
  {
    "id": 7512,
    "mediaId": 2676,
    "date": "2022-04-04",
    "sentence": "After weeks of avoiding the subject, Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz., is now blaming his own staff over his appearance at a white nationalist conference, claiming that \"there was a miscommunication.\"",
    "author": "Jon Skolnik",
    "title": "Paul Gosar blames staff for his appearance at white nationalist conference for the second year"
  },
  {
    "id": 7069,
    "mediaId": 2512,
    "date": "2022-04-05",
    "sentence": "After weeks of avoiding the subject, Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz., is now blaming his own staff over his appearance at a white nationalist conference, claiming that \"there was a miscommunication.\"",
    "author": "Jon Skolnik",
    "title": "Paul Gosar blames staff for his appearance at white nationalist conference after attending same event last year"
  },
  {
    "id": 7096,
    "mediaId": 2636,
    "date": "2022-04-07",
    "sentence": "In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives <span class='selected-term'>Paul Gosar</span> and Andy Biggs and State Representative Mark Finchem, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement.",
    "author": "",
    "title": "Legal Effort Expands to Disqualify Republicans as ‘Insurrectionists’"
  },
  {
    "id": 7533,
    "mediaId": 2741,
    "date": "2022-04-07",
    "sentence": "Arizona conservative representative <span class='selected-term'>Paul Gosar</span> is once again attempting to brush off ties to far-right organizations.",
    "author": "Caleb Ecarma",
    "title": "Déjà Vu: House Republican Paul Gosar Was Tied to Yet Another Far-Right Event"
  },
  {
    "id": 7358,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Now Reps. Andy Biggs (R-AZ) and <span class='selected-term'>Paul Gosar</span> (R-AZ) are getting the same challenge.",
    "author": "Sarah K. Burris",
    "title": "Two more GOP ‘insurrectionists’ face ballot challenges as voters seek to disqualify them from office"
  },
  {
    "id": 8549,
    "mediaId": 8345,
    "date": "2022-04-07",
    "sentence": "",
    "author": "",
    "title": "Gosar moves to Mohave County"
  },
  {
    "id": 8863,
    "mediaId": 8347,
    "date": "2022-04-08",
    "sentence": "LAKE HAVASU CITY, Ariz. (AP) — Republican U.S. Rep. <span class='selected-term'>Paul Gosar</span> says he now lives in Mohave County, putting his residence in Arizona’s newly redrawn 9th Congressional District as he runs for a seventh term.",
    "author": "Associated Press",
    "title": "Rep. Gosar shifts residence to Mohave County in new district"
  },
  {
    "id": 5319,
    "mediaId": 2550,
    "date": "2022-04-09",
    "sentence": "Arizona Rep. <span class='selected-term'>Paul Gosar</span>, whom God created to conclusively disprove white supremacy, is trying to explain away his video appearance at shrieking anti-Semite Nick Fuentes’ white power-palooza carnival in February, and that explanation is just as craven as you might imagine.",
    "author": "",
    "title": "Paul Gosar explains yet another appearance at a white nationalist conference by blaming his staff"
  },
  {
    "id": 4733,
    "mediaId": 2642,
    "date": "2022-04-24",
    "sentence": "A judge in Arizona has thrown out lawsuits that sought to disqualify Reps. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) and Andy Biggs (R-Ariz.) from serving in their current capacities in Congress.",
    "author": "WD Staff",
    "title": "AZ Judge Kicks Out Disqualification Complaints For Two GOP Representatives"
  }
]