[
  {
    "id": 4578,
    "mediaId": 2810,
    "date": "2022-01-05",
    "sentence": "Those Republican representatives who the planners allege personally engaged with them directly, or did so via assigned staffers, include Marjorie Taylor Greene of Georgia, <span class='selected-term'>Paul Gosar</span> of Arizona, Lauren Boebert of Colorado, Mo Brooks of Alabama, Madison Cawthorn of North Carolina, Andy Biggs of Arizona, and Louie Gohmert of Texas.",
    "author": "John Nichols",
    "title": "To Avert Another January 6, Expel Coup Plotters From Congress"
  },
  {
    "id": 2997,
    "mediaId": 2553,
    "date": "2022-02-01",
    "sentence": "The Daily Wire reported:\nMcCarthy made the remarks in an interview with Breitbart News and said that the move comes in light of to Democrats kicking two Republicans — Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) — off their committees.",
    "author": "Dillon Burroughs",
    "title": "Squad Member Ilhan Omar Makes Her Decision Regarding 2022 Run"
  },
  {
    "id": 2419,
    "mediaId": 2553,
    "date": "2022-02-09",
    "sentence": "After teaming up with 5% of elected Republican congressmen to strip Greene of her assignments, Democrats won only two Republican votes while successfully stripping Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) of his after he made a string of controversial speeches and starred in a bizarre anime video.",
    "author": "Ben Johnson",
    "title": "3 Ways Democrats Are Trying To Overturn Elections"
  },
  {
    "id": 10785,
    "mediaId": 2557,
    "date": "2022-03-10",
    "sentence": "Ilhan Omar (Minn.)\nRepublicans:\nAndy Biggs (Ariz.)\nMarjorie Taylor Greene (Ga.)\nLouie Gohmert (Texas)\nDan Bishop (N.C.)\nGlenn Grothman (Wis.)\nLauren Boebert (Colo.)\nTom Tiffany (Wis.)\nMatt Gaetz (Fla.)\n<span class='selected-term'>Paul Gosar</span> (Ariz.)\nClay Higgins (La.)",
    "author": "DML News App",
    "title": "REPORT: The 17 lawmakers who voted against the Russian oil ban"
  }
]