[
  {
    "id": 4578,
    "mediaId": 2810,
    "date": "2022-01-05",
    "sentence": "Those Republican representatives who the planners allege personally engaged with them directly, or did so via assigned staffers, include Marjorie Taylor Greene of Georgia, <span class='selected-term'>Paul Gosar</span> of Arizona, Lauren Boebert of Colorado, Mo Brooks of Alabama, Madison Cawthorn of North Carolina, Andy Biggs of Arizona, and Louie Gohmert of Texas.",
    "author": "John Nichols",
    "title": "To Avert Another January 6, Expel Coup Plotters From Congress"
  },
  {
    "id": 2837,
    "mediaId": 2550,
    "date": "2022-02-02",
    "sentence": "Unfortunately, we are living in desperate times and the only way that Cheney and Kinzinger can survive is to do the right thing and bring criminal charges to light about the complicity and the possible conspiracy by Republicans like Ted Cruz, Josh Hawley, Louie Gohmert, Mo Brooks, Marjorie Taylor Greene, Lauren Boebert, Matt Gaetz, <span class='selected-term'>Paul Gosar</span>, and others, to overturn our democratically elected 46th President.",
    "author": "",
    "title": "Rep. Adam Kinzinger brings a bazooka to Josh Hawley's knife fight"
  },
  {
    "id": 1880,
    "mediaId": 2664,
    "date": "2022-02-04",
    "sentence": "\"Nor was there even the slightest suggestion that perhaps the party should distance itself from the bizarre bigoted rantings of [Marjorie Taylor Greene] (R-GA), or <span class='selected-term'>Paul Gosar</span> (R-AZ), or Lauren Boebert (R-CO), or Madison Cawthorn (R-NC),\" he wrote.",
    "author": "Bob Brigham",
    "title": "RNC has ‘gone all-in on the insurrection’ while excusing ‘bigoted rantings’: Charlie Sykes"
  },
  {
    "id": 1926,
    "mediaId": 2550,
    "date": "2022-02-07",
    "sentence": "A big part of this play is that Kinzinger, along with neo-conservatives like Rep. Liz Cheney, are battling to regain control over a political party now inundated with more flagrantly corrupt, more flagrantly authoritarian, and more flagrantly incompetent officials like Sen. Josh Hawley and Reps. Madison Cawthorn, Lauren Boebert, and <span class='selected-term'>Paul Gosar</span> ascending to prominence.",
    "author": "",
    "title": "Adam Kinzinger has a lot to say: Donald Trump ‘is the worst president the U.S. ever had’"
  },
  {
    "id": 2297,
    "mediaId": 2699,
    "date": "2022-02-09",
    "sentence": "Those are the acceptable sins, respectively, of Reps. Marjorie Taylor Greene, Lauren Boebart, Matt Gaetz, and <span class='selected-term'>Paul Gosar</span>.",
    "author": "Wajahat Ali",
    "title": "Sorry, Mitch McConnell. Frankenstein’s Monster Runs the GOP Now"
  },
  {
    "id": 271,
    "mediaId": 2521,
    "date": "2022-02-26",
    "sentence": "Cheney commented that as “Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Caleb Newton",
    "title": "Kinzinger Hits Marjorie Greene For Headlining White Supremacist Event"
  },
  {
    "id": 489,
    "mediaId": 2643,
    "date": "2022-02-26",
    "sentence": "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\n\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" the Wyoming congresswoman wrote in a Twitter post, including a video of Fuentes' remarks.",
    "author": "Jason Lemon",
    "title": "Cheney Rips GOP Silence Over Greene, Gosar Joining 'White Supremacist' Event"
  },
  {
    "id": 13208,
    "mediaId": 2830,
    "date": "2022-02-27",
    "sentence": "In a tweet Saturday, Rep. Liz Cheney, who has faced intraparty censure in her home state of Wyoming over her criticism of former President Donald Trump, blasted their speaking appearance: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Mike Murphy",
    "title": "‘Morons’: Romney, Cheney, Kinzinger condemn fellow Republicans for speaking at white nationalist event"
  },
  {
    "id": 13224,
    "mediaId": 2629,
    "date": "2022-02-27",
    "sentence": "All Americans should renounce this garbage and reject the Putin wing of the GOP now.”\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Meaghan Ellis",
    "title": "Outrage Over Rep. Greene's Speech To White Nationalist 'America First' Event"
  },
  {
    "id": 13033,
    "mediaId": 2614,
    "date": "2022-02-27",
    "sentence": "Yesterday, Cheney tweeted “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist , anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Objectivist Staff",
    "title": "Mitt Romney Bashes “Pro-Russian” Republicans on CNN; “Almost Treasonous”"
  },
  {
    "id": 12995,
    "mediaId": 6598,
    "date": "2022-02-27",
    "sentence": "Sen. Mitt Romney on Sunday likened Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene to \"morons\" and said they were \"missing a few IQ points\" after their participation in a political event led by a white nationalist.",
    "author": "Ronald J. Hansen",
    "title": "'I've got morons on my team': Sen. Mitt Romney hits Reps. Paul Gosar, Marjorie Taylor Greene"
  },
  {
    "id": 12968,
    "mediaId": 2547,
    "date": "2022-02-27",
    "sentence": "CNN host Dana Bash asked Romney about a tweet by Liz Cheney, where she slammed Republican leadership for their silence on the matter:\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Heather",
    "title": "Mitt Romney: 'I Have Morons On My Team!'"
  },
  {
    "id": 12658,
    "mediaId": 2594,
    "date": "2022-02-27",
    "sentence": "Another Republican who herself has faced censure by the national Republican Party for her participation in the January 6 investigation, Liz Cheney, also aimed fire at Ms Greene: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "John Bowden",
    "title": "Romney calls Marjorie Taylor Greene a ‘moron’ as moderates demand party ditch ‘Putin wing of GOP’"
  },
  {
    "id": 12563,
    "mediaId": 2664,
    "date": "2022-02-27",
    "sentence": "Asked by host Bash about Taylor Greene's appearance at the racist get-together in Orlando along with Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) the Utah Republican didn't mince words when host Bash quoted a statement made by Rep. Liz Cheney (R-WY) that attacked the Georgia lawmaker.",
    "author": "Tom Boggioni",
    "title": "'I have morons on my team': Mitt Romney questions Marjorie Taylor Greene's 'IQ' in brutal CNN rant"
  },
  {
    "id": 12748,
    "mediaId": 2520,
    "date": "2022-02-27",
    "sentence": "A pair of prominent Republicans broke the disturbing and rather deafening silence within the once-Grand Old Party over the weekend, calling out Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene for participating in a conference catering to white nationalists.",
    "author": "Laurie Roberts",
    "title": "Where Sen. Mitt Romney sees 'morons', Arizona Gov. Doug Ducey sees allies"
  },
  {
    "id": 12796,
    "mediaId": 2583,
    "date": "2022-02-27",
    "sentence": "And Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, I don't know them, but I'm reminded of that old line from the 'Butch Cassidy and the Sundance Kid' movie, where one character says, 'Morons, I have got morons on my team.'",
    "author": "",
    "title": "Romney Rips Taylor Greene, Gosar’s Appearance on White Nationalist Conference: ‘I’ve Got Morons on My Team’"
  },
  {
    "id": 12616,
    "mediaId": 2551,
    "date": "2022-02-28",
    "sentence": "Republican Sen. Mitt Romney slammed both Greene and Republican Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, who sent pre-taped remarks to the conference.",
    "author": "Emily Goodin",
    "title": "'Have you lost all sense of decency?' Liz Cheney shames Kevin McCarthy for not chastising Marjorie Taylor Greene for speaking at white nationalist event"
  },
  {
    "id": 12495,
    "mediaId": 2550,
    "date": "2022-02-28",
    "sentence": "x\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "",
    "title": "Abbreviated Pundit Roundup: This is the dangerous part (Putin losing)"
  },
  {
    "id": 12487,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "On one side you have the Trump/MAGA/tea party wing of the GOP, filled with detestable folks like Reps. Lauren Boebert, Matt Gaetz, Madison Cawthorn, <span class='selected-term'>Paul Gosar</span>, and Marjorie Taylor Greene.",
    "author": "",
    "title": "War in the GOP: Have Marjorie Taylor Greene and Paul Gosar made one too many mistakes?"
  },
  {
    "id": 12867,
    "mediaId": 2590,
    "date": "2022-03-01",
    "sentence": "McCarthy on Monday called the America First Political Action Conference “appalling” and said “there’s no place in our party for any of this,” but on Tuesday he declined to say whether House Republicans would sanction Rep. Marjorie Taylor Greene (R-Ga.) or Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) for participating, though he said he would have a talk with them.",
    "author": "Igor Bobic",
    "title": "Kevin McCarthy Dodges On Punishing Members Over White Nationalist Conference"
  },
  {
    "id": 13225,
    "mediaId": 2748,
    "date": "2022-03-01",
    "sentence": "\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Cheney said in a tweet.",
    "author": "Blarp Blog",
    "title": "Romney on Greene, Gosar: 'I have morons on my team'"
  },
  {
    "id": 12735,
    "mediaId": 2512,
    "date": "2022-03-02",
    "sentence": "#idpolpic.twitter.com/G3OzspSvik\n— Janice McGeachin (@Janice McGeachin) 1645910035\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Alex Henderson",
    "title": "Idaho newspaper editorial slams state lieutenant governor for embracing the GOP’s 'Putin wing'"
  },
  {
    "id": 11516,
    "mediaId": 2911,
    "date": "2022-03-14",
    "sentence": "The Senate has also censured nine of its own members, and in 2021, the U.S. House of Representatives censured its 24th member, Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, for, among other things, posting an anime video of himself killing a fellow member.",
    "author": "Seth Masket",
    "title": "How An Uptick In Censures Among Local Republicans Signals A Growing Radicalism"
  },
  {
    "id": 9058,
    "mediaId": 2512,
    "date": "2022-03-24",
    "sentence": "If the 2022 midterms see a major red wave, even the most extreme MAGA Republicans are likely to be reelected to the U.S. House of Representatives — including Rep. Marjorie Taylor Greene of Georgia, Rep. Lauren Boebert of Colorado, Rep. Matt Gaetz of Florida and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Alex Henderson",
    "title": "How Madison Cawthorn may have doomed his reelection campaign"
  },
  {
    "id": 9262,
    "mediaId": 2540,
    "date": "2022-03-24",
    "sentence": "That includes Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, who both recently addressed a conference organized by a known white nationalist, though McCarthy condemned their appearances at the event and said he spoke to Greene privately about it.",
    "author": "Melanie Zanona",
    "title": "McCarthy calls endorsement of Cheney's primary foe a 'special case'"
  },
  {
    "id": 9226,
    "mediaId": 8484,
    "date": "2022-03-24",
    "sentence": "+6\nView gallery\nA spokesperson for Republican Rep. Liz Cheney slammed the House's GOP Leader Kevin McCarthy for endorsing Cheney's primary challenger instead of condemning the right-wing members of his party\n+6\nView gallery\nCheney shared Adler's statement in a tweet and linked it to the CNN story it appeared in that called McCarthy's endorsement of Harriet Hageman, Cheney's Trump-backed GOP challenger, a 'special case'\nThe story notes that McCarthy has backed only one primary challenger ahead of the 2022 midterms - that of Cheney's - and not anyone trying to take out controversial Republican members including Reps. Marjorie Taylor Greene or <span class='selected-term'>Paul Gosar</span>.",
    "author": "Nikki Schwab",
    "title": "Cheney knocks McCarthy for backing her rival but not those of 'pro-Putin' lawmakers"
  },
  {
    "id": 9051,
    "mediaId": 2522,
    "date": "2022-03-25",
    "sentence": "He has also thrown his political weight behind Reps. Marjorie Taylor Greene, Madison Cawthorn, and <span class='selected-term'>Paul Gosar</span>, who are very popular in the Republican Party, not so much in Democratic circles.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Girl, you mad? Cheney blasts McCarthy for not rejecting MAGA candidates, and ultimate snub"
  },
  {
    "id": 5796,
    "mediaId": 2636,
    "date": "2022-04-10",
    "sentence": "",
    "author": "",
    "title": "Jan. 6 Panel Has Evidence for Criminal Referral of Trump, but Splits on Sending"
  },
  {
    "id": 5434,
    "mediaId": 2662,
    "date": "2022-04-16",
    "sentence": "Representatives Madison Cawthorn of North Carolina, Marjorie Taylor Greene of Georgia, and, as of last week, Andy Biggs and <span class='selected-term'>Paul Gosar</span> from Arizona, from running for re-election.",
    "author": "Joe Hoft",
    "title": "Barbara Boyd: It Looks Like the War Will Come Home for the Midterms"
  },
  {
    "id": 5484,
    "mediaId": 2746,
    "date": "2022-04-22",
    "sentence": "“I believe Leader McCarthy over the New York Times every time,” said Rep. <span class='selected-term'>Paul Gosar</span>, Arizona Republican.",
    "author": "Seth McLaughlin",
    "title": "Kevin McCarthy’s speaker aspirations face fresh doubts after leaked audio"
  }
]