[
  {
    "id": 4534,
    "mediaId": 2690,
    "date": "2022-01-12",
    "sentence": "pic.twitter.com/x3neLZ5pnF\n— Justice For Ashli Babbitt (@ForAshli) August 23, 2021\nEXCLUSIVE: Mother of Ashli Babbitt tells National File \"My daughter died for this cause… I'm here to be my daughter's voice because it has been silenced\" before Rep. <span class='selected-term'>Paul Gosar</span> invited her out today.",
    "author": "",
    "title": "BREAKING REPORT: Cop Who Killed Ashli Babbitt In Cold Blood Cleared Without Interview"
  },
  {
    "id": 4332,
    "mediaId": 8258,
    "date": "2022-01-22",
    "sentence": "Reps. Ralph Norman, R-S.C., <span class='selected-term'>Paul Gosar</span>, R-Ariz., and Matt Gaetz, R-Fla, are all bill co-sponsors.",
    "author": "AFF NEWSWIRE- CHLOE",
    "title": "BREAKING NEWS From Marjorie Taylor-Greene… It’s MASSIVE"
  },
  {
    "id": 3817,
    "mediaId": 2547,
    "date": "2022-01-22",
    "sentence": "Rising to his defense was Congressman <span class='selected-term'>Paul Gosar</span> of Arizona, one of the Republicans with his own deep connections to the Jan. 6 insurrection, who demanded that federal authorities explain Fuentes’ supposed ban.",
    "author": "David Neiwert",
    "title": "Jan 6 Committee Subpoenas White Nationalist Nicholas Fuentes"
  },
  {
    "id": 9057,
    "mediaId": 2551,
    "date": "2022-03-29",
    "sentence": "The effort is also backed by Reps. Andy Biggs (R-Ariz.), Dan Bishop (R-N.C.), Louie Gohmert (R-Texas), <span class='selected-term'>Paul Gosar</span> (R-Ariz.), Marjorie Taylor Greene (R-Ga.) and Thomas Massie (R-Ky.).",
    "author": "Elizabeth Elkind",
    "title": "GOP Rep. Matt Gaetz presses FBI's cyber chief on the whereabouts of Hunter Biden's laptop"
  },
  {
    "id": 7449,
    "mediaId": 2833,
    "date": "2022-04-05",
    "sentence": "The effort is also backed by Reps. Andy Biggs (R-Ariz.), Dan Bishop (R-N.C.), Louie Gohmert (R-Texas), <span class='selected-term'>Paul Gosar</span> (R-Ariz.), Marjorie Taylor Greene (R-Ga.) and Thomas Massie (R-Ky.).",
    "author": "Baxter Dmitry",
    "title": "Gaetz Pushes To Strip Security Clearance From FBI Agents Who ‘Lost’ Hunter Biden’s Laptop"
  },
  {
    "id": 7105,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Greene recently escaped meaningful rebuke from Republican leaders when she and Rep. <span class='selected-term'>Paul Gosar</span> spoke at a white nationalist event.",
    "author": "Laura Clawson",
    "title": "Jimmy Kimmel claps back after Marjorie Taylor Greene says she reported his joke to the police"
  }
]