[
  {
    "id": 2297,
    "mediaId": 2699,
    "date": "2022-02-09",
    "sentence": "Those are the acceptable sins, respectively, of Reps. Marjorie Taylor Greene, Lauren Boebart, Matt Gaetz, and <span class='selected-term'>Paul Gosar</span>.",
    "author": "Wajahat Ali",
    "title": "Sorry, Mitch McConnell. Frankenstein’s Monster Runs the GOP Now"
  },
  {
    "id": 2393,
    "mediaId": 2699,
    "date": "2022-02-09",
    "sentence": "Nine other candidates are in the race, but the only one with significant resources is another veteran, Jonathan Hullihan, who touts the backing of far-right Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ).",
    "author": "Sam Brodey",
    "title": "The Drama in This Crazy Texas Primary Explains Trump’s GOP"
  },
  {
    "id": 12748,
    "mediaId": 2520,
    "date": "2022-02-27",
    "sentence": "A pair of prominent Republicans broke the disturbing and rather deafening silence within the once-Grand Old Party over the weekend, calling out Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene for participating in a conference catering to white nationalists.",
    "author": "Laurie Roberts",
    "title": "Where Sen. Mitt Romney sees 'morons', Arizona Gov. Doug Ducey sees allies"
  },
  {
    "id": 12809,
    "mediaId": 2590,
    "date": "2022-02-27",
    "sentence": "It’s, as you’ve indicated, speaking of evil, it’s evil as well,” Romney told CNN’s Dana Bash on “State of the Union.”\nAdvertisement\nHe went on to call out Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) for speaking at the third annual America First Political Action Conference, which was organized by white nationalist figurehead Nick Fuentes in Orlando, Florida.",
    "author": "Nina Golgowski",
    "title": "Sen. Mitt Romney Slams GOP 'Morons' At 'Evil' White Nationalist Conference"
  },
  {
    "id": 12811,
    "mediaId": 2746,
    "date": "2022-02-27",
    "sentence": "“Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, I don’t know them,” Mr. Romney, Utah Republican, told CNN’s “State of the Union.” “I’m reminded of the old line from the Butch Cassidy and Sundance Kid movie, where one character says, ‘Morons, I have morons on my team.’”\n“I would think that anybody that would sit down with a white nationalist and speak at their conference would certainly be missing a few IQ points,” he said.",
    "author": "Tom Howell Jr.",
    "title": "Sen. Mitt Romney rips ‘morons’ in GOP after lawmakers address White nationalist conference"
  },
  {
    "id": 12838,
    "mediaId": 2528,
    "date": "2022-02-27",
    "sentence": "GOP Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona attended the third-annual America First Political Action Conference in Orlando, which was held Friday and organized by the far-right figure Nick Fuentes.",
    "author": "Connor Perrett",
    "title": "'Morons': Mitt Romney goes after Marjorie Taylor Greene and Paul Gosar for attending conference with white nationalist ties"
  },
  {
    "id": 12796,
    "mediaId": 2583,
    "date": "2022-02-27",
    "sentence": "And Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, I don't know them, but I'm reminded of that old line from the 'Butch Cassidy and the Sundance Kid' movie, where one character says, 'Morons, I have got morons on my team.'",
    "author": "",
    "title": "Romney Rips Taylor Greene, Gosar’s Appearance on White Nationalist Conference: ‘I’ve Got Morons on My Team’"
  },
  {
    "id": 12563,
    "mediaId": 2664,
    "date": "2022-02-27",
    "sentence": "Asked by host Bash about Taylor Greene's appearance at the racist get-together in Orlando along with Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) the Utah Republican didn't mince words when host Bash quoted a statement made by Rep. Liz Cheney (R-WY) that attacked the Georgia lawmaker.",
    "author": "Tom Boggioni",
    "title": "'I have morons on my team': Mitt Romney questions Marjorie Taylor Greene's 'IQ' in brutal CNN rant"
  },
  {
    "id": 12668,
    "mediaId": 2540,
    "date": "2022-02-27",
    "sentence": "The comment from Romney follows criticism from Wyoming Rep. Liz Cheney, a Republican, of Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona for speaking at the America First Political Action Conference that took place in Orlando, Florida and was organized by White nationalist Nick Fuentes.",
    "author": "Chandelis Duster",
    "title": "'I've got morons on my team': Romney blasts fellow GOP members for attending White nationalist event and supporting Putin"
  },
  {
    "id": 12658,
    "mediaId": 2594,
    "date": "2022-02-27",
    "sentence": "Another Republican who herself has faced censure by the national Republican Party for her participation in the January 6 investigation, Liz Cheney, also aimed fire at Ms Greene: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "John Bowden",
    "title": "Romney calls Marjorie Taylor Greene a ‘moron’ as moderates demand party ditch ‘Putin wing of GOP’"
  },
  {
    "id": 12968,
    "mediaId": 2547,
    "date": "2022-02-27",
    "sentence": "CNN host Dana Bash asked Romney about a tweet by Liz Cheney, where she slammed Republican leadership for their silence on the matter:\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Heather",
    "title": "Mitt Romney: 'I Have Morons On My Team!'"
  },
  {
    "id": 12866,
    "mediaId": 2643,
    "date": "2022-02-27",
    "sentence": "Representative Liz Cheney, of Wyoming tweeted: \"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.\"",
    "author": "Andrew Stanton",
    "title": "Mitt Romney Blasts Greene, Gosar: 'Missing a Few IQ Points'"
  },
  {
    "id": 13033,
    "mediaId": 2614,
    "date": "2022-02-27",
    "sentence": "Yesterday, Cheney tweeted “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist , anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Objectivist Staff",
    "title": "Mitt Romney Bashes “Pro-Russian” Republicans on CNN; “Almost Treasonous”"
  },
  {
    "id": 13061,
    "mediaId": 2595,
    "date": "2022-02-27",
    "sentence": "Watch:\nMitt Romney rebukes MTG attending white supremacist event:\n“Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, I don’t know them.",
    "author": "M Dowling",
    "title": "Romney Calls Reps MTG & Gosar “Morons,” Praises Biden, Trashes DJT"
  },
  {
    "id": 12995,
    "mediaId": 6598,
    "date": "2022-02-27",
    "sentence": "Sen. Mitt Romney on Sunday likened Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene to \"morons\" and said they were \"missing a few IQ points\" after their participation in a political event led by a white nationalist.",
    "author": "Ronald J. Hansen",
    "title": "'I've got morons on my team': Sen. Mitt Romney hits Reps. Paul Gosar, Marjorie Taylor Greene"
  },
  {
    "id": 13208,
    "mediaId": 2830,
    "date": "2022-02-27",
    "sentence": "In a tweet Saturday, Rep. Liz Cheney, who has faced intraparty censure in her home state of Wyoming over her criticism of former President Donald Trump, blasted their speaking appearance: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Mike Murphy",
    "title": "‘Morons’: Romney, Cheney, Kinzinger condemn fellow Republicans for speaking at white nationalist event"
  },
  {
    "id": 13204,
    "mediaId": 2631,
    "date": "2022-02-28",
    "sentence": "WASHINGTON — GOP leaders in the House and the Senate on Monday denounced a pair of far-right Trump allies — Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz. — for speaking at a gathering of white nationalists in Florida over the weekend.",
    "author": "",
    "title": "GOP leaders denounce Greene, Gosar for speaking at white nationalist event"
  },
  {
    "id": 13302,
    "mediaId": 2676,
    "date": "2022-02-28",
    "sentence": "Sen. Mitt Romney, R-Utah, called Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., \"morons\" on Sunday after the two House lawmakers attended a white nationalist event whose participants heaped praise on Russia for invading Ukraine.",
    "author": "Jon Skolnik",
    "title": "\"I have morons on my team\": Mitt Romney blasts radical Republicans in Congress"
  },
  {
    "id": 12971,
    "mediaId": 2593,
    "date": "2022-02-28",
    "sentence": "However, he said, “Standing up for freedom is the right thing to do in America, and anything less than that, in my opinion, is unworthy of American support.”\nRomney’s comments come after Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) spoke at a white nationalist conference.",
    "author": "Bradley Cortright",
    "title": "'Almost Treasonous': Romney Denounces 'Pro-Putin Sentiment' Among Some Republicans"
  },
  {
    "id": 12976,
    "mediaId": 2643,
    "date": "2022-02-28",
    "sentence": "\"There's no place in the Republican Party for white supremacists or antisemitism,\" McConnell told Politico, when asked to comment on Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>'s attendance at the America First Political Action Conference.",
    "author": "Natalie Colarossi",
    "title": "Mitch McConnell Condemns GOP Members Who Engage With White Nationalists"
  },
  {
    "id": 13225,
    "mediaId": 2748,
    "date": "2022-03-01",
    "sentence": "\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Cheney said in a tweet.",
    "author": "Blarp Blog",
    "title": "Romney on Greene, Gosar: 'I have morons on my team'"
  },
  {
    "id": 13298,
    "mediaId": 2607,
    "date": "2022-03-04",
    "sentence": "In a similar abdication, few GOP leaders have been as outspoken and categorical as Romney in castigating Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, who recently shared their madcap musings with an audience of white supremacists in Florida.",
    "author": "Mark Barabak",
    "title": "Romney speaks harshly but honestly about Putin and GOP’s crackpots"
  },
  {
    "id": 10732,
    "mediaId": 2550,
    "date": "2022-03-07",
    "sentence": "That’s the same conference where Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> also spoke, prompting Republican Sen. Mitt Romney to call them “morons.”\nHere’s the complete video of Putin’s bizarre event.",
    "author": "Charles Jay\nCommunity",
    "title": "may idolize Vlad, but the feeling isn't mutual"
  },
  {
    "id": 9773,
    "mediaId": 2548,
    "date": "2022-03-22",
    "sentence": "An image shared on Instagram purportedly shows a tweet from Republican Arizona Rep. <span class='selected-term'>Paul Gosar</span> about being called a “moron.”\nVerdict: False\nThe tweet has been digitally fabricated.",
    "author": "",
    "title": "FACT CHECK: Did Paul Gosar Send This Tweet About Being Called A ‘Moron’?"
  },
  {
    "id": 8985,
    "mediaId": 3997,
    "date": "2022-03-22",
    "sentence": "An image shared on Instagram purportedly shows a tweet from Republican Arizona Rep. <span class='selected-term'>Paul Gosar</span> about being called a “moron.”\nVerdict: False\nThe tweet has been digitally fabricated.",
    "author": "Hannah Hudnall",
    "title": "FACT CHECK: Did Paul Gosar Send This Tweet About Being Called A ‘Moron’?"
  },
  {
    "id": 7757,
    "mediaId": 2859,
    "date": "2022-04-06",
    "sentence": "Also, Romney referred to Greene and Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz., as “morons” for attending a conference put on by a white supremacist where people cheered for Russian President Vladimir Putin after the invasion of Ukraine.",
    "author": "Dennis Romboy",
    "title": "Mitt Romney’s support of Ketanji Brown Jackson unleashes conservative vitriol"
  }
]