[
  {
    "id": 3853,
    "mediaId": 2550,
    "date": "2022-01-21",
    "sentence": "Rising to his defense was Congressman <span class='selected-term'>Paul Gosar</span> of Arizona, one of the Republicans with his own deep connections to the Jan. 6 insurrection, who demanded that federal authorities explain Fuentes’ supposed ban.",
    "author": "",
    "title": "White nationalist Fuentes gets subpoena from Jan. 6 committee, but he’s preparing for mockery"
  },
  {
    "id": 3817,
    "mediaId": 2547,
    "date": "2022-01-22",
    "sentence": "Rising to his defense was Congressman <span class='selected-term'>Paul Gosar</span> of Arizona, one of the Republicans with his own deep connections to the Jan. 6 insurrection, who demanded that federal authorities explain Fuentes’ supposed ban.",
    "author": "David Neiwert",
    "title": "Jan 6 Committee Subpoenas White Nationalist Nicholas Fuentes"
  },
  {
    "id": 3614,
    "mediaId": 2690,
    "date": "2022-01-22",
    "sentence": "Among the many speakers at President Trump’s Florence, AZ, rally were MyPillow CEO and fervent Trump supporter Mike Lindell, Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) and Arizona state lawmaker Wendy Rogers.",
    "author": "",
    "title": "Steve Bannon Drops Bombshell: Trump’s AZ Rally Is The Beginning Of 2020 Election ‘Decertification Process’"
  },
  {
    "id": 3651,
    "mediaId": 2590,
    "date": "2022-01-25",
    "sentence": "Advertisement\nAccording to many reviews, mission not accomplished:\nThis is more like <span class='selected-term'>Paul Gosar</span> doing Kate McKinnon doing Laura Ingraham.",
    "author": "Ron Dicker",
    "title": "Laura Ingraham Imitates Kate McKinnon's Impression Of Her And Reviews Pour In"
  },
  {
    "id": 2297,
    "mediaId": 2699,
    "date": "2022-02-09",
    "sentence": "Those are the acceptable sins, respectively, of Reps. Marjorie Taylor Greene, Lauren Boebart, Matt Gaetz, and <span class='selected-term'>Paul Gosar</span>.",
    "author": "Wajahat Ali",
    "title": "Sorry, Mitch McConnell. Frankenstein’s Monster Runs the GOP Now"
  },
  {
    "id": 2023,
    "mediaId": 2740,
    "date": "2022-02-09",
    "sentence": "Reps. <span class='selected-term'>Paul Gosar</span>, R-Ariz., and Ted Cruz, R-Texas, were also named in the subpoena as two of \"more than 100\" members of Congress who were \"on board\" with the plans to overturn the election results.",
    "author": "Chelsey Cox",
    "title": "Peter Navarro, former Trump White House adviser, subpoenaed by Jan. 6 committee"
  },
  {
    "id": 536,
    "mediaId": 2664,
    "date": "2022-02-22",
    "sentence": "Republicans immediately derided Biden’s pledge to nominate a Black woman to the Supreme Court – while Democratic leaders are hoping for bipartisan support; House Speaker Nancy Pelosi insists the nation needs a strong Republican party – meanwhile radicals like Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, who fantasize about committing acts of violence against Democrats, are embraced by fellow Republicans, proving they are not just a extremist fringe that has 'hijacked' the Party, as Pelosi suggested.\"",
    "author": "Bob Brigham",
    "title": "Biden needs to stop seeking bipartisanship as Republicans abandon democracy: historian"
  },
  {
    "id": 526,
    "mediaId": 2584,
    "date": "2022-02-22",
    "sentence": "Republicans immediately derided Biden’s pledge to nominate a Black woman to the Supreme Court – while Democratic leaders are hoping for bipartisan support; House Speaker Nancy Pelosi insists the nation needs a strong Republican party – meanwhile radicals like Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, who fantasize about committing acts of violence against Democrats, are embraced by fellow Republicans, proving they are not just a extremist fringe that has “hijacked” the Party, as Pelosi suggested.",
    "author": "Thomas Zimmer",
    "title": "The Republican party is abandoning democracy. There can be no ‘politics as usual’"
  },
  {
    "id": 248,
    "mediaId": 2643,
    "date": "2022-02-23",
    "sentence": "Also signing the letter were a number of Republicans who are often at odds with the president, such as Representatives Louie Gohmert (R-Texas) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.).",
    "author": "Justin Klawans",
    "title": "Democrats, Republicans Applaud Biden's Russia Sanctions"
  },
  {
    "id": 12550,
    "mediaId": 2594,
    "date": "2022-02-26",
    "sentence": "“As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "John Bowden",
    "title": "Marjorie Taylor Greene defends speaking at white supremacist event saying she didn’t know what it was"
  },
  {
    "id": 12645,
    "mediaId": 2590,
    "date": "2022-03-03",
    "sentence": "Their heckling came on the same day that House Minority Leader Kevin McCarthy (R-Calif.) dodged questions about whether Greene and another member of his conference, Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.), would face any punishment for participating in a white nationalist event over the weekend.",
    "author": "Jennifer Bendery",
    "title": "Nancy Pelosi To GOPers Who Interrupted Biden’s State Of The Union Speech: ‘Shut Up’"
  },
  {
    "id": 12943,
    "mediaId": 2572,
    "date": "2022-03-03",
    "sentence": "Reps. Thomas Massie, R-Ky., Matt Rosendale, R-Mont., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., all voted nay.",
    "author": "",
    "title": "Mixed messages from Congress at State of the Union address on Ukraine, COVID-19"
  },
  {
    "id": 11035,
    "mediaId": 2590,
    "date": "2022-03-09",
    "sentence": "Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) won’t face punishment for participating in a white nationalist conference, House Republican leader Kevin McCarthy (R-Calif.) said Wednesday.",
    "author": "Arthur Delaney",
    "title": "Kevin McCarthy Won't Punish Republicans Who Joined White Nationalist Conference"
  },
  {
    "id": 10728,
    "mediaId": 2550,
    "date": "2022-03-10",
    "sentence": "After Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> spoke at the America First Political Action Conference, it took McCarthy 10 days to get around to having a chat with Greene.",
    "author": "Laura Clawson",
    "title": "Greene and Gosar won't face punishment for speaking at white nationalist event"
  },
  {
    "id": 9671,
    "mediaId": 2741,
    "date": "2022-03-29",
    "sentence": "So we thought it was time to start a list of all the things McCarthy has had to pull a lawmaker aside for:\nThe time Representative <span class='selected-term'>Paul Gosar</span> made and disseminated a video depicting him swinging a sword at Joe Biden’s head and decapitating Alexandria Ocasio-Cortez (McCarthy told CNN he spoke to Gosar, without condemning Gosar’s behavior)\nThe time Representative Marjorie Taylor Greene called for Nancy Pelosi to be executed for treason, harassed a school-shooting survivor on the street, blamed the California wildfires on Jewish laser beams, and espoused the ideas of QAnon (McCarthy refused to discipline the congresswoman and claimed that, during a private conversation, she “recognized” that she needed to hold herself to a higher standard)\nThe time Greene spoke at a white nationalist conference (McCarthy admitted this was bad but, following a conversation with Greene, declined to hold her accountable, saying, “my conversations with my members are exactly that.”)\nThe time Representative Lauren Boebert made Islamophobic comments about Representative Ilhan Omar (McCarthy obviously refused to condemn her but, rest assured, they had a chat!)",
    "author": "Bess Levin",
    "title": "Orgies, Beheadings, Jewish Space Lasers: Everything Kevin McCarthy Has Had to “Speak” to Republican Lawmakers About"
  },
  {
    "id": 9114,
    "mediaId": 2594,
    "date": "2022-03-30",
    "sentence": "In recent weeks that has included public rebukes of Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> for their attendance at a white nationalist-led far right conference hosted during CPAC in Florida.",
    "author": "John Bowden",
    "title": "Trump pours cold water on House speaker idea floated by Matt Gaetz"
  },
  {
    "id": 7054,
    "mediaId": 2594,
    "date": "2022-03-31",
    "sentence": "But the final straw for McCarthy was that Cawthorn dared to impugn the character of a caucus that includes the likes of <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene and Lauren Boebert.",
    "author": "Eric Garcia",
    "title": "Kevin McCarthy is to blame for Madison Cawthorn. He deserves the consequences"
  },
  {
    "id": 7105,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Greene recently escaped meaningful rebuke from Republican leaders when she and Rep. <span class='selected-term'>Paul Gosar</span> spoke at a white nationalist event.",
    "author": "Laura Clawson",
    "title": "Jimmy Kimmel claps back after Marjorie Taylor Greene says she reported his joke to the police"
  },
  {
    "id": 6109,
    "mediaId": 2732,
    "date": "2022-04-17",
    "sentence": "Her colleagues in the House include <span class='selected-term'>Paul Gosar</span> and Matt Gaetz and Lauren Boebert and Louie Gohmert and, sigh, many more.",
    "author": "Mona Charen",
    "title": "Mona Charen: How to disarm the crazies"
  },
  {
    "id": 5553,
    "mediaId": 2621,
    "date": "2022-04-17",
    "sentence": "“But Lauren Boebert, and Marjorie Taylor Greene, and <span class='selected-term'>Paul Gosar</span>.",
    "author": "Ken Meyer",
    "title": "GOP Congressman Says the Republican Party is in ‘Troubled Waters’ Thanks to the Marjorie Taylor Greene ‘Element’"
  },
  {
    "id": 5250,
    "mediaId": 2662,
    "date": "2022-04-19",
    "sentence": "HERE IS THE SILLY VIDEO Rep. <span class='selected-term'>Paul Gosar</span> Posted that Tyrant Pelosi Is Using to Demand He is Removed from His Congressional Committees — What a Joke\nNow Republicans are weighing in on imposing term limits on committee leadership positions if the GOP retakes the House of Representatives next year.",
    "author": "Jim Hoft",
    "title": "Kevin McCarthy Says GOP Could Strip Crooked Democrats from Committee Leadership Positions — DON’T BELIEVE IT"
  },
  {
    "id": 5486,
    "mediaId": 2672,
    "date": "2022-04-22",
    "sentence": "“I don’t remember.”\nShe was asked if she talked to Rep. Andy Biggs (R-Ariz.)\n“I don’t remember.”\nShe was asked if she talked to Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.)\n“Sorry, I don’t remember.”\nWhat about anyone in the White House?",
    "author": "Ryan Bort",
    "title": "‘I Don’t Remember’: Marjorie Taylor Greene Comes Down With Case of Jan. 6 Amnesia While Under Oath"
  },
  {
    "id": 5973,
    "mediaId": 2699,
    "date": "2022-04-22",
    "sentence": "“I do not remember” was Greene’s response to multiple questions about whether she spoke to government officials about the run-up to the Capitol attack, including election deniers Reps. Andy Biggs (R-AZ) and <span class='selected-term'>Paul Gosar</span> (R-AZ) and anyone in the White House.",
    "author": "Corbin Bolies",
    "title": "‘Oh No, Wait!’: Marjorie Taylor Greene’s Own Words Haunt Her"
  }
]