[
  {
    "id": 2837,
    "mediaId": 2550,
    "date": "2022-02-02",
    "sentence": "Unfortunately, we are living in desperate times and the only way that Cheney and Kinzinger can survive is to do the right thing and bring criminal charges to light about the complicity and the possible conspiracy by Republicans like Ted Cruz, Josh Hawley, Louie Gohmert, Mo Brooks, Marjorie Taylor Greene, Lauren Boebert, Matt Gaetz, <span class='selected-term'>Paul Gosar</span>, and others, to overturn our democratically elected 46th President.",
    "author": "",
    "title": "Rep. Adam Kinzinger brings a bazooka to Josh Hawley's knife fight"
  },
  {
    "id": 12630,
    "mediaId": 2745,
    "date": "2022-02-28",
    "sentence": "He added: “Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> — I don’t know them, but I’m reminded of that old line from the ‘Butch Cassidy and the Sundance Kid’ movie where one character says, ‘Morons.",
    "author": "",
    "title": "McConnell says no space in GOP for ‘white supremacists or anti-Semitism’ after two House Republicans participate in white nationalist’s conference"
  },
  {
    "id": 13335,
    "mediaId": 2560,
    "date": "2022-02-28",
    "sentence": "McConnell issued a statement in response to reports that Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona addressed the America First Political Action Conference (AFPAC) in Orlando, Fla.",
    "author": "Jonathan Edwards and Mariana Alfaro",
    "title": "McConnell: No space in GOP for 'white supremacists or anti-Semitism' after two House Republicans attend in white nationalist's conferene"
  },
  {
    "id": 13344,
    "mediaId": 2745,
    "date": "2022-02-28",
    "sentence": "He added: “Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> — I don’t know them, but I’m reminded of that old line from the ‘Butch Cassidy and the Sundance Kid’ movie where one character says, ‘Morons.",
    "author": "",
    "title": "McConnell says no space in GOP for ‘white supremacists or anti-Semitism’ after two House Republicans participate in white nationalist’s conference"
  },
  {
    "id": 12729,
    "mediaId": 2621,
    "date": "2022-03-02",
    "sentence": "The vote was 426 to three, as Reps. <span class='selected-term'>Paul Gosar</span> (R-AZ), Thomas Massie (R-KY), and Matt Rosendale (R-MT) voted against the measure.",
    "author": "Michael Luciano",
    "title": "Three House Republicans Oppose Resolution Supporting Ukraine in 426-3 Vote"
  },
  {
    "id": 9519,
    "mediaId": 5308,
    "date": "2022-03-29",
    "sentence": "House Minority Leader Kevin McCarthy, who has come under scrutiny for refusing to criticize the far-right of his party—including former President Donald Trump and Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>—reportedly said he would have a meeting with Cawthorn to talk about his comments.",
    "author": "Paul Blest",
    "title": "Congress Would Like to Know More About Madison Cawthorn’s ‘Cocaine’ ‘Orgies’ Claim"
  }
]