[
  {
    "id": 9436,
    "mediaId": 2894,
    "date": "2022-03-30",
    "sentence": "Of course, Cawthorn isn't the only controversial member in the GOP ranks: Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, for example, both recently addressed a conference organized by a White nationalist, and received little more than a verbal rebuke from their leaders and colleagues.",
    "author": "",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 7807,
    "mediaId": 2688,
    "date": "2022-03-31",
    "sentence": "Republicans’ outrage over Cawthorn’s Veep-esque account of congressional indiscretions stands in glaring contrast to their muted response to Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) speaking at a white nationalist conference last month.",
    "author": "Matt Shuham",
    "title": "North Carolina Sen. Tillis Backs Cawthorn’s Rival Amid Orgy-Gate"
  },
  {
    "id": 7782,
    "mediaId": 2699,
    "date": "2022-03-31",
    "sentence": "Yet another Freedom Caucus member, Rep. <span class='selected-term'>Paul Gosar</span>, has emerged essentially unscathed after speaking at a white supremacist conference and posting a violent anime depicting the murder of Rep. Alexandria Ocasio-Cortez.",
    "author": "Wajahat Ali",
    "title": "The GOP Was Hard to Embarrass. Then Came Madison Cawthorn."
  },
  {
    "id": 7729,
    "mediaId": 2550,
    "date": "2022-04-01",
    "sentence": "Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> spoke at a white nationalist event and McCarthy had a private chat with them, then went to reporters and explicitly promised that they’d get their committee assignments back if Republicans take the House.",
    "author": "Laura Clawson",
    "title": "Republicans aren't happy Madison Cawthorn spilled the beans about cocaine orgies"
  },
  {
    "id": 7674,
    "mediaId": 2790,
    "date": "2022-04-01",
    "sentence": "This was a swifter-than-usual response from the GOP leader\nMcCarthy has had to step in to condemn various rhetoric and actions taken by members of his conference, from denouncing language used by Rep. Marjorie Taylor Greene that equated COVID-19 safety measures with the treatment of Jews during the Holocaust and more recently calling it \"appalling\" that Greene and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona attended an event led by a white nationalist.",
    "author": "Barbara Sprunt",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  }
]