[
  {
    "id": 4130,
    "mediaId": 2522,
    "date": "2022-01-21",
    "sentence": "He aggressively went after Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) for his anime depicting an attack on Rep. Alexandria Ocasio-Cortez (D-NY).",
    "author": "Terresa Monroe-Hamilton",
    "title": "Clinton labor secretary blames his tweet calling for the assault of Sen. Sinema on Republicans"
  },
  {
    "id": 3613,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 2837,
    "mediaId": 2550,
    "date": "2022-02-02",
    "sentence": "Unfortunately, we are living in desperate times and the only way that Cheney and Kinzinger can survive is to do the right thing and bring criminal charges to light about the complicity and the possible conspiracy by Republicans like Ted Cruz, Josh Hawley, Louie Gohmert, Mo Brooks, Marjorie Taylor Greene, Lauren Boebert, Matt Gaetz, <span class='selected-term'>Paul Gosar</span>, and others, to overturn our democratically elected 46th President.",
    "author": "",
    "title": "Rep. Adam Kinzinger brings a bazooka to Josh Hawley's knife fight"
  },
  {
    "id": 911,
    "mediaId": 8345,
    "date": "2022-02-15",
    "sentence": "",
    "author": "",
    "title": "Preserving freedom, ‘red wave’ hot topics at Lincoln Day Dinner"
  },
  {
    "id": 41,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "“Meanwhile, radicals like Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, who fantasize about committing acts of violence against Democrats, are embraced by fellow Republicans, proving they are not just an extremist fringe that has ‘hijacked’ the Party, as Pelosi suggested.”\nThe history professor concludes his op-ed on a disturbing note, arguing that Democrats are being naïve if they underestimate the “radicalization” of the 2022 GOP.",
    "author": "Alex Henderson",
    "title": "There can be no ‘politics as usual’ when ‘radicalized’ Republicans reject democracy itself: historian"
  },
  {
    "id": 12811,
    "mediaId": 2746,
    "date": "2022-02-27",
    "sentence": "“Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, I don’t know them,” Mr. Romney, Utah Republican, told CNN’s “State of the Union.” “I’m reminded of the old line from the Butch Cassidy and Sundance Kid movie, where one character says, ‘Morons, I have morons on my team.’”\n“I would think that anybody that would sit down with a white nationalist and speak at their conference would certainly be missing a few IQ points,” he said.",
    "author": "Tom Howell Jr.",
    "title": "Sen. Mitt Romney rips ‘morons’ in GOP after lawmakers address White nationalist conference"
  },
  {
    "id": 12809,
    "mediaId": 2590,
    "date": "2022-02-27",
    "sentence": "It’s, as you’ve indicated, speaking of evil, it’s evil as well,” Romney told CNN’s Dana Bash on “State of the Union.”\nAdvertisement\nHe went on to call out Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) for speaking at the third annual America First Political Action Conference, which was organized by white nationalist figurehead Nick Fuentes in Orlando, Florida.",
    "author": "Nina Golgowski",
    "title": "Sen. Mitt Romney Slams GOP 'Morons' At 'Evil' White Nationalist Conference"
  },
  {
    "id": 12748,
    "mediaId": 2520,
    "date": "2022-02-27",
    "sentence": "A pair of prominent Republicans broke the disturbing and rather deafening silence within the once-Grand Old Party over the weekend, calling out Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene for participating in a conference catering to white nationalists.",
    "author": "Laurie Roberts",
    "title": "Where Sen. Mitt Romney sees 'morons', Arizona Gov. Doug Ducey sees allies"
  },
  {
    "id": 12995,
    "mediaId": 6598,
    "date": "2022-02-27",
    "sentence": "Sen. Mitt Romney on Sunday likened Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene to \"morons\" and said they were \"missing a few IQ points\" after their participation in a political event led by a white nationalist.",
    "author": "Ronald J. Hansen",
    "title": "'I've got morons on my team': Sen. Mitt Romney hits Reps. Paul Gosar, Marjorie Taylor Greene"
  },
  {
    "id": 13204,
    "mediaId": 2631,
    "date": "2022-02-28",
    "sentence": "WASHINGTON — GOP leaders in the House and the Senate on Monday denounced a pair of far-right Trump allies — Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz. — for speaking at a gathering of white nationalists in Florida over the weekend.",
    "author": "",
    "title": "GOP leaders denounce Greene, Gosar for speaking at white nationalist event"
  },
  {
    "id": 12971,
    "mediaId": 2593,
    "date": "2022-02-28",
    "sentence": "However, he said, “Standing up for freedom is the right thing to do in America, and anything less than that, in my opinion, is unworthy of American support.”\nRomney’s comments come after Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) spoke at a white nationalist conference.",
    "author": "Bradley Cortright",
    "title": "'Almost Treasonous': Romney Denounces 'Pro-Putin Sentiment' Among Some Republicans"
  },
  {
    "id": 12958,
    "mediaId": 2643,
    "date": "2022-03-01",
    "sentence": "Rogers' censure follows rebukes by national Republican leaders against U.S. GOP Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona who also spoke at the conference.",
    "author": "Daniel Villarreal",
    "title": "GOP Senators Censure Colleague for Speaking at White Nationalist Conference"
  },
  {
    "id": 12950,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "Nationally, several prominent Republicans took aim at two GOP members of Congress who spoke at AFPAC, Arizona’s <span class='selected-term'>Paul Gosar</span> and Georgia’s Marjorie Taylor Greene.",
    "author": "Jeremy Duda",
    "title": "Trump-loving lawmaker threatens to 'destroy' any Republican who tries to punish her for attending white nationalist conference"
  },
  {
    "id": 12924,
    "mediaId": 2621,
    "date": "2022-03-01",
    "sentence": "GOP Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene also spoke at his controversial conference over the weekend.",
    "author": "Alex Griffing",
    "title": "GOP-Controlled AZ Senate Censures Trump-Backed Republican Lawmaker Wendy Rogers"
  },
  {
    "id": 13197,
    "mediaId": 2602,
    "date": "2022-03-01",
    "sentence": "Senate Minority Leader Mitch McConnell chastised two fellow Republicans for attending a conference run by a well known white nationalist, saying, “There’s no place in the Republican Party for white supremacists or antisemitism.”\nHouse Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> and Arizona State Sen. Wendy Rogers earned the ire of Republican leadership by speaking at the America First Political Action Conference in Orlando over the weekend.",
    "author": "GABE FRIEDMAN/JTA",
    "title": "Mitch McConnell condemns antisemitism after Republicans speak at white nationalist conference"
  },
  {
    "id": 12990,
    "mediaId": 8369,
    "date": "2022-03-02",
    "sentence": "McCarthy told a CNN reporter on Monday that it was “appalling and wrong” for Republican Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., to speak to the annual America First Political Action Conference, or AFPAC.",
    "author": "Michelle Malkin",
    "title": "AFPAC vs. America Last GOP"
  },
  {
    "id": 13338,
    "mediaId": 5308,
    "date": "2022-03-02",
    "sentence": "In addition to Rogers, two current members of Congress, Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, spoke at the conference.",
    "author": "Paul Blest",
    "title": "Republicans Have Finally Had Enough of Wendy Rogers"
  },
  {
    "id": 12702,
    "mediaId": 2641,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz.\nSen. Lindsey Graham, R-S.C., was also introducing a resolution in the Senate that would back Ukraine's claim in international court that Putin and his \"cronies\" have committed war crimes.",
    "author": "Eric Mack",
    "title": "House Passes Resolution to Support for Ukraine 426-3"
  },
  {
    "id": 12499,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "While Lake did not respond to questions about Rogers, she has not distanced herself from Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who spoke at the same Nick Fuentes' white nationalist America First Political Action Conference in Florida.",
    "author": "Bob Brigham",
    "title": "Censured Republican is so toxic she’s become an issue in Arizona governor’s race: report"
  },
  {
    "id": 12747,
    "mediaId": 2520,
    "date": "2022-03-03",
    "sentence": "No less than Senate Minority Leader Mitch McConnell and House Minority Leader Kevin McCarthy are leading the stampede to distance themselves from Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene for speaking at a conference for white nationalists last week.",
    "author": "Laurie Roberts",
    "title": "Rep. Paul Gosar cozies up to white nationalists (again) and now GOP leaders are upset?"
  },
  {
    "id": 12944,
    "mediaId": 8387,
    "date": "2022-03-03",
    "sentence": "A guy, by the way, who Rep. <span class='selected-term'>Paul Gosar</span> calls a friend.",
    "author": "Laurie Roberts",
    "title": "Matt Salmon blasts Wendy Rogers as unfit to serve. Where you been, Matt?"
  },
  {
    "id": 13184,
    "mediaId": 4032,
    "date": "2022-03-04",
    "sentence": "McCarthy told a CNN reporter on Monday that it was “appalling and wrong” for Republican Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., to speak to the annual America First Political Action Conference, or AFPAC.",
    "author": "Michelle Malkin",
    "title": "AFPAC Versus America Last GOP"
  },
  {
    "id": 12620,
    "mediaId": 8369,
    "date": "2022-03-06",
    "sentence": "Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, I don’t know them, but I’m reminded of that old line from the ‘Butch Cassidy and the Sundance Kid’ movie where—where one character says, ‘Morons, I’ve got morons on my team.’ And I have to think anybody that would sit down with White nationalists and speak at their conference was certainly missing a few IQ points” [Romney blasts fellow GOP members for attending White nationalist event, by Chandelis Duster, CNN, February 27, 2022].",
    "author": "Gregory Hood",
    "title": "GOP’s Reaction to America First Conference Shows They Can’t Resist Cucking"
  },
  {
    "id": 11556,
    "mediaId": 2607,
    "date": "2022-03-09",
    "sentence": "House Republican leader Kevin McCarthy waited days before castigating Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona — who once sought to create a whites-only congressional caucus — for speaking to a white supremacist gathering in Florida.",
    "author": "Mark Barabak",
    "title": "Dealing with extremists, some GOP leaders find sorry is the hardest word"
  },
  {
    "id": 11516,
    "mediaId": 2911,
    "date": "2022-03-14",
    "sentence": "The Senate has also censured nine of its own members, and in 2021, the U.S. House of Representatives censured its 24th member, Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, for, among other things, posting an anime video of himself killing a fellow member.",
    "author": "Seth Masket",
    "title": "How An Uptick In Censures Among Local Republicans Signals A Growing Radicalism"
  },
  {
    "id": 13432,
    "mediaId": 8475,
    "date": "2022-03-16",
    "sentence": "Seventeen Republican members of Congress, including Arizona’s Andy Biggs and <span class='selected-term'>Paul Gosar</span>, have sued the U.S. Centers for Disease Control and Prevention, seeking an end to the federal rule requiring passengers on commercial flights and in airports to wear masks.",
    "author": "Jacob Fischler",
    "title": "Republicans in Congress file suit to end mask mandate for air travel"
  },
  {
    "id": 9049,
    "mediaId": 2520,
    "date": "2022-03-19",
    "sentence": "Under the threat of censure from some of her colleagues (who did censure her) she wrote on Twitter, “I stand with the Christians worldwide not the global bankers who are shoving godlessness and degeneracy in our face.”\nAnd in another tweet: “I’m just a sweet grandma who loves Jesus and America.”\nThat's not what Jesus sounded like\nBut Wendy Rogers, Nick Fuentes and <span class='selected-term'>Paul Gosar</span> sound nothing like Jesus.",
    "author": "Tim Wright",
    "title": "It does real damage when Sen. Wendy Rogers spews hate and claims to love Jesus"
  },
  {
    "id": 9061,
    "mediaId": 2512,
    "date": "2022-03-27",
    "sentence": "In a now-deleted Periscope video posted in December 2020, Alexander also claimed that Brooks was one of three members of Congress — along with Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs, both of Arizona — who had helped plan the activities of Jan. 6.",
    "author": "Kathryn Joyce",
    "title": "Jan. 6 organizer labels former ally Rep. Mo Brooks a 'LOSER'"
  },
  {
    "id": 9436,
    "mediaId": 2894,
    "date": "2022-03-30",
    "sentence": "Of course, Cawthorn isn't the only controversial member in the GOP ranks: Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, for example, both recently addressed a conference organized by a White nationalist, and received little more than a verbal rebuke from their leaders and colleagues.",
    "author": "",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 7807,
    "mediaId": 2688,
    "date": "2022-03-31",
    "sentence": "Republicans’ outrage over Cawthorn’s Veep-esque account of congressional indiscretions stands in glaring contrast to their muted response to Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) speaking at a white nationalist conference last month.",
    "author": "Matt Shuham",
    "title": "North Carolina Sen. Tillis Backs Cawthorn’s Rival Amid Orgy-Gate"
  },
  {
    "id": 7729,
    "mediaId": 2550,
    "date": "2022-04-01",
    "sentence": "Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> spoke at a white nationalist event and McCarthy had a private chat with them, then went to reporters and explicitly promised that they’d get their committee assignments back if Republicans take the House.",
    "author": "Laura Clawson",
    "title": "Republicans aren't happy Madison Cawthorn spilled the beans about cocaine orgies"
  },
  {
    "id": 7757,
    "mediaId": 2859,
    "date": "2022-04-06",
    "sentence": "Also, Romney referred to Greene and Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz., as “morons” for attending a conference put on by a white supremacist where people cheered for Russian President Vladimir Putin after the invasion of Ukraine.",
    "author": "Dennis Romboy",
    "title": "Mitt Romney’s support of Ketanji Brown Jackson unleashes conservative vitriol"
  },
  {
    "id": 7838,
    "mediaId": 2676,
    "date": "2022-04-06",
    "sentence": "UPDATE: A representative of Congressman <span class='selected-term'>Paul Gosar</span>'s campaign spoke with the Arizona Mirror after publication of their story to say the congressman would not be attending the white nationalist group's event on April 20.",
    "author": "Kelly McClure",
    "title": "GOP Rep. Paul Gosar promoted appearance at white nationalist event, but now says he is not attending"
  },
  {
    "id": 8863,
    "mediaId": 8347,
    "date": "2022-04-08",
    "sentence": "LAKE HAVASU CITY, Ariz. (AP) — Republican U.S. Rep. <span class='selected-term'>Paul Gosar</span> says he now lives in Mohave County, putting his residence in Arizona’s newly redrawn 9th Congressional District as he runs for a seventh term.",
    "author": "Associated Press",
    "title": "Rep. Gosar shifts residence to Mohave County in new district"
  },
  {
    "id": 7187,
    "mediaId": 2636,
    "date": "2022-04-08",
    "sentence": "",
    "author": "",
    "title": "Trump Organization Can Keep Operating N.Y.C. Golf Course, Judge Rules"
  }
]