[
  {
    "id": 4578,
    "mediaId": 2810,
    "date": "2022-01-05",
    "sentence": "Those Republican representatives who the planners allege personally engaged with them directly, or did so via assigned staffers, include Marjorie Taylor Greene of Georgia, <span class='selected-term'>Paul Gosar</span> of Arizona, Lauren Boebert of Colorado, Mo Brooks of Alabama, Madison Cawthorn of North Carolina, Andy Biggs of Arizona, and Louie Gohmert of Texas.",
    "author": "John Nichols",
    "title": "To Avert Another January 6, Expel Coup Plotters From Congress"
  },
  {
    "id": 4486,
    "mediaId": 2810,
    "date": "2022-01-13",
    "sentence": "A number of House members have been identified by planners of the “Stop the Steal” rally as having collaborated with them—either directly or via assigned staffers—including Marjorie Taylor Greene of Georgia, <span class='selected-term'>Paul Gosar</span> of Arizona, Lauren Boebert of Colorado, Mo Brooks of Alabama, Andy Biggs of Arizona, and Louie Gohmert of Texas.",
    "author": "John Nichols",
    "title": "Madison Cawthorn’s Incitement of Insurrection Should Knock Him Off the Ballot"
  },
  {
    "id": 3717,
    "mediaId": 2621,
    "date": "2022-01-20",
    "sentence": "Such as when Rep. <span class='selected-term'>Paul Gosar</span> shared an anime parody in which the bad guys had the faces of Democrats like Rep. Alexandria Ocasio-Cortez.",
    "author": "Caleb Howe",
    "title": "Robert Reich Deletes Tweet Calling for Democrats to Smack Kyrsten Sinema Over Her Filibuster Vote"
  },
  {
    "id": 4018,
    "mediaId": 2716,
    "date": "2022-01-25",
    "sentence": "They include Cawthorn and six other House members: Rep. Andy Biggs (R-Ariz.); Rep. Lauren Boebert (R-Colo.); Rep. Mo Brooks (R-Ala.); Rep. Louie Gohmert (R-Texas); Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.); and Rep. Marjorie Taylor Greene (R-Ga.).",
    "author": "Rick Henderson",
    "title": "The risky plan to prevent Congress' Jan. 6 sympathizers from running for re-election"
  },
  {
    "id": 3695,
    "mediaId": 2584,
    "date": "2022-01-26",
    "sentence": "Once fringe, now dominant in the party, rightwing Republicans are strategizing for minoritarian rule\nThe Arizona Republican congressman <span class='selected-term'>Paul Gosar</span> had a simple message for the crowd when he recently addressed a packed Donald Trump rally in his home state – a gathering that had focused on promoting the baseless lie that Trump had been cheated out of a second term as president.",
    "author": "Sergio Olmos",
    "title": "‘The most dangerous man in Congress’: how Paul Gosar became a darling of the far right"
  },
  {
    "id": 3613,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 3619,
    "mediaId": 2512,
    "date": "2022-01-27",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> of Arizona speaking at the 2018 Arizona Manufacturing Summit, hosted by the Arizona Manufacturing Council and the Arizona Chamber of Commerce & Industry at the Renaissance Downtown Hotel in Phoenix, Gage Skidmore.",
    "author": "Meaghan Ellis",
    "title": "How Paul Gosar emerged as a far-right favorite and subsequently the 'most dangerous man in Congress’"
  },
  {
    "id": 3833,
    "mediaId": 2664,
    "date": "2022-01-27",
    "sentence": "Over the last two years, Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) has emerged as a heavy favorite among far-right conservatives.",
    "author": "Meaghan Ellis",
    "title": "How Paul Gosar emerged as a far-right favorite and subsequently the 'most dangerous man in Congress’"
  },
  {
    "id": 3327,
    "mediaId": 2676,
    "date": "2022-01-28",
    "sentence": "Over the last two years, Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) has emerged as a heavy favorite among far-right conservatives.",
    "author": "Meaghan Ellis",
    "title": "How Paul Gosar emerged as a far-right favorite and subsequently the \"most dangerous man in Congress\""
  },
  {
    "id": 196,
    "mediaId": 2594,
    "date": "2022-02-20",
    "sentence": "Representative <span class='selected-term'>Paul Gosar</span>, who was censured by Congress after he tweeted an anime video of a character with his head cutting off the head of a character of Representative Alexandria Ocasio-Cortez’s face, also announced he would be on it.",
    "author": "Eric Garcia",
    "title": "MAGA allies Marjorie Taylor Greene and Matt Gaetz line up for Trump’s new social network ahead of launch"
  },
  {
    "id": 93,
    "mediaId": 2594,
    "date": "2022-02-23",
    "sentence": "The signatories include Democratic Reps Alexandria Ocasio-Cortez and Cori Bush alongside Trump-allied GOP representatives including Matt Gaetz and <span class='selected-term'>Paul Gosar</span> as well as independent lawmakers like Ilhan Omar.",
    "author": "Sravasti Dasgupta",
    "title": "Dozens of lawmakers including AOC and Matt Gaetz ask Biden to seek Congress approval to send troops to Ukraine"
  },
  {
    "id": 68,
    "mediaId": 8475,
    "date": "2022-02-24",
    "sentence": "Nearly 50 lawmakers signed the DeFazio-Davidson letter, including Democrat Cori Bush of Missouri, Rashida Tlaib of Michigan, Raúl Grijalva of Arizona, Darren Soto of Florida, Ilhan Omar of Minnesota, Earl Blumenauer of Oregon and Mark Pocan and Gwen Moore of Wisconsin, along with Republicans Matt Gaetz, Bill Posey and Kat Cammack of Florida, Matt Rosendale of Montana, Yvette Herrell of New Mexico, Andy Biggs, David Schweikert and <span class='selected-term'>Paul Gosar</span> of Arizona, Peter Meijer of Michigan, Jeff Fortenberry of Nebraska and Ben Cline and Morgan Griffith of Virginia, among others.",
    "author": "Ariana Figueroa",
    "title": "Before any U.S. troops are sent to Ukraine, some in Congress want a say"
  },
  {
    "id": 12762,
    "mediaId": 2594,
    "date": "2022-03-02",
    "sentence": "The resolution approved by the House says it “stands steadfastly, staunchly, proudly and fervently behind the Ukrainian people in their fight against the authoritarian Putin regime.”\nIt calls for an immediate cease-fire and the removal of Russian forces from Ukraine, pledges U.S. support for the Ukrainian resistance and vows to provide “significant additional aid and humanitarian relief to Ukrainian refugees fleeing Russia’s aggression.”\nAll but three members of the House voted for the resolution: Republican Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana.",
    "author": "Via AP news wire",
    "title": "US House 'staunchly, proudly' passes resolution for Ukraine"
  },
  {
    "id": 12943,
    "mediaId": 2572,
    "date": "2022-03-03",
    "sentence": "Reps. Thomas Massie, R-Ky., Matt Rosendale, R-Mont., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., all voted nay.",
    "author": "",
    "title": "Mixed messages from Congress at State of the Union address on Ukraine, COVID-19"
  },
  {
    "id": 12802,
    "mediaId": 2746,
    "date": "2022-03-06",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> was among the first members of Congress to be touched by the coronavirus, announcing on March 8, 2020, that he would go into quarantine after coming in contact with an infected person at the Conservative Political Action Conference.",
    "author": "Seth McLaughlin",
    "title": "Red districts top COVID-19 death charts"
  },
  {
    "id": 15312,
    "mediaId": 8416,
    "date": "2022-03-10",
    "sentence": "Congressman <span class='selected-term'>Paul Gosar</span>, D.D.S.",
    "author": "Congressman Dr. Paul Gosar",
    "title": "Congressman Gosar Votes Against Out-of-Control Spending"
  },
  {
    "id": 13432,
    "mediaId": 8475,
    "date": "2022-03-16",
    "sentence": "Seventeen Republican members of Congress, including Arizona’s Andy Biggs and <span class='selected-term'>Paul Gosar</span>, have sued the U.S. Centers for Disease Control and Prevention, seeking an end to the federal rule requiring passengers on commercial flights and in airports to wear masks.",
    "author": "Jacob Fischler",
    "title": "Republicans in Congress file suit to end mask mandate for air travel"
  },
  {
    "id": 10744,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "Other far-right members could also skip the event: Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> both recently attended an event hosted by a white nationalist where guests broke into a chant of “Putin!",
    "author": "John Bowden",
    "title": "Six things to watch for when Ukraine’s president Zelensky addresses Congress"
  },
  {
    "id": 8990,
    "mediaId": 2520,
    "date": "2022-03-30",
    "sentence": "Republican Reps. Andy Biggs and <span class='selected-term'>Paul Gosar</span> of Arizona voted against the measure, which the House of Representatives passed Tuesday on a 349-63 vote.",
    "author": "Cami Parrish",
    "title": "Congress OKs Sandra Day O'Connor, Ruth Bader Ginsburg statues at US Capitol"
  },
  {
    "id": 7358,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Now Reps. Andy Biggs (R-AZ) and <span class='selected-term'>Paul Gosar</span> (R-AZ) are getting the same challenge.",
    "author": "Sarah K. Burris",
    "title": "Two more GOP ‘insurrectionists’ face ballot challenges as voters seek to disqualify them from office"
  },
  {
    "id": 7734,
    "mediaId": 2528,
    "date": "2022-04-08",
    "sentence": "Alexander previously said that Republican Reps. Andy Biggs, Mo Brooks, and <span class='selected-term'>Paul Gosar</span> helped him plan the January 6 rally.",
    "author": "Erin Snodgrass",
    "title": "'Stop the Steal' organizer agrees to cooperate with the Justice Department's Capitol riot investigation"
  },
  {
    "id": 7325,
    "mediaId": 2547,
    "date": "2022-04-09",
    "sentence": "That could be bad news for MAGA Reps. <span class='selected-term'>Paul Gosar</span>, Andy Biggs and Mo Brooks.",
    "author": "NewsHound Ellen",
    "title": "‘Stop The Steal’s’ Ali Alexander Flips?"
  },
  {
    "id": 5347,
    "mediaId": 2557,
    "date": "2022-04-17",
    "sentence": "Host Chuck Todd posed the question, “Lauren Boebert, and Marjorie Taylor Green, and <span class='selected-term'>Paul Gosar</span>, is that a different element than you’ve ever seen before?”\nUpton replied, “I don’t think we’ve had as many folks in that sort of wing of the party elected as we have before, but I think they’re very popular back at home.”\nTodd then pressed Upton to explain his answer further.",
    "author": "DML News App",
    "title": "VIDEO: GOP Rep. who voted to impeach Trump warns party in ‘troubled waters’"
  },
  {
    "id": 5189,
    "mediaId": 2664,
    "date": "2022-04-20",
    "sentence": "",
    "author": "Ross Williams",
    "title": "Lawsuit seeking to boot Marjorie Taylor Greene from the ballot is probably 'going nowhere': legal expert"
  },
  {
    "id": 5917,
    "mediaId": 2629,
    "date": "2022-04-21",
    "sentence": "“It is absurd to claim that a sitting member of the United States Congress advocated for the overthrown of the United States government,” said Arizona attorney Alexander Kolodin, who represents Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), whose public support of the insurrection is also well-known, during an April 20 state court hearing in Phoenix where the group’s lawsuit challenging the candidacy of Gosar and two other pro-insurrection candidates was heard.",
    "author": "Steven Rosenfeld",
    "title": "Marjorie Taylor Greene Facing Questions Under Oath Over January 6 Role"
  },
  {
    "id": 5516,
    "mediaId": 6676,
    "date": "2022-04-22",
    "sentence": "Similar challenges have been filed against other Republican lawmakers, including Reps. Andy Biggs (R-Ariz.), <span class='selected-term'>Paul Gosar</span> (R-Ariz.) and Madison Cawthorn (R-N.C.), though a federal judge has blocked the challenge to Cawthorn’s ability to appear on the ballot.",
    "author": "Max Greenwood",
    "title": "Greene rebuffs Jan. 6 criticism during tense hearing"
  }
]