[
  {
    "id": 12838,
    "mediaId": 2528,
    "date": "2022-02-27",
    "sentence": "GOP Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona attended the third-annual America First Political Action Conference in Orlando, which was held Friday and organized by the far-right figure Nick Fuentes.",
    "author": "Connor Perrett",
    "title": "'Morons': Mitt Romney goes after Marjorie Taylor Greene and Paul Gosar for attending conference with white nationalist ties"
  },
  {
    "id": 12968,
    "mediaId": 2547,
    "date": "2022-02-27",
    "sentence": "CNN host Dana Bash asked Romney about a tweet by Liz Cheney, where she slammed Republican leadership for their silence on the matter:\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Heather",
    "title": "Mitt Romney: 'I Have Morons On My Team!'"
  },
  {
    "id": 13298,
    "mediaId": 2607,
    "date": "2022-03-04",
    "sentence": "In a similar abdication, few GOP leaders have been as outspoken and categorical as Romney in castigating Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, who recently shared their madcap musings with an audience of white supremacists in Florida.",
    "author": "Mark Barabak",
    "title": "Romney speaks harshly but honestly about Putin and GOP’s crackpots"
  },
  {
    "id": 8985,
    "mediaId": 3997,
    "date": "2022-03-22",
    "sentence": "An image shared on Instagram purportedly shows a tweet from Republican Arizona Rep. <span class='selected-term'>Paul Gosar</span> about being called a “moron.”\nVerdict: False\nThe tweet has been digitally fabricated.",
    "author": "Hannah Hudnall",
    "title": "FACT CHECK: Did Paul Gosar Send This Tweet About Being Called A ‘Moron’?"
  },
  {
    "id": 9773,
    "mediaId": 2548,
    "date": "2022-03-22",
    "sentence": "An image shared on Instagram purportedly shows a tweet from Republican Arizona Rep. <span class='selected-term'>Paul Gosar</span> about being called a “moron.”\nVerdict: False\nThe tweet has been digitally fabricated.",
    "author": "",
    "title": "FACT CHECK: Did Paul Gosar Send This Tweet About Being Called A ‘Moron’?"
  },
  {
    "id": 7757,
    "mediaId": 2859,
    "date": "2022-04-06",
    "sentence": "Also, Romney referred to Greene and Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz., as “morons” for attending a conference put on by a white supremacist where people cheered for Russian President Vladimir Putin after the invasion of Ukraine.",
    "author": "Dennis Romboy",
    "title": "Mitt Romney’s support of Ketanji Brown Jackson unleashes conservative vitriol"
  }
]