[
  {
    "id": 78,
    "mediaId": 2621,
    "date": "2022-02-25",
    "sentence": "In 2021, Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) of Arizona gave the keynote address.",
    "author": "Michael Luciano",
    "title": "Marjorie Taylor Greene Speaks at White Nationalist Conference Where Crowd Cheers Russia and Host Praises Hitler"
  },
  {
    "id": 158,
    "mediaId": 2664,
    "date": "2022-02-25",
    "sentence": "Biden did the impossible and brought war to Europe,\" said Arizona congressman <span class='selected-term'>Paul Gosar</span>, one of Trump's most loyal backers, who has been accused of ties with white nationalists.",
    "author": "Agence France-Presse",
    "title": "Republicans hammer Biden over Russia's invasion of Ukraine"
  },
  {
    "id": 159,
    "mediaId": 2718,
    "date": "2022-02-26",
    "sentence": "At the Conservative Political Action Conference (CPAC) on Saturday, CBS News’ Robert Costa questioned Greene about her surprise appearance at Fuentes’ America First Political Action Conference the previous night alongside Arizona Rep. <span class='selected-term'>Paul Gosar</span>.",
    "author": "Jeremy Fuster",
    "title": "Marjorie Taylor Greene Spoke at a White Supremacist Event – But Says She Wasn’t Aware That’s What It Was"
  },
  {
    "id": 169,
    "mediaId": 2636,
    "date": "2022-02-26",
    "sentence": "Eight miles from CPAC, an even angrier right-wing gathering, the America First Political Action Conference, took place at another Orlando hotel with Representative Marjorie Taylor Greene of Georgia as the main attraction and Representative <span class='selected-term'>Paul Gosar</span> of Arizona appearing by video.",
    "author": "",
    "title": "At CPAC, Ukraine and Policy Take a Back Seat to Cultural Grievances"
  },
  {
    "id": 271,
    "mediaId": 2521,
    "date": "2022-02-26",
    "sentence": "Cheney commented that as “Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Caleb Newton",
    "title": "Kinzinger Hits Marjorie Greene For Headlining White Supremacist Event"
  },
  {
    "id": 489,
    "mediaId": 2643,
    "date": "2022-02-26",
    "sentence": "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\n\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" the Wyoming congresswoman wrote in a Twitter post, including a video of Fuentes' remarks.",
    "author": "Jason Lemon",
    "title": "Cheney Rips GOP Silence Over Greene, Gosar Joining 'White Supremacist' Event"
  },
  {
    "id": 12953,
    "mediaId": 2740,
    "date": "2022-02-26",
    "sentence": "\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Cheney tweeted.",
    "author": "David Jackson",
    "title": "Rep. Marjorie Taylor Greene criticized for speaking at white nationalist conference"
  },
  {
    "id": 12657,
    "mediaId": 2520,
    "date": "2022-02-26",
    "sentence": "\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" Cheney tweeted.",
    "author": "David Jackson",
    "title": "Rep. Marjorie Taylor Greene criticized for speaking at white nationalist conference"
  },
  {
    "id": 12658,
    "mediaId": 2594,
    "date": "2022-02-27",
    "sentence": "Another Republican who herself has faced censure by the national Republican Party for her participation in the January 6 investigation, Liz Cheney, also aimed fire at Ms Greene: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "John Bowden",
    "title": "Romney calls Marjorie Taylor Greene a ‘moron’ as moderates demand party ditch ‘Putin wing of GOP’"
  },
  {
    "id": 12668,
    "mediaId": 2540,
    "date": "2022-02-27",
    "sentence": "The comment from Romney follows criticism from Wyoming Rep. Liz Cheney, a Republican, of Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona for speaking at the America First Political Action Conference that took place in Orlando, Florida and was organized by White nationalist Nick Fuentes.",
    "author": "Chandelis Duster",
    "title": "'I've got morons on my team': Romney blasts fellow GOP members for attending White nationalist event and supporting Putin"
  },
  {
    "id": 12809,
    "mediaId": 2590,
    "date": "2022-02-27",
    "sentence": "It’s, as you’ve indicated, speaking of evil, it’s evil as well,” Romney told CNN’s Dana Bash on “State of the Union.”\nAdvertisement\nHe went on to call out Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) for speaking at the third annual America First Political Action Conference, which was organized by white nationalist figurehead Nick Fuentes in Orlando, Florida.",
    "author": "Nina Golgowski",
    "title": "Sen. Mitt Romney Slams GOP 'Morons' At 'Evil' White Nationalist Conference"
  },
  {
    "id": 12968,
    "mediaId": 2547,
    "date": "2022-02-27",
    "sentence": "CNN host Dana Bash asked Romney about a tweet by Liz Cheney, where she slammed Republican leadership for their silence on the matter:\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Heather",
    "title": "Mitt Romney: 'I Have Morons On My Team!'"
  },
  {
    "id": 13146,
    "mediaId": 2640,
    "date": "2022-02-27",
    "sentence": "GOP Rep. Liz Cheney, who's on the outs with her party, denounced Greene and Arizona Rep. <span class='selected-term'>Paul Gosar</span>, who spoke to the America First meeting virtually.",
    "author": "Bob Cronin",
    "title": "Greene Hears From McDaniel About America First Speech"
  },
  {
    "id": 13033,
    "mediaId": 2614,
    "date": "2022-02-27",
    "sentence": "Yesterday, Cheney tweeted “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist , anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Objectivist Staff",
    "title": "Mitt Romney Bashes “Pro-Russian” Republicans on CNN; “Almost Treasonous”"
  },
  {
    "id": 12995,
    "mediaId": 6598,
    "date": "2022-02-27",
    "sentence": "Sen. Mitt Romney on Sunday likened Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene to \"morons\" and said they were \"missing a few IQ points\" after their participation in a political event led by a white nationalist.",
    "author": "Ronald J. Hansen",
    "title": "'I've got morons on my team': Sen. Mitt Romney hits Reps. Paul Gosar, Marjorie Taylor Greene"
  },
  {
    "id": 17116,
    "mediaId": 2727,
    "date": "2022-02-27",
    "sentence": "Arizona Republican congressman <span class='selected-term'>Paul Gosar</span> also appeared via pre-recorded video.",
    "author": "TOI staff and Agencies",
    "title": "US Rep. Taylor-Greene slammed for addressing white supremacist gathering"
  },
  {
    "id": 13344,
    "mediaId": 2745,
    "date": "2022-02-28",
    "sentence": "He added: “Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> — I don’t know them, but I’m reminded of that old line from the ‘Butch Cassidy and the Sundance Kid’ movie where one character says, ‘Morons.",
    "author": "",
    "title": "McConnell says no space in GOP for ‘white supremacists or anti-Semitism’ after two House Republicans participate in white nationalist’s conference"
  },
  {
    "id": 12976,
    "mediaId": 2643,
    "date": "2022-02-28",
    "sentence": "\"There's no place in the Republican Party for white supremacists or antisemitism,\" McConnell told Politico, when asked to comment on Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>'s attendance at the America First Political Action Conference.",
    "author": "Natalie Colarossi",
    "title": "Mitch McConnell Condemns GOP Members Who Engage With White Nationalists"
  },
  {
    "id": 12971,
    "mediaId": 2593,
    "date": "2022-02-28",
    "sentence": "However, he said, “Standing up for freedom is the right thing to do in America, and anything less than that, in my opinion, is unworthy of American support.”\nRomney’s comments come after Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) spoke at a white nationalist conference.",
    "author": "Bradley Cortright",
    "title": "'Almost Treasonous': Romney Denounces 'Pro-Putin Sentiment' Among Some Republicans"
  },
  {
    "id": 12673,
    "mediaId": 2551,
    "date": "2022-02-28",
    "sentence": "McCarthy, R-Calif., said he plans to speak with the Georgia Republican and Rep. <span class='selected-term'>Paul Gosar</span>, who spoke at the event last year and appeared this year in a 30-second pre-recorded video.",
    "author": "Morgan Phillips",
    "title": "'Appalling and wrong': Mitch McConnell and Kevin McCarthy slam Marjorie Taylor Greene for appearing alongside white supremacist"
  },
  {
    "id": 12630,
    "mediaId": 2745,
    "date": "2022-02-28",
    "sentence": "He added: “Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> — I don’t know them, but I’m reminded of that old line from the ‘Butch Cassidy and the Sundance Kid’ movie where one character says, ‘Morons.",
    "author": "",
    "title": "McConnell says no space in GOP for ‘white supremacists or anti-Semitism’ after two House Republicans participate in white nationalist’s conference"
  },
  {
    "id": 12495,
    "mediaId": 2550,
    "date": "2022-02-28",
    "sentence": "x\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "",
    "title": "Abbreviated Pundit Roundup: This is the dangerous part (Putin losing)"
  },
  {
    "id": 12491,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "Besides Rogers, other Republicans such as Congressman <span class='selected-term'>Paul Gosar</span> of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "author": "David Neiwert",
    "title": "White nationalists flaunt their traction within Republican Party at annual gathering in Florida"
  },
  {
    "id": 12861,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "Later, after criticism, she feigned ignorance that it was a white supremacist conference — though it received enormous attention last year when GOP Congressman <span class='selected-term'>Paul Gosar</span> of Arizona (who sent a video message this year to the conference) attended and spoke.",
    "author": "",
    "title": "While democracy is under attack in Europe, GOP plots to destroy democracy in America"
  },
  {
    "id": 13127,
    "mediaId": 2688,
    "date": "2022-03-01",
    "sentence": "Kevin McCarthy (R-CA), the House minority leader, also didn’t refer by name to the two members of his caucus who attended the racist conference — Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-GA), the latter of whom also headlined the event last year — when he made a perfunctory comment on the matter Monday.",
    "author": "Matt Shuham",
    "title": "Multiple High-Profile Republicans Spoke At A White Nationalist Conference. Party Leadership Shrugs."
  },
  {
    "id": 12846,
    "mediaId": 2621,
    "date": "2022-03-02",
    "sentence": "Reps. <span class='selected-term'>Paul Gosar</span> (R-AZ), Matt Rosendale (R-MT), and Thomas Massie (R-KY) were the only three members to vote against a resolution that overwhelmingly passed the House of Representatives on Wednesday to condemn Russia over its military invasion of Ukraine.",
    "author": "Jackson Richman",
    "title": "Republicans Paul Gosar, Matt Rosendale, and Thomas Massie Are Sole Votes Against House Resolution Condemning Russia"
  },
  {
    "id": 12469,
    "mediaId": 2572,
    "date": "2022-03-02",
    "sentence": "The three no votes were Republican Reps. Thomas Massie of Kentucky, Matt Rosendale of Montana and <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Marisa Schultz",
    "title": "House passes resolution in support of Ukraine amid 'full-scale' Russian invasion"
  },
  {
    "id": 12637,
    "mediaId": 2557,
    "date": "2022-03-02",
    "sentence": "pic.twitter.com/UTZOeqPzkg\n— Alex Andrade (@RAlexAndradeFL) March 2, 2022\nHouse votes on resolution in support of Ukraine, which includes a warning to that “it will never recognize or support any illegitimate Russian-controlled leader or government installed through the use of force.”\nGOP Reps <span class='selected-term'>Paul Gosar</span>, Tom Massie & Matt Rosendale voted against it.",
    "author": "DML News App",
    "title": "REPORT: House passes resolution backing Ukraine, 3 Republicans vote nay"
  },
  {
    "id": 12615,
    "mediaId": 6656,
    "date": "2022-03-02",
    "sentence": "Out of 429 voting members, three lawmakers -- all Republicans -- voted against affirming the resolution on Wednesday: Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana.",
    "author": "Calley Hair",
    "title": "U.S. House passes resolution declaring support for Ukraine"
  },
  {
    "id": 12762,
    "mediaId": 2594,
    "date": "2022-03-02",
    "sentence": "The resolution approved by the House says it “stands steadfastly, staunchly, proudly and fervently behind the Ukrainian people in their fight against the authoritarian Putin regime.”\nIt calls for an immediate cease-fire and the removal of Russian forces from Ukraine, pledges U.S. support for the Ukrainian resistance and vows to provide “significant additional aid and humanitarian relief to Ukrainian refugees fleeing Russia’s aggression.”\nAll but three members of the House voted for the resolution: Republican Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana.",
    "author": "Via AP news wire",
    "title": "US House 'staunchly, proudly' passes resolution for Ukraine"
  },
  {
    "id": 12737,
    "mediaId": 2520,
    "date": "2022-03-02",
    "sentence": "If supremacists are still in the party ...\nRepublican Senate Minority Leader Mitch McConnell, in condemning Arizona’s Rep. <span class='selected-term'>Paul Gosar</span> and Georgia Rep. Marjorie Taylor Greene for participating in the America First conference, a haven for racists, white supremacists, anti-Semites and supporters of Russia’s Vladimir Putin, said on Monday that “there’s no place in the Republican Party for white supremacists or antisemitism.”\nThat, sadly, is a lie.",
    "author": "EJ Montini",
    "title": "Big Lie 2.0: White supremacy has no place in the Republican Party"
  },
  {
    "id": 12735,
    "mediaId": 2512,
    "date": "2022-03-02",
    "sentence": "#idpolpic.twitter.com/G3OzspSvik\n— Janice McGeachin (@Janice McGeachin) 1645910035\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Alex Henderson",
    "title": "Idaho newspaper editorial slams state lieutenant governor for embracing the GOP’s 'Putin wing'"
  },
  {
    "id": 12708,
    "mediaId": 2547,
    "date": "2022-03-02",
    "sentence": "Besides Rogers, other Republicans such as Congressman <span class='selected-term'>Paul Gosar</span> of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "author": "David Neiwert",
    "title": "Neo-Nazi Nick Fuentes Is Gloating About Taking Over The GOP"
  },
  {
    "id": 12729,
    "mediaId": 2621,
    "date": "2022-03-02",
    "sentence": "The vote was 426 to three, as Reps. <span class='selected-term'>Paul Gosar</span> (R-AZ), Thomas Massie (R-KY), and Matt Rosendale (R-MT) voted against the measure.",
    "author": "Michael Luciano",
    "title": "Three House Republicans Oppose Resolution Supporting Ukraine in 426-3 Vote"
  },
  {
    "id": 12716,
    "mediaId": 2520,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> was one of three members of the House of Representatives on Wednesday to vote against a symbolic measure calling for a cease-fire in Ukraine and support for its people.",
    "author": "Ronald J. Hansen",
    "title": "Rep. Paul Gosar is 1 of 3 to vote against pro-Ukraine measure"
  },
  {
    "id": 12702,
    "mediaId": 2641,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz.\nSen. Lindsey Graham, R-S.C., was also introducing a resolution in the Senate that would back Ukraine's claim in international court that Putin and his \"cronies\" have committed war crimes.",
    "author": "Eric Mack",
    "title": "House Passes Resolution to Support for Ukraine 426-3"
  },
  {
    "id": 12506,
    "mediaId": 2550,
    "date": "2022-03-03",
    "sentence": "https://t.co/0OXQ8wQVqo\n— Rep. <span class='selected-term'>Paul Gosar</span>, DDS (@RepGosar) March 2, 2022\nRosendale has been silent, but in view of the Ukraine resolution’s lines about assisting refugees, it’s worth noting that he vocally opposed the resettlement of 75 Afghan refugees in Montana.",
    "author": "Laura Clawson",
    "title": "Three Republicans voted against supporting Ukraine, and it's surprisingly hard to guess which"
  },
  {
    "id": 13046,
    "mediaId": 2629,
    "date": "2022-03-03",
    "sentence": "The three no votes came from Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky, and Matt Rosendale of Montana.",
    "author": "Laura Clawson",
    "title": "Three MAGA Republicans Vote No On Resolution Backing Ukraine"
  },
  {
    "id": 13298,
    "mediaId": 2607,
    "date": "2022-03-04",
    "sentence": "In a similar abdication, few GOP leaders have been as outspoken and categorical as Romney in castigating Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, who recently shared their madcap musings with an audience of white supremacists in Florida.",
    "author": "Mark Barabak",
    "title": "Romney speaks harshly but honestly about Putin and GOP’s crackpots"
  },
  {
    "id": 12887,
    "mediaId": 2644,
    "date": "2022-03-04",
    "sentence": "“Or is that only for Representatives who tweet cartoons or had a spicy Facebook post before they were an elected official?” added Kent, referring to House disciplinary actions taken against Greene and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.).",
    "author": "Callie Patteson",
    "title": "Lindsey Graham doubles down on call for Vladimir Putin’s assassination"
  },
  {
    "id": 12872,
    "mediaId": 2520,
    "date": "2022-03-04",
    "sentence": "Arizona’s nutty Republican Rep. <span class='selected-term'>Paul Gosar</span> would be a ranking member.",
    "author": "EJ Montini",
    "title": "Tucker Carlson and Fox News have played the part of Putin's 'Tokyo Rose'"
  },
  {
    "id": 12510,
    "mediaId": 2550,
    "date": "2022-03-04",
    "sentence": "— Adam Kinzinger (@AdamKinzinger) March 2, 2022\nx\nDear Gosar, Rosendale, and Massie, you are not anti-war: https://t.co/U0XK7Szp9N\n— Adam Kinzinger (@AdamKinzinger) March 2, 2022\nx\n<span class='selected-term'>Paul Gosar</span> joins with two other Republicans to vote no on a resolution supporting the people of Ukraine pic.twitter.com/7WZM4CFyuz\n— Acyn (@Acyn) March 2, 2022\nx\nFascist pro-Putin MAGA traitors Paul Gosar, Thomas Massie, & Matt Rosendale just voted against a resolution to help the people of Ukraine.",
    "author": "",
    "title": "Disgust abounds after three House Republicans vote no on resolution supporting Ukraine"
  },
  {
    "id": 12718,
    "mediaId": 2550,
    "date": "2022-03-05",
    "sentence": "“In the end, America pulled away from the cliff, but this rally is a reminder that things didn’t have to work out that way.”\nI thought about that night at Madison Square Garden this weekend, as Republican lawmakers Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> attended a white nationalist rally in Orlando, Florida, staged as a competitor to the slightly less batshit Conservative Political Action Committee, or CPAC.",
    "author": "",
    "title": "Democrats can’t be shy about rallying for democracy"
  },
  {
    "id": 12848,
    "mediaId": 2584,
    "date": "2022-03-05",
    "sentence": "The Arizona congressman <span class='selected-term'>Paul Gosar</span> made a video address.",
    "author": "Sergio Olmos",
    "title": "‘Key to white survival’: how Putin has morphed into a far-right savior"
  },
  {
    "id": 13258,
    "mediaId": 2634,
    "date": "2022-03-05",
    "sentence": "“In the end, America pulled away from the cliff, but this rally is a reminder that things didn’t have to work out that way.”\nI thought about that night at Madison Square Garden this weekend, as Republican lawmakers Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> attended a white nationalist rally in Orlando, Florida, staged as a competitor to the slightly less batshit Conservative Political Action Committee, or CPAC.",
    "author": "Jason Linkins",
    "title": "Democrats Can’t Be Shy About Rallying for Democracy"
  },
  {
    "id": 12585,
    "mediaId": 2512,
    "date": "2022-03-07",
    "sentence": "He recently promised that he's going to have a talk with Reps. Marjorie Taylor Greene (R-GA.) and and <span class='selected-term'>Paul Gosar</span> (R-AZ) about their \"appalling\" decision to speak at a conference organized by a far-right fringe figure and self-proclaimed white nationalist Nick Fuentes.",
    "author": "Timothy Evans",
    "title": "'I want them to shut up': Republicans angry Kevin McCarthy is impotent in dealing with GOP extremism"
  },
  {
    "id": 10732,
    "mediaId": 2550,
    "date": "2022-03-07",
    "sentence": "That’s the same conference where Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> also spoke, prompting Republican Sen. Mitt Romney to call them “morons.”\nHere’s the complete video of Putin’s bizarre event.",
    "author": "Charles Jay\nCommunity",
    "title": "may idolize Vlad, but the feeling isn't mutual"
  },
  {
    "id": 11497,
    "mediaId": 2594,
    "date": "2022-03-08",
    "sentence": "While some members of the Republican Party like Sen Ted Cruz have claimed that “[t]he reason that Russia is invading Ukraine is because of enormous mistakes that the Biden administration has made”, other members like Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> attended a conference billed as a far-right alternative to the Conservative Political Action Conference (CPAC) last month where the event’s host quipped that comparisons of Vladimir Putin to Adolf Hitler could be complimentary, and members of the crowd chanted Mr Putin’s name.",
    "author": "John Bowden",
    "title": "Trump attacks Biden with Ukraine abuse, claims Europe is using him"
  },
  {
    "id": 11406,
    "mediaId": 2629,
    "date": "2022-03-08",
    "sentence": "However, the House Freedom Caucus — a group of the most far-right members of the House, including Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) — wants to delay passage of the aid, urging \"a collective resolve among Republicans\" to \"not pass a government funding bill that includes aid to Ukraine or for COVID-19 relief efforts.\"",
    "author": "Emily Singer",
    "title": "Far-Right House ‘Freedom’ Caucus Seeks To Delay Aid To Ukraine"
  },
  {
    "id": 10800,
    "mediaId": 2573,
    "date": "2022-03-08",
    "sentence": "And I want to give my colleagues Matt Rosendale and <span class='selected-term'>Paul Gosar</span> a chance to be harangued as well, because they were the only who joined me in voting this way.",
    "author": "",
    "title": "'The Ingraham Angle' on humanitarian crisis in Ukraine"
  },
  {
    "id": 10899,
    "mediaId": 2594,
    "date": "2022-03-09",
    "sentence": "Speaking at a news conference on Wednesday, Mr McCarthy confirmed to reporters that Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> still had avenues to returning to active roles on House panels even after they were both publicly chastised for attending an event billed as a far-right alternative to the Conservative Political Action Conference (CPAC) hosted by a semi-famous white nationalist, Nick Fuentes.",
    "author": "John Bowden",
    "title": "Kevin McCarthy dodges question on repercussions for Marjorie Taylor Greene again"
  },
  {
    "id": 11132,
    "mediaId": 2664,
    "date": "2022-03-09",
    "sentence": "The antidemocratic right rejects equality and pluralism in favor of a hierarchical society where certain groups hold more power, and Fox News broadcaster Tucker Carlson and Republican lawmakers such as Reps. Matt Gaetz (R-FL) and <span class='selected-term'>Paul Gosar</span> (R-AZ) openly promote the white nationalist \"great replacement\" myth to stoke violent anger against racial, religious and sexual minorities.",
    "author": "Travis Gettys",
    "title": "Hate group membership continues dropping as right-wing extremism goes mainstream"
  },
  {
    "id": 11556,
    "mediaId": 2607,
    "date": "2022-03-09",
    "sentence": "House Republican leader Kevin McCarthy waited days before castigating Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona — who once sought to create a whites-only congressional caucus — for speaking to a white supremacist gathering in Florida.",
    "author": "Mark Barabak",
    "title": "Dealing with extremists, some GOP leaders find sorry is the hardest word"
  },
  {
    "id": 11193,
    "mediaId": 5308,
    "date": "2022-03-10",
    "sentence": "While Republican congressional leaders condemned the invasion, Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene both spoke at a white nationalist conference last month whose organizer favorably compared Russian President Vladimir Putin to Adolf Hitler.",
    "author": "Paul Blest",
    "title": "GOP Rep. Madison Cawthorn Called President Zelenskyy a ‘Thug’"
  },
  {
    "id": 11042,
    "mediaId": 2664,
    "date": "2022-03-10",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), a recent speaker to a group of white supremacists who cheered Vladimir Putin, echoed the demand for Ukraine to take care of itself while Washington deals with the border.",
    "author": "Sarah K. Burris",
    "title": "A group of Republicans is still trying to stop aid to Ukraine"
  },
  {
    "id": 10746,
    "mediaId": 2550,
    "date": "2022-03-10",
    "sentence": "There were just three votes against that resolution of support: Massie, <span class='selected-term'>Paul Gosar</span>, and Matt Rosendale.",
    "author": "Mark Sumner",
    "title": "Ukraine update: 'R' is for Russia"
  },
  {
    "id": 10728,
    "mediaId": 2550,
    "date": "2022-03-10",
    "sentence": "After Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> spoke at the America First Political Action Conference, it took McCarthy 10 days to get around to having a chat with Greene.",
    "author": "Laura Clawson",
    "title": "Greene and Gosar won't face punishment for speaking at white nationalist event"
  },
  {
    "id": 11041,
    "mediaId": 2564,
    "date": "2022-03-13",
    "sentence": "Even after the invasion, two Trump allies in the House - Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> - participated in a white nationalist conference at which participants applauded Russia's move on Ukraine and chanted Putin's name.",
    "author": "",
    "title": "American governor hopeful Kari Lake labels 60 Minutes journalist Liam Bartlett a JOKE"
  },
  {
    "id": 11190,
    "mediaId": 2592,
    "date": "2022-03-13",
    "sentence": "Even after the invasion, two Trump allies in the House - Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> - participated in a white nationalist conference at which participants applauded Russia's move on Ukraine and chanted Putin's name.",
    "author": "David Morgan",
    "title": "Ukraine War Becomes A Cudgel In Republican Party's Internal Conflict"
  },
  {
    "id": 10784,
    "mediaId": 2664,
    "date": "2022-03-16",
    "sentence": "Fuentes hosted a white nationalism conference in February that was attended by Rep. Marjorie Taylor Greene (R-GA), Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), Arizona state Sen. Wendy Rogers, and Janice McGreachin, Idaho's GOP lieutenant governor.",
    "author": "Bob Brigham",
    "title": "White nationalist praises ‘Czar’ Putin and Russian troops invading Ukraine: ‘The pride of Moscow’"
  },
  {
    "id": 11301,
    "mediaId": 2528,
    "date": "2022-03-16",
    "sentence": "Republican Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> made appearances at the event, prompting condemnation from other party members.",
    "author": "Kelsey Vlamis",
    "title": "White nationalist Nick Fuentes praised Putin for trying to 'liberate Ukraine' 2 weeks after GOP lawmakers attended an event he hosted"
  },
  {
    "id": 10744,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "Other far-right members could also skip the event: Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> both recently attended an event hosted by a white nationalist where guests broke into a chant of “Putin!",
    "author": "John Bowden",
    "title": "Six things to watch for when Ukraine’s president Zelensky addresses Congress"
  },
  {
    "id": 11377,
    "mediaId": 2520,
    "date": "2022-03-17",
    "sentence": "(Arizona’s nutty Republican Rep. <span class='selected-term'>Paul Gosar</span> would be a ranking member.",
    "author": "EJ Montini",
    "title": "Russia gives Fox's Tucker Carlson a standing ovation and an Iron Curtain call"
  },
  {
    "id": 11496,
    "mediaId": 2637,
    "date": "2022-03-18",
    "sentence": "Representatives Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> participated in a white nationalist conference last month where participants applauded Russia and chanted Putin’s name.",
    "author": "",
    "title": "Top U.S. House Republican slams party hardliner over Zelenskiy 'thug' comment"
  },
  {
    "id": 9740,
    "mediaId": 2810,
    "date": "2022-03-28",
    "sentence": "Led by influential figures such as Tucker Carlson, who hosts the most widely viewed show on cable news, and politicians such as Josh Hawley, Matt Gaetz, <span class='selected-term'>Paul Gosar</span>, and Marjorie Taylor Greene—many of whom have embraced outright white nationalists—this MAGA wing of the conservative movement is on the rise, and is determined to remake the GOP in its own image, including around foreign policy.",
    "author": "Tobita Chow",
    "title": "Tucker Carlson’s Flip-Flops on Russia Mask a Deep Militarism"
  },
  {
    "id": 8899,
    "mediaId": 2573,
    "date": "2022-03-30",
    "sentence": "Case in point: Rep. <span class='selected-term'>Paul Gosar</span> last fall posted an animated video of him killing AOC–the ultimate takedown fantasy.",
    "author": "Howard Kurtz | Fox News",
    "title": "American Slapfest: How Will Smith reflects a smackdown culture"
  },
  {
    "id": 7782,
    "mediaId": 2699,
    "date": "2022-03-31",
    "sentence": "Yet another Freedom Caucus member, Rep. <span class='selected-term'>Paul Gosar</span>, has emerged essentially unscathed after speaking at a white supremacist conference and posting a violent anime depicting the murder of Rep. Alexandria Ocasio-Cortez.",
    "author": "Wajahat Ali",
    "title": "The GOP Was Hard to Embarrass. Then Came Madison Cawthorn."
  },
  {
    "id": 7657,
    "mediaId": 2629,
    "date": "2022-04-04",
    "sentence": "In 2019, Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) called Orban a \"patriot\" who \"demonstrates the values of Western civilization and democracy, sovereignty, and self-determination.\"",
    "author": "Emily Singer",
    "title": "Greene Praises Authoritarian Orban After Election Win In Hungary"
  },
  {
    "id": 7078,
    "mediaId": 2594,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Andrew Naughtie",
    "title": "Biden news: President calls Putin’s war on Ukraine ‘genocide’ in Iowa remarks on gas price"
  },
  {
    "id": 5319,
    "mediaId": 2550,
    "date": "2022-04-09",
    "sentence": "Arizona Rep. <span class='selected-term'>Paul Gosar</span>, whom God created to conclusively disprove white supremacy, is trying to explain away his video appearance at shrieking anti-Semite Nick Fuentes’ white power-palooza carnival in February, and that explanation is just as craven as you might imagine.",
    "author": "",
    "title": "Paul Gosar explains yet another appearance at a white nationalist conference by blaming his staff"
  },
  {
    "id": 6056,
    "mediaId": 2629,
    "date": "2022-04-10",
    "sentence": "By contrast, Democrats have utterly failed to elevate the profiles of sinister figures like Reps. <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene, Madison Cawthorn or Lauren Boebert.",
    "author": "",
    "title": "Democrats Need To Get Better At Politics, And Fast"
  },
  {
    "id": 5434,
    "mediaId": 2662,
    "date": "2022-04-16",
    "sentence": "Representatives Madison Cawthorn of North Carolina, Marjorie Taylor Greene of Georgia, and, as of last week, Andy Biggs and <span class='selected-term'>Paul Gosar</span> from Arizona, from running for re-election.",
    "author": "Joe Hoft",
    "title": "Barbara Boyd: It Looks Like the War Will Come Home for the Midterms"
  }
]