[
  {
    "id": 12890,
    "mediaId": 2540,
    "date": "2022-02-28",
    "sentence": "Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona received criticism for speaking at the America First Political Action Conference in Orlando, Florida.",
    "author": "Alexandra Meeks",
    "title": "5 things to know for Feb. 28: Ukraine, EPA, Covid-19, State of the Union, North Korea"
  },
  {
    "id": 12950,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "Nationally, several prominent Republicans took aim at two GOP members of Congress who spoke at AFPAC, Arizona’s <span class='selected-term'>Paul Gosar</span> and Georgia’s Marjorie Taylor Greene.",
    "author": "Jeremy Duda",
    "title": "Trump-loving lawmaker threatens to 'destroy' any Republican who tries to punish her for attending white nationalist conference"
  },
  {
    "id": 11497,
    "mediaId": 2594,
    "date": "2022-03-08",
    "sentence": "While some members of the Republican Party like Sen Ted Cruz have claimed that “[t]he reason that Russia is invading Ukraine is because of enormous mistakes that the Biden administration has made”, other members like Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> attended a conference billed as a far-right alternative to the Conservative Political Action Conference (CPAC) last month where the event’s host quipped that comparisons of Vladimir Putin to Adolf Hitler could be complimentary, and members of the crowd chanted Mr Putin’s name.",
    "author": "John Bowden",
    "title": "Trump attacks Biden with Ukraine abuse, claims Europe is using him"
  },
  {
    "id": 11193,
    "mediaId": 5308,
    "date": "2022-03-10",
    "sentence": "While Republican congressional leaders condemned the invasion, Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene both spoke at a white nationalist conference last month whose organizer favorably compared Russian President Vladimir Putin to Adolf Hitler.",
    "author": "Paul Blest",
    "title": "GOP Rep. Madison Cawthorn Called President Zelenskyy a ‘Thug’"
  },
  {
    "id": 15534,
    "mediaId": 8345,
    "date": "2022-03-12",
    "sentence": "Daniel Wood letter: A couple of questions for <span class='selected-term'>Paul Gosar</span> – Daniel Wood wants Gosar to answer a few questions.",
    "author": "",
    "title": "Rants and Raves | March 13, 2022"
  },
  {
    "id": 11190,
    "mediaId": 2592,
    "date": "2022-03-13",
    "sentence": "Even after the invasion, two Trump allies in the House - Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> - participated in a white nationalist conference at which participants applauded Russia's move on Ukraine and chanted Putin's name.",
    "author": "David Morgan",
    "title": "Ukraine War Becomes A Cudgel In Republican Party's Internal Conflict"
  },
  {
    "id": 10744,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "Other far-right members could also skip the event: Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> both recently attended an event hosted by a white nationalist where guests broke into a chant of “Putin!",
    "author": "John Bowden",
    "title": "Six things to watch for when Ukraine’s president Zelensky addresses Congress"
  },
  {
    "id": 11496,
    "mediaId": 2637,
    "date": "2022-03-18",
    "sentence": "Representatives Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> participated in a white nationalist conference last month where participants applauded Russia and chanted Putin’s name.",
    "author": "",
    "title": "Top U.S. House Republican slams party hardliner over Zelenskiy 'thug' comment"
  },
  {
    "id": 9226,
    "mediaId": 8484,
    "date": "2022-03-24",
    "sentence": "+6\nView gallery\nA spokesperson for Republican Rep. Liz Cheney slammed the House's GOP Leader Kevin McCarthy for endorsing Cheney's primary challenger instead of condemning the right-wing members of his party\n+6\nView gallery\nCheney shared Adler's statement in a tweet and linked it to the CNN story it appeared in that called McCarthy's endorsement of Harriet Hageman, Cheney's Trump-backed GOP challenger, a 'special case'\nThe story notes that McCarthy has backed only one primary challenger ahead of the 2022 midterms - that of Cheney's - and not anyone trying to take out controversial Republican members including Reps. Marjorie Taylor Greene or <span class='selected-term'>Paul Gosar</span>.",
    "author": "Nikki Schwab",
    "title": "Cheney knocks McCarthy for backing her rival but not those of 'pro-Putin' lawmakers"
  },
  {
    "id": 7807,
    "mediaId": 2688,
    "date": "2022-03-31",
    "sentence": "Republicans’ outrage over Cawthorn’s Veep-esque account of congressional indiscretions stands in glaring contrast to their muted response to Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) speaking at a white nationalist conference last month.",
    "author": "Matt Shuham",
    "title": "North Carolina Sen. Tillis Backs Cawthorn’s Rival Amid Orgy-Gate"
  },
  {
    "id": 7782,
    "mediaId": 2699,
    "date": "2022-03-31",
    "sentence": "Yet another Freedom Caucus member, Rep. <span class='selected-term'>Paul Gosar</span>, has emerged essentially unscathed after speaking at a white supremacist conference and posting a violent anime depicting the murder of Rep. Alexandria Ocasio-Cortez.",
    "author": "Wajahat Ali",
    "title": "The GOP Was Hard to Embarrass. Then Came Madison Cawthorn."
  },
  {
    "id": 7635,
    "mediaId": 2676,
    "date": "2022-04-06",
    "sentence": "Only three Republicans declined to support it: Matt Rosendale, R-Mt., Thomas Massie, R- Ky., and <span class='selected-term'>Paul Gosar</span>, R-Az.",
    "author": "Heather Digby Parton",
    "title": "Trump's trashing of Ukraine pays off for Russia: Republicans vote to reject NATO — and democracy"
  }
]