{
  "id": 1021,
  "mediaId": 2676,
  "date": "2022-02-17",
  "headline": "Disgraced pizza mogul \"Papa John\" Schnatter to speak at CPAC",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/02/papa-john-schnatter-0217221.jpg",
  "link": "https://www.salon.com/2022/02/17/disgraced-pizza-mogul-papa-john-schnatter-to-speak-at-cpac/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashlie D. Stevens",
  "authorUrl": "https://www.salon.com/writer/ashlie_d_stevens",
  "termIds": [
    0
  ],
  "sentences": [
    "Since being booted from the company, Schnatter's public image has been in a bizarre tailspin — like when he announced in particularly sweaty interview that he had eaten 40 of his own pizzas in 30 days and felt the quality had dropped — though he has found an eager audience among right-wing conservatives who view him as a capitalist pioneer who had been unfairly ousted from the company he built for speaking his mind.",
    "Schnatter founded Papa John's Pizza in 1984 and remained the chief executive officer until January 2018, when the National Football League (NFL) terminated its business affiliation with the company following comments Schnatter made accusing the league of not doing enough to stop players from kneeling during the national anthem.",
    "Schnatter remained involved with the company as the chairman of the board of directors until July 2018, when it was revealed that he had used the \"n-word\" during a sensitivity training, claiming, without evidence, that Colonel Harland Sanders, the founder of Kentucky Fried Chicken, had used the slur without repercussion.",
    "RELATED: Papa John's founder now claims that he was set up — and vows \"the day of reckoning will come\"\n\"The controversy is polarizing the customer, polarizing the country,\" Schnatter said during a conference call about the company's earnings, according to the Chicago Tribune.",
    "In a 2021 interview with One America News Network, a far-right and pro-Trump cable channel, Schnatter indicated that he had spent the last 20 months attempting to remove the \"n-word\" from his vocabulary, while also saying that he wanted to \"get on with [his] life.\"",
    "On Thursday, Matt Schlapp, the chairman of the American Conservative Union, tweeted that disgraced pizza mogul \"Papa John\" Schnatter had been confirmed as a speaker at next week's Conservative Political Action Conference or CPAC.",
    "\"It was a social strategy and media planning and training and I repeated something that somebody else said and said, 'We're not going to say that, We don't use that kind of language or vocabulary.'",
    "According to Business Insider, in 2012, Schnatter came under fire \"for saying that the Affordable Care Act could be 'lose-lose' for Papa John's franchisees and employees.",
    "In a 2018 interview with San Francisco news station KRON 4, Schnatter blamed the company's marketing agency, who was present on the call, for overblowing the story.",
    "As Salon's Igor Derysh wrote in 2019: \"After his resignation, the company removed his image from all promotional materials and the Papa John's logo.",
    "Schnatter also donated $1,000 to former president Donald Trump's campaign, but did not make any effort to publicly support the politician.",
    "This came after an earlier interview with a Louisville news station during which he ominously said that a \"day of reckoning was coming.\"",
    "Schnatter then tried to mount a comeback and launched SavePapaJohns.com in an attempt to offer his account of what happened.",
    "The Louisville, Kentucky-based company distanced itself from the group, saying that it did not want them to buy its pizza.",
    "Schnatter argued that Obamacare would cost Papa John's $5-8 million annually and ultimately drive up the price of pizza.\"",
    "Other speakers include: Glenn Beck, Candace Owens, Rep. Jim Jordan, Rep. Madison Cawthorne and Sean Spicer.",
    "Papa John's apologized for those comments two weeks later after white supremacists praised Schnatter.",
    "Papa John's actually had to say it doesn't want to be the official pizza of the \"alt-right\"",
    "And sure, it got taken out of context, and sure it got twisted, but that doesn't matter.\"",
    "The NFL and \"n-word\" fiascos weren't Schnatter's first foray into political controversy.",
    "\"CONFIRMED: @IAmPapaJohn,\" Schlapp wrote about an image displaying a smiling Schnatter.",
    "The two will, however, rub shoulders at CPAC, which is being held in Florida next week.",
    "They took what I said and they ran to Forbes and Forbes printed it and it went viral.\"",
    "He went on to accuse the company's executives of sexual harassment and bigotry.\"",
    "He continued: \"They [the marketing agency] tried to extort us and we held firm.",
    "The caption below his photograph simply read: \"Papa John.\"",
    "Trump is the marquee speaker at the event.",
    "\"It wasn't a slur,\" Schnatter said."
  ]
}