{
  "id": 10247,
  "mediaId": 8288,
  "date": "2022-04-04",
  "headline": "Thanks for the Invite to Your Republican Coke Orgy. I Have Some Questions",
  "image": "",
  "link": "https://www.clevescene.com/news/thanks-for-the-invite-to-your-republican-coke-orgy-i-have-some-questions-38671447",
  "mediaOutlet": "clevescene.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Pete Kotz",
  "authorUrl": "https://www.clevescene.com/author/pete-kotz",
  "termIds": [
    0
  ],
  "sentences": [
    "Yours in getting our freak on,\nBrad\nChairman of the local Ohio County Republican Club\nJoin the Cleveland Scene Press Club\nLocal journalism is information.",
    "I hate to belabor the Cruz thing, but if he steals my AARP card, I’ll pay 10 percent more for my trip to D.C. That’s fiscally irresponsible!",
    "Someone brings a twelver of Keystone, we flip back and forth between Tucker and Pornhub, then everyone calls it a night.",
    "Judging by how he’s always raising holy hell on C-SPAN, I bet he has a sweet connect for Peruvian Marching Powder!",
    "I don’t know about you, but a man can work up a heaping appetite after horn dogging it with some ag lobbyists!",
    "It does feel like a conflict of interest to orgy with people one day, then have to dog whistle them the next.",
    "Dear Sen. McConnell:\nIt sent my heart atwitter to receive your invitation to the Republican cocaine orgy.",
    "And we believe everyone deserves access to accurate independent coverage of their community and state.",
    "I’ve been cruising the middle school since your letter arrived, but I have yet to find a pusher.",
    "Here at the local County Republican Club, we usually hit Shenanigans for Jaeger bombs first.",
    "Help us keep this coverage going with a one-time donation or an ongoing membership pledge.",
    "You guys seemed pretty adamant about that during the Ketanji Brown Jackson hearings.",
    "I can’t wait to show a selfie of me and you around church!",
    "Or does he host a separate orgy for self-hating gay men?",
    "But he wouldn’t want you stealing the Lord’s thunder!)",
    "To hear Rep. Madison Cawthron tell it, you guys rage!",
    "Is it cool to bring a green bean casserole instead?",
    "Are you worried he cuts his coke with fentanyl?)",
    "But is there a cardio workout you can recommend?",
    "And is 6:30 too late to get to Portman’s house?",
    "The missus was hoping to get some makeup tips!",
    "I’m so excited my wife called an ambulance!",
    "Here in Ohio, our orgies are pretty staid.",
    "I do curls to keep the pipes looking good.",
    "Should I be worried about my performance?",
    "Thanks for indulging my questions, Mitch.",
    "Is there a safe place to keep my wallet?",
    "(I did score an 8 ball of baby formula.",
    "I’m sure yours are far more glamorous!",
    "(I’ll settle for Don Jr. as a backup.",
    "FYI: It doesn’t get you very high.)",
    "Can I do key bumps with Jim Jordan?",
    "What are we looking at for go-time?",
    "Who can afford an ambulance, LOL?!)",
    "He strikes me as a selfish lover.",
    "(Sorry if we can’t go au naturel.",
    "Do I have to orgy with Ted Cruz?",
    "Or does that require a VIP pass?",
    "Will Lindsey Graham be there?",
    "And I have so many questions!",
    "I like to cuddle afterward.",
    "Folks here are so jealous!",
    "I assume it’s whites-only?",
    "Will President Trump show?",
    "Pastor Bob’s a huge fan.",
    "Is it BYOB on the coke?",
    "Information is power.",
    "Do you guys pregame?",
    "(Just kidding.",
    "Do you mind?"
  ]
}