{
  "id": 10762,
  "mediaId": 8301,
  "date": "2022-03-14",
  "headline": "Exclusive: House Republican Leaders Send Letter to Surgeon General over Big Tech Censorship",
  "image": "https://davidicke.com/wp-content/uploads/2020/09/SILICON-FASCISM.jpg",
  "link": "https://davidicke.com/2022/03/14/exclusive-house-republican-leaders-send-letter-to-surgeon-general-over-big-tech-censorship/",
  "mediaOutlet": "davidicke.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Roger Mallett",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“The First Amendment prohibits the government from directly censoring speech it finds objectionable.”\nThe group of Republicans consists of House Energy and Commerce Committee Ranking Member Cathy McMorris Rodgers (R-WA), House Minority Whip and Select Committee on the Coronavirus Crisis Ranking Member Steve Scalise (R-LA), Judiciary Committee Ranking Member Jim Jordan (R-OH), and Oversight and Reform Committee Ranking Member James Comer (R-KY).",
    "“This is the type of behavior we would expect from an authoritarian dictator, not a sitting U.S. President and his Surgeon General.”\nThe group added that Biden administration officials continue to pressure private Big Tech companies to do what the administration is unable to do — censor Americans — expressing that the administration’s intimidation practice, also known as “jawboning,” could be considered unconstitutional behavior.",
    "“The agency’s letters thanked the booksellers for their ‘anticipated cooperation’ and reminded them of the agency’s duty to recommend prosecutions.”\n“The Court found that such behavior amounted to ‘informal censorship’ because the effect of the letters was to intimidate the booksellers into suppressing the sale of the certain books and magazines,” they continued.",
    "“The Court found that such behavior amounted to an unconstitutional ‘scheme of state censorship.’ Here, the Biden Administration appears to be engaged in similar behavior.”\nRead More – Exclusive: House Republican Leaders Send Letter to Surgeon General over Big Tech Censorship",
    "“In Bantam Books v. Sullivan, the Supreme Court held that a government agency violated the First Amendment by sending letters to private booksellers to ‘inform’ them they were selling books and magazines the agency found objectionable,” the lawmakers explained.",
    "“We write with significant concerns that the Biden Administration continues to undermine the First Amendment by pressuring technology companies to censor specific users and certain speech,” the group of Republicans wrote in the letter to Murthy.",
    "“The Biden Administration continues to attack our fundamental right to free speech as they collude with Big Tech to carry out their censorship campaign,” McMorris Rodgers told Breitbart News as part of their reasoning for sending the letter.",
    "Surgeon General Vivek Murthy over growing concern that the Biden administration is pressuring Big Tech to censor Americans online.",
    "A group of House Republican ranking members sent a letter exclusively obtained by Breitbart News to U.S."
  ]
}