{
  "id": 10853,
  "mediaId": 2658,
  "date": "2022-03-07",
  "headline": "Brownstein forms practice to help clients navigate infrastructure law",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/politico-influence/2022/03/07/brownstein-forms-practice-to-help-clients-navigate-infrastructure-law-00014789",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1987,
    4620,
    4591,
    4406,
    3808,
    3755,
    5153,
    5904,
    5735,
    196
  ],
  "sentences": [
    "): Digital Right To Repair Association Dba Right To Repair\nFoley & Lardner LLP: New Fortress Energy Inc.\nHolland & Knight LLP: Aleph Farms Ltd.\nLsn Partners, LLC: Viridi Parente, Inc.\nMarshall & Popp, LLC: Verizon Communications, Inc.\nMcallister & Quinn, LLC: The Margolin Group On Behalf Of County Of Santa Clara\nS-3 Group: Alliance To Modernize Prescribing Information\nS-3 Group: Citizens For Responsible Energy Solutions\nStrategies 360: University Of Alaska\nThe Fiorentino Group: Flagler Health\nVan Scoyoc Associates: Heartland Solutions Group, Inc.\nVelocity Government Relations, LLC: Astra Space Operations, Inc.\nVelocity Government Relations, LLC: Nextgen Aeronautics, Inc.\nVelocity Government Relations, LLC: North Valley Military Institute, Nvmi\nWelsh Rose, LLC: Bluestone Strategies (On Behalf Of Apexhealth)\nWelsh Rose, LLC: Bluestone Strategies (On Behalf Of Kaiser Foundation Health Plans)\nWelsh Rose, LLC: Bluestone Strategies (On Behalf Of Serco Inc.)\nWelsh Rose, LLC: Bluestone Strategies (On Behalf Of Valyrian Smoke LLC)\nNew Lobbying Terminations\nForbes-Tate: American Seafoods Group LLC\nMichael Torrey Associates, LLC: Pivot Bio\nStrategies 360: Service Employees International Union 775 (Seiu 775)\nVolansi, Inc.: Volansi, Inc.",
    "“As you know, with that bill, there's a whole new array of opportunities that I think people are still trying to figure out what it all means, as well as the administration putting together their implementation package.”\n— With the Energy Department in particular tasked with implementing a slew of new programs, and the Transportation Department set to stand up new climate-related programs, Begich said, clients in both the public and private sector have raised questions on issues ranging from who the point person will be on given initiatives to the details of how money for projects will be doled out and how rules or grant requests should be formulated to navigate new and emerging technologies.",
    "New PACs\nCommittee to Defend Freedom (PAC)\nCOMMON SENSE AMERICA ELECTION FUND (Super PAC)\nForging Industry Association Political Action Committee-Forging ForgingPAC (PAC)\nHELLFIRE PAC (Leadership PAC: Wesley Hunt)\nJENerational Change (Super PAC)\nLiberty Gold NJ PAC (PAC)\nNew Lobbying Registrations\nArentfox Schiff LLP (Fka Arent Fox LLP): Infectious Diseases Society Of America\nBgr Government Affairs: Alliance For Regenerative Medicine\nBgr Government Affairs: Vitol Inc.\nDla Piper LLP (US): Iqvia Holdings, Inc.\nEmmer Consulting, Inc. (Formerly Known As Emmer Consulting, P.C.",
    "For that reason, lobbying experts suspect that the same Russian institutions will find representation once again from lobbying shops eager to accept their hefty payments when the sanctions are lifted.”\nANOTHER SANCTION-RELATED TERMINATION: BGR Government Affairs has ended its lobbying work for the real estate and construction firm Dana Holdings Limited, a Cyprus-based company the Biden administration hit with sanctions in August because of its owners’ close ties to Belarus’ strongman, President Alexander Lukashenko, a close Putin ally.",
    "Brownstein forms practice to help clients navigate infrastructure law\nBy CAITLIN OPRYSKO\n03/07/2022 05:15 PM EST\nPresented by\nFIRST IN PI — BROWNSTEIN LAUNCHES PRACTICE TO HELP CLIENTS NAVIGATE INFRASTRUCTURE LAW: K Street’s top lobbying firm is the latest to form a dedicated practice to help clients access the hundreds of billions of dollars in new spending unlocked as a result of last year’s bipartisan infrastructure bill or otherwise navigate and shape the law’s implementation.",
    "We are complying fully with all applicable sanctions, and we continue to closely monitor this rapidly evolving situation.”\nDEMAND JUSTICE’S SCOTUS WAR CHEST: “Progressives are bringing a seven-figure budget and roster of top Democratic talent to their fight to confirm Supreme Court nominee Ketanji Brown Jackson,” reports Axios’ Lachlan Markay, who got a hold of liberal judicial advocacy group Demand Justice’s applications for tax-exempt status.",
    "— The new practice group from Brownstein Hyatt Farber Schreck will be led by Mark Begich, a former senator and Anchorage mayor, and also comprises Brownstein’s Geoff Burr, Marc Lampkin, Doug Friednash, Bill McGrath, Nadeam Elshami, Jon Hrobsky, Steve Demby, Kate Gonzales, Luke Johnson, Jessica Kramer, Sarah Mercer, Bella Wolitz and Jason Buckner, with an emphasis on bipartisanship and experience at various levels and sides of government.",
    "and Virginia Foxx (R-N.C.), to push policies aimed at “address[ing] the retirement anxiety that many workers and retirees have about their ability to accumulate adequate savings to produce sustainable retirement income.”\nJobs Report\n— Wendy Parker Sussman has joined Johnson & Johnson’s global government affairs and policy leadership team as the head of pharmaceuticals for U.S. federal affairs, serving as the primary liaison to PhRMA.",
    "“Even after the annexation of Crimea in 2014 and reports that Russia interfered in the 2016 election, the spigot of Russian money to K Street kept flowing.”\n— “Over the past eight years, firms doing legal, lobbying, and PR work reported payments of roughly $18 million to do work for six Russian entities: Sberbank, Gazprombank, Nord Stream 2 AG, Vnesheconombank, VTB Bank, and the Russian Direct Investment Fund.",
    "— The Biden administration sanctioned Dana Holdings and three subsidiaries, which a Treasury Department announcement described collectively as a “construction empire that has received numerous extraordinary benefits, including gifts of plots of state land in Minsk, through presidential decrees signed by Lukashenka.” BGR reported receiving $300,000 in lobbying fees from the firm for its five months of work.",
    "But for good government advocates, it represents a potentially watershed moment on K Street, while posing a number of key questions: Why did it take sanctions to make the firms drop their clients and, if the administration lifts those sanctions, how long will it be before K Street jumps back in the game?”\n— “K Street firms who benefited from Russian cash over the past decade were not violating any law.",
    "Its IRS filings, which were obtained by the conservative group Americans for Public Trust and shared exclusively with Axios, reveal Demand Justice's internal structure and finances as an independent outfit.”\nFLYING IN (VIRTUALLY): The Insured Retirement Institute, which represents life insurers, broker-dealer firms and asset management companies, kicks off its annual fly-in on Tuesday.",
    "“While Jackson's confirmation is likely, both sides are looking to milk the process for every ounce of political advantage this midterm year.”\n— “Demand Justice has already announced a $1 million ad campaign in support of Jackson and said it's prepared to spend much more,” enabled by a projected budget of “$7.5 million for 2022.",
    "Then, it’s a matter of “‘let's go find the guys that write these things so they have at least some conversation.’ You can't influence the outcome, but … let's make sure they know how this program could or not be implemented properly if they don't write the rules to give the greatest flexibility,” he added.",
    "— White & Case declined to comment on a specific, current or former, client matter, but a spokesperson for the firm said it is reviewing their Russian and Belarusian client representations “and taking steps to exit some representations in accordance with applicable rules of professional responsibility.",
    "Dana Holdings was placed on Treasury’s Specially Designated Nationals list, which blocks people and entities from doing business with American citizens, on Aug. 9, exactly a year after Lukashenko was reelected in a contest the U.S. said was rigged.",
    "K STREET’S LOVE AFFAIR WITH RUSSIA: “Russia’s invasion of Ukraine has done something previous tensions between Moscow and Washington could not: convince American lobbyists to turn down money from Kremlin allies,” POLITICO’s Hailey Fuchs writes.",
    "And, virtually overnight, any remaining ties they had with D.C. lobbying shops have been severed.”\n— “The termination of those contracts may be one of many ripple effects from the war currently being waged by Russia against Ukraine.",
    "The recent terminations of the contracts were in response to U.S. sanctions on those companies — not, necessarily, moral judgments that the firms themselves made about serving clients tied to Russian President Vladimir Putin.",
    "It is proper for countries and companies of varying levels of nefariousness to purchase representation in the halls of Congress and the corridors of power in D.C., provided they abide by disclosure and ethics rules.",
    "An affiliated charity, the Demand Justice Initiative, will bring in $4.2 million, it told the IRS, and steer all of those funds to allied organizations — including its advocacy arm.",
    "Angulo has spent the past decade on the Hill and is a Joint Economic Committee, David Schweikert and Jim Jordan alum, and helped establish the Congressional Blockchain Caucus.",
    "— “We get calls on a regular basis about folks trying to understand what's happening because it is not just the traditional infrastructure,” Begich told PI in an interview.",
    "— “That, to me, is where we play a very significant role because of our knowledge of the system,” Begich said of weighing in on programs that clients oppose.",
    "Taylor previously managed regulatory affairs at Mercedes-Benz and also served as deputy director for business and economic development under California Gov.",
    "She most recently was an account supervisor at BerlinRosen, and is a Hillary for America, Ted Strickland campaign and Tennessee Democratic Party alum.",
    "Demand Justice previously operated under the auspices of the Sixteen Thirty Fund, a progressive ‘fiscal sponsor,’ but split from the group last year.",
    "It also helps that typically as a mayor, he argued, one understands \"what I call the DOT morass of rules.”\nGood afternoon and welcome to PI.",
    "— Rick VanMeter is becoming executive director of the Coalition for App Fairness, replacing Meghan DiMuzio, who is leaving the organization.",
    "She most recently was senior director for innovation at the American Psychological Association, where she remains an innovation consultant.",
    "Fisher previously was digital director for the Senate Republican Conference, and is a House Republican Conference and Jodey Arrington alum.",
    "— Ascent Media is promoting Matthew Mazzone to partner and bringing on Caleb Fisher as vice president for creative strategy, per Playbook.",
    "“He understands, you know, what it takes to you know, get a bid on the street [that’s] competitive and get a value for it,” Begich said.",
    "— Brook Taylor is now vice president for government relations and strategic partnerships for EV maker VinFast, Morning Transpo reports.",
    "She joins J&J from her previous role as vice president and head of U.S. health care government and public affairs at EMD Serono.",
    "government activity regarding Belarus,” and ceased lobbying on July 31, according to termination documents filed last week.",
    "The trade group’s board of advisers has meetings slated with three dozen members of the House and Senate, including Sens.",
    "— Former Atlanta mayor Kasim Reed has joined Squire Patton Boggs as a partner in the firm’s global litigation practice.",
    "— Begich also praised the White House’s point man for implementing the law, former New Orleans Mayor Mitch Landrieu.",
    "— Julie Okada is joining the Brunswick Group as partner and global head of learning and leadership development.",
    "He previously was vice president of strategic communications at the National Association of Manufacturers.",
    "— Tiffany Angulo is joining Targeted Victory as a vice president in the firm’s new crypto practice.",
    "— James Noe has joined Holland & Knight as a partner in the public policy and regulation group.",
    "— BGR was hired as a subcontractor to the law firm White & Case last February to monitor “U.S.",
    "She currently is media relations strategy manager at the Credit Union National Association.",
    "— Jessica Carson is now senior director for psychology and curriculum at ZenBusiness.",
    "— Shadawn Reddick-Smith has joined Lyft, where she is handling policy communications.",
    "Those six entities have now been targeted by sanctions from the Biden administration.",
    "— Lauren Williams is joining Capital One’s media relations and public affairs team.",
    "— Sara Spain is now national press secretary at EMILY’s List, Playbook reports.",
    "Mazzone previously was senior vice president for creative strategy at Ascent.",
    "VanMeter previously led messaging and media relations efforts for the group.",
    "Patty Murray (D-Wash.), Ron Wyden (D-Ore.) and Todd Young (R-Ind.",
    "She previously was director of strategic communications at DHS.",
    "Glenn Youngkin’s office as deputy communications director.",
    "She was previously a principal at Triad Consulting Group.",
    "And be sure to follow me on Twitter: @caitlinoprysko.",
    "Our Moscow office is open and continues to operate.",
    "He was previously a partner at Jones Walker.",
    "— Rob Damschen is joining Virginia Gov.",
    "Get in touch: coprysko@politico.com.",
    "), and Reps. Richard Neal (D-Mass.)",
    "New Joint Fundraisers\nNone.",
    "Have a lobbying tip?",
    "Jerry Brown.",
    "Follow Us"
  ]
}