{
  "id": 10867,
  "mediaId": 2550,
  "date": "2022-03-11",
  "headline": "Cawthorn isn't alone as a Republican crapping on Ukraine. He just has bad timing",
  "image": "https://images.dailykos.com/images/1047062/story_image/GettyImages-1327884025.jpg?1646958942",
  "link": "https://www.dailykos.com/stories/2022/3/11/2085155/-Cawthorn-s-Ukraine-take-isn-t-so-shocking-if-you-ve-been-paying-attention-to-Republicans-since-2016?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5399,
    2119,
    2444,
    2765,
    4524,
    4591,
    3702,
    1126,
    6672,
    6569
  ],
  "sentences": [
    "But the groundwork for the extortion attempt that led to Trump's first impeachment had been laid years before that, in large part by former Trump campaign manager Paul Manafort, whose work for pro-Russian candidates and the oligarchs who supported them contributed both to political turmoil in Ukraine in recent decades and to the Republican move toward support for Putin.",
    "Rep. Marjorie Taylor Greene has been critical of Putin recently, but she appeared at a white nationalist event less than two weeks ago at which Putin and the invasion of Ukraine were cheered on, and as recently as January, Greene was one of a significant number of prominent Republicans—led by Donald Trump—who were arguing against U.S. support for Ukraine.",
    "“Remember that the Ukrainian government is incredibly corrupt and is incredibly evil and has been pushing woke ideologies.”\nIt’s a bold statement, coming at a time when 61% of Republicans have a positive view of Republican President Volodymyr Zelenskyy, according to one poll—and Cawthorn did try to walk it back a little.",
    "Going back a little further than that, during Trump’s first Ukraine-centered impeachment, a standard Republican talking point was that Ukraine was incredibly corrupt, “one of the three most corrupt countries on the planet,” according to Rep. Jim Jordan.",
    "The loudest Republican with the biggest platform carrying Putin’s water at this point is Fox News personality Tucker Carlson, who most recently jumped on board with Russian disinformation claims that the U.S. and Ukraine have a joint bioweapons program.",
    "In one key incident, supposed grassroots anti-NATO protesters who attacked U.S. Marines doing exercises with the Ukrainian military were not so grassroots after all—they were plants set up by politicians for whom Manafort consulted.",
    "Also buying into the bioweapons lab propaganda was Rep. Thomas Massie—one of the three Republicans who voted against a House resolution supporting Ukraine—who attached his concern about the issue to a tweet by Glenn Greenwald.",
    "With Manafort as Trump’s campaign manager—consulting with Russian oligarchs and employing a Russian spy all the while—military support for Ukraine was removed from the platform at the Republican National Convention.",
    "And all of that is before Trump withheld military aid from Ukraine while pressuring Zelenskyy to help Trump destroy Biden’s 2020 chances.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "That incident in turn was cited by Putin when he annexed Crimea, as evidence that people there would welcome the Russian move.",
    "It’s just that he’s apparently too slow on the uptake to change his message quite as quickly as his fellow Republicans did.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "For that matter, some prominent Republican voices continue to boost Vladimir Putin and suggest that Ukraine had it coming.",
    "But Cawthorn isn’t so out of step with his party if you look at the last few years rather than the last few weeks.",
    "“Remember that Zelenskyy is a thug,” Cawthorn said in a video obtained by North Carolina news station WRAL.",
    "But it’s not that Cawthorn is out of step with his party’s last several years of Ukraine-Russia policy.",
    "Rep. Madison Cawthorn\nThis week, Rep. Madison Cawthorn’s take on Ukraine makes him stand out.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "So Madison Cawthorn’s anti-Ukraine comments may seem shocking this week.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "This is a short blurb about Daily Kos.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Donate $5 monthly",
    "Please read it."
  ]
}