{
  "id": 1087,
  "mediaId": 2550,
  "date": "2022-02-16",
  "headline": "The Republican platform for 2022",
  "image": "https://images.dailykos.com/images/902145/story_image/AP21006849368171.jpg?1609981456",
  "link": "https://www.dailykos.com/stories/2022/2/16/2080503/-Republicans-do-have-a-platform-for-2022-That-platform-is-supporting-January-6?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Sumner",
  "authorUrl": "/users/mark sumner",
  "termIds": [
    2119,
    4345,
    2765,
    2723,
    3246,
    3054,
    1126,
    1359
  ],
  "sentences": [
    "2) Conduct more investigations of Hillary Clinton\nThe reaction to the latest document from John Durham—an empty document that contains not a single new charge and no information that hasn’t been available for years—was still enough to trigger a huge furor on the right, including a call from Donald Trump that people should be executed “in stronger times.” Trump wasn’t alone in celebrating the idea that members of the Clinton campaign should die.",
    "They’ve not only managed to pass hundreds of bills protecting their little Jane and Johnny from every hearing that the world exists only because white Christians made it, they’ve also convinced roughly 100 screaming anti-vaxx, anti-book, anti-diversity Republicans to run for every school board set in America, and they’ve put together a set of rules and requirements that makes public education absolutely impossible.",
    "2022 Republican candidates see nothing wrong with the scheme to create slates of false electors, agree that the party in power can set the outcome of elections so long as that party is Republicans, and that by controlling the machinery of elections, they are free to quietly, efficiently suppress democracy anytime they want.",
    "Related Stories\nDonald Trump is calling for the death penalty as John Durham shockingly charges no one with anything\nMaybe it’s finally time for\n Democrats to stop fetishizing ‘bipartisanship’\nRNC wants America to know it also viewed fake-elector plot to steal 2020 as 'legitimate'\nThis is a short blurb about Daily Kos.",
    "Republicans have raised up a wave of fury in which decent, hard-working, and most of all white American parents are being told that their children are being taught actual history, asked to think for themselves, and being faced with suggestions that race, gender, or sexual orientation doesn’t define a person’s worth.",
    "Jim Jordan has already performed his expected role of echoing the leader, not just saying that Trump was right about Clinton’s team “spying on him,” but saying that in the past these crimes “would have been punishable by death.” Which is only slightly more amazing because Durham didn’t even allege any crimes.",
    "In fact, “failed” is a bit of a misnomer because it implies that there was an effort to find some common ground from which the Republican Party could generate a list of items it offered to the public, or a set of legislation that it hoped to pass in the following years.",
    "Both Gaetz and Greene have been on Bannon’s podcast to not just redirect the blame for Jan. 6 violence toward Speaker of the House Nancy Pelosi and the Capitol Police, but to call for investigations of anyone who dared to help the Jan. 6 investigation.",
    "With a huge tax cut for the wealthy already secured and the direction from “party leadership” coming down to whatever engaged Donald Trump on a given day, Republicans simply replaced a platform with “whatever he says,” which shouldn’t be unexpected.",
    "1) Arrest the members of the Jan. 6 Committee for daring to investigate the insurrection\nFrom Steve Bannon to Newt Gingrich to Matt Gaetz to Marjorie Taylor Greene, the right-wing news, rallies, and radio have been full of this idea.",
    "This call has been picked up by Republican candidates, who are openly running on promises to turn the tables on the Jan. 6 select committee by making them the target of prosecution if Republicans are returned to power.",
    "While a handful of Republicans in D.C. may be reluctant to sign on to the idea that Jan. 6 isn’t “legitimate public discourse,” that’s not where the party infrastructure, the base, or the right-wing media is at all.",
    "There are candidates at every level running on the idea that Trump “won” in 2020, that Jan. 6 was a conspiracy to stop Trump, and that Pelosi murdered Republicans in a scheme to make Republicans look bad.",
    "So when The Washington Post ran an opinion piece on Monday complaining that Republicans haven’t given voters any agenda going into the 2022 midterms, that’s true to some extent.",
    "At the 2020 Republican National Convention, the GOP achieved something that no major party had managed in nearly a century: They failed to come up with a platform.",
    "Remember, America, you never have to hear about tedious things like election fraud and political platforms again if you just give up that worn-out democracy.",
    "Anyone expecting the Republican Party to produce their prescriptions for health care, foreign policy, or Social Security is going to be sorely disappointed.",
    "Every committee will be a race to find a more ludicrous, more extreme reason that Hillary Clinton needs to be presented with 16 subpoenas this week.",
    "The biggest item on the Republican agenda for 2022 is making sure they never have to have anything that ever looks like a platform in the future.",
    "Because what good is it to destroy democracy if you don’t also get to rewrite history and warm yourself around stacks of burning books?",
    "Simply get rid of democracy, and all those trappings of democracy can follow swiftly behind—and really, aren’t they just so tiresome?",
    "Special Bonus: Destroying public education\nThis isn’t so much a plan for the future as it is a plan for getting people to the polls.",
    "Certainly no one should expect an answer to the climate crisis, or any answers to the pandemic except to pretend it never happened.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "It doesn’t have anything that looks like a normal agenda with plans for the economy, or a single idea for making lives better.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "They’ve been expressing it loudly, telling their base exactly what they plan to do should they obtain control of Congress.",
    "3) Ditch democracy\nIt’s not enough to prosecute the people who dared to look into the events leading up to Jan. 6.",
    "Vengeance on Clinton for what is perceived as her role in connecting Trump to Russia is high on Trump’s list.",
    "Should Republicans regain the House, expect the dozen hearings on Benghazi to look like a warmup.",
    "It’s not enough to go back and attack Hillary Clinton for things her campaign didn’t do in 2016.",
    "Don’t worry: They’ll get around to the small stuff after they get rid of all the big stuff.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Gingrich has been on Fox promising “jail time” for those on the committee.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "The idea that Jan. 6 is anything to be ashamed of is past passé—Jan.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "After all, authoritarian movements do mottos, not platforms.",
    "But that doesn’t mean the Republicans don’t have a platform.",
    "Gaetz has “enthusiastically endorsed” that suggestion.",
    "Oh, and they are also effectively suppressing voting.",
    "That makes it high on the list of GOP candidates.",
    "Here’s the Republican platform for 2022.",
    "This is a win, win, win all around.",
    "Really, it’s a blitz on democracy.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "6 is something to be proud of.",
    "Republicans have an agenda.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "And the answer is Jan. 6.",
    "Daily Kos is different.",
    "That didn’t happen.",
    "Donate $5 monthly",
    "Please read it.",
    "They do."
  ]
}