{
  "id": 10951,
  "mediaId": 2618,
  "date": "2022-03-14",
  "headline": "NYC Academics and Activists Want Theodore Roosevelt Statue Melted Down",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/14/nyc_academics_and_activists_want_theodore_roosevelt_statue_melted_down_81255.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike LaChance",
  "authorUrl": "",
  "termIds": [
    4306,
    4066,
    3686,
    3760,
    2765,
    2736,
    3049,
    2959,
    6107,
    6672
  ],
  "sentences": [
    "(Snip) “If not, his failure to disclose income from right-wing organizations, recuse himself from matters involving his wife, and his vote to block the Jan 6th commission from key information must be investigated and could serve as grounds for impeachment,” (Snip) Despite the growing criticism of Thomas by Democrats, House Minority Leader Kevin McCarthy (R-Calif.) defended the justice,\nThe US State Department has offered a grant of up to $987,654 for projects that include reporting human rights violations by Israel, raising concern about the potential for abuse by organizations seeking boycotts, sanctions and international law tribunals against Israel.",
    "As with many other small businesses, student shoplifting was epidemic, as we covered, Student journalist: Shoplifting at Gibson’s Bakery was part of Oberlin College’s “Culture of Theft”\nThe possibility of an appeal means Christianity and free speech are still at risk in the Western country ranked No.",
    "“These funds will allow Ohio cultural and educational institutions to continue supporting their workers while providing a vital service to local communities for generations to come.”\nPeriodically, in what seems like a never-ending assault on our basic values and the rule of law, good news emerges.",
    "“If this kind of questioning of free speech is possible in a country like Finland, which has a reputation regarding free speech internationally, the same is possible anywhere,” said Member of Parliament Paivi Rasanen during a livestreamed press conference this morning U.S. time.",
    "(Snip) The “cancelled” statue of Theodore Roosevelt that was hauled away in the dead of night from the American Museum of Natural History’s steps should be headed for the scrap heap rather than a presidential library in North Dakota, a group of woke academics and artists claims.",
    "The video on the website for BioTexCom, aka the Center for Human Reproduction, features Ukrainian men driving babies born to surrogate mothers to bomb shelters where smiling caregivers cradle the precious cargo and keep the infants safe from Russian firepower.",
    "The Bureau of Democracy, Human Rights and Labor (DRL) announced \"an open competition for projects that strengthen accountability and human rights in Israel and the West Bank and Gaza\" last month, thought to be the first of its kind from Washington.(Snip)Prof.",
    "Far-left Rep. Alexandria Ocasio-Cortez said Tuesday that Supreme Court Justice Clarence Thomas should resign in the wake of revelations that his wife sent texts that pushed for the overturn of the 2020 presidential election results.",
    "The court ruled unanimously concluded that “it is not for the district court to interpret biblical concepts.” The prosecution was ordered to pay more than 60,000 EUR ($66,755 US) in legal costs and has a week to appeal the ruling.",
    "The far left in our nation is actively attempting to eradicate core beliefs by confusing children of their gender and God-given sex, by emasculating men, by making race an idol, and by worshipping at the altar of abortion.",
    "HELSINKI - Freedom of speech has been protected in Finland by a court that dismissed all charges against a member of Finnish parliament and a Lutheran bishop for expressing Christian beliefs about sexuality.",
    "Prayers from around the world were answered joyfully today when a Finnish court ruled unanimously in favor of two Christians the government prosecuted for publicly stating the Bible’s teachings about sex.",
    "The good news now is the unanimous decision of a panel of three judges on an Ohio Court of Appeals, supporting a jury decision in favor of Gibson's Bakery in its case against Oberlin College.",
    "“I think he sort of came to think that a lot of the other guys were just you know, sloganeering and talking points, and didn’t actually believe the things that they were saying,” Vance said.",
    "Whether you believe the United States is a Christian nation founded on Judeo-Christian principles or not, the universally accepted norms of right and wrong remain until they are upended.",
    "(Snip) “Ohio’s great museums and universities play an important role in our understanding of the world, and were hit particularly hard during the COVID-19 pandemic,” Brown said.",
    "(Snip)The arrangement is an invitation of exploitation--with affluent couples (or individuals) paying women who need money to bear children in poor countries at their own risk.",
    "(Snip)This is what the video does not show--the 66-year-old Swedish woman who gave birth to twins after IVF treatment with donor eggs, according to the organization’s website.",
    "Gerald Steinberg, Director of NGO Monitor, which tracks funding for NGOs dealing with Israel-related issues, said he has never seen a US funding announcement of this kind.",
    "(Snip)The nation is indebted to the Gibson family for refusing to be intimidated by left-wing dogmatists at Oberlin and for standing hard and fast for what is true.",
    "(Snip) “New Yorkers cannot simply dump their toxic cultural products in other communities,” according to an online petition by the academics started last month.",
    "The National Endowment for the Humanities has awarded a $6,000 grant to Oberlin College, according to an announcement from Sen. Sherrod Brown, D-Cleveland.",
    "According to a press release from ADF International, prosecutors failed in their case against Finnish MP Päivi Räsänen and Bishop Juhana Pohjola.",
    "Thus now-Attorney General Merrick Garland was denied even a hearing on his nomination to the high court by Democratic President Barack Obama.",
    "Rob Portman has gotten good at finding reasons why only Republican presidents should be able to appoint justices to the U.S. Supreme Court.",
    "For those of you new to the case, Gibson’s Bakery was a 5th generation family business in Oberlin, Ohio, near the Oberlin College campus.",
    "Vance railed at big tech censorship, got loud applause for his border plan, and stood firm on his skepticism of involvement in Ukraine.",
    "(Snip)The decision is worthy of our attention because it shows just how troubling the situation is at our colleges and universities.",
    "(Snip)The townhall format gave Vance a bigger bullhorn, but much of what he had to say reiterated points from previous debates.",
    "It served baked goods to the public and also to the student dining service, as well as operating a general convenience store.",
    "Americans face this choice as we are bombarded with social issues that require us to examine the core of the nation’s soul.",
    "The Ohio 9th District Court of Appeals has just issued a decision in the Gibson’s Bakery v. Oberlin College case.",
    "Portman, Ohio’s junior U.S. senator, did it in 2016 following the death that February of Justice Antonin Scalia.",
    "Portman joined his fellow Republicans in insisting that the seat shouldn’t be filled during an election year.",
    "(Snip)“The cheapest surrogacy in Europe is in Ukraine, the poorest European country,” BioTexCom explains.",
    "Instead, we’re stuck with Justice Neil Gorsuch, an appointee of Republican President Donald Trump.",
    "Vance had the stage to himself, taking questions from voters in a townhall hosted by NewsMax.",
    "The money will be used to support students in advanced research that results in publication.",
    "The statue is supposed to be moved to a Theodore Roosevelt library in North Dakota.",
    "Darkness either overcomes you or it compels you to shine your light to repel it.",
    "(Snip)As for Trump’s endorsement, Vance chalked it up to debate performance.",
    "3 globally for its commitment to the rule of law.",
    "Now the left wants it destroyed completely.",
    "We have followed this story closely.",
    "In Delaware Wednesday night J.D."
  ]
}