{
  "id": 11054,
  "mediaId": 2618,
  "date": "2022-03-15",
  "headline": "Report: Oz Looks to Exit Senate Race, Return to Television",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/15/report_oz_looks_to_exit_senate_race_return_to_television_81321.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "",
  "termIds": [
    5905,
    4794,
    2802,
    1025,
    188,
    1489,
    6506
  ],
  "sentences": [
    "https://www.breitbart.com/politics/2021/12/25/report-dr-oz-on-trans-swimmer-we-have-to-have-compassion/ \"A review of his broadcasts suggests Dr. Oz has used his show to promote transgender ideology, including things like mastectomies on healthy teen girls and using pharmaceutical drugs to prevent puberty on healthy children,\" Michael Geer, president and CEO of the Pennsylvania Family Institute, told Fox News Digital.\"",
    "Celebrity doctor Mehmet Oz is already in talks to return to television if his candidacy for U.S. Senate in Pennsylvania is unsuccessful, according to a recent report.A source told Radar Online that Oz “knows his campaign is on life support.”The source said: He is only 61-years-old and isn’t ready to retire if he doesn’t go to Washington DC.",
    "\"Celebrity Doctor Mehmet Oz, a Republican Senate candidate in Pennsylvania, recently stated, “we have to have compassion” for transgender adults when asked about transgender collegiate swimmer Lia Thomas, according to a report.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "\"Such actions permanently alter healthy bodies, can result in irreversible sterilization, and lead to more suicidal ideation, not less, as studies have shown,\" Geer added.",
    "\"Pennsylvanians are rightly concerned that Dr. Oz holds to this ideology, but if he does not, they need to hear him publicly repudiate those views.\"",
    "https://www.foxnews.com/politics/dr-oz-now-a-gop-senate-candidate-had-jazz-jennings-transgender-parents-transgender-surgeon-on-his-show",
    "Thomas, a biological male who swims for the University of Pennsylvania, has been smashing women’s records this season.\"",
    "After he announced his Senate run, I immediately looked that up as he squirmed around when asked about his residency.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "When he decided to run, he officially filled out the paperwork stating a PA address which belongs to his MOM.",
    "I suspect Oz was told by friends who are rino Republicans that with his name recognition, hey piece of cake.",
    "Like any good doctor, he is already looking for alternatives to keep his career alive if he doesn’t win.",
    "Oz hangs out with too many liberals for me to think he is a conservative.",
    "He soon found out he better stick to reading script cards on talk TV.",
    "Your donation helps keep our discussions going and our voices heard.",
    "He and wife live in Beverly Hills and NYC most of the time.",
    "Well #3, no he doesn’t really live in your lovely state.",
    "No one wants to admit defeat, but he isn’t a stupid man.",
    "I live in PA and got text messages from his campaign.",
    "My request to end these texts was immediate.",
    "He knows his campaign is on life support.",
    "I think of him as a carpetbagger.",
    "Does Oz really live in PA?",
    "Thank you.",
    "Bye!"
  ]
}