{
  "id": 11081,
  "mediaId": 2550,
  "date": "2022-03-10",
  "headline": "Republicans suddenly claim to be the biggest allies of the nation they once denounced as corrupt",
  "image": "https://images.dailykos.com/images/739278/story_image/GettyImages-1171051394.jpg?1574107377",
  "link": "https://www.dailykos.com/stories/2022/3/10/2085071/-Republicans-are-rewriting-their-own-party-s-recent-history-with-Ukraine?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Clawson",
  "authorUrl": "/users/laura clawson",
  "termIds": [
    2140,
    3037,
    2765,
    3702,
    4905,
    4698,
    1126,
    6569,
    6672
  ],
  "sentences": [
    "According to Scalise, “President Zelenskyy had called President Trump to thank him for the leadership that he provided.” In reality, it was part of Zelenskyy’s desperate efforts to get some kind of public show of support from the United States that might help ease the threat Ukraine faced from Russia, and the call came as Trump’s informal emissaries, led by Rudy Giuliani, were pressuring him to announce the very same corrupt investigation that Trump then asked for as “a favor” when Zelenskyy asked to buy Javelin missiles.",
    "In that, he echoed Trump's February statement claiming, “it was me that got Ukraine the very effective anti-tank busters (Javelins) when the previous Administration was sending blankets.”\nThe Obama administration didn’t send lethal aid like Javelins in part because officials were concerned that the Ukrainian army didn’t have the capability to use them.",
    "Most notoriously, of course, there are these 10 words: “I would like you to do us a favor, though.” That’s what Donald Trump said as he withheld military aid in an attempt to extort Ukrainian President Volodymyr Zelenskyy into manufacturing dirt on now-President Joe Biden for Trump’s personal political gain.",
    "“If you go back to when Joe Biden was vice president, he bragged about how he withheld a billion dollars in aid to Ukraine, when Joe Biden was vice president, because he said he wanted a prosecutor to get fired, who ultimately from reports we saw was fired,” Scalise said Tuesday.",
    "“When President Zelenskyy was asking for things like Javelin missiles that the Biden and Obama administration said no to, President Trump said yes and actually helped Ukraine get those tank-busting missiles that they needed and frankly, they’ve been using,” Scalise said.",
    "Ukrainian President Volodymyr Zelenskyy and Donald Trump, post-extortion effort\nIt’s taken Republicans a little while to figure out their approach to Russia’s invasion of Ukraine, but—for now at least—they’ve settled on pretending to be the best friends Ukraine ever had.",
    "The difference here is that Biden was, as a public matter of administration policy, talking about aid that would be withheld as part of an international anti-corruption effort, with the European Union and the International Monetary Fund also calling for Shokin’s firing.",
    "House Minority Whip Steve Scalise has pointed to the same ouster of a corrupt prosecutor in Ukraine as problematic because it involved then-Vice President Biden threatening to withhold aid if the prosecutor, Viktor Shokin, wasn’t fired.",
    "In the midst of trying to defend Trump, Rep. Jim Jordan called Ukraine “one of the three most corrupt countries on the planet.” He also condemned efforts to fight corruption in Ukraine as themselves corrupt because Biden was involved.",
    "Now that Republicans have figured out that supporting Ukraine is their best bet, politically speaking, they are all in—to the point where you have to worry they’re going to do their best to provoke a nuclear war.",
    "In their effort to rewrite how Trump’s first impeachment speaks to Russia’s invasion of Ukraine, and the Republican view of Ukraine more generally, Republicans like Scalise are returning to an old talking point.",
    "What the Obama administration did send was not blankets but UAVs, armored Humvees, counter-mortar radars, night vision devices, and more.",
    "But that changed over time—as we’re seeing, the Ukrainian military has dramatically improved since 2014, when Russia annexed Crimea.",
    "And when Trump did send Javelins, it was only after his advisers convinced him that it would be good for U.S. defense contractors.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "It falls apart immediately if you look at the Republican record over the past few years, but it’s what they’re going with.",
    "That’s the kind of question that needs to take precedence above making a president from the opposite party look bad.",
    "“If Joe Biden won’t make him pay, the Republican Party must,” Sen. Tom Cotton said in a speech on Monday.",
    "Immediately after the invasion, Republicans were blaming Biden for not having stopped it.",
    "It’s kind of different from a secret phone call and an ask seeking personal benefit.",
    "And every single Republican other than Sen. Mitt Romney thought this was just fine.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "But putting anything above partisan concerns is not how Republicans operate.",
    "Many actively defended Trump’s actions, which often meant trashing Ukraine.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "But what does that look like when a no-fly zone would mean a world war?",
    "They’ve since moved on to blaming him for not doing enough to end it.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "This is a short blurb about Daily Kos.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "But that’s not all.",
    "Donate $5 monthly",
    "Please read it.",
    "Great, really."
  ]
}