{
  "id": 11090,
  "mediaId": 2618,
  "date": "2022-03-16",
  "headline": "Biden to announce $1B arms package, weighs giving Ukraine tank-killing Switchblade ‘kamikaze’ drones",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/16/biden_to_announce_1b_arms_package_weighs_giving_ukraine_tank-killing_switchblade_kamikaze_drones_81352.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "",
  "termIds": [
    3702,
    4905,
    2765,
    6678,
    6672
  ],
  "sentences": [
    "https://www.washingtontimes.com/news/2022/mar/16/zelenskyy-speech-congress-urges-us-no-fly-zone-air/\nYes, we are being dragged in because few enterprises make so many people in Washington fabulously rich as war.",
    "Considering the size of Ukraine and the amount of valuable resources the country contains, it should have a 1st class military, as big as and better equipped than Germany, France and Poland put together.",
    "The package will include anti-tank missiles and a new collection of portable defensive weapons the U.S. has already provided, including Javelin missiles and Stinger anti-aircraft missiles.",
    "War in Ukraine would be a dilemma for any president: react too hard and risk nuclear war; do nothing and be no better than Soros-elected DAs allowing cities to be destroyed.",
    "War with Russia could easily become a global nuclear holocaust, and if that happens blame the unquenchable greed of the Deep State which made them willing to roll the dice.",
    "But with a senile president, a clown for VP, and an equity-hire Sec Def who keeps vessels in port because the captain isn't vaccinated, we're really in serious trouble.",
    "For some reason, democrats suddenly believe everything Zelenskyy says, but 4 years ago, he couldn't be believed about a simple phone call with then President Trump!",
    "\"In preparation to respond to Mr. Zelenskyy’s speech to Congress, Mr. Biden is teeing up an additional $800 million in military aid for the war-torn country.",
    "Our own government is dragging us into this conflict by hook or by crook, and it will make a few people rich beyond their wildest dreams.",
    "How difficult it much have been for the arms dealers to sit on the sidelines while Big Pharma had its turn riding the money-go-round.",
    "The aid adds to the $13.6 billion in emergency humanitarian and emergency aid for Ukraine recently approved by Congress.\"",
    "Mr. Biden is expected to announce the aide in a speech from the White House shortly after Mr. Zelenskyy’s address.",
    "Yet they were sucking up aid from American taxpayers, w/ 10% back for the big guy, apparently.",
    "And the fact that Soros wants us to save the Ukraine is highly suspicious!",
    "People think this will all be over within the next few weeks or months.",
    "I'm thinking it's September 1939 all over again."
  ]
}