{
  "id": 11197,
  "mediaId": 2563,
  "date": "2022-03-17",
  "headline": "Democrats want Biden to Declare National ‘Climate Emergency’ and Ban Oil Drilling on Federal Lands",
  "image": "https://drrichswier.com/wp-content/uploads/BIDEN-GAS-PRICES-GELLER-REPORT.jpg",
  "link": "https://drrichswier.com/2022/03/17/democrats-want-biden-to-declare-national-climate-emergency-and-ban-oil-drilling-on-federal-lands/",
  "mediaOutlet": "drrichswier.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Geller Report",
  "authorUrl": "https://drrichswier.com/author/pgeller/",
  "termIds": [
    0
  ],
  "sentences": [
    "SCOOP: House liberals to urge Biden to declare climate emergency, ban drilling on federal lands as part of a sweeping executive order plan to be released by @USProgressives this week https://t.co/eoBijpcjQc\n— Joshua Siegel (@SiegelScribe) March 15, 2022\nThe reported move drew immediate criticism on social media with many pointing out that gas prices have surged to record levels prompting Republicans to call for increased drilling to ease pain at the pump, not less.",
    "Deducting employee wages and production costs are not subsidies.”\nHouse Dems want Biden to declare national ‘climate emergency’ and ban oil drilling on federal lands\nDemocrats will also call on Biden to end fossil fuel subsidies\nProgressive Democrats in the House of Representatives are reportedly planning to publicly urge President Biden to ban oil drilling on federal lands amid record gas prices and a war in Ukraine that has disrupted oil markets.",
    "“A draft of the plan I saw also calls for Biden to ban oil/gas drilling on public lands and end fossil fuel subsidies.”\nSiegel added that House Democrats will also call on Biden to manufacture more heat pumps to “ease the strain in oil and gas markets that has been caused by Russia’s war in Ukraine.” Some of those heat pumps would be donated to Europe, according to the House Progressives’ plan.",
    "https://t.co/4Kmfq21HJg\n— Jay Timmons (@JayTimmonsNAM) March 15, 2022\nThe use of a “climate emergency” also raises constitutional concerns, as the nation eases out of emergency COVID restrictions imposed two years ago by governors and local authorities, which shut down businesses and destroyed millions of jobs nationwide.",
    "The Biden administration has faced intense criticism in recent weeks for refusing to commit to increasing oil production in the United States as gas prices have surged roughly $1.50 per gallon since he took off in a crisis that has been exacerbated by Russia’s invasion of Ukraine.",
    "“Manufacturers oppose this attempt to potentially further disrupt domestic energy production and drive up prices.”\nWe need to focus on building critical infrastructure and increasing domestic production, not jeopardizing North American energy security.",
    "“We need to focus on building critical infrastructure and increasing domestic production, not jeopardizing North American energy security,” President and CEO of the National Association of Manufacturers Jay Timmons tweeted.",
    "“Progressive Caucus member @JaredHuffman told me calling on Biden to declare a climate emergency is one of the ‘centerpiece’ actions to headline their EO plan,” Politico reporter Joshua Siegel tweeted Tuesday.",
    "According to a report from Politico, the Congressional Progressive Caucus is planning to demand that Biden use his executive power to declare climate change an emergency and ban drilling on federal lands.",
    "“We must unleash American energy.”\n“And Democrats wonder why people blame them for high gas prices,” a Twitter account associated with the National Republican Congressional Committee tweeted.",
    "Subscribe to Geller Report newsletter here — it’s free and it’s critical NOW when informed decision making and opinion is essential to America’s survival.",
    "https://t.co/XajhpZdzU0\n— Rep. Jim Jordan (@Jim_Jordan) March 16, 2022\nEDITORS NOTE: This Geller Report column is republished with permission.",
    "The last time I looked the only subsidies I found were for research into green energy and to burn the fossil fuels cleaners.",
    "Manufacturers oppose this attempt to potentially further disrupt domestic energy production and drive up prices.",
    "They want President Biden to declare a national ‘climate emergency’ and ban oil drilling on federal lands.",
    "There is one common thread running through every Democrat policy – it’s hurt Americans, destroy America.",
    "Facebook, Google search et al have shadow-banned, suspended and deleted us from your news feeds.",
    "Sorry there aren’t billions or trillions of subsidies going to fossil fuel producers.",
    "The White House did not immediately respond to a request for comment from Fox News.",
    "“The Democrats need to wake up,” Republican Sen. Steve Daines tweeted.",
    "Share our posts on your social channels and with your email contacts.",
    "Twitter, LinkedIn, Google Adsense, Pinterest permanently banned us.",
    "What people are calling subsidies, are normal businesses expenses.",
    "And as one commenter points out, “What oil subsidies are there?",
    "“Dems want $10 gas,” Republican Sen. Ted Cruz tweeted.",
    "If you can, please contribute to Geller Report.",
    "Quick note: Tech giants are shutting us down.",
    "We will not falter, and we will not fail.",
    "Remember, YOU make the work possible.",
    "Maybe the dumbest idea of the year.",
    "Doesn't matter to House Democrats.",
    "Gas prices are at record levels.",
    "They are disappearing us.",
    "I am there, click here.",
    "Fight the great fight.",
    "Freedom will prevail.",
    "©All rights reserved.",
    "Follow me on Gettr.",
    "It’s open and free.",
    "We will not waver.",
    "We will not tire.",
    "But we are here.",
    "You know this."
  ]
}