{
  "id": 11231,
  "mediaId": 2590,
  "date": "2022-03-10",
  "headline": "The GOP's Biggest Whoppers About Biden And Fossil Fuels",
  "image": "https://img.huffingtonpost.com/asset/622a1c1a2100004b7250371c.jpeg?cache=U0qStHdULS&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/republicans-biden-fossil-fuels_n_622a1a5be4b0e01d97a7ae8d",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris D'Angelo",
  "authorUrl": "",
  "termIds": [
    3475,
    2859,
    2886,
    2765,
    4905,
    4698,
    1126,
    6569,
    6678
  ],
  "sentences": [
    "Republican lawmakers and right-wing media have responded to Russia’s invasion of Ukraine by waging a misinformation campaign about the Biden administration being “at war with fossil fuels.”\nThe goal, of course, is to leverage the crisis in Eastern Europe to provide more access and regulatory relief to an oil and gas sector that is already very profitable, heavily subsidized, has enormous sway in Washington, and is sitting on unused permits to drill across millions of acres of land and water.",
    "accused President Joe Biden of leading “a frontal assault on oil and gas.” Sen. Shelley Moore Capito (R-W.Va.) bemoaned Biden’s “backwards, America-last energy policies.” And numerous other industry-backed members of the GOP have spent the days since Russia launched its violent war peddling industry talking points and demanding Biden “unleash” America’s full oil and gas potential.",
    "Biden ‘ended’ oil and gas drilling on federal lands\nIn an interview late last month with right-wing news outlet Newsmax, Sen. Marsha Blackburn (R-Tenn.) claimed Russian President Vladimir Putin decided to invade Ukraine because of Biden’s energy policies, including “ending drilling on federal lands.”\nBiden did not end federal drilling — far from it.",
    "pic.twitter.com/I86jhV2HbD\n— CSPAN (@cspan) March 7, 2022\nWhile Republicans revive the “drill, baby, drill” mantra and demand Biden “unleash” American energy, the oil and gas sector and its Wall Street investors have made clear they have little interest in ramping up drilling amid record high prices, as NPR has reported.",
    "More recently, in February, the Biden administration instituted a second pause on new federal leasing and permitting in response to a second Trump-appointed judge’s ruling that blocked the administration from using a higher calculation for the damages associated with planet-warming greenhouse gas emissions.",
    "In fact, to the frustration of climate and environmental advocates, the Biden administration approved more drilling permits during his first year in office than former President Donald Trump did in any of his first three, according to data compiled by the conservation group Center for Western Priorities.",
    "Biden ‘destroyed American energy independence’\nAdvertisement\nThere are many iterations, but the Republican argument is basically that Biden “reversed,” “sabotaged” and “sacrificed” the so-called “energy independence” — some call it “energy dominance” — that the U.S. purportedly achieved under Trump.",
    "As the last few months have highlighted, the U.S. remains at the mercy of a global energy market that sets oil and gas prices at home and abroad — a reality that the Biden administration and environmentalists argue should motivate the nation to transition quickly to renewable energy sources.",
    "Early in his tenure, Biden paused new oil and gas leases on federal lands and waters pending the outcome of a review of the federal leasing program — an action that industry-allied Republicans falsely labeled a “ban” and falsely predicted would devastate the energy sector.",
    "Asked Wednesday if Biden would reconsider his decision to kill the Keystone XL, Psaki said doing so would not address any of the current petroleum problems in the U.S.\n“The pipeline is just a delivery mechanism, it is not an oil field,” Psaki said.",
    "Nevertheless, Republicans have attacked Biden with falsehoods about the beleaguered project, at times conflating it with the larger Keystone Pipeline system that’s been in operation since 2010 and which the Keystone XL was supposed to tie into.",
    "Biden ‘shut off’ the Keystone XL pipeline\nThe controversial Keystone XL pipeline was a proposed 1,179-mile, $8.5 billion project that would have transported some 830,000 barrels of dirty tar sands oil per day from Alberta, Canada, to Nebraska.",
    "The GOP campaign to blame Biden for both Russia’s war and high gas prices has included misleading statements and outright falsehoods, as well as circulating lists of demands that closely mirror those of the fossil fuel industry.",
    "In reality, the U.S. produced more oil and gas during Biden’s first year in office than during Trump’s, and crude oil output is forecast to reach a record high in 2023, according to the U.S. Energy Information Administration.",
    "If Republicans are talking about simply producing more energy than we consume, the U.S. remains energy independent today, as Robert Rapier, an energy industry engineer and author, pointed out in a Forbes piece this week.",
    "And it comes on the heels of the latest dire climate report from the United Nations, which warns that the window for reining in greenhouse gases in order to “secure a livable and sustainable future” is rapidly closing.",
    "Rather, it was a proposed extension, or shortcut, to transport Canadian oil to Nebraska, where it would link up with the existing Keystone pipeline and be sent to refineries in Texas and ultimately exported overseas.",
    "wrote that rising prices at the pump during Biden’s presidency “is what happens when you destroy America’s energy industry” — part of a broader argument that Biden is waging “war” on domestic fossil fuel companies.",
    "“Biden’s anti-energy policies have caused skyrocketing prices, ended America’s energy independence, and compromised our national security,” House Republicans wrote in a post from their official Twitter account.",
    "Two years after the pandemic tanked oil demand and prices, the nation’s largest producers — ExxonMobil, Chevron and ConocoPhillips — have seen their profits skyrocket alongside energy prices.",
    "“The Biden admin is doing next to nothing to practically inhibit near-term oil production,” Casey Merriman, an analyst at the industry research firm Energy Intelligence, wrote on Twitter.",
    "And at a press conference Tuesday, Sen. Roy Blunt falsely stated that the Keystone XL would have “produced” roughly the same number of barrels that the U.S. currently imports from Russia.",
    "Biden’s “agencies have been waging war on domestic production, and we’ve seen domestic production dropping and dropping and dropping,” Sen. Ted Cruz (R-Texas) told Fox News this week.",
    "Earlier this week, Biden signed an executive order banning Russian petroleum imports — a move that had bipartisan support but that Biden warned would drive gas prices up even higher.",
    "“I would suggest you ask the oil companies why they’re not using those if there’s a desire to drill more,” Psaki told Fox News’ Peter Doocy during a press conference this week.",
    "As White House press secretary Jen Psaki has pointed out repeatedly in recent weeks, the industry has stockpiled more than 9,000 unused but approved permits to drill onshore.",
    "“Flatly stated, the United States is not oil-independent, and hasn’t been since the early days of oil production,” Yahoo Finance columnist Rick Newman wrote this week.",
    "A federal judge later vacated those leases, concluding that the Biden administration failed to properly account for climate effects when it held the offshore auction.",
    "The Biden administration ‘destroyed’ America’s energy industry\nAdvertisement\nIn a post to Twitter this week, House Minority Whip Steve Scalise (R-La.)",
    "And while Biden campaigned on a promise to “take on the fossil fuel industry” and end drilling on federal lands and waters, that has not materialized.",
    "Approximately 75% of domestic oil production and 86% of gas production occurs on state and private lands, according to the Interior Department.",
    "None of this has prevented U.S. companies from moving ahead with drilling under already approved federal permits or on state or private lands.",
    "Biden revoked a key permit for the Keystone XL via a climate executive order on his first day in office, effectively killing it.",
    "Still, it imports millions of barrels of oil per day, including from Canada, Mexico, Saudi Arabia and, until recently, Russia.",
    "But if they’re talking about a nation free of any imported petroleum products, the U.S. never achieved that under Trump.",
    "Good morning https://t.co/PFNmFOGiEb pic.twitter.com/Qe5wChFb4g\n— Matthew Yglesias (@mattyglesias) March 10, 2022\n2.",
    "Nearly half of the roughly 25 million federal land acres currently under lease are not currently in production.",
    "A Trump-appointed federal judge in Louisiana later struck down Biden’s executive order that froze new leasing.",
    "So, I would suggest you ask the oil companies why they're not using those if there's a desire to drill more.\"",
    "It also held the largest offshore oil and gas lease sale in U.S. history in the Gulf of Mexico last year.",
    "Biden “shut off the Keystone Pipeline,” Rep. Jim Jordan (R-Ohio) declared in an interview last week.",
    "Advertisement\nWhite House @PressSec Jen Psaki:\n\"There are 9,000 unused approved drilling permits.",
    "It is being led by some of Washington’s largest beneficiaries of industry campaign donations.",
    "speaks at a House Republican news conference on energy policy at the U.S. Capitol on March 8.",
    "And even if they did, it would do little if anything to ease gas prices in the short term.",
    "“If we had a strong president, he would put the Keystone Pipeline back online,” Gov.",
    "(Under Trump’s watch, Russian oil imports increased 39%, as HuffPost reported).",
    "Kevin Dietsch via Getty Images\nAgain, the Keystone XL was never operational.",
    "The U.S. has been the world’s largest producer of oil and gas since 2018.",
    "“Get the Keystone Pipeline operating again!” Sen. Steve Daines (R-Mont.)",
    "Advertisement\nNone of this is likely to temper Republican rhetoric.",
    "Only 8% of the pipeline was constructed and it never carried oil.",
    "And in 2020, it became a net exporter of oil for the first time.",
    "For a destroyed industry, Big Oil is doing exceptionally well.",
    "Biden gave us expensive gas,” Jordan recently tweeted.",
    "“It does not provide more supply into the system.”\n4.",
    "And it was never going to “produce” a drop of oil.",
    "“Energy independence” can have different meanings.",
    "Let’s break down some of the biggest whoppers:\n1.",
    "House Minority Whip Steve Scalise (R-La.)",
    "Advertisement\nSen. John Kennedy (R-La.)",
    "demanded at a congressional hearing.",
    "?Trump gave us energy independence.",
    "Kristi Noem (R-S.D.)",
    "told Fox News.",
    "“?",
    "3."
  ]
}