{
  "id": 113,
  "mediaId": 2512,
  "date": "2022-02-24",
  "headline": "Jan. 6 committee interviews ex-aide who claims 'Trump was framed' for insurrection",
  "image": "https://www.alternet.org/media-library/image.png?id=29420648&width=1200&coordinates=0%2C0%2C0%2C126&height=600",
  "link": "https://www.alternet.org/2022/02/jason-funes-trump-framed-insurrection/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandi Buchman",
  "authorUrl": "https://www.alternet.org/author/brandibuchman",
  "termIds": [
    2119,
    4905,
    3639,
    2765,
    2879,
    2969,
    1394,
    273,
    5949
  ],
  "sentences": [
    "Alexander and Jones “attracted attention to the U.S. Capitol building, yelling that they had a permitted event and to come to the event but Jones trapped everyone to come to the Capitol building steps and create more chaos to steal the election from Trump as opposed to stopping it,” Funes said in November.",
    "Arriving on the 2020 Trump campaign after a stint as a special assistant to Trump’s ethics-rules abusing Interior Secretary Ryan Zinke, Funes joined the ranks of ‘Stop the Steal’ and Women for America First organizers that were readying themselves for the pro-Trump events at the Ellipse on Jan. 6.",
    "Law enforcement agencies like the FBI have confirmed there was no participation by either BLM or antifa activists in the Capitol attack though that has not stopped the former president or his lackeys from promoting the theory anyway.",
    "Investigators are likely far more interested in having Funes field questions about his role helping to organize pro-Trump rallies rather than his easily-debunked conspiracy theory that Trump was “framed” for the insurrection.",
    "Funes has historically pushed blame for the violence that day on Black Lives Matter and anti-fascist activists despite having no proof of their involvement beyond backing of the claim from Trump attorney Rudy Giuliani.",
    "!” [Emphasis original] and in light of the burgeoning aggression from Russia against Ukraine, he called “foreign wars” a distraction, put the blame on President Joe Biden, and called the Jan. 6 probe crooked.",
    "Fake Trump supporters created violence, Trump was framed.”\nAll of the lawmakers voted to overturn the 2020 election results and both Jordan and Banks serve on a Republican-controlled Jan. 6 shadow committee.",
    "Golec describes herself as an “all-American Entrepreneur, Christian Conservative, Citizen Journalist, and a Constitutionalist” on her campaign website for the Maricopa County Board Supervisors in Arizona.",
    "In their interview, Funes claimed that the rioting at the U.S. Capitol was effectively orchestrated by right-wing activist and ‘Stop the Steal’ movement leader Ali Alexander and InfoWars host Alex Jones.",
    "Jason Funes, a Jan. 6 rally organizer and former aide to President Trump who insists that Trump was framed for the insurrection at the Capitol, has been interviewed by the Jan. 6 Committee.",
    "In December, when his mother received a letter from the committee notifying her that it had subpoenaed Verizon for her son’s phone records, Funes told CNN he was outraged.",
    "Funes has outwardly aligned himself on Twitter against other Trump world or supporting figures like Roger Stone, Nick Fuentes, and Proud Boy Enrique Tarrio, to name a few.",
    "In the last week, Funes tagged Republican lawmakers like Reps. Jim Jordan, Jim Banks, and Senator Josh Hawley with messages like, “Not all #J6 prisoners are created equal.",
    "“\nPosts on his Twitter account, where Funes labels himself as “Latino MAGA Man” are littered with allegations that Jan. 6 was a “staged coup” intended to frame Trump.",
    "In a Twitter post on Thursday after news broke that he met with investigators, Funes wrote: “The first victim of every war is the TRUTH!",
    "Funes has also claimed that Jacob Chansley, the so-called “Q-Anon Shaman” who stormed the Capitol, has been unfairly prosecuted.",
    "He would have been a “willing witness” and wished investigators contacted him directly, he said.",
    "“Jacob Chansley was the Lee Harvey Oswald of January 6,” Funes said last November.",
    "Funes did not immediately return a request for comment to Daily Kos on Thursday.",
    "Funes does not appear to have been formally subpoenaed.",
    "NBC News was first to report the development Thursday.",
    "In November, Funes did an interview with Gail Golec."
  ]
}