{
  "id": 11333,
  "mediaId": 2752,
  "date": "2022-03-17",
  "headline": "Clown Convoy Threatens Capital, Gets Audience With GOP Congressmen",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTU1MTE2Mi9vcmlnaW4uZ2lmIiwiZXhwaXJlc19hdCI6MTY1Njk3MzI2NX0.4gGERdVNFU5Ewq1CZPeDzns-5CAwcTHBr7E2B3BaZb0/img.gif?width=1200&coordinates=0%2C64%2C0%2C64&height=600",
  "link": "https://www.wonkette.com/clown-convoy-threatens-capital-gets-audience-with-gop-congressmen",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Dye",
  "authorUrl": "https://www.wonkette.com/u/five_dollar_feminist",
  "termIds": [
    5127,
    3925,
    3692,
    474,
    6036
  ],
  "sentences": [
    "The permit rejection didn’t come up at the group’s meeting on Tuesday evening, where organizer Mike Landis said that while the prospect of “tear[ing] the fence down at the White House and hang[ing] politicians” was “extremely enticing,” he added that isn’t “why we are here.”\n“Hard-working Kansans — especially those who have driven over 1,000 miles to get to D.C. — deserve access to their U.S. Capitol,” Marshall said.",
    "Yesterday this ragtag band of QAnon loons and assorted conspiracy theorists spent several hours clogging the Capital Beltway like pus, even dribbling into the streets of DC proper despite the cops' best efforts to close the exits and keep them out.",
    "But I was trying to, I guess, make it easier on them.”\nOn the application, Brase had listed \"antifa\" as a potential disruptor of the event, and indeed these weirdos seem to think that everyone who gives them the finger is \"antifa.\"",
    "Let's take a wildass guess that he would not say the same about Black Lives Matter protestors who descended on DC with the stated goal of fucking up traffic until the government gave them what they wanted.",
    "There are no more lockdowns, and the federal mask mandates have been substantially pared back, still this merry band of dipshits is going to fuck up traffic until their unspecified demands are met.",
    "When racial justice protestors take to the streets to demand that police stop killing Black people, Republicans call them terrorists and accuse them of trying to burn down America.",
    "— but other scheduled rallies and the organizers' inability to provide the most basic details about headcount prompted them to pull the application for the permit.",
    "Daily Beast reporter Zachary Petrizzo has been following these loons for the past couple of weeks as they descended on the capital to protest ... something.",
    "Then Kansas Senator Roger Marshall invited them in for a guided tour of the Capitol, which is still closed to visitors because of COVID.",
    "“Today we’re getting right next to their walls,” People’s Convoy co-organizer Mike Landis told the Washington Post on Monday.",
    "“We’re not going to go in and throat-punch them just yet, even though I know we would all love to do that.”\nHe seems nice.",
    "Convoy leader Brian Brase sought to cast the decision not to go into the city as one of solicitude for the Park Service.",
    "According to Politico, this freaked out at least one congressional staffer so much that they called the FBI.",
    "Not so with these brave, white patriots, who have been granted an audience with several members of Congress.",
    "Gosh, are these the kind of people who should be getting to map out those corridors up close and personal?",
    "The Post reports that the convoy applied for a permit to camp out on the Mall for two weeks — two weeks!",
    "First it was Ted Cruz feeling the winds of freedom ruffle the mutton chops that cover his manly jowls.",
    "Like a case of drug resistant syphilis, the People's Convoy continues to plague DC's highways.",
    "And today it is raining in DC, which will make their shenanigans even more obnoxious.",
    "Hey, you know who else has really bad judgment and lives to trigger the libs?",
    "And if you're ordering from Amazon, use this link, because reasons.",
    "Smash that donate button to keep your Wonkette ad-free and feisty.",
    "“They never told me I had to cut it down at all,\" he said.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "\"They were totally willing to facilitate that.",
    "They even make it legal to run them over.",
    "It’s a First Amendment right protest.",
    "tHe tRuCkEr hAs bEcOmE tHe sCiEnTiSt!",
    "How often would you like to donate?",
    "Tell us, Zachary Petrizzo!",
    "Or maybe they'll do worse."
  ]
}