{
  "id": 11344,
  "mediaId": 2748,
  "date": "2022-03-10",
  "headline": "Is The January 6th Pipe Bomb Investigation Another F.B.I. False Flag?",
  "image": "https://libertywire.net/wp-content/uploads/2022/03/Kamala-Harris-1200x630-1.png",
  "link": "https://libertywire.net/is-the-january-6th-pipe-bomb-investigation-another-f-b-i-false-flag/",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2119,
    3468,
    1125,
    474,
    391,
    6709
  ],
  "sentences": [
    "Earlier, the Congressman revealed he is seeking an FBI briefing by March 23 after a “whistleblower disclosure” on the DC pipe bomb investigation https://t.co/38Onjxy7XU\n— Daniel Chaitin (@danielchaitin7) March 9, 2022\nAccording to Washington Examiner:\nThe special agent, who was not identified, claimed that the request was “unusual” because it came a year after the investigation began, and Jordan said it raises questions about the progress and extent of the inquiry.",
    "— Jordan Schachtel @ dossier.substack.com (@JordanSchachtel) January 15, 2021\nOhio Republican lawmaker Jim Jordan said he has requested a briefing with the FBI after a whistleblower allegedly disclosed information regarding the bureau’s investigation into pipe bombs planted near the Democratic National Committee and Republican National Committee headquarters in Washington the night before the Jan. 6 breach of the U.S. Capitol.",
    "One pipe bomb was placed in an alley behind the Republican National Committee headquarters, while the other was placed next to a park bench near the Democratic National Committee headquarters.",
    "At this moment one year ago someone was planting pipe bombs at the RNC and DNC\nThe FBI has never updated us on the investigation\nNo suspects, no charges, nothing\n— Jack Posobiec ??",
    "Director Chris Wray:\nRep @Jim_Jordan sent this letter to FBI Director Wray—\nA Whistleblower Inside the Bureau is Raising Questions about the January 6 Pipe Bomb Investigation.",
    "Both bomb threats were neutralized by authorities, but the identity of the suspect remains one of the biggest mysteries stemming from the events surrounding the Capitol riot.",
    "(@JackPosobiec) January 6, 2022\nThe FBI claimed to simultaneously find two pipe bombs at RNC and DNC HQs at the exact same time of the cap hill raids.",
    "Video evidence, and eye-witness testimony from a New York Times reporter are among just some of the evidence which suggests that the F.B.I.",
    "(@TaylerUSA) March 10, 2022\nThe FBI tells @dcexaminer it received the letter from @Jim_Jordan but has no further comment at this time.",
    "in a very poor position, as the public continues to lose faith and confidence in the agency as a whole.",
    "lies related to claims the agency made about finding a pipe bomb at the DNC on January 6th.",
    "is once again drawing the ire of GOP members…\nAccording to recent reports, an F.B.I.",
    "Rep. Jim Jordan has since echoed these concerns, and sent this letter to F.B.I.",
    "Shouldn’t this be a priority investigation & communicated to the public?",
    "had far more to do with the January 6th riots than Trump supporters.",
    "whistleblower has raised the alarm on potential F.B.I.",
    "itself has admitted that there was no ‘insurrection‘.",
    "Why do we know nothing about this investigation?",
    "pic.twitter.com/wOr0XWCWhd\n— Tayler Hansen ??",
    "This evidence has placed the F.B.I.",
    "We now know that the F.B.I.",
    "Who planted the devices?",
    "Now the F.B.I.",
    "READ ORIGINAL"
  ]
}