{
  "id": 11347,
  "mediaId": 2614,
  "date": "2022-03-17",
  "headline": "Jim Jordan Calls Out Dems Trying To “Codify” Past Efforts To Label Parents Domestic Terrorists [VIDEO]",
  "image": "https://www.lifezette.com/wp-content/uploads/2020/06/2020.06.10-08.23-lifezette-5ee14144aa44b.png",
  "link": "https://www.lifezette.com/2022/03/jim-jordan-calls-out-dems-trying-to-codify-past-efforts-to-label-parents-domestic-terrorists-video/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Voice Media",
  "authorUrl": "https://www.lifezette.com/author/redvoicemedia/",
  "termIds": [
    2119,
    2451,
    4905,
    4593,
    1474,
    474,
    6709
  ],
  "sentences": [
    "The House Judiciary Committee is currently in the midst of considering a bill dubbed the “Domestic Terrorist Prevention Act“, which according to the bill text would “authorize dedicated domestic terrorism offices within,” DHS, DOJ, and the FBI ” to analyze and monitor domestic terrorist activity and require the Federal Government to take steps to prevent domestic terrorism.”\nAccording to Rep. Jordan, this bill would essentially “codify” the process the Biden administration engaged in late 2020 that sought to flag parents speaking out during local school board meetings as being potential domestic terrorism threats, reminding the House floor of how AG Merrick Garland tried concealing this reality during his testimony in October of 2020.",
    "“And then of course we have October 21st…the day that the Attorney General came in front of this committee and made this statement, ‘ I cannot imagine any circumstances where parents are treated as domestic terrorists.’ Only problem with that statement is the very day before, the email had went out to FBI agents around the country saying, ‘treat parents as domestic terrorists, put this threat tag label on them.’\nAnd now here we are today.",
    "I think this is definitely the wrong direction to go.”\nRep. Jordan added that he would like to see Rep. Jerry Nadler eventually bring back AG Garland to the House committee so that they can get to the bottom of the back-and-forth that occurred between the DOJ and the National School Boards Association.",
    "WASHINGTON, DC – Rep. Jim Jordan went on a tirade on the House floor earlier in March while calling out a bill that he said would “codify” the Biden administration’s past efforts to label parents attending school board meetings as being potential domestic terrorists.",
    "Here we are today with a bill that is going to codify, in effect, what took place that the chairman refuses to actually have any more hearings on.",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "This bill is going to put in place what these guys attempted to do and did last fall.",
    "It originally appeared in RedVoiceMedia.com and is used by permission.",
    "This piece was written by Gregory Hoyt on March 17, 2022."
  ]
}