{
  "id": 1137,
  "mediaId": 2594,
  "date": "2022-02-16",
  "headline": "Why Donald Trump is once again claiming Democrats ‘spied’ on him",
  "image": "https://static.independent.co.uk/2022/02/10/20/Capitol_Riot_Investigation_67366.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/trump-spying-claims-durham-democrats-b2016565.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Sommerlad",
  "authorUrl": "https://www.independent.co.uk/author/joe-sommerlad",
  "termIds": [
    1708,
    2415,
    2119,
    4307,
    3925,
    4905,
    2765,
    5676,
    5665,
    1352
  ],
  "sentences": [
    "They have meanwhile dismissed last September’s indictment on the basis that it “reads as though there was a vast conspiracy, involving the Clinton Campaign and Mr Sussmann, to defraud the FBI into investigating Donald Trump as part of an ‘October surprise’... but the indictment does not charge anyone other than Mr Sussmann; the indictment does not charge a conspiracy; and the Indictment does not even charge a fraud.”\nMr Durham’s latest filing gets even more convoluted when he discusses Mr Sussman’s connection to tech executive Rodney Joffe, whose cybersecurity researchers allegedly first alerted him to the possible Trump Organization link to the Kremlin.",
    "In a stronger period of time in our country, this crime would have been punishable by death.”\nIn an even briefer statement three days later, evidently still basking in the glow of apparent triumph, he proclaimed: “I was proven right about the spying, and I will be proven right about 2020.”\nThe same development was likewise hailed loudly by Tucker Carlson on Fox News and on social media by loyalists including Donald Trump Jr, Ronna McDaniel, Ted Cruz, Kevin McCarthy, Marjorie Taylor Greene, Mark Meadows and Jim Jordan but what exactly has Mr Durham alleged?",
    "His latest, highly complex court filing revolves around a meeting that took place on 19 September 2016 between prominent cyber security lawyer Michael Sussman – whom Mr Durham charged with lying to the FBI last year – and the bureau’s general counsel James Baker, in which the former told the latter that he had been apprised of the existence of a possible secret communication channel between a Trump Organization computer and those belonging to the Kremlin-backed Alfa Bank.",
    "Ex-US attorney general William Barr had appointed the former attorney for the District of Connecticut to undertake the investigation, widely seen as revenge for Robert Mueller’s probe into Russian election interference and possible collusion with the Trump campaign, in April 2019, elevating his position to that of Justice Department special counsel in December 2020 to ensure his work could continue even after Mr Trump was replaced in the Oval Office by Joe Biden.",
    "“The latest pleading from Special Counsel Robert [sic] Durham provides indisputable evidence that my campaign and presidency were spied on by operatives paid by the Hillary Clinton Campaign in an effort to develop a completely fabricated connection to Russia,” the celebrity property tycoon turned demagogue declared on 12 February, getting his own champion’s name wrong before openly calling for executions.",
    "Now banned from Twitter and out of office, Mr Trump has issued two press releases from the shadows of his palatial residence in Florida crowing over the latest court filing from special counsel John Durham, who continues to investigate the origins of the FBI’s probe into possible ties between the Trump campaign and Russia in search of “deep state” Democratic bias, as evidence that he was right all along.",
    "Mr Durham also discusses a second meeting between Mr Sussman and the CIA on 9 February 2017, after Mr Trump had been inaugurated, at which the special counsel alleges the interviewee claimed that “Trump and/or his associates were using supposedly rare, Russian-made wireless phones in the vicinity of the White House and other location”, apparently again citing Mr Joffe.",
    "In addition to Mr Sussman, Mr Durham has also charged Kevin Clinesmith, a former FBI lawyer who pleaded guilty in 2020 to doctoring an email related to the surveillance of former Trump aide Carter Page, and Igor Danchenko, a Russian-American analyst who allegedly fed information to former British spy Christopher Steele, author of the notorious Steele Dossier.",
    "Mr Durham said his office found “no support” for such a claim and, according to journalist Marcy Wheeler, an expert on national security, his filing of the document on 11 February 2022 means the five-year statute of limitations for charging a crime in connection with Mr Sussman’s CIA meeting had passed two days earlier.",
    "But, according to The Washington Post, the contract in question appears to have been awarded in 2016 when Mr Obama was still in office and it remains unknown whether obtaining access to DNS traffic was part of its agreed terms or whether a definite violation of those terms is alleged to have taken place.",
    "The connection to the Clinton campaign comes in, according to Mr Durham, because Mr Sussman was working for the law firm Perkins Cole at the time, affiliated with the Democratic nominee’s presidential bid, and billed them accordingly for his time spent with the FBI on the Alfa Bank matter.",
    "Rather than “spying” on the Trump campaign, the researchers were instead working at the request of federal officials to investigate Russian malware attacks that had targeted the US government and the White House, said Jody Westby, a lawyer for one of the research scientists involved.",
    "Mr Joffe and his associates had secured a contract with the Executive Office of the President to provide cybersecurity to the White House and in so doing obtained access to its domain name system (DNS) internet traffic, enabling them to puruse what staff were searching for.",
    "Former US President Donald Trump first made the astonishing allegation that his predecessor Barack Obama had ordered the wiretapping of the phones in Trump Tower, his New York City headquarters, in a tweet on 4 March 2017, not long after he had entered the White House.",
    "Mr Sussman’s lawyers, Latham & Watkins, have vigorously denied that he ever lied to the FBI and have accused Mr Durham of filing false accusations “intended to further politicise this case, inflame media coverage, and taint the jury pool”.",
    "“This is a scandal far greater in scope and magnitude than Watergate and those who were involved in and knew about this spying operation should be subject to criminal prosecution.",
    "The US was on high alert at the time after the hacking of Democratic National Committee emails by Russian operatives, their findings subsequently released by WikiLeaks.",
    "However, the special counsel admits that he has no evidence to suggest that Mr Sussman discussed his suspicion with anyone on the Clinton campaign.",
    "Mr Durham alleges that this privilege was “exploited … for the purpose of gathering derogatory information about Donald Trump”.",
    "The FBI appear to have investigated Mr Sussman’s tip-off but found nothing in it.",
    "Mr Danchenko is accused of lying to the FBI about his sources.",
    "But where Mr Obama comes into all of this is anybody’s guess."
  ]
}