{
  "id": 11444,
  "mediaId": 2668,
  "date": "2022-03-16",
  "headline": "Kansas Senator Responds Accordingly to 'Hill Aide' Who Reported His Trucker Convoy Tour to the DOJ",
  "image": "https://media.townhall.com/townhall/reu/o/2022/53/0f80ff0d-2e54-4964-938c-8ff92ff8ff3c-1110x740.jpg",
  "link": "https://redstate.com/sister-toldjah/2022/03/16/kansas-senator-responds-accordingly-to-hill-aide-who-reported-his-trucker-convoy-tour-to-the-doj-n536879",
  "mediaOutlet": "Redstate ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sister Toldjah",
  "authorUrl": "https://redstate.com/author/sister-toldjah",
  "termIds": [
    5127,
    4972,
    4528,
    4905,
    400,
    1442,
    1474,
    1489,
    6678
  ],
  "sentences": [
    "Recent reports revealed that staffers in the House and Senate are both conferring on a “three-phase plan” that would, if approved, begin (on March 28th) the process of re-opening both sides to staff-guided tours, with the final phase potentially starting on Sept. 5th being “the reopening of the entire Capitol complex for business as usual.”\nAny news piece you see about discussions of the Capitol getting back to normal usually includes quotes from people who talk about how there are “concerns” from some House and Senate members about reopening due to alleged trauma still felt over the Capitol riot.",
    "House Judiciary Committee Ranking Member Rep. Jim Jordan (R-Ohio) and Rep. Dan Bishop (R-N.C.) also went off, according to the DC, with Jordan calling it “crazy” and pointing out that everything about the Capitol is taxpayer-funded, and Bishop calling it “absurd” and noting that “the new normal for Democrats [is] to treat working-class Americans with disdain.”\nSen. Marshall also took shots at Politico for its breathless reporting:\nPulitzer Prize-winning article right here ?",
    "Since the coronavirus pandemic started here in the United States, the Capitol complex in Washington, D.C. has been mostly closed off to the public, with a relaxing of the rules in December 2021 on the Senate side that allowed for small tours provided the ones that are given are limited to a smaller area than what was normally allowed.",
    "Marshall himself responded accordingly, telling the Daily Caller that it was just nuts that this was even an issue:\n“Who would have known that taking a friendly group of hard-working American truckers, including Kansans, on a public tour of their nation’s Capitol building would cause such a stir.",
    "Let’s not forget, these are the essential workers who showed up to work every day in the earliest months of the pandemic to deliver goods and food to Americans,” Marshall said in a statement to the Daily Caller.",
    "Apparently, it is that supposed “concern” that led a senior Capitol Hill aide to report a guided tour Sen. Roger Marshall (R-Kan.) gave to members of the American trucker convoy to Joe Biden’s Dept.",
    "A senior congressional aide alerted the Department of Justice about the truckers’ presence out of concern that the guided tour could help the protesters plan an entry into the building.",
    "Capitol Hill police have been preparing for weeks for the truckers to descend on the Capitol as the final destination of their cross-country journey that started in Southern California.",
    "of Justice:\nSen. Roger Marshall (R-Kan.) gave truckers in the so-called “People’s Convoy” a tour of the Capitol last week — even as the building remains mostly closed to the public.",
    "The story also noted that Marshall’s office said the tour he gave “complied with” the “small, limited tours” guidelines outlined by the Senate sergeant-at-arms back in December.",
    "?https://t.co/mQFzbo26fD\n— Dr. Roger Marshall (@RogerMarshallMD) March 16, 2022\n… and later again had words for the Hill “Karen” who reported him to the DOJ:\nIf a U.S.",
    "“Now senior congressional aides feel the need to report a Senator giving these same people a tour of the United States Capitol to the Department of Justice?",
    "Hard-working Kansans — especially those who have driven over 1,000 miles to get to D.C. — deserve access to their U.S. Capitol,” he continued.",
    "https://t.co/6UhSA3Y36y\n— Dr. Roger Marshall (@RogerMarshallMD) March 16, 2022\nThe man has a point.",
    "Senator giving a tour to Americans bothers you, you’re in the wrong line of work."
  ]
}