{
  "id": 11457,
  "mediaId": 5308,
  "date": "2022-03-18",
  "headline": "The House of Representatives passed the “Creating a Respectful and Open World for Natural Hair,” or CROWN Act, Friday.",
  "image": "https://video-images.vice.com/articles/6234e23f12f04e009a001cc1/lede/1647632966646-gettyimages-1319381482.jpeg?image-resize-opts=Y3JvcD0xeHc6MC44NDN4aDsweHcsMC4xNDU0eGgmcmVzaXplPTEyMDA6KiZyZXNpemU9MTIwMDoq",
  "link": "https://www.vice.com/en/article/akvq8j/house-passes-the-crown-act",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Trone Dowd",
  "authorUrl": "https://www.vice.com/en/contributor/trone-dowd",
  "termIds": [
    4230,
    1489,
    1477,
    392,
    5967
  ],
  "sentences": [
    "“We ask that, among your priorities, you advocate for the passage of the CROWN Act.”\nIn 2019, a coalition of pro-Black civil groups including the National Urban League, Color Of Change, and the Center for Western Law and Poverty banded together to create the CROWN Coalition, which advocates nationally for the passage of laws that would put an end to these practices.",
    "“The Democrats today, Friday, March 18, 2022, with chaos all over the place, this is what they're focused on.”\nFor decades, institutions like schools and workplaces in certain states have deemed certain hairstyles, particularly those that reflect Black culture such as braids, afros, and different varieties of locs, inappropriate or unprofessional.",
    "House Bill 2116, better known as “Creating a Respectful and Open World for Natural Hair,” or CROWN, would prohibit any institution from refusing to hire, train, or continue to employ someone qualified based on the styling or texture of their hair and prevent people from being discriminated against in public places such as schools.",
    "“As a woman of color, we know that you understand personally the ways in which bias—overt discrimination and its equally harmful unintentional and systemic counterparts—shapes so much of the world,” the letter, which was drafted by the likes of Reps. Barbara Lee, Ilhan Omar, Ayanna Pressley, and Gwen Moore, reads.",
    "Coleman, along with four other Black officials in the House of Representatives, have already penned a letter to Vice President Kamala Harris about the importance of having her support, likely in case the Senate vote splits evenly.",
    "“Natural Black hair is often deemed ‘unprofessional’ simply because it does not conform to white beauty standards,” New Jersey U.S. Rep. Bonnie Watson Coleman, the Democrat who sponsored the bill, said in a statement.",
    "The CROWN Act, a congressional bill that aims to put an end to hair discrimination that routinely affects people of color in the workplace and other institutions, passed the House of Representatives on Friday.",
    "Some Republicans argued that the bill shouldn’t be a priority because it’s a relatively low-stakes issue that’s already handled by current federal discrimination laws, even if it’s not explicitly mentioned.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "I’m proud to have played a part to ensure that we end discrimination against people for how their hair grows out of their head.”\nOn Friday, the bill passed with 235 yes votes and 189 nay votes.",
    "With Democrats in control of the Senate, the CROWN Act has an almost guaranteed pathway to the president’s desk, and the White House has already signaled support for the bill.",
    "Since 2019, the CROWN Coalition has successfully advocated for 14 states, including California, New York, Virginia and Massachusetts, to pass their own version of the bill.",
    "While outlawing hair discrimination has been passed on a local level in some states, the House’s passage would prohibit this particular type of racism on a federal level.",
    "In February, the House had tried to fast-track the bill thinking Republicans would support it, but voting fell short of the supermajority needed to pass.",
    "More than 30 cities, including Philadelphia, Louisville, Tucson, and New Orleans have also enacted their own local versions of the CROWN Act.",
    "The move brings the proposal, which Black women in the House have long advocated for, the closest it’s ever been to becoming law.",
    "These standards reinforce the perception that Black hair is somehow wrong and more eurocentric looks and styles are right.",
    "It’s wrong if it happens,” Republican Rep. Jim Jordan of Ohio said Friday.",
    "“Discrimination against Black hair is discrimination against Black people.",
    "Countless lawsuits show that these practices still exist.",
    "Want the best of VICE News straight to your inbox?",
    "“It’s covered.",
    "Sign up here."
  ]
}