{
  "id": 11465,
  "mediaId": 2919,
  "date": "2022-03-15",
  "headline": "DeWine signs law removing training, background check, permitting requirement to conceal carry",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/c701402/2147483647/strip/true/crop/640x336+0+72/resize/1200x630!/quality/90/?url=https%3A%2F%2Fsharing.news5cleveland.com%2Fsharescnn%2Fphoto%2F2017%2F04%2F11%2FGettyImages-158477645_1491953120050_58117036_ver1.0_640_480.jpg",
  "link": "https://www.news5cleveland.com/news/state/dewine-signs-law-removing-training-background-check-permitting-requirement-to-conceal-carry",
  "mediaOutlet": "WEWS ABC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Zuckerman",
  "authorUrl": "https://www.news5cleveland.com/jake-zuckerman",
  "termIds": [
    0
  ],
  "sentences": [
    "Supporters of the legislation say it’s a logical extension of the Second Amendment to the U.S. Constitution, which states: “A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.”\nSen. Terry Johnson, R-McDermott, the bill’s lead sponsor, said in a floor speech the bill is also in some ways a response to protesters “burning down their own cities” — a reference to racial justice protests that formed in the wake of a police officer murdering George Floyd during a stop in the summer of 2020.",
    "Republicans have made it crystal clear that they value the approval of the gun lobby more than the lives of Ohioans and the police officers who protect our communities every day.”\nGary Wolske, president of the Fraternal Order of Police of Ohio, spoke out against the law in a Columbus Dispatch column.",
    "The enactment of “constitutional carry” or “permitless carry” marks a long-coveted win for the gun rights movement and firearms lobby, and a major loss for Democrats, anti-gun violence activists, police organizations and public health researchers who opposed it.",
    "For instance, the American Journal of Public Health found that states with looser concealed carry regulations were associated with an 11% increase in handgun homicide rates than states with stricter policies.",
    "The Ohio Supreme Court has held since 2003 that “there is no constitutional right to bear concealed weapons.” While the right to bear arms, the court said, is fundamental, it is not without limitations.",
    "In a statement, House Minority Leader Allison Russo criticized DeWine, emphasizing the thousands of concealed carry permits that are denied, revoked or suspended every year under the current system.",
    "Modeling from the National Bureau of Economic Research found states that adopt concealed carry laws experience between a 13% and 15% increase in violent crime in the 10 years after implementation.",
    "This is a great moment for Ohio and for those who wish to more fully exercise their Constitutional right to keep and bear arms.”\nThe bill passed the House 58-36, with only Republicans in support.",
    "However, gun supporters often point to a study published in the American College of Surgeons that didn’t identify any significant association after states adopted looser gun policies.",
    "Mike DeWine signed a “stand your ground” bill into law, which removes the legal requirement that a person try to retreat from a perceived attack before responding with lethal force.",
    "\"SB 215 completely betrays Ohioans who have called time after time for commonsense gun safety legislation, not extreme bills that endanger the lives of our children and families.",
    "According to the Health Policy Institute of Ohio, between 1999 and 2020 there have been large increases in annual rates of homicides (123%) and suicides (49%) in the state.",
    "When the law takes effect in 90 days, all Ohioans aged 21 and older who are lawfully allowed to possess a weapon will be able to carry it concealed on their persons.",
    "Two years later, the legislature passed a law preemptively blocking Ohio cities from passing any gun restrictions stricter than those established by the state.",
    "He argued the requirement to seek a permit is a reasonable one that strikes a balance between constitutional rights, officer safety, and public safety.",
    "The following article was originally published in the Ohio Capital Journal and published on News5Cleveland.com under a content-sharing agreement.",
    "“Removing these responsible and reasonable precautions compromises the safety and security of our communities and law enforcement,\" Russo said.",
    "Mike DeWine signed a bill into law Monday removing training, background check and permitting requirements to carry a concealed weapon in Ohio.",
    "The law was used to squash lawsuits from Ohio cities including Clyde, Cleveland and Cincinnati seeking to regulate guns within their borders.",
    "Bob Peterson, Tim Schaffer and Kirk Schuring; and state Reps. Jamie Callender, Bill Seitz, Scott Oelslager, Tom Patton and Jean Schmidt.",
    "The new law also removes a requirement under current law that those carrying a weapon \"promptly\" notify an officer that they're armed.",
    "Two Republicans voted in opposition with Democrats, though at least one said he did so only because the bill does not go far enough.",
    "While permitless carry doesn't change who can possess a gun, it removes an additional layer of scrutiny within the current system.",
    "Prior law required them to undergo eight hours of training, a background check, and an application through their local sheriff.",
    "Several of its sponsors at the time remain in office including (by their current offices) Auditor Keith Faber, Lt. Gov.",
    "Critics say the policy will enable undertrained and possibly dangerous or unstable people to carry a concealed weapon.",
    "“This is a day that will go down in history,” said Dean Rieck, Executive Director of Buckeye Firearms Association.",
    "In March 2015, a new law reduced the required training hours to receive a concealed carry permit to eight from 12.",
    "The governor announced passage of the permitless carry bill in a news release comingled with several other bills.",
    "While the prevalence of guns in suicides is steady, they’re becoming increasingly prevalent in homicides.",
    "“The brass ring has always been to eliminate the licensing mandate … and now, finally, that day is here.",
    "Ohio is now the 23nd state in the U.S. with a permitless carry law, according to a count from the U.S.",
    "Sen. Jerry Cirino, R-Kirtland, voted against the bill when the Senate first passed it in December.",
    "Several states including Iowa, Tennessee, Texas, and Wyoming passed versions of the law in 2021.",
    "Instead, people who are carrying need only inform an officer they're armed if the officer asks.",
    "Public health research has linked concealed carry policies to increases in violent crimes.",
    "Jon Husted; congressmen Bob Gibbs, Jim Jordan and Bob Latta; state Sens.",
    "Ohio first enacted a concealed program shortly thereafter in 2004.",
    "Alabama signed the legislation into law just last week.",
    "Since then, Ohio has steadily loosened its gun laws.",
    "However, he reversed on the final Senate vote.",
    "All Democrats voted against the bill.",
    "It passed in the Senate 24-9.",
    "Concealed Carry Association.",
    "He didn't offer any comment.",
    "Early last year, Gov.",
    "Gov."
  ]
}