{
  "id": 11514,
  "mediaId": 2701,
  "date": "2022-03-10",
  "headline": "Whistleblower: FBI Is Just Now Asking Basic Questions About Jan. 6 Pipe Bombs — A Year Into Its Investigation",
  "image": "https://thefederalist.com/wp-content/uploads/2022/03/24123110718_526f17ffcf_k.jpg",
  "link": "https://thefederalist.com/2022/03/10/whistleblower-fbi-is-just-now-asking-basic-questions-about-jan-6-pipe-bombs-a-year-into-its-investigation/?utm_source=rss&utm_medium=rss&utm_campaign=whistleblower-fbi-is-just-now-asking-basic-questions-about-jan-6-pipe-bombs-a-year-into-its-investigation",
  "mediaOutlet": "The Federalist",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kylee Zempel",
  "authorUrl": "https://thefederalist.com/author/kyleezempel/",
  "termIds": [
    2119,
    3468,
    3246,
    474,
    1474,
    1442
  ],
  "sentences": [
    "According to a letter sent on Wednesday from Rep. Jim Jordan, ranking member of the House Judiciary Committee, to FBI Director Christopher Wray, the FBI agent filed a whistleblower disclosure about the pipe bomb investigation — an investigation the Associated Press had characterized as “one of the highest-priority investigations for the FBI and the Justice Department.” The agent alleged that on Feb. 7, 2022, more than a year after the bombs were planted, the bureau’s Washington Field Office asked its other field offices “to canvass all confidential human sources nationwide for information about the individual and the crime.”\nThe canvass should “include sources reporting on all [types of] threats,” the message from Washington to the other FBI field offices requested, because the bomber’s “motive and ideology remain unknown.”\n“The special agent explained that the [Washington Field Office] request was ‘unusual’ because it was transmitted more than a year after the FBI had begun the investigation, and it raises questions about the progress and extent of the FBI’s investigation,” Jordan’s letter said.",
    "According to Jordan, the FBI “has not fully responded to Rep. Posey’s request, explaining that it was exclusively providing information to the partisan Democrat-led Select Committee investigating the events of January 6, 2021.”\nLike the sham impeachment of Donald Trump, the Jan. 6 committee that the FBI is hiding behind has proved to be nothing more than a partisan show trial by Democrats, who excluded legitimate Republican representation from the committee, misled witnesses, and fabricated evidence including multiple text messages.",
    "A senior FBI special agent has sounded the alarm on the bureau’s investigation into the pipe bombs that were placed outside the Democratic National Committee and Republican National Committee buildings the night before the Jan. 6, 2021, riot at the Capitol, suggesting that the investigation has been a low priority and made no real progress.",
    "“The FBI’s decision to provide information on a partisan basis is antithetical to the FBI’s purported impartiality and it further erodes public confidence in the FBI’s senior leadership,” Jordan wrote to the FBI director.",
    "According to October reporting from Revolver, Epps, who was captured on video encouraging people to go inside the Capitol, disappeared from the FBI’s Capitol Violence Most Wanted List with no explanation over the summer.",
    "House Speaker Nancy Pelosi has also used her committee as a smokescreen to distract from her own failures to secure the Capitol, as reports show Capitol Police were woefully unprepared to handle the events of Jan. 6.",
    "During a congressional hearing in January, the FBI refused to answer questions about their potential involvement on Jan. 6 the year prior, including questions about Ray Epps.",
    "Beyond the FBI’s exclusive cooperation with Democrats, the bureau’s investigation of the Jan. 6 riot and the events surrounding it has been dubious since the beginning.",
    "Jordan also noted that the FBI failed to fully answer questions raised in early September by Rep. Bill Posey, R-Fla., about the status of the pipe bomb probe.",
    "The New York Times reported in September that federal agents were part of the crowd that stormed the Capitol.",
    "Newsweek then revealed in January that secret commandos with “shoot-to-kill” authority were also present.",
    "In fact, evidence suggests FBI agents acted as provocateurs in what became a rowdy demonstration."
  ]
}