{
  "id": 11728,
  "mediaId": 8413,
  "date": "2022-03-22",
  "headline": "Here's a look at how area members of Congress voted",
  "image": "https://www.gannett-cdn.com/-mm-/27243207262a8b55c9b1d925a7246ef1eb639ab4/c=4-0-1988-1121/local/-/media/2018/03/16/OHGroup/Fremont/636568071596003758-US-capitol.jpg?width=1984&height=1121&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.thenews-messenger.com/story/news/2022/03/22/heres-look-how-sandusky-and-ottawa-co-members-congress-voted/7118276001/",
  "mediaOutlet": "portclintonnewsherald.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Targeted News Service",
  "authorUrl": "",
  "termIds": [
    5437,
    4903,
    2300,
    3421,
    3298,
    3205,
    14,
    6709
  ],
  "sentences": [
    "WASHINGTON — Here's a look at how area members of Congress voted March 11 to March 17:\nAlong with roll call votes this week, the Senate also passed, by voice vote, the Safe Connections Act (S. 120), to prevent and respond to the misuse of communications services that facilitates domestic violence and other crimes.",
    "A supporter, Rep. Bruce Westerman, R-Ark., said: \"The new network will be an important tool to ensure that this history, no matter how painful it may be, is always remembered, and the important stories of interned Japanese Americans are told with honor and respect.\"",
    "3113), sponsored by Rep. Blake Moore, R-Utah, to direct federal agencies to develop compatibility standards for digitizing and distributing geographic information system data on government lands that are accessible for recreational purposes.",
    "Johnson said: \"It is a constitutional right that, when there is a dispute, a party should be able to take that dispute to court and have a jury trial, and no forced contract should deprive that person of that constitutional right.\"",
    "YEAS: Rep. Bob Latta R-OH (5th), Rep. Marcy Kaptur D-OH (9th), Rep. Jim Jordan R-OH (4th)\nHouse Vote 2:\nFISH MANAGEMENT AND WESTERN RIVERS: The House has passed the Upper Colorado and San Juan River Basins Recovery Act (H.R.",
    "YEAS: Brown D-OH\nNAYS: Portman R-OH\nSenate Vote 4:\nSECOND CALIFORNIA JUDGE: The Senate has confirmed the nomination of Fred W. Slaughter to be a judge on the U.S. district court for the central district of California.",
    "NAYS: Latta R-OH (5th), Jordan R-OH (4th)\nYEAS: Kaptur D-OH (9th)\nSenate\nSenate Vote 1:\nBUDGETING: The Senate has confirmed the nomination of Shalanda Young to be Director of Office of Management and Budget (OMB).",
    "4380), sponsored by Rep. Veronica Escobar, D-Texas, to designate a garden in El Paso, Texas, as the El Paso Community Healing Garden National Memorial, while not making the garden part of the National Park System.",
    "NAYS: Brown D-OH\nYEAS: Portman R-OH\nSenate Vote 3:\nCALIFORNIA JUDGE: The Senate has confirmed the nomination of Jacqueline Corley to be a judge on the U.S. district court for the northern district of California.",
    "5001), sponsored by Rep. Joe Neguse, D-Colo., to extend, through 2024, the Interior Department's authority to build facilities to aid recovery of endangered fish populations in two Southwest river basins.",
    "7108), sponsored by Rep. Richard E. Neal, D-Mass., to suspend normal trade relations with the two countries, at the World Trade Organization and other trade groups, over Russia's invasion of Ukraine.",
    "A bill opponent, Rep. Dan Bishop, R-N.C., said it would destroy the use of arbitration, a legal mechanism \"used with great utility and utilized throughout the last hundred years almost, since 1925.\"",
    "An opponent, Sen. Tim Kaine, D-Va., said canceling the rule \"could lead us to be extremely vulnerable if there were a resurge in coronavirus cases, as we are seeing in other nations like Germany.\"",
    "37), sponsored by Sen. Rand Paul, R-Ky., to disapprove of and void a Centers for Disease Control rule requiring masking on various modes of transportation, including trains, airplanes, and buses.",
    "6434), sponsored by Rep. Jay Obernolte, R-Calif., to establish a network of National Park Service materials at sites related to Japanese Americans and World War II, including relocation camps.",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th)\nNAYS: Jordan R-OH (4th)\nHouse Vote 5:\nWORLD WAR II HISTORY SITES: The House has passed the Japanese American World War II History Network Act (H.R.",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th), Jordan R-OH (4th)\nHouse Vote 6:\nTRADE WITH RUSSIA: The House has passed the Suspending Normal Trade Relations with Russia and Belarus Act (H.R.",
    "963), sponsored by Rep. Hank Johnson Jr., D-Ga., to invalidate agreements to use arbitration to settle disputes that involve employment, consumer, antitrust, or civil rights litigation.",
    "3197), sponsored by Rep. Mike Johnson, R-La., to convey two parcels of federal parks land in Eunice, La., to the city of Eunice for the rehabilitation of its Liberty Theatre.",
    "A supporter, Sen. Alex Padilla, D-Calif., said: \"Judge Slaughter's long career demonstrates his legal excellence as well as his commitment to providing justice for all.\"",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th), Jordan R-OH (4th)\nHouse Vote 7:\nFORCED ARBITRATION: The House has passed the Forced Arbitration Injustice Repeal Act (H.R.",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th), Jordan R-OH (4th)\nHouse Vote 3:\nPRESERVING LOUISIANA THEATRE: The House has passed the Save the Liberty Theatre Act (H.R.",
    "Escobar said the designation would \"help ensure that our entire country honors the 23 innocent lives we lost in the attack on El Paso on August 3, 2019.\"",
    "Moore said: \"Making this information more detailed and accessible in the digital age is one of the many reasons why this bill enjoys such broad support.\"",
    "Young, the OMB acting director since March 2021, was previously a senior aide, in several different roles, on the House Appropriations Committee.",
    "Neal said: \"We must do everything in our power to hold Russia accountable for the atrocities it is committing hourly in the nation of Ukraine.\"",
    "YEAS: Latta R-OH (5th), Kaptur D-OH (9th), Jordan R-OH (4th)\nHouse Vote 4:\nEL PASO MEMORIAL GARDEN: The House has passed a bill (H.R.",
    "A supporter, Sen. Gary C. Peters, D-Mich., said Young \"has done an exemplary job serving as OMB's Acting Director for the past year.",
    "Paul said: \"No statute exists that remotely conveys a power to mandate masks to any department of the federal government.\"",
    "Slaughter, a federal prosecutor in the district from 2002 to 2014, has since been an Orange County Superior Court judge.",
    "House\nHouse Vote 1:\nDIGITIZING FEDERAL MAPS: The House has passed the Modernizing Access to Our Public Land Act (H.R.",
    "Corley has been a magistrate judge in the district since 2011, and previously was a clerk for a district judge.",
    "Rob Portman R-OH\nSenate Vote 2:\nTRANSPORTATION MASKING: The Senate has passed a resolution (S.J.",
    "She is a dedicated public servant and a proven leader.\"",
    "The vote, on March 17, was 222 yeas to 209 nays.",
    "The vote, on March 16, was 406 yeas to 16 nays.",
    "The vote, on March 16, was 403 yeas to 25 nays.",
    "The vote, on March 15, was 397 yeas to 27 nays.",
    "The vote, on March 15, was 414 yeas to 9 nays.",
    "The vote, on March 16, was 422 yeas to 4 nays.",
    "The vote, on March 17, was 424 yeas to 8 nays.",
    "The vote, on March 15, was 61 yeas to 36 nays.",
    "The vote, on March 17, was 63 yeas to 36 nays.",
    "The vote, on March 15, was 57 yeas to 40 nays.",
    "The vote, on March 17, was 57 yeas to 41 nays.",
    "YEAS: Sen. Sherrod Brown D-OH\nNAYS: Sen.",
    "YEAS: Brown D-OH\nNAYS: Portman R-OH",
    "Res."
  ]
}