{
  "id": 1217,
  "mediaId": 2681,
  "date": "2022-02-15",
  "headline": "The Biden Regime’s Notorious Incompetence Is Backfiring Spectacularly As Americans And People Around The World Are Uniting Against His Authoritarianism",
  "image": "https://www.sgtreport.com/wp-content/uploads/2022/02/the-biden-regime-8217-s-notorious-incompetence-is-backfiring-spectacularly-as-americans-and-people-around-the-world-are-uniting-against-his-authoritarianism-l0jrBDba7f0.jpg",
  "link": "https://www.sgtreport.com/2022/02/the-biden-regimes-notorious-incompetence-is-backfiring-spectacularly-as-americans-and-people-around-the-world-are-uniting-against-his-authoritarianism/",
  "mediaOutlet": "sgtreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "A recent Yahoo News/YouGov survey found that 46 percent of respondents thought Americans should “learn to live with” the pandemic “and get back to normal,” while just 43 percent thought “we need to do more to vaccinate, wear masks and test.”\nA Republican firm, Echelon Insights, had similar findings, reporting that 55 percent of voters thought Covid-19 should be “treated as an endemic disease that will never fully go away,” like the flu, while 38 percent said it should be “treated as a public health emergency.”\nThe “spin” from the NYT, is that Americans are tired of the “inconvenience,” of the Covid restrictions.",
    "YOU CAN PUSH PEOPLE ONLY SO FAR BEFORE THEY PUSH BACK\nAs American watch and root for the Freedom Convoys across the globe, and reportedly are participating in their own freedom protests to show solidarity with the Canadian Trucker’s, Democrats see the writing on the wall, are panicked, and trying to find a way to backtrack without looking like they have been on the wrong side of this issue since Before Biden started occupying the White House.",
    "As liberal state leaders, emboldened by the dictatorial tendencies of the Biden regime, continued to push Covid restrictions, forced vaccinations, forced masking for adults and children alike, economy-destroying lockdowns and other mandates and tyrannical decrees, we have watched support for those actions wane to the point where now the majority of Americans are sick and tired of Biden’s authoritarianism.",
    "Example of both the MSM forced to report on the polling patterns, while still trying to protect Biden as the MSM is the propaganda arm for the Democrats, comes from the New York Times (Archive.is link here)\nKey Quotes:\n• A wave of polls taken as the Omicron variant crested across much of the United States shows new signs that the public’s resolve to combat the coronavirus pandemic is waning.",
    "A look into what is happening, not just in America, but across the globe, as citizens from the most Covid restrictive countries, are standing up and pushing back against world leaders who have used Covid as power-grab to control their populace, and we see that Biden’s promise to “unite” has backfired spectacularly as they are now “uniting” against him.",
    "Between the protests, the support for the Canadian Trucker’s Freedom Convoy, and the pattern shown in multiple polls that the Biden/liberal mandates are an albatross around Democrats’ necks as the midterms approach, they are backpedaling as fast as they can without looking like the opportunistic, power-hungry politicians that they are.",
    "When even portions of the MSM are forced to report on the polling patterns showing dwindling support, even within the Democrat party, for the Biden regime’s arbitrary restrictions and mandates, despite the same MSM activism to push those same restrictions , then you know he has a problem.",
    "BLUE STATES ‘RELAXING’ MANDATES AS PUBLIC TURNS AGAINST THEM\nRepresentative Jim Jordan was spot on in his analysis of why a number of blue states are now joining red states in “relaxing” their mandates:\nJIM JORDAN: The science didn’t change, the polls have changed.",
    "There’s all these Democrat governors who are relaxing the mask mandate on kids, and relaxing some of the mandates, all because they saw what happened in Virginia a few months ago — when Glenn Youngkin ran on this issue and won that election in a blue state.",
    "Yes, according to the NYT it is “inconvenience” for the dwindling support for Biden’s authoritarian mandates, not the deliberate attempts by Biden, liberal leaders and the MSM, to strip the freedoms from Americans and the global populace.",
    "A wave of blue states are now joining with red states in lifting Covid restrictions, while the Biden administration continues to push his mandates and decrees, even as courts rule many of them unconstitutional.",
    "TRUTH LIVES on at https://sgtreport.tv/\nDiehard liberal Democrats won’t admit the truth out loud, but polling patterns are showing a nation “fatigued” by lockdowns and mandates.",
    "And here’s the other thing, Martha – here’s the other thing that everyone now understands: Everything we were told about this virus by the experts has turned out to be wrong.",
    "Protests and uprisings have dominated the news, and Biden still encourages other liberal world leaders to “crack down” on public dissent and protest.",
    "In fact a search for the word “freedom” within the NYT article, finds it mentioned just……ZERO times.",
    "Not going after these truckers – I mean they can’t bring gas to their truck, for goodness sake.",
    "No concern from the NYT of the courts stating many Biden mandates are “unconstitutional.",
    "No acknowledgement that Americans are sick and tired of their rights being violated.",
    "No mention about parental rights to make decisions as to mask their children or not.",
    "So I think that’s what is driving some of this; so that’s what needs to change.",
    "Note to NYT: Be honest for a change – It is about Freedom, not inconvenience.",
    "Trucker’s convoys for Freedom have spread from country to country.",
    "The science hasn’t changed, the politics have, as Jordan said.",
    "Video at the link above.",
    "This is ridiculous.",
    "Inconvenience……huh.",
    "POLLING PATTERNS……."
  ]
}