{
  "id": 12492,
  "mediaId": 2618,
  "date": "2022-03-05",
  "headline": "And There It Is: Biden Asks for Billions for COVID and Ukraine – Where Will This Money Really Go?",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/05/and_there_it_is_biden_asks_for_billions_for_covid_and_ukraine__where_will_this_money_really_go_80578.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Hoft",
  "authorUrl": "",
  "termIds": [
    2765,
    4267,
    3858,
    4651,
    4905,
    204,
    467,
    6672
  ],
  "sentences": [
    "Can we all acknowledge the awful truth that our Republic, our freedoms, and our way of life cannot survive another year with F Joe Biden, Knee Pads Harris, the shambling greedy communist mummy Pelosi, and the rest of the communist death democrats lording it over all of us?",
    "FOX News reports: The White House is warning that the U.S. will soon begin to run out\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "We know how the Biden regime's destruction of domestic oil production is causing inflationary increases in fuel prices, and in addition all the additional spending is driving inflation by chasing a shortage of goods and services.",
    "It's based on the true story of Anna Delvey, born Anna Sorokin, a delusional woman masquerading as a German heiress in Manhattan who conned people into spending lavishly with her outrageous lying.",
    "The money will go to the Clinton Global Initiative and then directly into the bank accounts of the Clinton’s just like the money for the Haitian earthquake relief funds did.",
    "And don't pin your hopes and expectations that the republicans will do anything to save our country it they take control of the Senate and House in 2023.",
    "But my vote never matters, and the RINO's and Democrats that ruin everything will get us involved, and it will not be a one time expense either.",
    "In 2015, Ukrainian prosecutor Victor Shokin was looking into Burisma, an oil and gas company where Hunter Biden was on the Board.",
    "Knew someone who had some kind of checking account where they could write checks beyond what they had in their account.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "he was a gambler Another reason we need Trump back; he knows how to balance a checkbook and not write bad checks.",
    "Agree with the intimations above that a lot of the money will go to payoff Biden family credit card debt.",
    "Joe Biden later bragged how he got Shokin stopped from further investigating Hunter and Burisma.",
    "They must burn through cash at an amazing rate to be back asking for more in just five years!",
    "The situation in the Ukraine distracts from FJB's complete fubaring of anything he touches.",
    "The bulk of any COVID funds is distributed to Democrat groups like teacher's unions.",
    "Not with enemies of the country like McConnell and McCarthy in the House in charge.",
    "Ukraine funds will similarly be distributed so the big guy gets his ten percent.",
    "McConnell and Schumer will push it through in a find what's in it later bill.",
    "Biden withheld a billion in aid to get Shokin fired and he bragged about it.",
    "He must think we forgot about one of his last transactions in Ukraine.",
    "He does care about his cut of the grift from the Ukrainian oligarchs.",
    "Your donation helps keep our discussions going and our voices heard.",
    "This admin is devaluing the dollar at the fastest pace ever seen.",
    "FJB is using the people of the Ukraine for his own benefit.",
    "Now we are allocating billions to get involved in Ukraine.",
    "More importantly, where does this money REALLY come from.",
    "Joe Biden is the Anna Delvey of American Presidents...",
    "There is a Netflix series now called \"Inventing Anna.\"",
    "Biden now wants billions more for Ukraine and COVID.",
    "Somehow, someway, we need to take back our Country.",
    "COVID is now a code word for pork barrel spending.",
    "If you are still into Covid, pay for it yourself.",
    "This time Biden says it’s for COVID and Ukraine.",
    "Our government \"spends\" money it does not have.",
    "It will be an annual addition to the budget.",
    "As for Ukraine, we weren't getting involved.",
    "We don't need to fund Covid any longer.",
    "He gives a squat about the Ukrainians.",
    "Forget what the privilege was called.",
    "It is now a matter of basic survival.",
    "They all must be removed somehow.",
    "Bought and paid for with Yuan.",
    "(Video) Now Biden wants more.",
    "They are his cannon fodder.",
    "We will not survive.",
    "He is Xi's puppet.",
    "No is my vote.",
    "Thank you.",
    "p.s."
  ]
}