{
  "id": 12505,
  "mediaId": 2618,
  "date": "2022-03-06",
  "headline": "Former UN Ambassador Nikki Haley claims Biden's Afghan exit debacle and the Nord Stream 2 pipeline are to blame for emboldening Putin to invade Ukraine: Says it is 'lunacy' to continue to buy Russian oil",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/06/former_un_ambassador_nikki_haley_claims_bidens_afghan_exit_debacle_and_the_nord_stream_2_pipeline_are_to_blame_for_emboldening_putin_to_invade_ukraine_says_it_is_lunacy_to_continue_to_buy_russian_oil_80651.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melissa Koenig",
  "authorUrl": "",
  "termIds": [
    5271,
    4794,
    4905,
    4591,
    4553,
    6569,
    6672
  ],
  "sentences": [
    "why don't the people involved in the Keystone and all the other utilities just go back to work and start the operation and begin, on their own, the process of taking that oil out of the ground and to the refineries for processing - FJB and all the mini-demcommies who think they can control us - compare this to 1776 and begin our own economic revolution, to bring some sanity into our country - \"No Taxation Without Representation\" and No Economic Vassalage, to this corrupt federal government\nCaptain Obvious has spoken.",
    "Well... she's not one of my favorites because she stabbed President Trump in the back...but WE should be using our own engery...and WE all know it....now obama and Kerry have US negotiating with Iran for oil...with Russia at the bargaining table...talk about insanity...not only is biden several cards short of a full deck...but it seems...Washington's swamp is determined to bring America to her knees...either they are that stupid...or they are traitors...",
    "Nikki Haley, former United Nations ambassador for the U.S., slammed President Joe Biden's leadership in the Ukraine conflict on Sunday and said it's 'absolute lunacy' the country continues to buy Russian oil after Vladimir Putin launched an invasion last month.In an interview with FOX Business' Maria Bartiromo on Sunday Morning Futures, Haley said the United States never should have trusted Russia or Putin.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "So called \"Nikki Haley\" called in some chips and managed to get herself on television ... and promptly stated not only the obvious but what others said faster and better.",
    "Before Trump came on scene, I remember thinking that we need a President who cannot be bought, which is reason why so many want Trump to stay away from oval office.",
    "I don't approve of her now not just because of what she said about Trump ... which was bad enough ... but what she said about \"his disillusion supporters\".",
    "Now that would have been an opportune time to speak the truth, but I believe this little lady was one of the voices saying, move on.",
    "Biden could quickly return to energy independence by reversing his policy of suppressing United States oil and gas production.",
    "As soon as Biden took office he destroyed energy independence by cancelling oil drilling leases and the Keystone XL pipeline.",
    "Every malevolent leader on the planet watched TaliBiden during the 2020 campaign and knew that he was demented and weak.",
    "When Biden was sworn in as President, the United States had energy independence -- an achievement of President Trump.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "I will not forget those who have set us on this disastrous course because they lacked the courage to speak out.",
    "She's busy saying ALL of the \"right things\", in attempt to build an image she can launch another try at power.",
    "'This happened from the way the U.S. left Afghanistan,' she explained, saying the U.S. abandoned its allies.",
    "The United States could soon return to the status of a net oil exporter and give some relief to Europe.",
    "And they rubbed their hands in glee and poured out cash to help cheat him into the presidency.",
    "This forced the United States to buy oil from countries that don't like us, Russia being one.",
    "We're all in this current mess because too many stupid RINOs insisted we all just move on!",
    "Example what I'm talking about: \"Obviously, a lot of people here don't like Nikki Haley.",
    "I heard her on Sunday Morning Futures and she's absolutely right on Ukraine.\"",
    "The result is that United States money is subsidizing Putin's war on Ukraine.",
    "Instead he is backing the \"green agenda\" at the expense of Ukrainian lives.",
    "Haley was one of the people who bears responsibility for burying the truth.",
    "'This all happened because of us,' the former South Carolina governor said.",
    "Therefore, whatever she has to say is met with nothing more than derision.",
    "Her method depends on the tried-and-true short memory of average voter.",
    "Your donation helps keep our discussions going and our voices heard.",
    "It didn’t take Afghanistan or the Nord Stream to embolden Putin.",
    "She would love for everyone to forget she was a Never Trumper.",
    "I may be just getting cranky, but speak out when it matters.",
    "Or do they simply get elected only to perform as RINOs?",
    "Nikki Haley wants to be President way too much.",
    "A broken clock is right twice a day.",
    "Nick-Knack ... you're dead to me.",
    "But, Biden refuses to do this!",
    "But do leopards change spots?",
    "Too little, too late, Nikki.",
    "Remember November 3, 2020?",
    "Nah, I didn’t think so.",
    "This is madness!",
    "Any regrets?",
    "Thank you.",
    "Whatever."
  ]
}