{
  "id": 12545,
  "mediaId": 2618,
  "date": "2022-03-06",
  "headline": "Here's Your 'Red Pill' Moment for the Russia-Ukraine War",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/06/heres_your_red_pill_moment_for_the_russia-ukraine_war_80593.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wayne Allyn Root",
  "authorUrl": "",
  "termIds": [
    5382,
    5292,
    4591,
    6569,
    6672
  ],
  "sentences": [
    "Putin drew his entirely warranted and legitimate red line more than ten years ago he is not obama If the American people dont yet realize their worst enemy is the US government theyre either too stupid or dont want to accept reality When will the time for peaceful protest end and the time for a million or two armed men with torches and rope descending on DC begin will anything other than that change anything?",
    "Quite convenient that just as their actions are being exposed this crisis comes along to distract everyone, swallow the news cycles, provide a convenient excuse for inflation, astronomical energy costs, supply chain issues, drive everyone to \"green\" energy, and all of economic pain and loss of freedom their policies will inflict.",
    "The people in the neighboring countries of Belarus and Poland do not want this war In a March 2nd letter, the Bishops of Ukraine implored Pope Francis to publicly consecrate Russia and Ukraine to the Immaculate Heart of Mary to bring peace.",
    "But, my name is, thankfully, on the list of those who know, believe, trust and obey the only good, perfect and righteous One who sees, hears and knows all things - the One who has all power and ultimate control in the affairs of men.",
    "They stood mute while the Democrats lied about Trump's call to Zelensky to ask him to investigate Brandon and Hunter Biden's corruption in Ukraine, and concocting a bogus \"quid pro quo\" charge against Trump to impeach him.",
    "When you see all the anti-Russia agitprop in the media, remember that they are protecting the corrupted DC politicians who have been raking in the millions, starting with the Biden family and followed by the Pelosi clan.",
    "There's no question in my mind that biden the cheater, the dims, deep state, and the msm needed to pivot from the covid scam, inflation, unemployment, the crime wave, and blowback from the chaotic Afghanistan surrender.",
    "While tying Putin down with support for Ukraine, most importantly, re-establish our own energy independence by opening up the leases and sites closed on federal lands and restart the Keystone XL pipeline development.",
    "The left has miscalculated thinking they are going to build a world government, only to have pushed the world back into regionalism and nationalism with their censorship, tyranny, and canceling people and countries.",
    "One thing I do know is that the Ukrainian people do not deserve what is happening to them much like Americans who are stuck with this corrupt self-serving old man and the incompetent zealots in his administration.",
    "He also did not rally other Western countries to come together as a coalition with a plan to either prevent the invasion or assist Ukraine in preparation to defend itself for what he knew was a coming invasion.",
    "We are both pawns of corruption so integral to the functioning of the government that it has become commonplace and now we see war being waged with innocent citizens caught up in the destruction.",
    "Another angle to the Ukraine invasion - The article asserts that the Great Reset crowd needed Putie's war in Ukraine as a distraction while further steps to destroy America are carried out.",
    "Throw in the added benefit that destroying Ukraine destroys the evidence of a massive amount of their corruption and there is nothing but upside to this for Brandon and the Davos crew.",
    "The outbreak of this war has been providential to the Great Reset crowd and those responsible for lockdowns, forced vaccinations, denial of effective treatments such as Ivermectin etc.",
    "Soros, woke corporations, banks, msm, entertainment, pro sports, the academic intelligencia, protesters, and foreign governments are unified with their Russian sanctions schtick.",
    "We support them in this horrific struggle against Russian brutality, but are we being manipulated by our corrupt government and media to fight a war that is not ours to fight?",
    "I have great sympathy for the innocent Ukraine people who are being killed or having their lives destroyed, or else I'd say to nuke the whole country--Russians and Ukraines.",
    "We have fought far too many wars because evil men inside and outside our government used the vehicle of war to benefit themselves at the expense of our sons and daughters.",
    "Seriously wish the people causing this and want war could rent a battlefield somewhere so they can happily blow each other's brains out and leave everyone else the he!!",
    "With our November mid-term elections and associated voting fraud just months away, the dims needed this distraction to adjust group think and minimize their losses.",
    "I stood there and was shocked that a letter basically saying the incident was fake would be displayed for the public to see so soon after the Vietnam war ended.",
    "Sadly, when I found out that both George Soros and Greta Thunberg are condemning Russia and supporting Ukraine in this, my give-a-darn meter stopped working!!!",
    "And BTW, China and India, Africa, the Middle East, and Latin America, which is more than 3/4 of the people in the world, will still do business with Russia.",
    "1) If Cuba, Mexico or Canada has missiles on the US border, and we made a move to secure that area....imagine the Russian news reports regarding that event.",
    "There were at least 15 bio-weapons labs that were owned by the US, plus the Ukraine has lots of deep underground tunnels used for human/child trafficking.",
    "What would tickle me greatly is if Putin dropped a truth bomb in the laps of DC, naming names of all those who have been raking in the money from Ukraine.",
    "Highly doubtful\nMy name is not on the list of people who know anything for certain, or even at all, about what is happening in Ukraine,or why.",
    "He finally got \"all about me\" hannity to parrot one of his rino, idiot thoughts so pathetic that I am FINALLY done with the dopey patriot.",
    "It's 24/7 Russia/Ukrainian war and no U.S. news at all...no matter the show, it's Russia, Russia, Russia, Ukrainie, Ukrainie, Ukraine.",
    "While I don't remember the exact words that were in the letter, the contents and the reason for the letter I will never forget.",
    "FTA: \"President Joe Biden and the media desperately want you to believe Russia is the bad guy and Ukraine is a little angel.\"",
    "We should help continue to tie down Putin in Ukraine, or he will continue by advancing in the Baltic States and perhaps more.",
    "It will become the focus of all media stories and will give Biden cover to create whatever mischief he wants under the radar.",
    "My fervent prayer is that He will expose the purposes of the wicked and bring about good from the midst of all of this evil.",
    "With the constant propaganda spewing from both sides, it's hard to have a clue what the actual \"facts\" are in this case.",
    "George Soros’ position on this situation gives me great pause and I certainly do not trust Biden or this administration.",
    "Who knows what else was happening in the upper echelon of that government among the nations around the world.",
    "So come to grips with the fact that you are not getting the complete picture from your favorite news channel.",
    "U.S. businesses are making a huge mistake by dropping business, because Russia does not meet their \"values\".",
    "While there is certainly some truth to this, keep in mind that Putie wants nothing to do with the GR crowd.",
    "Meanwhile thousands of Ukrainians and Russians are dying so these people can satisfy their selfish desires.",
    "I saw a letter written from I believe McNamara to President Johnson in the National Archives back in 1976.",
    "We cannot allow a military response to be used as a cover up for the incompetency of this administration.",
    "The left don't do business, so they think all this cutting people and countries off will not affect them.",
    "Biden will blame all our energy woes on the war and will bring Ukrainians here by the tens of thousands.",
    "Even worse, he now refuses to open up drilling here and remove regulations his administration imposed.",
    "If Russia takes over Ukraine, they are now surrounded by NATO countries that have lots of US weapons.",
    "The left poked Putin for years, and he finally had enough of it, and he wants the Soviet empire back.",
    "Ukraine has been openly buying and selling politicians around the world, including here, for decades.",
    "A one world government and a world without borders is the opposite of Putie's goals and objectives.",
    "Notice how fast the GR crowd has strengthened group think with its Ukraine-the-underdog narrative.",
    "(Fulton Sheen) If we can move away from who did it and why, we're left with death and destruction.",
    "He has warned us for decades about trying stuff like this, so we cannot say this is a surprise.",
    "All the while we would be explaining our justification on news that would be blocked in Russia.",
    "Stop funding Putin's war machine with lower gas prices and an embargo on Russian fuel sources.",
    "But I do know that if Soros and Thunberg are for something, it is terrible for our country!!!",
    "I agree that Soros and his money are as anti-American, anti-capitalism as you can find.",
    "If Ukraine shows signs of winning, Russia will escalate with the use of bigger weapons.",
    "Could all of this constant news of fighting 5,000 miles away be an election deflection?",
    "The thief-in-chief has nothing good to show the American people, so let's put on a war.",
    "The point is there are no good guys in this, and they are all playing their own angles.",
    "Zelensky and his entire corrupt cronyist government can roast in hell for all I care.",
    "If you are honest, you have to ask yourself what American interests are we defending?",
    "Has Biden/Obama/Soros paid Fox to constantly barrage us with this never-ending news?",
    "We are in a stupid agreement to fight for any NATO country that is attacked, voila!",
    "The only thing I'm sure about is that this conflict will not be over anytime soon.",
    "Soros wants us in this war because it will ultimately weaken us which is his goal.",
    "As far as Ukraine being throughly corrupt, can it compete with our own government?",
    "Then if that's OK ( don't think it's good) - hate Russia for it's corrupt leaders?",
    "No more than it had a right to oppress or control Poland, or Hungary, or Romania.",
    "Biden want COVID and the US economy out of the news because his polls are so bad.",
    "LOTS of Ukrainian politicians are like our politiciand CROOKED, THIEVING people.",
    "He did not send weapons or other necessities for Ukraine when he had the chance.",
    "2) If Russia had multiple bioweapon labs in Mexico, paid for by the their Dept.",
    "That is the only thing that will restore any greatness in men or nations today.",
    "To take their side, even against people as evil as the Russians, seems foolish.",
    "Biden is funding the war in Ukraine while destroying the economy here at home.",
    "You would be doing your country - and the world - a great service,\" Seriously?",
    "He has publicly praised Stalin, the butcher who killed millions of Ukrainians.",
    "Add chaney and we have the new world order, great reset Peter, Paul and Mary.",
    "It's another unfortunate but necessary step on the way to the New World Order",
    "The people can’t be held responsible for what the elites in their country do.",
    "You can find the video of him on YouTube playing the piano with his genitals.",
    "But then the Jan 6 protesters were killed and had their lives destroyed too.",
    "He and his administration have been a scourge on this nation and the world.",
    "The only conclusion I can come to is that I feel for the Ukrainian people.",
    "It will not work, and we should let it fail without our failing with it.",
    "\"The only way this ends is for somebody in Russia to take this guy out.",
    "Big pharma money flowing their way explains 3/4 of their programming .",
    "But Russia and Putin are taking advantage of Biden's extreme weakness.",
    "And this is why I am so conflicted by the Russian invasion of Ukraine.",
    "For months Biden knew the invasion was coming and yet he did nothing.",
    "When something is consecrated, it is dedicated for a divine purpose.",
    "This could have been avoided easily in a number of ways and wasn't.",
    "We recognize that Russia is the aggressor by invading this country.",
    "This is all about protection of the Ukrainian ATM machine for them.",
    "I cannot blame Putin for cleaning out the US rot in his front yard.",
    "In other words, the GR crowd's new world order now has competition.",
    "I'm tired of caring about what the media tells me to care about.",
    "Soros is there with his NGO's and the support of the State Dept.",
    "Ukraine is a leftist playground, including the U.S. State Dept.",
    "I can separate the government from the country and the people.",
    "I've felt this \"war\" is a distraction for FJB from the start.",
    "They can not continue bleeding soldiers and the costs of war.",
    "I support Ukrainian people being free of Russian oppression.",
    "He had the means to cut off Putin at the knees and did not.",
    "Biden was getting wealthy off this country when he was VP.",
    "The cheater has brought nothing other than more bad news.",
    "I know plenty of rotten and plenty of good Russians, too.",
    "However, I want no part of a military action in Ukraine.",
    "That is what made America the greatest nation on earth.",
    "But Russia has no right to control and oppress Ukraine.",
    "I don't hate Russia, I hate PUTIN and his evil minions.",
    "This is where America first should apply its pressure.",
    "No, I don't and neither do 90% of all these experts.",
    "Maybe the left will hang themselves, like Epstein.",
    "The Ukrainian President is an actor and comedian.",
    "Hating Ukraine because you suspect their leaders?",
    "And please, will someone shut up Lindsay Graham!",
    "Now the Clintons are getting back into the game.",
    "We see the Ukrainian people suffering and dying.",
    "We see their courage and determination to fight.",
    "Our compassion may have clouded our thinking.",
    "The exchange of nukes will not be far behind.",
    "I want to bet a lot that it does affect them.",
    "Soros is only interested in wealth and power.",
    "Zelesnky is a thieving thug and is a bad guy.",
    "The guy that has killed thousands of people?",
    "Do I know exactly who in Ukraine is corrupt?",
    "We should in no way get involved in Ukraine.",
    "They are even more corrupt than the Moslems.",
    "His will be done and His name be glorified.",
    "A bunch of Americans have 'deals' with him.",
    "The people in Ukraine do not want this war.",
    "Most people in Russia do not want this war.",
    "Someone at FoxNews is using this blowhard.",
    "I cannot dismiss this article out of hand.",
    "But interesting pushback by the GR crowd.",
    "Do I support corrupt Ukrainian officials?",
    "\"Wars come from egotism and selfishness.\"",
    "The communist post-cold war world order.",
    "Therefore, I don’t pray for either side.",
    "Billions will flow out of the treasury.",
    "Finally, an article to wake people up.",
    "of Defense, what would we do about it?",
    "Christ and His Mother do not want war.",
    "Find more informative info elsewhere.",
    "Putin is rebuilding the Soviet Union.",
    "They do not deserve this destruction.",
    "It becomes the ultimate distraction.",
    "That is really, really easy for me.",
    "Is the leadership of Ukriane good?",
    "Must we blame everything on Soros?",
    "He was placed into power by Soros.",
    "I hope they obliterate each other.",
    "We have our own fish to fry here.",
    "We can't watch FoxNews right now.",
    "They wanted this to happen folks.",
    "I pray Pope Francis will comply.",
    "Peace is Love, and Love is God.\"",
    "Zelesnky is bought and paid for.",
    "I'm not picking a side in this.",
    "It is a such a simple request.",
    "Nope, Putin is a bad guy too.",
    "Cannot stomach fox right now.",
    "Same goes for China and NORK.",
    "Ditto on the article and #1.",
    "Shout out to lindsay graham.",
    "They have other programming.",
    "We must come to their aid.\"",
    "NewsMax is not doing this.",
    "That seems too simplistic.",
    "What does that make them?",
    "Yes, Soros is a bad guy.",
    "Instant war with Russia.",
    "It makes too much sense.",
    "They're suceeding, too!",
    "Now playing on spotify.",
    "This is beyond a doubt.",
    "Still stuck on Tucker.",
    "\"US invades poor Cuba.",
    "Putin is a good guy?",
    "What's Fox's motive?",
    "This is Joe’s war.",
    "I'm not there yet.",
    "Let's go Brandon!",
    "It's suspicious.",
    "and commercials.",
    "They want peace.",
    "\"Order is Peace.",
    "Putin is evil.",
    "I don't know.",
    "Otherwise…….",
    "Hard facts.",
    "Thanks #26.",
    "Bad guys.",
    "alone.",
    "Sorry.",
    "Pray!",
    "NONE.",
    "No.",
    "#8.",
    "."
  ]
}