{
  "id": 1255,
  "mediaId": 2618,
  "date": "2022-02-16",
  "headline": "Florida woman, 33, 'used $15,000 pandemic relief loan to bankroll a hit on TSA agent who stole her boyfriend': Victim, 24, was gunned down outside her Miami home in front of her three-year-old daughter",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/16/florida_woman_33_used_15000_pandemic_relief_loan_to_bankroll_a_hit_on_tsa_agent_who_stole_her_boyfriend_victim_24_was_gunned_down_outside_her_miami_home_in_front_of_her_three-year-old_daughter_79353.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christina Coulter",
  "authorUrl": "",
  "termIds": [
    4905,
    5891,
    2003,
    2765,
    4051,
    4794,
    788,
    1380,
    6159,
    6384,
    6678
  ],
  "sentences": [
    "Not only that, but it would be nutritionally adequate and meet the constraints for what can be feasibly consumed, according to experts\nFollowing reports that Elon Musk may be nearing a deal with the Twitter board to buy the company, leftist “verified” accounts on the platform once again went into meltdown mode at the prospect of the Musk, the self-described free speech absolutist, taking over.“Leaving Twitter” began to trend shortly after the reports of Musk-Twitter talks.",
    "Charles Blow, a New York Times columnist who describes Trump supporters as “angry white men,” said he would “say goodbye” to the platform\nSpotify will not renew its exclusive podcast partnership with Michelle and Barack Obama, according to Bloomberg.Michelle and Barack Obama are leaving Spotify after the audio streaming giant reportedly dropped its podcast deal to the first couple.",
    "As you say your nightly prayers to Saint Elon while you fall asleep tonight, reflect on why you punch down on poor people\nOver the last 16 tortuous months of the Biden presidency, it’s become clear that the Democrats are running on empty.They are not even trying to reset their electorally poisonous policies.Politically this means they are heading for annihilation at the midterms.",
    "According to a report in Axios, as reported by the Washington Examiner's Byron York: There is word that President Joe Biden is looking for a way out of his decision to end Title 42, the Trump-era regulation that allows U.S. authorities to turn back illegal crossers at the U.S.-Mexico border on the grounds of protecting the country from COVID.",
    "According to the Daily Mail, the couple had a clash with the streaming giant over “exclusivity and how much they were expected to appear in episodes.”Newsmax reported: Spotify is not renewing its podcast contract with former President Barack Obama and former First Lady Michelle Obama, which expires this year, Bloomberg reports.",
    "At first this p*d me off for the abuse of tax dollars and general government waste that put $15k cash in someone's hands instead of for approved expenses being refunded like would happen in a business setting: If her receipt was for her hit job from her paid assassin I'd hope some government worker would deny that expense.",
    "In total control, President Rajapaksa and his brother Mahinda, the prime minister, went on a spending spree\nJoe Biden has been fully exposed as a dotard who'd be better off at the dog tracks than the Oval Office, but he's got nothing on Sen. Dianne Feinstein, who's reportedly so senile she can't recognize her own staff.",
    "Police say Martinez took out a $15,000 pandemic relief loan, which she claimed was for her one-woman beauty salon in operation, and\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "In a sentencing memorandum, federal prosecutors said he lured young Black men who were often experiencing homelessness, addiction, and/or poverty to his apartment for sexually charged sessions in which he would inject them with methamphetamine and drug them with sedatives, with and without their consent.",
    "Earlier, Psaki had been asked about the death of Texas Army National Guard member Bishop Evans, who went missing Friday after attempting to rescue two migrants\nOctogenarian House Speaker Nancy Pelosi, the third in line for presidential succession, is slated to appear in a drag show hosted by RuPaul.",
    "'If we just dial it back a few years to kind of what we inherited here, the former president invested billions of dollars in a border wall that was never going to work or be effective instead of working toward comprehensive immigration reform,' Psaki said at the press briefing.",
    "China is Tesla's second largest market,\nFormer Good Place actress turned obnoxious leftist activist Jameela Jamil has quit Twitter over Elon Musk purchasing the platform.Jamil specifically cited her anti-free speech sentiments as the reason for her departure.“Ah he got twitter.",
    "Upon moving to New York in the 1960s to jump-start her career, Hutton said she “got a job modeling for Christian Dior for $50 a week,”\nIt's not a very well kept secret that Jill Biden can't stand Kamala Harris, but now we are getting some additional particulars.",
    "According to NPR's account: Controversial Republican U.S. Rep. Marjorie Taylor Greene of Georgia on Friday defended her comments ahead of the Jan. 6 insurrection at the U.S. Capitol\nIs Joe Biden, or whoever is handling him today, aware of his latest \"optics\"?",
    "And I’m going to be talking to him today.”(Snip)It is not the first time foreign leaders\nA Democratic congressional candidate in Washington State is arguing for a $30 per hour minimum wage, claiming that the $15 minimum wage movement is an outdated number.",
    "How could Sussmann both simultaneously assert that he was acting on his own accord and not being paid by the Hillary campaign while at the same time having Hillary for America and Fusion GPS assert attorney-client privilege over their communications?",
    "An excerpt provided to Fox News from Jonathan Martin and Alexander Burns' forthcoming book, \"This Will Not Pass: Trump, Biden, and the Battle for America's Future,\" describes the vice presidential nomination process during Joe Biden's 2020 campaign.",
    "Instead of running for office, and trying to persuade voters that their ideas are the best ones, which would involve defending their execrable record in power, they're opting to go the dictator's way, by trying to disqualify opponents from office.",
    "According to the New York Post: President Biden has confidence in Sen. Dianne Feinstein (D-Calif.) despite a recent report that her Democratic colleagues believe she’s mentally unfit for office, White House press secretary Jen Psaki said Monday.",
    "Get a load of what he's been up to: President Joe Biden stopped in Portland for a few hours Thursday afternoon to drum up excitement for his administration's trillion-dollar effort to revamp the nation's roads, bridges, airports and railways.",
    "The billionaire and founder of electric car maker Tesla, who earlier this month disclosed he owns a 9.2% stake in Twitter, proposed in a regulatory filing on Thursday to buy all of the company's outstanding common stock for $54.20 per share.",
    "The scandal-plagued NGO of ex-Republicans devoted to destroying President Trump has seen its share of sex scandals involving one of its founders, John Weaver, harassing and soliciting unwilling young men and at least one 14-year-old boy.",
    "According to the Washington Free Beacon: The Lincoln Project shelled out another six-figure payment to a founding member of the super PAC who accused the organization of ignoring allegations of sexual misconduct within its ranks.",
    "As Vladimir Putin embarks on his Plan B — a massive military operation to try to grab at least a small bite of eastern Ukraine to justify his misbegotten war — I thought: Who could give him the best advice right now?",
    "Le'Shonte Jones, a TSA agent at Miami International Airport, was fatally gunned down in front of her daughter, 3, outside their home at Coral Bay Cove Apartments in the Miami suburb of Homestead, on May 3, 2021.",
    "They found that if people in Europe replaced meat and dairy with foods produced through new technologies, such as making fake steak out of bovine cells, it could significantly reduce all environmental impacts.",
    "Jeff Bezos on Monday questioned whether his fellow billionaire Elon Musk could be making Twitter vulnerable to pressure from China, as a result of Musk's extensive business liabilities in the Asian nation.",
    "When I called Arquilla and asked him what he’d tell Putin today, he didn’t hesitate: “I would say, ‘Make peace, you fool.’” This is also known as the first rule of holes: When you’re in one, stop digging.",
    "?” Jamil tweeted, along with four photos of herself\nPresident Biden said Monday that French President Emmanuel Macron didn’t take his call to congratulate the French leader on his election night victory.",
    "Elon Musk made Twitter a $43 billion offer to buy the whole company, which amounted to a 38% premium to what the stagnant stock had been trading at before Musk laid down cash to buy his first share.",
    "Now, after a bombshell report from the San Francisco Chronicle on Feinstein's dessicated state, Joe's White House is telling the press that he's got \"confidence\" in his former Senate colleague.",
    "According to Fox News: First lady Jill Biden expressed frustration that Kamala Harris was the top choice for vice president, according to an upcoming book from two New York Times reporters.",
    "Observers quickly noted the similarity in sentiment to loud declarations from prominent leftists that they would move to Canada if Donald Trump won the election in 2016 (few, if any, did).",
    "LOS ANGELES - A former Democratic political donor who supplied drugs to two men who overdosed in his West Hollywood apartment was sentenced Thursday to 30 years in federal prison.",
    "The 78-year-old style star covers Harper’s Bazaar’s May 2022 Beauty Issue, posing topless with an open Gucci blazer draped over her shoulders and her hands crossed over her chest.",
    "In an accompanying essay, the gap-toothed beauty opens up about her experience in the fashion industry, the dangers of overzealous plastic surgery and her simple skincare regimen.",
    "Like the Fantastic Mr. Fox, they have a cunning plan.They might not be any good at governing, but when it comes to seizing power by foul means or fair, they are world-class.",
    "Swapping animal products for future foods such as insect protein or cultured milk could reduce global warming, water and land use by over 80 per cent, a new study suggests.",
    "Researchers used computer modelling to find the optimal diet combination to meet nutritional needs, while also minimising global warming potential, water and land use.",
    "White House press secretary Jen Psaki blasted former President Donald Trump on Monday for spending time building a border wall instead of pursuing immigration reform.",
    "I settled on one of America’s premier teachers of grand strategy, John Arquilla, who recently retired as a distinguished professor of defense analysis at the U.S.",
    "According to CBS News: Elon Musk is offering to buy Twitter for $43 billion, saying the social media company \"needs to be transformed as a private company.\"",
    "Ed Buck, who was found guilty last year of nine felony counts, faced between 20 years and life in federal prison, according to the U.S. Attorney's Office.",
    "A Florida woman has been arrested for allegedly using a $15,000 PPP loan to hire a hitman to murder the 24-year-old woman she claimed stole her boyfriend.",
    "Any normal person would have taken it, as they'd find themselves very, very, well-compensated along with everyone else who owned shares in the company.",
    "They attempted to assert attorney-client privilege over materials that John Durham’s prosecution of Michael Sussmann is seeking to get its hands on.",
    "Jill made this raging comment that ended up in the book:\nWith a red wave coming, desperate Democrats are now embracing the politics of Hugo Chavez.",
    "This slow-motion train wreck first began in November 2019 when Gotabaya Rajapaksa won a decisive victory in the country’s presidential elections.",
    "But that's not their only scandal; there's a new one involving mysterious payouts for some sort of bad behavior, and these scandals aren't over.",
    "'Interesting question,' mused Bezos, who in 2013 bought The Washington Post with a view to protecting free speech and supporting journalism.",
    "Perhaps more amazing than the fact that Pelosi is appearing in this event at all is the fact that this isn’t the first time she’s done it.",
    "Compared with a program it replaced, the Washington College Grant allowed many more students to qualify for free or subsidized tuition.",
    "I fear this free speech bid is going to help this hell platform reach its final form of totally lawless hate, bigotry, and misogyny.",
    "Mr. Biden said he spoke with Mr. Macron’s staff when he tried to reach the French president Sunday night and he’ll try again Monday.",
    "ure enough, Elon Musk pulled the trigger, handed Twitter a fat offer of a buyout, and it's been nothing but bonkersville ever since.",
    "Rebecca Parson, a candidate for Washington’s 6th District that includes Tacoma, shared the comment recently in a post on Twitter.",
    "“I feel good about the French election,” Mr. Biden told reporters after returning to Washington from a weekend trip in Delaware.",
    "How many fewer crimes and government paid for kids and drug rehabs and other idiocy has been removed from the gene pool forever?",
    "'He commented atop a retweet from a New York Times journalist, noting that Musk's Tesla was extremely exposed to China.",
    "Then in August 2020, his Sri Lanka Podujana Peramuna party — the Sri Lanka People’s Front — posted a landslide victory.",
    "If you want a classic example of \"small,\" a pretty good place to look is on the hallowed heights of the Twitter elite.",
    "Sure enough, Joe Biden seems to recognize that he's strangling on his own border policies, and not for the first time.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Earlier this month,\nSri Lanka, an island nation of 22 million people, is in the grips of an economic meltdown.",
    "LONGVIEW — In 2019, Washington created one of the most generous college financial aid programs in the country.",
    "The win gave Rajapaksa the ability to amend the country’s constitution, which he quickly availed himself of.",
    "Public four-year institutions saw a collective drop in undergraduates of nearly 7% during that time period",
    "Last Tuesday, RedState reported on two desperate filings put forth by Hillary for America and Fusion GPS.",
    "Any ethical person would put the Musk offer out to a shareholders to vote, given the potential payout.",
    "There will be a reckoning and backlash and it won’t be pleasant to the feral part of our society.",
    "Community and technical colleges experienced a combined 24% drop between fall 2019 and fall 2021.",
    "Which brings us to the outrageous show trial of pro-Trump Georgia Rep. Marjorie Taylor Greene.",
    "He immediately placed family members into key government positions and suspended Parliament.",
    "One thing you know is that the Dems are not hiding under the duvet sucking their thumbs.",
    "\"Oregon and America have gone from being on the mend to being on the move,\" Biden said.",
    "The black females have become as violent and out of control as their male counterparts.",
    "No longer would eligible students be denied aid because of caps tied to limited funds.",
    "Jasmine Martinez, 33, is charged with first degree murder for masterminding the plot.",
    "The show, titled RuPail’s Drag Race All-Stars, is scheduled to premiere on May 20th.",
    "Yet they appear curiously relaxed, as if winning elections is no longer a priority.",
    "How gross do you have to be to be involved with the pervy, pervy Lincoln Project?",
    "Six decades into her modeling career, Lauren Hutton is still as stunning as ever.",
    "It’s frightening that a sub section of the black community has become this way.",
    "'Did the Chinese government just gain a bit of leverage over the town square?",
    "By all rights, the state's colleges should have seen a rush of applicants.",
    "It really can’t be hidden anymore in spite of the best efforts of the MSM.",
    "I spoke to his staff and he was at the Eiffel Tower having a good time.",
    "[Tweet] “1 adult supporting 1 kid needs $30 an hour across the country.",
    "Your donation helps keep our discussions going and our voices heard.",
    "I would like this to be my what lies here as my last tweet.",
    "Or is Joe Biden hearing from too many angry Democrats?",
    "Biden's speech was part pep talk, part explainer.",
    "\"We just gotta get the hell out of our own way.\"",
    "Just really *any* excuse to show pics of Barold.",
    "This time, though, he's looking for a way out.",
    "That's a pretty good deal for the rest of us.",
    "But then I stepped back and thought about it.",
    "But Twitter's board is none of those things.",
    "That left the obvious question open, though.",
    "“$15 minimum wage is an antiquated demand.",
    "Rural, urban, suburban: $30 is the floor.",
    "It should be $30 per hour,” she tweeted.",
    "“I tried to talk to him last night.",
    "Never mind what the voters think.",
    "Do senile dogs learn new tricks?",
    "And at a cost of only $10-15k?",
    "Instead, enrollment plummeted.",
    "Her toddler was also injured.",
    "No need to look, of course.",
    "Naval Postgraduate School.",
    "And Iran's mullahs.",
    "And Vlad Putin.",
    "Best of luck.",
    "Thank you.",
    "?"
  ]
}