{
  "id": 12742,
  "mediaId": 2547,
  "date": "2022-03-04",
  "headline": "Roger Stone Cusses Out Trump On Inauguration Day Over Lack Of Pardon",
  "image": "https://crooksandliars.com/files/mediaposters/2022/03/49685.jpg",
  "link": "https://crooksandliars.com/2022/03/bombshell-roger-stone-footage-exposes",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Frances Langum",
  "authorUrl": "https://crooksandliars.com/team/frances-langum",
  "termIds": [
    5336,
    2879,
    2765,
    3414,
    6430
  ],
  "sentences": [
    "There's a very long and worth-the-click article at The Washington Post outlining many of Roger Stone's activities commemorated ON FILM by people from The Netherlands making a documentary called \"A Storm Foretold.\"",
    "Ed Greenberger on Twitter summarized the video above as well as I could: \"Here’s Roger Stone on Inauguration Day turning on Trump because Trump didn’t give him a preemptive pardon for things he says he didn’t do.",
    "There are swears and threats and this particular gem:\nStone added that Trump might be vulnerable to prosecution by federal authorities in Manhattan after declining to preemptively pardon himself.",
    "https://t.co/sJ8aeapy4a pic.twitter.com/Q76k3Y8q0E\nAnd the whole thing reminds me of my husband's pinned tweet, that he wrote THE MORNING AFTER Trump was elected in 2016.",
    "“A good, long sentence in prison will give him a chance to think about it, because the Southern District is coming for him, and he did nothing,” Stone said.",
    "Though months later he would support a possible Trump bid for the White House in 2024, on Inauguration Day he mocked the idea.",
    "Why would Roger Stone advocate for a pardon for @Jim_Jordan as a result of events that occurred before or on January 6th?",
    "He then threatens to kill the filmmakers & physically beat Jared Kushner, who will end up 'brain dead.'\"",
    "Roger Stone's violent outburst is what happened when he didn't pardon his goons and henchmen after all.",
    "Why do criminals like Roger Stone say yes to Dutch documentarians?",
    "But WHY did he want pardons for Jim Jordan and Josh Hawley?",
    "You’ll get your f---ing brains beat in,” Stone said.",
    "Roger Stone is the guy you always thought he was.",
    "Because yeah.",
    "“Run again!",
    "Strange.",
    "Ego."
  ]
}