{
  "id": 12961,
  "mediaId": 2584,
  "date": "2022-03-04",
  "headline": "Roger Stone raged at ‘disgrace’ Trump over failure to overturn election – report",
  "image": "https://i.guim.co.uk/img/media/8e7b3656efdab71f721c84f09a96e357373c40b9/0_0_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=90ace5e5b5f10e8d16285f62c161a7d5",
  "link": "https://www.theguardian.com/us-news/2022/mar/04/roger-stone-trump-election-jared-kushner",
  "mediaOutlet": "Guardian US",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Martin Pengelly",
  "authorUrl": "https://www.theguardian.com/profile/martin-pengelly",
  "termIds": [
    5207,
    5413,
    2119,
    4905,
    4742,
    3925,
    2765,
    2879,
    3414
  ],
  "sentences": [
    "Washington Post report, based on unseen film footage, also says Stone, 69, said Jared Kushner ‘needs to have a beating’\nClose Donald Trump ally Roger Stone raged at the former US president in the aftermath of the failed attempt to overturn the 2020 election, according to a report from the Washington Post, telling a friend that Trump was a “disgrace” who would go to prison and adding: “He betrayed everybody.”\nThe Post said it had viewed 20 hours of footage of the political operative that had been shot for a forthcoming documentary.",
    "I’m not sure what they thought they were going to achieve.”\nBut he also said: “When you can’t get a fair and honest judicial opinion, when you can’t get a fair, honest and transparent election, when your legislative process is constipated by fear and threat …”\nThe Post said Stone then “slightly misquot[ed] former president John F Kennedy”: “Those who make peaceful progress impossible make violent revolution inevitable.”\nStone returned to Florida and worked on his pardon plan.",
    "More positive.” In the White House briefing room that evening, the Post said, Trump said: “If you count the legal votes, I easily win.”\nThe Post detailed Stone’s activities leading up to 6 January, including staying at the Willard hotel, a “command centre” for Trump associates.",
    "On 5 November, two days after election day and two days before Biden’s victory was called, the film-makers captured Stone talking to Michael Flynn, the former national security adviser Trump pardoned for lying to the FBI during the Russia investigation.",
    "“Clearly, Cipollone fucked everybody,” the Post quoted Stone as telling a friend, before messaging another: “See you in prison.”\nTrump had already commuted a three-year sentence handed to Stone for obstructing Congress during the Russia investigation.",
    "Stone, who has resisted cooperation with the House January 6 investigation, told the Post “any claim, assertion or implication that I knew about, was involved in or condoned the illegal acts at the Capitol on January 6” was “categorically false”.",
    "“A good, long sentence in prison will give him a chance to think about it, because the southern district is coming for him, and he did nothing,” Stone said, referring to prosecutors in New York investigating Trump’s business.",
    "Stone also said the paper employed “a clever blend of ‘guilt by association’, insinuations, half-truths, anonymous claims, falsehoods and out-of-context trick questions” and said the footage could be “deep fakes”.",
    "On 20 January 2021, inauguration day, enraged by a pardon on fraud charges for Steve Bannon, a rival for Trump’s attentions, Stone reportedly said Kushner, Trump’s son-in-law, was “going to get a beating.",
    "Tens of millions have placed their trust in the Guardian’s fearless journalism since we started publishing 200 years ago, turning to us in moments of crisis, uncertainty, solidarity and hope.",
    "The film-makers also shot Stone as he attempted to broker presidential pardons for money, and as he attempted to secure access to Trump’s rally near the White House on 6 January, but failed.",
    "Greater numbers of people can keep track of the global events shaping our world, understand their impact on people and communities, and become inspired to take meaningful action.",
    "Discussing a plan in which Trump would issue a blanket pardon to co-conspirators in the attempt to overturn the election, Senator Ted Cruz and congressman Jim Jordan among them.",
    "The footage, it said, showed Stone:\nMeeting and corresponding with members of a far-right militia since indicted for seditious conspiracy over the Capitol riot on January 6.",
    "These people are going to get what they’ve been asking for.”\nThe plan for a blanket pardon was reportedly blocked by Pat Cipollone, Trump’s White House counsel.",
    "You’ll get your fucking brains beat in.”\nHe told the film-makers: “Obviously if you use any of that, I’ll murder you.”\n… we have a small favour to ask.",
    "It’s not a joke.”\nStone also said Kushner should be “punished in the most brutal possible way” and would be “braindead when I get finished with him”.",
    "In 2020 he was closely involved with the “Stop the Steal” movement to overturn Joe Biden’s victory, driven by the lie of widespread electoral fraud.",
    "Stone then turned to Trump, who he said deserved to be impeached and whose presidency had been the “greatest single mistake in American history”.",
    "More than 1.5 million supporters, from 180 countries, now power us financially – keeping us open to all, and fiercely independent.",
    "Just the determination and passion to deliver high-impact global reporting, always free from commercial or political influence.",
    "The footage viewed by the Post was shot by Danish film-makers for a documentary, A Storm Foretold, to be released this year.",
    "The Post said intended recipients included senators Ted Cruz and Josh Hawley and representatives Jim Jordan and Matt Gaetz.",
    "Saying Jared Kushner, Trump’s son-in-law and close adviser, should be “punished” in a way that would leave him “braindead”.",
    "Footage, the paper said, showed Stone with members of the Oath Keepers militia now charged with seditious conspiracy.",
    "Now 69, Stone – who was once a “dirty trickster” for Richard Nixon – has been close to Trump since the 1980s.",
    "Suggesting violence against protesters for racial justice would be possible with the election out of the way.",
    "Millions can benefit from open access to quality, truthful news, regardless of their ability to pay for it.",
    "Next time we’re killing you.’”\nUrged to say he was joking, the Post said, Stone said: “No, it isn’t joking.",
    "“Once there’s no more election,” Stone reportedly said, “there’s no reason why we can’t mix it up.",
    "Reporting like this is vital for democracy, for fairness and to demand better from the powerful.",
    "As the Capitol riot began, the Post said, Stone was unavailable for a short period of time.",
    "Every contribution, however big or small, powers our journalism and sustains our future.",
    "Unlike many others, the Guardian has no shareholders and no billionaire owner.",
    "“Our slogan should be ‘count every legal ballot’,” Stone was quoted as saying.",
    "Stone also mocked Trump’s apparent plan to run again, saying: “Run again!",
    "He then told the film-makers: “I think it’s really bad for the movement.",
    "?Support the Guardian from as little as $1 – it only takes a minute.",
    "Spokesmen for Cruz and Jordan denied contacts with Stone.",
    "And needs to be told, ‘This time we’re just beating you.",
    "And we provide all this for free, for everyone to read.",
    "We do this because we believe in information equality.",
    "If there were ever a time to join us, it is now.",
    "He needs to have a beating.",
    "It hurts, it doesn’t help.",
    "“Much better messaging.",
    "Not joking.",
    "Thank you.",
    "?"
  ]
}