{
  "id": 13191,
  "mediaId": 2730,
  "date": "2022-02-27",
  "headline": "Amy Klobuchar Says Its 'Offensive' for Republicans to Criticize Biden's SCOTUS Pick as 'Far-Left'",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2020/14/4f6bb5f2-60c0-41c2-b7aa-c81fb7b7e59d.jpg",
  "link": "https://townhall.com/tipsheet/landonmion/2022/02/27/amy-klobuchar-says-its-offensive-for-republicans-to-criticize-bidens-scotus-pi-n2603872",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Landon Mion",
  "authorUrl": "https://townhall.com/tipsheet/landonmion/",
  "termIds": [
    0
  ],
  "sentences": [
    "After \"Fox News Sunday\" guest host Harris Faulkner pointed out that some Republicans have taken issue with the Supreme Court pick for being \"far-left,\" noting attorney Jonathan Turley saying recently that \"this is a political deliverable, a good one for President Biden\" because the other potential nominees were not as far-left, Klobuchar said the ideological term is \"offensive\" to her.",
    "\"Well, I just find those words offensive, honestly, because what I look at is this incredibly experienced woman who came up from two parents who were public school teachers, did everything she could — star of her high school debate team and is now nominated for the Supreme Court,\" Klobucher said.",
    "Biden declared during a Democratic primary debate in February 2020 that he would nominate a black woman to the high court should a vacancy arise, and later reaffirmed his stance when Associate Justice Stephen Breyer announced last month his plans to retire at the end of the current term.",
    "The Minnesota Democrat also explained that Jackson has had more experience as a judge than four of the justices currently sitting on the Supreme Court and would be just the second justice with trial judge experience should she be confirmed to the bench.",
    "And Sen. Lindsey Graham (R-S.C.) released a statement following reports that Jackson had been selected to fill the Supreme Court vacancy, with the lawmaker saying the pick \"means the radical Left has won President Biden over yet again.\"",
    "Source: AP Photo/Patrick Semansky\nDemocratic Sen. Amy Klobuchar of Minnesota said Sunday that she finds it \"offensive\" for Republicans to call President Joe Biden's Supreme Court nominee Ketanji Brown Jackson \"far-left.\"",
    "He said she is \"pretty radical\" and \"wrong\" on a number of issues, including those pertaining to parental rights, the first amendment and the second amendment.",
    "Graham was one of three Republican senators, along with Susan Collins (ME) and Lisa Murkowski (AK), to vote for her confirmation.",
    "Rep. Jim Jordan (R-OH) said on \"Fox and Friends Saturday\" that Jackson's nomination is \"another left-wing pick\" for Biden.",
    "The South Carolina senator had voiced his support for U.S. District Court for South Carolina Judge J. Michelle Childs.",
    "\"It's the reason she got bipartisan support throughout her confirmation hearings for other positions.\"",
    "If confirmed, Jackson would be the first black woman to serve on the Supreme Court.",
    "\"I think she's going to defy some expectations,\" Klobuchar said.",
    "Jackson was confirmed to the U.S. Court of Appeals for the D.C.",
    "\"I think she’s going to be a great judge.\"",
    "Circuit in 2021 by a 53-44 vote."
  ]
}