{
  "id": 13242,
  "mediaId": 2735,
  "date": "2022-02-27",
  "headline": "Republicans Are Already Sabotaging Biden’s Fragile Diplomacy With Iran",
  "image": "https://truthout.org/wp-content/uploads/2022/02/2022_0224-house-republicans-1200x675.jpg",
  "link": "https://truthout.org/articles/republicans-are-already-sabotaging-bidens-fragile-diplomacy-with-iran/",
  "mediaOutlet": "Truthout",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Knefel",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The letter states: “If your dependency on the Russians to revive the JCPOA is weakening our deterrent posture with the Russians in other areas of the world, the American people deserve to know.”\nAs Carl Beijer wrote in reaction, Republicans are “suggest[ing] that if Biden manages to make a deal with Iran, it will be because he pulled his punches in Ukraine and thereby gained Russia’s assistance.” Beijer calls this effort “an absolutely monstrous gambit” and argues that, “[t]he GOP is hoping to peel support off Biden’s supporters among people who are anxious about Russia by promoting a narrative where any deal he cuts with Iran implies a backchannel deal with Putin as well.",
    "In an interview in the Financial Times, Iran’s Foreign Minister Hossein Amir-Abdollahian called on Congress to “issue a political statement announcing their support of the agreement and a return to J.C.P.O.A.” He added, “Iran cannot accept as a guarantee the words of a head of state, let alone the United States, due to the withdrawal of Americans from the JCPOA.”\nJoe Cirincione, a distinguished fellow at the Quincy Institute, tweeted that “the biggest remaining obstacle” to a deal was “the lack of US credibility” due to Trump’s unilateral withdrawal from the first deal.",
    "“All the political posturing notwithstanding, there is practically nothing that Congress can do to stop that from happening.”\nStill, the two letters send an unmistakable message to Iran’s leaders that should a Republican win the presidential election in 2024, any diplomatic agreements made by the Biden administration won’t be honored.",
    "The United States and Iran appear to be in the final stages of negotiations to revive a 2015 agreement, known officially as the Joint Comprehensive Plan of Action (JCPOA), which imposed strict limits on Iran’s nuclear enrichment capabilities in exchange for lessening the country’s diplomatic and economic isolation.",
    "And where any de-escalation in Ukraine implies the same thing.”\nThe Biden administration and Democrats in Congress should forcefully push back against this kind of new Cold War reasoning and continue to pursue diplomacy with Iran, making every effort to de-escalate the looming conflict between Russia and Ukraine.",
    "“Any agreement related to Iran’s nuclear program which is not a treaty ratified by the Senate is subject to being reversed, and indeed will likely be torn up, in the opening days of the next Presidential administration, as early as January 2025,” the senators wrote.",
    "The Republicans’ letter to Biden states that if he “forge[s] an agreement with the Supreme Leader of Iran without formal Congressional approval, it will be temporary and non-binding and meet the same fate” as the deal negotiated under President Obama.",
    "Former Iranian President Hassan Rouhani, a moderate who negotiated and ultimately signed the agreement, has been politically marginalized and targeted by opponents of the deal, some of whom have gone so far as to demand he be prosecuted for treason.",
    "Indeed, ever since then-President George W. Bush included Iran in the so-called Axis of Evil in his 2002 State of the Union address, conservatives have found wide-ranging political utility in manufacturing Iran as the world’s great supervillain.",
    "But much of the conservative, anti-Iran rhetoric from the Bush-era onward has relied on racist, Orientalist tropes about Iranians being untrustworthy, sneaky or duplicitous, or else suicidal, irrational and universally consumed by antisemitism.",
    "Members of the nationalist wing — as epitomized by Trump, his adviser Steve Bannon, and Congresspeople Marjorie Taylor Greene and Lauren Boebert — are more likely to engage in open Islamophobia in staking out their anti-Iran positions.",
    "More than 150 Republican members of Congress recently signed a letter promising to oppose any deal between the Biden administration and Iran that wasn’t simultaneously ratified as a treaty and approved by two-thirds of the Senate.",
    "“For ordinary people, sanctions mean unemployment, sanctions mean becoming poor, sanctions mean the scarcity of medicine, the rising price of dollar,” Akbar Shamsodini, an Iranian businessman told The Guardian in 2018.",
    "Far too much reporting in the United States has also uncritically advanced the idea that Iran is committed to acquiring nuclear weapons and is on the verge of doing so, regardless of changing conditions in the country.",
    "Another aspect of the recent House GOP letter deserves attention: The letter highlighted the role Russia is reportedly playing in the negotiations, which have been largely indirect between Iran and the United States.",
    "Before you go — please read the important update below\nFor the last two decades, millions of readers have relied on Truthout to provide accurate, transparent journalism through moments of political and social crisis.",
    "Although Trump engaged in more explicitly anti-Muslim, bigoted rhetoric than his fellow primary candidates in 2016, every Republican presidential hopeful promised to rip up the deal, regardless of Iran’s compliance.",
    "Iran has also reportedly asked that its Islamic Revolutionary Guard Corps be removed from a U.S. terrorist watchlist; it’s not clear whether the Biden administration is considering taking that measure.",
    "The other signatories to the deal — France, Germany, the U.K., China and Russia — were all forced to determine whether or not they would continue to abide by the agreed-upon terms of the deal.",
    "Signatories to the recent letter to Biden included House Minority Leader Kevin McCarthy, hardcore Trumpists like Louie Gohmert and Jim Jordan, and “never-Trump” conservative Liz Cheney.",
    "In many ways, the anti-Iran positions help clarify how little daylight there is between the so-called nationalist wing of the party and the more traditional neoconservative wing.",
    "The original 2015 deal gave Congress a 60-day review period to study the agreement, and Republicans in both chambers were ultimately unsuccessful in derailing it legislatively.",
    "Ayatollah Ali Khamenei recently reiterated that his country is only developing its nuclear program for peaceful purposes, specifically to ensure their energy independence.",
    "Republicans promised to “investigate any connections” between the Iran talks and the concurrent diplomatic efforts to prevent Russia from invading Ukraine.",
    "“The reality is that the JCPOA has already been reviewed and voted on in Congress,” Ali Vaez, Iran project director at Crisis Group, recently told Axios.",
    "Over the last year, we’ve struggled to meet our basic operating costs, as Facebook and Google have reduced the visibility of non-corporate news stories.",
    "Iran’s government wants assurances that any agreement won’t be ripped up by a future U.S. president, as Donald Trump did with the first deal.",
    "Those assurances aren’t likely to be forthcoming, however, as the Senate is all but guaranteed not to ratify any deal as an official treaty.",
    "The sanctions also severely limited Iranians’ access to medicine and other health care, despite theoretical exemptions for humanitarian aid.",
    "Those claims are supported by the UN’s International Atomic Energy Agency, which hasn’t found evidence that Iran is making a nuclear weapon.",
    "For as much ink is spilled about the supposed fractures in the Republican Party, the unanimously hawkish approach to Iran is illuminating.",
    "Agitating for open conflict only serves the hardliners and war profiteers in the United States and abroad — and endangers countless lives.",
    "Trump withdrew from the agreement in May 2018, despite his own administration twice certifying that Iran was in compliance with the deal.",
    "Even if the first deal had been ratified as a treaty, it’s possible Trump could have exited the deal without congressional approval.",
    "The U.S. then imposed harsh sanctions on Iran, driving up energy prices and inflicting significant pain on Iranian citizens.",
    "As a result, our stories are being seen by fewer people at a time when trustworthy journalism is so desperately needed.",
    "We’re working hard to mitigate these issues but we still have an immediate need for your help, especially right now.",
    "Instead, it would be an executive agreement, like the first deal, which can be undone by future executive actions.",
    "Hardliners in both the United States and Iran have long opposed any deal that the other country could agree on.",
    "We’ve been proud to remain donor-supported — not once accepting money from advertisers or corporate funders.",
    "Iran has long stated that its nuclear program is only for energy production, and is entirely peaceful.",
    "Opposition to diplomacy is prevalent among elected Republicans in the United States as well.",
    "Earlier this month, 33 Republican senators sent their own letter with a similar warning.",
    "Whether you’re able to make a $5 monthly donation, or give more — we need you, today.",
    "Don’t miss a beat\nGet the latest news and thought-provoking analysis from Truthout.",
    "There are still several key sticking points that could derail the negotiations.",
    "The practical effect of the threats is limited, as least for the time being.",
    "We have just 6 days left in our fundraiser and still need to raise $37,000.",
    "Any amount of support you can spare right now will go a very long way.",
    "Some reports say a deal could be announced in as soon as two weeks.",
    "Opposition to the deal is nearly uniform in the Republican Party.",
    "Please, do what you can to help us get through this trying time.",
    "But now, we face an existential threat to our survival.",
    "Donate Now"
  ]
}