{
  "id": 13256,
  "mediaId": 2640,
  "date": "2022-03-01",
  "headline": "McCarthy, McConnell Slam Fellow GOPers Over America First Event",
  "image": "https://img1-azrcdn.newser.com/image/1400962-12-20220301073815.jpeg",
  "link": "https://www.newser.com/story/317518/mccarthy-mcconnell-slam-fellow-gopers-over-america-first-event.html",
  "mediaOutlet": "newser.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jenn Gidman",
  "authorUrl": "https://www.newser.com/bio/83598875/jenn-gidman.html",
  "termIds": [
    2267,
    2443,
    4267,
    4066,
    1359,
    44,
    6175,
    6488,
    5949
  ],
  "sentences": [
    "The Hill notes that House Minority Leader Kevin McCarthy, \"who is banking on support from members of the far right like Greene in his quest to become speaker,\" has stayed mum on the controversy, but on Monday, he finally spoke out, calling Greene and Gosar's participation in the conference \"unacceptable.\"",
    "Now, the Georgia congresswoman—and fellow GOPer Rep. Paul Gosar, of Arizona, who appeared virtually at the America First Political Action Conference—are on the receiving end of a rebuke from additional prominent names in their party.",
    "McCarthy told CNN that Greene should have exited the stage in Orlando, Fla., when she heard the introductory remarks by Nick Fuentes, the white nationalist who put together the conference.",
    "Politico notes that the admonitions from McCarthy and McConnell come as Greene and Gosar show \"the most serious signs of isolation yet\" within their own party for their far-right leanings.",
    "Reps. Scott Perry and Jim Jordan would only offer vague criticism of racism, without criticizing Fuentes, Gosar, or Greene, while Rep. Chip Roy didn't hesitate to be more blunt.",
    "(Newser) – Marjorie Taylor Greene has already received a slap on the wrist from the chairwoman of the RNC for her appearance Friday at a white nationalist conference.",
    "Meanwhile, the Washington Post reports that Senate Minority Leader Mitch McConnell issued a similar statement, though he didn't mention Greene or Gosar by name.",
    "As for further repercussions, McCarthy would only say he'd \"have a discussion\" with Greene and Gosar over the recent developments.",
    "\"Nick Fuentes is an a--hole,\" he said, adding he was \"frustrated by colleagues who have chosen to associate in this situation.\"",
    "\"I definitely want to disassociate myself from it,\" Sen. John Thune said, echoing McCarthy's \"unacceptable\" description.",
    "Politico talked to multiple Republican lawmakers, who offered various levels of reprimand for Gosar and Greene.",
    "\"The party should not be associated, any time, any place, with somebody who is antisemitic,\" McCarthy said.",
    "\"There's no place in the Republican Party for white supremacists or antisemitism,\" he said.",
    "\"There's no place in our party for any of this.\"",
    "(Read more Kevin McCarthy stories.)"
  ]
}