{
  "id": 1330,
  "mediaId": 2721,
  "date": "2022-02-14",
  "headline": "Hillary Clinton team caught in explosive spy scandal",
  "image": "https://thehornnews.com/wp-content/uploads/2018/10/Hillary-600x315-cropped.jpeg",
  "link": "https://thehornnews.com/hillary-clinton-team-caught-in-explosive-spy-scandal/",
  "mediaOutlet": "thehornnews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“This is so wrong and allegations of such ?a ?level of illegal activity that goes directly to our faith in our own government that the truth must be found.”\nTurner predicted that Durham’s probe could later implicate former top intelligence officers, including former CIA Director John Brennan and former FBI Director James Comey.",
    "“The only thing we didn’t understand was it was worse than we thought?.”\nRep. Michael Turner, R-Ohio, called the information in Durham’s filing a threat to American democracy on Fox News’ “Sunday Morning Futures.”\n“It doesn’t matter really which political campaign this is or which political party this is,” Turner said.",
    "In a motion filed on February 11, special counsel John Durham’s investigation into the origin of the Russiagate probe said that Hillary Clinton’s failed 2016 presidential campaign accessed servers associated with Donald Trump to help build a narrative that he was coordinating with Russia.",
    "The lawyer, Michael Sussmann, allegedly used campaign funds to pay a technology company “infiltrate” the computer servers at Trump Tower — and later servers the White House Executive Office — to build a “narrative” that members of Trump’s team were coordinating with the Kremlin.",
    "“The latest pleading from Special Counsel John Durham provides indisputable evidence that my campaign and presidency were spied on by operatives paid by the Hillary Clinton Campaign in an effort to develop a completely fabricated connection to Russia,” Trump’s statement read.",
    "The Truth About CBD [Sponsored]\nFirst reported by the Washington Examiner and Fox News, a lawyer linked to Clinton’s failed 2016 presidential campaign reportedly had a technology company spy on the Trump campaign… and the White House after Trump took office.",
    "Conservative activist Dan Scavino, the former White House Deputy Chief of Staff for Communication under Trump, posted a 60 Minutes interview from October 2020 where the former president’s claims were dismissed —\n— Dan Scavino Jr.????????????",
    "“Yep, there was spying going on, and it was worse than we thought because they were spying on the sitting ?p?resident of the United States,” Rep. Jim Jordan, R-Ohio, told “Fox & Friends” over the weekend.",
    "“This is a scandal far greater in scope and magnitude than Watergate and those who were involved in and knew about this spying operation should be subject to criminal prosecution.”\nSurprise!",
    "In addition, reparations should be paid to those in our country who have been damaged by this.”\nFor years, the mainstream media dismissed Trump’s claims about spying from Clinton campaign.",
    "Sponsored: This common fruit could help support blood pressure (not what you think)\nMark Meadows, the White House’s former chief of staff, released a statement on social media.",
    "https://t.co/z991l7Mc9r\n— Mark Meadows (@MarkMeadows) February 12, 2022\nTrump himself released a blistering statement on his blog after the Durham filing was made public.",
    "Eggs do this to senior brains [Sponsored]\n“In a stronger period of time in our country, this crime would have been punishable by death.",
    "You Need To Know About This Enzyme [Sponsored]\n“And it goes right to the Clinton campaign.”\n“So, God bless John Durham.",
    "They would reportedly later bring that narrative to government agencies investigating Trump’s team, Fox News reported.",
    "Sussmann has previously been charged with lying to federal investigators.",
    "They spied on Donald Trump as sitting President of the United States.",
    "Take a look —\nThey didn’t just spy on Donald Trump’s campaign.",
    "But we’re getting to ?now what we all suspected,” he said.",
    "Republican leadership reacted to the news with outrage.",
    "(@DanScavino) February 12, 2022\nThe Horn editorial team",
    "?His investigation is taking a long time.",
    "It was all even worse than we thought.",
    "He pleaded not guilty to the charges.",
    "And that’s just the beginning.",
    "Over 60?"
  ]
}