{
  "id": 1342,
  "mediaId": 2752,
  "date": "2022-02-14",
  "headline": "What The Hell Are The Wingers On About Now With John Durham?",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTMzMjE4My9vcmlnaW4uZ2lmIiwiZXhwaXJlc19hdCI6MTcxMjQ0NDMxNX0.DUmqjlJYAlD--rVnISOa2UOCztf5DOVHSxO4T08ocQg/img.gif?width=1200&coordinates=0%2C32%2C0%2C32&height=600",
  "link": "https://www.wonkette.com/what-the-hell-are-the-wingers-on-about-now-with-john-durham",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Dye",
  "authorUrl": "https://www.wonkette.com/u/five_dollar_feminist",
  "termIds": [
    0
  ],
  "sentences": [
    "\"The Government has discussed these matters with the defense and believes that any potential conflicts likely could be addressed with a knowing and voluntary waiver by the defendant upon consultation with conflict-free counsel as appropriate,\" he concedes in the very first paragraph of this pleading, before going on to accuse Sussmann of lying in the February 9 meeting, and thus being in potential conflict with Elias.",
    "And Durham is only airing this supposed \"conflict\" between Sussmann and his lawyers — a conflict the Special Counsel knew about five months ago when he indicted Sussmann and which Sussmann has anyway already waived — after the statute of limitations ran out, and its value exists solely in feeding a false narrative from his buddies on the right.",
    "As Foer wrote, \"a small, tightly knit community of computer scientists who pursue such work -- some at cybersecurity firms, some in academia, some with close ties to three-letter federal agencies\" -- are permitted access to enormous amounts of data about internet traffic so that they can monitor for malware and nefarious incursions.",
    "''This is a scandal far greater in scope and magnitude than Watergate and those who were involved in and knew about this spying operation should be subject to criminal prosecution,\" he arglebargled, adding later, \"In a stronger period of time in our country, this crime would have been punishable by death.",
    "A Long Time Ago There Was A Bizarre Story About A Trump Organization Server And A Russian Bank ...\nBack in 2016, journalist Franklin Foer broke a weird story in Slate about a Trump Organization server that had all these odd electronic pings to a server associated with a Russian entity known as Alfa Bank.",
    "\"Special Counsel Durham's latest pleading involving indicted campaign lawyer Michael Sussmann definitively shows that the Hillary Clinton campaign directly funded and ordered its lawyers at Perkins Coie to orchestrate a criminal enterprise to fabricate a connection between President Trump and Russia.\"",
    "The computer scientists posited a logical hypothesis, which they set out to rigorously test: If the Russians were worming their way into the DNC, they might very well be attacking other entities central to the presidential campaign, including Donald Trump’s many servers.",
    "“We wanted to help defend both campaigns, because we wanted to preserve the integrity of the election,” says one of the academics, who works at a university that asked him not to speak with reporters because of the sensitive nature of his work.",
    "One of the guys working on this effort was cybersecurity legend Rodney Joffe, who spotted the weird traffic between the Trump Org server and a Russian bank and flagged it to Michael Sussmann, a lawyer at DC law firm Perkins Coie.",
    "Durham is taking advantage of the fact that the firm of Latham & Watkins, which is now representing only Sussmann, has also in the past represented his former employer Perkins Coie and his former partner Marc Elias.",
    "(\"Russia, if you're listening ...\")\nThe only campaign that was spied on was Hillary Clinton's, which got hacked and saw its internal communications weaponized by Trump surrogates like Roger Stone and Steve Bannon.",
    "When Baker testified to the House Judiciary Committee in 2018, GOP Reps. Jim Jordan and Mark Meadows were openly scornful of his assertion that he didn't know Sussmann's firm repped the DNC and Clinton's campaign.",
    "Let's talk about the latest filing by Special Counsel John Durham, since the wingers are soiling their Underoos over it, certain that, at long last, they will be able to prove that THE BITCH SET HIM UP!",
    "But if you think John Durham gives a flea's fart about Sussmann winding up in conflict with his attorneys, you probably have a framed \"diploma\" from Trump \"University\" above your living room \"sofa.\"",
    "Rodney Joffe had legitimate access to the data that showed possible contacts between Trump and Russia at a time when he was publicly asking Vladimir Putin to go steal Hillary Clinton's emails.",
    "Baker says he doesn't remember what Sussman said, but it wouldn't have made any difference because they'd have followed it up the same way regardless of the genesis of the information — i.e.",
    "The New Thing They're Caterwauling About\nThat's a lot of words to get us to last Friday, when Durham filed a \"Motion to Inquire Into Potential Conflicts of Interest\" in Sussmann's case.",
    "In September of 2021, five minutes before the five-year statute of limitations was going to lapse, Durham indicted Sussmann on one count of making a false statement to James Baker.",
    "Word arrived that Russian hackers had infiltrated the servers of the Democratic National Committee, an attack persuasively detailed by the respected cybersecurity firm CrowdStrike.",
    "As part of that work, Durham alleges, Elias met with Joffe and Sussmann to massage the Alfa Bank allegations prior to a February 9, 2017, meeting Elias had with the CIA.",
    "That's screeching from a press release from former Trump administration official Kash Patel, sent from his new perch at the astroturf group Center for Renewing America.",
    "Here on Planet Earth, this storyline is bound to crash and burn, not just because it's bullshit, but because it's more complicated than a Pepe Silvia stringboard.",
    "You probably know Elias as the lawyer who makes Republicans insane by filing all the election lawsuits, but in 2016 he represented the DNC and Clinton campaigns.",
    "Sussmann says he claimed not to be coming to the FBI on behalf of a particular client, which is technically true, since his firm repped both the DNC and Joffe.",
    "They spied on Donald Trump as sitting President of the United States,\" Mark Meadows tweeted regarding the White House server traffic Joffe legally accessed.",
    "So, with the caveat that our understanding of how internet security works is by no means fairly decent, let's dive into this puddle of piddle, shall we?",
    "Nevertheless Durham uses the specter of \"conflicts\" between Elias, Sussman, and Perkins Coie to suggest there was something hinky about that meeting.",
    "And PS, if you had trouble following this, ask yourself if the average mouth-breathing MAGA doofus is going to be able to make heads or tails of it.",
    "But Special Counsel John Durham, appointed by Bill Barr to make something, anything stick to the Clinton campaign, has taken the opposite tack.",
    "even if Sussmann lied about coming there on behalf of the Clinton campaign, it probably wouldn't meet the legal standard for materiality.",
    "Sussmann represented Joffe, and, as literally everyone in DC knows, Perkins Coie represented both the DNC and the Clinton campaign.",
    "But when Baker called his deputy Bill Priestap to hand the thing off, Priestap's notes read, \"said not doing this for any client.\"",
    "— Sussmann was never charged with lying to the CIA, and the five-year statute of limitations just expired re: this meeting.",
    "In fact, the filing does no such thing, although it was certainly drafted to give hacks like Patel space to claim it does.",
    "You need to have a fairly decent understanding of how internet security works to understand what they're getting at.",
    "And Trump himself spent the weekend braying for blood, but not on Twitter because he's not allowed there anymore.",
    "Trump's campaign met with a Russian agent promising dirt on Hillary Clinton (\"If it's what you say, I love it!)",
    "Jim Baker doesn't remember what happened in the meeting, and his deputy's notes are probably hearsay anyway.",
    "As national security guru Marcy Wheeler points out — God bless this person for explaining this shit to us!",
    "Literally no one in DC was ignorant of Sussmann or Perkins Coie's connection to the Clintons and the DNC.",
    "The only hack was the one Russia waged against the Clinton campaign, which Trump gleefully weaponized.",
    "They didn't hack Trump Tower, or the Trump Organization, or the White House, or the Trump campaign.",
    "In addition, reparations should be paid to those in our country who have been damaged by this.\"",
    "In September of 2016, Sussmann brought the Alfa Bank data to FBI general counsel James Baker.",
    "In late spring, this community of malware hunters placed itself in a high state of alarm.",
    "Now, normally we would not put scare quotes around the heading of a legal filing.",
    "Clinton never paid Rodney Joffe — in fact Joffe paid Sussmann for his services.",
    "And that was right before he wrote, \"Represents DNC, Clinton Foundation, etc.\"",
    "And if you do, you understand immediately that there was no \"hack\" at all.",
    "Like we said, everyone knew who his clients were, and DC ain't that big.",
    "And if you're ordering from Amazon, use this link, because reasons.",
    "Click the widget to keep your Wonkette ad-free and feisty.",
    "To be clear, these guys were granted access to the data.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000",
    "\"They didn’t just spy on Donald Trump’s campaign.",
    "And a suggestion is all these filthy liars need.",
    "\"It was all even worse than we thought.\"",
    "How often would you like to donate?",
    "Well, he would say that.",
    "It's smoke and mirrors.",
    "Thanks, Hillary!",
    "Ughhhhhhh, fine.",
    "So Dramatic!",
    "TL;DR!"
  ]
}