{
  "id": 1366,
  "mediaId": 4024,
  "date": "2022-02-18",
  "headline": "President Trump’s political enemies spied on him in the White House, DOJ investigator says",
  "image": "https://www.lifesitenews.com/wp-content/uploads/2022/02/trump-1-shutterstock.jpg",
  "link": "https://www.lifesitenews.com/news/durham-court-filing-trumps-political-enemies-spied-on-him-while-in-the-white-house/",
  "mediaOutlet": "LifeSiteNews",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In doing so, Tech Executive-1 indicated that he was seeking to please certain ‘VIPs,’ referring to individuals at Law Firm-1 and the Clinton Campaign.”\n“The Government’s evidence at trial will also establish that among the Internet data Tech Executive-1 and his associates exploited was domain name system (‘DNS’) Internet traffic pertaining to (i) a particular healthcare provider, (ii) Trump Tower, (iii) Donald Trump’s Central Park West apartment building, and (iv) the Executive Office of the President of the United States,” the filing states.",
    "“The question now is whether anyone will be held accountable.”\nRepublican U.S. Rep. Jim Jordan of Ohio called the spying on Trump “truly unprecedented.”\nConsidering “the broader context of a few years ago, it was the Democrats using the IRS to target conservatives,” he said, and now the Department of Justice targeting “moms and dads who show up at school board meetings … it’s even more frightening.”\n‘So much bigger than Watergate’\n“This is so much bigger than Watergate,” The Federalist editor-in-chief Mollie Hemingway reacted on FOX News.",
    "Their ‘job was to gather data they had access to thanks to a Pentagon contract in order to connect Donald Trump to Putin’\n“A government contractor spied on a populist presidential candidate, then passed the information to his opponent’s campaign, which gave it to the FBI and the news media, which distorted it to create the illusion of treason, which was then cited by the politician who paid for the whole thing as a reason not to vote for the guy she spied on,” Tucker Carlson summarized on Tucker Carlson Tonight.",
    "The good news is, everybody is talking about not only this atrocity against our Nation, but that the press refuses to even mention the major crime that took place.”\nTrump also slammed the “LameStream” media for refusing to cover the spying revelations, calling it “a story so big, so powerful, and so important for the future of our nation.”\nMeanwhile, Clinton called it a “fake scandal.”\n“Trump & Fox are desperately spinning up a fake scandal to distract from his real ones.",
    "The more his misdeeds are exposed, the more they lie,” she tweeted, offering an article from left-wing Vanity Fair as “a good debunking of their latest nonsense.”\nThe article is titled “You’ll Never Believe It But Hillary Clinton Did Not, In Fact, Spy On Trump’s White House,” and its subhead reads, “In less breaking news, Donald Trump remains a moron.”\nTrump & Fox are desperately spinning up a fake scandal to distract from his real ones.",
    "Most of his judicial nominees have pleased pro-lifers, as well, although the ultimate test of that will be whether the three justices he appointed to the U.S. Supreme Court side with pro-lifers on overturning Roe v. Wade later this year (the Court is considering Mississippi’s 15-week abortion ban, which if upheld would mean the end of Roe and a new era in which states would likely be empowered to enact their own abortion bans).",
    "Trump reinstated and expanded the ban on foreign aid to abortion-involved groups (including International Planned Parenthood Federation), banned groups that commit or refer abortions from Title X family planning funds, overturned Obama-era regulations that barred states from defunding Planned Parenthood, and issued rules protecting Americans from being forced to subsidize abortion in government-mandated health insurance plans.",
    "Everyone’s got a role.”\nRecalling news coverage about “non-partisan computer scientists” who had supposedly “dug up all this new information about Donald Trump’s ‘direct connection to Vladimir Putin,’” Carlson quipped, “You may not be shocked to learn they weren’t non-partisan.”\n“In fact, a pro-Hillary Clinton activist from South Africa called Rodney Joffe put together a team of digital researchers,” he said.",
    "For those interested in reality, here’s a good debunking of their latest nonsense.https://t.co/iYY8Uxuogx\n— Hillary Clinton (@HillaryClinton) February 16, 2022\nTrump’s one-term presidency saw significant gains for the pro-life movement, with the 45th president becoming the first sitting president to address the annual March for Life in person in 2020.",
    "“The implication that the data was exploited for a political purpose is a scandal that requires investigation under oath.”\n“Can you imagine if the roles were reversed and the Republicans, in particular President Donald Trump, got caught illegally spying into the Office of the President?” Trump asked in another statement.",
    "In addition, reparations should be paid to those in our country who have been damaged by this.”\nDurham’s filing alleges that a Clinton campaign lawyer named Michael Sussman enlisted tech “researchers to mine Internet data to establish ‘an inference’ and ‘narrative’ tying then-candidate Trump to Russia.",
    "“The latest pleading from Special Counsel Robert [sic] Durham provides indisputable evidence that my campaign and presidency were spied on by operatives paid by the Hillary Clinton Campaign in an effort to develop a completely fabricated connection to Russia,” Trump responded.",
    "‘Imagine if the roles were reversed’\n“White House communications are supposed to be secure, and the notion that any contractor — much less one with ties to a presidential campaign — could access them is alarming enough,” wrote The Wall Street Journal editorial board.",
    "In addition, the Trump administration consistently worked to defend life and oppose abortion at the United Nations, from resisting pro-abortion agenda items and resolution language to affirming that abortion isn’t a human right and promoting abstinence education.",
    "Those lies caused so much damage to the country.”\nHemingway slammed the media for being silent on the scandal, urging viewers to “think about that compared to the daily drip of crazy Russia stories” to which Americans were subjected while Trump was president.",
    "The purpose of surveilling then-candidate Trump at Trump Tower, his apartment, and via “a particular healthcare provider,” and then at his executive office when he was president, was to try to smear him as connected to Russia, the filing says.",
    "“These are serious crimes.”\nHawley asked Garland to instruct individuals connected to the Clinton campaign who are currently serving in the Biden administration to recuse themselves from any involvement in the Durham investigation.",
    "Joffe’s cyber researchers’ “job was to gather data they had access to thanks to a Pentagon contract in order to connect Donald Trump to Putin.”\n“Every American should be outraged by this,” fellow FOX host Maria Bartiromo reacted.",
    "“The Clinton campaign may have engaged in criminal conduct that includes hacking into computer servers and lying to the FBI,” Republican U.S. Sen. Josh Hawley of Missouri wrote to Attorney General Merrick Garland.",
    "The “shocking revelations” of the new court filing “show that the 2016 Clinton Campaign was a criminal enterprise involving lawyers, Big Tech, and current Biden Administration officials,” Hawley wrote.",
    "This implicates so many people: the Clinton campaign that funded the operation … the media, who spent years lying and claiming that Donald Trump had stolen the 2016 election by colluding with Russia.",
    "(LifeSiteNews) – A lawyer linked to Hillary Clinton’s 2016 campaign paid a tech company to spy on Donald Trump while he was president, Special Counsel John Durham argued in a court filing last week.",
    "He also forcefully denounced abortion, calling attention to Democrats’ opposition to anti-infanticide legislation and calling on Congress to send him a ban on late-term abortion to sign.",
    "“This is a scandal far greater in scope and magnitude than Watergate and those who were involved in and knew about this spying operation should be subject to criminal prosecution.",
    "She noted the fact the many national security implications the new Durham filing revealed: “Do you know how many foreign countries wanna get into the White House’s internet flow?",
    "“The spying operation against Donald Trump wasn’t just during the campaign; they were also spying on White House servers, Trump Tower while he was president,” she summarized.",
    "What does that tell us about the power of the Clinton machine … ?”\n“This is the biggest scandal we have ever seen,” Bartiromo said.",
    "The filing and investigation surrounding it show just how broad and high-reaching collusion against the former president was.",
    "“Most of them came from Georgia Tech.”\nClinton had promised Joffe a cybersecurity job if she won the election, Tucker said.",
    "How many adversaries out there wanna get into the White House, the president of the United States’ internet activity?",
    "And this tech executive was able to do that?”\n“What does that tell us about the national security of this country?",
    "“This information was weaponized by powerful government officials including at the Department of Justice.",
    "The charge was based on a conversation that took place shortly before the 2016 general election.",
    "“All hell would break loose and the electric chair would immediately come out of retirement.",
    "In a stronger period of time in our country, this crime would have been punishable by death.",
    "In September 2021, Durham’s office charged Sussman with lying to the FBI.",
    "There is wide speculation Trump will run again in 2024.",
    "The more his misdeeds are exposed, the more they lie.",
    "So it’s a day that ends in Y.",
    "So it’s a day that ends in Y.",
    "He pleaded not guilty.",
    "It’s a closed loop.",
    "“Got it?"
  ]
}