{
  "id": 14008,
  "mediaId": 2593,
  "date": "2022-03-16",
  "headline": "Fauci Frets About What Will to Him Happen if Republicans Take Control of Congress in November",
  "image": "https://ijr.com/wp-content/uploads/2022/03/GettyImages-1232288780.jpg",
  "link": "https://ijr.com/fauci-frets-happen-republicans-control-congress/",
  "mediaOutlet": "IJR",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Davis",
  "authorUrl": "https://ijr.com/author/wj/ ",
  "termIds": [
    0
  ],
  "sentences": [
    "“This is probably better left to an independent commission that has some arms’ distance from the politics of the hour and is able to claim some kind of credible bipartisanship,” said J. Stephen Morrison, who leads global health policy for the Center for Strategic and International Studies, according to the Post.",
    "“It just seems, though, that Dr. Fauci was the bottleneck that stopped all the significant information from getting to the top level, and then squelched the most important fact, that indeed this could have been made in the lab in Wuhan, China.”\nThis article appeared originally on The Western Journal.",
    "It’s those Republicans, who stand a chance of taking control of either part or all of Congress, depending upon the moment, and have vowed to investigate Fauci’s conduct from the time he was funding research in China to the days when he flip-flopped in the advice he gave the American people.",
    "He claimed current GOP efforts “are taking away from our effort of fighting this outbreak.”\nDeclaring that Republicans’ “distortion of reality is stunning,” he said his agency’s legislative staffers are “probably spending 40, 50 percent of their time” on responses to information requests.",
    "When are we going to have accountability for Anthony Fauci?”\n“If you’re watching this, Dr. Fauci, look out because when the Americans give us control in the House of Representatives, God willing, we’re going to get some answers on behalf of the American people,” the congressman said.",
    "“If we take over the Senate next year, I’ll be chairman of the health committee, and I pledge to use the subpoena power to get every last record about the origin of the virus, about Fauci,” GOP Sen. Rand Paul of Kentucky has said, according to the Post.",
    "“I want to talk about the Americans who have lost their job because of vaccine mandates, whether they are military or health care workers, or maybe a Border Patrol agent, federal worker, who have been forced to lose their job if they didn’t take a jab.",
    "“I want to talk about the children who can’t actually enunciate their words because they now need speech therapy, or they had mental health issues, or we’ve got drug addicts, people who have died because they’ve had mental health issues.",
    "Rep. Chip Roy of Texas said in a recent Fox News interview that he wants “to hold Anthony Fauci accountable.”\n“I want to talk about the dead Americans, people who had myocarditis, people who had a reaction to the vaccine,” Roy said.",
    "Republican Rep. Jim Jordan of Ohio, the top Republican on the House Judiciary Committee, told Just the News last month that he would have Fauci investigated as the first order of business if the GOP wins control of the House.",
    "A bill proposed by the Senate’s Health, Education, Labor, and Pensions Committee would create a 12-member panel that would have 18 months to assess the nation’s response to the virus and its readiness.",
    "No, it’s not a new COVID-19 variant, a study saying masks don’t protect anyone from anything or nailed-down proof that the coronavirus escaped from a Chinese lab Fauci helped fund.",
    "As the hand-picked Capitol incursion committee of the House grinds away with its focus on former President Donald Trump, some say the pandemic should be a politics-free zone.",
    "“That is because they knew from the get-go [COVID-19] came from the lab, likely came from a lab, gain of function likely done, and our tax dollars were used,” Jordan said.",
    "He said he would begin a probe into “all the lies” and the “the misinformation, the disinformation” from Fauci and the Centers for Disease Control and Prevention.",
    "Those hearings, conducted when Republicans had control of Congress, focused on the 2012 attack on a U.S. compound in Libya in which four Americans were killed.",
    "“The exhaustion, the anger, the frustration that is shared across America cuts across political lines now, and that’s coming through Congress,” he said.",
    "“It’s Benghazi hearings all over again,” Fauci, the director of the National Institute of Allergy and Infectious Diseases, told The Washington Post.",
    "“It is just an overwhelming burden, asking for information that’s driven by conspiracy,” Fauci said.",
    "“But it will distract me from doing my job, the way it’s doing right now,” Fauci said.",
    "White House chief medical adviser Dr. Anthony Fauci sees a storm cloud on the horizon.",
    "“They’ll try to beat me up in public, and there’ll be nothing there,” Fauci said.",
    "He said Republicans already have become an annoyance and it would get worse.",
    "That proposal has yet to pass the full Senate or be considered by the House.",
    "There is no question some Republicans are itching to get a crack at him.",
    "“We need a 9/11-style commission just to figure this out,” he said.",
    "We are committed to truth and accuracy in all of our journalism.",
    "Republican Sen. Roger Marshall of Kansas supports the approach.",
    "“I think there’s plenty of blame to go around,” Marshall said.",
    "Republicans in the House are also on board.",
    "“I can go down the list after list.",
    "Read our editorial standards."
  ]
}