{
  "id": 1433,
  "mediaId": 2866,
  "date": "2022-02-18",
  "headline": "Are School Parents A Target With DOJ’s New Domestic Terror Office?",
  "image": "https://www.fixthisnation.com/wp-content/uploads/2022/02/download-25.png",
  "link": "https://www.fixthisnation.com/are-school-parents-a-target-with-dojs-new-domestic-terror-office/",
  "mediaOutlet": "fixthisnation.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fix This Nation Staff",
  "authorUrl": "https://www.fixthisnation.com/author/marley/",
  "termIds": [
    2119,
    2426,
    4905,
    3298,
    1126,
    1442,
    6269,
    6474,
    6678
  ],
  "sentences": [
    "“The creation of this domestic terrorism office appears to contravene advice from career Justice Department officials, and raises serious concerns about how the Biden administration will use the new office in light of the Justice Department’s misuse of existing counterterrorism resources to target concerned parents at school board meetings,” read a letter Thursday to the agency from Jordan and fellow committee Republicans Reps. Mike Johnson, of Louisiana, and Andy Biggs, of Arizona.",
    "Last fall, the National School Boards Association asked the Biden administration to conduct an an interagency investigation on threats of violence against school board members and said the threats “could be the equivalent to a form of domestic terrorism and hate crimes.”\nThe request was amid heated school board meeting that largely focused on how education officials were addressing parents’ concerns about how their children were being taught during the pandemic.",
    "The lawmakers suggested the creation of the new office, with the agency’s National Security Division, has spooked “longtime dedicated career lawyers” at the agency who believe it is “unnecessary and potentially harmful.”\n“The committee must fully assess the department’s creation of a new office that could be misused to target American citizens,” the letter also reads.",
    "… there was no justification for some of the language included in the letter.”\nThe letter sent Thursday also requests documents and communications related to the creation of the new department, in addition to an explanation about why the department is purportedly being created against the advice of DOJ career officials.",
    "Ohio Rep. Jim Jordan, the top Republican on the House Judiciary Committee, is requesting the Justice Department provide information about its new domestic terrorism office, considering the agency’s plans last year regarding parents at school board meetings.",
    "He later said the agency would not label parents as domestic terrorists, amid outrage over the NSBA letter and arguments that such issues should be address at the state and local level, which led to the group to say, “we regret and apologize for the letter.",
    "“The department’s documented misuse of existing counterterrorism resources to target American parents raised serious concerns that NSD could similarly misuse the new domestic terrorism office.”\nThe new office was created in January.",
    "Attorney General Merrick Garland in turn, in October 2021, issued a memorandum to agency employees about intervening in incidents of violence or intimidation against local school board officials.",
    "Original Article: https://justthenews.com/government/congress/house-gop-reps-voice-concern-about-new-domestic-terrorism-office-doj-wake"
  ]
}