{
  "id": 1468,
  "mediaId": 2752,
  "date": "2022-02-15",
  "headline": "Sen. Roger Marshall Hasn’t Examined Biden Or Anything But Pretty Sure He’s Senile Old Coot",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTMzNDYxNS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTcwMDQyMTg5M30.L-C_vsy5E5c-rqlvB9T-UK9LOB1W3yZ4fcCMPSygZDU/img.png?width=1200&coordinates=0%2C0%2C0%2C32&height=600",
  "link": "https://www.wonkette.com/gop-sen-roger-marshall-wants-to-see-joe-bidens-long-form-cognitive-health-certificate",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    0
  ],
  "sentences": [
    "I think that if you compare today’s films from some of the films even a year ago, you’ve seen a deterioration in his mental capacity\nWe are as qualified to diagnose Biden’s mental capacity as Roger Marshall, so we can confirm after a few minutes on YouTube that Biden seems just as cogent now as he did in 2020.",
    "Sunday, Senator Roger Marshall of Kansas previewed for Fox News anchor Maria Bartiromo some of the politically motivated sham investigations Republicans plan to unleash on their enemies if they regain the majority.",
    ": Nikki Haley Says Gross Old Politicians Should Take Cognitive Test To Prove They’re Not Stupid Or Something\nThere is currently no law mandating that presidents issue public health disclosures.",
    "MARSHALL: I think that may be something else that we’ll be looking on, that Rand Paul and I’ll be discussing, Jim Jordan again, seeing if we think that’s something that America deserves.",
    "Top of the list is Dr. Anthony Fauci, an 81-year-old public servant who aptly described Marshall as a “moron.”\nThen they moved to what Republicans assume is Biden’s obvious senility.",
    "Republicans are shady AF about revealing their vaccination status, so it’s rich that they think Biden should let his political opponents get all up in his cerebellum.",
    "A few months ago, Nikki Haley suggested that politicians of a certain age should submit to regular cognitive tests, which is both ageist and unconstitutional.",
    "It’s true that Marshall is a medical doctor, but as even a casual “Grey’s Anatomy” viewer could tell you, medicine is a broad field with many specialities.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Yes, these are people who’d willingly vote again for Donald Trump, who can’t even correctly name the winner of the last presidential election.",
    "Republicans and their buddies in state media have a clear game plan for 2024: Keep smearing Biden as mentally incompetent with zero evidence.",
    "Bartiromo claimed that Biden’s deteriorating mental condition, which she’s made up, is a national security issue and Marshall agreed.",
    "Democrats want to — at a minimum — protect voting rights, provide universal pre-K, and keep the planet from catching fire.",
    "They are truly comic-book villains\nYr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Republicans are very concerned — like an army of Susan Collinses — about President Joe Biden’s cognitive health.",
    "Marshall added that “maybe we need to be proactive” and demand that Biden submit to an annual mental test.",
    "What can you say — and it pains me to bring this up, by the way — but we are all watching President Biden.",
    "Is there anything you want to say, in terms of perhaps considering a test once a year on mental capacity?",
    "Meanwhile, Marshall’s buddy Trump is sending out unhinged, all-caps rants that he’s not allowed to tweet.",
    "We should note that Doc Marshall is not a neurologist and has never personally examined the president.",
    "But, hey, if Biden sometimes has trouble keeping names straight, that’s obviously a sign of dementia.",
    "\"Doc Marshall,” as his official Senate bio refers to him, was an obstetrician and a gynecologist.",
    "What can you tell us as a medical doctor about the mental capacity of our commander in chief?",
    "Joe Biden hasn’t been a baby for decades now and hasn’t given birth for even longer.",
    "That’s a far more disturbing disconnect from reality than Biden’s occasional gaffes.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "MARSHALL: I think we’re all concerned for President Biden’s mental health.",
    "BARTIROMO: We’re all watching [Biden], you know, shuffle, mince words.",
    "We all know Republicans wouldn’t accept the results if Biden passed.",
    "Republicans want to regain the power so they can bully old men.",
    "He's also on the board of the Portland Playhouse theatre.",
    "BARTIROMO: Before you go, you are a medical doctor.",
    "Yeah, this painful subject has her all choked up.",
    "His son describes him as a “play typer guy.\"",
    "Please click the clickie, if you are able.",
    "It’s the new Obama’s birth certificate.",
    "What do you see as a medical doctor?",
    "How often would you like to donate?",
    "He writes reviews for the A.V.",
    "Here’s the sickening video.",
    "That's you!",
    "REMEMBER?"
  ]
}