{
  "id": 1578,
  "mediaId": 2699,
  "date": "2022-02-11",
  "headline": "Wait, Now the Right Loves Traffic-Blocking Protesters?",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_675,w_1200,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1644542913/220210-lewis-rightwingtactics-hero_ggkhxy",
  "link": "https://www.thedailybeast.com/wait-now-the-right-loves-traffic-blocking-protesters?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Lewis",
  "authorUrl": "https://www.thedailybeast.com/author/matt-lewis",
  "termIds": [
    5674,
    2178,
    2119,
    3925,
    1441,
    6029
  ],
  "sentences": [
    "Having said that, she’s absolutely right to say that the truckers are being “smeared by the very people who claim to prioritize the working class.”\nFor decades, the Democratic Party was the party of organized labor and the “working man,” while the Republican Party was called the “party of business” or “the rich.” That image has flipped in a lot of ways in recent years, and this is both a blessing and a curse for the GOP.",
    "The Department of Homeland Security has “received reports of a convoy of truckers planning to potentially block roads in major metropolitan cities in the United States in protest of, among other things, vaccine mandates for truck drivers.” This could mean Washington, DC, and/or Los Angeles, California—which would sure cause some headaches for the sprawling city of freeways that’s hosting Sunday’s Super Bowl game.",
    "Granted, the Canada convoy represents a minority of the Canadian population (in a survey last month, less than 30 percent of Canadians thought there should be zero vaccination requirements, and an estimated 90 percent of Canadian truckers are vaccinated), but angry populism has a way of grabbing outsized political influence.",
    "“Such turf takeovers have traditionally been the province of the left, not the right,” wrote Politico’s Jack Shafer, who cited 1930s union organizers taking over factories, the civil rights and anti-war movements (“with the peaceniks famously occupying the office of Columbia University’s president”), and Occupy Wall Street.",
    "While conservatives generally fear anyone wielding pitchforks and brandishing lanterns, right-wing populism is different—which is why I think we have the rise of this sort of behavior on the Trumpian right today (I didn’t love the Tea Party movement, but at least it didn’t engage in mob violence or intimidation).",
    "If you’re following the current discourse about the Canadian truckers occupying Ottawa, the capital city, and blockading major international trade routes in protest of vaccine mandates—you might think the first quote came from an outraged liberal, while the second one from a sympathetic conservative.",
    "Take, for example, the 1970 “Hard Hat riot,” when mostly white construction workers violently stormed a peaceful anti-Vietnam War demonstration in Lower Manhattan, mere days after the National Guard killed four peaceful anti-war demonstrators on the campus of Kent State University.",
    "Slow the Spread!’ while truckers delivered their Amazon Prime packages.”\nUngar-Sargon credits the Freedom Convoy for “fulfilling Marx’s fantasy,” which only reaffirms this conservative’s visceral suspicions about this protest movement and its tactics.",
    "In other words, what we are seeing is, as Kevin Williamson wrote for National Review, the American Right’s “hippie phase.”\nI think I speak for a great many commuters when I say that if you try to shut down street traffic, you’ve lost my support.",
    "In fact, the first quote is from right-wing firebrand Ben Shapiro (referring to anti-Trump protesters in 2017), and the second quote is from democratic socialist Rep. Alexandria Ocasio-Cortez (talking about Black Lives Matter protests in 2020).",
    "Whether it’s a group of activists chasing Ted Cruz out of a DC restaurant, rioters at the U.S. Capitol, a cancel-culture mob trying to take down a comedian, or a convoy of trucks, if you’re not careful, a crowd can turn into a mob..",
    "But the Canadian truckers who call themselves the “Freedom Convoy” are the new darlings of the right, who seem to be relishing this moment of stalling traffic and owning the libs, even as they refuse to get the jab.",
    "It’s a sign of how the right is increasingly identifying with the working-class, even as the left alienates them by cozying up to highly educated technocratic elites and embracing “woke” progressive politics.",
    "Truckers, especially, should appreciate the danger (I’m thinking here about Reginald Denny, the truck driver who was dragged from his rig and beaten within an inch of his life during the 1992 LA riots).",
    "Today, the hard hats would be associated with the political right, but these were mostly socially conservative Democrats and old-school union guys (formerly called “union thugs” by conservatives).",
    "To observe yet another irony, I’m old enough to remember when Black Lives Matter shut down highways and the right responded with laws making it easier to run protesters over—and get away with it!",
    "There’s currently an injunction, bringing an end to the almost constant horn honking that was plaguing Ottawa, but just imagine if you were unlucky enough to live near this mess.",
    "As a conservative, I’ve always viscerally disliked disruptive protests—particularly the kind that metastasize into (or begin with) lawlessness.",
    "But if people on the right are now embracing these working-class protesters for sticking it to the man, people on the left are eschewing them.",
    "It is ironic, but not surprising, that this truckers’ protest is being championed by Republicans like Sen. Ted Cruz and Rep. Jim Jordan.",
    "Some of those construction workers were likely just there for the hippie-punching, but this was also about politics, class, and culture.",
    "“The workers of the world are literally uniting,” wrote Batya Ungar-Sargon, “And yet these truckers have not been embraced by the left.",
    "Instead they have been tagged as fascists and racists by progressive pundits, activists, and politicians—those who tweeted ‘Stay Home!",
    "When COVID-19 started, I dedicated an edition of my email newsletter specifically to truck drivers and other underappreciated workers.",
    "A few years ago, the left might have supported these working-class heroes who are (as AOC might say) just making others uncomfortable.",
    "Even if violence isn’t intended, blocking traffic could prevent or delay someone from getting to the hospital by paralyzing traffic.",
    "Never mind the economic and personal toll it takes on other people just trying to get to their jobs or shuttle their kids to school.",
    "Another problem anytime you get this many “protesters” together is a crowd psychology where people quit identifying as individuals.",
    "I have a deep, abiding respect for the hard-working folks who make sure there’s food on the shelves when I go to the grocery store.",
    "It’s one thing to import a bunch of blue-collar Democrats into your coalition, but do we have to adopt the left’s tactics, too?",
    "Occupations, sit-ins, and traffic blockades also have a way of scaring and inconveniencing totally innocent people.",
    "“To folks who complain protest demands make others uncomfortable… that’s the point,” said another famous person.",
    "But if you occupy someone’s office or hold a rally in front of their house, then brother, you can count me out.",
    "The ballot box is the best place to voice and adjudicate the vast majority of our political differences.",
    "But in my opinion, objecting to receiving a life-saving vaccination hardly qualifies as an example.)",
    "(There are, of course, certain cases where laws are so immoral that they demand civil disobedience.",
    "You have the right to peaceful protest, so long as you are respectful and adhere to law and order.",
    "“What are these protesters protesting other than their own incompetence?” asked the famous person.",
    "Indeed, the right actually has a rich history of provocative, and sometimes violent protests.",
    "It’s also a sign of how populism is an international brotherhood that respects no borders.",
    "If you want to obtain a permit and give speeches at the Lincoln Memorial, have at it.",
    "Personally, I’ll keep the tax cuts and Supreme Court Justices, thank you very much.",
    "And it has nothing to do with my position on vaccines (which may surprise you).",
    "And I wouldn't recommend trying to step in front of my car on I-95, either.",
    "So what about the rest of my fellow conservatives?",
    "But don’t expect to see me at your next sit-in.",
    "This is where it gets messy and confusing.",
    "But these protests rub me the wrong way.",
    "It isn’t just inconvenient, it’s scary.",
    "And it’s not going away any time soon."
  ]
}