{
  "id": 16033,
  "mediaId": 8354,
  "date": "2022-03-06",
  "headline": "Letters to the Editor",
  "image": "https://www.gannett-cdn.com/presto/2021/12/27/NTHR/a4a1424c-a860-4110-b1a0-600cd596db02-letters.jpg?crop=399,225,x0,y3&width=399&height=225&format=pjpg&auto=webp",
  "link": "https://www.lancastereaglegazette.com/story/opinion/2022/03/06/letters-editor/6882389001/",
  "mediaOutlet": "lancastereaglegazette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lancaster Eagle-Gazette",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Unbelievably, Karl Rove, the strategist who helped George W. Bush win the presidency twice, used his Wall Street Journal opinion column to rebuke “those Republicans who for a year have excused the actions of the rioters who stormed the Capitol, disrupted Congress as it received the Electoral College’s results and violently attempted to overturn the election.”\nWill local Fairfield County/Lancaster Republicans ever put America over party and write an Op-Ed denouncing the impeached President and the actions of his followers?",
    "So help me God.”\nRep. Jim Jordan is refusing a request to be interviewed by the House select committee investigating the Jan. 6, 2021, attack on the U.S. Capitol by a pro-Trump mob, calling it an “unprecedented and inappropriate demand.”\nJordan was asked to provide details about meetings with Trump and White House officials in the weeks and months leading up to Jan. 6 about “strategies for overturning the results of the 2020 election.”\nEven Mitch McConnell a year ago, rebuked Trump for his actions after the insurrection.",
    "There is no evidence that any voting system deleted or lost votes, changed votes, or was in any way compromised.”\nMitch McConnell: “The Electoral College has spoken.”\nKarl Rove: “This Election Result Won’t Be Overturned.”\nContinual media reports, fact-checkers, and current books like The Steal, Peril, or Betrayal have thoroughly debunked and ridiculed every possible claim that has been made by the Giuliani circus.",
    "“I, ___, do solemnly swear (or affirm) that I will support and defend the Constitution of the United States against all enemies, foreign and domestic; that I will bear true faith and allegiance to the same; that I take this obligation freely, without any mental reservation or purpose of evasion; and that I will well and faithfully discharge the duties of the office on which I am about to enter.",
    "But you are not entitled to your own facts.”\n“No one has the right to be wrong about their facts.”\n“Facts are stubborn things.”\nAllen Brand\nBremen\nWill Local Officeholders Denounce the “Big Lie?”\nFederal employees, Representatives, Senators, judges, political appointees, and the President and Vice President of the United States take an oath of office.",
    "William Barr, “We have not seen fraud on a scale that could have effected a different outcome of the election.”\nDHS Cybersecurity and Infrastructure Security Agency and the National Association of State Election Directors joint statement: “The November 3rd election was the most secure in American history.",
    "The Election Big Lie and the criminal sedition of trying to overthrow it are following “The Dictator’s Playbook.” That an entire political party thinks authoritarian violence is “discourse” makes a mockery of their vaunted claims favoring “Law and Order” and concern for the future of democracy.",
    "-OFFICIAL 2020 PRESIDENTIAL GENERAL ELECTION RESULTS\nThose conclusions were certified and adjudicated by scanned and hand counts, recounts, and audits, by every state’s election officials, 63 lost court rulings, and the Electoral College.",
    "The framers of the U. S. Constitution included the requirement to take an Oath of Office in the Constitution itself and shall be bound by Oath or Affirmation, to support this Constitution.",
    "The problem now is with a charismatic charlatan well versed in the speeches of Hitler and his 1925 quote, \"In the big lie there is always a certain force of credibility.\"",
    "So what is wrong when polls say 60-80% of Republican voters agree with Trump’s false claims that the election was stolen, rigged, fake, a fraud, a hoax?",
    "It appears that under the right circumstances, even sane, rational, well-adjusted people can be persuaded to believe the most outrageous ideas.",
    "But unbelievably, only two Republicans Liz and Dick Cheney, attended the memorial service regarding the Jan. 6th insurrection memorial.",
    "Stick with the facts of the presidential election\n84,167,249: total number of voters who said NO to Trump.",
    "How many levels of intellectual dishonesty and psychology must be unearthed to get an answer?",
    "He didn't take steps so federal law could be faithfully executed and order restored.\"",
    "Among the most obvious, no voting machines were connected to the internet.",
    "9,951,095: number of non-Trump voters greater than his voters.",
    "Public servants are just that — servants of the people.",
    "“You are entitled to your opinion.",
    "Bob Muckensturm\nLancaster",
    "\"He did not do his job.",
    "That would take…….",
    "PATRIOTISM!"
  ]
}