{
  "id": 1628,
  "mediaId": 4064,
  "date": "2022-02-11",
  "headline": "What Are the Details of the Trump Media and Rumble Partnership?",
  "image": "https://www.trunews.com/icons/favicon-32x32.png?v=veTyjUlsLLQzWxM",
  "link": "https://www.trunews.com/stream/what-are-the-details-of-the-trump-media-and-rumble-partnership",
  "mediaOutlet": "trunews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2119,
    2379,
    2767,
    2765,
    3790,
    4980,
    1156,
    6661,
    6678
  ],
  "sentences": [
    "According to a June 2021 article from Slate, “Pavlovski has recently become more outspoken in accusing Big Tech of censorship and now actively courts prominent conservatives and intellectual dark web figures to join Rumble.”\nOther channels on Rumble include America’s Funniest Home Videos, American broadcasting company E. W. Scripps Company, Hodgetwins, cable news channels Newsmax and One America News Network (OANN), and the international news organization Reuters.",
    "On December 14, 2021, Trump Media & Technology Group announced that it entered a \"wide-ranging technology and cloud services agreement” with Rumble in a statement which also stated that Rumble would operate part of the TRUTH Social network as well as TMTG+\nRumble is a Canadian online video platform headquartered in Toronto.",
    "Using data from February 2021, researchers studying conspiracy theories and misinformation about COVID-19 noted that several content creators have gained a receptive audience on Rumble after their productions have been pulled from YouTube or Facebook.",
    "Trump’s company also said the two firms are “in exclusive negotiations for Rumble to provide infrastructure and video delivery services for TMTG’s Subscription Video On-Demand product, TMTG+.”",
    "In August 2021, Rumble announced deals with former Democratic Representative Tulsi Gabbard and The Intercept founder Glenn Greenwald to start posting their videos to the site.",
    "Rumble’s monthly user count has experienced rapid growth since July 2020, from 1.6 million monthly users to 31.9 million by the end of the first quarter of 2021.",
    "For its first seven years, content on Rumble largely consisted of viral videos and news from mainstream media sources as well as videos of children and animals.",
    "In August 2020, however, Representative Devin Nunes accused YouTube of being overly censorious toward his channel and began posting his videos on Rumble.",
    "Former US President Donald Trump officially joined Rumble on June 26, 2021, in preparation for recording his Ohio campaign rally.",
    "TMTG said Rumble will “deliver video and streaming for TRUTH Social,” the company’s new social media network unveiled in October.",
    "Other prominent conservatives, such as Dinesh D’Souza, Sean Hannity, and Representative Jim Jordan, soon followed.",
    "Rumble has received investment from venture capitalists Peter Thiel and J. D. Vance.",
    "It was founded in 2013 by Chris Pavlovski, a technology entrepreneur from Canada.",
    "They include Del Bigtree, Sherri Tenpenny, and Simone Gold.",
    "The site is popular among American right-leaning users.",
    "A lot of Rumble’s traffic is referred from Parler.",
    "The round values Rumble at around $500 million."
  ]
}