{
  "id": 1743,
  "mediaId": 2522,
  "date": "2022-02-18",
  "headline": "Lou Dobbs says McCarthy is an ‘outright RINO’ who should not be speaker: ‘We need a Gaetz or Jordan’",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/02/LouDobbsSG-1200-x-628.jpg",
  "link": "https://www.bizpacreview.com/2022/02/18/lou-dobbs-says-mccarthy-is-an-outright-rino-who-should-not-be-speaker-we-need-a-gaetz-or-jordan-1202595/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Donaldson",
  "authorUrl": "https://www.bizpacreview.com/author/chris-donaldson/",
  "termIds": [
    0
  ],
  "sentences": [
    "–@LouDobbshttps://t.co/MPx4K3FhXd pic.twitter.com/g706KEWSbY\n— Rep. Matt Gaetz (@RepMattGaetz) February 17, 2022\nResponding to Gaetz’s question on his treacherous colleagues’ alliance with Democrats on the committee and their aiding Biden using the committee to wield an excessive amount of power, Dobbs conjured up a bit of history, “a little bit like Che Guevara and Soviet-era show trials, the fact of the matter is Kinzinger and Cheney should not even be in the Republican Party.”\n“I was personally disappointed that the Republican leadership didn’t have the guts to throw them out,” he added in a thinly veiled jab at McCarthy.",
    "“I think you should be in there as well,” Dobbs said.” I really believe that the brightest, hardest working conservative leaders we have in the House should be leading the House and I believe that most of the members would agree with me on that.”\nDobbs also had strong words for Republican renegades Liz Cheney and Adam Kinzinger, the two virulent anti-Trump lawmakers who have allowed Pelosi to use them as a figleaf to portray the Democrats’ dangerous un-American tribunal as a bipartisan affair.",
    "“It’s outrageous, he is too much of a, I’ll be kind, if not RINO, a middle-of-the-roader,” he said, “I personally believe him to be outright a RINO and the party needs strength, it needs vision, it needs energy, vibrancy and new blood in leadership, it’s that simple.”\nLou Dobbs says there is no way Kevin McCarthy should be Speaker if the GOP retakes the majority, and that only the “brightest” conservatives should be considered like Jim Jordan and Matt Gaetz.",
    "SIGN UP HERE\nThe clock is ticking down until Americans will have their first national opportunity to render a verdict on the disastrous Biden administration as well as the extremism of the Democratic Party and if, as predicted, the GOP retakes the House, Rep. Kevin McCarthy stands ready to pry the speaker’s gavel from the clutches of Nancy Pelosi if opposing voices don’t have a say in the matter.",
    "pic.twitter.com/yKuLLtkid0\n— Ron Filipkowski (@RonFilipkowski) February 17, 2022\nDobbs also said that he would be “excited” about speaker Jim Jordan, the fiery, no-nonsense congressman from Ohio who would bring the complete opposite demeanor to the job than McCarthy, who many believe is feckless and lacks the necessary fire to take on the vicious Democrats.",
    "Dobbs chatted with Gaetz on the latest edition of the Florida Republican’s “Firebrand” podcast where the two America First conservatives discussed topics including Pelosi’s sham 1/6 committee, President Joe Biden’s stunning abuses of power, the national debt and the direction of GOP leadership if Democrats are held accountable by voters in November.",
    "One of those vehemently against the squishy California Republican’s ascendance to the powerful position is Lou Dobbs and the legendary commentator shared his views about the future of the GOP during a wide-ranging interview with Rep. Matt Gaetz.",
    "“He has great power in the Senate, he apparently wants to extend it to the House of Representatives as well and to the broader party beyond.”\n“It was a silly, inane, and unempirical remark…He’s out of place as he usually is.",
    "WATCH: https://t.co/MPx4K3FhXd pic.twitter.com/RfHuwYDM6h\n— Rep. Matt Gaetz (@RepMattGaetz) February 17, 2022\n“I think what that was was a cry for absolute autonomy on the part of Mitch McConnell,” he said.",
    "Dobbs also didn’t spare Senate Minority Leader Mitch McConnell who spoke out against the RNC’s recent censure of Cheney and Kinzinger, taking the Kentucky senator to the woodshed.",
    "Speaking of the current House Minority Leader and the idea that he could assume the speakership, Dobbs gave McCarthy a resounding thumbs down.",
    "I personally was disappointed that the Republican Leadership didn't have the guts to throw them out.\"",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "He also said that Gaetz would be a good choice, much to the delight of the beaming host.",
    "\"It was a silly, inane, and unempirical remark…He's out of place as he usually is.",
    "\"Kinzinger and Cheney should not even be in the Republican Party.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "It’s a shame that he is in that position,” Dobbs said.",
    "The public will not see it and we do not share it.",
    "He’s on the side of RINOs as he always is.",
    "He's on the side of RINOs as he always is.",
    "It's a shame that he is in that position.\"",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!"
  ]
}