{
  "id": 1905,
  "mediaId": 2664,
  "date": "2022-02-06",
  "headline": "'A lot of explaining to do': Jim Jordan slammed for contradictory remarks about 1/6 call to Trump",
  "image": "https://www.rawstory.com/media-library/unimaginable-that-gop-lawmaker-jim-jordan-didn-t-know-about-sexual-assaults-at-ohio-state-cnn-legal-analyst.jpg?id=24809289&width=1200&coordinates=0%2C16%2C0%2C16&height=600",
  "link": "https://www.rawstory.com/jim-jordan-donald-trump-2656574906/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Meaghan Ellis",
  "authorUrl": "https://www.rawstory.com/u/meaghan_ellis_alternet",
  "termIds": [
    2119,
    1766,
    3317,
    3448,
    2765,
    5464,
    1126,
    300
  ],
  "sentences": [
    "Why has Jim Jordan wanted to pretend that pre-attack call didn't happen?https://www.cnn.com/2022/02/04/politics/jim-jordan-trump-january-6/index.html\\u00a0\\u2026\n— Bill Kristol (@Bill Kristol) 1644001901\nSpeaking to CNN, former U.S. Attorney and Deputy Assistant Attorney General Harry Litman also echoed McGovern's concerns as he agreed that the damning phone call may be \"a big piece of evidence.\"",
    "It\\u2019s past time for you to go before the @January6thCmte and speak honestly about what happened that awful day.https://twitter.com/cnn/status/1489677542843985923\\u00a0\\u2026\n— Rep. Jim McGovern (@Rep. Jim McGovern) 1644009557\nRep. Ilhan Omar (D-Minn.) also tweeted concerns about the conversation that took place between Trump and Jordan that day.",
    "Rep. Jim Jordan of Ohio speaking at the 2018 Conservative Political Action Conference in National Harbor, Maryland, Gage Skidmore\nRep. Jim Jordan's (R-Ohio) call to former President Donald Trump during the insurrection on the U.S. Capitol is facing scrutiny as a new report suggests he may be hiding important information.",
    "Why would anyone expect Rep. Jordan to recall that \\u2014 or care about what was said?https://www.cnn.com/2022/02/04/politics/jim-jordan-trump-january-6/index.html\\u00a0\\u2026\n— Laurence Tribe (@Laurence Tribe) 1644002946\nHe's also made similar remarks in the past.",
    "\\n\\nJim Jordan has a lot of explaining to do.https://twitter.com/taylorpopielarz/status/1420438437379837955\\u00a0\\u2026\n— Ilhan Omar (@Ilhan Omar) 1644010874\nOthers also echoed the concerns about Jordan's remarks.",
    "Referencing a CNN report, McGovern noted that it is a direct contradiction to what Jordan previously said as he suggested that he may be hiding key information that could advance the investigation.",
    "Jordan has faced bipartisan criticism for his ongoing support of the former embattled president and the incriminating text message he sent to former White House Chief of Staff Mark Meadows.",
    "It's past time for you to go before the [January 6 Committee] and speak honestly about what happened that awful day,\" McGovern tweeted on Friday afternoon.\"",
    "Amid scrutiny, Jordan claimed he couldn't remember the exact time he spoke with Trump on January 6, 2021, although investigative records suggest otherwise.",
    "During a House Rules Committee meeting back in October, McGovern had also asked Jordan and his colleagues about conversations with Trump.",
    "\"No one forgets talking to the President of the United States for 10 mins, unless they have a reason to,\" Omar tweeted.",
    "Back in July, Jordan conducted an interview with Spectrum News, where he denied remembering when he'd spoken to Trump.",
    "\"Jordan has tended to say or imply that he only spoke with Trump on Jan. 6 after the attack on the Capitol.",
    "Jordan has tended to say or imply that he only spoke with Trump on Jan. 6 after the attack on the Capitol.",
    "As you say that really matters because it is in advance of the whole riot and rally that Trump undertook.\"",
    "No one forgets talking to the President of the United States for 10mins, unless they have a reason to.",
    "\"I talked to the president a number of times that day, but I don't remember the times,\" he said.",
    "Bill Kristol, a conservative writer and political commentator, raised questions about the call.",
    "\"[Jim Jordan], this report directly contradicts what you said before the Rules Committee.",
    "@Jim_Jordan, this report directly contradicts what you said before the Rules Committee.",
    "\"Because he's been all over the lot and very squirrelly about it with one exception.",
    "Just a casual 10-minute chat with the president on the morning of the insurrection.",
    "The latest criticism of Jordan came shortly after his appearance on CNN Friday.",
    "\"Why has Jim Jordan wanted to pretend that pre-attack call didn't happen?\"",
    "It turns out they spoke for ten minutes that morning,\" Kristol tweeted.",
    "took to Twitter with a message directed toward the Republican lawmaker.",
    "He said categorically, 'I never talked to him in the morning.'",
    "\"It's significant,\" Litman said on Saturday, February 5.",
    "\"I don't know if I spoke with him in the morning or not.",
    "But what I know is that I spoke with him all the time.\"",
    "I mean I don't know when those conversations happened.",
    "On multiple occasions, Jordan has made similar claims.",
    "It turns out they spoke for ten minutes that morning.",
    "\"Uh, I'd have to go—I spoke with him that day after.",
    "On Friday, February 4, Rep. Jim McGovern (D-Mass.)",
    "\"Jim Jordan has a lot of explaining to do.\"",
    "He denied the allegations then, also.",
    "What are you trying to hide?",
    "What are you trying to hide?",
    "So this puts the lie to it.",
    "I'd have to go back.",
    "I just don't know.",
    "I think after?\"",
    "he said.",
    "."
  ]
}