{
  "id": 1952,
  "mediaId": 2590,
  "date": "2022-02-07",
  "headline": "Ted Cruz Throws In With Anti-Vaccine Ottawa Trucker Mob As City Declares Emergency",
  "image": "https://img.huffingtonpost.com/asset/6200ab6b250000a7262b14f7.jpeg?cache=iZHgHalBYf&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/ted-cruz-ottawa-vaccine-truckers-protest_n_6200985be4b0725faacbd834",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Papenfuss",
  "authorUrl": "",
  "termIds": [
    2574,
    1847,
    3925,
    5239,
    5101,
    6492,
    6029,
    6689
  ],
  "sentences": [
    "Too busy high-fiving all the awesome folks in #Vancouver that are helping push back against the #hateconvoy.#vanpoli #covid19 https://t.co/kA7jInwODF\n— Kennedy Stewart (@kennedystewart) February 6, 2022\nThe truckers in what they call the “Freedom Convoy” have been protesting for 10 days in Ottawa against the requirement that they be vaccinated before they can drive across the border into the U.S.\nAdvertisement\nCity officials, fearing violence from the rowdy protesters, on Sunday declared a state of emergency.",
    "University of Ottawa associate criminology professor Michael Kempa said in a CBC-TV interview Sunday that the movement is fundamentally organized and funded by those with an autocratic political agenda, including American interests, and aimed at undermining Canadian rule of law and democracy.",
    "Advertisement\nPaxton boasted that “patriotic” Texans donated to the “Canadian Truckers’ worthy cause.”\nThe Canadian Trucking Alliance, the main advocacy organization for the nation’s truckers, and the Ontario Trucking Association have disavowed the protest, the Ottawa Citizen reported.",
    "Rep. Jim Jordan (R-Ohio) also complained about GoFundMe’s action on Twitter, and Elon Musk gushed: “Canadian truckers rule.”\nDonald Trump Jr. called via a tweet on Friday for all Republican attorneys general in the U.S. to investigate.",
    "After police expressed concerns, GoFundMe on Friday shut down an online fundraising campaign and blocked close to $10 million money raised for the convoy because of “unlawful” activities, it said in a statement.",
    "“They’re people interested in undoing the conventional state system, and replacing the Canadian democratic model with something that is much more grassroots authoritarian and far-right conservative,” Kempa said.",
    "Sen. Ted Cruz (R-Texas) became the latest hard-right politician to back a mob of anti-vaccine Canadian truckers occupying downtown Ottawa, which has declared a state of emergency over the strong-arm protest.",
    "The truckers convoy was hit Friday with a $9.8 million class-action complaint on behalf of Ottawa citizens for relentlessly blasting their air horns for up to 16 hours a day while jamming streets.",
    "“We now have evidence from law enforcement that the previously peaceful demonstration has become an occupation, with police reports of violence and other unlawful activity,” the statement added.",
    "#Ottawa pic.twitter.com/oIhVKCYjur\n— Paul Champ (@PaulChampLaw) February 5, 2022\nWe are closing early tonight (Friday) at 6:30pm and staying closed over the weekend until Wednesday Feb 9th??.",
    "Attorneys general Jeff Landry of Louisiana, Patrick Morrisey of West Virginia and Ken Paxton of Texas all indicated they’re launching investigations into GoFundMe on behalf of the truckers.",
    "They’re not interested in the ... liberal system we have here in Canada.”\nKempa said Canadians were taken aback by the truckers behavior and suggested the military should reestablish order.",
    "Canada will not be fooled: I challenge you to present your ideas through democratic channels #cdnpoli #onpoli https://t.co/dxF8DjCU2J\n— Michael Kempa (@MichaelKempa1) February 6, 2022",
    "Though GoFundMe initially said it would refund the money or redirect it to charities, it announced hours before DeSantis’ tweet that it would automatically be refunding all donations.",
    "The government doesn’t have the right to force you to comply to their arbitrary mandates.”\nCruz on Saturday clashed with Vancouver’s mayor, who told the rogue truckers to stay away.",
    "— Moo Shu Ice Cream (@MooShuIceCream) February 4, 2022\nOttawa’s premier complained that the protest morphed days ago into an “unacceptable occupation.”\n“This is a siege.",
    "Ron DeSantis on Saturday announced on Twitter he was launching an investigation and accused GoFundMe of “fraud” for “commandeering” the money raised for the truckers.",
    "“We’re in the midst of a serious emergency, the most serious emergency our city has ever faced,” the mayor of Ottawa, Jim Watson, said in an interview.",
    "One of our staff was physically assaulted on their way to work today, blocked on the sidewalk by two men and shoved to the ground for wearing a mask.",
    "The organizers of #OttawaOccupation hide their agenda for destructive politics behind honourable #truckers +vaccine mandate misdirection.",
    "The decision to withhold funding for these unlawful demonstrations is an important step and we call on all crowdfunding sites to follow.",
    "But Mayor Kennedy Stewart fired back that 90% of Canada’s truck drivers are vaccinated and no one’s worried about the absent protesters.",
    "“Someone is going to get killed or seriously injured because of the irresponsible behavior of some of these people,” he mayor warned.",
    "They have also been accused of harassing area residents and shoppers, even assaulting some, and ripping masks off residents’ faces.",
    "It is something that is different in our democracy than I’ve ever experienced in my life,” Ottawa police Chief Peter Sloly said.",
    "Cruz suggested in a tweet that the city might learn a lesson with hunger as market shelves emptied without the drivers.",
    "Can someone tell @tedcruz our store shelves are fine thanks to the 90% of Canadian truckers who are fully vaccinated.",
    "What if you lived here, and this was going on from early in the morning until late at night, how would you feel?",
    "The Trucking Alliance said the vast majority of its members are fully vaccinated and are continuing to work.",
    "Similar protests are beginning to spread to Toronto, Winnipeg, Quebec City and other provincial capitals.",
    "We want to thank @gofundme for listening to our concerns as a City and a police service.",
    "Advertisement\n“They’re defending Canada, America, and they’re standing up for freedom!",
    "“Generally, they are outside, and intent on dismantling, the political mainstream.",
    "“God bless these Canadian truck drivers,” Cruz crowed in a tweet Sunday.",
    "— Ottawa Police (@OttawaPolice) February 5, 2022\nFlorida Republican Gov.",
    "He insisted the money should be refunded.",
    "Advertisement\nIs this a peaceful protest?"
  ]
}