{
  "id": 1956,
  "mediaId": 2664,
  "date": "2022-02-10",
  "headline": "Documents handed to the Jan. 6 committee don't contain details about who was calling in and out of the White House: report",
  "image": "https://www.rawstory.com/media-library/documents-handed-to-jan-6-committee-don-t-contain-details-about-who-was-calling-in-and-out-of-wh.jpg?id=29309173&width=1200&coordinates=0%2C4%2C0%2C76&height=600",
  "link": "https://www.rawstory.com/trump-phone-call-records-missing/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    2119,
    2570,
    2765,
    3545,
    849
  ],
  "sentences": [
    "\"The panel is still awaiting on additional material from the National Archives and Records Administration, which keeps the official White House logs, and from telecommunications companies that have been subpoenaed for the personal cellphone records of Mr. Trump’s inner circle, like his son, Eric, and Kimberly Guilfoyle, the fiancée of Mr. Trump’s son Donald Trump Jr,\" said the Times.",
    "The New York Times reported Thursday that it's causing confusion and frustration among the committee members because it seems unrealistic that there were no calls, particularly given so many Republicans confessed publicly that they were attempting to reach Trump officials on Jan. 6.",
    "Two people familiar with the phone records told the Times that there are call logs that were obtained showing who was calling the White House switchboard and any calls from the White House.",
    "But Trump used his personal cell phone or cell phone of other people to dodge those systems, making it difficult to see what was happening behind the scenes of the White House.",
    "One key element not included, however, is information about those calling the White House on Jan. 6 and who former President Donald Trump was calling.",
    "The House Select Committee investigating Jan. 6 has obtained a considerable amount of documents from witnesses and the National Archives.",
    "There are records from the witnesses showing text messages and calls from their phones, just not from the other side.",
    "Jordan previously said he wasn't sure whether he spoke to Trump on Jan. 6 because they talk so frequently.",
    "Documents handed to Jan. 6 committee don't contain details about who was calling in and out of WH",
    "There are records showing the hours just after Trump returned from his speech at the Ellipse.",
    "Rep. Jim Jordan (R-OH), for example, finally answered that he spoke to Trump on Jan. 6.",
    "It's once the attacks began to get more violent that the records appear to disappear.",
    "Bodyguard Keith Schiller, for example, would let Trump use his phone.",
    "It turns out the call unfolded over the course of ten minutes.",
    "Watch."
  ]
}