{
  "id": 2130,
  "mediaId": 2547,
  "date": "2022-02-10",
  "headline": "Morning Joe: Dems Should Take Page From Jim Jordan Playbook",
  "image": "https://crooksandliars.com/files/mediaposters/2022/02/49520.jpg",
  "link": "https://crooksandliars.com/2022/02/morning-joe-dems-should-take-page-jim",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susie Madrak",
  "authorUrl": "https://crooksandliars.com/team/susie-madrak",
  "termIds": [
    2312,
    2119,
    2765,
    3392,
    3054,
    139,
    1078,
    1126
  ],
  "sentences": [
    "How wonderful to have prime time hearings that actually have people talking about Donald Trump taking records, official White House records, shredding them up, shoving them down the toilet, staff members coming in to testify and showing clips of Jim Jordan, showing clips of everybody else on that committee talking about how sacred these official documents are and how horrible it was that Hillary Clinton, you know, did what we've found out it seems like so many people in the Trump administration did with their e-mail accounts.",
    "'Given the bombshell revelations, coupled with their concern with federal government record-keeping compliance, you would think Republicans would be foaming at the mouth, chanting, \"lock him up\" and calling for an immediate series of hearings and subpoenas to be issued to anyone who was part of the Trump white house, and yet nothing.",
    "Now they have nothing to say about the flagrant and blatant and warped, flushing documents down the toilet, aides having to piece things back together, you know, the Archives having to go to Mar-A-Lago to retrieve 15 boxes, some of which contained classified information.",
    "Right now he is the ranking Republican in the House Judiciary committee, he was calling for DoJ investigations, he was calling for FBI investigations, all because they were so concerned about transparency, accountability, keeping up with the Federal Records Act.",
    "\"The very Republicans who led the charge for investigations into Clinton's e-mails don't have a thing to say about what Trump and other senior administration officials did in apparent violation of the Presidential Records Act.",
    "\"And then again, the destruction of these documents and have the staff members running behind saying, yeah, we always had to run in and grab the documents out of the trash can and piece them together, the ones we could.",
    "There were at one point in time six different committees investigating this things, they had 33 hearings about Clinton's e-mails,\" Bardella said.",
    "Certainly if you follow the Republicans' game plan that you know so much about and that you talk about so much, and here is the thing.",
    "for anybody who thinks we have the January 6th committee and we should leave it again, again, you can do more than January 6th.",
    "I mean, again, I remember during the run-up of Benghazi -- again, this is something that went from 2011 all the way to 2016.",
    "So, Kurt, I mean the infraction is so obviously compared to Hilary's e-mails, this is so much worse, and they are silent.",
    "It is worth noting that at one point in time, Republicans in Congress had half a dozen committees investigating Clinton.",
    "There is a need for oversight and accountability, but it would take the Republicans actually not being hypocrites.\"",
    "\"Kurt, in your latest piece for USAToday, it is entitled 'But Hillary's E-Mail\" and you write in part this.",
    "The last hearings on Benghazi was in October of 2016, a month before the presidential election.",
    "\"Kurt, another committee should get to the bottom of this and go all in,\" Scarborough said.",
    "\"There can be two, three, four, five, six committee investigations going at the same time.",
    "Morning Joe was discussing the story that Trump was flushing documents down the toilet.",
    "Joe Scarborough talked to Kurt Bardella about public hearings.",
    "This is about complying with the Federal Records Act.\"",
    "The ones that Donald wasn't flushing down the toilet.\"",
    "Now the Republicans have nothing to say.",
    "Yes, they are being hypocrites.",
    "Silence,\" Scarborough said.",
    "\"Jim Jordan was out there.",
    "Crickets.",
    "Topics:",
    "\"Yeah."
  ]
}