{
  "id": 2168,
  "mediaId": 2724,
  "date": "2022-02-10",
  "headline": "New York Times: Election, Not Science, Driving Democrat Mandate Reversals",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/02/2022.02.10-06.07-thepoliticalinsider-62055446e4199.jpg",
  "link": "https://thepoliticalinsider.com/new-york-times-election-not-science-driving-democrat-mandate-reversals/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Becky Noble",
  "authorUrl": "https://thepoliticalinsider.com/author/beckynoble/",
  "termIds": [
    3540,
    3679,
    1679,
    1339,
    171,
    392,
    6486,
    6433
  ],
  "sentences": [
    "Let’s be clear: the data on masking and vaccines didn’t change, the polling for Democrats did.https://t.co/77x66MqR9X\n— Congresswoman Debbie Lesko (@RepDLesko) February 9, 2022\nRELATED: DHS Sends Memo Warning Police About US Trucker Protest Hours After Issuing Terrorism Threat Focused On ‘Misinformation’\nDemocrats Not Fooling Anyone\nMake no mistake, Democrats will tell you “the science has changed,” but what has really changed are the Democrats’ problems.",
    "@RepJeffries credits Biden for states dropping mask mandates: “That’s because under President Biden’s leadership, a public health infrastructure was put into place … to ensure that we can do everything possible to crush the virus, and that is what has been happening” pic.twitter.com/FDjJrjA7aB\nAnd the talking points have already gone out among the party:\nDemocrats' plan to fight COVID is working – cases are down & vaccines are widely available.",
    "And while their pronouncements will be dripping with mentions of “the science changing,” the New York Times of all places revealed what is behind the stunning 180:\nDriving these decisions are the growing numbers of voters signaling that they are prepared to live with the virus as it is now, and political calculations about looming midterm elections that already have Democrats on the defensive.",
    "CBS News reports that a recent Monmouth University poll showed that 70% of Americans said that the time has come to “accept that COVID is here to stay and we just need to get on with our lives.” This included 89% of Republicans, 71% of Independents, and 47% of Democrats.",
    "Officials in those states claim the decision to ease restrictions has come as the result of “months of public planning and focus groups.”\nCuriously, it was those focus groups that began immediately following New Jersey Gov.",
    "As those sinking poll numbers come in, and inflation and crime spikes continue, Democrats are seeing yet another “never let a crisis go to waste” moment and will actively attempt to take credit for “ending” the pandemic.",
    "Jeffries has fired the initial salvo – you can be certain that the next few months will be filled with claims that restrictions can be lifted because of the wonderful, dauntless leadership of Joe Biden.",
    "\"After a scare in November, New Jersey’s governor and other Democratic leaders held back-channel talks over lifting mandates and helping voters impatient with restrictions reclaim a sense of normalcy.\"",
    "The Dominos Began To Fall\nStates from Connecticut and Delaware, to Oregon and California announced they would be lifting COVID restrictions immediately or in the near future.",
    "Ron DeSantis recently gave a very clear explanation of the reason behind the Democrats sudden change of heart on draconian COVID restrictions, “The science didn’t change.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "Nothing elsehttps://t.co/VbvaiODX5T\n— The Cocaine Bear (@KyCocaineBear) February 9, 2022\nThe ‘Science’ Of Blue States\nIn New York, Gov.",
    "Democrats are lifting mask mandates and lockdown restrictions ONLY because they are worried about the midterm elections.",
    "It’s that huge majority of Independents that should be ringing alarm bells in every campaign office across the country.",
    "Kathy Hocul announced that the state would drop its indoor mask mandate, one of the nation’s strictest, on Wednesday.",
    "Rumors of an American trucker freedom convoy organizing and getting underway by Super Bowl Sunday, for starters.",
    "The Canadian trucker convoy has created serious political issues for Canadian Prime Minister Justin Trudeau.",
    "Democrats in blue states are beginning to see the writing on the wall as it relates to COVID restrictions.",
    "Sign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "In the midterm election year of 2022, COVID restrictions seem to be about cold hard political facts.",
    "New York is following a number of other Democrat-led states Like Oregon, New Jersey, and California.",
    "Political reality is setting in, and dominos are beginning to fall in one state after another.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "Look no further than the presumptive successor to Nancy Pelosi, New York Rep. Hakeem Jeffries.",
    "The political science changed.”\nGlenn Youngkin campaigned on ending mask mandates and won.",
    "They didn’t realize how many New Jersey residents just wanted to return to normal life.",
    "The Murphy campaign thought the election would be a cakewalk, until it wasn’t.",
    "And it is pretty safe to say they are realizing the message needs to change.",
    "And now suddenly, Democrat politicians are dropping their mask mandates too.",
    "With science as our guide, we're ready to start getting back to normal.",
    "Members of his own party have turned on him, one has even resigned.",
    "https://t.co/ws1VCIIEy2\nMore problems are on the horizon, too.",
    "Democrats face what could be an ugly election night this fall.",
    "Phil Murphy narrowest of re-elections last fall.",
    "— Rep. Jim Jordan (@Jim_Jordan) February 9, 2022",
    "Now, it's time to give people their lives back.",
    "It's always been about politics, folks.",
    "The medical science didn’t change.",
    "Florida Gov.",
    "Yes, really.",
    "Watch:\n.",
    "Science!"
  ]
}