{
  "id": 2279,
  "mediaId": 2531,
  "date": "2022-02-08",
  "headline": "Arrogance Does a Faceplant: Or 'There is a God in Heaven'",
  "image": "https://canadafreepress.com/images/uploads/merrick020522.jpg",
  "link": "https://canadafreepress.com/article/arrogance-does-a-faceplant-or-there-is-a-god-in-heaven",
  "mediaOutlet": "canadafreepress.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bio and Archives",
  "authorUrl": "https://canadafreepress.com/members/1/DaveMerrick/941",
  "termIds": [
    0
  ],
  "sentences": [
    "But because twenty-first century America is finally waking up to the fact that there is no other continent waiting for us to sail off to, tyrannical kings like Mark Zuckerberg are feeling the pre-war sabre of people who are finally expressing themselves clearly enough for him to hear.",
    "But Facebook has, in the last few years—especially since it became vogue to crucify Donald Trump and anyone even remotely associated with him—regularly taken it upon itself the freedom to construct, fiat, its own community from which to establish their nebulous community standards.",
    "This $232 billion dollar swan dive, let's call it the American echo of the 'Canadian Trucker Effect'\n|||\nI just learned the other day from Gab News that Facebook has been banning groups related to the Canadian peaceful Trucker Convoy.",
    "So while Joe Biden, a/k/a ‘Brandon’, has shown us the textbook definition of demonized leadership, a comparatively silent, watching world, like a pack of bloodthirsty wolves, has been smelling our unprecedented vulnerability.",
    "It is being done right under our noses, in that the liars who report the news to you at the end of the day are the same liars who will tell you how you should think and feel about that news in the evening’s programming.",
    "Fact checkers are in place solely to make sure that the opinions and visible information stay in line with the opinions and information that King Zuckerberg’s make-believe community wants to promote.",
    "It started when the new breed of soft-spined Americans sleepily caved to the bullying of the emerging new ruling class\nBut now many Americans, especially free Americans, have voted with their feet.",
    "Fake news, liberal entertainment, leftist politicians, iron fisted social networks, all comprise the new Hitler class\nSo many dumb people have been trying to compare Donald Trump to Adolph Hitler.",
    "Known primarily for his astoundingly lifelike portraiture, Merrick’s drawings and paintings grace the walls of an impressive array of well-known corporate and private clientele.",
    "That information was coupled with an observation that Facebook had not blocked any posts from BLM which had encouraged burning down American cities and defunding police, etc.",
    "Within the last quarter over a million Americans have up and left Facebook, and I say it is probably because many of them were told what they could or couldn’t say or read.",
    "Dave Merrick -- Bio and Archives\nDave Merrick, Davemerrick.us is an internationally known and published artist whose works reach into the greatest diversity of audiences.",
    "I mean, they might again try to replicate the debacle of mail-in voting, but the nation returning to its feet will not soon suffer another mail order president.",
    "But it is for all different reasons and will only sadden just a handful of people: probably just those involved in counting their paper profits.",
    "In the coming midterm elections the party of our nation’s shockingly accelerating collapse will feel the agony of losing their day jobs.",
    "Today ‘Hitler’ is composed of a group of puppets who move obediently in response to the father of lies himself, satan the devil.",
    "His form of government is obviously established upon the fact that he owns all the switches and levers with which to rule.",
    "Posting my uncensored opinion and the opinions of several experts who differed in opinion from Facebook’s fact checkers.",
    "Our politicians, save for a few like Jim Jordan and Ted Cruz, treat Zuckerberg as the premier of his own voting empire.",
    "It started when the new breed of soft-spined Americans sleepily caved to the bullying of the emerging new ruling class.",
    "His wildlife and Southwestern-theme work is distributed internationally through Joan Cawley Galleries of Scottsdale AZ.",
    "Fake news, liberal entertainment, leftist politicians, iron fisted social networks, all comprise the new Hitler class.",
    "The authors of our nation’s First Amendment have been spinning in their graves at a white-hot 50,000 RPM.",
    "This $232 billion dollar swan dive, let’s call it the American echo of the ‘Canadian Trucker Effect’.",
    "And they are every bit the antisemitic, racist, tyrannical liars and despots that Hitler ever was.",
    "Many of his published wildlife pieces have become some of America’s most popular animal imagery.",
    "It is the sho ‘nuff new record holder for the entire history of the United States stock market.",
    "Mark Zuckerberg started powering up on that practice simply because he believed he could.",
    "But the new, improved Fourth Reich is not a personality cult as was Hitler’s Third Reich.",
    "Previous to that I was notified by Facebook that I was in ‘Facebook Jail’ for 90 days.",
    "He has more original work in the Pro-Rodeo Hall of Fame than any other artist.",
    "Two hundred and thirty two billion dollars in value in a single market drop.",
    "He has always been treated like a KING when he visits our House and Senate.",
    "This news must surely have reached the desk of Mark Zuckerberg by now.",
    "Today we have a Hitler ‘class’ upon which the new Reich is centering.",
    "And in 2024 Brandon and Company will experience their own faceplants.",
    "This even beats out what happened in the Great Depression in 1929.",
    "And so they naturally walk lightly around him.",
    "Interesting choice of ‘community standards’.",
    "My crime?"
  ]
}