{
  "id": 2293,
  "mediaId": 2540,
  "date": "2022-02-07",
  "headline": "5 things to know for Feb. 7: Covid, Capitol riot, Electoral count, Jubilee, Joe Rogan",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220207043705-canada-protest-police-02052022-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/07/us/five-things-february-7-trnd/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexandra Meeks",
  "authorUrl": "",
  "termIds": [
    4979,
    4260,
    3517,
    3610,
    300,
    6672,
    6364
  ],
  "sentences": [
    "Russia also announced it will stage a referendum asking people to approve the “independence” of a new entity called “the Kherson People’s Republic.” Ukrainian President Volodymyr Zelensky called the move a “sham referendum,” saying civilians have already shown “their attitude toward the occupiers” by protesting in occupied towns.",
    "The key is making sure key Democrats feel like their issues are represented, like Sen. Tom Carper, who has concerns over lack of funding for water projects, while appeasing as many Republicans as possible – who are generally grumbling over the cost.",
    "– JewBelong, a non-profit organization created to welcome and inspire Jewish people, put up four billboards with striking messages throughout South Florida last week to raise awareness about anti-Semitism and make people think about its effects.",
    "The US Attorney’s Office of Massachusetts has filed a request to have that stimulus payment and other funds in Tsarnaev’s inmate trust account turned over to his victims while he serves a life sentence in Colorado.",
    "The bipartisan effort is one part of a two-track strategy to advance the White House’s sweeping economic agenda, as Democrats lay the groundwork to advance a $3.5 trillion package expanding the social safety net.",
    "Ukraine\nRussian troops are escalating their offensive in the south and east of Ukraine but are facing stiff resistance as they target the country’s central and western regions, Ukrainian officials said yesterday.",
    "After an exhaustive search, the Nevada Gaming Control Board identified the winner by combing through hours of surveillance videos, interviewing witnesses and analyzing ride share data.",
    "Biden thoroughly denounced participants in the riot and made the rare move of denouncing former President Donald Trump as a threat to democracy – without naming him outright.",
    "Meanwhile, as the war enters its third month, Zelensky said Russia has fired more than 1,100 missiles at Ukrainian targets, in addition to “countless bombs and artillery.”\n2.",
    "Four people were killed and hundreds of others were injured after Tsarnaev and his brother set off two bombs near the Boston Marathon finish line in 2013.",
    "Why it feels like movies are getting longer\nAt least warm popcorn can help distract you from the pain of sitting in theater seats for nearly 3 hours.",
    "Immigration\nA group of senators held a flurry of meetings over the weekend in hopes of getting a viable bipartisan infrastructure bill done today.",
    "CNN —\nIf your day doesn’t start until you’re up to speed on the latest headlines, then let us introduce you to your new favorite morning fix.",
    "Bengals’ viral sensation ‘The Cart’ is heading to the Super Bowl\nBengals fans have a quirky affection for this three-tiered metal cart.",
    "That’s how much a tourist in Las Vegas won at a slot machine last month, but was never informed due to a malfunction in the machine.",
    "Nominees announced for SAG Awards\nThat’s the amount Boston Marathon bomber Dzhokhar Tsarnaev received in a federal stimulus payment.",
    "Billie Eilish paused her concert to help a fan get an inhaler\nCheck out how the popular singer handled the situation so gracefully.",
    "TODAY’S WEATHER\nAND FINALLY\nYou’ve made it to the finish line of the week, which is not unlike this thrilling little corgi race.",
    "This comes as Russian forces took control of the Kherson City Council, weeks after first occupying the southern Ukrainian city.",
    "Capitol riot\nKylie Jenner and Travis Scott welcome their second child\nAre you still keeping up with the Kardashians?",
    "So, if you find yourself in this dizzying debate, experts say consider these key factors before making your move.",
    "President Joe Biden, in a fiery speech yesterday commemorating the anniversary of the January 6 insurrection.",
    "(Click here to view)\nEnjoy this stunning time-lapse footage our planet earth as seen from space.",
    "Rental rates have rebounded to pre-pandemic levels and mortgage rates have climbed above 5%.",
    "Gaming officials said the lucky winner will return to Vegas to collect his overdue prize.",
    "Kelly Slater wins surfing competition days shy of his 50th birthday\nAge is just a number!",
    "The elite competitor scored another career victory, beating out guys half his age.",
    "(You can get “5 Things You Need to Know Today” delivered to your inbox daily.",
    "It’s a tough question considering the current housing market.",
    "Fans are celebrating the new celebrity baby born on 2/2/22!",
    "We’re sending you air-hugs for this, Billie.",
    "Sign up here for the ‘5 Things’ newsletter.",
    "It even has a dramatic hype video!",
    "Should you rent or buy?",
    "(Click here to view)",
    "Coronavirus\n5.",
    "Sign up here.)",
    "Twitter\n3.",
    "4.",
    "1."
  ]
}