{
  "id": 2296,
  "mediaId": 2570,
  "date": "2022-02-04",
  "headline": "Call Records Reportedly Show Rep. Jim Jordan Spoke To Trump Before Jan. 6 Riot—Despite Earlier Denial",
  "image": "",
  "link": "https://www.forbes.com/sites/zacharysmith/2022/02/04/call-records-reportedly-show-rep-jim-jordan-spoke-to-trump-before-jan-6-riot-despite-earlier-denial/?sh=16fc56e352e1",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Snowdon Smith",
  "authorUrl": "https://www.forbes.com/sites/zacharysmith/",
  "termIds": [
    0
  ],
  "sentences": [
    "Topline\nLawmakers investigating the Capitol riot have received records showing Rep. Jim Jordan (R-Ohio) and President Donald Trump spoke for 10 minutes on the morning of the Capitol riot, CNN reported Friday, following months of often-contradictory statements from the congressman and Trump ally about his communications with the president..\nRecords obtained by the House January 6 committee show Trump and Jordan spoke on the phone shortly before the president left the White House at 11:40 a.m. to address thousands of “Stop the Steal” protesters at a rally in the nearby Ellipse park that preceded the Capitol breach, CNN reported, citing unnamed sources.",
    "“[Republicans]\ntold\nThe January 6 committee has not determined whether to subpoena Jordan, who declined a request to attend voluntarily to discuss his communications with Trump, dismissing the committee as a “partisan witch hunt.”\n“Exclusive: Newly obtained records show Trump and Jim Jordan spoke at length on morning of January 6” (CNN)",
    "Jordan, who has claimed that the 2020 presidential election was conducted unconstitutionally, took to the House floor shortly before the January 6 riot to object to the certification of President Joe Biden’s Electoral College victory, amid Trump’s failed eleventh-hour push to reverse his election loss.",
    "Jordan has given noncommittal responses when asked about his communications with Trump on January 6: He told Fox News in July he couldn’t remember whether he’d spoken to Trump before or after the riot, but when asked by House Rules Committee chair Jim McGovern (D-Mass.)",
    "One day before the attack on the Capitol, Jordan forwarded a text message to former White House Chief of Staff Mark Meadows outlining a legal theory enabling Vice President Mike Pence to block the certification of election results.",
    "“I’d have to go—I spoke with [Trump] that day after, I think after?” Jordan told Ohio’s Spectrum News TV July 28, in one of several noncommittal statements about whether he spoke with Trump on the day of the riot.",
    "The committee is also reviewing about 800 pages of Trump Administration records released after Trump’s legal efforts to have them suppressed were rejected by the Supreme Court.",
    "But what I know is that I spoke with him all the time.”\nJordan has condemned the violence that took place during the Capitol riot.",
    ")—one of only two Republicans now on the January 6 committee—to accuse Jordan of bearing some responsibility for the riot.",
    "The House January 6 panel asked Jordan to voluntarily cooperate, after it subpoenaed numerous Trump allies.",
    "on October 20, Jordan directly confirmed he had not spoken to Trump until afterwards.",
    "“I don’t know if I spoke with him in the morning or not.",
    "I mean, I don’t know when those conversations happened.",
    "This move led Rep. Liz Cheney (R-Wyo.",
    "I’d have to go back.",
    "I just don’t know."
  ]
}