{
  "id": 2331,
  "mediaId": 2664,
  "date": "2022-02-06",
  "headline": "Jim Jordan: The GOP's ultimate goal in taking back Congress is to 'frame up' a win for Trump in 2024",
  "image": "https://www.rawstory.com/media-library/jim-jordan.jpg?id=25646513&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/republican-2022-campaign-strategy/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    5802,
    2119,
    4905,
    4160,
    3119,
    2765,
    1126
  ],
  "sentences": [
    "Speaking to the Fox network on Sunday, Rep. Jim Jordan (R-OH) revealed that the Republican Party campaign strategy for the 2022 midterms will be all about former President Donald Trump.",
    "The crimes she says that Biden broke are leaving Afghanistan, allowing undocumented immigrants into the United States and \"acting as a pseudo-dictator\" by ignoring the Supreme Court.",
    "Speaking to mark Levin, Jordan said that he thinks Republicans must talk to the American people to explain why President Joe Biden is bad and what they'll do if they get power.",
    "Jordan has come under fire by six former students because while serving as an assistant coach he allegedly ignored sexual molestation of students at OSU on the wrestling team.",
    "One major thing is that they plan to launch a series of investigations into Biden, his administration and his previous work under President Barack Obama's administration.",
    "Other Republicans like Rep. Marjorie Taylor Greene (R-GA) said that they intend to push for the impeachment of Biden.",
    "Republicans have already announced some of the things they intend to do if they win in 2022.",
    "Levin went on to tell Jordan that he really admires the congressman for being a wrestler.",
    "She's already filed her own articles of impeachment in the House.",
    "The Republican Party strategy for 2022\nStories Chosen For You",
    "She didn't specify what ruling, however."
  ]
}