{
  "id": 2398,
  "mediaId": 2553,
  "date": "2022-02-08",
  "headline": "DeSantis Pounds Biden: Jimmy Carter ‘Was Much More Successful’ Than Biden",
  "image": "https://dw-wp-production.imgix.net/2021/10/DeSantis-2-scaled.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/desantis-pounds-biden-jimmy-carter-was-much-more-successful-than-biden",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Saavedra",
  "authorUrl": "https://www.dailywire.com/author/ryan-saavedra",
  "termIds": [
    0
  ],
  "sentences": [
    "Trump made the remarks during an interview with Sean Hannity in response to a recent report from The New York Times, which claimed that Trump had a “long-stewing resentment” toward DeSantis because, according to The Times, DeSantis “has been acting far less like an acolyte and more like a future competitor.”\nPolitico added the following background information:\nMany conservative media stars, most of whom have long been some of Trump’s most vocal supporters, have been hyping DeSantis in recent months for the governor’s rejection of Covid-related mandates and constant hammering of President Joe Biden.",
    "Florida Republican Governor Ron DeSantis slammed Democrat President Joe Biden in an interview this week, saying that former President Jimmy Carter, who is widely considered to be one of the worst presidents in modern history, was more successful than Biden.",
    "No, I have a very good relationship with Ron and intend to have it for a long time.”\nThe Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "DeSantis made the remarks while speaking about how the media and Democrats are trying to divide Republicans, including pitting him against former President Donald Trump, and distract from Biden’s failures in office.",
    "And let’s go into ‘22 with a full head of steam with everybody united on the same team.”\nTrump also dismissed claims that he has a problem with DeSantis during a Fox News interview last month.",
    "That support is key in helping DeSantis further expand his footprint with influencers in Republican primary politics ahead of his 2022 reelection and as he weighs a 2024 White House bid.",
    "Hannity said that he was recently informed that DeSantis indicated that there was not “any conflict or bickering” between the two and that it was “total BS” manufactured by the media.",
    "I think Ron said last week, he said it very publicly, he says the press is never going to get in the middle of my friendship with Donald Trump, we’re not going to do that stuff.",
    "Carter was much more successful his first year than Biden has been.”\n“So they know that, they know the Democrats are in for a shellacking in 2022,” DeSantis continued.",
    "But the support has increased in intensity in recent weeks, a spike easily noticeable on social media and podcasts throughout the conservative media ecosystem.",
    "And that helped him greatly.”\n“And he went on and he’s done a really terrific job in Florida, and I think you know, Ron has been very good,” Trump continued.",
    "And he had a disastrous first year as president said [sic] the worst first year president of any president since the 1800s.",
    "“They did everything they could to get Biden elected, the guy who campaigned from his basement,” DeSantis said.",
    "“So they’re trying to change the topic, and they’re trying to drive dissension among Republicans.",
    "He was right up front along with Jim Jordan, and all of the rest of them, they were fantastic.",
    "I think other Republican states are offering a better vision in their states as well.",
    "We need to be united and say we don’t like what the Biden administration’s doing.",
    "And he said it very strongly, I thought it was very interesting, actually.",
    "Get inside access to The Daily Wire by becoming a member.",
    "And so my message to people is, don’t take that bait.",
    "But he said that, and I agree with him on that 100%.",
    "Create a free account to join the conversation!",
    "“He’s been a friend of mine for a long time.",
    "“They never asked any questions about that.",
    "And Ron wanted to run and I endorsed him.",
    "The Republicans really stuck together.",
    "Ron was very good on the Mueller hoax.",
    "“Well, he is right,” Trump responded.",
    "Understand what they’re trying to do.",
    "We offer a better course in Florida.",
    "People compare him to Jimmy Carter.",
    "“Is he right?” Hannity asked.",
    "“I get along great with Ron.",
    "And it was a great thing.",
    "And Ron was one of them.",
    "It’s totally fake news.",
    "Well, now he gets in.",
    "And very nice."
  ]
}