{
  "id": 2449,
  "mediaId": 2564,
  "date": "2022-02-08",
  "headline": "Republican Rep. Troy Nehls claims Capitol Police disguised as construction workers snuck into his office to take photos of his files after he was picked for the GOP panel to investigate January 6 'security failures'",
  "image": "https://i.dailymail.co.uk/1s/2022/02/08/18/53931951-0-image-a-24_1644344344334.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10490197/Republican-Rep-Nehls-claims-Capitol-cops-disguised-construction-workers-snuck-office.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Drudge Report",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Elkind",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Elizabeth+Elkind,+Politics+Reporter+For+Dailymail.Com",
  "termIds": [
    2119,
    4066,
    4583,
    3246,
    226,
    1126,
    1429
  ],
  "sentences": [
    "After Nehls' announcement on Monday, Rep. Andy Biggs took to Twitter to reveal he 'demanded Speaker Pelosi and [Nehls' criticism of the law enforcement agency is a stark departure from his comments the day of the riot Administration Committee] Chairwoman Lofgren look into reports that show that the U.S. Capitol Police have been surveilling Members of Congress, their staff, constituents, and supporters.'",
    "Troy Nehls claimed on Monday that a Capitol Police officer entered his office upon allegedly seeing the door open on November 20, 2021 and then proceeded to take a picture of confidential documents\nNehls, Jordan and Banks all voted to overturn President Joe Biden's electoral victory in the hours immediately after the former president's supporters stormed the Capitol.",
    "+6\nView gallery\nNehls has been a vocal critic of Capitol Police leadership's handling of the insurrection and its aftermath\n'If Capitol Police had spent this much time investigating January 6th as they did investigating my private legislative materials, January 6th would not have happened.'",
    "+6\nView gallery\nNehls' criticism of the law enforcement agency is a stark departure from his comments the day of the riot\nHe and 33 other House GOP members signed onto a letter demanding Pelosi and Lofgren open an investigation into improper USCP 'monitoring.'",
    "'Capitol Police leadership have put a target on my back, but my work in exposing the security failures on January 6th, the death of Ms. Babbitt, and the sham investigation into the events of January 6 will not be deterred,' he told reporters in a statement.",
    "+6\nView gallery\nHe accused Capitol Police Chief Thomas Manger of lying when he said lawmakers were not subject to criminal investigations\n'No case investigation was ever initiated or conducted into the Representative or his staff.'",
    "'If these reports are true, that the Capitol Police force is actively looking for and reviewing private information, then this is a gross violation of American civil liberties and an abuse of power,' Biggs told the outlet.",
    "If a Member’s office is left open and unsecured, without anyone inside the office, USCP officers are directed to document that and secure the office to ensure nobody can wander in and steal or do anything else nefarious.'",
    "Nehls accused the top ranks of the Capitol Police of 'put[ting] a target' on his back, singling out Chief Thomas Manger specifically and claiming he lied by stating members of Congress were not subject to criminal probes.",
    "The GOP outcry was sparked by a report that claimed USCP began quietly monitoring social media feeds and other online activity of some people who meet with lawmakers at the Capitol, including members of their staff.",
    "+6\nView gallery\n+6\nView gallery\nIn addition to sending out a statement to the press, Nehls aired his accusations on Twitter\nUSCP 'never informed myself or senior level staff of their investigation,' Nehls said.",
    "The lawmaker said he attempted to contact the Capitol Police chief multiple times, only to find out the incident and report of 'suspicious writings' was connected to a 'veiled threat' on Nehls' life.",
    "Nehls' criticism of the law enforcement agency is a stark departure from his comments the day of the riot, when he posted a photo of himself next to an officer who was securing the House chamber.",
    "A USCP officers allegedly entered the Texas lawmaker and sheriff's office -- without his knowledge -- when 'discovering a door left open,' Nehls detailed in a statement to reporters.",
    "'Upon discovering a member of my staff, special agents dressed like construction workers began to question him as to the contents of a photograph taken illegally two days earlier.'",
    "Troy Nehls claimed on Tuesday that he was the subject of a US Capitol Police investigation that saw officers 'dressed like construction workers' snooping around near his office.",
    "Could you imagine leaving your front door open and police officers enter your private home, take pictures of the inside, and then open an investigation based on those pictures?'",
    "'I was proud to stand shoulder to shoulder with Capitol police barricading entrance to our sacred House chamber, while trying to calm the situation talking to protestors.",
    "That Monday, USCP personnel personally followed up with the Congressman’s staff and determined no investigation or further action of any kind was needed,' Manger said.",
    "His nomination was withdrawn in protest by McCarthy after House Speaker Nancy Pelosi objected to Donald Trump allies Reps. Jim Jordan and Jim Banks being on the panel.",
    "He wrote on Twitter that 'on Monday November 22, 2021 (Thanksgiving week), three intelligence officers attempted to enter my office while the House was in recess.'",
    "He said the alleged incident happened on November 20 of last year, after being deeply critical of 'security failures' at the Capitol on January 6, 2021.",
    "I’m grateful that the USCP Inspector General is standing up for his officers and reviewing her anti-democratic plot,' the Indiana congressman said.",
    "Their letter claims 'Capitol Police were directed to look for information on donors and staff ‘that would cast a member in a \"negative light\".'",
    "The congressman's office said it was connected to legislation that would 'have ensured body armor quality for law enforcement officers.'",
    "Nehls was one of five Republicans who was nominated by House GOP Leader Kevin McCarthy to serve on the House Capitol riot committee.",
    "Manger released a statement standing by the officer who entered Nehls' office after DailyMail.com reached out to USCP for comment.",
    "On Monday Nehls claimed a USCP officer walking into his office in late November and took a photo of 'confidential' material.",
    "He told the press in an emailed statement: 'This goes much deeper than an unethical entry into my office by Capitol police.'",
    "'After communicating with Chief Manger, it became clear that my office was under investigation and surveillance by USCP.",
    "Banks told DailyMail.com he was 'grateful' the USCP inspector general was stepping up to look into the Nehls incident.",
    "The Texas Republican's office told DailyMail.com that the phrase 'body armor' is what apparently raised the concern.",
    "Days later Nehls claimed that plainclothes officers cornered a staff member of his and grilled them about the photo.",
    "But it appears that the Capitol Police's actions after the insurrection is a caucus-wide concern for the House GOP.",
    "He then appeared to address Nehls' accusation about the plainclothes officers allegedly interrogating his staff.",
    "'The weekend before Thanksgiving, one of our vigilant officers spotted the Congressman’s door was wide open.",
    "Officers then allegedly passed the photo to intelligence agents that classified it as 'suspicious writings.'",
    "Politico had obtained communications discussing the new approach, put in place after the Capitol riot.",
    "Manger's statement read: 'The United States Capitol Police is sworn to protect Members of Congress.",
    "'This is a violation of Members’ right to speech and debate, as well as a 4th amendment violation.",
    "'Capitol Police officers deserve our thanks -- they don’t deserve to be used as political pawns.'",
    "Nehls' statement adds that officers never attempted to contact him about that supposed threat.",
    "A formal investigation into the matter was opened by the USCP inspector general, he announced.",
    "'This morning a U.S. Representative complained about one of our vigilant officers.",
    "Violence is NEVER the answer,' he wrote on Twitter at the time.",
    "Chief Manger stands by his officer,' USCP told DailyMail.com.",
    "'Speaker Pelosi is weaponizing the Capitol Police.",
    "The letter was first reported by Fox.",
    "What I’m witnessing is a disgrace.",
    "We were the \"threat\",' Nehls said.",
    "We’re better than this.",
    "+6\nView gallery\nRep.",
    "Republican Rep.",
    "Nehls added."
  ]
}