{
  "id": 2463,
  "mediaId": 2526,
  "date": "2022-02-07",
  "headline": "Republican Sen. Todd Young: Migration Should Not Hurt Americans’ Wages",
  "image": "https://media.breitbart.com/media/2022/02/GettyImages-1235981334-640x335.png",
  "link": "https://www.breitbart.com/economy/2022/02/07/republican-sen-todd-young-migration-should-not-hurt-americans-wages/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Neil Munro",
  "authorUrl": "https://www.breitbart.com/author/neil-munro/",
  "termIds": [
    5033,
    2119,
    3403,
    2772,
    4066,
    1489,
    1126,
    392,
    6678
  ],
  "sentences": [
    "Young, Cornyn, Shelley Moore Capito (R-WV), Bill Cassidy (R-LA), Susan Collins (R-ME), Mike Crapo (R-ID), Steve Daines (R-MT), Joni Ernst (R-IA), Lindsey Graham (R-SC), Cindy Hyde-Smith (R-MS), Mitch McConnell (R-KY), Lisa Murkowski (R-AK), Jim Risch (R-ID), Mitt Romney (R-UT), Mike Rounds (R-SD), Ben Sasse (R-NE), Thom Tillis (R-NC), and Roger Wicker (R-MS).",
    "I mean, you kind of talk about the reskilling: What we can be doing domestically, but what role does immigration reform have on these and the workforce needs that we’re talking about here?”\nYoung responded with a zig-zag, first saying immigration “has an essential role to play,” before saying it must not be used to suppress wages.",
    "In turn, the loss of wealth means that heartland states get far less mention in commercial culture than they got in prior decades:\nAn economy built on extraction migration also radicalizes Americans’ democratic, compromise-promoting civic culture and allows wealthy elites to ignore despairing Americans at the bottom of society.",
    "The mass inflow of cheap and compliant foreign workers distorts the nation’s professional sector by empowering CEOs, suppressing U.S. salaries, undermining professionalism, slowing innovation, and diverting job-creating investment towards the coasts, such as Silicon Valley and New York.",
    "After the House passed their version of the bill with the visa giveaway, Young released a statement on February 4, saying:\nAs we head to a conference process, my hope is that the final legislation will reflect the Senate bill and give House Republicans a much better option to support.",
    "Shockingly, an unlimited number of members of the Chinese Communist Party are eligible to take advantage of the new visa program to carry out their malign activity here in the States (page 1689)\nSen. John Cornyn (R-TX) is also speaking against the Democrats’ career-giveaway plans.",
    "If Congress seeks to import workers, “we need to do it smartly, in order to once again ensure that those new workers aren’t competing with our existing workers for jobs, competing for wages and salaries,” Young told Punchbowl’s Anna Palmer in a January 25 interview.",
    "The bill also provides the coastal investors with more foreign workers to fill the worksites that investors prefer to build near their coastal homes in their coastal states — and so very far away from the many young people in Young’s Indiana or the GOP’s Midwest.",
    "Advocates, including Lofgren, say the House bill allows the “best and brightest” foreign graduates to get green cards, jobs, and then citizenship if they work to get science, technology, engineering, or math (STEM) doctorates in American or foreign universities.",
    "“The [alternative] Senate bill needs to be the template for what is ultimately done by the conference committee and what is ultimately passed by the United States Congress.”\nThe 18 Republicans who voted for the Senate’s anti-China bill included Sens.",
    "Young’s comments in the little-noticed interview highlight the political problem created by the House Democrats’ surprise addition of expansive migration measures to a bill intended to help U.S. companies compete with China’s state-backed industries.",
    "The House bill would spend $250 billion on a wide variety of Democrat causes — such as funding for the United Nations — and it includes several migration provisions that would reduce the jobs and wages available to people in Young’s home state.",
    "But the fine print of the bill shows it would give green cards to a wide variety of ordinary foreign graduates, including chemists, doctors, engineers, statisticians, accountants, tax experts, software developers, and computer security experts.",
    "Migration moves money, and since at least 1990, the federal government has tried to extract people from poor countries so they can serve U.S. investors as cheap workers, government-aided consumers, and high-density renters in the U.S. economy.",
    "A January 31 statement from Banks’ Republican Study Committee said the Democrats’ bill:\nCreates a new visa cap carveout program that would be even less secure than the existing visa programs that are already riddled with fraud.",
    "His comments about wages and jobs are a quiet admission that American immigration politics are deeply driven by pocketbook politics, even as other GOP politicians pander to donors by only touting border chaos and crime.",
    "“I should add that, realistically as a matter of politics and I think a matter of good policy, any immigration reform proposals are going to have to be paired with border security measures to get it done,” Young added.",
    "Many Republicans voted against the measure because it does not protect against aggressive Chinese spying and technology theft, say Senate critics, including Sen. Ron Johnson (R-WI) and Sen. Marco Rubio (R-FL).",
    "Roughly 1.5 million non-immigrant, mid-skill, foreign contract workers — such as H-1B workers — have been imported and hired by CEOs to fill white-collar careers that would otherwise be held by U.S. graduates.",
    "The company has opened facilities in India, from where the company has already imported many H-1B visa workers and OPT graduates for U.S.-based jobs that could be filled by American graduates in the Midwest.",
    "“According to FWD.us estimates, 100,000 international student graduates of U.S. colleges and universities each year would like to stay and work permanently in the U.S.,” the group said in a new report.",
    "Extraction migration also curbs Americans’ productivity, shrinks their political clout, and widens the regional wealth gaps between the Democrats’ coastal states and the Republicans’ Heartland states.",
    "Unsurprisingly, a wide variety of little-publicized polls do show deep and broad opposition to labor migration and the inflow of temporary contract workers into jobs sought by young U.S. graduates.",
    "The bill’s language sets no limits on the number of foreign migrants who can get green cards and then U.S. jobs and careers, nor does it set any minimum standards for the skills of those migrants.",
    "The Democrats’ green card giveaway was repeatedly blasted by GOP leaders, including Rep. Jim Jordan (R-OH), and House GOP leader Kevin McCarthy, who said:\nThey call it the American Competes Act.",
    "That 100,000 number is roughly one-eighth of all Americans who graduate each year from four-year colleges with degrees in healthcare, business, science, biology, software, math, or engineering.",
    "He is facing the electors in November even as more voters recognize how migration reduces investment in the heartland by delivering endless foreign labor to coastal investors and employers.",
    "That economic strategy has no stopping point, and it is harmful to ordinary Americans because it cuts their career opportunities and their wages while it also raises their housing costs.",
    "But Young reassured Punchbowl that Americans can do the job:\nIf we can harness the talent of rank and file Americans, I really believe we can outgrow and out-innovate other countries.",
    "The Senate-passed bill focuses on directly confronting China and getting legislation like USICA across the finish line will ensure the United States leads the world into the future.",
    "“The partisan bill from the House has also added provisions related to immigration, from creating new types of visas to removing green card caps,” Cornyn said on February 4.",
    "Young also thanked chipmaker Micron Technology “who has supported this [media] event.” Most of Micron’s facilities are in California and other coastal locations.",
    "The 2013 founders included Zuckerberg, Microsoft founder Bill Gates, John Doerr at Kleiner Perkins, Matt Cohler at Benchmark, and Breyer Capital CEO Jim Breyer.",
    "The Senate bill spends more than $110 billion to boost research in a much-touted effort to help U.S. businesses compete with China’s government-backed economy.",
    "The bill’s migration sections would allow U.S. investors and companies to hire an endless stream of foreign replacements for mainstream Indiana graduates.",
    "Zuckerberg’s investor allies at FWD.us are not just looking for extra workers — they want more migrants because they also serve as consumers and renters.",
    "The federal government should not have immigration policies that threaten Americans’ jobs and wages, Sen. Todd Young (R-IN) told Punchbowl News.",
    "The breadth of investors who founded and funded FWD.us was hidden from casual visitors to the group’s website sometime in the last few months.",
    "Investors in her region use many imported visa workers to minimize geographically-inconvenient investments in other states, such as Indiana.",
    "And that, of course, has very important national security implications, especially as you think about our strategic competition with China.",
    "According to Punchbowl:\nPrior to joining Punchbowl News, Rachel led Facebook’s strategy, planning and operations for the global news team.",
    "The China bill is strongly backed by business groups, such as Mark Zuckerberg’s FWD.us advocacy group for West Coast investors.",
    "Speaker Pelosi is holding these good ideas, hostage by using this 3,000-page bill as a vehicle for the party’s far-left agenda.",
    "Young’s pro-American January 25 insistence that migration should not damage Americans’ opportunities makes sense for him.",
    "The growing gaps mean that midwestern states lose investment, jobs, and wealth to the migration-inflated coastal states.",
    "“This is how we’ll build majority support for immigration reform,” said Young, who is up for election this year.",
    "Punchbowl was founded in January 2021 by three journalists and a former Facebook PR official, Rachel Schindler.",
    "For three years, Rachel specialized in growing revenue-sharing products with media companies around the world.",
    "The green card language was touted by Rep. Zoe Lofgren (D-CA), whose district includes part of Silicon Valley.",
    "On page 1,689, it provides a new unlimited green card program for the Chinese Communist Party to exploit.",
    "Almost every page of the Democrats’ Concede Act has a provision that helps China but hurts America.",
    "The American Concedes Act is Democrats’ desperate answer to their string of self-created crises.",
    "The green card giveaway was also slammed by Young’s fellow Hoosier, Rep. Jim Banks (R-IN).",
    "His bill passed the Senate’s 60-vote threshold with just a handful of votes to spare.",
    "Young played a critical role in passing the Senate’s version of the anti-China bill.",
    "Punchbowl’s Palmer asked Young, “One last question on that, though.",
    "FWD.us is leading the 2022 push for more migration and amnesty.",
    "While it contains some provisions supported by Republicans.",
    "The House passed a very different version on February 4.",
    "partly by promoting pro-migration media coverage.",
    "But copies exist at the other sites.",
    "It’s a bill that concedes to China.",
    "Now here are just a few excerpts.",
    "But make no mistake."
  ]
}