{
  "id": 2481,
  "mediaId": 2646,
  "date": "2022-02-09",
  "headline": "COLD: GOP Rep. confuses Nazis with a bowl of soup",
  "image": "https://occupydemocrats.com/wp-content/uploads/MTG-gazpacho-tweets-1024x525.jpg",
  "link": "https://occupydemocrats.com/2022/02/09/cold-gop-rep-confuses-nazis-with-a-bowl-of-soup/",
  "mediaOutlet": "occupydemocrats.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Vinnie Longobardo",
  "authorUrl": "https://occupydemocrats.com/author/vlongobardo/",
  "termIds": [
    0
  ],
  "sentences": [
    "https://t.co/U6N2yvlsAq\n— Oficial de Policía de Gazpacho Conway (@gtconway3d) February 9, 2022\nI gotta say I'll be able to get over the evil long before I'll ever be able to get over the dumb https://t.co/U6N2yvlsAq\n— Oficial de Policía de Gazpacho Conway (@gtconway3d) February 9, 2022\nwell at least this gives new meaning to the phrase \"soup to nuts\" https://t.co/U6N2yvlsAq\n— Oficial de Policía de Gazpacho Conway (@gtconway3d) February 9, 2022\nMTG: hold my soup!",
    "No soup for those who illegally spy on Members of Congress, but they will be thrown in the goulash.#Gazpacho #Gestapo\n— Rep. Marjorie Taylor Greene (@RepMTG) February 9, 2022\nThat comment likely won’t extricate Greene from the stew she now finds herself in as the January 6th Committee investigates the build-up to the invasion of Congress and the contacts that the organizers of the insurrection may have had with members of Congress.",
    "— Palmer Report (@PalmerReport) February 9, 2022\nhttps://twitter.com/_Lalo_S_/status/1491556340401012737?s=20\nif it was a one time slip of phrase from a intelligent person, we would all just let it slip…but this person @repmtg is a complete moron who works for the American people and she just makes dumb comment after dumb comment and tries to sell that she is smart…she is not.",
    "@RepMTG\n— NoelCaslerComedy (@caslernoel) February 9, 2022\nhttps://twitter.com/StompTheGOP/status/1491542637978927104?s=20\nDay 1: LOL Marjorie Taylor Greene said “Gazpacho police.”\nDay 3: What Marjorie Taylor Greene’s ‘Gazpacho’ Flub Reveals About the Modern GOP by David Brooks\nDay 15: Lin Manuel Miranda performs his newest song, “Soup Nazi,” for the House Democratic Caucus.",
    "— Matt Fuller (@MEPFuller) February 9, 2022\nparents: make sure your kids get a good education, so they don't grow up to be Marjorie Taylor Greene\n— Jeff Tiedrich (@itsJeffTiedrich) February 9, 2022\nMarjorie Taylor Greene tried to accuse democrats of being the “gestapo” police today but instead called them the “gazpacho” which is a bowl of soup.",
    "Just to clear things up, @RepMTG\nGazpacho: a vegetable-based Spanish cold soup\nGestapo: Nazi Germany's secret police pic.twitter.com/T9q76r706G\n— The Republican Accountability Project (@AccountableGOP) February 9, 2022\nSponsored Links\nNaturally, Congresswoman Greene’s display of ignorance inspired many amused reactions in the Twittersphere.",
    "https://twitter.com/chefjoseandres/status/1491540341006159886?s=20\nNoted Never-Trumper Washington attorney George Conway was so entertained by Greene’s gaffe that he changed his Twitter handle to “Oficial de Policia de Gazpacho Conway” and “Señor Gazpacho Conway” for the day and launched a whole series of mocking tweets.",
    "https://t.co/6dOLzV3W0X\n— Oficial de Policía de Gazpacho Conway (@gtconway3d) February 9, 2022\n— Oficial de Policía de Gazpacho Conway (@gtconway3d) February 9, 2022\nRep. Greene at least acknowledged being the butt of thousand witticisms with her own response to the Fuhrer, I mean furor, over her case of mistaken lingo.",
    "“Not only do we have the DC jail, which is the DC gulag, but now we have Nancy Pelosi’s Gazpacho police spying on members of Congress, spying on the legislative work that we do, spying on our staffs, and spying on American citizens that want to come talk to their reprsentatives,” Rep. Greene exclaimed.",
    "When Georgia finally is able to remove that state’s biggest embarrassment from her representation of the state’s 14th Congressional district, the nation’s political situation may greatly benefit, but comedians everywhere will be mourning the loss of one of their most fertile sources of new material.",
    "The Georgia lawmaker was ranting about what she claims are the “prosecution tactics” allegedly being used by the House Select Committee on the January 6th insurrection — as the caption on screen confirms — when she made a verbal faux pas that had Twitter in stitches all afternoon.",
    "Rep. Greene proved her mettle as the inspiration for loud guffaws, irrepressible titters, and hearty chuckles with her latest display of unintentional hilarity today during an appearance on the right-wing extremist “news” program Real America with Dan Brown.",
    "She might as well have added: “spying to make sure that the ratio of tomatoes to cucumbers and other ingredients reflect the explicit standards of the Spanish Cold Soup Society’s recipe,” for as much sense as her mistaken reference to Nazi secret police.",
    "Advertisement Above\nWhile many on the left denounce Congresswoman Marjorie Taylor Greene (R-GA) as the most useless waste of space on Capitol Hill, they may be ignoring her invaluable contributions to the humor of late-night comedians and Twitter wags.",
    "pic.twitter.com/zWe1R6ZqUc\n— gregginrva (@gregginrva) February 9, 2022\nhttps://twitter.com/larsenmatt/status/1491556135148548098?s=20\nSeveral of Greene’s Democratic colleagues on the House of Representatives joined in on the fun.",
    "She clearly banned all books from her house years ago https://t.co/SGMheBuFzn\n— Alexandria Ocasio-Cortez (@AOC) February 9, 2022\nCelebrity Chef Jose Andrés weighed in with this culinary gem.",
    "What was it that Jim Jordan was saying yesterday about some \"elite mindset that says we’re all dumb\"?",
    "Sponsored Links\nSure the Gazpacho Police are bad but the elite Vichyssoise inspired pureed terror.",
    "https://twitter.com/PERsisterER/status/1491556391311622144?s=20\nAt least she leads by example.",
    "— e11ebin (@e11ebin) February 9, 2022\nI could see how they’re easily confused.",
    "Add your name to call on prosecutors to ARREST DONALD TRUMP for his crimes!",
    "That’s fitting since Marjorie Taylor Greene’s brain is a bowl of soup.",
    "Sponsored Links\nHere are a few of the best responses.",
    "Scroll down and let us know in our comment section!",
    "Beware if you are allergic to outrageous puns!",
    "We want to hear what YOU have to say.",
    "It will be worth it nonetheless.",
    "Advertisements"
  ]
}