{
  "id": 2529,
  "mediaId": 2629,
  "date": "2022-02-05",
  "headline": "Records Trump Tried To Hide Reveal Call To Jim Jordan Before Capitol Attack",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTI3MzAzOS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY2NzQ2NzQ4Nn0.EQVneliRx-bUrANTHdWfEwB9osKiV9IFPRh2mOnBdm4/img.jpg?width=1200&coordinates=0%2C125%2C0%2C125&height=600",
  "link": "https://www.nationalmemo.com/jim-jordan",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Oliver Willis",
  "authorUrl": "https://www.nationalmemo.com/u/oliver-willis",
  "termIds": [
    4905,
    3621,
    2765,
    2119,
    1269,
    514,
    849,
    6709,
    6269
  ],
  "sentences": [
    "Noting that President Joe Biden had decided against invoking executive privilege with regard to Trump's records, Judge Patricia A. Millett noted in the decision, \"Former President Trump has provided no basis for this court to override President Biden’s judgment.\"",
    "After telling a Fox News interviewer in July that he had spoken to Trump, Jordan later told another reporter he wasn't sure he had done so, then told another reporter he couldn't remember if he had spoken to Trump.",
    "Ultimately, 147 Republican members of Congress voted against certification, which would have invalidated the votes of millions of voters including the more than 81 million in the majority who voted for Biden.",
    "Records that former President Donald Trump attempted to hide from public scrutiny have now revealed that he spoke on the phone with Rep. Jim Jordan (R-OH) on Jan. 6, 2021.",
    "The phone call between Trump and Jordan occurred hours before Trump joined other Republicans in an attempt to deny certifying President Joe Biden's election win.",
    "In December, Trump had asked the Supreme Court to block the release of his records, claiming that their disclosure was a violation of executive privilege.",
    "After his phone call with Trump, Jordan made a speech on the floor of the House arguing against congressional certification of the election results.",
    "The Jan 6. committee requested that Trump's records stored at the National Archives be turned over as part of the investigation into the attack.",
    "In his speech, Jordan invoked debunked conspiracies about the integrity of the election, echoing other comments he had been making at the time.",
    "The call also occurred before the U.S. Capitol was attacked by a pro-Trump mob attempting to prevent Biden from officially winning the race.",
    "CNN reported on Friday that Congress's Jan. 6 committee investigating the attack received Trump's phone records that documented the call.",
    "Several called for hanging then-Vice President Mike Pence, who had refused to entertain Trump's demand that he not certify the election.",
    "The false arguments offered by Jordan, Trump, and many other Republicans were later echoed by the mob that attacked the Capitol.",
    "A spokesperson for the committee said Jordan's admission that he spoke to Trump on Jan. 6 made him a \"material witness.\"",
    "During a House hearing in October, Jordan would still not confirm the exact time of his Trump call.",
    "More than 768 people have been charged with federal crimes in connection to the Capitol attack.",
    "The U.S. Court of Appeals for the District of Columbia ruled against Trump later in the month.",
    "Since then, Jordan has refused a request to be interviewed by the Jan. 6 committee.",
    "Jordan has been evasive on whether he spoke to Trump or not on Jan. 6.",
    "The effort was unsuccessful, and Biden's election win was certified.",
    "Reprinted with permission from American Independent\njim jordan"
  ]
}