{
  "id": 253,
  "mediaId": 2522,
  "date": "2022-02-26",
  "headline": "Jordan scorches Biden: Would be nice if equipment abandoned in Afghanistan could help Ukraine",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/02/SG-SG-Jim-Jordan-Joe-Biden-split.jpg",
  "link": "https://www.bizpacreview.com/2022/02/26/jordan-scorches-biden-would-be-nice-if-equipment-abandoned-in-afghanistan-could-help-ukraine-1206021/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "https://www.bizpacreview.com/author/terresa-monroe-hamilton/",
  "termIds": [
    0
  ],
  "sentences": [
    "“I, for the life of me, cannot understand why it’s off the table, not even something to discuss Jim, increasing production of energy in this country, getting back to the energy independence that Biden inherited and being a net exporter and immediately helping out our NATO and western European allies with energy needs, instead of pushing them even further.",
    "I sat in a committee hearing just a few months ago where Ro Khanna, a Democratic member from California, with oil executives, the CEOs of these big oil and gas companies here in the United States, he badgered every single one of them and said, ‘Will you pledge to decrease production this year?’ I think they want $8 gas,” the GOP lawmaker bluntly charged.",
    "(Video Credit: Fox News | Sean Hannity)\nRep. Jim Jordan (R-OH) appeared on Sean Hannity’s show on Fox News Friday night to discuss the energy independence issue in connection to the Russian invasion and took a stinging slap at the Biden administration leaving weapons behind in Afghanistan, saying they would have done far more good in Ukraine.",
    "— Rep. Jim Jordan (@Jim_Jordan) February 25, 2022\nJordan astutely pointed out that the stockpiles of weapons and artillery left behind in Afghanistan would be far more useful in Ukraine right now helping the citizens there fight for their freedom against the invading murderous Russians.",
    "“Sean, think about this… Dan just talked about weapons and what we need to get to the Ukrainians, it would’ve been nice if that $85 billion of weapons and equipment we left in Afghanistan, if that was in — some of that was in Ukraine right now to help the Ukrainian people.",
    "(Video Credit: Fox News)\nA) GOP OH Rep Jordan on Fox on Zelenskyy: You just really got to appreciate that this guy felt was genuine, that he really cared about making a difference for the people, the Ukrainian people and for his country.",
    "I’ve not met President Zelenskyy but during the impeachment, the first impeachment three years ago, you felt like you got to know him as we study about the phone call and everything else, you could tell this is a different leader.",
    "“It’d be nice if the State Department would be focused on real diplomacy versus when they sent out the email that said, oh, what pronoun do you want to use?",
    "“There’s no reason… there’s no way he’s going to open up ANWAR and have the Keystone Pipeline come back because his party doesn’t want that.",
    "It all comes back to energy and bad decisions made over the last year have put us in this situation and God bless the Ukrainian people.",
    "The character and the courage they are showing… I think frankly, Sean, it’s a reflection of their leader President Zelenskyy.",
    "“Yeah, and Sean, why not increase production as you talked about earlier here in the United States.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "And the reason Joe Biden won’t do it is because his party won’t let him,” Jordan responded.",
    "So, that’s the problem, bad decisions early on that put us in this terrible position.",
    "— Rep. Jim Jordan (@Jim_Jordan) February 7, 2022\nPLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "All the others are meaningless without that one,” the “Hannity” host asserted.",
    "— Chad Pergram (@ChadPergram) February 26, 2022\nGod bless President Zelensky.",
    "And, oh, we’re going to have gender-neutral passports now, for goodness sake.",
    "Think Ukraine could use the equipment Joe Biden left behind in Afghanistan?",
    "And the Ukrainian people feel it as we speak,” he proclaimed.",
    "This guy was committed to doing the best for his country.",
    "And I think we're seeing that courage and leadership.",
    "Why not use the one sanction that would be effective?",
    "The public will not see it and we do not share it.",
    "He’s a good man, God bless him,” he added.",
    "That’d be nice,” Jordan contended.",
    "This was a guy of courage.",
    "“So, this is the problem."
  ]
}