{
  "id": 2556,
  "mediaId": 2547,
  "date": "2022-02-09",
  "headline": "Eyeroll Of The Week: Matt Gaetz's Speech On Sexual Harassment",
  "image": "https://crooksandliars.com/files/primary_image/22/02/screenshot2022-02-08at1.15.32pm.png",
  "link": "https://crooksandliars.com/2022/02/eyeroll-week-matt-gaetzs-speech-sexual",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Walter Einenkel",
  "authorUrl": "https://crooksandliars.com/team/walter-einenkel",
  "termIds": [
    2119,
    2443,
    3514,
    3516,
    1477,
    392,
    1391,
    1126,
    6159
  ],
  "sentences": [
    "A little less than a year ago, reports were surfacing about how besides being known as a flashy rich kid, Gaetz was also well-known for showing congressional colleagues nude pictures and video of ex-girlfriends, or just women he had had sexual relationships with.",
    "Of course, it was strange to hear Republican Rep. Matt Gaetz of Florida giving such full-throated support to safe workspaces, especially after recent revelations about what it is like to be a woman working around Republican Rep. Matt Gaetz of Florida.",
    "Rep. Gaetz even made a speech on the House floor in support of the bill before the vote, and said all of the things one would hope someone supporting a bill that looks to hold workplaces accountable for sexual assault and sexual harassment would say.",
    "The Ending Forced Arbitration of Sexual Assault and Sexual Harassment Act of 2021 seeks to end the big business practice that forces employees to arbitrate disputes involving claims of sexual assault and harassment in the workplace.",
    "Less than a month ago it was reported that Gaetz’s former girlfriend had been given some kind of immunity deal to testify for investigators in the probe of Gaetz’s former buddy Joel Greenberg.",
    "*Some of those who voted against the bill include the MAGA all-star clown car of Marjorie Taylor Greene, Paul Gosar, Lauren Boebert, Madison Cawthorn, Jim Jordan, and Chip Roy, among others.",
    "The idea that businesses are legally allowed to hold their own arbitration tribunals and somehow those decisions have legal superiority over federal laws is absurd and always has been.",
    "It is an obvious good thing, and the fact that Matt Gaetz is willing to support it means less than the fact that there were 97 Republicans willing to vote against it.",
    "On Monday, Republican Florida man Rep. Matt Gaetz was one of 113 Republicans willing to join the Democrats in the House in support of HR 4445.",
    "In fact, one of those former girlfriends who had video of herself shown around the chambers by Gaetz reportedly got a job through Rep. Gaetz.",
    "However, in this case, the messenger is being investigated for alleged human trafficking and possible sexual misconduct with a minor.",
    "That’s somehow the most Matt Gaetz thing Matt Gaetz has done in recent months.",
    "* Sort of like voting against people being allowed to breathe air.",
    "The speech wasn’t long, and frankly, why should it be?",
    "So take in the protector of women, Matt Gaetz.",
    "Republished with permission from Daily Kos",
    "Real classy stuff."
  ]
}