{
  "id": 2620,
  "mediaId": 2664,
  "date": "2022-02-04",
  "headline": "New evidence shows Trump and Jim Jordan had lengthy phone conversation on Jan. 6",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29244917&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/trump-and-jim-jordan-phone-call/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sky Palma",
  "authorUrl": "https://www.rawstory.com/u/sky_palma",
  "termIds": [
    2765,
    4905,
    2119,
    300,
    849,
    1433
  ],
  "sentences": [
    "IN OTHER NEWS: Reporter grills US official on government's refusal to prove direct evidence on Russian intel claims\nReporter grills US official on government refusal to prove direct evidence on Russian intel claims",
    "\"These call logs are among the documents the National Archives turned over to the House select committee investigating the riot after Trump last month lost his bid at the Supreme Court to keep them secret.",
    "A key focus of the committee's investigation has been on the runup to the insurrection and the myriad ways Trump and his allies, including those in Congress, tried to overturn the election results.",
    "The new details about the morning phone call come as the committee is debating whether to move forward with a subpoena for Jordan after he refused to voluntarily appear for an interview.\"",
    "\"Two sources who have reviewed the call records tell CNN that Trump spoke on the phone at the White House residence with Jordan for 10 minutes on the morning of January 6,\" CNN reports.",
    "The House committee investigating the Capitol riot has obtained evidence showing new details about then-President Donald Trump's phone call to Ohio GOP Rep. Jim Jordan on Jan. 6, 2021.",
    "The records have been crucial for congressional investigators as they try to build a complete narrative of what happened that day, and the call logs help to deepen that understanding.\"",
    "\"That afternoon, Jordan took to the House floor to object to the certification of President Joe Biden's Electoral College win, and pro-Trump supporters attacked the US Capitol.",
    "\"One entry in the White House records shows a request from Trump to get Jordan on the phone from the White House residence on the morning of January 6.",
    "\"I talked to the President a number of times that day, but I don't remember the times,\" Jordan has said.",
    "According to CNN, Jordan has been \"inconsistent\" in his answers regarding the call.",
    "A second entry shows that the length of the call was 10 minutes,\" reports CNN."
  ]
}