{
  "id": 2798,
  "mediaId": 2540,
  "date": "2022-02-01",
  "headline": "Proposal to endorse removing Cheney and Kinzinger from House GOP Conference gets more than 50 RNC co-sponsors",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/211214222518-liz-cheney-and-adam-kinzinger.jpg?c=16x9&q=w_800,c_fill",
  "link": "https://www.cnn.com/2022/02/01/politics/rnc-resolution-cheney-kinzinger/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabby Orr",
  "authorUrl": "https://www.cnn.com/profiles/gabby-orr",
  "termIds": [
    5037,
    2306,
    2887,
    4066,
    3896,
    1477,
    1126,
    1119,
    6709
  ],
  "sentences": [
    "Kinzinger and Cheney are the only two Republicans serving on the January 6 committee after McCarthy withdrew his slate of members during negotiations over the panel's configuration and House Speaker Nancy Pelosi denied seats on the panel to ultra-conservative Reps. Jim Banks of Indiana and Jim Jordan of Ohio -- both of whom objected to congressional certification of the election results from two states on January 6, 2021.",
    "\"The leaders of the Republican Party have made themselves willing hostages to a man who admits he tried to overturn a presidential election and suggests he would pardon Jan. 6 defendants, some of whom have been charged with seditious conspiracy,\" Cheney said in a statement that was shared by her office with CNN.",
    "Led by Wyoming Republican Party Chairman Frank Eathorne, the resolution has been passed around to several party officials over the past few days who have been eager to take a public stand against the House panel and the two Republicans who have taken on active roles in the January 6 investigation.",
    "The proposed resolution, which has garnered more than 50 co-sponsors, seeks to punish the two Republican lawmakers over their involvement in the ongoing House Select Committee investigation of the January 6 riots at the US Capitol, according to two people familiar with the latest draft.",
    "Barnett, the committeeman from Arkansas, said the resolution against Cheney and Kinzinger \"is controversial and not everyone agrees with it\" among the RNC's membership, but argued that it is likely to pass given that it has already amassed more than 50 co-sponsors.",
    "McCarthy, who rejected calls from within his caucus to oust Cheney from her leadership position until Trump endorsed the move, has recently ignored calls from Trump-aligned conservatives to remove Cheney and Kinzinger from the House GOP conference.",
    "This is an inquisition, and we just feel like they are trying to dig up anything they can but that it's one-sided,\" Jonathan Barnett, a national committeeman from Arkansas who is among the resolution's co-sponsors, told CNN in an interview Tuesday.",
    "In addition to the resolution targeting Kinzinger and Cheney, the RNC is expected to discuss changes to the party's participation in future presidential debates and its platform when members gather in Utah beginning on Wednesday.",
    "(CNN)A proposal to endorse removing GOP Reps. Liz Cheney and Adam Kinzinger from the House Republican Conference has gained steam ahead of its introduction at the Republican National Committee's winter meeting this week.",
    "RNC Chairwoman Ronna McDaniel, who has not publicly acknowledged whether she supports the resolution, said in November that Cheney was \"still a Republican\" despite the Wyoming GOP's vote to remove her from their ranks.",
    "McDaniel is scheduled to address members on Friday morning, shortly before they will vote on the anti-Cheney and anti-Kinzinger resolution if it passes out of the resolutions committee.",
    "Like Cheney, the Illinois lawmaker was one of 10 House Republicans who voted to impeach Trump after the Capitol insurrection and has continued to decry Trump's firm grip on Republicans.",
    "In November, the Wyoming GOP voted to no longer recognize her as a Republican amid her constant criticism of Trump's dominance over the party and his role in the January 6 riots.",
    "The Washington Post was first to report details of the resolution, which is likely to be taken up at the committee's winter meeting in Salt Lake City this week.",
    "One of the letter's signatories -- Citizens United president David Bossie -- has been involved in drafting the RNC resolution that calls for the same outcome.",
    "3 Republican in the House last May, is currently facing a primary challenger backed by former President Donald Trump and several of her House GOP colleagues.",
    "We'd like to see [House Minority Leader Kevin] McCarthy take care of these issues, but it's something we feel we need to talk about,\" Barnett added.",
    "Kinzinger, an Illinois Republican who is another vocal Trump critic, announced last October that he plans to retire at the end of his term.",
    "There's just a lot of frustration with the January 6 committee and we don't think there's any representation on the Republican side.",
    "In December, more than 40 conservative figures urged the minority leader in a letter to remove the duo from the party's ranks.",
    "Should it pass out of a resolutions committee meeting on Thursday, all 168 RNC members would vote on it Friday morning.",
    "Spokespeople for Kinzinger and the RNC did not immediately respond to requests for comment.",
    "I wish she was talking about electing 'Rs' more,\" McDaniel told reporters at the time.",
    "Cheney, the Wyoming Republican who was ousted from her leadership post as the No.",
    "Bossie did not return a request for comment.",
    "\"She still has an 'R' next to her name.",
    "\"We don't understand Liz and Adam.",
    "\"We want to make a statement."
  ]
}