{
  "id": 2817,
  "mediaId": 2572,
  "date": "2022-02-03",
  "headline": "Top oversight Republicans call on 7 scientists to testify on COVID origins, Wuhan lab leak",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/GettyImages-1227857083.jpg",
  "link": "https://www.foxnews.com/politics/top-oversight-republicans-7-scientists-testify-covid-origins-wuhan-lab-leak",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caitlin McFall",
  "authorUrl": "https://www.foxnews.com/person/m/caitlin-mcfall",
  "termIds": [
    5517,
    1927,
    2119,
    4070,
    4838,
    4698,
    3217
  ],
  "sentences": [
    "Reps. James Comer, R-Ky.,, a member of the Oversight and Reform Committee; Steve Scalise, R-La., the minority whip and ranking member of the Select Subcommittee on the Coronavirus Crisis; and Jim Jordan, R-Ohio, ranking member of the Judiciary Committee, have questioned whether these scientists felt pressure from top health officials like Dr. Antony Fauci and Dr. Francis Collins.",
    "\"Documents in the custody of the National Institutes of Health (NIH) reveal how a group of scientists … initially believed COVID-19 to be man-made before reversing course and claiming otherwise following discussions with senior government health officials,\" the lawmakers wrote in letters obtained by Fox News Digital.",
    "\"The unusual features of the virus make up a really small part of the genome (<0.1%) so one has to look really closely at all the sequences to see that some of the features (potentially) look engineered,\" Dr. Kristian Andersen wrote in a Jan. 31, 2020, email to Fauci and Dr. Jeremy Farrar.",
    "INTELLIGENCE COMMUNITY FAILED TO FIND CONCLUSIVE COVID ORIGIN; EXPERTS SPLIT ON WHY\n\"It is unclear whether Dr. Collins or Dr. Fauci ever relayed these serious concerns to policymakers through the proper chains of command,\" the lawmakers added.",
    "\"Newly released communications suggest that Dr. Collins hoped ‘Proximal Origin’ would ‘put down’ the hypothesis that COVID-19 originated in a lab and that Dr. Collins, in fact, wanted to do more to silence this debate,\" the congressmen wrote.",
    "The lawmakers highlighted quotes from emails and letters exchanged by the seven scientists in late January and early February 2020 that suggest they suspected the coronavirus to have been manufactured rather than naturally occurring.",
    "\"Before, during and after the call, some scientists expressed grave concerns that COVID-19 may have leaked out of the Wuhan Institute of Virology and that COVID-19 may have been partially engineered,\" the lawmakers wrote.",
    "\"Continuing to shield the truth equates to hiding information that may inform future pandemic responses, advise the United States’ current national security posture, and restore confidence in our public health experts.\"",
    "The lawmakers have questioned whether the scientists were pressured to downplay the possibility that the virus was created in a lab because of political implications and the threat it posed to the scientific community.",
    "EXCLUSIVE: Three senior House Republicans investigating the origins of the coronavirus called on seven scientists to provide voluntary testimony on why their opinion regarding the origin of the virus changed.",
    "In the correspondence referenced by the congressmen, the letters note that on Feb. 4, 2020, Holmes reportedly said he was \"60-40\" in favor of the lab theory while Farrar said he was \"50-50.\"",
    "In addition to having been called for voluntary testimony, Comer, Scalise and Jordan have asked the scientists to provide all communication they have exchanged with Fauci and Collins.",
    "CLICK HERE TO GET THE FOX NEWS APP\nThe authors of the Nature Medicine report have also been asked to provide all drafts of the article prior to its publishing date.",
    "All the doctors who received letters either took part in a Feb. 1, 2020, conference call with Fauci and Collins or communicated with those who had.",
    "\"This sequence of events suggests a possible coordinated effort to conceal evidence pointing to a lab leak in Wuhan, China,\" they claimed.",
    "The report noted their \"analyses clearly show that SARS-CoV-2 is not a laboratory construct or a purposefully manipulated virus.\"",
    "But the lawmakers have taken issue with a report that appeared in Nature Medicine titled, \"The Proximal Origin of SARS-CoV-2.\"",
    "Eddie Holmes, Bob Garry, Mike Farzan \"and myself all find the genome inconsistent with expectations from evolutionary theory.\"",
    "But lawmakers want to know why the opinions of the doctors seemingly changed from their previous statements in early 2020.",
    "Farrar, Holmes, Garry, Frazan and Andersen were among the seven doctors to receive a letter from the lawmakers Thursday.",
    "The report was published on March 17, 2020, though the lawmakers in their letter allege it was written on Feb. 4, 2020.",
    "\"Transparency is a bedrock of scientific credibility,\" the lawmakers wrote.",
    "Fox News Digital could not immediately reach the scientists for comment.",
    "W. Ian Lipkin and Andrew Rambaut – who also received letters Thursday.",
    "The report was written by Andersen, Holmes and Garry, as well as Drs.",
    "Andersen reportedly said that Drs."
  ]
}