{
  "id": 2838,
  "mediaId": 2644,
  "date": "2022-02-02",
  "headline": "Classified 2016 email shows US diplomat warning of Hunter Biden deals in Ukraine",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/hunter-biden-email-warning-99.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/02/us-diplomat-warned-about-hunter-biden-ukraine-deals-in-2016/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bruce Golding",
  "authorUrl": "",
  "termIds": [
    4176,
    4474,
    4905,
    3011,
    2765,
    204,
    6678,
    6672
  ],
  "sentences": [
    "Kent recalled saying “that the real issue to my mind was that someone in Washington needed to engage VP Biden quietly and say that his son Hunter’s presence on the Burisma board undercut the anti-corruption message the VP and we were advancing in Ukraine.”\n“Ukrainians heard one message from us and then saw another set of behavior, with the family association with a known corrupt figure whose company was known for not playing by the rules in the oil/gas sector,” Kent added.",
    "In the Nov. 22, 2016, email, former State Department official George Kent, then the deputy chief of mission at the US Embassy in Ukraine, recounted a discussion in which he detailed the “saga” surrounding the graft case against Mykola Zlochevsky, a former Ukrainian natural resources minister and founder of Burisma Holdings, which paid Hunter Biden $1 million a year to sit on its board.",
    "“Because in impeachment proceedings, the American public has the right to know all the evidence.”\nUS Rep. Jim Jordan (R-Ohio) also called it “frightening” to learn that Trump “wasn’t allowed to have information that he’s entitled to have to put on his defense.”\nA State Department spokesperson said, “We do not comment on matters under litigation.”",
    "The existence of the email was never acknowledged during several court battles over Freedom of Information Act requests that sought records related to business dealings involving the first son and his father, President Biden, said the Just the News website, which published the email in its report Tuesday.",
    "Former Harvard University law professor Alan Dershowitz, who was part of Trump’s defense team, told Just the News that withholding Kent’s email was a “very serious constitutional violation” of the rule requiring that exculpatory evidence be turned over to a defendant.",
    "The report came one day after the New York Times sued the State Department for allegedly withholding emails and memos involving Hunter Biden and his former business associates that were sent to or received by officials at the US Embassy in Romania.",
    "A classified US State Department email from 2016 shows a leading diplomat warning that Hunter Biden’s lucrative job with a Ukrainian energy company “undercut” American efforts to fight corruption in the Eastern European country.",
    "His email, which was sent to former State Department official Jorgan Andrews and other people whose names are blacked out, wasn’t produced to House lawmakers during the impeachment proceedings, Just the News said.",
    "Kent’s email was classified “Confidential” by then-US Ambassador to Ukraine Marie Yovanovitch and both of them were key witnesses against former President Donald Trump during his first impeachment trial in 2019.",
    "Earlier, Kent testified behind closed doors that he raised concerns about Hunter Biden’s job with Burisma in 2015, according to reports.",
    "“And obviously, that has to apply to impeachment proceedings even more so,” Dershowitz said."
  ]
}