{
  "id": 2926,
  "mediaId": 2548,
  "date": "2022-02-02",
  "headline": "EXCLUSIVE: Kevin McCarthy Plots An Investigation Avalanche If GOP Retakes House",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/02/Photo-by-Win-McNameeGetty-Images-12312313-e1643744477921.jpg",
  "link": "https://dailycaller.com/2022/02/02/what-kevin-mccarthy-plans-investigate-speaker-republicans-win-house/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Republicans won’t stop there, according to McCarthy’s plan, they intend to go after big tech and corporate America, which his office said they “see as attacking free speech, going woke, or cozying up to China.”\n“Joe Biden promised to unite the country, but instead he has done everything in his power to divide Americans, go after his political opponents, and cover up for his failures – both at home with a costly economic policy that has grown deficits and inflation and abroad with the disastrous withdrawal in Afghanistan,” McCarthy told the Caller.",
    "(RELATED: EXCLUSIVE: House Republicans Demand Answers From AG Merrick Garland After Whistleblower Reveals Info That Contradicts Testimony)\nMcCarthy’s office mentioned Democrats blocking Republicans’ ability to offer resolutions of inquiry, which is a procedural tool that goes back to the first Congress that can be used to get information from the Executive Branch.",
    "When it comes to challenging “business as usual” inside Congress, McCarthy’s office said if McCarthy is elected Speaker on day one in office he would, abolish proxy voting and remote committee business, repeal mask mandates and the associated fines, remove the magnetometers from the House floor and re-open the Capitol to the American people.",
    "McCarthy’s office rounded out the top end of the list with pledges to investigate border policies “that have led to record illegal immigration and crime along the border” as well as how many Americans were left behind by the “decisions” that led to the “botched Afghanistan withdrawal” and 13 dead service members.",
    "Biden’s DOJ, Department of Education and COVID policies are prime targets for House Minority Leader Kevin McCarthy should Republicans retake the House in the midterms this November, according to a sprawling list of priorities his office sent exclusively to the Daily Caller.",
    "Biden has opened the border, supported mandates that have hurt students in the classroom and parental rights, allowed Big Tech to silence conservatives, and has overseen leaks of private information on American citizens under his watch,” McCarthy told the Daily Caller.",
    "(RELATED: EXCLUSIVE: McCarthy, House Republicans Call For Answers From Attending Physician Over Mask Mandate Implemented In Capitol)\n“House Democrats have advanced a plan that not only ignores addressing conservative censorship, it makes it worse.",
    "(RELATED: EXCLUSIVE: House Republicans Introduce Bill That Would Prohibit Agencies That Received COVID Funds From Issuing Vaccine Mandates)\n“Americans see Big Business drifting further away from creating jobs and building products and services.",
    "On tech companies, McCarthy’s office said they plan on providing an expedited court process with a direct appeal to the Supreme Court and hope to empower state attorneys general to help lead the charge against the tech giants to break them up.",
    "House Republicans will always speak on behalf of the people we represent, and if we earn the opportunity to serve as the majority — which is quite likely — we will fight for working Americans, period,” McCarthy’s office told the Caller.",
    "“We have already sent preservation notices and document requests and will be ready on day one to use the various tools at our disposal to get the answers Americans are demanding,” a McCarthy spokesperson told the Daily Caller.",
    "McCarthy plans to pursue answers on the origins of covid, failures in the Biden’s testing regime and continuing school closures, and the refusal of Biden health officials to accept natural immunity in its guidance.",
    "McCarthy’s office cited “politically motivated actions by the DOJ” and the Department of Education’s “collusion with the school board association to target parents as domestic terrorists” as oversight priorities.",
    "A Republican majority would use every tool at our disposal for aggressive accountability of Biden’s failures because Americans need Washington to work for them, and not the other way around,” McCarthy added.",
    "He also intends to strip Democratic Minnesota Rep. Ilhan Omar from the Foreign Affairs Committee and Democratic California Reps. Eric Swalwell and Adam Schiff off the Intelligence Committee.",
    "McCarthy slammed Biden over a number of other issues, including his unwillingness to do anything about the spike in crime, the border crisis, inflation, and vaccine mandates.",
    "“Furthermore, he’s ignored the origins of COVID and holding the Chinese government accountable while government-imposed mandates burden our economy and crush our way of life.",
    "“Democrats in Congress have skirted real accountability for too long while shielding this Administration from answering the tough questions,” a spokesperson told the Caller.",
    "In other words, former House member Jeff Landry will more effectively prosecute anti-competitive behavior than Lina Khan,” McCarthy said in a June 2021 letter to members.",
    "They’ve noticed corporate America often takes sides not because of a shared interest in our future — but for fear of cancel culture or progressive repercussions.",
    "We have more faith in elected state leaders than in the unelected federal bureaucracy, which is as ideologically homogeneous as Big Tech.",
    "McCarthy’s office told the Caller that Democrats have used the blockade on this tool 17 times, to a total number of over 600 days now.",
    "The American people deserve answers from an Administration that is not being held to account by one-party rule in Congress.",
    "McCarthy also plans on reforming the administrative state and removing obstructions that delay taking action on Big Tech.",
    "McCarthy is likely to become the Speaker of the House if Republicans can win back the House in the midterm elections.",
    "Before becoming leader, he served as House Majority Leader from 2014-2015.",
    "The entirety of President Joe Biden’s covid response is also on the table.",
    "“Biden protects liberal activists but turns a blind eye to rising crime.",
    "And their plan empowers a federal bureaucracy with no accountability.",
    "He has been leading Republicans since 2019."
  ]
}