{
  "id": 3074,
  "mediaId": 2550,
  "date": "2022-02-01",
  "headline": "Court orders Eastman to cough up records on Jan. 6",
  "image": "https://images.dailykos.com/images/1032904/story_image/GettyImages-1237552629.jpg?1643729631",
  "link": "https://www.dailykos.com/stories/2077953",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5495,
    4905,
    2765,
    2241,
    1477,
    262,
    6026
  ],
  "sentences": [
    "One of the most important pieces to emerge from that victory was a draft executive order that revealed the administration’s plan to order the seizure of voting machines and election equipment as well as appoint a special counsel to investigate claims of voter fraud all while Trump remained in power beyond Jan. 20.\nx\nx\n December 16, 2020PRESIDENTIAL FINDINGSTO PRESERVE COLLECT AND ANALYZE NATIONAL SECURITY INFORMATIONREGARDING THE 2020 GENERAL ELECTIONBy the authority vested in me as President of the United States pursuant to the Constitution andlaws of the United States of America, including Article 2 section 1 of the U.S. Constitution,Executive Orders 12 ??",
    "?ere is probable causeto ?nd these systems bear the same crucial code \"features\" and defects that allowed the sameoutside and foreign interference in our election, in which there is probable cause to ?nd voteswere in fact altered and manipulated contrary to the will of the voters.Dominion Voting Systems is based in Toronto, Canada, and assigns its intellectual propertyincluding patents on its ?rmware and so?ware to Hong Kong and Shanghai Bank Corporation(HSBC), a bank with its foundation in China and its current headquarters in London, UnitedKingdom.",
    "(7)\n ?e appointment of a Special Counsel to oversee this operation and institute all criminaland civil proceedings as appropriate based on the evidence collected and provided all resourcesnecessary to carry out her duties consistent with federal laws and the Constitution.-------------------------------------------------------------DONALD J. TRUMPPRESIDENT OF THE UNITED STATES\nMillions of books, audiobooks, magazines, documents, sheet music, and more for free.",
    "(NBA), and section ?01 of title ?, United States Code:I, Donald J. Trump, President of the United States, ?nd that the forensic report of the AntrimCounty, Michigan voting machines, released December 1?, 2020, and other evidence submi?edto me in support of this order, provide probable cause su?cient to require action under theauthorities cited above because of evidence of international and foreign interference in theNovember ?, 2020, election.",
    "PRESENT: THE HONORABLE DAVID O. CARTER, JUDGE Kelly Davis Not Present Courtroom Clerk Court Reporter ATTORNEYS PRESENT FOR PLAINTIFF: None Present ATTORNEYS PRESENT FOR DEFENDANT: None Present\n PROCEEDINGS (IN CHAMBERS): ORDER RE: JANUARY 31, 2021 STATUS CONFERENCE\n The Court held a Status Conference with the parties on Monday, January 31, 2022, to discuss the progress of document review and production.",
    "Co?ee County Georgia has refused to certify its result.Accordingly, I hereby order:\n (1)\n E?ective immediately, the Secretary of Defense shall seize, collect, retain and analyze allmachines, equipment, electronically stored information, and material records required forretention under United States Code Title 42, Sections 1?74-1?74(e), including but not limited tothose identi?ed in footnote 1.",
    "?e modality of the BMD systems'\n capacity to deprive voters of theircast votes without burden, long wait times, and\n insecurity regarding how their votes are actually cast and recorded in the unveri?ed QR\n code makes the potential constitutional deprivation less transparently visible as well, at\n least until any portions of the system implode because of system breach, breakdown, or\n crashes.",
    "Every defect and hazard of which Judge Totenberg warned happened in Georgia.Witnesses in Georgia have provided evidence of crashes, the replacement of a server,impermissible updates to the system, connections to the internet, and both Co?ee and Warecounties have identi?ed a signi?cant percentage of votes being wrongly allocated contrary to the\n will of the voter.",
    "?ere is also probable cause to ?nd that Dominion Voting Systems, Smartmatic, ElectronicSystems & So?ware, and Hart Inter Civic, Clarity Election Night Reporting, Edison Research,Sequoia, Scytl, and similar or related entities, agents or assigns, have the same ?aws and weresubject to foreign interference in the 2020 election in the United States.",
    "Though the Los-Angeles based judge noted to the House general counsel that his previous order to Eastman did not lay out instructions for how to prioritize the records, he agreed to expedite the review process anyway, narrowing the scope of Eastman’s records production to just those documents dated from Jan. 4 to Jan. 7, 2021.",
    "2017) Just days prior to the election of November ?, 2020, federal Judge Totenberg found, a?er threedays of testimony including by Dominion executive Eric Coomers:?ere are \"true risks posed by the new BMD [Ballot Marking Device of Georgia'sDominion Voting Systems] voting system as well as its manner implementation.",
    "Insurrection investigators only recently secured an order from a federal judge in California that forced Eastman to produce no less than 1,500 pages of records per day—all of which are sourced from a 19,000-page tranche obtained by a committee subpoena sent to Eastman’s ex-employer, Chapman University.",
    "Alexander was responsible for organizing the ‘Stop the Steal’ movement and told investigators during his own closed-door deposition that he communicated with a variety of House Republicans before the insurrection including Rep. Mo Brooks of Alabama and Reps. Paul Gosar and Andy Biggs of Arizona.",
    "But even with Judge Carter’s order of 1,500 pages per day reviewed—including a daily log itemizing any documents Eastman wishes to assert privilege over—Letter stressed it would simply take too long for the Trump ally to get materials of the most critical interest to the committee.",
    "While Trump often aired his frustrations with Pence in the open—including when he tweeted at him during the attack and suggested the assault would not have happened if Pence had the “courage” to stop the certification—the committee’s work in obtaining the Jordan text was vital.",
    "The messages showed, among other things, the desperate pleas that flowed into the White House like so much water on Jan. 6 from Trump’s family, White House aides, and even news personalities who wanted him to quell the violence exploding mere blocks away from the White House.",
    "?e stealth vote alteration or operational interference\n risks posed by malware that can be e?ectively invisible to detection, whether\n intentionally seeded or not, are high once implanted, if equipment and so?ware systems\n are not properly protected, implemented, and audited.",
    "(3)\n ?e Director of National Intelligence shall deliver this assessment and appropriatesupporting information to the President, the Secretary of State, the Secretary of the Treasury, the\n Secretary of Defense, the A?orney General, and the Secretary of Homeland Security.",
    "The Jan. 6 Committee is pushing hard and fast for records belonging to John Eastman, the ex-adviser to Donald Trump who once authored legal memos outlining a scheme to overturn the results of the 2020 election following the 45th president’s defeat by Joe Biden.",
    "The committee has so far conducted over 400 interviews and has made major gains amassing evidence that will eventually culminate into public hearings, a final report and if criminal conduct is discovered, possible indictments from the appropriate enforcers.",
    "Accordingly, the Court\n ORDERS\n that Dr. Eastman first review documents between\n Case 8:22-cv-00099-DOC-DFM Document 63 Filed 01/31/22 Page 1 of 2 Page ID #:561\n UNITED STATES DISTRICT COURT CENTRAL DISTRICT OF CALIFORNIA CIVIL MINUTES – GENERAL\n Case No.",
    "All of this in combination with Letter’s narrowed and expedited review request could indicate that the committee may not be so deeply reliant on Eastman’s complete email records during his time at Chapman University because it has what it needs elsewhere.",
    "He also offered a warning for the Jan. 6 committee: “The court is not inclined to look favorably on further requests for reviewing specific dates out of order.”\nEastman is expected to produce progress reports each Monday until the review is complete.",
    "The committee has also secured interviews from individuals like Alex Jones and Ali Alexander, just two of the many right-wing extremists that so often orbited the administration and regularly promoted misinformation about the 2020 election results.",
    "One such record was a text from Rep. Jim Jordan of Ohio to Meadows that advocated for then-Vice President Mike Pence to “call out all electoral votes he believes are unconstitutional as no electoral votes at all.”\nPence did not have that power.",
    "And though Alex Jones has invoked his Fifth Amendment right when meeting with the committee for deposition, he has kept a pathway open for investigators to come calling again by sharing his “unofficial testimony” with listeners of his podcast.",
    "Though the order narrows the production to just three days in January, because Chapman University agreed to turn over all of the documents when first subpoenaed, the panel can review materials from an earlier point at a later time.",
    "By 5:00 pm PST tomorrow, February 1, the Court\n ORDERS\n the parties to file a written stipulation memorializing the exact terms of their agreement and the specific search terms, email senders, and/or email recipients to exclude.",
    "In fact, there is probable cause to ?nda massive cyber-a?ack by foreign interests on our crucial national infrastructure surrounding our\n election––not the least of which was the hacking of the voter registration system by Iran.",
    "MINUTES FORM 11 CIVIL-GEN Initials of Deputy Clerk: kd\n Case 8:22-cv-00099-DOC-DFM Document 63 Filed 01/31/22 Page 2 of 2 Page ID #:562\nMillions of books, audiobooks, magazines, documents, sheet music, and more for free.",
    "?e report found the election management system to be wrought\n with unacceptable andunlawful vulnerabilities––including access to the internet––probable\n cause to ?nd evidence of fraud, and numerous malicious actions.",
    "?e insularityof the Defendants' and Dominion's stance here in evaluation and management of thesecurity and vulnerability of the BMD system does not bene?t the public or citizens'con?dent exercise of the franchise.",
    "First reported by Politico Monday night, during a federal court hearing with Judge David Carter, it was House of Representatives general counsel Douglas Letter who urged the judge to hasten Eastman’s production.",
    "\"Still, this is year one for Georgia in implementation of this new BMD system as the ?rststate in the nation to embrace statewide implementation of this QR barcode-based BMDsystem for its entire population.",
    "The Select Committee’s request is reasonable in light of the unexpectedly large volume of documents produced and the critical relevance of the time period to the investigation,’ Judge Carter wrote Monday.",
    "Those reports must include the number of pages he has reviewed and the number of documents he is sending to the select committee as well as the number of documents he wants to assert privilege over.",
    "?e forensic reportprepared by experts found that \"the Dominion Voting System is intentionally and purposefullydesigned with inherent errors to create systemic fraud and in?uence election results.",
    "The update should include the number of pages and the number of documents transmitted to the Select Committee, and the number of pages and the number of documents where a privilege was asserted.",
    "Additionally, cooperation from other witnesses like Pence’s national security adviser Keith Kellogg, has corroborated public reporting about what unfolded in the White House during the breach.",
    "Carter Order for John Eastman Records Production for Jan 6 committee by Daily Kos on Scribd\nx\nx\n UNITED STATES DISTRICT COURT CENTRAL DISTRICT OF CALIFORNIA CIVIL MINUTES – GENERAL\n Case No.",
    "That cooperation has featured the significant production of some 9,000 pages of records from Trump’s former chief of staff Mark Meadows before he abruptly ended his compliance last year.",
    "While Bannon has already been indicted by the DOJ for his refusal to cooperate and now awaits trial this summer, Attorney General Merrick Garland has yet to issue a decision on Meadows.",
    "The Select Committee’s request is reasonable in light of the unexpectedly large volume of documents produced and the critical relevance of the time period to the investigation.",
    "Other records obtained have cast light on the intimate role certain sitting lawmakers had in pushing Trump’s conspiracies about the 2020 election with White House officials.",
    "Meadows, like Steve Bannon before him, was referred to the Department of Justice for contempt of Congress after ending his cooperation with the committee abruptly last year.",
    "Download this PDF\nof 3\nView on Scribd\nUnpublished Trump Draft EO ... by Daily Kos\nThe probe has received cooperation from several dozen witnesses it has called forward, too.",
    "At the hearing, the Select Committee requested for the third time that Dr. Eastman begin his production with documents dated between January 4, 2021 and January 7, 2021.",
    "The original subpoena to Chapman University from the Jan. 6 Committee cast an extensive net with a request for records created from Nov. 3, 2020, to Jan. 20, 2021.",
    "Multipleexpert witnesses and cyber experts identi?ed acts of foreign interference in the election prior toNovember ?, 2020 and continued in the following weeks.",
    "The panel has already obtained 770 pages of Trump’s presidential records from the National Archives after he tried to keep them hidden for months but failed.",
    "Dr. Eastman’s privilege logs shall be filed on PACER as a PDF and emailed to the Court and the Select Committee as an Excel spreadsheet for ease of analysis.",
    "“Although Dr. Eastman objected to this request, he has failed to point to any prejudice to him that would result from reviewing the documents in this order.",
    "Although Dr. Eastman objected to this request, he has failed to point to any prejudice to him that would result from reviewing the documents in this order.",
    "SA CV 22-00099-DOC-DFM Date: January 31, 2022 Page 2\n January 4, 2021, and January 7, 2021, and then resume reviewing the documents in chronological order.",
    "The parties orally stipulated on the record that Dr. Eastman does not need to produce any newspaper articles or communications with his family members.",
    "Any operational shortcuts now in se?ing up or running election equipment or\n so?ware creates other risks that can adversely impact the voting process.",
    "Given the masking nature of malware and the current systems described here, if the State and Dominion simply standby and say, \"we have never seen it.\"",
    "(6)\n ?e Assistant Secretary of Defense for Homeland Security will coordinate supportrequirements as needed from the Department of Homeland Security.",
    "(2)\n Within 7 days of commencement of operations, the initial assessment must be provided to the O?ce of the Director of National Intelligence.",
    "?e ?nal assessment must be provided to the O?ce of the Director of National Intelligence no later than 60 days from commencement of operations.",
    "At 1,500 pages per day, it could take roughly 13 weeks for Eastman to complete production if he were to start all the way back on Nov. 3, 2020.",
    "The Select Committee agreed to add one column to Dr. Eastman’s privilege log with a brief description of the objection, if any, to each entry.",
    "\"?e Plainti?s' national cybersecurity experts convincingly present evidence that this isnot a question of \"right this actually ever happen?\"",
    "The Select Committee’s objections shall be filed in PDF format on PACER and emailed to the Court and Dr. Eastman as an Excel spreadsheet.",
    "Dominion Voting Systems and related companies are owned orheavily controlled and in?uenced by foreign agents, countries, and interests.",
    "Kellogg, for instance, recently told investigators it was Ivanka Trump who regularly witnessed her father’s demeanor during the attack.",
    "?e Secretary of Defense has discretion to determine the interdiction of national critical infrastructure supporting federal elections.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "He has so far refused and the committee is still weighing how to legally navigate a subpoena to a fellow sitting lawmaker.",
    "?e intentional errors lead\n to bulk adjudication of ballots with no oversight, no transparency, and no audit trail.",
    "(IEEPA) and allapplicable Executive Orders derived therefrom, the National Emergencies Act (50 U.S.C.160?1et seq.)",
    "Full or not, his cooperation nonetheless helped unearth text messages that were sent to Meadows during the attack.",
    "“That’s useless… it completely defeats the subpoena,” Letter said during Monday’s videoconference court hearing.",
    "(5)\n ?e Secretary of Defense may select by name or by unit federalization of appropriateNational Guard support.",
    "Those records include call logs, diaries, draft speeches, visitor logs, digital correspondence, and much more.",
    "The Court is not inclined to look favorably on further requests for reviewing specific dates out of order.",
    "It served as a strong example of how far-reaching the internal pressure campaign on Pence had become.",
    "Investigators did not officially subpoena Jordan but asked him to comply voluntarily with the probe.",
    "It issued similar requests to Rep. Scott Perry of Pennsylvania and GOP House Leader Kevin McCarthy.",
    "SA CV 22-00099-DOC-DFM Date: January 31, 2022 Title:\n JOHN C. EASTMAN V. BENNIE G. THOMPSON ET AL.",
    "Dr. Eastman shall remain responsible for reviewing and processing 1500 pages per business day.",
    "(4)\n A direct liaison to be authorized to coordinate as required between the applicable U.S.",
    "A spokesperson for the committee would not comment Tuesday on any materials it has received.",
    "She was the only person who officials, including Kellogg, believed could get Trump to act.",
    "The search terms or email addresses may be redacted to protect the privacy of non-parties.",
    "At the hearing, the parties also agreed to several adjustments to the production process.",
    "Every Monday, Dr. Eastman shall file a brief update about the previous week’s progress.",
    "Electoral dysfunction - cyber or otherwise - should notbe desired as a mode of proof.",
    "- but *when it will happen,especially if further protective measures are not taken.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "?ese\n risks are neither hypothetical nor remote under the current circumstances.",
    "?e system\n intentionally generates an enormously high number of ballot errors.",
    "Eastman, after all, met with Meadows and Pence on Jan. 4 in the White House.",
    "The Court sets a Status Conference for Monday, February 14, at 1:00 pm PST.",
    "Based on the parties’ representations, the Court\n ORDERS\n as follows: 1.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "The Court’s PACER system does not currently accept Excel spreadsheets.",
    "Download this PDF\nof 2\nView on Scribd\nIf they even need them, that is.",
    "?e Dominion Voting system is owned and controlled by foreign entities.",
    "and 21, theInternational Emergency Economic Powers Act (50 U.S.C.",
    "?-AT Document ?64 Filed 10/11/20 Page 146 of 147]And, yet it did.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Designated locationswill be identi?ed in the operation order.",
    "It may well land unfortunately on the State's doorstep.",
    "The Clerk shall serve this minute order on the parties.",
    "?4?, National Security Presidential Memoranda 1?",
    "?is leads\n to voter or election fraud.\"",
    "Eastman’s next day in court is Feb. 14.",
    "This is a short blurb about Daily Kos.",
    "?e\n Court certainly hopes not.\"",
    "[FOOTNOTE 1: Case 1:17-cv-02 ??",
    "the future does not bode well.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Departments and Agencies.",
    "Daily Kos is different.",
    "Please read it.",
    "?00 of May 11.",
    "1701 et seq.)",
    "?, 1?",
    "(B.O.",
    "1?",
    "4.",
    "3.",
    "2."
  ]
}