{
  "id": 3154,
  "mediaId": 6404,
  "date": "2022-02-03",
  "headline": "Rep. Jim Jordan: Biden’s Handling Of The Southern Border Could Lead To His Impeachment",
  "image": "https://americanlookout.com/wp-content/uploads/2019/04/Jim-Jordan-on-Hannity.jpg",
  "link": "https://americanlookout.com/rep-jim-jordan-bidens-handling-of-the-southern-border-could-lead-to-his-impeachment/",
  "mediaOutlet": "americanlookout.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike LaChance",
  "authorUrl": "https://americanlookout.com/author/aleister/",
  "termIds": [
    0
  ],
  "sentences": [
    "Breitbart News reports:\nExclusive — Rep. Jim Jordan: Joe Biden’s ‘Deliberate’ Support of Illegal Immigration Could Lead to Impeachment\nRep. Jim Jordan (R-OH) said on Wednesday’s edition of the Breitbart News Daily podcast that President Joe Biden’s “deliberate” and “intentional” facilitation of illegal immigration across the southern border by millions of foreign nationals may lead to impeachment if Republicans win majorities in Congress.",
    "“It is intentional, and the idea that they’re doing it in the dark of the night so that that the country doesn’t fully know and see what’s going on is wrong … This is deliberate, what they’re doing.”\nTrending: Steve Hilton: The Idea Of A Second Term For Joe Biden Is Absurd And Offensive (VIDEO)\nBiden has completely abandoned his responsibility to protect America’s borders.",
    "It’s intentional.”\nThe Ohio representative said impeaching the president “is something that our conference is going to have to look at closely and make a decision on, but it’ll be a conference-wide decision” if Republicans secure a majority in the House of Representatives.",
    "Jordan remarked, “When you intentionally allow 1.9 million people in one year’s time to come across your border, there’s no other way you can interpret this other than it’s deliberate.",
    "There’s so much in the news these days, it’s easy to forget that we still have a full-blown crisis happening at the border.",
    "“It is so big and it is deliberate,” Jordan said of the status quo of illegal immigration across the U.S.-Mexico border.",
    "Rep. Jim Jordan of Ohio recently said that Biden’s handling of the border could lead to his impeachment.",
    "Millions of Americans would agree with this.",
    "Biden deserves to be impeached for this."
  ]
}