{
  "id": 3196,
  "mediaId": 6621,
  "date": "2022-01-28",
  "headline": "‘RELEASE THE TRANSCRIPT’: GOP Demands Biden-Zelensky Call Transcript, 'Joe Asked Trump to Do It!'",
  "image": "https://hannity.com/wp-content/uploads/2022/01/GettyImages-1358113820.jpg",
  "link": "https://hannity.com/media-room/release-the-transcript-gop-demands-biden-zelensky-call-transcript-joe-asked-trump-to-do-it/?utm_source=rss&utm_medium=rss&utm_campaign=release-the-transcript-gop-demands-biden-zelensky-call-transcript-joe-asked-trump-to-do-it",
  "mediaOutlet": "The Sean Hannity Show",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2119,
    2765,
    3702,
    4905,
    1119,
    1126,
    6672
  ],
  "sentences": [
    "President Biden noted the United States has provided Ukraine with over half a billion dollars in development and humanitarian assistance in the last year and is exploring additional macroeconomic support to help Ukraine’s economy amidst pressure resulting from Russia’s military build-up.",
    "#ReleaseTheTranscript\n— Rep. Jim Jordan (@Jim_Jordan) January 28, 2022\nThe White House released the following statement on the call:\n“President Joseph R. Biden, Jr. spoke today with President Volodymyr Zelenskyy of Ukraine.",
    "#ReleaseTheTranscript https://t.co/rH3PDsitOX\n— House Republicans (@HouseGOP) January 28, 2022\nRep. Jim Jordan (R-OH) is also eager to see the transcript, and wonders where’s a whistleblower when you need one.",
    "The leaders discussed coordinated diplomatic efforts on European security, underscoring the principle of “nothing about Ukraine without Ukraine.”\nBut they’re still not releasing the transcript.",
    "House Republicans are calling on the Biden Administration to release the transcript of the phone call between President Joe Biden and Ukrainian President Volodymyr Zelensky.",
    "President Biden made clear that despite the departure of American family members of embassy personnel, the U.S. Embassy in Kyiv, remains open and fully operational.",
    "President Biden reaffirmed the readiness of the United States along with its allies and partners to respond decisively if Russia further invades Ukraine.",
    "#ReleaseTheTranscript,” they said on Twitter, sharing an old clip of Biden demanding Trump release his transcript with Zelensky.",
    "Initial leaked reports say the call didn’t go well, which the White House and the Ukrainian government deny.",
    "He also underscored the commitment of the United States to Ukraine’s sovereignty and territorial integrity.",
    "#ReleaseTheTranscript”\nBiden/Zelensky call:\nWhere’s the anonymous “whistleblower” when you need him?",
    "Well there’s one way to be sure, according to House Republicans: release the transcript.",
    "“Biden/Zelensky call: Where’s the anonymous “whistleblower” when you need him?",
    "“Now it’s your turn @JoeBiden.",
    "Now it’s your turn @JoeBiden."
  ]
}