{
  "id": 3678,
  "mediaId": 2553,
  "date": "2022-01-24",
  "headline": "Liz Cheney Destroyed In Wyoming GOP Straw Poll By Trump-Backed Candidate",
  "image": "https://dw-wp-production.imgix.net/2022/01/Untitled-design-17-3.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/liz-cheney-destroyed-in-wyoming-gop-straw-poll-by-trump-backed-candidate",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dillon Burroughs",
  "authorUrl": "https://www.dailywire.com/author/dillon-burroughs",
  "termIds": [
    2119,
    3246,
    2887,
    2765,
    4905,
    4066,
    1616,
    1126,
    6738,
    6018
  ],
  "sentences": [
    "“In February, the Wyoming GOP central committee voted overwhelmingly to censure Cheney, Wyoming’s lone U.S. representative, for voting to impeach Trump.”\nThe Daily Wire previously reported on Trump’s endorsement of Hageman in September:\nFormer President Donald Trump on Thursday endorsed Wyoming attorney Harriet Hageman in her expected primary challenge against Republican Rep. Liz Cheney.",
    "Harriet Hageman adores the Great State of Wyoming, is strong on Crime and Borders, powerfully supports the Second Amendment, loves our Military and our Vets, and will fight for Election Integrity and Energy Independence (which [President Joe] Biden has already given up).",
    "“The 31-29 vote Saturday in Buffalo, Wyoming, by the state party central committee followed votes by local GOP officials in about one-third of Wyoming’s 23 counties to no longer recognize Cheney as a Republican,” the Associated Press reported.",
    "In addition, Cheney accepted an invitation to serve on House Speaker Nancy Pelosi’s (D-CA) House select committee on January 6, despite House Minority Leader Kevin McCarthy (R-CA) rejecting his party’s involvement.",
    "McCarthy objected to Republicans being involved in the committee after Pelosi rejected two of his recommended House members from participating on the committee: Ohio Rep. Jim Jordan and Indiana Rep. Jim Banks.",
    "“I strongly endorse Republican House of Representatives Candidate Harriet Hageman from Wyoming who is running against warmonger and disloyal Republican, Liz Cheney,” Trump said in a statement.",
    "The state’s primary is scheduled for August, leaving seven months for Hageman to continue building support to unseat the reigning congresswoman known for her anti-Trump views.",
    "Make America Great Again!”\nThe Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "“The only elections that matter are in August and November,” Jeremy Adler, a spokesperson for the Cheney campaign, said in response to the Star-Tribune news.",
    "The committee moved forward without McCarthy’s support, despite the original plans to include at least five Republicans on the 13-member committee.",
    "Wyoming Republican Rep. Liz Cheney was soundly defeated in a state GOP straw poll by Trump-endorsed candidate Harriet Hageman on Saturday.",
    "“Harriet is a fourth-generation daughter of Wyoming, a very successful attorney, and has the support and respect of a truly great U.S.",
    "Cheney was one of 10 House Republicans to vote in favor of impeaching former President Donald Trump after the actions of January 6.",
    "Cheney soon joined the group, later followed by Illinois Republican Rep. Adam Kinzinger, who also voted to impeach Trump.",
    "Harriet has my Complete and Total Endorsement in replacing the Democrats number one provider of sound bites, Liz Cheney.",
    "It’s not an endorsement, but these are the county activists” Hageman told the Star-Tribune after the vote.",
    "The Wyoming Republican Party voted in November to stop recognizing Cheney as a member of the party.",
    "A spokesperson for Cheney offered a brief response to the report.",
    "A total of 74 total votes were cast in the secret straw poll.",
    "Unlike RINO Liz Cheney, Harriet is all in for America First.",
    "Get inside access to The Daily Wire by becoming a member.",
    "Hageman defeated Cheney in a 59 to six vote.",
    "Senator, Wyoming’s own Cynthia Lummis.",
    "“I think it’s a good sign."
  ]
}