{
  "id": 3752,
  "mediaId": 2641,
  "date": "2022-01-20",
  "headline": "Trump: Rift With Gov. DeSantis 'Totally Fake News'",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=57a000dd-bd57-4352-9f99-d96b99360b3f&SiteName=Newsmax",
  "link": "https://www.newsmax.com/us/ron-desantis-2024-presidential-candidate/2022/01/20/id/1053351/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Mack",
  "authorUrl": "",
  "termIds": [
    1679,
    2765,
    514,
    1127
  ],
  "sentences": [
    "\"It's totally fake news,\" Trump told Fox News' \"Hannity\" on Thursday night, refuting any talk of a rift between the top 2024 GOP presidential contenders.",
    "\"I think Ron said last week, he said it very publicly, 'The press is never going to get in the middle of my friendship with Donald Trump.",
    "Trump noted DeSantis was a House member when he first entered the Oval Office, and helped push him to the governor's mansion in 2018.",
    "DeSantis is running for reelection as governor of Florida this year, making any 2024 presidential ticket talk premature.",
    "Ron DeSantis and former President Donald Trump, but the former president considers it a push of politics of division.",
    "The Republicans really stuck together, and it was a great thing and Ron was one of them.",
    "I have a very good relationship with Ron and intend to have it for a long time.\"",
    "\"Ron wanted to run and I endorsed him, and that helped him greatly.",
    "\"Ron was very good on the [special counsel Robert] Mueller hoax.",
    "I thought that was very interesting, actually, and very nice.",
    "He was right up front with Jim Jordan and all of the others.",
    "The media has pitched a rift between Florida GOP Gov.",
    "He has gone on and done a terrific job in Florida.",
    "Ron has been a friend of mine for a long time.\"",
    "But he said that, and I agree with him 100%.",
    "\"I get along great with Ron,\" Trump said.",
    "We're not going to do that stuff.'",
    "\"And he said it very strongly.",
    "He was fantastic."
  ]
}