{
  "id": 3785,
  "mediaId": 2663,
  "date": "2022-01-20",
  "headline": "The Jan. 6 committee wants to speak with Ivanka and things are about to get ugly",
  "image": "https://adabgmwwup.cloudimg.io/v7/_queerty-prodweb_/2022/01/GettyImages-1205785186.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1200&h=630&wat=1&wat_gravity=southeast&wat_pad=70",
  "link": "https://www.queerty.com/jan-6-committee-wants-speak-ivanka-things-get-ugly-20220120",
  "mediaOutlet": "Queerty ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Graham Gremore",
  "authorUrl": "https://www.queerty.com/author/graham-gremore",
  "termIds": [
    0
  ],
  "sentences": [
    "— Mayo (@Mayoisstillspi1) January 20, 2022\nNoteworthy excerpts from the US House Jan 6 Committee letter to Ivanka Trump:\n\"The President was, according to one account, \"stubborn\" and staff recognized that you may be the only person who could persuade him\"\n— Scott MacFarlane (@MacFarlaneNews) January 20, 2022\nJUST IN: Ivanka Trump spotted at Louis Vuitton getting something fashionable for her PerpWalk.",
    "CNN reports:\nA key investigative thread the panel wishes to discuss further with Ivanka Trump is her knowledge of her father’s efforts to try and stop the certification of the 2020 presidential election and the specific pressure campaign that he enacted on former Vice President Mike Pence to bend to his will.",
    "Related: The Jan. 6 committee has Kimberly Guilfoyle’s phone records and everyone is thinking the same thing\nA spokesperson for the former first daughter hinted that she doesn’t intend to comply, saying, “Ivanka Trump just learned that the January 6 Committee issued a public letter asking her to appear.",
    "The panel said Ivanka was privy to a telephone conversation between her father and Pence on the morning of January 6 where her father tried to convince Pence to impede the certification of the 2020 presidential election, where she could only hear her father’s side of the conversation.",
    "(@joncoopertweets) January 20, 2022\nJanuary 6 Committee to Ivanka Trump: \"We are particularly interested in this question: Why didn't White House staff simply ask the President to walk to the briefing room and appear on live television—to ask the crowd to leave the Capitol?\"",
    "Related: Holy crap, Ivanka’s legal troubles just got way, way worse\nThe letter was publicly released hours ago and requests the former handbag designer/senior White House adviser cooperate with the committee’s ongoing investigation by coming in to answer a few questions.",
    "It seems highly unlikely Ivanka will cooperate with the investigation, even if she’s subpoenaed, which would be the next committee’s next move if she doesn’t respond to the letter.",
    "— January 6th Committee (@January6thCmte) January 20, 2022\nThe fact that Ivanka is being called upon is major signal that the panel closing in on Donald Trump‘s inner circle.",
    "In a letter to Ms. Trump seeking a voluntary interview, Chair @BennieGThompson underscored evidence that Trump was in direct contact with the former President on Jan 6th.",
    "'”\nMeanwhile, here’s what Twitter has to say about the whole thing…\nShould the January 6 Committee SUBPOENA Ivanka Trump instead of asking her nicely?",
    "Ivanka Trump received a letter this morning from the House select committee investigating January 6 and they’d like to have a few words with her.",
    "— Steve Hofstetter (@SteveHofstetter) January 20, 2022\nThe J6 Committee expects to “ask” Ivanka Trump to cooperate with their investigation.",
    "— John \"Not Much Fun At Parties\" Henry (@JohnHenry_US) January 20, 2022\nGraham Gremore is the Features Editor and a Staff Writer at Queerty.",
    "— Uncovering The Truth (@UncvrngTheTruth) January 20, 2022\nREMINDER: Ivanka Trump thought she was going to be the first woman president.",
    "— Ryan Struyk (@ryanstruyk) January 20, 2022\nBREAKING: The January 6th committee asked Ivanka Trump for an interview.",
    "As she publicly stated that day at 3:15pm, ‘any security breach or disrespect to our law enforcement is unacceptable.",
    "— 888 Good Troubles (@LebergerDavid) January 20, 2022\nIvanka Trump responds to Jan 6 committee, \"New phone, who dis?\"",
    "She's going to try to make it in between her busy schedule of stealing from charities and committing treason.",
    "The Select Committee is requesting that Ivanka Trump provide information for the committee’s investigation.",
    "(@NotHoodlum) January 20, 2022\nDear Ivanka Trump, please give the Jan 6 committee your testimony.",
    "As the Committee already knows, Ivanka did not speak at the January 6 rally.",
    "Stop “asking” terrorists to turn themselves in.",
    "You asked Kevin McCarthy, he declined.",
    "Follow him on Twitter @grahamgremore.",
    "The violence must stop immediately.",
    "You asked Jim Jordan, he declined.",
    "You asked Hannity, he declined.",
    "Start sending Subpoenas.",
    "Please be peaceful.",
    "It’s voluntary.",
    "— Jon Cooper ??",
    "Wake up, Dems!",
    "Be a patriot.",
    "— Hoodlum ??",
    "Gulp.",
    "?"
  ]
}