{
  "id": 3841,
  "mediaId": 2634,
  "date": "2022-01-24",
  "headline": "The Case for Impeaching Clarence Thomas",
  "image": "https://images.newrepublic.com/0948e5b3e09268b310350590b1ba27a25486c97f.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg",
  "link": "https://newrepublic.com/article/165118/clarence-thomas-impeachment-case-democrats",
  "mediaOutlet": "New Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Tomasky",
  "authorUrl": "https://newrepublic.com/authors/michael-tomasky",
  "termIds": [
    2342,
    2132,
    2765,
    5400,
    5503,
    1269,
    6159,
    6709
  ],
  "sentences": [
    "The Democrats and their allies aren’t powerless on this matter, and here are some moves they should make:\nFirst, activist lawyers on the liberal side should file recusal demands of Thomas on every single case in which Ginni Thomas or any organization she’s affiliated with has any kind of involvement (where she or the affiliated group has taken a public position, for example).",
    "Ginni is involved with numerous far-right organizations and schemes that take very public positions on court decisions across a range of social and political issues, such as last week’s 8–1 holding that Donald Trump could not block the release of documents related to the January 6, 2021, insurrection.",
    "This first occasion was back in 2000, in a case Mayer doesn’t even go into, when it was revealed after that election that as a Heritage Foundation staffer, Ginni was screening résumés for the incoming Bush administration while the nation awaited a ruling from the court on the Florida recount.",
    "So for 20 years, Ginni Thomas has been operating in the white-hot center of far-right activist circles, involved in everything from Obamacare to abortion rights to same-sex marriage to you name it—all issues that have come before her husband.",
    "Corporate interests in recent years have flooded the court with amicus briefs that create the appearance of huge groundswells of support for a certain position, but often they’re all backed by the same dark-money outfits.",
    "A more honorable man would recuse himself from all such cases or indeed quietly ask his spouse to find another, less incendiary line of work that has no impact on the appearance of her husband’s ethical standards.",
    "In a sane world, Jane Mayer’s excellent piece on Ginni Thomas in The New Yorker would set off a series of events that would lead to her husband Clarence Thomas’s impeachment and removal from the Supreme Court.",
    "Finally, there are giant loopholes in the financial disclosure rules for justices, such that a spouse can take in money from a source that has an amicus brief before the court, and no one knows it.",
    "It’s just the most recent example where she has been involved in activities that directly or indirectly place her activism before the court, and her husband does not care how corrupt it looks.",
    "If there were a liberal justice on the court with a spouse who was involved in every major ideological battle of our time, you can be sure the following process would have played out:\n1.",
    "The select committee on January 6 could ask her to testify and, once she refuses, subpoena her, which would require her husband to recuse himself on all January 6–related matters.",
    "A decade later, when the first major Obamacare case came before the court, it was widely noted that Ginni’s group, Liberty Central, called the law a “disaster” and urged repeal.",
    "They probably would have impeached the justice, knowing that it would fail in the Senate but would tarnish said justice and any precedent of which he or she was a part.",
    "There are a number of proposals and recommendations, some laid out in this Brennan Center report, that would impose various ethics and disclosure rules on the court.",
    "Right now, the nine justices of the Supreme Court are the only federal judges in the land not bound by the Code of Conduct for U.S. judges.",
    "They somehow can’t see that in saving it, they are destroying it, and none of them more so than Clarence Thomas and his nonexistent ethics.",
    "And in the first one, he was part of the 5–4 majority in Bush v. Gore, one of the most self-discrediting decisions in the court’s history.",
    "The Supreme Court justice refuses to recuse himself from cases in which his right-wing activist wife, Ginni, has a clear interest.",
    "Ginni Thomas got more than $200,000 from one person who had a brief in front of the court, and only the Thomases knew about it.",
    "Second, Democrats in Congress should push harder for the Supreme Court to adopt a judicial code that justices have to follow.",
    "This amounts to lobbying, by people like Ginni Thomas’s friends and allies and fellow board members and prize recipients.",
    "Fox News and other right-wing media would have picked it up and turned the spouse into a symbol of liberal corruption.",
    "If the Republicans retake the House this November, the chairman of the Judiciary Committee is going to be Jim Jordan.",
    "His wife sat on the advisory board of a group that sent busloads of insurrectionists to Washington on January 6.",
    "The House Judiciary Committee could hold hearings into Ginni’s organization and associations.",
    "Here, again, we see the difference between the two parties and their broader solar systems.",
    "These are made public on financial disclosure forms, but typically with very little detail.",
    "Liberal justices also have taken lavish junkets paid for by ideological organizations.",
    "Once in the majority, House Republicans would have held hearings and issued reports.",
    "A poll last year on individual justices’ approval ratings is even more interesting.",
    "The conservatives were all in negative territory, except Samuel Alito, who was +1.",
    "Third, something needs to be done to rein in the proliferation of amicus briefs.",
    "They think they’re saving the republic from godless heathens like you and me.",
    "Some back-bench members of Congress would have started raising the issue.",
    "This will at least keep the issue in the news and the spotlight on them.",
    "Public approval of the Supreme Court is down to 40 percent, a new low.",
    "The three liberal justices were all above water by six to 10 points.",
    "Democrats, it’s long past time to make an issue of him and his wife.",
    "That would be hugely controversial, so they probably won’t do it.",
    "The Democrats likely don’t have the gumption to do this.",
    "He’s probably going to lead an impeachment of Joe Biden.",
    "Think he’ll be cowed because it’s hugely controversial?",
    "In addition, she cheered the insurrection on Facebook.",
    "There was pressure then on Thomas to recuse himself.",
    "This is not just a right-wing problem, by the way.",
    "Again, there were calls for Thomas to recuse.",
    "Thomas was the lone dissenter in that case.",
    "And what have the Democrats done about it?",
    "It’s perfectly legal but rancidly corrupt.",
    "The Democrats should punish him for it.",
    "They’ve been doing this for years.",
    "He didn’t do so in either case.",
    "Here’s a question for you.",
    "They police themselves.",
    "But they could do it.",
    "But why not?",
    "4.",
    "2.",
    "3."
  ]
}