{
  "id": 3848,
  "mediaId": 2640,
  "date": "2022-01-21",
  "headline": "Trump Addresses Alleged Rift Between Him, DeSantis",
  "image": "https://img2-azrcdn.newser.com/image/1394735-12-20220121163340.jpeg",
  "link": "https://www.newser.com/story/315956/trump-addresses-alleged-rift-between-him-desantis.html",
  "mediaOutlet": "newser.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jenn Gidman",
  "authorUrl": "https://www.newser.com/bio/83598875/jenn-gidman.html",
  "termIds": [
    0
  ],
  "sentences": [
    "Ron DeSantis and former President Donald Trump have been percolating of late, starting with a \"thinly veiled shot\" at DeSantis by Trump last week as he slammed \"gutless\" politicians who wouldn't say whether they'd had a COVID booster shot.",
    "Meanwhile, as this maybe-feud plays out, Trump ally Roger Stone and daughter-in-law Lara Trump are both pressuring DeSantis to step aside and support the former president if he decides to run again for the Oval Office in 2024.",
    "\"Fake news,\" the ex-commander in chief said of the hubbub, taking the opportunity to praise DeSantis, widely viewed to be a potential running mate for Trump, if not a presidential contender himself.",
    "Politico notes Democrats are likely to play up any crack showing between the two men to try to keep DeSantis out of another gubernatorial term, and away from the White House.",
    "Part of the reported tension has been arising because DeSantis has yet to rule out taking on Trump in a GOP primary if Trump decides to run for president again.",
    "Now Trump himself is weighing in, using a familiar catchphrase while discussing the matter Thursday night on Sean Hannity's Fox News program, per Politico.",
    "He noted DeSantis was \"very good\" on his reaction to the Robert Mueller investigation, \"right in front along with Jim Jordan and all of the rest of them.\"",
    "DeSantis was a loyal, vocal Trump backer when he was a congressman before his governorship.",
    "(Newser) – Whispers of a rift between Florida Gov.",
    "\"I get along great with Ron,\" Trump told Hannity.",
    "(Read more Donald Trump stories.)"
  ]
}