{
  "id": 3936,
  "mediaId": 6534,
  "date": "2022-01-19",
  "headline": "Jan. 6 Committee Requests Interview With Ivanka Trump",
  "image": "https://media.nbcchicago.com/2022/01/AP_20325105550691.jpg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.nbcchicago.com/news/national-international/jan-6-committee-requests-interview-with-ivanka-trump/2732524/",
  "mediaOutlet": "nbcchicago.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5065,
    2391,
    4905,
    4345,
    4617,
    2765,
    3037,
    3621,
    1433
  ],
  "sentences": [
    "The other requests in the letter to Ivanka Trump concern conversations after Donald Trump's tweeted, “Mike Pence didn't have the courage to do what should have been done to protect our Country and our Constitution.” The committee said White House staff and even members of Congress requested Ivanka Trump's help in trying to convince her father that he should address the violence and tell rioters to go home.",
    "The letter also mentioned a message, in the days before the scheduled vote certification on Jan. 6, 2021, between an unidentified member of the House Freedom Caucus to then-White House chief of staff Mark Meadows with an explicit warning: “If POTUS allows this to occur ... we're driving a stake in the heart of the federal republic.” POTUS is an abbreviation for president of the United States.",
    "The committee says it wants to discuss what Ivanka Trump knew about her father’s efforts, including a telephone call they say she witnessed, to pressure then-Vice President Mike Pence to reject those results, as well as concerns she may have heard from Pence's staff, members of Congress and the White House counsel’s office about those efforts.",
    "The Constitution makes clear that a vice president’s role is largely ceremonial in the certification process, and Pence had issued a statement before the congressional session that laid out his conclusion that a vice president could not claim “unilateral authority” to reject states’ electoral votes.",
    "In the letter, the committee chairman, Rep. Bennie Thompson, D-Miss., said Ivanka Trump was in direct contact with her father during key moments on Jan. 6, 2021, when Trump supporters stormed the Capitol in an effort to halt the congressional certification of Joe Biden's presidential win.",
    "“As the Committee already knows, Ivanka did not speak at the January 6 rally.”\nThe committee cited testimony that Ivanka Trump implored her father to quell the violence by his supporters and investigators want to ask about her actions while the insurrection was underway.",
    "“Testimony obtained by the Committee indicates that members of the White House staff requested your assistance on multiple occasions to intervene in an attempt to persuade President Trump to address the ongoing lawlessness and violence on Capitol Hill,\" Thompson wrote.",
    "The committee says the extraordinary trove of material it has collected — 35,000 pages of records so far, including texts, emails and phone records from people close to Trump — is fleshing out critical details of the worst attack on the Capitol in two centuries.",
    "“You were present in the Oval Office and observed at least one side of that telephone conversation,” the letter to Ivanka Trump said, adding that the committee “wishes to discuss the part of the conversation you observed” between the then-president and Pence.",
    "The House committee investigating the U.S. Capitol insurrection is asking Ivanka Trump, daughter of former President Donald Trump, to voluntarily cooperate as lawmakers make their first public attempt to arrange an interview with a Trump family member.",
    "The committee said Keith Kellogg, who was Pence's national security adviser, was also in the room and testified to investigators that Trump questioned whether Pence had the courage to delay the congressional counting of the electoral votes.",
    "Earlier this week, it issued subpoenas to lawyer Rudy Giuliani and other members of Trump’s legal team who filed meritless court challenges to the election that fueled the lie that the race had been stolen from Trump.",
    "The committee’s investigation has touched nearly every corner of Trump’s orbit in the nearly seven months since it was created, from strategist Steve Bannon to media companies such as Twitter, Meta and Reddit.",
    "“We are particularly interested in this question: Why didn’t White House staff simply ask the President to walk to the briefing room and appear on live television — to ask the crowd to leave the capital?\"",
    "Besides the subpoenas issued this week, the committee had a victory Wednesday when the Supreme Court rejected a bid by Trump to block the release of White House records sought by lawmakers.",
    "The committee is narrowing in on three requests to Ivanka Trump, starting with a conversation alleged to have taken place between Donald Trump and Pence on the morning of the attack.",
    "House Minority Leader Kevin McCarthy, R-Calif., and GOP Reps. Scott Perry of Pennsylvania and Jim Jordan of Ohio have denied the committee’s requests for voluntary cooperation.",
    "The riot followed a rally near the White House where Donald Trump had urged his supporters to “fight like hell” as Congress convened to certify the 2020 election results.",
    "The committee says it has interviewed nearly 400 people and issued dozens of subpoenas as it prepares a report set for release before the November elections.",
    "While the committee has considered subpoenaing fellow lawmakers, that would be an extraordinary move and could run up against legal and political challenges.",
    "Still, the committee has run into roadblocks from some of Trump’s allies, including Bannon and Meadows, who have refused to fully cooperate.",
    "They include presidential diaries, visitor logs, speech drafts and handwritten notes dealing with Jan. 6 from the Meadows' files.",
    "The committee sent a letter Thursday requesting a meeting in February with Ivanka Trump, a White House adviser to her father.",
    "“Ivanka Trump just learned that the January 6 Committee issued a public letter asking her to appear,\" her spokesperson said.",
    "The National Archives began to turn over the hundreds of pages of records to the nine-member committee almost immediately.",
    "U.S. & World\nThe letter is the committee's first attempt to seek information from inside the Trump family.",
    "The seven Democrats and two Republicans on the committee have also faced defiance from fellow lawmakers.",
    "The next phase of the investigation will include a series of public hearings in the coming months.",
    "Their resistance has led the committee to file charges of contempt of Congress.",
    "Associated Press writer Darlene Superville contributed to this report."
  ]
}