{
  "id": 4046,
  "mediaId": 6687,
  "date": "2022-01-21",
  "headline": "7 Things: Pandemic funds approved by the legislature, Durant demands his opponents denounce story about his response to sister’s sexual assault and more …",
  "image": "https://yellowhammernews.com/wp-content/uploads/2021/08/2021-7-Things-Friday.jpg",
  "link": "https://yellowhammernews.com/7-things-pandemic-funds-approved-by-the-legislature-durant-demands-his-opponents-denounce-story-about-his-response-to-sisters-sexual-assault-and-more/?utm_source=rss&utm_medium=rss&utm_campaign=7-things-pandemic-funds-approved-by-the-legislature-durant-demands-his-opponents-denounce-story-about-his-response-to-sisters-sexual-assault-and-more",
  "mediaOutlet": "yellowhammernews.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dale Jackson",
  "authorUrl": "https://yellowhammernews.com/author/Dale Jackson/",
  "termIds": [
    0
  ],
  "sentences": [
    "Durant responds to what he calls “disgusting, false, and misleading attacks”\nWhile U.S. Senate candidate and businessman Mike Durant’s campaign is facing controversy, they are now asking that the other top candidates in the race, U.S. Representative Mo Brooks (R-Huntsville) and former Business Council of Alabama president Katie Britt “condemn the disgusting, false, and misleading attacks by the liberal and fake news.”\nIn a statement, Durant’s campaign said of “career politicians” Brooks and Britt, “They should be ashamed of themselves and condemn this terrible attack on Mike’s character IMMEDIATELY.” Brooks’ campaign chairman issued the following statement, “The very first time we heard about this tragic story was yesterday.",
    "Former State Senator Paul Sanford named U.S. Representative Jim Jordan (R-Ohio), economic developer John Roberts named House Minority Leader Kevin McCarthy (R-Calif.) and Madison County Commission chairman Dale Strong said that his “focus will be focused on being elected to the next congressman for the Fifth Congressional District.”\n5. al.com loves sticking up for criminal\nFor the folks at al.com, there is no crime that they will not try to create a sob story about.",
    "States should be free to run their elections in a way that works best for them.”\nSenate Majority Leader Mitch McConnell (R-Ky.) made a similar point, but he also misspoke when he said, “Well the concern is misplaced because if you look at the statistics, African-American voters are voting in just as high a percentage as Americans.” The media and their Democrats are suggesting McConnell was saying African-Americans aren’t Americans, which is obviously not true.",
    "North Alabama candidates are advocating making Trump speaker of the House\nDuring a forum for the congressional candidates in Alabama’s fifth congressional district, some candidates suggested that former President Donald Trump should be named speaker of the House.",
    "While this is presented as a way that the system keeps people down, and focuses on one person who had her case dismissed, that is not what this is actually about because ankle monitors are used to allow people to await trial at home rather than in prison.",
    "Tuberville criticized the position that “anyone who disagrees with their bill does not support the right to vote.” He said, “This could not be farther from the truth.” Tuberville went on to add, “The Democrats’ bill does not add or restore any rights.",
    "People don’t really want Biden vs Trump 2.0\nA poll conducted by AP/NORC national survey shows that a majority of people don’t want the 2024 presidential election to be a rematch of President Joe Biden and former President Donald Trump.",
    "Senator Tommy Tuberville (R-Ala.) recently spoke about the “Freedom to Vote Act” and the “John Lewis Voting Rights Advancement Act,” which he described as a “trojan horse” that Democrats are trying to use to “federalize” elections.",
    "House General Fund budget committee chairman Steve Clouse (R-Ozark) has said that there needs to be a focus on starting all projects quickly since the demand for these is expected to increase as other states form similar plans.",
    "It has already been indicated that both Biden and Trump might run again, so people might want to get ready for this replay, but there are rumblings that former Secretary of State Hillary Clinton is getting ready to run again.",
    "There were about 71% of people who “support real restrictions that are more pro-life than federal law and the laws of many states,” according to the senior director of the Knights of Columbus Timothy Saccoccia.",
    "Majority of people support restrictions on abortion\nA new poll from Marist Poll through the Knights of Columbus shows that a majority of people in the United States support restricting abortion in some ways.",
    "Also, 28% were in favor of allowing it in situations of rape and incest or out of medical necessity, 9% only when the mother’s life is in danger, and 12% said no abortions should be allowed at any point.",
    "There are 54% of Americans that say they are “pro-choice,” but only 17% of respondents support abortion at any point in a pregnancy, 12% during the first six months and 22% in the first three months.",
    "Pandemic funds spending has been approved\nBoth the Alabama State Senate and State House have approved identical bills that lay out the plans to spend $772 million in coronavirus relief funds.",
    "Chief deputy for the Baldwin County Sheriff’s Office Anthony Lowery laid it out pretty well, saying, “[I]t gives people some freedoms that you wouldn’t have obviously if you’re in jail.",
    "Former assistant secretary of the Army Casey Wardynski, candidate Harrison Wright and Athens teacher Andy Blalock said that Trump would be speaker if they had the choice.",
    "The last one is part of a feature written to deride Baldwin County for their use of ankle monitors for people on bail, and they try to explain how wrong this is.",
    "We’re shocked and saddened for Mr. Durant’s sister and his family, as well as any other women who have experienced something similar.",
    "The current plans are to spend 36% on broadband expansion, 29% on water and sewer projects, and 20% on medical care services.",
    "This woman’s trauma is not a matter for politics, and we’re simply not going to make it a part of this campaign.”\n1.",
    "Final approval is expected within the next week of the special session that Governor Kay Ivey called for the issue.",
    "It gives you an opportunity to carry on your life while you’re waiting on adjudication of your case.”\n4.",
    "Trump gained only 56% of Republicans desire for him to run again, and 27% of people overall.",
    "Only 48% of Democrats and 28% of people overall said that they want Biden to run in 2024.",
    "It simply puts Washington, D.C. in charge of states’ elections.",
    "People aren’t losing their right to vote\nU.S.",
    "Trying to kill someone in a mall?",
    "Using drugs while pregnant?",
    "Stabbing your boyfriend?",
    "Murderer?",
    "Nope.",
    "Nope.",
    "Nope.",
    "Nope.",
    "6.",
    "3.",
    "2.",
    "7."
  ]
}