{
  "id": 4069,
  "mediaId": 2614,
  "date": "2022-01-17",
  "headline": "Jim Jordan Reveals What Happens To Dr. Fauci When The GOP Takes The House In 2022 Midterms [VIDEO]",
  "image": "https://www.lifezette.com/wp-content/uploads/2021/06/2021.07.01-01.11-lifezette-60ddbef2676f2.jpg",
  "link": "https://www.lifezette.com/2022/01/jim-jordan-reveals-what-happens-to-dr-fauci-when-the-gop-takes-the-house-in-2022-midterms-video/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Voice Media",
  "authorUrl": "https://www.lifezette.com/author/redvoicemedia/",
  "termIds": [
    5127,
    3217,
    2119,
    1489,
    1126
  ],
  "sentences": [
    "One scientist says, ‘I don’t see how this can happen in nature, but it would be easy to do in a lab.’”\nIn the video, which can be watched above, Jordan added, “And yet just in a matter of days, they changed their position, write the article that appears in Nature of Medicine Magazine, which then gets cited in the now-famous letter The Lancet, which became the gospel for the fact that Fauci can go out and tell people it didn’t come from a lab when in fact they knew it did.”\n??BREAKING??",
    "We've released never before seen emails showing Dr. Fauci may have concealed information about #COVID19 originating from the Wuhan lab & intentionally downplayed the lab leak theory.",
    "The truth of the famed Dr. Anthony Fauci continues to come to light as Republican Senator Roger Marshall, of Kansas, released the financial records of the doctor over the weekend.",
    "pic.twitter.com/p8aIBJ3nom\n— Oversight Committee Republicans (@GOPoversight) January 11, 2022\nAnd showing the motives behind it, Jordan concluded, “The interesting thing is.",
    "And with news of Fauci’s financial gains released, Ohio Representative Jim Jordan promised to investigate the doctor right after the GOP wins back the House in November.",
    "They get an $8.9 million, both him and Dr. [Robert] Garry – the guy who said it couldn’t happen naturally.”\nThis piece was written by Zach Heilman on January 17, 2022.",
    "We just learned this last week, the two doctors who were most adamant that this thing came from a lab early on: one is Dr. Kristian Anderson.",
    "On top of that, during the pandemic, Fauci and his wife were paid tens of thousands of dollars to attend a few ceremonies and galas.",
    "Speaking on Sunday Morning Futures, Jordan said, “If the American people put us back in charge, we are definitely going to do this.",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "Because we now know without a doubt that Dr. Fauci knew on Jan. 31 and Feb. 1 that this thing came from a lab.",
    "It should come as no surprise that the doctor and his wife have a net worth of around $10 million.",
    "Out of the four events they appeared at, during the pandemic, only three of them were virtual.",
    "On Jan. 31, 2020, he says this to Dr. Fauci in an email: ‘Virus looks engineered.",
    "One scientist says we got the notes now from the conference call on February 1st.",
    "Virus not consistent with evolutionary theory.’ So, he knew it came from a lab.",
    "It originally appeared in RedVoiceMedia.com and is used by permission.",
    "The top scientists in the country were saying it came from a lab.",
    "@RepJamesComer & @Jim_Jordan want Fauci under oath.",
    "And a few months later, guess what?",
    "They changed their position.",
    "We point this out.",
    "Time for answers.",
    "1/2??"
  ]
}