{
  "id": 4207,
  "mediaId": 2526,
  "date": "2022-01-21",
  "headline": "Exclusive — Ron DeSantis’s Office Debunks Rumors of Infighting with Trump: ‘Fabricated’ Narrative to Distract from Biden’s Failures",
  "image": "https://media.breitbart.com/media/2019/11/DeSantis-and-Trump-Getty-Images-640x335.png",
  "link": "https://www.breitbart.com/politics/2022/01/21/ron-desantiss-office-debunks-rumors-infighting-trump-fabricated-narrative-distract-bidens-failures/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    1679,
    4905,
    2765,
    6159
  ],
  "sentences": [
    "“It is not a coincidence that this fabricated media narrative emerged during perhaps the worst week of Biden’s presidency, as it became clear last week that Biden would not be able to deliver on Build Back Better, enact sweeping legislation to federalize elections, or ‘shut down the virus’ as he had promised during his campaign when he was demagoguing President Trump over COVID,” Pushaw added, addressing the claims on social media as well:\nI told you all so.",
    "Ron DeSantis’s (R) office on Friday forcefully denied the establishment media’s rumors of infighting between the Florida governor and former President Donald Trump, deeming them “baseless stories” that are “merely attempts by corporate media activists to distract from Biden administration failures.”\nOver the past week, establishment media outlets spread rumors of infighting between the two Republicans — two of the most popular Republicans in the country.",
    "Ron’s been very good, he’s been a friend of mine for a long time.”\nThe rumors of infighting, Trump continued, are “totally fake news.”\n“I think Ron said it last week; he said it very publicly: ‘The press is never going to get in the middle of my friendship with Donald Trump.",
    "Notably, the rumors of this quarrel come one year into Biden’s presidency, as voters see he has failed on a range of issues, including the coronavirus, as he is still urging Americans to wear masks despite pledging “just” 100 days of masking.",
    "Again, journalists, don’t even bother talking to me if you’re going to ignore everything I say and write whatever fantasies you want based on “anonymous sources.” https://t.co/7XIdDLcXgR\n— Christina Pushaw ??",
    "We’re not going to do that stuff,'” Trump added, noting that he agrees with DeSantis’s position “100 percent.”\n“I have a very good relationship with Ron,” Trump said, “and intend to have it for a long time.”",
    "Axios, citing an anonymous source, reported that Trump had been privately bashing DeSantis, and the New York Times acted similarly, releasing a piece titled “Who Is King of Florida?",
    "DeSantis has always said that media narratives cannot get in the way of their friendship,” DeSantis’s press secretary, Christina Pushaw, told Breitbart News Friday morning.",
    "“All these anonymously sourced and baseless stories were merely attempts by corporate media activists to distract from Biden administration failures,” she continued.",
    "“As the governor said when asked about the rumors last week, ‘This is what the media does.’ And, as President Trump mentioned last night on Hannity, Gov.",
    "Tensions Rise Between Trump and a Former Acolyte.”\nThe chatter, however, is just that, DeSantis’s office confirmed to Breitbart News.",
    "(@ChristinaPushaw) January 21, 2022\nIndeed, Trump dismissed the rumors as well on Thursday during an appearance on Hannity.",
    "As a result of that and many more issues, his approval rating is completely underwater and has been so for quite a while.",
    "He was right in front along with Jim Jordan and all of the rest of them; they were fantastic.",
    "It was a great thing, and Ron was one of them.”\n“Ron wanted to run, and I endorsed him.",
    "“I get along great with Ron,” Trump said of the Florida governor.",
    "and I helped him greatly, and he went on,” Trump continued.",
    "“He’s done a really terrific job in Florida.",
    "“Ron was very good on the Mueller hoax.",
    "Republicans really stuck together.",
    "Gov."
  ]
}