{
  "id": 422,
  "mediaId": 2550,
  "date": "2022-02-19",
  "headline": "Freedom Caucus member: Jan. 6 could have been 'a stake in the heart of the federal republic'",
  "image": "https://images.dailykos.com/images/1038177/story_image/insurrection1.jpg?1644941580",
  "link": "https://www.dailykos.com/stories/2022/2/17/2080944/-Freedom-Caucus-member-Jan-6-could-have-been-a-stake-in-the-heart-of-the-federal-republic?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darrell Lucus\nCommunity",
  "authorUrl": "/users/darrell lucus",
  "termIds": [
    5399,
    2074,
    2391,
    4596,
    4905,
    3621,
    2765,
    520,
    1359
  ],
  "sentences": [
    "We already knew that many of the events of Jan. 6 were firmly in the realm of “what did Trump know, and when did he know it?” Those questions may have become even louder on Wednesday when The Washington Post unearthed a text from a Republican House member who feared that whatever Trump wanted to do could have serious consequences for democracy.",
    "Sometime between Jan. 1 and Jan. 2, the unknown House member, whom the Post describes as having “knowledge of the president’s planning” for Jan. 6, fired off this text to Meadows:\nIf POTUS allows this to occur… we’re driving a stake in the heart of the federal republic.",
    "It cannot be emphasized enough: This was coming from a caucus that counts among its members the likes of Reps. Jim Jordan, Andy Biggs, Paul Gosar, Matt Gaetz, Jody Hice, Marjorie Taylor Greene, Louie Gohmert, Madison Cawthorn, and Lauren Boebert.",
    "x\nx\nx\nLeonnig, who didn’t contribute to the earlier story, said that the Freedom Caucus member could have been referring to something as mundane as Mike Pence throwing out slates of Democratic electors—or something far worse.",
    "And if we have to ask whether Trump was planning something more sinister than simply having Pence help him steal another term, it only underlines why we must get to the bottom of what happened that day—and how it happened.",
    "Committee members have either interviewed or learned information around this lawmaker and what he was saying to his staff, what he was saying to the White House, what he was saying to Meadows.",
    "Later on Wednesday, Carol Leonnig of the Post dropped by MSNBC’s The 11th Hour to ask an important question: Just what did the Freedom Caucus member mean by “this”?",
    "Wednesday, the Post published a tranche of text messages obtained by the Jan. 6 committee that were sent to former White House Chief of Staff Mark Meadows.",
    "The texts show that a number of right-wing luminaries were gravely concerned that the effort to derail Joe Biden’s victory could backfire—and bigly.",
    "How grim and chilling a piece of information is this, if this lawmaker knew something Donald Trump was plotting beyond what we all know now?",
    "If it is as simple as pressuring Pence to reject the election results and the electors, it's a pretty prescient and interesting text.",
    "And it’s really telling that one of those texts came from the most rabidly Trumpified element of the House Republican Conference.",
    "If a member of that crowd was that alarmed about what Trump was doing, that’s saying something.",
    "That’s a marked contrast to recent GOP efforts aimed at downplaying that day’s horror.",
    "What exactly did that Freedom Caucus member mean by “this”?",
    "It was a member of the Freedom Caucus.",
    "And it wasn’t just a RINO either.",
    "But what else could “this” be?"
  ]
}