{
  "id": 4227,
  "mediaId": 2672,
  "date": "2022-01-20",
  "headline": "‘No More Stolen Election Talk’: New Texts Show Sean Hannity Was Desperate to Keep Trump Quiet After Jan. 6",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/01/AP20240088459924.jpg",
  "link": "https://www.rollingstone.com/politics/politics-news/sean-hannity-stolen-election-texts-trump-jan-6-committee-1288222/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "William Vaillancourt",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Hannity on 1/7 in private: \"No more stolen election talk\"\nHannity on 1/7 on Fox: State legislatures \"need to get working now\" to restrict voting access after Matt Gaetz says \"Donald Trump won this election\" https://t.co/y75xxcrhm8 pic.twitter.com/KX11x9WcW3\n— Madeline Peltz (@peltzmadeline) January 20, 2022\nThe Jan. 6 committee has honed in on Hannity’s communications as evidence that he may “have detailed knowledge regarding President Trump’s state of mind” throughout the insurrection.",
    "On the night he sent the texts, Hannity did not push back when Rep. Matt Gaetz (R-Fla.), asserted that Trump “won this election in a landslide.” In fact, Hannity said that state legislatures “need to get working now” to fix the voting and election certification process.",
    "“2 – Yes, impeachment and 25 th amendment are real, and many people will quit….”\nMcEnany agreed with these suggestions, according to the committee’s letter, as well as with Hannity’s specific recommendation that the president be kept away from certain people.",
    "In its letter requesting the voluntary cooperation of Ivanka Trump, the committee included new texts from Sean Hannity, adding another dimension to what has already been revealed about how freaked out the Fox News host was in the aftermath of the attack.",
    "Now that the Supreme Court rejected Trump’s claim of executive privilege regarding the withholding of documents sought by the Jan. 6 committee, more information about Hannity’s off-air maneuverings could come to light soon.",
    "As committee member Rep. Adam Schiff (D-Calif.) explained in an MSNBC appearance earlier this month, Hannity “was more than a Fox host — he was also a confidante, adviser [and] campaigner” for Trump.",
    "The House Jan. 6 committee on Thursday released more communications between White House staff and outside figures before, during, and after the deadly Capitol insurrection.",
    "Specifically, Hannity was worried Trump could get himself impeached if he kept braying about the election being stolen.",
    "It was reported earlier this month that the president would even dial Hannity into Oval Office staff meetings.",
    "In a text to then-White House Press Secretary Kayleigh McEnany, the Fox News host offered a five-point plan.",
    "Ideas?”\nHannity was one of several Fox News personalities whose advice found an eager listener in Trump.",
    "And worse, I’m not sure what is left to do or say, and I don’t like knowing if it’s truly understood.",
    "Hannity’s Jan. 10 message to then-Chief of Staff Mark Meadows and Rep. Jim Jordan (R-Ohio).",
    "Hannity did not, however, seem to have any qualms with pushing the Big Lie on his show.",
    "“Guys, we have a clear path to land the plane in 9 days,” he wrote.",
    "“1 – No more stolen election talk,” part of it reads.",
    "I did not have a good call with him today.",
    "“He can’t mention the election again.",
    "No more crazy people,” he stressed.",
    "“…Key now.",
    "Ever."
  ]
}