{
  "id": 4272,
  "mediaId": 2553,
  "date": "2022-01-25",
  "headline": "‘Kill People To Harm Republicans’: Social Media Clobbers Biden Admin After FDA Blocks Antibody Treatment",
  "image": "https://dw-wp-production.imgix.net/2021/06/RB-scaled.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/kill-people-to-harm-republicans-social-media-clobbers-biden-admin-after-fda-blocks-antibody-treatment",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Prestigiacomo",
  "authorUrl": "https://www.dailywire.com/author/amanda-prestigiacomo",
  "termIds": [
    1679,
    4905,
    4007,
    1325,
    1126,
    503,
    6159
  ],
  "sentences": [
    "The FDA said in its statement that it is removing the authorization because the treatments “are highly unlikely to be active against the omicron variant.”\n“Florida disagrees with the decision that blocks access to any available treatments in the absence of clinical evidence,” the Florida Health Department blasted in a press release.",
    "The Biden administration and the U.S. Food and Drug Administration (FDA) took heat online this week after the FDA announced the removal of emergency use authorization for two monoclonal antibodies, which effectively shut down treatment sites statewide in Florida.",
    "https://t.co/xKEQE1jFXU\n— Tom Fitton (@TomFitton) January 25, 2022\nAs highlighted by The Daily Wire, the Biden administration announced in September that they’d be rationing supply of the treatment, effectively cutting supply from COVID-positive Floridians.",
    "“Now in a move that reeks of partisan payback against states like Florida, the Biden administration is rationing these treatments.”\nAt the time, DeSantis worked around the Biden administration and secured additional doses of the treatment for Floridians.",
    "Related: DeSantis Secures Antibody Doses On His Own, Skirting Biden’s Reduction Of Lifesaving Treatment\nThe Daily Wire is one of America’s fastest-growing conservative media companies and counter-cultural outlets for news, opinion, and entertainment.",
    "https://t.co/5ZPXT5XceQ\n— Bill Posey (@congbillposey) January 25, 2022\n“This is a nonsensical decision meant only to spite Floridians who have been benefiting from these treatments!” said Florida congressional candidate Willie J. Montague.",
    "“In cutting off monoclonals, Biden has effectively said you can only drink water before you exercise, but you cannot have any afterwards.”\nVaccines (pre-treatment) and monoclonal antibodies (post-treatment) are not mutually exclusive.",
    "(@ChristinaPushaw) January 25, 2022\nTom Fitton commented, “The extremists controlling the Biden administration are vindictive and vicious.”\nThe extremists controlling the Biden administration are vindictive and vicious.",
    "https://t.co/Fo6GC2Jvf8\n— Marina Medvin (@MarinaMedvin) January 25, 2022\n“This move by the FDA is short-sighted–all options should remain on the table to ensure quick intervention,” wrote Florida Rep. Bill Posey.",
    "“Without a shred of clinical data to support its decision, the Biden Administration has revoked the emergency use authorization for lifesaving monoclonal antibody treatments,” the governor posted to Twitter.",
    "“To date, such evidence has not been provided by the United States Food and Drug Administration (FDA).”\nFlorida Governor Ron DeSantis (R) similarly blasted the Biden administration over the FDA move.",
    "https://t.co/QyYytgxUUx\n— Dr. Willie J. Montague (@RepMontague) January 25, 2022\n“Vaccines (pre-treatment) and monoclonal antibodies (post-treatment) are not mutually exclusive.",
    "“Floridians have benefited from the state’s treatment sites and their access to treatment shouldn’t be denied based on the whims of a floundering president,” DeSantis wrote.",
    "Floridians have benefited from the state’s treatment sites and their access to treatment shouldn’t be denied based on the whims of a floundering president.",
    "In cutting off monoclonals, Biden has effectively said you can only drink water before you exercise, but you cannot have any afterwards.",
    "Steel yourselves for the evil that is being unleashed.”\nThe FDA is trying to make it so that people in Florida die of Covid.",
    "https://t.co/hP55vngVbh\n— Cernovich (@Cernovich) January 25, 2022\n“Unconscionable,” reacted Republican Rep. Jim Jordan (OH).",
    "The move was made to apparently limit potential shortages elsewhere, though there aren’t any signs of a treatment shortage.",
    "But they have prevented thousands of hospitalizations including in breakthrough cases,” Rubio posted to Twitter.",
    "The takeover was widely criticized and even deemed an act of “partisan payback” by Senator Marco Rubio (R-FL).",
    "This is a nonsensical decision meant only to spite Floridians who have been benefiting from these treatments!",
    "This move by the FDA is short-sighted–all options should remain on the table to ensure quick intervention.",
    "“The FDA is trying to make it so that people in Florida die of Covid,” charged Mike Cernovich.",
    "https://t.co/Y5nmAV1LCs\n— Ron DeSantis (@GovRonDeSantis) January 25, 2022\nOthers piled on.",
    "It’s not a zero sum game,” explained DeSantis spokeswoman Christina Pushaw.",
    "Get inside access to The Daily Wire by becoming a member.",
    "“Antibody treatments aren’t a substitute for vaccines.",
    "Steel yourselves for the evil that is being unleashed.",
    "[FDA]?” questioned politico Marina Medvin.",
    "“They’ll kill people to harm Republicans.",
    "They’ll kill people to harm Republicans.",
    "What is going on [President Joe Biden]?",
    "“Monoclonals saved so many lives.",
    "Monoclonals saved so many lives.",
    "It’s not a zero sum game.",
    "What is going on @POTUS?",
    "— Christina Pushaw ??",
    "@US_FDA?"
  ]
}