{
  "id": 4380,
  "mediaId": 2730,
  "date": "2022-01-21",
  "headline": "Trump Responds to Reports Claiming That He Has Conflict with DeSantis",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2018/309/d339b7fc-9d55-4d1a-b9d7-d135f8e5c4db.jpg",
  "link": "https://townhall.com/tipsheet/madelineleesman/2022/01/21/trump-responds-to-reports-claiming-that-he-has-conflict-with-desantis-n2602178",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Leesman",
  "authorUrl": "https://townhall.com/tipsheet/madelineleesman/",
  "termIds": [
    2767,
    2765,
    1679,
    2119,
    1126,
    514,
    6159
  ],
  "sentences": [
    "A spokesperson for DeSantis told People Magazine this week “it’s not a coincidence that this fabricated media narrative emerged during the worst week of Biden’s presidency to date.”\n\"Governor DeSantis remains focused on Florida and works every day to earn Floridians' support for re-election in November of this year,\" the spokeswoman added.",
    "“He’s been a friend of mine for a long time.”\nTrump described the Times’ report as “totally fake news.”\n“I think Ron said last week, he said it very publicly, he says the press is never going to get in the middle of my friendship with Donald Trump, we’re not going to do that stuff.",
    "Ron DeSantis the other day and had a private conversation but, he said it wasn’t confidential, and he asked if there is any conflict or bickering between you and him and he said ‘absolutely not.’ He said it’s ‘total BS.’ Is he right?” Hannity asked Trump.",
    "Trump told Fox News commentator Sean Hannity that he gets along great with DeSantis and echoed DeSantis’ response that the report was “total BS.”\n“Let me ask you, a friend of mine was with Florida Gov.",
    "Source: AP Photo/Butch Dill, File\nFormer President Donald Trump appeared in a Fox News interview this week where he debunked claims that he has “long-stewing resentment” towards GOP Florida Gov.",
    "Tensions Rise Between Trump and a Former Acolyte,” published on Sunday, claimed that a “spat” over the Wuhan coronavirus created “friction” between the former president and the governor.",
    "No, I have a very good relationship with Ron and intend to have it for a long time,” Trump added.",
    "He was right up front along with Jim Jordan, and all of the rest of them, they were fantastic.",
    "And that helped him greatly.”\n“He’s done a really terrific job in Florida,” Trump continued.",
    "And he said it very strongly, I thought it was very interesting, actually.",
    "— The Post Millennial (@TPostMillennial) January 21, 2022",
    "But he said that, and I agree with him on that 100%.",
    "The Times’ article, “Who is the King of Florida?",
    "I get along great with Ron,” Trump responded.",
    "Watch Trump’s interview with Hannity below.",
    "And Ron wanted to run and I endorsed him.",
    "“Ron was very good on the Mueller hoax.",
    "The Republicans really stuck together.",
    "And it was a great thing.",
    "And Ron was one of them.",
    "And very nice.",
    "“He is right.",
    "Ron DeSantis."
  ]
}