{
  "id": 4464,
  "mediaId": 2658,
  "date": "2022-01-10",
  "headline": "Dems eye voting rights fight, filibuster changes",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/01/10/dems-eye-voting-rights-fight-filibuster-changes-495660",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3925,
    4905,
    4784,
    4466,
    2976,
    392,
    1489
  ],
  "sentences": [
    "The panel has “gathered thousands of records from state officials and interviewed a slate of witnesses as it attempts to retrace Trump’s attempts to subvert the 2020 election, particularly in four key states that swung the presidency to Biden.” The documents sent to the committee, obtained by POLITICO, “underscore the depth of Trump’s pressure campaign directed at the typically lower-level administrators of presidential balloting.",
    "The emails, texts and phone recordings also add consequential context to previously reported incidents, such as Trump’s call to Georgia's top elections investigator and Mark Meadows’ outreach to Georgia election officials.”\nHUDDLE HOTDISH\nOrdering a Bite…The House’s office of the Chief Administrative Officer tells Huddle that the Bite app, which we reported on last week, has gotten widespread use since launching on the Hill.",
    "Dems eye voting rights fight, filibuster changes\nBy KATHERINE TULLY-MCMANUS\n01/10/2022 07:29 AM EST\nPresented by\nDEMS DIG IN — Senate Democrats are expected to force another vote on elections and voting rights legislation as soon as this week, despite not having enough votes to pass the measure.",
    "SANCTIONS IN THE PIPELINE — The Senate is expected to vote this week on legislation from Sen. Ted Cruz (R-Texas) that would require the Biden administration to impose sanctions on the Nord Stream 2 pipeline that carries natural gas from Russia to Germany.",
    "Reality Check: There is not consensus within the 50-vote Democratic caucus on changing the filibuster and Democrats haven’t unveiled a proposal for how they plan to change Senate rules, despite Schumer’s promises to take the issue to the floor.",
    "The Office of the Attending Physician “directs the use of N95 or KN95 masks by all individuals on the House Floor, regardless of vaccination status” and House leaders are telling members to exit the floor immediately after casting their votes.",
    "He was previously Deputy Chief of Staff/Legislative Director for Rep. Jared Huffman (D-Calif.)\nTODAY IN CONGRESS\nThe House convenes at 6:30 p.m. for a quorum call to establish a quorum in the House for the second session of the 117th Congress.",
    "The president is expected to try and build support among the public for voting rights legislation and make the arguments that the Senate needs to pass a voting rights bill, even if they have to change the chamber’s rules to accomplish that.",
    "Johnson’s move, announced in an op-ed in The Wall Street Journal over the weekend (but reported by POLITICO on Friday), will defy his past two-term pledge and set up a major test of Republicans' effort to retake the Senate majority.",
    "If Republicans block the bill — which is expected — Senate Majority Leader Chuck Schumer (D-N.Y.) has repeatedly vowed to launch an effort to change the Senate’s filibuster rules by Martin Luther King Jr. Day on Jan. 17.",
    "There are proposals under discussion from a carveout from filibuster rules to a return to the talking filibuster or a shift from requiring 60 votes to break a filibuster to requiring 41 \"no\" votes to sustain it.",
    "Democrats say they don’t want to undercut Biden as he navigates precarious talks with Russia over its possible invasion of Ukraine, and they don’t want to do anything that would undermine trans-Atlantic unity.",
    "QUICK LINKS\nRep. Jim Jordan says he won’t cooperate with Jan. 6 committee’s interview request, from Nicholas and Kyle\nTRANSITIONS\nOmair Mirza is joining J.P. Morgan Chase as VP of federal government relations.",
    "The vote is part of a deal struck between Cruz and Schumer to hold the sanctions vote in exchange for a lift of the Texas Republican’s holds on more than three dozen diplomatic and ambassadorial nominees.",
    "Biden will visit Sen. Raphael Warnock (D-Ga.)’s Historic Ebenezer Baptist Church and lay a wreath at the crypt of Martin Luther King Jr.\nSchumer is expected to let Biden’s Georgia trip take center stage.",
    "Biden boosts the message: Schumer’s message will get a boost Tuesday as President Joe Biden, a proud “Senate Guy,” heads to Georgia for a speech and events related to voting rights and the filibuster.",
    "Joe Manchin (W.Va.) and Kyrsten Sinema (Ariz.) are the Democratic holdouts on filibuster changes, but Democratic colleagues are aiming to find a proposal that could garner their support.",
    "Good news… even if a bit belated: Sarah Ferris and Joe Lowry met up to get Sarah’s earring lost during the Jan. 6 attack and found by Joe back to the rightful owner, a year later.",
    "Thune is widely viewed as a potential successor to Senate Minority Leader Mitch McConnell and his decision to run again is a boon to party leaders, who lobbied him not to retire.",
    "COVID ON CAPITOL HILL — Reps. Jim Cooper (D-Tenn.) and Alexandria Ocasio-Cortez (D-N.Y.) are the latest lawmakers to announce that they have tested positive for covid.",
    "TRIVIA\nFRIDAY’S WINNER: Joe Lowry, yes of earring-finding fame, correctly answered that there are 18.5 miles of walkways overseen by the Architect of the Capitol.",
    "Ocasio-Cortez, who is fully vaccinated and has had a booster shot, is “experiencing symptoms and recovering at home,” her office said in a statement on Sunday.",
    "JAN. 6 INVESTIGATORS EYE STATE ACTION The select committee probing the Jan. 6 2021 attack on the Capitol are looking far beyond Washington, Nicholas reports.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Monday, January 10, where the covid testing line is the place to be.",
    "“Members are also strongly discouraged from congregating on the House Floor and in the surrounding areas during votes,” says the latest guidance.",
    "Logan Ferree is joining the Water Resources Subcommittee at the House Transportation and Infrastructure Committee as a professional staff member.",
    "Pro tip: make sure you’re in the “orders” section of the app, because the map/location finder is what tripped folks up last week.",
    "On Saturday, Reps. Sean Casten (D-Ill.) and Young Kim (R-Calif.) also announced they had tested positive for COVID-19.",
    "Graham Conlan is now a legislative assistant for Rep. John Rose (R-Tenn.), handling the financial services portfolio.",
    "THEY’RE RUNNING — Two more Senate Republicans are angling to keep their seats in the 2022 midterm elections: Sens.",
    "Members will be urged this week to limit their time in the House chamber during votes and to up their mask game.",
    "A Senate proposal and gameplan for floor action aren’t expected until after the president’s speech Tuesday.",
    "Dems pivot on pipeline: Cruz’s bill is expected to fall short of the 60-vote threshold needed to advance.",
    "Senate Democrats are expected to reject the legislation, despite their previous support for sanctions.",
    "The Senate convenes at 3 p.m. with a vote at 5:30 p.m.\nAROUND THE HILL\nLooks like a quiet one.",
    "They had over 300 orders on the app last week at the Dunkin location alone, according to CAO.",
    "Stuart Malec is now director of government affairs for the Progressive Policy Institute.",
    "(If you guessed 14 miles, no hard feelings, both numbers appear on the AOC’s website.)",
    "Kemi Giwa is now deputy comms director for the House Financial Services Committee.",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "(Sarah’s mom will have to wait a little longer to get the reunited pair back.)",
    "He most recently was senior policy adviser for Rep. André Carson (D-Ind.)",
    "She previously was press secretary for Rep. Seth Moulton (D-Mass.).",
    "He previously was comms director for Rep. Kathleen Rice (D-N.Y.).",
    "TODAY’S QUESTION: How many current senators have authored books?",
    "He previously was policy counsel at Daly Consulting Group.",
    "John Thune of South Dakota and Ron Johnson of Wisconsin.",
    "They snapped a photo, as requested by your Huddle host.",
    "Follow Katherine on Twitter @ktullymcmanus\nFollow Us",
    "GET HUDDLE emailed to your phone each morning.",
    "Send your answers to ktm@politico.com.",
    "Marianne has more on Thune.",
    "At the moment, Sens.",
    "GOOD MORNING!"
  ]
}