{
  "id": 4511,
  "mediaId": 2614,
  "date": "2022-01-15",
  "headline": "Joe Biden Impersonator Draws More Attention Than The ‘Real’ Version [VIDEO]",
  "image": "https://www.lifezette.com/wp-content/uploads/2022/01/2022.01.16-12.37-lifezette-61e4117032e98.jpg",
  "link": "https://www.lifezette.com/2022/01/joe-biden-impersonator-draws-more-attention-than-the-real-version-video/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Voice Media",
  "authorUrl": "https://www.lifezette.com/author/redvoicemedia/",
  "termIds": [
    3582,
    4905
  ],
  "sentences": [
    "And for those who might wonder about the idea of a body double being used, here is what Snopes had to say on the subject: “Considering the speculation that Biden may have received facial surgery and that those procedures were the most likely and plausible reasons for any changes in his appearances — as well as the facts that there has been no human reproductive cloning as of this writing and that differences in physical characteristics beyond earlobes would emerge as evidence of the alleged body-double conspiracy — we rate this claim ‘False.’”\nShocking.",
    "Jim Jordan Completely Shreds Biden & The Dems On COVID, Elections & More In Epic Two Minute Speech [VIDEO]\nStew Peters’ Viewers Create Temporary Victory In Scott Quiner Case- Mercy Hospital Ordered To Not Kill Him\nThe opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "From the moment the 2020 election was called (and in some situations, even before that), rumors started to swirl around the country pertaining to the election results, Biden’s mental health, Kamala Harris’s rise to power, Hunter Biden’s laptop, and above all else, who is really running the country?",
    "pic.twitter.com/LId80RYaGo\n— Ames (@RestingTwitFace) January 15, 2022\nAppearing to garner more approval than the real Joe Biden, who currently sits at 33%, some have wondered if a body double is something used by the government.",
    "Even with a full Hollywood set, teleprompter, and script, President Biden can barely make it through statements, leading many to wonder if there will be a power shift in the upcoming election.",
    "When comparing the number of scandals and rumors to circulate around Joe Biden since he took up residence in the White House, it is almost astonishing he has only been in office for a year.",
    "But while it is most likely a talented individual searching for their claim to fame, there is no deny that he definitely has a higher approval rating than Amtrak Joe.",
    "But until then, a new theory is starting to gain some traction as the video below shows a Biden impersonator casually walking through a parking lot.",
    "Although Biden has been given ample opportunities to prove himself competent, he continues to stumble and fumble through speeches.",
    "While the people around him video and chant, the impersonator keeps a safe distance while pumping up the crowd.",
    "It originally appeared in RedVoiceMedia.com and is used by permission.",
    "Biden impersonator has more support than the real Joe Biden ??",
    "This piece was written by Zach Heilman on January 15, 2022.",
    "400 Athletes Collapsing & Dying Just In The Last 6 Months?",
    "Read more at RedVoiceMedia.com:\nThe New Normal?"
  ]
}