{
  "id": 4516,
  "mediaId": 2649,
  "date": "2022-01-03",
  "headline": "Election objectors are among the GOP’s highest fundraisers ahead of Jan. 6 anniversary",
  "image": "https://cdn1.opensecrets.org/news/wp-content/uploads/2022/01/04110920/GettyImages-1298602640-e1641312577776.jpg",
  "link": "https://www.opensecrets.org/news/2022/01/election-objectors-among-gops-highest-fundraisers-ahead-of-jan-6-anniversary",
  "mediaOutlet": "opensecrets.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melissa Holzberg",
  "authorUrl": "https://www.opensecrets.org/news/author/melissa-holzberg/",
  "termIds": [
    0
  ],
  "sentences": [
    "While Republican leadership members like McCarthy, Scalise and Rep. Elise Stefanik (R-N.Y.) all objected to the Electoral College count, they’ve been reluctant to defend the actions of rioters on Jan. 6, unlike some of the other top fundraising election objectors in their conference.",
    "Read more OpenSecrets News & Analysis: 2020 Presidential · Congress · Congressional Elections · Election 2020 · Election 2022 · Politicians & Elections\nSupport Accountability Journalism\nAt OpenSecrets.org we offer in-depth, money-in-politics stories in the public interest.",
    "“If you think about what our Declaration of Independence says, it says to overthrow tyrants.”\nBannon has since been indicted by a federal grand jury of criminal contempt of Congress for refusing to cooperate with the House committee investigating Jan. 6.",
    "In 2021, she was stripped of her House committee assignments, and on Jan. 2, Twitter permanently suspended Greene’s personal Twitter account for continuously publishing misinformation on COVID-19, and Facebook temporarily suspended her.",
    "Both Jordan and Gaetz have been intensely critical of the Jan. 6 House committee, and the committee told Jordan in December that they wanted to question him regarding “communication” the congressman had with Trump on Jan. 6.",
    "House Minority Leader Kevin McCarthy (R-Calif.) raised nearly $9.1 million in the first nine months of 2021 — he’s the highest fundraiser in the House Republican conference, and third highest fundraiser in the House overall.",
    "Republican objectors cited baseless claims of fraudulent vote counts, rigged voting machines and former President Donald Trump’s allegations of voter fraud as the reasons they voted to object to Biden’s win.",
    "Now, a year after the riot, many of the House members who objected to the election results are some of the top fundraisers in the Republican House conference going into the 2022 midterm elections.",
    "While the majority of House Republicans voted against certifying the Electoral College vote in 2020, a few top Republican fundraisers stood out for voting in favor of the certification.",
    "On Jan. 6, 2021, 147 Republican members of Congress voted to object to the Electoral College vote count that certified President Joe Biden’s victory in the 2020 presidential election.",
    "Additionally, five Democratic-held seats are currently in Cook’s “lean” or “likely” Republican categories, and only one Republican-held seat is in the “lean Democratic” column.",
    "According to the Cook Political Report, eight Democratic-held seats are now considered toss-ups in the November elections while six Republican-held seats are labeled the same.",
    "Whether you’re reading about 2020 presidential fundraising, conflicts of interest or “dark money” influence, we produce this content with a small, but dedicated team.",
    "In the aftermath of Jan. 6, the Texas representative said that members of his party “lied” to Trump supporters by claiming they could overturn the election results.",
    "Democrats hold a narrow 221-majority in the 435-member House, and some predict House Republicans will retake control there and perhaps in the Senate this year.",
    "Other top fundraisers in the House Republican conference who objected to the Electoral College vote include Reps. Jim Jordan (R-Ohio) and Matt Gaetz (R-Fla.).",
    "Every donation we receive from users like you goes directly into promoting high-quality data analysis and investigative journalism that you can trust.",
    "The Ohio congressman is the fifth highest fundraiser in the House Republican conference with a $5.1 million haul so far in the 2022 election cycle.",
    "The Georgia congresswoman has been a lightning rod of controversy over her offensive and controversial remarks since she was elected to Congress.",
    "“They were led to believe Jan. 6 was anything but a political performance for a few opportunistic politicians to give a five-minute speech.",
    "In an October interview with former Trump adviser Steve Bannon, Greene compared the Capitol rioters to the Declaration of Independence.",
    "Gaetz, who held a string of rallies with Greene over the summer, has raised nearly $3.6 million in his reelection campaign so far.",
    "She’s the fourth highest overall House Republican fundraiser, and the third highest House Republican election objector fundraiser.",
    "Rep. Marjorie Taylor Greene (R-Ga.), a freshman represenative, has raised nearly $6.3 million for her 2022 reelection campaign.",
    "Rep. Dan Crenshaw (R-Texas), is the second highest House Republican fundraiser in the 2022 cycle so far with $7.8 million.",
    "The 139 House Republicans who voted against certifying the 2020 election results were joined by eight Republican senators.",
    "Rep. Adam Kinzinger (R-Ill.), who also sits on the committee, announced in October that he would not run for reelection.",
    "The violent protest resulted in the death of five people, and the House later impeached Trump for inciting the violence.",
    "She was also one of 10 House Republicans who voted to impeach Trump for his actions in the leadup to, and on, Jan. 6.",
    "has raised more than $5.1 million in her reelection campaign — the sixth highest fundraiser of House Republicans.",
    "No allegations of fraud have been proven, and Biden won the 2020 election with 306 Electoral College votes.",
    "While Congress was in session on Jan. 6, a group of pro-Trump rioters stormed the Capitol.",
    "Greene, a top Trump ally, has also defended the rioters who entered the Capitol on Jan. 6.",
    "), was the second highest fundraiser of the House electoral objectors heading into 2022.",
    "The House Republican leader voted against certifying Arizona’s Electoral College vote.",
    "Another member of House Republican leadership, Minority Whip Steve Scalise (R-La.",
    "Cheney is now one of two House Republicans who sit on the Jan. 6 committee.",
    "Kennedy has raised nearly $14.4 million for his 2022 race through Sept. 30.",
    "In February 2021, the Senate acquitted Trump of the impeachment charge.",
    "Cheney was ousted from House leadership in 2021 for criticizing Trump.",
    "People were lied to,” Crenshaw told Hearst Newspapers on Jan. 7, 2021.",
    "Scalise has raised $7.4 million for his reelection campaign.",
    "“January 6 was just a riot at the Capitol,” Greene said.",
    "Just one of those senators, Sen. John Kennedy (R-La.",
    "Bannon’s case will go to trial in July.",
    "), is up for reelection in November.",
    "That is all that it ever was.",
    "Rep. Liz Cheney (R-Wyo.)"
  ]
}