{
  "id": 4570,
  "mediaId": 2690,
  "date": "2022-01-10",
  "headline": "BREAKING: Mike Lindell Files Lawsuit Against Nancy Pelosi",
  "image": "https://teaparty.org/wp-content/uploads/2019/12/Favicon-Tea-Party.png",
  "link": "https://teaparty.org/breaking-mike-lindell-files-lawsuit-against-nancy-pelosi-472833/",
  "mediaOutlet": "teapartyorg.ning.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5207,
    2765,
    3246,
    2999,
    3555,
    4617,
    4669,
    4345,
    2391
  ],
  "sentences": [
    "Letter from Bennie Thompson to Mark Meadows’ attorney concludes:\n“The Select Committee is left with no choice but to advance contempt proceedings and recommend that the body in which Mr. Meadows once served refer him for criminal prosecution” pic.twitter.com/ahiwtgTaub\n— Alayna Treene (@alaynatreene) December 8, 2021\nDavis, in the letter, asks Pelosi what decisions she’s made with the House Sergeant at Arms and the Capitol Police leading up to Jan.6, what the Speaker did that day, and why House officers she has control over are now withholding information that the GOP wants to know.",
    "MyPillow CEO Lindell seen entering WH with some dramatic notes, including talk of ‘martial law’ https://t.co/VR2qNgnudR pic.twitter.com/FxRmrs75rT\n— Conservative News (@BIZPACReview) January 16, 2021\nHowever, it’s critical to note that what Lindell had written on the paper was completely dismissed by then-President Trump, whom Lindell himself admitted seemed to be “disinterested” in the information that was being provided to him.",
    "Lindell has apparently also come under fire for entering the White House while carrying notes that mentioned the words “martial law.”\n“As BizPac Review reported in January 2021, the embattled pillow-maker was photographed with a handful of notes that appeared to contain some extreme rhetoric including requests for immediate staff changes and the phrase martial law if necessary upon the first hint of any…'” the publication noted.",
    "According to this report, “In a letter released Monday, Illinois Republican Rep. Rodney Davis, the ranking minority member of the House Administration Committee, questioned Pelosi in regards to her repeated refusal to cooperate over the past year with requests for information from House officers who answer directly to the Speaker’s office.”\nNew letter from @RodneyDavis and @HouseAdmnGOP.",
    "Promoted Content\n(TeaParty.org Exclusive) – Founder of “MyPillow” Mike Lindell, who has been an ardent supporter of President Donald Trump, has filed a lawsuit against Speaker of the House Nancy Pelosi on Wednesday as a means of preventing the Verizon company from handing over his communication records to the January 6 House investigation committee.",
    "“There is irony in the fact that at the same time House Democrats are holding witnesses in criminal contempt of Congress for raising genuine questions of legal privilege, you continue to obstruct Republican access to House records relating to the security preparedness of the Capitol complex,” Davis went on to write.",
    "According to BizPacReview, the lawsuit puts Pelosi, along with the committee who is currently investigating the events that transpired on January 6th, 2021, who are trying to get their grubby paws on Lindell’s phone records beginning on November 1, 2020 to January 31, 2021.",
    "Or, and here’s just a thought, perhaps they are trying to send a message to Lindell, who is a big time Trump backer who put on a symposium where he presented some pretty compelling evidence that demonstrated voter fraud took place in the 2020 presidential election.",
    "pic.twitter.com/6zVW0lE0Ni\n— Rep. Jim Jordan (@Jim_Jordan) January 3, 2022\nIn the meantime, those who support Donald Trump and refuse to comply with the requests being made by Pelosi and her committee end up getting indicted and held in contempt of Congress.",
    "The CEO claims that the committee receiving his digital record would ‘violate Lindell’s freedom of religion, speech, press, political expression and ability to associate with others to advance their shared beliefs,'” the report continued.",
    "“If you are truly interested in working with Republicans to improve the Capitol security posture, I demand that you direct all House officers immediately to stop obstructing our oversight,” Davis continued.",
    "Despite having a scheduled appearance for the rally that took place on January 6, Gorka submits that his speech was canceled, and he became a spectator to the events of that day,” BPR reported.",
    "“Lindell’s attorneys argue he had ‘no involvement whatsoever’ in the riots that took place at the Capitol, and his only interest was making sure the 2020 election results were legitimate.",
    "Former National Security Adviser Michael Flynn, former White House chief of staff Mark Meadows, attorney John Eastman and Trump advisor Steve Bannon are among them,” the report said.",
    "Gorka was not a member or leader of any organization that sponsored any events on January 6, and was not present at the Capitol on that day,” claims the attorney representing Gorka.",
    "Lindell is being made an example of to frighten anyone else who might be thinking of looking into the crooked Democrats and their plan to destroy our republic.",
    "“A number of other high-profile Trump supporters have also sued the committee for various reasons related to its investigation activities.",
    "“Sebastian Gorka also filed a lawsuit on Tuesday in an effort to block a subpoena for his phone records as well.",
    "And it seems that Lindell isn’t the only person who has been targeted who is now countersuing the committee.",
    "They are apparently trying to find out what role, if any, Lindell might have played in the Capitol riots.",
    "Clearly, he’s being targeted for standing up and daring to look into possible instances of voter fraud.",
    "He argues that he was not asked to answer any questions or produce additional documentation.",
    "Gorka maintains that the committee is overstepping its authority.",
    "And these folks aren’t the only ones coming after Pelosi either.",
    "So why is the committee trying to get these phone records?",
    "Steve Bannon is just one example that comes to mind.",
    "Talk about hypocrisy.",
    "Copyright 2022.",
    "Give it a read.",
    "TeaParty.org",
    "“Dr."
  ]
}