{
  "id": 4571,
  "mediaId": 2724,
  "date": "2022-01-12",
  "headline": "Tucker Carlson Goes All In: Blasts Fauci As ‘Filthy Little Demagogue’",
  "image": "https://thepoliticalinsider.com/wp-content/uploads/2022/01/2022.01.12-07.26-thepoliticalinsider-61df2b62c8129.jpg",
  "link": "https://thepoliticalinsider.com/tucker-carlson-goes-all-in-blasts-fauci-as-filthy-little-demagogue/",
  "mediaOutlet": "thepoliticalinsider.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Hanson",
  "authorUrl": "https://thepoliticalinsider.com/author/john-hanson/",
  "termIds": [
    1708,
    2119,
    4838,
    3016,
    3217,
    2765,
    1472,
    253
  ],
  "sentences": [
    "pic.twitter.com/8AWWLhMxNy\n— Scott Morefield (@SKMorefield) January 12, 2022\nRELATED: GOP Senator Slams ‘Least Trusted Bureaucrat’ After Fauci Is Caught On Hot Mic Calling Him A ‘Moron’\nCarlson Excoriates ‘Filthy Little Demagogue’ Fauci\nCarlson said at the beginning of his monologue, “Turns out, Tony Fauci’s even more loathsome and complicit even than his toughest critics ever alleged.”\n“Today, two Republican congressmen, James Comer and Jim Jordan, released emails that show Fauci was warned by scientists at the very beginning of the Corona pandemic this virus very likely leaked from the Wuhan Institute of Virology,” Carlson said.",
    "Or was their initial impression, Dr. Gary and others that were involved, was their initial impression actually that it looked very suspicious for a virus that came from a lab.”\nFauci replied, “Senator, we are here at a committee to look at a virus now that’s killed almost 900,000 people, and the purpose of the committee was to try to get things out how we can help to get the American public, and you keep coming back to personal attacks on me that have absolutely no relevance to reality.”\nThat response got under Carlson’s skin.",
    "pic.twitter.com/b6JCaaHQTR\n— Curtis Houck (@CurtisHouck) January 11, 2022\nRELATED: Top FBI Official Refuses To Answer Ted Cruz When Asked If Agents Took Part In January 6 Riot\nCarlson To Fauci: ‘So you’re not taking any responsibility for that?’\nCarlson later continued, “Meanwhile, Fauci refused to take any responsibility for the lockdowns that he supported that wrecked the country in a lot of ways.”\nThe Fox News host then played the clip of Paul asking, “Do you think the lockdowns were good for our kids?",
    "“That’s the same lab where a Fauci agency was funding gain-of-function research.”\nCarlson cited a letter from House Oversight Committee Republicans which read, “On February 1, 2020, Dr. Fauci, Dr. Collins, and at least 11 other scientists convened a conference call to discuss Covid 19… It was on this conference call that Drs.",
    "@RandPaul to Fauci: \"[T]he idea that a government official like yourself would claim unilaterally to represent science and that any criticism of you would be considered a criticism of science itself is quite dangerous…It is cheap politics & it is reprehensible.\"",
    "Fauci & Collins were first warned that Covid 19 may have leaked from the WIV &, further, may have been intentionally genetically manipulated.”\nSign up to receive the latest political news, insight, and commentary delivered directly to your inbox.",
    "Doesn’t answer the question, makes it all about him, solipsist that he is, and then he whips around and accuses Rand Paul of endangering his life.”\n“Fauci held up a page from Rand Paul’s website that read ‘Fire Tony Fauci.” Carlson noted.",
    "Do you think it’s a winning success what you’ve advocated for government?”\nFauci responded, “Senator, first of all, if you look at everything that I said, you accuse me of in a monolithic way telling people what they need to do.",
    "On Tuesday, Fox News’ Tucker Carlson blasted top White House doctor Anthony Fauci, calling him a “filthy little demagogue” after his exchange with Senator Rand Paul during a Senate hearing earlier that day.",
    "We’ve released never before seen emails showing Dr. Fauci may have concealed information about #COVID19 originating from the Wuhan lab & intentionally downplayed the lab leak theory.",
    "But it turned out to be very likely true.”\nCarlson then played video of the Paul and Fauci exchange, saying, “So today, Senator Rand Paul of Kentucky, asked Fauci about all this.",
    "So then Rand Paul says yeah, almost a million people have died but you were making the rules.”\n“So you’re not taking any responsibility for that?” a frustrated Carlson asked.",
    "He works for us, so we have a right not to want him to work for us anymore, that’s called democracy.”\nCarlson added, “But according to Fauci, that’s illegitimate.",
    "By subscribing, you agree to receive emails from ThePoliticalInsider.com and that you've read and agree to our privacy policy and to our terms and conditions.",
    "Carlson made his remarks during a monologue on his program “Tucker Carlson Tonight.”\nTucker Carlson on Dr. Fauci: \"Ugh, he's such a filthy little demagogue.",
    "Everything that I’ve said has been in support of CDC guidelines: wear a mask; get boosted…”\nCarlson snapped back, “Are you following the reasoning here?",
    "Doesn't answer the question, makes it all about him, solipsist that he is, and then he whips around and accuses Rand Paul of endangering his life.\"",
    "Watch how Fauci responds.”\nPaul asked Fauci on Tuesday, “Did scientists come to you privately and say, ‘No way this came from the lab’?",
    "pic.twitter.com/p8aIBJ3nom\n— Oversight Committee Republicans (@GOPoversight) January 11, 2022\n“So that’s news,” Carlson insisted.",
    "So the first time Rand Paul asks him a question Fauci says almost a million people have died, you can’t ask me that question.",
    "“By the way, that was a year before it became the common view of the origin of Covid,” Carlson added.",
    "You are the lead architect for the response from the government and now 800,000 people have died.",
    "You further agree that the use of reCAPTCHA is subject to the Google Privacy and Terms of Use.",
    "“Now, Fauci is the highest-paid federal employee and one of the longest-serving.",
    "“During that year, anyone who raised the question was denounced as a racist.",
    "More people have died now under President Biden than under President Trump.",
    "He blamed Rand Paul’s webpage for alleged threats of violence against him.",
    "In other words, if you criticized me you’re trying to get me killed.”\n.",
    "“He’s such a filthy little demagogue,” Carlson blared.",
    "@RepJamesComer & @Jim_Jordan want Fauci under oath.",
    "Do you think we slowed down the death rate?",
    "That letter is here:\n??BREAKING??",
    "You are the one responsible.",
    "“Filthy little demagogue.",
    "Anti-Asian or something.",
    "Filthy little demagogue.",
    "You are the architect.",
    "Time for answers.",
    "1/2??"
  ]
}