{
  "id": 4577,
  "mediaId": 2614,
  "date": "2022-01-15",
  "headline": "Conservative Pundit Suspended By YouTube Doubles Down, Dares Them In Based Email Response",
  "image": "https://www.lifezette.com/wp-content/uploads/2020/07/2020.07.08-01.34-lifezette-5f05cb53755d1-1200x740.png",
  "link": "https://www.lifezette.com/2022/01/conservative-pundit-suspended-by-youtube-doubles-down-dares-them-in-based-email-response/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Voice Media",
  "authorUrl": "https://www.lifezette.com/author/redvoicemedia/",
  "termIds": [
    2119,
    4449,
    4905,
    1629
  ],
  "sentences": [
    "Here’s Dan’s email to “Coco” at YouTube telling them to plant a big wet kiss on his ass pic.twitter.com/4yFeprnr3Y\n— Bongino Report (@BonginoReport) January 14, 2022\nHere is the full email:\nOnce again, the left is trying to keep power and control to ensure the American people only get the picture they want you to see and not the reality of what is going on.",
    "Jim Jordan Completely Shreds Biden & The Dems On COVID, Elections & More In Epic Two Minute Speech [VIDEO]\nStew Peters’ Viewers Create Temporary Victory In Scott Quiner Case- Mercy Hospital Ordered To Not Kill Him\nThe opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "Dan Bongino responded to YouTube suspending his account after the Biden Administration asked Big Tech to censor anyone who questions Biden’s regime with a feisty response, telling YouTube to, Kiss my a**.”\nBongino had posted a video to YouTube stating that masks are “useless” in stopping the spread of Covid19.",
    "YouTube’s policies specifically prohibit anyone from stating that masks are ineffective at stopping the spread of Covid19.",
    "Well, if YouTube was expecting some type of apology from Bongino, it is safe to say that day would never come.",
    "— Bongino Report (@BonginoReport) January 15, 2022\nThis piece was written by Zach Heilman on January 15, 2022.",
    "The Big Tech company suspended Bongino’s channel for a week on Friday and demonetized it for 30 days.",
    "The company claims Bongino violated their policies by spreading misinformation about Covid19.",
    "Instead, Bongino had a few choice words for the platform after his account was suspended.",
    ":\nYouTube just suspended Dan’s channel for daring to question the mask fascists.",
    "It originally appeared in RedVoiceMedia.com and is used by permission.",
    "400 Athletes Collapsing & Dying Just In The Last 6 Months?",
    "We couldn’t be prouder to fight this fight with you.",
    "I guess they were waiting for an apology from us.",
    "But that’s not quite how it worked out for them.",
    "The reason is that the “science” says otherwise.",
    "Read more at RedVoiceMedia.com:\nThe New Normal?",
    "More big news this week on this victory.",
    "We kicked the shit out of YouTube today.",
    "It was a good day.",
    "Thank you all!",
    "BREAKING ??",
    "Goodnight!"
  ]
}