{
  "id": 4600,
  "mediaId": 6746,
  "date": "2022-01-11",
  "headline": "Ohio Rep. Jim Jordan Refuses To Cooperate in the Jan. 6 Capitol Riot Investigation, Accuses Democrats of Engaging in Partisan Witch Hunt",
  "image": "https://1075914428.rsc.cdn77.org/data/images/full/268357/ohio-rep-jim-jordan-refuses-to-cooperate-in-the-jan-6-capitol-riot-investigation-accuses-democrats-of-engaging-in-partisan-witch-hunt.jpg",
  "link": "https://www.hngn.com/articles/239956/20220111/ohio-rep-jim-jordan-refuses-cooperate-jan-6-capitol-riot.htm",
  "mediaOutlet": "hngn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camille Heimbrod",
  "authorUrl": "https://www.hngn.com/reporters/camille-heimbrod",
  "termIds": [
    0
  ],
  "sentences": [
    "Read Also: Conservative Attorney Warns Americans Against Donald Trump Staging a Coup in 2024, Says Jan. 6 Capitol Riot Was Just a Rehearsal\nJim Jordan previously vowed to cooperate in the investigation\nA spokesperson for the committee revealed that Jordan previously said he would cooperate with the investigation.",
    "Trump's former chief executive officer, Steve Bannon, was also subpoenaed by the committee alongside former White House Deputy Chief of Staff Don Scavino and former Defense Department official Kash Patel, according to Franche 24.",
    "The committee also wants to gather information from Jordan's meeting with Trump and his administration in November, December 2020, and January 2021 about their plans to overturn the election result.",
    "Donald Trump's allies subpoenaed to testify\nAs of late, it's unclear whether or not the committee could force Jordan to detail the conversation that he had with Trump during the Capitol riot.",
    "This request is far outside the bounds of any legitimate inquiry, violates core constitutional principles and would serve to further erode legislative norms,\" he said via the Huffington Post.",
    "Ohio Rep. Jim Jordan once again reiterated that he doesn't have any key information about the Jan. 6 Capitol riot that could help the House select committee with their ongoing investigation.",
    "Rep. Bennie Thompson wants Jim Jordan to speak out\nLast month, committee chairman Rep. Bennie Thompson sent Jordan a letter requesting his cooperation in the investigation.",
    "Since Trump and Jordan spoke at least once on the day of the insurrection, Thompson believes that the two may have discussed something pertaining to the Capitol riot.",
    "Jordan, a known Trump ally, doesn't also think that the House select committee must investigate the events that took place before, during, and after the siege.",
    "Trump's former chief of staff, Mark Meadows, previously submitted copies of his documents and communication pertaining to the events on Jan. 6, 2021.",
    "Related Article: Capitol Riot Committee Rep. Bennie Thompson Could Ask Mike Pence To Testify in the Investigation; Former VP To Receive Subpoena",
    "But they think that he had a change of heart because Trump and his allies persuaded Jordan to speak out, according to Business Insider.",
    "Meanwhile, several other individuals have already been called to share their accounts before, during, and after the Capitol riot.",
    "However, Jordan said that he didn't have any relevant information and refused to follow through with Thompson's request.",
    "However, these numbers are still a far cry from the number of people that the committee still needs to investigate.",
    "After all, it is estimated that between 2,000 and 2,500 people entered the US Capitol last year, according to NPR.",
    "The Republican believes that the committee and the Democrats engage in a so-called partisan witch hunt.",
    "After all, some former Trump supporters were already forced to open up and expose Trump's involvement.",
    "After all, Trump has been trying to stop the committee from gaining access to his private documents.",
    "\"The American people are tired of Democrats' nonstop investigations and partisan witch hunts.",
    "At least 165 pleaded guilty, and around 145 of them have already been charged.",
    "It is also unclear if the ex-POTUS will be subpoenaed to discuss the riot.",
    "Over 700 people have also been arrested in connection to the siege.",
    "Some of the charges include misdemeanors and felonies.",
    "He also wants executive privilege to be exercised."
  ]
}