{
  "id": 4820,
  "mediaId": 2643,
  "date": "2022-04-23",
  "headline": "Mark Meadows Aide Names Lawmakers in Trump WH Meetings Leading Up to 1/6",
  "image": "",
  "link": "https://www.newsweek.com/mark-meadows-aide-names-lawmakers-trump-wh-meetings-leading-1-6-1700322",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fatma Khaled",
  "authorUrl": "https://www.newsweek.com/authors/fatma-khaled",
  "termIds": [
    0
  ],
  "sentences": [
    "Cassidy Hutchinson, an aide for former White House chief of staff Mark Meadows, listed the names of Donald Trump allies, who were involved in meetings and phone calls with the former president and his top aides leading up to the January 6, 2021 Capitol riot, according to excerpts from a testimony released in a federal court filing on Friday.",
    "\"I just remember Mr. Ornato coming in and saying that we had intel reports saying that there could potentially be violence on the 6th,\" she said, in an apparent reference to senior Secret Service official Anthony Ornato, according to CBS News.",
    "She noted in her testimony that those who attended meetings in December leading up to the January 6, 2021 event included GOP Georgia Representatives Marjorie Taylor Greene and Jody Hice, in addition to Arizona's Paul Gosar and Debbie Lesko.",
    "Plans were being discussed during those meetings in an effort to extend Trump's presidency including a strategy in which the then-Vice President Mike Pence would play a role in not certifying President Joe Biden's win.",
    "Rudy Giuliani, Trump's personal lawyer at the time, was present at those meetings as well as members who were from the House Freedom Caucus including Representatives Mo Brooks of Alabama and Andy Biggs of Arizona.",
    "\"They felt that he had the authority to—pardon me if my phrasing isn't correct on this, but—send votes back to the States or the electors back to the States,\" Hutchinson recounted, according to the court filing.",
    "According to the filing, Hutchinson told the January 6 House select committee investigating the Capitol riot that top Trump allies in Congress were involved in efforts to overturn the 2020 election results.",
    "\"[H]e was not acting as anything like a typical White House Chief of Staff advising the President on official matters of government policy,\" House General Counsel Doug Letter said, according to Politico.",
    "The select committee also mentioned in the court filing that Meadows turned over 2,319 text messages, but didn't show over 1,000 others, according to Politico.",
    "\"I know that people had brought information forward to him that had indicated that there could be violence on the 6th,\" Hutchinson told the House committee.",
    "Friday's court filing is part of the committee's effort to encourage testimony from Meadows, who is citing executive privilege in response to a subpoena.",
    "GOP Representatives Scott Perry of Pennsylvania, Louie Gohmert of Texas, Jim Jordan of Ohio, and Matt Gaetz of Florida also attended those meetings.",
    "\"Mr. Meadows was playing a campaign role, attempting to facilitate a strategy that would have reversed the certified results of the 2020 election.\"",
    "\"But, again, I'm not sure what he did with that information internally.\"",
    "Hutchinson also said that Meadows was warned about January 6 violence.",
    "Newsweek reached out to Trump's media office for comment.",
    "\"And Mr. Meadows said: 'All right.",
    "Let's talk about it.'\""
  ]
}