{
  "id": 4863,
  "mediaId": 2679,
  "date": "2022-04-23",
  "headline": "Filing provides new details on Trump White House planning for Jan. 6",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/nation-politics/filing-provides-new-details-on-trump-white-house-planning-for-jan-6/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ALAN FEUER",
  "authorUrl": "https://www.seattletimes.com/author/cap-alan-feuer/",
  "termIds": [
    5732,
    2119,
    2391,
    3037,
    2969,
    2765,
    520,
    6175,
    6709
  ],
  "sentences": [
    "Advertising\n Skip Ad\nIn a newly disclosed email sent to Meadows on Dec. 22, 2020, Waldron included an 18-page document that he described as a “National Asset Tasking request.”\nThe document was essentially a proposal seeking presidential approval for agencies like the FBI and the National Security Agency to search their databases for people and internet addresses connected to Dominion that Waldron thought might have information on the supposed hacking scheme.",
    "WASHINGTON, D.C. — Before the Jan. 6 attack on the Capitol, Trump White House officials and members of the right-wing House Freedom Caucus strategized about a plan to direct thousands of angry marchers to the building, according to newly released testimony obtained by the House committee investigating the 2021 riot and former President Donald Trump’s efforts to overturn the election.",
    "“They felt that he had the authority to — pardon me if my phrasing isn’t correct on this, but — send votes back to the states or the electors back to the states,” Hutchinson testified, adding that they had appeared to embrace a plan promoted by conservative lawyer John Eastman that members of both parties have likened to a blueprint for a coup.",
    "She said Republican members of Congress involved in the discussions included Jordan; Perry; Reps. Andy Biggs, Paul Gosar and Debbie Lesko of Arizona; Rep. Mo Brooks of Alabama; Rep. Matt Gaetz of Florida; Reps. Marjorie Taylor Greene and Jody Hice of Georgia; Rep. Louie Gohmert of Texas; and Rep. Lauren Boebert of Colorado.",
    "?”\nThe filing also shows Meadows was in contact with Phil Waldron, a retired Army colonel with training in psychological operations who was among a group of plotters who pushed extreme plans to persuade Trump to use his national security apparatus to seize control of the country’s voting machines in a bid to stay in power.",
    "In his book, “The Chief’s Chief,” Meadows said Trump “ad-libbed a line that no one had seen before” when he told the crowd to march, adding that the president “knew as well as anyone that we wouldn’t organize a trip like that on such short notice.”\nAdvertising\n Skip Ad\nHutchinson’s testimony contradicts those statements.",
    "Two rally organizers, Dustin Stockton and his fiancee, Jennifer L. Lawrence, have also provided the committee with evidence that they were concerned that a march to the Capitol on Jan. 6 would mean “possible danger” and that Stockton’s “urgent concerns” were escalated to Meadows, according to the committee.",
    "Advertising\n Skip AdSkip AdSkip Ad\nHutchinson’s testimony and other materials disclosed by the committee in a 248-page court filing Friday added new details and texture to what is publicly known about the discussions in Trump’s inner circle and among his allies in the weeks preceding the Jan. 6 assault.",
    "Two weeks earlier, Alexander disclosed that he had received a subpoena from a federal grand jury that is seeking information on a broad swath of people — rally planners, members of Congress and White House officials — who played a role in the political events that preceded the attack on the Capitol.",
    "Most Read Nation & World Stories\nHutchinson’s testimony indicated that members of the Freedom Caucus were also involved in plans to pressure Vice President Mike Pence to throw out electoral votes from states won by Joe Biden and accept false certificates claiming those states had voted for Trump.",
    "On a planning call that included Mark Meadows, White House chief of staff; Rudy Giuliani, Trump’s personal lawyer; Rep. Jim Jordan, R-Ohio; and other Freedom Caucus members, the group discussed the idea of encouraging supporters to march to the Capitol, according to one witness’s account.",
    "Working with others like pro-Trump lawyer Sidney Powell and former national security adviser Michael Flynn, Waldron circulated a conspiracy theory that foreign actors had hacked into voting machines made by Dominion Voting Systems in an effort to flip votes from Trump to Biden.",
    "They’re going to go up to the Capitol.”\nAnd, speaking about the planning call involving Meadows and Freedom Caucus members, a committee investigator asked her whether Perry supported “the idea of sending people to the Capitol on January the 6th.”\n“He did,” Hutchinson replied.",
    "The nearly 2-mile march from the president’s “Stop the Steal” rally at the Ellipse to the Capitol, where parts of the crowd became a violent mob, has become a focus of the House committee and the Justice Department as they investigate who was responsible for the violence.",
    "This month, they pressed its author, Stephen Miller, a former top White House adviser, on whether Trump’s repeated use of the word “we” had been an effort to direct his supporters to join him in moving on the Capitol to stop Congress from certifying his defeat.",
    "Meadows and members of the Freedom Caucus, who were deeply involved in Trump’s push to overturn the 2020 election, have condemned the violence at the Capitol on Jan. 6 and defended their role in spreading the lie of a stolen election.",
    "On Wednesday, Jones revealed that he had recently asked the Justice Department for a deal under which he would grant a formal interview to the government about his role in the events of Jan. 6 in exchange for not being prosecuted.",
    "Constitution gives the authority to state legislatures to appoint presidential electors.”\nMitchell had sent a version of the email one day earlier to Sen. Mike Braun, R-Ind., in advance of the senator appearing on television.",
    "When Mitchell forwarded the email to Meadows, she wrote, “This is what I prepared and sent to Sen. Braun last night to help prepare him for ABC appearance this a.m. Can the WH press office get and start using?",
    "It disclosed testimony that Meadows was told that plans to try to overturn the 2020 election using so-called alternate electors were not “legally sound” and that the events of Jan. 6 could turn violent.",
    "You have to show strength.” He did so after the White House’s chief of operations had told Meadows of “intel reports saying that there could potentially be violence on the 6th,” according to the filing.",
    "The idea was endorsed by Rep. Scott Perry, R-Pa., who now leads the Freedom Caucus, according to testimony by Cassidy Hutchinson, an aide to Meadows, and no one on the call spoke out against the idea.",
    "Sponsored\n Skip Ad\n Skip Ad\n Skip Ad\n Skip Ad\nHutchinson suggested that White House lawyers had found the plan was not “legally sound” but that Meadows allowed it to move forward nonetheless.",
    "Advertising\n Skip AdSkip AdSkip Ad\nJoining Alexander that day was Alex Jones, founder of conspiracy-driven media outlet Infowars, who encouraged the crowd by shouting about 1776.",
    "The filing also disclosed new details of Meadows’ involvement in attempts to pressure Brad Raffensperger, the Georgia secretary of state, over Trump’s loss there.",
    "The committee’s filing also contained an email revealing that a pro-Trump lawyer, Cleta Mitchell, also played a role in promoting the alternate elector scheme.",
    "Alexander, at the request of aides to Trump, left the speech before it was over and marched near the head of a crowd that was moving toward the building.",
    "Rally planners, such as prominent “Stop the Steal” organizer Ali Alexander, also had a hand in getting people to move from the Ellipse to the Capitol.",
    "But on Jan. 6, Trump encouraged a crowd of thousands to march to the building, telling them: “You’ll never take back our country with weakness.",
    "The email, which Mitchell sent to Meadows on Dec. 6, 2020, included a list of “key points” about the plan, noting, for example, that the “U.S.",
    "At rallies in Washington in November and December 2020, Trump’s supporters did not march to the Capitol and mostly refrained from violence.",
    "“I don’t think there’s a participant on the call that had necessarily discouraged the idea,” Hutchinson told the committee’s investigators.",
    "The Justice Department and the committee have been investigating the question of how the crowd moved from the Ellipse to the Capitol.",
    "A spokesperson for Perry, who has refused to speak to the committee, did not immediately respond to a request for comment.",
    "The filing is part of the committee’s effort to seek the dismissal of a lawsuit brought against it by Meadows.",
    "Even so, he pushed forward with the rally that led to the march on the Capitol, according to the filing.",
    "(Ultimately, 147 congressional Republicans voted to object to Biden’s victory in at least one state.)",
    "She said Meadows had said “in casual conversation”: “Oh, we’re going to have this big rally.",
    "Waldron wrote that he had discussed the plan with Meadows in his office the day before.",
    "Committee investigators have, for instance, obtained draft copies of Trump’s speech.",
    "This story was originally published at nytimes.com.",
    "People are talking about it on social media.",
    "Read it here."
  ]
}