{
  "id": 4916,
  "mediaId": 2570,
  "date": "2022-04-23",
  "headline": "Kevin McCarthy’s Awful Few Days: Embarrassing Leaks—And More Unwanted Cawthorn And Marjorie Taylor Greene Stories",
  "image": "",
  "link": "https://www.forbes.com/sites/nicholasreimann/2022/04/23/kevin-mccarthys-awful-few-days-embarrassing-leaks-and-more-unwanted-cawthorn-and-marjorie-taylor-greene-stories/?sh=538b1e67504e",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicholas Reimann",
  "authorUrl": "https://www.forbes.com/sites/nicholasreimann/",
  "termIds": [
    5399,
    2187,
    2119,
    4596,
    3879,
    4066,
    2943,
    3514,
    1489
  ],
  "sentences": [
    "Friday: Then, hard-right Rep. Marjorie Taylor Greene (R-Ga.) gave testimony in a challenge to her candidacy over her alleged participation in efforts to overturn the 2020 election, claiming that she thought that rioters breaking into the Capitol on January 6, 2021, were members of “antifa or BLM.”\nFriday afternoon: Politico published photos showing Cawthorn, who claims he lives by traditional Christian values, drinking and wearing women's lingerie at a party, which he later defended as “goofy vacation photos during a game on a cruise.”\nFriday night: Yet more troubling news broke when the January 6 committee filed deposition excerpts alleging several prominent House Republicans, including Reps. Jim Jordan (Ohio), Louie Gohmert (Tex.)",
    "Topline\nPhotos that surfaced Friday afternoon of right-wing firebrand Rep. Madison Cawthorn (R-N.C.) donning women’s lingerie were only the latest embarrassment for House Republicans--and House Minority Leader Kevin McCarthy (R-Calif.) in particular--during a remarkable few days, though it remains unclear exactly if there will be any long-term political consequences.",
    "Thursday morning: The most damning story of the week came when the New York Times published an excerpt from the book This Will Not Pass, by Times reporters Jonathan Martin and Alexander Burns, which claimed that McCarthy initially planned to push former President Donald Trump to resign in the days following the January 6 Capitol rioting.",
    "McCarthy said last month that Cawthorn had lost his trust and urged the 26-year-old congressman to make life choices to “turn himself around” after Cawthorn absurdly claimed D.C. political figures invited him to orgies and did cocaine in front of him.",
    "McCarthy has been open about his ambitions to become House Speaker if Republicans retake the chamber and has publicly tried to maintain good relations with the growing hard-right wing of his caucus, despite reportedly voicing some private misgivings.",
    "Thursday's Times report, for example, stated McCarthy told fellow lawmakers he hoped big tech companies like Twitter and Facebook would delete the accounts of Republicans who pushed Trump's false claims of widespread election fraud.",
    "Polling suggests Republicans are strongly positioned to win back both the House and Senate in the midterms, as Democrats struggle to overcome President Joe Biden’s slumping approval rating and issues like sky-high inflation persist.",
    "Thursday night: McCarthy quickly moved to deny the report, calling it \"false and wrong,\" but by Thursday night, MSNBC shared a leaked audio conversation (provided by the Times reporters) between McCarthy and Rep. Liz Cheney (R-Wyo.)",
    "Key Facts\nTuesday: Released dashcam footage shows Cawthorn being pulled over for a traffic stop and eventually charged with driving with a revoked license—he has two previous speeding violations in the past six months.",
    "The two spoke after MSNBC published the leaked audio Thursday night, but the ex-president told McCarthy he was not upset about his comments, according to the Washington Post.",
    "And Trump told the Wall Street JournalFriday he even took it as a “compliment” McCarthy and other early Republican critics “realized they were wrong and supported me.”",
    "and Matt Gaetz (Fla.) held meetings with then White House chief of staff Mark Meadows in December 2020 to strategize how to overturn the results of the 2020 election.",
    "The turbulent stretch for Republicans comes as campaign season for the 2022 midterms heats up.",
    "confirming the top House Republican discussed asking Trump to resign.",
    "Trump could be the saving grace for McCarthy's aspirations."
  ]
}