{
  "id": 4967,
  "mediaId": 2548,
  "date": "2022-04-23",
  "headline": "Jim Jordan Says IRS Can’t Be Trusted After ‘Partisan’ Leak Investigation Stonewalls",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/04/2019-09-17T183136Z_1583870179_RC15F4141A70_RTRMADP_3_USA-TRUMP-IMPEACHMENT-scaled-e1650656070133.jpg",
  "link": "https://dailycaller.com/2022/04/23/jim-jordan-irs-treasury-propublica-leak-billionaire/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laurel Duggan",
  "authorUrl": "https://dailycaller.com/author/LDuggan",
  "termIds": [
    5582,
    5325,
    5074,
    2119,
    3373,
    4067,
    648,
    1382
  ],
  "sentences": [
    "This is one of the hallmarks of our system and if that’s not the case, if they’re going to be targeted by the IRS like Lois Lerner did a few years ago and have their returns go public, that just can’t happen.” (RELATED: National School Board Association Calls On The Biden Admin To Police Parents Using Domestic Terror Laws)\nUpon receiving Jordan and Issa’s 2021 letter demanding answers, IRS Commissioner Charles Rettig referred them to Inspector General for Tax Administration J. Russell George, according to responses to the inquiries reviewed by the DCNF.",
    "Jordan and Republican California Rep. Darrell Issa sent letters to the IRS and the Treasury Inspector General for Tax Administration (TIGTA) in July 2021 demanding information on the agency’s investigation into how citizens’ records were leaked after ProPublica published private tax documents of some of the wealthiest Americans in June 2021.",
    "“Literally five days later, the attorney general of the United States issues a memorandum to all U.S. attorneys doing exactly what the letter asked the Biden administration to do.”\nProPublica referred the DCNF to an article about their decision to publish the tax documents but did not comment further on the source of the leaks.",
    "“You saw it with the IRS 12 years ago, you saw it with the FBI five years ago when they orchestrated the spying on the Trump campaign, you’ve seen it more recently with the Department of Justice effort after a letter comes in to the Biden administration from the school boards association,” Jordan told the DCNF.",
    "George replied that the Republican lawmakers’ request for TIGTA to brief Congress on the investigation could only be made by either the chair of the House Ways and Means Committee, the Joint Committee on Taxation or the Senate Finance Committee – all of whom happen to be Democrats.",
    "Moreover, House Ways and Means Committee Ranking Member Kevin Brady and Senate Finance Committee Ranking Member Mike Crapo sent a letter Monday to Treasury Secretary Janet Yellen demanding an update on the department’s investigation into the leaks.",
    "Republican Ohio Rep. Jim Jordan told the Daily Caller News Foundation that Americans can’t trust the Internal Revenue Service (IRS) after its investigation of tax document leaks has so far failed to turn up any answers ten months after it began.",
    "Rettig told the lawmakers that TIGTA had “taken the lead in the investigation” and had “sole jurisdiction” over the case if an IRS employee was found to have leaked the private tax records, according to the responses.",
    "“This is the same IRS that 12 years ago was targeting conservatives,” he added, referring to the IRS delaying tax exemption applications for conservative nonprofits during the Obama administration.",
    "Republican Ohio Rep. Jim Jordan said Americans couldn’t trust the Internal Revenue Service (IRS) after it failed to provide answers about a massive leak of confidential tax documents.",
    "“This looks just like one more example of the government being weaponized against we the people, against the American citizens,” Jordan told the Daily Caller News Foundation.",
    "The leaks of billionaires’ tax records to ProPublica seemed partisan, according to Jordan, and closely aligned with Democrats’ efforts to raise taxes on the wealthy.",
    "Jordan suggested the leaks may be part of a broader trend of the federal government being “weaponized against … the American citizens” to advance a political agenda.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "“Somehow taxpayer returns went public right when the Democrats were talking about raising taxes on the wealthy,” Jordan told the DCNF.",
    "That was the last update Jordan’s office received about the matter, a spokesman for Jordan’s office told the DCNF.",
    "Jordan told the DCNF that after an initial reply, his office has received no further updates on the investigation.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "Jordan said the IRS leaks appeared to be “partisan” and coincided with Democrats’ calls for tax increases.",
    "Neither the IRS nor the Treasury Department responded to multiple requests for comment from the DCNF.",
    "It sure doesn’t seem like it from the response we got back from them,” Jordan told the DCNF.",
    "Their request has so far gone unanswered, according to a Friday press release.",
    "“Americans need to know that your tax returns remain confidential.",
    "“I don’t know if the IRS is on top of it."
  ]
}