{
  "id": 5086,
  "mediaId": 2644,
  "date": "2022-04-23",
  "headline": "Meadows had been warned of possible Jan. 6 violence: official",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/04/newspress-collage-22010370-1650699162639.png?w=1024",
  "link": "https://nypost.com/2022/04/23/mark-meadows-was-warned-of-possible-jan-6-violence-at-capitol/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jesse O’Neill",
  "authorUrl": "",
  "termIds": [
    2391,
    2119,
    4589,
    4905,
    3621,
    2765,
    1191,
    6709
  ],
  "sentences": [
    "Cassidy Hutchinson, who served as a special assistant in White House during the Trump administration, told the investigating committee “there were concerns brought forward” to Meadows ahead of the day that a pro-Trump mob stormed the Capitol, according to the newly released transcripts of the testimony.",
    "Former White House chief of staff Mark Meadows had been advised of intelligence reports indicating the potential for violence at the Capitol on Jan. 6, 2021, according to new evidence released Friday night connected to the House committee’s investigation into the riot.",
    "Rep. Jim Jordan of Ohio suggests in a late text on Jan. 5 that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows responded to Jordan via text early the next morning.",
    "Let’s talk about it.’”\nHutchinson’s testimony was submitted to by lawmakers to federal court in Washington DC in an effort to legally compel Meadows to meet with the panel after he sued them in an attempt to prevent speaking on the record.",
    "“I just remember Mr. Ornato coming in and saying that we had intel reports saying that there could potentially be violence on the 6th,” Hutchinson said, apparently referencing Anthony Ornato, a senior Secret Service official.",
    "We gotta get going!”\nHutchinson, according to the testimony released Friday, also described several calls involving Meadows and members of the House Freedom Caucus in late November and early December.",
    "The select committee said Friday that Meadows initially turned over 2,319 text messages, but withheld more than 1,000 others on grounds of executive privilege, which was waived by President Biden.",
    "In the calls, the participants discussed what Pence’s role could be on Jan. 6, besides the ceremonial role he was required to play in certifying the election results.",
    "Not sure it is going to happen.”\nPennsylvania Rep. Scott Perry was texting Meadows as early as Dec. 26: “Mark, just checking in as time continues to count down.",
    "Friday’s filing also includes a number of new texts that Meadow submitted to the committee, including some from House Republicans pushing him to act.",
    "It was unclear what, if anything, Meadows did with the intelligence, Hutchinson said.",
    "11 days to 1/6 and 25 days to inauguration.",
    "“And Mr. Meadows said: ‘All right.",
    "“I have pushed for this.",
    "With AP wires"
  ]
}