{
  "id": 5139,
  "mediaId": 2631,
  "date": "2022-04-23",
  "headline": "Meadows was warned Jan. 6 could turn violent, former White House official says",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220423-mark-meadows-mjf-0944-500749.jpg",
  "link": "https://www.nbcnews.com/politics/politics-news/meadows-was-warned-jan-6-turn-violent-former-white-house-official-says-rcna25706",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4617,
    4905,
    2765,
    2887,
    2391,
    1783
  ],
  "sentences": [
    "In its Friday filing, the panel said they’re looking to get Meadows on the record on seven specific topics, including testimony about communication with Congress before Jan. 6, 2021; White House plans to replace the leadership of Justice Department so the department could pursue Trump’s bogus claims of election fraud; and efforts to create alternate, or fake, slates of state electors who could change the outcome of the vote of the 2020 election that Democrat Joe Biden won.",
    "In a statement, Reps. Bennie Thompson, D-Miss., chair of the committee, and Liz Cheney, R-Wyo., vice chair and one of two Republicans on the panel, said their latest filing “urges the Court to reject Mark Meadows’s baseless claims and put an end to his obstruction of our investigation.”\nThey argued that it’s “essential that the American people fully understand” Meadows’ role in the events that occured on Jan. 6 as well as in the days before and after the attack.",
    "“I know that there were concerns brought forward to Mr. Meadows,” Hutchinson said, adding she was unsure if he “perceived them as genuine concerns.”\n“But, again, I’m not sure if he — what he did with that information internally,” Hutchinson said.",
    "A former White House official warned Mark Meadows, who served as former President Donald Trump’s chief of staff, that the events of Jan. 6, 2021, could turn violent, according to a court filing from the House panel investigating the Capitol riot.",
    "Cassidy Hutchinson, a special assistant in the Trump White House, said Meadows received information before the day of the attack that “indicated that there could be violence,” according to transcripts contained in the 248-page filing late Friday.",
    "Rep. Jamie Raskin, D-Md., who sits on the committee, said this week that members will present “evidence” during the upcoming hearings to prove there was coordination among Trump, his inner circle and those who stormed the Capitol.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nThe panel has ramped up its investigation in recent months ahead of public hearings expected in June.",
    "Meadows sued the committee in December, hours after it said it plans to move forward with contempt proceedings against him over his refusal to answer questions about the attack.",
    "In his lawsuit against the panel, he argued that the panel issued subpoenas without legal authority and that he is immune from having to testify due to his White House role.",
    "Jan. 6 committee investigates events up to a year before Capitol riot\nFeb. 8, 202204:07\nIt was not clear from Hutchinson’s testimony what intel Meadows allegedly received.",
    "Ornato coming in and saying that we had intel reports saying that there could potentially be violence on the 6th.",
    "The House later voted to refer Meadows to the Justice Department for a potential contempt of Congress charge.",
    "Meadows has handed over thousands of text messages, but has refused to sit for an interview.",
    "Let’s talk about it,” in apparent reference to Anthony M. Ornato, a Secret Service official.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "NBC News has reached out to Meadows’ attorney for comment.",
    "Hutchinson said she remembers “Mr.",
    "And Mr. Meadows said: All right."
  ]
}