{
  "id": 5170,
  "mediaId": 2607,
  "date": "2022-04-23",
  "headline": "Official: Meadows had been warned of possible 1/6 violence",
  "image": "",
  "link": "https://lasvegassun.com//news/2022/apr/22/official-meadows-had-been-warned-of-possible-16-vi/",
  "mediaOutlet": "Las Vegas Sun",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "It says the committee has refined the scope of its request to focus on seven specific topics, including testimony about communication with Congress before Jan. 6; about White House plans to replace the leadership of the Justice Department so the department could pursue Trump's bogus claims of election fraud; and about efforts to create alternate, or fake, slates of state electors who could change the outcome of the presidential vote.",
    "By Farnoush Amiri, Eric Tucker and Mary Clare Jalonick, Associated Press\nWASHINGTON — A former White House official told the House committee investigating the Jan. 6, 2021, insurrection at the U.S. Capitol that President Donald Trump's chief of staff, Mark Meadows, had been advised of intelligence reports showing the potential for violence that day, according to transcripts released late Friday night.",
    "Meadows’ former colleague and close friend, Rep. Jim Jordan of Ohio, suggests in a late text on Jan. 5 — the day before Congress was due to certify Joe Biden's electoral victory — that Vice President Mike Pence “should call out all electoral votes that he believes are unconstitutional as no electoral votes at all.”\nMeadows texted back in the early hours of Jan. 6: “I have pushed for this.",
    "Let’s talk about it.’”\nThe filing Friday is the latest volley in a months-long legal fight over the extent to which Meadows, a close Trump ally whose proximity to the president has made him a key target of House Democrats, can be forced to cooperate with the committee's investigation.",
    "A week later, on Jan. 3, Clark attended a meeting at the White House with Trump, where the prospect of elevating Clark to the role of acting attorney general was discussed — but adamantly resisted by Justice Department officials, who threatened to resign, and White House lawyers.",
    "Hutchinson, for instance, described several calls involving Meadows and members of the far-right House Freedom Caucus in late November and early December in which participants discussed what Pence’s role could be on Jan. 6, besides the ceremonial role he was required to play.",
    "Besides describing warnings of potential violence provided to Meadows, she also revealed how the White House counsel's office cautioned against plans to enlist fake electors in states, including in meetings involving Meadows and Trump lawyer Rudy Giuliani.",
    "The criminal case against Meadows is more complex than that presented against Bannon, in part because Meadows was a White House chief of staff and because he had begun to cooperate with the committee, even providing documents to the nine-member panel.",
    "Meadows' lawsuit asked a judge to invalidate two subpoenas that he received from the committee, alleging they were “overly broad and unduly burdensome.” The suit accused the committee of overreaching by subpoenaing Verizon for his cell phone records.",
    "Though Meadows supplied the committee with thousands of text messages, he refused to sit for an interview, argued that he was immune from having to testify by virtue of his White House position and instead sued the committee.",
    "“I just remember Mr. Ornato coming in and saying that we had intel reports saying that there could potentially be violence on the 6th,” Hutchinson said, presumably referencing Anthony Ornato, a senior Secret Service official.",
    "Cassidy Hutchinson, who served as a special assistant in the Trump White House, told the committee “there were concerns brought forward” to Meadows ahead of the riot but it was unclear what Meadows did with that information.",
    "The testimony released Friday also reinforced how certain Republican members of Congress were deeply involved in White House discussions about overturning the election in the months leading to the deadly insurrection.",
    "We gotta get going!”\nIn the texts released by the committee, Perry encouraged Meadows to talk to Jeffrey Clark, an assistant attorney general who was sympathetic to Trump’s bogus claims of election fraud.",
    "Meadows' attorney, George Terwilliger, has previously defended his client by noting that due to Meadows' willingness to turn over records, he should not be compelled to appear for an interview.",
    "While an earlier contempt referral against former Trump adviser Steve Bannon resulted in an indictment, the Justice Department has been slower to decide whether to prosecute Meadows.",
    "On those calls, according to Hutchinson, were representatives from Trump's legal team, including Giuliani, Jenna Ellis and Sidney Powell, as well as Jordan and Perry.",
    "Not sure it is going to happen.” Pence ultimately resisted the overwhelming pressure from Trump and his allies and did not attempt to object to Biden's certification.",
    "After the complaint was filed, the select committee sent a contempt of Congress charge against Meadows to the House floor, where it passed on a near-party-line vote.",
    "The filing also includes new text messages that Meadows turned over to the committee, including several from GOP members of Congress who were pushing him to act.",
    "The committee released as exhibits to the complaint excerpts of testimony from multiple witnesses it has interviewed, including Hutchinson.",
    "Pennsylvania Rep. Scott Perry was texting Meadows as early as Dec. 26: “Mark, just checking in as time continues to count down.",
    "The filing seeks a court ruling in the committee's favor that would compel Meadows' cooperation.",
    "It was the first time the chamber had voted to hold a former member in contempt since the 1830s.",
    "Terwilliger did not immediately return an email seeking comment Friday night.",
    "11 days to 1/6 and 25 days to inauguration.",
    "“And Mr. Meadows said: ‘All right.",
    "Trump ultimately backed down."
  ]
}