{
  "id": 53,
  "mediaId": 2664,
  "date": "2022-02-21",
  "headline": "John Durham's admission Republicans are ‘out of their minds’ means he must shut down ‘sham’ investigation: analysis",
  "image": "https://www.rawstory.com/media-library/john-durham.jpg?id=28191255&width=1200&coordinates=0%2C30%2C0%2C31&height=600",
  "link": "https://www.rawstory.com/john-durham-s-admission-republicans-are-out-of-their-minds-means-he-must-shut-down-sham-investigation-analysis/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    5676,
    2119,
    1670,
    2765,
    3054,
    1126,
    1338,
    6569
  ],
  "sentences": [
    "If he steps forward this spring or summer to say, You know, I’ve been at this three years now, and I have seen no evidence of any conspiracy against Donald Trump, he’ll be rendering a great service unto this beleaguered nation.\"",
    "The special counsel appointed during the Trump administration to investigate GOP complaints about the origins into the investigations into his Russian ties should shut down his probe, Michael Tomasky argued on Monday.",
    "\"If he had genuine integrity, he’d shut the investigation down, save the taxpayers their money, and settle back into prosecuting mobsters in Connecticut instead of enabling mobsters in Washington.",
    "If you are doing X—setting fire to the Reichstag, say, or cooperating with the Kremlin to win a presidential election—you accuse your opponent of doing the thing that you’re doing.\"",
    "He translated Durham's statement as meaning, \"Fox News and the rest of the right wing media, not to mention Trump himself and his Republican cultists, are out of their minds.\"",
    "Durham issued a filing earlier this month that seemed to suggest, to people who can’t read, that the Hillary Clinton campaign was spying on the Trump campaign.",
    "Tomasky, editor of The New Republic, noted Durham issued a walk back after one of his filings was taken out of context by right wing media.",
    "Tomasky praised Durham for the walk back, writing that he \"at least this smidgeon of integrity.\"",
    "He’s been at this for almost three years now, and he has indicted one person,\" he explained.",
    "\"It’s all fiction, straight out of the Josef Goebbels School of Political Communication.",
    "But that was not enough, in Tomasky's mind, for Durham to correct the situation.",
    "Trump suggested some Clinton aides deserved to be executed (no, really).",
    "\"He has the power to shut down a lot of this pernicious madness.",
    "Jim Jordan (R-Berchtesgaden) echoed the sentiment,\" he wrote.",
    "The New York Post went with 'Hillary the Spy' on its cover.",
    "Stories Chosen For You",
    "Fox went berserk.",
    "\"Let me explain."
  ]
}