{
  "id": 5325,
  "mediaId": 2618,
  "date": "2022-04-11",
  "headline": "Elon Musk ‘Has Decided Not’ to Join Twitter’s Board of Directors",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/11/elon_musk_has_decided_not_to_join_twitters_board_of_directors_83009.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Bois",
  "authorUrl": "",
  "termIds": [
    5891,
    4983,
    2416,
    3505,
    2656,
    4905,
    1394,
    1297,
    188
  ],
  "sentences": [
    "The initiative, co-founded by BBC Arts along with The Reading Agency, is intended to showcase Commonwealth books spanning the seven decades of Queen Elizabeth II’s reign to coincide with her Platinum Jubilee, but the Harry Potter series’ total exclusion from the supposedly “reader-driven list” has raised eyebrows.",
    "The attackers reportedly called the victim “white [expletive] with braids” and told her she could not wear her hair in the style because she was “not Black.” Witnesses told investigators that as many as 20 teens, some as young as 12 years old, swarmed the victim, who is 19 years old.",
    "A group of Muslim migrants from a local shelter pelted Christians with rocks and projectiles at an Easter procession\nSpaceX successfully launched a spy satellite into orbit on Sunday, a process that aided the National Reconnaissance Office after previous attempts were postponed.",
    "Yet, despite the dangers and instability, the illegals pose to Spaniards, especially Christians, the country’s left-wing government led by Pedro Sánchez has been unwilling to close its borders, properly vet illegals or deport potential terrorists.",
    "“The starting position of any substantive and rational assessment does not favor Beijing if its goal is to invade, occupy, and sustain control over Taiwan,” Steve Yates, senior fellow and chair of the China Policy Initiative, told the DCNF.",
    "Personally, I think Twitter was a mistake\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "The Hawthorne-based company conducted the launch out of the Vandenberg Air Force Base Sunday afternoon after its initially scheduled launch on Friday was delayed twice over the weekend, Fox 11 of Los Angeles reported.",
    "He also warned Russia’s ongoing war in Ukraine would continue to “take its toll” on the global economy as he acknowledged soaring inflation while touting his domestic accomplishments in Portsmouth, New Hampshire.",
    "McEnany’s comments on Tuesday’s episode of Fox’s “Outnumbered” come as footage of Biden shows him being “whisked away” after a crowd asked about Afghanistan during the White House’s Easter Egg roll on Monday.",
    "Harry Potter author JK Rowling has been excluded from The Big Jubilee Read of 70 books, pioneered in part by the BBC, amid ongoing leftist attacks on her views on transgender ideology.",
    "Taiwan’s indomitable fighting spirit would pose a serious challenge to Beijing’s military ambitions in the event of an invasion, experts told the Daily Caller News Foundation.",
    "Protesters have told KDKA that Jim Rogers’ niece, Diamond, was speaking at the rally and that’s when they said police officers told them to disperse and get out of the street.",
    "His comments came after a Securities and Exchange Commission (SEC) filing on April 14 showed the billionaire offered to buy the social media platform for $43 billion.",
    "Fox News host Kayleigh McEnany questioned how President Joe Biden can run for a second term if he can be so easily led by someone dressed in an Easter Bunny costume.",
    "President Biden met with senior defense advisers on Wednesday, including Secretary of Defense Lloyd Austin and Chairman of the Joint Chiefs of Staff Mark Milley.",
    "The juveniles are charged with pulling her hair, punching her and kicking her repeatedly near Washington and Winter Streets just before 7 p.m. Monday night.",
    "Biden can be seen and heard saying, “Pakistan should not… and Afghanistan should be…” before the Easter Bunny promptly draws him away from the reporters.",
    "Despite his low approval rating, Biden believes he is the only Democrat who can defeat Donald Trump if he also decides to run, two sources told the Hill.",
    "Evicted five centuries ago by crusading Christians, jihadists have historically dreamed of, and worked towards, regaining the “lost Caliphate” of Spain.",
    "In a statement on Sunday night, Twitter CEO Parag Agrawal said Elon Musk made the decision to rescind the company’s invite for him to join the board.",
    "Disney is poised to rank among the worst-performing stocks in 2022 after the company became embroiled in a high-profile political controversy.",
    "Tech billionaire Elon Musk has reportedly decided not to join Twitter’s board of directors after becoming the company’s largest shareholder.",
    "The president visited the New Hampshire Port Authority along Portsmouth Harbor, where he talked about investing in ports and waterways.",
    "The meeting with the high-ranking defense officials comes amidst escalating tensions with China over a potential invasion of Taiwan.",
    "As the meeting closed, reporters tried to question President Biden about the volatile situation, but his staff shouted them down.",
    "Comments:\nFrom what I've gathered, if he joins the board, then he’d be prevented from buying a further stock of the company.",
    "Musk said his interest in buying the company is not due to monetary reasons but rather to aid the interests of civilization.",
    "Therefore, it should come as no surprise that illegal Muslim migrants have attacked Christians during their Holy Week.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Diamond said no and that’s when protesters allege that police responded with “violence” and arrested two people.",
    "According to a police report, the juveniles pounced on the victim after making a comment about her hairstyle.",
    "As the market closed Thursday, the stock was hovering near $120 per share – down roughly 33% from a year ago.",
    "President Joe Biden reportedly told Barack Obama he will run for reelection in 2024 to defeat Donald Trump.",
    "Spanish citizens are under constant threat by Islamic migrants who have illegally entered their country.",
    "Five young teenage girls are facing charges in the brutal beating of a young woman in Downtown Crossing.",
    "I will unlock it,” Musk said in a letter to Twitter chairman Bret Taylor included in the SEC filing.",
    "If you are in the board you have fiduciary and various other legal duties that subject you to suit.",
    "Tesla and SpaceX CEO Elon Musk said he doesn’t care about the economics of acquiring Twitter.",
    "If Biden does run, he will be in his early 80s, an old age for a tough presidential campaign.",
    "The liberals would use this opening to conduct harassment and multiple suits against him.",
    "President Joe Biden visited New Hampshire on Tuesday to discuss the infrastructure law.",
    "The stock reached an all-time high in March 2021, trading at nearly $200 per share.",
    "An altercation happened at a rally-justice walk for Jim Rogers in Wilkinsburg.",
    "Biden’s plans to campaign for a second term confirm his previous statements.",
    "I say, then, he should just buy the rest and do with the site as he pleases.",
    "Your donation helps keep our discussions going and our voices heard.",
    "Justice For Jim Rogers said in a statement provided to KDKA",
    "But it has been in free fall ever since.",
    "“Twitter has extraordinary potential.",
    "Very smart.",
    "Thank you."
  ]
}