{
  "id": 5545,
  "mediaId": 2644,
  "date": "2022-04-11",
  "headline": "Biden’s sister insists Hunter corruption claims just political attacks by Trump, GOP",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/04/valerie-biden-owen-comp.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/04/11/valerie-biden-owens-claims-hunter-biden-corruption-claims-just-political-attacks-by-trump/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Moore",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "?”\nOwens went on to describe how her nephew wrote “in exquisite detail” in his own book about his struggles with addiction — “his walk through hell,” ?as she put it — and remarked, “I don’t think that there’s a family in this country who hasn’t tasted it or felt what it’s like to see someone struggle with addiction.”\n“We aren’t talking about addiction, we’re talking about business dealings,” King interrupted before asking Owens if she thought there was any “there there” about Hunter Biden’s business relationships.",
    "Citing revelations about lucrative deals involving Hunter Biden, the president’s brother Jim Biden, and companies linked to China’s Communist government, King pressed: “Was it on the up and up, was it not on the up and up, was Joe Biden involved, was Jimmy Biden involved?”\nOwens, 76, who has played crucial roles in her brother’s Senate and presidential campaigns, claimed that the interest in Hunter Biden’s business entanglements stemmed from the 2020 presidential race.",
    "“The only race that I wasn’t enthusiastic about Joe getting involved in was the 2020 presidency,” she said, “because I expected, and was not disappointed, that it would be ugly and mean and it would be an attack on my brother Joe, personally and professionally, because the former president is very intent on bringing my brother down.”\n“What’s that got to do with Hunter?” King asked.",
    "“Frankly, if the American people put us back in power, I think we owe it to them to give them the truth,” ?he said on Fox News’ “Sunday Morning Futures.”\n“And, of course, this story about Hunter Biden and the Biden family profiting off of foreign interests and keeping that information from the American people,” ?he added.",
    "Valerie Biden Owens, the president’s younger sister, has dismissed the notion that her nephew Hunter Biden’s entanglement in murky foreign business dealings is an issue for the first family, saying claims of corruption and ethical malfeasance are just political attacks by former President Donald Trump and his supporters.",
    "The Post first reported in October 2020 that messages found on a laptop belonging to Hunter Biden and left a year earlier at a Delaware computer repair shop included details about his business dealings in China and Ukraine — as well as evidence that he used his family ties to then-Vice President Joe Biden as leverage.",
    "“I assumed from the beginning that the former president and his entourage would attack my brother by going and attacking the family?,” said Owens, adding that Trump and his Republican allies “thought ?t?hat the weak link would be to attack my brother’s child.",
    "The Post’s reporting, initially shunned by mainstream media outlets, has been revisited after being confirmed in recent weeks by the New York Times and Washington Post, which have taken belated looks of their own at the first son’s business interests.",
    "Hunter Biden is already under investigation by federal prosecutors for possible tax fraud because of his business deals, and he faces even more scrutiny if Republicans regain control of Congress in the 2022 midterm elections.",
    "Subsequent disclosures by The Post outlined how the first son benefited ?from his father’s political influence and was on the receiving end of million-dollar payouts from businesses in China and Ukraine.",
    "During a “CBS Mornings” interview promoting Owens’ forthcoming book “Growing Up Biden: A Memoir,” anchor Gayle King asked the presidential sibling whether Hunter Biden posed a problem for his relatives.",
    "Rep. Jim Jordan (R-Ohio), who is likely to become chairman of the House Judiciary Committee if the GOP wins the majority, said his panel would launch a series of investigations into the Biden family.",
    "Hunter Biden was paid as much as $50,000 a month to sit on the board of Burisma, a Ukrainian energy company, despite having no experience in the industry.",
    "“?T?here hasn’t been any there there since it was mentioned in 2019, or wherever,” Owens said.??",
    "“No,” Owens replied.",
    "?"
  ]
}