{
  "id": 5572,
  "mediaId": 2589,
  "date": "2022-04-22",
  "headline": "Red-handed: Leaked audio catches McCarthy in lie about wanting Trump to resign",
  "image": "https://media.townhall.com/townhall/reu/o/2021/152/1e8a6891-ef85-4018-a59a-826698a5ad92-1110x740.jpg",
  "link": "https://hotair.com/allahpundit/2022/04/22/red-handed-leaked-audio-catches-mccarthy-in-lie-about-wanting-trump-to-resign-n464141",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allahpundit",
  "authorUrl": "https://hotair.com/author/allahpundit",
  "termIds": [
    0
  ],
  "sentences": [
    "He hoped Twitter would ban the MAGA types in the caucus like Marjorie Taylor Greene and Lauren Boebert who had pushed “rigged election” incitement before the insurrection\n“Fake news,” cried McCarthy yesterday after the Times published its scoop:\nMy statement on the New York Times pic.twitter.com/PWi2WkoWzh\n— Kevin McCarthy (@GOPLeader) April 21, 2022\nThe news, it turns out, was not fake.",
    "BREAKING: GOP Leader Kevin McCarthy wanted Twitter to suspend the accounts of other Republican members of Congress, according to reporting by Jonathan Martin @jmartNYT and Alex Burns @alexburnsNYT pic.twitter.com/jwAoMAqYCn\n— Maddow Blog (@MaddowBlog) April 22, 2022\nA few questions arise.",
    "But House Republicans are still waiting for a firm statement from Trump, according to multiple GOP aides, on how to determine whether they should still back McCarthy as their current leader and potential speaker if the GOP regains the majority in the November election.",
    "— Acyn (@Acyn) April 22, 2022\nAs for McCarthy allegedly wanting to see the Trumpers in the House lose their Twitter accounts — despite having spent the past year decrying Big Tech censorship — Times reporter Jonathan Martin says they have that on tape as well.",
    "Per WaPo, Trump and McCarthy spoke by phone last night:\nTrump, according to these people, was not upset about McCarthy’s remarks and was glad the Republican leader didn’t follow through, which Trump saw as a sign of his continued grip on the Republican Party.",
    "This is her ultimate revenge on McCarthy for having sided with her initially in believing that Trump’s “stop the steal” campaign was beyond the pale, only to cynically reverse himself once he realized that maintaining that stance would cost him politically.",
    "In yesterday’s post I flagged his floor speech on the day of the impeachment vote, in which he said Trump “bears responsibility for Wednesday’s attack on Congress by mob rioters.” Plenty of other Republicans criticized Trump in the days after January 6.",
    "The NYT went so far as to quote him directly in its story despite the fact that the conference call in which he said these things was private, a clue that they had hard evidence that he had uttered the precise words they attributed to him.",
    "Representative Cheney did not record or leak the tape and does not know how the reporters got it.”\n— Scott MacFarlane (@MacFarlaneNews) April 22, 2022\nIt’s unclear how many Republicans were on the call and in a position to record it.",
    "If he puts out a statement complaining — he complains about McConnell all the time and hasn’t threatened his position in leadership,” said one Republican congressional aide who asked for anonymity to discuss private conversations.",
    "Matt Gaetz shares our suspicions:\nWhile I was rallying in Wyoming against Liz Cheney…\nKevin McCarthy was defending Liz Cheney among House Republicans…\nWhile Liz Cheney was secretly recording Kevin McCarthy for the New York Times.",
    "The most Machiavellian theory would be that Steve Scalise, McCarthy’s top deputy, recorded it and leaked it in hopes that it would come out and lead to McCarthy’s ouster, clearing the way for Scalise to become Speaker next year.",
    "Although McCarthy lied brazenly to the world yesterday by denying the Times’s reporting, Charlie Sykes is right that that’s not disqualifying in today’s GOP, even in a case like this where the lie was purely self-serving.",
    "For what it’s worth, though, Cheney says it wasn’t her:\nRep Liz Cheney (R-WY) spokesman:\n“The select committee has asked Kevin McCarthy to speak with us about these events but he has so far declined.",
    "No doubt Gaetz and other MAGA types are lobbying Trump today to drop the axe on McCarthy, clearing the way for Jim Jordan or some other populist to run for Speaker next year.",
    "I’m guessing yes, at least by Trump if not by the Greenes and Gaetzes in the caucus since there’s nothing Trump loves more than seeing a former critic beg for forgiveness.",
    "The more willing you are to debase yourself by groveling and pledging undying loyalty going forward, the more likely your sins against MAGA are likely to be absolved.",
    "That’s the real revelation in the McCarthy tapes, that he wanted Trump to resign and wanted the MAGA glee club in the House to lose their social-media privileges.",
    "And given how much McCarthy will owe Trump for forgiving his many sins, Trump will get all the loyalty he could want if McCarthy ends up taking the gavel.",
    "It shows that you won’t “play by Queensberry rules” or whatever the latest metaphor is for justifying ruthlessness in the name of political victory.",
    "In brief, a new book from two NYT reporters claims that in the days after January 6 Kevin McCarthy was telling members of his caucus that:\n1.",
    "Trump has been willing to let bygones be bygones with his early January 6 critics on the right provided that they come crawling back to him.",
    "Remember a shaken Lindsey Graham saying “count me out” in his own floor speech that evening when discussing his relationship with Trump?",
    "Rumors of a possible new candidate for Congress in the new Florida 4 seat have me ready to clear my schedule to campaign for him.",
    "The first and most obvious is why McCarthy would deny the Times’s reporting given the chance that they might have him on tape.",
    "Vance, a guy who once fretted that Trump might become “America’s Hitler,” in this year’s Ohio Senate primary.",
    "Last night they played the one of McCarthy calling for Trump’s resignation on Rachel Maddow’s show.",
    "It’s not even the fact that he criticized Trump after the insurrection that’s the problem, really.",
    "pic.twitter.com/teTxIvUAUt\n— Matt Gaetz (@mattgaetz) April 22, 2022\nMust have been Cheney, right?",
    "“If Trump comes out and says [McCarthy] lost my faith and can’t be speaker, that is bold.",
    "He thought Trump should resign and he would take that recommendation to the president\n2.",
    "But one thing he might not be prepared to forgive is wanting to take away his power.",
    "I’ll leave you with this tantalizing tweet from former Trump official Ric Grenell.",
    "Which brings us to the big question: Is this the end of McCarthy’s Speaker hopes?",
    "They spoke of the private conversation on the condition of anonymity.",
    "He even made up with McCarthy despite his impeachment floor speech.",
    "The second question is who leaked the tape to the Times reporters.",
    "#maga #patriot\n— Richard Grenell (@RichardGrenell) April 22, 2022",
    "@GOPLeader – you should have trusted my instincts, not your own.",
    "But Trump doesn’t care about populism, he cares about loyalty.",
    "I’m saying a prayer he decides to jump in and make history.",
    "Maybe Congressman Trump will be Speaker next year instead.",
    "Last night’s post has all the background you need on this.",
    "(See, e.g., his Dr. Oz endorsement in Pennsylvania.)",
    "It’s not getting caught in a lie that’s the problem.",
    "He wanted the populists in his party disempowered.",
    "They were back to being golf buddies in no time.",
    "After all, he did that publicly as well.",
    "If anything, you’re encouraged to lie.",
    "It’s why he ended up endorsing J.D.",
    "The Times reporters had tapes.",
    "We all have a prime suspect.",
    "Can he be forgiven that too?",
    "That will move people."
  ]
}