{
  "id": 5707,
  "mediaId": 6676,
  "date": "2022-04-14",
  "headline": "How an Elon Musk-led Twitter could change social media",
  "image": "https://www.wkrg.com/wp-content/uploads/sites/49/2022/04/AP21193760130775-1.jpg?w=1280",
  "link": "https://www.wkrg.com/entertainment-news/how-an-elon-musk-led-twitter-could-change-social-media/",
  "mediaOutlet": "wkrg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Klar",
  "authorUrl": "https://www.nxsttv.com/nmw/?post_type=profile&p=173669",
  "termIds": [
    2187,
    5891,
    5677,
    468,
    1394,
    1331,
    1288
  ],
  "sentences": [
    "Twitter needs to be transformed as a private company.”\nMusk has suggested other changes to the platform, aside from a focus on “free speech.”\nHe suggested that Twitter Blue, the platform’s subscription service, offer an “authentication checkmark” that is distinct from the checkmarks for public figures for members of the service.",
    "Musk has made clear that in order to be saved, Twitter needs a wholesale tear-down to the foundation, its leadership must be removed, and the politically discriminating ideologues running day to day operations must be replaced,” Getter CEO Jason Miller, a former Trump aide, said in a statement.",
    "“[Musk] taking on an existing social media platform directly, possibly using his fortune to acquire it outright, would have tremendous ripple effects on the other major social media platforms,” said Emerson Brooking, a senior fellow at the Atlantic Council’s Digital Forensic Research Lab.",
    "It’s not clear if Musk would retroactively change any of Twitter’s decisions, such as the one to ban Trump or other politicians, including Rep. Marjorie Taylor Greene (R-Ga.), but he said he would be “very cautious” on permanent bans and thinks “timeouts” are a better option.",
    "Musk’s approach, to allow nearly all federally legal content online, is more similar to the approach alternative, conservative leaning platforms such as Parler, Getter, and Trump’s own Truth Social have taken than that opted for by Twitter and other major platforms.",
    "But Musk’s view on how to moderate content “would open the door to the same sort of racism, targeted harassment, calls to violence and intimidation, which Twitter and other social media platforms have worked so hard to banish from their services,” Brooking said.",
    "“A good sign as to whether there is free speech is, ‘is someone you don’t like allowed to say something you don’t like.’ And if that is the case, then we have free speech, and it’s damn annoying when someone you don’t like says something you don’t like.",
    "“Because other conservative or politically active billionaires would begin to think seriously about how they could use their fortunes to influence these platforms and the rules that govern these platforms,” Brooking added.",
    "Musk’s main sticking point with the platform he’s seeking to own is centered on “free speech.”\n“I think it’s very important for there to be an inclusive arena for free speech,” Musk said Thursday at a TED 2022 conference.",
    "“I invested in Twitter as I believe in its potential to be the platform for free speech around the globe, and I believe free speech is a societal imperative for a functioning democracy,” Musk wrote to the board chairman.",
    "If Twitter accepts Musk’s offer, his plan to “unlock” Twitter’s “extraordinary potential,” may lead to a form of Twitter with fewer content moderation policies — in a way that impacts the internet beyond Twitter itself.",
    "In his letter to Twitter board chair Taylor, Musk said his offer is his “best and final.”\nThe billionaire told the TED 2022 audience if his offer is rejected he does have a Plan B, but he isn’t sharing it just yet.",
    "Musk, in the same TED 2022 interview, said Twitter’s speech policies should “match the laws of the country.” In a “gray area,” he said he would lean toward letting a tweet exist, but perhaps not promoting it.",
    "“Twitter has become sort of the de facto town square so it’s really important that people have both the reality and the perception that they are able to speak freely within the bounds of the law,” he said.",
    "Musk is known for his online trolling, often on Twitter itself, but Dan Ives, an analyst at WedBush, said Musk’s offer to buy Twitter is as serious as any bid the billionaire has made in his career.",
    "After the initial news, Twitter said Musk would join its board of directors — sparking a debate over the influence Musk may have on how the platform moderates content, including from politicians.",
    "For example, Rep. Jim Jordan (R-Ohio) said on Fox Business that social media platforms are “the public square today.”\n“This is where we have debate in our culture and in our country today.",
    "Musk wrote a letter to Twitter’s board chairman Bret Taylor offering to buy all the company’s shares he didn’t already own, filed with the Securities and Exchange Commission on Wednesday.",
    "“So there are a lot of ifs, but if Musk took over Twitter, and then implemented his vision for the service, it would mean less safe and accessible internet,” Brooking said.",
    "Truth Social has particularly struggled to break into the market — plagued by a lack of access on the site as users face more than month-long wait times after signing up.",
    "(The Hill) — Elon Musk’s bid to buy Twitter could change the social media landscape if the billionaire follows through on his stated intention to transform the platform.",
    "He’s also pushed for an “edit” button, which Twitter said it will begin testing, with the caveat that they did not get the idea from Musk’s Twitter poll on the subject.",
    "The company was among the first to boot former President Trump from its platform, and went a step further than Facebook by issuing a permanent ban on Trump.",
    "Republicans in Congress have long criticized Twitter and other mainstream platforms over accusations of censoring content with an anti-conservative bias.",
    "“It’s clear Twitter disrespected the world’s richest man, and he realizes that while Twitter’s technology is good, the people running it cannot be fixed.",
    "Ives said within the next 30 to 45 days the “soap opera” on Musk’s Twitter offer is going to have more “episodes.”\n“This is a get out the popcorn time.",
    "“However, since making my investment I now realize the company will neither thrive nor serve this societal imperative in its current form.",
    "The offer is the latest episode in a saga that kicked off last week when Musk acquired a 9.2 percent stake in Twitter.",
    "The more hands off approach advocated by Musk is similar to the methods they’ve been pushing for platforms to embrace.",
    "But the alternative platforms have failed to gain the same kind of traction as mainstream sites such as Twitter.",
    "But on Sunday, Twitter CEO Parag Agrawal said Musk decided not to join the board in a surprising twist.",
    "So, let’s have someone in charge who actually respects the First Amendment and free speech,” he said.",
    "“This is not a sideshow, fooling around antics — it’s a real $43 million bid,” Ives said.",
    "Twitter has often led social media rivals with its stricter content moderation practices.",
    "That is a sign of a healthy functioning free speech situation,” Musk said.",
    "Other conservatives have rejoiced at Musk’s offer to buy Twitter.",
    "This soap opera’s going to have many twists and turns,” he said."
  ]
}