{
  "id": 5799,
  "mediaId": 2745,
  "date": "2022-04-11",
  "headline": "Opinion: Yes, we need a law protecting Black people against hair discrimination",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UJYRZMSZBRGWXEQH3PX5YDEBCA.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/04/11/crown-act-protections-black-hair-discrimination/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2417,
    2119,
    1489
  ],
  "sentences": [
    "In schools, there are countless reports of Black children’s education and playtime being disrupted because their hair is considered “inappropriate.” In New Jersey, a 16-year-old wrestler was forced to cut off his dreadlocks before a match.",
    "The Crown Act (Creating a Respectful and Open World for Natural Hair Act), whose fate now rests with the Senate, seeks to provide legal protection for Black people and other minorities who face discrimination based on their hair.",
    "“Those are the issues we should be focused on.”\nThe historical politicization of hair has created stereotypes and biases that affect Black people’s ability to thrive, and our laws do not adequately address this discrimination.",
    "It wasn’t until my mom came to school and explained to the teacher that the size of my hair was a product of the way it grew out of my scalp — something I could not control — that the teacher checked her criticism.",
    "For instance, the Equal Employment Opportunity Commission sued a company called Catastrophe Management Solutions after it rescinded a Black applicant’s job offer because she refused to cut off her dreadlocks.",
    "Last month, in the third year of a global pandemic, amid atrocities in Europe and battles at home over voting and abortion and basic human rights, the House of Representatives passed a bill about hair.",
    "One of the nays, Rep. Jim Jordan (R-Ohio), called the bill trivial compared with other matters facing our country: “How about a world where gas prices aren’t five dollars a gallon?",
    "According to the results of a 2019 survey of over 2,000 women, Black women were 80 percent more likely than non-Black women to say they’d had to alter their hair to fit in at work.",
    "Educational disruptions of this nature are associated with negative outcomes, including lower educational attainment and increased interactions with the criminal justice system.",
    "In the 1700s, Black women in Louisiana were required by law to cover their hair so as not to tempt White men, perpetuating stereotypes about Black women’s supposed promiscuity.",
    "Administrators at a school in Orlando threatened to expel a 12-year-old girl because her natural hair was deemed a “distraction.”\nI know this experience firsthand.",
    "Jordan and other critics have argued that the Crown Act is redundant because the Civil Rights Act of 1964 already offers protections against racial discrimination.",
    "Only by enacting legislation that clearly defines hair as a characteristic worthy of legal protection can we end this pernicious, specific form of discrimination.",
    "On the House floor, dismissing the importance of the Crown Act, Jordan said: “I hope we can actually focus on the things that matter to the American people.”",
    "When I was in elementary school, one of my teachers interrupted class frequently to tell me my hair was too big and was disturbing the kids behind me.",
    "But the court decided that hairstyles “suitable for Black hair texture,” as the EEOC described them, do not constitute an immutable characteristic.",
    "These biases can threaten the livelihoods of Black people, who have reported being passed up for promotions or even fired because of their hair.",
    "In slavery’s aftermath, Black people were pressured to style their hair according to Eurocentric beauty standards to be considered employable.",
    "But supporters of the bill rightly point out that clearer language is necessary to guide the courts in their interpretation of the law.",
    "The same study found that Black women whose hair was natural or braided were consistently rated as “less ready” for job performance.",
    "Enslavers used Black hair as a tool of dehumanization, referring to it as “wool” in an attempt to liken Black people to animals.",
    "The act prevents discrimination against immutable characteristics, those seen as unchangeable and innate to a person’s being.",
    "The association of natural Black hairstyles with Black self-love led many to associate Black hair with political radicalism.",
    "Yes, Black people’s hairstyles can change — but our hair is a foundational part of who we are, physically and culturally.",
    "Black students, especially girls, often face higher rates of exclusionary school discipline as a result of such policies.",
    "With the rise of the “Black Is Beautiful” movement in the 1960s, Afrocentric hairstyles reentered the mainstream.",
    "In 2016, a federal judge ruled that the company’s choice was not a violation of the Civil Rights Act.",
    "But her words stuck with my classmates, who took the cue to tease me relentlessly.",
    "In all these instances, hair has been used to project biases about Black people.",
    "… How about a world where inflation isn’t at a 40-year high?” Jordan argued.",
    "Such rulings have far-reaching consequences — especially for Black women.",
    "Many schools have dress codes prohibiting natural Black hairstyles.",
    "The politicization of Black hair is as old as the United States.",
    "For some students, these episodes have severe consequences."
  ]
}