{
  "id": 5901,
  "mediaId": 2532,
  "date": "2022-04-22",
  "headline": "Mayorkas says U.S. is preparing for \"significant challenges\" along the border, asking countries to accept deportees",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/04/22/2421bff6-22e3-417d-9ebe-ae775dbba086/thumbnail/1200x630/244335d1d3481377ec8f10951ae783d0/2022-04-19t213657z-396784413-rc2lqt92my1b-rtrmadp-3-usa-diplomacy-immigration-panama.jpg",
  "link": "https://www.cbsnews.com/news/alejandro-mayorkas-border-immigration-title-42/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Camilo Montoya-Galvez",
  "authorUrl": "",
  "termIds": [
    4905,
    4873,
    6678
  ],
  "sentences": [
    "Immigration\n More\n Mayorkas says U.S. is preparing for \"significant\" border challenges\n U.S. unveils sponsorship program to resettle Ukrainian refugees\n Record numbers of Cubans, Nicaraguans and Colombians reach U.S. border\n Biden administration expands deportation protections for Ukrainians\n Transcript: Sister Norma Pimentel on \"Face the Nation\"\n More\nIn:\nImmigration\nAlejandro Mayorkas\n Camilo Montoya-Galvez\nCamilo Montoya-Galvez is the immigration reporter at CBS News.",
    "\"I visited the Darién, an extraordinarily treacherous terrain, and learned firsthand the dire consequences of that undertaking,\" Mayorkas said, referring to the road-less jungle region connecting Panama and Colombia that many migrants travel through on their way to the U.S.\nRepublicans have strongly criticized the administration's strategy on migration, faulting it for the record number of border arrivals in the past year.",
    "Mayorkas, who met with officials in Panama this week, said the Biden administration is also enlisting the help of countries in the Western Hemisphere to reduce the current high levels of migration to the U.S. border, including by convincing them to accept the return of asylum-seekers and migrants rejected by the U.S.\n\"The assertion that we do not have plans is an assertion that is not grounded in fact,\" Mayorkas said.",
    "Brendan Smialowski/Pool via REUTERS\nIn addition to collaboration on deportations, Mayorkas said other pillars of the administration's regional efforts on migration include facilitating the integration of asylum-seekers who are allowed to live in new countries, expanding legal avenues for those looking to migrate and helping nations retain their residents by investing in struggling communities.",
    "LUIS ACOSTA/AFP via Getty Images\nThe Centers for Disease Control and Prevention's decision to end Title 42 on May 23 has angered Republican lawmakers and a growing number of more moderate Democrats who don't believe Mayorkas and his department are prepared to contend with an even sharper increase in migration.",
    "Mayorkas said that one of the elements of separate discussions with Cuban officials this week was to ensure that the island nation is accepting deportations of its citizens as part of an Obama-era accord that also committed the U.S. to facilitating the legal migration of Cubans with family members in the U.S.",
    "Homeland Security Secretary Alejandro Mayorkas acknowledged Friday that the planned end of Title 42 border expulsions in May could pose \"significant challenges\" for the U.S. government, but he stressed that his department is ready to implement the change and deal with a likely spike in migrant arrivals.",
    "Republicans have said the unprecedented migration flows have been fueled by the Biden administration's reversal of some restrictive Trump-era border policies, its more sympathetic rhetoric toward migrants and the release of hundreds of thousands of migrants and asylum-seekers in the past year.",
    "In an interview with CBS News Friday, Mayorkas said the Department of Homeland Security (DHS) has erected migrant processing facilities, deployed additional medical staff and other personnel to the southern border and expanded migrant transportation capabilities as part of a months-long plan.",
    "\"The American people deserve answers and accountability for the Biden administration's lawlessness along the southwest border\" Ohio Congressman Jim Jordan, the top Republican on the Judiciary Committee, said earlier this week when announcing Mayorkas' appearance before the panel on April 28.",
    "Mayorkas said one of the objectives of his trip to Panama was to underscore the collective responsibility that countries have to manage migration flows affecting most of the region, including the need to facilitate the \"safe return\" of migrants to their home countries.",
    "\"We spoke of the responsibility to manage borders throughout the region in a humanitarian way that follows the law, which means that those who qualify for relief in a particular country are granted that relief and those who don't are repatriated,\" he said.",
    "Concerns over these deportation limits have intensified recently as more migrants arrive at the U.S. border from countries beyond Mexico, El Salvador, Guatemala and Honduras — where the U.S. conducts regular deportations.",
    "The regional approach, Mayorkas said, is needed because the U.S. is not the only country receiving migrants, citing the large displaced populations of Venezuelans in Colombia and Nicaraguans in Costa Rica.",
    "U.S. Secretary of State Antony Blinken and Secretary of Homeland Security Alejandro Mayorkas during a tour of the Panama Canal at the Miraflores Locks, in Panama City, April 19, 2022.",
    "Under Title 42, a pandemic-era rule put in place by the Trump administration in March 2020, the U.S. has turned away hundreds of thousands of migrants on the grounds of public health.",
    "But U.S. officials have struggled to return large numbers of migrants to certain countries like Cuba, Nicaragua and Venezuela due to strained relations with the governments there.",
    "Secretary of Homeland Security Alejandro Mayorkas speaks during a press conference at the Ministerial Conference on Migration and Protection in Panama City on April 20, 2022.",
    "\"We have been planning for months to address increases in migration; those that we already have experienced and those that we might experience upon an end to Title 42.\"",
    "Mayorkas noted that many arrests represent repeat crossings by the same individuals, a phenomenon he said DHS will be working to curtail through criminal prosecutions.",
    "\"Those individuals who make repeated attempts, who seek to defy the law, are subject to criminal prosecution in appropriate circumstances,\" Mayorkas said.",
    "Asked if he'll ask Congress for more funding or legal authorities to address the Title 42 changes, Mayorkas said legislative reform is needed.",
    "Over the past two years, Title 42 has allowed U.S. border agents to expel migrants over 1.8 million times without screening them for asylum.",
    "Once Title 42 ends, Mayorkas said that migrants who don't qualify for U.S. asylum will be deported under regular immigration procedures.",
    "'It's quite challenging in dealing with a country like Venezuela, where the diplomatic relations, if they exist at all, can be strained.",
    "In Friday's interview, Mayorkas said members of Congress can offer a permanent solution to the challenges along the U.S.-Mexico border.",
    "\"We are operating within the confines of a system that is entirely broken, and that is long overdue for legislative fix,\" he added.",
    "He said the ultimate objective is to prevent individuals from attempting \"perilous\" journeys which could sometimes be fatal.",
    "Mayorkas is expected to confront this criticism directly when he appears before the House Judiciary Committee next week.",
    "In those cases, he said the U.S. would engage other countries with warmer U.S. ties to \"participate in the solution.\"",
    "The CDC determined earlier this month that Title 42 was no longer needed to curb the spread of the coronavirus.",
    "His administration, however, has also reported nearly 2.5 million migrant arrests in 14 months, DHS data show.",
    "Many public health experts and even CDC officials had long questioned the validity of that rationale.",
    "Texas and other Republican-led states are asking federal courts to block the policy's termination.",
    "Migrant apprehensions along the U.S.-Mexican border soared to 221,000 in March, a 22-year high.",
    "In March, 32,000 Cubans and 16,000 Nicaraguans entered U.S. border custody, both records.",
    "And so we have to be practical here in addressing the realities,\" Mayorkas said.",
    "\"And we're working in collaboration with the Department of Justice to do that.\"",
    "Dealing with other countries, however, will be more difficult, Mayorkas noted.",
    "Roughly 75% of those expulsions have occurred under President Biden.",
    "Based in Washington, he covers immigration policy and politics.",
    "Twitter"
  ]
}