{
  "id": 6019,
  "mediaId": 2618,
  "date": "2022-04-18",
  "headline": "Democrats are campaigning on Jan. 6 hypocrisy",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/04/18/democrats_are_campaigning_on_jan_6_hypocrisy_83461.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Miranda Devine",
  "authorUrl": "",
  "termIds": [
    5271,
    4066,
    2119,
    2576,
    1126,
    6709
  ],
  "sentences": [
    "The civil rights violations that have been revealed have been appalling and yet, how many times have McConnell, McCarthy or any high ranking member of Congress come out to comment on the prolonged incarceration, trumped up charges, living conditions, and denial of attorney consultations, and family visits?",
    "The media have colluded with the democrat party to inflame the public with lies, half truths, obfuscations, and omissions as they regularly do when democrats need their help to set a false narrative and there has been little pushback against this rhetoric by Republicans.",
    "Unlike BLM and Antifa who actually destroyed billions of dollars of federal, state and private property and were protected, the rest of us who would dare assemble to protest will be thrown into the gulag with little support or objection from the Republican Party.",
    "I can’t even begin to imagine the response of the democrat party and media if these prisoners were a bunch of BLM thugs and they had been incarcerated for over a year under the same circumstances and treatment.",
    "If the Judges assigned to those cases have any sense of justice, the pending cases involving those detainees should either be dismissed or moved to differing judicial districts away from the DC area.",
    "The goal is to prevent President Trump from running in 2024 by labeling him a party to an insurrection something democrats are desperate to do with the blessing of our inert Republican elites.",
    "The poor guy got an earful from me and I finished up by saying that there would not be one penny from me until the Republicans got off their arses and did something about the J6 prisoners.",
    "As for BLM and Antifa thugs, they will be paid to cause disruption and COVID will be resurrected by the democrats, anything to distract the people and reinstate the vote-cheating systems.",
    "From what the Democrats have been doing politically regarding the January 6th detainees, you would have to be an idiot to believe that anyone of them could get a fair trial in DC.",
    "The most chilling part of this debacle is knowing that you are pretty much on your own if the Biden administration decides it wants to make an example out of you.",
    "I get worked up more over the republican non-response in defending and freeing those people from jail in the face of communist, third world dictatorial behavior.",
    "And we also know the Demon-Rats control the presidency and both houses of Congress, so they can't even remotely blame the Republicans for any of this mess!!!",
    "Democrats would have unleashed the mob and the political elites of the party would have made it their highest priority to speak out in their defense.",
    "And the people will be totally ignoring the Demon-Rats and voting with their wallets -- which are substantially lighter thanks to the Demon-Rats!!!!",
    "But what people are seeing is half-empty shelves at the grocery store, and what is on those shelves costs 2 to 3 times more than it did a year ago.",
    "These poor souls have been so unfairly and unconstitutionally treated that it will be a stain on the democrat party, the FBI and DOJ going forward.",
    "My e-mail inbox is flooded every day with republican demands for money, even from people well outside my area like Marco Rubio and Nikki Haley.",
    "This administration wants everyone to know what will happen to them if they dare to air their grievances to a totalitarian cabal.",
    "The Demon-Rats have given the peasants a perfect example of the destructive power of runaway inflation, and we don't like it!!!!",
    "Who would have ever thought that the government would ever treat American citizens like they have the J6 prisoners?",
    "Whatever happened to BLM and Antifa threats to bring their circus act to the suburbs and to flyover country?",
    "You know you won't find lines of hamstrung police officers and compliant citizens out here, don't you?",
    "There is no organized or consistent voice coming from from our esteemed defenders of the Constitution.",
    "They know that they are having to work twice as hard for half the shopping value of their paychecks.",
    "They just are unwilling to fight a fight that requires courage, conviction, and political capital.",
    "Where are these wrongfully charged individuals’ representatives who would speak on their behalf?",
    "Idea: Lawn signs done in the same black/white letters and design reading \"Buy Large Mansions.\"",
    "January 6th is the only campaign tool that the democrats have and it's nothing but a spitball.",
    "I am sure that none of us ever believed that individuals would ever be treated so unfairly.",
    "Some of them have resorted to insulting messages in attempts to shame me into donating.",
    "I live in a 'liberal' town with Black Lives.... signs dotting the neighborhoods.",
    "And yet the jan 6 political prisoners are STILL in jail and they harmed NO ONE.",
    "Why the overreaction by the democrats and apathy by many of the Republicans?",
    "I recently received a phone call from the RNC asking for a donation.",
    "I pray that every call they make gives them the same ultimatum.",
    "Jim Jordan and a few others have spoken up but with no effect.",
    "It would have been upfront on the news and in your face 24/7.",
    "And yet we are expected to respect our government leaders.",
    "This is one of the main reasons that this is happening.",
    "No equality of justice for repubs or Trump supporters.",
    "They have been an absolute disgrace on this issue.",
    "Rona's crew in Washington is just as bad.",
    "They'll get torn down a lot, after all.",
    "Screw them all, they deserve nothing.",
    "Don’t look to us for help or support.",
    "The media would have made sure of it.",
    "They know how gas has gone sky-high.",
    "The Demon-Rats can say anything.",
    "Equal justice under the law?",
    "The article got me thinking.",
    "A lack of courage perhaps?",
    "You’re on your own guys.",
    "The Republican response?",
    "Pretty much, crickets.",
    "Not anymore-obviously.",
    "We're waiting for you.",
    "Hopefully cheap.",
    "Shame on them.",
    "Fair for all?"
  ]
}