{
  "id": 6049,
  "mediaId": 2553,
  "date": "2022-04-19",
  "headline": "‘In Other Words, It Was Made Up’: Jim Jordan Rips Trump/Russia Conspiracy After Latest Durham Filing",
  "image": "https://dw-wp-production.imgix.net/2022/04/John-Durham.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/in-other-words-it-was-made-up-jim-jordan-rips-trump-russia-conspiracy-after-latest-durham-filing",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Pearce",
  "authorUrl": "https://www.dailywire.com/author/tim-pearce",
  "termIds": [
    0
  ],
  "sentences": [
    "Durham wrote:\nFor example, while the FBI did not reach an ultimate conclusion regarding the data’s accuracy or whether it might have been in whole or in part genuine, spoofed, altered, or fabricated, Agency-2 concluded in early 2017 that the Russian Bank-1 data and Russian Phone Provider-1 data was not “technically plausible,” did not “withstand technical scrutiny,” “contained gaps,” “conflicted with [itself],” and was “user created and not machine/tool generated.” The Special Counsel’s Office has not reached a definitive conclusion in this regard.",
    "Durham said in his filing that Sussmann, while claiming to the FBI that he was unattached, actually approached the agency “on behalf of at least two specific clients,” one of which was “the Hillary Clinton Campaign.”\nThe other party Sussmann allegedly represented was Rodney Joffe, head of the tech company Neustar.",
    "The CIA, identified in the filing as “Agency-2,” knew in 2017 that at least part of the information that Sussmann had given to federal investigators was not “technically plausible” and was “user created,” according to Durham’s Friday filing.",
    "The Daily Wire is one of America’s fastest growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "Attorney Michael Sussmann, who previously worked for the Seattle-based law firm Perkins Coie, approached the FBI, under what Durham alleges were false pretenses, with information on potential Trump/Russia collusion.",
    "Joffe aided Sussmann in compiling what was eventually turned over to the FBI by “exploit[ing] [Joffe’s] access to non-public and/or proprietary Internet data” through a government contract, Durham wrote.",
    "Ohio Rep. Jim Jordan (R) blasted the Trump/Russia collusion narrative after a Friday court filing by special counsel John Durham suggested that key evidence supporting the conspiracy was implausible.",
    "https://t.co/3QVoe48h6s\n— Rep. Jim Jordan (@Jim_Jordan) April 18, 2022\nAllegations of collusion with Russia dogged former President Donald Trump during his campaign and throughout his presidency.",
    "In a February filing, Durham said that Sussmann purposely misrepresented to the FBI his reason for meeting with the agency’s general counsel, James Baker, about the information Sussmann had.",
    "Ex-special counsel Robert Mueller for three years investigated claims that the Trump campaign had illegally coordinated with Russian agents to influence the 2016 election.",
    "“The CIA knew as early as 2017 that the Trump/Russia collusion data was not ‘technically plausible’ and was ‘user created.’ In other words, it was made up.",
    "The CIA knew as early as 2017 that the Trump/Russia collusion data was not “technically plausible” and was “user created.”\nIn other words, it was made up.",
    "Sussmann took what he said could be evidence of coordination between Trump Tower in New York and Alfa-Bank, one of the largest private banks in Russia.",
    "Sussmann is charged with lying to the FBI regarding the information he brought the agency about the Trump campaign’s alleged Russia ties in 2016.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "At the time in 2016, Perkins Coie had taken on the presidential campaign of former Secretary of State Hillary Clinton as a client.",
    "But Democrats and the media told you otherwise!” Jordan said in a social media post.",
    "The former Perkins Coie attorney’s trial is set to begin next month.",
    "Mueller eventually concluded that no such evidence exists.",
    "But Democrats and the media told you otherwise!",
    "Become a member now and join our mission.",
    "Believe the same?"
  ]
}