{
  "id": 642,
  "mediaId": 2540,
  "date": "2022-02-20",
  "headline": "'Hillary Clinton Derangement Syndrome' is worse than ever",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220220163102-02-durham-motion-hillary-clinton-syndrome-obeidallah-super-tease.jpg",
  "link": "https://www.cnn.com/2022/02/20/opinions/durham-motion-hillary-clinton-syndrome-obeidallah/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dean Obeidallah",
  "authorUrl": "https://www.cnn.com/profiles/dean-obeidallah",
  "termIds": [
    5676,
    2119,
    2391,
    4428,
    3976,
    3054,
    2765,
    514,
    586
  ],
  "sentences": [
    "After seizing upon details about Sussman sharing internet data with the CIA in 2017, right-wing activists, Fox News reporters and former President Donald Trump himself all blasted out allegations that the Clinton campaign and its lawyers \"worked to 'infiltrate' Trump Tower and White House servers,\" as former Trump administration aide Kash Patel told Fox News.",
    "A new HDS variant apparently emerged last week when special counsel John Durham, who has been investigating the origins of the FBI's Trump-Russia probe, filed a motion involving Michael Sussmann, a lawyer with ties to Clinton's 2016 presidential campaign who has been charged with lying to the FBI.",
    "The symptoms of this persistent ailment include an unhealthy obsession with the former secretary of state -- from spreading lies about her past actions to blaming her for events with which she has no connection -- combined with an insatiable longing to see her run for president again in 2024.",
    "You could fill a medical encyclopedia with experts trying to understand who was \"Patient Zero\" for HDS, with past articles such as, \"The dark depths of hatred for Hillary Clinton\"; \"Why do people dislike Hillary Clinton?",
    "Durham's 13-page motion addressed a possible conflict of interest regarding Sussmann's legal counsel, but some on the right interpreted the document as revealing something more sinister about Clinton.",
    "(CNN)There's something infecting right-wing circles, and it's showing no sign of letting up: a fixation on Hillary Clinton that I'm calling\"Hillary Clinton Derangement Syndrome,\" or \"HDS\" for short.",
    "And then, moments later, Jordan added that \"Hillary Clinton looks like she's going to try to run and if it's a rematch between her and President Trump, I think President Trump wins in a landslide.\"",
    "Whether it's for ratings or social clout, it appears some of those infected with HDS not only want Clinton to live rent-free in their heads, but desperately need for her to be there.",
    "Add to that Fox News host Tucker Carlson declaring last week that Clinton may be gearing up for a run in 2024, saying, \"We fully support Hillary Clinton as she runs for president.\"",
    "That would help explain GOP Sen. Ted Cruz's response on Saturday night to the news that Jean-Luc Brunel, an associate of Jeffrey Epstein, had been found dead in his Paris cell.",
    "If only there were a vaccine for HDS, or an HDS rehabilitation center to help those suffering to overcome this derangement that appears to be eating away at their rationality.",
    "As various fact-checkers have confirmed, the allegations shared by right-leaning outlets aren't based on reality; the Durham motion doesn't even include the word \"infiltrate.\"",
    "Cruz — like others infected with HDS — clearly feels compelled to mention Hillary Clinton whenever possible, even in regards to headlines that have nothing to do with her.",
    "HDS is an insidious condition that also appears to make those who are infected hate Clinton while paradoxically craving to see more of her in the political sphere.",
    "This helps explain why so many of the same people who have attacked Clinton for decades are also obsessed with the idea of Clinton running for president in 2024.",
    "Trump claimed that the motion \"provides indisputable evidence that my campaign and presidency were spied on by operatives paid by the Hillary Clinton Campaign.\"",
    "For example, GOP Rep. Jim Jordan appeared on Fox News last week to declare that Clinton's (non-existent) spying on Trump was \"worse than we thought.\"",
    "It doesn't matter that Clinton has not even hinted at another presidential campaign; apparently HDS causes some to see things the rest of us don't.",
    "Dean Obeidallah, a former attorney, is the host of SiriusXM radio's daily program \"The Dean Obeidallah Show\" and a columnist for The Daily Beast.",
    "There are even books on the topic, such as Michael D'Antonio's \"The Hunting of Hillary: The Forty-Year Campaign to Destroy Hillary Clinton.\"",
    "(Hillary Clinton, it seems, is trying a different approach to eradicating HDS by threatening a defamation lawsuit.)",
    "It's been with us on a national scale since Clinton became First Lady in 1993 and metastasized from there.",
    "Former White House chief of staff Mark Meadows tweeted, \"They didn't just spy on Donald Trump's campaign.",
    "He added, \"in a stronger period of time in our country, this crime would have been punishable by death.\"",
    "The Texas senator retweeted the news story and then wrote, \"Anyone know where Hillary was this weekend?\"",
    "But even if there were a cure for HDS, I doubt all of those struggling would avail themselves of it.",
    "Perhaps we can organize an HDS telethon to raise funds to better research cures for this syndrome.",
    "This is no laughing matter, as these people are evidently sick -- sick with HDS, that is.",
    "These are all obvious cases of HDS, because the filing, in fact, proves no such thing.",
    "(Sussmann has pleaded not guilty, and his case is headed for trial later this year.)",
    "But a classic symptom of HDS is hallucinations about what Clinton is doing.",
    "They spied on Donald Trump as sitting President of the United States.\"",
    "Some don't seem to understand that they have a problem.",
    "The opinions expressed in this commentary are his own.",
    "\"; and the simply put, \"Why do they hate her?\"",
    "Heartbreakingly, HDS is nothing new.",
    "View more opinion articles on CNN.",
    "Follow him @DeanObeidallah."
  ]
}