{
  "id": 6576,
  "mediaId": 8358,
  "date": "2022-04-11",
  "headline": "Jordan talks politics, government with Elida students",
  "image": "https://d31029zd06w0t6.cloudfront.net/wp-content/uploads/sites/54/2022/04/web1_jordon002.jpg",
  "link": "https://www.limaohio.com/news/504393/jordan-talks-politics-government-with-elida-students",
  "mediaOutlet": "limaohio.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“I tell people all the time if you’re willing to set a goal and work hard, in this country you have a great chance of reaching whatever objective you have in mind.”\nJordan also quoted former U.S. Attorney General Bill Barr:\n“The Constitution of the United States is not suspended during a crisis.”\nJordan also brought up current events in Washington, D.C., asking the students if they remembered when President Biden said he would never impose mandates required to get the vaccines.",
    "“So the Supreme Court had to tell him that that was unconstitutional.”\nJordan then touched on the controversy surrounding President Biden’s son, Hunter, which has gained more attention in recent weeks, questioning how extensive the Biden family was involved in Hunter Biden’s affairs.",
    "By Dean Brown - dbrown@aimmediamidwest.com\nELIDA — U.S. Rep. Jim Jordan, R-Urbana, began his time during a visit to Elida High School Monday by offering some life lessons before he delved into a question-and-answer session with students.",
    "Jordan said that 51 former intelligent officials signed a letter that became the basis for technology and media companies downplaying or suppressing access to this story during the final days of the 2020 election.",
    "Weapons that can help them defend themselves — I think we have to continue to do those things.”\nAnother question was raised concerning how to begin to get involved in the political process.",
    "That’s the stuff that has to change and I think one of the ways to change is to put new people in charge in the next United States Congress.”\nReach Dean Brown at 567-242-0409.",
    "“We have an election in a few months and you know, Lord willing, the American people might be making a big change [and] put the Republicans back in charge.",
    "When asked by an Elida student what actions America could take concerning Ukraine, Jordan responded, “The sanctions right now are probably the best way.",
    "In 14 months, we literally went from a secure border to chaos, we went from energy independence to the President begging OPEC to increase production.",
    "If you want to run for office, don’t let anyone tell you you can’t do it.”\nBefore leaving, Jordan shared a few more of his thoughts.",
    "Instead of being a disinformation campaign, the story surrounding Hunter Biden’s laptop has since been confirmed as genuine.",
    "“First of all, hard work doesn’t guarantee success, but it sure improves your chances,” he said.",
    "I think we’ve got to go out and campaign hard for Republicans across the country.",
    "I never want to be overconfident, but I do feel good about the upcoming election.",
    "If I would have listened to conventional wisdom, I would have never run.",
    "If you’re interested in running for office, then run for office.",
    "We went from the safest streets to record levels of crime.",
    "We went from stable prices to a 40-year high inflation.",
    "Four-dollar gas and six-dollar gas in California.",
    "“Get involved in a campaign,” Jordan replied.",
    "I hope that’s what’s going to happen.",
    "Don’t let anyone tell you you can’t.",
    "“City Council, township trustee.",
    "“Well, he did,” Jordan said.",
    "Get involved.",
    "Previous"
  ]
}