{
  "id": 7,
  "mediaId": 2572,
  "date": "2022-02-26",
  "headline": "Ukraine showdown: Volodymyr Zelenskyy challenges Vladimir Putin",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/putin-zelenskky-latest.png",
  "link": "https://www.foxnews.com/world/ukraine-volodymyr-zelenskyy-vladimir-putin",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4942,
    4591,
    3702,
    702,
    6569,
    6672,
    6286
  ],
  "sentences": [
    "Three of his great-uncles \"and their parents and families were shot dead by Nazi occupants who invaded Ukraine,\" he said at a Jan. 24 press briefing with Israeli Prime Minister Benjamin Netanyahu, though it is rare for the Ukrainian president to speak of his Jewish heritage, the Post reported.",
    "Social media helped boost Zelenskyy's presidential campaign before he was elected, and social media is currently helping him deliver updates on the situation in Ukraine and the various aid other countries are offering to help boost the country's defense against the Russian military.",
    "Russian state media outlets have repeated accusations of \"genocide\" by Ukrainian troops against Russians in Luhansk and Donetsk, the regions Putin declared \"independent\" while Russian troops were supposedly securing them last week as part of a \"peacekeeping\" mission.",
    "While the Russian tyrant may be attempting to paint himself as a powerful leader capable of toppling Ukraine in just days, experts say the move may instead be highlighting Putin's vulnerabilities as praise for Zelesnkyy's leadership makes headlines across the globe.",
    "Yet the decision to attack a major neighboring state and suffer broad international sanctions may suggest a different story — one of a vulnerable leader willing to take risks abroad to secure his position at home,\" Ciorciari said in a statement.",
    "Several commentators compared Zelenskyy's decision to stay in his home country amid the invasion to former Afghanistan President Ashraf Ghani's decision to abruptly leave Kabul on Aug. 15, 2021, as the Taliban closed in on the country's capital.",
    "UKRAINE INVASION: RUSSIA ‘INCREASINGLY FRUSTRATED’ BY LACK OF MOMENTUM: US DEFENSE OFFICIAL\nThe Ukrainian president's defiance and commitment to remain in Kyiv have inspired his supporters to laud him as a hero and \"bada--\" on social media.",
    "Putin has emphasized how he wants to \"denazify\" Ukraine, despite the fact that Ukraine fought against Nazi Germany in World War II and Zelenskyy is a Jewish president whose family members survived the Holocaust, according to the Kyiv Post.",
    "The Times reported in 2019 that declassified documents from the Central State Archive of Historical and Political Documents of St. Petersburg show Putin received some praise for his work within the KGB but was not particularly exceptional.",
    "Putin said the crisis could be resolved if Kyiv recognizes Russia’s sovereignty over Crimea, the Black Sea peninsula that Moscow annexed after seizing it from Ukraine in 2014, renounces its bid to join NATO and partially demilitarizes.",
    "But this is a major gamble,\" John Ciorciari, an associate professor of public policy and director of the University of Michigan's Ford School of Public Policy’s International Policy Center and Weiser Diplomacy Center, told Fox News.",
    "Putin's claim that he wants to purge Ukraine of fascism is eagerly repeated and supported in hopes of swaying citizens who still hate the loathsome Nazi Germany regime with whom they brutally warred 80 years ago.",
    "The Russian president is now facing global criticism for his decision to invade Ukraine and topple its democratic government in what some commentators have described as a power grab and \"massive miscalculation.\"",
    "The married father of two played a high school teacher who woke up one morning to find out he had been elected president in a landslide after a social media video he made denouncing corruption went viral.",
    "He continued: \"If the invasion does not go well, Putin could face serious domestic blowback, both from ordinary citizens and the military brass sending young men and women into a needless war.\"",
    "Vladimir Putin\nThe Russian president, 69, has nearly two decades of the presidency under his belt and has the potential to serve three more terms under Russian law — if he lives long enough.",
    "\"On my father’s side, my grandfather and his three brothers were all on the front [in the Red Army] in World War II and only he returned,\" Zelenskyy said at the time, according to the Post.",
    "Russia \"used all their force\" against Ukraine on Friday into Saturday morning, including \"missiles, jet fighters, drones, artillery, armored equipment, saboteurs, paratroopers,\" he said.",
    "\"The fight is here; I need ammunition, not a ride,\" the Ukrainian president said in a Saturday video posted to Twitter after refusing an American offer to evacuate the Ukrainian capital.",
    "Ukrainian President Volodymyr Zelenskyy's supporters have painted him as a hero just three days into Russia's invasion of Ukraine after he vowed to stay in Kyiv and defend his country.",
    "In a Saturday morning address, Zelenskyy said fights were ongoing in many parts of Ukraine, but citizens are defending their \"county, land\" and \"future\" for their children.",
    "\"This is a massive miscalculation,\" University of Wisconsin-Madison professor Yoshiko Herrera, who is an expert on U.S-Russian relations, previously told Fox News Digital.",
    "The West has decried the annexation of Crimea as a violation of international law and has previously flatly rejected permanently barring Ukraine from NATO.",
    "Russia's creep into Kyiv has sparked comparisons of Zelenskyy's leadership versus Putin's, as well as the leadership styles of other world authorities.",
    "He continued: \"If Russian forces get bogged down in this needless war, Putin may face serious challenges from the Russian brass and the Russian people.",
    "Thus far, the leader who looks strong is Zelensky, whose personal courage and defense of a democracy under siege has most of the world on his side.\"",
    "Volodymyr Zelenskyy\nZelenskyy, 44, was elected president in 2019, but before then, he was an actor on the Ukrainian TV show \"Servant of the People.\"",
    "The destroyed residential buildings by their heavy artillery is an ultimate argument for the world to stop the occupant's invasion together with us.",
    "Ukrainian people have already earned and have a right to become a member of EU, and it will be a key testimony of the support of our country.\"",
    "His pledge came despite being Russian President Vladimir Putin's first target as he attempts to take over Ukraine's democratic government.",
    "His use of ‘Nazi’ resonates with many Russians because of the slow-healing scars still plaguing the Russians from World War II,\" Ret.",
    "Putin,\" and was involved in the KGB's Young Communist League starting in 1975, according to documents obtained by The Moscow Times.",
    "Lt. Col. Robert Maginnis, a military analyst with experience on the ground in Russia and Ukraine, previously told Fox News.",
    "\"Putin launched a GRU-hosted misinformation effort to color the Zelenskyy government as anti-Russian and anti-separatist.",
    "\"Putin is often seen as enjoying a commanding position at home that enables him to pursue expansionist policies abroad.",
    "\"They attack residential areas, using jet artillery at times, trying to destroy the energy centers,\" Zelenskyy said.",
    "\"Putin clearly views the invasion of Ukraine as a way to bolster perceptions of his strength, at home and abroad.",
    "Russian missiles on Friday struck schools, apartment buildings and bridges, resulting in hundreds of casualties.",
    "Fox News' Rebecca Rosenberg, David Rutz and The Associated Press contributed to this report.",
    "It’s a ruination of Russia for decades, so damaging for Ukraine and so costly all around.\"",
    "Photos posted online show Zelenskyy sporting a camouflage uniform and military gear.",
    "He also served nearly a decade in the KGB, known then as \"Comrade V.V.",
    "The fighting continued into Saturday afternoon.",
    "\"This action…was just another level of crazy.",
    "\"Their tactic is very sneaky."
  ]
}