{
  "id": 7073,
  "mediaId": 2594,
  "date": "2022-04-07",
  "headline": "Congressional Republicans may block Disney copyright after ‘Don’t Say Gay’ bill row",
  "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2013/07/07/18/22-Micky1.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/republicans-disney-don-t-say-gay-bill-punish-b2053398.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bevan Hurley",
  "authorUrl": "https://www.independent.co.uk/author/bevan-hurley",
  "termIds": [
    2119,
    3403,
    2880,
    1477,
    1126,
    1133,
    1357,
    6159
  ],
  "sentences": [
    "Rep Jim Banks, chair of the Republican Study Committee, is circulating a letter among the GOP caucus in which he tells Disney CEO Bob Chapek of his intention to oppose any future extension of Disney copyrights, National Review reports.",
    "Mr Banks writes that Disney’s opposition to the the Parental Rights in Education legislation shows it has capitulated to “far-left activists through hypocritical, woke corporate actions”, and accuses them of “kowtowing” to China.",
    "Republican legislators in Florida are mulling whether to repeal a decades-old arrangement with the Walt Disney Company that effectively allows Disney to regulate the district on which its parks and properties operate.",
    "Disney’s rights to its Steamboat Willie Mickey Mouse, first seen in a 1928 short film, are due to expire on 1 January 2024, although more recent depictions will remain protected by separate copyrights.",
    "A number of Republican lawmakers have signalled they may block Disney from renewing copyright on an iconic Mickey Mouse cartoon as punishment for the company’s stance on Florida’s ‘Don’t Say Gay’ bill.",
    "“It’s unfortunate that Disney, once an American success story, has allied with a hostile foreign regime and domestic ideologues who seek to tear our country apart,” Mr Banks, of Indiana, writes.",
    "Disney have been under fire from Republicans for its opposition to the ‘Don’t Say Gay’ bill, which bans Florida educators from discussing sexual orientation and gender identity.",
    "Defenders of the bill highlight how it focuses on students in kindergarten to third grade, but the bill contains more broad language that affects students in all grades.",
    "Disney lobbyists were instrumental in passing the 1976’s Copyright Act and Copyright Term Extension Act in 1998 to seek protections for their intellectual property.",
    "Republicans are also favoured to retake the House and Senate in the midterm elections in November, as President Joe Biden’s approval rating remains underwater.",
    "“Disney used to be an inspiration for all American families, but it seems to now have given in to the woke mob,” he told the conservative publication.",
    "Fellow far-right Congressman Jim Jordan of Ohio told National Review he supported the move to block Disney’s copyrights.",
    "Mr Jordan is the ranking Republican on the House Judiciary Committee, which would oversee new copyright bills.",
    "The Independent has approached Disney for comment."
  ]
}