{
  "id": 7127,
  "mediaId": 2594,
  "date": "2022-04-02",
  "headline": "Madison Cawthorn’s comments angered House Republicans. He was already in trouble back home",
  "image": "https://static.independent.co.uk/2022/03/31/23/GettyImages-1368471453.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/madison-cawthorn-north-carolina-primary-b2049684.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Garcia",
  "authorUrl": "https://www.independent.co.uk/author/eric-garcia",
  "termIds": [
    5399,
    3356,
    4066,
    4673,
    4387,
    1119,
    1126,
    1380,
    1477,
    6456
  ],
  "sentences": [
    "Mr Cawthorn also landed in hot water when news network WRAL reported a video of Mr Cawthorn calling Ukrainian President Volodymyr Zelensky “a thug” and said “the Ukrainian government is incredibly corrupt and is incredibly evil and has been pushing woke ideologies.” Later, when Mr Zelensky gave a virtual joint address to Congress, Mr Cawthorn did not arrive until the address was almost over.",
    "“In those races, then you get a more legitimate outcome, but when you got so many people and so many people running in opposition, my fear is they equally split the ballot and Cawthorn sneaks by with 31 per cent.”\nAnother advantage, Mr Hood said, is most people might not know these controversies which allows him to skate by, given the dominant news about the economy and Ukraine.",
    "“In my view, if you are a right-leaning person who wants a different kind of representative for the district for Madison Cawthorn, your best strategy is not to figuratively shake your fist at him but shake your head sadly,” he said, adding that Republicans should say something along the lines of: “‘What an unfortunate situation for this young man.",
    "Numerous North Carolina Republicans and conservative activists spoke to The Independent on the record, saying that Mr Cawthorn’s focus on the national stage, combined with his continued attention-grabbing antics, as well as his skirting of rules and laws and forgetting the needs of his home district, mean his days in Congress might be numbered.",
    "“It’s what he did to the constituents,” she said, adding that he essentially thought that, “‘I’m going to go over here and it’s a shiny penny and I can win there and I can position myself to run for Senate in 2026.’” In addition, she alleges that Mr Cawthorn closed his constituent offices.",
    "In that announcement, he said “I’m afraid another establishment go-along-to-get-along Republican will prevail there,” as a pretext for his decision, which was viewed as a veiled swipe at Mr Moore, the House speaker, who was eyeing a run for Congress but ultimately passed on running.",
    "Just depends on if it’s a day that ends in ‘y.’”\nRecommended\nMeanwhile, CNN later reported that Senator Thom Tillis endorsed Chuck Edwards, the state senator running in the Republican primary against the youngest member of Congress for the 11th District.",
    "But North Carolina Republicans say that these antics were not the reason that he is in trouble, as many times, conservatives see them as unfair attacks, John Hood, president of the conservative John William Pope Foundation and a Cawthorn critic, said.",
    "Mr Cawthorn, who represents North Carolina’s 11th District, seemed to come out of nowhere when he ran in a special election to replace Mark Meadows, himself a right-wing firebrand, who left his job to become Mr Trump’s White House chief of staff.",
    "“And then reached out to me and said I want you to run as the America First candidate.”\nBut then, North Carolina’s Supreme Court tossed out the new maps and Mr Cawthorn filed to run in the 11th District while Ms Woodhouse was still in the race.",
    "Last week, Representative Madison Cawthorn made news when House Minority Leader Kevin McCarthy chastised him in a private meeting after he had accused members of Congress of engaging in orgies and doing cocaine during a podcast appearance.",
    "Despite defeating Mr Trump’s chief of staff’s preferred candidate, Mr Cawthorn, who uses a wheelchair, spoke at the Republican National Convention in 2020, where he propped himself up to stand when reciting the pledge of allegiance.",
    "The outlet also reported that Tim Moore, the speaker of North Carolina’s House of Representatives, and Phil Berger, the Senate president pro tempore, were hosting a fundraiser for primary challenger and state Senator Chuck Edwards.",
    "When The Independent asked whether Mr Cawthorn should lose his primary, Mr Tillis said, “I think he’s got a stiff challenge and he might.”\nMr Cawthorn’s latest remarks also rankled other Republicans in the House GOP caucus.",
    "He doesn’t have good friends in his world.’ That’s different from treating him as a cartoon villain.”\nBut Mr Jeter said that there is still a potential for Mr Cawthorn to win even if most voters don’t like him.",
    "Representative Jim Jordan, one of the co-founders of the House Freedom Caucus and one of Donald Trump’s fiercest apologists in Congress, had nothing to say when The Independent asked about his remarks.",
    "“What he attempted to do to Tim Moore really lost him all support of elected Republicans in North Carolina,” one senior Republican operative in North Carolina said on background to speak candidly.",
    "In March, Mr Cawthorn was charged with a misdemeanour for driving with a revoked license after he had already received two speeding tickets, as local newspaperThe Mountaineer reported.",
    "Ms Woodhouse warned that if Mr Cawthorn were to win his primary, it could lead to Democrats from Buncombe County, which includes the liberal town of Asheville, could take the seat.",
    "It was later revealed that he falsely said that his friend had abandoned him when his friend claimed he pulled him out of the wreck and that the US Naval Academy had rejected him.",
    "It’s sad and disappointing to the voters.”\nA mistake that could ultimately lead to Mr Cawthorn’s downfall is that his critics allege he essentially forgot his constituents.",
    "Recommended\nMs Woodhouse, for her part is not worried about the runoff and said she sees Mr Edwards as a more country club Republican and Mr Cawthorn as ineffective.",
    "“What damages him more than anything else is the disobedience of traffic and the registration of his car and the perceived lack of traditional service,” he said.",
    "In November, after the state legislature redrew its maps, Mr Cawthorn announced he would run in the newly drawn 13th District, which includes the Charlotte area.",
    "Then when he comes in he tells me, he says he thinks he saw maybe a staffer in a parking garage from 100 yards away,\" Mr McCarthy said, according to Axios.",
    "The people of Western North Carolina do not like this attitude that the rules don’t apply to you,” one senior Republican operative in North Carolina said.",
    "He landed in similar trouble when he was accused of bringing a knife onto a school property four times in as many weeks, as ABC 13 reported at the time.",
    "In December, Mr Cawthorn paid a visit to Mar-a-Lago to meet with Mr Trump to show that he had endorsed Ms Woodhouse in North Carolina’s 11th District.",
    "“He’s just an absolute fallacy,” said Republican state representative Charles Jeter Jr. “His arrogance and his hubris have finally caught up with him.",
    "Within days of his swearing in, he spoke at the “Stop the Steal” rally at the White House Ellipse that preceded the insurrection on 6 January.",
    "Mr Hood said that the best way to criticise Mr Cawthorn is to say he has bad influences and take pity on him rather than rail against him.",
    "The default is to just vote for the familiar name on the ballot.”\nInstead, Mr Hood said it is important to keep the race intensely local.",
    "The Republican operative who requested anonymity to speak candidly said that was likely Mr Cawthorn’s undoing in Republican circles.",
    "His compelling story as a young man whose path to the US Naval Academy ended when he survived a car wreck made him an instant star.",
    "A month after he was sworn in, he was caught trying to carry a gun in his carry-on bag by Transportation Security Administration.",
    "Similarly, Michele Woodhouse, who is running in the primary against Mr Cawthorn, cited his carrying a knife to a school meeting.",
    "And he didn’t respond to emails from The Independent requesting comment about whether these strings of incidents would harm him.",
    "Specifically, she noted how Jasmine Beach-Ferrara, a county commissioner in Buncombe, is liberal even by Asheville standards.",
    "In 2017, the state changed its law lowering the threshold for avoiding a runoff in a primary from 40 per cent to 30 per cent.",
    "“I was pleased to see it,” Oregon Representative Cathy McMorris Rodgers said about Mr McCarthy’s meeting with Mr Cawthorn.",
    "At least we think it has.”\nMr Cawthorn also doesn’t do interviews in the hallways of Congress, unlike many other members.",
    "He’s become a featured speaker at gatherings like CPAC and is a frequent talking head on conservative television.",
    "Controversies like these have made him an enemy of liberal Democrats and a darling to the right wing in America.",
    "He noted how in North Carolina’s Senate race, there are fewer legitimate candidates running on both sides.",
    "He said he regrets voting for the change and wonders if there are enough voters who like Mr Cawthorn.",
    "“The other one is, honestly, the lack of focus that many voters are going to have on this primary.",
    "Mr Cawthorn’s meteoric rise in Congress has also seen him become a lightning rod for controversy.",
    "Mr Cawthorn then made it to the runoff race and beat Lynda Bennett, a friend of Mr Meadows’ wife.",
    "“It is between the knives and the guns and the speeding tickets with a revoked driver’s license.",
    "“I wasn’t aware of it but I’m OK with it,” he said, when he was informed of the fundraiser.",
    "Mr Cawthorn’s words also angered his fellow North Carolina Republicans in the US Congress.",
    "“I think that’s fine,” he said of the fundraiser for Mr Cawthorn’s primary challenger.",
    "Senator Richard Burr, the state’s outgoing senior Republican, was less kind to him.",
    "“The people of Western North Carolina, they don’t suffer fools,” Ms Woodhouse said.",
    "He has proven to be unelectable.”\nFor some Republicans, it was a long time coming.",
    "There’s probably three or four legitimate candidates that are running,” he said.",
    "“If he’s the one who comes out of the primary ... he’ll get crushed,” she said.",
    "Mr Cawthorn, who uses a wheelchair, also falsified his record as a paralympian.",
    "“Madison made the move to run in that Charlotte market,” Ms Woodhouse said.",
    "“They don’t want a member of Congress who is a national embarrassment.",
    "People assume that Madison Cawthorn is the talk of the town,” he said.",
    "“I think, as I said yesterday, he’s an embarrassment on given days.",
    "Mr McCarthy also reportedly chastised him about the driving.",
    "What happened next further contributed to his predicament.",
    "“In the interview, he claims he watched people do cocaine.",
    "“You got a bold strong conservative who has never wavered.",
    "“It’s one in a series of many,” she told The Independent.",
    "Numerous other Republicans were mum about the remarks.",
    "There’s only one in those three who can beat Jasmine.”",
    "“ But mostly you are focused on these other things.",
    "Rather, it’s been his run-ins with the law.",
    "He’s gotten himself in over his head.",
    "Mr Edwards did not respond either.",
    "That’s what the race comes down.",
    "But it has also come at a cost.",
    "“We had to pay our fine.",
    "Fame went to his head.",
    "“Worse than that."
  ]
}