{
  "id": 7131,
  "mediaId": 2621,
  "date": "2022-04-07",
  "headline": "Trump Endorses Rep. Brian Mast By Touting Him as ‘Strong’ on 2nd Amendment — Even Though He Supports Assault Weapons Ban",
  "image": "https://www.mediaite.com/wp-content/uploads/2022/04/Blank-2-Grids-Collage.png",
  "link": "https://www.mediaite.com/news/trump-endorses-rep-brian-mast-by-touting-him-as-strong-on-2nd-amendment-even-though-he-supports-assault-weapons-ban/",
  "mediaOutlet": "Mediaite",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jackson Richman",
  "authorUrl": "https://www.mediaite.com/author/jackson-richman/",
  "termIds": [
    2091,
    2765,
    4048,
    4135,
    4161,
    1477,
    1126,
    6159
  ],
  "sentences": [
    "In a New York Times opinion piece, Mast called for taking action such as, but not limited to, “[d]efining what constitutes an assault or tactical firearm and not allowing them for future purchase — just as we already prohibit the purchase of fully automatic firearms” and “[b]anning the sale of accessories and add-ons that circumvent the ban on automatic firearms, and increasing the ages at which individuals can purchase various categories of firearms.”\nIn addition to Mast, Trump also endorsed on Wednesday Reps. Marjorie Taylor Greene (R-GA), Greg Murphy (R-NC), Kat Cammack (R-FL), Mike Johnson (R-LA), Jim Jordan (R-OH) and Carol Miller (R-WV).",
    "President Donald J. Trump announces his endorsement of Congressman Brian Mast pic.twitter.com/hQOfzsWyhr\n— Liz Harrington (@realLizUSA) April 6, 2022\nFollowing the February 2018 mass shooting at Marjory Stoneman Douglas High School in Florida, Mast came out in favor of gun control.",
    "200 comments\nFormer President Donald Trump endorsed Rep. Brian Mast (R-FL) on Wednesday, citing the congressman being “Strong” on the “Second Amendment” – even though Mast supports an assault weapons ban, which Second Amendment supporters oppose.",
    "A U.S. Army Veteran and a Bronze Star and Purple Heart recipient, Brian is dedicated to serving our Country,” said Trump in a statement.",
    "“Brian is Strong on National Security, the Border, Jobs, the Economy, our Second Amendment, the Military and our Brave Vets.",
    "Brian Mast is a Warrior for our movement, and has my Complete and Total Endorsement!”\nNEW!",
    "“Congressman Brian Mast is working hard in Congress for the incredible people of Florida.",
    "Have a tip we should know?",
    "tips@mediaite.com"
  ]
}