{
  "id": 7151,
  "mediaId": 2557,
  "date": "2022-04-07",
  "headline": "NEWS ALERT: Trump endorses two ‘MAGA’ House Republicans for reelection",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/04/GettyImages-1163026796-e1586818356660-2.jpg",
  "link": "https://dennismichaellynch.com/news-alert-trump-endorses-warrior-marjorie-taylor-greene-and-fighter-jim-jordan/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "DML News App",
  "authorUrl": "https://dennismichaellynch.com/author/api/",
  "termIds": [
    0
  ],
  "sentences": [
    "Trump said Jordan, a top defender of the former president during his two impeachment hearings, “is a truly outstanding man, and a fighter like no other.”\nTrump pointed to Jordan’s history of being “strong on crime, the border, our military, great Vets, and will save our seriously under-siege Second Amendment.”\n“He debunked the Russia, Russia, Russia Scam, the Ukraine, Ukraine, Ukraine, made-up phone call, Impeachment Hoax #1, Impeachment Hoax #2, and the Mueller Report, which strongly stated ‘no collusion,’” Trump continued.",
    "President Donald J. Trump announces his endorsement of Congresswoman Marjorie Taylor Greene pic.twitter.com/0i0IRVPAPv\n— Liz Harrington (@realLizUSA) April 6, 2022\nAccording to The Georgia Record, Greene responded, “I’m honored and grateful to have such a strong endorsement from my favorite President and the greatest President of my lifetime.”\n“America and the entire world misses him dearly.",
    "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by WashingtonExaminer:\nFormer President Donald Trump endorsed Georgia’s first-term Rep. Marjorie Taylor Greene and Ohio Rep. Jim Jordan, along with five other House Republicans who are up for reelection this November.",
    "President Donald J. Trump announces his endorsement of Congressman Jim Jordan pic.twitter.com/MzphYrggDs\n— Liz Harrington (@realLizUSA) April 6, 2022\nTrump also released endorsements for Reps. Gregory Murphy of South Carolina, Brian Mast of Florida, Kat Cammack of Florida, Mike Johnson of Louisiana, and Carol Miller of West Virginia.",
    "The article goes on to state the following:\n“She doesn’t back down, she doesn’t give up, and she has ALWAYS been with ‘Trump,’” the former president said in a statement through his Save America PAC, calling Greene “a warrior in Congress.”\n“She loves our Country and MAGA, its greatest ever political movement,” Trump continued.",
    "Former President Donald Trump endorsed Georgia’s first-term @RepMTG and Ohio Rep. @Jim_Jordan, along with five other House Republicans who are up for reelection this November.",
    "Greene and Jordan have been outspoken Trump supporters, standing by their claims of election fraud in the 2020 elections.",
    "“Jim will continue to hold the Radical Left accountable for their colossal incompetence and danger to our Country.”\nNEW!",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "“Marjorie is running for re-election to Congress, and has my Complete and Total Endorsement!”\nNEW!",
    "— Washington Examiner (@dcexaminer) April 7, 2022\nListen to the latest daily DML podcasts below!",
    "Following his endorsement for Greene, Trump also signaled support for Rep. Jim Jordan.",
    "I’ll never change and I’ll always keep fighting for America First!” Greene added.",
    "All seven House Republicans objected to certifying the 2020 election results.",
    "To get more information about this article, please visit WashingtonExaminer.",
    "Then please share."
  ]
}