{
  "id": 7195,
  "mediaId": 2745,
  "date": "2022-04-05",
  "headline": "Opinion: QAnon goes mainstream",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/L73IMQVUIMI6ZA2YECVBMNK7WQ.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/04/05/qanon-goes-mainstream/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "QAnon is the bananas conspiracy theory that claims a worldwide human-trafficking network — involving elites such as Tom Hanks and Bill Gates to people who shop at Wayfair — either sexually assaults children or murders them and extracts their glands, depending on which version of QAnon you believe, It’s all laughable, except it has become large enough that it has begun to infect everyday politics, with some of its adherents even winning elections.",
    "There’s a common thread between attacks against Supreme Court nominee Ketanji Brown Jackson as being soft on child predators, the manufactured controversy on the right over whether teachers can mention homosexuality to students, and the anti-trans laws sweeping Republican-controlled state legislatures: We’re witnessing the mainstreaming of QAnon.",
    "It is doubtful many of the politicians pushing the “don’t say gay” and anti-trans bills truly believe, for example, that teachers who mention their same-sex spouses are grooming children for sexual exploitation, or that trans women transitioned so they can lurk about in women’s bathrooms.",
    "That slur — groomer — is also now wielded against critics of new laws in Florida and elsewhere that allow parents to sue teachers for, among other things, mentioning the mere existence of gay people to their students.",
    "And the right’s current obsession is particularly interesting given its own scandals — from Mark Foley to Dennis Hastert to Roy Moore, as well as those accused of covering up abuse such as Rep. Jim Jordan (R-Ohio).",
    "Babysitters and child-care professionals were falsely incarcerated for nightmarish abuse, based on fake memories adults had implanted in children, and all despite the complete absence of any physical evidence.",
    "Sentencing Commission — also stating that these sentences were too harsh — was unanimously supported by the commissioners, and including a member who the same Republicans approved for a federal judgeship.",
    "And they’ve concluded that linking their opponents to those crimes is an effective way to accumulate power and achieve unrelated political objectives — opposing a Biden Supreme Court nominee, for example.",
    "Hawley and Cruz are smart enough to know that Jackson’s decisions were well within the mainstream, or that studies have shown registries and civil commitment do little to protect children.",
    "Pizzagate’s main propagators then went on to ruin reputations by disingenuously accusing their political opponents of pedophilia, with help from politicians such as Sen. Ted Cruz (R-Tex.).",
    "We can go back a bit further, too, to the ritual sex abuse panic of the 1980s and 1990s, a bipartisan, nationwide frenzy that imprisoned dozens of innocent people for nonexistent crimes.",
    "Jackson was also attacked for criticizing sex offender registries and the indefinite detention — or indefinite civil commitment — of sex offenders after they’ve served their sentences.",
    "On social media, legal scholars and pundits who defended Jackson from these attacks were swarmed with replies calling them “groomers,” or demands that they themselves be investigated.",
    "In Virginia, one prosecutor even asked a court’s permission to photograph a minor boy’s erect penis to prove the boy had sent an explicit photo to an underage girl.",
    "At a recent Donald Trump rally, Rep. Marjorie Taylor Greene (R-Ga.) accused Transportation Secretary Pete Buttigieg and his husband of stalking girls’ bathrooms.",
    "It has made many unemployable, and has barred them from living even in homeless shelters, even as those same laws also require them to report a fixed address.",
    "Jeffrey Epstein was a serial predator who hobnobbed with elites and, for far too long, was protected by both the courts and a cadre of powerful people.",
    "Instead of disabusing the true believers of their destructive mythology, they have chosen to enable them, and to smear anyone who gets in their way.",
    "The word is hurled both at trans people and those who defend them — not just by random Twitter users, but by mainstream conservatives.",
    "Some state registries and the restrictions that go with them have forced offenders to live under overpasses or in abandoned woods.",
    "QAnon was the natural evolution of Pizzagate, another conspiracy claiming an elite network of politicians was exploiting children.",
    "Studies have consistently shown that these restrictions have little effect on recidivism and do little to protect children.",
    "Children have been convicted and labeled as sex offenders for texting one another sexual explicit images of themselves.",
    "But however misguided those prosecutors may have been, it seems they honestly thought they were protecting children.",
    "But they also know is that few crimes (understandably) inspire more anger and disgust than sexual abuse of children.",
    "But it is our very disgust at these crimes that allows opportunists to seize them for unrelated political ends.",
    "Her view — that the laws laying out those sentences are too harsh — is shared by 70 percent of federal judges.",
    "They know a good percentage of their supporters have bought into at least some portion of the QAnon canon.",
    "But rather than confront it and risk alienating their own supporters, they have chosen to weaponize it.",
    "Just as with the lies about the 2020 election, these politicians know QAnon is a dangerous delusion.",
    "Parents have been accused of abuse and even prosecuted for innocuous photos of their young children.",
    "Nothing about Jackson’s record on sentencing people for possession of child pornography is unusual.",
    "Regardless of the seriousness of their crimes, these laws make rehabilitation all but impossible.",
    "Parents and grandparents were wrongly imprisoned for abusing their own sons and daughters.",
    "Of course sexual abuse of children is real, and it inflicts devastating, lifelong damage.",
    "The result isn’t just unfair attacks against politicians or judicial nominees.",
    "You needn’t feel sympathy for actual offenders to understand the danger here.",
    "Even the nuttiest conspiracy theories often contain a kernel of truth.",
    "That conspiracy culminated in an armed assault on a D.C. restaurant.",
    "Yet Jackson was still cast as an advocate for pedophiles.",
    "The 2012 report she signed while serving on the U.S.",
    "Start with the attacks against Jackson.",
    "What’s happening now is more sinister.",
    "declared her a threat to children.",
    "It often means ruined lives.",
    "Sen. Josh Hawley (R-Mo.)"
  ]
}