{
  "id": 7211,
  "mediaId": 2547,
  "date": "2022-04-04",
  "headline": "Border Patrol Council Embraces 'Great Replacement' Theory To Criticize Biden",
  "image": "https://crooksandliars.com/files/mediaposters/2022/04/49891.jpg",
  "link": "https://crooksandliars.com/2022/04/border-patrol-council-president-embraces",
  "mediaOutlet": "Crooks and Liars",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Amato",
  "authorUrl": "https://crooksandliars.com/team/john-amato",
  "termIds": [
    2765,
    4905,
    3932,
    514,
    1428
  ],
  "sentences": [
    "Brandon Judd, the president of the The National Border Patrol Council told Fox News the only reason the Biden administration lifted Title 42 is because they want to replace white voters with foreigners so they can stay in power.",
    "Fox News continues distracting their viewers away from the Russian invasion and all other relevant news by flying in segments that Democrats have left the southern border undefended.",
    "Here are a few examples of how Fox News promotes this white supremacist hate:\nThe ADL wanted Tucker Carlson fired for his anti-Semitic rants promoting Great Replacement Theory.",
    "Scott Bixby has a nice rundown on Biden's repeal of Trump's Title 42, which Republicans and Fox News are using to have convulsions over today.",
    "\"I believe that they're trying to change the demographics of the electorate, that's what I believe they’re doing\" Judd said.",
    "Fox News host Bill Hemmer asked, \" \"Sir, why do you think this administration has allowed virtually an open border?\"",
    "Judd sounds like he came from a meeting with CPAC's Matt Schlapp before appearing on Fox News.",
    "\"They want to stay in power and the only way to stay in power is to continue to get elected.\"",
    "Did President Biden disband the Border Patrol when nobody was looking?",
    "This is white supremacists' \"Great Replacement Theory\" in a nutshell.",
    "Judd said, \"They can't get elected on their policies.\"",
    "President Biden won by almost 8 million votes, dude.",
    "Brandon Judd quickly turned into Nick Fuentes.",
    "Take your white hood off and beat it.",
    "That is how democracy works."
  ]
}