{
  "id": 7263,
  "mediaId": 2641,
  "date": "2022-03-31",
  "headline": "Russian Hacker's Mysterious Status Raises Concerns of US Cyberattack",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=9dda2ee5-c52c-4540-ab7f-dbd3fc396e65&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/cyberattack-russia-usa-israel/2022/03/31/id/1063793/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Clemons",
  "authorUrl": "",
  "termIds": [
    2119,
    4905,
    4833,
    3514,
    1474,
    474,
    6253,
    6678,
    6569
  ],
  "sentences": [
    "Vorndran fielded questions about Aleksei Burkov, a Russian cybercriminal who was originally sentenced to nine years in prison in 2020, stemming from his alleged participation in a scheme which defrauded Americans of millions of dollars, according to the U.S. Immigration and Customs Enforcement agency.",
    "\"The Russian state actor, when tensions rise, increases malicious cyberattacks from both tactical — to disable systems that may be running against them from an adversary — and strategic — to be able to put pressure on other entities, be they allies or people in their interest to disable,\" Miller said.",
    "Back in 2020, Burkov, then 29, pleaded guilty to charges of access device fraud and conspiracy to commit computer intrusion, identity theft, wire, and access device fraud and money laundering, according to the U.S. Attorney's Office for the Eastern District of Virginia.",
    "Entering the sixth week of the Russia-Ukraine war, should the United States — which has publicly condemned Russian President Vladimir Putin for the full-scale invasion of Ukraine — be on high alert of a major hack?",
    "Citing the Examiner, a DOJ spokesperson said the Bureau of Prisons calculated that Burkov's imprisonment term should have ended on Aug. 25, 2021 — which syncs up with his deportation to Russia a month later.",
    "An Israeli Supreme Court eventually granted Burkov's extradition to the U.S.\nBurkov's current status has become a source of national interest this week in the wake of Vorndran's House interview.",
    "However, a separate noteworthy occurrence arose from that same House Judiciary Committee hearing during the interview with Bryan Vorndran, assistant director of the FBI's Cyber Division.",
    "Earlier this month, New York City was on \"ultra high alert\" with possible cyberattacks, according to NYPD Deputy Commissioner of Intelligence and Counterterrorism John Miller.",
    "While addressing a business roundtable overseas last week, President Joe Biden acknowledged the possibility of a cyberhack from Russia taking place somewhere in the world.",
    "In other words, his prison sentence in America — even factoring time served in Israel — still wouldn't have been exhausted in 2021, minus any credits for early release.",
    "As part of a written statement, Vorndran wrote, \"On Russian cyberthreats alone, since the start of the year, the FBI has issued hundreds of intelligence reports.\"",
    "Headlines were made Tuesday when Rep. Matt Gaetz, R-Fla., successfully entered the hard drive components of Hunter Biden's laptop into the congressional record.",
    "The Examiner also alluded to how Burkov was sentenced to nine years in prison, with time served for imprisonment in Israel, after being arrested there in 2015.",
    "When pressed on Burkov's current whereabouts on Tuesday, the FBI's Vorndran said, \"Mr. Burkov was investigated by the U.S. Secret Service, not by the FBI ...",
    "Last year, New York City's Metropolitan Transportation Authority was attacked by cyberhackers, initially raising concerns about the city's cyberprotection.",
    "Instead of Burkov serving out his full sentence in America, though, U.S. officials deported the cybercriminal back to his native Russia last September.",
    "The premise of the $20 million scheme: accessing and selling stolen debit and credit card numbers, along with selling stolen personal data.",
    "\"The magnitude of Russia's cyber capacity is fairly consequential, and it's coming,\" warned Biden, according to the Washington Examiner.",
    "Last fall, The Wall Street Journal reported that \"current and former officials said they were surprised by Mr. Burkov's release by U.S.",
    "According to NBC News, Burkov was arrested at Israel's Ben Gurion Airport in late 2015 and fought extradition to the United States.",
    "Burkov apparently signed a plea agreement in January 2020, after pleading guilty to two parts of a five-count indictment.",
    "According to the Examiner, neither the DOJ nor Secret Service provided any immediate comments on Burkov's whereabouts.",
    "The WSJ also reported U.S. and Israeli officials viewed Burkov as \"widely seen as a valuable asset to Moscow.\"",
    "Vorndran also wrote, \"From a cyber perspective, we would assess that China is our most formidable adversary.\"",
    "On Tuesday, Rep. Jim Jordan, R-Ohio, hailed Burkov's initial capture as a major coup for U.S. law officials.",
    "Also, prosecutors say Burkov also ran another site where people advertised others' personal information.",
    "And might Burkov play a central role in any future cyberattacks?",
    "Burkov might be the \"most notorious\" Russian hacker in history.",
    "Prosecutors claim Burkov operated a website called Cardplanet.",
    "What I do know is that there was no swap or concession.\"",
    "I don't know specifics.",
    "All rights reserved.",
    "So, what happened?",
    "© 2022 Newsmax.",
    "Special Links:",
    "authorities.\""
  ]
}