{
  "id": 7424,
  "mediaId": 2528,
  "date": "2022-03-31",
  "headline": "Key Democrats and Republicans are reviving immigration reform talks. Advocates see hope for action before pro-Trump hardliners like Jim Jordan take charge if they win the midterms.",
  "image": "https://i.insider.com/6245e47c2d38730018f4c4f2?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/congress-reviving-immigration-reform-daca-talks-ahead-of-midterm-elections-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Warren Rojas",
  "authorUrl": "https://www.businessinsider.com/author/warren-rojas",
  "termIds": [
    0
  ],
  "sentences": [
    "Cornyn also floated the possibility of prioritizing protections for current recipients of the Deferred Action for Childhood Arrivals (DACA) program — which the nonpartisan Migration Policy Institute ballparked at 600,000-plus participants in December 2021 — versus the millions of DACA-eligible individuals who have sought to stay stateside since the Obama administration rolled out the civic roadmap.",
    "Kena Betancur/AFP/Getty Images\nLong overdue\nLima said the dozens of immigration alliance members have polling data that shows overwhelming support for a three-pronged package combining the Durbin-led Dream Act, the House-passed Farm Workforce Modernization Act, and the Bipartisan Border Solutions Act developed by Cornyn, Tillis, and Democratic Sens.",
    "\"That means you have Speaker McCarthy and Judiciary Chairman Jim Jordan, neither of whom are going to allow any sort of constructive immigration proposal to leave the House,\" Ali Noorani, president and CEO of the National Immigration Forum, said of the obstacles that await if Senate dealmakers don't \"figure out what solutions can be achieved now.\"",
    "House Republican leader Kevin McCarthy, for instance, has stoked fears that terrorists are creeping into the country (which the Customs and Border Patrol refuted), while House Judiciary Committee ranking member Jim Jordan's top priority is completing Trump's easily breached border wall.",
    "Cornyn said he's looped in GOP Judiciary colleague Sen. Thom Tillis of North Carolina about the staff-level discussions and suspects that Democratic Sen. Alex Padilla of California, who chairs the Judiciary panel's immigration subcommittee, is also intimately involved.",
    "Cornyn, Tillis, Dream Act co-sponsor Lindsey Graham of South Carolina, Mike Crapo of Idaho, Mike Rounds of South Dakota, Susan Collins of Maine, and Lisa Murkowski of Alaska as lawmakers who've participated in immigration talks to various degrees in recent years.",
    "\"We think that it is similar to criminal justice reform,\" Jorge Lima, senior vice president of policy at Americans for Prosperity, said of the gradual approach that got the bipartisan First Step Act inked into law during the Trump administration.",
    "The fact that Senate leaders on both sides of the aisle are even talking about moving an immigration reform bill just months before the midterm elections is cause enough for celebration, advocacy groups tracking the latest negotiations say.",
    "Democrats repeatedly tried to weave a path to citizenship for millions of longstanding migrants in last year's budget reconciliation bill but were blocked at every turn by procedural objections raised by the Senate parliamentarian.",
    "\"The history on this issue has always shown that you try to take something that does everything, and that's when the opposition can really break off and fragment folks,\" Lima said of the inherent danger of waiting.",
    "Noorani said he's hopeful that Republicans who genuinely \"want solutions on immigration\" will take this opportunity to act rather than allowing anti-amnesty hardliners to dictate harsher terms down the road.",
    "Advocates told Insider that Senate Republicans likely understand that the chances of making positive gains on immigration will plummet if Donald Trump devotees were to gain power next year.",
    "Members of the Alliance for a New Immigration Consensus, however, say they are most excited about what they describe as the collective sense of urgency driving the revived negotiations.",
    "Senate Judiciary Committee Chairman Dick Durbin, a Democrat of Illinois, and the top Republican on the panel, Sen. John Cornyn of Texas, both said they're trying to do just that.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Immigration advocates outside the Supreme Court, which was hearing arguments on Deferred Action for Childhood Arrivals - DACA on November 12, 2019, in Washington, DC.",
    "Kevin Dietsch/Getty Images\n'A matter of will'\nWhen asked by Insider, Durbin balked at naming specific proposals in the mix for the scaled-back immigration bundle.",
    "\"I've always been sympathetic to giving them some certainty,\" Cornyn said of the current DACA crowd, adding, \"They've been in litigation for 10 years.\"",
    "\"Nobody is suggesting that we do anything like was attempted before, a comprehensive bill,\" Cornyn said, adding, \" I just don't think that's feasible.\"",
    "Jahi Chikwendiu/The Washington Post via Getty Images\nKey Senate Democrats and Republicans are reviving immigration reform talks ahead of the midterms.",
    "A woman holds a banner during a protest supporting DACA, Deferred Action for Childhood Arrivals, at Foley Square in New York, on August 17, 2021.",
    "We're going to put them on the table and see if we can build a package that gets 60 votes,\" Durbin told Insider at the US Capitol.",
    "\"By no means would just those three things solve everything we need solved on immigration,\" Lima said of the opening gambit.",
    "Senate Minority Leader Mitch McConnell needs just a single pickup to again set the agenda in the bitterly divided chamber.",
    "House Republicans need to flip just a handful of seats to wrest the speaker's gavel from Democratic Leader Nancy Pelosi.",
    "One potential starting point Durbin offered was a Cornyn-backed bill providing emergency visas to medical personnel.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Cobbling together a mutually agreeable bundle before the November election is doable, according to Cornyn.",
    "Sen. Dick Durbin, Chairman of the Senate Judiciary Committee is kickstarting talks on immigration reform.",
    "The can-do attitude on the Hill has inspired confidence in others that a last-ditch deal is within reach.",
    "\"We're not at that stage yet,\" the Senate majority whip and co-author of the perennial Dream Act said.",
    "Advocates see a sense of urgency to beat a potential change in power that could usher in hardliners.",
    "Cornyn added that this latest effort would be more constrained than other wider-reaching attempts.",
    "\"But we definitely think it's a very positive and impactful first step — if they can get it done.\"",
    "Leaders in both parties said it's possible to get a bill passed before the November elections.",
    "Should Republicans win in the midterms, such anti-immigration hardliners would be in charge.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Because, again, this is only seen as a first step,\" Lima told Insider.",
    "\"If Congress wants to add more to that, I think we would be excited.",
    "\"The trick will be to do that while holding on to the Democrats.\"",
    "\"There's a way to get to 10 Republican senators,\" Noorani said.",
    "\"Staff is gathering the measures that are currently bipartisan.",
    "But securing something is preferable to accomplishing nothing.",
    "Kyrsten Sinema of Arizona and Maggie Hassan of New Hampshire.",
    "\"We'll see where we go from there,\" Durbin said.",
    "\"I think it's just a matter of will,\" he said.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "He cited Sens."
  ]
}