{
  "id": 746,
  "mediaId": 2659,
  "date": "2022-02-20",
  "headline": "1/6 Committee Outs Why Republicans Are Trying To Hide Their Phone Records",
  "image": "https://www.politicususa.com/wp-content/uploads/2021/12/1-6-Committee-meadows.jpg",
  "link": "https://www.politicususa.com/2022/02/20/1-6-committee-outs-why-republicans-are-trying-to-hide-their-phone-records.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Easley",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Video:\nRep. Lofgren explained on CNN why the committee wants phone records:\nWe have to find out everything about the events leading up to January 6th, and this lawyer (Sidney Powell) was a key figure in the plot, and we’ve received information testimony about her activities, but we also — the phone records are not the content.",
    "Phone Records Connect Trump’s Coup Conspirators Together\nContrary to what Republicans have claimed, the phone records are not an invasion of privacy, The phone records only reveal the network of communication and who was involved in Trump’s coup.",
    "Elected Republicans like Kevin McCarthy and Jim Jordan do not want investigators to know who they were talking to, or potentially how heavily involved they were in Trump’s coup plot.",
    "The records are links to potential criminal activity, which is why Republicans are trying so hard to keep them from the American people.",
    "Rep. Zoe Lofgren (D-CA) said the 1/6 Committee is seeking phone records because those records connect the web of Trump’s conspiracy.",
    "So it’s not the content, but it does help us identify the web of the conspiracy and that’s why we would like to get these records.",
    "Republicans are trying to hide their phone records because the calls logs connect them to Donald Trump’s coup.",
    "We are a legislative committee, properly constituted, doing the work that has been assigned to us.",
    "You know, her answer was that we did not have a legislative purpose as a committee.",
    "Numerous courts have already ruled on that and ruled that that is just false.",
    "It’s just what number was called and how long did that call take."
  ]
}