{
  "id": 7460,
  "mediaId": 2590,
  "date": "2022-04-01",
  "headline": "House Passes Marijuana Decriminalization Bill",
  "image": "https://img.huffingtonpost.com/asset/6247225323000002a2138d3c.jpeg?cache=cYrb6VzGHj&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/marijuana-decriminalization-house-passed_n_6246f124e4b068157f765162",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arthur Delaney",
  "authorUrl": "",
  "termIds": [
    5399,
    2119,
    1783,
    4905,
    4777,
    3851,
    3499,
    392,
    1126,
    6026
  ],
  "sentences": [
    "mocked Republicans for harboring outdated views on marijuana - “It’s like they saw ‘Reefer Madness’ in middle school and never got over it” - and for the bizarre allegation by Rep. Madison Cawthorn (R-N.C.) that Republican leaders invited him to orgies and did cocaine in front of him.",
    "That means that even as the vast majority of states allow the drug’s use, marijuana will remain illegal under federal law, which considers it an addictive substance, with no medicinal value, as dangerous as heroin and even more dangerous than cocaine or fentanyl.",
    "Advertisement\n“I concede our party is not for the kind of cocaine-fueled orgies that a freshman Republican representative bragged about this week – but we do understand that their marijuana prohibition laws don’t work for our people,” Raskin said.",
    "The bill would also set up a process for expunging past convictions, create an excise tax on marijuana products and direct various government agencies to track and study the impact of cannabis on the economy and society generally.",
    "Rep, Barbara Lee (D-Calif.), one of the original cosponsors of the Marijuana Opportunity Reinvestment and Expungement Act, told HuffPost she hoped Friday’s vote would nudge reluctant Democrats in the right direction.",
    "Rep. Cliff Bentz (R-Ore.), who led the Republican side of the floor debate on Friday, told HuffPost that Congress shouldn’t decriminalize marijuana without setting up stricter regulations for its sale and use.",
    "Tom Williams/CQ-Roll Call, Inc via Getty Images\nWASHINGTON – The House of Representatives approved a bill Friday to decriminalize marijuana, though the measure stands little chance of becoming law this year.",
    "Black Americans are more than three times more likely than white Americans to be arrested for crimes related to marijuana, according to the American Civil Liberties Union, even though use is roughly equal.",
    "Despite bipartisan enthusiasm for the First Step Act, the prison reform bill Congress passed in 2018, there’s not much appetite among Republicans for reforming outdated marijuana laws.",
    "Only a dozen Republicans have cosponsored a separate decriminalization bill, by Rep. Nancy Mace (R-S.C.), that would decriminalize marijuana and regulate it like alcohol.",
    "“Every major urban area has increased crime and Democrats are legalizing drugs and propping up the marijuana industry,” Rep. Jim Jordan (R-Ohio) said on the House floor.",
    "The House bill would remove cannabis from the federal list of controlled substances and eliminate criminal penalties for its distribution or possession.",
    "“The only way that we can support ‘legalization’ is if we’re doing this in a way that gets control of marijuana as we now have control of alcohol.”",
    "“Legalization has, in essence, already happened because [the federal government] has ignored marijuana as a dangerous drug,” Bentz said.",
    "Advertisement\n“This is the people’s house, people have spoken, so hopefully they listen to the will of the people,” Lee said.",
    "Rep. Barbara Lee (D-Calif.) is one of the original cosponsors of the Marijuana Opportunity Reinvestment and Expungement Act.",
    "Advertisement\nRepublicans said they voted no because the legislation lacked additional funding for local police forces.",
    "“The last thing we need is more addictive behavior-altering drugs in this country,” Rep Bob Good (R-Va.) told HuffPost.",
    "Several Senate Democrats have said they’re not ready, and President Joe Biden has not backed reform, either.",
    "The House bill passed by a vote of 220 to 204, with three Republicans in favor and two Democrats against.",
    "Democrats argued the legislation would improve racial disparities in the criminal justice system.",
    "The White House did not immediately respond to a request for comment on Friday.",
    "Republicans aren’t the only obstacle to marijuana decriminalization, however.",
    "Some opposed it on the simpler grounds that drugs are bad.",
    "He said the Mace bill wasn’t strict enough.",
    "Rep. Jamie Raskin (D-Md.)"
  ]
}