{
  "id": 7601,
  "mediaId": 2818,
  "date": "2022-04-05",
  "headline": "JORDAN: Hunter Biden ‘Took Millions of Dollars’ from Moscow, Ukraine, Chinese Communists",
  "image": "https://tf-a1.azureedge.net/uploads/2021/10/joe_hunter_biden-1200x630.jpg",
  "link": "https://www.thefirsttv.com/jordan-hunter-biden-took-millions-of-dollars-from-moscow-ukraine-chinese-communists/",
  "mediaOutlet": "theresurgent.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The First",
  "authorUrl": "https://www.thefirsttv.com/author/thefirst/",
  "termIds": [
    2119,
    2286,
    3858,
    4905,
    1477,
    697,
    323,
    6494,
    6509,
    6672
  ],
  "sentences": [
    "“The tax lawyers for the VP Residence Foundation have concluded that since the Cheney folks last raised money in 2007 and not 2008, we actually have to have some incoming funds before the end of this fiscal year (i.e., before 9/30/12 – next week) to remain eligible to be a ‘public charity,’” wrote Klain, referring to former VP Dick Cheney.?",
    "The president’s son has come under renewed scrutiny 18 months after The Post’s blockbuster series of reports about his business dealings in Ukraine and China, which were based on emails and documents found on a laptop Hunter Biden left behind at a computer repair shop in Delaware in April 2019.",
    "“We need to keep this low low key, because raising money for the Residence now is bad PR — but it has to be done, so I’m trying to just collect the 10 checks of $2,000, get it done in a week, and then, we can do an event for the Residence Foundation after the election?,” he added.",
    "From the NY Post:\nSchwerin responded by saying they could “discuss this and some other bills on Monday,” and asked Hunter whether he thought “they would take a corporate check from Owasco,” ?an apparent reference to Hunter Biden’s law firm, Owasco PC.",
    "T?hree days after the Klain email, Schwerin emailed the younger Biden to say he had talked to Klain, who was checking to see if the foundation would take a check from Owasco, the report said.",
    "It remains unclear whether Owasco contributed to the foundation, but a 990 tax form from fiscal year 2012 shows that the foundation received $20,500 in contributions, just over Klain’s ask.",
    "We know he took millions of dollars from energy companies in Ukraine and millions of dollars from companies in China with ties to the Chinese Communist Party,” said Congressman Jim Jordan.",
    "Congressman Jim Jordan weighed-in Tuesday on the escalating scandal surrounding Hunter Biden; saying the President’s son “took millions of dollars” from shady overseas connections.",
    "“It’s not much — we need to raise a total of $20,000 — so I’m hitting up a few very close friends on a very confidential basis to write checks of $2,000 each,” Klain ?explained.",
    "After initially questioning the authenticity of the laptop, the New York Times and the Washington Post in recent weeks have confirmed the information it contained.",
    "Jordan’s comments come hours after recently released emails show Joe Biden’s Chief of Staff requesting $20,000 from Hunter Biden in 2012.",
    "“We know Hunter Biden took millions of dollars from the wife of the mayor of Moscow."
  ]
}