{
  "id": 7898,
  "mediaId": 2664,
  "date": "2022-04-05",
  "headline": "GOP adopts pedophile smear as QAnon conspiracy theory goes mainstream: report",
  "image": "https://www.rawstory.com/media-library/watch-trump-campaign-bans-qanon-attire-at-north-carolina-maga-rally.png?id=24480570&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/qanon-pedophile-smear/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    2187,
    2765,
    3108,
    3639,
    5699,
    1126,
    1101,
    6159
  ],
  "sentences": [
    "And while some of the details produced by its theories would find their way into the minds of Trump and his inner circle (especially with conspiracy theories centering on the 'stolen election'), the broader narrative that American politics was a fight over pedophilia remained marginal,\" he explained.",
    "The two most prominent theaters of partisan combat of the moment, the Ketanji Brown Jackson confirmation and Florida’s “Don’t Say Gay” law, have both seen a growing swath of conservatives embrace charges of pedophilia as their central theme,\" Jonathan Chait wrote for New York magazine.",
    "The ridiculous conspiracy theory that America is run by a Satanic cabal of cannibalistic sex traffickers has taken hold in the Republican Party as conservatives embrace the pedophile smear against Democrats.",
    "\"Not long ago, the notion that American politics was oriented around a dispute over the merits of child sexual exploitation was viewed as so loopy that not even Donald Trump could take it seriously.",
    "The bill bans teachers from discussing the former — say, explaining to a class that a child might have two mothers or two fathers and why that is — while using the latter as its pretext.\"",
    "\"Two years ago, the pedophilia charge was confined almost entirely to QAnon, a sprawling web of far-right conspiracy theories that operated around the fringes of conservative politics.",
    "The most fundamental lie at work is the conflation of sexual orientation and sex, a traditional way of smearing gay people by presenting them as child molesters.",
    "\"One irony of this debate is that if Democrats wanted to turn the issue against the Republicans, they would have a much richer fact pattern available to them.",
    "— Rep. Marjorie Taylor Greene (@Rep. Marjorie Taylor Greene) 1649121227\n\"Nobody, of course, denies that child pornography and other sex crimes are real.",
    "\"The pedophilia charge has worked in Florida as a way for DeSantis to smear his critics and demonstrate dominance to the right-wing base.",
    "It's not just Democrats that Republicans are smearing as pedophiles, with Rep. Marjorie Taylor Greene (D-GA) arguing Sens.",
    "The report came the same day Sen. Dick Durbin (D-IL) called out Sen. Josh Hawley (R-MO) for pushing a QAnon-backed bill.",
    "Trump, still the party’s effective leader, has been accused by five witnesses of walking in on undressed teenagers.",
    "More recently, Republican Senate candidate Roy Moore was credibly accused of sexuallly assaulting minors.\"",
    "Hawley’s gambit is to pretend any dismissal of a conspiracy theory is a denial of the crime,\" he reported.",
    "The party’s former Speaker of the House, Dennis Hastert, engaged in horrific sexual abuse of minors.",
    "The debate is over the claim that somehow Democrats want to permit those crimes to occur.",
    "Lisa Murkowski (R-AK), Susan Collins (R-ME), and Mitt Romney (R-UT) are \"pro-pedophile.\"",
    "Representative Jim Jordan helped cover up a sex-abuse scandal in college.",
    "It is now becoming the Republican Party’s most energetic idea."
  ]
}