{
  "id": 7937,
  "mediaId": 2627,
  "date": "2022-04-07",
  "headline": "Trump identifies what he considers the key detail about Jan. 6",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220407-MB-Trump-Stop-the-Steal-jg-2aeba6.jpg",
  "link": "https://www.msnbc.com/rachel-maddow-show/maddowblog/trump-identifies-considers-key-detail-jan-6-rcna23443",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Benen",
  "authorUrl": "https://www.msnbc.com/author/steve-benen-ncpn433601",
  "termIds": [
    2119,
    4066,
    2765,
    1126
  ],
  "sentences": [
    "The symmetry of the circumstances is extraordinary: On Trump’s first full day in office in January 2017, the Republican was preoccupied with the size of his inaugural crowd, to the point that he literally called the National Park Service, asking for photographic evidence that his audience was larger than it appeared.",
    "The Republican also told the Post he regretted not having marched to the Capitol with his rabid followers — the “Secret Service said I couldn’t go,” he complained — raising some awkward questions about why, exactly, Trump wishes he’d stood alongside those who violently attacked his own country’s seat of government.",
    "With gaps in the White House call logs in mind, it also stood out that the former president conceded he had phone conversations with congressional allies — including House Minority Leader Kevin McCarthy and Rep. Jim Jordan — which dovetails in provocative ways with earlier reporting.",
    "It’s been a while since Donald Trump talked to an independent news organization about the Jan. 6 attack, so the former president’s Washington Post interview yesterday stood out — in part because it was unusual, and in part because the Republican covered a surprising amount of ground.",
    "Describing his thoughts during the insurrectionist violence, Trump claimed, for example, that he “thought it was a shame.” We know better: It was just a couple of months ago when the former president celebrated the rioters as innocent “patriots,” whom he’d consider pardoning.",
    "“But this was a tremendous crowd.”\nMore than a year after the riot, after having time to reflect on the events, Trump has identified what he considers the truly important detail about the events of Jan. 6, 2021.",
    "No, as we’ve discussed, what really weighs on the former president is the degree to which “they” fail to acknowledge the size of the crowd that appeared in the nation’s capital in advance of the riot.",
    "In fact, the Republican wants more credit for having brought together anti-election conspiracy theorists, some of whom attacked the U.S. Capitol after having been riled up by Trump’s lies.",
    "And they don’t talk about it.... “[This was] the biggest crowd I’ve ever — and I’ve spoken before the biggest crowds — the biggest crowd I’ve ever spoken by far.",
    "From the article:\nThe former president ... repeatedly bragged about the size of the crowd on the Ellipse, when questioned about the events of Jan. 6.",
    "Five years later, he’s now out of office, and still fixated on crowd size, which he continues to see as evidence of his self-professed greatness.",
    "By numerous times, I think.”\nFor good measure, the former president went on to say, “Why don’t they show the real crowd that was there on Jan. 6?",
    "But I was also struck by Trump’s focus on what he still considers one of the key details of Jan. 6: the pre-riot crowd size.",
    "They never show helicopter pictures of that incredible crowd because it was the largest crowd I’ve ever spoken before.",
    "I’ve never had a crowd — I’ve never seen a crowd that big.”\nHe added, “You know what that number was, right?",
    "The fact that Trump is obsessed with the size of the crowd reflects just how twisted his priorities are.",
    "“They always show the Capitol with a very small, just a tiny percentage of the people that were there.",
    "Third, there is no nefarious “they” conspiring behind the scenes to hide evidence of his crowd size.",
    "Last summer, Trump insisted “over a million people” attended his anti-election rally on Jan. 6.",
    "Second, the crowd at the Ellipse on Jan. 6 was modest and not even close to a million people.",
    "They don’t want to show pictures, the fake news doesn’t want to show pictures,” he said.",
    "Three months ago, while sitting down with a conservative outlet, he was at it again.",
    "They don’t want to show that crowd because that shows what it was all about.",
    "They were there over a rigged election.”\nFirst, the election wasn’t rigged.",
    "They don’t cover the numbers of people,” Trump said of his Jan. 6 audience.",
    "And finally, the events of Jan. 6 were of extraordinary significance.",
    "Circling back to our earlier coverage, this guy can’t let it go.",
    "The attempts to use violence to reject our system of democracy?",
    "I don’t know what that means, but you see very few pictures.",
    "The crowd of people that was the biggest I’ve ever seen.",
    "I believe it was the largest crowd I’ve ever spoken to.",
    "I haven’t seen any — you can hardly get a picture.",
    "“The crowd was far bigger than I even thought.",
    "The defilement of our seat of government?",
    "And I don’t even talk about that.",
    "They have censored the pictures.",
    "We’re trying to find pictures.",
    "Recommended\n“Massive numbers.",
    "The insurrectionist intent?",
    "The alleged crimes?",
    "The fatalities?"
  ]
}