{
  "id": 7943,
  "mediaId": 2730,
  "date": "2022-04-01",
  "headline": "House Judiciary Sends Letter to Big Tech Calling Them Out for Censoring Hunter Biden Story",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2020/295/954d65ae-ed3a-4bb5-a09b-1118de78918d.png",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/04/01/house-judiciary-sends-letter-to-big-tech-calling-them-out-for-censoring-hunter-biden-story-n2605322",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    0
  ],
  "sentences": [
    "Agrawal is asked for similar eight items, also by April 14, though the Republican members additionally want to know about what determined that the New York Post's article violated Twitter's \"Hacked Material Policy,\" as well as \"All documents and communications between October 1, 2020, and the present referring or relating to Twitter’s decision to censor the House Judiciary Committee’s website for reposting the New York Post article.\"",
    "A GOP communications source familiar with the committee assured Townhall that \"we are obligated to get to the bottom of what I think are the twin histories involved here,\" with those being \"the fully truth of this unprecedented abuse of power, and then the history that has yet to be written about what we did to make sure it can never happen again.\"",
    "Now, with even the New York Times confirming the accuracy of the Post’s reporting, we are investigating Facebook’s actions to interfere in free and fair election-related public discourse on its platform to the benefit of President Biden and the detriment of former President Trump,\" the letter to Zuckerberg in part begins.",
    "Jonathan Wilcox, the communications director for Rep. Issa, added that \"Democrats don't want any part of this, because they know where it inevitably leads: the full realization of the worst of what Big Tech is capable of, their mainstream media enablers, and the Democrat industrial complex that ties them all together.\"",
    "The poll from 2020, conducted shortly after the election, found that 36 percent of voters were not aware of the story providing \"evidence linking [Biden] to a corrupt financial deal with China,\" and, that 13 percent, had they known, would not have voted for Biden, compromising of 4.6 percent of his total vote.",
    "\"Although the Post explained exactly how it obtained the emails on which it reported, Twitter still suppressed the article—going so far as to lock the Post’s account and the account of any user who tried sharing the article—because the article supposedly violated Twitter’s \"Hacked Materials Policy.\"",
    "The eight items, requested by April 14, focus on inquiring into \"all documents and communications between October 1, 2020, and the present\" to do with Facebook's decisions to \"reduce the dissemination,\" as well as which employees made such decisions, and more information on fact-checkers.",
    "Also inquired about is the connection between employees involved in those decisions had with the DNC or Biden campaign, as well as Facebook's decision to report or not report \"its actions to the Federal Election Commission as an in-kind contribution to the Biden campaign.\"",
    "Source: New York Post\nWhile mainstream media outlets are finally admitting the truth about Hunter Biden's laptop, Republicans in Congress are feeling more emboldened to get to the bottom of why the story was censored from the American people before the 2020 election.",
    "\"It appears that Facebook knowingly and deliberately used its platform to control election-related information accessible to the American people shortly before the 2020 election, and that Facebook did so to the primary benefit of then-Vice President Biden.",
    "Instead, Facebook announced that the article would be \"eligible to be fact checked by [the company’s] third-party fact checking partners\"; however, Facebook has never revealed the results of this fact-check, or even whether it occurred,\" the letter reads.",
    "On Thursday, the Republican members of the House Judiciary Committee sent letters to Facebook's Mark Zuckerberg and Twitter's Parag Agrawal, calling both social media platforms out for censoring reports from The New York Post on the Bidens.",
    "As I covered last month, polling from the 2020 Public Polling Project conducted for Inside The Numbers found that in key states such as Pennsylvania and Wisconsin, about 75 percent of voters had heard of the Hunter Biden story.",
    "During a Thursday appearance on Fox Business, Ranking Member Jim Jordan of Ohio responded with an \"of course\" when asked by Stuart Varney \"did the media, and social media, suppress the Hunter Biden story, deliberately?\"",
    "\"Soon after the Post published its article, Facebook’s Policy Communications Director, a former staffer for Democrat elected officials, announced that Facebook was \"reducing its distribution on our platform.\"",
    "This irresponsible conduct demands a thorough investigation so that we may understand how Big Tech wields its enormous power over the free flow of information to the detriment of free and fair elections.\"",
    "\"This is the most serious scandal since Watergate, and it warrants the investigation no less robust and no less bipartisan than the one that resulted in the resignation of a president,\" he told Townhall.",
    "\"In addition, Facebook’s actions gave rise to other news outlets, tech platforms, and even Biden himself dismissing the Post story as disinformation or untrue—when, in fact, it had never been rebutted.",
    "If Republicans take control of the House following the midterms, and they are predicted to do so, the Judiciary Committee will be full of veteran members in the majority, like Issa and Jordan.",
    "Although Twitter’s former CEO admitted that Twitter’s censorship actions were \"wrong,\" Twitter continues to censor political speech in a manner that suppresses conservative voices.\"",
    "Agrawal's letter similarly pointed out that \"Twitter locked the Post’s account, blocked users from sharing the link to the article, and even labeled the material \"unsafe\" for users.",
    "The congressman also said that \"Big Tech, Big Democrat Party, and Big Media all colluded to keep critical information from the American people in the runup\" to the 2020 election.",
    "In an interview with Townhall previewing his book last November, Rep. Jordan shared he hopes to be chairman of the House Judiciary Committee if they are in the majority.",
    "Facebook presumably did this because \"it s[aw] 'signals'\" that the Post story was \"false,\" As far as we know, Facebook has never identified or explained these \"signals.\"",
    "Twitter also censored the official House Judiciary Committee website, where we reposted the article so the public could access it without Twitter’s interfence [sic].",
    "In 2021, the poll showed that 51.8 percent of respondents believed Big Tech \"interfered in the 2020 election\" by censoring the story on Facebook and Twitter.",
    "Rep. Darrell Issa (R-CA), who has served on the committee for several years, likened the Hunter Biden scandal to another great moment in history.",
    "Facebook’s actions helped shield Vice President Biden from increased scrutiny about the impropriety detailed in the Post article,\" it reads.",
    "\"Facebook ignored our letter [from October 14, 2020] and, in the months since, has avoided any meaningful accountability for its actions.",
    "For the 2016 election, Rich Baris told Townhall that about 90 percent of voters had heard of Hillary Clinton's scandals.",
    "In 2020 and 2021, the Media Research Center commissioned a poll from McLaughlin & Associates on censorship of the story.",
    "Twitter also claimed that it censored the article because it included images of \"personal and private information.\"",
    "But when we posted the article on our website without personal or private information, Twitter censored us too.\"",
    "The mainsteam media followed Twitter’s lead, wrongly claiming the Post story was \"disinfo\" and unverified.",
    "Before laying out the eight items requested from Zuckerberg, the letter has more strong words.",
    "Republicans are currently in the minority, and limited in what they can do.",
    "The letter addresses Big Tech's election interference, and its cover up.",
    "The letter doubles down on calling out censorship.",
    "That may change in a few months, though."
  ]
}