{
  "id": 8906,
  "mediaId": 8322,
  "date": "2022-03-27",
  "headline": "House GOP pushes Wray for transparency on FBI misconduct in probing politicians, religious groups, journalists",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2020/11/Andy-Biggs.jpg",
  "link": "https://www.foxnews.com/politics/house-gop-pushes-wray-transparency-fbi-misconduct-probing-politicians-religious-groups-journalists",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fred Lucas",
  "authorUrl": "https://www.foxnews.com/person/l/fred-lucas",
  "termIds": [
    2765,
    3468,
    2426,
    1477,
    1126,
    392,
    474
  ],
  "sentences": [
    "HUNTER BIDEN'S LAPTOP: EX-CIA OFFICER BUCK SEXTON RIPS FORMER COLLEAGUES' REFUSAL TO APOLOGIZE\nBiggs signed onto a March 21 letter with the House Judiciary Committee’s ranking member Rep. Jim Jordan, R-Ohio, and Rep. Mike Johnson, R-La., to FBI Director Christopher Wray requesting an unredacted copy of the report, documents referring to or relating to the audit, an explanation of whether the FBI resolved the matters and a description of the FBI’s predicate to open investigations into politicians, religious groups and others named in the audit.",
    "\"While the number of deviations from FBI approval, notification and administrative requirements noted in the report is unacceptable, we began implementing important changes in training and raising awareness even prior to issuance of the report, and we remain committed to ensuring all personnel adhere to our internal investigative and operational guidelines.\"",
    "The letter goes on to remind the director that in testimony before the committee in 2021, he said the FBI \"investigate[s] individuals with proper predication\" and said it does not \"investigate First Amendment groups … [or] people for speech, association, for assembly [or] for membership in domestic First Amendment groups.\"",
    "Although the audit doesn’t identify the people and groups investigated by the FBI, it says 191 involved public officials, while dozens of cases involved religious groups, dozens involved political organizations, 10 cases involved political candidates and 11 cases involved the news media.",
    "The audit says officials violated FBI policies in failing to receive approval from supervisors and attorneys before opening a sensitive investigation and also did not notify the appropriate United States Attorney’s Office in writing within a month of starting the probes, as required.",
    "While the FBI has faced increased scrutiny in recent years for alleged politicized investigations into former President Donald Trump, the problems apparently are much broader and likely go beyond the report, said Biggs, a member of the House Judiciary Committee.",
    "The letter adds, \"However, this internal review — which you never disclosed and which shows fundamental errors with FBI investigations touching on sensitive political and constitutional matters — calls into question the reliability of your statements.\"",
    "He added that if the Democratic-controlled House doesn’t investigate the matter and is unwilling to compel production of documents and testimony from the FBI, then a new Republican House majority will be ready to investigate and hold hearings in 2023.",
    "\"This internal audit and the staggering number of errors it found suggest a pattern of misconduct and mismanagement within the FBI in failing to uphold internal rules for its most sensitive cases,\" the House GOP letter to Wray states.",
    "\"The FBI takes compliance very seriously, especially when it comes to sensitive investigative matters, which is why, in 2019, we conducted an internal audit of those matters,\" the spokesperson said in an email response to Fox News.",
    "The FBI conducted an internal audit, a highly redacted version of which came to light earlier this month, that found 747 \"compliance errors\" across 353 separate cases in the category of \"sensitive investigative matters.\"",
    "Rep. Andy Biggs, R-Ariz., contends Democrats have a stake in digging for more details about the FBI breaking its own rules to probe elected officials, political candidates, religious organizations and the news media.",
    "The Washington Times first reported on the 45-page audit that shows the 747 \"compliance errors\" occurred over a relatively short time frame between Jan. 1, 2018, and June 30, 2019.",
    "An FBI spokesperson confirmed the bureau did receive the letter from the three GOP House members but did not say whether it would respond to the members or when.",
    "I suspect this conduct goes back for multiple administrations and has been an ongoing problem affecting members of both parties.\"",
    "\"It possibly includes information about the surveillance of candidate Trump and later President Trump.",
    "Biggs said, as of Thursday, he has not received a response to the letter of inquiry.",
    "\"The Judiciary Committee will have oversight in the next session of Congress.\"",
    "But this is almost 750 compliance problems in 350 cases,\" Biggs told Fox News.",
    "\"The next step is to call on the committee to have a hearing on this.",
    "If I was in the majority, I would want to get to the bottom of this.",
    "The bureau acknowledged the 2019 audit findings were \"unacceptable.\"",
    "We’ve got to get to the bottom of it,\" Biggs said.",
    "It’s an important issue.",
    "\"We can’t let this go."
  ]
}