{
  "id": 8920,
  "mediaId": 2618,
  "date": "2022-03-30",
  "headline": "Finnish MP, Lutheran bishop acquitted of ‘hate speech’ after promoting Biblical morality",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/03/30/finnish_mp_lutheran_bishop_acquitted_of_hate_speech_after_promoting_biblical_morality_82304.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Staff",
  "authorUrl": "",
  "termIds": [
    2275,
    1800,
    6156
  ],
  "sentences": [
    "(Snip) “Räsänen has also received letters of support from many denominations including the International Lutheran Council with Bishops and presidents of Synods from all over the world, the European Evangelical Alliance, Catholic and Pentecostal churches in Lithuania, representatives of the Evangelical, Catholic, Baptist, Pentecostal, Reformed and Unitarian churches in Romania, as well as the Evangelical Church of Macedonia, Christian NGOs in Latvia and other individuals.",
    "It could open the door for prosecution of other devout Christians, Muslims, Jews and adherents of other faiths for publicly stating their religious beliefs,” the letter asserted.” The support extended from various Christian denominations throughout the world as well as individuals and government officials is most sincerely appreciated.",
    "FTA: “Räsänen, a former Minister of the Interior, had been charged with “hate speech” for sharing her faith-based views on marriage and sexual ethics in a 2019 tweet, a 2019 radio debate, and a 2004 pamphlet.",
    "“Several US Senators signed a letter addressed to Rashad Hussain, the US Ambassador-At-Large for International Religious Freedom, expressing their concern over the “alarming” prosecution of Räsänen.",
    "“We are greatly concerned that the use of Finnish hate speech law is tantamount to a secular blasphemy law.",
    "Bishop Pohjola faced charges for publishing Räsänen’s pamphlet for his congregation over 17 years ago.",
    "Isaiah 40:8 ~ “The grass withers, the flower fades, but the word of our God will stand forever.”",
    "Blessings to one and all.",
    "Thanks be to God!"
  ]
}