{
  "id": 895,
  "mediaId": 2573,
  "date": "2022-02-16",
  "headline": "'Hannity' on Durham findings, Canadian truckers",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/49350299-0177-4258-9f2a-c5ed80f0eb0e/10ed52ee-ab56-4a90-83fa-ec32d383a1e5/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/transcript/hannity-durham-findings-canadian-truckers",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1708,
    1894,
    3054,
    3166,
    3246,
    2767,
    514,
    6029,
    6492
  ],
  "sentences": [
    "Now, let me be clear, what Trudeau is signaling is an all-out authoritarian, dictatorial crackdown against an overwhelmingly peaceful protest, rather than meet with the heroes of the pandemic that kept Canada alive in their worst moments, rather than negotiate a settlement, rather than listening to their legitimate concerns, he is acting like an authoritarian thug cracking down with the full force of government on the heroes of the pandemic.",
    "So there's still a lot more that needs to be done, but another thing that I thought you'd think was interesting is we talked to some of the convoy earlier, Sean, and they told us that they had a police escort by the Ottawa PD to move out of the neighborhoods today and in front of parliament so no matter what the prime minister is saying there's still more truckers with this convoy and they're not going anywhere.",
    "So what we have, lawyers for the Clinton campaign paid a technology firm to infiltrate servers in where you work in Trump when you worked in Trump Tower when your dad was running, and then later in the White House when your dad was the president and they did it to establish an inference and a false narrative to bring government agencies to link Donald Trump to Russia.",
    "And, Sean, I remember the day -- I remember like it was yesterday when we got that call from, first, \"The New York Times\", and second of all, \"The Wall Street Journal\", and they asked well we have information saying that the Trump Organization has hidden servers that link directly with the Kremlin bank, and I'm sitting there saying, what are you people talking about?",
    "Well, still tonight you can see behind me, no matter what the prime minister says, according to these truckers in this convoy, they're not going anywhere, and the more threats they get, they're saying they're going to give them Canadian dollars worth of fines, they could send them to jail, they're going to take their trucking license, you name it, they've tried it.",
    "Copyright 2022 VIQ Media Transcription, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of VIQ Media Transcription, Inc. You may not alter or remove any trademark, copyright or other notice from copies of the content.",
    "These allegations they lied, and then they find out that Hillary paid for the entire thing, no different than they found out that when Michael Sussman went into lying to the FBI about the fact that Trump reportedly had Secret Servers all over Trump Organization that was talking to Russia banks he was getting paid by the Hillary campaign.",
    "But you got a spineless, coward, gutless Biden of the north, Justin Trudeau, and now he says he's invoking the so-called Emergencies Act, invoking powers that Canada has never invoked before in the country's history and is trying to attack what has been a peaceful gathering of truckers and others and attacked their civil liberties.",
    "Mark -- let me start with you, Paul, because what you went through and you now hear this and all the things that you got caught up in a case that had been long put you know in moth balls they dragged it out and put you in jail and said if you say this, we'll let you out of jail which you didn't do.",
    "(COMMERCIAL BREAK)\nHANNITY: More blatant double standards tonight from far left Hollywood celebrities seen maskless all across the L.A. Super Bowl yesterday, all while children had to go to school today under those California draconian mask mandates and having their education thrown into chaos.",
    "After infiltrating the servers at the Trump Tower and the executive office of the president and spying on her opponent and then the president, the Clinton campaign found no evidence in any form or fashion that Trump was a Russian asset so they just fabricated all of this out of thin air.",
    "They're lying to the FBI and what Sussman lied about was that he went to FBI counsel James Baker and lied and said he wasn't there on behalf of any candidate, act like he was a do-gooder, just a public servant, when, of course, the Clinton people had paid for him..",
    "And it gets worse because as part of the crackdown, the deputy prime minister is saying they are broadening the country's terrorist financing rules to prevent the truckers from accessing the donations, the Crowdfunding platforms and from even using cryptocurrency.",
    "HANNITY: And, you know, Mark, one of the things -- why I don't have a lot of confidence tonight, although all of this is now, Durham wouldn't put it in his findings because that's the evidence he is saying he is going to present before a court, if it wasn't true.",
    "MANAFORT: Well, I'll be talking about the way the special prosecutor tried to get me to accept the narrative that they were weaving which was not a correct narrative and which now you can start to see the dots coming out as to what the whole game was all about.",
    "I can't predict what Durham will ultimately find, nobody's been held accountable for the lies they made to the FISA court that we know they made lies, they knew they were lying, but I do know that as of now, all roads lead back to one person and one campaign.",
    "(BEGIN VIDEO CLIP)\nCHRYSTIA FREELAND, CANADIAN DEPUTY PRIME MINISTER: We are broadening the scope of Canada's anti-money laundering and terrorist financing rules, so that they cover crowd funding platforms and the payment service providers they use.",
    "Here now, with the author of \"Here's the Deal,\" former senior counselor to President Trump, Kellyanne Conway, and on author of \"Political Prisoner\", former Trump campaign manager Paul Manafort, former White House chief of staff Mark Meadows.",
    "We knew about Christopher Steele's debunked dirty Russian misinformation dossier bought and paid for by Hillary Clinton and, of course, the money was funneled through a law firm Perkins Coie, and Fusion GPS, and they hire Christopher Steele.",
    "Apparently, he now wants to treat freedom-loving truckers like terrorists freeze their bank accounts seize their property put them in jail take their rigs and with Justin Trudeau, I guess the apple doesn't fall far from the tree, does it?",
    "You're going to send in the military, you're going to send in police, crack a few heads, arrest people, imprison people, confiscate their livelihood, their rigs, put them in jail, fine them a hundred grand, as they're talking about?",
    "Now, thanks to a brand new filing from the special counsel John Durham, we now know that the Clinton campaign paid a tech firm to infiltrate the servers at Trump Tower and then later infiltrate the servers at the Trump White House.",
    "I'm going to go through this slowly because without a doubt, unequivocally, the Trump campaign -- their campaign, their transition team, even the Trump White House -- meaning the president -- was spied on by the Clinton campaign.",
    "Not only do they hack into the opposing campaign and steal material like in the case of Watergate, but then they hacked into the office of the president of this great country, according to Durham's blockbuster filing late Friday.",
    "Not much has changed here in the past few weeks, every single weekend, it really does pick up, but even here on a Monday night, you can see the crowds are still pretty thick right here in the middle right in front of parliament.",
    "These emergency powers for the first time, they're talking about putting these heroes of the pandemic in jail, hundred thousand dollar fines, confiscate their rig, take away their licenses, destroyed their livelihoods for what?",
    "The most scary thing announced today by the finance minister who's on the World Economic Forum board is that banks will be directed to seize your accounts without due process, and you can't even sue them, they're indemnified.",
    "(END VIDEO CLIP)\nMCADAMS: And we really haven't seen too many police officers they've really been outnumbered by protesters at this point although the prime minister has continued to say that he's sending in more resources.",
    "They've actually moved more trucks in there just today and they're trying to put it into an area, Sean, that even if they do try to come in and tow them, they won't be able to really get in and move those tow trucks around.",
    "They knew and they know the dossier was a lie but their hatred of Donald Trump was more important than the truth they have never set the record straight they never made a correction they never admitted that they were wrong.",
    "And this is separate and apart, this is on top of Hillary Clinton paying for the dirty Russian misinformation dossier that we know in fact was full of lies, but yet was presented to a FISA court on four separate occasions.",
    "The announcement coming as the freedom convoy has taken over Canada's capital, semi trucks still lined up in front of parliament tonight even as the Canadian government threatens the group with fines and jail time.",
    "And clearly, the Clinton machine was willing to do anything and everything, legal and illegal, to win an election and when that didn't work, to then smear and destroy the guy that legitimately won that election.",
    "This is how --\n(CROSSTALK)\nWEINER: Sean, if you want -- if you want, you can tune in to the show and you can hear --\n(CROSSTALK)\nHANNITY: But you're on my show now and I'm giving to the chance now to do it.",
    "It's for other people to see that you -- that you're dealing with --\n(CROSSTALK)\nHANNITY: Well, the last words be after you tell that story, the last words would be --\nWEINER: Let me just finish my thought.",
    "They're getting results as Ontario's, the latest Canadian province now to scrap their vaccine mandate, bringing the total to five provinces who have gotten rid of the mandate, big win for the truckers.",
    "This includes, let's see, oh, the liberal Mayor Garcetti, who again was seen without a mask after claiming just weeks ago, it was okay when he took it off to take a picture because he held his breath.",
    "That too was bought and paid for by Hillary Clinton's attorneys, and when they came up empty, Jake Sullivan was more than happy to disseminate unverified rumors and conspiracy theories as fact.",
    "I -- I would just recommend in the sense that if it was something this serious, that there's got to be, let me fall on the sword, admit and tell people what's different about me at this point.",
    "It was that there are other Clinton operatives that were shopping around parts of the dossier John Durham kudos to him for bringing it all together but shame on the media for not covering it.",
    "Take a look at what Nancy Pelosi once had to say after the Democratic Congressional Campaign Committee was hacked in a similar fashion by a foreign government, not by Republicans, in 2016.",
    "And there's Comey, in the middle of a 10-year FBI term, and he wants to stay on as director, but he didn't make his way to Trump Tower until January 6, two full months after the election.",
    "(BEGIN VIDEO CLIP)\nUNIDENTIFIED MALE: We need to tighten up what is defining as an emergency and ensure that they can't just use those powers whenever they feel that there's an emergency.",
    "Our owner operator, John Catsimatidis, who as you know saved WABC from the scrap heap, there would never again a WABC if he hadn't rescued it -- believes in giving people a second chance.",
    "So, I think all of us, Democrats and Republicans, we have come to a conclusion that if you've done your time, if you pay the price for what you did, it's time to come back into the fold.",
    "Maybe that's because Biden's national security adviser, that guy right there, Jake Sullivan, he is at the center of this entire scandal and here's where the story takes yet another turn.",
    "Comey, Brennan, Susan Rice, Joe Biden, Barack Obama, they were all being -- Clapper, of course -- they were all being briefed about what was going to happen at Trump Tower the next day.",
    "You know, the same prosecutors will go after my father every single day for nothing right, just because they want to disqualify him because he's clearly the frontrunner for 2024, right?",
    "HANNITY: You know, Clay, I don't have a problem, because we're now at a point we're fully vaccinated, boostered, and even people with natural immunity can get COVID and transmit COVID.",
    "When five provinces have already gotten rid of the mandate and the rest of the world is getting rid of their mandates, even in Washington, D.C., all across America, all across Europe.",
    "But it was the day before, Sean, that I was at the White House, the Obama White House for a transition lunch, and while I was down the navy mess upstairs, they were cooking this up.",
    "She pitted America against Russia, two of the biggest nuclear superpowers in the world, she pitted them against each other to hopefully get a couple extra greedy votes for herself.",
    "That's the most cherished building in this country that has the most top secret everything in this country that runs our government, and it's okay just to break into servers, why?",
    "And then also something to point out that we've been talking to some of the protesters about is just how quickly and how much they've packed into this area in front of parliament.",
    "HANNITY: So they paid people to infiltrate the servers at Trump Tower when your dad's a candidate, then the White House which is unbelievable to me when your dad's the president.",
    "And it wasn't until years later, it wasn't until the indictment, you know, a month or two ago that we figured out who this guy Michael Sussman was and what exactly was happening.",
    "But here's what we do know -- this particular allegation and the filings that have been made by the special prosecutor is really starting to connect the dots for the first time.",
    "Sean, nothing is more illustrative of the level of hypocrisy here than the fact that all these celebrities have no masks but the L.A. kids orchestra, they are masked up outside.",
    "I'll just have to donate to a fund that I know will get to them, you know, because I don't really give a damn what Trudeau thinks about me, but I do care about these truckers.",
    "He's going to use this as an excuse to get a database of everyone who chipped in for the truckers and put them on an enemies list and seize the bank accounts of his enemies.",
    "So all those who investigated the screaming chyrons, the hours and hours of coverage, let's at least have our due, dig a little bit deeper and let's see where this takes us.",
    "HANNITY: Curtis, I would say between the two of us, we have anywhere between 60 and 70 years of talk radio experience under our belt, and we've been friends for a long time.",
    "MCADAMS: What if they take your trucker's license\nUNIDENTIFIED MALE: They've been threatening things like that, but like I said, the cops have been super friendly with us.",
    "Okay, Adam Schiff or, you know, whatever we want to call you, the congenital liar, if you really care about election interference, is it okay when Hillary Clinton does it?",
    "Think about what we knew before this filing of John Durham and what we've known for a long time and what we spent nearly three years investigating right here on this show.",
    "We are making these changes because we know that these platforms are being used to support illegal blockades and illegal activity, which is damaging the Canadian economy.",
    "Ontario is now in the process of rolling back COVID restrictions, including vaccine passports but the truckers I've talked to on the ground, Sean, say that's not enough.",
    "If this turns into something else because he's sending people in there directly to confront them, I can't guarantee that at that point, people won't defend themselves.",
    "And I must tell you, if Anthony Weiner had not had his personal problems, we wouldn't have had Bill de Blasio for eight years who single-handedly destroyed our city.",
    "You know, \"The Washington Post\"/ABC News poll during the end of the 2016 campaign said that 62 percent of Americans said Hillary was neither honest nor trustworthy.",
    "Coming up, Canadian truckers continue to take a stand against draconian vaccine mandates, but the coward of the north, Justin Trudeau, is moving to shut them down.",
    "Naturally, Sullivan's wife just to make it even more interesting works for the attorney general of the United States Merrick Garland who oversees the Durham probe.",
    "MARK MEADOWS, FORMER WHITE HOUSE PRESS SECRETARY: Well, we know that when Donald Trump said that they were spying on his campaign, he got all kinds of pushback.",
    "It's important to note that all of those celebrities that your flashing on the screen, they are blatantly violating the So-Fi stadium Super Bowl mask mandates.",
    "(COMMERCIAL BREAK)\nHANNITY: A new show on WABC Radio in New York, they're exploring the left- right divide and major issues affecting New York City and beyond.",
    "There is one other thing that will come out is that dossier that you're talking about it's not just the fact that Hillary Clinton's campaign had paid for it.",
    "So is the wimpy, cowardly, gutless Justin planning what are you planning Justin on sending in the police or the military to hurt the heroes of the pandemic?",
    "CURTIS SLIWA, CO-HOST OF \"THE LEFT VS THE RIGHT\" ON 77 WABC RADIO: Well, I actually did two weeks of programming with Anthony before his life just imploded.",
    "But in terms of like I'm trying to draw someone in -- no, I'm not trying to make someone like me or someone to be persuaded of any particular outlook on me.",
    "I don't think anyone can go through that kind of experience -- and I think this is probably true of people who have been through other types of adversity.",
    "Very quickly, Clinesmith, Sussman, you got to look at these names everybody, Danchenko, these are folks who either in the case of Clinesmith pled guilty.",
    "Now, taking orders from what Joe Biden, a U.S. president who's done nothing to secure his own borders to the south, the truckers are allowing commerce.",
    "We did one this past Saturday where people had an opportunity to call in, and where Curtis asked me a bunch of questions and I answered the best I can.",
    "I mean, literally, two of the biggest countries in the world get pitted against each other, you know, for the benefit of one candidate's greed, right?",
    "The whole Mueller predicate was the fake Steele dossier, the fake black ledger, the fake ties with the banks between the servers of Trump and Russia.",
    "In the end, 69 people were indicted, 48 people were convicted, and Richard Nixon ended up resigning in disgrace for his part in the cover-up of this.",
    "They knew it was unverifiable and they still used it to spy on Donald Trump the candidate, the transition team, and then Donald Trump the president.",
    "Do you -- can you assure people, because you're going to now try and draw in an audience and they're going to want to know if you've changed or not.",
    "We saw that in the Trump administration when he cut the jail time of so many people that we didn't realize were being incarcerated 20, 30, 40 years.",
    "Coming up the left's covet hypocrisy on full display at the super bowl last night were you watching the game hardly a mask in sight, but guess what?",
    "That means trucks will be towed away and the prime minister has even threatened to freeze the bank accounts of the truckers if they don't go home.",
    "Anyway, remember they once cared about, quote, journalism through their top secret source deep throat they broke the Watergate story wide open.",
    "And you think they would spend a minute and inform their viewers that they were wrong the entire time and update them on this new development?",
    "But yet they continued to go before the FISA court and purposely put forward false information that they know was unverified and unverifiable.",
    "We're going to have some conversations about things going on in New York City and other places and hopefully, people will tune in to the show.",
    "They learned in December of 2016 that they shouldn't have used it, and then the sub-source of Christopher Steele said it's nothing but bogus.",
    "I think these pro five provinces is a significant win and if -- I mean, if he wasn't going to this extreme, the truckers have been peaceful.",
    "Her campaign knew that that was the case, so they had to -- they had to hurry up and do other things to try to get her over the finish line.",
    "In a moment, we will check in on Canada where the country's wannabe socialist dictator Justin Trudeau just invoked the Emergency Powers Act.",
    "And I hope one day very soon, her campaign will be held accountable for the worst political spying scandal in the history of this country.",
    "But I don't have a lot of confidence because we already knew about the dirty Russian dossier that Hillary paid for that was unverifiable.",
    "I guess the first question that I have is you pled guilty, Anthony, to the sending obscene materials to a young girl, a 15-year-old girl.",
    "And whether or not we get to the bottom of this is going to -- it will speak volumes about what we can expect this country to turn into.",
    "So, I don't really have a lot of hope that there's equal justice and application of our laws any longer in the United States of America.",
    "That to me would be the biggest scandal in the history of modern politics if not the presidency, but yet, there's crickets in the media.",
    "Now, the executive office of the president was surveilled, but the White House can't be bothered to answer one single question about it?",
    "If you tell us what we want to hear about Trump, whether it's true or not, you could walk out the door, you won't be in prison anymore.",
    "(COMMERCIAL BREAK)\nHANNITY: Right now, the freedom convoy is standing strong tonight, standing up against one-size-fits-all medicine.",
    "And to that end, according to foxnews.com, his probe is accelerating, more people are cooperating and testifying before a grand jury.",
    "I mean, how many millions of hours of testimony on Capitol Hill, how many tens and tens and tens of millions of dollars were wasted?",
    "But now, surprise, surprise, Nancy is totally, completely, utterly silent about Durham's revelation, so is the Biden administration.",
    "Three years of my father's invest -- administration was spent dealing with this hoax, all for that woman on the screen right there?",
    "This is the first time in Canadian history that they've used the emergencies act here in Canada and it's now in effect for 30 days.",
    "John Durham, he's been taking forever but he's supposedly looking for the truth and he's given us a window into what he's finding.",
    "If this filing is accurate, it is all illegal, everyone involved should go to jail, just like Watergate, except this is far worse.",
    "MSDNC, by the way, probably a very convenient time for the conspiracy theorist of all time, Rachel Maddow to be on, quote, leave.",
    "PAUL MANAFORT, FORMER TRUMP CAMPAIGN MANAGER: Yeah, I mean, it's as -- as Eric just said, karma comes because it's payback time.",
    "Now, the reason the media will ignore this story that is bigger than Watergate is because they are accomplices the entire time.",
    "He was released in 2019 and he says he's ready to answer tough questions about his own life, the challenges facing the country.",
    "Now, they are nowhere to be found and apparently, you know, for them, politics is much more important than, quote, journalism.",
    "New York prosecutors come after us every single day on these political witch hunts, trying to find anything they possibly can.",
    "Jake Sullivan was a senior policy advisor for Hillary Clinton in propagated a bogus story about Trump's secret line to Russia.",
    "And my new book that you just talked about, \"Here is the Deal\", has brand new details about January 5th and January 6, 2017.",
    "Sean, the people who are under, thankfully, the absolute lowest amount of danger in the entire country from COVID, our kids.",
    "You know, I've always in my political life and more concerned about things on Brighton Beach Avenue than Brighton, England.",
    "UNIDENTIFIED MALE: Right now, none of us will -- none of us are moving or leaving we're all here until we get what we want.",
    "A year ago, they were heroes and now all of a sudden, everybody else around the world is lifting these draconian mandates.",
    "You know, I'm trying to figure out -- you know, Jim, if you're a good guy or a bad guy, and he said, well, I'm a good guy.",
    "He sits on the January 6 committee, and they said campaign rhetoric and talk about elections has brought us to this point.",
    "(END VIDEO CLIP)\nHANNITY: Oh, Nancy is right, that Hillary Clinton's campaign was involved in a like electronic Watergate.",
    "Republicans need to demand that the AG in this case takes her off anything involving the Durham investigation immediately.",
    "Here with reaction, Outkick founder Clay Travis, along with \"Outnumbered\" co-host, best-selling author Kayleigh McEnany.",
    "Bill O'Reilly -- I can run through a whole list of people who are my colleagues at WABC who he's given a second chance.",
    "KAYLEIGH MCENANY, \"OUTNUMBERED\" CO-HOST: Yeah, and Eric Garcetti, this is the second time he has been caught maskless.",
    "Jake Sullivan, he needs to now answer questions about his role in the Clinton campaign's illicit activities as of now.",
    "Well, we're starting to see the allegations that it was literally everybody, Clinton operatives, putting it together.",
    "But, you know, I'm of the belief that the way you demonstrate that you've changed is for other people to perceive it.",
    "(BEGIN VIDEO CLIP)\nREP. NANCY PELOSI (D-CA): In terms of the presidential campaign, this is an electronic Watergate.",
    "As a matter of fact, the entire Trump Tower, the entire White House as a candidate and by the way now as president.",
    "This is the weaponization of politics in this country in its third world and it has to stop and it has to stop now.",
    "This is something maybe we would expect from Russia, China, Iran, North Korea, not an American political campaign.",
    "Now, of course, business is conducted a little differently in 1972 versus, you know, 2016 when this all went down.",
    "First, it appears to be the biggest election and presidential spying scandal in the history of this great country.",
    "They have their cellos, their violins and their masks on, a symbol of a generation that's been forced to mask up.",
    "WEINER: I know, but you invited -- you invited -- I know you invited me to come on then you say, did you change?",
    "HANNITY: If the Trump campaign did this to Hillary, that's all anybody in the mob in the media would talk about.",
    "He is proving the case that what the Democrats accused Republicans of is a good forecast of what they're doing.",
    "If parents want to put their kids and masks, they can do it but they shouldn't be forced to have to wear masks.",
    "He's using this crisis as a pretext for going after the banking information of all of his political opponents.",
    "She would need to recuse herself he would need to recuse her immediately she should have done this on day one.",
    "LEVANT: I don't think that any Canadian police would actually assault a trucker, shoot a trucker, God forbid.",
    "There was some honking in Ottawa, so there's a court order against using your air horns in residential areas.",
    "But nobody has had really much of an insight if any insight into the investigation that he's been conducting.",
    "(BEGIN VIDEO CLIP)\nDONALD TRUM, FORMER PRESIDENT: So the biggest scandal was when they spied on my campaign.",
    "I believe in -- I'm not the guy that calls for canceling --\nWEINER: But it's not something --\nHANNITY: What?",
    "They spied on my campaign they got caught no and then they went much further than that and they got caught.",
    "Their end goal, fabricate evidence that President Trump was a Russian asset or Russian stooge of some kind.",
    "In the age of the Internet, you don't need to break into a building to steal your opponent's information.",
    "What they did is absolutely atrocious and by the way, Hillary almost by default created another Cold War.",
    "Remember, January 6 is the day that the intelligence officers, Clapper, Brennan, Comey go to Trump Tower.",
    "HANNITY: I got to tell you, I never thought I'd see it in Canada but I see that the truckers are winning.",
    "You heard the deputy prime minister who by the way happens to be a governor of the World Economic Forum.",
    "We've known each other for 25 years and I've never seen anything this bad in my entire life politically.",
    "And thankfully Durham doesn't take orders from Schiff or fake news CNN, or anyone else in the media mob.",
    "They advance their propaganda almost hours a day seven days a week and they did it for over three years.",
    "In other words, illegally spying on a presidential candidate and later a president of the United States.",
    "And, by the way, to do that the top of a FISA warrant says verified, we now know it's totally debunked.",
    "Hillary Rodham Clinton is a New York resident, let me just kind of, you know, break that down for you.",
    "We had tremendous faith in our candidate to get the job done, to go out there and connect with people.",
    "He's unwilling to do it and now he's going to you know put the heavy-handed government down on them.",
    "There's been a state of emergency, you name it, and it really hasn't had much of an impact out here.",
    "You think after being caught one time, he would change it but no, I guess he was holding his breath.",
    "Either you know when your heart if you've changed or you know when your heart if you didn't change.",
    "You know, we've had John Durham out there and I know a lot of people have said where's John Durham?",
    "These associates, they broke into DNC headquarters at Washington, D.C.'s Watergate office building.",
    "Because Adam Schiff on that January committee is the biggest purveyor of election fraud lies ever.",
    "I would've expected a little bit more sincerity, a little more heartfelt, a little more repentant.",
    "In other words, you have to connect with somebody on a visceral level because they can't see you.",
    "They were warned by Bruce Ohr in August of 2016 not to use that document, that it's unverifiable.",
    "I was there for all of it, both on the campaign and Trump Tower and certainly in the White House.",
    "It is far worse than what we have known until now and we've reported on this now for three years.",
    "Now we know that Hillary Clinton and her campaign was spying on Donald Trump's Internet activity.",
    "The FISA warrants against the Trump campaign associate Carter Page, guess what, they did it all.",
    "And you will see that, Lesley, and you know that but you just don't want to put it on your lead.",
    "When we come back, our friend Curtis Sliwa and former Congressman Anthony Weiner joining forces.",
    "(CROSSTALK)\nHANNITY: But, Curtis, you say it's stuff -- and we've been friends for a long time.",
    "Trudeau is claiming they're dangerous, claiming their terrorists so he can seize bank accounts.",
    "The Watergate scandal involved associates that will link to the 1972 Nixon reelection campaign.",
    "Is spying on a president and presidential candidates, is it okay with everybody in Washington?",
    "And all of us at this point especially children should be able to choose not to be masked too.",
    "Everybody is capable of it whether you forced everybody to get a vaccine and a booster or not.",
    "I would think that if it was me, I would want to convince people that I'm a different person.",
    "He was charged with altering an email that led to the Lisa Page, you know, FISA warrant mess.",
    "If it was -- if the -- if Hunter's last name was Trump, that's all anybody would talk about.",
    "Now, those people have yet to be held accountable, Eric, and we've now known this for years.",
    "And by the way, at what point is it acceptable to break into the servers at the White House.",
    "This is illegal, all in an effort to stomp out peaceful protests are taking place in Ottawa.",
    "That's a big problem for this country moving forward, if we have a two-tier justice system.",
    "And, then, of course, Sussman and the other guy, Danchenko, they've been charged with lies.",
    "Let me refresh many people's memories maybe you don't have a reference point of Watergate.",
    "According to Andrew McCabe, if there's no dossier, there would be no FISA warrant granted.",
    "You listen to talk radio and then you give me your opinion because we have two full hours.",
    "When Jim Jordan and myself said that they were spying on his campaign, we were ridiculed.",
    "And what you see now with what Durham is doing, is the facts that Mueller couldn't find.",
    "It really is the biggest scandal and by the way, Lesley Stahl owes my father an apology.",
    "You just need access to their server, and that is exactly what the Clinton campaign did.",
    "I like it because it gives me a slight bit of anonymity that I have lost over the years.",
    "WEINER: And I'm having a conversation with Curtis with me sitting here about my answer.",
    "ANTHONY WEINER, CO-HOST OF \"THE LEFT VS THE RIGHT\" ON 77 WABC RADIO: Well, I think so.",
    "\"The New York Times\", \"The Washington Post\", oh, they got Pulitzers for false stories.",
    "They gave more time to this than any other story, three years of the Trump presidency.",
    "Is she just going to ignore this because Hillary happens to be in her political party?",
    "Paul, in your book, you will describe that you're pretty much given a wink and a nod.",
    "They weren't invoked when there was a terrorist attack on Canada's parliament itself.",
    "But I'm not terribly interested in trying to make them feel any differently about me.",
    "I mean, I -- I'm doing a radio show and people can call in and then ask me questions.",
    "And then when she failed to win in 2016, they were still trying to get her in there.",
    "None of it was true, it was all unverifiable when they found out it was unverified.",
    "Now who the Russians broke in, who did they give the information to, I don't know.",
    "MANAFORT: -- the special counsel shouldn't have been appointed in the first place.",
    "He's going after his political opponents to seize their resources Venezuela-style.",
    "Over 100 million people watched the Super Bowl and they saw no one wearing a mask.",
    "And then millions of school kids this morning had to put masks on to go to school.",
    "She is under significant danger compared to young children who are not in danger.",
    "He's going to go in financially using laws that were built for actual terrorists.",
    "EZRA LEVANT, REBEL NEWS FOUNDER: Well, I think that Trudeau sees an opportunity.",
    "HANNITY: You know, Kellyanne, we've been through a few political wars together.",
    "In other words, what did he know, what did Hillary know, when did they know it?",
    "HANNITY: -- time will prove me right or wrong if I am being heartfelt with you.",
    "I don't think you go through that type of experience and don't emerge changed.",
    "Why won't -- why won't Trudeau budge even a little bit and talk to these guys?",
    "Here with more on the ground in Ottawa, FOX News correspondent Alexis McAdams.",
    "That was the basis by which Mueller was appointed, and Mueller found nothing.",
    "HANNITY: Eric, it's simple --\nE. TRUMP: It would be capital punishment, Sean.",
    "Perhaps you should help doing the prep for the HANNITY show for your guests.",
    "Could you imagine my father broke into servers in the Obama administration?",
    "HANNITY: If we don't get this fix --\nE. TRUMP: Where is this equal justice?",
    "What she did to this country was atrocious and somebody has to pay for it.",
    "You know, this is \"60 Minutes\" and we can't put on things we can't verify.",
    "Democracy and became a dictatorship, regulating everyone's cryptocurrency.",
    "HANNITY: The word from -- the word from Latin means to change one's heart.",
    "Yet we are making them the last people to be able to take their masks off.",
    "And I'm telling you, Sean, I know he would have done a much better job.",
    "And I'll get deep into the mindset of Anthony Weiner as he is now (ph).",
    "The FBI then used that material as the basis for the Russia witch hunt.",
    "He spent 18 months in confinement for sexting with a 15-year-old girl.",
    "Stacey Abrams last week, you saw the pictures, she is in obese adult.",
    "If you're Ellen DeGeneres, you're Eric Garcetti, don't wear the mask.",
    "Kids in L.A. went to school today fully masked up as a matter of law.",
    "I mean, it's fine and I'm glad to be here and I'm grateful to Curtis.",
    "And by the way, the truckers -- they say they are not going anywhere.",
    "(END VIDEO CLIP)\nHANNITY: Broadening the terrorist financing rules?",
    "By the way, these emergencies acts weren't even invoked after 9/11.",
    "Here with more reaction, Rebel News founder Ezra Levant is with us.",
    "Isn't that a federal -- isn't that a -- you know, isn't that fraud?",
    "The rest of it is frankly parking offenses, they're minor matters.",
    "One of the co-hosts is former New York Congressman Anthony Weiner.",
    "So now you can go on \"60 Minutes\" on Sunday and issue an apology.",
    "ERIC TRUMP, TRUMP ORGANIZATION: Sean, it is the biggest scandal.",
    "But I do know that this is a Watergate-like electronic break-in.",
    "HANNITY: So I'm going to be wearing my mask a couple more years.",
    "One of the things about talk radio, is it's a heart (ph) medium.",
    "Please let them know most of America stands with them as well.",
    "I'm not out to persuade you or anyone else that I've changed.",
    "Content and Programming Copyright 2022 Fox News Network, LLC.",
    "And I think that we have to recognize what is happening here.",
    "In other words, President Trump, he was right the whole time.",
    "And, by the way, what about the congenital liar Adam Schiff?",
    "This is a rush transcript from \"Hannity,\" February 14, 2022.",
    "Curtis, are you happy with -- how's the audience responding?",
    "(CROSSTALK)\nHANNITY: Well, that's -- Anthony, wait a minute.",
    "That I'm moving forward in a different direction in my life.",
    "They still continue to use Hillary's dirty Russian dossier.",
    "And you know what --\nHANNITY: We'll lose the country, Eric.",
    "Protesters in Ottawa tell me they are just getting started.",
    "They cleared the bridge between Detroit and Windsor, fine.",
    "This copy may not be in its final form and may be updated.",
    "And let's face it: we need to give people a second chance.",
    "I believe this kind of experience would change any person.",
    "TRAVIS: You could rob a bank if you needed to, too, Sean.",
    "He's joining now our friend Curtis Sliwa with a new show.",
    "The guys that help keep Canada alive during the pandemic.",
    "Here with more from the Trump Organization is Eric Trump.",
    "LESLEY STAHL, CBS NEWS: There's no real evidence of that.",
    "TRUMP: OK.\n(END VIDEO CLIP)\nHANNITY: Lesley, now you do.",
    "You're not going to see real cops get violent over that.",
    "You will tell -- you will tell that story in your book?",
    "TUCKER CARLSON, FOX NEWS HOST: Will our leaders notice?",
    "Mitch McConnell, by the way, where are you in all this?",
    "This -- we're going to talk about New York City issues.",
    "But make no mistake, this is far worse than Watergate.",
    "HANNITY: Yeah, maybe they'll have a committee on this.",
    "Lesley, they spied on my campaign and they got caught.",
    "TRUMP: You don't put it on because it's bad for Biden.",
    "But this is the biggest scandal, spying scandal ever.",
    "So, they were spying on every which way and sideways.",
    "You know, Sean, every single day, they come after us.",
    "E. TRUMP: But look at the slanderous statement, Sean.",
    "Having a mask, a hat, dark glasses, I do pretty good.",
    "And later, Anthony Weiner, Curtis Lee would team up.",
    "I'm just giving you the answer as best I can, buddy.",
    "TRUMP: Of course, there is, it's all over the place.",
    "TRUMP: It's been -- just go down and get the papers.",
    "They spent three years lying to the American people.",
    "Well, it appears it might be severe, straight ahead.",
    "They have to make the candidate something she's not.",
    "You've covered it, we've talked about it for years.",
    "We don't have -- we have nothing to do with Russia.",
    "He's got the evidence that Mueller couldn't get to.",
    "But here's where this is even worse than Watergate.",
    "You know, I would think going to jail is different.",
    "STAHL: No, as a matter of fact, I don't know that.",
    "This makes Watergate look like kindergarten to me.",
    "Wow, talk about authoritative -- authoritarianism.",
    "You see for yourself, it's a festival environment.",
    "But he's deeming these truckers to be terrorists.",
    "ALEXIS MCADAMS, FOX NEWS CORRESPONDENT: Hi, Sean.",
    "Number two, guess what I learned today yet again?",
    "Look at the things they said my father was doing.",
    "And by the way, the same goes for fake news CNN.",
    "\"The Washington Post\" owes my father an apology.",
    "There is no revolution in the streets of Canada.",
    "Welcome to a busy news night tonight on HANNITY.",
    "Did he hold his breath for the whole Super Bowl?",
    "They are co- hosts, \"The Left Versus The Right\".",
    "Curtis Sliwa, always good to see you, my friend.",
    "In the meantime, let not your heart be troubled.",
    "Laura Ingraham, freedom matters, takes it away.",
    "That is all the time we have left this evening.",
    "HANNITY: OK.\nAnd, Curtis, you're working a lot.",
    "\"The New York Times\" owes my father an apology.",
    "And, Sean, where are the prosecutors right now?",
    "STAHL: We can't put on things we can't verify.",
    "He looks -- he doesn't seem that bright to me.",
    "He's going to get China's social credit style.",
    "What will he do to the heroes of the pandemic?",
    "Kellyanne, we're looking forward to your book.",
    "It's a travesty that we continue to make them.",
    "HANNITY: I actually like my mask, to be blunt.",
    "So it's now about freedom of choice, isn't it?",
    "Curtis, we've been friends a long time friend.",
    "I would like to know how he did it, Kayleigh.",
    "My daughter, one of her first words was mask.",
    "All I can do is give you the answer about it.",
    "WEINER: I said they can judge for themselves.",
    "I mean --\nHANNITY: We're closing the country.",
    "In the meantime, Sean Hannity takes over now.",
    "We're looking forward to both of your books.",
    "I mean, Canadian police see what's going on.",
    "CLAY TRAVIS, OUTKICK FOUNDER: I think it is.",
    "Clay, Travis, Kaylee McEnany, they weigh in.",
    "Anthony Weiner, thank you for being with us.",
    "Anthony, I hope you've changed and Godspeed.",
    "If he's not on the air, he's in the subways.",
    "HANNITY: I need to get my name on the list.",
    "How did you feel about the answers you got?",
    "WEINER: I don't know what else to tell you.",
    "And I appreciate you having me on the show.",
    "Look at these statements that they made up.",
    "We'll be back tomorrow and every weeknight.",
    "Or just, of course, it's now dictatorship.",
    "There is breaking news all over the world.",
    "Where's Letitia James in this whole thing?",
    "He's going to be critical of Donald Trump?",
    "As always, we thank you for being with us.",
    "SLIWA: Anthony would have been the mayor.",
    "That I changed, that I learned my lesson.",
    "I look a lot better with my face covered.",
    "I just want to just go through this here.",
    "TRUMP: Lesley, they spied on my campaign.",
    "It's located on Fifth Avenue in New York.",
    "Also tonight, Anthony Weiner out of jail.",
    "That's Hillary Clinton and her campaign.",
    "The Clinton people have no faith in her.",
    "There's no confidence in her competence.",
    "And guess where Trump Tower is located?",
    "SEAN HANNITY, FOX NEWS HOST: All right.",
    "We told you that story a million times.",
    "It doesn't sound that convincing to me.",
    "And I'm listening to Anthony's answer.",
    "WEINER: They can judge for themselves.",
    "WEINER: Well, you know, perhaps, Sean.",
    "(COMMERCIAL BREAK)\nHANNITY: All right.",
    "So let's go through this step by step.",
    "But, Sean, this is awful, awful stuff.",
    "I can remember I had asked Jim Baker.",
    "Trudeau is not going to get violent.",
    "This is even worse than all of that.",
    "WEINER: I know, and I appreciate it.",
    "Because if he did, that's a miracle.",
    "We'll tell you why, straight ahead.",
    "Will anybody say anything about it?",
    "He's not going to go in with fists.",
    "It was bar talk, none of it's true.",
    "We need an investigation into him.",
    "Where's Bernstein, Carl Bernstein?",
    "TRUMP: It's been totally verified.",
    "I doubt they even cover the story.",
    "It's happy moms and dads and kids.",
    "HANNITY: I look better on it, too.",
    "HANNITY: Well, that's your answer.",
    "Anthony, that's an obscure answer.",
    "HANNITY: He did destroy the city.",
    "They join us next straight ahead.",
    "This is what we did our children.",
    "But check it out behind me, Sean.",
    "There's crickets everywhere else.",
    "She lives in Chappaqua, New York.",
    "Isn't that all sorts of offenses?",
    "Karma is slow but it will happen.",
    "We appreciate you being with us.",
    "STAHL: No, we can't verify that.",
    "Alexis, what's going on tonight?",
    "This is an electronic Watergate.",
    "They were supposed to be masked.",
    "He reveals much of his feelings.",
    "Please remember to set your DVR.",
    "Yes, and I answer the question.",
    "He will join us straight ahead.",
    "They have lied the entire time.",
    "Maggie, it's time to return it.",
    "E. TRUMP: Karma is slow, Sean.",
    "We've been friendly with them.",
    "So what is Justin going to do?",
    "They stole campaign documents.",
    "They attempted to bug phones.",
    "Is that -- is that your plan?",
    "Hope you have the best night.",
    "They have to perfume the pig.",
    "It's over, but I got to roll.",
    "And now, it's all backfiring.",
    "So you never miss an episode.",
    "I have 10 seconds literally.",
    "This is the help that I got.",
    "I feel he's on solid ground.",
    "They chose not to be masked.",
    "But hey, you're a celebrity.",
    "You went -- you pled guilty.",
    "Where are these prosecutors?",
    "Where are those prosecutors?",
    "He's going to get financial.",
    "Who dumped it, I don't know.",
    "And, Tucker, and thank you.",
    "We stand with the truckers.",
    "Ezra, so we're serious now.",
    "That's how important it is.",
    "STAHL: Can I say something?",
    "Are you a different person?",
    "Rules for thee, not for me.",
    "He's a good talk show host.",
    "Curtis never stops working.",
    "And this is what I learned.",
    "You make the show possible.",
    "We can't thank you enough.",
    "He and I have a good show.",
    "They spied on my campaign.",
    "We'll be waiting for that.",
    "Because you're a Democrat?",
    "Don't take my word for it.",
    "Will anyone say anything?",
    "Alexis McAdam, thank you.",
    "They have to cut corners.",
    "I promise you that, Sean.",
    "So, it's fairly obvious.",
    "CONWAY: It's really bad.",
    "They have been peaceful.",
    "Will our leaders notice?",
    "But, boy, you're right.",
    "Is Trudeau that stupid?",
    "I have no fears at all.",
    "And that's all this is.",
    "I said I believe I did.",
    "This might remind you.",
    "Where's Bob Woodward?",
    "Kellyanne, thank you.",
    "End the mask mandate.",
    "You served jail time.",
    "MCENANY: That's true.",
    "HANNITY: I'll listen.",
    "And, listen in, Sean.",
    "He just never stops.",
    "ALL RIGHTS RESERVED.",
    "I agree with Curtis.",
    "He believes in that.",
    "There's no violence.",
    "That's what you see.",
    "This is a break- in.",
    "This is a break-in.",
    "We have no servers.",
    "HANNITY: All right.",
    "HANNITY: All right.",
    "They have to cheat.",
    "HANNITY: I'm sorry?",
    "HANNITY: All right.",
    "HANNITY: All right.",
    "HANNITY: All right.",
    "This is a failure.",
    "That's number one.",
    "Yet he kept going.",
    "Where is the D.A.?",
    "We'll be watching.",
    "TRUMP: All right.",
    "They have to lie.",
    "MCENANY: Exactly.",
    "Have you changed?",
    "LEVANT: Right on.",
    "It's nonsensical.",
    "Have you changed?",
    "SLIWA: Oh, great.",
    "Mark, thank you.",
    "Paul, thank you.",
    "It's outrageous.",
    "It's outrageous.",
    "E. TRUMP: Sure.",
    "MANAFORT: Yeah.",
    "We'll continue.",
    "Thank you both.",
    "End at all now.",
    "HANNITY: Yeah.",
    "You know what?",
    "Is that true?",
    "Stay with us.",
    "\"I think so\".",
    "Take a look.",
    "Take a look.",
    "All right.",
    "STAHL: No.",
    "Thank you.",
    "Thank you.",
    "How sad.",
    "We are.",
    "Listen.",
    "Why?",
    "No."
  ]
}