{
  "id": 9000,
  "mediaId": 2562,
  "date": "2022-03-31",
  "headline": "House Republicans Probing Big Tech ‘Suppression’ of Hunter Biden Laptop Story",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/03/getfile.aspxguid82FBEC88-4798-4353-ADBF-AB238B99F25E.jpg",
  "link": "https://donaldjtrumppolls.com/house-republicans-probing-big-tech-suppression-of-hunter-biden-laptop-story/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    0
  ],
  "sentences": [
    "The New York Post noted in a Wednesday report that in October 2020, it \"exclusively revealed the existence of Hunter Biden's email after being given a copy of the hard drive from a damaged MacBook Pro laptop that the owner of a repair shop in the Biden family's hometown of Wilmington, Delaware, said was dropped off in April 2019 and never retrieved.\"",
    "House Republicans Probing Big Tech 'Suppression' of Hunter Biden Laptop Story (Kirill Kudryavtsev/AFP via Getty)\nBy Jeffrey Rodack | Thursday, 31 March 2022 01:09 PM\nHouse Republicans have launched an investigation into Twitter and Facebook after new reports surfaced about Hunter Biden’s laptop.",
    "\"Now, with even The New York Times confirming the accuracy of the Post’s reporting, we are investigating Facebook’s actions to interfere in free and fair election-related public discourse on its platform to the benefit of President Biden and the determinant of former President [Donald] Trump.\"",
    "The letter to Zuckerberg said: \"Shortly before the 2020 election, Facebook suppressed an explosive New York Post article detailing how Hunter Biden used the position and influence of his father, now-President [Joe] Biden, for personal gain, with the apparent awareness of President Biden.",
    "\"It appears that Twitter knowingly and deliberately used its platform to control election-related information accessible to the American people shortly before the 2020 election, and that Twitter did so to the primary benefit of then Vice President Biden.",
    "\"This irresponsible conduct demands a through investigation so that we may understand how Big Tech wields it enormous power over the free-flow of information to the determent of free and fair elections.\"",
    "In letters posted on Twitter, ten Republicans, led by Rep. Jim Jordan, the ranking member of the House Judiciary Committee, wrote to Facebook CEO Mark Zuckerberg and Parag Agrawal, the Twitter CEO.",
    "The Republicans claim that soon after the Post article was published Facebook’s policy communications director announced that Facebook was \"reducing its distribution in our platform.\"",
    "The Republicans want Facebook to turn over all documents and communications relating to Facebook’s decision to reduce the dissemination of the Post article on its platform.",
    "It also asked Twitter for all documents and communications relating to Twitter’s decision to \"reduce the dissemination of the New York Post article on its platform.",
    "\"Although the Post article concerned a topic of important to man[y voters in the run-up to the election, Twitter still censored it,\" the Republicans said.",
    "The letter says Facebook censored the Post article even though it \"concerned a topic of importance to many voters in the run-up to the election.\"",
    "\"It appears Facebook knowingly and deliberate used its platform to control election-related information accessible to the American people.",
    "The letters came as The Washington Post confirmed that its experts have been able to verify certain emails from Hunter Biden’s laptop.",
    "\"We wrote to Facebook at the time with important questions about Facebook’s knowing suppression of First Amendment protected activity.",
    "A portion of the verified emails focused on a deal Hunter Biden developed with the Chinese energy conglomerate CEFC China Energy.",
    "The Post also said the data included some verified emails from Hunter Biden's work with the Ukrainian energy company Burisma.",
    "\"It detailed how Hunter Biden leveraged his father’s influence as then-vice president for personal gain,\" the letter said.",
    "In a similar letter to Twitter, the committee’s Republicans claimed the platform also \"suppressed\" the Post article.",
    "Facebook ignored our letter and, in the months since, has avoided any meaningful accountability for its actions.",
    "They maintained the Post article \"was likely to have significant implications for the presidential election.\"",
    "They claim the unnamed director is a former staffer for Democrat elected officials.",
    "Both letters cited a 2020 article in the New York Post about the Biden laptop.",
    "The letter claimed it did so for the primary benefit of Biden.",
    "\"Big Tech is out to get conservatives.\"",
    "Original Article"
  ]
}