{
  "id": 9019,
  "mediaId": 2540,
  "date": "2022-03-24",
  "headline": "Rep. Mo Brooks says Trump repeatedly asks him to 'rescind' the 2020 election",
  "image": "https://media.cnn.com/api/v1/images/stellar/prod/220323165448-01-mo-brooks-0323.jpg?c=16x9&q=w_800,c_fill",
  "link": "https://www.cnn.com/2022/03/24/politics/mo-brooks-donald-trump-january-6-election/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Nobles, Annie Grayer and Alex Rogers",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The revelation from Brooks could put new focus on the work of the House Select Committee investigating January 6 to encourage cooperation from a collection of Republican lawmakers whom the committee believes played a role in either attempting overturn the election or encouraging the chaos on that day.",
    "While Trump's direct pressure on lawmakers and government officials at both the state and federal level to intervene in the election have been well documented, he largely gave up his public and legal push to overturn the results after the violence on January 6.",
    "(CNN)Rep. Mo Brooks of Alabama repeated his claim Thursday that former President Donald Trump has personally asked him to work to rescind the 2020 election, remove Joe Biden from office and install Trump in his place.",
    "Trump never directly conceded the election, though he did give a short speech the day after the riot acknowledging that a new administration would be inaugurated and promising a smooth and orderly transition.",
    "Brooks, who lost the endorsement of the former President in his race for the US Senate in Alabama said that despite Trump's pleas he has made it clear to him that his request was impossible.",
    "So far, the committee has asked for voluntarily cooperation from Reps. Jim Jordan of Ohio and Scott Perry of Pennsylvania, as well as House Minority Leader Kevin McCarthy.",
    "As CNN previously reported, Brooks was on a list of GOP members who the committee requested telecommunications companies to preserve the phone and data records of.",
    "In a text exchange with CNN, Brooks said that his conversations with Trump about pushing to rescind the election results came \"After 9/1/2021 and multiple times.\"",
    "But according to Brooks, Trump was still working behind the scenes in attempt to convince lawmakers like him to prevent Biden from taking office.",
    "A committee spokesperson declined to comment when asked if the committee would be interested in talking to Brooks based on his new comments.",
    "The Alabama Republican first made the claim in a statement responding to Trump's decision to pull his endorsement in the Senate race.",
    "He was among the first Republicans to pledge to work to use the certification of the election on January 6 to overturn the results.",
    "\"I knew that when I gave him straight shooting legal advice that it would perturb him because it's not what he wanted to hear.",
    "The committee has not formally asked Brooks to appear before the committee, but they have shown interest in his role.",
    "When asked if he would cooperate with the January 6 committee, Brooks responded, \"Have given it no thought. \"",
    "Donned in a Kevlar vest, Brooks told the crowd that they needed to \"start taking down names and kicking ass.\"",
    "He also spoke during the \"Stop the Steal\" rally at the White House ellipse that preceded the Capitol attack.",
    "And I knew it would put my endorsement at risk, but I thought it was the honorable thing to do.",
    "\"The President has asked me to rescind the election of 2020,\" Brooks told WIAT.",
    "Brooks was once one of Trump's most loyal supporters on Capitol Hill.",
    "It is a claim that up until this point has not been made.",
    "\"He always brings up, 'we've got to rescind the election.",
    "We got to take Joe Biden down and put me in now'.\"",
    "CNN's Melanie Zanona contributed to this report.",
    "All three men have turned the committee down.",
    "So I did it,\" Brooks said."
  ]
}