{
  "id": 9126,
  "mediaId": 2512,
  "date": "2022-03-23",
  "headline": "‘Morally bankrupt’ AIPAC slammed for endorsing GOP seditionists who refused to accept 2020 election results",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29584431&width=1200&coordinates=0%2C106%2C0%2C107&height=600",
  "link": "https://www.alternet.org/2022/03/aipac-slammed-morally-bankrupt-endorsement/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.alternet.org/author/alex-henderson",
  "termIds": [
    5487,
    2693,
    2119,
    662,
    660,
    348,
    57,
    1126,
    6253
  ],
  "sentences": [
    "Perry has also publicly promoted racist ‘White replacement’ conspiracy theories.”\nCritics of AIPAC’s willingness to endorse Jordan and other members of the “Sedition Caucus” are arguing that AIPAC is promoting democracy for Israel but not for the United States, and AIPAC is defending its move by saying that this is “no moment for the pro-Israel movement to become selective about its friends.”\nHaass has slammed AIPAC’s willingness to endorse insurrectionists as “morally bankrupt.”\nOn March 6, the Council on Foreign Relations president — a frequent guest on MSNBC’s “Morning Joe” — tweeted, “Sorry @AIPAC, but it is morally bankrupt & shortsighted to back pols who undermine democracy just b/c they support Israel.",
    "Whatever their views on Israel, elected officials who threaten the very future of our country should be completely beyond the pale.”\nAbe Foxman, former head of the Anti-Defamation League (ADL), slammed AIPAC’s endorsement of insurrectionists as a “sad mistake” and urged AIPAC to “do the right thing for America.”\nJ Street has published a list of the “AIPAC PAC-endorsed candidates who voted against certification of the 2020 election results on January 6th.” In addition to Jordan, the list ranges from Rep. Ronny Jackson of Texas, Rep. Elise Stefanik of New York State and Rep. Steve Scalise of Louisiana to House Minority Leader Kevin McCarthy.",
    "An undemocratic America could easily distance itself from the Jewish state.https://bit.ly/35u26UP\n— Richard N. Haass (@Richard N. Haass) 1646591890\nSimilarly, the pro-Israel lobbying group J Street argued, “AIPAC’s support for these candidates endangers American democracy and undermines the true interests and values of millions of American Jews and pro-Israel Americans who they often claim to represent.",
    "“Earlier this month, the Committee released a list of 120 political endorsements that includes 37 Republicans who voted against certifying (President Joe) Biden’s victory after the January 6 storming of the Capitol.”\nMcGreal adds, “Among them are two members of Congress, Jim Jordan and Scott Perry, who plotted with Trump’s White House to overturn the election result.",
    "Now, AIPAC is drawing vehement criticism from Richard Haass, president of the Council on Foreign Relations, and other Israel supporters for endorsing far-right GOP extremists who refused to accept the results of the United States’ 2020 presidential election.",
    "“In December, AIPAC launched a political action committee that enables it for the first time to spend money directly supporting congressional candidates in this year’s midterm elections,” the Guardian’s Chris McGreal reports.",
    "An undemocratic America could easily distance itself from the Jewish state.”\nSorry @AIPAC, but it is morally bankrupt & shortsighted to back pols who undermine democracy just b/c they support Israel.",
    "Although the American Israel Public Affairs Committee (AIPAC) has been around since the early 1960s, it didn’t have its own political action committee until late 2021.",
    "Many Twitter users are arguing that if AIPAC supports democracy in Israel, it needs to support it in the United States as well — without exception.",
    "— Natalie Goldfein (@Natalie Goldfein) 1646620088\nThe entire reasoning for US support of Israel (in the multi billions) is its democratic values.",
    "— Natalie Goldfein (@Natalie Goldfein) 1646620088\nI agree wholeheartedly about this Richard.",
    "Here are some of their tweets:\nI agree wholeheartedly about this Richard.",
    "What ties the 2 countries is a commitment to democracy.",
    "What ties the 2 countries is a commitment to democracy.",
    "Politicians who are undermining democracy.",
    "Politicians who are undermining democracy.",
    "There's no room for endorsing U.S.",
    "There's no room for endorsing U.S.",
    "— Florence (@Florence) 1646592113",
    "So where are they?",
    "None.",
    "None."
  ]
}