{
  "id": 9201,
  "mediaId": 2745,
  "date": "2022-03-29",
  "headline": "Democrats ask Justice Thomas to recuse himself from Jan. 6 cases",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5CPF4K2VBRBA7HAEDUT7X6ZL2A.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/03/29/democrats-ask-justice-thomas-recuse-himself-jan-6-cases/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "She was there in part to fill in for Jen O’Malley Dillon, a White House deputy chief of staff who was on personal leave during a pivotal stretch in Biden’s presidency.”\nDunn’s previously unreported second White House stint, along with a party she threw for Biden campaign alumni earlier this month, underscore how Dunn and her firm, SKDK, have straddled “the line between the private sector and the administration to quietly staff the government, steer the presidency and remake the Democratic Party in Biden’s image.”\nAt least 19 people who have served in the Biden administration or worked on Biden’s campaign or transition team have worked at SKDK or work there now, per Tyler, Sean and Michael.",
    "And it seeks to bolster military investments and levy a new tax on the wealthiest Americans — ideas party strategists hope will appeal to centrist and working-class voters in battleground areas.”\n“Taken together, the proposed outlays reflect Biden’s recent turn toward a more moderate, populist profile ahead of the midterm elections after spending his first year in office pursuing a more ambitious, left-leaning domestic agenda that amplified intraparty disagreements and left many Americans confused about what Democrats stand for,” strategists told our colleagues.",
    "In the letter, the lawmakers argue that “given the recent disclosures about Ms. Thomas’s efforts to overturn the election and her specific communications with White House officials about doing so, Justice Thomas’s participation in cases involving the 2020 election and the January 6th attack is exceedingly difficult to reconcile with federal ethics requirements,” according to a copy of the letter provided to The Post.",
    "The lawmakers also called on Chief Justice John G. Roberts Jr. to commit by April 28 to creating “a binding Code of Conduct for the Supreme Court — the only court in the country not currently subject to a judicial code of ethics — that includes (1) enforceable provisions to ensure that the Justices comply with this Code and (2) a requirement that all Justices issue written recusal decision,” according to the letter.",
    "Exclusive: More Virginia Thomas backlash\nA group of House and Senate Democrats sent a letter to the Supreme Court on Monday requesting that Justice Clarence Thomas recuse himself from any future cases involving the Jan. 6, 2021, attack on the Capitol or efforts to overturn the 2020 election, along with a \"written explanation for his failure to recuse himself” in previous cases on those subjects, Jackie reports.",
    "“But I think it's clear from what we saw tonight — and the decision we saw from [U.S. District Judge David Carter] that what the committee is looking at investigating is fundamental to the survival of the institutions of our democracy — so we'll continue to move aggressively on all fronts.”\nAs for Virginia Thomas, the committee held a meeting after the hearing to discuss how to handle seeking her cooperation.",
    "“It’s not just about the votes, it’s about the 30-second ads that are generated from those votes in September and October: ‘Republicans voted against tax cuts for the middle class so they could keep tax cuts for the rich’ and ‘Republicans voted against funding the police,’” former congressman Steve Israel of New York, who used to lead the Democratic Congressional Campaign Committee, told our colleagues.",
    "“Dunn’s personal Gmail is also occasionally cc’d on emails that only include other senior White House officials, according to a recent email viewed by West Wing Playbook and other White House officials who have observed the practice.”\n“In a video the White House released about Biden preparing for the State of the Union, Dunn was featured as one of the senior advisers helping the president.\"",
    "Without enforcement of its lawful process, Congress ceases to be a co-equal branch of government.”\n“I think there is, generally, we feel that we want to take some steps there and we want the DOJ to take this seriously and we feel that they are but clearly there are still some questions that remain and some pieces that they can act on,” said Rep. Peter Aguilar (D-Calif.).",
    "ICYMI: Anita Dunn, the longtime Democratic operative who spent much of last year as a top aide to Biden before returning to her consulting firm, went back to the White House earlier this month for “a second, one-week assignment at the personal request of Biden himself,” our colleagues Tyler Pager, Sean Sullivan and Michael Scherer report.",
    "Biden’s emerging midterm strategy, visualized: “President Biden released a budget proposal Monday that doubled as a midterm blueprint for deflecting Republican attacks portraying Democrats as a soft-on-crime, free-spending party ahead of the November elections,” our colleagues Cleve R. Wootson Jr. and Annie Linskey report.",
    "Meanwhile, his Russian counterpart, Sergei Lavrov, said Moscow should ‘stop indulging’ Kyiv, underscoring the gulf in expectations between the two sides.”\nVladimir Medinsky, an adviser to Russian President Vladimir Putin, sits with David Arakhamia, a close political ally of Ukrainian President Volodymyr Zelensky.",
    "and Rep. Pramila Jayapal (D-Wash.), follows The Washington Post’s reporting on repeated efforts by conservative activist Virginia “Ginni” Thomas, the Supreme Court justice’s wife, to pressure then-White House Chief of Staff Mark Meadows to pursue various avenues to overturn the 2020 election.",
    "“The plan calls for more than $30 billion to fight crime as Republicans are seizing on left-wing demands to ‘defund the police.’ It aims to reduce the deficit by about $1 trillion over a decade, as Republicans seek to brand them as reckless spenders and blame them for rising prices.",
    "In today’s edition: President Biden’s budget as midterm messaging document … Anita Dunn, SKDK and Washington’s revolving door … Kyiv and Moscow will meet in Istanbul for peace talks but have different goals… but first, the latest from the House committee investigating Jan. 6.",
    "As the House committee investigating the Jan. 6 attack moves to wrap up interviews and depositions with former White House officials, outside legal advisers and other witnesses, there are still a few notable names that have not cooperated with the committee's requests.",
    "Lawmakers only vaguely addressed how they plan to handle other people who have yet to cooperate with or appear before the committee, including Ivanka Trump, House Minority Leader Kevin McCarthy (R-Calif.), and Reps. Scott Perry (R-Pa.) and Jim Jordan (R-Ohio).",
    "Sheldon Whitehouse (R.I.), Mazie Hirono (Hawaii), Amy Klobuchar (Minn.), Dianne Feinstein (Calif.), Alex Padilla (Calif.), Cory Booker (N.J.), Ron Wyden (Ore.), Jeff Merkley (Ore.) and Richard Blumenthal (Conn.), along with 13 House Democrats.",
    "The committee moved to address two of these holdouts Monday night, unanimously voting to hold former White House aides Dan Scavino and Peter Navarro in criminal contempt for refusing to comply with the committee's subpoenas.",
    "Happening today: “Ukrainian and Russian delegations are set to meet in Istanbul for another round of peace talks, although the Kremlin has tempered hopes of a breakthrough,” our colleagues Rachel Pannett and Amy Cheng write.",
    "But the frustration with the DOJ was palpable on Monday evening, as lawmakers publicly called on Attorney General Merrick Garland and the department to “do your job,” as Rep. Elaine Luria (D-Va.) bluntly stated.",
    "“Without enforcement of congressional subpoenas, there is no oversight, and without oversight, no accountability for the former president, or any other president, past, present, or future.",
    "“I will echo what my colleagues have already said, but more bluntly: Attorney General Garland, do your job so that we can do ours,” Luria said during the hearing.",
    "While the Justice swiftly decided to prosecute Stephen K. Bannon, the department has yet to announce whether they will pursue the contempt referral for Meadows.",
    "A person familiar with the investigation confirmed to The Post earlier on Monday that the committee will seek an interview with Thomas.",
    "“The Department of Justice has a duty to act on this referral and others that we have sent,” said Rep. Adam Schiff (D-Calif.).",
    "“Ukrainian Foreign Minister Dmytro Kuleba told local media Monday that Kyiv’s goal is — at best — a ‘sustainable’ cease-fire.",
    "The House will soon vote on whether to refer Navarro and Scavino to the Justice Department for prosecution.",
    "The Department of Justice needs to do theirs,\" said committee member Zoe Lofgren (D-Calif.).",
    "), a vice chair of the committee, told The Early last night on her way out of the hearing.",
    "“We have a lot more to do – we have a lot of work ahead of us,\" Rep. Liz Cheney (R-Wyo.",
    "(@Podolyak_M) March 29, 2022\nWhat we're reading about the war:\nWhat we’re reading:",
    "Delegations are working in parallel on the entire spectrum of contentious issues.",
    "“She had a badge, an official White House email and an office in the West Wing.",
    "Then, the department will decide whether to pursue criminal charges.",
    "The letter, spearheaded by Sen. Elizabeth Warren (D-Mass.)",
    "On the fundamental provisions of the negotiation process.",
    "David Arakhamia and Vladimir Medinsky.",
    "pic.twitter.com/JsSZv7X9ZA\n— ???????",
    "\"This committee is doing its job.",
    "Round of heads of delegations.",
    "Good morning, Early Birds.",
    "Signatories include Sens.",
    "???????"
  ]
}