{
  "id": 9203,
  "mediaId": 2526,
  "date": "2022-03-29",
  "headline": "Jim Jordan: January 6 Investigation ‘Designed’ to Keep Trump off the 2024 Ballot — ‘I Think He’s Going to’ Run, Win",
  "image": "https://media.breitbart.com/media/2021/11/GettyImages-1236025563-640x335.jpg",
  "link": "https://www.breitbart.com/clips/2022/03/29/jim-jordan-january-6-investigation-designed-to-keep-trump-off-the-2024-ballot-i-think-hes-going-to-run-win/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Poor",
  "authorUrl": "https://www.breitbart.com/author/jeffrey-poor/",
  "termIds": [
    2119,
    2765,
    3246,
    3403,
    1126
  ],
  "sentences": [
    "They won’t let Republicans like me and my colleague Jim Banks serve on a Select Committee — first time in American history, where the Minority Leader wasn’t allowed to put on a suit Select Committee the individual’s he or she is selected.”\n“They’re trying to end the Electoral College, trying to end the filibuster, trying to pack the court, and somehow, they have the audacity to say, ‘Oh, it’s Republicans and Donald Trump, who were a threat to democracy,'” Jordan continued.",
    "Monday on FNC’s “Fox News @ Night,” Rep. Jim Jordan (R-OH) argued House Speaker Nancy Pelosi’s (D-CA) purpose for the January 6 Select Committee was not to investigate the January 6 riot on Capitol Hill but to keep former President Donald Trump out of the 2024 presidential election.",
    "And it’s interesting, the one issue they don’t want to get to the bottom of is, why wasn’t there proper security presence here that day, and only the speaker house, Speaker of the House can answer that question, and she won’t let that be covered at all by this committee.",
    "This is designed to keep President Trump off the ballot, so he can’t run again, which I think he’s going to do, and I think he’s going to win.”",
    "This is from the lady who closed the United States Capitol, so the American citizens couldn’t get into their own capital.",
    "“Well, first of all, I listen to her tweet that she talks about threats to democracy,” he said.",
    "Their tax dollars paid for to lobby their member of Congress to redress their grievances.",
    "Jordan predicted Trump would run, and he said he thought he would win.",
    "So, I think that the country understands this is political.",
    "They’ve kicked Republicans off committee.",
    "I think they see this for what it is.",
    "“I don’t think the country buys it.",
    "They’ve allowed proxy voting.",
    "“I mean, think about this.",
    "They closed the capital."
  ]
}