{
  "id": 9267,
  "mediaId": 2664,
  "date": "2022-03-29",
  "headline": "‘Woodward and I have the docs’: Robert Costa posts Jan. 6 WH call logs that could be big trouble for Trump and allies",
  "image": "https://www.rawstory.com/media-library/donald-trump-screen-grab.jpg?id=29608668&width=1200&coordinates=0%2C0%2C0%2C72&height=600",
  "link": "https://www.rawstory.com/woodward-and-i-have-the-docs-robert-costa-posts-jan-6-wh-call-logs-that-could-be-big-trouble-for-trump-and-allies/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Badash",
  "authorUrl": "https://www.rawstory.com/u/david_badash_the_new_civil_rights_movement",
  "termIds": [
    5732,
    2119,
    3639,
    4345,
    2765,
    2984,
    2988,
    3558,
    1359
  ],
  "sentences": [
    "CBS News' Robert Costa Tuesday morning announced, \"Woodward and I have the docs,\" referring to the White House call logs and Donald Trump's Presidential \"Daily Diary\" for January 6, 2021, the infamous day of the insurrection and the attack on the U.S. Capitol and American democracy.",
    "Also noteworthy is at 7:16 PM, after the attack on the Capitol, the White House operator told the president there were \"pending calls\" from Sen. Hawley, and attorney Cleta Mitchell who was on Trump's possibly unlawful call to Georgia Secretary of State Brad Raffensperger.",
    "And CBS' Steven Portnoy notes House Republican Minority Leader Kevin McCarthy's widely-reported call with Trump is not in the log:\nTrump's last call before the massive gap was to Senator David Perdue (R-GA), who is now running for governor of Georgia.",
    "The logs and diary could pose serious problems for Donald Trump, the former president, and his top aides and allies, as the House Select Committee on the January 6 Attack puts together a detailed timeline of everything that happened on that day.",
    "Costa published links to the White House call logs and the Presidential \"Daily Diary\":\nThey reveal a president who was in a flurry of phone calls from 8:23 AM to 11:06 AM – and then a mysterious seven-hour gap, until 6:54 PM.",
    "NOW WATCH: Over 7 hours of disappearing Trump phone records makes Nixon's tapes 'look like nothing'\nOver 7 hours of disappearing Trump phone records makes Nixon's tapes 'look like nothing'",
    "For example, Congressman Jim Jordan infamously told a reporter he couldn't remember when he talked to the president on January 6, even if it was before or after the insurrection.",
    "Costa points to Steve Bannon:\nTrump then told the White House operator to call Senator Josh Hawley, whose fist pump has become an iconic symbol of the insurrection.",
    "Costa, formerly of The Washington Post, and Woodward, currently with The Post, have been working together.",
    "He talked to Trump for ten minutes, from 9:24 AM to 9:34 AM – before the attack on the Capitol.",
    "And then he talked with Rudy Giuliani for six minutes.",
    "Stephen Miller for 26 minutes, and on and on."
  ]
}