{
  "id": 9425,
  "mediaId": 2748,
  "date": "2022-03-20",
  "headline": "House Democrats Vote on Alleged Anti-Hair Discrimination amid Ukraine Crisis, Rising Inflation",
  "image": "https://www.cracknewz.com/favicon.ico",
  "link": "https://www.cracknewz.com/2022/03/house-democrats-vote-on-alleged-anti.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Blarp Blog",
  "authorUrl": "",
  "termIds": [
    2119,
    4972,
    392,
    387,
    1474,
    6678
  ],
  "sentences": [
    "The company claimed in a Dove 2019 CROWN Research Study:\nA Black woman is 80% more likely to change her natural hair to meet social norms or expectations at work[1]\nBlack women are 1.5 times more likely to be sent home or know of a Black woman sent home from the workplace because of her hair[1]\nRep. Dan Bishop (R-NC) said on the House floor ahead of the vote that the CROWN Act may prevent employers from regulating hairstyles for safety purposes.",
    "House Republican leadership released a whip notice recommending a vote against the bill:\nFederal law already prohibits disparate treatment of one individual compared to another based on race, color, or national origin, which includes grooming and appearance policies if applied in a discriminatory manner, rendering this legislation unnecessary and duplicative.",
    "House Judiciary Committee Ranking Member Jim Jordan (R-OH) said on the House floor ahead of the vote that Americans already cannot be discriminated against their hairstyle and that Congress should focus on pressing issues such as inflation, Russia, and rising gas prices.",
    "The Dove company heavily pushed this legislation and even created the CROWN Coalition with the National Urban League, Color of Change, and Western Center on Law & Poverty to advance the CROWN Act.",
    "House Democrats voted on legislation on Friday that would combat alleged anti-hair discrimination while there remains a war in Ukraine and Americans grapple with soaring inflation and gas prices.",
    "“Our mission was, and is today, to advance efforts to end hair discrimination and to create a more equitable and inclusive beauty experience for Black women and girls,” Dove wrote in a release.",
    "The legislation would prohibit alleged discrimination based on a person’s hair texture or hairstyle that is commonly associated with a particular race or national origin.",
    "Bishop said America truly needs a bill to “unleash American energy independence.”\nHe also emphasized that in 2020 homicides rose by 30 percent.",
    "Discrimination against Black women and girls because of their natural hair is far too common in our workplaces and schools.",
    "I’m proud to sponsor the #CROWNAct, which would ban this racist practice,” Rep. Bonnie Watson Coleman (D-NJ) wrote.",
    "This legislation previously failed under suspension of the rules on February 28th by a vote of 235 – 188.",
    "2116, the Creating a Respectful and Open World for Natural Hair (CROWN) Act of 2021, 235-189.",
    "Democrats overwhelmingly supported the legislation, and Republicans opposed the bill.",
    "“Black women are 1.5X more likely to be sent home from work because of their hair.",
    "The House passed H.R."
  ]
}