{
  "id": 9468,
  "mediaId": 2746,
  "date": "2022-03-28",
  "headline": "House Republicans devise plan to curtail Biden’s catch-and-release policies",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/16/Russia_Ukraine_War_Congress_95611.jpg-fe5ab_c0-205-4934-3083_s1200x700.jpg?9143f55e6c9d8a5527d73a789361f6a72fcb6e49",
  "link": "https://www.washingtontimes.com/news/2022/mar/28/jim-jordan-devises-plan-curtail-biden-immigration-/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Ferrechio",
  "authorUrl": "https://www.washingtontimes.com/staff/susan-ferrechio/",
  "termIds": [
    0
  ],
  "sentences": [
    "House Republicans have hatched a plan to use the federal purse strings to put a stranglehold on the Biden administration’s ability to release illegal immigrants into the U.S.\nRep. Jim Jordan, who is poised to become chairman of the Judiciary Committee if the GOP wins back the majority in November, said he wants next year’s spending bill to include language to block the administration’s actions that have resulted in the release of hundreds of thousands of illegal immigrants into the U.S. since President Biden took office last year.",
    "Mr. Biden’s approval rating over his handling of immigration had sunk to 32 percent, his lowest rating across nine job performance measurements, found a Harris Poll conducted in late February in conjunction with Harvard University and the Center for American Political Studies.",
    "The party has railed against Mr. Biden’s immigration policies that began with ending the construction of President Trump’s border wall and continued with reduced detentions and deportations and the mass release of illegal immigrants in America’s cities and towns.",
    "House Republicans have pledged to pass additional border wall funding if they win back the House, but like the funds remaining from the Trump administration, the money is unlikely to be used by the Biden team to erect any new barriers to illegal immigration.",
    "His 2023 budget proposal, released Monday, would take $2 billion in unspent border wall funding passed under Mr. Trump and divert it to building roads and cutting back brush on the U.S.-Mexican border.",
    "Tying the language to must-pass spending legislation would offer the strongest path to passage, the argument goes, because Mr. Biden and the Senate would cause a government shutdown if they reject it.",
    "Under Mr. Biden, many asylum seekers are set free in the U.S.\nRepublicans could also try to force Mr. Biden to follow the Remain in Mexico rule through the appropriations process and public pressure.",
    "The Center for Immigration Studies, a low-immigration advocate, calculated that the Biden administration released 700,000 illegal immigrants into the interior of the country in 2021.",
    "“I think it’s the only approach,” he said of cutting off funding for catch-and-release policies, adding that the details would have to be decided by the House GOP conference.",
    "In 2019, part of the government remained shuttered for more than a month after Mr. Trump refused to sign spending legislation because it lacked border wall funding.",
    "He said the passage of policy changes aimed at returning illegal immigrants back to their home country would be the most effective way to stem the illegal surge.",
    "“Basically, their position is we can let in anybody we want, period, and it doesn’t matter what Congress says,” said Mark Krikorian, CIS executive director.",
    "Mr. Jordan said the drastic step is needed to stem the flow of illegal immigration with nearly 2 million people illegally crossing into the U.S last year.",
    "The move also would almost certainly set up the kind of partisan spending standoff and government shutdown for which the GOP is almost always blamed.",
    "Mr. Jordan’s idea, Mr. Krikorian said, could go further.“When the president is of the other party, the power of the purse is all you have,” he said.",
    "The Supreme Court is expected later this year to decide whether Mr. Biden can continue to ignore the Trump-era “Remain in Mexico” policy.",
    "Democrats argue that the Trump-era border enforcement was cruel and unnecessary, and the wall did not stop illegal immigration.",
    "The Republican and Democratic sides of the House Appropriations Committee did not respond to requests for comments.",
    "Republicans and Democrats have battled over border security in past spending bills without coming to an agreement.",
    "“You cannot let people into the country who are not allowed to be here,” said Mr. Jordan, Ohio Republican.",
    "The rule required many of those seeking asylum in the U.S. to wait for a ruling on their case in Mexico.",
    "The two sides agreed to negotiate a separate immigration and border security deal but nothing passed.",
    "“It might be the first example where the Republicans win a shutdown fight,” Mr. Krikorian said.",
    "Mr. Biden is now doubling down on the reversal of Trump-era border security measures.",
    "Mr. Jordan’s proposal is it’s likely to gain traction in a Republican-led House.",
    "He also acknowledged that Mr. Biden would likely veto it."
  ]
}