{
  "id": 9488,
  "mediaId": 8258,
  "date": "2022-03-27",
  "headline": "Conservative ROCKSTAR Drops MAJOR Biden Impeachment BOMBSHELL",
  "image": "https://americasfreedomfighters.com/wp-content/uploads/2022/03/257.jpg",
  "link": "https://americasfreedomfighters.com/impeachment-bombshell/",
  "mediaOutlet": "americasfreedomfighters.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AFF CEO/EDITOR-IN-CHIEF",
  "authorUrl": "https://americasfreedomfighters.com/author/clark-kent/",
  "termIds": [
    0
  ],
  "sentences": [
    "The Post Millennial reports–\n“Republican leadership at a recent gathering has brought up exploring possible plans for impeaching President Joe Biden if the right-wing takes back control of Congress after November’s upcoming midterm elections\nRecent polling of how voters are feeling about the Biden administration so far this year indicates a strong likelihood of a “red wave.” The Washington Times got the scoop on this story while attending a Republican meeting held in Florida.",
    "While places like The New York Times have attempted to keep eyes on former President Donald Trump’s role, the results of a Pew Research survey posted on Thursday indicate 71 percent of Republican voters are ready to vote in the 2022 midterms for a Congress that is “against Biden.”\nJordan reiterated the need for party unity in the House of Representatives to successfully impeach Biden.",
    "Political analysts on both sides of the aisle expect a ‘red wave’ this year as Biden’s approval ratings continue to hover at or below 40% and there is a looming inflation crisis and war in Ukraine.",
    "The bottom line is that it has to be extremely frustrating to be right and have solutions but since we are outnumbered by leftwing lunatics NOTHING positive can get done.",
    "Jordan, who has been one of President Trump’s most ardent supporters, is likely to become the House Judiciary Committee Chairman if Republicans retake the House.",
    "During a Republican meeting in Florida, the Representative said that if Republicans were to attempt to impeach Biden, they would need unity across the party.",
    "DINO PORRAZZO at AMERICAS FREEDOM FIGHTERS –\nI’ll start by saying that Americas Freedom Fighters are huge fans of GOP Rep. Jim Jordan of Ohio.",
    "It’s explained that Jordan is expected to have control over the House Judiciary Committee if Republicans sweep this year’s midterm elections.",
    "said that impeaching President Biden is ‘definitely a discussion we have to have’ if Republicans win back the House in the 2022 midterms.",
    "Yeah, that means that Kamala Harris would be president but she can’t be any worse than Biden plus we’ll freaking impeach her ass too!",
    "“I think that’s definitely a discussion we have to have,” Rep. Jim Jordan (R-OH) told the DC-based conservative outlet.",
    "Jordan tells it like it is and the country would be in a much better place if we had 200 more Conservatives like him.",
    "I can write my ass off and I do 12 hours a day-7 days a week and I can only hope that I am making a difference.",
    "Anyways, Adam Wilson writing for our good friends at 100 Percent FED Up reports that Rep. Jim Jordan (R-Oh.)",
    "You have to have complete buy-in from the entire conference and the leadership of our conference.”\n?",
    "Please take a moment and share our articles with your friends, family and on all social media sites!",
    "?Be sure to sign up for our FREE newsletter and we’ll keep you in the loop by CLICKING HERE!??",
    "?It’s time to enjoy social media again… without the filthy Communist censorship!",
    "Join us at SPREELY, PARLER, GETTR, WeGo, Gab, Codias, Mumblit, and WorldAnon.",
    "Impeach that senile pile of garbage before he completely destroys America.",
    "That’s the panel in charge of coordinating the impeachment process.",
    "He’s smart and doesn’t screw around with double talk and B.S.",
    "“The conference has to decide.",
    "Thank you, we appreciate it!",
    "Okay back to the report.",
    "I know the feeling.",
    "God Bless.",
    "We agree!",
    "??",
    "?",
    "?"
  ]
}