{
  "id": 9507,
  "mediaId": 2589,
  "date": "2022-03-23",
  "headline": "Mo Brooks turns on Trump: He pushed me to \"rescind\" the 2020 results, remove Biden, and reinstate him as president",
  "image": "https://media.townhall.com/townhall/reu/o/2022/73/eac98de2-53c0-4828-83da-4e926c70d107-1110x740.jpg",
  "link": "https://hotair.com/allahpundit/2022/03/23/mo-brooks-turns-on-trump-he-pushed-me-to-rescind-the-2020-results-remove-biden-and-reinstate-him-as-president-n457542",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Allahpundit",
  "authorUrl": "https://hotair.com/author/allahpundit",
  "termIds": [
    2469,
    3246,
    2765,
    4267,
    4905,
    5110,
    5592
  ],
  "sentences": [
    "Such is the mentality of a guy who leads his closest competitor by 40 points in the latest presidential primary poll for a party whose activists often describe themselves as “constitutional conservatives.”\nBy the way, according to Brooks, Trump wasn’t lobbying him to undo the election in the immediate aftermath of January 6.",
    "I wish President Trump wouldn’t fall for McConnell’s ploys, but, once again, he has…\nPresident Trump asked me to rescind the 2020 elections, immediately remove Joe Biden from the White House, immediately put President Trump back in the White House, and hold a new special election for the presidency.",
    "He’s so obsessed with his 2020 defeat that he’s still trying to finagle a coup a year and a half later:\nNew: Rep. Mo Brooks told ABC Trump asked him repeatedly – “off and on since Sep. 2021” to “rescind” the 2020 election results, “remove” Biden as president and re-do the election.",
    "It reminds me of the books from national reporters about Trump’s presidency that have come out over the past year packed with juicy new material that somehow didn’t make it into the pages of the newspapers they work for.",
    "I’ll bet every populist in the House GOP caucus, from Jim Jordan to Paul Gosar to Matt Gaetz to Marjorie Taylor Greene and on down, has had to field the same request from Trump at one point or another.",
    "As a lawyer, I’ve repeatedly advised President Trump that January 6 was the final election contest verdict and neither the U.S. Constitution nor the U.S. Code permit what President Trump asks.",
    "But I can’t help but notice that he decided not to share this information with the public until the very moment that he no longer stood to gain electorally from keeping it a secret.",
    "And everyone in Congress with firsthand knowledge of it will bite their lips rather than say so publicly because, again, it benefits them personally to keep quiet about it.",
    "Now suddenly here’s Mo Brooks saying not only that Trump thought he might be reinstated, he was actively lobbying at least one member of Congress to make it happen somehow.",
    "pic.twitter.com/99Hvj4YKhv\n— The Republican Accountability Project (@AccountableGOP) March 23, 2022\nHere’s Brooks speaking to NBC today about his conversations with Trump.",
    "The legal niceties of how to undo the 2020 election, oust Biden, and put Trump back in power is something for egghead lawyers and RINO politicians to worry about.",
    "As for Trump himself, I can’t begin to imagine what sort of legal mechanism he imagined would be used to “rescind” the election and reinstate him as president.",
    "— Ben Siegel (@bensiegel) March 23, 2022\nLast June, reports circulated that Trump had told people he thought he would be reinstated as president by August.",
    "This revelation, tucked away in a statement Brooks issued after Trump un-endorsed him this morning, is revealing about the character of both men.",
    "It’s nice that Brooks let Trump know that his insane pitch for an out-and-out coup aimed at the current president wasn’t legally possible.",
    "Lots of people are willing to keep secrets about Trump’s bad behavior temporarily, it seems, if they can profit personally from doing so.",
    "Even if the GOP had the votes in the House to impeach Biden, they’re nowhere near the threshold they’d need in the Senate to remove him.",
    "But some MAGA fans scoffed and dismissed it as a smear, believing Trump’s enemies must have fabricated the story to make him look nuts.",
    "Just spoke with Mo Brooks–>\nNBC: Did [Trump] directly say that there should be a new special election for the presidency?",
    "I’ve told President Trump the truth knowing full well that it might cause President Trump to rescind his endorsement.",
    "And that’s more important than whether it benefits the country to have Trump in a position of political influence.",
    "Brooks: After Sept 1, 2021. pic.twitter.com/rQcINEeEAr\n— Vaughn Hillyard (@VaughnHillyard) March 23, 2022",
    "It wasn’t just the liberal New York Times reporting that; staff at National Review heard the same thing.",
    "And they still won’t be anywhere near it even if they have a good midterm and regain majority control.",
    "It’s disappointing that, just like in 2017, President Trump lets Mitch McConnell manipulate him again.",
    "Mike Durant, one of Brooks’s opponents in the Alabama GOP Senate primary, understands the game here.",
    "Brooks: In one of the convos he mentioned having a subsequent election for the presidency.",
    "Every single negative TV ad against our campaign has come from McConnell and his allies.",
    "He’ll fit right in when he gets to Washington:\nThe price of a Trump endorsement?",
    "Impeach and remove Harris too and you end up with President Nancy Pelosi.",
    "He doesn’t concern himself with law, he concerns himself with power.",
    "But I took a sworn oath to defend and protect the U.S. Constitution.",
    "I assume the January 6 committee subpoena is already being prepared.",
    "Saying the 2020 election was stolen louder than your opponents.",
    "But that’s what’s revealing about this with respect to Trump.",
    "Impeachment and removal of Biden wouldn’t do it, obviously.",
    "All that would do is make Kamala Harris president.",
    "He’s probably even pitched Kevin McCarthy on it.",
    "He was lobbying him within the past six months.",
    "NBC: This was after this Labor Day?",
    "The party’s led by a crazy person.",
    "I break my sworn oath for no man.",
    "Yeah, that sure sounds like him.",
    "He’s an authoritarian.",
    "That is the way I am.",
    "I honor my oath.",
    "Period."
  ]
}