{
  "id": 9567,
  "mediaId": 2644,
  "date": "2022-03-25",
  "headline": "Clarence Thomas called to recuse himself over wife’s alleged texts",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/Justice-Thomas-80.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/25/clarence-thomas-called-to-recuse-himself-over-wifes-alleged-texts/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Callie Patteson",
  "authorUrl": "",
  "termIds": [
    2391,
    2132,
    2982,
    4905,
    4066,
    5503,
    1269,
    6159,
    6678
  ],
  "sentences": [
    "“Clarence Thomas cannot sit on any matter involving the election, the invasion of the Capitol, or the work of the January 6 Committee,” NYU law professor Stephen Gillers told the New Yorker, adding that the justice’s wife “crossed a line.”\n“If Justice Thomas knew that his wife’s emails were among the records that would be produced, then surely he should have recused himself, because his wife, although not formally a party, had a very direct personal interest in the case — an interest in avoiding the embarrassment that would result (and now has resulted) from the revelation,” Bruce Green, a judicial ethics expert at Fordham Law School, also told the outlet.",
    "“Biden crime family & ballot fraud co-conspirators (elected officials, bureaucrats, social media censorship mongers, fake stream media reporters, etc) are being arrested & detained for ballot fraud right now & over coming days, & will be living in barges off GITMO to face military tribunals for sedition,” she wrote in a message on the same day.",
    "“At the bare minimum, Justice Thomas needs to recuse himself from any case related to the January 6th investigation, and should Donald Trump run again, any case related to the 2024 election.”\n“In light of new reporting from numerous outlets, Justice Thomas’ conduct on the Supreme Court looks increasingly corrupt,” he continued.",
    "But House Minority Leader Kevin McCarthy (R-Calif.) defended Justice Thomas on Friday, telling reporters at the House Republicans’ annual retreat in Florida that Thomas’ decision is “based upon law.”\n“No, I think, I think Justice Thomas could make his decisions like he’s made them every other time,” McCarthy said.",
    "If it’s constitutional, that’s what his job should be — it’s him.”\nRep. Jim Jordan (R-Ohio), who was seated next to McCarthy at the event, agreed with the minority leader, saying, “Totally.”\nWhile Wyden remains the only lawmaker to call on Thomas to recuse himself, several legal experts have made similar comments.",
    "Democratic lawmakers and several legal scholars are criticizing Supreme Court Justice Clarence Thomas for not recusing himself in Jan 6-related cases after reports indicated his wife sent a series of texts pushing for an overturn of the 2020 presidential election results.",
    "While Thomas never mentions her husband or the Supreme Court in the messages, they were included in more than 2,300 turned over by Meadows to the House select committee investigating the Capitol riot, according to the Washington Post.",
    "The texts allegedly from Virginia “Ginni” Thomas, a conservative activist and former aide to then-President Donald Trump, were sent to then-White House chief of staff Mark Meadows in the aftermath of the 2020 presidential election.",
    "Sen. Richard Blumenthal (D-Ct.) also joined in on the criticism, telling CBS News that the justice should consider “voluntarily appearing” before the select committee for full transparency.",
    "The majority knows Biden and the Left is attempting the greatest Heist of our History.”\n“Do not concede,” she reportedly wrote in another text dated Nov. 5, 2020.",
    "Justice Clarence Thomas’ corruption in trying to cover up the crazy stuff Ginni Thomas did is a dagger to the Supreme Court’s reputation,” Lieu tweeted.",
    "In January, the Supreme Court refused to block the release of a trove of documents that Trump fought to keep from the committee in an 8-1 decision.",
    "“The Supreme Court’s power relies on the trust the people place on Justices to act in the public interest, not their own personal interest.",
    "Throughout the committee’s investigation, it has requested thousands of documents and records from former Trump aides and the White House.",
    "“Judges are obligated to recuse themselves when their participation in a case would create even the appearance of a conflict of interest.",
    "On Friday, Rep. Ron Wyden (D-Ore.) called on Justice Thomas to recuse himself from any cases related to the Jan. 6 investigation.",
    "If you spent any time studying this Supreme Court justice, he’s one who studies correctly, I mean, from all the way through.",
    "Earlier in the day, Rep. Ted Lieu (D-Calif.) called the reports a “dagger” to the high court’s reputation.",
    "“You are the leader, with him, who is standing for America’s constitutional governance at the precipice.",
    "A person with an ounce of commonsense could see that bar is met here,” Wyden said in a statement.",
    "If he sees it’s not upholding the Constitution, he’ll rule against it.",
    "!” Virginia Thomas wrote in a Nov. 10, 2020, message.",
    "“Help This Great President stand firm, Mark!!",
    "Justice Thomas was the lone dissent.",
    "“It’s his decision based upon law."
  ]
}