{
  "id": 9579,
  "mediaId": 2685,
  "date": "2022-03-24",
  "headline": "Virginia Thomas urged White House chief to pursue unrelenting efforts to overturn the 2020 election, texts show",
  "image": "https://chorus.stimg.co/23343549/thomas032422.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces",
  "link": "https://www.startribune.com/in-texts-ginni-thomas-urged-white-house-chief-to-pursue-unrelenting-efforts-to-overturn-20-election/600159152/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Woodward and Robert Costa Washington Post",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "In the Nov. 5 message to Meadows, Thomas went on to quote a passage that had circulated on right-wing websites: \"Biden crime family & ballot fraud co-conspirators (elected officials, bureaucrats, social media censorship mongers, fake stream media reporters, etc) are being arrested & detained for ballot fraud right now & over coming days, & will be living in barges off GITMO to face military tribunals for sedition.\"",
    "WASHINGTON - Virginia Thomas, a conservative activist married to Supreme Court Justice Clarence Thomas, repeatedly pressed White House Chief of Staff Mark Meadows to pursue unrelenting efforts to overturn the 2020 presidential election in a series of urgent text exchanges in the critical weeks after the vote, according to copies of the messages obtained by The Washington Post and CBS News.",
    "\"The intense pressures you and our President are now experiencing are more intense than Anything Experienced (but I only felt a fraction of it in 1991),\" Thomas wrote to Meadows on Nov. 19, an apparent reference to Justice Thomas's 1991 confirmation hearings in which lawyer Anita Hill testified that he had made unwanted sexual comments when he was her boss.",
    "The revelation of Thomas's messages with Meadows comes three weeks after lawyers for the committee said in a court filing that the panel has \"a good-faith basis for concluding that the President and members of his Campaign engaged in a criminal conspiracy to defraud the United States\" and obstruct the counting of electoral votes by Congress.",
    "The messages, which do not directly reference Justice Thomas or the Supreme Court, show for the first time how Ginni Thomas used her access to Trump's inner circle to promote and seek to guide the president's strategy to overturn the election results - and how receptive and grateful Meadows said he was to receive her advice.",
    "In February 2021, when the Supreme Court rejected election challenges filed by Trump and his allies, Thomas wrote in a dissent that it was \"baffling\" and \"inexplicable\" that the majority had decided against hearing the cases because he believed the Supreme Court should provide states with guidance for future elections.",
    "Powell was becoming ubiquitous on television - and winning the president's favor, according to several Trump advisers - as she claimed without evidence that electronic voting systems had stolen the election from Trump by switching millions of ballots in Biden's favor.",
    "The messages - 29 in all - reveal an extraordinary pipeline between Virginia Thomas, who goes by Ginni, and President Donald Trump's top aide during a period when Trump and his allies were vowing to go to the Supreme Court in an effort to negate the election results.",
    "Ginni Thomas, in that interview, also acknowledged that she had attended Trump's \"Stop the Steal\" rally at the Ellipse near the White House on Jan. 6, but said that she left early because it was too cold and that she did not have any role in planning the event.",
    "\"Release the Kraken\" had become a catchphrase on the far right after the election, used as shorthand for the anticipated exposure of a voter fraud conspiracy that would upend Biden's victory with the same force as a \"Kraken,\" a mythical giant sea monster.",
    "Mark Steyn, Bongino, Cleta\" - appearing to refer to conservative commentators Rush Limbaugh, Mark Steyn and Dan Bongino, as well as lawyer Cleta Mitchell, who was involved in Trump's push to claim victory in Georgia despite Biden's certified win there.",
    "After Fox News host Tucker Carlson contacted Powell about her claim that electronic voting machines had switched ballots to Biden, he told his viewers that he found her answers evasive and that she had shown no evidence to support her assertion.",
    "Instead of capturing the nation's attention at the RNC news conference, where she spoke alongside Giuliani and other Trump advisers, Powell was criticized for spreading a false theory about electronic voting machines as a tool for communists.",
    "Pieczenik, a former State Department official, is a far-right commentator who has falsely claimed that the 2012 massacre at Sandy Hook Elementary School in Newtown, Conn., was a \"false-flag\" operation to push a gun-control agenda.",
    "In that message, Thomas expresses support for Meadows and Trump - and directed anger at Vice President Mike Pence, who had refused Trump's wishes to block the congressional certification of Biden's electoral college victory.",
    "In her text messages to Meadows, Ginni Thomas spread false theories, commented on cable news segments and advocated with urgency and fervor that the president and his team take action to reverse the outcome of the election.",
    "While many Republicans supported Trump's filing of legal challenges in several states, his lawyers stumbled in court and many allies by mid-November were privately confiding that Trump's legal battle would be short-lived.",
    "Thomas then turned to her frustrations with congressional Republicans and said she wished more of them were rallying behind Trump and being more active with his base voters, who were furious about the election.",
    "Trump's legal operation was divided between his campaign's official lawyers and Rudolph Giuliani, Trump's confidant and personal attorney who was fast asserting control of his campaign's legal strategy.",
    "She claimed, again without evidence, that hundreds of thousands of ballots were appearing out of nowhere and that a global communist conspiracy was afoot involving Venezuela, Cuba, and probably China.",
    "\"Clarence doesn't discuss his work with me, and I don't involve him in my work,\" she said in an interview with the Washington Free Beacon, a conservative outlet, for an article published March 14.",
    "In the messages, Thomas and Meadows each assert a belief that the election was stolen and seem to share a solidarity of purpose and faith, though they occasionally express differences on tactics.",
    "Among Thomas's stated goals in the messages was for lawyer Sidney Powell, who promoted incendiary and unsupported claims about the election, to be \"the lead and the face\" of Trump's legal team.",
    "On Nov. 19, which would be a crucial day for Powell as she spoke at a news conference at the Republican National Committee, Thomas continued to bolster Powell's standing in a text to Meadows.",
    "The committee received one additional message sent by Thomas to Meadows, on Jan. 10, four days after the \"Stop the Steal\" rally Thomas said she attended and the deadly attack on the Capitol.",
    "Crowley, a top official in Trump's Treasury Department, had been an aide to former president Richard Nixon years after he resigned from office in 1974 because of the Watergate scandal.",
    "Shortly after providing the 2,320 messages, Meadows ceased cooperating with the committee, arguing that any further engagement could violate Trump's claims of executive privilege.",
    "Justice Thomas, who is currently hospitalized for treatment of an infection, did not respond to a request for comment made through the Supreme Court's public information office.",
    "By Nov. 22, Trump gave his blessing for Giuliani and another Trump lawyer, Jenna Ellis, to issue a statement claiming that Powell \"is not a member of the Trump Legal Team.\"",
    "On Nov. 24, Thomas engaged Meadows again by sharing a video from Parler, a conservative social media website, that appeared to refer to conservative commentator Glenn Beck.",
    "On Nov. 10, after news organizations had projected Joe Biden the winner based on state vote totals, Thomas wrote to Meadows: \"Help This Great President stand firm, Mark!!",
    "During that period, supporters of the QAnon extremist ideology embraced a false theory that Trump had watermarked mail-in ballots so he could track potential fraud.",
    "It is unknown whether Ginni Thomas and Meadows exchanged additional messages between the election and Biden's inauguration beyond the 29 received by the committee.",
    "The existence of messages between Thomas and Meadows - 21 sent by her, eight by him - have not previously been reported and were reviewed by The Post and CBS News.",
    "Her views were considered so extreme and unsupported by evidence that David Bossie, a longtime Trump supporter, told others that she was peddling \"concocted B.S.\"",
    "On Nov. 13, she texted Meadows about her outreach to \"Jared,\" potentially a reference to Jared Kushner, the president's son-in-law and senior White House adviser.",
    "Some Trump aides were horrified by her and Giuliani's performances and felt they had embarrassed the president by becoming a parody of his post-election fight.",
    "She wrote, \"House and Senate guys are pathetic too... only 4 GOP House members seen out in street rallies with grassroots... Gohmert, Jordan, Gosar, and Roy.\"",
    "Nation 600159152\nThe messages, 29 in all, reveal an extraordinary pipeline between the wife of a Supreme Court justice and President Donald Trump's top aide.",
    "The text exchanges with Thomas that Meadows provided to the House select committee pause after Nov. 24, 2020, with an unexplained gap in correspondence.",
    "\"Watermarked ballots in over 12 states have been part of a huge Trump & military white hat sting operation in 12 key battleground states,\" she wrote.",
    "She appeared to be referring to Republican House members Louie Gohmert of Texas, Jim Jordan of Ohio, Paul A. Gosar of Arizona and Chip Roy of Texas.",
    "\"The lower level insiders are scared, fearful or sending out signals of hopelessness vs an awareness of the existential threat to America right now.",
    "She sent him a link to a YouTube video labeled \"TRUMP STING w CIA Director Steve Pieczenik, The Biggest Election Story in History, QFS-BLOCKCHAIN.\"",
    "Justice Thomas, 73, is the Supreme Court's longest-serving current justice and has missed oral arguments this week because of his hospitalization.",
    "Just going with one more thing with no frickin consequences... the whole coup and now this... we just cave to people wanting Biden to be anointed?",
    "She urged that they take a hard line with Trump staffers and congressional Republicans who had resisted arguments that the election was stolen.",
    "The text messages were among 2,320 that Meadows provided to the House select committee investigating the Jan. 6 attack on the U.S. Capitol.",
    "The text message seems to quote Hair's belief that \"the most important thing you can realize right now is that there are no rules in war.\"",
    "Justice Amy Coney Barrett, sometimes called \"ACB\" by her supporters, had joined the Supreme Court in October, shortly before the election.",
    "When Meadows wrote to Thomas on Nov. 24, the White House chief of staff invoked God to describe the effort to overturn the election.",
    "\"Van Jones spins interestingly, but shows us the balls being juggled too,\" Thomas said, referring to the prominent CNN commentator.",
    "News organizations had declared Biden the winner on Nov. 7, after a review of vote totals in each state and the electoral count.",
    "\"If you all cave to the elites, you have to know that many of your 73 million feel like what Glenn is expressing,\" Thomas wrote.",
    "\"Don't let her and your assets be marginalized instead...help her be the lead and the face,\" she wrote to Meadows on Nov. 13.",
    "In reviewing the substance of the messages Wednesday, he said that neither he nor Meadows would comment on individual texts.",
    "\"Monica Crowley,\" Thomas said, referring to the conservative commentator, \"may have a sense of this [from] her Nixon days.\"",
    "Yet Thomas urged Meadows to plow ahead, rally Republicans around Trump and remind them of his enduring political capital.",
    "She continued by urging him to \"Help This Great President stand firm\" and invoking \"the greatest Heist of our History.\"",
    "Thomas has publicly denied any conflict of interest between her activism and her husband's work on the Supreme Court.",
    "Meadows's attorney, George Terwilliger III, confirmed the existence of the 29 messages between his client and Thomas.",
    "The following day, Nov. 14, Thomas sent Meadows material she said was from Connie Hair, chief of staff to Gohmert.",
    "It is not clear if she was passing on a message from Hair or sharing Hair's perspective as guidance for Meadows.",
    "Committee members and aides said they believe the messages may be just a portion of the pair's total exchanges.",
    "But Thomas wrote to Meadows, \"I hope this is true; never heard anything like this before, or even a hint of it.",
    "The first of the 29 messages between Ginni Thomas and Meadows was sent on Nov. 5, two days after the election.",
    "Trump spoke publicly during this period about his intent to contest the election results in the Supreme Court.",
    "\"This is a major fraud on our nation,\" the president said in a speech at 2:30 the morning after the election.",
    "!...You are the leader, with him, who is standing for America's constitutional governance at the precipice.",
    "Sidney Powell & improved coordination now will help the cavalry come and Fraud exposed and America saved.\"",
    "In that same exchange, Thomas also at one point offered Meadows advice on managing the West Wing staff.",
    "She said Trump risked his supporters growing disenchanted to the point of walking away from politics.",
    "\"Most of us are disgusted with the VP and are in listening mode to see where to fight with our teams.",
    "Still, while Trump cheered some of Powell's commentary, she was a polarizing figure in his orbit.",
    "The text messages received by the House select committee do not include a response from Meadows.",
    "Ginni Thomas did not respond to multiple requests for comment made Thursday by email and phone.",
    "Those who attacked the Capitol are not representative of our great teams of patriots for DJT!!\"",
    "\"She doesn't have anything or at least she won't share it if she does,\" Meadows texted back.",
    "Later on Nov. 19, Meadows replied to Thomas's long text message by saying, \"Thanks so much.\"",
    "Meadows replied three minutes later: \"I don't know what you mean by caving to the elites.\"",
    "Meadows might not have been Thomas's only contact inside the Trump White House that week.",
    "Later that night, Ginni Thomas messaged Meadows seeming to react to a cable news segment.",
    "Hair said Thursday that she did not have any specific recollection of that text message.",
    "As Giuliani spoke, a dark brown liquid mixed with beads of sweat rolled down his cheek.",
    "The majority knows Biden and the Left is attempting the greatest Heist of our History.\"",
    "The messages provided to the House select committee do not show a response by Meadows.",
    "She wrote, \"Mark, I wanted to text you and tell you for days you are in my prayers!!\"",
    "Thomas then wrote, \"You guys fold, the evil just moves fast down underneath you all.",
    "\"We are living through what feels like the end of America,\" Thomas wrote to Meadows.",
    "But, Terwilliger added, \"nothing about the text messages presents any legal issues.\"",
    "Nine minutes after that, Thomas replied, \"Tearing up and praying for you guys!!!!!",
    "Thomas wrote to Meadows, \"Tears are flowing at what Rudy is doing right now!!!!\"",
    "They were then confirmed by five people who have seen the committee's documents.",
    "\"Suggestion: You need to buck up your team on the inside, Mark,\" Thomas wrote.",
    "\"Sounds like Sidney and her team are getting inundated with evidence of fraud.",
    "She then told him to watch a YouTube video about the power of never conceding.",
    "After continued back-and-forth, Meadows wrote, \"You're preaching to the choir.",
    "But Thomas's high aspirations for Powell quickly collapsed that afternoon.",
    "The next day, Nov. 6, Thomas sent a follow-up to Meadows: \"Do not concede.",
    "\"Where the heck are all those who benefited by Presidents coattails?!!!\"",
    "- - -\nThe Washington Post's Claire McMullen contributed to this report.",
    "The video Thomas shared with Meadows is no longer available on YouTube.",
    "Thomas responded: \"I can't see Americans swallowing the obvious fraud.",
    "\"I think I am done with politics, and I don't think I am alone, Mark.\"",
    "She wrote, \"Just forwarded to yr gmail an email I sent Jared this am.",
    "\"Evil always looks like the victor until the King of Kings triumphs.",
    "Release the Kraken and save us from the left taking America down.\"",
    "\" he asked reporters, tying a legal reference to the 1992 comedy.",
    "Thomas added in the message that Meadows should \"Listen to Rush.",
    "\"Trying to understand the Sidney Powell distancing,\" she wrote.",
    "\"Watch the water\" was a refrain in QAnon circles at the time.",
    "It takes time for the army who is gathering for his back.\"",
    "He has made few public comments about the 2020 election.",
    "One minute later, Meadows responded: \"I will stand firm.",
    "Lots of intensifying threats coming to ACB and others.\"",
    "This plus a conversation with my best friend just now.",
    "\"This is a fight of good versus evil,\" Meadows wrote.",
    "she wrote in her text message to him late on Nov. 10.",
    "Thomas reached out to Meadows that day with concern.",
    "It is unclear to what threats Thomas was referring.",
    "A spokesman for the committee declined to comment.",
    "Kushner did not respond to a request for comment.",
    "You can buck them up, strengthen their spirits.\"",
    "\"We want the law to be used in a proper manner.",
    "So we'll be going to the U.S. Supreme Court.\"",
    "On Nov. 10, Thomas drew a reply from Meadows.",
    "It is unclear to whom Thomas was referring.",
    "We will fight until there is no fight left.",
    "Many of us can't continue the GOP charade.\"",
    "Our country is too precious to give up on.",
    "Thomas strongly denied the accusations.",
    "He stopped having her on his program.",
    "PSYOP,\" the text from Thomas states.",
    "This was a troubled time for Trump.",
    "It is unclear if Meadows responded.",
    "Well at least my time in DC on it.\"",
    "\"Did you watch 'My Cousin Vinny?'",
    "\"Glad to help,\" Meadows replied.",
    "Do not grow weary in well doing.",
    "\"Mark (don't want to wake you).",
    "I have staked my career on it.",
    "I will try to keep holding on.",
    "Thomas replied: \"Thank you!!",
    "\"This war is psychological.",
    "\"Amazing times,\" she added.",
    "Ginni Thomas stood by her.",
    "\"Me included,\" she wrote.",
    "Meadows did not respond.",
    "Thanks for all you do.\"",
    "So proud to know you!!\"",
    "\"The end of Liberty.\"",
    "America is worth it!\"",
    "The fight continues.",
    "Very demoralizing.\"",
    ",\" Thomas wrote.",
    "Thomas replied.",
    "Make a plan.",
    "Needed that!",
    "Possible???\"",
    "\"Wow!\"",
    ".",
    ".",
    ".",
    "."
  ]
}