{
  "id": 9605,
  "mediaId": 2695,
  "date": "2022-03-26",
  "headline": "Rep. Jim Jordan indicates that Republicans are open to impeaching Biden if they retake Congress in 2022",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTU5ODg1OS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwNTgxNDgyN30.PoDCtHcG6SeFMB2rVr24GuS8rICulpsF-iWGn7uqMfE/img.jpg?width=1200&coordinates=0%2C0%2C0%2C171&height=600",
  "link": "https://www.theblaze.com/news/rep-jim-jordan-indicates-that-republicans-are-open-to-impeaching-biden-if-they-retake-congress-in-2022",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Samuel Mangold-Lenett",
  "authorUrl": "https://www.theblaze.com/u/samuelmangold-lenett",
  "termIds": [
    2119,
    4905,
    3925,
    2905,
    1477,
    1126,
    1474,
    1433
  ],
  "sentences": [
    "According to the Washington Times, Jordan believes the GOP should seriously consider the possibility of impeaching Biden for his “failures in office, most notably his administration’s inability to stop a massive influx of illegal immigration through the southern border.”\nJordan said that under his leadership the judiciary committee would lead an impeachment trial but the decision to “try and remove” Biden from office would need to be agreed upon by every Republican member of the U.S. House of Representatives.",
    "“You have to have complete buy-in from the entire conference and the leadership of our conference.”\nIn late September of 2021, several members of the U.S. House of Representatives filed articles of impeachment against Biden in response to his administration’s botched withdrawal from Afghanistan and his failure in handling the longstanding immigration crisis at the southern border.",
    "The effort, according to the New York Post, was led by Rep. Bob Gibbs (R-Ohio) who said, “I filed three articles of impeachment against President Biden based on what I believe to be clear violations of his duties as president.”\nGibbs was joined by Reps. Andy Biggs from Arizona and Brian Babin and Randy Weber of Texas.",
    "By pulling military personnel out before the evacuation of American civilians, President Biden shamefully left our own citizens in danger.”\nJordan’s interest in impeaching Biden is also shared by his colleague in the U.S. Senate, Ted Cruz (R-Texas).",
    "Biden’s attempts to extend a federal eviction moratorium despite the Supreme Court’s warning and his own admission that he has no power to do so is a blatant and intentional action that violates the separation of powers,” Gibbs continued.",
    "Rep. Jim Jordan (R – Ohio) currently serves as the top Republican on the House Judiciary Committee and is positioned to take control of the committee in 2023 should the Republican Party retake control of Congress.",
    "Republican leaders in Congress are open to impeaching President Joe Biden if they are able to retake control of the legislative branch after the 2022 midterm elections.",
    "Cruz believes there is a chance the GOP will move to impeach and remove Biden from office should they retake Congress.",
    "“[Biden’s] willful negligence of the border crisis is a failure to maintain and defend American sovereignty.",
    "He said, “Yeah, I do think there’s a chance of that, whether it’s justified or not.”",
    "He added, “Finally, the withdrawal from Afghanistan was not just a disaster.",
    "“The conference has to decide,” Jordan said."
  ]
}