{
  "id": 9642,
  "mediaId": 2573,
  "date": "2022-03-21",
  "headline": "Rep. Ken Buck leads letter to DOJ demanding action on surging retail crime",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/12/Boarded-up-retail-store-in-San-Francisco-California.png",
  "link": "https://www.foxnews.com/politics/retail-crime-spike-biden-merrick-garland-ken-buck-republicans",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1661,
    1981,
    2451,
    4905,
    3006,
    5692,
    1477,
    1442
  ],
  "sentences": [
    "When asked by Fox News about the effect the lenient response in some cities to those left-wing demonstrations that turned violent in Summer 2020 had on the spike in retail theft being felt in 2021, Buck said certain policies have indeed fueled that fire:\n\"I think that the wrong signal has been sent to these criminals… anytime you talk about defunding the police, it demoralizes the police, and we need to make sure that our police realize that that law-abiding citizens support them and that the district attorneys support them,\" he said.",
    "REP. KEN BUCK PANS LATEST GOP BIG TECH TASK FORCE PROPOSAL: IT ‘DOESN’T GO FAR ENOUGH'\nIn the letter, Buck and his colleagues wrote that there has been a \"sharp rise\" in such crime in the past several months, and that local law enforcement agencies are in danger of being overwhelmed.",
    "The letter also cites the Biden Justice Department’s recent success in capturing $4.5 million in profits from stolen merchandise through its Operation Booster Buster – which broke up a large-scale theft ring in Tulsa, Okla., and surrounding areas.",
    "In his interview with Fox News, Buck went on to criticize lax policies toward prosecutorial discretion and no-bail laws in some cities, where repeat offenders are often let back onto the street instead of into the municipal jail.",
    "Further, the rise of online commerce platforms and the multi-jurisdictional nature of such theft, often crossing state lines, makes this a uniquely challenging issue for local authorities,\" the letter to Garland adds.",
    "\"I think it sends the wrong signal… And I think that I wouldn't call them protests -- I think there were legitimate protesters, but I also think there were thugs who were out to intimidate people.\"",
    "Buck was joined on the letter by more than a dozen other Republican members, including Reps. Steve Chabot, R-Ohio, Rodney Davis, R-Ill., Burgess Owens, R-Utah, and William Timmons IV, R-S.C.",
    "In the letter, Buck and his fellow signatories noted the National Retail Foundation found 70% of respondents to a recent survey reported increases in such organized retail crime.",
    "Buck went on to cite Garland's success in prosecuting Operation Booster Buster, and said it is a sign of hope that the DOJ will act expeditiously in response to his letter.",
    "FIRST ON FOX: More than a dozen Republicans sent a joint letter Monday to Attorney General Merrick Garland demanding action on surging retail crime over the past year-plus.",
    "\"When the police are ordered to stand down and the arrests aren't made for vandalism all the way up through arson and serious assaults, I don't think it helps,\" he said.",
    "\"And that activity and their response to that activity was that was not helpful for criminals across the board who were looking at increasing their activity.\"",
    "\"I urge the Justice Department to take action and develop a national strategy to address the alarming rise in organized retail crime,\" his letter reads.",
    "In an interview with Fox News on Saturday, Buck said he hopes the DOJ will take the nationwide surge in retail thefts \"more seriously\" than at present.",
    "Rep. Ken Buck, R-Colo., the prime author of the letter, told Fox News the Biden administration must act to provide for the security of all citizens.",
    "\"And I think that the Federal Bureau of Investigation and other law enforcement agencies are ready to help, and I think that's really important.\"",
    "\"Due to this rising tide of lawlessness, retailers are facing around $45 billion in annual losses, up from $30 billion just a decade ago.",
    "Buck's letter also comes following viral footage from across the nation showing flash mobs breaking into stores and looting merchandise.",
    "And so we really want to have good prosecutors and good sentences — and that, I think, would decrease this crime wave significantly.\"",
    "\"We need to have a federal effort that is supporting the effort that's going on in state and local law enforcement.",
    "And I think that they, the agents, recognize the seriousness of what's going on to retailers and consumers.\"",
    "Such crime waves have struck both coasts, from New York City to Philadelphia to Walnut Creek, Calif.",
    "They shouldn't necessarily take the lead, but they should get involved in helping out,\" he said.",
    "Twenty-nine people were charged in that operation, in cooperation with Oklahoma authorities.",
    "\"Police get very frustrated when they arrest the same person over and over again.",
    "State and local law enforcement are doing all they can,\" the letter says.",
    "\"I think that a signal from the top of the department would be great.",
    "And so, the federal government should get involved in helping out.",
    "\"[These] increases are markedly larger than in previous years.",
    "\"I hope he does,\" the lawmaker said of the attorney general.",
    "\"Critical federal assistance, however, remains absent.\"",
    "These gangs are national and sometimes international."
  ]
}