{
  "id": 9689,
  "mediaId": 2608,
  "date": "2022-03-29",
  "headline": "White House Phone Logs Provided to Jan. 6 Committee Contain Unexplained Eight-Hour Gap: Report",
  "image": "https://lawandcrime.com/wp-content/uploads/2021/01/GettyImages-801996764.jpg",
  "link": "https://lawandcrime.com/jan-6-committee/white-house-phone-logs-provided-to-jan-6-committee-contain-unexplained-eight-hour-gap-report/",
  "mediaOutlet": "lawnewz.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marisa Sarnoff",
  "authorUrl": "https://lawandcrime.com/author/marisa-sarnoff/",
  "termIds": [
    2132,
    3558,
    3037,
    2984,
    2765,
    3621,
    4905,
    226,
    6159
  ],
  "sentences": [
    "According to the report from veteran journalist Bob Woodward and CBS News chief election and campaign correspondent Robert Costa, the gap of seven hours and 37 minutes has prompted the House Jan. 6 Committee to investigate “whether Trump communicated that day through backchannels, phones of aides or personal disposable phones, known as ‘burner phones,’ according to two people with knowledge of the probe, who, like others interviewed for this report, spoke on the condition of anonymity to discuss sensitive information.”\nWoodward and Costa reported that the House committee is also trying to determine “whether it received the full logs” from that day.",
    "As Woodward and Costa note in their report, the hours-long gap “stands in stark contrast to the extensive public reporting about phone conversations he had with allies during the attack, such as a call Trump made to Sen. Mike Lee (R-Utah) — seeking to talk to Sen. Tommy Tuberville (R-Ala.) — and a phone conversation he had with House Minority Leader Kevin McCarthy (R-Calif.).”\nTrump had also posted on Twitter during that time, NPR noted.",
    "“The lack of an official White House notation of any calls placed to or by Trump for 457 minutes on Jan. 6, 2021 – from 11:17 a.m. to 6:54 p.m. – means the committee has no record of his phone conversations as his supporters descended on the Capitol, battled overwhelmed police and forcibly entered the building, prompting lawmakers and Vice President Mike Pence to flee for safety,” the Washington Post report says.",
    "Notably, the only justice to dissent from that ruling was Clarence Thomas, whose wife, conservative activist Ginni Thomas, is currently facing scrutiny for attending Trump’s so-called “Stop the Steal” rally that preceded the Capitol assault and for appearing to believe widely-rejected legal theories about the 2020 presidential election in communications with top Trump advisers on Jan. 6.",
    "The violent pro-Trump mob had overwhelmed the relatively sparse police force guarding the Capitol and rushed the building, temporarily stopping Congress from certifying Joe Biden‘s win in the 2020 election and forcing the evacuation of then-Vice President Mike Pence, who Trump had falsely insisted had the power to overturn the election results.",
    "The records show that Trump was on the phone nearly nonstop from 8:23 a.m. until 11:06 a.m. During that time, he spoke with adviser Steve Bannon, who on a Jan. 5 podcast said “all hell is going to break loose tomorrow.” Trump also spoke with Rudy Giuliani, Rep. Jim Jordan (R-Ohio), adviser Stephen Miller, and others.",
    "As Law&Crime previously reported on Saturday, Giuliani admitted in a civil defamation lawsuit filed by Georgia election workers that he was at the Willard Hotel in Washington, D.C., during the week following Jan. 2, 2021, manning what the election workers alleged was a Trump campaign “war room.”\n“Giuliani admits .",
    "“Other times, he would call from different numbers – or no number would appear on the recipient’s phone, the official said.”\n“I have no idea what a burner phone is, to the best of my knowledge I have never even heard the term,” Trump reportedly said to the Washington Post in a statement on Monday.",
    "Phone logs released to the House committee investigating the Jan. 6 attack on the U.S. Capitol reveal a nearly eight-hour gap that covers the time when the Capitol was under siege by a violent mob of Donald Trump supporters, several reports indicate.",
    "The documents provided to the committee indicate a conspicuous absence of any calls placed from around 11:00 a.m. to nearly 7:00 p.m. that day, according to a report from the Washington Post and CBS News, both of whom obtained copies of the records.",
    "The last person Trump spoke to before the hours-long gap appears to be David Perdue (R-Ga.) at 11:04 a.m. Perdue, a staunch Trump ally and former Republican senator, had lost his runoff election against Jon Ossoff, a Democrat, on Jan. 5.",
    "“Occasionally, when he made outbound calls, the number would show up as the White House switchboard’s number, according to a former Trump Cabinet official,” Woodward and Costa’s report said.",
    "The reply places Giuliani physically in Washington, D.C., and indicates he was involved in campaign-related activities but does not directly confirm he was talking with Trump on Jan. 6.",
    "During that time, Trump spoke with Scavino, Giuliani, Jason Miller, Kayleigh McEneny, Bannon again, then-Chief of Staff Mark Meadows, and Fox host Sean Hannity, among others.",
    "The National Archives has previously revealed that Trump took boxes of classified White House documents to his Mar-a-Lago residence in Florida when he left the White House.",
    "The logs don’t reflect any more phone calls until 6:54, when Trump told the White House switchboard operator to call back with aide Dan Scavino.",
    "The 11 pages of phone records were turned over to the House committee by the National Archives earlier this year, according to the report.",
    "Trump had repeatedly fought the release of certain White House documents relating to Jan. 6 but repeatedly failed in lower federal courts.",
    "In January, the Supreme Court denied his request to block the National Archives from releasing the documents to the committee.",
    "CNN had previously reported that the White House phone logs contained “hours-long gaps” on Jan. 6.",
    "Lawmakers and staff were either evacuated or forced to shelter in place and hide from the rioters.",
    "to being engaged at activities on behalf of the Trump Campaign at the Willard Hotel but denies .",
    "According to the report, Trump regularly used different phones when he was in the White House.",
    "Trump then resumed his nearly nonstop phone activity, which continued until almost midnight.",
    "The Capitol building was first breached shortly after 2:00 p.m.",
    "At around noon, Trump spoke at the “Stop the Steal” rally.",
    "The phone logs, via the Washington Post, are below.",
    "It is unclear precisely what may have been taken.",
    "[Image via Nicholas Kamm/AFP via Getty Images.]",
    "remaining allegations,” his reply indicates.",
    ".",
    ".",
    ".",
    "."
  ]
}