{
  "id": 971,
  "mediaId": 2618,
  "date": "2022-02-16",
  "headline": "Wokester bloodbath: Blue San Francisco throws out three Board of Education leftists by monster margins",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/16/wokester_bloodbath_blue_san_francisco_throws_out_three_board_of_education_leftists_by_monster_margins_79310.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Monica Showalter",
  "authorUrl": "",
  "termIds": [
    4968,
    4436,
    1179,
    173,
    6582,
    6026
  ],
  "sentences": [
    "Chances are this election result, and others like this one, are going to be a signal to the leftist, progressive, and socialist Democrats that to survive in the November election, that they are going to have to collude with their media propagandists to make themselves and their political agenda during the run up to the November election, look to enough of the stupid voter class that they (the Democrats) are more conservative then the wimpy Republicans when it comes to the (Democrat) imposed COVID school related mandates and restrictive requirements.",
    "San Francisco Democrats turned hard on three far-left Board of Education members who kept public schools on lockdown, focused on changing the names of storied old schools to wokester specifications, and told Asians to go to hell on merit-based admissions to the few remaining good ones.",
    "The landslide decision means board President Gabriela López and members Alison Collins and Faauuga Moliga\nContribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Now, don't believe this could translate into any House member in the SF area being voted out, but how about all of the other areas around the country with anything close to +7 democrat registration margins?",
    "According to the San Francisco Chronicle: San Francisco voters overwhelmingly supported the ouster of three school board members Tuesday in the city’s first recall election in nearly 40 years.",
    "\"If this doesn't wake up Democrats about the need to start paying attention to something besides wokesterism, nothing will.\"",
    "They also need to ensure they get the message out that abortion will be legal in California regardless of any Roe decision.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Hope the GOP has a nominee, who represents the districts, on the ballots for each House campaign.",
    "Same with New York where it was legal prior to Roe, as it was in Washington, Alaska and Hawaii.",
    "But, I'll bet that the miserable Breed woman will appoint equally horrible replacements.",
    "They didn't recall them by a narrow margin, but overwhelming margins for all 3.",
    "From far away, reading only news, they seem to be two peas in a pod.",
    "Your donation helps keep our discussions going and our voices heard.",
    "If it can happen there, it can happen everywhere!",
    "Perhaps to NYC residents there is a difference.",
    "Is Adams any noticable bit better than DeBozo?",
    "NOTHING can wake up an ideologue.",
    "These people are ideologues.",
    "It's already established.",
    "It wasn't even close.",
    "This sounds good.",
    "And look at NYC.",
    "Thank you."
  ]
}