{
  "id": 977,
  "mediaId": 2590,
  "date": "2022-02-12",
  "headline": "Canadian Judge Blocks Money For Truckers From U.S. Right-Wing Christian Fundraising Site",
  "image": "https://img.huffingtonpost.com/asset/6208433b3600003d3f24eb8a.jpeg?cache=AnuvhZRYQZ&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/givesendgo-ottawa-trucker-mob-fundraiser-injunction_n_62081de3e4b04af87f3deafd",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Papenfuss",
  "authorUrl": "",
  "termIds": [
    2373,
    2415,
    992,
    6483,
    6029,
    6678
  ],
  "sentences": [
    "pic.twitter.com/KVZK8qMFpd\n— Anna Mehler Paperny (@amp6) February 11, 2022\nThe order was part of a multipronged attack this week against the truckers who have paralyzed downtown Ottawa and blocked a key bridge into the U.S.\nA province-wide state of emergency was declared Wednesday and police on Saturday began enforcing an injunction against the truckers’ blockade of the Ambassador Bridge from Windsor, Ontario into Detroit.",
    "Every legal means must be mobilised to ensure radical political groups present their ideas to the people clearly through democratic channels -- Canadians will not be fooled #cdnpoli #AmbassadorBridgeBlockade #AmbassadorBridge https://t.co/3PIzJpK6St\n— Michael Kempa (@MichaelKempa1) February 12, 2022",
    "Ron DeSantis, Elon Musk, Rep. Jim Jordan (R-Ohio), and Donald Trump and son Donald Trump Jr.\nGoFundMe earlier this month shut down a site that had raised close to $10 million for the truckers after Ottawa police reached out to the company to complain of illegal activity by the truckers.",
    "Members of Ontario’s House of Commons this week heard testimony from deputy directors of Canada’s financial intelligence operation revealing that it doesn’t directly track sources of money pouring into crowdfunding sites like GoFundMe or GiveSendGo GlobalNews reported.",
    "Michael Kempa, an associate criminology professor at the University of Ottawa, views the truckers’ anti-vaccine fight largely as cover for a deeply authoritarian movement funded by American and global interests out to undermine the rule of law and Canada’s government.",
    "The anti-precautions protest began more than two weeks ago as hundreds of truckers, many driving massive semi-trucks, descended on downtown Ottawa, honking ear-piercing air horns, paralyzing traffic and shutting down stores and offices.",
    "“They’re people interested in undoing the conventional state system, and replacing the Canadian democratic model with something that is much more grassroots authoritarian and far-right conservative,” Kempa told CBC-TV in an interview.",
    "Advertisement\nThe criminal code allows for such an action against any “offense-related property,” meaning assets collected as part of or supporting illegal activity, according to a spokesperson for Ontario Premier Doug Ford.",
    "“They’re not interested in the ... liberal system we have here in Canada.”\nMajor Canadian trucker associations have disavowed the protesters, saying the vast majority of drivers are vaccinated and are continuing to work.",
    "Canada has absolutely ZERO jurisdiction over how we manage our funds here at GiveSendGo.”\nGiveSendGo has raised some $9 million for the “Freedom Convoy” and via the site’s “Adopt a Trucker” program.",
    "The site also encourages “prayers” for the controversial trucker “warriors” in their third week of protesting against vaccine mandates and other COVID-19 precautions at the U.S.-Canadian border.",
    "GiveSendGo has raised money for several far-right causes, and even for violent organizations, including the extremist Proud Boys, which is classified as a “terrorist” organization in Canada.",
    "A Canadian judge has issued an injunction blocking money for the anti-vaccine trucker protesters in Ottawa collected by the right-wing U.S. Christian fundraising site GiveSendGo.",
    "Advertisement\nBy late Saturday, blockade trucks on the bridge were gone in the wake of the police action, though protesters on foot remained, The Detroit Free Press reported.",
    "Representatives from GoFundMe will reportedly testify before a committee next week about what measures it has taken to prevent being a funding conduit to extremists.",
    "Advertisement\nTrucker protest leader Chris Barber ominously threatened that the judge’s order would “blow up in their faces” in an interview with The Ottawa Citizen.",
    "Yet the truckers were immediately hailed as heroes by right-wing American lawmakers and others, including Sen. Ted Cruz (R-Texas), Florida’s GOP Gov.",
    "(GiveSendGo has said \"Canada has absolutely ZERO jurisdiction over how we manage our funds\" and I guess Ontario Superior Court disagrees.)",
    "A report estimated that U.S. workers and businesses have already lost some $51 million in damaged commerce and wages due to the action.",
    "“Bring it on ... we are not going anywhere,” added Barber, who insisted there’s money coming in from other sources.",
    "The Ontario government petitioned for the order from Canada’s Superior Court of Justice, which was issued Thursday.",
    "Canada Unity, one of the organizers of the trucker protest, has called for the dissolution of Canada’s Parliament.",
    "It prohibits “any and all parties with possession or control over these donations” from distributing the money.",
    "They’ve been accused of harassment, even assault, and of ripping masks off the faces of area residents.",
    "Here's the wording of the injunction issued yesterday freezing GiveSendGo \"Freedom Convoy\" donations.",
    "The blockade choked off an already challenged supply chain to American automakers.",
    "GiveSendGo defiantly declared in response to the court order: “Know this!",
    "That’s when GiveSendGo stepped in."
  ]
}