{
  "id": 997,
  "mediaId": 2618,
  "date": "2022-02-15",
  "headline": "'I can't speak to that': Biden's Deputy Press Secretary Karine Jean-Pierre tells reporter THREE times to go to the DOJ when pressed on Durham's bombshell allegations Hillary spied on Trump when he was president and Biden knew about it",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/15/i_cant_speak_to_that_bidens_deputy_press_secretary_karine_jean-pierre_tells_reporter_three_times_to_go_to_the_doj_when_pressed_on_durhams_bombshell_allegations_hillary_spied_on_trump_when_he_was_president_and_biden_knew_about_it_79226.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rob Crilly",
  "authorUrl": "",
  "termIds": [
    5802,
    4905,
    5349,
    2378,
    3054,
    3035,
    6678
  ],
  "sentences": [
    "it may not be to late...America is waking up...and thanks to the Canadian truckers WE have seen communism first hand from Castro's little darling...Trudeau...as he lounges in the sun in the Caribbean refusing to do his job...\nWell after “Raggedy Ann” bails out to spend more time with her family, the media had better get used to Karine as chances are she will take over as Biden’s principal press secretary.",
    "China is right on schedule...they have corrupted most of Washington DC...they've masked small children so they will not learn the freedom that their grandparents gave to them...their schools teach them to hate one another...no American flags in their schoolrooms and no pledge allegiance to their country...BUT...",
    "It would be pretty hard for most Democrat aligned communications operatives to beat Karine out when it comes inclusion in the Democrat identity politics scheme of things along with Biden’s stated quest to place women of color in high level positions in his administration.",
    "We just want you have to stand in front of the American people and give an account for what you and your party have been doing for five years especially now that we know everything that was said was a lie created for the sole purpose to destroy a political enemy.",
    "As in accordance with leftist, progressive, and socialist Democrat identity politics Karine rings the bell on a number of those Democrat identity politics job qualification categories.",
    "You get the power and prestige and with that comes the obligation to the people of this country to answer questions truthfully on behalf of the agencies that are under your control.",
    "The American people despite you, your anti-American agenda, your attempt to lock us down and mask us up in order to steal our God given freedoms just to name a few.",
    "I suggest that Obama sell the property in Hawaii and find a country that does not extradite to the U.S. That is where he should build his new home.",
    "The American people want to hear from YOU but at the very least your spokesperson, not shuffled off to some other department.",
    "We still need to know what Stefan Halper, Joseph Mufsud, Azra Turk and Natalia Veselnitskaya were paid and who funded them?",
    "I refer you to the Department of Justice,\" The Peppermint Commie would have been able to speak volumes about that report.",
    "When Juan Williams brought it up on Bair's program, Bret cut him off short, essentially saying that was BS.",
    "What we know so far is the $1.04 million paystub from the Defense Department Office of Net Assessment.",
    "What is making the WH nervous is that once the dots are connected, Biden and Obama will be exposed.",
    "It wasn't spying, the information was accessible over the internet--good luck with that.",
    "She probably helped plan the spying during the time 0bama squatted in the White Hut.",
    "Yes - - they \"refuse to be drawn in\" - - just like that guy - - what was his name?",
    "Karine was born in Haiti, is an immigrant, is a woman of color and is a lesbian.",
    "I saw it last night on Bret Bair's program and then again in this article.",
    "Sure- Despicable Joe - - you dindu nuffin - - and doan know sheet!",
    "Don't think for one minute that it stops are Hillary and Brennan.",
    "You and your corrupt party deserve everything coming your way.",
    "And we didn't even know this office existed before this.",
    "Now I know why The Psak wasn't running the presser.",
    "She took a very convenient day off yesterday, no?",
    "Passing the buck is cowardly and reeks of guilt.",
    "My bet is; it wasn't Hillary, Bill or the DNC.",
    "May this revelation be but the first of many.",
    "FTA: \"Again I can't speak to that report.",
    "You can see the dim spin getting set up.",
    "This is just the tip of the iceberg.",
    "You got some ‘splainin’ to do, Joey!",
    "- - oh, yeah - - Pontius Pilate.",
    "You wanted the job, now do it.",
    "The bucks stops with you.",
    "Get used to it.",
    "Hey, Joey!"
  ]
}