{
  "id": 1166,
  "mediaId": 12,
  "date": "3/18/2022 12:00:00 AM",
  "headline": "Stacey Abrams, Brian Kemp and David Perdue each disclose net worth in millions",
  "image": "https://www.ajc.com/resizer/VDnhIKtn6BWFnjGwX0NUuoOvvHI=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/YKQTZ53N7VDUFLBLBPKYYDRI4I.png",
  "link": "https://www.ajc.com/politics/stacey-abrams-brian-kemp-and-david-perdue-each-disclose-net-worth-in-millions/PE7INLVWJNFQVJLBXV6RDMAFTE/",
  "sentiment": "-0.387",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    1951,
    2095,
    4325,
    265,
    428,
    2554,
    2555,
    2672,
    2782
  ],
  "sentences": [
    "Kemp's financial standing has improved since 2018, when he faced questions about his investment in Hart AgStrong, a struggling seed-crushing business in northeast Georgia that was on the cusp of financial ruin after an ill-fated expansion into Kentucky.",
    "In her most recent financial disclosure, Abrams reported roughly $320,000 in cash on hand and $1.8 million worth of real estate holdings, most of it a home she bought days before the general election in 2020 that's valued at $1.2 million.",
    "Brian Kemp's latest financial report reveals his wealth has grown by more than $3 million since he took office in 2019, thanks partly to a string of real estate holdings and business investments that appreciated in value.",
    "She's built a multimillion-dollar business writing books and appearing on the speaking circuit, according to a disclosure that shows she's earned more than $6.5 million since the beginning of 2019.",
    "The Republican filed paperwork that showed a net worth of roughly $8.6 million that included more than $4.6 million in various properties and a roughly $420,000 stake in a stone supply firm.",
    "His assets include a $464,000 stake in Cardlytics, a financial company at the center of a Justice Department investigation in 2020 after Perdue sold more than $1 million worth of its stock.",
    "Kemp had invested $750,000 in the company more than a decade ago and guaranteed $10 million in loans to Hart AgStrong  about twice the net worth he reported in his 2018 state disclosure.",
    "Abrams' finances came under the microscope in 2018, when she reported roughly $520,000 in assets that included her Atlanta townhouse and an advance for an upcoming book on leadership.",
    "What caught attention was her disclosure that she owed the Internal Revenue Service roughly $54,000 over a two-year span, a revelation that ignited attacks from the GOP.",
    "While she said deferring the tax payments in 2015 and 2016 to help pay her family's medical expenses wasn't the smartest move,? it gave her flexibility to support them.",
    "Fair Fight PAC has raised more than $100 million since then and has played a major role in bolstering Democratic Party efforts in Georgia and across the country.",
    "The disclosure showed Kemp earned roughly $730,000 in income from the company between 2019 and 2021, after losing $175,000 from his investment in 2017-2018.",
    "Rick Phillips, a well-connected financier, claimed in a 2017 lawsuit that Kemp failed to repay the loan he negotiated and guaranteed for Hart AgStrong.",
    "Perdue's fortune included roughly $17 million in cash on hand, a Sea Island estate valued at $2.4 million and an additional $21 million in investments.",
    "Rather than downplaying the topic in 2018, Abrams took the unusual step of speaking openly about her financial struggles on the campaign trail.",
    "In his latest financial disclosure, Kemp reported nearly $8.8 million in assets that included a $675,000 house in Athens and $270,000 in cash.",
    "And the Loewenthal Co.  a full-service literary agency  has paid more than $3.5 million since 2019 for books she wrote or is set to release.",
    "She disclosed that she served as executive director of the Southern Economic Advancement Project  which she founded  for the organization.",
    "Kemp settled the lawsuit days before he was sworn into office in 2019, and the company was sold to Perdue AgriBusiness months later.",
    "Georgia candidates for governor and other state offices faced a deadline this week to disclose the inner workings of their finances.",
    "Stacey Abrams\nFour years ago, Stacey Abrams' struggles with debt became a favorite Republican attack during her run for governor.",
    "She also listed receiving about $700,000 from the Roosevelt Institute, a liberal New York think tank, between 2019 and 2021.",
    "Though the report shows an 8% stake in the company with no value, his campaign said he no longer owns a piece of the firm.",
    "She reported earning more than $1.5 million over the past three years from the Harry Walker Agency, an elite booking firm.",
    "She did not report any income from Fair Fight, the voting rights group she founded after losing the 2018 governor's race.",
    "David Perdue\nFormer U.S. Sen. David Perdue reported a net worth of roughly $50 million in his financial disclosure.",
    "The Maryland-based firm is not linked to David Perdue, a former U.S. senator challenging Kemp in the GOP primary.",
    "As she wages a second bid for Georgia's top job, financial disclosures show that won't be an issue this time.",
    "Abrams now has a net worth of roughly $3.17 million that's mostly tied up in real estate and investments.",
    "He reported earning about $6 million from investments during his last four years in the U.S. Senate.",
    "She repaid the debt in 2019, closing off a potential weakness ahead of another run for governor.",
    "A second home she bought, in Stone Mountain, is for her parents, Abrams' campaign said.",
    "Here are some of the takeaways for Georgia's top candidates for governor.",
    "The investment had dogged Kemp throughout his campaign for office.",
    "In his 2018 disclosure, Kemp reported a worth of $5.2 million.",
    "Investigators closed the case in mid-2020 without charges.",
    "Brian Kemp\nGov."
  ]
}