{
  "id": 1921,
  "mediaId": 136,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "David Perdue's Chances of Beating Brian Kemp in Georgia Primary",
  "image": "",
  "link": "https://www.newsweek.com/david-perdue-chances-beating-brian-kemp-georgia-primary-1700963",
  "sentiment": "0.184",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Khaleda Rahman",
  "authorUrl": "https://www.newsweek.com/authors/khaleda-rahman",
  "termIds": [
    1489,
    1951,
    2095,
    2230,
    4325,
    146,
    571,
    2672
  ],
  "sentences": [
    "In terms of who will win the race overall, Kemp is Ladbrokes' favorite with 1/2 odds of victory (an implied probability of 66 percent), compared to 5/2 for presumptive Democratic nominee Stacey Abrams (an implied probability of 29 percent).",
    "\"Initially David Perdue opened a fairly strong favorite but the market may have placed an over emphasis on Trump's endorsement at first, in turn underestimating the chances of Brian Kemp,\" Ladbrokes spokesperson Alex Apati told Newsweek.",
    "Consistently Ahead\n\"Polling has consistently had Kemp ahead over the last few months and his price has shortened quite significantly in the last week, suggesting that a rerun of 2018's Kemp vs Abrams is the most likely outcome now.\"",
    "\"Despite the support of former President Trump, the odds on Perdue have continued to drift since the turn of the year and we now have him at 6/1 to be elected governor,\" a Betfred spokesperson told Newsweek.",
    "Perdue, who lost his Senate seat to Democrat Jon Ossoff in January last year, has 9/2 odds, with an implied 18 percent chance, of winning the May 24 GOP primary, according to Ladbrokes.",
    "The spokesperson added that \"once the election campaign really ramps up later in the year then I would expect the race to tighten and the odds between the two to become closer.\"",
    "\"First off, folks, let me be very clear tonight, the election in 2020 was rigged and stolen,\" Perdue said in his opening statement during a debate against Kemp on Sunday night.",
    "Perdue was recruited to challenge Kemp by Trump as retribution for the governor's refusal to go along with his demands to overturn Georgia's result in the election.",
    "Betfred's odds also favor Kemp holding off a primary challenge from Perdue, with Kemp and Abrams vying for the governor's office in a rematch of the 2018 race.",
    "The bookmaker also has 1/2 odds of Kemp winning a second term, while Abrams is priced at 11/4, giving her a 26.7 percent chance of unseating Kemp.",
    "\"Kemp has been ahead in all the polling and looks likely to win the primary and face off once again with Democrat Stacey Abrams in the autumn.\"",
    "The Trump-backed candidate has been leaning heavily on baseless claims that the 2020 and 2021 elections were stolen from Trump and himself.",
    "Kemp, on the other hand, has been given odds of 1/7 to secure the nomination over Perdue, with an implied probability of 88 percent.",
    "Brian Kemp to become the Republican nominee in Georgia's gubernatorial race, according to bookmakers.",
    "Perdue has 6/1 odds of victory, or an implied probability of 14.3 percent.",
    "Perdue is priced at 13/2, with an implied probability of 13 percent.",
    "Former Senator David Perdue is unlikely to beat Gov."
  ]
}