{
  "id": 3307,
  "mediaId": 233,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Pence will go toe-to-toe with Trump in Georgia as he announces rally with GOP Gov. Brian Kemp",
  "image": "https://www.gannett-cdn.com/presto/2018/11/02/USAT/572a1d7b-0d68-4c8f-803a-564377a1e646-AP_Election_2018_Pence_Kemp.jpg?crop=2612,1465,x0,y16&width=2612&height=1465&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/05/13/pence-rally-georgia-governor-brian-kemp/9759768002/",
  "sentiment": "0.238",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ella Lee",
  "authorUrl": "https://www.usatoday.com/staff/5338158002/ella-lee/",
  "termIds": [
    761,
    1078,
    1147,
    1284,
    1434,
    2095,
    2136,
    3103,
    428,
    2550,
    2672
  ],
  "sentences": [
    "\"The Vice President's leadership was instrumental in creating the most prosperous economy in American history, including here in Georgia, and his commitment to building a safer, stronger America represents the highest ideals of our party,\" Kemp said.",
    "In a statement announcing the May 23 rally, Pence called Kemp one of the most successful conservative governors in America.?\n\"Brian Kemp is my friend, a man dedicated to faith, family and the people of Georgia,? Pence said.",
    "I am proud to offer my full support for four more years of Brian Kemp as governor of the great state of Georgia.?\nTrump ticket:Donald Trump won Ohio for J.D.",
    "His latest show of support is the most recent of an apparent effort to distance himself from Trump and puts fractures within the Republican party on display.",
    "Brian Kemp on the eve of the state's contested Republican primary, putting Pence at odds with former President Donald Trump, who is fighting to defeat Kemp.",
    "\"We could not be more grateful for his friendship to our family and state, and we look forward to welcoming him back to the campaign trail in Georgia!\"",
    "Former President George Bush will appear at a Texas fundraiser for Kemp this month, and three Republican governors  New Jersey Gov.",
    "Kemp infuriated the former president when he refused to overturn Georgia's 2020 presidential election result in favor of Trump.",
    "In April, Trump's Save America PAC gave $500,000 to a super PAC devoted to preventing Kemp's reelection, Politico reported.",
    "Kemp remains an average of 22 points ahead of Perdue, according to Real Clear Politics' most recent polling.",
    "Doug Ducey  will rally for the Georgia governor, as well, the Atlanta Journal-Constitution reported.",
    "The Georgia governor celebrated his friendship with Pence in the statement announcing the rally.",
    "Trump endorsed Kemp's opponent, Republican Sen. David Perdue, in February.",
    "Former Vice President Mike Pence will headline a rally for Georgia Gov.",
    "Can he score victories in Pennsylvania, North Carolina and Georgia?",
    "The former vice president rallied for Kemp numerous times in 2018.",
    "Pence isn't the only Republican backing Kemp.",
    "Pete Ricketts and Arizona Gov.",
    "Chris Christie, Nebraska Gov.",
    "Vance."
  ]
}