{
  "id": 3375,
  "mediaId": 238,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Senate primaries to watch",
  "image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/C6LUACR7H5ESLKPB3FNVYFQ66U.jpg",
  "link": "https://www.washingtonpost.com/politics/interactive/2022/primaries-to-watch-midterms-2022/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    741,
    798,
    802,
    886,
    1133,
    1147,
    1568,
    1622,
    1901,
    2039,
    2095,
    2125,
    2303,
    3094,
    562,
    571,
    2707
  ],
  "sentences": [
    "While the race is largely on ideological lines, it is clouded by a current House Ethics Committee investigation into Newman following allegations that she offered a senior staff position to prevent an opponent from challenging her in the 2020 primary.",
    "While Trump has not endorsed in the race, he has criticized Brnovich and spoken positively of efforts by another candidate, Blake Masters, a venture capitalist close to entrepreneur Peter Thiel, to decry the certification of the 2020 results.",
    "Rep. Marjorie Taylor Greene's (R-Ga.) reelection bid was challenged in a lawsuit citing a provision in the Constitution that bars politicians from running for Congress if they have engaged in an insurrection or rebellion? against the nation.",
    "One of the leading contenders, Arizona Attorney General Mark Brnovich, is fighting to maintain his lead despite failing to repeat Trump's false claim that Biden won Arizona because of widespread fraud, for which there is no evidence.",
    "In Texas, Jessica Cisneros, a 28-year-old immigration lawyer, has forced Rep. Henry Cuellar (D) into a runoff after neither garnered enough votes to secure the nomination outright during the March primary.",
    "Levin decided to challenge Stevens rather than stay in his previous district after it was redrawn to be much more competitive, all but guaranteeing that his current seat will be seized by Republicans.",
    "This is the first election cycle following the process known as redistricting, the redrawing or elimination of congressional districts to reflect population shifts determined by the decennial Census.",
    "Miller is attacking Davis as a soft Republican after he voted to certify the 2020 presidential election results and establish a commission to investigate the attack on the Capitol on Jan. 6, 2021.",
    "), Tom Rice (S.C.), Dan Newhouse (Wash.), Jaime Herrera Beutler (Wash.), David G. Valadao (Calif.), and Peter Meijer (Mich.) are running for reelection and facing tough primary challenges.",
    "In Michigan's 11th Congressional District, the race between Reps. Haley Stevens and Andy Levin has divided the House Democratic caucus, with many women colleagues siding with Stevens.",
    "And we've had some experience with that in the past.?\nDemocrats are hoping to flip the seat of retiring Sen. Patrick J. Toomey's (R-Pa.) but must first decide between liberal Lt. Gov.",
    "In Illinois' 15th Congressional District, Trump-endorsed freshman Rep. Mary E. Miller (R) is challenging Rep. Rodney Davis (R) in the district he has represented for almost a decade.",
    "In Arizona, relitigating the 2020 presidential election has become the main issue of debate among five Republicans seeking their party's nomination to challenge Sen. Mark Kelly (D).",
    "Brian Kemp, who drew Trump's wrath after certifying President Biden's victory there in 2020, is being challenged by David Perdue, who lost his Senate seat in a 2021 runoff election.",
    "Rep. Madison Cawthorn (R-N.C.) faced a similar lawsuit, which was dismissed in March, yet Cawthorn still faces a difficult primary, with senior Republicans opposing him.",
    "Senate Minority Leader Mitch McConnell (R-Ky.) admitted that unacceptable? GOP candidates nominated during the primaries could keep his party from winning the majority.",
    "Former president Donald Trump recently endorsed fellow TV show host Mehmet Oz, who has faced backlash for living in New Jersey and for keeping his Turkish citizenship.",
    "Other races attracting interest feature young liberals challenging longtime incumbent Democrats who they believe have fallen out of touch with their constituents.",
    "While the general election determines which party represents a district or state, the primaries define the ideological and stylistic orientation of each party.",
    "But no group has received their ire more than the 10 Republicans who voted to impeach Trump for inciting the attack on the Capitol on Jan. 6, 2021.",
    "House primaries to watch\nTrump and his allies have made it difficult for any House Republican who has voted with Democrats over the past year.",
    "Three Democratic races in districts redrawn to lean more Democratic will test whether voters want a more moderate or liberal representative.",
    "), has an early edge over Milwaukee Bucks executive Alex Lasry, state Treasurer Sarah Godlewski and Outagamie County Executive Tom Nelson.",
    "In Illinois' 6th Congressional District, moderate Rep. Sean Casten (D) and liberal freshman Rep. Marie Newman (D) will face off in June.",
    "Lines are rarely redrawn to force two incumbents of the same party to face off in the primary, but it has happened in five House races.",
    "He faces stiff competition from former hedge fund manager David McCormick, who visited Mar-a-Lago in an effort to get Trump's backing.",
    "Kemp has led in recent polls and Perdue will need a big turnout from Trump voters if he hopes to prevail in the May 24 primary.",
    "Fetterman has picked up support as an unconventional candidate, a liberal who has made deliberate appeals to rural Democrats.",
    "Democrats in Wisconsin feel bullish about ousting Sen. Ron Johnson (R), but first they must determine who will challenge him.",
    "Perdue, with Trump's endorsement, has staked his campaign on perpetuating Trump's false claim of a stolen election.",
    "Gubernatorial primary to watch\nThe most closely watched gubernatorial primary is in Georgia, where Republican Gov.",
    "From an atmospheric point of view, it's a perfect storm of problems for the Democrats,? McConnell said last month.",
    "Both candidates are individually wealthy, and their race is expected to be one of the country's most expensive.",
    "John Fetterman, moderate Rep. Conor Lamb and liberal Malcolm Kenyatta in the May 17 primary.",
    "The Democratic race has been relatively smooth in comparison to the Republican contest.",
    "Cheney's race in particular is drawing national attention ahead of the Aug. 16 primary.",
    "A third candidate, Kathy Barnette, has brought additional volatility to the primary.",
    "Control of the Senate could be determined by which candidates the parties nominate.",
    "Four of the 10 have decided to retire, but the six others  Reps. Liz Cheney (Wyo.",
    "This dynamic is playing out in primaries in Texas, Nevada, New York and Illinois.",
    "Mandela Barnes, who is backed by Sen. Elizabeth Warren (D-Mass.",
    "It's a crowded field in the Aug. 9 primary, but Lt. Gov.",
    "But the MAGA squad is facing backlash of its own.",
    "A judge determined she could seek reelection.",
    "How could you screw this up?",
    "It's actually possible."
  ]
}