{
  "id": 4482,
  "mediaId": 238,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Discussing the gaps in 2000 Mules with Dinesh DSouza",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/17/discussing-gaps-2000-mules-with-dinesh-dsouza/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Philip Bump",
  "authorUrl": "https://www.washingtonpost.com/people/philip-bump/",
  "termIds": [
    801,
    1576,
    2095,
    2203,
    215,
    535,
    622,
    3310,
    2555,
    2672,
    2972
  ],
  "sentences": [
    "If you have someone whos working for a nonprofit organization, a 501(c)(3) thats focused on increasing voter turnout and doing ballot collection because they want to make sure people are voting, which is a fairly common tactic in places where this is legal  and was the case in Wisconsin in 2020 that there were people that encouraged people to go out and vote  when you have that happening, if people find out, oh, this particular thing was illegal.",
    "But if Im saying  its kind of like saying, you know, again, if you have a guy and he is within, lets even take your 100 feet measure, which \nDSouza: And you have a person, a suspect who is within a 100 feet of 10 dead bodies, but one dead body happened to be near a location where he could have had a plausible reason for going there but theres no plausible reason for being near all the 10 dead bodies, thats the key point.",
    "It was one of the first full articulations of a claim that has recently become a central part of the political rights efforts to undercut the election, thanks to conservative filmmaker Dinesh DSouzas featuring True the Votes allegations in his film 2000 Mules.?\nThe case presented by True the Votes Gregg Phillips and Catherine Engelbrecht to those Wisconsin legislators was not convincing, as I wrote last month.",
    "And the way he got busted is because  and I covered it at the time  he submitted a disproportionate number of absentee ballots in favor of a particular candidate in a congressional race in North Carolina where it stood out and people noticed, Hey, this is weird in this county.? Then, very quickly, people came forward, said, Yes, I did this for him.? They talked to local TV and so on, so forth.",
    "So the crux of your argument, and I think the thing thats really compelling to a lot of supporters of Donald Trump is that, Oh, the election would have gone the other way had this not occurred.? But is it not the case that you dont know that those ballots wouldnt just simply been submitted by people anyway and therefore counted, and therefore Biden would still win those states?",
    "And this chart shows the bullet traveling at this trajectory.? And then you say, How do I know your chart is accurate?? And then he goes, Me and my friend who are experts in this, we compiled a chart,? and then you say, What are your friends credentials??\nSo I guess what Im saying is that when youre applying the kind of extreme, I dont believe anything that you tell me.",
    "As I wrote in my assessment of the movie, the central claim developed by True the Vote and elevated by DSouza focuses on cellphone geolocation data that they used to identify people who they claim visited both nonprofit organizations and at least 10 ballot drop-box locations in one day  the mules.? They also obtained video surveillance footage of some drop boxes.",
    "But because its your guy, youre suddenly going to work to show, oh, no, they were all, They werent chasing Rittenhouse.?\nBump: Dinesh, the challenge here  and I hope youll forgive me for calling you Dinesh  the point here is you are making an affirmative case, which you have claimed elsewhere is sufficiently persuasive as to be somewhat definitive.",
    "I mean, if you have a serial killer that goes to five homes and murders people and leaves this DNA at all five places, but only one of the five homes has a video camera, is it reasonable to say, Why dont I have video camera of the serial killer at all five homes?? You dont because the other four didnt have a camera that was turned on.",
    "I have a whole bunch of sources, starting with the New York Times \nDSouza: Well, why dont we go with  let me just rely here on Chief Justice [John] Roberts in the Carpenter case, 2018, surveying the literature on geotracking  I think youll admit hes a fair and competent authority to be able to review whats out in the literature.",
    "DSouza: Well, they might have, but lets remember that what happened was that  I forget the name of the guy right now, the guy who was running as the Democrat  I mean, there was a major public furor that resulted in news articles, people starting to interview people, people trying to identify who might be involved in this.",
    "Now, the Georgia Bureau of Investigation and the Raffensperger team seems determined to follow up solely by chasing the whistleblower, a man who has already said, I dont want to be part of this.? They could easily go after the mules because True the Vote is happy to supply them with the cellphone IDs of all the mules.",
    "All I said is if you are making an affirmative assertion about someone having gone to multiple drop boxes and you provide zero evidence of it  besides one video of one lady, and then the word of Gregg Phillips who is known to have said dishonest things about the 2016 election  I dont know what to tell you, man.",
    "And so, you know, True the Vote, Raffensperger, others have said  if we assume that everything that what youre saying is true, that there were these people, they did do these pickups and drop-offs, and that they were being harvested in a way that violated the law in some states  those are still legal ballots.",
    "The first is that the way the whole investigation got started is that True the Vote had a hotline and they were approached by a whistleblower in Atlanta who said that he was dropping off ballots, he was getting paid $10 a ballot and he described that he was not alone, but he was part of a larger operation.",
    "And youre suggesting thousands of people just involved in the trafficking, so to speak, alone in these states  nothing has come forward besides one whistleblower you dont talk to in the film and then this other lady who makes a series of very broad claims in Arizona that we have no other context for.",
    "If I were able to convince you to your complete satisfaction that there were 2,000 people who were in the close vicinity of 10 or more drop boxes and five or more left-wing nonprofit organizations, would you agree that on that basis alone, there was something highly suspicious going on, yes or no?",
    "But if you have the DNA  and in this case, were talking about digital DNA  that places this guy at the crime scene in all five homes and then, moreover, the digital DNA shows that he arrived at home number three, lets just say at 2 a.m. in the morning, and you look on the video and there he is.",
    "Gregg Phillips from True the Vote, who is sort of acting as the narrator for a lot of these video snippets, says that he understands that this is happening because the people who are making these deposits have been told that the only way they get paid is if they take a picture.",
    "So the absence, my inability to  if this had been done properly according to the election rules and there was video surveillance on all the drop boxes, I am firmly convinced that a mule going to 10 different drop boxes would be seen on the video 10 different times.",
    "DSouza: Well, Im saying that I have the evidence  when I say Im,? Im speaking also, by the way, for True the Vote  we have the electronic evidence, which is decisive in itself, and the video evidence happens to completely correspond with the geotracking evidence.",
    "Its kind of like, you bring out a ballistics expert and he says something about the gun, and then youre saying, Prove to me that that particular gun has those exact qualities, even though thats uncontested in this debate.? The investigators accept it as true.",
    "Bump: When you show in your movie the people inside the Capitol, you use apparently real evidence that shows these big circles around them that are the margins of uncertainty around their position, and showed them very clearly in the middle of the building.",
    "You are suggesting that theres a bigger burden of proof on the GBI, not just Brad Raffensperger, but on state law enforcement in the state of Georgia, that we should assume that they are being dishonest in their presentation and not the Gregg Phillipses.",
    "What Im saying is that we didnt go into the whistleblower in part because True the Vote made it really clear that the whistleblower provided the information to initiate an investigation and did not want to be contacted directly by the authorities, okay?",
    "The quote is, I want to make very clear that were not suggesting the ballots that were cast were illegal ballots.? Thats Catherine Engelbrecht in Wisconsin saying that True the Vote is not suggesting that the ballots that are cast are illegal ballots.",
    "In March, though, the Wisconsin State Assemblys Campaigns and Elections Committee hosted two representatives of the conservative group True the Vote to hear allegations about the collection and submission of ballots in the 2020 presidential election.",
    "Bump: I think that the idea that the Georgia Bureau of Investigation is giving a pass to a guy who submitted six false absentee ballots, when obviously it would help Governor [Brian] Kemp and Raffensperger to be able to say, Hey, you know what?",
    "Because youre right: If they were just inside the door, the geotracking is not refined enough to be able to identify if they were in the building or not, and therefore they dont use that sort of information in order to obtain these indictments.",
    "DSouza: The only explanation Ive even heard is that these are people dropping off lawful family members ballots and you have not been able to provide any explanation for why such a person would, A, go to 10 more \nBump: Its not up to me!",
    "This is what caused True the Vote to then say, All right, lets try to figure out a way in which we can map out and track and perhaps figure out the scale of this operation.? And then they got the idea of doing this through geotracking.",
    "DSouza: What Im saying is if youre following  if youre making a blue line of someone going through time, right, if they walk by the drop box, you will have a smooth line of somebody going right by the drop box and continuing onward.",
    "I would love to see these guys arrested and charged, and lets see what they say and well see if youre right or Im right.?\nBump: So, Dinesh, you are saying that you are not trying to make an affirmative case that this fraud occurred.",
    "How do I know that your numbers correspond to that exact location on the map??\nDSouza: The argument there is that whenever youre dealing with any kind of expert testimony, you can always push the investigation one step further.",
    "Now, first of all, I say to myself  and, again, Im thinking about this just as an intelligent individual surveying the situation  youve got all these nonprofits deeply embedded in the inner city, these activist organizations.",
    "Bump: Lets take a step back  my understanding also is that the Georgia Bureau of Investigation was provided with the cellphone IDs because they had these spreadsheets of data that they were provided, I think, in October 2021.",
    "Gregg Phillips called this thing organized crime.? You use words like stash house? and ballot trafficking,? which imply criminality  which, you admit yourself in this conversation, you dont have the evidence to back up.",
    "So I think its a completely fallacious assumption that when theres paid ballot trafficking involved, that somehow these legal votes remain legal, even though it paid mule operation is executed to deliver these ballots.",
    "And hes a really good example of the point you were just making, that, yes, you would love to see these people come forward to say this happened, but theres been nothing that has come forward to suggest this happened.",
    "DSouza: I think that youre doing a willfully ambiguous reading of this because, number one, if there was a picture of one guy in the movie who took a photo, I agree that that would be open to multiple interpretations.",
    "Youre welcome to try to take it apart, and a court will have to examine this kind of thing in a completely different way.? But just as you say my evidence is not in a sense sufficient for a court, you think yours is?",
    "Bump: I dont know that I would say it was highly suspicious, but I would certainly be curious and I would seek out people who were actually participating in this alleged scheme and try and figure out whats going on.",
    "But theres a big difference between being able to say someone is inside the U.S. Capitol  a very large building in a very isolated location  than it is to say they were sitting at a particular desk in that building.",
    "They have this exact data and, in fact, many of them inside of the GBI and inside of Brian Kemps office and inside of Raffenspergers office are very eager to try to fight back and push back against True the Vote.",
    "Georgia is in a position where they are holding to two contradictory positions: their original position, essentially echoing The Washington Post, safe and secure election, most secure election in history, right?",
    "So, again, the argument that this is all illegal and could overturn the election, which, again, I think is a selling point for a lot of Trump fans, is based on the numbers that you flashed up on the screen.",
    "You show at one point a big map of someones purported activity, which you say is then a smoothed-out pattern of life,? which means that it doesnt actually necessarily represent every stop the person made.",
    "And that this was the so-called new standard for how they had to get paid  even though we also see this footage of the woman with the gloves, who is voting in January in Georgia but doesnt take a picture.",
    "They said, Just because these guys went to 10 or more drop boxes, it doesnt mean that they necessarily were committing crimes.? So thats a whole different thing from saying they didnt go to 10 drop boxes.",
    "Im simply saying that there are 10 different places that they could have gotten these fraudulent ballots and theres no way that I can see for all these legal ballots to end up with these organizations.",
    "And even though Im a legal voter and I filled out the form properly, the fact that I have, in a sense, bribed somebody to drop that ballot off makes that an illegal vote that must not be counted.",
    "I think its remarkable you accuse me being willfully ambiguous here, given that literally the entire crux of your argument with these mules is being ambiguous about the information that you have.",
    "And the context of it  what happens before and what happens subsequently and the broader pattern of why these people are there and what theyre there for  makes it really clear what was going on.",
    "But the prosecution tried to take each individual fact, like in this particular scene of 10 seconds  you cant tell if theyre chasing him or if theyre just running in the same general direction.",
    "The movie focuses on a few snippets of that footage, including segments showing a guy who rides up on a bike (referred to as bike guy?) and a woman wearing latex gloves as she casts her ballot.",
    "But here is the key point, which is raised by Gregg Phillips and is open to refutation: His argument is the gloves werent present in the 2020 election and only emerge in the runoffs in Georgia.",
    "McCrae Dowless is cited twice in the movie as an example of how election fraud can take place, both in the beginning and by Hans von Spakovsky as an example of how this fraud can take place.",
    "The whole point is that if you touch something thats contaminated, you then get rid of the glove so you dont contaminate your own car door or touch your face or something along those lines.",
    "DSouza: Im making a case that is completely persuasive to an independent observer who is not clouded, who is not trying to play defense attorney as you are for the Biden administration.",
    "We worked with True the Vote, these are good folks, vote for us in the primary in the upcoming weeks.? Obviously, they have also a political motivation to actually agree with you here.",
    "Youre making assumptions about what this shows and pulling out these examples of people that you say showed up at these drop boxes, but you dont actually tie those two things together.",
    "Theyre a conservative organization.? And Im saying by the same token, youve got to realize that, by and large, bureaucratic establishments protect their own institutional authority.",
    "And what Im saying is, Okay, lets say thats true.? The question is this: Once you have paid ballot trafficking enter the process, does a legal vote nevertheless remain a legal vote?",
    "You would say the following, then to me, Dinesh, you put up a sea of numbers on the screen, and then you produced a map and you pinpointed the guy and you showed the guy over there.",
    "And no one is claiming that when you organize an operation in Atlanta and another one in Phoenix and another one in Detroit, that the operations are going to be precisely identical.",
    "I mean, obviously, theres a big difference between saying  you dropped to three, but then you also vastly increased the number of mules, so therefore increased the number of votes.",
    "There are all sorts of reasons people could go to a library, including being an employee for the library, including being employees of the county who are going to the drop boxes.",
    "And so youve got to look at their actions and statements in the context of the fact that any investigation exposes the deficiencies of the sheriff conducting that investigation.",
    "DSouza: Okay, so lets go slow, because the sheriff in Yuma has just opened up an investigation based upon the exact evidence provided by True the Vote and unfurled in the movie.",
    "And in fact, different jurisdictions encouraged people to do that because they understood that it would send the perception that everyones voting and therefore increase turnout.",
    "What Im saying is investigators who study this can tell the difference between taking a photo of yourself in front of the ballot box and taking a photo of the ballots going in.",
    "And the geotracking is being used to pinpoint where the accused was, to claim that he was inside the door of the Capitol as opposed to, lets just say, within a 30-meter radius.",
    "And quite frankly, if all of this were really innocent and theres no problem in paying people to deliver ballots, thered be no reason to overturn the North Carolina election.",
    "So I want to start by asking: Do you have evidence besides Phillips making that assertion that that is true, that these people needed to take a picture in order to get paid?",
    "So lets be very clear though, because you are making a very broad claim about broad illegality in multiple states that is dependent on our assuming that this data is valid.",
    "[I edited out a question I posed to DSouza about a panel of conservative pundits included in the movie, all of whom worked for Salem Media Group, one of the films funders.",
    "But I want to go back to this issue of taking pictures of the ballot, because this bike guy goes up to the drop box, inserts the ballot, steps back, takes a picture of it.",
    "Lets take, for example, California, which has the most liberal vote harvesting law in the country, where Im allowed to go to my neighbor and say, Listen, heres my ballot.",
    "Even when we estimated the number of ballots that were dropped off by the 2000 mules, first of all, we started with an assumption that there were only 2,000 mules, right?",
    "DSouza: Yeah, what we do is we go in housing projects and collect peoples ballots and then pay mules to deliver it.? I mean \nBump: Lets talk about McCrae Dowless, right?",
    "[I edited out a question about when True the Vote began doing their research, which DSouza wasnt able to definitively answer, though he said it was prior to July 2021.]",
    "DSouza: There actually is a way to know that, but it does require a pretty sophisticated ability to look more closely at video that is shown very broadly in the screen.",
    "And yet, in your film, you do not show one single person for whom you present geotracking data placing them at multiple drop boxes, much less doing so on multiple days.",
    "Not only do I disagree, I found examples of people taking photos of that exact same drop box, because they were just showing that theyve gone to the drop box to vote!",
    "So what Im saying is Im hoping that [Attorney General Mark] Brnovich in Arizona or Raffenspergers office in Georgia or the guys in Philadelphia will dive into this.",
    "Lets just say the average isnt five but four \nDSouza: No, because what Im saying is  lets just say, for example, someones talking about counterfeiting money, right?",
    "So youre literally playing ballistics expert, so-called, when, A, you dont know anything about ballistics and, B, no ballistics expert is saying what youre saying.",
    "DSouza: Were merely assuming that there is no rational reason for someone, let alone in the middle of the night, to make more than 10 trips to mail-in drop boxes.",
    "People are wearing gloves because they are concerned about perhaps touching the drop box and thats why theyre wearing gloves so as not to contaminate their hands.",
    "Because thats what the geotracking  look, the Georgia Bureau of Investigation is perfectly  they have not contested that True the Votes geotracking data is valid.",
    "And yet they seem to insist that weve got to go find this whistleblower! So I think  I mean, this is open to debate  are they conducting a serious investigation?",
    "Bump: I saw that the FBI  I saw an online thing, I was not able to validate this  apparently was trying to use fingerprint evidence to track down other ballots.",
    "But what Im getting at is, as with GPS and as with geotracking, an article circa 2016 or 2009 is not going to give you an idea of what geotracking can do today.",
    "DSouza: And frankly, if these are that these organizations had a nationwide campaign of collecting other peoples ballots, Id like them to come out and admit it.",
    "Bump: Did you see evidence that each of the people who you saw in the video going to drop boxes was shown, through geotracking data, to go to other drop boxes?",
    "Bump: I want to start with the bike guy.? So this is, in the movie, a guy who is shown coming up to a drop box outside of a library late at night in Atlanta.",
    "Bump: What Im saying, though, is that Brad Raffensperger asserts that if someone collected a bunch of votes that were legally cast, theyre still legal votes.",
    "Im saying that the bike guy  the sole evidence presented for the guy being a, quote, mule? in your movie is: A guy goes up to a drop box, deposits a ballot.",
    "But it can be summarized fairly succinctly: DSouza admits his movie does not show evidence to prove his claims about ballots being collected and submitted.",
    "An ankle bracelet can tell when youre walking down the street or when youre on your property, but its not going to be able to tell you which room youre in.",
    "He says the best estimate here is about a 30-feet margin and thats a really, really wide margin, according to \nDSouza: But hes wrong and Ill tell you why.",
    "DSouza: Well, we do  I put out on social media that we do have video of the same guy on more than one occasion at the same drop box in a different outfit.",
    "We are told by someone who is trying to make a case  who has lied to us in the past about this exact issue  that they have the evidence that this exists.",
    "We dont have specific location data which shows these people doing anything besides coming within 100 feet of a library where there has to be a drop box.",
    "In some ways, I think geotracking is more powerful evidence than video, for the same reason that DNA evidence is more powerful than eyewitness evidence.",
    "But that cellphone, the fact that that cellphone was at that drop box at that particular moment on that day is, I think, not open to rational dispute.",
    "DSouza: First of all, no movie by itself is the, quote, case for the prosecution.? What the movie does is its a spur to the prosecution to do its job.",
    "So I agree, if someone is watching the movie, theyre not able to tell  if somebody is holding a sheaf of ballots, lets say  is that two or five or 10?",
    "And so when something comes up thats going to make them look bad, Im saying institutional forces tried, by and large, to make that something go away.",
    "Bump: You are assuming that because this person went to these 10 places, youre going to find dead bodies, even though no dead bodies have turned up.",
    "But if only one of those drop boxes have video, you cant then fault me and say, Wait, why cant I see more video?? Because the states didnt take it.",
    "He claimed he had millions of illegal ballots that were cast in 2016, something that Donald Trump then elevated  he never offered any proof for it.",
    "There are ways to do this to figure out the answer to these questions, which you show absolutely no evidence in the film of even trying to answer.",
    "I mean, Gregg Phillips said that when he turned over data to the GBI, the GBI used the data to unmask his analysts instead of unmasking the mules.",
    "Now, what Im saying is this: If they were taking photos of themselves, you could then argue theyre taking a selfie to demonstrate that they voted.",
    "Gregg Phillips is not someone whos credible on these issues, and his word is the only word were given that the bike guy went to other drop boxes.",
    "Now, happily, we have the cellphone IDs of all the mules, so we can unmask them  which is to say we can get their names, we can go talk to them.",
    "Bump: So the national average that you use, the five ballots per, is based on a review of some ballot boxes that were monitored in some states.",
    "One is I think you will agree that geotracking can clearly tell the difference between someone who is in motion and someone who is stationary.",
    "A lot of your defenders are trying to create this straw man, suggesting that I or other critics reject broadly the idea of using geotracking.",
    "If this were 2016, right, and The Washington Post published this expos on how Trump stole the 2016 election, there would be a massive furor.",
    "But second of all, you are again basing this on the assumption that this person is a quote unquote mule,? which you provide no evidence for.",
    "Theyre based upon taking an average of what  they based upon the observed videos and using those videos to develop a sophisticated estimate.",
    "But I think its quite obvious from the footage itself that theyre taking photos of the ballots going in, and thats a whole different matter.",
    "DSouza: And what youre asking me to do is unfair, which is youre asking me to unfurl that geotracking evidence, mule by mule, in the movie.",
    "And unless Im mistaken, the state of Georgia asked True the Vote to provide information about this whistleblower, which they have not done.",
    "Lets explore the idea that there are legal votes that are being maybe delivered in the illegal way but that doesnt make them illegal votes.",
    "DSouza: Now, whenever theres something that you dont have, you always have to ask: What is the significance of you not having this, right?",
    "You can obviously tell there are many ballots, as we showed with video, where people are putting in ballot ballot, ballot, ballot, ballot.",
    "The nonprofits, by the way, are forbidden by IRS regulations from engaging in any partisan electioneering for any candidate or any party.",
    "Its a blue line that comes to a stop and then it turns around, and the person obviously goes back to that car or wherever they came from.",
    "DSouza and I spent an hour (interrupted by occasional technical glitches) discussing his film and the evidence provided by True the Vote.",
    "DSouza: Well, when were presenting this evidence, were showing sometimes different things to draw different types of significance, right?",
    "The assertion is made by Gregg Phillips that this guy then went to other places and other drop boxes, but no evidence for that is shown.",
    "DSouza: Youre wrong because this video is taken in a place where there are authorities involved, who are looking into this exact matter.",
    "You could be touching all kinds of stuff, so if youre really paranoid about covid, the question becomes, is that a normal way to behave?",
    "So what Im getting at is that  usually when there is some kind of a criminal operation, it doesnt get busted until people start talking.",
    "And youre telling me that Brad Raffensperger, sitting in his office and twiddling their thumbs, knows that those are all legal ballots?",
    "So I think youre doing what I would call armchair theorizing.?\nDSouza: It seems to me that maybe they were trying to record themselves.",
    "Obviously, this was something disruptive to his own family, as you know, that Mark Harriss own son testified in the eventual hearings.",
    "Did they go door to door in housing projects and ask people to request absentee ballots that were then mailed to the activist center?",
    "Im going to go give it to this left-wing organization, so they can hire mules to deliver these ballots.? Okay, thats your assumption.",
    "Did it concern you at all that they had recently been sued by a large donor for not having generated any evidence for election fraud?",
    "So sometimes are there sometimes at public library forms you can pick up, tax forms on a little table in the lobby, things like that.",
    "Im simply saying that, just as Gregg Phillips, who works for a conservative organization, True the Vote  you can say, Wait a minute.",
    "DSouza: So we say in the movie very clearly that True the Vote set a high bar for who qualifies as a mule in their search algorithm.",
    "They wouldnt open up an investigation into ballot trafficking, Raffensperger himself wouldnt do that, if he thought, You know what?",
    "True the Vote presented its claims to both the Georgia Bureau of Investigation (GBI) and Secretary of State Brad Raffensperger (R).",
    "There are things that you cant do in a movie that are nevertheless being done on the ground that are part of the research process.",
    "There are lots of ways to present nonvisual information in a visually striking way, that could have included having conversations.",
    "I mean, these are all, and Id say, not just possibilities, because voter fraud cases, by and large hinge on these kinds of things.",
    "So I dont think that all these all these guys who are paid by Dowless just suddenly had a pang of conscience and all came forward.",
    "Bump: It makes clear that you dont know how many ballots were theoretically dropped by each of these mules in each of these stops.",
    "Its possible that one drop box is near a library, but you have to admit that drop boxes are not only points in front of libraries.",
    "How come you havent gone into these stash houses and found out who these mules are?? The answer is, that is the logical next step.",
    "And then you notice that when we did the broader look, we dropped the average to three, to make it an ultraconservative estimate.",
    "However, it is not the position of, for example, Brad Raffensperger in Georgia, who has said \nDSouza: I think it is his position.",
    "Youre saying that Brad Raffensperger is saying that if they were legal votes and they were merely collected for drop-off, right?",
    "[He] says that geotracking is about as accurate as putting an ankle bracelet on somebody and following their movements that way.",
    "This is the point at which I point out that Gregg Phillips misrepresented wildly the extent of voter fraud in the 2016 election.",
    "So theres a difference between going to a point  so, see, if you dont agree with me on this, this is basically geotracking 101.",
    "What do you think that this geotracking evidence would look like, and how did you how do you expect me to show it in the movie?",
    "There are all sorts of explanations here which have people going to libraries \nBump: Were talking about being within 100 feet.",
    "Number two, the CDC, as you know, is using geotracking, in a pretty broad way, to try to verify people are social distancing.",
    "Brad Raffensperger, at this point before the investigation, does not know, does not know if and how much money changed hands.",
    "Bump: The last point I want to discuss: Your movie tries to make the case that the election results themselves hinge on this.",
    "The entire conservation is transcribed below; it has been lightly edited, with particularly interesting passages highlighted.",
    "DSouza: First of all, True the Vote submitted reports  in fact, theyve done more than one  to Georgia long before the movie.",
    "So I have to admit that my information from that comes from True the Vote and also from the Georgia reports, which Ive read.",
    "But when you start seeing a kind of pattern of people taking photos  and now heres the key point \nDSouza: Not of themselves.",
    "He explained that Salem had suggested it would be good to include their hosts, and DSouza explained how he worked them in.]",
    "I mean, for example, you had this case of the guy dropping off multiple ballots at the drop box in the middle of the night.",
    "Georgia reached out to him, found out hes just dropping off ballots for his family members, which hes allowed to do, right?",
    "When someone puts out a narrative, the narrative has got to be seen in its totality and in its totality, what does it show?",
    "DSouza: Okay, so you keep coming back to the fact that, quote, that Im not showing the geotracking evidence? in the movie.",
    "They may not use them to obtain the indictments, but they are using them in the cases themselves to pinpoint these people.",
    "What I recognize is that Phillipss data has been shared with multiple authorities in Wisconsin, in Arizona and in Georgia.",
    "So right away this blows out of the water, the kind of nonsense that says these are people dropping off family ballots.",
    "And the whistleblower laid out the scheme, and the scheme then became the hypothesis or template for the investigation.",
    "This is all very suspicious and what we need to do is raid the stash houses and what we need to do is arrest the mules.",
    "If you go back and look at the interviews, they stepped forward because they didnt know what they were doing was wrong.",
    "So its going to be a little embarrassing for him to say, I was the sheriff and a big heist was going on under my nose.",
    "They have a different level of sophistication in approaching this than me sitting in a theater and watching the image.",
    "Now, first of all, it is a little odd when people immediately dispose of the gloves because most people dont do that.",
    "You could very easily say, So we have this person at this point in time here  you could superimpose on a Google map.",
    "Im not saying investigators are needed to show that there was corruption on an organized scale in the 2020 election.",
    "DSouza: First of all, as we know, this is an operation thats been conducted in five different places simultaneously.",
    "Theres an emphasis, for example, on video because video is visual and you can see whats going on with your two eyes.",
    "We have a lot of images of people taking photos, particularly when we show the expanded screen with multiple mules.",
    "My investigators will provide the evidence down the road, so please find my client guilty.? Thats not how it works!",
    "In the McCrae Dowless case, it wasnt the case that people spontaneously came forward, because youve reported on it.",
    "If it was illegal in their state, then all of a sudden theyre like, Oh, I didnt know.?\nBump: Its an important one.",
    "Hes basically saying hes saying \nBump: He said these are still lawful ballots that have been handled fraudulently.",
    "So he says explicitly, in an interview, that they were lawful ballots still and therefore should still be counted.",
    "DSouza: Yeah, sometimes you can take the books inside and sometimes they have a return place so you can put books.",
    "My guess is that the True the Vote investigators can figure that out because theyre able to zoom in on the photo.",
    "But I also want to point out that this bike guy, theres no evidence that he even submitted more than one ballot.",
    "So, for example, you could have been outside the door yelling, or you could have been five feet inside the door.",
    "Were being told it was found in the general vicinity of the house, which could have any number of explanations.",
    "So were talking about, you know, 400,000 legal votes that somehow came into the possession of these nonprofits.",
    "And similarly, geotracking establishes unmistakably not that you were there, but that your cellphone was there.",
    "DSouza: This is the problem is that there is a difference between what a movie does and what a law court does.",
    "First of all, there are fact-checking sites that say that people are wearing gloves because it's really cold.",
    "The question then becomes: Did somebody counterfeit a $100 bill, or is counterfeiting going on a large scale?",
    "If you were dropping off the ballots of your family members, would you need to go to ten drop boxes to do it?",
    "During the [Kyle] Rittenhouse case, you had an investigator say, The antifa guys werent chasing Rittenhouse.",
    "Bump: Hes literally the secretary of state of Georgia, Im going to give him some credence on law in Georgia.",
    "But if I go to my neighbor and I say, Listen, Ill give you $50 if you drop my ballot off.? Thats not legal.",
    "Right away, that suggests that there is institutional resistance to the data while not contesting the data.",
    "You can see, I mean, obviously, you can tell if there are more than one ballot and they fall on the ground.",
    "The second thing is  now we get to the geotracking  its obviously very misleading to call this digital DNA.",
    "I cant take the True the Vote report to the state of Georgia and include all that information in the movie.",
    "We have this assertion being made by Gregg Phillips about what is happening with this picture being taken.",
    "You didnt show me proof that it traveled at this velocity.? So then he goes, Okay, look, this is my chart.",
    "DSouza: I mean, literally, people would be demanding this guy be physically yanked out of the White House.",
    "If the investigators come up and say, heres evidence of rampant ballot harvesting ?\nDSouza: Wait, hold on.",
    "If youre using your court analogy, you have to prove guilt and you dont have the evidence to prove guilt.",
    "Clearly, if you have their cellphone data, you know where they live, you could have knocked on the doors.",
    "So lets just take, for example, Ill come back to the legal votes, but lets take, for example, the gloves.",
    "Not many people spend time watching hearings hosted by state legislative committees, for obvious reasons.",
    "And you also have to remember that surveillance footage is not taken by my cinematographer, for example.",
    "Bump: You just said its obvious to anyone who watches the movie because you present an incomplete case.",
    "Did you see that in that indictment there was an issue of fingerprint evidence on the part of the FBI?",
    "DSouza: They use geotracking to say this guy was inside of the door as opposed to outside of the door.",
    "And what Im saying is the bike guy is presented  as are the other cases, by the way  as mere examples.",
    "McCrae Dowless in North Carolina who got busted collecting ballots and submitting on behalf of people.",
    "[In the film, Phillips claims that the gloves were introduced following an investigation in Arizona.]",
    "Because after all, if you take the gloves and toss them out, youre going to be touching the car door.",
    "I mean, weve released a movie that we hope will be the impetus for exactly the same kinds of things.",
    "So you can say its a more conservative estimate \nDSouza: So our mode of argument is like this, okay?",
    "I mean, common sense would tell you that, but its obviously corroborated by an actual whistleblower.",
    "You are saying  and, actually, you havent actually said yet  that this came from the whistleblower.",
    "I think it makes perfect sense to remove latex gloves if youre actually worried about coronavirus.",
    "So for example, lets consider the possibility that these are legal votes that have been delivered.",
    "So some of the questions you are raising \nDSouza: Hold on, they can be answered decisively, right?",
    "Bump: Geotracking can be accurate to within six feet, but in normal use-case scenarios, it is not.",
    "DSouza: I mean, no, we have cases of people who put a minimum of 10 ballots, shown on the screen.",
    "And they can interpret taking photos of ballots very differently from taking a photo of yourself.",
    "They were merely running in the same direction.? Now it is possible to have that interpretation.",
    "And the reason they experience fear is theyre facing more risk on that side than in not talking.",
    "But in the places we do, lets identify some of these mules and lets show them doing their thing.",
    "DSouza: You are trying to play defense attorney and find holes in my theory and I understand it.",
    "And I just dont understand why we should take your word for it and Gregg Phillipss word for it.",
    "If you were within 100 feet of a drop-box location \nDSouza: I have two observations about this.",
    "Money is critical here because this money is the difference between harvesting and trafficking.",
    "You have scenes that are obviously acted of people doing ballot drops, that are dramatizations.",
    "And thats critical because I would say that paid ballot trafficking is illegal in every state.",
    "The only evidence presented is a claim that hes carrying multiple ballots, which is unfounded.",
    "This was obviously not an election overturned by a court but overturned by an election board.",
    "Now you recognize that a lot of people took photos of themselves voting in the 2020 election.",
    "At that Ponce de Leon library, the exact same one that were talking about here in this movie.",
    "Bump: But with all due respect, this is exactly what youre doing with this geotracking data.",
    "Now, I read very carefully the response of the Georgia investigators to True the Votes data.",
    "Youre demanding video evidence when you know that there are whole states that took no video.",
    "For example, a ballistic expert says the gun traveled, the bullet traveled at this velocity.",
    "You never actually prove or show any evidence for what you claim is fundamentally happening.",
    "There are other states that took video, but the camera is not even pointed at the drop box.",
    "Bump: I understand his reason  he claims there was this case that involved fingerprinting.",
    "But we can set this aside, because even True the Vote doesnt claim they get that accurate.",
    "And the purpose of the video is to show, for example, someone taking photos of the ballot.",
    "So the first step of this investigation was not the geotracking  it was the whistleblower.",
    "So you tell me, if geotracking is not accurate to within six feet, how would you do that?",
    "I dont believe Gregg Phillips knows how to do it.?\nBump: I didnt say any of those things!",
    "Georgia reached out to him and to their complete satisfaction  !? See, thats not my view.",
    "We have to put this into really slow motion because, as you know, these laws are complex.",
    "He then goes to some drop boxes and he puts a few here, one there, eight here, 10 there.",
    "First of all, I take issue with your assertion that someone would leave their gloves on.",
    "Im not going to judge your filmmaking; I just dont accept that necessarily as an excuse.",
    "The way I look at these things is: I always look at which explanation makes more sense.",
    "And I think the way to look at it  and again, this is the case of any narrative, right?",
    "And thats according to the documents from the GBI, the Georgia Bureau of Investigation.",
    "In fact, theres no reason to open an investigation if its invalid; its obviously valid.",
    "And we admit freely in the movie that its not possible to reverse-engineer the process.",
    "Now, how they did that is the subject of the necessary next step in this investigation.",
    "And as a reporter, I think you wouldnt be naive enough to not see that thats the case.",
    "They put these geofencing around these drop box locations  they use a 100-foot radius.",
    "But the strength of the video evidence is it is supported by the geotracking evidence.",
    "Did the whistleblower say that they were paid only if they took photos of the ballots?",
    "Why do you think he has more than one ballot when hes doing that in the first place?",
    "DSouza: You have a guy whose phone is at a location on a given date at a given time.",
    "That is the entire amount of evidence that is presented beyond Gregg Phillipss word.",
    "I dont even know if he knows about it to this day, so its not relevant to the movie.",
    "Where does the estimate of five absentee ballots per quote-unquote mule? come from?",
    "Now, in some cases, I agree: You cannot tell if it is if it is one or many ballots.",
    "So theres a big difference between walking by a drop box and walking to a drop box.",
    "DSouza: You are attacking the case one way and Im saying, Listen, Im making a case.",
    "I looked and I saw that later in the \nDSouza: Did you see that in that indictment?",
    "And the reason is that the process has been corrupted with the inclusion of money.",
    "Apparently, Eshelman wanted them to file certain lawsuits early on in the process.",
    "DSouza: Let me give you an analogy, and Ill bring it home to this particular case.",
    "Youre asking, Show me proof that these guys were paid.? And I say, You know what?",
    "Now, unhappily, the majority of the mail-in drop boxes did not have surveillance.",
    "It makes a huge difference whether you are inside or outside the building, right?",
    "All we know is these ballots were obtained or curated at these activist centers.",
    "DSouza: In other words, is it a matter of $100, $1,000, $1,000,000, $10 million?",
    "Raffensperger, of course, has been on public record: This was a secure election.",
    "In October, the GBI said it didnt find sufficient grounds for an investigation.",
    "I will admit this conversation will read more easily if you have seen the film.",
    "And Im just going to leave that there and let readers make their own decisions.",
    "I dont really want to deposit my own ballot or even give it to a family member.",
    "Bump: So heres what I would say: That is not analogous for a couple of reasons.",
    "Well, thats the search criterion that dictated who were going to be looking at.",
    "There are all sorts of reasons to walk up to a library, to drive by a library.",
    "When you go to the public library, do you have to take the books inside or no?",
    "You could do all sorts of cool aesthetic tricks with it ?\nDSouza: But hold on.",
    "No, they came forward when they realized: My face is going to be in the paper.",
    "The movie is driven in part by decisions about what makes the movie work well.",
    "Now, in that particular image, you cant see if its one ballot or five ballots.",
    "And what Im trying to say is that is putting impossible demands on the movie.",
    "You then say, Well, you know, maybe investigators will come up with evidence.",
    "But you dont recognize that youre doing the same thing youre accusing me of.",
    "Because first of all, lets return to  now youre free to disbelieve the data.",
    "All the mules being counted under that rubric went to 10 or more drop boxes.",
    "Lets assume, and we can look at that in a minute, these are all legal votes.",
    "I readily agreed to discuss the film with him from a position of skepticism.",
    "DSouza: Yeah, well come back to that, but lets talk about the whistleblower.",
    "Or is he going to try to make sure that the investigation doesnt go further?",
    "This year, Raffensperger indicated he would evaluate True the Votes claims.",
    "And thats going to give that investigation a bit of an ambiguous character.",
    "So we used the estimate of five, and then we lowered the estimate to three.",
    "Ive never seen anybody in the GBI or anyone say that this data is invalid.",
    "Bump: If we are taking the movie at face value, my point is totally valid.",
    "If I did that, it would be open to the exact same objection you just made.",
    "Then the second explanation is that these gloves are an artifact of covid.",
    "You are making these broad assertions \nBump: So for example, the bike guy.",
    "So you have direct testimony to the effect that this is a paid operation.",
    "But what Im saying is this: Were talking about 10 or more drop boxes now.",
    "But nevertheless, somehow a bunch of legal voters decided, You know what?",
    "DSouza: Honestly, Mr. Bump, lets apply a little common sense here, right?",
    "Clearly, this is not someone whos taking a photo of the ballot going in.",
    "Not only that, the bike guy didnt take a picture of the ballot going in.",
    "The context of the movie is to explain that thats the search criterion.",
    "So I appreciate your saying that youve not spoken to the whistleblower.",
    "As it turns out, this was not a fight about geotracking or any of that.",
    "The only purpose of going to a mail-in drop box is to drop in a ballot.",
    "If you wear gloves, you go back to your car with the gloves on, right?",
    "DSouza: So the library explanation works in that one isolated context.",
    "DSouza: Youre acting as if the whole movie is hinging on the bike guy.",
    "But when the jury looks at the video, meh, theyre chasing Rittenhouse.",
    "He took a picture after the fact, after he posed his bike next to it.",
    "But again, your movie doesnt prove that this even happened even once.",
    "Bump: I can fault you because you are the one making the proposition.",
    "Its not up to me to prove you wrong, but for you to prove your point.",
    "And you just admitted you dont have the evidence to prove that point.",
    "Lets remember, first of all, were not talking about the post office.",
    "The burden is on you to provide the evidence, not on me to rebut it.",
    "What Im saying is you dont have the evidence to bolster your claims.",
    "The investigators will come up with the evidence of a legal offense.",
    "DSouza: So what Im saying is youre jumping the process in this case.",
    "And what is the impact of this counterfeiting on the larger economy?",
    "DSouza responded, inviting me to watch his film and then debate him.",
    "On Tuesday, the state elections board dismissed related complaints.",
    "In other words, do they copy the ballots on a high-quality printer?",
    "Granted, that lawsuit was dismissed, but were you at all concerned?",
    "A guy stops at an organization, he gets a backpack full of ballots.",
    "Youre simply saying: Heres maybe a speculative thing that happened.",
    "In other words, if you have geotracking through time, you can tell.",
    "The first being that its not as though we have access to this DNA.",
    "So the movie is a part of all this, but the movie is also a movie.",
    "And so youre putting a burden on the movie that no movie can bear.",
    "And thats really one of the challenges that this whole movie has.",
    "You at no point in the movie show, Here is the geotracking data.",
    "But I dont know that that was publicly known in January of 2021.",
    "DSouza: Your authority is an academic that no one has heard of.",
    "In fact, they hadnt begun their geotracking work at that point.",
    "And this, of course, gets to the core issue about geotracking.",
    "His position now is: We got to investigate ballot trafficking.",
    "And then they went on to this place where there is no camera.\"",
    "In other words, True the Vote knew where to look on the video.",
    "I dont know that because I havent talked to the whistleblower.",
    "Are they trying to create an investigation that goes nowhere?",
    "Now youre saying, \"How do we know they went to 10 drop boxes?",
    "[Of the 36 locations in Fulton County, 28 were at libraries.]",
    "They claimed that they have reasons for why that didnt occur.",
    "And I looked as to, what was the essence of the disagreement?",
    "Bump: So, you know, I understand that that is your position.",
    "And the reason people start talking is they experience fear.",
    "But in fact, if you add the numbers up, its more than 2,000.",
    "So if this is the standard, then how does that apply, right?",
    "Bump: If you walk into a courthouse and say, Oh, dont worry.",
    "I dont know why you couldnt do that with this whistleblower.",
    "You dont argue that theres any additional evidence for this.",
    "You accept that that happened in the 2020 election, correct?",
    "This guy didnt even go to 10 drop boxes!? They know he did.",
    "What a law court would do is they would say: You know what?",
    "We are not presented with that actual evidence in the film.",
    "Have you ever seen a library which had a book sale outside?",
    "There are all sorts of reasons to go to multiple libraries.",
    "DSouza: The point is this: Lets just say were slightly off.",
    "Sometimes you have to get off the highway and take a turn.",
    "I think, you know, what kind of reaction that would ensue.",
    "Was he willing to come out in public and look like a fool?",
    "There are other states that that took very partial video.",
    "You dont have to be, quote, an investigator? or the D.A.",
    "They wouldnt go to the filmmaker and say, Wait a minute.",
    "As you know, were not able to go scrutinize the ballots.",
    "And not only is that not legal, it contaminates my vote.",
    "After it is deposited, he takes a photo of the drop box.",
    "The whistleblower spoke to True the Vote investigators.",
    "My authority is the chief justice of the United States.",
    "If someone goes to the drop box and stops there, right?",
    "Hes not wrong, hes probably working off of an article.",
    "Thats why your analogy doesnt work in the first place.",
    "Bump: Have you seen where the Atlanta drop boxes were?",
    "That he deposited the ballots and then took a picture.",
    "And then you have to look at alternative explanations.",
    "You again only see her put one ballot in the drop box.",
    "Im a little baffled: You are an experienced filmmaker.",
    "Thats a logical next step in any other investigation.",
    "I just think that hes relying on what he doesnt know.",
    "What Im saying is this all can easily be found out.",
    "This is not places where you drop off regular mail.",
    "DNA evidence unmistakably says that you were there.",
    "Did you see evidence they went to other drop boxes?",
    "My view is that Georgia is in an awkward position.",
    "Then, you know, obviously theres multiple ballots.",
    "And this was announced, like, two days ago, okay?",
    "So now just notice the credulity that you extend!",
    "We're looking at latex gloves, not woolen gloves.",
    "We saw the bike guy, for example, or the dog guy.",
    "Then boom, there they were at this date and time.",
    "Its sort of like, look, we got these 2,000 mules.",
    "Theres a lot of examples of \nBump: Thats correct.",
    "Theres no indication theres more than one ballot.",
    "Our evidence on the payments is really threefold.",
    "You show no one who went to multiple drop boxes.",
    "Bump: Which I found no evidence for, by the way.",
    "But see, even then, you have the issue of money.",
    "But they didnt, and I think thats worth noting.",
    "That is not visible in a video box on a screen.",
    "And now this is the point \nBump: Let me finish.",
    "So you can just look at the charging documents.",
    "I knew nothing about it.? He looks like a fool.",
    "DSouza: Of course there is a claim being made!",
    "DSouza: The high bar is 10 or more drop boxes.",
    "DSouza: The video evidence I agree is partial.",
    "Thats obvious to anyone who watches the movie.",
    "My answer to that question, by the way, is no.",
    "Ive read a whole bunch of news articles on it.",
    "The truth of it is the suspicions were raised.",
    "People are going to start asking me questions.",
    "Because theres literally no way to know that.",
    "You drop it off.? Thats allowed, thats legal.",
    "I mean, I did  I did my own homework on that.",
    "And you dont show anyone else wearing gloves.",
    "Were not being told DNA is found in the home.",
    "They have never made the argument youve made.",
    "DSouza: I didnt take Phillipss word for that.",
    "So you can give you a cellphone to your wife.",
    "He deposits a ballot, takes a picture of it.",
    "Or do you just take Phillipss word for that?",
    "Many drop boxes are by the side of the road.",
    "Have you ever seen that before at a library?",
    "Bump: Let me give you an alternate scenario.",
    "You look in the video and boom, there he is.",
    "Eshelman wasnt saying that data was invalid.",
    "DSouza: But what Im saying is I do show it.",
    "Its up to you to prove this even happened.",
    "And you can tell that difference, correct.",
    "In fact, it shows a minority of the mules.",
    "DSouza: Well, let me frame it differently.",
    "Were talking now about standards of proof.",
    "You cant see very clearly whats happening.",
    "But that aside, this is exactly the point.",
    "How come you have not, in fact, verified?",
    "And we again are taking your word for it.",
    "Thats what caused people to come forward.",
    "Its not possible to look at the ballots.",
    "Did they get them from housing projects?",
    "A guy walks in, goes up to a ballot box.",
    "The mules went to 10 or more drop boxes.",
    "So we dont have surveillance everywhere.",
    "Bump: It is, and well come back to that.",
    "You dont even show the geotracking data.",
    "That conversation took place on Monday.",
    "Did they get them from homeless people?",
    "So clearly, theyre taking it seriously.",
    "Youve been to a public library before.",
    "Bump: But you dont actually show that.",
    "But lets zoom in to that for a moment.",
    "So, why do we take your word for that?",
    "In the movie, you dont make this case.",
    "Honestly, we show a lot more than two.",
    "So what happens is well show a video.",
    "DSouza: Yeah, thats a separate issue.",
    "We saw them heading to this location.",
    "I think you realize that that's dumb.",
    "So drop boxes are all over the place.",
    "The election commission got involved.",
    "Did they get them from nursing homes?",
    "So now you introduce some qualifiers.",
    "We just took a conservative estimate.",
    "Were talking about a gap of 10 feet.",
    "You provide no geotracking evidence.",
    "That was the Raffensperger position.",
    "You dont present this whistleblower.",
    "You did none of that investigating.",
    "DSouza: Okay, so pause right there.",
    "You dont even try to make the case.",
    "They dont like to look like idiots.",
    "Bump: So this is the point, though.",
    "Bump: But you dont know who he is.",
    "I dont believe theres geotracking.",
    "Im not the one whos making a case.",
    "He pulled a ballot out of the bag.",
    "And the consequence was acquittal.",
    "I dont believe its that accurate.",
    "But this is very awkward for him.",
    "You dont show any evidence of it.",
    "DSouza: Because Ill tell you why.",
    "In fact, he didnt know about it.",
    "Im not saying we should assume.",
    "Its obviously relevant to know.",
    "You can say, I dont believe it.",
    "So I saw it as a side dispute.",
    "Bump: Let me give you a quote.",
    "They vary from state to state.",
    "Theres simply no way to do it.",
    "Did they get them from dorms?",
    "I better 'fess up.?\nBump: No.",
    "Bump: Mine doesnt have to be.",
    "Or do you disagree with that?",
    "Thats a whole different line.",
    "A few recurring themes arose.",
    "Eyewitnesses can be mistaken.",
    "DSouza: No, I dont know that.",
    "This geotracking is useless.",
    "We show a lot more than two.",
    "What more proof do you need?",
    "Thats not his position now.",
    "DSouza: I looked into that.",
    "But investigators can tell.",
    "Go back and watch the film.",
    "DSouza: How do I know that?",
    "Bump: Except that its not.",
    "Okay, thats a possibility.",
    "It doesnt show every mule.",
    "Do you disagree with that?",
    "Thats what they would do.",
    "What was the fight about?",
    "So now this is important.",
    "Its often grainy footage.",
    "Thats exactly the point.",
    "But I did check it out.",
    "DSouza: Okay, hold on.",
    "DSouza: Let me finish.",
    "No ones claiming that.",
    "How is this organized?",
    "You never showed that.",
    "DSouza: I think I do.",
    "I spoke to an expert.",
    "So thats your source.",
    "Theres zero evidence.",
    "Ive read three books.",
    "He claims they didnt.",
    "Bump: Oh, absolutely.",
    "Bump: Thats not true.",
    "Thats the key point.",
    "They held hearings.",
    "So heres the point.",
    "DSouza: I disagree.",
    "Thats your source.",
    "Thats number one.",
    "Who organized it?",
    "They know he did.",
    "Its bad footage.",
    "Put it this way.",
    "DSouza: No, no.",
    "Whats going on?",
    "Bump: Exactly.",
    "DSouza: Right.",
    "You know what?",
    "DSouza: Right.",
    "DSouza: Okay.",
    "DSouza: Okay.",
    "They do that.",
    "Who paid you?",
    "DSouza: Okay.",
    "DSouza: Okay.",
    "Very easily.",
    "DSouza: Yes.",
    "Bump: Okay.",
    "Bump: Sure.",
    "Bump: Okay.",
    "Thats true.",
    "Bump: Okay.",
    "Not 2,010.",
    "Not 2,050.",
    "Bump: Yes.",
    "All right.",
    "And maybe!",
    "How much?",
    "Agree?",
    "Agree?",
    "Yeah.",
    "Okay?",
    "Okay."
  ]
}