{
  "id": 4575,
  "mediaId": 223,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "What a Woman Found Walking Her Dog Should Spark More Questions About Election Integrity",
  "image": "https://media.townhall.com/townhall/reu/ha/2020/322/e45b31d0-b349-463c-b998-58a883989328.jpg",
  "link": "https://townhall.com/tipsheet/mattvespa/2022/05/10/what-a-woman-found-walking-her-dog-should-spark-more-questions-about-election-integrity-n2607021",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Vespa",
  "authorUrl": "https://townhall.com/tipsheet/mattvespa/",
  "termIds": [
    1024,
    1930,
    1951,
    2011,
    2095,
    428,
    2590,
    2791
  ],
  "sentences": [
    "It seems as if she called every local office she could think of to figure out what to do next (via Fox 11):\nThe Los Angeles County Registrar's Office and the United States Postal Service are investigating after 104 ballots were found unopened on the sidewalk in East Hollywood.",
    "So, as we argue about ballots being harvested, the level of security with the last election, and the absence of a chain of custody regarding these ballotslets go to California where a woman walking her dog just so happen to stumble upon a box of ballots.",
    "They needed state legislature approval which these Democratic officials were not going to get in Pennsylvania and Michigan, both of which have Republican legislatures.",
    "Secretaries of state in key swing states unilaterally changed voting regulations which the courts said they were not permitted to do.",
    "[]\nRepaci said after much back and forth, the LA County Registrar's Office got in contact with her about picking up the ballots.",
    "Some of the last areas to tally their votes just so happen to be in the Chicago area run by political boss Mayor Richard Daley.",
    "This is a country of freedom and our votes should matter and something like this should never happen,\" said Repaci.",
    "Yet, when we have suspicions about funny business in the 2020 election, its all tin foil hat material.",
    "In Paterson, New Jersey, the citys elections were invalidated since the fraud was so rampant in 2020.",
    "This is why the mail-in ballot process with zero signature verification is some fugazi nonsense.",
    "Im preaching to the choir I know, but the evidence is pervasive that you can steal an election.",
    "I just don't think it should have been this hard to figure out what to do with legal ballots.",
    "The ballots were found by Christina Repaci, who was walking her dog Saturday evening.",
    "The woman secured the ballots in her home and tried to figure out what to do next.",
    "\"I turned the corner and I just saw this box of envelopes, and it was a USPS box.",
    "Incoming White House Press Secretary Karine Jean-Pierre outright said Gov.",
    "I picked some envelopes up and I saw they were ballots,\" said Repaci.",
    "COVID was used by Democrats to illegally tweak election procedures.",
    "\"It was so much stress and for just one person to get back to me.",
    "They'll just put them in a dumpster or throw them in the trash.",
    "Now if it happens to someone else, they don't know what to do.",
    "In 1960, John F. Kennedy arguably stole it from Richard Nixon.",
    "Source: AP Photo/Ben Gray\nDemocrats can deny it all they want.",
    "The New York Post interviewed someone who has done it before.",
    "Registrar Dean Logan personally drove to pick up the ballots.",
    "Its funny how they only bring that up when their side loses.",
    "He gave me a card, and took a photo of the box,\" she said.",
    "Stacey Abrams still hasnt really conceded that race.",
    "The most recent was the 2018 gubernatorial race.",
    "You could be censored for speaking common sense.",
    "Repaci described the process as \"stressful.\"",
    "This is why election integrity laws are ke.",
    "Yeah, nothing unusual about that, right?",
    "Nothing suspicious about that, right.",
    "You can cheat and steal an election.",
    "Brian Kemp stole the election.",
    "\"He (Logan) picked them up.",
    "I made sure he was legit.",
    "Easy there, Ms. Repaci.",
    "What do I do here?",
    "It happens."
  ]
}