{
  "id": 4586,
  "mediaId": 188,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Biden's incoming press secretary Karine Jean-Pierre called Fox News 'racist'",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTc4MjEyMy9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3NTM0Nzk4Nn0.AZFbQSy_s8QJTsOdF6W3PG3ycD_MvzOup0TfOLjmZ2Q/img.jpg?width=1245&quality=85&coordinates=0%2C107%2C0%2C0&height=700",
  "link": "https://www.theblaze.com/news/biden-s-incoming-press-secretary-karine-jean-pierre-called-fox-news-racist",
  "sentiment": "0.0",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Pandolfo",
  "authorUrl": "https://www.theblaze.com/u/christopherpandolfo",
  "termIds": [
    683,
    1024,
    1098,
    1147,
    2087,
    2095,
    4715,
    200,
    427
  ],
  "sentences": [
    "\"Fox News was racist before #coronavirus, they are racist during coronavirus, and Fox News will be racist after the coronavirus\" @JoyAnnReid \\n\\n#AMJoy #MSNBC #SundayMorningpic.twitter.com/0oOQWqkSE8\n Karine Jean-Pierre (@Karine Jean-Pierre) 1584313699\nAccording to a transcript of the program pulled by Mediaite, Reid brought up how Tucker Carlson referred to the coronavirus as the \"Chinese coronavirus,\" asserting that Fox hosts were following President Donald Trump's lead in labeling it a \"foreign\" virus to stir up \"xenophobia.\"",
    "President Joe Biden's new press secretary, Karine Jean-Pierre, called Fox News a \"racist\" network in early 2020, adding to a growing list of controversial statements she's made that are now being scrutinized as she prepares to take over for Jen Psaki.",
    "And, you have their own viewers who can now, the ones who are 60 and older who are watching, this is a health crisis that were in, this is a global pandemic, as the WHO have said, and theyre putting their lives in danger,\" she said.",
    "She was part of a panel featuring Washington Post columnist Jennifer Rubin and former Republican National Committee Chairman Michael Steele that discussed Fox News' coverage of the emerging COVID-19 pandemic.",
    "The comments raise questions about how Jean-Pierre will maintain a working relationship with Fox News reporters once she takes over for White House press secretary Jen Psaki, who will step down Friday.",
    "She also faces questions over other controversial statements she's made, including a false assertion that the 2018 gubernatorial election in Georgia was \"stolen\" by Republican Brian Kemp.",
    "Jean-Pierre went on to say that \"xenophobia and racism\" have always been a part of virus outbreaks and that \"the stigma sometimes is more dangerous than the actual virus.\"",
    "I think the difference is they are all in on being state TV for Donald Trump, and so they will continue to give the misinformation,\" Jean-Pierre said in the clip.",
    "Fox News was racist before #coronavirus, they are racist during coronavirus, and Fox News will be racist after the coronavirus,? she wrote.",
    "Jean-Pierre also faces ethical questions concerning her long-term romantic relationship with CNN national correspondent Suzanne Malveaux.",
    "\"Fox News was racist before coronavirus, they are racist during the coronavirus, Fox News will be racist after the coronavirus.",
    "\"The danger is, so yes, you have Asian-Americans right now whose lives are seriously in danger.",
    "The two live together in Washington D.C. and are raising an adopted 7-year-old dautghter.",
    "On March 15, 2020, Jean-Pierre was a guest on MSNBC's \"AM Joy,\" hosted by Joy Reid.",
    "In a clip Jean-Pierre shared on Twitter, she accused Fox News of being \"racist.\"",
    "She then accused Fox News of spreading \"misinformation\" and stoking racism.",
    "So there is nothing new here."
  ]
}