{
  "id": 4658,
  "mediaId": 409,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Georgia School Athletics Group Bars Male Students from Girls Sports",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/03/lia-thomas-ncaa-finals-500.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/georgia-school-athletics-group-bars-male-students-from-girls-sports/",
  "sentiment": "0.0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Evans",
  "authorUrl": "https://www.nationalreview.com/author/zachary-evans/",
  "termIds": [
    2048,
    2095,
    2520,
    4651,
    539,
    2672,
    2710,
    2738,
    2946
  ],
  "sentences": [
    "Governor Andy Beshear of Kentucky, a Democrat, and Spencer Cox of Utah and Eric Holcomb of Indiana, both Republicans, argued in their veto messages that the legislation would likely be struck down in court and that there were few-to-no instances of transgender student athletes in their states, making the laws irrelevant.",
    "There are competitive imbalances generally between biological females and biological males.?\nThe vote comes amid a wider push among states with Republican-dominated legislatures to require transgender student athletes to compete on teams according to the sex on their birth certificate.",
    "Following my signature on HB 1084, the Georgia High School Association today voted to protect fairness in school sports by unanimously approving youth to compete according to the sex determined on his/her birth certificate,? Kemp said in a Twitter post on Wednesday.",
    "The Georgia High School Association, which describes itself as a voluntary organization composed of over 465 public and private high schools,? allowed schools to establish individual policies governing participation of transgender athletes in 2016.",
    "We dont want to discriminate against anybody, but that includes biological girls,? GHSA executive director Robin Hines told the AJC on Tuesday, before the executive committees vote.",
    "A major Georgia high school athletics association voted on Wednesday to require student athletes to participate in sports teams according to the sex on their birth certificate.",
    "In Georgia, the legislature passed a bill delegating authority to the GHSA to implement policies on transgender athletes, with Governor Brian Kemp signing the bill last week.",
    "Over a dozen states have passed bills to that effect, including in Kentucky and Utah, where the legislatures overrode vetoes by the states respective governors.",
    "The GHSAs executive committee voted 62-0 on Wednesday to rescind that policy, according to the Atlanta Journal-Constitution.",
    "Im proud to have championed this effort in Georgia.?"
  ]
}