{
  "id": 4676,
  "mediaId": 19,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Georgia Democrat Stacey Abrams Sponsored Legislation Related to Her Private Business Interests",
  "image": "https://media.breitbart.com/media/2021/04/staceyabramsga1-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/05/georgia-democrat-stacey-abrams-sponsored-legislation-related-to-her-private-business-interests/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1951,
    2095,
    4325,
    146,
    428,
    501,
    562,
    3327,
    3443,
    2672
  ],
  "sentences": [
    "The legislation appears, therefore, to be related to and potentially even beneficial to NOWAccount, specifying that a dealer shall be allowed a deduction or refund of the tax previously reported by the dealer on the unpaid balance due on the account or receivable that is charged off as a bad debt on the books and records of the lender.?\nAbrams is the uncontested Democrat candidate running for governor in Georgia this year and will face either Gov.",
    "Recent findings from an investigation by the Government Accountability Institute (GAI) reveal Abrams had an integral? role in NOWAccounts ability to secure state contracts with the Georgia Department of Community Affairs (DCA) that would use federal taxpayer dollars to fund the loans, as well as bail out NOWAccount when it had granted risky loans that defaulted.",
    "The bill, House Bill 389, sought to modify the state income tax collection process to provide for credits for bad debts on private label credit cards or dealer credit programs.?\nAbrams, at the time, was senior vice president at a company called NOWAccount, according to an archive of the companys website.",
    "GAI obtained documents, however, that show Abrams name was used prominently during the application process for the state contracts and that NOWAccount had tried and failed to create similar setups in other states, where Abrams was not a lawmaker.",
    "The legislation she sponsored in 2015, which never moved forward and was ultimately deemed dead the following year, raises more concern that the then-state lawmaker may have sought to use her public role in office to boost her personal wealth.",
    "Abrams had cofounded NOWAccount in 2010 with two business partners with the goal of helping to grow small businesses, which NOWAccount would do by loaning the businesses money upfront for invoices the businesses were awaiting payment on.",
    "The Atlanta Journal-Constitution previously reported on NOWAccounts dealings with DCA and noted Abrams had a 16 percent stake in the company when it was in the process of crafting state contracts with the DCA, in 2013 and 2014.",
    "Democrat Stacey Abrams sponsored legislation in 2015 while she was a Georgia lawmaker that was related to bad debt from credit programs, which, at the time, was relevant to her financial services company.",
    "Abrams claimed, according to the the AJC, that she had no role in securing the state contracts, and that she scrupulously avoided conflicts of interest? while she was a state lawmaker.",
    "Brian Kemp (R), whom she narrowly lost to in her first bid for governor in 2018, or former Sen. David Perdue (R-GA) in the upcoming general election.",
    "The Abrams campaign did not respond to Breitbart News about whether Abrams would have benefited personally from this legislation she sponsored.",
    "GAI found NOWAccounts shoddy lending had led to federal taxpayer dollars covering a total of $1.5 million in losses from unpaid loans.",
    "Abrams, then the Georgia House minority leader, was the lone Democrat to sponsor the legislation, alongside four Republicans."
  ]
}