{
  "id": 4726,
  "mediaId": 233,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Here's what US governors said after bombshell Supreme Court abortion opinion leaked",
  "image": "https://www.gannett-cdn.com/presto/2022/05/03/USAT/6560ac3d-8dde-401d-96aa-698244f8fac8-USP_News__Abortion_Rights_Protest_-_New_York_City.jpg?crop=1999,1125,x0,y115&width=1999&height=1125&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/05/03/roe-v-wade-draft-us-governors/9633502002/",
  "sentiment": "0.0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Mendoza",
  "authorUrl": "https://www.usatoday.com/staff/4281063001/jordan-mendoza/",
  "termIds": [
    1394,
    2095,
    4278,
    4587,
    482,
    3210,
    2590,
    2621,
    2945
  ],
  "sentences": [
    "Deidre Henderson, Cox said \"While we are encouraged and optimistic at the possibility that abortion law will be left to the duly elected representatives of the states, draft rulings are not actual rulings and leaked drafts are a dangerous violation of court protocol and deliberations.?\nThe statement noted that Utah has already passed legislation that would ban elective abortions in the state in the case that Roe v. Wade is overturned, The Salt Lake Tribune reported.",
    "Phil Scott\nScott shared in a statement on Twitter that lawmakers in the state have already \"enacted a law that affirms the fundamental rights of all women and ensures reproductive health decisions remain between a woman and her health care provider  totally free from government interference.\"",
    "Gavin Newsom\nIn a statement with Senate President pro Tempore Toni G. Atkins (D-San Diego), Assembly Speaker Anthony Rendon, Newsom said California \"will not stand idly by as women across America are stripped of their rights and the progress so many have fought for gets erased.",
    "Lawmakers across the country are speaking out about the leaked draft from the Supreme Court released by Politico on Monday, which suggests the nation's highest court is considering overturning the 1973 Roe v. Wade decision that established a constitutional right to abortion.",
    "The official ruling on the case isn't expected until June or July, but numerous lawmakers have condemned the draft, saying it creates catastrophic consequences for million of Americans, while others want to prosecute the person or people who leaked the draft.",
    "Jared Polis\nPolis tweeted on Monday night the news was disappointing and Colorado will continue to \"remains a state where freedom is respected and where any person has the ability to live, work, thrive, and raise a family on their own terms.\"",
    "Asa Hutchinson\nHutchinson tweeted he has advocated for the reversal of Roe v. Wade his entire political career, and hoped \"the court returns authority to the states,\" but said an investigation is needed into who leaked the opinion draft.",
    "Here's what most have had to say or tweeted about the possible overturn on one of the nation's most divisive issues:\nLive updates: 'Whole range of rights could now be at risk' if Roe v. Wade is overturned, Biden says\nAlabama Gov.",
    "I do believe, just like in determining what our education budget should be, what our funding for law enforcement should be, how we handle our taxes at the state level  those are state decisions,\" The Washington Post reported.",
    "Kristi Noem\nNoem tweeted if Roe v. Wade is overturned, she will call a special session \"to save lives and guarantee that every unborn child has a right to life in South Dakota,\" as the state has a trigger ban in place.",
    "The report suggesting the reversal of the near-50-year-old ruling would mean abortion rights would no longer be federally protected, and instead let states decide what abortion restrictions or bans it wants to enforce.",
    "Ned Lamont\nLamont said in a statement he is committing to signing a bill recently approved by both chambers of the Connecticut General Assembly that will \"protect medical providers and patients seeking abortion care.\"",
    "Since Monday night, governors across the country have voiced their reactions to the leak, including 16 governors who wrote a letter to Congress, asking for laws protecting abortion rights be put in place immediately.",
    "Roy Cooper\nOne of the governors that signed the letter to Congress, Cooper said on Twitter it is his responsibility \"to defend access to reproductive health care and a womans right to make her own decisions.\"",
    "Tony Evers\nOne of the lead authors of the letter to Congress, Evers said abortion is still legal in Wisconsin and he will veto any legislation brought to him that would \"threaten access to healthcare.\"",
    "Tim Wolf\nWolf said in a statement the possible overturn of Roe v. Wade \"is an assault on the right to access safe, legal abortion services\" and abortion access will be legal as long as he is governor.",
    "Charlie Baker\nBaker said on Twitter the possible overturned would be \"a massive setback\" for women in states without abortion protection laws, and Massachusetts will \"always protect women's rights.\"",
    "Phil Murphy\nMurphy said in a statement the Supreme Court decision will have no impact on New Jersey's reproductive rights, and said Congress must pass legislation to protect those rights.",
    "Kathy Hochul\nHochul said the State of New York \"will always be there for anyone who needs reproductive healthcare, including an abortion,\" including those not living in New York.",
    "Kay Ivey\nIvey tweeted on Monday night the leak was \"a blatant attempt to manipulate the sacred procedures of the U.S. Supreme Court,\" but hopes Roe v. Wade will be overturned.",
    "If Roe v. Wade is overturned, he added the state will automatically provide protection, resources and care for mothers and children, as the state has a trigger law in place.",
    "\"I want Oklahoma to be the most pro-life state in the country because I represent all four million Oklahomans who overwhelmingly want to protect the unborn,\" he tweeted.",
    "Greg Gianforte\nGianforte said in a statement the leak is an effort to undermine the integrity of the Supreme Court and hopes the decision will be put on state governors.",
    "Tate Reeves\nReeves compared abortion laws in the U.S. to China and North Korea, and said \"countless lives can be saved\" if the Supreme Court overturns the ruling.",
    "Brian Kemp\nKemp tweeted on Tuesday Georgia will remain a state that \"values life at all stages\" and will fight to have the strongest pro-life laws in the country.",
    "J.B. Pritzker\nPritzker said in a statement he condemned the leak and said \"abortion will always be safe and legal here in Illinois\" no matter the ruling in June.",
    "Michelle Lujan Grisham\nGrisham said in a statement she was \"outraged and horrified,\" saying the decision would be devastating for women across the country.",
    "Kate Brown\nBrown tweeted all Americans should have access to abortion rights and it will be protected by state law regardless of the Supreme Court ruling.",
    "Dan McKee\nAnother governor who signed the letter to Congress, McKee said \"here in Rhode Island, we stand firmly in defense of a woman's right to choose.\"",
    "Janet Mills\nMills said in a statement said she doesn't consider women's rights to be \"dispensable\" and will fight for reproductive rights in the state.",
    "Kim Reynolds\nReynolds tweeted on Tuesday that the state is \"fighting to defend the most important freedom there is: the right to life.\"",
    "As of Tuesday, 22 states already have bans or could ban abortion if Roe v. Wade is overturned, according to the Guttmacher Institute.",
    "Glenn Youngkin\nYoungkin told reporters on Tuesday that I believe that the state should be able to take on this responsibility.",
    "Doug Burgum\nBurgum said his administration supports pro-life legislation and welcomes the decision be made by state leaders.",
    "Newsom also tweeted abortion rights will be protected in California no matter what decision made by the Supreme Court.",
    "Kevin Stitt\nStitt said he signed SB 1503, also known as the Oklahoma Heartbeat Act, into law on Tuesday.",
    "Gretchen Whitmer\nWhitmer said she is going to \"fight like hell\" to protect abortion rights in Michigan.",
    "Steve Sisolak\nSisolak tweeted on Monday night the state is committed to protecting reproductive rights.",
    "And we will not slow down in the fight to ensure safe, affordable access to every person who needs it.\"",
    "She was one of the 16 governors to sign a letter to Congress to enact laws protecting abortion rights.",
    "Bill Lee\nLee said in a statement he is concerned by the leak and \"any attempt to thwart justice.\"",
    "\"This will remain true in Vermont regardless of what happens with the Supreme Court,\" he added.",
    "\"As soon as this bill is transmitted to my office, I will sign it into law,\" he said.",
    "Arkansas has a \"trigger law\" than would ban abortions if the ruling is overturned.",
    "Tim Walz\nWalz shared the Politico article on Twitter, tweeting \"not on my watch.\"",
    "We cannot let their most profound and personal rights be violated,\" he tweeted.",
    "Jay Inslee\nInslee tweeted on Monday \"Washington is and will remain pro-choice.",
    "Secret deliberations: Supreme Court deliberations are supposed to be secret.",
    "Mississippi also has a trigger ban, as well as pre-Roe ban on abortions.",
    "He also tweeted \"we will NOT go backwards on reproductive rights.\"",
    "She added the state will continue to protect reproductive rights.",
    "The state protects abortions right throughout pregnancy.",
    "Like Georgia, Iowa has a six-week ban on abortions.",
    "Georgia currently bans abortions after six weeks.",
    "Spencer Cox\nIn a joint statement with Lt. Gov.",
    "So how did a draft abortion opinion leak?",
    "The state has a pre-Roe abortion ban.",
    "\"In Illinois, we trust women.",
    "North Carolina Gov.",
    "Massachusetts Gov.",
    "North Dakota Gov.",
    "Pennsylvania Gov.",
    "Rhode Island Gov.",
    "South Dakota Gov.",
    "Mississippi Gov.",
    "Connecticut Gov.",
    "New Jersey Gov.",
    "New Mexico Gov.",
    "Washington Gov.",
    "California Gov.",
    "We will fight.\"",
    "Tennessee Gov.",
    "Minnesota Gov.",
    "Wisconsin Gov.",
    "Michigan Gov.",
    "Colorado Gov.",
    "Illinois Gov.",
    "Virginia Gov.",
    "Oklahoma Gov.",
    "New York Gov.",
    "Arkansas Gov.",
    "Vermont Gov.",
    "Georgia Gov.",
    "Montana Gov.",
    "Nevada Gov.",
    "Oregon Gov.",
    "Maine Gov.",
    "Iowa Gov.",
    "Utah Gov."
  ]
}