{
  "id": 4795,
  "mediaId": 157,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Trump to phone in stump speech for David Perdue as his quest to beat Brian Kemp spirals downward",
  "image": "https://www.rawstory.com/media-library/cnn-sounds-the-alarm-on-georgia-s-david-perdue-figuring-out-just-how-much-money-he-s-making-is-hard.jpg?id=24978901&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/trump-david-perdue/",
  "sentiment": "-0.802",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    1147,
    2087,
    2095,
    4325,
    227,
    428,
    2670,
    2672
  ],
  "sentences": [
    "Additionally, Trump's flailing efforts to wield political clout in the Peach State come as a Fulton County special grand jury convenes to hear evidence into potential criminal wrongdoing in his efforts to pressure Georgia officials to overturn President Joe Biden's victory there.",
    "But Trump's anointed challenger, former Sen. David Perdue (R-GA), is trailing badly in the polls, and now the Atlanta Journal Constitution reports that Trump is literally phoning in his efforts to beat Kemp this week by having a remote \"tele-rally\" for Perdue.",
    "\"Trump infamously called Georgia Secretary of State Brad Raffensperger in January of 2021 and told the Georgian and his team, 'Fellas, I need 11,000 votes,' to overturn the states election results,\" writes the AJC.",
    "The AJC notes that Trump in recent days has also sought to downplay his support for Perdue, as he encouraged the New York Times to look at his record of endorsing non-Perdue candidates in Republican primaries.",
    "\"He has since nursed a vendetta against both Raffensperger and Kemp because of their refusal to go beyond the states legal recount and signature audit processes to help him change the election outcome.",
    "Despite support from Trump, Perdue's campaign against Kemp has failed to catch fire, and a recent poll showed him trailing the incumbent Republican by a whopping 27 points.",
    "He then recruited Perdue and U.S. Rep. Jody Hice in an effort to oust Kemp and Raffensperger in their next elections.\"",
    "In the wake of his 2020 election loss, former President Donald Trump made dethroning Georgia Republican Gov.",
    "Brian Kemp a top goal."
  ]
}