{
  "id": 5004,
  "mediaId": 136,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Donald Trump 2024 Run Threatened if Marjorie Taylor Greene Axed From Ballot",
  "image": "https://d.newsweek.com/en/full/2024626/trump-run-threatened-if-greene-loses-case.webp?w=790&f=c24ca1ac4b47b654f747e8b54a27e9ba",
  "link": "https://www.newsweek.com/donald-trump-2024-run-threatened-if-marjorie-taylor-greene-axed-ballot-1700102",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Xander Landen",
  "authorUrl": "https://www.newsweek.com/authors/xander-landen",
  "termIds": [
    1147,
    2095,
    2203,
    2358,
    545,
    2672
  ],
  "sentences": [
    "Speaking on MSNBC on Thursday, Fein, the legal director of Free Speech For People, a nonpartisan, nonprofit legal advocacy organization that is representing the Georgia voters in the case against Greene said that if the judge overseeing the case \"fairly and impartially applies the facts and the law, then he'll agree with us that Marjorie Taylor Greene is disqualified for public office because of her aiding and facilitating the January 6 insurrection.\"",
    "\"Specifically, the evidence shows that she either helped to plan the attack on January 6, or alternatively helped to plan the pre-attack demonstration and/or march on the Capitol with knowledge that it was substantially likely to lead to the attack, and otherwise voluntarily aided the insurrection,\" the organization said in a March statement.",
    "Ron Fein, a lawyer seeking to disqualify Rep. Marjorie Taylor Greene from running for re-election over her alleged involvement in the January 6, 2021, Capitol insurrection, argued Thursday that if his effort is successful it would \"set a precedent\" for former President Donald Trump if he decides to launch another campaign.",
    "\"The Governor of Georgia, Brian Kemp, and Secretary of State, Brad Raffensperger, perhaps in collusion with the Radical Left Democrats, have allowed a horrible thing to happen to a very popular Republican, Congresswoman Marjorie Taylor Greene,\" he said.",
    "The MSNBC host then asked Fein: \"And if it does end up going your way, do you think this sets a precedent for other members of Congress that you might have your sights on, who may have played similar roles, if not more egregious ones?\"",
    "\"Absolutely, if the judge agrees with us that Marjorie Taylor Greene is disqualified then that sets a precedent not only for other members of Congress but also, if he chooses to run for office again in 2024, Donald Trump,\" Fein said.",
    "The group contends she is disqualified based on a provision in the 14th Amendment of the U.S. Constitution, originally designed to prevent former Confederates from holding office after the Civil War.",
    "His comments came just a day before Greene appeared before a state administrative law judge on Friday for a hearing in the proceeding, which she has denounced as a \"scam.\"",
    "In a statement on Thursday about the legal challenge against Greene, Trump blasted Republican leaders in Georgia blaming them, in part, for the situation.",
    "\"No Republican member, no one in Trump's administration or President Trump participated in any riot or had anything to do with it.",
    "After a judge ruled Monday that the challenge against her could move forward, Greene said she \"did nothing wrong.\"",
    "\"She is now going through hell in their attempt to unseat her, just more of an election mess in Georgia.\"",
    "Free Speech For People argues that Greene \"helped facilitate the insurrection\" on January 6, 2021.",
    "\"But if he doesn't, then we're prepared to appeal, and we'll take it all the way,\" he added.",
    "Fein said, in that he thought it could be applied to other politicians, including Trump.",
    "Trump was impeached by the U.S. House last year in connection with the Capitol riot.",
    "So I'm not entertaining this,\" she said in an interview with news station WTVC.",
    "The decision in that hearing might have repercussions beyond Greene's future.",
    "Newsweek has reached out to Trump and Greene's office for comment.",
    "We were completely shocked,\" she added during the interview.",
    "\"I don't care what the lawsuit says.",
    "And this is a scam, OK?",
    "I did nothing wrong."
  ]
}