{
  "id": 5045,
  "mediaId": 157,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Trump complains people wanted to use the 25th Amendment on him 'anytime I had a great idea'",
  "image": "https://www.rawstory.com/media-library/president-of-the-united-states-donald-trump-speaking-at-the-2017-conservative-political-action-conference-cpac.jpg?id=25691747&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/trump-25th-amendment/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Reed",
  "authorUrl": "https://www.rawstory.com/u/brad_reed",
  "termIds": [
    1147,
    2087,
    2095
  ],
  "sentences": [
    "While talking at the Heritage Conference organized by the right-wing Heritage Foundation, Trump noted that talk of employing the 25th Amendment has stopped now that President Joe Biden is in the White House.",
    "The 25th Amendment of the Constitution provides protocols for having the president's cabinet remove him from power if they deem him physically or mentally incapable of executing the duties of his office.",
    "That\\u2019s why I took the aptitude testpic.twitter.com/t1xFDkz5iA\n Acyn (@Acyn) 1650583332\nNOW WATCH: Trump rages against Brian Kemp for purportedly conspiring against Marjorie Taylor Greene",
    "Former Deputy Attorney General Rod Rosenstein once floated employing the 25th Amendment on Trump when he feared that Trump could be compromised by Russian intelligence services.",
    "Former President Donald Trump on Thursday complained about how often people brought up using the 25th Amendment in the Constitution to remove him from office.",
    "They don\\u2019t think about that now\\u2026 They would mention it anytime I had a great idea, the 25th amendment, there\\u2019s something wrong with him.",
    "It was also raised as a possibility by former Treasury Secretary Steve Mnuchin in the wake of the January 6th Capitol riots.",
    "\"They would mention it anytime I had a great idea, the 25th amendment, theres something wrong with him.",
    "\"They don't think about that now at all, they never mention the 25th,\" he said.",
    "Thats why I took the aptitude test, and I aced it!\"",
    "Trump: They don\\u2019t think about it out now.",
    "Watch the video below.",
    "The 25th amendment."
  ]
}