{
  "id": 5204,
  "mediaId": 43,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Texas conservatives have gone rogue, paying Big Lie lackeys to investigate citizens for voter fraud",
  "image": "https://images.dailykos.com/images/1058399/story_image/GettyImages-1230398370.jpg?1649780677",
  "link": "https://www.dailykos.com/story/2022/4/12/2091551/-Texas-conservatives-have-gone-rogue-paying-Big-Lie-lackeys-to-investigate-citizens-for-voter-fraud",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebekah Sager",
  "authorUrl": "/users/rebekah sager",
  "termIds": [
    661,
    2095,
    4829,
    122,
    2692,
    2703,
    2738,
    2767,
    2934
  ],
  "sentences": [
    "Gilda Daniels, litigation director for the Advancement Project and author of Uncounted: The Crisis of Voter Suppression in America tells The Appeal, Whether its an armed police officer patrolling a polling place or just having a police car with lights blaring in front of a polling place, all can serve as a form of voter intimidation and certainly can have a chilling effect, particularly in Black and brown communities.?\nAnthony Gutierrez, executive director of Common Cause Texas, tells the Bolts the possibilities are kind of endless for how that could go really badly? when someone is hired to investigate based on beliefs of a stolen election.",
    "According to court documents, Aguirre told police he was part of a group of private citizens called Liberty Center,? and that the group was conducting a civilian investigation into the alleged ballot scheme.?\nAccording to the arrest affidavit, Aguirre told police Lopez was using Hispanic children to sign the ballots because the childrens fingerprints would not appear in any database.?\nPolice officers on the scene when Lopez was stopped and searched found nothing inside the truck besides air conditioner parts and toolsexactly the kinds of items Lopez would be expected to have.",
    "During his indictment, the Harris County District Attorneys office claimed Aguirre was paid a total of $266,400 by the Houston-based Liberty Center for God and Country, with $211,400 of that amount being deposited into his account the day after the incident.?\nHe [Aguirre] crossed the line from dirty politics to commission of a violent crime and we are lucky no one was killed  His alleged investigation was backward from the startfirst alleging a crime had occurred and then trying to prove it happened,? Harris County District Attorney Kim Ogg said.",
    "Voters can still save the country, but Democrats have to help them\nDaily Kos' The Brief\nFollowShare\n0:0058:38\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nPaxton has a long history of working to turn back results in the 2020 presidential election, and Bolts reports that the attorney general has increased pressure to prosecute more voting-related cases, many of which involve Black and brown voters.",
    "Mark Aguirre ran air conditioner repairman David Lopez off the road, held him at gunpoint, and searched and stole his truckall because Aguirre believed Lopez was part of a massive conspiracy of secreting 750,000 fraudulent mail-in ballots, Bolts reports.",
    "But in early April, a gala organized by Hotze and his group was held in Houston to raise money to:\nHire private detectives to investigate, identify, and expose the criminal vote fraud scheme in Harris County and across Texas.",
    "The latest is Trump aide Matt Mowers\nLast year, Lopez filed a civil lawsuit against GOP activist Dr. Steven Hotze for his part in paying for and planning the violent investigation of Lopez, which resulted in Aguirres arrest.",
    "x\nFormer HPD captain accused of holding repairman at gunpoint to prove voter fraud https://t.co/GBIh4X80Pc\n KHOU 11 News Houston (@KHOU) December 16, 2020\nOf course, Hotzes camp denies being behind Aguirres investigation.",
    "The Houston Chronicle reports that Aguirre, who was fired from the police department in 2003 after a raid gone bad, was indicted and charged with aggravated assault with a deadly weapon.",
    "Speakers at the Freedom Gala? were listed as conspiracy theorist and Big Lie guru Mike Lindell, CEO of MyPillow; GOP Party Chair Cindy Siegel; and Texas GOP Attorney General Ken Paxton.",
    "\"We would never endorse that, saying go pull someone over, put a gun up to their head and make them open up their truck,\" Jared Woodfill, an attorney for Hotze, has said.",
    "Conservatives will do anything to attempt to control or even disrupt elections under the guise of voter fraud, aka the Big Lie and Stop the Steal.",
    "Listen and subscribe to Daily Kos' The Brief podcast with Markos Moulitsas and Kerry Eleveld\nx\nx\nYou need to enable JavaScript to run this app.",
    "Make no mistake: Theres a grassroots movement brewing to disenfranchise, intimidate, and criminalize Black and brown voters across the nation.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Ron DeSantis proposed a militarized Office of Election Crimes and Security department that would report directly to him.",
    "Broadcast radio messages offering rewards to those who expose individuals involved in vote fraud.",
    "Brian Kemp signed a law making it illegal to hand out food and water to voters standing in lines.",
    "The frightening thing is that its not just Texas launching militia-style voter fraud Gestapo.",
    "Majority Leader Mitch McConnell's vandalized home on Jan. 2, 2021 in Louisville, Kentucky.",
    "Ensure that poll watchers are recruited, hired, and trained for the upcoming elections.",
    "A prime example is taking place in Texas, where former Houston Police Department Capt.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "RELATED STORY: Another Republican caught voting twice in the same election.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "If voting rights activists dont step up, theyll get away with it.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Fund legal defensive and offensive efforts to Stop Vote Fraud.",
    "Hotze runs the nonprofit Liberty Center for God and Country.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n59.",
    "Stop the Steal protesters in front Sen.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "In January, Florida Gov.",
    "Daily Kos is different.",
    "And in Georgia, Gov.",
    "Please read it."
  ]
}