{
  "id": 5243,
  "mediaId": 209,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "10 things you need to know today: April 9, 2022",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-desktop@1/v1649508663/GettyImages-1239012828.jpg",
  "link": "https://theweek.com/us/1012362/10-things-you-need-to-know-today-april-9-2022",
  "sentiment": "0.0",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grayson Quay",
  "authorUrl": "https://theweek.com/authors/grayson-quay",
  "termIds": [
    661,
    1039,
    1053,
    2095,
    2310,
    2465,
    2515,
    4606,
    2661,
    2857,
    2888,
    2942
  ],
  "sentences": [
    "Donald Trump Jr. proposed ways to overturn the 2020 election, Russian missile strike on train station kills at least 52 civilians, and more\nDonald Trump Jr. was proposing ways to overturn the 2020 election early on, per text\nTexts obtained by CNN reveal that Donald Trump Jr. texted former White House Chief of Staff Mark Meadows two days after the 2020 presidential election, before results were finalized, and laid out strategies for keeping his father in power.",
    "The WeekCNN\nRussian missile strike on train station kills at least 52 civilians awaiting evacuation, Ukraine says\nTwo Russian missiles struck the train station in Kramatorsk, a city in eastern Ukraine's Donetsk oblast, as thousands of civilians were gathered Friday awaiting evacuation to safer regions of the country, Ukrainian authorities said.",
    "The WeekThe New York Times\nThe White House has begun worrying about the possibility of a Marine Le Pen victory in France, concerned that a rebuke of incumbent Emmanuel Macron would upset the NATO military alliance and strengthen the position of Russian President Vladimir Putin.",
    "The Academy has faced criticism for not removing Smith during the event, and in a statement issued Friday, Academy President David Rubin and CEO Dawn Hudson acknowledged they \"did not adequately address the situation in the room,\" and \"for this, we are sorry.\"",
    "The civilian crew on the Ax-1 mission will \"spend eight days working and living aboard\" the International Space Station while \"conducting research that lays the groundwork for a full realization of the possibilities in low-Earth orbit,\" Axiom Space said.",
    "The vote, which Khan is expected to lose after several defections within his own party, was originally set for April 3rd but was blocked by the deputy speaker of Pakistan's parliament, after which Khan attempted to call for new elections.",
    "ReutersBBC\nRussia has appointed Gen. Alexander Dvornikov, who commands Russia's southern military district and \"has a lot of experience\" from \"Russian operations in Syria,\" to oversee the war in Ukraine, a Western official said Friday.",
    "Lisa Murkowski (Alaska), Mitt Romney (Utah), and Susan Collins (Maine), who voted alongside Democrats to confirm Supreme Court nominee Ketanji Brown Jackson on Thursday, received praise from President Biden on Friday.",
    "Ukrainian leaders have been warning of a major Russian offensive in the Donbas, the eastern region that includes Donetsk and Luhansk, and strongly encouraged civilians to leave while there is still safe passage out.",
    "Fox NewsThe Hill\nAxiom Space launched four private citizens into space Friday morning, marking the first time a crew consisting entirely of civilians has traveled to the International Space Station.",
    "\"I want to thank three Republicans who voted for Judge Jackson,\" Biden said during a celebratory event on the South Lawn of the White House, calling Collins and Murkowski women of \"integrity.\"",
    "According to a report released Friday, U.S. officials are concerned that Le Pen, a far-right populist, could pull France out of the sanctions against Russia and destabilize the NATO alliance.",
    "Ron DeSantis (R) said at a press conference Friday that if Democrat Stacey Abrams wins Georgia's upcoming gubernatorial election, it will lead to serious tensions between the two states.",
    "The WeekNBC News\nThe Academy of Motion Picture Arts and Sciences announced Friday that Will Smith will not be allowed to attend any Academy events, including the Oscars, for 10 years.",
    "U.S. District Judge Robert Jonker declared a mistrial for Adam Fox and Barry Croft, while Daniel Harris and Brandon Caserta were found not guilty of kidnapping conspiracy.",
    "Several Russian generals have died on the frontlines as they attempted to untangle tactical and logistical problems that arose due to the lack of proper coordination.",
    "His dad stood up and made these decisions on civil rights,\" alluding to how Romney's father  a Republican governor  marched in support of the civil rights movement.",
    "Gretchen Whitmer (D) were acquitted on Friday by a federal jury, which was unable to reach a verdict on similar charges against two other defendants in the case.",
    "Last September, SpaceX made history by launching the first all-civilian crew into orbit, a mission that involved the crew orbiting the Earth for three days.",
    "The text message from the former president's eldest son is among the documents obtained by the House select committee investigating the Jan. 6 Capitol riot.",
    "The verdict also seems to indicate that the jury agreed to at least some degree defense attorneys' claims that the four men were entrapped by FBI agents.",
    "The WeekThe New York Times\nPrime Minister Imran Khan of Pakistan said Friday that he will not step down if he loses an upcoming no-confidence vote.",
    "\"If Stacey Abrams is elected governor of Georgia, I just want to be honest, that will be a cold war between Florida and Georgia,\" DeSantis said.",
    "The first round of elections begins Sunday, and polls suggest Macron and Le Pen will likely advance to a close two-person showdown on April 24.",
    "Prior to Dvornikov's appointment, Western intelligence officials reportedly believed there was no single Russian commander overseeing the war.",
    "\"The rocket hit the temporary waiting room, where hundreds of people were waiting for the evacuation train,\" Donetsk regional police said.",
    "A statement from Trump Jr.'s lawyer says that \"given the date,\" the message \"likely originated from someone else and was forwarded.\"",
    "The mission will include former NASA astronaut Michael Lpez-Alegra and three customers: Larry Connor, Mark Pathy, and Eytan Stibbe.",
    "The country's Supreme Court subsequently ruled that blocking the vote was unconstitutional and ordered parliament to reconvene.",
    "Khan claims he is the victim of a regime change conspiracy orchestrated by the United States, a charge the U.S. denies.",
    "This reorganization comes after Russia's military withdrew from the Kyiv region, having failed to take the capital.",
    "The move comes in response to Smith slapping comedian Chris Rock at the 2022 Oscars over a joke about his wife.",
    "Decisions, one official said, were made by a number of high-ranking generals and officials in Moscow.",
    "In response to the verdict, Whitmer's office decried the \"normalization of political violence.\"",
    "The vote was scheduled for Saturday but appears to have been delayed again by Khan's allies.",
    "\"I can't have Castro to my south and Abrams to my north, that would be a disaster.",
    "The Washington PostThe Week\nTwo men accused of conspiring to kidnap Michigan Gov.",
    "So, I hope you guys take care of that and we'll end up in good shape.\"",
    "\"It's very simple,\" Trump Jr. reportedly texted Meadows on Nov. 5.",
    "\"We have multiple paths We control them all,\" he added later.",
    "Biden also commended Romney \"whose dad stood up like he did.",
    "All four were facing up to life in prison if convicted.",
    "Brian Kemp (R), who narrowly defeated her in 2018.",
    "The strike reportedly killed at least 52 people.",
    "Abrams is facing a rematch with Gov.",
    "PoliticoThe Week\nFlorida Gov.",
    "BBCThe Guardian\nGOP Sens.",
    "BuzzFeed NewsThe Week"
  ]
}