{
  "id": 5318,
  "mediaId": 12,
  "date": "4/5/2022 12:00:00 AM",
  "headline": "Georgia lawmakers create flat income tax, cutting $1 billion",
  "image": "https://www.ajc.com/resizer/dZofX6zRCBNNpnawDOcXFtsvGHg=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/HJJDYLQ2A7BZ2XDGAIELNL2LOY.jpg",
  "link": "https://www.ajc.com/news/georgia-news/georgia-lawmakers-create-flat-income-tax-cutting-1-billion/KRRBFXELIZBXVEQBXKPXQMKGGQ/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "JEFF AMY",
  "authorUrl": "",
  "termIds": [
    1178,
    2095,
    3744,
    428,
    575,
    2555,
    2672
  ],
  "sentences": [
    "After the first cut, the rate would gradually step down by 0.1 percentage points each year until it got to 4.99% However, tax cuts would pause any year in which state revenue doesnt grow 3%, any year that revenue is lower than any of the five previous years, or any year the state doesnt have more money in its savings account than the tax cut would cost.",
    "Kemp in his customary victory-lap speech early in the evening, could not thank lawmakers for their efforts, but instead had to urge them to keep working on a critically important conversation.?\nThe House kicked off the debate with a plan that would have created a flat 5.25% rate in 2024.",
    "ATLANTA (AP)  Georgia lawmakers are agreeing on plan to create a flat state income tax of 4.99% by 2029 or later, cutting taxes by more than $1 billion and delivering on a key Republican priority in the closing hours of the 2022 legislative session late Monday.",
    "The tax cut was a critical priority for Republicans including House Speaker David Ralston and Kemp, but negotiations dragged throughout the closing day of the 2022 session, at times threatening to take down legislation for other tax breaks.",
    "Those protections were demanded by Republican senators who feared the tax cut could starve the state of needed revenue after Georgia emerged from nearly two decades of austerity cuts to the state's K-12 school funding formula.",
    "Many of my caucus colleagues voted no on this bill, but once the bill was improved, many of us are voting yes to give Georgians back hard-earned money.? said House Minority Whip David Wilkerson, a Powder Springs Democrat.",
    "We havent been able to find anyone who pays more at all.?\nThe Senate voted 51-4 on Friday in favor of its version of House Bill 1437, which would gradually create a flat state income tax of 4.99% by 2032 or later.",
    "In an attempt to keep the measure from raising taxes on low-income taxpayers, the measure would create increased standard exemptions covering amounts someone could earn before beginning to pay state income taxes.",
    "Senate Finance Committee Chairman Chuck Hufstetler, a Rome Republican, said the cut would cost $455 million in its first year and Blackmon said it would cost more than $1.2 billion when fully enacted.",
    "Its simple, fair, and it allows hardworking Georgians to keep more of their hard-earned money,\" said House Ways and Means Committee Chairman Shaw Blackmon, a Bonaire Republican.",
    "One issue spurring Republicans on both sides of the dispute to action was the possibility that Democrat Stacey Abrams could be elected governor later this year.",
    "The measure would deliver an immediate flat tax of 5.49% on Jan. 1, 2024, a change most taxpayers would notice when they filed their income taxes in 2025.",
    "Also like the final bill, it preserved itemized deductions, meaning it would avoid the problem of increasing taxes on some affluent taxpayers.",
    "Brian Kemp has also agreed to create by executive order a tax council that would make a comprehensive examination of the states revenues.",
    "The House voted 167-2 and the Senate voted 41-13 to approve a joint House-Senate agreement on House Bill 1437, sending it to Gov.",
    "Democrats had initially opposed both plans, saying a flat tax is regressive and too much benefit flows to the richest Georgians.",
    "It would have eliminated many deductions, but increased the amount of income someone could earn before paying income tax.",
    "The bill calls for the House and Senate to make a thorough review of state tax breaks with a report due in December.",
    "The state's tax collections jumped over $30 billion last year, allowing big pay raises and spending increases.",
    "There was no formal revenue estimate prepared for what would be a major rewrite of the state tax code.",
    "They said that lowering tax collections would hurt the states ability to provide services.",
    "Married couples filing jointly would get an exemption that would grow to $24,000 by 2030.",
    "A single taxpayer or head of household would get a $12,000 exemption immediately.",
    "Now, Georgias top tax rate is 5.75%, with lower brackets below there.",
    "I do believe the bill is going to be responsible,\" Hufstetler said.",
    "Taxpayers could deduct $3,000 for each child or other dependent.",
    "But most Democrats broke and voted for the bill on Monday.",
    "Like the final bill, it included the trigger mechanisms.",
    "Blackmon said that wasn't the case with the compromise.",
    "Brian Kemp, who indicated he would approve a cut.",
    "We see savings across the board,\" he said.",
    "Hufstetler said Gov."
  ]
}