{
  "id": 5356,
  "mediaId": 195,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "GA state Senate sends permit-less carry handgun bill to Kemp",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2021/10/ca_gun_ammo_istock.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/3256581-ga-state-senate-sends-permit-less-carry-handgun-bill-to-kemp/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caroline Vakil",
  "authorUrl": "https://thehill.com/author/caroline-vakil/",
  "termIds": [
    2095,
    562,
    571,
    2537,
    2672
  ],
  "sentences": [
    "The legislation allows people to carry concealed handguns anywhere that a licensed permit holder can if they have not been involved in mental health treatment within the last five years or do not have felony or drug convictions, according to The Atlanta Journal-Constitution.",
    "I mean, we dont know how many people we kept safe by denying those permits.?\nMore than 20 other states allow for permitless concealed carry, according to the Pew Research Center, including Alabama, which signed similar legislation last month.",
    "I look forward to signing the Georgia Constitutional Carry Act of 2021 into law soon and fulfilling another promise I made to the voters of this state,? Kemp tweeted.",
    "The Georgia state Senate gave final approval on Friday to legislation that would allow people to carry a concealed handgun without a permit.",
    "The state Senate voted 34-22 on a motion to agree on the House substitute of the bill, the Georgia Constitutional Carry Act of 2021.",
    "I just told you the statistics that more than 5,000 people were denied permits likely because of criminal history and mental health.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Because its inconvenient for law-abiding citizens to fill out a form?? state Rep. Shea Roberts (D) said last month.",
    "Supporters of the legislation argue that citizens are allowed to bear arms under the Second Amendment.",
    "However, opponents worry that the measure could contribute to a rise in violence, the newspaper noted.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Youre wanting to relax what little check we have and why?",
    "The legislation is expected to be signed by Gov.",
    "Brian Kemp (R).",
    "What for?"
  ]
}