{
  "id": 5380,
  "mediaId": 12,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "Clayton Sheriff Victor Hill pleads not guilty to new federal charges",
  "image": "https://www.ajc.com/resizer/QBYHIPICBSO5xoHRp-hMIvMvkGc=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/WDUFI7HDN5BSJCHYMNXPF522GE.png",
  "link": "https://www.ajc.com/news/atlanta-news/clayton-sheriff-victor-hill-pleads-not-guilty-to-new-federal-charges/XTBLO4W4ZBEWXMHOAKPWU5LOPM/",
  "sentiment": "0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Leon Stafford",
  "authorUrl": "https://www.ajc.com/staff/leon-stafford/",
  "termIds": [
    2095,
    3745,
    4366,
    4429,
    2613,
    4941
  ],
  "sentences": [
    "Hills attorneys entered the not guilty plea during an arraignment before U.S. Magistrate Judge Russell Vineyard on charges the controversial sheriff allegedly violated the civil rights of two detainees in the Clayton County jail by strapping them into restraint chairs as a form of punishment.",
    "The apparent need that the government feels to keep going back to the grand jury with information they most certainly had already from their investigation is painfully obvious and an indication that they are not confident in their case,? attorneys Drew Findling and Marissa Goldberg.",
    "As we have said and continue to reiterate, the use of a restraint chair as a tool of law enforcement is universally accepted and common and necessary to maintain order and safety in any correctional facility,? they said in the statement.",
    "In the new charges, Hill is accused of ordering detainees identified as R.P.? and D.B.? be put in restraint chairs after the two men ran afoul of the sheriff in December 2019 and February 2020 respectively.",
    "Jessica Cino, a partner with law firm Krevolin Horst, said the growing list of charges could be a result of increased leads or more people coming forward because there is security in numbers.",
    "The Clayton sheriff was indicted by federal authorities in April on civil rights violations after he was accused of ordering four men be put in restraint devices.",
    "Federal law allows use of a restraint chair to keep inmates from harming themselves or someone else, but the chairs must not be used as a form of punishment.",
    "A lot of times that is the product of pressure points,? said Cino, who added she can only speculate as she is not part of the investigation.",
    "Lawyers for Clayton County Sheriff Victor Hill told a judge Thursday the lawman is not guilty of new federal civil rights violation charges.",
    "They (prosecutors) identify a way to pressure that person to finally give the testimony that they had up until now been silent about.?",
    "What has not changed with this new indictment is that it still fails to allege any criminal conduct by or on behalf of Sheriff Hill.",
    "It was the second superseding indictment since the original charges in April (The other superseding indictment was filed in August).",
    "One of the detainees was a 17-year-old who allegedly vandalized his family home after getting into an argument with his mother.",
    "Thursdays arraignment was to answer to two new charges federal authorities added in a superseding indictment in late March.",
    "In a statement Thursday, Hills attorneys said the new charges are more of the same? from federal authorities.",
    "Another was a Butts County landscaper who got into a heated argument with Hill over a Clayton deputys bill.",
    "The indictment also re-alleged charges in the cases of the five other detainees from previous indictments.",
    "Hill waived his appearance and was not at the Thursday arraignment, which lasted less than five minutes.",
    "Brian Kemp in June, but remains Clayton Countys sheriff.",
    "Hill has pleaded not guilty to all charges.",
    "He was suspended from duty by Gov."
  ]
}