{
  "id": 5405,
  "mediaId": 124,
  "date": "3/30/2022 12:00:00 AM",
  "headline": "Georgia lawmakers gut controversial elections bill",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220330-georgia-ballots-mn-1130-e7a486.jpg",
  "link": "https://www.nbcnews.com/politics/georgia-lawmakers-gut-controversial-elections-bill-rcna22198",
  "sentiment": "0.0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    4795,
    558,
    571,
    2672,
    5022
  ],
  "sentences": [
    "One elections supervisor said during Mondays hearing that such proposals amounted merely to security theater.? Many expressed concern about the possibility of implementing even more changes to elections, while they continued to carry out the changes mandated by last years sweeping election law.",
    "1464, which passed the state House earlier this month, proposed empowering the Georgia Bureau of Investigation to hunt for election code violations and would have given the statewide agency power to subpoena documents with the consent of the attorney general and conduct any audits it sees fit.",
    "If the full Senate votes on the slimmed-down bill, lawmakers from both the House and Senate would then hold a conference committee to reconcile differences between the two different versions of the bill  which could still result in some of the stripped-out measures being included.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nVoting rights advocates said that such proposals would create long lines at the polls, would keep counties from much-needed grant money and would make it easier for third-party groups to conduct audits.",
    "Brian Kemp, who had championed the 2021 bill, had said in January that he felt it was not necessary to further change elections laws after the previous year's overhaul  though in recent days, he and other top Republicans in the state appear to have backed off that position.",
    "The committees vote Tuesday night followed a day of testimony from a bipartisan group of election workers across the state whod expressed opposition to the bills proposed ballot handling rules and outside donation restrictions.",
    "Lawmakers in Georgia on Tuesday night stripped down an elections bill that would have given the state's bureau of investigations jurisdiction over voter fraud cases, among other measures, following pushback from state workers.",
    "The bill also proposed limiting the required number of voting machines counties must provide on Election Day and would have provided new rules for how outside groups could provide donations or grants to election workers.",
    "The bill that advanced features only one element of the original proposal: expanding the amount of time that voters can take off from their job to vote during the states early-voting period.",
    "In addition, the original bill proposed adding restrictions to how ballots are handled before elections while removing the requirement that ballots be sealed for two years after elections.",
    "In a unanimous 10-0 vote, members of the state Senates Ethics Committee opted to substitute a significantly more narrow, two-page election reform bill in place of the original 39-page one.",
    "The move effectively kills the most controversial items of the original bill, including giving the states bureau of investigations jurisdiction over election crimes and voter fraud.",
    "Many of those same advocates claimed victory after the committee vote: a coalition of groups opposed to the original bill said it had been defeated.\"",
    "Well just continue working on these issues that were in the bill and try to find some middle ground.? The current legislative session ends April 4.",
    "The original bills sponsor, state Rep. James Burchett, said at the Senate committee hearing he felt lawmakers could pass additional measures.",
    "Georgia's proposals are part of a much broader trend of voting restrictions proposed in states with Republican-controlled legislatures.",
    "The originally proposed legislation came after state Republicans passed the so-called \"Election Integrity Act,\" last year.",
    "Lawmakers, however, still have until Monday night to continue debating, and voting, on changes to election rules.",
    "That added ID requirements for mail voters and limited the use of ballot drop boxes, among other changes.",
    "This is one of the most politicized issues across the country,? Burchett said.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "The original bill, H.B.",
    "Republican Gov."
  ]
}