{
  "id": 5451,
  "mediaId": 1390,
  "date": "3/28/2022 12:00:00 AM",
  "headline": "Ridiculously high gas prices crushing GA food truck business",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/04dfc6c3-fa73-47ed-9cce-1b83103be4ba/d7df2ad0-05f5-42a8-82ca-2e07ffabc942/1280x720/match/image.jpg",
  "link": "https://news.google.com/__i/rss/rd/articles/CBMiamh0dHBzOi8vd3d3LmZveGJ1c2luZXNzLmNvbS9lY29ub215L3JpZGljdWxvdXNseS1oaWdoLWdhcy1wcmljZXMtaW1wYWN0aW5nLWJvdHRvbS1saW5lLWdhLWZvb2QtdHJ1Y2stb3duZXLSAQA?oc=5/",
  "sentiment": "0.0",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Talia Kaplan",
  "authorUrl": "https://www.foxbusiness.com/person/k/talia-kaplan",
  "termIds": [
    2095,
    3965,
    3120,
    2555,
    2672,
    2674
  ],
  "sentences": [
    "In an appearance on \"Cavuto: Coast to Coast,\" Black Market BBQ CEO Jon German revealed what has been the biggest impact on his business as a result of the current economic climate, telling host Neil Cavuto that the \"absurdly high\" gas prices are \"really affecting our growth.\"",
    "\"We have our food trailer, we do catering, we bottle our own barbecue sauce, but I want to break out into doing concessions and doing other things and as of right now, I just cant do that and its basically because of the ridiculously high gas prices we have right now.\"",
    "GET FOX BUSINESS ON THE GO BY CLICKING HERE\nWhen Cavuto asked German if the move has helped, he responded by saying, \"I see it as more of a nice gesture because, lets just be honest, my truck that I use to pull my food trailer with takes premium gas.\"",
    "CLICK HERE TO READ MORE ON FOX BUSINESS\nThe national average for gas on Monday was $4.25, slightly higher than the day before and 64 cents higher than the month before, according to AAA.",
    "Brian Kemp on Friday signed a law suspending Georgia's motor fuel tax through the end of May in an attempt to alleviate the inflationary pressure at the pump.",
    "The gasoline price in the state includes a federal tax of 18.4 cents per gallon and a state tax of 29.1 cents per gallon.",
    "The CEO of a food truck in Atlanta noted on Monday that the \"ridiculously high\" gas prices are impacting his bottom line.",
    "\"Its providing us a more difficult time in expanding our capabilities and expanding into other things,\" he said.",
    "Federal taxes on diesel fuel are 24.4 cents per gallon, while Georgias tax on diesel is 32.6 cents per gallon.",
    "\"I filled up yesterday, and it was $4.49 a gallon, so does it have any real effect or any relief?",
    "AIRLINES SLASH FLIGHTS AMID RISING FUEL, OIL PRICES\nRepublican Georgia Gov.",
    "The previous record high was $4.33, set on Friday March 11, 2022.",
    "Additionally, some cities and counties charge taxes.",
    "The Associated Press contributed to this report.",
    "Absolutely not, no,\" he stressed."
  ]
}