{
  "id": 7080,
  "mediaId": 223,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "The Press Is Actively Changing the Language to Push Its Abortion Agenda",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2022/140/d58a3eca-dc99-49f4-977d-61ebe76f364e.png",
  "link": "https://townhall.com/columnists/bradslager/2022/05/20/the-press-is-actively-changing-the-language-to-push-its-abortion-agenda-n2607603",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Slager",
  "authorUrl": "https://townhall.com/columnists/bradslager/",
  "termIds": [
    1147,
    1502,
    1917,
    2095,
    5255,
    5260,
    5300,
    5357,
    106,
    2590,
    2661
  ],
  "sentences": [
    "NEW from me and @kaitlancollins: the West Wing has been thrown into crisis mode over the baby formula shortage, trying to restock shelves while coming under fire for a mess they didn't create and which they're still working to grasp the scope of https://t.co/phpMmI0jGH\n Edward-Isaac Dovere (@IsaacDovere) May 20, 2022\nLow Octane Gas Lighting  THE BULWARK\nOver at the leaky ship the S.S. Bulwark, Brent Orrell writes a lengthy missive where he relies on pure fantasy to draw up the possibility of the demise of the GOP entire.",
    "Since the abortion debate has raged anew with the leaked SCOTUS draft opinion showing Justices are poised to overturn Roe v. Wade, news outlets have been leaning on this new designation in their coverage of the matter, indicating a stark change from the years of going with pro-life/pro-choice to label either side.",
    "The latest to put up the defense shields is Kaitlan Collins and Edward Isaac-Dovere, who try to explain that Biden simply has no influence over government agencies like the FDA, so when a formula factory was forced to close by the agency in February, and no action was taken until recently, IT WAS NOT JOE'S FAULT!",
    "https://t.co/haZel40Cdm pic.twitter.com/V0jtVzpSY9\n Kyle Cheney (@kyledcheney) May 19, 2022\nDNC PR Firm  CNN\nAs the baby formula crisis continues, the press continues to go out of their way to clear the administration of responsibility despite  you know  being the ones in charge.",
    "05.20.22\nGlossary Over Things  VARIOUS OUTLETS\nThe arrangement has been made\nIt was a bit of a curiosity as news came out of Madison, Wisconsin, earlier in the month when a molotov cocktail was used to target the offices of Wisconsin Family Action.",
    "Following its eyebrow-raising employment letter, which essentially told employees to get over themselves over woke petty complaints or look for work elsewhere, Netflix is showing more of a tendency to distance itself from woke content.",
    "BREAKING: The Jan. 6 select committee says it has obtained evidence that Rep. Barry Loudermilk (R-GA) led a tour through the Capitol on Jan. 5, 2021  contradicting earlier denials by GOP lawmakers that any tours occurred that day.",
    "\"https://t.co/LwIFryV1X8\n ProPublica (@propublica) May 20, 2022\nPresentation Paradox  POLITICO\nThe latest bombshell/trap/walls-are-closing-in announcement from the to-this-point impotent January 6 Commission has been released.",
    "LOUDERMILK says he was leading a \"constituent family\" through the Capitol on Jan. 5  a fact he hadn't disclosed before today  and that none of them havce been investigated or charged for Jan. 6 related activities.",
    "https://t.co/DyetdcrVz4\n The Bulwark (@BulwarkOnline) May 19, 2022\nGilded Reframe  NETFLIX\nIt looks like companies may be awakening to the fact that being woke is not optimal for business.",
    "His wishcasting that the GOP will fade on a national level is countered by the fact that people are flooding into red states like Texas and Florida as California and New York shrink.",
    "Netflix Scraps Several Animated Projects, Including Ava DuVernays Wings of Fire and Antiracist Baby (EXCLUSIVE) https://t.co/WyXNzBBBVh\n Variety (@Variety) May 17, 2022",
    "This follows another recent announcement that a project involving Meghan Markle, a feminist journey told through the experiences of a 12-year-old girl, was canceled.",
    "We'll look to bring accountability to the mishaps, malaprops, misdeeds, manipulations, malpractice, and manufactured narratives in mainstream media.",
    "Orrell claims the GOP is alienating itself from the political center, as every poll shows Independents sliding away from Biden and the Democrats.",
    "He claims governorships are going to Dems, despite statewide gains last election and a midterm showing either a red wave or a red tidal wave.",
    "Even The Atlantic sees this is not the case, and CNN notes Trump is stepping back from endorsements after a mixed result so far in primaries.",
    "Announcements recently went out about a number of projects the company has decided to cancel or refuse to go forward with productions.",
    "\"Riffed from the Headlines\" is Townhall's daily VIP feature with coverage of the deeply flawed aspects of journalism in the nation.",
    "Six years of lying and conspiracy theories are threatening the Republican suburban-rural electoral coalition across the country.",
    "It's as if Brent is oblivious to Glenn Younkin winning without Trump and Brian Kemp excelling in spite of his rift with the man.",
    "Then Kyle shows us details that are far less dramatic and would not warrant the use of BREAKING or BOMBSHELL in reports.",
    "The anti-abortion movement has claimed that women who have abortions are likely to suffer psychologically as a result.",
    "The latest leak comes from Kyle Cheney of Politico, and it sure sounds like they have the Republicans dead to rights.",
    "A number of news outlets described the organization not as a pro-life organization but as \"an anti-abortion group.\"",
    "THIS TIME there is ironclad proof of inside intelligence from the GOP to assist the rioters of the Capitol!",
    "He also tries to fabricate a rift within the party as he says that \"non-Trump candidates are non-starters.\"",
    "They may have been given a tour, and there was no indication of any connection to Jan.6 at all.",
    "Two are the product of CRT racial activist Dr. Ibram X. Kendi, and one is from Eva DuVernay.",
    "Story TK\n Kyle Cheney (@kyledcheney) May 19, 2022\nAnd then, Kyle promptly starts hedging.",
    "It is a clear indicator of where the journalism complex is coming to rest on this issue.",
    "\"The majority of women who have abortions express relief as opposed to regret.",
    "But sure, you go cling to your blue blanket, Brent.",
    "\"The opposite is true,\" says Prager.",
    "Possibly?",
    "Finally.",
    "Maybe?"
  ]
}