{
  "id": 7338,
  "mediaId": 25,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Primary results 2022: Georgia, Alabama, Arkansas, Texas runoff and Minnesota special election primary results",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/05/23/98d53f22-567f-4fe3-81e3-2a68dcc57bb8/thumbnail/620x390/44e17c381a2b1b37826b73b22e6392fe/perdue-kemp-georgia-primary.jpg",
  "link": "https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/",
  "sentiment": "0.206",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    896,
    1147,
    1664,
    1896,
    2095,
    2203,
    2230,
    2475,
    3082,
    2537,
    2551,
    2672,
    2934
  ],
  "sentences": [
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-5882452c</div>\n link copied\n5:31 PM\nMinnesota 1st District special election Republican primary results\nJennifer Carnahan, Matthew Benda, Bob Carney Jr., J.R. Ewing, Brad Finstad, Kevin Kocina, Jeremy Munson, Niels Pierson and Roger Ungemach are running for the Republican nomination in Minnesota's 1st District special election.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-953f77c6</div>\n link copied\n5:32 PM\nMinnesota 1st District special election Democratic primary results\nRick DeVoe, Richard Painter, Warren Anderson, Sarah Brakebill-Hacke, Candace Deal-Bartell, Jeff Ettinger and James Rainwater are running for the Democratic nomination in Minnesota's 1 District special election.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-410ff03c</div>\n link copied\n5:37 PM\nU.S. House Georgia 10th District Republican primary results\nVernon Jones, Timothy Barr, Paul C. Broun, Mike Collins, David Curry, Marc McMain, Alan Sims and Mitchell Swan are running for the Republican nomination in Georgia's 10th District.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-700c7f67</div>\n link copied\n5:37 PM\nU.S. House Georgia 14th District Republican primary results\nRep. Marjorie Taylor Greene, Eric Cunningham, James Haygood, Jennifer Strahan and Seth Synstelien are running for the Republican nomination in Georgia's 14th District.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-eece88eb</div>\n link copied\n5:39 PM\nU.S. House Georgia 2nd District Republican primary results\nVivian Hunt, Jeremy Hunt, A. Wayne Johnson, Richard Robertson, Chris West and Paul Whitehead are running in the Republican nomination in Georgia's 2nd District.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-9e677b18</div>\n link copied\n5:39 PM\nGeorgia Secretary of State Democratic primary results\nDee Dawkins-Haigler, John Eaves, Floyd Griffin, Bee Nguyen and Michael Owens are running for the Democratic nomination for Georgia Secretary of State.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-be093f90</div>\n link copied\n5:39 PM\nGeorgia Secretary of State Republican primary results\nBrad Raffensperger, Jody Hice, Torri M. Hudson and David Belle Isle are running for the Republican nomination for Georgia Secretary of State.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-f912f6e5</div>\n link copied\n5:40 PM\nGeorgia Senate Republican primary results\nHerschel Walker, Gary Black, Kelvin King, Jonathan McColumn and Latham Saddler are running for the Republican nomination for U.S. Senate in Georgia.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-2ab9adc2</div>\n link copied\n5:37 PM\nAlabama Senate Republican primary results\nMo Brooks, Michael Durant, Lillie Boddie, Katie Britt, Karla DuPriest and Jake Schafer are running for the Republican nomination for Alabama Senate.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-b7ead1a2</div>\n link copied\n5:38 PM\nU.S. House Georgia 7th District Democratic primary results\nCarolyn Bourdeaux, Lucy McBath and Donna McLeod are running for the Democratic nomination in Georgia's 7th District.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-475d12b4</div>\n link copied\n5:35 PM\nArkansas Senate Republican primary results\nSen. John Boozman, Jake Bequette, Heath Loftis and Jan Morgan are running for the Republican nomination for U.S. Senate in Arkansas.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-f61fbd04</div>\n link copied\n5:34 PM\nU.S. House Texas 28th District Democratic primary runoff results\nHenry Cuellar and Jessica Cisneros are running in the Democratic primary runoff in Texas' 28th District.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-0572f5e7</div>\n link copied\n5:33 PM\nU.S. House Texas 28th District Republican primary runoff results\nCassy Garcia and Sandra Whitten are running in the Republican primary runoff in Texas' 28th District.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-5f69d6ce</div>\n link copied\n5:38 PM\nU.S. House Georgia 2nd District Democratic primary results\nRep. Sanford Bishop and Joseph O'Hara are running for the Democratic nomination in Georgia's 2nd District.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-402e89b9</div>\n link copied\n5:34 PM\nTexas Attorney General Republican primary runoff results\nKen Paxton and George P. Bush are running in the Republican primary runoff for Texas attorney general.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-1c9ba27c</div>\n link copied\n5:35 PM\nArkansas Governor Republican primary results\nSarah Huckabee Sanders and Doc Washburn are running for the Republican primary for Arkansas governor.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-42fea7e3</div>\n link copied\n5:38 PM\nU.S. House Georgia 7th District Republican primary results\nMichael Corbin, Mark Gonsalves, Lisa McCoy, Y.G.",
    "In an effort to oust Kemp, Trump backed former Sen. David Perdue  who lost his seat in a runoff election to Democrat Jon Ossoff, one of two Democrats elected to Georgia's Senate seats in 2020, thereby handing the Senate majority to the Democrats.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-01d66074</div>\n link copied\n5:35 PM\nAlabama Governor Republican primary results\nGov.",
    "No state has felt former President Donald Trump's wrath over the 2020 election more than Georgia, where he is trying to oust the incumbents in statewide office who certified that President Joe Biden won the state.",
    "Meanwhile, freshman U.S. Rep. Majorie Taylor Greene, who was originally elected in one of the reddest districts in the country, is facing several primary challengers in a new, less conservative district.",
    "Rep. Lucy McBath, who defeated a Republican incumbent in 2018 in the 6th District, is now in the same district as Rep. Carolyn Bourdeaux, who was the only Democrat to oust a Republican incumbent in 2020.",
    "After Trump pulled his endorsement, Brooks, who was one of the members of Congress who objected to election results, said the former president \"asked me to rescind the 2020 elections.\"",
    "Kay Ivey, Lynda Blanchard, Lew Burdette, Stacy George, Tim James, Donald Jones, Dean Odle, Dave Thomas and Dean Young are running for the Republican nomination for Alabama governor.",
    "<div>https://www.cbsnews.com/live-updates/primary-results-2022-georgia-alabama-arkansas-texas-runoff-minnesota-special-election-2022-05-24/#post-update-7f5753b5</div>\n link copied",
    "In Arkansas, Trump's former White Housepress secretary, Sarah Huckabee Sanders, is expected to win the gubernatorial primary, after leading the pack in fundraising and polling.",
    "A recent Emerson poll showed Katie Britt (32%), current Sen. Richard Shelby's former chief of staff, slightly ahead of businessman Michael Durant (26%) and Brooks (25%).",
    "Secretary of State Brad Raffensperger, whom Trump asked in January 2021 to \"find\" enough votes to overturn the results, is also running for reelection .",
    "Brian Kemp, former Sen. David Perdue, Kandiss Taylor, Catherine Davis and Tom Williams are running for the Republican nomination for Georgia governor.",
    "In Texas' 28th District, incumbent Rep. Henry Cuellar faces Jessica Cisneros after Cuellar failed to net 50% of the vote in the March 1 primary.",
    "The Georgia secretary of state's office tweeted Tuesday that the state is on a \"solid path\" to surpass the record for midterm primary turnout.",
    "And Texas Attorney General Ken Paxton  mired in many scandals  is facing Land Commissioner George P. Bush  the son of former Florida Gov.",
    "According to an April poll by the Texas Hispanic Policy Foundation, 40% of Republican primary voters said they would never vote for Bush.",
    "He first backed longtime loyalist Mo Brooks, but later dropped his endorsement in March, when Brooks was struggling in the polls.",
    "Joe Raedle/Getty Images, Joe Raedle/Getty Images\nTwo Democratic incumbents are facing off in Georgia's new 7th District.",
    "He's one of the House Republicans who challenged the election results in Pennsylvania and Arizona on Jan. 6, 2021.",
    "A few crucial runoffs are happening in Texas, which dealt with a shooting Tuesday near San Antonio.",
    "Trump has made his prefences known in the the Senate race for the open seat in Alabama  twice.",
    "If neither candidate receives 50% of the vote, the race will go to a runoff election in June.",
    "But Bush has faced backlash from his family name, and Paxton has a comfortable lead in polls.",
    "Nyghtstorm and Mary West are running for the Republican nomination in Georgia's 7th District.",
    "Forty-one percent said they wouldn't vote for Bush because he's not conservative enough.",
    "Two-thirds of those voters said that's because he is a member of the Bush family.",
    "Despite losing Trump's endorsement, Brooks has managed to hold on in the polls.",
    "The winner will take on Democrat Stacey Abrams, whom Kemp defeated in 2018.",
    "Jeb Bush and grandson of former Presidents George W. Bush and George H.W.",
    "Her father, Mike Huckabee, was Arkansas governor from 1996 until 2007.",
    "A Fox News poll released last week showed Kemp leading Perdue 60%-28%.",
    "Brian Kemp and Secretary of State Brad Raffensperger in particular.",
    "But voters in the state appear ready to deliver a rebuke to Trump.",
    "5:42 PM\nGeorgia Governor Republican primary results\nGeorgia Gov.",
    "Alabama and Arkansas are also holding primaries Tuesday.",
    "Trump backed U.S. Rep. Jody Hice in the race.",
    "Trump has set his sights on Gov.",
    "David Perdue and Brian Kemp.",
    "Bush."
  ]
}