{
  "id": 7439,
  "mediaId": 238,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Seven primaries to watch Tuesday, while all eyes are on Georgia",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/24/primaries-to-watch-may-24-georgia/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amber Phillips",
  "authorUrl": "https://www.washingtonpost.com/people/amber-phillips/",
  "termIds": [
    815,
    896,
    1147,
    1154,
    1434,
    1459,
    2095,
    428,
    2672
  ],
  "sentences": [
    "By contrast, Cuellar is the last remaining House Democrat to oppose abortion rights, an issue that has suddenly become elevated thanks to an impending Supreme Court ruling that could knock down abortion rights across the nation.",
    "Earlier in this election cycle, Trump endorsed Sean Parnell, who dropped out of the GOP Pennsylvania Senate contest after losing custody of his children in a divorce battle in which his wife accused him of domestic violence.",
    "In Georgia, two popular House Democrats are facing off in a primary after Lucy McBath decided to leave her district, which was redrawn to be more Republican, and challenge Carolyn Bourdeaux in this safer Democratic district.",
    "Kemp is heavily favored to win, and has the backing of the Republican Governors Association  which normally stays out of primaries, The Washington Post previously reported  as well as an endorsement from Trumps former No.",
    "In Nebraskas gubernatorial primary this month, Trump endorsed one of his political donors, Charles Herbster, who is accused by eight women, including a Republican state senator, of inappropriately touching them.",
    "Few Republican politicians championed Trumps false 2020 fraud claims as vocally as Rep. Mo Brooks of Alabama, who spoke at the Jan. 6 Stop the Steal rally and is running for the states open Senate seat.",
    "His top aides have accused him of abuse of office and bribery; he fired whistleblowers in his office; the top U.S. Senate Republican in Texas, John Cornyn, said he is troubled by the allegations.",
    "Politicians try to draw lines that benefit their party (called gerrymandering), but sometimes they wind up with new districts that pit some of their own lawmakers against each other.",
    "She has the backing of Rep. Alexandria Ocasio-Cortez (D-N.Y.) and argues that in this heavily Hispanic district, voters support more liberal policies like Medicare-for-all.",
    "The incumbent, Brad Raffensperger, played a major role in 2020 in standing up to Trumps false claims, though the outgoing president put enormous pressure on him.",
    "Shes the leading name running on the Republican side, and shes distancing herself somewhat from Trump: I constantly get asked, will you be more like your dad?'",
    "As with the governors race, Trump has planted his flag in Georgias secretary of state race to show his party is behind him on his false election fraud claims.",
    "Shes the former chief of staff for the senator vacating the seat, Richard C. Shelby, who has said hell spend millions of his own money to get her elected.",
    "The loser will lose their seat in Congress  a tough hit for Democrats as they try to hold onto their three-seat majority in Novembers midterm elections.",
    "Once an establishment Republican figure, Perdue lost his Senate seat in the 2021 runoff  a loss GOP Senate leaders blame on Trump and his fraud claims.",
    "), who is facing a somewhat unexpected challenge from a former NFL football player, Jake Bequette, who has the backing of a conservative billionaire.",
    "The bigger test for Walker will be in November, when the winner of the Republican Senate primary in Georgia tries to unseat Raphael G. Warnock (D).",
    "Votes are still being counted in last weeks Democratic primary in Oregon where Rep. Kurt Schrader (D), whom President Biden endorsed, could lose.",
    "Walker has been accused of domestic violence  his ex-wife alleges he pointed a gun at her head  and of exaggerating his financial success.",
    "After votes were counted and confirmed, Trump called a reluctant Raffensperger, urging him to find just enough votes to flip the state.",
    "Hes heavily focused on Georgias intraparty battles as a test of the Republican Partys support of his false claims of election fraud.",
    "Tuesday may be the most significant primary day yet  potentially of the entire election season  for former president Donald Trump.",
    "Warnock won his Senate seat last year in a runoff, and is one of the most vulnerable Senate Democrats up for election this year.",
    "(Saying you want to focus on the future is often the code GOP politicians use when they dont agree with Trumps false claims.)",
    "In March, a 28-year-old liberal forced one of Texass longest-serving House Democrats into a runoff, which takes place today.",
    "Democrats have some drama Tuesday, too, with liberal challengers poised to score a big win against the partys establishment.",
    "Its not easy to beat a sitting governor, Trump told The Post in an interview, setting expectations low for this primary.",
    "He is facing a federal investigation, and has been indicted by a state grand jury on felony charges of securities fraud.",
    "If Cuellar loses, he could be the second Democratic member of Congress in a week to lose to a liberal challenger.",
    "Brian Kemp (R) is as conservative as they come, but he refused to help Trump overturn his 2020 loss in the state.",
    "But now Perdue is wholeheartedly embracing false election claims in his bid to unseat Georgias sitting governor.",
    "That brings us to Texas, where attorney general Ken Paxton (R) was forced into a runoff against George P. Bush.",
    "Every decade, based on new census data, every state redraws its congressional and state legislative districts.",
    "(He has had mixed success in the partys recent contests in Idaho, Nebraska, North Carolina and Pennsylvania.)",
    "He had Trumps endorsement  then Trump revoked it after Brooks said he wanted to focus on future elections.",
    "Walker has said he struggled with mental illness and framed his political career as a story of resilience.",
    "This Republican primary is crowded, but former football star Herschel Walker is expected to win easily.",
    "Now Brooks is trying to win without Trump against well-funded opponents Katie Britt and Mike Durant.",
    "McBath has more national prominence, running for office after her son was killed by gun violence.",
    "One of Trumps most visible defenders during his term is now running for governor of Arkansas.",
    "So Trump recruited a marquee name to challenge him  former Republican senator David Perdue.",
    "Hes a first-time candidate and has the backing of both Trump and top Senate Republicans.",
    "Hes not good on election integrity, and he did a terrible job on election integrity.",
    "This month, a federal judge threw out his lawsuit claiming election fraud in 2020.",
    "In 2020, Trump became the first Republican president to lose the state since 1992.",
    "His dad was governor of Florida; his uncle and grandfather were both presidents.)",
    "Sanders is also campaigning for the reelection of Sen. John Boozman (R-Ark.",
    "Bush has been the state land commissioner, an elected office in Texas.",
    "Jessica Cisneros is actually a former intern for Rep. Henry Cuellar.",
    "Her father, Mike Huckabee, also served as the governor of Arkansas.",
    "Sarah Sanders is the former White House press secretary for Trump.",
    "This race is very tight  offering Trump a potentially major win.",
    "Just netting Georgia would put Republicans back in the majority.",
    "Cisneros also ran against Cuellar two years ago and nearly won.",
    "Paxton has spent the past few years mired in serious scandal.",
    "Im going to be Sarah Sanders, she told the Associated Press.",
    "Britt has particularly strong ties to Alabama politics.",
    "Of Kemp, he said: Im the one who got that guy elected.",
    "Two years later, Trump is backing Rep. Jody Hice (R).",
    "Thats largely because of one state: Georgia.",
    "Perdue has had a windy path to Trumpism.",
    "But hes a somewhat risky choice.",
    "or will you be like Trump?'",
    "I endorsed him, and he won.",
    "(Yes, of that Bush family.",
    "Well see what happens.",
    "2, Mike Pence.",
    "Herbster lost.",
    "Georgia Gov."
  ]
}