{
  "id": 7480,
  "mediaId": 157,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Georgia set to test Trump's US voter fraud 'Big Lie'",
  "image": "https://www.rawstory.com/media-library/david-perdue-and-donald-trump.jpg?id=28328612&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/georgia-set-to-test-trump-s-us-voter-fraud-big-lie/",
  "sentiment": "-0.569",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Agence France-Presse",
  "authorUrl": "https://www.rawstory.com/u/agence_france-presse",
  "termIds": [
    815,
    1147,
    1434,
    2087,
    2095,
    4325,
    2617,
    2672,
    2945
  ],
  "sentences": [
    "Four other states -- Texas, Arkansas, Alabama and Minnesota -- are also picking contenders for November's midterm elections, which will decide which party controls the US Senate and House of Representatives for the remainder of President Joe Biden's first term.",
    "Up and down the ballot, the Republican side of the Georgia primary pits candidates peddling the former president's false claims of widespread election fraud against hopefuls who pushed back in defense of the Constitution.",
    "Biden was the first Democratic presidential candidate since 1992 to win Georgia, while Raphael Warnock and Jon Ossoff triumphed in runoff elections in January 2021 that wrested control of the US Senate from Republicans.",
    "But Trump did offer an 11th-hour endorsement of the \"conservative fighter\" -- and landed swipes at his opponent, charging in a statement Tuesday that Kemp had \"failed Georgia\" and \"allowed massive Election Fraud.\"",
    "Trump, who banked much of his own political capital in the race, faces humiliation if Kemp's lead holds -- undermining his push to make his nationwide endorsements a sign of his continuing sway over the party.",
    "Dead heat\nAfter sinking $2.5 million of his own campaign funds into the Perdue effort, the former president appeared largely to have given up on the candidate, declining to visit his state in the home stretch.",
    "Pence's support for a candidate Trump reviles marks a high-profile clash between the former president and his White House wingman, and only highlights the party's internal tug of war over its future direction.",
    "In the contest to be the next governor, incumbent Brian Kemp, frequently the target of Trump's wrath for refusing to help overturn the election, leads former senator David Perdue by more than 20 points.",
    "Abrams is unopposed in her effort to unseat Kemp in November and Warnock is expected to sail through his primary before facing a challenge from Trump-backed former football star Herschel Walker.",
    "Democrats fear that, across the country, Trump will be able to install loyalists who can weaponize specious fraud accusations from 2020 to make it harder for his opponents to vote in 2024.",
    "Kemp's confidence in victory over his imploding opponent was apparent Monday at a rally in Cobb County with former vice president Mike Pence, where neither man mentioned Perdue once.",
    "He faces Jody Hice, one of more than a dozen Trump-backed candidates across America bidding to become secretary of state and professing to believe the 2020 election was stolen.",
    "Republican voters in the battleground US state of Georgia appeared set Tuesday to deliver a stark repudiation of Donald Trump's \"Big Lie\" that the 2020 election was stolen.",
    "Perdue has made bogus claims about 2020 a centerpiece of his campaign, in a direct appeal to Trump supporters who continue wrongly to question the validity of the outcome.",
    "But all eyes are on the Peach State, where wounds from the 2020 presidential election are still festering two years after Trump lost there by the narrowest of margins.",
    "Georgia's Democrats are doing all they can to cement those gains, headlined by news that Democratic star campaigner Stacey Abrams is reprising her bid for governor.",
    "They point to an April University of Georgia poll showing almost 60 percent of Republican voters said they were confident that November's midterms would be fair.",
    "The four-term congressman was also among 147 House Republicans who voted against certifying the results for Biden without evidence of election fraud.",
    "The race to be Georgia's secretary of state is seen as equally consequential, as these are the officials who oversee elections in the United States.",
    "As the man responsible for certifying Georgia's 2020 election results, Brad Raffensperger was in lockstep with Kemp in pushing back against Trump.",
    "In an April poll published by The Atlanta Journal-Constitution and the University of Georgia, Raffensperger and Hice were in a dead heat.",
    "\"I was for Brian Kemp before it was cool,\" Pence told a cheering crowd of a few hundred at an airfield on the outskirts of Atlanta.",
    "But some analysts argue that outrage over the fiction that Trump was the victim of election theft is beginning to dissipate."
  ]
}