{
  "id": 8331,
  "mediaId": 12,
  "date": "1/7/2022 12:00:00 AM",
  "headline": "The Jolt: Why some Democrats are upset about Biden-Harris visit to Georgia",
  "image": "https://www.ajc.com/resizer/u-LAI8N_xgdMAXo-bhpi90djGNQ=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/AVLLVGZ2MRGK3K3VURUWCONQJQ.jpg",
  "link": "https://www.ajc.com/politics/politics-blog/the-jolt-biden-harris-visit-to-georgia-panned-by-democrats-behind-the-scenes/YWJN4KW5DVFXTKWQTYRWP5TJGU/",
  "sentiment": "0.0",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tia Mitchell",
  "authorUrl": "https://www.ajc.com/staff/tia-mitchell/",
  "termIds": [
    815,
    2095
  ],
  "sentences": [
    "Since its Friday, we always like to send you into the weekend with a little light reading including:\nThe Wednesday Political Insider column on new Atlanta Mayor Andre Dickens and his connection to former Mayor Shirley Franklin;\nJamie Duprees Washington Insider Column on Donald Trump allies main 2022 issue (the 2020 election);\nFridays Political Insider column on the late Sen. Johnny Isakson and the last lions of the Georgia GOP.",
    "Nathan Deal, former U.S. Rep. Doug Collins, and 53 state lawmakers,\nU.S. Sen. Raphael Warnock is facing renewed GOP criticism for his vote against a Republican-backed amendment in 2021 that would have denied stimulus checks to any person if the federal government has knowledge that the individual was imprisoned.",
    "Maybe its time that we asked the question of Georgians whether they want to expand gaming, and if they say yes, then we sit down and decide what form it will take, whether its going to be sports betting, whether you do horses or destination resorts, the Blue Ridge Republican told reporters.",
    "On Thursday, a coalition of voting rights groups released an unusually strong statement calling a trip by Biden and Vice President Kamala Harris insufficient and unwelcome if the two dont already have a veto-proof majority to pass the legislation, which is not yet in hand.",
    "As violent crime and inflation skyrocket across the state, Raphael Warnock voted to send taxpayer funded stimulus checks to convicted felons in jail, said Stephen Lawson, a spokesman for a group supporting Herschel Walker, the GOP Senate candidate.",
    "The other prominent Republican voice from Georgia marking one year since the attack was U.S. Rep. Marjorie Taylor Greene, whose press event with Florida Rep. Matt Gaetz was just as chaotic and full of conspiracy theories as weve grown to expect.",
    "U.S. Rep. Andrew Clyde has written an op-ed in the Washington Times about the events on January 6th, including what he said he meant when he described some of the people who breached the Capitol looking like they were on a normal tourist visit.",
    "Finally, a memorial for the late Sen. Johnny Isakson took place in Atlanta Thursday with an especially large contingent of Isaksons former House and Senate colleagues filling the first five rows of Peachtree Road United Methodist Church.",
    "When House Speaker David Ralston wielded a Pepsi in Coca-Cola country during the closing hours of the last legislative session, he seemed to be signaling an impending war with corporate powers in Georgia over the states new voting law.",
    "Charlie Hayslett over at Trouble in Gods Country has analyzed the data for a difficult question weve asked ourselves-- could the terrible death toll from COVID have a meaningful effect on the turnout and results of the 2022 elections?",
    "The 2022 plot twist: Walker tested positive for COVID so was not there to take his victory lap, although other potential rivals for the pro tem spot did show up to glad hand the colleagues they may need support from.",
    "For a state where the presidential contest was settled by about 12,000 votes, Hayslett writes, We wont know until the night of November 8th, but I think the numbers have gotten big enough that theyre worth watching.",
    "One bit of drama to watch this legislative session will be the jockeying among state Senate Republicans who may look to replace outgoing state Senate president pro tem Butch Miller in his top leadership spot.",
    "A group of about 50, including Mayor Kelly Girtz, gathered in front of Athens-Clarke County City Hall for a candle light vigil to send a message that in America voters decide the outcome of elections.",
    "At the time, Democratic leaders argued the amendment would affect more than just prisoners by denying their families some of the payment and also punish those in prison for less nonviolent crimes.",
    "The issue got more attention after a court filing revealed that the Justice Department is seeking to seize money from a stimulus check received by Boston Marathan bomber Dzhokhar Tsarnaev.",
    "From the op-ed:\nThroughout my service as a three tour Navy combat veteran, Ive seen the results of violence up close, and I do not believe it should be used as a form of political protest.",
    "Tifton Mayor Julie Smith, Perry Mayor Randall Walker, and Valdosta Mayor Scott Matheson are a few of the local leaders join an already lengthy list of grassroots and big named-supporters.",
    "But news that Biden will return to deliver a speech in Atlanta next week to push federal voting rights legislation isnt being welcomed by all Democrats in the state this time around.",
    "Speaking of Speaker David Ralston, he is one of the few Georgia Republicans weve found willing to weigh in on the one-year anniversary of the Jan. 6 riot at the U.S. Capitol.",
    "Several said they werent involved in the planning stages of the event, and two officials expressed privately the same frustration outlined by the coalition of activists.",
    "The state was at the center of the struggle for voting rights during the civil rights movement  and is at the heart of the current fight against election fraud lies.",
    "Biden raised more than $500,000 for then-Mayor Keisha Lance Bottoms last year, though the donors were refunded after she decided against a run for a second term.",
    "She described the many soccer games, lake trips, driving lessons and even college graduation keg purchases her father was fully present for throughout her life.",
    "In a final bit of David Ralston news, the Speaker said Thursday Georgia lawmakers could put gambling to a referendum this year, the AJCs Mark Niesse reports.",
    "Hayslett notes that deep Red counties in Georgia have generally had lower vaccination rates and higher death rates than the states urban Democratic centers.",
    "Ralston and other top GOP leaders were infuriated in April that Coke and Delta had joined the chorus of critics who blasted the states election rewrite.",
    "But we must also have honest conversations about what truly transpired and what can be done to prevent another January 6 from ever happening again.",
    "The event raised more than $300,000 for the GOP Senate leadership PAC as well as individual senators reelection accounts- and managed to have Gov.",
    "One such maneuver happened this week, when state Sen. Larry Walker put together a fundraiser for his fellow GOP senators at DAS BBQ in Atlanta.",
    "Why the heck are they leaving Washington - where people need convincing to pass legislation - to come to Georgia where no one needs convincing?",
    "Fact-checkers have noted that prisoners also received relief checks under the Covid relief measure that President Donald Trump signed into law.",
    "The Clinton Administration alumn graduated from Morehouse College and worked for the late U.S. Sen. Max Clelands reelection campaign in 2002.",
    "A spokesman for Stacey Abrams campaign declined to say whether the White House involved Abrams or her campaign in the planning of the event.",
    "An ongoing split could be costly for the corporate giants, and not just by risking lucrative tax incentives that legislators must approve.",
    "Senate Minority Leader Mitch McConnell and Senate Chaplain Barry Black traveled from Washington to speak at the service for their friend.",
    "In the meantime, some of Clydes most progressive 9th District constituents in Athens gathered to mark Jan. 6th in a different way.",
    "Gary Black has released a list of 62 new endorsements from local Georgia leaders for his bid to unseat U.S. Raphael Warnock.",
    "Send your best scoop, gossip and insider info to patricia.murphy@ajc.com, tia.mitchell@ajc.com and greg.bluestein@ajc.com.",
    "Jamal Simmons was tapped Thursday to take over Harris press shop, which has had several high-profile departures recently.",
    "He also warned Democrats not to politicize the breach, while voiced support for ongoing investigations into the riot.",
    "Georgians know the importance of voting rights and so do the senators we elected, said one prominent state Democrat.",
    "And without the votes to move the legislation forward, he needs to be speaking out to make the case for its passage.",
    "Im disappointed by some in my party who cant accept the fact that that was completely despicable criminal behavior.",
    "A Joe Biden visit to Georgia was cause for giddy celebration among state Democrats during the 2020 campaign season.",
    "Were told Walker is on the mend and the positioning for leadership spots will be alive and well this session, too.",
    "Both companies play key roles in major policy decisions and dont want to be sidelined in their home state.",
    "There has been discussion over the last year and I think some people may now see the error in their ways.",
    "It includes 37 mayors and dozens of county commissioners and city council members from around the state.",
    "Dad was a lot of things to a lot of people, but he was my dad and he was the best, she said.",
    "Others questioned why theres no fundraising event for Georgia candidates tied to the visit.",
    "Back then, he suggested there would be payback: You dont feed a dog that bites your hand.",
    "Behind the scenes, we spoke with other senior Democrats whose complaints go even further.",
    "But it was his daughter, Julie Mitchell, who left the most lasting impression for many.",
    "In the personnel department, Vice President Kamala Harris newest hire has Georgia ties.",
    "Biden has reason to use Georgia as a venue to make a national case for voting rights.",
    "What we ought to be doing is letting these investigations run their course, he said.",
    "We could have told them how Georgians would feel, if only they had asked, said one.",
    "Attendees called for federal voting rights legislation to pass the Senate and D.A.",
    "Black, the longtime Ag Commissioner, has also gotten commitments from former Gov.",
    "But he referred to Abrams earlier comments to the AJC welcoming a Biden visit.",
    "Sign Up to receive the Morning Jolt & AJC Politics newsletters in your inbox.",
    "Deborah Gonzolez told the crowd that ultimately on Jan. 6, Democracy Held!",
    "Geoff Duncan stop by for some facetime with the packed house, too.",
    "As always, Jolt readers are some of our favorite tipsters.",
    "Redemption is always possible, Ralston said Thursday.",
    "Now, though, it seems that the rift has been healed.",
    "He added: They just did what I asked them to do.",
    "Im not even going to argue with you.",
    "I said, Go read the damn bill.",
    "Brian Kemp and Lt. Gov.",
    "Read the bill."
  ]
}