{
  "id": 8389,
  "mediaId": 136,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "Trump Targets Cheney in Wyoming Rally as Endorsement, Court Failures Sting",
  "image": "https://d.newsweek.com/en/full/2047646/donald-trump-liz-cheney.webp?w=790&f=93c4eda8f5b68bf3d1b46119b070517e",
  "link": "https://www.newsweek.com/trump-targets-cheney-wyoming-rally-endorsement-court-failures-sting-1711131",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    794,
    1147,
    1248,
    1577,
    2087,
    2095,
    2203,
    2279,
    3085,
    3094,
    2598,
    2976
  ],
  "sentences": [
    "On Friday, federal Judge Brenda Sannes, a district court judge for the Northern District of New York, rejected Trump's lawsuit against New York Attorney General Letitia James, dismissing the former president's allegation that the prominent Democrat targeted him and his business out of partisan animus.",
    "In addition to the political animus argument, Trump's attorneys had unsuccessfully contended that James could not force the former president to testify as he was also under criminal investigation in the state over similar business practices being scrutinized by the civil probe.",
    "The southern state's GOP Governor Brian Kemp and Secretary of State Brad Raffensperger, who drew the former president's ire after they refused to help him overturn President Joe Biden's election win in their state, both won their primaries by double-digit margins.",
    "While the little polling data that has come out shows that Cheney faces an uphill battle to maintain her seat against her Trump-backed challenger, Trump is coming to her state fresh off major endorsement failures in the Georgia Republican primary.",
    "Former President Donald Trump heads to Wyoming on Saturday for a rally to campaign against one of his most prominent Republican critics, the western state's Representative Liz Cheneyshowing support for her GOP primary opponent Harriet Hageman.",
    "In addition to Trump, Representatives Matt Gaetz of Florida and Marjorie Taylor Greene of Georgia, who are close allies of the former president, are slated to participate in the \"Save America\" rally in support of Hageman.",
    "Although Trump is widely popular in Wyoming, garnering nearly 70 percent of the vote there in 2020, his recent efforts to unseat top incumbent Republicans in Georgia resulted in a significant failure Tuesday.",
    "Meanwhile, Raffensperger beat out Trump-endorsed Representative Jody Hice with a margin of about 52 percent to approximately 33 percentnearly a 20 point lead in favor of the current secretary of state.",
    "On Thursday, a state appeals court panel of four judges determined that Trump and two of his adult childrenDonald Trump Jr. and Ivanka Trumpmust sit for questioning under oath as part of James' probe.",
    "The Wyoming congresswoman also serves as the vice chair of the House select committee investigating the January 6 violence and the former president's effort to overturn the 2020 election.",
    "Cheney drew the former president's wrath after she voted with nine other House Republicans to impeach him for inciting his supporters to attack the U.S. Capitol on January 6, 2021.",
    "\"Once again, the courts have ruled that Donald Trump must comply with our lawful investigation into his financial dealings,\" James said in a statement after the decision.",
    "Kemp beat Trump-backed former Senator David Perdue by a margin of about 74 percent to 22 percenta lead of over 50 points for the incumbent Republican governor.",
    "Since then, the Republican lawmaker has repeatedly condemned Trump as well as fellow GOP politicians that continue to align with him and his movement.",
    "Following the primary losses for Trump's candidates, the former president faced significant setbacks in New York courts.",
    "Meanwhile, the former president's legal woes continue, as New York judges ruled against him multiple times this week.",
    "Whether Cheney can pull off a similar victory against Trump's preferred candidate, however, remains to be seen.",
    "He also called the New York attorney general, who is Black, \"racist\" for looking into his business practices.",
    "This decision allowed James' civil investigation into the former president's business practices to continue.",
    "Speakers will begin taking the stage at 1 p.m. before Trump is scheduled to deliver his speech at 4 p.m.",
    "Trump has repeatedly slammed James' investigation, arguing that it is purely partisan in nature.",
    "\"We will continue to follow the facts of this case and ensure that no one can evade the law.\"",
    "Parking opens at 8 a.m. MST, with doors opening and entertainment set to begin at 11 a.m.",
    "The former president's attorneys could still appeal the decision to a higher court.",
    "Newsweek reached out to press representatives for Cheney and Trump for comment.",
    "The rally will take place at the Ford Wyoming Center in Casper.",
    "Thousands of Trump supporters are expected to attend."
  ]
}