{
  "id": 8409,
  "mediaId": 21,
  "date": "5/29/2022 12:00:00 AM",
  "headline": "Trump loyalist who lost Georgia governor primary with just 3.4% of the vote is refusing to admit defeat",
  "image": "https://i.insider.com/62932fa0ff955c0019c5e85a?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/trump-loyalist-kandiss-taylor-georgia-primary-vote-wont-concede-2022-5",
  "sentiment": "-0.886",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joshua Zitser",
  "authorUrl": "https://www.businessinsider.com/author/joshua-zitser",
  "termIds": [
    1147,
    1951,
    2095,
    3082,
    4325,
    428,
    2555,
    2672
  ],
  "sentences": [
    "\"It is my opinion that our elections in Georgia have become a travesty spearheaded by the corrupt, organized, willful assault that Governor Brian Kemp, Secretary of State Brad Raffensperger, Attorney General Chris Carr, and gubernatorial candidate Stacey Abrams have inflicted on our election process,\" the press release continued.",
    "\"Given that my vote total currently lags my number of volunteers by nearly 20,000, I do not trust these election results and neither should any supporter of either of my opponents or candidates in any other races,\" Taylor said in a press release.",
    "Patricia Murphy (@MurphyAJC) May 25, 2022\nAs Insider's Tom Porter wrote, a significant number of Trump endorsees are not following his example in refusing to accept defeat, even when he explicitly urges them to.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "During an anti-abortion speech last week she criticized the separation of church and state, a principle that has underpinned US democracy since the American Revolution.",
    "Her approach contrasts with that of Perdue, who got significantly more votes than Taylor with 21.8%, but conceded to Kemp on the night of the count.",
    "A candidate for the GOP nomination for governor of Georgia refused to concede defeat even though she received only 3.4% of the vote on Tuesday.",
    "Kandiss Taylor, Georgia Republican gubernatorial candidate participates in a republican primary debate on Sunday, May 1, 2022, in Atlanta.",
    "AP Photo/Brynn Anderson, Pool\nKandiss Taylor received just 3.4% of the vote in the GOP's primary for Georgia governor.",
    "After the results were clear, Taylor complained that the election was \"rigged\" against her, The Daily Beast reported.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "She received significantly fewer votes than David Perdue, who had Trump's formal endorsement, and incumbent Gov.",
    "Despite her poor showing, Taylor is refusing to concede defeat and claims the election was rigged.",
    "Kandiss Taylor, a strong supporter of former President Donald Trump, came third in the race.",
    "More will be forthcoming,\" Taylor campaign spokesperson Christi Maude told The Daily Beast.",
    "Taylor ran her campaign on a \"Jesus, Guns, Babies\" platform, Insider previously reported.",
    "On her Telegram, Taylor shared a message referring to the vote as a \"rigged election.\"",
    "Taylor's campaign did not immediately respond to Insider's request for comment.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "\"We have a national data team working on the 2022 primary election fraud.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "(Taylor has a PhD in school counseling and supervision.)",
    "Brian Kemp, who won by 73.7% and secured the nomination.",
    "Stay up to date with what you want to know.",
    "She came third, losing to incumbent Gov.",
    "Sign up for notifications from Insider!",
    "\"Dr. Kandiss Taylor does not concede.\"",
    "Brian Kemp by more than 70 points.",
    "We run this state,\" Taylor said.",
    "\"I do not concede,\" she wrote.",
    "Taylor received 41,027 votes.",
    "Loading Something is loading.",
    "\"We are the church!"
  ]
}