{
  "id": 8499,
  "mediaId": 118,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "Cowardice Is No Longer an Excuse",
  "image": "https://www.motherjones.com/wp-content/uploads/2022/05/trump-nra-cowards_2000.jpg",
  "link": "https://www.motherjones.com/politics/2022/05/republicans-cowardice-nra-trump-georgia-uvalde/",
  "sentiment": "-0.903",
  "mediaOutlet": "Mother Jones",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Schulman",
  "authorUrl": "https://www.motherjones.com/author/jeremy-schulman/",
  "termIds": [
    800,
    1147,
    1274,
    2095,
    2475,
    4325,
    6210,
    428,
    2672,
    2934
  ],
  "sentences": [
    "The NRA is still a powerful force, but years of scandal and infighting and a failed attempt to declare bankruptcy may have left it substantially weaker than it was in 2013, when pro-gun forces killed a bipartisan background check bill in the wake of the Sandy Hook murders:\n2/Its longtime PR firm, which served as the voice of the organization and devised Wayne LaPierres persona, is long gone.",
    "It was just two months agoat a campaign rally for David Perduethat Trump doubled down on his intention to purge Georgia of every Republican official who had committed a dereliction of duty by refusing to help him overturn the 2020 election.",
    "It seemed impossible that Kemp and his allies could survive the onslaught, and it was only a matter of time before a combination of primary defeats and political fear would lay the groundwork for Team Trump to steal the 2024 election.",
    "As gun violence ravages communities and the country reels from a string of horrific mass shootings, Americans have been left with an all-too-familiar question: Will our lawmakers finally do something to stop the carnage?",
    "The disgraced chief executive intended to wield the MAGA movement as a weapon to enshrine the Big Lie as official party dogma and punish any public servantno matter how far rightwho dared to stand up for democracy.",
    "Brooks campaign quickly fizzled, and Trump apparently tried to save face by un-endorsing the hard-right congressman, arguingsomewhat absurdlythat Brooks had been insufficiently supportive of his election lies.",
    "Already, political media is awash in leaks and speculation about bipartisan negotiations and optimism that just maybe this time will be differentjust maybe 10 Republicans will actually vote their conscience.",
    "Joneswho was one of the fake electors the Trump campaign infamously tried to send to the Electoral Collegeis seeking to replace Geoff Duncan, one of the partys most vocal critics of Trumps Big Lie.",
    "Weve been here before, many times; weve watched as Republicans (and some Democrats) bowed to pressure from the National Rifle Association and blocked even the most basic gun control measures.",
    "Spies observation actually seems quite relevant to another political powerhouse whose ability to enforce obedience from the Republican Party took a big hit this week: Donald Trump.",
    "Trump also blasted Brad Raffensperger, the GOP secretary of state who rejected (and then blew the whistle on) Trumps request to find 11,780 votes so he could prevail in Georgia.",
    "Republican voters overwhelmingly renominated Ken Paxton, the scandal-plagued Texas attorney general behind one of the most outrageous legal efforts to overturn the 2020 contest.",
    "In short, the nations most powerful gun-rights lobby simply has less muscle than it once did to bully Republicans who might otherwise support at least modest gun legislation.",
    "But everyday theres more and more folks that have the confidence to walk out in front of what used to look like a freight train but now is just a matchbox car, he said.",
    "But Kemp has proven that its possible for a Republican tell Trump noto refuse his demand to carry out a coup, and to emerge from that fight stronger than ever.",
    "Trump had even endorsed a member of his post-election legal team, Patrick Witt, in a bizarre bid to unseat a Kemp ally as the states insurance commissioner.",
    "Raffenspergerthe most endangered of the bunchmanaged to eke out a clear majority and avoid a runoff against his Trump-anointed MAGA challenger, Jody Hice.",
    "mike spies (@mikespiesnyc) May 26, 2022\nThe NRA still spends millions on lobbying, but Chris Cox, its legendary chief lobbyist, stepped down in 2019.",
    "Fear, cowardice, and deference to a big-spending political organizationthese are no longer sufficient explanations for lawmakers who refuse to act.",
    "Before we can defeat the Democrat Socialists and Communists, he said, we first have to defeat the RINOs, sellouts, and the losers in the primaries.",
    "Theres more and more folks that have the confidence to walk out in front of what used to look like a freight train but now is just a matchbox car.",
    "Brian Kemp, the Republican in name only whom the defeated president seems to blame more than anyone for thwarting his attempts to cling to power.",
    "But as the Traces Mike Spies pointed out the day after the Uvalde massacre, there actually has been a seismic shift in the political landscape.",
    "There would be no more Republican governors or secretaries of state or local canvassing board members willing to certify Democratic victories.",
    "Two of his hand-picked congressional candidates in GeorgiaJake Evans and Vernon Joneslimped into runoffs in their respective primaries.",
    "And he attacked Chris Carr, Georgias Republican attorney general, who had sided with Kemp and Raffensperger in the election dispute.",
    "A year ago, it would have been difficult to imagine Duncan winning a Republican primary, and he chose not to run again.",
    "He recently told the Atlanta Journal-Constitution that a lot of Republicans were vicariously living through him.",
    "When Trump first set out to organize primary challenges against these Republicans, his efforts felt ominous.",
    "Fear of the NRA is no longer a viable explanation: At this stage, any decision the GOP makes is its own.",
    "On Tuesday, Brooks finished a distant second place, but that was enough to qualify for a runoff.",
    "Kemp, one of Americas most conservative governors, has taken pains to avoid criticizing Trump.",
    "Trumps choice for lieutenant governor in Georgia, Burt Jones, also secured the GOP nomination.",
    "Kemp easily won his primary Tuesday night, crushing Perdue by more than 50 percentage points.",
    "The group shelled out more than $29 million on the 2020 elections, according to Open Secrets.",
    "In Alabama, Trump had originally endorsed Rep. Mo Brooks for the states open Senate seat.",
    "All this was widely assumed to be a death blow for Brooks political future, but it wasnt.",
    "If they choose to ignore the gun crisis, its because they want to do that, too.",
    "But as Spies puts it, At this stage, any decision the GOP makes is its own.",
    "Those werent the only embarrassments Trump suffered Tuesday night.",
    "On democracy, as on firearms, Republicans now have a real choice.",
    "If they choose to help steal elections, its because they want to.",
    "Carr beat election denier John Gordon by a similar margin.",
    "Theres plenty of well-earned cynicism and doubt, too.",
    "Its most effective leader, Chris Cox, is long gone.",
    "The power of the MAGA movement isnt exactly waning.",
    "But that was barely half of what it spent in 2016.",
    "One wonders if hed make the same decision today.",
    "Its most effective spokespeople are long gone.",
    "Im not mad at him, he told reporters Monday.",
    "Witt received just 17 percent of the vote.",
    "Trump cant force them to do anything.",
    "That night, Trump railed against Gov.",
    "But then something strange happened.",
    "Cowardice is no longer an excuse.",
    "Carr was a disaster, Trump said.",
    "Trump did have some successes.",
    "Oliver North is long gone.",
    "Trump failed in Georgia.",
    "Neither can the NRA.",
    "Coxs team is gone.",
    "Spectacularly.",
    "Well see."
  ]
}