[
  {
    "id": 6030,
    "mediaId": 2688,
    "date": "2022-02-02",
    "sentence": "According to Politico, the Wards’ lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, the wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> — an ally of former President Donald Trump who is running for Senate.",
    "author": "Matt Shuham",
    "title": "Jan. 6 Committee Subpoenas Arizona GOP Chair And Her Husband’s Phone Records"
  },
  {
    "id": 5970,
    "mediaId": 2740,
    "date": "2022-02-03",
    "sentence": "The lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Senate candidate and ally of former President Donald Trump.",
    "author": "Chelsey Cox",
    "title": "Arizona GOP Chair Kelli Ward, spouse, sue to block Jan. 6 panel from accessing phone records"
  },
  {
    "id": 5680,
    "mediaId": 2664,
    "date": "2022-02-03",
    "sentence": "The Wards’ case was initially assigned to U.S. District Judge Susan M. Brnovich, who is married to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican who is running for U.S. Senate.",
    "author": "Jacob Fischler",
    "title": "Arizona GOP chair sues to block Jan. 6 panel’s records subpoena"
  },
  {
    "id": 3903,
    "mediaId": 2662,
    "date": "2022-02-28",
    "sentence": "All evidence was delivered to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, and Arizona awaits indictments and decertification.",
    "author": "Jordan Conradson",
    "title": "BREAKING: Arizona GOP Sues Secretary of State Katie Hobbs To Ban Unconstitutional Drop Boxes, And No-Excuse Mail-In Voting In Arizona"
  },
  {
    "id": 1994,
    "mediaId": 2662,
    "date": "2022-03-23",
    "sentence": "Contact Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> to demand arrests.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Leaked Emails From Maricopa County Recorder Stephen Richer Reveal Voter Fraud Concerns Before 2020 Election"
  },
  {
    "id": 1067,
    "mediaId": 2664,
    "date": "2022-04-04",
    "sentence": "The fact remains that these right-wingers have been further enabled by the likes of Donald Trump and Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, both of whom spread the false gospel of Trump’s “Big Lie.”\nWith the U.S. Senate’s failure to pass voting rights legislation earlier this year, the voting rights fight has come to Arizona.",
    "author": "Anushka Sarkar",
    "title": "Arizona is leading the way on new anti-democratic laws fueled by Republican election lies"
  }
]