[
  {
    "id": 1193,
    "mediaId": 2557,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told Fox News on Monday.",
    "author": "",
    "title": "NEWS ALERT: Three GOP states sue over end of Title 42"
  },
  {
    "id": 1316,
    "mediaId": 6449,
    "date": "2022-04-04",
    "sentence": "“The U.S. Department of Homeland Security, (DHS), estimates getting rid of Title 42 will result in as many as 18,000 migrants per day—which could mean 540,000 migrants in a single month.”\n— Daily Caller (@DailyCaller) April 1, 2022\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span>, the only border state official of the group, said his state will be at the forefront of the consequences of the decision.",
    "author": "Jennie Taer",
    "title": "3 States Sue Biden Administration Over Ending COVID-19 Restrictions at Border"
  },
  {
    "id": 1099,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> ?told ?”?Fox & Friends” Monday.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 1704,
    "mediaId": 6503,
    "date": "2022-04-05",
    "sentence": "“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” said Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Warner Todd Huston",
    "title": "GOP-Led States Sue to Prevent Biden from Canceling Immigration Rules and Pushing Wide Open Border Policy"
  },
  {
    "id": 693,
    "mediaId": 2576,
    "date": "2022-04-13",
    "sentence": "In a written statement, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> called it a \"ridiculously burdensome policy.\"",
    "author": "Bailey Schulz",
    "title": "Traveling soon? Don't ditch that face mask. Mandate for planes extended through May 3"
  },
  {
    "id": 443,
    "mediaId": 2855,
    "date": "2022-04-21",
    "sentence": "",
    "author": "George Fishman",
    "title": "42 Skiddo: Is the Biden Administration Expelling Border Security?"
  }
]