[
  {
    "id": 6430,
    "mediaId": 2664,
    "date": "2022-01-24",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is now running for U.S. Senate, is said to be investigating the 2020 election in Arizona.",
    "author": "Sarah K. Burris",
    "title": "Arizona governor swears he never knew about the fake Trump electors despite Republican involvement"
  },
  {
    "id": 6428,
    "mediaId": 2512,
    "date": "2022-01-25",
    "sentence": "After now-President Joe Biden defeated then-President Donald Trump in Arizona in the 2020 election, State Attorney General <span class='selected-term'>Mark Brnovich</span> was among the Arizona Republicans who refused to promote Trump’s false claims of election fraud.",
    "author": "Alex Henderson",
    "title": "Arizona writer lambasts State AG Brnovich for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 6393,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "After now-President Joe Biden defeated then-President Donald Trump in Arizona in the 2020 election, State Attorney General <span class='selected-term'>Mark Brnovich</span> was among the Arizona Republicans who refused to promote Trump’s false claims of election fraud.",
    "author": "Alex Henderson",
    "title": "Arizona's attorney general just got blasted for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 7047,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "",
    "author": "",
    "title": "Arizona bill would allow legislature to overturn election results"
  },
  {
    "id": 6030,
    "mediaId": 2688,
    "date": "2022-02-02",
    "sentence": "According to Politico, the Wards’ lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, the wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> — an ally of former President Donald Trump who is running for Senate.",
    "author": "Matt Shuham",
    "title": "Jan. 6 Committee Subpoenas Arizona GOP Chair And Her Husband’s Phone Records"
  },
  {
    "id": 5752,
    "mediaId": 2514,
    "date": "2022-02-02",
    "sentence": "The case involving the lawsuit was initially assigned to U.S. District Judge Susan Brnovich, a Trump appointee whose husband, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, was criticized by Trump at a rally in the state last month for not doing more to investigate \"fraud\" in the 2020 election.",
    "author": "",
    "title": "Two 'alternate electors' sue Jan. 6 committee to block subpoena"
  },
  {
    "id": 5584,
    "mediaId": 2643,
    "date": "2022-02-02",
    "sentence": "An Arizona woman was indicted on illegal voting and perjury charges for allegedly casting a ballot in the 2020 election on behalf of her deceased mother, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said Wednesday.",
    "author": "Meghan Roos",
    "title": "Daughter Accused of Casting Illegal 2020 Ballot on Behalf of Dead Mother"
  },
  {
    "id": 5970,
    "mediaId": 2740,
    "date": "2022-02-03",
    "sentence": "The lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Senate candidate and ally of former President Donald Trump.",
    "author": "Chelsey Cox",
    "title": "Arizona GOP Chair Kelli Ward, spouse, sue to block Jan. 6 panel from accessing phone records"
  },
  {
    "id": 5680,
    "mediaId": 2664,
    "date": "2022-02-03",
    "sentence": "The Wards’ case was initially assigned to U.S. District Judge Susan M. Brnovich, who is married to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican who is running for U.S. Senate.",
    "author": "Jacob Fischler",
    "title": "Arizona GOP chair sues to block Jan. 6 panel’s records subpoena"
  },
  {
    "id": 5578,
    "mediaId": 2641,
    "date": "2022-02-07",
    "sentence": "\"The violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an 'invasion' under the U.S. Constitution, and Arizona therefore has the power to defend itself from this invasion under the Governor’s authority as Commander-in-Chief,\" Attorney General <span class='selected-term'>Mark Brnovich</span> writes.",
    "author": "Jack Gournell",
    "title": "AG Brnovich: Arizona Can Declare 'Invasion,' Defend Self Under Constitution"
  },
  {
    "id": 4860,
    "mediaId": 2664,
    "date": "2022-02-14",
    "sentence": "Hobbs referred the misuse to Attorney General <span class='selected-term'>Mark Brnovich</span> 14 months ago, but \"nothing has happened\" and Hobbs' office claims to have never received a response to its referral.",
    "author": "Bob Brigham",
    "title": "Trump's fake electors illegally used state seal — but GOP attorney general has done nothing: report"
  },
  {
    "id": 4882,
    "mediaId": 2540,
    "date": "2022-02-17",
    "sentence": "The nominal frontrunner is probably state Attorney General <span class='selected-term'>Mark Brnovich</span> but no one – in Arizona or Washington – sees him as a top tier challenger to Kelly.",
    "author": "Chris Cillizza",
    "title": "Donald Trump may be single-handedly costing Republicans a Senate seat"
  },
  {
    "id": 5285,
    "mediaId": 6511,
    "date": "2022-02-22",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5323,
    "mediaId": 3987,
    "date": "2022-02-23",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5391,
    "mediaId": 2637,
    "date": "2022-02-23",
    "sentence": "The justices heard oral arguments in an appeal by 13 Republican state attorneys general led by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> of a lower court’s ruling that rejected their bid to defend Trump’s rule, which expanded the scope of those considered likely to become a “public charge.”\nArticle content\nPresident Joe Biden’s administration dropped the government’s defense of the policy, prompting the action by the states.",
    "author": "Andrew Chung",
    "title": "U.S. Supreme Court mulls Republican bid to defend Trump immigration rule"
  },
  {
    "id": 5085,
    "mediaId": 2592,
    "date": "2022-02-23",
    "sentence": "The justices heard oral arguments in an appeal by 13 Republican state attorneys general led by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> of a lower court's ruling that rejected their bid to defend Trump's rule, which expanded the scope of those considered likely to become a \"public charge.\"",
    "author": "Andrew Chung",
    "title": "U.S. Supreme Court Mulls Republican Bid To Defend Trump Immigration Rule"
  },
  {
    "id": 5087,
    "mediaId": 2679,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "JESSICA GRESKO",
    "title": "High court wades into clash over Trump-era immigration rule"
  },
  {
    "id": 5260,
    "mediaId": 6511,
    "date": "2022-02-23",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5050,
    "mediaId": 2745,
    "date": "2022-02-23",
    "sentence": "That left states that favored the public charge rule without recourse, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> (R) told the justices Wednesday.",
    "author": "",
    "title": "Supreme Court considers whether Biden administration properly ditched Trump immigration rule"
  },
  {
    "id": 5057,
    "mediaId": 2636,
    "date": "2022-02-23",
    "sentence": "",
    "author": "",
    "title": "Supreme Court Weighs Whether States May Defend a Trump Immigration Policy"
  },
  {
    "id": 5052,
    "mediaId": 2728,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "Jessica Gresko",
    "title": "High court wades into clash over Trump-era immigration rule"
  },
  {
    "id": 4927,
    "mediaId": 2594,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "Via AP news wire",
    "title": "High court wades into clash between Biden, Republican states"
  },
  {
    "id": 4747,
    "mediaId": 2746,
    "date": "2022-02-23",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told the justices that even tacit approval of what the Biden administration did would set a precedent future presidents would abuse, using the courts to get rid of previous administration policies without going through the usual regulatory process.",
    "author": "Stephen Dinan",
    "title": "Supreme Court struggles for a solution to Biden’s handling of immigration ‘Public Charge’ rules"
  },
  {
    "id": 4028,
    "mediaId": 2526,
    "date": "2022-02-24",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> argued that Biden’s strategy is “an unprecedented legal maneuver.” Because Biden dismissed the remaining legal challenges to the public charge rule, Arizona argues that states that supported the rule were left with no recourse.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Supreme Court Hears Arguments Over ‘Public Charge’ Rule"
  },
  {
    "id": 4941,
    "mediaId": 2641,
    "date": "2022-02-24",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> accused the Biden administration on Thursday of intentionally undermining the law by withdrawing a Trump-era policy that bars immigrants from permanent residency if they are likely to need public assistance.",
    "author": "Brian Trusdell",
    "title": "Arizona AG Brnovich to Newsmax: Biden Admin Intentionally Undermining Law"
  },
  {
    "id": 4280,
    "mediaId": 4091,
    "date": "2022-02-25",
    "sentence": "He also said that the results were being provided to the Arizona Senate as well as GOP Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "JD Heyes",
    "title": "Bombshell study finds more than 200,000 ballots from 2020 election with “mismatched signatures” indicating widespread fraud"
  },
  {
    "id": 3648,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "More than a dozen Republican attorneys general, led by Arizona’s <span class='selected-term'>Mark Brnovich</span>, have sought to defend the 2019 public charge rule, which broadened the definition of \"public charge\" to include an immigrant who receives one or more designated public benefits for more than 12 months within a 36-month period -- and included a substantial number of benefits.",
    "author": "Adam Shaw",
    "title": "SCOTUS hears GOP push to defend Trump-era public charge rule; Arizona AG calls Biden moves ‘unprecedented’"
  },
  {
    "id": 4304,
    "mediaId": 2595,
    "date": "2022-02-28",
    "sentence": "“More than a dozen Republican attorneys general, led by Arizona’s <span class='selected-term'>Mark Brnovich</span>, have sought to defend the 2019 public charge rule, which broadened the definition of ‘public charge’ to include an immigrant who receives one or more designated public benefits for more than 12 months within a 36-month period — and included a substantial number of benefits,” Fox News reported on Saturday.",
    "author": "M Dowling",
    "title": "Admin Schemes After SCOTUS Hears the ‘Welfare for Illegal Aliens’ Case"
  },
  {
    "id": 3976,
    "mediaId": 2636,
    "date": "2022-03-03",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> has led a handful of lesser-known Republicans in some polls ahead of the August primary, but the race has been frozen as G.O.P.",
    "author": "",
    "title": "Ducey Confirms He Will Not Run for Senate, Despite McConnell’s Wooing"
  },
  {
    "id": 3146,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "Republican <span class='selected-term'>Mark Brnovich</span> took steps to investigate a phony slate of Arizona presidential electors supporting Donald Trump, according to newly released government documents.",
    "author": "Bob Brigham",
    "title": "GOP attorney general investigated Trump’s phony electors — but no charges have been filed: report"
  },
  {
    "id": 2078,
    "mediaId": 2662,
    "date": "2022-03-22",
    "sentence": "President Trump released another statement yesterday blasting the Arizona Attorney General, <span class='selected-term'>Mark Brnovich</span>, on his failure to prosecute the Maricopa County Supervisors for the rigged 2020 election and their ongoing failure to comply with his criminal investigation.",
    "author": "Jordan Conradson",
    "title": "President Trump Tells Arizona Attorney General Mark Brnovich To Issue Warrants In 2020 Election Fraud Case: “The Supervisors Just Won’t Release The Information—It Must Really Be Bad!”"
  },
  {
    "id": 2009,
    "mediaId": 2557,
    "date": "2022-03-22",
    "sentence": "Here, the answer is no.”\nPromoted Content\nIn November 2020, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, Montana Attorney General Austin Knudsen, and Ohio Attorney General Dave Yost filed a lawsuit against the Biden administration in over the policy revision, which they said “dramatically ties the hands of immigration officers, halting nearly all deportations.”\nBrnovich celebrated the ruling, writing on Twitter, “VICTORY: A federal judge just blocked the lawless Biden Administration policy that halted nearly all deportations after our office challenged this guidance.",
    "author": "DML News App",
    "title": "BREAKING: Judge deals huge blow to Biden effort to limit ICE enforcement"
  },
  {
    "id": 2355,
    "mediaId": 2912,
    "date": "2022-03-23",
    "sentence": "“The Board of Supervisors remains committed to free and fair elections that conform to federal and state laws.”\nDespite those findings, Republican Attorney General <span class='selected-term'>Mark Brnovich</span> is still reviewing questions the Senate’s “audit” raised about possible problems.",
    "author": "",
    "title": "Final Arizona election report finds no county data issues"
  },
  {
    "id": 1755,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "Republican Attorney General <span class='selected-term'>Mark Brnovich</span>, a Donald Trump ally, has refused to charge anyone in the case.",
    "author": "Sarah K. Burris",
    "title": "Fake Trump electors are getting new attention from the Justice Department and a grand jury: report"
  },
  {
    "id": 966,
    "mediaId": 2512,
    "date": "2022-04-01",
    "sentence": "And it has legs, in my opinion.”\nShapiro, Ozug and Morell cite Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> as an example of a Republican who made a right-wing environmental argument.",
    "author": "Alex Henderson",
    "title": "How environmentalism and the far right are becoming an unlikely ‘ecofascist’ combination: report"
  },
  {
    "id": 951,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "FIRST ON FOX: Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is warning the Biden administration that the U.S. will face a \"tidal wave\" of migration if it goes through with its reported plan to lift Title 42 in the coming months -- tapping into broad bipartisan concerns that the move will spark a massive migrant surge.",
    "author": "Adam Shaw",
    "title": "Arizona AG warns of 'tidal wave' of migrants at southern border if Biden admin lifts Title 42"
  },
  {
    "id": 1099,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> ?told ?”?Fox & Friends” Monday.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 1067,
    "mediaId": 2664,
    "date": "2022-04-04",
    "sentence": "The fact remains that these right-wingers have been further enabled by the likes of Donald Trump and Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, both of whom spread the false gospel of Trump’s “Big Lie.”\nWith the U.S. Senate’s failure to pass voting rights legislation earlier this year, the voting rights fight has come to Arizona.",
    "author": "Anushka Sarkar",
    "title": "Arizona is leading the way on new anti-democratic laws fueled by Republican election lies"
  },
  {
    "id": 1161,
    "mediaId": 2746,
    "date": "2022-04-04",
    "sentence": "“The Title 42 Revocation thus stands as a radical outlier — seemingly the only COVID-19-based restriction the Administration sees fit to end,” said Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, Louisiana Attorney General Jeff Landry and Missouri Attorney General Eric S. Schmitt.",
    "author": "Stephen Dinan",
    "title": "States sue to halt Biden from ending border order stopping illegal immigrants"
  },
  {
    "id": 1507,
    "mediaId": 2522,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> bluntly stated on “Fox & Friends” Monday.",
    "author": "Terresa Monroe-Hamilton",
    "title": "GOP states sue Biden admin over plan to rescind Title 42 border policy, likely open migrant floodgates"
  },
  {
    "id": 1430,
    "mediaId": 2591,
    "date": "2022-04-04",
    "sentence": "The attorneys general argue that the end of the order will result in a number of higher costs for the states, including higher health care costs for illegal migrants infected with COVID-19 and “the presence of much greater numbers of paroled aliens with non-meritorious asylum claims …”\n“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said.",
    "author": "Human Events Staff",
    "title": "Republican States Sue Biden to Stop End to Title 42"
  },
  {
    "id": 1809,
    "mediaId": 6511,
    "date": "2022-04-04",
    "sentence": "La petición es firmada por los fiscales generales de Arizona, <span class='selected-term'>Mark Brnovich</span>; de Missouri, Eric Schmitt, y la procuradora general de Louisiana, Elizabeth Murrill.",
    "author": "",
    "title": "Tres estados republicanos piden a juez bloquear decisión de Biden para terminar el Título 42 contra inmigrantes"
  },
  {
    "id": 1807,
    "mediaId": 2563,
    "date": "2022-04-05",
    "sentence": "To states like Arizona, Texas, and California, “it’s throwing gasoline on a fire,” state Attorney General <span class='selected-term'>Mark Brnovich</span> (R-Ariz.) shook his head.",
    "author": "Family Research Council",
    "title": "VIDEO: ‘Human Tsunami’ Puts Border on the Brink"
  },
  {
    "id": 1704,
    "mediaId": 6503,
    "date": "2022-04-05",
    "sentence": "“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” said Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Warner Todd Huston",
    "title": "GOP-Led States Sue to Prevent Biden from Canceling Immigration Rules and Pushing Wide Open Border Policy"
  },
  {
    "id": 1425,
    "mediaId": 2679,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is in a tough GOP primary for U.S. Senate, largely reiterated concerns raised by a widely panned election review conducted last year by supporters of former President Donald Trump on behalf of state Senate Republicans.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 1514,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Republicans have a primary fight that AG <span class='selected-term'>Mark Brnovich</span> appears to be leading comfortably so far despite worries among the base that he might not be conservative/populist enough for the GOP at the moment.",
    "author": "Ed Morrissey",
    "title": "Midterm signals: Kelly looking to break out of Biden's orbit"
  },
  {
    "id": 1349,
    "mediaId": 2509,
    "date": "2022-04-06",
    "sentence": "",
    "author": "ACACIA CORONADO and PAUL J. WEBER Associated Press",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 935,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is in a tough GOP primary for U.S. Senate, largely reiterated concerns raised by a widely panned election review conducted last year by supporters of former President Donald Trump on behalf of state Senate Republicans.",
    "author": "",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 931,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is in a tough GOP primary for U.S. Senate, largely reiterated concerns raised by a widely panned election review conducted last year by supporters of former President Donald Trump on behalf of state Senate Republicans.",
    "author": "Via AP news wire",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 1593,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Arizona attorney general <span class='selected-term'>Mark Brnovich</span> issued a report Wednesday that found no evidence of widespread voter fraud or irregularities in Maricopa County, despite Trump's persistent pressure campaign to justify his false claims about his election loss, and the \"Morning Joe\" host said he's had enough.",
    "author": "Travis Gettys",
    "title": "Morning Joe hammers GOP 'freaks' still clinging to Trump's election lies"
  },
  {
    "id": 1494,
    "mediaId": 2627,
    "date": "2022-04-07",
    "sentence": "“The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump added.",
    "author": "Steve Benen",
    "title": "Arizona AG fails to produce the election evidence Trump demanded"
  },
  {
    "id": 1823,
    "mediaId": 2752,
    "date": "2022-04-07",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has written a 12-page love letter to Donald Trump in hopes of winning his endorsement in this fall's US Senate race.",
    "author": "Liz Dye",
    "title": "Arizona AG, Hoping For Trump Nod, Produces Election 'Report' Heavy On Innuendo, Light On Data"
  },
  {
    "id": 788,
    "mediaId": 2664,
    "date": "2022-04-18",
    "sentence": "\"The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump ranted in the 2021 statement.",
    "author": "Sarah K. Burris",
    "title": "Trump posts angry anti-endorsement for Arizona AG who refused to help change election results"
  },
  {
    "id": 148,
    "mediaId": 2557,
    "date": "2022-04-19",
    "sentence": "https://t.co/Pgogo9A7uO\n— <span class='selected-term'>Mark Brnovich</span> (@GeneralBrnovich) April 6, 2022\nBelow is Trump’s statement as he responded to the report:\nAttorney General Brnovich of Arizona was given massive information on the fraud and so-called ‘irregularities’ that took place in the 2020 Presidential Election.",
    "author": "DML News App",
    "title": "NEWS ALERT: AZ AG admits issues with 2020 election, Trump unleashes on him in scorching rebuke"
  },
  {
    "id": 732,
    "mediaId": 2692,
    "date": "2022-04-22",
    "sentence": "“It’s a completely unserious attempt to demand extraordinary, military-?style measures to stop completely mundane actions like walking around a closed port of entry to file asylum paperwork or violating international labor market regulations in order to fill one of the 10 million job openings in this country.”\nThe idea of a border “invasion” under the U.S. Constitution has already taken off in Arizona, where the Republican attorney general, <span class='selected-term'>Mark Brnovich</span>, issued a legal opinion in February that said the “violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an ‘invasion’ under the U.S. Constitution, and Arizona therefore has the power to defend itself” via its own executive branch.",
    "author": "Patrick Svitek",
    "title": "Some Texas Republicans push for Gov. Greg Abbott to use state personnel to deport migrants"
  }
]