[
  {
    "id": 6432,
    "mediaId": 2658,
    "date": "2022-01-03",
    "sentence": "That’s the sort of compromise we’re trying to do.”\nBALLOT BATTLE — Arizona state Attorney General <span class='selected-term'>Mark Brnovich</span> and Secretary of State Katie Hobbs are at odds over a new elections manual, Arizona Republic’s Mary Jo Pitzl wrote.",
    "author": "",
    "title": "Campaign season starts now"
  },
  {
    "id": 6428,
    "mediaId": 2512,
    "date": "2022-01-25",
    "sentence": "After now-President Joe Biden defeated then-President Donald Trump in Arizona in the 2020 election, State Attorney General <span class='selected-term'>Mark Brnovich</span> was among the Arizona Republicans who refused to promote Trump’s false claims of election fraud.",
    "author": "Alex Henderson",
    "title": "Arizona writer lambasts State AG Brnovich for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 6393,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "After now-President Joe Biden defeated then-President Donald Trump in Arizona in the 2020 election, State Attorney General <span class='selected-term'>Mark Brnovich</span> was among the Arizona Republicans who refused to promote Trump’s false claims of election fraud.",
    "author": "Alex Henderson",
    "title": "Arizona's attorney general just got blasted for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 6358,
    "mediaId": 2572,
    "date": "2022-01-27",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> reacted Thursday on \"The Faulkner Focus\" to video footage of illegal migrants being released into the United States by I.C.E.",
    "author": "Fox News Staff",
    "title": "Arizona AG Brnovich on ICE releasing migrants into communities: Biden admin wants to 'abolish' our border"
  },
  {
    "id": 7047,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "",
    "author": "",
    "title": "Arizona bill would allow legislature to overturn election results"
  },
  {
    "id": 6811,
    "mediaId": 2553,
    "date": "2022-02-01",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> submitted a petition for rulemaking to the U.S. Department of Health and Human Services (HHS) asking for the agency to adopt a rule that would prohibit the use of race or ethnicity when determining who should get medical therapies.",
    "author": "Ashe Schow",
    "title": "Arizona AG Asks HHS To Prohibit Racial Discrimination In COVID-19 Treatments"
  },
  {
    "id": 5752,
    "mediaId": 2514,
    "date": "2022-02-02",
    "sentence": "The case involving the lawsuit was initially assigned to U.S. District Judge Susan Brnovich, a Trump appointee whose husband, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, was criticized by Trump at a rally in the state last month for not doing more to investigate \"fraud\" in the 2020 election.",
    "author": "",
    "title": "Two 'alternate electors' sue Jan. 6 committee to block subpoena"
  },
  {
    "id": 5455,
    "mediaId": 2572,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Fox News Staff",
    "title": "Arizona attorney general: Biden sending US troops to secure Ukraine border is 'height of hypocrisy'"
  },
  {
    "id": 5471,
    "mediaId": 2572,
    "date": "2022-02-07",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> on Monday issued a legal opinion that determines that the ongoing crisis at the southern border is an \"invasion\" under the Constitution – a move he says gives the state the power to take additional measures to defend itself.",
    "author": "Adam Shaw",
    "title": "Arizona AG Brnovich issues legal opinion declaring border crisis 'invasion' under Constitution"
  },
  {
    "id": 5644,
    "mediaId": 2746,
    "date": "2022-02-07",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> issued an official opinion Monday saying the surge of illegal immigrants coming across the border meets the legal definition of an “invasion” under the U.S. Constitution.",
    "author": "Stephen Dinan",
    "title": "Arizona AG rules border surge is an ‘invasion,’ state can defend itself"
  },
  {
    "id": 5728,
    "mediaId": 5247,
    "date": "2022-02-08",
    "sentence": "The opinion from Attorney General <span class='selected-term'>Mark Brnovich</span> came in response to a request from a GOP state lawmaker.",
    "author": "Bob Christie",
    "title": "Political football? Arizona AG says governor can send armed troops to border."
  },
  {
    "id": 5819,
    "mediaId": 2644,
    "date": "2022-02-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> claims in a new legal opinion that Republican Gov.",
    "author": "Steven Nelson",
    "title": "Arizona AG says state can cite ‘invasion’ to deport migrants without feds"
  },
  {
    "id": 6178,
    "mediaId": 2600,
    "date": "2022-02-09",
    "sentence": "The attorneys general of Arizona, Idaho, Indiana, Nebraska, and South Carolina, led by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, mounted a federal lawsuit (pdf) arguing that President Joe Biden lacked statutory authority when he signed an executive order on April 27, 2021, to mandate the minimum wage.",
    "author": "IWB",
    "title": "States Sue Biden Over Min Wage Increase"
  },
  {
    "id": 4539,
    "mediaId": 2572,
    "date": "2022-02-18",
    "sentence": "FIRST ON FOX: Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is citing the failure by the Biden administration to release the Immigration and Customs Enforcement (ICE) annual report as the latest example of the lack of transparency that the Department of Homeland Security has exhibited when it comes to the effects of its liberal immigration policies.",
    "author": "Adam Shaw",
    "title": "Arizona AG says Biden admin's failure to release ICE annual report latest example of DHS' lack of transparency"
  },
  {
    "id": 5112,
    "mediaId": 2746,
    "date": "2022-02-21",
    "sentence": "“While America is indeed the land of opportunity, it’s not the land of the welfare state,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told The Washington Times.",
    "author": "Stephen Dinan",
    "title": "DHS eyes more welfare for legal immigrants as Supreme Court hears challenge"
  },
  {
    "id": 5285,
    "mediaId": 6511,
    "date": "2022-02-22",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5323,
    "mediaId": 3987,
    "date": "2022-02-23",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5391,
    "mediaId": 2637,
    "date": "2022-02-23",
    "sentence": "The justices heard oral arguments in an appeal by 13 Republican state attorneys general led by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> of a lower court’s ruling that rejected their bid to defend Trump’s rule, which expanded the scope of those considered likely to become a “public charge.”\nArticle content\nPresident Joe Biden’s administration dropped the government’s defense of the policy, prompting the action by the states.",
    "author": "Andrew Chung",
    "title": "U.S. Supreme Court mulls Republican bid to defend Trump immigration rule"
  },
  {
    "id": 5260,
    "mediaId": 6511,
    "date": "2022-02-23",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5087,
    "mediaId": 2679,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "JESSICA GRESKO",
    "title": "High court wades into clash over Trump-era immigration rule"
  },
  {
    "id": 5085,
    "mediaId": 2592,
    "date": "2022-02-23",
    "sentence": "The justices heard oral arguments in an appeal by 13 Republican state attorneys general led by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> of a lower court's ruling that rejected their bid to defend Trump's rule, which expanded the scope of those considered likely to become a \"public charge.\"",
    "author": "Andrew Chung",
    "title": "U.S. Supreme Court Mulls Republican Bid To Defend Trump Immigration Rule"
  },
  {
    "id": 5052,
    "mediaId": 2728,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "Jessica Gresko",
    "title": "High court wades into clash over Trump-era immigration rule"
  },
  {
    "id": 5057,
    "mediaId": 2636,
    "date": "2022-02-23",
    "sentence": "",
    "author": "",
    "title": "Supreme Court Weighs Whether States May Defend a Trump Immigration Policy"
  },
  {
    "id": 5050,
    "mediaId": 2745,
    "date": "2022-02-23",
    "sentence": "That left states that favored the public charge rule without recourse, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> (R) told the justices Wednesday.",
    "author": "",
    "title": "Supreme Court considers whether Biden administration properly ditched Trump immigration rule"
  },
  {
    "id": 4747,
    "mediaId": 2746,
    "date": "2022-02-23",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told the justices that even tacit approval of what the Biden administration did would set a precedent future presidents would abuse, using the courts to get rid of previous administration policies without going through the usual regulatory process.",
    "author": "Stephen Dinan",
    "title": "Supreme Court struggles for a solution to Biden’s handling of immigration ‘Public Charge’ rules"
  },
  {
    "id": 4927,
    "mediaId": 2594,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "Via AP news wire",
    "title": "High court wades into clash between Biden, Republican states"
  },
  {
    "id": 4028,
    "mediaId": 2526,
    "date": "2022-02-24",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> argued that Biden’s strategy is “an unprecedented legal maneuver.” Because Biden dismissed the remaining legal challenges to the public charge rule, Arizona argues that states that supported the rule were left with no recourse.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Supreme Court Hears Arguments Over ‘Public Charge’ Rule"
  },
  {
    "id": 4941,
    "mediaId": 2641,
    "date": "2022-02-24",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> accused the Biden administration on Thursday of intentionally undermining the law by withdrawing a Trump-era policy that bars immigrants from permanent residency if they are likely to need public assistance.",
    "author": "Brian Trusdell",
    "title": "Arizona AG Brnovich to Newsmax: Biden Admin Intentionally Undermining Law"
  },
  {
    "id": 4280,
    "mediaId": 4091,
    "date": "2022-02-25",
    "sentence": "He also said that the results were being provided to the Arizona Senate as well as GOP Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "JD Heyes",
    "title": "Bombshell study finds more than 200,000 ballots from 2020 election with “mismatched signatures” indicating widespread fraud"
  },
  {
    "id": 3648,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "More than a dozen Republican attorneys general, led by Arizona’s <span class='selected-term'>Mark Brnovich</span>, have sought to defend the 2019 public charge rule, which broadened the definition of \"public charge\" to include an immigrant who receives one or more designated public benefits for more than 12 months within a 36-month period -- and included a substantial number of benefits.",
    "author": "Adam Shaw",
    "title": "SCOTUS hears GOP push to defend Trump-era public charge rule; Arizona AG calls Biden moves ‘unprecedented’"
  },
  {
    "id": 4304,
    "mediaId": 2595,
    "date": "2022-02-28",
    "sentence": "“More than a dozen Republican attorneys general, led by Arizona’s <span class='selected-term'>Mark Brnovich</span>, have sought to defend the 2019 public charge rule, which broadened the definition of ‘public charge’ to include an immigrant who receives one or more designated public benefits for more than 12 months within a 36-month period — and included a substantial number of benefits,” Fox News reported on Saturday.",
    "author": "M Dowling",
    "title": "Admin Schemes After SCOTUS Hears the ‘Welfare for Illegal Aliens’ Case"
  },
  {
    "id": 3976,
    "mediaId": 2636,
    "date": "2022-03-03",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> has led a handful of lesser-known Republicans in some polls ahead of the August primary, but the race has been frozen as G.O.P.",
    "author": "",
    "title": "Ducey Confirms He Will Not Run for Senate, Despite McConnell’s Wooing"
  },
  {
    "id": 3937,
    "mediaId": 2679,
    "date": "2022-03-07",
    "sentence": "Arizona’s Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "BRIAN SLODYSKO",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 4189,
    "mediaId": 2569,
    "date": "2022-03-07",
    "sentence": "Arizona’s Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "Associated Press",
    "title": "Republican ‘unforced errors’ threaten path to U.S. Senate control"
  },
  {
    "id": 2009,
    "mediaId": 2557,
    "date": "2022-03-22",
    "sentence": "Here, the answer is no.”\nPromoted Content\nIn November 2020, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, Montana Attorney General Austin Knudsen, and Ohio Attorney General Dave Yost filed a lawsuit against the Biden administration in over the policy revision, which they said “dramatically ties the hands of immigration officers, halting nearly all deportations.”\nBrnovich celebrated the ruling, writing on Twitter, “VICTORY: A federal judge just blocked the lawless Biden Administration policy that halted nearly all deportations after our office challenged this guidance.",
    "author": "DML News App",
    "title": "BREAKING: Judge deals huge blow to Biden effort to limit ICE enforcement"
  },
  {
    "id": 2355,
    "mediaId": 2912,
    "date": "2022-03-23",
    "sentence": "“The Board of Supervisors remains committed to free and fair elections that conform to federal and state laws.”\nDespite those findings, Republican Attorney General <span class='selected-term'>Mark Brnovich</span> is still reviewing questions the Senate’s “audit” raised about possible problems.",
    "author": "",
    "title": "Final Arizona election report finds no county data issues"
  },
  {
    "id": 2341,
    "mediaId": 6551,
    "date": "2022-03-24",
    "sentence": "Justice and our country’s well-being require it.”\nArizona AG <span class='selected-term'>Mark Brnovich</span> argued that the decision was a “tremendous victory” in a statement made to the Daily Caller News Foundation, adding;\nSince assuming office, the Biden administration has undermined our immigration laws and our law enforcement agencies, while empowering dangerous cartels and criminals on both sides of the border.",
    "author": "",
    "title": "Judge Blocks Biden's Attempt to Halt Certain ICE Deportations"
  },
  {
    "id": 2400,
    "mediaId": 2721,
    "date": "2022-03-25",
    "sentence": "“This is a tremendous victory for the rule of law and the safety of our communities,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in a press release Tuesday.",
    "author": "",
    "title": "Kamala Harris out as border czar?! This lawsuit says…"
  },
  {
    "id": 951,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "FIRST ON FOX: Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is warning the Biden administration that the U.S. will face a \"tidal wave\" of migration if it goes through with its reported plan to lift Title 42 in the coming months -- tapping into broad bipartisan concerns that the move will spark a massive migrant surge.",
    "author": "Adam Shaw",
    "title": "Arizona AG warns of 'tidal wave' of migrants at southern border if Biden admin lifts Title 42"
  },
  {
    "id": 1099,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> ?told ?”?Fox & Friends” Monday.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 1430,
    "mediaId": 2591,
    "date": "2022-04-04",
    "sentence": "The attorneys general argue that the end of the order will result in a number of higher costs for the states, including higher health care costs for illegal migrants infected with COVID-19 and “the presence of much greater numbers of paroled aliens with non-meritorious asylum claims …”\n“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said.",
    "author": "Human Events Staff",
    "title": "Republican States Sue Biden to Stop End to Title 42"
  },
  {
    "id": 1507,
    "mediaId": 2522,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> bluntly stated on “Fox & Friends” Monday.",
    "author": "Terresa Monroe-Hamilton",
    "title": "GOP states sue Biden admin over plan to rescind Title 42 border policy, likely open migrant floodgates"
  },
  {
    "id": 1162,
    "mediaId": 2526,
    "date": "2022-04-04",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, Louisiana Attorney General Jeff Landry, and Missouri Attorney General Eric Schmitt have filed a lawsuit against President Joe Biden’s administration for plans to end the Title 42 border control that has helped stem waves of illegal immigration since 2020.",
    "author": "John Binder",
    "title": "Arizona, Louisiana, Missouri Sue Biden for Ending Title 42 Border Control"
  },
  {
    "id": 1161,
    "mediaId": 2746,
    "date": "2022-04-04",
    "sentence": "“The Title 42 Revocation thus stands as a radical outlier — seemingly the only COVID-19-based restriction the Administration sees fit to end,” said Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, Louisiana Attorney General Jeff Landry and Missouri Attorney General Eric S. Schmitt.",
    "author": "Stephen Dinan",
    "title": "States sue to halt Biden from ending border order stopping illegal immigrants"
  },
  {
    "id": 1193,
    "mediaId": 2557,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told Fox News on Monday.",
    "author": "",
    "title": "NEWS ALERT: Three GOP states sue over end of Title 42"
  },
  {
    "id": 1316,
    "mediaId": 6449,
    "date": "2022-04-04",
    "sentence": "“The U.S. Department of Homeland Security, (DHS), estimates getting rid of Title 42 will result in as many as 18,000 migrants per day—which could mean 540,000 migrants in a single month.”\n— Daily Caller (@DailyCaller) April 1, 2022\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span>, the only border state official of the group, said his state will be at the forefront of the consequences of the decision.",
    "author": "Jennie Taer",
    "title": "3 States Sue Biden Administration Over Ending COVID-19 Restrictions at Border"
  },
  {
    "id": 1809,
    "mediaId": 6511,
    "date": "2022-04-04",
    "sentence": "La petición es firmada por los fiscales generales de Arizona, <span class='selected-term'>Mark Brnovich</span>; de Missouri, Eric Schmitt, y la procuradora general de Louisiana, Elizabeth Murrill.",
    "author": "",
    "title": "Tres estados republicanos piden a juez bloquear decisión de Biden para terminar el Título 42 contra inmigrantes"
  },
  {
    "id": 1687,
    "mediaId": 2724,
    "date": "2022-04-04",
    "sentence": "Republican states sue to stop Biden admin’s lifting of Title 42 border policy https://t.co/r8v6MoexYp\n— Fox News (@FoxNews) April 4, 2022\nRepublican States Push Back\nAttorneys General <span class='selected-term'>Mark Brnovich</span> of Arizona, Jeff Landry of Louisiana, and Eric Schmitt of Missouri have filed the lawsuit.",
    "author": "Becky Noble",
    "title": "GOP States Sue As Biden Adm. Lifts Title 42 Order, Expected To Create Surge Of Illegal Immigrants At Border"
  },
  {
    "id": 1704,
    "mediaId": 6503,
    "date": "2022-04-05",
    "sentence": "“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” said Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Warner Todd Huston",
    "title": "GOP-Led States Sue to Prevent Biden from Canceling Immigration Rules and Pushing Wide Open Border Policy"
  },
  {
    "id": 1807,
    "mediaId": 2563,
    "date": "2022-04-05",
    "sentence": "To states like Arizona, Texas, and California, “it’s throwing gasoline on a fire,” state Attorney General <span class='selected-term'>Mark Brnovich</span> (R-Ariz.) shook his head.",
    "author": "Family Research Council",
    "title": "VIDEO: ‘Human Tsunami’ Puts Border on the Brink"
  },
  {
    "id": 1575,
    "mediaId": 2801,
    "date": "2022-04-05",
    "sentence": "",
    "author": "ACACIA CORONADO and PAUL J. WEBER",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1081,
    "mediaId": 2822,
    "date": "2022-04-05",
    "sentence": "",
    "author": "",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1149,
    "mediaId": 2525,
    "date": "2022-04-06",
    "sentence": "",
    "author": "Associated Press",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1514,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Republicans have a primary fight that AG <span class='selected-term'>Mark Brnovich</span> appears to be leading comfortably so far despite worries among the base that he might not be conservative/populist enough for the GOP at the moment.",
    "author": "Ed Morrissey",
    "title": "Midterm signals: Kelly looking to break out of Biden's orbit"
  },
  {
    "id": 1612,
    "mediaId": 2560,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "Acacia Coronado and Paul J. Weber",
    "title": "Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 1326,
    "mediaId": 2518,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "The Associated Press",
    "title": "Ex-Trump officials urge Texas to declare border ‘invasion’"
  },
  {
    "id": 1350,
    "mediaId": 2514,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "",
    "title": "Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 1349,
    "mediaId": 2509,
    "date": "2022-04-06",
    "sentence": "",
    "author": "ACACIA CORONADO and PAUL J. WEBER Associated Press",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1186,
    "mediaId": 2590,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "ACACIA CORONADO and PAUL J. WEBER",
    "title": "Ex-Trump Officials Urge Texas To Declare Border 'Invasion'"
  },
  {
    "id": 1777,
    "mediaId": 6551,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said Monday morning on \"FOX & Friends:\"\nWe want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things.",
    "author": "",
    "title": "Several States Sue to Stop Biden's Ending of Title 42"
  },
  {
    "id": 1644,
    "mediaId": 2751,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "",
    "title": "'Unprecedented action': Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 1709,
    "mediaId": 2869,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "ACACIA CORONADO and PAUL J. WEBER",
    "title": "Ex-Trump officials urge Texas Gov. Greg Abbott to declare border crossings an 'invasion'"
  },
  {
    "id": 1593,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Arizona attorney general <span class='selected-term'>Mark Brnovich</span> issued a report Wednesday that found no evidence of widespread voter fraud or irregularities in Maricopa County, despite Trump's persistent pressure campaign to justify his false claims about his election loss, and the \"Morning Joe\" host said he's had enough.",
    "author": "Travis Gettys",
    "title": "Morning Joe hammers GOP 'freaks' still clinging to Trump's election lies"
  },
  {
    "id": 1344,
    "mediaId": 3987,
    "date": "2022-04-07",
    "sentence": "",
    "author": "AV Press Releases",
    "title": "Dems Should Heed The Call of Leading Voices and Key Constituencies: Title 42 Needs to Go"
  },
  {
    "id": 979,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Trump has continued his pressure on Brnovich, chastising him in written statements and asking him to “do something.”\nBy the way, before he decided to run for the U.S. Senate, Brnovich was singing a different tune:\nShortly after the 2020 presidential election Attorney General <span class='selected-term'>Mark Brnovich</span> appeared on Fox Business, where he was asked about unsubstantiated claims of election fraud in Arizona.",
    "author": "",
    "title": "Surprising No One, MAGA AG's \"2020 Election Fraud\" Investigation Turns Out To Be A Bust"
  },
  {
    "id": 1838,
    "mediaId": 2681,
    "date": "2022-04-08",
    "sentence": "“All branches of government in this state must come together to provide full assurance of the integrity of our elections and answer every outstanding question,” said a report from Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "",
    "title": "2020 ‘election fraud’ in Arizona ‘raises questions,’ AG reports"
  },
  {
    "id": 198,
    "mediaId": 2641,
    "date": "2022-04-11",
    "sentence": "\"As attorney general, I would deploy a mobile prosecution unit to arrest individuals under state criminal trespassing laws and similar to what [Attorney General] <span class='selected-term'>Mark Brnovich</span> has done in the state of Arizona; assert the state's sovereignty under the Constitution, where the federal government is compelled to defend the states.",
    "author": "Sandy Fitzgerald",
    "title": "George P. Bush to Newsmax: Abbott Right With Plan to Bus Immigrants"
  },
  {
    "id": 788,
    "mediaId": 2664,
    "date": "2022-04-18",
    "sentence": "\"The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump ranted in the 2021 statement.",
    "author": "Sarah K. Burris",
    "title": "Trump posts angry anti-endorsement for Arizona AG who refused to help change election results"
  },
  {
    "id": 443,
    "mediaId": 2855,
    "date": "2022-04-21",
    "sentence": "",
    "author": "George Fishman",
    "title": "42 Skiddo: Is the Biden Administration Expelling Border Security?"
  },
  {
    "id": 732,
    "mediaId": 2692,
    "date": "2022-04-22",
    "sentence": "“It’s a completely unserious attempt to demand extraordinary, military-?style measures to stop completely mundane actions like walking around a closed port of entry to file asylum paperwork or violating international labor market regulations in order to fill one of the 10 million job openings in this country.”\nThe idea of a border “invasion” under the U.S. Constitution has already taken off in Arizona, where the Republican attorney general, <span class='selected-term'>Mark Brnovich</span>, issued a legal opinion in February that said the “violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an ‘invasion’ under the U.S. Constitution, and Arizona therefore has the power to defend itself” via its own executive branch.",
    "author": "Patrick Svitek",
    "title": "Some Texas Republicans push for Gov. Greg Abbott to use state personnel to deport migrants"
  },
  {
    "id": 542,
    "mediaId": 2589,
    "date": "2022-04-22",
    "sentence": "As Arizona AG and Republican Senate candidate <span class='selected-term'>Mark Brnovich</span> pointed out in its challenge, the White House and DHS hasn’t followed the Administrative Procedure Act (APA) process for the rule change, and courts take the APA very seriously:\nThe Biden administration has a pattern of unlawfully circumventing correct processes required under the Administrative Procedure Act (APA).",
    "author": "Ed Morrissey",
    "title": "Biden to Dems: We're ending Title 42 no matter how much you complain"
  }
]