[
  {
    "id": 6746,
    "mediaId": 2578,
    "date": "2022-01-19",
    "sentence": "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State Katie Hobbs for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General <span class='selected-term'>Mark Brnovich</span> for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "author": "Jordan Conradson",
    "title": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022"
  },
  {
    "id": 6882,
    "mediaId": 2748,
    "date": "2022-01-20",
    "sentence": "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State Katie Hobbs for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General <span class='selected-term'>Mark Brnovich</span> for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "author": "",
    "title": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022"
  },
  {
    "id": 5680,
    "mediaId": 2664,
    "date": "2022-02-03",
    "sentence": "The Wards’ case was initially assigned to U.S. District Judge Susan M. Brnovich, who is married to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican who is running for U.S. Senate.",
    "author": "Jacob Fischler",
    "title": "Arizona GOP chair sues to block Jan. 6 panel’s records subpoena"
  },
  {
    "id": 5776,
    "mediaId": 2641,
    "date": "2022-02-05",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> has reached an agreement with the State Bar of Arizona to resolve complaints alleging he violated ethical rules in representing Secretary of State Katie Hobbs and the Arizona Board of Regents.",
    "author": "",
    "title": "Arizona Attorney General, State Bar Reach Diversion Deal"
  },
  {
    "id": 5735,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "PHOENIX — Arizona Secretary of State Katie Hobbs is suing Attorney General <span class='selected-term'>Mark Brnovich</span> after he threatened to prosecute her if she temporarily shuts down for a required update to an online system that allows election candidates to collect the signatures they need to qualify for the ballot.",
    "author": "Bob Christie",
    "title": "Arizona elections chief sues AG over prosecution threat"
  },
  {
    "id": 4860,
    "mediaId": 2664,
    "date": "2022-02-14",
    "sentence": "Hobbs referred the misuse to Attorney General <span class='selected-term'>Mark Brnovich</span> 14 months ago, but \"nothing has happened\" and Hobbs' office claims to have never received a response to its referral.",
    "author": "Bob Brigham",
    "title": "Trump's fake electors illegally used state seal — but GOP attorney general has done nothing: report"
  },
  {
    "id": 3903,
    "mediaId": 2662,
    "date": "2022-02-28",
    "sentence": "All evidence was delivered to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, and Arizona awaits indictments and decertification.",
    "author": "Jordan Conradson",
    "title": "BREAKING: Arizona GOP Sues Secretary of State Katie Hobbs To Ban Unconstitutional Drop Boxes, And No-Excuse Mail-In Voting In Arizona"
  },
  {
    "id": 2056,
    "mediaId": 2578,
    "date": "2022-03-19",
    "sentence": "If you’re unable to access the E-Qual system, you can file an election complaint with our office: https://t.co/e9rFhbhKPf\n— <span class='selected-term'>Mark Brnovich</span> (@GeneralBrnovich) March 18, 2022\nTalonya Adams, a former Democratic staffer in the Arizona Senate, tweeted noting the clear conflict of interest for Hobbs’ failing gubernatorial campaign.",
    "author": "Jordan Conradson",
    "title": "Soros-Backed Secretary of State Katie Hobbs Violates Arizona State Election Law by Shutting Down Election Petition System for Certain Candidates"
  },
  {
    "id": 2091,
    "mediaId": 2662,
    "date": "2022-03-30",
    "sentence": "In a letter sent Tuesday, Attorney General <span class='selected-term'>Mark Brnovich</span> delegated his powers to enforce criminal action against crooked Katie Hobbs for shutting down the online candidate petition portal and intentionally violating the law.",
    "author": "Jordan Conradson",
    "title": "JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State Katie Hobbs For Election Crimes"
  },
  {
    "id": 2638,
    "mediaId": 2601,
    "date": "2022-03-30",
    "sentence": "In a letter sent Tuesday, Attorney General <span class='selected-term'>Mark Brnovich</span> delegated his powers to enforce criminal action against crooked Katie Hobbs for shutting down the online candidate petition portal and intentionally violating the law.",
    "author": "MJA",
    "title": "Arizona AG Mark Brnovich Refers Criminal Action Against AZ Secretary of State For Election Crimes"
  },
  {
    "id": 2396,
    "mediaId": 4418,
    "date": "2022-03-31",
    "sentence": "FOX News reports:\nTRENDING: JUST IN: Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> Refers Criminal Action Against AZ Secretary of State Katie Hobbs For Election Crimes\nFlorida’s registered Republican voters outnumber Democrats by over 100K for first time\nA red wave is brewing in Florida as registered Republican voters now outnumber Democrats by over 100,000 for the first time in the state’s history, according to data obtained by Fox News Digital.",
    "author": "Jake Lambert",
    "title": "REPORT: Registered Republican Voters Now Outnumber Democrats In Florida By Over 100,000"
  },
  {
    "id": 500,
    "mediaId": 4091,
    "date": "2022-04-12",
    "sentence": "This is according to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, who recently published an interim report that was sent to the president of the Arizona Senate, Karen Fann, relaying the findings of a forensic election audit.",
    "author": "Cassie B.",
    "title": "Criminal prosecutions for Maricopa County election fraud are coming, according to Arizona AG’s interim report"
  },
  {
    "id": 496,
    "mediaId": 4091,
    "date": "2022-04-21",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has sent notice to the president of the state Senate, Karen Fann, with his finding in an interim report pertaining to a forensic ballot audit conducted in the months after the election in Maricopa County, and in his report, he has called for criminal prosecutions, according to 100 Percent Fed Up.",
    "author": "JD Heyes",
    "title": "Arizona AG Brnovich sends notice to state Senate, says criminal prosecutions coming in relation to 2020 election"
  },
  {
    "id": 306,
    "mediaId": 2680,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is joining with Republican Party officials to sue Democratic Secretary of State Katie Hobbs in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "BOB CHRISTIE",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  },
  {
    "id": 842,
    "mediaId": 2822,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is joining with Republican Party officials to sue Democratic Secretary of State Katie Hobbs in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  }
]