[
  {
    "id": 6432,
    "mediaId": 2658,
    "date": "2022-01-03",
    "sentence": "That’s the sort of compromise we’re trying to do.”\nBALLOT BATTLE — Arizona state Attorney General <span class='selected-term'>Mark Brnovich</span> and Secretary of State Katie Hobbs are at odds over a new elections manual, Arizona Republic’s Mary Jo Pitzl wrote.",
    "author": "",
    "title": "Campaign season starts now"
  },
  {
    "id": 6746,
    "mediaId": 2578,
    "date": "2022-01-19",
    "sentence": "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State Katie Hobbs for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General <span class='selected-term'>Mark Brnovich</span> for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "author": "Jordan Conradson",
    "title": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022"
  },
  {
    "id": 6882,
    "mediaId": 2748,
    "date": "2022-01-20",
    "sentence": "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State Katie Hobbs for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General <span class='selected-term'>Mark Brnovich</span> for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "author": "",
    "title": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022"
  },
  {
    "id": 6530,
    "mediaId": 2748,
    "date": "2022-01-20",
    "sentence": "Arizona State Senator Wendy Rogers said, “I will be pushing for this as soon as possible.”\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> needs to follow through on his criminal investigation into the fraudulent 2020 Election.",
    "author": "",
    "title": "WATCH: Maricopa County Violates Elections Policy In Elections Server Room – More Shady Footage Released Refutes Recent Claims Made By The County"
  },
  {
    "id": 7237,
    "mediaId": 2578,
    "date": "2022-01-20",
    "sentence": "Arizona State Senator Wendy Rogers said, “I will be pushing for this as soon as possible.”\n\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> needs to follow through on his criminal investigation into the fraudulent 2020 Election.",
    "author": "Jordan Conradson",
    "title": "WATCH: Maricopa County Violates Elections Policy In Elections Server Room – More Shady Footage Released Refutes Recent Claims Made By The County"
  },
  {
    "id": 7112,
    "mediaId": 2748,
    "date": "2022-01-22",
    "sentence": "It has been nearly four months since the Maricopa County hearing revealed damning evidence that Joe Biden did not win Arizona, and <span class='selected-term'>Mark Brnovich</span> has not even updated voters.",
    "author": "",
    "title": "MUST SEE: Arizona Senate President Karen Fann Gives Exclusive Update On Maricopa County Router Audit – AZ Attorney General Has Pulled Numerous People For Questioning"
  },
  {
    "id": 7095,
    "mediaId": 2656,
    "date": "2022-01-23",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> dismissed the threat with a reminder that states still have some rights.",
    "author": "Rick Moran",
    "title": "Arizona Sues Biden Administration For Threatening to Withhold Funds Over Masks"
  },
  {
    "id": 6675,
    "mediaId": 2724,
    "date": "2022-01-24",
    "sentence": "Skinner, who previously worked on top consumer-oriented cases under Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, argues the taxpayer-funded contracts between state governments and these firms often lack basic ethics protections that should be part of all outside-counsel contracts.",
    "author": "RealClearWire",
    "title": "Report: State Contracts Boost Dem-Linked Lawyers, Not Consumers"
  },
  {
    "id": 7040,
    "mediaId": 2512,
    "date": "2022-01-24",
    "sentence": "Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> agrees….",
    "author": "Alex Henderson",
    "title": "Newly released MAGA e-mails underscore Trump’s brazen efforts to overturn Arizona election results: report"
  },
  {
    "id": 6430,
    "mediaId": 2664,
    "date": "2022-01-24",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is now running for U.S. Senate, is said to be investigating the 2020 election in Arizona.",
    "author": "Sarah K. Burris",
    "title": "Arizona governor swears he never knew about the fake Trump electors despite Republican involvement"
  },
  {
    "id": 7106,
    "mediaId": 6466,
    "date": "2022-01-24",
    "sentence": "This case follows a landmark action in Arizona, brought in 2020, where AG <span class='selected-term'>Mark Brnovich</span> wanted the company to pay back ad money to users who though they had turned tracking off, but did not.",
    "author": "",
    "title": "Washington DC's AG sues Google for 'deceiving users and invading their privacy'"
  },
  {
    "id": 6428,
    "mediaId": 2512,
    "date": "2022-01-25",
    "sentence": "After now-President Joe Biden defeated then-President Donald Trump in Arizona in the 2020 election, State Attorney General <span class='selected-term'>Mark Brnovich</span> was among the Arizona Republicans who refused to promote Trump’s false claims of election fraud.",
    "author": "Alex Henderson",
    "title": "Arizona writer lambasts State AG Brnovich for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 6393,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "After now-President Joe Biden defeated then-President Donald Trump in Arizona in the 2020 election, State Attorney General <span class='selected-term'>Mark Brnovich</span> was among the Arizona Republicans who refused to promote Trump’s false claims of election fraud.",
    "author": "Alex Henderson",
    "title": "Arizona's attorney general just got blasted for becoming a 'Trump toady' who 'ignores traitors'"
  },
  {
    "id": 7233,
    "mediaId": 2896,
    "date": "2022-01-26",
    "sentence": "The audit is still ongoing, but The Arizona Senate delivered election-changing evidence of fraud to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> four months ago.",
    "author": "",
    "title": "BREAKING: Key Battleground State Passes Election Integrity Measures On Party Line Votes"
  },
  {
    "id": 6967,
    "mediaId": 2522,
    "date": "2022-01-26",
    "sentence": "The lawsuit, filed by Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, alleged that Google used unfair and deceptive practices to obtain users’ location data, which it then exploits for targeted advertising.",
    "author": "BPR Wire",
    "title": "Google handed major defeat in state AG lawsuit over location tacking"
  },
  {
    "id": 7047,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "",
    "author": "",
    "title": "Arizona bill would allow legislature to overturn election results"
  },
  {
    "id": 6358,
    "mediaId": 2572,
    "date": "2022-01-27",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> reacted Thursday on \"The Faulkner Focus\" to video footage of illegal migrants being released into the United States by I.C.E.",
    "author": "Fox News Staff",
    "title": "Arizona AG Brnovich on ICE releasing migrants into communities: Biden admin wants to 'abolish' our border"
  },
  {
    "id": 6819,
    "mediaId": 3993,
    "date": "2022-01-27",
    "sentence": "The fact that all of these top legal officers support our challenge to Maryland’s egregious law should carry considerable weight, and underscore the validity of our case.”\nLed by West Virginia AG Patrick Morrissey and Arizona AG <span class='selected-term'>Mark Brnovich</span>, the AGs of Alabama, Alaska, Arkansas, Florida, Georgia, Idaho, Indiana, Kansas, Louisiana, Mississippi, Missouri, Montana, Nebraska, New Hampshire, Ohio, Oklahoma, South Carolina, South Dakota, Texas, Utah, Virginia, and Wyoming declare in their amicus brief that if the Fourth Circuit’s ruling opinion stands, it “will exacerbate trends in Second Amendment jurisprudence that both directly and indirectly imperil Amici States’ laws and policy preferences,” which is lawyer-speak for “if you don’t overturn that decision the lower courts are going to re-interpret the Second Amendment into nothingness.”\nAs the AG’s point out, in order to declare Maryland’s ban on modern sporting rifles constitutionally sound, the Fourth Circuit had to contradict what the Supreme Court said in 2008’s Heller decision striking down Washington, D.C.’s ban on handguns and storage requirements that mandated guns be stored in a way that made them useless for self-defense in the home.",
    "author": "Cam Edwards",
    "title": "AGs urge SCOTUS to take second look at \"assault weapons\" ban"
  },
  {
    "id": 7102,
    "mediaId": 2627,
    "date": "2022-01-28",
    "sentence": "",
    "author": "",
    "title": "Arizona attorney general too busy kissing up to Trump to deal with fake elector referral"
  },
  {
    "id": 6745,
    "mediaId": 2659,
    "date": "2022-01-28",
    "sentence": "Yesterday, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> claimed President Biden and his administration are “subsidizing and basically decriminalizing people entering this country illegally.” Brnovich and Fox News personality Harris Faulkner suggested that the Biden administration is purposely releasing migrants into the country to sow chaos.",
    "author": "Alan Ryland",
    "title": "Lauren Boebert Claims Joe Biden is Helping “Illegals In the Dead of Night”"
  },
  {
    "id": 6449,
    "mediaId": 2662,
    "date": "2022-01-29",
    "sentence": "Arizona Senate President Karen Fann told TGP that Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has spoken to numerous people for his criminal investigation.",
    "author": "Jordan Conradson",
    "title": "HUGE – AZ AUDIT: Special Master Names Computer Experts To Examine Maricopa County Routers And Splunk Logs – Questions from the Arizona State Senate to Special Master John Shadegg Released"
  },
  {
    "id": 7235,
    "mediaId": 2753,
    "date": "2022-01-30",
    "sentence": "Skinner, who previously worked on top consumer-oriented cases under Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, argues the taxpayer-funded contracts between state governments and these firms often lack basic ethics protections that should be part of all outside-counsel contracts.",
    "author": "Wnd News Services, These Reports Are Produced Another News Agency, The Editors Of Wnd Believe You'Ll Find It Of Interest., Abliebing, The Western Journal, Laura Hollis, Bob Unruh, Patrice Lewis, Jack Davis, Wnd Staff",
    "title": "Report warns state contracts benefit donors to Democrat candidates"
  },
  {
    "id": 6558,
    "mediaId": 2548,
    "date": "2022-01-31",
    "sentence": "Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> sent a letter to Department of Homeland Security (DHS) Secretary Alejandro Mayorkas on Jan. 27 demanding that he stop allowing illegal migrants to travel through U.S. airports over a TSA policy permitting them to use arrest warrants as identification.",
    "author": "",
    "title": "State AG Asks Mayorkas To Stop Letting Illegal Migrants Travel Through US Airports With Arrest Warrants"
  },
  {
    "id": 7158,
    "mediaId": 2744,
    "date": "2022-01-31",
    "sentence": "“Americans bearing these firearms benefit public safety, counterbalance the threat of illegal gun violence, and help make our streets safer,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said.",
    "author": "",
    "title": "25 states urge Supreme Court to hear case challenging Maryland’s strict firearm laws"
  },
  {
    "id": 7126,
    "mediaId": 6443,
    "date": "2022-01-31",
    "sentence": "Although this poll has Kelly with razor-thin leads over his most likely potential opponents (Attorney General <span class='selected-term'>Mark Brnovich</span> and Gov.",
    "author": "",
    "title": "Biden gets a Supreme Court pick"
  },
  {
    "id": 6811,
    "mediaId": 2553,
    "date": "2022-02-01",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> submitted a petition for rulemaking to the U.S. Department of Health and Human Services (HHS) asking for the agency to adopt a rule that would prohibit the use of race or ethnicity when determining who should get medical therapies.",
    "author": "Ashe Schow",
    "title": "Arizona AG Asks HHS To Prohibit Racial Discrimination In COVID-19 Treatments"
  },
  {
    "id": 5455,
    "mediaId": 2572,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Fox News Staff",
    "title": "Arizona attorney general: Biden sending US troops to secure Ukraine border is 'height of hypocrisy'"
  },
  {
    "id": 5885,
    "mediaId": 2779,
    "date": "2022-02-02",
    "sentence": "In Arizona, state Attorney General <span class='selected-term'>Mark Brnovich</span> is also in election mode, and he too takes a Miller-esque view of the border.",
    "author": "Ryan Devereaux",
    "title": "Greg Abbott’s Border Theater Is Having Disastrous Consequences for Everyone Involved"
  },
  {
    "id": 5752,
    "mediaId": 2514,
    "date": "2022-02-02",
    "sentence": "The case involving the lawsuit was initially assigned to U.S. District Judge Susan Brnovich, a Trump appointee whose husband, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, was criticized by Trump at a rally in the state last month for not doing more to investigate \"fraud\" in the 2020 election.",
    "author": "",
    "title": "Two 'alternate electors' sue Jan. 6 committee to block subpoena"
  },
  {
    "id": 5584,
    "mediaId": 2643,
    "date": "2022-02-02",
    "sentence": "An Arizona woman was indicted on illegal voting and perjury charges for allegedly casting a ballot in the 2020 election on behalf of her deceased mother, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said Wednesday.",
    "author": "Meghan Roos",
    "title": "Daughter Accused of Casting Illegal 2020 Ballot on Behalf of Dead Mother"
  },
  {
    "id": 6030,
    "mediaId": 2688,
    "date": "2022-02-02",
    "sentence": "According to Politico, the Wards’ lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, the wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> — an ally of former President Donald Trump who is running for Senate.",
    "author": "Matt Shuham",
    "title": "Jan. 6 Committee Subpoenas Arizona GOP Chair And Her Husband’s Phone Records"
  },
  {
    "id": 5610,
    "mediaId": 2658,
    "date": "2022-02-02",
    "sentence": "The two, who are also being represented by Kolodin, said in a statement through their attorney they were targeted for “exercising their fundamental rights as Americans.”\nOther states’ attorneys general have voiced concerns about the alternate slates of electoral, but Arizona Democrats have complained that <span class='selected-term'>Mark Brnovich</span> has taken no public action to investigate the effort by Kelli Ward and other GOP activists to certify themselves as Arizona’s official electors for the 2020 election.",
    "author": "",
    "title": "Jan. 6 select committee subpoenas phone records of Arizona GOP chair"
  },
  {
    "id": 5970,
    "mediaId": 2740,
    "date": "2022-02-03",
    "sentence": "The lawsuit has been assigned to U.S. District Court Judge Susan Brnovich, wife of Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Senate candidate and ally of former President Donald Trump.",
    "author": "Chelsey Cox",
    "title": "Arizona GOP Chair Kelli Ward, spouse, sue to block Jan. 6 panel from accessing phone records"
  },
  {
    "id": 5680,
    "mediaId": 2664,
    "date": "2022-02-03",
    "sentence": "The Wards’ case was initially assigned to U.S. District Judge Susan M. Brnovich, who is married to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican who is running for U.S. Senate.",
    "author": "Jacob Fischler",
    "title": "Arizona GOP chair sues to block Jan. 6 panel’s records subpoena"
  },
  {
    "id": 5519,
    "mediaId": 2662,
    "date": "2022-02-04",
    "sentence": "HUGE – AZ AUDIT: Special Master Names Computer Experts To Examine Maricopa County Routers And Splunk Logs – Questions from the Arizona State Senate to Special Master John Shadegg Released\nWe The People AZ Alliance will deliver this evidence to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> for his ongoing criminal investigation.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Maricopa County FOIA Emails Reveal Gross Negligence, Missing Internet Connection Logs?"
  },
  {
    "id": 5776,
    "mediaId": 2641,
    "date": "2022-02-05",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> has reached an agreement with the State Bar of Arizona to resolve complaints alleging he violated ethical rules in representing Secretary of State Katie Hobbs and the Arizona Board of Regents.",
    "author": "",
    "title": "Arizona Attorney General, State Bar Reach Diversion Deal"
  },
  {
    "id": 5471,
    "mediaId": 2572,
    "date": "2022-02-07",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> on Monday issued a legal opinion that determines that the ongoing crisis at the southern border is an \"invasion\" under the Constitution – a move he says gives the state the power to take additional measures to defend itself.",
    "author": "Adam Shaw",
    "title": "Arizona AG Brnovich issues legal opinion declaring border crisis 'invasion' under Constitution"
  },
  {
    "id": 5578,
    "mediaId": 2641,
    "date": "2022-02-07",
    "sentence": "\"The violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an 'invasion' under the U.S. Constitution, and Arizona therefore has the power to defend itself from this invasion under the Governor’s authority as Commander-in-Chief,\" Attorney General <span class='selected-term'>Mark Brnovich</span> writes.",
    "author": "Jack Gournell",
    "title": "AG Brnovich: Arizona Can Declare 'Invasion,' Defend Self Under Constitution"
  },
  {
    "id": 5864,
    "mediaId": 2548,
    "date": "2022-02-07",
    "sentence": "Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> issued an opinion Monday calling the crisis at the border an “invasion,” claiming that by declaring it as such the state is allowed to take more action to defend itself against the “invasion.”\n“The federal government’s failure to secure the border and protect Arizona from invasion is dangerous and unprecedented,” Brnovich said in a statement.",
    "author": "Brianna Lyman",
    "title": "AG Says His State Is Under ‘Invasion’ From Illegal Migrants, Threatens To Defy Biden And Defend The Border"
  },
  {
    "id": 5644,
    "mediaId": 2746,
    "date": "2022-02-07",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> issued an official opinion Monday saying the surge of illegal immigrants coming across the border meets the legal definition of an “invasion” under the U.S. Constitution.",
    "author": "Stephen Dinan",
    "title": "Arizona AG rules border surge is an ‘invasion,’ state can defend itself"
  },
  {
    "id": 5746,
    "mediaId": 2919,
    "date": "2022-02-07",
    "sentence": "The four lawsuits filed in late January build upon claims made in a 2020 lawsuit filed by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Joseph Peters",
    "title": "State AGs sue Google over use and collection of location data"
  },
  {
    "id": 6225,
    "mediaId": 5247,
    "date": "2022-02-07",
    "sentence": "",
    "author": "The Associated Press",
    "title": "Ex-Air Force sergeant to change plea in officer killing"
  },
  {
    "id": 5728,
    "mediaId": 5247,
    "date": "2022-02-08",
    "sentence": "The opinion from Attorney General <span class='selected-term'>Mark Brnovich</span> came in response to a request from a GOP state lawmaker.",
    "author": "Bob Christie",
    "title": "Political football? Arizona AG says governor can send armed troops to border."
  },
  {
    "id": 6144,
    "mediaId": 5247,
    "date": "2022-02-08",
    "sentence": "",
    "author": "Davis Winkie",
    "title": "Army expands two-year enlistment options as new screenings kick in"
  },
  {
    "id": 6194,
    "mediaId": 5247,
    "date": "2022-02-08",
    "sentence": "",
    "author": "Davis Winkie",
    "title": "Cadet Command ‘looking into’ lieutenant colonel’s tweet at SMA Grinston"
  },
  {
    "id": 6087,
    "mediaId": 5247,
    "date": "2022-02-08",
    "sentence": "",
    "author": "Davis Winkie",
    "title": "Fort Jackson logistics officer charged with desertion"
  },
  {
    "id": 6214,
    "mediaId": 3986,
    "date": "2022-02-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> announced on Monday that his office issued a legal opinion declaring the illegal immigration crisis on the US-Mexico border qualifies as an “invasion” under the U.S. Constitution, which he says gives his state “the power to defend itself.”\nBrnovich wrote in his opinion that the “violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an ‘invasion.’”\n“An actual invasion permits the State to engage in defensive actions within its own territory at or near its border,” the opinion stated.",
    "author": "Liz George",
    "title": "AZ attorney general declares southern border crisis ‘invasion’ under US Constitution"
  },
  {
    "id": 5810,
    "mediaId": 2557,
    "date": "2022-02-08",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Fox News:\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> on Monday issued a legal opinion that determines that the ongoing crisis at the southern border is an “invasion” under the Constitution – a move he says gives the state the power to take additional measures to defend itself.",
    "author": "DML News App",
    "title": "REPORT: GOP state attorney general issues legal opinion declaring border crisis ‘invasion’ under Constitution"
  },
  {
    "id": 5608,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has officially ruled that the chaos on the Mexican border constitutes an “invasion” under the U.S. Constitution, clearing the way for the state’s governor to defend the boundary with police or troops of his own.",
    "author": "Stephen Dinan",
    "title": "Arizona AG rules states can deploy forces to fight border ‘invasion’"
  },
  {
    "id": 5639,
    "mediaId": 2564,
    "date": "2022-02-08",
    "sentence": "+5\nView gallery\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> released a legal opinion Monday calling the southern border crisis an 'invasion,' and claiming the U.S. Constitution gives states the power to defend and take action against such invasions\n STATE OF ARIZONA OFFICE OF THE ATTORNEY GENERAL\n ATTORNEY GENERAL OPINION By MARK BRNOVICH ATTORNEY GENERAL February 7, 2022 No.",
    "author": "Katelyn Caralle",
    "title": "Arizona's Republican Attorney General calls Biden's border crisis an 'INVASION': Mark Brnovich states in legal opinion the state can defend itself from the influx of migrants under the US Constitution"
  },
  {
    "id": 6149,
    "mediaId": 2600,
    "date": "2022-02-08",
    "sentence": "Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> issued an opinion Monday calling the crisis at the border an “invasion,” claiming that by declaring it as such the state is allowed to take more action to defend itself against the “invasion.”\n“The federal government’s failure to secure the border and protect Arizona from invasion is dangerous and unprecedented,” Brnovich said in a statement.",
    "author": "IWB",
    "title": "Attorney General Threatens To Defy Biden"
  },
  {
    "id": 5735,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "PHOENIX — Arizona Secretary of State Katie Hobbs is suing Attorney General <span class='selected-term'>Mark Brnovich</span> after he threatened to prosecute her if she temporarily shuts down for a required update to an online system that allows election candidates to collect the signatures they need to qualify for the ballot.",
    "author": "Bob Christie",
    "title": "Arizona elections chief sues AG over prosecution threat"
  },
  {
    "id": 5819,
    "mediaId": 2644,
    "date": "2022-02-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> claims in a new legal opinion that Republican Gov.",
    "author": "Steven Nelson",
    "title": "Arizona AG says state can cite ‘invasion’ to deport migrants without feds"
  },
  {
    "id": 6240,
    "mediaId": 3987,
    "date": "2022-02-09",
    "sentence": "In Arizona, <span class='selected-term'>Mark Brnovich</span>, the state Attorney General and a candidate for the GOP primary for U.S. Senate, called immigration into the state an “invasion” in a legal opinion he issued this week justifying Arizona’s ability to send troops to the border.",
    "author": "AV Press Releases",
    "title": "Florida Republican’s Immigration Bill Crashes Into an Extreme Anti-Immigrant GOP"
  },
  {
    "id": 5897,
    "mediaId": 2548,
    "date": "2022-02-09",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> took a major step in his investigation of the company on Monday, also requesting GoFundMe preserve relevant documents.",
    "author": "Ailan Evans",
    "title": "Texas AG Ken Paxton Launches Investigation Into GoFundMe Over Removal Of Freedom Convoy Fundraiser"
  },
  {
    "id": 5873,
    "mediaId": 2753,
    "date": "2022-02-09",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> took a major step in his investigation of the company on Monday, also requesting GoFundMe preserve relevant documents.",
    "author": "WND News Services",
    "title": "Texas launches investigation into GoFundMe for yanking Freedom Convoy fundraiser"
  },
  {
    "id": 6216,
    "mediaId": 5296,
    "date": "2022-02-09",
    "sentence": "That path takes the form of a recent legal opinion issued by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Joseph DeMaio",
    "title": "Stopping the Invasion"
  },
  {
    "id": 6178,
    "mediaId": 2600,
    "date": "2022-02-09",
    "sentence": "The attorneys general of Arizona, Idaho, Indiana, Nebraska, and South Carolina, led by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, mounted a federal lawsuit (pdf) arguing that President Joe Biden lacked statutory authority when he signed an executive order on April 27, 2021, to mandate the minimum wage.",
    "author": "IWB",
    "title": "States Sue Biden Over Min Wage Increase"
  },
  {
    "id": 6143,
    "mediaId": 5247,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Rachel S. Cohen",
    "title": "Air Force approves first religious exemptions to COVID-19 vaccine for 9 troops"
  },
  {
    "id": 5997,
    "mediaId": 4024,
    "date": "2022-02-10",
    "sentence": "But, Racine noted, “The time of trickery for profits is over.”\nIn a similar lawsuit filed in 2020, Arizona attorney general <span class='selected-term'>Mark Brnovich</span> also alleged that Google used deceptive practices to track its users’ locations.",
    "author": "",
    "title": "US states are fighting back against Google’s secret location tracking"
  },
  {
    "id": 6017,
    "mediaId": 2550,
    "date": "2022-02-11",
    "sentence": "“In Arizona, <span class='selected-term'>Mark Brnovich</span>, the state Attorney General and a candidate for the GOP primary for U.S. Senate, called immigration into the state an ‘invasion’ in a legal opinion he issued this week justifying Arizona’s ability to send troops to the border,” America’s Voice continued.",
    "author": "",
    "title": "House Republican touts 'Dignity Act' bill claiming to make path to legalization, but don't be fooled"
  },
  {
    "id": 4860,
    "mediaId": 2664,
    "date": "2022-02-14",
    "sentence": "Hobbs referred the misuse to Attorney General <span class='selected-term'>Mark Brnovich</span> 14 months ago, but \"nothing has happened\" and Hobbs' office claims to have never received a response to its referral.",
    "author": "Bob Brigham",
    "title": "Trump's fake electors illegally used state seal — but GOP attorney general has done nothing: report"
  },
  {
    "id": 4682,
    "mediaId": 3987,
    "date": "2022-02-15",
    "sentence": "In Arizona, GOP Senate primary candidate <span class='selected-term'>Mark Brnovich</span>, the current state Attorney General, called immigration into the state an “invasion” in a recent “legal opinion” he issued justifying Arizona’s ability not only to send troops to the border but also justifying potential violent force against migrants.",
    "author": "AV Press Releases",
    "title": "Republicans Behaving Badly: The GOP in Arizona, Florida and Texas Embrace Fear, Radicalism and Xenophobia"
  },
  {
    "id": 5281,
    "mediaId": 6511,
    "date": "2022-02-16",
    "sentence": "El año pasado el fiscal de Arizona, <span class='selected-term'>Mark Brnovich</span>, dijo que el estado reanudaría las ejecuciones de las personas en el corredor de la muerte que hayan agotado sus apelaciones, por lo que los demandantes quieren que los tribunales eliminen el uso del gas “de una vez por todas”.",
    "author": "",
    "title": "ACLU demanda a Arizona para impedir ejecuciones con gas usado por nazis"
  },
  {
    "id": 5340,
    "mediaId": 2771,
    "date": "2022-02-17",
    "sentence": "Regardless of where people stand on the matter of capital punishment, it’s clear that use of this barbaric practice is cruel and must be abolished.”\nThe next step for the lawsuit is a hearing on March 7, where the defendants in the case — including the state of Arizona; the Arizona Department of Corrections, Rehabilitation and Reentry; Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> and others — will have a first chance to make the case for letting execution by gas continue in the state.",
    "author": "Nicole Raz",
    "title": "Fast ForwardArizona Jews sue to stop the state from using Zyklon B, which the Nazis used to gas Jews, in executions"
  },
  {
    "id": 4882,
    "mediaId": 2540,
    "date": "2022-02-17",
    "sentence": "The nominal frontrunner is probably state Attorney General <span class='selected-term'>Mark Brnovich</span> but no one – in Arizona or Washington – sees him as a top tier challenger to Kelly.",
    "author": "Chris Cillizza",
    "title": "Donald Trump may be single-handedly costing Republicans a Senate seat"
  },
  {
    "id": 5331,
    "mediaId": 4018,
    "date": "2022-02-17",
    "sentence": "Regardless of where people stand on the matter of capital punishment, it’s clear that use of this barbaric practice is cruel and must be abolished.”\nThe next step for the lawsuit is a hearing on March 7, where the defendants in the case — including the state of Arizona; the Arizona Department of Corrections, Rehabilitation and Reentry; Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> and others — will have a first chance to make the case for letting execution by gas continue in the state.",
    "author": "Nicole Raz",
    "title": "Arizona Jews sue to stop the state from executing people with Zyklon B, which the Nazis used to gas Jews"
  },
  {
    "id": 4782,
    "mediaId": 2727,
    "date": "2022-02-17",
    "sentence": "Regardless of where people stand on the matter of capital punishment, it’s clear that use of this barbaric practice is cruel and must be abolished.”\nThe next step for the lawsuit is a hearing on March 7, where the defendants in the case — including the state of Arizona; the Arizona Department of Corrections, Rehabilitation and Reentry; Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> and others — will have a first chance to make the case for letting execution by gas continue in the state.",
    "author": "",
    "title": "Arizona Jews sue to stop the state from using Zyklon B in executions"
  },
  {
    "id": 5298,
    "mediaId": 2602,
    "date": "2022-02-17",
    "sentence": "Regardless of where people stand on the matter of capital punishment, it’s clear that use of this barbaric practice is cruel and must be abolished.”\nThe next step for the lawsuit is a hearing on March 7, where the defendants in the case — including the state of Arizona; the Arizona Department of Corrections, Rehabilitation and Reentry; Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> and others — will have a first chance to make the case for letting execution by gas continue in the state.",
    "author": "NICOLE RAZ/JTA",
    "title": "Arizona Jews sue to stop the state from executing people with Zyklon B"
  },
  {
    "id": 4539,
    "mediaId": 2572,
    "date": "2022-02-18",
    "sentence": "FIRST ON FOX: Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is citing the failure by the Biden administration to release the Immigration and Customs Enforcement (ICE) annual report as the latest example of the lack of transparency that the Department of Homeland Security has exhibited when it comes to the effects of its liberal immigration policies.",
    "author": "Adam Shaw",
    "title": "Arizona AG says Biden admin's failure to release ICE annual report latest example of DHS' lack of transparency"
  },
  {
    "id": 4902,
    "mediaId": 6676,
    "date": "2022-02-19",
    "sentence": "Tucson.com reached out to Attorney Gen. <span class='selected-term'>Mark Brnovich</span> but did not immediately hear back.",
    "author": "Russell Falcon",
    "title": "Arizona Jewish council sues to end gas chamber executions"
  },
  {
    "id": 5112,
    "mediaId": 2746,
    "date": "2022-02-21",
    "sentence": "“While America is indeed the land of opportunity, it’s not the land of the welfare state,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told The Washington Times.",
    "author": "Stephen Dinan",
    "title": "DHS eyes more welfare for legal immigrants as Supreme Court hears challenge"
  },
  {
    "id": 4540,
    "mediaId": 2572,
    "date": "2022-02-21",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> asked the state's Supreme Court last month to set briefing schedules so that his office can file execution warrants for Frank Atwood and Clarence Dixon.",
    "author": "Paul Best",
    "title": "Arizona Jewish community leaders sue state over potential use of cyanide gas in executions"
  },
  {
    "id": 4676,
    "mediaId": 2641,
    "date": "2022-02-22",
    "sentence": "The letter was co-signed by attorneys general from Alabama (Steve Marshall), Arizona (<span class='selected-term'>Mark Brnovich</span>), Arkansas (Leslie Rutledge), Georgia (Christopher Carr), Indiana (Todd Rokita), Louisiana (Jeff Landry), Montana (Austin Knudsen), Missouri (Eric Schmidt), Oklahoma (John O’Connor), South Carolina (Alan Wilson), Texas (Ken Paxton), Utah (Sean Reyes) and West Virginia (Patrick Morrisey).",
    "author": "Charlie McCarthy",
    "title": "Republican AGs Call for Mayorkas to Resign for Failing to Secure Border"
  },
  {
    "id": 5285,
    "mediaId": 6511,
    "date": "2022-02-22",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5052,
    "mediaId": 2728,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "Jessica Gresko",
    "title": "High court wades into clash over Trump-era immigration rule"
  },
  {
    "id": 5260,
    "mediaId": 6511,
    "date": "2022-02-23",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5323,
    "mediaId": 3987,
    "date": "2022-02-23",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5423,
    "mediaId": 3987,
    "date": "2022-02-23",
    "sentence": "Or even the Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, looking for a seat in the U.S. Senate, who has pressured Doug Ducey, his state’s Governor, to respond, with military force, to what he erroneously calls an “invasion” of immigrants at the southern border.",
    "author": "AV Press Releases",
    "title": "Trump and the Republicans rev up their machinery of lies"
  },
  {
    "id": 4927,
    "mediaId": 2594,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "Via AP news wire",
    "title": "High court wades into clash between Biden, Republican states"
  },
  {
    "id": 5178,
    "mediaId": 2560,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "Jessica Gresko",
    "title": "High court wades into clash over Trump-era immigration rule"
  },
  {
    "id": 4757,
    "mediaId": 2632,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "Jessica Gresko",
    "title": "Supreme Court Wades Into Clash Between States Over Trump-Era Immigration Rule"
  },
  {
    "id": 5087,
    "mediaId": 2679,
    "date": "2022-02-23",
    "sentence": "Justice Elena Kagan suggested to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, arguing for the group of states, that allowing the group to intervene in a case “that’s completely dead that never applied to you in the first place” is not the answer.",
    "author": "JESSICA GRESKO",
    "title": "High court wades into clash over Trump-era immigration rule"
  },
  {
    "id": 5057,
    "mediaId": 2636,
    "date": "2022-02-23",
    "sentence": "",
    "author": "",
    "title": "Supreme Court Weighs Whether States May Defend a Trump Immigration Policy"
  },
  {
    "id": 5050,
    "mediaId": 2745,
    "date": "2022-02-23",
    "sentence": "That left states that favored the public charge rule without recourse, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> (R) told the justices Wednesday.",
    "author": "",
    "title": "Supreme Court considers whether Biden administration properly ditched Trump immigration rule"
  },
  {
    "id": 5237,
    "mediaId": 2740,
    "date": "2022-02-23",
    "sentence": "\"Whoever the federal government is, there's always going to be a state that thinks it's done the wrong thing,\" Kagan told Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "John Fritze",
    "title": "Supreme Court weighs whether states may continue fight over Trump-era 'public charge' rule"
  },
  {
    "id": 4747,
    "mediaId": 2746,
    "date": "2022-02-23",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told the justices that even tacit approval of what the Biden administration did would set a precedent future presidents would abuse, using the courts to get rid of previous administration policies without going through the usual regulatory process.",
    "author": "Stephen Dinan",
    "title": "Supreme Court struggles for a solution to Biden’s handling of immigration ‘Public Charge’ rules"
  },
  {
    "id": 4923,
    "mediaId": 2641,
    "date": "2022-02-23",
    "sentence": "The justices heard oral arguments in an appeal by 13 Republican state attorneys general led by Arizona AG <span class='selected-term'>Mark Brnovich</span> of a lower court's ruling that rejected their bid to defend Trump's rule, which expanded the scope of those considered likely to become a \"public charge.\"",
    "author": "",
    "title": "Supreme Court Mulls GOP Bid to Defend Trump Immigration Rule"
  },
  {
    "id": 5357,
    "mediaId": 2779,
    "date": "2022-02-23",
    "sentence": "",
    "author": "Ryan Devereaux",
    "title": "Arizona Attorney General Manufactured an “Invasion” at the Southern Border"
  },
  {
    "id": 5391,
    "mediaId": 2637,
    "date": "2022-02-23",
    "sentence": "The justices heard oral arguments in an appeal by 13 Republican state attorneys general led by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> of a lower court’s ruling that rejected their bid to defend Trump’s rule, which expanded the scope of those considered likely to become a “public charge.”\nArticle content\nPresident Joe Biden’s administration dropped the government’s defense of the policy, prompting the action by the states.",
    "author": "Andrew Chung",
    "title": "U.S. Supreme Court mulls Republican bid to defend Trump immigration rule"
  },
  {
    "id": 5085,
    "mediaId": 2592,
    "date": "2022-02-23",
    "sentence": "The justices heard oral arguments in an appeal by 13 Republican state attorneys general led by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> of a lower court's ruling that rejected their bid to defend Trump's rule, which expanded the scope of those considered likely to become a \"public charge.\"",
    "author": "Andrew Chung",
    "title": "U.S. Supreme Court Mulls Republican Bid To Defend Trump Immigration Rule"
  },
  {
    "id": 5333,
    "mediaId": 2608,
    "date": "2022-02-23",
    "sentence": "pic.twitter.com/zFXxj3n1Sa\n— <span class='selected-term'>Mark Brnovich</span> (@GeneralBrnovich) February 23, 2022\nAttorneys for the other parties did not immediately respond to Law&Crime’s request for comment.",
    "author": "Elura Nanos",
    "title": "Justices Say Biden Administration May Have Evaded Federal Law in Quietly Removing Trump-Era Immigration Rule"
  },
  {
    "id": 5174,
    "mediaId": 6449,
    "date": "2022-02-24",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> argued Wednesday before the nine justices in favor of former President Donald Trump’s “public charge” rule.",
    "author": "Douglas Blair",
    "title": "Arizona AG Mark Brnovich Fights for Trump’s Immigration Rule at Supreme Court"
  },
  {
    "id": 4983,
    "mediaId": 2855,
    "date": "2022-02-24",
    "sentence": "Arizona’s Attorney General, <span class='selected-term'>Mark Brnovich</span>, was peppered with various accusations that he should have intervened in a different circuit, should have intervened earlier, or should have filed an APA claim instead of an intervention motion.",
    "author": "Jason Richwine",
    "title": "Defenders of the Public Charge Rule Have Their Day at the Supreme Court"
  },
  {
    "id": 4028,
    "mediaId": 2526,
    "date": "2022-02-24",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> argued that Biden’s strategy is “an unprecedented legal maneuver.” Because Biden dismissed the remaining legal challenges to the public charge rule, Arizona argues that states that supported the rule were left with no recourse.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Supreme Court Hears Arguments Over ‘Public Charge’ Rule"
  },
  {
    "id": 4298,
    "mediaId": 2601,
    "date": "2022-02-24",
    "sentence": "",
    "author": "MJA",
    "title": "Feds Cannot Bypass States and Courts"
  },
  {
    "id": 4941,
    "mediaId": 2641,
    "date": "2022-02-24",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> accused the Biden administration on Thursday of intentionally undermining the law by withdrawing a Trump-era policy that bars immigrants from permanent residency if they are likely to need public assistance.",
    "author": "Brian Trusdell",
    "title": "Arizona AG Brnovich to Newsmax: Biden Admin Intentionally Undermining Law"
  },
  {
    "id": 4280,
    "mediaId": 4091,
    "date": "2022-02-25",
    "sentence": "He also said that the results were being provided to the Arizona Senate as well as GOP Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "JD Heyes",
    "title": "Bombshell study finds more than 200,000 ballots from 2020 election with “mismatched signatures” indicating widespread fraud"
  },
  {
    "id": 3648,
    "mediaId": 2572,
    "date": "2022-02-26",
    "sentence": "More than a dozen Republican attorneys general, led by Arizona’s <span class='selected-term'>Mark Brnovich</span>, have sought to defend the 2019 public charge rule, which broadened the definition of \"public charge\" to include an immigrant who receives one or more designated public benefits for more than 12 months within a 36-month period -- and included a substantial number of benefits.",
    "author": "Adam Shaw",
    "title": "SCOTUS hears GOP push to defend Trump-era public charge rule; Arizona AG calls Biden moves ‘unprecedented’"
  },
  {
    "id": 4304,
    "mediaId": 2595,
    "date": "2022-02-28",
    "sentence": "“More than a dozen Republican attorneys general, led by Arizona’s <span class='selected-term'>Mark Brnovich</span>, have sought to defend the 2019 public charge rule, which broadened the definition of ‘public charge’ to include an immigrant who receives one or more designated public benefits for more than 12 months within a 36-month period — and included a substantial number of benefits,” Fox News reported on Saturday.",
    "author": "M Dowling",
    "title": "Admin Schemes After SCOTUS Hears the ‘Welfare for Illegal Aliens’ Case"
  },
  {
    "id": 4229,
    "mediaId": 2548,
    "date": "2022-02-28",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told the DCNF that the issue comes down to “supply and demand.” (RELATED: State AG Asks Mayorkas To Stop Letting Illegal Migrants Travel Through US Airports With Arrest Warrants)\n“There is more fentanyl and other deadly drugs pouring across our open southern border, making them cheaper for people to buy,” Brnovich said.",
    "author": "",
    "title": "Fentanyl Street Price Plummets While Country Faces High Prices Under The Biden Administration"
  },
  {
    "id": 3903,
    "mediaId": 2662,
    "date": "2022-02-28",
    "sentence": "All evidence was delivered to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, and Arizona awaits indictments and decertification.",
    "author": "Jordan Conradson",
    "title": "BREAKING: Arizona GOP Sues Secretary of State Katie Hobbs To Ban Unconstitutional Drop Boxes, And No-Excuse Mail-In Voting In Arizona"
  },
  {
    "id": 4004,
    "mediaId": 2699,
    "date": "2022-02-28",
    "sentence": "“Stephen Hatch is a con man who will spend the next five years behind bars for tricking Arizona families into investing in his Ponzi scheme,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in June 2017.",
    "author": "Anna Venarchik",
    "title": "How a Real-Estate Agent Allegedly Bilked Christians Out of $82 Million in Massive Ponzi Scheme"
  },
  {
    "id": 4118,
    "mediaId": 2522,
    "date": "2022-03-01",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told the DCNF that the issue comes down to “supply and demand.”\n“There is more fentanyl and other deadly drugs pouring across our open southern border, making them cheaper for people to buy,” Brnovich said.",
    "author": "BPR Wire",
    "title": "Fentanyl street price plummets while country faces high prices, inflation under Biden administration"
  },
  {
    "id": 4411,
    "mediaId": 2540,
    "date": "2022-03-03",
    "sentence": "At the moment, state Attorney General <span class='selected-term'>Mark Brnovich</span> is probably the front-runner, but Trump has attacked Brnovich – he called the AG “lackluster” – for not being supportive enough of the sham election audit conducted in Maricopa County.",
    "author": "Chris Cillizza",
    "title": "Donald Trump cuts off his nose to spite his face in Arizona"
  },
  {
    "id": 4054,
    "mediaId": 2644,
    "date": "2022-03-03",
    "sentence": "Ducey’s decision not to join a crowded Republican primary field leaves state Attorney General <span class='selected-term'>Mark Brnovich</span> as the favorite to face incumbent Democrat Mark Kelly in the November election.",
    "author": "Callie Patteson",
    "title": "Arizona GOP Gov. Ducey won’t run for Senate despite McConnell recruiting pitch"
  },
  {
    "id": 3976,
    "mediaId": 2636,
    "date": "2022-03-03",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> has led a handful of lesser-known Republicans in some polls ahead of the August primary, but the race has been frozen as G.O.P.",
    "author": "",
    "title": "Ducey Confirms He Will Not Run for Senate, Despite McConnell’s Wooing"
  },
  {
    "id": 3937,
    "mediaId": 2679,
    "date": "2022-03-07",
    "sentence": "Arizona’s Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "BRIAN SLODYSKO",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 4135,
    "mediaId": 2707,
    "date": "2022-03-07",
    "sentence": "Arizona’s Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "Associated Press",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 4189,
    "mediaId": 2569,
    "date": "2022-03-07",
    "sentence": "Arizona’s Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "Associated Press",
    "title": "Republican ‘unforced errors’ threaten path to U.S. Senate control"
  },
  {
    "id": 3354,
    "mediaId": 2523,
    "date": "2022-03-07",
    "sentence": "Arizona’s Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "Associated Press",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 4405,
    "mediaId": 2728,
    "date": "2022-03-07",
    "sentence": "Arizona’s Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "Steve Peoples And Brian Slodysko",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 4311,
    "mediaId": 4032,
    "date": "2022-03-07",
    "sentence": "As bad as all that is, according to government documents divulged last year by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, Biden and Mayorkas plan not to deport more than 8,000 hardened illegal-alien criminals, including these:\n• 19 convicted of homicide\n• 27 convicted of sexual offenses\n• 9 convicted of sexual assault\n• 375 convicted of assault\n• 17 convicted of burglary\n• 9 convicted of commercialized sexual offenses\n• 4 convicted of kidnapping\n• 7 convicted of obscenity\n• 13 convicted of robbery\n• 19 convicted of stealing a vehicle\n• 91 convicted of larceny\nThough outright murderers, rapists, terrorists, and gang members might get the boot (if ICE can find them), criminals in the following categories wouldn’t.",
    "author": "",
    "title": "Border Breakdown: Treason, Not Incompetence"
  },
  {
    "id": 3900,
    "mediaId": 2732,
    "date": "2022-03-07",
    "sentence": "Arizona’s Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "Associated Press",
    "title": "Republican 'unforced errors' threaten path to Senate control"
  },
  {
    "id": 3259,
    "mediaId": 2514,
    "date": "2022-03-07",
    "sentence": "Arizona's Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "",
    "title": "Republican 'unforced errors' threaten path to Senate control"
  },
  {
    "id": 4256,
    "mediaId": 2747,
    "date": "2022-03-07",
    "sentence": "Arizona's Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "",
    "title": "Republican 'unforced errors' threaten path to Senate control"
  },
  {
    "id": 2866,
    "mediaId": 2607,
    "date": "2022-03-08",
    "sentence": "Arizona's Republican state Attorney General <span class='selected-term'>Mark Brnovich</span>, the best-known Republican in a crowded primary field, reported less than $800,000 in the bank.",
    "author": "Steve Peoples",
    "title": "Republican ‘unforced errors’ threaten path to Senate control"
  },
  {
    "id": 3412,
    "mediaId": 2636,
    "date": "2022-03-08",
    "sentence": "",
    "author": "Stacy Cowley",
    "title": "Homeland Security Dept. gathered millions of money transfer records, senator says."
  },
  {
    "id": 3016,
    "mediaId": 2644,
    "date": "2022-03-11",
    "sentence": "In response Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has launched an antitrust investigation of collusion against the energy sector.",
    "author": "Glenn H. Reynolds",
    "title": "Don’t pretend that high prices and American suffering are a ‘bug’ for the establishment — it’s a historic feature"
  },
  {
    "id": 3146,
    "mediaId": 2664,
    "date": "2022-03-11",
    "sentence": "Republican <span class='selected-term'>Mark Brnovich</span> took steps to investigate a phony slate of Arizona presidential electors supporting Donald Trump, according to newly released government documents.",
    "author": "Bob Brigham",
    "title": "GOP attorney general investigated Trump’s phony electors — but no charges have been filed: report"
  },
  {
    "id": 3173,
    "mediaId": 2707,
    "date": "2022-03-12",
    "sentence": "Now Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is investigating what he says is a coordinated effort by climate activists to work with banks and money managers to force companies to shut down coal and natural-gas plants.",
    "author": "Susan Shelley",
    "title": "The free world needs to grow up about energy policy"
  },
  {
    "id": 3522,
    "mediaId": 2523,
    "date": "2022-03-12",
    "sentence": "Now Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is investigating what he says is a coordinated effort by climate activists to work with banks and money managers to force companies to shut down coal and natural-gas plants.",
    "author": "Susan Shelley",
    "title": "The free world needs to grow up about energy policy"
  },
  {
    "id": 3227,
    "mediaId": 2597,
    "date": "2022-03-13",
    "sentence": "",
    "author": "",
    "title": "WATCH LIVE: THE MOST CENSORED NEWS BROADCAST IN THE WORLD"
  },
  {
    "id": 3501,
    "mediaId": 2752,
    "date": "2022-03-14",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span> is currently the frontrunner for the GOP Senate nomination, and he's considered the party’s best chance to reclaim John McCain’s former Senate seat.",
    "author": "Stephen Robinson",
    "title": "?Maybe ?Trump’s Big Lie Will Help Mark Kelly Keep His Senate Seat After All"
  },
  {
    "id": 2056,
    "mediaId": 2578,
    "date": "2022-03-19",
    "sentence": "If you’re unable to access the E-Qual system, you can file an election complaint with our office: https://t.co/e9rFhbhKPf\n— <span class='selected-term'>Mark Brnovich</span> (@GeneralBrnovich) March 18, 2022\nTalonya Adams, a former Democratic staffer in the Arizona Senate, tweeted noting the clear conflict of interest for Hobbs’ failing gubernatorial campaign.",
    "author": "Jordan Conradson",
    "title": "Soros-Backed Secretary of State Katie Hobbs Violates Arizona State Election Law by Shutting Down Election Petition System for Certain Candidates"
  },
  {
    "id": 2339,
    "mediaId": 2548,
    "date": "2022-03-22",
    "sentence": "The ruling comes in response to a joint lawsuit filed by Republican attorneys general from multiple states, including Arizona’s <span class='selected-term'>Mark Brnovich</span>, Ohio’s Dave Yost and Montana’s Austin Knudsen, against the Biden administration over its rollbacks on some deportations of noncitizens.",
    "author": "",
    "title": "‘The Answer Is No’: Federal Judge Blocks Biden Administration’s Attempt To Halt Certain ICE Deportations"
  },
  {
    "id": 2078,
    "mediaId": 2662,
    "date": "2022-03-22",
    "sentence": "President Trump released another statement yesterday blasting the Arizona Attorney General, <span class='selected-term'>Mark Brnovich</span>, on his failure to prosecute the Maricopa County Supervisors for the rigged 2020 election and their ongoing failure to comply with his criminal investigation.",
    "author": "Jordan Conradson",
    "title": "President Trump Tells Arizona Attorney General Mark Brnovich To Issue Warrants In 2020 Election Fraud Case: “The Supervisors Just Won’t Release The Information—It Must Really Be Bad!”"
  },
  {
    "id": 2009,
    "mediaId": 2557,
    "date": "2022-03-22",
    "sentence": "Here, the answer is no.”\nPromoted Content\nIn November 2020, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, Montana Attorney General Austin Knudsen, and Ohio Attorney General Dave Yost filed a lawsuit against the Biden administration in over the policy revision, which they said “dramatically ties the hands of immigration officers, halting nearly all deportations.”\nBrnovich celebrated the ruling, writing on Twitter, “VICTORY: A federal judge just blocked the lawless Biden Administration policy that halted nearly all deportations after our office challenged this guidance.",
    "author": "DML News App",
    "title": "BREAKING: Judge deals huge blow to Biden effort to limit ICE enforcement"
  },
  {
    "id": 2586,
    "mediaId": 2695,
    "date": "2022-03-22",
    "sentence": "She asserts the county has not sufficiently cooperated with requests for records from Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Chris Pandolfo",
    "title": "Arizona Republicans advance election bill to end mail-in voting — but it's likely dead on arrival"
  },
  {
    "id": 2024,
    "mediaId": 3997,
    "date": "2022-03-22",
    "sentence": "",
    "author": "",
    "title": "Back to CR"
  },
  {
    "id": 2114,
    "mediaId": 3997,
    "date": "2022-03-23",
    "sentence": "",
    "author": "",
    "title": "Back to CR"
  },
  {
    "id": 2421,
    "mediaId": 2695,
    "date": "2022-03-23",
    "sentence": "In a statement on Twitter, Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> celebrated the ruling.",
    "author": "Phil Shiver",
    "title": "Federal judge upends Biden rules that hamstrung ICE agents, led to historically low deportation numbers"
  },
  {
    "id": 1994,
    "mediaId": 2662,
    "date": "2022-03-23",
    "sentence": "Contact Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> to demand arrests.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Leaked Emails From Maricopa County Recorder Stephen Richer Reveal Voter Fraud Concerns Before 2020 Election"
  },
  {
    "id": 2355,
    "mediaId": 2912,
    "date": "2022-03-23",
    "sentence": "“The Board of Supervisors remains committed to free and fair elections that conform to federal and state laws.”\nDespite those findings, Republican Attorney General <span class='selected-term'>Mark Brnovich</span> is still reviewing questions the Senate’s “audit” raised about possible problems.",
    "author": "",
    "title": "Final Arizona election report finds no county data issues"
  },
  {
    "id": 1921,
    "mediaId": 2748,
    "date": "2022-03-24",
    "sentence": "In a statement on Twitter, Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> celebrated the ruling.",
    "author": "STATION GOSSIP",
    "title": "Federal judge upends Biden rules that hamstrung ICE agents, led to historically low deportation numbers"
  },
  {
    "id": 2341,
    "mediaId": 6551,
    "date": "2022-03-24",
    "sentence": "Justice and our country’s well-being require it.”\nArizona AG <span class='selected-term'>Mark Brnovich</span> argued that the decision was a “tremendous victory” in a statement made to the Daily Caller News Foundation, adding;\nSince assuming office, the Biden administration has undermined our immigration laws and our law enforcement agencies, while empowering dangerous cartels and criminals on both sides of the border.",
    "author": "",
    "title": "Judge Blocks Biden's Attempt to Halt Certain ICE Deportations"
  },
  {
    "id": 2400,
    "mediaId": 2721,
    "date": "2022-03-25",
    "sentence": "“This is a tremendous victory for the rule of law and the safety of our communities,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in a press release Tuesday.",
    "author": "",
    "title": "Kamala Harris out as border czar?! This lawsuit says…"
  },
  {
    "id": 2713,
    "mediaId": 2742,
    "date": "2022-03-26",
    "sentence": "Last year in May, documents turned up by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> in his lawsuit against the Biden Regime showed that the regime had no plans to deport more than 8,000 dangerous criminals, including these [Biden’s DHS Plan No Deportations For Illegal-Alien Murderers, Sex Offenders, by John Binder, Breitbart, May 5, 2021].",
    "author": "",
    "title": "Is Keeping Illegal-Alien Thugs In The Country Part Of A Plan To Terrorize The Historic American Nation Into Accepting Their Dispossession?"
  },
  {
    "id": 2503,
    "mediaId": 2748,
    "date": "2022-03-28",
    "sentence": "Last week, President Trump released a statement saying, “now is finally the time for the Arizona Attorney General to issue warrants and take his investigation to the next level.”\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> has done nothing to hold these criminals accountable.",
    "author": "Women System",
    "title": "Maricopa County Supervisors Refuse To Attend Meeting After Arizona State Senate Issues New 2020 Election Subpoena"
  },
  {
    "id": 2012,
    "mediaId": 2834,
    "date": "2022-03-28",
    "sentence": "Arizona attorney general <span class='selected-term'>Mark Brnovich</span> has launched an antitrust investigation into this collusion.",
    "author": "Michael G. Zey",
    "title": "What Happens When a GOP Majority Can Investigate the Jan. 6 Committee?"
  },
  {
    "id": 2184,
    "mediaId": 2746,
    "date": "2022-03-29",
    "sentence": "One person in Arizona had the authority to address the reported fraud and irregularities of the 2020 election before, during, and after they occurred, Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Rodney Glassman",
    "title": "Mark Brnovich do your job!"
  },
  {
    "id": 2091,
    "mediaId": 2662,
    "date": "2022-03-30",
    "sentence": "In a letter sent Tuesday, Attorney General <span class='selected-term'>Mark Brnovich</span> delegated his powers to enforce criminal action against crooked Katie Hobbs for shutting down the online candidate petition portal and intentionally violating the law.",
    "author": "Jordan Conradson",
    "title": "JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State Katie Hobbs For Election Crimes"
  },
  {
    "id": 2306,
    "mediaId": 4418,
    "date": "2022-03-30",
    "sentence": "TRENDING: JUST IN: Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> Refers Criminal Action Against AZ Secretary of State Katie Hobbs For Election Crimes\n“The FEC, in a memo to the Coolidge Reagan Foundation, which filed its complaint over three years ago, said it fined Clinton’s treasurer $8,000 and the DNC’s treasurer $105,000.” the Washington Examiner reported.",
    "author": "Jake Lambert",
    "title": "Trump Releases Statement After FEC Fines Hillary Clinton, DNC For Lying About Funding of Fake Russia Dossier"
  },
  {
    "id": 2488,
    "mediaId": 2918,
    "date": "2022-03-30",
    "sentence": "But not Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a career politician who tries to have it both ways as he seeks the Republican nomination for the U.S. Senate seat from Arizona.",
    "author": "Steve Cortes",
    "title": "CORTES: Arizona AG Brnovich Almost Prosecuted Pro-Trump Electors."
  },
  {
    "id": 2638,
    "mediaId": 2601,
    "date": "2022-03-30",
    "sentence": "In a letter sent Tuesday, Attorney General <span class='selected-term'>Mark Brnovich</span> delegated his powers to enforce criminal action against crooked Katie Hobbs for shutting down the online candidate petition portal and intentionally violating the law.",
    "author": "MJA",
    "title": "Arizona AG Mark Brnovich Refers Criminal Action Against AZ Secretary of State For Election Crimes"
  },
  {
    "id": 2396,
    "mediaId": 4418,
    "date": "2022-03-31",
    "sentence": "FOX News reports:\nTRENDING: JUST IN: Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> Refers Criminal Action Against AZ Secretary of State Katie Hobbs For Election Crimes\nFlorida’s registered Republican voters outnumber Democrats by over 100K for first time\nA red wave is brewing in Florida as registered Republican voters now outnumber Democrats by over 100,000 for the first time in the state’s history, according to data obtained by Fox News Digital.",
    "author": "Jake Lambert",
    "title": "REPORT: Registered Republican Voters Now Outnumber Democrats In Florida By Over 100,000"
  },
  {
    "id": 1490,
    "mediaId": 4418,
    "date": "2022-03-31",
    "sentence": "TRENDING: JUST IN: Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> Refers Criminal Action Against AZ Secretary of State Katie Hobbs For Election Crimes\nTop left, Philip Anderson, right, Rosanne Boyland, bottom, Jake Lang\nJake, who is a former wrestler, was able to crawl away and save himself and then he saved Philip Anderson who he pulled to safety.",
    "author": "Jake Lambert",
    "title": "Jan. 6 Prisoner Jake Lang’s Birthday is April 7th – Please Send Jake a Birthday Card and Let Him Know He Is Not Forgotten"
  },
  {
    "id": 1604,
    "mediaId": 2614,
    "date": "2022-03-31",
    "sentence": "On March 29th, Arizona AG <span class='selected-term'>Mark Brnovich</span> contacted Cochise County prosecutor Brian McIntyre about pursuing potential “civil and criminal” actions against Hobbs for taking down the E-Qual system in mid-March, citing the early takedown as being in violation of state law.",
    "author": "Red Voice Media",
    "title": "Arizona AG Sends Criminal Referral Charges For Secretary Of State, She Concedes Within A Day"
  },
  {
    "id": 1755,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "Republican Attorney General <span class='selected-term'>Mark Brnovich</span>, a Donald Trump ally, has refused to charge anyone in the case.",
    "author": "Sarah K. Burris",
    "title": "Fake Trump electors are getting new attention from the Justice Department and a grand jury: report"
  },
  {
    "id": 1157,
    "mediaId": 2664,
    "date": "2022-04-01",
    "sentence": "Even some pro-Trump politicians are using environmental justifications for their agenda, like Arizona Attorney General and Senate candidate <span class='selected-term'>Mark Brnovich</span>, who has argued for the former president's border wall plan as a means of preventing migrants from leaving trash in the desert.",
    "author": "Matthew Chapman",
    "title": "Here's how the far right is trying to seize control of the environmentalist movement"
  },
  {
    "id": 966,
    "mediaId": 2512,
    "date": "2022-04-01",
    "sentence": "And it has legs, in my opinion.”\nShapiro, Ozug and Morell cite Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> as an example of a Republican who made a right-wing environmental argument.",
    "author": "Alex Henderson",
    "title": "How environmentalism and the far right are becoming an unlikely ‘ecofascist’ combination: report"
  },
  {
    "id": 1364,
    "mediaId": 2790,
    "date": "2022-04-01",
    "sentence": "Last July, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> filed a lawsuit against the federal government.",
    "author": "Casey Morell",
    "title": "The far-right and environmentalism overlap is bigger than you think — and growing"
  },
  {
    "id": 951,
    "mediaId": 2572,
    "date": "2022-04-01",
    "sentence": "FIRST ON FOX: Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is warning the Biden administration that the U.S. will face a \"tidal wave\" of migration if it goes through with its reported plan to lift Title 42 in the coming months -- tapping into broad bipartisan concerns that the move will spark a massive migrant surge.",
    "author": "Adam Shaw",
    "title": "Arizona AG warns of 'tidal wave' of migrants at southern border if Biden admin lifts Title 42"
  },
  {
    "id": 1507,
    "mediaId": 2522,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> bluntly stated on “Fox & Friends” Monday.",
    "author": "Terresa Monroe-Hamilton",
    "title": "GOP states sue Biden admin over plan to rescind Title 42 border policy, likely open migrant floodgates"
  },
  {
    "id": 1397,
    "mediaId": 2553,
    "date": "2022-04-04",
    "sentence": "Missouri Attorney General Eric Schmitt, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, and Louisiana Attorney General Jeff Landry are suing the Biden Administration for ending Title 42 during the worst border crisis in decades.",
    "author": "Dillon Burroughs",
    "title": "‘Pushing Back’: GOP States File Lawsuit Against Biden Administration’s End Of Title 42 Border Policy"
  },
  {
    "id": 1231,
    "mediaId": 6621,
    "date": "2022-04-04",
    "sentence": "Missouri Attorney General Eric Schmitt, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, and Louisiana Attorney General Jeff Landry are suing Joe Biden and his administration for lifting Title 42 border protections “amid one of the worst border crises in this country’s history,” Schmitt says.",
    "author": "",
    "title": "STEPPING UP: Three GOP States Suing Biden Over Admin's Ending of Title 42"
  },
  {
    "id": 1687,
    "mediaId": 2724,
    "date": "2022-04-04",
    "sentence": "Republican states sue to stop Biden admin’s lifting of Title 42 border policy https://t.co/r8v6MoexYp\n— Fox News (@FoxNews) April 4, 2022\nRepublican States Push Back\nAttorneys General <span class='selected-term'>Mark Brnovich</span> of Arizona, Jeff Landry of Louisiana, and Eric Schmitt of Missouri have filed the lawsuit.",
    "author": "Becky Noble",
    "title": "GOP States Sue As Biden Adm. Lifts Title 42 Order, Expected To Create Surge Of Illegal Immigrants At Border"
  },
  {
    "id": 1193,
    "mediaId": 2557,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told Fox News on Monday.",
    "author": "",
    "title": "NEWS ALERT: Three GOP states sue over end of Title 42"
  },
  {
    "id": 1162,
    "mediaId": 2526,
    "date": "2022-04-04",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, Louisiana Attorney General Jeff Landry, and Missouri Attorney General Eric Schmitt have filed a lawsuit against President Joe Biden’s administration for plans to end the Title 42 border control that has helped stem waves of illegal immigration since 2020.",
    "author": "John Binder",
    "title": "Arizona, Louisiana, Missouri Sue Biden for Ending Title 42 Border Control"
  },
  {
    "id": 1430,
    "mediaId": 2591,
    "date": "2022-04-04",
    "sentence": "The attorneys general argue that the end of the order will result in a number of higher costs for the states, including higher health care costs for illegal migrants infected with COVID-19 and “the presence of much greater numbers of paroled aliens with non-meritorious asylum claims …”\n“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said.",
    "author": "Human Events Staff",
    "title": "Republican States Sue Biden to Stop End to Title 42"
  },
  {
    "id": 1316,
    "mediaId": 6449,
    "date": "2022-04-04",
    "sentence": "“The U.S. Department of Homeland Security, (DHS), estimates getting rid of Title 42 will result in as many as 18,000 migrants per day—which could mean 540,000 migrants in a single month.”\n— Daily Caller (@DailyCaller) April 1, 2022\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span>, the only border state official of the group, said his state will be at the forefront of the consequences of the decision.",
    "author": "Jennie Taer",
    "title": "3 States Sue Biden Administration Over Ending COVID-19 Restrictions at Border"
  },
  {
    "id": 1161,
    "mediaId": 2746,
    "date": "2022-04-04",
    "sentence": "“The Title 42 Revocation thus stands as a radical outlier — seemingly the only COVID-19-based restriction the Administration sees fit to end,” said Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, Louisiana Attorney General Jeff Landry and Missouri Attorney General Eric S. Schmitt.",
    "author": "Stephen Dinan",
    "title": "States sue to halt Biden from ending border order stopping illegal immigrants"
  },
  {
    "id": 1809,
    "mediaId": 6511,
    "date": "2022-04-04",
    "sentence": "La petición es firmada por los fiscales generales de Arizona, <span class='selected-term'>Mark Brnovich</span>; de Missouri, Eric Schmitt, y la procuradora general de Louisiana, Elizabeth Murrill.",
    "author": "",
    "title": "Tres estados republicanos piden a juez bloquear decisión de Biden para terminar el Título 42 contra inmigrantes"
  },
  {
    "id": 1067,
    "mediaId": 2664,
    "date": "2022-04-04",
    "sentence": "The fact remains that these right-wingers have been further enabled by the likes of Donald Trump and Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, both of whom spread the false gospel of Trump’s “Big Lie.”\nWith the U.S. Senate’s failure to pass voting rights legislation earlier this year, the voting rights fight has come to Arizona.",
    "author": "Anushka Sarkar",
    "title": "Arizona is leading the way on new anti-democratic laws fueled by Republican election lies"
  },
  {
    "id": 1099,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> ?told ?”?Fox & Friends” Monday.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 1421,
    "mediaId": 2680,
    "date": "2022-04-05",
    "sentence": "PHOENIX (AP) — The Arizona Supreme Court on Tuesday revived a lawsuit filed by Attorney General <span class='selected-term'>Mark Brnovich</span> against the board that oversees the state's three public universities over a hotel development agreement, giving him the right to try to prove the deal doesn't benefit taxpayers.",
    "author": "BOB CHRISTIE",
    "title": "Arizona high court revives AG's suit against ASU hotel plan"
  },
  {
    "id": 1733,
    "mediaId": 2679,
    "date": "2022-04-05",
    "sentence": "“I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "JACQUES BILLEAUD",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 1779,
    "mediaId": 2679,
    "date": "2022-04-05",
    "sentence": "",
    "author": "ACACIA CORONADO",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1575,
    "mediaId": 2801,
    "date": "2022-04-05",
    "sentence": "",
    "author": "ACACIA CORONADO and PAUL J. WEBER",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1500,
    "mediaId": 4045,
    "date": "2022-04-05",
    "sentence": "",
    "author": "",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1418,
    "mediaId": 2728,
    "date": "2022-04-05",
    "sentence": "“I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "Jacques Billeaud",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 1586,
    "mediaId": 2728,
    "date": "2022-04-05",
    "sentence": "",
    "author": "Acacia Coronado And Paul J. Weber",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1704,
    "mediaId": 6503,
    "date": "2022-04-05",
    "sentence": "“While it’s difficult to identify President Biden’s most irresponsible move since taking office, rescinding Title 42 is certainly up there,” said Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "Warner Todd Huston",
    "title": "GOP-Led States Sue to Prevent Biden from Canceling Immigration Rules and Pushing Wide Open Border Policy"
  },
  {
    "id": 1596,
    "mediaId": 2543,
    "date": "2022-04-05",
    "sentence": "@FoxNews pic.twitter.com/EnsOsaHSEv\n— Bill Melugin (@BillFOXLA) March 31, 2022\n“Their attempt to rescind Title 42 will lead to drastic consequences on our southern border,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> told “Fox & Friends” on Monday.",
    "author": "Randy DeSoto",
    "title": "Arizona Joins with Two Other States to Sue Biden Admin to Block Ending Title 42 Border Restrictions"
  },
  {
    "id": 1807,
    "mediaId": 2563,
    "date": "2022-04-05",
    "sentence": "To states like Arizona, Texas, and California, “it’s throwing gasoline on a fire,” state Attorney General <span class='selected-term'>Mark Brnovich</span> (R-Ariz.) shook his head.",
    "author": "Family Research Council",
    "title": "VIDEO: ‘Human Tsunami’ Puts Border on the Brink"
  },
  {
    "id": 1016,
    "mediaId": 2822,
    "date": "2022-04-05",
    "sentence": "PHOENIX — Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is going to get a chance to challenge a deal that he says illegally gives away taxpayer funds to benefit a private company.",
    "author": "Howard Fischer Capitol Media Services",
    "title": "Court: Arizona Attorney General can challenge ASU hotel deal"
  },
  {
    "id": 936,
    "mediaId": 2822,
    "date": "2022-04-05",
    "sentence": "PHOENIX (AP) — The Arizona Supreme Court on Tuesday revived a lawsuit filed by Attorney General <span class='selected-term'>Mark Brnovich</span> against the board that oversees the state's three public universities over a hotel development agreement, giving him the right to try to prove the deal doesn't benefit taxpayers.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Arizona high court revives AG's suit against ASU hotel plan"
  },
  {
    "id": 1207,
    "mediaId": 2822,
    "date": "2022-04-05",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "JACQUES BILLEAUD - Associated Press",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 1458,
    "mediaId": 2509,
    "date": "2022-04-05",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "JACQUES BILLEAUD Associated Press",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 1081,
    "mediaId": 2822,
    "date": "2022-04-05",
    "sentence": "",
    "author": "",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1184,
    "mediaId": 2746,
    "date": "2022-04-05",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "Acacia Coronado and Paul J. Weber",
    "title": "Ex-Trump officials urge Texas to declare border ‘invasion’"
  },
  {
    "id": 1514,
    "mediaId": 2589,
    "date": "2022-04-06",
    "sentence": "Republicans have a primary fight that AG <span class='selected-term'>Mark Brnovich</span> appears to be leading comfortably so far despite worries among the base that he might not be conservative/populist enough for the GOP at the moment.",
    "author": "Ed Morrissey",
    "title": "Midterm signals: Kelly looking to break out of Biden's orbit"
  },
  {
    "id": 1777,
    "mediaId": 6551,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said Monday morning on \"FOX & Friends:\"\nWe want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things.",
    "author": "",
    "title": "Several States Sue to Stop Biden's Ending of Title 42"
  },
  {
    "id": 1797,
    "mediaId": 2557,
    "date": "2022-04-06",
    "sentence": "Arizona AG <span class='selected-term'>Mark Brnovich</span> has reached the conclusion that the 2020 election was full of lies and nothing else\n“We have reached the conclusion that the 2020 election in Maricopa County revealed serious serious vulnerabilities that must be addressed…” pic.twitter.com/mekwao4AJv\n— George (@BehizyTweets) April 6, 2022\nA blockbuster review of Maricopa County’s mismanaged 2020 election by Arizona’s attorney general is raising new questions about the final vote in a state former President Donald Trump was expected to win.https://t.co/jfHFBIPj6m\n— Washington Examiner (@dcexaminer) April 6, 2022\nListen to the latest daily DML podcasts below!",
    "author": "DML News App",
    "title": "REPORT: Arizona AG: Election fraud in Maricopa ‘raises questions’ about 2020"
  },
  {
    "id": 1208,
    "mediaId": 2578,
    "date": "2022-04-06",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe letter to Karen Fann said, “The EIU’s review has uncovered instances of election fraud by individuals who have been or will be prosecuted for various elections crimes.”\n<span class='selected-term'>Mark Brnovich</span> tweeted, “We can report that there are problematic system-wide issues that relate to early ballot handling and verification.”\nI just dropped off our initial review of the 2020 election audit to President Fann.",
    "author": "Assistant Editor",
    "title": "BREAKING: Arizona Attorney General Releases Maricopa County 2020 Election Interim Report – Individuals To Be Prosecuted For Election Fraud"
  },
  {
    "id": 1341,
    "mediaId": 2747,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "",
    "title": "Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 1349,
    "mediaId": 2509,
    "date": "2022-04-06",
    "sentence": "",
    "author": "ACACIA CORONADO and PAUL J. WEBER Associated Press",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1080,
    "mediaId": 2732,
    "date": "2022-04-06",
    "sentence": "",
    "author": "Associated Press",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1245,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "ACACIA CORONADO and PAUL J. WEBER",
    "title": "Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 1350,
    "mediaId": 2514,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "",
    "title": "Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 935,
    "mediaId": 2822,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is in a tough GOP primary for U.S. Senate, largely reiterated concerns raised by a widely panned election review conducted last year by supporters of former President Donald Trump on behalf of state Senate Republicans.",
    "author": "",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 1292,
    "mediaId": 2732,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is in a tough GOP primary for U.S. Senate, largely reiterated concerns raised by a widely panned election review conducted last year by supporters of former President Donald Trump on behalf of state Senate Republicans.",
    "author": "Associated Press",
    "title": "Arizona AG Mark Brnovich's letter offers no proof of 2020 election fraud"
  },
  {
    "id": 1056,
    "mediaId": 6509,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "Paul J. Weber",
    "title": "Ex-Trump Officials Urge Texas to Declare Border ‘Invasion'"
  },
  {
    "id": 1149,
    "mediaId": 2525,
    "date": "2022-04-06",
    "sentence": "",
    "author": "Associated Press",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1644,
    "mediaId": 2751,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "",
    "title": "'Unprecedented action': Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 1722,
    "mediaId": 2728,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is in a tough GOP primary for U.S. Senate, largely reiterated concerns raised by a widely panned election review conducted last year by supporters of former President Donald Trump on behalf of state Senate Republicans.",
    "author": "Jonathan J. Cooper And Bob Christie",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 1319,
    "mediaId": 2707,
    "date": "2022-04-06",
    "sentence": "",
    "author": "Associated Press",
    "title": "Texas takes new border action; ex-Trump officials want more"
  },
  {
    "id": 1326,
    "mediaId": 2518,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "The Associated Press",
    "title": "Ex-Trump officials urge Texas to declare border ‘invasion’"
  },
  {
    "id": 1795,
    "mediaId": 2912,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "",
    "title": "Ex-Trump officials urge Texas to declare border ‘invasion’"
  },
  {
    "id": 1556,
    "mediaId": 2680,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is in a tough GOP primary for U.S. Senate, largely reiterated concerns raised by a widely panned election review conducted last year by supporters of former President Donald Trump on behalf of state Senate Republicans.",
    "author": "JONATHAN J. COOPER and BOB CHRISTIE",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 1709,
    "mediaId": 2869,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "ACACIA CORONADO and PAUL J. WEBER",
    "title": "Ex-Trump officials urge Texas Gov. Greg Abbott to declare border crossings an 'invasion'"
  },
  {
    "id": 1425,
    "mediaId": 2679,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is in a tough GOP primary for U.S. Senate, largely reiterated concerns raised by a widely panned election review conducted last year by supporters of former President Donald Trump on behalf of state Senate Republicans.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 1029,
    "mediaId": 2685,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is in a tough GOP primary for U.S. Senate, largely reiterated concerns raised by a widely panned election review conducted last year by supporters of former President Donald Trump on behalf of state Senate Republicans.",
    "author": "JONATHAN J. COOPER and BOB CHRISTIE",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 1186,
    "mediaId": 2590,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "ACACIA CORONADO and PAUL J. WEBER",
    "title": "Ex-Trump Officials Urge Texas To Declare Border 'Invasion'"
  },
  {
    "id": 1342,
    "mediaId": 2607,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "Alicia Coronado and Paul J. Weber",
    "title": "Ex-Trump officials urge Texas to declare border ‘invasion’"
  },
  {
    "id": 1612,
    "mediaId": 2560,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "Acacia Coronado and Paul J. Weber",
    "title": "Ex-Trump officials urge Texas to declare border 'invasion'"
  },
  {
    "id": 1153,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "Via AP news wire",
    "title": "Arizona schedules its first execution in nearly eight years for 11 May"
  },
  {
    "id": 939,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Mr Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "Via AP news wire",
    "title": "Ex-Trump officials pressure Texas Governor Greg Abbott to declare ‘invasion’ along Mexico border"
  },
  {
    "id": 931,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "Attorney General <span class='selected-term'>Mark Brnovich</span>, who is in a tough GOP primary for U.S. Senate, largely reiterated concerns raised by a widely panned election review conducted last year by supporters of former President Donald Trump on behalf of state Senate Republicans.",
    "author": "Via AP news wire",
    "title": "Arizona AG letter offers no proof of 2020 election fraud"
  },
  {
    "id": 1593,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Arizona attorney general <span class='selected-term'>Mark Brnovich</span> issued a report Wednesday that found no evidence of widespread voter fraud or irregularities in Maricopa County, despite Trump's persistent pressure campaign to justify his false claims about his election loss, and the \"Morning Joe\" host said he's had enough.",
    "author": "Travis Gettys",
    "title": "Morning Joe hammers GOP 'freaks' still clinging to Trump's election lies"
  },
  {
    "id": 1823,
    "mediaId": 2752,
    "date": "2022-04-07",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has written a 12-page love letter to Donald Trump in hopes of winning his endorsement in this fall's US Senate race.",
    "author": "Liz Dye",
    "title": "Arizona AG, Hoping For Trump Nod, Produces Election 'Report' Heavy On Innuendo, Light On Data"
  },
  {
    "id": 979,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Trump has continued his pressure on Brnovich, chastising him in written statements and asking him to “do something.”\nBy the way, before he decided to run for the U.S. Senate, Brnovich was singing a different tune:\nShortly after the 2020 presidential election Attorney General <span class='selected-term'>Mark Brnovich</span> appeared on Fox Business, where he was asked about unsubstantiated claims of election fraud in Arizona.",
    "author": "",
    "title": "Surprising No One, MAGA AG's \"2020 Election Fraud\" Investigation Turns Out To Be A Bust"
  },
  {
    "id": 1344,
    "mediaId": 3987,
    "date": "2022-04-07",
    "sentence": "",
    "author": "AV Press Releases",
    "title": "Dems Should Heed The Call of Leading Voices and Key Constituencies: Title 42 Needs to Go"
  },
  {
    "id": 1494,
    "mediaId": 2627,
    "date": "2022-04-07",
    "sentence": "“The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump added.",
    "author": "Steve Benen",
    "title": "Arizona AG fails to produce the election evidence Trump demanded"
  },
  {
    "id": 1752,
    "mediaId": 2551,
    "date": "2022-04-07",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican, issued a legal opinion in February declaring that Ducey has the power to use National Guard troops and state law enforcement to forcibly send migrants back.",
    "author": "Morgan Phillips",
    "title": "Texas Gov. Greg Abbott says he'll bus thousands of migrants to Washington D.C. and check all vehicles at the border to stop cartels as he declares war on Biden's 'open border' policies"
  },
  {
    "id": 1535,
    "mediaId": 2543,
    "date": "2022-04-07",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> released an interim report Wednesday on the 2020 election in Maricopa County, concluding that fraud did occur and uncovering serious issues concerning the handling of over 100,000 mail-in ballots.",
    "author": "Randy DeSoto",
    "title": "AZ AG Releases Report Finding 'Fraud' and Problems with Handling of Over 100K Mail-in Ballots in Maricopa County"
  },
  {
    "id": 938,
    "mediaId": 2572,
    "date": "2022-04-07",
    "sentence": "(BEGIN VIDEO CLIP)\n<span class='selected-term'>MARK BRNOVICH</span> (R), ARIZONA ATTORNEY GENERAL: So, we want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things.",
    "author": "",
    "title": "'Your World' on need to hold Russia accountable for Ukraine attacks"
  },
  {
    "id": 996,
    "mediaId": 2593,
    "date": "2022-04-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> released an interim report Wednesday on the 2020 election in Maricopa County, concluding that fraud did occur and uncovering serious issues concerning the handling of over 100,000 mail-in ballots.",
    "author": "Randy DeSoto",
    "title": "AZ AG Releases Report Finding 'Fraud' and Problems With Handling of Over 100K Mail-in Ballots in Maricopa County"
  },
  {
    "id": 1838,
    "mediaId": 2681,
    "date": "2022-04-08",
    "sentence": "“All branches of government in this state must come together to provide full assurance of the integrity of our elections and answer every outstanding question,” said a report from Attorney General <span class='selected-term'>Mark Brnovich</span>.",
    "author": "",
    "title": "2020 ‘election fraud’ in Arizona ‘raises questions,’ AG reports"
  },
  {
    "id": 1680,
    "mediaId": 2591,
    "date": "2022-04-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> released a report citing “serious vulnerabilities that must be addressed and raise questions about the 2020 election in Arizona.”\nIndeed, the report issued to the state Senate highlighted controversial management of the election in Maricopa County.",
    "author": "Human Events Staff",
    "title": "Arizona AG: ‘Serious Vulnerabilities’ in Maricopa County ‘Raise Questions’ About 2020 Election"
  },
  {
    "id": 1210,
    "mediaId": 2658,
    "date": "2022-04-09",
    "sentence": "Both Missouri Attorney General Eric Schmitt and Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> are running for the Senate in November.",
    "author": "",
    "title": "Republicans see CDC’s policy change as ‘massive political loser for Democrats’"
  },
  {
    "id": 849,
    "mediaId": 2690,
    "date": "2022-04-11",
    "sentence": "Suing your beloved alma mater is never easy, but that's exactly what Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> did when he saw Arizona State University abusing its tax-exempt status to let big business avoid paying taxes.",
    "author": "Admin Dee",
    "title": "Finally, Someone Who Dares to Sue Public Universities"
  },
  {
    "id": 278,
    "mediaId": 2650,
    "date": "2022-04-11",
    "sentence": "Since he hasn’t distinguished himself in any way in the Senate yet, there isn’t much that his eventual opponent (probably Attorney General <span class='selected-term'>Mark Brnovich</span>) can pin on him.",
    "author": "Stephen Kruiser",
    "title": "The Morning Briefing: Do Republicans Have a Legit Shot at the Senate in November?"
  },
  {
    "id": 198,
    "mediaId": 2641,
    "date": "2022-04-11",
    "sentence": "\"As attorney general, I would deploy a mobile prosecution unit to arrest individuals under state criminal trespassing laws and similar to what [Attorney General] <span class='selected-term'>Mark Brnovich</span> has done in the state of Arizona; assert the state's sovereignty under the Constitution, where the federal government is compelled to defend the states.",
    "author": "Sandy Fitzgerald",
    "title": "George P. Bush to Newsmax: Abbott Right With Plan to Bus Immigrants"
  },
  {
    "id": 500,
    "mediaId": 4091,
    "date": "2022-04-12",
    "sentence": "This is according to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, who recently published an interim report that was sent to the president of the Arizona Senate, Karen Fann, relaying the findings of a forensic election audit.",
    "author": "Cassie B.",
    "title": "Criminal prosecutions for Maricopa County election fraud are coming, according to Arizona AG’s interim report"
  },
  {
    "id": 673,
    "mediaId": 2701,
    "date": "2022-04-12",
    "sentence": "This plan has already been validated by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> in a landmark legal opinion issued earlier this year.",
    "author": "Ken Cuccinelli",
    "title": "Gov. Abbott’s D.C. Caravan Gimmick Won’t Secure The Border. Here’s What Will"
  },
  {
    "id": 693,
    "mediaId": 2576,
    "date": "2022-04-13",
    "sentence": "In a written statement, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> called it a \"ridiculously burdensome policy.\"",
    "author": "Bailey Schulz",
    "title": "Traveling soon? Don't ditch that face mask. Mandate for planes extended through May 3"
  },
  {
    "id": 796,
    "mediaId": 4024,
    "date": "2022-04-14",
    "sentence": "",
    "author": "",
    "title": "U.S. Bioweapons expert speaks out about US biolabs in Ukraine"
  },
  {
    "id": 711,
    "mediaId": 2681,
    "date": "2022-04-15",
    "sentence": "Her accomplice, Guillermina Fuentes, who serves on the San Luis School District Board, faces … Continue reading\nThis evidence was presented to Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> in August 2020, before the stolen 2020 election, but he chose to do nothing about it.",
    "author": "Jim Hoft",
    "title": "EXCLUSIVE: Man Who Discovered Ballot Trafficking Operation In Yuma County Handed Evidence To Attorney General Brnovich BEFORE 2020 General Election: “They Could Have Stopped This.” (AUDIO)"
  },
  {
    "id": 788,
    "mediaId": 2664,
    "date": "2022-04-18",
    "sentence": "\"The lackluster Attorney General of Arizona, <span class='selected-term'>Mark Brnovich</span>, has to get on the ball and catch up with the great Republican patriots in the Arizona State Senate,” Trump ranted in the 2021 statement.",
    "author": "Sarah K. Burris",
    "title": "Trump posts angry anti-endorsement for Arizona AG who refused to help change election results"
  },
  {
    "id": 148,
    "mediaId": 2557,
    "date": "2022-04-19",
    "sentence": "https://t.co/Pgogo9A7uO\n— <span class='selected-term'>Mark Brnovich</span> (@GeneralBrnovich) April 6, 2022\nBelow is Trump’s statement as he responded to the report:\nAttorney General Brnovich of Arizona was given massive information on the fraud and so-called ‘irregularities’ that took place in the 2020 Presidential Election.",
    "author": "DML News App",
    "title": "NEWS ALERT: AZ AG admits issues with 2020 election, Trump unleashes on him in scorching rebuke"
  },
  {
    "id": 508,
    "mediaId": 2754,
    "date": "2022-04-20",
    "sentence": "(Courtesy of Kinney County Sheriff’s Office)\nThe ‘Invasion’ Question\nArizona Attorney General <span class='selected-term'>Mark Brnovich</span> provided an opinion following a query by state Rep. Jake Hoffman, who asked what constitutes an “invasion” with regard to Article IV, Section 4 of the U.S. Constitution, as well as “actually invaded” as articulated in Article I, Section 10 of the Constitution.",
    "author": "Tyler Durden",
    "title": "Border Patrol Union: Abbott Should \"Absolutely\" Use Constitutional \"Invasion\" Powers On Border"
  },
  {
    "id": 736,
    "mediaId": 2822,
    "date": "2022-04-20",
    "sentence": "Gates noted that Republican Attorney General <span class='selected-term'>Mark Brnovich</span> last week released an interim report that outlined his concerns with county election procedures but did not provide proof of any major issues despite six months of investigation.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Maricopa County board names new top prosecutor"
  },
  {
    "id": 771,
    "mediaId": 2732,
    "date": "2022-04-20",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, a Republican running for U.S. Senate, released a legal opinion supporting the plan this year, arguing, “The violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an ‘invasion’ under the U.S. Constitution, and Arizona therefore has the power to defend itself.” Arizona Gov.",
    "author": "Los Angeles Times",
    "title": "Can Texas declare a border 'invasion' and return migrants to Mexico?"
  },
  {
    "id": 842,
    "mediaId": 2822,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is joining with Republican Party officials to sue Democratic Secretary of State Katie Hobbs in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  },
  {
    "id": 336,
    "mediaId": 2550,
    "date": "2022-04-21",
    "sentence": "State Attorney General <span class='selected-term'>Mark Brnovich</span> is perhaps the best known of the contenders for the Republican nomination, but Trump is passing him over as insufficiently nutty and disloyal.",
    "author": "",
    "title": "How Putting Voting Rights on the Arizona Ballot Will Help Keep Control of the U.S. House and Senate"
  },
  {
    "id": 306,
    "mediaId": 2680,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is joining with Republican Party officials to sue Democratic Secretary of State Katie Hobbs in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "BOB CHRISTIE",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  },
  {
    "id": 443,
    "mediaId": 2855,
    "date": "2022-04-21",
    "sentence": "",
    "author": "George Fishman",
    "title": "42 Skiddo: Is the Biden Administration Expelling Border Security?"
  },
  {
    "id": 496,
    "mediaId": 4091,
    "date": "2022-04-21",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has sent notice to the president of the state Senate, Karen Fann, with his finding in an interim report pertaining to a forensic ballot audit conducted in the months after the election in Maricopa County, and in his report, he has called for criminal prosecutions, according to 100 Percent Fed Up.",
    "author": "JD Heyes",
    "title": "Arizona AG Brnovich sends notice to state Senate, says criminal prosecutions coming in relation to 2020 election"
  },
  {
    "id": 781,
    "mediaId": 2746,
    "date": "2022-04-21",
    "sentence": "PHOENIX — Republican Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> is joining with Republican Party officials to sue Democratic Secretary of State Katie Hobbs in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "Bob Christie",
    "title": "Judge allows Brnovich, Arizona Republicans to sue Hobbs over election procedures manual"
  },
  {
    "id": 542,
    "mediaId": 2589,
    "date": "2022-04-22",
    "sentence": "As Arizona AG and Republican Senate candidate <span class='selected-term'>Mark Brnovich</span> pointed out in its challenge, the White House and DHS hasn’t followed the Administrative Procedure Act (APA) process for the rule change, and courts take the APA very seriously:\nThe Biden administration has a pattern of unlawfully circumventing correct processes required under the Administrative Procedure Act (APA).",
    "author": "Ed Morrissey",
    "title": "Biden to Dems: We're ending Title 42 no matter how much you complain"
  },
  {
    "id": 749,
    "mediaId": 2614,
    "date": "2022-04-22",
    "sentence": "“Once again the Biden Administration is thumbing its nose at the American people and the rule of law,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement to press Thursday.",
    "author": "DrewBerquist.com",
    "title": "Republican States Suing To Keep Title 42 On The Books"
  },
  {
    "id": 732,
    "mediaId": 2692,
    "date": "2022-04-22",
    "sentence": "“It’s a completely unserious attempt to demand extraordinary, military-?style measures to stop completely mundane actions like walking around a closed port of entry to file asylum paperwork or violating international labor market regulations in order to fill one of the 10 million job openings in this country.”\nThe idea of a border “invasion” under the U.S. Constitution has already taken off in Arizona, where the Republican attorney general, <span class='selected-term'>Mark Brnovich</span>, issued a legal opinion in February that said the “violence and lawlessness at the border caused by transnational cartels and gangs satisfies the definition of an ‘invasion’ under the U.S. Constitution, and Arizona therefore has the power to defend itself” via its own executive branch.",
    "author": "Patrick Svitek",
    "title": "Some Texas Republicans push for Gov. Greg Abbott to use state personnel to deport migrants"
  }
]