[
  {
    "id": 6675,
    "mediaId": 2724,
    "date": "2022-01-24",
    "sentence": "Skinner, who previously worked on top consumer-oriented cases under Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, argues the taxpayer-funded contracts between state governments and these firms often lack basic ethics protections that should be part of all outside-counsel contracts.",
    "author": "RealClearWire",
    "title": "Report: State Contracts Boost Dem-Linked Lawyers, Not Consumers"
  },
  {
    "id": 5285,
    "mediaId": 6511,
    "date": "2022-02-22",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5323,
    "mediaId": 3987,
    "date": "2022-02-23",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 5260,
    "mediaId": 6511,
    "date": "2022-02-23",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 2078,
    "mediaId": 2662,
    "date": "2022-03-22",
    "sentence": "President Trump released another statement yesterday blasting the Arizona Attorney General, <span class='selected-term'>Mark Brnovich</span>, on his failure to prosecute the Maricopa County Supervisors for the rigged 2020 election and their ongoing failure to comply with his criminal investigation.",
    "author": "Jordan Conradson",
    "title": "President Trump Tells Arizona Attorney General Mark Brnovich To Issue Warrants In 2020 Election Fraud Case: “The Supervisors Just Won’t Release The Information—It Must Really Be Bad!”"
  },
  {
    "id": 1994,
    "mediaId": 2662,
    "date": "2022-03-23",
    "sentence": "Contact Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> to demand arrests.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Leaked Emails From Maricopa County Recorder Stephen Richer Reveal Voter Fraud Concerns Before 2020 Election"
  },
  {
    "id": 1208,
    "mediaId": 2578,
    "date": "2022-04-06",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe letter to Karen Fann said, “The EIU’s review has uncovered instances of election fraud by individuals who have been or will be prosecuted for various elections crimes.”\n<span class='selected-term'>Mark Brnovich</span> tweeted, “We can report that there are problematic system-wide issues that relate to early ballot handling and verification.”\nI just dropped off our initial review of the 2020 election audit to President Fann.",
    "author": "Assistant Editor",
    "title": "BREAKING: Arizona Attorney General Releases Maricopa County 2020 Election Interim Report – Individuals To Be Prosecuted For Election Fraud"
  }
]