[
  {
    "id": 5455,
    "mediaId": 2572,
    "date": "2022-02-02",
    "sentence": "",
    "author": "Fox News Staff",
    "title": "Arizona attorney general: Biden sending US troops to secure Ukraine border is 'height of hypocrisy'"
  },
  {
    "id": 5608,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> has officially ruled that the chaos on the Mexican border constitutes an “invasion” under the U.S. Constitution, clearing the way for the state’s governor to defend the boundary with police or troops of his own.",
    "author": "Stephen Dinan",
    "title": "Arizona AG rules states can deploy forces to fight border ‘invasion’"
  },
  {
    "id": 6178,
    "mediaId": 2600,
    "date": "2022-02-09",
    "sentence": "The attorneys general of Arizona, Idaho, Indiana, Nebraska, and South Carolina, led by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span>, mounted a federal lawsuit (pdf) arguing that President Joe Biden lacked statutory authority when he signed an executive order on April 27, 2021, to mandate the minimum wage.",
    "author": "IWB",
    "title": "States Sue Biden Over Min Wage Increase"
  },
  {
    "id": 6017,
    "mediaId": 2550,
    "date": "2022-02-11",
    "sentence": "“In Arizona, <span class='selected-term'>Mark Brnovich</span>, the state Attorney General and a candidate for the GOP primary for U.S. Senate, called immigration into the state an ‘invasion’ in a legal opinion he issued this week justifying Arizona’s ability to send troops to the border,” America’s Voice continued.",
    "author": "",
    "title": "House Republican touts 'Dignity Act' bill claiming to make path to legalization, but don't be fooled"
  },
  {
    "id": 5323,
    "mediaId": 3987,
    "date": "2022-02-23",
    "sentence": "O incluso el fiscal general de Arizona, <span class='selected-term'>Mark Brnovich</span>, quien busca una curul en el Senado federal, ha presionado por que el gobernador de ese estado, Doug Ducey, responda con una fuerza militar contra lo que él llama erróneamente una “invasión” de inmigrantes por la frontera sur.",
    "author": "",
    "title": "Trump y los republicanos aceitan su maquinaria de mentiras"
  },
  {
    "id": 4298,
    "mediaId": 2601,
    "date": "2022-02-24",
    "sentence": "",
    "author": "MJA",
    "title": "Feds Cannot Bypass States and Courts"
  },
  {
    "id": 2341,
    "mediaId": 6551,
    "date": "2022-03-24",
    "sentence": "Justice and our country’s well-being require it.”\nArizona AG <span class='selected-term'>Mark Brnovich</span> argued that the decision was a “tremendous victory” in a statement made to the Daily Caller News Foundation, adding;\nSince assuming office, the Biden administration has undermined our immigration laws and our law enforcement agencies, while empowering dangerous cartels and criminals on both sides of the border.",
    "author": "",
    "title": "Judge Blocks Biden's Attempt to Halt Certain ICE Deportations"
  },
  {
    "id": 2713,
    "mediaId": 2742,
    "date": "2022-03-26",
    "sentence": "Last year in May, documents turned up by Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> in his lawsuit against the Biden Regime showed that the regime had no plans to deport more than 8,000 dangerous criminals, including these [Biden’s DHS Plan No Deportations For Illegal-Alien Murderers, Sex Offenders, by John Binder, Breitbart, May 5, 2021].",
    "author": "",
    "title": "Is Keeping Illegal-Alien Thugs In The Country Part Of A Plan To Terrorize The Historic American Nation Into Accepting Their Dispossession?"
  },
  {
    "id": 1099,
    "mediaId": 2644,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> ?told ?”?Fox & Friends” Monday.",
    "author": "Mark Moore",
    "title": "GOP-led states sue to stop Biden’s CDC from scrapping Title 42 border policy"
  },
  {
    "id": 1507,
    "mediaId": 2522,
    "date": "2022-04-04",
    "sentence": "“We want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things,” Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> bluntly stated on “Fox & Friends” Monday.",
    "author": "Terresa Monroe-Hamilton",
    "title": "GOP states sue Biden admin over plan to rescind Title 42 border policy, likely open migrant floodgates"
  },
  {
    "id": 1458,
    "mediaId": 2509,
    "date": "2022-04-05",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "JACQUES BILLEAUD Associated Press",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 1418,
    "mediaId": 2728,
    "date": "2022-04-05",
    "sentence": "“I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "Jacques Billeaud",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 1207,
    "mediaId": 2822,
    "date": "2022-04-05",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "JACQUES BILLEAUD - Associated Press",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 1733,
    "mediaId": 2679,
    "date": "2022-04-05",
    "sentence": "“I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "JACQUES BILLEAUD",
    "title": "1st execution in Arizona in nearly 8 years set for May 11"
  },
  {
    "id": 1807,
    "mediaId": 2563,
    "date": "2022-04-05",
    "sentence": "To states like Arizona, Texas, and California, “it’s throwing gasoline on a fire,” state Attorney General <span class='selected-term'>Mark Brnovich</span> (R-Ariz.) shook his head.",
    "author": "Family Research Council",
    "title": "VIDEO: ‘Human Tsunami’ Puts Border on the Brink"
  },
  {
    "id": 1777,
    "mediaId": 6551,
    "date": "2022-04-06",
    "sentence": "Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> said Monday morning on \"FOX & Friends:\"\nWe want to stop the Biden administration from rescinding Title 42 because it may be one of the most boneheaded decisions of this administration, and they have done a lot of dumb things.",
    "author": "",
    "title": "Several States Sue to Stop Biden's Ending of Title 42"
  },
  {
    "id": 1153,
    "mediaId": 2594,
    "date": "2022-04-06",
    "sentence": "\"I made a promise to Arizona voters that people who commit the ultimate crime get the ultimate punishment,” Attorney General <span class='selected-term'>Mark Brnovich</span> said in a statement.",
    "author": "Via AP news wire",
    "title": "Arizona schedules its first execution in nearly eight years for 11 May"
  },
  {
    "id": 1344,
    "mediaId": 3987,
    "date": "2022-04-07",
    "sentence": "",
    "author": "AV Press Releases",
    "title": "Dems Should Heed The Call of Leading Voices and Key Constituencies: Title 42 Needs to Go"
  },
  {
    "id": 693,
    "mediaId": 2576,
    "date": "2022-04-13",
    "sentence": "In a written statement, Arizona Attorney General <span class='selected-term'>Mark Brnovich</span> called it a \"ridiculously burdensome policy.\"",
    "author": "Bailey Schulz",
    "title": "Traveling soon? Don't ditch that face mask. Mandate for planes extended through May 3"
  }
]