[
  {
    "id": 1024,
    "mediaId": 19,
    "date": "1/13/2022 12:00:00 AM",
    "sentence": "Both businessman Kevin Rinke and chiropractor Garrett Soldano each trail Whitmer by seven points, while conservative media personality <span class='selected-term'>Tudor Dixon</span> is ten points behind Whitmer.",
    "author": "Ashley Oliver",
    "title": "Poll: Democrat Gretchen Whitmer Tied with Former Detroit Police Chief James Craig in Michigan Governor's Race"
  },
  {
    "id": 1006,
    "mediaId": 261,
    "date": "1/27/2022 12:00:00 AM",
    "sentence": "Other Republican candidates for Michigan governor are Oakland County businessman Kevin Rinke; Norton Shores businesswoman and conservative commentator <span class='selected-term'>Tudor Dixon</span>; Kalamazoo chiropractor Garrett Soldano; Michigan State Police Capt.",
    "author": "Paul Egan",
    "title": "'Quality guru' Perry Johnson joins crowded Republican race for Michigan governor"
  },
  {
    "id": 949,
    "mediaId": 19,
    "date": "2/25/2022 12:00:00 AM",
    "sentence": "The poll also found that Kevin Rinke holds five percent of the vote, <span class='selected-term'>Tudor Dixon</span> and Ryan Kelly have four percent, and Perry Johnson and Mike Brown hold three percent.",
    "author": "Jacob Bliss",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Wide Lead over Republican Rivals"
  },
  {
    "id": 899,
    "mediaId": 261,
    "date": "4/19/2022 12:00:00 AM",
    "sentence": "Mike Brown, of Stevensville, who submitted 21,837 signatures last Tuesday;\nNorton Shores businesswoman <span class='selected-term'>Tudor Dixon</span>, who submitted 29,735 signatures Tuesday;\nOakland County \"quality guru\" and businessman Perry Johnson, who submitted close to 23,000 signatures Tuesday;\nOttawa County real estate agent Ryan Kelley, who filed 20,100 signatures last Wednesday;\nGrand Haven financial adviser Michael Markey, who submitted 21,862 signatures March 18;\nFarmington Hills pastor Ralph Rebandt, who turned in 16,342 signatures last Tuesday;\nBloomfield Hills businessman Kevin Rinke, who filed 21,000 signatures on Monday, and\nKalamazoo chiropractor Garrett Soldano, who was the first to turn in his petition, when he submitted 20,200 signatures Jan. 19.",
    "author": "Paul Egan",
    "title": "Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says"
  },
  {
    "id": 881,
    "mediaId": 261,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "The challenges against former Detroit Police Chief James Craig, conservative commentator <span class='selected-term'>Tudor Dixon</span> and Oakland County businessman Perry Johnson could threaten their candidacies if successful.",
    "author": "Clara Hendrickson",
    "title": "Michigan GOP candidates hoping to unseat Whitmer face challenges to nominating petitions"
  },
  {
    "id": 877,
    "mediaId": 124,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "In a trio of complaints filed this week, attorneys working with the state Democratic Party said they found problems with the nominating petitions filed by former Detroit police chief James Craig, businessman Perry Johnson and conservative commentator <span class='selected-term'>Tudor Dixon</span>  enough to disqualify all three from the Aug. 2 primary, they argue.",
    "author": "",
    "title": "Michigan Democrats accuse GOP candidates of using forged signatures to get on ballot"
  },
  {
    "id": 3293,
    "mediaId": 261,
    "date": "5/12/2022 12:00:00 AM",
    "sentence": "But that means <span class='selected-term'>Tudor Dixon</span>, Michael Brown, Donna Brandenburg, Ralph Rebandt and Michael Markey won't be onstage with their competitors.",
    "author": "Dave Boucher",
    "title": "Detroit chamber limits field for Michigan GOP gubernatorial debate in June on Mackinac"
  },
  {
    "id": 3454,
    "mediaId": 261,
    "date": "5/16/2022 12:00:00 AM",
    "sentence": "That means that barring some change, Norton Shores businesswoman <span class='selected-term'>Tudor Dixon</span>, Michigan State Police Capt.",
    "author": "Paul Egan",
    "title": "GOP candidate for governor balks at Detroit Chamber debate over COVID-19 requirements"
  }
]