[
  {
    "id": 1031,
    "mediaId": 43,
    "date": "1/3/2022 12:00:00 AM",
    "sentence": "Monday, Jan 3, 2022  9:30:53 AM Pacific Standard Time  Jeff Singer\nMI-Gov: Conservative radio host <span class='selected-term'>Tudor Dixon</span> has earned the backing of Rep. Bill Huizenga ahead of the August Republican primary to face Democratic incumbent Gretchen Whitmer.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 1/3"
  },
  {
    "id": 984,
    "mediaId": 43,
    "date": "2/11/2022 12:00:00 AM",
    "sentence": "? MI-Gov: Conservative radio host <span class='selected-term'>Tudor Dixon</span> this week earned an endorsement from Rep. Lisa McClain, whose old 10th District was Donald Trump's best congressional district in the state.",
    "author": "",
    "title": "who refuses to accept his own 2020 defeat"
  },
  {
    "id": 928,
    "mediaId": 238,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "Wiles has also done work for gubernatorial candidates <span class='selected-term'>Tudor Dixon</span> in Michigan and Lynda Blanchard in Alabama, two races where Trump has also not yet endorsed, though Dixon does not pay Wiles.",
    "author": "",
    "title": "Trump endorsements slow and prompt a scramble by candidates, advisers"
  },
  {
    "id": 32,
    "mediaId": 261,
    "date": "4/2/2022 12:00:00 AM",
    "sentence": "That includes former Detroit Police Chief James Craig, Oakland County businessman Perry Johnson, Norton Shores businesswoman <span class='selected-term'>Tudor Dixon</span>, Ottawa County real estate agent Ryan Kelley, Oakland County pastor Ralph Rebandt, Livingston County evangelist Bob Scott, and Grand Rapids businesswoman Donna Brandenburg.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know"
  },
  {
    "id": 186,
    "mediaId": 129,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "Yet Mr. Trump snubbed him at the rally and instead praised a rival candidate, <span class='selected-term'>Tudor Dixon</span>, who had held her own Mar-a-Lago fund-raiser in February.",
    "author": "",
    "title": "Mar-a-Lago Machine: Trump as a Modern-Day Party Boss"
  }
]