[
  {
    "id": 859,
    "mediaId": 195,
    "date": "d2022-01-01T11:05",
    "sentence": "Whitmer is facing a cavalcade of possible Republican challengers, including former Detroit Police Chief James Craig and conservative media personality <span class='selected-term'>Tudor Dixon</span>, and her ability  or inability  to fend off her ultimate challenger will indicate how Democrats are able to rebut coronavirus-related criticism and compete in Rust Belt swing states like Michigan, Pennsylvania and Wisconsin.",
    "author": "Tal Axelrod",
    "title": "Eleven interesting races to watch in 2022",
    "sentiment": null
  },
  {
    "id": 1033,
    "mediaId": 195,
    "date": "d2022-01-01T22:21",
    "sentence": "The Cook Political Report rates the race as a toss-up.?\nThe Michigan governor faces a crowded field of 11 Republican challengers, including former Detroit Police Chief James Craig, conservative talk show host <span class='selected-term'>Tudor Dixon</span> and chiropractor Garrett Soldano.",
    "author": "Julia Manchester",
    "title": "Seven most vulnerable governors facing reelection in 2022",
    "sentiment": null
  },
  {
    "id": 1031,
    "mediaId": 43,
    "date": "d2022-01-03T00:00",
    "sentence": "Monday, Jan 3, 2022  9:30:53 AM Pacific Standard Time  Jeff Singer\nMI-Gov: Conservative radio host <span class='selected-term'>Tudor Dixon</span> has earned the backing of Rep. Bill Huizenga ahead of the August Republican primary to face Democratic incumbent Gretchen Whitmer.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 1/3",
    "sentiment": null
  },
  {
    "id": 87,
    "mediaId": 43,
    "date": "d2022-01-04T00:00",
    "sentence": "? MI-Gov: Conservative radio host <span class='selected-term'>Tudor Dixon</span> has earned the backing of Rep. Bill Huizenga ahead of the August Republican primary to face Democratic Gov.",
    "author": "",
    "title": "Morning Digest: Redistricting scrambled California's House map. Here's our guide to unscrambling it",
    "sentiment": null
  },
  {
    "id": 1025,
    "mediaId": 43,
    "date": "d2022-01-12T00:00",
    "sentence": "Gretchen Whitmer well ahead of four potential Republican foes:\n49-39 vs. former Detroit Police Chief James Craig\n50-33 vs. chiropractor Garrett Soldano\n50-33 vs. businessman Kevin Rinke\n50-31 vs. conservative radio host <span class='selected-term'>Tudor Dixon</span>\nPolling from reliable firms has been rare here so far.",
    "author": "",
    "title": "Morning Digest: We're looking back on Harry Reid's long and storied career on the campaign trail",
    "sentiment": null
  },
  {
    "id": 1026,
    "mediaId": 19,
    "date": "d2022-01-12T00:00",
    "sentence": "Conservative media personality <span class='selected-term'>Tudor Dixon</span> came in fourth with about 14 percent of respondents recognizing her name.",
    "author": "Ashley Oliver",
    "title": "Poll: Republicans Face Uphill Battle to Unseat Michigan Democrat Gov. Gretchen Whitmer",
    "sentiment": null
  },
  {
    "id": 1024,
    "mediaId": 19,
    "date": "d2022-01-13T00:00",
    "sentence": "Both businessman Kevin Rinke and chiropractor Garrett Soldano each trail Whitmer by seven points, while conservative media personality <span class='selected-term'>Tudor Dixon</span> is ten points behind Whitmer.",
    "author": "Ashley Oliver",
    "title": "Poll: Democrat Gretchen Whitmer Tied with Former Detroit Police Chief James Craig in Michigan Governor's Race",
    "sentiment": null
  },
  {
    "id": 1006,
    "mediaId": 261,
    "date": "d2022-01-27T19:49",
    "sentence": "Other Republican candidates for Michigan governor are Oakland County businessman Kevin Rinke; Norton Shores businesswoman and conservative commentator <span class='selected-term'>Tudor Dixon</span>; Kalamazoo chiropractor Garrett Soldano; Michigan State Police Capt.",
    "author": "Paul Egan",
    "title": "'Quality guru' Perry Johnson joins crowded Republican race for Michigan governor",
    "sentiment": null
  },
  {
    "id": 1005,
    "mediaId": 43,
    "date": "d2022-01-28T00:00",
    "sentence": "A dozen Republicans are seeking their party's nod, including former Detroit Police Chief James Craig, chiropractor Garrett Soldano, businessman Kevin Rinke, and conservative radio host <span class='selected-term'>Tudor Dixon</span>.",
    "author": "",
    "title": "GOP primary for Wisconsin governor",
    "sentiment": null
  },
  {
    "id": 65,
    "mediaId": 43,
    "date": "d2022-02-02T00:00",
    "sentence": "Two other Republicans, chiropractor Garrett Soldano and conservative radio host <span class='selected-term'>Tudor Dixon</span>, took in $250,000 and $150,000, respectively, while Soldano led Dixon in cash-on-hand $315,000 to $96,000.",
    "author": "",
    "title": "Morning Digest: Democrat announces rematch against House Republican under fire for impeachment vote",
    "sentiment": null
  },
  {
    "id": 984,
    "mediaId": 43,
    "date": "d2022-02-11T00:00",
    "sentence": "? MI-Gov: Conservative radio host <span class='selected-term'>Tudor Dixon</span> this week earned an endorsement from Rep. Lisa McClain, whose old 10th District was Donald Trump's best congressional district in the state.",
    "author": "",
    "title": "who refuses to accept his own 2020 defeat",
    "sentiment": null
  },
  {
    "id": 949,
    "mediaId": 19,
    "date": "d2022-02-25T00:00",
    "sentence": "The poll also found that Kevin Rinke holds five percent of the vote, <span class='selected-term'>Tudor Dixon</span> and Ryan Kelly have four percent, and Perry Johnson and Mike Brown hold three percent.",
    "author": "Jacob Bliss",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Wide Lead over Republican Rivals",
    "sentiment": null
  },
  {
    "id": 928,
    "mediaId": 238,
    "date": "d2022-03-24T09:00",
    "sentence": "Wiles has also done work for gubernatorial candidates <span class='selected-term'>Tudor Dixon</span> in Michigan and Lynda Blanchard in Alabama, two races where Trump has also not yet endorsed, though Dixon does not pay Wiles.",
    "author": "",
    "title": "Trump endorsements slow and prompt a scramble by candidates, advisers",
    "sentiment": null
  },
  {
    "id": 924,
    "mediaId": 19,
    "date": "d2022-04-01T00:00",
    "sentence": "Trailing Craig and Soldano were several other candidates in the packed primary race, including businessman Perry Johnson at eight percent, real estate broker and activist Ryan Kelly at six percent, conservative commentator <span class='selected-term'>Tudor Dixon</span> at three percent, and former car dealership owner Kevin Rinke at two percent, according to the poll.",
    "author": "Ashley Oliver",
    "title": "Poll: Former Detroit Police Chief James Craig Holds Double-Digit Lead in Michigan Governor's Primary",
    "sentiment": null
  },
  {
    "id": 32,
    "mediaId": 261,
    "date": "d2022-04-02T10:00",
    "sentence": "That includes former Detroit Police Chief James Craig, Oakland County businessman Perry Johnson, Norton Shores businesswoman <span class='selected-term'>Tudor Dixon</span>, Ottawa County real estate agent Ryan Kelley, Oakland County pastor Ralph Rebandt, Livingston County evangelist Bob Scott, and Grand Rapids businesswoman Donna Brandenburg.",
    "author": "Todd Spangler",
    "title": "Donald Trump rally in Michigan on Saturday, April 2: Everything you need to know",
    "sentiment": null
  },
  {
    "id": 917,
    "mediaId": 157,
    "date": "d2022-04-07T00:00",
    "sentence": "There are 12 Republicans running for the GOP nomination in the August primary, including chiropractor Garrett Soldano, right-wing commentator <span class='selected-term'>Tudor Dixon</span>, former Detroit Police Chief James Craig, businessman Perry Johnson and businessman Kevin Rinke.",
    "author": "Allison R. Donahue",
    "title": "Whitmer files suit to enshrine abortion rights, asks Michigan Supreme Court to take the case",
    "sentiment": null
  },
  {
    "id": 186,
    "mediaId": 129,
    "date": "d2022-04-17T00:00",
    "sentence": "Yet Mr. Trump snubbed him at the rally and instead praised a rival candidate, <span class='selected-term'>Tudor Dixon</span>, who had held her own Mar-a-Lago fund-raiser in February.",
    "author": "",
    "title": "Mar-a-Lago Machine: Trump as a Modern-Day Party Boss",
    "sentiment": null
  },
  {
    "id": 901,
    "mediaId": 157,
    "date": "d2022-04-19T00:00",
    "sentence": "Mike Brown; businesswomen Donna Brandeburg and <span class='selected-term'>Tudor Dixon</span>; businessman Perry Johnson; real estate agent Ryan Kelley; financial advisor Michael Markey; pastor Ralph Rebandt, businessman Kevin Rinke; and chiropractor Garrett Soldano.",
    "author": "Bob Brigham",
    "title": "Meatgrinder' GOP Gov. primary in Michigan will leave nominee broke, bloodied, and disliked': expert",
    "sentiment": null
  },
  {
    "id": 899,
    "mediaId": 261,
    "date": "d2022-04-19T18:39",
    "sentence": "Mike Brown, of Stevensville, who submitted 21,837 signatures last Tuesday;\nNorton Shores businesswoman <span class='selected-term'>Tudor Dixon</span>, who submitted 29,735 signatures Tuesday;\nOakland County \"quality guru\" and businessman Perry Johnson, who submitted close to 23,000 signatures Tuesday;\nOttawa County real estate agent Ryan Kelley, who filed 20,100 signatures last Wednesday;\nGrand Haven financial adviser Michael Markey, who submitted 21,862 signatures March 18;\nFarmington Hills pastor Ralph Rebandt, who turned in 16,342 signatures last Tuesday;\nBloomfield Hills businessman Kevin Rinke, who filed 21,000 signatures on Monday, and\nKalamazoo chiropractor Garrett Soldano, who was the first to turn in his petition, when he submitted 20,200 signatures Jan. 19.",
    "author": "Paul Egan",
    "title": "Michigan's primary ballot may be 'disaster' for GOP candidates for governor, expert says",
    "sentiment": null
  },
  {
    "id": 7,
    "mediaId": 43,
    "date": "d2022-04-22T00:00",
    "sentence": "Conservative radio host <span class='selected-term'>Tudor Dixon</span> doesn't have the same resources as her intra-party foes, but she sports endorsements from Reps. Bill Huizenga and Lisa McClain.",
    "author": "",
    "title": "Daily Kos Elections Live Digest: 4/22",
    "sentiment": null
  },
  {
    "id": 6,
    "mediaId": 43,
    "date": "d2022-04-25T00:00",
    "sentence": "Conservative radio host <span class='selected-term'>Tudor Dixon</span> doesn't have the same resources as her intra-party foes, but she sports endorsements from Reps. Bill Huizenga and Lisa McClain.",
    "author": "",
    "title": "Morning Digest: Michigan Republican sends horrid",
    "sentiment": null
  },
  {
    "id": 881,
    "mediaId": 261,
    "date": "d2022-04-27T12:14",
    "sentence": "The challenges against former Detroit Police Chief James Craig, conservative commentator <span class='selected-term'>Tudor Dixon</span> and Oakland County businessman Perry Johnson could threaten their candidacies if successful.",
    "author": "Clara Hendrickson",
    "title": "Michigan GOP candidates hoping to unseat Whitmer face challenges to nominating petitions",
    "sentiment": null
  },
  {
    "id": 877,
    "mediaId": 124,
    "date": "d2022-04-29T23:11:38",
    "sentence": "In a trio of complaints filed this week, attorneys working with the state Democratic Party said they found problems with the nominating petitions filed by former Detroit police chief James Craig, businessman Perry Johnson and conservative commentator <span class='selected-term'>Tudor Dixon</span>  enough to disqualify all three from the Aug. 2 primary, they argue.",
    "author": "",
    "title": "Michigan Democrats accuse GOP candidates of using forged signatures to get on ballot",
    "sentiment": null
  },
  {
    "id": 861,
    "mediaId": 19,
    "date": "d2022-05-06T00:00",
    "sentence": "Craig is the current frontrunner in the Republican primary, but the primary field is packed with other candidates, including chiropractor Garrett Soldano, businessman Perry Johnson, real estate broker and activist Ryan Kelley, conservative commentator <span class='selected-term'>Tudor Dixon</span>, and former car dealership owner Kevin Rinke.",
    "author": "Ashley Oliver",
    "title": "Poll: Michigan Democrat Gretchen Whitmer Trails Republican on Generic Ballot for Governor's Race",
    "sentiment": null
  },
  {
    "id": 3296,
    "mediaId": 261,
    "date": "d2022-05-11T18:19",
    "sentence": "Craig's campaign faces two challenges  one from a Michigan resident represented by lawyer and former Michigan Democratic Party Chair Mark Brewer and another from Michigan Strong PAC, a conservative group supporting GOP gubernatorial candidate <span class='selected-term'>Tudor Dixon</span>'s campaign.",
    "author": "Paul Egan",
    "title": "James Craig acknowledges possible fraud in signature gathering for his petition",
    "sentiment": null
  },
  {
    "id": 3293,
    "mediaId": 261,
    "date": "d2022-05-12T20:36",
    "sentence": "But that means <span class='selected-term'>Tudor Dixon</span>, Michael Brown, Donna Brandenburg, Ralph Rebandt and Michael Markey won't be onstage with their competitors.",
    "author": "Dave Boucher",
    "title": "Detroit chamber limits field for Michigan GOP gubernatorial debate in June on Mackinac",
    "sentiment": null
  },
  {
    "id": 3292,
    "mediaId": 261,
    "date": "d2022-05-13T01:52",
    "sentence": "Mike Brown, of Stevensville; Norton Shores businesswoman <span class='selected-term'>Tudor Dixon</span>; Oakland County \"quality guru\" and businessman Perry Johnson; Ottawa County real estate agent Ryan Kelley; Grand Haven financial adviser Michael Markey; Rebandt; Bloomfield Hills businessman Kevin Rinke; and Kalamazoo chiropractor Garrett Soldano.",
    "author": "Paul Egan",
    "title": "Higher education funding highlights divisions among GOP candidates for governor at debate",
    "sentiment": null
  },
  {
    "id": 3454,
    "mediaId": 261,
    "date": "d2022-05-16T23:30",
    "sentence": "That means that barring some change, Norton Shores businesswoman <span class='selected-term'>Tudor Dixon</span>, Michigan State Police Capt.",
    "author": "Paul Egan",
    "title": "GOP candidate for governor balks at Detroit Chamber debate over COVID-19 requirements",
    "sentiment": null
  },
  {
    "id": 7302,
    "mediaId": 261,
    "date": "d2022-05-23T13:12",
    "sentence": "\"The DeVos family have decided to stand with <span class='selected-term'>Tudor Dixon</span> as being the next right governor for the state of Michigan,\" Dick DeVos said Monday on the Paul W. Smith show on WJR-AM in Detroit.",
    "author": "Paul Egan",
    "title": "Michigan's DeVos family throws its support behind Tudor Dixon for governor",
    "sentiment": null
  },
  {
    "id": 7301,
    "mediaId": 98,
    "date": "d2022-05-23T22:03",
    "sentence": "Another GOP candidate, <span class='selected-term'>Tudor Dixon</span>, had also contested Craig's voter signatures as fake.",
    "author": "DAVID EGGERT",
    "title": "Primary problem: Michigan GOP governor candidates short signatures",
    "sentiment": null
  },
  {
    "id": 7473,
    "mediaId": 157,
    "date": "d2022-05-24T00:00",
    "sentence": "Craigs signatures had been challenged by Democrats and a superPAC supporting right-wing media personality <span class='selected-term'>Tudor Dixon</span>.",
    "author": "",
    "title": "GOP candidates deemed ineligible as massive signature fraud scandal upends Michigan gubernatorial race",
    "sentiment": null
  },
  {
    "id": 7300,
    "mediaId": 261,
    "date": "d2022-05-24T02:09",
    "sentence": "The reports also say that Oakland County businessman and \"quality guru\" Perry Johnson did not file enough valid signatures, but they clear Norton Shores businesswoman <span class='selected-term'>Tudor Dixon</span>, whose petitions were also the subject of a complaint.",
    "author": "Paul Egan",
    "title": "State elections report: James Craig and Perry Johnson filed too few signatures for ballot",
    "sentiment": null
  }
]