[
  {
    "id": 2378,
    "mediaId": 367,
    "date": "2022-00-02",
    "sentence": "\"We are watching the Wisconsin senate race closely and are always thrilled to see strong women leaders like <span class='selected-term'>Sarah Godlewski</span> consider running in these critical seats,\" said Ben Ray, spokesman for Emily's List, a national group with a significant fundraising apparatus to elect Democratic women candidates.",
    "author": "Bill Glauber",
    "title": "Marquette poll shows Rebecca Kleefisch and Mandela Barnes leading key primary contests",
    "sentiment": "0.0"
  },
  {
    "id": 1201,
    "mediaId": 43,
    "date": "2022-00-15",
    "sentence": "? WI-Sen: In her opening ad for the August Democratic primary, state Treasurer <span class='selected-term'>Sarah Godlewski</span> begins, \"Dairy farms disappearing, prices up, COVID still not gone.\"",
    "author": "",
    "title": "Morning Digest: Meet the Republican that the other Republicans don't want to see run for the House",
    "sentiment": "0.0"
  },
  {
    "id": 2361,
    "mediaId": 195,
    "date": "2022-00-15",
    "sentence": "Mandela Barnes (D) leading that primary field with 23 percent support, with Milwaukee Bucks executive Alex Lasry trailing at 13 percent support, Outagamie County Executive Tom Nelson garnering five percent support and State Treasurer <span class='selected-term'>Sarah Godlewski</span> three percent.",
    "author": "Julia Manchester",
    "title": "Democratic group runs ad hitting Ron Johnson over Trump 2017 tax bill",
    "sentiment": "0.0"
  },
  {
    "id": 2353,
    "mediaId": 43,
    "date": "2022-00-22",
    "sentence": "? WI-Sen: In her second commercial ahead of the August Democratic primary, state Treasurer <span class='selected-term'>Sarah Godlewski</span> bemoans how prescription drug costs keep rising and declares that it's \"[b]ecause Republicans like [Sen.] Ron Johnsonand let's be honest, too many Democratsdon't have the guts to stand up to the pharmaceutical companies.",
    "author": "",
    "title": "Morning Digest: The top GOP candidate to run Nevada's elections is an antisemitic Big Lie proponent",
    "sentiment": "0.0"
  },
  {
    "id": 1045,
    "mediaId": 43,
    "date": "2022-00-30",
    "sentence": "Mandela Barnes' new internal from Impact Research (formerly known as Anzalone Liszt Grove or ALG) gives him a 38-17 lead over Milwaukee Bucks executive Alex Lasry in the August Democratic primary, with state Treasurer <span class='selected-term'>Sarah Godlewski</span> and Outagamie County Executive Tom Nelson at 9% and 8%, respectively.",
    "author": "",
    "title": "Morning Digest: Tennessee GOP's bill would block Trump's pick, but they'll need courts to agree",
    "sentiment": "0.0"
  },
  {
    "id": 2342,
    "mediaId": 43,
    "date": "2022-00-31",
    "sentence": "The other three are <span class='selected-term'>Sarah Godlewski</span>, who is the state treasurer, Alex Lasry, who is an executive with the Milwaukee Bucks NBA team and Tom Nelson, who is a county executive from the Northeastern part of this state.",
    "author": "",
    "title": "The Downballot: We open our mailbag and answer your questions! (transcript)",
    "sentiment": "0.0"
  }
]