[
  {
    "id": 694,
    "mediaId": 195,
    "date": "d2022-02-01T21:47",
    "sentence": "Alex Lasry, whose family owns the Milwaukee Bucks, has loaned his campaign $2.3 million; state Treasurer <span class='selected-term'>Sarah Godlewski</span> loaned herself $1.4 million.",
    "author": "Max Greenwood and Reid Wilson -",
    "title": "Five big takeaways from year-end FEC filings",
    "sentiment": "0.0"
  },
  {
    "id": 340,
    "mediaId": 124,
    "date": "d2022-03-14T13:00",
    "sentence": "It also bans teaching in a manner that is not age appropriate or developmentally appropriate.?\nWisconsin State Treasurer <span class='selected-term'>Sarah Godlewski</span>, who's running for the Democratic nomination for Senate, released her first TV ad today.",
    "author": "",
    "title": "Trump attempts to fix his Putin problem",
    "sentiment": "0"
  },
  {
    "id": 339,
    "mediaId": 151,
    "date": "d2022-03-14T14:00",
    "sentence": "Two lawsuits were filed on Friday that asked separate courts to take over the redistricting process and draw new maps for the state's 28 congressional districts.?\n Ohio Supreme Court rules that Ohio Redistricting Commission must respond to revised League of Women Voters of Ohio complaint by Tuesday,? by Kaylee Remington, Cleveland Plain Dealer: The Ohio Supreme Court has set a 4 p.m. Tuesday deadline for the Ohio Redistricting Commission to respond to new arguments from the League of Women Voters of Ohio and others that its latest congressional redistricting maps unconstitutionally favor the Republican Party.?\nAS SEEN ON TV\n Wisconsin Democrat <span class='selected-term'>Sarah Godlewski</span> released the first ad of her Senate campaign.",
    "author": "STEPHANIE MURRAY",
    "title": "Biden hits the fundraising circuit",
    "sentiment": "0.0"
  },
  {
    "id": 3375,
    "mediaId": 238,
    "date": "d2022-05-16T00:00",
    "sentence": "), has an early edge over Milwaukee Bucks executive Alex Lasry, state Treasurer <span class='selected-term'>Sarah Godlewski</span> and Outagamie County Executive Tom Nelson.",
    "author": "",
    "title": "Senate primaries to watch",
    "sentiment": "0.0"
  }
]