[
  {
    "id": 2394,
    "mediaId": 367,
    "date": "1/31/2022 12:00:00 AM",
    "sentence": "Democrats Alex Lasry and <span class='selected-term'>Sarah Godlewski</span> aren't completely self-funding their campaigns for U.S. Senate, but they're each throwing in a lot of cash.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate candidate Alex Lasry pours in $1.55 million more into race, while Sarah Godlewski adds $750,000"
  },
  {
    "id": 2346,
    "mediaId": 21,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "His nearest rival was Milwaukee Bucks executive-on-leave Alex Lasry, who received 17% of the vote among primary voters, followed by state Treasurer <span class='selected-term'>Sarah Godlewski</span> at 9% and Outagamie County Executive Tom Nelson at 8%.",
    "author": "John L. Dorman",
    "title": "Wisconsin Lt. Gov. Mandela Barnes has early lead in Democratic Senate primary: poll"
  },
  {
    "id": 2337,
    "mediaId": 367,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "In both public and private polling, Barnes, the state's lieutenant governor, has a lead over three main rivals, Milwaukee Bucks executive Alex Lasry, state Treasurer <span class='selected-term'>Sarah Godlewski</span> and Outagamie County Executive Tom Nelson.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate candidate Mandela Barnes opposes Biden administration's plan to lift Title 42 rule at the border"
  },
  {
    "id": 2335,
    "mediaId": 367,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "More:Democratic U.S. Senate candidate Mandela Barnes opposes Biden administration's plan to lift Title 42 rule at the border\nMore:Democratic U.S. Senate candidate <span class='selected-term'>Sarah Godlewski</span> issues 'Cut Costs Plan,' calls for suspension of federal gas tax",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate contender Alex Lasry vows to 'bring more jobs and investment back to rural Wisconsin'"
  },
  {
    "id": 2330,
    "mediaId": 367,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Milwaukee Bucks executive Alex Lasry poured $3.45 million into his campaign in the first three months of the year, while state Treasurer <span class='selected-term'>Sarah Godlewski</span> added $1.5 million to her campaign, according to statements issued Thursday.",
    "author": "Bill Glauber",
    "title": "Bucks executive Alex Lasry, Wisconsin Treasurer Sarah Godlewski spend big in Democratic U.S. Senate race"
  },
  {
    "id": 2304,
    "mediaId": 195,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "State Treasurer <span class='selected-term'>Sarah Godlewski</span> falls in third with 7 percent, and Outagamie County Executive Tom Nelson rounds out the top four with 5 percent.",
    "author": "Tal Axelrod",
    "title": "Democratic Senate primary tightening in Wisconsin: poll"
  },
  {
    "id": 2306,
    "mediaId": 367,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Mandela Barnes was the choice of 19% while Milwaukee Bucks executive Alex Lasry was at 16%, with state Treasurer <span class='selected-term'>Sarah Godlewski</span> at 7% and Outagamie County Executive Tom Nelson at 5%.",
    "author": "Bill Glauber",
    "title": "Marquette Poll shows Mandela Barnes, Alex Lasry in tight Democratic U.S. Senate race in Wisconsin"
  },
  {
    "id": 6553,
    "mediaId": 367,
    "date": "5/18/2022 12:00:00 AM",
    "sentence": "Republican U.S. Sen. Ron Johnson is a multi-millionaire, as are Barnes' Democratic rivals, state Treasurer <span class='selected-term'>Sarah Godlewski</span> and Milwaukee Bucks executive Alex Lasry.",
    "author": "Bill Glauber",
    "title": "In his first TV ads, U.S. Senate candidate Mandela Barnes focuses on milk, beef and millionaires"
  }
]