[
  {
    "id": 2445,
    "mediaId": 178,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Other Democrats running for Senate include state Treasurer <span class='selected-term'>Sarah Godlewski</span>; Outagamie County Executive Tom Nelson; Millennial Action Project founder Steven Olikara; and Wausau physician Gillian Battino.",
    "author": "SCOTT BAUER",
    "title": "Democratic Senate candidate Lasry releases democracy plan"
  },
  {
    "id": 2378,
    "mediaId": 367,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "\"We are watching the Wisconsin senate race closely and are always thrilled to see strong women leaders like <span class='selected-term'>Sarah Godlewski</span> consider running in these critical seats,\" said Ben Ray, spokesman for Emily's List, a national group with a significant fundraising apparatus to elect Democratic women candidates.",
    "author": "Bill Glauber",
    "title": "Marquette poll shows Rebecca Kleefisch and Mandela Barnes leading key primary contests"
  },
  {
    "id": 2349,
    "mediaId": 367,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "In many ways, Barnes, Milwaukee Bucks executive Alex Lasry, Outagamie County Executive Tom Nelson and state Treasurer <span class='selected-term'>Sarah Godlewski</span> are following the political path Baldwin blazed.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate contenders in Wisconsin focus on manufacturing"
  },
  {
    "id": 2310,
    "mediaId": 367,
    "date": "4/21/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, the front runner, Milwaukee Bucks executive Alex Lasry, state Treasurer <span class='selected-term'>Sarah Godlewski</span> and Outagamie County Executive Tom Nelson.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate candidate Steven Olikara unveils 'agenda to make government work'"
  },
  {
    "id": 2300,
    "mediaId": 195,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Mandela Barnes (D), state Treasurer <span class='selected-term'>Sarah Godlewski</span> (D), Milwaukee Bucks vice president Alex Lasry (D), Outagamie County Executive Tom Nelson (D) and nonprofit executive Steven Olikara (D), among others.",
    "author": "Reid Wilson",
    "title": "Democrats reserve $33 million in fall advertising in fight for Senate"
  },
  {
    "id": 2301,
    "mediaId": 367,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Mandela Barnes was the choice of 19% while Milwaukee Bucks executive Alex Lasry was at 16%, with state Treasurer <span class='selected-term'>Sarah Godlewski</span> at 7% and Outagamie County Executive Tom Nelson at 5%.",
    "author": "Bill Glauber",
    "title": "Wisconsin U.S. Senate election updates: Tom Nelson claims endorsement from Bernie Sanders-linked Our Wisconsin Revolution"
  }
]