[
  {
    "id": 2445,
    "mediaId": 178,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "Other Democrats running for Senate include state Treasurer <span class='selected-term'>Sarah Godlewski</span>; Outagamie County Executive Tom Nelson; Millennial Action Project founder Steven Olikara; and Wausau physician Gillian Battino.",
    "author": "SCOTT BAUER",
    "title": "Democratic Senate candidate Lasry releases democracy plan"
  },
  {
    "id": 2446,
    "mediaId": 367,
    "date": "1/5/2022 12:00:00 AM",
    "sentence": "State treasurer <span class='selected-term'>Sarah Godlewski</span> and Outagamie County Executive Tom Nelson, both running for U.S. Senate, attacked Republican U.S. Sen. Ron Johnson, who has downplayed the attack.",
    "author": "Bill Glauber",
    "title": "Sarah Godlewski, Tom Nelson use Jan. 6 anniversary to criticize Ron Johnson, who has minimized the insurrection"
  },
  {
    "id": 2442,
    "mediaId": 124,
    "date": "1/6/2022 12:00:00 AM",
    "sentence": "And state Treasurer <span class='selected-term'>Sarah Godlewski</span> released a digital ad that spliced violent images of the attacks on Jan. 6 against Johnson's remarks on TV defending those who were at the Capitol that day.",
    "author": "",
    "title": "Biden gives Democrats the anti-Trump speech they've been waiting for"
  },
  {
    "id": 2436,
    "mediaId": 21,
    "date": "1/8/2022 12:00:00 AM",
    "sentence": "Mandela Barnes  who is seen as the frontrunner in the race  along with state Treasurer <span class='selected-term'>Sarah Godlewski</span>, Outagamie County Executive Tom Nelson, and businessman Alex Lasry.",
    "author": "John L. Dorman",
    "title": "GOP Sen. Ron Johnson of Wisconsin, a top foil for Democrats who pledged to only serve for two terms, poised to run for reelection to a third: sources"
  },
  {
    "id": 2422,
    "mediaId": 147,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, who is seeking to become the state's first Black senator; Milwaukee Bucks executive Alex Lasry; state Treasurer <span class='selected-term'>Sarah Godlewski</span> and Outagamie County Executive Tom Nelson.",
    "author": "Scott Bauer",
    "title": "Wisconsin Republican Sen. Ron Johnson will seek reelection"
  },
  {
    "id": 2424,
    "mediaId": 312,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, who is seeking to become the state's first Black senator; Milwaukee Bucks executive Alex Lasry; state Treasurer <span class='selected-term'>Sarah Godlewski</span> and Outagamie County Executive Tom Nelson.",
    "author": "SCOTT BAUER / AP",
    "title": "Wisconsin Republican Sen. Ron Johnson Will Seek Reelection"
  },
  {
    "id": 2426,
    "mediaId": 195,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, state Treasurer <span class='selected-term'>Sarah Godlewski</span>, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive Tom Nelson.",
    "author": "Tal Axelrod",
    "title": "Ron Johnson announces run for third Senate term in Wisconsin"
  },
  {
    "id": 2435,
    "mediaId": 178,
    "date": "1/9/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, who is seeking to become the state's first Black senator; Milwaukee Bucks executive Alex Lasry; state Treasurer <span class='selected-term'>Sarah Godlewski</span> and Outagamie County Executive Tom Nelson.",
    "author": "SCOTT BAUER",
    "title": "Wisconsin Republican Sen. Ron Johnson will seek reelection"
  },
  {
    "id": 2420,
    "mediaId": 112,
    "date": "1/10/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, who is seeking to become the state's first Black senator; Milwaukee Bucks executive Alex Lasry; state Treasurer <span class='selected-term'>Sarah Godlewski</span> and Outagamie County Executive Tom Nelson.",
    "author": "Associated Press",
    "title": "Wisconsin Republican Ron Johnson to run for re-election to Senate, reversing self-imposed term-limit vow"
  },
  {
    "id": 2416,
    "mediaId": 195,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "An internal poll released by the Barnes campaign on Friday found that the lieutenant governor has a 29-point lead over Milwaukee Bucks executive Alex Lasry and a 30-point lead over Wisconsin Treasurer <span class='selected-term'>Sarah Godlewski</span>.",
    "author": "Mychael Schnell",
    "title": "Booker endorses Mandela Barnes in Wisconsin Senate race"
  },
  {
    "id": 2418,
    "mediaId": 129,
    "date": "1/11/2022 12:00:00 AM",
    "sentence": "Mandela Barnes and State Treasurer <span class='selected-term'>Sarah Godlewski</span>, along with Alex Lasry, an executive with the Milwaukee Bucks, and Tom Nelson, a county executive.",
    "author": "",
    "title": "Nobody's Getting Special Treatment in 2022"
  },
  {
    "id": 2413,
    "mediaId": 195,
    "date": "1/12/2022 12:00:00 AM",
    "sentence": "An internal poll released by the campaign on Friday found that he has a 29-point lead over Milwaukee Bucks executive Alex Lasry and is 30 points ahead of Wisconsin Treasurer <span class='selected-term'>Sarah Godlewski</span>.",
    "author": "Mychael Schnell",
    "title": "Barnes rakes in almost $150K after Johnson enters Wisconsin Senate race"
  },
  {
    "id": 2412,
    "mediaId": 195,
    "date": "1/14/2022 12:00:00 AM",
    "sentence": "Wisconsin state treasurer <span class='selected-term'>Sarah Godlewski</span> blasted Johnson for announcing his reelection bid in the Wall Street Journal, calling it a sign of how much Johnson \"has left Wisconsin and our working families behind.\"",
    "author": "Julia Manchester",
    "title": "Senate Democrats' super PAC releases $1 million ad buy against Ron Johnson"
  },
  {
    "id": 2408,
    "mediaId": 195,
    "date": "1/19/2022 12:00:00 AM",
    "sentence": "Wisconsin Treasurer <span class='selected-term'>Sarah Godlewski</span> and Milwaukee Bucks executive Alex Lasry also raised more than $1 million during the time period, but each donated large sums of money to their campaigns.",
    "author": "Julia Manchester",
    "title": "Barnes raises over $1 million in final quarter of 2021"
  },
  {
    "id": 2409,
    "mediaId": 178,
    "date": "1/19/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, state Treasurer <span class='selected-term'>Sarah Godlewski</span>, Milwaukee Bucks executive Alex Lasry and Outagamie County Executive Tom Nelson.",
    "author": "Associated Press",
    "title": "Democratic Senate candidate files election lawsuits"
  },
  {
    "id": 2406,
    "mediaId": 124,
    "date": "1/20/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, state Treasurer <span class='selected-term'>Sarah Godlewski</span>, Milwaukee Bucks executive Alex Lasry and Tom Nelson, the Outagamie County executive.",
    "author": "",
    "title": "Republicans 'all in' for Ron Johnson's Senate re-election fight in Wisconsin"
  },
  {
    "id": 2398,
    "mediaId": 178,
    "date": "1/25/2022 12:00:00 AM",
    "sentence": "MADISON, Wis.  Democratic U.S. Senate candidate <span class='selected-term'>Sarah Godlewski</span>'s first major policy plan of the campaign released Tuesday focuses on ways to improve life in rural Wisconsin, from bolstering access to health care, helping family farms survive and making broadband internet a public utility.",
    "author": "SCOTT BAUER",
    "title": "US Senate candidate Godlewski unveils rural Wisconsin plan"
  },
  {
    "id": 2396,
    "mediaId": 238,
    "date": "1/26/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion: Sarah Godlewski could be the best chance to rid the Senate of Ron Johnson"
  },
  {
    "id": 2390,
    "mediaId": 238,
    "date": "2/7/2022 12:00:00 AM",
    "sentence": "Democrats have plenty of options, including Milwaukee Bucks executive Alex Lasry and State Treasurer <span class='selected-term'>Sarah Godlewski</span>, who has made her appeal in rural areas a key argument for her campaign.",
    "author": "",
    "title": "Opinion: Democrats cannot afford to blow it in Wisconsin's Senate race"
  },
  {
    "id": 2386,
    "mediaId": 367,
    "date": "2/23/2022 12:00:00 AM",
    "sentence": "Mandela Barnes, state Treasurer <span class='selected-term'>Sarah Godlewski</span>, Outagamie County Executive Tom Nelson and Alex Lasry, on leave from his executive job with the Milwaukee Bucks.",
    "author": "Bill Glauber",
    "title": "Gillian Battino expected to leave Democratic U.S. Senate race and announce run for state treasurer"
  },
  {
    "id": 2378,
    "mediaId": 367,
    "date": "3/2/2022 12:00:00 AM",
    "sentence": "\"We are watching the Wisconsin senate race closely and are always thrilled to see strong women leaders like <span class='selected-term'>Sarah Godlewski</span> consider running in these critical seats,\" said Ben Ray, spokesman for Emily's List, a national group with a significant fundraising apparatus to elect Democratic women candidates.",
    "author": "Bill Glauber",
    "title": "Marquette poll shows Rebecca Kleefisch and Mandela Barnes leading key primary contests"
  },
  {
    "id": 2375,
    "mediaId": 21,
    "date": "3/3/2022 12:00:00 AM",
    "sentence": "",
    "author": "Kayla Epstein",
    "title": "These 9 Senate races hold the key to who will control Joe Biden's agenda after the midterm elections in November"
  },
  {
    "id": 2371,
    "mediaId": 195,
    "date": "3/9/2022 12:00:00 AM",
    "sentence": "State Treasurer <span class='selected-term'>Sarah Godlewski</span> received three percent support, according to the poll.",
    "author": "Julia Manchester",
    "title": "Johnson touts work with Milwaukee faith initiative in new ads"
  },
  {
    "id": 2361,
    "mediaId": 195,
    "date": "3/15/2022 12:00:00 AM",
    "sentence": "Mandela Barnes (D) leading that primary field with 23 percent support, with Milwaukee Bucks executive Alex Lasry trailing at 13 percent support, Outagamie County Executive Tom Nelson garnering five percent support and State Treasurer <span class='selected-term'>Sarah Godlewski</span> three percent.",
    "author": "Julia Manchester",
    "title": "Democratic group runs ad hitting Ron Johnson over Trump 2017 tax bill"
  },
  {
    "id": 2354,
    "mediaId": 124,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Wisconsin state Treasurer <span class='selected-term'>Sarah Godlewski</span> is focusing on drug prices in her new TV ad, criticizing both GOP Sen. Ron Johnson and her fellow Democrats.",
    "author": "",
    "title": "Ketanji Brown Jackson's sleepy confirmation fight finally wakes up"
  },
  {
    "id": 2355,
    "mediaId": 195,
    "date": "3/21/2022 12:00:00 AM",
    "sentence": "Nelson trailed at 5 percent, and Wisconsin state Treasurer <span class='selected-term'>Sarah Godlewski</span> came in at 3 percent support.",
    "author": "Julia Manchester",
    "title": "Marianne Williamson endorses Tom Nelson in Wisconsin Senate race"
  },
  {
    "id": 2349,
    "mediaId": 367,
    "date": "3/24/2022 12:00:00 AM",
    "sentence": "In many ways, Barnes, Milwaukee Bucks executive Alex Lasry, Outagamie County Executive Tom Nelson and state Treasurer <span class='selected-term'>Sarah Godlewski</span> are following the political path Baldwin blazed.",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate contenders in Wisconsin focus on manufacturing"
  },
  {
    "id": 2347,
    "mediaId": 43,
    "date": "3/28/2022 12:00:00 AM",
    "sentence": "Or click below to donate and get involved with the Senate Democrat of your choice and these Wisconsin Democrats campaigns:\nWisconsin Democratic Party\nMinocqua Brewing Company SuperPAC\nTony Evers for Governor\nMandela Barnes for U.S. Senate\n<span class='selected-term'>Sarah Godlewski</span> for U.S. Senate\nTom Nelson for U.S. Senate\nAlex Lasry for U.S. Senate\nJosh Kaul for Attorney General",
    "author": "",
    "title": "Rep. Adam Schiff (D. CA) Helps Wisconsin Democrats Take Down Putin's Favorite Senator"
  },
  {
    "id": 2346,
    "mediaId": 21,
    "date": "3/29/2022 12:00:00 AM",
    "sentence": "His nearest rival was Milwaukee Bucks executive-on-leave Alex Lasry, who received 17% of the vote among primary voters, followed by state Treasurer <span class='selected-term'>Sarah Godlewski</span> at 9% and Outagamie County Executive Tom Nelson at 8%.",
    "author": "John L. Dorman",
    "title": "Wisconsin Lt. Gov. Mandela Barnes has early lead in Democratic Senate primary: poll"
  },
  {
    "id": 2342,
    "mediaId": 43,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "The other three are <span class='selected-term'>Sarah Godlewski</span>, who is the state treasurer, Alex Lasry, who is an executive with the Milwaukee Bucks NBA team and Tom Nelson, who is a county executive from the Northeastern part of this state.",
    "author": "",
    "title": "The Downballot: We open our mailbag and answer your questions! (transcript)"
  },
  {
    "id": 2336,
    "mediaId": 195,
    "date": "4/12/2022 12:00:00 AM",
    "sentence": "Nelson trailed at 5 percent, and Wisconsin state Treasurer <span class='selected-term'>Sarah Godlewski</span> came in at 3 percent support.",
    "author": "Julia Manchester",
    "title": "Barnes posts $1.7M first quarter number in Wisconsin Senate race"
  },
  {
    "id": 2332,
    "mediaId": 238,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "",
    "author": "",
    "title": "Opinion: Democrats must make a strategic choice in Wisconsin's Senate race"
  },
  {
    "id": 2335,
    "mediaId": 367,
    "date": "4/13/2022 12:00:00 AM",
    "sentence": "More:Democratic U.S. Senate candidate Mandela Barnes opposes Biden administration's plan to lift Title 42 rule at the border\nMore:Democratic U.S. Senate candidate <span class='selected-term'>Sarah Godlewski</span> issues 'Cut Costs Plan,' calls for suspension of federal gas tax",
    "author": "Bill Glauber",
    "title": "Democratic U.S. Senate contender Alex Lasry vows to 'bring more jobs and investment back to rural Wisconsin'"
  },
  {
    "id": 2330,
    "mediaId": 367,
    "date": "4/14/2022 12:00:00 AM",
    "sentence": "Milwaukee Bucks executive Alex Lasry poured $3.45 million into his campaign in the first three months of the year, while state Treasurer <span class='selected-term'>Sarah Godlewski</span> added $1.5 million to her campaign, according to statements issued Thursday.",
    "author": "Bill Glauber",
    "title": "Bucks executive Alex Lasry, Wisconsin Treasurer Sarah Godlewski spend big in Democratic U.S. Senate race"
  },
  {
    "id": 2321,
    "mediaId": 195,
    "date": "4/15/2022 12:00:00 AM",
    "sentence": "State Treasurer <span class='selected-term'>Sarah Godlewski</span>'s campaign said it brought in $2.1 million during the first quarter.",
    "author": "Julia Manchester",
    "title": "Johnson raises $7.1 million in first quarter"
  },
  {
    "id": 2314,
    "mediaId": 147,
    "date": "4/17/2022 12:00:00 AM",
    "sentence": "",
    "author": "Scott Bauer",
    "title": "Wisconsin Democrats search for strategy to unseat GOP Sen. Ron Johnson"
  },
  {
    "id": 2312,
    "mediaId": 151,
    "date": "4/18/2022 12:00:00 AM",
    "sentence": "Until there is a plan, for the safety of our citizens and those seeking asylum, they should not lift it,? said Wisconsin state Treasurer <span class='selected-term'>Sarah Godlewski</span>, who is running for the Democratic Senate nomination.",
    "author": "",
    "title": "More Dem Senate hopefuls split with Biden on border"
  },
  {
    "id": 2304,
    "mediaId": 195,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "State Treasurer <span class='selected-term'>Sarah Godlewski</span> falls in third with 7 percent, and Outagamie County Executive Tom Nelson rounds out the top four with 5 percent.",
    "author": "Tal Axelrod",
    "title": "Democratic Senate primary tightening in Wisconsin: poll"
  },
  {
    "id": 2306,
    "mediaId": 367,
    "date": "4/27/2022 12:00:00 AM",
    "sentence": "Mandela Barnes was the choice of 19% while Milwaukee Bucks executive Alex Lasry was at 16%, with state Treasurer <span class='selected-term'>Sarah Godlewski</span> at 7% and Outagamie County Executive Tom Nelson at 5%.",
    "author": "Bill Glauber",
    "title": "Marquette Poll shows Mandela Barnes, Alex Lasry in tight Democratic U.S. Senate race in Wisconsin"
  },
  {
    "id": 2302,
    "mediaId": 238,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "State treasurer <span class='selected-term'>Sarah Godlewski</span> has more than doubled her share, now taking 7 percent, while populist Tom Nelson holds steady at 5 percent.",
    "author": "",
    "title": "Opinion The Wisconsin GOP is stuck with Ron Johnson. Democrats could pick a winner."
  },
  {
    "id": 2303,
    "mediaId": 151,
    "date": "4/28/2022 12:00:00 AM",
    "sentence": "Nineteen percent backed Barnes, while Milwaukee Bucks executive Alex Lasry received 16 percent and state treasurer <span class='selected-term'>Sarah Godlewski</span> won 7 percent.",
    "author": "",
    "title": "Pro-Bernie group endorses in key Dem Senate primary"
  },
  {
    "id": 2301,
    "mediaId": 367,
    "date": "4/29/2022 12:00:00 AM",
    "sentence": "Mandela Barnes was the choice of 19% while Milwaukee Bucks executive Alex Lasry was at 16%, with state Treasurer <span class='selected-term'>Sarah Godlewski</span> at 7% and Outagamie County Executive Tom Nelson at 5%.",
    "author": "Bill Glauber",
    "title": "Wisconsin U.S. Senate election updates: Tom Nelson claims endorsement from Bernie Sanders-linked Our Wisconsin Revolution"
  },
  {
    "id": 2298,
    "mediaId": 237,
    "date": "5/2/2022 12:00:00 AM",
    "sentence": "Among the candidates are Mandela Barnes, the current lieutenant governor; Alex Lasry, son to a part-owner of the Milwaukee Bucks; <span class='selected-term'>Sarah Godlewski</span>, current state treasurer; and Tom Nelson, current Outagamie County executive.",
    "author": "Salena Zito",
    "title": "The tea leaves in Wisconsin look promising for Republicans"
  },
  {
    "id": 2292,
    "mediaId": 238,
    "date": "5/3/2022 12:00:00 AM",
    "sentence": "And as Barnes has lost his lead and Lasry has caught up, state treasurer <span class='selected-term'>Sarah Godlewski</span>  also presenting herself as a center-left Democrat  has more than doubled her numbers, rising to 7 percent in the most recent poll.",
    "author": "",
    "title": "Opinion A Ron Johnson challenger asks: What if Wisconsin actually had two senators?"
  },
  {
    "id": 2288,
    "mediaId": 43,
    "date": "5/7/2022 12:00:00 AM",
    "sentence": "Click below to donate and get involved with the Wisconsin Democrat of your choice and these Wisconsin Democrats campaigns:\nWisconsin Democratic Party\nMinocqua Brewing Company SuperPAC\nTony Evers for Governor\nMandela Barnes for U.S. Senate\n<span class='selected-term'>Sarah Godlewski</span> for U.S. Senate\nTom Nelson for U.S. Senate\nAlex Lasry for U.S. Senate\nJosh Kaul for Attorney General",
    "author": "",
    "title": "Admits He's Waging \"Guerilla War\" Against The Medical Establishment"
  }
]