{
  "id": 13593,
  "mediaId": 8475,
  "date": "2022-03-15",
  "headline": "Arizona state senators block a dozen GOP-sponsored election reform bills",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/031522_maricopa-county-election-pool.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/031522_election_reform_bills/arizona-state-senators-block-dozen-gop-sponsored-election-reform-bills/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael McDaniel",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110078",
  "termIds": [
    0
  ],
  "sentences": [
    "Boyer, like Ugenti-Rita, has drawn harsh criticism from the pro-Trump GOP base in Arizona after he voted against holding the Maricopa Board of Supervisors in contempt for not responding promptly to the state Senate's subpoena regarding the 2020 presidential election.",
    "The Arizona Senate blocked a sweeping slate of GOP-sponsored election reform bills Monday that many state Republicans claimed would have addressed concerns of election integrity, following the state's audit of the 2020 presidential election.",
    "“A lot of effort has gone in to these election bills ... Everyone working together to try to improve the election system in order to increase voter confidence because right now voter confidence is on the floor,\" Townsend said.",
    "Both have pushed back against claims from many of their colleagues that Joe's Biden 2020 presidential election was fraudulent, and they have received harsh criticism from the Arizona GOP as a result.",
    "Some of Townsend’s other bills are 1457 and 1465, which would add voting tabulation requirements to the secretary of state’s duties, as a response some of the findings to the audit of 2020.",
    "With over 100 election bills proposed in the current legislative session, GOP lawmakers are still optimistic that similar bills will find their way to Republican Governor Doug Ducey's desk.",
    "\"I do have some major concerns with this bill and I have a major concern about what we're doing today,\" Ugenti-Rita said, explaining her vote against Senate Bill 1570.",
    "But while we're at it, I do have an extra spare copy of Dale Carnegie for my senators from District 5 and 16 that I'd be happy to pass along with that; I vote no.\"",
    "The comment highlights political divides in the state GOP, as more moderate Republicans like Boyer and Ugenti-Rita separate from their legislative positions.",
    "The GOP-dissenters of the bills were state Senators Michelle Ugenti-Rita, a Republican from Scottsdale, and Paul Boyer, a Republican from Glendale.",
    "After being mentioned twice as \"the senator from legislative district 20,\" State Senator Paul Boyer later explained his vote on one of the bills.",
    "\"If anyone is casting a vote because they want to retaliate, if anyone is casting a vote out of vindictiveness, this is my bill,\" Townsend said.",
    "During the session, election bill sponsors pleaded with their dissenting Republican colleagues to explain their vote in a bid of negotiation.",
    "State Senator Kelly Townsend, a Republican from Mesa and leader of the audit, was the primary sponsor of 10 of the 12 reform bills Monday.",
    "A misplaced ballot would be a Class 2 misdemeanor under SB 1056, and any duplicate ballots would be cataloged for analysis under SB 1577.",
    "The surprising result came after sponsors and committees spent weeks amending and prepping the bills for their final Senate read.",
    "The bill would have prevented some voting equipment from being connected to the internet, in a bid to safeguard against hacking.",
    "\"I have never seen this amount of bills for one section of law come up over the course of a few days and just be allowed to die.",
    "Boyer, who is not running for reelection, cites increasing toxicity at the Capitol as his motivation for calling it quits.",
    "Boyer's \"Dale Carnegie\" reference is an apparent nod to his best-selling book \"How to Win Friends and Influence People.\"",
    "But she came under fire in 2021 because she objected to the handling of the audit, claiming it was botched on Twitter.",
    "Twelve election reform bills failed to pass the Republican-controlled Senate due to nay votes from two Republicans.",
    "Ugenti-Rita, who is running this year for secretary of state, is a proclaimed proponent of election integrity.",
    "At a Turning Point Action rally in 2021, Ugenti-Rita was booed off the stage following her July twitter post.",
    "Townsend sponsored Senate Bills 1056 and 1577, which deal with ballots, custody and record keeping.",
    "\"My name has been — at least my district has been brought up twice now,\" Boyer said.",
    "And honestly, I think that there's an agenda behind it and I find it inappropriate.\"",
    "Thanks to our donors and sponsors for their support of local independent reporting.",
    "She expressed her disappointment in the sweeping dissent, claiming it was personal.",
    "She said the pushback felt like it was about \"retaliation\" rather than policy.",
    "Support TucsonSentinel.com today, because a smarter Tucson is a better Tucson.",
    "\"Thank you and if you're killing this bill to hurt me, you're not hurting me.",
    "Join Katherine Gregg, Jan Lesher, and Steve Alley and contribute today!",
    "This is a very simple bill, and it's a very simple problem.",
    "The reason why I oppose this bill is it's not workable.",
    "That is not how we do things,\" Ugenti-Rita said.",
    "I don't think it's fair to the other members.",
    "And so that's why I'm voting no on this bill.",
    "\"I don't think it's fair to the sponsors.",
    "I think that's poor leadership.",
    "\"I felt I should say something.",
    "Counties can't implement this.",
    "I've been here for 11 years.",
    "You're hurting Arizona.\"",
    "It's that simple.",
    "- 30 -"
  ]
}