{
  "id": 16030,
  "mediaId": 8347,
  "date": "2022-03-07",
  "headline": "Arizona Senate bill allows deadly force for property damage",
  "image": "https://ewscripps.brightspotcdn.com/dims4/default/6aea9b0/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=http%3A%2F%2Fewscripps-brightspot.s3.amazonaws.com%2F8a%2F7a%2F9b35c9544028b9f0d697025ea94e%2Fmichelle-ugenti-rita.jpg",
  "link": "https://www.kgun9.com/news/local-news/arizona-senate-bill-allows-deadly-force-for-property-damage",
  "mediaOutlet": "kgun9.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.kgun9.com/associated-press",
  "termIds": [
    0
  ],
  "sentences": [
    "A bill sponsored by Ugenti-Rita set for a vote Monday, March 7, 2022, would allow business owners or their employees to use deadly force to defend their property against smash-and-grab robbers if the robber possessed a dangerous weapon.",
    "(AP Photo/Bob Christie, File)\nPHOENIX (AP) — An Arizona Senate bill would allow business owners or their employees to use deadly force to defend their property against smash-and-grab robbers if the robber possessed a dangerous weapon.",
    "But critics of the proposal from Scottsdale Sen. Michelle Ugenti-Rita say it is so broadly written that it would allow someone to be killed just for scrawling graffiti while having something that might be deemed a weapon.",
    "But critics of the proposal say the legislation is so broadly written that it would allow someone to shoot and kill someone just for scrawling graffiti on a wall while having something that might be deemed a weapon.",
    "But she pointed to limits in her proposal that said the person had to possess a “deadly instrument” at the time they were “knowingly” defacing or damaging someone's property.",
    "FILE - In this Jan. 31, 2017 photo, is then-Arizona state Rep. Michelle Ugenti-Rita, during a legislative session at the Capitol in Phoenix.",
    "----\nSTAY IN TOUCH WITH US ANYTIME, ANYWHERE\nCopyright 2022 Scripps Media, Inc. All rights reserved.",
    "This material may not be published, broadcast, rewritten, or redistributed.",
    "Ugenti-Rita acknowledged during a committee hearing that that was possible.",
    "Her bill is set for a Senate vote Monday."
  ]
}