{
  "id": 17338,
  "mediaId": 8475,
  "date": "2022-02-28",
  "headline": "Az Senate approves $150M in tax credits for film producers",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/022822_tucson_city_hall_movies.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/arts/report/022822_az_film_tax_bill/az-senate-approves-150m-tax-credits-film-producers/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gloria Gomez",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/110050",
  "termIds": [
    5685,
    2487,
    2616,
    1489,
    1477,
    6224,
    5949,
    6572
  ],
  "sentences": [
    "Senate Bill 1708 would create the Arizona Motion Picture Production Program, which would hand out up to $150 million in individual and corporate tax credits each year for movie projects produced in Arizona or that use a local production facility.",
    "Arizona landscapes would have a better chance of ending up on the silver screen under a legislative proposal to lure production companies to the Grand Canyon State with $150 million in tax credits that the Senate has approved.",
    "Opponents say spending money to attract film companies from regions with infrastructure developed and established over decades makes little economic sense, and that there isn’t a return on investment for the state.",
    "They say the benefits include construction of filming locations and hotels to meet new demand, hiring locals, keeping production jobs in-state, and attracting out-of-state tourists and industry professionals.",
    "Some legislative supporters said filming in Arizona would serve as a magnet for tourists following the path of star-studded movie projects who would invariably stop over at interesting Arizona sights.",
    "Critics counter that the tax credits would be a waste of money that wouldn’t create permanent or high-paying jobs, and would amount to the government choosing Hollywood over small Arizona businesses.",
    "A 2009 report by the Arizona Department of Commerce on film industry tax credits found that only $2.3 million was gained the previous year, in comparison to $8.6 million spent by the program.",
    "“The last thing we should be doing is passing out other people’s money to incentivize a trillion-dollar industry that has no barriers to entry in this state,” Ugenti-Rita said.",
    "A 2000 Michigan State University analysis of tax credit incentives in Michigan found that locals were generally hired for the duration of the shoot, which averaged 23 days.",
    "A film project could receive a credit for up to 27.5% of production costs if the company spends more than $35 million in Arizona and meets a bevy of other requirements.",
    "Still, film production companies have embraced the bill and showed up to support it when the Senate Appropriations Committee, which Gowan chairs, debated the proposal.",
    "To qualify for funding, film projects must either use an Arizona studio or produce and film the project primarily in Arizona and do the editing at an in-state studio.",
    "Just last year, a House proposal to offer production companies with tax reimbursements for everything from hotel rentals to catering services was killed in committee.",
    "The bill’s sponsor, Sen. David Gowan, R-Sierra Vista, took affront to Petersen’s accusation that he championed the bill at the behest of the film industry.",
    "In addition, full-time production labor positions — camera operators, technicians, and sound and editing workers, among others — must be kept in-state.",
    "New Mexico has a refundable tax credit up to 35% of production costs, while California budgets up to $330 million a year to help eligible projects.",
    "The massive loss to the state general fund of more than $6.3 million, which was a large part of the reason the credit program was shut down.",
    "The UA School of Journalism started the fellowship in 1977 to honor Don Bolles, an Arizona Republic reporter killed in a 1976 car bombing.",
    "The Gilbert Republican questioned whether the bill was the result of negotiations with Hollywood executives throwing their weight around.",
    "Arizona has done nothing to prevent the film industry from choosing to film in the state, and yet they haven’t arrived, she said.",
    "Film projects hire hundreds of helping hands, and service and construction industry growth follows to accommodate their needs.",
    "Trying to use financial bait to lure movie producers to Arizona is unnecessary, said Sen. Michelle Ugenti-Rita, R-Scottsdale.",
    "The Arizona Motion Picture Production and Infrastructure Credit awarded $22.5 million between 2005 and 2010 to 56 projects.",
    "He said he received several entreaties from Arizonans employed in the film industry who were tired of leaving home to work.",
    "But any such gains won’t outweigh the costs, said Sen. Warren Petersen, who vehemently opposed taxpayers footing the bill.",
    "Let’s leave the money in the pockets of our taxpayers, because taxpayers know how to use their money best,” he said.",
    "Sen. Christine Marsh, D-Paradise Valley, said her own family was not immune to seeing such sights while traveling.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "A metro area of nearly 1 million deserves a vital & sustainable source of news that's independent and locally run.",
    "“This is a shift from small business owners — people working their butts off — to super wealthy people,” he said.",
    "The jobs they create are often short-term and low-paying, she said, not the jobs that Arizona should be chasing.",
    "California and New Mexico are among the top film locations because they have versatile landscapes, she claimed.",
    "Gloria Gomez is a senior at the University of Arizona and the 2022 UA School of Journalism’s Don Bolles Fellow.",
    "She recalled the success of Old Tucson Studios in drawing tourists who would eventually visit other sights.",
    "“You have to have infrastructure done here, have to have the jobs here, you have to produce the film here.",
    "The bill is the latest attempt to revive a film tax credit program that ended more than a decade ago.",
    "“(They) were visiting the state of Arizona and found even more riches, besides the film industry.",
    "Most high-paying jobs are imported: experts travel from movie hubs like California or New York.",
    "Sahuarita Democratic Sen. Rosanna Gabaldon agreed, saying Arizona has a lot to offer tourists.",
    "The same report estimated that 62% of film company budgets were spent outside the state.",
    "They cannot move off anywhere else out of this state and receive this aid,” he promised.",
    "He assured fellow legislators that taxpayers are protected by the bill’s many caveats.",
    "Movies that include on-site filming would be required to primarily film in the state.",
    "Ugenti-Rita disputed the idea that movie productions would contribute to job growth.",
    "Petersen argued that incentivizing powerful industries disadvantages smaller ones.",
    "They were able to go to the Arizona trail or the Grand Canyon,” she said.",
    "It next goes to the state House of Representatives for consideration.",
    "Proponents argue it will foster jobs, infrastructure and tourism.",
    "Concerned about keeping quality reporting alive in Tucson?",
    "Concerned about keeping quality reporting alive in Tucson?",
    "In fact, both states offer their own tax credit programs.",
    "Support TucsonSentinel.com with a contribution today!",
    "Support TucsonSentinel.com with a contribution today!",
    "Job creation is guaranteed by this bill, Gowan said.",
    "SB1708 passed the Senate on a bipartisan 21-7 vote.",
    "“This is just a totally bogus thing.",
    "- 30 -"
  ]
}