{
  "id": 1744,
  "mediaId": 8475,
  "date": "2022-02-17",
  "headline": "Republicans give tentative approval to banning Chinese communists from owning land in Arizona",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/CPCflag.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/021722_land_ban/republicans-give-tentative-approval-banning-chinese-communists-from-owning-land-arizona/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jerod MacDonald-Evoy",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/65775",
  "termIds": [
    0
  ],
  "sentences": [
    "Still, he voted for the bill, saying he is \"curious to see where this is going to go..\nUgenti-Rita said that while she doesn't support the communist party and it's actions, she didn't see how the bill could be enforced — and banning people based on party registration troubled her.",
    "Sen. David Livingston, R-Peoria, compared being a CCP member to being an \"active duty military person..\n\"This is a formal initiation requirement for life that, if you break the rules, not only is your life at risk, your family is,\" Livingston said.",
    "Rogers told the committee that the bill is inspired by similar legislation in Texas, which prohibits businesses from multiple countries, including China, Iran, North Korea and Russia, from accessing that state's electrical grid.",
    "Many jobs in China are connected with party membership, and while there are reports of people joining the party in the hopes of better job prospects, some have found they still have not had greater opportunities.",
    "Senate staffers were also unable to provide evidence to the committee that the Chinese Communisty Party actually owns any property in the state, but said they would bring that information back to the committee.",
    "The same prohibition would apply to all \"members\" of the party that controls China, though her proposal does not define what that term means and that vagueness could ultimately sink the proposal.",
    "But unlike the Texas law, which prohibited countries such as China from having access to critical infrastructure, Rogers' Senate Bill 1342 focuses solely on land ownership by the CCP.",
    "\"Parts of this bill sound a little like WWII, where we are flagging people based on party affiliation,\" Sen. Tyler Pace, R-Mesa said, adding that he didn't see any need for the bill.",
    "Flagstaff Republican Wendy Rogers wants to change Arizona law to declare that the CCP \"may not own real property\" in the state, and any deed the CCP currently has is deemed invalid.",
    "According to the party itself, it has over 95 million members, which would make it the second largest political party in the world behind India's Bharatiya Janata Party.",
    "Sen. Michelle Ugenti-Rita, R-Scottsdale, said she believed there needs to be a distinction between a CCP member and the government owning property in Rogers' bill.",
    "A Republican bill passed in committee Wednesday would ban the Chinese Communist Party and \"its members\" from owning any real estate in Arizona.",
    "\"I struggle because I don't like just thoughts in a bill that are not mature enough,\" Ugenti-Rita said before voting yes on the bill.",
    "Senators expressed concern over extending the measure to include \"members\" of the CCP, and wondered how that would be enforced.",
    "The legislation was in reaction to a Chinese billionaire who purchased land to build a wind farm near Laughlin Air Force Base.",
    "However, not all her colleagues agreed that there is always a distinction between party membership and the government.",
    "\"If you are upwardly mobile in China, you have to be in the party,\" Rogers told the committee.",
    "Support high-quality local journalism and help underwrite independent news without the spin.",
    "\"I'm not exactly sure how that is verified,\" Senate Commerce Chair J.D.",
    "And once joining, it is often difficult to leave.",
    "\"Let's take the ride, let's see where it goes.\"",
    "Mesnard, R-Chandler, said of CCP membership.",
    "- 30 -\n1 comment on this story",
    "Like what you're reading?"
  ]
}