{
  "id": 175,
  "mediaId": 2679,
  "date": "2022-02-21",
  "headline": "Arizona Senate waives school spending cap, averts crisis",
  "image": "",
  "link": "https://www.seattletimes.com/nation-world/nation/arizona-senate-waives-school-spending-cap-averts-crisis/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all",
  "mediaOutlet": "Seattle Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "BOB CHRISTIE",
  "authorUrl": "https://www.seattletimes.com/author/bob-christie/",
  "termIds": [
    0
  ],
  "sentences": [
    "We just need to figure out how to make that work for all the adults.”\nRepublican Sen. Vince Leach of Tucson was one GOP member who opposed the measure, railing against public school supporters giving his party no credit for the big boost in school funding they have received in recent years and school boards requiring students to wear masks to limit COVID-19 exposure.",
    "“20 by 2020 occurred because of the dissension of 70,000 red T-shirted parents and teachers and allies that came and fought for public education funding.”\nDemocrats called the delay in passing the spending cap waive a manufactured crisis that put unneeded pressure on teachers and parents who are already stressed after two years of coronavirus restrictions.",
    "But Democratic Minority Leader Sen. Rebecca Rios pushed back on that narrative, noting that GOP lawmakers and Ducey had offered just a 2% raise in 2018 and did not willingly offer their “20 by 2020 plan.” Instead, it was the result of a statewide teacher strike that closed schools and flooded the Capitol with teachers demanding livable wages.",
    "Republicans have been leery of approving the waiver of the aggregate spending limit for fears it could breathe life into Proposition 208, the 2020 voter-approved tax on the wealthy that the state Supreme Court ruled in August was unconstitutional if it put spending over the cap.",
    "Advertising\n Skip Ad\n“So here we are, feeding the beast, more money, more money, in my opinion capitulating to the educational terrorists who have held our kids hostage,” Sen. Michelle Ugenti-Rita said, blaming local schools for their COVID restrictions.",
    "“Back then in ’80 we had schoolbooks and chalkboards and all kinds of things that didn’t cost near as much.”\n___\nThis story has been corrected to show the Legislature allowed school to spend $1.154 billion, not $1.54 billion.",
    "A special sales tax dedicated to schools is also being counted under the cap for the first time because the Legislature extended voter-approved Proposition 301 but for the first time allowed its spending to be counted.",
    "Advertising\n Skip AdSkip AdSkip Ad\nThat enrollment figure is based on the previous years’ attendance, and last year enrollment dipped precipitously as parents pulled their kids out of school because of COVID-19.",
    "PHOENIX (AP) — The Arizona Senate on Monday joined the House in voting to waive a constitutional cap on K-12 school spending that threatened to shut down public campuses across the state.",
    "Schools would have exceeded the spending limit on March 1 and would have had to quickly plan for cutbacks that could have included closures or layoffs if the Legislature had not acted.",
    "A trial court judge is considering whether that would be the case, but has delayed issuing what opponents of the tax say is a certain ruling that the new revenue would exceed the cap.",
    "“They want to fund kids to make sure that they have a good education.”\nLeach noted the 20% raise teachers were awarded between 2018 and 2020, noting it was a Republican proposal.",
    "The House voted 45-14 last Tuesday to give schools the ability to spend $1.154 billion appropriated last year that would have put them over the constitutional spending limit.",
    "The school spending cap was enacted in 1980 as part of a wave of proposed laws the Legislature asked voters to approve to limit taxes and government spending.",
    "“When this was set in 1980 we didn’t have Chrome tablets or whiteboards or any of the stuff that we have now that teaches our kids,” Fann said.",
    "Some Republicans still voted against the measure that allows schools to spend money lawmakers already appropriated for the current budget year.",
    "Advertising\n Skip AdSkip AdSkip Ad\n“My parents, my constituents, want to fund kids, not buildings, not institutions,” Leach said.",
    "“I feel compelled to correct the record — 20 by 2020 was not the brainchild of public-school-supporting Republicans,” Rios said.",
    "Monday’s 23-6 Senate vote gave the measure the needed two-thirds majority in both chambers and goes into effect immediately.",
    "House Speaker Rusty Bowers and Fann recently asked the Supreme Court to step in and kill Proposition 208 for good.",
    "Republican Senate President Karen Fann spent the past week wrangling the votes from members of her caucus.",
    "The vote came after some majority Republicans who had withheld their support signed onto the measure.",
    "It is adjusted each year to take into account inflation and the number of students who are enrolled.",
    "The spending cap does not affect public charter schools, which educate about 240,000 K-12 students.",
    "“There’s one thing we can all agree on regardless of which side of the aisle we are,” she said.",
    "All 28 Democrats present voted for the waiver, but 14 of 31 Republican House members voted no.",
    "Another Republican opponent of the increase lashed out at local schools boards.",
    "Fann said the 1980 law needs to be reexamined, and she wants it done this year.",
    "He pushed to provide school vouchers to all students in the state.",
    "About 880,000 students would have been affected.",
    "It does not need to be signed by Republican Gov.",
    "The court has not yet acted on that request.",
    "“We love our kids, and our kids come first.",
    "All six no votes were from GOP lawmakers.",
    "BOB CHRISTIE",
    "Doug Ducey."
  ]
}