{
  "id": 2800,
  "mediaId": 8475,
  "date": "2022-01-28",
  "headline": "Push to repeal English-only education appears abandoned in 2022",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/espanol-blackboard-chalk_1.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/012822_english_only_repeal/push-repeal-english-only-education-appears-abandoned-2022/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Gómez",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "As a result of the voter-approved law, all English learners — students who have a home language other than English — are placed in English-only classrooms and can't be taught in their home language, effectively shutting them out of bilingual education programs.",
    "\"We anticipate that no Republican would want to sponsor that legislation in an election year, and there's other issues that might make their constituents think twice about the English-only repeal if there is a tuition equity piece on the ballot, too.\"",
    "After three consecutive years of Republican lawmakers championing a proposal to repeal the decades-old law that prohibits bilingual education for English-language learners in Arizona, it appears the effort won't get a push this legislative session.",
    "Salazar said the group still supports the repeal, but instead is focusing its resources this year on making sure lawmakers don't undo last year's successful passage of the ballot referral to lift the in-state tuition ban for undocumented students.",
    "This session, no Republican has yet taken up the cause of repealing the English-only law, and a key advocacy group that has lobbied to get the English-only repeal before voters is no longer pushing to get lawmakers to take up the issue.",
    "Sen. Michelle Ugenti-Rita, R-Scottsdale, wants to block voters from choosing to repeal a state law prohibiting undocumented students from accessing in-state tuition at public universities and community colleges.",
    "Democrats Rep. Diego Espinoza and Sen. Martin Quezada have sponsored legislation to repeal the restrictions on bilingual education, but measures introduced by Democrats rarely are considered by the GOP majority.",
    "Since 2019, Rep. John Fillmore, an Apache Junction Republican, has backed measures allowing voters to repeal Arizona's English-only model, which was established by Proposition 203 in 2000.",
    "UnidosUS, the largest Latino advocacy group in the nation, isn't lobbying lawmakers to get the measure through the legislature, said Liz Salazar, a policy advisor for UnidosUS.",
    "Fillmore's ballot referral proposals have advanced in recent years with broad support from his GOP colleagues and Democrats, but each time failed to win final approval.",
    "Arizona is the only state in the nation with the restrictive education law, state Superintendent of Public Instruction Kathy Hoffman wrote in a 2019 opinion piece.",
    "And Republican Sen. T.J. Shope of Coolidge also sponsored an identical measure that passed the Senate with 27 Republicans and Democrats favoring the measure.",
    "If you're already supporting us, please encourage your friends, neighbors, colleagues and customers to help support quality local independent journalism.",
    "In 2019, the English-only repeal was approved by committees in both chambers but didn't get scheduled to receive a final formal vote in the Senate.",
    "In 2020, Fillmore's proposal cleared the Education Committee with unanimous support but a Republican lawmaker held it in the Rules Committee.",
    "The Department of Education, education advocacy groups and other nonprofits have backed the English-only repeal in recent years.",
    "According to the Arizona Department of Education's latest enrollment data, 45% of students in Arizona schools are Latino.",
    "The deadline for lawmakers to introduce bills is coming up: for the Senate it's Feb. 1, and for the House it's Feb. 7.",
    "UnidosUS is also focusing on advocating for other education issues, such as increasing funding for public schools.",
    "TucsonSentinel.com relies on contributions from our readers to support our reporting on Tucson's civic affairs.",
    "\"We didn't think this would be the year that (the English-only repeal) will make it through,\" Salazar said.",
    "There are about 78,600 students who are classified as English learners in the state, according to ADE data.",
    "\"It's going to get prickly trying to make sure the tuition equity stays on the ballot,\" Salazar said.",
    "The Arizona Constitution bars the legislature from repealing voter-approved laws.",
    "A 2019 poll showed voters would favor repealing the English-only law.",
    "To change this framework, voters have to repeal parts of Prop.",
    "Last year, Fillmore's English-only repeal passed the House.",
    "Donate to TucsonSentinel.com today!",
    "- 30 -",
    "203."
  ]
}