{
  "id": 2898,
  "mediaId": 8476,
  "date": "2022-01-28",
  "headline": "Move to Limit Gubernatorial Emergency Powers, Sparked by COVID-19, Advances",
  "image": "https://media1.fdncms.com/tucsonweekly/imager/u/slideshow/31895086/ducey.jpg",
  "link": "https://www.tucsonweekly.com/tucson/move-to-limit-gubernatorial-emergency-powers-sparked-by-covid-19-advances/Content?oid=31894912",
  "mediaOutlet": "tucsonweekly.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gloria Gomez",
  "authorUrl": "https://www.tucsonweekly.com/author/gloria-gomez-ua-don-bolles-fellow",
  "termIds": [
    0
  ],
  "sentences": [
    "“I don’t think many businesses can live past 120 days,” he said, “The government shouldn’t have authority or the right to shut down somebody’s business.”\nThose who were concerned with protecting themselves from COVID-19 are perfectly able to do so without emergency orders that limit normal business operations, he said.",
    "Last year a bill was passed that restricted the power of cities, counties and school boards to implement orders related to COVID-19, like mask mandates, but the Arizona School Board Association successfully challenged it in court.",
    "Sen. Michelle Ugenti-Rita, R-Scottsdale, who introduced the bill and worked on it with Ducey’s support, said that passing it was imperative, given that it was impossible to predict who could become governor next.",
    "Sen. Martin Quezada, D-Glendale, said the bill wasn’t about the current existing emergency order, but about future public health crises — and it would harm how effectively future governors may be able to respond.",
    "New legislation that limits the power of future Arizona governors to declare a public health emergency has passed the Senate Government Committee with a slim margin and now awaits debate by the full Senate.",
    "After more speakers brought up their frustrations with the current state of emergency, Chairwoman Kelly Townsend, R-San Tan Valley, noted that the governor was just as eager to rescind the emergency state.",
    "“We are in a pandemic,” she pointed out, prompting raucous laughter from the audience, which was filled with conservatives there to champion a host of bills aimed at combating non-existent election fraud.",
    "Golec is both anti-mask and anti-vaccine, and has spread false claims on her Facebook page that countries with high mortality rates have more deaths because of the large number of vaccinated people.",
    "The last legislative session failed in this respect, she said.The benefit of SB1009 is that it would require the legislature to approve an extended state of emergency in the event it was warranted.",
    "Ugenti-Rita included the language in the annual budget last session, but the Arizona Supreme Court struck it down as one of dozens of measures that was unconstitutionally added to the budget.",
    "The indefinite length afforded by current statute is better than what SB1009 offers, Quezada said, because it gives governors ample time to coordinate efforts to enact change.",
    "Tucson Democratic Senator Sally Ann Gonzales responded to this by lauding Tucson Mayor Regina Romero’s efforts to protect her constituents and voicing opposition to the bill.",
    "Citizens should have lawmakers develop policy on their behalf, not be subject to the decisions of one person, as happens with executive orders.",
    "Arizona Mirror is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "“I’m definitely in favor of this bill to no longer hold us hostage in this state under emergency use authorization,” said Golec, of SB1009.",
    "Ducey has issued executive orders to monitor COVID-19 spread, increase funding for businesses and expand access to vaccines, among others.",
    "Gail Golec, a known conspiracy theorist currently running for the Maricopa Board of Supervisors in District 2 said she supported the bill.",
    "Senate Bill 1009 caps a governor’s state of emergency proclamation for reasons of public health to 120 days, and only 30 days at a time.",
    "Gonzales rebutted Townsend’s claims that Ducey wants to end the state of emergency by questioning why he hasn’t done it if so.",
    "State of emergency declarations allow governors to take direct control of local and state agencies and access emergency funds.",
    "Without declaring a state of emergency, she said, the state would not have received the federal funds it has been able to.",
    "I wasn’t prepared for how these were going to be weaponized to subvert our process here at the legislature,” she said.",
    "Emergency declarations, she said, come with multiple executive orders that aren’t enacted with legislative agreement.",
    "She cited the smallpox epidemic as an example of a real emergency, which had a mortality rate estimated at about 30%.",
    "He objected to the 120 day limit as still too long to permit a governor’s state of emergency to remain uncontested.",
    "If we rescind the emergency order as it stands right now, (cities and towns) can enact their own,” said Townsend.",
    "“It’s not about politics, it’s not about partisanship, it’s about the health of the people,” Townsend said.",
    "SB1009 and several other bills on the docket about election security brought a crowd to the hearing room.",
    "Ducey is keeping it in place to prevent cities and towns from implementing their own emergency orders.",
    "After the 120 days are up, the proclamation is terminated unless the legislature decides to extend it.",
    "Townsend cast her vote after acknowledging the constitutional guarantee of representative government.",
    "Those legislative extensions could happen indefinitely, but also in 30-day increments.",
    "This article originally appeared in Arizona Mirror, a non profit organization.",
    "Arizona received more than $2 trillion in funding from the federal CARES Act.",
    "Arizona has been in a state of emergency due to COVID-19 since March 2020.",
    "More recently, they have been used to enact mask mandates or quarantines.",
    "“As we’ve seen, Tucson uses a heavy hand when it comes to these things.",
    "SB1009 passed 4-3, with Republicans supporting and Democrats opposing.",
    "At last count, COVID-19 deaths in Arizona number at more than 25,000.",
    "For Sen. Warren Petersen, R-Gilbert, the bill doesn’t go far enough.",
    "Nationally, more than 868,000 people have died of the illness.",
    "Contact Editor Jim Small for questions: info@azmirror.com.",
    "The audience cheered and clapped as Petersen concluded.",
    "Maricopa County alone was allocated $399 million.",
    "“(Emergency) powers have been misused and abused.",
    "Arizona Mirror maintains editorial independence.",
    "Follow Arizona Mirror on Facebook and Twitter.",
    "COVID-19 doesn’t compare, Townsend said."
  ]
}