{
  "id": 376,
  "mediaId": 2520,
  "date": "2022-02-22",
  "headline": "What's behind Republican Matt Salmon's venomous attack on Arizona teachers?",
  "image": "https://www.gannett-cdn.com/-mm-/fa6e1b8a2428e31a2e889edb7dcee4e216d73696/c=0-39-2737-1585/local/-/media/2016/07/06/Phoenix/Phoenix/636034097053628414-mattsalmon.jpg?width=2737&height=1546&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.azcentral.com/story/opinion/op-ed/ej-montini/2022/02/22/republican-matt-salmon-attack-arizona-teachers-governor/6889449001/",
  "mediaOutlet": "AZCentral",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "EJ Montini",
  "authorUrl": "https://www.azcentral.com/staff/2646830001/ej-montini/",
  "termIds": [
    0
  ],
  "sentences": [
    "I attended a Catholic grammar school where the nuns were merciless and physically punitive, but even those of us with visible welts never called the good sisters “terrorists.”\nThen, last week, GOP gubernatorial candidate Matt Salmon called the teachers union “a scourge on our society.”\nHe also sent a press release announcing his response to a questionnaire from the Arizona Education Association, saying, “I hope that this statement answers the final item in your questionnaire asking what kind of ‘relationship’ I anticipate having with the AEA as Arizona’s next governor: A confrontational one.”\nWe're the bottom of the barrel, as in 50th\nConfrontational?",
    "The original Matt Salmon, uncorrupted by delusion and demonization, told me in 2013, “At the end of the day, when people recognize that we were Americans before we registered as Republicans or Democrats, we all get along a lot better … .”\nReach Montini at ed.montini@arizonarepublic.com.",
    "The biggest lesson this new Salmon could learn from studying the original Matt Salmon, his former self, would be that the true “scourge on our society” is spreading conspiracy theories and demonizing anyone who disagrees with you.",
    "That Matt Salmon told me, “I had called (Democratic Rep.) Ed Pastor after the November election and said, ‘Are you holding regular delegation breakfasts like we used to?’ (During Salmon’s previous stint in Congress.)",
    "Salmon 1.0 looked for ways to work together\nMatt Salmon 2.0, however, this almost unrecognizable guy trying to become the Republican nominee for governor, seems to have drowned his common sense in the Kari Lake.",
    "For example, there was the Matt Salmon from 2013 who, during his second stint in Congress, arranged for the Arizona delegation to get together for breakfast with the idea of looking for ways to work together.",
    "Arizona judge rules that 'law enforcement' is NOT a profession If the Constitution means anything, kick Rep. Gosar off the ballot Does Ducey really think cops in Alaska can help secure our border?",
    "Matt Salmon 2.0 is like one of those software upgrades pushed on us by the big tech companies that turns out to be more perplexing, irritating and incompatible than the original version.",
    "The truth is, the one good thing about Arizona’s public education system is the dedication of its embattled teachers, who, unlike the politicians running the state, put students first.",
    "The survey found what anyone who lives here should already know, that Arizona was among the worst states in terms of teacher-to-student ratio, teacher salary and spending per pupil.",
    "Has Salmon not been paying attention to what the Arizona Legislature and lawmakers like Ugenti-Rita have done to the state’s public school system over the past several years?",
    "Opinion: The candidate for governor, who used to be a rock solid but rational conservative, has drowned his common sense in the Kari Lake.",
    "So much so that a recent national survey found that Arizona had the worst public education system in the nation.",
    "We found several areas of common ground.”\nSalmon 2.0 is like the software upgrade that wasn't\nImagine that.",
    "On Monday, Republican state Sen. Michelle Ugenti-Rita called teachers “educational terrorists.”\nJeez.",
    "I don’t believe that the Matt Salmon from a few years back would be attacking teachers.",
    "He said that they hadn’t in a couple of years, so we decided to try it again.",
    "All of which are tied to the ongoing assault by the Legislature and Gov.",
    "Teachers are not the problem here\nAnd the problem is not teachers.",
    "It’s like they’re having spitting contests with venom.",
    "For more opinions content, please subscribe.",
    "Why do Arizona Republicans hate teachers?",
    "Doug Ducey on the public school system.",
    "Instead, trying to find common ground.",
    "So, teachers are the problem?",
    "A scourge on our society?",
    "Bottom of the barrel.",
    "Ed hosted this one.",
    "As in, wreck it.",
    "Everyone came.",
    "No demonizing.",
    "It was great.",
    "50th."
  ]
}