{
  "id": 3963,
  "mediaId": 8345,
  "date": "2022-01-25",
  "headline": "High court rejects appeal of Rep. Don Shooter expulsion case",
  "image": "https://westernnews.media.clients.ellingtoncms.com/img/photos/2022/01/25/High_court_rejects_Don_Shooter_6_web.jpg",
  "link": "https://kdminer.com/news/2022/jan/25/high-court-rejects-appeal-rep-don-shooter-expulsio/",
  "mediaOutlet": "kdminer.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "They said that argument fails because Shooter had failed to show that the House policy \"allowed the sort of conduct of which he was accused.”\nIn this case, the court noted, the allegations ranged from commenting about the breasts of a female lawmaker, making \"sexualized comments” about a female lobbyist's appearance, that he made sexual gestures in front of a female lobbyist from the Arizona Supreme Court, that he made a sexual joke to the then-publisher of The Arizona Republic, and that he hugged a female newspaper intern \"in a prolonged, uncomfortable, and inappropriate manner.”\n\"The notion that the Arizona Legislature previously permitted this type of conduct is simply implausible, and nothing in Shooter's complaint supports such an inference,” Collins wrote.",
    "But in doing so, the justices did not address the claims by Shooter that having him ousted for violating a policy against sexual harassment – one that did not exist at the time of the alleged incidents – was illegal.",
    "It also found \"no credible evidence” that Ugenti-Rita had violated the harassment policy, though a lobbyist later filed a deposition spelling out how she was the victim of a pattern of harassment by the legislator.",
    "Beyond that, appellate Judge Daniel Collins, writing for the unanimous panel, pointed out that the Arizona Constitution empowers the House to discipline its own members and even oust them with a two-thirds vote.",
    "At the heart of the case are claims by Shooter that Mesnard and Adams, at the time working for Ducey, were seeking to thwart his efforts to investigate the use of \"no-bid” contracts to make technology purposes.",
    "PHOENIX – The U.S. Supreme Court has doused the last hope of former state Rep. Don Shooter to claim that his rights were violated when he was expelled in 2018 from the House of Representatives.",
    "Without comment, the justices refused to set aside a ruling by the 9th Circuit Court of Appeals throwing out the lawsuit that the Yuma Republican had filed against former House Speaker J.D.",
    "And the judges rebuffed Shooter's contention that he had been ejected for violating a zero-tolerance standard against sexual harassment that did not exist before the move to remove him.",
    "Under normal House procedures, those allegations would have been reviewed by the Ethics Committee where Shooter could have presented evidence and cross-examined others.",
    "\"I've said stupid things, I've done stupid things” he told colleagues on the date of the vote, asking they limit his punishment to a public censure.",
    "The problem with all that, according to the 9th Circuit, is the qualified immunity that exists for government officials performing official acts.",
    "Instead, Monday's action simply upholds the conclusion by the appellate court that Mesnard and Adams have qualified immunity for their actions.",
    "And he reminded other lawmakers that he apologized earlier this year during a House floor session dealing with sexual harassment training.",
    "That report concluded Shooter \"created a hostile working environment” for other lawmakers and those who do business at the Capitol.",
    "After he threatened to issue subpoenas, Shooter said Rep. Michelle Ugenti-Rita, R-Scottsdale, accused him of sexual harassment.",
    "Shooter claimed there was a link, saying that she was engaged at the time to a lobbyist who had previously worked for Adams.",
    "That's where the state chooses a vendor who, according to Shooter, then is able to dictate contract price and service.",
    "Instead, Mesnard named his own staff members to oversee a probe and they, in turn, hired an outside law firm.",
    "Four days after the report was issued, and without any hearings, the House voted 56-3 to expel him.",
    "He said that limits the ability of federal courts to second-guess the procedures used here.",
    "And Shooter leveled his own charges of inappropriate conduct against her.",
    "Shooter has conceded that there is merit behind some of the charges.",
    "That led to Shooter's claim that his rights had been violated.",
    "\"What can I say?” Shooter said when asked for comment.",
    "Mesnard and Kirk Adams, a former top adviser for Gov.",
    "Doug Ducey."
  ]
}