{
  "id": 495,
  "mediaId": 8475,
  "date": "2022-02-21",
  "headline": "Az schools dodge massive cuts as Leg raises spending cap for this year",
  "image": "https://www.tucsonsentinel.com/phpthumb/phpThumb.php?src=/files/entryimages/schools-money-teachers-signs-1024x614.jpg&fltr[]=wmi|/gfx/shareoverlays/sentinellogo4color_nobackbig.png|BR|77|4|4|0]&w=1200&h=630&zc=C&f=jpg",
  "link": "https://www.tucsonsentinel.com/local/report/022122_school_funding/az-schools-dodge-massive-cuts-as-leg-raises-spending-cap-this-year/",
  "mediaOutlet": "tucsonsentinel.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeremy Duda",
  "authorUrl": "https://www.tucsonsentinel.com/reporter/66346",
  "termIds": [
    0
  ],
  "sentences": [
    "Livingston, a Peoria Republican, voted raising the cap temporarily, but cautioned that it will be an ongoing issue: The nearly $1.2 billion more than the spending cap this year will grow to as much as $1.8 billion in the upcoming budget year, and he said a better forum for determining the fate of the spending limit should be in state budget discussions.",
    "Though school districts wouldn’t have to start implementing spending cuts until April 1, the statutory deadline for them to complete their revised budgets, some might have began phasing them in after March 1 in anticipation of the coming shortfall.",
    "Local\nThe state Senate voted Monday to raise the aggregate expenditure limit for K-12 schools, heading off a funding crisis and allowing Arizona schools to use nearly nearly $1.2 billion that would have otherwise gone to waste.",
    "Because the school year would be roughly three-quarters over when the cuts are scheduled to go into effect, many school districts have said the impact would be massive — and could force teacher layoffs and school shut-downs.",
    "The protracted fight over the aggregate expenditure limit has been a source of anxiety for public schools, which were unsure whether they’d have access to their full budgets for the last part of the academic year.",
    "Due to a combination of increased K-12 funding and the expiration of a law that exempted about $600 million per year from the cap, schools are on pace to dramatically exceed that limit in the 2021-22 school year.",
    "Some Republicans were wary of raising the spending cap over concerns that doing so would throw a lifeline to Proposition 208, an income tax hike on high earners that voters approved in 2020.",
    "But the justices kicked the case back down to the trial court to determine whether the projected revenue would do so, and Republican legislators have accused the judge of dragging his feet.",
    "Sen. Michelle Ugenti-Rita, a Scottsdale Republican, said teachers and public school advocates have “done a grave disservice to our kids” over the past two years during the pandemic.",
    "208, who told him that the legislature’s action on the aggregate expenditure limit for this year would have no bearing on the ongoing lawsuit — and they told him so in writing.",
    "Republicans on Monday said the fact that public schools hit the spending ceiling was because of “the magnitude of dollars that have been invested” in recent years, as Sen. J.D.",
    "Voters in 1980 approved an amendment to the Arizona Constitution that created a formula-based ceiling on K-12 spending known as the aggregate expenditure limit, or AEL.",
    "The state House of Representatives passed the legislation on Feb. 15, but the measure initially stalled in the Senate after it came up one Republican vote short.",
    "Paul Boyer, Karen Fann, Rick Gray, Sine Kerr, David Livingston, Tyler Pace and T.J. Shope, who joined with Democrats to raise the aggregate expenditure limit.",
    "Fann called on working toward a bipartisan solution for the constitutional spending limit to ensure similar debates don’t happen every year.",
    "“In light of what I’ve learned about the lawsuit… it is specifically, for that reason, that I vote ‘aye,'” he said in explaining his vote.",
    "With a week to go before the March 1 deadline in the Arizona Constitution, the Senate voted 23-6 for a one-year exemption to the limit.",
    "He and others pointed to money lawmakers have added to school funding to increase teacher pay and to fund general operations.",
    "The only reason schools are open right now “is because parents had to collectively lose their minds nationally,” she said.",
    "208 forces an argument that the tax hike isn’t unconstitutional because lawmakers can suspend the cap anytime they want.",
    "The legislature has the power to approve one-year suspensions of that limit with a two-thirds vote in each chamber.",
    "208 were to go into effect, no revenue from the tax hike would be raised or spent during the current fiscal year.",
    "She called them “educational terrorists who have held our kids hostage” in order to get more money for schools.",
    "Arizona teachers don’t want open classrooms, but want students doing remote learning forever, she alleged.",
    "208 counted toward the spending limit and that the tax increase was illegal if it exceeded the cap.",
    "Although the spending cap is lifted for the current school year, the problem will not go away.",
    "“I pray to God we can do it, for our kids’ sake and their parents’ sake,” she said.",
    "Nonetheless, some Republicans worried that raising the limit would give pro-Prop.",
    "Mesnard said his vote was swayed by hearing from proponents of Prop.",
    "Both sides in the litigation have stipulated that even if Prop.",
    "“Money’s not going to fix it, because money’s not the problem.",
    "No matter how much you give them… it’s not enough,” she said.",
    "The Arizona Supreme Court ruled that the revenue from Prop.",
    "Mesnard was one of six Republican senators who voted yes.",
    "Tell your friends to follow us on Facebook and Twitter.",
    "Thanks for reading TucsonSentinel.com.",
    "Mesnard, R-Chandler, said.",
    "He joined Sens.",
    "- 30 -"
  ]
}