{
  "id": 675,
  "mediaId": 8251,
  "date": "2022-02-21",
  "headline": "She's the reason Arizona has a law requiring surgeons to warn patients about the dangers of breast implants",
  "image": "https://media.12news.com/assets/KPNX/images/ad44ef8f-69fe-4772-8c53-6ad5037f1aa8/ad44ef8f-69fe-4772-8c53-6ad5037f1aa8_1140x641.jpg",
  "link": "https://www.12news.com/article/news/health/breast-implants-almost-killed-her-arizona-law-protect-people-like-her/75-a7c9d5fb-0ca4-4438-b133-f710759ce97a",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The FDA boxed warning informs patients of the following:\nBreast implants are not considered lifetime devices\nThe chance of developing complications increases over time\nSome complications will require more surgery\nBreast implants have been associated with the development of a cancer of the immune system called breast implant-associated anaplastic large cell lymphoma (BIA-ALCL)\nBIA-ALCL occurs more commonly in patients with textured breast implants than smooth implants, and deaths have occurred from BIA-ALCL\nBreast implants have been associated with systemic symptoms\n“They're going to have what's called a black box warning, that's like the kind of warning you see on cigarette packages that tell you cigarettes can kill you,\" Zuckerman said.",
    "\"And then they finally discover on social media, that there are tens of thousands of women with exactly the same health problems they have, who also happen to have breast implants, and then they get their implants out, and they get better.”\nZukerman has been pushing for acknowledgement from the FDA that breast implant illness exists, advocating for more research around what exactly causes it and pushing for transparency when it comes to the risks.",
    "“One of the things that's been so tragic for all these years is how many women got sicker and sicker and sicker, year after year after year, going to doctors saying what's wrong with me and the doctor saying, you know, I don't know, do these tests and try to figure it out,\" Zuckerman said.",
    "Surgeons must outline the risks of breast implants, including breast implant-associated anaplastic large cell lymphoma, provide information about the manufacturer of the implants being used, and explain to patients how they can report adverse events to the FDA MedWatch Program.",
    "As of January 1, surgeons are required to present documentation to prospective breast augmentation patients clearly warning them of the risks of breast implant illness to be signed by the patient and the surgeon.",
    "That's because a first-of-its-kind bill has passed in Arizona created to protect women against a badly kept secret involving breast augmentation surgery: breast implant illness.",
    "She points out that following a surgery, many women go to primary care doctors when symptoms arise so she wants the entire medical community to be aware of the side effects.",
    "If a plastic surgeon does not provide patients with the warning documentation, the medical board will step in and their license will be in jeopardy.",
    "She says the FDA took a step in the right direction last year when the agency announced breast implants would be equipped with a black box warning.",
    "Towt continues to hear horror stories from women around the world which is why she's pushing for Arizona's bill to be passed in every state.",
    "Diana Zuckerman, president of the National Center for Health Research, has been outspoken about the dangers of implants for years.",
    "It’s really doing a disservice to the patient community because they need to know that this is even a possibility,\" Towt said.",
    "And yet there was nothing being done from the medical community’s perspective and point of view,\" Ugenti-Rita said.",
    "Facebook groups with thousands of members exist where women who had breast implants describe the same symptoms.",
    "She's also advocating for the FDA to notify doctors of all specialties about the risks of breast implants.",
    "Towt said her team of doctors never mentioned that her breast implants could cause those side effects.",
    "“I was shocked to learn that there were so many women with very very similar stories and experiences.",
    "Some of them suffered from the side effects for more than a decade, not knowing what was going on.",
    "Towt says the majority of them say they received no warning from their surgeons about those risks.",
    "She had recently survived breast cancer then had a double mastectomy with breast reconstruction.",
    "Consultations for breast augmentations look different now in Arizona than they did a year ago.",
    "After surviving cancer three times, Robyn Towt got a double mastectomy and breast implants.",
    "She started doing her own research, desperate to figure out why she was feeling this way.",
    "“As soon as I looked into it I knew in my gut that that’s what it was,\" Towt said.",
    "Even still, that warning wasn't always relayed by plastic surgeons to patients.",
    "That's why lawmakers in Arizona decided to take matters into their own hands.",
    "“Our patients are not going back to their plastic surgeons when they’re sick.",
    "Since then, Towt has discovered a vast network of women on social media.",
    "“We have to do something,\" said state Sen. Michelle Ugenti-Rita.",
    "She received a message on social media that changed everything.",
    "“I couldn’t figure out what was wrong with me,\" Towt said.",
    "But it was breast implants that made her the sickest.",
    "The cancer was gone, so why was she feeling so badly?",
    "Towt made the decision to have her implants removed.",
    "The message said it was likely her breast implants.",
    "“My entire team of doctors failed me,\" Towt said.",
    "Then, she became the sickest she had ever been.",
    "Robyn Towt survived three bouts with cancer.",
    "The bill received bipartisan support.",
    "At first, it was a mystery.",
    "The change in her health?",
    "Difficulty breathing.",
    "PHOENIX — Migraines.",
    "Trouble swallowing.",
    "Immediate.",
    "Headaches.",
    "Insomnia."
  ]
}