{
  "id": 9388,
  "mediaId": 2551,
  "date": "2022-03-28",
  "headline": "'This is what I hate about you blokes': Fired-up Benji Marshall clashes with reporter who said Roosters star Sam Walker is a liability in defence - and claims many players 'aren't paid to tackle'",
  "image": "https://i.dailymail.co.uk/1s/2022/03/29/05/55934707-0-image-a-24_1648528341770.jpg",
  "link": "https://www.dailymail.co.uk/sport/nrl/article-10661675/Fired-Benji-Marshall-heated-clash-reporter-claimed-Sam-Walker-defensive-liability.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Josh Alston For Daily Mail Australia",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Josh+Alston+For+Daily+Mail+Australia",
  "termIds": [
    0
  ],
  "sentences": [
    "+3\nView gallery\nMarshall was an excellent organiser and attacking half in his NRL career with stints at Wests, Brisbane and Souths, but he was not a noted defender\nJohnathan Thurston made 4,697 tackles across his 17-year career and missed 1,168 for a tackle efficiency rate of 75.2 per cent.",
    "Speaking on Triple M, veteran Journalist Brent Read warned that the Roosters halves pairing might take time to shine, with Walker only making 24 NRL appearances while Luke Keary missed the majority of 2021 through injury.",
    "Previously, Bulldogs general manager and Channel Nine commentator Phil Gould even suggested that Walker should be given time off from first grade after he was hammered in a heavy 46-0 loss to the Melbourne Storm in 2021.",
    "'They've got to give him a spell, he's done a great job and he's a tremendous young talent, but they can't protect him for 80 minutes ... they have to protect him from himself,' Gould said at the time.",
    "+3\nView gallery\nSam Walker is tipped upside down trying to complete a tackle in the Sydney Roosters 28-16 loss against the South Sydney Rabbitohs in round three of the NRL season.",
    "Retired NRL half Benji Marshall has launched an impassioned defence of Sydney Roosters five-eighth Sam Walker after a veteran journalist said the young star can't tackle.",
    "Questions are being asked about the Roosters and their ability to contend in 2022 after a disappointing start to the season that has them sitting in 13th on the ladder.",
    "However, Marshall finished his league career - not including his brief stint in rugby union - with 261 try assists, 770 tackle busts, 96 tries and 121 line breaks.",
    "pic.twitter.com/NiblP0WNVd\n— NRL (@NRL) February 26, 2022\nThe only player among halves with more busts (806), line breaks (153) and tries (101) is Thurston (101).",
    "Marshall also had his struggles defensively, leading the NRL in missed tackles in 2020 before he was dropped by Wests Tigers coach Michael McGuire.",
    "This is what I hate about you blokes, you have all these expectations on all these kids to be like Johnathan Thurston after their 10th game.'",
    "In the era of detailed record-keeping of those stats, only Thurston (324) and Cooper Cronk (283) are credited with more try assists.",
    "+3\nView gallery\nManly Sea Eagles player Haumole Olakau'uta fends of Sam Walker in their round two NRL match at the SCG.",
    "'I think they're [the Roosters] a year or two away [from contending] for me, I don't think they're ready,' he said.",
    "Read clarified that he thinks Walker will 'be a great footballer' but added: 'I don't think he's quite there yet.'",
    "Marshall said that Walker would need time to develop as a player and there was no sense 'bagging him' now.",
    "'You're saying all the negative things about him when he hasn't learned how to play,' Marshall said.",
    "That fired Marshall up who insisted that defence was not the primary role of the young half.",
    "'They're not paying him to do that, that's what you don't understand, mate,' he said.",
    "'I've got concerns over their halves, they're great players, don't get me wrong.",
    "OK mate, a lot of players can't tackle, that's not what they get paid to do.'",
    "Read again replied: 'He's going to be a great player.'",
    "'Nah, you're just bagging him,' Marshall later added.",
    "I think Sam Walker defensively has a few problems.'",
    "'That's pure bagging: \"Mate, he can't tackle.\"",
    "How about the footwork from Sam Walker?!",
    "'But what do you want him to be?'",
    "'How many games has he played?",
    "Marshall fired back.",
    "??"
  ]
}