{
  "id": 10255,
  "mediaId": 2723,
  "date": "2022-03-30",
  "headline": "‘Name Names’: House Freedom Caucus Chair Demands Cawthorn Reveal Who Invited Him to Coke-Fueled Orgy Parties",
  "image": "https://www.thenewcivilrightsmovement.com/wp-content/uploads/2022/03/cawthorn-on-coke-and-orgies-ss-4.jpg",
  "link": "https://www.thenewcivilrightsmovement.com/2022/03/name-names-far-right-house-freedom-caucus-chair-demands-cawthorn-reveal-who-invited-him-to-coke-fueled-orgy-parties/",
  "mediaOutlet": "thenewcivilrightsmovement.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Badash",
  "authorUrl": "https://www.thenewcivilrightsmovement.com/author/dbadash/",
  "termIds": [
    2391,
    1858,
    2693,
    2765,
    4066,
    3634,
    1433,
    1126
  ],
  "sentences": [
    "Earlier in the week, Trump attorney Alina Habba claimed that “Trump’s eponymous company may have the documents being sought, but Trump himself does not.”\nThat brought a rebuke from James who stated “that Trump cannot ‘pass off’ responsibility for complying with the subpoena to his company.”\nCates of CBS adds, “Investigators have identified, but not received subpoenaed data from, three mobile devices belonging to Trump, two of which are personal and one of which is a company-issued phone, according to the filing.",
    "Rep. Scott Perry (R-PA) (photo), who has been asked by the January 6 Committee to testify but has refused, told Politico’s Olivia Beavers, “I think it is important, if you’re going to say something like that, to name some names.”\nTuesday Beavers also reported that House Republican Minority Leader Kevin McCarthy had wanted to speak with Cawthorn about the allegations – not to start any type of investigation, but because some Republicans said they were “upset” Cawthorn made the claim.",
    "The California Republican was caught in a blatant lie when a recording surfaced showing that he intended to ask for Trump’s resignation after the Jan. 6 insurrection, for which he said the former president accepted some blame, but conservative Charlie Sykes told MSNBC’s “Morning Joe” that McCarthy would likely remain in his leadership role.",
    "Republicans are more than willing to go along with this.”\nA hearing has been set for Monday morning to decide if Donald Trump should be held in contempt for not complying with a court order allowing New York investigators access to three mobile devices and multiple document storage sites containing information sought by the state.",
    "'”\n“So it’s not surprising that we wake up on Monday morning and find that Donald Trump is completely happy to have the next speaker of the House of Representatives, possibly, on his knees, apologizing to him and acknowledging that he has no political future except by believing and repeating Donald Trump’s lies,” Sykes added.",
    "They are also waiting for documents from specific Trump Organization locations, such as “the files located in cabinets outside Mr. Trump’s office,” ‘the storage room by Mr. Trump’s office,’ ‘the Executive Office storage closet’ and ‘the file cabinets located on the 25th and 26th floors.",
    "But they can do it without his testimony if he is about to be indicted for a crime.”\nSee the panel discussion below:\nDonald Trump won’t likely cut House minority leader Kevin McCarthy loose, according to one conservative, because he’s got the GOP leader right where he wants him.",
    "Last week Cawthorn told the “Warrior Poet Society” podcast that, Beavers writes, “he received invitations along the lines of “‘hey, we’re going to have kind of a sexual get-together at one of our homes, you should come’.”\n“What did you just ask me to come to?” Cawthorn said.",
    "“I think that some of what we have seen in the last few days may explain why the Department of Justice has not yet indicted Mark Meadows for contempt, and it may be because these documents show him to be an active participant in a coup,” said Wine-Banks.",
    "I think he could be guilty of both and that it is very important to work between the Congress and the prosecutors to make sure of that.”\nShe went on to explain that Congress wouldn’t give any kind of immunity to Meadows if the DOJ wants to indict him.",
    "The chairman of the ultra-conservative House Freedom Caucus is demanding U.S. Rep. Madison Cawthorn (R-NC) back up his incendiary charges that several members of Congress invited him to alleged orgies where they would do “key bumps” of cocaine.",
    "“You should have to name names if you are going to go make those kinds of brush stroke accusations and impugn the character of people in this institution or … anybody else in this town,” an unnamed House Republican, told Beavers.",
    "Graham Cates of CBS wrote that a late Friday filing from the office of New York Attorney General Letitia James accused Trump of ignoring the court and urged the judge to “coerce” the former president to comply.",
    "'”\n“Not only does he have to continue to lie about it, he has a pretend that one of those brief moments where he had some clarity about what was right and what was wrong needs to be memory-holed,” Sykes added.",
    "“So, yes, the Republicans have created an alternative reality.”\nSykes said the GOP’s corrupt path was apparent as soon as Trump took over the party, but he said it’s gotten even worse than he expected.",
    "But former Watergate attorney Jill Wine-Banks said on MSNBC later in the day that such crimes could be the reason that the Justice Department isn’t acting on the contempt of Congress charge.",
    "On Monday, Los Angeles Times legal analyst Harry Litman explained that it appears former White House chief of staff Mark Meadows is “up to his neck” in two possible federal crimes.",
    "What he’s saying is, you know, ‘No, I didn’t really have a moment of decency, principle and duty, I never did anything about it, and I got over it very, very quickly.",
    "According to a report from CBS, lawyers for the former president will be forced to explain why he missed a March 31 deadline to turn over subpoenaed material.",
    "“Well, you know, what’s interesting about Kevin McCarthy’s groveling and lying about this particular incident is the nature of his lie,” Sykes said.",
    "The New Civil Rights Movement depends on readers like you to meet our ongoing expenses and continue producing quality progressive journalism.",
    "From unflinching coverage of religious extremism, to spotlighting efforts to roll back our rights, NCRM continues to speak truth to power.",
    "“The Court should put an end to Mr. Trump’s intransigence and subterfuge,” investigating attorneys wrote in the Friday evening filing.",
    "Three Silicon Valley giants consume 70 percent of all online advertising dollars, so we need your help to continue doing what we do.",
    "Support progressive journalism with a one-time contribution to NCRM, or click here to become a subscriber.",
    "“Where Congress says, we really need his testimony — their role is very different,” Wine-Banks continued.",
    "They must do that because this, as you have said, is as close to losing democracy as I hope we ever come.",
    "“And maybe they are looking at him more seriously for a substantive part and for obstructing Congress.",
    "“Things have gotten much, much worse than I expected, and I was not an optimist back then,” he said.",
    "“They have to pass laws that will protect us from anything like this happening again.",
    "“And then you realize they are asking you to come to an orgy.”\nEnjoy this piece?",
    "Every reader contribution, whatever the amount, makes a tremendous difference.",
    "“This is exactly the way Donald Trump wants Republicans to behave right now.",
    "America needs independent voices like NCRM to be sure no one is forgotten.",
    "Perry and McCarthy are not the only ones angered about Cawthorn’s charges.",
    "I think he likes this, he likes this as an instrument of humiliation.",
    "“It’s accelerated because Donald Trump keeps raising the ante.",
    "Help ensure NCRM remains independent long into the future.",
    "You won’t find mainstream media bias here.",
    "What can I get you to apologize for?",
    "… then let us make a small request.",
    "So, I want them to pass the laws.",
    "Click here to donate by check.",
    "‘How far can I push people?",
    "What can I get you to say?",
    "“I mean, think about this.",
    "NCRM is independent.",
    "Thank you.",
    "'”"
  ]
}