{
  "id": 1037,
  "mediaId": 2548,
  "date": "2022-02-18",
  "headline": "EXCLUSIVE: Reps Bishop, Mast Introduce Legislation To End CDC’s Public Transportation Mask Mandate",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/02/PHOTO-COLLAGE-Photo-on-left-Chip-SomodevillaGetty-Images-Photo-on-right-Ting-Shen-PoolGetty-Images-e1645209674439.jpg",
  "link": "https://dailycaller.com/2022/02/18/dan-bishop-brian-mast-legislation-resolution-end-cdc-public-transportation-mask-mandate/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Henry Rodgers",
  "authorUrl": "https://dailycaller.com/author/Henry+Rodgers",
  "termIds": [
    0
  ],
  "sentences": [
    "“If Stacey Abrams, Rashida Talib and Gavin Newsom don’t have to wear masks, why is the rest of America forced to on their morning commutes?” (RELATED: Psaki Pressed By Reporter On How Biden Will Decide When To Update Mask Guidance)\nBlue states and cities across the country have started lifting mask and vaccine mandates; however, the CDC still requires masks on public transportation.",
    "(RELATED: EXCLUSIVE: Republicans Call On Pelosi To Return House To Normal, End Mask Mandate After New CDC Guidelines Released)\nREAD THE RESOLUTION HERE:\n“For two years, Democrats have been telling us to ‘follow the science,’ but it’s clear now it’s not about the science, it’s about control,” Mast told the Daily Caller.",
    "The 19 cosponsors include Reps. Thomas Massie, Lauren Boebert, Matt Rosendale, Andy Biggs, Scott Perry, Tom Tiffany, Bill Posey, August Pfluger, Beth Van Duyne, Bill Huizenga, Barry Loudermilk, Bob Gibbs, Ralph Norman, Mary Miller, Bob Good, Jody Hice, Louie Gohmert, Claudia Tenney and Jeff Duncan.",
    "Republican North Carolina Rep. Dan Bishop and Florida Rep. Brian Mast introduced a House companion to Kentucky Sen. Rand Paul’s Congressional Review Act (CRA) resolution that disapproves of the Centers for Disease Control and Prevention (CDC) mask mandate for public transportation.",
    "And I for one, I’m tired of paying the airlines to be treated like crap when I get on the plane.”\nFour Republican senators did not show up Thursday to vote on an amendment that would have defunded the remaining vaccine mandates and have since faced criticism from many in the GOP.",
    "Currently, in many states and cities people can go to crowded bars without a mask, but the CDC has maintained its mask mandate for passengers on planes and public transportation.",
    "Democrat politicians and celebrities can enjoy the Super Bowl maskless in a crowded stadium, but the rest of America has to mask up,” Bishop told the Daily Caller.",
    "The Daily Caller first obtained the resolution, which has 19 cosponsors and is a House version of Paul’s resolution that was introduced earlier in February.",
    "“The CDC’s mask mandate for public transportation was never based on science, and it’s time for the CDC to stop pretending otherwise.",
    "Bishop and Mast said Americans are tired of being harassed on airplanes and public transportation for not wearing masks.",
    "“It’s a joke, it’s theater, and there’s no reason to be wearing them on the planes … We are just punishing ourselves.",
    "“It’s nonsense and Americans are done with being harassed about wearing masks on planes and buses.",
    "Paul said Tuesday he wants to force a vote on his legislation to end mask mandates on airplanes.",
    "I’m proud to join Senator Rand Paul in this fight for basic freedoms,” Bishop added.",
    "Both Bishop and Mast argued the CDC’s mandate is not science-based."
  ]
}