{
  "id": 10736,
  "mediaId": 2526,
  "date": "2022-03-07",
  "headline": "Mo Brooks Leads Effort to End Mask Mandate on U.S. Commercial Flights",
  "image": "https://media.breitbart.com/media/2017/07/Mo-Brooks-stare-ap.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/07/mo-brooks-masks-commercial-flights/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    2443,
    2187,
    2693,
    5409,
    5592,
    1489,
    1126,
    36,
    538
  ],
  "sentences": [
    "“Washington bureaucrats need reminding that America was founded on freedom and liberty.”\nThe federal mask mandate for Americans flying on commercial flights has remained in effect for nearly two years, even as airline executives have admitted that planes are some of the safest environments because of their highly filtrated air condition systems.",
    "Brooks has introduced the “Freedom to Fly Maskless Act” with co-sponsors like Reps. Paul Gosar (R-AZ), Scott Perry (R-PA), and Tom Tiffany (R-WI), to prohibit the federal government from mandating masks, negative Chinese coronavirus tests, and vaccinations on all public transportation.",
    "“These mandates have resulted in good Americans being fired from their jobs, being jabbed with needles against their will, and even losing their businesses in some cases.”\n“It is time to throw off the heavy boot of tyranny that’s crushing the American spirit,” he continued.",
    "In the Alabama Senate GOP primary race, set for May 24, Brooks has been endorsed by former President Trump and is backed by Sen. Rand Paul (R-KY), Rep. Marjorie Taylor Greene (R-GA), and the National Association for Gun Rights, among others.",
    "Rep. Mo Brooks (R-AL), running for Senate in Alabama, is leading a House Republican effort to end the federal mask mandate on public transportation including United States domestic commercial flights.",
    "“Unelected bureaucrats have falsely claimed the power to foist unnecessary and anti-science mandates on the American people,” Brooks said.",
    "“The American people are sick and tired of being dictated to by unelected Washington bureaucrats,” Brooks said in a statement.",
    "“Continued mandates are not justified, and it’s long past time Americans return to our pre-pandemic lives,” Brooks said.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Follow him on Twitter here."
  ]
}