{
  "id": 11488,
  "mediaId": 2591,
  "date": "2022-03-10",
  "headline": "House Republicans Introduce Legislation to Designate MS-13 as Foreign Terrorist Organization",
  "image": "https://humanevents.com/wp-content/uploads/2022/03/Screen-Shot-2022-03-10-at-1.57.25-PM.png",
  "link": "https://humanevents.com/2022/03/10/house-republicans-introduce-legislation-to-designate-ms-13-as-foreign-terrorist-organization/",
  "mediaOutlet": "humanevents.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Human Events Staff",
  "authorUrl": "https://humanevents.com/author/courtney",
  "termIds": [
    1981,
    3514,
    2693,
    5174,
    4972,
    5399,
    1126,
    837,
    6678
  ],
  "sentences": [
    "The legislation, titled Every Town a Border Town Act, would change the gang’s designation from a Transnational Criminal Organization to a Foreign Terrorist Organization, giving the government a wider range of options to prosecute rather than just financial crimes.",
    "The bill’s 15 co-sponsors are Reps. Ted Budd, Paul Gosar, Scott Perry, Mary Miller, Louie Gohmert, Matt Gaetz, Madison Cawthorn, Brian Babin, Randy Weber, Jeff Duncan, Rodney Davis, Lauren Boebert, Andrew Garbarino, Dan Bishop and Ralph Norman.",
    "“We must enhance the safety of the American people by providing federal law enforcement with all the tools they need to stop these criminal gangs from terrorizing us and effectively making every town a border town,” Good added.",
    "“The Biden Administration’s anti-American immigration policies have failed to prioritize the safety and security of the American people, favored illegal aliens, and created an out-of-control border crisis.",
    "The new designation would put sanctions on members and their families, put travel restrictions in place to remove them from the U.S. and increase penalties for U.S. citizens who help them financially.",
    "This President’s open border policies have allowed MS-13 to infiltrate cities around the United States infecting American communities with violence and drugs,” Good told the Daily Caller.",
    "As reported by the Daily Caller, border agents arrested nearly 9,800 criminal migrants in fiscal year 2021, over 100 of which were members of MS-13.",
    "Good and his co-sponsors argue that MS-13 poses a threat to the safety and security of U.S. citizens and the country’s national security.",
    "Republican Virginia Rep. Bob Good introduced a bill Wednesday to designate MS-13 as a Foreign Terrorist Organization."
  ]
}