{
  "id": 12614,
  "mediaId": 2551,
  "date": "2022-02-26",
  "headline": "'China is watching': GOP rep warns Beijing is studying Biden's response to Ukraine to decide whether it should invade Taiwan and urges president to show 'strength and resolve' to deter President Xi",
  "image": "https://i.dailymail.co.uk/1s/2022/02/27/02/54702431-0-image-a-23_1645927301636.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10556013/GOP-rep-warns-China-studying-Bidens-response-Ukraine-decide-invade-Taiwan.html?ns_mchannel=rss&ns_campaign=1490&ito=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen M. Lepore For Dailymail.Com",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Stephen+M.+Lepore+For+Dailymail.Com",
  "termIds": [
    3702,
    2638,
    2693,
    4486,
    4905,
    1126,
    6672,
    6645,
    6509
  ],
  "sentences": [
    "+9\nView gallery\nRep. Scott Perry, R-Pa., takes a question from a reporter at a news conference held by the House Freedom Caucus on Capitol Hill in Washington\n+9\nView gallery\nRussian President Vladimir Putin, left, and China's President Xi Jinping\n+9\nView gallery\nPresident Joe Biden leaves St. Joseph on the Brandywine Catholic Church in Wilmington, Delaware Saturday\n+9\nView gallery\nA Ukrainian soldier walks past debris of a burning military truck, on a street in Kyiv\n'The United States will continue to support a peaceful resolution of cross-strait issues, consistent with the wishes and best interests of the people on Taiwan,' a spokesman said.",
    "+9\nView gallery\nIn this photo provided by the Ukrainian Presidential Press Office, Ukrainian President Volodymyr Zelensky delivers his speech addressing the nation in Kyiv, Ukraine, Friday\n+9\nView gallery\nThe White House released this memorandum on Friday evening authorizing the release of up to $600 million in military assistance to Ukraine\nZelensky said in response to the offer of refuge: 'The fight is here; I need ammunition, not a ride,' according to a senior American intelligence official with direct knowledge of the conversation, who described Zelensky as upbeat.",
    "'We saw him being weak in Afghanistan and so too the rest of the world, certainly, but Vladimir Putin did, and then just recently, with Ukraine talking about a little invasion or something like that, would be something we wouldn't do anything about it.",
    "Perry now believes China is making up its mind on what to do in Taiwan in the wake of the Russian invasion - and gauging a potential US response if China tries to reclaim the island democracy as its own.",
    "When we pull the United States offline of producing the energy that the world needs, it opens it up for other actors who use it to extort their neighbors, and Vladimir Putin is one of them.'",
    "'But if they continue to fail or fail more spectacularly than they already have, I think it kind of opens the door wide open to China's regressions, and then it's just a matter of timing.'",
    "A Republican Congressman said Saturday that China is keeping its eye on President Joe Biden's response to the crisis in Ukraine as it eyes a possible invasion of its own neighbor Taiwan.",
    "Invading Russian forces closed in on Ukraine´s capital on Saturday, in an apparent encircling movement after a barrage of airstrikes on cities and military bases around the country.",
    "He spoke as Biden authorized the release of $350million of military assistance to Ukraine after taking his latest weekend break to Delaware as Russian troops began to invade Kyiv.",
    "The US Defense Dep't said it remained 'concerned' as nine Chinese aircraft have entered the island nation's air defense zone, the Taiwan Ministry of Defense said Thursday.",
    "Representative Scott Perry of Florida spoke at the Conservative Political Action Conference (CPAC) and called the Biden administration's leadership an 'abject failure.'",
    "+9\nView gallery\nPresident Biden is pictured leaving the White House for his Delaware home on Friday evening\n'Number two, his rhetoric has been weak,' he said.",
    "Ukrainian President Volodymyr Zelensky told President Joe Biden 'I need ammunition, not a ride,' when offered the chance of a US-backed evacuation.",
    "'Our commitment to Taiwan is rock solid and contributes to the maintenance of peace and stability across the Taiwan Strait and within the region.'",
    "Perry said that when America pulls its assets off the market, prices go up and Russian President Vladimir Putin picks up on those gouged profits.",
    "'It's a continuous assessment, and I still think that there is time for the Biden administration to show some strength here and some resolve.",
    "Perry said this after discussing the administrations' failures that led to the crisis in Ukraine in the first place.",
    "The Congressman also accused Biden of portraying less than a strong front in the public sphere.",
    "'POTUS' weakness, negligence and apathy only encourage Putin to act without consequence.",
    "'This isn't hard to understand: Putin is a thug, a murder and a tyrant,' Perry tweeted.",
    "Perry said Biden's rhetoric is 'essentially opening the door' for Putin.",
    "'How we got into this, in my opinion, is two-fold,' Perry told Fox News.",
    "On Twitter, Perry was even less filtered on the matter.",
    "Harsh words and hope aren't courses of action.'",
    "'It's our energy policy in the United States.",
    "'China is making an assessment right now.",
    "That's very, very provocative.",
    "It's ongoing,' he said.",
    "THIS MUST CHANGE."
  ]
}