{
  "id": 12664,
  "mediaId": 2732,
  "date": "2022-02-28",
  "headline": "Eugene DePasquale will not oppose U.S. Rep. Scott Perry in the 10th Congressional District race",
  "image": "",
  "link": "https://triblive.com/news/pennsylvania/eugene-depasquale-will-not-oppose-u-s-rep-scott-perry-in-the-10th-congressional-district-race/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5016,
    2765,
    3748,
    3671,
    4016,
    1433,
    1477,
    6520,
    6743
  ],
  "sentences": [
    "Several other potential Democratic candidates who either have demonstrated success at the polls, run tough against Perry before or have a significant regional identity told PennLive they either have other points of focus, like state Rep. Patty Kim, who is seeking re-election to her significantly reshaped state House seat; or have given no thought to running this year, like George Scott, the career Army officer-turned Lutheran pastor who mounted a strong challenge to Perry in 2018, and former Central Pa. Business Journal publisher Dave Schankweiler.",
    "“That is not who I am, and therefore I do not see a path forward.”\nRegional Democratic Party said they are still hopeful they will have a strong challenger for Perry, a five-term incumbent who may be newly vulnerable this year because he will face voters for the first time since his public and behind-the scenes involvement with former President Donald J. Trump’s effort to have his 2020 election defeat to President Joseph R. Biden decertified.",
    "But DePasquale’s decision could, depending who emerges in his place, cause national Democrats who helped finance his race two years ago to decide to focus their attention on helping current Pennsylvania incumbents retain their seats in Congress, or focus on the state’s open seat U.S. Senate race, also pivotal to majority control in that chamber.",
    "The decision is a huge setback for the region’s Democrats, who just last week got about as favorable a set of district lines for the 10th Congressional District as they could hope for, but now have no announced candidates as the signature gathering period to win a spot on the May primary election ballot has kicked off.",
    "Curiously, DePasquale cited the district lines — which could have been so much safer for Perry or any Republican in most of the alternative plans, and haven’t been this good for a York County Democrat like himself in decades — in his statement about stepping away from the race.",
    "Rogette Harris, the chair of the Dauphin County Democratic Committee, said she respects any candidate’s right to make a personal decision about whether they want to make the extraordinary investment of time, energy and treasure that it takes to mount a Congressional campaign.",
    "“While I had hoped for a fairer, more competitive district in which to run, the recent redistricting process has resulted in a district that, in my opinion, will continue to reward candidates who peddle in extremism and division,” DePasquale said in his Facebook post.",
    "Those lines leave the 10th — comprised of all of Dauphin County, most of Cumberland County and large section of York County — as one of the most competitive districts in the state, albeit with a clear Republican lean in recent voter performance.",
    "U.S. Rep. Scott Perry has just vanquished one major potential foe in his quest for a 6th term in Congress, as former Pennsylvania Auditor General Eugene DePasquale has decided not to seek a rematch of their 2020 race.",
    "“I’m going to look broadly at who might be able to pull together a team,” Harris said, noting she will work with colleagues in Cumberland and York counties to try to chart a path forward this week.",
    "Several Democrats reached for this story — though they did not want to say so publicly — did not hide that they felt their chances of flipping the 10th this year had now taken a major blow.",
    "According to map builder Jonathan Rodden’s analysis, the new 10th’s voters broke for Republicans by 53.2 percent to 46.8 percent in an average of key statewide races between 2016 and 2020.",
    "Because DePasquale had been positioning himself to run through most of the past year, a lot of other top-tier candidates had not been considering the Congressional race.",
    "As recently as last month, he had added fresh posts to his campaign sites touting polls by a coalition of progressive entities that he said showed Perry was vulnerable.",
    "“There’s enough time, but we definitely need to hustle.”\nIn their hotly-contested 2020 race, Perry bested DePasquale with 53.3 percent of the vote to 46.7 percent.",
    "DePasquale, a Pittsburgh native, was widely considered Perry’s top political threat, with his built-in name recognition and a winning political pedigree.",
    "Perry campaign spokesman Matt Beynon said after DePasquale’s announcement that his boss isn’t yet ready to celebrate Monday’s development.",
    "“The entire Perry campaign is prepared to have a vigorous campaign, regardless of who the Democrats decide to put up,” Beynon said.",
    "That leaves the party not only without its A-lister, but also kind of flat-footed in terms of rallying behind someone else.",
    "But in an announcement posted Monday to his Facebook page, DePasquale said he will not be a candidate this year.",
    "But she also acknowledged it’s going to be a scramble to pick up the pieces.",
    "Categories: News | Pennsylvania | Politics Election | Top Stories",
    "Still."
  ]
}