{
  "id": 1437,
  "mediaId": 2644,
  "date": "2022-02-12",
  "headline": "Damian Lillard may be back on Knicks’ radar in offseason after Blazers’ fire sale",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/1369484152.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/12/knicks-could-be-back-on-damian-lillard-in-offseason/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Berman",
  "authorUrl": "",
  "termIds": [
    4313,
    5373,
    5092,
    2127,
    2693,
    3533,
    903,
    1067,
    6532
  ],
  "sentences": [
    "So, we’re gonna take it super-duper slow with Damian, and make sure he’s ready, with next year certainly in mind.”\nSome league executives think Lillard might want to see how Portland rebuilds around him, but that’s very much an uncertainty.",
    "Lillard and DeRozan are friends, and Knicks general manager Scott Perry wanted to look closer at that scenario but the team’s top decision-maker, William Wesley, thought DeRozan was closer to being washed up than being an All-Star.",
    "PORTLAND, Ore. — One of the saving graces in the Knicks’ failure to make a deal at the trade deadline Thursday is that All-Star point guard Damian Lillard still is a Trail Blazer and could seek greener pastures in the offseason.",
    "“Part of this, too, for Damian, was just the mental break, as well,” said interim GM Joe Cronin, who took over after the Blazers fired longtime GM Neil Olshey in December following an investigation into his workplace behavior.",
    "“We’re happy with the things we’ve done, trying to create great possibilities for later on.’’\nLillard’s trade value won’t be as enormous it would have been last offseason because of his wasted season cut short by surgery.",
    "The Blazers made moves at the trade deadline to reshape the team around Lillard, but it doesn’t look as if they really succeeded, despite giving up guards CJ McCollum, Norman Powell and small forward Robert Covington.",
    "Portland downgraded its talent level for cap space and draft picks and no longer appeared capable of making a playoff push, with a 22-34 record entering its game against the Knicks on Saturday at Moda Center.",
    "If Lillard requests a trade in the offseason, the Blazers can move him anywhere, but because of the six-time All-Star’s dedicated service to small-market Portland, ownership would want to do right by him.",
    "I don’t see how they get him otherwise.’’\nOne NBA source said the Knicks’ best chance of attracting Lillard’s interest would’ve been signing swingman DeMar DeRozan in the offseason instead of Fournier.",
    "His future has been up in the air since last offseason when he sounded tired of not getting out of the first round of the playoffs and hinted he wanted to play somewhere he could compete for a title.",
    "With the Knicks in 12th place and five games under .500, they don’t hold the same appeal for Lillard, according to a source, as they did last season, when they were the success story of the NBA.",
    "On Friday, following the deadline, the Blazers said Lillard — currently playing on a four-year, $196 million deal through 2024-25 — likely will miss the rest of the season.",
    "They considered making some deals at the deadline to offload the contracts of players such as Cam Reddish, Alec Burks and Evan Fournier, but ultimately didn’t do anything.",
    "“And I think that’s an important one, especially after the load he’s carried the last nine years, specifically the last three years with the seasons running together.",
    "Find out more about New York sports betting\nThe Knicks pursued McCollum and didn’t get him, but the question remains: Do they even have the assets to land Lillard?",
    "They have all their first-round picks, a slew of extra second-rounders and Reddish, but a lot of their assets, other than RJ Barrett, have been devalued.",
    "DeRozan had four straight games of 35 points or more entering Saturday and will be heading back to the All-Star Game next weekend.",
    "However, Blazers insiders feel the Lillard is likelier to want to stay one more season now that blazers GM Neil Olshey was let go.",
    "“If they’re going to be in the hunt for Lillard, they’d have to have a good lottery pick this year,’’ one NBA executive said.",
    "Lillard, 31, said recently it wouldn’t make sense to return this season if the Trail Blazers are playing for the lottery.",
    "“It’s a sense of relief the deadline has finally passed,’’ Blazers coach Chauncey Billups said before facing the Knicks.",
    "The Knicks have monitored Lillard’s situation and have good intel with assistant coach Johnnie Bryant on their staff.",
    "Signing young Mavericks point guard Jalen Brunson as an unrestricted free agent is a likelier scenario.",
    "The Kemba Walker experiment has all but failed, so the Knicks still desperately need a point guard.",
    "The 36-year-old Bryant has served as a mentor to Lillard, a fellow native of Oakland, Calif.",
    "He had surgery on Jan. 13 to repair core muscles that were causing him abdominal pain.",
    "The Knicks would have to open up cap space of about $20 million to do so.",
    "We want to make sure he’s got the mental recovery necessary as well.",
    "“Because they’d have to give up RJ Barrett."
  ]
}