{
  "id": 16064,
  "mediaId": 8412,
  "date": "2022-03-09",
  "headline": "Lawmakers call for 100-year-old law that makes US gas shipping more expensive to be waived",
  "image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2022/03/0/0/GettyImages-1369654648-1.jpg?ve=1&tl=1",
  "link": "https://www.foxbusiness.com/economy/lawmakers-reforms-jones-act-gas-shipping",
  "mediaOutlet": "Pocono News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Best",
  "authorUrl": "https://www.foxbusiness.com/person/b/paul-best",
  "termIds": [
    0
  ],
  "sentences": [
    "Rep. Ed Case, D-Hawaii, cites the Jones Act as the reason that his state has to import nearly 100% of its crude oil from overseas, explaining that it costs three times as much to ship oil between the U.S. mainland and Hawaii than it does to ship oil from Asia to Hawaii, even though the distance between the mainland and Hawaii is much shorter.",
    "\"The executive action I am taking also reiterates my strong support for the Jones Act and American vessels, you know, and our ports, especially those important for America’s clean energy future and the development of offshore renewable energy,\" Biden said last year as he signed an order on strengthening American manufacturing.",
    "\"The best replacement for Russian oil imports to Hawai’i is domestic supply, and the transport of that supply 2,500 miles to our remote island state is subject to the Jones Act requiring any such transport to occur exclusively on a very limited number of domestic vessels,\" Rep. Case wrote in a letter to Biden on Tuesday.",
    "After Biden banned Russian oil imports this week over Putin's invasion of Ukraine, lawmakers are calling for the president to waive the Jones Act, a century-old law that critics deride as protectionist because it requires all oil and cargo shipped between U.S. ports to be on American built vessels with an American crew.",
    "Sen. Mike Lee, R-Utah, a longtime critic of the Jones Act, introduced a bill last year that would repeal the law and allow foreign vessels to carry cargo between U.S. ports, saying at the time that \"restricting trade between U.S. ports is a huge loss for American consumers and producers.\"",
    "EXXON MOBIL CEO SAYS OIL COMPANIES WERE IN TOUGH POSITION BEFORE UKRAINE-RUSSIA WAR\nRep. Scott Perry, R-Penn, said he will introduce a bill to create exemptions for ships carrying liquefied natural gas so that American cities and states can end their reliance on foreign LNG.",
    "White House Press Secretary Jen Psaki declined to say on Tuesday whether Biden is considering waiving the Jones Act in the wake of the Russian oil import ban, but the president has been a vocal supporter of the law.",
    "\"It's telling that this supposed national security law always has to be waived in times of a national emergency,\" Scott Lincicome, an economist at the libertarian Cato Institute, told Fox Business on Wednesday.",
    "\"As a result, the costs of such shipping, even if it were available domestically to start with, would be higher by a number of multiples than transport on the plethora of non-U.S. flagged specialty vessels.\"",
    "OIL PRICES RISE AFTER US BANS IMPORTS OF RUSSIAN CRUDE\nThe Jones Act was established in 1920 with the goal of maintaining a robust U.S. maritime industry, both for trade and national defense.",
    "(Mario Tama/Getty Images)\nWhile Hawaii's location in the Pacific Ocean makes it especially vulnerable to the Jones Act, other lawmakers around the country have also called for reforms.",
    "Maritime transportation industry leaders and military officials have expressed support for the Jones Act for decades, calling it vital to national security.",
    "\"The Jones Act has been around for about 100 years and has presided over really the slow degradation of the U.S. shipbuilding industry,\" Lincicome said.",
    "\"We have an industry that is simply uncompetitive, and not merely versus subsidized Chinese shipbuilders, but basically all global shipbuilders.",
    "For instance, President Trump waived the law in the wake of Hurricane Maria so that Puerto Rico could get much-need humanitarian supplies.",
    "But about a century later, only 96 Jones Act-qualified vessels exist in the U.S., according to the Department of Transportation.",
    "It now costs about four to five times to make a ship in the United States than it does abroad.\"",
    "The Jones Act can be temporarily waived during natural disasters and other crises.",
    "\"That just doesn't make a lot of sense.\""
  ]
}