{
  "id": 17091,
  "mediaId": 8254,
  "date": "2022-03-02",
  "headline": "Dem. Coplen first to officially challenge Scott Perry",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/Rick-Coplen.png?w=1280",
  "link": "https://www.abc27.com/election/dem-coplen-first-to-officially-challenge-scott-perry/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Seth Kaplan",
  "authorUrl": "https://www.abc27.com/author/seth-kaplan/",
  "termIds": [
    5700,
    4585,
    2693,
    3748,
    258,
    6500,
    6506,
    6040
  ],
  "sentences": [
    "He said his status as a combat veteran (he was a paratrooper in Panama in 1989, in the operation that led to the ouster of dictator Manuel Noriega) should help him in a district whose voters lean Republican and which has a Republican incumbent — in a year that (based on current national polling) could be problematic for Democratic candidates.",
    "“We are going to focus on helping to unite the United States starting here in Central Pennsylvania,” Coplen said Wednesday afternoon while preparing at the Carlisle Ribbon Mill for his official announcement, scheduled for 6:30 p.m.\n“We’ve got a lot of disunity,” Coplen said.",
    "CARLISLE, Pa. (WHTM) — Democrat Rick Coplen, a Carlisle school board member, confirmed he’s running against Rep. Scott Perry (R) in Pennsylvania’s newly-redrawn 10th Congressional district.",
    "“I will knock on more doors than Scott Perry or any of his colleagues ever thought about doing.”\nAs for the possibility of other Democratic challengers vying to fact Perry instead?",
    "The field opened for Democrats after Eugene DePasquale (D), the former auditor general who lost to Perry in 2020, announced Monday he wouldn’t seek the nomination.",
    "“Scott Perry is actually a huge part of that” — he cited questions about Perry’s role in encouraging protests in Washington that turned violent on Jan. 6, 2022.",
    "“I welcome any challengers in our primary, and I won’t change a thing about how I’ll run,” Coplen said.",
    "Coplen originally planned to run for state senate but switched course after DePasquale’s announcement.",
    "Coplen said his priorities include healthcare, education, and the environment (see below).",
    "Pennsylvania will have 17 representatives in the U.S. House after November’s election.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "“I’m not going to worry so much about the national politics,” Coplen said.",
    "Perry couldn’t immediately be reached for comment.",
    "Sign up for the abc27 newsletters here."
  ]
}