{
  "id": 17139,
  "mediaId": 8254,
  "date": "2022-03-03",
  "headline": "Pa. GOP shuffle could have picked up a seat, but incumbent isn’t dancing",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/Congressional-Map-Midstate-highlight.jpg?w=1280",
  "link": "https://www.abc27.com/news/this-week-in-pennsylvania/pennsylvania-politics/pa-gop-shuffle-could-have-picked-up-a-seat-but-incumbent-isnt-dancing/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ben Schad",
  "authorUrl": "https://www.abc27.com/author/ben-schad/",
  "termIds": [
    0
  ],
  "sentences": [
    "HARRISBURG, Pa. (WHTM) — Republicans in Pennsylvania and beyond are frustrated at the new congressional map that would force two incumbents to square off and they’re upset at one of their own for not going along with a plan that would’ve helped them even the score.",
    "The new congressional map chosen by the State Supreme Court put Congressman Fred Keller (R-PA 12th), the junior Pa. Republican, in the 15th district with Glenn Thompson, the senior Pa. Republican.",
    "“Meuser now goes from running a tough race against a fellow Republican or potentially, against a Democrat to really just being able to take it pretty easy on the campaign level,” Nicholas said.",
    "The plan called for Dan Meuser to move from his current 9th to the neighboring 8th and take on, in theory, bump off 10-year incumbent Democrat Matt Cartwright.",
    "“I bumped over, the other one of us could’ve bumped over and ran against Cartwright and it would’ve been all hand on deck to defeat Cartwright,” Keller said.",
    "“Well, I’m gonna talk about the positive things I have to talk about and that’s getting people elected to office,” Keller responded.",
    "Northeast Pa. NEPA, his business is there, he’s lived there for a long time,” Christopher Nicholas of Eagle Consulting Group.",
    "Meuser has money, name recognition and, many believe, would benefit from the coming red wave on election day.",
    "He’ll stay in the overwhelmingly Republican 9th saving the cash and the clash with an entrenched incumbent.",
    "“There was an opportunity for all of us to run and potentially have a race against Matt Cartwright.",
    "It was a strategy supported by Republicans in Washington to pick up a seat in Pennsylvania.",
    "To fight back, the Republican strategy would have two incumbents take baby steps east.",
    "Because Dan Meuser has deep ties to that 8th district which is what we all call NEPA.",
    "“That had to be a little dicey when you said ‘I’m gonna run in the 9th’?” I asked.",
    "Not so easy for Keller, who bowed out rather than take on another Republican.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "We did reach out to Dan Meuser, who declined to comment for this story.",
    "But the unnamed “other one of us” is Meuser who said no thanks.",
    "“I’ve gone to church in the new nine since 1978,” Keller said.",
    "“The liberal supreme court wanted to get rid of a Republican.",
    "Keller to the new 9th in which he grew up and has deep ties.",
    "They also want to make Republicans fight,” Keller said.",
    "Sign up for the abc27 newsletters here.",
    "A seat had to be sacrificed somewhere.",
    "That didn’t turn out,” Keller said.",
    "Republicans would pick up a seat.",
    "Is that strategy sound?",
    "Nicholas understands.",
    "“Yes."
  ]
}