{
  "id": 2183,
  "mediaId": 2522,
  "date": "2022-02-07",
  "headline": "Boebert bill seeks to end taxpayer-funded ‘free, free, free’ legal support for migrants coming to US illegally",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/02/SG-Lauren-Boebert.jpg",
  "link": "https://www.bizpacreview.com/2022/02/07/boebert-bill-seeks-to-end-taxpayer-funded-free-free-free-legal-support-for-migrants-coming-to-us-illegally-1198085/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "https://www.bizpacreview.com/author/terresa-monroe-hamilton/",
  "termIds": [
    5644,
    5592,
    5252,
    4905,
    2254,
    3934,
    6026
  ],
  "sentences": [
    "The Vera Institute of Justice told Fox News in January that providing legal representation to immigrants is “widely supported and in line with our most fundamental shared American values.”\n“No one should appear in immigration court without a lawyer, especially when the consequences include possible deportation and separation from one’s family and community.",
    "It really has to stop and my bill is the first step in this process.”\nThe legislation also zeroes in on private organizations getting federal taxpayer dollars that fund immigrant defense programs, specifically the Vera Institute of Justice which was awarded a $158 million taxpayer-funded contract to help unaccompanied minors avoid deportation.",
    "Boebert asserted it’s time to return to former President Trump’s policy of “America first.”\n“Gone are the days where we allow foreign nationals to break our laws illegally, cross the Southern border, and then we the people provide a legal defense at American taxpayers’ expense so they can remain here illegally,” she declared.",
    "GOP Reps. Mo Brooks of Alabama, Matt Gaetz of Florida, Louie Gohmert of Texas, Lance Gooden of Texas, Paul Gosar of Arizona, Tom McClintock of California, Bill Posey of Florida, Scott Perry of Pennsylvania, Tom Tiffany of Wisconsin, and Mary Miller of Illinois all back Boebert’s bill.",
    "“This heinous misuse of tax dollars to undermine the rule of law is emblematic of the Biden administration’s extremely harmful policy of importing as many illegal aliens as they can as quickly as they can.”\nThe bill would make a legal aid exception for minors who have been trafficked.",
    "SIGN UP HERE\nRep. Lauren Boebert (R-CO) has introduced new legislation that is strongly supported by House conservatives, called “No Taxpayer-Funded Lawyers for Illegal Aliens Act,” which cuts off federally-funded legal support to those who come into the United States illegally.",
    "It’s the government’s responsibility to protect the fundamental rights, health, and security of everyone in our communities, including immigrants who are targeted by our expanding federal enforcement system,” the organization added.",
    "“Non-profit entities and the Biden Administration brazenly use taxpayer dollars for lawyers for illegal aliens to abuse American laws and courts and avoid the deportation they deserve,” Brooks noted in a statement.",
    "pic.twitter.com/Si24Dmnf9a\n— Ashley Hinson (@hinsonashley) February 4, 2022\n(Video Credit: Fox News)\nBoth bills stand little chance of moving forward since Democrats control Congress currently.",
    "The Legal Access at the Border (LAB) program seeks to assist migrants in their preparation to enter the immigration process for Arizona, California, and Texas, Axios reported in January.",
    "Rep. Ashley Hinson (R-IA) introduced legislation called “Stop the Betrayal Act” last month to prohibit taxpayer money from being spent on migrant flights into the U.S. interior.",
    "Services will be provided to those attempting to cross the Southern border, already in Border Patrol custody, or who are enrolled in the reinstated Remain in Mexico program.",
    "Boebert told Fox News that no organization or city that is the recipient of federal funds should spend it on legal aid for people who cross the southern border illegally.",
    "“The principle is really simple: No more American tax dollars to help illegal aliens cut the line and skirt our laws,” Boebert said in an interview with Fox News Digital.",
    "The Vera Institute is collaborating with a number of cities across the nation in an effort to create a public defender system for immigrants facing deportation.",
    "The bill takes direct aim at the Biden administration’s effort to provide legal services to illegal immigrants coming into the country via seven border towns.",
    "But they are a taste of what is coming down the pike if Republicans win back both the House and Senate in the 2022 midterm elections.",
    "Cities have given an estimated $5.6 million in taxpayer money to the legal defense of illegal immigrants, according to one report.",
    "Her bill is in response to footage showing illegal immigrants being secretly flown into the United States in the dead of night.",
    "Boebert’s bill would also block cities from funneling money towards legal aid given to illegal immigrants.",
    "Boebert’s bill is endorsed by NumbersUSA and the Federation for American Immigration Reform (FAIR).",
    "“Democrats want to treat border detention facilities like an Oprah Winfrey show,” Boebert quipped.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "— timbo (@tjw1983) February 7, 2022\nShe’s not alone by any means.",
    "a shame there has to be a law to enforce what’s common sense.",
    "It is widely expected they will sweep the board in November.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "The Biden border crisis is threatening our communities.",
    "“You get free education, you get a free plane ticket.",
    "The public will not see it and we do not share it.",
    "I’m leading the charge in Congress to fight back.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "You get free medical care.",
    "You get free, free, free.",
    "seems like common sense.",
    "Enough is enough."
  ]
}