{
  "id": 28,
  "mediaId": 2551,
  "date": "2022-02-24",
  "headline": "Republicans criticize Biden for admitting he 'knew' about Russia's invasion of Ukraine for months but still 'did nothing' and not sanctioning Putin personally is a 'big mistake'",
  "image": "https://i.dailymail.co.uk/1s/2022/02/24/22/54622875-0-image-a-21_1645741116098.jpg",
  "link": "https://www.dailymail.co.uk/news/article-10549177/Republicans-criticize-Biden-admitting-knew-Russias-invasion-Ukraine-months.html?ns_mchannel=rss&ito=1490&ns_campaign=1490",
  "mediaOutlet": "Daily Mail",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Morgan Phillips",
  "authorUrl": "https://www.dailymail.co.uk/home/search.html?s=&authornamef=Morgan+Phillips,+Politics+Reporter+For+Dailymail.Com",
  "termIds": [
    1664,
    1940,
    2638,
    2765,
    4591,
    4905,
    5891,
    1126,
    1394,
    6569,
    6645,
    6672,
    6678
  ],
  "sentences": [
    "+19\nView gallery\nFormer President Donald Trump, speaking at a super PAC fundraiser at his Mar-a-Lago resort in Florida, spoke off the cuff about the impending military action Wednesday night\n+19\nView gallery\nTrump spoke to Fox News' Laura Ingraham as the bombs went off in Kyiv\n+19\nView gallery\nTrump then again said that Vladimir Putin was 'smart,' as he had during interviews given on Tuesday\n+19\nView gallery\nTrump again criticized President Joe Biden for his actions ahead of the crisis\n+19\nView gallery\nTrump said that, despite having good relationships with Russian President Putin and Chinese President Xi (right), he 'kept them apart\n+19\nView gallery\n+19\nView gallery\nEarlier in the interview, in which Trump spoke over the phone with Ingraham, Trump bemoaned that this was happening at all.",
    "'America's incompetent right now,' said TV host Ben Ferguson as he warned that adversaries were taking advantage\n+19\nView gallery\nFormer President Trump called into Fox News on Wednesday to claim the attack would not have happened on his watch\nRep Scott Perry was among the Republicans who took to Twitter to blast Biden for Putin's aggression in Ukraine\nOthers warned that America's allies were watching what was unfolding and see American weakness on the world stage\n+19\nView gallery\nA steady stream of Republicans tweeted their anger at Biden and warned that the country's enemies would be watching.",
    "+19\nView gallery\nAs Russian tanks moved through Crimea, and Russia began its bombardment of Ukraine, scores of Republicans trained their fire on President Joe Biden rather than Vladimir Putin accusing the US leader of weakness\n+19\nView gallery\nThe first speaker at the CPAC conservative gathering in Orlando, Florida, on Thursday gave a taste of things to come.",
    "Early on February 24, after invasion begins\n+19\nView gallery\nPeople waiting for a Kiev bound train spread on a platform in Kostiantynivka, the Donetsk region, eastern Ukraine\n+19\nView gallery\nRepublicans are also less likely to say they're very or extremely concerned that Russia's influence around the world poses a direct threat to the US.",
    "She has been accused of cozying up to dictators and spreading Putin's propaganda by saying an invasion would not have happened if the West had addressed Russia's concerns about Ukraine joining NATO - even though the Russian president has also said Ukraine had not right to exist independently of Russia.",
    "In a baffling moment of Biden's Thursday address, the president said he always knew his sanctions would do nothing to halt Putin's attack, despite his administration repeatedly insisting that the sanctions were dangled over Putin's head to deter him from attacking.",
    "With the Republican foreign policy establishment focusing their condemnation on Putin, it suggested the issue of Russia is a new litmus test for conservatives - just like the January 6 violence and Trump's claims that he was cheated of the election.",
    "As Russia forges ahead with its deadly invasion of Ukraine, Republicans eviscerated President Biden for admitting he knew Vladimir Putin would launch the attack even with U.S. sanctions and for failing to sanction the Russian leader personally.",
    "Jeff Bezos accuses Elon Musk of being in pocket of CHINESE government and woke actress Jameela Jamil claims she'll never tweet again as showbiz stars whine about tycoon's $44bn purchase of Twitter, and other top stories from April 26, 2022.",
    "Trump added: 'But here’s a guy that says, you know, \"I'm gonna declare a big portion of Ukraine independent,\" he used the word 'independent' and 'we’re gonna go out and we’re gonna go in and we’re gonna help keep peace.'",
    "+19\nView gallery\nAs Vladimir Putin launched a bombing campaign of Ukraine that signaled the start of a full-blown invasion, scores of Republicans unloaded on the leader they saw as the villain: President Joe Biden.",
    "'It was just a made up hoax and it really hurt our country but despite the hoax, I had a good relationship and with president XI of China, other than the fact that I was tariff-ing and taxing the hell out of him.'",
    "But leading the way in condemning Biden was Trump, who told Fox News in a freewheeling interview that this wouldn't have happened under his administration and again making claims of a rigged election in 2020.",
    "'He somehow has to transform from this guy reading cue cards in the middle of the day, to a president that's giving major primetime addresses, including press conferences, about what he thinks we should do.'",
    "'As we pray for the Ukrainian people, make no mistake: THIS is what happens when America’s enemies see a weak and incompetent @POTUS,' tweeted U.S. Rep. Scott Perry, adding the hashtag Bidenisafailure.",
    "Some took their lead from former President Donald Trump's rambling appearance on Fox News on Wednesday night, when he claimed his good relationship with Putin would have prevented the invasion.",
    "Ingraham then asked Trump what he thought of President Biden's approach, in which Ingraham said Biden was 'monitoring the situation' and then would talk to fellow G7 leaders Thursday.",
    "'President Biden says he knew for MONTHS that Russia was planning to attack Ukraine and still made no strong move to prevent them from doing so,' Rep. Lisa McClain wrote on Twitter.",
    "The Associated Press-NORC Center for Public Affairs Research found only 22% of Republicans think the U.S. should play a major role in the conflict, compared with 32% of Democrats.",
    "'So that makes people go to different voices to try to say, okay, you know, if you're not a military expert, do you think we should use America's might, its treasure to intervene?",
    "Biden announced a slew of new sanctions on Thursday, but left the Russian leader's personal assets out of it\n 'No one expected the sanctions to prevent anything from happening.",
    "As explosions were reported in Kyiv, Kharkiv and other areas of Ukraine, Trump called the scene a \"terrible situation\" and insisted Putin never would have moved on his watch.",
    "'He drove them together and Biden -- I kept them apart - and Biden now it's a great love fest and that's a very bad thing and I think you can probably add Iran into it too.'",
    "pic.twitter.com/v4RkhqvCd3\n— danny (@dabbs346) February 24, 2022\n Trump on Tuesday praised Putin's move to declare the Donetsk and Luhansk regions of Ukraine 'independent.'",
    "Earlier Thursday Trump, speaking at a super PAC fundraiser at his Mar-a-Lago resort in Florida, spoke off the cuff about the impending military action Wednesday night.",
    "Matt Schlapp, who heads the organization behind CPAC and a leading conservative voice, said the issue of Russia and Ukraine would be a key theme of the next four days.",
    "He said that sanctions on Putin were 'on the table' but did not answer a question as to why he hadn't been included in Thursday's round of financial restrictions.",
    "Rep Elise Stefanik, who won Cheney's position as the third most senior Republican in the House because of her backing for Trump, made clear where she stood.",
    "'America is a place right now that is not going to even understand how to organise the world to fight back against tyrants and dictators around the world.",
    "House Republican Leader Kevin McCarthy, who has been keen to demonstrate his close relationship with Trump, did not mention Biden at all in his comments.",
    "Rep. Tony Gonzalez, R-Texas, said that without a strong response, Russia's attack on Ukraine would embolden China to make similar moves with Taiwan.",
    "It didn't for a very good reason and I'll explain that to you someday, but it wouldn't have taken place and it wouldn't have taken place right now.",
    "Pause\n0:00 / 0:00\nVoltax\nFull-screen\nBiden announced a slew of new sanctions on Thursday, but left the Russian leader's personal assets out of it.",
    "Ukraine deserves our full support in their fight for democracy against Russia’s unjustified attacks so that other bad actors don’t follow suit.'",
    "'It's a very sad thing for the world, for the country, and it's certainly very sad for a lot of people that are going to be needlessly killed.'",
    "'After just one year of a weak, feckless, and unfit President of the United States and Commander-in-Chief, the world is less safe,' she said.",
    "I got along with him fantastically despite the fact I shut down Nord Stream-2, nobody would've heard of Nord Stream 2 if it weren't for me.",
    "He then went through a story about how he disagreed with former German Chancellor Angela Merkel over the strategy regarding Nord-Stream 2.",
    "'And I would say I think most of the people here would actually listen to the case to protect Ukraine, but the president has to make it.",
    "'You know, the Liz Cheney wing of the Republican Party is becoming increasingly marginalized and discredited,' he told DailyMail.com.",
    "The commander-in-chief said that Putin not only wants to conquer Ukraine but has ambitions to fully restore the old Soviet Union.",
    "For days, Tucker Carlson has been setting out the ground for questioning Biden's response on his highly-rated Fox News show.",
    "And hours later it was the recurring theme as conservatives gathered in Orlando, Florida, for the annual CPAC conference.",
    "'As a young man growing up, I always heard that the worst thing that could happen is drive those two countries together.",
    "He's taking over a country - a vast, vast location, a great piece of land with a lot of people - just walking right in.",
    "And as an American I'm angry about it and I'm saddened by it,' he said, calling into Laura Ingraham's Fox News show.",
    "In a tweet, House Republicans said: 'President Biden’s weakness on the world stage has emboldened our enemies.",
    "Trump then linked the invasion with the failed pullout from Afghanistan by the Biden administration in 2021.",
    "'Rather than peace through strength, we are witnessing Joe Biden's foreign policy of war through weakness.'",
    "'Not going after him personally is an even bigger mistake,' the South Carolina Republican wrote on Twitter.",
    "+19\nView gallery\n+19\nView gallery\nA military column moves across the town of Armyansk, northern Crimea.",
    "'It's a terrible thing the way it started, I don't believe he wanted to do this initially,' Trump said.",
    "The former president spoke about America's enemies during the crisis, saying: 'Now they laugh at us.",
    "Trump then again said that Vladimir Putin was 'smart,' as he had during interviews given on Tuesday.",
    "It's a sad thing for the world and the country and a lot of people that will be needlessly killed.'",
    "He drove them together because one needed the energy and the other needed the money,' Trump added.",
    "'I went in yesterday and there was a television screen, and I said, \"This is genius,\"' Trump said.",
    "And now he and his country will bear the consequences,' Biden said in remarks at the White House.",
    "And while Republicans set their sights on the U.S. president's failures, Biden went after Putin.",
    "'The Biden administration continues to miss the moment,' Sen. Lindsey Graham wrote on Twitter.",
    "'Putin declares a big portion of the Ukraine - of Ukraine - Putin declares it as independent.",
    "'The United States stands with the people of Ukraine and prays for their safety and resolve.'",
    "That makes former Democratic presidential runner Tulsi Gabbard a fit for the lineup at CPAC.",
    "'I don't think he's monitoring, I think he is probably sleeping right now,' Trump retorted.",
    "I really believe that it was Afghanistan, when he looked at that horrible, weak pullout.'",
    "Trump argued he'd have used his good relationship with Putin to stop this from happening.",
    "Not giving clarity to Putin about what would happen if he invaded Ukraine was a mistake.'",
    "You see what happened with Durham and those reports and other reports including Mueller.",
    "He saw the weakness and you know, it really started with the weakness in Afghanistan.",
    "In fact, some people are saying why didn't this take place over the last four years?",
    "'He sees the weakness and the incompetence and the stupidity of this administration.",
    "'America's incompetent right now,' said CPAC's first speaker, TV host Ben Ferguson.",
    "'He's taken over a country for $2 worth of sanctions, I'd say that's pretty smart.",
    "'I think he wanted to do something and negotiate it and had got worse and worse.",
    "Recent polling suggests there is little support for a US role in the conflict.",
    "He has repeatedly asked why the US should side with Ukraine rather than Putin.",
    "That's the strongest peace force… We could use that on our southern border.",
    "Had I been in office, not even thinkable, this never would have happened.'",
    "Ingraham asked Trump about the continuing closeness between Putin and Xi.",
    "'He is going to test the resolve of the West to see if we stay together.'",
    "He said there were differences between the party coalition has spread.",
    "Trump also called Biden 'a man who has no concept of what he's doing.'",
    "'Vladimir Putin’s invasion of Ukraine is reckless and evil,' he said.",
    "And we have to show resolve so he knows what's coming,' Biden noted.",
    "I really believe that's where he started thinking he could do this.'",
    "That’s why you have Ukraine, that’s why you’re going to have China.",
    "Taiwan is next, and you’re going to see the same kind of thing.'",
    "At Mar-a-Lago event, Trump says \"Trump said Putin is smart.",
    "'This is a terrible thing that should never have happened.",
    "'Putin and his inner circle live large all over the world.",
    "It is past time for democracies to bring him to account.",
    "This never would have happened and I know him very well.",
    "This would not have happened during my administration.",
    "'Well, I had a good relationship with both,' he said.",
    "He's taken over a country for $2 worth of sanctions.",
    "He wants to re-establish the former Soviet Union.",
    "That is what this is about,' the president said.",
    "That’s the strongest peace force I've ever seen.",
    "There were more army tanks than I’ve ever seen.",
    "Here’s a guy who’s very savvy,' Trump went on.",
    "And you know what the response was from Biden?",
    "As Americans, we stand on the side of freedom.",
    "'He has much larger ambitions than Ukraine.",
    "And that's why they're doing it right now.'",
    "China, Iran, and North Korea are watching.'",
    "'And he's gonna go in and be a peacekeeper.",
    "It really started with Obama and energy.",
    "The way they pulled out of Afghanistan.",
    "the former U.S. president continued.",
    "They’re gonna keep peace all right.'",
    "You gotta say that’s pretty savvy.",
    "We had many, many times together.",
    "'This should have never happened.",
    "But not everyone was in lockstep.",
    "'Today Ukraine, tomorrow Taiwan.",
    "'It was hurt by the Russia hoax.",
    "I am the one that shut it down.'",
    "'I said, \"How smart is that?'\"",
    "They didn’t have one for that.",
    "I'd say that's pretty smart.\"",
    "'Well, I know him very well.",
    "It's going to take time.",
    "'Putin is the aggressor.",
    "Oh, that's wonderful.'",
    "There was no response.",
    "'I know him very well.",
    "Very, very, very well.",
    "'No, but think of it.",
    "Putin chose this war.",
    "No, it’s very sad.",
    "Very sad."
  ]
}