{
  "id": 2819,
  "mediaId": 2641,
  "date": "2022-01-31",
  "headline": "Republicans Demand Report on CBP Agents Biden Accused of Whipping Migrants",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=9b9c97e4-ff89-4588-b04b-6baff27648e1&SiteName=Newsmax",
  "link": "https://www.newsmax.com/newsfront/haitian-migrants-horse-whips/2022/01/31/id/1054842/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Koutsobinas",
  "authorUrl": "",
  "termIds": [
    4873,
    4905,
    2426,
    2254,
    3516,
    2693,
    1397,
    1126
  ],
  "sentences": [
    "\"The widespread narrative of whipping based on a demonstratable lie — especially by members of this administration — demands that the public record be finalized by publicly disclosing the 'investigative work' conducted by Customs and Border Protections' (CBP) Office of Professional Responsibility (OPR),\" Reps. Chip Roy, R-Texas; Brian Babin, R-Texas; Scott Perry, R-Pa.; Andy Biggs, R-Ariz.; Mary Miller, R-Ill.; Michael Cloud, R-Texas, and Darrell Issa, R-Calif., noted in their letter to Secretary Mayorkas.",
    "Seven House Republicans, three from Texas, requested in a letter Monday that Homeland Security Secretary Alejandro Mayorkas publish the investigation's findings regarding the accusations that horsebound agents were using split reins to whip migrants, the Washington Examiner reported.",
    "But, according to one Department of Homeland Security official, they said they doubt \"the current administration will release this report on the horse patrol incident because it makes the administration look terrible.",
    "Following the event, President Joe Biden said those migrants were \"being strapped\" and vowed to make \"those people ... pay,\" referring to the border agents, for the perceived whipping of migrants.",
    "The American people deserve transparency from their government, and the United States Border Patrol deserves defense from their Department's Secretary against unfounded accusations.\"",
    "Republicans are demanding the Biden administration release a report following the investigation of Customs and Border Protection (CBP) agents whipping Haitian migrants.",
    "On Sept. 19, 2021, mounted agents holding split reins were photographed on the Rio Grande in Del Rio, Texas, trying to prevent migrants from entering the U.S.",
    "They essentially convicted the mounted agents based upon a lie, which the investigation after 120 days would surely have revealed.\"",
    "\"For four months, the Biden administration and your Department have gone without even apologizing to the agents that were smeared.",
    "\"My experience,\" the official added, \"would be that this would have been done within a period of weeks.\"",
    "The report was due late last week, but there was no comment on it from the Biden administration.",
    "So far, the Examiner noted there have been \"no new developments\" on the matter.",
    "The agents rode along the riverbank to stop the migrants from entering."
  ]
}