{
  "id": 3013,
  "mediaId": 2618,
  "date": "2022-02-01",
  "headline": "Watch Live: Freedom Caucus Holds Hearing on Biden’s Border Policies After Record-Breaking Year of Illegal Migration",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/02/01/watch_live_freedom_caucus_holds_hearing_on_bidens_border_policies_after_record-breaking_year_of_illegal_migration_78289.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "",
  "termIds": [
    4905,
    4794,
    1708,
    1738,
    1892,
    4066,
    3134,
    2693,
    520,
    188,
    6678
  ],
  "sentences": [
    "The House Freedom Caucus will hold a hearing Tuesday to analyze how President Joe Biden’s border policies have affected migration at the southern border after Biden’s first year in office ended with record-breaking numbers of illegal migrant apprehensions.The hearing will feature several members of the Freedom Caucus, including the new caucus chairman, Rep. Scott Perry (R-PA), as well as key border officials, including the U.S. Border Patrol union president, Brandon Judd.The hearing begins at 3:00 p.m. and is taking place at the FreedomWorks headquarters in Washington, DC.",
    "Does it make any difference as the wimpy Republicans have done zilch to keep the leftist, progressive, and socialist Democrats from flooding the USA with what the Democrats call future “New American” voters, but what the immigration laws call illegal aliens.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "Once the Democrats register tens of millions of their “New American” voters most of the wimpy Republicans will be lucky if they can get elected as local dog catchers.",
    "Should have been on camera everyday since Jan 20 last year screaming about Biden’s borders ICE and illegals being shipped in the middle of the night.",
    "The entire issue was discussed in depth, including the fact that the U.N. is enabling and supporting the illegals all along the way.",
    "Apparently the cartels, who are already known to be aiding the smugglers & the illegals, are simpatico with the U.N.?!",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "We watched this vital and informative Hearing today on OANN, as the other networks ignored it.",
    "...(The GOP slumbers on, not even allowing a room for this investigative meeting!)",
    "This is a battle for the narrative and Republicans always lose thus battle.",
    "Your donation helps keep our discussions going and our voices heard.",
    "Why America funds the U.N.is beyond reason!",
    "Way too late as usual.",
    "This is a must see!",
    "Why after a year?",
    "Thank you."
  ]
}