{
  "id": 3273,
  "mediaId": 2630,
  "date": "2022-02-01",
  "headline": "RNC to debate endorsing ouster of Cheney, Kinzinger from House GOP",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220201-liz-cheney-adam-kinzinger-2021-ac-654p-f5604c.jpg",
  "link": "https://www.nbcnews.com/politics/politics-news/rnc-debate-endorsing-ouster-cheney-kinzinger-house-gop-rcna14480",
  "mediaOutlet": "NBC Breaking News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5037,
    2765,
    2887,
    3067,
    3896,
    3935,
    1125,
    1117,
    1126,
    1477
  ],
  "sentences": [
    "Rep. Liz Cheney responds to Trump’s Jan. 6 comments: ‘He clearly would do this all again’\nJan. 31, 202201:34\nTrump has lambasted Cheney, R-Wyo., and Kinzinger, R-Ill., for voting to impeach him in 2021, in addition to serving on the Jan. 6 committee that's investigating last year's attack on the Capitol by a mob of pro-Trump supporters.",
    "The consideration comes after David Bossie, a close ally of former President Donald Trump and an RNC member from Maryland, submitted a resolution endorsing the removal of the two lawmakers from the House Republican caucus, an RNC official confirmed to NBC News Tuesday.",
    "Last week, The Dispatch reported that House Minority Leader Kevin McCarthy, R-Calif., had pushed back on an effort from Freedom Caucus Chairman Scott Perry, R-Pa., to boot Cheney from the conference because doing so could lead to Republicans losing committee seats.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nCheney, in a statement Tuesday, said: \"I’m a constitutional conservative and I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump.",
    "\"I think their time would be better served by focusing on 2022 rather than an unprecedented and shortsighted effort to purge two lifelong Republicans for simply telling the truth and upholding their oaths of office,\" she said in a statement Wednesday.",
    "The resolution, first reported by The Washington Post, would be purely symbolic in nature, but its passage would serve as yet another reminder that the party’s interests and the former president’s are one and the same.",
    "An NBC News poll released last month showed that 36 percent of Republican-leaning voters said they were more a supporter of the former president than the GOP — down 18 points from the eve of the 2020 election.",
    "She told reporters at a breakfast meeting in November that she still considers Cheney to be a Republican, but she remains close to Trump, who installed her in the job after winning the 2016 election.",
    "The RNC’s focus should instead be taking control of the House in the midterm elections in November, he said, adding that the resolution \"clearly doesn’t serve our purposes in winning elections.\"",
    "Rep. Marjorie Taylor Greene, speaking on former Trump adviser Steve Bannon’s “War Room“ podcast last month, said: \"We’re going to kick [Cheney] out of our conference, that is going to happen.\"",
    "The Republican National Committee will debate endorsing the ouster of Reps. Liz Cheney and Adam Kinzinger from the House GOP conference during its winter meeting in Salt Lake City this week.",
    "One person close to Cheney described her as an \"unapologetic and unquestioned conservative,\" and noted that her votes aligned with Trump 93 percent of the time when he was in office.",
    "Passage of the resolution would undoubtedly please the former president, who is working to defeat Republican lawmakers — Cheney included — who voted for his impeachment last year.",
    "It is unclear whether the resolution will work its way through RNC committees and win approval from the 168-member body at the organization's general meeting on Friday.",
    "At the time, Sen. Mitt Romney, R-Utah, tweeted: \"Expelling Liz Cheney from leadership won’t gain the GOP one additional voter, but it will cost us quite a few.\"",
    "Republicans last year removed Cheney from her position in the House GOP leadership in response to her criticism of the former president.",
    "But Greene, R-Ga., also highlighted Cheney’s voting record, saying it was \"more conservative than some of my Republican colleagues.\"",
    "The proposed show of loyalty to Trump this week comes amid signs his grip over the GOP may not be quite as tight as it once was.",
    "One RNC member attending the winter meeting, Henry Barbour of Mississippi, said he wasn't in favor of Bossie's resolution.",
    "\"We have a huge opportunity in 2022 to retake the House and Senate and that’s where our focus has to be,\" Barbour said.",
    "Both Cheney and Kinzinger have been deeply critical of the former president and his role in fomenting the Jan. 6 riot.",
    "The resolution comes as some House Republicans have pushed for GOP leadership to remove Cheney from the conference.",
    "Should Trump run for president again in 2024, he could potentially face Cheney in the GOP primaries.",
    "Maura Gillespie, a Kinzinger spokesperson, said: \"We’ll see what happens.\"",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "\"Political parties don’t purge their members,\" Barbour told NBC News.",
    "The resolution puts RNC Chairwoman Ronna McDaniel in an awkward spot.",
    "Bossie did not immediately respond to a request for comment.",
    "I will never stop fighting for our constitutional republic.",
    "History will be their judge.",
    "No matter what.\""
  ]
}