{
  "id": 3436,
  "mediaId": 8322,
  "date": "2022-01-31",
  "headline": "Republicans insist on release of report on alleged whippings at the border",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/09/Border-Patrol-horse.jpg",
  "link": "https://www.foxnews.com/politics/republicans-whippings-border-report",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Lee",
  "authorUrl": "https://www.foxnews.com/person/l/michael-lee",
  "termIds": [
    2859,
    2693,
    2426,
    4873,
    4905,
    1126,
    1441,
    6199
  ],
  "sentences": [
    "\"As has been well documented, the ‘whipping’ narrative was based on a photograph that first went viral on social media,\" the letter reads \"While this narrative was later debunked by the photographer of the photo himself, the widespread narrative of whipping based on a demonstratable lie — especially by members of this administration — demands that the public record be finalized by publicly disclosing the ‘investigative work.’\"\nThe Department of Homeland Security could not immediately be reached for comment.",
    "\"It has been more than four months since senior members of the Biden Administration, including President Biden and Press Secretary, Jen Psaki participated in a widely spread falsehood and accused United States Border Patrol agents of 'whipping' Haitian migrants attempting to illegally cross into the United States near Del Rio, Texas on September 19, 2021,\" reads the letter sent to Mayorkas Monday.",
    "The letter, which was signed by Texas Reps. Chips Roy, Brian Babin, and Michael Cloud, as well as Reps. Andy Biggs, R-Ariz., Scott Perry, R-Pa., Mary Miller, R-Ill., and Darrell Issa, R-Calif., quotes an anonymous DHS official saying they \"doubt the current administration will release this report of the horse patrol incident because it makes the administration look terrible.\"",
    "A group of Republican lawmakers penned a letter to Homeland Security Secretary Alejandro Mayorkas insisting the Biden administration release the findings of its investigation into accusations Border Patrol agents on horseback were photographed whipping Haitian migrants.",
    "Mayorkas had promised in September that a report on the incident would be available to lawmakers in \"a matter of days, not weeks,\" a self-imposed deadline that has now been missed by over four months.",
    "At issue were September images that showed Border Patrol agents on horseback preventing Haitian migrants from crossing the border, with one picture showing an agent grabbing onto a migrant's shirt.",
    "The images became controversial after some media outlets and Democratic lawmakers incorrectly stated that the split reins used to control the agents' horses were \"whips\" being used on the migrants.",
    "\"To see people treated like they did, horses barely running over, people being strapped – it's outrageous,\" President Biden said at the time, making a whipping motion with his hand.",
    "The comments outraged Border Patrol agents, who argued the president threw the officers under the bus while not understanding what the reins were actually used for.",
    "There will be an investigation underway now and there will be consequences.",
    "\"I promise you, those people will pay.",
    "There will be consequences."
  ]
}