{
  "id": 3721,
  "mediaId": 2618,
  "date": "2022-01-23",
  "headline": "Six former Navy SEALs run for Congress with one goal: Take down Pelosi",
  "image": "https://www.lucianne.com/assets/favicon.ico",
  "link": "https://www.lucianne.com/2022/01/23/six_former_navy_seals_run_for_congress_with_one_goal_take_down_pelosi_77609.html",
  "mediaOutlet": "lucianne.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Heather Hamilton",
  "authorUrl": "",
  "termIds": [
    5243,
    4794,
    3246,
    3556,
    4066,
    1484,
    1477,
    6406,
    6159,
    6729,
    6653
  ],
  "sentences": [
    "Six former Navy SEALs released an ad highlighting their campaigns for six separate seats in the House of Representatives with one unifying goal: to take away Speaker Nancy Pelosi’s control in Congress.The six conservative-minded SEALs include Morgan Luttrell in Texas’s 8th Congressional District, Brady Duke for Florida’s 7th District, Eli Crane for Arizona’s 2nd District, Derrick Van Orden for Wisconsin’s 3rd District, Ed Thelander for Maine’s 1st District, and Ryan Zinke for Montana’s 1st District.",
    "The democrats have messed with the wrong dudes....and now...it's coming back to bite them...just proves how out of touch these idiots are...Washington DC has NO idea what's happening because they are in their little cocoon in the swamp...limousines and cocktail parties and the fake media to stroke them...it's amazing how stupid these politicians are...WE are America and WE don't need the government to tell US how to live...the constitution is our guide...",
    "Time for the Pharisees in Montgomery County Tea Party to get in their closets (see Matthew 6 for a refresher lesson) and quit their more-holier-than-thou displays and cell phone recordings to be hurriedly posted on social media.",
    "Contribute to Lucianne.com\nIn today's climate of political correctness and economic uncertainty, ad revenue only goes so far to keep a conservative site like Lucianne.com running.",
    "His opponent who orchestrated the latest brouhaha has not even bothered voting in elections, did not show up to even take the battlefield, much less fight the battle.",
    "Some may be in very tough races, but Joe has so screwed up everything that I believe some people will have a very hard time voting for more of the same misery.",
    "Mike McCormick, Pennsylvania, running for the U.S. Senate, he is a west point graduate, Army Ranger honor graduate, served in combat in Iraq.",
    "#10, I understand your sentiment, but if we do not step up and put real America loving patriots in office, we just get more of the same.",
    "I applaud their determination to get rid of Pelosi, but I hope they also will keep McCarthy far away from the Speaker’s chair.",
    "America's push to totalitarianism has been in the works for at least 100 years since and maybe before the Woodrow Wilson days.",
    "Please consider supporting Lucianne's news forum with a direct contribution of as much or as little as you can give.",
    "Over time, as more great Americans enter politics, the long trek away from totalitarianism can pick up speed.",
    "But at the end of the day, an elected conservative government alone cannot pull America over the finish line.",
    "The republican party needs to be re-stocked with newer and younger individuals who know how to lead and win.",
    "He may have cast a vote or two with which I disagree, but at least Crenshaw has been in the arena.",
    "They certainly are not pushovers and will be able to tell the establishment to go pound sand.",
    "My congress critter, Scott Perry, has military experience at least with the reserves.",
    "I can’t see them hiding under their desks either like most elected Republicans do.",
    "And at about the time the country became infected with European socialist values.",
    "The dimocrats got a bit ahead by recruiting veterans in the last two rounds.",
    "The entire country must, too, restore its moral and spiritual values.",
    "Your donation helps keep our discussions going and our voices heard.",
    "I woyld venture a guess that most of those are not in his district.",
    "If he is the speaker, the republicans will go down in flames.",
    "when you win, vote Kevin McCarthy out from leadership.",
    "I will choose the fighter, not the Monday morning QB.",
    "I see big \"likes\" for anti-Crenshaw in post #8.",
    "It will take time to pull ourselves out of it.",
    "I think he is head of the Freedom Caucus now.",
    "He was in harms way overseas at least twice.",
    "Maybe these guys can make a difference.",
    "Time for the republicans to catch up.",
    "I will be watching election day!!!!",
    "I wish all six the best of luck.",
    "He has been an absolute failure.",
    "His campaign ads are excellent.",
    "It will not be overnight.",
    "Nevertheless, let's roll.",
    "This is a good start.",
    "Good for these guys.",
    "Thank you.",
    "Good man.",
    "P.S."
  ]
}