{
  "id": 4917,
  "mediaId": 2664,
  "date": "2022-04-23",
  "headline": "Secret Service warned the White House of Capitol violence two days before the attack — Trump ignored it: court filing",
  "image": "https://www.rawstory.com/media-library/donald-trump-january-6-2021-screen-grab.jpg?id=28130419&width=1200&coordinates=0%2C10%2C0%2C11&height=600",
  "link": "https://www.rawstory.com/trump-secret-service-warnings-january-6/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    4589,
    2391,
    3621,
    2765,
    2693,
    1488
  ],
  "sentences": [
    "\"It is also now clear that Mr. Trump never telephoned his Secretary of Defense that day to order deployment of National Guard, and never contacted any federal law enforcement agency to order security assistance to the Capitol Police,\" the filing explained.",
    "\"Certain text communications with Members of Congress suggest that Mr. Meadows himself 'pushed' for Vice President Pence to take unilateral action to reject the counting of electoral votes on January 6th,\" the committee says in the filing.",
    "\"And while Mr. Trump’s widely publicized call with Georgia Secretary of State Brad Raffensperger was ongoing, Mr. Meadows exchanged text messages regarding the call with another member of the Georgia government,\" said the filing.",
    "According to a deposition Hutchinson gave in March, that was just released publicly late Friday night, she revealed that the U.S. Secret Service gave warnings about violence at the Capitol to the White House.",
    "\"Despite urgent pleas from Capitol Hill and from many of President Trump's supporters, President Trump did not act immediately to publicly ask or instruct the violent rioters [to] leave the Capitol.\"",
    "Former chief of staff to Donald Trump, Mark Meadows is suing the House and the Select Committee investigating Jan. 6, for what he calls an overly broad subpoena to appear and answer questions.",
    "\"Information received by the Select Committee indicates that Mr. Trump was in the dining room, watching on his TV, and did not urge his supporters to leave the Capitol for over three hours.",
    "\"In addition, Mr. Meadows communicated repeatedly by text with Congressman Scott Perry regarding a plan to replace Department of Justice leadership in the days before January 6th.\"",
    "\"But despite this and other warnings, President Trump urged the attendees at the Jan. 6th rally to march to the Capitol to 'take back your country,'\" the court filing said.",
    "As part of that lawsuit, however, former White House aide Cassidy Hutchinson revealed a lot of details about Meadows that are being released now.",
    "\"I just remember Mr. Ornato coming in and saying that we had intel reports saying that there could potentially be violence on the 6th.",
    "The filing also states that it is clear that Trump never contacted the Department of Defense that day to dispatch help.",
    "The House Select Committee cited her deposition in their Friday court filing responding to the Meadows lawsuit.",
    "Let's talk about it,'\" said Hutchinson speaking of U.S. Secret Service special agent in charge Anthony Ornato.",
    "And even at 4:17 p.m. when he released a video, President Trump told those in the Capitol 'we love you.",
    "It also cites Rep. Scott Perry and his conversations with Meadows via text message.",
    "You’re very special,' and at 6:01 p.m. he tweeted, 'Remember this day forever!'\"",
    "And Mr. Meadows said: 'All right."
  ]
}