{
  "id": 5158,
  "mediaId": 2636,
  "date": "2022-04-23",
  "headline": "warned that Jan. 6 could turn violent",
  "image": "https://static01.nyt.com/images/2022/04/22/us/politics/22dc-meadows/22dc-meadows-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/04/23/us/politics/mark-meadows-jan-6-trump.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Let’s talk about it.”\nRead the Jan. 6 Committee’s Filing in Its Lawsuit With Mark Meadows\nThe committee alleged that Mark Meadows, the final chief of staff for President Donald J. Trump, was told that an effort to try to overturn the 2020 election using so-called alternate electors were not “legally sound” and that Jan. 6 could turn violent, but he pushed forward with plans to hold a rally in Washington anyway.",
    "Citing Ms. Hutchinson’s testimony, the panel said it had evidence “that Mr. Meadows and certain congressmen were advised by White House counsel that efforts to generate false certificates did not comply with the law.”\nMs. Hutchinson told investigators that she heard lawyers from the White House Counsel’s Office say the plan for alternate electors was not “legally sound,” according to the filing.",
    "Mr. Meadows also turned over to the committee his text messages with a member of Congress in which the lawmaker acknowledged that a plan to object to Mr. Biden’s victory would be “highly controversial,” to which Mr. Meadows responded, “I love it.” And he furnished text exchanges about the need for Mr. Trump to issue a public statement on Jan. 6 aimed at persuading the mob to stand down.",
    "WASHINGTON — Mark Meadows, the final chief of staff for President Donald J. Trump, was told that plans to try to overturn the 2020 election using so-called alternate electors were not “legally sound” and that the events of Jan. 6 could turn violent, but he pushed forward with a rally anyway, the House committee investigating the Capitol attack alleged in a Friday night court filing.",
    "Meadows is hiding behind broad claims of executive privilege even though much of the information we’re seeking couldn’t possibly be covered by privilege and courts have rejected similar claims because the committee’s interest in getting to the truth is so compelling.”\nA lawyer for Mr. Meadows did not immediately respond to a request for comment.",
    "But, again, I’m not sure if he — what he did with that information.”\nMs. Hutchinson — who testified twice before the panel in closed-door interviews in February and March — said Anthony M. Ornato, the former White House chief of operations, told Mr. Meadows that “we had intel reports saying that there could potentially be violence on the 6th.",
    "“The select committee’s filing today urges the court to reject Mark Meadows’s baseless claims and put an end to his obstruction of our investigation,” the leaders of the committee, Representatives Bennie Thompson, Democrat of Mississippi, and Liz Cheney, Republican of Wyoming, said in a statement.",
    "The panel also emphasized how personally involved Mr. Meadows was in attempts to pressure Brad Raffensperger, the Georgia secretary of state, over Mr. Trump’s loss there — so much so that Mr. Raffensperger ducked and ignored his phone calls, viewing them as improper.",
    "Those included his work furthering a scheme to direct certain battleground states to put forward pro-Trump electors even though their voters had chosen Joseph R. Biden Jr. and a pressure campaign in Georgia and other states to try to change the election outcome.",
    "One investigator asked her whether Representative Scott Perry, Republican of Pennsylvania, who is now the head of the right-wing House Freedom Caucus, supported “the idea of sending people to the Capitol on January the 6th.”\n“He did,” Ms. Hutchinson replied.",
    "“I know that there were concerns brought forward to Mr. Meadows,” Ms. Hutchinson told investigators at a deposition on March 7, adding: “I know that people had brought information forward to him that had indicated that there could be violence on the 6th.",
    "In the 248-page filing, lawyers for the committee highlighted the testimony of Cassidy Hutchinson, a White House aide in Mr. Meadows’s office, who revealed new details about the events that led to the Jan. 6, 2021, attack on Congress by a pro-Trump mob.",
    "Before he came to loggerheads with the committee, Mr. Meadows turned over a trove of useful evidence, including a November email that discussed appointing an alternate slate of electors and a Jan. 5 message about putting the National Guard on standby.",
    "The committee issued a subpoena in November to Ms. Hutchinson, who served as special assistant to the president for legislative affairs and was at the White House on Jan. 6 and with Mr. Trump when he spoke at the “Stop the Steal” rally that day.",
    "“Once it became clear that there would be mass resignations, including lawyers in the White House Counsel’s Office, including some of the staff that Mr. Meadows worked closely with, you know, I know that did factor into his thinking,” she said.",
    "Among the documents he turned over to the panel were his text messages with Virginia Thomas, the wife of Justice Clarence Thomas; the former president’s eldest son, Donald Trump Jr.; Fox News hosts; and members of Congress.",
    "He gave 2,319 text messages to the committee but withheld more than 1,000 text messages from his personal cellphone based on various claims of “executive, marital and attorney-client privileges,” the filing said.",
    "Ms. Hutchinson also told the panel that top White House lawyers had threatened to resign over extreme plans to seize voting machines, and that had helped persuade Mr. Meadows to back off that plan.",
    "He was among the first four witnesses to whom the panel issued subpoenas, and he initially cooperated with the investigation, turning over thousands of pages of documents to the committee.",
    "The committee also said that Mr. Meadows proceeded with a plan for so-called alternate electors despite being told it wasn’t “legally sound.”\nWeighing changes to the Insurrection Act.",
    "The House then voted to find Mr. Meadows, a former congressman from North Carolina, in contempt of Congress, and referred the case to the Justice Department for prosecution.",
    "Mr. Meadows is trying to block the committee’s subpoenas, which he called “overly broad and unduly burdensome,” including one sent to Verizon for his phone and text data.",
    "Read Document 248 pages\nThe committee put forward the evidence Friday to try to persuade a federal judge in Washington to throw out Mr. Meadows’s suit against the panel.",
    "The law currently gives presidents the authority to deploy the military to respond to a rebellion, and some fear it could be abused by a president trying to stoke one.",
    "Mark Meadows, Mr. Trump’s former chief of staff, was but he pushed forward with a rally anyway, the House panel investigating the attack alleged in a court filing.",
    "Some lawmakers on the Jan. 6 House committee have begun discussions about rewriting the Insurrection Act in response to the events that led to the Capitol riot.",
    "In December, though, Mr. Meadows told investigators he was no longer willing to sit for a scheduled deposition, reversing a deal he had reached with the panel.",
    "In response, the committee laid out numerous ways its lawyers say Mr. Meadows was deeply involved in the effort to the overturn the 2020 election.",
    "lawmakers after the Jan. 6 attack that former President Donald J. Trump acknowledged he bore “some responsibility” for what happened.",
    "The audio is part of a series of revelations about Republican leaders’ private condemnations of Mr. Trump shortly after the riot.",
    "And just tell him, you know, we’re just not interested in doing that.”\nMr. Meadows’s battle with the panel has been protracted.",
    "She was present for key meetings and discussions in the White House in the buildup to Jan. 6.",
    "She also reached out directly to Georgia officials about Mr. Meadows’s trip to that state.",
    "And she said members of Congress had urged a crowd to amass at the Capitol on Jan. 6.",
    "In audio obtained by The Times, Representative Kevin McCarthy is heard telling G.O.P.",
    "The president wants to talk to you,’” Mr. Raffensperger recalled an aide telling him.",
    "Capitol Riot’s Aftermath: Key Developments\nCard 1 of 3\nMcCarthy’s outrage.",
    "Those text messages have helped guide the panel’s investigation.",
    "To date, the department has filed no charges against him.",
    "And Mr. Meadows said: All right.",
    "“‘Yeah, Mark Meadows called.",
    "“I don’t want to do that.",
    "Warnings of violence.",
    "“Mr."
  ]
}