{
  "id": 518,
  "mediaId": 2644,
  "date": "2022-02-26",
  "headline": "Jericho Sims’ 18 minutes marks shift in Tom Thibodeau’s Knicks philosophy",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/1238765506.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/26/jericho-sims-18-minutes-marks-shift-in-knicks-philosophy/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Berman",
  "authorUrl": "",
  "termIds": [
    1854,
    1794,
    3112,
    5427,
    5620,
    786,
    903,
    6264
  ],
  "sentences": [
    "Knicks coach Tom Thibodeau said he’s still trying to make a play-in push, but after playing rookie center Jericho Sims for 18 minutes in the 115-100 loss to the Heat on Friday night at the Garden, it looks like player development might be part of this after all.",
    "Asked if management has asked him to play more young guys such as Sims, Thibodeau said, “I talk to Leon [Rose], Scott [Perry], Wes [Wesley], every day.",
    "He’s done a good job as well.’’\nThibodeau has always been about earning minutes, regardless of age, in giving the team the best chance to win.",
    "You can’t go out there and the team performs poorly.’’\nMiami big man Bam Abedayo on RJ Barrett’s 46-point night: “His confidence.",
    "Sims backed up at center over veterans Nerlens Noel and Taj Gibson, who is one of Thibodeau’s all-time favorites.",
    "Sims didn’t score, didn’t take a shot and was a minus-6 with four rebounds.",
    "“It’s hard to say right now,’’ Thibodeau said about sticking with Sims.",
    "You could see it in the body language, you could see it in his face.",
    "So just let him get in there; let him gain some more experience.",
    "Jericho, the opportunities that he’s had, he’s played well.",
    "You could see he wants to take his team to another level.’’",
    "We’re looking at the development of those guys.",
    "They have to play well when they’re in there.",
    "So we’ll see how that unfolds.",
    "We talk about all our players.",
    "Nerlens did a good job for us.",
    "“We’ll see how it unfolds.",
    "Taj did a good job for us.",
    "He wants to be that guy.",
    "That’s important to us."
  ]
}