{
  "id": 5944,
  "mediaId": 2522,
  "date": "2022-04-13",
  "headline": "Joe Bidens’ sister bristles when Chris Wallace dares to ask about Hunter’s ‘troubled’ life",
  "image": "https://www.bizpacreview.com/wp-content/uploads/2022/04/SG-SG-Chris-Wallace-Valerie-Biden-Owens-split.jpg",
  "link": "https://www.bizpacreview.com/2022/04/13/joe-bidens-sister-bristles-when-chris-wallace-dares-to-ask-about-hunters-troubled-life-1225401/",
  "mediaOutlet": "BizPacReview",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Terresa Monroe-Hamilton",
  "authorUrl": "https://www.bizpacreview.com/author/terresa-monroe-hamilton/",
  "termIds": [
    1738,
    3858,
    2451,
    2426,
    2479,
    5174,
    5263,
    5204,
    4905,
    6678
  ],
  "sentences": [
    "“Congress has a constitutional obligation to conduct oversight of the Executive Branch and a moral obligation to examine if the President of the United States or any senior official in his administration is ethically compromised or injured.”\nThe conservative lawmakers pointed out that Congress should be apprised of the DOJ’s inquiry into Hunter Biden’s alleged profitable relationships with foreign nationals in China, Serbia, Ukraine, and Kazakhstan.",
    "It was also signed by Reps. Andy Biggs of Arizona, Jeff Duncan and Ralph Norman of South Carolina, Mary Miller of Illinois, Chip Roy and Michael Cloud of Texas, Dan Bishop of North Carolina, Scott Perry of Pennsylvania, Marjorie Taylor Greene and Jody Hice of Georgia, Tom Tiffany of Wisconsin, Ken Buck of Colorado, Matt Gaetz of Florida, and Vicky Hartzler of Missouri.",
    "SIGN UP HERE\nValerie Biden Owens, President Joe Biden’s younger sister, longtime political confidante, and campaign manager was visibly rankled and openly defensive when CNN+ host Chris Wallace asked her why her nephew Hunter Biden “has had such a troubled life.”\n“I do want to ask you about this, and I know it’s sensitive, but it is something that people want to know.",
    "First Sister Valerie Biden Owens Objects When Chris Wallace Asks Why Hunter Biden 'Has Had Such a Troubled Life' https://t.co/EQAMf9tYaR via @mediaite pic.twitter.com/PIc5dSW9T3\n— Tommy moderna-vaX-Topher (@tommyxtopher) April 13, 2022\nOwens is one of Wallace’s most high-profile guests on his new show “Who’s Talking to Chris Wallace” which debuted on CNN+ recently.",
    "They also brought up Hunter Biden’s alleged sources of income from Ukrainian natural-gas company Burisma, Chinese company CEFC, his laptop containing “potentially compromising material,” and his efforts to aid White House chief of staff Ron Klain in raising $20,000 for the Vice Presidents Residence Foundation, according to Fox News.",
    "“[L]egal questions plaguing Hunter Biden continue to arise and cast doubt on President Joe Biden and his administration,” Rep. Bob Good (R-VA) and 14 other lawmakers, wrote in a letter to Attorney General Merrick Garland obtained by Fox News.",
    "— Ocala Mike (@OcalaMike20) April 13, 2022\nBiden’s sister’s defensiveness surfaces as GOP House lawmakers demand that the Department of Justice brief Congress on the investigation of Hunter Biden and his suspect business dealings.",
    "— Rep Andy Biggs (@RepAndyBiggsAZ) April 13, 2022\nThe letter contends that the investigation raises questions that involve potential violations of criminal or civil law by President Biden or other senior administration officials.",
    "Most of the Wallace interview promoted Owens’ new book, “Growing Up Biden.” It reportedly delves into her life growing up with the president and the closeness they shared.",
    "So I’m… I’m proud of Hunter, and I’m proud of his recovery, and that he keeps moving forward,” she stumbled, evidently caught off guard over the question.",
    "Republicans assert that “little detail” of the investigation, which is headed by Delaware’s US Attorney David Weiss, has been disclosed to the public.",
    "And he wrote with excruciating detail, in his book “Beautiful Things,” of the hell that he lived in and walked through,” she haltingly answered.",
    "“It is imperative that the Department of Justice brief Congress on the nature of Mr. Weiss’s investigation into Hunter Biden,” they claimed.",
    "Just because Hunter is a crack addict who knocked up a stripper while dating his brother’s widow doesn’t mean he’s had a troubled life.",
    "The book also purportedly gives a window into the Biden family and her work with her brother in building his career.",
    "The network is trying to promote the show as hard-hitting with in-depth and varied interviews of personalities.",
    "I don’t think there’s an American family who hasn’t in some way tasted and felt that pain and the anguish.",
    "And every, you can ask almost any family in America that, Chris, and you’ll… I don’t know what answer.",
    "We love hearing from our readers and invite you to join us for feedback and great conversation.",
    "If you've commented with us before, we'll need you to re-input your email address for this.",
    "Why has Hunter had such a troubled life?” Wallace almost apologetically asked.",
    "“Oh, Jesus, if I knew… He had… Look, he hasn’t had a troubled life.",
    "If I had the answer, you know, I would… have a worldwide practice.",
    "Get the latest BPR news delivered free to your inbox daily.",
    "The public will not see it and we do not share it.",
    "“And thank God, he’s walked out of it.",
    "PLEASE JOIN OUR NEW COMMENT SYSTEM!",
    "And I don’t, again, I don’t.",
    "Addiction struck him.",
    "He had an addiction.",
    "Much needed."
  ]
}