{
  "id": 7135,
  "mediaId": 2745,
  "date": "2022-04-06",
  "headline": "The House Republican ‘no’ caucus is at it again",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AQFO4QTPGEI6ZMPCAU45VD2EKE.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/04/06/house-republican-no-caucus-is-it-again/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1773,
    2489,
    2828,
    3049,
    3618,
    3115,
    1477,
    1126,
    392,
    6653
  ],
  "sentences": [
    "), 93 “nay” votes\nRep. Andy Biggs (Ariz.), 85 “nay” votes\nRep. Marjorie Taylor Greene (Ga.), 79 “nay” votes\nRep. Ralph Norman (S.C.), 73 “nay” votes\nRep. Bob Good (Va.), 57 “nay” votes\nRep. Matthew M. Rosendale (Mont.",
    "), 56 “nay” votes\nRep. Lauren Boebert (Colo.), 56 “nay” votes\nRep. Matt Gaetz (Fla.), 51 “nay” votes\nRep. Scott Perry (Pa.), 49 “nay” votes\nRep. Mary E. Miller (Ill.), 49 “nay” votes\nRep. Clay Higgins (La.",
    "Many involved just a handful of legislators voting in opposition to the proposal, but more than 30 involved at least two dozen legislators voting “nay.” Of those 31 votes, 29 were led by House Republicans.",
    "), 14 “nay” votes\nRep. Rashida Tlaib (Mich.), 10 “nay” votes\nRep. Jamaal Bowman (N.Y.), 9 “nay” votes\nRep. Ilhan Omar (Minn.), 9 “nay” votes\nRep. Alexandria Ocasio-Cortez (N.Y.), 8 “nay” votes",
    "On the Democratic side, the legislators who have cast the most “nays” in roll-call votes that saw fewer than 44 “nays” in total are Reps. Sean Casten (Ill.) and Sylvia Garcia (Tex.).",
    "The vote came as something of a surprise, after all, given the ongoing war in Ukraine and the general spirit of camaraderie that NATO has enjoyed from American leaders as a result.",
    "Since the beginning of the 117th Congress in January 2021, there have been just under 140 votes in which less than a tenth of the House has voted in opposition.",
    "But the scale at which this group has opposed legislation that was destined not only to pass but to pass with the support of most of their caucus is remarkable.",
    "When 63 Republicans bucked their party on Tuesday to vote in opposition to a resolution in support of NATO, those who did so offered myriad reasons.",
    "Last year, this caucus was noteworthy for standing apart from the majority on questions related to the attack at the U.S. Capitol on Jan. 6, 2021.",
    "Among those 63, though, were several dozen legislators for whom coming out on the wrong end of a lopsided vote probably felt very familiar.",
    "Republicans are in the minority, so they are naturally going to be less likely to support legislation that the majority brings to a vote.",
    "What’s more, this particular group — all of whom are identified below — tends to pride itself on standing in opposition to the consensus.",
    "Below are 21 Republicans who voted “nay” as part of roll-call votes in which no more than a tenth of the House cast a vote in opposition.",
    "), 20 “nay” votes\nRep. Jesús “Chuy” García (Ill.), 15 “nay” votes\nRep. Maxine Waters (Calif.), 15 “nay” votes\nRep. Cori Bush (Mo.",
    "The two votes on which Democrats made up the bulk of the opposition to a vote stand out particularly because this was so unusual.",
    "), 44 “nay” votes\nRep. Jody Hice (Ga.), 40 “nay” votes\nRep. Ken Buck (Colo.), 35 “nay” votes\nRep. Randy Weber (Tex.",
    "), 29 “nay” votes\nRep. Tom McClintock (Calif.), 28 “nay” votes\nHere are the 10 Democrats with the most “nay” votes.",
    "Many of the caucus members opposed awarding the Congressional Gold Medal to police officers who served that day.",
    "On the Republican side, the legislator who has cast the most “nays” in such votes is Rep. Thomas Massie (Ky.).",
    "You can see them below, arranged from the Democrats who voted “nay” most often to the Republicans who did so.",
    "As with the NATO vote, though, many of these votes express something more than simple knee-jerk opposition.",
    "It includes several familiar names, like Reps. Marjorie Taylor Greene (R-Ga.) and Matt Gaetz (R-Fla.).",
    "There are 53 Republicans who voted “nay” at least as often as Rep. Alexandria Ocasio-Cortez (D-N.Y.).",
    "Massie, for example, also voted against a resolution of support for Ukraine earlier this year.",
    "The cutoff here was 25 “nay” votes — the most cast by any Democrat in these same votes.",
    "), 47 “nay” votes\nRep. Paul A. Gosar (Ariz.), 47 “nay” votes\nRep. Louie Gohmert (Tex.",
    "), 30 “nay” votes\nRep. Andrew S. Clyde (Ga.), 30 “nay” votes\nRep. Lance Gooden (Tex.",
    "I’ve written about this group of legislators before, labeling them the “nay” caucus.",
    "Of those votes, 120 saw more Republicans than Democrats joining the minority.",
    "In fact, 21 Republicans have voted “nay” more often than Casten and Garcia.",
    "He has voted “nay” slightly more often: 99 times out of those 139 votes.",
    "Forty-eight Republicans voted “nay” in these votes at least 10 times.",
    "Rep. Sean Casten (Ill.), 25 “nay” votes\nRep. Sylvia Garcia (Tex.",
    "Rep. Thomas Massie (Ky.), 99 “nay” votes\nRep. Chip Roy (Tex.",
    "Each has voted “nay” in 25 of those 139 roll-call votes.",
    "There are obvious institutional reasons for this.",
    "), 25 “nay” votes\nRep. Veronica Escobar (Tex.",
    "), 49 “nay” votes\nRep. Andy Harris (Md.",
    "At the bottom, it’s a sea of black."
  ]
}