{
  "id": 9318,
  "mediaId": 2528,
  "date": "2022-03-30",
  "headline": "Merriam-Webster tweets definition of 'key bumps' following Madison Cawthorn's claims of cocaine use and orgies in DC",
  "image": "https://i.insider.com/624490f1764fa90018bb173f?width=1200&format=jpeg",
  "link": "https://www.businessinsider.com/merriam-webster-what-is-a-key-bump-madison-cawthorns-claims-of-cocaine-use-and-orgies-in-dc-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brent D. Griffiths",
  "authorUrl": "https://www.businessinsider.com/author/brent-d-griffiths",
  "termIds": [
    0
  ],
  "sentences": [
    "Cawthorn told the \"Warrior Poet Society\" podcast that some Washington elites invited him to an orgy and that he also observed prominent figures who were \"on the movement to try and remove addiction in our county\" doing \"a key bump of cocaine\" in front of him.",
    "Merriam-Webster took it upon itself on Wednesday to describe to the world what a \"key bump\" is after Republican Rep. Madison Cawthorn's recent comments that he observed a prominent official snort cocaine in such a manner.",
    "Politico reported that lawmakers in the House Freedom Caucus, a staunch conservative group Cawthorn belongs to, were also aghast over the idea that sex and drugs were rampant among the capital's elite.",
    "\"I think it is important, if you're going to say something like that, to name some names,\" Rep. Scott Perry, a Pennsylvania Republican who chairs the caucus, told Politico.",
    "Email address\n By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "McCarthy publicly rebuked Cawthorn after his private meeting with the lawmaker, telling reporters that Cawthorn had \"lost my trust\" and \"is gonna have to earn it back.\"",
    "—Merriam-Webster (@MerriamWebster) March 30, 2022\nUnlike its more high-brow Oxford cousin, Merriam-Webster appears to relish weighing in on the cultural zeitgeist.",
    "House Minority Leader Kevin McCarthy and House Minority Whip Steve Scalise privately met with Cawthorn for roughly 30 minutes on Wednesday, according to Politico.",
    "We do not enter 'key bump' as a fixed phrase, as it has not yet demonstrated wide currency of use,\" the dictionary giant wrote on Twitter.",
    "\"A 'bump,' in this context, may be defined as \"a small quantity of an illicit drug when inhaled in powdered form at one time.\"",
    "I mean, he's, he's gonna — He's got a lot of members very upset,\" McCarthy told reporters, according to Axios' Alayna Treene.",
    "The dictionary also adds a series of words each year that often represent some of the biggest touchstones of the moment.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends — delivered right to your inbox.",
    "Representatives for Cawthorn, McCarthy, and Scalise did not immediately respond to a request for comment.",
    "Cawthorn, a far-right freshman lawmaker from North Carolina, has once again raised his colleagues' ire.",
    "The dictonary tweeted out the definition in the wake of Rep. Madison Cawthorn's recent comments.",
    "Last week, he was asked how realistic real-life DC is to the Netflix drama \"House of Cards.\"",
    "Last week, Cawthorn said he observed a promiment official doing a \"key bump of cocaine.\"",
    "Cawthorn did not respond to Politico's Olivia Beaver's questions as he left the meeting.",
    "McCarthy added that Cawthorn told him that he had exaggerated some of his claims.",
    "Last October, editors added 445 new words, including \"dad bod\" and \"deplatform.\"",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Merriam-Webster took it upon itself to define what a \"key bump\" is.",
    "\"You can't just say you can't do this again.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "\"There's no evidence to this.\"",
    "Loading Something is loading."
  ]
}