{
  "id": 9413,
  "mediaId": 2574,
  "date": "2022-03-28",
  "headline": "Republicans Investigate VOA for Biased Coverage of Iran, Advocacy for Biden",
  "image": "https://freebeacon.com/wp-content/uploads/2022/03/Reza_Pahlavi_Crown_Prince_of_Iran_-_VOA_Studio_hosted_by_Setareh_Derakhshesh_-_11_February_2017_02_736x514.jpg",
  "link": "https://freebeacon.com/media/republicans-investigate-voa-for-biased-coverage-of-iran-advocacy-for-biden/",
  "mediaOutlet": "Free Beacon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Kredo",
  "authorUrl": "https://freebeacon.com/author/adam-kredo/",
  "termIds": [
    4905,
    2693,
    2765,
    1126,
    1542,
    1470,
    1396,
    6678,
    6245
  ],
  "sentences": [
    "Rep. Scott Perry (R., Pa.), a member of the House Foreign Affairs Committee, and six of his congressional colleagues are requesting that VOA and its Persian News Network turn over all internal documents and communications related to its decision to rehire Setareh Derakhshesh Sieg to lead the agency's Iran coverage.",
    "The lawmakers are also interested in information about a Persian News Network employee's 2015 bid to solicit negative comments about then-candidate Donald Trump and a separate 2020 incident in which VOA's Urdu Service published \"what was effectively a campaign video on behalf of then-candidate Joe Biden.\"",
    "Sieg was fired by the Trump administration for \"misusing / squandering / wasting nearly $1 million in agency funds, and lying about her credentials that claimed she held a doctorate from the Sorbonne,\" according to the letter, which cites media reports about Sieg's tenure at the agency.",
    "A 2016 report from the Office of Personnel and Management further disclosed that more than 60 percent of VOA Persian employees under Sieg's leadership \"believe that arbitrary action, personal favoritism, and coercion for partisan political purposes are tolerated at VOA Persian.\"",
    "Bryan Leib, executive director of Iranian Americans for Liberty, a grassroots advocacy group that has been critical of VOA's Persian-language coverage, told the Free Beacon that the network has been flagrantly violating its charter for years by publishing pro-Iran coverage.",
    "The Republican lawmakers want copies of \"any and all records, including any audits, reports, memoranda, drafts, or emails (including those from personal email accounts) regarding concerns with Setareh Derakhshesh Sieg's leadership of the VOA's Persian News Network.\"",
    "\"In what can only be described as a fall of Faustian proportions, VOA has abandoned its sacred mission to authentically promote our nation's interests—which not only is unfortunate, it's a dereliction of duty and defies VOA's congressionally approved charter.\"",
    "While the Trump administration acknowledged this bias and attempted to reform the agency by firing officials like Sieg and implementing a series of reforms, VOA Persian continues to carry water for the Iranian regime, according to the Republican lawmakers.",
    "Media\nVoice of America (VOA) and its Persian-language affiliate are facing a congressional investigation for what Republican lawmakers say is the taxpayer-funded network's biased coverage of Iran and partisan advocacy in favor of President Joe Biden.",
    "\"Over the past few decades, a lack of congressional oversight over the U.S. Agency for Global Media (USAGM) has allowed for partisan actors to obstruct the integrity and mission of the agency,\" Perry told the Free Beacon.",
    "Pack and his staff has been overturned under your leadership, as USAGM clearly promotes partisanship and an aversion to congressional oversight,\" the lawmakers write in a letter to Kelu Chao, USAGM's acting CEO.",
    "The probe is a sign of mounting congressional frustration with VOA's coverage, particularly of Iran, and its hiring of several individuals who are seen as using the network to carry out a partisan agenda.",
    "Sieg was fired during the Trump administration over accusations that she misappropriated nearly $1 million in funds and allowed the Persian network to become a source of pro-Iran propaganda.",
    "Iranian dissidents and U.S. officials have accused VOA Persian of being infiltrated by the Iranian regime and used to disseminate the hardline government's propaganda.",
    "Many viewed the video as a violation of the news network's government charter, according to a copy of the investigation letter obtained by the Washington Free Beacon.",
    "\"It's clear to us that VOA has directly violated their charter over the years on multiple occasions by providing one-sided and biased media coverage,\" Leib said.",
    "Whistleblowers say that under Sieg's leadership the Persian News Network became known as the \"voice of Tehran, not the voice of America.\"",
    "We have a duty to ensure that our Voice of America—and the wider agency—are truly the voice of American values and the American people.\"",
    "Pack attempted to reform the agency and fire officials long seen as using the networks to wage a partisan agenda that favored Democrats.",
    "When the Trump administration came into power, it tapped Michael Pack to head USAGM, which oversees VOA and its global affiliates.",
    "They also want information on why a December 2015 video disparaging Trump still remains accessible on the VOA News website.",
    "\"We find it to be completely unacceptable for a U.S government agency to violate their charter without any repercussions.\"",
    "The lawmakers seek information pertaining to how and why the Biden administration rehired Sieg to lead VOA Persian.",
    "\"There's a lot of corruption that needs to be cleaned out immediately.",
    "The lawmakers request this information by April 7.",
    "\"Unfortunately, much of the progress made by Mr."
  ]
}