{
  "id": 9665,
  "mediaId": 2553,
  "date": "2022-03-30",
  "headline": "Madison Cawthorn Admits His Claims Of Lawmaker Orgies And Drug Use Were ‘Exaggerated’: GOP Leader",
  "image": "https://dw-wp-production.imgix.net/2022/03/MC1-scaled.jpg?w=1200&h=800&ixlib=react-9.3.0",
  "link": "https://www.dailywire.com/news/madison-cawthorn-admits-his-claims-of-lawmaker-orgies-and-drug-use-were-exaggerated-gop-leader",
  "mediaOutlet": "Daily Wire",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Saavedra",
  "authorUrl": "https://www.dailywire.com/author/ryan-saavedra",
  "termIds": [
    5399,
    4066,
    128,
    1119,
    1126
  ],
  "sentences": [
    "“He’ll have to either name names or retract it.”\nThe Daily Wire is one of America’s fastest growing conservative media companies for breaking news, investigative reporting, sports, podcasts, in-depth analysis, books, and entertainment for a reason: because we believe in what we do.",
    "“And when I sit down with him … I told him you can’t make statements like that, as a member of Congress, that affects everybody else and the country as a whole.”\nSome Republican members said they intended to call out Cawthorn’s claims by pushing him to name the lawmakers.",
    "Rep. Madison Cawthorn (R-NC) allegedly admitted to House Minority Leader Kevin McCarthy (R-CA) during a meeting on Wednesday that his claims that senior lawmakers have used cocaine in front of him and that they have invited him to their homes for orgies are not true.",
    "‘We’re going to have a sexual get-together at one of our homes, you should come.’ ‘What did you just ask me to come to?’ And then you realize they’re asking you to come to an orgy,” Cawthorn claimed without any evidence during a podcast last week.",
    "Axios reported on the meeting:\nMcCarthy said Cawthorn conceded some of his remarks were untrue and “exaggerated.”\n“I just told him he’s lost my trust, he’s gonna have to earn it back, and I laid out everything I find is unbecoming.",
    "And it’s like, this is wild.”\nCawthorn’s unsubstantiated claims set off a firestorm among House Republicans this week, which resulted in McCarthy having a meeting with Cawthorn.",
    "“I think it is important, if you’re going to say something like that, to name some names,” Rep. Scott Perry (R-PA), chairman of the House Freedom Caucus said.",
    "Then when he comes in, he tells me, he says he thinks he saw maybe a staffer in a parking garage from 100 yards away.”\n“It’s just frustrating.",
    "We believe in our country, in the value of truth and the freedom to speak it, and in the right to challenge tyranny wherever we see it.",
    "And, you can’t just say, ‘You can’t do this again.’ I mean, he’s got a lot of members very upset,” McCarthy said.",
    "“Madison’s stuff irritates me because it’s not true,” Rep. Don Bacon (R-NE) said.",
    "There’s no evidence behind his statements,” McCarthy continued.",
    "“You watch them do a bump of cocaine right in front of you.",
    "“In the interview, he claims he watched people do cocaine.",
    "Create a free account to join the conversation!",
    "Become a member now and join our mission.",
    "“Then all of a sudden you get invited.",
    "Believe the same?"
  ]
}