[
  {
    "id": 4344,
    "mediaId": 2732,
    "date": "2022-01-26",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> enthralled a room full of potential Westmoreland County voters Wednesday as he works to make his mark in a crowded field of candidates vying to represent Pennsylvania in the U.S. Senate.",
    "author": "Megan Tomasic",
    "title": "Dr. Mehmet Oz stumps in Westmoreland County in quest for U.S. Senate"
  },
  {
    "id": 3059,
    "mediaId": 2562,
    "date": "2022-02-03",
    "sentence": "Dr. Oz to Newsmax: 'Pennsylvania Deserves a Big Voice, a Strong Voice' (Newsmax's \"Spicer & Co.\")\nBy Eric Mack | Thursday, 03 February 2022 11:44 PM\nHailing his name recognition, media chops, and medical background to take it to the failed health advisers in Washington, D.C., Dr. <span class='selected-term'>Mehmet Oz</span> told Newsmax he is the Pennsylvania Senate GOP primary candidate who can beat the Democrat in the general election next November.",
    "author": "NationalWatch",
    "title": "Dr. Oz to Newsmax: ‘Pennsylvania Deserves a Big Voice, a Strong Voice’"
  },
  {
    "id": 2742,
    "mediaId": 2641,
    "date": "2022-02-03",
    "sentence": "Hailing his name recognition, media chops, and medical background to take it to the failed health advisers in Washington, D.C., Dr. <span class='selected-term'>Mehmet Oz</span> told Newsmax he is the Pennsylvania Senate GOP primary candidate who can beat the Democrat in the general election next November.",
    "author": "Eric Mack",
    "title": "Dr. Oz to Newsmax: 'Pennsylvania Deserves a Big Voice, a Strong Voice'"
  },
  {
    "id": 310,
    "mediaId": 2594,
    "date": "2022-02-26",
    "sentence": "The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "Via AP news wire",
    "title": "No notes, same logo: Dr. Oz's campaign is like his TV show"
  },
  {
    "id": 156,
    "mediaId": 2679,
    "date": "2022-02-26",
    "sentence": "NEWTOWN, Pa. (AP) — The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "MARC LEVY",
    "title": "No notes, same logo: Dr. Oz’s campaign is like his TV show"
  },
  {
    "id": 552,
    "mediaId": 2732,
    "date": "2022-02-26",
    "sentence": "NEWTOWN — The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "Associated Press",
    "title": "No notes, same logo: Dr. Oz's campaign is like his TV show"
  },
  {
    "id": 12612,
    "mediaId": 2590,
    "date": "2022-02-28",
    "sentence": "https://t.co/3A763Mz8Pg\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) February 26, 2022\nFauci hasn’t responded to Oz’s debate offer, but many Twitter users did.",
    "author": "David Moye",
    "title": "Twitter Users Mock Dr. Oz By Turning 'Challenge' To Dr. Fauci Into Brutal Meme"
  },
  {
    "id": 12693,
    "mediaId": 2594,
    "date": "2022-02-28",
    "sentence": "Dr <span class='selected-term'>Mehmet Oz</span>, who is running for one of Pennsylvania’s two senate seats, is being mocked online for his second attempt at challenging Dr Anthony Fauci to debate him, despite the fact that the leading expert in infectious diseases is not opposing him.",
    "author": "Oliver O'Connell",
    "title": "Dr Oz ridiculed for complaining Fauci won’t debate him"
  },
  {
    "id": 13217,
    "mediaId": 2663,
    "date": "2022-02-28",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> clearly thinks very highly of himself.",
    "author": "Dan Tracer",
    "title": "Dr. Oz’s latest attempt at relevance backfires spectacularly"
  },
  {
    "id": 11313,
    "mediaId": 2663,
    "date": "2022-03-15",
    "sentence": "Reality has apparently caught up with Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "David Reddish",
    "title": "Dr. Oz’s disastrous Senate campaign reportedly on “life support” as he eyes TV comeback"
  },
  {
    "id": 9590,
    "mediaId": 2776,
    "date": "2022-03-23",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nThe TV host then denounced Biden for being “petty” and “political” in his action, and assured he had “no intention” of resigning.",
    "author": "Cynthia Cook",
    "title": "Dr. Oz Claps Back After Joe Biden Fires Him From President’s Sports Council: Watch"
  },
  {
    "id": 9566,
    "mediaId": 2621,
    "date": "2022-03-23",
    "sentence": "The White House sent Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker letters demanding their resignations from the President’s Council on Sports, Fitness & Nutrition, and informed the U.S. Senate candidates from Pennsylvania and Georgia respectively that if they do not resign by 6 p.m. Wednesday they will be “terminated.”\nUnder the Hatch Act, Oz and Walker are considered special government employees who “may not be candidates in partisan elections” while engaged in official government business.",
    "author": "Michael Luciano",
    "title": "Joe Biden Just Fired Dr. Oz – Yes, Really"
  },
  {
    "id": 8946,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "— Geoff Bennett (@Geoff Bennett) 1648065806\nAt the same time, Biden reportedly asked for the resignation of a more controversial member of the council, Dr. <span class='selected-term'>Mehmet Oz</span>, a thoracic surgeon and medical talk show host first appointed to the advisory council by former President Donald Trump in 2018.",
    "author": "Matthew Chapman",
    "title": "Dr. Oz lashes out after Biden boots him off nutrition advisory panel and replaces him with Chef José Andrés"
  },
  {
    "id": 8928,
    "mediaId": 2658,
    "date": "2022-03-24",
    "sentence": "The administration asked <span class='selected-term'>Mehmet Oz</span> to resign from the President’s Council on Sports, Fitness & Nutrition.",
    "author": "",
    "title": "Officials say fourth doses are coming ... if they can buy them"
  },
  {
    "id": 9085,
    "mediaId": 2590,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nWalker, the Trump-endorsed front-runner in the GOP contest to challenge Sen. Raphael Warnock (D-Ga.) in November, recently questioned the science of evolution.",
    "author": "Josephine Harvey",
    "title": "White House Removes Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 9428,
    "mediaId": 2619,
    "date": "2022-03-24",
    "sentence": "President Joe Biden has cut Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span> from advisory roles with the President’s Council on Sports, Fitness & Nutrition due to their current candidacies for the U.S. Senate.",
    "author": "Charles Passy",
    "title": "Biden brings onboard chef José Andrés after cutting Mehmet Oz and Herschel Walker from presidential fitness council"
  },
  {
    "id": 9367,
    "mediaId": 2919,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nOz also used the video to levy an attack against Dr. Anthony Fauci, a White House medical adviser and the director of the National Insitute for Allergies and Infectious Diseases.",
    "author": "Alex Hider",
    "title": "Biden asks Dr. Oz, Herschel Walker to resign from presidential fitness council"
  },
  {
    "id": 9336,
    "mediaId": 2550,
    "date": "2022-03-24",
    "sentence": "Just as President Joe Biden has reportedly asked GOP Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their posts on the President’s Council on Sports, Fitness & Nutrition, Biden has announced his intent to appoint their replacements.",
    "author": "Rebekah Sager",
    "title": "You’re fired! Biden gives Dr. Oz the boot and appoints José Andrés to presidential council"
  },
  {
    "id": 9180,
    "mediaId": 2641,
    "date": "2022-03-24",
    "sentence": "U.S. Senate candidates Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker on Wednesday were told to resign from the President's Council on Sports, Fitness and Nutrition or their positions would be \"terminated.\"",
    "author": "Charlie McCarthy",
    "title": "Biden Removes Dr. Oz, Herschel Walker From Fitness Council"
  },
  {
    "id": 9183,
    "mediaId": 2718,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nIf President Biden wants to politicize health, he will have to fire me.",
    "author": "Andi Ortiz",
    "title": "Biden Boots Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 9240,
    "mediaId": 2720,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the Biden administration notified former football star Herschel Walker and celebrity physician Dr. <span class='selected-term'>Mehmet Oz</span> that they could either resign from the council or be fired, according to NBC News.",
    "author": "Jack Davis",
    "title": "Biden Demands Herschel Walker and Dr. Oz Quit Presidential Advisory Council or Be Ousted"
  },
  {
    "id": 9506,
    "mediaId": 2521,
    "date": "2022-03-24",
    "sentence": "‘Replying to@NoLieWithBTC’\nThis is one of the reasons Walker was fired:\n‘The Biden Admin also asked GA Senate candidate Hershel Walker to resign from the WH fitness and nutrition council as well because it’s against their policy for Federal candidates to serve on presidential boards.’\n‘President Joe Biden has asked Republican Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their respective positions on a presidential council, or face removal.’\n‘[E]ven if he becomes Senator Oz.",
    "author": "Gloria Christie",
    "title": "Joe Biden Shows Dr. Oz & Herschel Walker The Door"
  },
  {
    "id": 9153,
    "mediaId": 2641,
    "date": "2022-03-25",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> said Friday that he won't quit fighting over his position on the President's Council on Sports, Fitness, and Nutrition, telling Newsmax that if he is elected to represent Pennsylvania as a senator, he and NFL great Herschel Walker, who was also fired from the council, will fight back against politically-motivated firings.",
    "author": "Sandy Fitzgerald",
    "title": "Dr. Oz to Newsmax: Will Keep Fighting After Dismissal From Fitness Council"
  },
  {
    "id": 9285,
    "mediaId": 2641,
    "date": "2022-03-28",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> wrote President Joe Biden to say he would not resign from the President's Council on Sports, Fitness and Nutrition despite being ordered to do so.",
    "author": "Charlie McCarthy",
    "title": "Dr. Oz Refuses to Resign From Fitness Council"
  },
  {
    "id": 5295,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Jackie Salo",
    "title": "Fauci says it’s now up to Americans to assess their own COVID-19 risk"
  },
  {
    "id": 5759,
    "mediaId": 2621,
    "date": "2022-04-11",
    "sentence": "Trump has endorsed both men as he continues to throw his support behind various Republicans running, including recently Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Zachary Leeman",
    "title": "Trump Rally in North Carolina Draws Fewer Than 2,000 People: Report"
  },
  {
    "id": 5808,
    "mediaId": 2894,
    "date": "2022-04-17",
    "sentence": "",
    "author": "Bryan Anderson",
    "title": "Smart tactic or missed opportunity? Budd is the latest GOP frontrunner to avoid debates"
  },
  {
    "id": 6050,
    "mediaId": 4091,
    "date": "2022-04-21",
    "sentence": "Although Trump may have helped in the last lockdown, he had proudly given birth to the deadly COVID-19 vaccines and endorsed the candidacy of Dr. <span class='selected-term'>Mehmet Oz</span>, the host of the “Dr.",
    "author": "Kevin Hughes",
    "title": "Forced COVID lockdowns may soon be coming back to America"
  },
  {
    "id": 4937,
    "mediaId": 8484,
    "date": "2022-04-24",
    "sentence": "Oz is on the far right, seen here with the Trumps and Piers Morgan on the left\n+7\nView gallery\n+7\nView gallery\nConservatives are grumbling over former President Donald Trump's (left) decision to back Dr. <span class='selected-term'>Mehmet Oz</span> (right) in the May 17 Republican Senate primary\n+7\nView gallery\nHuman Events' Jack Posobiec, a Pennsylvania native, tweeted out footage of a vintage Dr. Oz episode that focused on transgender children\nThe Trump endorsement could break a deadlock in the Pennsylvania race.",
    "author": "Adam Manno For Dailymail.Com",
    "title": "REVEALED: Dr. Oz bought up thousands of dollars of Trump-backed hydroxychloroquine pills during pandemic"
  }
]