[
  {
    "id": 4599,
    "mediaId": 2590,
    "date": "2022-01-05",
    "sentence": "Now, America has to take Dr. <span class='selected-term'>Mehmet Oz</span> seriously as he runs for Senate in Pennsylvania in an already tightly contested race to replace Sen. Pat Toomey, a Republican who is retiring from office.",
    "author": "",
    "title": "How Many Celebrity Politicians Have To Ruin America Before Americans Stop Electing Them?"
  },
  {
    "id": 4593,
    "mediaId": 2636,
    "date": "2022-01-13",
    "sentence": "Whatever might come, this would not be a tenure of earth tones and lethargy and saturnine expressions.” (Debbie Deitcher, Manhattan)\nTaking the measure of <span class='selected-term'>Mehmet Oz</span>, Annaliese Griffin wrote: “He’s rightly understood as a kind of quasi-religious leader, one who has set up his revival tent between a yoga studio and an urgent-care clinic, with the television cameras rolling.” (Scott Williams, Salt Lake City)\nFinally, here’s Charles Blow on his dinner with Sidney Poitier: “His enchantment settled on you, like a soft sweater.",
    "author": "",
    "title": "Trump’s Pride Goeth Before Our Fall"
  },
  {
    "id": 4601,
    "mediaId": 2590,
    "date": "2022-01-13",
    "sentence": "A political action committee supporting another Republican in the race, TV host <span class='selected-term'>Mehmet Oz</span>, launched an ad attacking McCormick’s ties to China, where Bridgewater Associates manages $5 billon of its $150 billion portfolio.",
    "author": "Liz Skalka",
    "title": "Hedge Fund Exec David McCormick Latest To Enter Pennsylvania Senate Race"
  },
  {
    "id": 3623,
    "mediaId": 2621,
    "date": "2022-01-21",
    "sentence": "But Sean Hannity is urging him to back celebrity doctor <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Alex Griffing",
    "title": "Trump Reportedly Weighing Double Endorsements in Tight Senate Races: ‘I Get Two Chances to Win’"
  },
  {
    "id": 3923,
    "mediaId": 2631,
    "date": "2022-01-22",
    "sentence": "",
    "author": "",
    "title": "Trump stays on sidelines in Pennsylvania Senate race — for now"
  },
  {
    "id": 3844,
    "mediaId": 2594,
    "date": "2022-01-25",
    "sentence": "Three, he is relatively unknown to voters, especially considering that his primary rivals include Jeff Bartos, the GOP's endorsed candidate for lieutenant governor in 2018, and <span class='selected-term'>Mehmet Oz</span>, the heart surgeon, wellness author and TV personality who carries unrivaled name recognition as the host of daytime TV’s “Dr.",
    "author": "Via AP news wire",
    "title": "No Trump endorsement? Senate hopeful enlists other GOP stars"
  },
  {
    "id": 3996,
    "mediaId": 2679,
    "date": "2022-01-25",
    "sentence": "Three, he is relatively unknown to voters, especially considering that his primary rivals include Jeff Bartos, the GOP’s endorsed candidate for lieutenant governor in 2018, and <span class='selected-term'>Mehmet Oz</span>, the heart surgeon, wellness author and TV personality who carries unrivaled name recognition as the host of daytime TV’s “Dr.",
    "author": "MARC LEVY",
    "title": "No Trump endorsement? Senate hopeful enlists other GOP stars"
  },
  {
    "id": 3437,
    "mediaId": 2630,
    "date": "2022-02-01",
    "sentence": "In particular, Dr. <span class='selected-term'>Mehmet Oz</span>, a Pennsylvania Senate candidate, has made Covid a central theme of his campaign, running two ads that criticize the federal government’s response.",
    "author": "",
    "title": "The GOP’s midterm playbook: Flip the script on Covid"
  },
  {
    "id": 3090,
    "mediaId": 2718,
    "date": "2022-02-01",
    "sentence": "Oz” spinoff, hosted by <span class='selected-term'>Mehmet Oz</span>’s daughter Daphne Oz, debuted to a 0.4 rating.",
    "author": "Tony Maglio",
    "title": "‘Dr. Oz’ Spinoff’s Debut Ratings Down One Third From Final Week of ‘Dr. Oz’"
  },
  {
    "id": 1862,
    "mediaId": 2641,
    "date": "2022-02-05",
    "sentence": "Among the Republicans vying to replace Sen. Pat Toomey, R-Pa., who is retiring, are several with ties to the former president: Carla Sands, his former ambassador to Denmark; his friend the celebrity doctor <span class='selected-term'>Mehmet Oz</span>; and hedge fund CEO David McCormick, whose wife served in the Trump administration.",
    "author": "",
    "title": "GOP Won't Endorse in Big Primary Fields for Governor, Senate"
  },
  {
    "id": 1981,
    "mediaId": 6511,
    "date": "2022-02-06",
    "sentence": "Bartos, quien ha tenido problemas en las encuestas y fue superado por el médico <span class='selected-term'>Mehmet OZ</span> y el ex director general de fondos de cobertura David MacCormick, necesita agitar la carrera para superar las ventajas financieras y de identificación de nombre de sus rivales.",
    "author": "",
    "title": "El Partido Republicano de Pensilvania se niega a respaldar la carrera por el Senado"
  },
  {
    "id": 2490,
    "mediaId": 2641,
    "date": "2022-02-06",
    "sentence": "The COVID-19 pandemic has exposed Washington, D.C., Democrats, and President Joe Biden on every issue important to Pennsylvanians, according to GOP Senate primary candidate Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Eric Mack",
    "title": "Dr. Oz: Biden Got It Wrong on COVID, Giving 'Too Much Pajama Time'"
  },
  {
    "id": 932,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "The complete poll results:\n<span class='selected-term'>Mehmet Oz</span>: 27.4%\nDavid McCormick: 15.9%\nCarla Sands: 14.8%\nKathy Barnette: 8.9%\nJeff Bartos: 6.6%\nSean Gale: 1.9%\nGeorge Bochetto: 1.6%\nEverett Stern: 1.5%\nThere were still 21.6% of likely GOP Senate primary voters undecided.",
    "author": "Eric Mack",
    "title": "Trafalgar Poll: Dr. Oz Takes Big Lead in Pa. Race"
  },
  {
    "id": 956,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Two of the leading Republican candidates in the Pennsylvania Senate race, David McCormick and <span class='selected-term'>Mehmet Oz</span>, have hit each other over a perceived lack of loyalty to former President Donald Trump, who has yet to issue an endorsement in the race.",
    "author": "Theodore Bunker",
    "title": "Pennsylvania GOP Senate Candidates Fight for Trump's Endorsement"
  },
  {
    "id": 898,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Bob Brigham",
    "title": "Turkey’s autocratic ruler could have leverage over a future GOP senator: report"
  },
  {
    "id": 26,
    "mediaId": 2594,
    "date": "2022-02-22",
    "sentence": "Monday's debate did not include high profile candidates such as the celebrity doctor <span class='selected-term'>Mehmet Oz</span> and former George W Bush official David McCormick, both of whom took flak for skipping the event.",
    "author": "Io Dodds",
    "title": "Republican candidate denounces Michael Flynn as a ‘traitor’ during bad-tempered GOP debate"
  },
  {
    "id": 201,
    "mediaId": 2526,
    "date": "2022-02-22",
    "sentence": "It’s a two-man race In Pennsylvania’s GOP senate primary, with David McCormick surging out in front and <span class='selected-term'>Mehmet Oz</span> sliding down into a distant second place, an internal poll commissioned by McCormick’s campaign shows.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Poll: David McCormick Surges into Lead in Pennsylvania GOP Senate Primary, Mehmet Oz Crashes"
  },
  {
    "id": 532,
    "mediaId": 2540,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Gabby Orr and Melanie Zanona",
    "title": "Trump may offer help to Katie Britt in Alabama Senate primary -- even though he's already endorsed Mo Brooks"
  },
  {
    "id": 310,
    "mediaId": 2594,
    "date": "2022-02-26",
    "sentence": "The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "Via AP news wire",
    "title": "No notes, same logo: Dr. Oz's campaign is like his TV show"
  },
  {
    "id": 156,
    "mediaId": 2679,
    "date": "2022-02-26",
    "sentence": "NEWTOWN, Pa. (AP) — The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "MARC LEVY",
    "title": "No notes, same logo: Dr. Oz’s campaign is like his TV show"
  },
  {
    "id": 552,
    "mediaId": 2732,
    "date": "2022-02-26",
    "sentence": "NEWTOWN — The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "Associated Press",
    "title": "No notes, same logo: Dr. Oz's campaign is like his TV show"
  },
  {
    "id": 12770,
    "mediaId": 2551,
    "date": "2022-02-27",
    "sentence": "+3\nView gallery\nPennsylvania Republican Senate hopeful Dr. <span class='selected-term'>Mehmet Oz</span> made his Conservative Political Action Conference debut Sunday, speaking on a panel about the coronavirus pandemic\n+3\nView gallery\nDr. Mehmet Oz (right) volunteered to moderator Jason Rantz (left) that yes, he had been vaccinated against COVID-19.",
    "author": "",
    "title": "'People hated Donald so much that they began rooting against a COVID solution': Dr. Oz makes CPAC debut where he blasts politicization of Trump-backed 'cure' Hydroxy"
  },
  {
    "id": 13051,
    "mediaId": 6570,
    "date": "2022-03-03",
    "sentence": "Blood sport, it may be, as just this week, Dr. <span class='selected-term'>Mehmet Oz</span>, another Republican running for the Senate, quipped that Mr. McCormick “says he is tough on China, but got rich investing with them.”\nThe New York Times reported late last month that Mr. McCormick’s hedge fund, Bridgewater Associates, was closely linked to China, and cited affectionate comments he had made in the past about the country, though some were from when he served as U.S. Treasury Under Secretary for International Affairs in George W. Bush’s administration.",
    "author": "Julian Routh",
    "title": "David McCormick hawkish on China, punches back at Mehmet Oz in visit to suburban Pittsburgh"
  },
  {
    "id": 11437,
    "mediaId": 2748,
    "date": "2022-03-16",
    "sentence": "Celebrity doctor <span class='selected-term'>Mehmet Oz</span> is already in talks to return to television if his candidacy for U.S. Senate in Pennsylvania is unsuccessful, according to a recent report.",
    "author": "Blarp Blog",
    "title": "Report: Oz Looks to Exit Senate Race, Return to Television"
  },
  {
    "id": 11129,
    "mediaId": 2679,
    "date": "2022-03-18",
    "sentence": "Late last year, before he had formally entered the Pennsylvania Senate race, David McCormick flew to Florida for a private meeting with Donald Trump, angling to get in the former president’s good graces before a Republican primary that would soon pit him against Dr. <span class='selected-term'>Mehmet Oz</span>, a celebrity surgeon and television personality.",
    "author": "Shane Goldmacher",
    "title": "Dr. Oz’s heritage is targeted as Pennsylvania rivals vie for Trump backing"
  },
  {
    "id": 9231,
    "mediaId": 2644,
    "date": "2022-03-19",
    "sentence": "They are a disgraceful publication.”\n“This is just another example of the media being quick to silence anything that would shine a light on the corrupt Biden family,” Dr. <span class='selected-term'>Mehmet Oz</span>, a leading GOP Pennsylvania Senate candidate, told The Post.",
    "author": "Jon Levine",
    "title": "Republicans demand new probe into Hunter Biden laptop, coverup"
  },
  {
    "id": 9095,
    "mediaId": 2641,
    "date": "2022-03-20",
    "sentence": "Republican Pennsylvania Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> told The Post that \"this is just another example of the media being quick to silence anything that would shine a light on the corrupt Biden family.",
    "author": "Brian Freeman",
    "title": "Republicans Demand New Probe Into Hunter Biden Following NYT Story"
  },
  {
    "id": 9693,
    "mediaId": 2528,
    "date": "2022-03-20",
    "sentence": "Former President Donald Trump poses for photos with David McCormick at the Trump National Golf Club Bedminster clubhouse, Sunday, Nov. 20, 2016, in Bedminster, N.J. <span class='selected-term'>Mehmet Oz</span> speaks at a town hall-style event at the Newtown Athletic Club, Feb. 20, 2022, in Newtown, Pa. AP Photo/Carolyn Kaster and AP Photo/Marc Levy\nDr. Mehmet Oz and David McCormick are running in Pennsylvania's GOP Senate primary.",
    "author": "Sarah Al-Arshani",
    "title": "Dr. Oz's primary challenger and his wife said in meeting with Trump that Oz's Muslim background was a liability: NYT report"
  },
  {
    "id": 9166,
    "mediaId": 2526,
    "date": "2022-03-21",
    "sentence": "In the Senate, Republicans look to retain an open seat with likely Republican primary candidate David McCormick leading in the polls against <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Wendell Husebø",
    "title": "Poll: Joe Biden’s Approval Rating Is 36 Percent, Impacting Battleground States"
  },
  {
    "id": 9001,
    "mediaId": 2570,
    "date": "2022-03-22",
    "sentence": "Also in attendance was <span class='selected-term'>Mehmet Oz</span>, the TV personality running for Senate in Pennsylvania.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: Ginni Thomas’ Campaign Contributions, Lawmakers’ Mar-A-Lago Visits"
  },
  {
    "id": 8946,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "— Geoff Bennett (@Geoff Bennett) 1648065806\nAt the same time, Biden reportedly asked for the resignation of a more controversial member of the council, Dr. <span class='selected-term'>Mehmet Oz</span>, a thoracic surgeon and medical talk show host first appointed to the advisory council by former President Donald Trump in 2018.",
    "author": "Matthew Chapman",
    "title": "Dr. Oz lashes out after Biden boots him off nutrition advisory panel and replaces him with Chef José Andrés"
  },
  {
    "id": 9090,
    "mediaId": 2573,
    "date": "2022-03-23",
    "sentence": "\"President Trump appointed me to two terms on the President’s Council on Sports, Fitness & Nutrition,\" tweeted Dr. <span class='selected-term'>Mehmet Oz</span>, who is running for Senate in Pennsylvania.",
    "author": "Jon Brown",
    "title": "Biden demands Dr. Oz, Herschel Walker step down amid Senate runs"
  },
  {
    "id": 9322,
    "mediaId": 6497,
    "date": "2022-03-23",
    "sentence": "The Biden administration is seeking the formal resignations of TV personality Dr. <span class='selected-term'>Mehmet Oz</span> and former NFL star Herschel Walker from the President’s Council on Sports, Fitness & Nutrition, warning that failure to quit the posts would lead to termination.",
    "author": "Abid Rahman",
    "title": "Biden Administration Seeks Resignations of Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 9320,
    "mediaId": 2934,
    "date": "2022-03-23",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> has been outspoken about opposing defunding the police.",
    "author": "Robert Farley",
    "title": "Misleading ‘Defund the Police’ Attack on Dr. Oz"
  },
  {
    "id": 9625,
    "mediaId": 2524,
    "date": "2022-03-23",
    "sentence": "When Donald Trump was elected president by losing the popular vote to Hillary Clinton, he appointed Dr. <span class='selected-term'>Mehmet Oz</span> to the President's Council on Sports, Fitness & Nutrition.",
    "author": "Mark Frauenfelder",
    "title": "Nostrum peddler Dr. Mehmet Oz fired from President's Council on Sports, Fitness & Nutrition"
  },
  {
    "id": 9621,
    "mediaId": 2695,
    "date": "2022-03-23",
    "sentence": "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@Dr. Mehmet Oz) 1648080535\nOz is running for a U.S. Senate seat in Pennsylvania, while Walker is running for a U.S. Senate seat in Georgia — both men are slated to compete in Republican primaries this May.",
    "author": "Alex Nitzberg",
    "title": "White House ousts Dr. Mehmet Oz and Herschel Walker from President's Council on Sports, Fitness & Nutrition"
  },
  {
    "id": 9584,
    "mediaId": 2631,
    "date": "2022-03-23",
    "sentence": "The Biden administration threatened Wednesday to remove Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile GOP Senate candidates.",
    "author": "Zoë Richards",
    "title": "White House moves to oust Dr. Oz and Herschel Walker from presidential advisory panel"
  },
  {
    "id": 9590,
    "mediaId": 2776,
    "date": "2022-03-23",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nThe TV host then denounced Biden for being “petty” and “political” in his action, and assured he had “no intention” of resigning.",
    "author": "Cynthia Cook",
    "title": "Dr. Oz Claps Back After Joe Biden Fires Him From President’s Sports Council: Watch"
  },
  {
    "id": 9602,
    "mediaId": 2574,
    "date": "2022-03-23",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> criticized Trump-era trade policies toward Beijing in an interview on Chinese state TV.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Criticized Trump’s China Trade Policy in Interview With CCP Media"
  },
  {
    "id": 9500,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "Herschel Walker and <span class='selected-term'>Mehmet Oz</span>, who are now Republican Senate candidates in Georgia and Pennsylvania, respectively, were appointed in 2018 by President Donald Trump to serve on the council.",
    "author": "Donald Judd and Maegan Vazquez",
    "title": "Biden requests Mehmet Oz and Herschel Walker resign from presidential council or be terminated"
  },
  {
    "id": 9544,
    "mediaId": 6509,
    "date": "2022-03-23",
    "sentence": "The Biden administration on Wednesday threatened to remove <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile Senate GOP candidates.",
    "author": "",
    "title": "White House Moves to Oust Dr. Oz, Herschel Walker From Panel as They Run for Office"
  },
  {
    "id": 9566,
    "mediaId": 2621,
    "date": "2022-03-23",
    "sentence": "The White House sent Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker letters demanding their resignations from the President’s Council on Sports, Fitness & Nutrition, and informed the U.S. Senate candidates from Pennsylvania and Georgia respectively that if they do not resign by 6 p.m. Wednesday they will be “terminated.”\nUnder the Hatch Act, Oz and Walker are considered special government employees who “may not be candidates in partisan elections” while engaged in official government business.",
    "author": "Michael Luciano",
    "title": "Joe Biden Just Fired Dr. Oz – Yes, Really"
  },
  {
    "id": 9308,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Harper Neidig",
    "title": "Trump lawyer urges appeals court to block House from getting tax returns"
  },
  {
    "id": 9517,
    "mediaId": 2601,
    "date": "2022-03-24",
    "sentence": "Oz has made millions of dollars in China from his television show and his health sponsorship deals\nWFB: Dr. <span class='selected-term'>Mehmet Oz</span> criticized Trump-era trade policies toward Beijing in an interview on Chinese state TV.",
    "author": "MJA",
    "title": "Dr. Oz Criticized Trump’s China Trade Policy in Interview With CCP Media"
  },
  {
    "id": 9506,
    "mediaId": 2521,
    "date": "2022-03-24",
    "sentence": "‘Replying to@NoLieWithBTC’\nThis is one of the reasons Walker was fired:\n‘The Biden Admin also asked GA Senate candidate Hershel Walker to resign from the WH fitness and nutrition council as well because it’s against their policy for Federal candidates to serve on presidential boards.’\n‘President Joe Biden has asked Republican Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their respective positions on a presidential council, or face removal.’\n‘[E]ven if he becomes Senator Oz.",
    "author": "Gloria Christie",
    "title": "Joe Biden Shows Dr. Oz & Herschel Walker The Door"
  },
  {
    "id": 9471,
    "mediaId": 2696,
    "date": "2022-03-24",
    "sentence": "WASHINGTON – The Biden administration requested the resignation of Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span> from the President’s Council on Sports, Fitness & Nutrition Wednesday night, saying they would be fired if they did not do so.",
    "author": "David Epstein",
    "title": "Elena Delle Donne, José Andrés to replace Herschel Walker and Dr. Oz on fitness council"
  },
  {
    "id": 9606,
    "mediaId": 2680,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV's host of “The Dr. Oz Show” — and former football star Herschel Walker from the President's Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "",
    "title": "Herschel Walker, Dr. Oz removed from Biden's sports council"
  },
  {
    "id": 9622,
    "mediaId": 2721,
    "date": "2022-03-24",
    "sentence": "In 2018, former President Donald Trump appointed television personality Dr. <span class='selected-term'>Mehmet Oz</span> and professional athlete Herschel Walker to the President’s Council on Sports, Fitness and Nutrition.",
    "author": "",
    "title": "Biden threatened to fire… who!?"
  },
  {
    "id": 9624,
    "mediaId": 2560,
    "date": "2022-03-24",
    "sentence": "Harrisburg, Pa. – The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> – best known as daytime TV’s host of “The Dr. Oz Show” – and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 9636,
    "mediaId": 2518,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "The Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from president’s fitness council"
  },
  {
    "id": 9658,
    "mediaId": 2528,
    "date": "2022-03-24",
    "sentence": "President Joe Biden's administration sent letters to television personality Dr. <span class='selected-term'>Mehmet Oz</span> and former NFL player Herschel Walker Wednesday, asking them to resign from the President's Council on Sports, Fitness & Nutrition or be terminated by the end of the day.",
    "author": "Lauren Frias",
    "title": "Biden asked Dr. Oz and Herschel Walker to resign from a presidential council or be terminated"
  },
  {
    "id": 9673,
    "mediaId": 2728,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "The Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 9659,
    "mediaId": 2514,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV's host of “The Dr. Oz Show” — and former football star Herschel Walker from the President's Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "",
    "title": "Herschel Walker, Dr. Oz removed from Biden's sports council"
  },
  {
    "id": 12333,
    "mediaId": 8481,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "",
    "title": "Herschel Walker, Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 9306,
    "mediaId": 2632,
    "date": "2022-03-24",
    "sentence": "The Biden administration on Wednesday threatened to remove <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile Senate GOP candidates.",
    "author": "",
    "title": "White House Moves to Oust Dr. Oz, Herschel Walker From Panel as They Run for Office"
  },
  {
    "id": 9428,
    "mediaId": 2619,
    "date": "2022-03-24",
    "sentence": "President Joe Biden has cut Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span> from advisory roles with the President’s Council on Sports, Fitness & Nutrition due to their current candidacies for the U.S. Senate.",
    "author": "Charles Passy",
    "title": "Biden brings onboard chef José Andrés after cutting Mehmet Oz and Herschel Walker from presidential fitness council"
  },
  {
    "id": 9414,
    "mediaId": 2592,
    "date": "2022-03-24",
    "sentence": "The White House requested Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, who are now Republican Senate candidates in Pennsylvania and Georgia, respectively, to step down from their positions as the administration forbids federal candidates to be members of presidential boards.",
    "author": "Joseph Gobran",
    "title": "Dr. Oz And Herschel Walker Asked By White House To Step Down Or Be Fired, Both Were Trump Appointees"
  },
  {
    "id": 9367,
    "mediaId": 2919,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nOz also used the video to levy an attack against Dr. Anthony Fauci, a White House medical adviser and the director of the National Insitute for Allergies and Infectious Diseases.",
    "author": "Alex Hider",
    "title": "Biden asks Dr. Oz, Herschel Walker to resign from presidential fitness council"
  },
  {
    "id": 9336,
    "mediaId": 2550,
    "date": "2022-03-24",
    "sentence": "Just as President Joe Biden has reportedly asked GOP Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their posts on the President’s Council on Sports, Fitness & Nutrition, Biden has announced his intent to appoint their replacements.",
    "author": "Rebekah Sager",
    "title": "You’re fired! Biden gives Dr. Oz the boot and appoints José Andrés to presidential council"
  },
  {
    "id": 9240,
    "mediaId": 2720,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the Biden administration notified former football star Herschel Walker and celebrity physician Dr. <span class='selected-term'>Mehmet Oz</span> that they could either resign from the council or be fired, according to NBC News.",
    "author": "Jack Davis",
    "title": "Biden Demands Herschel Walker and Dr. Oz Quit Presidential Advisory Council or Be Ousted"
  },
  {
    "id": 9180,
    "mediaId": 2641,
    "date": "2022-03-24",
    "sentence": "U.S. Senate candidates Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker on Wednesday were told to resign from the President's Council on Sports, Fitness and Nutrition or their positions would be \"terminated.\"",
    "author": "Charlie McCarthy",
    "title": "Biden Removes Dr. Oz, Herschel Walker From Fitness Council"
  },
  {
    "id": 9183,
    "mediaId": 2718,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nIf President Biden wants to politicize health, he will have to fire me.",
    "author": "Andi Ortiz",
    "title": "Biden Boots Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 9181,
    "mediaId": 2570,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Derek Saul",
    "title": "Georgia Senate Candidate Herschel Walker Refuses To Resign From Presidential Council"
  },
  {
    "id": 9197,
    "mediaId": 2740,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, according to reports by several media outlets.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: Should Russia be kicked out of the G-20?"
  },
  {
    "id": 9237,
    "mediaId": 2584,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the White House sent letters to Dr <span class='selected-term'>Mehmet Oz</span> and former football star Herschel Walker – two Republican Senate candidates in Pennsylvania and Georgia, respectively – asking them to submit their resignations or face termination.",
    "author": "Maya Yang",
    "title": "White House tells Dr Oz and Herschel Walker to resign from fitness council"
  },
  {
    "id": 9085,
    "mediaId": 2590,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nWalker, the Trump-endorsed front-runner in the GOP contest to challenge Sen. Raphael Warnock (D-Ga.) in November, recently questioned the science of evolution.",
    "author": "Josephine Harvey",
    "title": "White House Removes Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 9142,
    "mediaId": 2520,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, a White House official said.",
    "author": "Rick Rouan",
    "title": "Biden asks GOP Senate candidates Mehmet Oz, Herschel Walker to resign from presidential board"
  },
  {
    "id": 9170,
    "mediaId": 2641,
    "date": "2022-03-24",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, who is running for the U.S. Senate in Pennsylvania as a Republican, told Newsmax on Thursday that he was asked a day earlier by the White House to resign or face termination from his position on the President's Council on Sports, Fitness, & Nutrition.",
    "author": "Luca Cacciatore",
    "title": "Dr. Oz to Newsmax: Removal From WH Fitness Council Politically Motivated"
  },
  {
    "id": 9159,
    "mediaId": 2748,
    "date": "2022-03-24",
    "sentence": "The White House requested for Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker to resign from the President's Council on Sports, Fitness & Nutrition on Wednesday, or else face termination, according to CNN.",
    "author": "STATION GOSSIP",
    "title": "White House ousts Dr. Mehmet Oz and Herschel Walker from President's Council on Sports, Fitness & Nutrition"
  },
  {
    "id": 9143,
    "mediaId": 2740,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, a White House official said.",
    "author": "Rick Rouan",
    "title": "Biden asks GOP Senate candidates Mehmet Oz, Herschel Walker to resign from presidential board"
  },
  {
    "id": 8949,
    "mediaId": 2732,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nThe White House on Wednesday posted two new appointments to the council, while a White House official said Oz and Walker were asked to resign because the White House doesn’t permit candidates for federal office to serve on boards.",
    "author": "Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from Biden's sports council"
  },
  {
    "id": 9153,
    "mediaId": 2641,
    "date": "2022-03-25",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> said Friday that he won't quit fighting over his position on the President's Council on Sports, Fitness, and Nutrition, telling Newsmax that if he is elected to represent Pennsylvania as a senator, he and NFL great Herschel Walker, who was also fired from the council, will fight back against politically-motivated firings.",
    "author": "Sandy Fitzgerald",
    "title": "Dr. Oz to Newsmax: Will Keep Fighting After Dismissal From Fitness Council"
  },
  {
    "id": 9358,
    "mediaId": 2752,
    "date": "2022-03-25",
    "sentence": "This is truly a smart and good meme, because Dr. <span class='selected-term'>Mehmet Oz</span> sold good patriotic lifesaving snake oil on the Oprah Winfrey show, while Dr. Fauci tyrannically asked Americans to get vaccinated against a deadly pandemic and to wear masks on their faces, which liberty-loving human beings simply cannot do.",
    "author": "Doktor Zoom",
    "title": "Biden Shitcans Jerk GOP Losers From Fitness Council And They Will Not Shut Up"
  },
  {
    "id": 9497,
    "mediaId": 2747,
    "date": "2022-03-25",
    "sentence": "President Joe Biden asked former NFL running back Herschel Walker and TV personality <span class='selected-term'>Mehmet Oz</span>, M.D., to step down from their positions on the President’s Council on Sports, Fitness, and Nutrition.",
    "author": "",
    "title": "Some federal employees can run for political office under the Hatch Act"
  },
  {
    "id": 9540,
    "mediaId": 6704,
    "date": "2022-03-25",
    "sentence": "President Joe Biden asked former NFL running back Herschel Walker and TV personality <span class='selected-term'>Mehmet Oz</span>, M.D., to step down from their positions on the President’s Council on Sports, Fitness, and Nutrition.",
    "author": "",
    "title": "Some federal employees can run for political office under the Hatch Act"
  },
  {
    "id": 9684,
    "mediaId": 8428,
    "date": "2022-03-26",
    "sentence": "Walker took to Twitter to respond to the sudden demand: “I’m not a quitter so you are going to have to fire me.”\nDr. <span class='selected-term'>Mehmet Oz</span>, candidate for the Senate in Pennsylvania, received the same demand, questioning the political intent behind the decision to oust two Republican candidates from the health council.",
    "author": "Laura Ramirez",
    "title": "Biden orders Herschel Walker to step down from health council – or else"
  },
  {
    "id": 8913,
    "mediaId": 2618,
    "date": "2022-03-26",
    "sentence": "Herschel Walker echoed the sentiments of Dr. <span class='selected-term'>Mehmet Oz</span> this week when he responded to President Joe Biden’s demand that he step down from the President’s Council on Sports, Fitness & Nutrition over Hatch Act violation concerns, stating simply, “I’m not a quitter.”Walker, a Republican candidate for U.S. Senate from Georgia, has had a storied career in sports competing in the NFL and the Olympics representing the United States.",
    "author": "Kevin Haggerty",
    "title": "Herschel Walker on Biden demanding resignation: ‘I’m not a quitter so you’re gonna have to fire me’"
  },
  {
    "id": 9285,
    "mediaId": 2641,
    "date": "2022-03-28",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> wrote President Joe Biden to say he would not resign from the President's Council on Sports, Fitness and Nutrition despite being ordered to do so.",
    "author": "Charlie McCarthy",
    "title": "Dr. Oz Refuses to Resign From Fitness Council"
  },
  {
    "id": 9242,
    "mediaId": 2512,
    "date": "2022-03-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> has been a fixture on television for the past 13 years, ever since Oprah began featuring him as a guest on her talk show.",
    "author": "Timothy Evans",
    "title": "Dr. Oz's TV staffers say he 'blindsided everyone' when he abruptly fired them to run for Senate"
  },
  {
    "id": 9272,
    "mediaId": 2573,
    "date": "2022-03-29",
    "sentence": "(BEGIN VIDEO CLIP)\nDR. <span class='selected-term'>MEHMET OZ</span> (R-PA), SENATORIAL CANDIDATE: I just received the letter on your screen.",
    "author": "",
    "title": "'Hannity' on Biden's Ukraine war response, domestic woes"
  },
  {
    "id": 9134,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "I am proud of my service and will not resign.pic.twitter.com/EP1vHWATp4\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@Dr. Mehmet Oz) 1648071503\nA recent Fox News poll shows Oz trailing David McCormick in the Republican primary, 24-15 percent, after having enjoyed a lead in the race shortly after announcing his candidacy.",
    "author": "Timothy Evans",
    "title": "Dr. Oz faces backlash from 'furious' longtime staffers after laying them off without warning"
  },
  {
    "id": 9130,
    "mediaId": 2740,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, a candidate for U.S. senator and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Chelsey Cox",
    "title": "Senate candidate and TV host Dr. Oz removed from presidential fitness council"
  },
  {
    "id": 9009,
    "mediaId": 2644,
    "date": "2022-03-30",
    "sentence": "Republican US Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> was fired from the President’s Council on Sports, Fitness and Nutrition, about a week after the White House asked him to resign.",
    "author": "Jesse O’Neill",
    "title": "It’s Terminal: Dr. Oz fired from presidential council amid GOP Senate run"
  },
  {
    "id": 9160,
    "mediaId": 2641,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, the longtime talk show host who's running for a Senate seat in Pennsylvania, said he's been formally fired by the White House from his role as a member of the President's Council on Sports, Fitness and Nutrition.",
    "author": "Newsmax Staff",
    "title": "Dr. Oz Formally Fired by Biden White House"
  },
  {
    "id": 9070,
    "mediaId": 2641,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for the U.S. Senate in Pennsylvania, told Newsmax on Wednesday that the Democratic Party's Green New Deal agenda is \"a hoax, a fraud\" and \"can't be done in the timeline that's described.\"",
    "author": "Luca Cacciatore",
    "title": "Dr. Oz to Newsmax: 'The Green New Deal Is a Hoax, a Fraud'"
  },
  {
    "id": 9039,
    "mediaId": 2557,
    "date": "2022-03-30",
    "sentence": "pic.twitter.com/yLhKsZm9sl\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) November 30, 2021\nEXCLUSIVE: ‘Heartless’ Dr. Oz leaves longtime staffers jobless and depressed https://t.co/27Bq5ocjAR pic.twitter.com/S86qLGnkRK\n— Page Six (@PageSix) March 30, 2022\nTo get more information about this article, please visit Breitbart.",
    "author": "DML News App",
    "title": "REPORT: Dr. Oz longtime staffers say they were ‘blindsided’ after campaign announcement"
  },
  {
    "id": 9222,
    "mediaId": 2520,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, a candidate for U.S. senator and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Chelsey Cox",
    "title": "Senate candidate and TV host Dr. Oz removed from presidential fitness council"
  },
  {
    "id": 7327,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "The Centers for Disease Control and Prevention \"wasn't taking advice from doctors\" during the pandemic, so it made little sense to take its advice on schools from the teachers' unions, television's Dr. <span class='selected-term'>Mehmet Oz</span>, a GOP candidate for the U.S. Senate in Pennsylvania, said Thursday on Newsmax.",
    "author": "Sandy Fitzgerald",
    "title": "Dr. Oz to Newsmax: CDC Took School Advice From Unions, Not Doctors"
  },
  {
    "id": 7294,
    "mediaId": 2740,
    "date": "2022-03-31",
    "sentence": "Oz is out: Dr. <span class='selected-term'>Mehmet Oz</span>, a U.S. Senate candidate and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: POTUS seeks to lower gas prices by ordering oil from reserves"
  },
  {
    "id": 7609,
    "mediaId": 2557,
    "date": "2022-04-03",
    "sentence": "… There isn’t a single thing about Oz that doesn’t raise major red flags for republican voters.”\n<span class='selected-term'>Mehmet Oz</span> praised Hillary Clinton and said Obama would make a “superb president” https://t.co/dle6xza1LQ #PAsen\n— Matt Wolking (@MattWolking) March 31, 2022\nListen to the latest daily DML podcasts below!",
    "author": "DML News App",
    "title": "REPORT: Dr Oz called a hypocrite for ‘$250,000-a-head fundraiser’ with Clinton associate"
  },
  {
    "id": 7049,
    "mediaId": 2573,
    "date": "2022-04-04",
    "sentence": "DR. <span class='selected-term'>MEHMET OZ</span> (D-PA), SENATORIA CANDIDATE: I mean, it's remarkable the Biden administration in fact Biden can't even fire people as well as Trump.",
    "author": "",
    "title": "'Hannity' on Hunter Biden, Dr. Oz's firing"
  },
  {
    "id": 7279,
    "mediaId": 2745,
    "date": "2022-04-07",
    "sentence": "Trump asked Josh whether he should endorse David McCormick — whom he met with later on Wednesday at Mar-a-Lago — or <span class='selected-term'>Mehmet Oz</span> in the Republican primary to replacing retiring Sen. Pat Toomey (R-Pa.).",
    "author": "",
    "title": "The Post's interview with Donald Trump"
  },
  {
    "id": 7303,
    "mediaId": 2636,
    "date": "2022-04-07",
    "sentence": "The celebrity doctor <span class='selected-term'>Mehmet Oz</span>, whose TV career was given liftoff by Oprah Winfrey and who left it behind to run for the Senate in Pennsylvania, has a personal fortune of $76 million to $300 million, he disclosed Wednesday night in a government filing.",
    "author": "",
    "title": "Wawa Stock and $500,000 in Cattle: Dr. Oz’s Senate Bid Reveals His Wealth"
  },
  {
    "id": 7532,
    "mediaId": 2658,
    "date": "2022-04-07",
    "sentence": "Trump said he’d make a decision in “about a week” between endorsing McCormick or <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Trump says Secret Service blocked him from joining Jan. 6 march to the Capitol"
  },
  {
    "id": 7188,
    "mediaId": 2550,
    "date": "2022-04-08",
    "sentence": "includes such luminaries as <span class='selected-term'>Mehmet Oz</span>, Ben Carson, Scott Atlas, and Ronny Jackson, the dude who turned a slovenly heap of fly-pocked Crisco into a Greek Adonis through the magic of barmy bullsh*t.\nNow Jackson, who leveraged his unique proximity to Donald Trump’s eminently unkissable bum into a congressional seat, is under investigation by the House Ethics Committee.",
    "author": "",
    "title": "House doc who praised Trump's 'good genes,' is under investigation"
  },
  {
    "id": 7053,
    "mediaId": 2573,
    "date": "2022-04-09",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" a statement from Trump says.",
    "author": "Adam Sabes",
    "title": "Former President Trump endorses Dr. Oz for US Senate in Pennsylvania"
  },
  {
    "id": 6063,
    "mediaId": 6656,
    "date": "2022-04-09",
    "sentence": "April 9 (UPI) -- Former President Donald Trump has endorsed television personality Dr. <span class='selected-term'>Mehmet Oz</span> in his campaign to fill the U.S. Senate seat in Pennsylvania vacated by retiring Sen. Patrick Toomey.",
    "author": "Adam Schrader",
    "title": "Trump endorses Dr. Oz's campaign for U.S. Senate"
  },
  {
    "id": 6123,
    "mediaId": 2632,
    "date": "2022-04-09",
    "sentence": "In a statement, Trump described Oz as “Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our Vets, Tax Cuts\" and as someone who would “always fight for and support our under siege Second Amendment.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump wrote.",
    "author": "David Chang",
    "title": "Former President Trump Endorses Dr. Oz in Pa. Senate Primary Race"
  },
  {
    "id": 7706,
    "mediaId": 2562,
    "date": "2022-04-09",
    "sentence": "Trump: 'Our Country Is Being Systematically Destroyed' Former President Donald Trump (Jason Behnken/AP)\nBy Eric Mack | Saturday, 09 April 2022 07:18 PM\nStumping for North Carolina GOP Senate primary candidate Ted Budd, former President Donald Trump added an announcement of his official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's hotly contested GOP Senate primary.",
    "author": "NationalWatch",
    "title": "Trump: ‘Our Country Is Being Systematically Destroyed’"
  },
  {
    "id": 7780,
    "mediaId": 2602,
    "date": "2022-04-09",
    "sentence": "Former US President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for US Senate in Pennsylvania.",
    "author": "REUTERS",
    "title": "Trump endorses celebrity surgeon Dr. Oz for US Senate seat in Pennsylvania"
  },
  {
    "id": 8329,
    "mediaId": 8502,
    "date": "2022-04-09",
    "sentence": "Former President Trump has endorsed Dr. <span class='selected-term'>Mehmet Oz</span> for the U.S. Senate seat in Pennsylvania, a Saturday announcement states.",
    "author": "",
    "title": "Former President Trump endorses Dr. Oz for US Senate in Pennsylvania"
  },
  {
    "id": 7963,
    "mediaId": 2637,
    "date": "2022-04-09",
    "sentence": "Article content\nWASHINGTON — Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for U.S. Senate in Pennsylvania.",
    "author": "",
    "title": "Trump endorses celebrity surgeon Dr. Mehmet Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 8845,
    "mediaId": 8469,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday, Trump said his decision was “all about winning elections” as he announced his support for the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "JILL COLVIN Associated Press",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 7300,
    "mediaId": 2664,
    "date": "2022-04-09",
    "sentence": "The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" Trump said in a statement emailed to reporters.",
    "author": "Bob Brigham",
    "title": "Trump cites TV while endorsing Dr. Oz for Senate: 'He has lived with us through the screen'"
  },
  {
    "id": 7343,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Stumping for North Carolina GOP Senate primary candidate Ted Budd, former President Donald Trump added an official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's hotly contested GOP Senate primary at Saturday's Save America rally.",
    "author": "Eric Mack",
    "title": "Trump: 'Right Now Our Country Is a Laughingstock'"
  },
  {
    "id": 7359,
    "mediaId": 2592,
    "date": "2022-04-09",
    "sentence": "Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for U.S. Senate in Pennsylvania.",
    "author": "Moira Warburton and Jan Wolfe",
    "title": "Trump Endorses Celebrity Surgeon Dr. Mehmet Oz For U.S. Senate Seat In Pennsylvania"
  },
  {
    "id": 7387,
    "mediaId": 6509,
    "date": "2022-04-09",
    "sentence": "In a statement, Trump described Oz as “Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our Vets, Tax Cuts\" and as someone who would “always fight for and support our under siege Second Amendment.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump wrote.",
    "author": "David Chang",
    "title": "Former President Trump Endorses Dr. Oz in Pa. Senate Primary Race"
  },
  {
    "id": 5258,
    "mediaId": 2618,
    "date": "2022-04-09",
    "sentence": "There are seven people running for the PA senate seat including two women, one white, one black: Kathy Barnette (Republican): MAGA businesswoman from Montgomery County, occasional Fox News commentator; Jeff Bartos (Republican): A real estate investor from Montgomery County; Sean Gale (Republican): A lawyer from Montgomery County; David McCormick (Republican) A former CEO of one of the world's largest hedge funds; <span class='selected-term'>Mehmet Oz</span> (Republican): A TV celebrity doctor; Carla Sands (Republican): from Mechanicsburg, Trumps' former ambassador to Denmark; George Bochetto (Republican): A Philadelphia defense attorney who sued the city over boxing-up of a statue of Christopher Columbus.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Donald Trump Endorses Mehmet Oz in Pennsylvania U.S. Senate Race"
  },
  {
    "id": 5243,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Trump also made an exclusive backstage announcement of an official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania GOP Senate primary.",
    "author": "Eric Mack",
    "title": "Donald Trump to Newsmax: Remember, Nancy Pelosi Was in Charge of Security on Jan. 6"
  },
  {
    "id": 5793,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "| Riccardo Savi/Getty Images for Concordia Summit\nBy Holly Otterbein and Natalie Allison\n 04/09/2022 06:44 PM EDT\nUpdated: 04/09/2022 08:10 PM EDT\nDr. <span class='selected-term'>Mehmet Oz</span> has won the race for Donald Trump’s coveted endorsement in Pennsylvania’s Senate GOP primary.",
    "author": "",
    "title": "Trump endorses Oz in key Senate race"
  },
  {
    "id": 5785,
    "mediaId": 2680,
    "date": "2022-04-09",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "JILL COLVIN and MARC LEVY",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 5864,
    "mediaId": 2728,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.“\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Jill Colvin And Marc Levy",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 5825,
    "mediaId": 2745,
    "date": "2022-04-09",
    "sentence": "Former president Donald Trump on Saturday jumped into a high-stakes intraparty contest, endorsing fellow television celebrity-turned-politician <span class='selected-term'>Mehmet Oz</span> in the contested Republican primary for the U.S. Senate in Pennsylvania, where the leading candidates jockeyed aggressively for Trump’s support.",
    "author": "",
    "title": "Trump endorses Dr. Oz in Pennsylvania Senate race, a key battleground"
  },
  {
    "id": 5842,
    "mediaId": 2528,
    "date": "2022-04-09",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.\"",
    "author": "Hannah Getahun",
    "title": "Trump endorsed Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 6039,
    "mediaId": 8401,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday, Trump said his decision was “all about winning elections” as he announced his support for the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\nREAD MORE:\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "",
    "title": "Trump Endorses Oz In Pennsylvania’s Senate Primary Race"
  },
  {
    "id": 6016,
    "mediaId": 2526,
    "date": "2022-04-09",
    "sentence": "pic.twitter.com/kWJl7ll2vb\n— Taylor Budowich (@TayFromCA) April 9, 2022\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Donald Trump Endorses Mehmet Oz in Pennsylvania U.S. Senate Race"
  },
  {
    "id": 5938,
    "mediaId": 5119,
    "date": "2022-04-09",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" Trump said, in part.",
    "author": "",
    "title": "Former President Donald Trump endorses Dr. Mehmet Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 5371,
    "mediaId": 2594,
    "date": "2022-04-09",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Via AP news wire",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 5338,
    "mediaId": 2664,
    "date": "2022-04-09",
    "sentence": "Donald Trump's once iron-clad grip on the Republican Party appears to have weakened as prominent conservatives are openly griping about his endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the GOP primary for U.S. Senate in Pennsylvania.",
    "author": "Bob Brigham",
    "title": "Conservatives lash out after Trump endorses Dr. Oz: 'They played him. Again.'"
  },
  {
    "id": 5423,
    "mediaId": 2746,
    "date": "2022-04-09",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nDuring his speech in North Carolina, Mr. Trump praised Mr. Oz’s career, adding that his success on television will serve him well with voters.",
    "author": "Joseph Clark",
    "title": "Trump endorses Dr. Oz for Senate"
  },
  {
    "id": 5445,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Trump also made an exclusive backstage announcement of an official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania GOP Senate primary.",
    "author": "Eric Mack",
    "title": "Donald Trump to Newsmax: Remember, Nancy Pelosi Was in Charge of Security on Jan. 6"
  },
  {
    "id": 5477,
    "mediaId": 2685,
    "date": "2022-04-09",
    "sentence": "\"Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "JILL COLVIN and MARC LEVY Associated Press",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 5595,
    "mediaId": 8319,
    "date": "2022-04-09",
    "sentence": "Former President Donald Trump has endorsed Dr. <span class='selected-term'>Mehmet Oz</span> for the GOP Senate primary in Pennsylvania.",
    "author": "admin",
    "title": "Trump endorses Dr. Oz for Pennsylvania Senate"
  },
  {
    "id": 5542,
    "mediaId": 4043,
    "date": "2022-04-09",
    "sentence": "Dr <span class='selected-term'>Mehmet Oz</span>, a Turkish-American TV personality who made more than 60 appearances on Winfrey's show before it stopped airing in 2011, is running to replace retiring Republican Pat Toomey in Pennsylvania.",
    "author": "Tom Acres",
    "title": "Donald Trump endorses celebrity surgeon known for guesting on Oprah in crucial Senate race"
  },
  {
    "id": 5584,
    "mediaId": 2548,
    "date": "2022-04-09",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump added.",
    "author": "Michael Ginsberg",
    "title": "Trump Endorses Dr. Mehmet Oz In Pennsylvania GOP Senate Primary"
  },
  {
    "id": 5495,
    "mediaId": 2679,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "MARC LEVY",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 5489,
    "mediaId": 2590,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday, Trump said his decision was “all about winning elections” as he announced his support for the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\nAdvertisement\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Jill Colvin",
    "title": "Trump Endorses Oz In Pennsylvania's Senate Primary Race"
  },
  {
    "id": 5514,
    "mediaId": 2509,
    "date": "2022-04-09",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 5543,
    "mediaId": 2631,
    "date": "2022-04-09",
    "sentence": "Former President Donald Trump endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's Senate GOP primary.",
    "author": "",
    "title": "Trump endorses Dr. Mehmet Oz in Pennsylvania Senate GOP primary"
  },
  {
    "id": 5536,
    "mediaId": 2537,
    "date": "2022-04-10",
    "sentence": "The biggest name in Pennsylvania's Senate race – <span class='selected-term'>Mehmet Oz</span> – has secured the endorsement of the GOP's biggest name, Donald Trump.",
    "author": "Katie Wadington",
    "title": "Trump endorses celebrity surgeon Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 5493,
    "mediaId": 2646,
    "date": "2022-04-10",
    "sentence": "Trump: I’ve gotta be the cleanest— I think I’m the most honest human being perhaps that god ever created pic.twitter.com/D98itzA6vi\n— Acyn (@Acyn) April 10, 2022\nIf there was one bit of actual news to be gleaned from Trump’s North Carolina appearance last night, it was his endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> for the Republican nomination for Senator in Pennsylvania.",
    "author": "Vinnie Longobardo",
    "title": "FUTILE RAMBLINGS: Trump’s North Carolina rally provides him with ever diminishing returns"
  },
  {
    "id": 5568,
    "mediaId": 2589,
    "date": "2022-04-10",
    "sentence": "When undecided voters were asked they are leaning towards at this time, McCormick’s lead increased to 27.2%, followed by <span class='selected-term'>Mehmet Oz</span> with almost 20.6%.",
    "author": "Karen Townsend",
    "title": "Why did Trump endorse Dr. Oz? One person's support may hold the answer"
  },
  {
    "id": 5592,
    "mediaId": 2790,
    "date": "2022-04-10",
    "sentence": "Former President Donald Trump has endorsed fellow TV personality-turned-politician Dr. <span class='selected-term'>Mehmet Oz</span> for the U.S. Senate ahead of the Republican primary in Pennsylvania.",
    "author": "Emma Bowman",
    "title": "Trump endorses Dr. Oz for the U.S. Senate in Pennsylvania"
  },
  {
    "id": 5457,
    "mediaId": 2740,
    "date": "2022-04-10",
    "sentence": "The biggest name in Pennsylvania's Senate race – <span class='selected-term'>Mehmet Oz</span> – has secured the endorsement of the GOP's biggest name, Donald Trump.",
    "author": "Katie Wadington",
    "title": "Trump endorses celebrity surgeon Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 5468,
    "mediaId": 2668,
    "date": "2022-04-10",
    "sentence": "As RedState reported Saturday evening, Trump raised eyebrows across the political spectrum with his “complete and total” endorsement of Dr. <span class='selected-term'>Mehmet Oz</span>, just weeks before the contested Republican primary in Pennsylvania.",
    "author": "Mike Miller",
    "title": "Trump's Endorsement of Dr. Oz Should Surprise No One Who Understands Trump"
  },
  {
    "id": 5361,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "There are seven people running for the PA senate seat including two women, one white, one black: Kathy Barnette (Republican): MAGA businesswoman from Montgomery County, occasional Fox News commentator; Jeff Bartos (Republican): A real estate investor from Montgomery County; Sean Gale (Republican): A lawyer from Montgomery County; David McCormick (Republican) A former CEO of one of the world's largest hedge funds; <span class='selected-term'>Mehmet Oz</span> (Republican): A TV celebrity doctor; Carla Sands (Republican): from Mechanicsburg, Trumps' former ambassador to Denmark; George Bochetto (Republican): A Philadelphia defense attorney who sued the city over boxing-up of a statue of Christopher Columbus.",
    "author": "Bonchie",
    "title": "Donald Trump Just Made an Absolutely Head-Scratching Endorsement"
  },
  {
    "id": 5360,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Clarice Feldman",
    "title": "I Learn Something New Every Day"
  },
  {
    "id": 5932,
    "mediaId": 2556,
    "date": "2022-04-10",
    "sentence": "“The great commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nIn his statement, Trump also said Oz was especially popular with women because of his work in daytime TV, and could do well in Philadelphia and Pittsburgh.",
    "author": "",
    "title": "Dr. Oz Picks Up Donald Trump Endorsement For Republican Nod In Pennsylvania Senate Race"
  },
  {
    "id": 6038,
    "mediaId": 2640,
    "date": "2022-04-10",
    "sentence": "The former president said he's backing <span class='selected-term'>Mehmet Oz</span>—aka the TV celebrity known as Dr. Oz—in Pennsylvania's Republican Senate primary.",
    "author": "John Johnson",
    "title": "Trump Endorses Big Name in a Big Race"
  },
  {
    "id": 6013,
    "mediaId": 2672,
    "date": "2022-04-10",
    "sentence": "Former reality TV star and former president Donald Trump endorsed former TV huckster Dr. <span class='selected-term'>Mehmet Oz</span> in a statement on Saturday.",
    "author": "Peter Wade",
    "title": "Fraud Endorses Quack"
  },
  {
    "id": 5852,
    "mediaId": 2688,
    "date": "2022-04-10",
    "sentence": "Senate Minority Leader Mitch McConnell (R-KY) on Sunday declined to weigh in on former President Trump’s endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the crowded Pennsylvania Senate race just weeks before the GOP primary.",
    "author": "Matt Shuham",
    "title": "McConnell Sidesteps Trump’s Endorsement Of Celebrity Doctor Oz Weeks Before GOP Primary"
  },
  {
    "id": 5921,
    "mediaId": 2726,
    "date": "2022-04-10",
    "sentence": "On Sunday, Trump also gave his \"total endorsement\" of <span class='selected-term'>Mehmet Oz</span> — also known as the TV personality \"Dr. Oz\" — and called the latter \"brilliant.\"",
    "author": "Cheryl Teh",
    "title": "Republican governor says Trump is backing 'crazy' candidates for the GOP's primary races and is 'going to lose in 2022'"
  },
  {
    "id": 5718,
    "mediaId": 2532,
    "date": "2022-04-10",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he's the farthest thing from America First & he'd be very bad for PA.\"\n2022 Midterm Elections\n More\n A test for Trump as Michigan GOP gathers\n McCarthy considered telling Trump to resign after Jan. 6, recording shows\n Bernie Sanders hasn't ruled out third run for presidency\n Florida governor approves map that could give GOP more U.S. House seats\n Tennessee GOP kicks Trump-backed candidate off congressional primary ballot\n More\nIn:\nPennsylvania\nUnited States Senate\n<span class='selected-term'>Mehmet Oz</span>\nDonald Trump",
    "author": "",
    "title": "Trump endorses Dr. Mehmet Oz in Pennsylvania Senate primary race"
  },
  {
    "id": 5736,
    "mediaId": 2861,
    "date": "2022-04-10",
    "sentence": "Trump said of Oz “doctor is smart, tough, and will never let you down.”\nFormer President Donald Trump on Saturday endorsed “the brilliant and well-known” Dr. <span class='selected-term'>Mehmet Oz</span> in his bid to represent Pennsylvania in the U.S. Senate, saying the “doctor is smart, tough, and will never let you down.”\nI get paid more than $90 to $100 per hour for working online.",
    "author": "",
    "title": "WATCH: Trump endorses Dr. Oz for Pennsylvania Senate says the “doctor is smart, tough, and will never let you down”"
  },
  {
    "id": 5728,
    "mediaId": 2592,
    "date": "2022-04-10",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" the endorsement read.",
    "author": "Ashley Palya",
    "title": "Trump Endorses Dr. Oz In Pennsylvania Senate Race, Says Decision 'All About Winning Elections'"
  },
  {
    "id": 5804,
    "mediaId": 2654,
    "date": "2022-04-10",
    "sentence": "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Jill Colvin",
    "title": "Trump endorses Dr. Oz in Pennsylvania’s Senate race"
  },
  {
    "id": 5643,
    "mediaId": 2534,
    "date": "2022-04-10",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "Jill Colvin and Marc Levy",
    "title": "Trump backs Dr. Oz: Will Pennsylvania MAGA voters embrace it?"
  },
  {
    "id": 5673,
    "mediaId": 2738,
    "date": "2022-04-10",
    "sentence": "On Saturday, as CNN shared, Trump went ahead and gave quack TV doc <span class='selected-term'>Mehmet Oz</span>, who is running for senator in Pennsylvania, his full endorsement.",
    "author": "Jennifer Wood",
    "title": "Donald Trump Endorsing Dr. Oz In The PA Senate Race Has Sparked A Hilarious MAGA Mutiny"
  },
  {
    "id": 5703,
    "mediaId": 2688,
    "date": "2022-04-10",
    "sentence": "Shortly after former President Trump announced his endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the hotly contested Pennsylvania Senate GOP primary, a slew of Trumpworld figures fired up social media with their apparent disapproval of the former president’s new endorsee to replace retiring Sen. Pat Toomey (R-PA).",
    "author": "Matt Shuham",
    "title": "‘Romney 2.0': Trumpworld Implodes Over Ex-POTUS’ Endorsement Of Dr. Oz"
  },
  {
    "id": 5246,
    "mediaId": 2557,
    "date": "2022-04-10",
    "sentence": "President Trump vows to ‘demand justice for the Jan. 6 prisoners and full protection of their civil rights like was received by ANTIFA, Black Lives Matter who murdered people throughout our country.’ pic.twitter.com/I9VxV5zpjh\nPresident Trump: ‘We must ensure that every election can be FULLY and quickly audited.’ pic.twitter.com/9sWhOHumo6\nTrump confirmed his endorsement for Dr. <span class='selected-term'>Mehmet Oz</span>, in Pennsylvania, who is running for U.S. Senate.",
    "author": "DML News App",
    "title": "WATCH: Highlights from Trump’s speech at North Carolina rally"
  },
  {
    "id": 6086,
    "mediaId": 2668,
    "date": "2022-04-10",
    "sentence": "A new WHTM/Emerson College Polling/The Hill Pennsylvania primary poll shows David McCormick and <span class='selected-term'>Mehmet Oz</span> continuing to lead in the Republican race for one of Pennsylvania’s U.S. Senate seats.",
    "author": "Duke",
    "title": "Did Donald Trump Just Burn Some Bridges With His Base Over the Dr. Oz Endorsement?"
  },
  {
    "id": 6613,
    "mediaId": 8270,
    "date": "2022-04-10",
    "sentence": "By JILL COLVIN and MARC LEVY\nHARRISBURG, Pa. (AP) — Former President Donald Trump endorsed <span class='selected-term'>Mehmet Oz</span> in Pennsylvania’s crowded Republican Senate primary, ending months of jockeying for his support.",
    "author": "Associated Press",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 6758,
    "mediaId": 8409,
    "date": "2022-04-10",
    "sentence": "By JILL COLVIN and MARC LEVY\nHARRISBURG, Pa. (AP) — Former President Donald Trump endorsed <span class='selected-term'>Mehmet Oz</span> in Pennsylvania’s crowded Republican Senate primary, ending months of jockeying for his support.",
    "author": "Associated Press",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 6669,
    "mediaId": 8300,
    "date": "2022-04-10",
    "sentence": "By JILL COLVIN and MARC LEVY\nHARRISBURG, Pa. (AP) — Former President Donald Trump endorsed <span class='selected-term'>Mehmet Oz</span> in Pennsylvania’s crowded Republican Senate primary, ending months of jockeying for his support.",
    "author": "Associated Press",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 6542,
    "mediaId": 8306,
    "date": "2022-04-10",
    "sentence": "By JILL COLVIN and MARC LEVY\nHARRISBURG, Pa. (AP) — Former President Donald Trump endorsed <span class='selected-term'>Mehmet Oz</span> in Pennsylvania’s crowded Republican Senate primary, ending months of jockeying for his support.",
    "author": "Associated Press",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 6198,
    "mediaId": 8254,
    "date": "2022-04-11",
    "sentence": "(WHTM) – Former President Donald Trump sent shockwaves across Pennsylvania when he formally endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania’s crowded U.S. Senate race.",
    "author": "Dennis Owens",
    "title": "Republicans react to Donald Trump’s endorsement of Dr. Oz"
  },
  {
    "id": 6074,
    "mediaId": 6428,
    "date": "2022-04-11",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> gained a celebrity endorsement from another prominent T.V.",
    "author": "",
    "title": "Trump Endorses Dr. Oz in Pennsylvania's Crowded GOP Senate Primary"
  },
  {
    "id": 5225,
    "mediaId": 2557,
    "date": "2022-04-11",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by TheHill.com:\nFrustration is mounting on the GOP’s right flank over former President Trump’s endorsement of <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate race.",
    "author": "DML News App",
    "title": "POLL: After you see THIS, do you support Trump’s endorsement of Dr. Oz for U.S. Senate?"
  },
  {
    "id": 5256,
    "mediaId": 2658,
    "date": "2022-04-11",
    "sentence": "— Minority Leader Mitch McConnell (R-Ky.)\n\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.",
    "author": "",
    "title": "Donald Trump endorsed Dr. Mehmet Oz over the weekend in the Pennsylvania Senate race. Mitch McConnell didn't follow suit."
  },
  {
    "id": 5708,
    "mediaId": 2721,
    "date": "2022-04-11",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” he added.",
    "author": "",
    "title": "Trump splits conservatives by endorsing Dr. Oz"
  },
  {
    "id": 5650,
    "mediaId": 2624,
    "date": "2022-04-11",
    "sentence": "Trump’s standing has improved in North Carolina, where he has endorsed Rep. Ted Budd for the state’s open Senate seat, and in Pennsylvania, where he endorsed former television host Dr. <span class='selected-term'>Mehmet Oz</span> for Senate over the weekend as “the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\nIn Ohio, where Trump has also not weighed in on Republican Gov.",
    "author": "Eli Yokley",
    "title": "Trump’s Endorsees May Lose Some Primaries, but He’s Still the GOP’s Dominant Force"
  },
  {
    "id": 5625,
    "mediaId": 2716,
    "date": "2022-04-11",
    "sentence": "Over the weekend, former President Donald Trump endorsed <span class='selected-term'>Mehmet Oz</span> — \"Dr. Oz\" to the many viewers of his longtime syndicated television show — in the Pennsylvania GOP primary for U.S. Senate.",
    "author": "Joel Mathis",
    "title": "Trump's real ideology: fame"
  },
  {
    "id": 5759,
    "mediaId": 2621,
    "date": "2022-04-11",
    "sentence": "Trump has endorsed both men as he continues to throw his support behind various Republicans running, including recently Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Zachary Leeman",
    "title": "Trump Rally in North Carolina Draws Fewer Than 2,000 People: Report"
  },
  {
    "id": 5798,
    "mediaId": 2738,
    "date": "2022-04-11",
    "sentence": "Trump’s been feeling some intense backlash for endorsing Dr. <span class='selected-term'>Mehmet Oz</span> in a Senate race out of Pennsylvania.",
    "author": "Kimberly Ricci",
    "title": "Trump’s Poorly-Attended Weekend Rally Included Bragging So Silly That His Own Crowd Began Laughing"
  },
  {
    "id": 5900,
    "mediaId": 2730,
    "date": "2022-04-11",
    "sentence": "In today's episode, Kurt discusses President Trump's latest endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> for the U.S. Senate in Pennsylvania and why he believes the decision is an epic screw-up.",
    "author": "Townhall.com Staff",
    "title": "Schlichter: President Trump Screwed Up Epically"
  },
  {
    "id": 5895,
    "mediaId": 4024,
    "date": "2022-04-11",
    "sentence": "PENNSYLVANIA (LifeSiteNews) – Former President Donald Trump disappointed some of his most ardent supporters over the weekend by endorsing TV personality Dr. <span class='selected-term'>Mehmet Oz</span> in the Republican primary for a U.S. Senate seat in Pennsylvania, despite his history of staking out left-wing positions on issues important to conservatives.",
    "author": "",
    "title": "Dr. Oz receives Trump endorsement for Senate despite support for abortion, ‘transitioning’ kids"
  },
  {
    "id": 6017,
    "mediaId": 2540,
    "date": "2022-04-11",
    "sentence": "That fact was borne out over the weekend when Trump endorsed TV doctor <span class='selected-term'>Mehmet Oz</span> over hedge fund rich guy David McCormick in advance of next month's Republican Senate primary.",
    "author": "Chris Cillizza",
    "title": "The very simple reason why Donald Trump chose Mehmet Oz in Pennsylvania"
  },
  {
    "id": 5998,
    "mediaId": 8484,
    "date": "2022-04-11",
    "sentence": "+8\nView gallery\n+8\nView gallery\nConservatives are grumbling over former President Donald Trump's (left) decision to back Dr. <span class='selected-term'>Mehmet Oz</span> (right) in the May 17 Republican Senate primary\n+8\nView gallery\nHuman Events' Jack Posobiec, a Pennsylvania native, tweeted out footage of a vintage Dr. Oz episode that focused on transgender children\n+8\nView gallery\nPosobiec also highlighted an Oz tweet from 2018 that suggested the Centers for Disease Control and Prevention should conduct a study on gun violence\n'You're not America First.",
    "author": "Nikki Schwab",
    "title": "MAGA turns on Trump for endorsing Dr. Oz: Supporters tear into TV star's past comments on abortion and transgender issues after ex-president gave him prized backing in Pennsylvania Senate race"
  },
  {
    "id": 5605,
    "mediaId": 2643,
    "date": "2022-04-11",
    "sentence": "Trump made headlines over the weekend for endorsing Dr. <span class='selected-term'>Mehmet Oz</span> for Senate ahead of the Republican primary in Pennsylvania.",
    "author": "Alexandra Hutzler",
    "title": "Trump Hugely Popular in States With Key Senate Races"
  },
  {
    "id": 5551,
    "mediaId": 2752,
    "date": "2022-04-11",
    "sentence": "Saturday, during his latest coup-coup hate rally, Donald Trump officially endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in the GOP Pennsylvania Senate primary.",
    "author": "Stephen Robinson",
    "title": "Trump Thinks TV Quack Dr. Oz Qualified For Elected Office"
  },
  {
    "id": 5527,
    "mediaId": 2526,
    "date": "2022-04-11",
    "sentence": "Host Alex Marlow breaks down the latest news, including President Trump’s endorsement of Dr. <span class='selected-term'>Mehmet Oz</span>, Elon Musk backing off Twitter’s board, the latest trans hysteria, the chaos at our border, France’s presidential election, and Big Joey’s latest effort to dis-unify the country.",
    "author": "Breitbart News",
    "title": "Breitbart News Daily Podcast Ep. 111: Trump Endorses Dr. Oz, Musk Off Twitter Board; Guest: David Mamet"
  },
  {
    "id": 5531,
    "mediaId": 2724,
    "date": "2022-04-11",
    "sentence": "pic.twitter.com/XkIE6qV4R0\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 16, 2022\nWe live in a time where too many Republicans try selling their conservative wares just to get elected only to start functioning like barely-disguised left-of-center RINOs once they get into office.",
    "author": "Rusty Weiss",
    "title": "I’m Just Going To Say This: Trump’s Endorsement Of Dr. Oz Is The Wrong Move"
  },
  {
    "id": 5525,
    "mediaId": 2533,
    "date": "2022-04-11",
    "sentence": "Dr. Oz also passionately believes in high-quality education and protecting parent involvement throughout the process.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\n“Women, in particular, are drawn to Dr. Oz for his advice and counsel.",
    "author": "Staff -",
    "title": "Dr. Oz Is Running for Senate and He Just Got Big News From Donald Trump"
  },
  {
    "id": 5556,
    "mediaId": 2688,
    "date": "2022-04-12",
    "sentence": "“Hence, our Country is going to hell.”\nLast weekend, the former president announced his controversial endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the hotly contested GOP primary for Pennsylvania Senate.",
    "author": "Matt Shuham",
    "title": "Trump Refuses To Back His Ex-US Attorney For Not Big Lying Hard Enough"
  },
  {
    "id": 5606,
    "mediaId": 2640,
    "date": "2022-04-12",
    "sentence": "(Newser) – Over the weekend, former President Trump endorsed <span class='selected-term'>Mehmet Oz</span>—better known to Americans as Dr. Oz—in the GOP Senate primary in Pennsylvania.",
    "author": "John Johnson",
    "title": "Trump's Dr. Oz Endorsement Is Proving Controversial"
  },
  {
    "id": 5988,
    "mediaId": 5153,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Dave Goldiner",
    "title": "Dr. Oz boasts Trump endorsement but rivals slam record on abortion, guns and trans rights"
  },
  {
    "id": 5822,
    "mediaId": 2656,
    "date": "2022-04-12",
    "sentence": "Donald Trump’s recent endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Republican Senate primary shook MAGA world to its core.",
    "author": "Rick Moran",
    "title": "The Silly Talk of Trump's Demise Over Oz Endorsement"
  },
  {
    "id": 5695,
    "mediaId": 2716,
    "date": "2022-04-12",
    "sentence": "And Trump's endorsement of <span class='selected-term'>Mehmet Oz</span>?",
    "author": "Peter Weber",
    "title": "Late night hosts explore Russia's sanctions pains, Don Jr.'s election texts, Trump's Dr. Oz nod"
  },
  {
    "id": 5715,
    "mediaId": 8428,
    "date": "2022-04-12",
    "sentence": "Trump has endorsed Herschel Walker in his race to unseat Sen. Raphael Warnock, D-Ga., Rep. Ted Budd in his campaign to replace retiring Sen. Richard Burr, R-N.C., and Dr. <span class='selected-term'>Mehmet Oz</span> in his close primary race to replace retiring Sen. Pat Toomey, R-Pa.\nTrump has not yet endorsed a Senate candidate in Ohio, although multiple Republicans seek his support.",
    "author": "Timothy Frudd",
    "title": "Trump’s approval rating remains strong among Republicans"
  },
  {
    "id": 5248,
    "mediaId": 2594,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Andrew Naughtie",
    "title": "Trump news: Kevin McCarthy says ex-president accepted responsibility for Jan 6 in new audio"
  },
  {
    "id": 5291,
    "mediaId": 2557,
    "date": "2022-04-12",
    "sentence": "Perhaps most importantly, I believe the <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\nPromoted Content\nPresident Donald J. Trump announces his endorsement of Dr. Oz pic.twitter.com/k6U7UrkmdC\n— Liz Harrington (@realLizUSA) April 9, 2022\nListen to the latest daily DML podcasts below!",
    "author": "DML News App",
    "title": "REPORT: Trump refuses to endorse ‘coward’ ex-US attorney running for governor"
  },
  {
    "id": 6085,
    "mediaId": 2631,
    "date": "2022-04-12",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump said in his statement.",
    "author": "",
    "title": "‘Dr. Oz’ bets Trump endorsement can catapult him in Pa. Senate race"
  },
  {
    "id": 6781,
    "mediaId": 8449,
    "date": "2022-04-12",
    "sentence": "“Quizás lo más importante, creo que <span class='selected-term'>Mehmet Oz</span> será el más capaz de ganar las elecciones generales contra un demócrata de izquierda radical que busca causar un daño impensable a nuestro país”, escribió Trump.",
    "author": "",
    "title": "Trump respalda a Dr. Oz en la carrera primarista del Senado"
  },
  {
    "id": 5809,
    "mediaId": 2718,
    "date": "2022-04-13",
    "sentence": "That might not put Ingraham in rare company, but it is unusual for Fox News hosts to turn on their own — and that’s exactly what “The Ingraham Angle” host did Tuesday night, calling out Hannity and Trump for their endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> as the Republican candidate for Senate in Pennsylvania.",
    "author": "Josh Dickey",
    "title": "Laura Ingraham Turns on Hannity and Trump for Dr. Oz Endorsement: ‘I’m Not Afraid to Say It’"
  },
  {
    "id": 5830,
    "mediaId": 2699,
    "date": "2022-04-13",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> got a nudge in Pennsylvania’s Republican Senate primary race this weekend after he scored Donald Trump’s coveted endorsement.",
    "author": "The Daily Beast",
    "title": "Trump Fans Found a Way to Be Even Worse at the Airport"
  },
  {
    "id": 5959,
    "mediaId": 2752,
    "date": "2022-04-13",
    "sentence": "He’s endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania GOP Senate primary and South Dakota Governor Kristi Noem.",
    "author": "Stephen Robinson",
    "title": "Trump To Ron DeSantis: Just Do Me A Favor Though"
  },
  {
    "id": 5382,
    "mediaId": 2592,
    "date": "2022-04-13",
    "sentence": "Donald Trump's decision to endorse celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate race has divided local Republican Party officials and stunned close advisers who thought he had decided to stay out of the contest to pick a Republican candidate, two sources familiar with internal deliberations told Reuters.",
    "author": "Jarrett Renshaw",
    "title": "Trump Endorsement Of Dr. Oz In Senate Race Stuns Advisers, Divides Loyalists"
  },
  {
    "id": 5436,
    "mediaId": 2562,
    "date": "2022-04-13",
    "sentence": "",
    "author": "NationalWatch",
    "title": "Mehmet Oz to Newsmax: Trump Endorsement ‘Massive’ in Senate Primary"
  },
  {
    "id": 5615,
    "mediaId": 6526,
    "date": "2022-04-14",
    "sentence": "I saw the latest campaign commercial for <span class='selected-term'>Mehmet Oz</span> on Wednesday morning.",
    "author": "Paul Muschick",
    "title": "Is the Pennsylvania GOP Senate primary over because Trump endorsed Dr. Oz?"
  },
  {
    "id": 5682,
    "mediaId": 2790,
    "date": "2022-04-14",
    "sentence": "GROSS: Pennsylvania's an interesting race, which I just want to refer to briefly here, because Trump decided to endorse Dr. <span class='selected-term'>Mehmet Oz</span>, who is a famous TV personality.",
    "author": "Terry Gross",
    "title": "The midterm elections will show if Trump is still a 'kingmaker'"
  },
  {
    "id": 5281,
    "mediaId": 2557,
    "date": "2022-04-14",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nFox News host Laura Ingraham called former President Donald Trump and her colleague Sean Hannity’s endorsement of Republican Pennsylvania Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> a “mistake” Tuesday.",
    "author": "DML News App",
    "title": "VIDEO: Laura Ingraham Goes Against Trump And Hannity, Calls Their Latest Move A ‘Mistake’"
  },
  {
    "id": 5982,
    "mediaId": 2781,
    "date": "2022-04-15",
    "sentence": "Elsewhere, Dr. Oz referred to Smollett as “a good friend,” adding, “Jussie, if you’re watching this, the entire audience, all of us, are saying we love you very much, we wish you the best.”\nThe month after Jussie Smollett tried to smear President Trump by faking a racist hate crime against himself, liberal <span class='selected-term'>Mehmet Oz</span> used his TV show to go on and on about how much he \"adores\" and \"loves\" his \"good friend\" Jussie Smollett.",
    "author": "Joe Miller",
    "title": "WATCH: Resurfaced Video Shows Dr. Oz Praising Jussie Smollett After Hoax Attack"
  },
  {
    "id": 5666,
    "mediaId": 4091,
    "date": "2022-04-15",
    "sentence": "(Natural News) Dr. <span class='selected-term'>Mehmet Oz</span> is running for the United States Senate in the Commonwealth of Pennsylvania, and former President Donald Trump is endorsing him.",
    "author": "Ethan Huff",
    "title": "Trump officially endorses Dr. Oz, calls him “smart, tough” … but not all conservatives are happy about it"
  },
  {
    "id": 5366,
    "mediaId": 2550,
    "date": "2022-04-15",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>\nThe last time we checked in on Donald Trump's endorsement of celebrity healther Dr. Mehmet Oz for Pennsylvania's open Senate seat, right-wingers from Roger Stone to former OANN anchors were blasting the move.",
    "author": "",
    "title": "Strike two: Trump's Oz endorsement quickly turning into his second disaster in Pennsylvania"
  },
  {
    "id": 5359,
    "mediaId": 2664,
    "date": "2022-04-17",
    "sentence": "\"Last Week Tonight\" host John Oliver opened his Sunday show by talking about former President Donald Trump announcing his support for <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Republican Senate primary.",
    "author": "Sarah K. Burris",
    "title": "John Oliver makes fun of Dr. Oz complaining about the price of crudité a year after 'surfing' in Italy"
  },
  {
    "id": 5297,
    "mediaId": 2592,
    "date": "2022-04-17",
    "sentence": "KEY POINTS\nTrump said he received advice from Dr. Oz to lose weight and observe a healthy lifestyle\nTrump is known for his love of McDonald's and Diet Coke\nTrump can down approximately a dozen Diet Cokes each day\nFormer President Donald Trump recently lamented that he does not have the time to lose weight as he told a crowd about the advice he received from TV personality Dr. <span class='selected-term'>Mehmet Oz</span>, who he recently endorsed for the Pennsylvania Senate Race.",
    "author": "Danielle Ong",
    "title": "Trump Talks About His Weight: 'I Don’t Have Time To Lose Weight'"
  },
  {
    "id": 5452,
    "mediaId": 2699,
    "date": "2022-04-17",
    "sentence": "On Sunday evening’s edition of Last Week Tonight, John Oliver kicked off the show by addressing former President Donald Trump’s recent endorsement of snake-oil salesman Dr. <span class='selected-term'>Mehmet Oz</span>, who aggressively pushed hydroxychloroquine as a COVID-19 treatment during the pandemic, in the Pennsylvania Senate race.",
    "author": "Marlow Stern",
    "title": "John Oliver Reveals How He’s Been Trolling Dr. Oz for Years"
  },
  {
    "id": 5638,
    "mediaId": 2721,
    "date": "2022-04-17",
    "sentence": "In Pennsylvania, for example, he endorsed Dr. <span class='selected-term'>Mehmet Oz</span> who, like Trump, was a longtime TV personality before entering politics.",
    "author": "",
    "title": "Mitch McConnell openly attacks Trump"
  },
  {
    "id": 5808,
    "mediaId": 2894,
    "date": "2022-04-17",
    "sentence": "",
    "author": "Bryan Anderson",
    "title": "Smart tactic or missed opportunity? Budd is the latest GOP frontrunner to avoid debates"
  },
  {
    "id": 5668,
    "mediaId": 2589,
    "date": "2022-04-18",
    "sentence": "Jim Justice who testifies that “McKinley stands with Trump.” In the Pennsylvania Senate race, where Trump just recently endorsed TV personality Dr. <span class='selected-term'>Mehmet Oz</span>, businessman David McCormick has been running ads in which he pledges to “fight for America First energy policies like Donald Trump” and to “fight for what Trump and Reagan showed us all — the world is safest when America is strongest.” A recent ad for Gov.",
    "author": "Allahpundit",
    "title": "Megadonors at Manchin fundraiser whisper: He should run for president as a Republican in 2024"
  },
  {
    "id": 5877,
    "mediaId": 6497,
    "date": "2022-04-18",
    "sentence": "Not surprisingly, Donald Trump’s endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate — and Oz’s campaign itself — aren’t sitting well with John Oliver.",
    "author": "Kimberly Nordyke",
    "title": "John Oliver Takes on Dr. Oz and His “Sh— Show” Senate Campaign on ‘Last Week Tonight’"
  },
  {
    "id": 5558,
    "mediaId": 2644,
    "date": "2022-04-18",
    "sentence": "The former president and longtime reality TV personality stepped in recently to endorse Dr. <span class='selected-term'>Mehmet Oz</span>, another erstwhile reality personality, in his Republican bid for a Pennsylvania Senate seat.",
    "author": "Kase Wickman",
    "title": "John Oliver Tears Into Dr. Oz’s ‘Sh*t Show’ Senate Campaign"
  },
  {
    "id": 5305,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "“I’m a gambler,” Trump told one aide about wading into the Pennsylvania primary a second time—this time to endorse fellow TV huckster Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Trump's loving every minute of kneecapping Republicans' midterm chances"
  },
  {
    "id": 5022,
    "mediaId": 8493,
    "date": "2022-04-19",
    "sentence": "KREAMER – ‘There’s so much more opportunity in Snyder County,’ that was part of the message from GOP U.S. Senate Candidate Dr. <span class='selected-term'>Mehmet Oz</span> when he visited the Valley Tuesday.",
    "author": "WKOK Staff",
    "title": "Dr. Oz: Snyder County Has ‘So Much More Opportunity’"
  },
  {
    "id": 4665,
    "mediaId": 8412,
    "date": "2022-04-20",
    "sentence": "Pennsylvania Republican Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> torched Biden’s policies and argued that people \"are angry,\" as \"inflation rates rage forward.\"",
    "author": "Stephanie Giang-Paunon",
    "title": "Dr. Oz rips Biden’s policies as inflation rages forward"
  },
  {
    "id": 5620,
    "mediaId": 8290,
    "date": "2022-04-20",
    "sentence": "The California conservative was particularly put off by Trump’s recent decision to endorse TV doctor <span class='selected-term'>Mehmet Oz</span> in the upcoming (May 17) Pennsylvania Republican U.S. Senate primary.",
    "author": "Jeffrey A. Rendall",
    "title": "The Right Resistance: Trump doesn’t require vote of confidence, but he does need primary competitors"
  },
  {
    "id": 5472,
    "mediaId": 2562,
    "date": "2022-04-20",
    "sentence": "Dr. Oz to Newsmax: Time for Americans to \"Get Back to Reality' on COVID (Newsmax/\"National Report\")\nBy Sandy Fitzgerald | Wednesday, 20 April 2022 03:36 PM\nNow that a federal judge has lifted the Centers for Disease Control and Prevention's mask mandate for planes and other forms of transportation, it's important to \"let America get back to reality\" and learn to travel without masks, Dr. <span class='selected-term'>Mehmet Oz</span>, now a GOP candidate for the U.S. Senate race in Pennsylvania, told Newsmax Wednesday.",
    "author": "NationalWatch",
    "title": "Dr. Oz to Newsmax: Time for Americans to “Get Back to Reality’ on COVID"
  },
  {
    "id": 4721,
    "mediaId": 8356,
    "date": "2022-04-21",
    "sentence": "According to RealClearPolitics.com, McCormick has an average lead of 4.2% in polls of the race since late February, although Dr. <span class='selected-term'>Mehmet Oz</span>, who received the GOP-coveted endorsement of former President Donald Trump, held a 3-percentage point lead over McCormick in a recent Trafalgar Group poll.",
    "author": "",
    "title": "PA Senate race: Ex hedge fund CEO David McCormick tries to fend off Oz's Trump endorsement"
  },
  {
    "id": 6050,
    "mediaId": 4091,
    "date": "2022-04-21",
    "sentence": "Although Trump may have helped in the last lockdown, he had proudly given birth to the deadly COVID-19 vaccines and endorsed the candidacy of Dr. <span class='selected-term'>Mehmet Oz</span>, the host of the “Dr.",
    "author": "Kevin Hughes",
    "title": "Forced COVID lockdowns may soon be coming back to America"
  },
  {
    "id": 4809,
    "mediaId": 2562,
    "date": "2022-04-23",
    "sentence": "David McCormick to Newsmax: Trump Endorsing Oz Won't Stop Me From Winning (Newsmax's \"America Right Now\")\nBy Eric Mack | Saturday, 23 April 2022 01:49 PM\nWhile former President Donald Trump is popular in his state and the endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> \"matters,\" Pennsylvania Senate GOP primary candidate David McCormick told Newsmax it will not keep him from winning on May 18.",
    "author": "NationalWatch",
    "title": "David McCormick to Newsmax: Trump Endorsing Oz Won’t Stop Me From Winning"
  },
  {
    "id": 5063,
    "mediaId": 2643,
    "date": "2022-04-23",
    "sentence": "He criticized Trump's endorsement of physician and TV personality <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's GOP primary Senate race earlier this month.",
    "author": "Jason Lemon",
    "title": "Trump Ally Roger Stone Demands 'RINO' McCarthy Resign After Leaked Audio"
  },
  {
    "id": 5169,
    "mediaId": 2687,
    "date": "2022-04-23",
    "sentence": "“But the endorsements have also provoked backlash from some Republicans who believe Trump has betrayed his core supporters by backing Hillbilly Elegy author JD Vance in Ohio and TV’s Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Taegan Goddard",
    "title": "Trump’s Endorsements Bring Cash Windfall, Backlash"
  },
  {
    "id": 5162,
    "mediaId": 2528,
    "date": "2022-04-24",
    "sentence": "—This Week (@ThisWeekABC) April 24, 2022\nChristie continued by saying Trump's endorsements landed \"all over the place,\" referencing Trump's Senate endorsements of \"Hillbilly Elegy\" author JD Vance and TV personality Dr. <span class='selected-term'>Mehmet Oz</span>,\nBoth endorsements received backlash from Republican party officials.",
    "author": "Hannah Getahun",
    "title": "Chris Christie says Donald Trump's endorsements are 'emotional decisions' and not 'political analysis'"
  },
  {
    "id": 5195,
    "mediaId": 8415,
    "date": "2022-04-24",
    "sentence": "But the endorsements have also provoked backlash from some Republicans who believe Trump has betrayed his core supporters by backing “Hillbilly Elegy” author JD Vance in Ohio and TV’s Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Associated Press",
    "title": "Trump’s Oz, Vance endorsements bring cash windfall, backlash"
  },
  {
    "id": 5078,
    "mediaId": 8418,
    "date": "2022-04-24",
    "sentence": "But the endorsements have also provoked backlash from some Republicans who believe Trump has betrayed his core supporters by backing “Hillbilly Elegy” author JD Vance in Ohio and TV’s Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Associated Press",
    "title": "Trump’s Oz, Vance endorsements bring cash windfall, backlash"
  },
  {
    "id": 4948,
    "mediaId": 8300,
    "date": "2022-04-24",
    "sentence": "But the endorsements have also provoked backlash from some Republicans who believe Trump has betrayed his core supporters by backing “Hillbilly Elegy” author JD Vance in Ohio and TV’s Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Associated Press",
    "title": "Trump’s Oz, Vance endorsements bring cash windfall, backlash"
  },
  {
    "id": 4990,
    "mediaId": 8306,
    "date": "2022-04-24",
    "sentence": "",
    "author": "Associated Press",
    "title": "Trump’s Oz, Vance endorsements bring cash windfall, backlash"
  },
  {
    "id": 4937,
    "mediaId": 8484,
    "date": "2022-04-24",
    "sentence": "Oz is on the far right, seen here with the Trumps and Piers Morgan on the left\n+7\nView gallery\n+7\nView gallery\nConservatives are grumbling over former President Donald Trump's (left) decision to back Dr. <span class='selected-term'>Mehmet Oz</span> (right) in the May 17 Republican Senate primary\n+7\nView gallery\nHuman Events' Jack Posobiec, a Pennsylvania native, tweeted out footage of a vintage Dr. Oz episode that focused on transgender children\nThe Trump endorsement could break a deadlock in the Pennsylvania race.",
    "author": "Adam Manno For Dailymail.Com",
    "title": "REVEALED: Dr. Oz bought up thousands of dollars of Trump-backed hydroxychloroquine pills during pandemic"
  },
  {
    "id": 4760,
    "mediaId": 2548,
    "date": "2022-04-24",
    "sentence": "Former President Donald Trump has endorsed David McCormick’s chief rival, former reality show host and heart surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, citing Oz’s perceived electability.",
    "author": "Michael Ginsberg",
    "title": "Wall Street Tries to Take Out Trump’s Senate Candidate In Pennsylvania"
  },
  {
    "id": 4693,
    "mediaId": 8270,
    "date": "2022-04-24",
    "sentence": "",
    "author": "Associated Press",
    "title": "Trump’s Oz, Vance endorsements bring cash windfall, backlash"
  },
  {
    "id": 4611,
    "mediaId": 8254,
    "date": "2022-04-24",
    "sentence": "But the endorsements have also provoked backlash from some Republicans who believe Trump has betrayed his core supporters by backing “Hillbilly Elegy” author JD Vance in Ohio and TV’s Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "JILL COLVIN",
    "title": "Trump’s Oz, Vance endorsements bring cash windfall, backlash"
  }
]