[
  {
    "id": 3923,
    "mediaId": 2631,
    "date": "2022-01-22",
    "sentence": "",
    "author": "",
    "title": "Trump stays on sidelines in Pennsylvania Senate race — for now"
  },
  {
    "id": 9242,
    "mediaId": 2512,
    "date": "2022-03-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> has been a fixture on television for the past 13 years, ever since Oprah began featuring him as a guest on her talk show.",
    "author": "Timothy Evans",
    "title": "Dr. Oz's TV staffers say he 'blindsided everyone' when he abruptly fired them to run for Senate"
  },
  {
    "id": 6063,
    "mediaId": 6656,
    "date": "2022-04-09",
    "sentence": "April 9 (UPI) -- Former President Donald Trump has endorsed television personality Dr. <span class='selected-term'>Mehmet Oz</span> in his campaign to fill the U.S. Senate seat in Pennsylvania vacated by retiring Sen. Patrick Toomey.",
    "author": "Adam Schrader",
    "title": "Trump endorses Dr. Oz's campaign for U.S. Senate"
  },
  {
    "id": 7359,
    "mediaId": 2592,
    "date": "2022-04-09",
    "sentence": "Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for U.S. Senate in Pennsylvania.",
    "author": "Moira Warburton and Jan Wolfe",
    "title": "Trump Endorses Celebrity Surgeon Dr. Mehmet Oz For U.S. Senate Seat In Pennsylvania"
  },
  {
    "id": 5825,
    "mediaId": 2745,
    "date": "2022-04-09",
    "sentence": "Former president Donald Trump on Saturday jumped into a high-stakes intraparty contest, endorsing fellow television celebrity-turned-politician <span class='selected-term'>Mehmet Oz</span> in the contested Republican primary for the U.S. Senate in Pennsylvania, where the leading candidates jockeyed aggressively for Trump’s support.",
    "author": "",
    "title": "Trump endorses Dr. Oz in Pennsylvania Senate race, a key battleground"
  },
  {
    "id": 5542,
    "mediaId": 4043,
    "date": "2022-04-09",
    "sentence": "Dr <span class='selected-term'>Mehmet Oz</span>, a Turkish-American TV personality who made more than 60 appearances on Winfrey's show before it stopped airing in 2011, is running to replace retiring Republican Pat Toomey in Pennsylvania.",
    "author": "Tom Acres",
    "title": "Donald Trump endorses celebrity surgeon known for guesting on Oprah in crucial Senate race"
  },
  {
    "id": 5595,
    "mediaId": 8319,
    "date": "2022-04-09",
    "sentence": "Former President Donald Trump has endorsed Dr. <span class='selected-term'>Mehmet Oz</span> for the GOP Senate primary in Pennsylvania.",
    "author": "admin",
    "title": "Trump endorses Dr. Oz for Pennsylvania Senate"
  },
  {
    "id": 5423,
    "mediaId": 2746,
    "date": "2022-04-09",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nDuring his speech in North Carolina, Mr. Trump praised Mr. Oz’s career, adding that his success on television will serve him well with voters.",
    "author": "Joseph Clark",
    "title": "Trump endorses Dr. Oz for Senate"
  },
  {
    "id": 5361,
    "mediaId": 2618,
    "date": "2022-04-10",
    "sentence": "There are seven people running for the PA senate seat including two women, one white, one black: Kathy Barnette (Republican): MAGA businesswoman from Montgomery County, occasional Fox News commentator; Jeff Bartos (Republican): A real estate investor from Montgomery County; Sean Gale (Republican): A lawyer from Montgomery County; David McCormick (Republican) A former CEO of one of the world's largest hedge funds; <span class='selected-term'>Mehmet Oz</span> (Republican): A TV celebrity doctor; Carla Sands (Republican): from Mechanicsburg, Trumps' former ambassador to Denmark; George Bochetto (Republican): A Philadelphia defense attorney who sued the city over boxing-up of a statue of Christopher Columbus.",
    "author": "Bonchie",
    "title": "Donald Trump Just Made an Absolutely Head-Scratching Endorsement"
  },
  {
    "id": 6038,
    "mediaId": 2640,
    "date": "2022-04-10",
    "sentence": "The former president said he's backing <span class='selected-term'>Mehmet Oz</span>—aka the TV celebrity known as Dr. Oz—in Pennsylvania's Republican Senate primary.",
    "author": "John Johnson",
    "title": "Trump Endorses Big Name in a Big Race"
  },
  {
    "id": 6448,
    "mediaId": 8300,
    "date": "2022-04-11",
    "sentence": "A recent Emerson College poll of Pennsylvania Republican primary voters found that David McCormick and <span class='selected-term'>Mehmet Oz</span> are tied with 14% support at the top of the field, while no other candidate reached double digits.",
    "author": "Karen Shuey",
    "title": "Philadelphia attorney talks about his U.S. Senate campaign"
  },
  {
    "id": 6564,
    "mediaId": 8270,
    "date": "2022-04-11",
    "sentence": "A recent Emerson College poll of Pennsylvania Republican primary voters found that David McCormick and <span class='selected-term'>Mehmet Oz</span> are tied with 14% support at the top of the field, while no other candidate reached double digits.",
    "author": "Karen Shuey",
    "title": "Philadelphia attorney talks about his U.S. Senate campaign"
  },
  {
    "id": 6508,
    "mediaId": 8306,
    "date": "2022-04-11",
    "sentence": "A recent Emerson College poll of Pennsylvania Republican primary voters found that David McCormick and <span class='selected-term'>Mehmet Oz</span> are tied with 14% support at the top of the field, while no other candidate reached double digits.",
    "author": "Karen Shuey",
    "title": "Philadelphia attorney talks about his U.S. Senate campaign"
  },
  {
    "id": 5868,
    "mediaId": 6746,
    "date": "2022-04-12",
    "sentence": "On Saturday night, Trump outraged Pennsylvania conservatives by endorsing TV personality Dr. <span class='selected-term'>Mehmet Oz</span>, a more moderate Republican candidate for the state's open Senate seat.",
    "author": "Madz Dizon",
    "title": "Mitch McConnell Warns GOP Could Screw Up Senate Takeover in Midterm Election with \"Unacceptable Candidates\""
  },
  {
    "id": 5809,
    "mediaId": 2718,
    "date": "2022-04-13",
    "sentence": "That might not put Ingraham in rare company, but it is unusual for Fox News hosts to turn on their own — and that’s exactly what “The Ingraham Angle” host did Tuesday night, calling out Hannity and Trump for their endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> as the Republican candidate for Senate in Pennsylvania.",
    "author": "Josh Dickey",
    "title": "Laura Ingraham Turns on Hannity and Trump for Dr. Oz Endorsement: ‘I’m Not Afraid to Say It’"
  }
]