[
  {
    "id": 3027,
    "mediaId": 2557,
    "date": "2022-01-30",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Fox News:\nDr. <span class='selected-term'>Mehmet Oz</span> aided a man who called out for a doctor and then collapsed at a Pennsylvania Republican event this weekend.",
    "author": "DML News App",
    "title": "REPORT: Dr. Oz rushes to help unconscious man at Pennsylvania GOP event"
  },
  {
    "id": 2685,
    "mediaId": 2572,
    "date": "2022-01-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> aided a man who called out for a doctor and then collapsed at a Pennsylvania Republican event this weekend.",
    "author": "",
    "title": "Dr. Oz rushes to help unconscious man at Pennsylvania GOP event: 'It's my calling'"
  },
  {
    "id": 2686,
    "mediaId": 2573,
    "date": "2022-02-02",
    "sentence": "\"<span class='selected-term'>Mehmet Oz</span> – citizen of Turkey, creature of Hollywood – has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,\" McCormick campaign spokesperson Jess Szymanski charged.",
    "author": "Paul Steinhauser",
    "title": "New punches in China fistfight between Dr. Oz and David McCormick in Pennsylvania GOP Senate race"
  },
  {
    "id": 2149,
    "mediaId": 8401,
    "date": "2022-02-05",
    "sentence": "The Senate field is notable for wealthy and well-connected candidates moving from out of state to run, including <span class='selected-term'>Mehmet Oz</span>, best known as daytime TV’s host of “The Dr. Oz Show,” and David McCormick, the just-resigned CEO of one of the world’s largest hedge funds.",
    "author": "",
    "title": "Pennsylvania GOP Won’t Endorse In Big Primary Fields For Governor, Senate"
  },
  {
    "id": 1955,
    "mediaId": 6571,
    "date": "2022-02-05",
    "sentence": "The Senate field is notable for wealthy and well-connected candidates moving from out of state to run, including <span class='selected-term'>Mehmet Oz</span>, best known as daytime TV's host of \"The Dr. Oz Show,\" and David McCormick, the just-resigned CEO of one of the world's largest hedge funds.",
    "author": "",
    "title": "Pennsylvania Republican Party Decides Against Endorsing Candidates In Senate And Governor Races"
  },
  {
    "id": 1799,
    "mediaId": 2658,
    "date": "2022-02-05",
    "sentence": "Bartos, who has struggled in the polls and been outspent by celebrity physician <span class='selected-term'>Mehmet Oz</span> and former hedge fund CEO David McCormick, needs to shake up the race to overcome his rivals’ financial and name ID advantages.",
    "author": "",
    "title": "Pennsylvania GOP declines to endorse in Senate race"
  },
  {
    "id": 956,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Two of the leading Republican candidates in the Pennsylvania Senate race, David McCormick and <span class='selected-term'>Mehmet Oz</span>, have hit each other over a perceived lack of loyalty to former President Donald Trump, who has yet to issue an endorsement in the race.",
    "author": "Theodore Bunker",
    "title": "Pennsylvania GOP Senate Candidates Fight for Trump's Endorsement"
  },
  {
    "id": 201,
    "mediaId": 2526,
    "date": "2022-02-22",
    "sentence": "It’s a two-man race In Pennsylvania’s GOP senate primary, with David McCormick surging out in front and <span class='selected-term'>Mehmet Oz</span> sliding down into a distant second place, an internal poll commissioned by McCormick’s campaign shows.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Poll: David McCormick Surges into Lead in Pennsylvania GOP Senate Primary, Mehmet Oz Crashes"
  },
  {
    "id": 9634,
    "mediaId": 2701,
    "date": "2022-03-29",
    "sentence": "“Now all of a sudden [it] is the first question in their multiple choice.”\nNo representatives for daytime television star Dr. <span class='selected-term'>Mehmet Oz</span> or Montgomery County real estate developer Jeff Bartos, who are also candidates in the race, responded to The Federalist’s inquiries.",
    "author": "Tristan Justice",
    "title": "5 Pennsylvania GOP Senate Candidates Refuse Philadelphia Inquirer’s Grossly Biased Survey, Torch Paper As A ‘Biased’ ‘Rag’"
  },
  {
    "id": 7109,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "On the GOP side, a Real Clear Politics poll has David McCormick leading TV star <span class='selected-term'>Mehmet Oz</span> in four of five primary tracking polls.",
    "author": "Jason Clemons",
    "title": "Report: GOP Registration Surge in Pennsylvania Could Be Warning to Dems"
  },
  {
    "id": 5584,
    "mediaId": 2548,
    "date": "2022-04-09",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump added.",
    "author": "Michael Ginsberg",
    "title": "Trump Endorses Dr. Mehmet Oz In Pennsylvania GOP Senate Primary"
  },
  {
    "id": 5322,
    "mediaId": 2687,
    "date": "2022-04-12",
    "sentence": "Amanda Carpenter: “LOL, if you thought Donald Trump’s endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> for Senate was the worst development in Pennsylvania’s 2022 GOP primaries, wait until you hear about the Republicans running for governor.”\n“Pennsylvania Republicans will nominate a 2020 election conspiracist for governor in the May 17 primary.",
    "author": "Taegan Goddard",
    "title": "Pennsylvania GOP Will Nominate a Crackpot for Governor"
  },
  {
    "id": 5615,
    "mediaId": 6526,
    "date": "2022-04-14",
    "sentence": "I saw the latest campaign commercial for <span class='selected-term'>Mehmet Oz</span> on Wednesday morning.",
    "author": "Paul Muschick",
    "title": "Is the Pennsylvania GOP Senate primary over because Trump endorsed Dr. Oz?"
  }
]