[
  {
    "id": 3996,
    "mediaId": 2679,
    "date": "2022-01-25",
    "sentence": "Three, he is relatively unknown to voters, especially considering that his primary rivals include Jeff Bartos, the GOP’s endorsed candidate for lieutenant governor in 2018, and <span class='selected-term'>Mehmet Oz</span>, the heart surgeon, wellness author and TV personality who carries unrivaled name recognition as the host of daytime TV’s “Dr.",
    "author": "MARC LEVY",
    "title": "No Trump endorsement? Senate hopeful enlists other GOP stars"
  },
  {
    "id": 3844,
    "mediaId": 2594,
    "date": "2022-01-25",
    "sentence": "Three, he is relatively unknown to voters, especially considering that his primary rivals include Jeff Bartos, the GOP's endorsed candidate for lieutenant governor in 2018, and <span class='selected-term'>Mehmet Oz</span>, the heart surgeon, wellness author and TV personality who carries unrivaled name recognition as the host of daytime TV’s “Dr.",
    "author": "Via AP news wire",
    "title": "No Trump endorsement? Senate hopeful enlists other GOP stars"
  },
  {
    "id": 11552,
    "mediaId": 2716,
    "date": "2022-03-16",
    "sentence": "Pennsylvania Republican Senate candidate and TV personality Dr. <span class='selected-term'>Mehmet Oz</span> told reporters Tuesday that if elected in November, he would be willing to give up certain security clearances in order to keep his U.S.-Turkish dual citizenship.",
    "author": "Peter Weber",
    "title": "Dr. Mehmet Oz suggests he would give up Senate security clearances to keep Turkish dual citizenship"
  },
  {
    "id": 5620,
    "mediaId": 8290,
    "date": "2022-04-20",
    "sentence": "The California conservative was particularly put off by Trump’s recent decision to endorse TV doctor <span class='selected-term'>Mehmet Oz</span> in the upcoming (May 17) Pennsylvania Republican U.S. Senate primary.",
    "author": "Jeffrey A. Rendall",
    "title": "The Right Resistance: Trump doesn’t require vote of confidence, but he does need primary competitors"
  }
]