[
  {
    "id": 3546,
    "mediaId": 2594,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span>, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "Via AP news wire",
    "title": "Ryan, not onstage, takes central focus at Ohio Senate event"
  },
  {
    "id": 3423,
    "mediaId": 2679,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span>, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "JULIE CARR SMYTH",
    "title": "Tim Ryan, not onstage, is early focus of Ohio Senate event"
  },
  {
    "id": 4455,
    "mediaId": 8322,
    "date": "2022-01-27",
    "sentence": "Ryan is considered the favorite for the Democratic nomination in a small primary field that also includes progressive <span class='selected-term'>Morgan Harper</span>, a former Consumer Financial Protection Bureau senior adviser and 2020 congressional candidate.",
    "author": "Adam Shaw",
    "title": "Ohio Senate candidate Bernie Moreno wins endorsement from Border Patrol union"
  },
  {
    "id": 3551,
    "mediaId": 2728,
    "date": "2022-01-27",
    "sentence": "During the fiery hour-and-a-half event between Republican Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span>, Mandel repeatedly attacked Ryan for failing to debate Harper so far and portrayed it as fundamental disrespect among state Democrats for their Black voter base.",
    "author": "Julie Carr Smyth",
    "title": "Tim Ryan, not onstage, is early focus of Ohio Senate event"
  },
  {
    "id": 1870,
    "mediaId": 8491,
    "date": "2022-02-09",
    "sentence": "",
    "author": "Jonathan Renforth",
    "title": "Local artist strives for Ohio Senate to pass Parkinson’s bill"
  },
  {
    "id": 783,
    "mediaId": 2564,
    "date": "2022-02-22",
    "sentence": "+4\nView gallery\nMandel avoided saying whether he would also compare Capitol rioters to 'thugs' as he did with BLM protesters, instead stating: 'What violates my sensibilities over the past year or two in respect to behavior in that regard that you're describing, is organizations like Black Lives Matter that burned down police stations in places like Minneapolis'\n'I told the story earlier about being at a town hall, the bar and restaurant down the street, where I told folks, \"I'm going to date <span class='selected-term'>Morgan Harper</span>.",
    "author": "Elizabeth Elkind",
    "title": "Chaos at Ohio Senate race debate as Republican Josh Mandel shouts at audience member who said he should be 'put out' for calling BLM 'thugs' and calls his Democratic rival 'like AOC only dumber'"
  },
  {
    "id": 373,
    "mediaId": 2573,
    "date": "2022-02-22",
    "sentence": "An Ohio Senate debate between Republican candidate Josh Mandel and Democrat <span class='selected-term'>Morgan Harper</span> devolved into name-calling and sparring with the audience Monday night, adding the latest explosive moment to the incendiary Ohio Senate race.",
    "author": "Tyler Olson",
    "title": "Mandel-Harper Ohio Senate debate goes off the rails in Cleveland"
  },
  {
    "id": 199,
    "mediaId": 2621,
    "date": "2022-02-22",
    "sentence": "During the debate, Mandel recalled that at a bar and restaurant “down the street where I told folks that I’m going to debate <span class='selected-term'>Morgan Harper</span>.",
    "author": "Jackson Richman",
    "title": "WATCH: Ohio Senate Candidate Totally Snubs Josh Mandel After Wild, Contentious Debate"
  },
  {
    "id": 75,
    "mediaId": 2614,
    "date": "2022-02-23",
    "sentence": "The debate Monday included only Harper and Mandel.”\nThe second Josh Mandel v. <span class='selected-term'>Morgan Harper</span> debate is going completely off the rails pic.twitter.com/DtZJZxmK40\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nThe moderator asked Mandel about a comment calling Black Lives Matter members “thugs.” Then an audience member interrupted with a loud “uhhhhuh.”\n“You ain’t coming in the Black community.",
    "author": "DrewBerquist.com",
    "title": "Ohio Senate Debate Gets Out Of Hand"
  },
  {
    "id": 612,
    "mediaId": 8322,
    "date": "2022-02-23",
    "sentence": "The person who wins the GOP primary is likely to face Rep. Tim Ryan, D-Ohio, in the general election, although he does face a long-shot yet energetic primary opponent in progressive <span class='selected-term'>Morgan Harper</span>.",
    "author": "Tyler Olson",
    "title": "Russia's Ukraine invasion makes waves in Ohio Senate race"
  },
  {
    "id": 590,
    "mediaId": 2572,
    "date": "2022-02-23",
    "sentence": "Mandel, who is in a Republican primary, was debating his potential Democratic challenger, <span class='selected-term'>Morgan Harper</span>, at a Black church in Cleveland.",
    "author": "",
    "title": "Ohio Senate candidate hits back at 'radical leftists,' BLM members who shouted him down during debate"
  },
  {
    "id": 9118,
    "mediaId": 2740,
    "date": "2022-03-30",
    "sentence": "He will face off against progressive candidate and attorney <span class='selected-term'>Morgan Harper</span> and tech executive Traci Johnson in the Democratic primary on May 3.",
    "author": "Orlando Mayorquin",
    "title": "Who is Tim Ryan? What to know about the congressman running for Senate in Ohio"
  }
]