{
  "id": 10421,
  "mediaId": 8363,
  "date": "2022-04-04",
  "headline": "Cat show draws exhibitors from a dozen states, bringing 176 cats",
  "image": "https://www.gannett-cdn.com/presto/2022/04/02/PMAN/e55c692a-126d-4703-83eb-6fc4a1443c97-_DSC2754.JPG?crop=4511,2538,x0,y229&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/04/04/cat-show-draws-exhibitors-dozen-states-bringing-176-cats/7201632001/",
  "mediaOutlet": "mansfieldnewsjournal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zach Tuggle",
  "authorUrl": "https://www.mansfieldnewsjournal.com/staff/4395274002/zach-tuggle/",
  "termIds": [
    0
  ],
  "sentences": [
    "One of the organization's newer breeds is the Bengal, described on its website as being \"richly colored, highly contrasted coat of vivid spots or distinctive marbling,\" with a personality that is \"curious and athletic.\"",
    "The Mid Ohio Cat Fanciers Show was the highlight of the year for some of them, according to Nannette Schindler, of Crestline, who helps organize the event.",
    "Meows echoed Saturday through Fairhaven Hall at the Richland County Fairgrounds as feline aficionados from a dozen states groomed and pampered their cats.",
    "Cats can cost up to $2,500 each\nThe reward for traveling nationwide is more emotional than financial — owners just like to know their cats have done well.",
    "In fact, there are only five other Cat Fancier Association shows in Ohio: one in Medina, one in Bowling Green, one in Canton and two in Cincinnati.",
    "Exhibitors travel the country for shows\nBecause of the distance between the shows, some owners only take their cats to one event every year.",
    "The Cat Fanciers Association recognizes 44 different breeds, almost all of which were represented Saturday in Mansfield.",
    "Mansfield cat show very popular\nThe show in Mansfield is popular among both cat owners and those who like to watch them.",
    "One of her cats, Cari, a Silver Patched Tabby and White, is scheduled to be bred when she goes into heat next month.",
    "\"That being said, you're paying for a well-bred cat that you're likely not to have problems with,\" Schindler said.",
    "Cari will have two litters every year for the next four or five years, unless she has difficulty along the way.",
    "\"It's good for the public, because a lot of people come in wanting to see a specific breed,\" Schindler said.",
    "\"Sometimes you'll have a 6-year old cat that you probably shouldn't be breeding,\" Schindler said.",
    "\"I think this show is an exception, because I think there are more than a couple Bengals here.\"",
    "These people that are running cats for national wins travel all over the United States.\"",
    "\"You spay them or neuter them and you either keep them or place them in pet homes.",
    "\"Now you do have people here that are in the national standings,\" Schindler said.",
    "\"Some people bring two cats, some people bring three, and some only bring one.",
    "This is her first and probably only show because it's hard to run a female.\"",
    "Some of the more common breeds include Maine Coon, Ragdoll and Persian.",
    "\"There's a show in California this weekend that some people went to.",
    "\"Some breeds are better represented than others,\" Schindler said.",
    "Those exhibitors have a show nearly every weekend of the year.",
    "There's at least one bath each week, unless a mess happens.",
    "Each cat is judged based on its individual breed standards.",
    "\"There's usually only a couple at a show,\" Schindler said.",
    "A show cat's price can vary from about $1,000 to $2,500.",
    "\"We don't make any money,\" Schindler said with a laugh.",
    "Before show days, there's some extra grooming involved.",
    "Owners spend several minutes combing each cat ever day.",
    "\"We had 176 cats entered in the show,\" Schindler said.",
    "ztuggle@gannett.com\n419-564-3508\nTwitter: @zachtuggle",
    "\"This show is one of the few in this area,\" she said.",
    "A lot of us place our older cats in good pet homes.\"",
    "\"She's out of a national winner,\" Schindler said.",
    "\"It's few and far between,\" Schindler said.",
    "\"They're a lot of fun,\" Schindler said.",
    "\"This is well-received by the public.\"",
    "\"In fact, we're probably going broke.\"",
    "\"They'll go anywhere,\" Schindler said.",
    "\"It all depends on what people like.\"",
    "\"She did really well as a kitten.",
    "We probably had 80 to 90 people.\"",
    "\"And they're great companions.\""
  ]
}