{
  "id": 11199,
  "mediaId": 2659,
  "date": "2022-03-18",
  "headline": "Mike Gibbons Calls Josh Mandel Unhinged After He Tried To Fight Him At Ohio Debate",
  "image": "https://www.politicususa.com/wp-content/uploads/2022/03/mandel-gibbons.jpg",
  "link": "https://www.politicususa.com/2022/03/18/mike-gibbons-calls-josh-mandel-unhinged-after-he-tried-to-fight-him-at-ohio-debate.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Easley",
  "authorUrl": "",
  "termIds": [
    2684,
    2290,
    1489,
    1126,
    1064,
    6474
  ],
  "sentences": [
    "In a Republican Party that cheered on Donald Trump’s insults, childish behavior, and theatrics, it will be interesting to see how Ohio voters react to Mandel’s outburst during the debate.",
    "Senator, and Ohio voters got a first hand look at just how unprepared Josh Mandel has become and that will be reflected on the ballot on May 3,” stated spokesperson Samantha Cotten.",
    "The Mike Gibbons campaign called Josh Mandel unhinged and unfit after he tried to fight his fellow Republican Senate candidate at an Ohio debate.",
    "The Gibbons campaign said in a statement provided to PoliticusUSA:\n“Josh Mandel is unhinged, unfit, and flailing – because he’s losing.",
    "It was an unhinged moment, as Mandel escalated the debate beyond the usual verbal jousting and toward a physical confrontation.",
    "If Republican voters in Ohio were not impressed by his tough-guy act, it could mean the end of Josh Mandel’s Senate campaign.",
    "We need an adult in the room, and Josh Mandel has proven that he is not capable of being that for Ohioans.",
    "There was almost a fight at the Freedom Works Forum as the two candidates had to be separated.",
    "He doesn’t have the temperament, experience, or fortitude to be a U.S.",
    "He is only a professional at one thing: running for office.",
    "We can’t leave this race to child-like candidates.",
    "He is hellbent on lying because he is failing."
  ]
}