{
  "id": 11280,
  "mediaId": 2659,
  "date": "2022-03-18",
  "headline": "Chaos In Ohio As Fight Nearly Breaks Out Between GOP Senate Candidates",
  "image": "https://www.politicususa.com/wp-content/uploads/2022/03/Gibbons-Mandel.jpg",
  "link": "https://www.politicususa.com/2022/03/18/chaos-in-ohio-as-fight-nearly-breaks-out-between-gop-senate-candidates.html",
  "mediaOutlet": "PoliticusUSA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Easley",
  "authorUrl": "",
  "termIds": [
    3676,
    2290,
    1489,
    1126,
    6474
  ],
  "sentences": [
    "Gibbons responded by telling Mandel that he has no idea what he is talking about because he never worked in the private sector, which are fighting words in the Republican Party because Mandel got in Gibbons’s face and started yelling two tours in Iraq.",
    "“You’re dealing with the wrong guy,” Mandel says to Gibbons before calling him a “pussy.” pic.twitter.com/AbbyQpwXvu\n— Natalie Allison (@natalie_allison) March 18, 2022\nMandel accused Gibbons of buying stock in a Chinese company.",
    "The Senate map has gotten more difficult for Republicans than Mitch McConnell expected, and the last thing he likely wants to see is his top two Republicans in the race ready to throw punches at each other.",
    "Gibbons said, “You don’t know squat.” Gibbons said, “Back off buddy.” Mandel said, “Don’t tell me to back off.” Mandel then threatened Gibbons, “You’re dealing with the wrong guy.",
    "Republicans are getting crazier by the second as the Ohio Senate debate looked more like pro wrestling than two grown men vying to be the Republican nominee.",
    "— Heartland Signal (@HeartlandSignal) March 18, 2022\nAnother clip shows Mandel calling Gibbons a pu**y:\nThis is not an episode of Jerry Springer.",
    "Ohio Republican Senate candidates Mike Gibbons and Josh Mandel had to be separated as the two got in each other’s faces and threatened to fight.",
    "Gibbons has a slim two-point lead of 22%-20% with 25% of the electorate undecided, according to the latest Fox News Poll.",
    "Video:\nMike Gibbons and Josh Mandel get in each other’s faces at tonight’s GOP #OHSen forum hosted by FreedomWorks.",
    "Watch what happens, pu**y.”\nGibbons is leading the Republican Senate field in Ohio, and Mandel is running second.",
    "It’s tonight’s Ohio Republican Senate debate.",
    "You’re dealing with the wrong guy."
  ]
}