{
  "id": 11750,
  "mediaId": 8491,
  "date": "2022-03-22",
  "headline": "Ohio professors analyze Monday night’s GOP Senate Debate",
  "image": "https://www.wkbn.com/wp-content/uploads/sites/48/2022/03/A6F8431C02CC181FB2C573DFBC826273_3.jpg?w=1280",
  "link": "https://www.wkbn.com/news/elections/ohio-professors-analyze-monday-nights-gop-senate-debate/",
  "mediaOutlet": "wkbn.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Nethers",
  "authorUrl": "https://fox8.com/author/davenethersfox8news/",
  "termIds": [
    5557,
    4306,
    2290,
    1625,
    233,
    914,
    6067,
    6474
  ],
  "sentences": [
    "As for whether the candidates did an adequate job of addressing issues that are important to the Ohio residents they seek to represent, the professors say a debate format lends itself more to talking points than detail, although the discussion of gas prices is one issue about which Ohioans are deeply concerned.",
    "The panelists were Professor Paul Sraric, of Youngstown State, a two-time Fullbright scholar and leading statewide and national elections expert as well as Assistant Professor Justin Buchler, of Case Western Reserve University, with expertise in congress, political strategy, parties and elections.",
    "“I think the only way you would look at a debate like this is to look for the overall themes and the overall themes are not in any way surprising because basically what the candidates were doing is giving you the kind of sound bites they expect to be picked up,” said Buchler.",
    "Debates don’t move polls, but you know, people are searching to figure out who these people are and they are not going to watch the debate, but they are going to watch the news tonight and they are going to watch the clips that are out there,” said Sracic.",
    "“JD Vance doubled down on some of his ideas about Ukraine not being in our interest and the border being more important than Ukraine, so I think he did the most to sort of distance himself from the others with that question,” said Professor Sraric.",
    "Nexstar, FOX 8’s parent company, along with The Hill and Emerson College, conducted a poll in advance of Monday’s debate which showed that Gibbons held a lead over the remaining candidates with Mandel not far behind.",
    "“I think the only time a debate has a moment is if somebody screws up so badly that it becomes a major national news story and for the most parts debates don’t matter unless those moments happen,” said Buchler.",
    "“I think the probability is whoever wins this primary is going to go on to become the senator and we do need to know, not just what their position is, I think, but how they think about these issues.",
    "Those would-be the moments like the exchange between Josh Mandel and Mike Gibbons from an earlier debate, which the two of them were given a chance to explain at the start of Monday’s debate.",
    "“No, I don’t think that there was anybody who really stood out because there was really nothing that fundamentally changed the dynamic of the race and that’s normal for debates like this.",
    "CLEVELAND (WJW) – Assessing Monday’s debate, two professors from universities in the cities where it aired joined FOX 8 News for a virtual roundtable discussion immediately afterward.",
    "Are they just talking or do they have a more nuanced sort of developed position that shows more knowledge of military affairs in this case?” he added.",
    "Asked if any of the candidates either gained or lost ground as a result of the debate, both professors agreed it would do little to change anything.",
    "He might have helped himself by not looking bad and wisely when the candidates were going after one another, stepping away from it,” said Buchler.",
    "The professors believe that most of those who watch debates are already very politically engaged and already have some idea of who they support.",
    "The candidates did very little to dig into policy but made certain they aired talking points that they expect to become soundbites.",
    "Asked if there was any winner from the debate, the professors said they did not see one who stood out.",
    "Still, there were some moments that helped several candidates separate themselves from the field.",
    "If there was anybody who won this debate in that he didn’t lose it might have been Mandel.",
    "Asked whether any particular moment stood out from the debate, each said no.",
    "No evidence of debates moving polls,” said Buchler.",
    "How thoughtful they are on a big issue.",
    "“Debates don’t move polls period.",
    "He was fading in this.",
    "They just don’t.",
    "“I agree."
  ]
}