{
  "id": 11990,
  "mediaId": 8288,
  "date": "2022-03-24",
  "headline": "More Than 4,500 Tickets Remain for Cleveland Guardians Home Opener",
  "image": "",
  "link": "https://www.clevescene.com/cleveland/more-than-4500-tickets-remain-for-cleveland-guardians-home-opener/Content?oid=38603236",
  "mediaOutlet": "clevescene.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Vince Grzegorek",
  "authorUrl": "https://www.clevescene.com/author/vince-grzegorek",
  "termIds": [
    0
  ],
  "sentences": [
    "Despite occasioning the home debut of the new franchise name, despite being the first nighttime home opener since 1995, despite a mid-April date instead of a bitter late March one, despite an ongoing buy-one-get one offer for an upper deck ticket to a future game, and despite the addition of career 55 OPS+ backup catcher Luke Maile and his tender hamstring, there remain some 4,700 tickets for the Cleveland Guardians home opener on April 15 against the San Francisco Giants, according to a spot count of available tickets on the Guardians' website conducted by Scene, a process that shouldn't be but was more exhilarating than tracking the organization's offseason trade acquisitions (jfc) or free agency spending, the latter of which amounted to a sum one more often sees as the sale price of a McMansion in Westlake than the financial outlay of a supposed Major League franchise and one-eighth of the amount of personal wealth Matt Dolan, brother of Paul and partial team owner, has so far burned in his quest to win a U.S. Senate seat, the race for which, recently featuring Josh Mandel going peen-to-peen with Mike Gibbons while fake-attempting to fight him and Gibbons days later making his own headlines by saying women were \"probably oppressed\" when they didn't have the right to vote, has been a rodeo of Trump-fawning clowns in a contest to see who can most deeply debase their reputation and souls, is one of the few things more embarrassing than the Cleveland Guardians' commitment to winning meaningful baseball games and retaining a fanbase being shrunk on both sides by a league that can't help but itself from actively hurting the popularity of the game and a local ownership family who acts like at any given time there's nothing better to do in town, let alone across the plaza, where one of the NBA's most interesting and exciting franchises play with a roster built on the idea that winning basketball games is not only fun but a good financial investment.",
    "And we believe everyone deserves access to accurate independent coverage of their community and state.",
    "Tickets for the April 15th home opener remain on sale, and likely will remain so for awhile.",
    "Help us keep this coverage going with a one-time donation or an ongoing membership pledge.",
    "Join the Cleveland Scene Press Club\nLocal journalism is information.",
    "Information is power."
  ]
}