{
  "id": 12238,
  "mediaId": 8494,
  "date": "2022-03-22",
  "headline": "Morning Headlines: Ohio Marine among four killed in NATO exercise crash; State unemployment rate drops to pre-pandemic low",
  "image": "https://npr.brightspotcdn.com/dims4/default/47a5298/2147483647/strip/true/crop/5616x2948+0+105/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fcb%2Fa7%2F382c00f8441db6d865d606a1114c%2Fshutterstock-1683072580.jpg",
  "link": "https://www.wksu.org/2022-03-22/morning-headlines-ohio-marine-among-four-killed-in-nato-exercise-crash-state-unemployment-rate-drops-to-pre-pandemic-low",
  "mediaOutlet": "wksu.org",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Rabinowitz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Here are your morning headlines for Tuesday, March 22:\nOhio Marine among four killed in NATO exercise crash\nOhio unemployment rate drops to pre-pandemic low\nOhio Redistricting Commission makes more procedural moves as deadline looms\nFight at Ohio GOP Senate debate elevates military issue\nMacKenzie Scott donates $6.8M to NEO Boys & Girls Clubs\nCollege of Wooster relaxes its mask policy\nLorain County will use federal funds to create a crisis center\nCleveland council approves mayor’s budget\nFormer longtime Cuyahoga sheriff dies\nCleveland zoo announces expansion\nCleveland council signs off on West Side Market changes\nGas prices dip\nOhio Marine among four killed in NATO exercise crash\n(AP) — A Cambridge, Ohio Marine was among four who died when their aircraft crashed Friday night in a Norwegian town during a NATO exercise.",
    "The Nord Center and the Mental Health, Addiction and Recovery Services Board of Lorain County will partner with other community groups to create the center, which officials hope will reduce crowding in emergency rooms and decrease the use of law enforcement personnel for crisis management.",
    "Lorain County will use federal funds to create a crisis center\n(Ideastream Public Media) -- The federal government has awarded $1.5 million to Lorain County to create a treatment center for people suffering from a behavioral health or substance use disorder crisis.",
    "Ohio Redistricting Commission makes more procedural moves as deadline looms\n(Statehouse News Bureau) -- The Ohio Redistricting Commission is slowly rolling into a new mapmaking process, but the clock is ticking to get new House and Senate maps to the court.",
    "MacKenzie Scott donates $6.8M to NEO Boys & Girls Clubs\n(WKSU) -- Philanthropist MacKenzie Scott, the ex-wife of Amazon founder Jeff Bezos, made an unrestricted $6.8 million donation to the Boys & Girls Clubs of Northeast Ohio.",
    "The group says the unsolicited gift will allow the organization to double the number of children served and create more afterschool programming, which the organization called a critical need in Northeast Ohio.",
    "Fight at Ohio GOP Senate debate elevates military issue\n(AP) — A near-physical altercation in Ohio's nasty Republican primary for U.S. Senate led some military veterans to demand that one candidate apologize.",
    "Cleveland council signs off on West Side Market changes\n(Ideastream Public Media) -- Cleveland City Council has approved Mayor Justin Bibb’s proposal to allow alcohol sales at the West Side Market.",
    "Two council members who voted against the budget raised concerns about the cost of Bibb’s plan to add about 130 positions, on top of the nearly 700 jobs that were vacant at the end of last year.",
    "It will take a few days for experts from the National Demographics Corporation and the University of Florida to get to Ohio, which concerned Republican commission member and Auditor Keith Faber.",
    "Ohio unemployment rate drops to pre-pandemic low\n(WKSU) -- Two years after lockdowns forced more than 1 million Ohioans out of work, Ohio’s unemployment rate has returned to pre-pandemic levels.",
    "College of Wooster relaxes its mask policy\n(WKSU) -- The College of Wooster continues to update its masking policies, with face coverings now optional in dorms and the rec center.",
    "The $1.8 billion plan leaves a $62 million deficit in the general fund, to be covered with money — largely federal American Rescue Plan Act dollars — carried over from last year.",
    "The commission met Monday evening to discuss hiring outside consultants to join the Republican and Democratic mapmakers already working for the legislative caucuses.",
    "The group's suit says the map approved earlier this month is no different than the one the high court struck down in January as unconstitutionally gerrymandered.",
    "City Senior Strategist Jessica Trivisonno told the council on Monday that it will take time to iron out all the details – like who would hold the liquor license.",
    "Meanwhile, The National Redistricting Action Fund has refiled its lawsuit with the Ohio Supreme Court to challenge the state's congressional redistricting map.",
    "Council also passed a cap on rent increases for vendors, part of a suite of changes aimed at attracting more food sellers to the historic market in Ohio City.",
    "The heated argument came during a debate Friday among five candidates seeking the GOP nomination to replace retiring Republican Sen.",
    "Former longtime Cuyahoga sheriff dies\n(Ideastream Public Media) -- Former longtime Cuyahoga County Sheriff Gerald McFaul has died.",
    "First elected sheriff in 1976, McFaul resigned in 2009 amid reporting by the Plain Dealer on how he mixed politics and his office.",
    "Analysts say part of the current low unemployment rate is because around 200,000 workers have not returned to the labor force.",
    "Cleveland council approves mayor’s budget\n(WKSU) -- Cleveland City Council has approved Mayor Justin Bibb’s first budget.",
    "AAA says the price of crude oil has fallen to around $110 per barrel after peaking shortly after Russia invaded Ukraine.",
    "James Speedy, 30, earned the Navy and Marine Corps Achievement Medal with two gold stars during his 13 years of service.",
    "Cleveland zoo announces expansion\n(WKSU) -- The Cleveland MetroParks Zoo has announced an expansion of its RainForest.",
    "MacKenzie Scott reportedly has a net worth of about $47 billion and has given away approximately 18% of her wealth.",
    "Gibbons, whose son is an active-duty naval pilot, said he honors Mandel's service but stands by his statement.",
    "Recently, Kent State and Cleveland State relaxed mask rules but still require them to be worn in classrooms.",
    "Still, McFaul, a former Cleveland city councilman, was remembered fondly at council's Monday night meeting.",
    "Another council member, Stephanie Howse, said the budget didn’t include enough efforts to prevent violence.",
    "A new, two-story 140,000 square-foot Primate Forest will become a new home for the gorillas and orangutans.",
    "The rate in March 2020 soared above 16% as schools and businesses closed to slow the spread of COVID-19.",
    "The University of Akron also requires masks in classrooms, however, faculty can set their own policies.",
    "The cause of the crash is under investigation, but Norwegian police reported bad weather in the area.",
    "The commission is ordered by the court to approve new state legislative district maps by March 28.",
    "The zoo hasn’t said how much it will cost but says it will be funded by philanthropic donations.",
    "Gibbons told Mandel he didn't know \"squat\" because he'd never worked in the private sector.",
    "Gas prices dip\n(WKSU) -- Gas prices are down four cents across Northeast Ohio this week.",
    "The national average is down 8 cents after hitting a record high of $4.33 on March 11.",
    "Ex-Ohio Treasurer Josh Mandel shouted an attack at investment banker Mike Gibbons.",
    "The long-range plan is still to attract a nonprofit operator of the market.",
    "Masks will then be optional in most other indoor spaces beginning April 4.",
    "Ohio’s jobless rate in January was 4.3%, the lowest since February 2019.",
    "Mandel painted the remark as an affront on his military service.",
    "The average price for a gallon of regular is at $4.04 a gallon.",
    "Construction is expected to begin as early as next year.",
    "He pleaded guilty to theft in office charges in 2010.",
    "The group's previous suit was dismissed on Friday.",
    "Gerald McFaul was 87 years old.",
    "Rob Portman.",
    "Gunnery Sgt."
  ]
}