{
  "id": 12906,
  "mediaId": 8369,
  "date": "2022-03-01",
  "headline": "The Great Wasted Potential of CPAC",
  "image": "https://www.unz.com/wp-content/themes/unzSite/IMAGES/unz_large_logo.png",
  "link": "https://www.unz.com/jtaylor/the-great-wasted-potential-of-cpac/",
  "mediaOutlet": "Michelle Malkin ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jared Taylor",
  "authorUrl": "https://www.unz.com/author/jared-taylor/",
  "termIds": [
    5324,
    5507,
    4905,
    3639,
    3466,
    3246,
    2621,
    242,
    6026,
    6678
  ],
  "sentences": [
    "Wayne LaPierre of the National Rifle Association said, “The right to defend yourself is your most sacred right.” Black Oklahoma State Representative T. W. Shannon called the Republican Party “the party of Abraham Lincoln and Frederick Douglass” but got applause from grateful whites when he said, “America is not the home of systemic racism; it is the home of systemic opportunity.” Another black speaker whose name I don’t remember got a standing ovation for shouting enthusiastically about free markets.",
    "Only the final point, number nine was, “Build the wall and name it after Donald Trump.” This Plan to Rescue America will, of course, “take America back.”\nSen. John Kennedy of Louisiana played country comedian: “America was founded by geniuses and run by idiots.” “I don’t like to talk about the expensive places I’ve been, but this morning I went to the gas station.” “Exercise makes you look better naked.",
    "So does alcohol.” “If the government ever tells you you can’t own a gun, buy two.” “You can’t fix stupid, but by God you can vote it out.” “I believe love is the answer but you ought to own a handgun just in case.” He also got much applause for touting the low unemployment rates for blacks and Hispanics under Trump, and added, “Souls have no color.”\nThere were some points well taken.",
    "They are first hollowed out from inside.” He noted that “the greatest danger we have ever faced is the militant left wing of our country.” He spoke of “the enemy within” who has “seized our culture and county.” “The woke Left controls big tech, media, Hollywood, universities, government, and most corporate boardrooms,” he said.",
    "“They want socialism — one of the oldest, dumbest , most discredited ideas of the century, which is not just wrong but evil.” He did add that open borders could be “the beginning of the end of America — but only if we allow it.” Sen. Scott had a Plan to Rescue America that will make “big changes,” in this order: 1.",
    "Many start with a folksy “Hellooo, CPAC” or “Is this a great meeting or what?” They rev up the crowd with cheap shots: “When we take back the house, Nancy Pelosi is going to have to get on her broom and fly back to California.” “Fidel Castro’s son is now the prime minister of Canada.” The crowd boos happily.",
    "“We have inherited the greatest of all legacies and we must fight for it,” she said, and evoked revolutionary hero Henry Knox, adding that “we must talk about glory and romance.” I was disappointed that she didn’t brag about being one of only two governors who refused to accept Afghan refugees.",
    "We must not let them teach that the US is a racist nation.” But he promised to stand strong: “This is the greatest nation and civilization on earth, and that isn’t going to change under my watch.”\nMatthew Whitaker was acting US Attorney General after President Trump forced out Jeff Sessions.",
    "Ninety percent of people who go to jail come back out “so we have to make them good citizens.” One prosecutor noted that just about everyone in prison has burned through all the family goodwill he ever had, so when he gets out of prison, the only person there to meet him is his drug dealer.",
    "There is surely something to this perspective, but after all this social-worker talk, it was jarring when Mr. Whitaker thanked what he called a panel of “warriors for justice.”\nBlack speakers naturally got a lot of applause, and commentator Candace Owens may have gotten the most.",
    "She blasted CRT but also “surging crime that is disproportionately hurting minority families.” She added, “The Left divides us based on our differences; conservatives unite us around our values.” She got plenty of boos for Prime Minister Trudeau and how he treated the truckers.",
    "The former president had some good lines about “millions of immigrants” who are “bringing crime, drugs, and death to the streets of our cities and communities.” He called for a defense of “Western civilization,” but without mentioning its essential ingredient.",
    "If we are going to defend western civilization, this is the battle ground.” He continued with a non sequitur: “And to win this battle you have to take back the house, the senate and the white house.” He chided Republicans for crying about a stolen election.",
    "All this eventually led up to the point that it should be parents who decide whether children get the vax or wear masks: “Just trust the experts, they tell us, but when it comes to my son, I am the expert.”\nNigel Farage was very loud.",
    "Are you ready for America to retake its position as the leader of the free world?”\nGovernor of South Dakota Kristi Noem had nothing important to say, but she had a quiet dignity that was a relief from so much roaring.",
    "“Traditional methods will not keep us safer,” said one; “We won’t be soft on crime, but we have to be smart on crime.” That means “programs.” Prisons cannot be warehouses for addicts and crazies, who need treatment.",
    "And yet in the very next breath come terrifying warnings that America has fallen into the hands of people who want to destroy it, and that unless Joe Biden is fought with every ounce of our strength, we are doomed.",
    "For example, if someone wanted to know what kind of diversity, I said, “Race, religion, language, that sort of thing.” I didn’t press anyone to explain his answers, even if they were contradictory.",
    "He reminded us that Britain is our closest ally, but warned that “Putin has nothing to fear from the worst president in American history.” The Russians may be nasty but the real threat is China.",
    "It was not widely reported in America, but Donald Trump telephoned one of the top candidates in the French presidential election and spent 45 minutes praising him and telling him to stand firm.",
    "The tragedy is that no one will tell them that the America they think they are taking back is going to be so full of Mexicans and Chinese and Afghans and Somalis that it won’t be worth having.",
    "Big government is asking big tech to silence dissent.” After shamelessly promoting his podcast, he ended on a rousing note: “We are taking this country back from the lunatic socialist left.",
    "This is the classic political con, of course: Evil forces are hard at work, but if you dig deep into your pockets and help keep me in office, you can be the hero who helped save America.",
    "Of the 18 who wouldn’t say, some of them must not like the idea of becoming a minority, so it’s probably safe to say that a majority of whites at CPAC don’t want The Great Replacement.",
    "Every year, the conference polls attendees on what they think are the most important issues, by offering the following choice, reported as percentages (each person could choose three).",
    "Whenever I got tired of taking America back, I went out in the hall, buttonholed people, and did an unscientific poll of three short yes-or-no questions:\nIs diversity good for America?",
    "“They think the soul of America is warped and wicked, but we are proud of our history and our heritage.” He said that if he were to give Joe Biden one word of advice it would be .",
    "They see symptoms but not causes, and as I discovered through my informal CPAC poll described below, they have been neutered psychologically even before the real battle begins.",
    "Mr. Farage did note that “our universities have been turned into madrassas that teach people to be guilty for being white and to bow down to an idol called Black Lives Matter.",
    "Most acted as though they had never thought about that, and it was the one that the largest number either would not answer or refused to say whether it was either good or bad.",
    "He then insisted that under Trump there never would have been mask mandates for children, millions of illegal border crossers, the Afghan collapse, or an invasion of Ukraine.",
    "Josh Mandel, who is running for the Senate in Ohio, promised that “when I am in the Senate I will make decisions with two documents in hand, the Bible and the Constitution.",
    "Let’s go, Brandon!” The crowd is delighted to chant “Let’s go, Brandon.”\nSen. Josh Hawley of Missouri told us the Biden administration is even worse than he expected.",
    "Many of the people on stage denounced our “open Southern border,” but only as part of a list of Biden sins, no different from vax mandates or a flabby foreign policy.",
    "He bragged that Mr. Trump moved the Israel embassy from Tel Aviv to Jerusalem and closed the Chinese consulate in Houston (which was apparently a nest of spies).",
    "“You need a positive message to make sure you have the best and cleanest election system in the world.” At the end, he thundered: “You are the people’s army.",
    "Sen. Hawley got the audience on its feet with: “America is the strongest nation in the history of the world and it’s about time we started acting like it.",
    "It’s my experience that the base of any organization is more “extreme” than the people at the top, but at CPAC, only three people got perfect scores.",
    "One older woman and one young man didn’t want whites to be a minority and didn’t think the races are equal but still thought diversity is a strength.",
    "I kept wondering: If America is so great how can it be mortally threatened by a president — who, as I was told repeatedly — is a senile incompetent?",
    "There were countless declarations of love for America and assertions that it is the greatest nation on earth — not just now but in all of history.",
    "Clearly, America is changing in unnerving ways, and people who care enough to travel to Orlando and spend $290 on a CPAC registration care a lot.",
    "America is the hope of the world.”\nDonald Trump’s Secretary of State Mike Pompeo started folksy, by bragging about how much weight he had lost.",
    "In a spasm of lucidity, Florida Congressman Matt Gaetz said all illegal immigrants should be hunted down like January 6 rioters and deported.",
    "But only seven people — just 16 percent — said that it would be good for whites to become a minority and 20 — 44 percent — said flat-out no.",
    "We should soon find out whether Mr. Trump has the brains and the backbone to pick up a potent political weapon that is lying ready for him.",
    "Julie Kelly, who writes about January 6, was incensed that antifa walk free while people who walked through the Capitol languish in jail.",
    "CPAC was overwhelmingly white and, I would say, about 70 percent male, but there was a nice sprinkling of pleasant-looking young ladies.",
    "He began by complimenting Florida on its Covid policy, which was so much better than the restrictions in Australia and New Zealand.",
    "This is the agony of the white people who built the United States and who — in their bumbling way — think they are taking it back.",
    "“Our forefathers fought for our freedom,” he thundered, the most important of which seems to have been freedom from vax mandates.",
    "There was plenty of brimstone for “the woke Left” but nothing about where it comes from, other than the decline of Christianity.",
    "She had great fun blasting the people who call her a “black white supremacist,” but spent half her time talking about herself.",
    "We must — as I heard over and over — “take our country back,” and the future will be secure only if we all do our parts.",
    "It’s clear that even CPACers have been told so often that diversity is good that they at least think they believe it.",
    "And the crowd cheers just as happily at any extravagant praise for America — so long as it is shouted loudly enough.",
    "Democrats deserve to “have their asses kicked.” We’re not “going to take this crap anymore.” Democrats “suck.” Etc.",
    "For a former secretary of state, he was surprisingly on target: “The greatest threat comes from within our nation.",
    "Mr. Whitaker ran a panel about crime and public safety that, needless to say, never mentioned the color of crime.",
    "The top issue, chosen by 49 percent, was Election Integrity, but a very close second was Immigration/Border Wall.",
    "Donald Trump gave the longest and most eagerly awaited speech, which Gregory Hood has summarized very well here.",
    "Senator Ted Cruz of Texas announced in frenetic CPAC style, that this was a fight between freedom and tyranny.",
    "Many of the people at CPAC, who would be Donald Trump’s most fervent supporters, do not want to be replaced.",
    "No doubt there were con-men at CPAC, as there are at all political meetings, but there was patriotism, too.",
    "A panel explained why the working class hates the Democrats: Because the Democrats hate the working class.",
    "There was a strong vote of thanks for the police, but the local prosecutors on the panel sounded liberal.",
    "That candidate was Eric Zemmour, whose entire campaign is based on stopping The Great Replacement.",
    "“I have never been more certain about who I am.” This is because she has discovered motherhood.",
    "And look at the very bottom: Racial Inequality and Welfare/Poverty are dead last at 1 percent.",
    "It scares them when you refuse to be vaccinated.” Mr. Cruz has a list: “Big government sucks.",
    "Talks last about 15 minutes, and speakers walk on and off the stage to pounding disco music.",
    "Some people were surprised by my questions, but no one screeched or called the authorities.",
    "You never know, but I think I got honest answers; no one seemed nervous or looked furtive.",
    "This is surely a big reason why so many CPACers think border control is crucial important.",
    "Florida Senator Rick Scott started with, “Great nations don’t automatically last forever.",
    "She also said that the feds have 14,000 hours of security video they refuse to hand over.",
    "Of the 45 people I asked, no one refused to talk; most people agreed without hesitation.",
    "“Open American energy production up to full throttle.” That will put Putin in his place.",
    "It wants to “shove critical race theory down our throats.” It left Afghanistan in chaos.",
    "He was one of the few speakers who talked about awful pro-criminal district attorneys.",
    "CPAC is the great annual festival of useless conservatism, and 2022 was like the rest.",
    "Are the members of all racial groups inherently and on average, equal in intelligence?",
    "(here I wondered if he might say something like “Be a white man.” Instead, we got) .",
    "She said the Keystone pipeline and all-out drilling will put Mr. Putin in his place.",
    "Now, please stop and ask yourself how many of the 45 got all three questions right.",
    "That is the first step to another drug bust, and that is what society must stop.",
    "His examples of tyranny: Mask mandates and DOJ investigations of school parents.",
    "Conservatives, as they incessantly call themselves, don’t know what to conserve.",
    "And everyone knows you’re supposed to think blacks are just as smart as whites.",
    "We will end racial politics simply by stopping all collection of race data (!)",
    "First, it sicked the FBI on parents; second it opened up the Southern border.",
    "She told us about nursing her son, and that she knows which cry means what.",
    "Does he know that it takes white people to keep Western civilization going?",
    "The question that most baffled people was about whites becoming a minority.",
    "All school children will have to say the pledge and stand for the anthem.",
    "If America is so great, why will it require colossal efforts to save it?",
    "They look out over this room, and you scare the living crap out of them.",
    "“They [Democrats] believe this nation is systemically racist,” he said.",
    "“Under God, the people rule.” Her America-worship had a different ring.",
    "I could feel it in the audience and sometimes even from the podium.",
    "Ideally, every prisoner should get his own bespoke rehab program.",
    "because “we are all in the image of God” and ignorance is bliss.",
    "In 20 years, whites are projected to be a minority in America.",
    "Nearly half of the people at CPAC clearly think it’s crucial.",
    "I got answers from men and women, young and old, all white.",
    "There was not a single panel or speech on immigration.",
    "Obviously, a perfect score was three confident “No”s.",
    "If people needed more information, I gave it to them.",
    "CPAC is a cross between entertainment and pep rally.",
    "“They want to end the American experiment.” How?",
    "I was surprised by the casually crude language.",
    "Nevertheless, “The powerful are afraid of you.",
    "Speakers do not take questions from the floor.",
    "We will declare socialism a foreign adversary.",
    "Only two asked me who I was, and I told them.",
    "This is not a format designed for thinking.",
    "She told us the South Dakota state motto.",
    "We will stop buying anything from China.",
    "“I have changed and grown,” she said.",
    "“That is backward looking,” he said.",
    "7 yes; 18 don’t know/refuse; 20 no.",
    "35 yes; 3 don’t know/refuse; 7 no.",
    "35 yes; 2 don’t know/refuse; 8 no.",
    "Good for whites to be a minority?",
    "But most of CPAC was predictable.",
    "There are big names at CPAC.",
    "Will that be a good thing?",
    "Here are complete results.",
    "Some were near misses.",
    "Big universities suck.",
    "Big Hollywood sucks.",
    "Are the races equal?",
    "Big business sucks.",
    "Big is our enemy.",
    "Big tech sucks.",
    "Diversity good?",
    "Strange.",
    "4.",
    "3.",
    "2.",
    ".",
    ".",
    ".",
    "."
  ]
}