{
  "id": 13160,
  "mediaId": 8428,
  "date": "2022-03-02",
  "headline": "Josh Mandel swings at election fraud: ‘I believe this election was stolen’",
  "image": "https://www.rsbnetwork.com/wp-content/uploads/2022/03/mandel-e1646231084238.jpeg",
  "link": "https://www.rsbnetwork.com/news/josh-mandel-swings-at-election-fraud-i-believe-this-election-was-stolen/",
  "mediaOutlet": "rsbn.tv",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Summer Lane",
  "authorUrl": "https://www.rsbnetwork.com/author/summer-lane/",
  "termIds": [
    2765,
    2290,
    1480,
    1126,
    973,
    6386,
    6175,
    6729
  ],
  "sentences": [
    "Republican candidate for the U.S. Senate in Ohio, Josh Mandel, pulled no punches during an interview with RSBN’s Brian Glenn at CPAC Friday, boldly stating, “I believe this election was stolen from Donald J. Trump.” He added, “I’m the only candidate in the race for U.S. Senate who’s been calling for an audit in Pennsylvania, Wisconsin, Michigan, Georgia, and everywhere we roam.”\nMandel, who recently completed two terms as Ohio’s treasurer, is also an eight-year veteran of the United States Marine Corps.",
    "He added, “I’m the only candidate in the race that took the time to go out to Maricopa County to see with the whites of my eyes, where [they were] auditing the vote.”\nInterestingly, Mandel also stated that he supported abolishing the Jan. 6 Commission – the highly-partisan committee assigned to “investigating” the media-labeled insurrection at the U.S. Capitol in 2021 – and replacing it with what he called a “Nov.",
    "“I’m running on a platform that is pro-God, pro-gun, pro-Liberty, pro-Trump…and we’re winning.” He also promised to be the “worst nightmare” of the radical left and the “squishy, RINO Republicans” and “never-Trumpers.”\nAdditionally, Mandel emphasized that he is the only candidate in his race who is willing to say that the Democrats stole the 2020 presidential election from President Trump.",
    "According to Mandel’s campaign website, he also has previously served two terms in the Ohio House of Representatives, where he worked as the Ranking Member of the Financial Institutions, Real Estate, and Securities Committee.",
    "3 commission…and that commission will investigate the real cheating.”\nMandel has consistently held a double-digit lead in early polls ahead of the Ohio election.",
    "According to a WPA Intelligence poll shared on Mandel’s campaign website, he has a 28 percent overall advantage over his opponents.",
    "With numbers like that, Mandel is poised to take home a victory and claim another Senate seat for the GOP.",
    "“I’m gonna be the next United States senator from Ohio,” Mandel stated with confidence.",
    "His time in service included two tours in the Middle East."
  ]
}