{
  "id": 25622,
  "mediaId": 2578,
  "date": "2022-02-22",
  "headline": "MANDEL BRINGS THE FIRE: GOP Candidate Josh Mandel SHREDS Vicious Audience Member During Senate Debate in Black Community – Then Destroys Dem Opponent (VIDEO)",
  "image": "https://www.thegatewaypundit.com/wp-content/uploads/1B34F4A8-ADFB-479F-A71D-76FE2E887498.jpeg",
  "link": "https://www.thegatewaypundit.com/2022/02/mandel-brings-fire-gop-candidate-josh-mandel-fires-back-vicious-audience-member-senate-debate-black-community-destroys-dem-opponent-video/",
  "mediaOutlet": "GatewayPundit",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Hoft",
  "authorUrl": "https://www.thegatewaypundit.com/author/jim-hoft/",
  "termIds": [
    14111,
    13197,
    13312,
    13372,
    14243,
    14317
  ],
  "sentences": [
    "His answer entirely revolved around natural gas drilling and the jobs it would bring to Ohio\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nLike a true Democrat, Morgan Harper refused to shake his hand after the debate.",
    "After a debate in which Mandel called Harper dumb and scolded her for being “angry” about a dozen times, Harper refuses to shake his hand pic.twitter.com/yTuvfYDGzm\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022",
    "TRENDING: Muslim Youths Attack Easter Week Processions in Spain -- Pelt Christians with Rocks and Projectiles -- Police Called In (VIDEO)\nJosh Mandel: You mean ‘put him out’ like kill him?",
    "Mandel just directly accused of Harper of absentee voter fraud\n— Tyler Buchanan (@Tylerjoelb) February 22, 2022\nMandel is asked specifically about Black unemployment.",
    "The debate went completely off the rails when black audience members began to insult Mandel for daring to show up in the black community.",
    "Whether they are black or they were white or they were Hispanic or they were Asian, those are my brothers in the Marine Corps.",
    "But to bring that white man in the black community like that… I’m finished… But don’t you suck up to him.",
    "Ohio Republican Senatorial candidate Josh Mandel debated liberal Morgan Harper last night in Cleveland.",
    "Here are several clips from Josh Mandel’s debate with mini-AOC Morgan Harper last night.",
    "It’s not every day you hear a Republican handle an abusive black crowd like that!",
    "Make him answer the question…\nJosh Mandel: Let me tell you something, maam.",
    "Josh Mandel is a US Iraq War veteran and outspoken Trump supporter.",
    "Josh Mandel: I know black men who put their lives in my hands.",
    "Audience member: And here you come in the black community.",
    "So don’t stand there and lecture me about race and color!",
    "He’s in the black community… He called my parents thugs.",
    "I thought this was America where we could debate freely.",
    "The United States Marine Corp in two tours in Iraq.",
    "Harper mostly just stood there on the stage silent.",
    "Female Audience Member: I’m not embarrassing you.",
    "I put my life in the hands of those black guys.",
    "Moderator (losing control): Mr. Mandel!",
    "So don’t stand there and lecture me.",
    "He did not wilt to the insults.",
    "Moderator: Don’t embarrass me.",
    "Those men are my brothers.",
    "Josh Mandel was ON FIRE!",
    "Instead, he fired back!",
    "This was EPIC!",
    "Put him out.",
    "OMG!"
  ]
}