{
  "id": 25663,
  "mediaId": 2537,
  "date": "2022-02-09",
  "headline": "God, family and bitcoin? How cryptocurrency found its way to Ohio's U.S. Senate race",
  "image": "https://www.gannett-cdn.com/presto/2022/01/28/NCOD/a8e54c17-5056-41e7-8f64-0724cd3f6972-AGS_ceb_mandel_harper_debate_028.jpg?crop=4973,2798,x0,y394&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/02/09/ohio-senate-race-why-josh-mandel-touts-bitcoin-cryptocurrency/9257768002/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haley BeMiller",
  "authorUrl": "https://www.dispatch.com/staff/4386977002/haley-bemiller/",
  "termIds": [
    13571,
    13803,
    14140,
    13207,
    14317
  ],
  "sentences": [
    "\"We have this increasingly growing imbalance in society between the people or companies who control these intermediaries, whether they be Big Tech companies or banks, and the people who are relying on them,\" said Patrick Berarducci, an Ohio native who works for a blockchain company in New York.",
    "Haley BeMiller is a reporter for the USA TODAY Network Ohio Bureau, which serves the Columbus Dispatch, Cincinnati Enquirer, Akron Beacon Journal and 18 other affiliated news organizations across Ohio.",
    "Brianna Mack, a professor at Ohio Wesleyan University, said it's refreshing to see politicians discuss a new topic outside the realm of hot-button issues like the pandemic and critical race theory.",
    "A survey in November from Pew Research Center found 16% of U.S. adults have used, traded or invested in cryptocurrency, up from 1% in 2015 who said they used bitcoin specifically.",
    "Luxury car dealer turned blockchain executive Bernie Moreno has bitcoin but said he never discussed it much with voters before dropping out of the U.S. Senate race last week.",
    "\"But I do think it serves a purpose for that kind of Republican to identify as thoroughly as possible with a kind of anti-government, fierce personal independence creed.\"",
    "He believes there's a wealth of misinformation around the topic, including from his former opponents, and said people are concerned with other \"substantive issues.\"",
    "It operates on blockchain technology to record and verify transactions, which allows users to control the process instead of a third-party authority like a bank.",
    "Many Democrats have been hesitant to embrace cryptocurrency, largely because of a process called mining that raises climate concerns over the energy it requires.",
    "Still, it plays into the rhetoric of Mandel and other populist Republicans who cast doubt on government institutions and want to disrupt the current system.",
    "Increasing use of cryptocurrency\nA quick refresher: Cryptocurrency is a digital currency that includes Bitcoin and alternatives like Ethereum and Cardano.",
    "\"I think there’s a lot of frustration that people feel that the traditional financial system hasn’t presented those opportunities for everyone,\" she said.",
    "Campaign spokesman Scott Guthrie said he sold all of his stocks last year and went \"all in\" on cryptocurrency but declined to provide further information.",
    "The person who once oversaw the state's money now wants to abolish the federal reserve and sees cryptocurrency as a way to limit the power of government.",
    "In an interview, Harper said a growing number of Ohioans have reached out to discuss cryptocurrency after she started touting it on the campaign trail.",
    "\"You have trouble believing those are the top three things in an equal proportion,\" said David Niven, a political scientist who worked for former Gov.",
    "Moreno's company was among fewer than 10 Ohio businesses to take advantage of Mandel's cryptocurrency tax payments before the program shuttered.",
    "That hasn't stopped Mandel from drawing attention to it in his bid for U.S. Senate, declaring Ohio must be \"pro-God, pro-family, pro-bitcoin.\"",
    "Taxpayers could put cryptocurrency into a third-party processor that converted it to dollars and deposited the money into state accounts.",
    "\"If you distrust government, if you’re cynical about politicians, then you should be a strong proponent of bitcoin,\" Mandel said.",
    "The use of cryptocurrency spans multiple income levels and was more common among Asian, Hispanic and Black people than white.",
    "Ohio was the first in the nation to implement such a program, making it a \"leader in blockchain technology,\" Mandel boasted.",
    "\"It was more of a, hey, I can use my Starbucks app to get a cup of coffee...you’re not solving any big problems,\" he said.",
    "While interest in cryptocurrency isn't widespread, it does touch multiple demographics within the population using it.",
    "One of Josh Mandel's final edicts as state treasurer was to allow Ohio businesses to pay their taxes with bitcoin.",
    "Mandel's most recent financial disclosure, amended in December, does not list cryptocurrency among his assets.",
    "But cryptocurrency is ultimately too niche at this point to bring voters out in droves, she argued.",
    "\"It’s one of the strongest antidotes we have to power-hungry governments and corrupt politicians.\"",
    "It's most popular among younger men, but 19% of women ages 18 to 29 also reported dabbling in it.",
    "Less than a year later, officials disbanded the payment system because Mandel broke state law.",
    "The popularity of cryptocurrency has since increased, but it remains far from mainstream.",
    "The specific timing and amounts will be noted on Mandel's next disclosure, Guthrie said.",
    "But some, including Ohio's U.S. Senate candidate Morgan Harper, see potential in it.",
    "The issue is unlikely to move the needle significantly with GOP primary voters.",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "\"It doesn’t matter if you went to Harvard or if you didn’t even go to school.",
    "If you get involved in crypto... the protocol doesn’t care who you are.\"",
    "However, no one in Ohio is waving the bitcoin flag more than Mandel.",
    "\"You don’t need to know somebody,\" Berarducci said.",
    "\"I don’t think this is a deal-breaker or issue no.",
    "Is bitcoin a big issue for Ohioans?",
    "1 for Ohio voters,\" she said.",
    "Ted Strickland."
  ]
}