{
  "id": 25689,
  "mediaId": 2745,
  "date": "2022-02-24",
  "headline": "The Trailer: In Texas, safe-seat candidates fight about the best way to be partisan",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/I3HAAEENUAI6ZDO5KIJWTCGSMM.jpg&w=1440",
  "link": "https://www.washingtonpost.com/politics/2022/02/24/trailer-texas-safe-seat-candidates-fight-about-best-way-be-partisan/?utm_source=rss&utm_medium=referral&utm_campaign=wp_politics",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13407,
    13603,
    14013,
    13230,
    13312,
    13352,
    14222,
    14350
  ],
  "sentences": [
    "Paxton argued that they did, “by definition,” writing that gender reassignment surgery meant “altering key physical body parts” to make “the entire reproductive system of the child physically incapable of functioning.”\nOn Tuesday, Abbott released his own guidance to the state’s Department of Family and Protective Services, citing Paxton, and asking the state to, among other things, “investigate the parents of a child who is subjected to these abusive gender-transitioning procedures.”\nSocial conservatives celebrated the move, which came after legislation to ban the procedures outright stalled — which Abbott’s opponents in the March 1 primary, among others, blamed on the governor.",
    "You belong right here in Texas, and I'll fight for you to live freely as yourself and free from discrimination.”\nHe repeated that on Twitter, sharing a video of a campaign interaction between himself and a “nonbinary youth” who wanted to defend “my parents’ rights to put me on testosterone.” Every Democratic response to Abbott and Paxton echoed those themes — that Republicans had put children at risk in the name of protecting them.",
    "“He wants to say that progressive leaders trying to be responsive to the community, and trying to reform police, own the blame, because it's who happens to be running against him.”\nThe race for Austin's 35th Congressional District has thrilled the Democratic Party's left, which rallied early behind Casar and sent reinforcements to campaign for him, including Rep. Alexandria Ocasio-Cortez (D-N.Y.), Sen. Elizabeth Warren (D-Mass.)",
    "Representative Cori Bush, as a first-term member of Congress, went and slept out on the Capitol steps and pushed the president to extend the eviction moratorium, keeping thousands of Americans in their homes.”\nUntil this year, a Republican-drawn map limited Austin's representation in Congress, creating one safely Democratic seat and adding other parts of the city and suburbs to safe Republican districts.",
    "It's a witch hunt to attack all Trump supporters as criminals.”\nLuttrell didn't mask his contempt for that argument — especially after Collins, who had not served in the military, called Kinzinger a “traitor.” At the forum, Luttrell said that Kinzinger had “put his life on the line,” and said he was trying to run his race “the right way,” only to be faced with an opponent who'd say anything.",
    "The 17th Congressional District outside of Pittsburgh, which Rep. Conor Lamb (D-Pa.) is vacating to run for Senate, remains competitive but would have gone slightly more decisively for Joe Biden in 2020; state Rep. Summer Lee (D), who's running for the safe 12th Congressional District that covers most of the city, pointed out Wednesday that the new lines place her home in the 17th, instead.",
    "I mean, that guy's going to sit down there and bag on me, and he has actually done nothing in his life except for what somebody has told him to do.”\nAt rallies last weekend, with Luttrell bringing out endorser after endorser to drive out the early vote, it was hard to find a policy dispute between them — or even disagreement that the 2020 election had been rigged against Donald Trump.",
    "“Texas mainstay Cuellar faces threats from federal probe, progressive challenger and a changing Laredo,” by Arelis R. Hernández and Marianna Sotomayor\nJudges in North Carolina and Pennsylvania approved new congressional maps that created competitive seats in each state, dealing a blow to Republican legislators who’d proposed maps that packed Democrats into a few deep blue districts.",
    "In the 8th Congressional District, which was transformed from a competitive seat outside Houston to one that Democrats can't win, the result has been a fight over loyalty to Donald Trump — less about who will vote the right way than who will stand up to liberals, say that the 2020 election was rigged and utterly reject working with Trump's critics inside the GOP.",
    "He and Rebecca Viagrán, a former San Antonio city council member who has lagged in polls and fundraising, argue that Casar has been leading the way on projects that often backfired on Democrats — including the camping measure, which voters overturned in a 2021 referendum, and the police budget cuts, which survived a separate referendum.",
    "In paid media, Casar was focusing not on the policing or homeless measures that brought the most national attention to Austin, but on locked-in gains — a higher minimum wage for city employees, and the preservation of a Planned Parenthood clinic in the city after the Republican legislature passed strict new abortion laws.",
    "Crenshaw had angered the MAGA movement by criticizing the “Stop the Steal” campaign in 2020 and opposing an election audit in 2021, and Luttrell had also taken a contribution from fellow veteran Rep. Adam Kinzinger (R-Ill.), one of two Republicans serving on the committee investigating the Jan. 6 assault on the Capitol.",
    "From a church in The Woodlands, Rep. Madison Cawthorn (R-N.C.) referred to Luttrell as a man who wouldn't “apologize for someone who's prosecuting and persecuting your fellow Americans unjustly.” At a rally in Conroe, Perry expressed his disbelief that anyone could think Luttrell would go soft in Washington.",
    "Greg Casar for Congress, “We Need Greg in Congress.” The latest digital ad from the Texas congressional candidate focuses on his rally with Rep. Alexandria Ocasio-Cortez (D-N.Y.), “fighting for reproductive justice,” raising the minimum wage for city workers and passing an affordable housing measure.",
    "“If you look at the party platform, it’s all about how parents have the absolute right to make all decisions for their kids, both on schooling and medical care — except when they don’t want you to,” Annise Parker, the first openly gay mayor of Houston and the president of the LGBTQ Victory Fund.",
    "Four times in my life, my neighbors have had a vote to decide on whether I deserved civil rights.”\nThe theme of this year's Conservative Political Action Conference is “awake, not woke.” The reference isn't just to cultural fixations of the left, or what used to be called political correctness.",
    "Greg Abbott (R) announced that gender-affirming care for children would be treated like “child abuse.”\nLast Friday, Paxton’s office published a response to a Republican legislator who’d asked whether “certain medical procedures performed on children” fit the state’s definition of abuse.",
    "“We allowed Barack Obama and Eric Holder to outmaneuver the Republican committees in those states and the RNC,” said former New Jersey governor Chris Christie in a call with reporters, denouncing the unfavorable court decisions as a leader of the National Republican Redistricting Trust.",
    "Republicans might benefit from the new lines, but the state lost one seat in redistricting, and the new map takes care of that by pushing two GOP members of Congress, Rep. Dan Meuser and Rep. Frederick B. Keller, into the new and blood-red 9th Congressional District.",
    "Schlapp talked to The Trailer just hours before Russia's invasion of Ukraine, and the responses on CPAC's first day ran the gamut — from condemnation of Putin's action to theories that Hunter Biden's business dealings in Ukraine were a cause of the invasion.",
    "Rodriguez, whose polling found homelessness to be the top issue for primary voters, talked about it as the issue that revealed the downsides of charismatic politics, and of liberals doing what their base was asking for without thinking of how it might work.",
    "I mean, you can't plan for that, right?”\nCasar was en route to becoming a national figure before he ran for Congress, and before any of the more politically explosive measures that, according to his opponents, make him a risky choice as the voice of Austin.",
    "Across Texas, as early voting wraps up ahead of March 1 primaries, Texas's open-seat races have been fought less over ideology, but effectiveness — and whether it's a waste of a safe seat to elect someone who won't make as much news or pick as many fights.",
    "None of those 2020 candidates ended up winning their races, and most of the 96 candidates tracked by Parker's group were in uphill fights; most were in seats not expected to be competitive in November, and safe either for Republican or Democratic nominees.",
    "The rest of northeast Pennsylvania got a competitive makeover: Donald Trump carried the new 8th Congressional District in Scranton, and the new 7th Congressional District in Allentown, but Democrats currently hold both and got reelected narrowly in 2020.",
    "It's directed entirely at the media, which he blames for both Joe Biden's election and for violence in the streets last year and in 2020; the name of the Milwaukee Journal-Sentinel floats to the front of the screen as he condemns the mainstream press.",
    "That's going to shake up the plans Republicans had been making for the redder map; the district that Rep. Madison Cawthorn (R-N.C.) had already announced a campaign for, a safe seat that covered parts of exurban Charlotte, doesn't exist on this map.",
    "They feel like the use of ground troops and the use of our military should be a last recourse, but if we continue to project weakness to these tyrants, you know, they fear that they're going to be the first recourse, or the constant recourse.",
    "I think that name speaks for itself,” Collins said at a forum this month with Luttrell, moderated by former “60 Minutes” correspondent Lara Logan, who repeatedly asked candidates how they would avoid being “crushed” by the establishment.",
    "I just think it's an election about whether or not we still believe in what America stands for, or for the left's vision of America.”\nCPAC kicked off today and will run through Sunday, and its main-stage speakers reflect the new agenda.",
    "Like, really kill him.”\nIn Austin, Casar has defended his record, but argued that voters should consider what he's actually gotten through, as well as considering the causes he's been willing to take on when other Democrats wouldn't.",
    "But it maintains the 1st Congressional District, the one Republicans had diluted, and keeps a 6th Congressional District that Rep. Kathy E. Manning (D-N.C.), a Democrat elected in 2020, can win; the Republican map had drawn her out.",
    "), Christian Collins, entered the race and began warning that the 6'4'' veteran was actually a pawn of the party establishment, one who wouldn't represent deep red Montgomery County and the rest of the conservatives in the district.",
    "And I think when you see these polls coming out that show Hispanics separating 50-50 between Republican and Democrat in a couple of different polls, when you see African Americans being open to vote Republican in the generic ballot.",
    "Last week, before a rally with Ocasio-Cortez, he said that the high-profile members of the “Squad,” who'd combined their Capitol Hill work with activism that worried party leaders, had figured out the model he'd follow in Congress.",
    "In North Carolina, they obliterated a map that created three safe Democratic seats around Charlotte and the Research Triangle, and added Republican precincts to a majority-Black district that had been trending toward the GOP.",
    "“I was doing civil rights and immigrants' rights work before I ran for office,” said Casar, who organized a wage-hike campaign for campus workers at the University of Virginia before he returned to Austin and ran for office.",
    "And I don't think there's a lot of Black voters and Hispanic voters who are into this idea, that I'm going to send my kid to a school and they're going to be told immediately at a tender age to question their gender.",
    "He plugged in to Local Progress, a network of left-wing municipal politicians, and was celebrated in 2018 after he got the city council to approve an inventive paid sick leave mandate for private businesses.",
    "It’s because they know they’re being targeted.”\nAs Abbott was making his announcement, the LGBTQ Victory Fund was releasing a report, “Queering Congress,” on how many LGBTQ candidates were running in 2022.",
    "Republicans are going to be campaigning on that.”\nCasar sees it differently, insisting that passing ambitious left-wing ideas in Austin, even when they were blocked or reversed, built momentum for change.",
    "Greg Casar, 32, was trying to win after serving on the city council, where he'd championed a measure to legalize camping in many public places and another to cut the police department's budget by a third.",
    "In Canada, they have similar dictatorial policies, and in America, we got very close to that with the government telling us the church couldn't open its doors and you can't go anywhere without a vaccine.",
    "The 1st Congressional District, which covers competitive Bucks County, remained intact and evenly divided; Rep. Brian Fitzpatrick (R-Pa.), who ran far ahead of Trump to win in 2020, is running again.",
    "Josh Mandel, “Marine.” The Republican U.S. Senate candidate went on the air with positive ads about his upbringing and Jewish roots, then went off the air as rival candidates pounded each other.",
    "They’re the 12th Congressional District in Charlotte, where Rep. Alma Adams (D-N.C.) is running; the 2nd Congressional District in Raleigh; and the 4th Congressional District that covers Durham.",
    "Ron Johnson for Senate, “Media Advocates.” The Wisconsin Republican has no real opposition in this year's U.S. Senate primary, but his message here is aimed at GOP voters more than anyone else.",
    "It won't like the plan, “but you will.”\nThe conservative backlash to transgender rights is shaping the final days of Texas’s Republican primaries, after Attorney General Ken Paxton (R) and Gov.",
    "And then, when voters who don't always line up with Republicans find out the insanity that's happening, all of a sudden, it explodes, and then Republicans are more comfortable talking about it.",
    "Rick Scott, “How About You.” The Florida senator released an 11-point policy plan this week, on his own — not as a prescription for the National Republican Senatorial Committee, which he runs.",
    "While we're watching how candidates and campaigns adjust to Russia's invasion of Ukraine, The Washington Post has full-scale coverage, from the ground and from Washington, to follow right now.",
    "TT: There were campaigns to punish Dave Chappelle and Joe Rogan over things they did and said that overlap with what we're talking about here: trans rights, resisting the coronavirus vaccine.",
    "“He doesn't want to point and blame the civil rights leaders and the tens of thousands of Austinites that poured out on the streets last summer, demanding change,” Casar said of Rodriguez.",
    "This, like his first spots, is a world away from the invective that Mandel hurls at liberals on Twitter, and the dismissiveness he's shown Democrat Morgan Harper in two debates with her.",
    "In the campaign's final pre-primary fundraising reports, Casar had raised more than $743,000 to Rodriguez's $420,000, and the councilman had nearly five times as much left to spend.",
    "The distinction is made even clearer in this spot, paid for by his active U.S. Senate campaign, and describing criticism of the plan as a fight between him and official Washington.",
    "“And while it occasionally works out for progressives — I'm thinking of the Irish marriage vote, for example — in general, when you put civil rights on the ballot, it is a mistake.",
    "MS: I live in Virginia, so you might say that we witnessed firsthand this overwhelming response from purple and blue America that was like: Hey, maybe not everything is racist.",
    "From 2020 to 2022, the number of trans candidates had doubled from five to 10; the number who identified as either transgender or nonbinary had risen to 17, up from 10 in 2020.",
    "Instead, a few miles apart, the candidates and their supporters argued about toughness, and what sort of character it would take to go on constant offense to save the country.",
    "“Then I got a call from the mayor and other members of council to say: ‘No, we did not defund police.’ They say what they actually did, like not fund a cadet class or two.",
    "The former governor and other Republicans had courted Luttrell for years, with Perry putting him to work when he ran the Energy Department, and Rep. Dan Crenshaw (R-Tex.",
    "“You have really good progressive Democrats that went to the ballot box and voted to overturn that ordinance,” Rodriguez said, referring to the ban on legalized camping.",
    "Rodriguez went on the air first, but Casar built broad support with liberal groups, from labor unions to the Sunrise Movement, that he'd championed in Austin for years.",
    "It's a nice bumper sticker.”\nRodriguez, 50, was running for a new House seat in Austin, one that Republicans had drawn to elect whatever Democrat could win the primary.",
    "Multiple panels and speakers will talk about challenging “big tech.” And for old time's sake, there will be a discussion of whether Hillary Clinton should be in jail.",
    "I've gotten a lot of heat on Twitter and social media because people are saying: How dare you have someone who disagrees with us on basic issues speak on that stage!",
    "It started with “You can't have a conference, because that is hateful,” and now you can't leave your house until the government tells you you can leave your house.",
    "I also think that they fear men and women in the United States military service becoming the victims of Joe Biden's projection of weakness and confusion abroad.",
    "The court’s preferred map also channeled growth in the Charlotte metro area into the new 14th Congressional District, which went for solidly Joe Biden in 2020.",
    "During Donald Trump's presidency, Republicans lost significant ground in those suburbs, and did worse than ever in the city, putting multiple seats at risk.",
    "Correction: A previous version of this article misstated congressional candidate Greg Casar's role passing a measure that dealt with homelessness in Austin.",
    "Most of that was undone by the state's new map, which gave Austin the 35th and 37th districts, setting up victory for whoever wins the Democratic primary.",
    "TT: Right, CPAC has been building ties to the new conservative movements in other countries for years; Nigel Farage started coming before the Brexit vote.",
    "TT: Gabbard has been outspoken against the U.S. intervening in the Ukraine crisis, and argued that Russia is responding to the threat of NATO expansion.",
    "TT: You have also have Brazil's Eduardo Bolsonaro speaking, and you have a CPAC planned for Budapest in Europe this year …\nMS: And we have CPAC Mexico.",
    "In this edition: Base battles in Texas House races, new swing state maps that Republicans aren't happy about, and an interview with CPAC's ringmaster.",
    "But it could exist one day: Republicans are focusing on winning the Supreme Court this year as they consider drawing new maps for the 2024 election.",
    "All five of the suburban Philadelphia districts that Democrats held after the 2018 elections remain either safely Democratic or heavily Democratic.",
    "It wakes everybody up in these communities who have faced the tyranny of government when they look at Australia and see the restrictions on people.",
    "But they got lost in the “defund” rhetoric, right before the 2020 election, when Rodriguez's Democratic caucus was trying to flip the Texas House.",
    "And in the process, they're starting to lose people of different races who are saying: Well, believing that people are born male and female.",
    "Activists and operatives working to recall liberal school boards and root out “critical race theory” got early, high-profile speaking slots.",
    "In a statement to The Trailer, Democratic gubernatorial candidate Beto O’Rourke addressed “every trans kid in Texas”: “I’m proud of you.",
    "TT: We've heard social conservatives talk about this for years, but until last year it wasn't front and center in Republican campaigns.",
    "I think this is one of the reasons why Republicans have lost on these cultural questions so regularly: They don't want to address them.",
    "That's been true in Austin, where Casar charged into the lead and, according to campaign polling by outside groups, hasn't given it up.",
    "Viagrán told HuffPost that Casar inflicted “long-term damage to the Democratic Party in Texas,” which was how Rodriguez saw it, too.",
    "We have our standard lines and we stick to them, and I just think that's a that's a terrible strategy for you improving the culture.",
    "He pointed at a nearby library that, he said, had been unusable for locals for a while, when tents were set up in its parking lot.",
    "Matt Schlapp, the chairman of the American Conservative Union, sees “wokeness” as the linchpin of Republican success this year.",
    "announced his retirement, retired Navy SEAL Morgan Luttrell entered the race, with the support of former governor Rick Perry.",
    "They've got to be convinced that military action is necessary, and Biden reading off cue cards ain't going to make it happen.",
    "We had a CPAC Australia and they tried to make it illegal for my plane to land, because they said I was a messenger of hate.",
    "“We can’t take for granted these Supreme Court elections and what impact they can have on the maps.”\nWhat did the courts do?",
    "“The Sunrise Movement, I was working with them on transitioning our public utility away from fossil fuel, to clean energy.",
    "“Congresswoman Ocasio-Cortez has created the opportunity, I believe, for the president to cancel student debt,” he said.",
    "I said, well, I guess that's great, but that doesn't matter, because you have Greg Casar saying you defunded the police.",
    "Ideas he liked, such as giving 911 callers the option to reach mental health officials, had been implemented by Casar.",
    "The new map, with simpler lines, still includes three seats that are functionally impossible for Democrats to lose.",
    "My view is that the people who come to CPAC are not completely closed to the idea of using American military might.",
    "Rodriguez wasn't impressed, because the paid leave measure was struck down by Texas's conservative Supreme Court.",
    "Republican leaders in the House and Senate won't be there, but the movement's biggest draws will be: Florida Gov.",
    "Pennsylvania's new map created even more competitive seats — two now held by Democrats, and one by a Republican.",
    "I just err on the side of letting people talk, especially if it's interesting, even if we disagree with them.",
    "“I spent my life intimidating other people, like that empty suit, at the at the end of the row, right there.",
    "I don't go to the nation's capital because I refuse to show anybody a paper about anything about my health.",
    "What's uniting the conservatives at CPAC with these nationalist conservative movements in other countries?",
    "MS: We were interested in having the congresswoman come, and she was intrigued with the idea of coming.",
    "“We're sending a message to Washington, D.C., that's going to shake the gates of hell,” Perry said.",
    "If you have pro-Constitution views and traditional ideas, will they use their power to destroy you?",
    "You worked for the Bush White House; that wasn't how Republicans talked about Russia 15 years ago.",
    "“The response can't be to just throw up our hands and give up,” he said of the paid-leave measure.",
    "Roy Cooper has no redistricting powers, making the court the only avenue for his party's appeals.)",
    "She'll continue to run in the 12th district, and won the support of Rep. Ayanna Pressley (D-Mass.)",
    "“She has really used her voice as a younger member of Congress to totally shift the conversation.",
    "So then we expanded to Australia, and then we expanded to Brazil, and then we expanded to Korea.",
    "Look, I would love to tell you that my team had some amazing plans to do these events overseas.",
    "I won't go to a restaurant, I won't go anywhere, and I live right outside of D.C., in Virginia.",
    "In exchange, GOP lawmakers shored up Republican seats elsewhere, locking them in for the party.",
    "Send in the Marine,” Mandel says, after a short recap of his service in Iraq and Afghanistan.",
    "I mean, even his use of sanctions seems bizarre and weak, and I think that frustrates people.",
    "“In my opinion, a lot of Republicans are missing what this election is about,” Schlapp said.",
    "“Nothing really came of that other than some people hardening their hearts on the homeless.",
    "Some people say, “Well, he was at the end of his career, not the beginning.” You know what?",
    "MS: You could still be canceled as the CEO of a Fortune 500 company for almost any reason.",
    "MS: It'd be interesting to see what people say about on these questions in the straw poll.",
    "It started with the with Japanese Conservative Union and that turned into a Japanese CPAC.",
    "MS: Well, I drop my kids off at school and beyond that, I don't go to any events in D.C.",
    "Casar did not support banning camping in many public places; he supported legalizing it.",
    "The truth is, like much of the success you have in life, it just kind of came together.",
    "But Luttrell's entry didn't clear the field, and a former aide to Sen. Ted Cruz (R-Tex.",
    "We usually start the newsletter with a lighthearted joke, but that doesn't work today.",
    "He's taken a lot of money, $5,000, from Adam Kinzinger, and he asked for that money.",
    "But I couldn't resist the idea of setting off that bomb within the leftist movement.",
    "He called me and basically said that if he comes, he will never have an NBA career.",
    "Look, what's happening to anybody because they belonged to the Trump Organization.",
    "We'll have a lot more on this from CPAC all weekend, and more in the next Trailer.",
    "), who had urged veterans like himself to run, casting him in viral campaign ads.",
    "Luttrell, Collins said, had revealed that he wouldn't be reliable in Washington.",
    "MS: A lot of Republicans aren't comfortable talking about these kinds of issues.",
    "We're located right outside of Washington, D.C., so we can get there in a hurry.",
    "There's one state senator in Arizona demanding that we rescind the invitation.",
    "They saw this get tried, and it was a disaster.”\nWho wants “skin in the game”?",
    "Now we're looking at something like 25 countries asking us to do it for them.",
    "We invited Enes Kanter Freedom to CPAC, and he lost his contract in 72 hours.",
    "AUSTIN — “They decriminalized homelessness,” said state Rep. Eddie Rodriguez.",
    "But they want to understand what the American interest is before we do that.",
    "We should probably just go to Florida, and we're considering it seriously.",
    "(Holder, Obama's attorney general, led a Democratic redistricting effort.)",
    "Conservatives aren't new to the culture wars, so what's changed this year?",
    "MS: The stage is a circle this year, so I'm feeling pretty good about it.",
    "Eduardo Verástegui, the actor, announced that, and he's going to be here.",
    "Is there such a thing as human rights, God-given human rights, in Canada?",
    "The number was 96, a record, as the year's first primaries got underway.",
    "“Greg Casar was, of course, the first one on Twitter saying, 'We did it!",
    "So why are we paying the taxes and going through all the inconvenience?",
    "We already had kind of that network built to make change in the state.",
    "“When you make great progress, there's often a backlash,” Parker said.",
    "But half the time, the capital is covered by barricades and fencing.",
    "Trump turned that mind-set into an ‘America First’ foreign policy.",
    "“I will continue to ask questions and uncover the truth,” he says.",
    "“They think they're going to run against socialized medicine.",
    "The Trailer: Can you expand on what “awake, not woke” means?",
    "Watching their heads explode, on Twitter — it was enjoyable.",
    "And then once Japan did it, other countries wanted to do it.",
    "Maybe there are differences of opinion that aren't racist.",
    "We're not very entrepreneurial when it comes to politics.",
    "TT: How did the Tulsi Gabbard invitation come together?",
    "She's going to talk about what she wants to talk about.",
    "Ron DeSantis, Sen. Ted Cruz of Texas and Donald Trump.",
    "“We have to have leadership upfront saying: Follow me.",
    "MS: I'll be having a Scotch with Nigel Farage tonight.",
    "They're going to run against a weak foreign policy.",
    "'” Rodriguez said of the 2020 police funding vote.",
    "Don't let anybody intimidate you,” Luttrell said.",
    "What's the conservative movement's thinking here?",
    "It's making CPAC wonder why we're located there.",
    "Pro sports is doing the same now with athletes.",
    "They're going to run against deficit spending.",
    "I haven't coached her what to say or not say.",
    "It wasn't with a plan of running to Congress.",
    "It's a great idea, especially at this moment.",
    "What message did that send to conservatives?",
    "They wanted to make everything about racism.",
    "Adam Kinzinger has driven the J6 committee.",
    "I guess they don't believe in that anymore.",
    "And he didn't think much of the criticism.",
    "TT: You haven't been to D.C. in how long?",
    "“This guy has had people try to kill him!",
    "Why are so many trans candidates running?",
    "They're going to run against inflation.",
    "It didn't matter that he returned it.",
    "The end of a career is also a career.",
    "Look at what's happening to the NRA.",
    "I live outside the nation's capital.",
    "I haven't asked her for her remarks.",
    "They don't want to learn about them.",
    "(In North Carolina, Democratic Gov.",
    "Those issues are really important.",
    "We're very fearful that they will.",
    "and Rep. Pramila Jayapal (D-Wash).",
    "I hadn't been called that before.",
    "They don't want to talk about it.",
    "“He's endorsed by Adam Kinzinger.",
    "“He's endorsed by Dan Crenshaw.",
    "After Rep. Kevin Brady (R-Tex.)",
    "The article has been corrected.",
    "“I'm not sure what that means.",
    "Not a lot of 2022 Republicans.",
    "I think that's a huge mistake.",
    "You're allowed to have that.",
    "And I honestly never will.",
    "We've defunded the police!",
    "It didn't start that way.",
    "“It’s complete hypocrisy.",
    "Your career can be ended.",
    "Don't be scared anymore.",
    "They kept their jobs.",
    "That's pretty stark.",
    "“You want a fighter?",
    "That's not racist.",
    "That's biology.",
    "And guess what?",
    "on Wednesday.",
    "Why is that?",
    "I got it."
  ]
}