{
  "id": 25715,
  "mediaId": 2590,
  "date": "2022-02-27",
  "headline": "Conservatives Are Warming To The Idea Of A Post-Trump GOP",
  "image": "https://img.huffingtonpost.com/asset/621bc5532400008b1496b7f8.jpeg?cache=sFIR1bzJOR&ops=1778_1000",
  "link": "https://www.huffpost.com/entry/trump-desantis-cpac_n_621a82f9e4b0afc668c1497b",
  "mediaOutlet": "Huffington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Liz Skalka",
  "authorUrl": "",
  "termIds": [
    13592,
    13764,
    14006,
    14054,
    14080,
    13312,
    13315,
    14260,
    14321
  ],
  "sentences": [
    "David Duffey, a 57-year-old who runs a side gig making MAGA merch and said he attended the Jan. 6, 2021, rally that preceded the deadly U.S. Capitol riot, wore a flag draped as a cape emblazoned with “DESANTISLAND.” He said he wants Trump “right now” for 2024, and maybe DeSantis in the future.",
    "John Madison, a 30-year-old delivery truck driver from Pittsburgh said he wants someone like Trump but more polished and experienced — even though the thing that Republicans liked about Trump, that he was an “outsider” and new to politics, can’t be said for him anymore.",
    "They emphasized the same points when it came to 2024: that Trump did great things for the country but it’s time to move on and that Trump could squander whatever gains the GOP makes in the midterm elections by being too polarizing and driving Democrats to the polls.",
    "In conversation after conversation with attendees at the Conservative Political Action Conference in Florida this week, hardcore conservatives who still worship the former president began to signal something new: They may not want him to run again in 2024.",
    "“And they’re not doing that because of Trump’s indecision about whether or not he’s going to run.”\nAnuzis said it’s not necessarily dislike for Trump that’s motivating the conservative base to look beyond him for their next presidential nominee.",
    "At CPAC, a Republican who worked on Trump’s campaign snickered at the suggestion of DeSantis overtaking Trump, bringing up how DeSantis resigned from Congress in 2018 under the cloud of an ethics investigation before becoming Florida’s governor.",
    "But I’ve talked to a lot of people — they couldn’t get behind Trump, but they could get behind DeSantis.”\nAdvertisement\nAnother woman attending CPAC with her teenage daughter said DeSantis is essentially a more likable version of Trump.",
    "“But ... ”\nDressed in matching “Let’s Go Brandon” T-shirt and sneakers (the phrase has become shorthand for a pejorative against President Joe Biden), Jarvis said Republicans may not have to fight so hard with someone else in office.",
    "These sentiments came from nearly two dozen activists, many in MAGA or anti-Biden gear, and almost every one cited DeSantis, who they love for refusing to follow pandemic best practices, as at least a top three choice for president.",
    "“They realize that Trump was a lightening rod and that if runs he’ll win the nomination.”\nGOP speakers were given anywhere from five to 20 minutes to address the convention, and most used their speeches to stoke the culture war.",
    "“I want someone who’s conservative like Trump, who’s brash like Trump, but who’s got a little bit more political experience, who can bring in all conservatives, all moderates, and not be as divisive,” Madison said.",
    "“I do not recommend Trump running because it will send every liberal to the polls and it will destroy everything from top to bottom,” said Peter Lee, a 52-year-old from Orlando who runs a local tea party chapter.",
    "Ever since he confronted his 2020 loss with cries of a “rigged” election, Trump has teased the possibility of a comeback, and many of his supporters at CPAC said they believe he’s going to follow through.",
    "John Raoux/Associated Press\nORLANDO, Fla. — Donald Trump still rules the Republican Party, but at least some Republicans are beginning to imagine what a future might look like without him.",
    "John Raoux/Associated Press\nThough he keeps teasing another run, Trump hasn’t made his plans clear and, until he does, it essentially freezes the field for the rest of Republicans.",
    "Advertisement\n“These people ought to be crisscrossing the country, talking at Lincoln Day dinners, and campaigning, etcetera,” said Saul Anuzis, a longtime Republican strategist.",
    "“I’d be surprised if you hear differently all weekend.”\nFloridians may have been overly represented at CPAC, potentially giving DeSantis an advantage in the straw poll.",
    "Advertisement\n“Absolutely not!” said one CPAC attendee from New Jersey, roaming Orlando’s Rosen Shingle Creek hotel with a $500 silver bedazzled pistol-shaped purse.",
    "Drawing candidates, conservative celebrities, activists, journalists and political operatives, the convention was an explosion of blingy Trump-themed everything.",
    "Rep. Jim Jordan (R-Ohio) said he hoped Trump would run again, while Ohio Senate candidate Josh Mandel declared Trump the winner of the 2020 election.",
    "“I just think DeSantis is the guy right now, you know?” said David Thomas Roberts, who traveled from Houston to sell books at CPAC’s expo hall.",
    "The woman didn’t want to share her name for fear of being on record against Trump, even though she voted for him and still thinks he’s great.",
    "Trump spoke to a rapturous crowd at CPAC on Saturday and baited them into thinking he would challenge President Joe Biden again in two years.",
    "Advertisement\nBut even the Trumpiest of Trump fans are beginning to have reservations about just how practical a Trump comeback would be.",
    "“I think he’s the lesser of two evils,” said Deborah Jarvis, a 55-year-old electronics tester from Ocala, Florida, referring to DeSantis.",
    "Ron DeSantis was the clear non-Trump favorite with 28%, up 7 points from last year’s poll, indicating that support for him is growing.",
    "They mentioned that his wife, Casey DeSantis, has recently battled breast cancer, making it an awkward time to run for president.",
    "And though Trump has privately fumed at DeSantis challenging him, some of his biggest fans are starting to welcome the idea.",
    "“DeSantis basically has the same policies as Trump, but he just says it in a different way that the media won’t attack.",
    "Trump won the convention’s 2024 straw poll with 59% support in a hypothetical matchup against 18 other Republicans.",
    "Local Republicans who didn’t want to see DeSantis run for president said they didn’t want to lose him as governor.",
    "Let’s not do that.”\nIn general, though, the nation’s preeminent conservative gathering was all about Trump.",
    "“We did it twice and we’ll do it again,” he said, alluding to the falsehood that he beat Biden in 2020.",
    "“He’s 42 years old ... we’ve got other people.”\nChristopher Mathias contributed reporting.",
    "Trump was a passing mention in remarks from Florida Sen. Rick Scott and North Dakota Gov.",
    "So if Trump runs, it sends half the nation back to the polls to vote against him.",
    "The emerging dynamic with the Florida governor is getting under Trump’s skin.",
    "He almost steps in it sometimes, but that’s just his personality,” she said.",
    "Looking for every single Trump tweet in four leather-bound volumes?",
    "Ron DeSantis is riding national momentum in the Republican Party.",
    "You came to the right — and maybe only — place for that.",
    "“I think people just want to see us move on,” he said.",
    "The same bullshit we dealt with for years,” she said.",
    "“I just don’t think it’s gonna work for the country.",
    "“I mean, Ron is such a great governor,” Duffey said.",
    "I was just in Texas [for a rally] a few weeks ago.",
    "But right now our focus should be 2022,” she said.",
    "“Apparently, half the nation voted against Trump.",
    "Shirts, hats, dresses, purses, shoes, flags.",
    "Trump’s support also jumped by 4 points.",
    "“I’m 100% conservative, 100% Republican.",
    "What about a MAGA hammock for $1,500?",
    "I love him to death,” she continued.",
    "DeSantis didn’t mention him at all.",
    "Merchandise for sale at CPAC.",
    "I’ve been to Trump rallies.",
    "It’s going to be a fiasco.",
    "“Not that [Trump’s] evil!",
    "“I love Trump.",
    "They had that.",
    "Florida Gov.",
    "Florida Gov.",
    "Kristi Noem."
  ]
}