{
  "id": 25727,
  "mediaId": 2550,
  "date": "2022-03-20",
  "headline": "The Downballot: Voting rights and criminal justice are on your local ballot this year (transcript)",
  "image": "https://images.dailykos.com/images/1043487/story_image/TexasVoting.jpg?1646144840",
  "link": "https://www.dailykos.com/stories/2022/3/17/2086465/-The-Downballot-Voting-rights-and-criminal-justice-are-on-your-local-ballot-this-year-transcript?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13724,
    13803,
    14192,
    13372,
    14317,
    14318,
    14335
  ],
  "sentences": [
    "When you think about someone like Krasner, or Boudin, or Gascon, or really a lot of other people around the country, those maybe have been the highest profile, but also places like Austin, Texas, the suburbs of Washington, D.C., in Virginia and a number of other places, if you had told people in 2016, 2017, that candidates, which is just four or five years ago, that candidates with such profiles and such platforms would come into office on the stuff they're saying, it would be such a humongous break with the status quo.",
    "Daniel Nichanian:\nA lot of the people who are invested in like the other side of this debate, in keeping approaches that are more punitive, whether it's on lower level offenses like the war on drug, or on higher level offenses, because we're also speaking now much more than until three, four years ago about violent crime and approaches to very long incarceration and these higher level crimes, and what is the best way to promote safety to them.",
    "The last thing I will say is that I think many of the arguments don't really hold up because when you look at the places where crime has increased, as I was saying, it's increased in so many places that do not have anyone like a reform DA at their head in places with Republican DAs or the many places that don't have... That democratic DA has no particular inclination towards reform.",
    "Anyone who is interested in our coverage or really learning more about the races that I'm talking about, and seeing the maps we have, and seeing the coverage we have should go to boltsmag.org, and you can explore the page I was discussing that I think has been very exciting to me to have, because I've already learned so much of it, about who runs elections at the county level.",
    "Daniel Nichanian:\nActually, on day one of Bolts, we had a research database published that drills down on every state, in each of the 50 states, on who are the officials at the county level who run elections and run the registration process, and being able to, from that, gain more traction at the level of the county clerks and potentially in some cases statewide levels.",
    "Daniel Nichanian:\nThe other thing that immediately comes to mind is something that is so at the control of local officials, is how easy it is for people who are in jail to vote... By people in jail and people who have never been convicted of a felony and are just being held on bail or are being held pretrial and have the right to vote.",
    "David Beard:\nThis one is connecting Timken's family and her business dealings, with the business dealings of Russian oligarchs and what they're manufacturing and how that would be contributing to the effort, which could certainly be effective, but certainly requires a couple more hoops to jump through than the North Carolina ad.",
    "Daniel Nichanian:\nI think, first of all, that people under-appreciate the degree to which, in many of the places that we are talking about, there's been such an awareness with the harms of mass incarceration because so many voters know someone who has been in prison, who has been in jail, who has lost the right to vote.",
    "Daniel Nichanian:\nThe fact that the vast authorities that DAs have to shape the criminal justice system and the scope of incarceration, and that that has come into you not just in extreme cases where someone is particularly where just there was outrageous cases that really land them, like everyone can immediately see.",
    "One other follow-up that I wanted to make from a previous thing that we talked about, two weeks ago we discussed Jim Inhofe, the senator from Oklahoma, his prospective resignation where he announced that he would be resigning next January so that he could set up a legally questionable special election this November.",
    "That's another type of story that is becoming more and more clear for people, that the more the federal court systems become closed off to claims about redistricting and voting rights, the more these state courts are becoming the central voting rights story, and one that the writer is obviously very, very aware of.",
    "David Beard:\nHe says that woke indoctrination will destroy our military in the ad, which is just so extremely strange that the takeaway from the Russian invasion of Ukraine and the failures of the Russian military, what he takes away from this is that America shouldn't have trans service members in their military.",
    "It is very important for anyone who is running on a progressive platform, on a reform platform, to talk about why they think their policies are addressing the harms of mass incarceration and racial injustice, but are also important to promote safety and approach the question of safety in a different way.",
    "Also increasingly, from Republican statewide officials who are paying attention in a new way to what's happening at the local level, and are looking for ways to preempt it in some places, for instance, there's a Republican candidate who's running for governor in Pennsylvania who might win the nomination.",
    "Co-hosts David Nir and David Beard also analyze how the war in Ukraine is playing out in U.S. elections, the status of redistricting in the five laggard states that have yet to adopt new congressional maps, and a lawsuit challenging whether Oklahoma can hold a special election for the Senate this year.",
    "David Nir:\nAnother point that Jones made is that Jim Inhofe could retract his resignation, there's nothing legally binding about it, after the special election in November, which would create a totally bizarre situation of having, essentially, a fraudulent special election for a senate seat.",
    "What's interesting in Boston, I was already mentioning it before, is the incumbent just left because she was appointed to a federal office and the Republican governor there just appointed a new DA in Boston who's actually running as a Democrat in 2022 and is facing at least one opponent.",
    "I invite everyone to go there and both read the stories we have already, but also some of the resources we're trying to put out there, the spreadsheets and databases that try and answer some questions about who has the power to do what, and when they're elected and all of that stuff.",
    "Daniel Nichanian:\nWe ran an article where both of the Democrats who were running were talking about the importance of getting creative, of getting creative and trying to find ways within the law to continue pushing as much as possible, even if the Republicans have constrained that.",
    "David Beard:\nBeyond the San Francisco recall that we talked about a little bit, what are some of the key district attorney races on your radar, either in the primaries or in the general election this fall, and particularly any new progressive challengers that you're excited about?",
    "I think there was a rehearsal in a lot of elections for mayor in particular, where there were a lot of progressive candidates for mayor who were trying to make the case that we really have it wrong, that addressing crime really means much more investments in transit and housing.",
    "I think number one will be the places where Trumpkin candidates really running on platforms of \"Stopping the steel\", arguing that '22 election was stolen, and gesturing towards things they're going to do in 2020 to 2024, 2024 mostly, to crack down on these false claims of fraud.",
    "And I think that's something that anyone who's probably listening to this will really understand that that's so much of what the elections does is trying to provide resources and start filling in the gap with lower level federal elections and higher level state elections.",
    "I think the idea behind it is that I'm someone who cares, as I'm sure a lot of people who are listening, about voting rights, criminal justice, and just really a whole host of issues where local governments and state governments have such paramount importance.",
    "David Beard:\nThen it claims that this is that this is essentially supplying Putin's government with military grade machinery, and then ends saying Timken's family gets rich, Timken money funds her campaign, and she has the gall to run for the U.S. Senate.",
    "Daniel Nichanian:\nIn some places, it never happens, and just a few counties account for the huge share of new death cases in the U.S. And one of them is Clark County in Nevada, and the challenger there has promised to never seek the death penalty.",
    "Just one example, there was a bill in New Mexico a month of ago that was meant to do so much on voting rights, including pass AVR—automatic voter registration—restore the right to vote to anyone who's not in prison, and a number of other things.",
    "But the cases that do take explanation and understanding that within the scope of what someone can do within the law, before we go to what is illegal or unethical that prosecutors do, there's such a huge amount of difference that can be done.",
    "What was interesting in that election is that it's obviously operating under massive constraint of the Republican law that passed last year, but also earlier laws that we box in what an official can do at the local level in these blue areas.",
    "David Nir:\nUp next, we will be talking with Daniel Nichanian, who is the editor-in-chief of Bolts Magazine, a new digital magazine devoted to covering down-ballot elections, particularly those that affect voting rights and criminal justice.",
    "Daniel Nichanian:\nBut eight to 10 California counties, the other side stuff is happening where there are progressive candidates that are trying to take over offices, that are anti reform and that have opposed reform at the statewide level.",
    "Their Republicans have passed an unusual two-map plan where there's a map A that they seem to prefer the most, but they say that if map A gets struck down, it'll be replaced by map B, which is somewhat less aggressive of a gerrymander.",
    "Daniel Nichanian:\nI think what is becoming very apparent is that can that candidates or incumbent Republicans who are not really part of that crowd, first of all, always were obviously doing things that were threatening voter access.",
    "Daniel Nichanian:\nThe Supreme Courts of Ohio, and North Carolina, and Pennsylvania have played a huge role in the past few months alone in who gets to draw the maps and how aggressive the maps are going to be for those swing states.",
    "Daniel Nichanian:\nThere is also appreciation now I think that there wasn't about attempts on the right to take over a lot of these offices, clerk offices, board of canvassers, and so on, that really control the machine of elections.",
    "Daniel Nichanian:\nI think more and more people have come to appreciate the importance of county and local officials in the apparatus of how elections run since 2020, because of what happened specifically in November and December.",
    "A lot of conversations, like for instance, there are many more candidates now who are running on platforms of saying they will never file charges when it comes to some lower level offenses, like certain lower level drug offenses.",
    "Daniel Nichanian:\nAnother one that's very interesting is Clark in Nevada, is Clark in Nevada, which is Las Vegas, where there's a DA there who is among the most prolific in the country in seeking the death penalty in cases.",
    "David Nir:\nA couple of lawsuits have been filed asking courts to take over redistricting because of this impasse, and time is really running out because the candidate filing deadline is at the end of the month in Missouri.",
    "David Nir:\nIt's now time for our weekly hits where David Beard and I will run through some of the stories that are making headlines or that are not making the headlines they should be in the world of down-ballot elections.",
    "Are there any interesting examples that come to mind of a progressive winning something like a county clerk's office in recent years, where they have really instituted reforms that have helped expand access to the ballot?",
    "That, to me, seems like the kind of race that the right has been very good at identifying, seeing, finding, giving to, but are just undercooked on the left, that people on the left are not paying enough attention to them.",
    "And Democrats, including the governor, John Bell Edwards, are very unhappy with that map because about a third of Louisiana's population is Black, and there's only one district with a black majority, the second district.",
    "Daniel Nichanian:\nWe're also seeing some pushback within the Democratic Party, especially the past year as crime has increased around the country, including places that don't have anything like a reform DA at their helm.",
    "David Nir:\nHe wants them to go crazy, ultra, super, max, hyper, mega gerrymandered, and tear apart a Black plurality district in North Florida, make every district in the Northern part of the state leaning Republican.",
    "By law, they should have access to the ballots, but that very, very frequently, almost always, really depends on the goodwill of the sheriff, or of the county clerk, or of the work between them of making it possible.",
    "David Nir:\nToday we will be talking with Daniel Nichanian, who is the editor-in-chief of Bolts Magazine, a digital magazine devoted to down-ballot elections for races that affect voting rights and criminal justice.",
    "Then separately, there's this very crowded primary in Georgia's 10th district, which covers the central and eastern parts of the state, where the incumbent Republican, Jody Hice is running for secretary of state.",
    "Daniel Nichanian:\nThere's also going to be a lot of progressive candidates who are running now to take over offices that have long been in the hands of people with much more conventional approach to prosecution.",
    "And-\nDavid Nir:\nIf you were going to be giving advice to someone like a Chesa Boudin who, as we mentioned, is up for a recall in June, about pushing back against these establishment attacks, what might you say?",
    "But there's so many people who are also running for these offices from a progressive standpoint, that feel like not enough is done from a county position, but also a statewide office, to expand the ballot.",
    "There's the argument that there's something specific about places like over in Virginia or Philadelphia where the argument is made against the reform camp, just doesn't necessarily hold up in that aspect.",
    "On this week's episode of The Downballot, we're joined by Daniel Nichanian, editor-in-chief of Bolts Magazine, a new digital magazine devoted to elections that impact voting rights and criminal justice.",
    "What I think Bolts is trying to do is fill in the space for people who understand that there's this problem now, but don't necessarily know where to go as a result, other than this big national story.",
    "I mean, CNN always in every presidential season show the clip of the '88 presidential debate where Michael Dukakis famously didn't answer a question on the death penalty the way he was supposed to it.",
    "If you put a ton of people in prison and jail over this long period, there is a very different awareness of the harms of incarceration than there may have been when in incarceration was much lower.",
    "To some degree, we don't quite know all of that, that can be done in these offices because a new candidate is running for them, potentially in some places trying to take over these county offices.",
    "David Nir:\nOf course, not just that, but the ongoing efforts to allow Trump to pull off what he couldn't do in 2020, the attempts by the GOP to entrench themselves and really undermine democracy.",
    "We've seen Larry Krasner in Philadelphia, George Gascon in Los Angeles, Chesa Boudin in San Francisco were all some notable examples of progressive victories that then received a lot of pushback.",
    "And then we've seen some equally strong pushback from a lot of the establishment, particularly sometimes within the district attorney offices themselves, from police officers and police unions.",
    "One election that we are paying attention at Bolts and we ran a story on is in Franklin County in Kentucky, which is a very small county, but it also is where the state capital is, in Kentucky.",
    "He's pointed to the 17th amendment, which he claims only allows the governor to call a special election after the seat has actually been vacated, not for a scheduled resignation in the future.",
    "You can find him on Twitter at #Taniel, that's Daniel but with a T. But Daniel, why don't you also please tell folks how they can learn more about your work and what they can do to support it?",
    "Republican attorney, Stephen Jones, is asking the Oklahoma Supreme Court to bar the state's election board from carrying through with this special election that's been called later this year.",
    "What have you seen the establishment strategy having been, and what do you think are the best ways to push back against this when they come after these progressive DAs who have been elected?",
    "We think about so many of these elections, especially for local office, as really defensive actions about trying to prevent these Trumpers and Stop the Steal types from getting into office.",
    "David Nir:\nGovernors are unusually powerful in the state, and there is a good chance that Edward's veto will get sustained, which would then likely mean that the courts will draw a new map.",
    "We further tackle the huge changes we've seen in recent years in races for district attorney, as well as an upcoming recall election of a high-profile progressive reformer in San Francisco.",
    "In Missouri, which we discussed on an episode a few weeks ago, hardcore far right hardliners are insisting on a map that creates seven Republican districts in just one democratic district.",
    "David Nir:\nOhio is also up in the air because the state Supreme Court has struck down the GOP's congressional map as an illegal partisan gerrymander in violation of the state constitution.",
    "As a result, a lot of the lawsuits in Kentucky, that have to do with voting rights or civil rights end up going in front of this very court that only has two judges sitting on the bench.",
    "It's really great to talk to you, especially about Bolts and about the work we've been doing, because you all and the work you've been doing is really an inspiration behind some of it.",
    "I always thought that if you want to maximize your military readiness, the worst thing you should possibly do is tell people willing to fight for you that you don't want them to fight.",
    "David Beard:\nSo we can certainly see that could be effective, and we'll see if it's an ongoing issue that makes a difference in this primary, that has a lot of competitive candidates.",
    "David Beard:\nI wanted to continue an interesting discussion that we had last week a little bit, which is the influence of the Russian invasion of Ukraine on the ongoing GOP primaries.",
    "Of course, there are high level stories that do get national attention, but what are you seeing as the biggest stories on this really local county level that you're tracking at Bolts?",
    "It's really a little bit lots of connections, as opposed to the first ad being very straightforward like, \"These were things that Bud said and things that Bud voted for or against.\"",
    "Daniel Nichanian:\nBut I think it's very important because it's not the kind of thing that is going to happen overnight, and having those conversations is going to be very important.",
    "The really interesting thing here is that in the 200 plus years that Louisiana's been a state, there are only two known instances that a governor's veto has ever been overturned.",
    "He's running this very strange ad where he starts off talking about the biggest European land war in Europe since World War II, so obviously talking about the Russian invasion.",
    "David Beard:\nWe'll be continuing to track this, and once these maps do get finalized, whenever that is, we'll definitely bring you full analysis of the results of those maps.",
    "The county clerk there had really gone very far in trying to make sure that it's as easy as possible to vote, including having some places that were open for 24 hours a day.",
    "So paying attention to who stalled that, who is running to make sure that in places where it's not about Republicans, the things are also moving towards universal suffrage.",
    "He's the founder and editor-in-chief of Bolts Magazine, a digital magazine that focuses on local elections, particularly in the areas of criminal justice and voting rights.",
    "It's possible we could wind up with some sort of court drawn map, all because Republicans refuse to pass a map that is less gerrymandered than the one they're insisting on.",
    "At the county level, we've already seen some elections, one, for instance, in Texas a month ago, by Stop the Steal candidates, both at the federal level and county level.",
    "David Beard:\nThat really transitions us really well into the other big issue that Bolts Magazine covers, which is criminal justice and criminal justice related elections.",
    "Daniel Nichanian:\nI think the candidates we're talking about have been aware of that and have been able to talk to that in a way that's very different by the candidates.",
    "Daniel Nichanian:\nWe are seeing that in Ohio, for instance, where the Republican incumbent in the race for secretary of state, is known as an establishment Republican.",
    "There's been more and more candidates who have jumped in, who are using the elections as a path to lowering incarceration and changing approaches to criminal justice.",
    "Republicans are working on a map that would try to target one of the states to Democrats by upending a district line that has been pretty much in place for 140 years.",
    "I think the very first thing to say about them is the very fact that we're in conversation about them, is something that has evolved over the past five to 10 years.",
    "There's a lot of places around LA and San Francisco., because those are the two places where reform DAs have really made their mark and are now coming under attack.",
    "Then he claims that the problem with all this is that America is allowing trans service members into the military and that's going to destroy our military somehow.",
    "Some of them were very high profile in some cases, especially when they involved someone who had particularly extreme views or particularly controversial record.",
    "Daniel Nichanian:\nThere's more and more candidates that have different platforms than the traditional approach of prosecutors has been for the past 20, 30 years.",
    "Daniel Nichanian:\nAnd then, the last thing I also want to mention, I think we just talked a lot about the Trumpkin candidates and the Stop the Steal candidates.",
    "There is no nowhere else to look, but the county level if you really want to think about prisons and jails and incarceration, that's really where the action is.",
    "One thing that's new this year is there is a lot more conversation and pushback around the rise of violent crime around the country, that I was just discussing.",
    "It's one of the only places in the entire country for people who are held in jail, but are eligible to vote to have access to the ballot as easily as possible.",
    "David Beard:\nOf course, if that's true, federal laws, including the 17th amendment to the constitution, would supersede any Oklahoma state laws on the matter.",
    "Missouri has an unusually strong filibuster in its state Senate, and the hardliners have been filibustering for weeks now, and there is just no end in sight.",
    "Daniel Nichanian:\nIt's a democratic state with huge democratic majorities, and the bill failed in part due stalling by Republicans, but also by Democrats.",
    "Daniel Nichanian:\nSome of that is also governed at the level of state officials and local officials, and they don't necessarily need a law to be passed.",
    "Reformers have demanded a second Black district and, of course, Republicans have refused to draw one because it would almost certainly elect a Democrat.",
    "Daniel Nichanian:\nNot just in recent years, but of 30 years of approaches to criminal justice, which is that the candidates were not career prosecutors.",
    "That in and of itself, could really change the numbers under death penalty across the country, which sounds weird to say because it's just one county.",
    "Of course, the biggest question, as we mentioned, is one of standing as Jones is simply representing himself in his capacity as a citizen of Oklahoma.",
    "Daniel Nichanian:\nThere are 3,000 counties in the U.S., and on criminal justice and voting rights, so much of what's happening is at the county level.",
    "David Nir:\nI've had a chance to check out some of your offerings, Daniel, and it really is so much in common with what we do at Daily Kos Elections.",
    "We've had a number of big races in big cities across the country where progressive DA candidates are challenging incumbent establishment candidates.",
    "I think it's important to take a step back here in thinking about this question, because it really gets to the prior question we were talking about.",
    "They fell short of the two-thirds super majority on the initial vote, and there were some Republicans who actually voted against the GOP's own map.",
    "But, again, the redistricting process nationwide will not be complete until these five states get their act together and actually enact new maps.",
    "We're talking about their platforms on transit and housing and other issues as something that contributes to safety, which isn't necessarily new.",
    "But that is going to be very important race because Boston was one of the key places where progressives took to power in 2018 in these offices.",
    "I mean, we are seeing still states not have automatic voter registration, online voter registration, or the questions about rights restoration.",
    "Now this doesn't include some other states or there's pending litigation and maps could get unended, but that maps have actually been adopted.",
    "It is worth noting that Ohio does have the fifth largest Ukrainian population in the United States, particularly in the suburbs of Cleveland.",
    "Doesn't have to overthink having to cover something as a national story necessarily, because those are national stories in and of themselves.",
    "Daniel Nichanian:\nFor instance, in Philadelphia, Larry Krasner was meant to be in a ton of trouble in 2021 because he was up for reelection.",
    "The ad claims that Vladimir Putin's old oligarchs partnered with Jane Timken's family business to build high capacity freight rail cards.",
    "We discuss far-right efforts to take over local election boards—and the progressives who are using those offices to expand voting rights.",
    "But Ron DeSantis, who is also a Republican, he's the governor, he is completely pissed off about the approach the legislature has taken.",
    "The idea they would come in and change these offices from the inside was really just foreign to what was happening up until 2015, 2016.",
    "I think that's something that's been ingrained in anyone who has followed American elections, for any time since the past 25, 30 years.",
    "Because as I'm sure everyone who listens understands, in every state has a totally defense system of who runs these elections locally.",
    "The conservative candidate has already gotten a lot of funding actually from conservative groups that are attached to Mitch McConnell.",
    "Daniel Nichanian:\nAs there are more and more candidates who jump in, there are more and more issues, I think, that are being debated.",
    "Millions of people were suddenly watching in Wayne county in Michigan, this board of canvassers that no one had really ever heard of.",
    "The Downballot is a weekly podcast dedicated to the many elections that take place below the presidency, from Senate to city council.",
    "We're reaching the end game in what has been a long but somewhat rush process because of the late release of census data last year.",
    "We're also going to take a look at where redistricting stands in the five states that have yet to complete new congressional maps.",
    "Some of that are starting to take on increasingly the language of widespread voter fraud in the context of 2020 to argue for more.",
    "What we have seen in 2016 and 2017, that that's no longer the case in a lot of these elections, and people are surprised by that.",
    "There's many candidates in Arizona, in Georgia, in Ohio, who are running for the secretary of state positions on similar claims.",
    "The idea behind Bolts was to create a space, an editorial platform publication that is comfortable leaning into those questions.",
    "David Nir:\nThe reason is very strange, which is that the legislature has yet to forward the bill to him, and it's not clear why.",
    "David Nir:\nEdwards vetoed the map and now Republicans are seeing whether they actually have enough votes to overturn that veto.",
    "Daniel Nichanian:\nAnd then, second, the informational structure, the void around these elections, these powers is really great.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Of course, that's going to be top of mind for every progressive in the wake of Donald Trump trying to steal the 2020 election.",
    "There was just an election in Texas, in Travis County, which is Austin, also the bluest part of Texas, for the clerk position.",
    "Daniel Nichanian:\nIn 2022 and 2024, it could come into play in terms of the biggest story being overturning of the elections.",
    "This involves really two candidates: former Ohio treasurer, Josh Mandel, and former Ohio Republican party chair, Jane Timken.",
    "We saw last week that the North Carolina Senate had an ad about it, and now we've seen two more Republican ads related to it.",
    "I'll just observe that the Ukrainian military allows LGBT soldiers to serve openly like we do, while Russia clearly does not.",
    "We have definitely talked a lot of about the state Supreme Court elections, both at Daily Kos Elections and on this podcast.",
    "Daniel Nichanian:\nThe difficulty that anyone who tries to follow these issues and understand what's going on is as twofold.",
    "David Beard:\nPlease subscribe to The Downballot wherever you listen to podcasts and leave us a five-star rating and review.",
    "What they're waiting on may have some something to do with machinations surrounding the budget that they also just passed.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Daniel Nichanian:\nYou can see some of the maps about the places that are very important in elections at the county level.",
    "One, it's [inaudible 00:14:33] difficult to even know who has the authority to do what, like what does the prosecutor do?",
    "They're people who really have spent their life as their career trying to lower incarceration and champion civil rights.",
    "It's so much fun to talk to people who get the importance of these offices and looking at the county level, state level.",
    "The modest candidates have come in really since the BLM movement started in 2014, 2016 and picked up steam from there.",
    "That's something that we really only see in a few places and that anyone could try and ramp up around the country.",
    "I mean, if you're in California, the chances are you are in a county with like that because there's really a lot.",
    "If you haven't already, please like and subscribe to The Downballot and leave us a five-star rating and review.",
    "If DeSantis does veto this and Republicans can't overturn his veto, then, again, we could see court drawn maps.",
    "DeSantis has pledged to veto this map or this two-map plan that Republicans have passed, except he hasn't yet.",
    "And so, they've started airing an ad hitting Timken for her family's business dealings with Russian oligarchs.",
    "It felt like they waited for Trump and for 2020 to suddenly start purging voters, to start closing down polls.",
    "There was an election in 2018 where the person was elected of Boston, ran on such a platform of not charging.",
    "Daniel Nichanian:\nWell, the thing that immediately comes to mind when I hear your question is not quite that.",
    "Daniel Nichanian:\nConservatives are trying to oust a judge who's been on that bench for 16 years this year.",
    "David Beard:\nJones gained prominence nationally for representing the Oklahoma city bomber, Timothy McVeigh.",
    "So I think the being able to connect reforms to improvements of safety is going to be especially important.",
    "David Beard:\nA question we had at the time was, is there any way to stop this or have a lawsuit about it?",
    "But we will at least see this addressed in court and have an opportunity to have a judge rule on a case.",
    "It doesn't necessarily work to point out the statistics elsewhere in the country or something like that.",
    "There's been concerns about crime that has led people to champion going back to tough-on-crime policies.",
    "At the highest, the most obvious level candidates like Kari Lake who's running for governor in Arizona.",
    "We are starting to see, in a few places, efforts by sheriffs and clerks to make that a little easier.",
    "So it's not clear exactly what injury to him is actually taking place by this election going forward.",
    "One pretty straightforward in Ohio, and then one strange one that I'll get to afterwards in Georgia.",
    "Daniel Nichanian:\nThere's so many judge races, and I was mentioning the ones that have to do with...",
    "We have been talking with Daniel Nichanian who is the founder and editor-in-chief of Bolts Magazine.",
    "So I think some of that paying attention to the progressive candidates as well will be interesting.",
    "But now it's become more common for candidates to run for these offices saying something like that.",
    "Daniel Nichanian:\nIt was a huge deal in the sense that they weren't that many who had run on that.",
    "And if the courts take reformers views to heart, we could see another Black district in Louisiana.",
    "But that's really the scope that we are talking about in terms of the authority these people have.",
    "How have you seen those races evolve really in the past five or 10 years to where they are today?",
    "Daniel Nichanian:\nWe didn't see that in our other places that had democratic the clerks in Texas.",
    "But there's just so much to do on trying to chronicle, track, report on these local institutions.",
    "I'm going to briefly run through each of them because they're all screwed up in a different way.",
    "It's just very hard to make that argument in the electoral context because that doesn't quite...",
    "Daniel Nichanian:\nYeah, there's a lot of pushback from criminal prosecutors, from police unions.",
    "David Nir:\nThe next and possibly even crazier... No, I'm going to say it's crazier, is Florida.",
    "Finally, we're going to check back in on a strange special election for the senate in Oklahoma.",
    "We've seen that district attorney races have really become much more prominent in recent years.",
    "David Nir:\nAs of now, there are only five states that have yet to draw new congressional maps.",
    "The primaries I think that are most interesting are going to be in places like North Carolina.",
    "Every other part of Pennsylvania should get to elect their DAs themselves, but not in Philly.",
    "Mandel's been endorsed by the Club for Growth, and they've been spending money on his behalf.",
    "All of those states are going to have elections again for state Supreme Courts in 2022, 2024.",
    "But also if you want to drill down to the county level, we love getting down into the weeds.",
    "So that's something to continue watching what kind of authority they're going to accumulate.",
    "He's arguing that a special election can't be held until after the senator actually resigns.",
    "But first, we are going to discuss how the war in Ukraine is playing out in U.S. elections.",
    "But you point out that progressives can do a whole world of good when they win these races.",
    "Daniel Nichanian:\nAgain, in Houston, actually there was a polling place set up at the jail.",
    "You mentioned these spreadsheets of detailed information about these hyper-local elections.",
    "That's really when these offices became more into the view of the mainstream conversation.",
    "You can also obviously go to Twitter and find us also at Bolts Mag and on and on Facebook.",
    "But like you said, we'll have to see whether a court allows him to proceed with his case.",
    "But one thing we're also seeing now is the importance of state courts for voting rights.",
    "Vladimir Putin did that and Ukraine didn't, and like you said, we're seeing the results.",
    "It really comes down to whether the incumbent DA wants to seek the death penalty or not.",
    "Because the death penalty is an example where it really comes down to the county level.",
    "David Beard:\nWe've seen some real successes in electing progressive district attorneys.",
    "For instance, in 2020, a huge story in the fall was someone else in Texas, in Houston.",
    "David Beard:\nBoudin in particular is facing a tough recall election later this year.",
    "What was the inspiration for starting something like this and how did it come about?",
    "David Beard:\nJoining us today is Daniel Nichanian, also known as Taniel on Twitter.",
    "So trying to make sure that they're being as creative as possible in getting there.",
    "But for some reason, action has not been completed on that map, hasn't been signed.",
    "We weren't sure because it was unclear who might bring that suit or half standing.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We have a Support Us page and everything else that you might want to support us.",
    "One of his proposals is that Philadelphia should no longer get to elect its DAs.",
    "Republicans went and passed another map that looks very much like the first map.",
    "So I don't know where he gets the idea that trans service members are a problem.",
    "David Beard:\nIn Ohio, there's a five-way Senate primary for the GOP nomination.",
    "It seems extremely unlikely that the Supreme Court will be happy with that one.",
    "David Beard:\nWe've seen who has the superior fighting force, by and large here.",
    "Looking toward this fall, what elections do you see both on the state level.",
    "I think people are just used to the idea that tough-on-crime wins elections.",
    "He talks about how Putin is reviewing nuclear options, in a very scary way.",
    "Republicans drew a new map there that by and large looks like the old map.",
    "Suddenly was so important, and it's obviously more appreciation for that.",
    "You can drop us a line with your thoughts at thedownballot@dailykos.com.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "And I think 2022, he's going to continue being a test of that question.",
    "So if you're just trying to follow these issues, it can be very tricky.",
    "Daniel Nichanian:\nOh, the change on the elections has been really huge.",
    "But these candidates in Austin we're talking about trying to extend...",
    "A lot of other Republicans are not interested in pursuing that route.",
    "Daniel Nichanian:\nWe saw some of that go both ways, I think, in 2021.",
    "The Downballot comes out every Thursday everywhere you find podcasts.",
    "Daniel Nichanian:\nI mean, anyone who's grown up watching clips of...",
    "The filing deadline hasn't passed yet, so he may have others still.",
    "So there really is good reason to listen to the points he's making.",
    "David Beard:\nOne of the many candidates running here is Mitch Swan.",
    "If anything, they should be a strength considering what we've seen.",
    "So there's just been ingrained that tough-on-crime wins elections.",
    "That's essentially the same as the current map with some changes.",
    "There doesn't really appear to be any exit strategy here at all.",
    "David Nir:\nVery quickly I'll run through the other three states.",
    "And so, has a lot of back and forth and things going on with it.",
    "You can listen to The Downballot on all major podcast platforms.",
    "And so, we'll see how much attention there is on the other side.",
    "Daniel Nichanian:\nAnother one I'll mention is the DAs in Boston.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "The majority in North Carolina is at play for instance in 2022.",
    "These are five states with no legal map for the 2022 elections.",
    "He is also a former contributing editor to Daily Kos Elections.",
    "David Nir:\nFinally, there's the strange case of New Hampshire.",
    "This has been a very, very, very, very long game on the right.",
    "David Nir:\nThis has been an absolutely fascinating discussion.",
    "He won by a lot in both the primary and the general election.",
    "Thanks to our producer, Cara Zelaya and editor, Tim Einenkel.",
    "What are the top races that you see taking place in November?",
    "One other maybe should stay at the level of generality still.",
    "But he has started to talk more and more about fraud as well.",
    "I'm David Beard, contributing editor for Daily Kos Elections.",
    "Now that specific reform has been banned by the Republicans.",
    "David Beard:\nWell, Bolts Magazine is a very new publication.",
    "Obviously, in different states, those have different names.",
    "What are even the officials that are relevant in any state?",
    "But you guys are getting even further at the county level.",
    "So that's a story to watch on how far they're going to go.",
    "The incumbent has just a fraction of that amount of money.",
    "David Nir:\nI'm David Nir, political director of Daily Kos.",
    "They think that such a map would get struck down in court.",
    "Russia's extremely homophobic, from a policy standpoint.",
    "The more obvious ones are the state Supreme Court races.",
    "You can reach us by email at thedownballot@dailykos.com.",
    "And it's going to be very important to follow this year.",
    "He was also the GOP Senate nominee in 1990 in Oklahoma.",
    "He's also a former contributor to Daily Kos Elections.",
    "We're going to switch to an entirely different topic.",
    "Of course, they were the elections a long time ago.",
    "So the more specific you want to get, the better.",
    "I want to talk about congressional redistricting.",
    "So he's been around in the state for a long time.",
    "But let's go ahead and get into today's episode.",
    "But those were I think extreme cases, typically.",
    "Well, again, it was a really great conversation.",
    "And we're seeing some of that elsewhere as well.",
    "I think 2022 is going to be a big test of that.",
    "Daniel Nichanian:\nWe're seeing the same trends.",
    "David Nir:\nYou raise such an interesting point.",
    "David Nir:\nAt the top of the list is Louisiana.",
    "I think now polls can be open until 10:00 PM.",
    "That's a particularly fascinating situation.",
    "So it's very unclear what's going to happen.",
    "They want to gerrymander the first district.",
    "What are we going to be covering today, Nir?",
    "There's already been such a humongous shift.",
    "We look forward to having you back on soon.",
    "We'll be back next week with a new episode.",
    "David Nir:\nWell, thank you for joining us.",
    "David Beard:\nThat's all from us this week.",
    "Thanks to Daniel Nichanian for joining us.",
    "So please stick with us when we come back.",
    "What are you starting us off with, Beard?",
    "We try to get down into the weeds at DKE.",
    "The powers of these places are different.",
    "David Nir:\nThat's such an amazing point.",
    "It only has two congressional districts.",
    "And I think they're continuing to do so.",
    "Again, it's not clear where this leads.",
    "But that one is totally up in the air.",
    "First of all, thank you for having me.",
    "This is a short blurb about Daily Kos.",
    "So not really sure what the delay is.",
    "Somebody is at least giving it a go.",
    "There's all these new conversations.",
    "The GOP leadership wants a 6-2 map.",
    "x\nx\nDavid Beard:\nHello and welcome.",
    "I mean, there's so much to watch.",
    "Why don't we drill down a bit?",
    "What does the county clerk do?",
    "He's a retired Marine colonel.",
    "It's really great to be here.",
    "You mentioned voting rights.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "It just launched this year.",
    "Daniel Nichanian:\nAwesome.",
    "Want to keep it that way?",
    "What does the sheriff do?",
    "So a big welcome, Daniel.",
    "It could strike it down.",
    "We launched a month ago.",
    "Daniel Nichanian:\nYeah.",
    "Daniel Nichanian:\nYeah.",
    "Daniel Nichanian:\nYeah.",
    "Daniel Nichanian:\nYeah.",
    "That has changed a lot.",
    "That's how the ad ends.",
    "Daily Kos is different.",
    "Daniel Nichanian:\nYeah.",
    "A huge fan, obviously.",
    "What are the hotspots?",
    "Daniel Nichanian:\nHi.",
    "We have a newsletter.",
    "David Beard:\nGreat.",
    "Let's get started.",
    "Thank you so much.",
    "David Nir:\nYeah.",
    "Please read it."
  ]
}