{
  "id": 25797,
  "mediaId": 2660,
  "date": "2022-04-07",
  "headline": "No evidence Josh Mandel photoshopped his face onto body of Black Marine for campaign ad",
  "image": "https://static.politifact.com/politifact/rulings/meter-false.jpg",
  "link": "https://www.politifact.com/factchecks/2022/apr/07/occupy-democrats/no-evidence-josh-mandel-photoshopped-picture-black/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill McCarthy",
  "authorUrl": "https://www.politifact.com/staff/bill-mccarthy/",
  "termIds": [
    13680,
    13897,
    14081,
    13209,
    13355,
    13370,
    14317
  ],
  "sentences": [
    "The ad version of the photo includes other possible inconsistencies related to its lighting and pixelation, but the quality is so low that it's impossible to determine whether they are the result of Photoshop, video compression or other factors, said Hany Farid, a professor at the University of California, Berkeley.",
    "(Josh Mandel for U.S. Senate)\nFred Davis, a Republican consultant who creates ads for Mandel, told PolitiFact that the version of the image that showed up in the ad reflected efforts by the video editor to make sure the text directing viewers to the campaign’s \"JoshMandel.com\" web address showed up on the video.",
    "He found \"no evidence of manipulation\" and said it seems \"very plausible that the image is real,\" but he also cautioned that his analysis \"isn’t really conclusive\" because that version of the image could have theoretically been altered and then printed, photographed and shared.",
    "\"Analyzing the frame in the video isn't really possible because the image has been post-processed, converted to video, further post-processed, then compressed,\" said Matthew Stamm, an assistant professor of electrical and computer engineering at Drexel University.",
    "A Mandel campaign spokesperson called those allegations “totally false,” while the ad’s creator said Mandel’s hands appeared darker in the photo due to editing meant to increase the visibility of white text advertising Mandel’s website at the bottom of the screen.",
    "\"Visually comparing both versions, it is unlikely to me that the (version in the ad) was a result of Photoshop editing,\" added Siwei Lyu, a professor of computer science and engineering and the director of the UB Media Forensic Lab at the University of Buffalo.",
    "\"Breaking news: Ohio pro-Trump U.S. Senate candidate Josh Mandel puts a photo of himself standing with Black soldiers in his latest campaign ad,\" Occupy Democrats wrote in a post shared on both Facebook and Instagram.",
    "A Mandel campaign spokesperson provided PolitiFact with a version of the photo in which Mandel’s hands and the lower half of the rest of the photo appear lighter and more consistent with the rest of the image.",
    "PolitiFact also asked four digital forensics experts who know how to detect image manipulation about the social media allegations claiming that Mandel photoshopped his head onto the body of a Black soldier.",
    "The ad’s creator, meanwhile, said Mandel’s hands appeared darker in the ad because the photo had been vignetted in order to highlight the white text at the bottom directing viewers to Mandel’s website.",
    "The 30-second spot cuts between images from Mandel’s service in the Marine Corps to Mandel on and near the Edmund Pettus Bridge in Selma, Alabama, where King marched for civil rights in 1965.",
    "An unsubstantiated Twitter rumor asserted that Mandel had edited his face into one of the ad’s photos, which showed him alongside five other uniformed troops, all of whom appear to be Black.",
    "The liberal group’s claim is based on social media users’ observations that Mandel’s hands appear darker than his face in a photo showing him beside Black soldiers in a recent ad.",
    "If Your Time is short\nClaims that Mandel edited his face into a picture featured in a recent ad are based on observations that his hands appear darker in the photo than his face.",
    "The ad drew strong criticism, and some on social media accused Mandel of editing himself into a photo with Black Marines for the spot — claims the Mandel campaign called false.",
    "Our ruling\nOccupy Democrats said Mandel doctored an image in a campaign ad but \"forgot to Photoshop the hands that clearly show he put his face on the body of a Black soldier.\"",
    "Guthrie provided PolitiFact and reporters at Politico, NBC News and the Associated Press with another version of the image in question, which he said was the original photo.",
    "All four said that the image as seen in Mandel’s ad, and the photo provided by his campaign, are both too low-quality to conduct a reliable, definitive analysis.",
    "A new campaign ad from Josh Mandel, a Republican candidate for U.S. Senate in Ohio, invoked Martin Luther King Jr. in an effort to blast critical race theory.",
    "But if the photo shared by the campaign really is 18 years old, then \"that makes it less likely to have been digitally manipulated,\" Farid said.",
    "The bottom halves of the other soldiers in the ad version of the photo also appear darker than their faces, as do the weapons they are holding.",
    "The campaign did not provide information about the other people in the photo, and the Marine Corps said it was not able to do so.",
    "Featured Fact-check\nJosh Mandel's Senate campaign shared what they said was an original version of the photo from his recent ad.",
    "The Mandel campaign shared another version of the image — claiming this was the original — in which Mandel’s hands were lighter.",
    "\"The only problem is that he forgot to photoshop the hands that clearly show he put his face on the body of a Black soldier.\"",
    "A conclusive analysis would require the original photo in digital form, and the Mandel campaign said it does not have that.",
    "\"I didn’t do two tours in Anbar Province, fighting alongside Marines of every color, to come home and be called a racist.",
    "Occupy Democrats claimed in this April 5 Facebook post that Josh Mandel edited himself into a photo in his recent ad.",
    "The posts were flagged as part of Facebook’s efforts to combat false news and misinformation on its News Feed.",
    "Some social media users noted with suspicion that in the image, Mandel’s hands appear darker than his face.",
    "Some Twitter users shared posts alleging that Josh Mandel edited himself into a photo in his recent ad.",
    "PolitiFact ran reverse image searches and found no prior versions of the photo, with or without Mandel.",
    "Occupy Democrats did not respond to requests for comment but has since removed its post from Facebook.",
    "Scott Guthrie, a spokesperson for Mandel, said the charges of photoshopping are \"totally false.\"",
    "He said it \"was vignetted slightly by the editor to make sure the URL white type was legible.\"",
    "Some also pointed out that Mandel appears to be the only person with his name on his uniform.",
    "\"Martin Luther King marched right here so skin color wouldn’t matter,\" Mandel says in the ad.",
    "Occupy Democrats, a liberal media outlet built around a Facebook page, amplified the rumor.",
    "In that version of the image, Mandel’s hands do not appear to be as dark as in the ad.",
    "Independent experts found no conclusive signs of manipulation with that version.",
    "Stamm analyzed the other file that Mandel’s campaign shared with PolitiFact.",
    "No other evidence has conclusively substantiated the alleged photoshopping.",
    "\"It’s an 18-year-old photo taken in Iraq that was printed,\" Guthrie said.",
    "PolitiFact places the burden of proof on the speaker of the claim.",
    "The campaign released the ad April 5 on Twitter and YouTube.",
    "There’s nothing racist about stopping critical race theory.\"",
    "(Read more about our partnership with Facebook.)",
    "Because the claim is unproven, we rate it False.",
    "\"Look at the original photo,\" Davis said.",
    "\"It’s totally legit.",
    "No photoshopping.\""
  ]
}