{
  "id": 25792,
  "mediaId": 2660,
  "date": "2022-03-29",
  "headline": "Georgia’s David Perdue said elections were stolen from him and Trump. Pants on Fire!",
  "image": "https://static.politifact.com/politifact/rulings/tom_ruling_pof.png",
  "link": "https://www.politifact.com/factchecks/2022/mar/29/david-perdue/georgias-david-perdue-said-elections-were-stolen-h/",
  "mediaOutlet": "Politifact",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amy Sherman",
  "authorUrl": "https://www.politifact.com/staff/amy-sherman/",
  "termIds": [
    13483,
    13572,
    13592,
    13764,
    13791,
    14105,
    13197,
    14264
  ],
  "sentences": [
    "Courts rejected lawsuits filed on Trump’s behalf, including the U.S. Supreme Court which declined to review a case that alleged Georgia and other states exploited the pandemic to make election procedure changes.",
    "A consultant in 2021 found that Fulton County elections had \"myriad problems\" with the processing of absentee ballots, such as failing to sufficiently protect rejected ballots in the mail room.",
    "RELATED: The facts of a fair US election have only gotten stronger since Capitol attack\nRELATED: Tucker Carlson spins web of misleading claims as he alleges ‘meaningful voter fraud’ in Georgia",
    "On Jan. 19, 2021, Raffensperger certified the results, affirming that the returns \"are a true and correct tabulation of the certified returns received by this office from each county.\"",
    "Henry County Superior Court Judge Brian Amero issued an order May 21 to unseal the ballots but he later dismissed the case saying that the voters who filed the case lacked standing.",
    "Lawsuit seeking ballot inspection in Fulton was dismissed\nThe only evidence Perdue cited during the radio interview pertained to a court case filed after the presidential election.",
    "Garland Favorito, a longtime critic of Georgia’s election infrastructure, filed a motion in December 2020 claiming fraudulent mail ballots had been counted in Fulton County.",
    "Republicans seeking inspections of ballots in Democratic or battleground jurisdictions has become part of the strategy of Trump allies who make allegations of voter fraud.",
    "He is mimicking the evidence-free claims by Trump and his allies about the presidential election, and now extending them to his own loss even though he conceded last year.",
    "While such quests for ballot reviews have not changed any outcomes, they have added fuel to the efforts by state Republican lawmakers to pass new restrictive voting laws.",
    "The argument also fails to explain how a scheme to elect Biden and Ossoff would allow Republicans to win House seats, including Andrew Clyde and Marjorie Taylor Greene.",
    "Last year, the Georgia Bureau of Investigation said there wasn’t enough evidence to proceed on the allegation, but the group has since said it has a witness.",
    "Courts have rejected lawsuits alleging election wrongdoing and state election officials in Georgia — Republicans — said the presidential election was secure.",
    "We contacted a spokesperson for the Perdue campaign to ask for his evidence that the presidential and Senate runoffs were stolen and did not get a response.",
    "It would involve an improbable massive felonious conspiracy for multiple election officials to break the law and steal an election on behalf of a candidate.",
    "Analyses by reporters at the Atlanta Journal-Constitution and by Georgia Public Radio found that Ossoff beat Perdue with strong turnout among Black voters.",
    "\"Most people in Georgia know that something untoward happened in November 2020,\" David Perdue told conservative radio host Brian Pritchard March 25.",
    "Ossoff ran TV ads showing how the COVID-19 pandemic disproportionately hurt Black Americans and showing his support for racial justice protests.",
    "It has yet to reveal who that is.The State Election Board voted March 16 to issue subpoenas to the group, to obtain the name of their witness.",
    "The AP found that officials in 24 Georgia counties identified 64 potential voter fraud cases, representing 0.54% of Biden’s margin of victory.",
    "Perdue suggested that a judge found merit in a case filed by plaintiffs seeking to inspect ballots in Fulton County, a Democratic stronghold.",
    "The presidential election was not stolen\nThe presidential election in Georgia, where Biden won by about 12,000 votes, was not stolen.",
    "The numbers reflect the verdict of the people, not a decision by the secretary of state's office or of courts or of either campaign.\"",
    "If Your Time is short\nWhen Sen. David Perdue, R-Ga., lost a runoff in January 2021 to Democrat Jon Ossoff, he conceded days later.",
    "State officials in Georgia – Republicans – certified the results of the 2020 presidential election and the 2021 Senate runoffs.",
    "The state elections board in Georgia referred 35 cases to prosecutors in February 2021, including four to the attorney general.",
    "But now as the Trump-backed candidate in the governor’s race, Perdue has a different account of what happened in his own race.",
    "State officials for both contests certified the results which showed that Biden beat Trump and that Perdue lost to Ossoff.",
    "When the state’s top elections official, Brad Raffensperger, certified the results, he said that \"numbers don’t lie.\"",
    "The elections of 2020 and January 2021 in Georgia are over, and they were not stolen — they were won by Democrats.",
    "In the Jan. 5, 2021, Senate runoff race, Democrat Jon Ossoff won about 50.6% of the vote while Perdue won 49.4%.",
    "Democrats had been making inroads in recent years in Georgia, a state with an increasingly diverse electorate.",
    "The presidential election was counted three times by Georgia, and the results each time showed that Biden won.",
    "Brian Kemp in the primary, he has echoed former President Donald Trump’s falsehoods about “stolen” elections.",
    "State officials investigated the lawsuit’s allegations of counterfeit ballots and found they lacked evidence.",
    "Our ruling\nPerdue says his 2021 Georgia Senate runoff and the 2020 presidential election \"were stolen.\"",
    "Evidence of fraud in Georgia is so isolated that it would not have changed the outcome of the election.",
    "Days after Sen. David Perdue, R-Ga., lost his race against Jon Ossoff in January 2021, he conceded.",
    "Republican statewide election officials said that they found no evidence of systematic voter fraud.",
    "Brian Kemp, Perdue is running on a campaign of echoing Trump’s falsehoods about the 2020 election.",
    "The presidential election results in Georgia were counted three times, and each showed Biden won.",
    "Perdue filed a case in December similar to the dismissed lawsuit seeking to inspect the ballots.",
    "\"As secretary of state, I believe that the numbers that we have presented today are correct.",
    "\"I want to congratulate the Democratic Party and my opponent for this runoff win,\" he said.",
    "The Republican winner will face off May 24 and the winner will face Democrat Stacey Abrams.",
    "But the case, filed after the presidential election, was ultimately dismissed by the judge.",
    "The AP found similarly small numbers of potential fraud cases in other battleground states.",
    "Of those, about half were determined to be an administrative error or mistake.",
    "But the consultant found no \"dishonesty, fraud, or intentional malfeasance.\"",
    "Of those four, three were settled administratively and one remains pending.",
    "The runoff was not within the 0.5% threshold to merit a statewide recount.",
    "In Georgia, it is illegal to collect and submit multiple mail ballots.",
    "True the Vote, a conservative group, has alleged ballot harvesting.",
    "(Democrat Raphael Warnock also beat Republican Kelly Loeffler.)",
    "In my election and the president’s election, they were stolen.",
    "Perdue said the evidence is \"compelling\" of stolen elections.",
    "That’s not to say the elections in Fulton County were smooth.",
    "Trump, who had to defend his record amid a pandemic, lost.",
    "The lawsuit does not prove that the election was stolen.",
    "State officials certified the results on Nov. 20, 2020.",
    "Perdue lacks evidence that either contest was stolen.",
    "Featured Fact-check\nPerdue conceded three days later.",
    "Kemp also had to sign off on the certification.",
    "In his primary battle against Republican Gov.",
    "Some allegations remain under investigation.",
    "Favorito sought to inspect the ballots.",
    "We rate this statement Pants on Fire.",
    "But now, as Perdue runs against Gov.",
    "What was his \"compelling\" evidence?",
    "The evidence is compelling now.\"",
    "\"I’ll just say it, Brian.",
    "The case remains pending.",
    "It isn’t."
  ]
}