{
  "id": 25793,
  "mediaId": 2688,
  "date": "2022-03-16",
  "headline": "Ohio GOP Senate Candidate Boosts Bunk Race Science, Makes Racist Comments About Asians",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2022/03/mike-gibbons.jpg",
  "link": "https://talkingpointsmemo.com/news/ohio-gop-senate-candidate-mike-gibbons-bunk-race-science-racist-comments-asians-bell-curve-charles-murray?utm_source=rss&utm_medium=rss&utm_campaign=ohio-gop-senate-candidate-mike-gibbons-bunk-race-science-racist-comments-asians-bell-curve-charles-murray",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Cabrera",
  "authorUrl": "https://talkingpointsmemo.com/profile/cristina_cabrera",
  "termIds": [
    13506,
    13942,
    14030,
    13312,
    13372,
    14272
  ],
  "sentences": [
    "“And when we ran into a word problem — and you know, I think this is a function of the educational track they put them on — they got lost in the weeds.”\nWhen Gibbons’ co-host claimed Chinese people weren’t properly educated on critical thinking, the businessman said that “they’re very good at copying.”\nSamantha Cotten, a spokesperson for Gibbons’ campaign, told the New York Times that the candidate was “discussing the difference in educational structure and attainment that he experienced in both business and graduate school in relation to China.”\nThe businessman is currently leading the GOP primary in the Senate race at 22 percent against four other candidates, per a Fox News poll that came out last week.",
    "“And then right below them was basically everybody in China, India and, you know, throughout the Asian countries.”\n“The Bell Curve,” co-authored by political scientist Charles Murray and Richard Herrnstein, argues that intelligence is determined by race, and it has been widely criticized for its lack of any real scientific evidence and for laundering white supremacist ideology.",
    "Gibbons also claimed in the podcast that one of his business school classes was made up of “mostly Asians.” He then boosted “model minority” stereotypes about his Asian classmates, saying he was impressed with how much they studied and thought they “were incredibly bright.”\n“But they memorized formulas,” he said.",
    "“I’ve often thought that when I’ve run into Asians they’re all — you know, if you’ve ever read ‘The Bell Curve,’ it’s a book, a very controversial book, I can’t even remember who wrote, I think his name is Murray wrote this book — and it said that the smartest people in the world as far as measurable I.Q.",
    "Rob Portman’s (R-OH) seat, made racist remarks about people of Asian descent during one of his podcasts in 2013, citing debunked conspiracy theories in a pseudoscientific book, the New York Times found.",
    "Investment banker Mike Gibbons, a top Republican contender in the race for outgoing Sen.",
    "Ex-Ohio treasurer Josh Mandel is right behind Gibbons at 20 percent.",
    "were Ashkenazi Jews,” Gibbons said."
  ]
}