{
  "id": 25863,
  "mediaId": 2688,
  "date": "2022-02-16",
  "headline": "TFW Your Insurrection Fails And You Have To Settle For Olive Garden",
  "image": "https://talkingpointsmemo.com/wp-content/uploads/2019/10/GettyImages-674249800-scaled.jpg",
  "link": "https://talkingpointsmemo.com/morning-memo/stewart-rhodes-oath-keepers-insurrection-act-trump-olive-garden?utm_source=rss&utm_medium=rss&utm_campaign=stewart-rhodes-oath-keepers-insurrection-act-trump-olive-garden",
  "mediaOutlet": "Talking Points Memo",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cristina Cabrera",
  "authorUrl": "https://talkingpointsmemo.com/profile/cristina_cabrera",
  "termIds": [
    13538,
    13764,
    13802,
    13803,
    13819,
    13822,
    13286,
    13368
  ],
  "sentences": [
    "Okay, my attempt to invoke that meme is sorta clumsy, but that doesn’t make Hawley’s defense of a mug he’s selling that glorifies the infamous moment he fist-pumped the Trump protesters on Jan. 6 any less lazy: The senator told HuffPost on Tuesday that the mug “is not a pro-riot mug” and “at the time that we were out there, folks were gathered peacefully to protest.” Oh, okay then.",
    "Ice Fishing-Prostitution Mayor Quits\nRepublican Mayor Craig Shubert of Hudson, Ohio resigned on Monday, less than a week after a city council meeting where he sounded the alarm over the moral turpitude that comes with allowing people to go ice fishing in a local park, which will lead to ice fishing shanties, which are, as everyone knows, magnets for prostitutes.",
    "Sandy Hook Families Reach Historic $73 Million Settlement With Gun Manufacturer\nThe families of the Sandy Hook Elementary School massacre victims agreed to a $73 million settlement on Tuesday in their lawsuit against Remington, the maker of the Bushmaster AR-15-style rifle that was used in the shooting, and Remington’s insurance companies.",
    "Trump Campaign Coordinated Fake Electors Scheme, Jan. 6 Panel Says\nIn another sweeping round of subpoenas on Tuesday, the House Jan. 6 Committee accused the Trump campaign of being directly involved in the plot to convince state Republicans to gather fake Trump electors as part of a broader attempt to undo Biden’s win.",
    "Standing By, As Trump Said\nAttorneys for Oath Keepers leader Stewart Rhodes, who’s been charged with seditious conspiracy in connection to the Jan. 6 Capitol attack, said in a recent court filing that Stewart and his Oath Keeper buddies were waiting for Trump to invoke the Insurrection Act that day.",
    "Shubert insisted in a statement on Monday that he was just making an attempt at dry humor that was “grossly misunderstood.” The mayor claimed to be a victim of “the politics of personal destruction by means of character assassination.”\nIcefishinggate wasn’t Shubert’s only, uh, controversy recently.",
    "Fun fact: She’s now selling a book titled “Justified: The Story of America’s Audit,” in which she apparently tries to explain why the sham election audit commissioned by Arizona Senate Republicans was justified despite it finding no evidence of fraud whatsoever.",
    "30th House Dem Announces Retirement\nRep. Kathleen Rice (D-NY) announced on Tuesday that she won’t be seeking reelection at the end of her term, ticking the number of retiring House Democrats up to 30 ahead of the 2022 midterms.",
    "The mayor’s resignation comes a few months after he raised hell over what he called “pornographic content” in a school textbook, earning him an endorsement from Ohio GOP Senate candidate Josh Mandel at the time.",
    "The lawyers also argued that Stewart’s co-conspirator, Edward Vallejo, was too fat, old and unhealthy to pose a real threat as an alleged “quick reaction force” (QRF) in the plot described by prosecutors.",
    "Rice’s seat in New York’s 4th congressional district has been held by a Democrat since 1997 (Rice took office in 2015), and she beat her GOP challenger by more than 10 points in the 2020 elections.",
    "Hawley Insists His Fist-Pump Mug Isn’t Pro-Insurrection\nSen. Josh Hawley’s (R-MO) “I’m not pro-insurrection” mug has people asking a lot of questions already answered by his mug.",
    "The families, who filed the suit in 2014, accused Remington of being partially responsible for the massacre with its marketing strategy of glorifying the weapon as a war tool.",
    "US Reaches More Than 1 Million ‘Excess Deaths’ In Pandemic\nThe U.S. has seen 1,023,916 deaths above normal since the pandemic started, the CDC reports.",
    "13 House Republicans are leaving, too, according to what the House Press Gallery refers to as its “Casualty List.”\nThat’s not a good name for it.",
    "Rhodes and the other Oath Keepers were only at the Capitol to “defend that declaration” if Trump were to invoke it, the lawyers said.",
    "Graphic Design Is My Passion\nWas there really no other McConnell photo the Senate Republicans Instagram could’ve used for this?",
    "Two Trump campaign officials were subpoenaed: Director of Election Day Operations Michael Roman and his deputy, Gary Brown.",
    "When Trump didn’t do that, Rhodes and the other Oath Keepers gave up and went to Olive Garden, according to the lawyers.",
    "The rest were due to heart disease, hypertension, dementia and other illnesses exacerbated by the pandemic.",
    "Arizona GOP chair Kelli Ward was also among those to get slapped with a subpoena yesterday.",
    "The settlement was filed in bankruptcy court, an attorney for the families told CNN.",
    "920,000 people have died from COVID as of today, according to the CDC’s tracker.",
    "The Olive Garden thing came up like four times in that filing, actually.",
    "Most of those “excess deaths” were caused by COVID-19, the CDC said.",
    "Remington has gone bankrupt.",
    "Here are some of the things.",
    "This is TPM’s Morning Memo.",
    "A lot of things happened.",
    "Do you like Morning Memo?",
    "Let us know!"
  ]
}