{
  "id": 25888,
  "mediaId": 2550,
  "date": "2022-04-06",
  "headline": "Josh Mandel stoops to low of trying to defile MLK legacy. King's daughter isn't having it",
  "image": "https://images.dailykos.com/images/1056406/story_image/Bernice_King.jpeg?1649269824",
  "link": "https://www.dailykos.com/stories/2022/4/6/2090422/-Josh-Mandel-stoops-to-low-of-trying-to-defile-MLK-legacy-King-s-daughter-isn-t-having-it?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13453,
    13803,
    13832,
    13897,
    14138,
    13154,
    13285,
    14221,
    14298
  ],
  "sentences": [
    "— Kevin M. Kruse (@KevinMKruse) April 6, 2022\nKruse tweeted that Martin Luther King Jr.’s requests for gun permits were denied “not because the sheriff was anti-gun, but because he was a racist … And when racists are in charge of administering seemingly race-neutral laws, they often apply them in uneven ways that reflect their racism,” Kruse said in the tweet.",
    "A framework for interpreting law that maintains racism has an undeniable effect on the legal foundation of American society, the theory would be pretty exclusively confined to law schools if not for Republicans attempting to redefine it as anything that makes white people feel bad about racism.",
    "Instead of focusing on his race or perhaps in service to racist supporters, Mandel tweeted Bernice King on Tuesday that her father, who an assassin shot and killed on April 4, 1968 on the balcony of the Lorraine Motel in Memphis, Tennessee, \"knew the importance of the Second Amendment.\"",
    "RELATED: One of the most mendacious Senate candidates we've ever encountered is back for another run in Ohio\nMandel claimed Martin Luther King Jr. \"tried to exercise his right to self-defense and was wrongly denied a gun permit by anti-gun racists … Firearms ?",
    "The response from Southern racists and law enforcement at the Edmund Pettus Bridge was repeated beatings, teargas bombings, and deadly encounters so violent that the scene televised for the country to witness on Sunday, March 7, 1965 was dubbed Bloody Sunday.",
    "\"I know everyone's aghast at Mandel having the gall to lecture MLK's own daughter @BerniceKing about MLK's legacy, but I want to focus on the second part here, about how MLK was 'wrongly denied a gun permit by anti-gun racists,'\" Kruse tweeted.",
    "So, no, King was not some kind of strong supporter of the Second Amendment and, given the fact that he was assassinated by a firearm, it seems bizarre -- and almost willfully mean-spirited -- to insist to his daughter that he was.",
    "It’s unclear how a GOP candidate could be so bold as to contact the daughter of a civil rights legend like Dr. Martin Luther King Jr. at all, let alone to do so claiming he knows more about her father’s legacy than she does.",
    "Register: https://t.co/f0yu3u8jGd https://t.co/It6a84i6Ec\n— Be A King (@BerniceKing) April 5, 2022\nNo, apparently he “did two tours in Anbar Province fighting alongside Marines of every color to come home” and be a racist.",
    "\"Josh: Regretfully, I do not believe that I or @TheKingCenter legitimately motivated you to film this ad, as it is in opposition to nonviolence and to much of what my father taught,\" Bernice King responded on Twitter.",
    "In the ad, Mandel is shown walking across the Edmund Pettus Bridge, the historic landmark King led more than 2,000 Black and white protesters across in Selma, Alabama, to advocate for the federal Voting Rights Act.",
    "Bernice King, the daughter of the late Dr. Martin Luther King Jr., attends the 2022 King Holiday Observance Beloved Community Commemorative Service at Ebenezer Baptist Church on Jan. 17, 2022 in Atlanta, Georgia.",
    "The social media post was part of a thread started by Mandel when he thanked Bernice King and the King Center, a nonprofit dedicated to nonviolent social change, for motivating his latest campaign ad.",
    "x\nJosh: Regretfully, I do not believe that I or @TheKingCenter legitimately motivated you to film this ad, as it is in opposition to nonviolence and to much of what my father taught.",
    "https://t.co/cJBGi6StXG\n— Henry J. Gomez (@HenryJGomez) April 5, 2022\n“Martin Luther King marched right here so skin color wouldn’t matter,” Mandel said erroneously.",
    "He added, citing King Institute research:\nEarly in the Montgomery campaign, when King was still formulating a philosophy of nonviolence, his house was bombed.",
    "Kevin Kruse, a historian and New York Times bestselling author, posted a thread on Twitter giving Mandel exactly the history lesson he so desperately needs.",
    "And when racists are in charge of administering seemingly race-neutral laws, they often apply them in uneven ways that reflect their racism.",
    "It turned out to be a fortunate decision, because it deepened King's commitment to nonviolent direct action as the best path to progress.",
    "In that brief moment, King asked the local sheriff to approve gun permits for the men guarding him, but the sheriff denied the request.",
    "Josh Mandel is a former Ohio state representative and state treasurer recently endorsed in the Ohio Senate race by Sen. Ted Cruz.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "\"I didn't do two tours in Anbar Province fighting alongside Marines of every color to come home and be called a racist.\"",
    "x\nMLK's requests were denied not because the sheriff was anti-gun, but because he was a racist.",
    "As he later put it, \"I was much more afraid in Montgomery when I had a gun in the house.\"",
    "“That's what Critical Race Theory stresses!”\nThis is a short blurb about Daily Kos.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "She included a link to nonviolence training at the King Center Institute.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Mandel evoked the memory to vocalize opposition to critical race theory.",
    "Study your history better @BerniceKing,\" Mandel added in the tweet.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "\"I encourage you to study my father/nonviolence in full.\"",
    "I encourage you to study my father/nonviolence in full.",
    "But hey, there’s a reason they call it white privilege.",
    "x\nHere's JD Vance's ad, announced earlier.",
    "That's what Critical Race Theory stresses!",
    "Mandel's is already airing on TV.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Vance's starts tomorrow.",
    "Daily Kos is different.",
    "Please read it.",
    "violence.",
    "...",
    "..."
  ]
}