{
  "id": 25889,
  "mediaId": 2636,
  "date": "2022-02-15",
  "headline": "The liberal group American Bridge is launching a new project to collect information for campaigns against Republicans running for state and local offices.",
  "image": "https://static01.nyt.com/images/2022/02/15/multimedia/15onpolitics-voting/15onpolitics-voting-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/15/us/politics/opposition-research-goes-hyperlocal.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13510,
    13592,
    13640,
    13776,
    14031,
    13149,
    13312
  ],
  "sentences": [
    "The group has hired 22 researchers to scrub the records and public statements of candidates and officials running for statewide offices involved in election administration, along with the sort of races unlikely to garner attention outside of their communities: county boards of supervisors, boards of canvassers, local judges and state legislators.",
    "“It’s about how do we take what we’ve already been expert at and expose the behavior of Republican candidates and officeholders and take it down ballot to these secretaries of state races, the attorneys general races, as well as on down the ballot to the county level,” said Jessica Floyd, the American Bridge president.",
    "Rick Hasen, the author of several books about elections and democracy, said the use of such hardball political tactics in local elections was “probably a necessary evil.” He added: “Efforts to subvert elections can happen in lots of places.”\nThe Democrats are starting from behind in this effort.",
    "We’re figuring out what’s the information that we have and how to disseminate that information in order to win as many elections as possible.”\nSome of what American Bridge finds will be handed to news organizations, sometimes with and sometimes without the organization’s fingerprints attached.",
    "Now, the Democratic organization American Bridge, known primarily for its opposition research into Republicans, has launched what it says is a $10 million campaign to influence the races for election administration in a dozen key states.",
    "There is plenty of evidence that Republicans — more than half of whom remain convinced of Trump’s lie that the 2020 presidential election was marred by fraud — are more motivated than Democrats by concerns about the voting system.",
    "‘You want to win these elections’\nFloyd, who worked for a handful of Washington’s major Democratic organizations and was an aide to Representative Gabrielle Giffords, said their tactics will help motivate base Democrats.",
    "“We’re not making an assumption that voters are going to be paying attention to how a race impacts the future of American democracy, because that’s not necessarily how people are treating the ballot box,” Floyd said.",
    "One of its more prolific researchers maintains a Twitter account devoted to monitoring every local radio interview and television appearance by Senator Ron Johnson of Wisconsin and Republican Senate candidates.",
    "The House committee investigating the Jan. 6 riot at the U.S. Capitol issued a fresh batch of subpoenas, Luke Broadwater reports, including of two top Trump campaign officials and several state legislators.",
    "In 2021, the Republican State Leadership Committee, which invests in state legislative and secretary of state races, raised $33 million, a record for a year in which most states didn’t hold state elections.",
    "To the alarm of independent experts, allies of Donald Trump have been targeting these once-anonymous offices, seeking to fill them with hard-core partisans all the way down to the level of precinct captain.",
    "In Wisconsin alone, there are 1,850 municipal clerks who administer voting, with rules set by a bipartisan six-member state commission, whose members are appointed by state legislators and the governor.",
    "Charlie Savage explains a mysterious filing by John H. Durham, the Trump-era special counsel who has been investigating the federal probe of Russian interference in the 2016 presidential election.",
    "Opposition Research Goes Hyperlocal\nThe liberal group American Bridge is launching a new project to collect information for campaigns against Republicans running for state and local offices.",
    "Both ads employed rhetoric that appeals to a smaller segment of the electorate, the most fervent Republican primary voters, even though a much more expansive audience actually watched it.",
    "The Democratic counterpart, the Democratic Legislative Campaign Committee, took in $21 million, which it too crowed was the most ever in an off-year, but well behind the Republicans.",
    "U.S. officials are using creative methods to try to understand the thinking of Vladimir Putin, Russia’s enigmatic leader, report David E. Sanger, Julian E. Barnes and Eric Schmitt.",
    "Robert Robb, a columnist for The Arizona Republic, pointed out what was the dual audience that Lamon was speaking to — Donald Trump’s most fervent supporters and Trump himself.",
    "But she added that the American Bridge researchers are in search of information that they believe voters will use to disqualify Republicans from winning local elections.",
    "Kari Lake, a Trump-endorsed candidate for Arizona governor, called on school districts to install cameras to monitor teachers in classrooms in a local radio interview.",
    "Jim Lamon, a candidate in Arizona, aired a Wild-West-themed ad in which he shoots at Biden, Nancy Pelosi and Senator Mark Kelly, who is up for re-election this year.",
    "Dave McCormick, a Pennsylvania Republican, aired an ad that repeated a crowd chanting the “Let’s Go Brandon” anti-Biden phrase for nearly the entire 30-second spot.",
    "And, in Arizona, the Trump presidency coincided with Republicans losing both U.S. Senate seats and only narrowly preserving their majority in the State Legislature.",
    "It cost the Lamon campaign $25,000 to place an ad in Tucson, Ariz., during the Super Bowl, according to AdImpact, a firm that tracks television ad spending.",
    "What to read\nJennifer Medina and Lisa Lerer profile Josh Mandel, a Republican Senate candidate of Ohio, and his political journey to the far right.",
    "When a member of Congress makes false claims about hacked voting machines or stolen ballots, he or she has little authority to do much about it.",
    "“The people running for Senate in Arizona are all trying to win the Trump primary, not necessarily the Republican Party primary,” Robb told us.",
    "Lamon tried to show that he’s wealthy enough to afford a Super Bowl ad to “communicate this very narrow reach message,” Robb said.",
    "One repeated a phrase that has become code for a slur against President Biden, and the other showed a candidate shooting at him.",
    "Some of the loudest Stop the Steal voices on the right are actually far removed from the levers of America’s election machinery.",
    "Elsewhere, it might mean amplifying an untoward statement from a local radio station that would have otherwise gone unnoticed.",
    "The sheer scale of America’s decentralized election system presents a formidable challenge to anyone seeking to influence it.",
    "Across the United States, however, there are tens of thousands of state, county and local officials who do have that power.",
    "They will set and enforce the rules on voting, then go about counting and reporting the votes in the elections to come.",
    "Framework\nPrimary matchups at the Super Bowl\nIt’s nothing new for politicians to use the Super Bowl to gain exposure.",
    "The local elections project is part of a $100 million paid media campaign that American Bridge announced a year ago.",
    "Trump drove record turnout in Arizona, Robb said, but it wasn’t just his supporters who came out in record numbers.",
    "There’s a chance that ads like these end up backfiring on the Republican candidates during the general election.",
    "It’s an expensive way, in other words, to get the former president’s attention and his possible endorsement.",
    "They plan to dig up dirt on officials and candidates to ruin their chances of getting elected or re-elected.",
    "“But it does alienate the majority of the Arizona electorate.”\nIs there anything you think we’re missing?",
    "In the ad, the three Democrats are armed and prepared to duel, but Lamon shoots down their weapons.",
    "The group took credit for the story being reported in the Arizona Republic and other local outlets.",
    "But on Sunday, two ads that went after the president pushed the boundaries of anti-Biden rhetoric.",
    "For statewide candidates, American Bridge plans to hire “trackers” to follow them with cameras.",
    "In what seems to be an effort at slapstick humor, the trio runs away, unscathed and disarmed.",
    "In some communities, she said, that might be a commissioner who didn’t pay property taxes.",
    "McCormick’s campaign spent $70,000 to place the ad in the Pittsburgh media market.",
    "But more and more, American Bridge has been pushing its research on its own.",
    "Both Lamon and McCormick ran in states that Biden won in 2020.",
    "The two Republicans behind the ads are running for Senate.",
    "Lamon had previously aired another “Let’s Go Brandon” ad.",
    "And there has been a Republican financial advantage.",
    "“We should be exposing bad behavior,” Floyd said.",
    "Email us at onpolitics@nytimes.com.",
    "His opponents turned out as well.",
    "Anything you want to see more of?",
    "“You want to win these elections.",
    "We’d love to hear from you."
  ]
}