{
  "id": 25933,
  "mediaId": 2916,
  "date": "2022-03-19",
  "headline": "Ohio GOP Senate Candidates Have Heated Face-to-Face Exchange during Debate",
  "image": "https://www.nationalreview.com/wp-content/uploads/2021/03/josh-mandel.jpg?fit=2057%2C1200",
  "link": "https://www.nationalreview.com/news/ohio-gop-senate-candidates-have-heated-face-to-face-exchange-during-debate/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brittany Bernstein",
  "authorUrl": "https://www.nationalreview.com/author/brittany-bernstein/",
  "termIds": [
    13755,
    13803,
    13942,
    13283,
    13312,
    13372,
    14243,
    14246,
    14317
  ],
  "sentences": [
    "He doesn’t have the temperament, experience, or fortitude to be a U.S. senator and Ohio voters got a firsthand look at just how unprepared Josh Mandel is to be a leader and that will be reflected at the ballot on May 3.”\nMeanwhile, Mandel’s campaign manager said Gibbons “got upset tonight that he was called out for his investments in Chinese oil.”\n“He claims not to remember the investment, but it’s part of a pattern of Gibbons’ entire career making money by taking American companies and selling them to foreign interests,” campaign manager Scott Guthrie said.",
    "“While Ohioans are struggling to make ends meet in Joe Biden’s America, Mike Gibbons spent his entire career profiting by shipping jobs overseas and investing in places like China and Russia.”\nA Fox News poll earlier this month found Gibbons, an investment banker from the Cleveland area, and Mandel, a former state treasurer, are leading among seven candidates on the ballot in the Republican primary.",
    "— Heartland Signal (@HeartlandSignal) March 18, 2022\nAfter the debate, a spokesperson for Gibbons said Mandel “is unhinged, unfit and flailing — because he’s losing.”\n“He is only a professional at one thing: running for office,” said spokeswoman Samantha Cotten.",
    "Gibbons then said Mandel has never worked in the private sector, causing Mandel to rise from his seat and get in Gibbon’s face during the primary forum hosted by FreedomWorks outside of Columbus.",
    "Two Republican candidates for U.S. Senate in Ohio had a heated exchange during a primary debate on Friday, with the pair arguing in each other’s faces until a moderator pulled them apart.",
    "Other Republican candidates in the race to replace retiring Senator Rob Portman include Ohio state Senator Matt Dolan, former state GOP chair Jane Timken and venture capitalist J.D.",
    "“We encourage every voter to watch this forum and see for themselves why these Republicans do not deserve to be in the United States Senate,” spokesperson Michael Beyer said.",
    "The incident between candidates Josh Mandel and Mike Gibbons began with Mandel saying Gibbons had “made millions” from business dealings with Chinese companies.",
    "Meanwhile, the Ohio Democratic Party released a statement calling the Republican senate primary race a “cavalcade of clowns” after Friday night’s debate.",
    "The primary is currently scheduled for May 3, but could be pushed back because of court challenges to the state’s redistricting plans.",
    "Gibbons had the backing of 22 percent of voters, while Mandel had the support of 20 percent of voters, the poll found.",
    "Mike Gibbons and Josh Mandel get in each other’s faces at tonight’s GOP #OHSen forum hosted by FreedomWorks.",
    "“Two tours in Iraq, don’t tell me I haven’t worked!” Mandel replied.",
    "A moderator ultimately steps in to pull the two apart.",
    "“He is hellbent on lying because he is failing.",
    "“You don’t know squat,” Gibbons said.",
    "Vance."
  ]
}