{
  "id": 25967,
  "mediaId": 2549,
  "date": "2022-04-06",
  "headline": "‘I encourage you to study my father’: MLK’s daughter blasts far-right Republican who invoked her father in pro-gun, anti-critical race theory campaign ad",
  "image": "https://uploads.dailydot.com/2022/04/josh-mandel-bernice-king.jpg?auto=compress&fm=pjpg",
  "link": "https://www.dailydot.com/debug/bernice-king-josh-mandel-mlk-critical-race-theory/",
  "mediaOutlet": "Daily Dot",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Claire Goforth",
  "authorUrl": "https://www.dailydot.com/author/claire-gofortht/",
  "termIds": [
    13453,
    13803,
    13832,
    13897,
    13312,
    13372,
    14357
  ],
  "sentences": [
    "Historian Kevin M. Kruse pointed out, “If Mandel bothered to read the speech that King gave for that march—instead of shamelessly using it for a photo op—he would’ve seen that King argued that American history was one deeply riven by racism and the abuse of the law for racist ends.” This philosophy is reflected in critical race theory.",
    "Mandel adds that he didn’t serve in the military “to come home and be called racist” and that “there’s nothing racist about stopping critical race theory and loving America.”\nAn announcer goes on to describe Mandel as “pro-God, pro-gun and pro-Trump.”\nThe ad concludes with Mandel saying, “You want a fighter?",
    "In a subsequent quote-tweet, he tagged Bernice King and the Martin Luther King, Jr. Center and thanked both for “motivating me to film this ad.”\nBernice King, MLK Jr.’s youngest daughter, pushed back on Mandel’s claim that her father’s legacy inspired him.",
    "“From that point on, I no longer needed a gun nor have I been afraid.”\nAround this point in his life, MLK Jr. began to embrace the nonviolent civil disobedience and pacifism that would ultimately define much of his legacy.",
    "Martin Luther King Jr.’s daughter pushed back on a Republican political candidate’s claim that her father’s legacy inspired him to create a campaign ad blasting critical race theory and praising guns.",
    "The ad begins with a woman saying, “Critical race theory is crap.” Critical race theory is the study of United States history through a lens that includes the impact of slavery and systemic racism.",
    "“Josh: Regretfully, I do not believe that I or @TheKingCenter legitimately motivated you to film this ad, as it is in opposition to nonviolence and to much of what my father taught,” King tweeted.",
    "Mandel’s ad segues to a shot of him standing on Edmund Pettus Bridge in Selma, Alabama, which King and other civil rights demonstrators crossed during an historic march in 1965.",
    "In a follow-up tweet, Mandel insisted that MLK Jr. was pro-gun, as evidenced by him applying for, and being denied, a gun permit after his home was bombed.",
    "“Sometimes I engage with individuals who are misusing my father to educate more people (who read the exchanges) on his teachings,” she wrote.",
    "“When I decided that I couldn’t keep a gun, I came face-to-face with the question of death and I dealt with it,” her father wrote.",
    "King replied with a quote in which her father said he was “much more afraid” when he had guns in the house.",
    "Mandel was unmoved by assertions that he deliberately or unintentionally misread MLK Jr.’s teachings.",
    "“Imagine telling MLK’s daughter to study his history better,” wrote one in a widely shared sentiment.",
    "Bernice King also addressed her back-and-forth with Mandel in a subtweet Tuesday afternoon.",
    "“I encourage you to study my father/nonviolence in full.”\nShe included a link the center.",
    "“Martin Luther King marched right here so skin color wouldn’t matter,” Mandel says.",
    "Far-right candidate Josh Mandel is running for the United States Senate in Ohio.",
    "“And I will always extend an invitation to learn.”\n“It’s okay :-).",
    "Send in the Marine.”\nMandel tweeted the ad Tuesday morning.",
    "Reactions to Mandel’s tweet were overwhelmingly negative.",
    "Study your history better @BerniceKing,” Mandel tweeted.",
    "On Tuesday, Mandel released his latest campaign ad.",
    "Others piled onto Mandel’s tweet in the comments.",
    "Don’t feel compelled to defend me.”",
    "“Firearms ?",
    "violence."
  ]
}