{
  "id": 25964,
  "mediaId": 2548,
  "date": "2022-03-29",
  "headline": "Tim Ryan, Former Democratic Candidate For President, Focuses On One Big Issue Trump Always Talked About In New Campaign Ad",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/03/tim-ryan-scaled-e1648572534279.jpg",
  "link": "https://dailycaller.com/2022/03/29/tim-ryan-china-ad-ohio-senate-donald-trump/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Ginsberg",
  "authorUrl": "https://dailycaller.com/author/michael.b.ginsberg1998@gmail.com",
  "termIds": [
    13592,
    13803,
    14153,
    13191,
    13197,
    13312,
    14317,
    14325,
    14361
  ],
  "sentences": [
    "Republican State Sen. Matt Dolan, who is polling in fifth place, released an ad in January claiming that the U.S. is in a “cold war” with China, which he said would be his “priority in the U.S. Senate.”\nDuring his short-lived presidential run, Ryan said that “President Trump was onto something when he talked about China,” adding that the country “has been abusing the economic system for a long time.” He also described Joe Biden as “stunningly out of touch” for claiming that China was “not competition” for the U.S.",
    "The ad, Ryan’s first of the 2022 election cycle, featured Tuesday the candidate calling out “Washington” for “wasting our time on stupid fights” while “China is out-manufacturing us left and right.” Ryan’s campaign spent $3.3 million buying time for the ad, which will run through the May 3 Democratic primary for Ohio’s open Senate seat to May 17.",
    "All major Republican candidates have expressed opposition to trade with China, and top two candidates Mike Gibbons and Josh Mandel nearly came to blows at a March 18 debate over Mandel’s accusation that Gibbons traded Chinese petroleum stock.",
    "Facing off against former Consumer Financial Protection Bureau employee Morgan Harper and tech executive Traci Johnson, Ryan is the favorite to win the Democratic nomination.",
    "In one, the campaign claimed that Joe Biden would “stand up for China,” while noting Hunter Biden’s business dealings with a Chinese private equity firm.",
    "Democratic Ohio Rep. Tim Ryan’s new campaign ad, titled “One Word,” echoes the rhetoric of former President Donald Trump on U.S. competition with China.",
    "pic.twitter.com/TVa2qPiQOy\n“They promised us higher wages and lower prices,” Ryan says in the ad, first slated to run on local television Monday.",
    "(RELATED: Hillary Clinton Returns To Politics With $2,900 Minimum Donation Fundraiser For Dem Senate Candidate)\nIt’s us vs. China.",
    "The Trump campaign and allies ran several ads during the 202o election cycle addressing U.S. policy towards China.",
    "Another ad, run by the Super PAC America First Action, claimed that “to stop China, you have to stop Joe Biden.”",
    "“Instead, we got pink slips and now price increases.”\n“China is winning and now workers are losing.",
    "Are you?”\nRyan’s ad signals that the Senate race will feature bipartisan agreement on China.",
    "China is out-manufacturing us left and right and it’s time we fight back.",
    "We’ve got to go all in and it starts by investing in Ohio workers.",
    "We won’t back down from this fight.",
    "Capitalism versus communism.",
    "Never bet against Ohio.",
    "I’m not backing down.",
    "It’s us versus them."
  ]
}