{
  "id": 26035,
  "mediaId": 2752,
  "date": "2022-04-07",
  "headline": "Maybe We Are Better Off Without Political Debates",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY0NzM0OS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY4MjYwODI1MH0.T4gZYwCnnWHj3xiNGno1OI37XDI0d7fATxvYyYScSxg/img.png?width=1200&coordinates=0%2C0%2C0%2C16&height=600",
  "link": "https://www.wonkette.com/maybe-we-are-better-off-without-political-debates",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    13531,
    13689,
    13764,
    13765,
    13803,
    13870,
    13942,
    14021,
    13312
  ],
  "sentences": [
    "At a Trump rally in March, Walker claimed he was running because he was \"sick and tired of them wanting to teach CTR in school.” He’s also said he was running to stop \"cancel culture.”\nWALKER: We gotta get out of this cancel culture, because in the First Amendment, it gives you the right to say what you want to say.",
    "In Nebraska, Jim Pillen, another gubernatorial candidate, turned down offers to debate his opponents in March, telling ABC News debates amount to \"political theater.”\nJim Pillen isn’t wrong: Political debates often descend into barroom brawls or Oscar stage slap fests.",
    "Forbes detailed Donald Trump’s marathon of lies in an article titled “The Biggest Falsehoods Of The Final Trump-Biden Presidential Debate” instead of “The Current President Is A Pathological Liar Unfit To Remain In Office.” Biden gained nothing from these ordeals.",
    "ABC News reports that more than a \"half dozen GOP candidates in crucial state and federal races have either skipped out on or not committed to primary debates.”\nJoe Lombardo, a gubernatorial candidate in Nevada, turned down a chance to debate in January.",
    "PREVIOUSLY: All Fun And Games Until Ohio GOP Senate Candidate Starts Calling Opponent A 'Pussy'\nLast month, Republicans Josh Mandel and Mike Gibbons almost came to blows at Ohio's Senate GOP primary debate.",
    "The press also felt it necessary for Joe Biden to shoulder some of the blame for the disastrous first debate where Donald Trump shouted insults at Biden while exposing him to COVID-19.",
    "He claimed he had a “prior commitment,” like he was trying to avoid a cousin’s boring “game night.” David McCormick also blew off the debate once he learned Oz wasn’t coming.",
    "Republicans can just shout rightwing talking points and lies, and the press will still nitpick a Democratic candidate’s slightly exaggerated wording.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Besides, according to Fetterman’s communications director, he doesn’t need a debate stage to convince voters he’s not like other politicians.",
    "It’s obvious as \"soon as they see him step out of his truck.”\nModern debates offer no compelling reason for frontrunners to participate.",
    "Right now I want everybody to stand up and say “the buck stops here.” The buck’s gotta stop with Herschel Walker because I love America.",
    "His opponents Rep. Conor Lamb and state Rep. Malcolm Kenyatta spent the whole evening obsessed with a key figure who never shows.",
    "Debates stopped serving a constructive purpose once the media gave up and started covering them like cage matches.",
    "He’s probably saving his intellectual strength for when he faces incumbent Democratic Senator Raphael Warnock.",
    "Their production of Waiting for Fetterman didn’t wow voters and fundamentally alter the dynamics of the race.",
    "In Georgia, GOP Senate candidate Herschel Walker refuse to debate his primary opponents, who I presume exist.",
    "Republican Senate candidate Mehmet Oz skipped his party’s first Pennsylvania primary debate in January.",
    "Mandel, 44, got up into the 69-year-old Gibbons’s grill and said: \"You’re dealing with the wrong guy.",
    "As Kenyatta demonstrated last week, it’s just as easy to take pot shots at an empty podium.",
    "[ABC News]\nYr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "John Fetterman also skipped the first Democratic Senate primary debate in Pennsylvania.",
    "He’s better off staying at home in 2024, and voters might as well watch Bridgerton.",
    "He’s got to make sure he says “CRT” correctly, as that’s tripped him up recently.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "Kenyatta also paused to give the absent Fetterman time to respond.",
    "That’s a boss move from my brother but he’s still coming in third.",
    "If you don’t agree with the Left, you’re gonna be canceled out.",
    "Republicans don’t seem to think debates are worth their time.",
    "You watch what happens.”\nThis has nothing to do about policy.",
    "I love theatre, but this isn’t even good political theatre.",
    "He's also on the board of the Portland Playhouse theatre.",
    "He didn’t think the crowd of 175 people was big enough.",
    "How is Warnock supposed to debate this tree stump?",
    "Fetterman remains the undisputed frontrunner.",
    "His son describes him as a “play typer guy.\"",
    "That just hurts the other guests’ feelings.",
    "Please click the clickie, if you are able.",
    "He probably shouldn’t show up, either.",
    "That’s the reason I decided to run.",
    "How often would you like to donate?",
    "He prefers larger venues, I guess.",
    "This isn’t limited to Republicans.",
    "You watch what happens, pussy.",
    "He writes reviews for the A.V.",
    "Last Sunday, Lt. Gov.",
    "It’s all posturing.",
    "That's you!"
  ]
}