{
  "id": 26064,
  "mediaId": 2699,
  "date": "2022-02-09",
  "headline": "MAGA Extremists Slam the Upcoming Super Bowl Halftime Show as ‘Satanic’",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1644374046/220208-fever-dreams-football_mr7fpw",
  "link": "https://www.thedailybeast.com/maga-extremists-slam-the-upcoming-super-bowl-halftime-show-as-satanic?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Daily Beast",
  "authorUrl": "https://www.thedailybeast.com/author/the-daily-beast-branded",
  "termIds": [
    13419,
    13475,
    13485,
    13599,
    13768,
    13803,
    13898,
    14101,
    14171
  ],
  "sentences": [
    "It’s that time of year again for the Super Bowl halftime show and while the 2022 lineup of Dr. Dre, Snoop, Mary J. Blige and Eminem reads to most fans like a warm and fuzzy 1990s nostalgia bath, “to hear certain conservative commentators describe it,” notes Fever Dreams co-host Kelly Weill, “this Super Bowl is ripe for Satanism.”\nWith Stop-the-Steal fanatics like Arizona wingnut Wendy Rogers hyperventilating that the Super Bowl show exposes children to “evil, wicked, Satanic” things (her words), there’s a very real “performance-related Satanic Panic that’s been brewing for a little while now in the U.S.,” Weill says, adding that the same fears bubbled up after the deadly Travis Scott concert at Astroworld in December.",
    "“They’re not explicitly linked but somehow whenever a Black artist takes the field… it’s evil, it’s Satanic, and I don’t think there’s any doubt that the people pushing the Travis Scott Satanic Panic conspiracy theories were also not reacting one of the most popular Black artists of the current moment.”\nIn any case, and perhaps proving the point, as podcast co-host Asawin Suebsaeng points out, Snoop Dogg and Dre are way less Satanic than Aerosmith’s 2001 halftime show with Britney Spears.",
    "When you're talking about Joe Rogan, they talk about him a ‘threat to corporate media’… I mean, none of that makes sense if you look at it for less than half a second, because Joe Rogan IS corporate media, right?”\nAnd finally, comedian, commentator and co-host of The Daily Beast’s The New Abnormal podcast Andy Levy joins the team to talk about the time Fox News let him be part of a late-night comedy show with very little supervision.",
    "The reason the frontrunner Josh Mandel—“shitposter to the gods”—hasn’t scored that sweet Trumpy stamp of approval is because Trump thinks he’s “fucking weird.”\nWhat’s more, this is something Trump has been gossiping about far and wide: “he’s talked about how weird Mandel is, and there’s something just not right about him… he thinks he’s a dork, he thinks he has zero charisma, he thinks he’s bad on TV.\"",
    "And it’s not really the former wrestling commentator.”\nSuebsaeng agrees, “a proxy conflict is, I think, the best way to look at it because there’s so many strands in which the way the usual cast of characters of extremely online partisans and pundits are focusing on this that just to not make sense.",
    "Levy brings us tales from the crypts of Fox Headquarters, where he worked with now-infamous anchors before they went “through the meat grinder of Trumpism.”\n“The guy who used to wear bow ties is now the populist king of America,” Levy says of Tucker Carlson’s hard pivot to the Trumpist right.",
    "Meanwhile, as much as Suebsaeng and Weill try to resist talking about Joe Rogan, well, he’s inescapable right now—and Spotify’s decision to pull some of his shows, and the resurfacing of past instances in which he’s used the N-word, are now a proxy for the larger cultural cold war.",
    "Of course it’s not hard to map the influence of QAnon onto the latest anti-Super Bowl crusade, nor the longstanding backlash from the right when Black artists perform at the halftime show (like when Beyonce’s backup dancers were criticized as supposed Trojan horses for Communism).",
    "As Weill notes, “Joe Rogan has become this figurehead for a lot of people who want to use his struggle as a proxy for their own ability to shout slurs online and be very profitable from it… I really wish we would just be honest about what we’re debating.",
    "Elsewhere on the podcast, Suebsaeng and Weill discuss Suebsaeng’s article this week that exposed why President Trump has “so far conspicuously refrained from endorsing” in the Ohio Senate primary race.",
    "And, most luridly of all, “one big thing Trump has talked about behind the scenes a lot… is Josh’s sex life, or the alleged details of his sex life.” Intrigued?",
    "In fact, this backlash “happens every time there’s a major Black artist performing at the Super Bowl,” Weill points out.",
    "“I can’t say that ‘I’m not mad, I’m just disappointed,’ because I’m fucking furious.",
    "He knows better.”",
    "Disgusted?",
    "Yes."
  ]
}