{
  "id": 26120,
  "mediaId": 2627,
  "date": "2022-03-25",
  "headline": "Missouri's Eric Greitens is testing the limits of Trump's post-morals MAGAverse",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_12/3543326/220324-one-time-use-eric-greitens-donald-trump-cs.jpg",
  "link": "https://www.msnbc.com/opinion/msnbc-opinion/missouri-s-eric-greitens-testing-post-trump-limits-n1293069",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charlie Sykes",
  "authorUrl": "https://www.msnbc.com/author/charlie-sykes--ncpn813256",
  "termIds": [
    13592,
    13615,
    13618,
    13689,
    13790,
    13796,
    14116,
    14186,
    13312,
    14308
  ],
  "sentences": [
    "Greitens also now faces allegations from his ex-wife that he “was physically abusive and demonstrated such ‘unstable and coercive behavior’ that steps were taken to limit his access to firearms.”\nIn a sworn affidavit filed as part of an ongoing custody battle, Sheena Greitens detailed the allegation: “Prior to our divorce, during an argument in late April 2018, Eric knocked me down and confiscated my cellphone, wallet and keys so that I was unable to call for help or extricate myself and our children from our home,” she said.",
    "Thankfully, we have writer Christian Vanderbrouk to provide a helpful translation of this brand of conservative GOP angst:\nJust days earlier, McLaughlin had provided another look inside the GOP’s tribal calculations, when he explained that even though a Senate candidate like Ohio’s deplorable Josh Mandel was a “national embarrassment,” he would have no problem supporting him in the general election against a Democrat.",
    "His governorship imploded in a blizzard of scandals in 2018 after a woman accused him of “coercing her to perform oral sex, undressing, kissing and touching her without her consent, and threatening to release a nude photo of her if she told anyone about their encounter.” (Greitens admitted to an affair, but denied the more serious allegations and charges originally brought by prosecutors were dropped.)",
    "If Greitens wins the Senate primary, says National Journal’s Matt Holt, “Republicans will have to spend real resources defending a seat that they have no business losing.”\nAnd so we get this kind of hand-wringing from conservative pundits like National Review’s Dan McLaughlin, who worried about the “purposeful self-harm” of nominating someone like Greitens.",
    "The chairman of the National Republican Senatorial Committee, Sen. Rick Scott of Florida, stopped short of pushing for a full withdrawal, but he told CNN that the allegations made by Greitens’ ex-wife are “pretty disturbing” and that he hopes they give Trump “a big pause” before he decides to endorse him.",
    "She said his “behavior included physical violence toward our children, such as cuffing our then-3-year-old son across the face at the dinner table in front of me and yanking him around by his hair.”\nThe reaction from Greitens’ fellow Republicans has been intense.",
    "But it is safe to assume that Eric Greitens is counting on other Republicans having the same binary approach to politics, that no matter how odious his character may be, the other guy (read “any Democrat”) is always worse.",
    "As the backlash intensified, Greitens vowed to stay in the race, rushing to appear on Steve Bannon’s show and insisting that in fact he is the victim of a vast conspiracy involving Senate GOP leader Mitch McConnell.",
    "And there is no reason to think that many of the Republicans who are denouncing Greitens today will actually follow through and withhold their votes should he make it to the general election in November.",
    "But this also creates a dilemma for some Republicans — not because of what Greitens may have done, but because of how any allegations may hurt his chances in the general election.",
    "It’s time for Eric Greitens to leave this race.”\nGOP Sen. Joni Ernst of Iowa and Senate Republican Whip John Thune of South Dakota also joined the chorus urging Greitens to quit.",
    "And in Pennsylvania, the Trump-endorsed Senate GOP front-runner, Sean Parnell, quickly dropped out of the race when he was confronted with accusations of child and spousal abuse.",
    "In Georgia, the presumptive GOP Senate nominee, Herschel Walker, has acknowledged that he’s \"accountable\" for allegations of past violent behavior toward his ex-wife.",
    "(To be fair, McLaughlin did draw the line at supporting Roy Moore, whom several women have accused of molesting them when they were teenagers and he was in his 30s.)",
    "The disgraced former governor knows that until his critics make it clear that Never Greitens means Never Greitens, their talk is meaningless, cheap and hollow.",
    "But as people of faith know, the truth always comes to light.”\nBeyond Greitens, domestic violence is becoming an unfortunate theme of this election cycle.",
    "“I was the first person in the country to say when I'm in the Senate, I'm voting against Mitch McConnell,” he told Bannon (and repeated on Twitter).",
    "His primary opponents — state Attorney General Eric Schmitt, Rep. Vicky Hartzler and Rep. Billy Long — all called on him to drop out of the race.",
    "Forced to resign from the governorship after a lurid sex scandal, Greitens is nevertheless the leading Republican candidate for the U.S. Senate.",
    "Forced to resign from the governorship after a lurid sex scandal, Greitens is nevertheless the leading Republican candidate for the U.S. Senate.",
    "Now, in return for fawning over Trump, Republican politician can enjoy a morality-free zone and a force field against accountability.",
    "Trump offers liberation and redemption, in which mediocrity and venality could shelter together under a pugnacious amorality.",
    "So did Sen. Josh Hawley, who tweeted: “If you hit a woman or a child, you belong in handcuffs, not the United States Senate.",
    "For his loyalists, this amounts to a Trumpian hall pass from decency, and Greitens intends to use his to the fullest.",
    "“Now, we are hearing that D.C. political operatives worked with my ex-wife to spread false allegations.",
    "But in Missouri, Greitens has apparently decided to test the limits of unapologetic shamelessness.",
    "And there has been speculation that an endorsement from Trump himself might be forthcoming.",
    "But in Missouri, Eric Greitens is testing the limits of his party’s post-shame politics.",
    "But, as of this writing, there’s no indication that Greitens is going anywhere.",
    "Greitens also recognizes that the rules in the MAGAverse have changed.",
    "In Donald Trump’s GOP, shamelessness can be a kind of superpower.",
    "(This week Trump hinted he may be looking at other candidates.)",
    "He resigned rather than be impeached by the GOP Legislature.",
    "So he’s been here before — and not very long ago.",
    "Greitens has already been disgraced.",
    "If anything, he is escalating.",
    "And why not?"
  ]
}