{
  "id": 26133,
  "mediaId": 2526,
  "date": "2022-02-21",
  "headline": "Facebook Drops ‘Hate Speech’ Suspension for OH GOP Candidate Josh Mandel",
  "image": "https://media.breitbart.com/media/2021/06/Josh-Mandel-640x335.jpg",
  "link": "https://www.breitbart.com/tech/2022/02/21/facebook-drops-hate-speech-suspension-for-oh-gop-candidate-josh-mandel-after-breitbart-inquiry/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alana Mastrangelo",
  "authorUrl": "https://www.breitbart.com/author/alana-mastrangelo/",
  "termIds": [
    13803,
    13894,
    13209,
    13355,
    14238,
    14357,
    14361
  ],
  "sentences": [
    "“Repeatedly violating our Community Standards can cause further account restrictions.”\nThe image Mandel posted, which was deemed “hate speech” by Facebook simply read, “Veterans Before Illegals.”\nMandel told Breitbart News: “As a Marine vet who served in Iraq and served honor guard at multiple Marine funerals, I find this action from Facebook as both sad and un-American.”\n“Silicon Valley seems to be full of ungrateful elites who have no appreciation that their freedom exists only because American servicemen stand watch in dark places throughout the globe,” Mandel added.",
    "pic.twitter.com/6zG0ubtqf1\n— Josh Mandel (@JoshMandelOhio) February 21, 2022\nIn his post, Mandel included an image of a screenshot of the notice he received from Facebook, which read, “You can’t post or comment for 24 hours,” because, “you previously posted something that didn’t follow our Community Standards.”\n“This post goes against our standards on hate speech, so only you can see it,” the message from Facebook added.",
    "Facebook suspended Ohio senate candidate Josh Mandel for 24 hours after he posted an image that read, “Veterans Before Illegals,” which the social media Masters of the Universe labeled “hate speech” and a violation of the company’s “community standards.” Facebook rescinded the ban and apologized to Mandel following an appeal he filed with the internet giant.",
    "“Facebook’s Ministry of Truth suspended me for saying we should put American military veterans ahead of illegal immigrants,” the senate candidate announced on Twitter on Monday.",
    "Correcton — This story as published stated that Facebook reversed Mandel’s suspension after Breitbart News sent a request for comment on the situation to the company.",
    "“These ungrateful elites have no appreciation that their freedom exists ONLY because American servicemen stand watch in dark places across the globe,” Mandel added.",
    "We reviewed your post and it does follow our Community Standards,” read a message from Facebook to Mandel, after the senate candidate appealed the suspension.",
    "These ungrateful elites have no appreciation that their freedom exists ONLY because American servicemen stand watch in dark places across the globe.",
    "Facebook’s Ministry of Truth suspended me for saying we should put American military veterans ahead of illegal immigrants.",
    "Facebook rescinded the suspension and apologized to Mandel shortly after Mandel appealed the suspension.",
    "In fact, the suspension was reversed based on Mandel’s appeal before the request for comment was sent.",
    "You can follow Alana Mastrangelo on Facebook and Twitter at @ARmastrangelo, and on Instagram.",
    "Facebook claimed that the decision to suspend Mandel’s account was made in error.",
    "“We’re sorry we got this wrong."
  ]
}