{
  "id": 26135,
  "mediaId": 2550,
  "date": "2022-02-23",
  "headline": "Morning Digest: Orange County D.A. accused of weighing victims' race in possible death penalty case",
  "image": "https://images.dailykos.com/images/1040931/story_image/AP22048061601817.jpeg?1645572431",
  "link": "https://www.dailykos.com/stories/2022/2/23/2081773/-Morning-Digest-Orange-County-D-A-accused-of-weighing-victims-race-in-possible-death-penalty-case?pm_campaign=blog&pm_medium=rss&pm_source=main",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13430,
    13497,
    13547,
    13560,
    13756,
    14124,
    14159,
    14319
  ],
  "sentences": [
    "Brog, who previously ran a group funded by the late megadonor Sheldon Adelson, joins Army veteran Mark Robertson and former Trump campaign staffer Carolina Serrano in seeking the GOP nomination, but neither had attracted much attention yet: Serrano outraised Robertson $59,000 to $54,000 during the fourth quarter, while Robertson ended 2021 with a $172,000 to $57,000 cash-on-hand lead.",
    "During the pre-primary period, which lasted from Jan. 1 to Feb. 9, Casar outspent another Austin-based politician, state Rep. Eddie Rodriguez, $463,000 to $354,000, and the councilman went into the final weeks with a $168,000 to $36,000 cash-on-hand lead; Casar also has benefited so far from $176,000 in outside spending, with the vast majority coming from the Working Families Party.",
    "In that memo, publicized last week by Voice of OC, then-prosecutor Ebrahim Baytieh wrote that two months earlier, Spitzer had discussed whether he should seek the death penalty for Jamon Buggs, a Black man who allegedly killed two people because he was motivated by jealously over a white ex-girlfriend, with an internal group called the Special Circumstances Committee.",
    "The last time Green Mountain Republicans won a federal election was 2000, when moderate Sen. Jim Jeffords easily secured a final term; Jeffords famously abandoned the GOP (and his all-Republican barbershop quartet, the Singing Senators) the following year to caucus with the Democrats as an independent, a move that handed Team Blue control of the upper chamber.",
    "PA-Gov: State Sen. Doug Mastriano on Monday night released a very amended campaign financial disclosure report, which came hours after the Philadelphia Inquirer wrote that the Republican's original document \"left some GOP insiders scratching their heads — and raised questions about whether his campaign is following the rules.\"",
    "Court Depweg, the lead Newport Beach detective in the Buggs case, wrote to a judge on Feb. 3 that his department would no longer communicate with the district attorney's office after being told by multiple current and former prosecutors that Spitzer \"made an unsolicited, derogatory, and racist comment about Black men/persons.\"",
    "NV-01: Conservative activist David Brog announced Wednesday that he was entering the June Republican primary to take on Democratic Rep. Dina Titus, whose seat in the eastern Las Vegas area became far more competitive following redistricting, and he tells Politico he raised $100,000 during his first three days in the race.",
    "Titus also faces an intra-party challenge from the left in the form of activist Amy Vilela, who took third place with 9% in the 2018 primary for the 4th District, but she enjoys a wide financial edge: The incumbent outraised Vilela $271,000 to $94,000 and had a $838,000 to $36,000 cash-on-hand lead.",
    "PA-Sen: The well-funded super PAC Honor Pennsylvania's new commercial uses a picture taken earlier this month of TV personality Mehmet Oz enthusiastically smooching his new star on the Hollywood Walk of Fame, an image TV viewers should probably get used to seeing ahead of the May Republican primary.",
    "NY-Gov: Wealthy businessman Harry Wilson, who was the 2010 Republican nominee for comptroller, announced Tuesday that he would enter the June primary for governor, telling Fox that he's putting $12 million of his own money that will all go into an opening ad campaign that starts Wednesday.",
    "Orange County, CA District Attorney: Republican District Attorney Todd Spitzer lost endorsements from his counterparts in Riverside, San Diego and Alameda counties in recent days after a December memo surfaced in which a now-former top aide accused Spitzer of making racist comments.",
    "MI-04: While veteran Rep. Fred Upton has not actually announced yet if he'll compete in the August Republican primary against fellow incumbent Bill Huizenga and Trump-endorsed state Rep. Steve Carra, the GOP firm Medium Buying says Upton will begin running TV ads on Wednesday.",
    "He further sent a letter to the Orange County Superior Court around that same time in response to Baytieh's allegations saying, \"The only thing I stated was that I have seen Black men date white women in certain circles in order to have others around them be more accepting.\"",
    "Orange County District Attorney Todd Spitzer (R)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "It would be a huge surprise if the governor, who has given no obvious indication that he's thinking about retiring, does anything other than seek re-election, especially since his departure would give the GOP just weeks to find a new candidate before the filing deadline.",
    "OH-01: While Hamilton County Commissioner Alicia Reece reportedly had been considering seeking the Democratic nomination to take on Republican Rep. Steve Chabot, she instead announced over the weekend that she was backing Cincinnati City Councilman Greg Landsman.",
    "Wilson served as a senior advisor to Barack Obama's Task Force on the Auto Industry in 2009, but he appeared on the ballot next year as a Republican when he campaigned against Democratic Comptroller Thomas DiNapoli, who’d been appointed to fill a vacancy in 2007.",
    "However, Barragán notes that much has changed in the more than two decades since he last ran Austin, writing, \"Massive population growth has led to housing and transportation woes, and the city frequently tops lists of cities with the biggest income inequality.",
    "OH-Sen: Former state Treasurer Josh Mandel has launched a $2 million buy, which the Republican firm Medium Buying says marks his first TV ad campaign since April of last year (though his allies at the Club for Growth have spent heavily on his behalf).",
    "AK-AL: Anchorage Assembly member Chris Constant last week became the first notable Democrat to enter the August top-four primary against Republican Rep. Don Young, whose nearly five decades in office makes him the longest-sitting member of the House.",
    "TX-03: Rep. Van Taylor is airing an ad ahead of next week's Republican primary that praises him for having \"proudly stood with President Trump on securing the border and fighting the liberal mob\" and touts his backing from Sen. Ted Cruz and the NRA.",
    "State Conservative Chairman Gerard Kassar, whose organization supports Zeldin, responded to Wilson’s entrance by faulting the newcomer for donating to Manhattan District Attorney Alvin Bragg, who won last year on a criminal justice reform platform.",
    "Watson joins state Rep. Celia Israel; City Council member Kathie Tovo; and Jennifer Virden, a real estate agent who narrowly lost a 2020 race for the City Council, in the November nonpartisan primary to lead this famously progressive community.",
    "TX-AG: Incumbent Ken Paxton has been running spots in Rep. Louie Gohmert's East Texas base that, somehow, try to portray the far-right congressman as too liberal, so now Gohmert is responding ahead of their four-way March 1 Republican primary.",
    "Former San Antonio City Councilwoman Rebecca Viagran spent a mere $14,000 during the first weeks of the year and had $65,000 left, though she could benefit from being the only candidate from the San Antonio corner of the district.",
    "Constant, who serves on the local equivalent of the city council, joins a race that already includes businessman Nick Begich III, who is the rare Republican member of one of the Last Frontier's most prominent Democratic families.",
    "Bynoe didn't rule out a primary challenge to Rice back in early 2019 after the incumbent took part in the disorganized attempt to prevent Nancy Pelosi from taking back the speaker's gavel, but she didn't end up going for it.",
    "The Texas Tribune's James Barragán explains that, because the city is working to align its mayoral races with presidential cycles, this year's contest will be for just a two-year term rather than the normal four-year stint.",
    "TX-35: End Citizens United has endorsed Austin City Councilman Greg Casar ahead of next week's four-way Democratic primary for this open seat, where he's hoping to win the majority of the vote needed to avoid a May runoff.",
    "NY-03: Sure, why not: Republican Curtis Sliwa, who lost last year's general election for mayor of New York City 67-28, says he's thinking of running for the open 3rd Congressional District … which is based on Long Island.",
    "Candidates need to win 25% of the weighted vote at the convention to earn an automatic spot on the primary ballot, though Wilson has more than enough resources to launch a signature-gathering campaign if he falls short.",
    "'s office filed a suit against Spitzer last year, alleging he sought to undermine a case against a wealthy couple accused of multiple counts of rape and retaliated against her over her pursuit of the investigation.",
    "Four female prosecutors in his employ recently sued him for alleged workplace retaliation after evidence emerged that one of his top supervisors sexually harassed them, while a longtime investigator for the D.A.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n2022 redistricting roundup, with David Jarman\nThe Downballot\nFollowShare\n0:0046:04\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n?",
    "The candidate filing deadline is set for March 15, the special primary will be May 24, and the general election for the final months of Hagedorn's term will be Aug. 9, the same day as the statewide primary.",
    "The Democratic-run legislature last year made the 3rd and 4th Districts bluer at the expense of the 1st District, consequently dropping Biden's margin of victory in Titus' constituency from 61-36 to 53-45.",
    "The Democrat, meanwhile, posts identical 41-39 leads over former Rep. Matt Salmon and wealthy businessman Steve Gaynor, while she beats Board of Regents member Karrin Taylor Robson by a larger 42-37 score.",
    "Zeldin, for his part, has spent the last year winning over the backing of county-level GOP organizations, and the Buffalo News writes that he's \"expected\" to earn the state party endorsement next week.",
    "CA-22: Delano Mayor Bryan Osorio, a Democrat who had been running for California's 22nd Congressional District, recently altered his website to identify him as a candidate for the state Senate instead.",
    "The incumbent is seeking re-election this year in populous Orange County, which moved sharply to the left during the Trump era but is still a place Republicans often do well further down the ballot.",
    "Spitzer went on to fire Baytieh, whom he once called his \"north star,\" earlier this month, about a week before his memo became public; Baytieh has been running for a local judgeship since last year.",
    "Wilson ultimately lost 51-46 during that year's red wave, which remains the closest Team Red has come to winning statewide since George Pataki secured his third and final term as governor in 2002.",
    "Spitzer faces two former prosecutors in June's nonpartisan primary: Peter Hardin, a Democrat who has been running for nearly a year, and Michael Jacobs, who announced at the start of the month.",
    "There is no word on the size of the buy though McMain, who has been self-funding a portion of his campaign, ended December with $272,000 on hand in the crowded primary for this safely red seat.",
    "Phil Scott says he'll announce whether he'll seek a fourth two-year term after the legislative session ends, which local NBC reporter Stewart Ledbetter writes usually happens in early May.",
    "NY-04: Nassau County Legislator Siela Bynoe on Tuesday became the first notable candidate to enter the race since Rep. Kathleen Rice, a fellow Democrat, announced her retirement last week.",
    "Mastriano now says he raised $1 million for all of 2021 and the month of January, which is almost three times the amount he originally listed, and ended the year with $1.3 million on hand.",
    "Depweg also said, \"It was disappointing that [a prosecutor] and so many of his colleagues would try and cover this matter up as we all know the 'cover up is always worse than the crime.'\"",
    "Spitzer also accused Baytieh of writing his original memo in retaliation for an investigation, called by Spitzer, into allegations that Baytieh had withheld evidence in an unrelated case.",
    "Baytieh recounted, \"I stated that the race of the victims is completely irrelevant and it will be inappropriate for the OCDA to consider or give any weight to the race of the victims.\"",
    "Young outraised Begich $200,000 to $132,000 during the fourth quarter, though the challenger self-funded another $172,000 and ended 2021 with a $631,000 to $227,000 cash-on-hand lead.",
    "Austin, TX Mayor: Former state Sen. Kirk Watson announced Tuesday that he would compete in this year's open-seat race for mayor of Austin, a job he previously held from 1997 to 2001.",
    "Spitzer penned his own memo the next month saying that he would not seek the death penalty and removed Baytieh and everyone else on the Special Circumstances Committee from the case.",
    "He continued, \"DA Spitzer stated that he disagreed and he knows many black people who get themselves out of their bad circumstances and bad situations by only dating 'white women.'\"",
    "Wilson joins a nomination battle that includes Rep. Lee Zeldin, who has long looked like the frontrunner, as well as 2010 nominee Rob Astorino and former Trump aide Andrew Giuliani.",
    "Gohmert's ad, which the Texas Tribune says is running in the Tyler media market, features him telling the audience, \"Ken Paxton's attacks on me are now revealing a real desperation.",
    "AZ-Gov: The local Republican pollster Data Orbital has released a new survey testing Secretary of State Katie Hobbs, the Democratic frontrunner, against four Republican candidates.",
    "After reminding viewers that she has Trump's endorsement, Lake continues, \"If you're watching this ad right now, it means you're in the middle of watching a fake news program.\"",
    "The ad features actors unconvincingly portraying Hollywood liberals as they praise Oz as \"Oprah's bestie\" and a supporter of \"red flag laws that take away people's guns.\"",
    "Watson left office in 2020 after spending more than 10 years representing most of Austin in the state Senate, so he starts out with a sizable geographic base of support.",
    "The special will be conducted using the old 1st District boundaries that were in use for the last decade, though the new court-drawn map didn't change much here.",
    "Minnesota's regular filing deadline is May 31, so anyone competing to replace Hagedorn could still run for something this year if they lose the special primary.",
    "Kathy Hochul defeating New York City Public Advocate Jumaane Williams 46-17, with Rep. Tom Suozzi (who has himself run ads going after Bragg) taking just 9%.",
    "Lake, for her part, is running a new spot that makes it extremely clear what kind of campaign she's running in order to win the GOP nod in August.",
    "GA-10: Businessman Marc McMain, a Republican we hadn't previously mentioned, is airing a new ad where he promises to put Anthony Fauci \"in jail.\"",
    "And while his first filing said he'd spent less than $15,000 for the entire reporting period, he now records expending $215,000 for the year.",
    "VT-Sen: Former U.S. Attorney Christina Nolan announced Tuesday that she would seek the Republican nomination for Vermont's open Senate seat.",
    "IL-07: Chicago Mayor Lori Lightfoot has endorsed longtime Rep. Danny Davis in the June Democratic primary for this safely blue constituency.",
    "The challenger goes on to remind the viewer that the attorney general \"has been indicted for fraud and is being investigated for bribery.\"",
    "Gohmert on Monday also picked up an endorsement from fellow Rep. Chip Roy, who previously served as Sen. Ted Cruz's chief of staff.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Tim Walz on Tuesday officially scheduled the special election to succeed Republican Rep. Jim Hagedorn, who died on Friday.",
    "However, while Wilson gives the GOP a potential nominee with access to scads of money, he has his detractors on the right.",
    "But Spitzer's alleged remarks had already generated consequences before Voice of OC reported on Baytieh's memo last week.",
    "Davis faces a rematch against anti-gun-violence activist Kina Collins, whom he beat 60-14 in a four-way race last cycle.",
    "(The congresswoman was not happy, saying in December, \"I totally got fucked by the Legislature on my district.\")",
    "Landsman already had the support of newly elected Cincinnati Mayor Aftab Pureval, who lost to Chabot in 2018.\n?",
    "If no one wins a majority of the vote, the two top vote-getters would advance to the November general election.",
    "The opening spot touts the candidate's time in the Marines and describes him as \"pro-God, pro-gun, pro-Trump.\"",
    "Hardin has campaigned as a progressive while Jacobs has argued he has more experience than either of his foes.",
    "The existing constituency favored Donald Trump 54-44, while the new 1st would have supported him 53-44.\n?",
    "The only one who starts with an advantage is former TV anchor Kari Lake, who edges out Hobbs 43-41.",
    "The city also faces tension between its police department and police accountability activists.\"",
    "Because they won't even cover the biggest story out there, the rigged election of 2020.\"",
    "Wilson considered other campaigns over the ensuing decade, but he stayed put until now.",
    "A fourth candidate, consultant Carla Joy Sisco, has generated very little attention.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "On the Democratic side, Siena has released a new primary poll that shows Gov.",
    "Baytieh's accusations represent just the latest scandal to tarnish Spitzer.",
    "It doesn't bother me, I've been fighting Washington liberals for years.\"",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "He ended 2021 with a $532,000 to $131,000 cash-on-hand lead.",
    "Phil Scott, who long ago took himself out of the running.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Nolan quickly earned an endorsement from Gov.",
    "She goes on, \"You know how to know it's fake?",
    "Check out our new podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "VT-Gov: Republican Gov.",
    "MN-01: Democratic Gov.",
    "Attorneys General\n?",
    "Please read it.",
    "Governors\n?",
    "Senate\n?",
    "Mayors\n?",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}