{
  "id": 26174,
  "mediaId": 2664,
  "date": "2022-04-01",
  "headline": "WATCH: Bill Maher scorches GOP's 2022 candidates as even crazier than the 2010 Tea Party wave",
  "image": "https://www.rawstory.com/media-library/bill-maher.jpg?id=29627092&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/bill-maher-2657081452/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    13466,
    13766,
    13769,
    13840,
    13848,
    13859,
    13886,
    13312,
    13336
  ],
  "sentences": [
    "\"For all of who get frustrated because Manchin and Sinema don't vote like true liberals, because they never were, or think Trump is as bad as it's going to get, remember the first rule of modern Republican politics, they always go lower, because this party has no bottom, unless you count Lindsey Graham (R-SC).",
    "The host noted, \"we are now only seven months away midterm elections that are poised to make the Republicans much more powerful, so attention must be paid where the Republican Party is right now.",
    "He went on to discuss GOP candidates Hershel Walker, Kelly Tshibaka, Sarah Palin, Michele Fiore, Eric Greitens, Josh Mandel, Mike Gibbons, and Tina Forte.",
    "But this year, Marjorie Taylor Greene (R-GA) and Lauren Boebert (R-CO) repeatedly — repeatedly — interrupted Biden at his state of the union.",
    "You'd think with the left going a little loony after the past few years, Republicans would've seen an opening to grab the sensible center.",
    "HBO \"Real Time\" host Bill Maher warned his viewers of the candidates that Republicans are fielding in the 2022 midterm elections.",
    "\"In 2009, it was a big deal when Congressman Joe Wilson (R-SC) yelled out 'you lie' during Obama's state of the union address.",
    "Excuse me Karen, the president is talking, its not a Black kid you caught trying to use the pool,\" Maher said.",
    "\"No, you can't have skinny margarita and if you don't sit down, this flight is never getting to Orlando.\"",
    "This crowd looks at those people like, 'Please, they've never even masturbated on the subway.'\"",
    "This crowd looks at those people like, 'Please, they've never even masturbated on the subway.",
    "'\"\\n#RealTimepic.twitter.com/Nn67rjFPVg\n— Bob Brigham (@Bob Brigham) 1648870708",
    "Maher reminded viewers of the crazy candidates Republicans ran in 2010.",
    "\"What are they serving at the Republican conventions these days?",
    "\"You think the Republicans of 2010 were kooks?",
    "\"You think the Republicans of 2010 were kooks?",
    "Joe Manchin (D-WV) and Kyrsten Sinema (D-AZ).",
    "He also discussed Sens.",
    "Look at them.",
    "Bath salts?\"",
    "he asked.",
    "But no.\""
  ]
}