{
  "id": 26184,
  "mediaId": 2745,
  "date": "2022-04-03",
  "headline": "Opinion: Collins’s lonely voice on Jackson shows how extreme the GOP has become",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/V7TGEMU7D4I6ZFBYEVLQTNWN3Q.jpg&w=1440",
  "link": "https://www.washingtonpost.com/opinions/2022/04/03/susan-collins-lonely-confirmation-vote-reflects-republican-extremism/?utm_source=rss&utm_medium=referral&utm_campaign=wp_opinions",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "E.J. Dionne Jr.",
  "authorUrl": "https://www.washingtonpost.com/people/ej-dionne-jr/",
  "termIds": [
    13530,
    13592,
    13602,
    13710,
    13764,
    13830,
    14129,
    13197,
    13312,
    13334
  ],
  "sentences": [
    "A total deportation of immigrants in the country illegally and the restoration of Donald Trump to the White House as quickly as possible.”\nA statement from three-time Senate candidate Josh Mandel caught the mood: “For all the RINOs out there and all the media elites out there, the 2020 election was stolen from Donald J. Trump.”\nYet while it has a high profile today, the far right has deep roots in Republican history.",
    "But if the GOP welcomed far-right votes then, its leaders largely kept the extremists at bay until Fox News, significant parts of the tea party and the Trump movement succeeded at mainstreaming conspiracy theories, ultraright appeals and increasingly violent rhetoric that became reality with the Jan. 6, 2021, attack on the Capitol.",
    "Time magazine’s Philip Elliott took readers on a sprightly tour through what he called “the greatest hits of conservative fantasy” that rang out during last week’s debate among Portman’s would-be successors: “Massive ballot-harvesting operations in urban areas.",
    "Extremism has become central to what it means to be Republican in a way it was not when Collins began her career in 1975 as a staffer for William S. Cohen, a Republican congressman who later became a senator and then President Bill Clinton’s defense secretary.",
    "They may signal now and again that they realize Trump is a dangerous liar, but they know they can’t get entirely crosswise with the roughly two-thirds of GOP voters who believe that President Biden was not legitimately elected.",
    "Collins’s vote can be read as a quiet rebuke to the scandalous smear campaign that extreme Republican members of the Judiciary Committee mounted against Jackson during her recent confirmation hearings and since.",
    "Her choice, which may or may not bring along another Republican or two, saves her party from the embarrassment of unanimously voting against the first Black woman named to the nation’s highest judicial body.",
    "The conventional view of today’s GOP is true as far as it goes: that Donald Trump’s enduring popularity with the party’s core voters forces reasonable Republicans to twist themselves into moral pretzels.",
    "The decision by the Republican senator from Maine to support Judge Ketanji Brown Jackson’s Supreme Court nomination was both right and a politically wise way of shoring up her brand for independence.",
    "That’s when the ideological wars over the Supreme Court were really launched — not, as conservatives claim, with the Senate fight over Judge Robert H. Bork’s Supreme Court nomination in 1987.",
    "Birchers were proud of their “Impeach Earl Warren” billboards, targeting the liberal chief justice who presided over the 1954 Brown v. Board of Education decision ending school segregation.",
    "It’s not just that the moderate and liberal Republicans who took on the lunatic fringe most directly and forcefully in earlier times have largely been driven out of the party.",
    "It’s also that the mainstream conservatives who remain depend so much on the ballots and energy of the nuts and the zealots that they hold back and temporize.",
    "than Rep. Marjorie Taylor Greene (R-Ga.), and as long as they tolerate or even embrace the McCarthyite style that defined the treatment of Jackson.",
    "She’s one of the most qualified people ever chosen for the court, and her elevation will not change its philosophical composition.",
    "Yes, a Republican agreed to serve under a Democratic president, and a figure like Cohen is almost inconceivable in the GOP now.",
    "But Republicans render themselves unfit for the role as long as they are more eager to marginalize Rep. Liz Cheney (R-Wyo.)",
    "Liberal Republicans — figures such as Jacob Javits of New York or New Jersey’s Clifford Case — are extinct altogether.",
    "Moreover, the energy in the party remains with the extremists, judging by many of this year’s primaries.",
    "To paraphrase the title of a far-right book from the 1960s: None dare call it extremism.",
    "Today, she’s in a party that seems eager to channel those old Birch Society billboards.",
    "As for Susan Collins’s vote, she would have had a lot more company once upon a time.",
    "Look at the GOP nomination battle for the seat of retiring Ohio Republican Sen.",
    "Recall the heyday of the John Birch Society in the early 1960s.",
    "A defense of Reps. Marjorie Taylor Greene and Madison Cawthorn.",
    "Hunter Biden’s laptop and Joe Biden’s family crime syndicate.",
    "They even sponsored an Impeach Earl Warren essay contest.",
    "Republicans should find it easy to vote for Jackson.",
    "The nation needs a reasonable center-right party.",
    "Rob Portman, a relatively moderate conservative.",
    "This is an enormous problem for our democracy.",
    "(Warren, by the way, was a Republican.)",
    "Their escapade was not a one-off.",
    "Jail time for Dr. Anthony Fauci.",
    "The GOP tries to pose as one.",
    "What changed?"
  ]
}