{
  "id": 26260,
  "mediaId": 2550,
  "date": "2022-03-18",
  "headline": "Morning Digest: New Hampshire's Republican governor threatens to veto Republican gerrymander",
  "image": "https://images.dailykos.com/images/1049451/story_image/ComparisonDouble.png?1647555056",
  "link": "https://www.dailykos.com/stories/2022/3/18/2086568/-Morning-Digest-New-Hampshire-s-Republican-governor-threatens-to-veto-Republican-gerrymander?pm_campaign=blog&pm_medium=rss&pm_source=LatinoKos",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13430,
    13516,
    13519,
    13560,
    13739,
    13764,
    13197,
    13312,
    14312
  ],
  "sentences": [
    "FL-20: Former Broward County Commissioner Barbara Sharief has confirmed that she's leaning towards waging a primary challenge to state Senate Minority Leader Lauren Book rather than seeking a rematch with Democratic Rep. Sheila Cherfilus-McCormick in Florida's 20th Congressional District, though she said the ultimate outcome of redistricting would help her make her decision.",
    "The field includes businessman David Giglio, who has an endorsement from Rep. Tom McClintock; agribusinessman John Duarte; Elizabeth Heng, who lost to Costa in 2018 and is now campaigning in the special election for the existing 22nd District; and Diego Martinez, who earned all of 0.1% of the vote in last year's recall campaign against Newsom.",
    "CA-42: Six Democrats, one Republican, and one independent are campaigning for a seat that Biden would have carried 72-26, though the only two Democrats who have attracted much attention are Long Beach Mayor Robert Garcia and Assemblywoman Cristina Garcia, who represents communities to the north (the two do not appear to be related).",
    "Team Blue's two leading candidates look like Assemblyman Adam Gray and financial advisor Phil Arballo, who lost to Republican incumbent Devin Nunes in 2020 in the old 22nd District; the other contender is Angelina Sigala, who was waging a longshot intra-party bid against Rep. Josh Harder before redistricting changed the map.",
    "AL-Sen: Rep. Mo Brooks has gone up with a new spot in which he proudly showcases the Jan. 6 speech he delivered to the pro-Trump rally that preceded the attack on the Capitol, an ad that comes just after Donald Trump publicly mused about unendorsing the congressman for not believing in the Big Lie firmly enough.",
    "Images then flash by of Senate Minority Leader Mitch McConnell, Wyoming Rep. Liz Cheney, and Katie Boyd Britt, the former Business Council of Alabama head who is Brooks' main rival in the May primary, as the congressman decries \"debt junkie, weak-kneed, open-border RINOs who sell out our conservative values.\"",
    "(Harder is now running for the 9th District, an option that became available to him after fellow Democrat Jerry McNerney announced his retirement,)\nArballo has been arguing that Gray, who has been one of the most prominent business-friendly moderates in the state capitol, is too close to special interests.",
    "PA Redistricting: The Pennsylvania Supreme Court rejected a series of challenges to the state's new legislative maps in an order on Wednesday, following a mandatory 30-day period for critics to file objections after the state's bipartisan redistricting commission adopted the new districts last month.",
    "Also running for Team Blue are Culver City Vice Mayor Daniel Lee, whom Kamlager beat in a 69-13 landslide in last year's special election for the state Senate; and former Los Angeles City Councilwoman Jan Perry, who lost the 2013 race for mayor and a 2018 contest for Los Angeles County supervisor.",
    "CA-03: Candidate filing closed Wednesday in California for races where incumbents chose not to file for re-election, and below we'll be running down the state of play for the June 7 top-two primary in the Golden State's five open congressional districts: the 3rd, 13th, 15th, 37th, and 42nd.",
    "The GOP lineup consists of Sacramento County Sheriff Scott Jones, who lost a tight 2016 race against Democratic Rep. Ami Bera in the old 7th District, and Assemblyman Kevin Kiley, who attracted little attention when he competed in last year's failed recall campaign against Democratic Gov.",
    "That's a key reason why the GOP-run legislature has sought to upend New Hampshire's congressional map—which has remained remarkably stable for 140 years—and transform Pappas' district from one that backed Joe Biden 52-46 to one that would have supported Donald Trump by a 50-48 margin.",
    "Additionally, after a group of Asian American activists successfully lobbied to defeat legislation to end the state's ban on affirmative action in college admissions in 2014, she reportedly reacted, \"This makes me feel like I want to punch the next Asian person I see in the face.\"",
    "OH Redistricting: Ohio's Supreme Court has once again rejected new legislative maps drawn by the state's Republican-dominated redistricting commission, ruling for the third time in a row that the GOP's districts violate the state constitution's ban on partisan gerrymandering.",
    "PA-Sen: TV personality Mehmet Oz's latest ad against former hedge fund manager David McCormick, who appears to be his chief opponent in the Republican Senate primary, accuses McCormick of having \"fired Pennsylvanians and bragged about shipping their jobs to Asia.\"",
    "Most immediately, it appears impossible for Ohio to hold its May 3 primary as scheduled, at least for legislative races and probably for congressional contests as well (the Supreme Court is also weighing a challenge to the GOP's latest U.S. House map).",
    "OH-Sen: Former state Treasurer Josh Mandel demonizes undocumented immigrants in his latest spot as he seeks the GOP nod, telling the audience, \"We shouldn't spend a penny on illegals as long as we have even one American veteran living on the street.\"",
    "OR-Gov: Consultant Bridget Barton's bid for the Republican nomination has generated little attention so far, so like so many other underdog candidates before her, she's hoping to change that with a commercial that contains some (censored) swearing.",
    "For the Democrats, the only candidate who appears to be running a credible campaign is physician Kermit Jones, a Navy veteran who would be the first Black man to represent the state in Congress since Los Angeles Democrat Julian Dixon died in 2000.",
    "CA-15: Four Democrats, two Republicans, and a pair of independents are campaigning to succeed retiring Democratic Rep. Jackie Speier in the new 15th District, a seat that's home to most of San Mateo County as well as a portion of San Francisco.",
    "Chris Sununu promised to veto the new congressional map that his GOP colleagues in the state Senate passed on Thursday \"as soon as it reaches my desk,\" announcing his intentions almost immediately after lawmakers approved the long-stalled bill.",
    "Viewers of this ad, a group that Brooks certainly hopes includes Trump, see footage of the candidate telling a cheering throng last year, \"America does not need any more weakling, cowering, wimpy Republican congressmen and senators!\"",
    "Jones has the backing of Rep. Tom McClintock, who represents 58% of the seat (McClintock is running in the more conservative 5th, a move made possible by Devin Nunes’ resignation), while Kiley is the state GOP's endorsed candidate.",
    "GOP leaders in the legislature didn't offer any substantive response to the governor's pledge, but given the GOP's relatively narrow margins in both chambers and unified Democratic opposition to the map, an override is impossible.",
    "FL-07: Longtime congressional staffer Rusty Roberts tells Florida Politics that he's considering seeking the Republican nod to succeed Democratic Rep. Stephanie Murphy, and the site adds that he \"will likely announce next week.\"",
    "The Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Robert Garcia, who would be the first gay Latino to represent California in Congress, is a former Republican who founded the Long Beach Young Republicans in 2005, but he became an independent in 2007 and a Democrat in 2010.",
    "However, Kermit Jones, who has the state party endorsement, will still need to consolidate sufficient support in June to ensure that Scott Jones and Kiley don't both advance and lock Team Blue out of the general election.",
    "Because the districts Ohio used in the previous decade are now badly out of whack in terms of population equality, a federal court would have the power to order a remedial map that rectifies this malapportionment problem.",
    "Team Blue's three leading contenders are San Mateo County Supervisor David Canepa, Assemblyman Kevin Mullin, and Burlingame Councilmember Emily Beach, while attorney Andrew Watters hasn't generated much attention yet.",
    "The secretary of state will publish an official candidate list in the coming weeks, but in the meantime, we're relying on an open-source spreadsheet created and maintained by California political operatives.",
    "(It did not rule on a pending question of contempt, which the justices ordered briefing on after the commission failed to meet its court-imposed deadline for drawing the now-invalidated third batch of maps.)",
    "Gray also enjoys a big geographical edge: While he represents about 60% of the 13th in the legislature, there's no overlap between this congressional district and the old 22nd, where Arballo ran last cycle.",
    "The frontrunner appears to be state Sen. Sydney Kamlager, who represents over 90% of the 37th District in the legislature and has endorsements from Bass, the state Democratic Party, and EMILY's List.",
    "Earlier this year, commenting on GOP plans to target Democratic Rep. Chris Pappas by making the 1st District redder—and the 2nd correspondingly bluer—Sununu said, \"We're a purple state.",
    "By and large, though, Republicans have conceded the 2nd District, which has been held by Democrat Annie Kuster for a decade; even in the red wave of 2014, she still won by 10 points.",
    "This constituency, which includes central Los Angeles, would have gone for Biden 86-12, so it would be a surprise if there's anything other than an all-Democratic general election.",
    "The 2nd, meanwhile, would shift from a 54-45 win for Biden to an even larger 57-41 Biden advantage, all but ensuring it would remain out of play for Republicans—as Sununu noted.",
    "The candidate shows up in basketball attire with a pair of horses as the narrator proclaims, \"Some horse s**t,\" before the candidate decries where things are going in Oregon.",
    "What such a map might look like is impossible to say, though should this eventuality come to pass, Republicans may regret giving up control over the redistricting process.",
    "CA-37: Democratic Rep. Karen Bass is giving up her seat in Congress to run for mayor of Los Angeles, and five Democrats and one Republican are campaigning to replace her.",
    "If Sununu carries through on his threat, therefore, the two sides will either have to forge a compromise, or else a court would have to step in to draw new boundaries.",
    "Brooks then speaks directly to the camera in a far quieter setting and proclaims, \"On Jan. 6, I proudly stood with President Trump in the fight against voter fraud.\"",
    "Britt, meanwhile, is running a commercial starring Shelby County Sheriff John Samaniego, who praises her as \"a strong conservative who will keep your family safe.\"",
    "We begin in the 3rd District, where two Republicans and three Democrats are competing for a seat in Sacramento's eastern suburbs that Trump would have taken 50-48.",
    "Sununu didn't offer an explanation for his stance in the terse statement he issued Thursday, but he wasn't motivated by an opposition to partisan gerrymandering.",
    "MI-13: Retiring Rep. Brenda Lawrence has endorsed Michigan Civil Rights Commissioner Portia Roberson in the crowded August Democratic primary to succeed her.",
    "In 2018, after a staffer accused her of making unwanted advances, two Assembly investigations concluded she had been \"overly familiar\" with a subordinate.",
    "In theory, then, the commission could keep passing unconstitutional plans indefinitely, though it's possible the court could find its members in contempt.",
    "She said, though, that if the city winds up back in Cherfilus-McCormick's seat when all is said and done, another congressional campaign is \"fair game.\"",
    "The state constitution, however, can't bar federal courts from intervening, which they'd likely do in the event of a stalemate that lasts much longer.",
    "OK-02: Muskogee Chief of Police Johnny Teehee on Thursday became the latest Republican to announce a bid for this dark red seat in eastern Oklahoma.",
    "Oz then tells a crowd that, like Trump, he came from \"outside politics,\" a statement that's followed by old footage of Trump appearing on his show.",
    "(Rep. Lucille Roybal-Allard, who is also not seeking re-election, represents a 48% plurality of the revamped 42nd, but she hasn't taken sides yet.)",
    "OH-Gov: Former Dayton Mayor Nan Whaley's opening ad for the Democratic primary features the candidate talking about her working-class upbringing.",
    "Local election officials are opposed to the latter idea, while Republican leaders say the earliest a single primary could be held would be July.",
    "The Ohio constitution says that \"[n]o court\" may order the adoption of a redistricting plan or direct the commission to adopt a specific plan.",
    "The court ordered that the commission produce yet another set of maps by March 28, but many questions remain about what will happen next.",
    "GA-07: End Citizens United has endorsed Rep. Lucy McBath in her May Democratic primary battle against fellow incumbent Carolyn Bourdeaux.",
    "Canepa ended 2021 with a clear financial advantage over his opponents, while Mullin has the support of both Speier and the state party.",
    "Biden would have carried this constituency 78-20, so there's a good chance that two Democrats will advance out of the top-two primary.",
    "Cristina Garcia is arguing that she has a more dependable progressive record, though her behavior in office has brought her bad press.",
    "CA-13: Three Democrats and four Republicans are running for a seat in the mid-Central Valley that would have supported Biden 54-43.",
    "Gavin Newsom, Sen. Alex Padilla, and Rep. Jim Costa, who represents just over half of the new 13th, as well as the state party.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Roberts used to serve as chief of staff for Republican John Mica, the Styrofoam hoarder that Murphy unseated in a 2016 upset.",
    "Brooks goes on to remind the viewer that he's Trump's endorsed candidate, which is at least still true as of this writing.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "That leaves the state with two choices: Either postpone the primary for all elections, or conduct two separate primaries.",
    "\"Dad worked at the GM plant,\" she tells the audience, \"When he got laid off, Mom picked up the slack at the laundromat.\"",
    "Mandel's former drill instructor also appears with him and tells the audience that the Marines are \"America's 9-1-1.\"",
    "Kiley's legislative district is also home to 58% of the 3rd's denizens, while only 16% live in Jones' jurisdiction.",
    "Gavin Newsom and Sen. Alex Padilla, as well as retiring Rep. Alan Lowenthal, who represents 38% of the new seat.",
    "Andrew Cuomo on Thursday neither ruled out running to regain his old post nor forming a new party to do it.",
    "Whaley goes on to call for \"a governor who puts improving the economy for families like ours first.\"",
    "Barton herself gets bleeped later, and yes, there's an obligatory shot of horse manure at one point.",
    "Arballo so far has attracted far less big-name support, though he has SEIU California on his side.",
    "Garcia also acknowledged that she'd called then-Speaker John Pérez, who is gay, a \"homo\" in 2013.",
    "Ron DeSantis has pledged to veto, that moves Sharief's longtime base in Miramar out of the 20th.",
    "The even bigger issue, however, is how the impasse over the legislative maps might get resolved.",
    "(The plan was first introduced in November and was approved by the state House in January.)",
    "The court also set the candidate filing deadline, which had been stayed, for March 28.",
    "You can find our post-filing analysis for the state's other big races to watch here.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "(Filing in other state races and in congressional races closed on Tuesday.)",
    "Garcia has the backing of two of the state's most prominent Democrats, Gov.",
    "From a political standpoint, I think Republicans can definitely win in CD2.",
    "(Her weakest performance actually came in 2016, when she prevailed 50-45.)",
    "However, the Assemblyman has the backing of well-known Democrats like Gov.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "The legislature recently passed a map, which Republican Gov.",
    "Things are far less defined on the GOP side.",
    "Subscribe to our podcast, The Downballot!",
    "The primary for all elections is May 17.",
    "This is a short blurb about Daily Kos.",
    "NH Redistricting: Republican Gov.",
    "NY-Gov: Disgraced former Gov.",
    "Click here to donate $3 now.",
    "Why would you concede that?\"",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "x\nx\nLeading Off\n?",
    "Redistricting\n?",
    "Please read it.",
    "Gavin Newsom.",
    "Governors\n?",
    "Senate\n?",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}