{
  "id": 26296,
  "mediaId": 2572,
  "date": "2022-02-23",
  "headline": "Ohio Senate candidate hits back at 'radical leftists,' BLM members who shouted him down during debate",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/aa2619ba-d899-4ff4-baf7-68798056c35e/0fa2800e-4942-4903-acb8-8cfebf007b6c/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/ohio-gop-senate-josh-mandel-debate-shouted-blm-leftists",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13803,
    14005,
    13285,
    14243
  ],
  "sentences": [
    "\"What I told her was, you know, when I was in the Marine Corps, did a couple of tours in Iraq, and I put my life in the hands of young black men, and they put their lives in my hand, and we didn't see each other as Black or White or Hispanic or Asian,\" Mandel said.",
    "An Ohio Senate debate went off the rails as the crowd interrupted the Republican candidate, Josh Mandel, on race-based claims calling on him to leave the Black church where the event was being hosted.",
    "\"You had guys there from Black Lives Matter, you had other radical leftists there who kept interrupting me, and basically they were asking me to leave because that was a White guy in a Black church.\"",
    "\"Unfortunately, not only could the radical leftist I was debating against not hold her own, but then the audience started chiming in,\" Mandel told co-host Pete Hegseth.",
    "The primary is set to take place May 3 as Mandel faces off against six other candidates for the Republican nomination in the race to replace retiring Sen.",
    "Mandel, who is in a Republican primary, was debating his potential Democratic challenger, Morgan Harper, at a Black church in Cleveland.",
    "Mandel joined \"Fox & Friends\" Wednesday to discuss the incident after one woman told him he did not \"belong\" in the Black community.",
    "\"We saw each other as brothers, as United States Marines, and frankly, I think that's the way that society should be as well.\"",
    "\"The Democrat Party of today is trying to make everything about skin color.\"",
    "\"It's everything that Martin Luther King marched against,\" he continued.",
    "Rob Portman, R-Ohio."
  ]
}