{
  "id": 26334,
  "mediaId": 2699,
  "date": "2022-02-27",
  "headline": "Ex-Prosecutor Says She Can Prove Trump Committed Two Crimes",
  "image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1645913421/220227-TNA-barbaramcquade-hero_cho9o6",
  "link": "https://www.thedailybeast.com/ex-prosecutor-barbara-mcquade-says-she-can-prove-trump-committed-two-crimes?source=articles&via=rss",
  "mediaOutlet": "The Daily Beast",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "The Daily Beast",
  "authorUrl": "https://www.thedailybeast.com/author/the-daily-beast-branded",
  "termIds": [
    13439,
    13592,
    13803,
    13947,
    13366
  ],
  "sentences": [
    "McQuade comes prepared with backup: a laundry list of examples and people who made it so obvious that Trump lost the election, she says, it would be hard to conclude he didn’t know the truth of the situation.",
    "And according to a recent analysis she published, she concludes that the former president actually committed two crimes: conspiracy to defraud the United States, and obstruction of an official proceeding.",
    "McQuade believes it can be proven that Trump committed the crime of defrauding the U.S. because prosecutors don’t need him to admit he lied about the election results.",
    "That means a person was “aware of a very high probability that the fact was true, but they simply turned a blind eye to the thing they did not want to acknowledge.",
    "“There may very well be additional crimes, but this was solely relating to his pressure on Mike Pence to see whether any crimes were committed,” she says.",
    "Also in this episode, Andy Levy makes his Sunday episode debut, just in time to listen to clips of Josh Mandel sounding stupid and to unpack Texas Gov.",
    "“What he did is actually pretty clear: public and private statements about pressuring Mike Pence,” she says.",
    "Lucky for us, she joins The New Abnormal’s first unlocked Sunday bonus episode to explain her findings.",
    "Barbara McQuade, former national security prosecutor for the Eastern District of Michigan, says yes.",
    "I think you can’t help but conclude that Donald Trump knew that there was no fraud here,” she says.",
    "All they need to prove is that he “engaged in willful blindness” about it.",
    "Did Donald Trump commit a crime on and before Jan. 6?",
    "Gregg Abbott’s criminalization of trans kids.",
    "It’s a move Andy calls “full-on fascist.”",
    "But she wants to make one thing clear.",
    "Then there’s the big lie."
  ]
}