{
  "id": 26398,
  "mediaId": 2545,
  "date": "2022-03-17",
  "headline": "The Culture Wars and the 2022 Congressional Elections",
  "image": "https://www.counterpunch.org/wp-content/uploads/2022/03/226219546_c7b4c35edd_c-680x479.jpg",
  "link": "https://www.counterpunch.org/2022/03/17/the-culture-wars-and-the-2022-congressional-elections/",
  "mediaOutlet": "counterpunch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Rosen",
  "authorUrl": "https://www.counterpunch.org/author/fra6u/",
  "termIds": [
    13676,
    13798,
    13857,
    13991,
    14003,
    14010,
    14033,
    14232,
    14280
  ],
  "sentences": [
    "Schools that teach the 1619 Project would also be ineligible for federal professional-development grants.”\nSteve Nuzum, a Columbia (SC) teacher and research director for the advocacy group SC for Education, warned: “I think public school systems are at an inflection point.” He added,”Either the public will step up to defend them, or we’ll collectively let a minority of community members and outside interest groups damage them in order to push agendas like privatization.”\nIn no area has the right’s culture war campaign taken on a more explicit political agenda then with regard to gender identity and what is identified as “critical race theory.”\nRepublican controlled legislatures and governorships in Texas and Florida are leading the charge against gay/transgender young people.",
    "Sen. Marco Rubio (R-FL), a possible Republican presidential candidate, opined: “Critical race theory is Marxist inspired indoctrination and has no place in our schools.” According to one report, between May and June of 2021, Fox News mentioned it 1,900 times and, as of February 1, 2022,\nat least 36 states have adopted or introduced laws or policies that restrict teaching about race and racism\nRepublicans and the conservative rights are gearing up for a major push to recapture the House – and maybe the Senate – in the upcoming 2022 elections.",
    "It reported, “US church membership was 73% when Gallup first measured it in 1937 and remained near 70% for the next six decades, before beginning a steady decline around the turn of the 21st century.” It noted, “Membership numbers dropped to 50% by 2018, and last year [2020] slipped to 47%.”\nThis decline in established religious participation was due to two factors – (i) a decline in church membership and (ii) the growth of those who no longer identify with a religion.",
    "The culture wars were (unofficially) launched in August 1971 when Lewis Powell, a Virginia attorney, tobacco-industry lobbyist, and future Supreme Court Judge, released a secret study for the Chamber of Commerce entitled, “Attack on the American Free Enterprise System.” Powell argued:\nThere should be no hesitation to attack the [Ralph] Naders, the [Herbert] Marcuses and others who openly seek destruction of the system.",
    "“America’s founding set in motion the unstoppable chain of events that abolished slavery, secured civil rights, defeated communism and fascism, and built the most fair, equal, and prosperous nation in human history.”\nSen. Tom Cotton (R-AK) took up Trump’s attack and introduced legislation — Saving American History Act of 2020 — that would bar schools from teaching the curriculum based on the 1619 Project.",
    "Justice Harry Blackmun noted, “… throughout the 19th Century prevailing legal abortion practices were far freer than they are today, persuades us that the word ‘person,’ as used in the Fourteenth Amendment, does not include the unborn ….” The Roe decision forced 46 states to liberalize their abortion laws and remains the defining issue of the culture wars.",
    "Together with the racist “Southern Strategy,” developed by Kevin Phillips and Pat Buchanan and implemented as part of Nixon’s ’68 presidential campaign, opposition to abortion and women’s equality would be key agenda items of an awakened conservativism, the remaking of the Republican Party and social struggle for decades to come.",
    "He called for “a Judeo-Christian revolution”: “We should be instilling God in the classroom, instilling God in the workplace, and in all aspects of society.”\nFor conservatives in general — and religious Christians in particular – a woman’s right to terminate her pregnancy remains the most critical “value” or culture wars issue.",
    "Gallup found that “over the past two decades, the percentage of Americans who do not identify with any religion has grown from 8% in 1998-2000 to 13% in 2008-2010 and 21% over the past three years.”\nTo halt this growing non-religious identification, conservative politicians have taken up the challenge.",
    "Adopting a different approach, Dr. Seuss Enterprises said it would stop publishing six Dr. Seuss books because they “portray people in ways that are hurtful and wrong.”\nLike Spieglman’s Maus, The New York Time’s 1619 Project, developed by\nNikole Hannah-Jones, has come under wide-spread critical attack.",
    "Instead of giving Price a warning or appropriate disciplinary actions, the school’s superintendent terminated him because the reading caused “unnecessary embarrassment or disparagement” and displayed “a lack of professionalism and impaired judgment,” violating the state’s code of ethics for educators.",
    "If, as possible, the Republicans regain control of Congress later this year, in all likelihood the current January 6th Congressional hearings will be ended and the full truth as to how high-up the political ladder the coordination of the attack, an attempted coup d’ etát, went will never be known.",
    "Kristi Noem (R-SD), speaking at the Family Leadership Summit, declared, “We prayed in schools, which by the way, in South Dakota, I’m putting prayer back in our schools.” Her sentiment was shared by Josh Mandel, a pro-Trump conservative Republican running for a Senate from Ohio.",
    "This incident is but one of a rapidly growing number of actions being taken by local and state officials across the country in the latest round of the long-simmering culture wars, the social struggle over acceptable – and legal — values and lifestyles.",
    "In February, Texas Governor Greg Abbot issued a directive to the state’s Department of Family and Protective Services (DFPS) calling for “prompt and thorough investigation[s]” into parents of children who have received gender-affirming treatment.",
    "During the 20th century, they were defined by the 1925 Scopes trial over teaching evolution, the anti-Communist loyalty oaths for teachers during the Joe McCarthy era after World War II and the conservative reaction of the tumultuous 1960s.",
    "***\nThree decades ago, the Republican strategist Pat Buchanan gave an impassioned speech at his party’s 1992 convention, foreshadowing struggles yet to come:\nThere is a religious war going on in our country for the soul of America.",
    "The three male GOP candidates for Michigan attorney general supported the reversal of Griswold v. Connecticut (1965), a Supreme Court ruling that granted married couples a “right to marital privacy,” to buy and use contraceptives.",
    "Abbot’s action followed an opinion by state Attorney General Ken Paxton that providing transgender children with “medical procedures” was a form of “child abuse.” On March 1st, a Texas state judge blocked the governor’s order.",
    "Seven states (i.e., North Dakota, South Dakota, Mississippi, Indiana, Arkansas, South Carolina and Florida) have adopted similar laws and four others (i.e., Kentucky, Louisiana, Oklahoma and Ohio) are expected to follow.",
    "The right is actively promoting – and organizing around – a handful of key culture war issues – a woman’s right to determine her pregnancy, the rights of gay/transgender youth, “critical race theory” and book censorship.",
    "The Christian right’s great fear of personal sexual freedom finds particular expression in efforts to have local school boards and state education agencies censor what school-age children can read.",
    "Toby Price, the assistant principal at a Gary Road Elementary School in Byram (MS), near Jackson, was recently fired for reading I Need a New Butt, by Dawn McMillan and illustrated by Ross Kinnard.",
    "“Critical race theory” began as a law-school theory in the 1980s has morphed into a catch-all concept for any serious consideration of the history or experience of race relations in this country.",
    "More than a decade of social struggle over civil rights and wide-spread student protests against the war in Vietnam and Southeast Asia fueled as the widespread popularity of the counterculture.",
    "They are waging an apparently coordinated campaign against a woman’s right to determine her pregnancy, gay/transgender rights, “critical race theory,” book censorship and religious beliefs.",
    "In higher grades, it prohibits teaching about homosexuality in a manner that is “not age appropriate or developmentally appropriate for students” as determined by state academic standards.",
    "Still other popular children’s works that have been bannedare the Brothers Grimm’s Little Red Riding Hood, Louise Fitzhurgh’s Harriet the Spy and David Pilkey’s Captain Underpants.",
    "In February ‘73, three of the nation’s richest conservatives – Joseph Coors, Richard Mellon Scaife and H. L. Hunt — backed Paul Weyrich and the creation of the Heritage Foundation.",
    "In addition, with an increasingly conservative, if not reactionary, Supreme Court in power, all the culture wars issues being pressed by state Republicans may become national laws.",
    "Adding, they don’t know “that baby inside them may be the next president.”\nConservative efforts to restrict sexuality is being extended to criminalize access to birth control.",
    "On February 24th, the Florida House approved HB 1557 — “Don’t Say Gay” bill — that would prohibit instruction about sexual orientation and gender identity in early grades.",
    "It was a movement marked by sex, drugs & rock-and-roll, the emergence of second-wave feminism and the gay liberation movement as well as the rise of consumer activism.",
    "In 1972, Phyllis Schlafly, a conservative lawyer and writer, launched a successful counteroffensive to block the adoption of the Equal Rights Amendment (ERA).",
    "One conservative politician, Garrett Soldano, a GOP candidate for Michigan governor, advocated for prohibiting female rape victims from securing an abortion.",
    "In May, the National Council of Catholic Bishops spun off its National Right to Life Committee (NRLC) into a separate, activist anti-abortion organization.",
    "Often unappreciated, her “STOP-ERA” campaign became more than a single-issue “war,” more than an effort to block a proposed constitutional amendment.",
    "And Ruby Bridges’s Ruby Bridges Goes to School, a personal account of a six-year-old Black girl integration of New Orleans schools, has been banned.",
    "They were strengthened by Donald Trump’s presidency, empowered by the January 6th attack on the U.S. Capitol and strengthened by the anti-vaxxers.",
    "The right is building a very militant base, as indicated by the vehemence of the January 6thattackers on the Capitol and the anti-vaxxer movement.",
    "David Rosen is the author of Sex, Sin & Subversion: The Transformation of 1950s New York’s Forbidden into America’s New Normal (Skyhorse, 2015).",
    "Now, a half-century after the Supreme Court’s momentous 1973 Roe decision, a woman’s right to an abortion appears on the verge of being ended.",
    "The Texas Supreme Court recently ruled in support of a May 2021 state law (SB-8) prohibiting an abortion after the fetus is six weeks old.",
    "A 2021 Gallup poll found that, for the first time in 80 years, less than half of American adults belong to a church, synagogue or mosque.",
    "And in that struggle for the soul of America, [Bill] Clinton and [Hillary] Clinton are on the other side, and George Bush is on our side.",
    "In January 1973, two days after Richard Nixon was inaugurated as president, the Supreme Court issued its momentous Roe v. Wade decision.",
    "Justin Richardson’s And Tango Makes Three, a story of two male penguins raising a chick, has been censored for depicting homosexuality.",
    "The Hill reports that at least 123 bills that would restrict transgender rights have been introduced in legislatures in 29 states.",
    "… This project rewrites American history to teach our children that we were founded on the principle of oppression, not freedom.",
    "Schlafly, a devoutly Catholic and rightwing activist, was a militant anticommunist long affiliated with the John Birch Society.",
    "There should not be the slightest hesitation to press vigorously in all political arenas for support of the enterprise system.",
    "Henry McMaster (R-SC) pulled Maia Kobabe’s Gender Queer from school libraries; Virginia and Texas have also attacked the book.",
    "This year’s Congressional elections may come down to five concerns – inflation, immigrants, voting, guns and cultural values.",
    "The actions in Texas and Florida are only the tip of growing mountain of anti-trans actions being taken across the country.",
    "In September, the American Legislative Exchange Council (ALEC) was founded as the Conservative Caucus of State Legislators.",
    "Donald Trump:\nThe left has warped, distorted, and defiled the American story with deceptions, falsehoods, and lies.",
    "Among such works are Art Spieglman’s Maus, Harper Lee’s To Kill A Mockingbird and John Steinbeck’s Of Mice and Men.",
    "The current round of the culture wars began a half-century ago in reaction to social disruption that was the ‘60s.",
    "Today’s culture wars are driven by white evangelical Christians, a large part of the Republican activist base.",
    "It “would prohibit the use of federal funds to teach the 1619 Project by K-12 schools or school districts.",
    "It is a cultural war, as critical to the kind of nation we will one day be as was the Cold War itself.",
    "It is being aided by militant conservatives in very high places in government and society.",
    "There is no better example than the New York Times‘ totally discredited 1619 Project.",
    "Such battles have defined America since the nation’s founding four centuries ago.",
    "Price, whose been teaching for two decades, called it a “fun” and “silly” book.",
    "He can be reached at drosennyc@verizon.net; check out www.DavidRosenWrites.com.",
    "These developments set the agenda for the culture was that persist till today.",
    "If, as Buchanan warned, “a religious war [was] going on,” religion is losing.",
    "Schlafly aligned her campaign to conservative opposition to the Roe decision.",
    "Nor should there be reluctance to penalize politically those who oppose it.",
    "He read the story to some 200 second graders via a Zoom hook-up.",
    "Influential corporate Americans took Powell’s warning to heart.",
    "This Pulitzer Prize winning study was assailed by former Pres.",
    "“Nothing could be further from the truth,” he continued.",
    "Bill Clinton won the ’92 presidential election.",
    "“God put them in this moment,” he said.",
    "In addition, Gov.",
    "Gov."
  ]
}