{
  "id": 26405,
  "mediaId": 6511,
  "date": "2022-03-19",
  "headline": "Candidatos republicanos al Senado por Ohio casi se van a los golpes en medio de acalorado debate",
  "image": "https://laopinion.com/wp-content/uploads/sites/3/2022/03/GettyImages-1239309818.jpg?quality=80&strip=all&w=1200",
  "link": "https://laopinion.com/2022/03/19/candidatos-republicanos-al-senado-por-ohio-casi-se-van-a-los-golpes-en-medio-de-acalorado-debate/",
  "mediaOutlet": "LA OPINIÓN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13803,
    13942,
    14293,
    14306,
    14317
  ],
  "sentences": [
    "Por lo que Mandel se fue a sentar de nuevo a su silla, Gibbons le dijo “No sabes ponerte de cuclillas”, lo que hizo que Mandel se levantara de su asiento, por lo que Gibbbons le dijo al otro aspirante al Senado que “retrocediera”.",
    "Foto: Andrew Spear / Getty Images\nEn un foro de candidatos al Senado de Estados Unidos llevado a cabo este viernes en la noche, dos de los aspirantes republicanos, Mike Gibbons y Josh Mandel, casi se van a los golpes.",
    "“Josh Mandel está desquiciado, no está en forma y se agita porque está perdiendo”, dijo por su parte la representante de la campaña de Gibbons, Samantha Cotten, en un comunicado tras el incidente.",
    "UU., y los votantes de Ohio vieron de primera mano cuán poco preparado se ha vuelto Josh Mandel, y eso se reflejará en la boleta electoral el 3 de mayo”.",
    "Ellos son dos de los siete candidatos republicanos que se enfrentaran a las elecciones primarias que se celebrarán el 3 de mayo en el estado de Buckeye.",
    "“Es posible que no entiendas esto”, le respondió Gibbons a Mandel, quien se levantó de su silla y se puso de frente a Gibbons en el evento.",
    "La disputa inició luego de que Mandel afirmara que Gibbons había “ganado millones” de dólares en negociaciones con empresa de China.",
    "En ese momento el moderador del evento se acercó a los dos candidatos e intentó calmar los ánimos.",
    "“Retrocede”, respondió Mandel, diciéndole a Gibbons que estaba “tratando con el tipo equivocado”.",
    "Lea también:\nTrump llama a sus partidarios a “dar sus propias vidas” para defender a EE.UU.",
    "No me digas que no he trabajado”, respondió Mandel, elevando la voz hacia su contrincante.",
    "“Nunca… nunca has estado en el sector privado en toda tu vida”, le dijo Gibbons a Mandel.",
    "No tiene el temperamento, la experiencia o la fortaleza para ser un senador de los EE.",
    "Mandel, fue tesorero estatal, mientras que Gibbons es un hombre de negocios.",
    "“Solo es un profesional en una cosa: postularse para un cargo.",
    "Está empeñado en mentir porque está fallando.",
    "contra la Teoría Crítica de la Raza",
    "“Mira lo que sucede”, dijo Mandel.",
    "“Observa lo que sucede”.",
    "“Si”, le dijo Mandel.",
    "“Dos giras en Irak."
  ]
}