{
  "id": 26412,
  "mediaId": 2517,
  "date": "2022-04-06",
  "headline": "EXCLUSIVE: Ohio Senate Candidate Josh Mandel Pocketed Donations Intended for 2018 GOP Nominee, Paid Tens of Thousands to Mistress",
  "image": "",
  "link": "https://archive.ph/Pn0Jr",
  "mediaOutlet": "archive.is",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    13760,
    13803,
    14097,
    13285,
    13312,
    13372,
    14317
  ],
  "sentences": [
    "Three dozen Republican women, including three women who left Mandel’s campaign citing a toxic work environment created by Wilson in her continuing duties with Mandel’s 2020 campaign, have urged Ohio Republicans to reject Mandel, warning he’ll “embarrass” the party if nominated as a candidate for the US Senate.",
    "It’s likely Mandel’s personal life will become a target of criticism for a Democrat competitor in a general election- it’s one thing for voters to look beyond personal affairs in the distant past, and quite different to run for federal office while carrying out adulterous affairs with campaign staff.",
    "Mandel broke onto the scene of national politics as a protege of war criminal Bill Kristol, handpicked as an instrument to advance the nefarious neoconservative’s political views in the United States Senate in an ultimately failed 2012 campaign against Sherrod Brown.",
    "Mandel has run for statewide office five times in the past 12 years, with some Ohio Republicans criticizing Mandel, who has served in elected office since 2003, as a career politician who’ll put on the act he needs to in pursuit of the next political gig.",
    "Sources familiar with Mandel’s 2018 campaign also describe the career politician as accepting donations from high-level Republican fundraisers, who expected the Ohio state treasurer to become the presumptive Republican nominee for the Senate.",
    "These hefty transactions may very well have been paid for by big and small donors who expected to support the Republican candidate for the Senate in 2018, and could’ve gone to use supporting Renacci rather than Mandel’s mistress.",
    "Mandel continually cites what he identifies as Judeo-Christian values as the force behind his candidacy, conflating two distinct religions, neither of which sanction adultery, let alone as a candidate for public office.",
    "After Mandel dropped out, citing concerns with his wife’s health, he did nothing to spend the money to support Jim Renacci, a Republican Congressman who was nominated by Ohio Republicans for the Senate.",
    "Kristol, an advocate of Middle East regime change wars Donald Trump partly ran against in 2016, had recruited Mandel as a candidate in Ohio’s 2012 US Senate election to challenge Sherrod Brown.",
    "Two of the payments made to Wilson- one from his campaign for $8,000, and another from his PAC for $50,000- were made after Mandel ended his 2018 campaign for the Senate.",
    "Ohio Republican Senate candidate Josh Mandel paid tens of thousands of dollars to a woman he was dating during his 2018 Senate campaign, while married to another woman.",
    "FEC reports show that Rachel Wilson, Mandel’s finance director and mistress, was paid more than $100,000 between his 2018 campaign and a PAC supporting his candidacy.",
    "Mandel is currently competing for the Senate nomination with populist author and investor JD Vance, who is one of few national Republicans backed by Tucker Carlson.",
    "Questions of Mandel’s ethics go beyond his financial arrangements with his girlfriend while he was married to another woman.",
    "Both men have sought an endorsement from Donald Trump, which could prove to be the game-changer in the competitive primary.",
    "He ended his campaign citing his wife’s health, later divorcing her in 2020 to continue his affair with Wilson.",
    "It appears that Mandel kept the money to support his current 2022 Senate campaign.",
    "Save my name, email, and website in this browser for the next time I comment.",
    "It’s widely known that Mandel was in an affair with Wilson at the time.",
    "Follow me on Gab @WildmanAZ, and on Twitter @Wildman_AZ!",
    "Renacci lost to Sherrod Brown."
  ]
}