{
  "id": 26444,
  "mediaId": 2746,
  "date": "2022-02-21",
  "headline": "Disgraced ex-Missouri Gov. Eric Greitens to speak at CPAC",
  "image": "https://twt-thumbs.washtimes.com/media/image/2021/12/18/election_2022_senate_missouri_49080_c0-39-2000-1205_s1200x700.jpg?d391696eb0fbe9e3a7c94792fde91ddf0ae17171",
  "link": "https://www.washingtontimes.com/news/2022/feb/21/eric-greitens-ex-missouri-governor-speak-cpac/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mica Soellner",
  "authorUrl": "https://www.washingtontimes.com/staff/mica-soellner/",
  "termIds": [
    13389,
    13615,
    13803,
    13192,
    14260,
    14308,
    14317,
    14321
  ],
  "sentences": [
    "Mr. Greitens, who is running for Missouri’s open Senate seat, will deliver remarks on Friday, along with GOP Senate candidates Josh Mandel of Ohio and Adam Laxalt of Nevada, a former state attorney general.",
    "Mr. Greitens’ accuser also said he took nude photos of her and threatened to leak them if she had told anyone about the incident, in addition to alleging that he slapped her and called her degrading names.",
    "Among the allegations, Mr. Greitens was accused by his hairstylist of taking her to his basement, blindfolding her, binding her hands, and forcing her into performing oral sex.",
    "Along with Mr. Greitens, Reps. Billy Long, Vicki Hartzler, and Missouri Attorney General Eric Schmitt are running for the seat to replace retiring GOP Sen. Roy Blunt.",
    "Eric Greitens is scheduled to speak this week at the Conservative Political Action Conference in Orlando, Florida, as he seeks a comeback from scandal.",
    "Mr. Greitens later confirmed he had an extramarital affair, but denied the accusations that he had been violent or blackmailed anyone.",
    "Mr. Greitens resigned as Missouri’s governor in 2018 amid allegations of sexual abuse and campaign finance crimes.",
    "CPAC is scheduled to begin on Thursday with marquee speakers including former President Donald Trump, Florida Gov.",
    "Since then, Mr. Greitens has rebranded himself as a leading pro-Trump candidate in a crowded primary field.",
    "Democrats in the race include Marine veteran Lucas Kunce and former state Sen. Scott Sifton.",
    "Ron DeSantis, and former Secretary of State Mike Pompeo.",
    "Former Missouri Gov."
  ]
}