{
  "id": 26462,
  "mediaId": 2594,
  "date": "2022-01-26",
  "headline": "JD Vance mocked for celebrating Marjorie Taylor Greene endorsement as he vows to take US back from ‘scumbags’",
  "image": "https://static.independent.co.uk/2021/04/29/21/GettyImages-813399326.jpg?quality=75&width=1200&auto=webp",
  "link": "https://www.independent.co.uk/news/world/americas/us-politics/vance-marjorie-taylor-greene-endorsement-b2000575.html",
  "mediaOutlet": "Independent",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Graig Graziosi",
  "authorUrl": "https://www.independent.co.uk/author/graig-graziosi",
  "termIds": [
    13581,
    13702,
    13803,
    13848,
    14045,
    13355,
    13369,
    14317
  ],
  "sentences": [
    "In doing so, he has pivoted from taking a more nuanced approach to politics and has instead adopted the right-wing bomb thrower rhetoric exemplified by individuals like Ms Greene, Congresswoman Lauren Boebert, and Representative Matt Gaetz.",
    "“Really enjoying watching you debase yourself to try to claim power that Republican voters are never going to give you because they can smell the fact the you're a big fat phony,” another user wrote.",
    "In addition to Ms Greene, right-wing tech billionaire Peter Thiel has also backed his campaign, and has reportedly leaned on Mr Trump to provide Mr Vance with his endorsement.",
    "Mr Mandel's camp has been quick to capitalise on Mr Vance's past anti-Trump statements, including them in campaign advertisements and bringing them up during speaking events.",
    "Mr Mandel has been playing the extreme rhetoric playbook for longer than Mr Vance, suggesting the latter's transformation is an attempt to flank his opponent from the right.",
    "Mr Vance's pivot from folksy intellectual to belligerent “patriot” is likely a tactic employed to take on his primary rival, former Ohio State Treasurer Josh Mandel.",
    "Ohio senatorial candidate JD Vance was roundly mocked on Twitter after he celebrated an endorsement from extremist right-wing Congresswoman Marjorie Taylor Greene.",
    "In previous statements Mr Vance called Donald Trump “cultural heroin” and said the former president would lead “the white working class to a very dark place”.",
    "In other words, JD Vance is a hypocritical, elitist scumbag,” Liberal radio host Dean Obeidallah wrote in response.",
    "Mr Vance went so far as to delete old tweets in which he criticised Mr Trump and his extreme populist politics.",
    "We're going to win this thing and take the country back from the scumbags,\" Mr Vance wrote on Twitter.",
    "The Hillbilly Elegy author is vying for a senatorial seat left vacant by outgoing Senator Rob Portman.",
    "However, Mr Vance's naked opportunistic shift has thus far has been largely unsuccessful.",
    "He graduated from Yale Law school and made $ from Big Tech in Silicon Valley.",
    "He has referred to Mr Vance as a “RINO just like Romney and Liz Cheney”.",
    "Despite his past, Mr Vance has attracted some high profile backers.",
    "Recent polling shows Mr Vance is trailing Mr Mandel by six points.",
    "He smeared Trump as ‘reprehensible’ but now he sucks up to him.",
    "“JD Vance calls Democrats ‘scumbags’ as political theater.",
    "\"Honored to have Marjorie's endorsement.",
    "But no one seems to be buying it."
  ]
}