{
  "id": 26495,
  "mediaId": 2716,
  "date": "2022-01-25",
  "headline": "Ohio Senate candidate JD Vance 'honored' to have Marjorie Taylor Greene's endorsement",
  "image": "https://mediacloud.theweek.com/image/upload/s--X-WVjvBW--/f_auto,t_content-image-full-desktop@1/v1643126649/GettyImages-1356625451.jpg",
  "link": "https://theweek.com/marjorie-taylor-greene/1009385/ohio-senate-candidate-jd-vance-honored-to-have-marjorie-taylor",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    13592,
    13702,
    14212,
    13215,
    13285,
    13372,
    14317
  ],
  "sentences": [
    "Controversial lawmaker and Trump ally Rep. Marjorie Taylor Greene (R-Ga.) endorsed Hillbilly Elegy author JD Vance in his Ohio Senate bid on Tuesday, urging voters in her statement to \"to start electing strong conservatives\" who \"put people over politicians and understand exactly what we're up against,\" per The Hill.",
    "Unfortunately, there are too few like her, and so long as that's the case, Republicans may win an election from time to time, but we'll never do the difficult work of truly taking our country back from the leftwing mob and the woke corporations.\"",
    "Other GOP candidates running for U.S. Senate in Ohio include \"former state Republican Party Chairwoman Jane Timken, former state Treasurer Josh Mandel, businessman Bernie Moreno and investment banker Mike Gibbons,\" The Hill notes.",
    "\"JD Vance is the conservative warrior that the entire America First movement needs fighting for us in the U.S. Senate, and that's why I'm proud to endorse him,\" Greene told Fox News.",
    "Not long ago Vance was a critic of the ex-commander in chief; these days, he \"has sought to cast himself as a warrior for Trump's political movement,\" The Hill writes.",
    "The firebrand representative's endorsement is a \"big get\" for Vance, one of many Republicans in the Ohio race vying for former President Donald Trump's support.",
    "Recently, the conspiracy theory-touting Greene was permanently suspended from Twitter for repeated violations of the platform's COVID-19 misinformation policy.",
    "\"I've gotten to know her over the last year, and she's precisely the type of leader we need in our party: genuine, honest, and courageous.",
    "Vance (@JDVance1) January 25, 2022\n\"I am so honored to have Marjorie's support,\" Vance said, per The Hill.",
    "Last year, she was also stripped of her House committee assignments following backlash to past comments.",
    "We’re going to win this thing and take the country back from the scumbags.",
    "Honored to have Marjorie’s endorsement.",
    "https://t.co/tKFWOvRvq3\n— J.D."
  ]
}