{
  "id": 26541,
  "mediaId": 2524,
  "date": "2022-01-28",
  "headline": "Josh Mandel is the most idiotic robot running for Senate in Ohio, making him GQP's frontrunner",
  "image": "https://i0.wp.com/boingboing.net/wp-content/uploads/2022/01/josh.jpg?fit=1200%2C664&ssl=1",
  "link": "https://boingboing.net/2022/01/28/josh-mandel-is-the-most-idiotic-robot-running-for-senate-in-ohio-making-him-gqps-frontrunner.html?utm_source=rss&utm_medium=rss&utm_campaign=josh-mandel-is-the-most-idiotic-robot-running-for-senate-in-ohio-making-him-gqps-frontrunner",
  "mediaOutlet": "Boing Boing",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Carla Sinclair",
  "authorUrl": "https://boingboing.net/author/carlasinclair",
  "termIds": [
    13803,
    13285,
    13372,
    14317
  ],
  "sentences": [
    "He dug in his heels, arguing that he had every right to spew his toxic views — even in a school board district that he does not live in.…\nWe thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views.",
    "Whether we're talking about everyday stuff like making dinner or going to the gym, or more important stuff like special projects at…\nWe thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views.",
    "His recycled platitudes are as brainless and stale as they come: coronavirus is a bio-weapon, America was founded only on Judeo-Christian values, he is pro-God, he is pro-gun, he is pro-Trump.",
    "After all, wine is basically the elixir of the…\nWe thank our sponsor for making this content possible; it is not written by the editorial staff nor does it necessarily reflect its views.",
    "Sheriffs in Ohio asked US Senate candidate, Josh Mandel, to leave a school board meeting on Monday after he took the mic to bash transgender students.",
    "Yep, the same ol' same ol' big lies, bluster, and complete ignorance of the constitution.",
    "Wine lovers are a passionate sort, always on the hunt for a quality wine to obsess over.",
    "Ohio Senate candidate Josh Mandel brings nothing new to the GQP funhouse.",
    "That is until we try to sleep at night, and we just can't do it.",
    "A perfect frontrunner for Ohio's 2022 Republican primaries.",
    "Ever notice how everything is hard when you're exhausted?",
    "\"I believe the 2020 election was stolen from Donald J.",
    "We love the warmer temperatures that spring brings.",
    "And the electricity bill that…",
    "And why shouldn't they be?",
    "It's too hot!",
    "Trump.\""
  ]
}