{
  "id": 26592,
  "mediaId": 6598,
  "date": "2022-02-22",
  "headline": "Trump latest news: Ex-president dismisses plan to make him House speaker amid outrage at his appeal to Putin",
  "image": "https://static.independent.co.uk/2022/03/28/03/UCRANIA-TRUMP_90023.jpg?quality=75&width=1200&auto=webp",
  "link": "https://news.google.com/__i/rss/rd/articles/CBMicmh0dHBzOi8vaW5kZXBlbmRlbnQuY28udWsvbmV3cy93b3JsZC9hbWVyaWNhcy91cy1wb2xpdGljcy90cnVtcC1uZXdzLXRvZGF5LXRydXRoLXNvY2lhbC1qYW4tNi1sYXRlc3QtYjIwMjAxNTUuaHRtbNIBemh0dHBzOi8vd3d3LmluZGVwZW5kZW50LmNvLnVrL25ld3Mvd29ybGQvYW1lcmljYXMvdXMtcG9saXRpY3MvdHJ1bXAtbmV3cy10b2RheS10cnV0aC1zb2NpYWwtamFuLTYtbGF0ZXN0LWIyMDIwMTU1Lmh0bWw_YW1w?oc=5",
  "mediaOutlet": "shoebat.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Close Trump calls for Putin to release dirt on the Biden family\n\nDonald Trump poured cold water on suggestions that he could be elected speaker of the House of Representatives by Republicans after this November’s midterm elections – an idea that has been floated by some of his more hardcore congressional allies.",
    "Meanwhile, it emerged that White House phone records from 6 January 2021 obtained by the committee investigating the Capitol riot feature a 7-hour gap in former President Donald Trump’s communications, a span of time that includes the assault on the building by a horde of his supporters.",
    "Later on Tuesday, former national security adviser John Bolton said that contra the ex-president’s denials, Mr Trump was aware of the slang term “burner phone” – and that he used the term on multiple occasions.",
    "This he did in the same interview where he called on Vladimir Putin to release dirt about the Biden family’s supposed dealings with the wife of the mayor of Moscow.",
    "His appeal to the Russian autocrat has drawn outrage given Mr Putin’s current assault on Ukraine, an American ally.",
    "Instead, the president said, “I wanna look at what’s happening and then we’re gonna be doing something else”.",
    "?"
  ]
}