{
  "id": 26596,
  "mediaId": 2557,
  "date": "2022-03-19",
  "headline": "VIDEO: Republican Senate hopefuls nearly come to blows during primary debate: ‘You don’t know squat’",
  "image": "https://dennismichaellynch.com/wp-content/uploads/2022/03/GettyImages-1269930175.jpg",
  "link": "https://dennismichaellynch.com/video-republican-senate-hopefuls-nearly-come-to-blows-during-primary-debate-you-dont-know-squat/",
  "mediaOutlet": "dennismichaellynch.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Please Enter Your Name Here",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Sign up for DML's newsletter\n\nAs the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DailyMail: Two Ohio Senate hopefuls nearly came to blows Friday night during a crowded primary debate after getting into a heated argument over Chinese petroleum and whether or not they’ve ‘worked.’ Republican candidates Mike Gibbons, 69, a businessman, and Josh Mandel, 44, a veteran, both of Cleveland, got hot and bothered during Gibbons’ talk where the younger man accused him of ‘making millions’ off Chinese petroleum.",
    "The article goes on to state the following: In a video posted to Twitter, the former Marine began attacking the businessman over his assets in China, stating: ‘You filed that with the federal elections committee for stock in Chinese .’\n\nGibbons said he “personally didn’t buy the stock.”\n\nMandel, a former Ohio Treasurer, kept pressing.",
    "pic.twitter.com/fQuqfHxXHT — Heartland Signal (@HeartlandSignal) March 18, 2022\n\nAccording to the report, Gibbons has disclosed assets between $83 million and $286 million, while Mandel has disclosed assets of at least $2.2 million.",
    "Amid “ooh’s” coming from the crowd, Gibbons repeated his earlier taunt, saying, “You don’t know squat.”\n\nThe two men continued to exchange words as a moderator attempted to separate them.",
    "Don’t tell me I haven’t worked.”\n\nMandel “graduated first in boot camp and in his class in the Marine Corps Intelligence School,” the Daily Mail reports.",
    "I’d loved to have made millions off of Chinese petrol.”\n\nMandel listed Shanghai Shenda and Chinese petroleum as two Chinese assets for Gibbons.",
    "WATCH what happened:\n\nMike Gibbons and Josh Mandel get in each other’s faces at tonight’s GOP #OHSen forum hosted by FreedomWorks.",
    "“I’ve worked, sir.”\n\nGibbons pressed on, taunting Mandel by saying, “You don’t know squat,” as the two men stood toe-to-toe.",
    "And if you have the DML NEWS APP, please tell people to download it today and help conservatives have a real voice.",
    "“’You may not understand this, because you’ve never been in the private sector in your life,” Gibbons shot back.",
    "“I do,” Mandel answered, rising from his seat and squaring off with Gibbons.",
    "Mandel shot back, “Two tours in Iraq, don’t tell me I haven’t worked.",
    "To get more information about this article, please visit DailyMail.",
    "Gibbons joked, “I don’t think I made millions off of anything.",
    "“But you made millions off it, sir,” he told Gibbons.",
    "Listen to the latest daily DML podcasts below!",
    "“You watch what happens,” Mandel says.",
    "Then please share."
  ]
}