{
  "id": 26599,
  "mediaId": 2575,
  "date": "2022-03-20",
  "headline": "Republican Ohio Senate candidate calls opponent ‘p---y’ in near-altercation at debate",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-news/4048280/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "To: cotton1706\n\nTo: cotton1706\n\nI don't know what to make of this._/i> I will tell you exactly what Yahoo News wants you to make of it, if it's not already glaringly obvious: Yahoo News, which is a leftist activist newsmag, wants readers to see the headline and connect Josh Mandel with Trump's surrepticiously recorded \"grab em by the pussy\" comment, which was effectively used by the leftist activist media to turn left-leaning winemoms throughout America into stark raving loons and keep non left-leaning winemoms from ever voicing their support of Trump to their winemom friends.",
    "It's a totally different context, the two candidates were basically trying to smacktalk each other and Mandel questioned his assertiveness (used to be a time when people understood \"pussy\" was more than a nickname for lady bits, here it refers to a pussy cat, or a cowardly person), but that's not what Yahoo wants you to think.",
    "Mandel attacked Gibbons for “making billions of dollars by shipping Ohio businesses to China.” Gibbons shot back that Mandel didn’t understand business because he’d “never been in the private sector in your life.”\n\nThat brought Mandel, an ex-Marine, out of his seat, as he shouted back “Two tours in Iraq!",
    "Don’t tell me I haven’t worked!”\n\nThe moderator attempted to break it up, but the two continued yelling over each other, with Gibbons telling Mandel to “Back off, buddy” and Mandel countering with “You back off!”\n\nAs he turned away, Mandel muttered “Watch what happens.",
    "“has that guy run a business, or after his bit, was he an employee?”\n\n\n\nTo: cotton1706\n\nStopped reading at “they might be right-wingers...”\n\n\n\nby 3 posted onby Deo volente (\"When we see the image of a baby in the womb, we glimpse the majesty of God's creation.\"",
    "Watching only these stupid debates, which are moderated by Leftists and hyped like some sort of sporting event - is a sure fire way to get people to focus on the wrong things - and to let Leftists tell us what we should care about.",
    "TOPICS:\n\nConstitution/Conservatism\n\nPolitics/Elections\n\nUS: Ohio\n\nKEYWORDS:\n\n2022election\n\n2024election\n\nchina\n\nelection2022\n\nelection2024\n\nelections\n\njoshmandel\n\nmikegibbons\n\nohio\n\nwhoops\n\nI don't know what to make of this.",
    "Not sure if blindness is an issue\n\nNot sure if blindness is an issue\n\nTo: cotton1706\n\nMandel is a perennial politician with a modest record, has never excited the electorate much since a stint as state treasurer.",
    "And, frankly, worrying that it is a problem if a candidate is a fighter (like Trump), or calls people names in debates (like Trump), or uses the word “pussy” (like Trump) - is why we have so many RINOs.",
    "by 5 posted onby HighSierra5 (The only way you know a commie is lying is when they open their pieholes.p)\n\nTo: HighSierra5\n\nMandel is the America First candidate who has been on Bannon’s War Room.",
    "Of course “investment banking” is also a red flag....especially is that is where the financing for that campaign comes from....\n\n\n\nby 9 posted onby cgbg (A kleptocracy--if they can keep it.",
    "Republican Ohio Senate candidate calls opponent ‘p---y’ in near-altercation at debate\n\nPosted on by cotton1706\n\nThey might be right-wingers, but they met in the middle of this stage.",
    "by 8 posted onby griswold3 (When chaos serves the State, the State will encourage chaos)\n\nTo: Blurb2350\n\nThe details of the “two tours in Iraq” would be interesting.",
    "Maybe some vets could comment on this as Mandel claims to be a “combat veteran.”\n\n\n\nTo: cotton1706\n\nThis kind of exchange is not nearly enough to base a decision on.",
    "Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "Trump)\n\nTo: cotton1706\n\n“Maybe it’s just me but “two tours in Iraq” is not an argument ender, and frankly gets under my skin.” You’re not alone in this.",
    "Listen to their entire spiel and decide whether they are truly MAGA, and will stand firm, or whether they are weak and ready to compromise.",
    "Wall Street money manipulator who doesn’t give a d-— about average Americans, other than a reservoir of productivity to be ripped off.",
    "It's the same as not being able to criticize John McCain's Senate voting record because he was once captured by the North Vietnamese.",
    "Career politician Josh Mandel called investment banker Mike Gibbons a “p---y” under his breath at the end of the heated exchange.",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "by 4 posted onby Blurb2350 (posted from my 1500-watt blow dryer)\n\nTo: cotton1706\n\nI wanna see a knock down, drag out fight.",
    "by 14 posted onby McBuff (To be, rather than to seem)\n\nTo: cotton1706\n\nHow is he a career politician if he served in Iraq?",
    "He has not used the veteran card in past elections to my recollection, so he must have been advised to try it this time.",
    "As we all know many of the folks who brag about their military service are the ones who stayed far behind the lines...",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "by 7 posted onby SunkenCiv (Imagine an imaginary menagerie manager imagining managing an imaginary menagerie.)",
    "March; Berosus; Bockscar; BraveMan; cardinal4; ...\n\nWhat's high in the middle, and even more high at the end?",
    "Two Republican candidates to represent Ohio in the U.S. Senate nearly came to blows at a debate Friday night.",
    "But whether he can implement policy rather than join/vote the GOPe party line is yet to be determined.",
    "To: cgbg\n\nMandel was a reservist who served as a battalion intelligence person in the city of Hadith.",
    "Maybe it's just me but \"two tours in Iraq\" is not an argument ender, and frankly gets under my skin.",
    "There was a lot of violence at times but how much he would have been involved as S2, I can’t say.",
    "He is angry about the stolen election, the open border, giving up our energy independence, etc.",
    "Gibbons is a businessman, newcomer to electoral politics, running as a Trump-like outsider.",
    "Talks a good game but in the end he’ll be another Mitt Romney, and for the same reasons.",
    "Gibbons is posing as “Trump-tough” while Mandel‘s ads are rather pugnacious.",
    "Looking for the term “left-winger” anywhere in that clown show’s news.",
    "I’ve seen Josh Mandell a couple times as a guest on Bannon’s War Room.",
    "Many of the folks who saw real action do not want to talk about it.",
    "To: cotton1706\n\nWow, “right-winger” used in the first sentence.",
    "To: cotton1706\n\nMandel has personal character issues, imho.",
    "I would tend to trust a marine over an investment banker….",
    "To: cotton1706\n\nThe military isn’t the “private sector”.",
    "I'd be interested to know what Ohioans think about this.",
    "To: cotton1706\n\nGibbons is the Vampire Squid candidate.",
    "I don’t think it will wear well until the May primary.",
    "In my opinion, I'd rather Gibbons take the nomination.",
    "To: cotton1706\n\nok a guy did his bit for his country.",
    "To: AdmSmith; AnonymousConservative; Arthur Wildfire!",
    "Is there a China connection we don’t know about yet?",
    "P---y.”\n\n\n\n(Excerpt) Read more at news.yahoo.com ...",
    "by 20 posted onby Fresh Wind (We are living in 1984.",
    "To: cotton1706\n\nNo such thing as an “ex-Marine”.",
    "Think of it as the Cantillon Effect in action.)",
    "Well heck, left wingers just must not exist.",
    "Marines aren’t typically behind the lines….",
    "Mandel probably will have Trump’s backing.",
    "Mandel would also probably win the fight.",
    "Nice kid, but…\n\nGibbons is an outsider.",
    "Anyone who believes that is an idiot.",
    "We have always been living in 1984.)",
    "- all the things I am angry about.",
    "Study these candidates thoroughly.",
    ".once a Marine, always a Marine.",
    "And he is unabashedly pro Trump.",
    "He is the real deal.",
    "He knows the issues.",
    "And datz da twuth.",
    "Follow the money.",
    "Skip to comments.",
    "He is a fighter.",
    "Still looking.",
    "And looking.",
    "Pres.",
    "."
  ]
}