{
  "id": 26603,
  "mediaId": 2575,
  "date": "2022-04-08",
  "headline": "Veterans Over Illegals",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-news/4053381/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Veterans Over Illegals\n\ntownhall.com ^ | 4/8/2022 0001 hrs edt | Josh Mandel\n\nPosted on by rktman\n\nThe federal government is giving billions of dollars in subsidies to illegal immigrants while tens of thousands of American veterans remain homeless.",
    "by 2 posted onby Lurkinanloomin ( (Natural born citizens are born here of citizen parents)(Know Islam, No Peace-No Islam, Know Peace)\n\nTo: rktman\n\nJo Jo the Pedo clown says, “Under the Brandon administration, XENOS come first!!!",
    "by 5 posted onby Harpotoo (Being a socialist is a lot easier than having to WORK like the rest of US:-))\n\nTo: rktman\n\nThe VA, at least my local office here in Alaska, has gone to sh!t since Biteme took over.",
    "by 4 posted onby MrBambaLaMamba (The only good commie is one that's dead - Country Joe McDonald)\n\nTo: Lurkinanloomin\n\nAnd the 3 that allowed the Beeyatch to be confirmed to the SCOTUS.",
    "Disclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "Many homeless veterans are suffering from mental health issues, and in many cases those issues are directly traceable to their service to our country.",
    "We’ve made progress toward reducing the population of homeless veterans in recent years, but there’s still much more work to be done.",
    "According to the U.S. Department of Housing and Urban Development (HUD), there were an estimated 19,750 sheltered homeless veterans.",
    "It’s somewhere just slightly north of Honduras!”\n\n\n\nby 3 posted onby FlingWingFlyer (Don't blame me, I voted for President Trump.",
    "Yet all too often, we as a society turn a blind eye to their struggles, despite all that they’ve sacrificed for our benefit.",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "TOPICS:\n\nCulture/Society\n\nGovernment\n\nPolitics/Elections\n\nKEYWORDS:\n\ntrespassers\n\nvets\n\nPriorities there jar head.",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "As long as even one American veteran is still living on the streets, we shouldn’t spend a penny on illegals.",
    "To: rktman\n\nFJB is also redirecting medical personnel from VA hospitals to serve illegal aliens/invaders.",
    "The number of unsheltered homeless veterans is estimated to be just under 40,000 on any given night.",
    "by 6 posted onby Chuckster (Friends don't let friends eat farmed fish)\n\nTo: Chuckster\n\nHmmmm.",
    "They are short paying or not paying at all the doctor bills for the procedures they approved.",
    "The people in the Juneau office I used to talk to have all quit, retired or been reassigned.",
    "I can’t even get hearing aid batteries and they don’t return phone calls any more.",
    "As a Marine and Iraq war veteran, those are my brothers and sisters out there.",
    "So now it’s gonna be Pedos/Trannies/LGBTQRetards over the rest of US too!",
    "When I do get someone on the phone, they agree that it is all forked up.",
    "To: rktman\n\nBe sure to re-elect Amnesty Senators Rubio and Hoeven!",
    "Illegals should be deported and veterans should be prioritized.",
    "Those numbers should weigh heavily on the nation’s conscience.",
    "by 7 posted onby rktman (Destroy America from within?",
    "In so many ways, Biden has his priorities backwards.",
    "Nothing the worker bees can do about it though.",
    "Veterans can go to the back of the line.",
    "(Excerpt) Read more at townhall.com ...",
    "Guess I need to check on batteries too.",
    "Enlisted USN 1967 to end up with this?",
    "This issue is deeply personal to me.",
    "I c an’t get anything done.",
    "Let's Go Brandon!",
    "Get 'em straight.",
    "Skip to comments.",
    "Check!",
    "FJB!)",
    "WTH?",
    "??)"
  ]
}