{
  "id": 26601,
  "mediaId": 2575,
  "date": "2022-03-30",
  "headline": "Renacci Tops DeWine, Others in New Ohio Gubernatorial GOP Nomination Poll",
  "image": "https://freerepublic.com/l/favicon.ico",
  "link": "https://freerepublic.com/focus/f-news/4050827/posts",
  "mediaOutlet": "Free Republic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "NEWSPAPER",
  "termIds": [
    0
  ],
  "sentences": [
    "Trump won by 8\n\n\n\nby 9 posted onby griswold3 (When chaos serves the State, the State will encourage chaos)\n\nTo: cotton1706\n\nI think he was one who didn’t support Trump at all....during the 2020 fiasco...\n\n\n\nTo: Doofer\n\n“Looking at the 538 sight they say a poll hasn’t been done since Jan 4.” I’ve noticed that’s a little game the pollsters play.",
    "To: karatemom\n\nRenacci spent time in D.C.\n\n\n\nby 19 posted onby Lisbon1940 (I don’t see why they would)\n\nTo: Lisbon1940\n\nI know hence my hesitation\n\n\n\nDisclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management.",
    "“It’s definitely showing how the voters are moving in this race as we get down to the wire here, before the primary.”\n\nWeyand said that DeWine had been held to a 40 percent ceiling throughout the campaign, according to Renacci’s campaign’s own polling and analysis.",
    "“That recent Harris poll actually corroborates some massive internal data that we’ve collected over the last week or so with our phone banking operations,” said Tom Weyand, who is helming the former congressman’s campaign.",
    "-G.K. Chesterton)\n\nTo: JonPreston\n\nLooking at the 538 sight they say a poll hasn’t been done since Jan 4. https://projects.fivethirtyeight.com/polls/ohio/\n\n\n\nTo: cotton1706\n\nPlease let this be true.",
    "by 2 posted onby JonPreston (Q: Never have so many, been so wrong, so often)\n\nTo: JonPreston\n\nby 3 posted onby Fester Chugabrew (\"Poets have been mysteriously silent on the subject of cheese.\"",
    "TOPICS:\n\nConstitution/Conservatism\n\nPolitics/Elections\n\nUS: Ohio\n\nKEYWORDS:\n\nelections\n\n\n\n\n\nTo: cotton1706\n\nIs this a Trump Republican or a McConnell Republican?",
    "To: cotton1706\n\nSo DeWine has been in government for nearly 50 years, all the time watching our nation slowly collapse while doing noting meaningful to stop it.",
    "“We brought in 165,000 in-person responses, and we’re actually polling a little bit ahead of what that poll said, but it’s a snapshot in history,” he said.",
    "Although he is phenomenal as AG, IMHO\n\n\n\nTo: cotton1706\n\nDeWhine did sign Constitutional Carry after having worked against it in the back rooms all year.",
    "Renacci Tops DeWine, Others in New Ohio Gubernatorial GOP Nomination Poll\n\nPosted on by cotton1706\n\nThe campaign manager for former congressman James B.",
    "“Jim” Renacci told The Star News Network that the March 28-conducted Harris poll of 1,342 Ohio Republican voters showed Renacci leading Gov.",
    "by 8 posted onby JonPreston (Q: Never have so many, been so wrong, so often)\n\nTo: cotton1706\n\nDeWine called the state for Biden in 2020.",
    "I may hold my nose and vote for Renacci in the general if Blystone doesn’t win but I WILL NOT under any circumstances vote for DeWine.",
    "R. Michael DeWine with 46 percent support compared to the governor’s 30 percent, just over a month before the May 3 GOP primary.",
    "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794\n\nFreeRepublic.com is powered by software copyright 2000-2008 John Robinson",
    "Once the preferred candidate is on top, then the polling stops, so the preferred candidate will have their talking point.",
    "I don’t trust anyone who has spent time in DC but I do believe the states are the front lines against federal overreach.",
    "-G.K. Chesterton)\n\nTo: Fester Chugabrew\n\nhttps://jimrenacci.com/solutions\n\nLooks like a decent counter to DeWhine.",
    "All materials posted herein are protected by copyright law and the exemption for fair use of copyrighted works.",
    "by 17 posted onby JonPreston (Q: Never have so many, been so wrong, so often)\n\nTo: Chad C. Mulligan\n\nAgreed.",
    "His campaign's internal polling numbers must be horrible for him to sign a law he so vigorously opposed.",
    "To: xenia\n\nI decided that I would NOT vote the lesser of two evils this time if DeWine wins the primary.",
    "by 13 posted onby xenia (\"In times of universal deceit, telling the truth becomes a revolutionary act.\"",
    "I voted for McConnell for years when I lived in Kentucky....voted for Portman when I lived in Ohio.",
    "by 4 posted onby Fester Chugabrew (\"Poets have been mysteriously silent on the subject of cheese.\"",
    "I decided that I would NOT vote the lesser of two evils this time if DeWine wins the primary.",
    "He’s succeeded John Kasich as governor and is exactly the same type of republican as Kasich.",
    "I will definitely vote for Renacci in the primary and hope and pray he means what he says.",
    "Renacci did respectable with little name recognition, so Trump’s endorsement helped.",
    "Renacci was a last few weeks fill-in for Josh mandel who dropped out of that race.",
    "One who is already wealthy and spent time in DC vs one who seems “grassroots”.",
    "To: JonPreston\n\nRenacci was endorsed by President a few years ago for senate.",
    "Just hope Mandel (or whoever is nominated) is capable of winning in November.",
    "I have seldom voted in past primaries but am making sure to do so this time.",
    "DeWine wrecked many small businesses in Ohio with his dictatorial fiats.",
    "To: cotton1706\n\nHe says the right things....but don’t they all?",
    "Mandel is the one who torpedoed that race when he dropped out.",
    "To: JonPreston\n\nGovernor Mike DeWine used to be in the Senate.",
    "To: cotton1706\n\nI don’t get why nobody ever mentions Blystone.",
    "So my level of trust in politicians is close to the ZERO mark.",
    "DeWine is a lockdown “repubican”, a Larry Hogan type.",
    "Happy outcome, but far too little and far too late.",
    "There is no better way to stop RINOs from running.",
    "Voted for GW, voted for and campaigned for Romney.",
    "by 12 posted onby xzins (Retired US Army chaplain.",
    "Support our troops by praying for their victory. )",
    "No more DeWine, and no JD Song and Dance Vance.",
    "George Orwell)\n\nTo: xenia\n\nI’m with you Xenia.",
    "He was one of John McCain’s gang of fourteen.",
    "So more than ever we need strong governors.",
    "Thus we are left with Renacci and Blystone.",
    "(Excerpt) Read more at theohiostar.com ...",
    "In central Ohio his signs are everywhere.",
    "Looks like a decent counter to DeWhine.",
    "I wish Dave Yost was in the running.",
    "Maybe he thought it would save him.",
    "I believed what these guys said.",
    "He is the true Trump Republican.",
    "Oh yes, I voted for Dewine too.",
    "How does he have any support?",
    "Been in office since 1975.",
    "but Ohioans know better.",
    "It clearly isn’t DeWine.",
    "Businessman and farmer.",
    "I will leave it blank.",
    "What a disappointment.",
    "I will leave it blank.",
    "Wave bye-bye, Mike.",
    "Constitutionalist.",
    "Never held office.",
    "Skip to comments.",
    "How can we know?",
    "He needs to go.",
    "America First.",
    "Thank you."
  ]
}