{
  "id": 6687,
  "mediaId": 8276,
  "date": "2022-04-11",
  "headline": "Frost-free date coming early this year on May 2",
  "image": "https://www.gannett-cdn.com/presto/2021/03/30/NPRJ/e4a53dbf-1475-41e5-bc0e-f7cbafe2e9ed-Soil_thermometers_are_useful_tools_for_deciding_when_to_plant.JPG?crop=1999,1125,x0,y185&width=1999&height=1125&format=pjpg&auto=webp",
  "link": "https://www.mansfieldnewsjournal.com/story/news/2022/04/11/frost-free-date-coming-early-year-but-later-sowing-still-safer/9510873002/",
  "mediaOutlet": "bucyrustelegraphforum.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zach Tuggle",
  "authorUrl": "https://www.mansfieldnewsjournal.com/staff/4395274002/zach-tuggle/",
  "termIds": [
    0
  ],
  "sentences": [
    "Another option to speed up harvest and even allow for a second crop in the garden is to start things like green beans inside, then transplant them to the garden once they're already a few weeks old.",
    "Start with cold-weather crops\nToo many times the extension agent has heard of someone who has lost their crop because of a random cold spell that frosted vegetables without warning.",
    "Farms also susceptible to cold spells\nThings are a little different for farmers than for gardeners — they often sow their seed two or three weeks before the last frost of the year.",
    "More:US 30 road construction projects to begin soon in Richland, Ashland and Crawford counties\n\"A few cold days the last week of April can really set things back,\" Hartschuh said.",
    "To be safe, many wait to plant until after what's known as the frost-free date — the date after which meteorologists are confident the temperature will stay above freezing.",
    "Temperatures this week might be forecast to fluctuate between the 30s and the 70s, but more consistent weather is expected to arrive a little earlier than usual this year.",
    "Those who want to start early while still playing it safe could try planting only cold-weather crops in early May: peas, parsnip, onions, potatoes, cabbage and kohlrabi.",
    "Just like gardeners, though, the wrong conditions at the early stages of the growing season could be the difference in a successful early crop and a total loss.",
    "Frost free date is May 2\nOne of the keys for a successful home gardener is to ensure young plants are not exposed to frost without the proper covering.",
    "Soil acts as an insulator, holding in the heat and keeping the cold nighttime air away from the tender embryos throughout the germination process.",
    "The Farmer's Almanac predicts this year that May 2 will be the last frost in Crestline, a city in both Richland and Crawford counties.",
    "They might want to wait a little longer, cautioned Jason Hartschuh, Ohio State University Extension agent for Crawford County.",
    "More:Galion ammo factory workers applaud Josh Mandel in campaign stop\n\"They call it embryo chilling,\" Hartschuh said.",
    "It will soon be just warm enough for those who have a green thumb to get eager to plant some seeds or sprouts.",
    "\"It has to be in the upper for 40s for seed to germinate when you look at corn and soybeans,\" Hartschuh said.",
    "He recommends people hope for such luck, but also keep an eye on the weather before risking an early crop.",
    "That's why it might always be wise to play it safe, and even then be prepared for the worst-case-scenario.",
    "This year, the extension agent expects the first crops will start to go into the ground about April 25.",
    "An old rule of thumb is to wait until Mother's Day to work in the garden, which comes May 8 this year.",
    "\"We really want the average daytime soil temperature to be around 50 degrees when we start planting.\"",
    "\"There's a good chance you'll be able to plant gardens the first week of May,\" Hartschuh said.",
    "\"Spring is one of those things I definitely don't count until it hatches,\" Hartschuh said.",
    "Growers there will have 164 days of safety until the next frost is predicted for Oct. 14.",
    "\"But we had snow last year the sixth or seventh of May, which isn't normal.\"",
    "To be sure, they're still worried about the cold, only in a different way.",
    "The seed has already germinated, leaving its delicate baby plant exposed.",
    "A farmer's greatest fear is a cold rain just a few days after sowing.",
    "\"What farmers really look for is soil temperature,\" Hartschuh said.",
    "Save the tomatoes and peppers a few more weeks for warmer weather.",
    "\"They do a really good job of predicting things,\" Hartschuh said.",
    "The average last frost for North Central Ohio is about May 6.",
    "\"Typically the first week of May is safe,\" Hartschuh said.",
    "But they won't have to wait quite as long as normal.",
    "\"But it looks like we might have a timely spring.\"",
    "419-564-3508\nTwitter: @zachtuggle",
    "\"But it's not 100%.\""
  ]
}