{
  "id": 7932,
  "mediaId": 2752,
  "date": "2022-04-06",
  "headline": "MLK Expert Josh Mandel Explains To MLK’s Daughter Bernice How Much MLK Loved Guns",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY0NDU0My9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTcwODI4NDExNn0.Q8GhKApL829FuXuKjc_yDEQIeqTnWJ7Tt191oCFv4qI/img.png?width=1200&coordinates=0%2C0%2C0%2C104&height=600",
  "link": "https://www.wonkette.com/mlk-expert-josh-mandel-explains-to-mlks-daughter-bernice-how-much-mlk-loved-guns",
  "mediaOutlet": "Wonkette Blog",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Robinson",
  "authorUrl": "https://www.wonkette.com/u/stephenrobinson",
  "termIds": [
    1640,
    2290,
    4256,
    5618,
    1489,
    976,
    1126,
    6083
  ],
  "sentences": [
    "Dr. King describes his crisis of conscience after white supremacists bombed his house just months into the year-long Montgomery bus boycott:\nAfter the bombings, many of the officers of my church and other trusted friends urged me to hire a bodyguard and armed watchmen for my house.",
    "Republicans have passed anti-CRT laws that would likely prohibit teaching kids that Pettus was an avowed white supremacist and the bridge was named after him during a period where Black Selma residents would’ve had no say in the decision.",
    "My visit to Selma was powerful and inspiring and I look forward to returning and bringing my kids.”\nBernice King is one of Dr. King’s daughters, and the subject of the dream conservatives never fail to mention when pissing on his grave.",
    "Mandel smugly proclaims that “Martin Luther King marched right here so that skin color wouldn’t matter.” However, skin color does matter in America and critical race theory bans are blatant attempts to avoid confronting this reality.",
    "He also said, in the very same speech, that “we can never be satisfied as long as the Negro is the victim of the unspeakable horrors of police brutality.” Conservatives have quite the selective memory when it comes to Dr. King.",
    "Ohio GOP Senate candidate Josh Mandel dropped a particularly loathsome ad Tuesday where he’s filmed walking across the Edmund Pettus Bridge, the site of the famous Selma march for voting rights, which Mandel doesn’t support.",
    "Historian Kevin Kruse dropped some knowledge:\n\"The county sheriff, as you'd probably imagine, was not 'anti-gun.’ And when MLK inquired about the permit, his office had already issued permits for 197 citizens.",
    "However, they have trouble accepting that Dr. King didn’t approve of violence in general — no drone strikes or disgusting Christmas card photos where everyone’s armed to the teeth.",
    "Josh: Regretfully, I do not believe that I or @TheKingCenter legitimately motivated you to film this ad, as it is in opposition to nonviolence and to much of what my father taught.",
    "If Dr. King wisely didn’t carry a gun while marching on Selma, then white people could consider protecting their home with a SimpliSafe instead of an assault rifle.",
    "Your father knew the importance of the Second Amendment when he tried to exercise his right to self-defense and was wrongly denied a gun permit by anti-gun racists.",
    "Mandel’s ad starts with Regina McManus, a very angry white lady from Cortland, Ohio, declaring that “critical race theory is CRAP.” That pretty much sets the tone.",
    "After all, the civil rights leader said he dreamed of a day when his children wouldn’t be judged by the color of their skin but the content of their character.",
    "Mandel looks like Buster Bluth photoshopped into an image with Black soldiers in “Army.” Politico confirms it’s really Mandel in the photo, so let’s move on.",
    "Select an amount (USD)\n$2$25$5$50$10$100$15$500$20$1000\nStephen Robinson\nStephen Robinson is a writer and social kibbitzer based in Portland, Oregon.",
    "Conservatives appreciate that Dr. King didn’t promote violence against white racists, because if he had, their ancestors might’ve been in trouble.",
    "And when racists are in charge of administering seemingly race-neutral laws, they often apply them in uneven ways that reflect their racism.",
    "How could I serve as one of the leaders of a nonviolent movement and at the same time use weapons of violence for my personal protection?",
    "Had we become distracted by the question of my safety we would have lost the moral offensive and sunk to the level of our oppressors.",
    "It’s a given that Republicans will always figuratively exhume Dr. Martin Luther King whenever they attack critical race theory.",
    "We tried to satisfy our friends by having floodlights mounted around the house, and hiring unarmed watchmen around the clock.",
    "In order to satisfy the wishes of these close friends and associates, I decided to consider the question of an armed guard.",
    "He also lacks the humility and basic humanity to concede that Bernice King is a subject matter expert on her own father.",
    "Bernice King didn’t appreciate Mandel implying she and the The King Center inspired this repulsive bigot in any way.",
    "I’m giving advance notice that I won’t have time or the interest to discuss whatever’s going on in the photo above.",
    "Also, Dr. King, John Lewis, and other civil rights activists didn’t march in service of a color-evasive society.",
    "I went down to the sheriff's office and applied for a license to carry a gun in the car; but this was refused.",
    "When I decided that I couldn't keep a gun, I came face-to-face with the question of death and I dealt with it.",
    "Study your history better\nMandel can’t get through an entire Twitter exchange without exposing his racism.",
    "Bernice King shared an excerpt from her father’s memoir, Stride Toward Freedom: The Montgomery Story.",
    "Coretta and I talked the matter over for several days and finally agreed that arms were no solution.",
    "It’s bizarre and twisted for Mandel to claim that “anti-gun racists” denied Dr. King a gun permit.",
    "They marched specifically for Black people’s right to vote without active government suppression.",
    "Mandel grossly tweeted, \"Thank you @BerniceKing @TheKingCenter for motivating me to film this ad.",
    "Josh Mandel is a bigot and a coward who embraces his worst flaws with a preening moral certainty.",
    "I tried to tell them that I had no fears now and consequently needed no weapons for protection.",
    "She responded to Mandel’s insulting ad far more politely than the curt “fuck you” he deserved.",
    "MLK's requests were denied not because the sheriff was anti-gun, but because he was a racist.",
    "Black people who are alive and aren’t Tim Scott are extremely inconvenient for conservatives.",
    "They insisted that I protect the house and family, even if I didn't want to protect myself.",
    "Yr Wonkette is 100 percent ad-free and entirely supported by reader donations.",
    "Club and make believe for Cafe Nordo, an immersive theatre space in Seattle.",
    "When my father came to town, he concurred with both of these suggestions.",
    "It’s not just page after page of that “content of their character” line.",
    "She encouraged Mandel to read the entire book, which we know he won’t.",
    "From that point on, I no longer needed a gun nor have I been afraid.",
    "I was much more afraid in Montgomery when I had a gun in my house.",
    "Here’s the full ad, which you shouldn’t watch with a full stomach.",
    "I also promised that I would not travel around the city alone.",
    "Mandel didn’t just slink away with his tail between his legs.",
    "Unfortunately, people like Josh Mandel are far too common.",
    "He's also on the board of the Portland Playhouse theatre.",
    "I encourage you to study my father/nonviolence in full.",
    "We decided then to get rid of the one weapon we owned.",
    "And then white police officers sicced dogs on them.",
    "His son describes him as a “play typer guy.\"",
    "Dr. King was a moral giant with human flaws.",
    "That's what critical race theory stresses!\"",
    "Please click the clickie, if you are able.",
    "How often would you like to donate?",
    "Dr. Kings are rare in this world.",
    "That’s truly honoring his dream.",
    "No, he was predictably churlish.",
    "He writes reviews for the A.V.",
    "This they would not hear.",
    "Meanwhile I reconsidered.",
    "That's you!",
    "Firearms ?",
    "violence."
  ]
}