{
  "id": 9546,
  "mediaId": 2614,
  "date": "2022-03-19",
  "headline": "Ohio GOP Primary Debate Almost Turns Into A Fist Fight As Candidates Go Off The Rails [VIDEO]",
  "image": "https://www.lifezette.com/wp-content/uploads/2022/03/2022.03.26-02.31-lifezette-623f23c239f2d.jpg",
  "link": "https://www.lifezette.com/2022/03/ohio-gop-primary-debate-almost-turns-into-a-fist-fight-as-candidates-go-off-the-rails-video/",
  "mediaOutlet": "lifezette.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Red Voice Media",
  "authorUrl": "https://www.lifezette.com/author/redvoicemedia/",
  "termIds": [
    2684,
    3776,
    2290,
    1489,
    976,
    6474
  ],
  "sentences": [
    "Don’t tell me I haven’t worked.”\nThe moderator got up and attempted to deescalate the situation, and at that point, Mandel sat down briefly but got back up when Gibbons shouted, “You don’t know squat.”\nGibbons told Mendel to “back off,” to which Mandel responded, “you back off,” and said that he was “dealing with the wrong guy.”\n“Watch what happens.",
    "As Gibbons shouted, “You may not understand this,” Mandel then got up from his seat and confronted Gibbons face to face stating, “I do.”\nGibbons then shouted back, “You have never…you have never been in the private sector in your entire life.”\nMandel replied, “Two tours in Iraq.",
    "Senator, and Ohio voters got a firsthand look at just how unprepared Josh Mandel has become, and that will be reflected on the ballot on May 3,” said Samantha Cotten, a spokesperson for Gibbons’ campaign.",
    "Candidate Senate forum in Ohio got tense a Fridays candidates Mike Gibbons and Josh Mandel got into a face-off that almost ended in a physical altercation.",
    "The opinions expressed by contributors and/or content partners are their own and do not necessarily reflect the views of LifeZette.",
    "The argument escalated when Mandel claimed that Gibbons had made millions from business dealings with Chinese companies.",
    "Gibbons and Mandel are two of the seven potential candidates for the Republican primary that is set for May 3.",
    "The Mandel campaign could not be reached for a comment regarding the altercation.",
    "Eventually, the altercation came to an end without any punches being thrown.",
    "It originally appeared in RedVoiceMedia.com and is used by permission.",
    "He doesn’t have the temperament, experience or fortitude to be a U.S.",
    "Gibbons denied the claims, and the discussion got heated from there.",
    "“Josh Mandel is unhinged, unfit, and flailing because he’s losing.",
    "He is only a professional at one thing: running for office.",
    "This piece was written by Zach Heilman on March 19, 2022.",
    "He is hell-bent on lying because he is failing.",
    "You watch what happens,” Mandel said.",
    "The night GOP’s U.S."
  ]
}