{
  "id": 6475,
  "mediaId": 151,
  "date": "d2022-05-18T05:46",
  "headline": "How Trump-backed candidates fared on the busiest primary day",
  "image": "https://www.politico.com/dims4/default/ce94ed4/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fc3%2F04%2F0c607c904614b5ef0bf8fd9b2f08%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1239876843",
  "link": "https://www.politico.com/news/2022/05/18/trump-backed-candidates-2022-primary-results-00032746",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1130,
    1147,
    1158,
    1404,
    1433,
    1434,
    1903,
    2303,
    3102,
    3104,
    2706,
    2834
  ],
  "sentences": [
    "Trump said he was endorsing the senator for fighting against the swamp in Washington, the radical left liberals, and especially the destructive RINOS, of which there are far too many, in Congress.? That didnt stop the former president from sticking it to Paul a few months later after the senator funded an Ohio special election candidate other than the one Trump had endorsed.",
    "In a last-minute endorsement that rattled members of Pennsylvanias Republican party, Trump backed Mastriano, a leading force in trying to overturn the 2020 election results who was pictured outside the Capitol on Jan. 6. There is no one in Pennsylvania who has done more, or fought harder, for Election Integrity than State Senator Doug Mastriano,? Trump said last week.",
    "I urge Donald Trump to step aside and allow the Republican party to put forward a conservative candidate like Mike Pence who can defeat Hillary Clinton.?\nFive years later, several weeks after Crapo voted to acquit in Trumps second impeachment trial, Trump released a statement endorsing the Idaho senator in his 2022 reelection.",
    "Trump then delivered his endorsement to Oz in April, citing his celebrity as a television show host: He has lived with us through the screen and has always been popular, respected, and smart.? The endorsement caused a backlash among some Republicans who never believed Ozs conservative bona fides.",
    "Get caught up here:\n May 3: Ohio and Indiana\n May 10: Nebraska and West Virginia\nDo you think Rand Paul will apologize for spending nearly $1 Million on another candidate in Ohios 15th District congressional race after I had already endorsed Mike Carey?? Trump said in a statement.",
    "After opening with a photograph of Massie and Trump flashing grins and thumbs-ups, the spot attacked Massies primary challenger as a Trump-hater.?\nBy May of that year, when Massie threatened to delay the Houses $2 trillion Covid-19 relief package, Trump had had enough.",
    "But Trumps endorsement and a wave of outside spending powered Budd to a lead he never lost in the crowded Republican Senate field, quieting the early speculation that the former president had erred in supporting the congressman.",
    "Perry, chairman of the hardline House Freedom Caucus, served as a behind-the-scenes facilitator who connected Department of Justice lawyer Jeffrey Clark with Trump as part of an effort to overturn the 2020 election results.",
    "Trumps endorsement of a 26-year-old who didnt live near the newly drawn congressional district he was seeking stunned many state Republicans in March, as there were several other candidates who hailed from the area.",
    "He is a proven winner both on and off the field, and he is going to help win a huge Republican majority in the House of Representatives,? Trump said when he backed Hines, a former college football player, in March.",
    "In North Carolina, where Trumps backing of Rep. Ted Budd for Senate seemingly came out of nowhere, Budd pulled away from the field in the final weeks of the campaign to capture the GOP nomination.",
    "Former President Donald Trump speaks at a rally in Selma, North Carolina, in April ahead of the primary elections, where he's thrown his support behind candidates in some key GOP races.",
    "The former president endorsed state Sen. Doug Mastriano for governor in the final week before the Republican primary, despite the efforts of state Republicans to convince him otherwise.",
    "In their view, Trump picked Mastriano because he was leading in the polls, and wanted a guaranteed victory in Pennsylvania, where Trumps other statewide endorsee, Mehmet Oz, might lose.",
    "In his endorsement statement, Trump commended him in bringing manufacturing jobs back to Northeast Pennsylvania.? Bognet will challenge Democratic incumbent Matt Cartwright in November.",
    "| Allison Joyce/Getty Images\nBy Marissa Martinez\n 05/18/2022 01:46 AM EDT\nDonald Trumps preoccupation with his endorsement win-loss record was never more apparent than in Pennsylvania.",
    "In his endorsement of the congressman, Trump said Perry is an America First warrior? and a a tremendous advocate for our MAGA agenda.?\nPerry voted to overturn 2020 electoral votes.",
    "According to the endorsement Trump issued last week, Massie is a first-rate defender of the Constitution.?\nKY05\nRep. Harold Rogers\nWon with 83 percent of the vote.",
    "In any event, Mike went on to an unprecedented victory, more than doubling the second placed finisher and Rands candidate came in a distant third out of eleven.",
    "Many Republicans fear their far-right nominee cannot win the general election and could damage party candidates from his perch at the top of the ticket.",
    "But Rep. Madison Cawthorn was defeated in his bid for a second term, despite Trumps last-minute plea to primary voters to give him a second chance.",
    "Massie bucked Trump on some votes early in his term, which led Massies 2020 primary challenger to accuse him of being disloyal to Trump.",
    "He purchased ad time in South Florida on Fox News to run an ad designed to capture the presidents attention while he was at Mar-a-Lago.",
    "McGeachin lost the primary by a wide margin, marking the second consecutive week that a Trump-backed candidate for governor fell short.",
    "As a leading election denier who worked vigorously to overturn the 2020 election results, Mastriano was a natural for Trump to choose.",
    "In Nebraskas May 10 primary, Trump ally Charles Herbster finished second despite a Trump rally for him in the run-up to the election.",
    "The former president also held a rally with Hines, Budd and Cawthorn in April, where he reaffirmed his support for the candidates.",
    "Trump knew this and endorsed him anyway, leading to GOP grumbling that he was putting his own vanity ahead of the party.",
    "In the wake of the Access Hollywood scandal in 2016, Crapo issued a statement saying he could no longer support Trump.",
    "With 95 percent of the expected vote in, Oz led former hedge fund CEO David McCormick 31.2 percent to 31.1 percent.",
    "Initially, Trump backed Sean Parnell in the Senate primary, but Parnell dropped out of the race two months later.",
    "Since most of them were safe Republican incumbents, hell come out of the May 17 primaries with a winning record.",
    "Once a presidential primary election rival to Trump, Paul secured the former presidents backing in April 2021.",
    "Rand is a different kind of guy, but I like him a lot anyway, and Im proud to have endorsed him when he ran.",
    "He dismissed the congressman as a third-rate Grandstander? and called for him to be kicked out of the GOP.",
    "His repeated actions and comments toward women have been disrespectful, profane and demeaning,? he said.",
    "Mastriano was one of more than two dozen candidates on the Tuesday ballot who have Trumps endorsement.",
    "Before Trump unexpectedly announced his support, Budd had been lagging in polls against former Gov.",
    "He was also a high-risk nominee, one whom many in the party believe will get crushed in November.",
    "Trump did not make any endorsements in Oregon, a state he lost by 16 percentage points in 2020.",
    "The physician never took a decisive lead, even after even after receiving Trumps backing.",
    "Were tracking Donald Trumps endorsement track record through the 2022 primaries.",
    "Pennsylvania wins\nGOVERNOR\nDoug Mastriano\nWon with 45 percent of the vote.",
    "North Carolina wins\nSenate\nRep. Ted Budd\nWon with 59 percent of the vote.",
    "Brad Little was an even more humbling defeat for the former president.",
    "Bognet was a Trump administration appointee in the Export-Import Bank.",
    "Do you think he learned his lesson??\nKY01\nRep. James Comer\nUnopposed.",
    "Kentucky wins\nSenate\nSen. Rand Paul\nWon with 86 percent of the vote.",
    "Idaho wins\nSenate\nSen. Mike Crapo\nWon with 69 percent of the vote.",
    "Here is a look at the Trump-endorsed candidates who won Tuesday.",
    "NC10\nRep. Patrick McHenry\nWon with 68 percent of the vote.",
    "NC09\nRep. Richard Hudson\nWon with 79 percent of the vote.",
    "NC03\nRep. Gregory Murphy\nWon with 76 percent of the vote.",
    "KY02\nRep. Brett Guthrie\nWon with 78 percent of the vote.",
    "KY04\nRep. Thomas Massie\nWon with 75 percent of the vote.",
    "NC05\nRep. Virginia Foxx\nWon with 77 percent of the vote.",
    "NC07\nRep. David Rouzer\nWon with 79 percent of the vote.",
    "KY06\nRep. Andy Barr\nWon with 88 percent of the vote.",
    "Budd also voted to overturn 2020 electoral votes.",
    "POLITICO rates the race as a toss-up in November.",
    "PA08\nJim Bognet\nWon with 69 percent of the vote.",
    "NC13\nBo Hines\nWon with 32 percent of the vote.",
    "Senate\nMehmet Oz\nOutcome still to be decided.",
    "She voted to overturn 2020 electoral votes.",
    "He voted to overturn 2020 electoral votes.",
    "He voted to overturn 2020 electoral votes.",
    "He voted to overturn 2020 electoral votes.",
    "He voted to overturn 2020 electoral votes.",
    "He voted to overturn 2020 electoral votes.",
    "He voted to overturn 2020 electoral votes.",
    "He voted to overturn 2020 electoral votes.",
    "He voted to overturn 2020 electoral votes.",
    "Now, however, Trump views him differently.",
    "He voted to overturn 2020 electoral votes.",
    "He voted to overturn 2020 electoral votes.",
    "So how did the congressman respond?",
    "PA11\nRep. Lloyd Smucker\nUnopposed.",
    "ID01\nRep. Russ Fulcher\nUnopposed.",
    "PA10\nRep. Scott Perry\nUnopposed.",
    "PA13\nRep. John Joyce\nUnopposed.",
    "PA16\nRep. Mike Kelly\nUnopposed.",
    "NC08\nRep. Dan Bishop\nUnopposed.",
    "Janice McGeachins loss to Gov.",
    "Guy Reschenthaler\nUnopposed.",
    "Despite Trumps endorsement.",
    "In Idaho, Lt. Gov.",
    "Pat McCrory.",
    "PA14\nRep."
  ]
}