{
  "id": 6485,
  "mediaId": 19,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Exclusive: Pennsylvania Republican Jim Bognet Blasts Biden, Advocates for America First Agenda",
  "image": "https://media.breitbart.com/media/2020/10/Jim-Bognet-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/07/exclusive-pennsylvania-republican-jim-bognet-blasts-biden-advocates-for-america-first-agenda/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Spencer Lindquist",
  "authorUrl": "https://www.breitbart.com/author/slindquist/",
  "termIds": [
    3104
  ],
  "sentences": [
    "Bognet responded, asserting that the Chinese Communist Party is the greatest threat to our freedom that weve ever encountered? and advocating for a better, more equipped military in the Pacific Ocean.? He contended that we need to use every tool in our economic tool box? to make China pay.?\nBognet remarked that inflation is destroying peoples lives? and destroying peoples purchasing power.? He pledged to help stop the spending? that is exacerbating inflation, pointing out that Joe Biden, Matt Cartwright, Nancy Pelosi have done $5 trillion of deficit spending.?\nThe Trump-endorsed candidate also spoke on the need to create jobs and become energy independent by unleashing Pennsylvanias energy potential, saying that liberal politicians would rather buy it from Russia and Saudi Arabia and Venezuela, countries that hate us, than buy it from Pennsylvania.? Bognet added that people in Bidens hometown of Scranton are waking up? because in Joe Bidens hometown, people are turning their backs on him.?\nBognet asserted, If we are able to beat Joe Bidens lapdog Matt Cartwright in his home district, it will be national news for a month.?",
    "Bognet spoke on the state of the Eighth District, saying that support for the Biden agenda is falling apart? in the district, which is pro-gun, pro-life,? and culturally conservative.?\nBognet, a veteran of the Trump administration, decried the radicalism of his opponent, remarking, Plain and simple, Matt Cartwright is Joe Biden and Nancy Pelosis lapdog.?\nBognet continued, noting that Cartwright is a member of the House Progressive Caucus and votes with Pelosi 100 percent of the time? and calling him a defund the police lunatic? before blasting Democrat politicians who have cut the knees out from our law enforcement.?\nListen:\nBoyle discussed the runaway inflation? and the wide open border? of the Biden administration before asking Bognet to address the most pivotal issues facing Pennsylvania.",
    "Jim Bognet, a Trump-endorsed Republican congressional candidate for Pennsylvanias Eighth District, joined Breitbart News Saturday on SiriusXM with host Matthew Boyle to discuss the America First agenda and the need to stop Democrat politicians like Joe Biden, Kamala Harris, and his opponent Matt Cartwright.",
    "The Trump-endorsed candidate added, It all starts with getting serious about securing our border, because as Trump says, if you dont have a border, you dont have a country.?\nBoyle noted that Bognet was one of the first people to call for a travel ban on China, asking how he would hold China accountable.",
    "We have illegal immigrants that either come in through the southern border or sneak in through New York City, overstay their visa, and come to Northeast Pennsylvania.? Bognet noted his primary opponent has let in illegal immigrants as mayor and refused to support Trumps border wall.",
    "Bognet voiced support for former President Trumps America First policies, speaking on the importance of finishing the border wall and bringing economic growth to Eastern Pennsylvania.",
    "Bognet cited the fentanyl crisis and illegal immigration, saying, We have fentanyl coming into Northeastern Pennsylvania and killing high school students here left and right.",
    "Bognet said, We stop it by getting serious about people who want to kill us,? citing organizations in Mexico and China that profit from peddling fentanyl.",
    "Boyle discussed the tragedy of the fentanyl epidemic, the real pandemic,? before asking Bognet how he would approach the crisis."
  ]
}