{
  "id": 6489,
  "mediaId": 43,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 5/6",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/5/6/2094858/-Daily-Kos-Elections-Live-Digest-5-6",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3104
  ],
  "sentences": [
    "You may know some of our work.? The audience is then shown a montage of tear gas being used on what the on-screen text labels as \"Hillary Clinton protesters,\" \"left wing protesters,\" \"antifa rioters,\" Black Lives Matter protesters,? and radical left protesters.?\nThe camera then goes back to Mills, who smugly says, And now the liberal medias crying about it.? After the candidate is depicted firing a gas weapon himself, he concludes, If the media wants to shed some real tears, I can help them out with that.? Mills campaign says the spot will have six-figure[s]? behind it.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nPlayback speed\nWhy progressives must build state power, with Gaby Goldstein\nThe Downballot\nFollowShare\n0:0055:29\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nFriday, May 6, 2022  4:24:26 PM +00:00  David Nir\nSC Redistricting: Republican leaders in the South Carolina House have agreed to settle a lawsuit brought by the NAACP that challenged the chamber's new map for diluting the power of Black voters and say they will pass a remedial map that makes changes to 29 districts.",
    "His new commercial makes use of audio of Trump saying, Alex is the only candidate in this race that has my complete and total endorsement,? before the narrator praises him as the one candidate who defended Trump from Pelosi's Jan. 6th witch hunt.? The spot doesnt mention McKinley, who supported creating a Jan. 6 commission: McKinley, as we recently wrote, is finishing his advertising in a more dramatic fashion with a spot that shows a digitally altered image of Mooney in a prison jumpsuit.",
    "Friday, May 6, 2022  7:30:03 PM +00:00  David Nir\nGA-14: An administrative law judge in Georgia has concluded that Republican Rep. Marjorie Taylor Greene can appear on the ballot, rejecting a challenge from voters who argued her behavior surrounding the Jan. 6 attack on the Capitol made her ineligible to run under a provision of the Constitution barring those who've \"engaged in insurrection\" from serving in Congress.",
    "Friday, May 6, 2022  5:02:06 PM +00:00  David Nir\nOH Redistricting: Ohio's Republican-run redistricting commission has re-passed a set of legislative maps that the state Supreme Court already ruled were an illegal partisan gerrymander favoring the GOP, after a three-judge federal court announced last month that it would implement those same maps if the state failed to adopt valid districts by May 28.",
    "Thats whats at stake.? Allam goes on to allude to the $1.8 million that outside groups have spent so far to aid Foushee by saying, Super PACs are spending millions trying to silence me, but our movement is stronger than that.? The candidate, after noting she has the backing of both Elizabeth Warren and Bernie Sanders, implores the viewer, Join us.",
    "Friday, May 6, 2022  7:06:16 PM +00:00  Jeff Singer\nMD-Gov: A group called For The People MD has released a month-old survey from Change Research that shows its favored candidate, John King, barely registering in the July Democratic primary, though its of course publicizing these numbers to argue that hell surge once voters learn more about him.",
    "Friday, May 6, 2022  7:43:13 PM +00:00  Jeff Singer\nMN-01: Politico reports that Defending Main Street, a group devoted to ensuring that Republicans have a governing majority,? will spend $600,000 on a TV ad campaign for former Department of Agriculture official Brad Finstad ahead of the May 24 special election primary.",
    "Friday, May 6, 2022  7:28:48 PM +00:00  Jeff Singer\nFL-07: Army veteran Cory Mills is trying to generate some national attention in the August Republican primary for this newly-gerrymandered seat with a commercial where he brags, I came home and started a company making riot control munitions for law enforcement.",
    "Friday, May 6, 2022  8:01:06 PM +00:00  Jeff Singer\nTX-15: Democratic Majority for Israel has launched a $244,000 ad campaign in support of Army veteran Ruben Ramirez ahead of his May 24 Democratic runoff against businesswoman Michelle Vallejo, which makes this the first outside spending on either side.",
    "Friday, May 6, 2022  7:34:06 PM +00:00  Jeff Singer\nGA-06: Donald Trump on Thursday endorsed former state ethics commission chair Jake Evans, whose father is a prominent donor and former Trump ambassador to Luxembourg, for the May 24 primary for a suburban Atlanta seat the GOP drew up to be safely red.",
    "Friday, May 6, 2022  6:40:43 PM +00:00  Jeff Singer\nWV-02: Research America, working on behalf of West Virginia MetroNews, has conducted the firstand probably onlyindependent survey of Tuesdays incumbent vs. incumbent Republican primary, and it has some welcome news for Trump-endorsed Rep. Alex Mooney.",
    "Friday, May 6, 2022  6:48:01 PM +00:00  Jeff Singer\nMO-Sen: The Republican firm Remington Research Groups newest poll for the political tip-sheet Missouri Scout finds philanthropist Trudy Busch Valentine, who entered the Democratic primary in late March, trailing three potential Republican rivals.",
    "Friday, May 6, 2022  7:11:21 PM +00:00  Jeff Singer\nNE-Gov: University of Nebraska Regent Jim Pillen is out with an internal from WPA Intelligence that shows him leading wealthy businessman Charles Herbster 31-26 ahead of Tuesdays Republican primary, with state Sen. Brett Lindstrom at 16%.",
    "Friday, May 6, 2022  7:15:21 PM +00:00  Jeff Singer\nVT-Gov, VT-AG: In a surprise, Democratic Attorney General TJ Donovan announced Thursday that he wouldnt run for re-election or for any other office in 2022, and he also left open the possibility he would resign early to take a new job.",
    "Friday, May 6, 2022  7:51:54 PM +00:00  Jeff Singer\nNC-04: State Sen. Valerie Foushees allies at EMILYs List have released an internal from Impact Research that shows her leading Durham County Commissioner Nida Allam 35-16 in the May 17 Democratic primary, with singer Clay Aiken at 10.",
    "Friday, May 6, 2022  6:57:16 PM +00:00  Jeff Singer\nCO-Gov: Businessman Greg Lopez unexpectedly won the state Republican Party convention last month, but he still faces a large financial deficit against University of Colorado Regent Heidi Ganahl ahead of their June 28 primary.",
    "This outcome was prophesied by the dissenter in the federal case, Judge Algenon Marbley, who said at the time that the commission would \"do nothing\" and \"await a map with the desired partisan favoritism\" rather than try to craft maps that comply with the Ohio constitution.",
    "Friday, May 6, 2022  7:01:22 PM +00:00  Jeff Singer\nIL-Gov: Conservative megadonor Ken Griffin has contributed another $25 million to Aurora Mayor Richard Irvin on top of the $20 million hed previously given himand all of thats just for the June 28 Republican primary.",
    "The commercial touts Ramirezs time as a soldier, teacher, and lawyer, and argues hell fight to protect Social Security and Medicare.?\nFriday, May 6, 2022  8:03:54 PM +00:00  Jeff Singer\nAd Roundup:\nDollar amounts reflect the reported size of ad buys and may be larger.",
    "Embarrassingly, the federal court majority (made up of two Trump appointees) insisted the commission would not run out the clock because \"we must presume that Ohio's officials are public servants who still view partisan advantage as subordinate to the rule of law.\"",
    "Defend our right to choose.?\nFriday, May 6, 2022  7:53:22 PM +00:00  Jeff Singer\nNY-19: State Sen. Michelle Hinchey said Friday that shed run for re-election rather than compete in the upcoming special election to succeed her fellow Democrat, Rep. Antonio Delgado.",
    "However, the former Maryland state senator may be the last person on the planet who would actually care about that kind of thing: Indeed, Mooney is to speak Friday at a Trump event in Pennsylvania, where the GOP leader is promoting Senate candidate Mehmet Oz.",
    "This poll, which was conducted April 30-May 2, shows some notable changes from what WPA found in a previous survey that was finished just two days before: That earlier poll had Pillen edging out Herbster by a mere 24-23 as Lindstrom grabbed 20%.",
    "Donovan didnt quite rule out the idea of running for governor should Republican incumbent Phil Scott retire, but the attorney general told VT Digger he fully (expects) the governor to run for re-election.? Vermonts filing deadline is May 26.",
    "That same day physician Rich McCormick, who was the partys nominee last cycle in the old 7th District, released an early May Public Opinion Strategies poll that shows him leading Evans 38-13, with pastor Mallory Staples at 7%.",
    "Jim Justice, who is supporting McKinley, used a joint appearance the week before Election Day to say that Trump made a mistake? with his endorsement in this race, but theres no indication the GOPs supreme leader agrees.",
    "MO-Sen: Trudy Busch Valentine (D) ($55,000 buy)\nNC-Sen: Club for Growth - anti-Pat McCrory (R)\nGA-07: Carolyn Bourdeaux (D-inc)\nMN-01: Jennifer Carnahan (R)\nPA-08: Jim Bognet (R)\nThis is a short blurb about Daily Kos.",
    "Polis gave his campaign $5.1 million and raised another $300,000 from contributors (the governor doesnt accept contributions larger than $100 per donor for the entire year), and he has $5 million to spend.",
    "Another billionaire, Dick Uihlein, has been financing state Sen. Darren Bailey and an allied super PAC, though his $4.5 million investment is just a tiny fraction of what Griffin has thrown down so far.",
    "The Ohio Supreme Court might, but its options are limited, since the same amendments to the state constitution that prohibit partisan gerrymandering also forbid the court from implementing its own map.",
    "Various plaintiffs have proposed creative work-arounds to this problem, such as asking the state court to rule that a map created by independent experts complies with the constitution.",
    "That would give those same plaintiffs a forceful argument before the federal court, which doesn't face the same constraints, but so far, the justices have declined to take such steps.",
    "Ganahl outraised Lopez $227,000 to $36,000 during the first four months of 2022 and self-funded another $150,000, which left her with a $200,000 to $16,000 cash-on-hand edge.",
    "A final decision on Greene's eligibility must be made by Republican Secretary of State Brad Raffensperger, but there's virtually no chance he'd reject the judge's findings.",
    "Still, while Trump held a telephone rally for Mooney on Monday, the one thing he doesnt seem willing to do is actually physically venture to West Virginia to help him.",
    "The release did not include numbers for the other notable Democrat, Marine veteran Lucas Kunce, or any of the other Republicans competing in the August primary.",
    "Eric Greitens outpaces Busch Valentine 46-37, while Rep. Vicky Hartzler and Attorney General Eric Schmitt enjoy larger leads of 49-33 and 50-32, respectively.",
    "This is the first survey weve seen of the contest to succeed retiring Rep. David Price in this safely blue constituency in the Durham and Chapel Hill area.",
    "The firm shows Mooney dispatching colleague David McKinley 48-33, which is only a little smaller than the 50-30 edge Mooney enjoyed in his recent internal.",
    "Allam herself is running a commercial where she speaks directly to the camera and tells the audience, Last year, I had an abortion that saved my life.",
    "For now, though, Change has state Comptroller Peter Franchot beating former nonprofit head Wes Moore 20-13, with King in sixth place with just 3%.",
    "Jared Polis, that lead is a relic of the past now that the wealthy incumbent has dropped his own money into his re-election fight.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "In fact, the GOP commissioners did worse than nothingthey simply gave their approval to maps they knew were unconstitutional.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "That revised map would not take effect until 2024, and first, the GOP-run legislature must pass it and Republican Gov.",
    "Of course, there's no reason to think these two judges, Amul Thapar and Benjamin Beaton, will care in the slightest.",
    "Now, the Supreme Court is taking away our right to choose.? She continues, People like us wont have access to care.",
    "Finstad also has earned the backing of Minnesotas largest police union, the Police and Peace Officers Association.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "If Republicans don't move swiftly enough, the case would proceed to a trial on May 16.",
    "Mooney also is finishing his campaign by once again reminding viewers hes Trumps man.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "But while Ganahl actually ended 2021 with a larger war chest than Democratic Gov.",
    "By contrast, we havent seen a survey giving McKinley the advantage since March.",
    "A separate challenge to the state's new congressional map remains pending.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "A runoff would take place the next month should no one win a majority.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Its also a place to discuss elections, not policy.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our podcast, The Downballot!",
    "New episodes every Thursday morning.",
    "Donate $25\n'\nDonate $10 monthly",
    "Henry McMaster must sign it.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Disgraced former Gov.",
    "And we will die.",
    "Please read it.",
    "Gov."
  ]
}