{
  "id": 6493,
  "mediaId": 19,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Donald Trump Endorses Pennsylvania Republican Jim Bognet for Congress",
  "image": "https://media.breitbart.com/media/2020/02/why-running-02-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/05/03/donald-trump-endorses-pennsylvania-republican-jim-bognet-for-congress/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    1147,
    1335,
    2087,
    3104,
    4622,
    146,
    428,
    545,
    562,
    2862
  ],
  "sentences": [
    "Trump added that if Bognet is elected to Congress, He will fight to Grow our Economy, Build the Wall, Defend the Second Amendment, and Support our Brave Military, Vets, and Law Enforcement.? He also hammered Cartwright, saying he is a puppet of Nancy Pelosi and the Radical Left, who wants to open our borders and defund the police.?\nThe former president explained that with Bognet being the Republican nominee in the district, which he barely lost to the Democrat in the last cycle, the Republicans would be able to flip this seat and Make America Great Again.?\nShortly after Trump endorsed Bognet, the latter released a statement saying, It is an incredible honor to be endorsed by President Trump.",
    "'?\nConfident that the Republicans will take back the majority in the House,since they only need to net gain five seats, with Cartwrights being one of them, the GOP candidate added, When I win, a new Republican majority will Take Back America and restore President Trumps policies of building the wall, stopping illegal immigration, and fighting inflation driven by the liberals spending and anti-energy policies!?\nDuring a recent appearance on SiriusXMs Breitbart News Saturday, Bognet hammered Cartwright for being a rubber stamp? to the Democrat policies he hopes to end if elected to Congress.",
    "One of the greatest honors of my life was serving in the Trump Administration to bring back jobs to Pennsylvania.?\nI am extremely humbled and grateful for his support,? Bognet continued while noting that the support from Trump and other America First conservatives in the Keystone State will help him stop Bidens crazy liberal policies by defeating Matt Cartwright in Bidens hometown.",
    "In the primary, he will go head to head with an anti-Trumper, Mike Marsicano, a former mayor who had run as a Democrat for Congress twice before switching political parties in 2019,when he ran for the same seat in the Republican primary and lost to Bognet, who went on to run in the general election against the Democrat incumbent.",
    "He said that Novembers midterm election will come down to freedom versus total government control of every aspect of our day-to-day life.?\nHowever, Bognet, now with Trumps endorsement, will have to make it through the primary in two weeks before he looks towards running against Cartwright in November.",
    "In a statement from his Save America PAC, Trump gave Bognet, who previously worked in his administration creating manufacturing jobs to rebuild Americas industrial heartland, his Complete and Total Endorsement!?\nJim Bognet will be a fantastic Congressman for Pennsylvanias 8th Congressional District!",
    "When asked about his past record, Marsicano did not respond to Breitbart Newss request for comment regarding the allegations of abuse from his then-wife in the late 1990s or his use of racial slurs and excessive force toward a black minor in 1997.",
    "Former President Donald Trump on Tuesday endorsed Pennsylvania Republican candidate Jim Bognet, who is running for the House of Representatives to unseat Rep. Matt Cartwright (D-PA).",
    "Breitbart News recently unearthed reports that showed Marsicano allegedly abused his then-wife in the early 2000s and has a history of fighting and racism.",
    "Jim served in my Administration and helped bring manufacturing jobs back to Northeast Pennsylvania,? Trump explained in his endorsement statement.",
    "Write to him at jbliss@breitbart.com or follow him on Twitter @JacobMBliss.",
    "Jacob Bliss is a reporter for Breitbart News."
  ]
}