{
  "id": 6498,
  "mediaId": 19,
  "date": "4/15/2022 12:00:00 AM",
  "headline": "Former Democrat Running in PA Republican Primary for U.S. House Seat Against Former Trump Official",
  "image": "https://media.breitbart.com/media/2022/04/Michael-Marsicano-for-Congress-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/04/15/former-democrat-running-in-pa-republican-primary-for-u-s-house-seat-against-former-trump-official/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    3104
  ],
  "sentences": [
    "Then, in 2019, Marsicano switched political parties from a registered Democrat to a registered Republican before he announced his bid for Pennsylvanias Eighth Congressional District to run against Cartwright in the 2020 election, according to his voter registration records, reviewed by Wilkes-Barre Times Leader.",
    "However, while Bognet openly called his time in the Trump administration one of the greatest honors? of his life and was proud to attend the presidents 2020 Republican nomination acceptance speech at the White House and had Trumps endorsement in 2020, Marsicano is far different.",
    "Michael Marsicano, who has run as a Democrat for Congress multiple times, is attempting another run for Congress as a Republican for the second time, against a former Trump official who barely lost in 2020 against Rep. Matt Cartwright (D-PA).",
    "In Pennsylvanias primary election next month, Marsicano is running against Jim Bognet, who worked in President Donald Trumps administration to help create manufacturing jobs to rebuild Americas industrial heartland.",
    "He said that Novembers midterm election will come down to freedom versus total government control of every aspect of our day-to-day life.?\nJacob Bliss is a reporter for Breitbart News.",
    "During a recent appearance on SiriusXMs Breitbart News Saturday, Bognet hammered Cartwright for being a rubber stamp? to the Democrat policies he hopes to end if elected to Congress.",
    "Currently, in the midterm election cycle, hes attempting to run against Cartwright again, but he will first have to make it past next months primary election against Bognet.",
    "In the 2020 election, he only received 12.9 percent of the primary vote, less than half of Bognets 28.4 percent of the vote in the primary.",
    "But, Marsicano reportedly ran twice before in 2016 and 2018, both times as a Democrat in Pennsylvanias Eleventh Congressional District.",
    "Instead, he ran against former Rep. Lou Barletta (R-PA), who openly supported the former president and his policies at the time.",
    "He called himself a conservative Democrat? but still said he would not endorse in the presidential election.",
    "During the 2016 presidential election cycle, Marsicano did not want to endorse the former president.",
    "Both times he was unsuccessful in his bid.",
    "Follow him on Twitter @JacobMBliss."
  ]
}