{
  "id": 6501,
  "mediaId": 43,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 4/12",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/4/12/2090861/-Daily-Kos-Elections-Live-Digest-4-12",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    879,
    1092,
    1547,
    1837,
    1878,
    1951,
    2064,
    2095,
    2277,
    2491,
    3104
  ],
  "sentences": [
    "Tuesday, Apr 12, 2022  1:02:59 PM Pacific Daylight Time  Jeff Singer\nHouse: The Congressional Leadership Fund, the well-funded super PAC aligned with the Republican House leadership, has endorsed seven more House candidates challenging Democratic incumbents:\nAZ-04: Tanya Wheeless\nNV-03: April Becker\nNY-18: Colin Schmitt\nNY-19: Marc Molinaro\nPA-08: Jim Bognet\nTX-28: Cassy Garcia\nTX-34: Mayra Flores\nTwo of these candidates face notable intra-party opposition: Wheeless has to get past Chandler City Councilman Rene Lopez before she can take on Arizona Rep. Greg Stanton, while Garcia faces a May 24 runoff against 2020 nominee Sandra Whitten in Texas 28th District.",
    "And everyone is paying more.? She continues, In Congress, Ill go after rich outsiders driving up costs, take on price gougers, and fight for housing we can actually afford.?\n Tuesday, Apr 12, 2022  12:45:44 PM Pacific Daylight Time  Jeff Singer\nNC-13: Former state Sen. Sam Searcys inaugural spot for next months Democratic primary has him saying that his familys job and housing struggles motivated him to help folks.? Searcy continues by saying that in the legislature he fought like hell to expand Medicaid, and stood with Gov.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nHow Democrats are fighting to hold the House, with Ali Lapp\nThe Downballot\nFollowShare\n0:0050:44\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\n Tuesday, Apr 12, 2022  10:32:35 AM Pacific Daylight Time  Jeff Singer\nNC-Sen: SurveyUSA takes a look at the May 17 Republican primary on behalf of WRAL and finds Rep. Ted Budd beating former Gov.",
    "Turning to the governors race, Suffolk tests Democratic incumbent Steve Sisolak against five different Republicans:\n41-29 vs. venture capitalist Guy Nohra\n39-35 vs. attorney Joey Gilbert\n39-39 vs. former Sen. Dean Heller\n37-39 vs. Clark County Sheriff Joe Lombardo\n37-40 vs. North Las Vegas Mayor John Lee\n Tuesday, Apr 12, 2022  10:48:54 AM Pacific Daylight Time  Jeff Singer\nPA-Sen: Lt. Gov.",
    "The spot briefly alludes to the candidates recent cameo on Star Trek: Discovery? when Abrams explains that her co-star and her are quite different: Lauras more Star Wars,? says Abrams, to which Hodgson responds, Staceys  Star Trek.? Another commercial features a Macon restaurateur crediting Abrams for helping her and the community during the pandemic.",
    "The incumbent is now firing back with an ad declaring, The insiders and casino bosses are spending millions to attack Kevin Stitt because he won't do their bidding, resorting to lies, smears, even actors.? The story says that Stitt has spent a total of $468,000 on ads so far, though his allies at the RGA are deploying another $577,000 to support him.",
    "All the way back in December, an organization called Conservative Voice of America began running ads attacking Stitt for approving the 2020 release of an inmate named Lawrence Anderson, who was charged the next year with brutally murdering three people, while another group called Sooner State Leadership has deployed similar messaging.",
    "Cooper to stop Republicans from restricting voting rights and a womans right to choose.?\n Tuesday, Apr 12, 2022  12:47:39 PM Pacific Daylight Time  Jeff Singer\nPA-12: EMILYs List, which supports state Rep. Summer Lee in next months Democratic primary, is out with a poll from GQR that shows her outpacing attorney Steve Irwin 38-13.",
    "Tuesday, Apr 12, 2022  12:37:30 PM Pacific Daylight Time  Jeff Singer\nMN-01: Former Department of Agriculture official Brad Finstad has earned endorsements from Reps. Michelle Fischbach and Pete Stauber, who represent the 7th and 8th Districts in the northern part of the state, ahead of the May 24 special Republican primary.",
    "Tuesday, Apr 12, 2022  12:42:16 PM Pacific Daylight Time  Jeff Singer\nMT-01: In her opening ad for the June Democratic primary, public health expert Cora Neumann stands in front of her modest childhood home in Bozeman and tells the audience, But now, houses like this are surrounded by mansions like this.",
    "Tuesday, Apr 12, 2022  11:13:42 AM Pacific Daylight Time  Jeff Singer\nMN-Gov: State Sen. Paul Gazelka has picked up an endorsement from the Minnesota Police and Peace Officers Association, which is the largest police union in the state, in his quest for the Republican nomination.",
    "Tuesday, Apr 12, 2022  10:43:08 AM Pacific Daylight Time  Jeff Singer\nNV-Sen, NV-Gov: The Reno Gazette-Journal has released a poll from Suffolk University of several different hypothetical general election scenarios for Senate and governor, and it finds things close overall.",
    "The last survey we saw was a March poll for the West Virginia Chamber of Commerce that put McKinley ahead 38-33; the organization had not yet endorsed anyone when that poll was released, but it and the West Virginia Manufacturing Association both backed McKinley this week.",
    "Tuesday, Apr 12, 2022  1:07:34 PM Pacific Daylight Time  Jeff Singer\nAZ-Sen: Democratic incumbent Mark Kellys new spot features footage of the former astronaut in zero-g as he tells the audience, Compared to Congress, the way NASA operates might seem kind of upside down.",
    "The survey shows Kemp taking 49% of the vote on May 24, which is tantalizingly close to the majority he needs to avoid a July runoff, while former Sen. David Perdue is well behind with 33%; Cygnal also finds the incumbent ahead 52-37 in a two-person nomination contest.",
    "Tuesday, Apr 12, 2022  12:55:05 PM Pacific Daylight Time  Jeff Singer\nWV-02: Rep. Alex Mooney has released a new internal from Public Opinion Strategies that gives him a 42-31 lead over fellow incumbent David McKinley ahead of their May 10 GOP primary.",
    "And getting the job done no matter what.? The senator proclaims that hes doing things differently? than the rest of the D.C. crowd and put[ing] aside the party politics so we can accomplish results, together.?\nThis is a short blurb about Daily Kos.",
    "Stitt only picked up a notable intra-party challenger last month when Oklahoma Department of Veterans Affairs Director Joel Kintsel launched his bid to unseat his boss, but the offensive against the governor began well before then.",
    "The Minnesota Reformer described the development as a blow to former Hennepin County Sheriff Rich Stanek,? who is one of the many other Republicans who is competing for the state party endorsement at the May 13-14 convention.",
    "(Public Radio Tulsa said Andersons release was apparently recommended by the state pardon and parole board by mistake.?)\nCVA, per NBC, has spent $1.7 million so far, while SSLF has dropped a similar $1.6 million.",
    "Former Attorney General Adam Laxalt posts a 43-40 advantage over Democratic Sen. Catherine Cortez Masto, while Army veteran Sam Brown, who is the underdog in the June Republican primary, edges her out 40-39.",
    "I think a lot depends on what happens in the next month with the Legislature in this legislative sessionwhat we accomplish and what we don't,? said the governor, who currently faces no serious opposition.",
    "Worthen, in the words of KOCO, said his group is made up of business and community leaders dedicated to encouraging strong leadership in Oklahoma,? and that it planned to spend a total of $10 million.",
    "Phil Scott reiterated this week that he wouldnt announce if hed seek a fourth two-year term until the legislative session adjourns May 20, and he insisted to NBC 5 that he was truly undecided.",
    "Brian Kemps allies at Hardworking Georgians are out with a Cygnal poll arguing that hes in a strong position to claim the Republican nod and to defeat Democrat Stacey Abrams in the fall.",
    "John Fetterman has publicized an internal from GBAO that finds him leading Rep. Conor Lamb 44-19 in the May 17 Democratic primary, while state Rep. Malcolm Kenyatta takes 17.",
    "On the GOP side, TV personality Mehmet Oz is trumpeting his endorsement from Trump in his new ad, and he also gets in a swipe at former hedge fund manager David McCormick.",
    "Its not David McCormick, the liberal pro-Biden, pro-China, Wall Street insider.?\n Tuesday, Apr 12, 2022  11:09:58 AM Pacific Daylight Time  Jeff Singer\nGA-Gov: Gov.",
    "Kevin Stitt has looked secure ahead of his June Republican primary, NBC reports that two dark money groups have together spent a hefty $3.3 million to derail him.",
    "One ad is based around a testimonial from Lara Hodgson, an independent who describes how she partnered with Abrams to build their successful small business.",
    "A third entirety, The Oklahoma Project, has attracted less attention, and it said in December that it would spend $500,000 total to thwart Stitt.",
    "The groups messaging has been different from the other two, though, as its ads have argued that the governor has failed to achieve results.",
    "(Democrats have a far more high-profile contest that day between conservative Rep. Henry Cuellar and attorney Jessica Cisneros.)",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Flores, though, is already the GOP nominee, while the other four contenders should have little trouble in their own primaries.",
    "SSLF, meanwhile, was formed by former GOP state Rep. Trebor Worthen, but the organization does not need to divulge its donors.",
    "It traced TOPs donations back to George Krumme, who is an oilman and longtime member of the Democratic National Committee.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "The filing deadline is May 26, so a Scott retirement would give other candidates very little time to make up their minds.",
    "The general election portion gives Kemp a 50-44 lead in a rematch with Abrams even as she edges out Perdue 48-47.",
    "Theres even less information about CVA except that it's run by longtime lobbyist and GOP staffer Mike Cys.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Tuesday, Apr 12, 2022  12:31:17 PM Pacific Daylight Time  Jeff Singer\nVT-Gov: Republican Gov.",
    "Trump knows who the real conservative is whos gonna shake up Washington,? says the narrator.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "Abrams, for her part, is continuing to run positive spots to reintroduce herself to voters.",
    "Tuesday, Apr 12, 2022  12:12:00 PM Pacific Daylight Time  Jeff Singer\nOK-Gov: While Gov.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "This is the first survey weve seen of the contest for this open seat.",
    "Pat McCrory 33-23, with just 7% going to former Rep. Mark Walker.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Last month, Fox 23 sought to learn more about Stitts critics.",
    "Several other recent polls have also given Budd the lead.",
    "Its also a place to discuss elections, not policy.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our podcast, The Downballot!",
    "New episodes every Thursday morning.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Putting the mission first.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Working as a team.",
    "Please read it."
  ]
}