{
  "id": 6505,
  "mediaId": 19,
  "date": "2/5/2022 12:00:00 AM",
  "headline": "ExclusiveJim Bognet: Biden Turning Beautiful Rural Pennsylvania into Afghan Refugee Dumping Ground",
  "image": "https://media.breitbart.com/media/2022/02/GettyImages-1237277392-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/05/exclusive-jim-bognet-biden-turning-beautiful-rural-pennsylvania-into-afghan-refugee-dumping-ground/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Binder",
  "authorUrl": "https://www.breitbart.com/author/john-binder/",
  "termIds": [
    3104
  ],
  "sentences": [
    "Republican Jim Bognet, running against Democrat Rep. Matt Cartwright in Pennsylvanias 8th congressional district, says President Joe Biden has turned a beautiful, rural area? into a dumping ground? for hundreds of unvetted Afghan refugees.?\nAs Breitbart News has reported, the Biden administration has brought more than 76,000 Afghans to the United States for resettlement across 46 states since mid-August 2021.",
    "They have ghost flights of illegal immigrants over Christmas, theyre really treating rural, red America like its their dumping ground.?\nAccording to Bognet, Cartwright has privately said that he was unaware of the Afghan refugee plans for northeast Pennsylvania, although he purports to have a close relationship with Biden.",
    "LISTEN:\nIn Butler Township, Pennsylvania, which is a beautiful rural area two miles from my house, the Biden administration just dropped that theyre going to put 500 to 600 unvetted Afghan refugees into the [Keystone Job Corps] facility  this is a facility that trains college kids to get jobs and get skills,? Bognet said.",
    "We have a direct clear and present danger to the security of our citizens in northeast Pennsylvania and Cartwright claims  he knew nothing about it but then he says Im fine with this, we should be doing this, just like he supported the ghost flights of illegal immigrants up here,? Bognet said.",
    "The operation is being facilitated by the federal government, a non-governmental organization (NGO) backed by former Presidents Bill Clinton, George W. Bush, and Barack Obama, as well as the U.S. Chamber of Commerce and multinational corporations.",
    "Over the last 20 years, nearly a million refugees have been resettled in the nation  more than double that of residents living in Miami, Florida, and it would be the equivalent of annually adding the population of Pensacola, Florida.",
    "With Cartwrights help, the Biden administration has ensured that the Afghan resettlement has no clear end date and is planning to fast-track thousands more Afghans into U.S. communities, rewarding them with green cards.",
    "Local law enforcement who Ive talked to have no idea who these people are, we dont have their criminal records, we dont have their vaccine status, we dont have their COVID-19 status, we dont have any status on them.",
    "Bognet, in an exclusive interview with SiriusXM Patriots Breitbart News Saturday, said that Biden  with the help of Cartwright  is unloading hundreds of Afghans on a rural community in northeast Pennsylvania.",
    "In September 2021, an Afghan male was arrested for allegedly molesting 12-year-old and 14-year-old boys at Fort McCoy while another Afghan male was arrested for beating his wife to near death.",
    "Were going to be fighting it every step of the way  this is what Biden and Cartwright do to us, theyve turned northeastern Pennsylvania into a dumping ground for Afghan refugees,? Bognet said.",
    "We demand that we be protected and we know whats going on in our own backyard and I dont think thats unreasonable.?\nEvery five years, refugee resettlement costs taxpayers nearly $9 billion.",
    "Domestic abuse by Afghan men has been so rampant across various U.S. military bases where Afghans are temporarily living that the administration deployed gender advisors? to intervene.",
    "And instead, were going to put 500 to 600 unvetted Afghan refugees.?\nI have no trust in the Biden administration that they have any ability to screen these people,? Bognet continued.",
    "Over the course of a lifetime, taxpayers pay about $133,000 per refugee, and within five years of resettlement, roughly 16 percent will need taxpayer-funded housing assistance.",
    "We dont know who they are.?\nIndeed, the Biden administration has continued withholding information on Afghans pertaining to their criminal records and terrorism ties.",
    "Most recently, an Afghan male, brought to the U.S. by Biden, was convicted of molesting a three-year-old girl at Marine Corps Base Quantico in Virginia.",
    "Department of Homeland Security (DHS) Secretary Alejandro Mayorkas has admitted that not all? Afghans arriving in the U.S. are vetted in person.",
    "Indeed, Cartwright has helped fund Bidens Afghan resettlement operation to the sum of more than $13 billion in American taxpayer money.",
    "People are sick and tired of being treated like second-class citizens and a dumping ground.",
    "Breitbart News Saturday airs on SiriusXM Patriot 125 from 10:00 A.M. to 1:00 P.M. Eastern.",
    "Last year, an Afghan male was arrested and charged with raping a teenage girl in Montana.",
    "We havent even heard anything from Republican officials,? Bognet said.",
    "John Binder is a reporter for Breitbart News.",
    "Email him at jbinder@breitbart.com.",
    "Weve heard nothing from Gov.",
    "Follow him on Twitter here.",
    "Wolf."
  ]
}