{
  "id": 6522,
  "mediaId": 376,
  "date": "d2022-05-19T14:30",
  "headline": "At the Races: NY state of turmoil",
  "image": "https://i0.wp.com/cdn.media.rollcall.com/author/2019/10/AT-THE-RACES-LOGO-20202400x1300.jpg?fit=1240,698",
  "link": "https://www.rollcall.com/2022/05/19/at-the-races-ny-state-of-turmoil/",
  "sentiment": "0.0",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephanie Akin\nKate Ackley\nMary Ellen McIntire",
  "authorUrl": "https://www.rollcall.com/author/stephanie-akin/",
  "termIds": [
    661,
    821,
    1147,
    1226,
    1609,
    2087,
    2303,
    3094,
    3103,
    3104,
    5304,
    5375,
    5431,
    142
  ],
  "sentences": [
    "The Democratic Congressional Campaign Committee urged the state's highest court in a letter Wednesday, provided to Roll Call, to make immediate changes.\nBut regardless of the court's decision, the episode has already wreaked havoc among Democratic leaders and laid bare tensions within the caucus that have been simmering all cycle  due in no small part to the role DCCC Chair Sean Patrick Maloney has played as he fights to protect his own political future as a member of the New York delegation.",
    "The poll finds that nearly two-thirds of voters think crime is rising in their state and 59 percent blamed criminals having easy access to guns. A generic Democrat who supports stronger gun laws has a six-point advantage over a Republican who opposes new gun restrictions, and a seven-point advantage among suburban voters  a key voting bloc Democrats need to reclaim in November, a memo summarizing the findings says.",
    "Additionally, former Rep. Dave Nagle endorsed Franken, saying in a statement: While I normally do not endorse candidates in Democratic primary races, I have decided to break with my prior position to enthusiastically back former Navy Admiral Mike Franken.\nGoing live: The Associated Press reports that Biden has taken in $7.8 million during five in-person fundraisers since March to support Democratic campaigns.",
    "You understand your community better than anyone else, and we're going to learn from you just as much as you learn from us.' And so this is why we started off doing social media for our clients, and not only was that incredibly inefficient and losing us money from a business perspective, but it was just not the right thing to do from a communications perspective.",
    "A family affair: Jennifer Carnahan, the widow of the late Minnesota Rep. Jim Hagedorn, is running in the special election to fulfill his term, set for Tuesday, but the Daily Beast reports that Republicans in the state and in Washington don't support her campaign and some are skeptical of her claim that Hagedorn wanted her to run for the seat.",
    "Tightrope walk: Politico took a close look at how first-term GOP Rep. Nancy Mace has oscillated back and forth from Donald Trump backer to critic as she has struggled to get her footing in Washington and appeal to voters in her South Carolina swing district, in which she faces a Trump-backed primary challenger in June.",
    "You're kind of in this, like, I don't want to say you're kind of fooling yourself, but you're definitely not necessarily having a pulse on what voters actually think when you're so embedded and focused on just working 12-hour, 16-hour days to get the person that hired you elected, or reelected in this case, he said.",
    "In Tuesday's primaries, meanwhile, the nomination of far-right Republicans Sandy Smith and Bo Hines in competitive open North Carolina seats kept alive another Democratic hope, that they can tie GOP nominees to the extreme positions that could hurt them with independent and moderate voters in November.",
    "That experience, along with the fact that Obama was in the White House, had really painted this picture of politics to me that was really interesting, both the strategic side of it but also the hope side of it, which I think I'm a little more jaded on that front. He interned for Rep. Barbara Lee.",
    "The Congressional Leadership Fund, which is aligned with Minority Leader Kevin McCarthy, released polling from 16 districts that President Joe Biden won by an average of 8 points and found that the generic ballot was tied and Biden's approval was 8 percentage points lower than his disapproval.",
    "One and done: Freshman Rep. Madison Cawthorn lost his primary in a bid for a second term in North Carolina's 11th District to state Sen. Chuck Edwards, marking an end to a headline-grabbing congressional career that led to public fights with colleagues, who in some cases fought to oust him.",
    ": A two-page state Supreme Court ruling overturned a lower court finding that a new district map favored Republicans in Kansas, making it likely the lone Democrat in Kansas' delegation, Rep. Sharice Davids, will face a much tougher reelection bid, CQ Roll Call's Michael Macagnone writes.",
    "Voting probe closed: New Hampshire's attorney general's office said Matt Mowers, who is running in the Republican primary to take on Rep. Chris Pappas in November, did not violate state election laws by voting in the 2016 presidential primary both there and in New Jersey after moving.",
    "Ballot watch: State officials in more than 30 states are pursuing election subversion through laws providing for aggressive audits that could be partisan, giving legislatures the power to award electoral votes and other means, three organizations say in a report obtained by USA Today.",
    "I loved that, even though most of what I was doing was answering calls and tallying up who's talking about what, but it was still really fun to be in that place of seeing how our democracy worked. After graduating, he went on to work for Colorado Sen. Mark Udall's reelection campaign.",
    "New crime polling: Voters in battleground Senate states are extremely concerned about violent crime involving guns, and 53 percent of voters say Biden has a major responsibility to address it, according to a new Global Strategy Group poll for Giffords shared first with CQ Roll Call.",
    "Fighters, not unifiers: With Trump no longer in the White House and Biden's approval ratings underwater, the electability message is falling flat in Democratic primaries; the party's base wants fighters, not unifiers, writes Amy Walter in The Cook Political Report with Amy Walter.",
    "Democratic strategists aware of the odds stacked against them in the midterms have pointed all year to a rare bright spot in New York, where, they were certain, new congressional maps drawn by Democrats might help them pick up enough House seats to offset losses in other states.",
    "Supporters of abortion rights have been touting Cisneros all year as she tries to oust Cuellar, one of the last Democratic abortion rights opponents in Congress, and increased the volume after a leaked opinion showing a Supreme Court majority would overturn Roe v. Wade.",
    "The count: $23,132\nThat's how much, every day, people donating amounts of under $200 gave on average to Democratic challenger Jessica Cisneros  for a total of more than $786,000  in roughly five weeks leading up to her runoff Tuesday against Texas Rep. Henry Cuellar.",
    "Alaska at-large candidate Sarah Palin, the state's former Republican governor and one-time VP candidate, is endorsing former Sen. David Perdue in his primary campaign for Georgia governor at an event Friday in Savannah, according to a release from his campaign.",
    "ICYMI\nCleaver makes the cut: Missouri's Senate approved a congressional map that would likely retain the state's partisan alignment and put an end to some Republicans' efforts to dismantle Democratic Rep. Emanuel Cleaver's Kansas City-based 5th District.",
    "So on election night we had this ballroom at this hotel in downtown Denver and I just remember everyone was so bubbly at the beginning of the night, and then as the returns started coming in the mood got a little more sour and then the concession speech.",
    "What we're reading\nExtreme in the mainstream: Several outlets traced theories promoted by mainstream Republican candidates and party leaders to the racist great replacement conspiracy theory that allegedly inspired a mass shooting in Buffalo last week.",
    "Starting gate\nInternal divisions: Primaries in five states this week offered mixed results for both parties, as progressives claimed wins and took some losses while former President Donald Trump's endorsement held more power in some races than others.",
    "The long goodbye: The Washington Post explored how a once symbiotic relationship between Trump and the Club for Growth, a deep-pocketed anti-tax super PAC, turned into a grudge match after they backed opposing candidates in the Ohio Senate primary.",
    "Big bucks: Megadonors are spending heavily in House Democratic primaries this year, with super PACs and other outside groups already dropping $53 million into those races with months left to go on the primary calendar, Politico reports.",
    "But Democrat Jasmine Crockett, a progressive state legislator in next week's runoff in the Dallas-area 30th District, brushed off criticism from her opponent, Jane Hope Hamilton, about her support from two cryptocurrency-fueled groups.",
    "Ooops: We forgot to toot our own horns last week and let you know the At the Races team joined host and Editor-in-Chief Jason Dick for the Political Theater podcast to discuss our lists of the most vulnerable House and Senate members.",
    "The new additions are John Duarte in California's 13th District, Colin Schmitt in New York's 18th, April Becker in Nevada's 3rd, Marc Molinaro in New York's 19th, Jim Bognet in Pennsylvania's 8th, and Cassy Garcia in Texas' 28th.",
    "#IL06: As early voting begins in Illinois ahead of the June 28 primaries, Democratic Rep. Marie Newman released a spot highlighting her support for abortion rights, discussing her own decision to terminate a pregnancy at age 19.",
    "Bucking BOLD: Republican Reps. Tony Gonzales of Texas and Mario Diaz-Balart of Florida were among those who launched a PAC to support first-time Republican Latino congressional candidates, CQ Roll Call's Chris Marquette reports.",
    "New fights in New York: A special master released a new draft congressional map for New York on Monday, prompting fierce pushback from the state's Democratic delegation and scrutiny of Rep. Sean Patrick Maloney, the DCCC chair.",
    "That has been overshadowed by the potential for a race between Sean Patrick Maloney and freshman Rep. Mondaire Jones, after Maloney said he would run in a district that includes his hometown but much of Jones' current district.",
    "The map, which is set to be finalized on Friday and includes one less district than the current delegation because of reapportionment, would set up a primary between longtime Reps. Jerrold Nadler and Carolyn B. Maloney.",
    "Newman is running against fellow Democratic Rep. Sean Casten, who also supports abortion rights; she defeated then-Rep. Dan Lipinski, one of the last congressional Democrats to oppose abortion rights, in a 2020 primary.",
    "Fighters continued: Tuesday's primaries suggest that at least some Democratic voters want their party to pursue a more ambitious liberal agenda, delivering a stinging rebuke\" to the wing of the party aligned with Sens.",
    "You're kind of in this bubble, right, on a campaign, where there's a little bit of groupthink, you're kind of all thinking and feeling pretty good, you don't really understand that people might not like the candidate.",
    "We always tell them, we will support you and augment your efforts, but we really want you to take control of your own platform.\nDo you know someone who works in campaigns whom we should feature for Shop Talk?",
    "And I think there's this consultant-happy tendency in politics of let's surround ourselves, if we have the resources, with all these consultants and stuff, and that's good, I mean that's what I am, he said.",
    "Photo finish\nSen. Thom Tillis smiles as he heads to vote on Wednesday, the day after the candidate he endorsed beat a Republican House colleague, Madison Cawthorn, in North Carolina's 11th District primary.",
    "Dubbed the Hispanic Leadership Trust, it has the backing of GOP House leaders and would be a counterpart to BOLD PAC, the fundraising arm of the Congressional Hispanic Caucus, which supports Democrats.",
    "A DCCC backgrounder on its polling provided to Roll Call showed that Frontline members were running 5 points ahead of the generic Democrat, with average approval ratings almost 22 points above Biden's.",
    "Democrats are still scrambling to respond to the draft map released by a court-appointed special master Monday that would force some of the most senior Democrats in the House to face off in primaries.",
    "I got involved with certain organizations on campus, and just the general culture at Berkeley is one of civic engagement, and I think that's one of the reasons why I was drawn to going there, he said.",
    "Iowa Senate: Recent polling in the Democratic primary for Iowa Senate between former Rep. Abby Finkenauer and retired Adm. Mike Franken showed an essentially tied race, according to Inside Elections.",
    "Speaking of the Alaska House race, the National Organization for Women PAC endorsed independent candidate Al Gross, who separately said he was launching a six-figure digital, radio and TV ad buy.",
    "After largely avoiding live fundraising events during the coronavirus pandemic, he plans to increase appearances in the run-up to the November elections, the Democratic National Committee said.",
    "Because I learned so much in those nine months or whatever it was when I was living in Colorado working on Mark Udall's campaign.\nUnconventional wisdom: There is no playbook for a campaign.",
    "#MD04: A poll commissioned by former Democratic Rep. Donna Edwards found that her attempt at a comeback is resonating with voters in Maryland's 4th District, according to Maryland Matters.",
    "I'm just saying.\nShop talk: Amir Salehzadeh\nSalehzadeh is the CEO and founder of Kinetic Strategies, which recently rebranded from A+G Digital and focuses in part on online fundraising.",
    "New commish: Senate Majority Leader Charles E. Schumer filed cloture on Dara Lindenbaum's nomination to the Federal Election Commission, teeing up a final vote potentially on Tuesday.",
    "Candidate confessions\nProgressive groups raised alarms this week about the millions of dollars from super PACs founded by cryptocurrency investors flowing into Democratic primaries.",
    "New young guns: House Republicans' campaign arm added six candidates this week to its Young Guns program, which requires candidates to reach fundraising and messaging benchmarks.",
    "A DCCC internal poll reported by Punchbowl News on Wednesday showed the generic Republican ahead of the generic Democrat 47 percent-39 percent in battleground districts.",
    "Republican Reps. Adam Kinzinger of Illinois and Liz Cheney of Wyoming have meanwhile blasted GOP leadership for enabling such attitudes among members and voters.",
    "Foreign affairs: The Justice Department sued big GOP donor Steve Wynn, the former CEO of Wynn Resorts, to compel him to register as a foreign agent of China.",
    "In all, Cisneros' pre-runoff disclosure to the FEC, covering April 1 to May 5, reported receipts of $1.2 million and a closing cash balance of $1.4 million.",
    "And it's not too late  but I think that's a regret, is sort of going into the consulting side so quick instead of taking my time and doing another campaign.",
    "He went on to work at Precision Strategies before attending the University of Michigan Ross School of Business and launching his own firm.",
    "Nathan's look at the races this fall indicates that, despite the bad climate they face, Democrats could actually pick up a seat  or two.",
    "Alabama, Georgia and Arkansas  where someone who may or may not have won a Super Bowl is running for Senate  are having primaries.",
    "Endorsement watch: Indivisible backed Michigan Democratic Rep. Andy Levin in his August primary against fellow Rep. Haley Stevens.",
    "The mockery that was made of those hopes this week has instead become a symbol of just how bad things are going for Democrats.",
    "And Elise Stefanik, the third-ranking House Republican, has come under fire for campaign advertisements that echo the themes.",
    "I never take things for granted.\nBiggest campaign regret: Udall's campaign was the only one Salehzadeh worked for directly.",
    "(Bill Clark/CQ Roll Call)\nSubscribe now using this link so you don't miss out on the best news and analysis from our team.",
    "All that was playing out as a series of polls were released showing an increasingly bleak environment for House Democrats.",
    "Hagedorn's mother, stepfather and sister sued Carnahan this week, alleging that she owes them money for his medical care.",
    "Candidates who have espoused those views, according to The Associated Press, include Blake Masters, Eric Schmitt and J.D.",
    "Jones has not yet said where he would run, but could also run in the same district as fellow freshman Rep. Jamaal Bowman.",
    "Looking back, he says he could have learned more by doing another campaign stint before moving into the consulting space.",
    "And for me the lesson here was, Wow, I could not have been further off from reality.' The election was called early.",
    "According to Politico, some frontliners have complained about Maloney's decision to run against another incumbent.",
    "The proposed plan would break up a majority Black North Florida district represented by Democratic Rep. Al Lawson.",
    "Cuellar's report showed receipts of $352,000 and just $3,009 from so-called small donors giving under $200.",
    "But I think what we oftentimes tell people in our pitches and in our conversations is: You are the expert.",
    "In response, she called the lawsuit a political stunt and said Hagedorn's estate is still being probated.",
    "Nathan's notes\nNorth Carolina, which has an 8-5 GOP advantage in the House now, adds a seat in November.",
    "Crypto tears, baby, crypto tears, Crockett told The Texas Tribune, pointing to a campaign pamphlet.",
    "Starting out: Salehzadeh studied political science at the University of California, Berkeley.",
    "A circuit court ruled that the plan is unconstitutional, and the state appealed within hours.",
    "I would have liked to be, obviously, in more of a midlevel, senior-level role on a campaign.",
    "Florida not finished: Wrangling over a Florida congressional map drawn by Republican Gov.",
    "Outside groups fueled big spending in competitive races but didn't always carry the day.",
    "Most unforgettable campaign moment: Udall losing his reelection bid in 2014 was a shock.",
    "Kyrsten Sinema of Arizona and Joe Manchin III of West Virginia, The Intercept declares.",
    "There are also runoffs in Texas and a special election in Minnesota's 1st District.",
    "Each week we'll bring you news and analysis from the CQ Roll Call campaign team.",
    "I would have liked to do another, either gubernatorial or Senate race, he said.",
    "She would replace Steven T. Walther, who has been serving on an expired term.",
    "[Former Labor Secretary] Robert Reich was one of my professors  pretty wild.",
    "There's a large contingency of people who will vote against your candidate.",
    "Of course, voters elect candidates, not generic Democrats and Republicans.",
    "Vance, GOP Senate candidates in Arizona, Missouri and Ohio, respectively.",
    "He's accused of lobbying then-President Trump for China in 2017.",
    "But following the standard set of rules is not going to cut it.",
    "There are some things that you have to do, right?",
    "I just wasn't ready to start my family, she said.",
    "Know someone who'd like to get this newsletter?",
    "He had $1 million in his account on May 5.",
    "Ron DeSantis' staff continued this week.",
    "Email us at attheraces@cqrollcall.com.",
    "And I think that has stuck with me.",
    "The mailers are beautiful though.",
    "Coming up\nMore primaries!",
    "They can subscribe here.",
    "Welcome to At the Races!",
    "You are the candidate.",
    "Cory Gardner had won.",
    "Kansas shutout?"
  ]
}