{
  "id": 8474,
  "mediaId": 19,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "Exclusive  Pennsylvanias Jim Bognet: Republicans Winning in Bidens Hometown Will be a Giant Repudiation of His Agenda",
  "image": "https://media.breitbart.com/media/2022/05/Election-2022-House-PA-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/28/exclusive-pennsylvanias-jim-bognet-republicans-winning-in-bidens-hometown-will-be-a-giant-repudiation-on-his-agenda/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Bliss",
  "authorUrl": "https://www.breitbart.com/author/jbliss/",
  "termIds": [
    1147,
    1335,
    2087,
    3104,
    4622,
    146,
    428,
    2991,
    2862
  ],
  "sentences": [
    "I think when I beat Matt Cartwright, whos a lap dog to Nancy Pelosi and Joe Biden in Joe Bidens hometown, when I beat him and beat him big here in November, that will be a giant repudiation of the Biden-Pelosi agenda, the liberal Build Back Better BS agenda that theyve jammed down our throats.",
    "After defeating former Democrat Mike Marsicano in the Republican primary early this month and looking toward the November general election, he stated that the change in his district is beneficial to him because his opponent, the Democrat congressman, is one of those country club guys.",
    "Jim Bognet, a Trump-endorsed Republican congressional candidate in Pennsylvanias Eighth Congressional District, declared on Breitbart News Saturday that unseating lap dog Rep. Matt Cartwright (D-PA) in November will be a giant repudiation of the Biden-Pelosi agenda.",
    "Were seeing in our polling, people are turning their backs on Joe Biden and Matt Cartwright because of economic issues, that kind of kitchen-table economic issues that are devastating American working-class families, so I think were seeing a major shift, he added.",
    "I think youre seeing a Republican Party that is changing to represent the working class people that have pulled themselves up by their own bootstraps, and not necessarily representing the country club Republicans of a generation or two ago.",
    "If voters in the Eighth Congressional District are sick and tired of paying for the skyrocketing price of gas and diesel, he said, they should vote for me because I and fellow Republicans will bring change to Washington.",
    "Discussing his congressional district and other candidates, Bognet explained that Republicans want candidates who will fight because everyday people are sick and tired of getting rolled.",
    "Thatll be the American people starting here in Scranton and Wilkes Barre and Hazleton, PA, standing up and saying, We dont want to spend another $5 trillion of deficit spending.'",
    "And fits in right in there with Joe Biden and Nancy Pelosi, people that have made their life in so-called public service but somehow seem to be worth $100 million in the deal.",
    "He added that Matt Cartwright, the Democrat who represents Pennsylvanias Eighth Congressional District, is a guy who owns four homes, and is worth $20,000,000.",
    "Were dealing with woke liberals that really want to change America for the worse from, you know, transsexual ideology to woke-ism to cancel culture, he added.",
    "People want candidates who represent them and live like them and understand the pocketbook issues facing them, he explained.",
    "These are people that, you know, working-class folks that signed up with President Trump when he ran for office.",
    "Bognet continued to say that Scranton and Pennsylvanias Eighth Congressional District is Trumps country.",
    "The Trump-endorsed Republican explained that the party is changing from what it used to be.",
    "Breitbart News Saturday airs on SiriusXM Patriot 125 from 10:00 a.m. to 1:00 p.m. Eastern.",
    "I hear constantly: We need people that will go to Washington and fight against this.",
    "Like illegal immigration has been destroying parts of America for the last 25 years.",
    "So it was great to have him come to Pennsylvania and campaign for me, he added.",
    "We are seeing the vast majority of my district trend America First Republican.",
    "Write to him at jbliss@breitbart.com or follow him on Twitter @JacobMBliss.",
    "We need people thatll go and finish the president  President Trumps  wall.",
    "And I believe that when we get to November  Matt, its very simple.",
    "Jacob Bliss is a reporter for Breitbart News.",
    "Were in an existential battle."
  ]
}