[
  {
    "id": 3089,
    "mediaId": 2518,
    "date": "2022-02-01",
    "sentence": "Through Dec. 31, America Strong and Free PAC reported raising $119,877 in contributions and expenses and spending $39,763.52, including $15,000 in contributions -- $5,000 apiece to U.S. John Boozman of Arkansas and congressional candidates <span class='selected-term'>Juan Ciscomani</span> of Arizona and Matt Jacobs of California.",
    "author": "Michael R. Wickline",
    "title": "Arkansas officials report income from 2021 sources outside government"
  },
  {
    "id": 1929,
    "mediaId": 8260,
    "date": "2022-02-04",
    "sentence": "In the first of the emails on April 20, 2017, Greg Lucero, a vice president of the Hermosa Project, wrote <span class='selected-term'>Juan Ciscomani</span>, a senior adviser to Gov.",
    "author": "Ian James",
    "title": "Conservation activists say a proposed mine threatens water source in Arizona’s Sky Islands"
  },
  {
    "id": 1809,
    "mediaId": 2658,
    "date": "2022-02-08",
    "sentence": "That list includes: De La Cruz in Texas; Army reservist Esther Joy King, who is vying to replace retiring Rep. Cheri Bustos (D-Ill.); <span class='selected-term'>Juan Ciscomani</span>, a longtime adviser to Arizona Gov.",
    "author": "",
    "title": "Women, candidates of color lead GOP charge to flip the House"
  },
  {
    "id": 2450,
    "mediaId": 2589,
    "date": "2022-02-08",
    "sentence": "#TheAmericanDream #AZ02https://t.co/890c6IrbZQ pic.twitter.com/1MtySXUWor\n— <span class='selected-term'>Juan Ciscomani</span> (@JuanCiscomani) October 6, 2021\nAnd given Joe Biden’s poll numbers and the general consensus that the country is not headed in the right direction, there are GOP candidates with a chance to win in districts where Biden won in 2020 by as much as 11 points.",
    "author": "John Sexton",
    "title": "As GOP tries to retake the House, women and minority candidates lead the way"
  },
  {
    "id": 2484,
    "mediaId": 4032,
    "date": "2022-02-09",
    "sentence": "Among the non-white and female 2022 GOP contenders are, Politico relates, “Monica De La Cruz in Texas; Army reservist Esther Joy King, who is vying to replace retiring Rep. Cheri Bustos (D-Ill.); <span class='selected-term'>Juan Ciscomani</span>, a longtime adviser to Arizona Gov.",
    "author": "by\nSelwyn Duke",
    "title": "The Worst Thing to Be in Many GOP Primaries? A White Male Candidate."
  },
  {
    "id": 14250,
    "mediaId": 8386,
    "date": "2022-03-15",
    "sentence": "",
    "author": "Angela Gervasi",
    "title": "SR-189 ramps unveiled to improve cross-border traffic"
  },
  {
    "id": 9793,
    "mediaId": 2520,
    "date": "2022-03-25",
    "sentence": "Republicans\n<span class='selected-term'>Juan Ciscomani</span>\nJuan Ciscomani for the last seven years has been working as the senior adviser for regional and international affairs under Gov.",
    "author": "Melissa Estrada",
    "title": "Here are the candidates running in Arizona's new 6th Congressional District"
  },
  {
    "id": 6551,
    "mediaId": 8349,
    "date": "2022-04-14",
    "sentence": "Garret talks about Texas Gov Greg Abbott making a deal with Mexico to stop illegal immigration, why Ducey won't do that and how Arizona candidates <span class='selected-term'>Juan Ciscomani</span> and Karen Taylor-Robson are Doug Ducey.",
    "author": "Garret Lewis",
    "title": "Garret Talks About How Juan Ciscomani & Karen Robson Are Doug Ducey"
  }
]