[
  {
    "id": 6383,
    "mediaId": 2658,
    "date": "2022-01-24",
    "sentence": "ROB PORTMAN have spent $10 million each: MATT DOLAN, a state senator and part owner of the Cleveland Guardians baseball team, and investment banker <span class='selected-term'>MIKE GIBBONS</span>.",
    "author": "",
    "title": "POLITICO Playbook: Biden confronts major troop decision"
  },
  {
    "id": 4674,
    "mediaId": 2537,
    "date": "2022-02-24",
    "sentence": "",
    "author": "Mike Gibbons",
    "title": "Opinion: Financial crisis looming for working class as inflation hits record high"
  },
  {
    "id": 2838,
    "mediaId": 2658,
    "date": "2022-03-16",
    "sentence": "The letter\nOHIO’S GIBBONS USED OFFENSIVE STEREOTYPES — NYT’s Blake Hounshell and Leah Askarinam scoop that <span class='selected-term'>MIKE GIBBONS</span>, who is leading in the crowded Ohio GOP Senate primary, “employed offensive stereotypes about Asian people in a 2013 podcast, citing a widely discredited book, ‘The Bell Curve,’ that has drawn allegations of racism and sloppy research.”\n— What he said, per the story: “I’ve often thought that when I’ve run into Asians they’re all — you know, if you’ve ever read ‘The Bell Curve’ … And it said that the smartest people in the world as far as measurable I.Q.",
    "author": "",
    "title": "POLITICO Playbook: What Zelenskyy wants vs. what he'll get"
  },
  {
    "id": 1880,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "For example, on March 15, the New York Times quoted 2013 comments from <span class='selected-term'>Mike Gibbons</span>, an investment banker who is running for the GOP nomination in Ohio’s Senate race:\nGibbons, who earned a master’s degree from the Weatherhead School of Management at Case Western Reserve University, described being in a class with “mostly Asians” during graduate school.",
    "author": "Neil Munro",
    "title": "NBC: Joe Biden Will Import Favored Ukrainians"
  },
  {
    "id": 2084,
    "mediaId": 2572,
    "date": "2022-03-24",
    "sentence": "Continue reading …\nNYT BLASTED – Ohio GOP Senate candidate <span class='selected-term'>Mike Gibbons</span> lashed out at The New York Times saying the paper \"hates any conservative.\"",
    "author": "",
    "title": "Biden demands Dr. Oz, Herschel Walker resign; The spies among us -- one former spy speaks out"
  }
]