[
  {
    "id": 6413,
    "mediaId": 2658,
    "date": "2022-01-24",
    "sentence": "Matt Dolan, a state senator and part owner of the Cleveland Guardians baseball team, has contributed $10.5 million to his campaign while investment banker <span class='selected-term'>Mike Gibbons</span> has loaned himself $11.4 million.",
    "author": "",
    "title": "Senators counting on Electoral Count Act"
  },
  {
    "id": 6383,
    "mediaId": 2658,
    "date": "2022-01-24",
    "sentence": "ROB PORTMAN have spent $10 million each: MATT DOLAN, a state senator and part owner of the Cleveland Guardians baseball team, and investment banker <span class='selected-term'>MIKE GIBBONS</span>.",
    "author": "",
    "title": "POLITICO Playbook: Biden confronts major troop decision"
  },
  {
    "id": 6435,
    "mediaId": 2550,
    "date": "2022-01-24",
    "sentence": "OH-Sen: Wealthy businessman <span class='selected-term'>Mike Gibbons</span>' newest spot for the May Republican primary features him blaming the Biden administration for inflation.",
    "author": "",
    "title": "Morning Digest: GOP establishment rallies behind challenger to indicted Nebraska congressman"
  },
  {
    "id": 6994,
    "mediaId": 2540,
    "date": "2022-01-28",
    "sentence": "One candidate, <span class='selected-term'>Mike Gibbons</span>, has already spent $10 million on an ad campaign that will run through the state's early May primary.",
    "author": "Chris Cillizza",
    "title": "More than $100 million in ads has *already* been spent on just 5 Senate races"
  },
  {
    "id": 6011,
    "mediaId": 2658,
    "date": "2022-02-04",
    "sentence": "“I know <span class='selected-term'>Mike Gibbons</span> will join me in demanding that Fauci is immediately fired and removed from office.”\nIn enlisting Paul to pad his anti-vaccine mandate credentials, Gibbons chose a top Fauci nemesis to make his point.",
    "author": "",
    "title": "Fauci might as well be running for office"
  },
  {
    "id": 6070,
    "mediaId": 2512,
    "date": "2022-02-04",
    "sentence": "I know <span class='selected-term'>Mike Gibbons</span> will join me in demanding that Fauci is immediately fired and removed from office.”\nOz’s ad, meanwhile, finds him saying, “The big government medical establishment came after me because I dared to challenge Fauci on COVID.”\nIt's past time Fauci faces the fact that he got COVID wrong.",
    "author": "Alex Henderson",
    "title": "Republicans once praised Anthony Fauci for saving lives -- and now he’s the boogieman of MAGA attack ads"
  },
  {
    "id": 6241,
    "mediaId": 2629,
    "date": "2022-02-04",
    "sentence": "I know <span class='selected-term'>Mike Gibbons</span> will join me in demanding that Fauci is immediately fired and removed from office.”\nOz’s ad, meanwhile, finds him saying, “The big government medical establishment came after me because I dared to challenge Fauci on COVID.”\n“Anthony Fauci has been a GOP target for nearly two years, as the party cast the president’s chief medical adviser as a villain for pandemic-era policies,” Murray explains.",
    "author": "Alex Henderson",
    "title": "Praised By Republican Presidents, Fauci Is Now Target Of GOP Attack Ads"
  },
  {
    "id": 5489,
    "mediaId": 2641,
    "date": "2022-02-04",
    "sentence": "Sen. Rand Paul, R-Ky., a vocal critic of Fauci, recently released an ad endorsing Ohio GOP Senate candidate <span class='selected-term'>Mike Gibbons</span> in a video noting his support for firing the nation's top expert on infectious disease.",
    "author": "Theodore Bunker",
    "title": "GOP Campaign Ads Vilify Fauci: 'Freedom Over Flip-Flops'"
  },
  {
    "id": 4918,
    "mediaId": 2540,
    "date": "2022-02-15",
    "sentence": "“I know <span class='selected-term'>Mike Gibbons</span> will join me in demanding that Fauci is immediately fired and removed from office.”\nGeorgia GOP Rep. Marjorie Taylor Greene and others have been pushing for Fauci to be fired for months.",
    "author": "Chris Cillizza",
    "title": "2021: The year scientists became a political football"
  },
  {
    "id": 4674,
    "mediaId": 2537,
    "date": "2022-02-24",
    "sentence": "",
    "author": "Mike Gibbons",
    "title": "Opinion: Financial crisis looming for working class as inflation hits record high"
  },
  {
    "id": 3634,
    "mediaId": 2668,
    "date": "2022-03-09",
    "sentence": "At CPAC a couple of weeks ago, I had the opportunity to interview Ohio US Senate Candidate <span class='selected-term'>Mike Gibbons</span>.",
    "author": "Scott Hounsell",
    "title": "CPAC Interview: Ohio Senate Candidate Mike Gibbons"
  },
  {
    "id": 3387,
    "mediaId": 2649,
    "date": "2022-03-14",
    "sentence": "Investment banker <span class='selected-term'>Mike Gibbons</span>, a Republican candidate for the U.S. Senate in Ohio, self-financed the most of any candidate in the 2022 cycle — $11.4 million.",
    "author": "Katherine Huggins",
    "title": "Candidates poured over $100 million of their own cash into campaigns in 2021"
  },
  {
    "id": 3509,
    "mediaId": 5119,
    "date": "2022-03-15",
    "sentence": "\"It would be pretty easy on a lot of these newer vehicles, considering most of the gas tanks are made out of plastic,\" said <span class='selected-term'>Mike Gibbons</span>, of Gibbon's Automotive in Media, Delaware County.",
    "author": "Dann Cuellar",
    "title": "Caught on video: Woman says thief drilled hole into car to steal gas"
  },
  {
    "id": 2838,
    "mediaId": 2658,
    "date": "2022-03-16",
    "sentence": "The letter\nOHIO’S GIBBONS USED OFFENSIVE STEREOTYPES — NYT’s Blake Hounshell and Leah Askarinam scoop that <span class='selected-term'>MIKE GIBBONS</span>, who is leading in the crowded Ohio GOP Senate primary, “employed offensive stereotypes about Asian people in a 2013 podcast, citing a widely discredited book, ‘The Bell Curve,’ that has drawn allegations of racism and sloppy research.”\n— What he said, per the story: “I’ve often thought that when I’ve run into Asians they’re all — you know, if you’ve ever read ‘The Bell Curve’ … And it said that the smartest people in the world as far as measurable I.Q.",
    "author": "",
    "title": "POLITICO Playbook: What Zelenskyy wants vs. what he'll get"
  },
  {
    "id": 2890,
    "mediaId": 2687,
    "date": "2022-03-16",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Ohio Republican Spoke Offensively About Asians"
  },
  {
    "id": 3629,
    "mediaId": 2742,
    "date": "2022-03-17",
    "sentence": "Earlier(2014) : Charles Murray on the 20th Anniversary of \"The Bell Curve\"\nFrom the New York Times news section:\n<span class='selected-term'>Mike Gibbons</span>, a leading contender to succeed Senator Rob Portman, made the comments in a 2013 podcast on doing business in China.",
    "author": "Steve Sailer",
    "title": "NYT: Shocking Revelation: A GOP Candidate Has Read THE BELL CURVE"
  },
  {
    "id": 3380,
    "mediaId": 2570,
    "date": "2022-03-18",
    "sentence": "“The Totally Dodgy Backstory of the Bank that Just Refinanced Trump Tower” (Rolling Stone)\n“Saudi-Backed Golf League Plans Tournament at Trump’s New Jersey Course” (Mother Jones)\n“Critics accuse CPAC of becoming pay-to-play as Trump loyalists gain power” (The Guardian)\n“Ohio Senate hopeful <span class='selected-term'>Mike Gibbons</span> is latest to score Trump meeting at Mar-a-Lago” (NBC News)\n“Democratic group complains Trump funding presidential campaign illegally” (Reuters)\nEditor’s Picks\n“U.S.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: NRA Campaign Filing Confirms Ransomware Attack"
  },
  {
    "id": 1880,
    "mediaId": 2526,
    "date": "2022-03-23",
    "sentence": "For example, on March 15, the New York Times quoted 2013 comments from <span class='selected-term'>Mike Gibbons</span>, an investment banker who is running for the GOP nomination in Ohio’s Senate race:\nGibbons, who earned a master’s degree from the Weatherhead School of Management at Case Western Reserve University, described being in a class with “mostly Asians” during graduate school.",
    "author": "Neil Munro",
    "title": "NBC: Joe Biden Will Import Favored Ukrainians"
  },
  {
    "id": 2084,
    "mediaId": 2572,
    "date": "2022-03-24",
    "sentence": "Continue reading …\nNYT BLASTED – Ohio GOP Senate candidate <span class='selected-term'>Mike Gibbons</span> lashed out at The New York Times saying the paper \"hates any conservative.\"",
    "author": "",
    "title": "Biden demands Dr. Oz, Herschel Walker resign; The spies among us -- one former spy speaks out"
  },
  {
    "id": 2343,
    "mediaId": 2748,
    "date": "2022-03-24",
    "sentence": "For example, on March 15, the New York Times quoted 2013 comments from <span class='selected-term'>Mike Gibbons</span>, an investment banker who is running for the GOP nomination in Ohio’s Senate race:\nGibbons, who earned a master’s degree from the Weatherhead School of Management at Case Western Reserve University, described being in a class with “mostly Asians” during graduate school.",
    "author": "Blarp Blog",
    "title": "NBC: Joe Biden Will Import Favored Ukrainians"
  },
  {
    "id": 2154,
    "mediaId": 2745,
    "date": "2022-03-24",
    "sentence": "Still the strongest and promoting free enterprise over socialism, hands down.”\nGibbons for Ohio, “Get to Work.” Republican investment banker <span class='selected-term'>Mike Gibbons</span> has run ad after self-funded ad with the same footage of him in a c-suite and making deals to distinguish himself as a non-politician.",
    "author": "",
    "title": "The Trailer: They're running for mayor of L.A. Protesters want them to shut up already."
  },
  {
    "id": 1948,
    "mediaId": 2584,
    "date": "2022-03-25",
    "sentence": "If the pandemic hadn’t happened, New Zealand’s tourism industry and its effects “would still be on a fast track to destruction”, says <span class='selected-term'>Mike Gibbons</span>, the village’s general manager.",
    "author": "Eva Corlett",
    "title": "Maori village nestled among hot springs reckoning with the return of foreign tourists"
  },
  {
    "id": 2273,
    "mediaId": 2640,
    "date": "2022-03-27",
    "sentence": "To demonstrate Kindland’s powerful bipartisan appeal, Gilsinan quotes Democratic Mayor Justin Bibb as a believer, as well as GOP Senate candidate <span class='selected-term'>Mike Gibbons</span>.",
    "author": "Mike L. Ford",
    "title": "Cleveland Is Trying to Gain a New Nickname"
  },
  {
    "id": 1928,
    "mediaId": 2636,
    "date": "2022-03-28",
    "sentence": "In Ohio, <span class='selected-term'>Mike Gibbons</span>, a businessman who is leading the Senate Republican primary in some polls, is fending off allegations that he once favored outsourcing jobs to China.",
    "author": "",
    "title": "Marco Rubio Leads G.O.P. Push for a More Combative Stance on China"
  },
  {
    "id": 1143,
    "mediaId": 2660,
    "date": "2022-04-04",
    "sentence": "At a recent debate, businessman <span class='selected-term'>Mike Gibbons</span>, a top contender, repeated a favored talking point.",
    "author": "Jon Greenberg",
    "title": "In Ohio, GOP candidate falsely says more votes than registered voters in 2020 election"
  },
  {
    "id": 1429,
    "mediaId": 2699,
    "date": "2022-04-05",
    "sentence": "And while Scott’s proposal to make all Americans pay some federal income tax—to have some, in his words, “skin in the game”—was denounced by many Republicans, at least one leading candidate, <span class='selected-term'>Mike Gibbons</span> of Ohio, had already taken up that same mantle.",
    "author": "Sam Brodey",
    "title": "GOP Candidates Can’t Stop Touching the Third Rail of Politics"
  },
  {
    "id": 1355,
    "mediaId": 2630,
    "date": "2022-04-06",
    "sentence": "Local chapters recently hosted events for Republican candidates such as <span class='selected-term'>Mike Gibbons</span> in Ohio’s Senate race and Garrett Soldano in Michigan’s governor’s contest to speak to its members.",
    "author": "",
    "title": "From schools to statehouses, conservative Moms for Liberty push to grow influence"
  },
  {
    "id": 1223,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "On Friday, The Washington Post reported that newly unearthed footage from a media event last fall shows <span class='selected-term'>Mike Gibbons</span>, a candidate for the Republican Senate nomination in Ohio, complained that the middle class does not pay enough in taxes.",
    "author": "Matthew Chapman",
    "title": "GOP banker spends $11 million on his campaign — and whines the middle class don’t pay enough taxes: report"
  },
  {
    "id": 1480,
    "mediaId": 2687,
    "date": "2022-04-08",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "GOP Candidate Said Middle Class Doesn’t Pay ‘Fair Share’"
  },
  {
    "id": 1640,
    "mediaId": 3997,
    "date": "2022-04-09",
    "sentence": "",
    "author": "",
    "title": "Back to CR"
  },
  {
    "id": 1301,
    "mediaId": 2695,
    "date": "2022-04-09",
    "sentence": "A spokesperson for Gibbons's campaign told TheBlaze that \"<span class='selected-term'>Mike Gibbons</span> does not support tax increases on any Americans – and never has.\"",
    "author": "Samuel Mangold-Lenett",
    "title": "Ohio Senate candidate Mike Gibbons says middle-class Americans don't pay 'any kind of fair share' of income taxes"
  },
  {
    "id": 434,
    "mediaId": 2627,
    "date": "2022-04-12",
    "sentence": "Senate hopeful <span class='selected-term'>Mike Gibbons</span> — by some measures, the frontrunner in Ohio’s GOP primary — pledged yesterday that he will not support new taxes if elected.",
    "author": "Steve Benen",
    "title": "Ohio Republican: Middle class doesn’t pay ‘fair share’ in taxes"
  },
  {
    "id": 106,
    "mediaId": 2550,
    "date": "2022-04-12",
    "sentence": "x\nOhio GOP Senate candidate <span class='selected-term'>Mike Gibbons</span> on a Crain’s Cleveland Business podcast:\n“The top 20% of earners in the U.S. pay 82% of federal income tax — and, you do the math, and 45% to 50% don’t pay any income tax… The middle class is not really paying any kind of a fair share.” pic.twitter.com/VUYzPTlqmX\n— Heartland Signal (@HeartlandSignal) April 8, 2022\nThis is a short blurb about Daily Kos.",
    "author": "",
    "title": "Ohio GOP Senate hopeful: Middle class isn't paying its fair share"
  },
  {
    "id": 619,
    "mediaId": 2731,
    "date": "2022-04-14",
    "sentence": "Maybe he'll decide to pass over JD Vance in the #OHSEN race for that knucklehead \"businessman\" <span class='selected-term'>Mike Gibbons</span>, who decided the big problem in America today is that the middle class is not paying enough in taxes.",
    "author": "Kurt Schlichter",
    "title": "If You Like Donald Trump Then You Want a Real Primary"
  },
  {
    "id": 335,
    "mediaId": 2658,
    "date": "2022-04-16",
    "sentence": "(One of its biggest donors over that time period was Ohio Senate candidate <span class='selected-term'>Mike Gibbons</span>, who missed out on Trump’s endorsement in that primary.)",
    "author": "",
    "title": "GOP megadonors go big in battle for Congress: 5 takeaways from new campaign money filings"
  }
]