{
  "id": 1008,
  "mediaId": 2641,
  "date": "2022-04-05",
  "headline": "Rep. Scott Perry to Newsmax: Biden Is Burning the Economy Down",
  "image": "https://www.newsmax.com/CMSPages/GetFile.aspx?guid=9abcf3ae-8dec-4269-b6e4-07afcd635784&SiteName=Newsmax",
  "link": "https://www.newsmax.com/politics/biden-energy-policy-oil-inflation/2022/04/05/id/1064477/",
  "mediaOutlet": "NewsMax",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Luca Cacciatore",
  "authorUrl": "",
  "termIds": [
    2140,
    2949,
    3223,
    3709,
    3975,
    715,
    4828,
    5239
  ],
  "sentences": [
    "Rep. Scott Perry, R-Pa., told Newsmax on Tuesday that President Biden is burning the economy down while “people are scrambling for their lives to try to afford the prices at the pump and across the supply chain spectrum.”\nDuring an appearance on “Stinchfield,” the Pennsylvania congressman compared Biden’s record on energy policy to a “pyromaniac that works at the fire company.”\n“The first thing he did on day one is set the fire by canceling the Keystone [XL] pipeline,” Perry said.",
    "“And now he’s running around telling you how to work on fire prevention, and oh - by the way – you get to pay for it.”\n“While he burns the economy down, people are scrambling for their lives to try to afford the prices at the pump and across the supply chain spectrum, he’s out there actually making things worse and trying to make you believe it started with [Russian President] Vladimir Putin,” he added.",
    "It's not for political disasters like the Biden presidency, and these rising fuel prices based on his policies.”\nNote: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV’s including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nSpecial Links:",
    "“From drilling in the ANWR [Arctic National Wildlife Refuge], drilling on federal lands, cancellation of the Keystone [XL] pipeline, cancellation of offshore drilling, no permits for natural gas.",
    "Perry then detailed several policies the Biden administration took before the Russian invasion of Ukraine that have led to a rise in the price of gas.",
    "“He literally said, ‘We’re going to prosecute ... natural resource company CEOs for what they’re doing to the world.’ That’s what Joe Biden said.",
    "The congressman also criticized the administration’s decision to tap into the strategic oil reserves to bring down the price of gas.",
    "That’s why all this is happening.”\n“Joe Biden is worshipping at the altar of the Green New Deal,” Perry concluded.",
    "“Let’s remember what the strategic petroleum reserve is for.",
    "It's for natural disasters or national security issues.",
    "All of these things,” the congressman listed.",
    "102, Cox cable, Suddenlink Ch.",
    "1115, Spectrum, U-verse Ch.",
    "349, Dish Network Ch.",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "277, AT&T TV Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}