{
  "id": 1800,
  "mediaId": 6669,
  "date": "2022-04-06",
  "headline": "House Democrats and Republicans concerned about new Iran Nuclear Deal",
  "image": "https://who13.com/wp-content/uploads/sites/19/2022/04/c925c23f51934ce3b46b88ce4820c951.jpg?w=1280",
  "link": "https://who13.com/news/washington-dc-bureau/house-democrats-and-republicans-concerned-about-new-iran-nuclear-deal/",
  "mediaOutlet": "whotv.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Basil John",
  "authorUrl": "https://www.wavy.com/?post_type=profile&p=954774",
  "termIds": [
    2140,
    4097,
    300,
    305,
    878,
    1124,
    1171,
    5041,
    5390
  ],
  "sentences": [
    "“It is critical that we do not cave to demands from Iran, the leading state sponsor of terror, and the dictatorial government,” Rep. Josh Gottheimer (D-N.J.)\nGottheimer says the U.S. must not accept Iran’s demands to remove their Islamic revolutionary guard from the list of terrorist organizations.",
    "WASHINGTON (NEXSTAR) — Republicans and Democrats in Congress are worried the Biden administration is about to make a bad deal over Iran’s nuclear program.",
    "“The problematic nature of having the Russians at the bargaining table with us is that they can commit atrocities and murder in Ukraine,” Tenney said.",
    "Rep. Claudia Tenney (R-N.Y.) rejects the idea that Russia should be allowed to buy Iran’s supply of enriched uranium.",
    "“It must come before the Congress, before the United States Senate for ratification, or it is invalid,” Perry said.",
    "“Are we seriously going to let a war criminal, Vladimir Putin, be the guarantor of this deal,” Gottheimer said.",
    "Republicans say if the deal goes through, they’ll take steps to reverse it, with a discharge petition.",
    "Lawmakers are also concerned about the role Russia is playing to finalize the deal.",
    "“If Iran has proven anything, it’s that they can’t be trusted,” Gottheimer said.",
    "wants the administration to be more transparent about what’s on the table.",
    "“If I’m doing a whip count, I see a lot of Democrats that are with us.",
    "And all we need is 218,” Rep. Michael McCaul (R-Texas) said.",
    "Rep. Scott Perry (R-Penn.)"
  ]
}