{
  "id": 1923,
  "mediaId": 2512,
  "date": "2022-03-30",
  "headline": "'Name names': House Freedom Caucus chair demands Cawthorn reveal who invited him to coke-fueled orgy parties",
  "image": "https://www.alternet.org/media-library/image.jpg?id=29533710&width=1200&coordinates=0%2C106%2C0%2C107&height=600",
  "link": "https://www.alternet.org/2022/03/cawthorn-2657064983/",
  "mediaOutlet": "Alternet",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Badash",
  "authorUrl": "https://www.alternet.org/author/david-badash",
  "termIds": [
    1448,
    2140,
    3267,
    3412,
    4384,
    409
  ],
  "sentences": [
    "Rep. Scott Perry (R-PA) (photo), who has been asked by the January 6 Committee to testify but has refused, told Politico’s Olivia Beavers, “I think it is important, if you’re going to say something like that, to name some names.”\nTuesday Beavers also reported that House Republican Minority Leader Kevin McCarthy had wanted to speak with Cawthorn about the allegations – not to start any type of investigation, but because some Republicans said they were “upset” Cawthorn made the claim.",
    "Madison Cawthorn speaking at the 2020 Student Action Summit, hosted by Turning Point USA at the Palm Beach County Convention Center in West Palm Beach, Florida, Gage Skidmore\nThe chairman of the ultra-conservative House Freedom Caucus is demanding U.S. Rep. Madison Cawthorn (R-NC) back up his incendiary charges that several members of Congress invited him to alleged orgies where they would do “key bumps” of cocaine.",
    "Last week Cawthorn told the “Warrior Poet Society” podcast that, Beavers writes, “he received invitations along the lines of “‘hey, we’re going to have kind of a sexual get-together at one of our homes, you should come’.”\n“What did you just ask me to come to?” Cawthorn said.",
    "“You should have to name names if you are going to go make those kinds of brush stroke accusations and impugn the character of people in this institution or … anybody else in this town,” an unnamed House Republican, told Beavers.",
    "Perry and McCarthy are not the only ones angered about Cawthorn’s charges.",
    "“And then you realize they are asking you to come to an orgy.”"
  ]
}