{
  "id": 2338,
  "mediaId": 2746,
  "date": "2022-03-30",
  "headline": "McCarthy rips Cawthorn for wild allegations about Washington orgies, says Cawthorn changed his story",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/24/Election_2022_North_Carolina_Cawthorn_59317.jpg-089f1_c0-263-4009-2601_s1200x700.jpg?f61e256f52e2c60197a21961c6bb1e3c609b9253",
  "link": "https://www.washingtontimes.com/news/2022/mar/30/mccarthy-rips-cawthorn-wild-allegations-about-wash/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kerry Picket",
  "authorUrl": "https://www.washingtontimes.com/staff/kerry-picket/",
  "termIds": [
    0
  ],
  "sentences": [
    "Mr. Cawthorn made the explosive remarks on the “Warrior Poet Society” podcast when asked if Washington was like the Netflix drama “House of Cards.”\n“I look at all these people, a lot of them that I’ve looked up to through my life, I’ve always paid attention to politics,” Mr. Cawthorn said on the podcast.",
    "House Minority Leader Kevin McCarthy on Wednesday condemned Rep. Madison Cawthorn for publicly suggesting that since he came to Washington he received invitations for orgies and witnessed cocaine use by prominent people on Capitol Hill.",
    "“There’s a lot of different things that could happen, but I just told him he‘s lost my trust, and he‘s gonna have to earn it back.”\nMr. McCarthy said he told the 26-year-old lawmaker that he had angered many of his colleagues.",
    "“Then all of the sudden you get invited to, ‘Well hey, we’re going to have kind of a sexual get-together at one of our homes, you should come.’”\n“I’m like, ‘What did you just ask me to come to?’” Mr. Cawthorn said.",
    "The minority leader said Mr. Cawthorn had other issues that he needed to straighten out, including an incident in which Mr. Cawthorn was cited for driving on a revoked license and skipping a court appearance.",
    "It’s just frustrating.”\nMr. McCarthy, California Republican, called the fellow Republican’s allegations “unacceptable.”\n“There’s no evidence behind the statements.",
    "Mr. Cawthorn, a member of the far-right House Freedom Caucus, also was pressed to back up his claims by House Freedom Caucus Chairman Scott Perry of Pennsylvania.",
    "Now, when he comes in and he tells me he thinks he saw maybe a staffer in a parking garage from 100 yards away,” Mr. McCarthy said.",
    "What’s more, Mr. McCarthy said the 26-year-old congressman changed his story when the two met behind closed doors on Wednesday.",
    "In a podcast, Mr. Cawthorn, North Carolina Republican, made the allegations of sex parties and drug use around Capitol Hill.",
    "It affects everybody else and the country as a whole,” Mr. McCarthy told reporters after meeting with Mr. Cawthorn.",
    "He said Mr. Cawthorn could suffer penalties from the House Republican Conference for making wild accusations.",
    "GOP lawmakers have called on Mr. Cawthorn to name names if he is going to make such allegations.",
    "“And then you realize they are asking you to come to an orgy.”",
    "That’s a problem,” said Mr. McCarthy, California Republican.",
    "You can’t make statements like that as a member of Congress.",
    "“And he tells me that he doesn’t know what cocaine is.",
    "“I was just very clear with him,” Mr. McCarthy said.",
    "And you can’t, back them up with any evidence.",
    "“He can’t just make statements out there.",
    "“He claims he watched people do cocaine."
  ]
}