{
  "id": 2647,
  "mediaId": 2514,
  "date": "2022-03-30",
  "headline": "Rep. Madison Cawthorn admits lying about cocaine and orgies after tongue-lashing from GOP leaders",
  "image": "https://www.nydailynews.com/resizer/bFdkChLKpJFfm4CG0gEWfyL5TVk=/1200x0/top/cloudfront-us-east-1.images.arcpublishing.com/tronc/ALFNIQXTJRHJHEREVBHWHFBCVQ.jpg",
  "link": "https://www.nydailynews.com/news/politics/us-elections-government/ny-rep-madison-cawthorn-cocaine-orgies-allegations-20220330-5oedlfij25bztijiuczrf3cwb4-story.html#ed=rss_www.nydailynews.com/arcio/rss/category/news/",
  "mediaOutlet": "AOL",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dave Goldiner",
  "authorUrl": "https://www.nydailynews.com/ny-dave-goldiner-staff.html#nt=byline",
  "termIds": [
    3267,
    4384,
    878
  ],
  "sentences": [
    "“Then all of a sudden, you get invited to ... kind of a sexual get-together at one of our homes.”\nCawthorn, 26, is the youngest member of Congress and is among the most outspoken supporters of former President Trump in Congress.",
    "Cawthorn’s remarks were particularly damaging because they clearly refer to conservative Republicans, not Democrats, whom some GOP lawmakers regularly deride as degenerates.",
    "He won election in 2020 in a red-leaning western North Carolina district previously held by Mark Meadows until he quit to become former President Trump’s chief of staff.",
    "Rep. Madison Cawthorn (R-N.C.) Wednesday walked back blockbuster drugs-and-sex claims about fellow lawmakers in a brutal tongue-lashing from GOP leaders.",
    "Cawthorn admitted to House Minority Leader Kevin McCarthy that he made up claims that he saw lawmakers doing cocaine and that they invited him to orgies.",
    "“And I laid out to everything that I find is unbecoming.”\nCawthorn is in hot water because he made the claims without naming names.",
    "“He did not tell the truth (and) that’s unacceptable”\n“He’s lost my trust is gonna have to earn it back,”McCarthy told reporters.",
    "“I look at all these people, a lot of them that I’ve looked up to through my life,” Cawthorn said in a podcast interview.",
    "He even suffered rare murmurs of discontent within the far right-wing Freedom Caucus, of which he is a stalwart member.",
    "The media could not be loaded, either because the server or network failed or because the format is not supported.",
    "That left fellow lawmakers facing questions from constituents about whether they could be the culprits.",
    "“He changes what he tells and that’s not becoming of a congressman,” McCarthy said.",
    "This is a modal window."
  ]
}