{
  "id": 280,
  "mediaId": 2548,
  "date": "2022-04-21",
  "headline": "EXCLUSIVE: House Republicans Call On Biden Admin To End Rule Causing Higher Gas, Corn Prices",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/04/gas-prices-scaled-e1650571327930.jpg",
  "link": "https://dailycaller.com/2022/04/21/exclusive-house-republicans-call-biden-admin-end-rule-higher-gas-corn-prices/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2201,
    2818,
    3141,
    3213,
    3975,
    872,
    878,
    1149
  ],
  "sentences": [
    "“Yearly grocery prices increased an unprecedented 10 percent in March 2022 and RFS biofuel blending mandates — which are met primarily with corn ethanol — are clearly contributing to the problem,” they wrote Thursday in a letter to EPA Administrator Michael Regan, obtained exclusively by the Daily Caller.",
    "The Environmental Protection Agency’s (EPA) Renewable Fuel Standard requires that oil refiners blend renewable fuels — usually corn ethanol — into gasoline, with the stated goal of reducing the amount of petroleum used in the nation’s energy supply.",
    "(RELATED: ‘Consumers Lose’: Biden’s Ethanol Gambit Will Send Food Prices Soaring, Critics Say)\nThe letter also cites an article from the Wall Street Journal claiming that the ethanol increase will raise gas prices by 30 cents per gallon.",
    "Republicans in the House of Representatives, led by Texas Rep. Chip Roy, are calling on the Biden administration to waive an environmental regulation that they argue drives up the prices of corn and gasoline.",
    "The Biden administration has claimed that the move will save drivers 10 cents per gallon, but only 2,300 of the nation’s 150,000 gas stations currently sell gasoline with 15% ethanol.",
    "The price of corn opened at $8.14 per bushel on Thursday, up from $6.26 year-over-year, and up 38 cents since President Joe Biden’s announcement of the new ethanol waiver.",
    "The Trump administration previously attempted to set a full-year 15% ethanol requirement, but the DC Circuit Court of Appeals struck down the regulation in July 2021.",
    "This is the worst possible time to pander to the anti-energy lobby (and crony industrial farms),” a spokesperson for Roy told the Daily Caller.",
    "“Waiving these mandates is a no-brainer right now, but this administration is once again showing its outright disdain for working Americans.”",
    "Read the letter here:\nPennsylvania Rep. Scott Perry, Florida Rep. Bill Posey, and Texas Rep. Randy Weber also signed the letter.",
    "The White House announced on April 12 that the EPA would raise the ethanol blend limit at 15% throughout the summer months.",
    "Energy experts predict that the move will increase food prices by reducing the supply of corn available for consumption.",
    "Economists have cited general inflation, supply chain issues and the Russian invasion of Ukraine for the rise in prices.",
    "The ethanol mandate is a crony program with a well-documented history of increasing costs at the pump and grocery store.",
    "The agency had previously set the summer limit at 10% for more than a decade, citing impacts on air pollution.",
    "“People all over this country are struggling to fill their tanks and their kids’ plates right now.",
    "The Republicans urge the Biden administration to eliminate the blending requirements entirely.",
    "Gas prices reached $4.12 per gallon nationwide on Thursday, according to AAA."
  ]
}