{
  "id": 2953,
  "mediaId": 2644,
  "date": "2022-03-17",
  "headline": "Knicks rout of Trail Blazers feels like a pointless exercise",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/knicksbarrett.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/17/knicks-rout-of-trail-blazers-feels-like-a-pointless-exercise/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Berman",
  "authorUrl": "",
  "termIds": [
    1357,
    2140,
    2487,
    2634,
    3714,
    4124,
    709,
    834,
    5258
  ],
  "sentences": [
    "They faced a group of relatively anonymous athletes dressed in white and red Blazers’ jerseys — faced a starting unit that featured Drew Eubanks (no relation to legendary game-show host Bob), Trendon Watford and Brandon Williams, who played for the Westchester Knicks this season.",
    "The Knicks were easy winners, took an early 11-point point lead after Julius Randle rammed home a driving dunk on the immortal Eubanks in the first quarter and wound up winning in a 128-98 rout.",
    "But every chance I get I’m trying to win basketball games.’’\nBillups , who played for the Knicks in 2010-11, actually interned with the club a few years ago for his old friend Scott Perry.",
    "Rookie shooting guard Quentin Grimes, their first-round pick last July, is likely returning from a dislocated knee Friday versus Washington and should play significant minutes.",
    "But Barrett, God bless him, said it was still a “personal’’ win, beating a Blazers squad that rallied in Portland last month to post a fourth-quarter comeback victory.",
    "Despite having a worse record than the Knicks at 26-41, Portland stood just one game out of the play-in tournament while the Knicks were a distant five games out.",
    "When I had a really strong desire to get in the front office, he was nice enough to let me come in and be a fly on the wall and watch him for three or four days.",
    "The Blazers dispatched veteran guards CJ McCollum and Norm Powell at the trade deadline in order to restructure last season’s playoff club that went nowhere.",
    "The Knicks were 12 ½-point favorites over the beat-up Blazers, though Portland was in a legitimate postseason race whether it wanted to be or not.",
    "Thibodeau has committed to active rookie center Jericho Sims since the All-Star break and he was a plus-21 in 24 minutes Wednesday.",
    "However, Thibodeau also hurts his case when he pulls Toppin with 5:50 left to bring in Randle in a blowout — as he did Wednesday.",
    "Even Chauncey Billups, the rookie Blazers head coach and former Knicks point guard, admitted the play-in event is not his No.",
    "Wednesday, Barclays Center hosted the bigger game in town — Mavericks at Nets, decided by a Spencer Dinwiddie buzzer-beater.",
    "But that day, the Blazers had their young stud, Anfernee Simons, gritty center Jusuf Nurkic and veteran guard Eric Bledsoe.",
    "Back in Manhattan, the Knicks routed an injury-riddled Blazers squad in what felt like a meaningless, melancholy exercise.",
    "The season was put on life support with that collapse in Memphis on Friday and the late loss Sunday in Brooklyn.",
    "The Knicks returned to the Garden for the first time in 2 ¹/2 weeks, played their first game at home in March.",
    "He has rookie combo guard Miles McBride as a permanent fixture in the rotation since the recent road trip.",
    "In fact, the Knicks and Blazers are in similar positions with their season finales less than a month away.",
    "This matchup was more March Sadness than March Madness — two teams essentially playing for next season.",
    "RJ Barrett’s late alley-oop lob to Obi Toppin for an acrobatic jam could be a fixture for 2022-23.",
    "“I’m trying to do both,’’ Billups said before tipoff when asked about development versus winning.",
    "The brainy Billups was eyeing a front-office career but the Knicks never brought Billups aboard.",
    "“Who knows where this ends up?’’\nFor the first time this season, a Knicks victory felt hollow.",
    "He’s stated often the past two weeks that no one plays more young guys than he has.",
    "Portland is trying to relaunch around injured superstar point guard Damian Lillard.",
    "Then we won the championship in Detroit when he was in the front office there.",
    "I was grateful for that.’’\nBillups knows there is the fine line of mid-March.",
    "Thibodeau gets agitated when accused of not playing the youngsters enough.",
    "“We have a long history from back when he recruited me in high school.",
    "Obviously we have a lot of guys to develop and still try to win games.",
    "“It feels good to be back at home and just get a win,’’ Barrett said.",
    "Anyone who’s playing in the NBA is good and deserves respect.’’",
    "Of course, he notes RJ Barrett being 21 — which isn’t fair.",
    "“We’re going to keep scratching,’’ Tom Thibodeau said.",
    "“It doesn’t matter who they have on the court.",
    "“I’m trying to win every time I’m out there.",
    "“I did that with Scott,’’ Billups said.",
    "A lot of teaching has to happen.",
    "1 priority."
  ]
}