{
  "id": 2999,
  "mediaId": 2748,
  "date": "2022-03-11",
  "headline": "House Conservatives Challenge Joe Biden to Declare MS-13 Gang a ‘Foreign Terrorist Organization’",
  "image": "https://www.cracknewz.com/favicon.ico",
  "link": "https://www.cracknewz.com/2022/03/house-conservatives-challenge-joe-biden.html",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Blarp Blog",
  "authorUrl": "",
  "termIds": [
    1926,
    2817,
    2869,
    3712,
    3975,
    4197,
    4693,
    5157
  ],
  "sentences": [
    "“Even though the total number of people illegally entering the U.S. has increased, [Customs and Border Protection] has only apprehended 71 MS-13 trying to enter the U.S. this year, which represents a 75 percent decrease from previous years’ average,” Grassley wrote:\nThe obvious logical conclusion is that MS-13 members are successfully avoiding identification and sneaking past Border Patrol into the country, as agents focus their time and attention on dealing with unaccompanied children at the border or asylum seekers.",
    "“The Biden administration’s anti-American immigration policies have failed to prioritize the safety and security of the American people, favored illegal aliens, and created an out-of-control border crisis,” Good said in a statement:\nThis President’s open border policies have allowed MS-13 to infiltrate cities around the United States infecting American communities with violence and drugs.",
    "Rep. Bob Good (R-VA), along with a group of House Republicans, has introduced a plan to declare El Salvador’s MS-13 Gang a “foreign terrorist organization.”\nThe legislation, titled the Every Town a Border Town Act, would classify the violent MS-13 Gang as a terrorist organization in addition to its classification as a transnational criminal organization by the federal government.",
    "[Emphasis added]\nReps. Ted Budd (R-NC), Paul Gosar (R-AZ), Scott Perry (R-PA), Mary Miller (R-IL), Louie Gohmert (R-TX), Matt Gaetz (R-FL), Madison Cawthorn (R-NC), Brian Babin (R-TX), Randy Weber (R-TX), Jeff Duncan (R-SC), Rodney Davis (R-IL), Lauren Boebert (R-CO), Andrew Garbarino (R-NY), Dan Bishop (R-NC), and Ralph Norman (R-SC) are co-sponsoring the legislation.",
    "Last year, Sen. Chuck Grassley (R-IA) noted in a letter to Biden that even as illegal immigration at the United States-Mexico border has hit record highs, the number of MS-13 Gang members apprehended has plummeted — suggesting that members are successfully sneaking into the U.S. interior.",
    "Though they often arrive as illegal aliens, some MS-13 Gang members pose as Unaccompanied Alien Children (UACs) through a federally-facilitated program that resettles hundreds of thousands of UACs across American communities every year.",
    "[Emphasis added]\nWe must enhance the safety of the American people by providing federal law enforcement with all the tools they need to stop these criminal gangs from terrorizing us and effectively making every town a border town.",
    "In fact, one Border Patrol chief in Texas said exactly as much, stating that MS-13 members are using the high number of migrants entering the US to blend in and sneak past agents.",
    "[Emphasis added]\nIn one recent case, illegal alien MS-13 Gang members were convicted of stabbing a teenage boy to death in Massachusetts before leaving his body in a park.",
    "Good said the classification for MS-13 would ensure that the government has a broader scope by which they can prosecute gang members for economic and violent crimes.",
    "Two of the members had been previously encountered by federal immigration officials but were released into the U.S. interior."
  ]
}