{
  "id": 3110,
  "mediaId": 2746,
  "date": "2022-03-10",
  "headline": "Steps the U.S. must take to stop murderous dictator Putin",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/10/B1perryLGdictators_c0-378-1600-1311_s1200x700.jpg?cdc895e2123ce6cdc63e77c20683fcef0685bddd",
  "link": "https://www.washingtontimes.com/news/2022/mar/10/steps-the-us-must-take-to-stop-murderous-dictator-/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rep. Scott Perry",
  "authorUrl": "",
  "termIds": [
    2140,
    3709,
    506,
    5041,
    5240,
    5287,
    5366,
    5371
  ],
  "sentences": [
    "While we have no quarrel with the Russian people, Russian President Vladimir Putin must be dealt with immediately, with whatever terms necessary to end the carnage; otherwise, bellicose leaders in states with nuclear weapons will do as they please, with personal and professional impunity.",
    "As they unfold on TV in real-time, war crimes and crimes against humanity are irrelevant in a practical sense; there’ll be no end to them — or justice — since the International Criminal Court has no jurisdiction in a sovereign country that refuses to prosecute its leader.",
    "Prosecuting Mr. Putin for war crimes and crimes against humanity is wholly appropriate, but we could agree not to pursue those — as an off-ramp from what’s leading to increased tensions and a wider conflict that inevitably will lead to his accountability.",
    "• Finally, to prove our steadfast intentions and the ubiquitous reach of the American financial system, Mr. Putin’s personal wealth must be made unavailable to him until he ceases his expansionist agenda — in Ukraine and elsewhere.",
    "Frail responses tell the world that we’re committed to freedom and civility only if it means being nonconfrontational; however, the message we’re sending to China, Iran and other rogue nations is more damaging.",
    "Apparently, all a tyrant needs to do is threaten to employ nuclear weapons, and the world folds like a cheap suit — albeit complaining bitterly with self-righteous indignation.",
    "• Our nation has yet to strip Russia of what’s called “Permanent Normalized Trade Relations” status, which allows it to receive numerous trade benefits, including low tariffs.",
    "He also figured he could threaten the use of his nuclear weapons so that we’d allow him to move ahead with his agenda while we stood on the sidelines cowering in fear.",
    "We must show Mr. Putin — and other rogue leaders — that we’re unyielding in stopping murderous dictators who invade sovereign nations and slaughter innocent civilians.",
    "I introduced the “Russian Trade and Investment Ban Act,” which severely limits its export/import opportunities until hostilities cease in Ukraine and elsewhere.",
    "We must lead the world by codifying that we will not recognize Mr. Putin’s expansionist land-grabs in Ukraine and Georgia and demand its immediate withdrawal.",
    "As Mr. Putin increases the severity and brutality of his attacks, we’ve taken largely symbolic half-measures designed to show that we’re doing something.",
    "The following measures must be implemented immediately:\n• A full, isolating response must immediately remove Russia from the U.N. Security Council.",
    "OPINION:\nAmericans watch in horror as Russia’s dictator wages an unprovoked, illegal and bloody war on Ukraine, and our worst fears become reality.",
    "Mr. Putin equates aggressively reconstituting a pan-Russian empire with strength and popularity, which explains his actions in Ukraine.",
    "If the United States wants to send a strong message — not only to Mr. Putin but to the world’s tyrants — decisive action must be taken.",
    "Then the 2008 war in Georgia, followed by his aggression in Ukraine and his illegal occupation of Crimea for more than seven years.",
    "This is the current result of Mr. Putin’s war, unsparing in its attacks on civilians and inspiring terror around the globe.",
    "It’s ludicrous that after it invaded Ukraine, Russia led an emergency Security Council meeting — over its own invasion!",
    "Furthermore, the U.S. must discontinue all diplomatic ties and designate Russia a state sponsor of terrorism.",
    "• America failed to take Mr. Putin’s 2014 invasion of Ukraine seriously — giving blankets instead of weapons.",
    "He figured the war would be popular with Russian citizens, and Ukrainians would greet him as a liberator.",
    "Mr. Putin is all-in with his war of aggression; a half-hearted response from the West is not an option.",
    "We must boldly, firmly and decisively respond, so Mr. Putin realizes the gains are not worth the risk.",
    "• Russia must be prohibited from participation in any U.N.-affiliated organizations or U.N. grants.",
    "• We must lead in demanding Russia’s immediate expulsion from the World Trade Organization.",
    "• Scott Perry is the U.S. representative for Pennsylvania’s 10th congressional district.",
    "He was elected in 2000 because of the brutal war in Chechnya he led as prime minister.",
    "He counted on harsh language, followed by rebukes and measures he could easily manage.",
    "Mr. Putin’s presidency is inextricably linked to his identity as a wartime leader.",
    "It must be forced to realize that its expansionism will not be tolerated.",
    "But harsh words and sanctions haven’t changed Putin’s course of action.",
    "Why should China think we’re serious about an independent Taiwan?",
    "Mr. Putin was correct in his estimation of the West’s response.",
    "How has our weakness emboldened Iran’s threatening agenda?",
    "Are we going to stop their malevolent expansionism?",
    "I’m leading that fight in Congress on both fronts.",
    "The United States has a moral imperative to lead.",
    "China has nuclear weapons.",
    "Wrong on both accounts.",
    "We must not cower.",
    "How about Iran?",
    "North Korea?",
    "Doubtful."
  ]
}