{
  "id": 3561,
  "mediaId": 2548,
  "date": "2022-03-10",
  "headline": "EXCLUSIVE: House Republicans Introduce Legislation To Designate MS-13 As A Foreign Terrorist Organization",
  "image": "https://cdn01.dailycaller.com/wp-content/uploads/2022/03/Photo-by-Yuri-CORTEZ-AFP-Photo-by-YURI-CORTEZAFP-via-Getty-Images-21212-e1646926100827.jpg",
  "link": "https://dailycaller.com/2022/03/10/house-republicans-bob-good-legislation-ms-13-foreign-terrorist-organization/",
  "mediaOutlet": "Daily Caller",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Henry Rodgers",
  "authorUrl": "https://dailycaller.com/author/Henry+Rodgers",
  "termIds": [
    0
  ],
  "sentences": [
    "(RELATED: Florida Democrats Rail Against Biden’s Plan For Colombia Terrorist Organization)\nThe bill has 15 cosponsors: North Carolina Rep. Ted Budd, Arizona Rep. Paul Gosar, Pennsylvania Rep. Scott Perry, Illinois Rep. Mary Miller, Texas Rep. Louie Gohmert, Florida Rep. Matt Gaetz, North Carolina Rep. Madison Cawthorn, Texas Rep. Brian Babin, Texas Rep. Randy Weber, South Carolina Rep. Jeff Duncan, Illinois Rep. Rodney Davis, Colorado Rep. Lauren Boebert, New York Rep. Andrew Garbarino, North Carolina Rep. Dan Bishop and South Carolina Rep. Ralph Norman.",
    "READ THE LEGISLATION HERE:\n“We must enhance the safety of the American people by providing federal law enforcement with all the tools they need to stop these criminal gangs from terrorizing us and effectively making every town a border town,” Good added.",
    "Here’s What We Saw)\n“The Biden Administration’s anti-American immigration policies have failed to prioritize the safety and security of the American people, favored illegal aliens, and created an out-of-control border crisis.",
    "Designating MS-13 as an FTO would put sanctions on members and their families, put in place travel restrictions to remove them from the U.S. and increase penalties for U.S. citizens who help them financially.",
    "This President’s open border policies have allowed MS-13 to infiltrate cities around the United States infecting American communities with violence and drugs,” Good told the Daily Caller.",
    "This legislation would designate the gang as an FTO, which would give the federal government a broader range of options to prosecute not just financial crimes but also physical violence.",
    "Good and his cosponsors believe MS-13 poses a threat to the safety and security of U.S. citizens and the national security of the country and should be designated as an FTO.",
    "Republican Virginia Rep. Bob Good introduced legislation Wednesday that would categorize MS-13 as a Foreign Terrorist Organization (FTO).",
    "The legislation comes after an MS-13 gang member was found guilty in February of killing a teenager in 2017 in Lynchburg, Virginia.",
    "Currently, MS-13 is designated as a Transnational Criminal Organization (TCO), which focuses on its illegal business ventures.",
    "Border officials arrested nearly 9,80o criminal migrants in fiscal 2021, over 100 of which were MS-13 members.",
    "The Daily Caller first obtained the legislation, which is titled the Every Town a Border Town Act.",
    "MS-13 has around 10,000 members in the U.S., and thousands more across the world.",
    "(RELATED: We Went On A Covert Hunt For MS-13 In America."
  ]
}