{
  "id": 3678,
  "mediaId": 2664,
  "date": "2022-03-02",
  "headline": "John Eastman invoked 5th Amendment to questions of whether he publicly lied about Trump",
  "image": "https://www.rawstory.com/media-library/win-or-lose-trump-is-about-to-unleash-hell.jpg?id=27778022&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.rawstory.com/john-eastman-2656830164/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    2201,
    2851,
    2923,
    3151,
    3600,
    3995,
    4747
  ],
  "sentences": [
    "\"Dr. Eastman, in an interview with Larry Lessig and Matt Seligman on the 'Another Way' podcast, September 27th, 2021, you were asked about the memoranda that you wrote regarding the role of the Vice President in counting the electoral college votes on January 6th, and you said, 'Although I did have a client in this, the client, the President, the former President of the United States, has authorized me to talk about these things.",
    "\"You said later in the interview that, 'I would normally not talk about a private conversation I had with a client, but I have express authorization from my client, the President of the United States, at that time to describe what occurred, to truthfully describe what occurred in that conversation.'",
    "He continued to invoke the Fifth Amendment, including to questions about meeting with Corey Lewandowski, Arizona House Speaker Rusty Bowers, DOJ official Jeffrey Clark, Rep. Scott Perry (R-PA), Sen. Josh Hawley (R-MO), Sen. Ted Cruz (R-TX) and \"any other members of Congress.\"",
    "The House Select Committee to Investigate the Jan. 6 Attack on the U.S. Capitol on Wednesday released a 221-page legal filing that includes a transcript of \"coup memo\" author John Eastman's interview with investigators.",
    "As part of the filing, the committee included testimony from Eastman in which he was asked about his appearances purportedly representing Trump on right-wing media.",
    "\"So is it your position that you can discuss those memoranda in public settings, but will not discuss those memoranda with the committee pursuant to a subpoena?\"",
    "The filing claimed that the committee had basis to believe that Donald Trump broke multiple laws in his efforts to overturn the 2020 presidential election.",
    "\"On the advice of counsel, I hereby assert my Fifth Amendment right against being compelled to be a witness against myself,\" Eastman responded.",
    "But the investigator wanted to pursue that line of questioning, noting comments Eastman made on the \"Peter Boyle Show\" on May 5.",
    "Did President Trump authorize you to discuss publicly your January 4th, 2021, conversation with him?\"",
    "Did President Trump authorize you to talk publicly about the memoranda that you wrote?\"",
    "I want to make that clear upfront.'",
    "\"Fifth,\" Eastman replied.",
    "the investigator asked.",
    "the investigator asked.",
    "an investigator asked.",
    "\"Fifth,\" he replied.",
    "once again."
  ]
}