{
  "id": 4183,
  "mediaId": 2639,
  "date": "2022-02-26",
  "headline": "With season spiraling downward, how will Knicks respond?",
  "image": "https://cdn.newsday.com/ace/c:MDk3M2U3OTEtNmVhMS00:NDZkMjll/preview/1280",
  "link": "https://www.newsday.com/sports/columnists/steve-popper/knicks-tom-thibodeau-s86016",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Popper",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Stories sifted through the NBA and were reported by SNY that executive vice president William Wesley — who joined the organization to serve as right-hand man to team president Leon Rose, a role he had for years when Rose was one of the league’s most prominent agents — was in the ear of Madison Square Garden chairman James Dolan, blaming Thibodeau for the team’s failures.",
    "That was the expectation when the Knicks handed the reins of the franchise to the inexperienced Rose, who had spent his career as a prominent and well-respected agent, and Wesley, whose background was far more curious — hard to describe other than a player whisperer who would guide them through AAU programs and into colleges of choice.",
    "The whispers already were being heard that Thibodeau was getting blamed behind closed doors for his handling of newcomers Kemba Walker and Evan Fournier and his reluctance to utilize Cam Reddish after he arrived in a trade about a month before the Feb. 10 deadline.",
    "With the Knicks’ playoff chances dimming and the injuries mounting, Thibodeau made rookie Jericho Sims the first (and only) center off the bench Friday in the first game after the All-Star break and also gave a few minutes to Miles McBride at point guard.",
    "Unfortunately, the third rookie on the roster, Quentin Grimes, who has been a regular rotation player, suffered a subluxation of his right patella in the game, and a diagnosis of just how severe the injury is remains uncertain.",
    "Tom Thibodeau came home to New York, not far from his childhood home and the place where he spent the formative years of his coaching career as an assistant during the last run of steady success for the franchise.",
    "With 22 games left, injuries mounting and the standings and schedule conspiring to make a playoff appearance unlikely, the reality has begun to set in for the Knicks that this season won’t be a success.",
    "He took the head-coaching job and last season, in his first year at the helm, he won his second NBA Coach of the Year Award after the Knicks (41-31) earned the fourth seed in the Eastern Conference.",
    "The Jazz guard signed a four-year, $163 million extension (which could have been $33 million more lucrative if he played in a bigger market and gotten an All-NBA berth he probably deserved).",
    "According to the same person who pointed to Wesley’s criticism of Thibodeau, Wesley has been selling his plan, one that eventually will land Utah’s Donovan Mitchell, a New York native.",
    "High praise\nSpeaking of, well, speaking, it’s easy to hear praise for the ascension of RJ Barrett among the Knicks, but it might mean more to hear it from outside the organization.",
    "But the Knicks are 25-35 and in 12th place in the Eastern Conference now, and as they have stumbled through this season and the revamped roster failed, the troubles have returned.",
    "Mitchell is due to make $30.4 million next season and won’t be a free agent until at best the summer of 2025, if he declines his player option for the following season.",
    "But there have been leaks, and one person with knowledge of the discussions said Wesley’s words in Dolan’s ear are not just that Thibodeau has spoiled this roster.",
    "Rose served as a former agent for Mitchell and the front office also inserted Johnnie Bryant as associate head coach after Bryant served as an assistant in Utah.",
    "However, the assumption that the finger-pointing has occurred only since the inactivity at the trade deadline is inaccurate, according to one league source.",
    "It’s hard to confirm rumors when the principal figures won’t speak, but it’s also telling that the silent front office hasn’t stepped forward to deny them.",
    "But this is not schmoozing a high school player and steering him to a college of choice, and it’s not so simple even if the relationships are in place.",
    "You can try to construct a package, but it’s hard to imagine one that works without stripping the Knicks of every promising asset they hold right now.",
    "Thibodeau hasn’t changed from the man who earned Coach of the Year honors last season, but the roster has, and the options for the coach have.",
    "For a franchise that has been marked by dysfunction and instability for more than two decades, do the Knicks resort to more of the same?",
    "Sign up for our daily sports newsletter\nGet stories, photos and videos about your favorite New York teams in your inbox every morning.",
    "It’s not surprising that this would surface at the trade deadline, when with the season slipping away, the Knicks didn’t make a move.",
    "So trading for him means matching contracts and talent, and it’s not so easy to find any sort of package that would satisfy the Jazz.",
    "Wesley has conducted zero interviews since arriving in New York — one fewer than Rose has since Thibodeau’s introduction.",
    "He’s definitely going to be playing in this league for a long time and he’s going to be the face of the Knicks.\"",
    "Wesley, according to the source, also has been selling his plan to eventually get a star to come to the Knicks.",
    "Thibodeau did respond to the stories this past week, dismissing them as he said, \"I talk to Wes all the time.",
    "Until then, Thibodeau remains the only voice publicly speaking and doing the same things he’s always done.",
    "And when he put up 46 points Friday night against Miami, he caught the eye of a couple of Heat All-Stars.",
    "That’s one of the things — Quentin’s earned his way and that’s the way it should be.\"",
    "If Wesley and Rose can make that work, maybe they can speak openly and take credit.",
    "The Knicks said Saturday that Grimes will be re-evaluated in two weeks.",
    "But the real issue is just how the team will respond to the failures.",
    "You could see it in the body language, you could see it in his face.",
    "\"No, I mean I talk to Leon, Scott [Perry], Wes, every day,\" he said.",
    "He’s not even thinking about what shots to take, when to take them.",
    "Thibodeau was asked if this was a recommendation from management.",
    "I’ve been here before, so I don’t worry about any of that stuff.\"",
    "\"I don’t think anybody is surprised or should be surprised.",
    "You could see he wants to take his team to another level.",
    "\"We all know he’s capable of that,\" Jimmy Butler said.",
    "By clicking Sign up, you agree to our privacy policy.",
    "Guys get the opportunity, go in there and play well.",
    "You can’t go out there and the team performs poorly.",
    "He’s just going out there and playing basketball.\"",
    "We’re looking at the development of those guys.",
    "I don’t respond to rumors or any of that stuff.",
    "They have to play well when they’re in there.",
    "\"Obviously, you can’t play 12 guys in a game.",
    "You could see it in his body language.",
    "Bam Adebayo added, \"His confidence.",
    "\"We talk about all our players.",
    "So we’ll see how that unfolds.",
    "He wants to be that guy.",
    "That’s important to us.",
    "I know the drill here.",
    "He’s playing free.",
    "Youth movement?"
  ]
}