{
  "id": 4469,
  "mediaId": 2644,
  "date": "2022-03-05",
  "headline": "Leon Rose is turning his back on fans by hiding from Knicks’ failures",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/03/03022020_KnicksRockets_001cs-1.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/03/05/leon-rose-turning-back-on-knicks-fans-with-prolonged-silence/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ian O'Connor",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "He became the president of a public trust in the country’s biggest media market, a role that requires accountability to the millions of people who pay to watch and support the product he puts on the floor — a product that constantly malfunctions while Rose runs and hides from the responsibility he signed up for.",
    "Friday night, via Julius Randle’s ejection and a shocking and heartbreaking collapse against a Suns team playing without Chris Paul and Devin Booker, the Knicks proved they have a special talent for finding ways to fail.",
    "The Post asked for an interview with Rose recently to discuss the state of the team and his approach to media relations, and a Knicks spokesperson said the team president respectfully declined the request.",
    "The fans deserve answers to these questions, and yet Rose effectively forces Thibodeau to explain everything that has gone wrong, sometimes twice a day, rather than provide him some cover and support.",
    "Eli Manning, two-time champ, talked to the press on the day after defeats (to shoulder his share of the blame), but not on the day after victories (to ensure his teammates received credit).",
    "Those who treat the fans as partners in the experience, and who show respect to the professionals covering them in the process, usually get the benefit of the doubt when they need it.",
    "“When you don’t speak publicly,” said one former Knicks official, “you give the franchise no direction.”\nSo people ask: Is Leon Rose or William “World Wide” Wesley running the club?",
    "Derek Jeter, five-time champ, made almost daily appearances at his locker — even when storm clouds hovered — because he accepted a captain’s terms of engagement in the market.",
    "They have lost 17 of their past 20 games to fall to 25-38, 5 ¹/2 games out of the last play-in spot, and the man charged with building a winning roster is nowhere to be found.",
    "Randle caught a lot of heat for temporarily boycotting the media while he struggled to cope with the booing from the same crowd that showered him with love last spring.",
    "Rose has fielded questions from reporters once in 19-plus months — once — and yet this isn’t a story about the credentialed men and women assigned to cover the Knicks.",
    "Cashman has won four championships and 24 postseason series as GM, and he hasn’t forgotten the necessity of communicating with the fans through the news media.",
    "In the 2020-21 season, when the Knicks shocked everyone, Rose was widely perceived as a shrewd man of mystery, outfoxing his counterparts in the shadows.",
    "The team president told a small group of writers that he always remained behind the scenes as an agent, and planned to do the same in his new career.",
    "Once again, with feeling, Brian Cashman has survived a quarter century as the Yankees’ general manager while remaining accessible to his customers.",
    "Does Rose regret signing Kemba Walker — a smallish, aging, and injured guard who was never head coach Tom Thibodeau’s kind of quarterback?",
    "Rose has shown no respect for you, the fans, by refusing to speak to the people paid to ask questions about the team on your behalf.",
    "Julius Randle’s ejection dooms Knicks to gut-wrenching, buzzer-beater loss to Suns\nA lot of NBA people say Leon Rose is a good guy.",
    "But why should Randle repeatedly face the cameras and microphones while the team’s chief executive is cowering under his desk?",
    "The Knicks are falling apart, as they did in the pre-Thibs days, and Rose is showing no leadership and no accountability.",
    "Is he disappointed that Evan Fournier looks like an $18 million player one night and a $500,000 player the next?",
    "Fair or not, you can get away with silence when your team consistently scores more points than the opponent.",
    "The NBA commissioner has embarrassed himself by allowing Rose’s act to go uncontested in his home market.",
    "Chances are, whenever he talks again, he will surely swear that he cares deeply about Knicks fans.",
    "But that all changed the day Rose accepted Knicks owner Jim Dolan’s offer to run the franchise.",
    "Why did he trade a first-round pick for a wing, Cam Reddish, who didn’t fit his coach’s needs?",
    "Why is Thibodeau cast as a human piñata while the decision makers give themselves a free pass?",
    "Oh, and one more question: Where the hell is Adam Silver, native New Yorker, in all of this?",
    "Rose hasn’t talked publicly since September, when he finally ended 14 months of nothingness.",
    "He believed his clients were best served by a back-room approach, and nobody much cared.",
    "But good guys don’t ignore the fans and abandon their head coach in troubled times.",
    "“Thibs has done a great job being a spokesperson for us,” Rose said that day.",
    "When his team stinks, he says it, as he did with great flair last summer.",
    "Is he surprised that Randle hasn’t been able to back up his career year?",
    "As an agent, Leon Rose did not do much talking for public consumption.",
    "“That’s worked really well.”\nIt’s not working really well anymore.",
    "Why didn’t he make a spirited free-agent bid for DeMar DeRozan?",
    "In the end, the consistent winners usually get it in New York.",
    "He had to answer only to the players paying his commission.",
    "Of course, there’s a tangible benefit to this approach.",
    "Rose hasn’t won anything, and can’t be bothered.",
    "Why didn’t he make a move at the trade deadline?",
    "Rose’s silence makes him look small and weak.",
    "This is a story about you, the fans.",
    "But in this sinkhole of a season?",
    "What is GM Scott Perry’s role?",
    "His actions prove otherwise.",
    "What is Dolan’s role?"
  ]
}