{
  "id": 4517,
  "mediaId": 2748,
  "date": "2022-03-01",
  "headline": "Internal Debate: Biden Bungled Afghanistan & Ukraine, Is It Too Late For Taiwan?",
  "image": "https://blabberbuzz-bg6bts0feiert.netdna-ssl.com/media/k2/items/cache/7cafe2e03a6289a3aabc6e30e1512c18_L.jpg",
  "link": "https://www.blabber.buzz/blab/pop/1035501-internal-debate-biden-bungled-afghanistan-ukraine-is-it-too-late-for-taiwan?utm_source=c-alrt&utm_medium=c-alrt-email&utm_term=c-alrt-GI&utm_content=8JjVrojghbDpQZgkYhw7DE7DYCpIAO9W_48awCyBRKqI.A",
  "mediaOutlet": "whatreallyhappened.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "When we pull the United States offline from producing the energy that the world needs, it opens it up for other actors who use it to extort their neighbors, and Vladimir Putin is one of them.”\nSTUMPING NEXT WEEK FOR REPUBLICAN HOPEFUL\nPerry explained that when the U.S. “assets\" are pulled off the market, it “raises prices because there is less of it.”\n“And when you do that, somebody like Vladimir Putin, who’s got an economy that is 40-50%, driven by fossil fuels, it raises the amount of money he’s making, so it makes it affordable for somebody — some autocrat — to do what he’s doing.",
    "“When a tyrant is looking for a green\nlight, that’s essentially opening the door completely.”\nConcerns have been raised by some in recent days regarding Russia’s multi-front war on Ukraine that could embolden adversaries like China in their ambitions to take Taiwan, but Perry told Fox News there is still time.",
    "During an exclusive interview with Fox News on the sidelines of the Conservative Political Action Conference (CPAC), Perry, R-Pa., declared the Biden Administration’s leadership has been “an abject failure.”\n“How we got into this, in my opinion, is twofold,” Perry asserted.",
    "“It’s not too late, but the actions obviously haven’t had any effect on Russia’s calculation, on Vladimir Putin’s calculation, and the risk related to invading another country on the world stage,” Perry stressed, referring to the Biden administration’s sanctions on Russia.",
    "“We saw him being weak in Afghanistan and so too the rest of the world, certainly, but Vladimir Putin did, and then just recently, with Ukraine talking about a little invasion or something like that, would be something we wouldn’t do anything about it.",
    "Amid growing concerns that Beijing has been emboldened by Russian aggression in Ukraine, Republican Rep. Scott Perry insists it is “not too late” for the Biden administration to “show some strength” with regard to China’s ambitions in Taiwan.",
    "“There’s a risk to that and, apparently, he’s determined that it is worth whatever that risk is.”\nAs for China, Perry stated he believes “China is making an assessment right now.”\n“It’s ongoing,” he said.",
    "“It’s a continuous assessment, and I still think that there is time for the Biden administration to show some strength here and some resolve.",
    "“The Biden energy policies have facilitated what’s happening in Ukraine right now.”\n“Number two, his rhetoric has been weak,” said Perry.",
    "“It's our energy policy in the United States.",
    "So that’s number one,” Perry went on.",
    "That’s very, very provocative."
  ]
}