{
  "id": 4824,
  "mediaId": 2526,
  "date": "2022-02-22",
  "headline": "Cotton, Rubio Among Those Planning to Boycott Joe Biden’s State of the Union",
  "image": "https://media.breitbart.com/media/2022/02/GettyImages-1237564776-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/22/cotton-rubio-among-those-planning-to-boycott-joe-bidens-state-of-the-union/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1672,
    2047,
    2201,
    2430,
    2599,
    3975,
    1171
  ],
  "sentences": [
    "The House notice provides the following requirements, and a Senate version is similarly worded:\nProof of a “daily negative health screening inventory”\nA negative RT-PCR test taken at the Capitol within one day of the address\n“Must adhere to social distancing guidelines regarding seating separation distances”\n“Must use waterless hand cleanser on entry to the House Chamber”\n“Must avoid physical contact with other individuals”\n“Must continuously wear an issued, FDA-authorized KN95 or N95 mask that completely covers the nose and mouth”\nThe notice adds that “failure to follow guidelines or removal of the mask in the House Chamber will result in the attendee’s removal from the event and/or fines.” It also specifies that members will not be granted guest tickets.",
    "https://t.co/sJfnDJXgCj\n— Chip Roy (@chiproytx) February 20, 2022\nThe Freedom Caucus chair, Rep. Scott Perry (R-PA), also condemned the event’s coronavirus rules, saying in a statement to Breitbart News, “The arbitrary and capricious rules set forth are nothing short of farce and political theater meant to deeply divide and further distract from a president who just never fails to fail.” The Pennsylvania Republican has not publicly made a decision on if he will attend.",
    "Ocasio-Cortez said her decision not to go was a “deeply personal” one and that she did not want to use her “presence at a state ceremony to normalize Trump’s lawless conduct & subversion of the Constitution.”\nAfter much deliberation, I have decided that I will not use my presence at a state ceremony to normalize Trump’s lawless conduct & subversion of the Constitution.",
    "“No thank you, maybe next time.”\nBelow is the #CovidTheatre rituals required to attend the State of the Union\nNo thank you, maybe next time pic.twitter.com/Fe0BSthVjk\n— Marco Rubio (@marcorubio) February 18, 2022\nNotices from the House and Senate sergeant at arms sent out last week and reviewed by Breitbart News list out the coronavirus rules in place for the evening.",
    "In a statement on Sunday, he urged Republican congressional leaders to “decline to participate” and instead “charter a plane to McAllen & challenge @joebiden to #SecureOurBorder.”\nPaying hundreds of thousands of dollars to lock down a building for a Congress & a President at war with the American people.",
    "Spokesman James Arnold told Breitbart News, “Nancy Pelosi’s COVID theatrics are a joke and Senator Cotton will not be attending.”\nCurrently the House side of the Capitol building has a mask mandate in place, but the Senate side of the building does not.",
    "Sen. Tom Cotton (R-AR) said Tuesday he does not plan to attend President Joe Biden’s first State of the Union address, happening in one week, because of extraordinarily strict coronavirus measures in place for the event.",
    "To someone who lies in the face of facts.”\nIn 2020, multiple Democrats again declined to attend Trump’s State of the Union, including “Squad” members Reps. Alexandria Ocasio Cortez (D-NY) and Ayanna Pressley (D-MA).",
    "At least a dozen Democrat members sat out during Trump’s first address in 2018, including Rep. Maxine Waters (D-CA), who said at the time, “Why would I take my time and go and sit and listen to a liar?",
    "The first to announce his plans to forgo attending was Sen. Marco Rubio (R-FL), who shared a document listing out the newly announced health requirements of the event on Thursday.",
    "Cotton is one of at least a few Republicans who have so far expressed intentions to skip the annual joint session address, which takes place in the House chamber.",
    "In the House, one of the more outspoken members of the Freedom Caucus, Rep. Chip Roy (R-TX), has said he will not be going to the State of the Union either.",
    "Yet another Freedom Caucus colleague, Rep. Lauren Boebert (R-CO), said she does plan to be present for the president’s speech.",
    "Other key Republican members have yet to weigh in on their plans for next Tuesday, but more are expected to skip out.",
    "Several Democrat members boycotted former President Donald Trump’s State of the Union addresses during his tenure.",
    "“Below is the #CovidTheatre rituals required to attend the State of the Union,” Rubio wrote.",
    "Charter a plane to McAllen & challenge @joebiden to #SecureOurBorder.",
    "Consequently, I will not be attending the State of the Union.",
    "The @HouseGOP & @SenateGOP should decline to participate.",
    "None of this is normal, and I will not legitimize it.",
    "— Alexandria Ocasio-Cortez (@AOC) February 4, 2020"
  ]
}