{
  "id": 4876,
  "mediaId": 2644,
  "date": "2022-02-19",
  "headline": "DeMar DeRozan enjoying ‘dream’ Bulls scenario after Knicks free agency gaffe",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/1238622440.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/19/demar-derozan-enjoying-dream-bulls-scenario-after-knicks-gaffe/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jenna Lemoncelli",
  "authorUrl": "",
  "termIds": [
    1397,
    2140,
    2815,
    3775,
    4205,
    210,
    665,
    709,
    920
  ],
  "sentences": [
    "It’s something that’s a dream come true,” DeRozan, who was selected as an All-Star for the fifth time in his career, told The Post when asked about playing in Chicago and his season ahead of the All-Star Game on Sunday in Cleveland.",
    "DeRozan averaged 38.6 points on 60.7 percent shooting and 86.2 percent from the free-throw line on 9.2 attempts over that seven-game stretch — which tied Jordan for the second longest streak of 35-point games in franchise history.",
    "Last Wednesday, DeRozan scored 38 points on 16-for-27 (59 percent) shooting — making him the first player in NBA history to score at least 35 points while shooting better than 50 percent from the field in seven consecutive games.",
    "“Historically, we understand the history behind the Chicago Bulls and for me to be able to put on a jersey and represent a a great organization, being able to represent on the biggest stage during the season is awesome.",
    "DeRozan’s name has been recently mentioned with the likes of Bulls legend Michael Jordan and NBA icon Wilt Chamberlain because of his statistical feats this season.",
    "The forward is playing history-making basketball with Chicago, which gave him a three-year, $82 million package last August via a sign-and-trade with the Spurs.",
    "The Post’s Marc Berman previously reported the Knicks were one of the teams the 13-year veteran was most interested in joining before he committed to Chicago.",
    "I think I’m just haunted by the ghost that’s in the United Center to be able to go out here and perform every single night,” DeRozan said.",
    "He surpassed Chamberlain, who twice in his career achieved the feat in six consecutive games, with the last time coming in 1963.",
    "Before he joined the Bulls, DeRozan drew interest from Knicks general manager Scott Perry while he was a free agent.",
    "Instead, the Knicks signed Evan Fournier for four years and $78 million, with the final season not guaranteed.",
    "The Bulls are currently second in the Eastern Conference at 38-21, while the Knicks sit 12 at 25-35.",
    "A source said if the Knicks had matched the Bulls’ offer, DeRozan would’ve chosen the Big Apple.",
    "Imagine if DeRozan were being haunted by the ghosts in the rafters of Madison Square Garden.",
    "The sharpshooting Fournier has so far been a disappointment to start his Knicks tenure.",
    "DeMar DeRozan has fully embraced being a Bull.",
    "“Everything else I can’t explain."
  ]
}