{
  "id": 5830,
  "mediaId": 2636,
  "date": "2022-02-02",
  "headline": "Democrats Break With Leaders Over Congressional Stock Trading",
  "image": "https://static01.nyt.com/images/2022/02/02/us/politics/02dc-stocks-1/02dc-stocks-1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/02/02/us/politics/democrats-congress-stocks-trading.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2599,
    2923,
    3739,
    4047,
    4309,
    305,
    1124,
    1163,
    4887,
    4984
  ],
  "sentences": [
    "Last week, 27 House members signed on to a letter to Ms. Pelosi and Representative Kevin McCarthy of California, the top Republican, urging them “to swiftly bring legislation to prohibit members of Congress from owning or trading stocks.”\nSigners included Democrats in some of the toughest districts in the country: Katie Porter of California, Jared Golden of Maine, Tom Malinowski of New Jersey, Angie Craig of Minnesota, Haley Stevens of Michigan and Matt Cartwright of Pennsylvania.",
    "Former Senator Kelly Loeffler of Georgia, who lost re-election to Raphael Warnock, defended her innocence on Sunday in the conservative Washington Examiner, blaming “a left-wing blog” and hypocritical Democrats who refuse to look at the investments of Ms. Pelosi’s affluent husband, Paul Pelosi, for what she called false accusations of insider trading.",
    "There are limits to what we’re supposed to do.”\nDrew Hammill, Ms. Pelosi’s deputy chief of staff, said the speaker had asked Representative Zoe Lofgren, Democrat of California and the chairwoman of the Committee on House Administration, to examine an array of proposals to regulate lawmakers’ trading, including a ban on owning stocks.",
    "The surge in interest underscores the political potency of the issue in Congress, an institution increasingly detested by the public, and the popularity of the specific idea of banning stock trading by lawmakers, which recent polls have shown is supported by a lopsided proportion of voters in both parties.",
    "The bills enjoy broad support — the 42 co-sponsors of Ms. Spanberger’s TRUST in Congress Act include Representatives Matt Gaetz of Florida, Scott Perry of Pennsylvania and Andy Harris of Maryland, all firmly in the Trump wing of their party — and if anything, they are putting Ms. Pelosi in the spotlight.",
    "“We were steadily adding co-sponsors, but it is absolutely the case that the speaker’s answer to that question related to stock ownership and trading really ignited this as an issue.”\nThe legislation faces a climb on Capitol Hill, where the skepticism of top Democrats makes it unlikely to be considered.",
    "WASHINGTON — Facing stiff political headwinds and a flagging election-year agenda, the most vulnerable Democrats in Congress have found a way to distance themselves from their leaders: demanding an end to stock trading for all members of Congress, including senior lawmakers who are clearly leery.",
    "With such narrow margins in the House and the Senate, Democrats facing difficult re-election races do not have the latitude to try to show their independence by voting against major legislation, while hoping it passes — a common practice with larger majorities.",
    "“We introduced this in June 2020 and reintroduced it this Congress,” said Representative Abigail Spanberger of Virginia, a Democrat from a politically competitive district who wrote a stock ban with Representative Chip Roy of Texas, a conservative Republican.",
    "Their bill — which would mandate that lawmakers put investments into a blind trust and ban the trading of individual stocks — has been joined by separate measures written by Senators Josh Hawley, Republican of Missouri, and Ben Sasse, Republican of Nebraska.",
    "Mr. Sasse’s version, drafted in 2018 and reintroduced on Wednesday, would go further, requiring presidents and vice presidents to release their tax returns and Congress to make public sexual harassment settlements, which have often been struck in secret.",
    "Ms. Lofgren is also looking at increasing penalties for “unacceptable noncompliance” with the Stop Trading on Congressional Knowledge (STOCK) Act, a 2012 law that mandates that lawmakers disclose their stock trading, a step he said Ms. Pelosi supports.",
    "But at least one of the lawmakers, Senator Richard M. Burr of North Carolina, who was investigated by the Justice Department after he dumped hundreds of thousands of dollars of stock early in the pandemic, has said he welcomes the effort.",
    "They come at this from a different time and a different perspective,” said Ms. Stevens, who has found herself almost certainly facing another Democrat, Andy Levin, in the upcoming House primaries in redistricted Michigan.",
    "On the other side of the Capitol, Senator Jon Ossoff, Democrat of Georgia, piled on with his own bill, co-sponsored by Senator Mark Kelly of Arizona, one of the most endangered Democrats facing re-election this year.",
    "On the Democratic side, the names parallel the party’s list of endangered incumbents, many of whom rushed to sign on after Speaker Nancy Pelosi of California expressed her opposition in December.",
    "The growing list of Democrats who have signed on to ethics legislation that would ban ownership of individual stocks is remarkably bipartisan, speaking to the political power of the issue.",
    "Ms. Pelosi, after initially dismissing the effort, more recently said she would be open to it if proponents could muster the votes, even as she suggested she considered it a bad idea.",
    "With top House Democrats skeptical of barring lawmakers from owning individual stocks, a simmering issue has exploded, especially among members facing difficult re-election races.",
    "The stock trading push stems from a string of recent accusations that senators from both parties traded health care stocks after closed-door briefings on the coronavirus pandemic.",
    "The issue was front and center in the two Senate races in Georgia in 2020, and Mr. Ossoff hit his Republican opponent, the incumbent David Perdue, on it with brutal efficiency.",
    "If stock ownership is forbidden because it could create a conflict with legislating, would having student loan debt make it inappropriate for a member to press for loan relief?",
    "They argue that once Congress begins trying to regulate its own members out of investments, it is difficult to draw the line between what is permissible and what is not.",
    "They said her refusal in December to consider a stock trading ban — “We’re a free-market economy,” she said when asked about the push — made the issue a cause célèbre.",
    "Mr. Hoyer said on Wednesday that he continued to believe lawmakers should be allowed to own and trade individual stocks, as long as they obeyed insider trading laws.",
    "“If you’re talking about dirt, well, are you talking about your family farm or are you engaging in thousands of real estate transactions?” he asked.",
    "“You have the speaker of the House out there trading, and her husband making millions and millions of dollars a year,” Mr. Hawley said.",
    "“I just don’t buy into it, but if members want to do that, I’m OK with that,” she said last month, as the idea picked up support.",
    "“In my experience, when I talk to people in Missouri they say, ‘Wait a minute, senators own and trade stocks?’” Mr. Hawley said.",
    "“I’ll support whatever they come up with,” said Mr. Burr, who was never prosecuted and is retiring at the end of his term.",
    "“The speaker, I don’t want to directly call her out, but handfuls of members have put dozens and dozens of years here.",
    "“Are you buying and selling and engaging in commercial real estate transactions development while you’re in Congress?",
    "For Democrats pushing for the stock ban, the resistance of their leaders is all for the best, at least politically.",
    "None were charged with insider trading, nor did they face repercussions from the House or Senate ethics committees.",
    "Whether or not it rises to the level of criminal insider trading, we know what legislation is likely to become law.",
    "She suggested that the new bills banning stock trading were partisan efforts to deflect attention from Ms. Pelosi.",
    "Representative Steny H. Hoyer of Maryland, the House majority leader, reiterated his opposition on Wednesday.",
    "“I saw all this trading during the pandemic massively erode confidence in Congress,” Mr. Ossoff said.",
    "Would owning real estate confer an improper personal interest in environmental or land-use policy?",
    "“Members of Congress have an unfair advantage when they’re making investment decisions.",
    "“It’s just a basic good-government issue, and it’s something that people understand.”",
    "And clearly the lawmakers who support a ban believe voters are firmly on their side.",
    "Mr. Roy allowed that there were complexities, but, he said, a line had to be drawn.",
    "We can draw inferences.”\nThe lawmakers caught up in the accusations still bristle.",
    "(Mr. Kelly sent out a fund-raising “petition” on the issue on Wednesday.)",
    "Democrats are just as eager to contrast their position with Ms. Pelosi’s.",
    "Both signed on to last week’s letter demanding action on a trading ban.",
    "Democratic leaders remain leery."
  ]
}