{
  "id": 5845,
  "mediaId": 2644,
  "date": "2022-02-08",
  "headline": "Knicks eyeing Kings’ Harrison Barnes as NBA trade deadline heats up",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/harrison-barnes-nba-trade-deadline-knicks.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/08/nba-trade-deadline-knicks-eyeing-kings-harrison-barnes/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Berman",
  "authorUrl": "",
  "termIds": [
    2487,
    4325,
    4615,
    309,
    433,
    565,
    709,
    911,
    1198
  ],
  "sentences": [
    "DENVER — While the Knicks inquired about point guard De’Aaron Fox, he is probably off the market after the wheeling and dealing Kings reportedly traded their other point guard Tyrese Haliburton to the Pacers in a blockbuster for Damontas Sabonis.",
    "He’s a terrific player.”\nThere were rumblings the Knicks, who suffered a 132-115 blowout loss to the Nuggets on Thursday night, would have given up Julius Randle in a package for Fox, but he should be safe now.",
    "The Knicks have lost out on two Blazers players of interest in Norman Powell, who was sent to the Clippers, and expensive guard CJ McCollum, who is headed to the Pelicans in a package.",
    "Knicks president Leon Rose and general manager Scott Perry stayed home to work the phones, while senior adviser William Wesley and executive Allan Houston are on the western journey.",
    "The Pistons recently expressed interest to the Knicks about center Mitchell Robinson, who could become an unrestricted free agent and whose stock is rising.",
    "Before the Haliburton trade, multiple sources said the Kings would be amenable to trading the 29-year-old Barnes, who played for the Warriors’ super teams.",
    "Barnes spent his first four seasons in the league with Golden State, signed with Dallas as a free agent in 2016 and was traded to Sacramento in 2019.",
    "The Knicks were routed by the Nuggets, 132-115, on Tuesday after close losses to the Lakers and Jazz in the first two games of a five-game road trip.",
    "The Knicks, however, have also asked the Kings about the availability of veteran combo forward Harrison Barnes as the trade deadline approaches.",
    "One Pistons player of note is tough-as-nails rookie big man and Rochester native Isaiah Stewart, whom the Knicks liked during the draft.",
    "Reddish was a minus-21 in 17 minutes Monday at Utah when Kemba Walker (rest) and Quentin Grimes (knee) were missing from the lineup.",
    "Thibodeau didn’t consider Reddish an upgrade from what the Knicks had and only has played him when others have been absent.",
    "Barnes entered Tuesday averaging 16.8 points and 6.1 rebounds while shooting 40.6 percent from 3-point range.",
    "Before the Knicks faced the Kings last week, coach Tom Thibodeau said: “A guy like Barnes gets overlooked.",
    "Barnes is a 6-foot-8 combo forward similar in size to Cam Reddish, whom the Knicks recently acquired.",
    "The Knicks believe they need a 3-4 type player, which is why they traded for Reddish.",
    "In fact, word around the league was everyone on the Sacramento roster is fair game.",
    "If something makes sense that they feel can improve the team we’ll do it.",
    "but it’s time of the year you’re looking at all the possibilities.’’",
    "If they get close on something they’ll talk to me about it.",
    "They’re up constantly studying opportunities.",
    "“I trust Leon, Wes, Scott,’’ Thibodeau said.",
    "There’s more focus because of the deadline.",
    "If it doesn’t make sense we won’t do it.",
    "“They’re doing what they need to do.",
    "That’s what they have to do.",
    "They do it all year round."
  ]
}