{
  "id": 5895,
  "mediaId": 2526,
  "date": "2022-02-03",
  "headline": "Poll: Majority Say Biden’s Immigration Policy ‘Worse’ than Trump’s",
  "image": "https://media.breitbart.com/media/2022/01/DT-2-640x335.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/03/poll-majority-say-bidens-immigration-policy-worse-trumps/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    1492,
    2140,
    2201,
    3223,
    3975,
    862,
    878,
    5371,
    5390
  ],
  "sentences": [
    "The survey asked respondents if the Biden administration’s immigration policy is “better or worse than the Trump administration’s policy” and found 52 percent deeming Biden’s policy “worse.” Just over a quarter, 28 percent, said it is “better,” and 15 percent said it is “about the same.”\nHalf of Democrats believe Biden’s immigration policy is “better,” while a quarter say it is “worse.” A majority of Republicans and independents, 79 percent and 53 percent respectively, agree Biden’s immigration policy — which includes the expansion of catch and release — is “worse.”\nRespondents were also asked which they believe is “more important” between “taking strong measures for border enforcement or figuring out why people in other countries are coming to the United States illegally.” Most, 59 percent, said strong measures for border enforcement is more important, while roughly one-third said it is more important to figure out what is driving people to flock to the United States.",
    "The House Freedom Caucus chairman added that it is their first job as representatives to protect the American people, “not to invite and pay for and facilitate the entry of the criminal element into our communities.”\nWhile he said not all of them are violent criminals, he added, “Let’s face it, if you’re coming into the country illegally, that’s your first act,” disrespecting the American taxpayer and U.S. laws.",
    "Rep. Scott Perry (R-PA), Chairman of the House Freedom Caucus, blasted Biden immigration policies during a recent appearance on Breitbart News Saturday, noting that bureaucrats are “flying unaccompanied aliens in the dead of night right into our cities” as the Biden administration essentially forces U.S. tax dollars to go toward human trafficking.",
    "Biden – 28%\nTrump – 52%https://t.co/UWhJ5YOUJm@POTUS #Immigration #breakingpoll pic.twitter.com/IXJk6PMQp8\n— Rasmussen Reports (@Rasmussen_Poll) February 3, 2022\nThe survey, taken February 1-2, 2022, among 1,000 likely U.S. voters, has a margin of error of +/- 3 percent.",
    "Breitbart News Washington Bureau chief Matthew Boyle highlighted the story of officials flying an illegal immigrant — who lied about his name and age — to Northeast Florida, who on to kill the person they put him with.",
    "President Biden, meanwhile, is disregarding the law with no oversight from the legislative branch as he fails to “faithfully discharge his duties and faithfully execute the laws of the land … duly passed,” he added.",
    "What is more, while most say Biden’s immigration policies are “worse” than Trump’s, this will likely factor into the midterm elections, as 78 percent said the issue will be important in this year’s elections.",
    "“And that’s a problem.”\nPerry also noted that Democrats are not only disregarding the laws but “actually finding ways to go around the law proactively” to assist illegal aliens in thwarting the system.",
    "Days later, the House Freedom Caucus held a hearing analyzing Biden’s border policies during his first year in office, as it ended with record-breaking apprehensions at the southern border.",
    "Perry emphasized that Americans generally want to help people, but “there’s a way to do that” — not by importing criminals directly into neighborhoods.",
    "Most Americans say President Biden’s immigration policy is “worse” than former President Trump’s, a Rasmussen Reports survey released Thursday found.",
    "Who has the best immigration policy according to voters?",
    "Of those, 53 percent consider it “very” important."
  ]
}