{
  "id": 5969,
  "mediaId": 2639,
  "date": "2022-02-10",
  "headline": "Knicks stand pat as NBA trade deadline passes, then beat Golden State",
  "image": "https://cdn.newsday.com/ace/c:ZWVkZTdiM2MtYWRlYi00:YzJhZTcy/preview/1280",
  "link": "https://www.newsday.com/sports/basketball/knicks/knicks-trade-deadline-o73029",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steve Popper",
  "authorUrl": "",
  "termIds": [
    1397,
    2487,
    2647,
    3308,
    4325,
    4362,
    433,
    665,
    709
  ],
  "sentences": [
    "Those moves could have cleared up some of the playing time issues that will surface when Derrick Rose returns (expected after the All-Star break) and created some opportunities for Cam Reddish after the Knicks dealt a first-round pick and an expiring contract to obtain him.",
    "Multiple sources around the league indicated the Knicks were willing to deal just about anyone on the roster for the right return, but the sources also indicated a universal lack of interest in the Knicks’ talent and contracts.",
    "Leading by as many as 13 in the fourth quarter, the Knicks saw their lead cut to one, and when Reddish missed one of two from the line with 6.2 seconds remaining, there was one more opening for Golden State.",
    "If the deadline passing at least eased the stress, the Knicks still had the task of taking on Golden State on the road without RJ Barrett, who was sidelined with a sprained left ankle.",
    "But Fournier’s contract was an obstacle to any attempt to move him, and other players the Knicks were dangling, such as Kemba Walker and Nerlens Noel, drew little interest.",
    "\"It really doesn’t change in terms of we already made a trade earlier on,\" coach Tom Thibodeau said before the Knicks stunned Golden State, 116-114, on Thursday night.",
    "While the trade deadline featured a flurry of big names shifting locations around the NBA, the Knicks stood pat despite having losing four straight and 10 of 12.",
    "Thibodeau, who was a team president in addition to the coach with the Timberwolves, has insisted that the front office keeps him apprised of what is going on.",
    "Despite sitting in 12th place in the Eastern Conference and stumbling badly during the last month, the Knicks tried to put on a brave face before the game.",
    "SAN FRANCISCO — The Knicks worked through their shootaround at the Chase Center on Thursday morning, running the workout nearly to the 3 p.m.",
    "When it passed, they were intact — so they headed back in the afternoon with the same squad that had gotten them to that point.",
    "While as the coach he might have wanted to find something to help jump-start the team, he said he is fine with Rose’s approach.",
    "Klay Thompson shook Fournier and had an open look from 10 feet out, but his shot hit the back rim as time expired.",
    "Burks had 12 of his 15 points in the fourth quarter and Reddish added 12 off the bench for the Knicks (25-31).",
    "Fournier said after Tuesday’s loss that he believes the team has the talent to put together a run this season.",
    "One person with knowledge of the talks said the Knicks had shopped Evan Fournier and Alec Burks.",
    "Rose and the Knicks’ front office have not spoken publicly since the start of training camp.",
    "\"So there’s short-term planning, long-term planning and you’re constantly looking at both.",
    "He put some of it on his own struggles but insisted that he wanted to stay with the team.",
    "There’s always possibilities, different ways you can improve the club, and I trust him.\"",
    "Julius Randle had 28 points, 16 rebounds and seven assists and Fournier added 22 points.",
    "It just hasn’t come along for us as a group, and that’s been our biggest problem.",
    "Whoever comes in or whoever is here, we have a really good core to build off of.",
    "I don’t make those decisions or anything like that, so yeah, I want to be there.",
    "But they managed to play one of their most complete games of the season.",
    "Leon [Rose], [William Wesley] and Scott [Perry] look at it in totality.",
    "Stephen Curry had 35 points and 10 assists for Golden State (41-15).",
    "I like our team,\" Thibodeau said an hour before the deadline. \"",
    "If something can make us better, we’ll definitely consider it.",
    "It takes a strong person, and that’s what I love about Leon.",
    "\"I just think we haven’t really found our rhythm together.",
    "It’s every day thinking about how can we improve the team.",
    "You look at your trade possibilities, trades, free agents.",
    "\"It’s not an easy job, I can tell you,\" Thibodeau said.",
    "That’s why I came here, to be a part of my home team.",
    "The decision to stand pat wasn’t totally their own.",
    "The score for this game is currently unavailable.",
    "\"That was the one takeaway I had from doing it.",
    "Walker echoed that sentiment Thursday morning.",
    "We just haven’t been putting it all together.\"",
    "I think we just got to keep working at it.",
    "It’s challenging in different ways.\"",
    "And that’s been the biggest problem.",
    "\"Like I said, I mean, what can I do?",
    "You look at your player development.",
    "I do think we have great players.",
    "We’ve got to continue to work.\"",
    "It’s not really my decision.’’",
    "We’ll keep working every day.",
    "He’s not going to overreact.",
    "But it’s a challenging job.",
    "\"Yeah, I’m here,\" he said.",
    "Whoever we have, we like.",
    "He’ll continue to look.",
    "Please try again later.",
    "ET NBA trade deadline.",
    "It’s a difficult job.",
    "He’s very pragmatic.",
    "Great group of guys.",
    "\"That’s part of it.",
    "That’s Leon’s job.",
    "It’s not up to me.",
    "I’m just a player.",
    "\"I love our guys.",
    "I do,\" he said.",
    "It doesn’t end.",
    "It’s ongoing.",
    "\"I’m fine.",
    "\"I agree.",
    "I do.",
    ".",
    ".",
    "."
  ]
}