{
  "id": 6118,
  "mediaId": 2644,
  "date": "2022-02-01",
  "headline": "Quentin Grimes’ work ethic impressing Knicks, Tom Thibodeau",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/02/Quentin-Grimes.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/02/01/quentin-grimes-work-ethic-impressing-knicks/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Joyce",
  "authorUrl": "",
  "termIds": [
    2140,
    2191,
    2342,
    2406,
    2487,
    2727,
    2848,
    3777,
    709,
    911
  ],
  "sentences": [
    "“If I’m BSing in practice, that’s not going to help me in the game, especially as a rookie.”\nIn addition to sharp shooting from beyond the arc — he is hitting 40.3 percent from 3 — Grimes has made his impact felt on defense, a sure-fire way to get more minutes under Thibodeau.",
    "But that’s part of the game and you try to block it out and concentrate on what’s in front of you.”\nObi Toppin will compete in the Slam Dunk Contest for a second straight year, The Post’s Marc Berman reported.",
    "The Knicks have just four games left until the Feb. 10 trade deadline, and though a shakeup could be coming for the underperforming roster, Julius Randle steered clear of opining on whether one was needed.",
    "“He always told me that no matter if you’re playing or you’re not playing … you gotta treat every practice like it’s a game because you’re ultimately preparing yourself for the game,” Grimes said.",
    "After chipping in 14 points, four rebounds and three steals in the Knicks’ win over the Kings on Monday, Grimes said his father was the one who got him to buy into making the most of practices.",
    "The Garden crowd chanted for Cam Reddish on Monday night during garbage time, but Thibodeau said Tuesday the intriguing wing is still going through the process of earning his playing time.",
    "It’s a large part of why the Knicks rookie guard has been able not only to crack coach Tom Thibodeau’s rotation, but also to stay in it with a growing role as the season progresses.",
    "“That’s their job and I’m sure they’ll make the best decisions for our team.”\nThibodeau echoed Randle when asked what the Knicks’ approach would be heading into the deadline.",
    "He’s gotta earn everything he’s going to get.”\nThe Knicks assigned rookies Miles McBride and Jericho Sims to G-League Westchester ahead of its game Tuesday night.",
    "“I trust Leon and Wes and Scott,” Randle said of the Knicks braintrust — president Leon Rose, senior adviser William Wesley and general manager Scott Perry.",
    "Coming off one of the better games of his young NBA career Monday night, Quentin Grimes returned to the gym on Tuesday afternoon and got back to work.",
    "“He’s always high energy, focused and he really takes the game seriously.”\nGrimes credited his dad, Marshall, for that characteristic.",
    "“He’s been great with the early group and working in practice and that sort of thing.",
    "“He comes in every day and works his butt off,” teammate RJ Barrett said Tuesday.",
    "“Any time you get traded in the middle of the season, that’s it.",
    "Toppin finished as the runner-up in last year’s competition.",
    "“You could talk about 100 trades and one might get done.",
    "“Very rarely does anything happen,” Thibodeau said.",
    "When his opportunity comes, it’s about performance.",
    "Right now, that’s the first step,” Thibodeau said."
  ]
}