{
  "id": 6256,
  "mediaId": 2696,
  "date": "2022-02-09",
  "headline": "This North End pizzeria is the best in Boston, according to 2,000 readers",
  "image": "https://www.boston.com/wp-content/uploads/2022/02/https___arcmigration-prdweb.bostonglobe.com_r_Boston_2011-2020_2012_06_11_BostonGlobe.com_Lifestyle_Images_15thetip2-620401472a824-scaled.jpg",
  "link": "https://www.boston.com/community/readers-weigh-in/where-to-find-the-best-pizza-in-boston/",
  "mediaOutlet": "The Boston Globe",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zipporah Osei",
  "authorUrl": "https://www.boston.com/author/zipporah-osei/",
  "termIds": [
    0
  ],
  "sentences": [
    "“Whenever I visit family in Florida, I pack at least one pizza in my luggage to bring the authentic taste of Boston for all to enjoy.”\nWhat to order:\n“Sausage and Garlic, just a fabulous combination of textures, flavors, all served with zero BS and as it has been served for decades.” — W Devine, Newton\n“Hamburger.",
    "I love a unique pizza and Papa Gino’s does this one well!” — Anthony H., Dedham\n“When I am looking for a pepperoni or a buffalo chicken mac and cheese pizza, Papa Gino’s is the only place that I go.” — Jim P., Dedham\n“Pepperoni and pineapple pizza, it’s like a Hawaiian but with pepperoni.",
    "The Westboro Mass Pike Papa Gino’s team never ceases to make great pizza no matter what toppings are on it, and they always make my go-to order to perfection.” — Nicolas F., Worcester\n“Traditional cheese pizza, sometimes with EXTRA Cheese.",
    "Phenomenal hangover cure.” — Jackie H., South Boston\n“Buffalo chicken pizza — perfectly spicy, and the wood-fired crust is so much better than others.” — Colleen, Brighton\n“Sausage pizza.",
    "In my estimation, the best way to determine how good a pizza is by just having cheese without toppings because that is the essence of pizza, and Regina Pizzeria can’t be beaten.",
    "Santarpio’s Pizza (multiple locations)\nIt’s rare you’ll find a Boston pizza ranking without Santarpio’s on the list, and readers say that’s because the pizza is just that good.",
    "This no-frills establishment with locations in East Boston and Peabody has been serving New York-style pies since the 1930s, and according to avid fans, it never disappoints.",
    "We asked readers for the best pizza in the Greater Boston area and the response was overwhelming with more than 200 restaurant recommendations from 2,000 readers.",
    "The best way to celebrate is with a slice (or two, or three) and Boston.com readers have some strong opinions about where to get the best pizza in the region.",
    "Pleasant Cafe (4515 Washington St., Roslindale)\nMany readers who nominated Pleasant Cafe said they’ve been going for years and have yet to be disappointed.",
    "Readers said the century-old restaurant consistently takes the honor of best pizza in Boston — and even the country — off the strength of its amazing pies.",
    "Papa Gino’s (multiple locations)\nThis New England pizza chain has fans all across the state, with readers praising their pizza at many of their locations.",
    "It’s the pizza I grew up on.” — Seth L., Sharon\n“Barbecue chicken, crispy edges, with their homemade honey mustard on the side!” — Janelle, Holbrook\n2.",
    "Below you’ll find readers’ top five pizzerias in Greater Boston, what to order when you go, and a map of all the local reader-recommended restaurants.",
    "When asked what kind of pizza they consider superior to the rest, more than half of the 10,000 readers polled said they prefer New York-style pizza.",
    "Plain cheese is a classic but when I’m feeling fun, salami, onions, and mushrooms.” — Beth, West Roxbury\n“Pleasant Cafe cheese pizza with sausage.",
    "If want to order a fresh pie for National Pizza Day or planing ahead for the Super Bowl, Boston.com readers have you covered on where to eat.",
    "Papa Gino’s first opened shop in East Boston, and now has dozens of locations in Connecticut, Massachusetts, New Hampshire, and Rhode Island.",
    "From their perfectly crafted pizzas (sauce on top) to their barbecue, Santarpio’s Pizza can’t be beaten,” said Andrew C. from East Boston.",
    "Suggestions ranged from local chains to neighborhood pizzerias, and featured every style from classic New York to New England beach pizza.",
    "The cherry peppers give it the perfect spice and the sausage out of the casing is a game-changer.” — Amanda S., South Boston\n“Margherita.",
    "Lincoln Tavern & Restaurant (425 W Broadway, South Boston)\nAt Lincoln Tavern in South Boston, you get great pizza in a great atmosphere.",
    "My favorite place for pizza.” — Marie B., Boston\nCheck out the more than 200 pizza locations recommended by readers using the map below.",
    "This Roslindale pizzeria makes all its sauces and doughs in-house every day and readers say they can taste the difference in quality.",
    "Pleasant Cafe never disappoints.” — Peggy D.l, Roslindale\n“Large pizza with fried eggplant and sliced tomatoes at Pleasant Cafe.",
    "Perfect cheese to sauce ratio, thin crust that’s never too floppy and never burnt but has little flecks of char on the bottom.",
    "I live south of Boston, and there is no Regina Pizzeria around, and that makes me sad.” — Steve, Wrentham\n“Classic pepperoni.",
    "The crust is always fresh and cooked perfectly, the cheese is excellent, and the sauce is just right,” said Moe from Malden.",
    "This “classic American tavern” serves more than pizza, but readers say their wood-fired pies are the star of the menu.",
    "We love it so much so that we spend tens of billions of dollars every year to consume an average of 3 billion pies.",
    "Never had a ‘bad’ pie from there, EVER!”\nWhat to order:\n“Regina Pizzeria cheese pizza is just astoundingly great.",
    "If you’re going to eat that much pizza, you have to make sure it’s delicious — especially on National Pizza Day.",
    "I live in Windham, N.H. now and make it down to Pleasant Cafe at least 6 times annually.” — Scott Perry, N.H.",
    "If Regina Pizzeria seems like an obvious first choice, that’s only because the pizza is so undeniably good.",
    "Don’t order 1, you’ll be happy to have a slice for breakfast the next day!” Eileen K. from Roslindale said.",
    "Always fresh, and crust is not too thick but just right.” — M. Levin, Roslindale\n“Any kind is good!",
    "The 3-cheese blend and tomato sauce they use for their pizzas are unlike any other pizza I’ve had.",
    "What to order:\n“Lincoln Tavern & Restaurant white pizza with the apples, goat cheese, and honey!",
    "The restaurant has multiple locations, but most readers praised the original North End location.",
    "“Best part of Papa Gino’s — the people making it.”\nWhat to order:\n“Chicken Bacon Ranch.",
    "Sausage and roasted red peppers pizza or sausage and ricotta pizza taste like Lasagne.",
    "So good!” — EJ Zuber, Braintree\n“I love the sausage there and they make their own.",
    "“Santarpio’s Pizza has been an East Boston institution for more than a century.",
    "Consider me addicted to Papa Gino’s cheese pizza.” — Lise D., South Boston\n3.",
    "No matter where you are in the area, you can’t be too far from a good slice.",
    "Their plain pizza is delicious too because of the taste of the pizza dough.",
    "As a kid I loved them both so I figured why not put them both on pizza.",
    "I grew up on Pleasant Cafe’s pizza and we’re still going there today.",
    "Classic ingredients and the crust has a great flavor and is crispy.",
    "“Always delicious and consistent no matter which location I go to!",
    "Bar pizza, a local favorite from the South Shore, came in second.",
    "The crust is nice and thin and the cheese is melted just so.",
    "Tons of topping options but my favorite is the pepperoni.",
    "Thin, crisp crust with so many toppings to choose from.",
    "What to order:\n“Half pepperoni, half green pepper.",
    "It’s simply the best sausage pizza I’ve ever had.",
    "It’s great every time.” — Kimberly A., Belmont\n4.",
    "They use fresh dough made right in Walpole, MA!",
    "It’s not just a restaurant, it’s an experience.",
    "A true classic,” said Mike L. from Bellingham.",
    "Pepperoni adds a little extra oil to the mix.",
    "“Never a greasy or overcooked pizza.",
    "The cheese pizza is fantastic, too!",
    "“THE best of any pizza, hands down!",
    "“It’s consistently the best pizza.",
    "It’s fantastic and never gets old.",
    "Americans are obsessed with pizza.",
    "The sauce is sweet and flavorful.",
    "Thin crust is always perfect.",
    "Best decision I’ve ever made.",
    "It’s always perfect!",
    "5."
  ]
}