{
  "id": 646,
  "mediaId": 2523,
  "date": "2022-04-10",
  "headline": "Kings' Ranadive Was Behind Drafting Marvin Bagley III over Luka Doncic, Says Ex-Staff",
  "image": "https://media.bleacherreport.com/image/upload/v1649610660/dgi9omt8c6p2jmjkmwcw.jpg",
  "link": "https://bleacherreport.com/articles/10032232-kings-ranadive-was-behind-drafting-marvin-bagley-iii-over-luka-doncic-says-ex-staff",
  "mediaOutlet": "bleacherreport.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rob Goldberg",
  "authorUrl": "https://bleacherreport.com/users/97da3dae-f34c-40be-8ea8-f6d59f4ffefa",
  "termIds": [
    1653,
    2075,
    2140,
    3472,
    3501,
    4124,
    316,
    911
  ],
  "sentences": [
    "Even when Vlade Divac served as general manager from 2015-20, he was reportedly often overruled by Ranadive, while different people in the front office held more power at different times, including special advisor Joe Dumars and assistant general managers Ken Catanella, Scott Perry and Brandon Williams.",
    "There has been plenty of change in personnel, both on and off the court in this time, but the former staffer explained that Ranadive is the common link as someone who is \"too involved.\"",
    "Through four seasons, Doncic has a value over replacement player of 19.7 points per 100 possessions, while Bagley is at negative-0.1, per Basketball Reference.",
    "The one decision is a major reason the Kings have continued to struggle as a franchise, missing the playoffs for the 16th season in a row in 2021-22.",
    "2 overall pick in 2018 ahead of Luka Doncic, a former member of the team's basketball operations staff told Jason Anderson of the Sacramento Bee.",
    "Bagley never reached expectations and was traded to the Detroit Pistons in February, while Doncic already has three All-Star selections.",
    "Sacramento Kings chairman Vivek Ranadive was reportedly one of the \"driving forces\" behind drafting Marvin Bagley III with No.",
    "Divac previously took the blame for drafting Bagley, but it now seems Ranadive and Williams had a bigger say.",
    "The source credited Ranadive and assistant general manager Brandon Williams in leading the charge for Bagley.",
    "They felt the former Duke star was a \"modern-day big who could run the floor with De'Aaron Fox.\""
  ]
}