{
  "id": 6682,
  "mediaId": 4024,
  "date": "2022-01-25",
  "headline": "House conservatives building support to block federal funding of Biden vaccine mandates",
  "image": "https://www.lifesitenews.com/wp-content/uploads/2022/03/lifesite-social-media-logo-and-tagline.png",
  "link": "https://www.lifesitenews.com/news/house-conservatives-building-support-to-block-federal-funding-of-biden-vaccine-mandates/",
  "mediaOutlet": "LifeSiteNews",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2140,
    2818,
    3267,
    3434,
    3975,
    4261,
    404
  ],
  "sentences": [
    "Fox News reported that the letter, currently being circulated for signatures by Rep. Chip Roy of Texas, challenges House Minority Leader Kevin McCarthy and Senate Minority Leader Mitch McConnell to “decide whether they will vote to fund a federal government that is enforcing tyrannical COVID-19 vaccine mandates on the American people.”\n“Congressional Republicans cannot continue to abdicate their Article I duties in hopes the judicial branch will rule in favor of the American people,” it reads.",
    "“Therefore, we the undersigned refuse to consider supporting any federal government funding vehicle, be it a continuing resolution or an omnibus appropriations measure, that funds the enforcement of COVID-19 vaccine mandates at any level of government.”\nMore than a dozen Republicans have reportedly signed on so far, including Reps. Lauren Boebert of Colorado, Paul Gosar of Arizona, Clay Higgins of Louisiana, and Scott Perry of Pennsylvania.",
    "The federal government considers more than 210 million Americans (63% of the eligible) to be “fully vaccinated” (a moving target given the vaccines’ temporary nature), yet data from Johns Hopkins University reported in October shows that more Americans died of COVID-19 by that point in 2021 (353,000) than in all of 2020 (352,000).",
    "The Trump administration’s Operation Warp Speed initiative developed and released the shots in a tenth of the time vaccine development usually takes and a quarter of the time it took the previous record-holder, the mumps vaccine, yet their advocates have done little to address the concerns of the hesitant.",
    "WASHINGTON, D.C. (LifeSiteNews) – A handful of conservative Republicans are urging their colleagues to be willing to force a government shutdown standoff to prevent passage of the next government funding bill if it contains money to enforce the Biden administration’s COVID-19 vaccine mandates.",
    "We’re going to find out.”\nFederal budget battles are one of the relatively few ways a political minority can exert real leverage over the majority party, though in practice shutdown threats often turn on which party can more effectively blame the other for a shutdown.",
    "“Most Republicans say that vax mandates are tyrannical and foolish, but will they unite before government funding expires on Feb. 18 to pledge not to fund enforcement of these mandates?” Roy told Fox.",
    "The federal government’s current funding is slated to run out by February 18, meaning Congress has less than a month to reach an agreement or else trigger a partial shutdown of government operations.",
    "Via executive action, the Biden administration has imposed vaccination mandates for private employers with 100 or more workers, workers at federally-funded health centers, and federal workers.",
    "On Tuesday, the Occupational Safety & Health Administration (OSHA) formally withdrew the employer mandate while indicating that it will explore alternate methods to revive it.",
    "While shutdowns do entail temporary furloughs of federal employees and interruption of some functions, essential government services typically continue uninterrupted.",
    "The private employer and federal employee mandates are currently blocked by the courts, while the Supreme Court has allowed the health worker mandate to proceed.",
    "Many Americans continue to harbor serious reservations as to the new vaccines’ safety, stemming in large part from the rushed nature of their creation.",
    "The Moderna vaccine has been available throughout all of 2021; the Pfizer and Johnson & Johnson shots were made available in late February.",
    "“Will at least 10 of the 19 GOP senators who voted to punt last time now stand up for health care workers or not?",
    "Further, data indicates that widespread dissemination of the COVID vaccines has failed to end the pandemic."
  ]
}