{
  "id": 6835,
  "mediaId": 2730,
  "date": "2022-01-31",
  "headline": "House Republicans Demand DHS Release Long-Awaited Report on Agents Falsely Accused of 'Whipping' People",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/270/06746df3-5cd7-441d-8356-2ef8afb9034f.jpg",
  "link": "https://townhall.com/tipsheet/juliorosas/2022/01/31/house-republicans-demand-dhs-release-longawaited-report-on-agents-falsely-accused-of-whipping-n2602634",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julio Rosas",
  "authorUrl": "https://townhall.com/tipsheet/juliorosas/",
  "termIds": [
    1778,
    1866,
    2140,
    2277,
    2818,
    3975,
    4117,
    472,
    1131
  ],
  "sentences": [
    "The letter points out the claims were \"debunked by the photographer of the photo himself, the widespread narrative of whipping based on a demonstratable lie — especially by members of this administration — demands that the public record be finalized by publicly disclosing the 'investigative work' conducted by Custom and Border Protections’ (CBP) Office of Professional Responsibility (OPR).\"",
    "\"It has been more than four months since senior members of the Biden Administration, including President Biden and Press Secretary, Jen Psaki participated in a widely spread falsehood and accused United States Border Patrol agents of 'whipping”'Haitian migrants attempting to illegally cross into the United States near Del Rio, Texas on September 19, 2021,\" the letter states.",
    "Source: AP Photo/Felix Marquez\nA group of House Republicans sent a letter to Homeland Security Secretary Alejandro Mayorkas demanding the federal agency release the results of the internal investigation that was sparked by false accusations of Border Patrol agents on horseback \"whipping\" Haitians illegally crossing the southern border into Del Rio, Texas.",
    "It was reported that it now appears the results of the investigation into the false claims may not be publicly released after Mayorkas promised it would take weeks and not months to complete the inquiry:\n\"For four months, the Biden Administration and your Department have gone without even apologizing to the agents that were smeared.",
    "The same official went on to add that “they essentially convicted the mounted agents based upon a lie, which the investigation after 120 days would surely have revealed,' and, noting that no agent has been disciplined thus far, 'My experience would be that this would have been done within a period of weeks.'\"",
    "According to reports, one DHS official speaking under the condition of anonymity, said they 'doubt the current administration will release this report on the horse patrol incident because it makes the administration look terrible.'",
    "\"The American people deserve transparency from their government, and the United States Border Patrol deserves defense from their Department’s Secretary against unfounded accusations,\" the letter ends.",
    "The incident occurred at the same time thousands of Haitians were being housed under the international bridge in Del Rio because there was no room to put them anywhere else.",
    "The letter was signed by Reps. Chip Roy (TX), Brian Babin (TX), Andy Biggs (AZ), Scott Perry (PA), Mary Miller (IL), Michael Cloud (TX), and Darrell Issa (CA).",
    "To make matters worse, reports now indicate that the investigational report DHS was conducting on the incident will likely never appear."
  ]
}