{
  "id": 6838,
  "mediaId": 2694,
  "date": "2022-01-26",
  "headline": "Coup Nation",
  "image": "https://cdn.theatlantic.com/thumbor/pjD2ojDN6Tl9SHdV647DAOAuCgM=/0x43:2000x1085/1200x625/media/img/mt/2022/01/CoupNation/original.jpg",
  "link": "https://www.theatlantic.com/ideas/archive/2022/01/coup-nation-trump-january-6/621362/?utm_source=feed",
  "mediaOutlet": "The Atlantic",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David A. Graham",
  "authorUrl": "https://www.theatlantic.com/author/david-a-graham/",
  "termIds": [
    0
  ],
  "sentences": [
    "The government wasn’t toppled.” Former Vice President Mike Pence said in October that it was just “one day in January,” and accused the press of using that “one day to try and demean the character and intentions of 74 million Americans who believe we could be strong again and prosperous again and supported our administration in 2016 and 2020.” John Eastman, the author of a memo that laid out a strategy to steal the election in Congress, has on occasion disavowed his own work, telling National Review, “Anybody who thinks that that’s a viable strategy is crazy.”\nThese defenses are weak—true, the election was not overturned, but that was in fact the goal—and they are getting weaker each day.",
    "The new information is important because it once again underscores that the most dangerous parts of Trump’s election-fraud operation were not the ill-conceived riots but the legal machinations before and on January 6, what I’ve called the “paperwork coup.” Tying the fake electors to the Trump campaign and figures like Giuliani could help rectify the uncomfortable dynamic in which foot soldiers have been prosecuted while kingpins remain unscathed.",
    "The Post reports: “The campaign scrambled to help electors gain access to Capitol buildings, as is required in some states, and to distribute draft language for the certificates that would later be submitted to Congress, according to the former campaign officials and party leaders.” To their credit, some Republican would-be electors refused to go along with the scheme.",
    "The public has met a series of other players: Philip Waldron, an Army veteran turned cybersecurity investigator; the businessman Russell Ramsland; the Overstock.com founder Patrick Byrne; the professional bad penny Bernard Kerik; and members of Congress such as Representative Scott Perry of Pennsylvania.",
    "A total of 83 phony electors were submitted—and most electors are deeply involved in party politics at the local or state level, meaning these were not simply random Republican voters but seasoned political activists and operators.",
    "Each state submits a slate of electors corresponding to the candidate who won the state; the slate is certified by the state’s governor, and its votes are sent to Washington, D.C., where they are counted and certified by Congress.",
    "Now, however, the phony electors have become a focus for the House January 6 committee, The Washington Post reports, and the Justice Department is also reviewing the scheme, a top official told CNN.",
    "Prosecutors have also brought charges against people who they allege were involved in a January 6 conspiracy but were not present at the Capitol, instead waiting back as a secondary strike force.",
    "Instead, this seems to have been part of the Trump camp’s strategy of trying everything, seeing what stuck, and sowing enough confusion and havoc that the January 6 certification wouldn’t happen.",
    "In a couple of states, would-be electors signed ballots that they said were, in effect, provisional: If Trump’s election challenges prevailed, they were ready to become the legitimate electors.",
    "On the surface, the whole maneuver looks like the province of a few wild-eyed figures: Trump, Eastman, Giuliani, the attorneys Jenna Ellis and Sidney Powell, Jeffrey Clark, and Mike Lindell.",
    "As more information trickles out from the House January 6 panel, in court, and in press reports, one rattling revelation is just how many people were in on the coup attempt.",
    "After that, perhaps the House would have to elect the president, and because more delegations were controlled by Republicans, Trump could be installed for a second term.",
    "Among the new revelations is just how closely Trump-campaign officials and the president’s loyal but bumbling consigliere Rudy Giuliani were enmeshed in the ploy.",
    "The latest news concerns slates of phony electors who gathered in support of Trump in December 2020 in states with results that the president questioned.",
    "The plotters might have been grasping at straws, and they might have been ragtag and disorganized, but they were not just a handful of fringe actors.",
    "But others falsely presented their ballots to Congress and the National Archives as the rightful ones, which appears to be a violation of the law.",
    "Members of Congress who rejected all of it on January 7 are now mum at best and supportive at worst, led by House Minority Leader Kevin McCarthy.",
    "But when their effort inevitably flopped, they were mostly forgotten, and attention moved on to other aspects of the assault on the election.",
    "These phony electors planned to submit their own votes to Washington, even though they wouldn’t be certified by state authorities.",
    "Four in 10 Republicans believe that violence against the government is sometimes justified, according to a Washington Post poll.",
    "Photo collage images courtesy of Brent Stirton / Getty; Florian Gaertner / Getty; Spencer Platt / Getty; Roy Rochlin / Getty",
    "Like so much of the U.S. election regime, this is meant to be an arcane but routine process that achieves a simple result.",
    "The renewed attention to the phony electors also helps fill in the picture of how large the election-theft push was.",
    "After January 6, a bipartisan consensus formed against Trump and the coup attempt, but since then it has splintered.",
    "(Of the 83, 25 were in the two states—Pennsylvania and New Mexico—that submitted the phony slates provisionally.)",
    "As some would have it, former President Donald Trump’s attempt to steal the 2020 election was really no big deal.",
    "On top of that, of course, are the 2,000 to 2,500 people who officials believe entered the Capitol on January 6.",
    "Perhaps worst of all, the plotters seem to have gained, rather than lost, support since their plans unraveled.",
    "Pence was right to say that not all Trump voters were in the mob of those storming the Capitol on January 6.",
    "A minority of Republicans, across multiple polls, are willing to accept the results of the 2020 election.",
    "The scary thing is that as time goes on, more and more of them are joining its already numerous ranks.",
    "Or something like that; trying to understand the chaotic effort too concertedly is probably a mistake.",
    "“If you think about it, the presidential election was not overturned, the Capitol was not destroyed.",
    "Not a lot happened that day,” Tucker Carlson said on the anniversary of the insurrection.",
    "Congress was never going to accept the fake electors, either by mistake or by design.",
    "White House Chief of Staff Mark Meadows’s role was larger than initially understood.",
    "They met publicly and Trump-administration officials cheered them on in the press.",
    "Only about a quarter say that Trump bears most of the blame for the insurrection.",
    "The list of other participants in the broader effort has continued to grow too.",
    "Large swaths believe, falsely, that President Joe Biden won because of fraud.",
    "As more information emerges, though, the size of the front grows.",
    "Asking how this was supposed to work misses the point.",
    "Not coincidentally, this follows the general public.",
    "The phony electors were not a secret at the time.",
    "Nearly 800 of them have been charged with crimes.",
    "“January 6 barely rates as a footnote, really.",
    "But Trump loyalists saw in it an opportunity.",
    "They were a whole corps."
  ]
}