{
  "id": 6938,
  "mediaId": 2644,
  "date": "2022-01-29",
  "headline": "These woke pols want student loans forgiven — including their own",
  "image": "https://nypost.com/wp-content/uploads/sites/2/2022/01/stuent-debt-00.jpg?quality=75&strip=all&w=1024",
  "link": "https://nypost.com/2022/01/29/the-squad-want-student-loans-forgiven-including-theirs/",
  "mediaOutlet": "NY Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Conor Skelding",
  "authorUrl": "",
  "termIds": [
    1810,
    2021,
    2201,
    2430,
    877,
    1231,
    4887
  ],
  "sentences": [
    "“The important thing is that, number one, they made a commitment and, number two, [debt cancellation] would personally enrich them.”\n“What does it mean to all the people that struggled and made the commitment and honored their commitment?” said Perry, the chairman of the House Freedom Caucus, a veteran who worked his way through Pennsylvania State University.",
    "“The president has authority and the moral responsibility to cancel student debt right now,” Bowman, who has degrees from the University of New Haven, Mercy College and Manhattanville College, said on the House floor in December.",
    "“I certainly do think it presents a conflict of interest, and I don’t know how anybody can realistically … tell me how this is essentially different from insider trading,” Rep. Scott Perry (R-Pa.) told The Post.",
    "There are also many non-Squad legislators with outstanding loan balances: Reps. Jahana Hayes (D-Conn.) and Grace Meng (D-N.Y.) reported between $100,001 and $250,000 in debts, and Veronica Escobar (D-Tex.)",
    "“It definitely seems like a conflict of interest to me,” said Harmeet Dhillon, a California member of the Republican National Committee and former legal advisor to President Trump.",
    "Rep. Rashida Tlaib (D-Mich.) disclosed between $50,001 and $100,000 in law-school loans, according to her paperwork, from her time at Western Michigan University.",
    "Rep. Ilhan Omar (D-Minn.), a North Dakota State University graduate, reported between $15,001 and $50,000 in student loans, according to her most recent filing.",
    "Rep. Ocasio-Cortez had a balance of between $15,001 and $50,000 in federal student loans as of 2020, according to her most recent personal financial disclosure.",
    "Despite her $174,000 annual salary, the economics major hasn’t paid off her balance, despite a zero percent interest rate and no payments due since March 2020.",
    "Many of the woke politicians who have pushed for student-loan cancellation are themselves hip-deep in school debt, federal records reviewed by The Post show.",
    "Critics said student loans present a potential conflict for lawmakers in the ongoing debate whether federal loans should be reduced or forgiven.",
    "A group of legislators asked President Biden in a Jan. 25 letter to cancel up to $50,000 in student loans per borrower through executive action.",
    "Most members of “The Squad” — the coterie of socialist legislators led by Rep. Alexandria Ocasio-Cortez (D-N.Y.) — fall into this category.",
    "The president has so far balked at taking such a step, despite requesting a U.S. Department of Education memo legally justifying it.",
    "Rep. Jamaal Bowman (D-N.Y.), 45, has a loan balance between $100,001 and $250,000, according to his 2020 financial disclosure.",
    "And I didn’t go to graduate school because I knew that getting another degree would drown me in debt,” she said in December.",
    "“We have to stop treating… folks that are paying for education as if they bought some bougie car,” Tlaib said on the floor.",
    "Sen. Chris Murphy (D-Conn.) disclosed between $30,002 and $50,000 in loans for himself and his wife.",
    "Ocasio-Cortez is single, has no children, and is earning almost $200,000 in salary and benefits.",
    "She should be setting an example for her constituents and paying down her debts,” she added.",
    "Collectively, they owe between $180,004 and $400,000 in student loans, the records show.",
    "The daughter of a Westchester architect, AOC graduated from Boston University in 2011.",
    "Rep. Mondaire Jones (D-N.Y.) disclosed between $15,001 and $50,000.",
    "“I’m 32 years old now, I have over $17,000 in student loan debt.",
    "Other members of “The Squad” are in the same boat.",
    "between $75,005 and $250,000, records show.",
    "AOC didn’t return requests for comment.",
    "Additional reporting by Mary Kay Linge",
    "They didn’t return calls.",
    "“Rep."
  ]
}