[
  {
    "id": 5490,
    "mediaId": 2550,
    "date": "2022-02-02",
    "sentence": "Unfortunately, we are living in desperate times and the only way that Cheney and Kinzinger can survive is to do the right thing and bring criminal charges to light about the complicity and the possible conspiracy by Republicans like Ted Cruz, Josh Hawley, Louie Gohmert, Mo Brooks, Marjorie Taylor Greene, Lauren Boebert, Matt Gaetz, <span class='selected-term'>Paul Gosar</span>, and others, to overturn our democratically elected 46th President.",
    "author": "",
    "title": "Rep. Adam Kinzinger brings a bazooka to Josh Hawley's knife fight"
  },
  {
    "id": 5512,
    "mediaId": 2643,
    "date": "2022-02-02",
    "sentence": "Other GOP members have also previously spoken out against a potential U.S. military intervention over the Russia-Ukraine situation, including Congressmen <span class='selected-term'>Paul Gosar</span> and Thomas Massie of Arizona and Kentucky respectively.",
    "author": "Adam Staten",
    "title": "Kinzinger Blasts Josh Hawley for Urging Biden to Drop Support to Ukraine"
  },
  {
    "id": 5546,
    "mediaId": 2664,
    "date": "2022-02-04",
    "sentence": "\"Nor was there even the slightest suggestion that perhaps the party should distance itself from the bizarre bigoted rantings of [Marjorie Taylor Greene] (R-GA), or <span class='selected-term'>Paul Gosar</span> (R-AZ), or Lauren Boebert (R-CO), or Madison Cawthorn (R-NC),\" he wrote.",
    "author": "Bob Brigham",
    "title": "RNC has ‘gone all-in on the insurrection’ while excusing ‘bigoted rantings’: Charlie Sykes"
  },
  {
    "id": 5575,
    "mediaId": 2550,
    "date": "2022-02-07",
    "sentence": "A big part of this play is that Kinzinger, along with neo-conservatives like Rep. Liz Cheney, are battling to regain control over a political party now inundated with more flagrantly corrupt, more flagrantly authoritarian, and more flagrantly incompetent officials like Sen. Josh Hawley and Reps. Madison Cawthorn, Lauren Boebert, and <span class='selected-term'>Paul Gosar</span> ascending to prominence.",
    "author": "",
    "title": "Adam Kinzinger has a lot to say: Donald Trump ‘is the worst president the U.S. ever had’"
  },
  {
    "id": 5838,
    "mediaId": 2699,
    "date": "2022-02-09",
    "sentence": "Those are the acceptable sins, respectively, of Reps. Marjorie Taylor Greene, Lauren Boebart, Matt Gaetz, and <span class='selected-term'>Paul Gosar</span>.",
    "author": "Wajahat Ali",
    "title": "Sorry, Mitch McConnell. Frankenstein’s Monster Runs the GOP Now"
  },
  {
    "id": 5896,
    "mediaId": 2699,
    "date": "2022-02-09",
    "sentence": "Nine other candidates are in the race, but the only one with significant resources is another veteran, Jonathan Hullihan, who touts the backing of far-right Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ).",
    "author": "Sam Brodey",
    "title": "The Drama in This Crazy Texas Primary Explains Trump’s GOP"
  },
  {
    "id": 5503,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "Rep. Adam Kinzinger (R-IL) said that the Republican Party, and leaders like Kevin McCarthy (R-CA) now answer to people like Marjorie Taylor Greene (R-GA), <span class='selected-term'>Paul Gosar</span> (R-AZ) and Lauren Boebert (R-CO).",
    "author": "Sarah K. Burris",
    "title": "Adam Kinzinger trashes Kevin McCarthy: He's beholden to Marjorie Taylor Greene and Paul Gosar"
  },
  {
    "id": 4250,
    "mediaId": 2521,
    "date": "2022-02-26",
    "sentence": "Cheney commented that as “Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Caleb Newton",
    "title": "Kinzinger Hits Marjorie Greene For Headlining White Supremacist Event"
  },
  {
    "id": 4378,
    "mediaId": 2619,
    "date": "2022-02-27",
    "sentence": "In a tweet Saturday, Rep. Liz Cheney, who has faced intraparty censure in her home state of Wyoming over her criticism of former President Donald Trump, blasted their speaking appearance: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Mike Murphy",
    "title": "‘Morons’: Romney, Cheney, Kinzinger condemn fellow Republicans for speaking at white nationalist event"
  },
  {
    "id": 3828,
    "mediaId": 2594,
    "date": "2022-02-27",
    "sentence": "Another Republican who herself has faced censure by the national Republican Party for her participation in the January 6 investigation, Liz Cheney, also aimed fire at Ms Greene: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "John Bowden",
    "title": "Romney calls Marjorie Taylor Greene a ‘moron’ as moderates demand party ditch ‘Putin wing of GOP’"
  },
  {
    "id": 3657,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "On one side you have the Trump/MAGA/tea party wing of the GOP, filled with detestable folks like Reps. Lauren Boebert, Matt Gaetz, Madison Cawthorn, <span class='selected-term'>Paul Gosar</span>, and Marjorie Taylor Greene.",
    "author": "",
    "title": "War in the GOP: Have Marjorie Taylor Greene and Paul Gosar made one too many mistakes?"
  },
  {
    "id": 3785,
    "mediaId": 6656,
    "date": "2022-03-02",
    "sentence": "Out of 429 voting members, three lawmakers -- all Republicans -- voted against affirming the resolution on Wednesday: Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana.",
    "author": "Calley Hair",
    "title": "U.S. House passes resolution declaring support for Ukraine"
  },
  {
    "id": 4011,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "Although the resolution passed by an overwhelming majority, three House Republicans voted against it: Reps. <span class='selected-term'>Paul Gosar</span> (R-AZ), Thomas Massie (R-KY), and Matt Rosendale (R-MT).",
    "author": "Brad Reed",
    "title": "'Unreal': Adam Kinzinger slams three GOP colleagues who voted against resolution supporting Ukrainian people"
  },
  {
    "id": 3919,
    "mediaId": 2614,
    "date": "2022-03-03",
    "sentence": "One of the three Republicans in question, Rep. <span class='selected-term'>Paul Gosar</span>, delivered a clapback to Rep. Kinzinger that reiterated his America first stance.",
    "author": "Red Voice Media",
    "title": "Rep Gosar Owns RINO Kinzinger For Crying On Twitter Over Ukraine Support Resolution Vote Differences"
  },
  {
    "id": 3680,
    "mediaId": 2550,
    "date": "2022-03-04",
    "sentence": "— Adam Kinzinger (@AdamKinzinger) March 2, 2022\nx\nDear Gosar, Rosendale, and Massie, you are not anti-war: https://t.co/U0XK7Szp9N\n— Adam Kinzinger (@AdamKinzinger) March 2, 2022\nx\n<span class='selected-term'>Paul Gosar</span> joins with two other Republicans to vote no on a resolution supporting the people of Ukraine pic.twitter.com/7WZM4CFyuz\n— Acyn (@Acyn) March 2, 2022\nx\nFascist pro-Putin MAGA traitors Paul Gosar, Thomas Massie, & Matt Rosendale just voted against a resolution to help the people of Ukraine.",
    "author": "",
    "title": "Disgust abounds after three House Republicans vote no on resolution supporting Ukraine"
  },
  {
    "id": 3575,
    "mediaId": 2911,
    "date": "2022-03-14",
    "sentence": "The Senate has also censured nine of its own members, and in 2021, the U.S. House of Representatives censured its 24th member, Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, for, among other things, posting an anime video of himself killing a fellow member.",
    "author": "Seth Masket",
    "title": "How An Uptick In Censures Among Local Republicans Signals A Growing Radicalism"
  },
  {
    "id": 2021,
    "mediaId": 2512,
    "date": "2022-03-21",
    "sentence": "The party offered no public condemnation of Representatives Majorie Taylor Greene (R-Georgia) and <span class='selected-term'>Paul Gosar</span> (R-Arizona) participating in a White nationalist conference in late February.",
    "author": "Brandon Gage",
    "title": "North Carolina paper slams GOP for coddling party’s fringe — and handing them ‘the tools to dismantle democracy’"
  },
  {
    "id": 1348,
    "mediaId": 2808,
    "date": "2022-04-07",
    "sentence": "By contrast, Democrats have utterly failed to elevate the profiles of sinister figures like Reps. <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene, Madison Cawthorn or Lauren Boebert.",
    "author": "Mona Charen",
    "title": "Democrats need to get better at politics, fast"
  },
  {
    "id": 851,
    "mediaId": 2629,
    "date": "2022-04-10",
    "sentence": "By contrast, Democrats have utterly failed to elevate the profiles of sinister figures like Reps. <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene, Madison Cawthorn or Lauren Boebert.",
    "author": "",
    "title": "Democrats Need To Get Better At Politics, And Fast"
  }
]