[
  {
    "id": 3968,
    "mediaId": 2621,
    "date": "2022-02-25",
    "sentence": "In 2021, Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) of Arizona gave the keynote address.",
    "author": "Michael Luciano",
    "title": "Marjorie Taylor Greene Speaks at White Nationalist Conference Where Crowd Cheers Russia and Host Praises Hitler"
  },
  {
    "id": 4010,
    "mediaId": 2643,
    "date": "2022-02-26",
    "sentence": "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\n\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" the Wyoming congresswoman wrote in a Twitter post, including a video of Fuentes' remarks.",
    "author": "Jason Lemon",
    "title": "Cheney Rips GOP Silence Over Greene, Gosar Joining 'White Supremacist' Event"
  },
  {
    "id": 4316,
    "mediaId": 2640,
    "date": "2022-02-27",
    "sentence": "GOP Rep. Liz Cheney, who's on the outs with her party, denounced Greene and Arizona Rep. <span class='selected-term'>Paul Gosar</span>, who spoke to the America First meeting virtually.",
    "author": "Bob Cronin",
    "title": "Greene Hears From McDaniel About America First Speech"
  },
  {
    "id": 3665,
    "mediaId": 2550,
    "date": "2022-02-28",
    "sentence": "x\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "",
    "title": "Abbreviated Pundit Roundup: This is the dangerous part (Putin losing)"
  },
  {
    "id": 3705,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "This is the same event that prompted GOP leadership to make some attempts at condemning how overtly antisemitic and racist some of its shiniest scam artists stars like Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene are.",
    "author": "",
    "title": "Idaho's lieutenant governor wants you to know she doesn’t agree with antisemites, just their ideas"
  },
  {
    "id": 4128,
    "mediaId": 2643,
    "date": "2022-03-01",
    "sentence": "Rogers' censure follows rebukes by national Republican leaders against U.S. GOP Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona who also spoke at the conference.",
    "author": "Daniel Villarreal",
    "title": "GOP Senators Censure Colleague for Speaking at White Nationalist Conference"
  },
  {
    "id": 4508,
    "mediaId": 5308,
    "date": "2022-03-02",
    "sentence": "In addition to Rogers, two current members of Congress, Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, spoke at the conference.",
    "author": "Paul Blest",
    "title": "Republicans Have Finally Had Enough of Wendy Rogers"
  },
  {
    "id": 4057,
    "mediaId": 2644,
    "date": "2022-03-04",
    "sentence": "“Or is that only for Representatives who tweet cartoons or had a spicy Facebook post before they were an elected official?” added Kent, referring to House disciplinary actions taken against Greene and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.).",
    "author": "Callie Patteson",
    "title": "Lindsey Graham doubles down on call for Vladimir Putin’s assassination"
  },
  {
    "id": 2791,
    "mediaId": 2550,
    "date": "2022-03-07",
    "sentence": "That’s the same conference where Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> also spoke, prompting Republican Sen. Mitt Romney to call them “morons.”\nHere’s the complete video of Putin’s bizarre event.",
    "author": "Charles Jay\nCommunity",
    "title": "may idolize Vlad, but the feeling isn't mutual"
  },
  {
    "id": 2958,
    "mediaId": 2594,
    "date": "2022-03-09",
    "sentence": "Speaking at a news conference on Wednesday, Mr McCarthy confirmed to reporters that Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> still had avenues to returning to active roles on House panels even after they were both publicly chastised for attending an event billed as a far-right alternative to the Conservative Political Action Conference (CPAC) hosted by a semi-famous white nationalist, Nick Fuentes.",
    "author": "John Bowden",
    "title": "Kevin McCarthy dodges question on repercussions for Marjorie Taylor Greene again"
  },
  {
    "id": 3252,
    "mediaId": 5308,
    "date": "2022-03-10",
    "sentence": "While Republican congressional leaders condemned the invasion, Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene both spoke at a white nationalist conference last month whose organizer favorably compared Russian President Vladimir Putin to Adolf Hitler.",
    "author": "Paul Blest",
    "title": "GOP Rep. Madison Cawthorn Called President Zelenskyy a ‘Thug’"
  },
  {
    "id": 2627,
    "mediaId": 2741,
    "date": "2022-03-29",
    "sentence": "So we thought it was time to start a list of all the things McCarthy has had to pull a lawmaker aside for:\nThe time Representative <span class='selected-term'>Paul Gosar</span> made and disseminated a video depicting him swinging a sword at Joe Biden’s head and decapitating Alexandria Ocasio-Cortez (McCarthy told CNN he spoke to Gosar, without condemning Gosar’s behavior)\nThe time Representative Marjorie Taylor Greene called for Nancy Pelosi to be executed for treason, harassed a school-shooting survivor on the street, blamed the California wildfires on Jewish laser beams, and espoused the ideas of QAnon (McCarthy refused to discipline the congresswoman and claimed that, during a private conversation, she “recognized” that she needed to hold herself to a higher standard)\nThe time Greene spoke at a white nationalist conference (McCarthy admitted this was bad but, following a conversation with Greene, declined to hold her accountable, saying, “my conversations with my members are exactly that.”)\nThe time Representative Lauren Boebert made Islamophobic comments about Representative Ilhan Omar (McCarthy obviously refused to condemn her but, rest assured, they had a chat!)",
    "author": "Bess Levin",
    "title": "Orgies, Beheadings, Jewish Space Lasers: Everything Kevin McCarthy Has Had to “Speak” to Republican Lawmakers About"
  },
  {
    "id": 1719,
    "mediaId": 2634,
    "date": "2022-04-06",
    "sentence": "That’s the case with another charter member, Representative <span class='selected-term'>Paul Gosar</span>, who posted an animated video of himself killing Representative Alexandria Ocasio-Cortez.",
    "author": "Timothy Noah",
    "title": "Steve Bannon Said Trump Reminded Him of Hitler. He Meant It as a Compliment."
  },
  {
    "id": 1714,
    "mediaId": 2676,
    "date": "2022-04-06",
    "sentence": "UPDATE: A representative of Congressman <span class='selected-term'>Paul Gosar</span>'s campaign spoke with the Arizona Mirror after publication of their story to say the congressman would not be attending the white nationalist group's event on April 20.",
    "author": "Kelly McClure",
    "title": "GOP Rep. Paul Gosar promoted appearance at white nationalist event, but now says he is not attending"
  },
  {
    "id": 1204,
    "mediaId": 2664,
    "date": "2022-04-06",
    "sentence": "Prescott Republican Congressman <span class='selected-term'>Paul Gosar</span> was listed as a “special guest” with the white nationalist American Populist Union at an event that will be on a date popular among white nationalists and Neo-Nazis: Hitler’s birthday.",
    "author": "",
    "title": "UPDATE: Paul Gosar promoted appearing at a white nationalist social gathering on Hitler’s birthday -- but his campaign says he isn’t"
  },
  {
    "id": 1253,
    "mediaId": 2590,
    "date": "2022-04-07",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> was reportedly scheduled to attend a far-right conference with ties to white nationalists the day of Adolf Hitler’s birthday before his campaign appeared to back out.",
    "author": "Sebastian Murdock",
    "title": "Rep. Paul Gosar Was Scheduled To Attend Far-Right Event On Hitler's Birthday: Report"
  },
  {
    "id": 1783,
    "mediaId": 2627,
    "date": "2022-04-07",
    "sentence": "Arizona’s extremist Rep. <span class='selected-term'>Paul Gosar</span> has found himself at the center of a controversy involving white nationalists again.",
    "author": "Ja'han Jones",
    "title": "Gosar promotes white nationalist event on Hitler's birthday"
  },
  {
    "id": 1496,
    "mediaId": 2738,
    "date": "2022-04-07",
    "sentence": "Arizona Rep. <span class='selected-term'>Paul Gosar</span> chose the latter.",
    "author": "Jennifer Wood",
    "title": "Rep. Paul Gosar Was Planning To Celebrate Hitler’s Birthday At A White Nationalist Bash, But Has Since Backed Out"
  },
  {
    "id": 1163,
    "mediaId": 2512,
    "date": "2022-04-08",
    "sentence": "Telegram is a conspiracy & white nationalist fantasy land\\u2014that\\u2019s where Gosar hangs evidently.\\n\\nA dangerous time.pic.twitter.com/KNFe8otj31\n— Denver Riggleman (@Denver Riggleman) 1624929656\nHere's another bit from the Nick Fuentes speech at AFPAC, delivered right after Rep. <span class='selected-term'>Paul Gosar</span> got off the stage.",
    "author": "Alex Henderson",
    "title": "Paul Gosar just can’t stay away from white nationalists: journalist"
  }
]