[
  {
    "id": 7161,
    "mediaId": 6502,
    "date": "2022-01-06",
    "sentence": "Lawmakers including Georgia Rep. Marjorie Taylor Greene and Arizona Rep. <span class='selected-term'>Paul Gosar</span> have spoken out on the matter:\n.",
    "author": "Steve Watson",
    "title": "AP Declares Mistreatment Of Jan 6th Prisoners Is A 'Conspiracy Theory'"
  },
  {
    "id": 6494,
    "mediaId": 2512,
    "date": "2022-01-19",
    "sentence": "Trump’s recent rally in Arizona featured a who’s-who of unhinged conspiracy theorists, including MyPillow CEO Mike Lindell, Rep. <span class='selected-term'>Paul Gosar</span> and Arizona gubernatorial candidate Kari Lake.",
    "author": "Alex Henderson",
    "title": "How 'wacko' conspiracy extremists are driving the 'radicalization' of the Republican Party: conservatives"
  },
  {
    "id": 6587,
    "mediaId": 2690,
    "date": "2022-01-22",
    "sentence": "Among the many speakers at President Trump’s Florence, AZ, rally were MyPillow CEO and fervent Trump supporter Mike Lindell, Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) and Arizona state lawmaker Wendy Rogers.",
    "author": "",
    "title": "Steve Bannon Drops Bombshell: Trump’s AZ Rally Is The Beginning Of 2020 Election ‘Decertification Process’"
  },
  {
    "id": 7026,
    "mediaId": 2729,
    "date": "2022-01-23",
    "sentence": "“That election was rotten to the core,” Congressman <span class='selected-term'>Paul Gosar</span> told the crowd.",
    "author": "Towleroad",
    "title": "Election fraud belief undimmed for Trump fans, despite party hopes"
  },
  {
    "id": 6691,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "\"Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "John Wright",
    "title": "Madison Cawthorn case could spell trouble for other ‘insurrectionists’ — including Trump: report"
  },
  {
    "id": 6896,
    "mediaId": 2584,
    "date": "2022-01-26",
    "sentence": "Once fringe, now dominant in the party, rightwing Republicans are strategizing for minoritarian rule\nThe Arizona Republican congressman <span class='selected-term'>Paul Gosar</span> had a simple message for the crowd when he recently addressed a packed Donald Trump rally in his home state – a gathering that had focused on promoting the baseless lie that Trump had been cheated out of a second term as president.",
    "author": "Sergio Olmos",
    "title": "‘The most dangerous man in Congress’: how Paul Gosar became a darling of the far right"
  },
  {
    "id": 6490,
    "mediaId": 2512,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 6414,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 6417,
    "mediaId": 2512,
    "date": "2022-01-27",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> of Arizona speaking at the 2018 Arizona Manufacturing Summit, hosted by the Arizona Manufacturing Council and the Arizona Chamber of Commerce & Industry at the Renaissance Downtown Hotel in Phoenix, Gage Skidmore.",
    "author": "Meaghan Ellis",
    "title": "How Paul Gosar emerged as a far-right favorite and subsequently the 'most dangerous man in Congress’"
  },
  {
    "id": 6450,
    "mediaId": 2664,
    "date": "2022-01-27",
    "sentence": "(Biggs, along with fellow Arizona congressman, Rep. <span class='selected-term'>Paul Gosar</span>, and Rep. Mo Brooks (R-Ala.) worked with #StopTheSteal organizer Ali Alexander to pressure lawmakers to overturn the 2020 election results during the Jan. 6, 2021 joint session, according to a statement by Alexander in a now-deleted video).",
    "author": "Jordan Green",
    "title": "REVEALED: Trump-anointed Arizona candidate has questionable ties to the Bundys, the Oath Keepers and the controversial 'Constitutional Sheriffs'"
  },
  {
    "id": 5566,
    "mediaId": 2662,
    "date": "2022-02-04",
    "sentence": "— <span class='selected-term'>Paul Gosar</span> (@DrPaulGosar) February 4, 2022",
    "author": "Jordan Conradson",
    "title": "YES! Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “We Need To Sue The Federal Government For Failing To Protect Us” (VIDEO)"
  },
  {
    "id": 5509,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "— <span class='selected-term'>Paul Gosar</span> (@DrPaulGosar) February 4, 2022\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nLake then called out Never-Trumper Bill Kristol, who appears to be barfing over these numbers.",
    "author": "Jordan Conradson",
    "title": "Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake Thrashes Turncoat RINO Bill Kristol Then Eats His Lunch"
  },
  {
    "id": 5492,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "She also currently works for Republican Congressman <span class='selected-term'>Paul Gosar</span> of Arizona, helping to produce his ‘Gosar Minute’ segments.",
    "author": "Jordan Conradson",
    "title": "Radical Leftists Attack And Harass Congressman Paul Gosar’s Intern Faith Graham On Campus At American University — Car Vandalized MULTIPLE TIMES"
  },
  {
    "id": 5730,
    "mediaId": 2629,
    "date": "2022-02-11",
    "sentence": "Last November, staffers for Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) posted an \"anime\"-style video showing him decapitating Rep. Alexandria Ocasio-Cortez (D-NY) and attacking Biden with swords.",
    "author": "Josh Israel",
    "title": "Arizona GOP Candidate Posts Video Threatening To Shoot Democrats"
  },
  {
    "id": 5805,
    "mediaId": 2584,
    "date": "2022-02-11",
    "sentence": "Last November, <span class='selected-term'>Paul Gosar</span>, Republican representative for Arizona, was officially censured by the House after sharing an animated video depicting him killing the Democratic congresswoman Alexandria Ocasio-Cortez and attacking Biden.",
    "author": "Gloria Oladipo",
    "title": "‘Disgusting’: Republican Senate hopeful condemned over ‘showdown’ TV ad"
  },
  {
    "id": 5825,
    "mediaId": 2512,
    "date": "2022-02-11",
    "sentence": "Last November, <span class='selected-term'>Paul Gosar</span>, Republican representative for Arizona, was officially censured by the House after sharing an animated video depicting him killing the Democratic Congresswoman Alexandria Ocasio-Cortez and attacking Biden.”\nShannon Watts, founder of the group Moms Demand Action for Gun Sense in America, slammed the ad as “disgusting”:\nDISGUSTING: Former Rep. Gabby Giffords was shot and and seriously wounded 10 years ago.",
    "author": "Alex Henderson",
    "title": "Arizona Republican Senate hopeful slammed as 'disgusting' for violent campaign ad"
  },
  {
    "id": 5007,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "The 2021 America First Political Action Conference was addressed by Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ).",
    "author": "Bob Brigham",
    "title": "Arizona Republican hyping far-right event featuring notorious white nationalist: report"
  },
  {
    "id": 4788,
    "mediaId": 2699,
    "date": "2022-02-16",
    "sentence": "Last year, U.S. Rep <span class='selected-term'>Paul Gosar</span> (R-AZ) delivered the event’s keynote address.",
    "author": "Kelly Weill",
    "title": "Arizona Politician Promotes Far-Right Event Featuring Hanukkah-Basher"
  },
  {
    "id": 4582,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "\"Arizona’s Rep. <span class='selected-term'>Paul Gosar</span> opened for Fuentes at last year’s AFPAC conference and has continued to root for the young white nationalist.",
    "author": "Bob Brigham",
    "title": "Arizona Republicans are flocking to attend white nationalist Nick Fuentes’ far-right conference: report"
  },
  {
    "id": 3931,
    "mediaId": 2664,
    "date": "2022-02-27",
    "sentence": "Arizona Congressman <span class='selected-term'>Paul Gosar</span>, a Republican from Prescott, gave a brief video address, a far cry from last year, when he was the featured speaker.",
    "author": "Jim Small",
    "title": "Arizona Republican said white nationalists are ‘patriots’ and called for hanging political enemies"
  },
  {
    "id": 3927,
    "mediaId": 2621,
    "date": "2022-03-01",
    "sentence": "In addition to Rogers, who is expected to be censured by the Arizona State Senate, Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) appeared at AFPAC.",
    "author": "Jackson Richman",
    "title": "Arizona Republican Posted Anti-Semitic Photoshop Before Speaking at White Nationalist Event"
  },
  {
    "id": 4094,
    "mediaId": 2621,
    "date": "2022-03-01",
    "sentence": "GOP Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene also spoke at his controversial conference over the weekend.",
    "author": "Alex Griffing",
    "title": "GOP-Controlled AZ Senate Censures Trump-Backed Republican Lawmaker Wendy Rogers"
  },
  {
    "id": 3661,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "Besides Rogers, other Republicans such as Congressman <span class='selected-term'>Paul Gosar</span> of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "author": "David Neiwert",
    "title": "White nationalists flaunt their traction within Republican Party at annual gathering in Florida"
  },
  {
    "id": 4128,
    "mediaId": 2643,
    "date": "2022-03-01",
    "sentence": "Rogers' censure follows rebukes by national Republican leaders against U.S. GOP Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona who also spoke at the conference.",
    "author": "Daniel Villarreal",
    "title": "GOP Senators Censure Colleague for Speaking at White Nationalist Conference"
  },
  {
    "id": 4508,
    "mediaId": 5308,
    "date": "2022-03-02",
    "sentence": "In addition to Rogers, two current members of Congress, Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, spoke at the conference.",
    "author": "Paul Blest",
    "title": "Republicans Have Finally Had Enough of Wendy Rogers"
  },
  {
    "id": 3639,
    "mediaId": 2572,
    "date": "2022-03-02",
    "sentence": "The three no votes were Republican Reps. Thomas Massie of Kentucky, Matt Rosendale of Montana and <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Marisa Schultz",
    "title": "House passes resolution in support of Ukraine amid 'full-scale' Russian invasion"
  },
  {
    "id": 3669,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "While Lake did not respond to questions about Rogers, she has not distanced herself from Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who spoke at the same Nick Fuentes' white nationalist America First Political Action Conference in Florida.",
    "author": "Bob Brigham",
    "title": "Censured Republican is so toxic she’s become an issue in Arizona governor’s race: report"
  },
  {
    "id": 3878,
    "mediaId": 2547,
    "date": "2022-03-02",
    "sentence": "Besides Rogers, other Republicans such as Congressman <span class='selected-term'>Paul Gosar</span> of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "author": "David Neiwert",
    "title": "Neo-Nazi Nick Fuentes Is Gloating About Taking Over The GOP"
  },
  {
    "id": 3785,
    "mediaId": 6656,
    "date": "2022-03-02",
    "sentence": "Out of 429 voting members, three lawmakers -- all Republicans -- voted against affirming the resolution on Wednesday: Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana.",
    "author": "Calley Hair",
    "title": "U.S. House passes resolution declaring support for Ukraine"
  },
  {
    "id": 4117,
    "mediaId": 2664,
    "date": "2022-03-05",
    "sentence": "Also in attendance was Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who received widespread condemnation for attending a white nationalist conference the previous weekend.",
    "author": "Bob Brigham",
    "title": "WATCH: Mike Lindell sells a GOP candidate — and his pillows — at Arizona rodeo"
  },
  {
    "id": 3104,
    "mediaId": 2746,
    "date": "2022-03-07",
    "sentence": "Mr. Ryder told The Associated Press that the tweet was a reaction to Mr. Johnson’s November 2021 House vote against censuring fellow Republican Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Kerry Picket",
    "title": "Offensive tweets force South Dakota Democrat out of House race after one day"
  },
  {
    "id": 3135,
    "mediaId": 2740,
    "date": "2022-03-09",
    "sentence": "The report outlines how right-wing figures like Fox News personality Tucker Carlson and elected officials like U.S. Rep. Matt Gaetz, R-Fla., have promoted white supremacist conspiracy theories like the \"great replacement\" myth, while others – including former President Donald Trump and Republican U.S. Reps. <span class='selected-term'>Paul Gosar</span> of Arizona and Madison Cawthorn of North Carolina – have normalized threats and the use of violence as a political tool.",
    "author": "N'dea Yancey-Bragg",
    "title": "Hate groups declined in 2021, but fringe ideology is a 'powerful force' shaping US politics, SPLC warns"
  },
  {
    "id": 3078,
    "mediaId": 2643,
    "date": "2022-03-10",
    "sentence": "The Republicans voting against the energy ban were Andy Biggs of Arizona, Dan Bishop of North Carolina, Lauren Boebert of Colorado, Madison Cawthorn of North Carolina, Scott DesJarlais of Tennessee, Matt Gaetz of Florida, Louie Gohmert of Texas, <span class='selected-term'>Paul Gosar</span> of Arizona, Marjorie Taylor Greene of Georgia, Glenn Grothman of Wisconsin, Clay Higgins of Louisiana, Bill Posey of Florida, Chip Roy of Texas and Tom Tiffany of Wisconsin.",
    "author": "Darragh Roche",
    "title": "Full List of 17 Lawmakers Who Voted Against Russian Oil Ban"
  },
  {
    "id": 2773,
    "mediaId": 2664,
    "date": "2022-03-10",
    "sentence": "A newly released report by the Southern Poverty Law Center details extremism in 2021 — and how elected officials like U.S. Rep. <span class='selected-term'>Paul Gosar</span> helped white nationalists and hate groups move their views into the mainstream.",
    "author": "",
    "title": "White nationalism began to take a foothold in the mainstream in 2021 -- and Arizona helped"
  },
  {
    "id": 3575,
    "mediaId": 2911,
    "date": "2022-03-14",
    "sentence": "The Senate has also censured nine of its own members, and in 2021, the U.S. House of Representatives censured its 24th member, Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, for, among other things, posting an anime video of himself killing a fellow member.",
    "author": "Seth Masket",
    "title": "How An Uptick In Censures Among Local Republicans Signals A Growing Radicalism"
  },
  {
    "id": 3238,
    "mediaId": 2676,
    "date": "2022-03-16",
    "sentence": "Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> or Arizona will not be punished for their participation in a white nationalist conference, according to House Republican leader Kevin McCarthy.",
    "author": "Madeleine Beck",
    "title": "Kevin McCarthy quietly gets away with holding Republicans to a lower standard than Donald Trump"
  },
  {
    "id": 2729,
    "mediaId": 2548,
    "date": "2022-03-22",
    "sentence": "An image shared on Instagram purportedly shows a tweet from Republican Arizona Rep. <span class='selected-term'>Paul Gosar</span> about being called a “moron.”\nVerdict: False\nThe tweet has been digitally fabricated.",
    "author": "",
    "title": "FACT CHECK: Did Paul Gosar Send This Tweet About Being Called A ‘Moron’?"
  },
  {
    "id": 1941,
    "mediaId": 3997,
    "date": "2022-03-22",
    "sentence": "An image shared on Instagram purportedly shows a tweet from Republican Arizona Rep. <span class='selected-term'>Paul Gosar</span> about being called a “moron.”\nVerdict: False\nThe tweet has been digitally fabricated.",
    "author": "Hannah Hudnall",
    "title": "FACT CHECK: Did Paul Gosar Send This Tweet About Being Called A ‘Moron’?"
  },
  {
    "id": 2014,
    "mediaId": 2512,
    "date": "2022-03-24",
    "sentence": "If the 2022 midterms see a major red wave, even the most extreme MAGA Republicans are likely to be reelected to the U.S. House of Representatives — including Rep. Marjorie Taylor Greene of Georgia, Rep. Lauren Boebert of Colorado, Rep. Matt Gaetz of Florida and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Alex Henderson",
    "title": "How Madison Cawthorn may have doomed his reelection campaign"
  },
  {
    "id": 2363,
    "mediaId": 2526,
    "date": "2022-03-26",
    "sentence": "Kelly reportedly took in more than $55,000 in contributions during the last fundraising quarter of 2021 from “PACs of corporate trade groups and the Senate leadership committees of many of his fellow Democrats.”\nIn 2021, he also took heat from the Arizona Republican Party chair Kelli Ward, Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), and the National Republican Senatorial Committee (NRSC) for being “missing in action” and for the lack of leadership the freshman member has in the Senate.",
    "author": "Jacob Bliss",
    "title": "Poll: Democrat Mark Kelly Trails Generic Republican in AZ Senate Race"
  },
  {
    "id": 1388,
    "mediaId": 2676,
    "date": "2022-04-04",
    "sentence": "After weeks of avoiding the subject, Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz., is now blaming his own staff over his appearance at a white nationalist conference, claiming that \"there was a miscommunication.\"",
    "author": "Jon Skolnik",
    "title": "Paul Gosar blames staff for his appearance at white nationalist conference for the second year"
  },
  {
    "id": 945,
    "mediaId": 2512,
    "date": "2022-04-05",
    "sentence": "After weeks of avoiding the subject, Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz., is now blaming his own staff over his appearance at a white nationalist conference, claiming that \"there was a miscommunication.\"",
    "author": "Jon Skolnik",
    "title": "Paul Gosar blames staff for his appearance at white nationalist conference after attending same event last year"
  },
  {
    "id": 972,
    "mediaId": 2636,
    "date": "2022-04-07",
    "sentence": "In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives <span class='selected-term'>Paul Gosar</span> and Andy Biggs and State Representative Mark Finchem, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement.",
    "author": "",
    "title": "Legal Effort Expands to Disqualify Republicans as ‘Insurrectionists’"
  },
  {
    "id": 1409,
    "mediaId": 2741,
    "date": "2022-04-07",
    "sentence": "Arizona conservative representative <span class='selected-term'>Paul Gosar</span> is once again attempting to brush off ties to far-right organizations.",
    "author": "Caleb Ecarma",
    "title": "Déjà Vu: House Republican Paul Gosar Was Tied to Yet Another Far-Right Event"
  },
  {
    "id": 1234,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "Now Reps. Andy Biggs (R-AZ) and <span class='selected-term'>Paul Gosar</span> (R-AZ) are getting the same challenge.",
    "author": "Sarah K. Burris",
    "title": "Two more GOP ‘insurrectionists’ face ballot challenges as voters seek to disqualify them from office"
  },
  {
    "id": 114,
    "mediaId": 2550,
    "date": "2022-04-09",
    "sentence": "Arizona Rep. <span class='selected-term'>Paul Gosar</span>, whom God created to conclusively disprove white supremacy, is trying to explain away his video appearance at shrieking anti-Semite Nick Fuentes’ white power-palooza carnival in February, and that explanation is just as craven as you might imagine.",
    "author": "",
    "title": "Paul Gosar explains yet another appearance at a white nationalist conference by blaming his staff"
  }
]