[
  {
    "id": 2794,
    "mediaId": 2526,
    "date": "2022-03-08",
    "sentence": "[Emphasis added]\nReps. Andy Biggs (R-AZ), Bob Good (R-VA), Matt Gaetz (R-FL), <span class='selected-term'>Paul Gosar</span> (R-AZ), Jody Hice (R-GA), Mary Miller (R-IL), Ralph Norman (R-SC), Bill Posey (R-FL), and Randy Weber (R-TX) are co-sponsoring the legislation.",
    "author": "John Binder",
    "title": "Matt Rosendale: No Taxpayer Money for Ukraine Until Border Wall Is Done"
  },
  {
    "id": 3060,
    "mediaId": 2641,
    "date": "2022-03-08",
    "sentence": "Rosendale wrote on Twitter that “the American people are sick and tired of career politicians consistently putting the interests of foreign nations above our own, we must put America first.”\nLast month, Rosendale introduced the “Secure America’s Borders First Act.”\nAccording to Breitbart, Rosendale’s bill, which is co-sponsored by Reps. Andy Biggs, R-Ariz., Bob Good, R-Va., Matt Gaetz, R-Fla., <span class='selected-term'>Paul Gosar</span>, R-Ariz., Jody Hice, R-Ga., Mary Miller, R-Ill., Ralph Norman, R-S.C., Bill Posey, R-Fla., and Randy Weber, R-Texas., would require the federal government to restart building the border wall and to continue building 30-foot steel bollard barriers along the border with Mexico.",
    "author": "Jeremy Frankel",
    "title": "Rep. Rosendale Leads Effort to Stop Ukraine Funding Without Border Wall Completion"
  },
  {
    "id": 3078,
    "mediaId": 2643,
    "date": "2022-03-10",
    "sentence": "The Republicans voting against the energy ban were Andy Biggs of Arizona, Dan Bishop of North Carolina, Lauren Boebert of Colorado, Madison Cawthorn of North Carolina, Scott DesJarlais of Tennessee, Matt Gaetz of Florida, Louie Gohmert of Texas, <span class='selected-term'>Paul Gosar</span> of Arizona, Marjorie Taylor Greene of Georgia, Glenn Grothman of Wisconsin, Clay Higgins of Louisiana, Bill Posey of Florida, Chip Roy of Texas and Tom Tiffany of Wisconsin.",
    "author": "Darragh Roche",
    "title": "Full List of 17 Lawmakers Who Voted Against Russian Oil Ban"
  }
]