[
  {
    "id": 6973,
    "mediaId": 2621,
    "date": "2022-01-20",
    "sentence": "Such as when Rep. <span class='selected-term'>Paul Gosar</span> shared an anime parody in which the bad guys had the faces of Democrats like Rep. Alexandria Ocasio-Cortez.",
    "author": "Caleb Howe",
    "title": "Robert Reich Deletes Tweet Calling for Democrats to Smack Kyrsten Sinema Over Her Filibuster Vote"
  },
  {
    "id": 6813,
    "mediaId": 2569,
    "date": "2022-01-20",
    "sentence": "Fuentes, a White nationalist, online provocateur and activist, has allied with Rep. <span class='selected-term'>Paul Gosar</span>, a far-right Republican from Arizona who helped lead objections in Congress to the certification of President Joe Biden’s victory.",
    "author": "Peter Schorsch",
    "title": "Sunburn — The morning read of what’s hot in Florida politics — 1.20.22"
  },
  {
    "id": 6777,
    "mediaId": 2522,
    "date": "2022-01-21",
    "sentence": "He aggressively went after Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) for his anime depicting an attack on Rep. Alexandria Ocasio-Cortez (D-NY).",
    "author": "Terresa Monroe-Hamilton",
    "title": "Clinton labor secretary blames his tweet calling for the assault of Sen. Sinema on Republicans"
  },
  {
    "id": 6982,
    "mediaId": 2528,
    "date": "2022-01-28",
    "sentence": "House Minority Leader Kevin McCarthy with fellow Republicans on the House steps as the House debated censuring Rep. <span class='selected-term'>Paul Gosar</span> on November 17, 2021 in Washington, DC.",
    "author": "Warren Rojas",
    "title": "Newt Gingrich is full of ideas about how to reshape America in a more conservative fashion, and Republicans hoping to win big in 2022 are turning to him for advice"
  },
  {
    "id": 3758,
    "mediaId": 2639,
    "date": "2022-02-28",
    "sentence": "Sen. Mitt Romney (R-Utah) called GOP Reps. Marjorie Taylor Greene (Georgia) and <span class='selected-term'>Paul Gosar</span> (Arizona) \"morons\" after they attended a white nationalist camp over the weekend.",
    "author": "",
    "title": "The women in red"
  }
]