[
  {
    "id": 6494,
    "mediaId": 2512,
    "date": "2022-01-19",
    "sentence": "Trump’s recent rally in Arizona featured a who’s-who of unhinged conspiracy theorists, including MyPillow CEO Mike Lindell, Rep. <span class='selected-term'>Paul Gosar</span> and Arizona gubernatorial candidate Kari Lake.",
    "author": "Alex Henderson",
    "title": "How 'wacko' conspiracy extremists are driving the 'radicalization' of the Republican Party: conservatives"
  },
  {
    "id": 6973,
    "mediaId": 2621,
    "date": "2022-01-20",
    "sentence": "Such as when Rep. <span class='selected-term'>Paul Gosar</span> shared an anime parody in which the bad guys had the faces of Democrats like Rep. Alexandria Ocasio-Cortez.",
    "author": "Caleb Howe",
    "title": "Robert Reich Deletes Tweet Calling for Democrats to Smack Kyrsten Sinema Over Her Filibuster Vote"
  },
  {
    "id": 6490,
    "mediaId": 2512,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 6414,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 6615,
    "mediaId": 2553,
    "date": "2022-02-01",
    "sentence": "The Daily Wire reported:\nMcCarthy made the remarks in an interview with Breitbart News and said that the move comes in light of to Democrats kicking two Republicans — Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) — off their committees.",
    "author": "Dillon Burroughs",
    "title": "Squad Member Ilhan Omar Makes Her Decision Regarding 2022 Run"
  },
  {
    "id": 5917,
    "mediaId": 2553,
    "date": "2022-02-09",
    "sentence": "After teaming up with 5% of elected Republican congressmen to strip Greene of her assignments, Democrats won only two Republican votes while successfully stripping Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) of his after he made a string of controversial speeches and starred in a bizarre anime video.",
    "author": "Ben Johnson",
    "title": "3 Ways Democrats Are Trying To Overturn Elections"
  },
  {
    "id": 5730,
    "mediaId": 2629,
    "date": "2022-02-11",
    "sentence": "Last November, staffers for Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) posted an \"anime\"-style video showing him decapitating Rep. Alexandria Ocasio-Cortez (D-NY) and attacking Biden with swords.",
    "author": "Josh Israel",
    "title": "Arizona GOP Candidate Posts Video Threatening To Shoot Democrats"
  },
  {
    "id": 5805,
    "mediaId": 2584,
    "date": "2022-02-11",
    "sentence": "Last November, <span class='selected-term'>Paul Gosar</span>, Republican representative for Arizona, was officially censured by the House after sharing an animated video depicting him killing the Democratic congresswoman Alexandria Ocasio-Cortez and attacking Biden.",
    "author": "Gloria Oladipo",
    "title": "‘Disgusting’: Republican Senate hopeful condemned over ‘showdown’ TV ad"
  },
  {
    "id": 5167,
    "mediaId": 2629,
    "date": "2022-02-16",
    "sentence": "In 2020, Chattah donated $250 to Arizona Rep. <span class='selected-term'>Paul Gosar</span>, who was alleging that Democrats were prepared to steal the presidential election.",
    "author": "Nick Vachon",
    "title": "How Republican Attorneys General May Rig The 2024 Election"
  },
  {
    "id": 4832,
    "mediaId": 2580,
    "date": "2022-02-16",
    "sentence": "“Sometimes you just need to have that moment.”\nAOC has said she feels uncomfortable with some of her “creepy” older male colleagues like Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.), who posted an anime fantasy video depicting him killing her.",
    "author": "GOPUSA",
    "title": "AOC: Democrats ‘have too few stones’ and GOP loves to hate her"
  },
  {
    "id": 4883,
    "mediaId": 6676,
    "date": "2022-02-20",
    "sentence": "Last November, the House voted to censure Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) after he released an amine video on social media that showed him attacking President Biden and Ocasio-Cortez.",
    "author": "The Hill via Nexstar Media Wire",
    "title": "AOC claps back after Tucker Carlson calls her ‘entitled white lady’"
  },
  {
    "id": 5001,
    "mediaId": 2584,
    "date": "2022-02-22",
    "sentence": "Republicans immediately derided Biden’s pledge to nominate a Black woman to the Supreme Court – while Democratic leaders are hoping for bipartisan support; House Speaker Nancy Pelosi insists the nation needs a strong Republican party – meanwhile radicals like Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, who fantasize about committing acts of violence against Democrats, are embraced by fellow Republicans, proving they are not just a extremist fringe that has “hijacked” the Party, as Pelosi suggested.",
    "author": "Thomas Zimmer",
    "title": "The Republican party is abandoning democracy. There can be no ‘politics as usual’"
  },
  {
    "id": 5013,
    "mediaId": 2664,
    "date": "2022-02-22",
    "sentence": "Republicans immediately derided Biden’s pledge to nominate a Black woman to the Supreme Court – while Democratic leaders are hoping for bipartisan support; House Speaker Nancy Pelosi insists the nation needs a strong Republican party – meanwhile radicals like Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, who fantasize about committing acts of violence against Democrats, are embraced by fellow Republicans, proving they are not just a extremist fringe that has 'hijacked' the Party, as Pelosi suggested.\"",
    "author": "Bob Brigham",
    "title": "Biden needs to stop seeking bipartisanship as Republicans abandon democracy: historian"
  },
  {
    "id": 4740,
    "mediaId": 2643,
    "date": "2022-02-23",
    "sentence": "Also signing the letter were a number of Republicans who are often at odds with the president, such as Representatives Louie Gohmert (R-Texas) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.).",
    "author": "Justin Klawans",
    "title": "Democrats, Republicans Applaud Biden's Russia Sanctions"
  },
  {
    "id": 3775,
    "mediaId": 2636,
    "date": "2022-02-26",
    "sentence": "Eight miles from CPAC, an even angrier right-wing gathering, the America First Political Action Conference, took place at another Orlando hotel with Representative Marjorie Taylor Greene of Georgia as the main attraction and Representative <span class='selected-term'>Paul Gosar</span> of Arizona appearing by video.",
    "author": "",
    "title": "At CPAC, Ukraine and Policy Take a Back Seat to Cultural Grievances"
  },
  {
    "id": 4094,
    "mediaId": 2621,
    "date": "2022-03-01",
    "sentence": "GOP Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene also spoke at his controversial conference over the weekend.",
    "author": "Alex Griffing",
    "title": "GOP-Controlled AZ Senate Censures Trump-Backed Republican Lawmaker Wendy Rogers"
  },
  {
    "id": 3661,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "Besides Rogers, other Republicans such as Congressman <span class='selected-term'>Paul Gosar</span> of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "author": "David Neiwert",
    "title": "White nationalists flaunt their traction within Republican Party at annual gathering in Florida"
  },
  {
    "id": 4128,
    "mediaId": 2643,
    "date": "2022-03-01",
    "sentence": "Rogers' censure follows rebukes by national Republican leaders against U.S. GOP Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona who also spoke at the conference.",
    "author": "Daniel Villarreal",
    "title": "GOP Senators Censure Colleague for Speaking at White Nationalist Conference"
  },
  {
    "id": 4416,
    "mediaId": 2676,
    "date": "2022-03-01",
    "sentence": "Writing on Twitter, Ocasio-Cortez accused McCarthy of covering for the racist behavior of Greene and Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) for years.",
    "author": "Brad Reed",
    "title": "\"Protecting his little KKK Caucus\": AOC slams GOP leader for \"toothless\" condemnation of MTG"
  },
  {
    "id": 3669,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "While Lake did not respond to questions about Rogers, she has not distanced herself from Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who spoke at the same Nick Fuentes' white nationalist America First Political Action Conference in Florida.",
    "author": "Bob Brigham",
    "title": "Censured Republican is so toxic she’s become an issue in Arizona governor’s race: report"
  },
  {
    "id": 3836,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "",
    "author": "Sarah K. Burris",
    "title": "'Unhealthy and unhinged': Marjorie Taylor Greene blasted for 'reprehensible' response to Biden's State of the Union"
  },
  {
    "id": 3878,
    "mediaId": 2547,
    "date": "2022-03-02",
    "sentence": "Besides Rogers, other Republicans such as Congressman <span class='selected-term'>Paul Gosar</span> of Arizona—who addressed last year’s AFPAC gathering—also spoke to the audience via a prerecorded video speech.",
    "author": "David Neiwert",
    "title": "Neo-Nazi Nick Fuentes Is Gloating About Taking Over The GOP"
  },
  {
    "id": 3785,
    "mediaId": 6656,
    "date": "2022-03-02",
    "sentence": "Out of 429 voting members, three lawmakers -- all Republicans -- voted against affirming the resolution on Wednesday: Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana.",
    "author": "Calley Hair",
    "title": "U.S. House passes resolution declaring support for Ukraine"
  },
  {
    "id": 3888,
    "mediaId": 2550,
    "date": "2022-03-05",
    "sentence": "“In the end, America pulled away from the cliff, but this rally is a reminder that things didn’t have to work out that way.”\nI thought about that night at Madison Square Garden this weekend, as Republican lawmakers Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> attended a white nationalist rally in Orlando, Florida, staged as a competitor to the slightly less batshit Conservative Political Action Committee, or CPAC.",
    "author": "",
    "title": "Democrats can’t be shy about rallying for democracy"
  },
  {
    "id": 3104,
    "mediaId": 2746,
    "date": "2022-03-07",
    "sentence": "Mr. Ryder told The Associated Press that the tweet was a reaction to Mr. Johnson’s November 2021 House vote against censuring fellow Republican Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Kerry Picket",
    "title": "Offensive tweets force South Dakota Democrat out of House race after one day"
  },
  {
    "id": 3252,
    "mediaId": 5308,
    "date": "2022-03-10",
    "sentence": "While Republican congressional leaders condemned the invasion, Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene both spoke at a white nationalist conference last month whose organizer favorably compared Russian President Vladimir Putin to Adolf Hitler.",
    "author": "Paul Blest",
    "title": "GOP Rep. Madison Cawthorn Called President Zelenskyy a ‘Thug’"
  },
  {
    "id": 3238,
    "mediaId": 2676,
    "date": "2022-03-16",
    "sentence": "Republican Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> or Arizona will not be punished for their participation in a white nationalist conference, according to House Republican leader Kevin McCarthy.",
    "author": "Madeleine Beck",
    "title": "Kevin McCarthy quietly gets away with holding Republicans to a lower standard than Donald Trump"
  },
  {
    "id": 2769,
    "mediaId": 2664,
    "date": "2022-03-18",
    "sentence": "Rep. Ted Lieu (D-CA) on Friday took some time on the House floor to shame his Republican colleagues for failing to do anything to discipline Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) for being featured speakers at a white nationalist conference last month.",
    "author": "Brad Reed",
    "title": "WATCH: Ted Lieu hilariously shames GOP's failure to discipline members who attended white nationalist conference"
  },
  {
    "id": 2567,
    "mediaId": 2528,
    "date": "2022-03-20",
    "sentence": "Democrats also removed Rep. <span class='selected-term'>Paul Gosar</span>, a Republican from Arizona, from his committee assignments after he posted an edited anime video showing him killing Rep. Alexandria Ocasio-Cortez.",
    "author": "Yelena Dzhanova",
    "title": "Kevin McCarthy says Democratic Rep. Adam Schiff will be removed from House Intelligence Committee if GOP wins majority in midterms"
  },
  {
    "id": 2146,
    "mediaId": 2724,
    "date": "2022-03-21",
    "sentence": "— Kevin McCarthy (@GOPLeader) March 20, 2022\nRELATED: McCarthy May Give Marjorie Taylor Greene, <span class='selected-term'>Paul Gosar</span> ‘Better’ Committee Assignments If GOP Takes Back Congress\nWill McCarthy Boot Omar and Swalwell Too?",
    "author": "Rusty Weiss",
    "title": "McCarthy Vows To Kick Adam Schiff Off Intel Committee If GOP Wins Back The House"
  },
  {
    "id": 2363,
    "mediaId": 2526,
    "date": "2022-03-26",
    "sentence": "Kelly reportedly took in more than $55,000 in contributions during the last fundraising quarter of 2021 from “PACs of corporate trade groups and the Senate leadership committees of many of his fellow Democrats.”\nIn 2021, he also took heat from the Arizona Republican Party chair Kelli Ward, Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), and the National Republican Senatorial Committee (NRSC) for being “missing in action” and for the lack of leadership the freshman member has in the Senate.",
    "author": "Jacob Bliss",
    "title": "Poll: Democrat Mark Kelly Trails Generic Republican in AZ Senate Race"
  },
  {
    "id": 1578,
    "mediaId": 2629,
    "date": "2022-03-31",
    "sentence": "AFPAC also featured prerecorded speeches from Rep. <span class='selected-term'>Paul Gosar</span> of Arizona and Idaho Lt.",
    "author": "Alex Henderson",
    "title": "Neo-Nazi Fuentes Praises GOP's ’Thinly Veiled Racism’ In Attacking Jackson"
  },
  {
    "id": 952,
    "mediaId": 2512,
    "date": "2022-03-31",
    "sentence": "AFPAC also featured prerecorded speeches from Rep. <span class='selected-term'>Paul Gosar</span> of Arizona and Idaho Lt.",
    "author": "Alex Henderson",
    "title": "Nick Fuentes praises 'thinly veiled racism' of GOP attacks on Ketanji Brown Jackson"
  },
  {
    "id": 1550,
    "mediaId": 2790,
    "date": "2022-04-01",
    "sentence": "This was a swifter-than-usual response from the GOP leader\nMcCarthy has had to step in to condemn various rhetoric and actions taken by members of his conference, from denouncing language used by Rep. Marjorie Taylor Greene that equated COVID-19 safety measures with the treatment of Jews during the Holocaust and more recently calling it \"appalling\" that Greene and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona attended an event led by a white nationalist.",
    "author": "Barbara Sprunt",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 1348,
    "mediaId": 2808,
    "date": "2022-04-07",
    "sentence": "By contrast, Democrats have utterly failed to elevate the profiles of sinister figures like Reps. <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene, Madison Cawthorn or Lauren Boebert.",
    "author": "Mona Charen",
    "title": "Democrats need to get better at politics, fast"
  },
  {
    "id": 851,
    "mediaId": 2629,
    "date": "2022-04-10",
    "sentence": "By contrast, Democrats have utterly failed to elevate the profiles of sinister figures like Reps. <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene, Madison Cawthorn or Lauren Boebert.",
    "author": "",
    "title": "Democrats Need To Get Better At Politics, And Fast"
  },
  {
    "id": 892,
    "mediaId": 2668,
    "date": "2022-04-11",
    "sentence": "The thinking behind this is that it would show Democrats that if they remove Republican representatives from their assignments for politically-motivated reasons as they did with Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ), then they would be given the same treatment.",
    "author": "Jeff Charles",
    "title": "Yes, We Absolutely Should Impeach President Biden"
  },
  {
    "id": 555,
    "mediaId": 2716,
    "date": "2022-04-18",
    "sentence": "But traditional dynamics in the House have already begun to shift — consider how Democrats kicked Rep. Majorie Taylor Greene (R-Ga.) off her committees over past comments, or censured and removed Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) from his assignments after he promoted an animated video depicting violence against Democrats, including President Biden.",
    "author": "Brigid Kennedy",
    "title": "House GOP reportedly considering term limits for all committee leaders"
  },
  {
    "id": 236,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "That’s in part because the conservative Christian political party may be having all kinds of non-Christian-style drug-fueled orgies (if Madison is to be believed), and also because Cawthorn and other Republican members of Congress like Lauren Boebert and <span class='selected-term'>Paul Gosar</span> represent a new tea party-inspired rat that has climbed aboard the sinking Republican ship.",
    "author": "",
    "title": "GOP civil war: conservative outlet reports Madison Cawthorn’s outrageous spending of taxpayer money"
  },
  {
    "id": 45,
    "mediaId": 2662,
    "date": "2022-04-19",
    "sentence": "HERE IS THE SILLY VIDEO Rep. <span class='selected-term'>Paul Gosar</span> Posted that Tyrant Pelosi Is Using to Demand He is Removed from His Congressional Committees — What a Joke\nNow Republicans are weighing in on imposing term limits on committee leadership positions if the GOP retakes the House of Representatives next year.",
    "author": "Jim Hoft",
    "title": "Kevin McCarthy Says GOP Could Strip Crooked Democrats from Committee Leadership Positions — DON’T BELIEVE IT"
  }
]