[
  {
    "id": 5512,
    "mediaId": 2643,
    "date": "2022-02-02",
    "sentence": "Other GOP members have also previously spoken out against a potential U.S. military intervention over the Russia-Ukraine situation, including Congressmen <span class='selected-term'>Paul Gosar</span> and Thomas Massie of Arizona and Kentucky respectively.",
    "author": "Adam Staten",
    "title": "Kinzinger Blasts Josh Hawley for Urging Biden to Drop Support to Ukraine"
  },
  {
    "id": 5490,
    "mediaId": 2550,
    "date": "2022-02-02",
    "sentence": "Unfortunately, we are living in desperate times and the only way that Cheney and Kinzinger can survive is to do the right thing and bring criminal charges to light about the complicity and the possible conspiracy by Republicans like Ted Cruz, Josh Hawley, Louie Gohmert, Mo Brooks, Marjorie Taylor Greene, Lauren Boebert, Matt Gaetz, <span class='selected-term'>Paul Gosar</span>, and others, to overturn our democratically elected 46th President.",
    "author": "",
    "title": "Rep. Adam Kinzinger brings a bazooka to Josh Hawley's knife fight"
  },
  {
    "id": 5890,
    "mediaId": 2664,
    "date": "2022-02-03",
    "sentence": "Some may argue that President Trump, Rep. <span class='selected-term'>Paul Gosar</span>, Sen. Josh Hawley, Sen. Ted Cruz and others did not engage in insurrection or rebellion because they did not personally use violence to try to deny Joe Biden the presidency.",
    "author": "Noah Bookbinder",
    "title": "We can stop the white-collar insurrectionists from doing it again -- here's how"
  },
  {
    "id": 5655,
    "mediaId": 2625,
    "date": "2022-02-04",
    "sentence": "Right-wing white nationalists like Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) see Ukraine as an irrelevant distraction from, as he put it, “dangerous drugs and violent crime” in his district.",
    "author": "Dan Spinelli",
    "title": "There’s a Big Tent Opposing US Intervention in Ukraine. Tucker Carlson Is Stretching Its Limits."
  },
  {
    "id": 5575,
    "mediaId": 2550,
    "date": "2022-02-07",
    "sentence": "A big part of this play is that Kinzinger, along with neo-conservatives like Rep. Liz Cheney, are battling to regain control over a political party now inundated with more flagrantly corrupt, more flagrantly authoritarian, and more flagrantly incompetent officials like Sen. Josh Hawley and Reps. Madison Cawthorn, Lauren Boebert, and <span class='selected-term'>Paul Gosar</span> ascending to prominence.",
    "author": "",
    "title": "Adam Kinzinger has a lot to say: Donald Trump ‘is the worst president the U.S. ever had’"
  },
  {
    "id": 3657,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "On one side you have the Trump/MAGA/tea party wing of the GOP, filled with detestable folks like Reps. Lauren Boebert, Matt Gaetz, Madison Cawthorn, <span class='selected-term'>Paul Gosar</span>, and Marjorie Taylor Greene.",
    "author": "",
    "title": "War in the GOP: Have Marjorie Taylor Greene and Paul Gosar made one too many mistakes?"
  },
  {
    "id": 2696,
    "mediaId": 2810,
    "date": "2022-03-28",
    "sentence": "Led by influential figures such as Tucker Carlson, who hosts the most widely viewed show on cable news, and politicians such as Josh Hawley, Matt Gaetz, <span class='selected-term'>Paul Gosar</span>, and Marjorie Taylor Greene—many of whom have embraced outright white nationalists—this MAGA wing of the conservative movement is on the rise, and is determined to remake the GOP in its own image, including around foreign policy.",
    "author": "Tobita Chow",
    "title": "Tucker Carlson’s Flip-Flops on Russia Mask a Deep Militarism"
  },
  {
    "id": 1616,
    "mediaId": 2550,
    "date": "2022-04-08",
    "sentence": "Right now, hearing Donald Trump’s name almost exclusively tied to legal actions doesn’t bug one nearly as much as hearing the droning dirge of bigotries from people like Marjorie Taylor Greene or <span class='selected-term'>Paul Gosar</span>.",
    "author": "",
    "title": "News Roundup: A moment of true history worth being alive for"
  }
]