[
  {
    "id": 6494,
    "mediaId": 2512,
    "date": "2022-01-19",
    "sentence": "Trump’s recent rally in Arizona featured a who’s-who of unhinged conspiracy theorists, including MyPillow CEO Mike Lindell, Rep. <span class='selected-term'>Paul Gosar</span> and Arizona gubernatorial candidate Kari Lake.",
    "author": "Alex Henderson",
    "title": "How 'wacko' conspiracy extremists are driving the 'radicalization' of the Republican Party: conservatives"
  },
  {
    "id": 5566,
    "mediaId": 2662,
    "date": "2022-02-04",
    "sentence": "— <span class='selected-term'>Paul Gosar</span> (@DrPaulGosar) February 4, 2022",
    "author": "Jordan Conradson",
    "title": "YES! Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “We Need To Sue The Federal Government For Failing To Protect Us” (VIDEO)"
  },
  {
    "id": 5509,
    "mediaId": 2578,
    "date": "2022-02-05",
    "sentence": "— <span class='selected-term'>Paul Gosar</span> (@DrPaulGosar) February 4, 2022\nTRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nLake then called out Never-Trumper Bill Kristol, who appears to be barfing over these numbers.",
    "author": "Jordan Conradson",
    "title": "Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake Thrashes Turncoat RINO Bill Kristol Then Eats His Lunch"
  },
  {
    "id": 4582,
    "mediaId": 2664,
    "date": "2022-02-23",
    "sentence": "\"Arizona’s Rep. <span class='selected-term'>Paul Gosar</span> opened for Fuentes at last year’s AFPAC conference and has continued to root for the young white nationalist.",
    "author": "Bob Brigham",
    "title": "Arizona Republicans are flocking to attend white nationalist Nick Fuentes’ far-right conference: report"
  },
  {
    "id": 4117,
    "mediaId": 2664,
    "date": "2022-03-05",
    "sentence": "Also in attendance was Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who received widespread condemnation for attending a white nationalist conference the previous weekend.",
    "author": "Bob Brigham",
    "title": "WATCH: Mike Lindell sells a GOP candidate — and his pillows — at Arizona rodeo"
  },
  {
    "id": 3100,
    "mediaId": 2564,
    "date": "2022-03-13",
    "sentence": "Even after the invasion, two Trump allies in the House - Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> - participated in a white nationalist conference at which participants applauded Russia's move on Ukraine and chanted Putin's name.",
    "author": "",
    "title": "American governor hopeful Kari Lake labels 60 Minutes journalist Liam Bartlett a JOKE"
  }
]