[
  {
    "id": 6691,
    "mediaId": 2664,
    "date": "2022-01-25",
    "sentence": "\"Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "John Wright",
    "title": "Madison Cawthorn case could spell trouble for other ‘insurrectionists’ — including Trump: report"
  },
  {
    "id": 5546,
    "mediaId": 2664,
    "date": "2022-02-04",
    "sentence": "\"Nor was there even the slightest suggestion that perhaps the party should distance itself from the bizarre bigoted rantings of [Marjorie Taylor Greene] (R-GA), or <span class='selected-term'>Paul Gosar</span> (R-AZ), or Lauren Boebert (R-CO), or Madison Cawthorn (R-NC),\" he wrote.",
    "author": "Bob Brigham",
    "title": "RNC has ‘gone all-in on the insurrection’ while excusing ‘bigoted rantings’: Charlie Sykes"
  },
  {
    "id": 5575,
    "mediaId": 2550,
    "date": "2022-02-07",
    "sentence": "A big part of this play is that Kinzinger, along with neo-conservatives like Rep. Liz Cheney, are battling to regain control over a political party now inundated with more flagrantly corrupt, more flagrantly authoritarian, and more flagrantly incompetent officials like Sen. Josh Hawley and Reps. Madison Cawthorn, Lauren Boebert, and <span class='selected-term'>Paul Gosar</span> ascending to prominence.",
    "author": "",
    "title": "Adam Kinzinger has a lot to say: Donald Trump ‘is the worst president the U.S. ever had’"
  },
  {
    "id": 5503,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "Rep. Adam Kinzinger (R-IL) said that the Republican Party, and leaders like Kevin McCarthy (R-CA) now answer to people like Marjorie Taylor Greene (R-GA), <span class='selected-term'>Paul Gosar</span> (R-AZ) and Lauren Boebert (R-CO).",
    "author": "Sarah K. Burris",
    "title": "Adam Kinzinger trashes Kevin McCarthy: He's beholden to Marjorie Taylor Greene and Paul Gosar"
  },
  {
    "id": 3657,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "On one side you have the Trump/MAGA/tea party wing of the GOP, filled with detestable folks like Reps. Lauren Boebert, Matt Gaetz, Madison Cawthorn, <span class='selected-term'>Paul Gosar</span>, and Marjorie Taylor Greene.",
    "author": "",
    "title": "War in the GOP: Have Marjorie Taylor Greene and Paul Gosar made one too many mistakes?"
  },
  {
    "id": 4031,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "Later, after criticism, she feigned ignorance that it was a white supremacist conference — though it received enormous attention last year when GOP Congressman <span class='selected-term'>Paul Gosar</span> of Arizona (who sent a video message this year to the conference) attended and spoke.",
    "author": "",
    "title": "While democracy is under attack in Europe, GOP plots to destroy democracy in America"
  },
  {
    "id": 3836,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "",
    "author": "Sarah K. Burris",
    "title": "'Unhealthy and unhinged': Marjorie Taylor Greene blasted for 'reprehensible' response to Biden's State of the Union"
  },
  {
    "id": 3815,
    "mediaId": 2590,
    "date": "2022-03-03",
    "sentence": "Their heckling came on the same day that House Minority Leader Kevin McCarthy (R-Calif.) dodged questions about whether Greene and another member of his conference, Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.), would face any punishment for participating in a white nationalist event over the weekend.",
    "author": "Jennifer Bendery",
    "title": "Nancy Pelosi To GOPers Who Interrupted Biden’s State Of The Union Speech: ‘Shut Up’"
  },
  {
    "id": 2014,
    "mediaId": 2512,
    "date": "2022-03-24",
    "sentence": "If the 2022 midterms see a major red wave, even the most extreme MAGA Republicans are likely to be reelected to the U.S. House of Representatives — including Rep. Marjorie Taylor Greene of Georgia, Rep. Lauren Boebert of Colorado, Rep. Matt Gaetz of Florida and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Alex Henderson",
    "title": "How Madison Cawthorn may have doomed his reelection campaign"
  },
  {
    "id": 930,
    "mediaId": 2594,
    "date": "2022-03-31",
    "sentence": "But the final straw for McCarthy was that Cawthorn dared to impugn the character of a caucus that includes the likes of <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene and Lauren Boebert.",
    "author": "Eric Garcia",
    "title": "Kevin McCarthy is to blame for Madison Cawthorn. He deserves the consequences"
  },
  {
    "id": 1180,
    "mediaId": 2664,
    "date": "2022-04-04",
    "sentence": "",
    "author": "Sarah K. Burris",
    "title": "MAGA populism is a 'con job' — here's why"
  },
  {
    "id": 1503,
    "mediaId": 2699,
    "date": "2022-04-04",
    "sentence": "",
    "author": "Ben Burgis",
    "title": "Republicans Just Proved ‘Right-Wing Populism’ Is a Con Job"
  },
  {
    "id": 904,
    "mediaId": 2732,
    "date": "2022-04-17",
    "sentence": "Her colleagues in the House include <span class='selected-term'>Paul Gosar</span> and Matt Gaetz and Lauren Boebert and Louie Gohmert and, sigh, many more.",
    "author": "Mona Charen",
    "title": "Mona Charen: How to disarm the crazies"
  },
  {
    "id": 867,
    "mediaId": 2629,
    "date": "2022-04-17",
    "sentence": "Her colleagues in the House include <span class='selected-term'>Paul Gosar</span> and Matt Gaetz and Lauren Boebert and Louie Gohmert and, sigh, many more.",
    "author": "Mona Charen",
    "title": "Is There Any Way To Isolate Political Extremists? Yes"
  },
  {
    "id": 348,
    "mediaId": 2621,
    "date": "2022-04-17",
    "sentence": "“But Lauren Boebert, and Marjorie Taylor Greene, and <span class='selected-term'>Paul Gosar</span>.",
    "author": "Ken Meyer",
    "title": "GOP Congressman Says the Republican Party is in ‘Troubled Waters’ Thanks to the Marjorie Taylor Greene ‘Element’"
  },
  {
    "id": 142,
    "mediaId": 2557,
    "date": "2022-04-17",
    "sentence": "Host Chuck Todd posed the question, “Lauren Boebert, and Marjorie Taylor Green, and <span class='selected-term'>Paul Gosar</span>, is that a different element than you’ve ever seen before?”\nUpton replied, “I don’t think we’ve had as many folks in that sort of wing of the party elected as we have before, but I think they’re very popular back at home.”\nTodd then pressed Upton to explain his answer further.",
    "author": "DML News App",
    "title": "VIDEO: GOP Rep. who voted to impeach Trump warns party in ‘troubled waters’"
  }
]