[
  {
    "id": 6964,
    "mediaId": 2605,
    "date": "2022-01-07",
    "sentence": "When Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) was sanctioned and stripped of his committee assignments for tweeting a video that depicted him killing Rep. Alexandria Ocasio-Cortez (D-N.Y.) and swinging swords at President Biden, McCarthy adopted a much different stance.",
    "author": "Mark Z. Barabak",
    "title": "Column: Scraping bottom, Kevin McCarthy manages to sink even lower"
  },
  {
    "id": 6752,
    "mediaId": 2716,
    "date": "2022-01-24",
    "sentence": "If that's not enough evidence, consider that McCarthy has also already promised to retaliate for Democrats kicking Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) off their committees — Greene for eye-poppingly bigoted and deranged social media posts, some of which endorsed violence against Democratic leaders, and Gosar for posting an edited anime video showing him murdering President Biden and Rep. Alexandria Ocasio-Cortez (D-N.Y.).",
    "author": "Ryan Cooper",
    "title": "The Capitol riot investigators need to realize what they're up against"
  },
  {
    "id": 6696,
    "mediaId": 2716,
    "date": "2022-01-25",
    "sentence": "They include Cawthorn and six other House members: Rep. Andy Biggs (R-Ariz.); Rep. Lauren Boebert (R-Colo.); Rep. Mo Brooks (R-Ala.); Rep. Louie Gohmert (R-Texas); Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.); and Rep. Marjorie Taylor Greene (R-Ga.).",
    "author": "Rick Henderson",
    "title": "The risky plan to prevent Congress' Jan. 6 sympathizers from running for re-election"
  },
  {
    "id": 5546,
    "mediaId": 2664,
    "date": "2022-02-04",
    "sentence": "\"Nor was there even the slightest suggestion that perhaps the party should distance itself from the bizarre bigoted rantings of [Marjorie Taylor Greene] (R-GA), or <span class='selected-term'>Paul Gosar</span> (R-AZ), or Lauren Boebert (R-CO), or Madison Cawthorn (R-NC),\" he wrote.",
    "author": "Bob Brigham",
    "title": "RNC has ‘gone all-in on the insurrection’ while excusing ‘bigoted rantings’: Charlie Sykes"
  },
  {
    "id": 5503,
    "mediaId": 2664,
    "date": "2022-02-10",
    "sentence": "Rep. Adam Kinzinger (R-IL) said that the Republican Party, and leaders like Kevin McCarthy (R-CA) now answer to people like Marjorie Taylor Greene (R-GA), <span class='selected-term'>Paul Gosar</span> (R-AZ) and Lauren Boebert (R-CO).",
    "author": "Sarah K. Burris",
    "title": "Adam Kinzinger trashes Kevin McCarthy: He's beholden to Marjorie Taylor Greene and Paul Gosar"
  },
  {
    "id": 4698,
    "mediaId": 2594,
    "date": "2022-02-20",
    "sentence": "Representative <span class='selected-term'>Paul Gosar</span>, who was censured by Congress after he tweeted an anime video of a character with his head cutting off the head of a character of Representative Alexandria Ocasio-Cortez’s face, also announced he would be on it.",
    "author": "Eric Garcia",
    "title": "MAGA allies Marjorie Taylor Greene and Matt Gaetz line up for Trump’s new social network ahead of launch"
  },
  {
    "id": 3725,
    "mediaId": 2664,
    "date": "2022-02-25",
    "sentence": "Ben Lorber, an analyst for the social justice think tank Political Research Associates, noted on Twitter that in embracing Fuentes, Greene joined Arizona Republican Congressman <span class='selected-term'>Paul Gosar</span>, who spoke at the conference last year.",
    "author": "John Wright",
    "title": "'Only one reason a person speaks at a white nationalist conference': Marjorie Taylor Greene blasted for speaking at far-right conference"
  },
  {
    "id": 3771,
    "mediaId": 2718,
    "date": "2022-02-26",
    "sentence": "At the Conservative Political Action Conference (CPAC) on Saturday, CBS News’ Robert Costa questioned Greene about her surprise appearance at Fuentes’ America First Political Action Conference the previous night alongside Arizona Rep. <span class='selected-term'>Paul Gosar</span>.",
    "author": "Jeremy Fuster",
    "title": "Marjorie Taylor Greene Spoke at a White Supremacist Event – But Says She Wasn’t Aware That’s What It Was"
  },
  {
    "id": 4010,
    "mediaId": 2643,
    "date": "2022-02-26",
    "sentence": "pic.twitter.com/6fgpV6ohZ8\n— Liz Cheney (@Liz_Cheney) February 26, 2022\n\"As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling,\" the Wyoming congresswoman wrote in a Twitter post, including a video of Fuentes' remarks.",
    "author": "Jason Lemon",
    "title": "Cheney Rips GOP Silence Over Greene, Gosar Joining 'White Supremacist' Event"
  },
  {
    "id": 4407,
    "mediaId": 2646,
    "date": "2022-02-26",
    "sentence": "Extremists like Marjorie Taylor Greene and Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) are enabled by craven politicians like House GOP leader McCarthy, a man so scared of his own voters he can’t be found for comment when his caucus members appear alongside white supremacists.",
    "author": "Thomas Kennedy",
    "title": "COMPLICITY: Kevin McCarthy silent when Marjorie Taylor Greene speaks at white supremacist conference"
  },
  {
    "id": 4394,
    "mediaId": 2629,
    "date": "2022-02-27",
    "sentence": "All Americans should renounce this garbage and reject the Putin wing of the GOP now.”\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Meaghan Ellis",
    "title": "Outrage Over Rep. Greene's Speech To White Nationalist 'America First' Event"
  },
  {
    "id": 4378,
    "mediaId": 2619,
    "date": "2022-02-27",
    "sentence": "In a tweet Saturday, Rep. Liz Cheney, who has faced intraparty censure in her home state of Wyoming over her criticism of former President Donald Trump, blasted their speaking appearance: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Mike Murphy",
    "title": "‘Morons’: Romney, Cheney, Kinzinger condemn fellow Republicans for speaking at white nationalist event"
  },
  {
    "id": 4316,
    "mediaId": 2640,
    "date": "2022-02-27",
    "sentence": "GOP Rep. Liz Cheney, who's on the outs with her party, denounced Greene and Arizona Rep. <span class='selected-term'>Paul Gosar</span>, who spoke to the America First meeting virtually.",
    "author": "Bob Cronin",
    "title": "Greene Hears From McDaniel About America First Speech"
  },
  {
    "id": 4138,
    "mediaId": 2547,
    "date": "2022-02-27",
    "sentence": "CNN host Dana Bash asked Romney about a tweet by Liz Cheney, where she slammed Republican leadership for their silence on the matter:\nAs Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "Heather",
    "title": "Mitt Romney: 'I Have Morons On My Team!'"
  },
  {
    "id": 4231,
    "mediaId": 2595,
    "date": "2022-02-27",
    "sentence": "Watch:\nMitt Romney rebukes MTG attending white supremacist event:\n“Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, I don’t know them.",
    "author": "M Dowling",
    "title": "Romney Calls Reps MTG & Gosar “Morons,” Praises Biden, Trashes DJT"
  },
  {
    "id": 3733,
    "mediaId": 2664,
    "date": "2022-02-27",
    "sentence": "Asked by host Bash about Taylor Greene's appearance at the racist get-together in Orlando along with Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) the Utah Republican didn't mince words when host Bash quoted a statement made by Rep. Liz Cheney (R-WY) that attacked the Georgia lawmaker.",
    "author": "Tom Boggioni",
    "title": "'I have morons on my team': Mitt Romney questions Marjorie Taylor Greene's 'IQ' in brutal CNN rant"
  },
  {
    "id": 3828,
    "mediaId": 2594,
    "date": "2022-02-27",
    "sentence": "Another Republican who herself has faced censure by the national Republican Party for her participation in the January 6 investigation, Liz Cheney, also aimed fire at Ms Greene: “As Rep Marjorie Taylor Greene and Rep <span class='selected-term'>Paul Gosar</span> speak at this white supremacist, anti-Semitic, pro-Putin event, silence by Republican Party leaders is deafening and enabling.",
    "author": "John Bowden",
    "title": "Romney calls Marjorie Taylor Greene a ‘moron’ as moderates demand party ditch ‘Putin wing of GOP’"
  },
  {
    "id": 3786,
    "mediaId": 2551,
    "date": "2022-02-28",
    "sentence": "Republican Sen. Mitt Romney slammed both Greene and Republican Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, who sent pre-taped remarks to the conference.",
    "author": "Emily Goodin",
    "title": "'Have you lost all sense of decency?' Liz Cheney shames Kevin McCarthy for not chastising Marjorie Taylor Greene for speaking at white nationalist event"
  },
  {
    "id": 3843,
    "mediaId": 2551,
    "date": "2022-02-28",
    "sentence": "McCarthy, R-Calif., said he plans to speak with the Georgia Republican and Rep. <span class='selected-term'>Paul Gosar</span>, who spoke at the event last year and appeared this year in a 30-second pre-recorded video.",
    "author": "Morgan Phillips",
    "title": "'Appalling and wrong': Mitch McConnell and Kevin McCarthy slam Marjorie Taylor Greene for appearing alongside white supremacist"
  },
  {
    "id": 3870,
    "mediaId": 2643,
    "date": "2022-02-28",
    "sentence": "His comments came after Greene and Arizona Representative <span class='selected-term'>Paul Gosar</span> spoke at the America First Political Action Conference over the weekend conference in Florida.",
    "author": "Daniel Villarreal",
    "title": "'Appalled' McCarthy Plans Talk With Greene About White Nationalist Rally"
  },
  {
    "id": 3749,
    "mediaId": 2636,
    "date": "2022-02-28",
    "sentence": "WASHINGTON — Republican congressional leaders on Monday broke their silence about the participation of two House Republicans at a far-right conference with ties to white supremacy, denouncing the actions of Representative Marjorie Taylor Greene of Georgia and Representative <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "",
    "title": "G.O.P. Leaders Condemn Lawmakers’ Appearance at White Nationalist Conference"
  },
  {
    "id": 4146,
    "mediaId": 2643,
    "date": "2022-02-28",
    "sentence": "\"There's no place in the Republican Party for white supremacists or antisemitism,\" McConnell told Politico, when asked to comment on Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>'s attendance at the America First Political Action Conference.",
    "author": "Natalie Colarossi",
    "title": "Mitch McConnell Condemns GOP Members Who Engage With White Nationalists"
  },
  {
    "id": 4174,
    "mediaId": 2723,
    "date": "2022-02-28",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, who last year stood in Greene’s place getting condemned for his speaking at both conferences, sent a video message to be played at AFPAC, as did Arizona state Sen. Wendy Rogers and Idaho Lt. Gov.",
    "author": "Kristen Doerer – Right Wing Watch",
    "title": "‘Standard Bearer of Trumpism’ Marjorie Taylor Greene Bridges White Nationalism and the GOP"
  },
  {
    "id": 4152,
    "mediaId": 2528,
    "date": "2022-02-28",
    "sentence": "Republican House Minority Leader Kevin McCarthy offered a rare rebuke of two members of his caucus on Monday, saying it was \"unacceptable\" for Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona to speak at an event held by a man widely described to be white nationalist.",
    "author": "Bryan Metzger",
    "title": "Kevin McCarthy condemns Marjorie Taylor Greene and Paul Gosar for attending 'appalling and wrong' white nationalist event: 'This is unacceptable'"
  },
  {
    "id": 4472,
    "mediaId": 2676,
    "date": "2022-02-28",
    "sentence": "Sen. Mitt Romney, R-Utah, called Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., \"morons\" on Sunday after the two House lawmakers attended a white nationalist event whose participants heaped praise on Russia for invading Ukraine.",
    "author": "Jon Skolnik",
    "title": "\"I have morons on my team\": Mitt Romney blasts radical Republicans in Congress"
  },
  {
    "id": 3754,
    "mediaId": 2512,
    "date": "2022-03-01",
    "sentence": "Others included Arizona State Sen. Wendy Rogers, Rep. <span class='selected-term'>Paul Gosar</span> of Arizona and Idaho Lt. Gov.",
    "author": "Alex Henderson",
    "title": "Marjorie Taylor Greene asked journalists to judge her by her own words — and this one accepted the challenge"
  },
  {
    "id": 4111,
    "mediaId": 2625,
    "date": "2022-03-01",
    "sentence": "Janice McGeachin (R-Idaho) and serving members of Congress Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.), among others.",
    "author": "Ali Breland",
    "title": "How Marjorie Taylor Greene and Nick Fuentes Are Easing White Power into the GOP Mainstream"
  },
  {
    "id": 4031,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "Later, after criticism, she feigned ignorance that it was a white supremacist conference — though it received enormous attention last year when GOP Congressman <span class='selected-term'>Paul Gosar</span> of Arizona (who sent a video message this year to the conference) attended and spoke.",
    "author": "",
    "title": "While democracy is under attack in Europe, GOP plots to destroy democracy in America"
  },
  {
    "id": 3657,
    "mediaId": 2550,
    "date": "2022-03-01",
    "sentence": "On one side you have the Trump/MAGA/tea party wing of the GOP, filled with detestable folks like Reps. Lauren Boebert, Matt Gaetz, Madison Cawthorn, <span class='selected-term'>Paul Gosar</span>, and Marjorie Taylor Greene.",
    "author": "",
    "title": "War in the GOP: Have Marjorie Taylor Greene and Paul Gosar made one too many mistakes?"
  },
  {
    "id": 4508,
    "mediaId": 5308,
    "date": "2022-03-02",
    "sentence": "In addition to Rogers, two current members of Congress, Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, spoke at the conference.",
    "author": "Paul Blest",
    "title": "Republicans Have Finally Had Enough of Wendy Rogers"
  },
  {
    "id": 4113,
    "mediaId": 2572,
    "date": "2022-03-03",
    "sentence": "Reps. Thomas Massie, R-Ky., Matt Rosendale, R-Mont., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., all voted nay.",
    "author": "",
    "title": "Mixed messages from Congress at State of the Union address on Ukraine, COVID-19"
  },
  {
    "id": 3764,
    "mediaId": 2621,
    "date": "2022-03-03",
    "sentence": "The petition, from a group called Faithful America, is addressed to “RNC Chair Ronna McDaniel” and says “As grassroots Christians from across the country, we call on the RNC to censure Representatives Marjorie Taylor Green and <span class='selected-term'>Paul Gosar</span> for taking part in the explicitly white nationalist America First Political Action Conference.”\nMcDaniel did issue a statement over the weekend condemning “white supremacy, neo-Nazism, hate speech and bigotry are disgusting and do not have a home in the Republican Party.”\nBoth Greene and Gosar have been roundly condemned for addressing the conference hosted by white nationalist and Holocaust-denier Nick Fuentes.",
    "author": "Alex Griffing",
    "title": "Nearly 13,000 Christians Sign Petition Calling on the RNC to Censure Reps. Greene and Gosar For Addressing White Nationalist Group"
  },
  {
    "id": 3856,
    "mediaId": 2664,
    "date": "2022-03-07",
    "sentence": "More forceful and specific condemnation by GOP leaders against Republican Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> for participating in a recent white nationalist event in Florida, for example, would go a long way toward conveying that message and countering this toxic propaganda,\" they wrote.",
    "author": "Tom Boggioni",
    "title": "Top midwestern paper calls out the GOP for allowing white nationalists to 'flourish' in scathing editorial"
  },
  {
    "id": 2776,
    "mediaId": 2550,
    "date": "2022-03-07",
    "sentence": "Related:\nWhite nationalists flaunt their traction within Republican Party at annual gathering in Florida\nMarjorie Taylor Greene's speed walk through the Holocaust Museum didn't teach her anything\nHouse votes to strip Rep. Marjorie Taylor Greene of committee assignments\nRep. <span class='selected-term'>Paul Gosar</span> is censured by U.S. House; removed from committees\nThis is a short blurb about Daily Kos.",
    "author": "Laura Clawson",
    "title": "Kevin McCarthy's failure to act on Gosar and Greene's white nationalist flirtation says it all"
  },
  {
    "id": 3094,
    "mediaId": 2590,
    "date": "2022-03-09",
    "sentence": "Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) won’t face punishment for participating in a white nationalist conference, House Republican leader Kevin McCarthy (R-Calif.) said Wednesday.",
    "author": "Arthur Delaney",
    "title": "Kevin McCarthy Won't Punish Republicans Who Joined White Nationalist Conference"
  },
  {
    "id": 2958,
    "mediaId": 2594,
    "date": "2022-03-09",
    "sentence": "Speaking at a news conference on Wednesday, Mr McCarthy confirmed to reporters that Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> still had avenues to returning to active roles on House panels even after they were both publicly chastised for attending an event billed as a far-right alternative to the Conservative Political Action Conference (CPAC) hosted by a semi-famous white nationalist, Nick Fuentes.",
    "author": "John Bowden",
    "title": "Kevin McCarthy dodges question on repercussions for Marjorie Taylor Greene again"
  },
  {
    "id": 3552,
    "mediaId": 2688,
    "date": "2022-03-09",
    "sentence": "The minority leader did say that Greene would not be attending the conference again — though one wonders how serious he is about enforcing that commitment, given that this was Rep. <span class='selected-term'>Paul Gosar</span>’s (R-AZ) second year addressing the gathering.",
    "author": "Matt Shuham",
    "title": "Reps’ Punishment For Addressing A White Nationalist Conference? Talking To Kevin McCarthy"
  },
  {
    "id": 2787,
    "mediaId": 2550,
    "date": "2022-03-10",
    "sentence": "After Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> spoke at the America First Political Action Conference, it took McCarthy 10 days to get around to having a chat with Greene.",
    "author": "Laura Clawson",
    "title": "Greene and Gosar won't face punishment for speaking at white nationalist event"
  },
  {
    "id": 2971,
    "mediaId": 2658,
    "date": "2022-03-12",
    "sentence": "It’s also an unexpectedly newsworthy one, making its unavailability in the States even more tragic: In it, Theroux immerses himself in the world of the white nationalist internet troll Nick Fuentes, whose “America First Political Action Conference” was attended by Republican Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Az.)",
    "author": "",
    "title": "Can a British Documentarian Crack the Gen-Z Far Right?"
  },
  {
    "id": 2661,
    "mediaId": 2627,
    "date": "2022-03-21",
    "sentence": "Because as far as Republicans are concerned, Democrats effectively rewrote the rules when they stripped two far-right congressional extremists — Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona — of their committee assignments.",
    "author": "Steve Benen",
    "title": "McCarthy readies plan to kick Schiff off House Intelligence panel"
  },
  {
    "id": 2146,
    "mediaId": 2724,
    "date": "2022-03-21",
    "sentence": "— Kevin McCarthy (@GOPLeader) March 20, 2022\nRELATED: McCarthy May Give Marjorie Taylor Greene, <span class='selected-term'>Paul Gosar</span> ‘Better’ Committee Assignments If GOP Takes Back Congress\nWill McCarthy Boot Omar and Swalwell Too?",
    "author": "Rusty Weiss",
    "title": "McCarthy Vows To Kick Adam Schiff Off Intel Committee If GOP Wins Back The House"
  },
  {
    "id": 2027,
    "mediaId": 2664,
    "date": "2022-03-21",
    "sentence": "In fact, Republicans have made clear they are itching to do this in part as revenge for Democrats taking the step of stripping Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) of their committee assignments for extremist behavior, something that was itself unprecedented because generally both parties have policed their own members and revoked assignments themselves when members are this embroiled in controversy.",
    "author": "Matthew Chapman",
    "title": "Kevin McCarthy slammed for plans to boot Adam Schiff from the House Intelligence Committee"
  },
  {
    "id": 2070,
    "mediaId": 2594,
    "date": "2022-03-30",
    "sentence": "In recent weeks that has included public rebukes of Reps Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> for their attendance at a white nationalist-led far right conference hosted during CPAC in Florida.",
    "author": "John Bowden",
    "title": "Trump pours cold water on House speaker idea floated by Matt Gaetz"
  },
  {
    "id": 2245,
    "mediaId": 2643,
    "date": "2022-03-30",
    "sentence": "Arizona Republican <span class='selected-term'>Paul Gosar</span> was also at the America First Political Action Conference (AFPAC) in Florida.",
    "author": "Alexandra Hutzler",
    "title": "McCarthy Slammed for Being Harsher on Cawthorn Than Marjorie Taylor Greene"
  },
  {
    "id": 1533,
    "mediaId": 2629,
    "date": "2022-04-04",
    "sentence": "In 2019, Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) called Orban a \"patriot\" who \"demonstrates the values of Western civilization and democracy, sovereignty, and self-determination.\"",
    "author": "Emily Singer",
    "title": "Greene Praises Authoritarian Orban After Election Win In Hungary"
  },
  {
    "id": 1479,
    "mediaId": 2627,
    "date": "2022-04-04",
    "sentence": "And yet, Republican Rep. Marjorie Taylor Greene of Georgia spoke at the radical gathering, and Republican Rep. <span class='selected-term'>Paul Gosar</span> of Arizona participated in the event by way of a pre-recorded video message.",
    "author": "Steve Benen",
    "title": "Paul Gosar finally comments on role at white nationalist event"
  },
  {
    "id": 1180,
    "mediaId": 2664,
    "date": "2022-04-04",
    "sentence": "",
    "author": "Sarah K. Burris",
    "title": "MAGA populism is a 'con job' — here's why"
  },
  {
    "id": 1633,
    "mediaId": 2859,
    "date": "2022-04-06",
    "sentence": "Also, Romney referred to Greene and Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz., as “morons” for attending a conference put on by a white supremacist where people cheered for Russian President Vladimir Putin after the invasion of Ukraine.",
    "author": "Dennis Romboy",
    "title": "Mitt Romney’s support of Ketanji Brown Jackson unleashes conservative vitriol"
  },
  {
    "id": 1719,
    "mediaId": 2634,
    "date": "2022-04-06",
    "sentence": "That’s the case with another charter member, Representative <span class='selected-term'>Paul Gosar</span>, who posted an animated video of himself killing Representative Alexandria Ocasio-Cortez.",
    "author": "Timothy Noah",
    "title": "Steve Bannon Said Trump Reminded Him of Hitler. He Meant It as a Compliment."
  },
  {
    "id": 972,
    "mediaId": 2636,
    "date": "2022-04-07",
    "sentence": "In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives <span class='selected-term'>Paul Gosar</span> and Andy Biggs and State Representative Mark Finchem, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement.",
    "author": "",
    "title": "Legal Effort Expands to Disqualify Republicans as ‘Insurrectionists’"
  },
  {
    "id": 981,
    "mediaId": 2550,
    "date": "2022-04-07",
    "sentence": "Greene recently escaped meaningful rebuke from Republican leaders when she and Rep. <span class='selected-term'>Paul Gosar</span> spoke at a white nationalist event.",
    "author": "Laura Clawson",
    "title": "Jimmy Kimmel claps back after Marjorie Taylor Greene says she reported his joke to the police"
  },
  {
    "id": 1348,
    "mediaId": 2808,
    "date": "2022-04-07",
    "sentence": "By contrast, Democrats have utterly failed to elevate the profiles of sinister figures like Reps. <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene, Madison Cawthorn or Lauren Boebert.",
    "author": "Mona Charen",
    "title": "Democrats need to get better at politics, fast"
  },
  {
    "id": 114,
    "mediaId": 2550,
    "date": "2022-04-09",
    "sentence": "Arizona Rep. <span class='selected-term'>Paul Gosar</span>, whom God created to conclusively disprove white supremacy, is trying to explain away his video appearance at shrieking anti-Semite Nick Fuentes’ white power-palooza carnival in February, and that explanation is just as craven as you might imagine.",
    "author": "",
    "title": "Paul Gosar explains yet another appearance at a white nationalist conference by blaming his staff"
  },
  {
    "id": 851,
    "mediaId": 2629,
    "date": "2022-04-10",
    "sentence": "By contrast, Democrats have utterly failed to elevate the profiles of sinister figures like Reps. <span class='selected-term'>Paul Gosar</span>, Marjorie Taylor Greene, Madison Cawthorn or Lauren Boebert.",
    "author": "",
    "title": "Democrats Need To Get Better At Politics, And Fast"
  },
  {
    "id": 867,
    "mediaId": 2629,
    "date": "2022-04-17",
    "sentence": "Her colleagues in the House include <span class='selected-term'>Paul Gosar</span> and Matt Gaetz and Lauren Boebert and Louie Gohmert and, sigh, many more.",
    "author": "Mona Charen",
    "title": "Is There Any Way To Isolate Political Extremists? Yes"
  },
  {
    "id": 348,
    "mediaId": 2621,
    "date": "2022-04-17",
    "sentence": "“But Lauren Boebert, and Marjorie Taylor Greene, and <span class='selected-term'>Paul Gosar</span>.",
    "author": "Ken Meyer",
    "title": "GOP Congressman Says the Republican Party is in ‘Troubled Waters’ Thanks to the Marjorie Taylor Greene ‘Element’"
  },
  {
    "id": 396,
    "mediaId": 2608,
    "date": "2022-04-19",
    "sentence": "The group previously filed similar actions against Rep. Madison Cawthorn (R-N.C.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) on the same grounds, citing the 14th Amendment’s disqualification clause.",
    "author": "Adam Klasfeld",
    "title": "Federal Judge Refuses to Block Effort to Disqualify Marjorie Taylor Greene from Office Under 14th Amendment ‘Insurrection’ Prohibition"
  },
  {
    "id": 45,
    "mediaId": 2662,
    "date": "2022-04-19",
    "sentence": "HERE IS THE SILLY VIDEO Rep. <span class='selected-term'>Paul Gosar</span> Posted that Tyrant Pelosi Is Using to Demand He is Removed from His Congressional Committees — What a Joke\nNow Republicans are weighing in on imposing term limits on committee leadership positions if the GOP retakes the House of Representatives next year.",
    "author": "Jim Hoft",
    "title": "Kevin McCarthy Says GOP Could Strip Crooked Democrats from Committee Leadership Positions — DON’T BELIEVE IT"
  },
  {
    "id": 712,
    "mediaId": 2629,
    "date": "2022-04-21",
    "sentence": "“It is absurd to claim that a sitting member of the United States Congress advocated for the overthrown of the United States government,” said Arizona attorney Alexander Kolodin, who represents Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), whose public support of the insurrection is also well-known, during an April 20 state court hearing in Phoenix where the group’s lawsuit challenging the candidacy of Gosar and two other pro-insurrection candidates was heard.",
    "author": "Steven Rosenfeld",
    "title": "Marjorie Taylor Greene Facing Questions Under Oath Over January 6 Role"
  },
  {
    "id": 768,
    "mediaId": 2699,
    "date": "2022-04-22",
    "sentence": "“I do not remember” was Greene’s response to multiple questions about whether she spoke to government officials about the run-up to the Capitol attack, including election deniers Reps. Andy Biggs (R-AZ) and <span class='selected-term'>Paul Gosar</span> (R-AZ) and anyone in the White House.",
    "author": "Corbin Bolies",
    "title": "‘Oh No, Wait!’: Marjorie Taylor Greene’s Own Words Haunt Her"
  },
  {
    "id": 789,
    "mediaId": 2608,
    "date": "2022-04-22",
    "sentence": "Their previous efforts have targeted Rep. Madison Cawthorn (R-N.C.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) on the same grounds.",
    "author": "Adam Klasfeld",
    "title": "‘This Is a Solemn Occasion’: Georgia Voters Fight to Disqualify Marjorie Taylor Greene from Ballot, Citing 14th Amendment Bar on ‘Insurrection’"
  },
  {
    "id": 488,
    "mediaId": 4040,
    "date": "2022-04-22",
    "sentence": "That’s why they’re coming after me, and they’re coming after Andy Biggs, <span class='selected-term'>Paul Gosar</span>, they went after Madison [Cawthorn].”\nAnd who does Greene believe is behind it?",
    "author": "Kristen Doerer",
    "title": "Marjorie Taylor Greene Says Legal Challenge to Take Her Off the Ballot Is a ‘Globalist’ Ploy for a ‘One World Government’"
  },
  {
    "id": 923,
    "mediaId": 2608,
    "date": "2022-04-22",
    "sentence": "Asked whether she knew activist Ali Alexander—whose suspected connection to Jan. 6 is currently being scrutinized by Congress and the Department of Justice—Greene replied that she didn’t “really.”\nThe non-profit group Free Speech for People brought similar against Rep. Madison Cawthorn (R-N.C.) and Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.) on the same grounds.",
    "author": "Adam Klasfeld",
    "title": "Seeking to Prevent Her Disqualification, Rep. Marjorie Taylor Greene Claims Under Oath That She Can’t Remember Much About Talks Before Jan. 6"
  },
  {
    "id": 311,
    "mediaId": 6676,
    "date": "2022-04-22",
    "sentence": "Similar challenges have been filed against other Republican lawmakers, including Reps. Andy Biggs (R-Ariz.), <span class='selected-term'>Paul Gosar</span> (R-Ariz.) and Madison Cawthorn (R-N.C.), though a federal judge has blocked the challenge to Cawthorn’s ability to appear on the ballot.",
    "author": "Max Greenwood",
    "title": "Greene rebuffs Jan. 6 criticism during tense hearing"
  },
  {
    "id": 281,
    "mediaId": 2672,
    "date": "2022-04-22",
    "sentence": "“I don’t remember.”\nShe was asked if she talked to Rep. Andy Biggs (R-Ariz.)\n“I don’t remember.”\nShe was asked if she talked to Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.)\n“Sorry, I don’t remember.”\nWhat about anyone in the White House?",
    "author": "Ryan Bort",
    "title": "‘I Don’t Remember’: Marjorie Taylor Greene Comes Down With Case of Jan. 6 Amnesia While Under Oath"
  }
]