[
  {
    "id": 4016,
    "mediaId": 2621,
    "date": "2022-03-02",
    "sentence": "Reps. <span class='selected-term'>Paul Gosar</span> (R-AZ), Matt Rosendale (R-MT), and Thomas Massie (R-KY) were the only three members to vote against a resolution that overwhelmingly passed the House of Representatives on Wednesday to condemn Russia over its military invasion of Ukraine.",
    "author": "Jackson Richman",
    "title": "Republicans Paul Gosar, Matt Rosendale, and Thomas Massie Are Sole Votes Against House Resolution Condemning Russia"
  },
  {
    "id": 3899,
    "mediaId": 2621,
    "date": "2022-03-02",
    "sentence": "The vote was 426 to three, as Reps. <span class='selected-term'>Paul Gosar</span> (R-AZ), Thomas Massie (R-KY), and Matt Rosendale (R-MT) voted against the measure.",
    "author": "Michael Luciano",
    "title": "Three House Republicans Oppose Resolution Supporting Ukraine in 426-3 Vote"
  },
  {
    "id": 3932,
    "mediaId": 2594,
    "date": "2022-03-02",
    "sentence": "The resolution approved by the House says it “stands steadfastly, staunchly, proudly and fervently behind the Ukrainian people in their fight against the authoritarian Putin regime.”\nIt calls for an immediate cease-fire and the removal of Russian forces from Ukraine, pledges U.S. support for the Ukrainian resistance and vows to provide “significant additional aid and humanitarian relief to Ukrainian refugees fleeing Russia’s aggression.”\nAll but three members of the House voted for the resolution: Republican Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky and Matt Rosendale of Montana.",
    "author": "Via AP news wire",
    "title": "US House 'staunchly, proudly' passes resolution for Ukraine"
  },
  {
    "id": 3688,
    "mediaId": 2594,
    "date": "2022-03-03",
    "sentence": "The Republicans who voted against the resolution - Reps <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky, and Matt Rosendale of Montana - were swiftly attacked on social media.",
    "author": "Sravasti Dasgupta",
    "title": "Three Republicans under fire for voting against House resolution to ‘stand with Ukraine’ amid Russia invasion"
  },
  {
    "id": 4216,
    "mediaId": 2629,
    "date": "2022-03-03",
    "sentence": "The three no votes came from Reps. <span class='selected-term'>Paul Gosar</span> of Arizona, Thomas Massie of Kentucky, and Matt Rosendale of Montana.",
    "author": "Laura Clawson",
    "title": "Three MAGA Republicans Vote No On Resolution Backing Ukraine"
  },
  {
    "id": 3680,
    "mediaId": 2550,
    "date": "2022-03-04",
    "sentence": "— Adam Kinzinger (@AdamKinzinger) March 2, 2022\nx\nDear Gosar, Rosendale, and Massie, you are not anti-war: https://t.co/U0XK7Szp9N\n— Adam Kinzinger (@AdamKinzinger) March 2, 2022\nx\n<span class='selected-term'>Paul Gosar</span> joins with two other Republicans to vote no on a resolution supporting the people of Ukraine pic.twitter.com/7WZM4CFyuz\n— Acyn (@Acyn) March 2, 2022\nx\nFascist pro-Putin MAGA traitors Paul Gosar, Thomas Massie, & Matt Rosendale just voted against a resolution to help the people of Ukraine.",
    "author": "",
    "title": "Disgust abounds after three House Republicans vote no on resolution supporting Ukraine"
  },
  {
    "id": 2794,
    "mediaId": 2526,
    "date": "2022-03-08",
    "sentence": "[Emphasis added]\nReps. Andy Biggs (R-AZ), Bob Good (R-VA), Matt Gaetz (R-FL), <span class='selected-term'>Paul Gosar</span> (R-AZ), Jody Hice (R-GA), Mary Miller (R-IL), Ralph Norman (R-SC), Bill Posey (R-FL), and Randy Weber (R-TX) are co-sponsoring the legislation.",
    "author": "John Binder",
    "title": "Matt Rosendale: No Taxpayer Money for Ukraine Until Border Wall Is Done"
  },
  {
    "id": 3060,
    "mediaId": 2641,
    "date": "2022-03-08",
    "sentence": "Rosendale wrote on Twitter that “the American people are sick and tired of career politicians consistently putting the interests of foreign nations above our own, we must put America first.”\nLast month, Rosendale introduced the “Secure America’s Borders First Act.”\nAccording to Breitbart, Rosendale’s bill, which is co-sponsored by Reps. Andy Biggs, R-Ariz., Bob Good, R-Va., Matt Gaetz, R-Fla., <span class='selected-term'>Paul Gosar</span>, R-Ariz., Jody Hice, R-Ga., Mary Miller, R-Ill., Ralph Norman, R-S.C., Bill Posey, R-Fla., and Randy Weber, R-Texas., would require the federal government to restart building the border wall and to continue building 30-foot steel bollard barriers along the border with Mexico.",
    "author": "Jeremy Frankel",
    "title": "Rep. Rosendale Leads Effort to Stop Ukraine Funding Without Border Wall Completion"
  },
  {
    "id": 2805,
    "mediaId": 2550,
    "date": "2022-03-10",
    "sentence": "There were just three votes against that resolution of support: Massie, <span class='selected-term'>Paul Gosar</span>, and Matt Rosendale.",
    "author": "Mark Sumner",
    "title": "Ukraine update: 'R' is for Russia"
  }
]