[
  {
    "id": 6534,
    "mediaId": 2810,
    "date": "2022-01-13",
    "sentence": "A number of House members have been identified by planners of the “Stop the Steal” rally as having collaborated with them—either directly or via assigned staffers—including Marjorie Taylor Greene of Georgia, <span class='selected-term'>Paul Gosar</span> of Arizona, Lauren Boebert of Colorado, Mo Brooks of Alabama, Andy Biggs of Arizona, and Louie Gohmert of Texas.",
    "author": "John Nichols",
    "title": "Madison Cawthorn’s Incitement of Insurrection Should Knock Him Off the Ballot"
  },
  {
    "id": 6696,
    "mediaId": 2716,
    "date": "2022-01-25",
    "sentence": "They include Cawthorn and six other House members: Rep. Andy Biggs (R-Ariz.); Rep. Lauren Boebert (R-Colo.); Rep. Mo Brooks (R-Ala.); Rep. Louie Gohmert (R-Texas); Rep. <span class='selected-term'>Paul Gosar</span> (R-Ariz.); and Rep. Marjorie Taylor Greene (R-Ga.).",
    "author": "Rick Henderson",
    "title": "The risky plan to prevent Congress' Jan. 6 sympathizers from running for re-election"
  },
  {
    "id": 6490,
    "mediaId": 2512,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 6414,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 3555,
    "mediaId": 2637,
    "date": "2022-03-18",
    "sentence": "Representatives Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> participated in a white nationalist conference last month where participants applauded Russia and chanted Putin’s name.",
    "author": "",
    "title": "Top U.S. House Republican slams party hardliner over Zelenskiy 'thug' comment"
  },
  {
    "id": 2021,
    "mediaId": 2512,
    "date": "2022-03-21",
    "sentence": "The party offered no public condemnation of Representatives Majorie Taylor Greene (R-Georgia) and <span class='selected-term'>Paul Gosar</span> (R-Arizona) participating in a White nationalist conference in late February.",
    "author": "Brandon Gage",
    "title": "North Carolina paper slams GOP for coddling party’s fringe — and handing them ‘the tools to dismantle democracy’"
  },
  {
    "id": 2498,
    "mediaId": 2699,
    "date": "2022-03-24",
    "sentence": "Generally, they are fellow far-right lawmakers like Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ).",
    "author": "Sam Brodey",
    "title": "Madison Cawthorn Committed the One Unforgivable Sin of Politics"
  },
  {
    "id": 2475,
    "mediaId": 5308,
    "date": "2022-03-29",
    "sentence": "House Minority Leader Kevin McCarthy, who has come under scrutiny for refusing to criticize the far-right of his party—including former President Donald Trump and Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>—reportedly said he would have a meeting with Cawthorn to talk about his comments.",
    "author": "Paul Blest",
    "title": "Congress Would Like to Know More About Madison Cawthorn’s ‘Cocaine’ ‘Orgies’ Claim"
  },
  {
    "id": 2467,
    "mediaId": 2872,
    "date": "2022-03-30",
    "sentence": "This is a man, after all, who vowed to re-seat Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> after they were stripped of their committee assignments for palling around with Nazis and joking (??)",
    "author": "Rafi Schwartz",
    "title": "Madison Cawthorn’s coke orgy comments earned him a very stern talking-to"
  },
  {
    "id": 2392,
    "mediaId": 2894,
    "date": "2022-03-30",
    "sentence": "Of course, Cawthorn isn't the only controversial member in the GOP ranks: Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, for example, both recently addressed a conference organized by a White nationalist, and received little more than a verbal rebuke from their leaders and colleagues.",
    "author": "",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 2245,
    "mediaId": 2643,
    "date": "2022-03-30",
    "sentence": "Arizona Republican <span class='selected-term'>Paul Gosar</span> was also at the America First Political Action Conference (AFPAC) in Florida.",
    "author": "Alexandra Hutzler",
    "title": "McCarthy Slammed for Being Harsher on Cawthorn Than Marjorie Taylor Greene"
  },
  {
    "id": 1683,
    "mediaId": 2688,
    "date": "2022-03-31",
    "sentence": "Republicans’ outrage over Cawthorn’s Veep-esque account of congressional indiscretions stands in glaring contrast to their muted response to Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) speaking at a white nationalist conference last month.",
    "author": "Matt Shuham",
    "title": "North Carolina Sen. Tillis Backs Cawthorn’s Rival Amid Orgy-Gate"
  },
  {
    "id": 2734,
    "mediaId": 2532,
    "date": "2022-03-31",
    "sentence": "McCarthy's rebukes came after House Democrats had lambasted him for not doing enough to address behavior from other Republican members, namely Rep. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, who both spoke at a gathering of white nationalists last month.",
    "author": "Melissa Quinn",
    "title": "McCarthy rebukes Cawthorn over his claims that lawmakers have invited him to orgies and use drugs"
  },
  {
    "id": 1550,
    "mediaId": 2790,
    "date": "2022-04-01",
    "sentence": "This was a swifter-than-usual response from the GOP leader\nMcCarthy has had to step in to condemn various rhetoric and actions taken by members of his conference, from denouncing language used by Rep. Marjorie Taylor Greene that equated COVID-19 safety measures with the treatment of Jews during the Holocaust and more recently calling it \"appalling\" that Greene and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona attended an event led by a white nationalist.",
    "author": "Barbara Sprunt",
    "title": "Rep. Cawthorn's sordid tales of life in Congress frustrate GOP leadership"
  },
  {
    "id": 236,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "That’s in part because the conservative Christian political party may be having all kinds of non-Christian-style drug-fueled orgies (if Madison is to be believed), and also because Cawthorn and other Republican members of Congress like Lauren Boebert and <span class='selected-term'>Paul Gosar</span> represent a new tea party-inspired rat that has climbed aboard the sinking Republican ship.",
    "author": "",
    "title": "GOP civil war: conservative outlet reports Madison Cawthorn’s outrageous spending of taxpayer money"
  },
  {
    "id": 368,
    "mediaId": 2644,
    "date": "2022-04-22",
    "sentence": "Only the People have the right to choose who they send to Congress.”\nSimilar challenges have been brought up against other Republican members of Congress, including Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs of Arizona as well as North Carolina Rep. Madison Cawthorn.",
    "author": "Callie Patteson",
    "title": "Marjorie Taylor Greene first congressperson to testify about Jan. 6"
  }
]