[
  {
    "id": 6958,
    "mediaId": 2621,
    "date": "2022-01-19",
    "sentence": "The Anti-Defamation League describes Fuentes as “a white supremacist leader and organizer and podcaster who seeks to forge a white nationalist alternative to the mainstream GOP.”\nFuentes is the leader of the so-called Groyper Army and notably hosted Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) as a keynote speaker at a far-right conference he held last year as counter-programming to CPAC.",
    "author": "Alex Griffing",
    "title": "House Jan. 6 Committee Subpoenas Far-Right ‘Groypers’ Nick Fuentes and Patrick Casey"
  },
  {
    "id": 4573,
    "mediaId": 2658,
    "date": "2022-02-23",
    "sentence": "“‘This never would have happened with us had I been in office — not even thinkable,’ Trump said in a Tuesday radio interview, describing Putin’s recognition of Ukrainian separatist regions as ‘savvy.’”\n— One example of the strange new coalitions being forged on the fly: A bipartisan group of 43 lawmakers in Congress — ranging from Reps. <span class='selected-term'>PAUL GOSAR</span> (R-Ariz.) to ALEXANDRIA OCASIO-CORTEZ (D-N.Y.) — is asking Biden to “seek congressional authorization before directly involving U.S. troops in the emerging Russia-Ukraine conflict,” our Anthony Adragna reports for Congress Minutes.",
    "author": "",
    "title": "POLITICO Playbook: GOP pans Biden’s first taste of sanctions"
  },
  {
    "id": 3672,
    "mediaId": 2658,
    "date": "2022-03-07",
    "sentence": "MCCARTHY’S FRINGE PROBLEM — House Minority Leader KEVIN MCCARTHY promised to talk with Reps. MARJORIE TAYLOR GREENE (R-Ga.) and <span class='selected-term'>PAUL GOSAR</span> (R-Ariz.) after they spoke at a white nationalist event, but he hasn’t done so yet, Olivia Beavers reports.",
    "author": "",
    "title": "POLITICO Playbook: Russia escalates brutality, Congress steps up response"
  },
  {
    "id": 2499,
    "mediaId": 2629,
    "date": "2022-03-29",
    "sentence": "It took him a week to speak to Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who had tweeted a violent video featuring Rep. Alexandria Ocasio-Cortez.",
    "author": "Emily Singer",
    "title": "House Republicans Enraged By Cawthorn’s ‘Orgy’ And 'Cocaine Bump' Claims"
  },
  {
    "id": 1117,
    "mediaId": 2664,
    "date": "2022-04-01",
    "sentence": "On Friday, POLITICO reported that Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) is now blaming his video attendance of the America First Political Action Conference headed up by white nationalist Nick Fuentes as a \"staffing error\" — and that he had no idea who Fuentes was or what ideology the conference was promoting.",
    "author": "Matthew Chapman",
    "title": "Paul Gosar says he's 'given up' on collaborating with white nationalist who has 'a problem with his mouth'"
  }
]