[
  {
    "id": 6576,
    "mediaId": 2550,
    "date": "2022-01-21",
    "sentence": "Rising to his defense was Congressman <span class='selected-term'>Paul Gosar</span> of Arizona, one of the Republicans with his own deep connections to the Jan. 6 insurrection, who demanded that federal authorities explain Fuentes’ supposed ban.",
    "author": "",
    "title": "White nationalist Fuentes gets subpoena from Jan. 6 committee, but he’s preparing for mockery"
  },
  {
    "id": 6552,
    "mediaId": 2547,
    "date": "2022-01-22",
    "sentence": "Rising to his defense was Congressman <span class='selected-term'>Paul Gosar</span> of Arizona, one of the Republicans with his own deep connections to the Jan. 6 insurrection, who demanded that federal authorities explain Fuentes’ supposed ban.",
    "author": "David Neiwert",
    "title": "Jan 6 Committee Subpoenas White Nationalist Nicholas Fuentes"
  },
  {
    "id": 3052,
    "mediaId": 2512,
    "date": "2022-03-09",
    "sentence": "Ron DeSantis participated in the Republican Party’s attempt to sanitize January 6 by refusing to call the attack an insurrection.”\nOrlando, the Herald’s editorial board adds, was where the 2022 America First Political Action Conference was held in February — with Republican speakers who included Rep. Marjorie Taylor Greene of Georgia and Rep. <span class='selected-term'>Paul Gosar</span> of Arizona.",
    "author": "Alex Henderson",
    "title": "Miami newspaper’s blistering editorial: 'Republicans have a white nationalist problem'"
  },
  {
    "id": 1658,
    "mediaId": 2699,
    "date": "2022-03-31",
    "sentence": "Yet another Freedom Caucus member, Rep. <span class='selected-term'>Paul Gosar</span>, has emerged essentially unscathed after speaking at a white supremacist conference and posting a violent anime depicting the murder of Rep. Alexandria Ocasio-Cortez.",
    "author": "Wajahat Ali",
    "title": "The GOP Was Hard to Embarrass. Then Came Madison Cawthorn."
  },
  {
    "id": 1201,
    "mediaId": 2547,
    "date": "2022-04-09",
    "sentence": "That could be bad news for MAGA Reps. <span class='selected-term'>Paul Gosar</span>, Andy Biggs and Mo Brooks.",
    "author": "NewsHound Ellen",
    "title": "‘Stop The Steal’s’ Ali Alexander Flips?"
  },
  {
    "id": 447,
    "mediaId": 2636,
    "date": "2022-04-12",
    "sentence": "In the run-up to Jan. 6, Mr. Alexander publicly discussed a pressure campaign against lawmakers that was meant to stop the final electoral count, saying he was working with Representative Mo Brooks of Alabama and Representatives Andy Biggs and <span class='selected-term'>Paul Gosar</span> of Arizona, all Republicans.",
    "author": "",
    "title": "Before Riot, Operative Urged Trump Supporters to ‘Descend on the Capitol’ on Jan. 6"
  },
  {
    "id": 408,
    "mediaId": 2859,
    "date": "2022-04-16",
    "sentence": "Many of AFPAC’s speakers — Arizona Rep. <span class='selected-term'>Paul Gosar</span>, Idaho Lt. Gov.",
    "author": "Tarpley Hitt",
    "title": "The front lines of ‘America First’"
  },
  {
    "id": 22,
    "mediaId": 2664,
    "date": "2022-04-16",
    "sentence": "In a video made before the insurrection, Ali Alexander claimed that he and US Reps. Mo Brooks, Andy Biggs and <span class='selected-term'>Paul Gosar</span> “schemed up putting maximum pressure on Congress while they were voting.”\nThe video circulated on social media but was later deleted.",
    "author": "Lindsay Beyerstein",
    "title": "We now have undeniable proof of a coordinated Republican effort to subvert the 2020 election"
  },
  {
    "id": 352,
    "mediaId": 2629,
    "date": "2022-04-16",
    "sentence": "In a video made before the insurrection, Ali Alexander claimed that he and Reps. Mo Brooks, Andy Biggs, and <span class='selected-term'>Paul Gosar</span> “schemed up putting maximum pressure on Congress while they were voting.”\nThe video circulated on social media but was later deleted.",
    "author": "Lindsay Beyerstein",
    "title": "Former Stone Aide Confirms GOP Plot To Steal 2020 Election"
  }
]