[
  {
    "id": 6482,
    "mediaId": 2512,
    "date": "2022-01-19",
    "sentence": "Last February, Fuentes and his groypers drew national attention when Rep. <span class='selected-term'>Paul Gosar</span> — the notorious Arizona Republican who may be the most right-wing member of Congress — delivered the keynote address at their annual America First Political Action Conference in Orlando.",
    "author": "",
    "title": "Texas GOP candidate won’t ditch overt white nationalist staffer — blames 'cancel culture': report"
  },
  {
    "id": 5710,
    "mediaId": 2512,
    "date": "2022-02-03",
    "sentence": "Hullihan has the backing of U.S. Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, a member of the Freedom Caucus.",
    "author": "Patrick Svitek",
    "title": "National GOP proxy war breaks out in crowded primary to succeed retiring Texas Republican"
  },
  {
    "id": 5768,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Controversial Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) is taking a stand in a GOP primary two states to the east as Republicans battle each other in the 2022 midterms.",
    "author": "Bob Brigham",
    "title": "Paul Gosar endorses ‘dumbest guy in Congress’ in primary against Texas AG Ken Paxton"
  },
  {
    "id": 5896,
    "mediaId": 2699,
    "date": "2022-02-09",
    "sentence": "Nine other candidates are in the race, but the only one with significant resources is another veteran, Jonathan Hullihan, who touts the backing of far-right Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ).",
    "author": "Sam Brodey",
    "title": "The Drama in This Crazy Texas Primary Explains Trump’s GOP"
  },
  {
    "id": 4121,
    "mediaId": 2528,
    "date": "2022-03-03",
    "sentence": "Jonathan Hullihan said he was \"blessed and honored\" to have received the endorsement of Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, a top Trump supporter who the US House in November censured for tweeting an edited anime video depicting him killing Rep. Alexandria Ocasio-Cortez of New York with a sword.",
    "author": "Camila DeChalus",
    "title": "Less Trump, more winning: Why the results of one Republican primary in Texas could give hope to new conservative candidates who don't endlessly venerate the former president"
  }
]