[
  {
    "id": 2567,
    "mediaId": 2528,
    "date": "2022-03-20",
    "sentence": "Democrats also removed Rep. <span class='selected-term'>Paul Gosar</span>, a Republican from Arizona, from his committee assignments after he posted an edited anime video showing him killing Rep. Alexandria Ocasio-Cortez.",
    "author": "Yelena Dzhanova",
    "title": "Kevin McCarthy says Democratic Rep. Adam Schiff will be removed from House Intelligence Committee if GOP wins majority in midterms"
  },
  {
    "id": 2661,
    "mediaId": 2627,
    "date": "2022-03-21",
    "sentence": "Because as far as Republicans are concerned, Democrats effectively rewrote the rules when they stripped two far-right congressional extremists — Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona — of their committee assignments.",
    "author": "Steve Benen",
    "title": "McCarthy readies plan to kick Schiff off House Intelligence panel"
  },
  {
    "id": 2027,
    "mediaId": 2664,
    "date": "2022-03-21",
    "sentence": "In fact, Republicans have made clear they are itching to do this in part as revenge for Democrats taking the step of stripping Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) of their committee assignments for extremist behavior, something that was itself unprecedented because generally both parties have policed their own members and revoked assignments themselves when members are this embroiled in controversy.",
    "author": "Matthew Chapman",
    "title": "Kevin McCarthy slammed for plans to boot Adam Schiff from the House Intelligence Committee"
  },
  {
    "id": 2146,
    "mediaId": 2724,
    "date": "2022-03-21",
    "sentence": "— Kevin McCarthy (@GOPLeader) March 20, 2022\nRELATED: McCarthy May Give Marjorie Taylor Greene, <span class='selected-term'>Paul Gosar</span> ‘Better’ Committee Assignments If GOP Takes Back Congress\nWill McCarthy Boot Omar and Swalwell Too?",
    "author": "Rusty Weiss",
    "title": "McCarthy Vows To Kick Adam Schiff Off Intel Committee If GOP Wins Back The House"
  }
]