[
  {
    "id": 6777,
    "mediaId": 2522,
    "date": "2022-01-21",
    "sentence": "He aggressively went after Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) for his anime depicting an attack on Rep. Alexandria Ocasio-Cortez (D-NY).",
    "author": "Terresa Monroe-Hamilton",
    "title": "Clinton labor secretary blames his tweet calling for the assault of Sen. Sinema on Republicans"
  },
  {
    "id": 6414,
    "mediaId": 2664,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 6490,
    "mediaId": 2512,
    "date": "2022-01-26",
    "sentence": "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, <span class='selected-term'>Paul Gosar</span> of Arizona, and Lauren Boebert of Colorado, face similar accusations, but their state’s election laws present higher hurdles for challenges to their candidate qualifications.",
    "author": "David Badash",
    "title": "Madison Cawthorn retains high-powered GOP attorney for case seeking to disqualify him as an insurrectionist"
  },
  {
    "id": 5490,
    "mediaId": 2550,
    "date": "2022-02-02",
    "sentence": "Unfortunately, we are living in desperate times and the only way that Cheney and Kinzinger can survive is to do the right thing and bring criminal charges to light about the complicity and the possible conspiracy by Republicans like Ted Cruz, Josh Hawley, Louie Gohmert, Mo Brooks, Marjorie Taylor Greene, Lauren Boebert, Matt Gaetz, <span class='selected-term'>Paul Gosar</span>, and others, to overturn our democratically elected 46th President.",
    "author": "",
    "title": "Rep. Adam Kinzinger brings a bazooka to Josh Hawley's knife fight"
  },
  {
    "id": 5805,
    "mediaId": 2584,
    "date": "2022-02-11",
    "sentence": "Last November, <span class='selected-term'>Paul Gosar</span>, Republican representative for Arizona, was officially censured by the House after sharing an animated video depicting him killing the Democratic congresswoman Alexandria Ocasio-Cortez and attacking Biden.",
    "author": "Gloria Oladipo",
    "title": "‘Disgusting’: Republican Senate hopeful condemned over ‘showdown’ TV ad"
  },
  {
    "id": 5730,
    "mediaId": 2629,
    "date": "2022-02-11",
    "sentence": "Last November, staffers for Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ) posted an \"anime\"-style video showing him decapitating Rep. Alexandria Ocasio-Cortez (D-NY) and attacking Biden with swords.",
    "author": "Josh Israel",
    "title": "Arizona GOP Candidate Posts Video Threatening To Shoot Democrats"
  },
  {
    "id": 5825,
    "mediaId": 2512,
    "date": "2022-02-11",
    "sentence": "Last November, <span class='selected-term'>Paul Gosar</span>, Republican representative for Arizona, was officially censured by the House after sharing an animated video depicting him killing the Democratic Congresswoman Alexandria Ocasio-Cortez and attacking Biden.”\nShannon Watts, founder of the group Moms Demand Action for Gun Sense in America, slammed the ad as “disgusting”:\nDISGUSTING: Former Rep. Gabby Giffords was shot and and seriously wounded 10 years ago.",
    "author": "Alex Henderson",
    "title": "Arizona Republican Senate hopeful slammed as 'disgusting' for violent campaign ad"
  },
  {
    "id": 4590,
    "mediaId": 2512,
    "date": "2022-02-23",
    "sentence": "“Meanwhile, radicals like Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, who fantasize about committing acts of violence against Democrats, are embraced by fellow Republicans, proving they are not just an extremist fringe that has ‘hijacked’ the Party, as Pelosi suggested.”\nThe history professor concludes his op-ed on a disturbing note, arguing that Democrats are being naïve if they underestimate the “radicalization” of the 2022 GOP.",
    "author": "Alex Henderson",
    "title": "There can be no ‘politics as usual’ when ‘radicalized’ Republicans reject democracy itself: historian"
  },
  {
    "id": 3981,
    "mediaId": 2746,
    "date": "2022-02-27",
    "sentence": "“Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, I don’t know them,” Mr. Romney, Utah Republican, told CNN’s “State of the Union.” “I’m reminded of the old line from the Butch Cassidy and Sundance Kid movie, where one character says, ‘Morons, I have morons on my team.’”\n“I would think that anybody that would sit down with a white nationalist and speak at their conference would certainly be missing a few IQ points,” he said.",
    "author": "Tom Howell Jr.",
    "title": "Sen. Mitt Romney rips ‘morons’ in GOP after lawmakers address White nationalist conference"
  },
  {
    "id": 3979,
    "mediaId": 2590,
    "date": "2022-02-27",
    "sentence": "It’s, as you’ve indicated, speaking of evil, it’s evil as well,” Romney told CNN’s Dana Bash on “State of the Union.”\nAdvertisement\nHe went on to call out Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) for speaking at the third annual America First Political Action Conference, which was organized by white nationalist figurehead Nick Fuentes in Orlando, Florida.",
    "author": "Nina Golgowski",
    "title": "Sen. Mitt Romney Slams GOP 'Morons' At 'Evil' White Nationalist Conference"
  },
  {
    "id": 4141,
    "mediaId": 2593,
    "date": "2022-02-28",
    "sentence": "However, he said, “Standing up for freedom is the right thing to do in America, and anything less than that, in my opinion, is unworthy of American support.”\nRomney’s comments come after Reps. Marjorie Taylor Greene (R-Ga.) and <span class='selected-term'>Paul Gosar</span> (R-Ariz.) spoke at a white nationalist conference.",
    "author": "Bradley Cortright",
    "title": "'Almost Treasonous': Romney Denounces 'Pro-Putin Sentiment' Among Some Republicans"
  },
  {
    "id": 4128,
    "mediaId": 2643,
    "date": "2022-03-01",
    "sentence": "Rogers' censure follows rebukes by national Republican leaders against U.S. GOP Representatives Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona who also spoke at the conference.",
    "author": "Daniel Villarreal",
    "title": "GOP Senators Censure Colleague for Speaking at White Nationalist Conference"
  },
  {
    "id": 4120,
    "mediaId": 2664,
    "date": "2022-03-01",
    "sentence": "Nationally, several prominent Republicans took aim at two GOP members of Congress who spoke at AFPAC, Arizona’s <span class='selected-term'>Paul Gosar</span> and Georgia’s Marjorie Taylor Greene.",
    "author": "Jeremy Duda",
    "title": "Trump-loving lawmaker threatens to 'destroy' any Republican who tries to punish her for attending white nationalist conference"
  },
  {
    "id": 4094,
    "mediaId": 2621,
    "date": "2022-03-01",
    "sentence": "GOP Reps. <span class='selected-term'>Paul Gosar</span> and Marjorie Taylor Greene also spoke at his controversial conference over the weekend.",
    "author": "Alex Griffing",
    "title": "GOP-Controlled AZ Senate Censures Trump-Backed Republican Lawmaker Wendy Rogers"
  },
  {
    "id": 3872,
    "mediaId": 2641,
    "date": "2022-03-02",
    "sentence": "Rep. <span class='selected-term'>Paul Gosar</span>, R-Ariz.\nSen. Lindsey Graham, R-S.C., was also introducing a resolution in the Senate that would back Ukraine's claim in international court that Putin and his \"cronies\" have committed war crimes.",
    "author": "Eric Mack",
    "title": "House Passes Resolution to Support for Ukraine 426-3"
  },
  {
    "id": 3669,
    "mediaId": 2664,
    "date": "2022-03-02",
    "sentence": "While Lake did not respond to questions about Rogers, she has not distanced herself from Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), who spoke at the same Nick Fuentes' white nationalist America First Political Action Conference in Florida.",
    "author": "Bob Brigham",
    "title": "Censured Republican is so toxic she’s become an issue in Arizona governor’s race: report"
  },
  {
    "id": 4508,
    "mediaId": 5308,
    "date": "2022-03-02",
    "sentence": "In addition to Rogers, two current members of Congress, Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span>, spoke at the conference.",
    "author": "Paul Blest",
    "title": "Republicans Have Finally Had Enough of Wendy Rogers"
  },
  {
    "id": 4354,
    "mediaId": 4032,
    "date": "2022-03-04",
    "sentence": "McCarthy told a CNN reporter on Monday that it was “appalling and wrong” for Republican Reps. Marjorie Taylor Greene, R-Ga., and <span class='selected-term'>Paul Gosar</span>, R-Ariz., to speak to the annual America First Political Action Conference, or AFPAC.",
    "author": "Michelle Malkin",
    "title": "AFPAC Versus America Last GOP"
  },
  {
    "id": 3575,
    "mediaId": 2911,
    "date": "2022-03-14",
    "sentence": "The Senate has also censured nine of its own members, and in 2021, the U.S. House of Representatives censured its 24th member, Rep. <span class='selected-term'>Paul Gosar</span> of Arizona, for, among other things, posting an anime video of himself killing a fellow member.",
    "author": "Seth Masket",
    "title": "How An Uptick In Censures Among Local Republicans Signals A Growing Radicalism"
  },
  {
    "id": 2363,
    "mediaId": 2526,
    "date": "2022-03-26",
    "sentence": "Kelly reportedly took in more than $55,000 in contributions during the last fundraising quarter of 2021 from “PACs of corporate trade groups and the Senate leadership committees of many of his fellow Democrats.”\nIn 2021, he also took heat from the Arizona Republican Party chair Kelli Ward, Rep. <span class='selected-term'>Paul Gosar</span> (R-AZ), and the National Republican Senatorial Committee (NRSC) for being “missing in action” and for the lack of leadership the freshman member has in the Senate.",
    "author": "Jacob Bliss",
    "title": "Poll: Democrat Mark Kelly Trails Generic Republican in AZ Senate Race"
  },
  {
    "id": 2017,
    "mediaId": 2512,
    "date": "2022-03-27",
    "sentence": "In a now-deleted Periscope video posted in December 2020, Alexander also claimed that Brooks was one of three members of Congress — along with Reps. <span class='selected-term'>Paul Gosar</span> and Andy Biggs, both of Arizona — who had helped plan the activities of Jan. 6.",
    "author": "Kathryn Joyce",
    "title": "Jan. 6 organizer labels former ally Rep. Mo Brooks a 'LOSER'"
  },
  {
    "id": 2392,
    "mediaId": 2894,
    "date": "2022-03-30",
    "sentence": "Of course, Cawthorn isn't the only controversial member in the GOP ranks: Reps. Marjorie Taylor Greene of Georgia and <span class='selected-term'>Paul Gosar</span> of Arizona, for example, both recently addressed a conference organized by a White nationalist, and received little more than a verbal rebuke from their leaders and colleagues.",
    "author": "",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 1578,
    "mediaId": 2629,
    "date": "2022-03-31",
    "sentence": "AFPAC also featured prerecorded speeches from Rep. <span class='selected-term'>Paul Gosar</span> of Arizona and Idaho Lt.",
    "author": "Alex Henderson",
    "title": "Neo-Nazi Fuentes Praises GOP's ’Thinly Veiled Racism’ In Attacking Jackson"
  },
  {
    "id": 1683,
    "mediaId": 2688,
    "date": "2022-03-31",
    "sentence": "Republicans’ outrage over Cawthorn’s Veep-esque account of congressional indiscretions stands in glaring contrast to their muted response to Reps. Marjorie Taylor Greene (R-GA) and <span class='selected-term'>Paul Gosar</span> (R-AZ) speaking at a white nationalist conference last month.",
    "author": "Matt Shuham",
    "title": "North Carolina Sen. Tillis Backs Cawthorn’s Rival Amid Orgy-Gate"
  },
  {
    "id": 1605,
    "mediaId": 2550,
    "date": "2022-04-01",
    "sentence": "Reps. Marjorie Taylor Greene and <span class='selected-term'>Paul Gosar</span> spoke at a white nationalist event and McCarthy had a private chat with them, then went to reporters and explicitly promised that they’d get their committee assignments back if Republicans take the House.",
    "author": "Laura Clawson",
    "title": "Republicans aren't happy Madison Cawthorn spilled the beans about cocaine orgies"
  },
  {
    "id": 1714,
    "mediaId": 2676,
    "date": "2022-04-06",
    "sentence": "UPDATE: A representative of Congressman <span class='selected-term'>Paul Gosar</span>'s campaign spoke with the Arizona Mirror after publication of their story to say the congressman would not be attending the white nationalist group's event on April 20.",
    "author": "Kelly McClure",
    "title": "GOP Rep. Paul Gosar promoted appearance at white nationalist event, but now says he is not attending"
  },
  {
    "id": 1063,
    "mediaId": 2636,
    "date": "2022-04-08",
    "sentence": "",
    "author": "",
    "title": "Trump Organization Can Keep Operating N.Y.C. Golf Course, Judge Rules"
  }
]