{
  "id": 3033,
  "mediaId": 6571,
  "date": "2022-03-16",
  "headline": "Dozens Of Candidates In Both Parties Run For Statewide And Local Congressional Seats",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2016/01/08/539c766a-fd5c-4422-aa70-6a3b1f4acbf9/thumbnail/1200x630/5320c4b6b42404807c60f582692b3b48/harrisburg.jpg",
  "link": "https://www.cbsnews.com/pittsburgh/news/dozens-of-candidates-in-both-parties-run-for-statewide-and-local-congressional-seats/",
  "mediaOutlet": "pittsburgh.cbslocal.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "They are former Congressman Lou Barletta, state Senator Jake Corman, Montgomery County Commissioner Joe Gale, political consultant Charlie Gerow, former Congresswoman Melissa Hart, state Senator Doug Mastriano, former U.S. Attorney Bill McSwain, Pittsburgh attorney Jason Richey, former Delaware County Councilman Dave White and heart surgeon Nche Zama.",
    "In Doyle's 12th Congressional District, five Democrats are running in the May primary, including Pitt Law professor Jerry Dickinson, Democratic activist and attorney Steve Irwin, state Representative Summer Lee, Northside resident Will Parker and College Access Program Director Jeff Woodard.",
    "The other big race on the ballot is U.S. senator where five Democrats filed to run, including Dr. Kevin Baumlin of Philadelphia, Lieutenant Governor John Fetterman, state Representative Malcolm Kenyatta, Jenkintown councilwoman Alexandria Khalil and Congressman Conor Lamb.",
    "Republican and Democratic voters have just nine weeks to learn about the 12 candidates running for the U.S. Senate, 11 candidates running for governor, 12 candidates running for lieutenant governor – and all the candidates who want to be a member of Congress.",
    "The Democrats include Pitt Cyber Policy Director Chris Deluzio and LGBTQ Victory Fund Vice President Sean Meloy, along with three Republicans running –- Kathy Coder of Ben Avon, Jeffrey Kilmeyer of Downtown, and Jeremy Shaffer of Pine.",
    "Political analyst Larry Ceisler says all the Democrats are liberals, but he says Irwin is more moderate than Lee and Dickinson in a diverse district that includes the city of Pittsburgh, the Mon Valley and part of Westmoreland County.",
    "The seven Republicans running for Senate include political commentator Kathy Barnette, real estate developer Jeff Bartos, attorney George Bochetto, attorney Sean Gale, McCormick, former ambassador Carla Sands and Oz.",
    "While both Democrats Fetterman and Lamb have just started television ads, two Republicans for Senate – former hedge fund CEO Dave McCormick and celebrity doctor Mehmet Oz – have been all over the airwaves.",
    "PITTSBURGH (KDKA) -- Twenty-three candidates, an unusually large number, have filed nominating petitions for the Republican and Democratic nominations for U.S. Senate and governor of Pennsylvania.",
    "It's the first time in decades that no incumbent is running for governor and United States senator on the same ballot, and that has lots of candidates thinking this is their chance.",
    "\"We're certainly facing an unprecedented election year with an unbelievable amount of candidates at the top of the ticket,\" says Mike DeVanney, a Republican political strategist.",
    "\"If you look at a district that is not majority African American, having four of the five candidates being African American and two of those being very formidable,\" says Mosley.",
    "Allegheny County Republican Chair Sam DeMarco thinks some of these Republican candidates for Senate and governor may drop out for lack of money and support.",
    "With Congressman Mike Doyle retiring after 28 years in Congress and Lamb leaving the house to run for U.S. Senate, we have two local seats up for grabs.",
    "One other race is the Democratic primary in the 16th District north of Pittsburgh currently represented by Congressman Mike Kelly, a Butler Republican.",
    "\"I would expect in the next two weeks or in the next week you may see some folks decide that maybe they'll live to fight another day,\" says DeMarco.",
    "\"Money is a significant factor in this race, as it is in many races because it is the way candidates get their message out,\" notes DeVanney.",
    "\"For the most part, there's a huge block of voters who are undecided, and that's not because they can't choose between the candidates.",
    "\"I think this congressional primary is really going to be about the ideological divide in the Democratic party,\" says Ceisler.",
    "The winner will face off against Republican Plum Borough Councilman Mike Doyle, no relation to the Democratic congressman.",
    "Besides these 23 candidates, another 12 – nine Republicans and three Democrats – are running for lieutenant governor.",
    "But not unexpectedly, only one Democrat is running for governor: Pennsylvania Attorney General Josh Shapiro.",
    "The other competitive district is Lmb's 17th District, where both parties believe they can win in November.",
    "Two Democrats, Dan Pastore of Erie and Rich Telesz of Lawrence County, want to take on Kelly.",
    "Ceisler says voters in both congressional and statewide races voters are not yet engaged.",
    "Locally, we have several hotly contested races for the U.S. House of Representatives.",
    "KDKA political editor Jon Delano breaks down what is shaping up to be a busy primary.",
    "It's really because they have not checked into the campaigns,\" says Ceisler.",
    "\"Now we have a number of candidates who are really not known in any fashion.",
    "No clear frontrunner, wide-open, and we've got nine weeks to go.\"",
    "\"It's going to be a fascinating election year for Republicans.",
    "Political analyst Khari Mosley sees this race as historic.",
    "\"It's going to be off to the races here,\" says DeVanney.",
    "Ten Republicans would like the chance to take him on.",
    "There's no heir apparent,\" says DeVanney.",
    "There's no clear frontrunner.",
    "In:\nPennsylvania\nPittsburgh"
  ]
}