{
  "id": 4069,
  "mediaId": 2732,
  "date": "2022-02-27",
  "headline": "Jeremy Shaffer, former Ross commissioner, to run for Congress",
  "image": "",
  "link": "https://triblive.com/local/regional/jeremy-shaffer-former-ross-commissioner-to-run-for-congress/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Deto",
  "authorUrl": "https://triblive.com/author/ryan-deto/",
  "termIds": [
    1546,
    2007,
    2620,
    3804,
    1171,
    4818,
    4851,
    5249,
    5285
  ],
  "sentences": [
    "Democrats running include Chris Deluzio, an Iraq War veteran and policy director of the University of Pittsburgh’s Institute for Cyber Law, Policy and Security; and Sean Meloy, a senior political advisor for the LGBTQ Victory Fund; and William Murray, an engineer.",
    "“As a congressman, I will use my skills as a problem-solver and entrepreneur to work with anyone to solve the issues that matter most to Western Pennsylvanians.”\nHe said he wants to advance economic reforms and empower parents and local schools.",
    "This cycle, Shaffer is again staking out conservative ground on promises like fiscal responsibility and establishing term limits, but he said he also has crossover appeal that would help him in a swing district like the 17th District.",
    "Shaffer, who announced his candidacy this month, has already garnered some support from local Republican officials, including endorsements from Allegheny County Councilwoman Cindy Kirk and former Allegheny County Executive Jim Roddey.",
    "That year, he ran to the right of the moderate Vulakovich and then, in the general election, attempted to brand his Democratic opponent Williams as a “socialist” with attack ads and yard signs.",
    "Other Republicans that have announced their candidacies include Tricia Staible, president of Robinson Fans Inc. manufacturing company in Zelienople; carpenter James Tomshay; and Dean Cavaretta.",
    "Shaffer ran for state Senate in 2018, where he was narrowly defeated by state Sen. Lindsey Williams, D-West View, after defeating then-state Sen. Randy Vulakovich in the Republican primary.",
    "The boundaries of the congressional district were finalized Wednesday by the state Supreme Court under a plan that redrew districts across Pennsylvania, eliminating one in the process.",
    "Jeremy Shaffer joins at least three other Republicans vying for the seat representing Beaver County and many suburbs north and west of Pittsburgh.",
    "Shaffer touts his experience owning and operating InspectTech, a software company focused on management of transportation infrastructure.",
    "A former Ross Township commissioner is the latest candidate to enter the race to replace U.S. Rep. Conor Lamb.",
    "“Solving problems and improving quality of life should not be a partisan issue,” said Shaffer.",
    "He served as a Ross commissioner for six years, including two as board president.",
    "Categories: Local | North Journal | Politics Election | Regional | Top Stories",
    "You can contact Ryan by email at rdeto@triblive.com or via Twitter .",
    "Ryan Deto is a Tribune-Review staff writer."
  ]
}