{
  "id": 5528,
  "mediaId": 2550,
  "date": "2022-02-09",
  "headline": "Morning Digest: Trumper who cost GOP a seat after unseating Mark Sanford back for more",
  "image": "https://images.dailykos.com/images/1035852/story_image/AP22039593754590.jpg?1644363032",
  "link": "https://www.dailykos.com/stories/2079327",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1480,
    2390,
    2573,
    2716,
    2805,
    4212,
    4229,
    305,
    878
  ],
  "sentences": [
    "SC-01: Rep. Nancy Mace might've thought that GOP gerrymandering would shield her from a competitive general election campaign, but as she just found out, there's no way to insulate yourself from a primary challenge: Former state Rep. Katie Arrington launched a bid on Tuesday blasting the incumbent as a \"sellout\" who \"sold out the Lowcountry\" and \"sold out President Trump\" (theme emerging?)",
    "Opt in to email updates from Daily Kos Elections\nSponsored by: Daily Kos Elections\nCunningham seized on a grave stumble Arrington made during her primary battle with Sanford, when she expressed her support for Trump's plan to allow offshore oil drilling in almost all of the country's coastal waters—a proposal even many Republicans opposed.",
    "OH Redistricting: Republican state House Speaker Bob Cupp said on Tuesday that lawmakers would not redraw Ohio's congressional districts as ordered by the state Supreme Court, which struck down the GOP's map last month, and would instead punt the task to the state's redistricting commission, which has until March 15 to act.",
    "A wide range of issues plagued her campaign, including poor fundraising, the ongoing defection of suburban voters from the GOP, and a Democratic opponent of much higher quality than Republicans were used to encountering in the district—a sharp-witted attorney and ocean engineer named Joe Cunningham.",
    "He begins by acknowledging that \"[p]eople are hurting\" and \"wondering when things will get back to normal\" and goes on to explain that's why he's working to \"create jobs,\" \"make healthcare more affordable,\" and \"crack[] down on the corporations who are raising prices out of control.\"",
    "GA-Gov: Republican David Perdue finally released his first fundraising report, and unsurprisingly, it was a disappointing one: The former senator, who entered the race for governor in December, brought in just $1.1 million from donors and had under $1 million on-hand as of Jan. 31.",
    "When Republican legislators drew the state's new congressional map, they placed Clyde's home county of Jackson into the 10th District—a move he claims was \"a purposeful decision made by a handful of establishment politicians\" to target him for being a \"hardcore conservative.\"",
    "Gubernatorial elections, however, can play out very differently from their federal counterparts: In recent years, we've seen multiple well-liked Democratic governors fall short in Senate bids in red states, including Steve Bullock in Montana and Phil Bredesen in Tennessee.",
    "South Carolina Republican Katie Arrington\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "He also joins a field that includes a large number of Republican candidates already running, including one, businessman Mike Collins, who greeted Jones with a web video blasting him as a \"corrupt, carpetbagging, lifelong Democrat from DeKalb County accused of rape.\"",
    "Arrington's tenure at the Pentagon didn't work out particularly well, though: She was suspended from her job last year after being accused of disclosing classified materials without permission and resigned a day prior to launching her campaign.",
    "As a consequence, national Democrats aren't likely to make a concerted effort to flip this district, though one candidate, pediatrician Annie Andrews, just reported raising almost half a million dollars in her first two months in the race.",
    "GA-09: Former FBI agent and University of Georgia football player Ben Souther has launched a primary challenge to Republican Rep. Andrew Clyde, specifically citing the fact that Clyde does not live in Georgia's dark-red 9th District.",
    "Perhaps the better comparison, though, is to Democrat Stacey Abrams, who kicked off her second bid just days before Perdue but hauled in a massive $9.2 million during almost the same timeframe and reported having $7.2 million banked.",
    "In a bizarre concession speech, Arrington explicitly blamed Sanford and his supporters for her defeat, and even exhorted the congressman's donors to ask that their contributions be refunded while pledging to seek a rematch in 2020.",
    "Dahle, who's refused to say whether he's received a COVID vaccination, is an extreme long-shot, but as the AP notes, it's also a free shot for him, since he's not on the November ballot and will be term-limited in 2024.\n?",
    "GA-10, GA-06: Former Republican state Rep. Vernon Jones confirmed on Tuesday that he'd run in Georgia's 10th Congressional District rather than the 6th, a day after he dropped his long-shot bid for governor.",
    "However, the dark-red 10th, which would've voted for Donald Trump 61-38, doesn't overlap with the legislative district Jones most recently held, nor with DeKalb County, where he served as CEO in the 2000s.",
    "Hogan, who has cultivated a moderate profile in his two terms in office, has long been very popular with Marylanders and would have posed a worrying threat, especially given a typical midterm environment.",
    "In the spot, Casar touts his accomplishments in office, including passing paid sick leave, raising the minimum wage, and protecting a Planned Parenthood clinic from closure at the hands of Republicans.",
    "Hogan acknowledged that dynamic at a Tuesday press conference, saying that he'd called his would-be Democratic opponent \"to let him know that he can rest easy and get a good night's sleep tonight.\"",
    "Notably, the about-face happened after Republicans fast-tracked a bill that promotes the use of drugs like ivermectin to treat COVID and contains a raft of measures targeting vaccination mandates.",
    "RI-Gov: Businesswoman Ashley Kalus, who is reportedly considering a bid for governor as a Republican, has filed paperwork to create a campaign committee with Rhode Island's Board of Elections.",
    "The Senate, though, was supposed to be the easy chamber; the House, where multiple Republicans are either out sick or have expressed dissenting views, was always going to be more difficult.",
    "Cunningham relentlessly pounded her on the flip-flop, and his considerable financial advantage allowed him to go on the airwaves first and stay there while Arrington struggled to keep up.",
    "Thanks to the GOP's intervention on Mace's behalf, the 1st is indeed now redder: Under the old lines, it voted for Trump by a 52-46 margin, but now it would have gone for Trump 54-45.",
    "Bowman, an outspoken progressive, currently represents about 13% of the redrawn 3rd, a Long Island-based seat that Democrats reconfigured to take in part of the Bronx and Westchester.",
    "Whether or not Hogan could have defied this trend, he would undoubtedly have made Van Hollen seriously sweat, and the last thing Democrats need is another competitive race this fall.",
    "That's considerably harder to pull off in the context of a Senate race, when your opponents can readily link you to unpopular D.C. figures whose caucus you're seeking to join.",
    "The attacks worked, as Arrington upset Sanford 51-47, a win that should have sent her on a smooth path to victory that November in South Carolina's conservative 1st District.",
    "Yeah, so about that: Arrington, you perhaps recall, ran against Republican Rep. Mark Sanford that cycle, castigating him for—guess what—insufficient loyalty to Donald Trump.",
    "Laura Kelly's veto on Monday night, Republicans in the Kansas Senate were just barely able to muster the necessary two-thirds supermajority to do so in a re-vote on Tuesday.",
    "WA Redistricting: Washington's new congressional and legislative maps are now law, following a vote in the state Senate on Tuesday (the House approved the plans last week).",
    "In 2018, Shaffer unseated state Sen. Randy Vulakovich in the GOP primary but cost his party dearly when he narrowly lost the general election to Democrat Lindsey Williams.",
    "In the 1st District, which stretches along much of the state's Atlantic shore, the idea was particularly unpopular, and Arrington soon tried to walk back her remarks.",
    "TX-35: Austin City Councilman Greg Casar is running his first TV ad ahead of the March 1 Democratic primary, which his campaign says is backed by a \"six-figure\" buy.",
    "United StatesUnited States\nAttribution: Stephen Wolf / Daniel Donner\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "NY-03: Freshman Democratic Rep. Jamaal Bowman endorsed state Sen. Alessandra Biaggi's new bid for New York's open 3rd Congressional District on Tuesday.",
    "David Perdue said a week ago that he'd raised $7.4 million in the second half of last year and had stockpiled $12.7 million in his campaign war chest.",
    "The final result was one of the midterms' most shocking, even with the elevated expectations many Democrats brought with them to election night.",
    "But Mace fired back in withering style: \"I at least partially have her 2018 loss in our District to thank\" for the chance to serve in Congress.",
    "The original vote fell two short thanks to defections by four GOP lawmakers, but party leaders were able to convince two to return to the fold.",
    "Larry Hogan announced on Tuesday that he would not challenge Democratic Sen. Chris Van Hollen despite an effort to recruit him by GOP leaders.",
    "He then describes his priorities for Congress: \"Expanding Medicare to every Texan, fixing our power grid, and tackling the climate crisis.\"",
    "GA-Sen: Democratic Sen. Raphael Warnock has released his first TV ad of his re-election campaign, a minute-long spot he narrates himself.",
    "Instead, he wound up running against another state representative—Mace—who had the good sense to oppose offshore drilling from day one.",
    "Unfortunately for Cunningham, he wasn't lucky enough to face Arrington again, as she instead took a job in Trump's Defense Department.",
    "As his state's top executive and a critic of Donald Trump, he's been able to present himself as a free agent above party politics.",
    "Lawmakers made minor tweaks to the maps, which were drawn by the state's bipartisan redistricting commission in a chaotic process.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "and is \"more interested in becoming a mainstream media celebrity than fighting for the people she's supposed to represent.\"",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Cunningham defeated Arrington 51-49, despite the fact that Trump had carried the district 54-40 just two years earlier.",
    "Of course, the lead-footed Arrington managed to put this seat in play once before with an unexpected primary win.",
    "One of the vote-switchers was state Sen. Mark Steffen, who is under investigation for prescribing such drugs.",
    "He nevertheless said he'll continue to run in the 9th, though it doesn't appear that he plans to relocate.",
    "Gavin Newsom on Tuesday, giving Republicans their first even marginally notable candidate in the race.",
    "Arrington learned the hard way that sometimes, there's a price to pay for far-right Trump sycophancy.",
    "That dynamic helps explain why the Old Line State hasn't elected any Republican senators since 1980.",
    "30,000), said on Tuesday that he'll run for Pennsylvania's open 17th Congressional District.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Amid a less favorable political environment for Democrats, Cunningham lost 51-49.",
    "PA-17: Republican Jeremy Shaffer, a former commissioner in Ross Township (pop.",
    "AdImpact reports that Warnock is spending about $820,000 to air the spot.",
    "Hogan might well have faced the same difficulties in deep-blue Maryland.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "CA-Gov: State Sen. Brian Dahle announced a bid against Democratic Gov.",
    "Republicans hold 86 seats and would need 84 votes to override Kelly.",
    "Overall, though, the new districts largely maintain the status quo.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Get the Daily Kos Elections Morning Digest over email\n Sign up!",
    "She still has not yet publicly discussed her plans, however.",
    "KS Redistricting: After failing to override Democratic Gov.",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "This is a short blurb about Daily Kos.",
    "MD-Sen: Term-limited Republican Gov.",
    "Donate $5\nDonate $25\nDonate $15\n?",
    "You may unsubscribe at any time.",
    "(He's now running for governor.)",
    "Perhaps she'll do so again.",
    "Here's our privacy policy.",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "By contrast, Gov.",
    "Donate $5 monthly",
    "Please read it.",
    "Only it didn't.",
    "Redistricting\n?",
    "Leading Off\n?",
    "Governors\n?",
    "Senate\n?",
    "Sign up!",
    "House\n?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?",
    "?"
  ]
}