[
  {
    "id": 3216,
    "mediaId": 2662,
    "date": "2022-01-27",
    "sentence": "EXCLUSIVE: AZ State Rep. <span class='selected-term'>Mark Finchem</span> Is Working on Resolution to Reclaim Arizona’s 2020 Electors: “I Actually Have A Resolution In Markup Right Now.” (VIDEO)\nTRENDING: Swamp Rat Mitch McConnell Said He Was \"Exhilarated\" on Jan 6 that President Trump \"Had Finally Tarnished His Reputation\"\nBut RINO Arizona State Representative and U.S. Congressional Candidate Walter Blackman, says this is not a possibility.",
    "author": "Jordan Conradson",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 3200,
    "mediaId": 2748,
    "date": "2022-01-28",
    "sentence": "Arizona State Representative and Trump-endorsed candidate for Secretary of State <span class='selected-term'>Mark Finchem</span> is currently drafting a resolution to decertify Arizona’s 2020 Presidential election.",
    "author": "",
    "title": "AUDIO: RINO Arizona State Rep. Walt Blackman Bashes Rep. Finchem, Claims Decertification Is Impossible: “We Can’t Do That”"
  },
  {
    "id": 1819,
    "mediaId": 2662,
    "date": "2022-02-07",
    "sentence": "State Representative @RealMarkFinchem Introduces Resolution to Set Aside & Decertify Three 2020 County Elections.https://t.co/yNnZjZpD10 #HCR2033 #azleg pic.twitter.com/Si7GjMAEeg\n— AZ House Republicans (@AZHouseGOP) February 7, 2022\nNEWS RELEASE\nArizona House of Representatives Representative <span class='selected-term'>Mark Finchem</span> (R-11)\nRepresentative Finchem Introduces Resolution to Set Aside & Decertify Three 2020 County Elections\nSTATE CAPITOL, PHOENIX – State Representative Mark Finchem has introduced HCR 2033, a concurrent resolution calling for the elections of Maricopa, Pima and Yuma Counties to be set aside based on clear and convincing evidence that the elections in those counties were irredeemably compromised.",
    "author": "Jordan Conradson",
    "title": "BREAKING BIG: Arizona State Rep. Mark Finchem Introduces Resolution To SET ASIDE & DECERTIFY Three 2020 County Elections"
  },
  {
    "id": 1864,
    "mediaId": 2662,
    "date": "2022-02-09",
    "sentence": "The Gateway Pundit reported that <span class='selected-term'>Mark Finchem</span> introduced HCR 2033, a resolution to set aside and decertify three 2020 county elections and reclaim Arizona’s 2020 Presidential electors using the State Legislature’s plenary powers, granted by the Constitution.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Arizona State Rep. Mark Finchem Challenges House Speaker to Public Debate On Decertification: “Here’s My Cards. I’m Waiting To See Yours.” (VIDEO)"
  },
  {
    "id": 996,
    "mediaId": 2578,
    "date": "2022-02-15",
    "sentence": "Twitter Shares Halted Pending News of Sale - Company Sold to Elon Musk for $44 Billion\nThis sham investigation is targeting Rep. <span class='selected-term'>Mark Finchem</span> and Chairwoman Ward because the BIG LIE is finally unfolding in Arizona.",
    "author": "Jordan Conradson",
    "title": "Liz Cheney’s Jan 6 Committee Subpoenas Arizona State Rep. Mark Finchem and Arizona GOP Chairwoman Kelli Ward"
  }
]