[
  {
    "id": 1445,
    "mediaId": 2707,
    "date": "2022-02-15",
    "sentence": "The subpoena list also includes Republican state lawmakers from Pennsylvania and Arizona — Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively — as well as Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP.",
    "author": "Cnn Com",
    "title": "Jan. 6 panel issues more subpoenas in fake electors scheme"
  },
  {
    "id": 1166,
    "mediaId": 2643,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Aaron McDade",
    "title": "Jan. 6 Committee Sends 6 New Subpoenas Focused on Fake Trump Electors"
  },
  {
    "id": 1181,
    "mediaId": 2523,
    "date": "2022-02-15",
    "sentence": "The subpoena list also includes Republican state lawmakers from Pennsylvania and Arizona — Douglas Mastriano and <span class='selected-term'>Mark Finchem</span>, respectively — as well as Kelli Ward, chairwoman of the Arizona Republican Party, and Laura Cox, former chairwoman of the Michigan GOP.",
    "author": "Cnn Com",
    "title": "Jan. 6 panel issues more subpoenas in fake electors scheme"
  },
  {
    "id": 1040,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "Among those subpoenaed are Arizona Republican Party Chairwoman Kelli Ward, Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, former Michigan Republican Chair Laura Cox and Pennsylvania GOP state Sen. Doug Mastriano.",
    "author": "Jennifer Shutt",
    "title": "Jan. 6 panel subpoenas six people tied to pro-Trump fake electors plan"
  },
  {
    "id": 1354,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "The subpoenas went to Arizona Republican Party Chairwoman Kelli Ward, a longtime Trump supporter, as well as Pennsylvania state Sen. Doug Mastriano, now running for governor there, and Arizona State House Rep. <span class='selected-term'>Mark Finchem</span>, now running to be the next secretary of state in Arizona.",
    "author": "",
    "title": "State officials pushing Trump alternate elector scheme come into focus"
  }
]