[
  {
    "id": 1066,
    "mediaId": 2745,
    "date": "2022-02-15",
    "sentence": "In addition two Arizonans were subpoenaed, <span class='selected-term'>Mark Finchem</span> (R), a state House member running for secretary of state who attended the Jan. 6 protest in Washington, and Kelli Ward, the state Republican chair who sued to block committee efforts to obtain her phone records.",
    "author": "",
    "title": "Jan 6 panel issues six new subpoenas"
  },
  {
    "id": 1040,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "Among those subpoenaed are Arizona Republican Party Chairwoman Kelli Ward, Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, former Michigan Republican Chair Laura Cox and Pennsylvania GOP state Sen. Doug Mastriano.",
    "author": "Jennifer Shutt",
    "title": "Jan. 6 panel subpoenas six people tied to pro-Trump fake electors plan"
  },
  {
    "id": 12771,
    "mediaId": 2584,
    "date": "2022-02-28",
    "sentence": "Some state legislators who had contacts with Giuliani as part of the scam have been subpoenaed by the panel, such as <span class='selected-term'>Mark Finchem</span> in Arizona and Doug Mastriano in Pennsylvania, who are, respectively, running in 2022 to be secretary of state and governor in moves that raise fears of future attempts to subvert American democracy.",
    "author": "Peter Stone",
    "title": "Giuliani’s legal problems deepen as ‘false electors’ scheme investigated"
  },
  {
    "id": 9739,
    "mediaId": 2560,
    "date": "2022-03-26",
    "sentence": "Lansing — <span class='selected-term'>Mark Finchem</span>, whom former President Donald Trump endorsed to be Arizona's next secretary of state, told a crowd in Michigan Saturday to \"fire\" lawmakers who were unwilling to consider claims of wrongdoing in the 2020 election.",
    "author": "Craig Mauger",
    "title": "Trump-backed candidates see 'movement' in Michigan despite small rally crowd"
  },
  {
    "id": 7730,
    "mediaId": 2664,
    "date": "2022-04-08",
    "sentence": "But this isn't a one-off — many other Republicans are running for election offices on similar platforms, like Michigan's Kristina Karamo, who has spoken at a QAnon conference, and Arizona's <span class='selected-term'>Mark Finchem</span>, who ironically does not presently live where he is registered to vote.",
    "author": "Matthew Chapman",
    "title": "Former RNC official warns 'crazypants' MAGA supporters are running to take over state election systems"
  },
  {
    "id": 5687,
    "mediaId": 2689,
    "date": "2022-04-19",
    "sentence": "https://t.co/FimoHLFNpm https://t.co/5eH3DmZYSA\n— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) April 7, 2022\nSpecial Counsel Michael Gableman says Facebook CEO's $8.8 million into Wisconsin's Democrat cities was election bribery in violation of the law pic.twitter.com/pDBzOpZulG\n— Liz Harrington (@realLizUSA) March 1, 2022\nIt’s frustrating to read, isn’t it?",
    "author": "",
    "title": "Dems Already Infiltrating For 2024 Election"
  }
]