[
  {
    "id": 3574,
    "mediaId": 2658,
    "date": "2022-01-17",
    "sentence": "Another speaker was Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, who is running to be Arizona’s secretary of state, has been linked to QAnon and has reportedly discussed conspiracies about a network of elected officials involved in a network of pedophilia.",
    "author": "",
    "title": "Trump superfans dream of a run again, and of JFK Jr. on the ticket"
  },
  {
    "id": 1272,
    "mediaId": 2636,
    "date": "2022-02-11",
    "sentence": "“Not since Hitler himself have we seen evil come across the country,” said <span class='selected-term'>Mark Finchem</span>, an Arizona lawmaker who is running for secretary of state there.",
    "author": "",
    "title": "The Traveling Trump Show"
  },
  {
    "id": 1267,
    "mediaId": 4032,
    "date": "2022-02-12",
    "sentence": "Conservative “superstars” such as Lt. General Michael Flynn, former national security advisor to President Donald Trump and retired chief of military intelligence; conservative rock star Ted Nugent; Colonel Allen West, former congressman and Texas GOP chief; libertarian business magnate and Overstock.com founder Patrick Byrne; former Immigration and Customs Enforcement chief Tom Hohman; former Customs and Border Protection head Mark Morgan; celebrity actress and author Sam Sorbo; Arizona State Representative <span class='selected-term'>Mark Finchem</span>; many sheriffs and lawmen; and leading conservative media personalities.",
    "author": "Alex Newman",
    "title": "Shadowy Forces Sabotage Key Border Event Hosted by Patriots"
  },
  {
    "id": 10737,
    "mediaId": 2664,
    "date": "2022-03-12",
    "sentence": "Other speakers scheduled to address the conference include Eric Trump, Roger Stone, Arizona Republican state Rep. <span class='selected-term'>Mark Finchem</span>, Pastor Greg Locke, and Pastor Mark Burns.",
    "author": "Bob Brigham",
    "title": "Mike Flynn describes battle against school boards like a military action: 'We're gonna counter-attack'"
  }
]