[
  {
    "id": 3574,
    "mediaId": 2658,
    "date": "2022-01-17",
    "sentence": "Another speaker was Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, who is running to be Arizona’s secretary of state, has been linked to QAnon and has reportedly discussed conspiracies about a network of elected officials involved in a network of pedophilia.",
    "author": "",
    "title": "Trump superfans dream of a run again, and of JFK Jr. on the ticket"
  },
  {
    "id": 2751,
    "mediaId": 2520,
    "date": "2022-02-03",
    "sentence": "Here are the then-current and incoming Republican state legislators who signed the resolution asking Congress to accept Arizona’s fake electors: Sen. Kelly Townsend of Mesa, Rep. Bret Roberts of Maricopa, Rep. Kevin Payne of Peoria, Rep. <span class='selected-term'>Mark Finchem</span> of Oro Valley, Sen. David Farnsworth of Mesa, Sen. Sonny Borrelli of Lake Havasu City, Rep. Leo Biasiucci, of Lake Havasu City, Rep. Anthony Kern of Glendale, Rep. David Cook of Globe, Sen. Sylvia Allen of Snowflake, Rep. John Fillmore of Apache Junction, Sen. Nancy Barto of Phoenix, Rep. Travis Grantham of Gilbert, Senate Majority Leader Warren Petersen of Gilbert, Rep. Walter Blackman of Snowflake, Rep. Steve Pierce of Prescott, Rep. Shawnna Bolick of Phoenix, Rep. Tony Rivero of Peoria, Rep. Noel Campbell of Prescott.",
    "author": "Laurie Roberts",
    "title": "What is Arizona GOP Chair Kelli Ward hiding from the committee investigating Jan. 6?"
  },
  {
    "id": 1903,
    "mediaId": 2520,
    "date": "2022-02-08",
    "sentence": "Not former state Rep. <span class='selected-term'>Mark Finchem</span>, now running for Arizona secretary of state.",
    "author": "EJ Montini",
    "title": "Arizona's Jan. 6 insurrectionists should be barred from holding office"
  },
  {
    "id": 634,
    "mediaId": 2520,
    "date": "2022-02-22",
    "sentence": "And it’s being promoted by Rep. <span class='selected-term'>Mark Finchem</span>, a guy who is hoping that if he lies often enough about Arizona’s election being stolen that voters will install him as secretary of state to oversee future elections.",
    "author": "Laurie Roberts",
    "title": "GOP legislators want new ballots that - surprise! - can only be made by one company"
  },
  {
    "id": 15577,
    "mediaId": 8475,
    "date": "2022-03-07",
    "sentence": "Alexander is connected to another Arizona politician as well, state Rep. <span class='selected-term'>Mark Finchem</span>, a Republican from Oro Valley.",
    "author": "Jerod MacDonald-Evoy",
    "title": "New report highlights Roger Stone’s efforts on behalf of Trump allies in Arizona"
  },
  {
    "id": 7595,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "\"In three separate candidacy challenges filed in Superior Court in Maricopa County, Ariz., voters and the progressive group, Free Speech for People, targeted Representatives Paul Gosar and Andy Biggs and State Representative <span class='selected-term'>Mark Finchem</span>, who is running for Arizona secretary of state with former President Donald J. Trump’s endorsement,\" The New York Times reports.",
    "author": "Sky Palma",
    "title": "Six more Republicans sued over Constitution’s ban on insurrectionists running for office: report"
  },
  {
    "id": 7641,
    "mediaId": 2520,
    "date": "2022-04-08",
    "sentence": "A group seeking to bar those it blames for the Jan. 6, 2021, riot at the U.S. Capitol from seeking further office helped file lawsuits Thursday against U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Ronald J. Hansen",
    "title": "Lawsuits aim to ban Andy Biggs, Paul Gosar and Mark Finchem from holding office"
  },
  {
    "id": 7349,
    "mediaId": 2746,
    "date": "2022-04-08",
    "sentence": "Free Speech For People filed lawsuits on behalf of voters in Arizona’s Maricopa County that challenge the eligibility for the office of GOP Reps. Paul Gosar and Andy Biggs, and state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Seth McLaughlin",
    "title": "Liberals push legal effort to block Republican ‘insurrectionists’ from the ballot"
  },
  {
    "id": 5555,
    "mediaId": 2646,
    "date": "2022-04-10",
    "sentence": "In a separate suit, Free Speech for People (FSFP), an organization formed in 2010, committed to getting money out of politics and securing and protecting the right of all citizens to vote – a right guaranteed by the 14th amendment – filed suit in Maricopa County against US Representatives Paul Gosar (R-AZ), Andy Biggs (R-AZ), and former GOP state Rep. <span class='selected-term'>Mark Finchem</span> to prevent each of them from running for re-election.",
    "author": "Ty Ross",
    "title": "DISQUALIFIED: Pro-coup Republicans face ban from seeking re-election"
  },
  {
    "id": 5909,
    "mediaId": 2520,
    "date": "2022-04-11",
    "sentence": "At least not with Republicans, who have long called themselves the “the party of the Constitution.”\nBecause if words mattered, if the Constitution mattered, the GOP would fully support the effort to bar U.S. Reps. Andy Biggs and Paul Gosar, as well as state Rep. <span class='selected-term'>Mark Finchem</span> from holding office.",
    "author": "EJ Montini",
    "title": "Honor the Constitution and ban Arizona's insurrectionists from holding public office"
  },
  {
    "id": 5766,
    "mediaId": 6746,
    "date": "2022-04-13",
    "sentence": "The Accused Politicians\nThose charged in the Superior Court of Arizona in Maricopa County are US Reps. Paul Gosar and Andy Biggs for reelection; while State Rep. <span class='selected-term'>Mark Finchem</span> for Arizona secretary of state announced this by the Austin, Texas-based Free Speech For People on April 7, cited Court House News Service.",
    "author": "Ed Forster",
    "title": "Democrats Attempt To Kick Out Two-Pro Trump Representatives, Arizona Lawmaker as Panic Sets in Before 2022 Midterm Elections"
  },
  {
    "id": 6027,
    "mediaId": 2680,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "BOB CHRISTIE",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 5398,
    "mediaId": 2746,
    "date": "2022-04-20",
    "sentence": "Free Speech for People filed similar lawsuits challenging the candidacies of Arizona U.S. Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span>, who is running for Arizona’s secretary of state and has been endorsed by Mr. Trump, on the same grounds.",
    "author": "Editorial Board",
    "title": "Democrats look to disqualify Republicans from ballot as ‘insurrectionists’"
  },
  {
    "id": 5149,
    "mediaId": 8251,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 4635,
    "mediaId": 8350,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "ASSOCIATED PRESS",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  },
  {
    "id": 4985,
    "mediaId": 8475,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "Jerod MacDonald-Evoy",
    "title": "Judge boots case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 4831,
    "mediaId": 8251,
    "date": "2022-04-22",
    "sentence": "The lawsuits sought to disqualify Gosar, Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> by citing a section of the 14th Amendment to the U.S. constitution enacted after the Civil War.",
    "author": "",
    "title": "Judge dismisses ballot challenges against Gosar, Biggs, Finchem"
  },
  {
    "id": 5233,
    "mediaId": 2641,
    "date": "2022-04-22",
    "sentence": "The suit, brought by a voting rights group, also named state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "Jeffrey Rodack",
    "title": "Judge Tosses out Lawsuit Aimed at Keeping Reps. Gosar, Biggs off Ballots"
  },
  {
    "id": 5245,
    "mediaId": 2664,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "",
    "title": "Judge dismisses case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 5255,
    "mediaId": 2562,
    "date": "2022-04-22",
    "sentence": "The suit, brought by a voting rights group, also named state Rep. <span class='selected-term'>Mark Finchem</span>.",
    "author": "NationalWatch",
    "title": "Judge Tosses out Lawsuit Aimed at Keeping Reps. Gosar, Biggs off Ballots"
  },
  {
    "id": 4868,
    "mediaId": 8268,
    "date": "2022-04-22",
    "sentence": "",
    "author": "Howard Fischer",
    "title": "Judge allows Finchem, Gosar, Biggs to stay on ballot"
  },
  {
    "id": 6051,
    "mediaId": 2668,
    "date": "2022-04-22",
    "sentence": "The plaintiffs in the case, the group Free Speech for the People (more irony), are trying to use Section 3 of the 14th Amendment to the Constitution, which prohibits elected officials from engaging in an insurrection or rebellion to knock Rep. Paul Gosar (R-AZ), Rep. Andy Biggs (R-AZ) and state Rep. <span class='selected-term'>Mark Finchem</span> (who’s running for Secretary of State) off the ballot in Arizona.",
    "author": "Nick Arama",
    "title": "Effort to Block GOP Reps From Running Because of Jan. 6 Goes Down to Withering Defeat"
  },
  {
    "id": 5028,
    "mediaId": 2730,
    "date": "2022-04-23",
    "sentence": "On Friday, however, an Arizona judge ruled against one of the latest rounds of lawsuits, this time from voting groups seeking to prevent Reps. Paul Gosar and Andy Biggs, both Republicans from Arizona, as well as State Rep. <span class='selected-term'>Mark Finchem</span>, a fellow Republican from the state, from appearing on the ballot.",
    "author": "Rebecca Downs",
    "title": "Judge Dismisses Lawsuits Trying to Bar Reps. Paul Gosar, Andy Biggs from Running for Re-Election"
  },
  {
    "id": 5181,
    "mediaId": 8345,
    "date": "2022-04-23",
    "sentence": "The decision from Maricopa County Superior Court Judge Christopher Coury made public Friday means Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> remain on the primary ballot barring a reversal by the state Supreme Court.",
    "author": "Associated Press",
    "title": "Arizona judge nixes suit that seeks to keep Trump backers off ballot"
  },
  {
    "id": 4822,
    "mediaId": 2766,
    "date": "2022-04-23",
    "sentence": "They filed a lawsuit to stop Reps Paul Gosar, Andy Biggs, and State House Rep <span class='selected-term'>Mark Finchem</span> alleging that they participated in an “insurrection” stemming from the Jan 6 riot.",
    "author": "Faye Higbee",
    "title": "Democrats Attempt to Disqualify Reps Gosar, Biggs, Finchem; Court Dismissed the Attempt."
  },
  {
    "id": 4944,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The lawsuit issued by a voting rights group sought to prevent Rep. Paul Gosar, Rep. Andy Biggs, and State Rep. <span class='selected-term'>Mark Finchem</span> from running for reelection.",
    "author": "Laura Ramirez",
    "title": "Victory: Arizona judge dismisses lawsuit, allows pro-Trump candidates to stay on the ballot"
  }
]