[
  {
    "id": 3144,
    "mediaId": 2540,
    "date": "2022-02-01",
    "sentence": "Recipients also include a slate of Arizona candidates -- gubernatorial hopeful Kari Lake, Senate candidate Wendy Rogers and secretary of state contender <span class='selected-term'>Mark Finchem</span> -- who have lied about voter fraud in the state and misrepresented the findings of a partisan review of the 2020 results commissioned by state Senate Republicans.",
    "author": "Eric Bradner",
    "title": "Trump's PAC gave $1 million to Meadows' non-profit weeks after House formed January 6 committee"
  },
  {
    "id": 1882,
    "mediaId": 2662,
    "date": "2022-02-09",
    "sentence": "RINO Arizona Speaker of The House Rusty Bowers told reporters yesterday that Arizona State Representative <span class='selected-term'>Mark Finchem</span>’s resolution to decertify three 2020 Arizona county elections is “obviously unconstitutional and profoundly unwise.”\nBowers has been no fan of election integrity or the full forensic of Maricopa County, which confirmed countless election law violations and hundreds of thousands of illegal or fraudulent ballots.",
    "author": "Jordan Conradson",
    "title": "Arizona House Speaker Turncoat Rusty Bowers: “Mr. Finchem’s Obviously Unconstitutional And Profoundly Unwise Proposal Will Receive All The Consideration It Deserves”"
  },
  {
    "id": 934,
    "mediaId": 2662,
    "date": "2022-02-15",
    "sentence": "https://t.co/nDKQe9zCux\n— <span class='selected-term'>Mark Finchem</span> (@RealMarkFinchem) February 14, 2022\nNo matter where you live, sign Arizona State Rep. Mark Finchem’s petition to decertify the fraudulent 2020 election and strongly encourage your state legislators to sign State Senator Rogers’ letter to audit 50 states.",
    "author": "Jordan Conradson",
    "title": "204 Legislators Call For 50-State Audit, Decertification Where Appropriate, and Possible Convening of the US House of Representatives"
  },
  {
    "id": 666,
    "mediaId": 2662,
    "date": "2022-02-23",
    "sentence": "Arizona State Representative <span class='selected-term'>Mark Finchem</span> appeared on Steve Bannon’s War Room today to give updates on his push to decertify Arizona’s fraudulent 2020 election.",
    "author": "Jordan Conradson",
    "title": "WATCH: AZ State Representative Mark Finchem On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”"
  },
  {
    "id": 304,
    "mediaId": 2662,
    "date": "2022-02-24",
    "sentence": "WATCH: AZ State Representative <span class='selected-term'>Mark Finchem</span> On Decertification in Arizona – “The Only Thing That We Have Left Is A Parliamentary Tool Where We Force The Resolution To The Floor”\nContact Arizona Senate President Karen Fann, Speaker Rusty Bowers, and Arizona legislators to strongly encourage their support for decertification.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Arizona Senate President Karen Fann Claims “We Really Don’t Have a Mechanism To Decertify” – Mark Finchem Gave Us The Mechanism"
  },
  {
    "id": 4985,
    "mediaId": 8475,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "Jerod MacDonald-Evoy",
    "title": "Judge boots case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  },
  {
    "id": 5245,
    "mediaId": 2664,
    "date": "2022-04-22",
    "sentence": "A trio of lawsuits that sought to disqualify Republican Congressmen Andy Biggs and Paul Gosar and state Rep. <span class='selected-term'>Mark Finchem</span> from the ballot for their alleged roles in the January 6 attack on the Capitol was dismissed Friday.",
    "author": "",
    "title": "Judge dismisses case to disqualify Gosar, Biggs and Finchem from ballot as 'insurrectionists'"
  }
]