[
  {
    "id": 3505,
    "mediaId": 2630,
    "date": "2022-02-01",
    "sentence": "For example, Trump gave $5,000 to Arizona state Rep. <span class='selected-term'>Mark Finchem</span>, a secretary of state candidate who has called for the decertification of the 2020 election, and a matching amount to Rep. Jody Hice, R-Ga., who voted against certifying the election and is now running for secretary of state in Georgia.",
    "author": "",
    "title": "Trump gave $1M to Meadows nonprofit weeks after Jan. 6 panel's creation"
  },
  {
    "id": 1446,
    "mediaId": 2728,
    "date": "2022-02-15",
    "sentence": "The other four individuals are Pennsylvania State Sen. Douglas Mastriano, Laura Cox, the former chair of the Michigan Republican Party, Arizona State Rep. <span class='selected-term'>Mark Finchem</span> and Arizona Republican Party chair Kelli Ward.",
    "author": "Farnoush Amiri",
    "title": "Jan. 6 panel subpoenas 6 more in fake GOP electors scheme"
  },
  {
    "id": 928,
    "mediaId": 2590,
    "date": "2022-02-15",
    "sentence": "“The select committee has heard from more than 550 witnesses, and we expect these six individuals to cooperate as well.”\nAmong the six are two new celebrities among Trump followers: <span class='selected-term'>Mark Finchem</span>, an Arizona state lawmaker who is running to be the top elections official there, and Doug Mastriano, a Pennsylvania legislator who led the efforts to overturn Democrat Joe Biden’s victory in that state.",
    "author": "",
    "title": "Jan. 6 Committee Focuses On Trump Scheme To Solicit Slates Of Fake Electors"
  },
  {
    "id": 994,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "It also issued them to four officials in states carried by President Joe Biden as he defeated Republican Trump's bid for re-election: Douglas Mastriano, a state senator in Pennsylvania; Laura Cox, a former member of the Michigan House of Representatives and chair of the state Republican party; <span class='selected-term'>Mark Finchem</span>, an Arizona state senator; and Kelli Ward, a former Arizona state senator and chair of the state Republican party.",
    "author": "",
    "title": "Jan. 6 Panel Issues 6 Subpoenas in 'Alternate Elector' Probe"
  },
  {
    "id": 1166,
    "mediaId": 2643,
    "date": "2022-02-15",
    "sentence": "",
    "author": "Aaron McDade",
    "title": "Jan. 6 Committee Sends 6 New Subpoenas Focused on Fake Trump Electors"
  },
  {
    "id": 1259,
    "mediaId": 2631,
    "date": "2022-02-15",
    "sentence": "The panel also issued a subpoena Tuesday to <span class='selected-term'>Mark Finchem</span>, who is running for secretary of state in Arizona and has been endorsed by Trump.",
    "author": "",
    "title": "New subpoenas from Jan. 6 committee target 'alternate elector' organizers"
  },
  {
    "id": 5555,
    "mediaId": 2646,
    "date": "2022-04-10",
    "sentence": "In a separate suit, Free Speech for People (FSFP), an organization formed in 2010, committed to getting money out of politics and securing and protecting the right of all citizens to vote – a right guaranteed by the 14th amendment – filed suit in Maricopa County against US Representatives Paul Gosar (R-AZ), Andy Biggs (R-AZ), and former GOP state Rep. <span class='selected-term'>Mark Finchem</span> to prevent each of them from running for re-election.",
    "author": "Ty Ross",
    "title": "DISQUALIFIED: Pro-coup Republicans face ban from seeking re-election"
  },
  {
    "id": 4635,
    "mediaId": 8350,
    "date": "2022-04-20",
    "sentence": "Lawsuits seeking to disqualify Reps. Paul Gosar and Andy Biggs and state Rep. <span class='selected-term'>Mark Finchem</span> filed on behalf of a handful of Arizona voters allege that they are ineligible to hold office because they participated in an insurrection.",
    "author": "ASSOCIATED PRESS",
    "title": "Judge mulls lawsuit seeking to kick Trump backers off ballot"
  }
]