{
  "id": 1000,
  "mediaId": 237,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Republican candidate for Michigan governor sparks abortion controversy",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/947587.png",
  "link": "https://www.washingtonexaminer.com/news/campaigns/republican-candidate-for-michigan-governor-sparks-abortion-controversy",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Scanlon",
  "authorUrl": "https://www.washingtonexaminer.com/author/kate-scanlon",
  "termIds": [
    773,
    1844,
    2298,
    2342,
    3075,
    146,
    307,
    428,
    2645,
    2791,
    2799
  ],
  "sentences": [
    "Soldano said during a recent interview on the podcast Face the Facts with April Moss that was circulated Monday by Heartland Signal that he wants to promote a culture that lets women know \"how heroic they are and how unbelievable that they are  that God put them in this moment\" if they become pregnant after rape.",
    "Then, Akin replied to a question about the legality of abortion after rape by calling such cases really rare,? adding, If it's a legitimate rape, the female body has ways to try to shut that whole thing down.? The remarks sunk his campaign.",
    "Whitmer appeared to weigh in on the ensuing controversy on Tuesday, writing on Twitter, Abortion is a fundamental right.?\nI will stand in the way of any attack on Michiganders' ability to access that care,? Whitmer said.",
    "But then he started to really appreciate and understand what his birth mother went through, that she had the courage to deliver him,? Soldano said, adding he would defend the DNA? of an unborn child.",
    "\"A normal politician, or your typical politician or a career politician would backtrack right now,\" Soldano said, arguing his comments were taken \"the wrong way\" and that he would not retract them.",
    "Michigan Democrats were quick to condemn the remarks, which also drew comparisons to comments made by the late Rep. Todd Akin during his 2012 run for the Senate in Missouri.",
    "\"I believe in the equality of all life and the value of life is not based upon the occasion of its conception, but the sacredness of its essence,\" Soldano wrote.",
    "But James Craig, the former chief of Detroit police, has raised the most money from supporters and is currently seen as the front-runner in the Republican race.",
    "Abortion remarks by Garrett Soldano, a Republican candidate for Michigan governor, went viral, creating controversy in a crowded gubernatorial primary race.",
    "Republican businessman Kevin Rinke is leading the Republican gubernatorial field in fundraising, including a $2 million contribution to his own campaign.",
    "The campaign also posted a nearly 15-minute video in response to the controversy that opened with the song \"I Won't Back Down\" by Tom Petty.",
    "Soldano, an anti-lockdown activist and chiropractor, is one of more than a dozen Republicans vying to challenge Democratic incumbent Gov.",
    "And they don't know that little baby inside them may be the next president, may be the next person that changes humanity,? he said.",
    "He wrote on Twitter that \"I will not be bullied by the media or the far left into backing down from my pro-life beliefs.\"",
    "Soldano said he has a mentor who was adopted and later learned several men had raped his birth mother.",
    "\"So this is personal to me, just like I'm sure it's personal to a lot of you.\"",
    "Soldano's campaign did not respond to a request for comment.",
    "It kind of like, tore out his heart when he found that out.",
    "The primary in Michigan's gubernatorial election is Aug. 2.",
    "\"My mother was adopted,\" he said in the video.",
    "Gretchen Whitmer."
  ]
}