{
  "id": 8969,
  "mediaId": 157,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Michigan Republican on getting booted from ballot over fraudulent signatures: Not going to let this go'",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29943573&width=1200&coordinates=0%2C30%2C0%2C20&height=600",
  "link": "https://www.rawstory.com/michigan-republican-on-getting-booted-from-ballot-over-fraudulent-signatures-not-going-to-let-this-go/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon King",
  "authorUrl": "https://www.rawstory.com/u/jonking-michiganadvance",
  "termIds": [
    651,
    1682,
    1844,
    2002,
    2298,
    3075,
    3095,
    3099
  ],
  "sentences": [
    "Craig, who previously said he was considering a write-in campaign, said he believes the courts didn't follow the statutes, and argued elections officials should have individually examined each signature and not disqualified entire pages that had been submitted by suspected fraudulent circulators.",
    "The rulings have left five GOP candidates on the ballot, which had to be finalized by last Friday: Businessman Kevin Rinke, right-wing media personality Tudor Dixon, chiropractor Garrett Soldano, far-right activist Ryan Kelley and the Rev.",
    "Despite a Michigan Supreme Court decision that kept Republican James Craig off of the August primary ballot, the former Detroit police chief says he is evaluating next steps in a bid to stay in the gubernatorial race.",
    "Craig was among five Republican candidates for governor who were tossed off of the ballot after the Bureau of Elections (BOE) released a report last month detailing an unprecedented number of fraudulent signatures.",
    "Craig appeared on Fox News Sunday and told host Maria Bartiromo that someone was absolutely trying to steal the election and he's not going to let this go.",
    "The other candidates are: financial adviser Michael Markey, businessman Perry Johnson, businesswoman Donna Brandenburg and Michigan State Police Capt.",
    "Michigan Advance is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "The Michigan Supreme Court then ruled Friday 6-1 in favor of the BOE decision that three Johnson, Craig and Markey should be denied a spot.",
    "We had so much momentum going in this campaign, consistently double digits ahead of all the other GOP candidates, said Craig.",
    "That recommendation was then upheld when the Board of State Canvassers (BSC) deadlocked along party lines.",
    "BOE staff are working to refer incidents of apparent fraud to law enforcement for criminal investigation.",
    "And also at times tied with the incumbent governor and with independents.",
    "Contact Editor Susan Demas for questions: info@michiganadvance.com.",
    "The court did not issue a ruling in Brandenburg's suit.",
    "Michigan Advance maintains editorial independence.",
    "Follow Michigan Advance on Facebook and Twitter.",
    "Two polls showed I was ahead with independents.",
    "So let's face it, I was a clear threat.",
    "The winner will face Democratic Gov.",
    "Brown has dropped out of the race.",
    "Gretchen Whitmer on Nov. 8.",
    "Ralph Rebandt.",
    "Mike Brown."
  ]
}