{
  "id": 907,
  "mediaId": 165,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "The Real Reason Republicans Are Loading Their 2022 Campaign Ads With Guns",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/MGTBS.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-features/guns-republican-primary-campaign-ads-midterms-1336903/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Bort",
  "authorUrl": "https://www.rollingstone.com/author/ryan-bort/",
  "termIds": [
    2524,
    2524,
    2298,
    2298,
    2219,
    2219,
    2185,
    2185,
    2087,
    2087,
    2005,
    2005,
    670,
    670,
    1464,
    1464,
    562,
    428,
    428,
    562
  ],
  "sentences": [
    "I'm willing to go to these measures to fight for our tribe.' That's what it's all about.?\nAs Idaho gubernatorial candidate Janice McGeachin put it in an ad released Monday in which she fires an assault rifle, the Second Amendment wasn't ratified into the Bill of Rights so we could bird hunt.?\nThe Second Amendment was never about bird hunting.#2ndAmendment #SecondAmendment #guns #gunrights #gunrange #MakeIdahoFreeAgain pic.twitter.com/inLJHbLAPB\n Janice McGeachin (@JaniceMcGeachin) April 11, 2022\nThe Second Amendment has always been a defensive posture,? Madrid continues.",
    "I'll be a political check on gun control,' but the technological check is inevitable.?\nMasters isn't the only Republican to cry that the Second Amendment is under assault while vowing to scale back gun reform policy  Florida U.S. House candidate Anthony Sabatini even responded to Biden's address on Tuesday by calling for the abolition of the ATF  and if the party takes back Congress in November they are likely to attempt to pass a slew of pro-gun legislation, from clearing the way for nationwide open carry to doing away with background checks.",
    "It's this absurd definition of what American is, and it's getting more and more extreme in the Republican Party every election cycle.?\nThe fact that it's getting so extreme among Republicans, and Republicans alone, may lead some to believe that the tenor of the ads could calm down a little ahead of the general election, when candidates typically pivot to a more moderate message in an effort to court a wider swath of voters.",
    "It's a visual reminder that the party believes Jan. 6 was a good thing, that the attack on the Capitol was a valiant effort, and that Republicans deserve candidates who is willing to implicitly or explicitly condone the use of violence to reclaim a bygone version of the United States they've seen slip through their fingers under Democratic leadership  to make America great again.",
    "It's already been taken, and the only way to defend themselves from whatever that boogeyman is, is to have a stockpile of gold bullion, canned goods, and a ton of weaponry.?\nMadrid, like Filipkowski, acknowledges that the use of guns in political ads is growing,? and that by 2024 Republicans are going to be blowing stuff up.",
    "Conservatives using guns in campaign ads is nothing new, of course, but the way in which they're being used in the wake of Trump's term in office  and particularly in the wake the violent attack on the Capitol that ended it  portends a dark future for the party, and if it regains control of Washington, D.C., for the nation.",
    "Ron Filipkowski, a researcher who tracks right-wing activity online and has highlighted several examples of Republicans going gun crazy in their campaign ads, says the use of guns in ads has absolutely? ratcheted up this primary cycle compared to 2020 and 2018.\nI started noticing it and was like, What's going on?",
    "In last year's gubernatorial election in Virginia, Glenn Youngkin hammered guns, abortion, and his love of Trump during the Republican primary, but eased up on guns and abortion and distanced himself from Trump ahead of the general election, which he went on to win convincingly over Democrat Terry McAullife.",
    "pic.twitter.com/5g1eJdKLIJ\n Ron Filipkowski gg (@RonFilipkowski) September 8, 2021\nHere's Georgia U.S. House candidate Michael Collins blowing up Nancy Pelosi's Plan for America? before hopping in a big rig, throwing a football, and firing another assault rifle for good measure.",
    "It's coming from the hardcore MAGA set, and not only is it likely to stick around beyond the primaries, it's likely hardwired into the DNA of a party now driven by extremism, conspiracy, and a belief that violence is a legitimate tool to achieve desired political outcomes.",
    "#SaveAmerica gg https://t.co/bchzxsgTjE pic.twitter.com/8Cr7UN47N6\n Michael Collins (@MikeCollinsGA) August 23, 2021\nHere's Blake Masters, who's running for Senate in Arizona, with an intimate  and frankly, creepy  ad about his love for his Walther PPK and silencers.",
    "Republican candidates are turning to guns, guns, guns in a very big way ahead of the midterms, serving their potential constituents with a torrent of campaign ads, Instagram posts, and even Christmas cards of themselves toting and firing deadly weapons.",
    "Here's Max Miller, a former Trump aide running for the Ohio U.S. House seat left vacant by retiring Republican Rep. Anthony Gonzalez, talking about using a rifle to protect our country.?\nThe Trump impeachment-vote revenge tour continues on.",
    "#mondaygunday pic.twitter.com/rvokb20Q0u\n Blake Masters (@bgmasters) October 5, 2021\nMasters, a venture capitalist and favorite of Trump-loving billionaire Peter Thiel, has featured guns prominently throughout his primary campaign.",
    "I feel like the establishment candidates kind of feel like they have to do it too, now.?\nBoebert built her successful 2020 campaign largely around guns, and last year released an ad promising to carry a Glock on Capitol Hill.",
    "Establishment Republicans like Lindsey Graham, who last year released a video of himself at a shooting range in khakis, are struggling to keep up, but the point is that they feel like they need to try.",
    "Brandishing weapons and leaning into gun culture is viewed as revolutionary, and by revolutionary I mean, in their minds, the most virtuous sense, as defenders of quote unquote America,? he says.",
    "There are very few things you can do to demonstrate you're more extreme and intense on tribal issues than to insinuate, tacitly or overtly, violence, that you are willing to fight for the cause.",
    "He responded to President Biden's promise on Monday to crack down on ghost guns,? which are homemade and untraceable, by tweeting a picture of a ghost gun? he recently built himself.",
    "Greene in an ad for her 2020 campaign cocked an assault rifle as she warned antifa terrorists? to stay out of her district, and last fall blew up a Prius with a 50-caliber rifle.",
    "Filipowski says he really started noticing the uptick in gun-centric ads, which were often the first big campaign rollout ads candidates would release, last fall.",
    "Far-right politicians in primaries are licking the boots of gun lobbyists,? Moms Demand Action founder Shannon Watts told Rolling Stone in an email on Tuesday.",
    "I think it's almost like the [Lauren] Boebert-, [Marjorie Taylor] Greene-ization of the whole America First movement that's driving the Republican Party now.",
    "gg pic.twitter.com/pcNlyCqJrN\n Garrett Soldano For Governor (@GarrettForMI) October 5, 2021\nSoldano's ad may have been absurd, but it wasn't atypical.",
    "Here is the kickoff ad from Max Miller, his candidate against OH Rep. Anthony Gonzalez, who he says betrayed? the voters by voting for impeachment.",
    "So once you start to move off of that, you will start to lose the intensity of the support and turnout you need from the shrinking Republican base.",
    "Enter here > https://t.co/fd4W5otRPL\nWE THE PEOPLE must stay vigilant in defense of our Second Amendment rights and constitutional freedoms.",
    "There's a lot of paranoia involved here, but it's also demonstrative of a society that a lot of these members feel is out of their control.",
    "The rest of the ad was 45 seconds of footage of Soldano firing various weapons at a gun range, set to a heavy, looping guitar riff.",
    "The only words spoken in it came from a voice aggressively asking, WHO?? and a chorus twice chanting WE THE PEOPLE!? in response.",
    "gENTER OUR CONTEST TO WIN AN AR-15 g\nOur team is giving away a brand new AR-15 rifle to the winner of our contest.",
    "But there's something more insidious behind the sudden rash of pro-gun ads than protecting the Second Amendment.",
    "There's the 1776 rhetoric and there's the patriot rhetoric, and there's the American flag that's always waved.",
    "It's an extremist movement,? says Mike Madrid, a Republican strategist and co-founder of The Lincoln Project.",
    "This is about saying I'm willing to go to arms to overthrow what's here or what's coming.",
    "They intended us to as well  it's the ultimate political act, a liberty the 2A protects.",
    "But this new fixation on guns is not coming from savvy billionaires like Youngkin.",
    " There's a desire to see a society that is centralized on this type of weaponry.",
    "Soldano is not running for sheriff, or even for a seat in the state House.",
    "I'm running for congress to get our America First agenda back on track.",
    "It's now advocating that gun ownership and bearing arms is a virtue.",
    "What we are moving into now is something foundationally different.",
    "He's a Republican running to become the next governor of Michigan.",
    "Garrett Soldano released a pretty strange campaign ad last fall.",
    "The GOP base, at least a wide swath of it, has been radicalized.",
    "This week: @waltherfirearms PPK/S with a @deadairsilencer mask.",
    "With 3D printing, this is going to get easier year after year.",
    "I'm not afraid to say I was pro-Trump from Day One,? he adds.",
    "I'll be the most pro-2A Senator that Arizona has ever had.",
    "It's those candidates who are the ones that are doing it.",
    "Of course, he starts the ad shooting an assault rifle.",
    "I'll not only fight the Democrats but the RINOs too.",
    "They'll certainly continue to do so once in office.",
    "Our founders built their own guns,? Masters added.",
    "These people are winning Republican primaries.?",
    "Every Monday, I'll tell you about one of them.",
    "This is not this is not a primary tactic.",
    "I'm willing to be violent in that cause.",
    "They feel quote unquote America is gone.",
    "It's not going to change,? Madrid says.",
    "It's always been don't take my guns.",
    "It's not a Second Amendment issue.",
    "Very legal & very cool,? he wrote.",
    "This is mainstream Republicanism.",
    "It's not a small fringe group.",
    "I've got the guns to prove it.",
    "It's saying, I'm this intense.",
    "This is what the party is now.",
    "They haven't stopped since.",
    "Radicalization is the goal.",
    "It's almost an obligation.",
    "Technology will not stop.",
    "Help fuel the the fight.",
    "That's what it is.",
    "It's behind them.",
    "I'm this extreme.",
    "It's not a right.",
    "'? he says."
  ]
}