{
  "id": 937,
  "mediaId": 169,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "Why aren't Republicans worried their fanatical culture war will hurt them in the midterms?",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/02/akin-desantis-abbott-mandel-0225221.jpg",
  "link": "https://www.salon.com/2022/03/02/why-arent-worried-their-fanatical-culture-will-hurt-them-in-the-midterms/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Marcotte",
  "authorUrl": "https://www.salon.com/writer/amanda_marcotte",
  "termIds": [
    2305,
    2305,
    2342,
    2342,
    2250,
    2250,
    1017,
    1017,
    800,
    800,
    146,
    146,
    428,
    428,
    2661,
    2661,
    2934,
    2934,
    2945,
    2945
  ],
  "sentences": [
    "Republicans want to make the 2022 elections a referendum on President Joe Biden's supposed failures to end the pandemic or bring inflation under control, even though the former is wholly the fault of Republicans themselves for encouraging vaccine rejection and the latter is not something, say, re-electing a Republican governor of Texas will change in any way.",
    "The most notorious case is that of Todd Akin, the Republican who lost a Missouri Senate race to Democrat Claire McCaskill after claiming that no rape victim needed an abortion, because, \"If it's a legitimate rape, the female body has ways to try to shut that whole thing down.\"",
    "Republicans aren't worried, however, because they're likely counting on two things: The increasing nationalization of partisan politics and the fact that most voters just aren't paying enough attention to understand how far to the right the GOP has gone.",
    "RELATED: Democrats can win the culture wars  but they have to take on the fight early and often\nWhat is remarkable is how none of these fools seem worried about these outrageous views coming back to haunt them in a general election, as they did for Akin.",
    "In the same state, Republican gubernatorial candidate Garrett Soldano said rape victims should not be allowed abortions, but instead should be told to be happy because, \"God put them in this moment\" and that we should \"protect that DNA\" instead.",
    "Ten years ago the Democratic Party faced dire election prospects, similar to those it faces today, with widespread disappointment in the economic recovery and too much complacency among Democratic voters  and a fired-up right wing opposition.",
    "Greg Abbott and Attorney General Ken Paxton issued a directive that parents who support trans children should be investigated for child abuse, even though that means doctors are supposed to report parents for taking the best medical advice.",
    "Ron DeSantis is supporting a bill that would allow parents to sue teachers who acknowledge the existence of LGBTQ people, even in small ways such as allowing kids of same-sex parents to talk about their families during \"show and tell.\"",
    "Florida Sen. Rick Scott released an 11-point GOP plan for America that states heterosexual marriage is \"God's design for humanity,\" which isn't just an insult to LGBTQ Americans but the nearly 50% of all adults who aren't married.",
    "Florida Republicans also invited legislative testimony from an anti-choice activist who argued against legal birth control, claiming, \"The contraceptive mentality is what fuels the bloodthirsty abortion industry.\"",
    "For the rest of the public, however, he hid behind a demeanor of normalcy that lulled Democratic voters into feeling it would be safe not to vote and allowed moderates to believe he's not one of Those Republicans.",
    "As the New York Times noted at the time, Obama had to overcome \"powerful economic headwinds, a lock-step resistance to his agenda by Republicans in Congress and an unprecedented torrent of advertising.\"",
    "As political scientists Yanna Krupnikov and John Barry Ryan argued in the New York Times in 2020, \"most Americans  upward of 80 percent to 85 percent  follow politics casually or not at all.\"",
    "To those who followed the religious right's rhetoric, the comment came as no surprise  that's pretty much a standard belief in the anti-choice movement that dominates the Republican Party.",
    "Indeed, the laser-like focus on national politics is such that Paxton blew off a primary debate last week in favor of attending the Conservative Political Action Conference (CPAC).",
    "On the latter, well, Republicans have a good reason to believe those moderate and swing voters they need to win will never find out about their extreme statements and actions.",
    "The reason why Akin's comments about \"legitimate rape\" actually hurt him in the general election is that Democrats went after him hard and made sure the public heard about it.",
    "Biden seems to get it on the issue of the Russian invasion of Ukraine, where he nodded towards the unpopular pro-Putin views espoused by Donald Trump and Tucker Carlson.",
    "So conservatives can happily play up far right bona fides to their rabid base, content in the belief that the majority of voters will never know how terrible they are.",
    "Abbott's opponent in the general election will be former congressman Beto O'Rourke, who got within a couple of points of beating Sen. Ted Cruz in the 2018 midterms.",
    "But as the 2012 election demonstrated, it came at times at great cost, as radical-right candidates who performed well in primaries often faltered on the main stage.",
    "They nationalized the debate over whether or not some rape victims are \"legitimate\" and in doing so put Akin's offensive views on the radar of less-engaged voters.",
    "In what was perhaps a bigger surprise, Democrats managed to overcome those forces to gain two seats in the Senate, even as Republicans held control of the House.",
    "Virginia voters apparently are surprised at how conservative Youngkin is, even though even a cursory examination of his past would have revealed that fact.",
    "Unfortunately, President Joe Biden's State of the Union speech Tuesday night largely focused on a laundry list of important-but-boring policy priorities.",
    "They will never hear about Republicans pushing to allow birth control to be criminalized, or Republican candidates calling rape-caused pregnancy a gift.",
    "As Axios reports, just 34% of Democratic voters report paying a \"great deal of attention to national news in 2021, compared to 69% in November 2020.\"",
    "On the former, the bet is quite simple: Voters are blaming Democrats for our currently bleak landscape, because a Democrat controls the White House.",
    "Democratic policies may be popular, but this snooze-fest approach is simply not enough to penetrate the wall of ignorance surrounding most voters.",
    "But Biden and the Democrats so far seem reluctant to go for it on all the culture war issues that have a chance of actually waking voters up.",
    "And in Ohio, the frontrunner for the GOP senate primary, Josh Mandel, has been declaring that the separation of church and state is a \"myth.\"",
    "The situation is incredibly dire now, as there's been a dramatic decline in the public's interest in the news and politics in the past year.",
    "We saw how this worked in the Virginia gubernatorial election, where Republican Glenn Youngkin was able to win with a two-pronged strategy.",
    "Democrats need to Akin-ize the Republicans by making a spectacle of the grotesque, sadistic, far-right views their opponents are touting.",
    "In Michigan, all three GOP candidates for attorney general affirmed support for a state's \"right\" to criminalize access to birth control.",
    "For the deeply invested right wing base, his message was pure MAGA, which successfully turned out the hardcore Republican vote.",
    "That far-right movement was focused not only on pushing Democrats out of office, but also on seizing control of the GOP.",
    "High profile Democrats, including Obama himself, made a point of rebuking Akin by declaring \"rape is rape\" frequently.",
    "Republicans are counting on the people who would be alarmed at their extremism not paying enough attention to notice.",
    "But for ordinary voters who don't follow politics closely, it was a shocking wake-up call that led to Akin's loss.",
    "Barack Obama's re-election may look like a foregone conclusion in the rear-view mirror, but it very much was not.",
    "That was before the disastrous statewide blackouts and massive COVID-19 debacle that happened on the GOP watch.",
    "While Biden did defend trans rights, he skated over abortion rights and ignored the red-hot book banning issue.",
    "On the contrary, the strategy in 2022 seems to be to go all-out on pushing a radical religious right agenda.",
    "Now Youngkin has gone all-out on a far-right agenda of defunding essential programs and banning books.",
    "They're coming for birth control and want to shape the law to make heterosexual marriage compulsory.",
    "They are running a nationwide campaign to ban books, something more than 85% of voters oppose.",
    "If they don't start taking the fight to Republicans, November really will be an ass-whupping.",
    "Gretchen Whitmer of Michigan and Sen. Sherrod Brown of Ohio, both Democrats, can attest.",
    "His approval ratings are already underwater, which is rare this soon after an election.",
    "Republican interest, however, has barely dropped off at all, relative to these numbers.",
    "Even Texas, which has been controlled by Republicans for decades, isn't a sure bet.",
    "In the decade since, however, Republicans haven't moderated on these issues at all.",
    "It's a troubling indicator that Democrats have not learned their lesson.",
    "Baiting Republicans into showing who they really are is smart politics.",
    "But most people simply don't pay enough attention, until it's too late.",
    "People hate this crap and will vote against it  if they know about it.",
    "(The phrase comes directly from Thomas Jefferson himself.)",
    "These aren't politicians from deep red states, after all.",
    "Florida, Michigan and Ohio all are swing states, as Gov.",
    "Democrats need to give people something to vote against.",
    "The examples just from recent weeks are overwhelming.",
    "Republicans aren't exactly hiding what they believe.",
    "Independent voters have also tuned out dramatically.",
    "Subscribe to her newsletter Standing Room Only.",
    "Subscribe to her newsletter Standing Room Only.",
    "On that front, they had considerable success.",
    "The situation isn't impossible, however.",
    "They flat-out banned abortion in Texas!",
    "Want more Amanda Marcotte on politics?",
    "Want more Amanda Marcotte on politics?",
    "And not just in Missouri, either.",
    "It shouldn't be hard.",
    "Blame the Tea Party.",
    "In Florida, Gov.",
    "In Texas, Gov."
  ]
}