{
  "id": 3358,
  "mediaId": 98,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Column: Trump's goal is to solidify control over the GOP, not help it win elections",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/69c2462/2147483647/strip/true/crop/3600x2400+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F13%2Fa0%2F60c2f17f4dc5849f142e050ecfe7%2Felection-2022-ohio-06721.jpg",
  "link": "https://www.latimes.com/opinion/story/2022-05-17/donald-trump-endorsements-conservatives-maga-conservatives-republicans",
  "sentiment": "0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    1653,
    1710,
    2491,
    3094,
    4713,
    428,
    2661,
    2666,
    2862
  ],
  "sentences": [
    "I have Donald Trump tattooed on my rear end.'?\nCruz's remarks invited mockery, given that he battled Trump for the GOP presidential nomination in 2016 all the way to the convention and then pledged his love for Trump  despite the fact that Trump had insulted Cruz's wife, suggested Cruz's father was linked to President Kennedy's assassination and claimed Cruz stole the Iowa caucuses.",
    "Besides memory-holing his own Trump sycophancy, the other strange note in Cruz's performance was his claim that the establishment? is still run by moderate Republican squishes.? The establishment?  everyone from nationalist donors like Peter Thiel to the Heritage Foundation to Fox News  is now mostly MAGA.",
    "As Fred Bauer notes in National Review, Trump has been more focused on asserting dominance over the GOP than ensuring that Republicans win elections.?\nThe irony is that Trump is now grappling with the woes of being the establishment.",
    "The House GOP's transition to full MAGA was completed when they defenestrated Rep. Liz Cheney and replaced her with Rep. Elise Stefanik, who has transformed herself from Republican moderate to bright red Trump acolyte.",
    "While it's true that Senate Republican leader Mitch McConnell has no love for Trump, he's not a moderate, establishment squish.? He has already said he would vote for Trump if he were the nominee in 2024.",
    "The MAGA revolution within the GOP succeeded, but as Jacques Mallet du Pan wrote in 1793 about the chaos in France, Like Saturn, the Revolution devours its children.?",
    "A candidate like McCormick, who didn't get Trump's endorsement, is nonetheless surrounding himself with former Trump staffers and talking a fairly Trumpian game.",
    "The key to understanding the GOP primaries is to know that traditional conservative ideology or even competence aren't qualifications or differentiators anymore.",
    "In Ohio, Josh Mandel lost his bid for the GOP senate nomination  and for Trump's endorsement  despite running as the Renfield to Trump's Dracula.",
    "And while his agenda looks nothing like a normal establishment agenda, he still has to contend with ambitious politicians with their own agendas.",
    "He was campaigning for Republican Senate candidate David McCormick, who is running against Mehmet Oz, whom Donald Trump has endorsed.",
    "Kathy Barnette, another GOP Senate candidate in Pennsylvania, has taken to attacking the swamp? in true Trumpian fashion.",
    "Of course, none of Trump's criteria for endorsements has anything to do with ideological or even partisan litmus tests.",
    "Just once, I'd love to see a Republican candidate stand up in a primary and say, I am a moderate, establishment squish.",
    "If they were, Cheney wouldn't be a pariah, and Reps. Marjorie Taylor Greene and Lauren Boebert wouldn't be stars.",
    "And, if they check those boxes, they need to have a better-than-good chance of winning  without his endorsement.",
    "It was President Trump who shifted and aligned with our values.? Translation: MAGA is bigger than Trump now.",
    "It's true that, with very few exceptions, Republican primary candidates do pledge their love for Trump.",
    "People like Fox News' Sean Hannity, who has carried more water for Trump than a thousand Gunga Dins.",
    "Although he coined the word, MAGA actually belongs to the people.? Barnette said in a recent debate.",
    "But nobody says that.? He then added, And by the way, they all pledge their love for Donald Trump.",
    "They also must subscribe to his bogus claim that the 2020 election was stolen from him.",
    "Everyone has to be an angry populist revolutionary who wants to see the world burn.",
    "Sen. Ted Cruz of Texas said something interesting in Pennsylvania last week.",
    "The real goal isn't to expand the party, but to solidify his control of it.",
    "I stand for absolutely nothing.' It would be refreshingly honest at least.",
    "Trump wants to pick winners, so he can take credit for being a kingmaker.",
    "There's no point sitting around pondering Cruz's lack of self-awareness.",
    "Ron DeSantis started out as a student and is now a MAGA master.",
    "Our values never, never shifted to President Trump's values.",
    "Candidates seeking his endorsement must praise him lavishly.",
    "Some are more obsequiously shameless than others, of course.",
    "Whatever happens in the primaries, the die has been cast.",
    "I love Donald Trump more.' No, no, no.",
    "Besides, he made a good point.",
    "A politician like Florida Gov.",
    "I love Donald Trump,' No, no.",
    "But who is the swamp now?"
  ]
}