{
  "id": 3461,
  "mediaId": 302,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "Florida teachers dont get enough math instruction, report says",
  "image": "https://www.tampabay.com/resizer//kC2dQMvteLzRsCaxdeMJSF1f_3o=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/HFOOBPBPFRFVVERZPOCRMPIWQQ.JPG",
  "link": "https://www.tampabay.com/news/education/2022/05/19/florida-teachers-dont-get-enough-math-instruction-report-says/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "I think that the new chancellor has a personality and perspective that will really fit in well with the unique aspects of what it means to live and work in St. Petersburg.?\nSubscribe to our free Gradebook newsletter\nAt a news conference Wednesday, Hardigree said she would begin by listening, but that listening be something she did every day, not just as a tour at the beginning.",
    "I am confident she will be an outstanding advocate for the St. Petersburg campus and a trusted partner to me as we work together to continue the University of South Floridas tremendous momentum.?\nDuring her town hall session, Hardigree said she wanted to be a part of USF after visiting the small waterfront campus just south of the downtown core.",
    "Those moments where you get that waaaaah and its just amazing and it makes you want to come back and do it again and again.?\nShe later went to Kennesaw State University as the founding director and professor of the Institute for Culinary Sustainability and Hospitality, helping to secure the universitys largest gift.",
    "If the faculty can create deeper bonds with the business community or whoevers going to be hiring their students, it not only benefits whats going to be happening in the classroom but also future placements.?\nLaw said in a virtual news conference Wednesday that her choice was based in part on community feedback.",
    "Someone who would fit in with the chamber and the downtown partnership and others and be a real integral part of St. Petersburg.?\nDuring the town hall, Hardigree was asked her thoughts about building bridges on both sides of the political aisle, with the reminder that the campus was part of a state university.",
    "Alison Barlow, executive director of the St. Petersburg Innovation District and a member of the search committee, called Hardigree a great combination of someone with an academic background and an attention and understanding of an involved community.?\nI think thats really critical,? Barlow said.",
    "We are thrilled to welcome Christian Hardigree, a leader who brings a demonstrated history of academic and administrative experience, as well as an excellent record of serving the communities she has been a part of throughout her career,? Law said in a statement announcing the selection.",
    "Several members of a USF search committee who narrowed the field of candidates for Law praised Hardigree for her ideas and energy, but some questioned her understanding of the regional chancellors role and the strength of her research experience, a priority for many faculty and deans.",
    "Gender issues: A Flagler County teen who helped organize statewide protests against Floridas law relating to instruction on gender identity and sexual orientation says hes been banned from running for his schools class president, Newsweek reports.",
    "University of South Florida president Rhea Law has named her selection for the new regional chancellor of the St. Petersburg campus: Christian Hardigree, founding dean of the School of Hospitality at Metropolitan State University of Denver.",
    "School violence: Numbers of school fights, threats and other incidents are not increasing across Florida, but some families say they feel the intensity of school violence more and want officials to provide more security, WTVJ reports.",
    "Legal costs: The Sarasota County School Board approved spending an additional $136,000 in legal fees to cover costs associated with disputes over masks, public commenting and other extraordinary circumstances,? WUSF reports.",
    "State governments were our angel investor for years and years and years, and not anymore.?\nThe big story: Over the weekend, a gunman went on a rampage in a Buffalo, N.Y., grocery store in a predominantly Black part of town.",
    "The selection was made after Hardigree and two other candidates, including former St. Petersburg deputy mayor Kanika Tomalin, participated in town hall forums and community members provided the president with feedback.",
    "Subscribe to our free Gradebook newsletter\nSchool names: Some Titusville residents are calling for the renaming of Andrew Jackson Middle School, but many community members oppose the proposal, Florida Today reports.",
    "Its clearly a special place, and Im thrilled to have the opportunity to lead such a vibrant campus.?\nHardigree, 51, will replace outgoing regional chancellor Martin Tadlock, and is set to begin work on July 1.",
    "Culture wars\nHB 1557: A federal judge has scheduled a trial over Floridas new law relating to the instruction of gender identity and sexual orientation for February, the News Service of Florida reports.",
    "Race relations: The Martin County school district will heighten security at a middle school after a photo surfaced on social media showing students on the campus spelling out racial slurs, WPTV reports.",
    "More hot topics\nTop teachers: Two more finalists were announced for Florida 2023 teacher of the year  Deelah Jackson of Manatee County (Bradenton Herald) and Jennifer Jaso of Sarasota County (WWSB).",
    "She spoke at the town hall about the importance of a campus carving out a distinct identity, comparing it to Waffle House, where she said hospitality graduates can quickly earn six-figure salaries.",
    "Free meals: Seminole County schools are encouraging families to see if they qualify for meal benefits as the federal program providing free lunches for everyone ends, Spectrum 13 reports.",
    "Questions quickly popped up in Florida about whether public school teachers would be allowed to discuss the event, given the states new law on the instruction about race-related matters.",
    "The regional chancellor, who reports to the Tampa-based president, leads the faculty and students of the St. Petersburg campus, often interacting with Pinellas officials and the public.",
    "Jason Mathis, CEO of the St. Petersburg Downtown Partnership and a member of the committee, said Wednesday that Hardigrees decades of experience in academia will serve her well at USF.",
    " The Duval County school district will eliminate its standalone LGBTQ student support guide and incorporate portions into a larger set of student support measures, WTLV reports.",
    " Miami-Dade County music teacher Vivian Gonzalez is one of 30 recipients nationally of a Music Teacher of Excellence Award from the County Music Association, WFOR reports.",
    "The report indicates that undergraduate teacher preparation programs around the nation have increased the amount of time the future educators focus on elementary math.",
    "School start times: The Pasco County school district will end its unpopular 10:10 a.m. start time for three quarters of the schools that used it for the past semester.",
    "Career training: The University of South Florida has joined forces with two hospitality industry companies to create paid fellowship opportunities for students.",
    "Hot topics\nSuperintendent turnover: Longtime Pinellas County educator Kevin Hendrick won the School Boards unanimous nod to become the districts next leader.",
    "A new report from the National Council on Teacher Quality suggests that Floridas teachers should spend more time learning about how to instruct the subject.",
    " The St. Johns County School Board will meet next week to review seven of 50 books that a group has requested be removed from school shelves, WJXT reports.",
    "We spend a lot of time and energy talking about placing students with companies, but probably one of our strongest touchpoints for students is the faculty.",
    "The law, which takes effect in July, requires instruction about Black history, including an understanding about the ramifications of prejudice and racism.",
    "We trusted him. A former student who belonged to a secret society run by her schools band director shares her experiences, the Daily Commercial reports.",
    "Math textbooks: The Escambia County school districts choice of K-5 math books was added to the states approved list, the Pensacola News-Journal reports.",
    "I absolutely fell in love with the faculty, staff, students and community members I met at USF St. Petersburg,? Hardigree said in a statement Wednesday.",
    " Former Volusia County deputy superintendent Carmen Balgobin agreed to take the the districts top job shortly after leaving the district, WKMG reports.",
    "Hardigree was commended by business leaders on the search committee for innovative ideas, such as faculty internships and partnering with businesses.",
    "It made the move after the School Board rejected an insurance rebate proposal that both sides had agreed to at the table, Flagler Live reports.",
    "It also permits teachers to facilitate discussions about how personal freedoms have been infringed upon by racism, sexism and other prejudices.",
    "Book challenges: The president of Floridas school media specialist association says her profession faces unprecedented scrutiny, WLRN reports.",
    "Superintendent turnover: The Alachua County School Board extended the contract of its interim superintendent through June 2024, WCJB reports.",
    "She later became a student athlete and a part-time student working two to three jobs at a time to support herself through college, she said.",
    "She stayed for 15 years, eventually becoming a full-time tenure track professor, department chair, associate dean and assistant president.",
    "Broward County fourth grade teacher Seema Naik was named the first of five finalists for Florida 2003 teacher of the year, WSVN reports.",
    "Access to higher education, she said, will be important to her, particularly regarding students in the Pinellas County school district.",
    "During a town hall at the St. Petersburg campus last month, she spoke of her path into academia and goals for the future of the campus.",
    "Every Thursday, get the latest updates on whats happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    " Bay Countys top graduates didnt let a major hurricane or a pandemic deter them from their goals, the Panama City News Herald reports.",
    "Every Thursday, get the latest updates on whats happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "Subscribe to our free Gradebook newsletter\nOther school news\nThe University of South Florida St. Petersburg campus has a new leader.",
    " The Sarasota County school district also is looking into bell changes because of its driver shortage, the North Port Sun reports.",
    "Some Miami-Dade County teens are getting lessons through art in how climate changes might affect Miami, the Miami Herald reports.",
    "Flagler Countys school teacher and employee union has suspended contract negotiations over allegations of bad faith bargaining.",
    "Originally from rural Georgia, she said she grew up on a farm, where her mother was the primary breadwinner as a social worker.",
    " Seniors at two Lee County high schools might have to graduate without caps and gowns because of a shortage, WBBH reports.",
    "From the police blotter ... A Pasco County high school teacher was arrested on accusations of having sex with a student.",
    "Charter schools: Indian River State College won approval to launch a charter high school in Martin County, WQCS reports.",
    "Other school news\nPinellas Countys final segregated class of Black students prepared to graduate together 53 years ago.",
    "Graduation season: Meet the valedictorians and salutatorians from Pinellas Countys public schools and private schools.",
    "The job of the 17-member search committee was to come up with an unranked list of three finalists for Law to consider.",
    "Board members accused colleague Jon Arguello of harassing a vendor because of political disagreements, WFTV reports.",
    "We need someone with an academic background, someone that is capable of putting together curriculum and programming.",
    "The law additionally states that teachers may not indoctrinate or persuade students to a particular point of view.",
    "Wolf Yeigh, former chancellor at University of Washington Bothell, received the most votes from committee members.",
    " A charter school group has announced plans for a new early college program in Duval County, Clay Today reports.",
    "The Broward County School Board approved its superintendents reorganization plan despite concerns it was rushed.",
    "Sustainability wasnt a cool and sexy? buzzword, she said, it was a necessity and a value still engrained in her.",
    "Integration split them up, but the classmates stayed close, and they recently celebrated a special reunion.",
    "The big story: Florida has spent plenty of time in recent weeks discussing the content of math textbooks.",
    "The Polk County school district nearly closed an aging elementary school over infrastructure concerns.",
    "Critics of the law suggested that its vague enough to make it unclear whats permissible and whats not.",
    "She also talked about upskilling? faculty and finding opportunities to embed them in local businesses.",
    "Some Orange County graduating seniors wrote notes to thank teachers who made a difference to them.",
    "Tomalin, the former deputy mayor, had the second-most, ahead of Hardigree and another candidate.",
    "The School Board implemented the late start as a way to deal with chronic bus driver shortages.",
    "Hardigree became a trial lawyer, defending hotels, restaurants and nightclubs in Las Vegas.",
    "But Florida logged in last for math content provided, at 40 hours, Education Week reports.",
    " One of Central Floridas oldest charter schools broke ground for a new home, WFTV reports.",
    "She starting teaching at the University of Nevada, Las Vegas as a part-time instructor.",
    "What I specifically was looking for was someone who could be a true leader,? she said.",
    "It will introduce its first Montessori program at Essrig Elementary, WFLA reports.",
    "The plan cuts academic positions while adding communications jobs, WLRN reports.",
    "We have been blessed with support from our Legislature, support from our donors.",
    "Officials there said they were looking into the matter as a racist hate crime.",
    "Instead, the school is celebrating its 111th anniversary, the Ledger reports.",
    "Manatee County schools will stop providing universal free meals in the fall.",
    "Others said she struck the right balance between academia and the community.",
    "The Hillsborough County school district is expanding its choice offerings.",
    "Christian Hardigree comes from Metropolitan State University in Denver.",
    "What we need to do is figure out whats our Waffle House,? she said.",
    "Someone who could take this campus and move it to the next step.",
    "Before you go ... Ukraines Kalush Orchestra won Eurovision 2022.",
    "The districts top five choices all had been initially rejected.",
    "And its because I really resonate with our students,? she said.",
    "I also looked for someone who would fit in with the community.",
    "The federal funding for the program has ended, WWSB reports.",
    "When you meet somebody, you think ok, can I work with them?",
    "Then they delivered the messages in person, WKMG reports.",
    "So much of this is kind of personality driven,? he said.",
    "Teaching, like gambling and golf, has a periodic payoff.",
    "At times, she said, she was food insecure and homeless.",
    "Weve seen whats happened politically for higher ed.",
    "Weve got to do a better job of telling our story.",
    "Its what drives decision-making in so many areas.",
    "The Osceola County School Board has asked Gov.",
    "Before you go ... Who says Legos cant be art?",
    "Ron DeSantis to sanction one of its members.",
    "Will they be a good fit for USF St. Pete?",
    "Will they be a good fit in the community?",
    "Yesterdays roundup is just a click away.",
    "I fell in love with students,? she said.",
    "  \nSign up for the Gradebook newsletter!",
    "Yesterdays roundup is just a click away.",
    "Its an elephant in the room,? she said.",
    "Sign up for the Gradebook newsletter!",
    "Wyoming ranked first, with 146 hours.",
    "Its award time in Florida education.",
    "Read more from Florida Phoenix.",
    "Have you heard the song yet?",
    "What is a climate refugee?",
    "Im very student-focused.",
    "Click here to sign up.",
    "Click here to sign up.",
    "Dont miss a story.",
    "Dont miss a story.",
    "More from TC Palm."
  ]
}