{
  "id": 3462,
  "mediaId": 238,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "This Florida teacher married a woman. Now shes not a teacher anymore.",
  "image": "",
  "link": "https://www.washingtonpost.com/education/2022/05/19/gay-florida-teacher-desantis-lgbtq/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Natanson",
  "authorUrl": "https://www.washingtonpost.com/people/hannah-natanson/",
  "termIds": [
    661
  ],
  "sentences": [
    "Sometimes she thought about how much it would have helped to discuss her sexuality with an openly LGBTQ teacher in grade school: I definitely would have gone to that person, because I would have known theyd be accepting.?\nEarly in the job, one teacher  who figured out Solomon was gay after watching Hayley help Solomon cart supplies into her classroom  told her in the middle of a casual conversation, I like you as a person, but I dont support gay marriage.\"",
    "Ron DeSantis (R) signed it into law March 28, vowing as he did so that children in his state would get an education, not an indoctrination.?\nThe new law was both broad and vague, outlawing classroom instruction  on sexual orientation or gender identity in kindergarten through grade 3 and stipulating these lessons must be age-appropriate or developmentally appropriate? for all older students.",
    "Dont do that.?\nAsked about these incidents, Miami-Dade schools spokeswoman Jaquelyn Calzadilla wrote in a statement Wednesday that the school district has policies that expressly prohibit discrimination and harassment\" and that the school board strives to provide a workplace and educational environment free from? both.",
    "She glanced around at the neatly labeled black buckets of supplies, pictures of former students and a small sign reading, If you cant be kind, be quiet.? She looked down at the diamond wedding ring she had worn since marrying her wife, Hayley Solomon, in Coconut Grove almost exactly four years ago.",
    "In that role, which she started just after graduating from Florida International University with a degree in psychology, Solomon traveled into schools and counseled LGBTQ students, helping transgender children change their names and gay, lesbian or queer children come out to parents and peers.",
    "She had long ago learned to nod and smile, swallowing her feelings, when other teachers told Solomon that her marriage was a violation, that it broke Gods rules, that it went against their religion and the way they believed the world should be.",
    "And she made him feel so comfortable, even though the other kids would make fun of him.?\nStudents wrote Solomon notes expressing devotion, which she saved in a shoebox: Some people say you are only nice because your young,? wrote one girl.",
    "With every student, her first question was, Do your parents know?? If the answer was no,? and if Solomon ascertained the students household was likely to be accepting, she encouraged the student to come out to their parents.",
    "She thought about the handwritten letter one of her first students, a boy, once handed her: So I have a secret that is that I am gay!? She thought about how, as far as she knew, she was the only LGBTQ teacher in the school.",
    "The Parental Rights in Education bill passed the Florida House and Senate in March, despite strong opposition from LGBTQ activists and the political left, including President Bidens statement the bill was hateful.? Gov.",
    "It was January, and her mother was talking about a new bill, just proposed in the Florida legislature, that would severely limit how teachers could discuss gender identity and sexual orientation with their students.",
    "And taking the time to answer all my questions, calls and messages.?\nThe mother closed with, I believe that education is the best gift to receive?  and as she read it, Solomon believed it was her calling to give.",
    "The couple redid the house, kitting out the kitchen in white tile and adding large glass doors that led to a sheltered backyard with artificial grass and strings of outdoor lights that swung in the Miami breezes.",
    "I am 100 percent sure she lost because of that.?\nThen in fall 2021, when Solomon went to a colleague for advice about a transgender students request for a gender-neutral bathroom, the staffers face darkened.",
    "As staff members were sitting down to vote, Arriete said she heard another teacher mutter that she refused to vote for Solomon \"because shes gay.? Arriete looked behind her but couldnt identify who said it.",
    "She knew that Florida leans Republican and that, although Miami is supposed to be a blue bubble,? many of the citys older residents hold deeply conservative beliefs, including a dislike of LGBTQ lifestyles.",
    "Other teachers had warned her that parents in their ritzy sector of Miami, where the median household income tops $150,000, can be pushy and demanding  so Solomon was astonished by the message.",
    "Still, some students figured it out: some by looking up her wedding video or her Instagram, which mentioned her wife, and some by catching sight of her phone background, a wedding picture.",
    "The final straw was when her supervisor implied she would face consequences for taking a weeks leave so she could get fertility treatments; she and Hayley were trying to have a baby.",
    "She noted that Miami-Dade has never required, either directly or indirectly, that teachers in same-sex marriages refrain from mentioning or acknowledging their marriages in class.\"",
    "Filling this role meant tacking a rainbow-colored sticker on her door  and making herself available to discuss LGBTQ identities and problems with any students who wanted to talk.",
    "The only other times Solomon revealed she was married to a woman was when students came to her in her capacity as a liaison for the School Allies for Equity, or SAFE, program.",
    "It would inspire a wave of copycat legislation  Alabamas governor signed a near-identical measure into law in April, and similar bills are pending in at least 19 other states.",
    "One of Solomons colleagues, third-grade teacher Gelany Arriete, 38, said in an interview that Solomon seemed sweet and shy initially but soon gained confidence as a teacher.",
    "She began to wonder, Why not become a teacher??  and scored a position teaching fourth grade in Miami-Dade County Public Schools starting in 2018, the year she got married.",
    "In Orlando, a sixth-grade science teacher decided to resign this spring after parents wrote a letter complaining that he had acknowledged his same-sex marriage at school.",
    "Neither she nor Hayley Solomon felt comfortable holding hands in public  not even in their neighborhood  unless they were walking through a small slice of Coconut Grove.",
    "Although Solomons straight colleagues often made casual references to their husbands in the course of teaching, she had never dared to mention her wife to students.",
    "After they married, they bought their forever home? in Miami, close to an LGBTQ-friendly neighborhood called Coconut Grove and just 20 minutes from Solomons school.",
    "The first date was a disaster  Hayley talked endlessly about an ex-girlfriend  but the two women kept texting afterward, compelled by some force neither understood.",
    "Stunned, all Solomon could think to say was, Okay.?\nSome time after that, third-grade teacher Arriete said, another staffer struck up a conversation about Solomon.",
    "... She does not emberes me like other teachers.?\nSolomon also kept the message that arrived from a mother, written in orange ink on a gilt-edged white postcard.",
    "No one else was gay at the school, you know  no one else knew anything about that.?\nOver the years, a half-dozen children came out to her as gay or transgender.",
    "She found it upsetting, but not because she planned to talk  or had ever talked  about gender identity, sexual orientation or LGBTQ issues in the classroom.",
    "She remembered the time some of her students Googled her name and somehow found her wedding video on Vimeo, which she hadnt realized was publicly available.",
    "Part of her reticence came from the lack of support  veering into open animosity  she had faced from some colleagues ever since her first week on the job.",
    "The years of homophobic comments from her colleagues now seemed enshrined in state law, their message  you dont belong here?  triumphant and irresistible.",
    "She was younger than many of her colleagues and found it easier to understand students extracurricular obsessions, such as TikTok challenges and dances.",
    "The woman asked if Arriete knew Solomon was married to a woman, adding that same-sex relations were against her religion and not right in Gods eyes.\"",
    "Since then, she has spent most of her time hunting for a job on LinkedIn and traveling to a long string of fertility-related doctors appointments.",
    "When a student asked if shed been to Rhode Island  which she had, because Hayley Solomons family is from there  she cut the conversation short.",
    "In a biography accompanying her submission, Solomon detailed her marriage to Hayley, as well as her stint working for an LGBTQ rights group.",
    "Some handed her letters at the end of her last day, in which they apologized for past bad behavior and asked if she would change her mind.",
    "Pondering the impact of the new Florida law, Solomon recalled how fourth-graders love to ask questions about their teachers private lives.",
    "Solomon thought about how, under the new law, a parent lawsuit could stem from just one awkward exchange about her personal life.",
    "When students presented her with this proof, Solomon briefly confirmed the marriage, then moved the conversation to other topics.",
    "Solomon stood listening inside her fourth-grade classroom at Key Biscayne K-8 Center, part of Miami-Dade County Public Schools.",
    "But of the more than 630 jobs she has applied for in the past five months, not a single one was as a public-school teacher.",
    "For the first three years of her teaching job, no one told her explicitly to conceal the fact she was married to a woman.",
    "So when students, spotting Solomons wedding ring, asked for her husbands name, she laughed it off with an eliding joke.",
    "Once, she brought Hayley and her mother to a Winter Fest? family event, but the women left after less than an hour.",
    "In these conversations, if students asked, Solomon admitted she was a lesbian, happily married to another woman.",
    "Solomon, now 28, found her way to teaching through her work for a nonprofit called The Alliance for GLBTQ Youth.",
    "Although Floridas law does not take effect until July 1, LGBTQ teachers in Florida felt its impact immediately.",
    "Soon, Solomon realized her favorite part of the job was being inside schools, spending time with young people.",
    "Later, Arriete nominated Solomon for a Rookie Teacher of the Year? prize, awarded through a faculty-wide vote.",
    "Solomon herself came out fully in college; in high school, she told only a handful of people closest to her.",
    "For now, she and her wife are surviving on Hayleys salary, although it wont cover them both for much longer.",
    "Solomon lost the prize to another teacher who had worked at the school for less than a year, Arriete said.",
    "But it was specific when it came to punishment: Parents could sue school districts for violating the law.",
    "In Cape Coral, a middle-school art teacher lost her job after admitting her own pansexuality to students.",
    "But the truth is you have a amazing personality and a amazing warm heart.? Another student wrote: Mrs.",
    "But the bigger problem was it no longer felt possible to be lesbian and a teacher in Florida.",
    "Hoping to make some extra cash, Solomon has begun designing and selling dog collars on Etsy.",
    "She had been nervous at first but discovered a natural ability to connect with the children.",
    "I am so filled with gratitude for all that you have done for my daughter,? the woman wrote.",
    "But she also recalled the students she had grown to love over her four years of teaching.",
    "Arriete said Solomon had a special way of interacting with kids? that set them at ease.",
    "They hoped to raise children there, sending them through the Miami-Dade school system.",
    "A lot of people didnt vote because she is openly gay, and that is wrong,? she said.",
    "I remember one incident, she did have a student who was gay,? Arriete said.",
    "Arriete, whose brother is gay, walked away rather than start an argument.",
    "She also made a point of asking them about their hobbies and vacations.",
    "Her wife, employed by a tech company, was able to work from home.",
    "On their second date, Solomon brought Hayley a home-cooked meal.",
    "She found her wife, Hayley, through the dating website OkCupid.",
    "Solomon did it on her own, scared of sparking drama,? she said.",
    "I just felt like Id be a good person to do that,? Solomon said.",
    "Her mother, a vocal supporter of LGBTQ rights, sounded upset.",
    "Critics were already calling it the dont say gay? bill.",
    "Most told her informally, blurting it out by her desk.",
    "Meanwhile, Solomon was falling in love with teaching.",
    "In Miami, Solomon read the text of the law closely.",
    "Solomon is special  very organizd and shes fun.",
    "A few days later, the women moved in together.",
    "She still thinks about her students most days.",
    "Let me give you a tip,\" the woman said.",
    "Her students cried when she told them.",
    "Six months later, they were engaged.",
    "\"Dont talk about anything LGBT.",
    "The kids were at lunch.",
    "Parents can get upset.",
    "Dont do it."
  ]
}