{
  "id": 3463,
  "mediaId": 136,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "HHS Guidance on Trans Pharmacology Raises More Questions Than It Answers | Opinion",
  "image": "https://d.newsweek.com/en/full/2039484/rachel-levine.webp?w=790&f=a413b0dbc48473460c527547c15e17e4",
  "link": "https://www.newsweek.com/hhs-guidance-trans-pharmacology-raises-more-questions-it-answers-opinion-1707076",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2087,
    2153,
    196,
    3462,
    3463,
    3607,
    2945
  ],
  "sentences": [
    "It raised concerns over the manner the guidance was developed, noting its inadequate literature review, biased recommendations that do not acknowledge the low quality of evidence it relies upon, failure to consult a range of viewssuch as those for whom \"gender-affirming\" care was not beneficialand failure to identify or acknowledge alternative treatments.",
    "When announcing the new document, Assistant Secretary for Health Rachel Levine went so far as to state \"there is no argument among medical professionalspediatricians, pediatric endocrinologists, adolescent medicine physicians, adolescent psychiatrists, psychologists, etc.about the value and the importance of gender-affirming care.\"",
    "As a pharmacologist, pharmacist and research scientist who has dedicated his life to drug safety, drug development and evidence-based clinical and non-clinical science and medicine, I have some important questionsstarting with who the authors of this document are, and what academic credentials they have.",
    "It correctly concluded that, based on the lack of conclusive evidence and the potential for irreversible long-term effects, children and adolescents should not socially transition, be prescribed puberty blockers or cross-sex hormones or undergo surgical interventions.",
    "As a former senior executive FDA drug safety official, I have to wonder why my 20,000-plus former colleagues at the FDA are not speaking out after being circumvented on transgender clinical pharmacology recommendations by an obscure, obviously unqualified HHS office.",
    "In a May 2022 interview, FDA Commissioner Dr. Robert Califf stated that \"misinformation is the leading cause of death in the U.S.\" He failed to reference anything specific or mention that Biden's own federal government contributed to misinformation.",
    "Despite the HHS/OPA having its own, in-house Office of Research and Evaluation, its guidance ignored both clinical and scientific concepts and sought no comment or input from relevant federal agencies or NGOs, despite having easy access.",
    "The document fails to mention the potential short- or long-term risks of its pharmacological and non-pharmacological recommendations, or any shortcomings, disadvantages or alternatives to the various proposed treatments and procedures.",
    "While the document does include citations to specific studies, they only consist of psychology studiesno pharmacological, genetic, medical, surgical, gynecological, endocrinological or others were referenced in justifying its logic.",
    "My EPPC HHS Accountability Project colleague Rachel Morrison and I recently responded to a federal request for information on COVID-19 health misinformation by pointing out ways the federal government itself was culpable.",
    "To that end, should there be a waiting or evaluation period prior to a pharmacological or surgical intervention period, or should cliniciansas the document impliessimply proceed on an on-demand basis?",
    "HHS has a taxpayer-funded budget of over $1.5 trillion, yet has given taxpayers a demonstrably thoughtless list of propaganda, likely written by activists in a rush to promote transgender ideology.",
    "And even though it refers exclusively to psychological sources, it makes no recommendation for any psychological evaluation or criteria prior to patients' undergoing life-altering interventions.",
    "The document claims to outline an established standard of care on how to proceed with social, pharmacological and surgical \"affirmation\" of children and adolescents who identify as transgender.",
    "Dr. David Gortler is a pharmacologist, pharmacist and an FDA and health care policy oversight fellow and FDA reform advocate at the Ethics and Public Policy Center in Washington, DC.",
    "The HHS /OPA guidance document is only two pages long (including tables and references), but officials gave no indication that it is anything other than a final agency position.",
    "At first glance, the HHS/OPA document gives the impression that anyone and everyone should just start writing prescriptions and scheduling surgical procedures upon request.",
    "Last month, the Department of Health and Human Services Office of Population Affairs (HHS/OPA) issued a \"guidance document\" called Gender Affirming Care in Young People.",
    "According to its mission statement, HHS/OPA focuses on family planning, teen pregnancy and adoption, so why is it even commenting on gender transition treatments?",
    "Were existing FDA- and non-FDA drug safety databases reviewed to assess risk to gender-appropriate and gender-incongruent application and administration?",
    "In response to HHS's document, Ron DeSantis' Florida Department of Health issued guidance of its own clarifying the \"evidence\" HHS/OPA cited.",
    "Levine's extreme statement was rightly rebuked by physicians and members of Congress for not being appropriately based in evidence.",
    "It sounds like the federal government might need yet another request for comments on federal transgender misinformation.",
    "I'd be curious what published studies were the basis for the HHS/OPA recommendations regarding the use of those drugs.",
    "SEGM found the guidance contains \"a number of errors and misrepresentations\" and \"many highly inaccurate\" claims.",
    "Observant scientists and clinicians will notice the document is most remarkable for what it doesn't say.",
    "Puberty blockers and cross-sex hormones for gender transition are all off-label, non-FDA-approved use.",
    "He is also a columnist at Forbes, where he writes on drug safety, healthcare politics, and FDA policy.",
    "The federal government seems hyper-focused on \"misinformation\" in health care and other policy areas.",
    "Indeed, the federal government as a whole ignores its own role as a purveyor of misinformation.",
    "Anyone looking for answers in the HHS document will come up short on these important questions.",
    "Likewise, the Society for Evidence Based Gender Medicine (SEGM) fact-checked HHS' document.",
    "HHS/OPA's transgender \"guidance document\" ought to be placed at the top of that list.",
    "More importantly, was anyone from the FDA even consulted, and if not, why not?",
    "It represents a \"feeling\" without any of the evidence-based justification.",
    "The views expressed in this article are the writer's own."
  ]
}