{
  "id": 3465,
  "mediaId": 195,
  "date": "d2022-05-19T00:00",
  "headline": "Disney renames annual Rainbow Disney clothing line to Disney Pride collection",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/CA_disneydontsaygay_032222_ap.jpg?w=1440&h=880&crop=1",
  "link": "https://thehill.com/changing-america/respect/equality/3494590-disney-renames-annual-rainbow-disney-clothing-line-to-disney-pride-collection/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1241,
    4207,
    524,
    3202,
    3228,
    3230,
    3490,
    3578,
    2661
  ],
  "sentences": [
    "We stand in solidarity with our LGBTQIA+ community everywhere.?\nAccording to the company, all profits from its Pride collection this year will be donated to support LGBTQIA+ youth and families.? Organizations including the Gay, Lesbian and Straight Education Network (GLSEN) and The Trevor Project are slated to receive profits from sales made through June 30.\nHonoring Pride is a long-standing tradition of The Walt Disney Company, and I am incredibly proud to work for a company that supports inclusion as a core value and provides a welcoming environment which allows me to bring my true authentic self to work,? Lisa Becket, senior vice president of global marketing for Disney Parks, wrote this week in a blog post.",
    "But earlier this year, employees of Pixar Animation Studios  purchased by Disney in 2006  issued a statement that casts doubt on whether the companys recognition of Pride can be accurately characterized as a longstanding tradition.?\nFirst published by Variety in March, the undated message signed by the LGBTQIA+ employees of Pixar and their allies? accused Disney and its chief executive Bob Chapek of censoring LGBTQ+ content in Pixar films and silencing queer voices within the company, while still profiting from events like Pride.",
    "Chapek in a company-wide email wrote that he was reluctant to come out publicly against the Florida bill because corporate statements do very little to change outcomes or minds? and are often weaponized by one side or the other to further divide and inflame.?\nThe Disney CEO later said he opposed the measure, but his statement came just a day after the bill had been approved by the state legislature.",
    "Its the first of the companys collections to be branded as such after years of the murkier Rainbow Disney Collection.?\nThe Disney Pride Collection was created by LGBTQIA+ employees and allies at The Walt Disney Company and is a reflection of their incredible contributions and place at the heart of the company,? Disney wrote in a brief statement on the collections site.",
    "To this end, it feels terrible to be a part of a company that makes money from Pride merch when it chooses to step back in times of our greatest need, when our rights are at risk,? Pixar employees wrote in the March statement, written in response to the companys then-silence on Floridas Parental Rights in Education bill  better known as the Dont Say Gay? bill.",
    "Story at a glance\nThe Walt Disney Company this week announced the launch of its 2022 Disney Pride Collection,? a shift from previous years when the company referred to the annual collection as the Rainbow Disney Collection.?\nAll profits from the collection will be donated to LGBTQ+ advocacy groups, according to Disney.",
    "Disney began capitalizing on Pride in 2018 with The Rainbow Mickey Collection, (while de-emphasizing the terms like LGBTQ+ and not even featuring explicitly LGBTQIA+ pieces such as Pride flag pins until 2021),? employees wrote in the statement.",
    "Employees also cited a park policy that had barred same-sex couples from dancing together at the Happiest Place on Earth? for nearly three decades until it was quietly reversed by administrators in 1985.",
    "A pledge by Chapek to donate $5 million to the Human Rights Campaign was rejected by the organization, which said more meaningful action? must be taken by the company against anti-LGBTQ+ legislation.",
    "Five years earlier, two male teenagers were evicted from Disneyland in Anaheim, Calif., for dancing together, prompting a 1984 ruling from a judge that the park had violated their civil rights.",
    "As a member of the LGBTQIA+ community and a longstanding Disney cast member  I greatly appreciate the consistent opportunity for my voice to be heard.?\nAmerica is changing faster than ever!",
    "Public school educators through high school are barred from addressing either topic in a manner that is not age-appropriate or developmentally appropriate? for their students.",
    "Ron DeSantis (R), primary school teachers in Florida are prohibited from engaging in classroom instruction related to sexual orientation or gender identity.",
    "The announcement comes after months of tension between the company and its employees over its lukewarm response to Floridas Dont Say Gay? law.",
    "The Walt Disney Company this week announced the launch of its 2022 Disney Pride Collection? in celebration of LGBTQ+ Pride Month in June.",
    "Add Changing America to your Facebook or Twitter feed to stay on top of the news.",
    "Disney Parks did not officially host a Pride parade until 2019, in Paris alone.",
    "Under the measure, which was signed into law in March by Florida Gov."
  ]
}