{
  "id": 3466,
  "mediaId": 151,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Tech companies removed the Buffalo shooting manifesto. A Texas law could make that illegal.",
  "image": "https://www.politico.com/dims4/default/531a6b0/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Ffc%2Fb9%2Fc815d6f74d079ad27555a959c289%2Fap22134754049948.jpg",
  "link": "https://www.politico.com/news/2022/05/18/censorship-buffalo-manifesto-texas-law-00033228",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    800,
    2517,
    3788,
    4817,
    236,
    482,
    539,
    2934,
    4938
  ],
  "sentences": [
    "Meanwhile, Twitters own anti-hate efforts face an uncertain future under the companys planned purchase by Elon Musk, who has called himself a free-speech absolutist? and said he opposes censorship that goes far beyond the law.?\nMusk has said he would still take down content thats illegal or incites violence, and the Texas law includes exceptions for unlawful expression? and specific threats of violence? against people based on factors like race, religion or national origin.",
    "We have too many lessons in the past we can look to to determine it is not healthy for communities, it is not safe it is not safe for individuals.?\nThe office of Republican Texas Attorney General Ken Paxton didnt respond to requests for comment about how tech companies removal of the Buffalo suspects manifesto  along with a livestream of the shooting  would be litigated under HB 20.",
    "Exactly what we talked about is exactly what were seeing right now.?\nThe mass shooting is a tragic reason why tech companies need robust moderation policies  to ensure that content like this gets as little dissemination as possible,? said Matthew Schruers, president of the Computer and Communications Industry Association, which joined NetChoices appeal.",
    "| Derek Gee/The Buffalo News via AP\nBy Rebecca Kern\n 05/18/2022 06:26 PM EDT\nA Texas law under review by the Supreme Court could make it harder for tech companies to remove many kinds of violent, hate-filled content from their sites  including a racist manifesto linked to the suspect of last weekends mass shooting in Buffalo, N.Y.",
    "The major platforms signed onto the Christchurch Call? after the incident, pledging to eliminate terrorist and violent extremst content online.? Its implemented by the Global Internet Forum to Counter Terrorism, which is funded by its founding members Facebook, Microsoft, Twitter and YouTube to fight online extremism.",
    "But companies including Facebook, Google and Twitter have used their hate policies to take down content that doesnt clearly violate any U.S. laws, such as insults aimed at Black Americans, immigrants, Muslims, Jews or transgender people  and now, those efforts could become legally perilous.",
    "He said the manifesto is absolutely? covered under the law, known as HB 20.\nThe manifesto is written speech and even though it is vile, extremist and disgusting speech it is nevertheless a viewpoint that HB 20 now protects,? said Marchese, the counsel at the industry group NetChoice.",
    "Facebook, Twitter and the Amazon-owned streaming platform Twitch may have even violated the Texas law when they took down the white supremacist manifesto that the Buffalo shooting suspect is believed to have posted online, tech industry lawyer Chris Marchese said in an interview.",
    "Before passing HB 20, Texas lawmakers voted down a Democratic amendment that would have allowed removal of material that directly or indirectly promotes or supports? international or domestic terrorism, which could have applied to the Buffalo manifesto and livestream.",
    "The statute, which makes it illegal for large social media platforms to censor? users or their posts based on viewpoint,? is among a growing set of barriers facing companies such as Facebook, Google and YouTube as they try to police problematic messages.",
    "It only matters what a whole bunch of different local judges in Texas think.?\nUnder the law, social media platforms with 50 million or more active monthly users could face fines of $25,000 for each day they impede certain viewpoints protected by the law.",
    "Even with that pact and the companies content moderation policies in place, extremist videos still slip through, including a link to the Buffalo shooting suspects livestream shared on Facebook and clips of the video that surfaced on Twitter.",
    "Jonathan Greenblatt, the CEO of the Anti-Defamation League, said social media platforms have a responsibility to quickly remove racist, white supremacist and antisemitic speech that starts on their sites and can lead to off-line violence.",
    "At the very least, the Texas law means that users will be able to sue platforms that try to block the spread of what the companies consider harmful messages  leaving it for a judge to decide whose interpretation of the statute is correct.",
    "Social media companies have spent years adjusting their approaches to hate speech and violence after past violent mass shootings, including a pair of attacks at two mosques in Christchurch, New Zealand, that left 51 people dead in 2019.",
    "Paxton and other supporters of the Texas law argue its intended to protect individuals ability to express their political viewpoints  particularly for conservatives who allege that large tech companies have censored them.",
    "The group, which represents companies like Facebook, Google and Twitter, filed an emergency appeal Friday to Supreme Court Justice Samuel Alito seeking to block the Texas law, with a ruling expected as early as this week.",
    "Texas Democratic state Rep. Jon Rosenthal, who introduced the amendment, said Wednesday that the Buffalo shooting shows the need for such a provision, while faulting Republicans for blocking the measure.",
    "Minority communities in particular would suffer if online companies water down their content moderation policies or readmit people they have banned, NAACP President Derrick Johnson said in an interview.",
    "It kind of doesnt matter what any of us think of what counts as viewpoint or doesnt,? said Daphne Keller, director of the Program on Platform Regulation at Stanford Universitys Cyber Policy Center.",
    "Attempts to contact Musk were also unsuccessful, even as he began to take flack for failing to comment publicly about the Buffalo shooting or social medias role in the attack.",
    "So if youre a rational platform trying to avoid defending an action, youre not going to take [a post] down, or youre going to be much more hesitant to take it down,? he said.",
    "Fear of lawsuits, he said, means that platforms would err on the side of leaving up content even if it might violate their own policies against hate speech or terrorism.",
    "Those include former President Donald Trump, who was banned by the major social media platforms after a throng of his supporters attacked the Capitol on Jan 6, 2021.",
    "Youre suddenly increasing the risk of lawsuits dramatically, and thats the real problem with the law,? said Jeff Kosseff, a cybersecurity law professor at the U.S.",
    "Civil rights groups say the online companies need to do much more to scrub hate from their platforms  citing Buffalo as an example of the consequences of failure.",
    "Civil rights groups say the online companies need to do much more to scrub hate from their platforms  citing Buffalo as an example of the consequences of failure.",
    "It starts with crazy conspiracy theories about the great replacement and it leads to 11 people being massacred in the synagogue in Pittsburgh,? Greenblatt said.",
    "We cannot as a society allow for social media platforms  or broadcast or cable news  to be used as tools to further tribalism, diminishing democracy,? he said.",
    "(Other Republican-controlled state legislatures have also introduced bills to prohibit alleged viewpoint censorship, including Michigan and Georgia.)",
    "The gunman in both attacks  who identified with white supremacist ideologies  livestreamed one shooting on Facebook and posted his manifesto online.",
    "A federal appeals court last week allowed the Texas law to take effect immediately, even before judges finish weighing the merits of the statute.",
    "Its very alarming what folks are willing to do to line up with their party instead of whats right and just,? he told reporters on a press call.",
    "Ron DeSantis that has been blocked by a federal judge  ties hands of digital services and puts Americans at greater risk,? Schruers said.",
    "The Supreme Court may rule this week on a tech industry request to block the Texas law from taking effect.",
    "The Texas law  and a similar Florida law, SB 7072, championed by Republican Gov.",
    "That is what happened leading up to World War II and Nazi Germany.",
    "Both platforms removed the content after POLITICO notified them.",
    "Naval Academy who has written two books about online speech.",
    "Theres a straight line from Pittsburgh to Buffalo.",
    "And right now were seeing the effects of that.",
    "Theyre all actually very related.?",
    "These things are not unrelated.",
    "..."
  ]
}