{
  "id": 3468,
  "mediaId": 151,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Bidens Cuba and Venezuela policy shifts leave Florida Democrats dismayed",
  "image": "https://www.politico.com/dims4/default/084ea3e/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F10%2Fea%2F0881d8244a609a8ba5f3e7463121%2Fbiden-06809.jpg",
  "link": "https://www.politico.com/news/2022/05/18/bidens-cuba-and-venezuela-policy-shifts-leave-florida-democrats-in-a-bind-00033379",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "The administration on Tuesday said it would ease sanctions on Venezuelan President Nicols Maduros government if he commits to talks with U.S.-backed opposition leader Juan Guaid, who is recognized as the countrys leader by nearly 60 nations, including the U.S.\nTaddeo, in an interview, said she supports Biden reinstating the family reunification program, a long-time campaign promise, but has major issues with the U.S. relaxing restrictions on sending money to the island given the Cuban governments involvement in banking and investment.",
    "What he didnt have to deal with is a small, but loud chorus of people waxing on about European socialism or screaming to defund the police.?\nSchales super PAC, Unite the Country, did mail pieces during the 2020 Democratic primary pushing back on language used by some progressives to advocate for policy changes like defunding? the police but hijacked by Republicans who have effectively used that message to brand all Democrats as extreme.",
    "Crist said it could be a game changer for freedom and democracy in Cuba,? while Fried said she supports the relentless pursuit of greater connectivity to, from and among the Cuban people.?\nSome Democrats note that Clinton won the Hispanic-rich regions of the state by wide margins in 2016 despite the fact that President Barack Obama loosened restrictions and became the first sitting U.S. president to visit the island since 1959.",
    "It might be that they are calculating that the national dynamics are guiding the 2022 elections and there will be little movement based on marginal changes that affect south Florida constituencies.?\nThe Cuba measures specifically include expanding flights, easing travel restrictions and lifting limits on sending remittances to people on the communist-run island.",
    "Floridas massive Hispanic population and long-standing role as one of the nations largest swing states have long given it a big voice in foreign policy, but the state continues to shift to the political right and national Democrats no longer see it as essential to winning the White House.",
    "Cuban-born Florida International University professor Guillermo Grenier, who conducts the states highly watched Cuba poll, called the two administration decisions marginal changes,? and said they might be a nod to the fact that 2022 is setting up to be a bad election cycle for Democrats.",
    "Rep. Val Demings (D-Fla.), who is running for Senate against Sen. Marco Rubio (R-Fla.) said she is encouraged? by policies to reunite families  the Biden administration on Monday announced plans to restart a Cuban family reunification program after bipartisan calls to do so.",
    "But she remains concerned about allowing U.S. investment in private companies based in Cuba, concern sparked by news that the U.S. Treasury Department last week allowed a company headed by the president of the U.S.-Cuba Trade and Economic Council to invest in a Cuban firm.",
    "On Venezuela, she said: To remove sanctions and allow oil companies to go in there, are we doing that with Russia next??\nAdministration officials have long emphasized that they will not shape their foreign policy based on what plays best politically in South Florida.",
    "And as you can imagine, there were people who dont live in Florida who didnt appreciate it.?\nIn 2020, Trump made inroads among Latinos across the country, but his most significant gains were in South Florida  not just among Republican-leaning Cuban Americans.",
    "Over a roughly 24-hour period, the administration announced Biden is expanding the number of flights to Cuba and ending restrictions on money that immigrants can send to people on the island, a vestige of Trumps hard-line Cuba policy.",
    "Its very clear they still dont have a political side in the Biden White House.?\nBidens 2020 underperformance in the state was most evident in Miami-Dade County, which has the highest concentration of Hispanic voters in the state.",
    "| Susan Walsh/AP Photo\nBy Sabrina Rodriguez and Matt Dixon\n 05/18/2022 04:45 PM EDT\nPresident Joe Biden hemorrhaged South Florida Hispanic voters in 2020  one reason he lost the state to Donald Trump during the last election.",
    "Allowing investments in the Cuban private sector and easing travel restrictions will only serve to fund the corrupt dictatorship,? Demings, who once was being considered as Bidens vice president, said in a statement.",
    "Two moves by President Joe Biden's administration this week  easing sanctions on Venezuela and loosening restrictions on Cuba  signal he's likely not interested in improving his standing with the key demographic.",
    "When it has made any changes  or even indicated a potential change  criticism has been swift and loud in South Florida, with Republicans taking to the airwaves and organizing events condemning the administration.",
    "The move now, in a midterm election where Democrats are likely to suffer losses anyway, could also be the equivalent of ripping off a political Band-Aid ahead of Bidens own reelection, Grenier said.",
    "Two moves by his administration this week  easing sanctions on Venezuela and loosening restrictions on Cuba  signal hes likely not interested in improving his standing with the key demographic.",
    "Obama ran on opening up travel to Cuba and easing restrictions on remittances,? said Steve Schale, a Democratic consultant who ran Obamas Florida campaign and runs a pro-Biden super PAC.",
    "Earlier this year, Republicans and top Democrats in the state piled on the administration over talks it held with Maduro to potentially ease sanctions on Venezuelan oil exports.",
    "The area is home to a huge concentration of Hispanic voters and Latin American exiles who fled leftist violence or dictatorships in Colombia, Cuba, Nicaragua and Venezuela.",
    "The Biden administration has largely steered clear of Cuba and Venezuela policy since the start of Bidens presidency, leaving largely intact Trumps hard-line policies.",
    "On Venezuela, the Biden administration has moved to ease some economic sanctions to encourage further discussions between Maduro and Venezuelas opposition government.",
    "The changes all come after a lengthy review of U.S.-Cuba policy that was largely started following the historic anti-government protests on the island last July.",
    "She added that she has seen no concessions from the Cuban government, as many participants from last years historic anti-government protests remain in prison.",
    "A few months earlier, Biden officials were dragged for their plan to remove Colombian rebel group FARC from a list of foreign terrorist organizations.",
    "I think that [Biden] and his advisers realize that the fate of the state does not hinge on isolated policy changes here or there,? he said via email.",
    "The changes will allow for U.S. oil company Chevron to begin talks with Venezuelas government over potentially restarting oil production.",
    "Venezuelan Americans, Nicaraguan Americans and Colombian Americans  all growing Hispanic groups in Miami  also shifted farther right.",
    "Obama, who won Florida twice with Biden on his ticket, campaigned on a platform that included further opening relations with Cuba.",
    "The administration is also increasing consular services and reestablishing a family reunification program suspended in 2017.",
    "And Im sure it will be used [against Democrats],? said state Sen. Annette Taddeo (D-Miami), who is running for governor.",
    "During the primary, my PAC sent mail that specifically called out revolution talk from the far left,? Schale said.",
    "He won the county by 7 percentage points, compared with Hillary Clintons 30-point margin over Trump in 2016.",
    "Ron DeSantis, Rep. Charlie Crist (D-Fla.) and Agriculture Commissioner Nikki Fried, supported Bidens moves.",
    "And Florida Democrats, already reeling from a tough electoral environment for the party, are disheartened.",
    "That has left Democrats in the state navigating the political radioactivity of the issue on their own.",
    "Already the Democratic Governors Association has signaled its holding off funding Florida Democrats.",
    "He might also think that acting now will give the waters time to settle by 2024,? he said.",
    "The top two Democratic contenders challenging Floridas Republican Gov.",
    "The White House did not respond to a request for comment.",
    "Plus, he [Biden] won the presidency without the state.?",
    "He also spoke to the immigrant experience.",
    "Its frustrating, no question."
  ]
}