{
  "id": 3481,
  "mediaId": 305,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Desantis Signs Bill Banning Protests Outside of Residences",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/b4c2a57a5db284849220aa559e8c2729.jpg",
  "link": "https://www.theroot.com/desantis-signs-bill-banning-protests-outside-of-residen-1848941783",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Murjani Rawls",
  "authorUrl": "https://www.theroot.com/author/murjanirawls",
  "termIds": [
    661,
    971,
    2305,
    43,
    482,
    2661,
    2945
  ],
  "sentences": [
    "Francesca Menes, a co-founder of the social justice organization The Black Collective, stated the new law builds on the unconstitutional foundations of the anti-protest bill last year and only reaffirms our will to make sure our voices are heard in order to create a brighter future for the people of our state.?",
    "This bill will provide protection to those living in residential communities and I am glad to sign it into law.?\nIronically, a party that is so beholden to the principle of free speech finds ways to silence the voices of others.",
    "Sending unruly mobs to private residences, like we have seen with the angry crowds in front of the homes of Supreme Court justices, is inappropriate,? DeSantis said in an email to news agencies.",
    "The move is in response to the many demonstrations happening outside of Supreme Court Judges homes in response to the leaked memo hinting that Roe v. Wade could be overturned this summer.",
    "Desantis signed the Combating Public Disorder Act? into law, creating several crimes connected to protests after the George Floyd demonstrations.",
    "The law would make it a second-degree misdemeanor to protest in a manner aimed at intentionally harassing or disturbing someone in their home.",
    "A judge halted enforcement of the law, calling it vague and overbroad? and an unconstitutional infringement on the First Amendment.",
    "Ron Desantis has signed a bill making any protest outside of a private residence illegal, according to the Associated Press.",
    "The composition of the bill also references protests outside the Florida homes of US Sens.",
    "Protesters can only be arrested after ignoring law enforcements orders to disperse.",
    "Marco Rubio and Rick Scott and the parents of murder suspect Brian Laundrie.",
    "Violators face 60 days in jail and fines of up to $500.",
    "Last year, Gov.",
    "Florida Gov."
  ]
}