{
  "id": 3482,
  "mediaId": 881,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "The conferences star attraction will be authoritarian Prime Minister Viktor Orbnthe type of leader former President Trump aspires to be.",
  "image": "https://video-images.vice.com/articles/6284b1ff43982900998a1d04/lede/1652882071536-gettyimages-1389259549.jpeg?crop=1xw:0.8423xh;0xw,0xh&resize=20:*",
  "link": "https://www.vice.com/en_us/article/88gzvb/cpac-hungary-orban",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Gilbert",
  "authorUrl": "https://www.vice.com/en/contributor/david-gilbert",
  "termIds": [
    661,
    683,
    905,
    1147,
    1839,
    2191,
    2213,
    2704,
    2945,
    4937
  ],
  "sentences": [
    "The conferences program shows exactly what topics are important to the Trump wing of the Republican Party, with sessions entitled: Western civilization under attack,? In God we trust,? The father is a man, the mother is a woman,? and Culture wars in the media.?\nFlying in from the U.S. will be Schlapp, former Sen. Rick Santorum, and the husband-and-wife team of right-wing personality Candace Owen and Parler CEO George Farmer.",
    "BUDAPEST, Hungary  Matt Schlapp, the head of the American Conservative Union and organizer of its influential conference series CPAC, told NPR this week that he was bringing his event to Hungary because it represents Christian conservative values? and American conservatives want to replicate this in the U.S. by learning from the countrys ultra-right-wing authoritarian prime minister, Viktor Orbn.",
    "CPACs decision to bring its conference to Hungary is seen as an ordination of sorts for Orbn within the conservative community, but the path to this moment has been paved by a laundry list of American right-wing figures including former Trump advisor Steve Bannon, professional troll Milo Yiannopolous, and talk radio host Dennis Prager, all of whom have spoken in Hungary in recent years.",
    "The decision by Schlapp and the ACU to sponsor an event in the home of one of the most draconian regimes in the Western world may seem shocking, but for anyone paying any attention to how the Republican Party has lurched to the right in recent years, it almost seems logical at this point.",
    "More recently, the great replacement? conspiracy Orbn espoused in 2019 has taken hold among U.S. conservatives, and this week the gunman who allegedly killed 10 people at a Buffalo supermarket claims the great replacement? conspiracy was one of his inspirations for conducting the attack.",
    "In the years since, he has continued to erode democratic values within the country, including a recent attack on LGBTQ and gender rightswith some measures related to the teaching of gender and sexuality in schools that closely echo the Dont Say Gay? bill recently passed in Florida.",
    "Orbns current narratives and messages practically coincide with those of the European new right movement and the American alt-right,? Bulcs Hunyadi, head of the Radicalization and Extremism Program at Hungarian think tank Political Capital, recently told Hatewatch.",
    "During the shows, Carlson spoke about Hungary, Orbn, and the policies of Fidesz in an entirely positive light, calling it a small country with a lot of lessons for the rest of us,? while glossing over the anti-democratic steps the authoritarian leader has taken.",
    "Back in 2015, Orbn made Soros the face of the immigration crisis in the country, a campaign that mirrors the antisemitic white nationalist great replacement? conspiracy theory that Jewish people are working to replace white people through migration.",
    "Trump said the pair had a lot in common, but the truth is that Trump can only dream about having the power and control over his country that Orbn, who recently won a fourth term in office, has carved out since taking power in 2010.",
    "Carlson, whose father, Richard Carlson, is listed as a director of a Washington-based firm that has lobbied on behalf of Orbn in the U.S., has twice flown to Hungary to present his show, including fawning interviews with Orbn.",
    "In a bid to stave off immigration and increase Hungarys non-immigrant population, he introduced huge tax incentives and a grant of $30,000twice the average Hungarian salaryfor families with three children to purchase a home.",
    "The ACUs decision to hold CPAC in Budapest will allow that alignment to continue, and allow American conservatives to learn from Orbn, who has created an anti-woke paradise that they see as a model for the American right.",
    "Within months of becoming prime minister, Orbn had taken control of the judiciary, attacked the few financial institutions not under the control of his far-right Fidesz Party, and clamped down on negative press coverage.",
    "There will also be appearances by a host of European populist leaders, including representatives from Spains far-right Vox party, Frances pro-Kremlin National Rally party, and Austrias anti-immigration Freedom Party.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "But perhaps that model is already being recreated in the U.S.\nConservative commentator Rod Dreher, who admired Orbn so much he moved to Budapest last year, wrote last month about the idea that GOP Gov.",
    "Schlapp says U.S. conservatives want to replicate what Orbn is doing in Hungary, but there are signs the Hungarian leader is already influencing U.S. politics in generaland Trump in particular.",
    "But it has been Carlson, the host of Fox News highest-rated show, who has done more than anyone to lionize Orbans leadership style and raise Hungarys profile among his 3.2 million viewers.",
    "This is the third time CPAC has been held overseas: In recent years, as ACU has tried to create a global network of like-minded conservatives, its also been held in Japan and Brazil.",
    "But despite these efforts, Hungarys population is still falling, partly due to mass emigration by hundreds of thousands of Hungarians who left as a result of Orbns undemocratic rule.",
    "During his 2016 presidential campaign, Trump ran on anti-immigrant platform promising to ban Muslims from the country and build a wall along the U.S.-Mexico border.",
    "Orbns promotion of family values goes hand-in-hand with his attacks on migrants, and unlike some European leaders, he has not attempted to couch his racist views.",
    "There will be video messages from some bigger names, notably Fox News host Tucker Carlson and former President Donald Trumps former chief of staff, Mark Meadows.",
    "The two-day event in Hungary was initially due to take place in 2020 but was postponed twice, first due to COVID-19 and then to Russias invasion of Ukraine.",
    "There is also an antisemitic streak to his immigration policy that is symbolized by Orbns demonization of Hungarian philanthropist billionaire George Soros.",
    "Trump also demonized Soros during his campaign, going so far as releasing an anti-Soros campaign ad that was criticized as antisemitic.",
    "In 2021, former Vice President Mike Pence spoke at a meeting on family and demographic decline, with Orbn in the audience.",
    "We do not want our own color, traditions, and national culture to be mixed with those of others,? he said in 2018.",
    "In 2020, former U.S. Attorney General Jeff Sessions traveled to Budapest for a panel discussion on immigration.",
    "Ron DeSantis was creating a sort of conservative utopia along the lines of Orbns Hungary in the Sunshine State.",
    "Trump even told him so, repeatedly praising the strongman leader during a White House visit in 2019.",
    "Central to everything Orbn does is the promotion of traditional family and Christian values.",
    "He also rewrote election laws to allow him to stay in power for as long as he wants.",
    "Those willing to have four children never have to pay income tax again.",
    "So what exactly will attendees be learning in Budapest this week?",
    "Maybe Florida is becoming our American Hungary,? Dreher said.",
    "Want the best of VICE News straight to your inbox?",
    "Orbn is the type of leader Trump aspires to be.",
    "But the star attraction is Orbn.",
    "Sign up here."
  ]
}