{
  "id": 3483,
  "mediaId": 238,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "The Orbanization of America: Florida shadows Hungarys war on LGBTQ rights",
  "image": "",
  "link": "https://www.washingtonpost.com/world/2022/05/18/cpac-hungary-lgbtq-orban-florida-desantis/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ishaan Tharoor",
  "authorUrl": "https://www.washingtonpost.com/people/ishaan-tharoor/",
  "termIds": [
    661,
    2191,
    3711,
    4541,
    524,
    2661,
    2704,
    4937
  ],
  "sentences": [
    "DeSantis, who has built a profile as a pugilistic culture warrior with eyes on the presidency, has steadily put together a policy agenda with strong echoes of Orbans governing ethos  one in which an allegedly existential cultural threat from the left justifies aggressive uses of state power against the rights enemies,? Beauchamp wrote.",
    "At an April panel in Budapest, Dreher suggested the Florida bill was modeled in part on what Hungary did last summer.? To justify placing ideological controls on education, the Florida laws proponents have, like Orban and his allies, conjured a world where pedophiliac groomers? are waiting to prey on schoolchildren.",
    "But Orban has cast himself as the preeminent champion of family values? in Europe, standing athwart a tide of modern liberalism that, in his rhetoric, has undermined the traditional family and led to his own country posting one of the lowest fertility rates in Europe when he took power.",
    "His state government passed a second law, punishing Disneys executives for speaking out by moving to dissolve the special jurisdiction that allowed the company to maintain its own regulatory and tax provisions in the vast chunk of central Florida where it operates Disney World.",
    "The attacks on Disney may be the blunt edge of a backlash; the sharper edge can be seen in new laws pushed by Republican state legislatures that, as in the case of another bill signed by DeSantis, seek to police speech in public schools and workplaces around gender and race.",
    "In Hungary, migrants have been vilified as a perceived external demon, while LGBT people have been cast as both an internal threat and a foreign influence.?\nHungary is not alone in curtailing protections for the LGBTQ community, especially in the former communist world.",
    "Many Republican politicians declare explicitly that they are in a fight against a tyrannical liberal orthodoxy that dominates U.S. culture, an all-pervasive establishment buttressed by the education system, traditional media outlets and complicit corporate behemoths.",
    "The erosion of the nuclear family, marked by declining marriage rates, rising divorce, widespread abortion and plummeting birthrates.? (Pence predicted accurately then that the U.S. Supreme Courts right-wing majority would soon work to unwind abortion protections.)",
    "As Beauchamp noted, this approach is far more extensive in Hungary under Orban, who has used the power of the state to deprive a critical business leader of contracts and built a system where it behooves major commercial interests to toe the ruling partys line.",
    "These include exemptions from income tax for mothers with three children, generous loans for married couples willing to have children immediately and a nationalized in vitro fertilization program from women under 40 (though lesbians need not apply).",
    "In his telling, thats like the Hungarian capital, which has turned into a popular convening ground for right-wing pundits and intellectuals, and is set to host an overseas edition of the U.S.-based Conservative Political Action Conference this week.",
    "Dreher is a senior editor at the American Conservative and an outspoken admirer of Hungarian Prime Minister Viktor Orban  so much so that he took up residence in Budapest and insinuated himself among the citys pro-government intelligentsia.",
    "This dangerous world of nationalist rhetoric produces insiders and outsiders, shoring up support by concocting imagined threats to the nation,? wrote Graeme Reid, director of Human Rights Watchs LGBT rights program, last year.",
    "Maybe Florida is becoming our American Hungary,? conservative commentator Rod Dreher mused last month, in a column that praised Hungary for paving the way for U.S. conservatives looking to crack down on LGBTQ rights.",
    "This law puts homosexuality and gender reassignment on a par with pornography,? European Commission President Ursula Von der Leyen told member of the European Parliament last year after the laws passage.",
    "Orban presides over what he declares is a Christian democracy,? an illiberal state where traditional? values hold sway and liberal adversaries have been sidelined or frozen out of key institutions.",
    "Ron DeSantis (R)  is attracting influential American conservatives who are eager to take up residence in a state being steadily reshaped by one of the countrys most ambitious elected politicians.",
    "Orban, who has remained in power since 2010 and recently won reelection, is adored by American conservatives as a leader who has achieved both political and cultural victories in his country.",
    "Its tools for doing so are gender ideology and the LGBTQ lobby, which are attacking our children.?\nHis claims were echoed by former vice president Mike Pence, one of the conferences speakers.",
    "A Florida state bill that DeSantis signed in March, dubbed by critics as the Dont Say Gay? law, bans instruction or classroom discussion about LGBTQ issues for children up until third grade.",
    "In 2020, he banned adoption by same-sex couples  which has been legal in all U.S. states since 2017  and made it impossible for transgender people to legally change their gender.",
    "Opponents fear its vague language will open the door to a thicket of lawsuits from parents over any discussion of sex and gender and will have a chilling effect in schools.",
    "This law uses the protection of children, to which we are all committed, as an excuse to severely discriminate against people because of their sexual orientation.",
    "One of the leading factors behind Hungarys demographic decline is mass emigration of hundreds of thousands of Hungarians during the past decade of Orbans rule.",
    "When criticized by influential players  most notably Disney, among Floridas largest private employers  DeSantis wheeled down the path of confrontation.",
    "The legislation triggered a firestorm of criticism elsewhere in the European Union and plunged Hungary into a slow-rolling clash with its E.U.",
    "Hungary must defend itself because the Western left wing is attacking,? Orban said at a summit on demography in Budapest last September.",
    "Sign up to get the rest, including news from around the globe, interesting ideas, and opinions to know sent to your inbox every weekday.",
    "Last year, his government passed a law that prohibited sharing content with minors seen as promoting homosexuality or sex reassignment.",
    "It also contained provisions restricting education on homosexuality and establishing a searchable registry of convicted pedophiles.",
    "Yet, no matter a decade of Orbans efforts, Hungarys fertility rate is still below the level needed to keep its population constant.",
    "We see a crisis that brings us here today, a crisis that strikes at the very heart of civilization,? Pence told the gathering.",
    "Orban is spending about 5 percent of Hungarys gross domestic product on programs incentivizing families to have children.",
    "For Orban, the strategy is ultimately about political consolidation and the activation of a committed right-wing base.",
    "But the Florida governor declared he was striking a blow against woke gender ideology.?\nOrban went further, and first.",
    "This is the second installment of a three-part series on the shadow cast by Hungarys leader over U.S. politics.",
    "This law is disgraceful.?\nYet it seems to have, at least indirectly, inspired legislators in Florida.",
    "U.S. right-wingers cheer Orbans policies to boost birthrates while stymying immigration.",
    "A U.N. survey estimated the countrys population could dip below 9 million by 2035.",
    "World\nYoure reading an excerpt from the Todays WorldView newsletter.",
    "It is trying to relativize the notion of family.",
    "According to Dreher, Florida  under Gov.",
    "The convergence goes far deeper.",
    "partners to the West.",
    "Read part one here."
  ]
}