{
  "id": 3493,
  "mediaId": 129,
  "date": "5/18/2022 12:00:00 AM",
  "headline": "Americas Doug Mastriano Problem",
  "image": "https://static01.nyt.com/images/2022/05/18/opinion/18douthat1/18douthat1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/05/18/opinion/doug-mastriano-republicans-constitution.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    1164,
    1990,
    2095,
    2266,
    2303,
    3102,
    3902,
    4253,
    146,
    428,
    2945
  ],
  "sentences": [
    "But throughout the whole Trumpian experience, the Democratic Party has consistently failed its own tests of responsibility: It has talked constantly about the threat to democracy while moving leftward to a degree that makes it difficult to impossible to hold the center, and it has repeatedly cheered on unfit Republican candidates on the theory that they will be easier to beat.",
    "This happened conspicuously with Trump himself, and more unforgivably it happened again with Mastriano: Pennsylvania Democrats sent out mailers boosting his candidacy and ran a big ad buy, more than twice Mastrianos own TV spending, calling him one of Donald Trumps strongest supporters?  an attack? line perfectly scripted to improve his primary support.",
    "But if you have neither unity nor a figure with statewide prominence or incumbency as your champion  no Kemp, no Little  then you can get results like Mastrianos victory last night in Pennsylvania: a Republican nominee for governor who cannot be trusted to carry out his constitutional duties should the presidential election be close in 2024.",
    "The Pennsylvania Senate race gave us an especially vivid mix: As of this writing, the Celebrity Doctor and the Hedge Fund Guy Pretending to Be a MAGA True Believer may be headed for a recount, after the Would-Be Media Personality With the Inspiring Back Story and the Unfortunate Twitter Feed faded back into the pack.",
    "On substance, as opposed to personality, though, the nights stakes were relatively simple: Can Republicans prevent their party from becoming the party of constitutional crisis, with leaders tacitly committed to turning the next close presidential election into a legal-judicial-political train wreck?",
    "Essentially it involves leaning into culture-war controversy and rhetorical pugilism to a degree that provokes constant liberal outrage and using that outrage to reassure populist voters that youre on their side and they dont need to throw you over for a conspiracy theorist or Jan. 6 marcher.",
    "This was arguably the path of New Deal liberalism in its relationship to Depression-era populism and radicalism: In the 1930s, Franklin Roosevelt was able to sustain support from voters who were also drawn to more demagogic characters, from Huey Long to Charles Coughlin.",
    "If the Ohio Senate primary two weeks ago provided some clarity about the ideological divisions in the Republican Party, yesterdays primaries often seemed more like a showcase for the distinctive personalities that populate a Trumpified G.O.P.",
    "The Cawthorn race, in which the toxic congressman was unseated by a member of the North Carolina State Senate, shows that this figure doesnt have to be an incumbent to succeed, especially if other statewide leaders provide unified support.",
    "This was the destiny, for instance, of William Jennings Bryans 1890s prairie-populist rebellion, which took over the Democratic Party but went down to multiple presidential defeats at the hands of the more establishmentarian Republicans.",
    "In the alternative path to stability, the party being reshaped by populism finds leaders who can absorb its energies, channel its grievances and claim its mantle  but also defeat or suppress its most extreme manifestations.",
    "But the Democrats havent cooperated: They conspicuously failed to contain and defeat Trumpism in 2016, and there is no sign that the Biden-era variation on the party is equipped to hold on to the majority it won in 2020.",
    "You can see a similar pattern, for now, in French politics, where the populism of Marine Le Pen keeps getting isolated and defeated by the widely disliked but grudgingly tolerated centrism of Emmanuel Macron.",
    "Whenever a destabilizing populist rebellion is unleashed inside a democratic polity, there are generally two ways to bring back stability without some kind of crisis or rupture in the system.",
    "In Tuesdays primaries it worked for Idahos conservative incumbent governor, Brad Little, who easily defeated his own lieutenant governors much-further-right campaign.",
    "Unfortunately this model works best when you have a trusted figure, a known quantity, delivering the Ill be your warrior, Ill defeat the left? message.",
    "Two generations later, it was the path of Reaganite conservatism in its relationship to both George Wallaces populism and the Goldwaterite New Right.",
    "Part of the Never Trump movement has aspired to a Macron-style strategy, preaching establishment unity behind the Democratic Party.",
    "In North Carolina, they ended  for now  the political career of Representative Madison Cawthorn, the Obviously Suffering Grifter.",
    "Meanwhile, the Republican Party at the moment does have a provisional model for channeling but also restraining populism.",
    "Next week the same approach seems likely to help Brian Kemp defeat David Perdue for the governors nomination in Georgia.",
    "And it offers the partys only chance, most likely via a DeSantis candidacy, to defeat Donald Trump in 2024.",
    "Sometimes the revolt can be quarantined within a minority coalition and defeated by a majority.",
    "The problem for America today is that neither stabilizing strategy is going particularly well.",
    "This is the model, in different styles and contexts, of Glenn Youngkin and Ron DeSantis.",
    "In the governors race, Republican voters chose to nominate Doug Mastriano, a.k.a.",
    "Mastriano certainly deserves to lose the general election, and probably he will.",
    "Well see if they can make the story end differently this time.",
    "This is a distinctive version of a familiar political problem.",
    "So now the obligation returns to the Democrats.",
    "Now they have him, as they had Trump in 2016.",
    "the QAnon Dad."
  ]
}