{
  "id": 3495,
  "mediaId": 136,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Florida Student Fighting 'Don't Say Gay' Law Can't Run for Class President",
  "image": "https://d.newsweek.com/en/full/2039729/florida-student-fighting-dont-say-gay-bill.webp?w=790&f=3361dec82427921a3561b1317995ff45",
  "link": "https://www.newsweek.com/florida-student-fighting-dont-say-gay-law-cant-run-class-president-1707607",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fatma Khaled",
  "authorUrl": "https://www.newsweek.com/authors/fatma-khaled",
  "termIds": [
    661
  ],
  "sentences": [
    "The Florida high school student on Tuesday also continued to defend his stance against the bill and said that the protests organized at his school in March saw \"more than 500 students gathered to call on Florida lawmakers to stop policing our education for political gain.\"",
    "He said that the decision followed his school suspension that came after organizing a mass protest against the state's Parental Rights in Education law, dubbed as the \"Don't Say Gay\" law that was signed into law by Governor Ron DeSantis in late March.",
    "Florida high school student Jack Petocz said on Tuesday that he currently can't run for class president after leading walkouts opposing anti-LGBTQ rights legislation in the state, which led to his brief suspension in March.",
    "\"I had personally purchased more than 300 of the [pride] flags to distribute and was told they weren't allowed and were merely a 'political statement,'\" he said as he recounted the incident at the time.",
    "\"I encouraged my fellow students not to give in to the school's unconstitutional seizure of our pride flags, but instead to continue demonstrating our pride in a peaceful manner,\" he said at the time.",
    "Petocz said in a statement on Twitter that Flagler Palm Coast High School issued a disciplinary action against him which he said would prevent him \"from running for senior class president.\"",
    "Newsweek has not been able to independently verify whether the school's disciplinary action, barring Petocz's from running for class president, is linked to his planned walkouts in March.",
    "He urged supporters to send an email to the superintendent and administrators of Flagler County Public Schools \"requesting they take the disciplinary infraction\" off of his record.",
    "pic.twitter.com/5lG6EYIXo2\n Jack Petocz (@Jack_Petocz) May 17, 2022\n\"When I returned, the administration assured me that no further disciplinary action would be taken.",
    "Now, due to this high level of discipline, I am being prevented from running for senior class president,\" he said in the statement on Tuesday.",
    "Petocz also called for support \"in calling on these administrators to stop silencing queer students fighting for a more inclusive future.\"",
    "The legislation bans teachers in Florida from discussing topics related to sexual identity and sexual orientation in certain grade levels.",
    "The teen was suspended after the rally and was escorted off-campus, prompting an online petition calling for his suspension to be revoked.",
    "I am the high school junior who led walkouts in opposition to the Dont Say Gay? bill and was suspended for passing out pride flags.",
    "We will keep protesting, we will keep speaking, we will keep fighting until no child is subjected to this kind of abuse of power.",
    "In March, Petocz said that administrators were confiscating the students' pride flags and tried to remove them from campus.",
    "I've emailed [the] administration and the principal numerous times, they're simply ignoring me,\" he added.",
    "Queer and trans students are beautiful and loved no matter what the state has to say about it,\" he wrote.",
    "\"I am continuing to be punished for standing up for my identity and against widespread hatred.",
    "A month later, they broke this verbal agreement and placed a level 3 referral on my record.",
    "Newsweek reached out to Flagler Palm Coast High School and Jack Petocz for comments.",
    "\"I won't be discouraged by this obvious attempt to silence our voices.",
    "The change.org petition gathered around 2,800 signatures by March 4.",
    "Now, Im being prevented from running for senior class president.",
    "No matter what, I wont stop fighting for my community.",
    "My name is Jack Petocz."
  ]
}