{
  "id": 3497,
  "mediaId": 136,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Republican Who Put Tent on Nancy Pelosi's Lawn Slams DeSantis Protest Law",
  "image": "https://d.newsweek.com/en/full/2039771/laura-loomer.webp?w=790&f=eceb35d9f1a9524744c30372a8116a23",
  "link": "https://www.newsweek.com/laura-loomer-ron-desantis-florida-residence-protest-law-1707579",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Staten",
  "authorUrl": "https://www.newsweek.com/authors/adam-staten",
  "termIds": [
    661
  ],
  "sentences": [
    "Loomer, in the post stating her opposition to the law, mentioned a 2019 protest at Nancy Pelosi's California residence, where Loomer reportedly jumped a fence and set up a tent on the yard, calling it \"one of my most effective protests.\"",
    "Laura Loomer, a far-right political activist who is running in a GOP primary for a U.S. House seat representing the state's 11th Congressional District, took to social media to slam the new law signed by Governor Ron DeSantis on Monday.",
    "The law, which implements fines and possible jail time for those who picket outside a private residence in Florida, came after abortion-rights activists recently protested outside the homes of Supreme Court justices.",
    "The activists were demonstrating in connection to a leaked draft opinion from the Supreme Court showing enough support to overturn Roe v. Wade, the decision that legalized abortion across the country.",
    "Last year, Loomer drew headlines for interrupting a discussion that included Twitter CEO Jack Dorsey at the Bitcoin 2021 conference to accuse him of meddling in the 2020 presidential election.",
    "In a response to Newsweek, the governor's press secretary stated that Florida citizens \"are free to exercise their First Amendment rights to protest and to make their voices heard.",
    "During yesterday's bill signing, DeSantis said the law will protect people \"in residential communities\" and called those protesting in front of the justices' homes \"unruly mobs.\"",
    "Loomer wrote that during that particular protest, she \"claimed sanctuary on her [Pelosi's] lawn with illegal aliens to protest her refusal to fund the border wall.\"",
    "On Gettr, Loomer wrote that she's not supportive of the new law and referred to it as a \"violation of the First Amendment\" and stated that it is \"unconstitutional.\"",
    "\"Sending unruly mobs to private residences, like we have seen with the angry crowds in front of the homes of Supreme Court justices, is inappropriate.",
    "Loomer went on to say that \"as long as people aren't violent, peacefully protesting outside a politicians home on public property should be allowed.\"",
    "This bill will provide protection to those living in residential communities and I am glad to sign it into law,\" DeSantis said.",
    "One Republican congressional candidate in Florida is not on board with a newly signed law aimed at protesters in the state.",
    "But, intimidating anyoneincluding public officials and their familiesat home is not constitutionally protected speech.\"",
    "However, despite Loomer's assertion that the new Florida law violates free speech, DeSantis and his office disagree.",
    "The governor's office also pointed out that the bill was passed with bipartisan support.",
    "Newsweek reached out to the Loomer campaign for comment."
  ]
}