{
  "id": 3503,
  "mediaId": 302,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "When Floridas property insurers fail, few ask why",
  "image": "https://www.tampabay.com/resizer//w0gMBwVfst8KOEs2J_jKCCrb540=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/ANMWILGIKAI6TGNIIBWI6S7HAY.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/17/when-floridas-property-insurers-fail-few-ask-why/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nThose reports are required under a Florida law entitled prevention of insolvencies.?\nTo aid in the detection and prevention of insurer insolvencies or impairments,? the law states, the department must produce a report on the history and causes of such insolvency, including a statement of the business practices of such insurer which led to such insolvency.?\nPatronis spokesperson Devin Galetta did not answer when asked who sees the reports or where theyre sent.",
    "Sunshine States CEO and president received bonuses based on how much the insurer paid its sister company, which the report states may be an inherent conflict of interest in his fiduciary duties.?\nNine months before the company was liquidated, Sunshine States CEO was telling the sister companys board that he felt he deserved a $600,000 bonus for the amount of money the insurer paid.",
    "Having some creditable data from a governmental institution on why specific insurance companies failed would be a valuable resource for the Florida Legislature.?\nHe said his organization would advocate during next weeks legislative session to amend state law to require the reports be completed in a timely fashion and be presented to the Legislature annually.",
    "When Orlando-based St. Johns Insurance Co. went under this year, the Florida Insurance Guaranty Association levied a 1.3 percent assessment to pay off the companys outstanding claims  a fee that hits every policy sold in Florida, from homeowners insurance to flood and malpractice policies.",
    "Sen. Jim Boyd, R-Bradenton, an insurance agent who is expected to sponsor the legislation next week, said conducting more rigorous postmortems on failed insurers was a good idea, but he didnt think it would make it onto next weeks slate of bills.",
    "Brandes this year had an amendment to a bill that would have required the board of directors of an insurer to hold a public hearing within three months of the insolvency about what happened and give recommendations about how to prevent it.",
    "When asked about the existence of the financial autopsies? last year, state Insurance Consumer Advocate Tasha Carter said she wasnt aware of them, and her spokesperson did not answer questions last week about whether that had changed.",
    "An Office of Insurance Regulation spokesperson said the office receives them upon request.? (Galetta said the Department of Financial Services will begin posting the reports online before the special legislative session on Monday.)",
    "Floridians across the state are being squeezed by double-digit rate increases, canceled policies or requirements that they replace their roofs before signing up, something that can cost tens of thousands of dollars out of pocket.",
    "Earlier that year, it told regulators that it had discovered an accounting error that cost the company the ability to meet Floridas surplus requirements, according to a report at the time by Insurance Journal.",
    "People have no clue\nInsurance is one of the most complicated topics for state lawmakers, made no less simple by the insurance companies, trial lawyers and other powerful interest groups who lobby on the issue.",
    "Sunshine State had another agreement, also not approved by the Office of Insurance Regulation, with a sister company to pay markup fees? of more than $1.5 million between 2009 and 2014, the report states.",
    "That 73-page report found the companys demise was, in part, because it was sending millions of dollars in fees to its affiliated companies, which were not approved by the Office of Insurance Regulation.",
    "Unlike most states, Florida splits regulation between two entities, the Office of Insurance Regulation and the Department of Financial Services, and it appears that neither side is communicating well.",
    "In the 10 months before the company was liquidated, Sunshine State Insurance paid its parent company $708,830 in two separate corporate recharges? that were based on oral, not written, agreements.",
    "TALLAHASSEE  As state lawmakers meet next week to try to fix the spiraling property insurance market, they could draw on the lessons of the graveyard of insurers that have failed in recent years.",
    "Prevention of insolvencies\nThe Department of Financial Services, led by the states elected chief financial officer, Jimmy Patronis, does produce a report on each insurance company that fails.",
    "Last year, lawmakers at the request of the Office of Insurance Regulation passed a law that allowed the office to seek more information about insurers relationships with affiliated companies.",
    "Under Florida law, such payments were required to be written and pre-approved by the Office of Financial Regulation, but the companys executives never sought such approval, the report notes.",
    "That includes representatives from the Federal Association for Insurance Reform, a Fort Lauderdale-based advocacy group with trial lawyers, insurance companies and contractors on its board.",
    "Consultants hired by the state delved into the companys officers, finances, emails and board minutes  and allegations against the company brought by a whistleblower.",
    "After the smallest plane crash, the Federal Aviation Administration produces detailed reports about what went wrong and how it could have been prevented, he noted.",
    "Several others are struggling, with Sunrise-based FedNat Insurance Co. announcing last week that it was canceling 68,000 policies as part of a restructuring plan.",
    "Few people, including top lawmakers, trade groups and the states insurance consumer advocate, were aware of their existence before being contacted by a reporter.",
    "Insurers say the crisis is man-made, a result of a surge in litigation and rising rates of reinsurance, which companies purchase to pay out claims after storms.",
    "(The year before Sunshine State Insurance was liquidated, it and its parent company spent between $20,000 and $40,000 on lobbying in Tallahassee, records show.)",
    "And in 2013, the year before the company was liquidated, Sunshine State paid another sister company $13 million for fees, payroll and expense reimbursements.",
    "They found Sunshine State Insurances parent and sister companies were taking millions of dollars out of the company through written and verbal? agreements.",
    "The reports authors concluded that accounting errors and millions of dollars in unauthorized fees sunk the company, and it was insolvent as early as 2005.",
    "This whole thing is just a big, gigantic mess.?\nInsolvent insurers can cost Floridians regardless of whether they had a policy with the failed company.",
    "The oversight is another sign of dysfunction in Floridas handling of the states property insurance crisis, said Sen. Jeff Brandes, R-St. Petersburg.",
    "Since 2018, the last time a named hurricane hit Florida, seven property insurers have been declared insolvent  four of them in the last 13 months.",
    "The Times/Herald requested insolvency reports from the Department of Financial Services on five property insurers that have gone under since 2014.",
    "The department has finished only one report, on the 2014 failure of Jacksonville-based Sunshine State Insurance Company, according to Galetta.",
    "Ron DeSantis cited those insolvencies among the reasons why hes recalling lawmakers back to Tallahassee on Monday to address the crisis.",
    "At the least, the reports should be sent to other insurance companies, who would better understand their significance, Jenne said.",
    "The Legislature is constantly trying to improve the property insurance market,? said Paul Handerhan, the associations president.",
    "Sunshine State Insurance had about 37,000 policies when it was found insolvent by the Office of Insurance Regulation in 2014.",
    "He withdrew the amendment to work out some additional details but said recently that he plans on reintroducing it next week.",
    "People have no clue how much reconstructive surgery the insurance market needs,? Brandes said of Floridas insurance market.",
    "That and other lapses plague state oversight of the property insurance market as lawmakers prepare for a special session.",
    "Last year, the association levied a 0.7 percent assessment to cover claims for two other insolvent property insurers.",
    "Report found unauthorized payments\nThe financial autopsies arent usually released until years after a company fails.",
    "Only two lawmakers  Brandes and Rep. Evan Jenne, D-Dania Beach  have been sent the reports, according to Galetta.",
    "Multiple trade groups the Times/Herald spoke to also said they werent aware that Florida produces the reports.",
    "Floridas Department of Financial Services does a financial autopsy? on every insurance company that fails.",
    "Were like a race car driver of a state thats driving a 1979 Pinto and the engine is three squirrels.?",
    "Part of the problem is these companies fail and we dont learn anything from them,? Brandes said.",
    "I dont know why you wouldnt want to get that out to people as quickly as possible,? Jenne said.",
    "Brandes said the issue speaks to fundamental problems in how the state regulates insurance.",
    "The reports arent even automatically sent to the states Office of Insurance Regulation.",
    "Lawmakers have not yet released any proposed legislation for the upcoming session.",
    "None of the sister companies mentioned in the report are operating in Florida.",
    "But the property insurance company that has 100,000 policies that goes down?",
    "But once finished, the reports are effectively shoved in a drawer.",
    "If only they knew what those lessons were.",
    "He received a $200,000 bonus that year.",
    "Nothing,? he said.",
    "Gov."
  ]
}