{
  "id": 3508,
  "mediaId": 151,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Lee to jump into one of Florida's wild GOP primaries",
  "image": "https://static.politico.com/d3/05/ba68c9f5400bbef72003544b41ba/fineoutlogo.jpg",
  "link": "https://www.politico.com/newsletters/florida-playbook/2022/05/17/lee-to-jump-into-one-of-floridas-wild-gop-primaries-00032947",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Matthew Eby, executive director of the nonprofit climate research group, said its modeling shows Floridas current 6% of properties at risk from wildfires could jump to 12% by 2052.?\n Search for survivors suspended in Haitian migrant boat capsize near Puerto Rico that left 11 dead,? by Miami Heralds Syra Ortiz-Blanes\n Jury selection for Florida school killer enters 2nd phase,? by The Associated Press Terry Spencer\n Conspiracy to murder: Jury selection goes behind closed doors in Katherine Magbanua ritual,? by Tallahassee Democrats Jeff Burlew\n Trial in killing, dismemberment of Thundercats writer begins in Pasco County,? by Tampa Bay Times Anastasia Dawson\nODDS, ENDS AND FLORIDA MEN\n Passenger who landed plane says hand of God was with him,? by The Associated Press: A Florida man with no flying experience who kept his cool while landing a small plane says the hand of God was with him after the pilot collapsed at the controls.",
    "This bill will provide protection to those living in residential communities and I am glad to sign it into law. The Phoenix reported in October that at least five local school board members in the state had faced verbal abuse, vandalism, and other forms of intimidation amid the furor over whether to make public schoolchildren wear masks in the classroom to protect them against COVID-19.?\n DeSantis will support $125M for pandemic nursing shortage,? by POLITICOs Arek Sarkissian\n Florida death row inmates promised more humane treatment after lawsuit settlement,? by Tampa Bay Times Dan Sullivan\n DeSantis administration points to Texas case in fight over Florida social media law,? by News Service of Floridas Jim Saunders\n Off to the races: Gov.",
    "From the statement Rather than supporting their pleas for freedom by expanding democracy programming, broadcasting, global diplomacy, and sanctions against their oppressors, the Biden White House is rewarding the Western Hemispheres longest ruling communist dictatorship with high level talks, easing sanctions, increased travel, and access to U.S. financial institutions.?\nAnother view Florida Democratic Party chair Manny Diaz  who fled Cuba with his mother  countered that the administration would continue to push for the release of political pressure but said Biden was lifting draconian? policies that could also lead to fewer Cubans trying to reach the United States.",
    "But so far, well-known Democrats have stayed out, leaving money-poor challengers to take on the winner of a crowded GOP primary whose candidates range from a former congressional chief of staff to a reported Three Percenter militia member.?\n Florida veteran pledges to spend millions in Tampa Bay-area congressional race,? by Tampa Bay Times Emily L. Mahoney\n State Sen. Kelli Stargel enters crowded U.S. House-15 race,? by The Ledgers Gary White\nCAMPAIGN ROUNDUP Rep. Charlie Crist is making a sizable contribution of $100,000 to Blue Shift, the recently announced Florida Democratic Party coordinated campaign aimed at organizing and mobilizing Democratic voters.",
    "And I said, What do we need to do? and at that point he didnt respond at all.?\nBIRTHDAYS: Peter Wallsten, politics editor for The Washington Post  Axios Denvers John Frank  Shannon Gravitte, VP for public affairs at AdventHealth\nFollow us on Twitter\nGary Fineout @fineout\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "And while she said she was encouraged by policies that will reunite families,? she added that allowing investments in the Cuban private sector and easing travel restrictions will only serve to fund the corrupt dictatorship.?\n In a first, U.S. government green-lights American investment in private business in Cuba,? by El Nuevo Heralds Nora Gmez Torres\n... DATELINE TALLAHASSEE ...\nTRUST US DeSantis: Disney tax fix not coming until after the election,? by POLITICOs Matt Dixon and Andrew Atterbury: Gov.",
    "TURNABOUT  Reversing Trump measures, U.S. will expand flights to Cuba and resume family notifications,? by McClatchy D.C.s Michael Wilner and El Nuevo Heralds Nora Gamez Torres: The Biden administration is restoring flights to Cuban cities other than Havana and reestablishing a family reunification program suspended for years, following recommendations of a long-anticipated review of U.S. policy toward Cuba, senior administration officials told McClatchy and the Miami Herald on Monday.",
    "Few people, including top lawmakers, trade groups and the states insurance consumer advocate, were aware of their existence before being contacted by a reporter.?\n Florida regulators to consider trio of property insurance hikes as special session looms,? by Florida Politics Gray Rohrer\nIN PLACE New FL law would ban protests outside private residences, including homes of school board officials,? by Florida Phoenixs Michael Moline: Gov.",
    "The Chipola Complex fires turned the skies smoky and blood red, destroyed two homes, prompted the evacuation of a thousand more and consumed more than 30,000 acres of forest before firefighters got it under control.?\nGetting worse  Research from First Street Foundation released Monday suggests that as climate change warms the planet, the risk of wildfires like those in Florida could double by mid-century.",
    "Get in touch: gfineout@politico.com\nCAMPAIGN MODE\nSHOWDOWN  Democrats are scarce, Republicans run the gamut of ideology in race to succeed U.S. Rep. Murphy,? by Orlando Sentinels Steven Lemongello: Floridas Congressional District 7 has been redrawn to give Republicans an advantage, though not a substantial one, by combining Volusia and Seminole counties.",
    "State Sen. Kelli Stargel (R-Lakeland) is now running for the seat, as is Jerry Torres, a recently retired defense contractor and former Green Beret who pledged to spend millions of his own money to head to Washington, D.C. Former Rep. Dennis Ross, state Rep. Jackie Toledo as well as Jay Collins, another Army veteran and Green Beret, are also in the race.",
    "Darren Harrison told NBCs Today show that he was relaxing with his feet up in the back of the single-engine Cessna after a fishing trip in the Bahamas when the pilot told him and another passenger: Guys, I gotta tell you I dont feel good.? He said, Ive got a headache and Im fuzzy and I just dont feel right, the 39-year-old flooring salesman said.",
    "DeSantis defends Cord Byrd Secretary of State appointment,? by Florida Politics Renzo Downey\nGaetz-gate\nSTILL ON HOLD Sentencing for Gaetz wingman delayed until August,? by POLITICOs Matt Dixon: A former Florida tax collector whose sex trafficking and public corruption case ensnared Rep. Matt Gaetz (R-Fla.) had his sentence delayed yet again.",
    "MAPMAKER, MAPMAKER\nNEXT ROUND Florida judge reinstates remedial map while appeal looms,? by POLITICOs Gary Fineout: A Florida judge on Monday once again ordered that the state use a congressional map for the upcoming elections that would keep intact the North Florida district now held by Rep. Al Lawson, a Black Democrat.",
    "Torres, a first-time candidate and conservative Republican? who has gotten actively involved in politics over the last couple of years (including campaigning for Virginias Glenn Youngkin), has already put in $5 million of his own money and pledged another $10 million  a hefty amount for a congressional contest.",
    "GOP opposition  Republicans  including the states two senators  Marco Rubio and Rick Scott, as well as Reps. Mario Diaz-Balart, Maria Elvia Salazar and Carlos Gimenez  issued a joint statement that blasted the decision especially after hundreds of activists were imprisoned following last years protests.",
    "The administration will also allow group travel for educational or professional exchanges and lift caps on money sent to families on the island.?\nResponse The Biden administrations actions drew a wide response from Florida, where such a policy is expected to have its most dramatic repercussions.",
    "CRISIS, WHAT CRISIS? When Floridas property insurers fail, few ask why,? by Tampa Bay Times Lawrence Mower: As state lawmakers meet next week to try to fix the spiraling property insurance market, they could draw on the lessons of the graveyard of insurers that have failed in recent years.",
    "The move faces legal and political blowback because of the districts more than $1 billion in outstanding debt, which many believe could be transferred to Orange and Osceola county taxpayers, where Disney World has a flagship amusement park, an outcome DeSantis insists will not happen.",
    "The rhetoric and finger-pointing in the race to succeed Rep. Stephanie Murphy has also escalated to the point where state Rep. Anthony Sabatini  who bashed Florida House leaders for not being conservative enough  is coming under withering attack from other challengers in that race.",
    "Ron DeSantis has signed legislation providing for jail terms of up to 60 days and $500 fines for protesting outside the homes of public officials and private citizens  like whats been happening to U.S. Supreme Court justices since the leak of a draft opinion reversing Roe v. Wade.",
    " Protect our Future, a new Democratic super PAC largely backed by a cryptocurrency billionaire, announced Monday that it was endorsing Maxwell Alejandro Frost in Floridas 10th Congressional District and that it would spend up to $1 million to support his candidacy.",
    "Rep. Charlie Crist, who has visited Cuba, said he was encouraged? by the announcement and said he hoped it would improve the quality of life for everyday Cubans.? But Crist said more should be done to help Cubans gain access to the Internet and financial services.",
    "Response The judge, who was appointed to the circuit court by DeSantis, said he was concerned that allowing a stay to remain in place while the appeal worked its way through the system would result in voters being subjected to a potentially unconstitutional map.",
    "Greenbergs case has been on hold since February and the judge has approved a handful of sentencing extensions as Greenberg, who pleaded guilty to multiple charges including stalking, fraud and sex trafficking a minor, worked with federal prosecutors.",
    "I think the people would have a real problem with their government, if while this thing is being decided by courts on the merits, the clock ran out,? Smith told attorneys representing the state and the voting and civil rights groups that sued.",
    "Playing out over the state The race for Floridas 13th Congressional District, which has become a likely Republican seat due to redistricting, has already had quite a few moments of drama and GOP infighting that included alleged murder threats.",
    "That could bring more wildfires, new report warns,? by Miami Heralds Alex Harris: When Hurricane Michael tore through North Florida in 2018 as a Category 5 storm, it left more than 3 million acres of felled trees in its wake.",
    "Limbo Greenberg initially faced 33 criminal counts but prosecutors cut a deal with him last year, reducing the charges to six in exchange for Greenbergs cooperation in multiple inquiries, including into the GOP congressman.",
    "Ron DeSantis said a plan to shield Central Florida residents from tax hikes that could come after his decision to abolish Walt Disney Co.s special taxing district will not be made public until after the 2022 midterms.",
    "Former Seminole County tax collector Joel Greenberg, once referred to as Gaetz wingman,? will likely be sentenced in August, according to an order filed on Monday by U.S. District Judge Gregory A. Presnell.",
    "Agriculture Commissioner Nikki Fried said that we need to be out of the business of dividing Cuban families.? Fried added the U.S. must remain strong? in demanding the release of political prisoners.",
    "Caution from Demings Rep. Val Demings, who is challenging Rubio in the race for U.S. Senate, put out a statement early Tuesday morning where she stressed the need for a continued strong embargo.\"",
    "The issue has been a thorn in DeSantis side since he muscled a bill through the GOP-led Legislature doing away with Disneys special taxing district, known as the Reedy Creek Improvement District.",
    "Sending unruly mobs to private residences, like we have seen with the angry crowds in front of the homes of Supreme Court justices, is inappropriate, DeSantis said in a written statement.",
    "Off and running  Former Secretary of State Laurel Lee will officially announce her bid for Floridas 15th Congressional District today, people close to Lee confirmed to Florida Playbook.",
    "Ron DeSantis getting boots on the ground, and in a big way connect with Floridians from every corner of the state?  DeSantis handed out several endorsements on Monday.",
    "Through his political Twitter account, he endorsed state Rep. Bryan Avilas bid for the state Senate and he endorsed Reps. Paul Renner, Tom Leek and Fred Hawkins.",
    "Tick, tick Theres not much time for those running in Floridas 15th District to introduce themselves to primary voters in the short time between now and Aug. 23.",
    "If they are a better candidate, God bless them, Ill be there to support them after the primary.? We will see if that kind of attitude is shared by his rivals.",
    "The new normal This is the new landscape in Florida where Republican domination at the state level  and a new congressional map pushed into law by Gov.",
    "DeSantis is scheduled to be in Weston where he will deliver the keynote speech for the Broward County Republican Party Lincoln Day dinner.",
    "One of many Lees entry into this race comes as the field for this newly created open seat in the Tampa Bay area continues to swell.",
    "The path not normally taken Torres on Monday told Playbook that even with his money he plans to stay positive in his campaign.",
    "Those largely untouched trees were the perfect fuel for three simultaneous wildfires that raged through the region in March.",
    "Lee to jump into one of Florida's wild GOP primaries\nBy GARY FINEOUT\n05/17/2022 07:00 AM EDT\nHello and welcome to Tuesday.",
    " Pasco County state Rep. Amber Mariano decides not to seek reelection,? by Tampa Bay Times Barbara Behrendt\nDATELINE D.C.",
    "We must maintain the pressure on the regime, but we must also ensure ordinary Cubans do not become collateral damage.",
    "Ron DeSantis  has ensured fierce competitive primaries in open seats and a glaring absence of Democratic contenders.",
    "That same super PAC has poured $11 million in an Oregon congressional primary that will be decided on Tuesday.",
    "Circuit Judge J. Layne Smith vacated an automatic stay that was put in place after the administration of Gov.",
    "Floridas Department of Financial Services does a financial autopsy? on every insurance company that fails.",
    "Ron DeSantis appealed his first order blocking the Republican governors congressional redistricting map.",
    "Crist and Fried Two of the states Democratic candidates for governor also weighed in on the change.",
    "Have a tip, story, suggestion, birthday, anniversary, new job, or any other nugget for Playbook?",
    "Crist in a statement contended that Democrats are ready to mobilize in unity against Gov.",
    "Cuba policy is best conducted with a scalpel, not a machete,? he said in a statement.",
    "PENINSULA AND BEYOND\nPARADISE LOST? Climate change is heating up Florida.",
    "But once finished, the reports are effectively shoved in a drawer.",
    "Im going to respect the other people in the race.",
    "I dont want to tear people down,? he said.",
    "If only they knew what those lessons were.",
    " WHERE'S RON?",
    " Gov."
  ]
}