{
  "id": 3512,
  "mediaId": 151,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Florida's fight over Don't Say Gay is getting more heated. And it hasn't even gone into effect yet.",
  "image": "https://www.politico.com/dims4/default/850831c/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F98%2F0f%2F9177122e40c28d4500391616acfd%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1383522668",
  "link": "https://www.politico.com/news/2022/05/17/florida-fight-dont-say-gay-00032512",
  "sentiment": "0.0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "I dont know if thats the goal of the bill, but its very important we do have some clarity for parents and for the schools.?\nThe legislation prohibits teachers from leading classroom instruction on gender identity or sexual orientation for students in kindergarten through third grade and bans such lessons for older students unless they are age-appropriate or developmentally appropriate.?\nIt also requires schools to notify parents if schools help a child transition to a different gender, among other things, or any additional monitoring for their mental, emotional, or physical health or well-being,? language expected to have a significant effect on LGBTQ student support guides that some districts use as a resource for schools and families to help support LGBTQ students and offer recommendations on how to support students to teachers.",
    "Supporters of Joyces resolution made comments similar to statements from DeSantis backing the parental rights bill, telling the board that school is for education, not sexualization? and teachers should teach reading, writing and arithmetic, not ideology promoted by deviants.?\nI really dont understand, why are you so hellbent on teaching the LGBTQ support guide to little children who barely graduated from being toddlers?? said Quisha King, a member of the conservative parental rights advocacy group Moms for Liberty.",
    "One educator described the stark contrast being felt by teachers compared to previous school years amid the pandemic when they were heralded as miracle worker[s]? and superhero[es].?\nOnly recently in my eight years of teaching have I been called a groomer, a pedophile, an indoctrinator, and other names that are simply not appropriate to repeat in public conversation,? Alexander Ingram, a social studies teacher at Sandalwood High School, told the board.",
    "FLDOE officials said the agency is working on assistance for schools regarding the legislation and are expecting it to be released sometime before July 1.\nWith so many challenges facing districts already, the last thing students need is 67 different interpretations and implementations of new laws that sometimes lack clarity,? Theresa Axford, superintendent of Monroe County, wrote in remarks to the state Board of Education this week.",
    "People protest after the passage of the Parental Rights in Education bill, dubbed the \"Don't Say Gay\" bill by LGBTQ activists, on March 9, 2022, in Miami, Fla. | Joe Raedle/Getty Images\nBy Andrew Atterbury\n 05/17/2022 04:31 AM EDT\nTALLAHASSEE, Fla.  The ugly fight over Floridas Parental Rights in Education? bill has shifted from the statehouse to local school districts.",
    "School officials in Lee County last month severed the contract of Casey Scott, a first-year art teacher at Trafalgar Middle School, after she taught lessons about LGBTQ pride flags and came out to students as pansexual, making some feel uncomfortable,? the local Fort Meyers News-Press reported.",
    "These guides, and particularly one in Leon County that is subject of a federal lawsuit, helped inspire the parental rights expansion in 2022 as Republican lawmakers argued that the plans can go too far to keep parents in the dark about children changing their names and transitioning genders.",
    "In one case that has drawn national attention, the first openly gay class president at Pine View School in Sarasota County, Zander Moricz, claims his principal told him not bring up his LGBTQ activism or involvement in a lawsuit challenging the legislation in his upcoming graduation speech.",
    "The law is driving division when we should have a state where all students are protected and all families are respected.?\nElsewhere, the new law has steered school districts to review their local student LGBTQ support guides to ensure that the policies are in line with the new state law.",
    "They asked board members to stand up to the states anti-LGBTQ legislation? and implored them: Dont be a Disney villain.? Opponents of the parental rights bill, including President Joe Biden, say it could further marginalize some students and lead to bullying and even suicide among youth.",
    "Last week, state education officials called out Lee Countys school board, claiming local school officials had conversations about ways to circumvent the upcoming requirements? spelled out in legislation prioritized by Republican lawmakers, including the parental rights law.",
    "One student told district investigators that they thought that was a little weird because she is telling a class of 6th and 7th graders all that.?\nIn letting Scott go, the district said the art teacher was not following the state-mandated curriculum,? the News-Press wrote.",
    "That the school district is knowingly socially transitioning students at school without parents knowledge, I really wanted that to come out.?\nJoyces proposal drew a massive crowd at a May 3 board meeting, inspiring nearly 300 people on both sides of the issue to attend.",
    "In one example of attempted compliance, a Duval County board member proposed a resolution declaring that the school board unequivocally supports? the states parental rights bill and disapproves? of provisions within the districts LGBTQ support guide.",
    "It epitomizes how the laws vague and ambiguous language is erasing LGBTQ students, families, and history from kindergarten through 12th grade, without limits,? Jon Harris Maurer, Equality Floridas public policy director, said in a written statement.",
    "Dont Say Gay isnt even a law yet and youre already using it to target LGBTQ+ students,? JJ Holmes, a Seminole County student known as an advocate for disability rights and the LGBTQ community, told the school board last week.",
    "The newly minted law, which has caused an uproar across the nation and has led to a high-profile fight between DeSantis and The Walt Disney Co., is set to go into effect July 1 and is being challenged in federal court.",
    "At Lyman High School in Seminole County, district officials have been embroiled in a censorship dispute after planning to delay the release of a yearbook to cover up photos of a student-led protest against the bill.",
    "The organization, along with parents and students, is fighting the legislation in court, arguing it marks an extraordinary government intrusion on the free speech and equal protection rights? in public schools.",
    "What it does create is a lot of divisiveness, and it also creates a lack of clarity completely with this bill,? Nadia Combs, who chairs Hillsborough Countys school board, said at a recent school board meeting.",
    "The move demonstrates how closely the state is tracking local school leaders who in the past have bucked the DeSantis administration on reopening schools and masking students during the Covid-19 pandemic.",
    "School officials changed their stance on the issue last week after students objected and instead are adding disclaimer stickers to clarify that students, not the school, protested the legislation.",
    "School districts have asked the state for help interpreting the new parental rights law and others that were passed in 2022, but so far the Department of Education has yet to meet that request.",
    "Statements from students revealed that Scott asked students to create their own pride flags in class and shared details about her personal life, like that she has a husband and girlfriend.",
    "The legislation gives parents the power to sue schools for withholding information about their children from them, putting the pressure on districts to fall in line with the law by July 1.",
    "Ron DeSantis signed the measure, dubbed Dont Say Gay? by its critics, into law, schools across the state have started to feel the legislations effects even before it officially takes hold.",
    "Equality Florida, one of the LGBTQ advocacy groups suing the DeSantis administration over the legislation, says that the two examples amount to blatant censorship? tied to the bill.",
    "And all the while, school officials remain in a holding pattern as the Florida Department of Education comes up with guidance for how to carry out the controversial measure.",
    "So far, the law has led to varying responses from local school leaders while also generating allegations of censorship from students speaking out against the measure.",
    "One educator claimed they have been called a groomer? and pedophile.? At least one first-year educator was fired for bringing LGBTQ discussions into the classroom.",
    "School officials had a signal to cut off my microphone, end my speech, and halt the ceremony,? Moricz said in a series of tweets detailing the experience.",
    "These parents entrust their children to us every single day,? Charlotte Joyce, the Duval board member who suggested the resolution, said in an interview.",
    "The local Florida Times-Union described that police tape was used to create a makeshift aisle in the building while hundreds rallied in the parking lot.",
    "While all this is playing out across the state, the Department of Education is paying close attention to how districts react to the new legislation.",
    "And in an incident in southwest Florida, one educator, a Cape Coral art teacher, was fired for bringing LGBTQ discussions into the classroom.",
    "Yet LGBTQ advocates told the board that the resolution could cause students to hate themselves? or feel unsafe in the classroom.",
    "Scott also told school officials that students had been coming out to her,? according to the News-Press.",
    "Joyces resolution was ultimately tabled at 1:15 a.m. after more than five hours of public comment.",
    "The proclamation also thanks DeSantis and the Legislature for defending the rights of parents.",
    "Students have complained about being censored for supporting the LGBTQ community.",
    "Duval County encompasses Jacksonville.",
    "In the weeks since Florida GOP Gov."
  ]
}