{
  "id": 3514,
  "mediaId": 132,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "State launches new effort to examine banking access",
  "image": "https://cdn.newsday.com/ace/c:NzUyMmY0NzctZTNjNy00:MDdhZTM0/landscape/1280",
  "link": "https://www.newsday.com/business/banking-underserved-communities-of-color-l5qu152f",
  "sentiment": "0",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2186,
    4043,
    4224,
    4609,
    3258,
    3261,
    3370,
    5042
  ],
  "sentences": [
    "Even if we got them, most of the people in the community cant get loans to open a small business, or they end up paying through the nose with high interest rates and fees.?\nHochuls office didnt respond to emails seeking comment Friday, but the new law directs the state Department of Financial Services to submit its report within a year.",
    "Within the broader New York City metropolitan area, which includes Long Island but also covers parts of New Jersey, Black and Hispanic households have among the highest rates of being unbanked,? according to the most recent survey by the Federal Deposit Insurance Corporation, or FDIC, the federal agency that insures bank deposits.",
    "The Federal Reserve Bank of New York, in a 2017 report, identified 18 neighborhoods on Long Island, including the parts of diverse communities such as Hempstead, Roosevelt, Freeport, and Uniondale, where families are particularly struggling to access mainstream credit and manage their debt.",
    "Kathy Hochul on May 5 signed legislation to study and make recommendations to address so-called unbanked? or underbanked? communities where residents are at greater risk of falling victim to predatory lenders and other harmful financial schemes that prevent them from building wealth.",
    "A major driver in the banking disparities is a lack of financial literacy starting at childhood, said Renu Dalessandro, chief marketing officer for Jovia Financial Credit Union, a Westbury-based nonprofit institution with nearly two dozen locations across Long Island.",
    "Youd be surprised how some people are just scared to ask questions, or don't know what questions to ask.?\nWhatever the solutions, Mayers, of the NAACP, says he hopes state officials involve those most impacted early and often in the discussions.",
    "Local financial institutions and advocacy groups are hopeful a new state effort focused on communities that lack banks and other financial services will benefit some of Long Islands lowest income and most racially diverse cities and towns.",
    "The statewide assessment will hopefully address the dearth of reliable, granular-level local data on the extent of the underbanking problem on Long Island, said David Okorn, executive director of the Long Island Community Foundation.",
    "Ron DeSantis recently signed into law unanimously approved bipartisan legislation requiring that high school students take a financial literacy course to graduate, according to Dalessandro.",
    "As the state studies and develops its recommendations, it should consider boosting programs for youths so theyre better able to manage their finances as adults, she said.",
    "Douglas Mayers, head of the NAACPs chapter for Freeport, Roosevelt and Baldwin, said a comprehensive assessment of such banking deserts? on Long Island is overdue.",
    "The foundation launched the Long Island Racial Equity Initiative in 2018 to address inequalities impacting the economic health of Black Long Islanders.",
    "Some 11% of Black and 12% of Hispanic households in the New York City area were unbanked, compared to roughly 2% of white or Asian households in 2019.",
    "Meanwhile, families with incomes below $30,000 accounted for nearly 40% all unbanked in 2019, according to the FDIC.",
    "How are you going to get this problem solved without the people who are living with that problem?? he said.",
    "You just cant leave them out, or youre never going to get anywhere.?  Special to Newsday",
    "The latest LI business news in your inbox Monday through Friday.",
    "We don't have any big banks in our communities,? he said.",
    "One model to look to is Florida, where Republican Gov.",
    "We need to provide that education,? she said.",
    "Look around at our communities of color.",
    "Get the Biz Briefing newsletter!",
    "Democratic Gov."
  ]
}