{
  "id": 3518,
  "mediaId": 136,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Ron DeSantis Signs Law Making it Illegal to Protest Outside a Private Home",
  "image": "https://d.newsweek.com/en/full/2038861/abortion-rights-protests-maryland-neighborhood.webp?w=790&f=15ae1426718d43a7579facc420f71423",
  "link": "https://www.newsweek.com/ron-desantis-signs-law-making-it-illegal-protest-outside-private-home-1707158",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Thomas",
  "authorUrl": "https://www.newsweek.com/authors/jake-thomas",
  "termIds": [
    661,
    805,
    827,
    1070,
    1223,
    2058,
    2367,
    146,
    2661
  ],
  "sentences": [
    "\"Look, I think the president's view is that there is a lot of passion, there's a lot of fear, there's a lot of sadness from many people across this country about what they saw in that leaked document,\" former White House press secretary Jen Psaki said earlier this month.",
    "The bill comes amid a renewed debate about the limits of protests after demonstrators targeted the homes of U.S. Supreme Court justices following a leaked opinion showing the court was poised to overturn Roe v. Wade and strike down national abortion rights.",
    "However, Democrats raised concerns there was too much ambiguity around the bill, particularly around how much discretion it gave officers deciding whether protesters had the \"intent to harass or disturb.\"",
    "Following the leak of the explosive draft opinion, protesters have targeted the homes of the court's conservative justices, including Amy Coney Barrett, Samuel Alito, John Roberts and Brett Kavanaugh.",
    "\"Sending unruly mobs to private residences, like we have seen with the angry crowds in front of the homes of Supreme Court justices, is inappropriate,\" DeSantis said in a statement.",
    "Senator Tom Cotton of Arkansas has introduced a bill requiring online platforms to remove the home addresses of government officials and their families if requested to do so.",
    "DeSantis signed the bill Monday, saying it was inappropriate for protesters to target homes and the legislation would protect residential communities.",
    "House Bill 1571 makes it illegal to protest or picket near a residence \"with the intent to harass or disturb that person in his or her dwelling.\"",
    "Florida protesters who picket outside a person's private home could face jail time and fines under a bill signed by Governor Ron DeSantis.",
    "The newly signed legislation specifies that law enforcement must give protesters a warning to disperse before they can issue a citation.",
    "During a legislative hearing in February, law enforcement said the bill would give them one more tool to manage protests.",
    "However, the Florida bill was introduced in the Legislature in January by Republican state Representative Randy Maggard.",
    "\"We obviously want people's privacy to be respected, we want people to protest peacefully if they want to protest.",
    "\"This bill will provide protection to those living in residential communities and I am glad to sign it into law.\"",
    "Democrats' responses to the protests targeting the justices' homes have ranged from encouraging to tolerant.",
    "Senator Ted Cruz of Texas and Congressman Lee Zeldin of New York called Psaki's remarks \"sick.\"",
    "Republicans, on the other hand, have been more willing to condemn the tactic.",
    "Those convicted could be charged with a second-degree misdemeanor.",
    "That is certainly what the president's view would be.\"",
    "Newsweek has reached out to Maggard for comment."
  ]
}