{
  "id": 3520,
  "mediaId": 65,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "DeSantis signs bill making it illegal to protest in front of an individual's home",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/89cf9952-468b-4a45-aa12-f522c39f2508/2f7018c6-099e-497c-bcf0-4a3ba4e6712b/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/florida-desantis-signs-bill-illegal-protest-individuals-home",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Best",
  "authorUrl": "https://www.foxnews.com/person/b/paul-best",
  "termIds": [
    661,
    2058,
    482,
    2661
  ],
  "sentences": [
    "Ron DeSantis signed a bill on Monday that makes it illegal to protest at an individual's residence, citing the demonstrators who have shown up outside of multiple Supreme Court justices' homes in recent weeks.",
    "Groups of protesters have gathered outside the homes of Supreme Court Justices after a draft opinion by Justice Samuel Alito that would overturn Roe v. Wade was leaked to Politico earlier this month.",
    "\"Sending unruly mobs to private residences, like we have seen with the angry crowds in front of the homes of Supreme Court justices, is inappropriate,\" DeSantis said in a statement on Monday.",
    "The Senate unanimously passed the Supreme Court Police Parity Act last week, which would provide around-the-clock security to justices and their families, but the House is yet to vote on it.",
    "SENATE FAILS TO ADVANCE BILL TO GUARANTEE ABORTION ACCESS NATIONWIDE\nViolators can be charged with a second-degree misdemeanor and face up to a $500 fine and 60 days in jail.",
    "Alito's leaked draft does not represent the final opinion of the court, and it could change before a ruling is issued later in the term.",
    "\"This bill will provide protection to those living in residential communities and I am glad to sign it into law.\"",
    "Under the new law, protesters can only be arrested if they ignore a law enforcement officer's orders to disperse.",
    "Florida Gov."
  ]
}