{
  "id": 3528,
  "mediaId": 157,
  "date": "d2022-05-17T00:00",
  "headline": "Top DeSantis spokeswoman gets punked by fake Washington Post parody",
  "image": "https://www.rawstory.com/media-library/desantis.jpg?id=29791897&width=1200&coordinates=0%2C25%2C0%2C25&height=600",
  "link": "https://www.rawstory.com/fake-news-christina-pushaw/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah K. Burris",
  "authorUrl": "https://www.rawstory.com/u/sarah_k_burris",
  "termIds": [
    661,
    4275,
    262,
    525,
    539,
    2661
  ],
  "sentences": [
    "More cutting edge journalism from the 49 year old Washington Post activist infamous for showing up masked on random people's doorsteps & sliding into the DMs of tiktok teenagers.pic.twitter.com/Ua0Al8J1jq\n Christina Pushaw \\ud83d\\udc0a \\ud83c\\uddfa\\ud83c\\uddf8 (@Christina Pushaw \\ud83d\\udc0a \\ud83c\\uddfa\\ud83c\\uddf8) 1652729738\nA 2019 post from Miss Chewston features her sitting behind a glass of red wine.",
    "Its interesting, almost ironic, her voice on Instagram has always been kind of sassy and a little gay, so its very ironic that shes branded as homophobic.?\nWashington Post reporter Taylor Lorenz has become a target of conservatives after identified an influential woman who was using her Twitter account to mock \"TikTok liberals.\"",
    "\"More cutting edge journalism from the 49 year old Washington Post activist infamous for showing up masked on random people's doorsteps & sliding into the DMs of tiktok teenagers,\" tweeted Christina Pushaw, the top spokesperson for the Florida governor.",
    "The story is about a gay couple's dachshund named Whitney Chewston, who has her own Instagram account with over 101,000 followers that features her in stunning photos along with her own commentary to match.",
    "The tweet, which is still available on Twitter as of May 17 at 2:36 p.m. EST, shows a screen capture of a phony Washington Post article titled \"This dog is the new face of online homophobia.\"",
    "That image has been taken and used to promote homophobia through memes starting in 2021 with comments placed over it saying \"not too fond of gay people.\"",
    "Ron DeSantis' (R-FL) press chief after she posted a fake news story on Twitter in an effort to attack fellow Post reporter Taylor Lorenz.",
    "Snopes has already done a fact-check on her tweet, but made no mention of the details other than the claim by Pushaw was false.",
    "The story actually appeared on LGBTQ Nation, with the same title and was written by managing editor Alex Bollinger.",
    "Since that report, Pushaw has tweeted about or to Lorenz at least 44 times in the past month.",
    "Shes not homophobic in real life!? said Logan Hickman, one of Miss Chewston's owners.",
    "The owners have tried to dispel the myths about their pup, but to no avail.",
    "Washington Post reporter Aaron Blake fact-checked Gov.",
    "\"Her dads are gay."
  ]
}