{
  "id": 3530,
  "mediaId": 34,
  "date": "5/17/2022 12:00:00 AM",
  "headline": "Progressives Vow to Fight as DeSantis Signs Bill Banning Protests at Florida Homes",
  "image": "https://www.commondreams.org/sites/default/files/styles/social_share_image/public/2021-07/Black-Lives-Matter-2600x1361.jpg?h=2107a5a6&itok=qzg_Djcn",
  "link": "https://www.commondreams.org/news/2022/05/17/progressives-vow-fight-desantis-signs-bill-banning-protests-florida-homes",
  "mediaOutlet": "Common Dreams",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brett Wilkins",
  "authorUrl": "https://www.commondreams.org/author/brett-wilkins",
  "termIds": [
    661,
    2322,
    3992,
    4243,
    4906,
    64,
    3286,
    3494,
    2661
  ],
  "sentences": [
    "The new law, which has drawn comparisons to a separate statute effectively allowing the killing or wounding of protesters, makes \"picketing or protesting\" outside private residences a second-degree misdemeanor crime punishable by as many as 60 days behind bars, up to a $500 fine, and six months' probation.",
    "Some progressives noted that instead of listening to activists' voices in the wake of Black Lives Matter and other protests that followed the killing of George Floyd, Breonna Taylor, Ahmaud Arbery, and others, Florida's Republican-controlled Legislature passed and DeSantis subsequently signed H.B.",
    "Local proponents of the new Florida law pointed to the eight days of peaceful protests outside the Windermere vacation home of Derek Chauvin, the Minneapolis police officer convicted of murdering George Floyd, in May 2020, as well as demonstrations at the residences of Republican U.S. Sens.",
    "DeSantis said the new law is meant to prevent protests like those organized by ShutDownDC and Ruth Sent Us outside the homes of the right-wing U.S. Supreme Court justices who are likely to void half a century of reproductive rights by reversing Roe v. Wade in the coming weeks.",
    "The Florida House of Representatives passed the measure by a mostly party-line vote of 76-41, while only three state senatorsLori Berman (D-31), Annette Taddeo (D-40), and Victor Torres (D-15)dissented from 28 colleagues who voted for the bill in the upper chamber.",
    "Francesca Menes, co-founder and board chair of The Black Collective, said in a statement that \"the governor and his allies want to silence the perspectives of Floridians who seek to hold them accountable, including Black, Indigenous, and other people of color.\"",
    "\"That's not the case here in Florida, where we have seen legislation the last two sessions undermining this vital right and attacking the Black communities that have relied on it to bring about meaningful change for generations,\" she added.",
    "1571 builds on the unconstitutional foundations of the anti-protest bill last year,\" said Menes, \"and only reaffirms our will to make sure our voices are heard in order to create a brighter future for the people of our state.\"",
    "\"Sending unruly mobs to private residences, like we have seen with the angry crowds in front of the homes of Supreme Court justices, is inappropriate,\" DeSantis said in a statement.",
    "1, a controversial 2021 \"anti-riot\" bill that restricts constitutionally protected dissent while shielding motorists who kill or injure demonstrators in certain situations.",
    "\"Florida is also the state that gave civil immunity to drivers for running over protesters, so this law is the logical next step in Gov.",
    "\"Florida is also the state that gave civil immunity to drivers for running over protesters, so this law is the logical next step in Gov.",
    "Menes and others said the new law violates their First Amendment rights and noted that a federal judge last September ruled H.B.",
    "\"This bill will provide protection to those living in residential communities and I am glad to sign it into law.\"",
    "Menes said that \"the right to peaceful protest is a bedrock American principle that should never be undermined.\"",
    "DeSantis' war on [the] First Amendment,\" tweeted PoliticusUSA editor-in-chief Sarah Reese Jones.",
    "Critics are calling a new Florida law unconstitutional following Republican Gov.",
    "1571, which bans protests outside homes, on Monday.",
    "1 unconstitutional and therefore unenforceable.",
    "DeSantis' war on [the] First Amendment.\"",
    "Ron DeSantis' signing of H.B.",
    "Marco Rubio and Rick Scott.",
    "\"H.B."
  ]
}