{
  "id": 3536,
  "mediaId": 409,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "DeSantis Signs Law Banning Protests outside Homes",
  "image": "https://www.nationalreview.com/wp-content/uploads/2020/05/florida-governor-ron-desantis.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/desantis-signs-law-banning-protests-outside-homes/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Evans",
  "authorUrl": "https://www.nationalreview.com/author/zachary-evans/",
  "termIds": [
    661,
    482,
    2661,
    2934
  ],
  "sentences": [
    "This bill will provide protection to those living in residential communities and I am glad to sign it into law.?\nThe signing comes after multiple demonstrations outside the homes of conservative Supreme Court justices, in protest of the potential reversal of the 1973 decision in Roe v. Wade, which found a constitutional right to an abortion.",
    "Florida governor Ron DeSantis signed a bill on Monday that bars protesters from demonstrating outside homes, in the wake of protests at the homes of conservative Supreme Court justices triggered by a leaked draft opinion that would overturn Roe v. Wade.",
    "In response to the demonstrations, the U.S. Senate passed a bill on May 9 that would increase security for justices family members, sponsored by Senators John Cornyn (R., Texas) and Chris Coons (D., Del.).",
    "Sending unruly mobs to private residences, like we have seen with the angry crowds in front of the homes of Supreme Court justices, is inappropriate,? DeSantis said in a statement to the media.",
    "The law bans demonstrations before or about dwelling of person with specified intent,? and allows police to arrest protesters only after giving warning beforehand.",
    "The law classifies protesting aimed specifically at private residences as a second-degree misdemeanor, punishable by up to 60 days in jail or a $500 fine.",
    "A draft opinion that would overturn that decision, signed by five justices, was leaked to Politico earlier this month.",
    "The House has not yet voted on the bill."
  ]
}