{
  "id": 3539,
  "mediaId": 302,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "The challenges facing the next Pinellas schools superintendent | Editorial",
  "image": "https://www.tampabay.com/resizer//ZfzEXVkOUAOM6CCt94nF_jOmfDg=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/S4FRXGIK7FHT5DRNYXMZI74ARI.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/16/the-challenges-facing-the-next-pinellas-schools-superintendent-editorial/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "The Florida Constitution places great emphasis on public schools, saying that adequate provision shall be made by law for a uniform, efficient, safe, secure, and high quality system of free public schools that allows students to obtain a high quality education.? But with the increasing use of vouchers for private schools and the like, it can feel as if the free public schools? have been getting short shrift.",
    "The winning candidate will have to figure out how to knock down wildly wrong concepts such as replacement theory? or the Great Replacement,? the conspiracy theory that Western elites want to replace and disempower white Americans by bringing non-whites into the country for political gain.",
    "The new superintendent will need to help traditional public schools and the thousands of Pinellas staffers who work in them to rise from that defensive crouch and stand strong for traditional public education, where the vast majority of Floridas children are educated.",
    "In his current role as chief academic officer, he helped guide the district through two years of education during a pandemic, using a hybrid in-person and remote instruction system that tried to limit learning losses while simultaneously keeping COVID-19 at bay.",
    "If, as seems likely, Kevin Hendrick gets the job, the district will be in good hands, led by someone educated in the very system he will lead and who has spent nearly his entire 25-year career working for it, gaining more responsibility with each new assignment.",
    "Teachers will need the backing of a strong superintendent who knows that actual instruction occurs between a teacher and her students in a classroom  not at the School Board meeting or in the superintendents office.",
    "Ron DeSantis heralds as the Stop Woke Act?) and the Parental Rights in Education law (dubbed the dont say gay bill? by critics), they can be unsure exactly what subjects are safe to cover.",
    "In hindsight, theres a solid argument that each teacher should have handled remote instruction or in-person teaching  not both simultaneously  but the system worked reasonably well.",
    "And what systems will be in place to recognize that a student is disturbed or unbalanced and to get him the help he needs while protecting classmates from harm?",
    "The members of the Editorial Board are Editor of Editorials Graham Brink, Sherri Day, Sebastian Dortch, John Hill, Jim Verhulst and Chairman Paul Tash.",
    "The superintendents job is to let good teachers teach, to provide the support they need to do their jobs, and then to stay mostly out of the way.",
    "Hendrick graduated from Largo High School when the district was still under a federal court order that mandated busing for desegregation.",
    "The next Pinellas County public schools superintendent will have to navigate a difficult, fast-changing educational environment.",
    "The new Pinellas superintendent will have to paddle against the political tide that is trying to sanitize much of our history.",
    "The mass shooting in Buffalo this past weekend provided another reminder of the next superintendents vast responsibilities.",
    "This comes at a time when students critically need to be covering topics that are contentious to teach and hard to learn.",
    "How will the superintendent ensure that critical thinking is not only encouraged but required in classrooms?",
    "Subscribe to our free Stephinitely newsletter\nEditorials are the institutional voice of the Tampa Bay Times.",
    "Parents are not just more involved than ever but can be combative about what is taught in the classroom.",
    "Public schools are under siege in Florida, and the new superintendent will have to lead in that world.",
    "But if those subjects are not taught, ignorance will fill the void, and thats dangerous for democracy.",
    "Teachers feel underappreciated and with new laws such as the Individual Freedom law (which Gov.",
    "The accused gunman is only 18 and apparently filled with racist hate and misbegotten ideas.",
    "Fortunately, the School Board has three solid candidates from whom to choose.",
    "Follow @TBTimes_Opinion on Twitter for more opinion news.",
    "How will they be debunked in Pinellas public schools?"
  ]
}