{
  "id": 3540,
  "mediaId": 302,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Florida veteran pledges to spend millions in Tampa Bay-area congressional race",
  "image": "https://www.tampabay.com/resizer//--R7nPOucqA7NWNthekhu0y26nw=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/4HEDW6P46RF55EQXBVGEZHWTJE.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/elections/2022/05/16/florida-veteran-pledges-to-spend-millions-in-tampa-bay-area-congressional-race/",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3925,
    254,
    545,
    562,
    2661
  ],
  "sentences": [
    "Life has been good to me and I just want to give back.?\nTorres company, Torres Advanced Enterprise Solutions, generated nearly $1 billion contracting with the federal government and non-governmental organizations, according to a news release, for services including protecting American embassies and bases.",
    "Other candidates include U.S. Rep. Dennis Ross, who previously represented much of the same area, state Rep. Jackie Toledo, another Army veteran named Jay Collins plus the rumored entry of Secretary of State Laurel Lee, who just resigned from state government.",
    "Ive realized the importance of being involved in the decisions in this country.?\nThe Republican primary for the red-leaning 15th District is shaping up to be highly competitive, with several recognizable names in Republican politics.",
    "So if I go out and try to sell Jerry Torres as a good candidate for Congress Im probably not ... going to get the donors.?\nIm prepared to do it myself because I want to focus on what the district wants,? he added.",
    "The crowded Republican primary for Floridas 15th Congressional District is getting a new face, as Jerry Torres, a Green Beret veteran and retired defense contractor, announced Monday he is entering the race.",
    "Torres has never before run for office and just moved to Lakeland about a month ago, he said, after spending the prior few months living in Siesta Key, and before that, near Cape Coral.",
    "Ron DeSantis office and passed by the Legislature, encompasses northeast Hillsborough County, including parts of Tampa, as well as southeastern Pasco and a slice of western Polk County.",
    "When it comes to student loan debt, Torres said hes against loan forgiveness but would support measures to make it easier for people pay back their loans without hurting their credit.",
    "That figure would rank among the highest sums a candidate has ever dedicated toward a U.S. House race, according to a database of self-funded campaigns by Open Secrets.",
    "But issues such as illegal immigration, inflation and ensuring teachers dont indoctrinate? students, he said, helped turn him into a conservative.",
    "His family used to all be Democrats, Torres said, and he also did not vote in the 2016 or 2020 elections, saying he was often overseas.",
    "But hes willing to go big on his race  hes already set aside $5 million and is willing to spend up to $15 million if needed, he said.",
    "The district, as it currently stands in the new map drawn by Gov.",
    "?Ive just kind of backed into this thing,? he said.",
    "Im not a good salesman,? Torres, 65, said.",
    "He sold the company in 2019, he said."
  ]
}