{
  "id": 3543,
  "mediaId": 302,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Michele Rayner drops out of Pinellas congressional race, runs for state House",
  "image": "https://www.tampabay.com/resizer//qEdjqScNuQS-zlQX3hky3zucomU=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/PJUQ2CUF5RFJVB5IBMAPFKXKHQ.JPG",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/16/michele-rayner-drops-out-of-pinellas-congressional-race-runs-for-state-house/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Romy Ellenbogen",
  "authorUrl": "https://www.tampabay.com/author/romy-ellenbogen",
  "termIds": [
    661
  ],
  "sentences": [
    "In Floridas 13th Congressional District, the Republicans in the race are: veteran Anna Paulina Luna, attorney Kevin Hayslett, Republican strategist Amanda Makki, nonprofit founder Audrey Henson, business owner Christine Quinn, former University of South Florida student body president Moneer Kheireddine and Jim Davis of Wimauma.",
    "Its been the honor of a lifetime to campaign and walk alongside the people of Pinellas County for what I know they deserve  real results from their leaders and someone who will fight for them.?\nWhen Rayner jumped into the race for Congress, the boundaries of Floridas 13th district were unknown.",
    "Former state Rep. Wengay Newton and Trevor Mallory, president of the Democratic Black Caucus of Florida, are filed to run as Democrats for the state House seat, which had seemingly been left open with Rayners congressional run.",
    "But after running the numbers, Rayner said she found the district was gerrymandered in a way we didnt even realize.?\nYou cant have a fair and free election in Pinellas County with this particular map,? she said.",
    "With Rayner and Diamond out of the field, Eric Lynn, a national security consultant, is the only Democrat who has raised money in the race for Pinellas open seat, to be vacated by U.S. Rep. Charlie Crist.",
    "Rayners decision to drop out of the congressional race comes just a few days after her colleague in the state House, Rep. Ben Diamond, D-St. Petersburg, said hed suspend his congressional campaign.",
    "Rep. Michele Rayner, a St. Petersburg Democrat, announced on Monday that she is ending her run for Floridas 13th Congressional District and instead running for reelection to the Florida House.",
    "Rayner deferred when asked about endorsements, and said shes focused on her reelection campaign and rolling out a voter registration program in Pinellas.",
    "Christian Hotchkiss, a Democrat, is registered to run but has not brought in any fundraising and is also filed to run for a state House seat.",
    "As a result, Floridas 13th district becomes redder, and the 14th district, currently held by U.S. Rep. Kathy Castor, becomes more blue.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nFrank Craft, a business owner, is running as a libertarian.",
    "The new configuration of that district includes south St. Petersburg and jumps the bay to East Hillsborough County.",
    "After the maps were approved, Rayner announced that she would stay in the race for Congress despite the new lines.",
    "Under its old configuration, Rayner represented parts of Pinellas, Hillsborough, Manatee and Sarasota counties.",
    "After speaking with her family and constituents, Rayner decided to seek reelection in state House District 62.",
    "Ron DeSantis office, take the 13th district from South Pinellas and expand it up to the Pasco County line.",
    "In a statement Monday afternoon, Mallory announced hed be stepping out of the race in support of Rayner.",
    "It splits St. Petersburg in two, dividing the city and its Democratic voters.",
    "This was not a decision I made (lightly),? Rayner said in a statement.",
    "She said that work will be a help to any Democrat in the county.",
    "Rayner said she spoke with the candidates about her decision.",
    "Newton could not immediately be reached for comment.",
    "But the approved maps, drawn by Gov."
  ]
}