{
  "id": 3545,
  "mediaId": 195,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "GOP senator apologizes after boos for two sexes remarks",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/lummiscynthia_072821gn_lead.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/senate/3489654-gop-senator-apologizes-after-boos-for-two-sexes-remarks/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Dress",
  "authorUrl": "https://thehill.com/author/brad-dress/",
  "termIds": [
    661,
    1989,
    2250,
    4767,
    428,
    571,
    3641,
    2791,
    2934,
    2976
  ],
  "sentences": [
    "While we respect the right of all to express their views, from students to elected officials, we unequivocally state that UW is an institution that supports and celebrates its diverse communities that collectively make us the wonderful place that we are.?\nRepublican-led states have implemented a range of transphobic legislation, including a directive from Texas Gov.",
    "apologized on Monday after she was booed by a crowd during a commencement address at the University of Wyoming for saying it is a fundamental scientific truth? that there are only two sexes.?\nLummis said it was never my intention to make anyone feel un-welcomed or disrespected,? and apologized to those who were made to feel that way, according to Oil City News.",
    "During the commencement address on Sunday, Lummis said constitutional rights were under attack in the U.S. and even fundamental scientific truths such as the existence of two sexes, male and female, are subject to challenge these days.?\nThe remark immediately drew a loud chorus of boos from the crowd, as Lummis paused for an awkward smile.",
    "My reference to the existence of two sexes was intended to highlight the times in which we find ourselves, times in which the metric of biological sex is under debate with potential implications for the shared Wyoming value of equality,? the statement read.",
    "said gender-affirming care was almost grotesque? earlier this month, while in Michigan, GOP state senators accused Democrats of grooming? children because they stood up for transgender rights.",
    "Other GOP lawmakers and politicians in local, state and federal offices have made incendiary comments against the trans community, which has among the highest rates of suicide in the country.",
    "Im not making a comment on the fact that there are people who transition between sexes.?\nLummis then moved on to another topic, ignoring repeated boos from the crowd.",
    "Ron DeSantis (R) banned discussion of gender identity and sexual orientation in schools from kindergarten through third grade.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "University of Wyoming President Ed Seidel released a statement about Lummiss remarks without naming the senator.",
    "One of our speakers made remarks regarding biological sex that many on campus take issue with,? he said.",
    "Greg Abbott (R) to investigate parents who allow their child to recieve gender-affirming care.",
    "Several red states have also banned transgender girls from participating in girls sports.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "You know, I  ? Lummis said, then waved her hand dismissively.",
    "Sen. Cynthia Lummis (R-Wyo.)",
    "I challenge those of you.",
    "Sen. Mike Braun (R-Ind.)",
    "Florida Gov."
  ]
}