{
  "id": 3550,
  "mediaId": 136,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Parkland Father Blames Ron DeSantis, Other Republicans for Buffalo Shooting",
  "image": "https://d.newsweek.com/en/full/2038234/fred-guttenberg-speaks-outside-supreme-court.webp?w=790&f=b253f98cc39fb1e99c4a3e30958d32fb",
  "link": "https://www.newsweek.com/parkland-father-blames-ron-desantis-other-republicans-buffalo-shooting-1706897",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Khaleda Rahman",
  "authorUrl": "https://www.newsweek.com/authors/khaleda-rahman",
  "termIds": [
    661
  ],
  "sentences": [
    "Guttenberg, who has been campaigning for gun control legislation since his 14-year-old daughter Jaime was killed in the 2018 shooting at Parkland, Florida's Marjory Stoneman Douglas High School, told Newsweek that there is not much stopping the next potential mass shooter from acquiring deadly firearms.",
    "Authorities are also working to confirm the authenticity of a racist 180-page manifesto, purportedly written by Gendron, that included ideas from \"The Great Replacement Theory,\" a once-fringe conspiracy theory that claims white Americans are at risk of being replaced by people of color.",
    "(2,2) have embraced the White Supremacy that motivated this killer and who share imagery that leads troubled youth to think this is Ok. As I heard about this today, I could not stop thinking about the holiday photo of @RepThomasMassie & family last year.",
    "Parkland father Fred Guttenberg said this week that he believed that Republican politicians, including Florida Governor Ron DeSantis, bear some responsibility for Saturday's massacre at a Buffalo grocery store that is being investigated as a hate crime.",
    "Authorities identified Payton Gendron, a white 18-year-old, as the gunman accused of launching an attack on predominantly Black shoppers and workers at the Tops Friendly Market, killing 10 people and injuring three others, on Saturday afternoon.",
    "\"To make it worse, you have young people, like this person, who live in a world of white supremacy, that is certainly motivated and quietly encouraged by some of the same people who are posting themselves with those photos.\"",
    "\"Whether or not he's intentionally embracing it or not, in Florida, over the past few months, there have been multiple instances of white supremacists showing up and being really disgusting and evil,\" he said.",
    "But he was never charged with a crime and had no further contact with law enforcement after his release from a hospital following a mental health evaluation, according to The Associated Press.",
    "He pointed to a holiday photo of Kentucky Representative Thomas Massie and his family wielding guns, saying such \"troubling\" images influence young people to resolve issues with weapons.",
    " Fred Guttenberg (@fred_guttenberg) May 14, 2022\n\"The problem is, you can't pretend that we don't have a problem with easy access for guns to those who intend harm,\" he said.",
    "Guttenberg said he beleived politicians and lawmakers who have embraced the conspiracy theory and those who proudly wield guns in public have to assume blame for the attack.",
    "That revelation has raised questions about the missed opportunity to place Gendron under closer law enforcement scrutiny and ensure he did not have access to firearms.",
    "Guttenberg said numerous elected officials across the country are \"quietly\" embracing the dangerous rhetoric that apparently motivated the gunman, including DeSantis.",
    "\"The governor and his administration, rather than call it out and call it what it is, which is abhorrent, disgusting, despicable, and it has no place in Florida.",
    "\"There is absolute data and research that shows troubled young people are inspired by the imagery that they see of powerful people with guns,\" he said.",
    "As an example, he pointed to DeSantis' administration refusing to condemn neo-Nazi rallies that took place earlier this year.",
    "In June of last year, Gendron had been investigated after he threatened a shooting at his high school.",
    "\"The next person who wants to do this can very easily today, go acquire all the means to do it.",
    "\"There's consequences when you divide, when you try to push people apart,\" Guttenberg added.",
    "\"And we have these young people who, unfortunately, think they can solve issues this way.",
    "It's an attack on the reality [of] gun violence and we need to attack that problem.\"",
    "Newsweek has reached out to Massie's office and DeSantis' spokeswoman for comment.",
    "\"There are going to be others who take that to another level.",
    "We must deal with the reality of easy access to weapons.",
    "They instead said, 'Oh, those aren't our people.",
    "This is not an attack on the Second Amendment.",
    "\"We have a gun problem in America,\" he said.",
    "This is not an attack on gun owners.",
    "We don't know anything about it.'\"",
    "And that happened [on Saturday.]\"",
    "There are consequences.",
    "They can't,\" he added."
  ]
}