{
  "id": 3554,
  "mediaId": 136,
  "date": "d2022-05-16T10:05",
  "headline": "Fauci's Refusal To Work With Trump Again Delights MAGA Supporters",
  "image": "https://d.newsweek.com/en/full/2038106/fauci-cnn-interview-trump.webp?w=790&f=1d1015d23a0fa8a5ffe98588eefaf889",
  "link": "https://www.newsweek.com/facui-trump-white-house-covid-maga-1706846",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    661,
    1053,
    1082,
    1147,
    1304,
    2348,
    4138,
    336,
    2672
  ],
  "sentences": [
    "Fauci laughed off the suggestion that he would remain in his White House role if Trump returned as president or that he would have any confidence Trump would be able to deal with COVID-19, or another potential pandemic, during an interview with CNN's Jim Acosta on Sunday.",
    "Elsewhere, Jim Pillen, who recently beat the Trump-backed Charles Herbster in the Nebraska gubernatorial primary, also released an anti-COVID restrictions advert which featured him holding a rifle dressed in full hunting gear, saying \"don't get me started\" on Fauci.",
    "Georgia congresswoman Marjorie Taylor Greene has frequently called for Fauci to be fired or have his salary be reduced to nothing over his handling of the pandemic and for not publicly supporting the disputed claim the virus emanated from a lab in Wuhan, China.",
    "In March, Ohio congressman Jim Jordan said that a GOP-controlled House should investigate \"all the lies\" and misinformation Fauci is accused of giving about the origins of the coronavirus if the party regains the chamber after November's midterms.",
    "\"I can tell you I take no pleasure at all in being in a situation of contradicting the president, so it was really something that you didn't feel you could actually say something and there wouldn't be any repercussions about it,\" Fauci said.",
    "In January, Florida Governor and top Trump ally Ron DeSantis released a political ad in which he suggested Fauci should \"pound sand\" over the apparent contradictory advice Fauci offered throughout the pandemic.",
    "Despite a number of restrictions being lifted across the country, Fauci is still being targeted by MAGA political candidates ahead of the midterms who are hoping to turn the anger towards Fauci into votes.",
    "Fauci, who is also director of the National Institute of Allergy and Infectious Diseases, has long been a target by conservatives during the COVID-19 pandemic, especially during the Trump presidency.",
    "Several of Trump's allies have since shared a clip of the interview on social media, suggesting that Fauci has now given people a reason to vote for Trump should he choose to run again in 2024.",
    "A number of Donald Trump supporters have rejoiced after Dr. Anthony Fauci said he would leave his role as the White House chief medical adviser if the former president wins the 2024 election.",
    "T.J. Moe, a former NFL receiver turned media personality, said: \"Fauci has so little self awareness, he doesn't know that he just single-handedly added additional Trump voters.\"",
    "tweeted the former president's eldest child, Donald Trump Jr.\nConservative radio host Bryan Fischer tweeted Fauci's remarks are \"huge, mondo reason to vote for Trump in 2024.\"",
    "\"The idea that you can get up here and talk about what you know, what the evidence and science is, and let the science speakit is somewhat of a liberating feeling.\"",
    "The White House adviser was also frequently criticized by conservative figures who wanted to see an end to guidelines and restrictions related to the pandemic.",
    "Kari Lake, an Arizona gubernatorial candidate who is endorsed by Trump, also suggested Fauci could face criminal charges while responding to the CNN interview.",
    "\"If you look at the history of what the response was during the administration, I think, you know, at best, you can say it wasn't optimal.",
    "In January 2021 after Joe Biden entered the White House, Fauci described how it was \"liberating\" to work under the new president.",
    "When Acosta clarified that Fauci would not serve with Trump again in the White House, Fauci replied: \"Right.",
    "Fauci frequently clashed with Trump as the then president downplayed the seriousness of the virus.",
    "\"Dr. Fauci has announced that he will NOT serve under President Trump during his second term.",
    "The Centers for Disease Control and Prevention has been contacted for comment.",
    "Well duh... it's pretty hard to hold an official position from behind bars.",
    "And I think just, history will speak for itself about that.\"",
    "\"As if we needed yet another reason to elect Trump!!!\"",
    "#ArrestFauci,\" Lake tweeted.",
    "\"No,\" Fauci said.",
    "For sure, yeah.\""
  ]
}