{
  "id": 3555,
  "mediaId": 302,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Time for Florida Democrats to grow a spine | Letters",
  "image": "https://www.tampabay.com/resizer//sHYQR680NO0ByTFNkY9BxbxayiE=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/MXXKZ5AZ7ZECPDXFJWYH7GU6JA.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/16/time-for-florida-democrats-to-grow-a-spine-letters/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3277,
    2661,
    5032
  ],
  "sentences": [
    "Government is mandating childbirth without putting into place the necessary health care that goes with it; has not provided adequate, qualified daycare to accommodate existing babies and children; and, as of this writing, is unable to keep infant formula on store shelves.",
    "The GOP handed them the biggest gifts ever, namely the recent Roe draft opinion, unfair redistricting, voter fraud, racism, white supremacy and gun ownership (in Florida) with no permits and training, just to name a few.",
    "Bruce Margolis, Lake Mary\nUnhelpful cartoon\nLisa Benson Editorial Cartoon | May 13\nLisa Bensons editorial indictment of President Joe Biden on inflation is misleading and ignorant.",
    "John J. Tischner III, Dunedin\nPreparing to raise kids\nLife after Roe v Wade | May 12\nIt is not a matter of putting the cart before the horse, there is no cart!",
    "L J Phillips, Brooksville\nCant be both ways\nSecretary of State Laurel Lee won praise for her oversight of state elections under Gov.",
    "Okay, I am a man, so maybe I dont understand all the talking points, but Florida law outlaws nearly all abortions after 15 weeks.",
    "Ron DeSantis | May 13\nThe headline said Secretary of State Laurel Lee won praise for her oversight of state elections under Gov.",
    "Perhaps, short of emptying our national oil reserve, Ms. Benson can suggest a solution that really addresses the problem?",
    "What about the claim that just because we dont have any evidence of ballot harvesting doesnt mean it didnt happen?",
    "Isnt that more than enough time for a pregnant woman to know if the conception was caused by rape or incest?",
    "I think we can all agree that the cost of fuel is the primary driver of inflation along with unabated greed.",
    "What about all the irregularities that prompted the governor to establish a voter fraud investigation unit?",
    "It is impossible for the Tampa Bay Times to post an abortion column that doesnt include the same rhetoric.",
    "Grow a spine\nForget the alleged coming Red Tide.? The Democrats should sweep these elections.",
    "(It) does not even allow exceptions for rape and incest? wrote guest columnist Alex Sink.",
    "Terrence S. Callahan, Crystal Beach\nThere you go again\nThere you go again.",
    "Parents are desperate now for these things and no answers are in sight.",
    "They should be hammering on these gifts? every day, 24 hours a day.",
    "Are these the alternative facts I keep hearing about?",
    "What about the fraud that went on in The Villages?",
    "Congress has not addressed these issues.",
    "They are a bunch of unorganized wimps.",
    "Get off your butts and get moving.",
    "Grow a spine, to put it mildly.",
    "Paul E. Ouellette, Spring Hill",
    "What is the matter with them?",
    "You cant have it both ways.",
    "Ron DeSantis.? Wait, what?"
  ]
}