{
  "id": 3558,
  "mediaId": 223,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "The Five Most Important Americans Alive Right Now, And The Missing Elephant In The Room",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/129/b5604365-8ec0-4f54-bf6a-31fb581d15ee.jpg",
  "link": "https://townhall.com/columnists/scottmorefield/2022/05/16/the-five-most-important-americans-alive-right-now-and-the-missing-elephant-in-the-room-n2607278",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Morefield",
  "authorUrl": "https://townhall.com/columnists/scottmorefield/",
  "termIds": [
    661
  ],
  "sentences": [
    "Whether its standing up to Covid fascism, decrying the concept of a Disinformation Governance Board? by pointing out that governments - including Republican-led ones - have been the biggest purveyors of disinformation, or doing everything he can to fight the the warmongers who ignore our own problems yet are more than happy to send billions we dont have to Ukraine, Rand Paul is by far the best and most important U.S. senator of this generation, if not the last century.",
    "But if Tucker hadnt spent years telling the truth - no matter the cost - and championing normal Americans while toppling shibboleths like pointless foreign wars, unfair trade, uncontrolled immigration, and cultural myths like systemic racism and gender theory, he would likely never have attained his current position and, with it, the love and dedication of millions of American viewers who count on him for unfettered truth and unapologetic analysis.",
    "While I understand the argument, I chose not to include our illustrious former president because, while he has certainly been important for the culture historically, the operative terms are right now.?\nSure, wed be in a real pickle without that key four years, especially the judges and SCOTUS justices, and I give Trump all the credit in the world, but to say he dropped the ball on Covid would be an understatement.",
    "In addition to having power on their own, whether through their massive platforms or money or positions they hold, the people on my list all play key roles in sparking the kinds of conversations that dont just perk up ears at dinner tables and water coolers, but change enough minds in ways that have the potential to change the culture and turn this country around in a positive way.",
    "View Cartoon\nSo now that you know what Im aiming for, here are - in no particular order - who I believe to be the five most important people in America right now:\nTucker Carlson\nIt would be downright crazy to leave off the anchor of the highest rated primetime show on the highest rated cable news network in the nation, so Tucker Carlson has a well deserved place on this list.",
    "And with Americans facing soaring inflation, record-high gas prices, a wide-open border, food shortages, a burgeoning bio-medical police state, rampant crime, and printing billions to fund non-relevant wars overseas, praising past achievements and settling old scores for an octogenarian former president seems just a trite petty, if not downright silly, at this point.",
    "Sadly, it would be one thing if it just stopped there, but the man continues to double and triple-down on reliving the 2020 election and propagating the myth that Operation Warp Speed saved millions of lives.? He also seemingly endorses some people - like Dr. Oz in Pennsylvania - simply because of their celebrity status and/or willingness to kiss the ring.",
    "When it comes to key issues like critical race theory, gender insanity, parental rights, Covid tyranny, and virtually anything else thats on conservatives radar right now, DeSantis doesnt just talk, he backs up his words with real actions that mean something for the people of the state hes running.",
    "Since nothing advances culture more positively than the kind of free speech and open debate leftists both hate and are deathly afraid of, a Musk acquisition of Twitter would rank right there at or towards the top of geopolitical earth shattering events this century.",
    "Instead of simply naming the most powerful people, or the richest, or the prettiest, or the most likely to find themselves in a drug-induced coma by the end of 2022, my purpose here is to list the five most important? people alive in America today.",
    "Joe Rogan\nJoe Rogan isnt even a conservative, but the left hates him all the same simply because he asks questions and is willing to have conversations that are uncomfortable for those who have a vested interest in maintaining the status quo.",
    "I mean, when you literally bring up a Johnson & Johnson heir at a rally, expecting crowd applause in the wake of ordinary Americans coming off the political fight of our lives against vaccine mandates, you might be a bit out of touch.",
    "Important? to the goal of advancing the Overton Window in a long-term direction thats generally good for conservatives and especially good for all people who love the kind of liberty that makes society and culture objectively better.",
    "Source: AP Photo/Gene J. Puskar\nTrending\nIf one were about to compile a list of the five most powerful Americans alive today, most of the names would be different from the ones youre about to read about below.",
    "When youre regularly having those conversations and doing it on the worlds biggest podcast platform, youre a mortal threat to the left, and thus a super important person in my book.",
    "Ron DeSantis started his role in the Covid-19 pandemic a bit slow, acquiescing to early lockdowns and restrictions and generally going along with the early prevailing narrative.",
    "However, libertarian-leaning Kentucky Sen. Rand Paul - son of the great former longtime Texas Rep. Ron Paul - is a bright, shining exception in a sea of ugly swamp creatures.",
    "Like no other media personality other than perhaps Rush Limbaugh, Tucker Carlson is moving the Overton Window in ways that make the system seeth and long to destroy him.",
    "Youd obviously find President Joe Biden at the top, because, feeble and brain-addled or not, the president of the United States is always the most powerful person alive.",
    "When we should be fighting todays demons and looking to the future, watching Trump its just hard not to get the impression that its all about him and his legacy.",
    "But when the data became clear to him, he acted swiftly and decisively, seizing and going on to maintain the upper hand from early birds like South Dakota Gov.",
    "Rand Paul\nAn argument can be made that most, if not nearly all, politicians dont live to their principles and dont truly care about the people they represent.",
    "Listen to this guy speak for more than 30 seconds and youll quickly realize he knows exactly what time it is, and he isnt afraid to let the world know it too.",
    "Elon Musk\nIf the lists being compiled were greatest business innovators, space pioneers or, obviously, richest Americans, Elon Musk would be at the very top.",
    "However, to make THIS list, the richest person in the world needed to do something truly audacious that would advance the culture in a positive way.",
    "Youd also see former President Donald Trump displayed prominently because he still commands wide support and plays kingmaker in GOP politics.",
    "Others, like House Speaker Nancy Pelisi and Senate Majority Leader Chuck Schumer, would obviously be included, as would Democratic Sens.",
    "We need leaders and influencers to take us forward, not backward, and right now, for me, these five people top the list.",
    "The most common complaint wasnt so much the people included, but the missing elephant in the room - Donald J. Trump.",
    "Joe Manchin (WV) and Kyrsten Sinema (AZ) because of their key role in holding back the excesses of the Biden agenda.",
    "As always, feel free to comment below with your thoughts and especially your own list if yours differs from mine.",
    "The opinions expressed by columnists are their own and do not necessarily represent the views of Townhall.com.",
    "If you follow me on Twitter, you might have seen a semi-viral thread I made on this topic a few days ago.",
    "There you have it, the five most important Americans alive right now, in my not-so-humble opinion.",
    "In an ideal world, this guy would already be the GOP presidential nominee frontrunner going away.",
    "IF it happens, of course, and IF he sticks to and is able to accomplish his stated goal.",
    "Unfortunately, whether or not that happens is not up to him at this point.",
    "Kristi Noem by also taking real action to combat the ongoing cultural rot.",
    "Which means he is very much over the correct target.",
    "But this is a different list.",
    "Ron DeSantis\nFlorida Gov.",
    "Important how?? you ask.",
    "Great question!"
  ]
}