{
  "id": 3559,
  "mediaId": 19,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Nolte: Pro-Grooming Disneys Favorability Rating Plummets 53 Points In One Year",
  "image": "https://media.breitbart.com/media/2022/04/15disneylgbtq1-640x480.jpg",
  "link": "https://www.breitbart.com/entertainment/2022/05/16/nolte-pro-grooming-disneys-favorability-rating-plummets-53-points-in-one-year/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Nolte",
  "authorUrl": "https://www.breitbart.com/author/john-nolte/",
  "termIds": [
    661
  ],
  "sentences": [
    "Disney has declared war on Americas children with a stated crusade meant to sexualize innocent children with gay porn and transsexual propaganda, Disney is now looking violate the innocence of children and twist normal, healthy kids into the kind of confused, sexualized, and damaged neurotics child rapists prey on.",
    "Statement from The Walt Disney Company on signing of Florida legislation: pic.twitter.com/UVI7Ko3aKS\n Walt Disney Company (@WaltDisneyCo) March 28, 2022\nIn a poll released over the weekend, NBC found (and hid) the fact that Disneys net favorability rating has crashed 53 points to a devastating +3.",
    "Oh, but what a difference a year makes, a year filled with Disney coming out of the closet to openly advocate for schools to sexually groom prepubescent children with gay porn and anti-science transsexual voodoo.",
    "So heres the rundown of Disneys net favorability rating since 2017 For those not familiar with the polling lingo, net favorability simply subtracts your unfavorable rating from your favorable rating.",
    "About 14 months ago, Public Opinion Strategies found that Disney still had a very favorable image among Americans?  a net favorability rating of +56 (77% favorable/21% unfavorable).",
    "The internals are no longer available for this 2017 Morning Consult poll but we do know that five years ago, Disneys net favorability rating was a very healthy +63 percent.",
    "NBC found that only 33 percent of those polled had a positive opinion of Disney, while 30 percent felt unfavorably towards the degenerate child grooming company.",
    "Disney is supposed to protect the innocence of children, is supposed to create content that helps children to grow into healthy, stable, confident adults.",
    "When youre a once-universally beloved multinational corporation that is now barely polling better than a politician, what more is there to say?",
    "On the flipside, if 80 percent view you unfavorably and 17 percent view you favorably, your net favorability is -63 points.",
    "If 17 percent of the public view you unfavorably and 80 percent view you favorably  your net favorability is +63 points.",
    "Ron DeSantis (R-FL), but heres the thing\nThe child grooming degenerates at the Walt Disney Co. are in serious trouble.",
    "And this is a national poll where Disney has close to 100 percent name recognition and 31 percent dont know DeSantis.",
    "In a new poll, far-left NBC News buried a devastating find about the shameless child grooming degenerates at Disney.",
    "As I said above, some outlets are dishonestly spinning this as a win for Disney, which is beyond pathetic.",
    "And unless theres a full-scale enema over there, that company of sickos hasnt even begun to finish paying.",
    "Disney has made no secret of its child abuse agenda, and now it is paying a steep price.",
    "No corporation, especially a corporation like Disney, wants to poll like a politician.",
    "Along with its brand, the stock has tanked from $156 one year ago to just $107 today.",
    "Other outlets dishonestly reported on the find as some sort of triumph over Gov.",
    "Rather than report out Disneys favorability crash, NBC ignored it altogether.",
    "DeSantis, who sits at +2, 28 percent favorable, 26 percent unfavorable.",
    "But this is exactly what these sick, child abusers deserve.",
    "A fall from a +56 to just a +3 in one year.",
    "Well, over the last year, Disney did a 180.",
    "Thats only a single point better than Gov.",
    "Those numbers are fine for a politician.",
    "The brand has been smashed to pieces.",
    "They are death for a corporation."
  ]
}