{
  "id": 3562,
  "mediaId": 98,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Todays Headlines: Churchgoers hogtied gunman after deadly Laguna Woods shooting",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/85ad748/2147483647/strip/true/crop/4032x2688+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc3%2F3e%2Fee5f52d94d1086904dd665d5ef23%2Fimg-6431.jpg",
  "link": "https://www.latimes.com/world-nation/newsletter/2022-05-16/laguna-woods-church-shooting-todays-headlines-newsletter-todays-headlines",
  "sentiment": "0.0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Buffalo shooting is investigated as racially motivated violent extremism\nAs Buffalo residents expressed anger and grief over the mass shooting that left 10 people dead at a grocery store in a predominantly Black neighborhood, local and federal officials said they were investigating the attack by a young white gunman as a hate crime and an act of racially motivated violent extremism.?\nAuthorities said that the suspect researched the demographics of the neighborhood around the Tops Friendly Markets store while looking for places with a high concentration of Black residents.",
    "Gavin Newsom provided few details in his revised budget blueprint for how he plans to fund a sweeping proposal to use the courts to order treatment for homeless individuals with severe mental illness and addiction, although he insisted there are billions of dollars available to start implementing his plan.",
    "By Elvia Limn\nHello, its Monday, May 16, and here are the stories you shouldnt miss today:\nTOP STORIES\nChurchgoers hogtied gunman after deadly Laguna Woods church shooting\nOne person was killed and five others were wounded after a gunman opened fire on a Taiwanese church congregation in Laguna Woods.",
    "McCoy denied the allegations, and the Los Angeles County district attorneys office declined to file charges last August, citing insufficient evidence in a case it referred to as he said, she said domestic violence.?\nOPINION\nThe Buffalo gunman emerged from a far-right ecosystem thats gone mainstream.",
    "Finland and Sweden seek entry into the NATO alliance\nSignaling a new era,? leaders of Finland and Sweden said the Nordic nations plan to seek membership in the North Atlantic Treaty Organization, a move almost certain to escalate geopolitical tensions arising from the Russian war in Ukraine.",
    "ONLY IN CALIFORNIA\nDuring Ramadan this year, cars often double-parked in front of an IHOP franchise in Fullerton before dawn, as members of the Muslim community assembled, hoping to have halal chicken tenders or turkey-bacon omelets as their suhoor meal before fasting for the day.",
    "Market experts say two main factors are driving the recent slump in the cryptocurrency market: moves by the U.S. Federal Reserve to combat high inflation and stabilize markets, and the implosion of terraUSD, a type of so-called stablecoin.",
    "Senate Bill 1401, named the College Athlete Race and Gender Equity Act,? would require California schools to share 50% of annual revenues in football and mens and womens basketball with the athletes, initiating a new era of pay for play.",
    "The shootings came one day after a night of violence in which 21 people were shot and wounded in three attacks near the Fiserv Forum in downtown Milwaukee as the Bucks lost to the Boston Celtics in Game 6 of their NBA playoffs series.",
    "As L.A. Countys coronavirus cases continue to climb, infections are rising fastest among wealthier residents, a likely echo of previous waves in which a greater rate of higher-income people became infected with the virus first.",
    "Having dealt a number of significant if limited setbacks to Moscows forces, Ukraine expressed renewed optimism over its conduct of the war and the wider ramifications  not the least of which is the likelihood of a larger NATO.",
    "The violence left the south Orange County suburb  home to the sprawling retirement community once known as Leisure World  reeling and in grief, coming a day after a racist attack at a Buffalo, N.Y., supermarket left 10 dead.",
    "The organizations include the Basque separatist group ETA, the Japanese cult Aum Shinrikyo, the radical Jewish group Kahane Kach and two Islamic groups that have been active in Israel, the Palestinian territories and Egypt.",
    "Her involvement has pulled Sheriff Alex Villanueva into low-level matters better suited for his subordinates to handle, they said, while also tipping the scales on more important issues including promotions and transfers.",
    "Francis, 85, took a lengthy, seated popemobile ride around St. Peters Square and the boulevard leading to it to greet some of the tens of thousands of people who came out to celebrate the Catholic Churchs newest saints.",
    "The stunning revelation, which comes just two days before Pennsylvanias primary election, creates deep uncertainty for Democrats in a state that represents one of their best Senate pickup opportunities in the nation.",
    "More top coronavirus headlines\nTo Kevin Deegan, Holy Cross Medical Centers senior chaplain, the hospital contains sacred places, where profound, heartbreaking and loving things occurred as the pandemic took hold.",
    "The most intriguing politician in the Republican Party is Ron DeSantis, an uncharismatic governor whos trying to make the GOPs culture war appealing to suburban mothers, writes Washington columnist Doyle McManus.",
    "Some have called for more police walking the streets, while others said the city should instead direct resources toward community services\nAs the baby formula shortage worsens, families take desperate steps.",
    "Payton Gendron, 18, of Conklin, N.Y., who has been charged with first-degree murder, drove from about 200 miles away and arrived in Buffalo at least a day in advance to conduct reconnaissance, police said.",
    "During a recent news conference to unveil his $300.6-billion budget for 2022-23, Newsom said he has in recent years funneled billions into the services and housing necessary to make CARE Court successful.",
    "The commotion this year made one thing clear to Mohammad Ashraf, the owner of the Fullerton franchise, who is Muslim: His annual Ramadan-only menu of halal specials would have to stay, year-round.",
    "A CARE Court plan might include medication and mental health services to stabilize a participant for up to two years, along with a plan for housing, a public defender and a personal advocate.",
    "With coronavirus cases continuing to rise in some parts of California, the big question is when some local governments may decide when a wave is big enough to intervene with new rules.",
    "More politics\nLike LGBTQ people nationwide, I cant help but worry that the legal logic that might topple Roe will be used against my marriage,? writes The Times Kevin Rector.",
    "These are the elements of what psychologists commonly recognize as contributing to a midlife crisis.? The Great Resignation, it turns out, is really the Great Midlife Crisis.",
    "If youre a fan of this newsletter, youll love our daily podcast The Times,? hosted every weekday by columnist Gustavo Arellano, along with reporters from across our newsroom.",
    "In California, Los Angeles County weeks ago outlined a scenario in which the Department of Public Health would reinstitute a universal mask order in indoor public settings.",
    "Yet many right-wing politicians, including Republicans in Congress, still try to deflect meaningful conversations about white supremacy and domestic terrorism.",
    "But its also won over some trans listeners for being wrenchingly accurate about this cis, straight Black mans path to a fuller understanding of his relations.",
    "After more than half a century as one of musics biggest acts, Sir Paul has an earnest charm that remains his superpower, pop music critic Mikael Wood writes.",
    "But in the land of multimillion-dollar homes, the question of water conservation plays out differently than in the neighborhoods where the rest of us live.",
    "The song has already antagonized some listeners with its pointed use of anti-gay slurs and other purposefully ugly language around gender and sexuality.",
    "One in five California Airbnb short-term rental properties are in wildfire-prone areas, yet the company provides no warnings or evacuation information.",
    "McCoy was arrested July 24 after an alleged incident with his ex-girlfriend at his off-campus residence that prompted her to seek medical attention.",
    "It remains far from meeting its own metrics for reissuing a mask order, but a moderate increase in coronavirus case rates has officials concerned.",
    "Manuel Garcia-Rulfo opens up to The Times about childhood summers in Jalisco, quitting acting and bringing cultural specificity to his character.",
    "The Newsom administration has called on the Legislature to quickly pass the new budget proposal, so the governor can sign it into law by July 1.",
    "MLB is mulling rule changes, but it has been a slow and painful process agreeing to innovation the league knows it needs to attract more fans.",
    "Tom Kottmeier, a 76-year-old San Marcos resident, is a Swede with a lifelong passion for boating and a deep fascination with Viking culture.",
    "Sign up for our California Politics newsletter to get the best of The Times state politics reporting and the latest action in Sacramento.",
    "A general manager frantically took orders outside with a pen and paper in an effort to ensure everyone could be served before sunrise.",
    "Its unclear whether the pace of new infections will accelerate, remain steady or has actually started to crest and begun to decline.",
    "The Orange County Sheriffs Department said it detained the suspect and recovered two commercially available handguns from the scene.",
    "OUR MUST-READS FROM THE WEEKEND\nVivian Villanueva  wife and confidant  holds sway in the L.A. Sheriffs Department, officials say.",
    "Los Angeles police are continuing to search for the gunman who fatally shot a man outside Grand Central Market over the weekend.",
    "In South L.A., more than 70% of babies are formula-fed; on the Westside, roughly the same proportion receive only breast milk.",
    "Bob Hertzberg, Lindsey Horvath and Henry Stern are the main candidates in the Los Angeles County District 3 supervisors race.",
    "Officials said a group of churchgoers hogtied? the shooters leg with an extension cord and took two weapons from the suspect.",
    "The move would significantly alter the transatlantic security architecture in existence since the end of World War II.",
    "Newsom in early March announced his Community Assistance, Recovery and Empowerment Court program, known as CARE Court.",
    "More than 20 current and former sheriffs officials said Vivian Villanueva exerts real influence within the department.",
    "Wald had been at Montefiore New Rochelle Hospital in Westchester, N.Y. since suffering a massive stroke Sunday night.",
    "FROM THE ARCHIVES\nEighty years ago this month, the Womens Army Auxiliary Corps was created out of wartime necessity.",
    "He livestreamed the massacre with a helmet camera, shooting 11 Black people and two white people, authorities said.",
    "The shooting happened inside Geneva Presbyterian Church during a lunch banquet following a morning church service.",
    "L.A. County has continued to strongly recommend all residents age 2 and over wear masks in indoor public settings.",
    "Plane crashes, close calls and pollution prompt residents in Pacoima to call for the closure of Whiteman Airport.",
    "This enabled women to serve in noncombat positions, thus freeing more men to meet the demand for combat troops.",
    "As an icon, what McCartney gets is that people crave art that makes magic from their everyday experiences.",
    "Some, finding no available tables, would eat out of plastic foam containers while sitting on the curb.",
    "The race should be highly competitive and the three have been closely matched in financial resources.",
    "In July 1943, the name was changed to the Womens Army Corps and was converted into the regular Army.",
    "The crisis has been deepening for months, as millions of parents scramble to feed their children.",
    "Many who have left their jobs were looking for more respect and meaning, a trend that continues.",
    "Trans fans praise Kendrick Lamar for his allyship and activism on the new Auntie Diaries track.",
    "Newsoms new California budget offers few details on costs for court-ordered homeless help\nGov.",
    "HOLLYWOOD AND THE ARTS\nOn the cusp of 80, Paul McCartney is still our most charming rock god.",
    "?\nWhy it takes so long for MLB to change rules: the battle between tradition and innovation.",
    "CALIFORNIA\nAfter plane crashes and close calls, pressure mounts to close this L.A. airport.",
    "Get the day's top news with our Today's Headlines newsletter, sent every weekday morning.",
    "Yes, one of the most severe droughts in California history even hits Kardashian country.",
    "NATION-WORLD\nThe U.S. is set to remove five groups from the foreign terrorism blacklist.",
    "In Californias high-risk fire country, Airbnb offers guests no warning or escape plan.",
    "Download and listen on our App, subscribe on Apple Podcasts and follow on Spotify.",
    "His dream is to sail his ship up Swedens Gta Canal to Stockholm harbor in 2024.",
    "Of the five who were wounded, four sustained critical injuries, officials said.",
    "How Netflixs Lincoln Lawyer pushed for more of L.A.s Latino life in the show.",
    "Initially, none was provided with life insurance or veterans health benefits.",
    "You may occasionally receive promotional content from the Los Angeles Times.",
    "A handmade replica Viking ship takes shape in a San Diego County backyard.",
    "Aviation enthusiasts say the airport is critical for training new pilots.",
    "It also gave women pay and benefits equal to their male counterparts.",
    "Richard Wald, veteran TV news executive for ABC and NBC, dies at 92.",
    "The Grand Central Market shooting rekindles a debate over policing.",
    "Pennsylvania Senate candidate John Fetterman says he had a stroke.",
    "Three were fatally shot in Milwaukee after a night of violence.",
    "He died at the hospital Friday morning, his son Jonathan said.",
    "We appreciate that you took the time to read Todays Headlines!",
    "More than 150,000 women served as WACs during World War II.",
    "However, women who served tolerated immense discrimination.",
    "How close is California to new mask rules and restrictions?",
    "A Q&A on bitcoin, luna and other falling cryptocurrencies.",
    "But low-income mothers have been hit particularly hard.",
    "If they died, their parents received no death benefits.",
    "Pope rallies from knee pain to proclaim 10 new saints.",
    "Who will succeed L.A. County Supervisor Sheila Kuehl?",
    "A wealthy L.A. enclave copes with water restrictions.",
    "Feel free to drop us a note at headlines@latimes.com.",
    "California is going for the knockout with new bill.",
    "How COVID created a universal midlife crisis.",
    "SPORTS\nThink NIL blew up college sports?",
    "Court filings offer some answers.",
    "BUSINESS\nWhy is crypto crashing?",
    "Why did Bru McCoy leave USC?",
    "Go beyond the headlines.",
    "What about my koi pond?",
    "Millennials vs. boomer.",
    "More cops downtown?",
    "Comments or ideas?"
  ]
}