{
  "id": 3575,
  "mediaId": 188,
  "date": "d2022-05-16T00:00",
  "headline": "'Sending unruly mobs to private residences ... is inappropriate': Florida Gov. DeSantis signs measure that prohibits participating in protests outside homes with the intent to disturb residents",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTgxMjI1OC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwNjc5OTc2NH0.2bWUmR5Fq4sVF01xA0rQrdQwF9k9Q-NPrLsHsVcf9Xo/img.jpg?width=1245&quality=85&coordinates=0%2C77%2C0%2C74&height=700",
  "link": "https://www.theblaze.com/news/desantis-law-protest-outside-homes",
  "sentiment": "0.0",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Nitzberg",
  "authorUrl": "https://www.theblaze.com/u/alexnitzberg",
  "termIds": [
    661,
    1761,
    2305,
    482,
    562,
    3520,
    2661
  ],
  "sentences": [
    "\"Charlie was referring to the toothless, spineless crowd that aids and abets DeSantis's crusade to hurt, rather than help Floridians - the legislators, lobbyists, and special interests who bend to his whims and only care about delivering red meat for their base,\" Crist's press secretary Samantha Ramirez said, according to the Sarasota Herald-Tribune.",
    "U.S. Rep. Charlie Crist, who is one of the Democratic candidates vying for the opportunity to face off against DeSantis during the upcoming gubernatorial election, said last month that DeSantis seeks to appeal to a \"hard right, toothless crowd.\"",
    "\"Sending unruly mobs to private residences, like we have seen with the angry crowds in front of the homes of Supreme Court justices, is inappropriate,\" DeSantis said, according to a press release.",
    "Crist previously served as governor of Florida from early 2007 until early 2011  he was elected as a Republican in 2006, but lost a 2010 U.S. Senate bid while running as an independent.",
    "Under the law, if people engage in a demonstration outside a residence, authorities will issue a warning to disperse before moving to arrest the protesters.",
    "Ron DeSantis signed legislation on Monday that will prohibit protesting outside a residence with the goal of disturbing those who live there.",
    "Prior to serving as governor, DeSantis served in the U.S. House of Representatives as a lawmaker from the Sunshine State.",
    "\"This bill will provide protection to those living in residential communities and I am glad to sign it into law.\"",
    "DeSantis, an incumbent Republican governor, is running for a second term in office.",
    "Crist ran for governor as a Democrat in 2014 but lost to incumbent GOP Gov.",
    "He has become an enormously popular figure among conservatives.",
    "The measure will go into effect later this year on Oct. 1.",
    "Breaking the law represents a second-degree misdemeanor.",
    "\"To imply that he meant anything else is nonsense.\"",
    "Florida Gov.",
    "Rick Scott."
  ]
}