{
  "id": 3581,
  "mediaId": 136,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Can Val Demings Defeat Marco Rubio and Overcome Democrats' Florida Malaise?",
  "image": "https://d.newsweek.com/en/full/2027989/former-nato-secretary-general-anders-fogh-rasmussen.jpg?w=397&h=265&l=71&t=44&f=948235e1a63379aa770e7342999a74f0",
  "link": "https://www.newsweek.com/2022/05/27/can-val-demings-defeat-marco-rubio-overcome-democrats-florida-malaise-1703538.html",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adrian Carrasquillo",
  "authorUrl": "https://www.newsweek.com/authors/adrian-carrasquillo",
  "termIds": [
    661,
    971,
    1572,
    2305,
    2418,
    2505,
    4243,
    146,
    562,
    2661,
    2851
  ],
  "sentences": [
    "The data-first group Mi Vecino (my neighbor in Spanish) was co-founded in the aftermath of Democratic underperformance in the state in 2020 by Puerto Rican and Cuban organizer Alex Berrios, who feels his background as a former boxer helps dispel the broad-brush meme of the latte-sipping liberal, and Devon Murphy-Anderson, the no-nonsense former finance director of the Florida Democratic Party, who has raised $1.5 million for the group and wields voter data as a sword and shield to illustrate the story of why Democrats need to do more in a changing Florida.",
    "Media reports forecast the problem months before, first in the summer from The New Republic, which described \"a cavalier attitude toward Latino voters\" from Nelson, who did not advertise during the World Cup, while Scott spent $700,000 to air an ad every day of the tournament, reaching hundreds of thousands of Florida Latinos, and from TIME in the fall, which said there was \"no question that Scott is outhustling Nelson in Latino communities across Florida.\"",
    "During the 80-degree Saturday, where some parade goers began grabbing seats by a stage near speakers playing upbeat songs by bands such as DLG, a New York City group popular for its Spanglish crooning in the 90's, and others took to seats in the shade offered by downtown buildings, political groups and Newsweek both encountered a similar problem on a pleasant afternoon outside: few people wanting to engage on the thorny issue of politics.",
    "Demings has also bucked Joe Biden on certain Latin America policies such as opposing efforts to import oil from the \"socialist\" Maduro regime in Venezuela, opposing delisting FARC in Colombia as a terrorist organization, and calling on Biden to grant temporary protected status to Venezuelans  all issues that could make Venezuelans, Colombians, and other Floridians from Latin America take notice.",
    "Since Demings was on Joe Biden's vice presidential shortlist, supporters have maintained that her unique and powerful story as a former police chief was the \"secret sauce\" to a shocking upset, but the Mi Vecino founders don't think it matches what they see on the ground from Floridians who are \"solely focused\" on how to make ends meet, putting food on the table, rising rent, and gas prices.",
    "\"We all want the same things in terms of access to health care, we want a fair shot, we want affordable housing, we want to be able to take care of our families,\" she continued, \"but we also know that the issues, whether it's Cuban-Americans or Venezuelans or it's Colombians or Puerto Ricans, there are also separate issues that affect those different communities.\"",
    "That's why he told Newsweek afterwards that Demings missed an opportunity to talk about Puerto Rico on stage, especially after the Supreme Court ruled island residents who are U.S. citizens could continue to be excluded from the Supplemental Security Income (SSI) program, perpetuating what many feel is a century of colonialism and unequal status.",
    "At the end of April, the campaign announced what it sees as an initial salvo, a $3 million investment in One Future Florida, a bilingual coordinated campaign in conjunction with the Florida Democratic Party aimed at traditional field efforts for Democrats up-and-down the ballot, including text message programs, door-knocking, and phonebanking.",
    "\"The only reason Scott beat Nelson was due to his overperformance with Hispanics,\" a Florida veteran of Democratic campaigns told Newsweek, before imagining how the landscape of the Senate and the Biden administration would be transformed if Nelson was the 52nd Democratic vote instead of the tenuous majority the party currently holds.",
    "With the saccharine sounds of Pitbull and Christina Aguilera's poppy \"Feel This Moment\" playing, Orlando state senator Victor Torres introduced U.S. Representative Val Demings to the crowd at the launch of \"Todos con Demings\" in downtown Orlando, Florida, in late-April as part of her Senate campaign's efforts to engage Latino voters.",
    "In the aftermath of the blockbuster report that the Supreme Court was set to roll back Roe v. Wade and federal protection for abortions, the owners of the Miami New Drama theater company put up a new message on the Colony Theater marquee where the play runs: \"For 50 Percent of Americans The Clock Just Went Back 50 Years.\"",
    "Against a backdrop of modern gothic decor in The Abbey theater and aluminum trays full of steaming Puerto Rican staples like pasteles and plantains, Demings, the former Orlando police chief who represents Florida's 10th congressional district, a nearly three-decade veteran of the police department, got down to business.",
    "Murphy-Anderson also shared data with Newsweek showing that while roughly 84,000 Republicans have become \"no party affiliation\" voters since the 2020 election and more than 87,000 Democrats have done so, it represents 21% voters of color for the GOP, but a majority 55% voters of color among Democrats leaving the party.",
    "Making a volleyball reference, he said the moment would have been \"an easy kill\" for Demings, who could have said, \"Two days ago the Supreme Court ruled to continue discriminating against Puerto Ricans and I'm going to be the senator from Florida and make sure Puerto Rico has the same rights as other citizens.\"",
    "That \"foolishness\" could be the peripheral noise that plagues U.S. political discourse during a time Demings and Democrats see as urgent, but in Florida, where Republicans have been on the march over the past decade, it could also be used to describe failed Latino outreach efforts by Democrats in recent cycles.",
    "While Demings called the ruling \"unfair\" in a statement, saying it meant \"that roughly 300,000 aging, low income, and disabled Americans will continue to be treated like second-class citizens,\" she did not expand in comments on stage in front of activists and community members, in heavily Puerto Rican Orlando.",
    "For a campaign that doesn't have to do much to be better than its predecessor, the optics looked good for Demings in downtown Orlando in April, with predominantly Black and Latino campaign staff in the room, including respected Latina operatives and activists the campaign has brought on in senior roles.",
    "While both he and Democratic gubernatorial candidate Andrew Gillum lost that year with exit polls showing each receiving a lower than expected 54% of the Hispanic vote, Nelson's campaign was the one publicly and privately assuring reporters and gloomy Democrats that he had no Latino problem, whatsoever.",
    "After visiting Puerto Rico and chairing the House subcommittee on Emergency Preparedness, Response and Recovery, Demings saw how poor the response was to the aftermath of Hurricane Maria, which flattened the island during the Trump administration, and \"we still have not finished that work,\" she said.",
    "Rubio, who was an architect of the Paycheck Protection Program, which provided $500 billion in loans to businesses during the height of the pandemic in April-May 2020, also helped pass Veteran's Affairs reforms, and said he has passed so many laws against China they imposed sanctions against him.",
    "More than 200 miles away on Lincoln Road in Miami Beach, another aspect of the Latino vote was on display, but it's not very difficult to ascertain the politics of those involved with the new \"The Cuban Vote\" play, which began its late-April run just days before the parade in Orlando.",
    "\"We wonder why we keep hemorrhaging the Hispanic vote in Florida, exhibit A,\" Democratic gubernatorial candidate Annette Taddeo told Newsweek of the lack of her party's presence at the parade, after posing with Demings and her husband, Orange County mayor Jerry Demings.",
    "With pulsing perreo from artists such as Puerto Rican wunderkind Bad Bunny offering up a soundtrack to the festivities, one progressive group helped showcase the work Democrats need to invest in in Florida, while contextualizing the scope of the challenge facing them.",
    "\"I have always walked and talked with different communities and asked them what they need, what do they believe is important, where are we falling short, whether that was as a police chief, or now as a member of Congress or a candidate for the U.S. Senate,\" she added.",
    "The campaign's approach has been informed by meetings and roundtables since February, including meeting with Cuban-American leaders in Tampa and Miami, touring a Puerto Rican community health clinic in Miami, and meeting with Venezuelan leaders in Pembroke Pines.",
    "While Taddeo is running in a crowded primary field featuring U.S. Representative Charlie Crist and Agriculture Commissioner Nikki Fried, she believes her presence and Demings on the same ticket would help rebuild the coalition Democrats need to win in the state.",
    "Otero-Santiago, who is leading the \"Todos Con Demings\" effort, told Newsweek the campaign has a Latino advisory council with more than 200 surrogates, something Democrats desperately need to compete against Republicans on contested Spanish-language airwaves.",
    "\"Sometimes we make a couple of mistakes  number one I think elected officials come in with their agenda and they tell the people, 'This is what we think you need,\" Demings told Newsweek after stepping off stage as salsa music played after her Orlando event.",
    "Looking towards the top of the ticket, Democrats have privately acknowledged that while Republican Governor Ron DeSantis will likely sail to reelection, they see Demings as someone who has a shot at defeating Rubio, no matter how difficult the fight.",
    "The Sunshine state went from a 0.9% Democratic voter registration advantage in October 2020, when the party was barreling towards a decisive loss, to a 0.6% Republican advantage in February 2022, according to Florida data consultant Matthew Isbell.",
    "Still, he knows of and likes Demings and her husband, and said she would do a better job taking care of the interests of Florida than Rubio, whom he believes \"leans too much to the right,\" having seen him up close when he lived in Miami for years.",
    "John, a 53-year-old Puerto Rican who works in sales, said his family has achieved the American Dream with a house in Seminole, and cares for the poor in the community, but they aren't very much into politics, especially given the last four years.",
    "The parade  which featured vendors selling trinkets from the island, street food such as alcapurrias and sizzling chicken and pork chunks on a stick, and the ever-present Puerto Rican flag  wasn't back to its pre-pandemic glory, attendees said.",
    "That's why Democrats, Republicans and politically affiliated nonprofits descended on the April 23 parade in downtown Orlando, walking the streets as onlookers cheered, setting up stalls to register voters, hand out bumper stickers, and more.",
    "One of the play's signature lines is that \"Miami is always the first draft of national politics,\" while offering a playful yet damning caricature of local politics, and beckoning for a new brand of politics it hopes is not yet out of reach.",
    "\"The difference between Marco Rubio and me, I don't assume that African American voters are going to support me because I'm African-American,\" she said, noting that earlier in April she visited Gadsden County, which is 55% African-American.",
    "\"People think voters of Hispanic descent, their primary identity is the fact that they're Hispanic,\" Rubio said, \"when their primary identity is as small business owners, as members of the middle class who are trying to make things work.\"",
    "The first statewide races in Florida after the contentious 2020 election are an opportunity for Democrats to see if they can turn back losses with Latinos and compete in a swing state that has become increasingly more red with each cycle.",
    "\"When she decided she wanted to be Biden's VP, she was openly campaigning, the criticism from the left was her time as police chief and instead of supporting police, she went on TV and said it was 'thoughtful,' defunding the police.\"",
    "Florida Democrats, she said, make the mistake of dividing the state into three groups: white voters, African-American voters, and Latino or Hispanic voters, when the politics of those constituencies is not that easily categorized.",
    "In a full year of door-knocking, canvassers have not written down Demings or Rubio's names once, Murphy-Anderson told Newsweek, which is bad news for Demings in a race where Rubio already starts with much higher name recognition.",
    "Asked about the Minneapolis City Council's efforts to do away with its police department, Demings said people have a right to look at proposals that are a direct result of people being hurt and angry over what happened to Floyd.",
    "Still, Horacio Sierra, a college professor active in the Cuban-American Democratic community sees an opening even among traditional Republican-voting Cubans like his abuela, or grandmother, who asks of Rubio, \"What has he done?\"",
    "They include Sheyla Asencios, who helped elect Puerto Rican Representative Darren Soto to the state senate at the beginning of her political career before his election in the 9th congressional district in Kissimmee and Orlando.",
    "In Demings, 65, Democrats see a candidate with a law enforcement background that plays well with Latinos who care about public safety, while the incumbent Rubio faces charges that he hasn't done enough in a gridlocked Senate.",
    "Meanwhile, Republicans with the state party and conservative LIBRE initiative each had one, handing out Governor Ron DeSantis merchandise and Puerto Rico shirts with a QR code taking them to the LIBRE website, respectively.",
    "It's going to take \"us thinking like Georgia did, where candidates help each other with their strengths,\" she concluded, pointing to the January 2021 Senate runoff where Jon Ossoff and Raphael Warnock ran in tandem and won.",
    "It's part of her campaign's unsubtle focus on making sure voters, especially Hispanics, know Demings spent 27 years in law enforcement, and they're quick to note she oversaw a 40% drop in violent crime as police chief.",
    "Latinos, who comprise 26% of the Florida population and were a record 17% of registered voters in 2020, will be front and center again in November, in a state that is becoming tougher and tougher terrain for Democrats.",
    "But he also helped coordinate aid after Hurricane Maria and because of doctors fleeing a battered Puerto Rico, the first appointment his diabetic brother can get with an endocrinologist is slated for August 2023.",
    "Of Puerto Rican descent, he attended high school in Orlando and has lived there since, telling Newsweek that Demings was shunning conservative values and not focusing on the \"silent minority\" he identifies with.",
    "\"I don't ask for people to vote for me because of my ethnicity, they care about the economy and foreign policy in the Western Hemisphere, and no one in the Senate has done more on those issues than I have.\"",
    "Asked about Demings' law enforcement background and her efforts not to defund police  as Republicans have seized on against Democrats nationally  but to give money to police programs, Rubio was unimpressed.",
    "In a phone interview afterwards, Rubio, 50, told Newsweek the Democrats' problem with Hispanics is not just limited to Florida, but is a \"national problem\" centered on how Latinos are viewed and approached.",
    "\"As well known as she is nationally after the impeachment trial and her being a VP possibility for Biden, people still need to get to know her in south Florida more than Orlando and Jacksonville,\" he said.",
    "If Puerto Rican votes matter in Florida, the Puerto Rican Day parade in Orlando is where you'll find them, featuring a big crowd with many who have left the island or lived in central Florida for decades.",
    "\"I'm running for U.S. Senate and I'm running to win,\" she thundered to the friendly crowd filled with Democrats, supporters, and activists supporting her against two-term Republican Senator Marco Rubio.",
    "Dueling to fuel expensive Senate campaigns, both Demings and Rubio have raised more than $30 million, but Demings raised $10 million in the first quarter of 2022, while Rubio raised just $5.8 million.",
    "Torres-Velez, who created the nonprofit Boricua Vota to grow Puerto Rican political power, said Latinos need to have their hearts touched \"and sometimes politics is too cold to attract our people.\"",
    "\"There's not a day that goes by that I don't interact with Hispanics in Florida because they're my neighbors, they work at the businesses I frequent, and care about issues I care about,\" he said.",
    "Alex, a 22-year-old Cuban-American college student from Florida International University, told Newsweek he wanted to become more informed about the race, but he likes what he hears from Rubio.",
    "Sierra, who along with other local Cuban-American Democrats met with Demings twice, once on Zoom and once at a Cuban restaurant in south Florida, shared a cautionary message with Demings.",
    "The play features the hard-nosed scion of a popular Miami mayor trying to escape her father's considerable shadow, played by actress and playwright Carmen Pelaez who created the show.",
    "He's quite literally a drunk off the street, but one who oozes charm, and whose poll numbers seem to tick up every time he uses Cuban-American slang the community eats up.",
    "Demings also hired Natascha Otero-Santiago  a longtime Puerto Rican activist who helped mobilize Latinos in 2008 to help elect Barack Obama  as deputy political director.",
    "\"There's the narrative and there's the reality,\" Berrios said, \"and on the Democratic side people fall in love with the narrative and forget to talk about the reality.",
    "Mi Vecino, which is comprised of 25 Latino and bilingual field staff, asks canvassers to engage with 1,500 voters per day in heavily-Hispanic Florida neighborhoods.",
    "Her campaign pointed to a January Suffolk University/USA Today poll showing Demings comfortably topping Rubio in support among voters familiar with both candidates.",
    "The organizers were miffed when they saw that while the Seminole and Orange County Democrats walked in the parade, Florida Democrats didn't have a booth presence.",
    "\"People love Puerto Rican votes,\" Torres-Velez said, admonishing Republicans like Rick Scott as well, \"but they need to love and respect the Puerto Rican people.\"",
    "It isn't hard to see some of the challenges Demings is facing against Rubio within the play, especially when she needs to win in the current political climate.",
    "The campaign told Newsweek it held focus groups and found that Latino voters in particular respond well to hearing about her law enforcement record and story.",
    "Rubio is referring to a CBS This Morning appearance Demings made in the summer of 2020 in the wake of the protests over the police killing of George Floyd.",
    "The Democratic National Committee announced its own six-figure investment in May focused on Miami-Dade County, where Democrats saw major losses in 2020.",
    "She's tough, she's smart, and the protagonist doesn't suffer fools, but in the race for mayor locals wonder why she's not more likable like her dad.",
    "Floridians know Rubio, he's the incumbent, and his Cuban-American descent plays well with many voters of Latin American or Cuban-American heritage.",
    "Before the first showing of \"The Cuban Vote\" play, attendees were fired up about seeing what the play was about, and Rubio had a fan in attendance.",
    "Jimmy Torres-Velez, a radio host of the Boricua Action Network in Kissimmee, is a solid Democrat who called Demings \"the next senator\" of Florida.",
    "But it was on its way, more heavily attended by families than the pared down 2021 version, held despite the coronavirus still dampening interest.",
    "\"I know a little bit about Marco Rubio, I like the stuff that I've seen, I'm biased, every time he talks about Cuba, I'm like yeah, gung ho.\"",
    "It isn't hard to decipher that he's supposed to represent a Cuban exile Donald Trump, especially when he warns, \"Only I can keep Miami safe.\"",
    "Still, FiveThirtyEight's average of high-quality polls shows Demings down more than 8 points, with the last poll conducted in February.",
    "Bill Nelson, the former Democratic senator who lost to Republican Rick Scott in 2018, is the poster child for those lackluster efforts.",
    "He received 52% of the Latino vote and 63% of the Cuban vote during a 2016 Republican primary that featured Trump winning the state.",
    "She said having parents who were a janitor and a maid made her care about what regular people want and not about angering Biden.",
    "At her \"Todos Con Demings\" launch, supporters could sign up to volunteer with the campaign by texting CHIEF to a certain number.",
    "That's the argument from Demings, who says Rubio is a do-nothing senator, and charged that he takes Latino voters for granted.",
    "The city council was being \"very thoughtful,\" Demings said, \"in terms of looking at all of the services that police provide.\"",
    "With ground to make up, Sierra said Demings must continue prioritizing Latinos and getting her name and stances out to them.",
    "Her campaign acknowledges past failures from candidates like Nelson, and that it has work to do, particularly with Latinos.",
    "But while the vibes were good at the \"Todos Con Demings\" launch, there was at least one criticism to be found in the room.",
    "Demings \"at the top and having a Latina for governor is the only thing that the Democrats have never tried,\" Taddeo said.",
    "\"They did their time, they served the community here, and hopefully they can do the same up in Washington,\" he said.",
    "\"If I'm the Democrats, I'm worried about that number when elections are decided by 1% or less,\" Berrios warned.",
    "Peter, 54, who grabbed a DeSantis bumper sticker from the Florida Republican Party, felt differently, however.",
    "\"People don't think about this, but imagine today's Senate with Nelson instead of Scott,\" the source said.",
    "\"Walking in the parade is a minimal commitment to a community that deserves more,\" Murphy-Anderson said.",
    "\"[Senator Joe] Manchin wouldn't matter, [Senator Kyrsten] Sinema would matter less than she does now.\"",
    "\"We've tried everything else, but we've never tried having Black and brown at the top of the ticket.\"",
    "\"She's been in Congress for over six years and never cared about any of these issues,\" he said.",
    "\"I send letters to the president probably more than he would like to see,\" she said, laughing.",
    "She later focused on health care policy during the COVID-19 pandemic as his district director.",
    "Rubio said Demings didn't care about these issues until she decided to run for the Senate.",
    "The reality is people don't know who Val Demings is in her own district and statewide.\"",
    "Afterwards, each canvasser has to write a few important notes about their encounters.",
    "\"I think what she's done on it is even worse because she knows better,\" Rubio said.",
    "\"Marco may feel like he doesn't have to get out and walk and talk with the voters.\"",
    "The same poll showed Rubio beating her with Hispanic voters by 20 points, however.",
    "\"We told her you need to be down here because this is his home base,\" he said.",
    "\"There's no reason to believe she would be a champion on these issues.\"",
    "\"So that's why we told her, 'keep coming back, keep coming back!'\"",
    "\"I don't know a lot about her,\" he said, referring to Demings.",
    "\"I don't believe in the way the country's going,\" he said.",
    "\"All of this education led to the launch,\" she said.",
    "Rubio countered that Demings was way off base.",
    "\"We don't have time for any foolishness.\"",
    "Her opponent?"
  ]
}