{
  "id": 3582,
  "mediaId": 558,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Judge blocks DeSantis redistricting plan; state appeals",
  "image": "",
  "link": "https://news.yahoo.com/judge-blocks-desantis-redistricting-plan-170427089.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "",
  "termIds": [
    661,
    428,
    2661
  ],
  "sentences": [
    "This Court finds that a narrow remedy  one that addresses only the diminishment discussed in this order  is the most appropriate.?\nSmith ordered that a map drawn by a Harvard professor who testified for the plaintiffs should be used, but the states appeal keeps the DeSantis map in place.",
    "The map was challenged by several voting rights group, who argued it was unconstitutional because it broke up a north Florida district held by Democratic Rep. Al Lawson where Black residents make up nearly 50% of the population.",
    "The appeal comes as the state gets closer to the June 13 to 17 qualifying period for federal office, and regardless what the appellate court decides, the map will likely then be taken to the state Supreme Court.",
    "Because this Court has found a violation of the Florida Constitution and that there is time to remedy the violation, this Court must consider what remedy is appropriate,? Smith said in his order.",
    "Florida gained a 28th congressional district because of population growth over the past decade, meaning Smith couldnt have ordered current maps to be used while the lawsuit continues.",
    "Smith agreed, saying that the DeSantis map takes a district with 367,000 Black voters and distributes them among four districts that would be overwhelmingly white.",
    "Thursdays notice of appeal came hours after Circuit Judge Layne Smith issued an injunction to prevent the DeSantis map from being used in the November election.",
    "A judges ruling that a new congressional map drawn by Republican Florida Gov.",
    "Ron DeSantis staff is unconstitutional has been appealed by the state.",
    "DeSantis appointed three of the seven current justices.",
    "The case goes to the 1st District Court of Appeals."
  ]
}