{
  "id": 3601,
  "mediaId": 188,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Bill Maher blasts Biden's 'Ministry of Truth,' warns Democrats that the Disinformation Governance Board would have had a field day with Obama's big lie",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTgwNDUyNi9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTY4OTk0MTc2OH0.uxYKxFA0yGx1AbOPaGNjWEA0hMy8FtBSNkyQ-I9aGF4/img.png?width=1245&quality=85&coordinates=68%2C0%2C27%2C0&height=700",
  "link": "https://www.theblaze.com/news/bill-maher-disinformation-board-ministry-truth",
  "sentiment": "0.0",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Sacca",
  "authorUrl": "https://www.theblaze.com/u/paulsacca",
  "termIds": [
    661
  ],
  "sentences": [
    "When it comes to DHSs work, the Department is focused on disinformation that threatens the security of the American people, including disinformation spread by foreign states such as Russia, China, and Iran, or other adversaries such as transnational criminal organizations and human smuggling organizations.",
    "However, a Homeland Security Department memo released earlier this month appears to expand the Disinformation Governance Board's responsibilities and powers:\nDisinformation, which is false information that is deliberately spread with the intent to deceive or mislead, can take many forms.",
    "During a recent Zoom call, Nina Jankowicz said, Verified people can essentially start to edit Twitter [in] the same sort of way that Wikipedia is so they can add context to certain tweets.?\nMaher noted that Twitter users can easily add a reply to tweets  which could provide context.",
    "On Friday night's episode of \"Real Time with Bill Maher,\" the liberal talk show host said he agreed with the newly-formed department's role in combatting Russian disinformation since \"they are our adversary and trying to hurt us.\"",
    "Earlier this month, Fox News host Greg Gutfeld suggested that Bill Maher should be Biden's disinformation czar because he is \"somebody that pisses you off 50% of the time and doesnt tick you off the other 50%.\"",
    "Former Rep. Jane Harman (D-Calif.)  who sits on the Department of Homeland Security advisory committee  said during the show that if the new department was \"confined to a few missions\" that \"it'd be fine.\"",
    "At the time of the launch, the DHS said the new department's mission will be to \"coordinate countering misinformation related to homeland security, focused specifically on irregular migration and Russia.\"",
    "\"But then here's from the Department of Homeland Security, 'Disinformation is defined as false information that is deliberately spread with the intention to deceive or mislead,'\" Maher quoted the DHS.",
    "\"Well, you could have said that about If you like your doctor, you can keep your doctor,\" Maher suggested, recalling Obama's vow that was proclaimed \"Lie of the Year\" by PolitiFact in 2013.",
    "Maher also slammed the incoming director of the new Disinformation Governance Board for wanting to enable verified Twitter users to edit other users if they feel like a tweet is misleading.",
    "Maher mentioned that many people are labeling the Disinformation Governance Board as the \"Ministry of Truth\"  the department of propaganda in George Orwell's dystopian book \"1984.\"",
    "Ron DeSantis, House Minority Leader Kevin McCarthy (R-Calif.), Rep. Lauren Boebert (R-Colo.), Sen. Marco Rubio (R-Fla.), and Rep. Marjorie Taylor Greene (R-Ga.).",
    "\"This is still America where people have the right to express what they think including to be wrong to lie and yes, the right to be an a**hole,\" Maher declared.",
    "\"And if you think you know everything and no one else could possibly have some other truth, you should be glad for that protection, because you're an a**hole.\"",
    "Maher then questioned what would happen to the Disinformation Governance Board if Republicans regained the White House in the next presidential election.",
    "Such malicious actors often spread disinformation to exploit vulnerable individuals and the American public, including during national emergencies.",
    "\"This idea that we can clean up Twitter and project you from fake news and disinformation- it's so ridiculous,\" Maher said, according to Fox News.",
    "Somebody says something and then you add context,\" Maher snapped back sarcastically, then added, \"These are not bright people in our government.\"",
    "Harman conceded that \"something very broad scale\" would be \"highly unfortunate,\" but told Maher, \"I don't think that's where it's going.\"",
    "They said it was superficial and too fast for the truth.\"\n\"Lies are all around you develop a better bulls**t detector,\" Maher snarled.",
    "\"It said also, here's a phrase, can take many forms. Okay, now we're going faster down the slippery slope,\" Maher warned.",
    "Numerous Republicans have called Biden's Disinformation Governance Board the \"Ministry of Truth\"  including Florida Gov.",
    "Bill Maher issued a warning that the Biden administration's Disinformation Governance Board could backfire on Democrats.",
    "However, Maher was deeply concerned with how the Disinformation Governance Board could be politically weaponized.",
    "The HBO host hammered home his point by highlighting a lie by former President Barack Obama as an example.",
    "Maher declared, \"Okay, so government should not be involved in deciding what's true or not true!\"",
    "In late April, the Department of Homeland Security created the Disinformation Governance Board.",
    "And whenever a new means of communication comes along, some reach right for the censor button.",
    "During last week's \"Real Time with Bill Maher,\" the liberal host railed against censorship.",
    "Maher then referenced the Obamacare promise to Americans from former President Obama.",
    "In 1858 The New York Times thought we couldn't handle the transatlantic telegraph.",
    "Maher also took a shot at the incoming disinformation czar Nina Jankowicz.",
    "\"Yes, they're right to compare this to Orwell in the Ministry of Truth.",
    "Who decides what gets the no evidence for that sticker slapped on it?\"",
    "\"That's a better solution than me giving up what I'm allowed to read.",
    "He asked, \"Who do you think the truth czar is going to be in 2025?\"",
    "It's exactly what it sounds like,\" Maher exclaimed.",
    "Every age is the misinformation age.",
    "\"Oh, you mean like what Twitter is?",
    "That's what Twitter is.",
    "That's what people do.",
    "\"People always lie.",
    "Who decides that?"
  ]
}