{
  "id": 3603,
  "mediaId": 19,
  "date": "5/14/2022 12:00:00 AM",
  "headline": "Watchdog Calls for House Ethics Investigation into Charlie Crist for Abusing Proxy Voting",
  "image": "https://media.breitbart.com/media/2022/05/GettyImages-1355134558-e1652562719639-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/14/watchdog-calls-for-house-ethics-investigation-into-charlie-crist-for-abusing-proxy-voting/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    661
  ],
  "sentences": [
    "Crist reportedly filed letters to the House Clerk that said he continues to be unable to physically attend proceedings in the House Chamber due to the ongoing public health emergency.?\nThe Foundation for Accountability and Civic Trust (FACT), a nonprofit organization founded by former President Donald Trumps once Acting Attorney General Matthew Whittaker, argued the real reason Crist used proxy voting 107 times was due to his ongoing gubernatorial campaign in Florida.",
    "FACT executive director Kendra Arnold accused Crist of not fulfilling his obligation to maintain the integrity of government action.?\nArnold said:\nIn this case, both public and on the record, evidence leave little room for doubt that Rep. Crist is taking advantage of a rule passed for a national health emergency in attempts to further his political career.",
    "Under the House Clerks coronavirus policies, members of Congress are allowed to vote by proxy if they are unable to vote in person on the House floor due to the public health emergency.?\nHowever, Crist has cited this House policy as the reason for voting by proxy over 100 times between January to April 7.",
    "On days he has voted by proxy, Crist has attended public events for his gubernatorial campaign\nFACTs call for an investigation came after Crists spokesperson admitted the Florida gubernatorial hopeful used the proxy vote process so he could maintain his ongoing campaign.",
    "The ethics rules function to maintain the integrity of government action, and the Office of Congressional Ethics is responsible for ensuring each Member fulfills the public trust inherent in the office and that they comply with the Houses ethical standards.",
    "Crists spokesperson said in April:\nThe Congressman has two important missions: representing Floridas 13th District in Congress and giving Floridians, exhausted by Ron DeSantis never ending culture wars, a clear choice in November.",
    "The complaint said:\nHowever, contrary to Crists statement to the House Clerk, it is evident that the true reason he is voting by proxy and virtually attending committee hearings is unrelated to the COVID-19 pandemic.",
    "Unfortunately, in this case Rep. Crist appears to have fallen far short of this standard, therefore, we urge the Board to immediately investigate Rep. Crist for abusing the proxy vote,? Arnold concluded.",
    "An ethics watchdog organization asked the House Office of Congressional Ethics to investigate Rep. Charlie Crist (D-FL) for allegedly abusing the proxy vote process.",
    "Recent polling data shows that Crist will likely lose Floridas gubernatorial election if he advances through the Democrat primary and faces Florida Gov.",
    "The proxy offers a great way to ensure his constituents voices continue to be heard on legislation under consideration in Congress.",
    "FACT supplemented its complaint with multiple examples of Crist voting by proxy while he was on the campaign trail in Florida.",
    "DeSantis beats Crist by an average of 8.8 percent, according to RealClearPolitics current data.",
    "During this period, Crist only voted in person 18 times over four days in March.",
    "Rather, the reason is so he can campaign for governor.",
    "Ron DeSantis (R) in November."
  ]
}