{
  "id": 3606,
  "mediaId": 302,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "DeSantis names conservative lawmaker Cord Byrd as Florida elections chief",
  "image": "https://www.tampabay.com/resizer//6phoy81xRtlJFmNKOhx_sov25-Y=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/RSUBURG7RCILVDUUAHVJSPMGFM.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/13/desantis-names-conservative-lawmaker-cord-byrd-as-florida-elections-chief/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lawrence Mower",
  "authorUrl": "https://www.tampabay.com/author/lawrence-mower",
  "termIds": [
    661
  ],
  "sentences": [
    "I look forward to his successes ensuring Floridas elections remain safe, secure and well-administered.?\nByrd, 51, said in a statement that he will make sure Florida continues to have secure elections and that we protect the freedom of our citizens in the face of big-tech censorship and ever-growing cybersecurity threats.?\nThe Friday announcement comes a day after Secretary of State Laurel Lee, a former federal prosecutor and Hillsborough County judge, announced she was leaving the office on Monday.",
    "In a statement, DeSantis touted bills Byrd has sponsored in recent years that were some of the governors top priorities, including 2019 legislation banning so-called sanctuary cities,? a 2020 bill requiring that some employers check the immigration status of new workers and broad anti-rioting legislation in 2021.\nCord Byrd has been an ally of freedom and democracy in the Florida Legislature, and I am confident he will carry that mission forward as Secretary of State,? DeSantis said.",
    " Rep. Angie Nixon (@AngieNixon) May 13, 2022\nAfter Fridays announcement, Nixon released a statement calling the idea of Byrd overseeing the states elections frightening.?\nGet insights into Florida politics\nFloridas top elections official should be a consensus builder whose sole focus is running free and fair elections for every citizen of our state,? she said.",
    "The 2020 election was one of the states smoothest in recent memory, and the president of the association representing the states elections supervisors called her departure a horrible loss.? Floridas secretary of state earns a salary of $170,000.",
    "The press release stated that Cord Byrd has been an advocate for public integrity.? Not the same guy that cussed at me and @repmccurdy on the house chamber floor because he was upset that kids spoke out against the abortion ban?!",
    "He is unqualified in both his credentials and his temperament.?\nIn March, DeSantis appointed Byrds wife, Esther, to the State Board of Education, despite her making headlines over a tweet about the Jan. 6 insurrection.",
    "The legislation created a 15-person Office of Election Crimes and Security to investigate fraud complaints, supplemented by 10 police officers chosen by the governor from the Florida Department of Law Enforcement.",
    "In his new role, Byrd will be overseeing a Department of State that is newly enhanced with a first-of-its-kind elections police force, an idea DeSantis pushed this year to combat election-related fraud.",
    "Byrd, an attorney, has sponsored some of the most controversial bills in the Legislature in recent years, and he sided with DeSantis in an ongoing intraparty dispute over the states congressional maps.",
    "When a protest broke out in the House gallery during a floor debate over this years abortion bill, Byrd turned around and cursed at Black Democratic colleagues, considered a major breach of decorum.",
    "The tweet, which was later taken down, said, In the coming civil wars (We the People vs the Radical Left and We the People cleaning up the Republican Party), team rosters are being filled.",
    "Lee received bipartisan praise during her tenure as the states election chief, advancing DeSantis controversial election measures while staying out of the political fray.",
    "Ron DeSantis on Friday named conservative Rep. Cord Byrd, a Neptune Beach Republican, as Floridas new secretary of state, overseeing the states elections office.",
    "Byrd responded by calling her a one-trick pony? who routinely calls her opponents white supremacists, according to Florida Politics.",
    "Byrd later called his wifes tweet hyperbole? and compared it to comments made by TV personalities on Fox News.",
    "Since joining the Legislature in 2016, Byrd has served on the Houses Public Integrity and Elections Committee.",
    "Afterward, Rep. Angie Nixon, D-Jacksonville, called Byrd a racist? and called for his censure.",
    "There are only 2 teams With Us [or] Against Us,? according to News 4 Jacksonville.",
    "Shes widely believed to be running in Congressional District 15 as a Republican.",
    "Byrd still faces confirmation by the Florida Senate.",
    "Every elected official in DC will pick one.",
    "Cord Byrd is not that person.",
    "@GovRonDeSantis is absurd.",
    "TALLAHASSEE  Gov."
  ]
}