{
  "id": 3607,
  "mediaId": 195,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Janelle Mone calls out DeSantis, Abbott for erasure",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2020/06/ca_janellemonae_61520getty.jpg?w=1281&h=880&crop=1",
  "link": "https://thehill.com/blogs/in-the-know/3487631-janelle-monae-calls-out-desantis-abbott-for-erasure/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Judy Kurtz",
  "authorUrl": "https://thehill.com/author/judy-kurtz/",
  "termIds": [
    661,
    2250,
    4122,
    4465,
    2661,
    2934
  ],
  "sentences": [
    "And its being done through lawmaking.?\nMone was speaking in promotion of her dystopian future book The Memory Library,? which she said deals with this totalitarian society literally taking peoples memories away from them, and giving them new identities so that they can manipulate and control them.?\nBut these protagonists, who are mostly queer women, nonbinary folks, they fight back.?\nOur memories define the quality of our lives, and I think that when you strip somebodys memory, you strip their identity,? the Hidden Figures? actor added.",
    "Greg Abbott (Texas) and Ron DeSantis (Fla.), saying their policies are an agenda for erasure.?\nThese are governors who are saying in schools that teachers and students cant even talk about the LGBTQI+ community,? the Say Her Name? singer said in a Thursday interview with Christiane Amanpour on CNN.",
    "So my natural instinct has always been to stand up to bullies and protect the ones who are trying to just live and love, and in peace and in their authentic selves.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "It restricts classroom instruction in primary schools related to sexual orientation or gender identity and prohibits educators of all grade levels from engaging in instruction on those topics in a way thats not age appropriate or developmentally appropriate? for children.",
    "The Lone Star State also came in first as the state with the largest number of book bans  which includes censoring titles focused on race, gender and sex  in the country, according to a report released last month by the nonprofit PEN America.",
    "Imagine if I wasnt making my own money to support myself and I was living in a family that rejected me, or living in a community or somewhere that did not accept me for who I was,? Mone continued.",
    "You strip them as human beings.?\nMone, who recently came out as nonbinary and uses both her/she and they/them pronouns, recalled her Kansas upbringing with working-class parents.",
    "These are real experiences for our ancestors, real experiences for us as complete human beings,? Mone told Amanpour, and erasure is happening right underneath our noses.",
    "In February, Abbott ordered state agencies in Texas to investigate as child abuse reports of transgender children receiving gender-affirming treatment.",
    "DeSantis in March signed into law Floridas controversial Parental Rights in Education legislation  dubbed the Dont Say Gay? bill by critics.",
    "In my heart and in my spirit I always want to protect marginalized, working-class folks.",
    "Being queer, being nonbinary myself, imagine if I didnt have my platform,? she said.",
    "They dont want us talking about critical race theory or race,? Mone, 36, said.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Janelle Mone is calling out Republican Govs.",
    "You cant talk about it in books."
  ]
}