{
  "id": 3610,
  "mediaId": 558,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Republican-led bill targeting Disney's Mickey Mouse 'can't possibly pass': Lawyer",
  "image": "https://s.yimg.com/uu/api/res/1.2/DQuBzIvBPmGBupZGHuPecw--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-04/7a6234a0-c4af-11ec-b63e-4ca61035f3c0",
  "link": "https://ph.news.yahoo.com/why-republican-led-bill-targeting-disneys-mickey-mouse-cant-possibly-pass-lawyer-192241055.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Following Disney's (DIS) public battle with Florida Governor Ron DeSantis, who revoked the company's special tax district after it vowed to help repeal the Parental Rights in Education Act (or what critics have dubbed the \"Don't Say Gay\" bill), the entertainment giant is now fighting another Republican lawmaker.",
    "For context, Disney pulled in more than $5.2 billion in retail sales and merchandise licensing (toys, apparel, games, home dcor, and other products) last year, an 11 % increase compared to 2020.",
    "This new legislation resulted in an effort to hep the U.S. keep up with the rest of the world, which was significantly more advanced when it came to copyright laws and protections.",
    "He added that the bill, , would also be in \"violation of the basic principles of free speech and of the First Amendment,\" citing the politically-motivated nature of its inception.",
    "Disney was part of that corporate lobbying push and was at the time of the legislation's voting; thus causing the act to be known as the \"Mickey Mouse Protection Act.\"",
    "Hawley admitted on Twitter that the new legislation was created in an effort to target \"woke\" Disney and its slew of animated characters, most notably Mickey Mouse.",
    "End the handouts now\nSince 1928, the original Mickey Mouse, which appeared in the animated short film \"Steamboat Willie,\" has been protected under copyright law.",
    "He publicly denounced the act during the company's annual shareholder meeting on March 9, in addition to directly apologizing to employees in a company memo.",
    "In addition to the DeSantis drama and \"Don't Say Gay\" fallout, the executive came under following awith \"Black Widow\" actress Scarlett Johansson last summer.",
    "Hawley, who is also a constitutional lawyer, is part of a larger Republican-led effort to ensure that Disney is not granted further copyright extensions.",
    "The bill would also apply retroactively to firms with a market capitalization above $150 billion that operate in the motion picture industry.",
    "Disney has twice lobbied Congress for extensions, therefore allowing the media giant 94 years of exclusive rights to media and merchandise.",
    "Disney, which reported on Wednesday that missed on both the top and bottom lines, has seen shares fall more than 30% year-to-date.",
    "In 1988, the U.S. enacted the , which amended the copyright law to one term of life on the part of the author, plus 50 years.",
    "Chapek, whose contract expires on February 28, 2023, has dealt with a fair amount of controversy during his tenure.",
    "Earlier this week, Missouri Senator Josh Hawley proposed legislation limiting copyright protections to 56 years.",
    "Theres no reason @disney or any other woke corporation should keep getting special favors from government.",
    "It is not known how much of that bucket specifically came from the sales of Mickey Mouse-branded items.",
    "It will then be released into the public domain for artists and creatives to utilize in their work.",
    "But in 2024, the copyright protection for that particular image of Mickey Mouse is set to expire.",
    "His legislation would also strip Disney of those protections as soon as this year.",
    "The executive over his belated response to the bill."
  ]
}