{
  "id": 3612,
  "mediaId": 129,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "The Baby Formula Crisis",
  "image": "",
  "link": "https://www.nytimes.com/2022/05/13/briefing/baby-formula-shortage-us-economy.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "As my colleague Amanda Morris, who has been reporting on the shortage, says: Most of the parents I spoke with around the country who were feeling the impact of this the hardest were ones that either had limited resources or time, or ones whose babies had allergies or disabilities that severely limited their choices.?\nF.D.A.",
    "But an alarming shortage of infant formula  and the lack of a national mobilization to keep babies fed  provides a new measure of how deeply that indifference runs.?\nIn her column, Rosenberg suggests the creation of a national stockpile, as exists for some other crucial resources, to prevent future shortages.",
    "Standout lyrics: Norway will sing, And before that wolf eats my grandma / give that wolf a banana,? and Serbias entry asks, What is the secret of Meghan Markles hair?? Latvias song about being environmentally friendly, Eat Your Salad,? didnt make it to tomorrows finale.",
    "The main reasons: Factories and ports are coping with virus outbreaks and worker shortages at the same time that consumer demand for physical goods has surged, because of government stimulus programs and a shift away from spending on services (like restaurant meals).",
    "I was freaking out, crying on the floor and my husband, Lane, came home from work and hes like, Whats wrong?? Browning said, and Im like, Dude, I cant feed our kids, I dont know what to do.?\nFor many families, baby formula is a necessity.",
    "Thomas Philippon, an economist at N.Y.U., refers to this trend as the great reversal.? The subtitle of his 2019 book on the subject is How America Gave Up on Free Markets.?\nFor workers and consumers, concentration is often problematic.",
    "Relative to other affluent countries, the U.S. spends a notably small share of its budget on children; President Bidens stalled Build Back Better plan aimed to change this, Urban Institute researchers have pointed out.",
    "Because sales of baby formula do not fluctuate much in normal times, factories generally lack the ability to accelerate production quickly, Rudi Leuschner, a supply-chain expert at Rutgers University, said.",
    "Many formulas sold in Europe exceed the F.D.A.s nutritional standards, but they are banned from being sold here, often because of technicalities, like labeling, Derek Thompson of The Atlantic has noted.",
    "And it does not fear government, which has a pathetic track record when it comes to holding powerful corporations and executives accountable.? (The Times has profiled Miller and her work.)",
    "In Oceanside, Calif., north of San Diego, Darice Browning was recently despondent after failing to find formula for her 10-month-old daughter, Octavia, who cannot eat solid foods.",
    "Some members of Congress  including Representative Rosa DeLauro, a Connecticut Democrat, and Senator Mitt Romney, a Utah Republican  say the federal government needs to do more.",
    "Abbott does not fear consumers will flee,? Sarah Miller, executive director of the American Economic Liberties Project, which advocates less concentration, told me.",
    "This newsletter has covered ways that the F.D.A.s bureaucratic inflexibility has hampered its Covid policy, and baby formula turns out to be another case study.",
    "Some babies cannot drink breast milk  or enough of it to stay healthy  while many lower-income mothers work hourly jobs that do not provide time to breastfeed.",
    "The company shut the factory after four babies  all of whom had drunk formula made there  contracted a rare bacterial infection; two of the babies died.",
    "Over the past few decades, this kind of corporate concentration has become more common in the U.S. economy, and it tends to be very good for companies.",
    "A potential bacteria outbreak led to the February shutdown of a Michigan factory that makes Similac formula, and the plant still has not reopened.",
    "Elisabeth Goodridge, The Timess deputy travel editor, will study travel reporting in an era of climate change as a 2023 Nieman fellow at Harvard.",
    "THE LATEST NEWS\nWar in Ukraine\nThe Jan 6. committee subpoenaed Representative Kevin McCarthy, the minority leader, and four of his colleagues.",
    "What to Read\nIn Nasty, Brutish, and Short,? Scott Hershovitz takes readers on a tour of philosophy, based on conversations with his two sons.",
    "For more: The Timess Well has a guide for parents searching for formula, and Politicos Helena Bottemiller Evich has offered tips on Twitter.",
    "Big bureaucracy\nEven as the industry seems to be under-regulated in some crucial ways, it may be overregulated in other, superficial ways.",
    "The looming loss of abortion rights has re-energized the Democratic Partys left flank, and put anti-abortion members on the defensive.",
    "Americans over 65 receive universal health insurance (Medicare), and most receive a regular government check (Social Security).",
    "The baby formula industry was already coping with these issues before an Abbott Nutrition factory in Sturgis, Mich., shut down.",
    "Fame doesnt necessarily follow, though past winners include Abba (in 1974) and Celine Dion (representing Switzerland in 1988.)",
    "ARTS AND IDEAS\nAbout 200 million people are expected to tune in tomorrow to the finals of the annual Eurovision Song Contest.",
    "The inflexibility of American regulatory and trade policy, Thompson wrote, might be the most important part of the story.?\n4.",
    "The gerontocracy\nThe U.S. has long put a higher priority on taking care of the elderly than taking care of young families.",
    "Big business\nThe baby formula business has something in common with many other U.S. industries: It is highly concentrated.",
    "Her 3-month-old daughter, Lennix, can tolerate only one brand of formula, and Fleming could not find it anywhere near her.",
    "In addition to being an urgent problem for families, the shortage highlights four larger problems within the U.S. economy.",
    "The everything shortage\nThe pandemic has created shortages for many goods, including cars, semiconductors and furniture.",
    "What to Watch\nFour children develop unusual abilities in The Innocents,? a wonderfully eerie Norwegian horror movie.",
    "The winner of the Kentucky Derby, Rich Strike, will skip the Preakness, forgoing the chance to win a Triple Crown.",
    "The reward: The winning act receives no money, only a trophy  and its country hosts the event the following year.",
    "Babies and their well-being have never been much of a priority in the United States,? Rosenberg wrote this week.",
    "Representative Conor Lamb, a moderate Democrat, once seemed like the front-runner in Pennsylvanias Senate race.",
    "At least 11 people died, and 31 others were rescued, after a boat carrying migrants capsized near Puerto Rico.",
    "Donald Trump exacerbated the situation with a trade policy that made it harder to import formula from Canada.",
    "It is a typical fear among new parents  and an acute one now, because of a national shortage of baby formula.",
    "Claire Moses, Ian Prasad Philbrick, Tom Wright-Piersanti, Ashley Wu and Sanam Yar contributed to The Morning.",
    "She became an integral part of Chicagos disability-rights scene, and an acclaimed playwright and novelist.",
    "Ron DeSantis, a culture warrior without Trumps baggage, is the new Republican Party, Rich Lowry argues.",
    "Alyssa Rosenberg, a Washington Post columnist, argues that the formula shortage is part of this story.",
    "Take the News quiz\nLate Night\nNow Time to Play\nThe pangram from yesterdays Spelling Bee was injected.",
    "Three companies  Abbott, Gerber and Reckitt  make nearly all of the formula that Americans use.",
    "The favorite: Oddsmakers say its Ukraine, largely because of popular support for the country.",
    "If the market had more producers, a problem at any one of them might not be such a big deal.",
    "The band Kalush Orchestra will perform Stefania,? a combination of folk music and hip-hop.",
    "Its closure has aggravated shortages created by broader pandemic supply-chain problems.",
    "It gets really scary,? Carrie Fleming, who lives near Birmingham, Ala., told The Times.",
    "Lives Lived: Susan Nussbaum began using a wheelchair after she was hit by a car at 24.",
    "As a result, other factories have not been able to make up for the Sturgis shutdown.",
    "They face less competition, allowing them to keep prices higher and wages lower.",
    "PLAY, WATCH, EAT\nWhat to Cook\nPistachios add color and crunch to this bucatini.",
    "The pandemic has left college students disengaged, Jonathan Malesic writes.",
    "These policies benefit American formula makers, at the expense of families.",
    "Abbott is the largest of the three, with roughly 40 percent of the market.",
    "Last week, stores stocked about 43 percent less baby formula than usual.",
    "Some traders are comparing it to the start of the 2008 financial crisis.",
    "Heres todays Mini Crossword, and a clue: Party thrower (four letters).",
    "The promoter: Jake Paul helped bring womens boxing to new heights.",
    "It remains unclear whether the formula caused the infections.",
    "As a result, much of the global supply chain is overloaded.",
    "If youre in the mood to play more, find all our games here.",
    "Ukraine has won the competition twice in the past 20 years.",
    "She finally located four small cans in New York  for $245.",
    "Advice from Wirecutter: How to pack for a national park.",
    "Thanks for spending part of your morning with The Times.",
    "officials say they are trying to alleviate the crisis.",
    "Its even possible the problem would not happen at all.",
    "A Times classic: Inside one boys magnificent mind.",
    "You can reach the team at themorning@nytimes.com.",
    "The baby-formula shortage is the latest example.",
    "The Daily? is about Americas Covid death toll.",
    "Here is todays puzzle  or you can play online.",
    "The Ezra Klein Show? features Patrick Deneen.",
    "Many children, by contrast, live in poverty.",
    "Cryptocurrency prices collapsed this week.",
    "Still Processing? is about Keanu Reeves.",
    "Russia and its ally Belarus are barred.",
    "Now, hes trailing by double digits.",
    "Todays newsletter focuses on them.",
    "Surgery: Butt lifts are booming.",
    "Heres how to watch from the U.S.",
    "Is my baby getting enough food?",
    "Opinions\nFlorida Gov.",
    "Recovery is no joke.",
    "Yes, that Jake Paul.",
    "Heres todays Wordle.",
    "See you tomorrow.",
    "She died at 68.",
    " David\nP.S.",
    "1.",
    "3.",
    "2."
  ]
}