{
  "id": 3614,
  "mediaId": 136,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Attack on Florida's Scrutiny of Textbooks is More CRT Gaslighting | Opinion",
  "image": "https://d.newsweek.com/en/full/2036786/ron-desantis.webp?w=790&f=80eae123b51bb8e5fe404c3492bcc68d",
  "link": "https://www.newsweek.com/attack-floridas-scrutiny-textbooks-more-crt-gaslighting-opinion-1706195",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Tobin",
  "authorUrl": "https://www.newsweek.com/authors/jonathan-tobin",
  "termIds": [
    661,
    3988,
    4327,
    3279,
    2661
  ],
  "sentences": [
    "Yet what remains most frustrating about this discussion is that woke educators and the journalists who provide cover for them remain so inured to the critique of American society implicit in these concepts that they dismiss those who point out inappropriate material as reactionaries seeking to defend white supremacy.",
    "They allow liberal educators to depict American patriotism and ideals about a colorblind society and equal opportunity as tainted by systemic racism, and to replace those ideals with CRT-influenced concepts about equity and white privilege, as well as radical notions about gender and sex.",
    "One may agree or disagree with Rapinoe's arguments, but the insertion of an argument about gender differences in sports salaries is clearly political, and it carries assumptions about topical issues into the teaching of disciplines that ought to be apolitical.",
    "Indeed, one of the Times' articles on the subject discusses criticism of a book which uses soccer player Megan Rapinoe's complaints about unequal pay with male playerswho compete in front of far larger audiencesto teach children about percentages.",
    "The New York Times sought to skewer DeSantis' decision on the books with an article that ignored the examples of left-wing politicization provided by the state and instead relied on material provided by some of the clearly disgruntled publishers.",
    "Documentation released by the Florida Department of Education contained 6,000 pages of comments about the books in question by reviewers representing a variety of viewpoints, an admirable illustration of the transparency of the process.",
    "They say CRT is an arcane academic topic only taught in colleges or graduate schools and that any notion of it being introduced to elementary and secondary school students is a product of the fevered imaginations of white supremacists.",
    "According to critics of Florida Governor Ron DeSantis' administration, the Sunshine State's rejection of 42 math textbooks that had been approved for use in public schools is one example among many of conservatives attacking straw men.",
    "How else can one explain coverage that describes Florida's decisions as right-wing \"political theater\" when discussing a textbook that actually included a racial bias graph as a way of teaching students about polynomial equations?",
    "While one academic quoted by the Times said there was no connection between social emotional learning and CRT, the former is, in fact, the perfect vehicle for bringing all sorts of messagesboth obvious and subtleinto math class.",
    "But it is they who are playing politics with education, not the governor who demands that schools teach basic skills children need, rather than giving them math loaded down with progressive notions about social justice.",
    "Reporters dismissing the state's concerns as imaginary are themselves so much a product of left-wing groupthink that they can't recognize left-wing ideology even when it is staring them in the face.",
    "The DeSantis administration was right to analyze books for evidence of the influence of social emotional learning and to insist that Florida's children learn math without political baggage.",
    "Whether on COVID policy or education, liberal pundits have attempted to smear as a right-wing provocateur someone they rightly regard as a viable future GOP presidential contender.",
    "Such blatant gaslighting ignores a vast store of evidence that variations of this toxic and racist approach to education have been introduced into schools around the country.",
    "The argument hinges on a concept called \"social emotional learning\"a method aimed at getting children to think holistically about education and their learning goals.",
    "Yet the pushback against Florida has been characterized by condescension and incredulity on the part of those claiming the controversy is right-wing agitprop.",
    "The upshot of the piece was typical of the left-wing response to concerns over critical race theory indoctrination: there's nothing there.",
    "Most left-wing commentators claim that the widespread backlash against CRT from parents is a hoax perpetrated by right-wing propagandists.",
    "But as writer Christopher Rufo has explained, such seemingly anodyne approaches to education provide cover for ideological indoctrination.",
    "But when included in a math textbook, it's hardly unreasonable or right-wing propaganda to note that it comes across as antisemitic.",
    "The Florida textbook review is a normal processnot, as it is often depicted by leftists, a matter of conservatives burning books.",
    "Jonathan S. Tobin is editor-in-chief of JNS.org, a senior contributor to The Federalist and a columnist for the New York Post.",
    "Taken in the abstract, that sounds reasonable, even helpful, especially to students who struggle with math.",
    "Other textbooks incorporated talking points about race, bias or \"social awareness\" into math problems.",
    "One included a string of Jewish jokes, such as \"Why do Jewish divorces cost so much?",
    "The same approach appears to be at work in the discussion about Florida's textbooks.",
    "That sort of jibe might be considered normal in a late-night comedy club.",
    "Over the past two years, DeSantis has become a piata for progressives.",
    "The views expressed in this article are the writer's own.",
    "Some of the books strayed very far afield from math.",
    "Because they're worth it.\""
  ]
}