{
  "id": 3616,
  "mediaId": 302,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "The stakes for the governors race in Florida have just gotten higher | Column",
  "image": "https://www.tampabay.com/resizer//YiVhvW8x3w2MJ9JeTdxnT2YDidI=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/WRL2TSEE6ZAMLHZY5M7OL7DRHM.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/13/the-stakes-for-the-governors-race-in-florida-have-just-gotten-higher-column/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Sink",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Legal scholars say if the draft court opinion stands, it could open the door for states to successfully repeal other rights  such as the right to use contraception and the right of gay couples to marry.",
    "Im proud to join civil rights leaders like former state Sen. Arthenia Joyner, U.S. Rep. Kathy Castor and incumbent state legislators such as state Rep. Fentrice Driskell, who are all supporting Charlie.",
    "Legal scholars say if the draft court opinion stands, it could open the door for states to successfully repeal other rights  such as the right to use contraception and the right of gay couples to marry.",
    "He has voted against legislation that would ban abortions after 20 weeks, restrict access to abortion coverage in health insurance plans and other efforts to interfere with a womans right to choose.",
    "The young mother from Ohio was visiting relatives in Tampa and had gone out for a walk along the iconic boulevard, where a miles-long sidewalk runs near the bay and close to the traffic lanes.",
    "A draft U.S. Supreme Court opinion published last week and supported by the courts radical conservative majority would overturn the landmark Roe v. Wade decision protecting abortion rights.",
    "On Wednesday, a three-judge panel of the 2nd District Court of Appeal questioned lawyers for Herrin and the state over whether Nash abused his discretion in applying the hefty sentence.",
    "In Congress, Charlie co-sponsored the Womens Health Protection Act of 2021 that passed the House and would put the rights and protections afforded by Roe v. Wade into federal law.",
    "Nobody doubts that Cameron Herrin needs to pay for killing Jessica Reisinger-Raubenolt and her 21-month-old daughter, Lillia, after crashing on Tampas Bayshore Boulevard in 2018.",
    "If it stands, the opinion would overturn a half century of established law and leave the nations governors as the last line of defense in protecting a womans right to choose.",
    "As a state senator in 1995, Charlies vote killed legislation that would have created a 24-hour waiting period (that a judge recently allowed to go into effect).",
    "Its not good enough to dismiss this disparity as a judgment call? as if an additional six, 12 or 18 years are merely petals to peel from a young persons life.",
    "But his 24-year prison sentence is excessive, far out of proportion to the six years the friend he was racing that day was given for his role in the tragedy.",
    "I shudder to think what they would do if they are given carte blanche by the U.S. Supreme Court to continue their assault on freedoms we thought were secure.",
    "Ron DeSantis, who already has signed into law untenable abortion restrictions that clearly violate both the Florida Constitution and the U.S. Constitution.",
    "I would not be surprised if DeSantis next pushes a trigger law' that would automatically ban abortion in Florida if the U.S. Supreme Court overturns Roe.",
    "He just signed into law extreme legislation that would ban abortion after 15 weeks of pregnancy  and does not even allow exceptions for rape and incest.",
    "The members of the Editorial Board are Editor of Editorials Graham Brink, Sherri Day, Sebastian Dortch, John Hill, Jim Verhulst and Chairman Paul Tash.",
    "Herrin, then 18, drove a Ford Mustang while his friend, John Barrineau, then 17, drove a Nissan Altima as they traveled north on Bayshore.",
    "We have already seen DeSantis and the Republican-led Legislature erode our constitutional rights, from abortion rights to voting rights.",
    "Subscribe to our free Stephinitely newsletter\nAs a member of the Florida Cabinet, I worked alongside Charlie when he was governor.",
    "And I know he will pro-actively protect the freedom for women to make the most personal of decisions about their own health care.",
    "As governor in 2010, Crist courageously vetoed legislation that would have required ultrasounds for women seeking an abortion.",
    "While state sentencing guidelines suggested 18 years in prison, judges have wide discretion to consider a range of factors.",
    "The 2nd District Court of Appeal should bring some fairness to this case or send it back to the trial court to reconsider.",
    "Its clear where Crist stands on supporting the rights of women to make the most personal decision over their own bodies.",
    "He has a strong record of protecting abortion rights in Tallahassee and now in Washington as a member of the U.S. House.",
    "Prosecutors, the victims family and even the general public have rightly said that this case demands accountability.",
    "In fact, Charlie has a perfect score as a member of Congress from Planned Parenthood and NARAL Pro-Choice America.",
    "But the 24-year sentence Hillsborough County Circuit Judge Christopher Nash imposed last year is out of kilter.",
    "The appeals court should bring Herrins sentence in line, or direct the trial court to reconsider its fairness.",
    "Their actions in the moments before the disaster certainly dont justify a four-fold disparity in punishment.",
    "Alex Sink served as Floridas chief financial officer and a member of the Florida Cabinet from 2007 to 2011.",
    "While Herrins car struck the victims, it took two drivers in two cars that day to race along Bayshore.",
    "As she pushed her daughter in a stroller, Reisinger-Raubenolt stepped out to cross the roadway.",
    "Witnesses described a race as the two moved in and out of traffic lanes passing slower cars.",
    "Thats why many of Floridas women leaders are standing with Charlie Crist in this campaign.",
    "Theres no quibbling here: Herrin must be held responsible for this terrible loss of life.",
    "The Mustangs internal computer recorded its speed just before the collision at 102 mph.",
    "Barrineau later negotiated a plea agreement which carried a six-year prison sentence.",
    "But that standard applies to the fate meted out by the criminal justice system, too.",
    "In Florida, Charlie Crist already has been governor, and he is battle tested.",
    "Herrin pleaded guilty, but left his sentence to a judges discretion.",
    "Herrin and Barrineau were both charged with vehicular homicide.",
    "Editorials are the institutional voice of the Tampa Bay Times.",
    "And he is the Democrats best hope of defeating Republican Gov.",
    "The Crist record of standing up for abortion rights is clear.",
    "But these two defendants were involved in the same tragedy.",
    "She was the Democratic Partys nominee for governor in 2010.",
    "Follow @TBTimes_Opinion on Twitter for more opinion news.",
    "I know his clear record on defending abortion rights.",
    "Ron DeSantis record of assaulting abortion rights.",
    "That would turn women and doctors into criminals.",
    "I was among those who persuaded him to veto it.",
    "The crash occurred on May 23, 2018.",
    "That might not be the only danger.",
    "Every case is different.",
    "Thats how it should be.",
    "I know his values.",
    "So much for that.",
    "So is Gov."
  ]
}