{
  "id": 3620,
  "mediaId": 19,
  "date": "d2022-05-13T00:00",
  "headline": "Poll: Donald Trump Maintains Majority Support as Partys Frontrunner",
  "image": "https://media.breitbart.com/media/2020/12/Trump-Rallies-for-Loeffler-and-Perdue-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/13/poll-donald-trump-maintains-majority-support-as-partys-frontrunner/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    661,
    1147,
    1253,
    1710,
    2087,
    146,
    428,
    2661
  ],
  "sentences": [
    "It comes as Biden continues to struggle to rally Democrats ahead of the midterm elections as frontline? Democrats  those who are in vulnerable positions  beg party leaders to pursue bipartisan legislation in hopes of saving their majority in the wake of Bidens stunning lack of popularity.",
    "Perhaps what is most significant is that the figure represents a seven-point drop from the 40 percent who chose Biden in December 2021, further demonstrating the reality of Bidens waning support even among members of his own party.",
    "Most Republicans continue to support former President Donald Trump as the Republican Partys frontrunner in the 2024 presidential election, a University of Massachusetts Amherst released Friday found.",
    "Notably, 17 percent of voters chose Sen. Bernie Sanders (I-VT) as their first choice candidate, but he also stood as the top second choice among Democrats, garnering 19 percent support.",
    "The survey asked Republican respondents to rank their top three choices for individuals to run as the GOPs candidate in the 2024 presidential election.",
    "Despite Trumps firm grip on first, DeSantis remains the top second choice among Republicans, as 34 percent chose him in that category.",
    "That represents a three percent drop from the 37 percent who chose him as their second place candidate in December 2021.",
    "While it showed Biden leading, he failed to garner majority support as the top candidate, seeing just 33 percent.",
    "Third place remained a tie between Sen. Elizabeth Warren (D-MA) and someone else,? as both garnered 15 percent.",
    "Another 25 percent chose Sen. Ted Cruz (R-TX) as their third choice in the lineup, behind Trump and DeSantis.",
    "The full survey was taken May 5-9, 2022, among 1,000 respondents and has a +/- 3.5 percent margin of error.",
    "That figure is unchanged from the 55 percent who said the same five months ago in December 2021.",
    "The survey asked the same of Democrats in ranking the Democrat presidential candidate in 2024.",
    "Ron DeSantis (R) as their first choice, with no other candidate coming close.",
    "Most, 55 percent, chose Trump as their first choice.",
    "Another 20 percent chose Florida Gov."
  ]
}