{
  "id": 3629,
  "mediaId": 19,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Ron DeSantis: Joe Bidens Actions Show He Doesnt Care About Rising Gas Prices",
  "image": "https://media.breitbart.com/media/2022/03/I-Did-That-Biden-Sticker-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/13/ron-desantis-joe-bidens-actions-show-he-doesnt-care-about-rising-gas-prices/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    661
  ],
  "sentences": [
    "Cook Inlet lease sale would not proceed due to insufficient industry interest,? a spokesperson for the Interior Department said this week, adding that the lease sales in the Gulf will not proceed due to contradictory court rulings on the leases?:\nWhen the president first took office in 2021, he signed an executive order freezing all new oil and gas leasing on federal lands only to have it struck down by Judge James Cain, a Trump appointee.",
    "Rather than expand domestic energy production, he continues to reduce U.S. production capacity (increasing our reliance on foreign oil) by canceling our oil & gas leases,? he added:\nAmericans are struggling with record gas prices  up over 50% since Biden took office  but he doesnt care.",
    " Ron DeSantis (@GovRonDeSantis) May 12, 2022\nHis remarks follow news of President Biden canceling oil and gas lease sales in both Alaska and the Gulf of Mexico as Americans continue to feel the pain in their pockets at the gas pump under Bidens leadership.",
    "After appealing the ruling, a Washington, D.C. District Court invalidated another Gulf of Mexico lease sold by the federal government, lease 257.? The Alaska ruling affects a separate lease than the ones named by the Interior Department spokesperson.",
    "Rather than expand domestic energy production, he continues to reduce U.S. production capacity (increasing our reliance on foreign oil) by canceling our oil & gas leases.",
    "Floridians will experience some reprieve in October, as DeSantis signed a $1.2 billion tax relief package, which includes gas tax relief for the month of October.",
    "Were doing $200 million in gas tax holiday, so that will reduce the fuel tax on October 1st by about 25 cents a gallon,? DeSantis said at the time.",
    "Americans are struggling with record gas prices  up over 50% since Biden took office  but he doesnt care,? the governor said.",
    "Ron DeSantis (R) said on Thursday as prices at the pump continued to reach record highs.",
    "President Joe Bidens actions show he doesnt care? about rising gas prices, Florida Gov.",
    "The U.S. national gas price average broke another record on Thursday, reaching $4.418.",
    "On Friday, they rose yet again, reaching an average of $4.432.",
    "That is up from $4.37 on Tuesday  another record setting day."
  ]
}