{
  "id": 3632,
  "mediaId": 129,
  "date": "d2022-05-12T20:55",
  "headline": "Republicans Need a New Leader. Theyre Looking to Florida.",
  "image": "https://static01.nyt.com/images/2022/05/15/opinion/12lowry1/12lowry1-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/05/12/opinion/ron-desantis-conservatism.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    718,
    1147,
    2087,
    2517,
    428,
    524,
    539,
    3575,
    2661
  ],
  "sentences": [
    "The company never would have been granted this arrangement 55 years ago if its executives had told the states leaders, And, by the way, eventually, the Walt Disney Company will adopt cutting edge left-wing causes as its own.?\nThe broader point of making an example of Disney is to send a message to other corporations that there could be downsides to letting themselves be pushed by progressive employees into making their institutions weapons in the culture wars, and conclude its best to stick to flying planes, selling soda, and so on.",
    "Another is the Individual Freedom? bill, which, among other things, prohibits promotion of the concept that a person must feel guilt, anguish or other forms of psychological distress because of actions, in which the individual played no part, committed in the past by other members of the same race, color, sex or national origin.?\nOther times, Florida has pursued a laudable goal in a dubious manner.",
    "In two weeks in April alone, Mr. DeSantis signed a 15-week abortion ban, revoked the special tax status of Disney for its opposition to his Dont Say Gay? bill, threatened legal action against Twitter if it didnt agree to sell to Elon Musk (Floridas retirement pension fund is an investor) and signed a bill creating a task force to investigate election fraud.",
    "Indeed, any movement conservative sealed in a time capsule circa 1984 and emerging today would recognize Mr. DeSantis as a more or less standard Sunbelt Republican  a fiscal conservative wooing people and businesses to his state based on a favorable economic climate who is also anti-elitist, socially conservative and eager to reform public schools.",
    "Even if you would never consider voting for him, its important to understand the sources of his appeal and the direction of his politics, because one way or the other  whether he ever runs for president or not  Ron DeSantis is the new Republican Party.",
    "When I talked to the governor in May 2020 for an article about his Covid strategy, I found him  contrary to the crude image of him as a reckless ignoramus  well versed on the research and thoughtful about the lessons from other countries.",
    "Governor DeSantiss combativeness on hot-button social issues reflects Mr. Trumps influence, but hes gone even further and used government power as an instrument in the culture war  something Mr. Trump talked about but never really did.",
    "The libertarian Cato Institute ranks Florida the second-most free state in the country (after New Hampshire), and Mr. DeSantis has shown no inclination to change the tax, spending and regulatory policies that contribute to that status.",
    "One such example is the Dont Say Gay? bill, more properly known as the Parental Rights in Education bill, which prohibits classroom instruction on sexual orientation or gender identity in kindergarten through third grade.",
    "More conservatives are beginning to believe that the only countervailing institutional force is democratic political power as reflected in governors mansions, state legislatures and  likely beginning next year  Congress.",
    "Its Big Tech? bill seeks to keep social media companies from removing political candidates and other users from their platforms, but it has serious First Amendment conflicts and has been enjoined by a federal judge.",
    "Clips of Mr. DeSantis in confrontations with reporters spread on social media, and he repeated his mantra of defending freedom over Faucism.?\nIn general, there is no controversy that Mr. DeSantis doesnt address.",
    "The broad parameters of his strategy  recognize theres a balance between mitigation and its social and economic costs; keep the schools open; dont force students to wear masks  have now become widely accepted.",
    "The key, I think, is that for many people on the right, a libertarian-oriented politics was largely a way to register opposition to the mandarins who have an outsized influence on our public life.",
    "He was elected to Congress as a Tea Party conservative in 2012, and he is fond of boasting that Floridas budget is roughly half the size of New Yorks even though his state is more populous.",
    "Mr. DeSantis is the hottest thing in national Republican politics right now and he is doing everything to lay the groundwork, assuming he wins re-election this year, to run for president.",
    "The central liberal truth is that politics can change a culture and save it from itself.?\nGiven the state of play, conservatives have been learning to appreciate Moynihans liberal truth.",
    "Under his leadership, Florida did what it reasonably could to protect its nursing homes, while minimizing lockdowns and other restrictions because of their economic and social downsides.",
    "The central conservative truth is that it is culture, not politics, that determines the success of a society,? Senator Daniel Patrick Moynihan of New York once wrote.",
    "We havent heard from him in a significant way on trade or foreign policy  two of the key issues on which Trump populists have diverged from past Republican orthodoxy.",
    "If, by this, they mean that a President DeSantis would be more focused and disciplined in pursuing a conservative agenda than Mr. Trump was, theyre probably right.",
    "Meanwhile, his department of health issued guidance pushing back against the Biden administrations recommendations for treating youth with gender dysphoria.",
    "The news media was also much too quick to amplify claims by a former state health department employee that Florida was hiding a huge number of Covid deaths.",
    "Even if Mr. DeSantis is willing to avail himself of this use of government power, it doesnt mean that hes abandoning his limited-government orientation.",
    "In April 2021, the CBS program 60 Minutes? ran a flagrantly flawed and misleading report alleging corruption in the distribution of Floridas vaccines.",
    "The revocation of its special tax status is a frankly retaliatory act that also presents free-speech issues and could prove a legal and policy morass.",
    "Hes been a highly committed advocate of expanding charter schools and scholarship programs to help families send their children to private schools.",
    "Whats clear is that his synthesis of the old and new, and the resonance it has had with the rank-and-file, points to the Republican future.",
    "If Floridas culture-war initiatives succeed, the education establishment in the state will not mindlessly absorb the latest left-wing fad.",
    "Ron DeSantis of Florida appeared with the Fox News host Laura Ingraham for a town hall that lasted the full hour of her prime-time show.",
    "If any of Mr. DeSantiss Republican admirers are hoping he will chart a path back to the pre-2016 party, theyll probably be disappointed.",
    "Instead, the governor is a leader in a new, Trump-inflected party, but without the character flaws and baggage of the former president.",
    "Progressive domination of elite culture has now grown to include formerly neutral institutions like corporations and sports leagues.",
    "Thanks to his Covid response, Mr. DeSantis attained a status that is invaluable in Republican politics  that of a lightning rod.",
    "How can a limited-government Tea Party Republican like Mr. DeSantis have become comfortable with this use of government?",
    "For all the talk of how Trumpy Mr. DeSantis is, though, there is much about him that recalls the partys pre-Trump era.",
    "Sometimes this has involved areas, like public education, where the government has every right to set the rules.",
    "That said, Disney got a truly extraordinary deal from the state that allowed it, in effect, to run its own city.",
    "What stands out as a true departure is Mr. DeSantiss willingness to use government power in the culture war.",
    "That kind of airtime tends to be reserved only for Donald Trump, but Mr. DeSantis has had a meteoric rise.",
    "Hes far and away the most popular potential 2024 presidential candidate among Republicans after Mr. Trump.",
    "When many states were instituting far-reaching lockdowns and mask requirements, he took a different path.",
    "Its impossible to know how that will go  he could get blocked by Mr. Trump or not live up to the hype.",
    "Mr. DeSantiss detractors are fond of saying that hes worse than or more dangerous than Mr. Trump.",
    "For that matter, how is it that so many Tea Party types moved so easily toward Trumpist populism?",
    "His legend grew with every attack on him, especially the ones that were inaccurate or unfair.",
    "And it turns out that populism is an even more pungent way to register this opposition.",
    "In other words, the culture of these institutions will have changed for the better.",
    "He hasnt endorsed industrial policy, a priority of a segment of the populist right.",
    "On Covid, he has consistently emphasized the importance of individual autonomy.",
    "Hes sharp in his rejoinders to reporters, but never gratuitously insulting.",
    "Corporations will be warier of wading into hot-button social fights.",
    "Mr. DeSantis became a Republican hero for his response to Covid-19.",
    "Hes proud and protective of Floridas status as a low-tax state.",
    "He cares about facts and takes time to master them.",
    "Mr. DeSantis doesnt have Mr. Trumps failings.",
    "Rich Lowry is the editor of National Review.",
    "Otherwise, it is completely wrongheaded.",
    "Then theres the fight with Disney.",
    "Hes firmly anti-regulation.",
    "None of this is new.",
    "Two weeks ago, Gov."
  ]
}