{
  "id": 3634,
  "mediaId": 238,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Opinion Trumpism is leaving old-line conservatives behind. Can they catch up?",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/12/americas-crisis-self-doubt-video-conservatives/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Waldman",
  "authorUrl": "https://www.washingtonpost.com/people/paul-waldman/",
  "termIds": [
    661,
    1147,
    340,
    428,
    2945
  ],
  "sentences": [
    "In the process, they show just where the conservative center of gravity is today; it might have been titled, Hey, can we get in on this exciting new culture war, too??\nThe signatories are, to varying degrees, a whos-who of establishment conservatives who clearly are looking to a future that is post-Trump but not post-Trumpism (the former president is never mentioned).",
    "This must not stand; their goal is to reclaim what once was a consensus view of America that has now become bitterly contested.?\nTo that end, we must of course reimpose a more agreeable crude propagandizing in schools, attack government for being unfair to us, and invigorate free speech? by censoring teachers and punishing companies that express views we dont like.",
    "Ron DeSantis and Missouri Sen. Josh Hawley enthusiastically advocating the use of state power to banish ideas the GOP doesnt like and crush its enemies, the temptation is strong; any lingering affection they have for free-market capitalism may yield to the thrill of targeting people they hate.",
    "Titled The Mount Vernon Statement,? unveiled near George Washingtons estate, and featuring old-timey parchment and flowing script, it created a way for those Reagan-era conservatives to jump on the tea party bandwagon, a kind of Founding Father cosplay that was terribly in vogue at the time.",
    "The idea that there was some prior moment in which there existed a consensus view of America? that was not contested  a view that America is and always has been 99 and 44/100 percent pure, its mistakes and weaknesses but minor blemishes dealt with long ago  is utterly preposterous.",
    "Black people never walked by statues of Confederate generals and said to each other, Yeah, those guys really were great.? The difference now is that challenges to the old narratives are gaining purchase and momentum, creating a deep unease the right wants to exploit.",
    "You can see them trying in an interesting new proclamation, titled Americas Crisis of Self-Doubt,? published Thursday in the National Review and signed by a few dozen old-school conservative luminaries, in which they enlist for the battle of the moment.",
    "It may be too soon to tell whether old-school conservatives who care most about upper-income tax cuts and reducing regulations on corporations will be fully on board with the authoritarianism thats become so trendy on the right.",
    "Throughout the last seven years  since Donald Trump first grabbed hold of the GOP  the old Republican establishment has felt besieged and disoriented, struggling to accommodate itself to the new reality of the right.",
    "And even if that was Trumps worldview, it doesnt require his participation, leaving such conservatives free to spurn him as a tactical matter without seriously criticizing anything he did or who he is.",
    "But for now, conservatives clearly believe that a belligerent nationalism focused on enemies within is enough to create an overarching structure within which all conservatives can feel comfortable.",
    "Its only possible to believe that if by consensus? you mean not the narrative everyone agreed on, but the one imposed from above by those in power which no one else had the ability to challenge.",
    "The idea that America is simultaneously beyond reproach (in its essence and history) and a nightmare of depravity (in its fallen present) is something all conservatives seem to agree on.",
    "They include magazine editors, think-tankers, former administration officials, public intellectuals, and a few politicians, some still influential but most who seem a bit on the outs.",
    "Its the same unease that led Trump to hit upon Make America Great Again? as his slogan: At some point in the past, things were right and proper, but now they arent anymore.",
    "The enemy now is anyone who challenges old hierarchies and raises uncomfortable topics:\nOur traditional heroes are under threat of being run out of the national pantheon.",
    "Our traditional values of fair play, free speech, and religious liberty are trampled by inflamed ideologues determined to impose their will by force and fear.",
    "The answer, they suggest, is a new grand struggle against liberalism, one promising all the purpose and glory of the Cold War or the global war on terror.",
    "Our institutions, from elections to the job market to law enforcement, stand accused of perpetuating a systemic racism that is impossible to eradicate.",
    "One thing, though, is clear: With the exception of a tiny number of dissenters, everyone in the Republican Party wants to get in on the act.",
    "Nevertheless, Americas Crisis of Self-Doubt? is reminiscent of a document signed in 2010 by a similar group of Republican greybeards.",
    "But it turned out that the tea party was all style; it was just trickle-down economics and racial panic in a tricorn hat.",
    "Our educational system, from kindergarten through graduate school, is increasingly a forum for crude propagandizing.",
    "But they want to frame the next phase of conservatism as something they are comfortable with  and a part of.",
    "The new authoritarianism is those things, too, but it may turn out to be something more frightening.",
    "Can they retain their influence and guide the partys future, or will they become irrelevant?",
    "How do they avoid being cast off by a new and aggressive generation of leaders?",
    "Our system of government is attacked as archaic, unfair, and racially biased.",
    "How can they stay on the conservative parade float?",
    "Only then can inflamed ideologues? be defeated.",
    "Thats because it has never existed.",
    "With figures such as Florida Gov.",
    "They may be right about that."
  ]
}