{
  "id": 3638,
  "mediaId": 65,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Republicans claim victory in congressional redistricting fight",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/7c97f2b8-6717-4fed-84c0-47409b2e5f3e/50361736-f150-42e7-b6d1-551bbd358233/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/republicans-claim-victory-congressional-redistricting-fight",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    661,
    761,
    1452,
    2409,
    428,
    478,
    562,
    3292,
    2661,
    2826,
    2926
  ],
  "sentences": [
    "FLORIDA SENATE PASSES DESANTIS CONGRESSIONAL MAP WIPING OUT DEM GAINS FROM REDISTRICTING\nBut former Attorney General Eric Holder, who leads the National Democratic Redistricting Committee (NDRC), asserted that the \"swift ruling striking down the DeSantis Map clarifies beyond doubt that the Governor was not trying to follow the law by insisting the legislature pass his map configuration  he was actively trying to break it.",
    "With the redistricting process complete in all but five states  court cases continue in New York, Florida and Kansas, and Missouri and New Hampshire have yet to enact congressional maps  Kincaid stressed that \"were going to be better than anybody thought we were going to be six weeks ago, and were pretty happy with the results.\"",
    "Republicans need a net gain of just five seats in the 435-member House in Novembers elections to regain the majority they lost in the 2018 midterms, and Kincaid predicted that \"with the [redistricting] victories, were probably at four to five more seats than we otherwise would be just through redistricting that we can go get.\"",
    "In the years following the 2010 redistricting cycle, courts tossed out maps draw by Republicans in four states  Florida, North Carolina, Pennsylvania and Texas  ruling that Republicans improperly used the party affiliations and race of voters to draw lines that favored GOP candidates, which is known as gerrymandering.",
    "And Burton argued that \"the reason they are engaging in reckless gerrymandering in the 11th hour  like ignoring court orders in Ohio and Ron DeSantis forcing a clearly unconstitutional map upon the people of Florida  is because they failed to draw themselves into a congressional majority everywhere else.",
    "EXCLUSIVE: The National Republican Redistricting Trust isnt letting what it terms a temporary setback in Florida prevent it from arguing that it bested its Democratic rival and has won the once-in-a-decade congressional redistricting face-off between the two major political parties.",
    "But he pointed to a recent article from the New York Times, a well-known punching bag for GOP leaders, and jokingly said \"when last week the New York Times actually wrote a news story that its clear Republicans have won redistricting I said it was time to retire.\"",
    "\"We unequivocally stopped Republicans from drawing their way to a permanent majority in Congress  they tried to gerrymander their way to power like they did 10 years ago, and we stopped them,\" NDRC president Kelly Burton highlighted in a statement to Fox News.",
    "Adam Kincaid, executive director of the NRRT, the GOP's primary organization to coordinate the partys redistricting strategy and build resources for its legal defense, highlights that the Democrats goal \"was to flip the House and keep it.",
    "Chris Christie  who along with former Secretary of State Mike Pompeo has served as a NRRT co-chair  emphasized that the groups successes are \"going to show for Republicans in the fall elections in 22 and maybe even better in 24.\"",
    "The judge said the governors map, which was passed by the GOP-controlled state legislature and quickly challenged by several voting rights groups, was unconstitutional because it diminished the electoral power of Black voters.",
    "\"The judge was bound by a bad precedent set last decade by a liberal Florida Supreme Court, who wrongly stretched beyond the language of Floridas constitution to impose an unconstitutional racial gerrymander,\" he argued.",
    "And Christie, who helped lead fundraising efforts for the NRRT, predicted that \"our success will make donors even more likely to continue to support our efforts because theyve seen we know how to make a difference.\"",
    "\"I think the bigger win is the number of seats that we were able to shore up that were competitive, the amount of resources that were going to be able to take from playing defense and going on offense,\" he said.",
    "And Christie emphasized \"when that map was thrown out as summarily as it was in New York, I think that was the last shoe to drop in terms of whether this was going to be a winning effort for us or not.\"",
    "The DeSantis Map diminishes Black voting power in Florida in clear violation of the state constitution, and it is now up to the members of the Florida Supreme Court to uphold the law as it is written.\"",
    "Republicans last month won a major legal victory in New York in their challenge against congressional and state Senate lines drawn by the Democratic majority in the blue state.",
    "\"The Voting Rights Act does not require a district that connects Jacksonville to Tallahassee and Florida should not be forced to impose a map that violates the 14th Amendment.",
    "Christie and Kincaid spoke exclusively with Fox News hours before a judge in Florida said on Wednesday that hed partially strike down a redistricting map drawn by GOP Gov.",
    "The congressional map is now fairer than it has been for decades, and these desperate, illegitimate power grabs are not the actions of people happy about that outcome.\"",
    "By doing these things, he can now really focus on seats that are competitive that he can flip without having to worry nearly as much about seats that he has to defend.",
    "Christie and Kincaid told Fox News that theyve seen a narrative shift the past couple of months in which partys had the upper hand in the current redistricting battle.",
    "Holder stressed that \"this decision is a step toward granting Black Floridians the opportunity to fairly elect representatives of their choosing to Congress.",
    "He claimed that \"theres about 16 Republican seats in states that we control that weve taken completely off the board, that are no longer competitive.",
    "\"The early media response was that we were getting our clocks cleaned and we werent going to be able to make a difference,\" Christie noted.",
    "The NRRT was formed in 2017, amid those court rulings, to serve as the central redistricting resource for Republicans in all 50 states.",
    "But Kincaid called the ruling unsurprising and said \"we are confident Florida's congressional map will ultimately be upheld on appeal.\"",
    "\"Well be up a couple seats from where we were going into it and thats a huge win considering the resource disadvantage,\" he said.",
    "The resource shift is going to be a massive part of this redistricting story that I dont think people have fully grasped yet.\"",
    "Floridas newly enacted congressional map follows the state's Fair Districts criteria, federal law, and the U.S. Constitution.",
    "It is vital that the voices of all voters be heard and for that to be possible Florida needs a new, fair congressional map.\"",
    "CENSUS SWEEPSTAKES: WHICH STATES WILL GAIN, LOSE HOUSE SEATS IN CONGRESSIONAL REDISTRICTING\n\"We went all in on New York.",
    "That same year their Democratic counterpart, led by Holder and supported by former President Barack Obama, also formed.",
    "Kincaid pointed to reports from earlier this year that suggested the Democrats were \"over performing on redistricting.\"",
    "Christie stressed that \"the resource shift is an important weapon weve now given to [House GOP leader] Kevin McCarthy.",
    "All of the commission states [where redistricting is controlled by nonpartisan commissions] were done at that point.",
    "The majoritys gone for them this fall and the majority is going to be harder for them to take back moving forward.\"",
    "\"Our point has been  the state constitutions  if theyre going to be applied to redistricting, should be applied.\"",
    "So weve been very specific and targeted where weve invested, and those targeted investments have paid off.\"",
    "Thats $55 million that we can take and now go on offense, or protect Republican incumbents in new places.",
    "\"While redistricting probably gives us four or five more targets, the resource shift has been massive.\"",
    "Its like writing a story about who won a basketball game at the 10-minute mark of the second half.",
    "What weve done is weve shifted not just the battlefield but the resources in that battlefield.",
    "Republicans argue that without the court rulings, they would currently control the House.",
    "And the only thing left on the table were Republican states and New York,\" Kincaid said.",
    "We are confident Florida's congressional map will ultimately be upheld on appeal.\"",
    "We knew New York was going to be a great test case for the country,\" Kincaid said.",
    "Those 16 seats  Republicans spent $55 million on defense in 2020 in those seats.",
    "Kincaid points to a bigger potential payoff that he says has been underreported.",
    "And that I think is great service weve done in the 22 cycle and moving forward.\"",
    "Judges redrew the maps, giving the Democrats better chances to win House seats.",
    "CHECK OUT THE LATEST FOX NEWS MIDTERMS POWER RANKINGS\nDemocrats disagree.",
    "Ron DeSantis that would give Republicans considerable advantages.",
    "What we knew was that we were in a position to go on a 20-0 run.",
    "All of the Democrat [controlled] states were done at that point.",
    "They flipped it but theyre not going to be able to keep it.",
    "\"We dont have unlimited resources like them [the NDRC].",
    "There was a whole bunch of scoring left to be done.",
    "Legal battles over redistricting are nothing new.",
    "\"The stories that were coming out in January.",
    "And former New Jersey Gov.",
    "Theyve failed to do that."
  ]
}