{
  "id": 3639,
  "mediaId": 223,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Gender Transition Closets May Be Coming to a School Near You",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/102/8c4c0fb4-8f8c-420d-a392-ec11c2134ef1.jpg",
  "link": "https://townhall.com/tipsheet/saraharnold/2022/05/12/gender-transition-closets-may-be-coming-to-a-school-near-you-n2607147",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Arnold",
  "authorUrl": "https://townhall.com/tipsheet/saraharnold/",
  "termIds": [
    661
  ],
  "sentences": [
    " SanchoPanzy (@SanchoPanzy) February 15, 2022\nAn unnamed teacher from an unnamed school posted a TikTok video, from a now suspended account, explaining his intentions of the so-called safe spaces,? which is to basically indoctrinate and deceive young kids, while encouraging them to lie to their parents.",
    "pic.twitter.com/vRUVQA76wR\n Libs of TikTok (@libsoftiktok) March 24, 2022\nAccording to the Epoch Times, Thomas-Martin Edwards, a transgender California teacher, has posted videos, now removed, of himself walking around the classroom wearing high heels while touting the transition closets.",
    "pic.twitter.com/t1VM0OR96L\n RNC Research (@RNCResearch) April 8, 2022\nDemocrats have been condoning this type of appalling behavior for years, though it wasnt until recently that people have become more aware to such an extreme agenda.",
    " Alaskan Tequila (@LTequila4) February 15, 2022\nWhatever his interest in having kids change their clothes, it is disturbing how so many teachers/administrators seem to think they outrank their students' parents.",
    "Pete Buttigieg says that prohibiting classroom instruction of sex and gender theory in kindergarten classes will KILL KIDS.?\nThen he blames Ron DeSantis for inflation and gas prices.",
    "Unbeknown to their parents, kids can enter a transition closet? and choose from a wide variety of clothes and accessories to correlate with their desired gender that day.",
    "Radical activists, or as they would call themselves, teachers, have created transition closets? so students can dress as the gender they identify with while at school.",
    "And if you think thats sick, a website called, validbybrodie.com includes a start your own closet? kit for students, teachers and school administrators.",
    "Ron DeSantis (R-FL) have remained steadfast in calling out and fighting back against such woke indoctrination, despite major backlash.",
    "According to Transportation Secretary Pete Buttigieg, kids will die if the expression of gender identity is prohibited in classrooms.",
    "Near the bottom of the front page, it has photos of what minors look like after taking either testosterone or estrogen.",
    "So basically they are teaching these children to deceive their parents, subvert their authority and game the system.",
    "They would change into their normal clothes before going home, so as to leave their parents in the dark, of course.",
    "A middle school in Denver, CO is opening a transition closet? to provide clothing for transgender middle schoolers.",
    "In March, PJ Media reported about a transition closet at a Denver middle school.",
    "Even liberals can no longer ignore the disturbing turn things have taken.",
    "The website also sells clothes, accessories and transgender workbooks.",
    "If you thought the website couldnt go any further, it does.",
    "Additionally, it runs an online name change clinic.",
    "It's just indoctrination, recruitment and grooming.",
    "They don't all think that, of course.",
    "Strong leaders, though, such as Gov.",
    "TRANSGENDER TWELVE YEAR OLDS ??",
    "But many do."
  ]
}