{
  "id": 3641,
  "mediaId": 302,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "A St. Petersburg lumber yard will soon have affordable housing",
  "image": "https://www.tampabay.com/resizer//ahQa0jRr2QvMEr5WBYno4w8oVu0=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/G4GTYPHLQ5E3FI6SZWZEDCCNRI.jpg",
  "link": "https://www.tampabay.com/news/real-estate/2022/05/12/a-st-petersburg-lumber-yard-will-soon-have-affordable-housing/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "The lumber yard is ideal for an affordable housing project because its close to downtown, beaches, shopping centers and is near Gibbs High School and the popular bike trail, said developer Fred Hemmer of HP Capital Group, who also noted the need for affordable housing as Tampa Bay leads the nation in rising rent prices.",
    "Make it public and guarantee it as a home.?\nMuhammad said he hopes St. Petersburg uses the new law to be creative in industrial corridors like Childs Park, as long as the sites are inspected for safety, dont take away jobs and create housing thats permanently affordable.",
    "HP Capital Group, a real estate firm in St. Petersburg, plans to build 264 apartments along 34th Street S just north off the Pinellas Trail thanks to a new state law that expands zoning for the development of affordable housing, the developers said.",
    "While adding more projects can be helpful, Kilgore said its frustrating for many tenants who pay rising rents when theres plenty of homes in the area that are empty for most of the year because an investor or second-home buyer owns them.",
    "The [percentage of area median income] that was chosen for affordability is something that weve been asking for,? said Brother John Muhammad, a lead organizer with racial justice advocacy group Florida Rising.",
    "St. Petersburg Tenants Union organizer William Kilgore said he worries that many developers and some nonprofits arent incentivized to maintain affordable housing projects and will cut corners to save costs.",
    "And we want to keep it that way.?\nFlorida Rising hosted a rally outside the Fairfield Apartments site on May 1 for May Day to recognize the rights of workers and the rising costs of living in the area.",
    "Cappelli said theyre also looking at other sites around the area that would be eligible for affordable housing and expects other Florida cities to expand their zonings under the new state law.",
    "Amenities will include a community pool, meeting and conference rooms, a bike corral and repair workshop, a computer lab, and green spaces with picnic and barbecue pavilions.",
    "In 2020, the Florida Legislature passed House Bill 1339 which allows lots designated for residential, commercial or industrial zoning to be used for affordable housing.",
    "Initial designs called for a podium parking garage, but because of supply chain issues and inflation, they said they scrapped it for surface parking that was cheaper.",
    "The company has several projects around Tampa Bay,such as Reflection by St. Petersburgs Mirror Lake and the First Avenue Apartments in the Edge District.",
    "The city should have a much bigger effort to try combating the issue of investors buying up homes and taking housing out of the market,? Kilgore said.",
    "There may be 15 industrial sites in St. Petersburg that are eligible to be converted to affordable housing, according to the city.",
    "Rents in the area havent spiked in the neighborhood as much as the rest of the region, said Muhammad, a St. Petersburg native.",
    "About 25 percent will be for those who make under 80 percent, and 55 percent is set to go to people making below 120 percent.",
    "The Fairfields Apartments will be three buildings of apartments at fixed rates for households with low to moderate incomes.",
    "These laws and new ordinances give us that flexibility.?\nHP Capital Group is led by Hansen, Hemmer and Angelo Cappelli.",
    "Follow trends affecting the local economy\nThe developers said they expect to start construction by the end of the year.",
    "About 20 percent of the units will be reserved for people who make under 50 percent of the area median income.",
    "We understand what the need is and it far exceeds what that one project will be able to bring,? he said.",
    "Our focus is that affordable housing has to be many different types of housing and in different places.",
    "Some community advocates want the new law to be used not only by private companies but for public use.",
    "The Fairfield Apartments project would be one of the first examples of the new law put into action.",
    "The site is close to downtown, beaches, shopping centers, Gibbs High School and the Pinellas Trail.",
    "Were hoping this inspires other municipalities in Florida to follow suit,? Cappelli said.",
    "The site of a lumberyard in St. Petersburg is being converted for affordable housing.",
    "The site, at 3300 Fairfield Ave. S, is currently a lumber yard under Tibbetts Lumber.",
    "Its one of the better housing projects that weve seen coming through City Council.",
    "Projects like the Fairfield Apartments helps, but he said theres more to be done.",
    "He said he hopes the city can make more use of old industrial sites for housing.",
    "Affordable needs are all over,? said Nick Hansen, a partner at HP Capital Group.",
    "Muhammad said they chose that location as an example of whats possible.",
    "There should be more housing under public management, he said.",
    "It cant all be centered in one area of the city.",
    "Ron DeSantis signed it into law that summer.",
    "It would take up to 16 months to build.",
    "Gov."
  ]
}