{
  "id": 3642,
  "mediaId": 302,
  "date": "d2022-05-12T13:00",
  "headline": "Ben Diamond suspends bid for Pinellas congressional seat, citing DeSantis map",
  "image": "https://www.tampabay.com/resizer//8xkDZjtVHUsCT4W3DZOCZ3cszuY=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/HCE6M2A5OREY7BHTGLBARKBHKY.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/12/ben-diamond-suspends-bid-for-pinellas-congressional-seat-citing-desantis-map/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    4176,
    4738,
    254,
    2661,
    5012,
    5098,
    5132,
    5139
  ],
  "sentences": [
    "In light of these circumstances, Ive decided to suspend my campaign and turn my attention to doing everything I can as a lawyer to help with this legal battle now for Fair Districts.?\nFair Districts are amendments passed by voters and added to the Florida Constitution that prohibit political gerrymanders in the state and the dilution of minority voting power.",
    "In a statement, Lynn thanked Diamond for his service in the Legislature and said he will continue his campaign to keep this seat blue and fighting to bring our shared Pinellas County values to Washington.?\nDiamond also confirmed he will not run for reelection in the state House despite dropping his congressional bid.",
    "That map makes a Democratic win in the traditionally competitive 13th District more difficult, altering the district from one that voted for President Joe Biden by a margin of 4 percentage points to a place that would have gone to Donald Trump by about 6 points in 2020.",
    "Voting rights groups have filed lawsuits challenging DeSantis map, and the ultimate decision will likely be made by the Florida Supreme Court, which has become more conservative with three current DeSantis appointees, or could also be reviewed by the U.S. Supreme Court.",
    "Pete is the fifth-largest city in Florida .... we are one community here and we deserve to have one strong voice represent us.?\nDiamond said he doesnt expect any legal changes to the map to happen in time for this years election.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nBut once the map is fixed,? he said, I fully intend to resume my campaign to represent us in Washington,? which possibly means a run in 2024.",
    "Meanwhile, the 14th District, currently contained entirely within Hillsborough County, would stretch across Tampa Bay to pack in more Democrats, including St. Petersburg residents who live east of 34th Street.",
    "He said he has not yet decided if he will endorse either former Obama adviser Eric Lynn or state Rep. Michele Rayner for the seat, but will definitely support the Democratic nominee.",
    "Diamond raised about $1.2 million for the race, the most of any Democratic candidate, according to the most recent filings with the Federal Election Commission.",
    "Diamond was considered a strong contender for the Democratic nomination, but the new congressional map would make the district harder for a Democrat to win.",
    "After his expenses, Diamond had just under $790,000 on hand, most of which he said he intends to keep for a restart of his campaign in the future.",
    "It shouldnt be the Tallahassee politicians pre-determining the outcome and I do think thats what the governor and the Legislature did here.",
    "St. Pete city hall, the pier, the Trop, the Tampa Bay Times building, my house, are all now in the (14th) District,? Diamond said.",
    "DeSantis has said parts of Fair Districts violate the U.S. Constitutions guarantees of equal protection under the law.",
    "State Rep. Ben Diamond is suspending his campaign for the 13th Congressional District in Pinellas County.",
    "They rigged a number of these seats,? Diamond said, calling it an illegal gerrymander.?\nSt.",
    "Ron DeSantis and passed by the Republican-held Legislature as the reason for his decision.",
    "For our community in Pinellas, particularly in St. Petersburg, it splits our city in two.",
    "The Democratic St. Petersburg politician cited the new congressional map drawn by Gov.",
    "He threw his support behind Lindsay Cross, an environmentalist running for his seat.",
    "It weakens our voice in Washington.",
    "It should be (voters) choice."
  ]
}