{
  "id": 3645,
  "mediaId": 136,
  "date": "d2022-05-12T12:05",
  "headline": "How Ron DeSantis' Fundraising Compares to Donald Trump",
  "image": "https://d.newsweek.com/en/full/2036279/ron-desantis-fundraising-trump.webp?w=790&f=c01436d8002ee781adece159b380d670",
  "link": "https://www.newsweek.com/ron-desantis-florida-fundraising-trump-warchest-1705993",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    661,
    1147,
    2087,
    4041,
    200,
    428,
    3569,
    2661,
    2926
  ],
  "sentences": [
    "While Trump cannot use his war chest for a presidential campaign, and DeSantis' funding is being used solely for his own reelection bid, the figures are a warning sign to any potential candidate about the amount of support and money they may need to compete if they choose to throw their hat into the ring.",
    "The total from April means that DeSantis has managed to raise more than $113 million this campaign cycle, dwarfing any other Florida gubernatorial hopeful and approaching the amount that former president Trump is able to raise through his political committees.",
    "The fact that DeSantis is able to raise more than $100 million in donations without campaigning on a national scale shows the governor is \"in a new category\" with regards to fundraising, according to former Florida Senate President Bill Galvano.",
    "\"I think it's less about fundraising skill and more about the fact that he's created this reality in Florida that everybody wants to be part of the freedom that he's created,\" Galvano told the Sarasota Herald-Tribune.",
    "While Trump is still the overwhelming favorite to lead the GOP in 2024, DeSantis has frequently been found to be the main contender among voters should the former president be taken out of the equation.",
    "The donations for the record-breaking month included nearly $2.3 million raised by the governor's election campaign team, and $8.2 million from his political committee, Friends of Ron DeSantis.",
    "DeSantis was able to pull in nearly $10.5 million in donations in April, according to figures shared with Fox News and the Tallahassee Democrat, as the Republican seeks another term in office.",
    "A recent poll by The Heartland Institute and Rasmussen also found that DeSantis would beat President Joe Biden in a hypothetical election 46 percent to 35 percent if one were held today.",
    "Ron DeSantis' record-breaking fundraising month amid his reelection campaign is putting the Florida Governor on par with Donald Trump in terms of garnering financial support.",
    "In February, it was reported that Trump accumulated a $122 million war chest via his Super PACs in 2021, which at the time was nearly double that raised by DeSantis.",
    "Neither Trump nor DeSantis have formally announced their intentions to run for president in 2024, but both have long been thought of as the two main GOP contenders.",
    "Last year, it was reported that Trump had become irate at DeSantis because the governor refused to confirm that he would not be running for the presidency in 2024.",
    "Both men later denied there was ever any friction between the pair.",
    "DeSantis has been contacted for comment."
  ]
}