{
  "id": 3647,
  "mediaId": 302,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Intellectual freedom at Florida schools. Can you pass this quiz? | Editorial",
  "image": "https://www.tampabay.com/resizer//2georBhs1YdKSM7oUoHkvizXxaA=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/IIY2RMKZ7NB75M3YWCKQXADV2Y.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/12/intellectual-freedom-at-florida-schools-can-you-pass-this-quiz-editorial/",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3294,
    2661
  ],
  "sentences": [
    "(If you answered no,? thats just fine, absolutely A-OK. Oh, but do check your email for your new mandatory assignment, How to be a better patriot.?)\n5.",
    "The members of the Editorial Board are Editor of Editorials Graham Brink, Sherri Day, Sebastian Dortch, John Hill, Jim Verhulst and Chairman Paul Tash.",
    "The Republican-controlled Legislature mandated the annual survey to promote intellectual freedom.? But few are buying what lawmakers are selling.",
    "When Florida switches to a new accrediting organization to recognize the obvious quality of a state university education, should it:\na.",
    "Faculty and students at Floridas public universities recently completed a voluntary survey to gauge the political climate on campus.",
    "According to a Wall Street Journal analysis, theyre like the stealth STEM degree, in the top five of mid-career earnings.)",
    "How strongly do you agree with this statement: Undocumented immigrants should be denied access to public education.?\na.",
    "Only 3 percent of the universities population took part, likely because they see this exercise for what it is: A joke.",
    "Well, yes, the real-life Seminoles were never defeated, but the FSU football team seems to lose nearly every weekend.",
    "Understanding the U.S. history of discriminating against marginalized communities and its impacts on social equity.",
    "To make lifelong connections that will ensure you never fail even if you dont try that hard?",
    "Make sure that political interference by Tallahassee is recognized as a clear public good?",
    "c. A and B.\nd. To learn to think critically to become a responsible, informed citizen?",
    "The Thought Police have sent the offending party to the appropriate reeducation camp.)",
    "In the same spirit, we offer some questions for consideration in next years survey:\n1.",
    "c. Hes a cross between Clark Cable and Winston Churchill, in all the right ways.",
    "Do you believe that any Floridian who works hard can get ahead in this state?",
    "c. Penalize universities whose pesky professors keep speaking truth to power?",
    "Do the University of Florida mascots  Albert and Alberta Gator  make you:\na.",
    "True or false, philosophy majors actually make plenty of money, on average?",
    "d. Show that censorship is the child of fear and the father of ignorance.",
    "Confirm that war is peace, freedom is slavery, and ignorance is strength.",
    "They already know too much about the Constitution compared to citizens.",
    "Cmon, dude gets to ride a horse to midfield and throw a flaming spear.",
    "Ron DeSantis leadership over the past three years:\na. Fabulous.",
    "Editorials are the institutional voice of the Tampa Bay Times.",
    "(If you answered D, really, what are you, a philosophy major?)",
    "Weigh the football rankings more than classroom performance?",
    "c. Admire how Alberta applies lipstick with such short arms?",
    "Do you believe a woman should retain autonomy over her body?",
    "Racial discrimination is no longer a problem in America.?\na.",
    "What I didnt do until 2 p.m. because of last nights kegger.",
    "Do you believe a man should retain autonomy over his body?",
    "To punch a meal ticket to make as much money as possible?",
    "8-10  Not bad, but you need to brush up on your Newspeak.",
    "Follow @TBTimes_Opinion on Twitter for more opinion news.",
    "* With apologies to Eric Arthur Blair, aka George Orwell.",
    "e. Why isnt this great man already in the White House?",
    "That last bit of liberal propaganda just slipped in.",
    "Feel guilty about our treatment of the environment?",
    "Does Florida States Seminole mascot instill guilt?",
    "What disturbs you most about the Walt Disney Co.?",
    "How much should Floridians pay in taxes overall?",
    "Are those that tell you what you already know.",
    "How strongly do you agree with this statement?",
    "Is it better to call the Democrat Party:\na.",
    "Wonder why gators are walking on two feet?",
    "The point of your college education is:\na.",
    "c. A and B can be used interchangeably.",
    "14-16  Youre married to Ron DeSantis.",
    "d. Lyrics to Its a Small World.?\n11.",
    "d. Hed look good on Mount Rushmore.",
    "Youre a card-carrying #FloridaMan.",
    "Some of my best friends are Black.",
    "c. Can you repeat the question?",
    "c. Arent they called illegals??",
    "The Democrat Socialists Party.",
    "E.\nHow many did you get right?",
    "Standing up for civil rights.",
    "d. Or just call them losers.",
    "What does woke? mean to you?",
    "Now for some Economics 101.",
    "Believe it or not, they do.",
    "(Editors note: Apologies.",
    "a. Youre kidding, right?",
    "3-7  What are you, woke?",
    "0-2  Watch it, Commie!",
    "(This part is no joke.",
    "With some exceptions.",
    "c. Prove that 2+2=5.",
    "d. All of the above.",
    "The best books* \na.",
    "Admission prices.",
    "All of the above.",
    "They actually do.",
    "Really fabulous.",
    "11-13 Congrats!",
    "Answer key:\n1.",
    "c. Long lines.",
    "Very strongly.",
    "Very strongly.",
    "b. Commies.",
    "C or D; 7.",
    "Rate Gov.",
    "Nothing.",
    "A; 10.",
    "A; 11.",
    "B; 12.",
    "B; 13.",
    "B; 14.",
    "C; 15.",
    "A; 16.",
    "A; 8.",
    "A; 9.",
    "B; 2.",
    "B; 3.",
    "A; 4.",
    "A; 5.",
    "A; 6.",
    "Yes.",
    "Yes.",
    "10.",
    "No.",
    "No.",
    "No.",
    "12.",
    "13.",
    "14.",
    "15.",
    "16.",
    "b.",
    "b.",
    "b.",
    "b.",
    "b.",
    "a.",
    "b.",
    "b.",
    "a.",
    "b.",
    "7.",
    "6.",
    "b.",
    "a.",
    "8.",
    "b.",
    "9.",
    "a.",
    "b.",
    "a.",
    "b.",
    "4.",
    "a.",
    "b.",
    "a.",
    "3.",
    "b.",
    "2."
  ]
}