{
  "id": 3650,
  "mediaId": 195,
  "date": "d2022-05-12T09:28",
  "headline": "Red states plan special sessions to target abortion",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/mcmasterhenry_holcomberic_051122ap-meg-kinnard-darron-cummings_split_abortion.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/state-watch/3485445-red-states-plan-special-sessions-to-target-abortion/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reid Wilson",
  "authorUrl": "https://thehill.com/author/reid-wilson/",
  "termIds": [
    661
  ],
  "sentences": [
    "GOP governors and state legislators are planning to hold special legislative sessions later this spring and summer to consider new measures to remove or restrict abortion rights, after the Supreme Courts conservative majority is expected to reverse the landmark decision half a century ago guaranteeing those rights.",
    "I think the big focuses will largely be the same  gestational limits protecting human life much earlier than has been possible under Roe and Casey, basic safeguards preventing pill-by-mail abortions and enforcement of those laws, informed consent and alternatives to abortion programs and resources,? Glenn said.",
    "Speaker [Chris] Sprowls eagerly awaits the official and final opinion by the US Supreme Court, and he will continue to support efforts to protect innocent life, especially defenseless pre-born babies,? said Jenna Sarkissian, a spokeswoman for the powerful Republican House Speaker.",
    "The vast majority of House Republicans, including myself, have been abundantly clear that we want to take action to further protect life should the U.S. Supreme Court overturn, in full or in part, Roe,? state House Speaker Todd Huston (R) said in a statement.",
    "Some states may look to limit access to contraceptives, including by limiting access to publicly funded services or to emergency contraception which abortion opponents have continued to intentionally misconstrue with abortion pills,? Nash said in an email.",
    "Holcomb said last week that such a special session was on the table.?\nBy contrast, at the national level, Senate Minority Leader Mitch McConnell (R-Ky.) is downplaying the possibility of GOP action in a post-Roe v. Wade world.",
    "In the days after the high court confirmed the authenticity of a leaked draft opinion authored by Justice Samuel Alito striking down both Roe v. Wade and Planned Parenthood v. Casey, South Dakota Gov.",
    "In Texas, where lawmakers last year passed a measure allowing private citizens to sue those who facilitated an abortion, a prominent legislator said he would introduce new measures to go even farther.",
    " I think its safe to say there arent 60 votes there at the federal level, no matter who happens to be in the majority, no matter who happens to be in the White House,? McConnell said Tuesday.",
    "In Florida, legislators have remained coy on whether a forthcoming special session set to tackle insurance-related legislation, scheduled for May 23, would also include abortion measures.",
    "Katie Glenn, government affairs counsel at Americans United for Life, said that states with trigger laws would have to determine how their measures interact with the courts final ruling.",
    "If Republicans in Congress have any qualms about announcing new abortion restrictions in the event Roe v. Wade is overturned, they are not shared by their state-level counterparts.",
    "The current law, I believe and always have, does not have a basis in the U.S. Constitution, in my opinion, and the opinion of a lot of other people as well,? South Carolina Gov.",
    "Elizabeth Nash, associate director of state issues at the pro-abortion rights Guttmacher Institute, said she expected some conservative states to push boundaries even farther.",
    "South Carolinas state Senate agreed on Tuesday to come back to special session to take up new restrictions, though they have not yet said what those restrictions might be.",
    "Idaho state Rep. Brent Crane (R), the chairman of the House State Affairs Committee, said last week he would hold hearings on legislation banning emergency contraception.",
    "States that have passed abortion restrictions that have been enjoined by the courts prior to this year would have to petition federal courts to remove any injunctions.",
    "One hundred Indiana lawmakers signed a letter to Holcomb asking for a special session to deal with abortion restrictions once the courts decision becomes official.",
    "State Rep. Briscoe Cain (R) has said he would draft bills to criminalize abortion funds and stop groups that pay for abortions from doing business in Texas.",
    "The elimination of abortion rights at the national level would kick off a process in 18 states where so-called trigger laws are on the books.",
    "Christina Pushaw, DeSantiss spokeswoman, said the governor would not weigh in on the matter until the Supreme Court finalized its opinion.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Brad Little (R) in this years primary, has urged a new special session to remove exceptions from her states trigger law.",
    "At an event last week in Clearwater, DeSantis said he would wait to see the final ruling from the high court.",
    "Kristi Noem (R) pledged to call lawmakers back into special sessions to pass new restrictions.",
    "And in Florida, abortion rights opponents are ratcheting up pressure on lawmakers and Gov.",
    "Pete Ricketts (R) have come under pressure from legislators to call new sessions.",
    "Those laws ban abortions, to varying degrees, in the event Roe is overturned.",
    "Historically, there have been abortion votes on the floor of the Senate.",
    "Janice McGeachin (R), a far-right conservative challenging Gov.",
    "But Glenn said she expected other states to pass new measures.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The state House must now approve a similar resolution.",
    "Henry McMaster (R) told reporters last week.",
    "None of them have achieved 60 votes.",
    "Eric Holcomb (R) and Nebraska Gov.",
    "Ron DeSantis (R).",
    "Idaho Lt. Gov.",
    "Indiana Gov."
  ]
}