{
  "id": 3651,
  "mediaId": 409,
  "date": "d2022-05-12T09:27",
  "headline": "Newsom to Use Tax Breaks to Attract Companies from States That Restrict Abortion",
  "image": "https://www.nationalreview.com/wp-content/uploads/2021/02/gavin-newsom-california-governor.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/newsom-to-use-tax-breaks-to-attract-companies-in-states-that-ban-abortion/",
  "sentiment": "0.0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brittany Bernstein",
  "authorUrl": "https://www.nationalreview.com/author/brittany-bernstein/",
  "termIds": [
    661,
    1394,
    524,
    2590,
    2661,
    2934
  ],
  "sentences": [
    "Disney has been an outspoken critic of the measure, going so far as to say its goal as a company? is having the bill repealed by the legislature or struck down in the courts.?\nIn return, Florida stripped Disney of its independent special district? status, with Governor Ron DeSantis warning that if the company chose to use its economic might to attack the parents of my state,? he would treat it as a provocation? and fight back.?\nNewsoms proposal could be an invitation to Disney, which plans to relocate roughly 2,000 California positions to a new Florida campus despite LGBT groups protests.",
    "California Governor Gavin Newsom on Wednesday unveiled a proposal for a series of tax incentives in an effort to provide additional consideration for companies leaving states that have enacted restrictions on reproductive rights and anti-LGBTQ+ laws.?\nThe proposal would update tax credits, employer grants and other business incentive programs, according to the New York Times.",
    "Theyre coming for you next.?\nNewsoms proposal also comes amid an ongoing battle between Disney and Republicans after the company inserted itself into the conversation around Floridas Parental Rights in Education law, which prohibits instructors from teaching about sexual orientation and gender identity in kindergarten through third-grade classrooms.",
    "Were going to fight like hell, making sure that all women  not just those in California  know that this state continues to recognize and protect their fundamental rights.?\nDont think for a second this is where its going to stop,? Newsom said last week after the SCOTUS leak.",
    "Newsoms announcement comes after a leaked majority draft opinion in Dobbs v. Jackson Womens Health Organization revealed that the Supreme Court could be poised to overturn Roe v. Wade, returning the question of abortion to the states.",
    "Newsom also proposed nearly doubling his reproductive health funding plan to $125 million, including $40 million for grants to providers to offset the cost of abortions for uninsured women from both inside and outside California.",
    "Perhaps fewer businesses and residents would be fleeing California if Governor Newsom would focus on tackling the problems plaguing his own state.?",
    "Christina Pushaw, a spokeswoman for DeSantis, accused Newsom of spreading disinformation about other states,? according to the New York Times.",
    "California will not stand idly by as extremists roll back our basic constitutional rights,? Newsom said in a statement.",
    "The state has already seen an increase in women seeking abortions since the Texas Heartbeat Act passed last year.",
    "Florida doesnt restrict anyones rights,? Pushaw told the outlet.",
    "Pay attention, America."
  ]
}