{
  "id": 3652,
  "mediaId": 169,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "DeSantis-appointed judge says his map is an unconstitutional assault on Black voting power",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/01/ron-desantis-0118221.jpg",
  "link": "https://www.salon.com/2022/05/12/desantis-appointed-says-his-map-is-an-unconstitutional-on-black-voting-power/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    661
  ],
  "sentences": [
    "\"No matter how they repeatedly tried to justify themselves, it should come as no surprise to the Governor and this Republican-led legislature that the map is a violation of Florida's Fair Districts amendments and the U.S. constitution,\" state Rep. Kelly Skidmore, the top Democrat on the redistricting subcommittee, told CNN.",
    "DeSantis argued that Lawson's district was unconstitutional because it stretched 150 miles to connect from Tallahassee to Jacksonville but Smith said at the hearing that the district had historical roots in Black communities in a region that had been populated with plantations during slavery, according to CNN.",
    "RELATED: Ron DeSantis wants to hijack Florida redistricting  and cut number of Black districts in half\n\"The judge recognizes that this map is unlawful and diminishes African Americans' ability to elect representatives of their choice,\" Lawson said in a statement to the Associated Press after the hearing.",
    "Republican state lawmakers were working on their own maps in January when DeSantis' office tried to hijack the process and proposed its own map so-called \"race-neutral\" map that would cut the number of predominantly Black districts in the state from four to two.",
    "The map would eliminate the district represented by Rep. Al Lawson, D-Fla., one of the state's Black congressmen, and reduce the number of Black voters in the Orlando-area district represented by Rep. Val Demings, D-Fla., who is running for Senate.",
    "But the state Supreme Court in February refused to weigh in on DeSantis' request to determine whether Lawson's district must be kept intact, writing that the question requires a more complex review that it would undertake if the map is appealed.",
    "The Florida legislature approved a different map and a backup in case the first one got struck down but the plan was ultimately vetoed by DeSantis in March before he called lawmakers in for a special session where they passed his proposal.",
    "\"I am finding that the enacted map is unconstitutional under the Fair District amendment ... because it diminishes African Americans' ability to elect the representatives of their choice,\" Smith said during a hearing, according to CNN.",
    "The case is now expected to be decided by appellate courts and could go to the Florida Supreme Court, which not long ago had a liberal majority but has since been filled with DeSantis' conservative appointees.",
    "The DeSantis map was challenged by voting rights and civil rights groups, who argued the plan illegally pushed about 370,000 Black voters from one district into four whiter districts.",
    "Leon County Circuit Judge Layne Smith, who was appointed by DeSantis, said he would issue a formal order this week blocking the map approved by the governor from taking effect.",
    "We will undoubtedly be appealing his ruling and are confident the constitutional map enacted by the Florida legislature and signed into law passes legal muster.",
    "DeSantis' map would give the GOP a 20-8 advantage while the legislative proposal would give Republicans an 18-10 advantage and preserves Lawson's district.",
    "Republican lawmakers passed their own maps instead but they were vetoed by DeSantis and the GOP ultimately caved and agreed to approve DeSantis' map.",
    "\"DeSantis wanted the Supreme Court to violate the separation of powers and engage the judicial branch in partisan politics,\" he told Politico.",
    "The only way to protect against that harm is to assure that a constitutional voting map is put in place before the election actually occurs.\"",
    "DeSantis' map violates state court precedent that requires minority voters to be able to \"elect representatives of their choice,\" Smith said.",
    "Republicans currently hold a 16-11 advantage in the state's House delegation, though Florida added a 28th seat after the latest census.",
    "Smith said he would issue an order replacing DeSantis' map, likely with one of the two passed by the legislature earlier in the year.",
    "\"DeSantis is wrong for enacting this Republican-leaning map that is in clear violation of the U.S. and state constitutions.\"",
    "\"As Judge Smith implied, these complex constitutional matters of law were always going to be decided at the appellate level.",
    "The move came after an unprecedented intervention from DeSantis' office into the state's redistricting process.",
    "\"Once an election is done, there's no do-over,\" attorney John Devaney told the judge, according to Politico.",
    "Critics have contended for months that DeSantis' proposal was an attempt to suppress Black voting power.",
    "The groups called for an immediate injunction before a full trial before primary deadlines in June.",
    "DeSantis' proposal would give the GOP an advantage in 20 of the state's 28 congressional districts.",
    "Ron DeSantis' congressional map because it unconstitutionally suppresses Black voters.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "DeSantis' office vowed that the ruling would \"undoubtedly\" be appealed.",
    "Lawson at the time praised the court for \"making the right decision.\"",
    "We look forward to defending it,\" spokeswoman Taryn Fenske told CNN.",
    "A Florida judge said Wednesday that he would block Republican Gov.",
    "Subscribe to our morning newsletter, Crash Course.",
    "\"They wisely and correctly rejected his request.\"",
    "\"The harm is done.",
    "Read more:"
  ]
}