{
  "id": 3656,
  "mediaId": 323,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Texas Regulation of Social-Media Platforms Allowed by Appeals Court",
  "image": "https://images.wsj.net/im-542718/?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/texas-regulation-of-social-media-platforms-allowed-by-appeals-court-11652322676",
  "sentiment": "0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jacob Gershman",
  "authorUrl": "https://www.wsj.com/news/author/jacob-gershman",
  "termIds": [
    661
  ],
  "sentences": [
    "Republican Texas Attorney General Ken Paxton tweeted that HB 20 is back in effect,? saying the Fifth Circuit made the right call here.?\nMatt Schruers, president of the Computer & Communications Industry Association, tweeted in response to the ruling: This unexplained order contravenes established First Amendment law.? The group co-filed the lawsuit against HB 20 with NetChoice, another trade organization.",
    "Some have said examples of speech suppression by online platforms include Twitters election-season clampdown on the New York Posts coverage of Hunter Biden, its recent suspension of a conservative satire site and past Facebook restrictions on posts about the origins of Covid-19.",
    "Social-media companies have come under increasing fire from both conservative activists and free-speech advocates, including the potential Twitter Inc. owner, Elon Musk, who say Americans have been muzzled on major platforms that operate essentially as public squares.",
    "A federal district judge in Austin last December held that social-media platforms have a First Amendment right to moderate content disseminated on their platforms and issued a preliminary injunction that blocked the state from enforcing the law, known as HB 20.",
    "The Texas regulations make it unlawful for social-media platforms with at least 50 million monthly active users to censor users based on their viewpoints, applying to sites including Facebook, Instagram, Pinterest, TikTok, Twitter, Vimeo, WhatsApp and YouTube.",
    "Texas Republicans enacted the social-media law last year, saying they were striking back against what they view as Silicon Valleys suppression of conservative political views on Facebook, Twitter and other major platforms.",
    "A federal appeals court ruled Wednesday that Texas for now can enforce a law that prohibits the internets biggest social-media platforms from suppressing users content based on the viewpoint of their speech.",
    "The Post and Dow Jones, the publisher of The Wall Street Journal, are owned by News Corp.\nThere is a dangerous movement by some social-media companies to silence conservative ideas and values,? Texas Gov.",
    "All three judges on the panel were appointed by Republican presidents, while the judge that originally sided with the tech industry was appointed by President Barack Obama.",
    "The industry warned that the law would flood their platforms with hate speech, dangerous medical misinformation, terrorist propaganda and foreign-government disinformation.",
    "It doesnt apply to internet-service providers, email providers and news sites, nor to content that incites criminal activity or consists of specific threats of violence.",
    "The law allows Texas residents, or anyone doing business in the state, to sue platforms for alleged violations and seek court orders against content removal.",
    "Trade groups representing tech giants sued to challenge the law, arguing it was a brazen and unconstitutional attack on their own freedom of speech.",
    "Circuit Court of Appeals issued a stay order that allowed Texas to begin enforcing the law while the states appeal continues.",
    "The panel, in a 2-1 vote, sided with the state in a one page-order that didnt explain the reasons for the ruling.",
    "Social-media platforms have said they dont discriminate based on users political views.",
    "A federal judge last year blocked a similar law in Florida signed by Republican Gov.",
    "On Wednesday, a three-judge panel of the New Orleans-based Fifth U.S.",
    "It also vests enforcement authority with the state attorney general.",
    "Greg Abbott, a Republican, said last year after signing the bill.",
    "The court is expected to issue a full ruling at a later date.",
    "Similar legal battles are taking place in other courts.",
    "Ron DeSantis, and the case remains in litigation."
  ]
}