{
  "id": 3657,
  "mediaId": 136,
  "date": "d2022-05-12T01:05",
  "headline": "Gov. Gavin Newsom Expected to Propose Millions More for Abortion Services",
  "image": "https://d.newsweek.com/en/full/2035992/newsom.webp?w=790&f=00789871fa2f6baac1daa65532ab5b8f",
  "link": "https://www.newsweek.com/gov-gavin-newsom-expected-propose-millions-more-abortion-services-1705844",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia McKnight",
  "authorUrl": "https://www.newsweek.com/authors/patricia-mcknight",
  "termIds": [
    661,
    1394,
    400,
    524,
    2590,
    2661
  ],
  "sentences": [
    "\"We're expanding access to these critical services, welcoming businesses and their employees fleeing anti-abortion states, and reaffirming our commitment to continuing to work closely with the Legislature and reproductive rights stakeholders to further solidify California's leadership on abortion rights,\" Newsom said.",
    "\"California will not stand idly by as extremists roll back our basic constitutional rights; we're going to fight like hell, making sure that all womennot just those in California know that this state continues to recognize and protect their fundamental rights,\" Newsom said in a statement.",
    "On Wednesday, Newsom unveiled a $125 million Reproductive Health Package that aims \"to further bolster California's health care infrastructure, expand access to services for patients, and help prepare for the influx of people seeking reproductive health care from other states.\"",
    "After Politico published a leaked draft opinion from the Supreme Court stating the majority favors overturning Roe, the 1973 decision providing legal federal protection for women seeking abortions, lawmakers have been forced to choose a side: anti-abortion or abortion rights.",
    "Newsom's package will also divert funds to operate a website \"that provides accurate and updated information\" on abortion rights under state law, resources for reproductive health providers and options for coverage of reproductive health services.",
    "\"The governor's proposed investments in the May Revise are a critical step towards not only maintaining but increasing access to abortion in California,\" said CEO & President of Planned Parenthood California Jodi Hicks.",
    "Amid the nationwide strife over Roe v. Wade, California's Democratic Governor Gavin Newsom plans to expand access to abortions and reproductive health care with a proposed $125 million plan.",
    "The package includes grant funding for reproductive health care providers to help offset the cost of services for low-income individuals who don't have health care.",
    "The money will also go toward the community-based reproductive rights and justice organizations to increase their outreach and education on sexual health.",
    "Newsom is in part referring to Walt Disney Company in Florida, which has come under fire for opposing Florida Governor Ron DeSantis' \"Don't Say Gay\" bill.",
    "The governor is also proposing incentives for businesses looking to relocate from red states with anti-abortion and anti-LGBTQ stances to California.",
    "California is gearing up to accommodate an anticipated flood of out-of-state women seeking abortion care from conservative states.",
    "Newsom said he welcomes any businesses that share \"California's values\" of diversity and inclusion.",
    "Newsom has since invited the company to relocate to California where Disneyland is stationed."
  ]
}