{
  "id": 3658,
  "mediaId": 151,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "'The great MAGA king': Biden sharpens midterm attacks",
  "image": "https://www.politico.com/dims4/default/f210725/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fdb%2Fca%2F41670bac48959f7b10fca31dc6a5%2Fbiden-20527.jpg",
  "link": "https://www.politico.com/news/2022/05/11/great-maga-king-president-joe-biden-midterm-00031981",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "At a DNC fundraiser later Wednesday, the president called his 2020 victory against Trump a low bar,? and dug into his favorite phrase of late, MAGA Republicans,? twice calling these politicians petty,? mean-spirited? and extreme.?\nThey are cowered by Trump,? Biden said, telling the audience that Democrats have to make their case in 2022. The fact of the matter is, they run the show  the MAGA Republicans.",
    "Theyre going to storm Cinderellas castle before this is over.?\nWhile Biden said that the disclosure of the Supreme Courts draft opinion that would overturn Roe v. Wade could spark enthusiasm in Democratic voters, he didnt shy away from acknowledging the rough road ahead for his party.",
    "Look at my predecessor, the great MAGA king  the deficit increased every single year he was president,? Biden said in Chicago at the International Brotherhood of Electrical Workers International convention, contrasting the deficit reductions during his tenure with Trumps term.",
    " It really is beyond the pale.?\nThe president, speaking to roughly 40 guests, said the GOP has a radical agenda? and said it isnt your fathers Republican Party.?\nIts one thing to take on Disney World,? he said, referring to Florida Gov.",
    "The noticeable change in tone comes as economic concerns hover over Democrats prospects and the White House tests out a new strategy  painting a clear picture of the differences between Democrats and Trump and his followers.",
    "With a little over six months to go until the November midterms  what is often a referendum on the presidents performance  Biden is moving into full-fledged campaign mode.",
    "President Joe Biden speaks at the 40th International Brotherhood of Electrical Workers (IBEW) International Convention at Chicago's McCormick Place on May 11, 2022.",
    "Throughout the day, he laid into the GOP and baited former President Donald Trump, even testing a new nickname for his predecessor: the great MAGA king.",
    "The president traveled the country on Wednesday, sharpening his lines of attack against the Republican Party as primary season kicks into full gear.",
    "| Andrew Harnik/AP Photo\nBy Myah Ward\n 05/11/2022 08:42 PM EDT\nJoe Biden midterm mode has officially been activated.",
    "Ron DeSantis battle with Walt Disney Co. over his Dont Say Gay? legislation.",
    "Inflation is going to scare the hell out of everybody,? the president said.",
    "With his MAGA king nickname, Biden was just getting started."
  ]
}