{
  "id": 3661,
  "mediaId": 157,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "Ron DeSantis to appoint new Florida secretary of state who could oversee his 2022 re-election: report",
  "image": "https://www.rawstory.com/media-library/ron-desantis.jpg?id=29798376&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/ron-desantis-secretary-of-state/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bob Brigham",
  "authorUrl": "https://www.rawstory.com/u/bob_brigham",
  "termIds": [
    661,
    428,
    2661
  ],
  "sentences": [
    "Ron DeSantis, according to a Thursday email sent to the states county election supervisors by Maria Matthews, director of the states Division of Elections,\" the Tampa Bay Times reported Thursday.",
    "\"Since joining the DeSantis administration, she has won bipartisan praise, particularly for the states handling of the 2020 election, one of the states smoothest in decades,\" the newspaper noted.",
    "\"Despite the states success with that election, DeSantis and the Republican-controlled Legislature have passed numerous changes to the states voting laws in the name of rooting out voter fraud.",
    "Ron DeSantis will get to appoint a new chief elections officer who will oversee Florida's 2022 election -- in which the governor is running for re-election.",
    "It is against the backdrop of Trump continuing to push his \"big lie\" of election fraud that DeSantis will appoint a new secretary of state to replace Lee.",
    "This will allow DeSantis to appoint a new official, who will oversee the Florida Division of Elections, which is within the Department of State.",
    "\"Florida Secretary of State Laurel Lee is stepping down Monday in a precursor for a likely run for a Tampa Bay-area congressional seat.",
    "Nearly all of those changes have led to lawsuits by civil rights and advocacy groups, which have argued they were unconstitutional.\"",
    "In the same election, Katherine Harris was chosen by the voters as the last elected secretary of state.",
    "The secretary of state was elected by the voters until the passage of Amendment 8 in 1998.",
    "Lee submitted a letter of resignation to Gov.",
    "Republican Gov."
  ]
}