{
  "id": 3668,
  "mediaId": 234,
  "date": "d2022-05-12T00:00",
  "headline": "Ron DeSantis' Redistricting Map Apparently Deemed Too Racist Even For a DeSantis-Appointed Judge",
  "image": "https://media.vanityfair.com/photos/627d34c3c869e30568428313/master/w_2240,c_limit/1234724021",
  "link": "https://www.vanityfair.com/news/2022/05/florida-judge-rules-desantis-redistricting-map-unconstitutional",
  "sentiment": "0.0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eric Lutz",
  "authorUrl": "https://www.vanityfair.com/contributor/eric-lutz",
  "termIds": [
    661,
    1587,
    3879,
    146,
    482,
    562,
    3508,
    2661
  ],
  "sentences": [
    "People should pick their politicians, not the other way around.?\nIf giving the governor redistricting powers was undemocratic in and of itself, his proposed map was even more so: In targeting what he called unconstitutional racial gerrymanders,? he essentially engaged in gerrymandering himself, breaking up a predominantly Black district represented by Congressman Al Lawson and spreading its Democratic-leaning voters through four Republican-leaning districts; Republicans, who currently represent 16 of 27 Florida seats in the United States House of Representatives, would have a 20-8 advantage under the new map, which adds another district due to population growth.",
    "Its my hope that you recognize that when you begin to trample on marginalized people in the manner youre doing, which you know is wrong  thats when you have to do some self-reflection on whether or not we are doing the right thing,? Democratic State Senator Shevrin Jones said in a floor speech at the time, noting that Florida could wind up with only two Black representatives in Congress if the gerrymander went through.",
    "An appeals court took up the dare last week, temporarily reinstating the restrictions for the midterms and calling Walkers assessment that the legislation purposefully discriminates flawed.? It is possible that the legal fight over DeSantis map could go the same way, especially if it reaches the states Supreme Court, which is currently comprised entirely of Republican appointees  three of whom were named by DeSantis.",
    "On the one hand, DeSantis cartography is blatantly partisan, and would seem to clearly violate state Fair District standards that prohibit districts that deny racial or language minorities the equal opportunity to participate in the political process and elect representatives of their choice,? as Smith ruled Wednesday.",
    "It diminishes African-Americans ability to elect the representative of their choice.?\nThe decision, which the governors office says it will challenge when it is formally entered, will kick off a significant legal fight in the key battleground state that is expected to go all the way up to the state Supreme Court.",
    "The enacted map is unconstitutional under the Fair District amendment,? Leon County Circuit Court Judge Layne Smith said Wednesday, striking down part of DeSantis so-called race neutral? map and ordering a replacement from Harvard University professor Stephen Ansolabehere, a witness for the plaintiff.",
    "This is an opinion that full throatedly reads the Voting Rights Act in the expansive way that Congress intended it to be read, and essentially dares the higher courts to overrule it,? voting law expert Rick Hasen told NBC News after Judge Mark Walkers decision against Senate Bill 90.",
    "Critics, including the American Civil Liberties Union, denounced that as a dangerous and unprecedented move.?\nThe Florida Legislatures decision to cede this decennial process of redrawing lines for congressional districts to Gov.",
    "Florida Republicans last month gave DeSantis, a leading GOP culture warrior and potential presidential aspirant, the authority to put forth his own congressional map after he vetoed one approved by the legislature in March.",
    "We will undoubtedly be appealing his ruling and are confident the constitutional map enacted by the Florida Legislature and signed into law passes legal muster,? Taryn Fenske, a DeSantis spokesperson, told Politico.",
    "Florida Republicans rubber-stamped DeSantis' map in April, amid protests from voting rights advocates and Democratic state lawmakers, who chanted Stop the Black attack? as the GOP-controlled House approved the map.",
    "The minority vote is lowered enough that you would expect it to be substantially harder for minorities to elect the candidate of their choice,? said Smith, who was appointed to the court by DeSantis in 2020.",
    "On the other hand, Florida Republicans have already found success in the appeals process with their draconian voting restrictions, which were blocked by a lower court as intentionally discriminatory.",
    "It is critical to maintain congressional district five so minority voters have a voice at the ballot box in November.?\nI am optimistic that future courts will also do what is right,? Lawson added.",
    "\nSmiths ruling would preserve Lawsons 5th District and also allow a map drawn by Ansolabehere, a witness for the civil rights groups who challenged DeSantis gerrymander, to be used in its place.",
    "The Florida congressional map Ron DeSantis drew in an apparent effort to dilute the Black vote was blocked Wednesday as unconstitutional?  by a federal judge the governor himself appointed.",
    "DeSantis is wrong for enacting this Republican-leaning map that is in clear violation of the U.S. and state constitutions,? Lawson said in a statement Thursday.",
    "DeSantis is undemocratic,? the ACLU said at the time.",
    "It looks like we're experiencing playback issues.",
    "We look forward to defending it.?\nOur bad!",
    "It remains to be seen if they will."
  ]
}