{
  "id": 3674,
  "mediaId": 19,
  "date": "5/12/2022 12:00:00 AM",
  "headline": "DeSantis Win: Judge Dismisses Lawsuit Challenging Floridas Law to Dissolve Disneys Special District",
  "image": "https://media.breitbart.com/media/2022/04/rondesantisDisney5-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/12/desantis-win-judge-dismisses-lawsuit-over-revoking-disneys-special-district/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sean Moran",
  "authorUrl": "https://www.breitbart.com/author/sean-moran/",
  "termIds": [
    661
  ],
  "sentences": [
    "Anltonaga wrote that the residents do not plausibly allege they have suffered any concrete injury as a result of the alleged violation of Disneys First Amendment rights, and nothing in the Complaint shows Plaintiffs have a close relationship with Disney.?\nThe judge also dismissed claims that dissolving the Disney corporate carveout, otherwise known as the Reedy Creek Improvement District, would limit free speech:\nFar from it: Plaintiffs expressly allege that they expect Disney and the State of Florida to litigate this matter for a significant period of time[.",
    "See, e.g., Harris, 20 F.3d at 112425 (holding that case must be dismissed for lack of jurisdiction because plaintiff failed to show that non-parties whose First Amendment rights were allegedly violated faced hindrance in asserting their rights).",
    "DeSantis and Florida state legislators pushed for the legislation to strip Disney of its special corporate carveout after the megacorporation opposed DeSantiss Parental Rights in Education Act.",
    "He said that dissolving Disneys carveout was in reaction to the megacompany injecting pansexualism? into its programming for younger audiences and attacking Florida parents.",
    "Another notable exception to the general principle that a party may not sue for violations of others constitutional rights applies in the First Amendment context.",
    "U.S. District Court Judge Cecilia Altonaga ruled there were many reasons to dismiss the lawsuit, including the lack of standing over state issues.",
    "4-C, the law that eliminates Disneys special tax district, threatens with higher taxes, limits free speech, and violates a contractual obligation.",
    "This is just the beginning of the battle, as we are attempting to achieve justice for Florida taxpayers,? Sanchez said in a statement.",
    "But that exception relaxes traditional standing requirements only when a litigant asserts a claim of First Amendment overbreadth.",
    "Altonaga also said that none of the plaintiffs claims were ripe? because the legislation does not take effect until July 2022.",
    "In reaction to the ruling, Sanchez promised to refile another challenge on behalf of the plaintiffs by next week.",
    "This also comes as Disney promised to inject inject many, many, many LGBTQIA characters in its stories.?\nGov.",
    "The case is Michael Foronda v. Ron DeSantis in the U.S. District Court for the Southern District of Florida.",
    "And First Amendment retaliation claims do not qualify for watered-down third-party standing standards.",
    "They instead allege what is in essence a First Amendment retaliation claim on Disneys behalf.",
    "William Sanchez, a Miami lawyer and Senate Democrat candidate, filed the suit last week.",
    "DeSantis vowed in late April that Floridians would not have to pay for Disneys debt.",
    "Ron DeSantiss (R-FL) law to dissolve Disneys special governing and tax district.",
    "Three residents of Orange and Osceola counties claimed S.B.",
    "A federal judge dismissed a lawsuit challenging Gov.",
    "]? That fact alone warrants dismissal.",
    "Plaintiffs assert no such claim here."
  ]
}