{
  "id": 3679,
  "mediaId": 136,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "DeSantis-Appointed Judge Blocks His 'Unconstitutional' Redistricting Map",
  "image": "https://d.newsweek.com/en/full/2035950/desantis.webp?w=790&f=8460f45a039d403fd97c5ff301693d6d",
  "link": "https://www.newsweek.com/desantis-appointed-judge-blocks-his-unconstitutional-redistricting-map-1705836",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia McKnight",
  "authorUrl": "https://www.newsweek.com/authors/patricia-mcknight",
  "termIds": [
    661,
    1058,
    3804,
    146,
    428,
    571,
    2661,
    2945,
    5039
  ],
  "sentences": [
    "\"I am finding that the enacted map is unconstitutional under the Fair District Amendment ... because it diminishes African Americans' ability to elect the representative of their choice,\" Smith said during a court hearing conducted via Zoom on Wednesday, according to the Florida Phoenix.",
    "A \"race-neutral\" congressional map drawn by Florida Republican Governor Ron DeSantis that would have eliminated a Black district in a northern part of the state has been struck down by a DeSantis-appointed circuit court judge who found the redistricting plan unconstitutional.",
    "Leon County Circuit Judge J. Layne Smith, appointed to the circuit court by DeSantis two years ago, said he would issue a formal order later this week to keep the maps from taking effect in November's election, according to the Associated Press.",
    "In April, at a bill-signing news conference in Miami, DeSantis said the current 5th Congressional District \"divvies up people based on the color of their skin,\" adding that the district was racially gerrymandered.",
    "As the 2022 midterm elections near, Florida has yet to finalize redistricting maps after DeSantis vetoed the GOP-controlled legislature's proposed congressional districts on March 29.",
    "\"As Judge Smith implied, these complex constitutional matters of law were always going to be decided at the appellate level,\" DeSantis spokeswoman Taryn Fenske said in an email.",
    "DeSantis' map would have eliminated Florida's 5th Congressional District, which stretches from Tallahassee to Jacksonville and is represented by Black Democrat Al Lawson.",
    "\"The judge recognizes that this map is unlawful and diminishes African Americans' ability to elect representatives of their choice,\" Lawson said in a statement Wednesday.",
    "\"The district that has since been enacted and signed into law by the governor does disperse 367,000 African American votes between four different districts,\" Smith said.",
    "\"We will undoubtedly be appealing his ruling and are confident the constitutional map enacted by the Florida legislature and signed into law passes legal muster.\"",
    "\"I think that what they'll produce will be something that will be acceptable to folks and obviously we'd get my signature for proposing it,\" he said.",
    "\"DeSantis is wrong for enacting this Republican-leaning map that is in clear violation of the U.S. and state constitutions.\"",
    "Lawson claims DeSantis is choosing to erase minority access districts in Congress in order to gain more Republican votes.",
    "Afterward, the Republican-dominated House and Senate chose to not draw new maps, but instead asked DeSantis to do so.",
    "\"The African American population is nowhere near a plurality or a majority.\"",
    "Lawson's district is about 47 percent Black, according to the U.S. census.",
    "\"It will, though, have north Florida drawn in a race-neutral manner.\"",
    "However, Lawson disagrees that DeSantis' maps are race-neutral.",
    "Newsweek reached out to DeSantis and Lawson for comment.",
    "DeSantis' office said it will appeal the decision.",
    "Now, the governor's maps are also being shot down."
  ]
}