{
  "id": 3681,
  "mediaId": 302,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Florida Democrats pledge $15 million to mobilize voters, unify party",
  "image": "https://www.tampabay.com/resizer//UJZHlopQJhgB0mk83xtZDDEEjH4=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/5FMAIXS36RA23EBFXMUJSFURQY.JPG",
  "link": "https://www.tampabay.com/news/florida-politics/elections/2022/05/11/florida-democrats-pledge-15-million-to-mobilize-voters-unify-party/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "On Wednesday, the Democrats announced a push they said will meet these challenges with a new strategy that makes history.?\nAs part of a new campaign called Blue Shift Florida,? Democrats pledged to spend $15 million to accomplish a series of goals, including hiring around 200 organizers, registering voters, increasing the partys presence throughout the state by opening approximately 80 offices, and converting election-year efforts into year-round operations.",
    "In a show of party unity, top 2022 Democratic candidates  even those in competitive primaries  are chipping in funding, including U.S. Rep. Val Demings, whos running for Senate; U.S. Rep. Charlie Crist, agriculture commissioner Nikki Fried and state Sen. Annette Taddeo, who are all running for governor; plus Cabinet candidates and Democratic legislative leadership.",
    "Florida Democrats are contending with a perception that the state has become a money pit for donors who are considering spending elsewhere as the state party stares down a gap in registered voters, Republican dominance of the Legislature and a governor who has activated a national roster of campaign contributors.",
    "Christian Ziegler, vice chairman of the Republican Party, previously told the Tampa Bay Times hes confident about GOP victories this year, even as Democratic candidates try to capitalize on the outrage in their base over the looming Supreme Court decision on abortion.",
    "Whatever (past) efforts weve had at coordination have been anything but coordinated,? he said, adding that the statewide efforts of the past were dictated by whoever was at the top of the ticket  President Barack Obamas campaign in 2008 and 2012, for example.",
    "It hasnt been a bunch of folks sitting around the table collectively working on a statewide plan, a statewide budget, messaging, like any other campaign  bringing together the entire ticket to work together,? Diaz said.",
    "Outside groups will also contribute funding, including labor unions, abortion rights group Ruths List Florida and Florida Alliance, a progressive donor group that does not disclose its members.",
    "He emphasized that creating a coordinated infrastructure that extends beyond individual candidates will help in the years to come, including the next presidential race in 2024.",
    "While party leaders said this level of coordination is a new tack, its not the first time theyve launched efforts to increase voter registrations and mobilization.",
    "But what makes this coordinated campaign? historic, said party chairperson Manny Diaz, is the fact that Democrats in all races will be working together.",
    "Diaz said pessimism about Florida Democrats chances this year is centered in news coverage and doesnt reflect Democrats excitement on the ground.",
    "Ron DeSantis, announced that he and the party would work to register 1 million voters before the 2020 presidential election.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nNo one is buying what the Democrats are selling.",
    "All you have to do is look at election results from two years ago or polling or fundraising,? he said.",
    "Every possible metric you can (use to) measure the success of a state party  they are failing.?",
    "In 2019, Andrew Gillum, who unsuccessfully ran for governor against Gov.",
    "That effort fell far short of that goal."
  ]
}