{
  "id": 3685,
  "mediaId": 65,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Florida judge blocks Gov. DeSantis' redistricting map from taking effect before midterm elections",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/a236a87f-3a7d-4cb0-80e7-dbd6541be7f4/cf2efb3e-9c64-4550-953f-416028a0a146/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/florida-judge-block-gov-desantis-redistricting-map-midterms",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bradford Betz",
  "authorUrl": "https://www.foxnews.com/person/b/bradford-betz",
  "termIds": [
    661
  ],
  "sentences": [
    "\"The judge was bound by a bad precedent set last decade by a liberal Florida Supreme Court who wrongly stretched beyond the language of Floridas constitution to impose an unconstitutional racial gerrymander,\" NRRT executive director Adam Kincaid told Fox News.",
    "FLORIDA SENATE PASSES DESANTIS CONGRESSIONAL MAP WIPING OUT DEM GAINS FROM REDISTRICTING\n\"The judge recognizes that this map is unlawful and diminishes African Americans' ability to elect representatives of their choice,\" Lawson said in a statement.",
    "\"The district that has since been enacted and signed into law by the governor does disperse 367,000 African American votes between four different districts,\" Smith said in a video call with both sides.",
    "\"As Judge Smith implied, these complex constitutional matters of law were always going to be decided at the appellate level,\" DeSantis spokeswoman Taryn Fenske said in an email to Fox News.",
    "\"The Voting Rights Act does not require a district that connects Jacksonville to Tallahassee and Florida should not be forced to impose a map that violates the 14th Amendment.",
    "The National Republican Redistrict Trust (NRRT)  the GOP's primary organization to coordinate the party's redistricting strategy  called the judge's ruling \"unsurprising.\"",
    "Leon County Circuit Judge Layne Smith said he would issue a formal order either Thursday or Friday to keep the maps from taking effect in November's midterm election.",
    "\"We will undoubtedly be appealing his ruling and are confident the constitutional map enacted by the Florida legislature and signed into law passes legal muster.",
    "The governor's office drew up a map it described as neutral on race and party affiliation, and which it said abided by both the state and federal constitutions.",
    "Smith said the order will likely replace the DeSantis map with one of two that the Legislature included in a bill and sent to DeSantis in March.",
    "Smith said that while the DeSantis map is more compact, the issue of allowing Black voters to choose their representatives is more important.",
    "Lawson said it was critical to maintain the Congressional District 5 \"so minority voters have a voice at the ballot box in November.\"",
    "Floridas newly enacted congressional map follows the state's Fair Districts criteria, federal law, and the U.S. Constitution.",
    "CLICK HERE TO GET THE FOX NEWS APP\nSmith said his ruling will be based on the state constitution, not the U.S. Constitution.",
    "\"DeSantis is wrong for enacting this Republican-leaning map that is in clear violation of the U.S. and state constitutions.\"",
    "The district runs from Jacksonville west more than 200 miles to Gadsden County and nearly half of its population is Black.",
    "A Florida judge said he will issue an order this week to keep a congressional map approved by Republican Gov.",
    "The Republican-dominated House and Senate chose not to draw a new map, and instead passed the DeSantis map.",
    "The challenge focuses on Floridas 5th Congressional District, held by Democratic U.S. Rep. Al Lawson.",
    "Smith said he will issue his order as soon as he can so the state can immediately appeal it.",
    "The governor vetoed the bill and later called the legislature back into special session.",
    "We are confident Florida's congressional map will ultimately be upheld on appeal.\"",
    "Fox News' Paul Steinhauser and The Associated Press contributed to this report.",
    "\"The African American population is nowhere near a plurality or a majority.\"",
    "Ron DeSantis from taking effect because it disperses Black voters.",
    "Qualifying for federal office will run from June 13-17.",
    "Lawson said he was \"pleased\" with the judges decision.",
    "DeSantis' office confirmed it will appeal.",
    "We look forward to defending it.\""
  ]
}