{
  "id": 3686,
  "mediaId": 233,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Judge spikes DeSantis's Florida redistricting map that axed minority district as candidate deadline nears",
  "image": "https://www.gannett-cdn.com/presto/2022/05/10/PTAL/de7b2dde-35f4-4005-a3e6-8c2347018f98-repangienixon.jpg?crop=1135,639,x0,y0&width=1135&height=639&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/05/11/florida-redistricting-map-desantis/9734732002/",
  "sentiment": "0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Kennedy",
  "authorUrl": "",
  "termIds": [
    661,
    3804,
    3818,
    562,
    2661,
    2724,
    2926
  ],
  "sentences": [
    "He argued the move violated Floridas voter-approved Fair Districts constitutional amendments, which prohibit drawing legislative or congressional boundaries that for Black and Hispanic voters, diminish their ability to elect representatives of their choice.?\nMidterm elections and control of Congress\nFloridas 27 congressional districts are currently split 16-11, with Republicans controlling most seats.",
    "The only way to protect against that harm is to assure that a constitutional voting map is put in place before the election actually occurs.?\nA North Florida map that keeps the congressional district 5 in its current, Jacksonville-to-Tallahassee contours was proposed in court testimony by Harvard University political scientist and redistricting expert Steven Ansolabehere.",
    "Redistricting:Voters get fewer choices as Democrats and Republicans dig partisan trenches in redistricting\nJohn Devaney, who argued the plaintiffs case for the Florida League of Women Voters and three minority advocacy organizations, said the DeSantis map left North Florida Black voters without enough voting strength to elect a candidate of their choice.",
    "Still, the news and data analysis site FiveThirtyEight, which is closely following redistricting across the nation, has called Floridas congressional map darn close to the most egregiously partisan map in the country.?\nJasmine Burney-Clark, founder of Equal Ground, one of the plaintiffs in the case, said Smith's ruling follows an historic pattern.",
    "The Florida League of Women Voters joined with Equal Ground Education Fund, Florida Rising Together, Black Voters Matter Capacity Building Institute and a handful of voters from across the state in seeking the injunction to stop the new CD-5 boundaries from going into effect, which effectively puts on hold the entire map.",
    "Time is tight\nBut all involved in the case agreed Wednesday that time is tight, with federal candidate qualifying set for June 13-17 and county elections supervisors saying they needed a map finalized by the end of this month so that precincts could be reconfigured and other matters settled.",
    "I do find persuasive the arguments that were made about the diminishment of African-American votes.to the other districts where theyre now spreading,? said Judge Layne Smith, a DeSantis appointee, who issued his ruling after a three-hour hearing Wednesday.",
    "And because Democrats have such thin margins for control of Congress, any changes to congressional maps could have outsized influence in this year's midterm elections and therefore the fate of Biden's agenda for the last two years of his presidency.",
    "The new map, crafted by the Republican governor and approved by the Florida legislature last month, scatters more than 370,000 Black voters who had been in Lawsons heavily Black, Democratic-leaning district across four North Florida districts.",
    "At the heart of the case is the current congressional district 5 held by U.S. Rep. Al Lawson, a Black Democrat whose seat stretches from Jacksonville to the Tallahassee area and includes Gadsden County, the states only majority Black county.",
    "Jazil added that what the League of Women Voters and others are seeking relies on an interpretation of the state constitutions prohibition against diminishing Black voting strength, which conflicts with federal equal protection standards.",
    "But with control of Congress at stake in this falls elections, DeSantis could emerge as a hero to Republicans nationally if he is seen as having helped boost the GOPs chances of winning command because of enhanced numbers out of Florida.",
    "The decision, certain to be appealed by the state, brings a new level of at least temporary chaos to this years election season, with candidate qualifying for congressional seats in Florida only a month away.",
    "None of the districts would have a large Black voting population and all four would be Republican-leaning, part of a push by the governor to expand the number of GOP members of Congress from Florida.",
    "Census:US sees unprecedented multiracial growth, decline in the white population for first time in history\n'Classic cracking' of Black voters\nIts classic cracking,? Devaney said of the DeSantis map.",
    "Mohammad Jazil, attorney for Lee, the secretary of state, defended the approach by DeSantis and the legislature as constitutional and superior to the current wide-ranging district.",
    "While scattering Black voters in North Florida, the DeSantis congressional map creates 20 districts likely to elect Republicans, leaving eight considered Democratic leaning.",
    "As Judge Smith implied, these complex constitutional matters of law were always going to be decided at the appellate level,\" said Taryn Fenske, a DeSantis spokeswoman.",
    "Ansolabeheres plan was put forward as a substitute map Smith said he will recommend using in his order, which will probably not be finalized until Thursday or Friday.",
    "\"We will undoubtedly be appealing his ruling and are confident the constitutional map enacted by the Florida legislature and signed into law passes legal muster.",
    "Ron DeSantis were blocked from being used in this years elections Wednesday by a circuit judge who ruled they discriminate against Black voters in North Florida.",
    "The Tallahassee-area First District Court of Appeal could either take up the matter, or send the congressional redistricting case to the Florida Supreme Court.",
    "Its similar to a plan that was approved by the Florida legislature but vetoed by DeSantis, action that led lawmakers to support the governors map last month.",
    "When government overreach tries to suppress Black voters, the courts are our last line of defense to preserve justice and equity,\" Burney-Clark said.",
    "\"The judge recognizes that this map is unlawful and diminishes African Americans ability to elect representatives of their choice,\" Lawson said.",
    "Smith acknowledged wanting to give DeSantis-appointee Secretary of State Laurel Lee, Floridas top elections official, adequate time to appeal.",
    "Once an election occurs, theres no do-over,? said Devaney, an attorney with the Democratic-allied, Washington, D.C. firm, Perkins Coie.",
    "\"DeSantis is wrong for enacting this Republican-leaning map that is in clear violation of the U.S. and state constitutions.",
    ":Redistricting means new winners and losers\nJohn Kennedy is a reporter in the USA TODAY Networks Florida Capital Bureau.",
    "The state is getting another district in Congress this year because of population gains in the 2020 census.",
    "Capital Bureau USA TODAY NETWORK--FLORIDA\nTALLAHASSEE  Floridas new congressional boundaries drawn by Gov.",
    "Lets take that Black population and lets split it up into four districts where they have no voting power.",
    "And thats what weve got.?\nHe said it was important that Smith stop the plan from going into effect.",
    "Two of the four districts that have elected Black Democrats would be eliminated in the plan.",
    "He can be reached at jkennedy2@gannett.com, or on Twitter at @JKennedyReport",
    "She added, \"No Floridian  including Governor DeSantis  is above the law.",
    "This is one step forward in the fight to protect Black voters.\"",
    "We look forward to defending it.\"",
    "Lawson hailed Smith's ruling.",
    "What is gerrymandering?",
    "The harm is done."
  ]
}