{
  "id": 3689,
  "mediaId": 238,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Opinion A Trump endorsement is powerful. But clearly not insurmountable.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/11/nebraska-west-virginia-republican-primary-results-trump-endorsement-powerful-but-not-insurmountable/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Henry Olsen",
  "authorUrl": "https://www.washingtonpost.com/people/henry-olsen/",
  "termIds": [
    661,
    3103
  ],
  "sentences": [
    "Herbster fought back, airing an ad that alleged he was the victim of smears and compared his allegations to that of the charges levied against Supreme Court Justice Brett M. Kavanaugh in his confirmation hearings.",
    "The Trump-backed candidate in that state, Mehmet Oz, may be unable to overcome his weaknesses  46 percent of GOP primary voters view him unfavorably  to unite these factions, even if he wins the nomination.",
    "The pork-barreling that McKinley engaged in to pass the legislation also once would have earned him kudos, but in todays GOP, it exposed him to charges of helping President Bidens big-spending agenda.",
    "Indeed, a moderate who benefitted from Democrats re-registering as Republicans so they could vote for him finished third with 26 percent and even beat Herbster in the states three largest counties.",
    "Trump may not even be able to help someone as notable as former vice presidential nominee Sarah Palin, who is running for Alaskas open U.S. House seat with the former presidents endorsement.",
    "But he had angered Trump by voting for a commission to investigate the Jan. 6 Capitol riot and further dug his political grave by voting for the bipartisan infrastructure bill.",
    "An overwhelming majority of Republicans may like Trump personally, but only a minority of voters are so enamored of him that they will follow his lead through thick and thin.",
    "Pillen prevailed 34-30, winning big in the area around the state capital, Lincoln, and his Regents district while holding off Herbsters support in rural, Western Nebraska.",
    "Trump scored a big win in West Virginias 2nd Congressional District when his endorsed candidate, Rep. Alex Mooney, romped to victory over fellow Rep. David McKinley.",
    "This pattern  moderates doing better in urban areas, regular conservatives competitive with Trump endorsees in rural areas  also echoes the results in Ohio.",
    "Pete Ricketts (R) endorsed a conservative business person, Jim Pillen, who had also been elected to a seat on the University of Nebraska Board of Regents.",
    "Vance for Ohios Senate seat pushed Vance, who was already running a strong third, into the lead, but two-thirds of the voters still backed someone else.",
    "Many will still back old-style, moderately conservative candidates, while others prefer a garden variety type of Republican reminiscent of Sens.",
    "McKinley normally would have been rated as the favorite in the primary, since he represented roughly two-thirds of the new districts population.",
    "He was also harmed by allegations that he had groped a series of women, including a sitting GOP state senator who went public with her charges.",
    "A recent poll found she would lose to an establishment-backed conservative, Nick Begich III, under the states ranked-choice voting format.",
    "The results confirms what last weeks Ohio primary and polls from upcoming races indicate: Trumps support can only get a candidate so far.",
    "Mooney, fueled by Trumps endorsement and more than $1 million in ads from the Club for Growth Action, hammered McKinley relentlessly.",
    "McKinley was so out of step with todays conservative, fighting Republican voters that he lost 24 of the districts 27 counties.",
    "Pillen was not out of step with Republican sensibilities and had no high-profile act of apostasy to enrage the rank-and-file.",
    "Tuesdays Republican primaries in West Virginia and Nebraska were yet another test of former president Donald Trumps power.",
    "Trumps endorsed candidate, businessperson Charles Herbster, thus had little to target in his campaign against Pillen.",
    "A winning nominee must still unite all these disparate groups to prevail in a competitive race against a Democrat.",
    "If an establishment type can fulfill that desire, those voters are perfectly happy to leave Trump in the dust.",
    "Their two districts were thrown together after the state lost a congressional seat due to the 2020 Census.",
    "This wont hurt nominees such as Vance or Pillen, since Ohio and Nebraska are strongly Republican states.",
    "Trumps personal appeal will not change the fact that 59 percent of Alaskans view Palin unfavorably.",
    "Ricketts also backed Pillen with more than $1 million in ads from an associated super PAC.",
    "In Nebraska, Pillen and seven other candidates combined for 70 percent of the GOP vote.",
    "The takeaway is that the GOP remains what all large parties are: a coalition.",
    "The verdict: Trump is strong, but the GOP establishment can win if its smart.",
    "But that and a late rally featuring Trump could only take him so far.",
    "Republican voters clearly want a conservative who fights.",
    "States such as Pennsylvania, however, are up for grabs.",
    "Mitch McConnell (Ky.) or John Thune (S.D.).",
    "Nebraskas GOP establishment was smarter.",
    "Ron DeSantis, take note.",
    "Trumps embrace of J.D.",
    "Outgoing Gov."
  ]
}