{
  "id": 3691,
  "mediaId": 136,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Roe v. Wade Overturn Could Force Male Birth Control Pill Development",
  "image": "https://d.newsweek.com/en/full/2035712/man-holding-pills.webp?w=790&f=b9d2d122c796f81290ca99a26526069b",
  "link": "https://www.newsweek.com/roe-wade-supreme-court-abortion-overturn-male-pill-1705714",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ed Browne",
  "authorUrl": "https://www.newsweek.com/authors/ed-browne",
  "termIds": [
    661,
    4740,
    482,
    3335,
    3381,
    2945
  ],
  "sentences": [
    "The point was echoed by Dr. Christina Wang, a male reproductive medicine specialist from the Lundquist Institute at Harbor-UCLA medical center, who told Newsweek that male contraceptive pills \"are necessary anyway\" but that changes occurring in the U.S. \"may stimulate more development of both female and male contraceptives.\"",
    "\"The availability of additional, effective contraceptive agents, including a male birth control pill, will be critical in light of the potential ruling from the Supreme Court to overturn Roe v. Wade to provide additional birth control options to couples and provide reproductive autonomy for men.",
    "I just don't think it is going to be immediate and the cost will be women's lives in the interim,\" Dr. Stephanie Page, head of the division of metabolism, endocrinology and nutrition at the University of Washington School of Medicine, told Newsweek.",
    "\"We know that the availability of contraceptive agents has reduced unwanted pregnancies and abortions in the U.S.,\" Gunda Georg, Regents professor and head of the department of medicinal chemistry at the University of Minnesota, told Newsweek.",
    "\"I would think that certain contraceptive choices would be clearly on the table that you would see now with the striking down of Roe,\" Maxwell Mak, a political science professor at John Jay College of Criminal Justice told Insider.",
    "With abortion threatened as an option for avoiding unplanned parenthood, some experts told Newsweek it is possible that a new form of contraceptionthe 'male pill'could become an extra option for sexually active individuals.",
    "Development of a male birth control pill could be accelerated if the U.S. Supreme Court formally reverses the landmark 1973 Roe v. Wade ruling that has granted federal protections to abortion, some medical experts believe.",
    "\"I hope that the current events will provide an incentive to research funding agencies, investors and pharmaceutical companies to provide more money to help accelerate in bringing a male contraceptive pill to market.\"",
    "The threat to abortion rights has sparked protests across the country with abortion-rights activists gathering outside the homes of multiple conservative Supreme Court justices as the fate of Roe v. Wade looms.",
    "\"It won't be overnight, but it is conceivable that demand for more contraceptive options could increase with restrictions on abortion access and that might accelerate male contraceptive development.",
    "In April, Ron DeSantis, the GOP governor of Florida, signed a bill banning most abortions in the state after 15 weeks of pregnancydown from 24 weeks previously, according to NBC News.",
    "A male birth control pill is something that scientists have been working on for decades, according to Smithsonian Magazine, though none have been made available so far.",
    "\"They could easily isolate the take-home abortion pill and the next kind of tangential things next to that would be Plan B and emergency contraception.\"",
    "In addition, there are concerns that the same political forces that are restricting access to abortion could also aim to limit contraceptive access.",
    "Last week, it was revealed that the Supreme Court had voted to overturn Roe v. Wade, according to a leaked draft opinion published by Politico.",
    "If the decision is overturned, it will mean that each state will be able to decide whether to restrict or ban abortion, Politico reported.",
    "\"The limiting factors for male pill development are mostly financial, not political; if industry sees a market, we will get there.\"",
    "For one thing, there could still be a significant gap between a lack of access to abortion and new access to male birth control.",
    "For now, the U.S. faces a tense couple of months while the Supreme Court deliberates on its controversial decision.",
    "That decision is subject to change and not set to be final until it is published, which could be within two months.",
    "Yet even if abortion restrictions lead to accelerated development of male birth control pills, problems remain.",
    "Currently, men only have two effective contraceptive options: condoms or vasectomy.",
    "Some Republican states have been already tough on abortion and getting tougher."
  ]
}