{
  "id": 3694,
  "mediaId": 441,
  "date": "d2022-05-11T14:03",
  "headline": "DeSantis Culture War With Disney Sees Lawsuit by Florida Trio Thrown Out",
  "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i_pNTgUurTB4/v0/800x-1.jpg",
  "link": "https://www.bloomberg.com/news/articles/2022-05-11/florida-lawsuit-against-desantis-over-disney-fight-is-thrown-out",
  "sentiment": "0.0",
  "mediaOutlet": "Bloomberg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katia Porzecanski",
  "authorUrl": "https://www.bloomberg.com/authors/AQlzPWIh6gY/katia-porzecanski",
  "termIds": [
    661,
    4508,
    428,
    524,
    611,
    3612,
    2661,
    2788,
    5109
  ],
  "sentences": [
    "DeSantis, a Republican and potential 2024 presidential candidate, signed a law in April that will dissolve the Reedy Creek Improvement District unless there is further legislative action, after Disney announced its opposition to the states new parental rights law that restricts classroom instruction on sexual orientation and gender identity.",
    "A federal judge threw out a lawsuit by three Florida residents who claim Governor Ron DeSantis trampled on Walt Disney Co.s freedom of speech, finding numerous holes in their filing and ruling the company can fight its own battle.",
    "The entertainment giant enjoys privileges through a special municipal district that encompasses Walt Disney World and its resorts, including access to the lower-cost municipal debt market for certain projects.",
    "While they said in their suit that they feared they would have to assume the tax burden that Disney shoulders under its special tax status, the judge shrugged off the claim.",
    "They do not allege direct harm as a result of the challenged law, and they do not plausibly allege any credible threat of direct harm in the future,? she wrote.",
    "The three residents alleged that the governors move to dissolve the district as punishment in a political fight violated the companys First Amendment rights.",
    "Because the laws provisions arent in effect yet, U.S. District Judge Cecilia Altonaga added that the claims arent ready for litigation and adjudication.",
    "But they failed to show that Disney faces any hindrance? in making its own case if it chooses to, the judge said Tuesday.",
    "The case is Michael Foronda v. Ron DeSantis, 22-cv-21376, U.S. District Court, Southern District of Florida (Miami).",
    "That indirect and highly speculative alleged injury cannot support federal jurisdiction,? she wrote.",
    "And she found the law wouldnt affect the plaintiffs anyway, who therefore lack standing to sue.",
    " With assistance by Danielle Moran"
  ]
}