{
  "id": 3695,
  "mediaId": 98,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Disney+ avoids streaming slump for now, adding 8 million subscribers",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/e0e346c/2147483647/strip/true/crop/1787x1183+0+0/resize/840x556!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F61%2Fe3%2Fed196456455abb2892f3284d82e9%2Fdisney-new-ceo-75057.jpg",
  "link": "https://www.latimes.com/entertainment-arts/business/story/2022-05-11/disney-avoids-streaming-slump-for-now-adding-8-million-subscribers",
  "sentiment": "0.0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan FaughnderStaff Writer",
  "authorUrl": "https://www.latimes.com/people/ryan-faughnder",
  "termIds": [
    661
  ],
  "sentences": [
    "At the same time, Disney has spent the last two months at the center of a political firestorm because of its response to Floridas Parental Rights in Education law, which bans classroom instruction of sexual orientation and gender identity in kindergarten through third grade.",
    "Walt Disney Co. on Wednesday reported better than expect subscriber growth from its marquee streaming service Disney+ as it charged forward with its direct-to-consumer transformation, while increasing revenue from its crucial theme parks business.",
    "Disney Chief Executive Bob Chapek has made it his mission to grow Disney+, along with the companys other streamers Hulu and ESPN+, to astronomical heights in order to keep the company relevant to modern viewers who are abandoning the cable bundle.",
    "Disney+ grew at an astonishing pace soon after its November 2019 launch, fueled by hits like The Mandalorian? and WandaVision,? as well as its eminently rewatchable library of animated classics and films from Marvel, Star Wars and Pixar.",
    "In another move to punish Disney, a group of Republican federal lawmakers has vowed to oppose any effort to extend the companys copyright protection for Mickey Mouse  already extended twice since the original expiration date in 1984.",
    "The return of Disneys massive theme parks operation boosted results, driving $6.65 billion in revenue from its parks, experiences and products division, which also includes toy licensing and cruise ships.",
    "DeSantis pushed state lawmakers to dissolve Disneys special tax district near Orlando, which gives the company extraordinary powers of self-government in a 25,000-acre area covering Walt Disney World.",
    "Entertainment companies, including Disney, have spent billions of dollars to launch and expand streaming services that would compete with Netflix as the Los Gatos giant upended the business.",
    "Disneys shares have also taken a hit amid broad stock market declines, despite the remarkable resurgence of the companys parks and the return of theatrical movies at the box office.",
    "Disney cited a $1-billion reduction of revenues because of money owned to a customer to terminate licensing agreements for films and TV content to use for its streaming services.",
    "Content sales and licensing, which includes Disneys theatrical film and home video sales, saw revenue decline 3% to $1.87 billion as operating income declined 95% to $16 million.",
    "In recent months, Disney+ has expanded its content offering with shows outside the parameters of its blockbuster brands, recently introducing ABCs black-ish? to the service.",
    "Disneys latest report comes amid growing worries among investors and Hollywood executives that the streaming business may not be as big or lucrative as once thought.",
    "The companys membership count declined by 200,000, prompting executives to blame competition, rampant password sharing and the companys pause in Russia.",
    "Disneys linear networks business, including ABC and ESPN, increased revenue 5% to $7.12 billion, while operating income shrank 1% to $2.82 billion.",
    "Early in the pandemic, subscriber counts soared and share prices followed as housebound consumers signed up for at-home entertainment options.",
    "The Burbank entertainment giant said Disney+ added nearly 8 million subscribers during the second quarter, exceeding analyst estimates.",
    "Ron DeSantis, a possible 2024 presidential candidate, blasted Disney as a woke? corporation after Disney voiced opposition to the bill.",
    "The gains were driven by surges in attendance at its domestic parks  Disneyland in Anaheim and Walt Disney World near Orlando.",
    "The division, which includes Disney+, Hulu and ESPN+, lost $887 million, compared to a loss of $290 million a year ago.",
    "The companys competition show Dancing With the Stars,? which aired on ABC, will begin premiering on Disney+ this fall.",
    "Streaming continued to lose money for Disney, though direct-to-consumer revenue rose 23% to $4.9 billion.",
    "The company promised Wall Street that Disney+ will reach 230 million to 260 million subscribers by 2024.",
    "Sales and profits missed analyst projections, though revenue increased significantly from a year ago.",
    "The division hit $1.76 billion in operating income, compared to a loss of $406 million a year prior.",
    "Wall Street had expected Disney+ to gain about 5.2 million paying members, according to FactSet.",
    "Disney reported adjusted earnings per share of $1.08, missing estimates of $1.19 a share.",
    "Revenue was $19.2 billion during the quarter, up 23% from the same period a year ago.",
    "Additionally, ESPN+ added 1 million subscribers to bring its total to a 22.3 million.",
    "Netflix recently reported that it lost subscribers for the first time in a decade.",
    "Revenue more than doubled the $3.17 billion the segment generated a year prior.",
    "Analysts polled by FactSet on average had expected sales of $20 billion.",
    "Hulu, though, grew by just 300,000 subscribers to hit 45.6 million.",
    "The great streaming slowdown of 2022 hasnt hit Mickey Mouse yet.",
    "Some analysts have questioned whether that goal is realistic.",
    "Netflixs shares are down more than 70% so far this year.",
    "So far, though, growth has continued for Disney+.",
    "The stock has slid more than 30% since January.",
    "The service now has 137.7 million subscribers.",
    "Opponents call it Dont Say Gay? legislation.",
    "The quarterly financial results were mixed.",
    "But the pandemic effect eventually waned.",
    "Multiple jobs have been cut in marketing.",
    "Netflix promised to rein in spending.",
    "Disney did not name the customer.",
    "Gov."
  ]
}