{
  "id": 3696,
  "mediaId": 21,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Disney CEO Bob Chapek's missteps have entertainment insiders speculating about how he can keep his job and who might replace him if he doesn't",
  "image": "https://i.insider.com/627ab524f669c800196ea362?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/disney-ceo-chapek-missteps-florida-who-might-replace-him-2022-5",
  "sentiment": "0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Claire Atkinson",
  "authorUrl": "https://www.businessinsider.com/author/claire-atkinson",
  "termIds": [
    661,
    1241,
    4332,
    4599,
    524,
    611,
    3230,
    2700
  ],
  "sentences": [
    "Kristina Schake, Disney's executive vice president, Global Communications, shared a statement with Insider saying, \"In his nearly three decades at Disney, Bob has been a steady, trusted leader who has consistently helped guide the company through historic successes and unique challenges, whether at the studio, leading our parks and consumer products, or now as CEO.",
    "While Chapek has performed well operationally  theme park business is returning, Disney has a strong summer movie slate, and plans for the metaverse are coming to light  he's mired in a persistent cycle of negative headlines, most centered on Florida's \"Don't Say Gay\" legislation and Disney's botched response, and a growing perception that he is gaffe-prone.",
    "Through his deep understanding of the company's culture, creators and consumers, and a clear strategic vision centered on storytelling excellence and innovation, Bob will absolutely continue to lead the world's preeminent entertainment company to even greater heights as we embark on the company's second century.\"",
    "Just this past weekend, during a commencement speech at his alma mater, Indiana University, Chapek  a veteran of the Disney theme parks unit  was zinged after referring to Orlando's Walt Disney World as the \"Happiest Place on Earth\" (the motto for California's Disneyland) rather than \"The Most Magical.\"",
    "\"Bob's vision and leadership allowed Disney to effectively navigate a global pandemic and economic crisis and emerge even stronger, thanks in large part to transformational changes he initiated that are delivering rapid growth in our streaming business and stellar results at our parks and resorts.",
    "Communications misfires led to a rapid executive departure\nDisney has spent weeks in the headlines thanks to the Republican governor of Florida, Ron DeSantis, over the state's \"Don't Say Gay\" legislation, which bans elementary school classroom discussion of sexual orientation or gender identity.",
    "Board members have given no indication they won't renew Chapek\nChapek's three-year contract runs out at the end of February  typically, chief executives are renewed long before their deals expire and a three-year deal is relatively short for such a large company, one senior Disney insider said.",
    "Author James Stewart, who chronicled the company under Eisner in his 2006 book \"DisneyWar,\" told CNBC in March that the Florida situation is a \"growing cause for concern among many investors,\" adding that there are morale problems and open criticism of management.",
    "How Chapek must reset his tenure  and who could step up if he can't\nWhile the Disney board shows no sign of moving away from Chapek, some Hollywood executives suggested to Insider that bringing Iger back  as board chairman  could steady the ship.",
    "While a rumor has been circulating in Hollywood that board member Mark Parker, the executive chairman of Nike, is the person most likely to replace Chapek in an emergency scenario, the senior Disney insider dismissed this as \"just not true.\"",
    "Another person close to top executives inside Disney said the board has not given any indication it's considering a change, with some directors said to be taking a wait-and-see approach ahead of Disney's quarterly earnings call on Wednesday.",
    "The board's responsibility is to hire and fire the CEO and also to have an emergency succession plan in place, the media consultant said, adding that such a contingency plan \"is either fully developed, or in the process\" at Disney.",
    "Conventional Hollywood wisdom is that Murdoch protege Peter Rice, the chairman of Disney general entertainment content who joined Disney when it acquired Fox entertainment assets, is best positioned internally to take over as CEO.",
    "Chapek \"is going to have to make a transformational move if he wants to keep his job,\" one top Hollywood executive told Insider, adding that the CEO \"was dealt a shitty hand,\" inheriting the company as the COVID pandemic raged.",
    "Klepper also faulted Chapek for having a command-and-control, gated style of leadership and for installing Kareem Daniel, chair of Disney Media and Entertainment Distribution, as a gatekeeper, potentially restricting feedback.",
    "After initial silence on the issue, Chapek apologized to employees and firmly attacked the bill, angering DeSantis  who has since signed the legislation as well as more recent bill revoking Disney World's special tax status.",
    "In the past, former chair of Disney Media Networks Anne Sweeney, currently a Netflix board member, and her successor, Ben Sherwood, who left the company after the Fox acquisition, were floated as potential Iger successors.",
    "Disney CEO Bob Chapek hinted that Disney World may soon lift its mask mandate for guests Jeff Gritchen: MediaNews Group: Orange County Register via Getty Images\n This story is available exclusively to Insider subscribers.",
    "Corporate governance expert Nell Minow, vice chairman at ValueEdge Advisors, said of the \"Don't Say Gay\" dust-up that \"Chapek has truly bumbled every element of it and in a major, catastrophic, and very public way.\"",
    "\"At the highest levels of Hollywood, [there's] a consensus that Chapek is damaged goods and doesn't have the finesse or capacity to save himself,\" said one veteran Hollywood insider familiar with the company.",
    "Professor William Klepper, who teaches executive leadership at Columbia Business School, said part of the problem is that Iger never moved into the mentor role, instead continuing as the voice of authority.",
    "One person familiar with Iger's thinking told Insider that the former CEO, who grew the company's market capitalization from $175 billion to $231 billion, feels the company he built is being poorly managed.",
    "'Former CEOs do not often speak out about their successors'\nFormer CEO Iger promised a \"friction-free\" transfer of power but has seemed reluctant to move to the sidelines after he departed in December.",
    "(In an attempt to navigate the politics before his exit, Morrell is said to have met with former Disney CEO Michael Eisner, according to a former Disney executive with close knowledge of the company.)",
    "He is now running a Blackstone-backed content acquisition vehicle, Candle Media, with partner Thomas Staggs, the former Disney chief operating officer who was once positioned as Iger's successor.",
    "It's a sentiment shared by many of the 10 people who spoke to Insider about Chapek's challenges  including Hollywood and Disney executives as well as consultants and board governance experts.",
    "It's been over two years since Bob Chapek was named CEO of Disney, the world's best-known entertainment company  and just a few months since Bob Iger, the CEO for 15 years, departed.",
    "One casualty of the communications misfires was Geoff Morell, the former BP exec who joined Disney as chief corporate affairs officer in January and departed three months later.",
    "That's prompting conversations at the highest levels of Hollywood and Wall Street about whether the Disney board is fully committed to its choice of leader and for how long.",
    "In February, Chapek met with Jeffrey Katzenberg, the former Disney studios chairman, to talk about the company's future, according to the former Disney executive.",
    "Rice, who attended a private dinner in Washington in recent weeks, was asked by guests if he was going to be the next CEO, according to a person who attended.",
    "\"Disney is a company whose brand and reputation is their business,\" one media industry consultant, who has worked with the company in the past, told Insider.",
    "The former Disney executive suggested Catherine Powell, head of global hosting at Airbnb and former Disney parks leader, should be in the consideration set.",
    "A move that could change the narrative might be a sale of Hulu to NBCUniversal, the executive suggested, to enable Chapek to focus all energies on Disney+.",
    "On the other hand there is nothing that is usual about this situation,\" said Minow, who adds that the board hasn't managed the leadership handoff well.",
    "Some even suggested that Facebook COO Sheryl Sandberg, who left the Disney board in 2018, could position herself if the role were to come up.",
    "Here's what they said he's up against, how he can restore the industry's confidence in his leadership, and who might step up if he can't.",
    "Then Iger stunned Disney management when, amid the Florida crisis, he delivered a fireside chat to the leadership team at NBCUniversal.",
    "1 in a conservative crusade against \"woke capitalism\" and a frequent topic on Fox News, owned by key Disney shareholder Rupert Murdoch.",
    "Kevin Mayer, former chairman of direct-to-consumer and international at Disney, exited the company after he was passed over for Chapek.",
    "In March, Iger tweeted his opposition to Florida's \"Don't Say Gay\" legislation, incidentally drawing attention to Chapek's silence.",
    "In December, Iger spoke at length about his legacy in a CNBC interview, pointing out that Chapek addressed situations differently.",
    "Pitaro was Disney's chairman of consumer products and interactive media before landing the top slot at ESPN in 2018.",
    "Chapek needs to \"close ranks with the board and become more permeable with the leadership team,\" Klepper said.",
    "Another internal candidate is ESPN boss Jimmy Pitaro, the kind of East Coast smoothie who might fit the bill.",
    "Chapek's three-year contract has not been renewed but the board has given no indication it will replace him.",
    "Hollywood has speculated about who could replace him if he doesn't make a big move to reset his tenure.",
    "While Chapek is a good operator, Klepper added, Iger had the benefit of a strong coalition of support.",
    "\"Sometimes it takes new leadership to go in there and make a change, so you can calm everything down.\"",
    "Disney CEO Bob Chapek has been mired in negative headlines about the company's dealings with Florida.",
    "There is less than a year left on Chapek's contract and the company's board has yet to renew it.",
    "Beyond the Disney cast, Jason Kilar, the former CEO of WarnerMedia, is currently on the market.",
    "Chapek has done significant  if temporary  damage  my bet is they have to turn the page.\"",
    "Subscribe to push notifications\n Deal icon An icon in the shape of a lightning bolt.",
    "If the negative headlines continue, Chapek may not pull through, this person added.",
    "\"It's up to the board to pay much closer attention during the transition.\"",
    "\"Former CEOs do not often speak out about their successors.",
    "\"I think change, generally speaking, change is good.\"",
    "\"But that's neither good nor bad,\" Iger said.",
    "\"He needs to revisit his cast of leadership.\"",
    "\"Iger is still living his best run,\" he said.",
    "Stay up to date with what you want to know.",
    "\"It's the most valuable product they have.",
    "Become an Insider and start reading now.",
    "Sign up for notifications from Insider!",
    "Disney now appears to be target No.",
    "Rice brushed away the question.",
    "Katzenberg declined comment.",
    "For you"
  ]
}