{
  "id": 3697,
  "mediaId": 302,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Florida Democrats struggle to find spotlight in race against DeSantis",
  "image": "https://www.tampabay.com/resizer//q6PC5seSzUnhNmv2CwXItB6QQNY=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/EB27HR4VN5DA7KPGDVABKFWDGA.JPEG",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/11/florida-democrats-struggle-to-find-spotlight-in-race-against-desantis/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kirby Wilson",
  "authorUrl": "https://www.tampabay.com/author/kirby-wilson",
  "termIds": [
    661
  ],
  "sentences": [
    "Some of the Democratic candidates soundbites that have garnered attention have come at a cost: Fried at one point compared DeSantis to Adolf Hitler and Crist got pushback after saying DeSantis was trying to gin up support from the toothless crowd.?\nWith roughly 100 days until the Aug. 23 primary, the Democratic candidates still face significant hurdles including:\nName identification.",
    "While each has been forced to field questions about their campaigns viability, all candidates in the Democratic primary have emphasized the same message  that DeSantis focus on cultural, red-meat issues has left behind the average Floridian.",
    "The Democrats are going up against a politician with one of the loudest megaphones in the country  amplified by Fox News and conservative supporters  who routinely controls the narrative with brash proclamations or policy stances.",
    "With President Joe Bidens approval rating lagging and registered Republicans outpacing registered Democrats for the first time in state history, the pessimism about Floridas progressive future has only deepened.",
    "The incumbent Republican governor has massively out-fundraised his Democratic opponents, and  despite constant negative messaging from Democrats  approval polling shows the governor is popular with voters.",
    "TALLAHASSEE  The three leading Democratic candidates in the Florida governors race U.S. Rep. Charlie Crist, Agriculture Commissioner Nikki Fried and state Sen. Annette Taddeo  have a Ron DeSantis problem.",
    "Unfortunately, the state of Florida has spoken three times that hes not the right fit,? said Matthew Van Name, a senior adviser to the Fried campaign  who also ran Crists 2016 campaign for U.S. Congress.",
    "But Crist has dismissed the gap between his fundraising  about $9 million through the end of April  with DeSantis, who had raised more than $70 million with his political committee alone since last May.",
    "At campaign stops, Fried has criticized former governors  including Crist  for reallocating billions over the years in money meant to be set aside for affordable housing to other budget priorities.",
    "Her father was kidnapped by a Marxist-Leninist guerrilla organization in her home country when she was 17, making Taddeo all but impervious to attacks about potential socialist sympathies.",
    "For Crist, a three-decade-plus career in Florida politics means voters also know his name  though a decade has passed and thousands more have moved to Florida since he was last governor.",
    "But his long record, beginning as a Republican, then running as an independent and then running for governor as a Democrat in 2014, has been a point of attack from his primary opponents.",
    "Crists proposals include expanding down payment assistance programs for veterans, young families and first-time homebuyers, and reforming the Florida Public Service Commission.",
    "I dont understand why he needs to hear this a fourth time.?\nFrieds camp has also dragged out Crists inconsistent history on abortion and cannabis policy, among other issues.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nCrist has largely ignored the criticisms lobbed at him and said hes focused on the general election.",
    "The committee, Friends of Ron DeSantis, reported it raised about $8.2 million in April alone  about as much as the Democratic committees combined total haul for the year.",
    "In comparison, her campaign is quick to note, Fried won her 2018 race by 6,753 votes, becoming the first Democrat to win a statewide election in Florida since 2012.",
    "The Democratic candidates are fighting to downplay not only their funding disparity with DeSantis but concerns about the ability of Democrats to win statewide.",
    "Shes reeled in a few big-name donors, such as former Republican South Florida power player Mike Fernandez, who has donated $225,000 to her political committee.",
    "Frieds plan for affordable housing includes plans to double the homestead exemption and target the landlords who she says are unfairly gouging tenants.",
    "Fried and Taddeo, both hoping to become the states first female governor, have work to do when it comes to simply getting voters to know their names.",
    "Since last May, a DeSantis-associated political committee has outraised the Democrats committees by a combined margin of about nine-to-one.",
    "DeSantis, a sitting governor with rumored presidential aspirations, has become a household name not only in Florida but across the country.",
    "All of the Democratic candidates have used DeSantis as a punching bag in public messaging in the hopes of getting their names out there.",
    "Frieds tactics have been perhaps the most extreme: Shes likened DeSantis to various parts of the human anatomy on her Twitter account.",
    "Meanwhile, Taddeo, a Colombian-born state senator who flipped a red district in 2017, has focused her campaign on her personal story.",
    "Our opponent is Ron DeSantis and thats what our campaign is based on and focused on,? said Austin Durrer, Crists campaign manager.",
    "When voters get to know Annette, she shoots up in the polls across all constituency groups,? campaign manager Nick Merlino said.",
    "They also hope some of the social stances DeSantis has taken, such as on abortion, will hurt him with a general electorate.",
    "He had been accused of evoking a stereotype about poor, white Floridians\nDemocrats are at a huge dollar disadvantage.",
    "Out-of-state liberal donors, disappointed by the states recent performance, have shifted money away from the state.",
    "He regularly commands the spotlight, using his office to hold news conferences that feel like political rallies.",
    "In a podcast interview, she compared the governor to Hitler  a comment for which she was roundly criticized.",
    "Taddeo, like Fried, has said she would declare a housing state of emergency to help control rent increases.",
    "In tweets and other messaging, the Fried campaign has attempted to portray Crist as a political also-ran.",
    "Taddeo, meanwhile, has raised about $1.2 million between her committee and her campaign account.",
    "Crist caught flak, including from Fried, for his comment about DeSantis toothless? supporters.",
    "Hes also scored a number of endorsements, including from Speaker of the House Nancy Pelosi.",
    "Frieds team contends her fundraising is getting stronger every month after a slow start.",
    "His campaign later said he was saying some of DeSantis supporters lacked courage.",
    "By the same polling, Crist is recognized by about 75 percent of the electorate.",
    "(A Democrat has yet to live in the governors mansion in the 21st century.)",
    "Frieds internal polling shows 60 percent of voters know who she is.",
    "Crist says his stance on the issues matters more than fundraising.",
    "Taddeo sits at just about 15 percent, according to her campaign.",
    "The next 100 or so days will decide the winner of the primary.",
    "But even then, the Democrats challenges have only begun.",
    "But she has yet to see her message reach many voters.",
    "Are voters getting to know the candidates?",
    "Affordability becomes a focal point.",
    "Shes raised about $4.5 million.",
    "Drowning out DeSantis.",
    "Fundraising."
  ]
}