{
  "id": 3707,
  "mediaId": 558,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Judge strikes down Florida governors unconstitutional election map",
  "image": "https://s.yimg.com/ny/api/res/1.2/6YLSegQXzXHp28im6Kgb6A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU3NjtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/DuUoeZjXh2AK8Ukl5q_nTQ--~B/aD02MDA7dz0xMDAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/theguardian_763/5997b99656bb76ca48c4cdbc5b5ac7c3",
  "link": "https://sg.news.yahoo.com/judge-strikes-down-florida-governor-175614248.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sam Levine",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Blow to Ron DeSantis as judge says new congressional districts made it harder for Black voters to elect their preferred candidates\nA state judge struck down new congressional districts in north Florida on Wednesday, saying that Governor Ron DeSantis, who drew the lines, had made it harder for Black voters to elect the candidate of their choice.",
    "Republicans currently have a 16-11 advantage in the states congressional delegation, but DeSantiss plan would add an additional four GOP-friendly seats, increasing that advantage to 20-8 (Florida is gaining an additional US House seat because of population growth).",
    "A coalition of civic action groups and Florida voters immediately challenged the map, saying that they violated a provision in Floridas constitution that says new districts cannot diminish? the ability of minority voters to elect the candidate of their choosing.",
    "He said in March that he believes courts could ultimately rule that the language, which also includes prohibitions against partisan gerrymandering, violate the US constitutions 14th amendment, which guarantees equal protection under the law.",
    "I am finding the enacted map is unconstitutional because it diminishes African Americans ability to elect candidates of their choice,? circuit judge Layne Smith said on Wednesday, according to the Tributary.",
    "DeSantis has fumed against the current configuration of the fifth congressional district, saying considerations over race were too much of a factor when the district was drawn.",
    "Smith ordered the state to adopt a map that maintained a fifth congressional district stretching from Jacksonville to Tallahassee, according to the Tributary.",
    "Lawyers for the state of Florida are expected to immediately appeal the ruling, and the Florida supreme court will probably ultimately decide the case.",
    "In late April, the plaintiffs asked the court to block the districts in northern Florida specifically from taking effect for the 2022 election.",
    "DeSantis has also expressed skepticism about anti-gerrymandering language, including the anti-diminishment provision, in Floridas constitution.",
    "It stretched from Jacksonville to Tallahassee, was 46% Black, and is currently represented by Al Lawson, a Black Democrat.",
    "DeSantiss new district chopped the district up into four districts where Republican candidates would be favored to win.",
    "Its an effort seen as a critical part of Republican efforts to retake control of the US House in the midterm elections.",
    "Voting rights advocates say the district ensures Black voters in northern Florida do not have their votes diluted.",
    "The decision dealt specifically with DeSantiss decision to dismantle Floridas fifth congressional district.",
    "The Florida map is one of the most aggressively gerrymandered maps in the US."
  ]
}