{
  "id": 3711,
  "mediaId": 98,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Federal judge dismisses Florida taxpayer lawsuit over Disney World district",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/3337758/2147483647/strip/true/crop/5552x4000+0+0/resize/840x605!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fec%2F48%2F920e1f08476571814a9c3c4ca9a8%2Ffd540e224640492a8d1b1c7508c11980",
  "link": "https://www.latimes.com/entertainment-arts/business/story/2022-05-11/federal-judge-dismisses-florida-taxpayer-lawsuit-against-over-disney-world-district",
  "sentiment": "0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Faughnder",
  "authorUrl": "https://www.latimes.com/people/ryan-faughnder",
  "termIds": [
    661,
    1241,
    4508,
    524,
    611,
    2661,
    2788,
    2851,
    5082
  ],
  "sentences": [
    "Additionally, Altonaga noted that the law eliminating the district does not go into effect until July 1 and called the taxpayers claims of harm highly speculative.?\nPlaintiffs theory of standing is that the elimination of the Reedy Creek Improvement District might result in financial harm to Plaintiffs by virtue of a tax increase that has not yet been enacted,? Altonaga wrote.",
    "The decision to dismantle Reedy Creek, covering a 25,000-acre area that is home to Walt Disney World Resort, was widely seen as retaliation against Disney for its stance against Floridas Parental Rights law, which bans classroom instruction on sexual orientation and gender identity in kindergarten through grade 3.",
    "In reality, this opportunity can, and should be utilized to generate more taxes from Disney, as the governor has said.?\nThe district would be eliminated on June 1, 2023, but could be reinstated after that date, meaning that Disney and the state have about a year to come up with a new agreement.",
    "DeSantis last month signed a law that would eliminate Disneys special tax and self-ruling status in central Florida by axing the Reedy Creek Improvement District, which was created by the state Legislature in 1967 to essentially give Disney its own municipal government.",
    "The lawsuit, filed last week in U.S. District Court in Miami, alleged that the move to eliminate the district was unconstitutional, violated the states legal and contractual obligations and would saddle taxpayers with a $1-billion debt burden.",
    "State lawmakers voted to scrap the district during a special legislative session after Disney said it wanted to see the Parental Rights bill, which LGBTQ activists see as an attack on queer and trans youth, repealed or blocked by the courts.",
    "Perhaps this will put to rest the speculation from those who are hoping  with no basis in reality  that this will end in some sort of taxpayer or state burden that partisan critics can use against the governor,? Pushaw said in an email.",
    "A federal judge on Tuesday dismissed a taxpayer lawsuit from Florida residents who sued the state and its Republican governor, Ron DeSantis, over a decision to dissolve Walt Disney Co.'s special self-governing district near Orlando.",
    "In another move to punish Disney, a group of Republican lawmakers has vowed to oppose any effort to extend the companys copyright protection for Mickey Mouse  already extended twice since the original expiration date in 1984.",
    "Their suit alleged that the state violated legal obligations forbidding it from dissolving the district without resolving its outstanding debt, which some experts have said would be passed on to surrounding counties.",
    "Again  it is worth emphasizing  the bill does not apply to Plaintiffs at all.?\nWilliam Sanchez, a lawyer for the Florida residents who sued the state, did not immediately respond to The Times request for comment.",
    "Disney Chief Executive Bob Chapek initially resisted speaking out on the Parental Rights bill, saying it would make the company a political football,? but came out against it amid pressure from employees.",
    "DeSantis press secretary Christina Pushaw applauded the judges decision and reiterated the governors position that eliminating the district will not create an additional tax burden for Floridians.",
    "The dispute over Floridas Parental Rights legislation and Disneys response to it has stretched on for weeks, giving DeSantis, a possible 2024 presidential contender, a massive Hollywood foil.",
    "The legal battle is part of the broader fallout from Disneys fight with Florida over the Parental Rights in Education law, which opponents have derisively nicknamed Dont Say Gay? legislation.",
    "Its boundaries include multiple theme parks, the Disney-owned ESPN Wide World of Sports complex, 175 miles of roadway and the cities of Bay Lake and Lake Buena Vista.",
    "Fox News and other conservative media jumped into the culture war, with commentators including Laura Ingraham accusing Disney of pushing a sexual agenda? on kids.",
    "The 1967 law allowed the company to transform a sprawling area of undeveloped swampland into Floridas biggest private employer and a massive driver of tourism.",
    "She also said that state residents could not sue over alleged violations of Disneys 1st Amendment rights, only their own constitutional rights.",
    "In an order dismissing the taxpayer lawsuit, Chief Judge Cecilia M. Altonaga wrote that the complaint was out of the courts jurisdiction.",
    "Her five-page order said state officials could not be sued in federal court over claims arising from alleged violations of state law.",
    "After Chapek voiced his concerns, DeSantis accused Disney of being a woke? corporation trying to impose liberal values on Florida.",
    "The dismissed complaint was filed on behalf of four Florida residents  three in Osceola County and one in Orange County.",
    "The Reedy Creek Improvement District spans roughly 40 square miles in both Orange and Osceola counties.",
    "No more handouts for woke corporations,? Hawley, also a constitutional lawyer, wrote on Twitter.",
    "said he plans to introduce legislation to strip Disney of the copyright protections this year.",
    "The law seeks to dissolve all Florida special improvement districts created before 1968.",
    "That indirect and highly speculative alleged injury cannot support federal jurisdiction.",
    "Disney has not commented on the decision to revoke its special tax status.",
    "Disney representatives have declined to comment on the subject.",
    "The law allows parents to sue school districts over violations.",
    "A plan for shutting down the district has not been released.",
    "Times staff writer Hugo Martin contributed to this report.",
    "[The bill] itself will not raise Plaintiffs taxes.",
    "On Tuesday, Sen. Josh Hawley (R-Mo.)"
  ]
}