{
  "id": 3719,
  "mediaId": 558,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "THE MOST EXPENSIVE TV SHOWS TO MAKE",
  "image": "https://s.yimg.com/uu/api/res/1.2/.JrbVvJj4wFt9Dx9XetoYw--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-05/27e83e10-d09c-11ec-bf7b-b5cf8eeb79e4",
  "link": "https://au.news.yahoo.com/disney-earnings-131255126.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "earnings per share: $1.17\nDisney+ subscribers: 4.5 million expected\nAfter competitor Netflix's (NFLX) big subscriber miss last month (the first time the company had lost subscribers during a quarter in 10 years), analysts remain cautiously optimistic when it comes to Disney+, although a slowdown is still expected relative to recent quarters.",
    "Disney (DIS) is set to report second quarter financial results on Wednesday after the market close, with all eyes on the company's fledging streaming service, Disney+, along with its parks, experience and consumer products business.",
    "Disney CEO Bob Chapek might also be forced to address the company's public battle with Florida Governor Ron DeSantis, who after Disney vowed to fight the , or what critics have dubbed the \"Don't Say Gay\" bill.",
    "At the end of 2021, Disney reported that it had 129.8 million paid subscribers, reiterating its target to bring on 230 million to 260 million subscribers to the service by the end of fiscal 2024.",
    "\"The March quarter is expected to be light on Disney+ net adds due to limited new content + market launches,\" Wells Fargo analyst Steven Cahall explained in a recent note.",
    "He publicly denounced the act during the company's annual shareholder meeting on March 9, in addition to directly apologizing to employees in a company memo.",
    "In addition to the DeSantis drama and \"Don't Say Gay\" fallout, the executive came under following awith \"Black Widow\" actress Scarlett Johansson last summer.",
    "Still, Disney plans to spend a whopping $11 billion on streaming content this year, as part of its overall $26 billion budget for TV and film production.",
    "The entertainment mecca's parks, experience and consumer products business is expected to swing to an operating profit of $1.6 billion.",
    "Chapek, whose contract expires on February 28, 2023, has dealt with a fair amount of controversy during his tenure.",
    "The overall subscriber slowdown comes as inflation remains high, consumers cut costs, and competition intensifies.",
    "To compare, Netflix spent $17 billion on content in fiscal year 2021, with plans to hit $18 billion in 2022.",
    "The company added 11.7 million subscribers in the first quarter of 2022, sharply topping analyst estimates.",
    "On a year-over-year comparison basis, the media giant reported a net add of 8.7 million in Q2 2021.",
    "Here are Wall Street's consensus estimates, as compiled by Bloomberg:\nRevenue: $20.11 billion\nAdj.",
    "Parks, experience and consumer products business\nBut streaming will not be the only focus.",
    "For context, Netflix's subscriber count sits at 221.64 million global subscribers.",
    "The analyst is particularly bearish, expecting net additions of just 3.5 million.",
    "The executive over his belated response to the bill.",
    "A lag in content has also been cause for concern."
  ]
}