{
  "id": 3725,
  "mediaId": 34,
  "date": "d2022-05-11T00:00",
  "headline": "Florida Judge Strikes Down Part of 'Unconstitutional' Map Rigged by GOP Gov. DeSantis",
  "image": "https://www.commondreams.org/sites/default/files/styles/social_share_image/public/headlines/desantis.jpg?h=319522b7&itok=WcGbVhca",
  "link": "https://www.commondreams.org/news/2022/05/11/florida-judge-strikes-down-part-unconstitutional-map-rigged-gop-gov-desantis",
  "sentiment": "0.0",
  "mediaOutlet": "Common Dreams",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kenny Stancil",
  "authorUrl": "https://www.commondreams.org/author/kenny-stancil",
  "termIds": [
    661,
    1058,
    1587,
    428,
    3288,
    2661,
    2724,
    2926,
    4991
  ],
  "sentences": [
    "As The Guardian reported, Smith's ruling \"dealt specifically with DeSantis' decision to dismantle Florida's 5th Congressional District,\" which \"stretched from Jacksonville to Tallahassee, was 46% Black, and is currently represented by Al Lawson, a Black Democrat.\"",
    "As Jacksonville's The Tributary reported Wednesday:\n[Smith] ordered the state to adopt a map that maintains an east-to-west version of Jacksonville's 5th Congressional District, stretching from Duval to Gadsden counties.",
    "Ron DeSantis' office and approved last month by the Republican-controlled Legislaturesiding with plaintiffs who accused the GOP of violating the state constitution through racial gerrymandering.",
    "Equal Ground Florida, one of the civil rights groups that immediately challenged DeSantis' map after it was passed in the face of a sit-in staged by state Democrats, welcomed Smith's ruling.",
    "\"The Florida Legislature's redistricting maps in the 1990s and 2010s were similarly struck down, but in those cases, it took six years to get a final ruling,\" The Tributary reported.",
    "Judge Layne Smith of the 2nd Circuit Court said that \"the enacted map is unconstitutional because it diminishes African Americans' ability to elect candidates of their choice.\"",
    "\"The enacted map is unconstitutional,\" said a circuit judge, \"because it diminishes African Americans' ability to elect candidates of their choice.\"",
    "\"This time, the plaintiffs sought to focus on getting a preliminary injunction redrawing North Florida's districts before the 2022 elections.",
    "Ron DeSantis' congressional map, which eliminated Jacksonville's current Black ability-to-elect district, violated the state constitution.",
    "DeSantis, the outlet noted, \"chopped the district up into four districts where Republican candidates would be favored to win.\"",
    "It would first go to the 1st District Court of Appeals and could potentially end up at the Florida Supreme Court.",
    "A state judge on Wednesday invalidated part of Florida's new congressional mapdrawn by right-wing Gov.",
    "The new map, described as \"deeply racist\" by experts, would end Lawson's congressional career.",
    "Meanwhile, the plaintiffs are still seeking a full trial to get the whole map thrown out.\"",
    "The ruling came after a Wednesday hearing that saw plaintiffs argue that Gov.",
    "Our work is licensed under Creative Commons (CC BY-NC-ND 3.0).",
    "Smith is expected to release a written order by Thursday.",
    "Feel free to republish and share widely.",
    "DeSantis' office has vowed to appeal."
  ]
}