{
  "id": 3732,
  "mediaId": 157,
  "date": "d2022-05-11T00:00",
  "headline": "DeSantis-appointed judge declares Florida redistricting map unconstitutional over Black voter suppression",
  "image": "https://www.rawstory.com/media-library/desantis.jpg?id=29791897&width=1200&coordinates=0%2C22%2C0%2C28&height=600",
  "link": "https://www.rawstory.com/ron-desantis-congressional-map/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Edwards",
  "authorUrl": "https://www.rawstory.com/u/david_edwards",
  "termIds": [
    661,
    1058,
    3804,
    3273,
    3508,
    2661
  ],
  "sentences": [
    " Dianne Gallagher (@DianneG) May 11, 2022\nFlorida lawmakers had approved a map & a backup map-However, DeSantis vetoed that & called lawmakers back into a special session to approve the map drawn by his office.",
    "The judge indicated that he would issue an order preventing the map from going into effect \"because it diminishes African Americans' ability to elect the representative of their choice,\" Gallagher said.",
    "Ron DeSantis is likely unconstitutional, siding with Democrats and voting rights groups who said the map would illegally suppress Black voters in northern Florida.\"",
    "Judge Smith said the map violates the state constitution \"because it diminishes African Americans' ability to elect the representative of their choice.\"",
    "CNN correspondent Dianne Gallagher reported that Florida Circuit Court Judge Layne Smith determined \"that a new congressional map approved by Gov.",
    "Ron DeSantis (R) has reportedly decided that a redistricting map created by Florida Republicans is unconstitutional.",
    "Smith suggested that congressional maps that DeSantis had previously vetoed could be used as a model for new maps.",
    "Judge Smith suggested the maps DeSantis vetoed could serve as the basis for maps used in the 2022 election.",
    " Dianne Gallagher (@DianneG) May 11, 2022",
    "Read the CNN report here.",
    "A judge appointed by Gov."
  ]
}