{
  "id": 3735,
  "mediaId": 157,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Republicans block contentious Senate abortion rights vote",
  "image": "https://www.rawstory.com/media-library/mitch-mcconnell.jpg?id=26045156&width=1200&coordinates=0%2C31%2C0%2C32&height=600",
  "link": "https://www.rawstory.com/republicans-block-contentious-senate-abortion-rights-vote/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Agence France-Presse",
  "authorUrl": "https://www.rawstory.com/u/agence_france-presse",
  "termIds": [
    661
  ],
  "sentences": [
    "House GOP Leader Kevin McCarthy of California could be facing legal exposure if he ignores a subpoena from the House Select Committee Investigating the Jan. 6 Attack on the U.S. Capitol and it is established that he had knowledge Donald Trump committed a crime, a former federal prosecutor explained on MSNBC on Thursday.",
    "On Thursday, The Daily Beast reported that Rep. Tony Crdenas (D-CA) of the San Fernando Valley paid nearly half a million dollars in campaign funds to a marketing firm owned by his wife  a move that may not necessarily break the law, but has raised alarm bells with ethics officials.",
    "\"Federal Election Commission records show that the Cardenas campaign routinely remits $4,400 to Essence Marketing at the start of every month, payments which the filings have described as 'Consultant  Communications' since the beginning of 2017,\" reported William Bredderman.",
    "\"Interspersed with these regular outlays are larger, sporadic expenditures from Cardenass personal political action committee marked 'Communications Consulting Services,' as well as smaller emoluments designated 'Reimbursement' or 'Event Supplies.'\"",
    "The House-passed Women's Health Protection Act would have created a federal statute ensuring access to terminations for patients nationwide -- but all 50 Republicans and one of the 50 Democrats voted not to consider the legislation.",
    "MSNBC's Chris Hayes interviewed former federal prosecutor Glenn Kirschner after the select committee subpoenaed McCarthy along with Reps. Scott Perry (R-PA), Jim Jordan (R-OH), Andy Biggs (R-AZ), and Mo Brooks (R-AL).",
    "Ron DeSantis, according to a Thursday email sent to the states county election supervisors by Maria Matthews, director of the states Division of Elections,\" the Tampa Bay Times reported Thursday.",
    "A Democratic drive to make the right to abortion the law of the land failed in the US Senate on Wednesday after Republicans refused to allow a vote on the deeply polarizing issue.",
    "Ron DeSantis will get to appoint a new chief elections officer who will oversee Florida's 2022 election -- in which the governor is running for re-election.",
    "\"Florida Secretary of State Laurel Lee is stepping down Monday in a precursor for a likely run for a Tampa Bay-area congressional seat.",
    "Ron DeSantis to appoint new Florida secretary of state who could oversee his 2022 re-election: report\nRepublican Gov.",
    "Lee submitted a letter of resignation to Gov."
  ]
}