{
  "id": 3746,
  "mediaId": 157,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Louisiana House revives Dont Say Gay bill with rare procedural move",
  "image": "https://www.rawstory.com/media-library/claims-of-homosexual-agenda-help-kill-hate-crimes-laws-in-5-states.png?id=24824122&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/louisiana-house-revives-dont-say-gay-bill-with-rare-procedural-move/",
  "sentiment": "0.0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Larose",
  "authorUrl": "https://www.rawstory.com/u/greglarose-louisianailluminator",
  "termIds": [
    661
  ],
  "sentences": [
    "On the House floor Tuesday, Rep. Raymond Crews, R-Bossier City, asked his colleagues to discharge the rejected bill from committee and move it before the Committee of the Whole, on which all representatives have a vote.",
    "Representatives can bring supporters and opponents to testify during the bills hearing, a process that has never happened on the House floor to the recollection of longtime legislative watchers.",
    "With just two votes to spare, members revived a bill that would prohibit public school teachers and employees from discussing sexual orientation and gender identity with students.",
    "Conservatives in the Louisiana House of Representatives turned to a seldom used procedure Tuesday to bring a controversial education proposal back from the dead.",
    "Louisiana Illuminator is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "The so-called Dont Say Gay? legislation from Rep. Dodie Horton, R-Haughton, failed to advance from the House Education Committee a week ago.",
    "There was no immediate indication from House Speaker Clay Schexnayder, R-Gonzales, on when Hortons bill would be scheduled for a hearing.",
    "Bills brought before the Committee of the Whole are handled much like any other proposal brought before a legislative panel.",
    "Needing 53 members to support discharge the bill, the House voted 55-39 to back Crews motion.",
    "Louisianas Dont Say Gay? proposal is modeled after legislation that Florida Gov.",
    "Contact Editor Jarvis DeBerry for questions: info@lailluminator.com.",
    "Three Republicans joined Democrats in opposition in a 4-7 vote.",
    "Louisiana Illuminator maintains editorial independence.",
    "Follow Louisiana Illuminator on Facebook and Twitter.",
    "Ron DeSantis has signed into law."
  ]
}