{
  "id": 3747,
  "mediaId": 129,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Ron DeSantis Is Being Incoherent on Inflation",
  "image": "https://static01.nyt.com/images/2022/05/11/opinion/11coy-image/11coy-image-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/11/opinion/inflation-tax-cuts-desantis.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2087,
    4228,
    76,
    2661
  ],
  "sentences": [
    "These findings suggest analysts need to distinguish between rank-and-file workers and professional, managerial and executive employees when they study the incidence of the corporate tax.?\nQuote of the day\nMost people work just hard enough not to get fired and get paid just enough money not to quit.?\n George Carlin, Brain Droppings? (1997)",
    "A good example is Floridas governor, Ron DeSantis, a Republican who last week signed a $1.2 billion tax cut that he said was the largest in state history and would fight inflationary policies imposed on us by the Biden administration.? But a state tax cut, just like a federal spending increase, puts money into consumers pockets.",
    "The challenge for policymakers is that simply cutting checks to taxpayers can feed the inflationary environment rather than offsetting it,? Jared Walczak, vice president for state projects with the Center for State Tax Policy at the Tax Foundation, was quoted as saying.",
    "A new Brookings Institution study finds that workers do benefit, but it is the most affluent employees  managers and executives  who receive the lions share of benefits, not rank-and-file staff,? as Brookings explained on Tuesday when summarizing the research.",
    "Even Keynesian economics would say if you spend and print, spend and print, that is going to drive up the cost of everything, and so thats what were seeing.?\nWhether DeSantiss diagnosis of inflation is right or wrong is one question.",
    "From consumers point of view, it doesnt matter whether the money comes from the federal government, which is running deficits, or state governments, which have been running surpluses largely because of federal stimulus dollars.",
    "A lot of economists argue that bottlenecks and price increases in critical materials, from computer chips to oil, were as important as or more important than federal spending in causing inflation.",
    "The problem is not whether DeSantis is right or wrong on the question of the cause of inflation or on the question of tax relief, but that his answers to those two questions contradict each other.",
    "Some of the very people who blame President Biden for causing inflation by overstimulating the economy are pressing for or making tax cuts that would stimulate the economy even more.",
    "If he thinks spend and print? was a bad idea before inflation began to accelerate, why would he think an almost identical policy is a good idea now that inflation is here?",
    "Those reasonable items aside, one of the plans biggest costs is a questionable $200 million fuel tax holiday for the month of October, right before the November election.",
    "If critics truly believe that the Biden administration and Congress erred by overstimulating the economy, cutting taxes is among the last things they should want to do.",
    "Republicans say the general public benefits because the tax cut gives corporations an incentive to invest more, which generates economic growth, tax revenue and jobs.",
    "On March 31, for example, he laid out his concern: You cannot print trillions and trillions of dollars and expect there not to be some effect on the back end.",
    "The Republicans appear more inconsistent on the topic, though, because theyre the ones who complained most loudly about excessive pandemic aid.",
    "(On Wednesday the Bureau of Labor Statistics announced that consumer prices rose 8.3 percent in the 12 months through April.)",
    "Theres also a tax holiday for disaster-preparedness items and another for impact-resistant windows, doors and garage doors.",
    "One can also argue over whether tax relief for Floridians right now is a good idea, apart from its effects on inflation.",
    "The DeSantis plan includes tax holidays for childrens books, diapers and back-to-school clothing.",
    "Elsewhere\nTheres a long-running debate over what happens when you cut the corporate income tax.",
    "In state capitals, both Democrats and Republicans are advocating or putting through tax cuts.",
    "DeSantis has repeatedly criticized the federal governments overstimulus during the pandemic.",
    "I try not to be political in this newsletter, but I have to say thats simply incoherent.",
    "The Times ran a good story on Tuesday about the inflationary potential of tax cuts.",
    "But lets also set aside the pluses and minuses of the plan itself.",
    "Democrats say it enriches the shareholders of the corporations.",
    "But lets set that aside for the moment."
  ]
}