{
  "id": 3748,
  "mediaId": 129,
  "date": "d2022-05-11T00:00",
  "headline": "Newsom Offers Tax Breaks for Companies in Anti-Abortion States",
  "image": "https://static01.nyt.com/images/2022/05/11/us/11newsom-budget01/11newsom-budget01-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/05/11/us/newsom-california-tax-breaks.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    773,
    1394,
    1889,
    3811,
    482,
    2590,
    2661,
    2890
  ],
  "sentences": [
    "Perhaps fewer businesses and residents would be fleeing California if Governor Newsom would focus on tackling the problems plaguing his own state.?\nThe State of Roe v. Wade\nMr. Newsoms proposal to draw business to California would update tax credits, employer grants and other business incentive programs to provide additional consideration for companies leaving states that have enacted restrictions on reproductive rights and anti-LGBTQ+ laws.?\nLast month, after Disney condemned the Florida education law and paused political donations in the state, Florida lawmakers revoked Disney Worlds designation as a special tax district, a privilege that effectively allowed the company  the states largest employer  to self-govern its 25,000-acre theme park complex.",
    "Were going to fight like hell, making sure that all women  not just those in California  know that this state continues to recognize and protect their fundamental rights.?\nJust as Republican activists have aggressively pursued conservative social policies in state legislatures in advance of the midterm elections, liberal states have intensified their defenses.",
    "The governor of California, the nations most populous state, has been especially vocal, calling on Democrats to more forcefully oppose Republican efforts to tighten laws on social issues and vowing to turn the state into a sanctuary for women, gay and transgender people and others whose rights are repressed in other states.",
    "So we know, or we have a fairly good idea, of why they are coming, and its because of the restrictive and dangerous bans that are being put in place in their home states.?\nHe said he supported additional state funding that would make it easier for patients from outside the state to seek abortions in California.",
    "The governors announcement  which came as Senate Democrats failed to pass legislation that would have codified abortion rights across the country  was an overt challenge to the Republican governors of Florida and Texas, where recent laws have limited classroom speech on gay rights and access to abortions.",
    "On Wednesday, a spokeswoman for Governor DeSantis of Florida, who is widely considered a Republican presidential contender, accused Mr. Newsom of spreading disinformation about other states.?\nFlorida doesnt restrict anyones rights,? the spokeswoman, Christina Pushaw, wrote in an email.",
    "The request accompanied a proposal to nearly double Mr. Newsoms reproductive health funding plan to $125 million, including $40 million for grants to providers to offset the cost of abortions for uninsured women from both inside and outside California.",
    "More than a dozen legislative measures to protect abortion rights are pending in California, where abortion providers anticipate a rush of demand from patients whose access to the procedure is already being tightened elsewhere.",
    "Those efforts have increasingly extended to appeals to businesses and residents who feel outnumbered where they are and could be searching for an ideological safe haven, especially if the Supreme Court further empowers states.",
    "Out-of-state patients are three times more likely to be seeking abortion-related services than Californians going to Planned Parenthood,? said Brandon Richards, spokesman for Planned Parenthood Affiliates of California.",
    "Dont think for a second this is where its going to stop,? Mr. Newsom said last week, speaking outside of a Planned Parenthood building in Los Angeles in the wake of a leaked draft of the pending Supreme Court opinion.",
    "Abortion providers in California estimate that, if reproductive rights revert to the states, California could end up serving as many as 1.4 million women from jurisdictions that will restrict or outlaw the procedure.",
    "groups have widely protested the move in the aftermath of a new Florida measure constraining school instruction on sexual orientation, which opponents have nicknamed the Dont Say Gay? bill.",
    "The moves in the deeply Democratic state come as leaders across the country are embracing staunchly liberal or conservative policies, reflecting a growing polarization among the electorate.",
    "Maureen Dowd: Samuel Alitos draft opinion, which calls for overturning Roe v. Wade, is the culmination of the last 40 years of conservative thinking, showing that the Puritans are winning.",
    "Matthew Walther, Editor of a Catholic Literary Journal: Those who oppose abortion, should not discount the possibility that its proscription will have some regrettable consequences.",
    "From Opinion: A Challenge to Roe v. Wade\nCommentary by Times Opinion writers and columnists on the Supreme Courts upcoming decision in Dobbs v. Jackson Womens Health Organization.",
    "The concern that Roe v. Wade will be reversed is spurring some states to action amid concerns that the courts ruling could upend an array of other longstanding privacy rights.",
    "Only Minnesota and Virginia have state governments in which control of the legislative chambers is divided between the two major parties, compared with 15 three decades ago.",
    "Gavin Newsom of California on Wednesday proposed a series of tax incentives explicitly aimed at recruiting employers from states that restrict reproductive and L.G.B.T.Q.",
    "Californias proposed abortion funding is intended to meet an expected surge in demand from across state lines, particularly from Arizona, Nevada, Idaho and Texas.",
    "Tish Harrison Warren: For many pro-life and whole-life leaders, a Supreme Court decision overturning Roe would represent a starting point, not a finish line.",
    "Governors such as Mr. Newsom and Floridas Ron DeSantis at times seem to revel in attacking their counterparts at the opposite end of the political spectrum.",
    "There are marked differences between life in liberal- and conservative-led parts of the country, with one-party control the reality in most states.",
    "SACRAMENTO  Underscoring the nations widening divide as the U.S. Supreme Court seems poised to overturn the constitutional right to abortion, Gov.",
    "The state has already seen an uptick in women seeking abortions since Texas enacted a near-total ban on abortions in September, providers say.",
    "Theyre coming for you next.?\nThe governors rhetoric has fueled some acrimonious political exchanges with leaders of Republican states.",
    "It also served as an invitation to Disney, which has said it will relocate some 2,000 California positions to a new Florida campus.",
    "We know that the need is not going to go away just because bans are put in place in peoples home states,? Mr. Richards said.",
    "California will not stand idly by as extremists roll back our basic constitutional rights,? Mr. Newsom said in a statement.",
    "Gretchen Whitmer, Governor of Michigan: If Roe falls, abortion will become a felony in Michigan.",
    "I have a moral obligation to stand up for the rights of the women of the state I represent.",
    "Soumya Karlamangla contributed reporting.",
    "Even so, it will be worth it.",
    "Pay attention, America.",
    "L.G.B.T.Q.",
    "rights."
  ]
}