{
  "id": 3753,
  "mediaId": 234,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "Senator Ron Johnson Tells Pregnant People to Suck It Up and Go Out of State for an Abortion If They Want One",
  "image": "https://media.vanityfair.com/photos/627c3b05cfe12ac50ccfe691/master/w_2240,c_limit/1230158510",
  "link": "https://www.vanityfair.com/news/2022/05/ron-johnson-abortion-roe-v-wade",
  "sentiment": "0.0",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bess Levin",
  "authorUrl": "https://www.vanityfair.com/contributor/bess-levin",
  "termIds": [
    661
  ],
  "sentences": [
    "The Senate Decides Abortion Isnt Worth Protecting (Jezebel)\nMultiple fake electors cooperating in Georgia criminal probe of Trumps efforts to overturn 2020 election (CNN)\nUkraine to Try Russian Soldier for War Crimes (WSJ)\nJudge in Florida Says He Will Block Republicans New Congressional Map (NYT)\nReturn-to-Office Plans Unravel as Workers Rebel in Tight Job Market (Bloomberg)\nNew York judge lifts civil contempt finding against Trump and orders him to pay $110,000 in fines (CNN)\nTrump wanted to court-martial prominent retired officers, former defense secretarys book says (The Washington Post)\nKickball player banned from Tinder for using app to recruit teammates (UPI)\nPassenger with no idea how to fly? a plane lands Cessna at Florida airport after pilot suffers possible medical emergency (CBS)",
    "Per The Guardian:\nDiscussions of gender identity and sexual preference are banned in many Florida classrooms because of governor Ron DeSantiss dont say gay? law, alongside dozens of math textbooks blocked for prohibited topics.? Now the Republican who has loudly condemned what he sees as the indoctrination? of young people has made another subject compulsory: students must receive at least 45 minutes instruction every November about the victims of communism.?\nIn a ceremony Monday at Miamis iconic Freedom Tower, where tens of thousands of Cuban immigrants fleeing Fidel Castros revolution were admitted into the US between 1962 and 1974, DeSantis signed into law House Bill 395, designating 7 November as Victims of Communism Day.",
    "Per the exchange, Eastman suggested that GOP legislators could simply cite their concerns with Pennsylvanias absentee ballot procedures and then use historical data to discount each candidates totals by a prorated amount based on the absentee percentage those candidates otherwise received.?\nHaving done that math, youd be left with a significant Trump lead that would bolster the argument for the Legislature adopting a slate of Trump electorsperfectly within your authority to do anyway, but now bolstered by the untainted popular vote,? Eastman wrote in a Dec. 4, 2020 email to Pennsylvania Rep. Russ Diamond.",
    "As one of the most vocal proponents of Trumps big lie,? he repeatedly downplayed January 6, variously claiming that the attempted coup wasnt an armed insurrection,? even though thats exactly what it was; that the rioters were not actually Trump supporters but provocateurs? impersonating Trump supporters; and that he was never once worried for his life because the mob that stormed the Capitol were there to overturn an election, not protest for equal rights for Black people.",
    "While its fashionable in some circles to whitewash the history of communism, Florida will stand for truth and remain as a beachhead for freedom.?\nEarlier this year, Florida banned public schools and private businesses from inflicting discomfort? on white people during lessons or training about discrimination, a ridiculous law that grew out of the conservative hysteria over critical race theory.",
    "Thatll result in countless lives being destroyed, whether its that of the rape victim who will have no choice but to give birth to her attackers kid, the woman living in poverty who cant afford to raise a child, the literal child who has been impregnated by an abusive family member, or the person who simply had a different set of plans for their life that did not involve becoming a parent.",
    "As the Milwaukee Journal Sentinel wrote last week, Republican lawmakers for decades have made sure to preserve the 1849 ban in hopes that Roe would someday be overturned,? and the Republicans running for governor in the state have [all] strongly opposed abortion and would be unlikely to sign legislation loosening the ban.?\nJohnson, of course, has a long history of extremely shitty takes.",
    "Per Politico:\nAttorney John Eastman urged Republican legislators in Pennsylvania to retabulate the states popular voteand throw out tens of thousands of absentee ballotsin order to show Donald Trump with a lead, according to newly unearthed emails sent in December 2020, as Trump pressured GOP lawmakers to subvert his defeat.",
    "The instruction will begin in the 2023-2024 school year, DeSantis said, and will require teaching about Joseph Stalin, Mao Zedong and Fidel Castro, as well as poverty, starvation, migration, systemic lethal violence, and suppression of speech? endured under their leaderships in the Soviet Union, China and Cuba respectively.",
    "Those are people that, in fact, cant necessarily just drive to Illinois (or the neighboring state that applies to them) because they cant get the time off of work, or dont have a car, or have other children at home they cant be away from for the nightor any of the many other reasons that Johnson apparently cant think of.",
    "In addition to obliterating the constitutional right to an abortion, the reversal of almost 50 years of precedent will likely result in a near or total ban on the medical procedure in about half of the country, including states where it will become a felony not only to perform but to obtain one.",
    "And four years later, he reportedly did not tell the police, Senate or Wisconsin officials that a former aide was allegedly sexually assaulted by a state lawmaker.?\nSo yeah, its not surprising that he has no earthly clue why any of this is a big deal, but that doesnt make it any less crappy.",
    "That would help provide some cover.?\nThe suggestion to simply throw out ballots like that was a very cool, very legal thing to do came out of a batch of emails obtained via public records requests by the Colorado Ethics Institute, which reportedly sent them to the January 6 committee.",
    "You can see at a college campus students flying the hammer and sickle from the old Soviet Union flag, you will see students that will have T-shirts with Che Guevara, you will see students that will idolize people like Mao Zedong,? he said, according to The Guardian.",
    "This recalculation, he posited in an exchange with one GOP state lawmaker, would help provide some cover? for Republicans to replace Joe Bidens electors from the state with a slate of pro-Trump electors, part of a last-ditch bid to overturn the election results.",
    "He blithely added that though he doesnt expect a 19th-century Wisconsin law banning abortions except to save the mother will go into effect if Roe is reversed, pregnant people can always go to neighboring Illinois if they want to obtain the medical procedure.",
    "Senator Ron Johnson Tells Pregnant People to Suck It Up and Go Out of State for an Abortion If They Want One\nIn the very near future, millions of peoples lives will be transformed when the Supreme Court overturns Roe v. Wade, as it is expected to do.",
    "It might be a little messy for some people, but abortion is not going away,? Johnson said, an absolutely bizarre choice of wordsnot to mention, sentimentgiven the history of women bleeding out and dying after unsafe abortions.",
    "Nothing to see here, just Trumps election coconspirator telling Pennsylvania to trash absentee ballots so itd look like Trump won\nApparently John Eastman saw no potential issues here, hence putting the plot in actual writing.",
    "I just dont think this is going to be the big political issue everybody thinks it is, because its not going to be that big a change,? he told the Journal, like only the absolutely most ignorant elected official can.",
    "Back in March, a federal judge said that Trump and Eastman most likely? committed felonies when they tried to overturn the results of the 2020. The illegality of the plan was obvious,? Judge David Carter wrote.",
    "Guy whose entire shtick is to ban things from the classroom now requiring lessons about the harms of communism in the classroom\nWere going to guess that no, Ron DeSantis does not see the irony here.",
    "Speaking to The Wall Street Journal, the Wisconsin lawmaker, who is up for reelection this year, said he doesnt expect abortion to come up on the campaign trail because its basically a nonissue.",
    "Mispronouncing the name of Che Guevara as Che Kay-Farra,? DeSantis used the ceremony to yell at students who wear T-shirts with the revolutionary leaders image on it.",
    "That to me, this speaks of a tremendous ignorance about what those individuals represented and the evils that communism inflicted on people throughout the world.",
    "Hes also a major purveyor of COVID misinformation, dispenses anti-vaccine rhetoric, and was temporarily kicked off of YouTube for promoting bogus cures.",
    "As so many people have noted, the reversal of Roeand ensuing bans in numerous stateswould disproportionately impact poor women and women of color.",
    "Not to mention, the pregnant person who decides they have no choice but to undergo an illegal, risky abortion rather than be forced to give birth.",
    "Florida, of course, now also prohibits teachers from discussing gender identity or sexual orientation in grades k3 (and, critics say, beyond).",
    "In 2010, he opposed a Wisconsin bill that would have eliminated the statute of limitations for child sexual abuse victims to bring lawsuits.",
    "Strangely, DeSantis has not said anything about introducing a bill requiring schools to teach students about the history of petty tyrants.",
    "As for the idea that the 1849 Wisconsin law banning abortions wont stand, Johnson is reportedly likely wrong about that too.",
    "If you would like to receive the Levin Report in your inbox daily, click here to subscribe.",
    "Neither the panel nor Eastmans attorney responded to Politicos requests for comment.",
    "None of this is a big deal and people are being hysterical over nothing.",
    "Rep. Elise Stefanik tries her hand at comedy\nElsewhere!",
    "But according to Republican senator Ron Johnson?",
    "Even more so now!"
  ]
}