{
  "id": 3756,
  "mediaId": 238,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Youngkin gets backlash over stance on protests outside Alitos home",
  "image": "",
  "link": "https://www.washingtonpost.com/dc-md-va/2022/05/10/youngkin-alito-protests-virginia/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Virginia State Police were closely monitoring, fully coordinated with Fairfax County and near the protests.?\nIn another tweet, the governor said: Virginia State Police will assist federal and local law enforcement as needed to ensure the safety of our citizens, including Supreme Court Justices, who call Virginia home.?\nNot good enough,? Will Chamberlain, a lawyer with The Article III Project, which supports constitutionalist judges and judicial independence, tweeted back to Youngkin.",
    "But since taking office, Youngkin has mostly stuck to symbolic gestures on abortion, such as making Virginias chief diversity officer the states ambassador for unborn children.?\nLast week, when a leaked draft opinion suggested the U.S. Supreme Court was preparing to overturn the Roe v. Wade decision guaranteeing access to abortion nationwide, Youngkin indicated he would support such a ruling.",
    "Picketing or disrupting the tranquility of home is expressly illegal in the Commonwealth,? Jack Posobiec, a podcaster and promoter of the false claims known as Pizzagate, tweeted to his 1.7 million followers, who went on to criticize Youngkin for saying that he is monitoring the situation?  one of several such tweets from conservatives.",
    "Then came the backlash  from conservatives, who demanded that the new Republican governor order the troopers to arrest the demonstrators under a state law prohibiting picketing outside private residences  even though its up to local police, not state troopers, to enforce that law.",
    "We are tired of Republicans who wont enforce the law against Antifa thugs.?\nThe release of the draft has led to protests at the homes of several justices, including the Montgomery County, Md., dwellings of Chief Justice John G. Roberts Jr. and Justice Brett M. Kavanaugh.",
    "Secretary of Public Safety and Homeland Security Bob Mosier said state law enforcement had been in close contact with local authorities about the possibility of such protests but did not view the state as having primary responsibility.",
    "Mosier noted that federal law also applies, with an explicit prohibition against pickets or parades? at the home of a judge with the intent of influencing  the discharge of his duty.?\nWe dont have federal policing powers.",
    "In a secretly recorded encounter, he confided that he could not talk about his antiabortion agenda without losing independent voters, but he promised to go on offense? against abortion if he won the Executive Mansion.",
    "Youngkin has been combative in many ways since taking office in January, often picking culture-war fights that he knows he cant win in a divided Capitol but will raise his national profile.",
    "They want to be behind the governor? in two senses of the phrase, this person said: They want to support him, and they want him to be the windbreak,? taking the brunt of any criticism.",
    "One Republican official, who spoke on the condition of anonymity to discuss private conversations, said others in the Virginia party are reluctant to criticize the governors response.",
    "While the state Republican Party stood behind Youngkin on Tuesday, calling him a law and order leader,? the governor also drew unfavorable comparisons to Florida Gov.",
    "We are dedicating substantial resources to assist in the efforts and the Governors office has spoken with Fairfax County officials and the U.S. Attorney.",
    "RICHMOND  As abortion rights activists picketed outside the Alexandria home of Supreme Court Justice Samuel A. Alito Jr. on Monday night, Virginia Gov.",
    "Macaulay Porter, a spokeswoman for Youngkin, said the governor and his administration are in constant coordination? with Fairfax and state police.",
    "We have been coordinating with [Fairfax County police and state police], and federal authorities to ensure that there isnt violence,? he tweeted.",
    "Youngkin ran for the GOP nomination promising to oppose abortion but said little about his specific policy goals during the general election.",
    "When pressed on the topic during a debate, Youngkin said he supported abortion rights in cases of rape or incest, or to save a womans life.",
    "Our priority is to ensure the safety of all Virginians, including the Supreme Court Justices at their homes,? she said via text message.",
    "You dont want to come in right away loading people into the paddy wagon  You have to balance these two interests as closely as you can.?",
    "A number of Twitter users suggested Youngkin could learn a thing or two from the more aggressive tactics of his counterpart in Florida.",
    "Ron DeSantis, a fellow Republican who, like Youngkin, appears to be considering a bid for the 2024 GOP presidential nomination.",
    "He also said he would support a pain threshold bill? like the one in Congress, which would ban most abortions after 20 weeks.",
    "He said state troopers were available and in the area if they had been requested as backup by Fairfax County authorities.",
    "While state law is clear in prohibiting demonstrations in front of someones home, Hey, we have protests in this country.",
    "But the official, who is familiar with the thinking of GOP leadership, said the protests pose a delicate issue.",
    "Glenn Youngkin popped up on Twitter to say state police were nearby and closely monitoring? the protests.",
    "The local police agency is the primary law enforcement entity to handle these situations,? Mosier said.",
    "But he also said it was too soon to say what restrictions he would pursue if that comes to pass.",
    "Either explain why these protests are lawful in Virginia, or *make arrests* next time.",
    "Your job is more than ensur[ing] that there isnt violence. Its to enforce the law.",
    "Abortion, however, has been notably absent from the mix, at least so far.",
    "We cant act on that; it would be up to the federal government, the U.S.",
    "Marshal Service, something of that nature,? he said.",
    "It isnt Russia,? the official said."
  ]
}