{
  "id": 3759,
  "mediaId": 223,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "'Damn It Feels Good to Be Here': Casey DeSantis Returns to Campaign Trail",
  "image": "https://media.townhall.com/townhall/reu/ha/images/2022/130/eee2610c-4fdf-4460-9ecb-0e75e3f6d53c.png",
  "link": "https://townhall.com/tipsheet/spencerbrown/2022/05/10/damn-it-feels-good-to-be-here-casey-desantis-returns-to-campaign-trail-in-florida-n2607013",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Spencer Brown",
  "authorUrl": "https://townhall.com/tipsheet/spencerbrown/",
  "termIds": [
    661
  ],
  "sentences": [
    "pic.twitter.com/c4SYZm98Zu\n Casey DeSantis (@CaseyDeSantis) May 10, 2022\nFlorida's First Lady released a statement following her remarks saying \"After six rounds of chemotherapy, a surgery, six weeks of radiation, and most importantly, through God's grace, I am elated while humbled to be back on the campaign trail fighting for America's Governor.\"",
    "\"No matter what you're going through in life, no matter how hard things seem like they are, no matter how hard it feels like you have to pick yourself off the ground or you feel like your back is against the wall  fight,\" said First Lady DeSantis who recently completed her radiation treatment.",
    "I can tell you that the prognosis couldn't be better and I look forward to her being out and about more-so than ever and I know she's chomping at the bit to be able to get out there and do some of the things that she's passionate about.\"",
    "\"I am a testament that God is great, and God is good, and hope is alive,\" First Lady DeSantis told the enthusiastic crowd before offering the advice her dad often says to her: \"Have faith and don't let the bastards win.\"",
    "First Lady DeSantis' return to the campaign trail follows Governor DeSantis' announcement on April 29 that Casey was completing her final radiation treatment after being diagnosed with breast cancer in October.",
    "Appearing for the first time since doctors declared her cancer-free in February, First Lady DeSantis joined her husband at a \"DeSantis Day Dinner\" event in The Villages on Monday.",
    "Florida's First Lady Casey DeSantis is back on the campaign trail with her husband, Governor Ron DeSantis, following the completion of her successful cancer treatment.",
    "\"Governor, I don't know if this sounds very first lady-like, but damn it feels good to be here,\" First Lady DeSantis told the applauding crowd.",
    "(to my radiation team, thank you for everything) pic.twitter.com/i6jAFEgPYy\n Casey DeSantis (@FLCaseyDeSantis) April 29, 2022",
    "\"We are fortunate to have the best first lady in all 50 states,\" Governor Ron DeSantis said while introducing his wife.",
    "\"We really appreciate everybody who's prayed for her and for us over these many many months,\" the governor said.",
    "\"I told you she's number one out of fifty,\" Governor Ron DeSantis said after the First Lady's remarks.",
    "BTW, for my final radiation treatment they played Sweet Florida by the Van Zant brothers ??????",
    "\"At the end of the day, it was not an easy thing for anyone to go through.",
    "It feels great to be back with Governor @RonDeSantisFL.",
    "\"Never, ever give up  never, ever back down.\"",
    "and yes, Governor, cant wait to come back!",
    "So much to be thankful for  God is good!",
    "Thank you for all the prayers ??",
    "\"Fight like hell,\" she urged.",
    "Trust in God.",
    "??"
  ]
}