{
  "id": 3761,
  "mediaId": 195,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Hawley introducing measure to strip Disney of copyright protections",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2019/04/minniemouse_disney042019.png?strip=1&w=640",
  "link": "https://thehill.com/news/senate/3483021-hawley-introducing-measure-to-strip-disney-of-copyright-protections/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brad Dress",
  "authorUrl": "https://thehill.com/author/brad-dress/",
  "termIds": [
    661,
    1448,
    524,
    2851
  ],
  "sentences": [
    "Since the law would be applied retroactively, Hawley said that Disney would begin to lose protections for some of its oldest and most valuable copyrights.?\nDisney has recently acquired some of the most iconic and expansive characters and universes, including Star Wars, Marvel and 21st Century Fox.",
    "Hawley said in a press release that the age of Republican handouts to Big Business is over.?\nThanks to special copyright protections from Congress, woke corporations like Disney have earned billions while increasingly pandering to woke activists,? Hawley said in a statement.",
    "The Copyright Clause Restoration Act would limit copyrighted material to 56 years and apply the new rule retroactively, meaning Disney and other companies could immediately lose some copyright protections if the law were passed.",
    "Ron DeSantis took issue with the media company for speaking out against the states Dont Say Gay? law, which prohibits the discussion of sexual orientation and gender identity from kindergarten through third grade.",
    "After lobbying from Disney, Congress passed a law in 1998 that extended copyright protections for corporations, giving them ownership for 95 years from original publication or 120 years from creation.",
    "The measure is the latest Republican attack on Disney, which last month was stripped of its self-governing status at its amusement park in Orlando, Fla., after Gov.",
    "introduced legislation on Tuesday that would strip woke corporations like Disney? of special protections enabling companies to hold copyright material for decades.",
    "Its time to take away Disneys special privileges and open up a new era of creativity and innovation.?\nThe Hill has reached out to Disney for comment.",
    "The Copyright Clause Restoration Act limits copyrighted material to 28 years and allows owners to apply for one additional 28-year extension.",
    "Hawleys bill goes after Disneys long-running list of iconic characters stretching from Mickey Mouse to Marvel superheroes.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The law was dubbed the Mickey Mouse Protection Act.",
    "Sen. Josh Hawley (R-Mo.)"
  ]
}