{
  "id": 3769,
  "mediaId": 238,
  "date": "d2022-05-10T13:00",
  "headline": "Floridas LGBTQ law is intentionally vague, says group challenging it",
  "image": "",
  "link": "https://www.washingtonpost.com/magazine/2022/05/10/lesbian-florida-dont-say-gay-bill/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KK Ottesen",
  "authorUrl": "",
  "termIds": [
    661,
    4234,
    3430,
    3492,
    2590,
    2661,
    2934
  ],
  "sentences": [
    "And not only is it going to stigmatize students, its also going to make it possible to bury not only the history but the existence of LGBTQ people  and in a space where young LGBTQ people believe that they are receiving a thorough and complete history and explanation of how the world works and their place in it.",
    "Setting aside cynical political opportunism, what do you say to those parents, those folks who see this issue as a parental consent issue and worry that school is or could be coming between them and their child on issues of great importance to that childs health, well-being, long-term consequences?",
    "And when I look back on my childhood, I realize that much of my understanding about Black history, about the contributions of Black people, happened not only outside of school with my parents, but then also later when I went to college, taking electives, not even the required classes.",
    "Do you see this as part of a broader trend where were seeing books banned from school libraries, charges of critical race theory in teaching Black history, and abortion laws in Texas where people can go after individuals  the same type of thing teachers in Florida are afraid of.",
    "This very intentionally vague law will shame and stigmatize not only LGBTQ students but students with LGBTQ parents and family members, as well as any student that rightfully believes and understands that LGBTQ people are valued members of society.",
    "And I would I want these young people to remember that there are people that love you, and we are dedicating our lives to making it possible for you to grow up and be your authentic selves and pushing to keep you safe.",
    "You know, when we hear about the same historical figures over and over again, when we hear about the same life-changing events, that reinforces to us their importance and their impact in helping to shape this country.",
    "And Im saying this because these bills that are being voted for by senators and signed into law by governors are not accurately reflecting the interests, the needs, and the values of the people that theyre serving.",
    "But when you step back, and when you see how these wires work together, how theyre connected, then its easier for us to see how these things related together, they keep the bird trapped in a cage.",
    "It means that young students learn very early on that either this history doesnt exist or LGBTQ people dont exist, or that the things that they havent done arent worthwhile, and that is damaging.",
    "That meant that my education happened outside and without the White people that were in my class  the White people that were my friends in my literal neighborhood, in my actual community.",
    "The part that matters is that intentional or not, all of these things happening together; the interplay between them is actually working to marginalize the most underrepresented people.",
    "I think that what is happening is that theres an overreach because what this bill is actually doing is shaming and stigmatizing LGBTQ students and students that have LGBTQ families.",
    "With LGBTQ teens more than four times more likely than their heterosexual counterparts to attempt suicide, what kind of effect do you think that this bill could have on people?",
    "Imani Rupert-Gordon, 43, is executive director of the National Center for Lesbian Rights (NCLR), which, along with Kaplan Hecker & Fink, filed a lawsuit against Florida Gov.",
    "And it talks about when theres one single wire, or one part, or one aspect of oppression or disadvantage, its difficult to understand how that one wire can limit a bird.",
    "Teachers are taking down posters in their classrooms that support LGBTQ people because they want to make sure that they are not in violation and to avoid being sued.",
    "The curriculum doesnt include talking about sexual education in the ways that were hearing our opponents talk about it  thats not part of the K through 3 curriculum.",
    "If these folks dont see themselves woven into the fabric thats made this country, they dont see how our contributions have been incredible and enormous, you know?",
    "Ron DeSantis (R) and other state officials to challenge Floridas recent Parental Rights in Education legislation, also decried as the dont say gay? bill.",
    "Its often that kids are coming to guidance counselor and supportive adults when they have questions that they dont feel like they can go to someone else.",
    "All of those things are linked, and when we intentionally work to keep identities out of school  and also, again, to be clear, its not all identities.",
    "What do you tell young people, especially young LGBTQ people, who are looking at whats happening in these debates and trying to make sense of things?",
    "Thats something that has been used horribly in the past, and Im so disappointed that so-called leaders are talking to community members like that.",
    "We know that the thing that makes a difference in a young persons life is just one adult that trusts them, believes them, can be there for them.",
    "Theyre just starting to understand who they are, and theyre seeing this, and they believe that there are people there that hate them, you know?",
    "DeSantis, and there was a parent testifying that their school would not even bring her into conversations with her child around these issues.",
    "Were seeing this move to ban books because of LGBTQ content, but also books that center the stories of Black people and communities of color.",
    "But we also know that LGBTQ young people are 124 percent more likely to experience homelessness than their straight, cisgender counterparts.",
    "But being so broad is really concerning because it doesnt feel as clear to everyone about how and why this discriminates against people.",
    "Because in early versions of it, if a teacher found out that someone identified as LGBTQ, they would have to go and tell their parents.",
    "The vast majority of people in this country  almost 8 in 10 people  support federal anti-discrimination protections for LGBTQ people.",
    "If a teacher decides to use more inclusive language other than mother? and father,? that could be considered part of the curriculum.",
    "And making it possible so that every single student can be the best version of themselves is making things better for all of us.",
    "You know, its hard when you see a version of yourself  I think of the young people who are thinking about coming out right now.",
    "Theyre saying that this would keep us from discussing any sexual orientation or any gender identity, any mention of it at all.",
    "Im not aware of times that guidance counselors have these conversations and keep parents from speaking to their children.",
    "We have to remember that the majority of people in this country dont like or want these discriminatory bills and laws.",
    "But the parents that I hear from, this is not helping at all; this is actually hurting the parents that we work with.",
    "We also know that the state of Florida is taking down anything from the website that has to do with LGBT bullying.",
    "I think everyone would want parents to have wonderful conversations with their children, these hard conversations.",
    "Were talking about the people experiencing the highest levels of marginalization and, often, not as much support.",
    "We have to also recognize that guidance counselors are not seeking children out to have difficult conversations.",
    "You know, were hoping that these young people have support in their parents and the people that they live with.",
    "Because that could keep a young person from maybe sharing something with a teacher that they feel close to.",
    "And its because, very often, when they divulge their LGBTQ identity, theyre kicked out of their house.",
    "Because its not like were not going to tell stories like Romeo and Juliet.? That is not on the table.",
    "A student telling a story that mentions their two mothers could be considered part of the curriculum.",
    "When teachers are taking posters off the wall, theyre not taking posters of everyone off the wall.",
    "Because the way that our opponents talk about this, they say it is for the protection of parents.",
    "We challenged this dont say LGBTQ? law because its discriminatory; its as bad as we think it is.",
    "I would have hoped, I would have thought, that we would be past these horrible, horrible tropes.",
    "Now I will say that I do believe they are intentional, but thats not the part that matters.",
    "And when we dont share about the history and the contributions of others, its not neutral.",
    "But students drawing pictures of their family could be considered part of the curriculum.",
    "And with this metaphor, it doesnt actually matter if these things are intentional or not.",
    "Because between the K through third grade, thats not actually part of the curriculum.",
    "Its about allowing young people to grow up and be the best versions of themselves.",
    "To have schools that are safe so that young people can grow up and self-actualize.",
    "Thered be no place where someone would say that a man couldnt talk about his wife.",
    "I think everyone is on the side of having very hard conversations happen at home.",
    "Or limits to how we talk about the history of race and slavery in this country.",
    "And in Florida, it is 8 out of 10, so its even higher than across the country.",
    "So that they are not experiencing stigma and feeling bad about who they are.",
    "Theres a benefit for a kid being able to talk to someone else as necessary.",
    "The actual language of the bill will have a very negative impact for folks.",
    "And we know that LGBTQ people are much more likely to experience bullying.",
    "This is creating a world where we can all be our beautiful, unique selves.",
    "And theyre going to end up hurting the people that need the most support.",
    "Iris Marion Young uses this metaphor about a bird cage that I just love.",
    "Something thats really alarming for me is teachers already being afraid.",
    "And it is around education  whose history is taught and how its taught.",
    "So were already seeing the results of this law before its even enacted.",
    "The legislation was drafted in very broad and deliberately vague terms.",
    "And many people would even say that those things best happen at home.",
    "Honestly, I would ask: Is that something thats really happening now?",
    "And in those situations Im glad that they have someone to come to.",
    "Its the identities of people who have immigrated to this country.",
    "Theres something to be said about having a difference of opinion.",
    "They dont want to do something that would be considered illegal.",
    "What it does is scare people about talking about who they are.",
    "We are kind and smart, and we contribute to society, you know?",
    "Because were talking about the most underrepresented folks.",
    "And now its just written where they can tell their parents.",
    "We have a value on freedom and equality in this country.",
    "You know, that is so disappointing and so discouraging.",
    "And that was different than all of my other education.",
    "Or are we actually talking about marginalizing people?",
    "Rupert-Gordon lives in Oakland, Calif., with her wife.",
    "Its not that theres no mention of sexual orientation.",
    "Laws like the Stop WOKE Act, thats also in Florida.",
    "Theyre taking posters exclusively of LGBTQ people.",
    "And so its not that there is no mention of gender.",
    "And this law is actually taking away options here.",
    "I would say Im disappointed with how broad it is.",
    "That is absolutely something that I worry about.",
    "Its not just putting it off and learning later.",
    "Thats how we learn things, and thats important.",
    "Im glad that more and more people are doing it.",
    "Because theres nothing wrong with LGBTQ people.",
    "I know you worked with LGBTQ teens previously.",
    "Making that link is really, really important.",
    "And that is not whats showing up right now.",
    "And so, are we talking about equality here?",
    "So thats not solving a problem that exists.",
    "And its all these things working together.",
    "I was watching a news conference with Gov.",
    "We have to remember that in these moments.",
    "And I want young people to remember that.",
    "Because thats not at all whats happening.",
    "Are we talking about protecting everyone?",
    "You know, no one would ever expect that.",
    "Because those voices are loud right now.",
    "Its the identities of people of color.",
    "And it feels like its closer to that.",
    "And that part is incredibly alarming.",
    "I dont think anyone disagrees there.",
    "Its disrespectful, its detrimental.",
    "Its the identities of LGBTQ people.",
    "But it works the other way as well.",
    "Because theres a connection there.",
    "They dont want to lose their jobs.",
    "Is that something you worry about?",
    "That is the part thats concerning.",
    "Thats what we are fighting for.",
    "This isnt taking anything away.",
    "But they are not the majority.",
    "But that also is really scary.",
    "This is an issue of equality.",
    "It is so cruel and cowardly.",
    "How do you think about that?",
    "And we see right past that.",
    "And they do not reflect us.",
    "And its blatantly untrue.",
    "And this was intentional.",
    "But thats not true.",
    "Its not even close.",
    "And no one should.",
    "Im a Black woman.",
    "Oh."
  ]
}