{
  "id": 3773,
  "mediaId": 65,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Casey DeSantis returns to campaign trail after battle with breast cancer: 'Damn it feels good to be here'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/2035f7a5-5cdd-4d4d-a0e7-a4b566dcaa9d/959a72e7-6d9c-41f7-a7a3-eeb0bd68ac98/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/casey-desantis-returns-campaign-trail-after-breast-cancer-battle",
  "sentiment": "0.696",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kyle Morris",
  "authorUrl": "",
  "termIds": [
    661,
    2661,
    2945
  ],
  "sentences": [
    "During her tenure as Florida's first lady, DeSantis has launched several major initiatives, including \"Hope Florida  A Pathway to Prosperity,\" which is a family-centered assistance program that is helping more than 25,000 Floridians achieve economic sufficiency.",
    "\"Let me say this, no matter what you're going through in life, no matter how hard things seem like they are, no matter how hard it feels like you have to pick yourself off the ground, or you feel like your back is against the wall, fight!",
    "She also introduced the Hope Ambassador program, a network of more than 100 middle and high school clubs in the state, to encourage a campus culture of kindness and empathy through peer-to-peer mentoring and volunteer work in Florida.",
    "\"After six rounds of chemotherapy, a surgery, six weeks of radiation, and most importantly, through Gods grace, I am elated while humbled to be back on the campaign trail fighting for Americas Governor,\" she said.",
    "DESANTIS DECLARES WIFE CASEY OFFICIALLY CANCER-FREE AFTER BATTLE WITH BREAST CANCER\n\"Never ever give up, never ever back down,\" she continued, just weeks after receiving her final radiation treatment.",
    "The Florida Legislature recently recognized her efforts and renamed the Florida Consortium of National Institute Centers Program the \"Casey DeSantis Cancer Research Program.\"",
    "EXCLUSIVE: Florida first lady Casey DeSantis made an exultant return to the campaign trail Monday evening in support of her husband following a battle with breast cancer.",
    "\"I look forward to telling Floridas story of success and why thousands of new residents are flocking to the Sunshine State in the name of Freedom,\" she added.",
    "In a statement to Fox News, Casey said she is \"humbled\" to return to the campaign trail and is looking forward to telling about Florida's \"story of success.\"",
    "\"Governor, I don't know if this sounds very first lady-like, but damn it feels good to be here,\" she said after being welcomed on stage by her husband.",
    "DeSantis announced that Casey, a former producer and Emmy award-winning television show host for the PGA tour, had been diagnosed with breast cancer.",
    "\"I am forever grateful for the prayers from good folks across the country who thought and prayed for me and my familys well-being, thank you.",
    "\"Ever since I was little, he would call me on the phone, and he'd say, Casey, have faith and dont let the bastards win,'\" she said.",
    "Ron DeSantis, made the appearance and offered remarks at a \"DeSantis Day\" campaign event held at The Villages in Sumter County.",
    "The youngest child, Mamie, was the first baby to be born in the Florida governor's mansion in more than 50 years.",
    "In December, the first lady, who has traveled the state visiting with cancer patients, announced Gov.",
    "At the end of April, the governor announced that Casey had received her final radiation treatment.",
    "DeSantis' $100 million budget proposal for cancer research and care at Florida cancer institutes.",
    "Following five months of treatment, he announced in early March that she was cancer free.",
    "In closing her remarks, DeSantis reflected on a message her father frequently tells her.",
    "\"I am the testament that God is great, that God is good, and hope is alive.\"",
    "I pray my story has inspired people to stay strong and never give up hope.\"",
    "Together, they have three children  Madison, Mason, and Mamie.",
    "The first lady of the Sunshine State, accompanied by Gov.",
    "Casey and Ron DeSantis have been married since 2010.",
    "Last October, Gov.",
    "Fight like hell!\""
  ]
}