{
  "id": 3774,
  "mediaId": 302,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "SBAs Guzman talks keys to small business COVID recovery in Florida, U.S.",
  "image": "https://www.tampabay.com/resizer//jHjJOLx_MrM2DOdm2f_mHEfn9Yg=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/4SPI7YV6LJA3VDO3Y6Q75K2URI.jpeg",
  "link": "https://www.tampabay.com/news/business/2022/05/10/sbas-guzman-talks-keys-to-small-business-covid-recovery-in-florida-us/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jay Cridlin",
  "authorUrl": "https://www.tampabay.com/author/jay-cridlin",
  "termIds": [
    661
  ],
  "sentences": [
    "Weve seen a small business boom, with record rates of business applications in 2021,? said Isabella Casillas Guzman, calling en route to a tour stop in Charlotte, N.C. As we look to promote the offerings of the SBA, we want to make sure that we reach as many businesses as possible, new and established, to connect them to capital markets and networks to support their businesses.?\nGuzman, tapped last year to lead the Treasury Departments small business arm, spent the first week of May meeting with small business owners, touting the agencys pandemic relief response and highlighting new and evolving grant and loan policies.",
    "While those programs are now over, Guzman said the agency has seen a continued uptick in interest in traditional 7(a) and 504 small business loans, and is looking to grow access to such programs, to support small businesses with local, trusted organizations who can connect them to the resources that are available on an ongoing basis.?\nGuzman spoke to the Tampa Bay Times about technology and inequity in pandemic relief, Floridas small business recovery and the rift between Gov.",
    "So in 2021, we did focus on trying to ensure PPP got into the hands of the smallest of the small businesses, and low-income and rural communities, and we were successful in doing that, in driving down the average size of a PPP loan to support more small entities.",
    "States that have the core factors of innovative startups, the universities, the research institutions to cultivate innovation, they have a healthy stream of innovative startups, as well as interest in entrepreneurship and strength in the economy overall.",
    "So thats a program where we simplified eligibility and underwriting and created more flexible terms so that more small businesses could access affordable capital through an extended network of mission-based lenders.",
    "So a wider distribution network, technology for scale, and a focus and commitment to equity to try to reach more of our small businesses  those principles really helped us in terms of reaching a broader audience.",
    "Since spring 2020, the Small Business Administration has awarded nearly $1.2 trillion in COVID-19 relief loans and grants, including $800 billion through the Paycheck Protection Program.",
    "Disneys one of the biggest corporations in the world, but do you think the effects of going up against a company for its public statements could trickle down to small business owners?",
    "But definitely, those businesses who were able to leverage technology during this time, those who could pivot and adapt and be flexible, were the ones who had greater success.",
    "Did the aid that flowed through the SBA into small businesses shine a light on any pre-pandemic weak spots in grant and loan programs that youve tried to permanently correct?",
    "So I think if anything, its more a story of adaptability and innovation and seeing so many small business owners supporting their communities to recover and thrive.",
    "For the head of the U.S. Small Business Administration, there was no better time to set out on a bus tour across America than National Small Business Week.",
    "Floridas traditionally gotten a lot of mileage out of its reputation as a business-friendly state, with no state income tax and lower corporate income tax.",
    "I hope that many of them are able to continue to be those strong community leaders that they are, regardless of the political issues or the environment.",
    "As youre traveling around the country talking to small business owners, have you seen any geographic patterns to small business resiliency?",
    "From where you sit, what sort of policies at the state level make a state appealing to, and supportive of, small business owners?",
    "(There was) 20 to 25 percent higher revenue recovery for those small businesses who were able to adopt technology tools.",
    "Businesses owned by people of color experienced initially higher closures and more challenges accessing relief.",
    "Floridas one of the states that opened for business a little faster than others in spring and summer 2020.",
    "Small businesses across the country were still faced with challenges as they navigated the pandemic.",
    "For the most part, our small businesses, they really are core to our neighborhoods and communities.",
    "Was there a level of inequity with some businesses accessing that technology during the pandemic?",
    "Did that help restaurants and other small businesses survive when they otherwise might not have?",
    "This is focusing on small-dollar loans, where theres always been gaps for the past 10 years.",
    "SBA scaled dramatically to serve more businesses than ever before, millions of businesses.",
    "(We were) really seeing gaps in the number of lenders willing to do small-dollar loans.",
    "Its a platform in which were connecting small businesses to free tools and webinars.",
    "Three out of four businesses said they adopted new tools to succeed in this market.",
    "Across the board, small businesses have to adapt to change on a constant basis.",
    "Consumer behavior and the pandemic itself still had an impact across the board.",
    "Just this week, weve been talking about our Small Business Digital Alliance.",
    "Where theres a strong ecosystem to support them, we see better success.",
    "Follow trends affecting the local economy\nIm sure youre following Gov.",
    "We recently launched changes in the Community Advantage pilot program.",
    "Areas of the country where businesses recovered faster than others?",
    "Ive seen some initial research that thats not so clear, actually.",
    "DeSantis battle with Disney over the Dont Say Gay? bill.",
    "(This interview has been edited for length and clarity.)",
    "Definitely, demographic differences have been apparent.",
    "We had over 5,000 lenders who participated in PPP.",
    "So we are applying those to our current programs.",
    "What we discovered are the successes of PPP.",
    "What about going back before the pandemic?",
    "Thats part of the story of the pandemic.",
    "Ron DeSantis and Disney.",
    "Not necessarily that."
  ]
}