{
  "id": 3778,
  "mediaId": 675,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Now Florida to teach students 'evils of communism'",
  "image": "https://www.wnd.com/wp-content/uploads/2022/03/license-plates-florida-evil-devil-satan-darkness-demons-demonic-sharks-dangerous-oceans-seas-waters-jk.jpeg",
  "link": "https://www.wnd.com/2022/05/now-florida-teach-students-evils-communism/",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    661,
    771,
    4401,
    4570,
    4681,
    4885,
    2661,
    2788
  ],
  "sentences": [
    "Starting with the 2023-2024 school year, high school students taking the state-mandated U.S. government class must receive at least 45 minutes of instruction on the designated Victims of Communism Day? covering topics such as Mao Zedong and the Cultural Revolution, Joseph Stalin and the Soviet System, Fidel Castro and the Cuban Revolution, Vladimir Lenin and the Russian Revolution, Pol Pot and the Khmer Rouge, and Nicols Maduro and the Chavismo movement,? according to the bill.",
    "Ron DeSantis signed a bill into law Monday that recognizes a statewide Victims of Communism Day? requiring Florida schools to teach students about the evils of communism.?\nThe Victims of Communism Day? bill, or House Bill (HB) 395, establishes November 7 as a holiday to honor the hundreds of millions of people who have suffered under communist regimes across the world,? which public schools are required to observe, according to a press release.",
    "pic.twitter.com/Ojlao8f46t\n Ron DeSantis (@GovRonDeSantis) May 9, 2022\nI appreciate this initiative and the fact that we are honoring the victims of communism by teaching young people about the evils of communism and the moral obligation we have to stop it,? Cuban human rights activist Rosa Mara Pay said in response to the legislation, according to the press release.",
    "Through HB 395 and the funding announced today, we are guaranteeing that the history of those who fled communist regimes and their experiences are preserved and not forgotten by our students.?\nWhile its fashionable in some circles to whitewash the history of communism, Florida will stand for truth and remain as a beachhead for freedom,? he added.",
    "Politics\nCommentary\nDavid McQuade\nJoseph Farah\nEmail to the Editor\nRead all of today's COMMENTARY...\nEducation\nDiversions\nMoney\nFaith\nHealth\nU.S.\nWorld\nMORE COMMENTARY\nMychal Massie\nRachel Alexander\nPatrick J. Buchanan\nOliver L. North & David Goetsch\nRead all of today's COMMENTARY...\nNew Section",
    "DeSantis also allocated $25 million to support the restoration of the Freedom Tower in downtown Miami and signed Senate Bill 160 into law, which approved three road designations in honor of Cubans who fought against the Castro Regime.",
    "House Bill 395 educates this generation of children and future generations about the ideology, history, and horrors of communism so that freedom will always remain alive in the Sunshine State,? Lieutenant Governor Jeanette Nuez said.",
    "Today, I established November 7th as Victims of Communism Day to honor those who have suffered under communism and remind people of the destruction communism has caused worldwide, including a death toll exceeding 100 million.",
    "Honoring the people that have fallen victim to communist regimes and teaching our students about those atrocities is the best way to ensure that history does not repeat itself,? DeSantis said in a statement.",
    "By April 1, 2023, the State Board of Education must also adopt revised social studies standards for the U.S. government class to incorporate the requirements of the new law.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "This story originally was published by the Daily Caller News Foundation.",
    "By Kendall Tietz\nDaily Caller News Foundation\nFlorida Gov.",
    "In Florida, we will tell the truth about communism."
  ]
}