{
  "id": 3781,
  "mediaId": 238,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "After Florida passes bill, LGBTQ parents ask: Which parents rights?",
  "image": "",
  "link": "https://www.washingtonpost.com/nation/2022/05/09/lgbtq-parents-dont-say-gay/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "We always talk in our family about how families are created in all different ways  and its essential that we respect everybodys identity and support them in those decisions,? said Resnick, 37, of Oakland, Calif.\nResnick said that when different kinds of families, including LGBTQ families, are discussed in the classroom, it helps children in those families feel included.",
    "Theyll ask you questions in the way that they need to help them understand the world.?\nFor older LGBTQ parents, the raft of new laws limiting LGBTQ rights is a throwback to the homophobia their children faced before shows like ABCs long-running Modern Family? made queer parenting mainstream.",
    "You are basically saying that we dont exist, and the message thats giving to our kids is to be ashamed of their parents.?\nBetween 2 million and 3.7 million people younger than 18 in the United States have an LGBTQ+ parent, according to a 2016 analysis from the Williams Institute.",
    "That is compared to 10.5 percent of millennials and 4.2 percent of Gen X.\nWhen I see whats happening in Florida, that these young kids wouldnt be allowed to say they had same-sex parents  that same thing in the sense happened to my kids,? Lowey, of Sausalito, Calif., said.",
    "Stacie Brensilver Berman, a visiting assistant professor at New York University who studies how high schools teach LGBTQ+ history, said that historically teaching about LGBTQ topics has remained focused on helping teens feel safe and accepted.",
    "Florida Republican lawmakers have pushed back on this characterization, saying the law will impact what teachers can say to students in elementary school but not limit how students talk to each other or their teachers.",
    "Robin Lowey, the author of Game Changers: Lesbians You Should Know About? and the mother of two adult sons, said that when she had children in the 1990s with her then-partner, there were very few? couples like hers.",
    "Nick Resnick, a transgender man who is married to a woman and has three young children, is on the board of Our Family Coalition, an organization that supports LGBTQ families in the San Francisco Bay area.",
    "The poll found that 68 percent of Americans support same-sex marriage, a figure that has risen since 2015, when same-sex marriage was legalized and 53 percent of Americans were in support.",
    "There will now be two LGBTQ people that these legislators are going to have to ... negotiate legislation with, and this is going to be something that we will never forget,? Perez said.",
    "Republican lawmakers in Florida have said the new law will protect parents ability to decide how and when their elementary-school- age children learn about sexuality and identity.",
    "Janelle Perez had just finished testifying in front of Florida state senators about the impact the dont say gay? bill would have on her family when she received a text.",
    "California was the first to pass its law in 2011, called the Fair Education Act, which required the inclusion of the contributions of LGBTQ people to its history class.",
    "Six states in total as of right now have passed laws that mandate including LGBTQ topics in K-12 academic classes, largely in history classes,? Brensilver Berman said.",
    "Ron DeSantis would prohibit Florida schools from teaching students in kindergarten- through-third grade about topics involving sexual orientation or gender identity.",
    "My youngest had a kid in kindergarten say You cant possibly have two moms. ?\nOver the past two decades, Lowey has said that shes seen society shift on these issues.",
    "Lessons for older grades would have to be age appropriate,? which Democrats argue is so vague that it will stifle all conversations about LGBTQ issues.",
    "In 2019, 66 percent of LGBTQ teens felt persistent feelings of sadness or hopelessness in the last year, compared to 32 percent of heterosexual teens.",
    "Gen Z now represents the generational group with the largest proportion of LGBTQ people, according to a February poll released by Gallup.",
    "Most often what wed say to people is to follow your child, follow your childs curiosity,? said coalition spokesperson Pauly Pagenhart.",
    "LGBTQ teens are more likely to suffer from poor mental health, according to a Centers for Disease Control and Prevention report.",
    "Resnick said that theyve always discussed how families are formed in their household in ways that small children can understand.",
    "She worried that under the new legislation, her daughter wouldnt be able to share artwork or talk about her family in school.",
    "Some families have two mommies, some have two daddies, some have a mom and a dad or live with a grandparent, for example.",
    "The measure also allows parents to sue school districts if they think their children have received inappropriate lessons.",
    "A recent poll from PRRI found that support for same-sex marriage and other LGBTQ issues has increased in the past decade.",
    "It found that 21 percent of Gen Zers who have reached adulthood, or those born between 1997 and 2003, identify as LGBTQ.",
    "It was a photo her 4-year-old daughter had drawn of her family: herself and her two moms, one with a baby in her belly.",
    "The coalition provides advice for parents on how to talk to their kids about new laws targeting trans and LGBTQ people.",
    "And when you take this away, it creates some type of secret,? Resnick said, which can impact childrens mental health.",
    "For LGBTQ parents like Perez, the Florida bill, officially named the Parental Rights in Education,? is a misnomer.",
    "For Perez, legislation against LGBTQ parents in recent years helped fuel her desire to run for public office.",
    "Its only recently that the conversation has shifted to including curriculum about queer history and figures.",
    "Approximately 191,000 were being raised by two same-sex parents in 2019, according to the Census Bureau.",
    "In the same report, the CDC found that feelings of connectedness to school and belonging help students.",
    "When her boys were growing up, gay? was only said in school in a derogatory context, her sons told her.",
    "But LGBTQ parents worry their children and families will have to hide who they are in the classroom.",
    "There was a lot of talk on the playground like Youre so gay, ? Lowey said.",
    "Floridas Senate has only one other out LGBTQ lawmaker, Shevrin Jones.",
    "So how can you say that this is protecting parents?? Perez said.",
    "Youre erasing an entire group of parents from the conversation.",
    "She is running for state Senate to represent the 38th District.",
    "LGBTQ families are more accepted,? Lowey, 64, said.",
    "I just broke down crying,? said Perez, 35.",
    "The legislation signed by Florida Gov.",
    "Im a parent."
  ]
}