{
  "id": 3784,
  "mediaId": 136,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Democrats Want to Raise Your Kids. Republicans Fight for Parental Rights | Opinion",
  "image": "https://d.newsweek.com/en/full/2034232/joe-biden-miguel-cardona.webp?w=790&f=63ef993c78823ecff321bdea9723f122",
  "link": "https://www.newsweek.com/democrats-want-raise-your-kids-republicans-fight-parental-rights-opinion-1704862",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Ron DeSantis signed a bill banning schools from teaching K-3 students about sexual orientation or gender identity and requiring that parents be notified if their child is experiencing mental or behavioral health issues.",
    "In Massachusetts, parents are suing their local public school for encouraging their kids to assume new names and pronouns to correspond with a newfound gender identitynone of which the school ever disclosed to parents.",
    "Children were taught that \"white privilege is something you were born with\" and that \"it's not your fault for having white privilege, but it is your fault if you choose to ignore it.\"",
    "The curriculumwhich was drawn up in secretteaches six-year-olds about \"gender identity\" and encourages teachers to share a website with nine-year-olds that discusses pornography.",
    "And most recently, Arizona Governor Doug Ducey signed a bill ensuring greater transparency for parents about their children's education and more accountability for teachers.",
    "Apparently, Democrats are either clueless or just ignoring the outrage erupting over the woke ideology left-wing activists are pushing in classrooms across the country.",
    "The outrage has been so swift that Murphy is attempting to walk back his support for it, but the fact that it was ever on the table in the first place is stunning.",
    "Greg Abbott has floated a \"Parental Bill of Rights\" that would reinforce the idea that parents have the sole and final authority over their children's education.",
    "Apparently elementary students are mature enough to adopt a new gender, but high school students cannot be given the choice to participate in voluntary prayer.",
    "One of the girls involved was only 11 years old when teachers began affirming her new \"gender identity,\" something administrators kept secret from her parents.",
    "A public elementary school in our nation's capital recently taught a lesson on \"anti-racism\" that asked students to identify racist members of their family.",
    "For years, Kennedy offered players motivational speeches that included religious content and prayer following games, none of which was required or coerced.",
    "When my daughter's school assigned her a novel that depicted pedophilia, I and dozens of other parents spoke out at our local school board meeting.",
    "Joe Biden's education secretary, Miguel Cardona, claimed he hasn't \"heard...an appetite\" for parental involvement in students' education.",
    "One parent reported that their child was \"freaked out\" by the anti-racism lesson and \"needed to sleep with a light on and the door open.\"",
    "As chair of the Republican Party andmore importantlya mom, I have a message for Democrats: we do not co-parent with the government.",
    "This kind of material would be distressing to kids of any grade level, but race-shaming kindergartners is particularly sickening.",
    "Just look at the explicit sex education curriculum New Jersey Governor Phil Murphy is trying to pass in the Garden State.",
    "Rather than making the book mandatory, the board allowed parents to choose between three different pieces of literature.",
    "Kennedy was fired based on claims that he had violated the school's \"Religious-Related Activities and Practices.\"",
    "As a mother of two, I know how shocking it is to discover inappropriate content in your kids' school curriculum.",
    "Since then, the Left has become more aggressive and shameless in pushing its radical propaganda onto kids.",
    "And in Washington, D.C., kids as young as four are being indoctrinated with critical race theory.",
    "Just ask Coach Joe Kennedy, whose case is currently being argued before the Supreme Court.",
    "Democrats aren't shy about dictating what your kids learn and don't learn in schools.",
    "Just a day earlier, Biden told teachers, \"They're not somebody else's children.",
    "Their unabashed sense of entitlement towards other people's kids is stunning.",
    "But praying after a high school football gamethat's where they draw the line.",
    "Ronna McDaniel is Chair of the Republican National Committee.",
    "The views expressed in this article are the writer's own.",
    "The days of ceding cultural issues to the Left are over.",
    "These are our kids on the line, and parents are angry.",
    "They're like yours when you're in the classroom.\"",
    "But Democrats have misread the political winds.",
    "This isn't about adults living as they choose.",
    "That's why Republicans are pushing back.",
    "Democrats will feel it come November.",
    "That ultimately cost him his job.",
    "The Left is just fine with this.",
    "This is just the beginning.",
    "That was six years ago.",
    "In Florida, Gov.",
    "In Texas, Gov.",
    "It worked."
  ]
}