{
  "id": 3785,
  "mediaId": 409,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Hawley Proposes Bill to Strip Disney of Copyright Protections",
  "image": "https://www.nationalreview.com/wp-content/uploads/2020/07/Josh-Hawley.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/hawley-proposes-bill-to-strip-disney-of-copyright-protections/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Isaac Schorr",
  "authorUrl": "https://www.nationalreview.com/author/isaac-schorr/",
  "termIds": [
    661,
    1448,
    433,
    524,
    562,
    611,
    2661
  ],
  "sentences": [
    "Hawleys legislation comes as yet another GOP response to Disneys advocacy against Floridas Parental Rights in Education bill, which states that classroom instruction by school personnel or third parties on sexual orientation or gender identity may not occur in kindergarten through grade 3 or in a manner that is not age appropriate or developmentally appropriate for students in accordance with state standards.?\nDisney has declared that its goal as a company? is having the bill repealed by the legislature or struck down in the courts.? Critics have dubbed the legislation the Dont Say Gay? law.",
    "At a signing ceremony for the measure, Governor Ron DeSantis said that if Disney was going to use its economic might to attack the parents of my state,? he would treat it as a provocation? and fight back.?\nHe also said that even if Disney had not commented on the Parental Rights Bill, taking away its special status would have been the right thing to do.?\nRepresentative Jim Banks (R., IN.",
    "), the chairman of the Republican Study Committee, exemplified Republicans attitude toward the company when he told National Review last month that whats good for Disney is bad for American children.?\nDisneys profits will give the woke left more control over our kids and conservatives in Congress should oppose any legislation that would unfairly advantage Disney,? said Banks at the time.",
    "is proposing new legislation  the Copyright Clause Restoration Act of 2022  to end special copyright protections extended to the Walt Disney Company, and cap all federal copyright protections at 56 years, Fox News reported Tuesday.",
    "Previous reporting from National Review indicated that Republicans in Congress were willing to let Disneys copyright to its original, Steamboat Willie Mickey Mouse  which is scheduled to sunset in 2024  expire.",
    "Thanks to special copyright protections from Congress, woke corporations like Disney have earned billions while increasingly pandering to woke activists.",
    "Last month, Florida stripped Disney of its special, self-governing status over the land on which Walt Disney World Resort sits.",
    "Its time to take away Disneys special privileges and open up a new era of creativity and innovation,? Hawley told Fox.",
    "But Hawleys bill would put an immediate end to protections on all copyrights exceeding 56 years of age.",
    "The age of Republican handouts to Big Business is over.",
    "Senator Josh Hawley (R., MO.)"
  ]
}