{
  "id": 3789,
  "mediaId": 302,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Panhandles anger over FPL may have helped spur DeSantis veto of anti-solar bill",
  "image": "https://www.tampabay.com/resizer//mzFPpiwMj6z15TATr59fpqmHufc=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/H5C5Y6NL7ZFJ7ACCPA3CTT52HU.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/10/panhandles-anger-over-fpl-may-have-helped-spur-desantis-veto-of-anti-solar-bill/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "DeSantis cited the worst inflation in 40 years? and said he was vetoing the bill because the state of Florida should not contribute to the financial crunch that our citizens are experiencing.?\nGet insights into Florida politics\nSubscribe to our free Buzz newsletter\nPolitical calculation\nSome are convinced the governors decision to snuff out FPLs priority bill, which had received bipartisan approval from the Republican-controlled Legislature, was a political calculation.",
    "People felt as if the rug had been pulled out from under them.?\nFor the states largest electric utility, which wrote the initial legislation to reduce net metering, funded a lobbying effort that included direct mail and television ads, and directed $3.2 million in campaign cash to legislators of both parties, the northwest Florida pushback was another black eye in a year of bad public relations.",
    "Our commitment to serving and supporting all of our customers  including those who live in Northwest Florida  has not and will not change.?\nUnder the tiered pricing program, which is designed to encourage energy efficiency, FPL charges less for customers who use below 1,000 kilowatt hous and more for electric usage over 1,000 kilowatt hours, he said.",
    "So how could it not be a factor in the governors calculations??\nIn hundreds of letters and emails to the governor, residents warned that they wouldnt look kindly on DeSantis siding with the company that touts itself in national ads as Americas best energy value? but had betrayed that claim when it ushered in a four-year rate increase in January.",
    "FPLs McGrath has said the company is continuing to work to make electric rates more affordable in Northwest Florida by aligning them with what other FPL customers pay  but this wont happen overnight.?\nHe has also said that FPL is also committed to finding a more equitable net metering solution for all Floridians.?\nHold on new legislation?",
    "Andrade, a co-sponsor of the net metering bill and the only Pensacola legislator who voted for it, said that although FPL and the bill sponsors want to return next year with a bill to reduce the solar incentives through net metering, There might not be an appetite for it.?\nFor now, many in northwest Florida are celebrating the veto.",
    "They didnt need to do this immediately and make us pay for it now and the PSC should have realized that.?\nShow some shame\nPapantonio sent a letter asking the Public Service Commission to reconsider the rate increase after his firm was inundated? with letters and email requests from residents asking his firm to intervene.",
    "And Mike Papantonio, a nationally renowned trial lawyer from Pensacola whose firm has fought Big Tobacco, Big Pharma and the chemical industries, personally financed months of television ads blasting the shameless greed? of FPL and the dysfunctional failure? of the Public Service Commission, which regulates utilities.",
    "One of those nonprofits has figured prominently in the Miami-Dade state attorneys investigation into a scandal involving a ghost? state Senate candidate in 2020, who was placed on the ballot to dilute support for the incumbent Democrat in the race and ensure Republicans maintained a majority in the state Senate.",
    "FPL blames many factors\nFPL says that its problems in northwest Florida were borne by a confluence of unprecedented conditions: The cold weather prompted higher usage, fuel prices are 60 percent higher than projected, and the company uses something called tiered pricing, a new concept to Gulf Power residents.",
    "As FPL started to make the transition and do away with the Gulf Power name, it started to dawn on people it wasnt the same company.?\nAs the residual goodwill for Gulf Power shifted to anger at FPL, more people were thinking of going to solar and FPL was telling people it wanted to control that,? Outzen said.",
    "Solar advocates said it was a signal the governor had put energy freedom ahead of monopoly utility profit margins.? But in conservative northwest Florida, residents say they deserve some of the credit, as their outrage at FPL and its handling of winter price hikes became a catalyst in the bills demise.",
    "Our rates went up because of the deal.?\nJerry Couey, a Santa Rosa County activist and Republican, said he considers DeSantis a wonderful governor who has visited North Florida more in his first term than any other governor.?\nBut DeSantis was well on his way to screwing us over,? Couey said.",
    "The impression we were given is that rates were going to go up a little bit and we would benefit from being part of FPL because rates would be spread over the whole system, said Rick Outzen, Pensacola radio host, publisher of Inweekly, Ricks Blog, and a podcast featuring local news.",
    "A Facebook group called FPL Price Gouging  Northwest Florida? included stories of people staying up until 11:59 p.m. on the last night their meter was to be read so they can take pictures to prove that the amounts they were charged were not matching up with the usage on their bills.",
    "Every year youre going to see your bill drop, and this is just the first year and were in the most painful time but I tell you for certain that we are looking forward to helping to bring lower bills here to northwest Florida, she said, as angry members of the crowd jeered.",
    "Pensacola resident Candice Lafferty, a single mother of three, told the council she couldnt afford the price increases in her electric bill, faced a shut-off notice and worried that if her power was cut off, she faced having her children taken away by the state.",
    "It doesnt get any bigger than tobacco, or the opioid litigation, so we were kind of always across the table from sociopaths that feel like they simply can get away with what they want to get away with and the reason they can is its such a mismatch,? he said.",
    "It began by highlighting the hypocrisy of the net metering bill and continued with ads highlighting the fact that FPL is owned by NextEra, one of the biggest energy delivery companies in the world? with $147 billion in assets and $17 billion in profits.",
    "FPL said that average Gulf Power residential customers who use 1,000 kilowatt hours a month would see their electric bills go from $129.24 to $137.49 in January, but hundreds of people complained on a social media site that the average was much higher.",
    "In April, Robinson announced he wanted to begin negotiations over a new franchise agreement with FPL, a negotiated contract that gives the utility the right to serve customers in the citys jurisdiction, using city right of way for its power poles.",
    "And I guarantee you, he wouldnt have got my vote if he had let FPL have its way on this.?\nResidual anger at FPL\nOutzen said the emergence of the net metering bill was the catalyst that amplified opposition to FPL, but the veto didnt end it.",
    "Meanwhile, Papantonio has taken aim at the states Public Service Commission, which he says has been captured? by the utilities it regulates because regulators are quietly enticed by the prospect of getting lucrative jobs in the industry.",
    "Last fall, some northwest Florida residents and Pensacola City Council member Jennifer Brahier began discussing replacing the massive utility with a municipal electric company that would focus on renewable and solar energy.",
    "In four years, they will be aligned.?\nBrahier argued that four years was too long to wait, but she struggled to get the majority of the seven-member city council to agree to launch a study for a city-owned alternative.",
    "He said that disconnection for nonpayment is and has always been a last resort.?\nWe have worked and continue to work with customers to develop payment arrangements and connect them with available financial assistance.",
    "He says the failed oversight is a sign that the regulatory compact, under which a for-profit electric utility is given a monopoly to provide electricity service in exchange for being regulated by the state, is broken.",
    "For the past four months, the reliably Republican Florida Panhandle community has been doing something very uncharacteristic for conservative voters: It has been revolting against Floridas largest electric utility.",
    "Now, the city hopes to use frustration with FPL to help negotiate new terms in the franchise agreement, such as requiring FPL to put more power lines underground and increase the availability of renewable energy.",
    "Because Gulf Power had been focused on the sale of the utility to FPL, Pensacolas franchise agreement has not been updated since 2009, and the city now operates on a month-to-month arrangement with the utility.",
    ")?\nFPL Vice President of External Affairs and Economic Development Pam Rauch laid out why the company thought it was a bad idea to conduct a feasibility study to consider becoming a municipally-owned utility.",
    "We understand how difficult it was for some of our customers in Northwest Florida to receive higher-than-expected power bills at the beginning of the year,? FPL spokesperson Chris McGrath said in an email.",
    "Pensacola and Escambia County, as well as six other municipalities in the region, asked the Florida Public Service Commission for a do-over of the rate increase, suggesting they were promised lower bills.",
    "So, the jurys out, and Im not the only Republican that felt that way.?\nCorrection: This story has been updated to note that Andrade was the only Pensacola legislator who voted for the net metering bill.",
    "Others described how they found ways to keep their bills below 1,000 kilowatt hours, an exercise often aggravated by the fact that the companys billing cycle may routinely fluctuate from 28 to 34 days.",
    "I have not seen an uproar like this against a utility company in Florida,? said Jonathan Webber, deputy director of Florida Conservation Voters, which urged the governor to veto the rooftop solar bill.",
    "This is so bad, weve had to spend $40-, $50-, $60,000 to get the message out there that something is so upside down we have to do something about it,? Papantonio told the Times/Herald last week.",
    "The electric bills hadnt caught everyones attention at that point but, when they did, talk of a city-owned utility went from an outlandish supposition to the talk of the town,? Outzen said.",
    "I havent even turned on my heat or my AC in months, let alone the past couple of weeks because I know that I dont have enough candles in case my power goes out because I cant pay (my bill.",
    "The city has tried to diversify its energy mix to 30 percent renewable or at least no emission, so people thought it was crazy to even have the net metering discussion,? Robinson said.",
    "Ron DeSantis surprised many in Floridas environmental community when he vetoed Florida Power & Lights priority bill that was intended to reduce rooftop solar expansion in Florida.",
    "We were very happy that the governor was supportive of our request to veto the net metering (bill),? said Pensacola Mayor Grover Robinson at his weekly news conference on May 2.",
    "Proposal: City could own utility\nAlthough anger over the high winter bills has been tamped down recently as weather has warmed, the outrage surfaced other frustrations with FPL.",
    "There were six northwest Florida legislators who voted for it and three who voted against it, including the regions two senators and Pensacola Republican Rep. Michelle Salzman.",
    "Robinson and other officials blame FPL for failing to adequately prepare customers for the tiered pricing changes, including confusion over the accurate reading of its meters.",
    "It was a change from the flat fee per kilowatt hour charged by Gulf Power, and FPL customers complained it was leading to rate increases of 20 percent to 40 percent.",
    "As temperatures dipped below freezing, Panhandle residents who couldnt afford the increases reported being disconnected, leaving many to seek public assistance.",
    "People reported frantically lowering their thermostats, unplugging appliances, and even disconnecting their water heater to avoid the rising meter readings.",
    "And, in a gesture that cuts to the core of the utility giants expansion goals, some Pensacola officials want to establish their own municipally-run utility.",
    "He was referring to HB 741, the legislation that would have scaled back how much utility companies must pay to buy excess power from rooftop solar users.",
    "In January, when a rate increase took effect along with rising fuel prices as part of a four-year deal, northwest Florida faced sticker shock.",
    "It was the first time weve had it, and it wasnt adequately explained to residents here,? said Rep. Alex Andrade, a Pensacola Republican.",
    "FPL and its chief executive, Eric Silagy, have been under fire for working with operatives tied to a series of dark money? nonprofits.",
    "The council held a workshop on Jan. 26 to discuss conducting a feasibility study on creating a municipally-run electric company.",
    "For months, the reliably Republican Florida Panhandle community has been revolting against Floridas largest electric utility.",
    "Lets not forget the governor is probably gonna have four more chances on that same decision if hes reelected,? Couey said.",
    "Robinson, the Pensacola mayor, said FPLs push to reduce its net metering program was the final straw for many residents.",
    "Papantonio has launched what he calls a methodical campaign? to call attention to what he considers dysfunction.",
    "An online petition, started by three women from competing political parties, had 10,000 signatures within days.",
    "If the Public Service Commission grants another hearing, he said, his attorneys will be ready to take on FPL.",
    "The president of Gulf Power went on to be president of The Southern Co. You knew people with Gulf Power.",
    "Even though they didnt have solar panels, they feel like this is a victory for them,? Outzen said.",
    "As FPL lobbied against the proposal, Brahier pulled the idea from the councils agenda in February.",
    "More than half of us have to figure out if were going to eat or pay the power bill,? she said.",
    "They were in your civic club, your church and on boards and they had good feeling about them.",
    "And she explained that FPL had a four-year plan to lower the communitys electric bills.",
    "We need industrial solar suppliers, but we also should have the mom-and-pop operators.",
    "What does it take for them to show some shame here and say, I got it wrong? \" he said.",
    "It was our utility,? he said of the company founded in 1925 and based in Pensacola.",
    "These are not communities that would normally have gone this direction,? he said.",
    "Why are we trying to snuff out something were trying to get going?? he asked.",
    "If we want people to have solar we should want as many people as possible.",
    "Three years ago, FPL bought the homegrown electric utility, Gulf Power Co.",
    "Couey, the Santa Rosa County activist, however, remains cautious.",
    "More than 100 people showed up, many angry at their power bills.",
    "Business owners complained of having bills inexplicably triple.",
    "A majority of people had a positive feeling about Gulf Power.",
    "They front-end loaded this whole thing, Papantonio said.",
    "He said he will continue cutting new ads.",
    "People are upset at FPL and that is real.",
    "In return, the city is paid a fee.",
    "The anger over there is real.",
    "Thats not what happened.",
    "TALLAHASSEE  Gov."
  ]
}