{
  "id": 3791,
  "mediaId": 558,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Florida school yearbook on hold over student protest photos",
  "image": "https://s.yimg.com/uu/api/res/1.2/KvjdDvETAa_OSL.cKnpf6Q--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/hd/cp-video-transcode/prod/2022-03/28/624209e99cc3ec164794019c/624209e99cc3ec164794019d_o_U_v2.jpg",
  "link": "https://nz.finance.yahoo.com/amphtml/news/florida-school-yearbook-hold-over-132848311.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "In an email Tuesday, Seminole County Public Schools spokesman Michael Lawrence said the issue wasn't with the protest but how its depiction in the yearbook could be interpreted as being endorsed by the school, which would be in violation of the school board's policy.",
    "Lyman High School Principal Michael Hunter said in a statement Monday that pictures and descriptions\" documenting a student walk-out in March in response to Florida's Parental Rights in Education law should have been caught earlier in the review process.\"",
    "Rather than reprinting the yearbook at substantial cost and delay, we have elected to cover that material that is out of compliance with board policy so that yearbooks can be distributed as soon as possible,\" the principal's statement said.",
    "When asked what would have needed editing, Lawrence said, specifically making it clear that this particular event was a student'-led event that was not sponsored, endorsed, or promoted by the district or school wouldve solved the issue.\"",
    "LONGWOOD, Fla. (AP)  Yearbooks at a central Florida high school won't be distributed until images of students holding rainbow flags and a love is love? sign while protesting the state's so-called Don't Say Gay? law can be covered up.",
    "Lawrence noted that the yearbook dedicates a separate page to the school's Gay Straight Alliance Club and elsewhere shows students at a pride march and holding rainbow flags.",
    "Rep. Carlos G. Smith, a Democrat who is the state's first LGBTQ Latino legislator, said in a that the censorship is a direct result of the law these students were protesting.",
    "If these items were caught earlier prior to print, some simple editing/tweaking likely couldve occurred to make that section in compliance prior to print.\"",
    "The yearbook's faculty advisor Danielle Pomeranz that she was asked to check into putting stickers over the photos and captions depicting the walkout.",
    "Students at the school in Longwood, which is near Orlando, have created a hashtag #stopthestickers,\" which is circulating on social media.",
    "Ron DeSantis, bans classroom instruction on sexual orientation or gender identity in kindergarten through third grade.",
    "The issue at hand here is not the photos or the topic for which the students were protesting,\" Lawrence said.",
    "They also planned a peaceful protest at Tuesday night's meeting of the Seminole County School Board, WKMG .",
    "District officials said they don't want anyone thinking that the school supported the students' walkout.",
    "She said it would cost $45,000 to reprint the 600 yearbooks.",
    "He said those depictions do comply with the policy.",
    "#WeWillNotBeErased in this so-called free state.'\"",
    "The bill, signed into law by Republican Gov."
  ]
}