{
  "id": 3796,
  "mediaId": 19,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "FL Gov. Ron DeSantis Designates Nov. 7 Victims of Communism Day, Slams Bidens Disinformation Board",
  "image": "https://media.breitbart.com/media/2022/04/Nina-Jankowicz-official-photo.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/10/fl-gov-ron-desantis-designates-nov-7-victims-communism-day-slams-bidens-disinformation-board/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    661
  ],
  "sentences": [
    "Ron DeSantis (R) blasted the Biden administration over the creation of the Disinformation Governance Board, explaining that they are attempting to stifle dissent, to try to elevate a chosen political narrative thats endorsed by the regime?  a move that is contrary to a free society.?\nDeSantis made the remarks during a press conference in Miami, Florida, where he signed a bill recognizing November 7 as Communism Victims Day to honor the more than 100 million people who have fallen victim to communist regimes across the world.?\nWe want to make sure that every year, folks in Florida, but particularly our students, will learn about the evils of communism, the dictators that have led communist regimes and the hundreds of millions of individuals who suffered and continue to suffer under the weight,? the governor said, noting that there are still people who openly promote things like socialism and communism.?\nDeSantis later stressed the importance of recognizing what the legislation represents.",
    "What they are doing to try to stifle dissent, to try to elevate a chosen political narrative thats endorsed by the regime and to try to marginalize dissenters,? the governor said, is not what a free society is all about.?\nDeSantis said he believes the administration will use the bureau to feed the social media platforms with what they want to be censored and not want to be censored,? as leftists panic over the prospect of losing control of the narrative, particularly in light of Elon Musks purchase of Twitter.",
    "Weve got to be willing to speak out when we see things that arent consistent with our values in our own country,? he said, pointing directly to recent actions of the Biden administration  namely, the creation of the Disinformation Governance Board led by radical leftist Nina Jankowicz.",
    "Having the federal government set up a disinformation bureau in the Department of Homeland Security is wrong,? he said.",
    "Were able to speak, speak our mind,? he said, adding that the disinformation bureau needs to be eliminated.",
    "That is a big danger to free expression in this country,? he warned.",
    "There is no orthodoxy that the government can impose on us.",
    "Florida Gov."
  ]
}