{
  "id": 3799,
  "mediaId": 19,
  "date": "d2022-05-10T00:00",
  "headline": "Louisiana and Missouri Sue Biden for Colluding with Big Tech to Censor Conservatives",
  "image": "https://media.breitbart.com/media/2022/04/twitter-jack-dorsey-hunter-biden-joe-biden-getty-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/10/louisiana-and-missouri-sue-biden-for-colluding-with-big-tech-to-censor-conservatives/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    661,
    1147,
    1223,
    1304,
    1506,
    2087,
    4159,
    4596,
    2766,
    2799
  ],
  "sentences": [
    "It also pointed to a May 2021 White House press briefing where Psaki said major social media platforms have a responsibility? to stop amplifying untrustworthy content, disinformation, and misinformation, especially related to COVID-19, vaccinations, and elections.?\nHaving threatened and cajoled social-media platforms for years to censor viewpoints and speakers disfavored by the Left, senior government officials in the Executive Branch have moved into a phase of open collusion with social media companies to suppress disfavored speakers, viewpoints, and content on social-media platforms under the Orwellian guise of halting so-called disinformation.? misinformation,? and malinformation.?\nThe lawsuit asked the federal court to declare Biden and his administrations acts a violation of the first amendment and to issue an injunction prohibiting the administration from acting in concert of participation? with big tech to censor conservatives.",
    "The Attorneys General for Louisiana and Missouri have filed a lawsuit against President Joe Biden for allegedly colluding with big tech social media companies to censor conservatives under the guise of combatting misinformation.?\nThe lawsuit names Biden and top administration officials, including White House Press Secretary Jen Psaki, Dr. Anthony Fauci, and the newly created Disinformation Governance Board director Nina Jankowicz as defendants.",
    "Louisiana Attorney General, Jeff Landry, claimed that the top social media companies have become an extension of Bidens Big Government,? and accused Biden of using tactics from the playbook of Stalin and his ilk.?\nLandry said:\nBig Tech has become an extension of Bidens Big Government, and neither are protecting the freedoms of Americans; rather, they are suppressing truth and demonizing those who think differently.",
    "The two attorneys general called Fauci out for orchestrating a campaign to discredit the lab-leak hypothesis in early 2020? and communicating with Facebook CEO Mark Zuckerberg regarding the suppression of disfavored speakers and content of speech on social media.?\nThey also highlighted Youtubes censorship of two videos uploaded by Florida Gov.",
    "Perhaps most notoriously, social media platforms aggressively censored an October 14, 2020 New York Post expos about the contents of the laptop of Hunter Biden, which had been abandoned in a Delaware repair shop and contained compromising photos and email communications about corrupt foreign business deals.",
    "As alleged further herein, as a result of such threats, Defendants are now directly colluding with social-media platforms to censor disfavored speakers and viewpoints, including by pressuring them to censor certain content and speakers, and flagging disfavored content and speakers for censorship.",
    "The complaint said:\nNotoriously, social-media platforms aggressively censored core political speech by then-President Trump and the Trump campaign raising concerns about the security of voting by mail in the run-up to the November 2020 presidential election.",
    "The lawsuit notes that, while campaigning, Biden and Vice President Kamala Harris sent a letter to Facebook demanding the platform take more aggressive? actions to censor Trump and his campaigns messaging on election integrity.",
    "The complaint said:\nAs alleged further herein, Defendants have coerced, threatened, and pressured social-media platforms to censor disfavored speakers and viewpoints by using threats of adverse government action.",
    "The lawsuit points to big techs censorship of Hunter Bidens laptop, the coronavirus lab-leak theory, and posts calling the efficacy of masks into question as some examples of the alleged collusion.",
    "The lawsuit also pointed to big techs censorship of Former President Donald Trump for his posts about election integrity and mail-in-ballots in the leadup to the 2020 presidential election.",
    "The 86-page complaint alleges Biden and his administration infringed on Americans First Amendment right to free speech by colluding with big tech companies to censor speech.",
    "Ron DeSantis (R) and Kentucky Senator Rand Paul (R), where they questioned the effectiveness of cloth masks when dealing with the coronavirus pandemic.",
    "This censorship is ironic because, for many years before 2020, it was a common left-wing talking point to claim that fraud occurred in voting by mail.",
    "We are fighting back to ensure the rule of law and prevent the government from unconstitutional banning, chilling, and stifling of speech.",
    "Ripped from the playbook of Stalin and his ilk, Biden has been colluding with Big Tech to censor free speech and propagandize the masses.",
    "3:22-cv-01213 in the United States District Court for the Western District of Louisiana.",
    "These actions violate the First Amendment.",
    "The case is Missouri v. Biden, No."
  ]
}