{
  "id": 3805,
  "mediaId": 19,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Sen. Josh Hawley Introduces Bill to Strip Disney of Copyright Privileges: No More Special Favors for Woke Corporations",
  "image": "https://media.breitbart.com/media/2022/05/joshhawleydisney1-640x480.jpg",
  "link": "https://www.breitbart.com/entertainment/2022/05/10/sen-josh-hawley-introduces-bill-to-strip-disney-of-copyright-privileges-no-more-special-favors-for-woke-corporations/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Ng",
  "authorUrl": "https://www.breitbart.com/author/dng/",
  "termIds": [
    661
  ],
  "sentences": [
    "Its time to take away Disneys special privileges and open up a new era of creativity and innovation.?\nIn a tweet, the senator said there is no reason woke corporations like Disney should keep getting special favors from government.?\nTheres no reason @disney or any other woke corporation should keep getting special favors from government.",
    "The legislation represents the latest counter-offensive to Disney after CEO Bob Chapek caved to a small group of radicalized, woke employees and picked a fight with Florida over the states Parental Rights in Education law, which bars the teaching of sexual identity and gender theory to kids in kindergarten through third grade.",
    "End the handouts now\n Josh Hawley (@HawleyMO) May 10, 2022\nDisney continues to make a fortune from its stable of animated characters because Congress has allowed the company to keep renewing copyrights on decades-old intellectual property that would normally have passed into the public domain by now.",
    "Sen. Hawley blasted Disney in 2020 for its collaboration with Chinese officials in the Xinjiang province during the production of Mulan, saying that the studio was whitewashing genocide? by partnering with the secret police involved in Uyghur concentration camps.",
    "Sen. Josh Hawley (R-MO) is introducing a bill that would strip the Walt Disney Co. of its special copyright privileges, imperiling the companys control over valuable intellectual property that could include Mickey Mouse and Donald Duck.",
    "The company has lost nearly $63 billion in market capitalization since going full woke and is the worst-performing stock in the Dow Jones Industrial Average, having fallen more than 30 percent in the past 12 months.",
    "The Copyright Clause Restoration Act would limit new copyright protections to 56 years and make the change retroactive for major corporations like Disney that have been granted unusually long copyright monopolies.",
    "Statement from The Walt Disney Company on signing of Florida legislation: pic.twitter.com/UVI7Ko3aKS\n Walt Disney Company (@WaltDisneyCo) March 28, 2022\nIn response, Florida Gov.",
    "The Reedy Creek Improvement District conferred a host of perks to Disney, including the right to develop the 25,000 acre area without having to seek government approval.",
    "Disneys predicament grew worse when leaked videos showed company leaders openly boasting about promoting a gay and transgender agenda in Disneys content for children.",
    "In some cases, Disney has been granted copyright protections for up to 120 years, far longer than the original maximum of 28 years, according to Hawleys office.",
    "Thanks to special copyright protections from Congress, woke corporations like Disney have earned billions while increasingly pandering to woke activists.",
    "Disney, which is based in California, has vowed to work to repeal the Florida law and those like it under consideration in other states.",
    "The age of Republican handouts to Big Business is over,? Sen. Hawley said in an announcement of the bill on Tuesday.",
    "Ron DeSantis (R) took away Disneys self-governing district in Orlando.",
    "Follow David Ng on Twitter @HeyItsDavidNg.",
    "Contact me at dng@breitbart.com",
    "Have a tip?"
  ]
}