{
  "id": 3812,
  "mediaId": 157,
  "date": "5/10/2022 12:00:00 AM",
  "headline": "Stay Woke Go Vote: FL Black Caucus launches campaign to empower voters",
  "image": "https://www.rawstory.com/media-library/black-turnout-in-primaries-might-make-democrats-think-twice-about-swing-voter-strategy.jpg?id=27477450&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.rawstory.com/florida-voters-registration/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4496,
    146,
    3287,
    2582,
    2661,
    2790
  ],
  "sentences": [
    "Meanwhile, the petition states that while voting alone will not deliver our community the relief, justice and equality we deserve, it is one tool that allows us an opportunity to have a voice in our democratic process as we endeavor to create transformational and sustainable change in our communities.?\nThe campaign comes after Black caucus members in the Legislature last month protested in the House chamber.",
    "The Black delegation in the Florida Legislature and community activists are doubling down on efforts to empower Floridians to vote during the upcoming elections, with the launch of a campaign that pushes back against Republican lawmakers policies.",
    "Im proud to stand alongside my colleagues and supporters across the state as we launch Stay Woke Go Vote, ? state Sen. Shevrin Jones, a Democrat representing parts of Miami-Dade and Broward counties, said in a written statement.",
    "We cant do it alone.?\nAmong several issues, the Black Caucus is raising awareness about what they call an attack on Black representation in the new congressional redistricting map and recently signed legislation by Gov.",
    "They loudly chanted, wore t-shirts that read Stop the Black Attack,? and staged a sit-in protest that shut down debate over African-American representation in the redistricting process.",
    "Its imperative, now more than ever, that we keep our foot on the gas to ensure that no stone is left unturned and that all voices are given the opportunity to be heard,? Jones said.",
    "Ron DeSantis that creates a special group to investigate reports of alleged voting fraud under the fake cover of election integrity,? according to a press release.",
    "Theyve also started an online petition and text campaign to encourage Florida voters to make their voices heard by participating in the election process.",
    "Members of the Florida Legislative Black Caucus on Monday announced that they will host a Stay Woke Go Vote? event on May 21 to launch the campaign.",
    "Florida Phoenix is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "When Black votes are under attack, we stand up and fight back,? the crowd of Black lawmakers yelled on the House floor.",
    "This effort is another powerful tool in our tool belt as we look towards November and beyond.",
    "Contact Editor Diane Rado for questions: info@floridaphoenix.com.",
    "Florida Phoenix maintains editorial independence.",
    "Follow Florida Phoenix on Facebook and Twitter."
  ]
}