{
  "id": 3815,
  "mediaId": 136,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Ron DeSantis Establishes 'Victims of Communism Day' Holiday Amid CRT Fight",
  "image": "https://d.newsweek.com/en/full/2034265/desantis.webp?w=790&f=93693ff564283dcd7b5104ba78b80cfa",
  "link": "https://www.newsweek.com/ron-desantis-establishes-victims-communism-day-holiday-amid-crt-fight-1705008",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patricia McKnight",
  "authorUrl": "https://www.newsweek.com/authors/patricia-mcknight",
  "termIds": [
    661
  ],
  "sentences": [
    "CRT says U.S. social institutions including the criminal justice and healthcare systems are \"laced with racism embedded in laws, regulations, rules, and procedures that lead to differential outcomes by race,\" according to The Brookings Institution, a nonprofit public policy organization based in Washington, D.C.\n\"We will always ensure that our students are getting the best education free of socialist ideologies, and critical race theory and woke terms that we will not allow,\" Nuez said.",
    "\"By the actions we're taking today, along with action we've already taken like removing critical race theory, 'woke' ideologies from our classrooms, we're ensuring that parents have the right to make decisions for their children,\" Nuez said.",
    "Florida's Republican Governor Ron DeSantis has signed legislation enacting a new state holiday while announcing a mandate requiring public school students to learn about the \"atrocities\" imposed by communist regimes.",
    "\"Honoring the people that have fallen victim to communist regimes and teaching our students about those atrocities is the best way to ensure that history does not repeat itself,\" DeSantis said in a statement.",
    "In April, DeSantis signed a bill called the \"Individual Freedom\" measure, banning CRT in schools to prevent students from feeling \"guilt\" and \"anguish\" for the past actions of other members of their race.",
    "\"Through HB 395 and the funding announced today, we are guaranteeing that the history of those who fled communist regimes and their experiences are preserved and not forgotten by our students.",
    "The new law went into effect immediately and was described by DeSantis as a day to honor the \"hundreds of millions of people who have suffered under communist regimes across the world.\"",
    "High school students will receive at least a 45-minute lesson in their United States Government class related to communist regimes and how \"victims suffered.\"",
    "While it's fashionable in some circles to whitewash the history of communism, Florida will stand for truth and remain as a beachhead for freedom.\"",
    "Florida Lieutenant Governor Jeanette Nuez said at a news conference Monday that the bill is part of a statewide push to end CRT in classrooms.",
    "DeSantis signed House Bill 395, prompting the state of Florida to now recognize November 7 as 'Victims of Communism Day.'",
    "The bill comes as lawmakers continue other efforts to combat critical race theory (CRT) in schools.",
    "The bill also revised the requirement for instruction on the history of slavery and Blacks.",
    "Instruction on communist topics will be required starting in the 2023-2024 school year.",
    "Under the new law, all public schools will be required to observe the day.",
    "Newsweek reached out to DeSantis for comment."
  ]
}