{
  "id": 3817,
  "mediaId": 65,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "DeSantis signs bill designating statewide Victims of Communism Day",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1c21cc1b-86f1-4a55-904b-cc7a112d6892/b901793b-7998-44d3-8b71-cf8c0f060176/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/desantis-signs-bill-designating-statewide-victims-of-communism-day",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ronn Blitzer",
  "authorUrl": "https://www.foxnews.com/person/b/ronn-blitzer",
  "termIds": [
    661
  ],
  "sentences": [
    "The instruction is to be on subjects including \"Mao Zedong and the Cultural Revolution, Joseph Stalin and the Soviet System, Fidel Castro and the Cuban Revolution, Vladimir Lenin and the Russian Revolution, Pol Pot and Khmer Rouge, and Nicols Maduro and the Chavismo movement,\" as well has the suffering people went through under those governments.",
    "NYC POLITICIAN PULLS FUNDING FROM JEWISH MUSEUM OVER ALLEGED DESANTIS SNUB\nThe bill calls for Florida public schools to observe the holiday, and for high school students taking a U.S. government class starting in the 2023-24 school year to have at least 45 minutes of dedicated class instruction for the holiday.",
    "Meanwhile, DeSantis said, those who escape from communist countries never want to go back to them after coming to the U.S.\n\"There are probably more Marxists on college faculties in the United States than there are in all of Eastern Europe combined,\" DeSantis said at a Monday news conference.",
    "DeSantis coupled that with the announcement of $25 million in funding for renovations to Miamis Freedom Tower, which was built in 1925 and once served as a Cuban Assistance Center for those who fled communism.",
    "\"Honoring the people that have fallen victim to communist regimes and teaching our students about those atrocities is the best way to ensure that history does not repeat itself,\" DeSantis said in a statement.",
    "\"Through HB 395 and the funding announced today, we are guaranteeing that the history of those who fled communist regimes and their experiences are preserved and not forgotten by our students.",
    "While its fashionable in some circles to whitewash the history of communism, Florida will stand for truth and remain as a beachhead for freedom.\"",
    "The legislation responds to glorifications of far-left ideologies being celebrated by parts of the Democratic Party and in academia.",
    "Ron DeSantis announced Monday that he is signing legislation designating Nov. 7 as Victims of Communism Day in his state.",
    "\"They dont want to go back to communism.\"",
    "Florida Gov."
  ]
}