{
  "id": 3819,
  "mediaId": 195,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "DeSantis signs bill establishing Victims of Communism Day",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/desantisron_010621getty_budowsky.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/3482067-desantis-signs-bill-establishing-victims-of-communism-day/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Olafimihan Oshin",
  "authorUrl": "https://thehill.com/author/olafimihan-oshin/",
  "termIds": [
    661,
    2661,
    2788,
    2934,
    2953
  ],
  "sentences": [
    "But not here in Florida, because freedom, not Marxism, has a home here in the free state of Florida.?\nNez added the legislation would not only teach our children but their childrens children, the importance of freedom, the terrible tyranny of communism, making sure that November 7, they will all understand what has happened throughout this globe throughout history.?\nIn March, DeSantis signed the Parental Rights Education bill, also referred to as the Dont Say Gay? bill, which prohibits state educators from talking about sexual orientation or gender identity in schools, also giving parents the ability to sue school districts who violate the measure.",
    "In Florida, we will tell the truth about communism.?\nDeSantis, who has waged a battle with Disney World in recent weeks, has been among the GOP governors championing culture war issues across the country, from Virginia to Texas and South Dakota, including multiple rumored White House hopefuls.",
    "Today, I established November 7th as Victims of Communism Day to honor those who have suffered under communism and remind people of the destruction communism has caused worldwide, including a death toll exceeding 100 million,? DeSantis wrote in a tweet on Monday.",
    "Ron DeSantis (R) signed a new law on Monday that requires students to learn about communism, establishing a state holiday called Victims of Communism Day.?\nHB 395 will require special instruction on Victims of Communism Day,? recognized on Nov. 7 of each year.",
    "DeSantis also announced at the bill signing that he plans to approve $25 million in state funding for the preservation of the Freedom Tower, a historic landmark for the states Cuban community, NBCs Miami affiliate reported.",
    "Walt Disney Corp. vowed to help appeal the law earlier this year, leading DeSantis to attempt to revoke its self-governance zone in the state, a move the company says is illegal unless the state pays off its enormous debt.",
    "Jeannette Nez (R) said at the news conference that the bill was in line with efforts to remove critical race theory teachings and other woke terms? in the classroom.",
    "Critical race theory is an academic framework used at the graduate level that analyzes U.S. history and institutions through the lens of racism.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Throughout this country, we are seeing communism and socialism being romanticized,? she said at a press conference.",
    "DeSantis has regularly trailed only former President Trump in polls on the Republican favorite for president.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Positive attitudes are at an all time high in this country.",
    "Florida Lt. Gov.",
    "Florida Gov."
  ]
}