{
  "id": 3821,
  "mediaId": 238,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Opinion Trumpism is terrible. It also might be popular.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/09/trump-trumpism-repubublican-success-popular-with-voters/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1078,
    1147,
    2250,
    2347,
    3442,
    2945
  ],
  "sentences": [
    "As the Brookings Institutions Vanessa Williamson wrote in an assessment of Trumpism in 2020, Racial authoritarianism has existed within and alongside our democracy from the beginning.?\nToday, right-wing attacks on Black Lives Matter, critical race theory, the New York Timess 1619 Project, Supreme Court Justice-designate Ketanji Brown Jackson and other Black ideas and people are stoking a narrative that Black people are not only the main drivers of American problems  from struggling schools to crime  but are also insufficiently grateful about living in one of the richest nations in the world.",
    "The current Republican Party might be animated by nostalgia for an America dominated by White, male Christians, but it also signals that good? elements of other groups are welcome in its coalition: Latinos who immigrated through the traditional process or whose families have been here for generations; Black people who support the police and express gratitude for being Americans; LBGTQ people who dont emphasize that part of their identity.",
    "Defining some group of people or institutions (the media, the left, immigrants, a minority religious or ethnic group) as apart from everyone else and then blaming them for creating problems and subverting the true will of the people has been a successful political tactic in any number of times and places.",
    "The assumption of static fascism blinds one to fascism organizing small but significant numbers in communities of color, particularly through Christian nationalism,? says Dartmouth professor Jeff Sharlet, who has written extensively about Christian fundamentalism in America.",
    "Its certainly possible that Democrats could gain votes by delivering more real-world benefits to Americans, moving to the right on racial and identity issues or  my preferred approach  laying out a real, sustainable vision for a more equitable society.",
    "I see the business community and other institutions underestimating the Trumpist threat but also acting cautiously because they have seen how DeSantis, Trump and other politicians of this ilk seek to use government power to punish those who cross them.",
    "But based on the results of the 2016, 2018 and 2020 elections, Trumpism is popular enough  and its easy to imagine Trump or someone like him running at the right moment (say, during a recession) and winning more than 50 percent of the national vote.",
    "Greg Abbott of Texas and Ron DeSantis of Florida look likely to win this fall after pushing agendas centered on antipathy to some groups (migrants, transgender Americans) and alignment with others (conservative Christians, rural voters).",
    "Third, Trumpist Republicans are tapping into other widely held resentments, from misogyny and sexism to Islamophobia  and a more generalized frustration that the government and the media give too much attention to certain minorities.",
    "Relatedly, there is another very American reason that the radicalism of the current GOP might be popular: its reliance on anti-Black sentiment, which has been a critical force in other successful U.S. political movements.",
    "The wave of GOP laws passed this year targeting transgender people is a good example of both demagoguing a small, vulnerable group and stoking resentment against those (Democrats) seeking to accommodate it.",
    "White voters, particularly in the South, coalesced around anti-Black sentiment after the Civil War, after the passage of the Voting Rights Act in 1965, and again after the election of Barack Obama in 2008.",
    "GOP primaries are now largely races over which candidate is the Trumpiest; media-bashing, disdaining institutions and getting the former presidents endorsement are the easiest ways to rise in the party.",
    "Many Americans, including some Black ones, strongly dislike left-wing activists of all races who correctly argue that the systemic inequalities Black people face are because of long-standing policies.",
    "Most important, we have the results of the 2020 election: Though Donald Trump lost, he won 11 million more votes than he did in 2016, including a significantly higher share of the Latino electorate.",
    "Those on the left say the political system, even under Democratic leadership, is failing to make Americans day-to-day lives better, leaving them open to a right-wing, burn it all down? ideology.",
    "I see the Democratic Party underappreciating the real appeal of this kind of politics, clinging to a self-absorbed view that the rise of Trumpism is simply because of the failings of the left.",
    "Fox News personalities who leave the network to pursue a more moderate conservatism on other platforms rarely succeed, while their replacements at Fox News thrive by becoming more radical.",
    "Authoritarianism, American-style fascism, Trumpism  or whatever other term you choose for the radical turn that the American right has taken  is terrible for our nation and the world.",
    "I suspect that if Roe v. Wade is overturned, Republicans will further lean into misogyny to create a counternarrative to liberal arguments that the GOP is anti-woman.",
    "But there are also reasons to think that Trumpism appeals to a lot of Americans  that they are turning to this style of politics simply because they like it.",
    "But sadly, its also possible that no matter what anyone does, a growing number of Americans have gotten a taste of Trump-style politics  and liked it.",
    "And the fact that some non-Christians and voters of color are drawn to Trumpism doesnt disprove the idea that its based on identity or even bigotry.",
    "I think the most important explanation is that the sentiments that Trump-style politicians tap into are in some ways human nature.",
    "Some argue that social media is disseminating misinformation that bolsters right-wing conspiracy theories and politicians who lie.",
    "But when I look at Trump and DeSantis, I see autocratic politicians whose messages resonate deeply with huge numbers of voters.",
    "To them, anti-woke? rhetoric that essentially defends America from broad charges of racism has a pseudo-patriotic appeal.",
    "Political observers have suggested a variety of reasons for the successes of the increasingly Trumpist Republican Party.",
    "The most recent Republican popular-vote winner was George W. Bush, whose conservatism is much less radical than Trumps.",
    "Centrist Democrats say their partys left wing is annoying voters and making the GOP an appealing alternative.",
    "Center-left Democrats won the presidential popular vote in seven of the past eight elections.",
    "(The quote comes from an extended Twitter conversation that helped inspire this column.)",
    "I dont think the radicalized GOP is destined to win over the majority of Americans.",
    "Its not that Trumpism is more popular than alternative approaches.",
    "Unfortunately, all signs are that it is working pretty well.",
    "That US fascism is racist and white supremacist is a given.",
    "After all, we see many market indications of this appeal.",
    "There is no reason to think Americans are immune to it.",
    "The Democrats did win in 2018 and 2020, after all.",
    "But something can be both terrible and popular.",
    "That it is all-white is not.",
    "Incumbent Govs."
  ]
}