{
  "id": 3822,
  "mediaId": 881,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Swastikas Fly at Disney as Neo-Nazis Appear to Join Anti-Grooming Protests",
  "image": "https://video-images.vice.com/articles/62793bfbcb7c9d0095f62122/lede/1652116421624-gettyimages-1239735143.jpeg?crop=1xw:0.7864xh;0xw,0.0439xh&resize=1000:*",
  "link": "https://www.vice.com/en/article/k7wdxm/disney-neo-nazis-anti-grooming-protests",
  "sentiment": "0",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    345,
    524,
    611,
    2661,
    2851
  ],
  "sentences": [
    "Swastika flags fluttered outside a Disney World resort entrance in Orlando, Florida, this weekend, where a medley of far-right activistsincluding neo-Nazishad convened for a protest against grooming.?\nDisney and its affiliated parks have become culture-war battlegrounds ever since the company withdrew its support from Floridas controversial Dont Say Gay? law earlier this year, amid a right-wing moral panic over schoolkids learning about LGBTQ issues.",
    "Its not clear what group the neo-Nazis were affiliated with, if any, but their apparent interest in the issue coincides with the appearance of antisemitic flyers in at least two American cities in recent days (San Antonio and Kenosha, Wisconsin), containing a list of (supposedly) Jewish Disney executives.",
    "But as they made their way through the MAGA crowd, toward the Disney World resort sign, they could be heard explaining that they were all on the same side.?\nEverythings gonna be peaceful, right guys?? the man with the megaphone asked one of the neo-Nazis.",
    "There was some initial confusion when a group of men arrived holding swastika flags and wearing gas masks, Nazi Germany-style military uniforms, and skull masks (which are increasingly associated with hardcore accelerationist neo-Nazis).",
    "Now it would appear that neo-Nazis are looking to boost their visibility and credentials in mainstream circles by latching onto this latest right-wing cause du jour: baseless accusations that Disney supports grooming children.",
    "In recent months, Disney has become the focal point of an intensifying conspiracy theory that claims the corporation is a front for a massive pedophile ring, and grooms? children through subliminal messaging in its movies.",
    "The debacle has opened the floodgates for intensely homophobic and transphobic rhetoric, and allowed right-wingers to launder tired narratives about the LGBTQ community and sex predators into the mainstream.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "In the last two months, this narrative has ballooned: Right-wing culture warriors have lambasted the company for pushing a woke? agenda on kids through their movies featuring diverse characters.",
    "Less than a month ago, the same Disney World resort entrance was the backdrop to a similar protest that drew a few hundred MAGA activists and at least eight right-wing political candidates.",
    "Floridas Dont Say Gay? law, which will take effect next year, bars educators from discussing anything related to sexual orientation or gender identity with kids up to the age of 12.",
    "With the support of state lawmakers, DeSantis yanked a 55-year-old arrangement that granted Disney special tax status for its sprawling 25,000 acre Disney World complex.",
    "A group of residents from Disney Worlds surrounding counties have filed suit in an effort to block the law, claiming that theyll end up footing the bill.",
    "The protesters who showed up first on Saturday were clad in the usual red-white-and-blue MAGA regalia, waving Fuck Biden? flags, and hawking Trump merch.",
    "At first, according to livestreams, it seemed as though the MAGA crowd thought the neo-Nazis were there to protest them.",
    "Critics of the law, which now includes Disney, have been baselessly accused of supporting? grooming.",
    "The Nazis even came down here to fuckin stop us,? one man bellowed through a megaphone.",
    "So as long as everythings cool, man, youre alright.? Then he gave them a thumbs-up.",
    "Ron DeSantis has only added fuel to the fire by escalating his fight with Disney.",
    "WELCOME TO PEDO WORLD,? one of the neo-Nazis shouted through his own megaphone.",
    "Every single aspect of child grooming at Disney is Jewish,? the flyer read.",
    "You have just as much right to be out here as us,? megaphone man said.",
    "Thats right,? one of them replied.",
    "Gov."
  ]
}