{
  "id": 3823,
  "mediaId": 302,
  "date": "d2022-05-09T17:00",
  "headline": "Florida campus surveys under scrutiny in lawsuit. A political tool.",
  "image": "https://www.tampabay.com/resizer//DblZiteJeIaZZPmiqvsV-2uHeRk=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/ESQSWEO7H5F53PR3ATSB7PYLVY.JPG",
  "link": "https://www.tampabay.com/news/education/2022/05/09/florida-campus-surveys-under-scrutiny-in-lawsuit-a-political-tool/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3274,
    3288,
    3294,
    3541,
    2661
  ],
  "sentences": [
    "The law incentivizes Floridas public institutions of higher education to police the speech inside, and outside, of their classrooms to avoid having to litigate cases.?\nIt alleges the state abruptly ended contract with Florida State Universitys Institute of Politics, the entity initially tapped to help design the survey, so state officials could hurriedly finalize the surveys themselves.? The lawsuit states that consultants at FSU were instructed that their purpose was to address increasing concerns that university instructors, who are, on average, very liberal, instill and perhaps require their students to provide a particular political viewpoint.?\nA contract obtained from FSU shows the state Board of Governors agreed to pay the institute $75,000 to develop an objective, nonpartisan, and statistically valid survey? in June 2021.",
    "They initially wanted respondents to say how strongly they agreed with statements like I believe that through hard work, everyone can succeed in American society,? I believe that racial discrimination is no longer a problem in America? and I believe undocumented immigrants should be denied access to public education.?\nThey also proposed asking respondents to state their gender identity, sexual orientation and religion with unusual specificity.",
    "Among the categories they offered for survey participants to check: female/woman,? transgender female/woman,? historically black protestant,? evangelic protestant? and mainline protestant.?\nWhile the draft was later modified to be more general, it has emerged as a piece of evidence in a lawsuit that is challenging the annual surveys, which are required under a law passed last year by the Legislature.",
    "If so, that seems extraordinarily problematic since secondary education is supposed to be challenging and our students need to be challenged so that they can be competitive in the rapidly changing global economy.?\nThe final survey received 9,175 employee responses and 8,835 student responses from Floridas public universities, according to State University System spokesperson Renee Fargason.",
    "Last week, the Board of Governors and the Florida College System responded by denying the allegations and reaffirming their stance that the government does, undeniably, have a compelling state interest in fostering intellectual freedom and viewpoint diversity at public universities and colleges.?\nThe lawsuit chronicles escalating efforts by Gov.",
    "They cited questions asking students how unfair and one-sided? their professors were in presenting material and if they created a hostile environment? to certain political or social views.?\nThe researchers contended the term hostile? needed to be more clearly defined.",
    "The survey lacks specificity in ways that are confusing and make the survey read like a political tool rather than a legitimate attempt to improve the (university) system.?\nOther comments recommended getting rid of some questions and asking for more clarification.",
    "The law intrudes upon the private views and associations of students and faculty and ... pits students against faculty members in a battle over classroom expression, and public colleges and universities against their own faculty,? the complaint says.",
    "The suit was filed by the state faculty union, five professors and three students who argue that the new law purports to achieve intellectual freedom and viewpoint diversity? in higher education but is having the opposite effect by chilling speech.",
    "The money was paid and the institutes role continued into September, as required under the contract, an FSU spokesman said, but not before its researchers expressed concerns about the surveys design.",
    "The intellectual freedom? surveys recently distributed at Floridas public colleges and universities have drawn harsh criticism for trying to gauge whether politics seeps into classrooms.",
    "In recent months, they have referred to state schools as socialism factories? dominated by the woke mob,? with educators smuggling? their political agendas into class presentations.",
    "The plaintiffs draw parallels to the Johns Committee in the 1950s, an initiative by the Florida Legislature to purge college campuses of Marxists and members of the LGBTQ community.",
    "The lawsuit also alleges that Florida State University researchers hired to help develop the survey were dropped from the process after they raised questions about the draft.",
    "But the questions asked of roughly 1 million students, faculty and other employees were on the way to being even more controversial, court documents show.",
    "According to an early draft of the survey, state officials proposed a series of pointed, personal and politically charged questions.",
    "The surveys, which are voluntary and anonymous, were sent out and completed in early April, with more than 18,000 people responding.",
    "Fargason said the final version was drafted collaboratively? with staff from the State University System and Florida College System.",
    "Ron DeSantis and other Republican leaders to challenge what they see as a liberal bent on Floridas college and university campuses.",
    "?While I do not know what the implications of this survey will be, I do know this is not a good survey,? one researcher commented.",
    "Is it hostile because a student finds it personally or intellectually challenging?? one researcher asked.",
    "Officials who drafted the questionnaire wanted to ask more pointed political questions, documents show.",
    "Thats about 3 percent of the system, which has more than 73,000 employees and 430,000 students.",
    "The number of responses from people at state colleges was not immediately available.",
    "The results are to be analyzed and compiled in a report by September."
  ]
}