{
  "id": 3828,
  "mediaId": 195,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "The Hills Morning Report  Abortion tops agenda as lawmakers return",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/MR_pelosinancy-schumercharles_072821_ap-j-scott-applewhite.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/morning-report/3481474-the-hills-morning-report-abortion-tops-agenda-as-lawmakers-return/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    661
  ],
  "sentences": [
    "Putin said the campaign in Ukraine was a necessary move to avert what he described as a threat that was absolutely unacceptable to us (that) has been methodically created next to our borders.? He repeated that his countrys invasion of neighboring Ukraine was, in his view, forced, timely and the only correct decision by a sovereign, powerful and independent country.?\nThe danger was rising by the day,? Putin said, adding that Russia has given a preemptive response to an aggression.?\nOn Sunday, first lady Jill Biden and Canadian Prime Minister Justin Trudeau became the latest Western figures to meet with Ukrainian officials and the people of the war-torn country in a display of allied support and encouragement.",
    "Virtual Event Invite\nJoin The Hills Friday event at 12:30 p.m., Improving Rare Disease Diagnostics Care,? featuring an important discussion about shortening critical time to diagnosis of rare diseases with Rep. Diana DeGette (D-Colo.),sponsor of the Cures 2.0 Act; Rep. Rodney Davis (R-Ill.), a member of the Rare Disease Congressional Caucus; Joni Rutter, acting director of the National Institutes of Healths (NIH) National Center for Advancing Translational Sciences; Anne Pariser, a vice president with the company Alltrna and a former NIH official; Marshall Summar, director of the Rare Disease Institute at Childrens National Hospital; and many other expert speakers.",
    "Asa Hutchinson (R), who may seek the presidency in 2024, on Sunday told ABCs This Week? that a national abortion ban floated by Senate Minority Leader Mitch McConnell (R-Ky.) during a USA Today interview is inconsistent with what weve been fighting for.? The governor, who last year signed a near total abortion ban into law in Arkansas, said, If you look at a constitutional or a national standard, that goes against that thrust of the states having prerogative.?\nRelated Articles\n Paul Kane, The Washington Post: In confirming Supreme Court justices, private meetings overtake public confirmation hearings for senators.",
    "Nearing the end of a trip to Slovakia and Romania, the first lady, who has often served as eyes and ears for her husband during her travels over the years, made an unannounced side trip on Mothers Day to western Ukraine, where she met with her counterpart, Olena Zelenska, wife of Ukrainian President Volodymyr Zelensky.",
    "LEADING THE DAY\n? UKRAINE CRISIS\nRussian President Vladimir Putin today in Moscow used a Victory Day speech at a military parade on Red Square to mark a World War II triumph over Nazi troops while offering no new clues about Russias ongoing strategy in its war with Ukraine (The Associated Press and The New York Times).",
    "As fate would have it, art collector Laura Young rescued the bust from the shop in Austin, did her homework, learned it went missing in Germany and eventually worked out a deal that put the sculpture on temporary display in San Antonio and arranged for the busts return to Germany next year (The Associated Press).",
    "Along with the abortion push this week, the House will vote on a resolution granting congressional aides the ability to unionize, while the Jan. 6 select committee is gearing up for a new public phase of its investigation, with public hearings set to take place next month (The Wall Street Journal).",
    "The Hill: Sen. Lindsey Graham (R-S.C.) says Roe v. Wade created a constitutional right that didnt exist.?\nThe Hill: Sen. Amy Klobuchar (D-Minn.) says Justice Samuel Alito is taking us back to the 1850s.?\n Associated Press / Jose Luis Magana | Protestors outside the Supreme Court on Thursday.",
    "Either way, Im glad I got to be a small part of (its) long and complicated history, and he looked great in the house while I had him.?\n Associated Press / San Antonio Museum of Art | Ancient Roman bust on display in San Antonio after 2018 purchase at Texas Goodwill store.",
    "From California to Texas to Indiana, electric grid operators are warning that power-generating capacity is struggling to keep up with demand, a gap that could lead to rolling blackouts during heat waves or other peak periods as soon as this year (The Wall Street Journal).",
    "On Thursday, the U.S. will host a virtual COVID-19 global summit, along with current Group of Seven lead country Germany, the Group of 20 host country Indonesia, the African Union chair Senegal and Belize, the current chair of the CARICOM Caribbean grouping.",
    "President Biden and other Group of Seven counterparts spoke virtually Sunday morning about the ongoing situation in Ukraine and agreed to impose sweeping new sanctions on Russia, including additional export controls and a commitment to phase out Russian oil.",
    "The first lady made her two-hour swoop into the town of Uzhhorod during Russias continued assaults elsewhere in Ukraine, including the bombing of a school in the eastern region where 60 sheltering Ukrainian villagers were feared dead on Sunday (Reuters).",
    "Boozman, a two-term Senate Republican, has former President Trumps backing, but that has done little to dissuade his opponents from trying to claim the mantle in what is shaping up to be one of the most expensive primary races for a GOP incumbent.",
    "Ron DeSantis [R] a platform to stand for freedom, and it gave Democrats in Democrat states a plan to stand for mandates.?\nBetween July 2020 and July 2021, Floridas population grew by more than 211,000, a net migration that tops every other states.",
    "Collins and Murkowski, the lone Senate Republicans who support abortion rights, have criticized the legislation and argue it does not offer enough protection for Catholic hospitals and other religious entities that decline to perform abortions.",
    "Lawmakers return to Capitol Hill this week for a two-week stretch to deal with a potpourri of issues, headlined by the Democratic response to the leaked opinion draft by the Supreme Court that could precipitate the end of Roe v. Wade.",
    "The leaked opinion is also spawning renewed calls by Democrats and progressives to add justices to the Supreme Court, fueled by the possibility that the court will not end with Roe v. Wade and could overturn other landmark decisions.",
    "He and Vice President Harris will receive the Presidents Daily Brief at 11:15 a.m. Biden and Harris will speak in the Rose Garden at 1:30 a.m. about federal improvements to high-speed internet access and costs across the country.",
    "As The Hills Max Greenwood and Amie Parnes write, a perfect storm has contributed to the GOP lean, including shifting demographics, a poorly organized state Democratic Party and the pandemic, which has driven many to the state.",
    "As The Hills Jordain Carney details, the incumbent Republican is pushing to avoid a runoff on May 24, but public polling indicates he still has work to do, as 45 percent of voters back him  just shy of the requisite 50 percent.",
    "On Capitol Hill, inside the Oval Office and among progressive groups, a question posed by Alitos draft opinion is whether other federal rights assumed to be settled are suddenly more vulnerable to being overturned.",
    "I thought it was important to show the Ukrainian people that this war has to stop and this war has been brutal and that the people of the United States stand with the people of Ukraine,? the first lady said.",
    "The summit will redouble our collective efforts to end the acute phase of the COVID-19 pandemic and prepare for future health threats,? the countries said in a joint statement (Agence France Presse).",
    "? INTERNATIONAL\nLinda Thomas-Greenfield, the U.S. ambassador to the United Nations, heaped criticism on the Taliban on Sunday over their directive for women to cover their faces while in public.",
    "The bust eventually found its way into the possession of King Ludwig I of Bavaria, who ruled for three years until 1848 and was a lavish patron of the arts who harbored a fixation about Pompeii.",
    "The Senate convenes at 3 p.m. and will resume consideration of the nomination of Ann Phillips to be administrator of the Maritime Administration, which is part of the Transportation Department.",
    "Jill Biden ventured across the border for a visit just as U.S. diplomatic personnel began returning to work at the U.S. Embassy in Kyiv after being evacuated at the start of the war (The Hill).",
    "The Sunshine State, which voted for Trumpin each of the past two elections, has undergone a rightward tilt in recent years despite an influx of new residents hailing often from blue states.",
    "The White House daily briefing is scheduled at 3 p.m.\ng Hill.TVs Rising? program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    "Here we are on Mothers Day, a week where the court has slapped women in the face in terms of disrespect for their judgments about the size and timing of their families? (CBS News).",
    "In 2019 alone, an estimated 28,000 people moved to the state from California, 28,000 more people migrated from New Jersey and an additional 57,000 new Floridians fled New York.",
    "The vice president, in addition to her public schedule with the president today, will ceremonially swear in N. Nickolas Perry at 3:20 p.m. to be U.S. ambassador to Jamaica.",
    "ELSEWHERE\n? CORONAVIRUS\nCOVID-19s pending surge of infections could impact 100 million Americans this fall and winter, and the government is trying to get ready (The Hill).",
    "The LGBT community is alarmed for a host of reasons, including that gay marriage is a precedent that could be without federal protection (The New York Times and The Hill).",
    "(or first century A.D.), an unknown Roman sculptor created a marble bust believed to be the son of Pompey the Great, who was defeated by Julius Caesar during a civil war.",
    " At least 1 million Americans are dead because of the coronavirus, now the third-largest killer in the U.S. after heart disease and cancer, based on 2020 statistics.",
    "), long one of the quieter members of the Senate GOP, is scrambling to fend off Trump-inspired primary challengers as the under-the-radar race goes down to the wire.",
    "Speaking to reporters on Thursday, the West Virginia centrist said that he is looking at everything? but declined to say how he would vote (The Washington Post).",
    "Senate Majority Leader Charles Schumer (D-N.Y.) late last week teed up a vote on the Womens Health Protection Act, which would essentially codify Roe into law.",
    "The Taliban rule, which was announced on Saturday, would also punish the father or closest male relative to a woman caught exposing her face (The Hill).",
    "The only question at this point surrounds what three senators  Susan Collins (R-Maine), Lisa Murkowski (R-Alaska) and Joe Manchin (D-W.Va.)  will do.",
    "This is about something so serious and so personal and so disrespectful of women,? Speaker Nancy Pelosi (D-Calif.) told Face the Nation? on Sunday.",
    "If you tug on the Roe thread, its like playing a really horrible game of Jenga,? Melissa Murray, New York University law professor, told The Hill.",
    "Unvaccinated people were 53.2 times more likely to die thus far during the pandemic than those fully vaccinated and boosted (The Washington Post).",
    "The first lady met this morning in Bratislava with Slovakian President Zuzana Caputova before departing to arrive back in Washington this evening.",
    "The U.S. will bar Russia from accounting and consulting services (The Hill) and impose visa restrictions on Russian military officers (The Hill).",
    "https://nyti.ms/3KOEOre\n How Alitos draft opinion on abortion rights could change America, by Amy Davidson Sorkin, commentary, The New Yorker.",
    "By 2018, the 50-pound marble likeness of Pompeys son was priced at $34.99 and gathering dust beneath a Texas Goodwill display table.",
    "Elsewhere on the political scene, Florida has long been Americas preeminent swing state, but it looks a lot like Trump country now.",
    "Biden at 2:45 p.m. in the Oval Office, with Harris in attendance, will sign the Ukraine Democracy Defense Lend-Lease Act of 2022.",
    "Adding to that boost, Orlando and Jacksonville were both among the 10 fastest-growing metropolitan areas between 2010 and 2020.",
    "Sen. Tina Smith (D-Minn.) said the change is needed to restore balance? to the court, according to The Hills Alexander Bolton.",
    "During World War II, an American soldier is believed to have made off with the head, which made its way to the United States.",
    "Thomas-Greenfield told CNNs State of the Union? that the order is unconscionable,? adding that it sends a chilling? message.",
    "Message this fall: Be vaccinated, boosted, risk-aware and ready for the latest science about the spread of sub-subvariants.",
    "In China, Shanghai authorities were tightening a city-wide COVID-19 lockdown they imposed more than a month ago (Reuters).",
    "Theres one word and its COVID,? said Nelson Diaz, a Republican lobbyist and former chairman of the Miami-Dade County GOP.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    " Julia Manchester and Max Greenwood, The Hill: Democrats make fate of the Supreme Court a midterm issue after Roe leak.",
    "Hungary refused to sign off on oil sanctions over the weekend and talks continue today (Axios and The New York Times).",
    "There is little drama surrounding the vote, as it will fail, just as the vote on a similar bill did in late February.",
    "https://bit.ly/3N0GcbS\n Nothing beautiful survives the culture war, by Elizabeth Bruenig, staff writer, The Atlantic.",
    " Associated Press / Susan Walsh | First lady Jill Biden and Olena Zelenska, Ukraines first lady, on Sunday in Kyiv.",
    "Jake Bequette and Jan Morgan, his two main opponents, pull in 19 percent and 16.5 percent support, respectively.",
    "Current average U.S. COVID-19 daily deaths are 340, according to the Centers for Disease Control and Prevention.",
    "Kathy Hochul (D) tested positive for COVID-19 on Sunday and is isolating with no symptoms (NBC 4 New York).",
    "\nTotal U.S. coronavirus deaths reported as of this morning, according to Johns Hopkins University: 997,528.",
    "The president will headline a Democratic National Committee fundraising event in Potomac, Md., at 6 p.m.",
    "Schumer, however, has not jumped on board, saying in recent days that his focus is on this weeks vote.",
    "Collins has proposed her own narrower bill, but Schumer has declined to bring it up for a vote.",
    "As for Manchin, he was the lone Senate Democrat to side with Republicans in the February vote.",
    "Boozman expressed confidence that he will ultimately avoid a runoff when all is said and done.",
    "Add another item to Americas long list of critical infrastructure woes: electricity shortages.",
    " The Hill: Despite popularity, taxes on the wealthy struggle to find a foothold in Congress.",
    "Follow us on Twitter (@alweaver22 & @asimendinger) and suggest this newsletter to friends!",
    " Jordain Carney, The Hill: This week: Senate heads toward failed abortion vote amid fury.",
    "Countries allied with Ukraine condemned the shelling of the school in Luhansk on Sunday.",
    "OPINION\n How Roe warped the republic, by Ross Douthat, columnist, The New York Times.",
    " The New York Times: A blood feud in West Virginia involves a familiar figure: Trump.",
    " The Associated Press: Trump, emboldened after Ohio victory, faces challenges ahead.",
    "But it was bittersweet since I knew I couldnt keep or sell the (bust),? Young said.",
    "g? Introducing NotedDC, The Hills curated commentary on the beat of the Beltway.",
    "I think when the undecideds all settle  well be over 50,? Boozman told The Hill.",
    " Politico: Senate Democrats shop revamped child care reconciliation proposal.",
    " The Hill: Pro-Trump candidates look to harness populist energy after Ohio.",
    " Politico: Threat to Roe v. Wade puts GOP on defense in 2022 battlegrounds.",
    "https://bit.ly/3smTHdY\nWHERE AND WHEN\nThe House meets Tuesday at 2 p.m.",
    "The president returns to the White House from Delaware at 9:50 a.m.",
    " Niall Stanage: The Memo: Trump, Biden allies crave a 2024 rematch.",
    "Tate Reeves (R) doesnt rule out banning contraception if Roe falls.",
    "Trudeau made his unannounced trip to Irpin, Ukraine (Reuters).",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The Bidens spoke soon after by phone (The Associated Press).",
    "However, many new Florida residents are from blue states.",
    "THE CLOSER\nAnd finally  Lost, found, returned (sort of).",
    "IN FOCUS/SHARP TAKES\n? POLITICS\nSen. John Boozman (Ark.",
    " The Hill: Five Senate races to watch amid Roe fallout.",
    "Nevertheless, Democratic leaders are plowing ahead.",
    "Eighteen percent of primary voters are undecided.",
    "Click here to subscribe to our latest newsletter.",
    "It made red states redder and blue states bluer.",
    "The vote is expected to take place midweek.",
    "Also, check out the Rising? podcast here.",
    "Email: Alexis Simendinger and Al Weaver.",
    "Stay Engaged\nWe want to hear from you!",
    " The Washington Post: Mississippi Gov.",
    "Federal versus states: Arkansas Gov.",
    "Sign up for more information HERE.",
    "It gave people like [Florida Gov.]",
    "Once upon the first century B.C.",
    "g New York Gov.",
    "See all Video",
    "? LIGHTS OUT?",
    "ET."
  ]
}