{
  "id": 3829,
  "mediaId": 233,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "As 'Don't Say Gay' and similar bills take hold, LGBTQ youths feel they're 'getting crushed'",
  "image": "https://www.gannett-cdn.com/presto/2022/03/11/USAT/e9956511-952f-4715-a07a-e9a17cfa716e-USATSI_17855281.jpg?crop=4433,2494,x0,y154&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/education/2022/05/09/dont-say-gay-lgbtq-youth-reaction/7398468001/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cady Stanton",
  "authorUrl": "https://www.usatoday.com/staff/7936351002/cady-stanton/",
  "termIds": [
    661,
    3984,
    4118,
    3202,
    3307,
    3308,
    2550,
    2661
  ],
  "sentences": [
    "'There's not a lot you can do, especially as a kid'\nAn Ohio bill, HB 616, is closest in language to Floridas Dont Say Gay? legislation, and it includes a ban on instructional materials and curriculum on sexual orientation or gender identity,? in addition to bans on instruction around critical race theory, which is not taught in K-12 schools, and intersectionality.",
    "As president of his school's GSA, or Student Alliance for Equality, Lauriano said he frequently fields questions about the future of the club, especially amid a recent state bill that would require guardian permission to participate in student groups involving sexuality, gender or gender identity.",
    "Legislation makes students 'feel like they're alone'\nRayne Duncan, 17, a senior in Arizona, works with a high school leadership development program called the GLSEN SHINE team, which helps students organize GSAs and advocacy campaigns at their schools through leadership training.",
    "Several LGBTQ youths across affected states, most of whom are too young too vote, shared similar frustration with USA TODAY over elected officials who are making decisions about their education and school spaces without consulting or considering students' perspectives.",
    "LIFELINE CHANGES:LGBTQ advocates hope for 'culturally competent' training with suicide prevention lifeline's shift to 988\nJavier Gomez, 18, is one of many students who organized walkouts at schools across Florida in protest of the original \"Don't Say Gay\" bill.",
    "Throughout the country, students are staring down the barrel of bills targeting discussions of sexuality, gender identity and LGBTQ-related topics in classrooms, made more visible by the recent passage of the so-called Dont Say Gay? bill in Florida.",
    "Since legislation targeting conversations about sexuality, gender identity and LGBTQ-related topics in schools has spread across the country, 15-year-old Jaime Lauriano and his peers in Arizona have felt scared, disheartened and confused.",
    "But youths in \"affirming\" schools, such as those with LGBTQ representation in school curriculums, had nearly 40% lower odds of attempting suicide compared with LGBTQ youths in nonaffirming schools, according to the Trevor Project.",
    "In Iowa, Freet said the passage of a bill banning transgender girls from participating in female sports has left her trans peers isolated, bullied and suffering, often without places to escape for comfort and support at school.",
    "In the past year, more than half of transgender and nonbinary youths considered attempting suicide, according to a 2021 survey from the Trevor Project, which provides crisis and suicide prevention services for those under 25.",
    "Bullying of transgender kids 'has gone through the roof'\nAs more and more legislation gains attention in these states, students also said they've experienced or witnessed bullying at their schools targeted at LGBTQ students.",
    "\"I think it's important for (students) to have safe spaces, which is why we have GSAs and why we have leaders making sure that GSAs run smoothly and are a safe place for people to go to,\" they told USA TODAY.",
    "Even the possibility of these bills being passed has stoked frustration, confusion and feelings of hopelessness among LGBTQ youths across the U.S., several high school students told USA TODAY.",
    "Duncan said lawmakers and the public don't understand the impact these bills have on the well-being of LGBTQ youth, who are working through a stage in life that comes with its own challenges.",
    "\"I'm understanding a world with a different perspective and it's really tough because it arises a lot of anxiety about the future, for myself and for my educators and for my peers.\"",
    "\"We tried to promote our club to be a safe haven, a place where students can come hang out, talk to one another and feel like they're with their community,\" Lauriano told USA TODAY.",
    "Gomez, who is gay, said experiencing homophobia and discrimination as well as working as an activist have caused him to mature faster than the average senior high school student.",
    "It echoes a previously overturned law, dubbed by opponents as \"no promo homo,\" that prohibited sexual education in public schools that promoted a \"homosexual lifestyle.\"",
    "CJ Walden, a 17-year-old high school senior in Florida, said he lives in an area that's \"liberal and democratic\" but that he experiences homophobia at school every day.",
    "In Iowa, Senate Bill 2024, currently sitting in a subcommittee, bans any \"instruction relating to gender identity\" in K-6 classrooms without parental consent.",
    "Ron DeSantis this spring, more than a dozen bills with similar intentions restricting conversations on LGBTQ topics have been introduced across the country.",
    "Earlier this year, Florida passed a so-called \"Don't Say Gay\" law, restricting discussions of sexual orientation and gender identity in elementary schools.",
    "Iowa junior Nadaley Freet, 16, said these decisions focused on \"parental rights\" attempt to stifle the voices of young people and make them feel unheard.",
    "Ohio student Abby Doench, 17, said she fears for younger students at her high school who may lack the support that she received when she came out as gay.",
    "The Florida bill, formally titled Parental Rights in Education, restricts discussions of sexual orientation or gender identity in elementary schools.",
    "In Arizona, the bill requiring permission for students to join groups involving sexuality and gender, HB 2011, is currently assigned to a committee.",
    "For many, the GSA is one of the only spaces where students feel accepted and can fully express their gender and sexuality, he said.",
    "Now LGBTQ youth in many states are facing similar legislation targeting classroom discussion of LGBTQ topics and community spaces.",
    "They also said they feared being discriminated against and worry about the hardship that might follow for them and their peers.",
    "His peers look to him for guidance, but Lauriano, a gay high school sophomore, is just as worried about the group's future.",
    "They shared their feelings of anger and disgust that these spaces are at risk and that their conversations may be policed.",
    "For LGBTQ youth  those who are trans and nonbinary in particular  attacks on support systems and resources can be dire.",
    "USA TODAY spoke with 10 students who identify with the LGBTQ community in states where similar legislation is proposed.",
    "On multiple occasions, she said she has comforted LGBTQ friends and younger students who she found crying in bathrooms.",
    "Students shared with USA TODAY their frustration, confusion and fears for the future as the legislation gains traction.",
    "\"If there is a place at their school that they can go to after school and have a community, they don't feel isolated.\"",
    "He said he feels lucky to support from others to brush the interactions off, but he knows many other students can't.",
    "They just are stuck in this little bubble of themselves, so that they can't see their actions will result in death.\"",
    "\"Since the different bills have passed ... the bullying for trans kids here has gone through the roof,\" Freet said.",
    "The legislation has worried students for whom schools may be the only place they can speak openly on LGBTQ issues.",
    "\"But when things like this are happening, it completely destroys that idea, and it makes students scared.\"",
    "Like they don't belong there.... they're being bullied to the point where they don't like who they are.\"",
    "It's all these people are making rules about you that you don't have any say on, and it's distressing.\"",
    "It makes you really angry, and makes you feel really useless,\" Doench said of the legislation.",
    "You put all of these things on top of it, and it just adds more and more weight,\" Duncan said.",
    "\"I feel like they're trying to strip us from our opinions,\" said Freet, who is bisexual.",
    "\"It makes us fearful, makes us scared of the future and what it has to offer.\"",
    "\"They're trying to gaslight us and tell us: 'Oh, no, you're just young.",
    "Duncan, who is nonbinary, is also the president of their school's GSA.",
    "\"It makes students feel like they're alone,\" Lauriano said.",
    "\"It has severely diminished my mental health,\" Gomez said.",
    "\"There's not a lot you can do, especially as a kid ...",
    "They certainly don't care about young queer people.",
    "\"The people in charge don't care,\" Duncan said.",
    "You don't know what you're talking about.'\"",
    "\"It's making it seem like they're outcasts.",
    "\"Being a teenager is already really hard.",
    "\"... Too many kids are getting crushed.\"",
    "\"They don't care about young people.",
    "Since being signed into law by Gov.",
    "\"It's scary."
  ]
}