{
  "id": 3830,
  "mediaId": 302,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "We need free speech on Florida campuses and critical thinking in the classroom | Column",
  "image": "https://www.tampabay.com/resizer//l7g2zRRiJf5xkOvW_0OdoxwV3n0=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/BX2NSHZY3ZDXLNGG3TDXVRQGRQ.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/09/we-need-free-speech-on-florida-campuses-and-critical-thinking-in-the-classroom-column/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3674,
    4404,
    4470,
    428,
    3214,
    2661,
    2945
  ],
  "sentences": [
    "Princeton Professor Wendy Brown notes that the classroom is a space where were not talking left wing or right wing but offering the learning that students need to be able to come to their own positions and judgments.? In other words, the classroom is centered on academic freedom and the development of critical thinking.",
    "Ron DeSantis signed into law HB 7, formally titled the Individual Freedom? measure, which bans educators from teaching certain topics related to race and prevents them from making students feel guilt or shame about their race because of historical events.",
    "These measures have been described as a rightwing censorship effort unparalleled in its intensity.?\nBehind these efforts to cancel? progressive views lies the mistaken belief that campuses have become laboratories for political indoctrination.",
    "He cries out: O, let my land be a land where Liberty is crowned?  where equality is in the air we breathe.? Let it be the dream it used to be.?\nWhile presenting pleasing patriotic images of America, Hughes makes us question these images.",
    "I told the students that Langston Hughes represented the best of the liberal scholar seeking the truth, writing clearly, persuasively and movingly on the major ethical issues of his time  racism and discrimination.",
    "As DeSantis stated after signing the repressive legislation: We believe in education, not indoctrination.? Yet, the governor and the Republican Party fail to provide significant evidence of such indoctrination.",
    "Perhaps an example from my experience can demonstrate the importance of academic freedom in the classroom and the dangers of the current repressive political measures adopted by the state of Florida.",
    "I consistently began this lecture with a reading of Langston Hughes brilliant poem Let America Be America Again.? Through his poetry, Langston Hughes reminds us of the hope and dream of America.",
    "William F. Felice, professor emeritus of political science at Eckerd College, was the named the 2006 Florida Professor of the Year by the Carnegie Foundation for the Advancement of Teaching.",
    "Many commentators, for example, have noted that Critical Race Theory, a primary right-wing target for cancellation, is actually not taught in public schools and rarely mentioned in colleges.",
    "The Republican Partys outrage machine? is more interested in canceling? leftist views, stoking controversy and scoring political points than in protecting free speech and academic freedom.",
    "Hughes writes: There never has been equality for me, Nor freedom in this homeland of the free.  I am the poor white, fooled and pushed apart, I am the Negro bearing slaverys scars.",
    "The Republican Party attacks on public and college education have blurred this important distinction between academic freedom in the classroom and free speech on campus.",
    "In addition, by April more than 1,500 books primarily dealing with race and LGBTQ issues had been banned in U.S. school districts over the previous nine months.",
    "The Republican Partys highly political attack on public and higher education in America creates confusion and discord  and does not solve any actual problems.",
    "During my 30 years of college teaching, I personally never witnessed professors pushing political indoctrination from the left or the right in the classroom.",
    "This can only happen in an atmosphere of engagement, active learning and open discussion of all points of view  the opposite of political indoctrination.",
    "Our job is to try to get students to think critically about important thinkers  conservative and liberal  and decide for themselves what to think.",
    "In their eyes, Langston Hughes was desecrating America and my lecture was left-wing political indoctrination, which made white students feel bad.",
    "At all the colleges I have taught, speakers from the left and right were consistently encouraged to participate in the civic life of the campus.",
    "They sought to cancel? one of the most celebrated African-American writers from the curriculum and destroy academic freedom in the classroom.",
    "The professor through his or her selection of course materials and lesson plans establish the agenda and the direction of the discussion.",
    "I am the red man driven from the land.?\nThese lines remind us of the atrocities, such as the violence of slavery, that are also America.",
    "For many years at Eckerd College, I was honored to give the opening lecture on the liberal arts to all of our new first-year students.",
    "It is crucial to clarify the distinction between the campus as a public space as different from the classroom as a space for teaching.",
    "Neither governors, legislators, administrators or professors have the right to impose their political biases on the campus community.",
    "The new Florida law will further empower these individuals with political agendas to more effectively pursue their dangerous goals.",
    "In addition to Langston Hughes, the students were also engaged with the works of conservative thinkers, including theologian C.S.",
    "We were trying to get students to think critically about all of these important thinkers and decide for themselves what to think.",
    "All views are welcome that contribute to the topic, but the direction and objectives of the course are set by the teacher.",
    "Unfortunately, a few right-wing alumni and parents posted angry notes on social media denouncing this lecture.",
    "It is also unfortunate that these critics didnt take the time to actually examine the content of this course.",
    "Langston Hughes helps students more deeply appreciate the struggle for true freedom in America.",
    "In contrast, the campus is a public space where free speech should be the norm.",
    "And yet, Hughes ends on an optimistic truly American note, the idea of hope.",
    "He hopes that America can be all the things it was expected to be.",
    "He can be reached via his website at williamfelice.com.",
    "He will not give up on the idea of the American Dream.",
    "Lewis and philosopher Ayn Rand.",
    "He wants America to be better.",
    "Last month, Gov."
  ]
}