{
  "id": 3833,
  "mediaId": 302,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Why are we fighting sunshine and letting Floridas energy market fail? | Column",
  "image": "https://www.tampabay.com/resizer//kLe21vwc7Iic98sGup1IMCUAbDA=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/JDG47ZN2PVEONAI7GWCUTKZHIY.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/09/why-are-we-fighting-sunshine-and-letting-floridas-energy-market-fail-column/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Jenkins",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Because years ago, Floridas big three monopoly utilities chose to go all in on natural gas generation and are intent on squeezing every last penny of profit out of those gas-fired generating plants  even when doing so takes a big bite out of their customers wallets.",
    "Ron DeSantis veto was needed to kill HB 741, a massive assault on individual liberty and the free market that sailed through the Florida legislature at the behest of the states largest monopoly utility, Florida Power & Light.",
    "As if that wasnt bad enough, HB 741 included a huge subsidy that would guarantee FPL profits by letting it and other utilities raise customer electric bills to make up for any revenue lost to competition from rooftop solar.",
    "The Invading Sea? is the opinion arm of the Florida Climate Reporting Network, a collaborative of news organizations across the state, including the Tampa Bay Times, focusing on the threats posed by the warming climate.",
    "Spend your days with Hayes\nSubscribe to our free Stephinitely newsletter\nThe same shift is also happening in decidedly less sunny states such as Vermont, where solar already accounts for 14% of the states electricity.",
    "That gas-heavy mix is an even bigger customer burden now because the war in Ukraine  and Europes subsequent efforts to wean itself off Russian energy  has natural gas prices at a 14-year high.",
    "By contrast, solar energy paired with storage for nighttime generation is  along with wind and nuclear  not only cheaper, it is largely immune from price spikes due to conflicts overseas.",
    "That price stability of solar, along with its cheaper price and low carbon footprint, is a big draw for businesses looking to expand or relocate and a strong driver of economic activity.",
    "It would have denied solar customers fair market value for the excess electricity they send back to the grid, and allowed utilities to impose a host of punitive fees on those customers.",
    "While the governors veto stymied this brazen FPL power grab, at least for now, HB 741 was the product of a broken system that has Florida swimming upstream in todays energy market.",
    "In 2019 the Nevada legislature, with unanimous Republican support, passed legislation requiring 50% of the states electricity to come from solar and other renewables by 2030.",
    "From the state Legislature to the PSC, too many Florida policymakers are more committed to protecting power company interests than to looking out for regular Floridians.",
    "The result is subsidy laden anti-liberty, anti-competition legislation like HB 741, ever-rising electric bills, and a Sunshine State with a decidedly cloudy future.",
    "Florida has more sunshine to take advantage of than any state east of the Mississippi River, and is better positioned to reap solars incumbent economic benefits.",
    "For example, power from solar projects is selling for between $15 and $25 per megawatt hour (MWh)  a price guaranteed for 20 years via power purchase agreements.",
    "Old assumptions about which sources of energy are the cheapest and most reliable no longer hold due to advances in solar and battery storage technology.",
    "The bill, actually in early draft written by an FPL lobbyist, sought to prevent Floridians from using rooftop solar to become more energy independent.",
    "That is about as improbable and embarrassing as Vermonts Middlebury College sweeping the Gators, the Seminoles and the Hurricanes in football.",
    "Prior to the recent spike in natural gas prices, electricity produced by gas generation was selling for between $45 and $65 per MWh.",
    "This is why other sunny states such as Nevada, New Mexico and Utah are aggressively shifting their electricity production to solar.",
    "David Jenkins is president of Conservatives for Responsible Stewardship, a national organization with 10,000 members in Florida.",
    "In what should be great news for the Sunshine State, the energy market now favors solar power over natural gas and coal.",
    "Therefore, the more a utility relies on natural gas for its power generation, the higher your electric bill will be.",
    "They are also allowed by the Public Service Commission to pass fuel cost increases directly to their customers.",
    "FPL, Duke, and TECO, as monopolies with captive customer bases, are not subject to free market competition.",
    "Thus, there is less incentive for them to diversify with solar or other cheaper sources of energy.",
    "The resulting demand for U.S. natural gas overseas will continue to push prices higher.",
    "Making matters worse is the political power these monopolies wield in Tallahassee.",
    "The Sunshine State now gets a mere 4% of its electricity from solar.",
    "FPL, for example, generates 78% of its power from natural gas.",
    "The Tampa Electric (TECO) and Duke numbers are similar.",
    "Where is Florida in the solar sweepstakes?",
    "Why is this state so far behind?",
    "Its way back in the pack.",
    "Gov."
  ]
}