{
  "id": 3834,
  "mediaId": 195,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Florida tilts toward Trump amid population growth",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/trump-supporter_fl_022821getty_florida.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/state-watch/3479750-florida-tilts-toward-trump-amid-population-growth/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    661
  ],
  "sentences": [
    "We pounded that message for three or four or five months.?\nDemocrats, he said, need to start pouring in time and investments and organizing efforts on the ground, including registering voters on a year-round basis, not just a few months before an election, telegraphing a strong message and running to candidates that can speak to voters who dont necessarily always agree with Democrats.?\nThis is all about moving 3, 4, 5 percent of voters,? he said.",
    "That takes years, and it has to be nonstop and unrelenting.?\nDemocratic strategist Steve Schale, who is based in the Sunshine State and served as Florida director for Obamas 2008 campaign, said there are a couple of problems that have led to the rise of Republicans in Florida: An above average percentage of white voters who did not go to college and Hispanics, who have been gravitating over the past couple of cycles to the Republican Party.",
    "More importantly, Jewett said, they register and they vote.?\nBasically whats happened is the older senior generation  say the New Deal generation  who were pretty loyal Democrats, theyre dying off and theyre being replaced by the Baby Boomer retirees and many of them are moving to Florida and theyre very Republican,? Jewett said.",
    "Over the past two years, he has repeatedly bucked the advice of federal health officials in favor of a laissez-faire approach to the outbreak, earning him the praise of conservatives who have come to see Florida as a refuge from the pandemic-era restrictions and mandates imposed in other states.",
    "Long the nations largest  and most unpredictable  battleground state, Floridas politics have transformed at a breakneck pace in recent years, becoming more and more conservative even as hundreds of thousands of new residents have poured into the state, often from bluer territory.",
    "When you look at whats taken place from a numbers perspective, theres tremendous reason for concern,? Fernand Amandi, a Miami-based pollster and consultant whose firm helped Obamas campaign win the state in 2008 and 2012.\nIts become MAGA in exile,? Amandi explained.",
    "The sentiment is if you believe in the MAGA philosophy, Florida is where you want to be.?\nIts not uncommon now, in what was once staunch-blue terrain, to see Trump or Lets Go Brandon? flags outside of homes and on boats cruising down the intracoastal waterways.",
    "DeSantis has seized on the pandemic as a launching point for an ultra-conservative and ambitious policy agenda that has catapulted him to stardom among Republicans nationally and turned him into a prospective contender for the 2024 GOP presidential nomination.",
    "But Jewett noted that Florida voters often arent as conservative as the states political leaders, and suggested that the rightward lurch of Floridas politics may be driven more by elected officials like DeSantis than by the electorate as a whole.",
    "They are Republicans fed up with their blue laws in their blue states or theyre just independent-minded people to begin with and theyre just fed up with these blue states and theyre enjoying the freedom that Florida has to offer,? he said.",
    "Ron DeSantis a platform to stand for freedom and it gave Democrats in Democrat states a plan to stand for mandates.?\nDiaz said that he believes that the states embrace of conservative policies has drawn many recent arrivals to Florida.",
    "Late last year, the number of registered Republican voters overtook the number of registered Democrats, a sharp change since former President Obama won the state in 2008, when there 700,000 more registered Democrats than Republicans.",
    "Republicans have defined the party as the party of socialism and have said Democrats are playing footsie with communism.?\nThe Democratic Party, he added, needs to put in the work of rebranding and redefining now.",
    "In 2019 alone, an estimated 28,000 people moved to the Sunshine State from California; 28,000 moved from New Jersey, while a staggering 57,000 moved from New York, according to Census Bureau data from that year.",
    "Clearly Florida is more uphill than it was going back a few yearsAnd I dont think 2022 is going to be a great year for my party.?\nIf we dont address those two red flags, our pathway gets really narrow,? he said.",
    "I think theres a question of how much has mass public opinion changed in Florida, or is it more elite opinion, where the Republicans who are elected are pushing more conservative policies,? Jewett said.",
    "If the Supreme Court overturns Roe vs. Wade, as a leaked draft document last week showed, its sure to be another issue that will excite conservatives, further dividing the electorate in the state.",
    "The political sea-change happening in the Sunshine State owes to a perfect storm of circumstances  including shifting demographics and a poorly organized state Democratic Party.",
    "After Disney, the states largest private employer, criticized the bill, state Republican lawmakers and DeSantis moved to revoke the companys 55-year-old special tax district.",
    "During Obamas 2008 presidential campaign, Schale said he and his team sought to root? their candidate in the state while consistently showcasing the issues voters care about.",
    "A Morning Consult poll released late last month found DeSantiss approval hitting 56 percent, putting him in a strong position as he heads into his reelection bid this year.",
    "Between July 2020 and July 2021, the states population grew by more than 211,000, a net migration surpassing every other state, according to Census Bureau estimates.",
    "Now in his post-presidency, former President Trump has set up shop at his Mar-a-Lago estate in Palm Beach, drawing Republican candidates, donors and luminaries.",
    "Aubrey Jewett, a political science professor at the University of Central Florida, said that Floridas rightward shift is also due to longer-term changes.",
    "In March, he signed a law banning public school teachers from discussing sexual orientation and gender identity with students through the third grade.",
    "For one, the states Hispanic population has grown significantly over the years and Republicans have made steep inroads among many of those voters.",
    "Its all about the margins.And if we do all that theres no reason we cant win.?\nBut the problems dont just reside in Florida, Schale said.",
    "Trump carried the state by close to 3.5 percentage points, nearly tripling his 2016 margin of victory in the Sunshine State.",
    "The fundamental problem is that the Democratic Party brand is completely tainted in the state of Florida,? Amandi argued.",
    "If a caretaker abandons a property, they cant be shocked when the base of the house starts to rot from within,? he said.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Perhaps even more notable were his gains in Miami-Dade County, a Democratic stronghold and predominantly Hispanic area.",
    "Theres one word and its COVID,? said Nelson Diaz, a Republican lobbyist and former chair of the Miami-Dade County GOP.",
    "We ran more ads talking about our vision for taxes versus their vision for taxes more than any other issue.",
    "Meanwhile, DeSantis has put conservative grievances and culture war issues at the center of his agenda.",
    "Orlando and Jacksonville were among the 10 fastest-growing metropolitan areas between 2010 and 2020.",
    "At the same time, Floridas massive population of seniors and retirees has become more conservative.",
    "The results of the 2020 presidential election in Florida also reflected the GOPs growing strength.",
    "Many of Floridas new residents also appear to be coming from more Democratic-leaning states.",
    "But some also put a heavy emphasis on the pandemic, which they link to the population shift.",
    "Four years later, in 2020, President Biden carried it by just over 7 percentage points.",
    "There are definite challenges but those challenges arent unique to my state,? he said.",
    "In 2016, then-Democratic nominee Hillary Clinton won the county by nearly 30 points.",
    "Since then, Floridas political trajectory has only gotten more bleak for Democrats.",
    "Because its traditionally a place that had a low-cost living and a low tax base.",
    "And then you have DeSantis, who is Trumps protege or his biggest competitor.",
    "State Watch\nORLANDO, Fla.  Florida is starting to look like Trump country.",
    "Floridas importance to the modern GOP has only increased since then.",
    "You dont do that in three months before an election,? he said.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Florida is now the cradle for the MAGA movement.",
    "It made red states redder and blue states bluer.",
    "Floridas population growth has been staggering.",
    "Still, the numbers appear to favor Republicans.",
    "You can see the shift in numbers,? Schale said.",
    "Because why do people move to Florida?",
    "It gave people like [Florida Gov.]"
  ]
}