{
  "id": 3837,
  "mediaId": 1067,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "DeSantis should veto budget water turkeys | Commentary",
  "image": "https://www.orlandosentinel.com/resizer/1NAikImY22qolOoK9QCW0IgRrFE=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/PTVHVXJZ6JC45NZROS4AAOEZFM",
  "link": "https://www.orlandosentinel.com/opinion/guest-commentary/os-op-water-turkeys-budget-veto-20220509-6qzv5ewoezekflg7oecofennky-story.html",
  "sentiment": "0",
  "mediaOutlet": "Orlando Sentinel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Barile",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "There are also 130 general water infrastructure and resiliency project requests worth over $150 million that should be awarded either through the budgets $188 million Drinking Water Facility Construction program, the $35 million Small Government Water Infrastructure program, or the $25 million Rural Infrastructure fund.",
    "Each legislative session, the state budget is the only bill the Legislature is required to pass and the bill the governor must sign annually to fund the states schools, law enforcement, transportation, health care, state agencies and the variety of other services to support Floridians.",
    "To support the governors environmental agenda, the Legislature has also passed budgets to provide more support for Floridas environmental agencies and pass comprehensive water bills, such as the Clean Waterways Act, to improve water quality and reduce harmful algae blooms.",
    "This bill, sponsored by Sen. Debbie Mayfield (R-Indialantic) and signed into law by DeSantis in July 2020, created a special Wastewater Grant Program to help fix Floridas $16 billion wastewater infrastructure problem, a significant driver of Floridas water pollution woes.",
    "These grants are awarded by the FDEP to prioritize infrastructure improvements adjacent to Floridas impaired waters? that are subject to federal EPA and FDEP regulatory mandate to reduce pollution loads, restore seagrasses and ultimately save starving manatees.",
    "As DeSantis signs the budget into law, he should protect the interests of Floridians by resisting the Legislatures temptation to bypass the FDEPs executive branch agency authority, which is to responsibly referee the funding support of these water projects.",
    "Last year the Florida Department of Environmental Protection and DeSantis granted more than 100 local project awards worth over $400 million for wastewater infrastructure projects to upgrade wastewater treatment plants and retrofit polluting septic tanks.",
    "Further, FDEPs Resilient Florida program has successfully funded programs in coastal counties around the state to support and protect local infrastructure assets from sea level rise, flooding and other impacts associated with climate change.",
    "In Tampa and Sarasota Bay, seagrasses and shellfish recovered to 1950s levels following implementation of wastewater infrastructure projects, where improved water quality conditions supported marine life recovery.",
    "Lastly, there are expensive legislative budget requests for local waterway restoration projects that are not consistent with restoring ecosystems in FDEPs Basin Management Action Plans (BMAP).",
    "DeSantis and the Legislature have budgeted record funding to address Floridas water pollution problems, and reduce algal blooms, fish kills, manatee die-offs and collapsing ecosystems.",
    "However, with the passage of the state budget each year legislators propose special local projects that may not have followed statutory or legislative budget appropriation processes.",
    "There are also millions worth of member requests for shellfish and seagrass planting projects in waterways where water quality is so degraded that project failure is most likely.",
    "Alternatively, the FDEP should continue to fund its nutrient pollution load reduction projects that will create conditions where aquatic resource recovery will naturally occur.",
    "For example, Florida TaxWatch flagged a $25,000 Nygen Buggy Collection project to showcase 32 horse-drawn buggies in Seminole County as a budget turkey? that should be cut.",
    "Of these 243 water project requests, the 83 wastewater infrastructure projects worth $125 million should apply through the FDEPs Wastewater Grant Program.",
    "DeSantis and the Florida Legislature should be congratulated for prodigious support of water-related infrastructure projects in the 2022 budget.",
    "The health of Floridas waterways, including thousands of starving manatees, are dependent upon his prudent use of the veto pen.",
    "The FDEPs IRL BMAP states that muck dredging is neither cost effective nor time efficient? as a nutrient removal strategy.",
    "DeSantis has the prerogative to line-item veto such projects out of the budget with his pen before signing it into law.",
    "But this year, the Florida Legislature earmarked 243 water projects worth $368 million outside of the FDEP budget.",
    "For example, Brevard County has requested $12 million for muck dredging in canals near the Indian River Lagoon.",
    "According to Florida TaxWatch, these are part of over 1,200 budget turkey? projects worth nearly $3 billion.",
    "Dr. Peter Barile is an environmental scientist and the president of Marine Research & Consulting.",
    "Ron DeSantis has received a record $112 billion budget from the 2022 Florida Legislature.",
    "Each summer, local city and county governments may apply for these grants.",
    "He is based in Melbourne.",
    "Gov."
  ]
}