{
  "id": 3840,
  "mediaId": 43,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "From the GNR Newsroom: Its the Monday Good News Roundup OVERSTUFFED EDITION",
  "image": "https://images.dailykos.com/images/1042973/story_image/640field.jpg?1646020720",
  "link": "https://www.dailykos.com/story/2022/5/9/2096856/-From-the-GNR-Newsroom-Its-the-Monday-Good-News-Roundup-OVERSTUFFED-EDITION",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "No reason the same tactic can't be applied in this case; sure, some asshole in the governor's mansion wants to put women in jail for miscarriages, but city council passing an ordinance that stops the PD from pursuing abortion-related matters unless *there is literally no other crime they could investigate instead*, or the county commissioners ordering the county jails not to hold anyone for those charges, or the chancellors of the state college system deciding campus police cannot interfere with anyone distributing pamphlets about how to get medical care safely, will put major sticks in the governor's wheels.",
    "She might be jumping to conclusions, but theres no reason to think Fox News host Laura Ingraham is lying when she says shes mad about a naked attempt to try and change the outcome before the final decision is issued.? The GOP is haunted by the possibility that one of the courts conservatives could go squishy and change their mind at the last minute, much the way Chief Justice John Roberts did when he decided to uphold the Affordable Care Acts individual mandate after initially voting to strike it down.",
    "A federal ban on abortions is unpopular in all 50 states\nAs reproductive rights and abortion access again face significant challenge from the politicized and asymmetrical Supreme Court  who today rejected to block the enforcement of the Texas bounty? abortion law  new analysis finds there is not a single state in the nation where support for a federal ban on abortion has more than 30% support among the public.",
    "New poll reveals warning signs for GOP on abortion ahead of midterms\nYet a new Yahoo News/YouGov poll, one of the first to be conducted entirely after the leak of Justice Samuel Alitos controversial draft opinion, suggests that Republicans risk overplaying their hand on abortion ahead of the 2022 midterms  and that Democrats could benefit if the hot-button issue is on the ballot.",
    "When I feel its tug, I ask myself, What would Thich Nhat Hanh do??\nDuring talks for my book, Beyond Contempt: How Liberals Can Communicate Across the Great Divide,? I sometimes joked that peace activist Thich Nhat Hanh managed to say in seven words what took me 57,000: Speak the truth but not to punish.?\nNhat Hanh died in January.",
    "In the eyes of Republicans, though, theres still a chance theyll somehow lose the game with only seconds left on the clock (and, to maybe overextend the metaphor, if they do lose itll be because the refs didnt call an obvious offensive pass interference penalty on their opponent; the refs in this case being the media).",
    "The survey of 1,577 U.S. adults, which was conducted from May 3 to May 6, found that registered voters initially preferred a generic Democrat (44%) over a generic Republican (39%) by 5 percentage points when asked how they would vote in their district if the congressional election were being held today.",
    "Ukraine is killing Russian generals with help of US intelligence\nThe United States has provided intelligence about Russian units that has allowed Ukrainians to target and kill many of the Russian generals who have died in action in the Ukraine war, according to senior American officials.",
    "Thanks to this pressure, BlackRock and the two other largest top managers of retirement funds, Vanguard and State Street, have pledged to use their voting power in corporate governance to support a transition to a net-zero-emissions economy over time with the investments they manage.",
    "These sources seemed to be an indispensable context for Farmers writing, first because he referenced them frequently, but later because my increasing exposure to Catholic social thought allowed me to read between the lines of Farmers work and see a deeper meaning in his project.",
    "A diverse array of facilities now use electric heat pumps to warm rooms and water supplies, including a renovated K8 school in West Seattle, a community center for the Skokomish Indian Tribe, a youth theater in Bellevue and Microsofts corporate campus kitchen in Redmond.",
    "Genuine nerves might help explain why one conservative politician after another has urged the court to stay strong? and not be swayed.?\nTo Democrats, Republicans look like an NFL team complaining about a meaningless penalty call while theyre about to win the Super Bowl.",
    "Larger solar plant in US acquires 1.3 billion in financing\nThis week, Primergy Solar, a subsidiary of investment manager Quinbrook Infrastructure Partners, announced that it has secured financing for its long-planned 690-megawatt (AC) Gemini solar-plus-storage project.",
    "How activists can fight through doom and gloom to be more effective\nOne of the most frequent questions I get from Sunrise Movement members and other young activists is: How do you keep going considering all the tough situations youve been through??\nIts a good question.",
    "In order to transcend Trumpism we must tend to suffering, not celebrate it\nThe allure of piling on against the villain du jour  be it Americans wearing MAGA hats, anti-vaxxers or Russians whose government is perpetrating war crimes against Ukrainians  is seductive.",
    "The companies in red states will help employees bypass abortion bans\n Millions of women in more than 25 states face an abortion ban if the Supreme Court overturns Roe v. Wade, the landmark 1973 decision that legalized the procedure nationwide.",
    "Rare indeed is the legal victory  in court or legislature  that is not a careful by-product of an emerging social consensus.?\nA theory going around is that the leak was intentional in order to keep the other Justices from going back on that.",
    "During the Trump years, ICE actually deported fewer immigrants than during the Obama years, because Trump was so repulsive, many local city councillors and mayors earned approval by barring their police departments from working with ICE.",
    "He used the resources of the Catholic tradition to understand human suffering, to rebuke the principalities and powers that maintain the sorrows of the poor, and to nurture the fierce hopefulness for which he was so well known.",
    "This followed a letter last year sent by a dozen Republican state treasurers threatening to pull funds from banks that had made commitments in line with the Paris climate accord to stop financing new fossil fuel investments.",
    "Organizing and mobilizing voters ages 18-35, Mississippi Votes is committed to engaging communities through a holistic approachone that seeks to partner directly with impacted communities, instead of talking at them.",
    "In order to understand his books and grasp the full power of his moral vision, I discovered I would need to study not only ethnography, infectious-disease ecology, and systems design, but also the gospels.",
    "He coined the term engaged Buddhism? to describe peace and social justice activism undertaken in alignment with Buddhist principles of nonviolence, kindness, generosity, social harmony and open-mindedness.",
    "The surprise move handed a last-minute reprieve to solar industry groups and supporters who feared the utility-backed legislation would have undermined the economics of rooftop solar systems in the state.",
    "Washington State requires new buildings to have heat pumps\nDozens of all-electric buildings are sprouting up across Washington state as more developers ditch gas-fired systems in a bid to curb pollution.",
    "Cascadia and the end of Roe\nGiven these developments, Cascadias standing as a pro-choice stronghold is more important than ever for people wishing to choose whether, when, and how they have children.",
    "Some conservatives have to be worried about a scenario in which public anger helps the chief justice pick off one more conservative ally, and forces the court to write a more moderate decision.",
    "Led by Arekia Bennett, Mississippi Votes builds on the legacy of organizers like Fannie Lou Hamer and Ella Baker, and the young SNCC organizers who organized for voting rights in the region.",
    "All you need to know about the Alaska special election\nAlaskas special election is special indeed: The winner will temporarily fill the US House seat of the late Representative Don Young.",
    "It is some comfort, then, that even as the area must gird itself to serve more patients, six key facts and trends will reduce the impact of the US Supreme Courts whims with regard to Roe.",
    "The same system will apply to the regular election later this year, when Alaskans will decide races for legislature, governor, US Senate, and the full two-year term for the House seat.",
    "Located in southern Nevada, the project is set to be the largest continuous solar installation in the United States  and one of the largest in the world  when its completed in 2023.",
    "This was confirmed by none other than Justice Sandra Day OConnor, who wrote that real change, when it comes, stems principally from attitudinal shifts in the population at large.",
    "Washingtons Building Code Council voted 113 late last week to restrict the use of gas in new office complexes, apartment towers and other large facilities starting in July 2023.",
    "If that is the case they made a grave mistake, because were gonna go hard against this and make sure they know were angry about this, and hopefully that will make a difference.",
    "The companys announcement echoes similar moves by Citigroup, Yelp, Uber and Lyft to help employees bypass Republican-led efforts in several states to effectively ban abortion.",
    "Actually there are reasons for Republicans to be mad about the leak\nFirst, Im sure that some Republicans are genuinely concerned that this could ruin their impending victory.",
    "He was not just a good Catholic who also happened to be a very good doctor, nor was he simply motivated by his faith to produce compelling secular ideas for a secular milieu.",
    "Nhat Hanh (or Thay,? pronounced tie, as he was known) was a Buddhist monk whose opposition to the Vietnam War earned him a Nobel Prize nomination from Martin Luther King Jr.",
    "So as it turns out, Ukraine has been so successful in killing off the leaders of the Russian military because we have been kind enough to point them in the right direction.",
    "My only explanation for this is DeSantis realized how badly he fucked up picking a fight with Disney and hes trying to mitigate any further damage ahead of the election.",
    "Welcome back to the Monday Good News Roundup where our intrepid GNR Newsroom (Killer300 and Bhu) head out to get you the good stories to get your week started off right.",
    "SCOTUS overturning Roe means the decision goes to the states, and many states already have bans on abortion, but enforcement will often be down to local authorities.",
    "Statements by BlackRock leadership that climate change is a long-term threat, and that the company will pursue investments that promote a reduction in emissions.",
    "Activists are working to de carbonize pensions\nRepublican state leaders are on the warpath against BlackRock, the largest financial asset manager in the nation.",
    "The company told staff it would pay up to $4,000 in travel expenses annually for medical treatments including abortions, according to a message seen by Reuters.",
    "Millennials and Gen Z fighting Jim Crow in Mississippi\nMississippi is one of the Blackest states in the nation with some of the most anti-Democratic policies.",
    "While the state may not have the same national political profile as nearby Georgia, the fight for increased political power and equity is just as important.",
    "On Earth Day, I risked arrest again  this time at age 84, even while storm clouds gather in my country that for some observers suggest a possible civil war.",
    "Glanvilles win, combined with Jeff Peppers special election win in the solidly blue 15th district, gives the Democrats 53 House seats  the most since 2010.",
    "I would also need to understand the emergence of liberation theology as a countercultural movement within the wider tradition of Catholic social teaching.",
    "I dont think they are bad people, not all of them, I think they are people who have been lied to and manipulated, and who maybe mean well but got misled.",
    "Soon, new commercial buildings in the state will have to use heat pumps for space heating in most cases, following a key vote by an obscure state body.",
    "In issuing the veto, DeSantis cited the bills potential to raise costs on Florida residents in the midst of increasing prices for food and gasoline.",
    "Before we continue with more articles, this is a quote from Khoral_IV, a poster on the rpg.net forum that myself, Killer300 and Bhu congregate on.",
    "***\nIn reality, though, the reason red states are scrambling to pass such legislation and make these threats is because they are losing the fight.",
    "The state of Florida should not contribute to the financial crunch that our citizens are experiencing,? he wrote in a four-paragraph veto letter.",
    "Desantis surprises all by vetoing Solar metering bill\nFlorida Governor Ron DeSantis (R) vetoed an unpopular solar net-metering bill on Wednesday.",
    "The district includes the cities of Cedar Springs, Grandville, Rockford, and Walker (where Glanville is a city commissioner), plus six townships.",
    "I mean, Amazon isnt exactly my favorite company in the world, but even they see how crummy this SCOTUS decision is and are vowing to fight back.",
    "Roberts did not sign on to the leaked draft opinion, and CNN reports that he wants to allow a 15-week abortion ban without junking Roe entirely.",
    "Protests can influence the Supreme Court\nYet, while the institution itself is undemocratic, it is not immune to public opinion and mass protest.",
    "Over my seven decades of activism, Ive found three ways activists can generate the kind of staying power thats needed for long-term success.",
    "Farmers writing is often personal, describing the world as he saw it and walking readers through his own surprises, setbacks, and delights.",
    "Zeem activated its first six direct-current fast chargers this week and can support 65 vehicles per day rotating through for a full charge.",
    "Electric truck leasing is live in LA\nThe commercial backstreets surrounding LAX, the worlds third-busiest airport, host many a truck yard.",
    "And hoo boy, last week was a pretty rough one, with the SCOTUS and GOP pretty much going all in on trying to destroy reproductive rights.",
    "Dems win huge upset in Michigan\nThe previous Republican incumbent, now-Sen. Mark Huizenga, won his three races with over 60% of the vote.",
    "I know a lot of people are worried about November, and I am among them, but there is evidence pointing to the fact that we can win this.",
    "Hey Putin, I imagine about now youre probably kicking yourself for messing with out elections and subjecting us to four years of Trump.",
    "Ukrainian officials said they have killed approximately 12 generals on the front lines, a number that has astonished military analysts.",
    "Years ago, as I began to make my way through his books and scholarly articles, I discovered that his writing is unambiguously Catholic.",
    "The top four voter-getters will then advance to the general election ballot, where voters can rank them from most- to least-favorite.",
    "I hope this good news made you all feel better about the coming weeks, and hopefully we can make more good news happen along the way.",
    "Look, I live in New York, but I live in a really red section of my state, and I see way more pro Trump stickers than I do Pro Dems.",
    "Its nice to know that even though this man is gone, his teachings will continue to inspire and help people in troubled times.",
    "And it comes just hours after a bombshell report by Politico indicated the Supreme Court is prepared to overturn Roe v. Wade.",
    "The electric trucks all belong to Zeem, which plans to lease them to businesses that operate small and midsized fleets.",
    "It is easy to forget that ordinary people, working together through social movements, have agency to impact the court.",
    "Meanwhile, the mass media report numerous studies of rising anxiety and depression, especially among younger people.",
    "In March, the Arkansas State Treasurer March withdrew $125 million from money market accounts managed by BlackRock.",
    "An Antidote for Despair\nFarmers scholarly writing spans several decades and a few different academic disciplines.",
    "Texas passed legislation in February prohibiting any firm divesting from fossil fuels from managing state assets.",
    "The special election gives Alaska voters a chance to test-drive their new approach to picking political leaders.",
    "Time and again, history has shown that the Supreme Court does, in fact, respond to the court of public opinion.",
    "For many of those women, employers benefit packages may be the only way they can soon afford a legal abortion.",
    "Fossil fuel firms are facing disinvestment campaigns all over the country mounted by grassroots activists.",
    "In January, West Virginia declared that it was barring the company from managing its state pension funds.",
    "Signal boost on this one, if you live out in Alaska, then do your part to help turn those seats blue.",
    "But only one of these sites is full of heavy-duty vehicles that move silently and without emissions.",
    "The stakes are just as high in Mississippi as anywhere in the Southespecially among younger voters.",
    "But at the same time I feel like this is legit the thing thats gonna sink the GOP in the midterms.",
    "If we can win and win big, we might even be able to save Roe vs. Wade if we can expand the court.",
    "A new voting system of open primaries and ranked choice general elections will make its debut.",
    "Well you know what they say, the devil works hard but the Good News Roundup works even harder.",
    "The more left leaning politicians we have, the harder it will be to enforce these awful laws.",
    "How can we access the positive energy that enables us to keep going through doom and gloom?",
    "Amazon became the latest corporation to cover employees travel costs to seek abortion care.",
    "Mississippi also has a rich tradition of organizing for equal participation in Democracy.",
    "And each of these authorities is elected with less than 1% of the votes a governor gets.",
    "It seems like banning abortions is not the slam dunk the GOP seems to think it will be.",
    "Its a rallying call to vote blue no matter who, in every election and every office.",
    "Were gonna have a lot of protests, and its gonna get rougher before it gets better.",
    "And in the special primary, Alaska will hold its first statewide mail-in election.",
    "An Amazon spokesperson confirmed the nature of the Reuters report to CNN Business.",
    "And this week we got a GNR thats filled to capacity with all manner of good news.",
    "x\nx\nx\nYeah, this guy is amazing, and here he is taking the piss out of Fox News.",
    "There are many, many state and local authorities with a broad range of powers.",
    "Not to say there arent some serious assholes in the bunch dont get me wrong.",
    "Even if we lose Roe, were gonna keep fighting, and protecting one another.",
    "This is important stuff to keep in mind, especially in the upcoming days.",
    "In the primary election, all candidates will appear on a single ballot.",
    "The GOPs frustration over the leak belies their lack of confidence.",
    "Some of his books and articles are more approachable than others.",
    "That being said its still good news for solar power in Florida.",
    "Ive said it before and Ill say it again, the kids are alright.",
    "Lets make electric vehicles more readily available to all.",
    "Good on Blackrock for standing up against climate change.",
    "New apartments and theyre being made cleaner than before.",
    "I dont have it in me to hate every one of these people.",
    "Focusing on Representatives and Senators is a mistake.",
    "Yeah I know, 2020 was a harsh lesson to ignore polls.",
    "Thats so much good news I can barely carry it all.",
    "These buildings wont be novelties for much longer.",
    "So without further ado, lets get right on to it.",
    "His wisdom lives on, but its on life support.",
    "Donald Trump got 57% in the district in 2020.",
    "So Last week was the absolute pits wasnt it?",
    "So lets keep kicking ass and taking names.",
    "It was a pretty bad scene all around.",
    "We can beat them, and they know it.",
    "Great news for alternative energy.",
    "Thats it for our overstuffed GNR.",
    "This is the key part, for me.",
    "Im gonna go off to bed.",
    "Real food for thought.",
    "Were not going back.",
    "PAYBACK TIME POOTIE.",
    "The companys sin?",
    "And woo!",
    "."
  ]
}