{
  "id": 3841,
  "mediaId": 98,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Column: Is Gavin Newsom running for president? No, it just sounds like it",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/1a7369f/2147483647/strip/true/crop/3500x2409+0+0/resize/840x578!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe0%2Fa2%2F3c89cb614ef180330d2a73d16164%2Fsupreme-court-abortion-newsom-48167.jpg",
  "link": "https://www.latimes.com/politics/story/2022-05-09/gavin-newsom-roe-v-wade-white-house-biden-kamala-harris",
  "sentiment": "0.0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "It was the type of angry, impassioned speech that might launch an upstart presidential campaign and couldnt help but contrast with the wan performance of Biden, whose response to the high court was a quick pivot into a legalistic discussion of the right to privacy established by the Roe decision.",
    "Democrat Jerry Brown and Republican Pete Wilson both ran for president while governor and each came up far short, illustrating the difficulty of running the state while trying to navigate the cross-country steeplechase of nominating contests.",
    "Despite a sometimes fraught relationship with Harris  who shares much of the same political and donor base from their days in San Francisco  Newsom also has no plans to take her on if she seeks the White House in 2024.",
    "In the meantime, associates say, the governor is eager to carve a larger role for himself on the national stage, befitting the overseer of the worlds fifth-largest economy and head of the countrys most populous state.",
    "After the leak of a draft Supreme Court decision portending the imminent demise of Roe vs. Wade  and the end of legal abortion as the country knows it  Californias governor delivered a blistering indictment.",
    "Greg Abbott of Texas over mask mandates and the states near-ban on abortion, and sparred with DeSantis over Floridas punitive treatment of Disney for opposing legislation critics call the Dont Say Gay? law.",
    "For some Democrats, it was a welcome tonic for the sluggishness that seems to have beset their party amid untamed inflation, futility on Capitol Hill and impotence against the reversal of abortion rights.",
    "What more do you need than this [Supreme Court] decision to wake us up and start asserting ourselves more aggressively?? Newsom demanded as he stood in front of Planned Parenthood, coiled in anger.",
    "And Democratic Party: nominate Newsom!?\nThere are, of course, any number of obstacles to the governor running for president, not least his hopes of winning a second term in Sacramento in November.",
    "Those around Newsom say he has never openly hankered after the White House, and he has apparently never had any sort of in-depth discussion with his political team about running for president.",
    "(Michael R. Blood / Associated Press)\nGavin Newsom sounds like a man ready to jump on the next flight to Iowa or New Hampshire or wherever Democrats start their 2024 presidential campaign.",
    "By loudly and brashly confronting his own party, Newsom presented himself as someone Democrats need to reckon with, even if a presidential campaign isnt in the immediate offing.",
    "But the speculation cant be helped; the office of California governor has the magical power of instantly transforming each and every occupant into a presidential prospect.",
    "I have no idea why anybody would make that statement unless they were unaware of the fight that has been going on,? the San Francisco Democrat responded Sunday on CBS.)",
    "... Wheres the counteroffensive??\nNewsom also had a few scathing things to say about some of the folks Democrats love to hate, including Floridas Republican Gov.",
    "Literally 100% never been on my radar,? Newsom said in the afterglow of beating last years recall attempt, when the inevitable presidential talk bubbled up.",
    "Why arent we standing up more firmly, more resolutely?? he barked into a bouquet of microphones outside Planned Parenthoods Los Angeles headquarters.",
    "(Those around Newsom who agreed to talk about his political future wished not to be identified because the governor frowns on such discussion.)",
    "I cant take any more Manchins,? Newsom said of the center-right Democrat who has helped stymie much of President Bidens legislative agenda.",
    "Woe unto any politician  even one seemingly as well-positioned as Newsom  who seems to be taking voters and reelection for granted.",
    "Given the fighting mood of the Democratic base, Newsom could be well placed to help lead the party in a post-Biden era.",
    "Should the president opt against a second term, Vice President Kamala Harris would be the front-runner to replace him.",
    "The Democrat in the White House may run again in two years and Newsom has no intention of challenging Biden.",
    "For all of that, Newsom may very well believe that he could, and maybe should, be president someday.",
    "Ron DeSantis, Fox News fire starter Tucker Carlson and West Virginia Sen. Joe Manchin III.",
    "Thanks for your service  but please retire in 2024, Joe Biden!? tweeted one enthusiast.",
    "Thats not to say the governor doesnt harbor national ambitions, but there are limits.",
    "Especially if Democrats lose the White House and the party is looking to rebuild.",
    "Naturally, there was chatter about Newsoms possible designs on the White House.",
    "He is surely mindful, like those surrounding him, of California history.",
    "The tongue-lashing Newsom delivered last week was different.",
    "Publicly, he insists nothing could be further from his mind.",
    "(House Speaker Nancy Pelosi, for one, was not pleased.",
    "Both are potential 2024 presidential candidates.",
    "Newsom has already taken on Republican Gov.",
    "Why arent we calling this out.",
    "But at age 54, he can wait.",
    "Of his own party."
  ]
}