{
  "id": 3846,
  "mediaId": 188,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Horowitz: Tennessee governor opposes bill making murderers serve full sentences",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTc3NjU3My9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY3NjczNjA2N30.-eHokYuTXZTAmTMMGnDB4kboHLd2dJAnAc64Y17wekw/img.jpg?width=1245&quality=85&coordinates=0%2C0%2C0%2C146&height=700",
  "link": "https://www.theblaze.com/op-ed/horowitz-tennessee-governor-opposes-bill-making-murderers-serve-full-sentences",
  "sentiment": "0.0",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Daniel Horowitz",
  "authorUrl": "https://www.theblaze.com/u/danielhorowitz",
  "termIds": [
    661
  ],
  "sentences": [
    "A recent Fox News poll asked respondents which policy they thought would decrease gun violent more  tighter restrictions on people buying guns? or tougher penalties for people who commit crimes with guns.? By a margin of 54%-33%, respondents chose tougher penalties.",
    "But GOP elites, controlled by the Koch-funded NGOs and big business interests, are so myopic in their thinking and divorced from reality that they continue to push the spirit of the age? policies supported by the corporate elites until the gates of hell.",
    "For years, Republicans supported the Soros de-incarceration agenda by propagating the lie that the prisons are full of first-time, nonviolent, low-level offenders? and that these compassionate politicians were merely pursuing leniencies for those people.",
    "Then, your own legislature passes a truth-in-sentencing bill, HB2656 / SB2248, to ensure that those found guilty of crimes like murder, robbery, aggravated kidnapping, aggravated burglary, or carjacking serve their full sentence.",
    "Its hard to suggest that the record increase in homicides and carjackings in 2020 and 2021  and still coasting in 2022  is not the result of the criminals being on the streets instead of behind bars.",
    "One of the most remarkable dynamics in American politics is that the majority of Republican governors are more pro-criminal than most average Democrat voters and even some local Democrat politicians.",
    "Lee stated in his letter to the Senate and House leaders that he believes the more you lock up violent criminals, the more crime there is; the less you lock them up, the more crime goes down.",
    "Clearly, criminals are not being deterred, and if you cant support something as simple as this bill exclusively targeting the most violent criminals, that reflects a pro-criminal sensibility.",
    "Well, now Bill Lee is revealing the extent of the criminal justice reform fraud by opposing a bill exclusively targeting the most dangerous criminals without even expanding their sentences.",
    "Imagine being a governor of a deep red state like Tennessee during a time when radical leftists are promoting anarchy and de-incarceration, fueling the worst crime wave in a generation.",
    "It defies logic to suggest that the unprecedented reduction in the prison population did not contribute to the unparalleled annual increase in homicide in 2020 and 2021.",
    "As we all understood at the time, the prison population mainly consists of career criminals with long raps sheets, many of whom often plead down from even worse crimes.",
    "The Democrat mayor from the biggest city in the state, which is plagued by growing violence, supports the bill, along with other sheriffs and local law enforcement.",
    "Until the crime wave hits the neighborhoods of those running government, big business, and culture, the attitude of most governors will reflect that selfish myopia.",
    "His views perfectly capture the spirit of the age of the far left, where everything, including basic biology, morality, and common sense, is perfectly inverted.",
    "Thus, if your goal was to lower the prison population at all costs (rather than fighting crime), then you would inevitably have to release violent criminals.",
    "Yet anti-incarceration advocates artfully cut funding for incarceration so that they can present the public with a false choice of overcrowding or jailbreak.",
    "The number of people who, at a minimum, support tougher penalties on violent criminals regardless of their views on guns is undoubtedly much higher.",
    "As for his contention that prisons cost too much money, its like saying that waiting to make a left turn at a busy intersection costs too much time.",
    "And this is something of a different question, because its specifically targeting gun violence and offering intuitive gun control as an option.",
    "The percentage of the American population in the U.S corrections system (combined federal and state) is lower than at any time since 1992.",
    "The vote is 20-6 in the Senate and House 86-9 in the House, with numerous inner-city Democrats joining every single Republican in support.",
    "Crime plummeted, and eventually homicide dropped by 70%, saving tens of thousands of people, particularly black victims of gang murder.",
    "The number of persons sentenced to more than one year in state or federal prison decreased from 1,379,800 in 2019 to 1,182,200 in 2020.",
    "According to the Bureau of Justice Statistics, the combined state and federal prison incarceration rate has shrunk by 28% since 2010.",
    "State and federal correctional authorities held 352 persons age 17 or younger at years end in 2020, a 46% decline from 2019.",
    "Just as in other states, the incarcerated population, according to BJS, dropped by 14% from 2019 to 2020 during the COVID.",
    "The COVID jailbreak was the perfect case study in the science? of de-incarceration, and it failed spectacularly.",
    "There is no question that the plummeting incarcerated population has a lot to do with the massive crime wave.",
    "That is a mere glimpse into the heart and mind of nearly every GOP governor aside from Governor Ron DeSantis.",
    "Yet rather than taking yes for an answer and unwrapping it, he announced his public opposition to the bill.",
    "We increase construction of infrastructure and funding for every service with the growth of the population.",
    "And those numbers have precipitously dropped due to COVID, perfectly coinciding with a massive crime wave.",
    "Why is it that elites in both parties are exclusively focused on criminal justice and not victim justice?",
    "However, it is quite evident that had the bill passed without super-majorities, he would have vetoed it.",
    "The governors own Task Force on Sentencing and Recidivism recommended a truth-in-sentencing bill.",
    "It will nonetheless become law, because he is merely declining to sign it but will not veto it.",
    "You see, at some point, crime could get bad enough that even Democrat voters will beg for help.",
    "Since we reversed that trend of incarceration, we have reversed the trend of reduced crime.",
    "The drop in incarceration was particularly steep among those sentenced for serious crimes.",
    "In what can only be described as the transgender equivalent of crime policy logic, Gov.",
    "Well, that is the gift package that was placed on Tennessee Governor Bill Lees desk.",
    "Throughout the 1990s and early 2000s, we began locking up more criminals.",
    "Some just do a better job hiding their leftist views than others.",
    "There is your juvenile crime wave right there.",
    "Bill Lee was a signatory to that report.",
    "Some things must be done."
  ]
}