{
  "id": 3850,
  "mediaId": 19,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Dont Say Gay? Disney CEO Bob Chapek Avoids FL Anti-Grooming Law Controversy in Commencement Speech",
  "image": "https://media.breitbart.com/media/2022/05/bobchapekspeech1-640x480.jpg",
  "link": "https://www.breitbart.com/entertainment/2022/05/09/dont-say-gay-disney-ceo-bob-chapek-avoids-fl-anti-grooming-law-controversy-in-commencement-speech/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alana Mastrangelo",
  "authorUrl": "https://www.breitbart.com/author/alana-mastrangelo/",
  "termIds": [
    661
  ],
  "sentences": [
    "In a March 28 statement, Disney said Our goal as a company is for this law to be repealed by the legislature or struck down in the courts.?\nStatement from The Walt Disney Company on signing of Florida legislation: pic.twitter.com/UVI7Ko3aKS\n Walt Disney Company (@WaltDisneyCo) March 28, 2022\nMeanwhile, Disney stock is tanking, making The Walt Disney Co. the worst performing stock in the Dow Jones Industrial Average for the past year, while a flood of families cancel their Disney memberships  from amusement parks to Disney+ streaming  over the companys leftist, LGBTQIA+ agenda.",
    "Chapek also noted that people feel the way they do about Disney because of the stories that we tell.?\nElsewhere in his speech, Chapek botched the Disney World motto, referring to the theme park as the happiest place on earth,? rather than the most magical place on earth.?\nIf you dont think taking the high road means letting go of your beliefs or principles, dont think that, because you havent let them go, youve just chosen to seek common ground above the fray,? Chapek told the Indiana University graduates.",
    "Moreover, a few weeks ago, Florida Governor Ron DeSantis (R) signed a law that eliminates a statute that has for decades allowed the entertainment giant to act as a local government in Orlando, making it so that taxpayers are no longer burdened with funding Disneys public services.",
    "Chapek spoke at his alma mater for over 13 minutes but did not once mention the word gay? or Florida? or Disneys political war with the taxpayers of Florida, and the states Parental Rights in Education law.",
    "Watch Below:\nInstead, Chapek insisted that for many people, Disney represents some of that common ground that brings us all together, and its one of the reasons Im so proud to lead this find company.",
    "Disney CEO Bob Chapek made no mention of the California-based companys vow to fight Floridas anti-grooming law during his commencement speech at Indiana University Bloomington over the weekend.",
    "And we believe in a welcoming spirit.?\nAnd when guests walk through our gates, the points of division just seem to evaporate away,? the Disney CEO insisted.",
    "Maybe theyll understand you, maybe youll understand them, maybe nobodys mind ever changes, but youll come together in some way,? the Disney CEO added.",
    "We believe in acceptance."
  ]
}