{
  "id": 3852,
  "mediaId": 18,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "How can Jags Khan be surprised Urban Meyer was Urban Liar? | Commentary",
  "image": "https://www.bostonherald.com/wp-content/uploads/2022/05/202205051513TMS_____MNGTRPUB_SPORTS-HOW-CAN-JAGS-KHAN-BE-SURPRISED-3-OS5-1.jpg?w=1024&h=794",
  "link": "https://www.bostonherald.com/2022/05/08/how-can-jags-khan-be-surprised-urban-meyer-was-urban-liar-commentary-2/",
  "sentiment": "0.0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tribune News Service",
  "authorUrl": "https://www.bostonherald.com/author/tribune-news-service/",
  "termIds": [
    661
  ],
  "sentences": [
    "\nJon Wilner of the San Jose Mercury News on Georgias DC moving west to Oregon: Dan Lannings former defense had more first-round picks than Dan Lannings new conference.?  National college football insider Brett McMurphy of Action Network was on our radio show Wednesday and he said his sources tell him that not only will UCF, Houston and Cincinnati be in the Big 12 by 2023, but Texas and Oklahoma will still be in the league as well and likely wont make the move to the SEC until 2025.",
    " Charles Barkley on fellow TNT host Shaquille ONeals weight: If he gets on the scale, its gonna be saying, One person at a time, please. \"  According to a new survey by LEAD1, 90% of FBS athletics directors are concerned that NIL deals are being used as recruiting tools.",
    "Its not possible.?\nKhan went on to compare Meyers character (or lack thereof) to his two previous coaches  Gus Bradley (14-48 record in Jacksonville) and Doug Marrone (25-44)  and claimed Meyers dishonesty is why he got fired with a 2-11 record in his inaugural season.",
    "How did you not know that Mike Freeman, a former columnist at the Florida Times-Union (in Jacksonville, no less), came up with the nickname Urban Liar? 17 years ago when Meyer was coaching the Florida Gators  and hes been living up to the moniker ever since?",
    "\nShort stuff: Somebody asked me yesterday about Roe vs. Wade and I said, Hey, Id much rather be in a boat.?  I saw where Disney fired its public relations director after only 3 months on the job because of the companys disastrous conflict with Gov.",
    "\nI love Doc Rivers, but the Philadelphia 76ers coach didnt make much sense a few days ago when he insisted he wasnt second-guessing himself about having MVP candidate Joel Embiid on the court late in a close-out Game 6 victory against Toronto.",
    "When it turns out to not be the truth, that doesnt put him very high on my Christmas-card list.?\nOne last question for you, Mr. Khan:\nIf you fired Urban Meyer for lying instead of losing, then why did you hire him in the first place?",
    "Sounds like Boris had quite a racket going.?  I got invited to play in the Orlando Magic Youth Foundation charity golf tournament last week, and while my golf was typically bad, the cause was incredibly good.",
    "\nDwight Perry of the Seattle Times: Tennis great Boris Becker was sentenced to 2 years in an English prison for illicitly transferring large amounts of money and hiding assets after he was declared bankrupt.",
    " Speaking of NIL, did you see where the NIL agent for University of Miami basketball star Isaiah Wong said his client would enter the transfer portal if his NIL compensation wasnt increased?",
    "Isnt it funny how NBA coaches will sit out players for entire games in the name of load management, but Doc didnt load-manage Embiid in the final four minutes of a playoff blowout?",
    "Case in point: Shad Khan, the billionaire owner of the Jacksonville Jaguars, told USA Today earlier this week that he didnt fire Urban Meyer for losing; he fired him for lying.",
    "As Arnold Palmer himself once said, Making a positive change in the life of a child is one of the most significant things you can do.? Hey, whatever happened to James Harden?",
    "How long will it be before the stud college quarterback  two days before the big game  threatens to enter the transfer portal unless the boosters renegotiate his NIL deal?",
    "Kudos to OMYF for raising more than $150,000 for at-risk youth in Central Florida during the tournament and for donating $1 million to 17 area kids charities last month.",
    "But when Meyer stepped down at UF and told Youngblood he was done with college coaching only to accept the job at Ohio State a few months later, Youngblood was livid.",
    "How did you not know he was suspended at Ohio State for misrepresenting his knowledge? of domestic violence accusations against former assistant coach Zach Smith?",
    "Running off at the typewriter \nSometimes it amazes me how sports owners can be brilliant in the world of business but not so sharp in other areas.",
    "Hit me up on Twitter @BianchiWrites and listen to my Open Mike radio show every weekday from 6 to 9:30 a.m. on FM 96.9, AM 740 and HD 101.1-2\n()",
    "How did you not know about UF football legend and Pro Football Hall-of-Famer Jack Youngblood, who once considered Meyer a close friend?",
    "When you lose the respect, the trust and an issue of truthfulness, how can you work with someone like that?? Khan told USA Today.",
    "\nLast word: Headline from TheOnion.com: Ben Simmons tells Nets hes ready to play now.?\nEmail me at mbianchi@orlandosentinel.com.",
    "In related news, Gators quarterback Anthony Richardson showed up at workouts the other day wearing Tim Tebows old halo.",
    "Said Doc: Everyone was in there, and the other team had all their guys in, too.? Come on, Doc, thats just crazy talk.",
    " Did you see where Kim Kardashian showed up at the Met Gala earlier this week wearing Marilyn Monroes old dress.",
    "Embiid ended up suffering a right facial fracture with 3:58 left and the 76ers leading the Raptors by 29.",
    "How cool would it be if UCF is in the same league as Texas and OU  even if it is only for a year or two?",
    "When somebody tells me something to my face, I expect it to be the truth,? Youngblood said then.",
    "I think when you know someone is not truthful, how can you be around someone, OK?? Khan said.",
    "I want to know who the 10 percent are who think NIL is NOT being used as a recruiting tool?",
    "The other team was down by 29 and their season was coming to an unceremonious end.",
    "Thats like an NFL general manager blaming the equipment guy for a bad draft pick.",
    "How did you not know Urban Meyers reputation for having an aversion to the truth?",
    "Are their names Nick Naive, Oliver Oblivious, Dick Dunderhead and Billy Buffoon?",
    "Thats why they got the time because it wasnt a matter about respect or truth.",
    "You dont get paid $8 million a year to do what everybody else does.",
    "I have nothing but the utmost respect and friendship with them.",
    "Your team was getting ready to advance to play the No.",
    "1-seeded Miami Heat and now must do so without Embiid.",
    "It was a matter of wins and losses over four years.",
    "Have you been asleep for the last 15-plus years?",
    "This is much bigger than that.?\nEarth to Khan.",
    "You know its going to happen eventually.",
    "We had Doug Marrone here four years.",
    "We had Gus Bradley here four years.",
    "Earth to Khan.",
    "Ron DeSantis.",
    "Nonsensical.",
    "Seriously?",
    "Really?"
  ]
}