{
  "id": 3853,
  "mediaId": 675,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "Will top companies follow Disney's disaster and take stance on politics?",
  "image": "https://www.wnd.com/wp-content/uploads/2021/04/coca-cola-diet-coke-cherry-bottles-soda-food-drinks-sugary-jk.jpeg",
  "link": "https://www.wnd.com/2022/05/top-companies-silent-abortion-disneys-disastrous-tangle-desantis/",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    661,
    524,
    539,
    3324,
    3403,
    2661
  ],
  "sentences": [
    "TRENDING: 77 years later, U.S. soldiers replace woman's birthday cake they took during WWII\nStatement from The Walt Disney Company on signing of Florida legislation: pic.twitter.com/UVI7Ko3aKS\n Walt Disney Company (@WaltDisneyCo) March 28, 2022\nCNBC and Fortune contacted dozens of the largest corporations in the U.S., but few of them gave any comments about the landmark case.",
    "Following the leak of a draft opinion indicating the Supreme Court is likely to overturn Roe v. Wade, Democrats are trying to ram through a bill legalizing third trimester abortions; however, corporations are largely staying out of the fray, following Disneys disastrous battle with Republican Florida Gov.",
    "g' pic.twitter.com/QyywcyjdMg\n Lyft (@lyft) April 30, 2022\nSeveral companies that came out against the 2021 Texas Heartbeat Act, which bans most abortions at around six weeks, have been silent on the leaked draft opinion, including Lyft, GoDaddy, Glossier, Patagonia and Madewell.",
    "U.S.\nCommentary\nPatrice Lewis\nBrent Smith\nBarbara Simpson\nWayne Allyn Root\nRead all of today's COMMENTARY...\nEducation\nDiversions\nMoney\nWorld\nHealth\nFaith\nPolitics\nMORE COMMENTARY\nScott Lively\nLt. Col. James Zumwalt\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    " OkCupid (@okcupid) May 3, 2022\nMatch Group, which vocally supported abortion rights in the past, has been silent on the likely overturning of Roe, although OkCupid, which Match Group owns, called the development unacceptable? in a Tuesday statement.",
    "Subjects that divide the country can sometimes be no-win situations for companies because regardless of what they do they will alienate at least 15 to 30 percent of their stakeholders,? Zeno told clients, according to Popular Information.",
    "By Laurel Duggan\nDaily Caller News Foundation\nCorporations previously outspoken about hot-button social issues have stayed quiet on the likely overturning of Roe v. Wade after a dramatic fight between Disney and Florida Republican Gov.",
    "Disney has not commented on the draft opinion, nor have American Airlines, Walmart, Facebook, Microsoft or Comcast, according to CNBC, though all of the companies have been outspoken on politics and social issues in the past.",
    "Zeno, a massive public relations firm that advises Coca-Cola, Hersheys, Salesforce, Netflix and Starbucks, advised its clients not to comment on the overturning of Roe, according to Popular Information, citing a client memo.",
    "DeSantis stripped Disney of its special administrative zone and accompanying privileges in April after the company came out against a bill banning classroom instruction on gender identity and sexuality for young children.",
    "CEOs across the country then strategized about how they could avoid becoming the next Disney,? according to the Wall Street Journal, and have so far largely steered clear of this weeks groundbreaking abortion news.",
    "The United Parcel Service (UPS) reportedly donated to Rise Up for Abortion Rights, a pro-abortion group that is targeting churches this Mothers Day with protests, according to Fox Business.",
    "American Airlines, Walmart, Facebook, Microsoft, Comcast, Target, Lyft, GoDaddy, Glossier, Patagonia and Madewell did not respond to the Daily Caller News Foundations requests for comment.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "Do not assume that all of your employees, customers or investors share your view.?\nWomens rights are under attack again, this time in Oklahoma.",
    "UPS has not made a public statement on the likely end of Roe and did not respond to the Daily Caller News Foundations request for comment.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "OkCupid has proudly supported reproductive rights for years, and were not stopping now.",
    "We believe transportation should never be a barrier to a womans access to healthcare.",
    "Do not take a stance you cannot reverse, especially when the decision is not final.",
    "Ron DeSantis that ended with the company losing its special tax privileges.",
    "Tag a brand you want to see take action and sign https://t.co/vNANqnhBL4.",
    "This story originally was published by the Daily Caller News Foundation.",
    "Gender equality is at stake and more brands need to step up.",
    "Ron DeSantis over the companys political activism.",
    "#RoeVWade being overturned is unacceptable.",
    "This topic is a textbook 50/50 issue.",
    "Match Group declined to comment."
  ]
}