{
  "id": 3854,
  "mediaId": 151,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "Dem senator spars with Fox News host over Florida law",
  "image": "https://www.politico.com/dims4/default/286a423/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F0d%2F88%2F05a613ed4f8d8a5fa62415173b4c%2Fhttps-delivery.gettyimages.com%2Fdownloads%2F1320211362",
  "link": "https://www.politico.com/news/2022/05/08/murphy-baier-florida-dont-say-gay-00030902",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1949,
    2013,
    199,
    200,
    428,
    2661
  ],
  "sentences": [
    "This effort in Florida to sort-of target gay kids in schools, I just think is mean-spirited and something that I had not seen from the Republican Party when I first started out in politics 20 years ago.?\nBaier interrupted Murphy to challenge him, saying the law  which has sparked a national battle over sex education and gender issues since being signed by Republican Gov.",
    "| Chip Somodevilla/Getty Images\nBy David Cohen\n 05/08/2022 11:31 AM EDT\nSen. Chris Murphy sparred with Fox News Sunday? host Bret Baier over the broader implications of a recently enacted Florida law that has become a focal point of Americas cultural battles.",
    "It is sending a message to these kids that they are not worthy, that they should be ashamed of their identification.?\nBaier pushed back again, saying the law was designed to give parents more control of their childrens education.",
    "Baier circled back to his original point, indicating that his reason for starting the discussion was to question the idea of President Joe Biden demonizing the millions of Americans who supported former President Donald Trump.",
    "Murphy (D-Conn.), addressing the current mindset of the Republican Party nationally, said he looked at the Florida law referred to in some quarters as the Dont Say Gay? law as a sign the GOP has gone off the rails.",
    "So I absolutely do think that theres a message sent to these kids when you suggest that a conversation about their identity is somehow threatening the education of kids in our schools,? he said.",
    "I do think its important to sort of talk about this very different element of the Republican Party that exists today that I dont think was the foundation of the party a couple decades ago.?",
    "The much-debated law, among other things, has led to an awkward and potentially expensive battle between Florida Republicans and Disney, one of the states top employers.",
    "Half of trans kids in this country have contemplated suicide and thats because of the effort to bully them for their identity by adults in this country.",
    "\"I am very concerned about the sort of very quick, hateful, divisive turn that the Republican Party has taken,\" Chris Murphy said Sunday morning.",
    "I am very concerned about the sort of very quick, hateful, divisive turn that the Republican Party has taken,? he said Sunday morning.",
    "I just have seen this turn in the Republican Party where they are not willing to support protections for a democracy,? Murphy said.",
    "Ron DeSantis in March  was narrowly tailored to prevent classroom discussion of LGBTQ issues for the states youngest students.",
    "In response, Murphy again cited this new Florida law as an example of broader trends within the GOP that he found troubling.",
    "Theyre willing to install a president in the White House who didnt actually win either the popular or the electoral vote.",
    "They seem to be targeting vulnerable kids in a way that they didnt 10 or 20 years ago.",
    "The bill is about not talking about sexual identity from K through third grade.",
    "Murphy made it clear he saw something more sinister at work.",
    "Murphy disputed that: Yes, it is, its absolutely is.",
    "Thats not targeting gay kids,? Baier said."
  ]
}