{
  "id": 3857,
  "mediaId": 302,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "Think for yourself is letter of the month | Letters",
  "image": "https://www.tampabay.com/resizer//2UfuN6xlvllVd5I8eH2xK2cqoCw=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/PWOL3JFTORHGXC3NUYAFYGVM74.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/08/think-for-yourself-is-letter-of-the-month-letters/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Rather than trying to shield kids from subjects such as slavery (and societies role in its historical effects even today) or any one of a dozen ideas, I encourage parents to have their kids seek out information from many sources.",
    "Better to have learned kids interested in discussing at the dinner table what they learned at school to understand it better than a bunch of sycophants who do not question what they are spoon-fed at the trough of misinformation.",
    "Those lessons will last a lifetime so they may analyze when something doesnt pass the sniff test.?\nFar from indoctrinating our kids, exposing them to different ideas at an early age encourages curiosity in the world around them.",
    "We came to that tragic conclusion because as a psychiatric patient at a state hospital in Florida, and having the mental capacity of a 5-year-old, she couldnt make the decision on her own.",
    "Subscribe to our free Stephinitely newsletter\nWhile excruciating, that decision was necessary because a Catholic doctor removed Mary from birth control pills when he took over her case.",
    "But it was the right one, given the daily pharmaceutical nightmare raging through my sisters body in an attempt to control her psychosis and a host of other physical ailments.",
    "How can it be legal that an issue (in this case pregnancy) caused by 50 percent men and 50 percent women punishes 100 percent of women and 0 percent of men?",
    "My child would have been called a welfare baby and us a drain on society by the same people who would want to prevent my life from ending up any other way.",
    "Disney management understandably wants everyone to visit their theme park, regardless of peoples sexual orientation, gender identity or religious beliefs.",
    "It was done without considering what might happen should my sister, a 42-year-old sexually active, mentally disabled woman, carry a baby to term.",
    "It creates citizens of the world with skills they will no doubt need in this increasingly partisan landscape of fear, uncertainty and doubt.",
    "My mother and I were forced into one of the most difficult decisions of our lives for no other reason than it supported his belief.",
    "Our kids should learn about capitalism, socialism, Marxism, comparative religions, slavery and feminist issues, to name just a few.",
    "But with our decision, we prevented the birth of a child who, in all likelihood, would have been mentally or physically disabled.",
    "If our governor acts to discourage visitors to Florida and Disney World, that is bad for Disneys bottom line, pure and simple.",
    "Thomas M. Schaefer, Madeira Beach\nI had an abortion\nI am old enough to have gotten pregnant before abortion was legalized.",
    "Safe, legal abortion not only saves lives but allows a woman to live the kind of life she chooses, just like a man does.",
    "Think for yourself\nApril letter of the month\nEditors note: The April letter of the month reacted to a story about Gov.",
    "Shannon OLeary-Beck, Clearwater\nMy sisters horrible case\nMy mother and I decided my sister should have an abortion.",
    "There is so much worry about perceived indoctrination of our kids by agenda-laden teachers, math books, CNN, etc.",
    "We always encouraged our kids to think critically, question everything and see if any idea seems reasonable.",
    "It was an excruciatingly painful, terrifying, extremely lonely experience, but I was one of the lucky ones.",
    "John Heagney, Tarpon Springs\nWhat should happen\nI am the proud father of three and proud grandpa of six.",
    "Provide top quality prenatal care for the mom and baby from conception to birth and beyond;\n2.",
    "Ross P. Alander, Tampa\nDollars for Disney\nDisney is in the business of selling entertainment.",
    "The solution is easy: teaching your kids to think critically serves them well.",
    "Teach them how to analyze what they are learning and form their own opinions.",
    "Ron DeSantis signing a bill limiting tenure at Florida public universities.",
    "The more Disney World passes that they sell, the more the company profits.",
    "Disney management should speak out to benefit their stockholders, period.",
    "Provide top quality pediatric care from the birth to young adulthood;\n3.",
    "He did so without the permission of my mother, her legal guardian.",
    "Corporations are citizens and are entitled to their opinions.",
    "Provide top quality adoption services for the mom and baby.",
    "Certainly, she didnt have the faculties to reason that out.",
    "I had no money, no support and was in a toxic relationship.",
    "If I had had that child, we would have been on welfare.",
    "I tried a talked-about remedy to force a miscarriage.",
    "Putting my sister in that situation was a sacrilege.",
    "I knew someone who died from trying to self-abort.",
    "I was so not ready to raise a child and be a mom.",
    "This, I believe, is the minimum that must happen.",
    "Here is what I believe each state must do:\n1.",
    "I was barely out of high school.",
    "I was estranged from my parents.",
    "This was not an easy decision.",
    "Well, heres what I believe.",
    "And that was a blessing.",
    "Knowledge is power.",
    "Mike Allen, Dunedin",
    "It worked."
  ]
}