{
  "id": 3860,
  "mediaId": 558,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "Utilities push back against growth of rooftop solar panels",
  "image": "https://s.yimg.com/ny/api/res/1.2/rWTJd1cO45sMELrerE_hxg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTg4MTtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/xgJOUb3ff39ietNYbbeNPA--~B/aD0yNTAwO3c9MjAwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/nbc_news_122/8c2448ef5ed999658f85f592b429b52e",
  "link": "https://news.yahoo.com/utilities-push-back-against-growth-083021673.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3386,
    3416,
    2661,
    2798,
    2834,
    5004
  ],
  "sentences": [
    "One of the biggest thrills Lynn Krell and her husband experienced after they installed solar panels on the roof of their Hattiesburg, Mississippi, home was watching their power meter run backward as their utility credited them for excess power they sold back to the grid.",
    "But as solar power has become cheaper and more widespread, utilities in some states have pushed to curb the payments, said Autumn Proudlove, senior policy program director at the NC Clean Energy Technology Center at North Carolina State University.",
    "The battle is one of several around the country that could determine the future of home solar panels, which advocates say are crucial to weaning the energy system off power sources that emit carbon dioxide, a major cause of global warming.",
    "Rooftop solar has a huge potential? to cut air pollution, create jobs, protect against outages and shrink utility bills, said Mark Jacobson, a professor of civil and environmental engineering at Stanford University.",
    "Those credits also showed up on their electricity bill, helping to cut their average monthly payments by $11  in addition to the $250 or so they saved during peak summer months by using solar power themselves.",
    "The Krells learned that Mississippi regulations allowed utility companies to buy roof-generated solar power at a small fraction of the retail rate they charge to deliver that power back to customers homes.",
    "Mississippi, which gets a lot of sun, was one of the last states to give subsidies to people who install solar panels on their roofs in 2015, and those subsidies remain among the stingiest in the country.",
    "In North Carolina, utility-backed proposals to change the states relatively generous rooftop solar subsidies , with opponents saying the plan puts solar customers and installers in financial risk.",
    "One, performed by Lawrence Berkeley National Laboratory in 2017, found that rooftop solars effect on electricity prices will likely remain negligible for the foreseeable future?",
    "How to fix that is the subject of a fight before the Mississippi Public Service Commission, which is considering rules that would expand subsidies for rooftop solar.",
    "The Krells talked to rooftop solar owners in other states where more generous compensation rules allowed them to offset their entire electricity bills.",
    "In Florida, the states largest utility persuaded lawmakers to vote to gut the states rooftop solar credits, a measure that Gov.",
    "The technology will be vital for the U.S. to make the transition to all-renewable energy by 2050, he said.",
    "Thirty-seven states reimburse at the full retail rate, but Mississippi offers significantly less.",
    "offers some kind of credit to rooftop solar owners who send excess power to the grid.",
    "That, experts say, is one of the reasons rooftop solar hasnt caught on there.",
    "Some studies have supported the utilities argument, while others havent.",
    "But eventually the Krells began to question the value of the credits.",
    "Ron DeSantis, a Republican, last week, it would hurt consumers.",
    "In California, state regulators, at utilities urging, .",
    "Only 586 Mississippi households have the technology.",
    "Im royally ticked,? Krell, 63, said.",
    "That question remains unsettled.",
    "It felt unfair."
  ]
}