{
  "id": 3861,
  "mediaId": 558,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "GOP pins hopes on Nevada's Laxalt to help win Senate control",
  "image": "https://s.yimg.com/ny/api/res/1.2/ozex0HNJwEMRnaTLQcOMFw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTYyMDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/OPyrqWP6FO.NKk2zcP9lyw--~B/aD0zMjA4O3c9NDk3MDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/906a251be99de3edf9d01788c947aeb6",
  "link": "https://nz.finance.yahoo.com/amphtml/news/gop-pins-hopes-nevadas-laxalt-142753951.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "KEN RITTER and NICHOLAS RICCARDI",
  "authorUrl": "",
  "termIds": [
    661,
    991,
    1147,
    1465,
    1837,
    2429,
    428,
    571,
    2751,
    2818
  ],
  "sentences": [
    "By his side in the bar was Floridas governor, Ron DeSantis, a likely candidate for the partys 2024 presidential nomination who was fresh off his legislation punishing Disney for opposing his new law baring instruction on sexual orientation and gender identity in kindergarten through the third grade.",
    "His dilemma quickly became clear when he simultaneously praised the potential opinion as an historic victory for the sanctity of life? but played down ts impact in Nevada, where voters enshrined abortion rights in the state constitution in 1990.",
    "Laxalt is also a strong opponent of , which Democrats hope will become a bigger vulnerability for him if the U.S. Supreme Court follows through with a draft opinion released last week that would overturn the landmark Roe v. Wade decision.",
    "Toppling Cortez Masto would not only give Republicans the additional seat needed for control  provided they do not lose any seats they now hold  but bragging rights to having greater appeal among immigrant communities.",
    "It's the third most-diverse state, but Democratic margins have been steadily shrinking here since 2008, when Barack Obama became his party's first presidential candidate to carry Nevada in 12 years.",
    "LAS VEGAS (AP)  The man Republicans hope could be their 51st senator, putting them back in power, took the stage recently at a rowdy country music bar in Las Vegas packed with excited voters.",
    "Nevada deserves someone that will break from the radical left and stand with our state when we need courage,\" Laxalt said to cheers from supporters waving Patriots for Laxalt? signs.",
    "Adam Laxalt is the grandson of a Republican senator from Nevada and an avowed conservative who was state attorney general before losing a 2018 race for governor.",
    "Nevada is central to the GOP's hopes this year to retake the evenly-split Senate and potentially make longer-term inroads with minority voters.",
    "Laxalt has already drawn criticism for being too hard-line to win a race in a state that has mostly elected Democrats over the past 15 years.",
    "In 2020, he co-chaired President Donald Trump's campaign in Nevada and repeated Trump's lies about the election being swung by voter fraud.",
    "In 2010, Sen. beat GOP challenger Sharron Angle by portraying her as extreme on immigration and unfit for higher office.",
    "Laxalt served a single term as Nevada's attorney general, then was soundly defeated in his 2018 gubernatorial bid.",
    "But he called Democratic Sen. Catherine Cortez Masto, his potential opponent in November, the partisan problem.",
    "There is a history in Nevada, however, of a Democratic senator defying the odds during a Republican wave year.",
    "It also would be a sign there are fewer barriers to aggressive conservatives than assumed.",
    "We need independence and someone that will break from that party and stand with us.\"",
    "Democrats have similar plans for Laxalt."
  ]
}