{
  "id": 3863,
  "mediaId": 25,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "Transcript: Former Attorney General Eric Holder on \"Face the Nation,\" May 8, 2022",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/05/08/6bbd372b-f657-4279-b36d-d80f11aeabd9/thumbnail/140x90g2/fa8bc4482ccb748fdb7d326a7ae96fb4/pelosi1.jpg",
  "link": "https://www.cbsnews.com/news/eric-holder-transcript-face-the-nation-05-08-2022/",
  "sentiment": "0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "And yet we've brought a lot of lawsuits, successfully brought a lot of lawsuits in order to make sure that the process is done in a fair way and so that the American people actually pick their representatives as opposed to politicians choosing their voters and so sue to blue, that's what they say when you're winning in court, which is what we have done at a whole bunch of levels.",
    "The Battle Over Abortion\n More\n Pelosi says Supreme Court \"slapped women in the face\"\n Transcript: Eric Holder on \"Face the Nation\"\n Transcript: Rep. Nancy Mace on \"Face the Nation\"\n Transcript: House Speaker Nancy Pelosi on \"Face the Nation\"\n The threat to Roe v. Wade, and to the Supreme Court's legitimacy\n More",
    "And the problem that you sketch out here, you say the entire democratic system essentially is broken, as I understand it, unrepresentative Senate, unnecessary anti-democratic Electoral College, gerrymandered House of Representatives, panoply of state legislatures, and a stolen Supreme Court.",
    "And what I talk about in the book is to say, look, we should term limit the justices, 18 years, and that every president should have an opportunity to nominate two justices per term and to try to take some of the pressure out of this, put the partisanship and the in the confirmation process.",
    "MARGARET BRENNAN: I want to ask you about Alabama, because as- as I understand it, the Supreme Court has tried not to directly get involved in what they deem political gerrymandering, but they have signaled a willingness to hear cases that involve issues of race.",
    "ERIC HOLDER: That's certainly a component of- I think they're thinking- they're going after Democrats and the fact that- that the Democrats that they're going after happened to be black I don't think is necessarily a coincidence.",
    "I think you can't compare, however, what happened in New York and Maryland to what is going on in Texas, Georgia, potentially Florida, Wisconsin, where Republicans have really gone to town in terms of- of gerrymandering.",
    "ERIC HOLDER: They are, if you look at Texas, which is getting two additional seats strictly as a result of the increase in the Hispanic population, they have not increased that- the power of Hispanics in Texas at all.",
    "And I think we should- what I've tried to put out- point out in the book is that we have faced these issues before, and we've had heroes and heroines in our history that have faced similar kinds of issues.",
    "If you look at the Supreme Court, we have two seats, one stolen from the Democrats that Merrick Garland should have now, that- that seat was not filled, of course, was too close to an election.",
    "ERIC HOLDER: Well, I think we certainly stopped the Republicans when they said they wanted to secure a decade of power in this next decade based on the redistricting that they were going to do.",
    "At some point, people at the Justice Department, perhaps that prosecutor in Atlanta, are going to have to make a determination about whether or not they want to indict Donald Trump.",
    "The map that you see in New York reflects really a population shift, a hollowing out of the rural areas in New York, as well as an increase in the urban areas in New York.",
    "We won't really know how aggressive they have been until they are before a camera in announcing a decision either to indict certain people or not indict certain people.",
    "Now, what the Supreme Court will ultimately do with section two of the Voting Rights Act, which was the basis for the lawsuit in Alabama, will remain to be seen.",
    "The thing that really worries me, however, is that we have 40% fewer competitive seats than I think we should have as a result of what both parties have done.",
    "They're going to have an election in November based on maps that judges, including two Trump judges, said were inappropriately, unconstitutionally drawn.",
    "ERIC HOLDER: No, what I'm saying is I would say there's a substantial amount of our structure that needs to be repaired, that needs to be examined.",
    "The suit that we won in Alabama was where we said that you should have additional representation for black- the black inhabitants of Alabama.",
    "ERIC HOLDER: I indicated my opposition to what had happened- what the legislature did in Maryland agreed with the judge, which he did there.",
    "The following is a transcript of an interview with former Attorney General Eric Holder that aired Sunday, May 8, 2022, on \"Face the Nation.\"",
    "My guess is that after the courts look at what happened in New York, you will see maps that are different, but not fundamentally different.",
    "Do you think that the maps being redrawn in Alabama will ultimately be deemed to be illegal and therefore the election should be invalid?",
    "So there is a census basis- Census Bureau- basis for what's happening in New York that does not exist in the- in Republican states.",
    "But you say Democrats were caught asleep at the wheel when Republicans started investing 12 years ago in some of these local races.",
    "There have been critics of him who say that he isn't being aggressive enough around the prosecutions regarding January the 6th.",
    "You know, in the book you write, both parties have embraced gerrymandering when they were in control of state governments.",
    "He started a group in 2016, the National Democratic Redistricting Committee, to help the party redraw congressional lines.",
    "We've blunted that effort and we certainly have more fair maps than we did coming out of the last redistricting cycle.",
    "MARGARET BRENNAN: Well, you have a lot of different recommendations in the book, but I mean, it's a long to-do list.",
    "There are still elections scheduled in November in the state of Alabama, even though the court will hear this case.",
    "Those districts were certainly drawn with the thought that they would disenfranchise African-Americans in Alabama.",
    "MARGARET BRENNAN: You think Democrats have an advantage then going into the midterms versus where you started out?",
    "I wouldn't say that everything is broken, but there is--\nMARGARET BRENNAN: I was reading from your book there.",
    "We need to look at the structures of our democracy if we're going to try to- if we're going to try to save it.",
    "MARGARET BRENNAN: You say this is about fairness, but you haven't challenged any Democratic gerrymandering.",
    "My initial thought was not to indict the former president out of concern of what- how divisive it would be.",
    "You say every person having an equal say in our democracy, one person run- one vote is far from a reality.",
    "MARGARET BRENNAN: Republicans would obviously disagree with your characterization of how that played out.",
    "This is one of the things I talk about in my book, this notion of us getting to some structural changes.",
    "MARGARET BRENNAN: You heard there what is happening in Florida and what Governor Ron DeSantis describes.",
    "ERIC HOLDER: Yeah, I think that's true--\nMARGARET BRENNAN: --You're saying the entire system is broken.",
    "So if Republicans win control of Congress in November, is that election- does it not have integrity?",
    "And so we're going to allow the election to go ahead on those maps that were found to be defective.",
    "And in New York, what I've said is that those are not the maps that I would have drawn in New York.",
    "What he is doing there by doing away with a- a traditionally black seat is certainly a factor.",
    "MARGARET BRENNAN: And we turn now to former Obama administration Attorney General Eric Holder.",
    "You know, critics call your strategy just sue to blue that it's just all about partisanship.",
    "I mean, you know, I have great faith in Merrick and in the people at the Justice Department.",
    "Both of the maps passed by Democrats were thrown out by courts in Maryland and in New York.",
    "ERIC HOLDER: Well, you know, it's interesting--\nMARGARET BRENNAN: --Is what you're saying?",
    "And then Amy Coney Barrett was placed into a seat while people were actually voting.",
    "But given what we have learned, I think that he probably has to be held accountable.",
    "In fact, they have created more minority- more majority white districts in Texas.",
    "But Merrick Garland, you mentioned he's now in your old job as attorney general.",
    "ERIC HOLDER: Well, I think there's going to be sufficient factual information.",
    "And then the question becomes, what's the impact of- of such an indictment?",
    "I mean, those are the kinds of things that I think need to be addressed.",
    "MARGARET BRENNAN: But you think it is to intentionally disenfranchise?",
    "And we have the capacity, I think, to make these kinds of changes.",
    "Mr- Mr. Holder, thank you for your time and for sharing your book.",
    "And I think that there's going to be sufficient proof of intent.",
    "And through sacrifice, commitment, they have made a difference.",
    "And he has a new book out called, quote, Our Unfinished March.",
    "He says that what he is doing with redrawing is race neutral.",
    "Are you saying the gerrymandering there is rooted in racism?",
    "There is going to be a-\nMARGARET BRENNAN: --Would you do it?",
    "MARGARET BRENNAN: We'll leave it on that incredible note.",
    "We need to look- we need to ban partisan gerrymandering.",
    "Fundamentally different from what Democrats have done.",
    "FORMER U.S. ATTORNEY GENERAL ERIC HOLDER: Morning.",
    "Ed O'Keefe laid out some of those examples there.",
    "Do you have a problem with what happened there?",
    "ERIC HOLDER: Though, it's an interesting thing.",
    "ERIC HOLDER: No, ours is a fight for fairness.",
    "Supreme Court said too close to the election.",
    "ERIC HOLDER: It's certainly race conscious.",
    "MARGARET BRENNAN: Glad to have you here.",
    "I think your premise goes a little far.",
    "Do not accept the outcome of it?",
    "Banning partisan gerrymandering.",
    "I know you strongly disagree.",
    "How do you respond to that?",
    "Do you think that's right?",
    "ERIC HOLDER: No one knows.",
    "But here's my prediction.",
    "MARGARET BRENNAN: How so?",
    "I'm an institutionalist.",
    "Race is a factor there.",
    "A stolen Supreme Court.",
    "We'll be right back.",
    "Good morning to you.",
    "ERIC HOLDER: No."
  ]
}