{
  "id": 3868,
  "mediaId": 1390,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "Disney silent on SCOTUS opinion leak, but weighed in on Florida parents bill",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/854081161001/b43da77b-2547-48f4-8cc7-5e7e3293dadd/b7ef74d1-e0ba-4a85-822e-0460561889f0/1280x720/match/image.jpg",
  "link": "https://www.foxbusiness.com/politics/disney-silent-scotus-opinion-parents-bill",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Peter Aitken",
  "authorUrl": "https://www.foxbusiness.com/person/a/peter-aitken",
  "termIds": [
    661,
    827,
    1001,
    1241,
    4332,
    482,
    524,
    2661,
    2672
  ],
  "sentences": [
    "BIDEN ADMIN IS PURPOSEFUL IN FACILITATING ILLEGAL MIGRATION: TEXAS AG\nThe company has not remained shy in the past regarding its opinion on the topic of abortion: In 2019, then-CEO Bob Iger said it would be \"very difficult\" for the company to keep filming in Georgia after the state signed a heartbeat abortion law.",
    "THE COMPANIES PAYING TRAVEL COSTS FOR ABORTIONS: TESLA, AMAZON, CITI ON SMALL BUT GROWING LIST\nBut the entertainment giant has yet to make public statement on the SCOTUS leak that revealed intent among the justices to overturn the landmark Roe v. Wade decision through Dobbs v. Jackson Womens Health Organization.",
    "SCHITT'S CREEK' TO MOVE FROM NETFLIX TO HULU AFTER DISNEY STREAMER TAKES OVER RIGHTS\nThe silence from Disney, as well as other corporate giants such as Walmart, has grown more noticeable after the very public comments made over Floridas bill.",
    "Chief Justice John Roberts confirmed Tuesday that the pending decision is genuine, though the draft dates back to February and does not represent the current or final opinion of the court.",
    "CEO Bob Chapek issued a statement on Floridas Parental Rights in Education bill shortly after the legislation was officially signed into law by Gov.",
    "Chapek said that the bill, which he also called the \"Dont Say Gay\" bill, \"should never have passed and should never have been signed into law.\"",
    "Disney has remained silent on the Supreme Court opinion leak, even after making several public statements regarding Floridas newest laws.",
    "Chapek pledged that the company would pause all political donations to Florida and contribute that money instead to LGBTQ+ causes.",
    "However, it was not enough to stop an employee walkout on March 22 demanding that the company do more to protect its LGBTQ+ staff.",
    "\"You needed me to be a stronger ally in the fight for equal rights and I let you down,\" Chapek said in a statement on March 11.",
    "\"I think many people who work for us will not want to work there, and we will have to heed their wishes in that regard.",
    "He also promised to meet with DeSantis to make clear his and Disneys opposition to the law.",
    "Right now we are watching it very carefully,\" he said, according to Reuters.",
    "Disney has not responded to multiple FOX Business requests for comment.",
    "\"I dont see how its practical for us to continue to shoot there.\"",
    "\"I am sorry.\"",
    "Ron DeSantis."
  ]
}