{
  "id": 3871,
  "mediaId": 223,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Have No Fear, the WaPo Editorial Board Says To 'Ignore Hysteria Over the Disinformation Governance Board'",
  "image": "https://media.townhall.com/townhall/reu/ha/2019/84/bf23878e-2890-4a6c-9aa9-47c51d82e68f.png",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/05/07/have-no-fear-the-wapo-editorial-board-says-to-ignore-hysteria-over-the-disinformation-governance-board-n2606915",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    661,
    1098,
    2066,
    146,
    525,
    3204,
    2688
  ],
  "sentences": [
    "Not mentioned is Sen. Rand Paul (R-KY), who, in a hearing earlier this week, grilled Mayorkas as no one else could, reminding him that it's the U.S. government that is \"the greater propagator of disinformation in the history of the world,\" and thus they're the last entity we should want policing so-called \"disinformation,\" if they don't even know what it is.",
    "The board is supposed to ensure that these government authorities  from the Federal Emergency Management Agency as it counters scammers following natural disasters to the Cybersecurity and Infrastructure Security Agency as it instructs critical infrastructure companies on how to secure themselves against hackers  respect human rights.",
    "Source: AP Photo/Manuel Balce Ceneta, file\nLast week, it was revealed that the Department of Homeland Security had put together a Disinformation Governance Board, which was so chilling, even the department's Secretary Alejandro Mayorkas acknowledged they could have done a better job explaining it.",
    "They, as well as government actors charged with disseminating the facts to debunk popular falsehoods or with educating citizens on how to avoid being fooled in the first place, need to know how to execute their roles effectively  as well as how to do so without infringing on civil liberties.",
    "The editorial, predictably, blamed the \"hysteria\" that we are told to \"ignore\" on Republicans, in this case, House Minority Leader Kevin McCarthy (R-CA), who, like so many others, has likened the board to George Orwell's \"1984,\" including when it comes to the Ministry of Truth.",
    "Here's how they try though, with added emphasis:\nThe Disinformation Governance Board, (whose acronym is the Soviet-sounding DGB) is supposed to aid coordination among DHS offices as they counter viral lies and propaganda that pose a threat to domestic security.",
    "https://t.co/OUUHcj0wH4\n Glenn Greenwald (@ggreenwald) May 7, 2022\nThe senator also passionately reminded that we work our issues out \"by debating this, we don't work them out by the government being the arbiter.",
    "Sure enough, Democratic allies in the mainstream media, in this case, the editorial board of The Washington Post, is assuring we have no place freaking out over such government restrictions.",
    "Mr. Mayorkas mentioned campaigns by human smugglers targeting migrants to trick the Haitian community into thinking they could enter the United States without risk of deportation.",
    "What the board is not tasked to do is to establish what is true and what is false, or to push Internet services or anyone else to rake a tougher line on expression in general.",
    "I don't want the government guardrails,\" Paul said, using Mayorkas' own phrasing, as he added \"I want you to have nothing to do with speech.\"",
    "Sen. Paul went on to ask the secretary, \"do you think the American people are so stupid they need you to tell them what the truth is?",
    "Studying the best practices? for stymying these attempts and sharing them with government actors could do a great deal of good.",
    "Unfortunately, Mayorkas' explanations didn't help, and the more we hear about those involved, the worse the whole idea sounds.",
    "Cites the Pentagon Papers, Bush's WMDs, Iran-Contra, Steele Dossier to say DHS is untrustworthy to decree \"disinformation.\"",
    "Already, components of the agency are gathering knowledge about what rumors are circulating so that they might respond.",
    "On Tuesday, the editorial board posted their view, to \"Ignore the hysteria over the Disinformation Governance Board.\"",
    "Ron DeSantis (R-FL), had shared a rather fitting take on it over Twitter on Saturday morning.",
    "What they go on to suggest, laughably so, is that it's merely the name that is the problem.",
    "\"Do you know who the greatest propagator of disinformation in the history of the world is?",
    "For the editorial also acknowledges that \"the particulars werent really clear at all.\"",
    "\"Ministry of Truth\" was trending over Twitter for days after the board was announced.",
    "(@ChristinaPushaw) May 7, 2022\nChristina Pushaw, the press secretary for Gov.",
    "Government is largely disseminating disinformation,\" he aptly reminded.",
    "Russias persistent efforts to influence U.S. elections are well known.",
    "They word above is \"done right,\" and even that is worth arguing with.",
    "You can't even admit what the truth is with the Steele dossier.",
    "I don't trust government to figure out what the truth is!",
    "Indeed, the board has no operational authority at all.",
    "The editorial itself is brief and somewhat useless.",
    "Again, it wasn't merely McCarthy, though.",
    "Done right, this is a useful function.",
    "What national Dem would say this??",
    "It hardly strikes confidence.",
    " Christina Pushaw ??",
    "The US Govt.\"",
    "-- @RandPaul.",
    "????"
  ]
}