{
  "id": 3880,
  "mediaId": 302,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Most Florida math textbook reviewers didnt see evidence of woke concepts",
  "image": "https://www.tampabay.com/resizer//FKqKvxUDCUa3H4QzyKwfaP2im-k=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/V4W6VKCDS5CFDJZ2UN75FETZNU.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/07/most-florida-math-textbook-reviewers-didnt-see-evidence-of-woke-concepts/",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4680,
    4729,
    3279,
    3351,
    3570,
    2661
  ],
  "sentences": [
    "She had already been involved in a book-review process in her district, she said, and figured, Why not??\nShe reviewed Thinking Mathematically,? from Savvas Learning Company, a book for the course Mathematics for College Liberal Arts,? and concluded the state should reject it based solely on critical race theory elements.?\nAllen said the content contained CRT because it put an emphasis that racism is embedded in American society,? pointing to a lesson plan answer that said, The United States has eradicated neither poverty nor racism.?\nThere was also evidence of CRT in the math book, Allen said, because there was no mention of the Federalist Papers to understand why the Electoral College was established.?\nThe American history of context is presented as something other than the creation of a new nation based largely on universal principles stated in the Declaration of Independence,? she wrote.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nSen. Manny Diaz Jr., R-Hialeah, who was recently confirmed as Floridas new education commissioner, posted on Twitter Friday that the department has an extensive review process and compiles all pieces of evidence when adopting textbooks  including reviews, evaluation scores and public comment.?\nHe said there were several reviewers? that found CRT in submitted math textbooks, but he did not share examples.",
    "But one parent, who is affiliated with the conservative group Moms for Liberty and who assisted the state in reviewing two math books, said other reviewers may have glossed over content that she flagged to the state as inappropriate, agenda driven? and biased.?\nI wish they couldve seen the information I saw,? Chris Allen told the Herald on Friday, speaking to the possible disparities between her responses and those of other reviewers.",
    "The department later announced that 19 books were added back to the states adoption list, claiming that publishers made fixes that included removing woke content.? The state has not explained what publishers had to do to get their books on the approved list so quickly, raising questions about exactly what content the states review process found objectionable.",
    "Ron DeSantis and his administration criticize publishers for attempting to indoctrinate? students with woke content.?\nThe math textbook rejections over issues like critical race theory, an academic concept that is generally not part of the K-12 curriculum, has drawn national attention and left many educators scratching their heads.",
    "Maybe, she said, the others were focusing on other aspects of the curriculum.?\nSome reviewers were trained in the states B.E.S.T Standards, according to Allen, so maybe they were focusing on how things aligned with the standards instead of the words or examples being used? in the problem-solving portions of the books.",
    "When asked for the states definition of woke content,? the department pointed back to state rules and laws that reject the inclusion of critical theory, inclusions of common core, and unsolicited addition of social-emotional learning in mathematics? in instructional materials.",
    "The textbook examinations were part of a thorough? review process that led the Florida Department of Education to reject 54 of 132 math textbooks proposed for use in public school classrooms over claims that publishers were attempting to indoctrinate? students.",
    "Many of those educators assessed the books to see whether they would be easy to navigate, understand and keep students interested in the subject of math  and the majority found no evidence of prohibited topics? like critical race theory in the books.",
    "The Heralds partial review of the book examinations also shows that in many instances, book reviewers only answered whether the books contents included critical race theory, not the many detailed other questions found in most of the reviews.",
    "TALLAHASSEE  Dozens of state reviewers found no evidence of prohibited topics? like critical race theory and social-emotional learning in math textbooks, a partial review of nearly 6,000 pages of book examinations shows.",
    "Those reviewers must meet minimum professional qualifications.?\nEach instructional material is evaluated by multiple reviewers, just like would happen for any state agency competitive bid process,? the department said.",
    "Lots of questions but still few detailed explanations\nThe ways in which state reviewers approached the content underscore the tensions that are emerging in Floridas book adoption cycle as Gov.",
    "I found no evidence of any instruction or indoctrination of social issues,? Clark wrote after reviewing a high school-level algebra and trigonometry book that was rejected by the state.",
    "The textbook examinations were conducted by more than 70 people, including elementary and high school math teachers, college professors, principals and math curriculum coordinators.",
    "The state Department of Education has provided few details on the objectionable content, beyond posting four examples provided to the department by the public with no explanation.",
    "Social-emotional learning is the educational practice of teaching students skills such as creative problem-solving, understanding their emotions and showing empathy toward others.",
    "Allen, an aerospace engineer, applied to be a book reviewer in January after seeing the department was seeking participants in the review process.",
    "The Department of Education did not immediately respond to requests seeking comment on why reviewers only focused on that part of the standards.",
    "In a statement, the department said it seeks reviewers with content expertise and an in-depth understanding? of the states standards.",
    "For Carl Clark, an assistant professor of mathematics at Indian River State College, the materials presented a different picture.",
    "But one parent, who is affiliated with the conservative group Moms for Liberty, said she saw biased? content in her review.",
    "Critical race theory is a legal academic concept that examines systemic racism in American institutions and policies.",
    "However, a much smaller number of reviewers did find examples they disagreed with on those topics.",
    "He confirmed to the Herald Friday that he was a reviewer but declined to comment further.",
    "Miami Herald Senior Editor Dave Wilson contributed to this report.",
    "Closer scrutiny just for CRT?",
    "It is a math textbook."
  ]
}