{
  "id": 3881,
  "mediaId": 302,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Paying to save Floridas manatees is the right thing to do | Editorial",
  "image": "https://www.tampabay.com/resizer//eiGOiwyxIVgkDOJOPsFsY_1Ojms=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/FCWZTUFMFO52MAAOFHUFFFE77Y.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/07/paying-to-save-floridas-manatees-is-the-right-thing-to-do-editorial/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3702,
    4407,
    4445,
    2661,
    2926
  ],
  "sentences": [
    "The office will also help develop a resilience action plan for the state highway system, a prioritized list of resilience projects that would include costs and timelines, and a database that would identify such things as medical centers, utilities, emergency operation centers and airports threatened by rising sea levels, the News Service of Florida reported.",
    "He wrote that he engaged in activities that were contrary to the spirit and intent of open government and transparency.? In the settlement, Dingfelder agreed not to run for City Council, mayor or seek an appointed position dealing with city zoning or land-use issues for five years.",
    "A public official who voluntarily leaves office on a serious public records allegation should not be acting in a quasi-judicial governmental role just a few weeks later.",
    "Also on this weeks list of highs and lows: The Hillsborough County Commission makes the right call on John Dingfelder, and the governor makes a move on sea level rise.",
    "It took eight months, but Pasco teachers and support staff finally reached a tentative contract with the district ... for the school year that ends in a few weeks.",
    "The part-time land use hearing officers are paid $75 an hour to conduct hearings on rezoning applications and oversee variance requests, among other duties.",
    "Only a few weeks ago, Dingfelder took the remarkable step of resigning from City Council after he was caught up in a self-inflicted public records dispute.",
    "The Hillsborough County Commission chose the smart path in rejecting former City Council member John Dingfelders bid to become a land use hearing officer.",
    "The office, set up to address the impacts of flooding and sea-level rise, will report directly to the governor, who signed the bill into law this week.",
    "The members of the Editorial Board are Editor of Editorials Graham Brink, Sherri Day, Sebastian Dortch, John Hill, Jim Verhulst and Chairman Paul Tash.",
    "Blame for the opioid epidemic can be spread wide, but the money from the settlement should help keep others from getting addicted to dangerous drugs.",
    "The county commission voted 6-1 on Wednesday to extend the contracts of the two current land use officers, a move that denied Dingfelders request.",
    "The road wont be at full capacity until later this summer, but the opening signals that the long-awaited and delayed project is coming to an end.",
    "Too many of Floridas elected leaders in Tallahassee dragged their feet over the last decade when it came to climate change and sea level rise.",
    "The deaths are mostly due to human-related activities, including algal blooms fueled by fertilizer runoff that damage manatee feeding grounds.",
    "Most of the money  to be paid out over 18 years  will go to fund community treatment, education and prevention programs around the state.",
    "The state is prepared to spend more than $30 million to help rescue Floridas iconic manatees, $17 million more than the current budget.",
    "The trial was based in Pasco, which state lawyers said suffered Floridas highest drug overdose death rate from 2004 through 2012.",
    "Last year, 1,101 manatees died, more than any year on record, and at least another 527 have died already this year.",
    "Florida is already feeling the effects of rising seas, an unfortunate reality that wont be going away anytime soon.",
    "A civil trial over Walgreens contributions to the opioid crisis ended in a $683 million settlement with the state.",
    "Great to see the diverging diamond interchange on Interstate 75 at SR 56 in south Pasco finally open on Sunday.",
    "We owe it to them to help stabilize the losses and to provide a safer environment in which they can thrive.",
    "For the people making Dingfelder out as a martyr, wed recommend reading the lawsuits depositions.",
    "The office cannot be just window dressing or a fount of data that no one acts upon.",
    "Ron DeSantis took a good step by creating the new Statewide Office of Resilience.",
    "Subscribe to our free Stephinitely newsletter\nPasco happenings (times three).",
    "But he sidestepped that agreement by applying with the county, not the city.",
    "The state still has a lot to do to prepare, but the Legislature and Gov.",
    "Editorials are the institutional voice of the Tampa Bay Times.",
    "Boaters also hit and killed more than 100 manatees last year.",
    "Follow @TBTimes_Opinion on Twitter for more opinion news.",
    "Heres hoping the next contract doesnt take so long.",
    "To put it bluntly, humans are killing manatees.",
    "Its a sound and warranted investment.",
    "Dingfelder made his own bed.",
    "That was the right call.",
    "The right call.",
    "Taking action.",
    "Manatee help.",
    "1.",
    "3.",
    "2."
  ]
}