{
  "id": 3882,
  "mediaId": 136,
  "date": "d2022-05-07T08:53",
  "headline": "Colorado Governor Uses Putin Comparison in Pitch to Disney",
  "image": "",
  "link": "https://www.newsweek.com/colorado-governor-putin-comparison-pitch-disney-ron-desantis-1704498",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darragh Roche",
  "authorUrl": "https://www.newsweek.com/authors/darragh-roche",
  "termIds": [
    661,
    2030,
    2517,
    3982,
    4529,
    524,
    2621
  ],
  "sentences": [
    "Polis, a Democrat, told NBC's Meet the Press on Friday that he was \"taken aback\" by DeSantis decision to sign a bill that will dissolve Disney's Reedy Creek Improvement District (RCID), which allows the company to run its own local government.",
    "Polis' latest comments come as three Democratic lawmakers in Florida warning that residents in two counties where Walt Disney World is located could face a hefty tax bill when the Reedy Creek Improvement District is dissolved.",
    "The Parental Rights in Education law prohibits \"classroom discussion about sexual orientation or gender identity in certain grade levels or in a specified manner\" and critics have charged that it will harm LGBT individuals.",
    "Polis has previously suggested that Disney relocate to Colorado and also criticized DeSantis for comments about Twitter at a time when the company appeared to be trying to prevent is acquisition by Elon Musk.",
    "Colorado Governor Jared Polis has compared Florida Governor Ron DeSantis' actions to Russian President Vladimir Putin as he pitches his state as a new home for the Walt Disney Company's Florida theme parks.",
    "The move to dissolve RCID came amid a dispute between Disney and the DeSantis administration over the controversial Parental Rights in Education law, which critics have dubbed the \"Don't Say Gay\" law.",
    "Polis told MSNBC's Chuck Todd that his state was \"open for business\" and said that DeSantis had \"attacked Disney because of their political advocacy for LGBT rights.\"",
    "\"In Colorado, I don't care if your organization is conservative or liberal, I don't care what your healthcare plan does but we have a home for you,\" Polis said.",
    "Disney had faced some criticism for not initially opposing the law but later committed to support attempts to have the law repealed or overturned in the courts.",
    "Polis was referring to the Russian president as well as the late Venezuelan President Hugo Chvez and his successor, Nicols Maduro - all authoritarian figures.",
    "\"You have the freedom to have your political opinion, whatever it is, and of course the state is not going to have retribution against you because of that.",
    "The governor said a lot of companies were moving to Colorado but he would have to see whether Disney World would be one of them.",
    "\"Hey @Disney we're ready for Mountain Disneyland and @twitter we're ready for Twitter HQ2, whoever your owners are,\" he wrote.",
    "The district is set to be dissolved by June, 2023 and there are major questions about how its debts will be paid.",
    "In CO, we don't meddle in affairs of companies like @Disney or @Twitter,\" Polis tweeted on April 19.",
    "\"Florida's authoritarian socialist attacks on the private sector are driving businesses away.",
    "\"We don't interfere - or we don't retaliate based on your politics,\" the governor went on.",
    "\"That's what Putin does, that's what Chvez did, and Maduro.\"",
    "Newsweek has asked Ron DeSantis' office for comment.",
    "\"This is not what America's about,\" Polis went on."
  ]
}