{
  "id": 3883,
  "mediaId": 237,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "'Ultra-MAGA agenda': Quotes of the Week",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/9b0cebd/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F5c%2Fb5%2Fc0dfbe16464099ceb393a78fceda%2Fap22121102624601.jpg",
  "link": "https://www.washingtonexaminer.com/news/ultra-maga-agenda-quotes-of-the-week",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Washington Examiner Staff",
  "authorUrl": "https://www.washingtonexaminer.com/author/washington-examiner-staff",
  "termIds": [
    661,
    1024,
    1147,
    1223,
    1341,
    1765,
    2087,
    2282,
    2505,
    2517,
    2661
  ],
  "sentences": [
    "In principle, it seems as though by moderating demand we could see [job] vacancies come down as a result  and I think put supply and demand at least closer together than they are, and that would give us a chance to get wages down and then get inflation down without having to slow the economy and have a recession and have unemployment rise materially.",
    "Im excited to be here tonight with the only group of Americans with a lower approval rating than I have.?\n- President Joe Biden shows hes got jokes during his speech at the White House Correspondents' Dinner\nRepublicans seem to support one fella, some guy named Brandon.",
    "Now, I would say I think we have a good chance to have a soft, or a softish, landing or outcome, if you will.?\n- Federal Reserve Chairman Jerome Powell sees a path to bringing down inflation without crashing the economy, although he said it will be challenging.",
    "By every indication, this was yet another escalation in the radical lefts ongoing campaign to bully and intimidate federal judges and substitute mob rule for the rule of law.?\n- Senate Minority Leader Mitch McConnell (R-KY) on the leak.",
    "Psaki's characterization is a desperate attempt by the spokeswoman for the Ministry of Truth to suggest that there was anything like the Biden Ministry of Truth in the works in the last administration  there was not.\"",
    "On the Ministry of Truth being established by Secretary [Alejandro] Mayorkas, a notably nonneutral participant in the body politic, this is obviously outrageous to an extent that George Orwells eyebrows would go up.",
    "First, now that the court is poised to strike down Roe, it is my intention for the Senate to hold a vote on legislation to codify the right to an abortion in law.?\n- Senate Majority Leader Chuck Schumer on the leak.",
    "To the extent this betrayal of the confidences of the court was intended to undermine the integrity of our operation, it will not succeed.?\n- Chief Justice John Roberts hits out at whoever leaked the draft.",
    "I think that after the election, my goal would be, if we win the election really big, people like you who analyze these things are gonna say, 'The days of Florida being a swing state are over.'",
    "- Former Trump-era DHS Deputy Secretary Ken Cuccinelli counters statements by White House press secretary Jen Psaki that the disinformation board dates to 2020 and the Trump administration.",
    "The past week began with the fallout of the White House Correspondents' Dinner, where President Joe Biden cracked jokes at his own expense and took a ribbing from comedian Trevor Noah.",
    "However, by midweek, the story had changed dramatically, with a bombshell leaked draft opinion from the Supreme Court that appears to indicate the future of Roe v. Wade is on the line.",
    "And it will fall on voters to elect pro-choice officials this November.?\n- Biden calls on voters to vote for pro-abortion rights candidates during the midterm elections.",
    "Who ever thought wed see the day when a senator could be openly bisexual but a closeted Republican??\n- Host Trevor Noah takes a shot at Sen. Kyrsten Sinema (D-AZ).",
    "Florida is a red state, and I think that's because of a lot of what we've done.?\n- DeSantis has lofty goals for the next election on the future of Florida.",
    "\"The president said today, 'What happens if you have states change the law saying that children who are LGBTQ cant be in classrooms with other children?'",
    "\"If the court does overturn Roe, it will fall on our nations elected officials at all levels of government to protect a womans right to choose.",
    "- New Twitter owner Elon Musk denies a report former President Donald Trump subtly influenced his decision to acquire the social media giant.",
    "Hes having a really good year, and Im kinda happy for him!?\n- Biden makes a joke at his own expense, owning the Lets Go Brandon meme.",
    "Ive had no communication, directly or indirectly, with Trump, who has publicly stated that he will be exclusively on Truth Social.\"",
    "- Biden appears to have adopted new messaging on the \"Make America Great Again\" crowd in the wake of the Supreme Court draft leak.",
    "Ron DeSantis hits out at Noah after the comedian made jokes seemingly made to look like the Florida Republican was in the crowd.",
    "Does this mean that in Florida they can decide they're going to pass a law saying that same-sex marriage is not permissible?\"",
    "\"Representation matters, and she will give a voice to many but also make many dream big about what is truly possible.\"",
    "Its relatively normal in the afternoon, but as soon as the sun goes down?\n- Noah compares Fox News to a Waffle House.",
    "Because this MAGA crowd is really the most extreme political organization thats existed in American history.\"",
    "But for them to advertise me when that invitation was rejected by my office, that is a lie.?\n- Gov.",
    "- Biden talks about how he reduced the deficit by $350 billion in his first year in office.",
    "- Karine Jean-Pierre on being named the White House's new press secretary, replacing Psaki.",
    "- Biden questions if the Roe v. Wade decision will lead to future rollbacks of other laws.",
    "- Fox News reporter Peter Doocy asks Psaki what Biden is actually referring to here.",
    "I don't want to hear Republicans talk about deficits and their ultra-MAGA agenda.\"",
    "[Psaki] has been a great friend, mentor, and excellent press secretary.\"",
    "I look forward to serving this administration and the American people.",
    "\"If this decision holds, it's really quite a radical decision.",
    "\"What are the next things that are going to be attacked?",
    "I've not had a chance to thoroughly go into the report.",
    "- Psaki hails her replacement Jean-Pierre.",
    "So, I never, I would never attend that.",
    "I want to make three things clear.",
    "Here are the quotes of the week.",
    "I have no interest in that.",
    "I do not care what they do.",
    "So there is a path to that.",
    "What is he talking about?\"",
    "I have big shoes to fill.",
    "\"It is a true honor.",
    "I did not watch it.",
    "\"This is false.",
    "Just In...",
    "...",
    "..."
  ]
}