{
  "id": 3886,
  "mediaId": 136,
  "date": "d2022-05-07T00:02",
  "headline": "Trump Lawsuit Against Twitter, Jack Dorsey Tossed by California Judge",
  "image": "https://d.newsweek.com/en/full/2033198/donald-trump-rally.webp?w=790&f=cddd574536649447b3073e8b600721e8",
  "link": "https://www.newsweek.com/trump-lawsuit-against-twitter-jack-dorsey-tossed-california-judge-1704479",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Thomas",
  "authorUrl": "https://www.newsweek.com/authors/jake-thomas",
  "termIds": [
    661,
    1147,
    2394,
    4419,
    153,
    177,
    539,
    2590,
    2661
  ],
  "sentences": [
    "The lawsuit attempted to use Florida's Stop Social Media Censorship Act, a bill signed by Florida Governor Ron DeSantis last year that gives residents the right to sue social media companies that enforce their community standards unevenly.",
    "Donato, based in the Northern District of California, also threw out a related argument that Twitter was effectively operating as the government and suspended Trump in response to pressure from his political opponents.",
    "But the judge pointed out that Trump and others had already agreed that California law will govern disputes between Twitter after they consented to the platform's terms of service.",
    "A federal judge has dismissed a lawsuit by former President Donald Trump against Twitter and its former CEO that argued he and other conservatives had been illegally censored.",
    "The lawsuit also took aim at Section 230 of the 1996 Communications Decency Act, which exempts companies like Twitter and Facebook from liability for content posted by users.",
    "\"Twitter is a private company, and the First Amendment applies only to governmental abridgements of speech, and not to alleged abridgements by private companies.'\"",
    "Following the January 6 insurrection where a pro-Trump mob stormed the U.S. Capitol, Twitter banned the then-president from its platform for inciting violence.",
    "California District Judge James Donato on Friday concluded that Twitter's move to suspend Trump from the platform didn't violate his First Amendment rights.",
    "But Donato found that Trump offered \"only the vague and speculative allegation\" that Twitter would not have removed him if it did not have this immunity.",
    "Section 230 has drawn the ire of conservatives who argue its been used by social media companies to remove right-leaning content from their platforms.",
    "He continued that there is \"a major concern about the enforceability\" of the law after another federal judge blocked Florida from enforcing it.",
    "Later that summer, Trump filed the lawsuit against Twitter and its then-CEO Jack Dorsey to regain his account, a hallmark of his presidency.",
    "However, Donato's order allowed Trump and his allies to file an amended complaint that may not add any new claims without prior approval.",
    "Trump was initially joined by the American Conservative Union and Linda Cuadros, whose account was suspended for a post over vaccines.",
    "Donato wrote that Trump's suspension and most of the others who joined his lawsuit occurred before the new law went into effect.",
    "Additionally, the law allows these companies to take down content that violates community standards or is deemed inappropriate.",
    "Additionally, Trump's lawsuit alleged Twitter violated the Florida Deceptive and Unfair Trade Practices Act.",
    "The dismissal is the latest in an ongoing debate over the limits of free speech on social media.",
    "The judge also blocked Trump's attempt to use Florida laws against the social media giant.",
    "\"Plaintiffs are not starting from a position of strength,\" Donato wrote in his dismissal.",
    "Newsweek has reached out to Trump for comment."
  ]
}