{
  "id": 3889,
  "mediaId": 209,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Where major companies stand on reproductive health care policies",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-desktop@1/v1651853041/supreme%20companies.jpg",
  "link": "https://theweek.com/feature/1013287/where-major-companies-stand-on-abortion-rights-the-scotus-leak",
  "sentiment": "0",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brigid Kennedy",
  "authorUrl": "https://theweek.com/authors/brigid-kennedy",
  "termIds": [
    661
  ],
  "sentences": [
    "Here's where tech giants and leading businesses stand so far:\nAirbnb: 'We will work to make sure our employees have the resources they need'\nIn a request for comment regarding the leaked opinion and its resulting expected effect on employee healthcare, vacation rental company Airbnb told The San Francisco Standard that the company's \"healthcare coverage supports reproductive rights and we will work to make sure our employees have the resources they need to make choices about their reproductive rights, as we committed to last fall\" in the wake of Texas' extreme, six-week abortion ban.",
    " Bill Gates (@BillGates) May 3, 2022\nEconomy: Surprise slump brings stagflation fears\nU.S. economy adds 428,000 jobs in April\nThe daily business briefing: May 6, 2022\nHow Dems can make abortion a winning issue\nPentagon: 'No impact' from Russia's attempts to strike arms flowing into Ukraine\nShut NATO's door to Ukraine  permanently\nStephen Colbert's Late Show unmasks 'Pro-Life Spider-Man'",
    "Per a Wednesday report from The New York Times, businesses who appear yet to directly comment on the draft ruling include PricewaterhouseCoopers, Oracle, JP Morgan Chase, Walmart, Disney, ThirdLove, Patagonia, Kroger, and Meta (though Sheryl Sandberg did post on Facebook, writing that \"this is a scary day for women all across our country\").",
    "Uber and Lyft: Creating legal defense funds\nBoth Uber and Lyft each announced in September they'd be creating legal defense funds to help drivers sued under the Texas law, which financially incentivizes and deputizes private citizens to sue anyone who aids or abets an abortion (including ride-sharing drives) after six weeks of pregnancy.",
    "Amazon: Up to $4,000 a year in travel expenses\nAmazon, the nation's second-largest private employer, has offered to cover up to $4,000 a year in travel expenses for employees seeking non-threatening medical care, including abortions, if said care is unavailable within 100 miles of their residence and virtual care is not possible.",
    "CVS Health: 'We've made out-of-state care accessible and affordable'\nIn response to a request for comment on the draft opinion from Fortune, CVS offered the following: \"We're monitoring the situation closely and evaluating how we can best support the coverage needs of our colleagues, clients, and consumers.",
    "UTA: 'The right to choose  has been a bedrock'\nHollywood's United Talent Agency also responded to the draft ruling by notifying its employees it would reimburse travel expenses related to reproductive health services unable to be accessed within their state.",
    "Levi Strauss: 'Business leaders need to make their voices heard'\n\"Given what is at stake, business leaders need to make their voices heard and act to protect the health and well-being of our employees,\" Levi Strauss wrote in a statement released Wednesday.",
    "Yelp: 'Turning back the clock  will have a seismic impact'\nOnline review website Yelp has been outspoken in its opposition to an overruling of Roe, warning such a decision from the court would have a \"seismic impact on our society and economy.\"",
    "Citigroup subsequently came under fire for its decision; House Republicans urged the U.S. to cancel government contracts with the bank, and a Texas lawmaker threatened to introduce a bill preventing Citigroup from underwriting municipal bonds.",
    "The latest blurring of the lines between business and politics, however, was sparked by the leaked draft majority opinion suggesting the Supreme Court is poised to overturn federal abortion rights as protected under 1973's Roe v. Wade.",
    "Citigroup: A target of House Republicans\nIn March, Citigroup became the first major bank to announce it would pay travel costs for employees affected by the abortion ban in Texas, where it employs over 8,000 workers.",
    "Salesforce: Helping employee families relocate out of Texas\nSoftware company Salesforce offered in September to help employees and their families relocate out of Texas following the passage of its abortion law.",
    "\"In response to changes in reproductive health care laws in certain states in the U.S., beginning in 2022 we provide travel benefits to facilitate access to adequate resources,\" the bank said in a filing.",
    "\"In the meantime, we want to remind you that our benefits at Apple are comprehensive, and that they allow our employees to travel out-of-state for medical care if it is unavailable in their home state.\"",
    "\"Several states have already introduced restrictive legislation, and the draft Supreme Court ruling leaked yesterday, if it comes to pass, could make abortion illegal in more than half of the country.\"",
    "A reversal of Roe v. Wade would set us back 50 years and disproportionately impact the most vulnerable women in society.I support a woman's right to make their own decisions about their health care.",
    "It seems Microsoft has also stayed silent on an expected Roe reversal, though company co-founder and billionaire Bill Gates weighed in on Twitter:\nI was shocked to wake up to the news this morning.",
    "In September, both Bumble and fellow dating app service Match Group separately announced they would each be launching relief funds for Texas employees in need of out-of-state abortion care.",
    "It's becoming increasingly difficult for companies to remain silent on controversial social issues  take the bitter, LGBTQ-related standoff between The Walt Disney Company and Florida Gov.",
    "It appears Apple's policy has been in place since at least September 2021, when it confirmed to TechCrunch that it was keeping an eye on the legal challenges surrounding the Texas ban.",
    "Apple: 'Actively monitoring the legal proceedings'\nTech giant Apple, which has a large presence in Texas, has said its health insurance covers both abortions and related travel fees.",
    "\"Turning back the clock on the progress women have made over the past 50 years will have a seismic impact on our society and economy,\" Yelp continued in its statement on the matter.",
    "\"As I have said before, the company generally does not take political stands unless it is relevant to our business,\" Match Group CEO Shar Dubey said in a memo at the time.",
    "\"The headlines today regarding the leaked draft opinion to overturn abortion rights in the United States are profoundly unsettling,\" the company wrote on Twitter.",
    "\"We're doing this to support the right to choose that has been a bedrock of settled law for almost half a century,\" CEO Jeremy Zimmer said in a memo to employees.",
    "Prior to the Monday evening leak, Yelp had announced it would be covering expenses for employees and their spouses who must travel out of state for abortion care.",
    "The clothing brand is also reimbursing employees for travel expenses incurred while seeking health-care services unavailable in their state, including abortions.",
    "\"This goes against the will of the vast majority of Americans who agree that decisions around reproductive care should be made by women and their doctors.\"",
    "Bumble and Match Group: 'We believe strongly in women's right to choose'\nOnline dating app Bumble commented on Monday's draft leak the following evening.",
    "\"We've made our perspective on this quite clear,\" Lyft co-founder and President John Zimmer told The Wall Street Journal on Tuesday, after the leak.",
    "\"We are actively monitoring the legal proceedings challenging the uniquely restrictive abortion law in Texas,\" Apple wrote in an employee memo.",
    "The policy arrived in response to a restrictive six-week ban out of Texas, but the benefit extends to employees in other states, as well.",
    "We've made out-of-state care accessible and affordable for employees in states that have instituted more restrictive laws.\"",
    "\"So we will continue to look for ways to make a difference, to speak out and to, most importantly, take action.\"",
    "\"At Bumble, we believe strongly in women's right to choose and exercise complete control over their bodies.\"",
    "Salesforce did not take an explicit stance on the Texas law in its statement, CNN noted at the time.",
    "Mirian Warren, the company's chief diversity officer, has said Yelp is not concerned about backlash.",
    "\"But in this instance, I personally, as a woman in Texas, could not keep silent.\"",
    "Both companies recently extended the same coverage to drivers in Oklahoma.",
    "Lyft also previously pledged to donate $1 million to Planned Parenthood.",
    "Part-time hourly workers are able to seek reimbursement, as well.",
    "The company also called on Congress to codify Roe into law.",
    "\"That means protecting reproductive rights.\"",
    "Ron DeSantis (R) as a recent example."
  ]
}