{
  "id": 3902,
  "mediaId": 237,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Jewish heritage museum staff attempt to ban DeSantis from premises: Report",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/31829f2/2147483647/strip/true/crop/5491x2883+0+389/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F20%2Ffa%2Fda0773324d998452b380e94ae93a%2Fap22077407868405.jpg",
  "link": "https://www.washingtonexaminer.com/news/jewish-heritage-museum-staff-attempt-to-ban-desantis-from-premises-report",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jenny Goldsberry",
  "authorUrl": "https://www.washingtonexaminer.com/author/jenny-goldsberry",
  "termIds": [
    661,
    1154,
    2031,
    2192,
    2264,
    4302,
    3426,
    3584,
    2826
  ],
  "sentences": [
    "When the two confronted museum CEO Jack Kliger, he reportedly told them, Don't do politics ... whether left or right.? Meanwhile, it hosted Rep. Jerry Nadler (D-NY) and then-Councilman Bill de Blasio in 2009, Rep. Alexandria Ocasio-Cortez (D-NY) in 2018, and then-Gov.",
    "Staff reportedly told Abrams and Cohen that \"DeSantis didnt 'align with the museums values and its message of inclusivity,'\" the two wrote in an opinion piece Thursday.",
    "\"We welcome Governor DeSantis and elected officials from across the spectrum to visit the Museum of Jewish Heritage  A Living Memorial to the Holocaust for a tour.\"",
    "They claimed to have picked the Florida governor \"to discuss how the 'Florida model' has contributed\" to the recent \"Jewish renaissance underway.\"",
    "The museum has since denied all allegations in a string of tweets Friday, claiming the situation was \"not a free speech or censorship issue.\"",
    "Elliott Abrams and Eric Cohen, two executives of the Tikvah Fund and conference organizers, planned to host the event at the museum.",
    "\"No contract with the Tikvah Fund was ever signed for this rental event to be held at the Museum and no deposit was ever made.\"",
    "\"Today we responded to a factually inaccurate opinion piece in [the Wall Street Journal] about a proposed rental event.",
    "Florida is home to the third-largest population of Jewish people in the nation, according to data from 2020.",
    "Ron DeSantis (R-FL) from speaking at a Jewish Leadership Conference, according to its organizers.",
    "Abrams and Cohen wrote that they still plan to go on with the event, with DeSantis as a speaker.",
    "The staff there reported to them that DeSantis wouldn't be allowed on the museum grounds.",
    "\"The Tikvah Fund is trying to create a fight where none exists,\" the thread continued.",
    "Staff at the Museum of Jewish Heritage in New York City attempted to ban Gov.",
    "Let us be clear: No one was banned or cancelled,\" the museum's tweet read.",
    "Andrew Cuomo in 2020."
  ]
}