{
  "id": 3903,
  "mediaId": 675,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "The LGBTers are screaming, which means we're over the target",
  "image": "https://www.wnd.com/wp-content/uploads/2020/11/LGBT-pride-gay-fist.jpg",
  "link": "https://www.wnd.com/2022/05/lgbters-screaming-means-target/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Lively",
  "authorUrl": "https://www.wnd.com/author/slively/",
  "termIds": [
    661
  ],
  "sentences": [
    "Harvey Milk, Jim Jones (of Jonestown), Obama bundler (and Human Rights Campaign founder) Terry Bean, Portland Mayor Sam Adams, Seattle Mayor Ed Murphy, Kevin Spacey, recently convicted Ed Buck, Obama \"Safe Schools Czar\" and GLSEN founder Kevin Jennings and most of the founders of the American LGBT movement going all the way back to the 1920s are proven or plausibly accused pederasts.",
    "And the final phase of that century-long plan is the wholesale recruitment of our children and grandchildren into their movement as the final victim class, fighting the \"oppressive\" older generations to win their right to sexual self-determination, meaning the right to indulge in any fantasy in the realm of sexual anarchy and to punish those who get in their way.",
    "The inertia of \"traditional values\" ensured that resistance to their agenda would continue on a steadily declining scale as propagandized youth replaced traditionalist elders, but now the left believes it is so close to making our dissent irrelevant, they've dropped their pretense and broken out in a mad dash for the finish line.",
    "This is the reason women (the softer-hearted sex) in general and liberal women (and girly men) in particular are the most susceptible to LGBT propaganda, and frankly to all appeals to \"victimhood\" (except the actual victimhood of unborn babies, which is suppressed at all costs behind obscurantist euphemisms).",
    " Queen Gertrude, in \"Hamlet,\" by William Shakespeare (paraphrased)\nOne of the first things I learned as a newly minted pro-family activist in the late 1980s was that the closer one hits the mark in stating truths unfavorable to the LGBT cause, the more vocal and violent is the activists' outrage.",
    "The much larger agenda of the long-term LGBT vision is to recruit ALL the children into the ideology of sexual anarchy in which there are no boundaries to sexual conduct, and in which homosexual experimentation with each other is the means to determine one's own \"sexual identity.\"",
    "For helpful guidance on pro-family activism, including extensive material on taking back the schools, read Dr. Lively's book \"Redeeming the Rainbow: A Christian Response to the \"Gay\" Agenda\" available without charge here: https://www.scottlively.net/subscribe/.",
    "Politics\nCommentary\nPatrice Lewis\nBrent Smith\nBarbara Simpson\nRead all of today's COMMENTARY...\nU.S.\nWorld\nMoney\nHealth\nEducation\nFaith\nDiversions\nMORE COMMENTARY\nScott Lively\nLt. Col. James Zumwalt\nDaniel Joseph\nRead all of today's COMMENTARY...\nNew Section",
    "And given that one's first sexual climax is the human psychological equivalent to \"imprinting\" among birds, the percentage of children who then decide they are \"gay\" grows (and has grown) exponentially.",
    "And yet, homosexual pedophiles are definitely NOT the majority of LGBTs, especially when you include lesbians, whose sexual attraction to minors is much less common than among men, in my observation.",
    "HOWEVER, the good news in this analysis is that Trump and the MAGA movement have proved that we still have a sizable traditionalist majority, no matter what the lying media want us to believe.",
    "As this liberation campaign picks up steam, let's determine to take back all the ground and fully restore God's standards on sex and family that blessed our nation for so many generations.",
    "Pederasty, or sex between adult men and pubescent boys, is a sub-category of pedophilia and has been the core of male homosexual culture going back even before the Greeks of Plato's time.",
    "The LGBT pedophile is focused only on satisfying his own perverse sexual cravings which are, of course, terrible crimes that must be prevented if possible, and harshly punished if not.",
    "If a group can plausibly define themselves as a victim class, the liberals will support them even to the point of excusing rioting and murder against their \"oppressors\" (e.g.",
    "The whole world has watched the left's immediate full-throated, all-hands-on-deck counter-attack in support of Disney and public school grooming policies after Florida Gov.",
    "wail the teachers and administrators whose elementary-school grooming tactics and agenda are now being systematically exposed to a nation of shocked and angry parents.",
    "I noticed it first regarding public comments pointing out the obvious, factual association of AIDS with sodomy: extreme, rend-your-garments level over-reaction.",
    "It was a defining characteristic of the early Nazi Brownshirts and is the common denominator in the few homosexual crimes that still make the news these days.",
    "These children ARE victims, but victims of the sexual deviants our society has allowed to infiltrate and commandeer every major social institution we have.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "We started losing this war back in the 1980s when we accepted the false premise that \"discrimination\" against sexual perversion is \"morally wrong.\"",
    "1 is this: Regarding facts that threaten the LGBT agenda, the more consequential the truth being told, the more anguished the LGBT screams.",
    "If you appreciate our Christian journalists and their uniquely truthful reporting and analysis, please help us by becoming a WND Insider!",
    "Proportionally, the percentage of pedophiles is much higher among LGBTs than in the larger society, especially among homosexual men.",
    "The \"sexual revolution\" has been their vehicle, which they, not their heterosexual co-conspirators, have been driving all along.",
    "These upside-down arguments are literally diabolical  a tactic of diablo, the devil, who always calls good evil and evil good.",
    "Have you seen ANY public discussion on the still sky-high correlation of AIDS and receptive anal intercourse since the 1980s?",
    "I observed it again in response to my book \"The Pink Swastika\" thoroughly documenting the homosexual roots of the Nazi Party.",
    "And ironically, that majority is actually growing larger with every illegal alien the Democrats lure across the border.",
    "We don't use the word \"recruiting\" related to the homosexual movement, because of LGBT tantrums in the 1980s and 90s.",
    "Grooming is associated almost exclusively with pedophilia, but even in the LGBT community, pedophiles are a minority.",
    "Even more insidiously, these groomers and their powerful network of defenders are adding \"These children are victims!",
    "But the most violent LGBT reactions have always been triggered by exposing their homosexual recruitment of children.",
    "Parents are taking back school boards and big corporations are rethinking their \"wokeness\" as Disney stock plummets.",
    "Also, if you are within driving distance of Oklahoma City, you are invited to attend the God's Voice conference.",
    "The entire left is screaming like banshees that \"grooming\" is a lie, proving that we're precisely on target.",
    "Focusing only on the pedophile aspect of recruiting blinds us to the bigger and more dangerous phenomenon.",
    "2 is this: That tactic actually works by triggering a primal \"rescue the victim\" impulse in fellow humans.",
    "Our new anti-grooming battlefront is starting to drain the LGBT swamp like I never thought would happen.",
    "Have you seen ANY public debate on the heavily documented homosexual roots of the Nazi Party ever?",
    "What the LGBT movement wants, and has largely achieved, is total cultural and political hegemony.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "That flipped logic on its head and essentially criminalized biblical values on sex and family.",
    "LGBT tantrums have worked spectacularly to suppress truths they don't want discussed.",
    "If you legally can't discriminate against something, you make it impossible to stop.",
    "The LGBT stranglehold on academia (and every other arm of leftism) is living proof.",
    "But it is limited to just those children they get their hands on through grooming.",
    "It's not rational, but it's a real thing, and it is central to Marxist strategy.",
    "That, more than any other factor, would truly make America great again.",
    "The LGBT ideology, on the other hand, is demonic and thus irredeemable.",
    "For 25 years, WND has boldly brought you the news that really matters.",
    "Have you seen the media admit the existence of an LGBT \"agenda\" ever?",
    "(They may be invaders, but they're mostly pro-family invaders.",
    " of systemic societal and parental ignorance and bigotry.\"",
    "Let's talk about how grooming works as a practical matter.",
    "The fury that unleashed was like kicking a hornets' nest.",
    "And let's not stop this time, just because they scream.",
    "You won't truly be well until the cancer is purged.",
    "3: Half-Measures Cannot Defeat an Implacable Foe.",
    "It's like the fight against cancer in your body.",
    "Grooming is roughly synonymous with recruiting.",
    "\"The groomer doth protest too much, methinks!\"",
    "The cancer is the agenda, not the people.",
    "This culture-war is a zero-sum game.",
    "It is time to remember Precept No.",
    "But's it's a more accurate term.",
    "The proof is in the pudding.",
    "The people are salvageable.",
    "God has a sense of humor.)",
    "Unfortunately, Precept No.",
    "Ron DeSantis exposed them.",
    "\"We're the victims, here!\"",
    "It's a forbidden term.",
    "Black Lives Matter).",
    "Got that, \"Boomer\"?",
    "So, Precept No.",
    "Details here."
  ]
}