{
  "id": 3905,
  "mediaId": 65,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Florida ICE offices see massive lines, processing delays as hundreds of migrants wait for check-ins",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8ec38373-26fc-434e-8b9e-409a09e1a33d/7c6c62ff-96c8-43ed-a09f-65e0f313519e/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/florida-ice-offices-lines-delays-migrants-check-ins",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Adam Shaw",
  "authorUrl": "https://www.foxnews.com/person/s/adam-shaw",
  "termIds": [
    661,
    3594,
    3596,
    2643,
    2661,
    2851
  ],
  "sentences": [
    "ICE PREPARING FOR HISTORIC BORDER SURGE, SAYS MIGRANT ARRIVALS COULD TRIPLE\nMigrants who are not being expelled via Title 42 or expedited removal are being released into the U.S. either via humanitarian parole or with a notice to report to their local ICE facility when they get to wherever it is they choose to live.",
    "Immigration and Customs Enforcement (ICE) offices in Florida are seeing massive lines and lengthy delays as scores of migrants look to check in with officials -- just as the U.S. is releasing tens of thousands of illegal immigrants into the country each month amid an historic and overwhelming border crisis.",
    "LEAKED ICE DOC SHOWS ALTERNATIVES TO DETENTION PROGRAM HAS LITTLE VALUE BUT SIGNIFICANT EXPENSE\nICE says the COVID-19 pandemic has exacerbated delays in processing and that it is making improvements to staffing and processing in order to limit the delays.",
    "\"Noncitizens who were recently apprehended by U.S Customs and Border Protection (CBP) along the southwest border and given a notice to report (NTR) or parole must check-in with ICE after arriving at their destination.\"",
    "The agency has urged immigrants to make appointments using the ICE appointment scheduler, launched in September, that it says may help them avoid traveling to an ICE office to make an appointment on a walk-in basis.",
    "The Florida legislature has included $12 million in its budget to fund efforts to relocate illegal immigrants to more elsewhere in the country, including President Bidens home state of Delaware and Marthas Vineyard.",
    "Reps. Darren Soto, D-Fla., and Stephanie Murphy, D-Fla., have written to both Homeland Security Secretary Alejandro Mayorkas and acting ICE Director Tae Johnson urging them to deal with the delays.",
    "More than 221,000 migrants were encountered in March, and that number is expected to rise in the months ahead -- particularly with the end of the Title 42 public health order later this month.",
    "The Miramar Police Department confirmed to Fox News last month that it has met with ICE officials \"in regards to sporadic traffic concerns and has worked with them to address the issue.\"",
    "ICE said in August 2020 that there were approximately 3.3 million people on the \"non-detained docket,\" meaning those who are in immigration proceedings but are not being detained.",
    "\"Life will not be easy for you, because we are obligated to uphold the immigration laws of this country, even if our federal government and other states wont,\" the statement said.",
    "In a statement to Fox News Digital this week, an ICE spokesperson said that the agency \"is working to address current processing delays at some ICE offices.\"",
    "The lines include both recent arrivals and illegal immigrants who are checking in, including those being taken off Alternatives to Detention (ATD).",
    "But media outlets have reported how they are lined up around the block, sleeping in cars, setting up tents as they wait for their appointments.",
    "The ICE facility in Orlando has seen hundreds lined up outside in the Florida heat as they wait for their mandated check-in with ICE officials.",
    "ICE has warned recently that it expects its number of new arrivals to triple in the months ahead as it warns of an \"historic border surge.\"",
    "Florida is one of the most popular destinations for migrants given the high number of immigrants, both legal and illegal, already there.",
    "\"Addressing the current backlog at the Orlando ICE facility is vital to ensuring the safety of immigrants seeking refuge,\" they wrote.",
    "\"They have encouraged you to make dangerous treks, oftentimes at great physical distress to you and your family,\" the statement said.",
    "CBP statistics, meanwhile, indicate that more than one million people have been released into the U.S. since February 2021.",
    "But it is the latest sign of the pressure that ICE and CBP have been under due to the massive migrant surge at the border.",
    "\"There is a legal process to obtain full American citizenship, which is an essential part of the promise of America.",
    "The Associated Press reported that in the last week as many as 250 people have been waiting outside the facility.",
    "The governors office said that those migrants \"have been done a great disservice by the Biden administration.\"",
    "\"Sometimes, this has even meant putting your fate into the hands of dangerous coyotes and human traffickers.\"",
    "\"Florida is not a sanctuary state, and our social programs are designed to serve the citizens of our state.",
    "Similarly, the office in Miramar has seen massive lines and issues with garbage and traffic being blocked.",
    "Ron DeSantis office had a warning for those who had entered the U.S. illegally: \"Do not come to Florida.\"",
    "That order has been used to quickly expel migrants since March 2020 due to the COVID-19 pandemic.",
    "Last month, in a report delivered to Congress, ICE said that number was now 3.7 million.",
    "\"We ask that you work swiftly and diligently to investigate and address these delays.\"",
    "Meanwhile, the lines outside of the offices have also upset Democrats in the state.",
    "The governor will protect the sovereignty of the state of Florida.\"",
    "In Florida, we will uphold the law,\" DeSantis' office said.",
    "More than 65,000 migrants were released in March alone.",
    "In a statement to Fox News Digital, Florida Gov.",
    "The Associated Press contributed to this report."
  ]
}