{
  "id": 3910,
  "mediaId": 163,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Yelp, other companies take stance on abortion rights with travel benefit",
  "image": "https://www.reuters.com/resizer/LPltZ9AjIPCZnoReSbKlxpRyhjk=/1200x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/5RMZHR3UVFNPZFDLJMTPWITXTI.jpg",
  "link": "https://www.reuters.com/legal/legalindustry/yelp-other-companies-take-stance-abortion-rights-with-travel-benefit-2022-05-06/",
  "sentiment": "0",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arriana McLymore",
  "authorUrl": "https://www.reuters.com/authors/arriana-mclymore/",
  "termIds": [
    661
  ],
  "sentences": [
    "Florida Governor Ron DeSantis, a rising star in the Republican party, signed a bill in April stripping Disney of self-governing authority at its Orlando-area parks in retaliation for its opposition to a new state law that limits the teaching of LGBTQ issues in schools.",
    "read more\nSome major employers, such as Walmart Inc, Target Corp and Walt Disney Co, have declined to weigh in since the leak to Politico this week of a Supreme Court draft opinion that would overturn its 1973 decision legalizing abortion nationwide.",
    "Yelp Inc (YELP.N) was one of the first to offer support for its employees who might need to travel out of state for access to abortion, a decision the company says was made to ensure its workers have equal access to healthcare.",
    "Dozens of U.S. House Republicans in April demanded that the chamber drop Citigroup Inc as its provider of credit cards for lawmakers, after the financial institution offered to pay travel costs for employees seeking abortions.",
    "Yelp and Citigroup (C.N), Levi Strauss & Co (LEVI.N) and Amazon.com Inc (AMZN.O) have all pledged to pay for employees' travel to obtain abortions while Oklahoma, Texas and other Republican-led states clamp down on access.",
    "In order to safeguard employees and make sure that they can get the healthcare that they need, no matter what state they live in, we need a benefit like this,? Miriam Warren, Yelps Chief Diversity Officer told Reuters.",
    "By offering support for employees who may need to travel out of state for abortions, Yelp and other companies hope to gain an edge attracting and retaining talent as well as appearing socially responsible to investors.",
    "May 6 (Reuters) - Yelp Inc, Amazon.com, and Citigroup are among a small but growing number of companies rolling out policies to cover costs for American employees who need to travel out of state for an abortion.",
    "For companies who care about issues of diversity, inclusion, equity and belonging, they can't sit by and be silent on this issue because it really does impact every aspect of a woman's life,? said Yelps Warren.",
    "\"Companies must carefully navigate such issues, as to avoid offending internal stakeholders as well as the external community,\" said Izzy Kushner, president of human resources consultancy HR Impact.",
    "A crowd-sourced platform for reviews of businesses including restaurants and hotels, Yelp started this month offering the healthcare travel benefit to U.S. employees.",
    "The issue has gained urgency now that 31 states have introduced abortion bans this year, according to policy analysis by research group Guttmacher Institute.",
    "Arriana McLymore reports on the business of law, including diversity in the profession, corporate practices, legal education and attorney career life cycles.",
    "read more\nSome could be fearful of a growing trend among politicians in Republican-led states to punish companies for their stances on social issues.",
    "But speaking out on social issues can carry the risk of losing customers and employees who disagree with a company's stance.",
    "The company and law firm names shown above are generated automatically based on the text of the article.",
    "We welcome feedback, which you can provide using the feedback tab on the right of the page.",
    "We are improving this feature as we continue to test and develop in beta.",
    "I think it really comes down to equal access to care."
  ]
}