{
  "id": 3916,
  "mediaId": 558,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Yelp and others offer travel benefit for abortions",
  "image": "https://s.yimg.com/uu/api/res/1.2/3wHbMSwl6to9xigNEmbYEw--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/video.reutersnews.com/c56aeaf6f0f51a3e65f34a26baa457ad",
  "link": "https://ph.news.yahoo.com/yelp-others-offer-travel-benefit-225513806.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4085,
    4586,
    13,
    3183,
    3666,
    2661,
    2934
  ],
  "sentences": [
    "STORY: As the U.S. grapples with the likely end of Roe v. Wade, a small but growing number of companies  like Yelp, Amazon, Citigroup and Levi Strauss  are pledging to cover costs of American employees who need to travel out of state for an abortion.",
    "Florida Governor Ron DeSantis signed a bill in April stripping Disney of self-governing authority at its Orlando-area parks in retaliation for its opposition to a new state law that limits the teaching of LGBTQ issues in schools.",
    "And, you know, this particular issue is an equity issue because it impacts women's careers and their lives in a big way.?\nOther major employers, such as Walmart, Target and Walt Disney, have declined to weigh in.",
    "And dozens of House Republicans recently demanded that the chamber drop Citigroup as its provider of credit cards, after the financial institution offered to pay travel costs for employees seeking abortions.",
    "And that more really looks like a travel benefit, so that if someone is in a state where they can't access the reproductive health care that they need, they can go to another state to get it.",
    "And it could become a much-needed reimbursement especially in light of the leaked Supreme Court draft opinion indicating the court is poised to overturn the constitutional right to abortion.",
    "And when restrictive abortion bans like Texas's (bill) SB 8 came to pass, we recognized that in order to provide equal access to care for all of our employees, we would have to do more.",
    "WARREN: I think it becomes all that more important for companies to step in and make sure that they're taking care of their employees.",
    "Some companies could be fearful of a growing trend among Republican lawmakers to punish them for taking a stand on social issues.",
    "Yelp's chief diversity officer, Miriam Warren, said the decision was made to ensure its workers have equal access to healthcare.",
    "And we will reimburse the travel costs, including hotel and other associated costs.\"",
    "\"Well, abortion has always been a covered benefit in our health care plan."
  ]
}