{
  "id": 3919,
  "mediaId": 558,
  "date": "d2022-05-06T14:04",
  "headline": "As community veers right, political division tears apart Sarasota. Florida is really in turmoil",
  "image": "https://s.yimg.com/uu/api/res/1.2/S1tyLv.e55Bv62lxdZuiyw--~B/aD05MTI7dz0xMTQwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bradenton_herald_mcclatchy_articles_255/828e8067ac0f06cac9f037d029f2cb44",
  "link": "https://ca.news.yahoo.com/community-veers-political-division-tears-210438359.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tim Craig",
  "authorUrl": "",
  "termIds": [
    661,
    3508,
    2661,
    5115
  ],
  "sentences": [
    "The left-leaning activists are particularly focused on Sarasota County Commissioner Christian Ziegler  the vice-chairman of the Republican Party of Florida who is also a specialist in targeting political messages to specific demographic groups  and his wife, Sarasota School Board Member Bridget Ziegler, who helped found Moms for Liberty, a controversial conservative group advocating for more parental control in schools.",
    "And it has increasingly pitted a group of left-leaning residents against Republican officials who have offered outspoken support for many DeSantiss most aggressive policies, including empowering parents to challenge school textbooks and banning teachers from discussing sexual orientation in elementary school.",
    "I see it as darker place, as a different, more difficult place.?\nIts a fight centered around whether this traditional Republican county will remain moderate or embrace the brash brand of politics championed by DeSantis as he considers a possible presidential campaign.",
    "From county commission meetings to neighborhood association gatherings, Sarasota County has become an example of just how deeply the nations partisan divisions are bleeding into local government, curdling the relationship between residents and their civic leaders.",
    "Our state is really in turmoil,? said Jane Goodwin, chairwoman of the Sarasota School Board, who worries that her county offers a preview of the toxic politics sweeping through Florida.",
    "Ron DeSantis, R. A teacher made an emotional plea for help, saying that false accusations of wrongdoing were crippling her and other educators ability to teach.",
    "This sleepy county on Floridas west coast was once known mostly as a haven for retirees who want to enjoy sunshine and the arts.",
    "During the three-hour meeting, a conservative school board member insulted the boards attorney for second-guessing Gov.",
    "At one point, four police officers had to usher a parent from the meeting after being accused of derogatory behavior.",
    "But at a school board meeting last month, it took only a few minutes for raw bitterness to erupt.",
    "Residents here say this level of rancor in local government is no longer uncommon."
  ]
}