{
  "id": 3920,
  "mediaId": 441,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Poll Shows Risk for Republicans Backing No-Exception Abortion Bans",
  "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i1WcAUlv.dyY/v3/840x-1.jpg",
  "link": "https://www.bloomberg.com/news/articles/2022-05-06/poll-shows-risk-for-republicans-on-no-exception-abortion-bans",
  "sentiment": "0.0",
  "mediaOutlet": "Bloomberg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Teague Beckwith",
  "authorUrl": "https://www.bloomberg.com/authors/AUOfxG9Ntnc/ryan-t-beckwith",
  "termIds": [
    661
  ],
  "sentences": [
    "A broad majority of Americans in a new poll say abortion should be legal if the mothers life or health are at risk or the pregnancy is a result of rape, a potential political risk for Republican lawmakers backing bans with no exceptions.",
    "Abortion bans without exceptions for rape would go into effect in at least 11 states, if the Supreme Court overturns Roe v. Wade, as indicated by a leak of a draft opinion published by Politico this week.",
    "Meantime, the Idaho Supreme Court has temporarily blocked a law signed by Republican Governor Brad Little that would allow relatives of the potential parents to sue a doctor who performed an abortion.",
    "According to a survey by the Pew Research Center released Friday, 73% of U.S. adults favor an exception to abortion bans for the mothers life or health and 69% back an exception for rape.",
    "The survey of 10,441 U.S. adults was conducted from March 7-13, after the Supreme Court had heard arguments on a Mississippi abortion law but before the draft ruling was leaked.",
    "Last year, Republican Governor Greg Abbott of Texas signed an abortion ban with no exception for rape or incest and only a narrow exception for the mothers health.",
    "Arizona Governor Doug Ducey, Florida Governor Ron DeSantis and Oklahoma Governor Kevin Stitt, all Republicans, signed abortion bans with no exceptions this year.",
    "Within the GOP, 62% of Republican and Republican-leaning voters say they back an exception for the mothers life or health and 56% support an exception for rape.",
    "While the law would not allow rapists to file a lawsuit, it would allow their relatives to sue the doctor."
  ]
}