{
  "id": 3921,
  "mediaId": 302,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Jobless claims remain low amid DeSantis warnings",
  "image": "https://www.tampabay.com/resizer//WWqfkv_xnb1Ro0GJRCfujIVoFoc=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/4YKM4ACPQZM4OGV3KZAPQRB5TU.jpg",
  "link": "https://www.tampabay.com/news/business/2022/05/06/jobless-claims-remain-low-amid-desantis-warnings/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    2087,
    2305,
    187,
    2661,
    2926
  ],
  "sentences": [
    "Social Security --- something seniors have paid in for their whole life, and it has to be reauthorized.?\nScott, who chairs the National Republican Senatorial Committee, responded to Biden in a Fox News interview by saying that almost every sentence was a complete lie.?\nMeanwhile, DeSantis contends Florida is well-positioned to ward off any initial hits of a recession.",
    "President Joe Biden, in a speech Wednesday, touted his economic plans, which include such things as seeking to reduce the federal deficit, generating clean energy and reducing prices of prescription drugs, while raising taxes on wealthy Americans and corporations and imposing a minimum tax on billionaires.",
    "As an example, he said during a Wednesday appearance in Clearwater that there is a very good chance that the Biden administration plunges this country into a recession.?\nYou look at whats going on out of Washington, you look at the inflation thats absolutely out of control,? DeSantis said.",
    "A statement from the Feds Board of Governors pointed to a series of factors, including inflation, supply and demand imbalances related to the COVID-19 pandemic, higher energy prices and potential effects of Russias invasion of Ukraine and recent coronavirus-related lockdowns in China.",
    "DeSantis said during a Wednesday appearance in Clearwater that there is a very good chance that the Biden administration plunges this country into a recession.?\nTALLAHASSEE  Unemployment claims in Florida continue to roll in at a pre-pandemic pace and tax collections are up, but Gov.",
    "But when you have the inflation headwinds, when you have the Fed raising interest rates, when you have some of the other things that are happening in the markets, there is a possibility of seeing a downturn,? DeSantis said Tuesday during an appearance in Fort Myers Beach.",
    "Referring to former President Donald Trumps Make America Great Again? mantra, Biden tagged the Scott plan as an ultra-MAGA agenda? that will actually raise taxes on 75 million American families? and threaten the future of Social Security, Medicare and Medicaid.",
    "The announcement of the interest-rate hike came before the U.S. Department of Labor on Thursday estimated that Florida had 4,980 first-time unemployment claims last week, down from a revised count of 5,240 during the week that ended April 23.",
    "Theres no reason why a billionaire should be paying a lower tax rate than a teacher or a firefighter.?\nBiden also gave significant attention to the 11 Point Plan to Rescue America? that U.S. Sen. Rick Scott, R-Fla., has championed.",
    "DeSantis, who is running for re-election this year and is widely considered a potential 2024 presidential candidate, frequently emphasizes national issues during appearances and criticizes the Biden administration.",
    "Thats going to slow down the economy.?\nTrying to curb inflation, the Federal Reserve on Wednesday raised the baseline interest-rate range by 0.5 percentage points, the biggest single increase since May 2000.",
    "But theres nothing in the foreseeable future that would change that trajectory.?\nFloridas unemployment rate in March was 3.3 percent, according to the state Department of Economic Opportunity.",
    "Florida lawmakers and DeSantis have bolstered the state reserves, at least in part through higher-than-expected tax collections and unspent federal stimulus money.",
    "All were asking is that the very wealthiest Americans and largest corporations begin to pay their fair share --- at least part of their fair share,? Biden said.",
    "The rate, down from 5.4 percent a year earlier, represented an estimated 339,000 Floridians qualified as out of work from a labor force of 10.51 million.",
    "The statement also noted positives, such as that job gains have been robust, unemployment has declined and household spending has remained strong.",
    "DeSantis said he expects April revenue to exceed projections by about $760 million, after March collections topped a forecast by $626 million.",
    "Every five years, the Congress would have to vote to reinstate or eliminate Social Security, Medicare, and Medicaid,? Biden said.",
    "The Labor Department also projected 200,000 initial claims were filed nationally last week, up 19,000 from the prior week.",
    "Ron DeSantis is maintaining a drumbeat that federal economic policies might plunge? the nation into a recession.",
    "The Florida claims totals are similar to numbers before COVID-19 caused widespread job losses in early 2020.",
    "The new numbers put averages over the past four weeks at 5,627 claims in Florida and 188,000 nationally.",
    "I believe you should be able to make as much as you legally can, but just pay your fair share.",
    "But if you think of the things that matter, (they) are up way more than that: gas, groceries.",
    "You look at how much utilities, all these things are going up really, really significantly.",
    "Now you have the Fed is going to be raising rates to try to get a handle on this.",
    "The Department of Economic Opportunity will release an April report on May 20.",
    "Were built for the long haul,? DeSantis said while in Fort Myers Beach.",
    "Florida has been doing well, and were happy about that.",
    "Youve heard me say it before: Im a capitalist.",
    "We have no income tax, very low tax burden.",
    "They say its 8 1/2 percent.",
    "By Jim Turner"
  ]
}