{
  "id": 3923,
  "mediaId": 558,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Roe v. Wade: How corporate America has responded to the Supreme Court draft opinion",
  "image": "https://s.yimg.com/uu/api/res/1.2/90_Wj3RZiPgXckezojyKTw--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-05/85d23f30-cd7c-11ec-bcdf-38e5d74f05f4",
  "link": "https://ca.news.yahoo.com/roe-v-wade-corporate-america-203857546.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1365,
    4080,
    482,
    3393,
    3665,
    2661,
    2945
  ],
  "sentences": [
    "I mean, first of all, you have companies that have come out and said they are against overturning Roe v Wade, and there also will be supporting women who live in states where there are restrictions against abortions and actually providing them with, say, transportation to go to other states.",
    "Video Transcript\nSEANA SMITH: Critical debates lately, especially Disney with Florida Governor Ron DeSantis, but with the bombshell leak of a draft opinion from the Supreme Court, which will likely overturn Roe versus Wade, the C-suite has been mostly quiet.",
    "Yahoo Finance Editor-in-Chief Andy Serwer looks at how some of America's biggest companies have reacted so far to the news of the Supreme Court draft indicating that Roe v. Wade will be overturned.",
    "Yahoo Finance editor-in-chief Andy Serwer is digging into this issue in his column this week, and he joins us now for a preview.",
    "And that includes Walmart, Disney, the aforementioned Disney-- and you can understand, they're a little gun-shy these days.",
    "There's also probably a group of CEOs out there as well who are very much for overturning Roe v Wade.",
    "Then there are a whole bunch of companies that have said-- and there's some more that are supporting.",
    "However, they have not-- we haven't been able to find any who wanted to talk or talk on the record.",
    "ANDY SERWER: Yeah, I mean, there is sort of a range or maybe a couple of different groups, Seana.",
    "And you can see some of those names on the screen right there, like Citi and Lyft and Salesforce.",
    "But there are other companies out there that have not weighed in at all.",
    "But you can't assume that they have an opinion, one way or another.",
    "And there's no legal obligation for them to share their opinions.",
    "And increasingly they are finding they're having to do that.",
    "Andy, largely quiet, although we have heard some responses.",
    "So what are we hearing from corporate America today?",
    "In fact, often, boards would prefer that they don't.",
    "And by the way, I should mention something, Seana.",
    "American Airlines is another one as well.",
    "Companies don't have opinions, right?",
    "CEOs have opinions."
  ]
}