{
  "id": 3930,
  "mediaId": 302,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Are Florida Democrats prepared to compete? | Editorial",
  "image": "https://www.tampabay.com/resizer//sHYQR680NO0ByTFNkY9BxbxayiE=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/MXXKZ5AZ7ZECPDXFJWYH7GU6JA.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/04/are-florida-democrats-prepared-to-compete-editorial/",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    988,
    1078,
    1147,
    4081,
    3117,
    3277,
    3410,
    2661
  ],
  "sentences": [
    "And some think, due to Floridas size and recent disappointments, we should shift resources and focus elsewhere.?\nAfter years of massive investment? in turnout operations, Speed told the Herald, America Votes effort this year is shaping up to be more regionally focused and probably smaller overall.? Other groups in Florida are struggling to hire and retain staff because of the lack of interest from national donors, according to Raymond Paultre, executive director of Florida Alliance, a network of progressive donors.",
    "It often feels like a self-fulfilling prophecy,? said Andrea Mercado, executive director of the progressive organization Florida Rising, who points to an anxiety and reluctance to invest in Florida.?\nThe Sunshine State has long been home to some of the most competitive state and federal races in the country, and it burnished a national reputation after the bitter, weekslong presidential recount between George W. Bush and Al Gore in 2000.",
    "As the Miami Herald reported, America Votes, a national progressive group which has helped organize voters in the state since 2007, is one of the organizations shrinking its footprint, planning to ditch a statewide organizing effort in favor of a regionally focused one.",
    "Subscribe to our free Stephinitely newsletter\nDemocratic party officials push back against claims that Florida is becoming irrelevant, insisting the states size, electoral votes, growth and rapid diversification make Florida crucial to Republicans and Democrats alike.",
    "Even the partys messaging on long-held priorities has grown stale; Democrats criticize Republicans for dismantling public education without acknowledging that poor and minority groups are disproportionately hurt by failing schools.",
    "Paultre told the Herald that many national donors are blunt with their pessimism, saying were not on the map.? And that sense of resignation has had a compounding effect; fewer resources makes winning even tougher.",
    "The financial pullback from liberal donors is only the latest sign that Floridas reputation as a battleground state has waned, or at least has seriously tilted toward Republicans after decades of close elections.",
    "The recent reports that the U.S. Supreme Court is poised to erode abortion rights could provide an opportunity for Florida Democrats, but their recent track record on capitalizing on big issues is iffy.",
    "Many Democrats holding local office have refused to consider legislative or statewide seats, meaning, in many places, the partys most experienced candidates settle in as mayors or county commissioners.",
    "The states large and diverse population, distinct metropolitan areas and major media markets also combined to showcase the critical constituencies and policy proposals that were up for grabs.",
    "Thats exactly whats happening to Democrats in Florida, where liberal groups are cutting back on staff and voter-outreach because donors question whether Florida is still competitive.",
    "Democrats havent found nuanced messages for their traditional constituencies, such as African-Americans, or recognized the complexity of interests among Hispanic voters.",
    "But the success of former governor (and now U.S. Sen.) Rick Scott, the dual Florida victories of Donald Trump in 2016 and 2020 and the popularity of Gov.",
    "If thats the case, Democrats need to prove it with more money, better candidates, sharper political messaging and more aggressive outreach on the ground.",
    "The members of the Editorial Board are Editor of Editorials Graham Brink, Sherri Day, Sebastian Dortch, John Hill, Jim Verhulst and Chairman Paul Tash.",
    "Democrats hold but one statewide seat, are vastly outnumbered in the state House and Senate and havent occupied the governors office since 1999.",
    "Ron DeSantis, who appears a heavy favorite to win a second term in November, has changed the momentum if not the calculus for Republicans.",
    "Thats a bad sign for the party as the midterms near, and as Florida is set to play a pivotal role in the 2024 presidential election.",
    "Those offices are not the magnets for big-money outside donors or the engines behind statewide voter turnout drives.",
    "And last year, for the first time in Florida, Republicans overtook Democrats in voter registration.",
    "But Florida Democrats arent contributing much to the national picture themselves.",
    "There is a debate happening,? said Greg Speed, president of America Votes.",
    "You know a political partys in trouble when it cant even excite its base.",
    "No wonder their benefactors are looking beyond the Sunshine State.",
    "Editorials are the institutional voice of the Tampa Bay Times.",
    "No wonder independent voters are rich targets for Republicans.",
    "Follow @TBTimes_Opinion on Twitter for more opinion news.",
    "President Joe Bidens weak approval ratings dont help."
  ]
}