{
  "id": 3931,
  "mediaId": 151,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "DeSantis scrutinizes health care costs for the undocumented",
  "image": "https://static.politico.com/d3/05/ba68c9f5400bbef72003544b41ba/fineoutlogo.jpg",
  "link": "https://www.politico.com/newsletters/florida-playbook/2022/05/06/desantis-scrutinizes-health-care-costs-for-the-undocumented-00030607",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Over each of the past three years, UF has received approximately $100 million in performance funding, all of which could now be at stake.?\nDONE DEAL  Florida and Walgreen reach $683 million opioid settlement,? Tampa Bay Times Zachary T. Sampson, Josh Fiallo: Attorney General Ashley Moody announced a $683 million settlement with Walgreens on Thursday after the states lawyers argued the pharmacy chain contributed to the opioid epidemic in Florida by 'unconscionably' dispensing enormous quantities of painkillers.?\nCovid Update\nRISKS  FDA limits use of Johnson & Johnson COVID vaccine over blood clot risks, agency says,? McClatchys Julia Marnin: The use of Johnson and Johnsons COVID-19 vaccine, also known as Janssen, has been limited to 'certain individuals' over rare blood clot risks, the U.S. Food and Drug Administration announced Thursday, May 5.",
    "But with two recent legal changes and the possibility of an all-out abortion ban, everything has shifted: A 24-hour waiting period, which formally went into effect last week, is making it more difficult to get appointments and more expensive for women who travel to Florida for the procedure.?\nFALLOUT CONTINUES  From prayer to disgust, leaked Roe v. Wade draft stirs up emotion among South Florid women,? Miami Heralds Sommer Brugal, Michelle Marchante, Sarah Moreno, and Daniel Chang: After the initial shock of the leaked draft Supreme Court opinion overturning Roe v. Wade had worn off, South Florida women on Wednesday voiced reactions that ranged from livid to cautiously optimistic to concern about the future if their constitutional right to end a pregnancy, first affirmed in 1973, were taken away.",
    "Johnson is co-author of a new study that found Florida to have the most overvalued rental markets in the country, meaning the highest disparity between actual rent and what the market has historically commanded in a particular community.?\nCHOO, CHOO  Universal, SunRail, Brightline eye $1B rail expansion from Orlando airport to I-Drive,? by Orlando Sentinels Kevin Spear: A presentation Thursday called the first salvo? by Orlandos mayor shows Brightline, SunRail and Universal working toward building passenger-rail tracks from Orlandos airport to a station near the Orange County Convention Center and then to south International Drive.",
    "The Washington Post and Associated Press on Wednesday reported a deal reached with Mexico on April 26 to increase the number of expulsions, citing unnamed U.S. and Mexican officials.?\nMAKING DEALS  Tech firm makes plans for $13.1B purchase of Jacksonville mortgage company Black Knight,? Florida Times-Unions Steve Patterson: Jacksonville-based mortgage technology powerhouse Black Knight Inc. has negotiated a deal to be sold for $13.1 billion to a company that operates the New York Stock Exchange and other exchanges.",
    "Throughout my high school years, when the elevator is broken, I have to wait for people to help me down all the floors, which is highly frustrating.?\nODDS, ENDS AND FLORIDA MEN\nOOPS  Manatee County commissioner DUI investigation moves to State Attorney,? by Sarasota Herald-Tribunes Jesse Mendoza: Minutes after George Kruse crashed his white F150 pickup truck into a tree on Greyhawk Boulevard on April 20, the Republican county commissioner showed signs of impairment, according to new body camera footage.",
    " Only one reviewer complained of critical race theory in Florida math textbooks,? by Orlando Sentinels Leslie Postal, Scott Travis and Brooke Baitinger BIG BUCKS\nCOSTLY  UF to change teachings on racism or risk $100M in funding due to 'Stop WOKE' bill,? Gainesville Suns Gershon Harrell: Performance funding from the state may be on the line for the University of Florida if the public institution doesn't comply with the state's new instructional guidelines outlined in the 'Stop Woke Act.'",
    "Dubbed the Sunshine Corridor,? the tracks and station would cost roughly $1 billion, though no design has been done for a cost estimate, and are envisioned for hourly Brightline trains and quarter-hour SunRail service.?\nNEGLECT  This is wholesale neglect: Broward school let elevator maintenance slide for years,? South Florida Sun-Sentinels Scott Travis: A Broward high school student desperately needed a working elevator so he could maneuver his wheelchair up to his third-floor classes.",
    "Intercontinental Exchange Inc. also sells mortgage technology and billed the purchase of Black Knight as a step to grow its revenue from that industry while eliminating expenses from redundancies.?\nPAY UP  Florida rents are nations most overvalued but might come down, expert says,? Orlando Sentinels Floridas Trevor Fraser: Florida rents have skyrocketed over the past year, but one expert says they could do something even more shocking in the near future: come down.",
    "In Hialeah, Rebecca Brady, a mother of four and director of the Respect Life Ministry of the Archdiocese of Miami, said she has been trying to maintain a cautious optimism since she learned of the draft Supreme Court opinion overturning Roe v. Wade that Politico leaked Monday night.?\nBANNED  Ron DeSantis is persona non grata at a Holocaust Memorial,? Wall Street Journals Elliott Abrams and Eric Cohen: A remarkable Jewish renaissance is under way in Florida.",
    "Trace Davis  state Rep. Toby Overdorf  McKinley Lewis, communications director for Sen. Rick Scott  Brandon Larrabee\nFollow us on Twitter\nGary Fineout @fineout\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "So is Floridas educational system, which provides tax credits that assist many parents in sending their children to Jewish day schools.?\nThe Campaign Trail\nBIG BUCKS  Florida donors give big to pro-Trump super PAC,? POLITICOs Matt Dixon: Florida donors have poured $1.7 million into a super PAC supporting former President Donald Trump, nearly 20 percent of all outside contributions the organization has received this election cycle.",
    "Additionally, those 18 and older can opt to get the J&J shot if they would otherwise not receive a COVID-19 vaccine.?\nNOT HERE  Tracking COVID in wastewater is the future  but not in Florida,? by Tampa Bay Times Ian Hodgson: As COVID-19 testing continues to recede in Florida, it is far behind other states in tracking the virus with promising technology that relies on wastewater.",
    "The Florida Department of Health received more than $1.2 million from the federal government last summer to build a statewide system to detect.?\n Everglades Foundation sues ex-scientist who claims harassment,? by POLITICOs Bruce Ritchie\n AHCA presses FDA again for answers on Canadian drug import program,? POLITICOs Arek Sarkissian\nPENINSULA AND BEYOND\nON THE RISE  U.S.",
    "Get in touch: gfineout@politico.com\nDRIVING THE DAY\nNEW EDICT  Florida health regulator starts collecting undocumented immigrant hospital data,? by POLITICOs Arek Sarkissian: A Florida health care regulator has begun a campaign to collect hospitals data on the financial impact of treating undocumented immigrants, which was part of an executive order signed by Gov.",
    "Florida reveals why it rejected math books over critical race theory,? POLITICOs Andrew Atterbury: Floridas Department of Education on Thursday released scores of documents shedding new light on why the agency rejected dozens of proposed math textbooks over what state leaders deemed impermissible? content, including lessons on critical race theory.",
    "VOTING RIGHTS  Voting activists launch statewide election integrity campaign to help inmates charged,? Gainesville Suns Javon L. Harris: A Florida advocacy group is launching an election integrity campaign in response to an increase in arrests for voter fraud that have been made in Alachua County and in surrounding areas.",
    "Ron DeSantis' recently announced elections fraud task force.?\n Pasco state Rep. Adrian Zika says he wont run for a third term,? by Tampa Bay Times Barbara Behrendt\nTRUMP GOES LOCAL  Miami-Dade County Commission candidate Kevin Cabrera is being endorsed by Donald Trump, a rare local endorsement for the former president.",
    "Inc., a slight variation of Trumps well-known political catch phrase, is run by former Florida Attorney General Pam Bondi, who took over in Sept. 2021 after Trumps former 2016 campaign manager Corey Lewandowski faced allegations of unwanted sexual advances toward a major Trump donor.",
    "His shirt was wet, his eyes glossed with droopy eyelids, his speech slurred, and he appeared confused, according to public records obtained by the Herald-Tribune.?\n Dead shark found hanging from rafters at Florida high school,? by WESH 2 Katie Sivco\nBIRTHDAYS: State Rep.",
    "The records, nearly 6,000 pages of book examinations, show that state reviewers flagged several traces of critical race theory and inklings of social emotional learning? in proposed texts, two topics that have been explicitly targeted by the DeSantis administration.",
    "The executive order was one of the first concrete steps, but legislation followed, and funding was put in Floridas state budget to ship undocumented immigrants from Florida to other states (DeSantis has suggested taking them to Bidens home state of Delaware).",
    "Abbott recently transported undocumented immigrants from his state to Washington, D.C., and has said he wants to challenge a longstanding U.S. Supreme Court ruling guaranteeing state-funded education for all students, including those who are unodcumented.",
    "Florida Agency for Health Care Administration Secretary Simone Marstiller sent a letter Thursday to Florida Hospital Association President and CEO Mary Mayhew telling her that AHCA staffers had started to ask hospitals for the data earlier this week.",
    "The underlying executive order was designed to crack down on undocumented people being sent to Florida from the southern border, and served as the basis for contentious immigration legislation passed by lawmakers during the 2022 legislative session.",
    "For now, he doesnt wanna talk about it,? POLITICOs Meredith McGraw and Jonathan Lemire: It should be Donald Trumps crowning achievement, one that fulfilled the deepest wish many conservatives have held for generations.",
    "Response  The executive order specifically calls for an accounting for taxpayer dollars spent on the health care of illegal aliens in the state of Florida,? and is being studied by the Florida Hospital Association.",
    "Immigration fight  This is the latest prong in DeSantis vocal fight against illegal immigration in Florida, an issue he has cast a huge spotlight on as he continues his protracted fight with President Joe Biden.",
    "But DeSantis and most Republicans in Florida, where Disney operates its flagship theme park, wont return hundreds of thousands of dollars in campaign cash they received from the entertainment giant.",
    "immigration authorities will increase expulsions of Cubans and Nicaraguans arriving at the southern border back to Mexico under Title 42, a public health order that is set to expire on May 23.",
    "Three of the Supreme Court justices appointed by the former president signed onto the initial draft opinion that appears to signal the end of the landmark abortions right case, Roe v. Wade.",
    "CHANGING TIMES  Florida no longer a haven for abortion access,? South Florida Sun-Sentinels Cindy Krischer Goodman: Until now, Florida had been considered a safe haven for abortion access.",
    "Jews from the Northeast and Midwest, as well as Latin America and Israel, are migrating to the Sunshine State in significant numbers, making the Jewish communities there lively and varied.",
    "DeSantis' border battle weaves through hospitals  The DeSantis administration on Thursday asked state hospitals to tally up the cost of providing medical care to undocumented immigrants.",
    "Its now limited to those 18 and older 'for whom other authorized or approved COVID-19 vaccines are not accessible or clinically appropriate,' the FDAs statement said.",
    "The couple visited Mykonos over the summer to reportedly scout possible locations, but those plans were ditched.?\n... DATELINE TALLAHASSEE ...\nDEETS  Mystery solved?",
    "What we know,? Miami Heralds Madeleine Marr: The save-the-dates are out for the wedding of the year: Tiffany Trump is getting married this fall at (where else?)",
    "The Florida Rights Restoration Coalition says it is taking a stand in defense of convicted felons that have been charged with committing voter fraud after Gov.",
    "Floridas booming and low-tax economy is no doubt one of the attractions to young Jews seeking to build a prosperous future for themselves and their families.",
    "The fourth child of former President Donald Trump, was reportedly set to get hitched to businessman Michael Boulos in Greece this summer.",
    "But Samuel Vogel, a senior at Pompano Beach High, often found himself stuck because the schools only elevator was routinely out of order.",
    "There might be a little back-up in the rent,? said Ken H. Johnson, a professor of real estate economics at Florida Atlantic University.",
    "The elevator constantly breaks down, meaning it wont work or wont close properly,? he told the South Florida Sun Sentinel in October.",
    "DeSantis scrutinizes health care costs for the undocumented\nBy MATT DIXON\n05/06/2022 06:59 AM EDT\nGood morning and welcome to Friday.",
    "We are reviewing the request and communicating with our member hospitals,? FHA chief Mary Mayhew told POLITICOs Arek Sarkissian.",
    "border authorities will increase expulsions of Cubans and Nicaraguans back to Mexico,? Miami Heralds Nora Gamez Torres: U.S.",
    "THANKS, MOUSE  Florida Republicans won't let go of Disney's campaign cash,? by POLITICOs Gary Fineout: Florida Gov.",
    "Ron DeSantis signed in September, but just had his Agency for Health Care Administration start implementing.",
    "Women traveled here from more restrictive places, seeking the services of health clinics statewide.",
    "He pushed to strip it of a special tax status and punish its leaders for challenging his policies.",
    "Have a tip, story, suggestion, birthday, anniversary, new job, or any other nugget for Playbook?",
    "GETTIN HITCHED  Tiffany Trump has sent out save the date cards for her Florida wedding.",
    "TRUMPLANDIA AND THE SWAMP\nNO VICTORY LAPS  Trump sees the stage for Roes demise.",
    "Ron DeSantis vilified the Walt Disney Co. as dishonest? and hypocritical.",
    "Im POLITICO Florida Bureau Chief Matt Dixon, filling in for Gary Fineout.",
    "He has seemingly been in a race to the right with Texas Gov.",
    "Carbera was Florida director for Trumps 2020 campaign.",
    "Jewish schools and synagogues are rapidly expanding.",
    "The super PAC Make America Great Again, Again!",
    "Greg Abbott on immigration in recent months.",
    " Nothing official announced for Gov.",
    "Its part of an executive order Gov.",
    "dads Mar-a-Lago, Page Six reports.",
    "I have to push it closed.",
    "Thanks for reading.",
    "Ron DeSantis.",
    " WHERES RON?",
    "DeSantis."
  ]
}