{
  "id": 3932,
  "mediaId": 558,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Yelp, other companies take stance on abortion rights with travel benefit",
  "image": "https://s.yimg.com/ny/api/res/1.2/mtGHZ8Pi1LQj7dS9L4TKQg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTU3NDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/zNiIHbz0F5v6cgn8EbqkfA--~B/aD00Nzg7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/ee21db9e634bf8273587dc174a1263bc",
  "link": "https://ca.news.yahoo.com/yelp-other-companies-stance-abortion-172025055.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4586,
    3183,
    3666,
    2846,
    2934,
    2945
  ],
  "sentences": [
    "Florida Governor Ron DeSantis, a rising star in the Republican party, signed a bill in April stripping Disney of self-governing authority at its Orlando-area parks in retaliation for its opposition to a new state law that limits the teaching of LGBTQ issues in schools.",
    "By Doyinsola Oladipo and Arriana McLymore\n(Reuters) - Yelp Inc, Amazon.com, and Citigroup are among a small but growing number of companies rolling out policies to cover costs for American employees who need to travel out of state for an abortion.",
    "Some major employers, such as Walmart Inc, Target Corp and Walt Disney Co, have declined to weigh in since the leak to Politico this week of a Supreme Court draft opinion that would overturn its 1973 decision legalizing abortion nationwide.",
    "Dozens of U.S. House Republicans in April demanded that the chamber drop Citigroup Inc as its provider of credit cards for lawmakers, after the financial institution offered to pay travel costs for employees seeking abortions.",
    "In order to safeguard employees and make sure that they can get the healthcare that they need, no matter what state they live in, we need a benefit like this,? Miriam Warren, Yelps Chief Diversity Officer told Reuters.",
    "Yelp Inc was one of the first to offer support for its employees who might need to travel out of state for access to abortion, a decision the company says was made to ensure its workers have equal access to healthcare.",
    "Yelp and Citigroup, Levi Strauss & Co and Amazon.com Inc have all pledged to pay for employees' travel to obtain abortions while Oklahoma, Texas and other Republican-led states clamp down on access.",
    "A crowd-sourced platform for reviews of businesses including restaurants and hotels, Yelp started this month offering the healthcare travel benefit to U.S. employees.",
    "Some could be fearful of a growing trend among politicians in Republican-led states to punish companies for their stances on social issues.",
    "I think it really comes down to equal access to care."
  ]
}