{
  "id": 3935,
  "mediaId": 21,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Gavin Newsom delivers scorching criticism of Democrats' response to protecting Roe v. Wade: 'Where the hell's my party?'",
  "image": "https://i.insider.com/6274e88494a2c10018ee3d07?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/roe-wade-leak-gavin-newsom-slams-democrats-lackluster-response-2022-5",
  "sentiment": "0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mia Jankowicz",
  "authorUrl": "https://www.businessinsider.com/author/mia-jankowicz",
  "termIds": [
    661,
    1394,
    146,
    400,
    2590,
    2764,
    2934
  ],
  "sentences": [
    "House Speaker Nancy Pelosi and Senate Majority Leader Chuck Schumer spoke out soon after the leak, calling the draft opinion an \"abomination\" and one of the \"worst and most damaging decisions in modern history.\"",
    "Newsom has vowed to turn California into an abortion \"sanctuary,\" a promise he repeated after the leak by saying he would put forward a statewide constitutional amendment protecting reproductive rights.",
    "California Governor Gavin Newsom excoriated his own party for what he said was a lackluster response to the leaked Supreme Court draft opinion overturning Roe v. Wade in remarks made on Wednesday.",
    "His speech echoed the protests that formed outside the Supreme Court soon after the leaked draft opinion was published on Monday, where people shouted: \"Democrats, do something!\"",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "In his speech, he called conservative advances in the culture wars a \"concerted, coordinated effort\" that the left is failing to counter effectively.",
    "Ron DeSantis, as well as Democratic Sen. Joe Manchin, who said on Tuesday that he would not end the filibuster in order to codify Roe v. Wade.",
    "\"We'll be presenting that to the voters this November as an affirmative step to codify California's leadership,\" he said Wednesday.",
    "But efforts to codify Roe v. Wade into US law would likely be filibustered by Republicans, as Insider's Brent D. Grffiths reported.",
    "the Democratic governor said to assembled press and pro-choice supporters at a Planned Parenthood office in Los Angeles.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "A nationwide constitutional amendment is also exceedingly rare in US history, as Insider's Dave Levinthal reported.",
    "In his Wednesday speech, Newsom had particular ire for the Fox News host Tucker Carlson and Florida Gov.",
    "Newsom has pledged to make California a \"sanctuary\" for abortion rights if Roe v. Wade is overturned.",
    "He cited draconian abortion and education laws in Texas and Florida as examples, Fox News reported.",
    "Watch this space if privacy is not constitutionally protected, this opens up a panoply of issues.",
    "Gavin Newsom spoke at a Planned Parenthood after a SCOTUS leak threatened abortion rights.",
    "Gavin Newsom holds a news conference outside a Planned Parenthood office in Los Angeles.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "he asked of fellow Democrats, saying conservative causes are \"winning.\"",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "This is a concerted, coordinated effort and yes, they're winning.",
    "\"Why aren't we standing up more firmly, more resolutely?\"",
    "Stay up to date with what you want to know.",
    "And yes, we're not going to be defeated.\"",
    "Michael R. Blood/AP Photo\nCalifornia Gov.",
    "They're coming after you next,\" he said.",
    "Sign up for notifications from Insider!",
    "\"Why aren't we calling this out?",
    "Where's the Democratic Party?\"",
    "Where's the counteroffensive?\"",
    "So this is a profound moment.",
    "Loading Something is loading.",
    "\"Where the hell's my party?\"",
    "\"Where the hell's my party?",
    "\"Pay attention, America.",
    "Let's acknowledge that.",
    "\"That's not hyperbole.",
    "It is not hyperbole.",
    "We need to stand up.",
    "Politico reported.",
    "They have been.",
    "California Gov.",
    "he continued.",
    "They are."
  ]
}