{
  "id": 3937,
  "mediaId": 129,
  "date": "d2022-05-06T09:30",
  "headline": "The Depp Case Brings Stan Culture Into the Courtroom and More: The Week in Narrated Articles",
  "image": "https://static01.nyt.com/images/2022/05/03/science/06narrated-2/03SCI-FRYER1-superJumbo-v2.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/05/06/podcasts/johnny-depp-amber-heard-desantis-narrated-articles.html",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1539,
    3731,
    3754,
    517,
    3130,
    3582,
    2661,
    2953
  ],
  "sentences": [
    "The Timess narrated articles are made by Tally Abecassis, Parin Behrooz, Anna Diamond, Sarah Diamond, Jack DIsidoro, Aaron Esposito, Dan Farrell, Elena Hecht, Adrienne Hurst, Elisheba Ittoop, Emma Kehlbeck, Marion Lozano, Tanya Prez, Krish Seenivasan, Margaret H. Willison, Kate Winslett, John Woo and Tiana Young.",
    "  \nThey look like delis or hardware stores  a corner shop decorated with stuffed Easter bunnies, a nondescript brick building in the shadow of Interstate 95, a storefront so picturesque it was featured in the new M. Night Shyamalan movie.",
    "But they are in fact a dozen or so federally licensed firearms dealers operating in Philadelphia, where they have done brisk business in recent years meeting the demand from legal buyers in one of the nations most violent cities.",
    "A frenzied scene materializes four days a week at the Fairfax County Courthouse in Virginia as fans seek seats at the defamation trial between Johnny Depp and his ex-wife Amber Heard.",
    "At the last minute, he took his place at the front of the room  his face was covered by a rubber Nixon mask, and he was wearing a garish, oversized tuxedo and a curly fright wig.",
    "Math textbooks rejected en masse for what the state called indoctrination.? Schools and employers limited in what they can teach about racism and other aspects of history.",
    "They are also a major source of weapons used illegally, according to a new report that offers a rare glimpse into the link between legal gun sales and criminal activity.",
    "But the trial of Mr. Depp and Ms. Heard has become a case study in what happens when complex claims are filtered through the lenses of stan culture and social media.",
    "  \nComing out as bisexual in high school had been relatively easy: Maia Kobabe lived in the liberal San Francisco Bay Area and had supportive classmates and parents.",
    "While the assembled psychiatrists, mostly white men in dark suits, settled into their chairs, a disguised figure had been smuggled through the back corridors.",
    "Once the biggest traditional presidential battleground, it has suddenly turned into a laboratory of possibility for the political right.",
    "This weekend, listen to a collection of narrated articles from around The New York Times, read aloud by the reporters who wrote them.",
    "Suddenly, Kobabe was at the center of a nationwide battle over which books belong in schools  and who gets to make that decision.",
    "Kobabe expanded the material into a graphic memoir, Gender Queer,? released in 2019 by a comic book and graphic novel publisher.",
    "On the second day of the annual convention of the American Psychiatric Association in 1972, something extraordinary happened.",
    "High-profile celebrity cases have drawn a wide audience ever since Court TV began broadcasting from courtrooms in the 1990s.",
    "Then, last year, the books frank grappling with gender identity and sexuality began generating headlines around the country.",
    "So Kobabe, an illustrator, started drawing comics about wrestling with gender identity, and posting them on Instagram.",
    "Ron DeSantis has increased and flexed his power to remarkable effect, embracing policies that once seemed unthinkable.",
    "The 10-minute speech, delivered 50 years ago Monday, was a tipping point in the history of gay rights.",
    "The print run was small  5,000 copies  and Kobabe worried that the book wouldnt find much readership.",
    "  \nFlorida feels like a state running a fever, its very identity changing at a frenetic pace.",
    "Discussions of sexual orientation and gender identity prohibited in early elementary school.",
    " this is what he had asked to be called  described the secret world of gay psychiatrists.",
    "But coming out as nonbinary years later, in 2016, was far more complicated, Kobabe said.",
    "Throughout the day, people appear, carrying signs, wearing fan merch and costumes.",
    "Want to hear more narrated articles from publications like The New York Times?",
    "Special thanks to Sam Dolnick, Ryan Wegner, Julia Simon and Desiree Ibekwe.",
    "The creation of a law enforcement office to investigate election crimes.",
    "I am a psychiatrist.?\nFor the next 10 minutes, Henry Anonymous, M.D.",
    "Five articles from around The Times, narrated just for you.",
    "Florida has transformed over the past two years as Gov.",
    "The line to enter the courthouse forms before sunrise.",
    "The words available failed to describe the experience.",
    "Dozens of schools pulled it from library shelves.",
    "Nearly all of them are there for Mr. Depp.",
    "Download Audm for iPhone and Android.",
    "Abortions banned after 15 weeks.",
    "I am a homosexual,? he began."
  ]
}