{
  "id": 3939,
  "mediaId": 151,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Florida Republicans won't let go of Disney's campaign cash",
  "image": "https://www.politico.com/dims4/default/80fde7c/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F9c%2F17%2F56f2f0c04130a50678825f96babc%2Fdisney-world-20953.jpg",
  "link": "https://www.politico.com/news/2022/05/06/florida-republicans-wont-let-go-of-disneys-campaign-cash-00029411",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2082,
    3889,
    4556,
    428,
    524,
    3277,
    3508,
    2590,
    2661
  ],
  "sentences": [
    "But it highlights how the governor is willing to accept tens of thousands of dollars in campaign contributions while at the same time punishing the company, a move a state Democrat called performative.?\nThe Republican sponsor of the bill that triggered the fight between DeSantis and Disney was one of a handful of Republicans in the state that returned contributions to Disney.",
    "As the father of two sons, CFO Patronis wholeheartedly supports the Governor and his efforts to protect parental rights in education  especially when it comes to protecting public school children in kindergarten through 3rd grade.?\nState Rep. Anna Eskamani (D-Orlando), however, said Republicans refusal to return Disneys money highlights the theater of the situation.",
    "In his remarks to Republicans this week, DeSantis called it one of the dumbest things any corporation has ever done.?\nRecords show that Disney gave the Florida Republican Senatorial Campaign more than $380,000 in checks and in-kind donations in the past 15 months, including a check for $65,000 at the start of this years legislative session in January.",
    "Floridas Chief Financial Officer Jimmy Patronis, a Republican ally of DeSantis and whose political committee received a $10,000 check in February as well as $51,000 worth of lodging, travel and other expenses last September from the company, was one of the few who defended holding on to money from Disney.",
    "I never looked at it as creating a movement.?\nHardings move to return the funds came days after the Florida Democratic Party abruptly scrapped plans to hold its biggest annual fundraiser at Disney World after the partys LGBTQ caucus and other top Democrats threatened to boycott the event.",
    "But DeSantis and many state Republicans have refused to return campaign contributions to the California-based entertainment giant, which they have blasted over Disneys opposition to a law that bans instruction of gender identity and sexual orientation in kindergarten through third grade.",
    "Disney in March announced it would pause making campaign donations in Florida amid a backlash over its jumbled response to Hardings bill, though the company only publicly criticized the measure after it faced harsh criticism from employees and activists for not taking a stand.",
    "DeSantis reelection campaign, which received through its political committee $50,000 from Disney in March 2021 as well as an additional $50,000 two years earlier, has not returned it even as the Republican governor regularly attacks the company.",
    "They have gotten a free ride in this state for 50 years and I think they got arrogant,? DeSantis told more than 250 people earlier this week at a fundraising dinner for the Leon County Republican Party, where he was the keynote speaker.",
    "Disney and its affiliates have donated more than $2.3 million in Florida this election cycle, which includes money to elected officials, their political committees and committees run by one of the states main business groups.",
    "Disney has given the Republican Party of Florida $255,000 in checks since January 2021 as well as nearly $142,000 worth of in-kind donations that covered lodging, food and entertainment costs of visiting Disney parks.",
    "Disney has given the Republican Party of Florida $255,000 in checks since January 2021 as well as nearly $142,000 worth of in-kind donations that covered lodging, food and entertainment costs of visiting Disney parks.",
    "The political committee helping Republican Attorney General Ashley Moody, who may have to defend the state if Disney sues over the law dissolving its special privileges, received $25,000 last year from Disney.",
    "If Disney is so woke and profits off communist China (as DeSantis has stated before) then why are Republicans not returning the millions theyve received in woke money?? Eskamani asked in a text message.",
    "But DeSantis and most Republicans in Florida, where Disney operates its flagship theme park, wont return hundreds of thousands of dollars in campaign cash they received from the entertainment giant.",
    "Those who contribute to [Patronis] political committees are supporting his agenda to keep taxes low and our financial health strong,? said Melissa Stone, a spokesperson for his reelection campaign.",
    "That political committee, controlled by incoming Florida Senate President Kathleen Passidomo and previously run by state Senate President Wilton Simpson, has not returned the funds.",
    "Late last month, DeSantis and the Legislature stripped the company of special privileges that allowed it to operate as its own municipal government in central Florida.",
    "I cant be aligned with a corporation taken over by the woke Leftist mob mentality coming out of California and other blue states,? Harding said in a statement.",
    "They think they call the shots and I think they think the rest of us are just going to bow down and say, OK, whatever you want. Not with this sheriff in town.",
    "State Rep. Joe Harding (R-Williston), who sponsored the Parental Rights in Education? bill, sent back more than $8,000 he had gotten from Disney.",
    "I did it simply on principle on my end, I dont have an opinion positive or negative on other folks,? Harding said in a phone interview.",
    "Disney gave $138,881 to the Florida Democratic Party during this election cycle, of which $113,881 was in-kind contributions.",
    "This is petty, punitive and performative politics  Florida Republicans are such good actors they should be hired by Disney.?",
    "Money has flowed to individual legislators as well as political committees controlled by Republican and Democratic leaders.",
    "His bill  which opponents labeled Dont Say Gay?  has been called a broad attack against the LGBTQ community.",
    "It was Disneys push to advocate for repeal of the law that raised the ire of DeSantis and other Republicans.",
    "Thats not going to happen.?\nThe amount of money given wont make or break any candidate or elected official.",
    "He pushed to strip it of a special tax status and punish its leaders for challenging his policies.",
    "| Ted Shaffrey/AP Photo\nBy Gary Fineout\n 05/06/2022 04:31 AM EDT\nTALLAHASSEE, Fla.  Florida Gov.",
    "The party, however, declined to answer questions about whether it would return any donations.",
    "That total includes providing hotel rooms and theme park tickets as well as campaign checks.",
    "Some say it could further marginalize some students and lead to bullying and even suicide.",
    "Harding shrugged off questions about Republicans holding on their donations from Disney.",
    "The company also said it hoped that the law was repealed or struck down by the courts.",
    "Ron DeSantis vilified the Walt Disney Co. as dishonest? and hypocritical.",
    "The campaign declined to comment on the donations received from Disney.",
    "A federal lawsuit has already been filed by a group of LGBTQ advocates.",
    "The CFO doesnt expect to agree with any donor 100 percent of the time.",
    "He was one of three Republicans who returned Disneys money.",
    "Her reelection campaign also declined to comment.",
    "For me, I felt it was something I needed to do.",
    "Those are decisions they made.",
    "Most wont even discuss it."
  ]
}