{
  "id": 3941,
  "mediaId": 943,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "This day in history, May 6: German airship Hindenburg catches fire and crashes while attempting to dock at Lakehurst",
  "image": "https://img.newspapers.com/img/img?clippingId=101088974&width=700&height=430&ts=1607535806",
  "link": "https://www.chicagotribune.com/history/ct-aud-today-history-almanac-may-6-20220506-gjnmj3ec6vbjtildryqc7sar44-story.html",
  "sentiment": "0",
  "mediaOutlet": "Chicago Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "",
  "termIds": [
    661,
    771,
    1340,
    3859,
    4462,
    4475,
    3661,
    2944
  ],
  "sentences": [
    "Todays Highlight in History:\nOn May 6, 1937, the hydrogen-filled German airship Hindenburg caught fire and crashed while attempting to dock at Lakehurst, New Jersey; 35 of the 97 people on board were killed along with a crewman on the ground.",
    "In 1910, Britains Edwardian era ended with the death of King Edward VII; he was succeeded by George V.\nIn 1935, the Works Progress Administration began operating under an executive order signed by President Franklin D. Roosevelt.",
    "In 2013, kidnap-rape victims Amanda Berry, Gina DeJesus and Michelle Knight, who went missing separately about a decade earlier while in their teens or early 20s, were rescued from a house just south of downtown Cleveland.",
    "Five years ago: A Nigerian military official said 83 Chibok (chih-BAWK) schoolgirls had been released more than three years after they were abducted from their boarding school by Boko Haram (BOH-koh hah-RAHM) extremists.",
    "Ron DeSantis signed a 48-page elections bill that Republicans said would guard against fraud and vote harvesting; Democrats and voting rights advocates said it was an attempt to make it harder for some people to vote.",
    "In 2004, President George W. Bush apologized for the abuse of Iraqi prisoners by American soldiers, calling it a stain on our countrys honor?; he rejected calls for Defense Secretary Donald Rumsfelds resignation.",
    "On this date:\nIn 1882, President Chester Alan Arthur signed the Chinese Exclusion Act, which barred Chinese immigrants from the U.S. for 10 years (Arthur had opposed an earlier version with a 20-year ban).",
    "Ten years ago: Vice President Joe Biden told NBCs Meet the Press? he was absolutely comfortable? with gay couples who marry getting the same civil rights and liberties as heterosexual couples.",
    "President Donald Trump reversed course on plans to wind down his COVID-19 task force; he said the force would shift its focus toward rebooting the economy and developing a vaccine.",
    "In 2010, a computerized sell order triggered a flash crash? on Wall Street, sending the Dow Jones industrials to a loss of nearly 1,000 points in less than half an hour.",
    "In 2020, New York City began shutting down its subway system overnight to allow for additional cleaning and disinfecting of cars and stations amid the pandemic.",
    "Comedian Bob Hope did his first USO show before an audience of servicemen as he broadcast his radio program from March Field in Riverside, California.",
    "Socialist Francois Hollande (frahn-SWAH oh-LAWND) defeated conservative incumbent Nicolas Sarkozy (sahr-koh-ZEE) to become Frances next president.",
    "In 2006, Lillian Gertrud Asplund, the last American survivor of the sinking of the Titanic, died in Shrewsbury, Massachusetts, at age 99.",
    "In 1994, former Arkansas state worker Paula Jones filed suit against President Bill Clinton, alleging hed sexually harassed her in 1991.",
    "(Their captor, Ariel Castro, hanged himself in prison in September 2013 at the beginning of a life sentence plus 1,000 years.)",
    "In 1942, during World War II, some 15,000 American and Filipino troops on Corregidor island surrendered to Japanese forces.",
    "In 1954, medical student Roger Bannister broke the four-minute mile during a track meet in Oxford, England, in 3:59.4.",
    "(Pujols would finish the season with the Los Angeles Dodgers, before returning to the St. Louis Cardinals in 2022.)",
    "In an election-year surprise, Atlanta Mayor Keisha Lance Bottoms announced that she would not seek a second term.",
    "In 1941, Josef Stalin assumed the Soviet premiership, replacing Vyacheslav (VEE-cheh-slav) M. Molotov.",
    "Actor George Lindsey, Goober? on The Andy Griffith Show,? died in Nashville at age 83.",
    "---\nThe first draft of history at your fingertips at newspapers.com.",
    "The Los Angeles Angels cut 41-year-old superstar Albert Pujols.",
    "Todays birthdays: Baseball Hall of Famer Willie Mays is 91.",
    "(Jones reached a settlement with Clinton in November 1998.)",
    "Journalism, its often said, is the first-draft of history.",
    "Rock musician Mark Bryan (Hootie and the Blowfish) is 55.",
    "Rock singer John Flansburgh (They Might Be Giants) is 62.",
    "Actor Gabourey Sidibe (GA-bah-ray SIH-duh-bay) is 39.",
    "Rock musician Chris Shiflett (Foo Fighters) is 51.",
    "Rock singer-musician Tony Scalzo (Fastball) is 58.",
    "Former British Prime Minister Tony Blair is 69.",
    "Today is Friday, May 6, the 126th day of 2022.",
    "Houston Astros infielder Jose Altuve is 32.",
    "Check back each day for whats new  and old.",
    "Model/TV personality Tiffany Coyne is 40.",
    "Gospel singer-comedian Lulu Roman is 76.",
    "One year ago: Florida Republican Gov.",
    "Actor-director George Clooney is 61.",
    "There are 239 days left in the year.",
    "Actor Geneva Carr (TV: Bull?) is 56.",
    "Actor-comedian Sasheer Zamata is 36.",
    "Sen. Richard Shelby, R-Ala., is 88.",
    "TV personality Tom Bergeron is 67.",
    "Singer Jimmie Dale Gilmore is 77.",
    "Actor-singer Naomi Scott is 29.",
    "Actor Julianne Phillips is 62.",
    "Actor Adrianne Palicki is 39.",
    "Actor Stacey Oristano is 43.",
    "Rock singer Bob Seger is 77.",
    "Actor Clay OBrien is 61.",
    "Actor Roma Downey is 62.",
    "Actor Ben Masters is 75.",
    "Actor Richard Cox is 74.",
    "Actor Gregg Henry is 70.",
    "Actor Leslie Hope is 57.",
    "Actor Noah Galvin is 28.",
    "Rapper Meek Mill is 35.",
    "Actor Alan Dale is 75."
  ]
}