{
  "id": 3949,
  "mediaId": 157,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Ron DeSantis' crusade against Disney is drawing fire from some Republicans",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29769931&width=1200&coordinates=0%2C0%2C0%2C133&height=600",
  "link": "https://www.rawstory.com/ron-desantis-disney-2657277114/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Timothy Evans",
  "authorUrl": "https://www.rawstory.com/u/timothyevans",
  "termIds": [
    661,
    1231,
    2395,
    428,
    524,
    2551,
    2661,
    2851,
    5109
  ],
  "sentences": [
    "The Republican head of the Sunshine State made a big splash recently when he ordered lawmakers there to craft legislation to strip the company of its special tax status because the company's CEO publicly criticized the governor for enacting a new law restricting classroom instruction about sexual orientation and gender identity.",
    "The network also reports that Kenneth Griffin, a billionaire hedge fund owner who has donated more to DeSantis' campaign than any other individual, is \"troubled\" by the governor's move against Disney.",
    "DeSantis wants to eliminate the Reedy Creek Improvement District, the special governing body that has overseen Disney's theme parks and Orlando-area properties for half a century.",
    "That new measure, critics argue, could impose a massive new tax obligation - up to $1 billion - on central Florida residents.",
    "\"I don't believe that government should be punitive against private businesses because we disagree with them,\" he told CNN.",
    "And I believe that the people who serve our nation need to rise above these moments in time in their conduct and behavior.\"",
    "DeSantis, who is running for reelection, is widely expected to make a run for the GOP presidential nomination in 2024.",
    "Even pro-Trump lawyer Jenna Ellis has jumped in to denounce DeSantis's crusade against Disney as \"vengeful.\"",
    "Asa Hutchinson, dismissed what he sees as a purely political retaliatory move by DeSantis.",
    "And so, to me, that's the old Republican principle of having a restrained government.\"",
    "Ron DeSantis' in his war against the Walt Disney Company, according to a CNN report.",
    "Not all Republicans are on board for the ride with Florida Gov.",
    "One of his potential opponents in that race, Arkansas Gov.",
    "It can be portrayed or feel or look like retaliation.",
    "DeSantis going after Disney's tax status.",
    "Griffin said, \"I don't appreciate Gov.",
    "\"That's not the right approach either."
  ]
}