{
  "id": 3954,
  "mediaId": 43,
  "date": "d2022-05-06T00:00",
  "headline": "Openly queer teacher fired after allowing students to paint LGBTQ flags in art class",
  "image": "https://images.dailykos.com/images/1066675/story_image/GettyImages-1323562567.jpg?1651859850",
  "link": "https://www.dailykos.com/story/2022/5/6/2096309/-Openly-queer-teacher-fired-after-allowing-students-to-paint-LGBTQ-flags-in-art-class",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2305,
    4338,
    428,
    3430,
    2661
  ],
  "sentences": [
    "Republican attacks on transgender Americans conjure up the same-sex marriage bans of the 2000s\nDaily Kos' The Brief\nFollowShare\n0:001:00:27\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nA discussion happened in class and because of that ? Scott told local outlet NBC 2. Now Im fired.? According to Scott, some of the students created flags reflecting gay, nonbinary, and bisexual orientations.",
    "I would like to see a statement from the school board recognizing they have to have a mental health counselor come in and speak with the children impacted by their actions toward this teacher,? Crystal Czyscon, an LGBTQ+ advocate, told NBC 2, stressing that shes worried about how LGBTQ+ students in Scotts classes might feel as a result of Scotts abrupt removal for this reason.",
    "RELATED: Lawmakers in 19 states vow to offer legal refuge for trans youth displaced by Republican hate\nThey said it would be in the best interest if I got rid of them now,? Scott told local outlet CBS Miami about the school districts reaction to the paintings.",
    "Scott shared with the outlet that during the discussion of identities, Scott explained that she is pansexual (generally meaning one experiences attraction regardless of someones gender identity or gender presentation) and that she is married to a man.",
    "Or allowed to do, when a topic comes up in discussion.?\nAccording to Republicans, teachers are clearly supposed to stay in the closet and keep quiet, increasing the odds that young people will internalize this behavior and stay in the closet as well.",
    "Vivian Topping, director of advocacy and civic engagement at the Equality Federation, and Shannon Minter, legal director of the National Center for Lesbian Rights\nx\nx\nYou need to enable JavaScript to run this app.",
    "Union President Kevin Daly told CBS Miami that the district was able to legally fire Scott because, during her probationary period as a first-year teacher, she was not yet part of the union.",
    "Looks like a warning if Ive ever seen one \nContribute now to support abortion funds providing financial assistance to people seeking abortion care\n Daily Kos relies on readers like you.",
    "Defendants of the legislation argue the measure applies just to elementary schoolers, but verbiage in the law is general enough that it can be argued at any grade level.",
    "As Daily Kos has covered at length, Republicans are making it exceptionally difficult for LGBTQ+ students, teachers, families, and frankly, people in general.",
    "One middle school teacher, who openly identifies as pansexual, has already lost her job for discussing sexuality with her students, who are middle schoolers.",
    "Scott worked as an art teacher and allowed students to create flags that reflected any part of their identities, including creating entirely original flags.",
    "According to the outlet, the Lee County school district says Scott was fired over not following the curriculum as mandated by the state.",
    "And regardless of a students orientation or identity, the removal of a trusted adult after that sort of discussion has got to be scary.",
    "If nothing else, it certainly suggests these discussions (and people who have them) are dangerous and somehow inappropriate or wrong.",
    "In short, the legislation bars public school staff, including teachers, from discussing LGBTQ+ topics or identities in the classroom.",
    "Either way, its discriminatory and unacceptable as there is no reason children cant learn about the existence of LGBTQ+ folks.",
    "According to students in the class, some said they understood what her identity meant, and some said they were confused by it.",
    "Daly told NBC 2 that teachers should really consider Scotts dismissal as a wake-up call for how things are going in Florida.",
    "This sad fact is unfortunately especially true in the state of Florida, with a special thanks to Republican Gov.",
    "Oh, and all of this happened just days before DeSantis signed the Dont Say Gay bill into law back in March.",
    "Half our revenue comes from readers like you, meaning we literally couldn't do this work without you.",
    "She told the outlet that the administration told her they were releasing her from her contract.",
    "There is kind of a heightened state of where is the boundary?? Daly told the outlet.",
    "If youre wondering if parents complained about the art and discussion, youre right.",
    "Once she hung the art on the door of her classroom, Scott says, she lost her job.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nPlayback speed\n22.",
    "Ron DeSantis, who signed the discriminatory Dont Say Gay bill into law.",
    "We don't have billionaire backers like some right-wing media outlets.",
    "Can you donate $3 right now to help Daily Kos keep fighting?",
    "And all of this hate is already impacting schools.",
    "And what are employees supposed to do?",
    "Otherwise, say goodbye to your job!"
  ]
}