{
  "id": 3961,
  "mediaId": 19,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "PR Giant Tells Corporate Clients to Stay Silent on Abortion, No-Win Situation",
  "image": "https://media.breitbart.com/media/2022/05/pro-abortion-activist-waves-hanger-front-supreme-court-may3-22-getty-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/06/pr-giant-tells-corporate-clients-to-stay-silent-on-abortion-no-win-situation/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    661,
    3896,
    4346,
    351,
    524,
    3491,
    3523,
    3668
  ],
  "sentences": [
    "At the same time, we live in a world with different opinions and different views, and we respect those differences.?\nSiegel also added that the email template does not accurately reflect Zenos position or the range of counsel that we are providing to clients.? Siegel claimed the advice was provided within the first 24 hours after Justice Samuel Alitos draft opinion was leaked and intended to ? counsel clients to be measured in their immediate response to a complex developing story.?",
    "Zenos message to its corporate clients telling them to avoid the abortion debate can be summed up by the following mantra: go woke, go broke.?\nZeno Group also consults Netflix, which is dealing with its own fallout after the company made a dedicated shift towards wokeness.?\nIn the last half-year, Netflixs stock price has fallen from $671 to $215, and subscribers are also leaving the platform en masse.",
    "We anticipate the story will dominate newsfeeds for the rest of the week as more details unfold, so avoid pitching reporters and outlets that focus on breaking news.?\nAlong with media silence on the issue, companies are being told to remain silent on their social media accounts as well.",
    "According to the email, Zeno warned its clients that the media? and others will look for corporations to take a stand and make their views known.?\nZeno suggests its corporate clients remain silent on the issue because taking a public stance could be a no-win? situation for companies.",
    "Zeno Groups Executive Vice President for Media Strategy, Katie Cwayna, sent company staff a template email to share with client contacts? with instructions on reacting to reports that the U.S. Supreme Court is poised to overturn Roe v. Wade, the landmark abortion rights decision.",
    "Subjects that divide the country can sometimes be no-win situations for companies because regardless of what they do they will alienate at least 15 to 30 percent of their stakeholders Do not assume that all of your employees, customers or investors share your view.",
    "Whether in direct messages or public-facing posts, do not respond to questions about where your company stands on this issue.?\nZeno Group also consults top brands such as ASICS, Scotts Miracle-Gro, Phillips Health, Corona, Prudential, and Leveno.",
    "A massive PR firm that represents high-profile corporations like Coca-Cola, AT&T, and Starbucks is privately advising its clients to remain silent on abortion rights, according to an internal email obtained by Popular Information.",
    "Although the email paints abortion rights as a 50/50? issue, a recent poll found that a majority of Americans believe abortion should be either mostly? or always? illegal, and support banning abortion completely after 15 weeks.",
    "With its top corporate clients  including Kia Motors, Astra Zeneca, and Pizza Hut, Zeno Group, a subsidiary of the worlds largest public relations conglomerate, Edelman Holdings, earns almost $120 million in annual revenue.",
    "Avoid media fishing. Often during controversy, media will make general inquiries to multiple peer organizations, in which the first one to raise its hand? becomes the lead,? the email template continued.",
    "However, Zeno Group CEO Barby Siegel told Popular Information the company believes in a womans right to make decisions about her healthcare,? after the report on the internal email was published.",
    "Zeno told its clients that being at the center of the abortion issue is not advisable,? and to be judicious? with managing press inquiries.",
    "The PR firms advice to stay silent on this hot button issue also comes after the highly contested feud between Disney and Florida Gov.",
    "At Zeno, we believe in equal access to healthcare for all, and a womans right to make decisions about her healthcare,? Siegel said.",
    "The email template said:\nDo not take a stance you cannot reverse, especially when the decision is not final.",
    "The email template also provided its clients with advice on talking to reporters, which is to avoid them.",
    "Do not engage with direct questions about your companys position,? the email added.",
    "Ron DeSantis (R) over the states recently enacted Parental Rights in Education Law.",
    "As a result, Netflix now performs the worst out of the 500 stocks in the S&P 500.",
    "Zeno continued to warn its clients to stay away from the media entirely.",
    "Steer clear of breaking news networks/outlets,? the email said.",
    "This topic is a textbook 50/50? issue."
  ]
}