{
  "id": 3973,
  "mediaId": 237,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Have woke corporations finally learned their lesson?",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/c48ff15/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F15%2F59%2F946c90dd4ad1b5d39780dc24cf0a%2Fyl.Disney.jpg",
  "link": "https://www.washingtonexaminer.com/opinion/have-woke-corporations-finally-learned-their-lesson",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kaylee McGhee White",
  "authorUrl": "https://www.washingtonexaminer.com/author/kaylee-mcghee",
  "termIds": [
    661,
    4666,
    3508,
    2661
  ],
  "sentences": [
    "As one CEO said to me, I want to speak out on social issues, but I dont want to get involved in politics. Which I said under my breath, Thats not possible.?\nOf course, staying silent poses just as much of a risk for many companies because of their ties to the Left.",
    "That lesson is simple: Corporations do not get to stand in the way of the states responsibility to act in the best interests of its citizens, and if they try, there will be consequences.",
    "That message has been received by a number of companies, not just Disney, that are now thinking twice about their roles in the political sphere, according to the Wall Street Journal.",
    "1 concern CEOs have is, When should I speak out on public issues?? said Bill George, the former chairman and CEO of Medtronic PLC and a senior fellow at Harvard Business School.",
    "Disney, for example, had no intention of weighing in on Floridas law restricting sexual and gender identity content in K-3 classrooms until the Left forced it to.",
    "Florida Republicans proved its possible to fight back, and if their actions pause the steady march of wokeism for even a moment, they will have been worth it.",
    "This likely came as a shock to Disney and others on the Left who are used to conservatives rolling over at the first sign of corporate pressure.",
    "Just In...\nFlorida taught Disney a hard but necessary lesson this month when legislators revoked the companys special privileges and tax status.",
    "Ron DeSantis wanted to make a few things clear: the first being that, in the culture war, offense is the best defense.",
    "But now leftists arent the only ones with teeth.",
    "And second, that wokeism has a price.",
    "But Gov.",
    "The No."
  ]
}