{
  "id": 3982,
  "mediaId": 136,
  "date": "d2022-05-05T17:03",
  "headline": "Who is William Sanchez? Senate Candidate Sues DeSantis Over Disney District",
  "image": "https://d.newsweek.com/en/full/2032026/who-william-sanchez.webp?w=790&f=d101f384bd6764e4336c9434ddb51efc",
  "link": "https://www.newsweek.com/who-william-sanchez-senate-candidate-sues-desantis-over-disney-district-1703946",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fatma Khaled",
  "authorUrl": "https://www.newsweek.com/authors/fatma-khaled",
  "termIds": [
    661,
    1572,
    4047,
    524,
    571,
    3282,
    2661,
    2788,
    5109
  ],
  "sentences": [
    "On Tuesday, attorney William Sanchez, who is also running as a Democrat for the U.S. Senate in Florida, filed the lawsuit in federal court on behalf of three people living in Osceola County and one person living in Orange County, the two counties that contain the land governed by the RCID under the Reedy Creek Improvement Act of 1967 and are home to the Walt Disney World Resort.",
    "Sanchez said he decided to file the suit after DeSantis signed a bill stripping Disney's self-governing rights and tax privileges in response to the company's opposition to the state's Parental Rights in Education law which is dubbed by critics as the \"Don't Say Gay\" bill.",
    "A Miami-based attorney has filed a lawsuit on behalf of several central Florida residents against Florida Governor Ron DeSantis and others seeking to overturn the elimination of Disney's Reedy Creek Improvement District.",
    "Sanchez is running as a Democrat against Marco Rubio and Democratic Representative Val Demings, and according to the biography on his law firm's website, he calls himself an \"advocate for social and economic justice.\"",
    "His work in immigration was inspired by \"his wife's journey to America as a young girl from the Philippines in the early 80's and his parents' migration from Cuba in 1961,\" according to his website biography.",
    "This week, Sanchez said the lawsuit was filed \"in order to make sure all Florida taxpayers are represented in this battle, that we have a seat at the table,\" according to WFTV.",
    "Sanchez was also appointed by former President George W. Bush in 2004 as Special Counsel for the Department of Justice, Office of Special Counsel, Unfair Employment Practices.",
    "He also represented multiple immigrants including Haitian farmworkers and Cuban refugees and worked as a staff lawyer for the Haitian Refugee Center in Miami.",
    "The suit names DeSantis, Florida Secretary of State Laurel Lee and Jim Zingale, the executive director of the Florida Department of Revenue, as defendants.",
    "The lawsuit alleges that the bill aiming to dissolve special districts \"violates Florida taxpayers' federal constitutional rights.\"",
    "\"The stated and undisputed reason behind the bill is to punish Disney World and subsequently Florida taxpayers,\" the lawsuit reads.",
    "Reedy Creek currently has around $1 billion in outstanding bond debt according to the credit rating agency Fitch Ratings.",
    "The Senate candidate specializes in international law and has represented multinational companies and sovereign nations.",
    "Sanchez has also helped establish a number of nonprofits, including City Kids and Philippine Charities Foundation.",
    "This means that residents in Orange and Osceola counties may have to pay off that debt through increased taxes.",
    "\"Disney will for the first time actually live under the same laws as everybody else in Florida,\" DeSantis said.",
    "In a televised town hall meeting in Orlando, the governor insisted that \"Disney will pay its debts.\"",
    "\"We're not just waiting back to see what the government and large corporations decide to do.\"",
    "He also helped establish the micro-finance institution Partners for Self Employment.",
    "However, DeSantis denied Floridians would bear the burden of paying Disney's debt.",
    "They will be paying taxes, probably more taxes.\"",
    "\"The bonds will be paid by Disney."
  ]
}