{
  "id": 3984,
  "mediaId": 323,
  "date": "d2022-05-05T16:59",
  "headline": "Ron DeSantis Is Persona Non Grata at a Holocaust Memorial",
  "image": "https://images.wsj.net/im-537998?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/holocaust-memorial-new-york-museum-jewish-heritage-ron-desantis-judaism-florida-cancel-culture-tivka-speech-event-aoc-censorship-11651759681",
  "sentiment": "0.0",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elliott Abrams and Eric Cohen",
  "authorUrl": "",
  "termIds": [
    661,
    1341,
    2392,
    4600,
    4896,
    2661,
    2721,
    2945
  ],
  "sentences": [
    "WSJ Opinion: Disney Pays the Price for Woke Business PoliticsPlay video: WSJ Opinion: Disney Pays the Price for Woke Business Politics\n Review & Outlook: What started as a row over parental rights legislation has resulted in the Walt Disney Company losing special privileges in Floridaand serves as a wake-up call for other CEOs.",
    "In April the museum hosted a conversation with Senate Majority Leader Chuck Schumer and Linda Thomas-Greenfield, the U.S. ambassador to the United Nations, who recently described America as a society plagued by white supremacy and lauded Americas re-entry into the anti-Israel Human Rights Commission.",
    "We were working closely with the museum on the details for the June 12 eventuntil, out of the blue, we were told by the museum staff that Mr. DeSantis didnt align with the museums values and its message of inclusivity.? Either we disinvite the governor, they said, or our event was unwelcome.",
    "When we launched the Jewish Leadership Conference a few years ago, we gave our inaugural Herzl Prize for Jewish Leadership to the great freedom fighter Natan Sharansky, who endured nearly a decade in a Soviet prison in his fight to rejoin his people in Israel.",
    "In his memoir, Fear No Evil,? he tells how the Soviet thought police suffocated liberty not by tanks and missiles, or even camps and prisons,? but by turning free citizens into frightened supplicants, afraid to speak their minds.",
    "But we know things are bad when a Jewish institutionin this case, a museum whose purpose is to keep Jewish heritage alive by remembering the Holocaustturns on its own and tries to make a virtue of its own intolerance.",
    "Photo: Wilfredo Lee/Associated Press\n0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nListen to article\nLength (6 minutes)\nAD\nLoading advertisement...\n00:00 / 06:09\n1x\nThis article is in your queue.",
    "Her speech was widely covered in the newsboth before and after the eventincluding public criticism of the museum for giving such a vociferous critic of Israel a prominent platform at a Jewish institution.",
    "Over the years, Tikvah has hosted numerous conferences at the museum, always including prominent Jewish, Israeli and American thinkers and leaders of various political and religious points of view.",
    "Jews from the Northeast and Midwest, as well as Latin America and Israel, are migrating to the Sunshine State in significant numbers, making the Jewish communities there lively and varied.",
    "When pressed for a further explanation of why our event was canceled, the museums CEO adopted a common form of doublespeak: We dont do politics, he told us, whether left or right.",
    "In August 2018, Alexandria Ocasio-Cortez, then a Democratic candidate for Congress, was a featured speaker at an event at the museum, sponsored by the Immigrant Arts Coalition.",
    "It is hosted by Tikvah, a 20-year old Jewish educational and cultural institution whose main activity in America is teaching young Jews about Jewish history and civilization.",
    "Floridas booming and low-tax economy is no doubt one of the attractions to young Jews seeking to build a prosperous future for themselves and their families.",
    "What drives our elite institutionsmuseums, universities, large corporations, the mediato shut down speakers and ideas that question progressive orthodoxy?",
    "A few years ago, we helped launch the Jewish Leadership Conference, an annual gathering to consider the challenges facing the Jewish people and Israel.",
    "We see it all the time on college campuses, where anti-Semitism and anti-Zionism have become a tolerated (and even celebrated) form of discrimination.",
    "They believe they are defending the good: inclusion against hate, equality against discrimination, victimized minorities against white privilege.",
    "It depends also on channeling those sacred memories toward a vibrant Jewish futurethe kind of Jewish renaissance we are seeing today in Florida.",
    "The Jewish Leadership Conference wont be canceled, and the governor of the state with Americas third-largest Jewish population will speak.",
    "So is Floridas educational system, which provides tax credits that assist many parents in sending their children to Jewish day schools.",
    "We see it in the U.N., with its odious anti-Israel Human Rights Council and with Amnesty Internationals apartheid state? calumny.",
    "But it is sad to see that the misguided leadership of a Jewish museum wont allow alternative ideas a seat at the Jewish table.",
    "WSJ Opinion: Disney Pays the Price for Woke Business Politics\nSkip Ad\n in 15\nYou may also like\nCloseCreated with sketchtool.",
    "Ron DeSantis to discuss how the Florida model? has contributed to the growth and vitality of Jewish life in his state.",
    "Images: Reuters/AP/Miami Herald Composite: Mark Kelly\nCopyright 2022 Dow Jones & Company, Inc. All Rights Reserved.",
    "DeSantisincluding many Jewsare so hateful that they dont even merit a voice in the great American conversation.",
    "A lot of people dislike Mr. DeSantis, and the museum staff must have asked: What if there are protests?",
    "Preserving a free society requires at least some ability to respect other viewpoints and other people.",
    "We see it in the boycott, divest and sanctions movement, which advocates treating Israel as a pariah.",
    "In the name of inclusivity, a Jewish museum sent us a clear message: Some people are to be excluded.",
    "In the name of fighting hate, the museum decided that the millions of Floridians who support Gov.",
    "The new czars of cancel culture seem to have little such moral imagination or civic tolerance.",
    "The preservation of Jewish heritage depends not only on remembering the lost Jews of the past.",
    "Throughout the modern age, Jews have suffered the consequences of this kind of intolerance.",
    "0:00 / 4:18\nShareCreated with sketchtool.Closed Captions InactiveCreated with sketchtool.",
    "In the current environment, protecting free speech requires moral and political courage.",
    "The new thought police dont see themselves as acting solely or primarily out of fear.",
    "Many administrators, corporate CEOs and college presidents have weak spines.",
    "The event was to be held at the Museum of Jewish Heritage in New York City.",
    "Ron DeSantis attends a bill signing in Surfside, Fla., June 14, 2021.",
    "Open Queue\nA remarkable Jewish renaissance is under way in Florida.",
    "We will hold our event as planned, at a different, secular venue.",
    "The museum has hosted other politicians, including then-Gov.",
    "They are co-chairmen of the Jewish Leadership Conference.",
    "Yet the pseudo-gospel of inclusion breaks down quickly.",
    "Mr. Abrams is chairman and Mr. Cohen is CEO of Tikvah.",
    "Jewish schools and synagogues are rapidly expanding.",
    "In many cases, the explanation is sheer cowardice.",
    "We thought it would be interesting to invite Gov.",
    "A museum of tolerance has become intolerant.",
    "Andrew Cuomo and then-Mayor Bill de Blasio.",
    "Until, as the saying goes, we got canceled.",
    "Your browser does not support HTML5 video.",
    "What if our progressive donors complain?",
    "Paused\nSound OnCreated with sketchtool.",
    "Up Next\nCloseCreated with sketchtool.",
    "0:00\nPlayCreated with sketchtool.",
    "Yet the event went on as planned.",
    "Not surprisingly, this was false.",
    "87990cbe856818d5eddac44c7b1cdeb8",
    "Gov."
  ]
}