{
  "id": 3985,
  "mediaId": 558,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Ken Griffin Gives $25 Million to Illinois GOP Governor Candidate",
  "image": "https://s.yimg.com/ny/api/res/1.2/FHNbSlDNOmxmaaNRtV0Dig--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY2NjtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/LMCZLNodKb0eSphMDd4J4Q--~B/aD0xNTI2O3c9MjIwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/bloomberg_markets_842/2c9664e03a5d3b2224e411442a16246f",
  "link": "https://ca.news.yahoo.com/ken-griffin-gives-25-million-233753899.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "(Bloomberg) -- Hedge fund billionaire Ken Griffin has upped his ante in Illinoiss gubernatorial election this year, contributing another $25 million to Republican candidate Richard Irvin, the mayor of the states second-largest city.",
    "That contribution has not been reported on the Illinois State Board of Elections website, but a spokesman for Griffin said that the $25 million donation disclosed on Thursday was separate, bringing the total to $45 million.",
    "Griffin, the founder of Citadel and the richest man in Illinois, in February pledged $20 million to Irvin, the mayor of Aurora, after saying in November that hes all in? to back an opponent to beat Pritzker.",
    "In the current election cycle, hes given $18.5 million to House Republican Leader Kevin McCarthys allied super PAC and $10 million to one tied to Senator Mitch McConnell ahead of the midterms.",
    "He has also given $7.5 million to a group backing former Bridgewater Associates executive David McCormick, whos running in Pennsylvanias GOP Senate primary.",
    "Griffin is a prolific political donor, ranking third among GOP campaign contributors in the 2020 election cycle, according to the website OpenSecrets.",
    "Most Read from Bloomberg\nIrvin is trying to unseat Governor J.B. Pritzker, a billionaire Democrat seeking a second term in the November election.",
    "The $45 million investment in Irvins campaign would be the biggest expenditure hes made on behalf of a single candidate.",
    "Griffin is also backing the re-election effort of Florida Governor Ron DeSantis.",
    "He gave $5 million to a political action committee thats supporting him.",
    "Ken Griffin Gives $20 Million to Illinois Governors Rival"
  ]
}