{
  "id": 3992,
  "mediaId": 237,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "2024 Shock: Biden 36%, Trump 50%",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/6b6e522/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F3d%2F9e%2F597ba7a143659f272ebb7df97f4a%2Fap22102730438546.jpeg",
  "link": "https://www.washingtonexaminer.com/news/washington-secrets/2024-shock-biden-36-trump-50",
  "sentiment": "0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Bedard",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    2087,
    2465,
    3569
  ],
  "sentences": [
    "A majority of voters think President Joe Biden shouldnt seek reelection in 2024, and he would lose a rematch with former President Donald Trump by double-digit margins,? read the early analysis of the Rasmussen Reports poll sponsored by the Heartland Institute.",
    "If the next presidential election were held today, and Biden were running against Trump, 50% would vote for Trump while 36% would vote for Biden,? according to the Heartland/Rasmussen survey.",
    "The bad news for unpopular President Joe Biden continues to roll in, the latest from a new survey that shows likely voters, by a 2-to-1 margin, do not want him to run again.",
    "Women voters  a key to Bidens 2020 victory  have soured on the president, with only 26% wanting him to run again.?\nShould Trump not run, the survey said that Florida Gov.",
    "Trump is so dominant in GOP presidential polls that even critic and Sen. Mitt Romney this week said that the Republican nomination is the former presidents to lose.",
    "In its analysis, the Heartland Institute said, While 64% of black voters said they have a favorable opinion of Biden, only 39% want him to run for re-election.\"",
    "Even more embarrassing for the Democratic president is one of the largest gaps yet between him and former President Donald Trump in a 2024 matchup.",
    "And it added that \"among Hispanics, just 43% have a favorable opinion and only 31% want him to run in the 2024 presidential election.",
    "Sixty-one percent (61%) of likely U.S. voters believe Biden should not run for a second term as president in 2024.",
    "Rasmussens approval rating for Biden is about the average of all polls: 55% disapprove and 42% approve.",
    "Ron DeSantis would also beat Romney, though by a slightly different margin of 46%-35%.",
    "Trump has been coy about his plans, though most former aides expect him to run again.",
    "Some 35% were Democrats, 33% were Republicans, and 32% were other,? said Rasmussen.",
    "DeSantis regularly polls above any other Republican in a Trump-less 2024 primary.",
    "Biden has pledged to run for reelection, especially if Trump makes another try.",
    "Only 28% say Biden should seek reelection, while another 11% are not sure.",
    "Biden, meanwhile, isn't dominant, and his base is breaking away and fast.",
    "In the survey previewed by Secrets, Trump is up 50%-36%.",
    "The survey of 1,004 likely voters.",
    "Just In..."
  ]
}