{
  "id": 4000,
  "mediaId": 237,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Conservatives eager to see return of political ads on Twitter under Musk",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/f49fef2/2147483647/strip/true/crop/1500x788+0+106/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fac%2Fa6%2F79b41d35c4d49d8f7b90b29a958e%2F7f9dda1b6494111ab14d0475b2530b10.jpg",
  "link": "https://www.washingtonexaminer.com/news/conservatives-eager-to-see-return-of-political-ads-on-twitter-under-musk",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nihal Krishan",
  "authorUrl": "",
  "termIds": [
    661,
    935,
    1147,
    2394,
    2517,
    3103,
    177,
    236,
    286,
    539,
    3489
  ],
  "sentences": [
    "Were going to have to look at how effective the ads are on Twitter because its really easy to scroll right on through, which means youre obviously going to have to have a compelling message very quickly,? the former top Trump campaign communications official said.",
    "Most political candidates focus on building robust email lists, peer-to-peer texting schemes, and advertising on large platforms, such as Facebook, while advocacy groups find Twitter to be a better platform for their goals and objectives, Wilson said.",
    "Given how prominent political ads are and how many dollars there are to spend, this could make Twitter an instant force in the political messaging industry,? said Steve Johnston, a Republican strategist with FlexPoint Media, a GOP consulting firm.",
    "It just doesnt have the scale or reach to voters that Facebook and Google do, and Twitter has never collected the type of data on users that other platforms have in regards to targeting and reaching certain demographics,? said Wilson.",
    "I really dont think it would matter that much because Twitter has never been that important for paid advertising in general,? said Eric Wilson, a managing partner of the Startup Caucus, a Republican campaign technology incubator.",
    "Parscale called the ban \"yet another attempt by the Left to silence Trump and conservatives.?\nMusk has said he wants to open up Twitter to make it what the PayPal co-founder and Tesla and SpaceX head calls a haven of free speech.",
    "Wilson did say, however, that if Twitter grows its audience significantly under Musk and allows political advertisers to microtarget users in ways Facebook and Google restrict, it could compete with the bigger platforms.",
    "Facebook and, to some extent, Google have made the process of placing ads on their platforms much more laborious and more difficult than it used to be due to verification, disclaimers, and other hoops to jump through.",
    "They expect that if paid political messages are allowed back, it could generate hundreds of millions in revenue for Twitter while also putting pressure on rivals Facebook and Google to up their game in this space.",
    "Johnston added that Twitter could steal some revenue and thunder from Facebook and Google? if they allow political ads and roll out new ad features that make it easier for political groups to publish paid content.",
    "The two giants in online political ads, Facebook and Google, banned political ads at the tail end of the November 2020 election with the aim of stopping the spread of disinformation on their platforms.",
    "Just In...\nConservatives are hoping for the return of political ads to Twitter under the ownership of billionaire Elon Musk, a move that could shake up political messaging on social media platforms.",
    "A lot of candidates, including Trump, would want to use Twitter political ads because it could be highly valuable,? a former top Trump campaign communications official told the Washington Examiner.",
    "If Twitter has a more seamless process, that could be big,? said Johnston, whose firm has bought political ads on behalf of such Republican candidates as Florida Gov.",
    "However, some executives in the political advertising industry are more skeptical of the effect Twitter bringing back such ads would have on political campaigns.",
    "But many other major platforms, including Twitter, have for years banned political ads, some examples being Spotify, TikTok, LinkedIn, Pinterest, and Amazon.",
    "The decision drew criticism from some Republicans, including Brad Parscale, who managed former President Donald Trump's 2020 reelection campaign for a time.",
    "Liberals and centrists were split on Twitter's decision to ban political ads in 2019, with the campaign of President Joe Biden being in favor of it.",
    "A scholar from the nonpartisan Brookings Institution said the ban would hurt U.S. democracy by suppressing the ability of underfunded candidates.",
    "Its a great avenue for reaching people for national presidential campaigns alongside TV, radio, text messages, billboards, and other avenues.",
    "Campaigns will also have to test the bang for the buck of political ads on Twitter before committing large sums of money to such efforts.",
    "Twitter banned political ads from its platform in 2019, becoming one of a handful of major social media sites to do so.",
    "Jack Dorsey, Twitter's CEO at the time, justified the ban by saying political messages \"should be earned, not bought.\"",
    "You could particularly find a lot of undecideds on Twitter,? said the former spokesman, who is still close with Trump.",
    "Conservatives are hopeful that political ads could return in time for the 2024 presidential election.",
    "This makes us think, 'How much am I paying for this, and how much am I getting in return?",
    "A few months later, in 2021, Google and Facebook lifted their ban on political ads.",
    "Conservatives, however, were almost unanimously opposed to the political ad ban.",
    "That would allow them to get their message out to voters more effectively.",
    "Ron DeSantis and Ohio Senate nominee J.D.",
    "'? the former Trump spokesman added.",
    "Vance."
  ]
}