{
  "id": 4004,
  "mediaId": 239,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Florida residents sue to block state from dissolving Disneys special tax district",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/04/24/Disney_World_27121.jpg-802f4_c0-178-3960-2486_s885x516.jpg?dfe013cf436ebf757ba44729913b1472cfbec59e",
  "link": "https://www.washingtontimes.com/news/2022/may/5/florida-residents-sue-block-state-dissolving-disne/",
  "sentiment": "0",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Susan Ferrechio",
  "authorUrl": "https://www.washingtontimes.com/staff/susan-ferrechio/",
  "termIds": [
    661,
    524,
    2661,
    2724,
    2788,
    2849,
    5082
  ],
  "sentences": [
    "Disneys statement included language from the 1967 law creating the special district, declaring Florida cannot dissolve or alter the district in any way until all such bonds together with interest thereon, and all costs and expenses in connection with any act or proceeding by or on behalf of such holders, are fully met and discharged.?",
    "Disney executives have remained mostly silent on the law, but last week posted a public statement to the Municipal Securities Rulemaking Board indicating that Florida cannot dissolve its Reedy Creek Special Improvement District because it has not paid off $1 billion in debt.",
    "Do not worry about that.?\nHe moved to end Disneys special tax district after company executives publicly lobbied to stop, and then repeal, the Parental Rights legislation, which critics call the Dont Say Gay? bill because it prohibits teachers from discussing LGBTQ issues.",
    "Ron DeSantis, who signed the legislation into law last month following a public battle with Disney over the Parental Rights in Education law, which prohibits sex education in kindergarten through third grade.",
    "JACKSONVILLE, Fla.  Four Florida residents are suing to block the state from dissolving Disneys special tax district on the grounds it will force taxpayers to pick up the theme parks $1 billion debt burden.",
    "Disneys autonomous status allows the company to collect taxes from landowners on the property which they use to maintain and make improvements to the district.",
    "The two counties will take over the 39-square-mile Reedy Creek Special Improvement District in 2023 under the new law ending the parks 55-year autonomy.",
    "The lawsuit was filed in U.S. District Court in Miami by three residents of Osceola County and one resident from Orange County.",
    "The district includes four theme parks, a shopping and hotel district, and 139 miles of roads.",
    "Mr. DeSantis last week denied the new law will force county taxpayers to take on Disneys debt.",
    "Under no circumstances will Disney be able to not pay its debts,? Mr. DeSantis said.",
    "Democrats voted against the bill, arguing it was retaliatory and fiscally reckless.",
    "The GOP-led legislature passed the measure in April during a special session.",
    "The suit also names Republican Gov.",
    "We will make sure of that."
  ]
}