{
  "id": 4021,
  "mediaId": 63,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Inside Americas Davos: Where The Billionaire Financial Elite Meet, Plot And Join Forces",
  "image": "https://imageio.forbes.com/specials-images/imageserve/62732791cea2b18f9fbb66d0/Key-Speakers-At-The-2022-Milken-Conference/1960x0.jpg?fit=bounds&format=jpg&width=960",
  "link": "https://www.forbes.com/sites/chasewithorn/2022/05/05/inside-americas-davos-where-the-billionaire-financial-elite-meet-plot-and-join-forces/",
  "sentiment": "0",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chase Peterson-Withorn",
  "authorUrl": "https://www.forbes.com/sites/chasewithorn/",
  "termIds": [
    661,
    1901
  ],
  "sentences": [
    "That might help explain the daily yoga events, wellness garden healing sessions? to enhance peak performance? and panels with titles like The Case for Inclusive Capitalism,? The Power of LGBTQ+ Representation? and Transcending Age-Based Divides.?\nStill, many of the talks are focused on stuffy finance minutiaea session with actor Don Cheadle is relegated to a smaller side room; a group of CEOs discussing rapid digitalization? and ESG goals? get the center stage main ballroomor pragmatic discussions among investors like Investment Opportunities for a Net Zero Economy,? What to Watch Out for in India? and Tools to Renew Social Cohesion.?\nWe in Congress can learn a lot from the people here,? Representative Cheri Bustos (D - Illinois) tells me, after attending a panel about challenges facing the media industry.",
    "For a few days in early May, billionaire Michael Milken has taken over the place for his Milken Institute Global Conferencea yearly gathering of CEOs, CFOs, COOs, managers, directors, managing directors, founders, cofounders, presidents, vice presidents and executive vice president-types who are all here to glad-hand, plot and partner with each other and rub elbows with celebrities like Gwyneth Paltrow and Goldie Hawn and politicians like Congressman Peter Meijer (R - Michigan) and New York mayor Eric Adams (D).",
    "Hardly anyone has even asked what party Im from.?\nThe theme for this years gathering of the well-connected is, fittingly, celebrating the power of connection.? The lesson isnt lost on these conference goers, who seem to spend more time swapping business cards and setting up private meetings in the halls than sitting in on the sessions.",
    "Brazilian banker Andre Esteves ($5.7 billion) forecast that we have a more inflationary world ahead of us.?\nPerhaps the biggest draw: Former oligarch Mikhail Khodorkovsky, once Russias richest personworth some $15 billionbefore a falling out with Vladimir Putin saw him arrested, imprisoned and, eventually, self-exiled in London.",
    "Despite everything going on in the world, the elites in attendance are largely optimistic about the strength of the U.S. economy, their companies futures and even rising prices, according to a survey of 175 of them that was conducted by The Harris Poll and presented to the crowd.",
    "At least.?\nTheres even more action happening off-site, at exclusive events and secretive parties at the estates of billionaires like Steve Cohen, the New York Mets owner who has a 12,000-square-foot spread nearby.",
    "Theres a magic in the air being here,? says Cate Ambrose, CEO of the Global Private Capital Association, a membership group for emerging markets investors, over a quick lunch at the buzzing lobby bar.",
    "Milken, whose junk bond empire helped fuel the go-go 1980s, pleaded guilty to securities fraud in 1990 and served two years in prison before remaking his image as a prominent philanthropist.",
    "Or at neighboring hotels, like the five-star Peninsula Beverly Hills, where valets are working double-time parking Rolls Royces and Bentleys during a reception held by a prominent PR firm.",
    "Hedge funder Ken Griffin (worth an estimated $26.2 billion) criticized Bitcoin, praised Elon Musks takeover of Twitter and lashed Florida governor Ron DeSantis for his spat with Disney.",
    "Its one of the few events where you still wear a tie,? says an exec at accounting giant EY, settling in for this years opening remarks, which he grumbles are already five minutes late.",
    "Inside, guests from elite operations like Dyal Capital and Bridgewater Associates talk shop over cocktails and hors d'oeuvres while a man in a suit bangs away at an electric keyboard.",
    "Khodorkovsky told a packed ballroom that the world will not be a safe place as long as Putin remains in power.? He then headed off to the lobby, to do an interview with CNBC.",
    "Even with the markets dropping, the war in Ukraine raging and the pandemic lingering, more than 3,500 people scored ticketswhich start at $25,000to this years spectacle.",
    "One attendee tells me a theory that Wall Street titans flock here to pay tribute to Milken for taking the rap for the private equity industrys sins three decades ago.",
    "Its a great way to have high-quality interactions with decision makers and business leaders,? says Matt Brown, the founder and CEO of investment platform CAIS.",
    "No doubt countless key meetings are occurring, deals are being proposed and agreements are being hammered out that impact big swaths of the financial markets.",
    "Coinbase cofounder Brian Armstrong ($5.4 billion) predicted that a substantial portion? of GDP will happen in the crypto economy in the coming decade or two.",
    "This isnt the Golden Globe Awards, held here annually, but instead the event of the year for a different set of A-listers: the worlds financial elite.",
    "Its important that the leaders in both parties stay above the fray when it comes to retaliation against corporate America,? the GOP megadonor warned.",
    "In the hall, some attendees speculate about how many trillions of dollars of assets under management are represented at this years conference.",
    "Everyone is networkingin the lobby, at the bar, by The Beverly Hiltons iconic pool, where theres a wait for any table not already reserved.",
    "Tanned people in sharp suits and stylish dresses stride inside, past rows of TV cameras and stage lights and into the posh hotels ballroom.",
    "Former Google CEO Eric Schmidt ($21 billion) promised that hes not building killer robots? during a session on artificial intelligence.",
    "More than one attendee half-jokes that Ive made it to a slice of the real conference.?\nTurns out theres a lot of power in connections.",
    "Eldridge ended up making a $50 million equity investment in CAIS, which connects alternative asset managers with financial advisors.",
    "Funding from the likes of Apollo, Motive Partners and Franklin Templeton has since followed, pushing CAIS valuation to $1.1 billion.",
    "The events roots trace back to Milkens Predators Ball? gatherings of corporate raiders and bond investors in the 80s.",
    "Its been a great relationship,? says Brown, standing at a poolside table, surrounded by a sea of power lunches.",
    "Another 15 members of the Forbes list, worth a collective $100 billion by our count, spoke on its panels.",
    "He connected with billionaire Todd Boehlys Eldridge Industries at the Milken conference three years ago.",
    "Just 11% of the Milken set think inflation will keep climbing, compared to 43% of the American public.",
    "Its actually getting harder and harder to meet a true crypto skeptic in D.C.,? he noted.",
    "Whatever their motivation, billionairesespecially those in financestill swarm the place.",
    "Acaravan of jet black Suburbans, Beemers and Benzes pull up to The Beverly Hilton.",
    "Milken went virtual for 2020 and held a scaled down 2021 conference in October.",
    "No fewer than 20 billionaire-led firms sponsored this years conference.",
    "Private equity billionaire Tom Lee wanders up to the bar for a refill.",
    "Prominent among them, per the survey: shifting generational values.",
    "The good feelings extend beyond the conference.",
    "Even the well-off have their worries, though.",
    "The event was back in full force this year.",
    "30 minutes,? the hostess says.",
    "Its very solutions-oriented.",
    "Valets open passenger doors.",
    "The rest has been history.?"
  ]
}