{
  "id": 4024,
  "mediaId": 19,
  "date": "d2022-05-05T00:00",
  "headline": "Nolte: Rematch Poll Shows Trump Defeating Biden by 14 Points",
  "image": "https://media.breitbart.com/media/2020/10/Donald-Trump-Joe-Biden-combo-talking-getty-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/05/nolte-rematch-poll-shows-trump-defeating-biden-by-14-points/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Nolte",
  "authorUrl": "https://www.breitbart.com/author/john-nolte/",
  "termIds": [
    661,
    895,
    1147,
    1158,
    2087,
    146,
    416,
    2661,
    2945
  ],
  "sentences": [
    "Today, the party is not only seen as soft-on-crime, but in favor of open borders, lockdowns, school closings, masking and sexually grooming children, allowing mentally ill men in skirts to share your daughters dressing room, allowing men to compete in womens sports, infanticide, and spending us into the worst inflation in modern history.",
    "If the next U.S. presidential election were held today, and President Joe Biden were running against former president Donald Trump, who would you be most likely to vote for??\nIn answer to that question, only 36 percent chose Biden, while 50 percent said Trump.",
    "https://t.co/3KqdSWxbdY\n Breitbart News (@BreitbartNews) May 1, 2021\nBest of all, Democrats are so beholden to the perverts, billionaires, child groomers, and other assorted degenrates in their base, they cannot change course without the bottom falling out.",
    "Democrats have lost the working class, are losing Hispanics, have lost the swing states of Ohio and Florida, and are at risk of losing just enough of their black base to end their status as a national party.",
    "If theres a 2024 rematch between Donald Trump and Slow Joe Biden, Biden will find himself slaughtered by a 14 point margin, according to polling from Rasmussen Reports.",
    "Another thing to keep in mind is that Her Vice Fraudulency Kamala Harris almost always polls worse than Biden in these hypothetical match ups.",
    "Keep in mind that this is the same Rasmussen Reports that correctly called the national race for Biden in 2020, 46 to 45 percent.",
    "Trump grabs 20 percent of the black vote, compared to Bidens 56 percent  which would be unprecedented in modern history.",
    "Well Joe, what are you waiting for!? https://t.co/ztg2X4X6AD\n Breitbart News (@BreitbartNews) December 7, 2021\nGov.",
    "In worse news for Slow Joe, a full 61 percent of the public do not want His Fraudulency to run for a second term.",
    "After only a year of life under woketard rule, these numbers do not surprise me in the least.",
    "Between 1968 and 1992, the party was shellacked nationally due to its soft-on-crime stance.",
    "Ron DeSantis (R-FL) also butchers Biden in a 2024 match-up by 11 points, 46 to 35 percent.",
    "If at least 88 to 90 percent of black Americans do not vote Democrat, the party is doomed.",
    "Biden only wins young voters aged 19 to 39 by a single point, 40 to 39 percent.",
    "The Democrat party is in the deepest, existential trouble of my lifetime.",
    "How about Pete Howdy Doody? Buttigieg or Hillary Dossier? Clinton?",
    "Now Biden tries to blame Trump for the Biden border crisis!",
    "[Biden] said anybody with his results should leave office.",
    "Trump wins Hispanics by eight points, 44 to 36 percent.",
    "Their polices worsen the lives of everyday Americans.",
    "Trump beats Biden among women 48 to 36 percent.",
    "Everything Democrats touch gets worse.",
    "The internals are even more glorious.",
    "Maybe 135-year-old Bernie Sanders?",
    "So who else will Democrats run?",
    "Elizabeth Pow-Wow-Chow? Warren?",
    "Their economy is a disaster.",
    "Their cities are shitholes.",
    "Thats a 14 point gap."
  ]
}