{
  "id": 4027,
  "mediaId": 33,
  "date": "d2022-05-05T00:00",
  "headline": "El aborto en Florida: qu significan las leyes actuales para las personas que buscan abortar?",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220503112717-02-us-abortion-laws-story-tablet.jpg",
  "link": "https://cnnespanol.cnn.com/2022/05/05/aborto-en-florida-que-es-ilegal-bajo-las-politicas-estatales-orix/",
  "sentiment": "0.0",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Por CNN Español",
  "authorUrl": "https://cnnespanol.cnn.com/author/cnn-espanol/",
  "termIds": [
    661,
    243,
    400,
    2661
  ],
  "sentences": [
    "Las nicas excepciones a esta regla son para vctimas de violacin, incesto, violencia domstica y trata de personas por lo que es necesario presentar un reporte policial, registro mdico u orden judicial, seala Planned Parenthood, una organizacin sin fines de lucro que brinda atencin de salud sexual y reproductiva, as como planificacin familiar y atencin ginecolgica.",
    "Ultrasonido obligatorio\nComo parte del mismo esquema que requiere dos visitas previas, la ley de Florida exige que una paciente se someta a un ultrasonido al menos 24 horas antes de obtener un aborto y la obliga a escuchar ver las imgenes de ultrasonido en vivo, as como escuchar las explicaciones del proveedor sobre tales imgenes.",
    "Esto es lo que significan las leyes actuales para las personas que buscan abortar en Florida:\nPeriodo de 24 horas\nLa nueva ley de Florida requiere, al igual que en Texas y otros estados con gobiernos republicanos, que una persona realice dos citas con al menos 24 horas de diferencia para obtener un aborto.",
    "(CNN Espaol) -- Si la Corte Suprema de Estados Unidos decide acabar con la jurisprudencia el histrico dictamen de Roe vs. Wade, alrededor de 23 estados podran prohibir el aborto, incluyendo a Florida, segn un anlisis del Instituto Guttmacher, una organizacin que apoya el derecho al aborto.",
    "Los Centros de Servicios de Medicare y Medicaid (CMS, por sus siglas en ingls), indican que los abortos que se encuentran dentro de las excepciones de Hyde deben considerarse dentro del alcance de los servicios que son mdicamente necesarios?, y deben ser cubiertos por los estados.",
    "donde el derecho al aborto estara bajo amenaza si se anula el fallo de Roe vs. Wade\nEn el caso especfico de Florida, en abril el gobernador Ron DeSantis promulg una ley que prohbe la mayora de los abortos despus de las 15 semanas de embarazo, salvo algunas excepciones.",
    "donde el derecho al aborto estara bajo amenaza si se anula el fallo de Roe vs. Wade\nEn el caso de Florida, la financiacin pblica s est disponible pero nicamente en casos de peligro de vida, violacin o incesto, segn lo establecido en la Enmienda Hyde.",
    "Autorizacin de los padres\nEn el caso de las menores de 18 aos, requiere que uno de los padres sea informado de la decisin de realizarse un aborto 48 horas antes del procedimiento y es necesario que uno de ellos d su consentimiento.",
    "La aprobacin de esta ley se suma a varias restricciones que estn o estarn vigentes en el estado, como el periodo de espera de 24 horas, la autorizacin de los padres en el caso de la solicitud de aborto por una menor, entre otras.",
    "El proyecto de ley, que entra en vigor el 1 de julio, permite exenciones en los casos en que un embarazo sea de \"riesgo grave\" para la madre o se detecte una anomala fetal fatal si dos mdicos confirman el diagnstico por escrito.",
    "El 30% de los abortos legales reportados en Florida fueron obtenidos por hispanas, segn las cifras ms recientes de un estudio realizado por los Centros para el Control y la Prevencin de Enfermedades de EE.UU.",
    "Sin embargo, la mujer tiene derecho a negarse a ver y escuchar la explicacin del ultrasonido en vivo, pero deber completar un formulario reconociendo que se le ofreci la oportunidad pero que la rechaz.",
    "El fin de Roe vs. Wade podra dejar a muchas mujeres que necesitan servicios de aborto a cientos o miles de kilmetros de distancia del acceso al procedimiento, algo inasequible para muchas.",
    "El lmite de 15 semanas\nEn Florida se prohbe el aborto despus de las 15 semanas de embarazo un total de tres meses y tres semanas sin exenciones por violacin, incesto o trfico de personas.",
    "Anteriormente, Florida permita el aborto hasta el segundo trimestre del embarazo, lo que lo haca uno de los estados del sureste del pas donde era ms fcil ejercer el derecho al aborto..",
    "Financiamiento restringido, pero no inaccesible\nSegn el Programa Nacional de Leyes de Salud, la financiacin federal de Medicaid para el aborto en todos los estados de EE.UU.",
    "El estado de Florida requiere que un proveedor llene un formulario especfico para procesar el reembolso de Medicaid por el aborto, sin que un reporte policial sea necesario.",
    "En el caso de Florida, la financiacin pblica s est disponible pero nicamente en casos de peligro de vida, violacin o incesto, segn lo establecido en la Enmienda Hyde.",
    "La primera visita incluye anlisis de laboratorio, ultrasonido, educacin e informacin opcional, as como una reunin con un mdico para hablar sobre el procedimiento.",
    "Sin embargo, un juez puede excusarla de este requisito si es vctima de abuso sexual, si se trata de una emergencia mdica o si logra obtener el permiso del juez.",
    "De acuerdo con el Instituto Guttmacher, el asesoramiento dirigido por el Estado incluye informacin \"para disuadir a la paciente de tener un aborto\".",
    "\"est severamente restringida, pero no completamente inaccesible\".",
    "En la segunda visita se realizar el procedimiento.",
    "(CDC, por sus siglas en ingls).",
    "Estos son los estados de EE.UU.",
    "Estos son los estados de EE.UU."
  ]
}