{
  "id": 4030,
  "mediaId": 1067,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Anular Roe v. Wade sera mortal, dicen mdicos de Florida Central y defensores del aborto que estn indignados",
  "image": "https://www.orlandosentinel.com/resizer/CD3qK67qZARlCMhaISu18v5kGrI=/1440x0/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/QCK35XGFPFEPNEGY7E4DTWIBKM.jpg",
  "link": "https://www.orlandosentinel.com/espanol/os-ex-roe-v-wade-reacciones-florida-central-20220504-xtjcb6z7f5g4hmp5wjv2avt22e-story.html",
  "sentiment": "0",
  "mediaOutlet": "Orlando Sentinel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Orlando Sentinel Staff",
  "authorUrl": "",
  "termIds": [
    661,
    2058,
    3645,
    2661,
    4982,
    5152
  ],
  "sentences": [
    "Segn la ley estatal, las clnicas de aborto deben tener un acuerdo de transferencia de pacientes por escrito con un hospital dentro de una proximidad razonable? a la clnica, y los mdicos deben tener privilegios de admisin en un hospital dentro de una proximidad razonable?.",
    "Joseph dijo que ya estaba frustrada porque las restricciones al aborto firmadas recientemente por el gobernador Ron DeSantis no tienen excepciones para las vctimas de violacin o incesto, pero ahora le preocupa que otros derechos puedan verse en peligro.",
    "Si bien Florida puede servir como un refugio temporal para las mujeres en estados con leyes ms estrictas, el Instituto Gutmacher predice que Florida eventualmente podra prohibir el aborto en funcin de la composicin poltica y la historia del estado.",
    "Mientras los oradores, desde activistas hasta polticos, tomaban un megfono, denunciaban el reclutamiento e instaban a la multitud a elegir candidatos a favor del derecho a decidir este ao, la audiencia sigui creciendo y llen gran parte de la plaza.",
    "Robyn Schickler, obstetra y ginecloga y directora mdica entrante de Planned Parenthood of Southwest and Central Florida, dijo que cualquier retroceso adicional en el derecho al aborto amenazar la vida de las personas embarazadas.",
    "Son las personas que tienen que tomarse dos das libres del trabajo, las que tienen que buscar cuidado de nios porque la mayora de las personas que abortan ya son padres y las que tienen que comprar la gasolina para dos viajes.",
    "Todos los estados limtrofes de Florida han aprobado prohibiciones o casi prohibiciones que se podrn hacer cumplir con la desaparicin de Roe de acuerdo al Guttmacher Institute, un grupo de investigacin y poltica reproductiva.",
    "El martes, se uni a una mltiples proveedores de Florida Central y defensores del aborto indignados por un borrador inicial de opinin mayoritaria escrito por el juez Samuel Alito que pondra fin a Roe v. Wade.",
    "La ley permite excepciones solo si los mdicos atestiguan que un aborto salvar a la madre de la muerte o lesiones graves, o si el feto tiene una condicin que provocar la muerte poco despus del nacimiento.",
    "El representante estatal Carlos Guillermo Smith, demcrata de Orlando, dijo que tema que despus de permitir que los estados prohibieran el aborto, la Corte Suprema podra buscar revertir el matrimonio gay.",
    "Adivina quin asume la carga de ese costo?? dijo Stephanie Loraine Pieiro, codirectora ejecutiva de Florida Access Network, que ayuda a las personas a encontrar atencin reproductiva segura y asequible.",
    "que sigue a mujeres a las que se les neg el aborto, encontr que las mujeres que llevaron a trmino embarazos no deseados tenan ms probabilidades de experimentar complicaciones graves en el embarazo.",
    "Los legisladores de Florida han realizado numerosos intentos para restringir el acceso al aborto, algunos de ellos exitosos, incluso antes de que se aprobara la nueva prohibicin de 15 semanas.",
    "Las mujeres con embarazos no deseados tambin tenan ms probabilidades de quedarse con parejas abusivas y, a menudo, vieron un aumento en la pobreza del hogar que dur aos, encontr el estudio.",
    "El condado de Orange tiene dos clnicas de aborto, Seminole y Osceola tienen una cada una, y Lake es uno de los 50 condados de Florida sin una clnica con licencia, segn datos de la AHCA.",
    "Los mdicos han argumentado que muchas afecciones graves no estn cubiertas por estas excepciones, lo que deja abierta la posibilidad de que un beb nazca con una vida corta y dolorosa.",
    "La opinin, obtenida por Politico, muestra que la corte se pone del lado de los opositores al aborto que afirman que no hay un lenguaje explcito en la Constitucin de los EE.",
    "Agreg que Planned Parenthood anticipa una oleada de personas de los estados vecinos que viajan aqu para el procedimiento y planea expandir los servicios para acomodar eso.",
    "En el mitin del martes en la alcalda de Orlando Diana Joseph, de 55 aos, portaba un cartel que deca Pro Woman, Pro Child, Pro Choice? (Pro vida, pro menores, pro eleccin).",
    "En 2021, casi 80,000 mujeres interrumpieron sus embarazos en una de las 57 clnicas autorizadas de Florida, segn la Agencia de Administracin de Atencin Mdica de Florida.",
    "Si el proyecto de opinin se mantiene, las leyes de aborto se dejarn en manos de cada estado, casi la mitad de los cuales han indicado que prohibiran el procedimiento.",
    "Amy Weintraub estaba mirando televisin el lunes por la noche cuando sali a la luz la historia de un borrador filtrado que sugera que la Corte Suprema de EE.",
    "Me sent absolutamente enferma?, dijo Weintraub, directora del programa de la organizacin sin fines de lucro de tendencia izquierdista Progress Florida.",
    "Afuera de la alcalda de Orlando el martes por la tarde, una multitud de aproximadamente 300 personas se reuni para condenar el borrador del fallo.",
    "Las ubicaciones de Planned Parenthood generalmente tienen una espera de una semana a dos semanas para los abortos, segn la clnica, dijo Schickler.",
    "Tena miedo de que esta fuera la eventual [decisin de la Corte Suprema], pero todava estoy asombrada de que esto realmente est sucediendo?, dijo.",
    "Adems, cualquier persona que busque un aborto debe esperar 24 horas despus de la visita inicial al mdico antes de someterse al procedimiento.",
    "Pieiro, ahora de 30 aos, abort a los 17.\nTuve que pedirle permiso a un juez para vivir mi vida, para tener mi futuro en mis trminos?, dijo.",
    "Los polticos deben asegurarse de que los abortos sean seguros, legales y accesibles?, dijo Reenie Mcharg, quien represent a Florida Rising.",
    "Los letreros mostraban mensajes que iban desde Las nias solo quieren tener derechos humanos fundamentales? hasta Contra el aborto?",
    "No se hace ninguna excepcin para las reas rurales, y nada en el estatuto requiere que un hospital est de acuerdo con tal arreglo.",
    "Son los que tienen que reorganizar su vida, y eso es lo que crea ms estigma y vergenza cuando hablamos de servicios de aborto?.",
    "Nadie debera verse obligado a continuar con un embarazo, y es profundamente molesto que esto sea algo que contina sucediendo?.",
    "Afectar particularmente a las mujeres que no pueden permitirse volar o conducir a otros estados para el procedimiento, dijo.",
    "Esta historia fue publicada en el Orlando Sentinel por los periodistas Caroline Catherman, Kate Santich y Ryan Gillespie.",
    "Incluso si Florida no ampla su prohibicin ms all de las 15 semanas, el acceso al aborto disminuir, predijo Schickler.",
    "He estado en el movimiento casi toda mi vida adulta, y no hubiera credo que alguna vez tendramos un revs tan grande.",
    "Una ley de Florida que prohbe los abortos despus de las 15 semanas ya est programada para entrar en vigor en julio.",
    "que proteja el derecho de una mujer a decidir si interrumpir su embarazo sin restricciones excesivas del gobierno?.",
    "El Estudio Turnaway a nivel nacional de la Universidad de California en San Francisco, el estudio ms grande de EE.",
    "Incluan tanto a los que protestaban por primera vez como a los que dijeron que lo haban hecho durante dcadas.",
    "En este momento, sin embargo, Planned Parenthood todava ofrece abortos de hasta 24 semanas, agreg Schickler.",
    " No dejaremos que suceda sin luchar?, dijo Tiffany Hughes, expresidenta del captulo local de la NAACP.",
    "Las opciones ya son escasas para las mujeres que viven en Orlando y sus alrededores y buscan abortos.",
    "La defensora de los derechos reproductivos de Florida, de 53 aos, dijo que retrocedi ante la noticia.",
    "Pero casi el 75% de los condados de Florida carecen de un solo proveedor de servicios de aborto.",
    "Se espera ampliamente que el tribunal revise el tema a fines de junio o principios de julio.",
    "planea revocar el histrico fallo Roe v. Wade de 1973 que legaliza el aborto en todo el pas.",
    "Y las personas que esto va a afectar ms son las personas que siempre se ven ms afectadas.",
    "Son nuestros pacientes negros, o personas de color, o personas de bajos ingresos?.",
    "Creo que el aborto es atencin mdica y la atencin mdica es un derecho humano?.",
    "Estaba trabajando como camarera y tena que ahorrar dinero y esperar al juez.",
    "Creo que tambin conducir a quitar cosas como el control de la natalidad?.",
    "Lo que tenemos en esa Corte Suprema no es una mayora conservadora.",
    "Nancy Rexford de Orlando, de 32 aos, estaba entre las primeras.",
    "Esto va a ser mortal para las mujeres?, dijo Schickler.",
    "Dos mujeres en el estudio murieron durante el parto.",
    "El estudio tambin sigui a las mujeres que abortaron.",
    "No se equivoquen, la lucha comienza ahora?.",
    "Eso es lo que realmente me enoja ms?, dijo.",
    "Nuestros derechos estn en juego.",
    "Es una mayora radical?, dijo.",
    "Todos ellos sobrevivieron.",
    "Y estoy bastante enojada?.",
    "Hgase una vasectoma?.",
    "Estoy nerviosa.",
    "Estoy ansiosa.",
    "La Dra.",
    "UU.",
    "UU.",
    "UU."
  ]
}