{
  "id": 4032,
  "mediaId": 323,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Gubernatorial Candidates Seize on Leaked Roe v. Wade Draft Opinion",
  "image": "https://images.wsj.net/im-537785/?width=860&size=1.5&pixel_ratio=3",
  "link": "https://www.wsj.com/articles/gubernatorial-candidates-seize-on-leaked-roe-v-wade-draft-opinion-11651695626",
  "mediaOutlet": "Wall Street Journal",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Elizabeth Findell",
  "authorUrl": "https://www.wsj.com/news/author/elizabeth-findell",
  "termIds": [
    661,
    1284,
    1713,
    2250,
    2416,
    4653,
    146,
    400,
    428
  ],
  "sentences": [
    "The law would sentence doctors with up to life in prison for performing an abortion, making an exception only if a pregnant mother risks death or substantial impairment of major bodily function.?\nA University of Texas/Texas Tribune poll conducted in recent weeks found that 54% of Texas registered voters oppose automatically banning all abortions in Texas if Roe is overturned, with 42% of them strongly opposed.",
    "Rep. Charlie Crist spoke at a rally in support of abortion rights on Tuesday in Pinellas County, and said in a tweet, Its been a gut-wrenching day for women and reproductive freedom in our country.?\nMr. DeSantis didnt respond directly Tuesday when reporters asked him if he planned to support stronger restrictions on abortions in the wake of the leaked draft opinion.",
    "In Arizona, which has an open race for governor, leading Democratic candidate Katie Hobbs tweeted Tuesday: Abortion is on the ballot in 2022 & were going to keep fighting back because we arent going back.? Ms. Hobbs, the secretary of state, is also trying to raise campaign funds with the issue.",
    "Gavin Newsom released a campaign ad Wednesday criticizing his leading Republican challenger, state Sen. Brian Dahle, saying he wants to roll back abortion rights and punish women and doctors? and highlighting Mr. Newsoms endorsement by Planned Parenthoods political arm.",
    "Democratic candidates in competitive gubernatorial races across the country who support abortion rights seized on this weeks leak of a draft opinion overturning Roe v. Wade to rally support from voters who oppose outlawing abortion.",
    "Ahead of a May primary, Mr. Shapiro is the only Democrat vying to succeed the states current Democratic governor, while a field of nine Republicans are all in favor of restricting or banning abortion.",
    "Doug Ducey, shared the Politico story that first disclosed the draft opinion Monday night, writing, Life wins.?\nMr. Ducey earlier this year signed a bill banning most abortions after 15 weeks.",
    "Mr. Dahle didnt respond to a request for comment and hasnt offered any reaction to the Supreme Court leak on social media as he campaigns in a conservative, northern region of the state.",
    "Republican incumbents tended to say little about the issue, while those fighting to win the GOP nomination were more outspoken in their enthusiasm to restrict or outlaw abortion.",
    "Democratic gubernatorial candidates in Florida seized on the leak as a way to potentially shake up a race in which incumbent Republican Ron DeSantis is leading.",
    "Mr. Newsom is expected to easily win re-election this year and late Monday endorsed an amendment to the state constitution establishing the right to abortion.",
    "Tony Evers, who is facing a tight race for re-election, said he led a group of 17 governors who called on Congress to pass a law protecting abortion rights.",
    "In Pennsylvania, Attorney General Josh Shapiro has repeatedly said this week that he will oppose stricter abortion rules in the state if elected governor.",
    "Democrats statements this week indicate that they see the issue as a winning one for them in states whose electorates lean even moderately to the right.",
    "In a talk radio interview, he criticized the leak and called for the Supreme Court to move up the release of its decision, currently expected in June.",
    "He streamed a conversation between himself and Cecile Richards, the former president of Planned Parenthood and daughter of former Democratic Gov.",
    "Instead, he highlighted a 15-week abortion ban that he signed into law last month and said he expected it to face state court challenges.",
    "Ann Richards, has tweeted about it more than a dozen of times, and is soliciting fundraising based on his pro-abortion rights position.",
    "His opponent, Republican incumbent Greg Abbott, hasnt mentioned the issue in campaign statements or on social media this week.",
    "If the Supreme Court overturns Roe v. Wade, abortion rights would be set by states, giving governors significant new power.",
    "Mr. Abbott last year signed into law a trigger bill that will outlaw abortion entirely if and when Roe is overturned.",
    "Joe Barrett, Alicia A. Caldwell, Arian Campo-Flores, Kris Maher and Christine Mai-Duc contributed to this article.",
    "Agriculture Commissioner Nikki Fried announced a Freedom to Choose? tour to discuss the leaked opinion.",
    "The vast majority of Pennsylvanians believe women should have sole control over their own bodies.",
    "In Texas, Democratic candidate Beto ORourke has campaigned extensively on the issue all week.",
    "The stakes of this race are high, and this moment is crucial.?\nCalifornias Democratic Gov.",
    "He has also announced plans for rallies and news conferences focused on abortion rights.",
    "Kari Lake, the leading GOP candidate to replace outgoing Republican Gov.",
    "Several of his potential GOP opponents hailed the leaked draft opinion.",
    "Im one of them,? Mr. Shapiro wrote in a post online Wednesday.",
    "Its about time!? tweeted former Republican Lt. Gov.",
    "Some 35% support such a ban, 21% strongly.",
    "In Wisconsin, Democratic Gov.",
    "Rebecca Kleefisch."
  ]
}