{
  "id": 4039,
  "mediaId": 65,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "AP reporter mocks Founding Fathers over possible end to Roe v. Wade: 'Wish we had some founding mothers'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/36564d94-5a0a-481f-9026-4802e7a96ff6/d5b83cfa-dcfd-47d6-9b2c-8ee97e810a07/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/associated-press-reporter-founding-fathers-roe-v-wade-mothers",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandon Gillespie",
  "authorUrl": "https://www.foxnews.com/person/g/brandon-gillespie",
  "termIds": [
    661,
    1889,
    4050,
    4557,
    482
  ],
  "sentences": [
    "Ron DeSantis, who previously criticized Farrington for a heavily scrutinized story last summer that implied the governor was promoting the drug Regeneron to fight the coronavirus because a Chicago-based hedge fund that donated to a political committee that supported him also owned shares of the company.",
    "A reporter for the Associated Press took to Twitter to mock America's Founding Fathers this week, presumably tying their formulation of the three branches of government to his being distraught over the leaked Supreme Court draft opinion showing Roe v. Wade could be overturned.",
    "Farrington's response to the leaked draft opinion fell in line with the tidal wave of other liberals and media figures distraught over the potential end to Roe v. Wade.",
    "Many railed against the document, describing it as \"absolutely appalling,\" and claimed it was a sign of what was to come if Republicans returned to power.",
    "FORMER CBS REPORTER FLIPS OUT OVER ROE V WADE LEAK: F--- YOU TO THOSE WHO SAID I WAS OVERREACTING\n\"How about Freedom of the Press and the First Amendment?",
    "\"Honestly, I respect our founding fathers, (wish we had some founding mothers) I keep a copy of the Constitution in my laptop bag.",
    "One with term limits, one without and one where voters have no say with lifetime appointments.",
    "The tweet was flagged by Christina Pushaw, the press secretary to Republican Florida Gov.",
    "\"So democracy works like this: Three supposedly equal branches of government.",
    "Fox News' Joseph A. Wulfsohn and Brian Flood contributed to this report.",
    "Do those concepts need a little freshening up, a little modernizing?\"",
    "What else would we take as absolute from someone 250 years ago?",
    "former Trump official Michael Caputo wrote in response.",
    "Advice about how to get along with your spouse?",
    "Brendan Farrington wrote in a Tuesday tweet.",
    "Farrington's tweets are currently protected.",
    "Is the great experiment working for you?\"",
    "the liberal reporter added.",
    "Financial advice?\"",
    "Your health?"
  ]
}