{
  "id": 4040,
  "mediaId": 195,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Abortion fight puts spotlight on governors",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/scotus_abortion_050322gn7_lead.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/campaign/3477220-abortion-fight-puts-spotlight-on-governors/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reid Wilson",
  "authorUrl": "https://thehill.com/author/reid-wilson/",
  "termIds": [
    661,
    864,
    1864,
    2069,
    4140,
    145,
    482,
    571,
    2972
  ],
  "sentences": [
    "But it has increased pressure to an even greater degree on Democrats and Republicans vying to win governors mansions and state legislative chambers across the country, where the outcomes of this Novembers midterm elections will determine just how far abortion rights advocates and opponents can advance their positions in the coming years.",
    "More than impacting swing voters, the issue may motivate the Democrat base to be more active.?\nBut Walker said abortion so narrowly divides voters that it is unlikely to change a political climate that has focused more heavily on the state of the economy and rising costs driven by inflation.",
    "The Democratic Governors Association said Wednesday it was reserving about $75 million in television advertisements to defend seats in Michigan, Wisconsin, Minnesota, as well as Colorado, Maine, Nevada and New Mexico, also states where incumbents are running for reelection.",
    "The Supreme Courts draft opinion, which has not yet been finalized, would wholly reverse the precedents set in Roe v. Wade, decided in 1973, and Planned Parenthood v. Casey, decided in 1992, to uphold a Mississippi law banning abortion more than 15 weeks after conception.",
    "Both Democrats and Republicans expect the ruling, likely to be finalized as the courts term ends in June, to upend the political debate ahead of the midterms and to galvanize voters who both favor and oppose abortion rights.",
    "But it cant just be about abortion, it has to be about government not respecting people, especially women.?\nWithout a doubt, it will have a larger impact than normal for state elections,? said former Wisconsin Gov.",
    "The leaked draft of a Supreme Court opinion striking down landmark precedents that protect the right to an abortion has upended the nations capital and the battle for control of the U.S. House and Senate.",
    "Gavin Newsom (D), who is likely headed to reelection, used the draft opinion to launch his first attack advertisement of the campaign, targeting his likely opponent, state Sen. Brian Dahle (R).",
    "If the Democrats handle this right, which is always a question, then I think it is a big boost for the Democratic Party, because it makes a threat thats been going on for 50 years real.",
    "If the draft stands in a form that resembles the leaked version, it would trigger abortion bans in many conservative states that have been preparing for the possibility of Roes demise.",
    "Government picking on people who cant defend themselves.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Tom Wolf (D) is term-limited, and Attorney General Josh Shapiro (D) is running to fill his seat against a host of Republicans who have pledged to crack down on abortion access.",
    "In an interview with the Atlanta Journal-Constitution, former Georgia House Minority Leader Stacey Abrams (D) said the forthcoming ruling would shape much of her message.",
    "The loss or gain of a governorship or even a few state legislative seats this year could shift an entire state into the abortion-denying or abortion-affirming column.",
    "Gubernatorial contests tend to attract less attention than high-profile federal contests, but they are likely to draw a huge amount of spending this year.",
    "Virtually no electoral outcome at the federal level can change the stalemate in Washington, where abortion rights remain locked in a partisan feud.",
    "In his state, Democrats control the state House by a five-seat margin, while Republicans hold just a one-seat majority in the state Senate.",
    "Kevin Stitt (R) last month signed a bill mirroring the Texas version, which would take effect later this year if courts do not block it.",
    "In an interview, Dean said the Supreme Courts ruling gave his party an opportunity to make a larger point about the Republican agenda.",
    "In two states, Michigan and Wisconsin, Democratic governors are running for reelection alongside Republican-controlled legislatures.",
    "As a woman, I am enraged by the continued assault on our right to control our bodies [and] our futures,? Abrams wrote on Twitter.",
    "As the next Governor of Georgia, I will defend the right to an abortion and fight for reproductive justice.?\nCalifornia Gov.",
    "Most of the voters for whom this is the top issue already vote accordingly and should not cause a major shift,? he said.",
    "These governors are critical,? said Howard Dean, the former Vermont governor and Democratic National Committee chairman.",
    "Gretchen Whitmer (D) has filed a lawsuit challenging her states 1931 abortion ban, and both Whitmer and Wisconsin Gov.",
    "Laura Kelly (D) runs a state where Republicans who control the legislature have debated new abortion restrictions.",
    "Several Democrats have already signaled that abortion rights will play a major role in their campaigns this year.",
    "Sisolak faces a difficult reelection bid, and Democrats hold only narrow majorities in the state legislature.",
    "But I also think its going to for once get people off their butts, especially younger people,? Dean said.",
    "Republican governors up for reelection this year have already laid the groundwork for a post-Roe world.",
    "Steve Sisolak (D) signed legislation removing old restrictions on abortions from state law.",
    "It will not likely overcome issues like jobs, schools, spending, taxes, and health care.",
    "Eric Holcomb (R) have all signed bills in the last year to restrict abortion access.",
    "Tony Evers (D) have vetoed bills that would have further restricted abortion access.",
    "Both states have abortion bans on the books dating to the years before Roe v. Wade.",
    "It has to be about government telling you what to do, not just abortion,? he said.",
    "It will drive the Trump loyalists to the polls, the white Christian nationalists.",
    "Tim Walz (D) has threatened to veto any abortion restriction measures.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "In the states, the balance of power is far more precarious.",
    "Greg Abbott (R), South Dakota Gov.",
    "Kristi Noem (R) and Indiana Gov.",
    "Ron DeSantis (R), Texas Gov.",
    "Scott Walker (R).",
    "Pennsylvania Gov.",
    "In Nevada, Gov.",
    "Minnesota Gov.",
    "Michigan Gov.",
    "Oklahoma Gov.",
    "Florida Gov.",
    "Kansas Gov."
  ]
}