{
  "id": 4041,
  "mediaId": 124,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Almost half of LGBTQ youths 'seriously considered' suicide in past year, survey says",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220302-one-time-use-trans-protest-texas-protest-se-219p-b059a8.jpg",
  "link": "https://www.nbcnews.com/nbc-out/out-health-and-wellness/almost-half-lgbtq-youths-seriously-considered-suicide-year-survey-says-rcna27171",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Lavietes",
  "authorUrl": "https://www.nbcnews.com/author/matt-lavietes-ncpn1280564",
  "termIds": [
    661,
    2250,
    3437,
    3578
  ],
  "sentences": [
    "While the Trevor Project only surveyed LGBTQ youths for its latest report, the National Institute of Mental Health  a federal agency that researches mental disorders  estimates that 17 percent of Americans ages 18 to 25 suffer from depression and 11 percent have serious suicidal thoughts.?\nThe report Wednesday coincides with previous surveys on the mental health of LGBTQ youths conducted by the Trevor Project that have consistently found that a large portion of lesbian, gay, bisexual, transgender and queer teens and young adults suffer from a range of mental health issues.",
    "The fact that LGBTQ people are being politicized and weaponized in this latest culture war is actually pretty heartbreaking.?\nPrice added, We hope that lawmakers will learn from this data and act to support LGBTQ youth and not use them as political pawns.?\nDespite the harrowing rates of mental health issues plaguing LGBTQ youths, 80 percent of respondents who said they wanted treatment for mental health issues (or 60 percent of all respondents) said that they could not receive it in the last year.",
    "The mental health of LGBTQ young people has always been in jeopardy  we have never achieved a place of full acceptance and affirmation for LGBTQ people in this country  and, of course, now were taking a step back.?\nThe surveys findings come amid a historic legislative push by state lawmakers across the country to limit the rights of LGBTQ people, particularly transgender minors.",
    "From Jan. 1 to March 15, state legislators proposed a record 238 bills that would limit the rights of LGBTQ people  or more than three a day  about half targeting transgender people specifically, according to an NBC News analysis of data from the American Civil Liberties Union and the LGBTQ advocacy group Freedom for All Americans.",
    "It revealed that 93 percent of transgender and nonbinary respondents said they were worried about being denied access to gender-affirming care, 91 percent said they were worried about being denied access to the bathroom, and 83 percent said they worried about being denied the ability to play sports because of state or local laws.",
    "Respondents who were accepted for their LGBTQ identities at home were 6 percentage points (10 percent versus 16 percent) less likely to have attempted suicide in the past year, while those who were accepted at school were 4 percentage points less likely (13 percent versus 17 percent), the survey found.",
    "They may be living alone with this.?\nPrice said that she wants LGBTQ youths reading the surveys results to know that not everything is doom and gloom,? pointing to data showing that LGBTQ youths who live in an affirming environment reported significantly lower rates of suicide attempts.",
    "Having that affirmation and support from others is highly protective of LGBTQ youth.?\nIf you or someone you know is in crisis, call the National Suicide Prevention Lifeline at 800-273-8255, text HOME to 741741 or visit SpeakingOfSuicide.com/resources for additional resources.",
    "Ron DeSantis signed a bill into law in March that prohibits classroom instruction ... on sexual orientation or gender identity? in kindergarten through grade 3 or in a manner that is not age-appropriate or developmentally appropriate.? (Abbott and DeSantis are Republicans.)",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nProtecting young people and taking action to prevent something, to me, is something that transcends politics,? Myeshia Price, a senior research scientist at the Trevor Project, said.",
    "Nearly half of LGBTQ youths in the United States have seriously considered? suicide in the past year, a survey released on Wednesday found, piling onto concerns for a vulnerable group of adolescents amid a nationwide culture war over LGBTQ issues.",
    "The most commonly cited actions included: using their childrens pronouns correctly, educating themselves about LGBTQ history, and being welcoming to their childrens LGBTQ friends or partners.",
    "Youths surveyed cited fears of discussing mental health issues, fears of not being taken seriously and concerns with obtaining parental permission as the top obstacles to receiving care.",
    "Among the reports key findings is that 73 percent of respondents reported symptoms of generalized anxiety disorder and 58 percent reported symptoms of major depressive disorder.",
    "Greg Abbott directed the states Child Protective Services agency to investigate parents who were suspected of providing their trans children with gender-affirming care.",
    "Im shocked and not surprised,? said Dr. Scott Hadland, the chief of adolescent and young adult medicine at MassGeneral Hospital for Children and Harvard Medical School.",
    "If you are an LGBTQ young person in crisis, feeling suicidal or in need of a safe and judgment-free place to talk, call the TrevorLifeline now at 1-866-488-7386.",
    "Many young LGBTQ people may not feel comfortable talking to health counselors about some of these issues because of the stigma they perceive,? Hadland said.",
    "The survey, conducted by the Trevor Project, an LGBTQ youth suicide prevention and crisis intervention group, polled 34,000 LGBTQ people aged 13 to 24.",
    "The survey released Wednesday found that the bills have negatively affected the mental health of the vast majority of LGBTQ youths polled.",
    "The survey also laid out LGBTQ youths recommendations for how parents can make their queer children feel supported.",
    "Anti-LGBTQ legislation also garnered national attention and debate when Florida Gov.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Lawmakers in Texas made national headlines in February after Gov.",
    "Thats something that everyone can do,? Price said.",
    "A state judge temporarily blocked the directive.",
    "Follow NBC Out on Twitter, Facebook & Instagram"
  ]
}