{
  "id": 4043,
  "mediaId": 65,
  "date": "d2022-05-04T18:00",
  "headline": "New MSNBC host gets defensive when reporter suggests she might give Jill Biden softball interview",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/e6505461-3eb3-4c8c-96f1-87f8c472f84a/2ddacdd1-aecf-42fa-852d-cc2be2269847/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/new-msnbc-host-gets-defensive-when-reporter-suggests-she-might-give-jill-biden-softball-interview",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hanna Panreck",
  "authorUrl": "https://www.foxnews.com/person/p/hanna-panreck",
  "termIds": [
    661,
    895,
    915,
    1958,
    3840,
    4709,
    327,
    3373
  ],
  "sentences": [
    "Symone Sanders, a new MSNBC host and the former senior advisor and chief spokesperson for Vice President Kamala Harris, responded on Wednesday to Politico White House correspondent and West-Wing Playbook writer Alex Thompson, who wondered if her upcoming appearance with the First Lady would be a \"softball interview.\"",
    "The former adviser to the vice president said that regardless of party affiliation, it \"is an opportunity to learn more about her, the role, how she & her husband handle the pressures etc.",
    "\"One could argue, I was critical of Governor DeSantis, and still am, during the height of Covid, but if you really look at the numbers, Florida actually came out all right.",
    "SYMONE SANDERS: WHAT TO KNOW ABOUT KAMALA HARRIS' CHIEFS SPOKESWOMAN\nSanders announced that she would resign from her position with the vice president in December 2021.",
    "Sanders appeared on an \"MTP Daily\" panel to discuss the district court judge who voided the federal mask mandate for airlines in late April.",
    "Thompson noted the interview scheduled with First Lady Dr. Jill Biden for the premiere of Sanders' new MSNBC show \"Symone\" on May 7.",
    "She followed up with another defensive tweet saying that it was an interview with a First Lady who doesn't do many interviews.",
    "\"In other words, does she go the Stephanopoulos route or is this a softball interview by a former admin official.\"",
    "Kate Childs Graham, the former chief speechwriter, left the vice president's office at the end of February.",
    "Sanders responded to Thompson by saying she currently was doing research for the upcoming interview.",
    "Maybe I should pin her down on the conservative media constantly targeting her unelected son??\"",
    "\"Will be interesting to see if this interview is tough or not,\" Thompson wrote on Twitter.",
    "And the economy is strong,\" Sanders said of the Florida governor's handling of COVID-19.",
    "Harris' office has seen a number of staffing changes in recent months.",
    "Most recently, deputy chief of staff Michael Fuchs quit on April 4.",
    "\"Exactly which 'policy' would you suggest I grill FLOTUS on?",
    "I dont think this is where we get answers on the border.\"",
    "Her spending Mothers Day with mothers in Eastern Europe?",
    "Ron DeSantis', R-Fla., political appeal.",
    "The conversation pivoted to Gov.",
    "He has a story to tell.",
    "Military families?",
    "Sanders said."
  ]
}