{
  "id": 4044,
  "mediaId": 65,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "FL judge says Biden border policies merely a speedbump for migrants as catch-and-release lawsuit advances",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/b95b5b78-5785-46bc-8f6d-81a5fcf0f3e1/bde712b5-8376-4379-aba0-3b7ebdefb70c/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/florida-judge-biden-policies-speedbump-migrants-catch-release-lawsuit",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelly Laco",
  "authorUrl": "https://www.foxnews.com/person/l/kelly-laco",
  "termIds": [
    661,
    1147,
    2087,
    4556,
    553,
    2661
  ],
  "sentences": [
    "Wetherell's order states that the Biden administration has \"adopted and are implementing policies that contravene explicit mandates and restrictions in the immigration statutes and that the policies have effectively turned the southern border into little more than a speedbump for the hundreds of thousands of aliens who have flooded across the border into the country since January 2021 and the thousands more who are arriving at the border daily.\"",
    "FEDS RELEASING 'NUMEROUS' MIGRANTS FAR FROM SOUTHERN BORDER IN 'CATCH AND RELEASE' SYSTEM 'ON A GRANDER SCALE'\nWhen Biden first took office in 2021, he signed several immigration-related executive orders, which included revoking then-President Trumps order ending the catch and release policy, by which migrants were released into the interior after being apprehended.",
    "As the order states, not even the President is above the law, and I look forward to advancing our case to hold the Biden administration accountable for ignoring public-safety immigration laws and turning our nations last bastion of protection into nothing more than a speedbump,\" Moody said in an exclusive statement to Fox News Digital.",
    "The United States District Court for the Northern District of Florida ruled Wednesday that the lawsuit can move forward, throwing out the Biden administration's motion to dismiss the case, with Judge T. Kent Wetherell issuing a scathing opinion saying the court was \"wholly unpersuaded\" by the administration's position.",
    "Wetherell wrote that the court was unconvinced that the Biden administration has \"unfettered discretion to determine how (or if) to comply with the immigration statutes and that there is nothing that Florida or this Court can do about their policies even if they contravene the immigration statutes.\"",
    "In September 2021, the state of Florida sued the Biden administration over its \"illegal\" catch-and-release policies saying they cause harm to the state's \"quasi-sovereign interests,\" while claiming officials are either in violation of federal immigration law, or simply abusing their authority.",
    "EXCLUSIVE: Florida's lawsuit against the Biden administration over its so-called \"catch-and-release\" policy advanced Wednesday, with a federal judge saying that Biden's policies have turned the southern border into \"little more than a speedbump\" for illegal immigrants.",
    "The administration is also facing backlash from both Democrats and Republicans for ending Title 42, a public health order set to expire on May 23 that has been used since March 2020 to quickly expel a majority of migrants at the border due to the COVID-19 pandemic.",
    "(ERNST PETERS/ THE LEDGER/Reuters)\n\"Thus, if Floridas allegations that Defendants are essentially flaunting the immigration laws are proven to be true, the Court most certainly can (and will) do something about it,\" the judge's opinion continues.",
    "Under the former Trump administration, the catch-and-release policy was limited due to the enforcement of the Migrant Protection Protocols (MPP) in 2019, also known as the Remain in Mexico program.",
    "\"This is about how America is safer, stronger, more prosperous when we have a fair, orderly, and humane legal immigration system,\" Biden said at the time.",
    "The Biden administration officially ended MPP in June and was sued by a several GOP-led states, which took the case all the way up to the Supreme Court.",
    "He called the Biden administration's policy \"as remarkable as it is wrong\" because no one is above the law, including the president.",
    "Florida Attorney General Ashley Moody filed the suit against the administration as part of a joint effort with Florida Gov.",
    "\"Todays order is a huge win in our fight to force the Biden administration to fix the crisis by following the law.",
    "Ron DeSantis to \"uphold the rule of law despite the Biden administration's decision to violate the law.\"",
    "Fox News' Brooke Singman and Adam Shaw contributed to this report.",
    "The Department of Justice declined to comment on the opinion.",
    "The high court is set to rule on it in the coming months."
  ]
}