{
  "id": 4046,
  "mediaId": 65,
  "date": "d2022-05-04T17:06",
  "headline": "Mark Penn on 'Kilmeade Show': Ron DeSantis 'significantly ahead' for 2024 if Trump doesn't run",
  "image": "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/e873a9c7-3f3b-4da4-8188-836f348dc0d9/a862ba0c-6bea-4e97-a2ed-f12c2da157c7/1280x720/match/720/405/image.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/media/ron-desantis-presidential-2024-trump-run-mark-penn",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fox News Staff",
  "authorUrl": "https://www.foxnews.com/person/s/fox-news-staff",
  "termIds": [
    661,
    1147,
    1303,
    2087,
    2314,
    4447,
    146,
    428,
    2661
  ],
  "sentences": [
    "MARK PENN: On the Republican side, I do see DeSantis really getting stronger and stronger and emerging  if Trump either runs and he runs against him or Trump doesn't run, DeSantis clearly has put himself significantly ahead of everybody else on the Republican side.",
    "The former Clinton pollster and president of The Stagwell Group said on \"The Brian Kilmeade Show\" that DeSantis is \"significantly ahead\" of all Republican contenders outside of former President Trump, who has not announced whether he will run for another term.",
    "But neither party right now seems to be able to get past the two people that the broad swing voters like least.",
    "So there's not really a strong bench at the moment for a candidate compared to the Republican bench.",
    "And I think you've got to give her 60, 70% and keep it as is the only other figure out there.",
    "Ron DeSantis \"getting stronger\" on the Republican side for the 2024 presidential election.",
    "There is a tradition in the Democratic Party that the vice president becomes the nominee.",
    "And then if Biden doesn't run, Harris is the vice president.",
    "I think on the Democratic side, it's will Biden run?",
    "Mark Penn said Wednesday he sees Florida Gov.",
    "After all, Biden was the vice president.",
    "LISTEN TO THE FULL INTERVIEW BELOW:",
    "Walter Mondale, Hubert Humphrey."
  ]
}