{
  "id": 4048,
  "mediaId": 302,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Florida prepares to resume manatee rescue efforts this winter",
  "image": "https://www.tampabay.com/resizer//F9jFBqdZMLI1BmE2TJJgvaBFEKY=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/CXGBYDWHARAEDFCYKV42KH3T6Q.jpg",
  "link": "https://www.tampabay.com/news/environment/2022/05/04/florida-prepares-for-winter-manatee-rescue-efforts/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3283,
    3290,
    3614,
    2671
  ],
  "sentences": [
    "After providing more than 200,000 pounds of lettuce to starving manatees because of depleted seagrass beds in state waters, Florida Fish and Wildlife Conservation Commission Executive Director Eric Sutton said Tuesday efforts are already underway to prepare for next winter.",
    "Right now, were doing an after-action and looking at all the things that we did, get our notes together, get our act, you know, squared away based on what weve learned and preparing for next year, because this is a marathon.?\nSuttons comments came a day after Gov.",
    "The feeding program ran from Dec. 14 to March 31, mostly around Florida Power & Lights Cape Canaveral Clean Energy Center, where manatees congregate seeking warm water.",
    "Sutton said the state agency provided 202,000 pounds of lettuce to manatees gathered in warm-water spots this winter and early spring along the East Coast.",
    "Ron DeSantis announced he would approve more than $30 million in the upcoming years state budget to help manatees after a record number of deaths in 2021.",
    "Fish and Wildlife Service continues,? Sutton said during a commission meeting at the Hilton University of Florida Conference Center in Gainesville.",
    "Seagrass beds, which are prime foraging areas for manatees, have been depleted because of poor water quality and algae blooms.",
    "That was down from 694 at the same point in 2021, when a record 1,101 manatee deaths were reported.",
    "The unprecedented feeding program cost about $116,000, with almost all of the money donated.",
    "But this years number remains significantly higher than the normal pace of deaths.",
    "This year, the state had recorded 527 manatee deaths through April 22.",
    "The incident command that we share with U.S."
  ]
}