{
  "id": 4049,
  "mediaId": 675,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Disney's stock plummets amid embrace of woke politics",
  "image": "https://www.wnd.com/wp-content/uploads/2022/05/mary-poppins-soot-disney-600.jpg",
  "link": "https://www.wnd.com/2022/05/disneys-stock-plummets-amid-embrace-woke-politics/",
  "sentiment": "0.0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Art Moore",
  "authorUrl": "https://www.wnd.com/author/amoorewnd-com/",
  "termIds": [
    661
  ],
  "sentences": [
    "TRENDING: Archaeologists find cave, then realize 70,000 Christians may have hidden in biggest underground city on Earth\nOver the past year, the value of its shares has fallen more than 30%, making it the worst performing stock of the Dow Jones Industrial Average index.",
    "\"Actually, if youre a CEO in a public company today, you find yourself sandwiched not just between your progressive, woke employees,\" he said, but also the shareholders, who are \"quietly whispering in your ear that they want to see you doing the same things, too.\"",
    "World\nCommentary\nJerry Newcombe\nDennis Prager\nStar Parker\nBen Shapiro\nRead all of today's COMMENTARY...\nMoney\nPolitics\nU.S.\nHealth\nEducation\nDiversions\nFaith\nMORE COMMENTARY\nLarry Tomczak\nStephen Moore\nAndy Schlafly\nRead all of today's COMMENTARY...\nNew Section",
    "Florida's Parental Rights in Education law, mischaracterized by opponents as the \"Don't Say Gay\" bill, bans \"classroom instruction by school personnel or third parties on sexual orientation or gender identity\" in kindergarten through third grade.",
    "Since March, when Florida passed a law requiring that discussions of certain sexual issues in public schools be \"age-appropriate,\" Disney's market capitalization is down $62.6 billion, from $265.3 to $202.7 billion, Breitbart News reported.",
    "Meanwhile, entrepreneur and political commentator Vivek Ramaswamy believes Disney's embrace of radical transgender activism largely is influenced not by disgruntled and activist employees but by the entertainment giant's biggest investors.",
    "Disney reacted, declaring in a statement that its goal \"is for this law to be repealed by the legislature or struck down in the courts, and we remain committed to supporting the national and state organizations working to achieve that.\"",
    "In another leaked video, Disney corporate president Kathy Burke told employees that \"as the mother [of] one transgender child and one pansexual child,\" she supports having \"many, many, many LGBTQIA characters in our stories.\"",
    "Shares of the Walt Disney Co. have dropped 23.5% since the entertainment giant declared it would fight Florida's parental rights law amid exposure of the entertainment giant's radical LGBT activism targeting children.",
    "A member of Disney's \"Imagineering\" team of creative talent wrote a column under a a pseudonym citing internal communications that demonstrate the company has been \"rotting from the inside for quite some time.\"",
    "Those were the words of Latoya Raveneau, an executive producer who\ntold her colleagues during a meeting in March that she and her team are regularly \"adding queerness\" to children's programming.",
    "Ron DeSantis and the GOP-majority legislature eliminated earlier this month the special taxing district that enables Disney to self-govern its theme-park area.",
    "Content created by the WND News Center is available for re-publication without charge to any eligible news publisher that can provide a large audience.",
    "He points out that the company's three largest shareholders are the nation's three largest asset managers, BlackRock, State Street and Vanguard Group.",
    "If you appreciate our Christian journalists and their uniquely truthful reporting and analysis, please help us by becoming a WND Insider!",
    "Leaked videos of virtual meetings with Disney executives confirmed the company's \"not-at-all-secret gay agenda.\"",
    "DeSantis said Disney's statement in opposition to the law was \"fundamentally dishonest\" and \"crossed the line.\"",
    "It also bars teaching \"in a manner that is not age appropriate or developmentally appropriate for students.\"",
    "\"This state is governed by the interests of the people of the state of Florida,\" the governor said.",
    "For licensing opportunities of our original content, please contact licensing@wndnewscenter.org.",
    "Together they manage more than $20 trillion, which is more than the GDP of the United States.",
    "If you like WND, get the news that matters most delivered directly to your inbox  for FREE!",
    "She said she wants a minimum of 50% of characters to be LGBTQIA and racial minorities.",
    "For 25 years, WND has boldly brought you the news that really matters.",
    "\"It is not based on the demands of California corporate executives.",
    "They do not control this state.\"",
    "In response, Republican Gov.",
    "They do not run this state."
  ]
}