{
  "id": 4051,
  "mediaId": 302,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "What you need to know about the future of abortion in Florida",
  "image": "https://www.tampabay.com/resizer//ZfuhwToffMkxsNzEsr_em54mvaE=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/QTQVUU6MPFENFBD2VQS4BGTZMU.jpg",
  "link": "https://www.tampabay.com/news/health/2022/05/04/what-you-need-to-know-about-the-future-of-abortion-in-florida/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ian Hodgson",
  "authorUrl": "https://www.tampabay.com/author/ian-hodgson",
  "termIds": [
    661,
    243,
    482,
    2661,
    2945
  ],
  "sentences": [
    "However, state law allows third-trimester abortions in cases in which the pregnant persons life could be at risk, or in which the pregnant person risks irreversible physical impairment of a major bodily function.?\nWhat will change under the new 15-week abortion ban passed by Florida lawmakers?",
    "The new law includes exceptions for people whose health is threatened by the pregnancy or if their baby has a fatal fetal abnormality.? Floridas law was based on the Mississippi law that is the subject of the leaked U.S. Supreme Court draft decision published by Politico.",
    "The treatment is only an option in the first 10 weeks of pregnancy and cannot be performed on patients who have an intrauterine device (IUD), severe heart or lung disease, bleeding disorders, or take blood thinners or certain types of steroid medications.",
    "Federal regulators as of December 2021 relaxed restrictions on medication abortions, allowing doctors to prescribe abortion medications online or over the phone and pharmacies to send the medication through the mail.",
    "A medication abortion doesnt require surgery or anesthesia and can be safely done in a clinic, doctors office, or at home with a follow-up appointment 1-2 weeks later, according to federal health officials.",
    "The draft of a U.S. Supreme Court opinion suggests that conservatives on the court have the votes to overturn the landmark 1973 Roe v. Wade ruling that established a pregnant persons right to an abortion.",
    "For now, Florida is not one of 13 states that have passed so-called trigger laws, which put bans or limits on abortion that go into effect if Roe Vs. Wade is struck down.",
    "The new law does permit abortions after 15 weeks if carrying the pregnancy to term would put the pregnant persons life at risk or cause irreversible physical impairment.",
    "Heres a look at how Floridas legal landscape on abortions stands now and what will change:\nAt what point during a pregnancy is abortion currently legal in Florida?",
    "Although Florida law doesnt ban telehealth prescriptions outright, the in-person requirement means they arent an option for Florida residents seeking an abortion.",
    "Some groups, like Aid Access, have sought to circumvent state law by using physicians and pharmacies located abroad, outside U.S. legal jurisdiction.",
    "In either case, two physicians must certify the decision in writing  though one physician can certify the procedure if no other doctor is available.",
    "State data doesnt specify when during a trimester an abortion is performed, so its unclear how many abortions would be affected by the 15-week ban.",
    "The new law also requires abortion providers to count the number of medicine-induced abortions each month and report that number to the state.",
    "As of 2020, medical abortion accounted for the majority of all U.S. abortions, according to a survey conducted by the Guttmacher Institute.",
    "In Florida only licensed physicians can prescribe the two-part treatment and the first pill has to be taken in a clinic or hospital.",
    "Will the new law allow a pregnancy to be terminated for medical reasons, to prevent the patient from suffering fatal complications?",
    "If the U.S. Supreme Court overturns Roe v. Wade, that would return control of the availability of abortions to state government.",
    "However, as of June 2020, Florida minors are required to have consent from a parent or guardian before terminating a pregnancy.",
    "A minor can get the requirement waived if a judge rules that they are sufficiently mature? to make the decision by themselves.",
    "Floridas 15-week ban would become law on July 1  but the Legislature could pass more restrictions later this year or next.",
    "Under state law, the prescribing physician must meet with the patient in person at least 24 hours before the treatment.",
    "Of those second-trimester abortions, three were performed in cases of incest and 14 were performed in cases of rape.",
    "The first medication, mifepristone, terminates the pregnancy and the second, misoprostol, helps the body expel it.",
    "Using medication to induce abortion is an increasingly popular option for people who are up to 10 weeks pregnant.",
    "DeSantis or legislators could call a special session to pass even stricter limits, or a total ban on abortions.",
    "Can Florida patients receive abortion pills prescribed remotely by out-of-state doctors under the new law?",
    "Will the new Florida law make exceptions for pregnancies arising from rape, incest or human trafficking?",
    "Beginning July 1, Florida will have the states strictest ban on abortions in the post Roe v. Wade era.",
    "What happens to abortions in Florida if the U.S. Supreme Court draft opinion becomes legal precedent?",
    "But Floridas own abortion laws will soon change regardless of what the nations highest court does.",
    "It is not known when the final ruling will be issued, or how similar it will look to the draft.",
    "About 4,500 abortions were performed in the second trimester, after 12 weeks of pregnancy.",
    "How many abortions are performed in Florida and how many would be affected by the new law?",
    "Ron DeSantis signed into law a bill that bans most abortions after 15 weeks of pregnancy.",
    "If the abortion is not performed in the first 15 weeks, the baby must be carried to term.",
    "Most abortions will only be legal if performed in the first 15 weeks of a pregnancy.",
    "Florida law allows abortion until the third trimester  about 24 weeks of pregnancy.",
    "Many clinics require that patients schedule a follow-up appointment 2 weeks later.",
    "Will medication abortion options still be allowed in Florida under the new law?",
    "Medication abortions would still be available but subject to the 15-week ban.",
    "That is around the time when a baby begins to become viable outside the womb.",
    "The pregnancy can also be terminated if the fetus has a fatal abnormality.",
    "The new law does not impose any new age restrictions on abortion access.",
    "Florida reported that about 75,000 abortions were performed in 2021.",
    "Those must all be carried to term after 15 weeks under the new law.",
    "They could also decide to wait until the 2023 legislative session.",
    "The treatment consists of two medications taken over 48 hours.",
    "The second medication can be taken at home.",
    "Will minors be able to get an abortion?",
    "What if it is a nonviable pregnancy?",
    "How do medication abortions work?",
    "It takes effect July 1.",
    "Last month Gov.",
    "Yes.",
    "Yes.",
    "No.",
    "No."
  ]
}