{
  "id": 4056,
  "mediaId": 675,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Leaking Supreme Court draft called a 'judicial insurrection'",
  "image": "https://www.wnd.com/wp-content/uploads/2022/02/ron-desantis-cpac-2022-orlando-florida-jpg.jpg",
  "link": "https://www.wnd.com/2022/05/leaking-supreme-court-draft-called-judicial-insurrection/",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    661,
    128,
    482,
    539,
    3508,
    2661,
    2851
  ],
  "sentences": [
    "That is not something thats appropriate for the judicial branch.?\nTRENDING: Archaeologists find cave, then realize 70,000 Christians may have hidden in biggest underground city on Earth\nThey need to figure out who did that and they need to hold them accountable because thats a real significant breach of trust.",
    "World\nCommentary\nJerry Newcombe\nDennis Prager\nStar Parker\nBen Shapiro\nRead all of today's COMMENTARY...\nMoney\nPolitics\nU.S.\nHealth\nFaith\nDiversions\nEducation\nMORE COMMENTARY\nLarry Tomczak\nStephen Moore\nAndy Schlafly\nRead all of today's COMMENTARY...\nNew Section",
    "Ron DeSantis (R-FL) on the leaked Supreme Court draft opinion to overturn Roe v. Wade pic.twitter.com/LhU69qLFg7\n The Recount (@therecount) May 3, 2022\nPolitico published a draft version of the courts majority opinion in Dobbs v. Jackson Womens Health Monday.",
    "I think it was an intentional thing to try to whip up a lot of the public to try to make it very political, potentially try to bully them into changing one of their positions,? DeSantis said at a Tuesday press conference.",
    "Liberals responded to the leak with calls for dramatic actions in congress including abolishing the Senate filibuster to ram through court-packing and the codification of the Roe precedent into federal law.",
    "Ron DeSantis slammed the leak of the Supreme Courts draft opinion revealing that justices would likely overturn Roe v. Wade, which he viewed as an attempt to influence the Courts final decision.",
    "You want to talk about an insurrection, thats a judicial insurrection, to be taking that out and trying to kneecap a potential majority through extra constitutional means,? DeSantis said.",
    "Content created by The Daily Caller News Foundation is available without charge to any eligible news publisher that can provide a large audience.",
    "The leaker was attempting to pressure justices and intervene in the constitutional process, according to DeSantis.",
    "For licensing opportunities of our original content, please contact licensing@dailycallernewsfoundation.org.",
    "You wanna talk about an insurrection, thats a judicial insurrection.?\n Gov.",
    "This story originally was published by the Daily Caller News Foundation.",
    "By Laurel Duggan\nDaily Caller News Foundation\nRepublican Florida Gov.",
    "I think it was really an attack on a lot of the justices."
  ]
}