{
  "id": 4058,
  "mediaId": 132,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Give peace a chance in America's culture wars",
  "image": "https://cdn.newsday.com/ace/c:ZjkzNjRhZjgtYzA1ZS00:YTZlZDQ4/preview/1280",
  "link": "https://www.newsday.com/opinion/commentary/america-culture-wars-sal4dd34",
  "sentiment": "0.0",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lynn Schmidt",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "In March, Floridas Republican governor, Ron DeSantis, signed the Parental Rights in Education Bill,? which reinforces parents rights to make decisions regarding the upbringing of their children.? The bill prohibits classroom instruction on sexual orientation or gender identity in kindergarten through third grade and prohibits instruction that is not age appropriate for students and requires school districts to adopt procedures for notifying parents if there is a change in services from the school regarding a childs mental, emotional or physical health or well-being.",
    "James Davison Hunters 1991 book, Culture Wars: The Struggle to Define America,? focused on the convergence of Christian fundamentalists, Orthodox Jews and conservative Catholics in a battle against their progressive counterparts for control of American secular culture,? the book cover states.",
    "We can refuse to engage in culture war combat, we can work to build back our local communities, start to trust our institutions again, encourage that trust to grow, and reward politicians who refuse to engage in culture war battles with our votes.",
    "After DeSantis signed the bill, woke employees of Disney World  the top employer in central Florida  demanded that the Walt Disney Corporation condemn the bill, and Disney Chief Executive Bob Chapek vowed to fight for its repeal.",
    "The losers in this current battle are the improvement districts 300 employees, who could lose their jobs, and the taxpayers who were warned that their property taxes may jump by 20% to cover the cost of the districts services.",
    "DeSantis retaliated by asking Florida lawmakers to repeal a provision, known as the Reedy Creek Improvement District, that gives Disney the right to govern itself like a city since 1967.",
    "I am by no means suggesting that our society should not be debating how to deal with change, to decide what is important to our communities, and to decide the values we want to hold.",
    "As an old-school conservative, I have a nuanced take on the Florida situation, which I am quite aware no longer fits into the current, populist Republican Partys beliefs.",
    "Disney can raise its own revenues to pay for municipal infrastructure expenses like roads, water, waste services, and fire safety and ambulance services at Disney World.",
    "The culture wars are used as a cudgel for both the right and the left, who typically portray the other side as an existential threat to their very survival.",
    "When politicians and elected officials spend their time engaging in culture war issues, they stop spending their time on the pragmatic tasks of governing.",
    "As the battles rage on between the woke left and the anti-woke right, it seems clear to me that there will be no winners, only losers.",
    "I believe in parental rights but think the conversations about curriculum should be taking place at the local, school district level.",
    "The culture wars are a response to the conflict between the secularization of society and the values many Americans still adhere to.",
    "Critics of the bill started calling it the Dont say gay? bill, even though there is no mention of the word gay in the bill.",
    "If its revoked, the state of Florida acknowledges it will not be able to cover the improvement districts bond obligations.",
    "I have a confession when it comes to the culture war our society is mired in: I consider myself a pacifist on this front.",
    "Reedy Creek also issues bonds and levies taxes on properties within its boundaries effectively on behalf of Disney.",
    "The new bill is slated to take effect on July 1, although the changes wont become enforceable until June 2023.",
    "I am suspicious of a strong central government, so I think the Florida governor and legislature overreached.",
    "Those losers are the majority of Americans, in the middle, who want a government that actually governs.",
    "I also believe in free markets, privatization, free trade, deregulation and minimal government debt.",
    "I imagine there are plenty of Floridians who could identify far more urgent issues worth addressing.",
    "The bill passed to dismantle the improvement district is antithetical to all of those beliefs.",
    "The bill is vague and would make it difficult for school districts and teachers to comply.",
    "I also prefer, probably unrealistically, that corporations stay out of political fights.",
    "Lynn Schmidt is a columnist and Editorial Board member of the St. Louis Post-Dispatch.",
    "Then there are those who inflame these grievances and resentments for political gain.",
    "As with most issues in our politics today, the bill came under a national spotlight.",
    "But at its heart, as always, is a struggle for Americas cultural identity.",
    "So how can political culture war pacifists give peace a chance?",
    "The culture wars have certainly evolved in the 31 years since.",
    "I am proposing that the culture wars be removed from politics.",
    "Those bonds total $1 billion."
  ]
}