{
  "id": 4063,
  "mediaId": 151,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "SCOTUS reveal fuels Florida's anti-abortion push",
  "image": "https://static.politico.com/d3/05/ba68c9f5400bbef72003544b41ba/fineoutlogo.jpg",
  "link": "https://www.politico.com/newsletters/florida-playbook/2022/05/04/scotus-reveal-fuels-floridas-anti-abortion-push-00029852",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3852,
    4255,
    4265,
    4577,
    122,
    482,
    2661,
    2926
  ],
  "sentences": [
    " Central Florida doctors, abortion advocates outraged, say Roe v. Wade overturn would be deadly,\" by Orlando Sentinels Kate Santich, Caroline Catherman and Ryan Gillespie\n We will be ready: Biden responds to draft abortion opinion,\" by POLITICOs Quint Forgey\n What Rights Could Unravel Next,\" by Robert Tsai for POLITICO Magazine\n What to know about Floridas abortion law as Supreme Court looks to end Roe v. Wade,\" by Miami Heralds Michelle Merchante\nPENINSULA AND BEYOND\nCAFFINATED  \"Starbucks workers in Tallahassee win union election; first site in Florida to secure victory,\" by the Tallahassee Democrats' Christopher Cann: \"A Tallahassee Starbucks location has become the first in the state to unionize after workers secured a victory in a 16-to-1 vote Tuesday afternoon.",
    "'?\nOTHER STATES  At least 19 states to offer refuge to trans youth and families amid anti-LGBTQ legislation wave? by ABC News' Kiara Alfonseca\nTRUMPLANDIA AND THE SWAMP\nTHE SWAMP  Trump organizations agree to pay $750,000 to settle lawsuit with D.C.? by Washington Posts Keith Alexander: \"The Trump Organization and former president Donald Trumps presidential inaugural committee on Tuesday agreed to pay the District $750,000 to settle a lawsuit the city filed alleging the organizations misused nonprofit funds to benefit the former president and his family.",
    "ODDS, ENDS AND FLORIDA MEN\nMID-AIR TANTRUM  Man who assaulted flight attendants, was duct taped on flight, sentenced to jail,\" by ABC News Sam Sweeney: \"A 23-year-old man featured in a video that went viral after he groped two flight attendants, punched a third, screamed his parents had $2 million and was duct taped to a seat of a Frontier Airlines flight was sentenced this week to 60 days in jail followed by one year of supervised release.",
    "Birthdays: State Sen. Tina Polsky  Palm Beach State Attorney Dave Aronberg\nFollow us on Twitter\nGary Fineout @fineout\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Get in touch: gfineout@politico.com\nDRIVING THE DAY\nDESANTIS AND REPUBLICANS  \"Energized by SCOTUS, anti-abortion group urges DeSantis to further restrict abortions,\" by POLITICO's Arek Sarkissian and Matt Dixon: \"A draft Supreme Court opinion that would overturn the landmark Roe v. Wade decision has energized anti-abortion groups in Florida, with one organization on Tuesday lobbying Gov.",
    "FLORIDA PROTESTS  Tampa Bay protesters speak out about possible overturning of abortion ruling,? by Tampa Bay Times Josh Fiallo and Michaela Mulligan: Hundreds protested on both sides of Tampa Bay Tuesday in the wake of a leaked draft of a U.S. Supreme Court opinion that would overturn Roe v. Wade and end nearly 50 years of precedent that protects a persons right to abortion.",
    "Heres why.? by Tampa Bay Times Kirby Wilson\nON THE LEFT  Dems vow abortion rights floor fight in wake of Roe draft opinion,? by POLITICOs Marianne LeVine and Sarah Ferris: Senate Democratic leaders pledged Tuesday to soon vote to protect abortion rights in the wake of a leaked draft of a Supreme Court majority opinion to possibly overturn the landmark Roe v. Wade decision.",
    "In a fundraising appeal, Rep. Val Demings (D-Fla.), who is challenging Sen. Marco Rubio (R-Fla.) this fall, said we need a fighter in the Senate who will respect the right for women to make their own choices.? Even President Joe Biden highlighted the upcoming midterms, saying it will fall on voters to elect pro-choice officials this November.\"",
    "MAPMAKER, MAPMAKER\nANOTHER LAWSUIT  Jacksonville sued for councils alleged racially gerrymandered redistricting,\" by The Tributarys Andrew Pantazi: \"Civil-rights groups sued Jacksonville on Tuesday for its City Council redistricting map that they say reduces Black voting power by illegally packing them into a few districts.",
    "The citys Office of the Attorney General filed a lawsuit in 2020 in D.C. Superior Court alleging the inaugural committee, a nonprofit corporation, coordinated with Trumps family to overpay for event space in the Trump International Hotel in downtown Washington and even paid for space on days when it did not hold events.",
    "Other GOP leaders also demurred, including Speaker Chris Sprowls, who posted on Twitter that he believes Roe v. Wade is an abuse of power? while incoming Senate President Kathleen Passidomo (R-Naples) released a statement saying she looked forward the high courts official ruling, which is expected over the summer.",
    "This would not be the end of the pro-life movement but simply the beginning.?\nThe Tallahassee-based Florida Voice for the Unborn went much further, urging DeSantis to press the Legislature to approve a near-total ban on abortions in the state during the upcoming May 23-27 special session.",
    "Tuesdays redistricting lawsuit in the U.S. District Court for the Middle District of Florida came after the Jacksonville City Council passed the map and Mayor Lenny Curry signed it over the objections of residents who protested the redistricting plan over racial gerrymandering concerns.",
    "Ken Griffin, CEO of the Citadel hedge fund and a GOP megadonor, said he didnt 'appreciate' DeSantis going after Disneys status in Florida law after the corporation spoke out against HB 1557, officially titled Parental Rights in Education but known by critics as the 'dont say gay' law.",
    "GOP leaders trained their fire on the breach of Supreme Court protocol that led to POLITICOs publication of the draft opinion by the courts conservative majority, with only a handful of Republicans cheering the substance of the document itself even though the GOP has long opposed Roe.",
    "FRIENDS IN HIGH PLACES  Come November, two DeSantis allies could be sitting on the Miami-Dade School Board,\" by Miami Heralds Sommer Brugal: \"When the Miami-Dade School Board emerges from the November election, its likely there will be two new people on the board with ties to Gov.",
    "I am pleading with you to act swiftly to save the lives of Floridas unborn children by immediately amending your April 26th proclamation to include consideration of legislation that would provide a near-total ban on abortions,? wrote Andrew Shirvell, the groups executive director.",
    "NIKOLAS CRUZ TRIAL  The long and challenging process of selecting a jury in a death penalty case,\" by Palm Beach Posts Jorge Milian: \"Confessed mass shooter Nikolas Cruz has the constitutional right to have his death penalty trial judged by a jury representative of his community.",
    "The Jacksonville Branch of the NAACP, the Northside Coalition, the ACLU of Florida Northeast Chapter and Florida Rising, along with 10 Jacksonville voters, asked the court to invalidate seven of the citys 14 council districts and three of Duval Countys seven School Board seats.",
    "DeSantis reaction  When asked during a press conference, however, the governor wouldnt say if he would seek a more restrictive ban than Floridas current statute, which outlaws abortions after 15 weeks of pregnancy and doesnt provide exemptions for cases of rape or incest.",
    "During the first three weeks of jury selection in Cruz's case, scores of juror candidates have been dismissed after telling Circuit Judge Elizabeth Scherer that serving for the trial's expected duration of three to four months would result in economic hardship.",
    "Facing yet another existential challenge in President Joe Bidens presidency, Democrats are confronting the same problems that have stymied much of their agenda for the last year and a half: slim majorities and lacking the votes to change Senate rules.",
    "Voice for the Unborn Executive Director Andrew Shirvell urged DeSantis to consider legislation that would go into effect the day after the Supreme Court rules on Mississippis 15-week ban on abortion, the focus of the high courts draft opinion.",
    "'?\nPOLLING  \"Most Florida voters oppose abortion bans, polls show,\" by Tampa Bay Times Langston Taylor: \"Repeatedly, as courts and lawmakers have proposed rolling back abortion rights, most Florida voters have said they want to protect them.",
    "Ron DeSantis top financial backers says he disagrees with Floridas move to eliminate Disney Worlds special government district, cautioning politicians to stay 'above the fray' when it comes to retaliating against corporate America.",
    "ON THE RIGHT  Republicans rage about breach of draft Roe opinion,? by POLITICOs Kyle Cheney and Andrew Desiderio: Few Republican lawmakers on Tuesday were celebrating a draft Supreme Court opinion that would overturn Roe v. Wade.",
    "In February, after the state House of Representatives passed that bill, 57 percent of a sample of registered voters told pollsters with the University of North Florida that they opposed it, while 34 percent supported it.",
    "The midterms With a 6-3 conservative-majority on the Supreme Court, theres little abortion-rights supporters can do to stop the justices from overturning Roe so Democrats are putting their hopes into the ballot box.",
    "Energized conservatives  The stunning disclosure of a Supreme Court draft opinion that would strike down the landmark 1973 Roe v. Wade decision puts a spotlight on Floridas Republican-led Legislature and Gov.",
    "Lawyers for the District also accused Trumps organization of improperly using nonprofit funds to throw a private party on Jan. 20, 2017, for Trumps children  Ivanka, Donald Jr. and Eric  which cost $300,000.",
    "What Cruz, who killed 17 students and staff members on Valentine's Day 2018 at Marjory Stoneman Douglas High School in Parkland, may get is 12 people who can afford to sit in a courtroom for many months.",
    "'I can't believe this is real,' said Calum Johnson, a 25-year-old barista and union committee member who was one of under a dozen baristas who watched the ballot count from a bar in downtown Tallahassee.",
    "The win comes more than three months after the location, at 2264-1 N. Monroe St., announced its plan to organize and became the catalyst for two other capital city locations to follow suit.",
    "Ron DeSantis, who has worked with the GOP-led Legislature to restrict what teachers can say to their students about gender issues and limit what they can teach about Black history.",
    "John Stemberger, president of the anti-abortion group Florida Family Policy Council said in a statement that this is the moment that we have been working for our entire lives.",
    "Professionals and business owners have repeatedly asked Scherer to be excused, citing the financial impact they could suffer by being away from clients and customers.\"",
    "The two new members  one could be elected, and another DeSantis could appoint  would be joined by another board member who was initially appointed by former Gov.",
    "Florida Voice for the Unborn in a Tuesday letter to the GOP governor implored DeSantis to push the Legislature to nearly completely ban abortions in the state.",
    "Berry had been drinking on a Frontier Airlines flight in August from Philadelphia to Miami when he spilled his drink on himself and a flight attendant.",
    "In several recent statewide surveys, the majority of people polled believed abortions should generally be legal and said they opposed potential bans.",
    " Democrats bring federal lawsuit to force New York congressional primary under current lines,\" POLITICOs Bill Mahoney\nThe Campaign Trail\nPLAY NICE?",
    "Max Berry pleaded guilty to three counts of assault within maritime and territorial jurisdiction and faced 1.5 years and a $15,000 fine.",
    "The city also alleged that the Trump Organization, the inaugural committee and the Trump International Hotel misused $1.1 million.\"",
    "Griffin has given nearly $10.8 million to DeSantis political committee, making him the governors top individual political donor.",
    "Seventy-four percent of Democrats, 63 percent of minor party or no-party voters and 35 percent of Republicans opposed the bill.",
    "SCOTUS reveal fuels Florida's anti-abortion push\nBy DAVID KIHARA\n05/04/2022 07:05 AM EDT\nGood morning and welcome to Wednesday.",
    "Many lifted painted signs in support of abortion rights, while others waved pride flags and demanded action in speeches.",
    "Conservatives on Tuesday heralded the draft opinion while signaling theyre not ending their push to restrict abortion.",
    " Top DeSantis megadonor doesnt appreciate him targeting Disney,? by Orlando Sentinels Skylar Swisher: \"One of Gov.",
    "His administration also didnt respond to a request for comment about Shirvells letter from a POLITICO reporter.",
    "Thats why we need Tampa to be a place thats safe for everyone, even when elsewhere in the state is not.",
    "Opposition was slightly higher when pollsters noted the law included no exceptions for rape or incest.",
    "Not just with the Supreme Courts possible decision, but with the state of the progressive movement.",
    "It hasn't been just Uber drivers, freelancers and those relying on tips for a living that want out.",
    "Instead, they were angrily demanding answers to how the document became public in the first place.",
    "The gender split was much smaller: 58 percent of women opposed it compared to 56 percent of men.\"",
    "Have a tip, story, suggestion, birthday, anniversary, new job, or any other nugget for Playbook?",
    "Ron DeSantis to ban almost all abortions during an upcoming May special legislative session.",
    "The city draws each School Board seat automatically by combining two City Council seats.\"",
    " FROM THE ARCHIVES: These Florida parents chose abortion after 15 weeks of pregnancy.",
    "Rick Scott, now one of the two Republican senators representing Florida.\"",
    "Florida is continually seeing its basic human rights stripped away.",
    "Organizers passed petitions and registered attendees to vote.",
    "Im POLITICO editor David Kihara filling in for Gary Fineout.",
    "But its going nowhere  just ask members of their own party.",
    "Berry went to the bathroom and came out without his shirt.\"",
    "'It can be portrayed, or feel, or look like retaliation.",
    "DeSantis going after Disneys tax status,' Griffin said.",
    "\"Words cannot describe how proud I am of our partners.\"",
    "The mood was consistent throughout the crowd: Anger.",
    "'Its a weird situation,' said Bernice Lauredan, 30.",
    "'Were all shocked, but also not at all surprised.",
    " Nothing official announced for Gov.",
    "'I dont appreciate Gov.",
    "Thanks for reading.",
    " WHERE'S RON?",
    "Ron DeSantis.",
    "DeSantis."
  ]
}