{
  "id": 4068,
  "mediaId": 302,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Florida Democrats hope anti-abortion Supreme Court ruling could supercharge governors race",
  "image": "https://www.tampabay.com/resizer//a9flAa53tY7AVun3uKgQJ-EZies=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/7ITPZZL3WBHFTOIZ7Y66TKP6QY.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/04/florida-democrats-hope-anti-abortion-supreme-court-ruling-could-supercharge-governors-race/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1451,
    3766,
    4305,
    482,
    3277,
    3508,
    2661,
    2788
  ],
  "sentences": [
    "We are marching into a post-Roe world, in a time where particularly in Florida, we have a governor and legislative leadership that has a mentality that We can do whatever we want because we can, and everything is free except for women.?\nBook emphasized that in order to seize the political moment, Democrats need to have a laser-like focus? on being unified on an issue where they can attract moderates and progressives alike, potentially increasing their numbers in the Legislature.",
    "The issue of abortion, that battle is going to mobilize the fringe left but not the people in the middle.?\nStill, Tuesday brought some good news for Democrats: a rush of donations through ActBlue  an online tool used by Democratic campaigns and committees  in the hours following the news of the leaked court opinion, according to CNBC.",
    "If we dont flip our state, more and more of our rights are going to be encroached upon.?\nMany of Floridas Republican leaders were quiet Tuesday, declining to say whether the state would springboard from a potential Supreme Court decision to enact an abortion law that goes farther than the 15-week ban recently signed into law.",
    "What we need to do is stand up for womens rights and make sure theyre defended.?\nAbortion, inflation, education\nZiegler, with the Republican Party of Florida, said Democrats are grasping for any possible voter mobilization after years of disappointing election results and now a massive fundraising gap with DeSantis.",
    "Aubrey Jewett, a political science professor at the University of Central Florida, said its possible both Republicans and Democrats in Florida could be energized by an eventual Supreme Court decision striking down abortion rights  the former out of a sense of victory, and the latter due to fear.",
    "She added that the decision is coming from an activist court? being influenced by the justices religious beliefs, when Lady Justice is supposed to be blind.?\nSen. Lauren Book, the Democratic minority leader from Plantation, also said the Republican Party has turned extreme.",
    "She pointed to the fact that the Legislatures recent 15-week abortion ban did not include exceptions for rape, incest and human trafficking, despite her pleas on the floor of the Florida Senate and her sharing her own story of being sexually abused.",
    "Kalandjian, a young, liberal college student, is exactly the type of voter Democrats are hoping will be energized to cast a ballotin November as a consequence of the looming abortion ruling and potential changes to abortion access.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nBut in a state that already has a governor whos constantly pushing the states politics rightward and firing up his base, Democrats might have more to gain.",
    "But even as polling shows a majority of Floridians support some access to legal abortions, Republicans brushed off talk of the issue galvanizing Democrats in a state where the party has been losing ground in voter registrations.",
    "Lily Kalandjian, a 19-year-old University of Florida junior, was checking her social media Monday night when she got a notification about the leaked Supreme Court draft opinion suggesting the court will strike down Roe v. Wade.",
    "In 2010, I vetoed a bill  no other candidate can say this  I vetoed a bill that was anti-abortion,? he said referring to a measure that would have required ultrasounds prior to abortion procedures.",
    "This is going to be a monumental shift in the politics of our state,? Agriculture Commissioner Nikki Fried, one of the Democrats running for governor, said in a phone interview.",
    "Especially since this is something we didnt think could be overturned ... now that these rights are threatened, I think it will wake up a lot of young people,? she said.",
    "We need to make sure we elect people ... with a record that is very clear as to where they stand.?\nIn a phone interview, Crist disputed that his record is inconsistent.",
    "I would go so far as to say there are some Republicans out there that believe not having an exemption for rape, incest and human trafficking is abhorrent,? she said.",
    "She said shes hopeful that many of her peers, normally uninterested or too busy for politics in non-presidential years, may now see why voting always matters.",
    "Both also made thinly veiled jabs at U.S. Rep. Charlie Crist, who as a former Republican, has held varying positions on abortion over his political career.",
    "Floridas governor raised more than $100 million by the end of March, a sum unheard of in Florida state politics for a candidate whos not able to self-fund.",
    "This is an issue that will keep the suburban women that voted for Trump in 2016 and against him in 2020 ... completely in the Democratic camp,? she said.",
    "The rallies and rhetoric Tuesday, however, didnt always portray a unified party, at least among the candidates jockeying for the Democratic nomination.",
    "Ione Townsend, chairperson of the Hillsborough County Democratic Party, said shes hopeful an anti-abortion decision could anger a key group of voters.",
    "We talked a lot in (the legislative) session about this being a march toward a post-Roe world, and people sort of scoffed at that,? Book said.",
    "You can use this as a headline: wishful thinking by the Democrats,? said Christian Ziegler, vice chairman of the Republican Party of Florida.",
    "Jewett also added that the two female candidates for governor, Fried and state Sen. Annette Taddeo, might see an extra boost on this issue.",
    "Florida Democrats spent the 24 hours following the bombshell leak of the draft Supreme Court opinion angry, then motivated, they said.",
    "By Tuesday, the group was finishing a social media graphic listing abortion resources and where people can register to vote, she said.",
    "One political science professor said two women running for governor, Nikki Fried and Annette Taddeo, in particular, could benefit.",
    "As of Tuesday afternoon, the nationwide tally was up to more than $7 million, a hint that the draft opinion had hit a nerve.",
    "Even though the spring semester is over, her organization, the University of Florida College Democrats, didnt sit back.",
    "The shock waves quickly reached the governors race, as all three of the Democratic candidates running to replace Gov.",
    "1 issue for them is the economy: gas prices, inflation, how their families are hurting, and education,? Ziegler said.",
    "Fried and Taddeo held separate, competing rallies, despite the locations being only minutes apart in Miami.",
    "This is our moment, and it also proves how important it is to get the right candidate into office.",
    "This is so much bigger than anything we have ever seen,? Taddeo told the attendees of her event.",
    "Many of those conservative, pro-life voters were probably turning out anyway,? he said.",
    "Some of the groups leaders coordinated a rally with Planned Parenthood.",
    "DeSantis reelection campaign declined to comment.",
    "Ron DeSantis hosted or attended rallies Tuesday.",
    "The influential voters in the middle, the No.",
    "Mobilizing whom?",
    "..."
  ]
}