{
  "id": 4070,
  "mediaId": 302,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Roe has worked for 50 years | Letters",
  "image": "https://www.tampabay.com/resizer//H_6SxvEZd-sV4XDE33fJsTCDV_k=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/FBQYZ6C6YXE2WITQXTJD7PU3TA.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/04/roe-has-worked-for-50-years-letters/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Worse, this news?  that the judge followed precedent and upheld the Constitution  emerged as the House was voting, and it came from a decades-old news clipping circulated by Rep. Andrew Clyde, a Georgia Republican who made his own headlines when he voted against the Emmett Till Anti-Lynching Act and for comparing the Jan. 6, 2021, attack on the U.S. Capitol to a normal tourist visit.? In the end, the Hatchett bill failed to gain the required two-thirds majority.",
    "The state Constitution already says, All natural persons, female and male alike, are equal before the law and have inalienable rights, among which are the right to enjoy and defend life and liberty, to pursue happiness, to be rewarded for industry, and to acquire, possess and protect property.? Many details would need to be worked out, but an amendment could specify that one of those inalienable rights is control of ones body, the ability to obtain an abortion.",
    "And it allowed a woman time to find out she was pregnant; to find out if deformity of the fetus would cause unreasonable pain and suffering; to reveal rape or incest that would cause further trauma and harm if she were forced to give birth; to process, pray, gather more information and consider all her options, including continuing the pregnancy.",
    "To their credit, Sen. Scott had said he was proud to honor the life and legacy? of Hatchett, and Sen. Rubio said Hatchett lived an inspiring life of service? and, his story is worthy of commemoration.? While Floridas two Republican senators were right, 10 of Floridas Republican members of Congress couldnt be more wrong.",
    "Judge Hatchetts Democratic and GOP supporters should persuade the Florida Republicans who voted no to rethink, and Floridas congressional delegation should give its unanimous support to properly recognize the legacy of the Honorable Joseph Hatchett, for whom honorable? wasnt just a title but a way of life.",
    "Dominated by the bi-coastal Schumer/Pelosi team, the party fails to note that the most recent nationwide successes have come from the South or Midwest (think Bill Clinton or Barack Obama), all of them with a genuine populist message, unlike the faade of populism displayed by the GOP.",
    "Roe has worked\nReport says high court prepares to overrule Roe | May 3\nBetween absolute anti-abortion and absolute freedom-to-choose is a compromise that seems reasonable to most scientists, doctors, world religions and the majority of citizens in our democratic republic.",
    "But it failed in the House at the last minute when Republicans, including Tampa Bay representatives Gus Bilirakis of Palm Harbor, Vern Buchanan of Longboat Key and Scott Franklin of Lakeland, voted against the honor, even though they had co-sponsored the measure.",
    "Stephen Phillips, St. Petersburg\nTake a bow\nJesus said to pray in a closet, not at midfield | Column, May 3\nBravo, columnist Randall Balmer, bravo for your piece on former high school football coach Joseph Kennedy, who prayed at midfield rather than in private.",
    "Even if the question get on a ballot and then receives the 60 percent of the vote needed to pass, some Republican lawmakers would find ways to water it down, as they have with other successful citizen amendment petitions they didnt like.",
    "Subscribe to our free Stephinitely newsletter\nIf the Supreme Court overturns Roe, 26 states including Florida are certain or likely to ban abortion, according to the pro-abortion rights think tank the Guttmacher Institute.",
    "That will create a patchwork across the nation where some states have liberal abortion laws, even more expansive than Roes guidelines  and others, perhaps a majority, will effectively ban abortion altogether.",
    "Matthew Leonard, St. Petersburg\n\nThe Supreme Court appears poised to overturn Roe v. Wade and end a half century of abortion rights in the United States, according to a draft opinion leaked Monday.",
    "Eileen Stafford, St. Petersburg\nWhat GOP does better\nDonors balking on Florida Dems | May 2\nThe Democratic Party has nobody to blame but themselves for the lack of donor support in Florida.",
    "While the GOP puts forth in lockstep fashion a message, albeit, a negative, anti-Biden message, Democrats messaging is weak, scrambled and disorganized, without a hint of a unified agenda.",
    "Bilirakis voted no after learning of a controversial ruling by Judge Hatchett against student-led school prayer,? a spokesperson for the congressman told the Tampa Bay Times William March.",
    "Roe v. Wade, which identified fetal viability, rather than conception or birth, as the beginning of life, was not a perfect solution for those on either extreme side of the controversy.",
    "Perhaps the congressman has an alternative definition of controversial.? It is not controversial to follow the Constitution and the precedents established by the U.S. Supreme Court.",
    "The number of abortions in Florida peaked more than 15 years ago, and the national rate has been trending downward for years, good news no matter how anyone views abortion.",
    "As a result of increasing support networks both for continuing pregnancies and for preventing or ending pregnancies, abortion rates have recently declined significantly.",
    "If the Supreme Court does not support Roe, I support federal legislative action or a constitutional amendment for the reasonable compromise that decision gave us all.",
    "He served two decades and became chief judge of the 11th Circuit Court of Appeals in Atlanta, where he wrote the school prayer opinion that followed the Constitution.",
    "The members of the Editorial Board are Editor of Editorials Graham Brink, Sherri Day, Sebastian Dortch, John Hill, Jim Verhulst and Chairman Paul Tash.",
    "The members of the Editorial Board are Editor of Editorials Graham Brink, Sherri Day, Sebastian Dortch, John Hill, Jim Verhulst and Chairman Paul Tash.",
    "A University of North Florida survey from earlier this year found that 54 percent strongly or somewhat disapproved of banning abortions at 15 weeks.",
    "Turns out the late judge had written a federal appeals court ruling against prayer at a public high school graduation in Duval County in the 1990s.",
    "He graduated from historically Black Florida A&M University in 1954, served as an Army officer and entered Howard University School of Law in 1956.",
    "Ron DeSantis has already signed a bill that bans most abortions after 15 weeks, and the Republican-dominated Legislature wont likely stop there.",
    "Roe provides the dignity of choice, a choice in consultation with loved ones, physicians, counselors and practitioners of ones faith tradition.",
    "What the Florida congressmen who switched their votes did in fear of the current misbegotten orthodoxies of what once was the party of Lincoln.",
    "And sometimes, voters can take for granted the rights they have  two-thirds of Americans alive today have never lived in a world without Roe.",
    "It is appropriate to amend the state Constitution to enumerate human rights, and a womans right to control her own body fits that definition.",
    "Legislators wont protect a womans right to choose, so citizens can put a question on the ballot to enshrine the right in the Constitution.",
    "Until the Democrats tout their current legislative advances and lay out a coherent plan for the future, they will continue to lose donors.",
    "If Roe is overturned, the right to abortion will become an issue for elected politicians, either in Congress or, more likely, the states.",
    "Justice Joseph Woodrow Hatchett, a barrier-breaking man of great distinction, was the first Black judge on the Florida Supreme Court.",
    "Roe and later cases affirmed a womans right to control her own body and have an abortion up to the viability of the fetus.",
    "They also voted to raise the state minimum wage to $15, which many of their own elected leaders would not have supported.",
    "But voters in recent years have agreed that felons should regain the right to vote, a fundamental right in a democracy.",
    "The right to control your own body is a fundamental human right, one that shouldnt be subject to political impulse.",
    "When he took the bar exam, because he was Black, he couldnt even stay in the hotel where the test was administered.",
    "He won re-election in 1976, becoming the first Black candidate to win a statewide election since Reconstruction.",
    "Thats probably something that both anti-abortionists and freedom-to-choosers would agree is a positive outcome.",
    "There are 4.6 million women of reproductive age in Florida, and the state reported 79,648 abortions last year.",
    "The Senate, including Florida Republicans Marco Rubio and Rick Scott, unanimously supported the measure.",
    "The precedent-setting case has worked well, even though uncomfortably for those on either extreme side.",
    "He became a U.S. magistrate in 1971, making him the first Black federal judicial officer in the South.",
    "President Jimmy Carter appointed him a federal judge, the first Black federal judge in the Deep South.",
    "Reubin Askew appointed him to the state Supreme Court at a time that the court was stuck in scandal.",
    "To honor his memory, Congress was recently set to name the Tallahassee federal courthouse after him.",
    "However, for nearly 50 years, the decision restricted abortion of late-term viable, healthy fetuses.",
    "North Carolina would likely be the closest state to Florida where abortion would still be legal.",
    "Currently a woman in Florida drives fewer than 16 miles on average to find an abortion provider.",
    "In fact, lets talk about honorable,? because Judge Hatchett was the very definition of the word.",
    "A Pew poll found that 56 percent of Floridians believe abortion should be legal in most cases.",
    "That number would likely  and should  grow if the state contemplated banning all abortions.",
    "Sometimes the will of the people differs from the very people they elect to represent them.",
    "It seems as simple as the cowardice of their convictions, and they should be ashamed.",
    "Attending law school at the flagship University of Florida was out of the question.",
    "He died a year ago, having led a life that by any normal definition was honorable.",
    "The near-party line vote was 238 yes to 187 no, including 10 Florida Republicans.",
    "Mardie J. Chapman, St. Petersburg\nHumane, not political\nWhat would Walt think?",
    "But the Republican stranglehold on power in Tallahassee makes that unlikely.",
    "A ban would push the average distance to 583 miles, according to Guttmacher.",
    "Having an abortion is one of the most difficult decisions a woman can make.",
    "| Column, May 1\nDisneys statement supporting gay rights wasnt political.",
    "In the best of worlds, abortions would be legal and available but rare.",
    "Hatchett, born in 1932, was the son of a maid and a fruit picker.",
    "He cited and followed the precedent of the U.S. Supreme Court.",
    "Editorials are the institutional voice of the Tampa Bay Times.",
    "Editorials are the institutional voice of the Tampa Bay Times.",
    "So did five other Florida Republicans and all 11 Democrats.",
    "Elect representatives who support a womans right to choose.",
    "And legal? should not depend on who won the last election.",
    "Follow @TBTimes_Opinion on Twitter for more opinion news.",
    "State lawmakers should protect, not endanger, this right.",
    "Follow @TBTimes_Opinion on Twitter for more opinion news.",
    "One possibility is to amend the state Constitution.",
    "Abortion foes will fight hard against such a move.",
    "The Constitution shouldnt be amended willy-nilly.",
    "If they wont, the people should do it themselves.",
    "A majority of Floridians support abortion rights.",
    "He grew up in Clearwater in the Jim Crow South.",
    "To his credit, Rep. Daniel Webster voted yes.",
    "But this is not about numbers or distances.",
    "A total ban  or nearly  is easy to imagine.",
    "Changing the Constitution wont be easy.",
    "One counter measure is the ballot box.",
    "But it is her choice, not the states.",
    "UF didnt admit Black students then.",
    "This was no maverick decision.",
    "So what was not honorable??",
    "They should be embarrassed.",
    "It is about basic rights.",
    "Why the change of heart?",
    "Her body, her decision.",
    "And then in 1975, Gov.",
    "Dont confuse the two.",
    "No, it is honorable.",
    "Yet, he persevered.",
    "What about Florida?",
    "Thats the reality.",
    "So what to do?",
    "It was humane.",
    "Gov."
  ]
}