{
  "id": 4074,
  "mediaId": 302,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Its surreal: Tampa Bay grapples with likely overturn of Roe v. Wade",
  "image": "https://www.tampabay.com/resizer//sR1rcAsM5elghqKuWu5urPp-cvw=/620x0/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/LCDKCUDZDZH7NJWL2UBBSIL4ZY.JPG",
  "link": "https://www.tampabay.com/news/tampa/2022/05/03/its-surreal-tampa-bay-grapples-with-overturn-of-roe-v-wade/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Thats higher than the numbers police reported to the Times in 2021, when officials said crime reports fell about 28 percent at the 51 complexes that took part in the program through at least 2020.\nWe personally believe that if an individual is arrested for a very serious crime, like murder, rape, drug trafficking, that that public information should be made available to their landlord,? Castor said Friday.",
    "National housing and civil rights experts told the Times that the citys program likely violates the Fair Housing Act because it had a disparate impact based on race and national origin.?\nCastor, who as police chief authorized the launch of the crime-free program in 2013, mentioned the investigation at a Friday news conference.",
    "Weve been working our entire lifetime for this moment and its hard to believe its actually happening.?\nFor abortion providers, advocates and supporters who have worked to protect a persons right to choose, the draft decision came as a devastating blow to bodily autonomy, with massive medical and financial consequences.",
    "Four days after the investigation was published, Castor announced that officers would only inform landlords of certain serious drug and violent felonies,? that a police captain must sign off on notices sent, and landlords will only be notified about arrests that took place on their properties.",
    "A matter of health care\nWhen Annie Jae Filkowski saw the news of the Supreme Court leak Monday night, while walking to get groceries after a long day of work, her stomach dropped, she said  a feeling unlike any shed ever experienced in a half-dozen years working in reproductive rights.",
    "I would hate for mothers to go out and seek untrained people to try to terminate the pregnancy  and do something that might hurt them.?\nThe road ahead\nAlthough the leaked draft opinion indicates the reversal of Roe v. Wade is probable, the court still needs to make it official.",
    "News that the U.S. Supreme Court planned to overturn its precedent of nearly 50 years protecting a persons right to abortion rippled across Florida and Tampa Bay on Tuesday, setting off various reactions that ranged from fear to elation to confusion.",
    "The Times investigation showed landlords were routinely informed of the arrests of juveniles, incidents of domestic violence and misdemeanor and non-violent arrests, including charges of shoplifting, driving with a suspended license and panhandling.",
    "The U.S. Department of Housing and Urban Affairs in 2016 issued guidance stating that arrests should not be the basis for evictions and should not be used to deny tenant applications to live in public housing and federally subsidized properties.",
    "Now 63, Williams remembers growing up in Polk County when Black people couldnt give birth in area hospitals, and when segregated cemeteries were crowded with the bodies of young people who had attempted to terminate pregnancies on their own.",
    "An investigation by the Tampa Bay Times found that during the eight-year anti-crime initiative officers sent hundreds of letters that encouraged landlords to evict tenants based on arrests, including cases where charges were later dropped.",
    "Everyone deserves to feel safe in the neighborhood that theyre living in, regardless of their income level.?\nThe city on Oct. 27 asked the U.S. Department of Housing and Urban Affairs to review the program and its replacement, SAFE.",
    "Three-quarters of the roughly 100 apartment complexes enrolled in the voluntary program at its peak were in neighborhoods where U.S. Census block data shows the majority of residents are Black and Hispanic, the Times reported.",
    "Its really unusual for the Supreme Court to take away a right that has been articulated by a previous Supreme Court.?\nTimes staff writers Hannah Critchfield, Divya Kumar, Jack Evans and Dan Sullivan contributed to this story.",
    "Abortion protections have been increasingly under attack in recent years as state legislatures across the country have taken steps to place restrictions on who can terminate a pregnancy and under what circumstance.",
    "Once you receive this information, you are required to take immediate action through notice to cure, notice to vacate, or eviction,? was standard wording in one police district until it was changed in 2018.",
    "The investigation is focused on whether the Crime-Free Multi Housing program violated the Fair Housing Act, which prohibits discrimination in housing on the basis of race and other protected categories.",
    "Hillsborough County NAACP president Yvette Lewis said both investigations show the additional hardships faced by the Black community that are rarely, if ever, endured by other residents of the city.",
    "TAMPA  The U.S. Department of Justice is investigating a controversial Tampa Police Department program in which officers alerted landlords when their tenants were arrested and urged they be evicted.",
    "Still, for Filkowski, who is based in Orlando and serves as policy director at the Florida Alliance of Planned Parenthood Affiliates, the reversal of Roe v. Wade was the biggest threat yet.",
    "John Roberts, the chief justice of the U.S. Supreme Court, confirmed the authenticity of the document midday Tuesday, but asserted that it didnt represent a final decision by the court.",
    "Stay on top of whats happening in Tampa\nBraver said he was passionate about protecting reproductive rights because he believes abortion is health care and health care is a human right.",
    "Often religious voices that are heard on this are the ones doing harm, so its important for people of faith who believe in reproductive justice to have their voices heard.?\nThe Rev.",
    "It sends chills down my spine, thinking of her.?\nAs news spread Tuesday, activists and advocates like Filkowski mobilized, and protests were scheduled on both sides of the bay.",
    "The story detailed cases where entire families were evicted following the arrest of a juvenile or a family member who did not live in the property, but was still on the lease.",
    "For anti-abortion leaders, the leaked decision was the culminating victory in the long-fought battle to give states the right to criminalize the termination of pregnancies.",
    "What about the safety of the child who is killed??\nPlazewski said, instead, focus should be on providing people with resources if they have an unwanted pregnancy.",
    "The Tampa Police Department has got to stop over policing the African-American community.?\nJustice Department officials declined to comment on the investigation.",
    "At the University of South Florida, Ben Braver and Ava DiGilio stood outside the library and handed out flyers for a protest taking place later Tuesday night.",
    "Mathew Staver, a lawyer and the chairman of the Liberty Counsel, an Orlando-based law firm that champions religious freedom cases, praised the draft opinion.",
    "The federal investigation is focused on whether a program that had officers urging landlords to evict tenants based on arrests violated the Fair Housing Act.",
    "We can do a better job in working it out than somebody in Washington, D.C.?\nCiara Torres-Spelliscy, a professor at Stetson Law School, took a different tone.",
    "But police training materials provided to landlords touted evictions as a way to reduce crime and letters to landlords frequently urged action.",
    "She said the city followed federal guidelines when it started the crime-free initiative and updated the program when the guidelines changed.",
    "He said the decision allows a democratic process to take place, and decisions to be made at the state level, as the Constitution intended.",
    "It provides an online dashboard with links for residents or property owners who want to request a police arrest or incident report.",
    "Its surreal,? said John Stemberger, the president and general counsel of the Christian conservative Florida Family Policy Council.",
    "Patrick Leduc, a conservative Tampa attorney who has handled cases involving religious rights, celebrated the decision from afar.",
    "The church has never said that you have to raise a child  I know many couples that would love to adopt children,? Plazewski said.",
    "Its a stance thats been widely adopted across religious communities, which have been catalysts for the anti-abortion movement.",
    "One year ahead of her successful 2019 campaign to be city mayor, she acknowledged the citations were a mistake and apologized.",
    "A subsequent federal review concluded the tactic  dubbed biking while black?  was unfair and often perceived as harassment.",
    "Clarence Williams, a pastor at Greater Mount Zion AME Church in St. Petersburg, said that he falls somewhere in the middle.",
    "My community of legal scholars are on the progressive side, so this has been greeted with horror,? Torres-Spelliscy said.",
    "The Justice Department informed the city of the investigation in a letter sent Dec. 21 to Tampa Mayor Jane Castor.",
    "?Its thunderous,? said Leduc, who read the opinion Tuesday while deployed overseas with the U.S. Army Reserves.",
    "As then-police chief, Castor defended the practice as pro-active policing intended to address high crime areas.",
    "A 2015 Times investigation showed that officers issued tickets to bicyclists who were almost exclusively Black.",
    "She touted a 34 to 37 percent reduction in the number of reports of crime at participating apartment complexes.",
    "Police sent 140 notices detailing arrests that took place more than a mile from the tenants apartment complex.",
    "Hell, yeah!? some students responded, while others asked questions about what the change in ruling would mean.",
    "There was the homeless woman who didnt know she was pregnant until she wound up in the hospital at 18 weeks.",
    "As she read the headlines Monday night, Filkowski thought about people shes encountered working in her job.",
    "It was replaced by a program called SAFE, under which officers no longer send arrest notices to landlords.",
    "In dozens of cases, charges detailed to landlords that put tenants at risk of eviction were later dropped.",
    "It sets forth a new day of the court being more consistent with the intent of the Constitution,? he said.",
    "There was the 11-year-old who didnt know what sex was,? Filkowski said, until she was raped by a parent.",
    "Although he opposes abortion, Williams said hes conflicted about the possible overhaul of Roe v. Wade.",
    "Len Plazewski, a pastor of Christ the King Church in Tampa, said the reversal of Roe is long overdue.",
    "Thats despite Black residents averaging only 54 percent of all arrests in Tampa over the same period.",
    "This is the second Department of Justice investigation into Tampa police operations in seven years.",
    "Andy Oliver, pastor of Allendale United Methodist Church in St. Petersburg, said its not so simple.",
    "A Supreme Court draft decision to reverse abortion protections sends shock waves through Tampa Bay.",
    "The argument that abortion is a health care procedure negates the well-being of the baby, he said.",
    "We can make those decision based on how we feel here in the state of Florida,? Leduc said.",
    "Under Floridas public records law, those reports are already available to every resident.",
    "Plazewski, like many who are anti-abortion, said he believes life begins at conception.",
    "Our bodies were created by God, who gave us autonomy over those bodies,? Oliver said.",
    "Im not a fan of trying to connect public policy to the biblical word,? Williams said.",
    "We miss the point if we get focused on the (abortion) safety issue,? Plazewski said.",
    "Abortion is liberation in a situation like that,? she said, referencing the child.",
    "I need to be able to make decisions about my body and my future,? Levesque said.",
    "It will will have to consider how much sway officers had over housing decisions.",
    "Help save Roe v. Wade?? he asked as people carrying backpacks scurried past.",
    "The federal letter acknowledges that police ended the initiative Dec. 1.",
    "Braver, a sophomore, joined USFs Planned Parenthood chapter last year.",
    "About 90 percent of tenants flagged to landlords were Black renters.",
    "It tells me that there was some injustice going on again,? she said.",
    "The program did not give them direct say over evictions.",
    "Ron DeSantis signed into law a 15-week abortion ban.",
    "Tampa native and USF student Ellie Levesque agreed.",
    "Every aspect of our lives is inherently political.",
    "Everyone should care.?\nFreedom and faith\nThe Rev.",
    "Just last month, Florida Gov.",
    "The truth will come out.",
    "But the Rev."
  ]
}