{
  "id": 4079,
  "mediaId": 124,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Yelp and Meta's Sandberg respond to draft opinion that would strike down Roe v. Wade",
  "image": "https://external-sjc3-1.xx.fbcdn.net/safe_image.php?w=476&h=249&url=https%3A%2F%2Fstatic.politico.com%2F4b%2F58%2F77a8d5284444b8f04a334e8ef660%2F20220311-abortion-getty-773.jpg&cfs=1&upscale=1&fallback=news_d_placeholder_publisher&ext=emg0&_nc_oe=7008d&_nc_sid=06c271&_nc_o2e=1&ccb=3-6&_nc_hash=AQG6HvOGxfbeIZk7",
  "link": "https://www.nbcnews.com/business/consumer/roe-v-wade-abortion-tech-companies-respond-to-supreme-court-rcna27167",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2058,
    4319,
    4864,
    177,
    482,
    3515,
    3666,
    2934,
    2945
  ],
  "sentences": [
    "Yelp said in a statement that overturning Roe would jeopardize the human rights of millions of women who stand to lose the liberty to make decisions over their own bodies.?\nMeta, formerly known as Facebook, did not comment on the leak, but the companys chief operating officer, Sheryl Sandberg, said the opinions publication represented a scary day for women all across our country.?\nSheryl Sandberg\n9 hours ago\nThis is a scary day for women all across our country.",
    "Yelp and other tech companies  including Bumble, Salesforce and Apple  were among the corporations that explicitly told employees in states that have begun to restrict abortion access, such as Texas, that they would reimburse them for abortion-related expenses.",
    "politico.com\nExclusive: Supreme Court has voted to overturn abortion rights, draft opinion shows\nWe hold that Roe and Casey must be overruled,? Justice Alito writes in an initial majority draft circulated inside the court.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nThe Supreme Court said Tuesday that while the draft opinion, published by Politico, was authentic, it did not represent a final decision.",
    "Ron DeSantis signed into law provisions that would effectively remove a special district created for The Walt Disney Co. that gave it taxing and bonding authority to run Walt Disney World near Orlando.",
    "Yelp and Bumble were among the major U.S. companies that responded Tuesday in support of abortion rights after a leaked Supreme Court draft opinion that would strike down Roe v. Wade was published.",
    "\"In the meantime,\" it said, \"more companies will need to step up to safeguard their employees, and provide equal access to the health services they need no matter where they live.\"",
    "235\n33\n15\nIn its statement, Yelp said, \"Turning back the clock on the progress women have made over the past 50 years will have a seismic impact on our society and economy.\"",
    "\"This goes against the will of the vast majority of Americans who agree that decisions around reproductive care should be made by women and their doctors,\" it continued.",
    "That action came after Disney said it opposed a DeSantis-backed measure that restricts classroom teaching of gender and sexual orientation to children in public schools.",
    "\"At Bumble, we believe strongly in womens right to choose and exercise complete control over their bodies,\" the company said in a statement Tuesday.",
    "We hold that Roe and Casey must be overruled,? Justice Alito writes in an initial majority draft circulated inside the court.",
    "We hold that Roe and Casey must be overruled,? Justice Alito writes in an initial majority draft circulated inside the court.",
    "Conservative lawmakers and activists have increasingly called out corporations for taking a position on social issues.",
    "If the leaked draft opinion becomes the law of the land, one of our most fundamental rights will be taken away.",
    "Every woman, no matter where she lives, must be free to choose whether and when she becomes a mother.",
    "Bumble said it was dismayed by the draft opinion and would continue to cover such expenses.",
    "Breaking news emails\nBe the first to know about breaking news and other NBC News reports.",
    "\"The safety, privacy and freedom of family planning is critical to equality for all.\"",
    "Apple and Salesforce did not immediately respond to requests for comment.",
    "Few things are more important to womens health and equality.",
    "Yelp called on Congress to codify those rights into law.",
    "Most recently, Florida Gov."
  ]
}