{
  "id": 4080,
  "mediaId": 188,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Pansexual Florida teacher fired after discussing her sexuality with middle school students",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTc2MDcwOC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY1Nzc5MTQ1MX0.NMNlo9vrXHO778wVNYHhZX0R_yNO8S31RuEIp7lQ76k/img.jpg?width=1245&quality=85&coordinates=0%2C110%2C0%2C110&height=700",
  "link": "https://www.theblaze.com/news/pansexual-florida-teacher-fired-after-discussing-her-sexuality-with-middle-school-students",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Pandolfo",
  "authorUrl": "https://www.theblaze.com/u/christopherpandolfo",
  "termIds": [
    661,
    3653,
    2661,
    5037
  ],
  "sentences": [
    "Ron DeSantis signed a law that prohibits discussions on sexual orientation or gender identity from taking place in K-3 classrooms, and restricts such topics to what is \"age appropriate\" or \"developmentally appropriate\" in higher grades, as determined by state standards.",
    "Casey Scott, a first-year art instructor at Cape Coral Middle School, told WBBH-TV that school administrators ordered her to throw out the drawings and fired her after learning she explained to students that she is pansexual.",
    "Critics derided the legislation as the \"Don't Say Gay\" bill, arguing it imposes vague restrictions on what teachers are allowed to talk about in the classroom and would have a chilling effect on speech.",
    "A Florida middle school teacher claims she was fired because she had a discussion with students about her sexuality, whom she says then asked to draw flag pictures expressing their own sexualities.",
    "Supporters countered that Florida's \"Parental Rights in Education\" bill prevents young children from being exposed to sexual content that is inappropriate for them in school.",
    "She says that some of her middle school kids identify as non-binary, bisexual, and gay, and that they wanted to create art expressing their own sexualities.",
    "The district said that students confirmed the discussion took place and that some were confused by what it meant to be pansexual, WBBH reports.",
    "A representative with the Teachers Union of Lee County said that Scott was not a member and could legally be fired without cause.",
    "The Lee County School District disputes her story, saying she was fired for not following the mandated curriculum, WBBH reports.",
    "To be pansexual means a person is not limited in sexual preference with regard to biological sex, gender, or gender identity.",
    "She said the school sent her home and then called her later that day to inform her she would be released from her contract.",
    "Scott hung their artwork on the classroom door, and according to her, that's when school administrators contacted her.",
    "According to the Lee School District, parents had registered complaints about the conversation and the artwork.",
    "According to Scott, who is married to a man, the discussion concerned how she identifies as pansexual.",
    "She provided WBBH with pictures of the flags, which were placed in a recycling bin.",
    "They said it would be in the best interest if I got rid of them now,? she said.",
    "\"I like anyone despite male, female, non-binary, transgender,? Scott told WBBH.",
    "A discussion happened in class and because of that, now Im fired,? Scott said.",
    "I grabbed all their flags and all the kids were staring at me.",
    "And I crumbled their flags in front of them,? she recounted.",
    "The firing happened just days before Florida Gov.",
    "I went over to the recycling bin."
  ]
}