{
  "id": 4088,
  "mediaId": 238,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Clinics, lawmakers and activists scramble to prep for a post-Roe world",
  "image": "https://newsletter-imgs.s3.amazonaws.com/prod/the-202s/secondary/health.svg",
  "link": "https://www.washingtonpost.com/politics/2022/05/04/clinics-lawmakers-activists-scramble-prep-post-roe-world/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    827,
    2058,
    3774,
    428,
    482,
    525,
    571,
    2626
  ],
  "sentences": [
    "The poll also finds that 58 percent of Americans say abortion should be legal in most cases? or all case,? while 37 percent say it should be illegal in most cases? or all cases.?\nTricky politics: Abortion has long been complicated for Biden, a practicing Catholic, whose views have shifted throughout his time in politics to bring him in line with Democrats but at odds with the church, The Posts Matt Viser reports.",
    "I dont think that a woman has the sole right to say what should happen to her body.?\nBiden yesterday: The idea that were going to make a judgment that is going to say that no one can make the judgment to choose to abort a child, based on a decision by the Supreme Court, I think, goes way overboard,? he said.",
    "1/ pic.twitter.com/Nu4VeW8cvI\nThe midterm effect: The possible overturning of Roe threatens to upend the midterms and transform the campaign into a massive mobilizing effort? over abortion, individual rights and the two parties differing philosophies, The Posts Dan Balz, Colby Itkowitz and Caroline report.",
    "The majority include exceptions for if the woman's life is endangered, and some include exemptions for being at risk of a severe physical health condition, per a tracker from Elizabeth Nash, an interim associate director at Guttmacher Institute, a research group that supports abortion rights.",
    "When they announced the most recent extension, federal health officials said they had hoped to use the additional time to assess the need for a mask requirement in transportation settings based on factors such as the risk of virus variants and trends in caseloads,? Lori writes.",
    "18 percent of parents are eager to vaccinate their child under 5\n38 percent say they want to wait and see? before vaccination\n11 percent say theyll only get their child vaccinated if required to do so\n27 percent say they will definitely not? get their child under 5 vaccinated",
    "Connecticut lawmakers have had initial discussions about the legislation with policymakers in California and Massachusetts, as well as advocates and experts across the country, state Rep. Matt Blumenthal (D), one of the sponsors of the Connecticut bill, told The Health 202.",
    "One thing to note: Rape and incest exceptions have been fading away from Republican-led laws, and most trigger bans dont include them, said Mary Ziegler, a professor at Florida State University College of Law specializing in the history of abortion law.",
    "In Arkansas, state Sen. Jason Rapert (R) told Caroline he plans to write to the state attorney general and solicitor general to inform them theyll need to certify the Supreme Court decision in order for the abortion ban to take effect.",
    "If Roe is overturned, state lawmakers would probably seek to bar the procedure after fetal cardiac activity is detected, per John Stemberger, president of the Florida Family Policy Council, an antiabortion lobbying group.",
    "The details: Murray and Sen. Ron Wyden (D-Ore.)  who chair the powerful health and finance panels, respectively  opened an investigation into complaints that health insurers are denying patients no-cost birth control.",
    "Senate Democrats are pushing to make sure women can obtain free birth control required by Obamacare, arguing the policy is critical if the high court strikes down abortion rights, our colleague Dan Diamond reports.",
    "A majority of these parents feel theres still too little information about the effects of the vaccines on young kids and want to wait longer, even as Moderna pursues authorization of its shots for this age group.",
    "Heres what you need to know:\nA largely symbolic vote: Senate Majority Leader Chuck Schumer (D-N.Y.) pledged that the chamber would again take up legislation codifying the right to an abortion into federal law.",
    "w/ @rachel_roubein https://t.co/6IibaYnoQP\n Caroline Kitchener (@CAKitchener) May 4, 2022\nThat includes so-called trigger laws, which would prohibit most abortions almost immediately if Roe is overturned.",
    "This week would have been the expiration of the federal mandate to wear masks on airplanes, buses and other public transportation, if not for a federal judges recent ruling striking down the requirement.",
    "But while that mandate is gone, the Centers for Disease Control and Prevention is still reiterating its recommendation that people choose to mask up on public transit, our colleague Lori Aratani reports.",
    "We dont have a plan,? Leilah Zahedi  a high-risk obstetrician who provides abortions in Tennessee, a state with a trigger law? designed to block abortion as soon as Roe is overturned  told Caroline.",
    "According to the survey, 54 percent of Americans think the Roe decision should remain intact, while 28 percent believe it should be overturned, our colleagues Emily Guskin and Scott Clement write.",
    "But now Im in fix-it mode, like: What do we need to do to make sure I can provide as many abortions as I can??\nThe leaked decision means abortion clinics have something they didn't expect: time.",
    "But first \nLawmakers and abortion clinics are scrambling to gear up for a new reality: Abortion could be banned or closely restricted in roughly half of states in the span of a few weeks.",
    "Chief Justice John G. Roberts Jr. said the draft opinion wasnt final, but the document from Justice Samuel A. Alito Jr. offered a legal road map to a divided system of abortion access.",
    "Bob Casey (Pa.) and Maggie Hassan (N.H.), sent letters to OptumRx, CVS Caremark and Express Scripts  which help insurance companies oversee pharmacy benefits for millions of Americans.",
    "On the left: In Connecticut, the state Senate gave final approval last week for the state to be a place of refuge for women who live in Republican-led states limiting the procedure.",
    "I think if Roe v. Wade is overturned, and Justice Alitos decision is what we think it is, then I think thats likely to be a next step that youll see in Florida,? he said.",
    "A flurry of preparations are underway as the country readies for the red-blue divide of a world without Roe, my colleague Caroline Kitchener and I reported yesterday.",
    "Back in February, the Senate tried to muscle similar legislation through, but it failed due to opposition from all Republicans and Sen. Joe Manchin (D-W.Va.).",
    "That could transition the election away from being a referendum on President Biden and his party into a choice between how Democrats and Republicans governor.",
    "The effort is aiming to combat what legal experts believe could be the new frontier for antiabortion states: restricting the procedure across state lines.",
    "Where Americans stand: A majority of Americans say the Supreme Court should uphold Roe, a new Washington Post-ABC News poll conducted last week finds.",
    "I spoke to clinics in trigger ban states that are laying groundwork to see as many patients as possible before they're hit with the SCOTUS decision.",
    "Thats from a new Kaiser Family Foundation poll, which finds little change in coronavirus vaccine hesitancy among parents of children under 5.",
    "The leaked draft opinion obtained by Politico immediately transformed what had been a largely abstract conversation into a visceral reality.",
    "Some trigger laws require quick action from the state attorney general or the governor essentially confirming that Roe has been overturned.",
    "Today's edition: Senate Democrats will soon hold a vote to codify abortion rights into federal law, but it'll almost certainly fail again.",
    "Senate Democrats tonight filed a new version of the Women's Health Protection Act, the Roe/Casey-codifiying bill that failed in February.",
    "Florida Republicans had previously shrugged off passing a more stringent prohibition, but such limitations could now get a second look.",
    "The backstory: Before the ruling striking the mandate, the CDC had extended the mandate several times under the Biden administration.",
    "Theyre already on the books in 13 states, while over a dozen more GOP-led states are also poised to severely restrict the procedure.",
    "Theyre demanding information from the companies on their policies, how often they deny patients requests and more within two weeks.",
    "Ron DeSantis (R), a possible 2024 GOP presidential candidate, recently signed a bill banning abortions after 15 weeks of pregnancy.",
    "Yet, Republicans argue their base will be energized as well, and contend issues like inflation and crime arent going away.",
    "The legislation was modeled after the Mississippi law at the center of the case before the Supreme Court.",
    "Such a vote could come as soon as next week, Sen. Patty Murray (D-Wash.) told PBS NewsHour.",
    "He anticipates such a bill would gain traction during next years legislative session.",
    "The measure would need to garner 60 votes, and that is extremely unlikely.",
    "Spokespeople for the companies told Dan theyre reviewing the request.",
    "Biden in 1974: I dont like the Supreme Court decision on abortion.",
    "The main difference: They lopped off about 14pp of \"findings.\"",
    "This could narrow the enthusiasm gap and boost Democrats.",
    "Most parents won't rush to vaccinate their littlest kids.",
    "On the right: Were looking to Florida as a case study.",
    "Ned Lamont (D) confirmed he plans to sign the bill.)",
    "But the legislation is almost certain to fail.",
    "Two striking quotes reflect the change.",
    "The pair, along with Democratic Sens.",
    "I think it went too far,? he said.",
    "Will other states follow suit?",
    "(A spokesman for Gov.",
    "Gov."
  ]
}