{
  "id": 4089,
  "mediaId": 43,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Top Republican talking point on leaked Supreme Court draft is one for the ages",
  "image": "https://images.dailykos.com/images/1063713/story_image/Gallows.jpg?1651234136",
  "link": "https://www.dailykos.com/story/2022/5/4/2095786/-Republicans-finally-find-something-they-re-willing-to-call-an-insurrection",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Laura Clawson",
  "authorUrl": "/users/laura clawson",
  "termIds": [
    661
  ],
  "sentences": [
    "Christine Pelosi talks to us about what Democrats must do to save womens rights\nDaily Kos' The Brief\nFollowShare\n0:001:00:20\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nAccording to right-wing podcaster Matt Walsh, it was an actual insurrection,? one 100000000 times more serious than the Capitol riot.? Former George W. Bush staffer Ari Fleischer called the leak an insurrection against the Supreme Court.? It goes on, because thats how Republican talking points work.",
    "Thats a judicial insurrection, to be taking that out and trying to kneecap a potential majority through kind of extra-constitutional means.?\nFor all the lefts cries of threats to democracy and insurrection about things like uncensored speech on Twitter or literally walking peacefully through a door, what happened Monday night appeared to be a far truer and more dangerous example of treasonous insurrection,? The Federalist railed.",
    "For that matter, many court observers say it could equally be intended to lock in initial votes to fully overturn Roe and prevent Chief Justice John Roberts from pulling votes to a slightly less extreme position in the interest of protecting the courts ever-fading legitimacy as an institution.",
    "A list of a few reproductive justice organizations you can support today\nIf SCOTUS kills Roe, many states are poised to swiftly enforce abortion bans, sweeping restrictions\nFrom contraception to LGBTQ rightsAlitos draft opinion on Roe opens the floodgates\nThis is a short blurb about Daily Kos.",
    "The Republican hissy fit is ostensibly based on the idea that the leak was intended to intimidate the right-wing justices away from this position, but it sure looks like a big distractionthe dog caught the car and it turns out not to have been as desirable as expected.",
    "Republicans were irate about the leak of a draft Supreme Court opinion striking down Roe v. Wade, and it didnt take them long to arrive at a talking point that is staggeringly dishonest even by Republican standards: the leak was the real insurrection.",
    "But the real story will remain the tens of millions of people stripped of reproductive rights, the women who die from unsafe illegal abortions, the people whose lives are reshaped by unintended pregnancies for which they have no recourse.",
    "Christine Pelosi talks about the Supreme Court's leaked decision on Roe v. Wade, and what Democrats must do now, on Daily Kos The Brief podcast\nx\nx\nYou need to enable JavaScript to run this app.",
    "But, always on the search for ways to downplay the violence of their supporters on January 6 and to make themselves the victims of any event, this is where Republicans landed.",
    "RELATED STORY: Republican lawmakers and sedition supporters are irate that the end of Roe was leaked in advance\nYou want to talk about an insurrection?? Florida Gov.",
    "It is not the same thing as a mob violently storming the U.S. Capitol to prevent the Congress from doing its job and carrying out the peaceful transition of power.",
    "We are talking here about the leak of a non-classified draft document a few weeks ahead of when a final version of the document would have been publicly released.",
    "It is not the same thing as a sitting president and his aides trying to pressure state officials to find? the votes needed to flip an election result.",
    "This Supreme Court decisionnot the leak but the decision itselfkicks off a tragedy that will unfold for years with the most vulnerable as its victims.",
    "If it turns out to have been leaked by a conservative, you can confidently bet that Republicans will launch another distraction.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "RELATED STORIES:\nSupreme Court Justice Roberts calls leaked Roe v. Wade draft opinion betrayal of confidences\nFight back!",
    "For some odd reason, they dont want people talking about the substance of the issue: widespread abortion bans.",
    "Mind you, no one knows who leaked the draft and there are very good reasons to suspect it was a conservative.",
    "Mind you, Republicans are getting what they want here, in the end of abortion rights at a federal level.",
    "Contribute now to support abortion funds providing financial assistance to people seeking abortion care.",
    "Mind you, the leak of a draft judicial opinion is not by any definition an insurrection.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Its almost like they realize thats not actually going to be popular.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "This is what Republicans DON'T want to call an insurrection.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n63.",
    "The leak of the draft is under investigation.",
    "They come from everywhere all at once.",
    "Donate $25\n'\nDonate $10 monthly",
    "Want to keep it that way?",
    "Click here to donate now.",
    "Daily Kos is different.",
    "Ron DeSantis said.",
    "Please read it."
  ]
}