{
  "id": 4106,
  "mediaId": 65,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "DeSantis calls Supreme Court leak a 'judicial insurrection'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/654ba007-10f1-4124-94da-d85092005872/5bb0d289-5445-4a00-9c67-1af03ca61a39/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/desantis-supreme-court-leak-judicial-insurrection",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessica Chasmar",
  "authorUrl": "https://www.foxnews.com/person/c/jessica-chasmar",
  "termIds": [
    661,
    827,
    482,
    2661,
    4986
  ],
  "sentences": [
    "Supreme Court Chief Justice John Roberts announced Tuesday that he has called upon the Supreme Court marshal to investigate the leak of U.S. Supreme Court Justice Samuel Alito's majority opinion to revoke the landmark 1973 case in its ruling on Dobbs v. Jackson Womens Health Organization.",
    "\"I know they launched an investigation, so they need to figure out who did that, and they need to hold them accountable, because that is a real, significant breach of trust,\" he said.",
    "\"You want to talk about an insurrection  thats a judicial insurrection to be taking that out and trying to kneecap a potential majority through extra-constitutional means.",
    "I think it was intentional to try to whip up a lot of the public, to try to make it very political, and potentially try to bully one of them into changing their positions.",
    "The law, which is set to take place on July 1, is facing legal challenges and relies on the Supreme Court decision in Dobbs v. Jackson Womens Health Organization.",
    "The governor added that he \"believes in pro-life protections,\" and that such protections are \"based in science\" and \"based in who we are as a society.\"",
    "Florida's constitution protects abortion up to 24 weeks of pregnancy, but DeSantis recently signed a bill banning most abortions after 15 weeks.",
    "\"To have that leak out the way it did was really unprecedented,\" DeSantis said during an unrelated press conference in Fort Myers.",
    "Ron DeSantis described the Supreme Court leak of a draft opinion overturning Roe v. Wade as a \"judicial insurrection\" on Tuesday.",
    "So I was really surprised to see that, but we will see what ends up being the result going forward.\"",
    "DeSantis said the person responsible for leaking the document should be \"held accountable.\"",
    "Story tips can be sent to Jessica.Chasmar@fox.com and on Twitter: @JessicaChasmar.",
    "And that is not something thats appropriate for the judicial branch.\"",
    "\"And I think it was really an attack on a lot of the justices.",
    "Jessica Chasmar is a reporter for Fox News Digital.",
    "Florida Republican Gov."
  ]
}