{
  "id": 4107,
  "mediaId": 21,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Conservative media talking heads play defense on overturning Roe: 'The sky will not have fallen'",
  "image": "https://i.insider.com/62718c985c82550018a9ca1c?width=1300&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/conservative-media-reaction-to-scotus-overturning-roe-v-wade-leak-2022-5",
  "sentiment": "0.0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grace Panetta",
  "authorUrl": "https://www.businessinsider.com/author/grace-panetta",
  "termIds": [
    661,
    1896
  ],
  "sentences": [
    "On Monday evening, Politico published a draft Supreme Court opinion authored by Justice Samuel Alito in a case over a 15-week abortion ban passed in Mississippi, an opinion in which a majority of the court would vote to overturn the federal protections for first-trimester abortion established in Roe v. Wade and fortified in Casey v. Planned Parenthood.",
    "Ron DeSantis holds up a 15-week abortion ban law after signing it, Thursday, April 14, 2022, in Kissimmee, Fla John Raoux/AP\nThe Supreme Court overturning Roe would also free up the anti-abortion movement to pursue other more ambitious goals, like pushing Congress to enact federal bans or restrictions on abortion.",
    "'The sky will not have fallen'\n Images of Fox News personalities, from left, Tucker Carlson, Sean Hannity, Laura Ingraham, Maria Bartiromo, Stuart Varney, Neil Cavuto and Charles Payne appear outside News Corporation headquarters in New York on July 31, 2021.",
    "AP Photo/Ted Shaffrey\nFox News co-host Tomi Lahren  who has made a name for herself in conservative media by cranking up her rhetoric with firebrand and often offensive takes  poured cold water on the significance of the decision.",
    "Justin Baragona (@justinbaragona) May 3, 2022\n\"Half the states roughly, half the states will permit abortions and half the states are going to severely restrict them,\" said former Trump economic adviser Larry Kudlow later on.",
    "Republican leaders in Congress also largely sidestepped the substance of the draft ruling, instead accusing \"the Left,\" without evidence, for deliberately leaking the draft in order to undermine the court.",
    "While it's true that overturning Roe would not make abortion illegal nationwide, it would unleash a new wave of restrictions and bans virtually overnight, affecting tens of millions of Americans.",
    "\"If Roe is indeed rolled back, you're not going to have this massive change in law,\" said Fox News contributor and former White House press secretary Kayleigh McEnany on a later Fox News panel.",
    "And depending on the language of the final ruling itself, the high court overturning Roe could set the stage for the court to erode other legal precedents related to privacy and civil rights.",
    "Senate Majority Leader Chuck Schumer delighted in the GOP's apparent squirming, likening his Republican counterparts to \"the dog that caught the bus\" at a Tuesday afternoon press conference.",
    "\"I think that's why it's up to conservatives and Republicans to make sure we're getting the actual education out there and reminding people that that is not the case,\" Lahren added.",
    "Senate Minority Leader Mitch McConnell, R-Ky. Tom Williams/CQ-Roll Call, Inc via Getty Images\nGOP lawmakers and pundits downplayed the significance of Roe v. Wade being overturned.",
    "The conservative legal movement appears to be on the cusp of achieving a nearly 50-year dream of overturning Roe v. Wade, the 1973 Supreme Court decision protecting abortion.",
    "\"It will be like it was before Roe, which is about 30 states had real prohibitions against abortion, 20 states regulated it somewhat more loosely, democracy was happening.\"",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "\"You will have states, at piecemeal, may put into place a different abortion law here or there, but it's not as if abortion will be banned across the nation entirely.\"",
    "Lahren agreed with McEnany, arguing that Democrats are \"counting on low-information viewers and voters who are going to look at this and say abortion is now outlawed.\"",
    "Currently, 13 states have so-called trigger laws that would heavily restrict or ban abortion if Roe fell, according to the Guttmacher Institute.",
    "There will not have been a catastrophe,\" said Fox News contributor Andrew McCarthy in a clip tweeted by the Daily Beast's Justin Baragona.",
    "Conservative commentator and radio host Erick Erickson too argued that \"nothing is actually going to change\" on Twitter and his Substack.",
    "Eighteen have unenforced, pre-Roe abortion bans or post-Roe restrictions currently blocked by courts that could be put back into effect.",
    "\"If the court threw out Roe, what we are going to find is that when everybody woke up the next day the sky will not have fallen.",
    "\"You need to concentrate on the news of today,\" Senate Minority Leader Mitch McConnell said at a Tuesday press conference.",
    "But so far, conservative media appearances show the party and its most loyal pundits holding off on taking a victory lap.",
    "Still others, like Florida and Oklahoma, have passed restrictions or bans on abortion set to go into effect this summer.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "\"We're going to have to play an educational role, and historically, we've done a really bad job at that.\"",
    "Several commentators kept the focus on how abortion will remain legal in Democratic-majority states.",
    "\"They spent decades trying to repeal Roe and now they won't even own up to it,\" Schumer said.",
    "So people will be free to choose where they want to live, what state, what jurisdiction.\"",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Across Fox News on Tuesday, reactions tended to pour cold water on the issue.",
    "On Fox News on Tuesday, however, the mood was more cautious than celebratory.",
    "\"Their spin masters are telling them to avoid the subject, and they did.\"",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "People who want an abortion may have to travel further to get one.",
    "Overwhelmingly, people will still not be getting abortions.\"",
    "\"Not a leaked draft, but the fact the draft was leaked.\"",
    "\"The reality is nothing is really going to change.",
    "\"I don't know any states that will stop abortions.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "Florida Gov.",
    "You know?"
  ]
}