{
  "id": 4112,
  "mediaId": 302,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Will Florida Republicans ban abortion? Heres what we know.",
  "image": "https://www.tampabay.com/resizer//RN5ASOujARyMfFbgx-5p42isvSc=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/BEEQVGYHCIDALIHYAI3K7TUNBQ.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/03/will-florida-republicans-ban-abortion-heres-what-we-know/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kirby Wilson",
  "authorUrl": "https://www.tampabay.com/author/kirby-wilson",
  "termIds": [
    661
  ],
  "sentences": [
    "In the landmark 1989 case In re T.W.,? the Florida Supreme Court said that, Floridas privacy provision is clearly implicated in a womans decision of whether or not to continue her pregnancy.?\nRobyn Powell, a visiting assistant professor at the Stetson University College of Law who studies reproductive justice, said even longstanding Florida precedent would mean little in a post-Roe world.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nJohn Stemberger, a well-connected attorney in conservative policy circles who leads the Christian conservative Florida Family Policy Council, said he expects the Legislature to take up a so-called heartbeat? bill banning abortions after six weeks during the next legislative session.",
    "Critics of the draft decision, meanwhile, argue overturning Roe could portend the reversal of a number of social protections guaranteed by high-profile Supreme Court decisions, such as the right for same-sex couples to marry.",
    "The draft written by Justice Samuel Alito represents a working version of the Supreme Courts deliberations over Dobbs v. Jackson Womens Health Organization, which was argued before the court in December.",
    "Its an opportunity for us to really cast a vision for a positive view of this issue that we can love children and not kill them  that we could always have adoption as a better option,? Stemberger said.",
    "TALLAHASSEE  If the United States Supreme Court strikes down the precedent set by Roe v. Wade  and its looking likely that it will  the focus will turn to what states opt to do in response.",
    "Passidomo, who will soon lead the Florida Senate, in October compared the enforcement mechanism in the Texas law banning most abortions after six weeks to tactics used by Nazi Germany.",
    "House Speaker Chris Sprowls, R-Palm Harbor, did not respond to an emailed request for comment or a phone call, although he did tweet a statement in support of overturning Roe v. Wade.",
    "Sen. Kathleen Passidomo, R-Naples, the incoming Senate president, said in a statement she is a defender of life? and that she looks forward to the Supreme Courts final decision.",
    "But the day after Politico published a bombshell draft Supreme Court opinion that hinted Roes days could be numbered, Florida Republicans remained mum about the future.",
    "At least 18 states either have kept pre-Roe abortion bans on the books or have passed so-called trigger? laws to ban abortion the moment Roe v. Wade is overturned.",
    "While they were debating the 15-week measure during this years legislative session, Republican lawmakers repeatedly insisted the proposal was not an all-out ban.",
    "We dont do that in this country.?\nStemberger said he doesnt expect the Texas-style enforcement mechanism to be a factor in the upcoming legislative discussions.",
    "DeSantis said the proposal was very reasonable? and another Republican lawmaker called it generous.?\nOther states have gone much further to ban the procedure.",
    "The opinion published by Politico could end up resembling the courts final say on Roe v. Wade, the 1973 case that prohibited states from banning abortion.",
    "For more than three decades, Florida courts have held that the Florida Constitutions privacy clause explicitly protects the right to an abortion.",
    "We are here today to defend those who cant defend themselves.?\nThat bill was one of the most hotly contested measures of the legislative session.",
    "It would mean that every other decision relating to the notion of privacy is thrown into question,? President Joe Biden told reporters Tuesday.",
    "However, on Tuesday, a Supreme Court spokesperson released a statement cautioning the Alito draft does not represent a decision by the Court.?",
    "Once Roe v. Wade is overturned, which seems highly likely, theres nothing that stops Florida from banning abortion completely,? Powell said.",
    "Oklahoma, Idaho and Texas have passed laws banning the procedure after six weeks, which is before many people can detect their pregnancies.",
    "Its likely that potential challenges from abortion rights activists could delay the implementation of any law passed by the Legislature.",
    "For that reason, the state has long offered legal protections for abortion that go beyond the precedent set by Roe v. Wade.",
    "There have been some signs that key Republicans are resistant to some of the high-profile national efforts to ban abortion.",
    "Last month, DeSantis signed a bill banning most abortions after 15 weeks of pregnancy at a raucous ceremony in Kissimmee.",
    "The bill passed essentially along party lines with no exceptions for cases involving rape, incest or human trafficking.",
    "For the first time in nearly half a century, Florida lawmakers could seriously contemplate banning abortions outright.",
    "Those people who say that if we allow neighbors to turn neighbors in we will save lives, think about the alternative.",
    "Or they could use the case to revisit the precedent set by Roe, and allow states to regulate abortions on their own.",
    "That case will decide the fate of a 2018 law banning most abortions after 15 weeks of pregnancy in Mississippi.",
    "As state lawmakers formulate their plans, here are three big questions about the future of abortion in Florida.",
    "Ron DeSantis said he would have to wait and see what the Supreme Courts final decision would be on Roe v. Wade.",
    "Legal experts say in a post-Roe v. Wade world, theres legally very little standing in the way of that outcome.",
    "Multiple times, student activists opposed to the ban disrupted hearings on the bill with loud demonstrations.",
    "Rep. Paul Renner, R-Palm Coast, whos set to succeed Sprowls next year, did not respond to a call or a text.",
    "His office, normally not one to shy away from controversial issues, did not offer further comment.",
    "They could craft a narrow ruling allowing 15-week abortion bans like Mississippis and Floridas.",
    "The draft opinion written by Alito strongly hinted that the court is poised to do the latter.",
    "The ACLU of Florida has pledged to sue the state over the law, which goes into effect July 1.",
    "The Texas measure allows private citizens to sue those they believe to be violating the law.",
    "How many people died in Nazi Germany because people turned people in?? Passidomo said then.",
    "She noted that the Florida Supreme Court has grown far more conservative in recent decades.",
    "Senate President Wilton Simpson, R-Trilby, did not respond to an email or a phone call.",
    "(As of now, abortions are legal in Florida until the third trimester of pregnancy.)",
    "However, the legal wrangling over new abortion restrictions would take some time.",
    "They could strike down the 15-week law, citing the precedent set by Roe v. Wade.",
    "DeSantis himself appointed three of the seven justices currently on the court.",
    "We are here today to protect life,? DeSantis said then to applause.",
    "At a Tuesday afternoon news conference in Fort Myers Beach, Gov.",
    "How likely is the Supreme Court to overturn Roe v. Wade?",
    "Justices could essentially rule one of three broad ways.",
    "What are the politics of abortion in Florida?",
    "The court has yet to issue its final ruling.",
    "What about Florida legal precedent?",
    "Soon, he will appoint a fourth.",
    "Florida has no such law.",
    "But it also might not.",
    "3.",
    "2.",
    "1."
  ]
}