{
  "id": 4113,
  "mediaId": 302,
  "date": "d2022-05-03T19:00",
  "headline": "Florida expands alligator hunting hours for August hunt",
  "image": "https://www.tampabay.com/resizer//mf6pDF8gQBaH8overI08ArOPhmY=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/3PJRFBAU4ZQQXEAWNNLRDOUSVY.jpg",
  "link": "https://www.tampabay.com/news/environment/2022/05/03/florida-expands-alligator-hunting-hours-for-august-hunt/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4071,
    3283,
    2661,
    2671,
    5164
  ],
  "sentences": [
    "However, concerns were raised, in part, that the 24-hour proposal would conflict with other outdoor activities, such as bass fishing and duck hunting, and about a potential for meat spoiling from alligators harvested during the hottest part of the day.",
    "The Florida Fish and Wildlife Conservation Commission approved a final rule change Tuesday that will extend what had largely been nighttime hunting  between 5 p.m. and 10 a.m.  to 24 hours during the season.",
    "Carla Wilson, a Winter Springs resident and animal-rights activist, said the commission should revisit the rule change after November, as daylight hunting could affect tourism and recreational boating.",
    "The state each year issues about 7,500 permits, with 40 to 50 percent of permit holders reaching a two-gator limit, said Brooke Talley, coordinator of the commissions Alligator Management Program.",
    "Supporters said the change will help hunters better schedule trips and potentially allow more young and senior hunters to participate, as they might be more comfortable hunting during the day.",
    "It would easily kill an afternoon to have a family boating out on a lake interrupted by a violent gator killing or seeing a bloody alligator hanging off the side of a boat,? Wilson said.",
    "Airbows, which are charged with an external high compression source to propel arrows, were not commercially available the last time the state updated its alligator-harvest methods.",
    "Bryan Wilson, of Winter Springs, expressed concerns about inexperienced hunters using the airbows and said broken tethers could result in alligators escaping but remaining maimed.",
    "What do you do??\nThe commission on Tuesday also agreed to expand the arsenal for alligator hunters by allowing pre-charged pneumatic airbows with tethered lines.",
    "To determine their future use, Talley said the commission could include questions about the effectiveness of airbows when it surveys hunters after the season.",
    "Ron DeSantis on Monday said he would approve $30 million in the state budget for the upcoming year to help manatees after a record number of deaths in 2021.",
    "Florida has an estimated 1.3 million alligators, and the annual hunt, which runs from Aug. 15 to Nov. 1, results in about 7,500 alligators killed.",
    "Commission Chairman Rodney Barreto defended the change, calling the hunt a sign that efforts to protect alligators in Florida have been working.",
    "The commission had received comments from more than 7,000 people through workshops, webinars and surveys that mostly supported the changes.",
    "The commission approved the change in a voice vote during a meeting at the Hilton University of Florida Conference Center in Gainesville.",
    "I think the public needs to understand that the American alligator in Florida, like the manatees, has been a huge success story.",
    "The state has allowed a number of methods involving tethered lines, including crossbows, bows, snatch hooks and harpoons.",
    "In supporting the change, Newton Cook of the United Waterfowlers Florida said the new hours will help law enforcement.",
    "TALLAHASSEE  Alligators in Florida will be targeted around-the-clock when the next hunting season begins in August.",
    "However, Commissioner Sonya Rood said the daytime hours could result in some uncomfortable situations for parents.",
    "What had been a nighttime hunting season will be expanded to 24 hours a day later this summer.",
    "Those deaths largely stemmed from a lack of seagrass that provides critical food for manatees.",
    "If Im out with my family, and Ive got some kids and we witness that (a gator being killed).",
    "As a conservation commission, our mission is not complete, but its working.?\nGov.",
    "The commission estimates a minimum of 7,520 manatees inhabit Florida waters.",
    "It just takes away complications and confusion out there,? Newton said.",
    "About 7,500 more alligators a year are killed in nuisance situations.",
    "You know some guys got a gator hooked up and its 10:15 (a.m.).",
    "I think itd be traumatic for kids to see,? Rood said.",
    "By Jim Turner, News Service of Florida",
    "Its a nightmare for law enforcement.",
    "It really has,? Barreto said."
  ]
}