{
  "id": 4127,
  "mediaId": 195,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Florida Republican: Abortion ban can help human trafficking victims escape captors",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/ca_floridacapitol_030722_getty.jpg?w=1440&h=880&crop=1",
  "link": "https://thehill.com/news/state-watch/3475299-florida-republican-abortion-ban-can-help-human-trafficking-victims-escape-captors/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Olafimihan Oshin",
  "authorUrl": "https://thehill.com/author/olafimihan-oshin/",
  "termIds": [
    661,
    4155,
    400,
    428,
    2661,
    2788,
    2789,
    5057
  ],
  "sentences": [
    "When asked about Garcias comments, Florida state Rep. Michael Grieco (D), who is running against Garcia for her state Senate seat, told DeFede that the remarks at the town hall meeting were ridiculous? and a disgusting thing to say.?\nClaiming that someone should be forced to carry a child to term because they would be less marketable as a commodity for their pimp is insane,? Grieco told DeFede.",
    "So what we would like, as a matter of fact, we would like to see in the future is more of these entities like Planned Parenthood reporting these human traffickers because its a copy, paste, repeat,? Garcia said at the town hall meeting.",
    "The town hall comments come as Politico on Monday published a draft Supreme Court opinion, written by Justice Samuel Alito, that overturns the landmark Roe v. Wade decision, which gives the constitutional right to get an abortion.",
    "When the girl or the woman gets pregnant, and they cant make her get an abortion or she doesnt want to get an abortion or they cant get her to a place to get an abortion, they dont use her anymore.",
    "During an episode of CBSs Miami affiliate show Facing South Florida,? host Jim DeFede highlighted recent remarks made by Florida state Sen. Ileana Garcia (R) at a town hall meeting in Miami Beach.",
    "In the short clip, Garcia is seen answering a question on why she didnt support an exception to the states new 15-week abortion ban for women who are victims of rape, incest or human trafficking.",
    "Its a disgusting thing to say, its ignorant, I dont know where its coming from and the fact that somebody in elected office could say something like that should disqualify them.",
    "It is one of the most ridiculous things as a former prosecutor and just a human being, somebody who handled these types of cases for years.",
    "A Florida GOP lawmaker said at a town hall meeting that a ban on abortion can help victims of human trafficking escape their captors.",
    "Ron DeSantis (R) signed the states abortion ban, which prohibits abortions from being conducted after 15 weeks, into law last month.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Its ridiculous.?\nThe Hill has reached out to Garcias office for comment.",
    "So they release her from the human trafficking ring,? Garcia added.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "That is why we went to that point.?\nFlorida Gov."
  ]
}