{
  "id": 4129,
  "mediaId": 302,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Florida politicians react to leaked draft opinion on overturning Roe v. Wade",
  "image": "https://www.tampabay.com/resizer//sGQzetZ7Ju6fgs-O0JwX2OGheQQ=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/K6D7H2CGKSJOZHNWKTGSXDRHOU.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/03/how-florida-reacted-to-leaked-overturn-of-roe-v-wade/",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    827,
    971,
    1451,
    1572,
    1761,
    4706,
    482,
    3561,
    2661
  ],
  "sentences": [
    "Sen. Marco Rubio went first, tweeting, The next time you hear the far left preaching about how they are fighting to preserve our Republics institutions & norms remember how they leaked a Supreme Court opinion in an attempt to intimidate the justices on abortion.?\nThe next time you hear the far left preaching about how they are fighting to preserve our Republics institutions & norms remember how they leaked a Supreme Court opinion in an attempt to intimidate the justices on abortion https://t.co/9W6jKCZQQt\n Marco Rubio (@marcorubio) May 3, 2022\nSen. Rick Scott also weighed in on the leak of the draft opinion, saying the leak violates the sacred? deliberation process of the Supreme Court, free from political interference.",
    "Florida House Speaker Chris Sprowls, R-Palm Harbor, did not put out a statement of his own as of Tuesday morning, but retweeted another message from Rubio citing a Bible passage that reads, Before I formed you in the womb I knew you.?\nRep. Fentrice Driskell, D-Tampa, the House Democratic policy chairperson, said in a news conference Tuesday morning that when she read the news she felt like she wanted to jump out of my skin.?\nShe said government seems to think it knows best, even in the most intimate of circumstances, and that it takes lives out of context.",
    "Democratic U.S. Rep. Val Demings, who is challenging Rubio for Senate, tweeted that striking down Roe v. Wade is appalling and extremely dangerous.?\nShe added that we refuse to go back to being treated as second-class citizens whose personal decisions are made by politicians like Marco Rubio, who has fought relentlessly against the right of Florida women to control their own destiny.?\nThe Democratic contenders for Florida governor were quick to weigh in as well, each condemning the draft ruling but offering somewhat different tones.",
    "She wrote that, Im going to do everything in my power to protect the women of Florida and preserve freedom over our bodies  including beating Ron DeSantis.?\nState Sen. Annette Taddeo, D-Miami, said the brunt of the ruling would be felt by women who cannot afford to cross state lines, the majority of them Black and Brown, to states that allow access to this medical care.?\nGov.",
    "In a statement released Tuesday morning, Crist added that the U.S. Senate should follow the House of Representatives to enact abortion protections in law, and if need be, end the filibuster to ensure its passage.?\nAgriculture Commissioner Nikki Fried announced a plan for a news conference at the Freedom Tower in Miami Tuesday afternoon.",
    "https://t.co/S5eMGO0dxd\n Rick Scott (@SenRickScott) May 3, 2022\nBoth senators certainty about the motivations behind the leak contradicted other theories by some observers of the court who speculated that the leak could just as well have come from a conservative.",
    "She said legislators like her are ready to fight and make sure those who pursue this anti-abortion agenda feel the consequences of stripping away our rights.?\nRep. Mike Beltran, R-Lithia, called the draft opinion some of Justice Samuel Alitos best work.",
    "Florida politicians of all stripes reacted swiftly to the news Monday night of a leaked U.S. Supreme Court draft opinion that suggests the court is in favor of overturning Roe v. Wade, the landmark decision that legalized abortion.",
    "And Ill do it again if need be  because I will always stand with women.?\nIt is true that Crist vetoed a bill that would have required an ultrasound before abortions could be performed.",
    "On the topic of the leak itself, both Florida U.S. Republican senators accused liberals of leaking the draft opinion, though they did not cite any evidence.",
    "If true, the fight for a womans right to choose will be left up to each state to decide  and front and center in this falls election.",
    "Chief Justice John Roberts confirmed the leaked document was authentic, but doesnt represent the final decision of the court.",
    "He also added two tweets about his own history on abortion issues, saying, As your governor I vetoed an anti-abortion bill.",
    "This breach shows that radical Democrats are working even harder to intimidate & undermine the Court,? he tweeted in part.",
    "According to the leaked draft, Alito, who is a member of the courts six-justice conservative majority, wrote the opinion.",
    "U.S. Rep. Charlie Crist of St. Petersburg said that the decision only ups the stakes for the governors race.",
    "The Supreme Courts confidential deliberation process is sacred & protects it from political interference.",
    "Eskamani said the news that the court could be in favor of overturning Roe v. Wade didnt surprise her.",
    "This breach shows that radical Democrats are working even harder to intimidate & undermine the Court.",
    "Driskell was joined by Rep. Anna Eskamani, D-Orlando, who used to work for Planned Parenthood.",
    "I dont think its the business of the government to be intervening in this way,? she said.",
    "If youre unable to see the embedded media on your mobile device, try reading it here.",
    "But PolitiFact found that his past positions on abortion have been inconsistent.",
    "Ron DeSantis had not released a statement or tweeted as of Tuesday morning.",
    "She said she was not asking for money, but was asking for volunteers.",
    "We must defeat DeSantis,? he said in a Monday night tweet.",
    "The justices cannot be swayed by this attack.",
    "This is a breaking story that may be updated.",
    "He announced an investigation into the leak.",
    "It was always their plan."
  ]
}