{
  "id": 4130,
  "mediaId": 558,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Roe v. Wade decision: Companies are really going to be forced to take a side, expert explains",
  "image": "https://s.yimg.com/uu/api/res/1.2/acRwDkPh5RM7kZvMIYZrjA--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-05/be9e6260-cb17-11ec-9fb1-11553f072813",
  "link": "https://finance.yahoo.com/video/roe-v-wade-decision-companies-193232799.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "And, Neeru, just digging into that a little bit deeper-- I guess, if you were to be advising some of these CEOs, if you were telling them exactly how or the best way to go about handling a situation like this-- like you said before, it's impossible now for companies to stay out of something like this-- what are the one or two things, maybe, these executives could focus on when they're determining how to address this issue?",
    "I mean, when you're making these decisions about what state to locate your business in, where to hire more employees, where to expand your operations, you know, you think about the tax climate, but you have to also think about the political climate, because it is something that matters to your employees, and especially in these knowledge-intensive industries.",
    "And so, you know, not only-- I mean, we can think about the benefits they're offering their employees, and the access to these kinds of services, and helping employees travel across state lines in order to meet their health care needs is one thing, but, you know, there are other things as well.",
    "You know, are you going to open up a new factory or a new office in a state or not based on these kinds of health care policies, because these companies are thinking about their employees and they're thinking about their customers.",
    "We've heard from a number of companies ahead of this leak-- Yelp City, Amazon, just to name a few of them, laying out some plans just in terms of what they plan to do for employees if, in fact, Roe v Wade is overturned.",
    "Neeru Paharia, an associate professor at Georgetown University, weighs in on the leaked Supreme Court decision draft regarding Roe v. Wade and how companies will likely find themselves forced to take one side.",
    "But my question to you, though, is talk to us just about what this means for companies and the pressure that businesses are facing these days to take a stand on an issue like this.",
    "And I know you talked about employees, but you also have investors like Warren Buffett, who says, look, I have shareholders who, perhaps, may not share the same beliefs as me.",
    "Video Transcript\nSEANA SMITH: We want to continue talking about this and exactly what this means for businesses, how corporate America is handling this landmark case.",
    "Or do they have to take a side if they're also having to worry about, perhaps, well-being of some of these companies and shareholders that rely on them?",
    "You have to pick one side of the fence to be on, especially if you operate in one of these states where they're predicting the law is going to change.",
    "If you're one of these bigger companies, you're, perhaps, better equipped to budget for some of these travel expenses for people who want to travel.",
    "But in the case of Florida, it's unprecedented that a government would retaliate against a company for taking a political position.",
    "And if there's been a fire drill the last couple of weeks, Neeru, it's, of course, been Disney versus Ron DeSantis in Florida.",
    "If staying out of some of these very polarizing political issues is an option, that might be something to really consider.",
    "There were some grumblings of similar things happening in Georgia post the election with Delta and a few other companies.",
    "You hinted this earlier-- new buildings, expansion, hiring new employees-- will this impact the greater economy?",
    "And the sort of political alignment of both of those constituencies matters tremendously to these companies.",
    "RACHELLE AKUFFO: And obviously, we're already in the middle of a labor shortage here in the United States.",
    "What do you think this might mean, though, for smaller companies who, perhaps, can't afford these things?",
    "If you have the resources to offer those kinds of services to your employees, you can do that as well.",
    "What do you think CEOs across the country ought to have learned from what happened in Florida?",
    "If you think about it, you're a small coffee shop in the middle of Texas, what can you offer?",
    "And so I think in that case, maybe you can speak out publicly against some of these things.",
    "There's so many different stakeholders-- your employees, your shareholders, your customers.",
    "And in this particular case, companies are really going to be forced to take a side.",
    "And for that, we have Neeru Paharia, Associate Professor at Georgetown University.",
    "How do you expect that future business decisions will be made in regard to this?",
    "But in the case where you don't really have a choice, then what do you do?",
    "And all the constituents-- you have to think about all the constituents.",
    "The employees have strong opinions, and particularly often on one side.",
    "Yeah, so if you can't stay out of it, then you do have to pick a side.",
    "So he tends to not speak out on some of these political issues.",
    "I mean, in that case, you're definitely kind of stuck, right?",
    "What about some of these publicly traded companies?",
    "Does the CEO, perhaps, owe them, perhaps, silence?",
    "Yeah, I mean, that-- that is truly unprecedented.",
    "And we live in a very politically divisive world.",
    "Neeru Paharia from Georgetown, thanks so much.",
    "It's uncharted territory we're in right now.",
    "And it is sure to shake up the midterms.",
    "Yeah, it's incredibly complicated.",
    "And, Neeru, it's great to see you.",
    "So it's a tightrope to walk.",
    "I personally think so, yes.",
    "NEERU PAHARIA: Yeah.",
    "Very difficult.",
    "Yeah."
  ]
}