{
  "id": 4131,
  "mediaId": 558,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Column: Corporations left California for lower taxes and fewer regulations. Will abortion rights bring them back?",
  "image": "https://s.yimg.com/ny/api/res/1.2/7ltZark2MTs8TyE2RKQfpg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/b1gZMaLu4B_wK.rnTmSwgQ--~B/aD01NjA7dz04NDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/la_times_articles_853/c154e1204e48624931189bafc4050738",
  "link": "https://finance.yahoo.com/news/column-corporations-left-california-lower-190609019.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Hiltzik",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Walt Disney Co., which long had proudly trumpeted its support for LGBTQ employees and customers, set a new standard for corporate cowardice by initially remaining publicly silent on Florida's bill suppressing the teaching of gender issues in public schools, which was known by critics as the \"Don't Say Gay\" bill.",
    "The law also established a bounty system by allowing anyone, even outside Texas, to sue doctors, other healthcare professionals or anyone suspected of aiding and abetting an illegal abortion, and to seek damages of up to $10,000 per defendant.",
    "In the case of a total ban in nearby states already hostile to abortion, such as Utah and Arizona, the number of women ages 15 to 49 who might drive to California for abortion services would , the Guttmacher Institute estimates.",
    "A established last year by the Legislature recommended increasing abortion funding and improving the infrastructure supporting abortion services, as well as strengthening legal protections for abortion patients and providers.",
    "The leaked draft of a Supreme Court ruling striking down Roe vs. Wade, which has protected abortion rights at the federal level for nearly 50 years, will place their silence firmly on the wrong side of history.",
    "Those figures have scarcely budged since Roe vs. Wade was handed down in 1973  so much for the assertion in that Roe vs. Wade and a follow-on 1992 ruling known as Casey had \"deepened division\" in the country.",
    "A handful of companies have responded to the Texas law and other recent state abortion bans or restrictions by offering workers in those states assistance in accessing abortion services elsewhere.",
    "The court's ruling is coming in a case involving an antiabortion law in Mississippi, but striking down Roe vs. Wade would presumably allow any state to restrict or eliminate abortion rights.",
    "According to a roster compiled by Bloomberg, they include Citigroup, headed by Chief Executive Jane Fraser, with 8,500 employees in Texas, as well as Levi Strauss & Co. and Apple.",
    "In 2019, committing its membership of more than 200 major corporations to operate for the benefit not merely of shareholders but employees, suppliers customers and communities.",
    "The right to abortion has been enshrined in the state Constitution via a right-to-privacy provision that the state Supreme Court interpreted as a guarantee of abortion rights.",
    "According to the Guttmacher Institute, which tracks abortion legislation, live in a state the institute judges to be hostile or extremely hostile to abortion rights.",
    "When outrage by employees and others finally prompted the company to take a stand, its reversal only for Florida's brutish Republican governor, Ron DeSantis.",
    "Last year, corporate America remained mostly silent as Texas launched a pitiless attack on abortion rights, a trend that spread rapidly to other red states.",
    "It has taken a while for the implications of the Texas law  which took effect last Sept. 1 after the Supreme Court refused to block it  to sink in.",
    "In acknowledgment of the threat to abortion rights from the U.S. Supreme Court's conservative majority, a move is afoot in Sacramento to place .",
    "Few public policies have as far-reaching an effect on the health and welfare of the American workforce as access to healthcare.",
    "Greg Abbott\nWith the court's evident determination to significantly narrow those rights, silence won't work anymore.",
    "Yet opinion polls consistently show that the vast majority of American voters think in some or all circumstances.",
    "The law banned abortions after six weeks of gestation, well before many women would even know they are pregnant.",
    "Some have promised to cover travel costs, including airfare and lodging, for employees seeking abortions.",
    "The end of Roe vs. Wade is likely to prompt more states to enact ever more draconian abortion bans.",
    "Already, Planned Parenthood of California says it has been since the Texas law went into effect.",
    "What is clear is that states that already favor abortion rights will strive to strengthen them.",
    "[Elon Musk] consistently tells me that he likes the social policies in the state of Texas.",
    "Gavin Newsom has spoken of making California a \"sanctuary\" state for abortion rights.",
    "That's the case in California, which the Guttmacher Institute already ranks as .",
    "The question is: What will American corporations do about it?",
    "Women's reproductive rights play a major role in that access.",
    "Only 38% live in a state supportive of abortion rights.",
    "Only 20% think it should be banned entirely.",
    "Texas Gov.",
    "Gov."
  ]
}