{
  "id": 4132,
  "mediaId": 98,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Column: Corporations left California for lower taxes and fewer regulations. Will abortion rights bring them back?",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/8e8f34e/2147483647/strip/true/crop/5400x3600+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9c%2F9f%2F056e9e4c44a1a03fc56eae8a8c82%2Fap21181779895503.jpg",
  "link": "https://www.latimes.com/business/story/2022-05-03/roe-v-wade-supreme-court-abortion-rights-california-corporations",
  "sentiment": "0.0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Hiltzik",
  "authorUrl": "https://www.latimes.com/people/michael-hiltzik",
  "termIds": [
    661
  ],
  "sentences": [
    "Abortion regulations tend to track more general healthcare and social policies in most states; those that have enacted the harshest restrictions on abortion also tend to have less accommodating public health policies, such as less generous Medicaid programs and fewer mandates for commercial health plans, and less accommodative policies against discrimination.",
    "Walt Disney Co., which long had proudly trumpeted its support for LGBTQ employees and customers, set a new standard for corporate cowardice by initially remaining publicly silent on Floridas bill suppressing the teaching of gender issues in public schools, which was known by critics as the Dont Say Gay? bill.",
    "Greg Abbott said Musk told him he had to get out of California because, in part, of the social policies? in that state and that Musk consistently tells me that he likes the social policies in the state of Texas.?\nWhat is clear is that states that already favor abortion rights will strive to strengthen them.",
    "Superficially, that might point to the dangers for corporations taking a stand on social issues, but in reality it shows the necessity of corporate America standing together in support of social equity  and to the implications for companies with large workforces in states with retrograde social policies.",
    "For corporate executives, it may take more than the shrinking of abortion rights and the glorification of anti-LGBTQ discrimination to outweigh the lure of low taxes and less regulation, but if valued workers start voting with their feet, the reckoning might be inevitable.",
    "The leaking of a draft of what is evidently a majority opinion by Justice Samuel Alito overturning Roe vs. Wade may well turn social issues from the subjects of lazy corporate PR-speak into concrete issues of working conditions, employee recruitment and state regulations.",
    "In the case of a total ban in nearby states already hostile to abortion, such as Utah and Arizona, the number of women ages 15 to 49 who might drive to California for abortion services would increase to 1.4 million from 46,000, the Guttmacher Institute estimates.",
    "It has long been routine for major corporations to include pages attesting to their social responsibility on their websites  generally referencing charitable works and expressing devotion to principles such as diversity and nondiscrimination in anodyne prose.",
    "A Future of Abortion Council established last year by the Legislature recommended increasing abortion funding and improving the infrastructure supporting abortion services, as well as strengthening legal protections for abortion patients and providers.",
    "Possibly the effect has been muted while the courts decision on abortion rights has been secret, as its decisions customarily have been prior to their official publication; how close the Alito draft will be to the final decision is also unknown.",
    "Stakeholders are pushing companies to wade into sensitive social and political issues  especially as they see governments failing to do so effectively,? Fink had written that year in his annual letter to CEOs of BlackRocks portfolio companies.",
    "The law also established a bounty system by allowing anyone, even outside Texas, to sue doctors, other healthcare professionals or anyone suspected of aiding and abetting an illegal abortion, and to seek damages of up to $10,000 per defendant.",
    "Its reasonable to conjecture that state healthcare policies, especially those that affect women, will play into decisions by prospective employees, including well educated women and members of the LGBTQ community, about where to accept jobs.",
    "Those figures have scarcely budged since Roe vs. Wade was handed down in 1973  so much for the assertion in the purported Alito decision that Roe vs. Wade and a follow-on 1992 ruling known as Casey had deepened division? in the country.",
    "Its unclear whether the antiabortion laws already enacted in some states have affected worker recruitment, especially among women of childbearing age or members of households hoping to maintain some control over their family planning.",
    "In 2019, the Business Roundtable issued a manifesto committing its membership of more than 200 major corporations to operate for the benefit not merely of shareholders but employees, suppliers customers and communities.",
    "The leaked draft of a Supreme Court ruling striking down Roe vs. Wade, which has protected abortion rights at the federal level for nearly 50 years, will place their silence firmly on the wrong side of history.",
    "Major corporations said they would cease making campaign contributions to lawmakers who voted against certifying Joe Bidens election or played a role in the Jan. 6, 2021, insurrection in Washington.",
    "In acknowledgment of the threat to abortion rights from the U.S. Supreme Courts conservative majority, a move is afoot in Sacramento to place an explicit right to abortion in the state Constitution.",
    "A handful of companies have responded to the Texas law and other recent state abortion bans or restrictions by offering workers in those states assistance in accessing abortion services elsewhere.",
    "To some extent, the Roundtable was trying to jump ahead of a parade being led by major institutional investors, of whom the drum major was Lawrence Fink, chief of the investment firm BlackRock.",
    "According to the Guttmacher Institute, which tracks abortion legislation, 58% of women ages 13 to 44 live in a state the institute judges to be hostile or extremely hostile to abortion rights.",
    "The courts ruling is coming in a case involving an antiabortion law in Mississippi, but striking down Roe vs. Wade would presumably allow any state to restrict or eliminate abortion rights.",
    "Many companies that had pledged to end or at least review their contributions to the 147 Republicans who voted against certifying the 2020 presidential election soon resumed their support.",
    "When outrage by employees and others finally prompted the company to take a stand, its reversal only made it a convenient target for Floridas brutish Republican governor, Ron DeSantis.",
    "None of the major companies most often mentioned as having relocated to Texas from California  Oracle, Tesla and Hewlett Packard Enterprise  has expressed misgivings about its move.",
    "According to a roster compiled by Bloomberg, they include Citigroup, headed by Chief Executive Jane Fraser, with 8,500 employees in Texas, as well as Levi Strauss & Co. and Apple.",
    "The right to abortion has been enshrined in the state Constitution via a right-to-privacy provision that the state Supreme Court interpreted as a guarantee of abortion rights.",
    "Business leaders pledged to stand firm against the assaults from the political right wing on voting rights, womens reproductive healthcare rights and democracy itself.",
    "Some made similar promises about state laws restricting abortion or voting rights, or talked openly about reducing their activities in states enacting such measures.",
    "California is one of six states that requires health insurance plans to cover abortion, and one of four that has outlawed co-pays or deductibles for that service.",
    "Elon Musk, who moved the headquarters of his Tesla electric vehicle company to Austin from Silicon Valley, hasnt even tweeted about the latest abortion news.",
    "Last year, corporate America remained mostly silent as Texas launched a pitiless attack on abortion rights, a trend that spread rapidly to other red states.",
    "Already, Planned Parenthood of California says it has been treating more than 80 out-of-state patients per month since the Texas law went into effect.",
    "It has taken a while for the implications of the Texas law  which took effect last Sept. 1 after the Supreme Court refused to block it  to sink in.",
    "Major companies headquartered in Texas, such as AT&T, turned out to be heavy contributors to sponsors of the states horrifying antiabortion law.",
    "Whether that will prompt companies to factor the legal environment into their location or relocation decisions is impossible to say, so far.",
    "But there has been no concerted corporate expression of outrage about the rapid contraction of womens healthcare rights across the country.",
    "Yet opinion polls consistently show that the vast majority of American voters think abortion should be legal in some or all circumstances.",
    "That would be unsurprising if corporations had not been paying lip service to their sense of social responsibility in recent years.",
    "Few public policies have as far-reaching an effect on the health and welfare of the American workforce as access to healthcare.",
    "Thats the case in California, which the Guttmacher Institute already ranks as the most supportive in the country.",
    "The law banned abortions after six weeks of gestation, well before many women would even know they are pregnant.",
    "In the fullness of time, these commitments, pledges and promises proved to be nothing but gusts of hot air.",
    "Some have promised to cover travel costs, including airfare and lodging, for employees seeking abortions.",
    "Initiatives like those in California will widen the gulf in social policies between red states and blue.",
    "With the courts evident determination to significantly narrow those rights, silence wont work anymore.",
    "The end of Roe vs. Wade is likely to prompt more states to enact ever more draconian abortion bans.",
    "Salesforce has said it would help any Texas-based employees to relocate to escape the state law.",
    "Lyft and Uber have offered to pay the legal fees of drivers sued under bounty provisions.",
    "Gavin Newsom has spoken of making California a sanctuary? state for abortion rights.",
    "The day after the Texas abortion ban went into effect, Texas Gov.",
    "The question is: What will American corporations do about it?",
    "Womens reproductive rights play a major role in that access.",
    "Only 38% live in a state supportive of abortion rights.",
    "Only 20% think it should be banned entirely.",
    "Gov."
  ]
}