{
  "id": 4133,
  "mediaId": 238,
  "date": "d2022-05-03T12:00",
  "headline": "Opinion Surprise, surprise: Florida leads the nation in Jan. 6 defendants",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/03/florida-defendants-capitol-insurrection/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    683,
    718,
    870,
    1148,
    1237,
    1692,
    3938,
    4492,
    2661
  ],
  "sentences": [
    "On the first anniversary, DeSantis dismissed the Capitol riot as Christmas? for D.C.-New York media,? which use it to smear anyone whoever supported Donald Trump.? He also said, Its an insult to people when you say its an insurrection and then a year later, nobody has been charged with that.?\nTrue enough  but the Jan. 6 federal charges against Floridians alone include obstruction of law enforcement during civil disorder; assaulting, resisting or impeding certain officers using a dangerous weapon and inflicting bodily injury on certain officers; and destruction of government property and aiding and abetting.",
    "Among the rich and notorious ideologues who live full time in Florida or own homes there, the roster includes Fox News favorites Tucker Carlson, Sean Hannity and Laura Ingraham, radio hosts Dan Bongino and Mark Levin, Newsmax CEO Chris Ruddy, political operative Roger Stone and political commentator Ben Shapiro.",
    "You had folks who had created a political community, and they were energized.?\nThe tea party was the dress rehearsal for hard-right MAGA political mobilization, which was turbocharged by the covid-19 rebellion and the spread of misinformation, fearmongering and crackpot conspiracies via social media.",
    "Ron DeSantis, a tea party favorite, won his U.S. House seat in 2012.\nThe tea party movement really helped teach and educate other citizens about these issues,? Deana A. Rohlinger, director of research for the Institute of Politics at Florida State University, told me.",
    "You can move the dial quite successfully.?\nThe movement has been stoked by leaders who jack up anger and endorse conspiracies (whether about vaccines, 2020 electoral fraud or gay indoctrination in schools), which happens to translate into campaign committee treasure.",
    "That contentious five-week battle included a Stop the Recount? rally of Brooks Brothers-clad Republican operatives in Miami, in what now looks like a dry run for the Stop the Steal? campaign to throw a monkey wrench into the 2020 election results.",
    "In 2000, with Jeb Bush as governor, Florida was baptized into high-stakes politics, becoming ground zero for the deadlocked presidential election between the governors brother, George W. Bush, and his Democratic rival, Al Gore.",
    "This is where the political power within the right wing or the America First movement is centralized.?\nBut high-profile Republicans are hardly the only Floridians gaga over MAGA.",
    "By 2010, the tea party, a populist conservative/libertarian precursor to MAGA that decried taxes, government spending and regulation, had found fertile ground in Florida.",
    "Of states with conservative activism, Florida is definitely at the top,? Rachel Carroll Rivas, a senior research analyst with the Southern Poverty Law Center, told me.",
    "As befits the home of Donald Trump, Florida has also become a MAGA hot spot, drawing conservative provocateurs, media personalities, politicians and rabble rousers.",
    "The governors popularity in the state is growing, as is speculation about whether he would challenge Trump in 2024 if the former president decides to run.",
    "That year, the tea party helped put then-Sen. Rick Scott in the Florida governors mansion and Marco Rubio, a former state lawmaker, in the U.S. Senate.",
    "Of those arrested in Florida, a few are state or national leaders of hard-right extremist organizations such as the Proud Boys and the Oath Keepers.",
    "Activists have effectively targeted school boards, county commission meetings and LGBTQ students, sometimes under the guise of parental rights.",
    "DeSantis has raised a mind-boggling $105 million for his 2022 gubernatorial race and has quickly become a formidable national brand.",
    "Florida has forever been a magnet for social misfits and fugitives, drug lords and con men, colorful outliers and outright liars.",
    "Of the more than 800 people criminally charged for participating in the Jan. 6 insurrection, Floridians take the top spot.",
    "The tea party movements operatives used the state as a launchpad for national grass-roots organizing and fundraising.",
    "All roads lead to Mar-a-Lago,? Laura Loomer, a right-wing activist and fellow Floridian, told Vanity Fair last fall.",
    "But this is a state that has been in the grips of a Republican legislature and Republican governors since 1999.",
    "The governor is unlikely to be troubled by Floridas distinction as the top supplier of Jan. 6 defendants.",
    "DeSantis did say hes all about? holding to account anyone who riots or obstructs government proceedings.",
    "For decades, Florida has been a hotbed of gun-rights advocacy, a hot-button issue for MAGA extremists.",
    "I wish I could say I was surprised to see how many Floridians fell into the MAGA Jan. 6 vortex.",
    "In the latest tally, 72 people have been arrested and charged in Florida.",
    "He is about? many other things too, and it is working for him.",
    "The on-the-ground game is very accessible in Florida.",
    "The state also has plenty of Trumpian ground troops.",
    "In Florida, that mobilization has paid dividends.",
    "Texans come in a close second, with 71.",
    "If only that were true.",
    "Gov."
  ]
}