{
  "id": 4139,
  "mediaId": 124,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Black churches urged to fight anti-LGBTQ state laws",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220427-church-pride-flag-mjf-1256-0fb912.jpg",
  "link": "https://www.nbcnews.com/news/nbcblk/black-churches-urged-fight-anti-lgbtq-state-laws-rcna26275",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    644,
    661,
    2250,
    257,
    3202,
    3248,
    2661,
    2934
  ],
  "sentences": [
    "So this is the perfect moment to lift the voice of Black religious communities and Black religious leaders to say, When we talk about LGBTQ concerns and issues, were talking about members of our own community.?\nMore than 70 percent of Black LGBTQ adults are religious  either highly religious, 31.7 percent, or moderately religious, 39.3 percent  according to a 2020 report from the Williams Institute, a sexual orientation and gender identity research program at UCLA School of Law.",
    "Were talking about people, and were talking about people that actually sit in your pews.?\nSontaia Briggs, the board president at Parity, an organization that focuses on the intersection of faith and LGBTQ identity, said its important to host conversations that help build affirm and build connections among non-LGBTQ and LGBTQ religious communities.",
    "Cedric A. Harmon, the executive director of Many Voices, a Black church organization promoting LGBTQ justice, said in an interview that its a critical time for religious leaders to speak up in support of the Equality Act, a bill that would solidify nondiscrimination protections for the LGBTQ community.",
    "This is something that the church, I think, often is too reticent to do  to speak out in support of legislation that addresses historical discrimination against the LGBTQ community,? said Harmon, who identifies as same-gender-loving and has worked with religious leaders to advance LGBTQ rights.",
    "It is a community of organizers that has a deep understanding of what it is to be pushed out of the systems that should serve all of us,? the panels moderator, Kendra R. Johnson, the executive director of Equality North Carolina, an LGBTQ organization, said in a phone call.",
    "Harmon said in a phone interview, Theres still an inordinate amount of shame and stigma within the Black community as it relates to LGBTQ-identified folks,? adding that he reminds religious leaders: Were not talking about issues.",
    "Ron DeSantis signed the Parental Rights in Education bill, which critics have called the Dont Say Gay? bill, banning classroom discussions about sexual orientation or gender identity in the states public schools.",
    "This is a moment for church members who may have a trans member of their family to actually speak out about their love and concern for that member and bring that to their pastor or religious leader,? Harmon said.",
    "So far this year, six transgender and gender-nonconforming people across the U.S. have been killed in anti-trans violence; most of the victims were trans women of color, according to the Human Rights Campaign.",
    "Greg Abbott released a directive calling on licensed professionals? and members of the general public? to report the parents of transgender minors who appear to be receiving gender-affirming care.",
    "Johnson, who is Catholic and lives in Durham, North Carolina, said the church should use its power to fight for the civil rights of everyone  yet that hasnt always been the case.",
    "The Equality Act, which passed in the House in a 224-206 vote largely along party lines in February 2021, doesnt have the 60 votes needed to bypass a filibuster in the Senate.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nPanelists also called on members to denounce the epidemic of violence facing Black trans women.",
    "To understand that these two things can live in the same space  which is being queer and being a person of faith.?\nFollow NBCBLK on Facebook, Twitter and Instagram.",
    "In 1957, Martin Luther King Jr. became the first president of the Southern Christian Leadership Conference, a group organizing nonviolent protests in the South.",
    "Black religious leaders and advocates are urging church members to signal support for the LGBTQ community as anti-LGBTQ legislation rises throughout the U.S.",
    "Advocates highlighted the need to pass bipartisan federal legislation that protects religious liberty and LGBTQ rights in a virtual panel last week.",
    "During the civil rights era of the 1950s and the 1960s, Black churches played an integral role in the fight for integration.",
    "Meanwhile, on the state level, Florida and Texas have recently been at the center of heated debates over LGBTQ rights.",
    "Texas has also banned trans youths from participating on school sports teams that align with their gender identities.",
    "The latest effort to protect LGBTQ rights follows a long history of advocacy within Black religious communities.",
    "State legislators have proposed at least 238 bills that would limit the rights of LGBTQ people just this year.",
    "Harmon said discussions about sexual orientation and gender identity remain in the shadows.",
    "It is really just about trying to bring all sides together,? Briggs said.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "One of the experts on the panel, the Rev.",
    "In February, Texas Gov.",
    "In March, Florida Gov."
  ]
}