{
  "id": 4148,
  "mediaId": 558,
  "date": "d2022-05-03T07:48",
  "headline": "Hurting gay and trans kids: Dont Say Gay bill up for discussion at tonights DCPS meeting",
  "image": "",
  "link": "https://news.yahoo.com/hurting-gay-trans-kids-don-144809544.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessica Barreto",
  "authorUrl": "",
  "termIds": [
    661,
    4594,
    3202,
    4970
  ],
  "sentences": [
    "Thanks, Governor DeSantis,? Joyce writes in the document, for what she says is his role in defending parents rights? and teaching children their values.?\nThe resolution voices support for the Parental Rights in Education bill, which limits when and how teachers and school staff can discuss gender and sexual orientation with students.",
    "The resolution disapproves of an LGBTQ+ guide telling employees its never appropriate to divulge the sexual orientation of a student to a parent.?\nMidyette says making it ok to divulge could silence students, and discourage faculty members from sponsoring Gender and Sexuality Alliance Clubs that meet after school.",
    "There is no circumstance that I could support a resolution that thanks the governor for hurting gay and trans kids,? said Jimmy Midyette, the Co-Founder of the Jacksonville Coalition for Equality.",
    "The resolution says it aims to maximize parental involvement, while LGBTQ+ advocates worry itll discourage students from being openly gay or trans.",
    "School board member Charlotte Joyce is introducing a resolution to support Governor Ron DeSantis controversial Parental Rights in Education law.",
    "Dont be open. And its not fair to push students back into the closet whenever they have already come out and theyre proud,? he said.",
    "The law dubbed by critics as Dont Say Gay? will be up for discussion at Tuesday nights Duval County Public Schools meeting.",
    "Resolutions like this, and even the political environment around it, is telling young people, Hey, be quiet.",
    "What youll hear is a lot of folks from the community just coming out to be supportive of LGBTQ+ students.",
    "She is running to represent District 6, which covers 21 schools across Jacksonvilles westside.",
    "He is organizing for several members to show up at Tuesday nights school board meeting.",
    "Action News Jax reached out to Joyce for comment Monday morning but did not hear back.",
    "Joyce is running unopposed for re-election in August."
  ]
}