{
  "id": 4152,
  "mediaId": 163,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Factbox: Restrictions vs protections: How U.S. states are taking sides on abortion",
  "image": "https://www.reuters.com/resizer/Z7BOB94LIFh6Hidqi8v08CCpbHM=/1200x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/FIZDLQ7QLNNITDT2WP7B5FCEE4.jpg",
  "link": "https://www.reuters.com/world/us/restrictions-vs-protections-how-us-states-are-taking-sides-abortion-2022-05-03/",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gabriella Borter",
  "authorUrl": "https://www.reuters.com/authors/gabriella-borter/",
  "termIds": [
    661,
    1284,
    1523,
    2058,
    2064,
    146,
    428,
    482,
    2945
  ],
  "sentences": [
    "REUTERS/Jonathan Ernst\nMay 3 (Reuters) - If the U.S. Supreme Court votes to overturn the Roe v. Wade decision that legalized abortion nationwide, conservative states will have more confidence that their new limits on abortion will stand while liberal states will feel more urgency to protect and expand abortion rights.",
    "KENTUCKY: The legislature in April overrode Democratic Governor Andy Beshear's veto to enact several abortion restrictions, including a 15-week ban, a requirement that fetal remains be cremated or interred, and a requirement that a combination birth-death or stillbirth certificate be issued for each abortion.",
    "Protestors react outside the U.S. Supreme Court to the leak of a draft majority opinion written by Justice Samuel Alito preparing for a majority of the court to overturn the landmark Roe v. Wade abortion rights decision later this year, in Washington, U.S., May 2, 2022.",
    "MARYLAND: The legislature passed a bill that expands the definition of who can provide abortions to include any \"qualified provider,\" establishes a state-funded abortion provider training program and requires most insurance plans to cover the cost of abortions.",
    "read more\nHere are some restrictions and protections state legislatures have taken up in 2022:\nABORTION RESTRICTIONS\nARIZONA: Republican Governor Doug Ducey in March signed a bill banning abortions after 15 weeks of pregnancy.",
    "IDAHO: Republican Governor Brad Little signed a six-week abortion ban in March that allows family members of the fetus to sue providers who perform abortions past that point, similar to a Texas law enacted last year.",
    "Among other provisions, the measure bars state agencies from assisting in interstate investigations seeking to hold someone civilly or criminally liable for getting or aiding an abortion.",
    "CONNECTICUT: The legislature passed a bill in April that protects anyone who provides abortions, has an abortion or assists someone having an abortion from other states' restrictions.",
    "Stitt signed a bill in April banning abortion except in medical emergencies and penalizing providers who violate the law with up to $100,000 in fines and 10 years in prison.",
    "FLORIDA: Republican Governor Ron DeSantis in April signed a 15-week abortion ban, which allows exceptions for medical emergencies or if the fetus has a fatal abnormality.",
    "read more\nSOUTH DAKOTA: Republican Governor Kristi Noem signed a bill in March requiring women to make three in-person doctor's visits to complete a medication abortion.",
    "Republican Governor Larry Hogan vetoed the bill, but the state's Democratic-controlled legislature overrode his veto on April 9 and the law is due to take effect July 1.",
    "Also in April, Oklahoma's legislature approved a ban on abortions after six weeks of pregnancy, which relies on the same lawsuit enforcement mechanism.",
    "The law took immediate effect, suspending clinics' ability to provide abortions for eight days until a U.S. judge temporarily blocked its enforcement.",
    "VERMONT: The Democratic-led legislature in February passed a constitutional amendment that guarantees the right to abortion.",
    "The Idaho law was due to take effect in April, but has been blocked by the state Supreme Court pending legal review.",
    "OKLAHOMA: The Senate in April passed a ban on all abortions except in cases of medical emergency, rape or incest.",
    "The House must approve the Senate's amendments before it heads to Republican Governor Kevin Stitt for signing.",
    "COLORADO: Governor Jared Polis, a Democrat, signed a bill on April 4 codifying the right to have an abortion.",
    "It relies on private citizens to sue providers and any person who \"aids or abets\" abortions to be enforced.",
    "The exceptions do not allow for abortion past 15 weeks in case of rape, incest or human trafficking.",
    "The measure makes exceptions for medical emergencies, but not for rape or incest.",
    "The legislation's implementation depends on the outcome of a federal court case.",
    "The law is due to take effect in August if not blocked in court.",
    "With the governor's approval, it would take effect immediately.",
    "It will take effect later this year if not blocked in court.",
    "It will be on the ballot for voters to approve in November.",
    "The bill awaits Democratic Governor Ned Lamont's signature.",
    "It will take immediate effect if signed by Stitt.",
    "The ban is due to take effect on July 1.",
    "The measure immediately took effect."
  ]
}