{
  "id": 4157,
  "mediaId": 239,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Paging Justice Thomas: Eric Swalwell says Republicans want to ban interracial marriage",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/03/24/Supreme_Court_Virginia_Thomas_39197.jpg-593eb_c0-133-4071-2506_s885x516.jpg?7fbaab6913b27e98021f2e3a908896dd79663eff",
  "link": "https://www.washingtontimes.com/news/2022/may/3/eric-swalwell-says-gop-wants-interracial-marriage-/",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Valerie Richardson",
  "authorUrl": "https://www.washingtontimes.com/staff/valerie-richardson/",
  "termIds": [
    661,
    812,
    1055,
    1732,
    2406,
    4260,
    146,
    428,
    482,
    2953
  ],
  "sentences": [
    "The congressman backed up his assertion by citing a March comment by Sen. Mike Braun, Indiana Republican, after Matt Lewis, columnist for the Daily Beast, knocked Mr. Swalwells ridiculous tweet.?\nIn a call with reporters, Mr. Braun was asked whether he thought the Supreme Court should overturn Loving v. Virginia, the 1967 case that ruled laws against interracial marriage were unconstitutional, and leave the decisions to the states.",
    "Let me be clear on that issue  there is no question the Constitution prohibits discrimination of any kind based on race, that is not something that is even up for debate, and I condemn racism in any form,? Mr. Braun said in a March 22 statement to media outlets.",
    "Mr. Braun said initially, Yes, I think that thats something that if youre not wanting the Supreme Court to weigh in on issues like that, youre not going to be able to have your cake and eat it, too,? but later said he misunderstood the question.",
    "Rep. Eric Swalwell, California Democrat, insisted Tuesday that Republicans will next try to outlaw interracial marriage, which may come as a shock to Supreme Court Justice Clarence Thomas and his wife Ginni Thomas.",
    "Mr. Swalwell was one of many Democrats alarmed over the leaked Supreme Court draft indicating that the high court has the votes to overturn the 1973 Roe v. Wade decision, which legalized abortion nationwide.",
    "Even so, Mr. Swalwell tweeted Tuesday: @SenatorBraun said he wants to ban interracial marriage.?\nChristina Pushaw, press secretary for Florida Gov.",
    "Earlier during a virtual press conference, I misunderstood a line of questioning that ended up being about interracial marriage.",
    "He was immediately reminded that Justice Thomas, who is Black, and his wife Ginni, who is White, are an interracial couple.",
    "Rep. Byron Donalds, Florida Republican, also blasted Mr. Swalwell, calling him a fool.?\nYou are such a fool.",
    "Justice Clarence Thomas would like a word,? tweeted Lila Rose, founder of the pro-life group Live Action.",
    "Ron DeSantis, was among those who tweeted photos of Justice Thomas and his wife without comment.",
    "https://t.co/F90nmajjiJ\n Byron Donalds (@ByronDonalds) May 3, 2022",
    "The conservative jurist was nominated by President George H.W.",
    "Well, then you should probably vote,? tweeted Mr. Swalwell.",
    "The Republicans wont stop with banning abortion.",
    "More gaslighting from the radical left!!",
    "More gaslighting from the radical left!",
    "They want to ban interracial marriage.",
    "!? tweeted Mr. Donalds, who is Black.",
    "Do you want to save that?",
    "This is literally crazy.",
    "What is wrong with you!",
    "What is wrong with you!",
    "You are such a fool.",
    "Bush, a Republican."
  ]
}