{
  "id": 4159,
  "mediaId": 19,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Disney Lost $63 Billion in Market Capitalization Since Going Full Woke in Florida",
  "image": "https://media.breitbart.com/media/2022/03/disneychapekfllaw1-640x480.jpg",
  "link": "https://www.breitbart.com/entertainment/2022/05/03/disney-market-capitalization-tanks-63-billion-since-going-full-woke-in-florida/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Ng",
  "authorUrl": "https://www.breitbart.com/author/dng/",
  "termIds": [
    661
  ],
  "sentences": [
    "Our goal as a company is for this law to be repealed by the legislature or struck down in the courts, and we remain committed to supporting the national and state organizations working to achieve that,? the company said in a statement.",
    "The Walt Disney Co. has lost nearly $63 billion in market capitalization since it decided in March to embrace radical LGBTQ activism and declare war on Florida by opposing the states Parental Rights in Education law.",
    "pic.twitter.com/efOSOmb47a\n Christopher F. Rufo ? (@realchrisrufo) April 7, 2022\nLater that month, the company doubled-down on its commitment to wokeness, vowing to continue fighting the Florida law even after Gov.",
    "The Reedy Creek Improvement District conferred a host of perks to Disney, including the right to develop the 25,000 acre area without having to seek government approval.",
    "Disneys predicament grew worse when leaked videos showed company leaders openly boasting about promoting a gay and transgender agenda in Disneys content for children.",
    "The trouble began in early March when Disney CEO Bob Chapek caved to a group of LGBTQ employees, abandoning the companys neutral position on the Florida legislation.",
    "Statement from The Walt Disney Company on signing of Florida legislation: pic.twitter.com/UVI7Ko3aKS\n Walt Disney Company (@WaltDisneyCo) March 28, 2022\nGov.",
    "The videos included an executive producer casually talking about how the company encouraged her not-at-all-secret gay agenda? when she became an employee.",
    "He delegated the company's moral authority to the \"LGBTQIA+ Advisory Council\" and now those internal activists have taken him as an ideological hostage.",
    "Disney has now become a cautionary tale among corporate CEOs who are seeking to avoid a PR disaster like the one Disney brought upon itself in Florida.",
    "For the past 12 months, Disney has seen its stock drop more than 30 percent, making it the worst performing stock on the Dow Jones Industrial Average.",
    "Disneys free fall comes as the company has embraced woke, far-left politics, specifically the exposure of young children to radical LGBTQ ideology.",
    "DeSantis responded by stripping the company of its self-governing status in Orlando, a special privilege Disney has enjoyed for five decades.",
    "In so doing, the entertainment giant has alienated millions of customers and picked a fight with Florida GOP leaders.",
    "NEW: Disney CEO Bob Chapek grovels, apologizes, and pledges to \"be a better ally for the LGBTQ+ community.\"",
    "Shares of Disney have plummeted 23.5 percent since the start of March, falling from $145.70.",
    "Market cap is down $62.6 billion, from $265.3 to $202.7 billion.",
    "Follow David Ng on Twitter @HeyItsDavidNg.",
    "Ron DeSantis (R) signed it into law.",
    "Contact me at dng@breitbart.com",
    "Have a tip?"
  ]
}