{
  "id": 4162,
  "mediaId": 19,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Ron DeSantis: SCOTUS Leak Is Judicial Insurrection",
  "image": "https://media.breitbart.com/media/2022/04/Florida-Gov-Ron-DeSantis-Feb-1-2022-ap-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/03/ron-desantis-scotus-leak-is-judicial-insurrection/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    661
  ],
  "sentences": [
    "The leak, he continued, was really unprecedented,? deeming it an attack on a lot of the justices.?\nI think it was an intentional thing to try to whip up a lot of the public to try to make it very political, potentially try to bully them into changing one of their positions and that is not something thats appropriate for the judicial branch,? DeSantis said, expressing hope that they will launch an investigation into the matter and hold the individual who leaked the draft accountable.",
    "We are also anticipating that when our protections go into effect July 1st, that will be subject to a state constitutional and statutory challenge and there is case law thats out there that that we would have to overcome to be able to sustain those protections,? he said of his steps his administration has taken to protect life in Florida.",
    "I think you look at what some of the other states are doing going in a much different direction where they will have one day before a baby is born, allow it to be snuffed out nine months in,? the governor said, expressing disgust.",
    "The governor later added that he adamantly believes in pro-life protections, noting that it is something that is certainly based in science.?\nI think its something that is based on kind of who we are as a society.",
    "You know, thats a judicial insurrection to be taking that out and trying to kneecap a potential majority through kind of extra constitutional means,? he said, adding that he was surprised? to see that happen.",
    "Im just thinking to myself, how is that something that would ever be viewed to be appropriate?? he asked, predicting Americans will get a definitive answer on the future of Roe in June.",
    "Roberts said that was not the final, so who knows whats going on behind the scenes?? DeSantis, a Harvard Law School graduate and former attorney for the U.S. Navy, told reporters.",
    "The leak of the draft Supreme Court opinion overturning Roe v. Wade is a case of judicial insurrection,? Florida Gov.",
    "I dont know if that opinion is going to be the actual opinion.",
    "You want to talk about an insurrection?",
    "Ron DeSantis (R) said on Tuesday.",
    "I think we can do it.?\nWATCH:"
  ]
}