{
  "id": 4163,
  "mediaId": 25,
  "date": "d2022-05-03T00:00",
  "headline": "Leaked draft opinion suggests Supreme Court may overturn Roe v. Wade",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/05/03/33cdd7f0-28ad-4ca6-80a8-03cf5ae82b57/thumbnail/620x413/9f9765bfe72cdf45dd0899ae2e7913e5/ap22123112248337.jpg",
  "link": "https://www.cbsnews.com/news/roe-v-wade-supreme-court-overturn-politico-draft-opinion/",
  "sentiment": "0.0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Melissa Quinn",
  "authorUrl": "",
  "termIds": [
    661,
    827,
    1070,
    1300,
    1889,
    2058,
    2367,
    403,
    482,
    2959
  ],
  "sentences": [
    "It did not say which other justices joined in the opinion, but Politico noted that a person familiar with the court's deliberations said four other conservative justices, Clarence Thomas, Neil Gorsuch, Brett Kavanaugh and Amy Coney Barrett, voted with Alito to strike down Roe during closed-door discussions after oral arguments and have not changed their positions.",
    "Washington  The Supreme Court appears ready to overturn its landmark decisions establishing the right to an abortion, according to a draft opinion obtained and published by Politico, a decision that  if finalized  would dismantle 50 years of precedent and pave the way for states to severely curtail abortion rights in the United States.",
    "The appointment of three conservative justices by former President Donald Trump  Gorsuch, Kavanaugh and Barrett  widened the court's conservative majority to 6-3, and Mississippi officials then called for the Supreme Court to use their legal battle as the vehicle to overturn Roe and Casey.",
    "It was less clear, though, whether five justices would vote to overturn Roe and Planned Parenthood v. Casey, the 1992 case that reaffirmed Roe's core holding that states cannot outlaw abortion before fetal viability, generally considered to be between 22 and 24 weeks into a pregnancy.",
    "Sen. Tom Cotton of Arkansas tweeted that the Supreme Court and Justice Department should use \"every investigative tool necessary\" to get to the bottom of the leak, but added that he prays \"the court follows the Constitution and allows the state to once again protect unborn life.\"",
    "\"If the report is accurate, the Supreme Court is poised to inflict the greatest restriction of rights in the past fifty years  not just on women but on all Americans,\" House Speaker Nancy Pelosi and Senate Majority Leader Chuck Schumer said in a blistering joint statement.",
    "\"The next time you hear the far left preaching about how they are fighting to preserve our Republic's institutions & norms remember how they leaked a Supreme Court opinion in an attempt to intimidate the justices on abortion,\" Sen. Marco Rubio of Florida tweeted.",
    "The Supreme Court's opinion in the case, known as Dobbs v. Jackson Women's Health Organization  involving a Mississippi law banning abortions after 15 weeks  is expected to be handed down before the justices conclude their term by the end of June or early July.",
    "A crowd of people gather outside the Supreme Court on Monday night, May 2, 2022, after Politico published a draft opinion suggesting a majority of justices intended to overturn the landmark 1973 ruling in Roe v. Wade that legalized abortion nationwide.",
    "The Battle Over Abortion\n More\n Leaked draft opinion suggests Supreme Court may overturn Roe v. Wade\n Oklahoma House passes Texas-style abortion ban, sending bill to governor\n Doctors face challenges to provide abortion access\n Florida Gov.",
    "Leaked Supreme Court Roe draft opinion sets stage for 2022 midterms\nThe leak of a draft opinion from the Supreme Court is breathtaking and unprecedented in modern times, and has already sent shockwaves through Washington and the nation.",
    "Late Monday, hundreds of protesters gathered outside the court after Politico published the report suggesting the conservative majority is preparing to fully overturn Roe v. Wade, the 1973 decision establishing the right to an abortion.",
    "If the Supreme Court overrules Roe and Casey, as the reported draft opinion suggests, it would mark a long-awaited victory for anti-abortion advocates who for decades have called on the high court to reconsider its abortion precedents.",
    "The justices heard oral arguments in the blockbuster dispute involving the Mississippi law in December, and at the end of the session, a majority of the court appeared poised to allow the state's measure to stand.",
    "According to the November poll, if Roe is overturned and the matter is left up to the states, a majority would want abortion in their own state to be legal in all or most cases: more than six in 10 say so.",
    "Politico said it received a copy of the draft opinion \"from a person familiar with the court's proceedings in the Mississippi case along with other details supporting the authenticity of the document.\"",
    "The Guttmacher Institute, an organization that supports abortion rights, estimated that 26 states are either certain or likely to ban abortion if the Supreme Court overturns or dismantles Roe.",
    "The document denotes the decision is a \"1st Draft,\" and Alito's opinion runs 67 pages and is accompanied by a 31-page appendix containing various state statutes criminalizing abortion.",
    "Ron DeSantis signs 15-week abortion ban bill into law\n Kentucky lawmakers override governor's veto of abortion ban\n More\nIn:\nSupreme Court of the United States\nRoe v. Wade\nAbortion",
    "\"The Republican-appointed justices' reported votes to overturn Roe v. Wade would go down as an abomination, one of the worst and most damaging decisions in modern history.\"",
    "But according to the draft opinion leaked to and published by Politico, Alito wrote that Roe was \"egregiously wrong from the start\" and its reasoning \"exceptionally weak.\"",
    "Some already have laws in place that would do so if Roe was struck down, and governors in Oklahoma and Florida each signed new abortion restrictions into law last month.",
    "Several Republicans, meanwhile, issued statements Monday night praising the draft opinion but criticizing the leak as damaging to the Supreme Court as an institution.",
    "Democrats and Republicans alike issued statements reacting to the reported draft and the implications it would have if such a ruling was ultimately handed down.",
    "Such a ruling, they said, would strip millions of women of their \"bodily autonomy and the constitutional rights they've relied on for half a century.\"",
    "\"It is time to heed the Constitution and return the issue of abortion to the people's elected representatives,\" Alito wrote, according to Politico.",
    "In a statement Monday night, Patricia McCabe, the Supreme Court's public information officer, said the court has no comment on the report.",
    "A full-scale investigation involving the FBI is expected into the leak of the draft opinion to determine who was the source.",
    "Alito, appointed to the Supreme Court by President George W. Bush, concluded: \"Abortion presents a profound moral question.",
    "Anna Johnson / AP\nThe justices could change their votes in the days or weeks leading up to the decision's release.",
    "Pelosi and Schumer accused the conservative justices of having \"lied to the U.S. Senate\" and \"ripped up the U.S.",
    "The draft published by Politico indicates it was written by Justice Samuel Alito and circulated on February 10.",
    "It's unclear whether Chief Justice John Roberts will join the conservative majority, according to Politico.",
    "We now overrule those decisions and return that authority to the people and their elected representatives.\"",
    "The Constitution does not prohibit the citizens of each state from regulating or prohibiting abortion.",
    "A CBS News poll from November indicated that a majority of Americans supported leaving Roe in place.",
    "The draft opinion, as reported by Politico, prompted outrage from congressional Democrats.",
    "Planned Parenthood tweeted, \"Let's be clear: This is a draft opinion.",
    "Only 14% would want their state to make it illegal in all cases.",
    "It's outrageous, it's unprecedented, but it is not final.",
    "Abortion is your right  and it is STILL LEGAL.\"",
    "Roe and Case arrogated that authority.",
    "Jan Crawford contributed reporting.",
    "Constitution.\""
  ]
}