{
  "id": 4173,
  "mediaId": 188,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Gov. Ron DeSantis says he would support law banning gender transition surgeries on children",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTc1Mzc2OS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY5MDYwOTM3OH0.1iugJ1-VtM3b1KxG65s3IcX4mK-u0WG8oPWF_yMW8WU/img.jpg?width=1245&quality=85&coordinates=0%2C0%2C0%2C248&height=700",
  "link": "https://www.theblaze.com/news/ron-desantis-gender-transition",
  "sentiment": "0.0",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Taylor",
  "authorUrl": "https://www.theblaze.com/u/sarahtaylor",
  "termIds": [
    661
  ],
  "sentences": [
    "Further, \"encouraging mastectomy, ovariectomy, uterine extirpation, penile disablement, tracheal shave, the prescription of hormones which are out of line with the genetic make-up of the child, or puberty blockers, are all clinical practices which run an unacceptably high risk of doing harm.\"",
    "The Florida Department of Health has issued guidelines for treating gender dysmorphia, recommending against gender transition, puberty blockers, and hormones, but would you support a state law banning any of those medical interventions for children?? Boothe asked at one point of the podcast.",
    "\"You're doing things that are permanently altering them, and then they're not gonna be able to reverse that, and so I don't think it's appropriate for kids at all, I think the guidance is right, but I think that there should be additional protections,\" he continued.",
    "\"Because, you know, when you're growing up, there are things that, you know, it's an awkward time, and it seems like there's a concerted effort in society to push these kids in to do some type of medical intervention, and in our judgment, that's not healthy.\"",
    "DeSantis responded in the affirmative and said that \"gender-affirming care,\" such as transitional surgeries, would be on the same footing as allowing a 12-year-old to get a tattoo  which is not permitted in the state.",
    "One review concludes that 'hormonal treatments for transgender adolescents can achieve their intended physical effects, but evidence regarding their psychosocial and cognitive impact is generally lacking.'\"",
    "When they say gender-affirming care, what they mean, a lot of times, is you are really, youre castrating a young boy, youre sterilizing a young girl, youre doing mastectomies for these very young girls.\"",
    "A portion of the report read, \"Systematic reviews on hormonal treatment for young people show a trend of low-quality evidence, small sample sizes, and medium to high risk of bias.",
    "A paper published in the International Review of Psychiatry states that 80% of those seeking clinical care will lose their desire to identify with the non- birth sex.",
    "During a recent interview on the political commentator's \"Truth with Lisa Boothe,\" DeSantis said that he would support a ban on such surgeries for minors.",
    "Ron DeSantis (R) told podcaster Lisa Boothe that he would absolutely support legislation preventing children from undergoing gender transition surgery.",
    "In April, the Florida Department of Health issued a press release on gender dysmorphia, which spoke out against transgender treatments for children.",
    "DeSantis during the interview also added that 80% of gender dysmorphia cases \"resolve themselves\" as children grow.",
    "\"Social gender transition should not be a treatment option for children or adolescents,\" the guidelines stated.",
    "The department, instead, recommends that families seek out supportive services through counseling.",
    "Gender reassignment surgery should not be a treatment option for children or adolescents.\"",
    "I would ban the  yeah, I would ban the sex change, the operations,? DeSantis said.",
    "\"Anyone under 18 should not be prescribed puberty blockers or hormone therapy.",
    "I think that its something that  you cant get a tattoo if youre 12 years old.",
    "What are the details?",
    "Florida Gov."
  ]
}