{
  "id": 4174,
  "mediaId": 43,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Reproductive rights protests erupt nationwide in wake of leaked SCOTUS opinion",
  "image": "https://images.dailykos.com/images/1065570/story_image/GettyImages-1395201951.jpeg?1651605856",
  "link": "https://www.dailykos.com/story/2022/5/3/2095585/-Reproductive-rights-protests-erupt-nationwide-in-wake-of-leaked-SCOTUS-opinion",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2058,
    3813,
    4389,
    400,
    482,
    2590,
    2826
  ],
  "sentences": [
    "pic.twitter.com/xmidqW1QBo\n Lydia Fielder (@4029Lydia) May 3, 2022\nx\n#HAPPENINGNOW: A crowd has started to form in downtown #ElPaso to protest the Supreme Court draft opinion  that could possibly overturn #RoeVsWade\nSome signs say Bans off our bodies? and Keep abortion legal and safe.?\nLive updates coming up on @KFOX14 and @CBS4Local pic.twitter.com/pAA5pRSS5j\n Lianna Golden (@LiannaKFOX_CBS) May 3, 2022\nx\nAbout 20 people here in front of the federal building in downtown Bozeman to protest the Roe v Wade news pic.twitter.com/n4xTIU9Xzm\n Nora Shelly (@noracshelly) May 3, 2022\nx\nThe protest have taken Marietta Street with hundreds of abortion rights activists.",
    "Details: https://t.co/PWuB9dPJF9 pic.twitter.com/Z85amY8ALc\n KESQ News Channel 3 (@KESQ) May 4, 2022\nx\nColorado Attorney General @pweiser speaks at a protest for abortion rights at the state capitol pic.twitter.com/YINa4Gzhar\n lindsey g (@lindseytoom) May 4, 2022\nx\nAfter news of the #SCOTUS majority draft opinion, Pro-choice Southern Arizonans protest at the federal courthouse downtown.#RoeVsWade @KVOA pic.twitter.com/q1vRkRrf15\n Eric Fink (@EricMillerFink) May 4, 2022\nIts the Western U.S.s chance to show out now that its hitting 5 p.m. PT.",
    "x\nDozens of protestors have started to rally at Chico City Plaza #prochoice #protest pic.twitter.com/tJOTG4iUDL\n Melvin Bui (@MELVINBUII) May 4, 2022\nx\ngPeople have begun to arrive at the Federal Building to protest against the Supreme Courts decision to overturn #RoeVWade and end the federal right to #abortion pic.twitter.com/6nyjyWSY0t\n SF Examiner (@sfexaminer) May 4, 2022\nx\nHAPPENING NOW: About 40 pro-choice activists have gathered outside Palm Springs City Hall to protest the Roe v Wade leak.",
    "#idpol #idaho #RoeVsWade pic.twitter.com/Os7ArWxkB7\n Seattle to Shanghai (@mgeor11) May 3, 2022\nx\nNew Haven, CT: @ULAnewhaven #BansOffOurBodies #NHV #CT #RoeVsWade #WomensRights #AbortionRightsAreHumanRights #abortionrights #SCOTUS #scotusleak #Women pic.twitter.com/l9mpwOig0J\n Eino Sierpe (@Eino_Sierpe) May 3, 2022\nSeeing marches and protests in North Carolina and Massachusetts  all in support of reproductive rights.",
    "Great speech by @micheleforfl #prochoice #WomensRights #DeSantisDestroysFlorida #floridademocrats @richiejfloyd @CharlieCrist pic.twitter.com/heHrdPclhS\n Lizzy (@Lizzy3483x) May 3, 2022\nx\nGroup at second protest chanting racist, sexist, anti-gay, Ron DeSantis go away.? pic.twitter.com/bUtWHWx6TR\n Rochelle Alleyne (@RochelleAlleyne) May 3, 2022\nMy state is showing out, yall!",
    "#RoeVWade #ProtectAbortionRights #MEPolitics pic.twitter.com/AaVvjYS887\n Planned Parenthood (@PPMEAF) May 3, 2022\nDemonstrations are taking shape in the nations capital, with Politicos Nicholas Wu noting the presence of dump trucks meant to block 1st St. and the SCOTUS protests.? Additional on-the-ground footage shows the steps to the Supreme Court completely blocked off.",
    "x\nSpeaking now in #LiberateAbortion yellow: @FGossGraves pic.twitter.com/nO7NZjYAM5\n Renee Bracey Sherman (@RBraceySherman) May 3, 2022\nx\nNext up: @mayawiley #LiberateAbortion pic.twitter.com/xz6yIS19we\n Renee Bracey Sherman (@RBraceySherman) May 3, 2022\nNew Yorkers are out in full force to protest Alitos draft opinion and advocate for reproductive rights.",
    "!?\nBoston March.#TransRightsAreHumanRights #RoeOverturned #RoeVsWade #bospoli pic.twitter.com/zYjz25WgPy\n Rod Webber (@RodWebber) May 3, 2022\nAs the day turns to night, more protesters are taking to the streets across the country, with demonstrations also in Montana, Texas, and Arkansas as well as additional demonstrations in Texas and Georgia.",
    "Tomorrow, at 5pm your local time, were rallying across America for abortion rights: https://t.co/sqXWyOs9He https://t.co/TlZTQJR0Rn\n Women's March (@womensmarch) May 3, 2022\nIll be following the protests as they unfold throughout the evening so please comment if youre attending any actions in your community.",
    "#HandsOffOurBodies https://t.co/LD7jCVHNfP pic.twitter.com/Y2Fihhb5lr\n Crysta K. Coburn gg (@crystakcoburn) May 3, 2022\nx\nReacting to the leaked Supreme Court documents, a crowd is forming in Downtown Bryan as people across the country head to their local courthouse to protest abortion restrictions.",
    "This is following the leaked #SCOTUS draft re: Roe v Wade pic.twitter.com/FPWC21tvcI\n Amanda Roberts (@ARobertsNews) May 3, 2022\nMore and more scenes from protests are popping up on social media, with demonstrators gathering in Georgia, Nebraska, Missouri, Michigan, Pennsylvania, and Texas.",
    "x\nDump trucks are being moved into place to block 1st St and the SCOTUS protests - these are usually placed around protests to prevent people from driving in pic.twitter.com/EHS69Usihe\n Nicholas Wu (@nicholaswu12) May 3, 2022\nx\nHeres a look outside of the Supreme Court right now.",
    "pic.twitter.com/EjIKQ1Nnge\n Ariel gggggg (@saxocrat) May 3, 2022\nSigns from protests around in the country in states like Connecticut, Missouri, and Idaho show just how intersectional reproductive rights are and why fighting for abortion access is critical.",
    "Though the state of Washington has relatively progressive laws protecting the right to choose, many who live there have had to travel more than 25 miles for abortion access  a particularly barrier for more vulnerable communities.",
    "Protests began Monday night in the wake of Politico publishing a leaked Supreme Court draft opinion from Justice Samuel Alito that would essentially overturn Roe v. Wade and bodes terribly for reproductive rights.",
    "#BansOffOurBodies pic.twitter.com/fvtP0WQnWE\n Marisa Kabas (@MarisaKabas) May 3, 2022\nSo far, the amount of pro-choice demonstrators have far exceeded the amount of counter-protesters near the Supreme Court.",
    "Smalls tweet shows how intrinsically linked reproductive rights are to labor rights, as workers have been battling for decades for equality in health care and access to necessary services like abortions.",
    "Reproductive rights are especially essential for communities in Louisiana, which is one of 13 states that have trigger laws on the books that would automatically ban abortions were Roe to be reversed.",
    "Protesters in Kansas City are gathered outside the Jackson County courthouse while the Fifth Circuit Court of Appeals in New Orleans is seeing a growing crowd form in support of reproductive rights.",
    "@WAFB pic.twitter.com/TBJBFoq6h3\n Kellie Sanchez (@kelliesanchezTV) May 3, 2022\nHundreds took to Kerry Park in Seattle to protest Alitos draft opinion and the potential elimination of Roe v. Wade.",
    "#11alive pic.twitter.com/w3jZHpCCCP\n Hope Ford (@hope_iam) May 3, 2022\nx\nMore than 100 people gathered outside Omaha City Hall on Tuesday evening to protest a possible overturning of #RoeVWade.",
    "Ron DeSantis, who is not only aggressively anti-abortion but has made a concerted effort to enact laws that target reproductive health care access for pregnant people and the LGBTQ community.",
    "pic.twitter.com/nkQEDyEJD4\n diane lewis (@dianelewis48) May 3, 2022\nWe Testify provided space outside the Supreme Court for those whove had an abortion to share their stories.",
    "Full coverage: https://t.co/JQ2BAyvjou pic.twitter.com/3wExZBk6aE\n KCTV5 News (@KCTV5) May 3, 2022\nx\nA growing rally now on the steps of the Fifth Circuit Court of Appeals.",
    "With Alitos lengthy opinion threatening a host of rights, including marriage equality, people have taken to the streets to fight against such a damaging potential ruling.",
    "Multiple demonstrations will take place in New York, with Amazon Labor Union organizer Christian Smalls among countless others tweeting times and locations for events.",
    "x\nHere at the West front of the Supreme Court, pro-choice and anti-abortion activists are gathered, with Capitol Police enforcing a wide no-mans-land in between.",
    "pic.twitter.com/iIbWHK67bY\n Jordan Williams (@jordanKTVZ) May 3, 2022\nx\nCrowds gathering downtown to protest Supreme Courts expected overturning of Roe v Wade.",
    "pic.twitter.com/3tm4ChWeIX\n Michelle Harven (@MichelleHarven) May 3, 2022\nx\nLarge protest at Centennial Olympic Park in Atlanta in support of abortion rights.",
    "In Michigan, where abortion restrictions preceding Roe were never eliminated, Planned Parenthood is asking folks to take to the state capitol Tuesday evening.",
    "@CapitolPolice have the entire front steps from @USSupremeCourt to across the street completely blocked-off as protesters & spectators gather on the sides.",
    "Organizers with the Womens March have urged people across the country to demonstrate in front of courthouses, federal buildings, town halls, and squares.",
    "x\nI estimate about 450-500 people showed up at Kerry Park on Queen Anne to protest anti abortion legislation that could potentially reverse Roe vs Wade.",
    "pic.twitter.com/0JTwguoj00\n News Radio KKOB (@KKOBradio) May 3, 2022\nx\nWe are out here in San Diego to protest and fight for womens right to choose!!!",
    "x\nPeople have gathered outside of the Jackson County Courthouse to protest the possible overturning of the landmark abortion rights case Roe v. Wade.",
    "pic.twitter.com/wELVAmY3le\n Jozsef Papp (@JozsefPapp_) May 3, 2022\nThrilled to see folks gathering in our cities, especially outside courthouses.",
    "#ncpol pic.twitter.com/qYpWfW7h6l\n Avi Bajpai (@avibajpai_) May 3, 2022\nx\nWhen Trans-Rights are under attack, what do we do, stand up fight back!",
    "pic.twitter.com/cTUjmeIDaP\n Ford Fischer (@FordFischer) May 3, 2022\nA crowd has gathered in Portland, Maine in front of the U.S. District court.",
    "The organization has done powerful work to center reproductive health care in its fight for equality while also supporting the LGBTQ community.",
    "Louisiana also faces some of the most severe weather threats due to climate change, which further threatens access to reproductive health care.",
    "READ MORE: https://t.co/2sJLonINuu pic.twitter.com/Injyv8e7Lb\n KBTX News (@KBTXNews) May 3, 2022\nx\nThe protest has now turned into a March.",
    "@KRCG13 pic.twitter.com/H4sHgMcWuP\n Jessica Hart KRCG (@JessicaHartTV) May 3, 2022\nDemonstrators in Florida are rightfully targeting Gov.",
    "If you are too, then now is the time to show up and show them our movement won't back down from protecting our reproductive rights.",
    "#RoeVsWade #StLouis pic.twitter.com/fmpVv7WP1J\n Cynthia Changyit Levin (she/her) (@ccylevin) May 3, 2022\nx\n#BansOffOurBodies Vote.",
    "Protests began Monday night following the leak of Supreme Court Justice Samuel Alito's draft opinion, with more planned Tuesday.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "And groups like the Party for Socialism and Liberation also have protests planned around the country on Tuesday and Wednesday.",
    "x\nHundreds of people have gathered in downtown Raleigh to protest the Supreme Courts expected ruling overturning Roe v. Wade.",
    "@fox5dc pic.twitter.com/WtBsHjfX02\n Stephanie Ramirez (@RamirezReports) May 3, 2022\nx\nWere horrified, saddened, and livid.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Planned Parenthood shared a tweet of the scene:\nx\nSpeakers in Portland are ready to rally for abortion rights & justice!",
    "More: https://t.co/16Hc0rWYDe pic.twitter.com/VswncEukrJ\n 6 News WOWT (@WOWT6News) May 3, 2022\nx\nI love a good protest.",
    "x\nRight now people against the potential overturn of Roe v. Wade are rallying in front of the Louisiana State Capitol.",
    "Nebraska lawmakers could be called for a special session on a \"trigger law,\" which failed by two votes last month.",
    "Protestors assembled at the intersection of Hargett and Wilmington streets and are now marching to Moore Square.",
    "It only makes sense that their calls for reproductive justice would include taking to the streets on Tuesday.",
    "Multiple demonstrations are taking place across New York City, including at Barclays Center and Foley Square.",
    "Protests may be winding down in places like Philly but even more of the West is getting ready to demonstrate.",
    "Colorado, Arizona, and more cities in California are rallying against Justice Alitos abhorrent draft opinion.",
    "Demonstrations in front of the Supreme Court saw hundreds of people coming together in a show of solidarity.",
    "Countless unions have voiced their support of preserving Roe, as have activists in other organizing spaces.",
    "x\n#HAPPENINGNOW: a protest at the Washington County Courthouse in support of abortion rights in Arkansas.",
    "As I wrote earlier, reproductive justice is an essential component of seeking environmental justice.",
    "Hundreds of pro-choice on North side of 1st St, about a hundred anti-abortion on South.",
    "Protests are occurring in California, Oregon, and New Mexico, among many other states.",
    "were not going to let conservative extremists take away our human right to abortion.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "x\nA small crowd has gathered as part of a nationwide protest for abortion rights.",
    "x\nCurrently huge crowd at Philadelphias city hall to protest for abortion rights.",
    "@samanthaKESQ is at the protest and will have more tonight at 10 p.m. & 11 p.m.",
    "x\n#stpetersburg rally at city hall to protest #scotus attack on womens health.",
    "I have work to do!? She tells us Doesnt matter what our insecurities are.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "And sign the petition urging Congress to codify Roe v. Wade.",
    "Shortly after, protests were planned across the country.",
    "@CoriBush leads the crowd in saying I have a place!",
    "x\nnew yorkers are out here and were PISSED.",
    "Theyre walking through downtown Columbia.",
    "This is a short blurb about Daily Kos.",
    "Bring something to the table.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Pressure moves legislators.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it.",
    "We need you.",
    "It matters.",
    "x\n."
  ]
}