{
  "id": 4192,
  "mediaId": 120,
  "date": "d2022-05-02T19:49",
  "headline": "The GOPs political stunts come at a high cost for Americans",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-1120w,f_auto,q_auto:best/rockcms/2022-05/38-ROB-GOP-Political-Stunts-jg-a7be39.jpg",
  "link": "https://www.msnbc.com/the-reidout/reidout-blog/desantis-taxpayers-republicans-abbott-rcna26897",
  "sentiment": "0.0",
  "mediaOutlet": "MSNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ja'han Jones",
  "authorUrl": "https://www.msnbc.com/author/ja-jones-ncpn371241",
  "termIds": [
    661,
    2087,
    2250,
    4066,
    428,
    524,
    2661,
    2945
  ],
  "sentences": [
    "At the national level, Republicans are goading Democrats into a game of chicken over Covid funding, claiming theyll block passage of any bill funding the pandemic response unless Democrats move to reinstate Title 42, the immigration policy that lets the U.S. turn migrants away on public health grounds.",
    "DeSantis and the sycophantic legislators who backed his attempt at retribution seemed to think rescinding Disneys special district status in Florida  which essentially gives Disney World the ability to operate its own mini-government  will force the company to come to heel.",
    "Taken together, the stunts show Republicans desperation in pitching Americans an image of political disarray and pinning it to the Biden administration, even if it leaves taxpayers footing the bill to the tune of millions  even billions  of dollars.",
    "But in the name of xenophobia, the conservative movement figures are willing to hold $10 billion of The Peoples money hostage rather than release it to help us avoid the pandemics worst effects.",
    "And as my colleague Steve Benen wrote for the MaddowBlog, the policy resulted in Texas losing $477 million per day, and the U.S. losing nearly $9 billion total due to the delays.",
    "Abbott announced an additional-yet-unnecessary layer of inspection for each truck  on top of the usual inspections conducted by U.S. Customs and Border Protection.",
    "Ron DeSantis and Republican state lawmakers are trying to punish Disney for opposing their anti-LGBTQ education bill, known by critics as the Dont Say Gay? bill.",
    "But financial experts have said the counties that would absorb Disney World will likely assume the tax burden Disney previously managed as a special district.",
    "In a frantic response to the backlash, DeSantis vowed Disney will ultimately pay, although hes publicly offered literally no details on how that would happen.",
    "With November's midterm election approaching, conservative officials at both the state and national level are engaging in a variety of political stunts.",
    "And Republicans arent completely sold on his migrant busing stunt either (which probably explains why hes begging private donors to fund it now).",
    "As I wrote last month, Republicans and some conservative Democrats want the policy upheld strictly to scapegoat migrants for political points.",
    "The self-proclaimed pro-business, pro-capitalist party sure is finding a lot of ways to harm individuals and industries with its policies.",
    "At least one bus reportedly dropped off its passengers in front of the building that houses officers for Fox News, NBC News and C-SPAN.",
    "Abbott has also used taxpayer funds to bus migrants from the border to Washington, D.C.  a cruel publicity stunt.",
    "Surely, you remember Abbotts deliberate delay of commercial trucks entering the U.S. from Mexico last month, no?",
    "It was one of his attempts at fearmongering about alleged threats coming through the U.S.-Mexico border.",
    "The U.S. Centers for Disease Control and Prevention says the policy is no longer necessary.",
    "These kinds of taxpayer-subsidized stunts have become routine among Republicans.",
    "And it can be argued they arent helpful to Abbott personally either.",
    "Both Democrats and Republicans have criticized Abbotts truck delays.",
    "These nonsensical acts clearly aren't solving any border issues.",
    "Were seeing this in Florida, where right-wing Gov.",
    "Greg Abbotts political stunts isn't any better.",
    "In Texas, the verdict on Gov.",
    "Ironic, isn't it?",
    "Related",
    "Oops!"
  ]
}