{
  "id": 4208,
  "mediaId": 943,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Letters: The Obama Presidential Center will be a boon to Jackson Park area",
  "image": "https://www.chicagotribune.com/resizer/HaXp_5XpkZcAL65NwmFtRn1IaTk=/1440x0/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/PLQFXMP6A5FKHMPSWXURH2273I",
  "link": "https://www.chicagotribune.com/opinion/letters/ct-letters-vp-050322-20220502-75rdp4ylpvbx7drzniu2vfjxti-story.html",
  "mediaOutlet": "Chicago Tribune",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2429,
    3789,
    4241,
    4422,
    4647,
    3146,
    2945
  ],
  "sentences": [
    "Building the Obama center will enhance the South Side neighborhood by creating a beautiful destination complex of a library and community center, connecting 19.3 acres  less than 10% of Jackson Park  to the larger section of Jackson Park.",
    "Maybe I could suggest a few ideas to minimize the impact of this practice:\nMake the well-paid pseudo-judges sign an affidavit that during their education, they never were truant, got in a fight of any kind, smoked or drank near a school.",
    "For 10 years, I have regularly driven past the site of the future Obama Presidential Center, and I have seldom seen anyone using this thin island of parkland encircled by busy streets near the Museum of Science and Industry.",
    "My grandparents felt the need to comment on how odd of a choice that was; to quote them, The environment can sustain itself.?\nI began to discuss with them the extent of the human degradation of the Earth and the climate.",
    "Chapman says the Florida legislature cannot strip Disney of this tax-favored status as an act of political retribution.? I dont see anywhere in the Constitution a right for a company to have a special tax break forever.",
    "Vallas betrayed our trust as an officer with Chicago Public Schools by promoting privatization, a scheme for taking money from the schools and school employees and handing it over to private companies.",
    "In an April 28 letter (Olmsteds Chicago parks?), Brenda Nelms and Jack Spicer of Jackson Park Watch write that the Obama Presidential Center is destroying the Frederick Law Olmsted-designed South Park.",
    " Kenneth Nelson, regional director, Insurope Services, Chicago\nSpreading word on climate fixes\nWith Easter recently passing, I had one of the largest family gatherings since the start of the pandemic.",
    "Most recently, we discussed carbon dividends and taxes and how they would not only decrease the level of emissions but also return the money to Americans, improving both the economy and the planet.",
    "Angelique Adams, one of the parents highlighted by the story, gave the best summation of what is happening: Yall is crazy.?\n Brad Johnson, Crete\nHow is Disney bill unfair?",
    "The amazing birds that travel thousands of miles each year are not only beautiful, but they also dine on the bugs that bite us and eat our garden plants and farm crops.",
    "Without my explanation of what a dividend was, my grandma would have assumed it was more government talk? and would have thought it was of no benefit to her or others.",
    "Between the global rise in temperature, the increase in extreme weather events and the evident sea level rise, they were beginning to come to terms with reality.",
    "They asked me about the goings-on in my life since the pandemic occurred, from new jobs and new friends to my newly added major: environmental sustainability.",
    "Perhaps former House Speaker Michael Madigan can contribute a few pennies from the millions of dollars his campaign fund has contributed to his legal fees.",
    "Most importantly, they need to be more digestible for individuals who may not seek out the information themselves, and the solutions need to be the same.",
    "Lets move forward together in the spirit of being good neighbors and face the roots of problems that have handicapped America and Chicago for so long.",
    "Usually by May 1, Ive seen dozens of white-throated, fox and white-crowned sparrows, a few thrashers, some yellow-rumped warblers  but not this year.",
    " William Murray, Hinsdale\nStory on penalizing students\nI was dismayed to read the front-page article in Sundays Tribune (The price kids pay?).",
    "Climate change issues should no longer be considered taboo political topics to bring up at dinner: They need to be discussed everywhere.",
    "Our members of Congress need to begin providing climate solutions in a more public and understandable way to the general population.",
    " Muriel Balla, Chicago\nHelping migratory birds\nI have been very troubled by the lack of migratory birds this year in my back garden.",
    "Ron DeSantis bill stripping Disney of tax and other advantages in Florida, I cant see how it tramples? on the companys free speech.",
    "Allow the possibility of trial by a small jury of their peers to sidestep the kangaroo court nature of all of these proceedings.",
    "Not only is there avian flu for them to deal with, but there also are glass skyscrapers and outdoor cats, all potentially fatal.",
    " Nancy Burhop, North Shore Bird Club, Evanston\nRepresentatives dont own seats\nRegarding this sentence in a May 2 article, U.S.",
    " Jerry Egler, Libertyville\nSubmit a letter, of no more than 400 words, to the editor here or email letters@chicagotribune.com.",
    "In Fridays Tribune (The mayor tries to reinvent herself as a reformer?), he pretended to be an advocate for good government.",
    "I cannot see how this enforcement practice will reinforce respect for the law in the young people who are being affected.",
    "Disney got to register its dissatisfaction with the Florida bill, and it wasnt stripped of its corporate status.",
    "Rep. Bobby Rush is stepping down from his 1st Congressional District seat at the end of his term?: No, hes not.",
    "After I returned to school, my grandma continued to text me about what she could do to save the planet too.",
    "Surely Olmsted is smiling down from heaven on the Obama center gem that is being created in Jackson Park.",
    "I think it can create only loathing, cynicism and financial pain for parents who often cannot afford it.",
    " Kate Gehrke, Elmhurst\nVallas betrayed citys trust\nSeeing Paul Vallas name in print raises my hackles.",
    "Please turn out the lights at night in downtown buildings and close drapes or blinds if you have them.",
    "Reading Steve Chapmans column (DeSantis tramples on Disneys freedom of speech,? April 28) on how Gov.",
    "DeSantis just signed a bill to dissolve a tax break that almost no citizen in the United States has.",
    "Having a student miss a day of class to attend a hearing because of truancy seems a bit ridiculous.",
    "Vallas parlayed his Chicago expertise? into an opportunity to loot New Orleans public schools.",
    "In reality, hes a mouthpiece for the Fraternal Order of Police and other anti-reform groups.",
    "Keep your outdoor cats inside at night  and during the day if you can, until the end of May.",
    "By the end of the conversation, my grandparents encouraged me to pursue this new major.",
    "She said it sounded like a great plan and wondered why she hadnt heard about it before.",
    "He has had personal experiences with the increase in hurricanes as well as flooding.",
    "My uncle, who lives in Florida, overheard the conversation and chose to chime in.",
    "May is the primary migration month for birds returning north to breed.",
    "(Birds cant comprehend glass; they see reflections of sky and trees.)",
    "Start a state legal defense fund to help these students and parents.",
    "We will really regret it if we lose our beautiful bug-eating birds.",
    "Kudos to the Tribune for its focus on this far-reaching travesty.",
    "Lately, hes promoting himself as an expert on law enforcement.",
    "Disney will be on a level playing field with other companies.",
    "Many family members attended whom I had not seen in a while.",
    "Perhaps we should stop allowing politicians to own seats?",
    "We have heard enough mourning for birds and trees!",
    "He closed schools and opened several charters.",
    "It belongs to the residents of that district.",
    "Have hearings on weekends or evenings only.",
    "Why doesnt my company get the same break?",
    "Please stop offering him a spotlight.",
    "It never was his seat.",
    "This is hogwash.",
    "Isnt that fair?",
    "We need them."
  ]
}