{
  "id": 4213,
  "mediaId": 558,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Florida governor pours cold water on the idea of Twitter relocating to state",
  "image": "https://s.yimg.com/uu/api/res/1.2/ia5cs5Jmjm_JGKdJ9segzA--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/wjax_cox_videos_978/8e006995ae934d13ac8335d494450de8",
  "link": "https://news.yahoo.com/florida-governor-pours-cold-water-222410292.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Stofan",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "I think theres a new sheriff in town with Elon Musk, and I think theres no better place for him to expand this new leadership and new way of governance than right here in the Sunshine State of Florida,? said Patronis in an April interview.",
    "DeSantis suggested a tech giant moving in could further inflate home prices, and emphasized his administrations focus is on attracting industries that will create more production and vocational jobs.",
    "Ron DeSantis took some of the wind out of the sails of Chief Financial Officer Jimmy Patronis and Jacksonville Mayor Lenny Curry, who have both been urging Elon Musk to relocate Twitter to Florida.",
    "Florida Chief Financial Officer Jimmy Patronis has spent the last month tweeting at Elon Musk, urging the billionaire to move Twitter headquarters to the Sunshine State.",
    "Think if I tweet him, you think hell see my tweet and respond??\nThats exactly what Curry did, tweeting at Musk a handful of times after the interview.",
    "He did say he supports what Musk is doing and that the state stands to benefit from the takeover, even without the company moving to Florida.",
    "That same day, we were the first to ask Mayor Lenny Curry about Jacksonville being a possible nesting spot for Twitters little blue bird.",
    "It even spurred a digital billboard on Interstate 95, displaying the message, ?Hey Elon #RelocateTwitterHQtoJax.?\nGov.",
    "On Monday, the governor said importing a tech company from San Francisco is not high on his administrations agenda.",
    "DeSantis put a damper on the Twitter hype Monday, when we asked if he supported moving the company to Florida.",
    "Okay yeah, they enjoy our lower taxes, but what are they really providing?? said DeSantis.",
    "I think it would be a great landing spot,? said Curry.",
    "We spoke with him last week about the idea.",
    "Gov."
  ]
}