{
  "id": 4214,
  "mediaId": 237,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "DeSantis envisions 'really big' election as end of Florida's days as swing state",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/1c17767/2147483647/strip/true/crop/3000x1575+0+213/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fdd%2F6d%2F080f9f024a888fd4a6aac32c8c74%2Fap22118125476126.jpg",
  "link": "https://www.washingtonexaminer.com/politics/desantis-envisions-really-big-election-as-end-of-floridas-days-as-swing-state",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan King",
  "authorUrl": "https://www.washingtonexaminer.com/author/ryan-king",
  "termIds": [
    661
  ],
  "sentences": [
    "Journalist Lisa Boothe, who interviewed DeSantis, pressed the governor on whether he has his sights set on the White House, but instead of giving a straight answer, DeSantis provided a bigger picture of the future and alluded to the broader implications for political analysts to synthesize: the changing political landscape he has helped marshal in the wake of Trump's rise in the GOP.",
    "The bold prediction for the Sunshine State, where two top contenders for the GOP presidential nomination in 2024 reside  former President Donald Trump and DeSantis himself  comes on the heels of a bonanza of legislative victories and culture war triumphs for Republicans.",
    "People will have paraphernalia about me in the future, people always bring it up to me and stuff, but you know, I have never done anything along those lines, I've basically just done my job,\" DeSantis told Boothe.",
    "Trump, who has credited his endorsement as being what propelled DeSantis to the governor's mansion, is apparently the preferred candidate of President Joe Biden, who has openly relished the idea of a rematch.",
    "He signed legislation in March giving parents increased say over the material used in classrooms that gained national attention, particularly from critics who argue it allowed for book-banning in schools.",
    "\"People just wanna see people that are willing to lead and willing to fight for the people, knowing you're gonna face arrows, knowing you're gonna be able to have to be in the kitchen when it gets hot.\"",
    "\"We put big win after big win on the board, and they will say that I'm dictating the outcomes, when no, I'm going through the constitutional process to be able to enact really significant legislation.",
    "DeSantis is vying for his second term as governor in the 2022 election, but he is widely talked about as a top-tier contender for the 2024 Republican presidential nomination, should he choose to run.",
    "I think that after the election, my goal would be, if we win the election really big, people like you who analyze these things are gonna say, 'The days of Florida being a swing state are over.'",
    "Ron DeSantis (R-FL) believes Florida's days of being a swing state are numbered, and the 2022 midterm elections could clinch it for an increasingly dominant base of conservatives.",
    "The only person on the GOP side who might stand in his way is Trump, though DeSantis appears to be popular enough to best Trump in his own state, as recent polling shows.",
    "Florida has historically fluctuated between the two major parties in presidential contests, rallying behind Barack Obama in 2008 and 2012 and then Trump in 2016 and 2020.",
    "Two weeks ago, DeSantis rallied the GOP-led state legislature and signed a bill that seeks to eliminate the Walt Disney World Resort's de facto self-governance status.",
    "Though flirting with another presidential campaign for himself, Trump has consistently denied, in public at least, there being any feud between himself and DeSantis.",
    "The law, dubbed by critics as the \"Don't Say Gay\" bill, restricts classroom lessons on sexual orientation and gender identity from kindergarten through third grade.",
    "I think if you look at what's going on in the state, we've done more legislatively in Florida than almost all these other red states combined,\" DeSantis boasted.",
    "Some conservative analysts see him as an alternative to Trump, but with more policy bona fides and less of a penchant for making outlandish statements.",
    "Florida is a red state, and I think that's because of a lot of what we've done,? he said on The Truth with Lisa Boothe podcast, released on Monday.",
    "DeSantis contends his campaign against Disney was meant to ensure the entertainment company gets the same treatment \"as any company in Florida.\"",
    "\"It's funny, because there'll be times when we go out there, if we really do some good zingers, I'll walk home and she'll give me a high-five.?",
    "Recently, DeSantis went to bat against Disney over the company's public opposition to the Parental Rights in Education Act he signed into law.",
    "For decades, the Reedy Creek Improvement District has mostly been run by Disney and managed most of its basic governing functions on its own.",
    "The governor also recently signed legislation banning critical race theory in major institutions such as schools, colleges, and corporations.",
    "Like Trump, DeSantis has become very effective in his approach to culture war issues, such as COVID-19, education, and \"woke\" corporations.",
    "The move has been criticized by some in his own party, including former Trump campaign legal adviser Jenna Ellis, as going too far.",
    "Responding to a question about whether she was his most trusted adviser, DeSantis heaped praise on her, touting her judgment.",
    "DeSantis is a former U.S. congressman who has attained political stardom in GOP circles since becoming governor in 2019.",
    "DeSantis has sought to position the state as a haven for individuals and businesses leaving high-tax blue states.",
    "Between 1900 and 2020, the Sunshine State backed the ultimate winner 74.2% of the time, according to Ballotpedia.",
    "As the governor works on hot-button issues, there is at least one person he can lean on: his wife, Casey.",
    "She's got a very good nose for BS, and she's kind of like the middle America type of voter that we need.",
    "A key benchmark happened last year when Republicans surpassed Democrats in voter registration.",
    "She's conservative, of course, but she really sees through a lot of the BS,\" he said.",
    "Casey DeSantis recently announced she was cancer-free.",
    "Recently, the state has shifted to the right.",
    "And that's what you should wanna do.\"",
    "Just In...\nGov."
  ]
}