{
  "id": 4215,
  "mediaId": 65,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "MSNBC's Joy Reid and all Critical Race Theory advocates owe our children an apology",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8e64fc83-bf88-448e-97bc-a1e688b5a203/143b266c-21a0-4936-b815-65422fbe6649/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/opinion/joy-reid-critical-race-theory-students-jack-brewer",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3819,
    4715,
    327,
    3214
  ],
  "sentences": [
    "Functioning as more than a simple curriculum, CRT has resulted in the unfair treatment of underserved kids; brainwashing them to believe things like poor academic achievement and mediocracy is sufficient based on their ethnicity and socioeconomic status.",
    "Being present as Governor DeSantis signed these bills meant the world to our kids, and now they are being forced to think of their governorthe same governor that stood by themas some racist, anti-Black person after Joy Reids vile comments went viral.",
    "Joy Reid talks about the \"misuse of Black boys\" and \"anti-Blackness,\" but doesnt seem to have that same energy when young Black boys are being misused and degraded in the school system based on CRTa theory that has her ringing endorsement.",
    "Furthermore, for her to sit there and accuse both me and the hardworking people who work at the Jack Brewer Foundation of \"child abuse\" for kids who volunteered to be at event with the governor of their state is beyond comprehension.",
    "These schools dont address the deficiencies in math or struggles in readingwhere some of these kids are at a reading level which is three to four grades behindand yet they still are pushed through the school system.",
    "From corporations to classrooms, it's everywhere and yet, those same proponents shout racism when folks like myself have grave concerns over its effects on not just our nation, but our nations future: our children.",
    "Given the reality my kids are facing, you would expect the mission of the Jack Brewer Foundation to not only be uncontroversial but championed by Americans across the political spectrum and throughout the country.",
    "Instead of teaching our nations youth that the color of skin should not determine how they are viewed, CRT asks that we teach our Black kids that they are victims and tell our White kids that they are oppressors.",
    "CLICK HERE TO GET THE OPINION NEWSLETTER\nWe must return to the foundation our nation, the Holy Bible, that teaches us to love God with all our hearts and to \"love thy neighbor as thyself.\"",
    "In fact, in early April, we were first invited by Florida Governor Ron DeSantis to come down for the signing of a bill designed to help address the fatherhood crisis plaguing our nation.",
    "Jack is a former Investment Banker and current Professor at the Fordham Gabelli School of Business where he is the Program Director for the Athletes and Artist Executive MBA program.",
    "Upon seeing the tweet, we immediately secured our kids for their own safety and privacy as calls to locate them grew amongst the media and our attention turned to Joy Reid.",
    "What began in universities has infected every facet of American life and continues to strike at our futureour childrenand if we do not fight back, we will lose our country.",
    "If youre not familiar with Joy Reid, shes a political anchor on MSNBC who took it upon herself to tweet that \"The [misuse] of Black boys is tantamount to child abuse.",
    "CRT is so vile that positive things like support of two-parent households or teaching our kids that their skin color does not determine their future are rejected.",
    "Fundamentally, CRT is harming our nations youth through the promotion of segregation, the degradation of academic aptitude, and the denial of the American Dream.",
    "No child, regardless of race, should receive a D or F on a report card and have a teacher insist that they have made satisfactory progress due to demographics.",
    "A devoted philanthropist who served four years as an Ambassador for Peace and Sport for the U.S. Federation for Peace and Development at the United Nations.",
    "While separate issues, these bills were designed to protect families and ensure our nations children were able to accomplish whatever their dreams may be.",
    "My kidsoften from broken homes without fathersare often told in school that their Fs are \"good\" because of their socioeconomic status and their race.",
    "Two weeks later, Governor DeSantis invited us once again to for the signing of another bill designed to combat CRT in our nations schools.",
    "I have seen first-hand the results of CRT on some of our nations most vulnerable youth at my organization, the Jack Brewer Foundation.",
    "Companies like the GEO Group and even the oil gas industry are suffering because the lefts woke agenda knows no boundaries.",
    "Only then, will we fulfill our countrys pledge of \"one nation, under God, indivisible with liberty and justice for all.\"",
    "However, this is the residuals of critical race theory where your expected aptitude is based solely on your skin color.",
    "For example, woke banks are now closing accounts and refusing to serve entire industries they deem not woke enough.",
    "As the governor signed the bill, he was flanked by my kids who were the ultimate benefactors of such legislation.",
    "Jack Brewer, is a former NFL safety and 3x team captain who played for the Vikings, Giants, Eagles and Cardinals.",
    "I would really like to hear the back-story on who these kids were and how they wound up at a DeSantis event.",
    "There is no extra programming or specialized training to even attempt to address their learning impairments.",
    "I do not want any money from MSNBC nor Joy Reid, but rather closure for my kids given this entire situation.",
    "I will hold Joy Reid accountable, and she can soon expect legal action for putting my kids in danger.",
    "Outside the classroom, we see the same thing in corporations, our nations military, and even banks.",
    "Critical race theory and its proponents have dominated American society for more than four years.",
    "Given how anti-Black DeSantis is, using Black children this way is extra sick.\"",
    "Brewer is an ordained minister who works in prisons across America.",
    "However, sadly widespread support was not the case with Joy Reid.",
    "Brewer is Chairman of AFPIs Center for Opportunity Now.",
    "But ultimately, this is about an apology thats due.",
    "However, I cant say Im surprised by her actions.",
    "The lefts woke ideology must be stopped.",
    "Follow him on Twitter @JackBrewerBSI."
  ]
}