{
  "id": 4218,
  "mediaId": 238,
  "date": "d2022-05-02T14:48",
  "headline": "Opinion A conservative Christian quietly battles against right-wing hysteria",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/05/02/david-french-cuture-war-ron-desantis-jd-vance/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1801,
    3103,
    428,
    524,
    2845
  ],
  "sentences": [
    "French: The campaigns of harassment and intimidation and threats that have been leveled against conservative opponents of the right  or against Republican politicians who had the courage to stand up for the American republic itself in the aftermath of Jan. 6  should tell us that people are taking these declarations of emergency with deadly seriousness.",
    "Whats strange is how rarely you hear conservatives seriously question the underlying premise of this form of politics: the idea that cultural conservatism is facing an emergency so dire that only a serious escalation in the use of the state against the cultural left can rescue it.",
    "French: If you talk to Republicans who are involved in grass-roots politics  school board members, longtime party officials, city council members  and you ask them if this New Right energy is being accompanied by an outbreak of civic virtue, many of them would just laugh at that.",
    "The latest iteration of the right-wing culture war is fueled by a messianic, seemingly unshakable terror that the all-powerful cultural left is laying waste to all our institutions, putting it on the cusp of something akin to Romes absolute subjugation of Carthage.",
    "Sargent: You are rare among conservatives in this sense: Unlike those who constantly bewail the supposed hegemony of liberal cultural power, you are willing to say that conservatism itself retains a great deal of cultural power.",
    "French: The Southern Baptist Convention  for example, where I live, outside Nashville, Tenn.  is far more culturally influential than Harvard or Yale or all the combined institutions of the Ivy League or the elite academy.",
    "In more culturally conservative areas of the country, the percentage who identify themselves as very religious far outstrips the percentage even in countries that the most panicked far-right-wingers embrace, like Hungary.",
    "Yet now that he has promised to be the rights own tech oligarch  while feeding the rights desire to believe that Big Tech is carrying out an extinction event aimed at cultural conservatives  they hail him as their hero.",
    "From the small groups, to Sunday schools, to church meetings, to retreats, to camps, to the entire infrastructure of the Christian and religious publishing industry and music industry  its an immense counterculture.",
    "And writers like Ross Douthat and Christopher Caldwell politely suggest Vance is merely trying to harness anti-establishment energy or just making an effort to viscerally reconnect people with politics.",
    "Sargent: Theres an active desire to make the grass roots feel victimized, to harness the political masses and create a justificatory framework for the use of state power to fight the culture wars.",
    "Ron DeSantis of Florida  who is using state power to punish Disneys opposition to his law restricting classroom speech  is seriously considering a run for the GOP presidential nomination.",
    "He has quietly carved out a niche as a leading foe of these new right-wing crusades, arguing that they betray classically liberal principles and liberal democratic constitutionalism.",
    "I reached out to French because he grasps whats really driving the cultural right at this moment and why the tendencies it is unleashing are cause for profound concern.",
    "French: The reality of Big Tech at present is that more conservatives have more ability to reach more human beings than at any time in the history of the United States.",
    "But to say that all the instruments of cultural power are in the hands of the left gives short shrift to a church that in many ways is so hands-on in peoples lives.",
    "David French: Look back at the last 20 years of the conservative legal movement, and youll see a host of lawsuits brought against speech codes on campuses.",
    "The root of it is a kind of cultural panic, a thought that conservative political views, religious views and cultural views are in retreat everywhere.",
    "In fact, the entire idea that Twitter is imposing a tyranny is just one more manifestation of the cultural catastrophism that weve been talking about.",
    "Sargent: When you say this kind of thing, youre telling many conservatives  particularly of the New Right variety  things they do not want to hear.",
    "Theyll say they want intact families, less teen sex and teen pregnancy, less divorce, less abortion, more kids being raised in two-parent families.",
    "French: Ive encountered people who get actively angry at the mere recitation of statistics indicating that catastrophe is not imminent.",
    "The right tells us the Big Tech oligarchy is exercising overbearing liberal cultural hegemony and wants to break up that oligarchy.",
    "French: What makes the state of Total War even worse is that its motivated by a sense of perpetual persecution and victimization.",
    "You see an increasing effort on the part of red-state legislators to adopt speech codes, most applying to K-through-12 schools.",
    "The populist-oriented right likes to see itself as championing the law and politics as a way to inculcate virtue in citizens.",
    "You got viciously trolled the other day when you suggested that conservatives are actually winning some cultural victories.",
    "They dont seem to ask whether there are dangers in demagoguing people into believing they face cultural Armageddon.",
    "Vance has zealously called for maximal tactics against the leftist cultural enemy, and he might now be in the lead.",
    "The perpetual state of Total War against the liberal cultural enemy is the essence of the story thats being told.",
    "Sargent: Even more serious right-leaning thinkers are too charitable towards this feeding of mass victimization.",
    "Youre deeply skeptical of laws limiting classroom discussion of race, sexual orientation and gender identity.",
    "You had a long-running effort to protect the free speech and free exercise rights of public school teachers.",
    "Youve attacked DeSantiss use of state power to punish Disney for expressing its views on one such law.",
    "In the right-wing imagination, this might be an Armageddon from which the country will never recover.",
    "One exception to this is David French, the conservative Christian writer and First Amendment lawyer.",
    "If you look at these markers of cultural health, time and again youll see theyre actually improving.",
    "But to hear the cultural right talk about the United States of America, its been a march to chaos.",
    "But Musk has a tendency to use his power over the discourse in a base, decidedly non-virtuous way.",
    "Greg Sargent: In recent days youve strongly dissented from some current obsessions on the right.",
    "They have exercised their moderation power in ways that are unfair and biased in many respects.",
    "You have Vance running on a call to purge the administrative state of heretical liberals.",
    "Youll see a long-term effort to vindicate the free speech rights of private corporations.",
    "But the idea that Musk is coming in and ending some sort of tyranny is just laughable.",
    "On every one of those fronts, I say, Good news!? Divorce has been decreasing.",
    "Yet this sort of hyping-of-the-enemy politics arguably does the opposite.",
    "That all thats left to the right is the exercise of raw political power.",
    "That is not to say that society is as healthy as anybody wants it to be.",
    "You have seen an effort to regulate the speech of private corporations.",
    "Some of the rights leading culture warriors are boasting new successes.",
    "Even the least religious American state is more religious than Hungary.",
    "And this week, GOP primary voters in Ohio may very well nominate J.D.",
    "The percentage of kids being raised with their parents is increasing.",
    "Sargent: You see this at play in Elon Musks Twitter takeover.",
    "The injury for which Disney must be punished is opposition.",
    "In about a 12-month span, youve seen a dramatic reversal.",
    "An edited and condensed version of our exchange follows.",
    "Sargent: Id like to ask about a glaring contradiction.",
    "Yes, there has been a decline of church affiliation.",
    "That is not to say that Twitter hasnt made mistakes.",
    "French: What do cultural conservatives care about?",
    "That the culture wars are irretrievably lost.",
    "What is the injury that Disney has inflicted?",
    "The fight itself is the thing, right?",
    "There are fresh indications that Gov.",
    "It touches far more people directly.",
    "I dont oppose Musk buying Twitter.",
    "Thats a matter of real concern.",
    "The abortion rate is lower.",
    "Vance to run for Senate.",
    "The opposite is true.",
    "What do you think?",
    "Its just immense.",
    "Its just speech."
  ]
}