{
  "id": 4222,
  "mediaId": 558,
  "date": "d2022-05-02T14:01",
  "headline": "Disney vs. DeSantis: Florida needs Disney World, Harvard professor says",
  "image": "https://s.yimg.com/uu/api/res/1.2/rrCryEhDCVWemG6KDXJ56g--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-05/feb49e40-ca5a-11ec-8fbf-251f274c3100",
  "link": "https://finance.yahoo.com/video/disney-vs-desantis-florida-needs-210115935.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1241,
    4332,
    4477,
    524,
    611,
    3336,
    2661
  ],
  "sentences": [
    "They're interested in helping their customers make a difference in their lives, whether Disney is bringing fun to people or organizations in the apparel business, bringing joy to them, or Medtronic providing good healthcare to help save lives.",
    "And particularly, in this post-COVID world, they want to be respected, whether it's a Minneapolis CEO when George Floyd was murdered or people on the LGBTQ+ side that want to be respected and heard from.",
    "Disney CEO Bob Chapek wanted to stay out of the controversy over Disney's so-called Don't Say Gay legislation, but the combination of angry employees and former CEO Bob Iger coming out against the law.",
    "But across the country, CEOs in all industries are eyeing the daily developments here, wondering how it might impact their company, how they should navigate these choppy political waters.",
    "And they didn't have to lead with their chin, but they should have had a position that was true to their mission and values of what Disney is that accepts everyone for who they are.",
    "Harvard Business School Senior Fellow Bill George examines the financial outcomes of Florida Governor Ron DeSantis revoking Disney's special tax status and Disney's values.",
    "They may get caught anyway, but if they're true to their mission and values, this is a question of, should I get out of Russia because of the Ukraine war?",
    "A fascinating poll came out last week showing the majority of the country is against the government punishing business over their political beliefs.",
    "In this world of 2022, you have all kinds of stakeholders who expect you to take a position, especially your employees.",
    "And when they don't do that, as Bob Chapek didn't, they get very upset and it leads to the kind of uproar we've had.",
    "So what could Bob have done to keep them his employees happy and somehow stay out of the crosshairs of the governor?",
    "But the fascinating part within this is Democrats were far more supportive of business than were Republicans.",
    "There's this billion dollar question about who's paying off the bonds, which legally have to be paid off.",
    "I'm smiling because when I was a boy growing up, the Republicans were seen as the party of big business.",
    "Bill George is the former chairman and CEO of Medtronic, now a professor at the Harvard Business School.",
    "And Disney is right in the thick of it, and it's struggling to get out of this mess, as you called it.",
    "We are, as policymakers, we need to be acting in the best interest of the country, not big business.",
    "And if that's not clear, I'm not sure Orange County has the money to do that, the Orlando County.",
    "What's fascinating is, I read this statement, and I want you to guess what party it comes from.",
    "And so Disney can't meet all of his needs because he is working a whole political angle here.",
    "--Harvard professor, former chairman, and CEO of Medtronic, it is tricky times to be a CEO.",
    "And they need to find an alignment with those interests with their shareholders' interests.",
    "He should have gone back months before, talked to his board, talked to his leadership team.",
    "And when this legislation started in Florida, they should have had a position ready to go.",
    "And then they get to the worst case, which is a political crossfire with the politicians.",
    "But they are all going back now, I think, in really thinking about, what do I stand for?",
    "I probably would have normally would have guessed a Democrat today, maybe a Republican.",
    "Video Transcript\nDAVE BRIGGS: It's almost pay per view worthy, Disney versus DeSantis.",
    "BILL GEORGE: Well, he should have thought about all these things first, I believe.",
    "And Democrats are seen as the party of the working class, the blue collar workers.",
    "Disney has always been very pro-family, but also very gay-friendly, if you will.",
    "So, as I mentioned, CEOs across the country are shaking a bit in their boots.",
    "It's not just the world it was in the '80s and '90s, the shareholder primacy.",
    "But they need to represent all their employees and all their stakeholders.",
    "Their special exemption wouldn't actually go into effect until June 2023.",
    "But understand the governor has different objectives than Disney.",
    "And how do I avoid getting in the crosshairs of some politicians.",
    "DAVE BRIGGS: Let's go back, if we can, to the start of this mess.",
    "We need to see a majority of American corporations as American.",
    "They have to operate in the best interests of their customers.",
    "They have to operate in the best interests of their employees.",
    "They don't want to get caught into this crossfire either.",
    "What do you make of that political dynamic we have today?",
    "And that's the last thing any company wants to get into.",
    "What are you hearing from them, and what's your advice?",
    "They act in the best interest of shareholders, period.",
    "Even after the statement, he had the employee walkout.",
    "It sounded like Elizabeth Warren, it was Marco Rubio.",
    "And they should have made those points very clearly.",
    "It is the battle dividing Florida along party lines.",
    "They don't act in the best interests of the country.",
    "And I think that's what they've lost sight of here.",
    "And so they are going to have a continued battle.",
    "They want their CEOs to speak on their behalf.",
    "He was acting like he was back in the 1990s.",
    "How do you think this plays out for Disney?",
    "He offered this relatively mild statement.",
    "Stunning when I got to the finish of it.",
    "And we're much more into cultural wars.",
    "Businesses are not interested in that.",
    "What issues should I get involved in?",
    "And when shouldn't I get involved in?",
    "It's not just the shareholders today.",
    "Was that a Republican or a Democrat?",
    "I don't think he did his homework.",
    "We're in a different world today.",
    "Employees have found their voice.",
    "And things seem to have flipped.",
    "It's the world of stakeholders.",
    "How do you think he handled it?",
    "Can they wait out the governor?",
    "A senator-- it's very simple.",
    "Well, they're very concerned.",
    "That's what they want to do.",
    "That statement continued.",
    "70,000 plus jobs as well.",
    "He really had no choice.",
    "BILL GEORGE: Thank you.",
    "But I'll tell you this.",
    "Good to see you, Bill.",
    "Bill George--\nExactly.",
    "Yes, they may have to.",
    "What do we stand for?",
    "He joins us now.",
    "Thank you, Bill.",
    "I have no idea."
  ]
}