{
  "id": 4225,
  "mediaId": 151,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "In DeSantis Florida, California meets its match",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/california-playbook/2022/05/02/in-desantis-florida-california-meets-its-match-00029254",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "These facilities are an effort to save lives, as overdoses skyrocket across California.?\nBIDEN, HARRIS AND THE HILL\nINTERNATIONAL AFFAIRS  Pelosi reaffirms U.S. military, economic and humanitarian support for Ukraine,? by the LA Times Laura King and Kurtis Lee: [Ukrainian President Volodymyr] Zelensky placed his hand on his heart as he greeted the speaker, who was accompanied by a congressional delegation that included Rep. Adam B. Schiff (D-Burbank).?\n The border wall Trump called unclimbable is taking a grim toll,? by the WaPos Nick Miroff: Since 2019, when the barriers height was raised to 30 feet along much of the border in California, the number of patients arriving at the UC San Diego Medical Centers trauma ward after falling off the structure has jumped fivefold, to 375.?\nPICK A LANE  Pelosi blasts McCarthy over inconsistencies on lawmakers safety,? by the WaPos Felicia Sonmez: Pelosi on Friday juxtaposed McCarthys comments with his previous statements condemning the fines levied on GOP lawmakers for attempting to bypass the metal detectors that were installed outside the House chamber after Jan. 6.?\nSILICON VALLEYLAND\n How a billionaires boys club came to dominate the public square,? by WaPos Michael Scherer and Sarah Ellison:  Partisans find themselves celebrating the autonomy of the rich men who they see as serving their interests, while simultaneously objecting to the unchecked power of those who dont.?\nPAYPAL MAFIA  The Shadow Crew Who Encouraged Elon Musk's Twitter Takeover,? by WSJs Rob Copeland, Georgia Wells, Rebecca Elliott and Liz Hoffman: [Musk] was egged on behind the scenes by a mix of voices  from fellow billionaires to internet trolls  with their own beefs with the social-media platform.?\nBIG QUESTION  Can Elon Musk Make Twitters Numbers Work?? by NYTs Anupreeta Das and Lauren Hirsch: If the deal closes, it would become the countrys second-largest buyout on record.?\n Twitter loses bid to toss Alex Berenson lawsuit, by POLITICOs Susannah Luthi.",
    "But the initiative doesnt directly address the needs of children younger than kindergarten age.?\nDIGGING DEEPER  California joins other states probing unusual liver inflammation in children,? by the SF Chronicles Catherine Ho: At least 169 cases have been reported in 12 countries, and the age of the children range from one month to 16 years old, according to the World Health Organization.?\n AND DEEPER  In novel move, California to investigate oil companies over plastic recycling claims,? by the SF Chronicles Dustin Gardiner: As part of the investigation, Bonta issued a subpoena to ExxonMobil, demanding the company release documents related to its role in deceiving the public about whether plastic can be recycled.?\nHUNGER HELP  Essential Immigrant Workers Are Going Hungry in California,? by Capital & Mains Gabriel Thompson: Among children under 18, the rate is even higher, at 64%  meaning that nearly two out of every three undocumented children are food insecure.?\n Debate Heats Up Over Effort to Pilot Safe Injection Sites in California,? by KQEDs Lesley McClurg: Lawmakers in California are debating whether to open sites where people can inject or snort illegal drugs under the watchful gaze of a health care worker.",
    "And that the city was run by a political class in denial about how truly dysfunctional the city had become.?\nMORE DAMN TOOLS  Newsom: Desalination project should be approved  We need more damn tools in the toolkit,? by the Mercury News Paul Rogers: On Monday the staff of the Coastal Commission recommended that the project be denied, citing its impact on marine life, energy use, its vulnerability to sea level rise and the potential to drive up water rates for low-income residents.?\n Boudin prosecutes disgraced cop for domestic violence after Sacramento DA failed,? opines the SF Examiners Gil Duran: San Franciscos DA makes an easy political target for the longtime Republican, but the shtick is wearing thin.?\nCAMPAIGN MODE\nHEATING UP  Charges of racism and red-baiting in race for congressional seat created to elevate Asian Americans,? by the LA Times Seema Mehta and Anh Do: Though political disagreements have often focused on ideology, few could recall race-based attacks among Asian American candidates.?\nENDORSEMENT  Karen Bass for Los Angeles mayor,? by the LA Times Editorial Board.",
    "Top Talkers\nCARE COURT CLASH  In the capital of Blue State America, a new ferment over homelessness,? by WaPos Scott Wilson: One approach is being promoted by the state and local governments, which want to focus more resources on the mentally ill.  Another is being advocated by business leaders, neighborhood groups and angry voters, who have watched the expanding homeless population fill in the citys public spaces and now want local officials to force people to accept housing, getting them off the streets.?\nLA DEBATE After cops remove activists, L.A. mayor candidates take on homelessness  and one another,? by the LATimes Julia Wick, Jeong Park, David Zahnier: Sundays mayoral debate began with a leader of Black Lives Matter-Los Angeles being forcibly removed from the auditorium by multiple campus police officers just before cameras started rolling and ended with the candidates sharing their favorite locations to visit in the city.?\nREFLECTION  The L.A.",
    "SMALLER SCOPE  California lawmaker narrows bill requiring fertility treatment coverage,? by POLITICOs Juhi Doshi: Assemblymember Buffy Wicks (D-Oakland) agreed to amend CA AB 2029 (21) to limit the scope of oocyte retrievals to three, exempt small businesses from having to provide the coverage and place a $75,000 benefit limitation.?\nCHILD CRISIS  Californias youngest children need more mental health support, advocates say in request for funding,? by CalMatters Elizabeth Aguilera: Last year, California launched the $4.4 billion Children & Youth Behavioral Health Initiative to redesign behavioral support for kids.",
    "Im Still Trying to Understand Them,? by NYT Magazines Hctor Tobar:  I wanted [readers] to see what I had seen as a reporter: that Los Angeles was a city of cruel inequalities whose relative wealth and comfort were built upon the labor and the lives of uprooted peoples  families with roots in the Jim Crow South, refugees from the bloody conflicts of the Cold War in Central America and East Asia.",
    "Chesa Boudin, dies,? by SF Chronicles Megan Cassidy: Kathy Boudin, a former member of the radical Weather Underground who took part in a robbery that killed three people, an act that sent her to prison for 22 years and left behind a young son who would become the district attorney of San Francisco, died Sunday at 78.?\nCALIFORNIA POLICY IS ALWAYS CHANGING: Know your next move.",
    "White @JeremyBWhite\nLara Korte @lara_korte\nPOLITICO California @politicoca\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "TWEET OF THE DAY  Assemblymember Kevin Kiley @KevinKileyCA joins the chorus of frustrated Republicans (and Democrats): A $68 billion surplus and still no suspension of the gas tax.?\nBONUS TOTD  The California Budget and Policy Centers Scott Graves @SHGraves29 comes in with the nuance: Punctuation matters: Note how Mr. Kiley puts 'surplus' in quotation marks.",
    "In DeSantis Florida, California meets its match\nBy LARA KORTE, CHRIS RAMIREZ and JUHI DOSHI\n05/02/2022 09:27 AM EDT\nPresented by The Nature Conservancy\nTHE BUZZ  GUNS, ABORTION AND DISNEY: Red states are ratcheting up tension over social issues, and California is eager to enter the fray.",
    "Ron DeSantis, saying such a move was similar to that of an authoritarian regime.?\nThe conflict has heightened DeSantis national profile among conservatives  and raised questions about a potential bid for the White House, as former President Donald Trumps 2024 plans remain unclear.",
    "After Disney released a statement criticizing Floridas Dont Say Gay? bill, the Republican-controlled legislature stripped Disney World of a its ability to self-govern, a status that has been in place for nearly 50 years and allowed it to act like a municipal government.",
    "CALIFORNIA AND THE CAPITOL CORRIDOR\nUPCOMING  Newsom expected to issue cryptocurrency order, by POLITICOs Susannah Luthi: California's move follows President Joe Bidens call for his own federal agencies to study digital money and blockchain technologies.",
    "The latest skirmish over teaching about LGBTQ topics in schools, however, has created a nearly perfect one-to-one comparison between these dueling states  and a chance for each sides leaders to flex their political prowess to a national audience.",
    "And this year, with the party facing tough midterms and red-state officials cracking down on LGBTQ rights, abortion access and discussions of race and inequality in the classroom, the Golden State is not pulling any punches.",
    "From Sacramento to Silicon Valley, POLITICO California Pro provides policy professionals with the in-depth reporting and tools they need to get ahead of policy trends and political developments shaping the Golden State.",
    "QUOTE OF THE DAY  Theres nothing I can say about the GOP that Kevin McCarthy hasnt already put on tape.? President Joe Biden taking jabs at the minority leader during the White House Correspondents Dinner.",
    "Hes also been vocal about his disgust for anti-abortion rhetoric coming out of Ohio and Oklahoma, and has said he wants to make the state a sanctuary? for those seeking abortions.",
    "As leaders of the wealthiest and most populous state in the country, California Democrats have a tendency to position themselves as national defenders of liberal values.",
    "State leaders here were some of Trumps most vocal and litigious opponents, suing his administration more than 100 times over immigration and climate change policies.",
    " Salesforce says NDAs will no longer prevent employees from speaking out about harassment or discrimination,? by the SF Chronicles Chase DiFeliciantonio.",
    "Theyre probably less likely to care about Disneys right to free speech than the cost of driving down to Anaheim, where gas is more than $5.70 a gallon.",
    "POLITICO California has a variety of solutions available for partners looking to reach and activate the most influential people in the Golden State.",
    "Gavin Newsom has already vowed to counter Texas abortion ban with a law that would similarly allow private citizens to go after gun manufacturers.",
    "Both states rely heavily on a tourism economy and have been known to produce politicians powerful in their respective majority parties.",
    "And as was the case through the first years of the Covid pandemic, Florida continues to be California Democrats favorite punching bag.",
    " Video shows LAPD officer shooting 45-year-old man holding cell phone on Martin Luther King Blvd,? by LATACOs Lexis-Olivier Ray.",
    "The word 'surplus' implies that these are mere leftover dollars that aren't needed to support vital public systems and services.",
    " USC education school omitted key data for U.S. News & World Report rankings, report says,? by the LA Times Paloma Esquivel.",
    "Its May 2, which means its crunch time for the governor, who will present his revised budget plan in less than two weeks.",
    "MIXTAPE\n Free diaper program means one less worry for low-income parents,? by the SF Examiners Sydney Johnson.",
    "Hit us up jwhite@politico.com and lkorte@politico.com or follow us on Twitter @JeremyBWhite and @Lara_Korte.",
    "On the other side of the country, where the Walt Disney Company is headquartered, Newsom bashed Florida Gov.",
    "Scientists are resorting to extraordinary methods to save them,? by the SF Chronicles Kurtis Alexander.",
    "To learn more about the exclusive insight and analysis this subscriber-only service offers, click here.",
    "IN MEMORIAM\n Kathy Boudin, formerly imprisoned radical leftist and mother of San Francisco D.A.",
    "Share your message with our influential readers to foster engagement and drive action.",
    "If DeSantis star continues to rise, it could only mean more vitriol from Californians.",
    "California voters top concerns are rising costs, public safety and homelessness.",
    "But we should remind readers: Elections are not won solely on cultural stances.",
    " Californias giant sequoias are being destroyed by our wildfires.",
    " Which Southern California cities face water cutbacks on June 1?",
    "While smaller, the Sunshine State has proven to be an apt foil.",
    "Seeking to increase brand awareness amongst this key audience?",
    "Contact Jesse Shapiro to find out how: jshapiro@politico.com.",
    "Yet their leaders promote vastly different cultural values.",
    "Nothing could be further from the truth.?\nWHERES GAVIN?",
    "We hope all you budget staffers are staying hydrated.",
    "Got a tip or story idea for California Playbook?",
    "What we know,? by the LA Times Hayley Smith.",
    "BUENOS D?AS, good Monday morning.",
    "Have a petition you want signed?",
    "I fully agree with that choice.",
    "Follow us on Twitter\nJeremy B.",
    "Nothing official announced.",
    "Riots Were 30 Years Ago.",
    "Take the Disney debacle.",
    "A cause youre promoting?",
    "Want to make an impact?",
    "Gov."
  ]
}