{
  "id": 4226,
  "mediaId": 65,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Jack Brewer: Joy Reid must apologize for 'reckless' tweet or defamation lawsuit will be filed",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/8e64fc83-bf88-448e-97bc-a1e688b5a203/143b266c-21a0-4936-b815-65422fbe6649/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/jack-brewer-joy-reid-defamation-lawsuit-desantis-event",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amy Nelson",
  "authorUrl": "https://www.foxnews.com/person/n/amy-nelson",
  "termIds": [
    661,
    3819,
    4715,
    4874,
    539,
    2661
  ],
  "sentences": [
    "JACK BREWER FILES POLICE REPORT ON JOY REID FOR PUTTING KIDS IN DANGER, DEMANDS APOLOGY\n\"I would really like to hear the back-story on who these kids were and how they wound up at a DeSantis event.",
    "Jack Brewer, founder of the Jack Brewer Foundation, threatened to sue MSNBCs Joy Reid and claimed she put the children in his mentorship program in danger after she tweeted about them.",
    "Theyre getting Ds and Fs and the teachers just push them through and tell them that thats satisfactory because of their demographic, because of their skin color,\" he said.",
    "Brewer hand-delivered a letter to NBC's New York office demanding an apology from Reid and said he plans to push forward with a defamation lawsuit if she doesnt respond.",
    "He told host Steve Doocy that Reids tweet to her following of more than 2 million Twitter users amounted to a \"direct threat\" to the children in his program.",
    "Brewer quoted the Bible in saying he is called to defend the fatherless, which is what he believes he is doing in standing up against Reid and MSNBC.",
    "CLICK HERE TO GET THE FOX NEWS APP\nBrewer planned to file a defamation lawsuit against Reid and MSNBC if she didnt issue an apology by 9 a.m.",
    "Brewer said the police department, which his program is partnered with, immediately brought extra staff to the school.",
    "\"The kids that I have at my school, most of them are two to three grades behind on their reading and math proficiency.",
    "On April 22, Reid tweeted about Brewers mentorship program, equating the childrens attendance at Florida Gov.",
    "The children she was referring to, Brewer explained, are part of the American Heroes program in Florida.",
    "\"You cant tell people to go out and try to identify kids that are between eight and 14 years old.",
    "Given how anti-Black DeSantis is, using Black children this way is extra sick,\" she wrote.",
    "Ron DeSantis signing event for an anti-critical race theory bill to \"child abuse.\"",
    "\"These kids are the direct victims of CRT,\" Brewer said on \"Fox & Friends\" Monday.",
    "MSNBC did not respond to Fox News' request for comment about the tweet.",
    "\"She tried to put a negative light on our kids,\" Brewer said.",
    "\"I just pray that she responds.\"",
    "How reckless is that?\"",
    "\"That is wrong.\"",
    "ET Monday."
  ]
}