{
  "id": 4229,
  "mediaId": 195,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "DeSantiss attack on Disney will likely fail  and thats probably OK with him",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/01/desantisron_trumpdonald_01722ap-chris-o-meara_getty_split_desantis-trump.jpeg?w=980&h=551&crop=1",
  "link": "https://thehill.com/opinion/campaign/3473539-desantiss-attack-on-disney-will-likely-fail-and-thats-probably-ok-with-him/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stuart Shapiro",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Central to these attacks has been the passage of a bill by the Florida legislature to revoke Disney Worlds designation as a special tax district, which had given Disney effective control of the geographic area around Disney World.",
    "And it is even better if the claim you are making is an example of owning the libs.? The battle for the 2024 Republican nomination is shaping up to be a battle between two politicians who embrace and have mastered this mindset.",
    "Ron DeSantis has recently made headlines by attacking the Walt Disney Company after the company criticized Florida legislation that would severely restrict education in public schools on sexual orientation and gender identity.",
    "That benefit was to signal to Republican primary voters that he will take on big businesses if they dont toe the line regarding his cultural preferences (and those of the voters he hopes to win over).",
    "Stuart Shapiro is professor and director of the Public Policy Program at the Bloustein School of Planning and Public Policy at Rutgers University, and a member of the Scholars Strategy Network.",
    "The Trump administration both issued large numbers of regulations and had many of its deregulatory efforts stopped in court because they were deemed illegal.",
    "Its a lot like when a newspaper prints a correction about an error in a story: The story is what people read, and the correction notice is largely ignored.",
    "The current iteration of the Republican Party has been described as post-policy.? Changing public policy is secondary to getting credit for doing so.",
    "What President Trump realized is that people would remember his claims about deregulation and his initial actions to attempt to repeal regulations.",
    "As president, Donald Trump was a virtuoso at enacting symbolic measures that ended up having little impact but sounded great to his base of voters.",
    "Governor DeSantis learned this approach from the master  and his possible rival for the 2024 Republican presidential nomination.",
    "DeSantis would likely be quite content if the bill were deemed to be illegal; he has already reaped the benefit of its passage.",
    "They would not remember (or never hear about) the fact that those claims were incorrect or that the repeals never took effect.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Trumps alleged focus on deregulation  the policy area I study most closely  also exemplifies this behavior.",
    "The passage of the legislation had a symbolic purpose; it was a Republican form of virtue signaling.",
    "Some have argued that the bills passage will lead to significant tax increases on Florida citizens.",
    "Ask any voter and they likely believe that the 45th President removed a great deal of regulation.",
    "If doing so is in service of a cause valued by many Republican primary voters, all the better.",
    "The views expressed by contributors are their own and not the view of The Hill\nFlorida Gov.",
    "Then dont worry so much if the action ends up getting reversed or never goes into effect.",
    "Others have pointed out that the legislation is very likely to be overturned in court.",
    "You might think either of these outcomes would bother the Florida governor.",
    "Whether those big businesses actually bear any costs is beside the point.",
    "DeSantis signing the bill into law, potential problems with it emerged.",
    "That is likely because Trump repeated that claim over and over again.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "And for the most part, neither did his political opponents.",
    "But the evidence shows something quite different.",
    "Take a bold action that will garner headlines.",
    "But the former President never mentioned that.",
    "The border wall is the classic example.",
    "Follow him on Twitter @shapiro_stuart.",
    "Immediately in the days following Gov.",
    "This is the playbook that Gov.",
    "DeSantis is following.",
    "In particular, Gov.",
    "Youd be wrong."
  ]
}