{
  "id": 4234,
  "mediaId": 151,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Florida Democrats' steep climb in governor's race",
  "image": "https://static.politico.com/d3/05/ba68c9f5400bbef72003544b41ba/fineoutlogo.jpg",
  "link": "https://www.politico.com/newsletters/florida-playbook/2022/05/02/florida-democrats-steep-climb-in-governors-race-00029247",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1451,
    1761,
    2082,
    3992,
    4539,
    3277,
    2661,
    2724,
    2859
  ],
  "sentences": [
    "In 2019, Florida was ranked the third-highest state in the nation for railway trespassing causalities and the second highest for casualties per track mile.?\n Show us the money: Broward leaders visit Dubai seeking Mideast investors,? by Sun-Sentinels David Lyons\n Ricardo Alarcn, Castro confidant and top Cuban envoy, dies,? by The Associated Press Andrea Rodriguez\n Not enough houses: a look at why South Florida is suffering from a severe lack of inventory,? by Sun Sentinels Amber Randall\nODDS, ENDS AND FLORIDA MEN\n In Florida, its Go West for arts donors and patrons,? by The New York Times Geraldine Fabrikant: Though the east coast of Florida  with the Perez Art Museum Miami, myriad other museums and Art Basel Miami Beach  often grabs headlines, as real estate prices soar across the state, transplants from the North and Midwest and even California are flooding to cities on the states west coast.",
    " Another 2024 poll shows Ron DeSantis in pole position if Donald Trump doesnt run,? by Florida Politics A.G. Gancarski\n  Charlie Crist says Miramar Mayor Wayne Messam certainly would be on my shortlist for lieutenant governor,? by Sun-Sentinels Anthony Man\n Behind enemy lines: Nikki Fried makes anti-Ron DeSantis case on Fox News,? by Florida Politics A.G. Gancarski\n Florida Congresswoman Val Demings makes campaign stop in Pensacola,? by WEAR-TV\n  Bryan Avila to run for state Senate District 39, leaving Miami-Dade commission race,? by Florida Politics Kelly Hayes\nMAPMAKER, MAPMAKER\nAS REDISTRICTING TURNS  Voting rights groups who had previously filed a federal lawsuit over congressional redistricting contend a new map pushed into law by Gov.",
    "Not only are they bringing enthusiasm for the arts but robust gifts to back it up, allowing museum directors to plan for the future more aggressively than ever.?\nBIRTHDAYS: POLITICOs Andrew Atterbury\nFollow us on Twitter\nGary Fineout @fineout\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "He is perceived as really strong ahead of a potential presidential run, which could scare people off, but also some Democrats really want to knock him off before he gets to that point.?\nPull Out The Pin  Of course another big complicating factor is that DeSantis continues to steam ahead to the November general election with no resistance while Rep. Charlie Crist, Agriculture Commissioner Nikki Fried and state Sen. Annette Taddeo must wade through the primary first, which won't resolve until late August.",
    "Boothe didn't ask whether he would want to run in two years if Trump runs or wait for six years.?\nWAVE  DeSantis seems unstoppable: Florida Dem primary takes shape as they face daunting task,? by POLITICOs Matt Dixon: Florida Democrats are increasingly worried that the candidates trying to unseat Ron DeSantis cant stop the popular Republican governor from winning re-election as the GOP solidifies its hold on the states political infrastructure.",
    " The Manny Diaz era begins at the Florida education department,? by POLITICOs Andrew Atterbury\n Even in rural Florida, DeSantis trains attack on White House while touting his free speech views,? by USA Today Network-Floridas John Kennedy\n Rejecting social emotional learning in math books doesnt add up, puzzled educators say,? by Orlando Sentinels Leslie Postal\nCORONAVIRUS UPDATES\n WARNING  Florida lost 70,000 people to Covid.",
    "Ron DeSantis during White House correspondents dinner,? by News4Jaxs Travis Gibson\nPENINSULA AND BEYOND\nA PLAN  Brightline, FDOT roll out a $45 million to eliminate train-crossing tragedies,? by Palm Beach Posts Mike Diamond: Brightline and the Florida Department of Transportation (FDOT) have applied for a federal grant to help fund a $45 million project to stop the carnage along railroad crossings in seven Florida counties.",
    "Moskowitz was also appointed to the two biggest positions hes held  state emergency management director and Broward County commissioner  by DeSantis, who is the bte noire to Florida Democrats.?\nPENCE VISITS SOUTH FLORIDA  Former Vice President Mike Pence on Monday will join with the Republican National Committee and local Jewish leaders on Monday as the RNC opens up its first-ever Jewish Community Center in Boca Raton.",
    "And so, to me, that's the old Republican principle of having a restrained government.?\nANOTHER PICK FOR DESANTIS  Florida Supreme Court Justice Lawson announces retirement,? by POLITICOs Stephany Matat: Florida Supreme Court Justice Alan Lawson announced on Friday that he's stepping down from the highest court in the state, giving Gov.",
    " Crist, Fried, Taddeo slam DeSantis, go easy on each other at Orlando forum,? by Orlando Sentinels Steven Lemongello\nSALAZAR DRAWS CHALLENGERS  In one of Floridas few potentially competitive districts, two Democrats say they are now jumping into the race against freshman Republican Rep. Maria Elvira Salazar for Florida's 27th.",
    "But we as policy makers need to be acting in the best interests of the country.?\nPOOL SAFETY  Rep. Debbie Wasserman Schultz appeared last week on The ZAC Foundations Keeping Kids Safe? podcast where the Florida Democrat discussed her push for pool safety legislation aimed at trying to prevent young children from drowning.",
    "Ron] DeSantis has steadfastly refused to cross Trump in public or suggest he would challenge him in a primary, but in a new interview on the conservative podcast The Truth with Lisa Boothe that aired Monday morning, DeSantis made it clear hes eying his re-election bid as a springboard for something bigger.",
    "Their new motion  which was joined by the Florida NAACP  accuses the Republican-controlled Legislature and DeSantis of intentionally destroying Black opportunity districts in Florida and splintering Black communities of interest throughout the state? in violation of the 14th and 15th amendments.",
    "Get in touch: gfineout@politico.com\nTalk of the town\nLANDING SPOT FOR CORCORAN Richard Corcoran, former education commissioner and fomer Florida House Speaker, is joining the Continental Strategy consulting firm as an equity partner where he will focus on strategic and educational startups.",
    "Its still not prepared for the next wave,? by POLITICOs Arek Sarkissian: As Covid infections begin creeping up again across the country, current and former health officials in Florida are warning that the state remains woefully underprepared to handle the next wave of the pandemic.",
    "The RNC is setting up community centers as a part of ongoing multi-million dollar outreach effort to engage with voters in targeted communities.? The party has already opened two Hispanic community centers in Orlando and Doral, and a Black American community center in Jacksonville.",
    "Russell said in a video posted on social media that its the only flippable seat we know we should be going after.?\nBy the numbers  The new congressional map approved by legislators shows that the district was won by former President Donald Trump by less than 0.3 percent in 2020.",
    "The Democratic primary between Rep. Charlie Crist (D-Fla.), Agriculture Commissioner Nikki Fried, and state Sen. Annette Taddeo (D-Miami) is just four months away, but some operatives and the party faithful say they lack confidence? that any can realistically take on DeSantis.",
    "AWKWARD  Democratic leader calls out Democrat Moskowitz to denounce DeSantis,? by Sun-Sentinels Anthony Man: A longtime Broward Democratic activist directly and bluntly challenged Democratic congressional candidate Jared Moskowitz this week over his ties to Republican Gov.",
    "Ron DeSantis is aiming to end the states swing state reputation with a solid victory in the fall  including a win with a bigger margin than former President Donald Trump had in 2020 when he carried the state  reports NBC News Marc Caputo this morning.",
    "I look forward to this opportunity and continuing to promote our values throughout the state of Florida and beyond.?\nCAMPAIGN MODE\nMARGIN CALL  DeSantis eyes big Florida win in November as a White House springboard,? by NBC News Marc Caputo: [Gov.",
    "Working together again  With his public sector experience coupled with his desire to uphold the rule of law and promote freedom, I have no doubt that his success will only continue in this next chapter of his career,? Trujillo said in a statement.",
    "DeSantis is holding a press conference this morning at the Jacksonville Zoo and Gardens with Department of Environmental Protection Secretary Shawn Hamilton and Florida Fish and Wildlife Conservation Commission Executive Director Eric Sutton.",
    "The state Legislature budgeted more than $100 million for community colleges and universities to expand medical training programs to boost the number of qualified nurses in the state and injected $10 million to build medical training centers.",
    "... DATELINE TALLAHASSEE ...\nWINNING FANS  GOP governor rips DeSantis punitive approach toward Disney after parental rights dust-up,? by Fox News Danielle Wallace: Amid an ongoing feud between Disney and Florida Gov.",
    "Will it come soon enough?? by Insurance Journals William Rabb: Floridas governor has said he plans to call a special legislative session for some time in May, aimed at the property insurance crisis in the state.",
    "Carlos Trujillo, the former U.S. ambassador to the Organization of American States and ex-state legislator, is the president of Continental Strategy, which has offices in both Washington, D.C., and Coral Gables.",
    "In a newly posted story by POLITICOs Matt Dixon: It is becoming serious [for Democrats],? said Alex Berrios, who served as Palm Beach County regional field director for President Joe Bidens 2020 campaign.",
    "But that tradition is not a requirement and the court at the time did not provide any detail about its internal deliberations.?\nHOW SOON IS NOW? Coming soon: A Florida special session on insurance.",
    "Ron DeSantis, a fellow Republican governor from Arkansas weighed in on Sunday criticizing what he viewed as a punitive approach to business. First of all, Disney has handled this very poorly, Gov.",
    "The news about Higgins came while Miami City Commissioner Ken Russell said he was dropping out of Democratic primary against Rep. Val Demings and was also going to run for Floridas 27th district.",
    "Asa Hutchinson began, appearing on CNNs State of the Union. He first criticized how Disney took a stance on new state parental rights legislation dubbed by critics as the Dont Say Gay bill.",
    "Moskowitz is the first, and so far leading candidate for the Broward/Palm Beach county congressional seat currently held by Democratic U.S. Rep. Ted Deutch, who isnt seeking re-election.",
    "Common Cause Florida and Fair Districts Now and a group of voters initially filed a lawsuit when the Legislature and the governor were at odds over a new map for the states 28 districts.",
    "There is a separate lawsuit filed in state court that contends the new map, which would likely boost the GOP margin in Florida, violates anti-gerrymandering standards approved by voters.",
    "Florida is a red state. And I think thats because of a lot of what weve done, DeSantis said when Boothe, a Fox News contributor, specifically pressed him about his White House ambitions.",
    "Muiz, who takes over in July, was picked for the post even though there has been a tradition to elevate the justice with the most seniority who has not been chief justice previously.",
    "Running Up That Hill  Then there are the three Democrats challenging DeSantis who trail the Republican governor significantly in fundraising and remain behind him in the polls.",
    "Thats the question, even if they do something and make the changes needed, will it be in time? said William Stander, director of the Florida Property and Casualty Association.",
    "CAMPAIGN ROUNDUP  Ashley Guy, the founder of Tallulah CBD + Juicebar stores in Tallahassee, is challenging incumbent Rep. Allison Tant in the race for State House District 9.",
    "Her team pointed to Fried winning a straw poll of Young Democrats of Florida done in Jacksonville over the weekend where Fried got 41 percent while Crist got just 3 percent.",
    "Guy, a former high school teacher who moved from Washington state three years ago, contends that Tants extreme views? arent in alignment with voters in the district.",
    "Wasserman Schultz sponsored legislation in the Florida Legislature that required residential pools to have barriers so small children could not easily access them.",
    "My goal would be, if we win the election really big, people like you who analyze these things are going to say: The days of Florida being a swing state are over.",
    "His retirement will be effective Aug. 31.  Lawsons decision to retire came a few weeks after the justices selected Justice Carlos Muiz to become chief justice.",
    "Fried also went on Fox News over the weekend to after DeSantis  a signal that shes trying to aim for the general election despite her status in the primary.",
    "Eileen Higgins has shown to be a battle tested leader who has always stood by the people of her community,? said Christian Ulvert in a Sunday text message.",
    " Former Orange firefighter illegally terminated over improper COVID-19 vaccine reprimands, lawsuit says,? by Orlando Sentinels Cristbal Reyes\nDATELINE D.C.",
    "The Dreaming  But the clock is ticking as Democrats remain mired in a primary battle that could leave them ill-equipped to take on DeSantis this November.",
    "But some in the industry, while welcoming the gathering, said it may come too late for struggling insurers facing a June 1 reinsurance renewal deadline.",
    "Marco Rubio (R., Fla.) also has said he doesnt see the current corporate tax rate as sacrosanct and has proposed curbs on corporate stock buybacks.",
    "Since 2018, when Brightline trains opened for service, there have been nearly 60 fatalities in South Florida; 16 of them were in Palm Beach County.",
    "The bill prohibits classroom discussions on sexual orientation and gender identity for elementary schoolchildren from kindergarten to third grade.",
    " Disney dispute reflects wider rift between Republicans, big companies,? by Wall Street Journals Alex Leary, Lindsay Wise, and Emily Glazer: Sen.",
    "The perceived weak slate of candidates, combined with DeSantis brand of bully politics, has even led national donors to shy away from the state.",
    "Its a situation that keeps creating more and more chatter about whether the state is going to get completely written off by national Democrats.",
    "Guy, a Republican, is taking on Tant, the one-time chair of the Florida Democratic Party, in a seat that went for President Joe Biden in 2020.",
    "Its not unsalvageable, but the situation is becoming critical.?\nCloudbusting  Democratic consultants dont offer the most hopeful scenarios.",
    "The Kick Inside  Crist has been raising more money than Fried, picking up plenty of endorsements and has been the frontrunner of late.",
    "Additionally, he will join the newly created Continental PLLC law firm as a partner where his wife Anne Corcoran already works.",
    "Switch  Salazars district includes part of Miamis downtown as well as Coral Gables and other communities in Miami-Dade County.",
    "DeSantis is also scheduled to be the keynote speaker at the Leon County Republican Party Lincoln Day Dinner in Tallahassee.",
    "Democratic nominee for governor Andrew Gillum won the district over Ron DeSantis by more than 7 percentage points in 2018.",
    "Floridas 250-plus hospitals are still facing staffing shortages that continue to worsen as the Covid-19 pandemic drags on.",
    "Ulvert maintained community leaders are excited? about her candidacy and she will be making a formal announcement soon.",
    "Brightline and FDOT would each contribute $10 million; another $25 million is being sought from the federal government.",
    "Florida Democrats' steep climb in governor's race\nBy GARY FINEOUT\n05/02/2022 07:08 AM EDT\nHello and welcome to Monday.",
    "Its very simple, and that is we need to stop thinking about major American corporations as American, Mr. Rubio said.",
    "While in Congress, Wasserman Schultz also got legislation that required safer drain covers in public pools and spas.",
    " But I don't believe that government should be punitive against private businesses because we disagree with them.",
    "But Frieds campaign has started going after Crist, and keeps trying to change the narrative that shes trailing.",
    "Veteran Democratic consultant Ben Pollara said the DeSantis thing is kind of a blessing and a curse.",
    "Higgins current county commission district comprises about 70 percent of the congressional district.",
    "We soon realized after serving in Florida House together that we had similar beliefs and work ethic.",
    "Miami-Dade County Commissioner Eileen Higgins is preparing for a run, a top adviser said on Sunday.",
    "King Of The Mountain  Well, lets look at this split screen going on in the Floridas governors race.",
    "Have a tip, story, suggestion, birthday, anniversary, new job, or any other nugget for Playbook?",
    "Lawson, 60, is ending his 21-year judicial career 15 years prior to mandatory retirement.",
    "Ron DeSantis is unconstitutional and intentionally? discriminates against Black voters.",
    "Trujillo was the chair of the House Appropriations Committee when Corcoran was speaker.",
    "Ron DeSantis a rare chance to appoint yet another justice to the bench.",
    "They act in the best interest of the shareholders, and thats their job.",
    "Corcoran stated that Carlos and I have been friends for a long time.",
    "That's not the right approach either, Hutchinson said.",
    "They dont act in the best interests of the country.",
    "Both have a supermajority of Hispanic voters.",
    " Trevor Noah takes shots at Florida Gov.",
    "On one side, Gov.",
    " WHERE'S RON?",
    "Ron DeSantis.",
    "REGROUPING?",
    " Gov."
  ]
}