{
  "id": 4237,
  "mediaId": 302,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Pay remains sticking point for many Florida teachers, support staff",
  "image": "https://www.tampabay.com/resizer//y-ZfUw0wifcO5gU6MtmihgRzvjU=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/JRU5DBZSQ5ASZOT6DJH4AJZ2FM.jpg",
  "link": "https://www.tampabay.com/news/education/2022/05/02/pay-remains-sticking-point-for-many-florida-teachers-support-staff/",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4729,
    3279,
    3664,
    2582,
    2661,
    2790,
    2871,
    4914,
    5088
  ],
  "sentences": [
    "Subscribe to our free Gradebook newsletter\nClass size: Four Alachua County schools are attempting to meet state mandated class sizes as they cope with enrollment growth and teacher shortages, WUFT reports.",
    "The big story: During their spring regular session, Florida lawmakers took steps to put more funding into the salaries of public school teachers and other staff members for the coming academic year.",
    "From the court docket ... A federal judge has set June 21 to begin hearing a challenge to Floridas new law on how race issues are taught in public schools, the News Service of Florida reports.",
    "Home schooling: Growing numbers of Brevard County families used home schooling during the pandemic, prompting school district budget cuts amid shrinking enrollment, Florida Today reports.",
    "HB 1557: Floridas new law on instruction about gender identity and sexual orientation could force schools to get rid of their LGBTQ student support guides, the Sun-Sentinel reports.",
    "Ron DeSantis appointee to replace a member who resigned to run for the state Senate isnt eligible to seek the seat permanently without moving, Coral Springs Talk reports.",
    "Negotiations have dragged on for months, hitting a new snag late Friday as the workers union has asked for more than what district officials say they can afford.",
    "The School Board has acknowledged its wages are not competitive, and is asking voters to approve a property tax increase later this year to boost salaries.",
    "Math textbooks: Some Florida educators question the states opposition to social-emotional learning content in math books, the Orlando Sentinel reports.",
    " The Florida Department of Education continued to approve previously rejected textbooks for districts to consider, Florida Politics reports.",
    "Every Thursday, get the latest updates on whats happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "Hot topics\nFloridas education commissioner: The State Board of Education unanimously approved state Sen. Manny Diaz Jr. to the post.",
    "Tax referendums: Clay County voters will consider extending a local-option school property tax in November, Clay Today reports.",
    " About 300 Brevard County residents protested the law Sunday, saying LGBTQ voices will not be silenced, Florida Today reports.",
    "North-central Florida districts have struggled to fill their classrooms despite the increased budget for raises, WUFT reports.",
    "Union leaders said they want to prevent more teachers and staff from leaving, with shortages already affecting schools.",
    " A conspiracy theory went viral that Florida picked one K-5 publisher because of its connection to Virginias governor.",
    " A Taylor County elementary school is adding a free book vending machine as an incentive for students, WTXL reports.",
    "Other Florida school districts including Miami-Dade County are considering whether to follow suit, WTVJ reports.",
    "Some have yet to get any extra money to their employees this year, with the details hung up in contract talks.",
    "The superintendent has proposed adding grade levels and specialty programs to the campus, the Ledger reports.",
    "Snopes.com looked into the allegations, after the department added a second publisher to the approved list.",
    "The Polk County school district is seeking ways to better use a half-empty middle school in Lake Wales.",
    "The sides head back to the table Monday evening for whats expected to be the final attempt at a deal.",
    "Diaz, who has been a teacher and charter school administrator, was the only candidate for the job.",
    "Florida has a new initiative to give free books to K-5 students who struggle with reading.",
    "The effort has raised $50 million in corporate donations, Mainstreet Daily News reports.",
    "Hear some of his views in a 14-minute interview on WPLGs This Week in South Florida.",
    "Pay isnt necessarily helping solve teacher shortages around the state, though.",
    "Broward County schools will close for the Islamic holiday Eid al-Fitr in 2023.",
    "The school district uses the revenue for safety and security measures.",
    "Other school news\nThe Broward County School Board has a new member.",
    "Some school districts havent attained the states target pay rates.",
    "Pasco County is among those without a current year agreement.",
    "Before you go ... Spaghetti with chopsticks, anyone?",
    "The department has not yet explained its decisions.",
    "  \nSign up for the Gradebook newsletter!",
    "Click here to sign up.",
    "Read more here.",
    "Gov."
  ]
}