{
  "id": 4238,
  "mediaId": 136,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Pushback Against DeSantis Proves the Value of His Battle With Disney | Opinion",
  "image": "https://d.newsweek.com/en/full/2028057/florida-governor-ron-desantis-speaks-during.webp?w=790&f=975e9b8de8a277f772af503e6966648b",
  "link": "https://www.newsweek.com/pushback-against-desantis-proves-value-his-battle-disney-opinion-1701983",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Davis",
  "authorUrl": "https://www.newsweek.com/authors/mark-davis",
  "termIds": [
    661,
    3796,
    4464,
    524,
    611,
    2555,
    2661,
    2665,
    2934,
    4960
  ],
  "sentences": [
    "The reaction has ranged from strong praise for DeSantis for standing up to the latest wave of corporate wokeness, to condemnation from Disney defenders accusing him of suffocating the company's right to free expression, to, in a characteristically shrill New York Times headline, an \"assault on democracy.\"",
    "Moving at head-spinning speed, the Florida legislature passed, and the governor signed, a bill stripping Disney of a massive tax advantage it has enjoyed since 1967a special district that allows Disney to self-govern the massive tract of land in Florida where the Walt Disney World theme park has thrived.",
    "But the greater likelihood is that the singular resolve DeSantis is demonstrating will result in a decisive re-election, followed by immediate conservative yearning for him to offer his inspiringly combative skill set to a national audience in 2024.",
    "But the Left's shock is understandable; as a movement, it has enjoyed a largely unfettered advance on society, commandeering the ethos of corporate boardrooms with few, if any, elected leaders daring to stand in front of its activist tanks.",
    "The battle lines drawn over DeSantis' reaction have been broadly ideological, with conservatives hailing it as the latest evidence of his \"fighter\" credentials while liberals assail it as an unfaireven illegalact of retribution.",
    "Disney bought into the fraudulent characterization of the Florida measure as a \"Don't Say Gay\" bill, when all the law does is stop the introduction of stark sexual topics into classrooms from kindergarten through third grade.",
    "Fatigue runs high among Americans who have absorbed years of stories featuring corporate executives deciding to line up with social justice warriors, caring not a whit about the resulting alienation of millions of customers.",
    "Florida Governor Ron DeSantis has released a payload of consequences onto the Walt Disney Company for its decision to fight policies designed to protect children from sexual content in their earliest years of education.",
    "So, to summarize, Disney can oppose and even grossly misrepresent Florida's legislative intent, peppering its activism with its expressed intent to shoehorn LGBTQ themes into layers of its children's content.",
    "The company invited even more negative attention when voices inside its power structure made clear its intent to push LGBTQ themes into multiple corridors of entertainment for children.",
    "As it turns out, even a considerable number of Florida Democrats told pollsters they were not on board with telling seven-year-olds they can choose their own gender.",
    "It is the most peculiar of assertions that a company should be able to thwart the will of a state's voters with no reaction permissible from the state's government.",
    "The company has been responsible for providing services like roads, power, water and even firefighting in return for billions in relief from taxes and fees.",
    "The gasps of surprises have come from people who have spent their lives believing that companies may take the stances of their choice without consequence.",
    "Nike chose to confer sainthood onto Colin Kaepernick, whose race-baiting and derision of police have made him a NFL quarterback non grata for five years.",
    "Consider the apoplexy from liberal ranks upon learning that Twitter will no longer run an ideological protection racket by muting conservative speech.",
    "So, putting aside any assessment of admiration or denigration for DeSantis' response, the question becomes: Can governors do things like this?",
    "MLB pulled the All-Star Game from Atlanta on the audacious premise that such protections constituted racist \"voter suppression.\"",
    "No one has said Disney, or any other corporation, should be muzzled in any attempt to advocate on any topic in any fashion.",
    "Coca-Cola and Delta conspired with Major League Baseball to punish the state of Georgia for bolstering election security.",
    "If voters disapprove of DeSantis' response to Disney's offenses, they can return him to private life in November.",
    "But in response, Florida may decide that it no longer wishes to offer the company a sweetheart tax deal.",
    "In fact, this whole drama features all participants doing what they each have a respective right to do.",
    "There's an old military adage that if you're taking heavy flak, it must mean you are over the target.",
    "Mark Davis is Host of \"The Mark Davis Show\" on 660AM on \"The Answer\" KSKY, Dallas/Fort Worth, Texas.",
    "Misstating the intent of its targets is a hallmark of woke corporate behavior.",
    "Disney has every right to support or oppose whatever Florida laws it pleases.",
    "Any company in any state has the right to be vocal about any issue.",
    "Disney and Florida are all acting within their proper purview.",
    "The grateful support and loud blowback are both predictable.",
    "The views expressed in this article are the writer's own.",
    "At least in Florida, that free ride seems to be over.",
    "These are people used to getting their own way.",
    "The answer is: Of course they can.",
    "Settled.",
    "Boom."
  ]
}