{
  "id": 4243,
  "mediaId": 18,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Editorial: Disney, DeSantis must compromise",
  "image": "https://www.bostonherald.com/wp-content/uploads/2022/04/AP22046712121221-1280x854-1.jpg?w=1280",
  "link": "https://www.bostonherald.com/2022/05/02/editorial-disney-desantis-must-compromise/",
  "sentiment": "0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Editorial",
  "authorUrl": "https://www.bostonherald.com/author/editorial/",
  "termIds": [
    661,
    1241,
    4464,
    200,
    524,
    611,
    2661,
    2945,
    5109
  ],
  "sentences": [
    "This fight, indicative of the nations schism on these matters, began when Florida enacted a piece of legislation that says: Classroom instruction by school personnel or third parties on sexual orientation or gender identity may not occur in kindergarten through grade 3 or in a manner that is not age-appropriate or developmentally appropriate for students in accordance with state standards.? Its proponents call the bill the Parental Rights in Education? bill; its detractors have dubbed it the Dont Say Gay? bill.",
    "But he caved to pressure from his employees to take a stand and oppose the bill, ending political donations and offering a variety of other virtue-signaling sanctions designed to appease those on the Disney payroll (no matter that Disney kept doing business in a variety of countries far more hostile to LGBTQ persons and issues than Florida).",
    "Disneys business model  the envy of the world  requires colossal numbers of both Republicans and Democrats, and their international equivalents, to walk through its gates, where they seek fun, family togetherness and a vacation from the troubles of the outside world.",
    "It might make DeSantis and the state feel better to nix the Reedy Creek deal in their pique, but hurting Disney, promoting it as a pariah company in the minds of a chunk of America, is an absurd position for the Florida governor to take.",
    "That sparked a backlash in the Republican-led state legislature, which moved to dissolve the sweetheart Reedy Creek Improvement District? deal that Walt Disney himself negotiated when Disney World was planned.",
    "We recommend a photo shoot with Chapek and DeSantis shaking hands, restating their mutual bond and announcing the cancellation of the legislation dissolving Reedy Creek before it takes effect next year.",
    "The goofy impasse between the Walt Disney Co. and the state of Florida is providing lots of red meat for Fox News, MSNBC and divisive partisans on both sides  but its bad for America.",
    "First, corporate CEOs become involved in partisan political issues at their peril, and rarely to the benefit of their chief constituency, namely the shareholders of a public company.",
    "Ron DeSantis and Bob Chapek, CEO of Disney, to go together to Cinderellas Royal Table, share some scrambled eggs, shake hands with Donald Duck and put an end to this nonsense.",
    "They should restate their ongoing determination to protect what is so special to millions of families about Walt Disney World and vow never to mess with that in the future.",
    "They both know Disney cannot leave Florida, where it has billions of dollars in sunk costs, and Florida needs Disney, one of its biggest and most important employers.",
    "In essence, the Reedy Creek giveaway gave Disney total control over what then was swampland and now is one of the premiere tourist draws in the world.",
    "Second, legislation enacted out of a desire for revenge, and this surely fits that particular bill, almost never is good legislation.",
    "Disneys profitability requires that to be protected, and America is better for red and blue staters actually spending time together.",
    "Neither side is likely to change its position anytime soon, even though this actually is a nuanced issue.",
    "Chapek first tried to keep his company removed from the goings-on in Tallahassee.",
    "Chapek has alienated conservatives and put that at risk.",
    "Here are two truths that emerge from this debacle.",
    "And an embarrassment to both parties.",
    "The rest is just political theater.",
    "Its time for Florida Gov.",
    " Chicago Tribune"
  ]
}