{
  "id": 4246,
  "mediaId": 558,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Time for a Disney do-over? DeSantis lobs solar bomb. Redistricting musical chairs begin",
  "image": "https://s.yimg.com/ny/api/res/1.2/LiCa9ldeb_U7eXziBVHKlA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTQ3MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/Kc.Nu5Ae3FaSIb2Twos1xQ--~B/aD03NjA7dz0xMTQwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/miami_herald_mcclatchy_975/e4adcdc09c1f2ec5a11ec68e6e260fc5",
  "link": "https://news.yahoo.com/time-disney-over-desantis-lobs-073453680.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mary Ellen Klas",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "He also signed a letter with some 300 other medical professionals arguing the DOH statement on transgender children misrepresents the weight of the evidence, does not allow for personalized patient and family-centered care, and would, if followed, lead to higher rates of youth depression and suicidality.?\nAfter years of political fights and delays, David Beckhams Inter Miami is coming to the 305.",
    "DeSantis traveled to a Las Vegas honky-tonk last week to lend is growing celebrity to a campaign event for Nevada U.S. Senate hopeful Adam Laxalt, with whom he roomed while in Navy officer training nearly two decades ago,\nTwo days later, he to focus on the latest target: The Biden administrations effort to combat disinformation with the creation of Thes planned Disinformation Governing Board.",
    "I dont think theres any other place in the country where you should have more confidence that your vote counts than in the state of Florida,?\nBy the next day, however, Pinellas County commissioners for including a provision they say illegally targets Pinellas to accommodate the political ambitions of one state legislator, state Rep. Chris Latvala, R-Clearwater.",
    "When the longtime Miami-Dade County School Board Chair Perla Tabares Hantman announced she would not seek reelection this fall, she paved the way for he only person running for her District 4 seat, so far, is Roberto Alonso, a 42-year-old Hialeah businessman whom DeSantis appointed to the Miami-Dade College District Board of Trustees in 2020.",
    "They will be paying taxes, probably more taxes.?\nOther governments weakened?: But the governor and his staff have offered no timeline or specifics about what he means and, Fitch Ratings warned last week, the Legislatures retaliation against Disney could lead to costing taxpayers more money when their governments issue revenue bonds.",
    "As Florida legislators were rushing through passage of a bill to punish Disney for its vocal opposition to the Parental Rights in Education? aka dont say gay? bill, they failed to address an obscure provision in state law that says the state could not do what legislators were doing  unless the districts bond debt was paid off.",
    "Scott Rivkees, DeSantis first Florida surgeon general, who has since left the state to take a job at Brown University, does not seem to agree with his former employer and its recent guidance relating to t and another advising against social transitioning or gender-affirming surgery for .",
    "In Palm Beach County, Democrat Hava Holzhauer, formerly of the Anti-Defamation League, has She joins a Democratic field that already includes Broward County Commissioner Jared Moskowitz, Fort Lauderdale Vice Mayor Ben Sorensen and Navy veteran Curtis Calabrese.",
    "The ink was barely dry on the congressional redistricting map when voting-rights groups and other plaintiffs filed a lawsuit last week seeking a temporary injunction to block the congressional redistricting plan pushed by the governor.",
    "Three of the officers were booked into a Miami-Dade jail on Thursday afternoon, two months after 60-year-old inmate Ronald Gene Ingram was discovered dead inside a prison transport van, an incident by the Miami Herald.",
    "U.S. Houses COVID-19 rules have helped The House began to allow proxy voting for the first time in its history as a way to limit the number of members present in the chamber and to reduce the risk of COVID-19 spread.",
    "And some think, due to Floridas size and recent disappointments, we should shift resources and focus elsewhere.? But they warn the but also Floridas place as a top-tier battleground in the 2024 presidential election.",
    "Democrats may not have much going for them in Florida these days, but they The White House last week doubled down on the proposal by Floridas junior senator and the National Republican Senatorial Committee chair.",
    "Ron DeSantis and the Florida Legislature are going to need a save-face do-over as it relates to their plan to dissolve the governing structure operated by Walt Disney Co, the Reedy Creek Improvement District.",
    "He was in line to become the courts chief justice when his colleagues leapfrogged over him and appointed the more junior member, and DeSantis appointee, Carlos Muiz for the two-year role as chief justice.",
    "Meanwhile, the DeSantis campaign war chest, which has now reached more than $105 million, has not returned any of the $100,000 given to his political committee from Walt Disney World prior to the feud.",
    "In an effort to deflect from the pressure to add a provision to allow gun owners in Florida to carry their weapons in public without a permit, DeSantis last week into law if hes re-elected governor.",
    "Miami commissioners on Thursday voted 4-1 to approve the teams 99-year lease of city-owned land to , bringing the Major League Soccer team one step closer to playing games in the Magic City.",
    "After more than three decades in prison, James sat in a packed Miami courtroom, shackled and wearing a red inmate jumpsuit, when he heard the words he himself had been repeating for years.",
    "He spent his legislative career focused on expanding school choice, providing greater parental control and opposed to what Republicans call the indoctrination of children in the classroom.",
    "Meanwhile, , in the second year of her first full four-year term on the county commission, for the District 27 seat held by Salazar, said Christian Ulvert, her longtime campaign manager.",
    "Noah also jokingly praised DeSantis for being smarter than Trump after the due to its content including references to critical race theory and other prohibited topics.?\nPlease subscribe!",
    "A White House analysis found that Scotts tax proposal would increase taxes on 49.7% of small business owners nationally and 81.6% of small business owners earning less than $50,000.",
    "found of 25.5 million ballots cast in the six states where Trump and his allies disputed his loss to President Joe Biden there were fewer than 475 potential cases of voter fraud.",
    "Bond rating agencies sent some quivers about Disney; voting advocates doubled down on their lawsuit over redistricting, and solar advocates got a jolt of encouragement.",
    "Miami City Commissioner Ken Russell Tik Tok last week that he would drop out of the race for the Democratic nomination for U.S. Senate against U.S. Rep. Val Demings.",
    "Four officers from the state-run for beating an inmate so badly that he died after suffering a punctured lung and internal bleeding, authorities said Thursday.",
    "Crist voted by proxy 107 times between January and April 7 when the House took its last votes before a two-week break, according to data from the House clerk.",
    "Thomas Raynard James, 55, has been in Florida prison since he was convicted in 1991 for the robbery and shooting death of Francis McKinnon in 1990.",
    "Stay tuned:? The governor held a town hall with Fox News Laura Ingraham last week and, while offering no details, he said he has it all worked out.",
    "Rivkees writing in a March titled Setting the Record Straight about COVID-19 Vaccines for Children,? that healthy children should get vaccinated.",
    "That, and the fact that most of the law passed last year has been struck down by a federal judge, hasnt deterred DeSantis from claiming success.",
    "The bottom line: the law is in conflict and either the governor and Legislature must change the law, or they will likely lose the law in court.",
    "In other words, the Legislatures actions could undermine the state and local governments credibility when they need to borrow money.",
    "The failure to resolve the uncertainty? could weaken our view of the operating environment for Florida governments, Fitch said.",
    "Florida Supreme Court Justice a move that will allow DeSantis to continue placing his imprint on the states highest court.",
    "President Joe Biden serving sentences for federal drug convictions, including Mackie Shivers, who lost his eye in prison.",
    "He announced he would switch to the congressional race against first-term Republican Rep. Maria Elvira Salazar.",
    "Disneys Reedy Creek Improvement District, however, noticed, as did its lawyers and the bond rating agencies.",
    "There is a debate happening,? said Greg Speed, president of the national progressive organizing group .",
    "The motion for temporary injunction the anti-gerrymandering provisions of the Florida Constitution.",
    "One day last month after Team DeSantis sent out its first fundraising email chastising Disney,.",
    "Its Monday, May 2, and were coming off a very partisan week of politics and policy in Florida.",
    "We are offering a special offer for you: of just $1.99 a month for newsletter readers.",
    "He said he expects the governor to have a hand in shaping his departments agenda.",
    "There is no indication that legislators are eager to fix this mess any time soon.",
    "We know what were going to do, and so stay tuned, he said of the Disney dilemma.",
    "Manny Diaz Jr., a Republican state senator from Hialeah, was last week.",
    "But his campaign used the skirmish to raise funds from small donors.",
    "Lawson was appointed as a justice in 2016 by former Gov.",
    "Know someone whod like to get this free newsletter?",
    "Theres going to be additional legislative action.",
    "The primary election will take place Aug. 23.",
    "WHAT WERE TALKING ABOUT\nDisney do-over?",
    "....The bonds will be paid by Disney.",
    "Last week it became clear that Gov.",
    "Weve contemplated that.",
    "Please check it out!",
    "Rick Scott.",
    "."
  ]
}