{
  "id": 4248,
  "mediaId": 223,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Democrats Gleefully Bankrupting America",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/104/834208cc-8984-4f94-91df-5e41bdec1f43.jpg",
  "link": "https://townhall.com/columnists/tomtradup/2022/05/02/democrats-gleefully-bankrupting-america-n2606590",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Tradup",
  "authorUrl": "https://townhall.com/columnists/tomtradup/",
  "termIds": [
    661,
    1335,
    1341,
    1840,
    2030,
    2066,
    2087,
    4596,
    146,
    2945
  ],
  "sentences": [
    "View Cartoon\nOf course, criticizing the total collapse of objective journalism as it relates to the Biden administration may subject this column to charges of disinformation.? Bizarrely, our Department of Homeland Security is on the casewith an internal working group? that mirrors the Ministry of Truth in George Orwells dystopian novel 1984.? The unhinged nut tapped to head this effort is a woman named Nina Jankowicz; she is described by DHS secretary Alejandro We have Operational Control of the Border? Mayorkas as eminently qualified to oversee the fight against disinformation.",
    "Trending\nAs our nation careens inexorably out of control under the leadership? of President Joe Biden, House Speaker Nancy Pelosi and Senate Majority Leader Chuck Schumer, only the most ill-informed voters who have stuck their heads in the ground like ostriches can fail to see that with each passing dayDemocrats are pouring more gasoline on the fire of the looming financial bankruptcy of America.",
    "The addle-brained Bidenwhose embarrassing rhetorical disasters are continually covered up by his handmaidens in the mediahas become so obviously a joke that he couldnt even get through the White House Easter Egg roll last month without a staffer in an Easter Bunny costume having to rescue him from a questioner along a rope line.",
    "Politicians, ersatz reporters? and B-list Hollywood celebrities like Drew Barrymore and Brooke Shields partied the night away in tuxedos and formal gownsenjoying French wines and chef-inspired mealswhile most normal Americans were at home worrying about how they can possibly pay their mortgages and food bills.",
    "From gun confiscation to embracing violent gangs preying on decent citizens to gender-bending idiocy (our newest Democrat-backed Supreme Court justice absurdly went on record as stating she cannot define what a woman is?) America is heading over a cliff.",
    "It says, Lets get the hay down where the goats can get at it.? Simply put, anyone with half a brain who opts to vote for ANY Democrat in 2022 is an unindicted co-conspirator in the Donkey partys unvarnished plan to bankrupt the United States of America.",
    "Really: the alleged leader of the Free World? was literally pushed away from reporters by the Easter Bunny lest he blurt out another of his trademark malaprops like his dangerously stupid comment that Vladimir Putin cannot be allowed to stay in power.",
    "Democrats remain silent as George Soros-backed District Attorneys set hardened, violent criminals loose with no-cash-bail policies and refuse to condemn idiotic local laws allowing thieves to steal up to $950 a day from merchants with impunity.",
    "Or do you have faith in the proven leadership of Donald Trump, Florida Governor Ron DeSantis, Virginia Governor Glenn Youngkin and dozens of other Republicans who stand ready to swing the pendulum of America back to sanity in 2022.",
    "Meantime, even as gas prices at the pump continue to skyrocket and inflation is creating a crisis at the grocery checkout lines for families trying to feed themselves for another weekwhat is the Democratic plan to help Americans?",
    "Criminal tampering at our ballot boxes notwithstanding (as powerfully depicted in Dinesh DSouzas new documentary 2000 Mules,? executive produced by Salem Media Group) wed better make the predicted Red Wave? of 2022 a reality.",
    "Call me irresponsible, but my guess is decent, God-fearing Americans from coast to coast do not look forward to having their political discourse being regulated by a person with such twisted, perverted views.",
    "Even as many voters are already buying emergency food, solar generators, and other self-sustaining items to fend off potential crises aheadit is well-past time to stand up and be counted at the ballot box.",
    "America this year faces a midterm choice unlike any other, because the past 15 months of Democratic malfeasance have undermined American values in a way that nobody could possibly have imagined.",
    "Prima facie evidence of the new media paradigm in Washington and New York was on display over the weekend as the White House Correspondents' Association dinner returned to the Washington Hilton.",
    "Well, here are just a few of their ideas unfolding as this is written:\n--Biden wants Congress to push through another emergency? spending plan to ship $33 billion of weapons to Ukraine.",
    "--Democrats are pressing Biden to forgive? student loans of up to 40 million Americans (probably a coincidence, but this would be happening just before this years Midterm elections.)",
    "Theres an old bromide I first picked up as a student at the University of Alabama that perfectly sums up the fiscal nightmare the Democratic Party is constructing for America.",
    "Democrats want to mainstream puberty blockers? and think promoting Transgender education and having biological men compete with biological women in sports is just swell.",
    "Democrats support ending Title 42 on May 23, which will result in a massive surgeat minimum an additional 18,000 per dayof illegal aliens flooding across our borders.",
    "--One Democratic proposal is to devote $100 million to building an airport in an Aleutian Island community that has no roads and only 75 full-time residents.",
    "These are the stark choices facing the USA this year, and nobodynot Nancy Pelosi, not Nina Jankowicz, not our \"President\" Joe Bidencan dispute them.",
    "(The Easter Bunny video went viral on Instagram and other outletsbut good luck finding it on MSNBC, CNN or Bidens other electronic protectors.)",
    "--Democrats continue their war on the petroleum industry, but cant find any proposal for windmills or electric cars they wont fully fund.",
    "Apparently, her credentials include depraved online posts of herself singing about her fantasies of having sex with a dead Harry Potter.",
    "Do you want the declining and disgraceful America of Joe Biden and his cronies for another two years?",
    "Or we can kiss Americawhat the great Ronald Reagan once called that shining city on the hill?goodbye.",
    "Republicans want to protect the people of Texas, Arizona and other border states from this disaster.",
    "Republicans instinctively know that is insane and nothing short of Democrats endorsing anarchy.",
    "Another of her online songs? depicts Jankowicz delivering lyrics about sitting on a toilet.",
    "Anyone who disagrees with one word of this article isquite simplywrong.",
    "Wont stop rampaging urban gangs from preying on average citizens.",
    "Republicans favor keeping traditional American values in place.",
    "But to Democrats, this is an eminently qualified? person.",
    "But when it comes to funneling $33 billion overseas?",
    "Democrats wont secure our own border with Mexico.",
    "Republicans want to slam on the brakes.",
    "Democrats are stepping on the gas.",
    "This isnt brain surgery, friends.",
    "Which America do you want?",
    "Spend Spend Spend.",
    "Spend Spend Spend.",
    "Spend Spend Spend.",
    "Spend Spend Spend.",
    "End of debate.",
    "Period."
  ]
}