{
  "id": 4253,
  "mediaId": 43,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Mark Esper confirms Trump wanted to 'just shoot' Black Lives Matter protesters",
  "image": "https://images.dailykos.com/images/816944/story_image/AP_20163482955933.jpg?1591883032",
  "link": "https://www.dailykos.com/story/2022/5/2/2095331/-Another-book-again-confirms-that-Trump-wanted-the-military-to-just-shoot-BLM-protesters",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hunter\nDaily Kos Staff",
  "authorUrl": "https://www.dailykos.com/users/hunter",
  "termIds": [
    661
  ],
  "sentences": [
    "There's now an entire cottage industry of hard-right Republican officials who helped Trump do extraordinarily bad and damaging things, but who are propping themselves up now on the pretense that, well, at least they did not support murdering protesters outright, or at least they did not support attempts to capture or murder Trump-opposed House and Senate leaders, or at least they did not help the rest of Trump's staff in schemes to declare that the vice president could scrub out the votes of whatever Americans he wanted to, in order to arrive at whatever election outcome the current leaders of government wished to announce.",
    "Whatever career Mark Esper once had before Trump appeared on scene is now well and truly gone; he will remembered now alongside William Barr and other Republicans who protected Trump through years of corrupt, self-serving, often-delusional, nation-harming behaviors only to write up books afterwards mumbling that they were Actually against all of the outright evil things all along, or were against at least some vanishingly small number of them, and ought to still be served in public restaurants and invited to Washington parties.",
    "You do not get to say, \"I worked for the man who soon afterward attempted to end United States democracy,\" and append \"but was of course against the coup part,\" unless you can provide even a teaspoon of evidence of being \"against\" the government purges, political purges, manufacturing of hoaxes, flagrant daily lying, contempt for the American public, white nationalism, autocratic demands, and ingrained fascist beliefs that had been laying the groundwork for that outcome through Trump's whole long, crooked descent.",
    "Esper was Trump's secretary of defense during a time, post-impeachment, when Trump was widely purging the U.S. government of anyone thought to be disloyal, felt newly emboldened after Senate Republicans immunized him from the consequences of a Watergate-plus sized campaign of political corruption, and was increasingly deemed by many to be dangerously unstableas he would go on to prove at numerous points during the 2020 campaign and post-election, culminating in an attempted coup.",
    "He could not grasp security briefings, forcing staff to include frequent mentions of him to at least keep him reading; he was so obsessed with self-promotion that he altered government hurricane maps and promoted the altered forecasts rather than admitting to a piffling Twitter mistake; his prescriptions for dealing with pandemic continuously did active harm to the nation, even as his lack of focus made more organized and sensible responses impossible.",
    "We knew these incidents had taken place because a previous book profiting off the slow death of democracy described them last year; Wall Street Journal reporter Michael Bender's 2021 book revealed them in similar detail, including Trump's demands to use military force, \"beat the fuck\" out of protesters, and \"shoot them in the leg\" or \"maybe the foot.\"",
    "William Barr, Mark Esper, the blizzard of propagandist-to-news-\"analyst\" career slidesAmericans have every right to treat all of these people with contempt for their parts in normalizing horrific acts, bragging that they prevented even more horrific acts, and demanding the nation move on without any doled-out consequence or comeuppance.",
    "That earlier book also gave us the heartwarming scene in which a fed-up Gen. Milley, tired of White House white nationalist Stephen Miller egging Trump on with claims that parts of the United States were now a \"war zone\" due to the protests, \"spun around in his seat\" and told Miller to \"shut the fuck up, Stephen.\"",
    "If a sitting president of the United States repeatedlyno, incessantlyasks his staff to do criminal things, anything from the political extortion of an at-war government to further a propaganda effort to requesting that Americans protesting against him simply be murdered, refusing to do the murder part is not bold.",
    "That Black Lives Matter protesters might have had a legitimate point to make never crossed his mind; that he, as president, was not allowed to simply murder protesters outright was something he struggled to understand even as the top officials who would have to order such murders tried to explain it to him.",
    "When Milley and then-attorney general Bill Barr resisted due to the blazing illegality of such an order and, let's assume, not wanting to spend the rest of their lives in prison on this bozo's behalf, Trump modified his proposal to \"just shoot them in the legs or something?\"",
    "In news we already knew but now know more, er, knowingly, a new book by ex-Trump secretary of defense Mark Esper confirms that yes, Donald Trump really did want to \"just shoot\" Black Lives Matter protesters rallying near the White House during the 2020 protests.",
    "Donald Trump wanted to use the military, and he specifically wanted to use the military to kill protesters or, after meeting resistance from the rest of his staff, shoot them \"in the legs\" so that they could no longer march against his self-imagined greatness.",
    "You especially cannot respond to an attempt to overthrow democracy itself by demanding that Americans move on while your party allies write new election laws to get around the flaws of the first coup attempt and make a second one easier to muster.",
    "Listen to Markos and Kerry Eleveld talk Ukraine and speak with Wisconsin Democratic Party Chair Ben Wikler on how hitting back at Republicans helps win elections on Daily Kos The Brief podcast\nx\nx\nYou need to enable JavaScript to run this app.",
    "Specifically, Trump said he wanted the U.S. military to \"beat the fuck\" out of the protesters, and told Joint Chiefs of Staff chair Gen. Mark Milley and other top administration officials to \"just shoot them\" on several occasions.",
    "An update on Ukraine and Democrats win by hitting Republicans hard in Wisconsin\nDaily Kos' The Brief\nFollowShare\n0:001:01:31\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nTruly, the worst president ever.",
    "Esper was one of Trump's enforcers, as Trump attempted to do to the military what he was doing everywhere else, only to be replaced after Trump's November election loss with the more-toadying Christopher Miller.",
    "What Mark Esper's new book brings to the scene is confirmation by another participant that yes, all of this really did take place and they took place just as previous accounts said.",
    "You don't get to say, \"I am still a Republican,\" without adding, \"even though the party both plotted an election-nullifying coup and is continuing to protect its plotters.\"",
    "His own staff knew of his history of demanding illegal or corrupt actionsand, after his election loss, much of his stalwart-Republican staff helped him take those actions.",
    "Some, like chief of staff Mark Meadows, may have played a more pivotal role in attempting to nullify the election than the buffoonish Trump could himself even manage.",
    "We've got a party that has convinced the majority of American voters that our elections are illegitimatebased on a barrage of internet hoaxes and nothing more.",
    "Ron DeSantis is making his own bid for both positions, so Trump may last as America's Worst President for no longer than George W. Bush did before him.",
    "All of this was a pattern and was being warned of, incessantly, both long before and during every winter day leading up to a Trump-led attempted coup.",
    "Mark Esper, center, marched with Trump immediately after attacking Black Lives Matter protesters demonstrating near the White House.",
    "White nationalism is now a party plank, such that even mentions of racism in American history are now fodder for public retaliation.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "There is no military medal awarded to generals who personally tell Stephen Miller to \"shut the fuck up,\" but there ought to be.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Trump's vast and wide-ranging ignorance made him an incompetent leader during every national crisis he was faced with.",
    "We're all perhaps a bit disappointed Milley didn't shoot Miller in the leg or \"maybe the foot,\" but there you go.",
    "Possibly the worst human being ever, though that's a value judgmentand Florida Gov.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Abandon your party or do your part to redeem itor shut the fuck up, Stephen.",
    "Now he wants points for not agreeing to Trump requests to just murder them?",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n62.",
    "Do something worthy of redemption before demanding it.",
    "Nobody has time to give you the attention you seek.",
    "The purpose of Esper's book is self-redemption.",
    "This is a short blurb about Daily Kos.",
    "That's military discipline for you.",
    "We've got library book bans now.",
    "Take your books and shove them.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Stuff your books.",
    "Please read it."
  ]
}