{
  "id": 4256,
  "mediaId": 19,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Report: Bidens Advisers Weigh Making Midterms About Trump Again",
  "image": "https://media.breitbart.com/media/2022/02/GettyImages-1373041852-640x480.png",
  "link": "https://www.breitbart.com/midterm-election/2022/05/02/report-bidens-advisers-weigh-making-midterms-about-trump-again/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Wendell Husebø",
  "authorUrl": "https://www.breitbart.com/author/whusebo/",
  "termIds": [
    661,
    761,
    1147,
    2087,
    2517,
    4485,
    4623,
    428,
    539,
    2674
  ],
  "sentences": [
    "But as Democrats have struggled to overcome Bidens 40-year-high inflation and southern border invasion, many advisers believe that distracting voters from Bidens failures by focusing on Trump may yield political results, Politico reported:\nElon Musks purchase of Twitter raised the chance that Trump could be reinstated to the social media platform, where he had more than 80 million followers before being banned in the wake of the Jan. 6 riot.",
    "While the former president would eat up an extraordinary amount of political oxygen, its also possible that he would push the Big Lie or feud with fellow Republicans and damage the GOPs otherwise strong chances of regaining at least one house of Congress.",
    "He wants the decision of whether to run again be something that he alone decides.?\nDemocrats appear to be singing a different tune from November, when they were shellacked in many local and state races, including Virginias gubernatorial race.",
    "Democratic strategists say the White House is still moving too slowly and remains too disorganized ahead of the midterms, when many Democrats fear their party will lose control of the House and possibly the Senate,? the Post continued.",
    "The advisers, who have been criticized for having no finalized, comprehensive strategy for the midterms,? may opt again to campaign against Donald Trump, who is not on the ballot.",
    "Theres no overarching document that outlines the presidents involvement in key races, nor a set message that will carry the party through November,? the Post reported in April.",
    "Redistricting expert and senior editor of the Cook Political Report, David Wasserman, also believes Republicans will have a huge advantage in midterms based on his experience.",
    "But last night shows there are ways for Republicans to inoculate themselves against it.?\nYet without Trump, Democrats appear to have no strategy to combat the red wave.",
    "Sean McElwee, executive director for Data For Progress, told the Daily Beast that making politics just about Trump is not always a successful strategy.",
    "As long as Donald Trump is a former president, I think Democrats have a responsibility to look more to the future,? Rep. Dean Phillips (D-MN) said.",
    "Musk has said he would allow Trump to return, and while the ex-president has claimed he doesnt want back on, the White House does not believe him.",
    "I hope Elon buys Twitter because hell make improvements to it and he is a good man, but I am going to be staying on TRUTH,? Trump told Fox News.",
    "President Bidens advisers are reportedly weighing a midterm election strategy specifically focused on Donald Trumps unlikely return to Twitter.",
    "Trump is a uniquely unpopular and polarizing figure, and I think its a playbook that worked for a long time,? McElwee said.",
    "The more the election becomes about Trump, the better the Democrats chances become, many in Bidens orbit believe.",
    "Hes not going to allow Chris Christie or Ron DeSantis or anyone else define the future of the Republican Party.",
    "The biggest ally we have is Trump himself,? Saul Shorr, a Democrat media consultant, told the Washington Post.",
    "In April, Politico predicted Republicans will dominate the midterms by reclaiming the House and Senate.",
    "Trump has publicly said he will not return to Twitter even if Elon Musk reinstates him to the platform.",
    "Democrats were crushed in November when they last deployed a campaign focus on the former president.",
    "After the string of nationwide defeats, Democrats admitted focusing on Trump was a failure.",
    "The consensus among Biden aides about Trumps possible return: it could cut both ways.",
    "I am not going on Twitter, I am going to stay on TRUTH."
  ]
}