{
  "id": 4258,
  "mediaId": 188,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Rev. Franklin Graham condemns Disney as being 'in the gutter' during blistering rant: A 'moral failure'",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTc0ODQ0OC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY1OTQ0NzY2Nn0.4TjgiPmZSWNEyl_mgM6D9Isy-ESXb37C6c7qMH33dLs/img.jpg?width=1245&quality=85&coordinates=0%2C133%2C0%2C133&height=700",
  "link": "https://www.theblaze.com/news/franklin-graham-disney-ron-desantis",
  "sentiment": "0.285",
  "mediaOutlet": "The Blaze",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Taylor",
  "authorUrl": "https://www.theblaze.com/u/sarahtaylor",
  "termIds": [
    661,
    3690,
    3772,
    4275,
    4464,
    524,
    3152,
    3517,
    2661
  ],
  "sentences": [
    "The post, which has been shared more than 10,000 times at the time of this reporting, read, \"LGBTQ activists are using corporations to force their agenda on the public, and companies may want to take another look at what they are allowing to happen.\"",
    "Disney had a special tax status in the state which they benefitted from in a huge way  but because they came out against the parents of Florida, the governor and legislators have revoked that status.\"",
    "Governor DeSantis will continue doing what's right for Floridians, and that includes standing up for parents' rights, child protection, and a more even playing field for businesses.\"",
    "In a now-viral Facebook post, Graham  pastor and CEO of Samaritan's Purse and the Billy Graham Evangelistic Association  said that the Walt Disney Company is trying to \"flaunt sin.\"",
    "The hour-long program, Walt Disney Presents, that came on every Sunday night was one of the few things as kids that we were allowed to watch on television,\" Graham told the outlet.",
    "Franklin Graham and other Americans who are disappointed that Disney has evidently forgotten the reason for its success  'wholesome family entertainment,'\" Pushaw stated.",
    "The morals of the corporate leadership of Disney today are in the gutter, and they want to redefine family counter to Gods original design and flaunt sin.\"",
    "I'm glad Florida Governor Ron DeSantis is standing for what's right, and I hope Christians will continue to pray for the governor and support him.\"",
    "He added that he believes the company has failed its founder, Walt Disney, and that the company is no longer promoting wholesome family values.",
    "\"I have always appreciated how Walt Disney offered wholesome family entertainment for millions of families around the world.",
    "Ron DeSantis, saying that LGBTQ+ activists are guilty of \"using corporations to force their agenda on the public.\"",
    "DeSantis' spokesperson Christina Pushaw also told the outlet that the administration appreciates Graham's remarks.",
    "\"Given this context, it is especially surprising that Disney would declare war on parental rights in Florida.",
    "In a statement, Graham told Newsweek that he is disappointed at how far he believes Disney has fallen.",
    "\"Thank God for Governor Ron DeSantis who is willing to take a bold stand,\" he insisted.",
    "\"My father was friends with Walt Disney and took me to meet him when I was a child.",
    "He added, \"It's incredible how far Disney has fallen morally from its founder.",
    "Franklin Graham hit out at the Walt Disney Company in support of Florida Gov.",
    "\"Walt Disney had a vision for wholesome family entertainment,\" Graham added.",
    "The people of Florida have revolted, and its going to cost Disney big time.",
    "Those family values are what made Disney such a wealthy and loved company.\"",
    "He signed a photo for me, and I have it hanging on the wall in my office.",
    "The pastor added that his support and gratitude remains with DeSantis.",
    "He continued, calling the company's move a \"moral failure.\"",
    "\"We appreciate the message of support from Rev.",
    "\"Disney,\" Graham insisted, \"has gone too far.",
    "God bless him and the Florida legislature.\"",
    "\"He was committed to the family.",
    "\"We need more leaders like him.",
    "What are the details?",
    "What else?",
    "Rev."
  ]
}