{
  "id": 4262,
  "mediaId": 25,
  "date": "d2022-05-02T00:00",
  "headline": "Florida is the least affordable place to live in the U.S.",
  "image": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/04/26/eac3cec8-b967-4b5f-9c36-30bbbeed4205/thumbnail/620x413/64cead5563f73ab39aebb6da8f4f4b2a/palm-beachgettyimages-1232178524.jpg",
  "link": "https://www.cbsnews.com/news/florida-least-affordable-state-us-miami-tampa-orlando-naples-rent/",
  "sentiment": "0.0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Irina Ivanova",
  "authorUrl": "",
  "termIds": [
    661,
    2582,
    2661,
    2788,
    2820,
    2851,
    2858,
    5066,
    5138
  ],
  "sentences": [
    "Courtesy Jacqueline Fisch\n\"I'm leaving as soon as I can\"\nAlthough Florida is increasingly attractive as a place to live for many Americans, the influx is squeezing many long-time residents, especially low-paid service industry workers and older residents on a fixed income.",
    "\"It's a challenge in today's market because we have such limited housing supply, whether we're talking for-sale housing or for-rent housing, and the higher prices are making it difficult to transition into owning,\" said Hale of Realtor.com.",
    "A slew of recent high-profile corporate moves to Florida, including Goldman Sachs, Elliott Management and Virtu Financial, have boosted Florida's profile, while the pandemic's shift to remote work turbocharged relocations, Boyd said.",
    "Policymakers in Florida have tried to diversify the tourism-heavy economy with new jobs in banking, technology, life sciences and logistics, said John Boyd, principal of the Boyd Co., a site-selection firm in Boca Raton, Florida.",
    "Marco Bello/Bloomberg via Getty Images\nJacqueline Fisch, a 41-year-old author and writing coach, was able to parlay the pandemic's flight to the suburbs in her favor when she moved from central New Jersey to Tampa last year.",
    "Trending News\n Florida is the least affordable place to live in the U.S.\n How to get Google to wipe your phone number from searches\n Iowa egg-laying farm kills 5M chickens, fires 200-plus workers\n Why are gas prices so high?",
    "In the year he's lived there with his girlfriend, Wootan hasn't been able to use his balcony or the pool at the complex because of renovations, and the increase feels like \"adding insult to injury,\" he told CBS MoneyWatch.",
    "\"For deep-pocketed executives, they're sort of playing with house money because there are still bargains in Palm Beach county and Broward county and Miami-Dade, compared to the prices of the Bay Area,\" Boyd noted.",
    "Many Floridians have also struggled to tap the state's rental assistance program, \"leaving families facing eviction and children homeless while promised funds from the state fail to arrive,\" the lawmakers wrote.",
    "Florida's housing woes have been festering for years, with the state enjoying robust population growth while also courting new residents and businesses attracted by the low taxes and an anti-regulation agenda.",
    "Most important, rents and home prices are soaring at their fastest rate in years, raising the financial burden on millions of working- and middle-class households already struggling to afford a place to live.",
    "They put the profits into a property still under construction in north Tampa that cost about $450,000, moving to buy the house with only the foundation poured and beating out three other potential bidders.",
    "In the first three months of this year, record numbers of homebuyers searched for housing outside the metro area where they lived, Redfin research showed, with Miami being the top destination for movers.",
    "Fisch had moved to New Jersey just before the pandemic to be near her husband's Manhattan job, but by the summer of 2020 both were working remotely and their two kids were attending school from home.",
    "At $3,500, meanwhile, the rent on their two-bedroom, two-bathroom townhouse is about 20% more than what they paid in Chicago, although she considers herself fortunate given the alternatives.",
    "Average monthly rents in the metro area, at $2,930, are on par with San Francisco and Los Angeles  and double the level considered affordable for people in the region given local incomes.",
    "Courtesy Michele DeMoske-Weiss\n\"For the first 15 years it's great, it feels like you're on vacation, and then for the second 15 years it's miserable,\" she said of living in Florida.",
    "For individuals, a lack of personal income tax and relatively low property taxes combine with sunny weather to make the state an attractive destination for high-paid professionals.",
    "She said she doesn't love the traffic, but appreciates everything else: \"The beaches, the Gulf, kayaking  being able to be outside, comfortably be outside, almost all the time.\"",
    "CHANDAN KHANNA/AFP via Getty Images\n\"It feels like a greedy, greedy time,\" said Mike Wootan, whose rent on his Miami apartment is jumping nearly $500 a month to $3,000 in June.",
    "\"For migrating tech workers leaving San Francisco, New York, Chicago, being able to save thousands of dollars each year remains a compelling driver to relocate,\" Boyd said.",
    "That deficit, combined with investment firms competing with families for starter homes, means it could take years before market forces allow incomes and rents to re-align.",
    "Rents, which are rising by double digits nationwide, are positively ballooning across Florida, fueled by a surge of people who relocated to the state during the pandemic.",
    "The couple's experience encapsulates several key housing trends that are combining to make it harder  and pricier  for Americans to put a roof over their heads.",
    "\"These Sun Belt markets, and Florida in particular, have topped our lists for the last couple months,\" said Danielle Hale, chief economist at Realtor.com.",
    "\"Today, Miami, Orlando and Tampa have the fastest-growing rents in the country,\" some 40 lawmakers said in an April 28 letter to Governor Ron DeSantis.",
    "Even as the housing sector rebounds, the nation faces a shortfall of 1.3 million homes given the plunge in construction activity during the pandemic.",
    "Prices for single-family homes in the Miami metro area have soared 40% since the start of the COVID-19 pandemic in 2020, while rents have risen 60%.",
    "Indeed, prices that are historically high by Florida standards may not deter someone fleeing even pricier New York or the Bay Area, Boyd said.",
    "Meanwhile, with both rents and home values growing at dizzying rates, it makes it that much harder for renters to even consider buying a home.",
    "Still, Wootan and his girlfriend decided to live with the increase rather than spend money on a move, which would also cost them work days.",
    "The level of inquiries his company gets from firms interested in moving to the state has grown tenfold compared to before the pandemic.",
    "They noted that rents in Central Florida have increased at least 20% since 2021, while in South Florida they've soared as much as 57%.",
    "Michele DeMoske-Weiss, a retired nurse who lives on a fixed income, is ready to bail after 30 years living off and on in the state.",
    "Florida's population is growing faster than any state but Texas: Between 2020 and 2021, 300,000 people moved to the Sunshine State.",
    "Good work if you can get it\nReal estate data confirms that much of the demand for Florida housing comes from buyers out of state.",
    "DeMoske-Weiss, 70, recently downsized when her landlord wanted to hike the rent on her Lake Park two-bedroom to $2,400 a month.",
    "\"I'm getting to the point where I'm really sick and tired of renting, and it doesn't feel like a good time [to buy],\" he said.",
    "Least affordable in the nation\nIn February, Realtor.com designated Miami as America's least affordable place to live.",
    "Many working-class families in South Florida have protested rent hikes that they say could put them on the street.",
    "The couple inquired into two dozen apartments before agreeing to lease a townhouse in north Naples  sight unseen.",
    "A shocking bout of inflation, following the economic spasm caused by the pandemic, is adding to those pressures.",
    "Familiar with the area from friends and family who vacationed there, the couple was excited to move, she said.",
    "Carmen Cuzcano (L) and her husband Pedro Cancino (R) in their house in Hialeah, Florida, on January 19, 2022.",
    "By January, the family's New Jersey home was under contract for $200,000 over what they'd paid for it.",
    "Miami, Orlando and Tampa have also had the fastest-growing rents in the country over the past year.",
    "The family is facing a rent hike from $1,200 to $1,650 a month, which they say they can't afford.",
    "\"People are outbidding homes in Broward county and Palm Beach county by the millions of dollars.",
    "\"It took us up until two weeks before we were out of our apartment in Chicago,\" Starkey said.",
    "She's now thinking of moving to Washington state or Pennsylvania to be close to her children.",
    "Florida's soaring rental costs are now attracting the attention of politicians in the state.",
    "(Housing policy experts consider rents affordable at no more than 30% of pre-tax income.)",
    "\"By day three, it was 75-degree weather and we said, Wait, we can live here,\" Fisch said.",
    "The state explicitly prohibits rent control, which could put a cap on skyrocketing rents.",
    "She moved to a one-bedroom on a lower floor to keep her rent at a more manageable $2,200.",
    "For others, including workers in the state's low-paid tourism sector, leaving is harder.",
    "The 33-year-old publicist moved to Naples, Florida, when her husband got a nearby job.",
    "He's been thinking more about buying a home, but said it's financially out of reach.",
    "\"Our mortgage payment, it went from $4,000 to $1,500,\" Fisch told CBS MoneyWatch.",
    "\"Based on what our clients are telling us, that hybrid model is here to stay.\"",
    "Miami's typical rent takes up a whopping 60% of a household's typical income.",
    "\"We thought we would have no problem finding a place to live,\" Starkey said.",
    "\"It feels like we're on the cusp of another bubble that's going to burst.\"",
    "Sally Starkey thought moving from Chicago to Florida would be easy.",
    "On a Christmas vacation in Florida, the family had a revelation.",
    "She is looking to move out of Florida to a less expensive state.",
    "Michele DeMoske-Weiss, 70, in her Lakeland, Florida, apartment.",
    "\"The only thing that's more expensive here is car insurance.\"",
    "They started planning their move on the trip back.",
    "\"I'm leaving as soon as I can get out,\" she said.",
    "That figure is 45% in Tampa and 37% in Orlando.",
    "Single-family houses in Palm Beach, Florida.",
    "Tampa was third, while Cape Coral was sixth.",
    "\"I'm telling you, we lucked out,\" she said.",
    "Jacqueline Fisch kayaking with her son.",
    "\"I've thought about it almost daily.\"",
    "Wootan, 29, runs a cannabis company.",
    "Here are 3 reasons\nIn:\nFlorida",
    "They moved in in September.",
    "It's a routine occurrence.\"",
    "She was wrong."
  ]
}