{
  "id": 4273,
  "mediaId": 19,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "CEOs Now Fear Caving to Woke Employees After Florida Pushes Back Against Disney",
  "image": "https://media.breitbart.com/media/2022/04/housedisneybillchapek1-640x480.jpg",
  "link": "https://www.breitbart.com/entertainment/2022/05/02/ceos-now-fear-caving-to-woke-employees-after-florida-pushes-back-against-disney/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Ng",
  "authorUrl": "https://www.breitbart.com/author/dng/",
  "termIds": [
    661,
    1241,
    4666,
    524,
    3336,
    2661,
    2851
  ],
  "sentences": [
    "1 concern CEOs have is, When should I speak out on public issues?,? Bill George, former chairman and CEO of Medtronic PLC and now a senior fellow at Harvard Business School, told the newspaper As one CEO said to me, I want to speak out on social issues, but I dont want to get involved in politics. Which I said under my breath, Thats not possible. ?\nDisney originally declined to weigh in on the Florida legislation but CEO Bob Chapek ultimately caved to the demands of a small fringe of far-left employees and issued a groveling apology.",
    "Disney recently lost its valuable self-governing status in Orlando after the company provoked Florida lawmakers by vowing to fight the states Parental Rights in Education law, which prohibits the teaching of sexual and gender ideology to kids in kindergarten through third grade.",
    "The days when woke employees could easily pressure their CEOs into taking left-wing political positions appear to be ending as top business leaders are reportedly seeking to avoid a PR disaster like the one Disney brought on itself in Florida.",
    "The newspaper reported that in private meetings and coaching sessions during the past few weeks, top business leaders have been asking a version of the same question: How can we avoid becoming the next Disney?",
    "Ron DeSantis (R) has alarmed leaders across corporate America and brought about a new round of corporate soul-searching, according to executives and their advisers who spoke to the Wall Street Journal.",
    "pic.twitter.com/efOSOmb47a\n Christopher F. Rufo ? (@realchrisrufo) April 7, 2022\nSince then, Disney said it will devote itself to radical LGBTQ activism and fight similar legislation in other states.",
    "I think probably anybody sitting in a leadership role follows it to some degree,? Julie Schertell, chief executive of Alpharetta, Ga.-based manufacturing company Neenah Inc., told the Journal.",
    "Despite an aggressive mainstream media campaign against the Florida legislation, a recent poll shows that Florida Democrat voters support the Republican-backed law, 52 percent to 36 percent.",
    "He delegated the company's moral authority to the \"LGBTQIA+ Advisory Council\" and now those internal activists have taken him as an ideological hostage.",
    "Watch below:\nNEW: Disney CEO Bob Chapek grovels, apologizes, and pledges to \"be a better ally for the LGBTQ+ community.\"",
    "Disney shares have plummeted more than 30 percent in the past year, making it the worst performing Dow stock.",
    "The controversy has become a cautionary tale for business leaders who want to avoid a similar fate.",
    "Watch below:\nThe Mouse House is also facing boycotts from millions of conservative families.",
    "The war between the Walt Disney Co. and Florida Gov.",
    "Follow David Ng on Twitter @HeyItsDavidNg.",
    "Contact me at dng@breitbart.com",
    "Have a tip?",
    "The No."
  ]
}