{
  "id": 4276,
  "mediaId": 157,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "A third of America is lost to hate: Is it time to move on?",
  "image": "https://www.rawstory.com/media-library/watch-live-tensions-surge-after-donald-trump-cancels-chicago-campaign-rally.jpg?id=24737440&width=1200&coordinates=0%2C15%2C0%2C15&height=600",
  "link": "https://www.rawstory.com/a-third-of-america-is-lost-to-hate-is-it-time-to-move-on/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thom Hartmann",
  "authorUrl": "https://www.rawstory.com/u/thom_hartmann",
  "termIds": [
    661,
    683,
    1147,
    3094,
    2625,
    2945
  ],
  "sentences": [
    "Its terrifying, and it does not have to happen.?\nOf this my friends you can be sure, your views on immigration will have zero impact and zero influence on a House dominated by Democrats who want to replace you, the American voters, with newly amnestied citizens and an ever increasing number of chain migrants.?\nNow the chief of the Border Patrol union, Brandon Judd, is even repeating the America-For-Whites-Only theme, saying:\nI believe that theyre trying to change the demographics of the electorate; thats what I believe theyre doing,?\nAfter the last presidential election white supremacists conspired to keep their leader, Donald Trump, in office by, among other things, trying to murder the Vice President and Speaker of the House in their attempted coup.",
    "But, the pollsters found, fewer than half of white mainline Protestants (43%) and white Catholics (43%) and only 26% of white evangelical Protestants share this view.?\nThese straight white Christians? cheered when Trump began the Birther? movement, terrorized refugee children (many of whom are now lost to trafficking or unknown adoptions), referred to majority-Black nations as shithole countries,? engaged in slurs like Mexican judge,? and repeatedly referred to Black women in Congress as crazy.?\nTheyve been told that as minorities increase their roles in media, politics, and the mainstream of American life and business, that must mean that white opportunities are similarly reduced.",
    "Tucker Carlson, with the approval of the heir to Rupert Murdochs billions, began this in a big way during prime time on Fox News.? On April 8th, for example, he told his viewers:\n[T]he Democratic Party is trying to replace the current electorate, the voters now casting ballots, with new people, more obedient voters from the Third World.?\nFour days later, Carlson explained to his mostly white Fox audience the Great Replacement Theory and how, in his opinion, Democrats were its main advocates:\nDemographic change,? he said, is the key to the Democratic Partys political ambitions.",
    "Racists should no longer be able to hide behind the sheet of just being political.?\nA big step forward happened this past weekend when The New York Times published an extraordinary expos of Tucker Carlsons most racist show in the history of cable news.?\nWhile programming like Carlsons would have been normal in most of America in the 1950s, it should have no place in our more diverse nation in 2022, regardless of how much money it makes Foxs Australian owners.",
    "Their goal is to make you irrelevant.?\nOn April 15th, Carlson echoed the Nazi theory that the pinnacle of evolution was, as Hitler preached, the white (Aryan) race:\nAcknowledge the reality of evolutionary biology,? he demanded, sliding into the evening news buzzwords that every white supremacist in America instantly recognized.",
    "(Theres a reason Trevor Noah chose to call out Chuck Todd)\nAnd then we must turn to the most important work: getting about the business of governing and moving forward, rebuilding this country from the wreckage of 40 years of Reaganism, while leaving his and Trumps bigoted followers to marinate alone in their own putrid stew.",
    "This idea that Democrats, in addition to drinking the blood of children and embracing international? Jewish villains (like George Soros), are actively working to replace? straight white people with people of color and/or LGBTQ folks is particularly poisonous and virulent.",
    "Throughout the past 30 or so years as the larger of these changes have been cemented into law and culture, straight white male backlash has grown to the point where, today, white male supremacy is the core product sold on rightwing television and hate-talk radio/podcasts.",
    "That backlash has gone from passive resistance against integration, to the Tea Party, to openly declaring Barack Obama not a real American,? to rightwing media embracing the Great Replacement Theory? first championed by America First? actual Nazis 80 years ago.",
    "In the 1950s the country was firmly under the control of straight white men:\nBlacks (and other minorities, varying by region) were confined to certain parts of town and were routinely beaten, arrested, or even killed for stepping into whites-only areas.",
    "Full citizenship for LGBTQ people picked up in the 1990s and was finally realized (in law, at least) when Vice President Biden and then President Obama endorsed gay marriage and the Supreme Court ratified it in June of 2015.",
    "An effort to realize our nations founding creed that all men are created equal? has been twisted in the minds of Trump followers into a sinister plot to deny straight white men their God-given role in American society.",
    "The Womens Rights movement picked up steam after the legalization in 1961 of birth control pills and Roe v Wade in 1973, although Republicans have successfully blocked the Equal Rights Amendment to this day.",
    "Most of the old-timers among them have always been racists; the new adherents to the white supremacist ideology were evangelized on unregulated social media and by rightwing hate radio and TV.",
    "Since then, a lot has changed:\nThe browning of America began in a big way in the 1960s with egalitarian changes to our immigration, voting, and public accommodations laws.",
    "Theyve so completely taken over the Republican Party that white supremacist senators felt empowered to attack a highly qualified but Black female judge as pro-pedophile.",
    "Abortion was illegal, and in many states you could go to jail, even if you were married, for possessing birth control of any sort, including condoms, in your own home.",
    "Americans and our institutions should stop normalizing them, as if being a member of the GOP means a person is suddenly above also being a white supremacist bigot.",
    "Women (even white women) couldnt sign a contract, get a credit card or open a bank account in their own names without the signature of a father or husband.",
    "This is particularly important on the Sunday TV political shows, where they routinely show up and are almost never confronted with meaningful questioning.",
    "Instead of looking forward, theyre stuck to a past that will never be revived, no matter how many elections they rig or people they terrorize or kill.",
    "Theyre purging the party of old-line fiscal conservatives? like Liz Cheney; and the savagely bigoted and anti-gay Ron DeSantis is their new savior.",
    "Now its being used to justify political violence (57% of Republicans today say January 6th was patriotic?), election-rigging, and court-packing.",
    "They see American society and the distribution of jobs, wealth, and power within it as a zero-sum game, which it very much is not.",
    "When PRRI asked if Trump had encouraged white supremacists,? a majority of Black (75%) and Hispanic (68%) churchgoers said yes.",
    "Gays and lesbians were routinely beaten, imprisoned, raped, and murdered with no consequence to their tormentors.",
    "In 1951 only about 15% of Blacks were successful in registering to vote in all of the former Confederate states.",
    "With few exceptions, the only minority faces seen in media were those portrayed as either buffoons or criminals.",
    "They may be a third of America, but theyre the lost third, longing for return to a time we will never revisit.",
    "A new language, new values, new biology, new curricula, new social mores and hiring standards and body types.",
    "Racists and bigots must be called out, labeled, and shunned, no matter how wealthy or powerful they may be.",
    "In order to win and maintain power, Democrats plan to change the population of the country.",
    "The America I was born into and grew up in as a kid was a very different place from today.",
    "And then, because that is still not enough change, a whole new system of government.",
    "Schools, restaurants, hotels, and most private businesses were racially segregated.",
    "By and large, there is no hope to redeem or awaken them, and we should stop trying.",
    "Marjorie Taylor Greene says she opposes welfare because women 'need to be married'",
    "Immigration into America was regulated to maintain the countrys racial balance.",
    "Its time to stop normalizing and accommodating the white supremacists among us.",
    "Police had carte blanche to terrorize and kill minorities of all types.",
    "This virulent form of white supremacy has also spread to our churches.",
    "It is real.?\nThey are changing everything, whether we like it or not.",
    " What will the consequences of that change, of that revolution be?",
    "Theyre no longer trying to win you over with their program.",
    " They dont even really care about your vote anymore.",
    "This article was paid for by Raw Story subscribers.",
    "IUDs and birth control pills did not exist.",
    "CBS just put one of them on its payroll.",
    "In your bones, you know the answer.",
    "A brand-new national population.",
    "Prefer to give a one-time tip?",
    "Try us and go ad-free for $1.",
    "These people are lost.",
    "Not a subscriber?",
    "Click here."
  ]
}