{
  "id": 4282,
  "mediaId": 65,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "MSNBC warns of right-wing extremists weaponizing 'motherhood'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/dfc4f3e8-eb27-4b1f-97ec-638f28cb98df/57315dbc-bf77-43c2-bbf4-a88b9e6b8863/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/msnbc-right-wing-extremists-motherhood",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lindsay Kornick",
  "authorUrl": "https://www.foxnews.com/person/k/lindsay-kornick",
  "termIds": [
    661,
    1758,
    3907,
    4459,
    327
  ],
  "sentences": [
    "In Mein Kampf, Hitler fixated on boxing and jujitsu, believing they could help him create an army of millions whose aggressive spirit and impeccably trained bodies, combined with fanatical love of the fatherland, would do more for the German nation than any mediocre tactical weapons training,\" she wrote.",
    "\"Themes about the need to protect children are especially powerful in drawing women into extreme and even violent action, as illustrated by the rise of conspiracy theories and propaganda that mobilize mothers around themes of child exploitation and protection,\" she wrote.",
    "\"Motherhood plays an especially key role in the kinds of rhetorical strategies far-right extremists use, including the kinds of utopian propaganda that calls on followers to reject modernity and embrace traditional values and roles,\" Miller-Idriss wrote.",
    "You made us angry all by yourselves,\" RedState deputy managing editor Kira Davis wrote\nMiller-Idriss penned a similar article in March claiming that \"fitness\" was being used to recruit far-right extremists.",
    "MSNBC GUEST BLASTS GOP WITCH HUNT CULTURE BILLS: INFLICTING TRAUMA ON YOUNG PEOPLE\nThe article was criticized on Twitter for claiming that the right is using motherhood to bolster extremists.",
    "Rather, motherhood is used to justify womens engagement in activism and to depoliticize their actions by positioning them as acting on behalf of their children and families.\"",
    "However, Miller-Idriss focused primarily on mothers being drawn in to \"conspiracy theories and propaganda\" set up by QAnon supporters and Jan. 6 Capitol rioters.",
    "Parental rights and education became top issues for voters during the Virginia gubernatorial election when Republican Glenn Youngkin defeated former Gov.",
    "Ron DeSantis signed the Parental Rights in Education bill into law, which faced intense backlash from Democrats, their allies in the media, and Disney.",
    "MSNBC opinion columnist Cynthia Miller-Idriss penned an article titled \"How right-wing extremists weaponize the idea of motherhood\" on Friday.",
    "Miller-Idriss argued women and especially mothers \"play a more significant role in far-right extremist movements than is often acknowledged.\"",
    "Because motherhood itself is being used to manipulate women and to recruit, mobilize and justify violent and antidemocratic actions.\"",
    "She concluded, \"Its easy to understand why calling on women to protect their children from unimaginable harm is effective.",
    "\"But women arent called upon to be entirely passive as mothers, or to be relegated completely to domestic tasks.",
    "RealClearPolitics Founder Tom Bevan tweeted, \"The left thinks we have a crisis of Mom-supremacy in America.\"",
    "\"Physical fitness has always been central to the far right.",
    "The right doesn't need to recruit angry mothers.",
    "You progressives have weaponized our children.",
    "But thats also what makes it so dangerous.",
    "Did you really think we wouldn't notice?",
    "\"We have not weaponized motherhood.",
    "More recently, Florida Gov.",
    "Terry McAuliffe."
  ]
}