{
  "id": 4283,
  "mediaId": 136,
  "date": "d2022-05-01T20:17",
  "headline": "Trump 'Should Not Define Our Future': GOP's Asa Hutchinson Weighs 2024 Bid",
  "image": "https://d.newsweek.com/en/full/2029118/trump-should-not-define-our-future.webp?w=790&f=5f9593be1d463f3d747690bcf5e976cb",
  "link": "https://www.newsweek.com/trump-should-not-define-our-future-gops-asa-hutchinson-weighs-2024-bid-1702529",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fatma Khaled",
  "authorUrl": "https://www.newsweek.com/authors/fatma-khaled",
  "termIds": [
    661,
    1147,
    1231,
    2087,
    2329,
    428,
    2551,
    2661,
    5109
  ],
  "sentences": [
    "\"You've got to get through this year, but that's an option that's on the table,\" Hutchinson, told CNN's Dana Bash on State of the Union in response to her question about whether or not he is considering on running in the next election.",
    "He said at the time that Trump \"should not define our future\" and added that the GOP needs \"to respond and identify with the issues that gave him [Trump] the first election and gave him support throughout his presidency.\"",
    "GOP Florida Governor Ron DeSantis is also a potential nominee for the 2024 race as his popularity continues to grow among his own party despite his recent law restricting LGBTQ rights and his ongoing feud with Disney.",
    "When Bash asked him whether he would still consider running even if Trump decides to go after the 2024 GOP nomination, the governor said that it wouldn't be a \"factor\" in his decision-making process.",
    "Republican Arkansas Governor Asa Hutchinson said Sunday that running for the 2024 presidential election is \"an option that's on the table\" even if former President Donald Trump decides to run.",
    "Last year, the Arkansas governor told Bash that he would not support Trump if he decided to run for president again, which was a shift from his past support for Trump's 2020 reelection bid.",
    "Meanwhile, Hutchinson on Sunday took a hit at the Florida governor over his recent law stripping Disney's Reedy Creek Improvement District from its self-governing and tax privileges.",
    "Let's do the right thingit's a fair debate about these special tax privilegesbut let's not go after businesses and punish them because we disagree with what they said.\"",
    "\"First of all Disney has handled this very poorly...but I don't believe that government should be punitive against private businesses because we disagree with them.",
    "The law came after Disney said it would work to repeal Florida's enacted Parental Rights in Education law, which is also dubbed as the \"Don't Say Gay\" bill.",
    "DeSantis dismissed any questions late last year about seeking the presidency by saying: \"I'm not considering anything beyond doing my job.",
    "In one survey, DeSantis appeared to lead all Republican candidates in a hypothetical 2024 GOP primary without Trump.",
    "However, polls show that he is leading all GOP candidates as long as Trump doesn't seek the Republican nomination.",
    "Trump repeatedly hinted that he would run in 2024 ever since he lost the 2020 election to President Joe Biden.",
    "\"I think he did a lot of good things for our country, but we need to go a different direction,\" he said.",
    "\"To me, that's the old Republican principle of having restrained government.",
    "That's not the right approach either,\" Hutchinson said.",
    "We've got a lot of stuff going on in Florida.\""
  ]
}