{
  "id": 4286,
  "mediaId": 98,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Trevor Noah roasts pretty much everyone at White House Correspondents Dinner",
  "image": "https://ca-times.brightspotcdn.com/dims4/default/822b6c1/2147483647/strip/true/crop/5389x3593+0+0/resize/840x560!/format/webp/quality/90/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd0%2F79%2F656c21b34ccf8c936d9935db9bf8%2Fbiden-correspondents-dinner-34039.jpg",
  "link": "https://www.latimes.com/entertainment-arts/tv/story/2022-05-01/white-house-correspondents-dinner-trevor-noah-jokes",
  "sentiment": "0",
  "mediaOutlet": "LA Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christi CarrasStaff Writer",
  "authorUrl": "https://www.latimes.com/people/christi-carras",
  "termIds": [
    661,
    2303
  ],
  "sentences": [
    "That should have been a pretty big sign.?\nThroughout his 25-minute performance, Noah managed to lampoon a striking number of media and political figures  including but not limited to Donald Trump, Jeffrey Toobin, Tucker Carlson, Laura Ingraham, Chris Cuomo, Kyrsten Sinema, Kellyanne Conway, Madison Cawthorn, Ron DeSantis, Jen Psaki, First Lady Jill Biden and of course, President Joe Biden.",
    "Daily Show? host Trevor Noah pulled no punches while headlining the annual White House Correspondents Dinner on Saturday night in Washington, D.C.\nFor the first time since the beginning of the COVID-19 pandemic, politicians and members of the press gathered in person to dine and get roasted by a comedian together at the Washington Hilton hotel.",
    "I think everyone will agree that its actually nice to once again have a president whos not afraid to come to the White House Correspondents Dinner and hear jokes about himself,? Noah said.",
    "It is my great honor to be speaking tonight at the nations most distinguished superspreader event,? Noah joked at the top of his set, which aired Saturday on CNN and C-SPAN.",
    "... You guys spent the last two years telling everyone the importance of wearing masks and avoiding large indoor gatherings.",
    "If you didnt come, I totally would have understood, because these people have been so hard on you  which I dont get.",
    "Gas is up, rent is up, food is up  everything!?\nWatch Noahs full remarks below.",
    "Then the second someone offers you a free dinner, you all turn into Joe Rogan?",
    "Ever since youve come into office, things are really looking up.",
    "No, for real people, what are we doing here?",
    "I mean, Dr. Fauci dropped out.",
    "..."
  ]
}