{
  "id": 4288,
  "mediaId": 65,
  "date": "d2022-05-01T16:51",
  "headline": "GOP governor rips DeSantis' 'punitive approach' toward Disney after parental rights dust-up",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/ac232f0b-7426-4203-a4c6-07081cb7ba8c/3fb549dc-dfe3-4d62-8ff9-85a3c98d7468/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/desantis-disney-punitive-approach-to-business-asa-hutchinson",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Danielle Wallace",
  "authorUrl": "https://www.foxnews.com/person/w/danielle-wallace",
  "termIds": [
    661,
    1231,
    1486,
    428,
    524,
    611,
    2551
  ],
  "sentences": [
    "After recently speaking at the Politics & Eggs event in New Hampshire, a traditional stop for presidential hopefuls, Hutchinson confirmed to CNN that he was mulling a presidential run in 2024, and that a potential scenario of former President Donald Trump entering the race would not sway his decision one way or the other.",
    "\"Secondly, the law that was passed is, to me, common sense that in those grades, those lower grades, you shouldn't be teaching sexual orientation and those matters that should not be covered in  at that age,\" Hutchinson, who has served as the Republican governor of Arkansas since 2015, said.",
    "((Photo by Win McNamee/Getty Images))\nHe quickly pivoted, however, to also adding blame to DeSantis for signing legislation last month stripping Walt Disney World of a decades-old special agreement that allowed the theme park to govern itself.",
    "The bill prohibits classroom discussions on sexual orientation and gender identity for elementary schoolchildren from kindergarten to third grade.",
    "Ron DeSantis, a fellow Republican governor from Arkansas weighed in on Sunday criticizing what he viewed as a \"punitive approach to business.\"",
    "He first criticized how Disney took a stance on new state parental rights legislation dubbed by critics as the \"Dont Say Gay\" bill.",
    "\"But I don't believe that government should be punitive against private businesses because we disagree with them.",
    "Danielle Wallace is a reporter for Fox News Digital covering politics, crime, police and more.",
    "But let's not go after businesses and punish them because we disagree with what they said.\"",
    "\"And so, to me, that's the old Republican principle of having a restrained government.\"",
    "Story tips can be sent to danielle.wallace@fox.com and on Twitter: @danimwallace.",
    "Asa Hutchinson began, appearing on CNNs \"State of the Union.\"",
    "\"First of all, Disney has handled this very poorly,\" Gov.",
    "That's not the right approach either,\" Hutchinson said.",
    "\"It's a fair debate about these special tax privileges.",
    "CNN host Dana Bash pressed, \"So DeSantis overstepped?\"",
    "\"I disagree with a punitive approach to businesses.\"",
    "Amid an ongoing feud between Disney and Florida Gov.",
    "\"Well, I disagree with it,\" Hutchinson responded.",
    "\"Let's do the right thing, he said.",
    "I understand that debate."
  ]
}