{
  "id": 4291,
  "mediaId": 136,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "GOP Governor Hutchinson Blasts DeSantis Over Disney Fight in Florida",
  "image": "https://d.newsweek.com/en/full/2029052/asa-hutchinson.webp?w=790&f=0c7db0ed9658394cdf2f4bbfbeb38ec0",
  "link": "https://www.newsweek.com/gop-governor-hutchinson-blasts-desantis-over-disney-fight-florida-1702503",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Natalie Colarossi",
  "authorUrl": "https://www.newsweek.com/authors/natalie-colarossi",
  "termIds": [
    661,
    1231,
    428,
    524,
    2551,
    2661
  ],
  "sentences": [
    "Last week, the Florida governor revoked a 55-year agreement with Disney that gave it special privileges and tax breaks in the state after the company voiced opposition to HB 1557, which critics have unofficially named the \"Don't Say Gay\" bill.",
    "During an interview on CNN's State of the Union, Hutchinson said he supports Florida's controversial legislation, but said the state should not have punished the entertainment company for disagreeing with it.",
    "Last week, Disney's district argued that the state can't terminate its privileges unless the state pays off $1 billion debt, as part of the state's pledge to bondholders per a 1967 act.",
    "When asked if DeSantis overstepped his authority, Hutchinson continued: \"I disagree with a punitive approach to businesses...we should not be punishing them for their private actions.\"",
    "\"You're a corporation based in Burbank, California, and you're gonna marshal your economic might to attack the parents of my state,\" DeSantis said in a statement earlier this week.",
    "Once the bill was signed into law, Disney said that it \"should never have passed\" and announced that its goal would be to have the legislation repealed or struck down in court.",
    "Let's do the right thingit's a fair debate about these special tax privilegesbut let's not go after businesses and punish them because we disagree with what they said.\"",
    "\"First of all Disney has handled this very poorly...but I don't believe that government should be punitive against private businesses because we disagree with them.",
    "Republican Arkansas Governor Asa Hutchinson on Sunday criticized Florida Governor Ron DeSantis for fighting with Disney over the state's \"Don't Say Gay\" bill.",
    "Dan Eberhart, a prominent GOP donor with close ties to the Florida governor, said he \"may have gone too far\" in revoking the company's special tax privileges.",
    "The bill was signed into law in late March and restricts \"classroom discussion about sexual orientation or gender identity in certain grade levels.\"",
    "While DeSantis has garnered significant support from Republicans, others have joined Hutchinson in disagreeing with his decision to punish Disney.",
    "Disney was initially silent on the issue, but took a stance against the legislation in early March after facing widespread public backlash.",
    "Critics and activists have widely condemned the law by arguing that it will cause harm to LGBTQ+ students in school environments.",
    "DeSantis, in turn, blasted the company for being \"woke\" and vowed to fight back against its \"provocations.\"",
    "The company urged DeSantis to halt the legislation and paused all of its political donations in the state.",
    "\"To me, that's the old Republican principle of having restrained government.",
    "\"We view that as a provocation and we're going to fight back against that.\"",
    "Newsweek contacted DeSantis' office for additional comment.",
    "That's not the right approach either,\" the governor said."
  ]
}