{
  "id": 4293,
  "mediaId": 195,
  "date": "d2022-05-01T12:00",
  "headline": "Joe Bidens Ministry of Truth",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/e55cc27e0fc142b591d40e29f4f11ac1.jpg?strip=1&w=640",
  "link": "https://thehill.com/opinion/white-house/3472878-joe-bidens-ministry-of-truth/",
  "sentiment": "0.0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Concha",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    1154,
    1647,
    2066,
    2087,
    4596,
    549,
    3200
  ],
  "sentences": [
    "And heres what she tweeted in recent days about Elon Musks purchase of Twitter: Last week I told @NPRMICHEL: I shudder to think about if free speech absolutists were taking over more platforms, what that would look like for the marginalized communities  which are already shouldering  disproportionate amounts of this abuse.?\nThis pro-Steele anti-Musker will report to Mayorkas, who said in congressional testimony this week that he inherited a broken and dismantled? immigration and border-security system from the Trump administration and that only Congress can fix this.? He added: Yet, we have effectively managed an unprecedented number of non-citizens seeking to enter the United States.?\nBorder crossings have skyrocketed under Biden-Mayorkas, surpassing an estimated 2 million in 2021.",
    "Theres absolutely a commission thats being discussed, but it seems to be more investigating in style rather than truth and reconciliation,? Rep. Alexandria Ocasio-Cortez (D-N.Y.) said in an Instagram video in 2018. I do think that several members of Congress in some of my discussions have brought up media literacy because that is part of what happened here.",
    "I think that theres a lot of people more concerned about being precisely, factually and semantically correct than about being morally right.?\nWhat an utterly fascinating way to define truth: Hey, its not that important to be factually correct, as long as a person is, from their own perspective, morally right.",
    "When you blame Russian President Vladimir Putins invasion of Ukraine for inflation that has been rising for well over a year, or blame Trump for the current state of the U.S. border, or say democracy is at stake if voting rights arent federalized, then the arbiters-of-truth business isnt one it should be in.",
    "Maybe Mayorkas can add AOC  who really seemed to care about conditions at border facilities until a Democratic president made her suddenly lose her voice  as an honorary spokesperson for the new Ministry of Truth.?\nThe Biden administration says it simply wants to battle misinformation.",
    "The guy whose agency is launching a Disinformation Governance Board also, without evidence, accused his own border patrol agents of whipping migrants, saying that it painfully conjured up the worst elements of our nations ongoing battle against systemic racism.?\nYou get the point.",
    "The New York Times and Washington Post, which both pushed the same conspiracy theory that the laptop came from Russia to hurt Joe Biden and help Donald Trump, recently confirmed that the laptop and its contents belong to Hunter Biden.",
    "Mayorkas and Jankowicz are two of the last people who should be leading any Ministry of Truth.? And the U.S. government shouldnt even have considered creating something like this to be run by partisans with political agendas.",
    "Heres what Mayorkass choice to helm Bidens Ministry of Truth? once said about Hunter Bidens infamous laptop, which many on the left and in the media dubbed as Russian disinformation in the weeks before the 2020 election.",
    "The Biden administrations Department of Homeland Security (DHS) announced this week that it has launched what is being dubbed a Disinformation Governance Board, to combat misinformation.?\nNo, really.",
    "Heres what she said in a 2018 60 Minutes? interview, when asked about how shed been fact-checked about her dubious public comments:\nPeople want to really blow up one figure here or one word there.",
    "Were going to have to figure out how we rein in our media environment so you cant just spew disinformation and misinformation.?\nRein in our media environment?  how comforting, coming from AOC.",
    "The person chosen to lead this new Committee of Public Information? under Mayorkas is Nina Jankowicz, who calls herself a disinformation fellow? and a Russian disinformation expert.",
    "The guy presiding over the worst border crisis of our lifetimes, who publicly denies it is a crisis at all, while privately admitting it is?",
    "A federal investigation into Hunter is expanding, with reports that he may have violated money-laundering, tax and foreign lobbying laws.",
    "It was the Biden administration that stopped border-wall construction and ended an effective Remain in Mexico? policy for asylum-seekers.",
    "Heres what she tweeted about a guest appearance that Steele made on something called the Infotagion podcast: Listened to this last night.",
    "You can only imagine the exclamations about a chilling attack on democracy? and totalitarianism rearing its head in the Sunshine State.",
    "Well, it turns out the laptop from hell really is just that for Hunter Biden and possibly his father, the sitting president.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Who better to give more\nresponsibility  in a democracy that largely rejects government intervention over free speech?",
    "His allegations of Russian collusion with the Trump campaign, of Russian hookers and pee tapes?  also not credible.",
    "Voters deserve that context, not a [fairy] tale about a laptop repair shop,? she also tweeted in October 2020.",
    "Chris Steele (yes THAT Chris Steele) provides some great historical context about the evolution of disinfo.",
    "Ron DeSantis (R-Fla.) had decided to create a Disinformation Governance Board? in the state of Florida.",
    "And to lead that effort, lets say he chose someone who once openly pushed a partisan conspiracy theory.",
    "Yet Jankowicz once recommended that we listen to THAT Chris Steele? when it comes to disinformation.",
    "It was Biden who as a presidential candidate urged migrants to surge the border?  and they listened.",
    "The new head of the Ministry of Truth? isnt tweeting much about that investigation these days.",
    "Not to mention that the emails dont need to be altered to be part of an influence campaign.",
    "A government agency creating a ministry of truth? to combat what it deems misinformation?",
    "We should view it as a Trump campaign product,? Jankowicz said of the story at the time.",
    "Yet this horrible idea apparently has been in the works for some time among Democrats.",
    "Jankowicz was also a big fan of the now-discredited (and laughable) Steele dossier.",
    "And its going to fall under the leadership of DHS Secretary Alejandro Mayorkas?",
    "Worth a listen.?\nSteeles sources have since been proven not to be credible.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "I would argue that theyre missing the forest for the trees.",
    "The best way to start might be to purchase a large mirror.",
    "The numbers werent remotely near those under Trump.",
    "This is always a fun game to play: Lets say Gov.",
    "Joe Concha is a media and politics columnist.",
    "What could possibly go wrong?",
    "Why is that?"
  ]
}