{
  "id": 4297,
  "mediaId": 409,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "The Disney Executive Who Donated $10 Million to Help Trump in 2020",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/04/mickey-mouse-disney-world-2003.jpg?w=1200",
  "link": "https://www.nationalreview.com/corner/the-disney-executive-who-donated-10-million-to-help-trump-in-2020/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Geraghty",
  "authorUrl": "https://www.nationalreview.com/author/jim-geraghty/",
  "termIds": [
    661,
    1147,
    4478,
    337,
    405,
    524,
    3115,
    2661
  ],
  "sentences": [
    "They have both donated the legal maximum to Georigia GOP senatorial candidate Herschel Walker, Florida congressional candidate Brady Duke and Florida Rep. Brian Mast, as well as large donations to the National Republican Congressional Committee and Valor PAC, a leadership PAC associated with Mast.",
    "That $10.5 million comes from Ike Perlmutter, formerly the CEO of Marvel Entertainment and still the chairman of that entity; Perlmutters wife, Laura, also donated millions; she donated $22 million in total to right-of-center groups in the 2020 cycle.",
    "A great irony that I believe went unobserved and unmentioned, in the recent controversy surrounding Disney, and its fight with Florida governor Ron DeSantis and Republicans in general .",
    "In the 2020 cycle, America First Action committee was a super PAC dedicated to supporting federal candidates who back the policy agenda of President Donald Trump.",
    "When you add up all of the PACs donations received in the cycle, and sort the donations by donor employer, the single biggest employer is .",
    "However, that does not mean that the Disney corporation is teeming with closeted fans of Donald Trump.",
    "The Perlmutters are still active donors this cycle.",
    "the Walt Disney Company, at $10.5 million.",
    ".",
    ".",
    ".",
    "."
  ]
}