{
  "id": 4303,
  "mediaId": 132,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "What critical race theory is  and what it is not",
  "image": "https://cdn.newsday.com/image-service/version/c:MWE2NmFkM2EtNzRhYi00:NmI4ODFi/desantis-florida.jpeg",
  "link": "https://www.newsday.com/opinion/commentary/guest-essays/critical-race-theory-desantis-l7k9p8dl",
  "sentiment": "0",
  "mediaOutlet": "Newsday",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sol Wachtler",
  "authorUrl": "",
  "termIds": [
    661,
    683,
    4560,
    2661,
    2945
  ],
  "sentences": [
    "That some are inherently sinful, and some are inherently saintly.? CRT has nothing to do with teaching K-12 students to hate one another or urging them to become members of the gay community or grooming them to become pedophiles.? Those false definitions have created a cultural bogeyman which has divided religious and civil communities, caused near-riots at school board meetings, and encouraged the banning of books such as To Kill a Mockingbird? and Of Mice and Men.?\nThe political right is doing what politicians of both parties often do: Take a word, phrase or three-word bumper sticker,? make people afraid of it, then use it as a rallying cry to raise dollars and votes.",
    "The new definition of CRT is the creation of Christopher Rufo, a conservative political gadfly who says his goal is to have the public read something crazy in the newspaper and immediately think critical race theory.? He goes on: We have recodified the term and will recodify it to annex the entire range of cultural constructions that are unpopular with Americans.?\nAll things unpopular with Americans?  things that bigots, homophobes and misogynists detest  are demonized by calling them products of CRT.",
    "Just telling of the atrocious crime against 14-year-old Emmet Till, for whom the legislation is named, might subject teachers to fines because the story of Tills lynching might make students feel uncomfortable.?\nConstitutionally questionable laws enacted in Florida and other southern states are designed to address a manufactured and nonexisting problem for the purpose of sanitizing our history and isolating members of the gay community.",
    "DeSantis says children should not be taught matters which make them feel uncomfortable.?\nSouthern constituencies and the powerful Southern Baptist Conference do not want children to be taught about slavery and the painful black laws? of Reconstruction which still mar parts of our Southern landscape and politics.",
    "This debate, manifest in our decades-old struggle over affirmative action and other concerns involving race, has led to constructive societal changes; however, that debate recently has been clouded as CRT has become redefined by the political right to exploit racial and homophobic animosities.",
    "Those opposed to CRT believe in a meritocracy: If someone doesnt succeed in life, that persons failure should not routinely be attributed to racism? that still exists in our institutions but rather to a lack of a proper family environment, education, achievement, or ambition.",
    "For more than 25 years, critical race theory has been taught in law schools with respect to historical patterns of racism in this country?  which, the theory claims, is responsible for circumscribing the success achievable by minorities.",
    "DeSantis spokeswoman noted the law should be more accurately described as an Anti-Grooming Bill,? adding that if you are against the bill, you are probably a groomer? of children  linking the LGBTQ community with predatory behavior.",
    "By creating ominous images and imagined dangers, they diminish the ability of teachers to teach and stunt the remarkable progress we have made as a nation to grant rights and privileges to all citizens.",
    "Now that it has been signed into law, teachers in states which have banned critical race theory? wonder whether they will be able to discuss the symbolic significance of this new anti-lynching law.",
    "This guest essay reflects the views of Sol Wachtler, former chief judge of the New York State Court of Appeals and adjunct professor at Touro Law School.",
    "This guest essay reflects the views of Sol Wachtler, former chief judge of the New York State Court of Appeals and adjunct professor at Touro Law School.",
    "However, learning about how the nation has remedied the sins of our past, and continues to do so, should be a point of pride not discomfort.",
    "Ron DeSantis, who has made himself the spokesman for Anti CRT legislation,? is responsible for the Dont Say Gay? law in Florida.",
    "A contrary view holds that although there are some bigots in this country, institutional racism? has been almost eliminated.",
    "CRT is not what Tucker Carlson of Fox News says it is: Theyre teaching that some races are morally superior to others.",
    "For over 100 years, Southern senators blocked legislation to make lynching a federal hate crime.",
    "Gov."
  ]
}