{
  "id": 4308,
  "mediaId": 136,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Trevor Noah Bashes Biden, Dems, Media and GOP: Here's Everything He Said",
  "image": "https://d.newsweek.com/en/full/2029022/joe-biden-trevor-noah.webp?w=790&f=c420d54129fd9ae42a0d3fe5e5f4b030",
  "link": "https://www.newsweek.com/trevor-noah-bashes-biden-dems-fox-news-gop-heres-everything-he-said-1702478",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott McDonald",
  "authorUrl": "https://www.newsweek.com/authors/scott-mcdonald",
  "termIds": [
    661,
    683,
    906,
    2087,
    2250,
    2282,
    2429,
    4262,
    428
  ],
  "sentences": [
    "He also ridiculed CNN, Chris Cuomo, MSNBC, Florida Governor Ron DeSantis, Texas Governor Greg Abbott, Republicans in general, newsmaking Democrats in general and, well, pretty much everyone he could within an allotted time frame.",
    "\"Mr. President thank you for being here, thank you for having me here and I was a little confused about why me, then I was told that you get your highest approval ratings when a bi-racial African guy is standing next to you.",
    "I might add you know he got a bipartisan infrastructure bill passed that we do everything from fixing America's road and bridges to modernizing school buses which Matt Gaetz his girlfriend is very excited about.\"",
    "Noah said he was \"nervous\" about hosting such an event after the Oscars, in which Will Smith didn't like a joke from Chris Rock, and then Smith stormed the stage to slap Rock across the face.",
    "But you know moving to MSNBC is going to be a big switch up for you because right now your current job is to make Biden Administration look as good as possible, you know, at all costs.",
    "Noah jokingly said to the wine-imbibing crowd that if they needed a ride home, they could reach Abbott, who recently sent illegal immigrants from Texas to Washington, D.C. on a bus.",
    "The annual White House Correspondents Association dinner met for the first time since 2019 on Saturday night, and the first time with a sitting president since Barack Obama in 2016.",
    "Biden acknowledged he was about to get roasted before not just the 2,600 in attendance in the Washington hotel ballroom, but before millions watching on cable.",
    "\"What those people don't understand is that you guys have integrity, you would never allow personal connections to affect your ability to be good journalists.",
    "\"President Biden has led the country through some really dark times since he took the office, the covid pandemic, the war in Ukraine, the launch of CNN plus.",
    "I was like what if I make like a really mean joke you know about like Kellyanne Conway and then her husband rushes up on the stage and thanks me.\"",
    "\"Interesting fact, even as first lady Dr. Biden continued her teaching career, yeah the first time a presidential spouse has ever done so ever.",
    "Biden then got praised for everything \"looking up\" during his administration, but immediately slammed for \"up\" as in gas, inflation and rent.",
    "\"I'll be honest if you didn't come, I totally would have understood yeah, because these people have been so hard on you which I don't get.",
    "\"A quick note before people order their Ubers home tonight Governor Greg Abbott is generally providing free buses for the Telemundo table.",
    "Noah, who's a bi-racial South African, referred to his own race as to why he was selectedobviously making reference to Barack Obama.",
    "Apparently, just being on C-SPAN the reasons were too high and she wanted more of a challenge, you know, want to switch things up.",
    "Noah didn't take the podium until President Joe Biden finished his monologue mixed with jokes and other things of serious nature.",
    "Noah bragged on the job that news journalists do, but then he took a whack at CNN, particularly former host Chris Cuomo.",
    "Whoever thought we'd see the day in American politics when a senator could openly bisexual, but closeted Republican huh?",
    "... No, it really has been tough first year for you Mr. President, and surely you must be a little worried about 2024.",
    "Now, you might think it's because she loves teaching much it's actually because she still paying her student debt.",
    "Biden said free speech against the president in America wouldn't get the comedian jailed like \"they do in Russia.\"",
    "The comedian's jokes quickly shifted back to GOP governor's Greg Abbott of Texas and Ron DeSantis of Florida.",
    "White House Press Secretary Jen Psaki wasn't spared either as she was ridiculed for catching COVID-19 again.",
    "Noah then suggested that first lady Dr. Jill Biden had voted for Bernie Sanders during the last election.",
    "Noah went on to thank the politicians, journalists, celebrities, award winners and others in attendance.",
    "I love watching your shows you know, when Trump was in office your shows were all about how bad he was.",
    "Noah then began his comedic assault on everyone, bringing laughter and even \"oohs\" throughout his bit.",
    "And don't forget he's also had some major legislative successes you know in his first year in office.",
    "He won't tell people if he got the booster, yeah, or as they say in Florida, don't ask, don't tell.",
    "I really don't know I think ever since you've come into office things are really looking up.",
    "The comedian said he would change his routine, bringing laughter from the jam-packed room.",
    "So what did you say Joe, I'm glad that I could do my part and hopefully this will work.\"",
    "I might roast gently you know, like a pair of testicles on the Tucker Carlson special.",
    "Then he hit DeSantis' recently-signed \"Don't Say Gay\" bill in the Sunshine State.",
    "And now that Biden's in office, your shows are all about how bad Trump was.",
    "\"By the way, MSNBC can I just say you guys are doing great work you know.",
    "\"Word on the streets is actually Jen Psaki is going to MSNBC next month.",
    "\"I want you to understand, I'm not here to tear anybody down okay yeah.",
    "Comedian Trevor Noah was the guest host, and he didn't disappoint.",
    "If it's true congratulations to Jen and your big career change.",
    "\"I'm a little bit worried about tonight I won't lie you know.",
    "Noah then switched gears to snipe at the sitting president.",
    "The South African comedian bashed the current president.",
    "\"Jen, like your boss hooked us all up with free tests.",
    "I'm not doing this just for the attention all right.",
    "He took swipes at the GOP and Fox News, as expected.",
    "Here are things Noah said throughout the night.",
    "Yeah I guess you should have voted for Bernie.\"",
    "\"Let me ask you how do you keep getting COVID?\"",
    "Noah turned that into a Kellyanne Conway joke.",
    "I'm a comedian, not Kyrsten Sinema all right.",
    "And by the way give it up for Kyrsten Sinema.",
    "You know, gas is up, rent is up, food is up.",
    "That's progress, that's progress.\"",
    "He ridiculed the former president.",
    "\"Are you serious, Mr. President?",
    "He threw haymakers at everyone.",
    "Does he not have your address?",
    "Isn't that right Chris Coumo?",
    "\"Ron is playing a cool man.",
    "Very classy, very classy.\"",
    "Where is Chris by the way?",
    "Consistency is important.\"",
    "I'm sorry about that Jill.",
    "What's going on there?",
    "I won't get arrested?\"",
    "Couldn't make it?\"",
    "I'll see you Ron.\"",
    "Congratulations.",
    "Noah asked.",
    "Am I right?",
    "Is he here?",
    "Noah asked.",
    "Noah said.",
    "..."
  ]
}