{
  "id": 4311,
  "mediaId": 136,
  "date": "d2022-05-01T04:07",
  "headline": "Biden is 'Happy for Brandon' Who is 'Having a Really Good Year'",
  "image": "https://d.newsweek.com/en/full/2029019/president-biden-attends-correspondents-dinner.webp?w=790&f=ff0efdc1496004167cfa365eb71333ae",
  "link": "https://www.newsweek.com/biden-happy-brandon-who-having-really-good-year-1702475",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Margaret Weaver",
  "authorUrl": "https://www.newsweek.com/authors/margaret-weaver",
  "termIds": [
    661
  ],
  "sentences": [
    "President Joe Biden joked on Saturday that he was \"happy for Brandon\" who is \"having a really good year\" during a skit at the White House Correspondents' Dinner in Washington, D.C., as the event roared back to life for the first time in three years.",
    "Biden told several other self-deprecating jokes as he spoke from the Washington Hilton Hotel, where around 2,600 politicians, journalists, celebrities and guests were in attendance at the event held by the White House Correspondents' Association.",
    "Biden also addressed the pandemic as COVID-19 concerns surrounded the event, saying he attended to \"show the country we're getting through this pandemic\" and that attendees had to prove they were fully vaccinated and boosted.",
    "Founded in 1914, the WHCA promotes \"excellence in journalism as well as journalism education,\" working \"to ensure robust news coverage of the president and the presidency,\" according to the organization.",
    "Regarding his age, he suggested he was there the first time a president attended the dinner in 1924, saying he gave Calvin Coolidge advice that night, having just been elected to the U.S. Senate.",
    "We had a horrible plague followed by two years of COVID,\" he said, taking a swipe at former President Donald Trump and noting it would have been a \"real coup\" had Trump attended this year.",
    "The joke referenced the viral saying that has origins at a Sparks 300 race at Talladega Superspeedway on Oct. 2, 2021, when sportscaster Kelli Stavast misheard chants from the crowd.",
    "The dinner, an annual event since 1921, \"celebrates Americans' freedoms and the working people who bring the news to the world,\" Portnoy said earlier this week in a news release.",
    "\"Folks I'm not here to roast the GOP, that's not my style besides there's nothing I can say about the GOP that Kevin McCarthy hasn't already put on tape,\" he quipped.",
    "Today's Republicans say tear down Mickey Mouse's house and pretty soon they'll be storming Cinderella's castle, you can be sure of it.\"",
    "Trump, who was roasted at the 2011 dinner by comedian Seth Meyers, took to Twitter in 2017 to say he wouldn't attend.",
    "Taking a swipe at his approval ratings, he thanked the \"42 percent who actually applauded\" as he took the microphone.",
    "And he jabbed at the press, saying they were the \"only group of Americans with a lower approval rating\" than his own.",
    "His boycott continued through 2019, and the event was canceled due to the COVID-19 pandemic in 2020 and 2021.",
    "quickly replaced the original chant, which protestors had been shouting at sports events across the country.",
    "Believed to have been led by supporters of President Donald Trump, the chant was really \"F*** Joe Biden.\"",
    "\"Let me tell you something pal, I'm flattered anybody would call me a new anything,\" he said.",
    "Winners of the WHCA's annual awards for excellence in journalism are celebrated at the event.",
    "He also referenced to the ongoing disputes between Disney and Florida Governor Ron DeSantis.",
    "And he referenced headliner Trevor Noah once calling him \"America's new Dad.\"",
    "Biden noted his appearance was the first for a sitting president since 2016.",
    "Taking on the GOP, he called out House Minority Leader Kevin McCarthy.",
    "for Brandon Brown, the winner of the race, but that wasn't the case.",
    "Stavast thought people were shouting \"Let's go Brandon!\"",
    "\"Republicans seem to support one fellow,\" Biden said.",
    "They're all here, vaccinated and boosted.\"",
    "\"Contact your favorite Fox reporter.",
    "Gorbachev tear this wall down.'",
    "He's having a really good year.",
    "And I'm kind of happy for him.\"",
    "\"Wondering how to do that?\"",
    "\"Ronald Reagan said, 'Mr.",
    "\"Some guy named Brandon.",
    "\"It's understandable.",
    "\"Let's go Brandon!\"",
    "Biden asked."
  ]
}