{
  "id": 4320,
  "mediaId": 129,
  "date": "5/1/2022 12:00:00 AM",
  "headline": "Jokes, Glamour and a Try for Normalcy as Correspondents Dinner Returns",
  "image": "https://static01.nyt.com/images/2022/04/30/us/30dc-dinner-1/30dc-dinner-1-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/01/us/politics/white-house-correspondents-dinner.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "The First Amendment grants a free press extraordinary protection,? he said, but with it comes, as many of you know, a very heavy obligation to seek the truth as best you can, not to inflame or entertain but to illuminate and educate.?\nTheres incredible pressure on you all to deliver heat instead of shed light,? he said, adding, American democracy is not a reality show.?\nThe correspondents association made a point of adding a serious note to the evenings festivities by honoring two Black female pioneers of the White House press corps, Alice Dunnigan and Ethel Payne, who were two of only three African American journalists regularly reporting on the White House in the 1950s.",
    "He said he was glad to be with a roomful of journalists, the only people with a lower approval rating than I have,? and said it was good to be back after six years during which we had a horrible plague followed by two years of Covid.?\nHe said he had expected to run into opposition for his agenda in the Senate, but I just hoped it would be from Republicans.? He teased the House Republican leader, Representative Kevin McCarthy of California, who was revealed on an audio recording obtained by two New York Times reporters to have talked about asking for Mr. Trumps resignation after the Capitol riot on Jan. 6, 2021.\nTheres nothing I can say about the G.O.P.",
    "He said that Russia was upset at Mr. Bidens comment that President Vladimir V. Putin should be removed from power until someone explained to them that none of the stuff Biden wants actually gets done.?\nBut he contrasted Mr. Bidens willingness to be skewered with Mr. Trumps refusal to participate in the dinner  the only president never to attend since Calvin Coolidge made the first appearance in 1924. Its actually nice to once again have a president whos not afraid to come to the White House Correspondents Dinner and hear jokes about himself,? Mr. Noah said.",
    "Mr. Biden was the first president to attend since 2016 because his predecessor, Donald J. Trump, boycotted the event during his term as part of his war with the fake news? media that he deemed the enemy of the people.? It was also the first time the dinner had been held at all since 2019, after being canceled the last two years because of the pandemic  and many wondered whether it was tempting fate to crowd 2,600 people into a packed hotel ballroom as a surge of infections swept through the citys elite.",
    "But the event otherwise resumed its status as Washingtons premier exercise in excess, bracketed by days of fancy, expensive, alcohol-filled parties held across the city late into the night, bringing members of the political class together with the journalists who cover them and the occasional fixtures of Hollywood, Wall Street and other American institutions.",
    "President Biden headlined the White House Correspondents Association Dinner, that see-and-be-seen bacchanalia of Washington journalists and power brokers dressed up in tuxedos and gowns to spend an evening schmoozing, networking, gossiping, preening and peacocking before returning to the office on Monday to savage one another again.",
    "After six years of strife followed by disease, the Washington press corps returned to what passes for normal in the nations capital on Saturday night as it resumed its annual tradition of celebrating itself in gala fashion with the leader of the free world.",
    "While Mr. Biden, like other presidents, has complained about his coverage, sometimes snapping at reporters who ask questions he does not care for, aides said he intended his decision to attend to be a reaffirmation of his support for a free press.",
    "Trevor Noah, the official comedian of the night, joked that he was honored to be speaking tonight at the nations most distinguished superspreader event.?\nHe razzed the organizers for proceeding with the dinner at the Washington Hilton.",
    "At your best, youre guardians of the truth.? He cited in particular those who have given their lives reporting from the battlefields of Ukraine, a reminder, he said, of the importance of journalism.",
    "Just weeks ago, more than 70 guests tested positive for the coronavirus after the Gridiron Dinner, a similar though smaller Washington gathering, including several members of Mr. Bidens cabinet.",
    "Then the second someone offers you a free dinner, you all turn into Joe Rogan.?\nMr. Biden offered a more serious reason for going through with the dinner despite the health concerns.",
    "Do you read any of your own newspapers?? he asked, adding: You guys spent the last two years telling everyone the importance of wearing masks and avoiding large indoor gatherings.",
    "At the main dinner, the president is typically expected to deliver humorous remarks, and Mr. Biden obliged, although he kept them briefer than those of some of his predecessors.",
    "As a concession to the potential peril, Mr. Biden, who at 79 is in a high-risk age group, skipped the dinner and came only for the speaking portion of the evening.",
    "Organizers required all guests to be vaccinated, boosted and test negative before attending, although few wore masks besides the serving staff.",
    "It also paid tribute to journalists killed in Ukraine and singled out the family of Austin Tice, a reporter who was abducted in Syria in 2012.",
    "Just this past week, Vice President Kamala Harris and Kate Bedingfield, the White House communications director, both tested positive.",
    "Dr. Anthony S. Fauci, the governments top infectious disease expert, opted against going to the dinner because of the obvious danger.",
    "In fact, the presidents decision to attend was subject to second-guessing, both inside and outside the White House.",
    "He teased Mr. Biden over inflation, gas prices, his gaffes and his failures to push his proposals through Congress.",
    "I stood here tonight and I made fun of the president of the United States and Im going to be fine,? he said.",
    "Still, the president gently chided journalists, urging them to avoid sensationalism and trivialization.",
    "But his presence was meant to represent a return to normalcy after Mr. Trumps war on the news media.",
    "WASHINGTON  The jokes were back, the celebrities were back, the president was back.",
    "Were here to show the country that were getting through this pandemic,? he said.",
    "Turning to Mr. Biden, he added, I am going to be fine, right?? Mr. Biden smiled.",
    "Ron DeSantis of Florida, Fox News, The New York Times, CNN, MSNBC and CBS News.",
    "Mr. Noah offered equal-opportunity mockery of everyone, including Gov.",
    "that Kevin McCarthy hasnt already put on tape,? Mr. Biden said.",
    "The free press is not the enemy of the people,? Mr. Biden said.",
    "The only question was whether Covid was back.",
    "Far from it."
  ]
}