{
  "id": 4333,
  "mediaId": 124,
  "date": "d2022-04-30T11:44",
  "headline": "Elon Musks no good, very bad meme shows how out of touch he is with political reality",
  "image": "https://iframe.nbcnews.com/VZIR82d/thumbnail",
  "link": "https://www.nbcnews.com/think/opinion/elon-musks-twitter-meme-shows-touch-reality-rcna26669",
  "sentiment": "0.0",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1078,
    1930,
    2185,
    2303,
    2465,
    2517
  ],
  "sentences": [
    "Shapiro, for his part, has called on Musk to form a Truth and reconciliation commission revealing past manipulation? and for Musk to Fire a LOT of people.?\nFor the upsetting the far right and the far left equally? talk, Musk sure seems to be telegraphing a pretty conservative vision for Twitter, complete with conspiracy theories about anti-conservative bias and complaints about the woke mind virus? and pronouns.? There are a lot of questions about what Twitter will look like under Musks leadership, but if his memes are to be believed, it may not be very neutral? at all.",
    "Please let us know what you THINK by submitting a letter to the editor\nNBC Newsnbcnews.com/Jul 17, 2019\nIf, as Musk has stated, he wants to have a politically neutral? platform, which he defines as upsetting the far right and the far left equally? (that is not what politically neutral? actually means), and he believes that Twitter has a bias that favors the left, as another meme he recently shared baselessly suggested, we deserve to know what neutral? really means to him.",
    "That being said, if Musk actually believes the meme  which was created last year by Colin Wright, who writes a Substack mostly about gender and earlier this week attacked the Trevor Project, an LGBTQ youth suicide prevention organization, as part of the ongoing right-wing smear campaign targeting LGBTQ adults and children  thats more worrying.",
    "All this boils down to is power: Sen. Warren on Elon Musks Twitter buyout\nApril 27, 202209:57\nPerhaps, as others such as The Washington Posts Will Oremus have said, it could be that this is just how Musk (and others) sees the world around them: not in the form of actual policy but through the lens of the culture wars.",
    "As Ive written in the past, the positions typically held by Democrats that get labeled by the press as extreme? or leftist?  such as bans on high-capacity firearm magazines, universal background checks on gun purchases, support for LGBTQ rights and taxing the ultra-rich  arent actually that extreme.",
    "And generally speaking, it makes sense that having curated a media diet heavy on the misinformation peddled by Fox News and co. or surrounding yourself with pundits screaming about how trans people are supposedly ruining everything good in the world could warp your perspective.",
    "pic.twitter.com/Q9OjlJhi7f\n Elon Musk (@elonmusk) April 28, 2022\nThe argument being made here is a simple one: From 2008 to 2021, the political left moved even more to the left, while the right remained in the same exact spot.",
    "Look at how quickly the Republican Party turned against 2008 presidential nominee Sen. John McCain and 2012 presidential nominee (and now senator) Mitt Romney, who have both been slammed as RINOs (Republicans in Name Only?).",
    "In just the past few days, hes used Twitter to interact with right-leaning pundits like Ben Shapiro, Dave Rubin, Saagar Enjeti, Steven Crowder and even one-time Pizzagate conspiracy theorist Mike Cernovich.",
    "These policies tend to be pretty popular with the general public, which is something you cant exactly say about Republicans and their crusade to ban books, restrict abortion rights and attack LGBTQ people.",
    "For instance, the partys stance on LGBTQ rights has certainly shifted in the past several years, even if that hasnt resulted in a ton of LGBTQ-inclusive policies being implemented at the federal level.",
    "Democrats have also, generally speaking, shifted to the left on sentencing reform and police accountability, even if, again, that hasnt resulted in a ton of policy to reflect this stance.",
    "Its not uncommon for people to delude themselves into believing that their preferred political side is the reasonable one and that its the other side thats out of control, as Musk has.",
    "For all the thought pieces discussing whether cities should defund the police,? city officials in both red and blue states are once again pouring money into law enforcement.",
    "(Meanwhile Republicans like DeSantis have recently gone on the attack, with legislation like the so-called Dont Say Gay? bill targeting LGBTQ teachers and youth.)",
    "Can you imagine the modern mainstream Republican reaction to President Richard Nixons decision to create a brand new federal agency to protect the environment?",
    "If you spent the summer of 2020 being inundated by Fox News footage of Black Lives Matter protests, you might genuinely think that the left is out of control.",
    "To take another example, while other countries have government-funded health care, the U.S. remains tied to its private-market insurance industry.",
    "Subscribe to the THINK newsletter\nReTHINK the news cycle with timely op-eds, in-depth analyses and personal essays delivered weekly to your inbox.",
    "How about President George W. Bushs speech in which he said the words Islam is peace?  even if his administrations actions said otherwise?",
    "Ron DeSantis, who has spent the last year passing a dizzying array of bills designed to cater specifically to the far-right.",
    "The face of the party is now represented by the likes of Rep. Lauren Boebert, Madison Cawthorn and Marjorie Taylor Greene.",
    "The face of the party is now represented by the likes of Rep. Lauren Boebert, Madison Cawthorn and Marjorie Taylor Greene.",
    "Elected Democrats still tend to be pretty moderate on most issues  especially when compared to leftist? positions abroad.",
    "Or how about President Ronald Reagans decision to offer amnesty to nearly three million undocumented immigrants?",
    "After all, Musk is likely to soon control Twitter, a tool which, for all its faults, still wields power.",
    "Arguably the highest-profile non-congressional Republican right now (besides Trump) is Florida Gov.",
    "Obviously, political whims shift over time, and parties may flip-flop on individual issues.",
    "While perhaps comforting, there is plenty of empirical evidence to refute the core claim.",
    "Sometimes they make sense, sometimes they dont (and usually hes not the one making them.)",
    "attitude is a pretty common trope among center-right types, but its simply not true.",
    "But broadly speaking, the right has been shifting to the extremes for decades.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "Thursdays viral meme certainly fell into the latter two categories.",
    "Billionaire and maybe-Twitter buyer Elon Musk sure loves memes.",
    "Well, theyve definitely moved to the left on a few key issues.",
    "This perception, however, simply doesnt match reality.",
    "Does he recognize those as conservative voices?",
    "Please submit a letter to the editor.",
    "We want to hear what you THINK.",
    "It was the left who left me!",
    "This I didnt change!",
    "As for Democrats?"
  ]
}