{
  "id": 4335,
  "mediaId": 302,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "The Lightning, Charlie Crist and a former surgeon general make the weeks highs and lows",
  "image": "https://www.tampabay.com/resizer//1RQllJ9oosR8YvGJ8NxxGl5uhq0=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/IEEO3RVPSVCZ5EEIA3FD6RPRQY.jpg",
  "link": "https://www.tampabay.com/opinion/2022/04/30/the-lightning-charlie-crist-and-a-former-surgeon-general-make-the-weeks-highs-and-lows/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Just this week he sent a letter to the House clerk saying, I continue to be unable to physically attend proceedings in the House chamber due to the ongoing public health emergency.? But, the Herald reported, Crist was still attending campaign events, sometimes indoors and without a mask, on the days he voted by proxy.",
    "Rivkees also signed onto a letter that criticizes the states recent guidance advising against hormone therapy, gender affirming surgery and social transitioning for transgender children, which can include changing their name, pronouns or clothing.",
    "He recently argued in a fact-laden essay that healthy children should get vaccinated, bucking the guidance of Floridas current surgeon general who has questioned the merits of vaccinating healthy children.",
    "In recent months, U.S. Rep. Charlie Crist, D-St. Petersburg, has used the Houses pandemic-era proxy voting rule to avoid trips to Washington while he campaigns for governor in Florida.",
    "In one example from 2020, an aide to the governor whisked Rivkees out of a briefing after he said the state might have to social distance for up to a year.",
    "Ive got to get some advice from Steve about this.? Stamkos, 32, played his first Lightning game in 2008 and is having one of his best individual seasons.",
    "The members of the Editorial Board are Editor of Editorials Graham Brink, Sherri Day, Sebastian Dortch, John Hill, Jim Verhulst and Chairman Paul Tash.",
    "Crist, for instance, voted by proxy 107 times between January and April 7, the sixth most among House representatives, according to the Miami Herald.",
    "So the public health emergency? is so dire as to keep him from voting in person but not so dire to keep him from campaigning in person?",
    "For the first time in its history, the U.S. House allowed proxy voting to keep members safe and help prevent the virus from spreading.",
    "The pandemic and scheduling issues had shut out the back-to-back Stanley Cup champions from the traditional visits with the president.",
    "Its nice to see Rivkees adding his voice to these debates, but where was that vocal leadership when he was in charge?",
    "Even some players from the Stanley Cup winning teams who are no longer with the Lightning made the visit.",
    "Despite a raging pandemic, he was what would be kindly described as a behind the scenes? leader.",
    "But Crists reason for missing the in-person votes is where he steps onto shaky ground.",
    "The governor didnt seem to like some of what Rivkees said early in the pandemic.",
    "Biden quipped about how long captain Steven Stamkos had been in the league.",
    "Will the Lightning soon return to the White House as three-peat champions?",
    "Rivkees left the office in the fall and took a job at Brown University.",
    "It was great to see the Lightning at the White House earlier this week.",
    "For months after that, Rivkees was hardly seen or heard from publicly.",
    "Scott Rivkees was the first Florida surgeon general appointed by Gov.",
    "Politicians take advantage of rules, sometimes they bend them.",
    "But there they were Monday grinning and joking with Joe Biden.",
    "Editorials are the institutional voice of the Tampa Bay Times.",
    "Follow @TBTimes_Opinion on Twitter for more opinion news.",
    "It was another busy news week in Florida and Tampa Bay.",
    "Both political parties took advantage of the new rule.",
    "Youd be forgiven for not recognizing his name.",
    "Here are three of the high  and low  lights.",
    "And, do you remember the name Scott Rivkees?",
    "Is Steven Stamkos really that old?",
    "Steve, 14 seasons?? Biden said.",
    "The playoffs start next week.",
    "Youre getting old, man.",
    "And now hes talking.",
    "Rivkees speaks.",
    "Better late ...",
    "Ron DeSantis.",
    "I dont know.",
    "A bad look.",
    "Hmm."
  ]
}