{
  "id": 4338,
  "mediaId": 169,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "Bill Maher on DeSantis, Cruz and \"sexy Disney\"",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2016/01/bill_maher6.jpg",
  "link": "https://www.salon.com/2022/04/30/bill-maher-on-desantis-cruz-and-sexy-disney/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kelly McClure",
  "authorUrl": "https://www.salon.com/writer/kelly-mcclure",
  "termIds": [
    661,
    922,
    1710,
    524,
    3516,
    2661,
    5109
  ],
  "sentences": [
    "Bill Maher referenced a Salon article on Friday's episode of \"Real Time With Bill Maher\" as part of a segment in which Maher discusses Ted Cruz and Ron DeSantis' building concerns over a \"sexy Disney.\"",
    "\"The Little Spermaide\"\n\"Honey, I Transitioned The Kids\"\n\"Mary Poppers\"\n\"Around The World For 80 Bucks\"\n\"The Sorcerer's Appendage\"\nWant a daily wrap-up of all the news and commentary Salon has to offer?",
    "Ron DeSantis was in the news on Friday as his feud with Disney escalates over \"additional legislative action\" DeSantis is pushing for the company's special tax district, according to CNN.",
    "This seems to all be the consequence of Disney pushing against Florida's \"Don't Say Gay\" law that puts a thumb on talks of sexuality and gender in public schools.",
    "They may be on to something with this grooming and highly sexualized content,\" Mahers jokes, readying a list of facetious examples.",
    "\"...DeSantis today, he looks like he stepped in it here, and not in a good way, with getting in the middle of Disney,\" Maher said.",
    "Last week DeSantis signed a bill to \"dissolve the Reedy Creek Improvement District, effective June 1, 2023,\" per CNN's coverage.",
    "... \"And DeSantis today said 'you know, when we were kids we didn't have to worry what was in cartoons.'",
    "I thought, these guys are crazy, and then I look at some of the movies that Disney has coming out.",
    "Disney will, for the first time, actually live under the same laws as everybody else in Florida.",
    "\"There's going to be additional legislative action,\" said DeSantis in a quote pulled from CNN.",
    "Ted Cruz said, and I think we have a headline here, 'Mickey and Pluto going at it.'",
    "\"Bedknobs & Nipple Clamps\"\n\"The Love Plug\"\n\"Who Cucked Roger Rabbit?\"",
    "Subscribe to our morning newsletter, Crash Course.",
    "\"He was kinda coming in on the Ted Cruz opinion.",
    "We know what we're going to do, so stay tuned.",
    "Watch Maher's full clip below:\nRead more:",
    "Imagine that,\" DeSantis said.",
    "\"Disney will pay its debts.",
    "That'll all be apparent.\"",
    "\"We've contemplated that.",
    "Florida Gov."
  ]
}