{
  "id": 4347,
  "mediaId": 19,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "Ron DeSantis: Leftists Freaking Out over Elon Musk Purchase Because They Used Twitter to Enforce the Narrative",
  "image": "https://media.breitbart.com/media/2022/04/desantis-elon-musk-inset-getty-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/30/ron-desantis-leftists-freaking-out-over-elon-musk-purchase-because-they-used-twitter-to-enforce-the-narrative/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    661,
    2087,
    2517,
    539,
    2661
  ],
  "sentences": [
    "What hes doing, I dont think the board wanted to accept the offer, but they had to because financially it makes sense.?\nWe let it be known in Florida, since our state pension fund has shares of Twitter, that we would absolutely hold the board of directors accountable if they breached their fiduciary duty, theyve got to do whats right in the interest of the shareholders,? the Republican added, making it clear that they could not reject the offer simply because of political reasons.",
    "That is something for a free society to not be able to speak out on these major platforms where so much speech goes on, you know, thats a huge, huge problem,? he said, explaining that Musk saw that and must saw people being censored.?\nHe saw websites like the Babylon Bee,? a satire site, being locked out because they had the temerity to do satire about some of the transgender ideology,? DeSantis continued.",
    "You can try to do better, and so then maybe people will like what youre doing better or you can try to shut up everybody whos criticizing your bad policies,? DeSantis said, concluding that the Biden administration seems like theyre trying to do the latter? by announcing the creation of the Disinformation Governance Board led by far-left radical disinformation chief? Nina Jankowicz.",
    "And you also see it with Elon musk purchasing Twitter, you know, they wanted to use Twitter as a way to enforce the narrative.?\nWhen you do things like talk about things that conflict with what people like Fauci say or whatever they will silence? and censor you,? he said, noting that it is not something that should occur in a free society.",
    "DeSantis added that there is momentum behind the free speech movement, particularly speaking the truth to a very decaying and discredited ruling elite in this country.?\nThis is going to be potentially an engine where the American people can speak the truth and fight back,? he added.",
    "WATCH:\nThis is not the first time DeSantis has weighed in on the billionaire taking over Twitter, noting earlier this week that Musk purchasing Twitter raises the prospect that the platform will be a place where free speech can thrive, not a tool for narrative enforcement?:\n.",
    "@elonmusks offer to buy Twitter is a good deal for shareholders and raises the prospect that the platform will be a place where free speech can thrive, not a tool for narrative enforcement.",
    "Ron DeSantis (R) said on Friday, where he also blasted the Biden administration for installing a Ministry of Truth.?\nWhen youre not doing well, theres two ways to do it.",
    "Leftists are freaking out over Elon Musks purchase of Twitter because they used the platform to enforce the narrative,? Florida Gov.",
    "They want to stifle dissent,? he said, explaining that the public is sick of it."
  ]
}