{
  "id": 4348,
  "mediaId": 19,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "Joe Biden Jokes About Disney, Some Guy Named Brandon, and Donald Trump at White House Correspondents Dinner",
  "image": "https://media.breitbart.com/media/2022/04/Joe-Biden-at-White-House-Correspondents-Dinner-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/04/30/joe-biden-jokes-about-disney-some-guy-named-brandon-and-donald-trump-at-white-house-correspondents-dinner/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Charlie Spiering",
  "authorUrl": "https://www.breitbart.com/author/charlie-spiering/",
  "termIds": [
    661
  ],
  "sentences": [
    "And Im kind of happy for him.?\nThe Lets Go Brandon chant and signs continue to follow the president around the country, especially after the president repeated the phrase himself during a Christmas call with children.",
    "Theres nothing I can say about the GOP that Kevin McCarthy hasnt already put on tape,? he joked, referring to conversations with leading Republicans that were leaked to New York Times reporters.",
    "Biden joked that DeSantis and Florida Republicans were much different from Ronald Reagan, who once called for the Berlin Wall to be torn down.",
    "President Joe Biden on Saturday joked about the popular Lets Go Brandon? movement at the White House Correspondents Dinner during his speech.",
    "Now that would really have been a real coup if that occurred.?\nThe president also mocked leading Republicans Rep. Kevin McCarthy and Gov.",
    "We had a horrible plague followed by two years of COVID.?\nJust imagine my predecessor came to this dinner this year,? Biden added.",
    "The Republicans do seem to be supporting one person: Some guy named Brandon,? Biden said as the crowd laughed.",
    "This is the first time a President attended this dinner in six years,? Biden said.",
    "Todays Republicans say, Tear down Mickey Mouses house,? Biden joked.",
    "Biden kicked off his speech with a joke about Donald Trump.",
    "And pretty soon theyll be storming Cinderellas castle.",
    "Hes having a really good year.",
    "You can be sure of it.?",
    "Its understandable.",
    "Ron DeSantis."
  ]
}