{
  "id": 4350,
  "mediaId": 19,
  "date": "d2022-04-30T00:00",
  "headline": "Survey: Majority Support Anti-Groomer Laws Like Floridas Parental Rights in Education Law",
  "image": "https://media.breitbart.com/media/2022/04/277784183_561855215303391_5530926829431520636_n-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/30/survey-majority-support-anti-groomer-laws-like-floridas-parental-rights-in-education-law/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    661,
    4711,
    524,
    2661,
    5109
  ],
  "sentences": [
    "They support sexualizing kids in kindergarten, they support injecting woke gender ideology into second-grade classrooms, they support enabling schools to transition students to a different gender without the knowledge of the parent, much less without the parents consent,? DeSantis said at the time, lambasting his critics:\nThe bill I signed today protects Florida parents like January Littlejohn.",
    "Disney, as a result, identified the laws repeal as a company goal:\nStatement from The Walt Disney Company on signing of Florida legislation: pic.twitter.com/UVI7Ko3aKS\n Walt Disney Company (@WaltDisneyCo) March 28, 2022\nFlorida lawmakers have since opted to abolish Disneys corporate district, the Reedy Creek Improvement District.",
    "Do you support or oppose proposals that protect young children from being exposed to sexual topics by school employees without parental consent or knowledge??\nThe vast majority, 70 percent, said they support such laws designed to protect children, and of those 61 percent strongly? support it.",
    "The survey, taken April 19-27, 2022, among 800 likely voters, presented respondents with the following: Florida recently passed a law prohibiting public school teachers from introducing sexual topics to elementary school children without parental consent.",
    "Radical leftists and members of the establishment media famously mischaracterized the bill, as activists and opponents falsely referred to the legislation as Dont Say Gay,? despite the fact that the word does not even appear once in the bill.",
    "pic.twitter.com/qH4VKUgmkO\n Ron DeSantis (@GovRonDeSantis) March 28, 2022\nThe legislation sparked a war with woke Disney, which repeated the fake news catchphrase Dont Say Gay? and criticized the governor for signing the law.",
    "@GovDeSantis just expanded the Special Session so I could file HB3C which eliminates Reedy Creek Improvement District, a 50 yr-old special statute that makes Disney to exempt from laws faced by regular Floridians.",
    "Ron DeSantis (R) signed the parental rights law, which prohibits classroom discussions on sexual orientation and gender identity for children in kindergarten through third grade.",
    "Most likely voters support anti-groomer laws such as Floridas Parental Rights in Education law, a survey from The Federalist/Susquehanna released this week revealed.",
    "DeSantis said the move makes it clear that the supposedly family-friendly company should not run its own government?:\nBREAKING: Disney is a guest in Florida.",
    "School officials manipulated her daughter to transition,? calling her a male name & pronouns without Januarys knowledge or consent.",
    "Less than a quarter, 23 percent, said they oppose such measures, and of those, 11 percent strongly? oppose.",
    "The survey has a +/- 3.46 margin of error and comes one month after Florida Gov.",
    "This is wrong & todays legislation will ensure it doesnt happen again.",
    "Today, we remind them."
  ]
}