{
  "id": 4354,
  "mediaId": 136,
  "date": "d2022-04-29T21:44",
  "headline": "Gay Republicans Slam 'Misguided' Attacks on Florida Law, Trans Bills",
  "image": "https://d.newsweek.com/en/full/2028842/donald-trump-rainbow-flag.webp?w=790&f=43bc7f6f1606e1cca3a338dbefe854d4",
  "link": "https://www.newsweek.com/gay-republicans-slam-misguided-attacks-florida-law-trans-bills-1702338",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    661,
    979,
    1147,
    1491,
    3910,
    4267,
    428,
    2590,
    2661
  ],
  "sentences": [
    "We likely won't know until parents start suing teachers under this law, and the courts establish what constitutes 'instruction' by a teacher vs. what is an organic conversation that acknowledges that gay and trans people exist in the worldand sometimes they are part of our families,\" Longwell, who has two sons with her wife, wrote for the Post.",
    "While many LGBTQ activists and Democrats attack Florida's Parental Rights in Education law, dubbed the \"Don't Say Gay\" bill, and a spate of GOP-backed legislation regarding the transgender community in states across the country, prominent gay Republicans reject the backlash as \"misguided.\"",
    "I think the bill is quite clear here, and the attacks from the left are misinformed and misguided,\" Charles Moran, president of the Log Cabin Republicans, an LGBTQ Republican organization that has been around since the 1970s, said in a Friday email to Newsweek.",
    "Former Olympic athlete and unsuccessful California gubernatorial candidate Caitlyn Jenner, who is perhaps the world's most famous transgender woman, made waves last year when she launched her GOP campaign to unseat Democratic Governor Gavin Newsom.",
    "Peter Boykin, the founder of Gays for Trump who is running to represent North Carolina's 63rd District in the state House, explained that he would even be interested in introducing similar legislation to the Florida law if he's elected.",
    "Specifically referring to the Florida law, he said it \"isn't a reversal or a push-back on gay rights,\" adding that \"this is an extension of parental rights and an examination on what kind of curriculum is being taught in schools.\"",
    "Critics raised alarms, contending that the legislation could prevent teachers from even recognizing or discussing the existence of LGBTQ individuals, and that it would undermine schools' abilities to support LGBTQ students.",
    "Moran said that speaking on behalf of his organization and the broader conservative movement, he rejected \"the notion that the Florida bill in particular, and the trans sports issue, are an attack on gay rights.\"",
    "Sarah Longwell, the publisher of the conservative news site The Bulwark and a staunchly anti-Trump Republican, wrote an opinion article for The Washington Post in mid-March criticizing the GOP-backed legislation.",
    "In conjunction with these laws, there has been a noticeable increase in Republicans accusing those criticizing the bills or voicing support for the LGBTQ community of being \"groomers\" or \"pro-pedophilia.\"",
    "In a June 2020 Supreme Court ruling, conservative Justice Neil Gorsuch, who was nominated by Trump, wrote the majority opinion barring companies from firing employees for being gay or transgender.",
    "\"The same people who are 'clutching their pearls' and offended over the accusation just spent four years calling people like me and other Republicans fascists and Nazi's,\" Moran said in an email.",
    "The Gays for Trump founder said that he has been \"guilty\" of using the \"groomer\" term when he views individuals to be promoting ideas about sex and gender to minors in an inappropriate way.",
    "Boykin also criticized providing puberty blockers to children, contending that many minors may not fully understand how they identify, and could be unduly influenced by parents or others.",
    "Proponents of giving children and their parents the option of using puberty blockers and other gender-affirming health care contend that in some cases, these treatments can save lives.",
    "As those on the left have slammed the GOP-backed legislation and the accusations from some on the right, prominent gay Republicans who spoke to Newsweek dismissed the criticism.",
    "\"The most qualified person to speak on this issue is actually Caitlyn Jenner, who correctly attested that biological women should not be competing against transgender women.",
    "Boykin stressed that Republicans should avoid generalizing all members of the gay community with some of the most \"extreme\" examples they may seep hyped by right-wing media.",
    "\"I would probably myself produce a bill similar to the Florida bill about elementaryabout being taught age appropriate things,\" Boykin said in a Thursday phone interview.",
    "While Republicans have often been viewed as less supportive or even opposed to LGBTQ rights, the GOP has appeared to embrace the community more and more in recent years.",
    "During her campaign, Jenner came out in support of GOP efforts to block young transgender athletes from competing in sports based on the gender they identify with.",
    "Richard Grenell, who is gay, served in acting capacity as Trump's director of national intelligence after a stint as the former president's ambassador to Germany.",
    "When it comes to the recent spike in some on the right calling LGBTQ supporters \"groomers\" or \"pro-pedophilia,\" Boykin and Moran were dismissive of this as well.",
    "The Gays for Trump founder explained that he wants people to live in whatever manner they choose, and supports their right to identify as men or women.",
    "There are also bodily changes that occur in puberty that are more difficult to counter through treatment after minors go through the adolescent period.",
    "The bill bars teachers and school personnel from providing instruction \"on sexual orientation or gender identity\" in kindergarten through third grade.",
    "Data from the LGBTQ youth nonprofit The Trevor Project found that in 2020, more than half of transgender and nonbinary youth attempted suicide.",
    "Boykin did say that he worries there could be a backlash toward the gay community due to the heightened focus on some of these issues, however.",
    "He said that the intent was to prevent instruction about sex and sexual topics, which he said shouldn't be discussed until students are older.",
    "He said that a lot of his transgender friends are conservative themselves and preferred things better when their community got less attention.",
    "The Log Cabin Republican president said he doesn't personally utilize the terms, but compared it to attacks made against those on the right.",
    "He said, however, that he opposes the use of the \"they\" and \"them\" pronouns some in the transgender or nonbinary communities have adopted.",
    "Meanwhile, Republican-controlled legislatures in states across the country have introduced a range of bills addressing transgender issues.",
    "Notably, Trump's administration filed a brief in the case prior to the decision, which went against the Supreme Court's ultimate ruling.",
    "Boykin repeatedly pointed out to Newsweek that he has transgender friends and does not view himself to be opposed to their community.",
    "Many of these bills bar young transgender athletes from competing in school sporting competitions as the gender they identify with.",
    "He said it's \"getting very irritating\" that some on the right are generalizing based on what he described as the \"nutty\" examples.",
    "At the end of March, Florida Governor Ron DeSantis, a Republican, signed the controversial GOP-backed education bill into law.",
    "\"I'm not against transgenders, I just feel like you need to go through puberty to realize what you ultimately are,\" he said.",
    "Earlier in the interview, the Gays for Trump founder noted that the Florida legislation doesn't use the word \"gay.\"",
    "Former President Donald Trump waved a rainbow flag given to him during an October 2016 campaign event in Colorado.",
    "Trump also became the first U.S. president to appoint an openly gay person to serve in a cabinet position.",
    "Others go further, barring gender-affirming health care and treatment for transgender minors.",
    "He said that he feels it has already started within some corners of the right-wing movement.",
    "\"This is a question of fairness,\" Jenner told a TMZ reporter outside her vehicle in Malibu.",
    "\"I don't care if people want to attack me on that, especially within the gay community.\"",
    "Some prominent LGBTQ Republicans have also come out against Florida's controversial law.",
    "\"That's why I oppose biological boys who are trans competing in girls sports in school.",
    "This [Florida] bill prohibits curriculum in these areasnot conversation or discussion.",
    "\"Our main concern, what we're trying to do, is defend the gay community,\" Boykin said.",
    "Although Jenner failed in that bid, she now has a contributor role on Fox News.",
    "\"Because, until then, I think most children could be gender fluid, really.",
    "\"Do not lump us all in one category,\" the Gays for Trump founder urged.",
    "You could be a very feminine gay guy or you could be a butch woman.\"",
    "Moran referenced Jenner's position in his interview with Newsweek.",
    "Is 'instruction' everything a teacher says in the classroom?",
    "Longwell declined to be interviewed for this article.",
    "That position is where most of America is,\" he said.",
    "And we have to protect girl sports in our schools.\"",
    "\"The bill never clarifies what 'instruction' means.",
    "\"Please, spare me the righteous indignation.\"",
    "Because you don't really know.",
    "\"The critics are incorrect.",
    "It just isn't fair."
  ]
}