{
  "id": 4360,
  "mediaId": 441,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Disney Replaces Public Relations Chief Amid Florida Furor",
  "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ivSKUhl8gPmM/v0/1200x800.jpg",
  "link": "https://www.bloomberg.com/news/articles/2022-04-29/disney-s-new-public-relations-chief-leaves-amid-florida-furor",
  "sentiment": "0",
  "mediaOutlet": "Bloomberg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Christopher Palmeri",
  "authorUrl": "https://www.bloomberg.com/authors/APy3svJ7E1Q/chris-palmeri",
  "termIds": [
    661
  ],
  "sentences": [
    "Disneys opposition to Florida legislation banning discussion of sexual orientation and gender identity in classrooms with kids third grade and younger prompted Governor Ron DeSantis and other Republicans to terminate a special municipal district the company has operated in Florida since the 1960s.",
    "I am not comfortable having one company with their own government and special privileges, when that company has pledged itself to attacking the parents in my state,? DeSantis said Thursday at a town hall meeting organized by Fox News.",
    "Walt Disney Co.s new head of corporate affairs, Geoff Morrell, is leaving after just three months on the job amid the furor over the companys opposition to a Florida bill restricting discussion of sexual orientation in schools.",
    "Morrell, a former chief of communications at oil giant BP Plc and spokesman for the Pentagon, joined Disney in January, replacing longtime public relations chief Zenia Mucha, who retired.",
    "Do what you did great.?\nDisneys troubles began in early March, when Chief Executive Officer Bob Chapek put out a statement saying the company wouldnt take a position on the schools bill.",
    "Company employees began publicly protesting the decision, and Chapek reversed course two days later, saying hed work to get the legislation stopped.",
    "With its Orlando resort and theme parks, Disney is one of Floridas biggest employers, and is in the process of relocating about 2,000 workers there.",
    "Since then, Disney has become embroiled in one of its worst-ever public-relations crises, taking heat from critics on the left and right.",
    "Kristina Schake, hired earlier this month, will replace him as head of communications, Disney said in a statement Friday.",
    "She is a former public relations director for Instagram and served as a spokeswoman for First Lady Michelle Obama.",
    "It has become clear to me that for a number of reasons it is not the right fit,? Morrell said in a statement.",
    " With assistance by Nathan Crooks\n(Updates with comment from executive in second paragraph.)",
    "Government relations will now be run by General Counsel Horacio Gutierrez.",
    "Walt Disney would not want that.",
    "And so get back to the mission."
  ]
}