{
  "id": 4362,
  "mediaId": 1067,
  "date": "d2022-04-29T19:54",
  "headline": "Disney PR chief out after 3 months amid DeSantis-Reedy Creek controversy",
  "image": "https://www.orlandosentinel.com/resizer/pD8o9G-oDVLPpCR2d-Fmcz_VziQ=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/T6T3FGTQSZEAPK4MXREVV5RD6E.jpg",
  "link": "https://www.orlandosentinel.com/business/tourism/os-bz-disney-desantis-pr-fired-20220429-gyo6e3l3trgrxm5m5wylkgcn5m-story.html",
  "sentiment": "0.0",
  "mediaOutlet": "Orlando Sentinel",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Faughnder",
  "authorUrl": "",
  "termIds": [
    661,
    1241,
    4704,
    4842,
    524,
    611,
    3159,
    2661,
    2851,
    5109
  ],
  "sentences": [
    "After talking this over with Bob, I have decided to leave the company to pursue other opportunities.?\nAs chief corporate affairs officer, Morrell not only oversaw the companys public relations but also was responsible for its dealings with government and its environmental and social responsibility strategies.",
    "But thats exactly where Disney has struggled mightily in recent weeks, as the company deals with billowing consequences for its response to Floridas Parental Rights in Education law, which critics derisively nicknamed Dont Say Gay? legislation.",
    "Fortunately, the strength and experience of our existing leadership team  including relatively new all-star hires  means there is no shortage of talent to guide our reputation-driving functions,? Chapek said in an email to employees.",
    "Legislators in a special session voted to dissolve the Reedy Creek Improvement District, which was created by a 1967 law that gives Disney extraordinary powers in the land thats home to Walt Disney World.",
    "Disneys current problems stem from its initial response to the parental rights legislation, which bans classroom instruction on sexual orientation and gender identity in kindergarten through third grade.",
    "Morrell previously was Pentagon press secretary and deputy assistant secretary of Defense for public affairs, serving as the chief spokesman for Defense Secretary Robert Gates and the U.S. military.",
    "Amid an extraordinary period of controversy that has engulfed Walt Disney Co., the person responsible for protecting the entertainment giants public image is out after just three months in the job.",
    "His choice was considered a surprising pick by some, coming from the corporate communications job at oil company BP and moving from London to Los Angeles to take the Disney position.",
    "His first statement to staff  that corporate statements do little good and would turn Disney into a political football?  backfired, provoking public protests from some employees.",
    "Disney Chief Executive Bob Chapek hired Geoff Morrell, a former BP executive, as the top person in charge of the Burbank firms public relations and government affairs.",
    "Morrells hiring was widely seen as a chance to reset from the era of Zenia Mucha, who was known for her fierce approach to defending Disney from critical reporters.",
    "Chapek said Kristina Schake would now lead Disneys communications efforts, serving as executive vice president of global communications, reporting directly to him.",
    "After three months in this new role, it has become clear to me that for a number of reasons it is not the right fit,? Morrell said in a Friday email to staff.",
    "In an early blunder at Disney, Morrell posted to social media the opening date of the EPCOT roller coaster Guardians of the Galaxy: Cosmic Rewind.",
    "Chapek later apologized and promised to pause political donations in the state of Florida as the company reevaluated its advocacy policies.",
    "Before Disney, Schake held roles leading President Bidens COVID-19 vaccine education program and also worked for the Obama White House.",
    "Chapek has struggled to ingratiate himself with Hollywoods notoriously clubby culture of creatives and the reporters who cover them.",
    "Since Chapek took the CEO job in February 2020, his reputation has suffered from comparisons to his smooth predecessor, Bob Iger.",
    "While at BP, Morrell was tasked with burnishing the companys reputation after the 2010 Deepwater Horizon oil catastrophe.",
    "Under the bill signed by DeSantis last week, the district in Central Florida would be eliminated on June 1 of next year.",
    "After Disney declared its goal as a company? was to see the repeal of the Sunshine States Republican-backed law, Gov.",
    "Hollywood insiders had been speculating how long Morrell would last in the job as the controversies metastasized.",
    "But Disney leadership badly misread the situation in Florida in ways that continue to have ripple effects.",
    "Supporters see the restrictions as reasonable measures to protect kids from concepts theyre not ready for.",
    "Chapek initially resisted publicly condemning the bill, despite internal pressure from employees.",
    "Ron DeSantis moved quickly to have Disneys special self-governing status near Orlando revoked.",
    "He was appointed by President George W. Bush and continued to serve under President Obama.",
    "LGBTQ activists and allies see it as an attack on gay and trans youth and teachers.",
    "For Disney, the worlds best-known entertainment brand, image is no small thing.",
    "Distributed by Tribune Content Agency, LLC.",
    "2022 Los Angeles Times.",
    "He deleted the post.",
    "Visit latimes.com."
  ]
}