{
  "id": 4364,
  "mediaId": 136,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "What Are 'Zuckerbucks'? DeSantis Touts Ban in Election Enforcement",
  "image": "https://d.newsweek.com/en/full/2028787/desantis-touts-zuckerbucks-ban.webp?w=790&f=d13644d4badf31dc559c1db9740e9519",
  "link": "https://www.newsweek.com/what-are-zuckerbucks-desantis-touts-ban-election-enforcement-1702324",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Xander Landen",
  "authorUrl": "https://www.newsweek.com/authors/xander-landen",
  "termIds": [
    661,
    1147,
    1506,
    4329,
    428,
    517,
    2661,
    5138
  ],
  "sentences": [
    "\"Zuckerberg, from Facebook, in 2020, he poured $420 million into these non-profit groups and these non-profits would go into communities that were in important states and they'd go to the election office and say 'here's millions of dollars for you guys, but you gotta bring in our operatives, you've gotta ballot harvest, you've gotta have mass mail balloting' and all of this stuff,\" DeSantis said, according to WFLA.",
    "This bad bill encroaches on every Floridian's right to a fair voting process free from arbitrary obstacles put in place by Tallahassee politicians,\" Florida Representative Fentrice Driskell, a Tampa Democrat, said Monday, according to Florida Politics.",
    "No, so this year we added in our elections bill, we added a ban on any type of Zuckerbucks, even if it's not for election administration, because it's just a corrupting influence, basically having Silicon Valley run your election,\" the governor said.",
    "The law creates a new office in the state called the Office of Election Crimes and Security that will investigate elections crimes, require voter rolls to be annually reviewed and updated, and increase penalties for election law violations.",
    "Florida Governor Ron DeSantis on Friday touted his state's recent ban on what he calls \"Zuckerbucks,\" referring to money that Meta CEO Mark Zuckerberg donated to local elections departments ahead of the 2020 election.",
    "Florida banned such donations in October, RealClearPolitics reported at the time, however DeSantis' comments came as the Republican governor was addressing an elections bill he signed into law on Monday.",
    "A Republican-backed lawsuit claiming that the $16 million that Zuckerberg and his wife Priscilla Chan donated to Michigan elections clerks was illegal was thrown out by a judge in the state last month.",
    "\"What we found after we did that was some of the elections offices were like 'yeah we can't use Zuckerbucks to run the elections, but maybe we can get Zuckerbucks for like lawsuit expenses.'",
    "Speaking in Williston, Florida, on Friday, DeSantis said \"we're also very proud of having banned Zuckerbucks in the state of Florida,\" according to local news station WFLA.",
    "\"As if targeting marginalized communities wasn't enough, the Governor has now broadened his attacks to now include the voting freedoms of all Floridians.",
    "In 2020, Zuckerberg gave $419 million to two nonprofit organizations that distributed grants to roughly 2,500 election departments.",
    "On Friday, DeSantis noted that Florida was one of the first states in the country to have \"just outright banned Zuckerbucks.\"",
    "Other conservatives, including former President Donald Trump, have criticized Zuckerberg's donations in the past.",
    "Zuckerberg has said that he doesn't plan on donating funds to local election offices ahead of the 2022 midterms.",
    "According to The New York Times, these elections officials faced funding shortages amid the pandemic.",
    "The election bill DeSantis signed into law this week faced backlash from Democrats.",
    "Newsweek has reached out to Zuckerberg for comment."
  ]
}