{
  "id": 4367,
  "mediaId": 409,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Disney Just Fired Its Corporate-Affairs Chief",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/04/disney-dont-say-gay-protest.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/disney-just-fired-its-corporate-affairs-chief/",
  "sentiment": "0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kyle Smith",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Geoff Morrell, a former Pentagon spokesman who spent only three weeks as Disneys head of corporate affairs, was said in a terse Friday-afternoon corporate memo to be leaving the company to pursue other opportunities.?\nDeadline reports: The hope at the highest level is that Morrells removal and the new reorganization will allow the media giant to come out from underneath the falling debris of the current situation.? And who caused that debris to fall?",
    "Both Disney CEO Bob Chapek and its previous CEO Bob Iger made the spectacularly unwise choice to make Disney (as far as I can tell) the only major company to interject itself into Floridas politics over its new parental-rights law, so naturally its .",
    "It is clear that this is not just an issue about a bill in Florida, but instead yet another challenge to basic human rights.? He continued: You needed me to be a stronger ally in the fight for equal rights and I let you down.",
    "Both CEOs should have simply shrugged at Floridas law, which had nothing to do with Disney anyway, but instead they allowed a handful of woke activists at the company to goad them into denouncing the law.",
    "Chapek preposterously claimed to employees on March 11, Speaking to you, reading your messages, and meeting with you have helped me better understand how painful our silence was.",
    "(The activist Left continued to shriek that Disney must do something,? while conservatives and centrists resented Disneys interference with parent-driven policies.)",
    "Then the company lied about its supposed lobbying against the bill (which did not happen), and all that was accomplished was to make both sides angry.",
    "Then Ron DeSantis and the Florida Republicans brought the hammer down on Disneys special self-government status in central Florida.",
    "I am sorry.? Even more inflammatory was Iger on March 31: A lot of these issues are not necessarily political.",
    "So, I happen to feel and I tweeted an opinion about the Dont Say Gay bill in Florida.",
    "It is about what is right and what is wrong, and that just seemed wrong.",
    "It seemed potentially harmful to kids.?\nParents were incensed.",
    "the head of corporate affairs who got canned.",
    "The Mouse never should have squeaked.",
    "To me, it wasnt about politics.",
    "Its about right and wrong.",
    "It was Chapek and Iger.",
    "It wasnt Morrell.",
    ".",
    "."
  ]
}