{
  "id": 4373,
  "mediaId": 302,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Justice Alan Lawson to retire from Florida Supreme Court",
  "image": "https://www.tampabay.com/resizer//e2aKCAxOf12BOB04ObTqDmOo2eQ=/fit-in/900x506/smart/filters:fill(333):format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/VKDGGPGWINFAJJLBAUS7RHCBIU.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/04/29/justice-alan-lawson-to-retire-from-florida-supreme-court/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "I ran for Governor in part because of the importance of the gubernatorial responsibility of shaping our Supreme Court,? DeSantis said in the statement, and I will appoint a successor to Justice Lawson who will uphold our states Constitution and interpret the law with the same dedication to the original understanding of the text that Justice Lawson demonstrated throughout his judicial career.?\nAn announcement from the Supreme Court did not detail Lawsons future plans, though it described his involvement in charity work, including in such things as medical efforts in Central America.",
    "To those who I serve with now, I can only say that leaving you, this great institution and our court family is the most emotionally difficult decision of my life, although I know that this is the right decision and the right time.?\nGet insights into Florida politics\nSubscribe to our free Buzz newsletter\nBy Jim Saunders, News Service of Florida",
    "One of the greatest joys of my 35-year legal career has been and continues to be the ability to work alongside a bench and bar filled with extraordinary individuals who work tirelessly to assure that the citizens we serve are well-served by our system of justice.? Lawson, 60, wrote in a retirement letter to DeSantis.",
    "In the announcement, Lawson called serving on the Supreme Court the highest honor I have enjoyed in my career.?\nI once again express my gratitude to Rick Scott for the trust he placed in me by granting me this opportunity,? Lawson, who went to law school at Florida State University, said.",
    "Julie and I plan to enjoy retirement, prioritizing family, health and fitness, spiritual growth and development, friends, the outdoor sports that we enjoy, and charitable work in the United States and abroad,? Lawson said in a prepared statement, referring to his wife, Julie.",
    "Three DeSantis appointees  Justices Carlos Muniz, John Couriel and Jamie Grosshans  have joined Lawson, Chief Justice Charles Canady and Justice Ricky Polston to form a solid conservative majority on the seven-member court.",
    "That system is often criticized yet still endures as the best system of justice that the world has ever seen.?\nLawson has been part of a major conservative shift on the Supreme Court over the past three years.",
    "Godspeed as you initiate that process.?\nDeSantis said in a statement Friday that Lawson has admirably served the people of Florida? and pointed to the justices dedication to public service.",
    "That shift was prompted by the retirement in early 2019 of longtime Justices Barbara Pariente, R. Fred Lewis and Peggy Quince, who had helped make up a relatively liberal majority.",
    "I have every hope that you will further strengthen Floridas justice system as you attentively and thoughtfully appoint my replacement,? Lawson wrote in the letter to DeSantis.",
    "Rick Scott, will end a 21-year judicial career that also included serving as an Orlando-area circuit judge and a member of the 5th District Court of Appeal.",
    "DeSantis will appoint a successor to Lawson after a judicial nominating commission interviews candidates and submits recommendations.",
    "TALLAHASSEE  Florida Supreme Court Justice Alan Lawson announced Friday he will retire Aug. 31, a move that will allow Gov.",
    "I also want to thank each justice who I have had the privilege of serving alongside: I value and respect each of you.",
    "Justice Jorge Labarga, who joined Pariente, Lewis and Quince on many major issues, is now often the lone dissenter.",
    "Ron DeSantis to continue placing his imprint on the states highest court.",
    "Ron DeSantis to appoint another member of the states high court.",
    "Lawson, who was appointed as a justice in 2016 by former Gov.",
    "This will allow Gov."
  ]
}