{
  "id": 4375,
  "mediaId": 238,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "American parents are generally fine with whats being taught in school",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/04/29/american-parents-are-generally-fine-with-whats-being-taught-school/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "For all of the time and energy spent discussing these subjects, though, and for all of the intonations from elected officials about how theyre responding to the concerns of parents in their districts or states, new polling conducted by Ipsos for NPR reveals something interesting.",
    "The networks focus on schools before the Virginia gubernatorial contest last year has been credited either with capturing a grass-roots sentiment that drove the election results (which is how Foxs defenders frame it) or with driving an uproar that had the same effect.",
    "Republicans are significantly more likely to say parents have too little say than are Democrats, but even among Republicans, more say either that parents have the right amount of say or too much say over whats happening in schools.",
    "In only one case was a partisan subset of respondents more likely to say a subject wasnt being taught in keeping with their personal values than that it was: Republicans assessing how sexuality was being taught.",
    "When race was triggering outcry last fall, a common claim was that it was sparked not by Fox News coverage but by parents seeing what children were learning during pandemic-related at-home instruction.",
    "Are Republicans more likely to say that they are worried about how its being taught because of what they see in their childrens curriculums or because of what theyre hearing in conservative media?",
    "The Florida law was effective at ginning up attention for that states governor, Ron DeSantis (R), and the discussion has been accompanied by a backlash against visibility for same-sex couples.",
    "Parents also were consistently more likely to say that schools were teaching even controversial subjects in keeping with their own values than they were to say that schools were not.",
    "This year, thanks largely to legislation passed in Florida that prohibits discussions of sexuality? in nebulous terms, its been about LGBTQ Americans (though race still comes up).",
    "That has since evolved, with concern about what teachers are imparting to children expanding into stated concerns about what information is available to children more generally.",
    "Democrats and Republicans have the same general view on how they feel about the way in which those issues are taught, and both groups generally approve of how its being done.",
    "For politicians such as DeSantis, theres value in responding to the loud minority: national attention and clout with his base as he seeks reelection if not higher office.",
    "A rash of schools, facing pressure from parents, have removed school library books that are deemed controversial  often ones dealing with same-sex relationships or race.",
    "The Democrat whom Youngkin defeated in Virginia was attacked repeatedly (especially in conservative media) for saying that parents shouldnt be guiding curriculums.",
    "But its also useful to remember that shouting by one part of one party in one state is not necessarily reflective of what the country overall wants to say.",
    "That question included a healthy not sure? response rate, too, but note that fewer than 1 in 5 respondents overall said that parents had too little say.",
    "The other was that Democrats were significantly less likely to say that schools were teaching patriotism in a way that didnt comport with their values.",
    "So, for example, they were asked whether the schools their children attended taught U.S. history in a way that was consistent with their own values.",
    "Polling showed that Virginia voters were suddenly far more concerned about education as the election approached  as Foxs education coverage spiked.",
    "That subject, sexuality, was one of two places where there was a statistically significant gap between the parties (indicated with a dashed line).",
    "The first asked parents whether they thought that schools were teaching various subjects in ways that comported with their own personal values.",
    "The poll also asked about other subjects, including race and racism, the impacts of slavery and racism, and sexuality and gender identity.",
    "(In many cases, too, parents said that they didnt think the subjects were being taught at all, this being represented by the gray bars.)",
    "Since President Biden was inaugurated on Jan. 20, 2021, Fox News has talked about whats being taught in schools more than 1,000 times.",
    "It would be informative to know how parents would have answered that question last year, when race was at the center of this dispute.",
    "In each case, more parents said they thought those things were being taught in keeping with their own values than said they werent.",
    "In other words, to what extent is the national conversation influencing views about how sexuality is being taught?",
    "National conversations can have the effect of setting national expectations that do not match local experiences.",
    "Most Americans think parents have the right amount of say over whats being taught and whats in school libraries.",
    "Last years political debate often was framed as being about how much say parents had in classroom instruction.",
    "People are alarmed at rising crime but dont see crime rising in their neighborhoods.",
    "And on classroom education, we appear to see a somewhat similar divide.",
    "(Its not actually clear how important the issue was in electing Gov.",
    "People hate Congress but support their individual representatives.",
    "Glenn Youngkin (R), but thats beside the point for this article.)",
    "On average, there have been 2.3 15-second such segments per day.",
    "That was the other interesting question posed by NPR and Ipsos.",
    "Or would they have looked more like the sexuality question now?",
    "Now, however, they seem not to be terribly worried about it.",
    "Thats the purple and orange bars below, respectively.",
    "We see similar patterns in politics a lot.",
    "Since then, the conversation has shifted.",
    "Would the values have been the same?",
    "Last year, the focus was on race.",
    "But notice those charts on race.",
    "Most said they did."
  ]
}