{
  "id": 4376,
  "mediaId": 558,
  "date": "d2022-04-29T17:14",
  "headline": "DeSantis says hell bring constitutional carry to Florida before he leaves office",
  "image": "https://s.yimg.com/uu/api/res/1.2/NcXpbz2tQi0a3wJOY7Ei4A--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/wftv_cox_videos_188/0b059b06823c1b2851e5bb8c46649ec7",
  "link": "https://news.yahoo.com/desantis-says-ll-bring-constitutional-221426988.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jeff Deal",
  "authorUrl": "",
  "termIds": [
    661,
    629,
    2537,
    2661,
    5040
  ],
  "sentences": [
    "Proponents believe its their constitutional right and needed for self-defense, but opponents do not even like the term constitutional carry.?\nTheres nothing constitutional about carrying a gun in public without a background check or safety training,? said Allison Anderman, director of local policy with Giffords Law Center to Prevent Gun Violence.",
    "I cant tell you exactly when but Im pretty confident that I will be able to sign the constitutional carry into law in the state of Florida,? DeSantis said in a news conference in Levy County Friday.",
    "Click here to download the free WFTV news and weather apps, click here to download the WFTV Now app for your smart TV and click here to stream Channel 9 Eyewitness News live.",
    "Anderman said all constitutional rights have limitations, and that removing background checks and training will make communities less safe.",
    "Ron DeSantis said Friday that he will sign a bill allowing constitutional carry in Florida before he leaves the governors office.",
    "It will put more guns on the street, it will make it harder for law enforcement to determine who is legally carrying,? she said.",
    "Right now, people need concealed weapons permits to walk around with a gun in Florida.",
    "Constitutional carry means that permit requirement goes away.",
    "Both Alabama and Georgia have made similar changes this year.",
    "Gov."
  ]
}