{
  "id": 4377,
  "mediaId": 195,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Someone like Trump  but not Trump",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/trumpdonaldcpac2_030219getty.jpg?w=980&h=551&crop=1",
  "link": "https://thehill.com/opinion/white-house/3468877-someone-like-trump-but-not-trump/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Armstrong Williams",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    2195,
    4643,
    146,
    428,
    2661,
    2910,
    2945
  ],
  "sentences": [
    "Throughout Trumps tenure in office, many supported him; as a member of the media, I was invited to the White House and even interviewed him for my nationally syndicated program, The Armstrong Williams Show.? With that said, I cant help but raise a simple yet critical question: Is it time for someone other than Trump to take the helm  someone who is similar to him, in terms of policy and candor, but without as much of the unending turmoil that his personality has inflicted on Americans?",
    "In this way, perhaps, Trump is demonstrating that his true power may be greater than anyone anticipated  particularly those in the mainstream media  and that, unlike during his time in the White House, continuing Democratic investigations and negative press likely will not impact his role in the Republican Partys direction.",
    "I can appreciate how difficult it may be for politicians to cede power, and I also can appreciate how hard it is for voters to move on to someone new  especially when, in the case of Trump, so many believed the media and political establishment treated him unfairly throughout his term.",
    "We are all flawed, but a president with personality flaws brings with him fuel for the fire, and his policies will garner greater attention for the things he does wrong  and Republican voters will bear the burden of supporting and absorbing those flaws.",
    "Regardless of their positions, intentions or leadership qualities, the candidates almost certainly will be presented in the same light as their predecessors, as members of both political parties have the misfortune of absorbing.",
    "Trump has shown his ability to raise enormous sums of money and he is using a little of that money to back some Republican candidates as the party battles to reclaim control of the House and Senate this fall.",
    "For Democrats, President Obama was a textbook illustration of this; Republicans must recognize that the major names who have surfaced so far are not the only potential competitors two years from now.",
    "Considering their respective experience, this would not be too far-fetched; not only would they represent Americas present and future, but they would bring a wealth of expertise to the White House.",
    "Donald Trump appears to remain the Republican Partys front-runner for the next presidential election, but many have said theyre amenable to another candidate if Trump decides not to run in 2024.",
    "If Republicans can unite and support someone who is similar to Trump (but is not Trump), they will avoid having to make excuses, manufacture justifications, or overlook indiscretions.",
    "Armstrong Williams (@ARightSide) is the owner and manager of Howard Stirk Holdings I & II Broadcast Television Stations and the 2016 Multicultural Media Broadcast Owner of the Year.",
    "The GOP cannot relinquish control of cultural battles to Democrats and their fanaticism, which threatens to fundamentally redefine every cultural standard in our nation.",
    "He is the author of Reawakening Virtues.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "This does not imply that they must fully withdraw from involvement in Americas affairs; they can counsel, mentor and support the future generation of leaders.",
    "DeSantis is much like Trump in his candor with the media and Democrats, and he has the experience and understanding necessary to be a successful executive.",
    "Still, we should not be quick to dismiss a dark horse candidate  that is, an unknown individual who emerges from the shadows to capture the limelight.",
    "He is familiar with the bureaucracy associated with working in political institutions and is adept at navigating them to accomplish goals.",
    "Over the years, it has become abundantly clear that our political system does not adequately foster the next generation of leaders.",
    "Additionally, such a GOP ticket would accord the former president the deference he deserves as a senior statesman and party leader.",
    "Yet, there are Republicans who believe the party needs fresh leadership  again, someone who resembles Trump but is not Trump.",
    "With endorsements and personal involvement, he is helping a few candidates to communicate with and motivate supporters.",
    "Several younger politicians have been named as potential new national leaders for the GOP, including Gov.",
    "Both parties, in fact, need youthful leaders who can speak to Americas future and unrealized potential.",
    "And Republicans need younger leaders who are capable of combating the secularism espoused by the left.",
    "Perhaps Scott, the junior senator, could join forces with DeSantis on a DeSantis/Scott ticket in 2024.",
    "We must move forward, however, and allow new faces to succeed some of our elderly statesmen and women.",
    "These candidates should not be difficult to track down; in fact, we already know who some of them are.",
    "There are candidates who possess some of his positive characteristics and not his negative ones.",
    "Conservatives would see policies similar to those proposed by Trump, without a divisive persona.",
    "Each is youthful, intelligent and charming, demonstrating that the future indeed can be bright.",
    "Ron DeSantis of Florida, Sen. Tim Scott of South Carolina and former South Carolina Gov.",
    "We all have our place and we must recognize when the time has come to pass the mantle.",
    "Of course, whoever becomes the Republican nominee will bear the mark of the GOP.",
    "Republicans may be slowly realizing that they do not have to die by the sword.",
    "They very well may be among those who make up the Republican Partys future.",
    "The difficult thing for many Republicans will be to let go of Trump.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "We prefer to hold onto old ideals, rather than push forward.",
    "Trump does not have to be the partys sole savior.",
    "Is that possible?",
    "Nikki Haley."
  ]
}