{
  "id": 4380,
  "mediaId": 65,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "DeSantis: 'We will be fighting back' against Biden disinformation board, won't let him 'get away' with it",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/1e58575b-2cca-4faa-b731-e2fd5afaa20b/fc63f6aa-1b21-4d66-9d37-adbf23af85d0/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/desantis-we-will-be-fighting-back-against-biden-disinformation-board-wont-let-him-get-away-with-it",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Mark Miller",
  "authorUrl": "https://www.foxnews.com/person/m/andrew-mark-miller",
  "termIds": [
    661,
    1609,
    1647,
    2066,
    4275,
    2661
  ],
  "sentences": [
    "The pushback from DeSantis comes as Republicans across the country have slammed the Biden administration over the board that Homeland Security Secretary Alejandro Mayorkas testified on Wednesday would \"bring the resources\" together to address the \"threat\" of online disinformation.",
    "\"It sounds like the objective of the board is to prevent disinformation and misinformation from traveling around the country in a range of communities,\" White House Press Secretary Jen Psaki said in response to Republican criticism of the board on Thursday.",
    "\"The same party that spent years promoting the Russia collusion hoax, suppressed the Hunter Biden laptop story, & equated parents to terrorists believes it has credibility to control your speech,\" House Minority Leader Kevin McCarthy tweeted on Friday.",
    "Critics have also pointed toward highly politicized comments in support of Democrats that the executive director of the board, Nina Jankowicz, has made in the past, including comments dismissing the legitimacy of Hunter Bidens laptop.",
    "DeSantis Press Secretary Christina Pushaw told Fox News Digital that his office is \"closely monitoring\" the \"unprecedented threat\" from the board in order to assess how to \"most effectively defend Floridians' Constitutional rights.\"",
    "Ron DeSantis pledged to fight back against the Biden administrations recent move to establish a \"Disinformation Governance Board\" in order to fight internet \"disinformation\" leading up to the November midterms.",
    "The move was announced just days after Tesla CEO Elon Musk agreed to buy Twitter after publicly stating on multiple occasions he intends to implement an approach focused on freedom of speech.",
    "\"Clearly, our entire principles that the country was founded on you cannot have a Ministry of Truth in this country,\" the Florida Republican said during a press conference on Friday.",
    "\"They didn't need a 'Disinformation Governance Board' until @elonmusk threatened their control over the narrative,\" Republican Congressman Troy Nehls tweeted.",
    "\"So lets get real here, lets make sure were doing things to benefit Floridians and Americans but were not going to let Biden get away with this one.\"",
    "\"Biden must immediately abandon his plan to create an Orwellian Ministry of Truth.\"",
    "Many conservatives also criticized the timing of the creation of the board.",
    "\"We will be fighting back,\" DeSantis added.",
    "\"I'm not sure who opposes that effort.\"",
    "Florida Gov."
  ]
}