{
  "id": 4386,
  "mediaId": 151,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Inflation saves DeSantis  and solar",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/the-long-game/2022/04/29/inflation-saves-desantis-and-solar-00028907",
  "sentiment": "0.524",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1394,
    3989,
    4008,
    2995,
    3265,
    2590,
    2661,
    5141
  ],
  "sentences": [
    "If we are heading into a recession, and if natural gas prices stay high, expect policymakers to pay more attention to electricity rates, which fund a massive array of climate and adaptation measures: Electric vehicle charging stations, renewable energy, transmission lines to carry renewable energy, and burying power lines to reduce the risk of wildfires.",
    "Given that the United States is experiencing its worst inflation in 40 years and that consumers have seen steep increases in the price of gas and groceries, as well as escalating bills, the state of Florida should not contribute to the financial crunch that our citizens are experiencing,? DeSantis wrote in his veto message.",
    "This week, three dozen oil and gas trade associations led by the Western Energy Alliance asked the commission to extend its deadline for public comment, noting that the 506-page rule has 1,068 footnotes, references 194 academic and governmental reports, imposes a $10.2 billion cost, and seeks answers to 196 questions.",
    "May 4  Resources for the Future holds a virtual discussion on \"Working Forests: A Path to Climate Solutions\" at 12 p.m.\nEvents are listed in Eastern Time\nFollow us on Twitter\nCatherine Boudreau @ceboudreau\nDebra Kahn @debra_kahn\nGreg Mott @gwmott\nLorraine Woellert @Woellert\nJordan Wolman @jordanwolman\nFollow Us",
    "Anheuser-Busch Cos. got nearly $5.8 million payable through 2024 to design and install a microgrid system at its Los Angeles-area brewery, while Sun-Maid got $5.3 million payable through next year to fund a fully electric raisin dryer at its Fresno facility.",
    "\"The stuff that you might not do to reduce costs because you want to have your cake and eat it too, maybe you change your view on that in an interval of time like this,\" said Michael Wara, director of Stanford University's climate and energy policy program.",
    "We liked this argument in particular: ?Climate change is a politically-charged issue? and the SEC proposal would compel corporations to explain the views and opinions of their boards and officers.?\n(We thought climate change was a scientific issue?)",
    "While such corporations are perhaps not the ideal poster child? for a cap-and-trade revenue recipient, they likely do deliver emission reductions, said Ethan Elkind, a climate research fellow at the University of California, Berkeleys School of Law.",
    "If these are really high energy-intensive pieces of equipment with a pretty big carbon footprint and a little bit of money from the state can give an incentive to these companies to swap them out  arguably thats a good investment,? he said.",
    "Fidelity's move to promote bitcoin to investors raises questions about the credibility of the company's climate goals, which include integrating sustainability \"considerations across our products, services, and investment decisions.\"",
    "BUILDING BLOCKS\nCASHING IN  California prides itself on using revenue from its greenhouse gas trading program to advance zero-emission vehicles, fund housing near transit and benefit disadvantaged communities.",
    "The prospective Republican presidential candidate on Wednesday vetoed a GOP bill that would have cut payments to owners of rooftop solar systems  something long sought by the state's investor-owned utilities.",
    "The new bitcoin offering \"is just fundamentally incompatible\" with Fidelity's environmental aims, said Duke Law School professor Lee Reiners, executive director of the Duke Global Financial Markets Center.",
    "SUSTAINABLE FINANCE\nRETIREMENT BROS  Fidelity Investments, which manages 23,000 companies 401(k) programs, announced this week it would let them add a bitcoin investment option to their retirement plans.",
    "The letter was led by Lawrence Cunningham, a professor at George Washington University Law School and the man behind the Quality Shareholder Initiative, a research group focusing on individual investors.",
    "\"The one thing I feel like I can say with confidence is that he is recognizing that there's some pretty intense economic pressures, and he's choosing to protect consumers over protecting utilities.\"",
    "The comment period, which is set to close at the end of May, should be extended to a full 180 days, which the Administrative Procedure Act requires for complex rulemakings, the group wrote.",
    "WHAT WE'RE CLICKING\n Foundations are under pressure from environmental justice groups to shift their funding strategies and back local climate projects instead of technological research.",
    "Tuesday through Friday, we've got data-driven storytelling, compelling interviews with industry and political leaders, and more news to keep you in the loop on sustainability.",
    "Food and beverage production generates less than 5 percent of the industrial sectors emissions, which in turn make up about a quarter of Californias total carbon pollution.",
    "LOOK AHEAD\nMay 2  American University's School of Public Affairs' Center for Environmental Policy holds its annual William K. Reilly Awards for Environmental Leadership.",
    "WASHINGTON WATCH\nTOO LONG, HAVEN'T READ  The fossil fuel industry and its allies are taking aim at the Securities and Exchange Commissions climate disclosure rule.",
    "Inflation saves DeSantis  and solar\nBy DEBRA KAHN and LORRAINE WOELLERT\n04/29/2022 12:00 PM EDT\nPresented by\nTHE WEEK THAT WAS\nDESANTIS DELIGHTS DEMS  Florida Gov.",
    "Our team is sustainability editor Greg Mott, deputy editor Debra Kahn, reporters Lorraine Woellert and Catherine Boudreau and digital producer Jordan Wolman.",
    "May 3  Environmental Protection Agency holds a virtual meeting of the Science Advisory Board Per- and Polyfluoroalkyl Substances Review Panel.",
    "California regulators are rewriting their rooftop rules after getting slammed by solar companies for proposing drastic cuts to incentives.",
    "Other big-name recipients include PepsiCo Inc., Frito-Lay Inc., Foster Farms, Campbell Soup Co., E&J Gallo Winery and Saputo Cheese USA.",
    "Investment strategy aside, bitcoin also has a huge carbon footprint  its annual energy consumption has grown to rival that of Thailand.",
    "need the U.S. to step up domestic battery production if the companies are to meet their EV production goals, Bloomberg reports.",
    " \"Wynn Bruce lit himself on fire on Earth Day 2022 because he believed it might inspire people to work against climate change.",
    "Reach them at gmott@politico.com, dkahn@politico.com, lwoellert@politico.com, cboudreau@politico.com and jwolman@politico.com.",
    "It's a huge upset for Florida Power & Light, which wrote the bill and has been trying to reduce solar incentives for years.",
    "Specifically, the governor took exception to a provision that would have let utilities pass solar costs to all customers.",
    "\"There's a lot of speculation going on in Florida,\" said Katie Chiles Ottenweller, Southeast director for Vote Solar.",
    "Its the first major plan administrator to venture into cryptocurrency, as Corbin Hiar reports for POLITICOs E&E News.",
    "Sunshine vs. Golden State: DeSantis is now in the position of setting a pro-solar bar for his rival, California Gov.",
    "Solar advocates are still trying to make sense of what happened, but they're not looking a gift horse in the mouth.",
    " Deforestation is killing the Amazon, and U.S. beef consumers are accomplices, according to the Washington Post.",
    "But a sizable chunk of money is also going to big business, as Anne C. Mulkern reports for POLITICO's E&E News.",
    "The lawsuit, when it comes, likely will be built around some of the arguments laid out in these letters.",
    "4 p.m.\nMay 2  The Independent Community Bankers of America holds its 2022 Capital Summit through May 4.",
    "1 p.m.\nMay 2  Lux Research holds a debate in Boston on whether sustainability is the enemy of growth.",
    "Over in academia, 22 law and finance professors challenged the SECs authority to even issue the rule.",
    "Welcome to the Long Game, where we're delivering the latest on efforts to shape our future.",
    "Inflation makes politicians do off-brand things  see Democrats' dithering over gas taxes.",
    "Ron DeSantis stunned Democrats this week by siding with them in a war over solar power.",
    "The Chronicle of Philanthropy has a deep dive into the changes at ClimateWorks.",
    "The value of bitcoin has fallen nearly 43 percent since last November.",
    "There is not any more or less meaning we need to take away from it.\"",
    "His justification for bucking his fellow Republicans?",
    "Four days a week and still totally free!",
    "YOU TELL US\nGAME ON  Happy Friday!",
    "Sign up for the Long Game.",
    "Read more from Anne here.",
    "Gavin Newsom, to clear.",
    "More from Corbin here.",
    "Pay attention.",
    " Ford and G.M.",
    "Want more?"
  ]
}