{
  "id": 4393,
  "mediaId": 65,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "What Joe knew about Hunter, say 'no' to college and more Fox News Opinion",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/9125f2b1-e77b-4bb3-be88-f129299be117/69ce5811-e03d-45fa-9c45-96add05e7f66/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/opinion/joe-biden-hunter-biden-college",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lynne Jordal Martin",
  "authorUrl": "https://www.foxnews.com/person/j/lynne-jordal-martin",
  "termIds": [
    661
  ],
  "sentences": [
    "Continue reading\nSTEP UP, BIDEN AND MAYORKAS  In Eagle Pass, Texas, my Republican colleagues and I saw the harm Biden administration policies are causing.",
    "Watch now...\nBACK TO BASICS  America's parents dont want gender ideology and critical race theory taught to their children.",
    "TUCKER CARLSON  To herald the coming of the new Soviet America, the administration announced its own Ministry of Truth.",
    "Continue reading\nJUST SAY NO'  America's high school students should be brave counterrevolutionaries and skip college.",
    "Continue reading\nMIKE PENCE  Religious liberty in America has never been in greater danger than it is today.",
    "Continue reading\nSTOP THE HUNTER STONEWALLING  The American people deserve answers from President Biden.",
    "Continue reading\nGREG GUTFELD  The Biden admin is trying to create a new shiny arm of government.",
    "Continue reading\nTHE OTHER S WORD  Its not too late to avoid the misery of stagflation.",
    "Ron DeSantis has taken on left more aggressively than any governor in modern memory.",
    " Biden's student loan forgiveness plan isn't debt forgiveness, it's debt for all.",
    "Continue reading\nVIDEO OF THE DAY  Laura Ingraham says Florida Gov.",
    "Continue reading\nCARTOON OF THE DAY  Leading From Behind.",
    "To receive this newsletter in your email, subscribe here.",
    "We want our children to learn how to read and write.",
    "Our border is not being effectively managed.'",
    "Welcome to the Fox News Opinion Newsletter.",
    "Check out all of our political cartoons...",
    "But to do so we need three policy pivots.",
    "Continue reading\nFORGIVE AND FORGET?"
  ]
}