{
  "id": 4397,
  "mediaId": 124,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Most Americans don't support politicians punishing firms for their views, Reuters/Ipsos poll finds",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-04/220429-ron-desantis-mjf-1037-c754c6.jpg",
  "link": "https://www.nbcnews.com/politics/politics-news/americans-dont-support-politicians-punishing-firms-views-reutersipsos-rcna26636",
  "sentiment": "0.375",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    270,
    428,
    524,
    2993,
    2661,
    2851,
    2945,
    2959
  ],
  "sentences": [
    "DeSantis signs bill ending Disneys self-governing status in Florida\nApril 22, 202203:31\nBut even when prompted along the lines of DeSantis own argument for his action  that laws should remove benefits of government tax breaks from corporations that push a woke? agenda  36 percent of Republicans nationally said they would be less likely to support a candidate with such a view.",
    "The two-day poll completed on Thursday showed that 62 percent of Americans  including 68 percent of Democrats and 55 percent of Republicans  said they were less likely to back a candidate who supports going after companies for their views.",
    "Presented with a list of prominent politicians, a full 25 percent of Republican respondents said DeSantis best represents the values of their party, second only to former President Donald Trump who was favored by 40 percent of Republicans.",
    "DeSantis signed a bill last week that strips Disney of self-governing authority at its Orlando-area parks in retaliation for its opposition to a new Florida law that limits the teaching of LGBTQ issues in schools.",
    "For DeSantis, a rising star in the Republican Party, it was an attempt to bolster his conservative credentials as a culture warrior ahead of a possible run for the 2024 Republican presidential nomination.",
    "Half of U.S. voters support laws banning classroom discussion on sexual orientation or gender identity for children age 5-11, including 69 percent of Republicans and 36 percent of Democrats.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nThe Reuters/Ipsos poll still showed that DeSantis, 43, is a potential force in national Republican politics.",
    "WASHINGTON  A bipartisan majority of U.S. voters oppose politicians punishing companies over their stances on social issues, a cold reception for campaigns like Florida Gov.",
    "But the poll also showed a nation deeply divided on how schools teach about sexual orientation and gender identity  the subject of the controversial Florida law.",
    "It gathered responses from 1,003 adults and had a credibility interval, a measure of precision, of about 4 percentage points.",
    "The Reuters/Ipsos poll was conducted online, in English and throughout the United States.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Ron DeSantis against Walt Disney Co., a Reuters/Ipsos poll found.",
    "Greg Abbott garnered 9 percent.",
    "Texas Gov."
  ]
}