{
  "id": 4408,
  "mediaId": 151,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "The fall of the White House correspondent",
  "image": "",
  "link": "https://www.politico.com/newsletters/politico-weekend/2022/04/29/the-fall-of-the-white-house-correspondent-00028667",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    700,
    920,
    1147,
    1169,
    1930,
    2011,
    2183,
    4847,
    403,
    2945
  ],
  "sentences": [
    "I dont really watch the briefings.?\nAs members of D.C.s press corps shake out their tuxedos and cocktail dresses for the first White House Correspondents Dinner in three years, Tani blows up their dirty little secret: Its kind of a boring job, just as Bidens team wants it to be.",
    "Here are our tips for sounding like a White House Correspondents insider this weekend:\nIf anyone asks whether you actually went to the dinner, just smile and complain knowingly about the crowd on the escalator.?\nFor Gods sake, dont say you met the president at the dinner.",
    "That kind of across-the-aisle chumminess wasnt so unthinkable back in 1947, when two freshmen lawmakers named John F. Kennedy and Richard Nixon took a trip together to McKeesport, Pa.  a largely pro-union town  to debate the future of labor law in America.",
    "President Bill Clinton takes a spin through the halls of a near-abandoned Old Executive Office Building (later renamed the Eisenhower Executive Office Building) to film a skit, The Final Days,? for his last White House Correspondents Dinner.",
    "So we had Sam Stein talk to comedian David Litt, the author of Thanks, Obama and a former speechwriter for the president who wrote jokes for the White House Correspondents Dinner, about how to make politicians funny for real.",
    "I havent been since Graydon pulled out.? Or, The David Bradley dinner has become so corporate now that Laurene Powell Jobs is involved.?\nMake knowing references to the old days when Tammy's brunch was at Tammy's house.",
    "I cant believe Im experiencing this right now and I cant tell my coworkers or my friends,? said the man behind the account, who works on the Hill and keeps his Instagram a secret from all but his partner.",
    "Bad Bosses of Capitol Hill, Beware ... Ruby Cramer lands the first interview with the man behind @dearwhitestaffers  the Instagram account that has the halls of Congress on edge, or obsessed, or both.",
    "With 85,100 followers and counting, the account shares anonymous horror stories of harassment and discrimination purportedly from Hill staffers, and has already helped drive a union movement.",
    "On a weekend dedicated to freedom of the press, is it OK to raise a glass and toast with a seditionist?? asks the ultimate D.C. insider  Republican staffer-turned-PR pro Juleanna Glover.",
    "Every Friday, we will send you a collection of gripping narratives, sharp analysis from the nexus of culture and politics, saucy D.C. gossip and a little bit of internet cheekiness.",
    "In his latest column, Mike Schaffer captures the worries of D.C. insiders who can no longer easily see the scene as one big game  but might accept a few invitations anyway.",
    "The glitzy return of the White House Correspondents Dinner  and maybe more importantly, the whirl of pre- and post-parties  feels temptingly normal to a lot of This Town.",
    "Casually drop in conversation that you were one of the few people offered a free ride home from the NBC after party in an electric F-150 Lightning.",
    "The fall of the White House correspondent\nBy POLITICO MAGAZINE\n04/29/2022 09:03 AM EDT\nWelcome to the first edition of POLITICO Weekend.",
    "He dished on that anger translator? bit from the 2015 dinner, what made Obama a natural performer? and Donald Trumps only good joke.",
    "Bryan Bender takes us on a train trip back in time, when JFK and Tricky Dick shared a sleeping berth on the ride back to Washington.",
    "The skit also shows the lame duck? president making origami, shopping on eBay and waiting for laundry in a near-abandoned office.",
    "The nonstop circus of the Trump era brought a whole new level of fame and fortune to the reporters who sparred with him.",
    "Every week, the Weekend asks a question in the POLITICO/Morning Consult poll and sees what the crosstabs yield.",
    "There was a time when a seat in the White House briefing room was the ultimate launching pad to media stardom.",
    "The Obama years fueled the careers of now-household names Jake Tapper, Chuck Todd and Savannah Guthrie.",
    "When JFK Slept With Nixon ... Can you imagine Bernie Sanders going on a roadtrip with Mitch McConnell?",
    "Thanks to the William J. Clinton Presidential Library for digging into their archives to find this.",
    "A President Walks Into a Bar ... Brace yourself: Bad political jokes are coming this weekend.",
    "No more firehose of rich publishing deals for insidery books about the administration.",
    "But I repeat myself.?\nThat was our esteemed legislative body, according to  whom?",
    "Jen [Psaki] is very good at her job, which is unfortunate,? said one reporter.",
    "But things have changed, writes Max Tani in his latest for Politico Magazine.",
    "**Who Dissed answer: Mark Twain said that about Congress in the early 1880s.",
    "We'll entertain, inform and give you plenty to talk about over the weekend.",
    "But you can talk about who you saw at the VIP event with Biden beforehand.",
    "Only board members of the White House Correspondents Association do that.",
    "I cant think of any,? one well-known television news executive told Tani.",
    "Its not that you werent invited, its that you turned the invites down.",
    "One of the few times I did against him.?\nSuppose you were an idiot.",
    "Ron DeSantis fans are also fans of Disney films and TV shows.",
    "Bye-bye to the massive TV budgets for White House specials.",
    "Even power needs to take a moment off every now and then.",
    "Not just pre-Covid normal, but even pre-Trump normal.",
    "Email us at politicoweekend@email.politico.com.",
    "The stories matter, arguably more than ever.",
    "When that moment comes, we're here for you.",
    "And suppose you were a member of Congress.",
    "(And tell your friends to sign up here.)",
    "(Scroll to the bottom for the answer.)",
    "Dreading D.C.s Biggest Night ...",
    "What is it, now, Paramount?",
    "58 percent  of Florida Gov.",
    "But the Biden press room?",
    "They drew for top bunk.",
    "Got any suggestions?",
    "Oh, the after-party?",
    "I won,? Nixon said.",
    "No Problem ...",
    "And the stars?",
    "Should it?",
    "No Invite?",
    "Follow Us"
  ]
}