{
  "id": 4411,
  "mediaId": 558,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "The Disney fiasco could have ominous consequences for Floridas government, major credit agency warns",
  "image": "https://s.yimg.com/ny/api/res/1.2/xWfkQ87Ndf2Y32vW8rDg0g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/5XTTGO6Reix5U1qq3FG44g--~B/aD0xOTIwO3c9Mjg4MDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fortune_175/00185e458afe72c4d37996a650ac50f2",
  "link": "https://finance.yahoo.com/news/disney-fiasco-could-ominous-consequences-185401161.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Colin Lodewick",
  "authorUrl": "",
  "termIds": [
    661,
    524,
    3269,
    2661,
    2849,
    5082,
    5109,
    5130
  ],
  "sentences": [
    "Late on Thursday, Fitch Ratingsone of the Big Three? credit rating agenciessent a warning to Florida: Dissolving Disneys special district without careful provision for its outstanding debt could threaten the states financial reputation.",
    "[The bill] creates ambiguity around which entity or entities will ultimately repay bondholders, which carries adverse consequences for RCID's credit quality and was a significant factor in the Negative Watch,? said Fitch.",
    "Florida formed the Reedy Creek Improvement District (RCID) with 1967s Reedy Creek Act, which granted an area of over 25,000 acres in the middle of the state the wide-ranging powers of a municipal government.",
    "Fitch explained that its rating criteria factors in respect for property rights and bondholder security when assessing local governmentsan expectation that the Reedy Creek dissolution bill ignores.",
    "The law, known popularly as Dont Say Gay,? has led a wave of similar legislative proposals across the U.S. aimed at limiting discussion of LGBTQIA+ issues in school settings.",
    "The district owns and operates its own public services, including a large fire department, and can issue tax-exempt bonds, taking on debt to finance infrastructure projects.",
    "The agency pointed to the fact that the bill is set to take effect on June 1, 2023, but does not provide information about how to take care of the districts bonded debts.",
    "The counties are not equipped to handle that scenarioa tricky position considering that that local governments should absorb the debts of their former special districts.",
    "As a result, the agency placed its ad valorem tax bonds and utilities revenue bonds on ratings watch negative,? signaling the risks that bondholders now face.",
    "The bill unwinding the RCID reflects a unique and dynamic level of discord between the state and Disney,? said Fitch in its statement.",
    "Ron DeSantis signed legislation ordering the dissolution of several special districts in the state, including Reedy Creek.",
    "include the transference of debts and service responsibilities to Orange and Osceola counties, where Reedy Creek exists.",
    "The action came as the state feuds with Disney over the companys criticism of its Parental Rights in Education law.",
    "People will [ask about Disney's] services and utilities,? he said at a press conference on Friday.",
    "DeSantis has acknowledged the ambiguity around the bill, will clarify the states intention.",
    "That debt now amounts to nearly $1 billion.",
    "We're going to take care of all that.",
    "We have everything thought out.?",
    "Last Friday, Florida Gov.",
    "Don't worry."
  ]
}