{
  "id": 4416,
  "mediaId": 558,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Florida Supreme Court justice is retiring, opening door for another DeSantis nominee",
  "image": "https://s.yimg.com/ny/api/res/1.2/0RJ8DzVCistnP6GS5QsceQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTM5NztjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/dhIPJka9PWoGPfdBAmtVcQ--~B/aD02NDI7dz0xMTQwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/miami_herald_mcclatchy_975/23b766a2c9834afe9e6b03beed730408",
  "link": "https://news.yahoo.com/florida-supreme-court-justice-retiring-181252684.html",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Saunders",
  "authorUrl": "",
  "termIds": [
    661,
    2305,
    4186,
    4316,
    4668,
    478,
    2661,
    2851
  ],
  "sentences": [
    "One of the greatest joys of my 35-year legal career has been and continues to be the ability to work alongside a bench and Bar filled with extraordinary individuals who work tirelessly to assure that the citizens we serve are well-served by our system of justice.? Lawson, 60, wrote in a retirement letter to DeSantis.",
    "Godspeed as you initiate that process.?\nAn announcement from the Supreme Court did not detail Lawsons future plans, though it described his involvement in charity work, including in such things as medical efforts in Central America.",
    "Three DeSantis appointees  Justices Carlos Muiz, John Couriel and Jamie Grosshans  have joined Lawson, Chief Justice Charles Canady and Justice Ricky Polston to form a solid conservative majority on the seven-member court.",
    "That system is often criticized yet still endures as the best system of justice that the world has ever seen.?\nLawson has been part of a major conservative shift on the Supreme Court during the past three years.",
    "That shift was prompted by the retirement in early 2019 of longtime Justices Barbara Pariente, R. Fred Lewis and Peggy Quince, who had helped make up a relatively liberal majority.",
    "I have every hope that you will further strengthen Floridas justice system as you attentively and thoughtfully appoint my replacement,? Lawson wrote in the letter to DeSantis.",
    "Rick Scott, will end a 21-year judicial career that also included serving as an Orlando-area circuit judge and a member of the 5th District Court of Appeal.",
    "DeSantis will appoint a successor to Lawson, after a judicial nominating commission interviews candidates and submits recommendations.",
    "Justice Jorge Labarga, who joined Pariente, Lewis and Quince on many major issues, is now often a lone dissenter.",
    "Florida Supreme Court Justice Alan Lawson announced Friday he will retire Aug. 31, a move that will allow Gov.",
    "Ron DeSantis to continue placing his imprint on the states highest court.",
    "Lawson, who was appointed as a justice in 2016 by former Gov."
  ]
}