{
  "id": 4428,
  "mediaId": 302,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "What if only the informed were allowed to vote? | Letters",
  "image": "https://www.tampabay.com/resizer//G5GYFdfNPHouIgcxX19TGBcIv_M=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/LBK6ORXIDBQUHPMYNTS6S3UKQI.jpg",
  "link": "https://www.tampabay.com/opinion/2022/04/29/what-if-only-the-informed-were-allowed-to-vote-letters/",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    724,
    1147,
    1451,
    1761,
    4304,
    2661,
    2959
  ],
  "sentences": [
    "Careful what you wish for\nColumnist Cal Thomas is floating ideas for a better-informed electorate, writing that only when it comes to voting can someone cast a ballot with no knowledge, or incorrect knowledge, about the candidates and issues.? What if only informed voters were allowed to vote?",
    "Larry Hatton, Valrico\nA real absentee voter\nU.S. Rep. Charlie Crist has voted by proxy 107 times over three months, refusing to go to Washington after being elected to go Washington, citing the national health emergency of COVID and invoking House rules.",
    "Regarding the letter that included the phrase the man I believe to be the worst president in modern times,? referring to Donald Trump, I have to ask: Is the country better off now than it was 15 months ago?",
    "Brian Valsavage, St. Petersburg\nI will start for the Bucs\nBoth wanna-be, marijuana governor Nikki Fried and flip-flopping Charlie Christ believe they have a shot at beating Gov.",
    "In that case many  if not most  right-wing news diehards would not be able to pass the test between perception and reality and therefore would be ineligible to cast a ballot.",
    "John Spengler, Spring Hill\nSign me up\nJust wondering how I can get one of the 25 jobs in the Office of Election Crimes and Security office created by the governor?",
    "However, he has no problem during this alleged national emergency traveling throughout Florida to campaign for governor.",
    "Makes no difference that he is the GOAT and I am in my 70s, having never played organized football at any level.",
    "Qualifications are usually not a requirement for jobs that are created with no true reason for their existence.",
    "So, I think I will challenge Tom Brady to become starting quarterback of the Tampa Bay Buccaneers.",
    "Opportunity? does not want to leave the free state of Florida to do his job.",
    "I believe that would include former President Donald Trump.",
    "Ron DeSantis in the race to become governor of Florida.",
    "Do I need qualifications or just connections?",
    "I guess that even the politician I call Mr.",
    "I dont know how anyone can believe it is.",
    "John Robbins, Tampa\nBetter off?",
    "Bob Butler, Tampa",
    "Why not?",
    "Really?"
  ]
}