{
  "id": 4431,
  "mediaId": 65,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Biden student debt cancellation may worsen inflation; US Marine vet dies fighting alongside Ukrainians",
  "image": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/04/1862/1048/biden-student-loans.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/us/biden-student-debt-cancellation-may-worsen-inflation-us-marine-vet-dies-fighting-alongside-ukrainians",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    683,
    1408,
    2087,
    2314,
    4009,
    565,
    2661
  ],
  "sentences": [
    "- LAURA INGRAHAM\nFOLLOW FOX NEWS ON SOCIAL MEDIA\nYouTube\nSIGN UP FOR OUR NEWSLETTERS\nFox News Opinion\nFox News Lifestyle\nDOWNLOAD OUR APPS\nWATCH FOX NEWS ONLINE\nFox News Go\nThis edition of Fox News First was compiled by Fox News' Jack Durschlag.",
    "One expert, Maya MacGuineas, president of the Committee for a Responsible Federal Budget (CRFB), warned that student \"debt cancellation may be an extremely appealing political talking point, but it is not good policy.\"",
    "And here's what you need to know to start your day ...\nSTUDENT DEBT TRAP - The inflation crisis in the U.S. will only worsen if President Biden cancels large swaths of student debt.",
    "Continue reading \nKLEPTOCRI--K--YEAH- Twitter users were shocked by Bidens latest gaffe during a public statement on holding Russian oligarchs responsible for their corruption.",
    "Continue reading \nFREE SPEECH RUSE - Chris Hayes said conservatives claim to promote free speech is a ruse to hide a \"thuggish and authoritarian\" power play to control thought.",
    "Continue reading \nSAUDI RESPONSE - Saudi Arabia will likely look to develop its own nuclear capabilities should an Iran nuclear deal go through, experts told Fox News Digital.",
    "Continue reading \nBUFFETT REDUX - Not only is Warren Buffett alive and kicking, the chairman and CEO of Berkshire Hathaway will declare it has trounced the market  again.",
    "Continue reading \nPHOTO FINISH  Los Angeles District Attorney George Gascon is causing havoc and mayhem, and the recall effort will be a 'photo finish,' deputy DA says.",
    "Continue reading \nUS MARINE KILLED - American citizen and Marine veteran Willy Joseph Cancel died fighting alongside Ukrainian forces, the mans widow told Fox News.",
    "Continue reading \nMUSKS TWITTER PURCHASE - New York Times columnist Ezra Klein breaks with fellow liberals distraught over Musk's Twitter purchase: 'A good thing.'",
    "Continue reading \nGUNS AND CRIME - The New York Times recently argued that 2020s hike in legal gun purchases has aided crime spikes, an explanation experts deny.",
    "Continue reading \nPOLITICS\nCOMBATING DISINFORMATION - Jen Psaki defended a DHS effort to combat \"disinformation\" on issues related to COVID-19 and elections.",
    "Continue reading \nSTAR-PACKED WITNESSES  Who are the celebrity witnesses awaiting the chance to testify at the Amber Heard-Johnny Depp defamation trial?",
    "Continue reading \nLAURA INGRAHAM  The Fox host showcased Ron DeSantis' leadership when it comes to improving Florida in the face of a media onslaught.",
    "Continue reading \nCOMING TO COLLECT - The Department of Justice sued Paul Manafort, who worked on Trump's 2016 campaign, for just under $3 million.",
    "Continue reading \nBRIAN KILMEADE  Fox host warned that President Biden's new department on \"disinformation\" turns Orwell's fiction into a reality.",
    "Continue reading \nGREG GUTFELD  The Fox News host said the White Houses new Disinformation Governance Board will police people's opinions.",
    "Continue reading \nLIMBAUGH BOOK DUE - Heroes of Liberty will release a childrens book about late talk radio icon Rush Limbaugh next month.",
    "Continue reading \nPAINTED AS FASCISTS - MSNBC, other liberal outlets repeatedly paint opponents, conservatives as 'fascists' to viewers.",
    "- Critics have taken aim at the Biden admin for the creation of a new \"Disinformation Governance Board\" slated to combat misinformation.",
    "Continue reading \nLATE-NIGHT HOST LEAVING - James Corden will leave the \"Late Late Show\" next spring after over eight years as host.",
    "Continue reading \nCOLLEGE DROPOUTS MAKE IT BIG  Take a look at eight prominent Americans who left college behind and made it big.",
    "Continue reading \nOPINION\nBRANDON MICHON - I'm a dad who wants schools to teach kids how to read  not how to be gender-fluid.",
    "Continue reading \nDOUG SCHOEN - Moves to curb Big Tech's power over news and publishing find widespread support.",
    "Continue reading \nSTEPHEN MOORE  The U.S. economy shrank at the beginning of 2022 and stagflation could be next.",
    "in the past year alone, he's taken on the Left more aggressively than any U.S. governor in modern memory.\"",
    "1  What to know about the NFL Drafts Number 1 pick, Jacksonville Jaguars defensive lineman Travon Walker.",
    "Continue reading \nTUCKER CARLSON - The Biden administration announced its own Ministry of Truth Thursday.",
    "Ron DeSantis] been under relentless assault by the press for his entire term as governor .",
    "Have a great weekend, stay safe and well see you in your inbox first thing Monday.",
    "Continue reading \nFOX WEATHER\nWhats it looking like in your neighborhood?",
    "Good morning and welcome to Fox News morning newsletter, Fox News First.",
    "Thank you for making us your first choice in the morning!",
    "This will be called the Disinformation Governance Board.",
    "Subscribe now to get Fox News First in your email.",
    "Continue reading\nTHE LAST WORD\n\"But [Florida Gov.",
    "Continue reading \nIN OTHER NEWS\nNFL DRAFT RD.",
    "Continue reading \nMINISTRY OF TRUTH?"
  ]
}