{
  "id": 4433,
  "mediaId": 136,
  "date": "d2022-04-29T08:36",
  "headline": "Ron DeSantis Denies Florida Taxpayers Will Pay Off Disney's $1bn Debts",
  "image": "https://d.newsweek.com/en/full/2028137/desantis-disney.webp?w=790&f=691acdc507d843703118886e5255c9f8",
  "link": "https://www.newsweek.com/ron-desantis-disney-taxes-reedy-creek-1702043",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    661,
    718,
    524,
    611,
    2661,
    2849,
    2851,
    5082
  ],
  "sentences": [
    "In a statement to shareholders, Reedy Creek Improvement District said the plan to dissolve the law permitting Disney to run as its own self-governing authority will not work as the 1967 legislation included a pledge by the state of Florida that it would not \"impair the rights or remedies\" of the holders until all its debts are cleared.",
    "Speaking to Fox News' Laura Ingraham during a televised town hall in Orlando, DeSantis denied that taxpayers in Florida will have to pay the billion dollars after the legislation dissolving the special purpose district comes into effect on June 1, 2023.",
    "DeSantis added that the suggestion that the state of Florida will now have to pay for services that were provided under Reedy Creek is \"fiction\" as Disney is currently \"paying money to run their operations\" as essentially the company is Reedy Creek.",
    "\"I want everyone to do well, but I am not comfortable having one company with their own government and special privileges, when that company has pledged itself to attacking the parents in my state,\" DeSantis added, prompting cheers from the crowd.",
    "Reedy Creek currently has about $1 billion in outstanding bond debt, according to the credit rating agency Fitch Ratings, meaning that residents in counties such as Orange and Osceola may have to cover the shortfall with increased taxes.",
    "\"They will continue paying money to run their operations, and that'll be true if the state is in charge of a district, if it's dissolved to the local, it doesn't matterthat is going to continue to happen.\"",
    "DeSantis dismissed the suggestion that Disney might relocate out of the state, saying he would be \"willing to bet a lot of money\" the company will remain in Florida as they have \"huge investments\" here.",
    "Ingraham also brought up concerns that DeSantis' feud with Disney, a major source of pride and income in Florida, may ultimately backfire and could see the company move out of Florida.",
    "Florida Governor Ron DeSantis has denied that stripping Disney of its special privileges and tax breaks will mean local residents will have to foot a billion-dollar bill instead.",
    "DeSantis signed a bill that revoked Disney's special tax district privileges and its ability to self-govern protected under the Reedy Creek Improvement District on April 22.",
    "DeSantis also accused Disney of having \"lost its way\" and suggested having its special privileges stripped might be the \"wake-up call that they need to get back on track.\"",
    "Asked when his battle with Disney will end, DeSantis replied it \"simply ends with them being treated the same as every other company\" in the state.",
    "The move was in retaliation for Disney's objection to the governor-backed HB 1557, the legislation critics have dubbed the \"Don't Say Gay\" bill.",
    "Disney will for the first time actually live under the same laws as everybody else in Florida,\" the Republican governor said.",
    "\"When that company has very high-up people talking about injecting pansexualism into programming for young kids, it's wrong.",
    "With 70,000 staff, Disney is the largest on-site employer in Florida, home to Walt Disney World.",
    "\"They're going to follow laws, they're not going to have their own government.",
    "They're going to pay their debts, pay their taxes,\" DeSantis said.",
    "The Walt Disney Company has been contacted for comment.",
    "They will be paying taxes, probably more taxes.\"",
    "\"The bonds will be paid by Disney.",
    "Walt Disney would not want that.\"",
    "\"Disney will pay its debts."
  ]
}