{
  "id": 4436,
  "mediaId": 21,
  "date": "d2022-04-29T08:00",
  "headline": "An activist wants to ban the Bible in Florida schools as a challenge to Ron DeSantis' new book restriction bill",
  "image": "https://i.insider.com/626ba266c8c8ac0019410402?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/activist-files-petition-ban-bible-florida-schools-under-new-law-2022-4",
  "sentiment": "0.0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Loh",
  "authorUrl": "https://www.businessinsider.com/author/matthew-loh",
  "termIds": [
    661,
    2661,
    2926
  ],
  "sentences": [
    "\"In the end, if Jimmy and Susie are curious about any of the above, they can do what everyone does  get a room at the Motel Six and grab the Gideons,\" he added, signing off as the \"Bishop of the First Church of Mars\" and executive director of \"Schadenboner Incorporated.\"",
    "Stevens, whose day job involves running a website, told The Post that while his pranks may seem trivial, they've also made a difference, such as when his activism led to the arrest of Deerfield Beach city officials over corruption charges.",
    "A self-described \"stunt activist\" has filed a petition asking 63 Florida school districts to ban the Christian Bible, in a tongue-in-cheek challenge to a new state law that makes it easier for parents to object to books in schools.",
    "For example, he cited Genesis 2:18, which says: \"It is not good that the man should be alone,\" as a potential reference that could cause schoolchildren to be \"one giant step closer to getting their LGBTQ+ freak on.\"",
    "He called it \"a weighty tome over 1,000 years old, containing more than 600,000 words; all very troubling if we're trying to keep our youth from learning about race, gender, sex, and such,\" The Post reported.",
    "The petition, dated April 19, is three pages long and cites several Bible passages that discuss acts such as murder, bestiality, and rape, which Stevens said formed the basis of his ban request.",
    "\"Let's be honest  banning books is never a good idea, but what's fair is fair, and with that in mind, please find attached my request to ban the Bible,\" the email said, per the outlet.",
    "Stevens' campaign refers to House Bill 1467, which DeSantis signed into law on March 25, highlighting how it gives parents more power to reject books and materials used in schools.",
    "\"And, as is often the case with banned books, I ask your agency lay flame to that giant stack of fiction in a pyre worthy of a Viking sendoff,\" Stevens wrote in the petition.",
    "\"Used to justify slavery, homophobia, and wars for centuries, it's long past time to ban this dangerous book from our public schools,\" Stevens wrote on his GoFundMe page.",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Chaz Stevens, a 57-year-old activist with a history of filing unusual requests to the local government, started a GoFundMe page on Tuesday to raise funds for his effort.",
    "Jose A. Iglesias/El Nuevo Herald/Tribune News Service via Getty Images\nA Florida activist wants to ban the Bible from schools in response to a new book restriction law.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "One such school district, Leon County, showed the Tallahassee Democrat the email that came with Stevens' petition.",
    "Stevens also sent one school district a complaint to ban the Oxford English Dictionary, per The Washington Post.",
    "On the site, he wrote that his petition was made for \"trolling\" Governor Ron DeSantis and his administration.",
    "The law was used on April 18 to reject 54 math textbooks for including references to critical race theory.",
    "\"Join us in demanding every single Florida school board banish the Bible from their school district.\"",
    "Chaz Stevens claimed that the Bible makes reference to topics such as murder, bestiality, and rape.",
    "Chaz Stevens is known for using unusual pranks to protest government actions and legislation.",
    "He filed a tongue-in-cheek petition listing verses he deemed problematic for schoolchildren.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Now, Stevens says the Good Book should be banned as well.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}