{
  "id": 4444,
  "mediaId": 65,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Ingraham: DeSantis has embraced policies that once seemed unthinkable",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/c5f435f8-d14d-4129-98e7-d348ba7066b7/cde02f68-9b1f-45e3-aa13-1e67742b702f/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/ingraham-desantis-policies-unthinkable",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fox News Staff",
  "authorUrl": "https://www.foxnews.com/person/s/fox-news-staff",
  "termIds": [
    661
  ],
  "sentences": [
    "So tonight we're going to examine the man leading this Sunshine State, which some are calling the laboratory for in-your-face, right-leaning policy, so can DeSantis's approach actually be replicated elsewhere?",
    "JOE AND HUNTER BIDEN SHOW CORRUPTION'S A BIDEN FAMILY BUSINESS: GINGRICH\nMeanwhile, on the national level, year over year, things are rapidly falling apart under Biden's leadership.",
    "Ron DeSantis, how he has worked to improve the state, and the assault from the media over his policies on \"The Ingraham Angle Town Hall\" from Orlando, Florida, on Thursday.",
    "And this is because, though, in the past year alone, he's taken on the Left more aggressively than any U.S. governor in modern memory.",
    "Negative economic growth, soaring prices, millions streaming across the border, rising crime, and obviously muddled foreign policy.",
    "So no wonder the American people, who overwhelmingly are thinking that things are going to get worse in this country, not better.",
    "And will Hispanic voters and women support this no-holds-barred, take-no-prisoners approach in November?",
    "DeSantis has governed \"with remarkable effect, embracing policies that once seemed unthinkable.\"",
    "Hundreds of thousands of people are flocking here for peace, freedom, and opportunity.",
    "But he's been under relentless assault by the press for his entire term as governor.",
    "LAURA INGRAHAM: Today The New York Times grudgingly conceded that Gov.",
    "Laura Ingraham showcased the leadership exhibited by Florida Gov.",
    "All self-inflicted damage by the Democrats in charge.",
    "And what's next in his showdown with Disney?",
    "Yet here  Florida  things are booming.",
    "WATCH FULL VIDEO HERE:"
  ]
}