{
  "id": 4445,
  "mediaId": 558,
  "date": "d2022-04-29T03:11",
  "headline": "Americans do not support politicians punishing firms for their views -Reuters/Ipsos",
  "image": "https://s.yimg.com/ny/api/res/1.2/0DY3AWKMdXZcfvlFG.BfEA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTQyOTtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/r55NrZuixQuwz8KvJc5xgg--~B/aD00ODc7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/8bb922ce6627ca79e11f365de83298e7",
  "link": "https://news.yahoo.com/americans-not-support-politicians-punishing-101147765.html",
  "sentiment": "0.0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lange",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    270,
    524,
    2993,
    2661,
    2851,
    2945
  ],
  "sentences": [
    "But even when prompted along the lines of DeSantis' own argument for his action - that laws should remove benefits of government tax breaks from corporations that push a \"woke\" agenda - 36% of Republicans nationally said they would be less likely to support a candidate with such a view.",
    "By Jason Lange\nWASHINGTON (Reuters) - A bipartisan majority of U.S. voters oppose politicians punishing companies over their stances on social issues, a cold reception for campaigns like Florida Governor Ron DeSantis' against Walt Disney Co, a Reuters/Ipsos poll found.",
    "Presented with a list of prominent politicians, a full 25% of Republican respondents said DeSantis best represents the values of their party, second only to former President Donald Trump who was favored by 40% of Republicans.",
    "The two-day poll completed on Thursday showed that 62% of Americans - including 68% of Democrats and 55% of Republicans - said they were less likely to back a candidate who supports going after companies for their views.",
    "DeSantis signed a bill last week that strips Disney of self-governing authority at its Orlando-area parks in retaliation for its opposition to a new Florida law that limits the teaching of LGBTQ issues in schools.",
    "For DeSantis, a rising star in the Republican Party, it was an attempt to bolster his conservative credentials as a culture warrior ahead of a possible run for the 2024 Republican presidential nomination.",
    "Half of U.S. voters support laws banning classroom discussion on sexual orientation or gender identity for children age 5-11, including 69% of Republicans and 36% of Democrats.",
    "But the poll also showed a nation deeply divided on how schools teach about sexual orientation and gender identity -- the subject of the controversial Florida law.",
    "It gathered responses from 1,003 adults and had a credibility interval, a measure of precision, of about 4 percentage points.",
    "(This story corrects name in first para)\n(Reporting by Jason Lange; Editing by Scott Malone and Daniel Wallis)",
    "The Reuters/Ipsos poll still showed that DeSantis, 43, is a potential force in national Republican politics.",
    "The Reuters/Ipsos poll was conducted online, in English and throughout the United States.",
    "Texas Governor Greg Abbott garnered 9%."
  ]
}