{
  "id": 4448,
  "mediaId": 558,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Hurtful and insulting: Florida teachers react to the dont say gay bill",
  "image": "https://s.yimg.com/ny/api/res/1.2/_BJ_u2F1AId7Xax9lpuxzQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTcwNTtoPTQyMztjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/dFvz40hLncsMnqR1u0ixCg--~B/aD02MDA7dz0xMDAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_guardian_765/81a3c3d53ea121d3f08b4aae255018f2",
  "link": "https://news.yahoo.com/hurtful-insulting-florida-teachers-react-090036701.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Michael Sainato",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "A teacher in St Johns county was reprimanded by their school district after a parent complained about his T-shirt, which said Protect Trans Kids.?\nThe bill was supposedly incited by a filed by parents against Leon county, Florida, who claimed they were not involved by the school in a discussion about their childs gender identity, thoughobtained by the Tallahassee Democrat revealed the mother of the child had worked with a teacher on how to handle the situation.",
    "This law, I see as an effort to take away the years that weve put in trying to make this a better place for kids so they dont have to grow up like I grew up, where I thought I was all alone and then I barely made it through high school.?\nFloridas teachers, students, and LGBTQ community are continuing to speak out against the bill that was signed by right-wing Trump-supporting governor Ron DeSantis last month.",
    "The bill, called the Parental Rights Education bill by its Republican authors, prohibits classroom instruction on sexual orientation or gender identity in kindergarten through third grade, as well as any instruction characterized as inappropriate  vague language that has incited concerns the bill will be used to suppress and intimidate mere acknowledgment of the LGBTQ community in public schools.",
    "Through his Baxley has also fought against same-sex marriage, equated the children of people with substance use disorders to the children of lesbian parents, voted in 2015 to permit private adoption agencies to refuse to place children with LGBTQ parents, and supported other anti-LGBTQ legislation.",
    "A 2019 of 848 students in Florida conducted by GLSEN found the majority of students were regularly exposed to anti-LGBTQ remarks from other students or staff and high percentages of students reported being physically harassed or assaulted due to their sexual or gender identity.",
    "Proponents of the dont say gay? legislation are manufacturing smear campaigns in support of expanding the bills to other states, including that Disney is attempting to sexualize our children? as part of a progressive LGBTQ agenda.",
    "Dont say gay? also grants parents the right to sue for damages and attorney fees if a school district doesnt resolve their complaint about a childs education, which essentially forbids discussion of LGBTQ issues or identities.",
    "Florida Republican state senator Dennis Baxley, a sponsor of the bill, in on the state senate floor, made claims of a big uptick in the number of children coming out as gay and framed the bill as a response to that.",
    "Clinton McCracken, an art teacher in Orange county, Florida, grew up in a small midwest town where he didnt experience a person out as LGBTQ until he went away to college.",
    "These accusations have been promoted by Chris Rufo, a rightwing thinktank fellow who videos of Disney executives, claiming Disney has a not so secret gay agenda?.",
    "This is just a few weeks after Disney faced from employees and the LGBTQ community for refusing to make a statement in opposition to Floridas dont say gay bill.",
    "The National Center for Lesbian Rights, Equality Florida, and Florida families have filed a lawsuit challenging the bill, arguing it is unconstitutional .",
    "I wasnt able to walk to any classroom and see rainbow stickers on the door that says this is a safe place where you can be who you are,? said McCracken.",
    "The legislation has already begun to have a chilling effect on teachers, students and the LGBTQ community, though it doesnt go into effect until July.",
    "Hes concerned Floridas recent controversial dont say gay? bill is dangerous, hateful legislation that poses many risks to LGBTQ youth in the state.",
    "A conducted by the Trevor Project estimates that at least one LGBT youth between the ages of 13 and 24 attempts suicide every 45 seconds in the US.",
    "Rufo previously worked as a for the Claremont Institute, which has a troubling of anti-gay politics and pushing for conversion therapy?.",
    "Similar bills are by Republicans in Alabama, Georgia, Ohio, Louisiana, Tennessee and Texas.",
    "Florida was already a poor climate for LGBTQ students.",
    "Thats what were trying to create for our students.",
    "We have that now."
  ]
}