{
  "id": 4449,
  "mediaId": 302,
  "date": "d2022-04-29T02:00",
  "headline": "Disney special district dispute could weaken other Florida government bonds, Fitch Ratings warns",
  "image": "https://www.tampabay.com/resizer//h-GUSsuv2zUyNMqxu-lt_K3PYEo=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/K2TSSVBBHNDFFK536BOLRB6SRQ.jpeg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/04/28/disney-special-district-dispute-could-weaken-other-florida-government-bonds-fitch-ratings-warns/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    524,
    3269,
    2661,
    2849,
    2926,
    5082,
    5109,
    5130
  ],
  "sentences": [
    "Fitch cites ambiguity in putting the bond rating on negative watch?\nFitch acknowledged that it does not currently consider the states action a precursor to similar dissolution measures or interference in the operations of other local governments. But Fitch noted that when bond agencies determine how to rate the reliability of U.S. government bonds, a significant consideration is the governments respect for property rights and bondholder security.?\nBecause Floridas action creates ambiguity around which entity or entities will ultimately repay bondholders, Fitch put Reedy Creeks bond rating on negative watch.?\nThe designation is a signal to investors that the districts debt ratings, which range from A to AA-, could be downgraded potentially increasing the districts cost of capital for both debt and equity, and impacting Disneys share price.",
    "The agency said the situation reflects a unique and dynamic level of discord? and expects the state to ultimately work with various stakeholders to resolve the uncertainty.?\nBut it also added a warning: The failure to do so could alter our view of Floridas commitment to preserve bondholder rights and weaken our view of the operating environment for Florida governments.?\nA 1967 state law that established the Reedy Creek Improvement District on 39 square miles of Disney property gave the district the power to issue bonds and tax itself to build roads, sewers and utilities, establish its police and fire departments, and regulate its construction.",
    "Fitch said Thursday it expects the state to ultimately work with various stakeholders to resolve the uncertainty in a way that ensures timely repayment of RCID debt, with reconstitution of the district as one option specifically offered in the bill.?\nHowever, municipal law experts have warned that untangling Disneys taxing district will not be easy because state law requires that when the district is dissolved, its debt obligations, tax revenues, assets and responsibilities would be transferred to Osceola and Orange counties, as well as the small cities of Lake Buena Vista and Bay Lake.",
    "]?\nFitch says dissolving the district potentially impinges creditors rights?\nFitch warned that by dissolving Disneys district, the state potentially impinges creditors rights and may violate the states covenant to bondholders.?\nIf the Legislature reverses course and re-ratifies Reedy Creek by June 1, 2023, or approves a successor agency,? it would likely result? in potentially preserving the operating and fiscal powers that underpin the creditworthiness of its outstanding debt, Fitch said.",
    "Theyre going to pay more taxes as a result of that.?\nThe governors office then released a statement indicating that in the near future, we will propose additional legislation to authorize additional special districts in a manner that ensures transparency and an even playing field under the law.?\nThe repeal of the Disney special district was a surprise addition to the special session of the Florida Legislature, called by DeSantis to approve a congressional redistricting map.",
    "Conversely, prolonged uncertainty with respect to the dissolution procedures, litigation or other factors...could lead to a downgrade of the RCID ratings.?\nDeSantis spokesperson Christina Pushaw on Thursday repeated the promise that more details are forthcoming, but she would not respond to questions about whether the state will address the uncertainty when legislators convene for a special session on property insurance on May 23.",
    "In exchange, the state pledged it will not limit or alter the rights of the District ... until all such bonds together with interest thereon ... are fully met and discharged.?\nThe law dissolving the district does not address how the bonds will be paid, but on Friday when he signed the measure, DeSantis said: Were going to take care of all that.",
    "TALLAHASSEE  One of the nations leading bond rating agencies warned Thursday that if the state of Florida doesnt resolve a conflict over its decision to repeal Walt Disney Worlds Reedy Creek Improvement District and its obligation to investors, the move could harm the financial standing of other Florida governments.",
    "Fitch believes the mechanics of implementation, including the transfer of the revenue pledged to bondholders, will be complicated, increasing the likelihood of negative rating actions for RCIDs outstanding bonds., the alert said.",
    "The Reedy Creek Improvement District holds nearly $1 billion in bond debt, and last week Fitch issued a negative watch? because of the uncertainty around how that debt will be paid and by whom.",
    "The district has about $79 million in outstanding utility revenue and refunding bonds and approximately $766 million in outstanding ad valorem tax bonds, according to Fitch.",
    "The governor and Legislative leaders added it in retaliation for Disneys outspoken opposition to the Parental Rights in Education? law, also known as the dont say gay? bill.",
    "Furthermore, neither Orange nor Osceola county provide the complete suite of utility and emergency services provided by RCID [Reedy Creek Improvement District.",
    "Ron DeSantis signed into law the measure dissolving the special taxing district that governs Disney property by June 1, 2023.",
    "Pushaw wrote on Twitter: About the Reedy Creek special district: Disney will pay its fair share of taxes.",
    "Fitch Ratings posted the alert late Thursday on its Fitch Wire website, nearly a week after Gov.",
    "Floridians, including residents of Orange and Osceola Counties, will not be on the hook.",
    "Dont let anyone tell you that somehow Disney is going to get a tax cut out of this.",
    "Do not fall for another partisan political lie being amplified by media.",
    "We have everything thought out.",
    "More to come?",
    "Dont worry."
  ]
}