{
  "id": 4453,
  "mediaId": 239,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Florida teachers sue to block reopening of public schools",
  "image": "https://twt-thumbs.washtimes.com/media/image/2020/07/19/virus_outbreak_florida_08464_c0-352-1757-1376_s885x516.jpg?25378636d4e7485cb15ac8827b5f15a24eb246d4",
  "link": "https://www.washingtontimes.com/news/2020/jul/20/florida-again-reports-more-than-10000-new-coronavi/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "CURT ANDERSON",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "The order, he said in a statement, did not order any new directives regarding the requirements of schools to be open,? adding that it simply created new innovative options for families to have the choice to decide what works best for the health and safety of their student and family.?\nDeSantis was at OneBlood to encourage people who had been infected with the virus and recovered to donate blood plasma that can be used in the treatment of hospitalized patients with COVID-19.",
    "Obviously, if you look at the epidemic, its more severe in some parts than others, and I think you should recognize that.?\nLater on Monday, Florida Education Commissioner Richard Corcoran suggested that the states emergency order merely restates current law that requires schools to operate 180 days? a school year.",
    "The governor needs to accept the reality of the situation here in Florida, where the virus is surging out of control.?\nEveryone wants schools to reopen, but we dont want to begin in-person teaching, face an explosion of cases and sickness, then be forced to return to distance learning,? Ingram added.",
    "Speaking at blood center in Orlando, where he was interrupted by chanting protesters Monday, DeSantis said parents should be given a choice as to what is the best option for their children, whether virtual learning, in-class schooling or a combination of the two.",
    "The governor has repeatedly said policies in hard-hit South Florida might not make sense in the Panhandle, where the infection rate is lower, even as his fellow Republicans increasingly acknowledge the need for a unified, nonpartisan message.",
    "The skyrocketing caseload is making for a strange summer in the Sunshine State, where many popular beaches are shuttered, residents and tourists can be fined for not wearing masks, and bars across the state arent allowed to pour liquor.",
    "If a teacher doesnt feel comfortable there  I think they should be given as many options as possible.?\nWhen asked about a Department of Education order requiring brick-and-mortar schools to reopen, DeSantis distanced himself from it.",
    "But where we are today, we cant support it.?\nWilliams added: Theres got to be some major reworking of whats happening.?\nCritics have complained that DeSantis has not mandated a statewide mask ordinance as cases rise.",
    "Though the increase has slowed when compared to about a week ago, those additional patients have been straining intensive care units of some hospitals in the South Florida, Tampa, Orlando and Jacksonville areas.",
    "The Florida Education Association lawsuit argues that reopening this fall would put students and school employees at risk  as well as accelerate the spread of the coronavirus.",
    "ST. PETERSBURG, Fla. (AP) - Florida teachers sued Monday to block what they call the reckless and unsafe reopening? of public school campuses for face-to-face instruction.",
    "Even after the GOP announced plans to scale back the convention and hold more events outside, the local sheriff said peoples safety cannot be guaranteed.",
    "During the news conference, a group of protesters interrupted DeSantis with chants of, Youre lying to the public.?\nWe will not be defunding the police.",
    "The upcoming plan to have the Republican National Convention in Jacksonville to renominate President Donald Trump continues to be on shaky ground.",
    "Hospitalizations for the disease continued to increase, standing at 9,452 statewide in the late morning Monday - up about 160 from the day before.",
    "Florida reported another 10,000 new coronavirus cases on Monday, the 12th day since the Fourth of July the number has topped that threshold.",
    "Ron DeSantis, Education Commissioner Richard Corcoran, the Florida Department of Education and Miami-Dade County Mayor Carlos Gimenez.",
    "Once outside, the protesters banged on windows and shouted for several minutes, requiring the speakers to talk loudly over them.",
    "Follow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak",
    "Associated Press writers Mike Schneider in Orlando and Bobby Caina Calvan in Tallahassee contributed to this story.",
    "Governor DeSantis needs a reality check, and we are attempting to provide one,? said FEA President Fedrick Ingram.",
    "Its overall deaths rank 25th in the nation per capita, or about 7 times less than highest-ranked New Jersey.",
    "Schools also need to make health accommodations for employees too if they are high risk, the governor said.",
    "Parents need to choose the best environment for their students, their kids,? the Republican governor said.",
    "Dont worry about that,? DeSantis said as deputies escorted some of the protesters outside the building.",
    "Where we are today is we cant support this plan,? Sheriff Mike Williams told local news outlets Monday.",
    "That brings the states totals for the entire pandemic to more than 360,000 cases and over 5,100 deaths.",
    "The new reported deaths brings Floridas seven-day average to about 114 per day.",
    "The lawsuit, filed in state Circuit Court in Miami, names as defendants Gov.",
    "The state Department of Health reported 10,347 new cases and 90 deaths.",
    "Corcoran, a former state House speaker, works for the governor.",
    "That was the Department of Education,? DeSantis said.",
    "Where do we go from here is a good question.",
    "Statewide, 18% of ICU beds were available.",
    "I didnt give any executive order."
  ]
}