{
  "id": 4454,
  "mediaId": 43,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "How Florida Rising is combatting conservative leaders'",
  "image": "https://images.dailykos.com/images/1063781/story_image/FRATSV1.png?1651243527",
  "link": "https://www.dailykos.com/story/2022/4/29/2094769/-How-Florida-Rising-is-combatting-conservative-leaders-anti-Black-power-grab",
  "sentiment": "0.0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "We had scenarios where we were able to intervene with folks who are going through this situation where they were at least able to stay housed, until they were able to change their situationwhich is a far cry from what they thought their situation is going to be, because they felt that once they got the notification of that eviction, I have 30 days and that's it, I have to be out.",
    "Every month in each region that we work in, we have what's known as the People's Assembly, which is really an opportunity for the public to come in, engage with us as an organization, and talk about things that are of critical importance to youas well as us being able to highlight hot button issues of the time.",
    "We got to think about this, whether it is women's suffrage, whether it is the Black Civil Rights movement, whether it's the gay rights movementthere was a time and place where all these movements did not have the benefit of being able to speak out loudly and proudly about wanting to make change.",
    "More importantly, moreover, I would say that folks who consider themselves allies or accomplices of the Black community who are not Black need to look at moments like this and not pick and choose on when they're supposed to tap in and be in deep alignment with Black communities.",
    "While there are no simple solutions to major challenges in democracy, Bullard shared some of the micro-interventions and incremental solutions utilized by Florida Rising and allied organizations working to interrupt and disrupt the status quo of white supremacy in the state.",
    "Anoa Changa: Thinking a little bit more specifically about some of the things that have been happening in your state recentlythe current governor seems like he's trying to intentionally dilute the political and representational power of Black and brown voters in the state.",
    "In reality, just by taking a few measured steps and educating them on their own rights, they were able to stay there for six months, eight months, nine months, before they actually had to leave the situation that they're inmaking sure they transition into a better one.",
    "What we're feeling right now is the result of those pressuresthe idea of people wanting to fight for clean water and clean air, the idea that we're seeing an increased number of houseless and homeless people who can't afford to keep their lights on.",
    "When you're seeing direct racial or racist intent on the part of someone who's in political power, for those people that consider themselves people of good conscience, people who have fortitude, then it's your job to step up and take power back.",
    "So just simple education on the requirements that a landlord has for notification of your eviction, the legal process that allows you to stay sheltered, even when you cannot afford it, was just some basic information that people did not know.",
    "I think, unfortunately, because we live in a world that is oftentimes dictated by instant gratification, folks get enamored with this idea that if I do enough internet clicking, if I send enough tweets, that that is going to be the change.",
    "See also: In Florida, protesting can cost you your right to vote\nWhen it comes to the healthcare crisis, access to health, voting rightsall these things, the ways in which we want to interact with people is like: You have a crisis.",
    "When we think about how the pandemic impacted the state, one of the first things that we had to do as an organization was shift our presence as a voter engagement organization into that of being one of almost like first responders.",
    "Whether that is the census, redistricting, the legislative session, pushing things like the tenant's Bill of Rights that we're trying to get traction on in different counties that give you no expansion of rights to renters.",
    "It becomes absolutely important for you to be able to engage in that level of understanding that these things are happening and will happenwithout your input, if you allow them toand then to double down on that.",
    "And so it's important that communities of color, and Black communities, in particular, understand the importance of political engagement and political education in order to fight for their very salvation.",
    "Those are some of the tools that we use, but when we think about levels of engagement, we understand that we don't just want to hit people over the head all the time with this overt political message.",
    "Folks should not be able to walk around feeling empowered enough to take advantage of the positions that they've acquiredpositions that they've got because they've been electedand do this to people.",
    "In an interview with Scalawag, Delilah Pierre of Tallahassee Community Action Committee called the Combating Public Disorder Actalso known as the \"anti-riot\" bill\"a power grab for the Republicans.\"",
    "Whether that is voting rights, clean air, clean water, indigenous rights, whether it is LGBTQ plus rightswhatever the case may be, there are organizations working out there to make that change.",
    "From the dispute over hanging chads in the 2000 election to the erosion of protest rights seen in House Bill 1 last summer, the Sunshine state has proven to not be so sunny for voting rights.",
    "Or we've been showcasing Selma, which is Ava DuVernay's depiction of Bloody Sunday and the march from Selma to Montgomery, that really kind of highlights the importance of voting rights.",
    "Dwight Bullard: Well, it's ironic that I'm actually coming to you from Tallahassee at this very moment, because we needed to mobilize people at this very moment to deal with that crisis.",
    "How those issues are responded to, or reacted to, by the elected officials in this state, is oftentimes reflective of how Florida will swing statewide or in presidential elections.",
    "As a Black person, as a Black man especially, I don't have the luxury of being apolitical, because my whole existence in this country has been one of deep-rooted political fodder.",
    "We were out here making sure that people had food, or making sure that people had access to resources, because we saw a failure on the part of governments to address those issues.",
    "We want to be able to highlight joy, we want to be able to applaud the great things that people are doing beyond that scopebut also recognizing that we can't escape politics.",
    "Understanding that for your everyday lived experience, something is going on in your world that you ultimately want to change for the better, or just change deliberately.",
    "Florida Rising's Senior Political Advisor Dwight Bullard joined As the South Votes from the state's capital of Tallahassee to discuss another power grab in the making.",
    "What are some of the things that y'all are working on, that helps secure democracy for folks, but also shifting and changing for the better for all of our communities?",
    "But now, we live in a space where there's a multitude of organizations out there that are working on every issue, every facet of everything that anyone could imagine.",
    "The rationale for his veto is that he did not like to have the particular congressional districts that are currently occupied by African American members of Congress.",
    "He also gave insight into the fight against Governor Ron DeSantis' administration's attempt to eliminate two congressional districts with historic Black leadership.",
    "Previously serving in both houses of the state legislature, Bullard provided context for the current struggle in mobilizing to change policy at the state level.",
    "What are some of the ways that you've seen people implementing micro-interventions in protecting democracy and helping people have access to the halls of power?",
    "We have a state that, unfortunately, is going through a healthcare crisis, because of the failure to expand Medicaid and address some of those critical issues.",
    "For those who don't know, the current governor, Ron DeSantis, in an unprecedented move, vetoed the congressional maps that were drawn by the state legislature.",
    "Take the housing crisis in particular: What we sawespecially around the pandemicwas folks being unable to pay their rent or their mortgage and facing eviction.",
    "After this interview, Democratic members of the Florida legislature turned up the heat on DeSantis and the complicit silence from their Republican colleagues.",
    "If you individually cannot be a part of that incremental movement, then you have to make sure you're recruiting more and more people to stand in your place.",
    "How do you work to help people push past what some may call an apathy towards the system, towards actually collectively building in the way that y'all are?",
    "That's what we really empower our organizers with: The ability to kind of just engage people at the most basic level possible in order to make real change.",
    "It's not about this one character or this one person or even this one institution that is determining outcomes for your life for you as the individual.",
    "We're here in Tallahassee at this very moment to engage with the legislature to try to give them the power to push back against the governor's veto.",
    "A recent film that we've been showcasing is called Moody, which gives some insight into the continued plight of Haitian Americans in this country.",
    "Bullard and Democratic legislators argue that DeSantis' moves are aimed at diluting the political power of Black voters and their representatives.",
    "This story on Florida Risings organizing was written by Anoa Change and originally published in Scalawag as part of our As the South Votes series.",
    "What are some of the things that people are doing to challenge some of these egregious steps that are being taken by the DeSantis administration?",
    "We have to be willing to take it to the courtrooms and we definitely have to be willing to take it to the ballot box around these issues.",
    "What I mean by that is that the tactics, the means by which people become woke to what is happening in their everyday lives politically.",
    "Anoa Changa: Florida has been a hot place politically for several years nowand definitely now, ramping up into this midterm cycle.",
    "So, we've sponsored movie nights, where the public can come out and check out a film that's part of a deeper political education.",
    "So the impacts of voting rights have been felt here like they've been felt in states like Mississippi and Alabama and others.",
    "Anoa Changa: It seems like it takes a lot of consistent little steps, or smaller actions and wins, to be able to topple this.",
    "Whether it's getting new people elected into office or pushing forward amendments like Amendment 4, or shifting legislation.",
    "Florida has been at the epicenter of national politics and conversations around protecting democracy for more than 20 years.",
    "It's those kinds of methods of engagement that allow us to really interact with folks in what we feel is a responsible way.",
    "There's not sort of one means that that will ultimately awaken somebody to why or how they're going to engage politically.",
    "Some people want to call it a purple state, or a state that fluctuates between its own political ideology and identity.",
    "Like I said, it doesn't have to be about you dedicating hours upon hours every day or every week to this organization.",
    "But because people have not found themselves in this crisis before, they did not necessarily know how to react to it.",
    "He's using discrimination, power, and influence, to undermine people based on color, or based on ethnic distinction.",
    "But it's just oftentimes a lack of basic information that, unfortunately, a Google search won't necessarily turn up.",
    "And so understanding first that when we think about the notion of democracy is that we have to center people first.",
    "What I mean by that is being creative about how you are touching people around the notion of electoral politics.",
    "Helping you understand how those institutions can be either assistive or a barrier to what you want to achieve.",
    "That engagement on the part of Ron DeSantis is, by all means, in my opinion, the textbook definition of racism.",
    "So, Florida has this kind of unfortunate distinction of being at the forefront of a number of critical issues.",
    "Again, we're at the intersection of the climate crisisbecause of the number of bodies of water that we have.",
    "I oftentimes say that you can try not to care about politics, but politics will ultimately care about you.",
    "Anoa Changa: What are some of the ways that the organization is innovating or engaging with individuals?",
    "A time when people could be killed, people could be arrested, people could be tracked by the government.",
    "What I mean by that is that politics will dictate in some way, shape, or form every facet of your life.",
    "Dwight Bullard: Our bread and butter is in engagement, and really meeting people where they are.",
    "And, as people have probably read, we're going through a critical housing crisis at this moment.",
    "That simple intervention is how we want people to onboard themselves to the notion of politics.",
    "We want to be a political home for folks who want people to engage in our political education.",
    "I mean, we know this lesson from history that we have to be willing to take it to the streets.",
    "Folks have to be ready to do any and everything possible when their rights are under attack.",
    "You can look that up, find out what they're doing, see what they're about, and get involved.",
    "See who's out there doing the work around the thing that you deem important for your life.",
    "Anoa Changa: It can sometimes feel like these different systems are absolutely against us.",
    "We're experiencing in some counties as much as 33 to 34 percent hikes in the cost of rent.",
    "And again, all that is a Google search awaywho's doing the work in my community around X.",
    "Part of the reason why it gets that title has to do with the experiences people have.",
    "I don't think anyone just wants to constantly hear the drumbeat of bad or sad news.",
    "This is what racism is: Racism is the intersection of discrimination and power.",
    "Dwight Bullard: For us, it's about consistent and constant experimentation.",
    "And again, it doesn't always have to be some sort of sky is falling crisis.",
    "Dwight Bullard: The work is hard, the work is long, the work is arduous.",
    "We have a responsibility as individuals to seek those organizations out.",
    "But if you stay consistent then ultimately, you'll get positive change.",
    "You can find a lane in the simplest way possible to make it possible.",
    "I'm not trying to be provocative when I say that this act is racist.",
    "Bullard breaks down how to go about doing it and why it's important.",
    "Folks talk a lot about people-powered movements and building power.",
    "What are some of the issues that you're hearing from folks about?",
    "It requires you to consistently have to engage in these battles.",
    "What is the thing that you want to make better about your life?",
    "Florida Rising members protest the state's Don't Say Gay bill.",
    "Florida is the testing ground for anti-democratic policies.",
    "Dwight Bullard: Florida has always been a bellwether state.",
    "Change requires a little more deliberate work than that.",
    "The elections should have consequences for these folks.",
    "This interview has been edited for clarity and length.",
    "That's the work we're aiming to do at Florida Rising.",
    "Follow Scalawag on Twitter for the latest news.",
    "And that's not to say that all that is over.",
    "It's important for people to invest in that.",
    "How are y'all really connecting with folks?",
    "How do people get together and fight back?",
    "It's deeper than the cult of personality.",
    "Structurally, we'll start there.",
    "But I think we're also prepared.",
    "You're absolutely right.",
    "They're not monolithic.",
    "It is a Southern state.",
    "What am I going to do?",
    "So why bother?"
  ]
}