{
  "id": 4873,
  "mediaId": 238,
  "date": "d2022-04-28T17:47",
  "headline": "Opinion The new Republican statism",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/28/new-republican-statism/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2095,
    146,
    428,
    2672,
    2932,
    2945
  ],
  "sentences": [
    "Yet, as one report noted, Republicans cant point to any instances of transgender high school girls competing in girls sports in Georgia schools.?\nIn Kentucky, the GOP legislature overrode the Democratic governors veto of a bill that would mandate that teachers describe slavery and Jim Crow as kind of historical whoopsies that had nothing to do with the founding principles or current reality of the United States.",
    "The new right-wing thirst for authoritarianism crosses policy boundaries; its no accident that this comes even as many right-wing intellectual types are seeing a model in Hungarian dictator Viktor Orbans use of culture-war fearmongering to justify the consolidation of economic and political power.",
    "When a Democrat demanded that the sponsor of a key amendment say what he plans to do with newly banned books, the Republican, Rep. Jerry Sexton, said, I dont have a clue, but I would burn them.?\nThere might not be state-sponsored book burnings in Tennessee in the near future (but who knows).",
    "Conservatives have always said they are philosophically opposed to the centralization of power: They want local control? of schools, they love unfettered free markets, they wax rhapsodic about the decentralized wonder of federalism and the dangers of the governments heavy hand.",
    "Having updated their philosophy with this new statism, will they be able to resist the temptation to completely abandon federalism as well, the idea that power should lie as much as possible with the states and not the federal government?",
    "When a Republican state legislator unashamedly announces that his intention is not only to ban books from school libraries across the state but to burn the offending books, you know something has changed.",
    "So their belief in local control and decentralization was always conditional: Its a principle conservatives kind of held, so long as they liked what localities or states did with the power they had.",
    "Hes using the culture war (step 1) as a justification for economic punishment of those he sees as his enemy (step 2) to suppress political opposition to his rule and agenda (step 3).",
    "Brian Kemp signed a group of laws on Thursday to restrict what teachers can say about race, gender and sexuality, as well as forbidding transgender children from playing sports.",
    "It would require every book in every school library to be approved by a state commission whose members are appointed by the Republican legislature and the Republican governor.",
    "Perhaps more profound than even the fury of the new right-wing culture war is the way it appears to be completely reconfiguring what we understood American conservatism to be.",
    "And if any Republican says, We shouldnt do that, because a true conservative doesnt think Washington should make the rules for everyone,? theyll be laughed out of the room.",
    "These have included raising the minimum wage or requiring sick leave for workers, regulating guns, banning natural gas in new construction, or reducing police budgets.",
    "Whats different now is that theyre moving more aggressively than ever to shift power upward, and have stopped even paying lip service to the idea of decentralization.",
    "But what they have in common is that everywhere you look, Republicans are trying to redirect power upward, to consolidate and centralize authority in their hands.",
    "For instance, its very likely that the Supreme Court will overturn Roe v. Wade this year, which will allow Republican-run states to outlaw abortion completely.",
    "Ron DeSantis (R) punishes Disney for objecting to his \"dont say gay\" law by going after their tax status, hes not just fighting the culture war.",
    "Just witness the preemption? laws theyve passed for years, in which Republican state governments forbid city or county governments  i.e.",
    "Its manifest in the ongoing wave of speech-restricting gag laws being passed by Republican states, but thats not where its going to end.",
    "You could argue that this isnt really new, that Republicans never believed their rhetoric about local control.",
    "Will Republicans find it intolerable that blue states defy them, and move to pass a national ban on abortion?",
    "Thats what happened in Tennessee, during debate over a shocking bill that wound up passing the State House.",
    "This is an outright rejection of the way conservatism in America has described itself for decades.",
    "The immediate subject of these moves might be conservative preoccupations over race and sexuality.",
    "Which is why it would be a mistake to see these conflicts as just about the culture war.",
    "While they praise his anti-gay efforts, its also his authoritarianism that thrills them.",
    "Theyre all statists now, and once they have power, theyre going to use it.",
    "But you arent hearing that kind of talk much lately from Republicans.",
    "It could be after the 2024 election, or perhaps the 2028 election.",
    "What theyre advocating now is nothing short of a new statism.",
    "The pressure to do so from their base will be considerable.",
    "But in Democratic states, abortion will still be legal.",
    "ones run by Democrats  from advancing liberal goals.",
    "Those laws are being passed at a furious pace.",
    "At least thats what they used to say.",
    "They will eventually.",
    "So when Florida Gov.",
    "Georgia Gov."
  ]
}