{
  "id": 6163,
  "mediaId": 157,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "'We love Trump, but he's not God': Trump fans unmoved by his endorsement of J.D. Vance",
  "image": "https://www.rawstory.com/media-library/image.jpg?id=29720926&width=1200&coordinates=0%2C0%2C0%2C50&height=600",
  "link": "https://www.rawstory.com/2657208834/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nick Evans",
  "authorUrl": "https://www.rawstory.com/u/nickevans-ohiocapitaljournal",
  "termIds": [
    661,
    819,
    1147,
    1801,
    1850,
    3103,
    4747,
    3330,
    2845,
    2945
  ],
  "sentences": [
    "And if were going to have mail-in ballots were never going to have honest elections.?\nAnd while Trump endorsed Mandels vision for elections, if not the candidate himself, the former president cast his lot with Secretary of State Frank LaRose, who despite a noticeable rightward lurch recently, has maintained that Ohio elections are secure.",
    "One unfurled a banner that said Trump 24 or before.?\nIn the course of five minutes, Trump went from bragging about replacing NAFTA, to taking credit for saving a Whirlpool factory, to decrying energy star regulations on dishwashers, to his frustrations with low-flow faucets and shower heads, before making a hard but familiar pivot.",
    "He stacked up a list of grievances that make him sick  relying on communist China? for goods, an FBI focused on arresting American citizens? rather than drugs and human trafficking at the border, big tech allegedly stealing the 2020 election, having to purchase foreign oil, the media calling republicans bad names.",
    "He believes so much in making our country great again, and hes going to do a job on these horrible people that are running against him.?\nWhile Vance has lately become sharper and more conservative in his messaging, he has not embraced the most extreme positions of his opponent Mandel.",
    "We do appreciate and trust what he says, but were not just gonna follow him blindly.?\nTrumps visit, in large part, was meant to build momentum for candidates like Vance  effectively putting the former president on the ballot even if he isnt seeking office.",
    "At a NewsMax townhall last week, he used Florida Governor Ron DeSantis bid to strip Disney of a special taxing district in retaliation for opposing the states dont say gay? legislation as an example of a politician who knows what time it is.?\nJ.D.",
    "The jumbotron screens played campaign ads, a promo for Donald Trumps coffee table book and the trailer for a voter fraud conspiracy documentary in between a soundtrack of classic rock hits  Whitesnake, AC/DC, Hagar-era Van Halen, Lynyrd Skynyrd.",
    "Overhead a plane circled lazily, towing a banner that read, Joe Blystone For Ohio Governor?\nSome of the attendees have begun following Trump from rally to rally like as if he was the Grateful Dead or Phish.",
    "Since securing Trumps endorsement, Vance has forged further to the right, even co-opting some of the RINO? hunting rhetoric of his more radically conservative opponent, former state treasurer Josh Mandel.",
    "Despite every effort by those who put politics over principle,? LaRose said in a March tweet, youll have the opportunity to make your voice heard in a secure, accurate, and accessible primary election.",
    "Back on the stage, Vance told the crowd they need to vote for Republicans who know what time it is,? a line hes been trying lately to describe the aggressive, pugilistic pursuit of culture war issues.",
    "When Trump singled him out to tell the crowd he had is complete and total endorsement? Trump didnt emphasize elections  he thanked LaRose for his role in redistricting.",
    "Fauci is a criminal? and belongs in prison, Americas exit from Afghanistan was a surrender? and the one of the greatest embarrassments in United States history.?\nJ.D.",
    "Mail-in ballots, long term voting and no voter ID or signature verification is absolutely killing our country our reputation and our elections,? Trump said.",
    "Im sick, in sum, of the left destroying this country, and Im sick of the RINOs in Washington DC who refuse to fight back against it,? Vance told the crowd.",
    "Late in his speech, Trump referenced parents rights? the latest buzzword for the conservatives push to excise any reference to LGBTQ identity in schools.",
    "The chant save our kids? went up and Trump paused before continuing, who would even think that would be a subject where it gets the biggest hand of all?",
    "Throughout the campaign, Mandel has pushed limiting voting to election day, getting rid of voting machines, requiring ID and scrapping mail in ballots.",
    "Ohio Capital Journal is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity.",
    "The fact is the election was rigged and stolen and now our country and now our country is being destroyed, our countrys going to hell,? Trump said.",
    "The throng crowded against metal barriers hours before former president Donald Trump arrived, their faces steadily reddening under the beating sun.",
    "Trumps opening act was a string of local congressmen and GOP congressional candidates hoping to convert their stage time to votes on Election Day.",
    "While he created this conservative political movement, and he remains its foremost avatar and instigator, he cant necessarily control it.",
    "Like his former boss, he veered toward the same attacks on the media, how long did CNN+ last for?? and hyperbolic red-meat attack lines.",
    "Despite calling Vance the America First warrior? on stage, Trump demanded the same draconian voting restrictions Mandel has championed.",
    "He walked out to Elton Johns Saturday Nights Alright For Fighting, in a red tie and white dress shirt, sleeves rolled above his elbows.",
    "Saturday saw Ohios first taste of summer, and thousands poured into the Delaware County fairgrounds, still spongy from spring rain.",
    "As for what shell do next, she said shed let Ill let God guide my steps on that one,? but she hasnt missed the work for a second.",
    "Vance was a bit subdued in comparison, but used the stage to try out some harsher rhetoric than hes employed in the race so far.",
    "Steven Turner paused for a second to talk, juggling four or five cold bottles of soda that were beginning to sweat in the heat.",
    "Trump criticized the fake news media? and even more got up, turning to the cameras, screaming insults or waving middle fingers.",
    "Turner came from New York and he estimated there are 100 or 200 people he recognized who pop up at rallies around the country.",
    "Troy Balderson kicked things off and reminisced about the boost he got from a Trump visit during his 2018 special election.",
    "At the mere mention of Congressman Jim Jordan, R-OH, half a dozen people were on their feet clapping or waving their hats.",
    "Underscoring the point of his trip, Trump brought Vance and Miller up to speak for a few moments during his own speech.",
    "Thats become such a big subject, and who would even think that that would be a big subject,? Trump wondered aloud.",
    "Being a full Trump supporter since the beginning, yeah, Im very quick to just say Ill go with him,? he explained.",
    "He milked the applause, walking back and forth on the podium, pumping his fist and pointing out into the crowd.",
    "Hes a great guy, hes going to be a tremendous congressman  (Im) proud of him, hes like my boy,? Trump said.",
    "And while were at it, we dont want men competing in womens sports.?\nAgain, the crowd roared its approval.",
    "Miller, a former Trump aide, was certainly paying attention during his time in alongside the president.",
    "He hadnt been following the Senate race all that closely, he admitted, so Trumps endorsement of J.D.",
    "The main event\nThe opening speakers passed quickly, in a rat-a-tat of 5 or 10 minute speaking slots.",
    "Mike Lindell, the pillow guy, had just walked by and they were eager to track him down for a photo.",
    "People have to believe in their elections, they have to believe that they were honest.?\nOne.",
    "The whole program wrapped up more than an hour and a half before Trump was set to speak.",
    "While that might not work on Weiss and Lucas, it made a difference for Joseph Harbolt.",
    "Rep. Mike Carey, R-OH, and candidates Madison Gesiotto Gilbert, Max Miller, and J.D.",
    "A short trip, she explained, compared with driving to Dallas for a previous rally.",
    "They live in nearby Sunbury and were wearing matching women for Trump? t-shirts.",
    "Mike DeWine the door, but they were unmoved by Trumps recent endorsement of J.D.",
    "Autumn Davidson was wearing a pink baseball cap that said Trump? in rhinestones.",
    "The speech itself was the just as vitriolic, rambling, and digressive as ever.",
    "The candidates\nChristi Weiss and Theresa Lucas didnt exactly want to talk.",
    "Contact Editor David DeWitt for questions: info@ohiocapitaljournal.com.",
    "With a wry half grin, he brought up Q-Anon and his website sheepnesia.",
    "His remarks also served as a reminder of the limits of Trumps power.",
    "Not on my watch.?\nLaRose was on hand Saturday but didnt speak.",
    "is really an America First warrior,? Trump told the crowd.",
    "We have our own minds, and we will make up our own minds.",
    "Ohio Capital Journal maintains editorial independence.",
    "Follow Ohio Capital Journal on Facebook and Twitter.",
    "Mercifully, he took the stage 15 minutes early.",
    "Trump was particularly effusive about Miller.",
    "She sold a tattoo removal business last year.",
    "Davidson came up for the day from Louisville.",
    "We love Trump, but hes not God,? Lucas said.",
    "Both agreed that they wanted to show Gov.",
    "What more do you need?? she laughed.",
    "No one will take that away from you.",
    "It sparkles and it says Trump.",
    "Who would think its possible?",
    "Vance rounded out the lineup.",
    "Ballots,? Trump said later.",
    "Ohio Republican U.S. Rep.",
    "Vance meant a great deal.",
    "The audience loved it.",
    "The crowd erupted.",
    "Voting.",
    "Paper.",
    "Vance.",
    "Day."
  ]
}