{
  "id": 6199,
  "mediaId": 302,
  "date": "4/23/2022 12:00:00 AM",
  "headline": "Heres what to read from the left and the right | Column",
  "image": "https://www.tampabay.com/resizer//YviXKsj-FstzTf2Rnr43tzbczbI=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/P2YSNEWFRYI6TORZIBWI6S7HAY.jpg",
  "link": "https://www.tampabay.com/opinion/2022/04/23/heres-what-to-read-from-the-left-and-the-right-column/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jim Verhulst",
  "authorUrl": "https://www.tampabay.com/author/jim-verhulst/",
  "termIds": [
    661,
    3103
  ],
  "sentences": [
    "The form it took for each of them was quite different, but in each case moral capitalism meant standing for the interests and needs of ordinary people  small-business people, small farmers, wage earnersand against the big interests: against Wall Street, the big investor, and now, of course, big corporations like Walmart and Amazon.",
    "Ron DeSantis and the Legislature ramming through new congressional maps that heavily favor Republicans, and with lawmakers following the governors lead in attacking The Walt Disney Co. Well have our say (again) on those actions and others, including the states unexplained rejection of some school textbooks.",
    "The context, from the author: Eavesdrop on any pair of political obsessives (in Tallahassee)  media types, campaign consultants, lobbyists, the rent-seekers of all parties  and you will hear them veer quickly toward the most reliable conversation-starter in this politically obsessed town.",
    "Two years since the beginning of the pandemic, studies are suggesting that Floridas handling of COVID-19 has put the Sunshine State in a more favorable economic position compared to other states that took a more aggressive mitigation approaches, such as California.",
    "That fall, DeSantis was elected by less than 1 percent of the vote over one of the worst Democratic candidates in state history: Andrew Gillum, a (formerly) closeted bisexual man, married to a woman, with a large drug problem and a wafer-thin resume.",
    "As has been the case since the outset of the pandemic, we found sharp partisan differences when it came to pandemic beliefs, with 75 percent of Democrats expressing concern over a spring or summer surge, compared to only 42 percent of Republicans.",
    "The excerpt: Trump likes to say, and he does so with Trumpian repetition, that in 2018 DeSantis was at 3 percent in the polls (not quite) and that without a Trump endorsement DeSantis would have lost the gubernatorial election (probably so).",
    "Thanks to the generosity of St. Petersburg philanthropists Kate Tiedemann and Ellen Cotton, USF hopes to develop its financial technology program into a national model and a hub of excellence? for fintech education and entrepreneurship.",
    "A majority (60 percent) said that they were either very? or somewhat? satisfied, and more than two thirds say that Florida has done either as well (32 percent) or better (36 percent) than other states when it comes to pandemic response.",
    "Vance has courage, of the kind Trump must have recognized when he decided to endorse Vance, over and against the opposition and underhanded scheming of much of the Republican establishment, including inside the Buckeye State GOP.",
    "Although the survey responses suggest that many Floridians are ready to move on from the pandemic, COVID-19 cases are up 24 percent nationwide in the past two weeks, with an average of 38,000 cases per day in the United States.",
    "When respondents were asked to name the most important issue facing the state today, over a third (34 percent) identified jobs and the economy, with COVID-19 only being the most important issue to 9 percent of Floridians.",
    "A representative sample of 600 adult Floridians was collected via a stratified, quota sampling method, with balanced quotas (by region of the state) for age, gender, race, ethnicity, education, and political affiliation.",
    "The excerpt, from one of Kazins answers: Theres also, I think, a strand of what I call moral capitalism? that was true for (Andrew) Jackson, and was true for F.D.R., and, for all of his problems, for Joe Biden as well.",
    "While 17 percent of children in Florida lived below the federal poverty level in 2019, more than half of children in Florida (56 percent) lived in households experiencing financial hardship,? according to the report.",
    "The survey  conducted between March 31 and April 12 at the University of South Florida  asked a representative sample of 600 Floridians how satisfied they are with the states handling of the COVID-19 pandemic.",
    "Both measures have been in play for some time; supporters argue the levies are essential for operating a competitive school district and for maintaining a transportation system that serves the growing region.",
    "The Ph.D. standard can be tolerable for a while, but the long-term trends are clear: a pattern of artificial boom and bust, accompanied by a long, slow (or sometimes short, fast) decline in currency value.",
    "While the federal poverty level in the U.S. is often used to measure financial hardship in America, the United Way has worked with researchers for years to better gauge the scope of financial insecurity.",
    "This week, the Hillsborough school district and county government both agreed to put new taxes on the ballot in August and November to augment school operations and the countys transportation budget.",
    "Health officials remain optimistic in the fight against stealth omicron, but note that the choices Americans make regarding vaccinations will have a direct correlation to beating the BA.2 variant.",
    "Mayor Ken Welch said the gifts impact would extend throughout the region, as those involved with USF would develop new technologies in banking, insurance, the blockchain, cryptocurrency and more.",
    "The context: With midterm elections approaching, the historian Michael Kazin discusses the problem of moral capitalism? and the uneasy alliances at the heart of the Democrats economic movement.",
    "Using census data, incomes and ZIP codes, the United Way can identify households that dont earn enough to afford necessities such as reliable transportation, child care, food, and housing.",
    "Their responses suggest that a majority of Floridians are satisfied with the states handling of COVID-19, and most no longer view the pandemic as the most important issue facing the state.",
    "And children of color were disproportionately affected, with 73 percent of Black children and 66 percent of Hispanic children living in hardship, compared to 42 percent of white children.",
    "In Florida, more than three-quarters (79 percent) of Floridians have received at least one dose of the COVID-19 vaccine, and about two-thirds (67 percent) are considered fully vaccinated.",
    "This is a tough environment for any new tax, but these are serious decisions with huge ramifications, and the school board and county commission were right to seek the will of the voters.",
    "The money will benefit the Kate Tiedemann School of Business and Finance, which is based at USFs St. Petersburg campus, but which also has students and faculty in Tampa and Sarasota.",
    "Certainly, having some regulations by representative governments could help, but in a truly democratic society, it would be governed by users, workers, and other stakeholders.",
    "When it comes to vaccine effectiveness, 91 percent of Democrats were confident that the COVID-19 vaccines reduce the risk of death compared to only 66 percent of Republicans.",
    "The new subvariant of Omicron, BA.2 (known as stealth omicron?) is now the dominant variant in the country accounting for 86 percent of cases since the beginning of April.",
    "Differing views across party lines around vaccine efficacy and pandemic mitigation efforts continue to turn what should be a public health issue into a political one.",
    "The new program, at the SPC campus near Williams Park, opens to its first wave of students in the fall and will focus on science, technology, engineering and math.",
    "Of that $14 million, $4 million has already been directed to endow two fintech professorships, leaving another $10 million to build the program in other ways.",
    "Although many Floridians support how the state handled the pandemic, the survey further underscored how polarizing and political it has been from the start.",
    "The University of South Florida broke the Monday blues in a big way this week with the announcement of a $14 million gift to its Muma College of Business.",
    "More children struggle with poverty than official government data reflects, and the disparity is especially acute in Florida and punishing to minorities.",
    "The members of the Editorial Board are Editor of Editorials Graham Brink, Sherri Day, Sebastian Dortch, John Hill, Jim Verhulst and Chairman Paul Tash.",
    "This type of focused program isnt what every high school student needs, but its great that its available for those who thrive in such an environment.",
    "The context, from the author: Economists track record at diagnosing and resolving inflation problems over the past 70 years or so has been very bad.",
    "Even financially comfortable Americans are facing sticker shock at the grocery, as the basics  eggs, bread, dairy, cereal  seem costlier by the day.",
    "Still, we continued to observe stark partisan differences when it came to the states handling of the crisis and the efficacy of COVID-19 vaccines.",
    "In addition, we found that 87 percent of Democrats were confident in COVID-19 public health guidance, compared to only 44 percent of Republicans.",
    "This is a chronic problem the state must address, even though it runs counter to the narrative by politicians that Floridas economy is thriving.",
    "The context, from the author: Donald Trump has made a courageous decision in backing the Hillbilly Elegy author in the Ohio GOP Senate primary.",
    "Indeed, throughout decades of U.S. military involvement in the Middle East, Americans heard remarkably little about peace, even aspirationally.",
    "In a post-9/11 world, the other side of war was not peace but merely less-visible war, war that was drone-operated and remote and ignorable.",
    "FROM THE LEFT\nFrom Can The Democratic Party Define Itself?? an interview of historian Michael Kazin by Isaac Chotiner in The New Yorker.",
    "His lead TV spot featured DeSantis sprawled on the living-room rug, teaching his toddling children how to build a wall with tiny blocks.",
    "In a recent survey, we asked Floridians how they felt about the Sunshine States pandemic response and the ongoing public health crisis.",
    "Feeding Tampa Bay, Tampa Bay Harvest and Metropolitan Ministries are just a few of the local providers who could use the generosity.",
    "Those are the findings of a recently published United Way study, which experts detailed this week during a virtual panel discussion.",
    "The excerpt: If we think about the ideal means of governing a platform like Twitter, it wouldnt be rule by the worlds richest man.",
    "Florida had the third-highest rate in the nation of children living in households struggling to meet basic needs, the study found.",
    "Still, a majority of respondents (59 percent) remain concerned about the possibility of a potential surge in the spring or summer.",
    "I think theres continuity there in rhetoric and ideology, even though the meaning of all that rhetoric has changed in major ways.",
    "SPCs other two collegiate high school programs are at the main campus on Fifth Avenue N and 66th Street N and in Tarpon Springs.",
    "That spring, after trailing for months in statewide polls, DeSantis gave up running as DeSantis and began to run as Trump-Lite.",
    "The political marriage of Donald Trump and Ron DeSantis, never passionate but for a time mutually convenient, is all but over.",
    "Christina Stevens is associate director of development for the University of South Florida Libraries, and a USF MPA candidate.",
    "And 88 percent of Democrats believe that vaccines reduce the risk of hospitalization, compared to 69 percent of Republicans.",
    "The context, from the author: Elon Musks bid to buy Twitter in the name of free speech is the latest example of his hubris.",
    "The report published this month shows the impact on children, including the effects on education, hunger and mental health.",
    "We used to put our faith in gold, and after nearly 200 years, ended up the wealthiest country in the history of the world.",
    "standard.? We either put our faith in gold, or we put our faith in a floating fiat currency run by eggheads with Ph.Ds.",
    "In fact, a large majority of Floridians now agree that the worst is behind us? (71 percent) when it comes to COVID-19.",
    "Economic concerns have now surpassed COVID-19 as the most important issue for a plurality of the states residents.",
    "Only 62 percent of Republicans were confident that COVID-19 vaccines are safe compared to 86 percent of Democrats.",
    "In Florida, measured COVID cases were recently on the rise in Palm Beach County for the first time since January.",
    "Good to see St. Petersburg College bringing its successful collegiate high school program to its downtown campus.",
    "Consider this an effort to broaden our collective outlook with essays beyond the range of our typical selections.",
    "Their support and USFs ambition are a wonderful combination that will enrich Tampa Bay for generations to come.",
    "Facing record inflation and a potential recession, manyFloridians appear ready to put the pandemic behind them.",
    "Speaking of poverty, struggling households were in dire straits before rising inflation caused prices to spike.",
    "From Why We Have Record Inflation And Its Probably Not Going Away Fast,? by Nathan Lewis in The Federalist.",
    "Hillsborough County voters are rightly taking control over two major decisions facing their community.",
    "Stephen Neely is an associate professor at the University of South Floridas School of Public Affairs.",
    "The USF study was conducted as an online survey using Prodege MR, a leading market research provider.",
    "Overall, it appears that Floridians are generally pleased with the states pandemic response.",
    "Of course, the ballot initiatives also come amid spiking inflation and rising housing costs.",
    "The program allows students to graduate with a high school diploma and an associates degree.",
    "We also found differing opinions across party lines regarding vaccine safety and efficacy.",
    "The excerpt: In the end, we really have only two options: the gold standard, or the Ph.D.",
    "The results are reported with a 95 percent confidence level and a margin of error +/- 4.",
    "FROM THE RIGHT\nFrom Divorce, Florida-Style,? by Neal B. Freeman in The National Review.",
    "The final decade of the gold standard era  the 1960s  was possibly the best since 1914.",
    "The excerpt: I am struck by how thoroughly we ... have lost the taste for world peace.",
    "Its not just that Elon Musk shouldnt own Twitter  billionaires shouldnt even exist.",
    "Enrollment should reach about 320 students by the third year, the school projects.",
    "We live in a partisan age, and our news habits can reinforce our own perspectives.",
    "The survey referenced in this article was conducted between March 31 and April 12.",
    "For now, well highlight other developments this week that were closer to home.",
    "The only questions that remain are when it will end and how ugly it will get.",
    "From We Dont Need Billionaires Like Elon Musk,? by Paris Marx in Jacobin.",
    "The context, from the author Calls for world peace no longer interest us.",
    "Over the years, Tiedemann and Cotton have given USF around $30 million.",
    "More than two years since the pandemic hit Florida, what is the mood?",
    "Tallahassee provided no shortage of controversy this week, with Gov.",
    "Vance, Youre Hired,? by Sohrab Ahmari in The American Conservative.",
    "From Never Again, Again,? by Susan Bigelow Reynolds in Commonweal.",
    "So heres a timely reminder: If you can, help an area food bank.",
    "Editorials are the institutional voice of the Tampa Bay Times.",
    "Follow @TBTimes_Opinion on Twitter for more opinion news.",
    "Now imagine having to stretch the food budget even more.",
    "Subscribe to our free Stephinitely newsletter\nFrom J.D.",
    "Thats the reality for a growing number of Floridians.",
    "Its a welcome addition to downtown St. Petersburg.",
    "That accounts for about 2.4 million children.",
    "We know too much and too little.",
    "Hillsborough voters decide.",
    "Children in poverty.",
    "Welcome new campus.",
    "The excerpt: J.D.",
    "USFs major gift.",
    "Help food banks.",
    "They should.",
    "The Split."
  ]
}