{
  "id": 6220,
  "mediaId": 238,
  "date": "d2022-04-22T18:04",
  "headline": "Opinion: Disney should leave Florida. Its time for DeSanty World.",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/22/disney-world-should-leave-florida-desantis/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1506,
    3103,
    3982,
    524,
    611,
    3230,
    2621,
    2661,
    2851
  ],
  "sentences": [
    "Vance, a Republican Senate candidate from Ohio, put it in a just-released private message from 2016, We are, whether we like it or not, the party of lower-income, lower-education white people, and I have been saying for a long time that we need to offer those people SOMETHING.? So offer them a theme park!",
    "Jared Polis, the Democratic governor of Colorado, has promised to grant Mickey and Minnie full asylum in Colorado? and offered Disney a Mountain Disneyland? retreat from Floridas authoritarian socialist attacks on the private sector.? Many Disney fans online are urging Disney World to leave Florida.",
    "But Disney is the place where dreams come true, and mine is that the whole of Disney World, which employs roughly 80,000 Floridians and attracts tens of millions of tourists every year, will take the second star to the right and straight on till morning  and abandon Florida entirely.",
    "A new 101 Dalmatians Dog Whistle attraction would feature DeSantis, who said, when he had a Black opponent in 2018, The last thing we need to do is to monkey this up.? The existing Under the Sea Journey of the Little Mermaid would be repurposed to promote offshore oil.",
    "A thoroughly remodeled Tower of Terror would have the MAGA faithful screaming as Ursula lures them into gender reassignment surgery, Maleficent tries to enchant them with universal health care, and the demons Pain and Panic attempt to vaccinate them.",
    "Rising antisemitism (Floridas most famous resident just had a film screening at Mar-a-Lago characterized by antisemitic swipes at Mark Zuckerberg) gives Jews pause about the state.",
    "Ron DeSantis (R-Hades) got his state legislature this week to abolish the favorable tax arrangement that brought Disney World to Orlando and kept it there for 55 years.",
    "Splash Mountain, already getting re-themed around The Princess and the Frog,? would now swap the evil voodoo practitioner Dr. Facilier with the more evil Dr. Fauci.",
    "DeSanty World would surely sack the China Pavilion at Epcot and its planned film Wondrous China.? This would be replaced by a Covid Theater (no masks allowed!).",
    "The Mad Tea Party and Festival of Fantasy Parade could pretty much stay as they are, and the Hall of Presidents would just be dispossessed of its 46th inductee.",
    "(As it is, central Floridians could be stuck with more than $1 billion in debt and a massive property-tax increase because of DeSantiss anti-Disney vendetta.)",
    "DeSantis would be left with a 25,000-acre house of horrors in Orlando: an abandoned resort in a state nobody wants to visit, thanks to Rons Runaway Railway.",
    "DeSanty World would make the Carousel of Progress turn in reverse, reimagining the Disney classics to suit its growing audience of Snow White nationalists.",
    "Then, after all but the QAnon faithful had self-deported from DeSanty World, the few remaining stragglers would sing as one: Its a small world after all.",
    "Its the latest salvo against corporate America from the Trump right, which has already threatened Twitter, Facebook, Citigroup and Delta Air Lines.",
    "His voter-suppression laws and race-baiting attacks on teaching history and race make Florida hostile to Black, Latino and Asian Americans.",
    "His opposition to Medicaid expansion and Floridas excessive covid-19 death rate over the past year have sent many Floridians to the morgue.",
    "Of course, you cant just put a resort with six theme parks and two dozen or so hotels on a magic carpet ride to, say, New Jersey.",
    "The Barnstormer roller coaster (a staggering series of stupendous stunts?) would be dedicated to DeSantis instead of Goofy.",
    "And all would cheer for QAnons own Captain Hook as he battles to prevent villainous Peter Pan from grooming the Lost Boys.",
    "Aladdins new soundtrack would warn of A Whole New World Order,? and Mulan would be reviled for spreading the coronavirus.",
    "And, because of the parks new open-carry gun policy, the whole thing would become a Frontierland Shootin Arcade.",
    "Lady Tremaine, the wicked stepmother, would become the heroine of Cinderella, championing parental rights.",
    "DeSantiss MAGA-signaling anti-immigrant and antiabortion laws repel more large swaths of the population.",
    "Brave Frollo would fight valiantly to free France of minority groups and the disabled.",
    "His dont say gay? legislation makes Florida unwelcoming to LGBTQ people.",
    "His banning of math textbooks should send educated Floridians packing.",
    "The Frozen Ever After boat ride would refute the climate change hoax.",
    "DeSanty World would build a wall around the Alien Swirling Saucers.",
    "Pinocchio would dream of becoming not a real boy? but a Proud Boy.",
    "Suddenly, sad times are upon the Happiest Place on Earth.",
    "Bambi would be seen from the hunters point of view.",
    "Some attractions would require only minor changes.",
    "Soon, there wont be much of a constituency left.",
    "But now theyre canceling Mickey and Minnie?",
    "Rename Disney Worlds ruins DeSanty World.",
    "Thats just Goofy.",
    "As J.D.",
    "Gov."
  ]
}