{
  "id": 6251,
  "mediaId": 238,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Opinion: Ron DeSantiss war on Disney points to an ominous GOP future",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/04/21/desantis-war-on-disney-gop-future/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3103
  ],
  "sentences": [
    "Vance told Vanity Fair that he envisions a kind of de-Baathification? or a de-woke-ification? of the institutions of the left.?\nVance, whos running for Senate in Ohio in the New Right nationalist vein, said that if Donald Trump is elected president, he should fire every single midlevel bureaucrat? and every civil servant in the administrative state,? and replace them with our people.?\nIts worth taking this seriously.",
    "Faced with a president whos fully willing to use the powers of the administrative state,? Moynihan told me, such foundations might refrain from advocating for various causes or fund certain types of research, because its not worth the potential risks.?\nWhat if such a president were backed in this project by congressional leadership?",
    "Those companies would sink large sums of money into litigating against such measures, even as Congress relied on taxpayer-funded lawyers on their side, Chafetz told me, meaning the onus of the expense would fall on the companies, which would have a chilling effect.?\nSo a lot is at stake in how DeSantiss war with Disney turns out.",
    "Such a president, he said, might use regulatory agencies staffed with right-thinking political employees (which Vance explicitly wants) to harass or investigate companies perceived as culturally disloyal.?\nAnother possibility, Moynihan said, might be to change the tax status of liberal-leaning foundations.",
    "Ron DeSantis and other Florida Republicans move forward with action against Disney World for opposing his law on teaching sex and gender, it will be more than just a slimy and indefensible rearguard effort to punish a private company for violating GOP orthodoxy.",
    "Other members of that New Right movement recently told me they envision a ramped-up use of the state to impose a post-liberal moral order, justified by hyperbolic visions of the supposedly hegemonic power of the left over our institutions.",
    "Josh Chafetz, a Georgetown law professor who studies Congress, says you could see legislation targeted at offending companies, and even if it didnt survive the courts, it could still function in a punitive way.",
    "Thats because, while its still unclear how this will play out, the Reedy Creek Improvement District allows Disney quasi-governing powers over the area, whose basic governing services are funded by Disney.",
    "Congressional Republicans have vowed retaliation against companies for opposing Georgias voter suppression bill and for cooperating with the congressional investigation into Trumps coup attempt.",
    "The measure bars or restricts instruction on sexual orientation and gender orientation in a way thats plainly designed to chill even the most routine discussion of LGBTQ topics.",
    "It will also point to a potential future Republican Party that envisions an expanded use of state power to fight the culture wars in a much broader and more pernicious sense.",
    "DeSantis is plainly salivating at signing this, perhaps on Fox News, where millions of 2024 GOP primary voters would thrill as a woke corporation? is brought to its knees.",
    "Before you say, Who cares, Disney doesnt deserve any special privileges,? lets be clear: This isnt about whether Disneys state-created privileges are good or bad policy.",
    "You dont have to back Disneys stance to agree that the company should not be punished with a change in government policy for expressing its opinion of the law.",
    "Well, on multiple fronts, the Republican Party is growing much more inclined to use state power to fight the culture wars, well beyond just DeSantis.",
    "In a sense, then, Florida Republicans might end up essentially raising taxes on Florida voters to own the libs.? Take that, woke elites!",
    "So experts and local officials fear that revocation of the arrangement might mean a tax hike on locals to fund replacement services.",
    "What might it look like if a President DeSantis took this view of the administrative state and decided to wield his power this way?",
    "Rather, whats at issue is the use of such a policy as retaliation against Disney for taking a stand on DeSantiss law.",
    "And given all the accolades hes getting from the right, does anyone doubt that this could get a whole lot worse?",
    "Donald Moynihan, an expert on the administrative state at Georgetown, says you can envision various scenarios.",
    "Importantly, hes flaunting his willingness to use state power this way as a selling point for the presidency.",
    "There are reasonable arguments for reforming some of those privileges, such as its copyright protections.",
    "Disney opposes the law on the grounds that it could be used to unfairly target? LGBTQ kids and families.",
    "The Florida Senate just passed such a measure, and the state House could vote on it Thursday.",
    "In coming days, DeSantis is expected to revoke Disneys self-governing privileges in Orlando.",
    "Okay, Disney will probably be fine, but this might end up hurting ordinary Floridians.",
    "To glimpse the future, just look at what DeSantis is saying and doing right now.",
    "And DeSantis is a front-runner for the 2024 GOP presidential nomination.",
    "Those are already another favorite target of right-wing populists.",
    "Meanwhile, GOP elected officials seem to be moving this way.",
    "But here again, the laws specifics are beside the point.",
    "So what does this tell us about a possible GOP future?",
    "And this is an absolutely understandable fear.",
    "In an interview published this week, J.D.",
    "So lets run a thought experiment.",
    "When Gov."
  ]
}