{
  "id": 6267,
  "mediaId": 43,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Yes, Republicans really are moving us towards",
  "image": "https://images.dailykos.com/images/980526/story_image/GettyImages-1332538177.jpg?1630083532",
  "link": "https://www.dailykos.com/story/2022/4/21/2093232/-Yes-Republicans-really-are-moving-us-towards-full-blown-fascism",
  "sentiment": "0",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3103
  ],
  "sentences": [
    "Moynihan suggests that in an Executive controlled by DeSantis, for example, administrative agencies could be staffed (much the way they were under the Trump administration) with right-thinking? officials, but specifically tasked with hunting down and persecuting corporations who refused to toe the administrations ideological lines; in effect, to harass or investigate companies perceived as culturally disloyal. Changing the tax status of liberal-leaning foundations and targeting specific corporations with punitive measures (akin to what DeSantis is imposing on Disney) would also be possible through the administrative state.",
    "Those companies would sink large sums of money into litigating against such measures, even as Congress relied on taxpayer-funded lawyers on their side, Chafetz told me, meaning the onus of the expense would fall on the companies, which would have a chilling effect.?\nAll of this, of course, is in the service of maximizing political power through control of the population, be it publicly through their media propaganda outlets or now privately through coercion aimed at businesses and corporations that might threaten the conservative dogma that cements their control.",
    "The district and its quasi-ownership by Disney were created in part to alleviate anticipated tax burdens on local state governments whose boundaries encompass the 25,000 acre district, and essentially allows the megaresort, which employs roughly 80,000 people, to function as its own municipal government.?\nDisneys privileged status was revoked because Disneys CEO Bob Chapek publicly criticized legislation passed last month by DeSantis and the Florida GOP which prohibits discussions about gender-related issues in the states public schools.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWhy House Democrats' best defense is a good offense\nThe Downballot\nFollowShare\n0:0044:11\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nSargents piece in the Post, however, goes significantly further, explaining exactly how such tactics could  and likely would  play out on a national level assuming Republican control of Congress, or even worse, the Executive branch which controls the function of our federal agencies.",
    "With their thoroughly corrupted majority on the Supreme Court, their gerrymandered legislative majorities seemingly pending to take control of the Congress and now, their increasing willingness to punish private corporations who decline to submit to their ideological malignancy, Republicans have shown every indication not only that they prefer to live in a country like Hungary or Russia, but that they intend to do whatever is necessary to make that happen as soon as possible.",
    "As explained by Jonathan Chait, writing for New York Magazine, what the Republican Party now apparently sanctions, with little or no debate, is the same type of intimidation autocracies commonly use to stifle dissent and control public opinion in countries such as Viktor Orbans Hungary and Vladimir Putins Russia:\nCorporations that publicly question the partys preferred policy, or withhold donations in protest, will be subject to discriminatory policy.",
    "Vance, for example, currently running for senate in Ohio) have already voiced their support and approval of such tactics, which they characterize as the philosophy of a rejuvenated, more menacing New Right? repurposed to promote a theocratically-based post-liberal moral order.?\nListen and subscribe to Daily Kos Elections The Downballot podcast with David Nir and David Beard\nx\nx\nYou need to enable JavaScript to run this app.",
    "What DeSantis and the Florida GOP have signaled with this action is their willingness to impose and inflict their warped sense of supposed Christian morality (or lack thereof) on the public at large through legislation that financially punishes private corporations which oppose or publicly disagree with their views.",
    "As Greg Sargent, writing for the Washington Post, explains, this represents a chilling expanded use of state power to fight the culture wars in a much broader and more pernicious sense.?\nAgain, Disney itself  and whatever your feelings may be about that corporate behemoth  is wholly beside the point here.",
    "And although conservatives love to pay fealty to the supposedly libertarian principles of free enterprise,? those sentiments, as we now see in Florida  will readily come to a screeching halt when private businesses act as an impediment to the rights theocratic cultural dogma.",
    "Known as the Dont Say Gay? law, that bias-affirming legislation is one of the more recent examples of Republican legislation designed to marginalize and demonize LGBTQ people, now an imperative for the Republicans in their effort to gain and cement political power.",
    "And if for some reason that type of state-controlled pressure didnt have its desired chilling effect? on the way such foundations approached certain issues, the added legislative threat from a GOP Congress working in tandem with such agencies certainly would.",
    "The bill, which will now almost certainly become law, eliminates the companys Reedy Creek Improvement District, formed in 1967 as a consequence of the Disney corporations purchase of land to build its Magic Kingdom.",
    "Josh Chafetz, a Georgetown law professor who studies Congress, says you could see legislation targeted at offending companies, and even if it didnt survive the courts, it could still function in a punitive way.",
    "The rest of us --and the incredible diversity of race, religion, and gender that this country actually represents  are simply obstacles to their vision, and thus undeserving of any thought or consideration.",
    "If they enjoy favorable regulatory or tax treatment, they can continue to do so on the condition that they stay in the GOPs political good graces.",
    "Florida Governor Ron DeSantis\nOn Thursday the Florida legislature passed a bill cancelling Walt Disney Worlds special tax status in that state.",
    "Chait notes the lack of almost any conservative opposition to DeSantis action, a silence which confirms its tacit approval among the right.",
    "Poll\n 758 votes Show Results\n Poll: When will the media finally acknowledge that the Republican Party has turned into a party of fascists?",
    "The impact this retaliatory legislation will have on Disney's bottom line is unclear, and frankly irrelevant to the larger point.",
    "Sargent quotes professor Donald P. Moynihan, of Georgetown University, on the implications of this type of intimidation.",
    "Sargent poses the question:\nWhat if such a president were backed in this project by congressional leadership?",
    "Poll: When will the media finally acknowledge that the Republican Party has turned into a party of fascists?",
    "It is a method that, until quite recently, would have been considered unthinkable in the United States.",
    "17%\n131 votes\nOnly when their own livelihoods are threatened, and then it will be too late.",
    "The word 'fascist' is unseemly, and Democrats should use more acceptable terminology.",
    "The word 'fascist' is unseemly, and Democrats should use more acceptable terminology.",
    "5%\n35 votes\nRight after the 2022 elections, when the reality finally hits home.",
    "Only when their own livelihoods are threatened, and then it will be too late.",
    "As Sargent notes, some of the current crop of Trump-vetted candidates, (J.D.",
    "Right after the 2022 elections, when the reality finally hits home.",
    "66%\n502 votes\nIn about six or seven Friedman units, give or take.",
    "Trump and DeSantis have now made it almost unremarkable.",
    "This is one way rulers like Orban and Putin hold power.",
    "In about six or seven Friedman units, give or take.",
    "10%\n73 votes\nOther (feel free to elaborate).",
    "That bright line has been obliterated.",
    "Our task is to prove them wrong.",
    "Other (feel free to elaborate).",
    "758 votes Vote Now!",
    "2%\n17 votes",
    "Never.",
    "Never.",
    ".",
    "."
  ]
}