{
  "id": 6296,
  "mediaId": 376,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "You always have to talk about health: Trump shows his first card in close-held 2024 hand",
  "image": "https://content.rollcall.com/wp-content/uploads/2022/04/GettyImages-1239876703.jpg?fit=1240,698",
  "link": "https://www.rollcall.com/2022/04/19/you-always-have-to-talk-about-health-trump-shows-his-first-card-in-close-held-2024-hand/",
  "sentiment": "0.0",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John T. Bennett",
  "authorUrl": "https://www.rollcall.com/author/john-t-bennett/",
  "termIds": [
    661,
    3103
  ],
  "sentences": [
    "To be sure, holes in one are rare and, as Trump put it in the same statement, quite exciting.? He also boasted about winning the days match, during which he teamed with South African professional golfer Ernie Els, a four-time major tournament winner: I wont tell you who won because I am a very modest individual, and you will then say I was bragging  and I dont like people who brag!?\n45 picking up his hole-in-one on Saturday.",
    "It took place at Trump International Golf Club in West Palm Beach, Florida, on the 7th hole, which was playing 181-yards into a slight wind.?\nWhat came next was vintage The Donald, painting himself as something of an athletic savant on the links  one that can overcome a breeze and a course expertly mowed to present a challenge to those brave, and wealthy, enough to take it on.",
    "Trump certainly likes being the partys kingmaker, and 2024s presidential contest within the Republican Party would be on steroids for the potential of moving a significant number of Republican voters into one candidate's camp,? he added, and thus gaining instant traction in what could be a significantly crowded field of candidates.?",
    "In many Republican primaries, Trump does not appear able to crown winners simply with his endorsement  his candidates are often in for a fight with other Republicans.?\nOhios primary for the Senate seat soon to be vacated by the retiring Rob Portman is emerging as a key test case for the Trump seal of approval.",
    "It would be very much on-brand for The Donald, whose entire political persona is based on an argument he is a once-in-a-generation mind, to become an irritant to the nominee by second-guessing every decision he or she makes in 2024.",
    "It is possible to see three cracks in what Trump would like to believe is monolithic control over the Republican Party,? according to Elaine Kamarck, a former Clinton administration official now with the Brookings Institution.",
    "His lukewarm embrace of Vance came in a statement that, in another un-Trump moment, put practicality over the MAGA movement, with Democratic Rep. Tim Ryan on course to be his partys primary winner: We cannot play games.",
    "Vance, a venture capitalist and author of the bestselling memoir Hillbilly Elegy.?\nTrumps usual public decisiveness and firmness has been missing with some of his recent endorsement, including that of Vance.",
    "This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race  theyve said great things about Trump and, like me, they love Ohio and love our Country.",
    "More importantly, perhaps, could be the rush of securing Trumps endorsement for the presidential nomination,? said Michael Bitzer, a political science professor at Catawba College in North Carolina.",
    "He appeared to suggest he is not, in fact, in peak physical condition when asked about seeking the GOP presidential nomination, a race that will kick into gear following Novembers midterm elections.",
    "Many people are asking, so Ill give it to you now, it is 100% true,? Trump said in a March 28 statement released by his post-presidency office before being sure to plug his ritzy resort.",
    "I hit a 5-iron, which sailed magnificently into a rather strong wind, with approximately 5 feet of cut, whereupon it bounced twice and then went clank, into the hole,? Trump bragged.",
    "The further from his presidency he gets, the less Trumps endorsement of GOP candidates essentially secures them the Republican primary win in state or congressional races.",
    "When Trumps endorsement landed late last week, Vance trailed former state Treasurer Josh Mandel, 28 percent to 22.6 percent, in one recent poll by the Trafalgar Group.",
    "pic.twitter.com/dzTdWAdkWe\n Taylor Budowich (@TayFromCA) March 28, 2022\nThe Republican standard bearer is a lot of things, but humble has never been one of them.",
    "To what lengths will other potential 2024 Republicans go to secure what would be the only endorsement that would move the needle in a Trump-free GOP primary?",
    "The former so wanted to make a point about illegal immigration that he took a hammer to his states economy by slowing the flow of goods entering from Mexico.",
    "ANALYSIS  Donald Trump prefers to keep allies and foes guessing, but he has finally shown a card in his closely held hand about the 2024 presidential race.",
    "Would Trump be able to resist commenting  multiple times per day  on the primary and how the partys eventual nominee chose to take on President Joe Biden?",
    "So it was somewhat stunning when Trump recently showed some humility and acknowledged his age and health during an interview with The Washington Post.",
    "That might actually be the bigger contest within the GOP: Who does Trump anoint as heir apparent??\nCould anyone handle the ultimate backseat driver?",
    "The latter has made himself into a Trump-style fighter who will take on political foes and even large employers in the Sunshine State like Disney.",
    "The ultimate backseat driver would likely view himself as an unofficial campaign manager  and one with the loudest megaphone in American politics.",
    "They will need to not only get Trumps attention, but keep it and prove to him they are the proper heir to the Make America Great Again? movement.",
    "Whether his grip on the party remains strong is playing out in the various 2022 GOP primary contests battling for Trumps blessing,? Bitzer said.",
    "The former president, despite being 75 and overweight with several medical issues, has long argued he is in great physical and mental shape.",
    "Will Vance get a Trump bump? and overtake Mandel, which would amount to a sign the former president remains his partys most powerful force?",
    "is the most likely to take out the weak, but dangerous, Democrat opponent.?\nAll eyes will now be on future polling in the Buckeye State.",
    "Thats not good when they use the word again.?\nThe former presidents comment should cast some doubts on his entry into the 2024 race.",
    "Evan Siegfried, a Republican strategist, said Monday he expects several high-profile GOP figures  namely: DeSantis, Pence and Sens.",
    "You look like youre in good health, but tomorrow, you get a letter from a doctor saying, Come see me again,? he told The Post.",
    "Ted Cruz of Texas, Tom Cotton of Arkansas and Josh Hawley of Missouri  wont spend too much time dwelling on Trumps remark.",
    "So that begs a question: Is Trumps health comment the start of him realizing the MAGA movement is starting to lose steam?",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades.",
    "Lately, he has boasted  and raised money  off a hole in one he allegedly bagged at one of his Florida golf courses.",
    "Fox News call-ins to the highly rated primetime programs of commentators like Sean Hannity and others.",
    "But there are others who will run regardless.?\nIs Trump losing his grip over the party?",
    "But, as always, Trump spoke in a riddle that raises more questions than it answers.",
    "He is our best chance for victory in what could be a very tough race,? Trump said.",
    "If Trump decides not to run in 2024, then it would be a wide-open contest.",
    "The hard-core Trump base appears to be shrinking,? she noted.",
    "Ambassador Nikki Haley and others  might have to do and say.",
    "Kristi Noem, former Vice President Mike Pence, former U.N.",
    "I think he was doing an interview and he was just riffing.",
    "Other Republicans are going to run, even if he does run.",
    "There will be one or two who dont run if Trump does run.",
    "Greg Abbott has offered a few clues, as has Florida Gov.",
    "Here are three questions after Trumps moment of candor.",
    "Hes going to run if he chooses to run,? Siegfried said.",
    "Posts on his conservatives-only social media site.",
    "It is all about winning!?\nLike some others, J.D.",
    "Ive studied this race closely and I think J.D.",
    "The former president on Friday endorsed J.D.",
    "Imagine what others  think South Dakota Gov.",
    "Who wins the Trump endorsement hunger games?",
    "You always have to talk about health.",
    "Ron DeSantis.",
    "Statements.",
    "Texas Gov."
  ]
}