{
  "id": 6607,
  "mediaId": 129,
  "date": "5/19/2022 12:00:00 AM",
  "headline": "David Graham pondered",
  "image": "https://static01.nyt.com/images/2022/05/19/opinion/19Bruni-image/19Bruni-image-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/05/19/opinion/republican-primaries-trump.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    943,
    1813,
    2303,
    3102,
    5292,
    5439,
    428,
    523,
    571,
    2661,
    2845
  ],
  "sentences": [
    "Noting that a serving of a sort of Fontina cheese souffl was 590 calories, he wrote, If it had been 10 times that Id have eaten half, paused to call for a defibrillator and gone back in with a song on my lips.?\nHe also observed that in an age of overextended celebrity chefs, Randall was actually working in the kitchen: Its like booking months in advance to get into a David Hockney exhibition and finding the guy sitting on a stool in the corner of the gallery, cheerfully knocking out paintings for the crowd.? (Steve DeCherney, Chapel Hill, N.C.)\nIn his newsletter for The Atlantic, Tom Nichols used a movie allusion to take various officials who served under President Trump to task: Esper, Mattis, Rex Tillerson, and many, many other people who crawled through the Shawshank sewer pipe that was the four years of the Trump administration needed to speak up the minute they were out.",
    "In The Wall Street Journal, Jason Gay weighed in on the quarterback Tom Bradys already-set deal to do television commentary after he stops playing: Did you expect him to retreat from public life, to grow a long, flowing beard and become a recluse who writes unpublished books about trains, and is occasionally photographed midday outside a decaying mansion in a silk TB12 bathrobe, eating almonds and talking to squirrels?? (Thanks to James Brockardt of Pennington, N.J., for this nomination.)",
    "Also in The Journal, William Sertl wrote about the virtues of Cunards Queen Mary 2 for trans-Atlantic travel: Her aft decks taper and are open to the sky, avoiding the bulky look of yet another condo that slid off the Jersey Palisades and floated out to sea.? (Dan DeVoe, Cleves, Ohio)\nIn The Financial Times, Tim Hayward reviewed the chef Theo Randalls restaurant in the InterContinental in London right after the implementation of a new law that required the posting of calorie counts.",
    "By contrast, Fetterman looks like he was hacked together from spare parts in an oil-streaked Pittsburgh chopper garage.? (Jeannie MacDonald, Portsmouth, N.H.)\nIn his Esquire newsletter, Charles Pierce responded to the revelation that hundreds of Native American children had died in government-sponsored schools by writing: Sooner or later the angry angel of history was coming to our door.? (Louise Machen, Cody, Wyo.)",
    "Even the most dated clothes seemed ready to spring to life, like actors of a certain age waiting to be rediscovered by Quentin Tarantino.? (Jeannie Naujeck, Durham, N.C., and Pam DeAngelus, Cedar Grove, N.J.)\nTo nominate favorite bits of recent writing from The Times or other publications to be mentioned in For the Love of Sentences,? please email me here, and please include your name and place of residence.",
    "Republican primaries are like holding a heavy metal air guitar contest in order to compete for a place in a jazz ensemble.? (Jeff Merkel, Fairbanks, Alaska, and Paul Spitz, Cincinnati, among others)\nAnd Vronique Hyland rhapsodized about a fashion dump? of discarded garments and accessories that were there for the taking: When I walked into curated, antiseptic boutiques, I felt starved for novelty.",
    "Also in The Atlantic, David Graham pondered the different vibes? projected by Representative Conor Lamb, who lost the Democratic Senate primary in Pennsylvania, and John Fetterman, who won: Lamb seems like a candidate created in a Democratic Senatorial Campaign Committee lab: Hes young, Kennedy-handsome, a Marine and former federal prosecutor who looks born to wear suits.",
    "Thats clear not only from the results of the primary contests thus far but also from the talking points and battle cries beyond them  from, for example, the governors mansion in Florida, where Ron DeSantis plots and executes his plan for emerging as the new leader of the Republican Party.",
    "What Im Reading\nId very much like to believe that the prospect of abortion being outlawed in dozens of states will redound to the Democratic Partys favor in the midterms, but its complicated, as this report by Reuters, this one in Politico and this one in The Times all indicate.",
    "As a onetime food writer and forever glutton who relocated less than a year ago to the Tar Heel State, Im the perfect audience for Edible North Carolina: A Journey Across a State of Flavor,? edited by Marcie Cohen Ferris, an authority on food culture in the American South.",
    "A week ago, one of the networks pugnacious nighttime hosts, Sean Hannity, railed about photographs that he said showed pallets and pallets of baby formula for illegal immigrants and their families? even as hardworking American families? went without this vital resource.",
    "And as Pennsylvania Republicans rejected Barnette, they tightly embraced her kindred spirit Doug Mastriano as their nominee for governor: According to incomplete results, he won about 44 percent of the votes in a three-way race.",
    "Republicans in North Carolina also chose Representative Ted Budd, who voted to nullify the results of the 2020 election, over Pat McCrory, the states former governor, to be their candidate in the pivotal Senate race there.",
    "More and more Republicans are Stop the Steal? politicians even if they never attended or endorsed a Stop the Steal? rally, because that scowling, sneering phrase taps into and touches on more than vote counts.",
    "Mastriano has made the idea that the 2020 presidential election was an act of Democratic theft  and that conservative Christians are waging a battle of good against evil  the center of his political identity.",
    "Thats the case with the two Pennsylvania candidates, Mehmet Oz and Dave McCormick, who performed better than Barnette in the Senate race and are essentially locked in a tie, with a recount in the offing.",
    "Sometimes, though, all you have is its disintegrating feathers  or, still worse, not its plumage but its tweets.? (Pete Andrews, Chapel Hill, N.C.)\nBret Stephens wrote: The problem the G.O.P.",
    "has had for some time now is that in many states and districts, not to mention the presidential contest, the candidate most likely to win a primary is least likely to win a general election.",
    "In The Times, Ross Douthat assessed Elon Musks messy and unresolved ascent toward ownership of Twitter by alluding to Icarus: Sometimes you leap and have a birds wings to bear you upward.",
    "Its a gorgeous collection of articles, photographs and recipes that capture and celebrate the distinctiveness of regional culinary traditions, and its an epicurean voyeurs delight.",
    "On a Personal Note\nChip Scanlan, a veteran journalist and writing coach, interviews other writers for his newsletter, asking them to respond to an established set of questions.",
    "Theres keenly observed cultural history and a bonanza of terrific sentences in this critics notebook about the fading of the magazine industry by Alexandra Jacobs in The Times.",
    "The core of that strategy seems to be the naming and slaying of liberal monsters, be they outside the homes of Supreme Court justices, in the classroom or in the Magic Kingdom.",
    "In a House primary in North Carolina, voters rejected Representative Madison Cawthorn, suggesting that theres some limit to the partys current appetite for bratty and kooky.",
    "Kathy Barnette, an anti-gay, anti-Muslim conspiracist, came in third in the primary in Pennsylvania for a Senate seat, despite the late-breaking fervor for her.",
    "But as Alex Koppelman of CNN later noted in the Reliable Sources newsletter, the photos were instead of powdered milk, intended for children over a year old.",
    "Its because his signature expression  his glow  provides such a clear counterpoint to the Republican mien of the moment, equal parts scowl and sneer.",
    "Donald Trumps preferred candidate for governor of Idaho, Janice McGeachin, bumped up against it, losing her race by more than 20 percentage points.",
    "She used the occasion of two new books that look, respectively, at Vogue and Vanity Fair to chronicle what was, what will no longer be, and why.",
    "Instead, they teased their book bombshells or played coy games of slap and tickle on cable outlets.? (Brian Harral, Crofton, Md.)",
    "Ill zip through two pieces of writing that turn out really well and take minimal effort, and Ill think: Ive cracked the code!",
    "I can pump out nothing edible unless Ive put in lots of flour, eggs and water, by which I mean reporting, reading, thinking.",
    "Me: That your first draft is often precisely that, and it can be terrible without being a signal that you should jump ship.",
    "It validates the complaint that some elite cabal is making decisions and hoarding riches at the expense of other Americans.",
    "Republicans Are Officially the Stop the Steal Party Now\nI keep flashing back to Ronald Reagans preternaturally smiley face.",
    "It blesses a revolt against the sorts of demographic trends that have given the great replacement? theory such traction.",
    "Neither stood up forcefully to the Stop the Steal? caucus because neither felt that he could afford to alienate it.",
    "Not all Republicans on the ballot in November will precisely mirror his positions or exactly parrot his words.",
    "He has cozied up to QAnon adherents and called for mask-burning parties to protest Covid-related restrictions.",
    "Ive turned the corner!? And then the next piece will be the most sluggishly produced horror show of my career.",
    "It indulges fictions that abet that mind-set, which explains a good deal of the popularity of Fox News.",
    "Oh, sure, they offered a few consolations, at least by the debased standards of this chilling era.",
    "The Republican politicians who dont specialize in outrage creation do too little to counter it.",
    "Its about all these things that are being taken away, all these things that must be taken back.",
    "The unpredictability of how much time something will take me and how easy or hard it will be.",
    "I went through those paces recently, and he gave me permission to share what he published.",
    "It encourages a rebellion against cultural dynamics that offend some traditionalists.",
    "If you had to choose a metaphor to describe yourself as a writer, what would it be?",
    "I cant do David Remnicks erudite agnolotti or David Sedariss inimitable farfalle.",
    "When you hit a wall, when youre feeling blocked, step away from the computer.",
    "No one ever got anywhere by banging on the backspace key for hours on end.",
    "What is the single best piece of writing advice anyone ever gave you?",
    "The Republicans in the foreground today are foundationally resentful.",
    "Hes as apt a poster boy for the 2022 midterm elections as anyone.",
    "Surveying the Swap Shops jumble, I saw infinite possibilities.",
    "I make only noodles  no rice  and only so many kinds of those.",
    "Both saw that indignation animates the Republican Party now.",
    "A candidate can choose not to stoke it, but he cant buck it.",
    "Chip: Whats the greatest lesson youve learned as a writer?",
    "What has been the biggest surprise of your writing life?",
    "Outrage Creation? was the headline on Koppelmans report.",
    "The Republican primaries on Tuesday were harvest time.",
    "Recrimination, rage: Those are the fuels they run on.",
    "Budd beat McCrory by more than 30 percentage points.",
    "Just dont overwork a metaphor the way I just did.",
    "They will, in aggregate, bring you up to speed.",
    "Reagans disposition was fundamentally hopeful.",
    "But the books appeal transcends any one state.",
    "Thats not because I yearn for his presidency.",
    "Its a pledge to keep the darkness at bay.",
    "His isnt a morning-in-America approach.",
    "Theyll emulate his sense of grievance.",
    "Those are the emotions they till.",
    "Watch a stupid situation comedy.",
    "But dont uncork the champagne.",
    "But most will echo his anger.",
    "But my orecchiette arent bad.",
    "Read 50 pages of a novel.",
    "And should never assume.",
    "Let your brain relax.",
    "You just never know.",
    "Rub the dogs belly.",
    "Im a pasta machine.",
    "And bailing water.",
    "Let it reboot.",
    "Keep sailing.",
    "Take a run.",
    "Or rowing."
  ]
}