{
  "id": 7113,
  "mediaId": 302,
  "date": "5/21/2022 12:00:00 AM",
  "headline": "Florida lawmakers to target roof claims, lawyers during property insurance session",
  "image": "https://www.tampabay.com/resizer//bh0N6U4Etl_TSGeYV0tKG2GsGP0=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/EWBKJHWQCSCANJCIKVVXBPCX6I.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/20/florida-lawmakers-to-target-roof-claims-lawyers-during-property-insurance-session/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lawrence Mower",
  "authorUrl": "https://www.tampabay.com/author/lawrence-mower",
  "termIds": [
    661,
    3836,
    562,
    571,
    3355,
    2661,
    2926
  ],
  "sentences": [
    "Theyre going to have to give up that lifetime investment of their home and put it on the market because now their premium is higher than their mortgage payment.?\nThe proposed legislation would create an exemption in the states building code, so that roofs that are more than 25% damaged but already comply with the 2007 building code may be repaired instead of being required to be replaced.",
    "The proposal balances fair costs and protections for consumers,? Sen. Jim Boyd, R-Bradenton, wrote to senators Friday night, while adding reasonable guardrails for insurance companies against the frivolous litigation and fraudulent claims that drive up rates for everyone.?\nLawmakers would also keep a closer eye on insurance companies that fail.",
    "The Office of Insurance Regulation would also create a new insurer stability unit to increase regulatory oversight,? and the office would be required to open an investigation when consumer complaints suggest a trend in the marketplace rather than an isolated incident,? according to a summary of the legislation by the House of Representatives.",
    "Homeowners would be required to get a discount for selecting that policy, and the deductible would not apply if the home is a total loss, or damaged by a hurricane, a fallen tree branch or a roof loss requiring a repair of less than 50% of the roof.",
    "While the changes announced this week could quickly address one aspect of the crisis  denials for older roofs  it remains unclear whether the changes will result in serious relief for Floridians experiencing double-digit rate increases.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nFor months, observers and analysts have been warning that without significant reforms, the property insurance crisis would pose a terrifying threat to homeowners.",
    "Under a policy plan unveiled three days before lawmakers return to Tallahassee to tackle Floridas property insurance crisis, companies would be blocked from denying coverage because of a roofs age if the roof is less than 15 years old.",
    "As insurance companies have seen a rise in roof claims, theyve refused to insure homes with older roofs, shedding policies and forcing homeowners to spend tens of thousands of dollars on a new roof just to get coverage.",
    "TALLAHASSEE  State lawmakers Friday night unveiled proposed legislation that would allow homeowners with older roofs to still get property insurance and create a fund for Floridians who want to upgrade their homes.",
    "Theyre going to be forced to sell their properties,? Mark Friedlander, director of communications for the industry-backed Insurance Information Institute, told a panel hosted by a ratings agency on Thursday.",
    "Lawmakers are being recalled to Tallahassee because they failed to agree on legislation to address the property insurance crisis during their 60-day legislative session earlier this year.",
    "Insurance companies would also be allowed to offer policies with a separate roof deductible that would not exceed 2% of the policy dwelling limits or 50% of the roof replacement costs.",
    "Earlier this week, the Times/Herald reported that while state law requires such reports to be done, the reports are completed years later, and few people knew such reports existed.",
    "In addition to roofs, lawmakers are proposing:\nAssigning $2 billion to a new reinsurance program  insurance that insurers buy  to cover losses during hurricane season.",
    "And for roofs that are older than 15 years, insurers would have to allow homeowners to have an inspection on the roofs condition before refusing coverage.",
    "If the inspection shows the roof has five or more years of useful life left, the insurance company could not reject coverage simply because of age.",
    "Allowing Floridians to receive up to $10,000 for home-hardening improvements on their homesteaded properties valued at $500,000 or less.",
    "Within two months after an insurer is ordered into insolvency, the state would have to conduct a report about why the company failed.",
    "The proposals were announced after weeks of negotiations between leaders of the House and Senate and staff working for Gov.",
    "Ron DeSantis, who earlier this week promised a very significant package? to address the crisis.",
    "The ideas are meant to halt one of the worst side effects from the states insurance crisis.",
    "Insurers have blamed lawyers for causing double-digit rate increases for most Floridians.",
    "Insurers that buy into the program would have to reduce homeowners rates by June 30.",
    "Creating a host of limits on attorneys fees in lawsuits against insurance companies.",
    "Homeowners would receive $2 for every $1 they spend.",
    "They cant afford the insurance anymore.",
    "Theyre going to lose their homes."
  ]
}