{
  "id": 7114,
  "mediaId": 151,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Florida wants to avoid critical race theory and social justice in social studies texts",
  "image": "https://www.politico.com/dims4/default/7e2fd24/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F65%2F2b%2F1e1231ad408caafd5eb0221ce47b%2F20200527-textbooks-getty-773.jpg",
  "link": "https://www.politico.com/news/2022/05/20/florida-critical-race-theory-social-justice-social-studies-00034104",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4059,
    517,
    3279,
    3286,
    5208,
    2661
  ],
  "sentences": [
    "Ron DeSantis, who made a major push to prohibit schools and companies from leveling guilt or blame at students and employees based on race or sex, taking aim at lessons over issues like white privilege.? To that end, the guidance to publishers notes that possible critical race theory components could include making someone feel discomfort, guilt, anguish, or any other form of psychological distress on account of his or her race, color, sex, or national origin.?\nAdditionally, the Florida Department of Education wants to avoid references to social justice? in its textbooks and gave publishers a few examples to help guide them.",
    "This is counted as an unsolicited? strategy to FLDOE, which told publishers to refrain from teachings on identity and identity identification concepts; managing emotion; developing relationships and social awareness.?\nFloridas slate of math textbook rejections, along with recent laws passed in the state like the Parental Rights in Education bill, on Thursday were key topics during a congressional hearing on curriculum sabotage and classroom censorship? led by the Subcommittee on Civil Rights and Civil Liberties of the House Committee on Oversight and Reform.",
    "Social justice lessons, according to Florida officials, would be seeking to eliminate undeserved disadvantages for selected groups; undeserved disadvantages are from mere chance of birth and are factors beyond anyones control, thereby landing different groups in different conditions; and equality of treatment under the law is not a sufficient condition to achieve justice.?\nThe state is also targeting social emotional learning, which has recently emerged as another topic under criticism from DeSantis.",
    "The state, through a rule passed by the Board of Education in 2021, defines critical race theory as an ideology that racism is not merely the product of prejudice, but that racism is embedded in American society and its legal systems in order to uphold the supremacy of white persons.? Critical race theory, along with The 1619 Project? from The New York Times, are theories that distort historical events,? according to Florida leaders.",
    "The agency, in recent undated guidance, asked textbook publishers to avoid those topics on top of culturally responsive teaching, social and emotional learning, and any other unsolicited theories? as the DeSantis administration and Republicans continue to scrutinize what students are learning in public schools, especially on the issues of race and gender identity.",
    "But if were going to bring subjective material into the classroom, that is the problem that has some parents upset in the United States.?\nDemocrats frequently criticized Floridas policies along with others across the U.S. that they say prohibit discussions of race and LGBTQ issues and violate free speech principles, mirroring authoritarian governments.",
    "Florida already has received national attention after rejecting scores of math books for broaching topics state leaders deemed impermissible.?\nInstructional materials should not attempt to indoctrinate or persuade students to a viewpoint inconsistent with Florida standards,? FLDOE officials wrote in its undated specifications to publishers.",
    "| Getty Images\nBy Andrew Atterbury\n 05/20/2022 03:59 PM EDT\nTALLAHASSEE, Fla.  Floridas Department of Education is explicitly aiming to keep critical race theory and social justice? out of social studies textbooks that the state will ultimately adopt for its new teaching standards.",
    "A representative from free speech organization PEN America agreed with Donalds, acknowledging that there was a risk that this was going to stoke division, detract from the lesson.?\nIf were going to talk about history, lets talk about history,? Donalds said.",
    "One Florida Republican on the subcommittee, Rep. Byron Donalds, asked the panel of witnesses, ranging from parents to school leaders and free speech advocates, if they believed the math lessons flagged by the state education department were appropriate.",
    "Critical race theory, an analytical framework developed by legal scholars, is generally known as a way to examine how race and racism have become ingrained in American law and institutions since slavery and Jim Crow.",
    "Florida education officials, in the guidance, told publishers that all proposed social studies content must abide by the states rules outlawing critical race theory, known also as CRT, and similar teachings.",
    "The Florida Department of Education wants to avoid references to social justice? in its textbooks and gave publishers a few examples to help guide them.",
    "Donalds, a former member of the Florida House, used examples of questions asking students to measure racial prejudice by age and political affiliation.",
    "DeSantis is bringing a brand of authoritarianism to Florida that Putin, Maduro or Castro would applaud,? said Rep. Debbie Wasserman Schultz (D-Fla.).",
    "Bids formally opened March 12 and textbook publishers have until June 10 to submit their social studies proposals to the state education department.",
    "They used last weeks racist shooting at a Buffalo grocery store as a horrifying? example of what could happen if ignorance and hatred spread.?\nGov.",
    "Social studies lessons are also required to follow the Stop WOKE Act? passed by Republican lawmakers in Florida earlier at the request of Gov.",
    "Social emotional learning aims to teach students how to manage their emotions and develop strong relationships with their peers."
  ]
}