{
  "id": 7117,
  "mediaId": 302,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "As cost of condo insurance soars, Florida legislators remain silent",
  "image": "https://www.tampabay.com/resizer//ZQm047vojDUXgvKbQ-mdslit7pQ=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/ZZR7RAWBLPQIBMZ4QTDAKDHPZ4.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/20/as-cost-of-condo-insurance-soars-florida-legislators-remain-silent/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Kyle Ulrich, president and CEO of the Florida Association of Insurance Agents, said Thursday that in talking to more than 2,000 of his association members, this is the most difficult marketplace that anyone that Ive talked to has had to operate in, even post (Hurricane) Andrew in 1992 and 93.?\nDeSantis isnt offering specifics\nMeanwhile, DeSantis has remained silent about what direction he would prefer lawmakers to go.",
    "He said this week that he was open to addressing other issues if the Legislature comes to me and say they have an agreement on doing some of the other key things that people have talked about across a wide range of issues.? Efforts to get his communications staff to clarify whether he has taken a position on either the House or Senate approach to condo inspection reform have gone unanswered.",
    "As many as nine companies that offer condo insurance have left the market, and the estimated four companies that are still writing policies have increased premiums an average of 50 percent, and as much as 100 percent in some markets, said Mike Clarkson, president of All Lines Insurance Group, a Clearwater-based company that represents 750 condominium associations throughout the state.",
    "And were not going to accept anything less than a very significant package for the people of Florida.?\nCitizens sees spike in condo policies\nFor the last year, Citizens has seen the number of individual condominium insurance policies for buildings older than 40 years decline across the state.",
    "Condominium associations now must provide proof that the condo building has passed all inspections, conducted a detailed on-site inspection of all buildings, and all members of the board of directors have signed affidavits confirming there are no outstanding maintenance issues.",
    "Legislators couldnt reach agreement\nDuring the regular legislative session that ended in March, lawmakers considered legislation that would impose statewide re-inspection requirements for aging buildings and address the financial reserve requirements need to pay for them.",
    "Like many in his industry, he notes that underwriting losses peaked in 2020, even with no active hurricanes, and data show that the losses track the rise in litigation over water damage and roof claims and costs accelerated by contingency attorney fee multipliers.",
    "There is no capacity on the market  that dried up by March 1.?\nThe result is that condominium owners are being forced to turn to the more expensive and less-regulated surplus lines market or obtain insurance from Citizens Property Insurance, the state-run carrier.",
    "Between 2020 and 2021, there were 2,267 commercial residential condo policies dropped by admitted carriers in Florida and nine fewer companies writing coverage, according to the Office of Insurance Regulation, which is charged with regulating the industry.",
    "But for several years, there has not been much competition among insurance carriers to write master policies for the condo market at the same time banks were making it increasingly difficult to get a loan? for a mortgage on a condo unit, Clarkson said.",
    "Before Champlain Towers South collapsed on June 24, 2021, and raised doubts about the structural integrity of thousands of aging condominium buildings in Florida, the market for condo master policy insurance was already in decline, Clarkson said.",
    "Commercial residential insurance rates on condo buildings have seen rate hikes of 30 percent to 100 percent, exacerbated in part by the collapse of the Champlain Towers South condo in Surfside that killed 98 people and an industry in turmoil.",
    "The Senate refused to require condo associations to hold reserves to pay for structural repairs, allowing a two-thirds vote of owners to waive reserves, while the House refused to back off its requirement that there be no waiver of reserves.",
    "TALLAHASSEE  As Florida legislators convene for a special session next week aimed at tackling Floridas soaring property insurance crisis, one area that is getting little attention is the shrinking availability of condominium insurance.",
    "Most condo associations also have bylaws stipulating other insurance requirements, such as flood insurance, general liability, directors and officers insurance (which protects people who make decisions for the board).",
    "He said he bought his condo a couple of months ago and the price tag on his property insurance was horrific.?\nIm underwhelmed that anything we do next week will result in immediate premium reductions,? he said.",
    "In March, Citizens saw a 35 percent increase in new business across the state for condos less than 40 years old, only a 12 percent increase in policies for those buildings in Miami-Dade and Broward.",
    "At a briefing on Floridas insurance market sponsored by AM Best, the credit rating agency, insurers warned that Floridas property insurance climate is going to get worse before it gets better.",
    "Some companies have stopped writing master policies for condominium buildings, others are simply choosing not to renew, and the few that remain writing have imposed new underwriting policies.",
    "My biggest concern is that property appraisals have trailed the appreciation in the real estate market, and theyre going to catch up and youre going to have a perfect storm,? he said.",
    "Florida property insurance crisis is a man-made disaster, not a natural disaster,? said Mark Friedlander, director of communications for the Insurance Information Institute.",
    "Then, in March, the company saw a 27 percent spike in new policies for older buildings in Florida, with an increase of 37 percent in Miami-Dade and Broward counties alone.",
    "In the last 90 days, three Florida residential insurance companies have been declared insolvent and a fourth insurer announced it is canceling more than 68,000 policies.",
    "Citizens, however, is off-limits for the wealthiest homeowners because it caps coverage at $700,000 statewide and $1 million in Monroe and Miami-Dade counties.",
    "In condominium buildings built before 1982, unit owners increasingly had to turn to Citizens to obtain property insurance, Citizens told the Times/Herald.",
    "Condo associations are required by law to have master policies for building coverage, to cover structural damage from things like storms, wind and fire.",
    "For homeowners seeking information on surplus line carriers, which are not regulated, OIR directs consumers to www.fslso.com/Florida/MarketData/home.",
    "Higher property taxes, higher insurance, insurance on mortgages and thats all going to pop the balloon and cause recessionary pressures.?",
    "But while many buyers are offering cash payments for their purchases, new homeowners too often are faced with a grim reality, he said.",
    "He said he is one of the only legislators who lives in a condominium and has lived through the pain of finding affordable insurance.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nI havent seen it this bad in 30 years,? Clarkson said.",
    "Condo unit sales are still active, however, as the red-hot real estate market has condos still flying off the shelf,? he said.",
    "The condo insurance market reflects the same problems as the larger homeowners property insurance market.",
    "Late Friday, the House put out a list of bullet points describing some proposals that will be considered.",
    "The condo insurance market reflects the same problems as the larger homeowners property insurance market.",
    "Sen. Jason Pizzo, a Miami Beach Democrat, is less optimistic than the governor about the outcome.",
    "He also said he fears that lawmakers are doing too little, too late.",
    "But the bills died when the Senate and House reached an impasse.",
    "It will be a significant package,? the governor said Monday.",
    "Since the Surfside tragedy, things have only gotten worse.",
    "None of the items mentioned condominium coverage.",
    "Ron DeSantis was making promises.",
    "Earlier in the week, Gov."
  ]
}