{
  "id": 7123,
  "mediaId": 238,
  "date": "d2022-05-20T15:52",
  "headline": "Ginni Thomas, wife of Supreme Court justice, pressed Ariz. lawmakers to help reverse Trumps loss, emails show",
  "image": "",
  "link": "https://www.washingtonpost.com/investigations/2022/05/20/ginni-thomas-arizona-election-emails/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emma Brown",
  "authorUrl": "https://www.washingtonpost.com/people/emma-brown/",
  "termIds": [
    661,
    812,
    1039,
    1145,
    1147,
    1839,
    2087,
    2406,
    204,
    482,
    2550
  ],
  "sentences": [
    "Just days after media organizations called the race for Biden in Arizona and nationwide, Thomas urged the lawmakers to stand strong in the face of political and media pressure.? She told the lawmakers the responsibility to choose electors was yours and yours alone? and said they have power to fight back against fraud.?\nThomas sent the messages via an online platform designed to make it easy to send pre-written form emails to multiple elected officials, according to a review of the emails obtained under the states public records law.",
    "This is a moment, a unique moment in American history, demanding that state legislators set America back on her foundations by using a power that you may never have known that you had  but you do have it.?\nThe video link and some of the language in the email match language that appears in an archived version of the landing page for a freeroots.com email campaign organized by Act for America, a group that has accused U.S. Muslim organizations of supporting terrorism and of trying to impose Islamic law across the country.",
    "It included a link to a video of a man delivering a message meant for swing-state lawmakers, urging them to put things right? and not give in to cowardice.?\nBy December, the claim that legislators should override the popular vote in key states and appoint Trumps electors was also being pushed publicly by John C. Eastman, a former law clerk to Clarence Thomas, and Rudy Giuliani, Trumps personal lawyer.",
    "On that same day, Bolick was among dozens of Arizona lawmakers who signed on to a letter to Congress calling for the states electoral votes to go to Trump or be nullified completely until a full forensic audit can be conducted.?\nBolick told The Post she signed on to that effort because she backed the idea of an audit, not because of any communication she received from Thomas.",
    "It was replaced with language identifying three Founding Sponsors?: the Texas security firm Allied Security Operations Group, the Texas nonprofit group Liberty Center for God and Country and the online talk show Economic War Room.?\nRepresentatives of United in Purpose and the three sponsors of everylegalvote.com did not respond to messages seeking comment.",
    "The email address of the sender in Thomass emails is displayed as Ginni Thomas<noreply@freeroots.com>.?\nThe Nov. 9 email carried the subject line, Please do your Constitutional duty!? In addition to pushing the lawmakers to appoint legislators, the email asked for a meeting to discuss pursuing an audit? of the vote.",
    "But I cannot and will not entertain a suggestion that we violate current law to change the outcome of a certified election.?\nBolick is married to Clint Bolick, an associate justice of the Arizona Supreme Court, who worked with Clarence Thomas early in his career and has said he considers the justice a mentor.",
    "It said to push for new electors in states where constitutional rights have been violated and evidence of substantial fraud has been established.?\nVisitors to the site could click a button and be taken to freeroots.com, according to webpages preserved by the Internet Archives Wayback Machine.",
    "Virginia Ginni? Thomas, the conservative activist and wife of Supreme Court Justice Clarence Thomas, pressed Arizona lawmakers after the 2020 election to set aside Joe Bidens popular-vote victory and choose a clean slate of Electors,? according to emails obtained by The Washington Post.",
    "Trump allies argued that pandemic-era changes in election administration and supposedly widespread fraud meant that elections had not been conducted in accordance with state legislatures directions, and that under the U.S. Constitution the results therefore could be cast aside.",
    "On Nov. 13, 2020, CNP Action held a workshop entitled Election Results and Legal Battles: What Now?? featuring, among other speakers, Cleta Mitchell, according to an agenda obtained and published by the left-leaning watchdog group Center for Media and Democracy.",
    "Never before in our nations history have our elections been so threatened by fraud and unconstitutional procedures.?\nThe two-minute video it linked to, titled A Word To Heroic Legislators,? has since been removed from YouTube for violating community guidelines.",
    "Bolick, who is now seeking the Republican nomination to be Arizonas secretary of state, told The Post that she received tens of thousands of emails in the months after the election and responded to Thomas in the same way she responded to everyone else.",
    " [P]lease take action to ensure that a clean slate of Electors is chosen.?\nThomass name also appears on an email to the two representatives on Dec. 13, the day before members of the electoral college met to cast their votes and seal Bidens victory.",
    "That landing page urged visitors to press the take action? button to email every swing House and Senate leader in one easy click.?\nBecause that landing page is no longer online, it is no longer possible to click through on the link.",
    "The emails were sent to Russell Bowers, a veteran legislator and speaker of the Arizona House, and Shawnna Bolick, who was first elected to the chamber in 2018 and served on the House elections committee during the 2020 session.",
    "Also in 2019, she and fellow right-wing activists attended a White House luncheon, where the New York Times reported that they told Trump his aides were blocking their preferred candidates for administration appointments.",
    "About a decade ago, she and Stephen K. Bannon  who later became chief strategist in the Trump White House  were among the organizers of Groundswell, a group formed to battle liberals and establishment Republicans.",
    "Shawnna Bolick wrote back to Ginni Thomas on Nov. 10, 2020, I hope you and Clarence are doing great!? She gave Thomas guidance on how to submit complaints about any of her experiences with voter fraud in Arizona.",
    "Thomass actions also underline concerns about potential conflicts of interest that her husband has already faced  and may face in the future  in deciding cases related to attempts to overturn the 2020 election.",
    "The site everylegalvote.com initially said that it was produced in partnership with United in Purpose, a nonprofit group known for gathering and deploying data to galvanize conservative Christian voters.",
    "Botkin, who has published numerous podcasts and videos about the election and other matters, wrote in the newsletter that he had uploaded A Word To Heroic Legislators? to another video hosting service.",
    "By early December, Eastman and Giuliani were telling lawmakers in key swing states won by Biden that they had the authority and even the obligation to disregard the vote and select their own electors.",
    "Those questions intensified in March, when The Post and CBS News obtained text messages that Thomas sent in late 2020 to Trumps chief of staff, Mark Meadows, pressing him to help reverse the election.",
    "When Trumps legal team pressed to replace Biden electors with Trump electors, Bowers released a public statement explaining that they were asking legislators to do something forbidden by state law.",
    "But language in Thomass first email aligns closely with language that appears in a preview when a FreeRoots link that was archived several days after that email is shared on messaging platforms.",
    "The videos Web address, which is visible in the email, was included in a December 2020 newsletter written by activist Geoffrey Botkin, who appears to be the person featured in the video.",
    "Demand that they not abandon their Constitutional responsibilities at a time such as this,? read the guidance, which was also first published by the Center for Media and Democracy.",
    "Efforts to persuade state lawmakers to name new electors are among the issues under examination by the congressional committee investigating the Jan. 6, 2021, insurrection.",
    "As state lawmakers, you have the Constitutional power and authority to protect the integrity of our elections  and we need you to exercise that power now!? the email said.",
    "Under her message is an unusual tag line that has appeared in other emails that are confirmed to have been sent by Thomas, including in 2021 to the staff of Florida Gov.",
    "The records obtained by The Post do not show any response from Bowers, whose refusal to help overturn Bidens victory in Arizona made him the target of a recall campaign.",
    "On Dec. 14, 2020, Biden electors in Arizona cast their votes, after the election results were certified by Democratic Secretary of State Katie Hobbs and Republican Gov.",
    "The messages show that Thomas, a staunch supporter of Donald Trump, was more deeply involved in the effort to overturn Bidens win than has been previously reported.",
    "Recipients have included Meadows, then a congressman chairing the hard-right Freedom Caucus, Project Veritas founder James OKeefe and Fox News host Sean Hannity.",
    "In sending the emails, Thomas played a role in the extraordinary scheme to keep Trump in office by substituting the will of legislatures for the will of voters.",
    "Ginni Thomas has insisted that she and her husband have kept their work separate, but her political activism has set her apart from other Supreme Court spouses.",
    "The emails, sent by Ginni Thomas to a pair of lawmakers on Nov. 9, 2020, argued that legislators needed to intervene because the vote had been marred by fraud.",
    "Groundswell dedicated itself to a 30 front war seeking to fundamentally transform the nation,? according to emails uncovered by Mother Jones at the time.",
    "Thomas is a member of the Council for National Policy, a network of prominent conservative activists, some of whom helped press claims of election fraud.",
    "In urging Arizona lawmakers to choose? electors after Biden had already prevailed, Thomass messages claimed lawmakers could intervene in that process.",
    "That organization has hosted the luncheons where Thomas presents her Impact Awards.?\nBut the reference to United in Purpose was deleted within days.",
    "Before you choose your states Electors ... consider what will happen to the nation we all love if you dont stand up and lead,? the email said.",
    "Historically, some state legislatures appointed electors directly, but in the modern era states have delegated that responsibility to voters.",
    "Thomas sent the emails via freeroots.com, a website meant to give political organizers an efficient means of conducting email campaigns.",
    "Article II of the United States Constitution gives you an awesome responsibility: to choose our states Electors,? read the Nov. 9 email.",
    "God bless America!?\nThomas was then serving on the board of CNP Action, the political advocacy arm of the Council for National Policy.",
    "In the reply, Thomass personal email address is visible, and it matches an address she has used previously, The Post confirmed.",
    "Your argument is that essentially we have a failed election that would require the legislature to step in and assign electors.",
    "In the month after the election, the Trump campaign and other Republicans filed dozens of lawsuits challenging the outcome.",
    "Clarence and Ginni Thomas had lunch with Trump at the White House in 2018, then attended a state dinner the following year.",
    "After that workshop, the group circulated guidance to focus efforts on legislators in Pennsylvania, Georgia and Arizona.",
    "Many legal experts have called those arguments unpersuasive and anti-democratic, and no state legislature complied.",
    "Im asking you to stand up and lead heroically,? Botkin says in the video, urging lawmakers to appoint electors.",
    "Under the U.S. Constitution, states appoint presidential electors in such manner? as the legislatures direct.",
    "Thomass influence in Washington grew during the Trump presidency as her views moved into the GOP mainstream.",
    "CNP Action was using its influence in Republican circles at the time to try to keep Trump in office.",
    "Competition, hard work, innovations and lack of government interference make great things possible!",
    "Over those same years, at annual luncheons, Thomas handed out Impact Awards? to right-wing figures.",
    "Ron DeSantis (R): Sent from Ginnis iPhone, a by-product of entrepreneurial free market capitalism.",
    "She recently said she attended the pro-Trump rally at the Ellipse in Washington on Jan. 6, 2021.",
    "Election integrity? was among the topics discussed in the groups first months, the emails show.",
    "All three sponsors have promoted election-fraud claims, according to previous Post reports.",
    "Mitchell, a lawyer, assisted Trump in his efforts to overturn Bidens victory in Georgia.",
    "Clever lawyers or the Supreme Court, they cannot now come to the rescue,? he continues.",
    "We have to admit, legally and politically its way too late for other people to do it.",
    "As a conservative Republican, I dont like the results of the presidential election.",
    "A representative of Act for America did not respond to requests for comment.",
    "Though she did not mention either candidate by name, the context was clear.",
    "Am I correct?? a Georgia senator asked Eastman during a Dec. 3 hearing.",
    "I voted for President Trump and worked hard to reelect him,? it said.",
    "The challenges failed one by one.",
    "The video remains visible there.",
    "Doug Ducey."
  ]
}