{
  "id": 7125,
  "mediaId": 302,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Are Democrats up to preventing the next coup attempt? | Column",
  "image": "https://www.tampabay.com/resizer//B0r5IvZl0EzNZMDuAr9wwHyEq1k=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/ZSQIOZMFD6QQVOYFWRSL7BZOTM.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/20/are-democrats-up-to-preventing-the-next-coup-attempt-column/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Kristina Karamo, for example, the Trump-endorsed secretary of state candidate in Michigan, claims that she personally witnessed fraudulent vote-counting in 2020, that Trump won her state (Biden won it by 154,000 votes) and that left-wing anarchists attacked the Capitol on Jan. 6.",
    "Our voting systems in America have not always been perfect  the most glaring flaw being the disenfranchisement of many African Americans until the mid-20th century  but we corrected that, and over time and in most places, weve conducted free and fair elections every two years.",
    "John Starkey, South Pasadena\nCareful what you wish for\nTaking aim at libel laws | May 19\nLegislators who may consider toying with the idea of making it easier to sue their critics for libel should consider that whats sauce for the goose is sauce for the gander.",
    "Her most recent book is Sex Matters: How Modern Feminism Lost Touch with Science, Love, and Common Sense.? To read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate webpage at www.creators.com.",
    "In 2015, the Tampa Bay Times uncovered an appalling statistic: Though Black residents made up just 26 percent of Tampas population, Black cyclists received 79 percent of the tickets issued by the Tampa Police Department in 12 years.",
    "These civil traffic citations, which overwhelmingly affected low-income Black Tampa neighborhoods, accounted for more than the total number of bicycle tickets issued in four of Floridas largest cities combined between 2012 and 2015.",
    "Subscribe to our free Stephinitely newsletter\nDemocrats are likely to have a tough election in November  not that widespread Republican victories will cause election deniers to reconsider their belief that the 2020 race was stolen.",
    "On May 23, the Tampa City Council will host a workshop to discuss whether or not a provision to amend the charter, thus giving the Citizen Review Board subpoena power and an independent attorney, will appear on the 2022 ballot.",
    "Were seeing a dangerous trend of election deniers lining up to fill election administration positions across the country,? Joanna Lydgate, chief executive of the States United Democracy Center, told The Guardian.",
    "The latest poll on this reveals that 68 percent of Tampa voters agree that the Citizen Review Board should have independent counsel so that the board members do not have to rely on legal guidance from the city.",
    "A closer look at the ticketing revealed that the Tampa police used the stops as a pretext to question and search as many residents as they could, employing racial profiling to fish for evidence of crimes.",
    "Some Republicans, it should not be forgotten, continue to uphold the integrity of elections; a handful of honest Republicans saved the country from a potentially disastrous constitutional crisis in 2020.",
    "In 2021, we learned that the Tampa Police Department was collaborating with landlords on a program that identified renters who were arrested and targeted them and their families for eviction.",
    "Nearly 82 percent of voters believe that the City Council and mayor should not be the ones to decide whether the Citizen Review Board should have subpoena power and independent counsel.",
    "Ron DeSantis decision to veto the bill that would have raised the energy bills of people using solar power by cutting what they are paid for electricity their panels feed into the grid.",
    "A February survey of 596 local election officials found that they spanned the political spectrum pretty evenly  26% identified as Democrats, 30% as Republicans and 44% as independents.",
    "But while Democrats are likely to lose seats in the House and Senate, local elections may not be so lopsided, particularly if the craziness of some of these candidates is highlighted.",
    "Bannon uses his popular podcast to tout taking over the Republican Party through the precinct committee strategy ... Its about winning elections with the right people  MAGA people.",
    "The ability to subpoena evidence would also allow the Citizen Review Board to access important evidence, instead of being limited to evidence solely presented by the police.",
    "Others were ticketed for minor infractions, the cost of which quickly ballooned into unaffordable fines and drivers license suspensions because of those unaffordable fines.",
    "Trump has endorsed candidates in Georgia, Arizona and Michigan, the only time in history that a former president has bestirred himself over races so far down the ballot.",
    "When the 2020 murder of George Floyd sparked nationwide calls to reduce the role and power of police in our communities, we pushed again to get those necessary tools.",
    "These tools would ensure that the Citizen Review Board would have access to an independent attorney free of potential conflicts of interest, such as ties to the city.",
    "Robin Lockett, who lives in Tampa, is Tampa Bay regional director of Florida Rising, an organization that aims to advance economic and racial justice across Florida.",
    "Additionally, death threats and intimidation from MAGA extremists have caused one in five election administrators to say they will leave their posts before 2024.",
    "It was a glimpse into the ordinary yet extraordinary system weve devised over decades and centuries to ensure that elections are performed honestly and securely.",
    "We will have our people in at every level.?\nAt least 23 candidates who deny the outcome of the 2020 election are running for secretary of state in 19 states.",
    "Across the country, candidates who deny the legitimacy of the 2020 election are seeking office in order to prepare the ground for the next election contest.",
    "Those unsexy races for local positions and administrative posts like secretaries of state could make the difference in 2024 between an election and a coup.",
    "Its a shame that school administrators and civil rights groups never learned the definition of desegregation, which is simply the opposite of segregation.",
    "While MAGA types are beavering away, attempting to stack election boards and other posts with election-denying zealots, what are other Americans doing?",
    "The most common explanation is that too many politicians were attacking a system that they know is fair and honest? and that the job was too stressful.",
    "While MAGA types are beavering away, attempting to stack election boards and other posts with election-denying zealots, what are other Americans doing?",
    "Despite Tampa police justifications at the time, the Department of Justice found that the tickets did not improve safety on the street or lower crime.",
    "States United also tallies 53 election deniers seeking governorships in 25 states, and 13 election deniers running for attorney general in 13 states.",
    "In 1980, because I was an idealistic conservative eager to do my bit for democracy, I volunteered for my local Republican Party as a poll watcher.",
    "Democrats, independents and sane Republicans should focus instead on the critical local contests that will determine who counts the votes in 2024.",
    "Worse, as the article points out, many students academic performance declined as a result of being bused to hostile environments at other schools.",
    "In many Florida cities, a strong appetite exists for a healthy, effective and sustainable citizen review process of law enforcement actions.",
    "When polls closed, election officials asked us to gather around as they opened the backs of the machines one by one and tallied the votes.",
    "We advocated for a Citizen Review Board with teeth, meaning that it would have its own attorney and the ability to subpoena evidence.",
    "I was among the group of local individuals and advocates who worked to establish a Citizen Review Board following the Times report.",
    "All that was legally required was the elimination of the dual systems that existed, but historically Black schools were sacrificed.",
    "If I go into a shop and decline to buy anything, can the shopkeeper then tell me that I owe him/her $17.55 for not buying anything?",
    "Former council member John Dingfelder then suggested that the Tampa city charter should be amended to let Tampa residents decide.",
    " 2022 Creators Syndicate\nThis accountability is long overdue, and we urge the City Council to finally let Tampa residents decide.",
    "The Tampa police confiscated the bicycle of one 54-year-old man after he was unable to provide a receipt to prove his ownership.",
    "The bill states that I have a $17.55 minimum bill adjustment.? So is Duke Energy charging me for not using their electricity?",
    "Ninety-one percent of those targeted for evictions were Black, when Black people are only 23 percent of the city population.",
    "They mistakenly believed it was integration, and it was forced on these alumni of Gibbs High School when most didnt want it.",
    "Election administrators are observed by partisans of both parties, and the results are often counted more than once.",
    "And while we waited, more egregious actions by the Tampa police continued to happen without community oversight.",
    "Without the right tools, the Citizens Review Board doesnt have the teeth to get to the bottom of what happened.",
    "I have just had solar panels installed at a personal cost of over $22,000, so I was very happy to see his veto.",
    "Pardoned Trump ally Steve Bannon is encouraging MAGA-ites to run for local posts with authority to count votes.",
    "This accountability is long overdue, and we urge the City Council to finally let Tampa residents decide.",
    "If past is prologue, Democrats will probably pour money into unwinnable races over the next few months.",
    "The results of each polling location are delivered to the precinct and then on to the canvassing board.",
    "Among those are battleground states that Joe Biden won narrowly: Michigan, Nevada, Georgia and Arizona.",
    "This year, donors are spending millions in an attempt to unseat the execrable Marjorie Taylor Greene.",
    "What desegregation isnt\nThank you for the story on the all-Black Classes of 1970? in St. Petersburg.",
    "A majority said they were worried about attempts to interfere with their work in future elections.",
    "Instead, they would have a democratic say in their local governments practices, or so we thought.",
    "And as for former President Donald Trump returning to Twitter...\nGregory McColm, Temple Terrace",
    "For 12 years, several facets of the Tampa government preyed on Black residents without cause.",
    "We could all see what was happening, and we all gave our assent that the totals were correct.",
    "But city governments, not just Tampa, are making the establishment of such boards difficult.",
    "But I have just had my first bill from Duke Energy since our solar panels started working.",
    "They focused on who appoints members to the board instead of what Tampa residents wanted.",
    "Its been eight years since the beginning of this process, and we are still waiting.",
    "Mona Charen is policy editor of The Bulwark and host of the Beg to Differ? podcast.",
    "Some residents were ticketed multiple times, even on the same day in some cases.",
    "We are being billed $17.55, despite producing more energy that we have used.",
    "Each state has developed its own procedures, but theyre all broadly similar.",
    "Just look at the money wasted in Alexandria Ocasio-Cortezs district.)",
    "Spend your days with Hayes\nOnce again, we saw political theater.",
    "No longer would residents be targeted without accountability.",
    "The practice also targeted children as young as 11 years old.",
    "Energy creation belongs to the state, not private companies.",
    "Many people may look forward to taking Fox News to court.",
    "She was supposed to dethrone Mitch McConnell in Kentucky.",
    "He was going to defeat Lindsey Graham in South Carolina.",
    "We can only hope this sad history doesnt repeat itself.",
    "It was time for residents to advocate for themselves.",
    "Joseph Brown, Tampa\nMy solar story\nI applaud Gov.",
    "The Tampa City Council and mayors office punted.",
    "They believe it should be left up to the voters.",
    "Trump won Greenes district with 75% of the vote.",
    "Democratic donors gave her $88 million.",
    "In what other universe does this exist?",
    "Donors shoveled $130 million his way.",
    "Harrison lost by a 10-point margin.",
    "McGrath lost by nearly 20 points.",
    "Today, that stability is at risk.",
    "(Republicans do this, too.",
    "Nationalize the utilities.",
    "Remember Jaime Harrison?",
    "The clock is ticking.",
    "Remember Amy McGrath?",
    "Beto ORourke, anyone?",
    "The list goes on.",
    "It didnt happen.",
    "My advice?",
    "Sigh.",
    "This.",
    "Wont.",
    "Work.",
    "Why?"
  ]
}