{
  "id": 7129,
  "mediaId": 238,
  "date": "d2022-05-20T11:00",
  "headline": "A generation of LGBTQ advocates hopes the clock isnt ticking backward",
  "image": "",
  "link": "https://www.washingtonpost.com/lifestyle/2022/05/20/lgbtq-progress/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ellen McCarthy",
  "authorUrl": "https://www.washingtonpost.com/people/ellen-mccarthy/",
  "termIds": [
    661,
    2419,
    5301,
    5302,
    5336,
    5370,
    5449,
    257,
    3202,
    5170,
    2626
  ],
  "sentences": [
    "It gives me despair,? said Elizabeth Birch, who served as executive director of the HRC from 1995 to 2004. We really, really have won the hearts and minds of the majority of Americans  this is a despairing setback.?\nBasile, who grew up Catholic and spent 10 years married to a woman, started championing LGBTQ rights as a union organizer even before hed come out of the closet.",
    "As drafted, the leaked Supreme Court opinion says that the decision would not apply to any right except abortion, but that has provided cold comfort to legal scholars who see it as a potential precedent that could be leveraged to overturn other rights that arent specifically referenced in the constitution.",
    "In 1985, 89 percent of people reported theyd be upset if a child came out to them as gay or lesbian, according to a Los Angeles Times poll; by 2015, the year the Supreme Court affirmed the right of same-sex couples to marry, that share had plummeted to 39 percent in a Pew Research Center poll.",
    "The longtime activist for Black and elder gay rights worries about a return to the time when she and her wife used to carry powers-of-attorney papers with them everywhere  so that if one of them was hurt, the other would be allowed in the hospital.",
    "The Struggle for Gay Rights Is Over,? proclaimed the headline of a 2019 essay in the Atlantic, and while not everybody agreed with that idea, the fact that someone felt they had enough evidence to argue the point was a sign of significant gains.",
    "She sees the possible overturning of Roe as the start of an era of disintegration of individual freedom? that could jeopardize not just abortion rights but same-sex marriage, interracial marriage and other reproductive rights.",
    "Basile brought the issue to civil rights leader and future congressman John Lewis, then the director of the agency, and in a letter compared the prejudice this woman encountered to the discrimination faced by people of color.",
    "It was a march toward the middle,? Rosen says, toward encouraging the perception that there are gay people in every family, in every party and every religion.? In 2011, the militarys dont ask, dont tell? policy was repealed.",
    "However, as conservatives have regrouped after losing control of Washington, there has been a resurgence in rhetoric suggesting that talking about gay- and transgender-related topics is a threat to children.",
    "I dont know what I can do,? Basile remembers Weicker saying, but the next day the senator spoke of their meeting on the Senate floor and requested $47 million be included in the budget to distribute AZT.",
    "A July Pew Research poll found that 32 percent of Americans  including 54 percent of Republicans and those who lean Republican  thought greater acceptance of transgender people was bad for society.",
    "And in 1983, he was tapped to lead the HRC, which was originally created as a political action committee that would raise money for candidates who pledged to support a gay civil rights bill.",
    "Birch had been despairing for months about the drumbeat of attacks on LGBTQ rights from conservative politicians when the draft Supreme Court opinion that could overturn Roe v. Wade leaked.",
    "More people started coming out, and before long, Basile and his fellow advocates were again fighting for acknowledgment and fair treatment outside the context of a public health crisis.",
    "In the 1970s, he was working at a federal agency, then known as ACTION, when he heard about a transgender woman at the agency who was fired after attempting to use the womens restroom.",
    "Greg Abbott (R) issued a directive ordering child protective services agencies to investigate parents who provide gender-affirming medical treatments to their transgender children.",
    "So Basile, Rosen and one other associate secured an 11th-hour meeting with Lowell Weicker, a senator from Connecticut who was chair of the subcommittee responsible for funding.",
    "Ron DeSantis (R) signed the Parental Rights in Education bill, known to opponents as the dont say gay? bill, which attempts to limit discussion of LGBTQ topics in schools.",
    "Vic Basile remembers the time a reporter asked him if, as the first executive director of the Human Rights Campaign, he would push for same-sex marriage to be legalized.",
    "The idea that Americans would broadly accept same-sex marriage seemed inconceivable to him at the time, and demanding equality on that front seemed strategically unwise.",
    "Its frightening,? Basile said on a recent afternoon from the couch of his Chevy Chase apartment, and hes not the only longtime LGBTQ activist watching with alarm.",
    "Vivian Shapiro, former co-chair of the HRC Fund, worries that a rise in anti-LGBTQ sentiment will be harder for young people today than it was for her generation.",
    "I dont think any of them really believe this stuff,? he says of the conservative politicians pushing legislation such as the Parental Rights in Education bill.",
    "But then Ellen DeGeneres came out on national television, pride parades went mainstream, and the Supreme Court affirmed the right of same-sex couples to marry.",
    "Those who oppose such bills have found themselves being characterized as being in favor of grooming? children, a term associated with child sexual predators.",
    "Terrifying,? says Vivian Shapiro, a veteran activist and former co-chair of the Human Rights Campaign Fund, which raises money for the organization.",
    "It was the first big victory.? It felt as if the federal government was finally responding to the pleas of the gay community after years of neglect.",
    "Martin Luther King Jr. quote: The arc of the moral universe is long, but it bends toward justice.? He still believes that, even in this dark moment.",
    "After coming out, Basile began to fight to get his union of government workers to pass a resolution in support of nondiscrimination legislation.",
    "One of Basiles biggest professional victories came in 1986, after evidence emerged that the drug AZT was showing promise as an AIDS treatment.",
    "They have not known any of that.?\nTo Imani Woody, the anti-gay rhetoric already feels like an attempt to push the movement back to the 1970s.",
    "We went from the gutter to glory, culturally, from the 1950s to now  a complete transformation of how LGBTQ are viewed,? Birch says.",
    "!?  has been stunned by something else: the constant news headlines about conservative political attacks on the LGBTQ community.",
    "Theyre going to be demonized, and theyre going to be subject to humiliation.?\nIts a difficult thing to watch from retirement.",
    "In 2021, a Gallup poll found that 70 percent of Americans supported same-sex marriage  including 55 percent of Republicans.",
    "My heart is broken.?\nWhat galls Basile the most is that he sees the renewed attacks on LGBTQ rights as purely strategic.",
    "But God knows how long it will take for that to happen and how much more damage will get done in the meantime.?",
    "Some activists say fears around transgender issues have been used to stoke the flames of a renewed culture war.",
    "We know what its like to lose a job when you come out in the 1970s as a lesbian, or to lose an apartment.",
    "The silver lining of the AIDS crisis, to Basile, was that it drove thousands of people out of the closet.",
    "I wanted to deflect the whole issue, because I thought that would really set us back,? Basile says now.",
    "It wasnt long ago that overtly homophobic politics seemed to be fading, at least in the mainstream.",
    "This is still emotional for me,? Basile says, choking back tears beneath his black-frame glasses.",
    "Oh, no, were not interested,? he remembers telling the journalist, back in the mid-1980s.",
    "LGBTQ celebrities and shows like Queer Eye for the Straight Guy? gained huge followings.",
    "Hes been working on a memoir titled Bending Toward Justice,? a reference to the Rev.",
    "My activist heart exploded, once again, when I saw this draft opinion,? she says.",
    "Either way, Basile fears a rise in hate crimes and widespread discrimination.",
    "The embrace of transgender people has lagged, especially on the right.",
    "Despite that good news, there was no money to distribute the drug.",
    "Books featuring LGBTQ characters have been banned from libraries.",
    "Lately, Basile  who is 76 and, per his LinkedIn page, Retired!!",
    "The pendulum will eventually start to swing back,? Basile says.",
    "Its going to hurt people physically and emotionally,? he says.",
    "Lawmakers in a dozen other states proposed copycat laws.",
    "My grandsons understand that Nana is gay, ? Woody says.",
    "He hopes the same will be true of this moment.",
    "Soon there was a more pressing priority: AIDS.",
    "Now, he says, I give money,? to LGTBQ causes.",
    "Basiles activism days are mostly over.",
    "Basile was stunned by the progress.",
    "Lewis quickly rehired the woman.",
    "They got angry, and they acted.",
    "Two months later, Florida Gov.",
    "Its just a fact of life.",
    "Now folks cant say gay?",
    "Its like 12 steps back.",
    "In February, Texas Gov.",
    "The money was approved.",
    "We know the struggle.",
    "What the what?"
  ]
}