{
  "id": 7130,
  "mediaId": 302,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Floridas focus on math textbooks may be nothing compared to whats next",
  "image": "https://www.tampabay.com/resizer//Rq2sZGiZX1UezG53nJxIr0Tutzc=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/OZI3FMRO55FAZJAY3ZWL26NZQE.JPG",
  "link": "https://www.tampabay.com/news/education/2022/05/20/floridas-focus-on-math-textbooks-may-be-nothing-compared-to-whats-next/?itm_source=parsely-api",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1813,
    5273,
    5400,
    5436,
    592,
    3294,
    5208,
    2661
  ],
  "sentences": [
    "There cant be a perception that ideas are being ignored, he said, or that someone is trying to ram ungodly things down childrens throats.?\nKnowing there will be people who will push back against anything that would disturb the argument that the earth is 10,000 years old,? Cottle said, the process must include reviewers who want to defend the standards.?\nZiegler, the Moms for Liberty co-founder, did not disagree that the standards must be the focus.",
    "Its no longer just fussy members of the state board of education and their advisers,? said Finn, who co-wrote ?The Mad, Mad World of Textbook Adoption? in 2004. Its now opened the door to everyone with enthusiasm or a hang-up to come and be part of the review process.?\nSome of Floridas math reviewers did not meet the minimum state criteria for expert reviewers, in some instances getting approved within a day of applying for the position.",
    "With science and social studies it will be a nightmare for sure, because there actually are real differences of opinion.?\nChester E. Finn Jr., counselor to the education secretary in the Reagan administration, noted that Florida has taken textbook reviews to a different space than other states where fights over content have occurred.",
    "An onus needs to be put on publishers to understand they may not be supported or approved if there is content that is alluding to a political agenda that is not relevant to the subject.?\nPasco educator Ledbetter also worries about having textbooks lead students to a foregone conclusion, though from a different angle than Zieglers.",
    "He referred to the questions raised about the math books after the state declared several had unacceptable references to things such as critical race theory.? The Department of Education offered four examples without citations, and then began moving titles from the rejected to the approved list without explanation.",
    "I dont think its a healthy thing.?\nSusan Neuman, an assistant education secretary in the George W. Bush administration, agreed that placing a political lens on individual questions within a textbook, while not completely new, appears to be gaining momentum with Florida at the extreme.",
    "A veteran of the states 2007-08 science standards revision committee, Cottle said it seems sensible to start recruiting now for a cadre of reviewers with a dedication to accuracy in science, knowing contentious issues such as climate change could come under fire.",
    "Well drive ourselves crazy and well forget about the major point: Are these textbooks designed to help children learn??\nNeuman and Finn praised Floridas academic standards as setting a solid groundwork for learning important material.",
    "Thats an idea that echoes the states position from 2014, when conservative lawmakers pushed to give school districts more room to pick their own materials and not be bound to what some viewed as an archaic state selection process.",
    "Its really going to be interesting with Moms for Liberty and other groups looking at the new social studies books.?\nShe said she and some retired colleagues are looking for ways to get involved with the review process, too.",
    "If state officials rejected dozens of books over word problems because they touched on social issues, Ledbetter wondered, what might happen when social studies materials come up for review a few months down the road.",
    "They suggested that state leaders should continue the practice of refining those standards, putting out a test to see if the students are making progress, and holding the schools accountable for the results.",
    "The math textbook process has been mysterious,? Cottle said, comparing it unfavorably to the heated but public arguments Floridians had over evolution in the science standards more than a decade ago.",
    "The state in general should leave this to local control,? Finn said, observing that Floridas heavy-handed approach to materials differs vastly from its open, flexible policies on school choice.",
    "The upcoming adoption of social studies textbooks is going to be a big one,? said Sarasota School Board member Bridget Ziegler, co-founder of Moms for Liberty, which focuses on parental rights.",
    "We just want to make sure things are fair and balanced,? said Ledbetter, now a faculty member at Saint Leo University and secretary of the Democratic Public Education Caucus of Florida.",
    "Its like these two things belong on different planets.?\nIf Florida continues down its current path, FSU professor Cottle said, it needs to be transparent about how decisions are made.",
    "Its OK to have these conversations, but if you have them, it should be in public.?\nHe disagreed with the notion that people who arent considered expert be left out of the reviews.",
    "I would hope we all can agree we want to ensure all of the instructional material and content has merit and allows our students to learn and think critically and excel,? she said.",
    "With math, its relatively hard to politicize,? said Morgan Polikoff, a University of Southern California education associate professor who specializes in K-12 policy issues.",
    "But the vetting of textbooks should keep in mind that when controversial topics come up, theyre not always directly connected to the subject matter, Ziegler said.",
    "Theres a lot of concern out there,? Ledbetter said, relating that shes heard from parents wanting to know how items such as civil rights might be approached.",
    "Lawmakers also took steps this spring to give all Floridians more entry points for challenging the materials included in school classrooms and libraries.",
    "Currently, Florida law permits school districts to use up to half of their instructional materials budget on items that arent on a state-approved list.",
    "Ron DeSantis and his administration, which again has told publishers to keep items like critical race theory? and social justice? out of the equation.",
    "Florida State University physics professor Paul Cottle, meanwhile, set his vision further down the line to looming 2024 science textbook adoptions.",
    "She is far from alone in seeing Floridas math book dispute as the start of a new chapter in the states curriculum debate, focusing on textbooks.",
    "Every Thursday, get the latest updates on whats happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "Were going to see everything as a political event,? said Neuman, who teaches about literacy and curriculum at New York University.",
    "Diverse views should be included from all sides, she said, but also in a balanced way that does not support a specific narrative.",
    "History is filled with hard truths, she said, and those shouldnt be removed in order to promote a sanitized version.",
    "Fewer states adopt textbooks at the state level than those that leave the decisions to local schools and districts.",
    "Floridas recent battle over math textbooks got retired Pasco County history teacher Beverly Ledbetter thinking.",
    "People intent on promoting their causes are finding a way insert themselves into the textbook review, he said.",
    "Floridians with a conservative viewpoint want excellence in the school materials, she said.",
    "We want to see what exactly theyre teaching.?\n  \nSign up for the Gradebook newsletter!",
    "A handful of prohibit state-level prescription of specific books.",
    "If we go that route were going to censor everything, arent we?",
    "And theres possibly no end in sight if it continues this way.",
    "Curriculum shift is going to be a target,? Ledbetter said.",
    "She said shes already called it to the attention of Gov.",
    "Right now, were obsessed with sex and race,? Finn said.",
    "It could extend to so many other things.",
    "Click here to sign up."
  ]
}