{
  "id": 7136,
  "mediaId": 302,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Integration and desegregation are different | Letters",
  "image": "https://www.tampabay.com/resizer//ZTRuieL1HUV-0kBFDt5uDh0M6K0=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/XGMJIULQWFATVL2HW4BHCSSTCY.JPG",
  "link": "https://www.tampabay.com/opinion/2022/05/20/integration-and-desegregation-are-different-letters/",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1147,
    5189,
    5194,
    5132,
    5138
  ],
  "sentences": [
    "John Starkey, South Pasadena\nCareful what you wish for\nTaking aim at libel laws | May 19\nLegislators who may consider toying with the idea of making it easier to sue their critics for libel should consider that whats sauce for the goose is sauce for the gander.",
    "Ron DeSantis decision to veto the bill that would have raised the energy bills of people using solar power by cutting what they are paid for electricity their panels feed into the grid.",
    "Its a shame that school administrators and civil rights groups never learned the definition of desegregation, which is simply the opposite of segregation.",
    "Worse, as the article points out, many students academic performance declined as a result of being bused to hostile environments at other schools.",
    "All that was legally required was the elimination of the dual systems that existed, but historically Black schools were sacrificed.",
    "If I go into a shop and decline to buy anything, can the shopkeeper then tell me that I owe him/her $17.55 for not buying anything?",
    "The bill states that I have a $17.55 minimum bill adjustment.? So is Duke Energy charging me for not using their electricity?",
    "They mistakenly believed it was integration, and it was forced on these alumni of Gibbs High School when most didnt want it.",
    "I have just had solar panels installed at a personal cost of over $22,000, so I was very happy to see his veto.",
    "What desegregation isnt\nThank you for the story on the all-Black Classes of 1970? in St. Petersburg.",
    "And as for former President Donald Trump returning to Twitter...\nGregory McColm, Temple Terrace",
    "But I have just had my first bill from Duke Energy since our solar panels started working.",
    "We are being billed $17.55, despite producing more energy that we have used.",
    "Energy creation belongs to the state, not private companies.",
    "Many people may look forward to taking Fox News to court.",
    "We can only hope this sad history doesnt repeat itself.",
    "Joseph Brown, Tampa\nMy solar story\nI applaud Gov.",
    "In what other universe does this exist?",
    "Nationalize the utilities.",
    "My advice?",
    "Why?"
  ]
}