{
  "id": 7141,
  "mediaId": 19,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Disney Releases LGBTQ Pride-Themed Toys Marketed to Children",
  "image": "https://media.breitbart.com/media/2022/05/Pride-Themed-Disney-Plush-Toys--640x480.png",
  "link": "https://www.breitbart.com/politics/2022/05/20/disney-releases-lgbtq-pride-themed-toys-marketed-to-children/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Spencer Lindquist",
  "authorUrl": "https://www.breitbart.com/author/slindquist/",
  "termIds": [
    661
  ],
  "sentences": [
    "The back of the tag reads, in celebration of Pride and the companys Pride collection, The Walt Disney Company is giving funds as part of our ongoing commitment to organizations around the world that support LGBTQ+ communities.? The front of the tag notes that the plush toy is intended for children 0+.?\nThe release of the pride-themed plush toys is only one facet of the companys campaign to push leftwing gender theory on children.",
    "Disney is donating the profits from their pride collection to a number of different LGBTQ organizations from across the world, including LGBTQ centers in Los Angeles, San Francisco, and Orange County, GLSEN, PFLAG International, and other organizations in Australia, France, Germany, Italy, the U.K, Latin America, and Japan.",
    "This development occurs as the corporation has pledged to continue fighting Floridas HB 1557, which the company and various Democrat politicians have erroneously referred to as the dont say gay? bill and which outlaws the teaching of leftwing gender ideology to school children from kindergarten to third grade.",
    "Among the plush toys from Disney, which were made in conjunction with the squish mallow company, are various Disney characters such as Mickey Mouse, Minnie Mouse, and Stitch, all of which feature a rainbow design.",
    "As Breitbart News reported, the multinational corporation has launched their Pride Collection,? complete with a clothing line with the rainbow overlaid on the logos of Marvel, Star Wars, and Pixar.",
    "The company has faced severe pushback to their woke agenda, with parents marching on Disney and Florida Governor Ron Desantis rescinding the multinationals self-governing status in Orlando.",
    "Amid pushback from parents and Republican leaders, Disney has launched a Pride Collection? initiative, which includes an LGBTQ pride-themed line of plush toys marketed to young children.",
    "Several of the organizations have a specific focus on youth who identify as LGBTQ.",
    "Follow him on Twitter @SpencerLndqst and reach out at slindquist@breitbart.com",
    "Spencer Lindquist is a reporter for Breitbart News."
  ]
}