{
  "id": 7148,
  "mediaId": 1164,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Appeals court reinstates Florida political redistricting map",
  "image": "https://cdnph.upi.com/svc/sv/upi/3211653075945/2022/1/f3c3f89fe5c04d10e74e392efc24030c/Appeals-court-reinstates-Florida-political-redistricting-map.jpg",
  "link": "https://www.upi.com/Top_News/US/2022/05/20/florida-political-redistricting-map-reinstated-appeals-court/3211653075945/",
  "mediaOutlet": "UPI",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Doug Cunningham",
  "authorUrl": "",
  "termIds": [
    661,
    3804,
    478,
    5201,
    2661,
    5039
  ],
  "sentences": [
    "\"Based on a preliminary review, the court has determined there is a high likelihood that the temporary injunction is unlawful, because by awarding a preliminary remedy to the appellees (the plaintiffs) on their claim, the order 'frustrated the status quo, rather than preserved it,'\" the appeals court said, quoting a legal precedent.",
    "\"To avoid uncertainty and confusion in the upcoming 2022 primary and general elections, it's important to move forward expeditiously to implement the congressional map passed by the legislature and signed by the governor,\" his office said.",
    "The groups Black Voters Matter and the League of Women Voters of Florida have sued to block the political redistricting map asserting that it reduces the representation of Black voters.",
    "May 20 (UPI) -- An Appeals Court Friday stayed a lower court decision that had blocked a political redistricting plan passed by Florida's GOP dominated legislature.",
    "The 1st District Court of Appeal decision put a hold on a temporary injunction from Leon County Circuit Judge Layne Smith which had blocked the redistricting plan.",
    "When Judge Smith blocked the DeSantis political map he said it unconstitutionally disenfranchised minority voters in Florida.",
    "The appeals court did not rule on a motion by plaintiffs to expedite the case to the Florida Supreme Court.",
    "In his ruling Judge Smith said, \"The enacted map is unconstitutional under the Fair District Amendment.",
    "It diminishes African Americans' ability to elect the representative of their choice.\"",
    "The ruling means the congressional district map Gov.",
    "Ron DeSantis signed into law is reinstated.",
    "Ron DeSantis welcomed the ruling.",
    "Gov."
  ]
}