{
  "id": 7149,
  "mediaId": 19,
  "date": "d2022-05-20T00:00",
  "headline": "Washington School Board Director to Host Queer Youth Open Mic in Not Creepy Sex Shop",
  "image": "https://media.breitbart.com/media/2022/05/249919480_1415860965474930_9113751893949181104_n-640x480.png",
  "link": "https://www.breitbart.com/politics/2022/05/20/washington-school-board-director-to-host-queer-youth-open-mic-in-not-creepy-sex-shop/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Hamilton",
  "authorUrl": "https://www.breitbart.com/author/khamilton/",
  "termIds": [
    661,
    949,
    5367,
    15,
    81,
    539,
    2979,
    5226,
    5246,
    5459
  ],
  "sentences": [
    "https://t.co/0iyLzSkS92\n Harmeet K. Dhillon (@pnjaban) May 18, 2022\nOne of the authors of the American Bar Association article, Yeshiva University professor Daniel Pollack, spoke with Breitbart News on Wednesday about the event, lending his legal expertise as an expert witness in child welfare cases for lawyers in more than 30 states.",
    "On WinkWinks website, Mason describes her sex shop as identity-inclusive,? not creepy,? and open to all ages  though ID is required for any items that must be legally sold to people 18 and over.?\nWe believe that normalizing, accepting, and affirming all bodies, identities, and gender experiences is an inherently political act.",
    "Pollack emphasized that the best way for concerned parents to combat the gender identity indoctrination and sexual influence from education officials is two-fold: parents need to stay vigilant concerning the whereabouts and safety of their children, and they need to vote and participate in school board elections.",
    "An article for the American Bar Association notably lists discussing sexually explicit information under the guise of education? as one form of grooming.?\nSexual grooming is a preparatory process in which a perpetrator gradually gains a persons or organizations trust with the intent to be sexually abusive.",
    "Mason overwhelmingly won both her school board election in 2017 and in 2021  she received 76.11 percent of the vote in her district in 2021, reflecting a growth in support from 2017 when she received 67.44 percent of the vote, data from the Whatcom County Election Division shows.",
    "Pollack is also a commissioner of the Larry Nassar Commission? designed to examine the institutional responses to sexual abuse by former USA Gymnastics doctor Larry Nassar.?\nWhen you groom a minor, you are talking about for eventual sexual exploitation,? he said.",
    "pic.twitter.com/FlPd0UpQpt\n TheFamousArtistBirdyRose (@TheFamousArtBR) May 18, 2022\nDroves of commenters on Twitter expressed disapproval and called the event a form of grooming? after Libs of TikTok posted information about the open mic on Tuesday.",
    " Christina Pushaw g? gg (@ChristinaPushaw) May 18, 2022\nWhy  parents, if you want your kids schools to be run differently, step up and help!? tweeted Harmeet Dhillon, the former vice chairwoman of the California Republican Party.",
    "pic.twitter.com/TYL701t2Qt\nIve just publicly asked WHY a SEX SHOP is having a queer? event for children aged 0-18\nIts also weird that the shop owner felt the need to write not creepy? after all ages? in the SEX SHOP bio.",
    "Jenn Mason, who is on her second term as the Bellingham School District board director, is hosting the free event on June 1 for queer youth? to share poetry, music, or a story? with a five-minute time limit.",
    "@BhamSD pic.twitter.com/jIIdAV0YOu\n Libs of TikTok (@libsoftiktok) May 18, 2022\nIn an email to the Jason Rantz Show on KTTH, Mason said the event is not related to her role on the school board.",
    "A Washington school board director is set to host a queer youth open mic? for children who are 0 to 18 years old? at a sex shop she owns called WinkWink, CBS Austin reported Wednesday.",
    "In fact, a CNN report detailed earlier this year that the most common office for recall in 2021 was school board members, clocking in at 233 of the record-breaking 529 total attempts.",
    "We receive extensive sexual health training and are a knowledgeable, inclusive community resource  something severely lacking around sexuality in our culture,? Mason told KTTH.",
    "Why take kids to a boring science museum when you can take them here  kindergarten teacher probably pic.twitter.com/j5Dnh9rZFM\nThese are some images from inside her sex shop.",
    "School board races across the country have become a hot-button topic, as parents work to combat the infiltration of radical leftist ideologies in education.",
    "WinkWink offers a space for people  including queer folks  to ask questions and learn about sexuality in an accepting, safe, and shame-free environment.",
    "But it comes down todoes she have a First Amendment right?? he countered, adding that it certainly seems like shes allowed to? hold the event legally.",
    "Bellingham School District board director is advertising a queer youth open mic? for ages 0-18 taking place in her sex shop which she owns.",
    "As this is a public event at a private business, anyone uncomfortable with the location may choose to not attend,? she said.",
    "I would never own that kind of store in my whole life.?\nWhether a person thinks its appropriate or not is one thing.",
    " Christina Pushaw g? gg (@ChristinaPushaw) May 18, 2022\nIs there a word for this behavior?? Florida Gov.",
    "Why  parents, if you want your kids schools to be run differently, step up and help!",
    "She also said the event would be physically separated? from the area with sex toys.",
    "The victim is usually a child, teen, or vulnerable adult,? the article states.",
    "The school district told the station it does not endorse the event.",
    "Katherine Hamilton is a political reporter for Breitbart News.",
    "Or is it more for political reasons?? Pollack questioned.",
    "Pleasure is our revolution,? the stores about page reads.",
    "Now, is that what people are saying this woman is doing?",
    "Ron DeSantis (R) spokeswoman Christina Pushaw wrote.",
    "We are voting with our feet, and thats it,? he said.",
    "Is it appropriate in my personal book?",
    "No I dont know that kind of store.",
    "Is there a word for this behavior?",
    "You can follow her on Twitter.",
    "Consumer??\nHumor?",
    "Consumer?",
    "Rumor?",
    "Humor?",
    "Rumor?"
  ]
}