{
  "id": 7150,
  "mediaId": 19,
  "date": "d2022-05-20T00:00",
  "headline": "Florida Outpaces Nation in Job Growth",
  "image": "https://media.breitbart.com/media/2022/05/GettyImages-1239924012_fl2-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/20/florida-outpaces-nation-in-job-growth/",
  "sentiment": "0.0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    661,
    2661
  ],
  "sentences": [
    "Thats an increase of 0.7 percent, which is twice the rate of increase of the nation as a whole.?\nAccording to the governor, Floridas unemployment rate is now three percent, which is far below the national average of 3.6 percent.? What is more, the Sunshine States unemployment rate has been lower than the national average for 17 months in a row, and the state has experienced 24 consecutive months of private-sector job growth.",
    "If the workforce expands or contracts like it did nationally, you could have a decline in the unemployment, it doesnt necessarily mean you know that youre adding a robust amount of jobs.?\nHe added:\nAnd so even as we were seeing the unemployment rate drop, that was as the labor force was growing in the state of Florida and thats what you want to see.",
    "But I think what we did by setting the course to be a free state  when COVID hit, people were saying that this would take four or five years to be able to get to where we were pre-COVID in terms of our tourism numbers.",
    "When COVID hit, people were saying Florida was going to end up suffering, Florida and Hawaii, were going to be the two states that had the most significant economic damage because we were such a tourism-based state.",
    "Florida is outpacing the nation economically, seeing an increased rate of job growth of 0.7 percent  twice the national rate of increase  Florida Gov.",
    "As your workforce is expanding and your unemployment rate is dropping, thats when you know that you have a lot of opportunities.",
    "I mean honestly its just and I think the proof in the pudding on this is our market share of overseas travelers.?",
    "Thats far above our 2019 levels,? he said, attributing the states success to the state remaining open and free.",
    "Many things were beyond the states control, he continued, including the halt on international travel.",
    "In April alone, Florida added another 57,000 jobs,? the governor said during Fridays presser.",
    "Youre not gonna get shaken down to produce medical papers at the front door of a restaurant.",
    "The nation as a whole lost 363,000 people from the workforce,? the governor said.",
    "In fact, between January and March of this year, we have 36 million visitors.",
    "Now, some of whats powering this is leisure and hospitality.",
    "WATCH:\nOur labor force grew by 30,000 people.",
    "People dont want to do that,? he said.",
    "Ron DeSantis (R) announced on Friday."
  ]
}