{
  "id": 7154,
  "mediaId": 19,
  "date": "5/20/2022 12:00:00 AM",
  "headline": "Disney Giving Pride Collection Profits to Groups Fighting Floridas Anti-Grooming Law",
  "image": "https://media.breitbart.com/media/2022/05/disneypridegroup1-640x480.jpg",
  "link": "https://www.breitbart.com/entertainment/2022/05/20/disney-giving-pride-collection-profits-to-groups-fighting-floridas-anti-grooming-law/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Ng",
  "authorUrl": "https://www.breitbart.com/author/dng/",
  "termIds": [
    661,
    1241,
    5377,
    524,
    3307,
    5172,
    5203,
    2661,
    2851,
    4955
  ],
  "sentences": [
    "They deserve to see their history, their families, and themselves reflected in the classroom.?\nGLSEN  formerly known as the Gay, Lesbian & Straight Education Network  called the law exclusionary? and said LGBTQ+ youth? deserve the opportunity to see themselves reflected in the classroom.?\nThis bill \"is an exclusionary curriculum ban that deprives LGBTQ+ youth of the opportunity to see themselves reflected in the classroom and their non-LGBTQ+ peers from learning about LGBTQ+ communities,\" says GLSEN in a joint statement from @GLSEN_TampaBay & GLSEN Collier County.",
    "https://t.co/CKMVqMJuPG\n Ali Forney Center (@AliForneyCenter) May 11, 2022\nThe Los Angeles LGBT Center also condemned the Florida law, saying the legislation and others like it in other states must be struck from the books and the people who enacted it voted out of office.?\nNow is the time to act.? the centers executive director Joe Hollendoner said in a recent statement.",
    "Disney said it will donate all Pride Collection? profits through June 30 to eight U.S. groups that support LGBTQIA+ youth and families.?\nThe merchandise, which is geared for both children and adults, features rainbow-themed motifs imposed on familiar Disney brands, including Star Wars, Marvel, and Pixar.",
    "It prevents them from being able to be healthy.?\nThe Florida law bars the teaching of sexual orientation and gender ideology, including transgenderism, to children in kindergarten through third grade.",
    "We have to create a learning environment where they feel safe and healthy, or its not an effective learning environment,? Heather Wilkie, executive director of the Zebra Coalition, told ABC News.",
    "The Walt Disney Co. is giving profits from its recently launched, LGBTQ+-themed Pride Collection? apparel line to groups that are fighting Floridas Parental Rights in Education law.",
    "The Ali Forney Center, which is based in New York, has called the Florida law a danger to homeless LGBTQ+ youths?  even though the law has nothing to do with homeless individuals.",
    "AFC's Board Member, John Quinn of Kaplan and Hecker, was live on MSNBC talking about the case he's working on to block this harmful bill from becoming law in Florida.",
    "Ron DeSantis (R) has revoked DisneyWorlds special self-governing status in Orlando, potentially exposing the company to mountains of new regulations and taxes.",
    "Among the organizations receiving Disney money are the Ali Forney Center, the Los Angeles LGBT Center, GLSEN, the Trevor Project, and the Zebra Coalition.",
    "It remains unclear why the student is involved in the case since the law in question only applies to children in kindergarten through third grade.",
    "One of the suits plaintiffs is a Florida high school student who claims his gay activism is being censored by school administrators.",
    " GLSEN (@GLSEN) March 28, 2022\nThe Orlando-based Zebra Coalition has erroneously claimed that the law actually attacks students.",
    "When you have laws like this, that directly attack our kids for who they are, it prevents them from learning,? she said.",
    "The New York-based Trevor Project has repeatedly condemned the law, saying LGBTQ youth in Florida deserve better.",
    "Disney has vowed to continue fighting the Florida law despite strong bi-partisan support among Florida voters.",
    "All five groups have publicly condemned the Florida law; one of the groups is backing a lawsuit against it.",
    "The group announced that one of its board members is working on a lawsuit to block the law.",
    "The law doesnt prevent those kids from learning about any other subjects.",
    "The Don't Say Gay Bill is a danger to homeless LGBTQ+ youths.",
    "In response to Disneys attack, Florida Gov.",
    "Follow David Ng on Twitter @HeyItsDavidNg.",
    "Contact me at dng@breitbart.com",
    "Have a tip?"
  ]
}