{
  "id": 7190,
  "mediaId": 21,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "David Perdue's closing argument to Georgians ahead of Tuesday's GOP primary: A vote for Brian Kemp is a vote for Stacey Abrams",
  "image": "https://i.insider.com/628aa6c7b0a8be00185ff9de?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/david-perdue-brian-kemp-stacey-abrams-maga-georgia-2022-5",
  "sentiment": "0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Warren Rojas",
  "authorUrl": "https://www.businessinsider.com/author/warren-rojas",
  "termIds": [
    661,
    1147,
    1951,
    2087,
    2095,
    3082,
    4325,
    5507,
    428,
    2672
  ],
  "sentences": [
    "Bikers for Trump founder Chris Cox aired his grievances against RINOs Friday night, proclaiming that by defying Trump's wishes, Kemp, former Vice President Mike Pence, and former President George Bush have proven they are more aligned with Biden than MAGA.",
    "Whether he's trying to convince himself or others about the relevance of Trump's endorsement power, the last-minute pitch has resonated with locals who view Kemp's break with the former president over the 2020 election as disqualifying.",
    "Trump has orchestrated much of that erosion, spending the last few years lashing out against Kemp, Georgia Secretary of State Brad Raffensperger, and Republican officials in other swing states where Joe Biden beat him in 2020.",
    "Senator and Republican candidate for Governor of Georgia David Perdue waves to supporters of former U.S. President Donald Trump after speaking at a rally at the Banks County Dragway on March 26, 2022 in Commerce, Georgia.",
    "So I'm very concerned that he's gonna have a hard time pulling us together again in November,\" Perdue, who recent polls show is trailing Kemp by 30 points, told supporters during a campaign event in Augusta, Georgia.",
    "It took everyone getting behind Brian Kemp  even people that did not support him in the runoff,\" she said of the concentrated effort it took to shore up the 50,000 votes that kept the state from flipping blue.",
    "\"We've already got someone in the 'Let's Go Brandon' administration who's doing the opposite of Donald Trump,\" Cox told attendees during a rally for Perdue and freshman Rep. Marjorie Taylor Greene of Georgia.",
    "\"Georgia deserves a governor more like Ron DeSantis,\" Cox said, praising the combative Florida Republican and potential 2024 presidential contender for relentlessly sticking it to the establishment.",
    "Rose told Insider she's supporting Kandiss Taylor  the woman running on the \"Jesus, Guns, and Babies\" platform  for governor because every other GOP candidate has left her behind.",
    "Brian Kemp is futile because Kemp won't be able to unite the MAGA and establishment wings of the GOP in time to beat presumptive Democratic nominee Stacey Abrams this fall.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Trump's non-stop attacks on RINOs, which stands for \"Republican in name only,\" still carry weight with diehard fans who miss the chaos he created while in Washington.",
    "ATLANTA, Georgia  Republican gubernatorial hopeful David Perdue is telling Georgia voters still on the fence ahead of Tuesday's primary that backing incumbent Gov.",
    "She started out saying that she wasn't sure Kemp could beat Abrams in the anticipated rematch this November, but the conversation then took a darker turn.",
    "\"It's just the same old thing, over and over again, whether it's Democrats or Republicans,\" Rose said of her disillusionment with mainstream politics.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Ellis said of giving Kemp a shot at reelection, given that he only \"represents the Stacey Abrams areas\" anyway.",
    "And the only reason he narrowly defeated Abrams last time was because the MAGA world lent its support.",
    "Perdue supporter Sharon Fry, 65, told Insider she worked on Kemp's first gubernatorial bid in 2018.",
    "Gordon Country resident Christie Ellis, 50, talked Insider through her reservations about Kemp.",
    "Amy Rose, 44, who said she voted for Kemp in 2018, expressed a similar sense of alienation.",
    "Perdue's camp says Trump's support was a big reason Kemp became governor in 2018.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Splitting the party now, Perdue argues, gives Democrats an edge this fall.",
    "Megan Varner/Getty Images\nTrump-backed Perdue is trailing Georgia Gov.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Cox added that being part of the status quo means Kemp's got to go.",
    "\"Brian Kemp does not have all the support this time.\"",
    "\"I don't think it would matter if he did beat her.",
    "Because, I mean, it's a wash,\" Ellis predicted.",
    "Stay up to date with what you want to know.",
    "Brian Kemp ahead of Tuesday's GOP primary.",
    "Sign up for notifications from Insider!",
    "\"It took Donald Trump's endorsement.",
    "\"They're all in the same boat.\"",
    "Loading Something is loading.",
    "\"He has divided the party.",
    "\"What good does it do?",
    "What's it matter?\"",
    "Former U.S."
  ]
}