{
  "id": 7271,
  "mediaId": 223,
  "date": "d2022-05-23T00:01",
  "headline": "Will the 'Great Replacement' Smear Work?",
  "image": "https://media.townhall.com/townhall/reu/ha/2020/237/298487fc-1ece-42c8-8539-4cd37d1ac428.jpg",
  "link": "https://townhall.com/columnists/scottmorefield/2022/05/23/will-the-great-replacement-smear-work-n2607621",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Scott Morefield",
  "authorUrl": "https://townhall.com/columnists/scottmorefield/",
  "termIds": [
    661,
    683,
    1667,
    2213,
    2272,
    2478,
    4374,
    5526,
    146,
    525,
    2661
  ],
  "sentences": [
    "They believe that if they replace its cultural subsoil, if they bring in millions of people from new ethnic groups which are not rooted in Christian culture, then they will transform Europe according to their conception.?\nAnd even after the Buffalo shooting in America, the Hungarian leader doubled down, calling unlimited immigration suicidal policy.? Said Orban: One such suicide attempt that I see is the great European population replacement program, which seeks to replace the missing European Christian children with migrants, with adults arriving from other civilizations.?\nOrban has got the left all hot and bothered by his rhetoric, worldview, and nationalistic approach to governance, but is he wrong?",
    "In perhaps a typically French penchant for the existential, Carrre granted that while the worlds population grows, it makes, I agree with you a thousand times, life necessarily less sweet, the neighbors more numerous, noisier, more harmful.?\nBut, he concluded, what can we do if not push ourselves to make room??\nEven while acknowledging the societal ills unlimited Third World immigration nearly always brings, Carrere resigns himself to the inevitability.",
    "Debating the 1965 bill, Democratic Massachusetts Sen. Ted Kennedy promised it would not flood our cities with immigrants,? nor would it upset the ethnic mix of our society,? relax the standards of admission,? or cause American workers to lose their jobs.? But as anyone knows and plenty predicted even then, all of those things happened, and more.",
    "Ever true to form, the political left sees this as an opportunity to tarnish the right with the white nationalist? label, seizing on aspects of the conspiracy theory that on the surface, if twisted enough, might seem remotely like things theyve heard Fox News host Tucker Carlson and other conservative media and politicians say.",
    "The wide brush they paint with is as nonsensical as the left smearing anyone who criticizes leftist billionaire George Soros as antisemitic.? Pointing out evil from someone of Jewish descent is NOT antisemitism, obviously, but claiming Jews as a group are somehow responsible? for some societal ill most certainly is.",
    "Conceivably, if you were to actually replace? the entire population of a country with one dominant culture, religious tradition, and set of laws/freedoms with another population that has an entirely opposite set of all those things, the former country would become unrecognizable.",
    "Source: AP Photo/Evan Vucci\nTrending\nThe actions and written motivations of an evil, crazed mass shooter in Buffalo, New York earlier this month has forced the purportedly white nationalist phrase Great Replacement Theory? to the forefront of the public consciousness.",
    "Read The Washington Posts recent biographic as well as this write-up detailing Camus legal issues, which seem to stem more from the lack of legally-protected free speech in France than anything he actually said or wrote thats truly hateful or overly off-the-wall.",
    "This sense of replacement,? of foreign populations coming in and replacing the offspring your people arent having is, after all, a very real thing, and Orban has developed policies that encourage Hungarians to have their own children, not import everyone elses.",
    "The hard truth is, starting with the 1965 Immigration and Nationality Act that eliminated national origin quotas, Democrats have actively been prioritizing immigration from the Third World in a blatant attempt to create a permanent Democratic majority.",
    "Instead of having a reasonable immigration policy that wouldnt spark conspiratorial talk of replacement? in the first place, the powers-that-be choose to blame people who dare to point out whats going on for the actions of evil, unstable people.",
    "In other words: sure, nobodys being replaced.? However - and this is a BIG however? - adding to a population does have its political and societal issues, and pointing out those issues is whats gotten Carlson and others in so much hot water.",
    "From what Ive seen, even IF he overstates the actual problem, Camus mostly just doesnt want to see Europe overrun with Muslim immigrants - and in my opinion and that of many on the right, thats an entirely reasonable position.",
    "This passage is telling in so many ways:\nLongtime friend Emmanuel Carrre, considered by many to be one of the greatest living French writers and filmmakers, publicly condemned Camuss views in an open letter in 2012.",
    "Instead of the vast majority of immigrants coming from places whose culture and values generally aligned with the existing U.S. population, over 90% now come from Latin America, Asia, Africa, and the Middle East.",
    "Of course, concern about or even daring to merely state that fact is automatically labeled racist? by the powers-that-be in what has generally been a pretty successful effort to shut down such discussion.",
    "Jerry Brown and then-Senator Joe Biden did in 1975 when former President Gerald Ford brought in hundreds of thousands of commie-hating Vietnamese immigrants (spoiler alert: they didnt want them).",
    "Its a concept that Hungarian Prime Minister Viktor Orban understands clearly, saying in a 2018 radio interview: I think there are many people who would like to see the end of Christian Europe.",
    "So, while people themselves arent technically being replaced,? their laws and their dominant cultures certainly can be if people who believe otherwise suddenly become the political majority.",
    "View Cartoon\nInterestingly, the person who coined the term great replacement,? a gay ex-socialist French author named Renaud Camus, doesnt seem to be antisemitic or even particularly crazy.",
    "(For an excellent, in-depth analysis of the country Lyndon Johnson, Ted Kennedy & crew helped create, read this excellent piece by former Breitbart editor and Trump staffer Julia Hahn.)",
    "For many if not most conservatives, its about bringing in people on an as-needed basis that generally align with the culture and values of the existing population.",
    "To a *real* white nationalist, the Great Replacement Theory? apparently involves a Jewish conspiracy to somehow replace? white people with minorities.",
    "Do the opposite in the West, and laws and customs would also change, and freedoms once enjoyed by the former population would quickly disappear.",
    "WaPo described how Camus, the person who initially coined the phrase, has lost friends and even his publisher amidst the controversy.",
    "Its completely dishonest, of course, but when has the left ever let actual facts get in the way of the opportunity for a good smear?",
    "For those of us who believe in logic, common sense, and a better life for our own neighbors and countrymen, its not going to work.",
    "Ron DeSantis had the ability to unilaterally allow massive numbers of nonwhite but commie-hating Cubans to immigrate to Florida.",
    "The opinions expressed by columnists are their own and do not necessarily represent the views of Townhall.com.",
    "Further, the establishment media correctly points out the mathematical absurdity of the replacement? concept.",
    "Immigrants should not have to act like well-behaved guests? who are grateful for our leniency,? Carrre wrote.",
    "No, simply adding people to a country does not equate to replacing? existing members of that population.",
    "Replace the inhabitants of a Sharia-law Muslim country with Christians and things would change quickly.",
    "Before going to the R smear, ask yourself how Democrats would react if Republican Florida Gov.",
    "Nevermind that manipulating favorable demographics has been a Democratic theme for decades.",
    "Simply put, theres a reason they want to make this a taboo discussion issue for the right.",
    "So its not about race, though the left loves to pretend otherwise when smearing the right.",
    "Call me cynical, but my guess is theyd act just like former Democratic California Gov.",
    "But does the phrase have a meaning beyond that simple, easily-knocked-down strawman?",
    "If a nonwhite place like Japan were doing it, would they generate the same uproar?",
    "Check out my recent Twitter thread on the subject for plenty of examples.",
    "What, are white people going to be sent off to Canada or something?",
    "We know the answer, because Japan is doing exactly that!",
    "So well go ahead and repudiate that from the start.",
    "Thats what they DONT want you to discuss.",
    "Is anything morally wrong with this?",
    "That would be horrible!",
    "But is it really?",
    "Dont believe me?",
    "But why must we?",
    "Duh, right?"
  ]
}