{
  "id": 7274,
  "mediaId": 65,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Florida suspends abortion clinic after hospitalizations",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/41ca6df1-4a84-48b8-8abf-f84c5bca3311/c639361d-2063-4aa4-8d7c-94e2da132103/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/us/florida-suspends-abortion-clinic-hospitalizations",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    5496,
    2537,
    2661,
    2672,
    2766,
    5060,
    5095
  ],
  "sentences": [
    "In cases cited by the agency, the clinic failed to monitor the patients at all times, didn't provide medical records when patients were transferred for greater care and didn't contact the patients within 24 hours after they left the clinic to assess their recovery, said the order which was issued on Friday.",
    "BABY FORMULA SHORTAGE: bIDEN CELEBRATES AS 78,000 POUNDS OF BABY FORMULA FLOWN TO US\nIt said the problems were operational deficiencies \"endangering the health, safety and welfare\" of the clinic's patients, and the clinic failed to submit timely reports about the incidents to the state agency.",
    "An abortion clinic that serves women from all over the U.S. South had its license suspended this weekend under an emergency order from Florida health officials after two women who had undergone procedures at the clinic were hospitalized this year.",
    "Ron DeSantis signed into law last month legislation that would ban most abortions after 15 weeks, Florida's abortion law is still likely to be less restrictive than those of neighboring states should the U.S. Supreme Court overturn Roe v. Wade.",
    "In one case, clinic workers urged the husband of a patient to take her to a hospital in Mobile, Alabama, rather than a closer hospital in Pensacola that had a transfer agreement with the clinic, delaying her treatment.",
    "A woman who says she works for the clinic's scheduling service answered its phone on Sunday but said nobody was there who could talk about the emergency order.",
    "Because of its historically less restrictive laws, Florida has long been considered a \"safe haven\" for women from neighboring states wanting to get abortions.",
    "The state Agency for Health Care Administration ordered the suspension of the license for American Family Planning of Pensacola, effective starting Saturday.",
    "At the Alabama hospital, the woman needed to be resuscitated and required a transfusion to replace blood loss, according to the emergency order.",
    "NYC PARAMEDIC SHOT INSIDE AMBULANCE AFTER MAN PULLS GUN ON WAY TO HOSPITAL: POLICE\nThe clinic is entitled to a hearing about the decision.",
    "In another case from March, a patient was taken to the emergency room of a Pensacola hospital with bleeding and low blood pressure.",
    "\"Women receiving abortions must receive the level of care and services mandated by law,\" the emergency order said.",
    "On its website, the clinic says it serves women from Florida, Alabama, Mississippi, Louisiana and Georgia.",
    "Last year, a third patient required a uterine perforation repair, according to the emergency order.",
    "She needed emergency surgery and a surgeon performed a hysterectomy.",
    "Even though Florida Gov."
  ]
}