{
  "id": 7279,
  "mediaId": 21,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Sen. Marco Rubio avoids saying which national abortion ban Republicans should run on in the midterm elections, predicting states would decide",
  "image": "https://i.insider.com/62897fbeb9dbb40018cb2f4f?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/marco-rubio-wont-say-which-abortion-ban-he-supports-2022-5",
  "sentiment": "0",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kimberly Leonard",
  "authorUrl": "https://www.businessinsider.com/author/kimberly-leonard",
  "termIds": [
    661,
    971,
    1341,
    2087,
    5353,
    146,
    428,
    482,
    571,
    2661
  ],
  "sentences": [
    "Ever since the Supreme Court leak, Democratic campaigns have been pressuring Republicans to say whether they support banning abortion even in cases of rape and incest, and Republican campaigns have been pressuring Democrats to say whether they believe abortion should be allowed even in the final stages of pregnancy.",
    "\"I'm pro-life and I believe that human life deserves protection and I'm in favor of laws that protect it,\" he said Saturday, \"understanding that in a political process those laws would have to accommodate to reach a majority vote in different chambers depending who is voting on it.\"",
    "MIAMI  Republican Sen. Marco Rubio of Florida wouldn't commit to a specific abortion ban on Saturday when asked what types restrictions Republicans should promise to deliver if they gain control of Congress in November.",
    "Rubio is up for reelection in November and his answer suggests the GOP hasn't decided which approach to run on yet as they seek to expand their razor-thin minority in the Senate during the November midterm elections.",
    "Senate Minority Leader McConnell initially said a national ban was \"possible\" but then said he wouldn't do it by abolishing the filibuster  meaning lowering the voting threshold to pass major legislation to 51 votes.",
    "When Republicans have been in charge of the Senate in recent cycles, they have brought bills to the floor to restrict abortions later in a pregnancy, including a bill that would have banned abortions after 20 weeks.",
    "Rubio's comments came during a press appearance at Trump National Doral, where he had just received the endorsement of the Florida Police Benevolent Association but took questions from reporters on other topics.",
    "When asked what specific bill Republicans should support, Rubio said \"that's not the way it's going to work\" and stressed that lawmakers should wait until an official Supreme Court decision is handed down.",
    "The Supreme Court previously defined post-viability exemptions in its 1973 Doe v. Bolton decision, allowing for later abortions not just to protect physical health, but emotional and psychological health.",
    "A leaked Supreme Court draft from Politico showing that the Supreme Court is poised to overturn its Roe v. Wade decision on abortion has pushed the issue to surface during a high-stakes election year.",
    "Though President Joe Biden would veto any legislation that restricts abortion, Republicans could unify behind a ban that would be poised for passage if a Republican is elected president in 2024.",
    "Republican Sen. Marco Rubio of Florida has called himself \"pro-life\" but hasn't said what abortion restrictions Republicans should back if they gain a majority in November.",
    "Email address\n By clicking Sign up, you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Rep. Val Demings of Florida, the Democratic frontrunner likely to face Rubio November, has called Rubio an \"extremist\" on abortion and voted for the abortion rights bill.",
    "But it's not clear whether they'll seek an all-out ban or a more incremental approach if Roe is overturned  which would give Congress more power to regulate the issue.",
    "Florida's law would allow later abortions if a pregnancy is life-threatening or would cause serious injury, or if the fetus has a fatal abnormality.",
    "Meanwhile, Democrats in Congress have unified behind the Women's Health Protection Act, a bill that would enshrine Roe and undo state restrictions.",
    "Senate Majority Leader Chuck Schumer forced a vote on the bill May 5 but Republicans and Democratic Sen. Joe Manchin of West Virginia blocked it.",
    "In Florida, a law will take effect July 1 to ban abortions after 15 weeks, but this week Oklahoma lawmakers passed a total ban on abortion.",
    "Biden has urged voters to go to the polls on the issue to elect \"more pro-choice Senators and a pro-choice majority in the House.\"",
    "Some, such as GOP Sen. Joni Ernst of Iowa, are crafting legislation for a six-week ban, according to the Washington Post.",
    "The Women's Health Protection Act that failed would provide undefined \"health\" exemptions on abortions after viability.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Polling shows both positions are unpopular, and less than 1% of abortions happen in each of these circumstances.",
    "Ron DeSantis, a Republican, has dodged questions over whether the state should restrict abortion even further.",
    "John Raoux/AP Images\nRubio wouldn't specify what restrictions on abortion a GOP-controlled Senate should back.",
    "Instead he stressed that he was \"pro-life\" and predicted \"each individual state would have different laws.\"",
    "The senator indicated that his personal views on abortion might differ from what was politically feasible.",
    "Republicans have long said Roe should be overturned and have supported some type of abortion ban.",
    "Even if Republicans gain a majority in the Senate, they'd need 60 votes to pass an abortion ban.",
    "Rubio, who is Catholic, has previously said he believes \"life begins at conception.\"",
    "He called himself \"pro-life\" and has voted to restrict abortion late in a pregnancy.",
    "The decision also permitted doctors to factor in familial circumstances and age.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "The bill failed because they didn't have the 60 votes needed for passage.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "It does not have exemptions for rape, incest, or human trafficking.",
    "On Saturday, Rubio called the legislation \"radical and outrageous.\"",
    "Republicans haven't unified behind an approach on abortion.",
    "Others have indicated the states should take the lead.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "Florida Gov."
  ]
}