{
  "id": 7281,
  "mediaId": 19,
  "date": "5/22/2022 12:00:00 AM",
  "headline": "Report: Democrats Gerrymandering Efforts Have Proven Ineffective",
  "image": "https://media.breitbart.com/media/2022/05/April28-22-Nancy-Pelosi-Chuck-Schumer-close-talk-getty-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/05/22/democrats-gerrymandering-efforts-proven-ineffective/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Bois",
  "authorUrl": "https://www.breitbart.com/author/pbois/",
  "termIds": [
    661,
    871,
    1226,
    2031,
    2231,
    5522,
    146,
    428,
    2782,
    2826
  ],
  "sentences": [
    "Per Axios:\nDemocrats original plans in New York could have knocked out half of the eight GOP-held seats and boosted the partys 19-member delegation to 22\nInstead, Rep. Sean Patrick Maloney (D-N.Y), chair of the House Democrats campaign arm, will run in a district that includes his home  but is mostly represented by Black freshman Rep. Mondaire Jones (D-N.Y.).",
    "In the solidly blue state of New York alone, the GOP could win up to 11 U.S. House seats due to some recent court rulings, which resulted in Democrat Party leaders, such as House Judiciary Chair Jerry Nadler (D-NY) and House Oversight Chair Carolyn Maloney (D-NY), being forced into facing off against each other in primary challenges.",
    "This year, the Democrats held out some hope of putting up a solid fight in November with gerrymandering wins in New York, Maryland, Illinois, Alabama, Ohio, and Pennsylvania, but as election expert Dave Wasserman notes, recent court rulings have rendered that optimism moot.",
    "https://t.co/4Klzw2RtOm pic.twitter.com/ueMbYj524v\nGerrymandering efforts also failed in the state of Maryland where a judge recently struck down a redistricting map that could have potentially ousted the states lone House Republican: Rep. Andy Harris.",
    "To avoid uncertainty and confusion in the upcoming 2022 primary and general elections, its important to move forward expeditiously to implement the congressional map passed by the legislature and signed by the governor,? Gov.",
    "This past Friday in Florida, an appeals court stayed a lower court decision that blocked a political redistricting map drafted by state Republicans, potentially granting the GOP an extra four U.S. House seats this November.",
    "Gerrymandering efforts by the Democratic Party have thus far proven ineffective in potentially securing electoral wins, signaling a total collapse come time for the November midterm elections, according to a new report.",
    "Democrats also might have seen gerrymandering opportunities in Virginia and Colorado, but those states established independent redistricting commissions that focused more on competitiveness.?",
    "In a twist, Jones will avoid that primary by running in a different redrawn district  facing off against former New York City Mayor Bill de Blasio, among others.",
    "Tony Evers managed to veto Republicans maps in Wisconsin, but the court-approved maps submitted by Evers still favor the GOP,? noted Axios.",
    "But because five of those seats are single digit Biden seats, anything from 16D-10R to 21D-5R realistic depending on the year.",
    "The legal setbacks and losses Democrats have suffered in the last three months have been staggering,? Wasserman said.",
    "The story is no better for Democrats in states like Wisconsin, Colorado, and Virginia.",
    "Maloneys decision has angered many in the caucus.",
    "So, New York ends up with a 21-5 Biden map.",
    "Ron DeSantis office said of the ruling.",
    "Not the worst outcome for Dems.",
    "Democratic Gov."
  ]
}