{
  "id": 7324,
  "mediaId": 195,
  "date": "5/24/2022 12:00:00 AM",
  "headline": "Florida student suing over Don't Say Gay' uses curly hair as commencement speech code",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/dontsaygayflorida_ap_030822.jpg?strip=1&w=640",
  "link": "https://thehill.com/blogs/blog-briefing-room/3498890-florida-student-suing-over-dont-say-gay-uses-curly-hair-as-commencement-speech-code/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Polus",
  "authorUrl": "https://thehill.com/author/sarah-polus/",
  "termIds": [
    661,
    2087,
    539,
    3487,
    2661,
    5115
  ],
  "sentences": [
    "Any student whose parent or guardian does not provide prior written consent shall be excused from that portion of the course where such instruction is provided and no penalties as to credit or graduation shall result therefrom, reads a portion of the bill introduced by a New Jersey state senator.",
    "A few days ago, my principal called me into his office and informed me that if my graduation speech referenced my activism or role as a plaintiff in the lawsuit, school administration had a signal to cut off my microphone, end my speech, and halt the ceremony, Moricz previously wrote on Twitter.",
    "Moricz, the senior class president at Pine View School in Sarasota County, repeatedly referred to his distinctive locks after earlier saying he'd been told his speech would be censored if he spoke openly about the Parental Rights in Education law.",
    "An openly gay Florida high schooler who is among those suing over the state's Don't Say Gay law used his graduation speech to speak about his experience  while using a winking code to avoid referring to his orientation directly.",
    "I spent mornings and nights embarrassed of them, trying desperately to straighten this part of who I am, but the daily damage of trying to fix myself became too much to endure.",
    "Ron DeSantis (R) in late March signed into law the controversial Don't Say Gay bill, which limits discussion of sexuality and sexual orientation in classrooms.",
    "Those who we give our power to are the reason I have to stand here and talk about my hair during my graduation speech, he added in a dig at Florida lawmakers.",
    "Moricz said he's been planning his graduation speech since his first year of high school but didn't anticipate having to address his activism during it.",
    "It needs to be about this for the thousands of curly haired kids who are going to be forced to speak like this for their entire lives as students.",
    "There are going to be so many kids with curly hair who need a community like Pine View, and they won't have one, Moricz said in his speech.",
    "This characteristic has probably become the first thing you think of when you think of me as a human being, Zander Moricz said Sunday.",
    "I am the first openly-gay Class President in my school's history  this censorship seems to show that they want me to be the last.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Critics, including the Biden administration, say the bills will harm the mental health of young LGBTQ Americans.",
    "During Pine View's graduation ceremony, Moricz shared how the law could impact kids with curly hair.",
    "Several other states, including New Jersey and Louisiana, have introduced similar legislation.",
    "Moricz urged his fellow classmates to claim their power and give it to those who protect us.",
    "Instead, they'll try to fix themselves so that they can exist in Florida's humid climate.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "I used to hate my curls, Moricz said in his speech.",
    "I must discuss a very public part of my identity.",
    "Do you think that I wanted it to be about this?",
    "As you know, I have curly hair.",
    "he asked the audience.",
    "Florida Gov."
  ]
}