{
  "id": 8404,
  "mediaId": 376,
  "date": "5/26/2022 12:00:00 AM",
  "headline": "At the Races: Divisions on display",
  "image": "https://i0.wp.com/cdn.media.rollcall.com/author/2019/10/AT-THE-RACES-LOGO-20202400x1300.jpg?fit=1240,698",
  "link": "https://www.rollcall.com/2022/05/26/at-the-races-divisions-on-display/",
  "sentiment": "0.0",
  "mediaOutlet": "Roll Call",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Ackley\nMary Ellen McIntire\nStephanie Akin",
  "authorUrl": "https://www.rollcall.com/author/kate-ackley/",
  "termIds": [
    661,
    815,
    1896,
    3085,
    3094,
    3103
  ],
  "sentences": [
    "Ethics roundup: Newly released reports show the Office of Congressional Ethics has substantial reason to believe Rep. Ronny Jackson of Texas used campaign funds to pay for a private club membership and Rep. Alex X. Mooney of West Virginia took a family vacation in Aruba mostly funded by a direct mail company, and had his office staff plan part of the trip, CQ Roll Calls Chris Marquette reports.",
    "The count: $1.1 million\nThats how much Independence USA PAC  a super PAC that through April 30 had only $78,000 in cash but previously got more than $672,000 in four checks from billionaire gun control advocate and former New York City Mayor Michael Bloomberg  disclosed May 18 it was spending for a TV ad supporting Georgia Democratic Rep. Lucy McBath.",
    "New York fundraiser: House GOP Conference Chair Elise Stefanik will host a fundraiser on June 6 with former President Donald Trump at the Trump National Golf Club in Briarcliff Manor, N.Y. Donors can give $1,000 to attend a private reception with Stefanik, or up to $25,000 to attend a roundtable and get a photo with Trump, according to an invitation.",
    "Words, words words: Michigan GOP Rep. Fred Upton, one of 10 House Republicans who voted to impeach Trump after the Jan. 6 assault on the Capitol, said in a profile published by the centrist GOP Ripon Society newsletter that the GOP must forget allegiance to Trump if it hopes to reclaim its congressional majority.",
    "That was what I sunk my teeth into, was that research side of things, what I lean back on, and really what drives a lot of my approach and critical thinking when it comes to politics, campaigns, the comms side: the importance of having as much information, and the best information, as possible.",
    "Candidate confessions\nYou really shouldnt listen to people who ran for national office and lost, Utah Sen. Mitt Romney, the 2012 GOP presidential nominee, told a group of reporters gaggling with Virginia Sen. Tim Kaine, who was on the 2016 ticket as the Democratic nominee for vice president.",
    "Both lawmakers have been renominated already this year  Jackson ran uncontested in the March primary, and Mooney beat fellow Republican David B. McKinley earlier this month  are now under investigation by the House Ethics Committee, which, unlike the OCE, has the power to discipline members.",
    "Not giving up: Senate Majority PAC, a super PAC aligned with Majority Leader Charles E. Schumer, announced a seven-figure ad buy supporting North Carolina candidate Cheri Beasley, showing that the group thinks she can be competitive against GOP Rep. Ted Budd in the race for an open seat.",
    "Shop talk: Stephen Lawson\nLawson, CEO of Battleground Strategies, served as deputy campaign manager for former GOP Sen. Kelly Loeffler of Georgia in 2020 and currently is spokesman for a SuperPAC supporting this years nominee, Herschel Walker, who faces Democratic Sen. Raphael Warnock.",
    "and Pennsylvania: Pennsylvania acting Secretary of State Leigh Chapman said she would order a recount in the states Republican Senate primary, which is required under state law because Mehmet Oz and David McCormick are separated by less than one-half of 1 percentage point.",
    "Photo finish\n Rep. Lucy McBath, who beat fellow Democratic Rep. Carolyn Bourdeaux in Tuesday's primary in Georgia's 7th District, dances last October during the Congressional Women's Softball game, which pits women in Congress and the press corps against each other.",
    "Summer spending: One Nation, an organization with ties to Senate Minority Leader Mitch McConnell, announced a $43.5 million ad buy for this summer across Arizona, Georgia, New Hampshire, Nevada and Wisconsin focused in part on record-high inflation.",
    "High roller: Cryptocurrency billionaire Sam Bankman-Frieds millions in spending on Democratic primaries has already drawn attention this cycle, but thats nothing compared to the money Bankman-Fried, a Democrat, says he is planning to spend in 2024.",
    "What were reading\nStu says: Trump should stick to House and Senate races, because getting involved in endorsements in governors' races increases the chances the former president will lose, and look weaker, Stuart Rothenberg writes.",
    "Political money: Senate Democrats campaign arm hauled in $8.2 million last month, slightly more than its GOP counterpart, as both committees gear up for potential record-shattering expenditures in this years midterm elections.",
    "The gun control debate divides Democrats and Republicans almost entirely along their party lines, now that most pro-gun-rights Democrats have lost or left Congress and ditto for moderate Northeastern Republicans.",
    "The massacre of little schoolchildren and their teachers this week in Uvalde, Texas, reminds us not only of the fragility of life, but also the uncertainty about what issues will dominate the midterm campaigns.",
    "But this weeks primaries continued to put on display divisions within the parties, including a runoff featuring one of the last anti-abortion and pro-gun-rights Democrats on the Hill: Texas Rep. Henry Cuellar.",
    "Guest speakers include Reps. Andy Biggs of Arizona, Lauren Boebert of Colorado, Kat Cammack of Florida and Matt Gaetz of Florida, with a special video address from Minority Leader Kevin McCarthy of California.",
    "Bad math: A Census Bureau report found significant miscounts in 14 states on the 2020 census, after those numbers were used to divvy up congressional districts and Electoral College votes for the next decade.",
    "Casten v. Newman: Illinois Rep. Sean Casten holds the edge over Rep. Marie Newman in the 6th District Democratic primary, according to a Garin-Hart-Yang Research Group poll featured in the Chicago Sun-Times.",
    "Most unforgettable campaign moment: In the weeks leading up to election night during DeSantis 2018 campaign, he said, the polls showed DeSantis trailing Democrat Andrew Gillum by 5 to 8 points, he said.",
    "Democratic senators have begun to see whether they might bring along 10 Republicans to pass legislation to expand background checks or to remove guns from people at risk of harming themselves or others.",
    "Democrats made voting rights an early priority, saying they needed to supersede GOP state laws, such as in Georgia, that Democrats argued would lead to voter suppression and an unraveling of democracy.",
    "McBath wins: In the first Democratic member-on-member primary of the cycle, Georgia Rep. Lucy McBath easily defeated her more moderate colleague Carolyn Bourdeaux in the suburban Atlanta 7th District.",
    "The new super PAC is billed as an unprecedented multi-million-dollar effort to engage the fastest growing ethnic or racial group in America, which turned out in record numbers in 2020, NBC reports.",
    "Democrats running for Senate have renewed their calls for an end to the chambers filibuster rules, requiring 60 votes to approve nearly all legislation, as a way forward on gun control measures.",
    "One example, he said, was the decision to run an ad declaring that Loeffler was more conservative than Attila the Hun, which was broadly panned and seen as a turning point in the campaign.",
    "... and Texas: In addition to the Cuellar-Cisneros race in the 28th District, counting is also still underway in the Democratic primary runoff for the competitive 15th District in Texas.",
    "John Fetterman, the Democratic nominee in Pennsylvanias Senate race, returned home as he recovered from a stroke that has sidelined him from the campaign trail without a set return date.",
    "The issue of gun violence will likely be among the factors that voters, and donors, consider over the coming months, along with abortion and voting rights, high inflation and COVID-19.",
    "GOP Rep. Bob Good also defeated a challenger in the 5th District, and Karina Lipsman won the GOP nomination in the 8th District and will challenge Democratic Rep. Donald S. Beyer Jr.",
    "Races in nine House districts now look better for Republicans than they did a few months ago, while only one House race has seen a shift toward Democrats, Nathan L. Gonzales writes.",
    "Instead, he said, campaigns should focus on driving their core message, highlighting their positives and doing the blocking and tackling work of running a strong campaign.",
    "Biggest campaign regret: Loefflers 2020 special election campaign was initially designed to broaden the Georgia GOPs appeal to moderate voters, especially suburban women.",
    "As of Thursday morning, progressive activist Michelle Vallejo had a 20-vote lead over attorney and Army veteran Ruben Ramirez, the Texas Tribunes Patrick Svitek reported.",
    "We have a rundown of all the key results here, and some takeaways about what Tuesdays results say about where both parties are headed as they prepare for the midterms.",
    "The Washington Post reports that Democrats dont think they are at a disadvantage as he recovers, particularly given that the Republican primary is still not settled.",
    "Commish confirmed: The Senate confirmed Democrat Dara Lindenbaum to the Federal Election Commission this week, making her the fifth new commissioner since May 2020.",
    "House Democratic leaders public campaigning for Cuellar angered progressives, such as New York Rep. Alexandria Ocasio-Cortez, who called it a failure of leadership.",
    "Far-flung influence: Real Clear Politics looks at the political influence of a Swiss billionaire, Hansjrg Wyss, who has bankrolled progressive advocacy operations.",
    "In this business, I think we get distracted a lot of times by the glitz and the glam and the tweets and all these things that at the end of the day don't matter.",
    "Senate Minority Leader Mitch McConnell said Democrats had riled up a torrent of hysteria about the Georgia law as a way to push their election law overhaul.",
    "ICYMI\nStill counting in Oregon: The electoral fate of Rep. Kurt Schrader, a Blue Dog Democrat in Oregons 5th District, still has not yet been determined.",
    "There were so many things that in hindsight we could have had the flexibility and the resources to do if we hadn't gotten stuck in that primary fight.",
    "Other clients include Mike Collins and Chris West, who are headed to GOP primary runoffs in Georgias 10th and 2nd districts, respectively.",
    "Its a message theyve invoked often and with urgency this year, including for bills to codify abortion rights and strengthen voting rights.",
    "Loeffler won the nomination, but she lost to Warnock in a January 2021 runoff that helped Democrats gain majority control of the Senate.",
    "(Tom Williams/CQ Roll Call file photo)\nSubscribe now using this link so you dont miss out on the best news and analysis from our team.",
    "He has declared victory over challenger Jessica Cisneros, a progressive attorney, though The Associated Press hasnt called the race.",
    "Endorsement watch: Pro-Israel America and its PAC are supporting Glenn Ivey in the Democratic primary for Marylands 4th District.",
    "He told podcaster Jacob Goldstein on Tuesday that he had a soft ceiling of $1 billion, depending on what happens in the election.",
    "#OHSen: Speaking of Ryan, he issued his first ad of the general election for an open Senate seat, hitting Republican nominee J.D.",
    "Price tag of democracy: A new report from the National Institute for Civil Discourse examined the cost of conducting elections.",
    "The resource challenges experienced by state and local election officials in 2020 were part of a long story, the report finds.",
    "The Congressional Research Service put out a handy analysis of the federal laws regarding election worker safety and privacy.",
    "The margin ended up so narrow that the race went to a legally required recount before Gillum conceded more than a week later.",
    "Primaries in Alabama, Georgia and Arkansas, runoffs in Texas and a special election in Minnesota were a lot to keep track of.",
    "In 2018, Florida was an inflection point, politically, demographically, in terms of voter registration, all those things.",
    "Hung Cao won the Republican nomination this week to challenge Democratic Rep. Jennifer Wexton in Virginias 10th District.",
    "McBath, whose son was killed by gun violence, won her primary Tuesday against fellow Democratic Rep. Carolyn Bourdeaux.",
    "Starting out: Lawson is a native of Tallahassee, Fla., where, he said, the political bug was sort of built into my DNA.",
    "But because we were running so close with Doug Collins, we were forced to do things that we wouldn't have otherwise.",
    "Coming up\nTrump rallies in Wyoming on Saturday with Harriet Hageman, the primary challenger to GOP Rep. Liz Cheney.",
    "At the moment, the company plans to allow political ads only on podcasts, not on its free music-streaming network.",
    "But hes been trailing challenger Jamie McLeod-Skinner since the votes started rolling in after the May 17 primary.",
    "AAPI PAC: A group of Asian American Democrats is launching a new PAC called Justice Unites Us, NBC News scoops.",
    "The trend is troubling for Newman; her positives are going down and Castens are going up, the Sun-Times wrote.",
    "McLeod-Skinner had 58 percent to Schraders 42 percent as of the latest Associated Press update late Wednesday.",
    "McCormick, who is trailing, filed a lawsuit this week arguing that undated mail-in ballots should be counted.",
    "Cao defeated a better-funded candidate and focused his campaign on education and his experience as a veteran.",
    "The streaming audio service says advertisers can direct ads to specific audiences via \"contextual targeting.\"",
    "Primaries will pick back up next month with high-profile contests in nearly 20 states, including California.",
    "This whole episode proves exactly why our democracy needs its cooling saucer, he said on the Senate floor.",
    "The two incumbents are running against each other after the state lost one House seat in reapportionment.",
    "Streaming ads: Just in time for the midterms, political ads are returning to Spotify, Protocol reports.",
    "Vance for past comments that manufacturing jobs may no longer be an option for longtime workers.",
    "The long delay stems from ballot-printing problems in Clackamas County, where Schrader resides.",
    "That argument got something of a reality check this week with high turnout in the primaries.",
    "End Citizens United and Let America Vote endorsed Ohio Democratic Rep. Tim Ryan for Senate.",
    "I got connected with a couple of the guys who had done a lot of the oppo research on Gov.",
    "Thats not allowed under state law, and the state Republican Party is defending that law.",
    "Do you know someone who works in campaigns whom we should feature for Shop Talk?",
    "Each week well bring you news and analysis from the CQ Roll Call campaign team.",
    "Its not an honor to get nominated to become president or VP, Romney added.",
    "But she was forced to the right in a primary with then-Rep. Doug Collins.",
    "Nathans notes\nThe outlook for November has not improved for Democrats.",
    "Unconventional wisdom: Keep the main thing the main thing, he said.",
    "In any other universe, no one would ever run that ad, Lawson said.",
    "Ozs campaign said McCormick was following the Democrats playbook.",
    "That certainly was a disappointing circumstance, Lawson said.",
    "After college, he interned for the state GOP in Tallahassee.",
    "That was the culmination of such a tough campaign, he said.",
    "Its an honor to be nominated to get an Academy Award.",
    "Virginia GOP picking candidates: Retired Navy Capt.",
    "The rest of the state will hold primaries June 21.",
    "He ended up working for Scotts reelection bid.",
    "Know someone whod like to get this newsletter?",
    "He also worked on campaigns for Florida Gov.",
    "Bookmark it: But hopefully you wont need it.",
    "Ivey is facing former Rep. Donna Edwards.",
    "Scotts first campaign in 2010, he said.",
    "Email us at attheraces@cqrollcall.com.",
    "Starting gate\nWe got this: We know!",
    "Rick Scott, who is now a senator.",
    "Fetterman recovering: Lt. Gov.",
    "Ron DeSantis and former Gov.",
    "Upton is retiring in 2022.",
    "They can subscribe here.",
    "Welcome to At the Races!",
    "Dont worry."
  ]
}