{
  "id": 8462,
  "mediaId": 558,
  "date": "5/27/2022 12:00:00 AM",
  "headline": "Republican primaries offer look into future of Trumpism without Trump",
  "image": "https://s.yimg.com/ny/api/res/1.2/Z9tD_EOcmfIiLPtRC3UlEg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtjZj13ZWJw/https://s.yimg.com/uu/api/res/1.2/fFx2KHrsisN1RvBeZXluHQ--~B/aD0wO3c9MDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/theguardian_763/083413349d0ed636785a9eb22dda0190",
  "link": "https://sg.news.yahoo.com/republican-primaries-offer-look-future-060025154.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Smith",
  "authorUrl": "",
  "termIds": [
    661,
    896,
    1147,
    1434,
    1710,
    2087,
    3102,
    6179,
    2672,
    2834,
    2862,
    2945
  ],
  "sentences": [
    "Maga's identity crisis comes as Biden and other Democratic leaders seek to brand their opponents as Ultra-Maga Republicans in the hope that labelling the entire party as extremist will be more effective in the midterms than a singular focus on Trump (though he and his supporters have embraced Ultra-Maga and fundraising emails).",
    "But against the counsel of some of his inner circle, he chose to make this year's midterm elections about him and the primaries  votes in states and districts to decide which Republicans will take on Democrats in November  a referendum on his continued influence.",
    "Donald Trump has transformed the Republican party over the past five years and it is now a solid majority Trumpist party with everything that entails in policy and in tone, said Bill Galston, a senior fellow at the Brookings Institution thinktank in Washington.",
    "Should he , he may pay close attention to how Little, Kemp and others have studiously avoided criticising Trump while capturing swaths of his base by shifting right on abortion, gun rights and culture wars issues and signing legislation to prove it.",
    "A Republican who wants to pretend that 2016 through 2020 never happened and go back to the Romney-Ryan era is not going to do well in today's Republican party, said , a senior fellow at the Ethics and Public Policy Center thinktank in Washington.",
    ", a former Republican congressman who belonged to the rightwing Tea Party movement, said: Maga's dark enough on its own  Trumpism has metastasised beyond Trump and it'll go in a bunch of different dark, eerie places but it's all the same thing.",
    "A further sign of fracturing came this week when Cawthorn, smarting from his defeat in North Carolina, swore revenge on cowardly and weak members of : It's time for the rise of the new right, it's time for Dark Maga to truly take command.",
    "Yet while Trump's status as a kingmaker has been diminished, and his Stop the steal obsession is wearing thin, to extrapolate too much from primaries where it was always going to be hard to oust popular, well-funded incumbents.",
    "Cawthorn named allies including the Georgia congresswoman Marjorie Taylor Greene, rightwing activist Charlie Kirk, Fox News host Tucker Carlson and Trump himself, suggesting that the former president has already .",
    "In his campaign heyday, Donald Trump would declare it the greatest movement in the history of politics and promise: We're going to win so much, you're going to be so sick and tired of winning.",
    "Pence, himself a former governor of Indiana, has made a habit of speaking with pride about the accomplishments of the Trump-Pence administration while distancing himself from the big lie.",
    "Trump endorsed candidates in nearly 200 races, from governor to county commissioner, often in contests that are not particularly competitive and help bolster his list of wins.",
    "That means there is still little room for more old school Republicans such as Senator Mitt Romney and his running mate, Paul Ryan, who lost the presidential election in 2012.",
    "This is Trump's party and everything that's happened this primary season just continues to reflect that  Wake me up when an anti-Trump Republican wins a primary.",
    ", a similarly far-right candidate for governor of Georgia, backs Trump's false claims of voter fraud but is unsure whether she would vote for him again in 2024.",
    "Rubbing salt into the wound, Georgia's secretary of state Brad Raffensperger, who defied Trump's call to find the votes to change the outcome two years ago, .",
    "This year's primary season winners in Georgia and elsewhere have been careful not to disavow the movement, or its patriarch, even when they lack his blessing.",
    ", a Senate candidate who mounted a late surge in Pennsylvania with ideas even more extreme than Oz, told the Reuters news agency: Maga doesn't belong to him.",
    "The former US president suffered some humiliation on Tuesday when four candidates he handpicked in Georgia lost Republican primary elections in a landslide.",
    "In Pennsylvania, voters chose his preferred candidate for governor, Doug Mastriano, who said he would not have certified Joe Biden's 2020 win of the state.",
    "Among those asking the question is Chris Christie, the former governor of New Jersey, who campaigned for Kemp in Georgia and : Trump picked this fight.",
    "This week Trump again notched some wins including Sarah Sanders, his former White House press secretary, in the primary for governor of Arkansas.",
    "The month began well enough in Ohio, where venture capitalist and author JD Vance following Trump's late-stage endorsement in the Senate primary.",
    "Then there is Mike Pence, the former vice-president, who defied his old boss by on Monday and telling the crowd: Elections are about the future.",
    "In North Carolina, Trump helped the 26-year-old former college football player win the nomination for a seat in the House of Representatives.",
    "On the other hand, Republicans, including very conservative ones, are clearly willing to entertain the possibility of Trumpism without Trump.",
    "What never occurred to him was that the Make America Great Again movement  or Maga  might get sick and tired of him first.",
    "Attorney general Chris Carr and insurance commissioner John King, both opposed by Trump, prevailed in their primaries too.",
    "Senators Ted Cruz and Rand Paul have also felt at liberty to campaign for midterm candidates denied Trump's imprimatur.",
    "But others have been reckless, vengeful bets aimed at dislodging incumbents who defied his claims of election fraud.",
    "The anti-democratic implication was that the end justifies the means in an existential struggle for America.",
    "The hard-right, nativist-populist strain of Republican politics predates Trump and will surely survive him.",
    "It was a stinging rebuke in what has become ground zero for his big lie that the 2020 election was stolen.",
    "But it was , where he has pushed his personal vendetta hardest and so squandered political capital.",
    "Trump is now 75 and could be living a quiet, golf-playing retirement like other past presidents.",
    "Ron DeSantis, the governor of Florida, is another likely student of the formula.",
    "It all depends on what happens between now and then and who runs against him.",
    "The people of America chose him and he's the one that we elected.",
    "Walsh, who and now hosts a podcast, added: Nothing has changed.",
    "She said in an interview with the Guardian: It's not about him.",
    "But it was no rebuke of Maga and all it stands for.",
    "Trumpism now is the dominant strain in the party.",
    "Few are making an impact in the primaries.",
    "So far, the results have been a mixed bag.",
    "Will I vote for him in 2024?",
    "Trump coined the word.",
    "He does not own it.",
    "That would be news."
  ]
}