{
  "id": 8521,
  "mediaId": 18,
  "date": "5/30/2022 12:00:00 AM",
  "headline": "Off the charts': Virus hot spots grow in middle America",
  "image": "https://www.bostonherald.com/wp-content/uploads/2020/03/APTOPIX_Virus_Outbreak_Romania_63942-1-1.jpg?w=1569",
  "link": "https://www.bostonherald.com/2020/03/28/u-s-hotspots-grow-as-virus-cases-surpass-620000-globally/",
  "sentiment": "0.0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.bostonherald.com/author/associated-press/",
  "termIds": [
    661
  ],
  "sentences": [
    "As President Donald Trump made his way to Norfolk, Virginia, to see off a U.S. Navy medical ship sent to New York City to help, he suggested imposing some kind of quarantine for New York and parts of New Jersey and Connecticut, all hit hard by the coronavirus.",
    "The disease threatens to be devastating for close-knit communities where everyone knows everyone, Durbin said, adding that he was a friend of the person believed to have died from the virus as well as others currently in critical condition.",
    "By KAT STAFFORD and MARTHA IRVINE\nDETROIT (AP)  The coronavirus continued its unrelenting spread across the United States with fatalities doubling in two days and authorities saying Saturday that an infant who tested positive had died.",
    "Elsewhere, Russia announced a full border closure while in parts of Africa, pandemic prevention measures took a violent turn, with Kenyan police firing tear gas and officers elsewhere seen on video hitting people with batons.",
    "Indian authorities sent buses to the outskirts of New Delhi to meet an exodus of migrant workers desperately trying to reach their home villages amid the world's largest lockdown, which effectively put millions out of work.",
    "At this time, the trajectory of Detroit is unfortunately even more steep than that of New York, said Dr. Teena Chopra, the medical director of infection prevention and hospital epidemiology at the Detroit Medical Center.",
    "She also acknowledged that in Detroit, one of the nation's largest African American cities, there is a distrust among some in the community of the medical system and government due to systemic racism.",
    "But Spain's director of emergencies, Fernando Simn, saw hope in that the rate of infection is slowing and figures indicate that the outbreak is stabilizing and may be reaching its peak in some areas.",
    "On Saturday, 174 foreign tourists and four Nepali nationals in the foothills of Mount Everest were flown out days after being stranded at the only airstrip serving the world's highest mountain.",
    "Rhode Island National Guard troops were instructed to go door to door in coastal communities to find New Yorkers and advise them about a mandatory 14-day quarantine for people from the state.",
    "It pummeled big cities like New York, Detroit, New Orleans and Chicago, and made its way, too, into rural America as hotspots erupted in small Midwestern towns and Rocky Mountain ski havens.",
    "Italian Premier Giuseppe Conte announced he had signed a decree freeing up 400 million euros ($440 million) for coupons and packages of food aid, to be delivered door-to-door if necessary.",
    "One of them, Decatur, population 26,000, has 30 cases with one confirmed death and another suspected, said Sean Durbin, the county's public health emergency preparedness coordinator.",
    "Russian Prime Minister Mikhail Mishustin ordered his country's borders fully closed as of Monday, exempting diplomats as well as residents of the exclave of the Kaliningrad region.",
    "Worldwide infections surpassed the 660,000 mark with more than 30,000 deaths as new cases also stacked up quickly in Europe, according to a tally by Johns Hopkins University.",
    "Some subway service was restored in Wuhan, where the virus first emerged in December, after the city of 11 million had its virus risk evaluation reduced from high to medium.",
    "It still had its share of grim news: 12 residents of a nursing home in the northern town of Wolfsburg have died since Monday after being infected, news agency dpa reported.",
    "In Detroit, we are seeing a lot of patients that are presenting to us with severe disease, rather than minor disease, said Chopra, who worried about a tsunami of patients.",
    "It wasn't entirely clear whether he had the power to impose such a quarantine for the three states, and the idea was met with confusion and anger from their governors.",
    "Blaine County, Idaho, a scenic ski haven for wealthy tourists, now has around 100 confirmed cases of COVID-19, the highest rate per capita outside the New York area.",
    "The governor of Kansas also issued a stay-at-home order to begin Monday, as the virus takes hold in more rural areas where doctors worry about the lack of ICU beds.",
    "Ron DeSantis has ordered anyone arriving from Louisiana to self-quarantine and said law enforcement officers would set up checkpoints to screen cars from the state.",
    "But for others, especially older adults and people with existing health problems, the virus can cause more severe illness, including pneumonia, and lead to death.",
    "Spain, Italy, France and six other members have asked the union to share the burden of European debt, dubbed coronabonds in the media, to help fight the virus.",
    "Germany has fewer deaths than some neighboring countries but has closed nonessential shops and banned public gatherings of more than two people until April 20.",
    "Chicago Mayor Lori Lightfoot closed popular lakeshore parks after people failed to practice social distancing, despite a statewide shelter-at-home order.",
    "Several cases were traced to large gatherings earlier in the month, including a religious retreat and a high school basketball tournament.",
    "If you haven't been paying attention, maybe this is your wake-up call, said Illinois Department of Public Health Director Dr. Ngozi Ezike.",
    "Confirmed deaths surpassed 2,000 on Saturday, twice the number just two days before, highlighting how quickly infections are escalating.",
    "Cuomo said on CNN that it would be illegal, economically catastrophic and unproductive since other areas are already seeing a surge.",
    "The last supply from the federal stockpile arrived more than a week ago and contained just 77 N95 masks and two dozen face shields.",
    "For most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks.",
    "It is the most difficult moment for the EU since its foundation and it has to be ready to rise to the challenge, Snchez said.",
    "The U.N. donated 250,000 face masks to the city, and Cuomo delayed the state's presidential primary from April 28 to June 23.",
    "Follow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak",
    "Still, some states without known widespread infections began to try to limit exposure from visitors from harder-hit areas.",
    "J.B. Pritzker said Saturday that an infant with COVID-19 died in Chicago and the cause of death is under investigation.",
    "Lockdowns of varying degrees have been introduced across Europe, nearly emptying streets in normally bustling cities.",
    "As the epicenter has shifted westward, the situation has calmed in China, where some restrictions have been lifted.",
    "Cases in Chicago and suburban Cook County accounted for about three-fourths of Illinois' 3,026 total as of Friday.",
    "In Spain, where stay-at-home restrictions have been in place for nearly two weeks, the death toll rose to 5,812.",
    "Cases also have been rising rapidly in Detroit, where poverty and poor health have been problems for years.",
    "Louisiana has surpassed 3,300 infections with 137 dead from COVID-19, according to the health department.",
    "John Bel Edwards said the region was on track to run out of ventilators by the first week of April.",
    "Spanish Prime Minister Pedro Snchez called for a more vigorous response from the European Union.",
    "Officials didn't release other information, including whether the child had other health issues.",
    "The county health department has already run out of personal protective equipment, Durbin said.",
    "Chopra said many patients have ailments like asthma, heart disease, diabetes and hypertension.",
    "Trump approved a major disaster declaration for Michigan, providing money for the outbreak.",
    "But the idea has met resistance from other members, led by Germany and the Netherlands.",
    "Still, five countries have higher death tolls: Italy, Spain, China, Iran and France.",
    "A cluster of three counties in rural Indiana have surging rates of confirmed cases.",
    "But he later tweeted that he intended to issue a strong travel advisory instead.",
    "The number of infections surged to 1,381, with 31 deaths, as of noon Saturday.",
    "Andrew Cuomo said defeating the virus will take weeks and weeks and weeks.",
    "The city's homeless population is especially vulnerable, officials said.",
    "The virus continues to strain health systems in Italy, Spain and France.",
    "Another 8,000 confirmed infections pushed that count above 72,000 cases.",
    "Italy has almost completed a three-week lockdown, with no end in sight.",
    "More than 135,000 people have recovered, according to Johns Hopkins.",
    "Countries are still trying to bring home citizens stranded abroad.",
    "The U.S. leads the world in reported cases with more than 120,000.",
    "Italy has more than 10,000 deaths, the most of any country.",
    "I wish there was a stronger word for disappointed, he said.",
    "He has done the same for New York, Louisiana and Illinois.",
    "Associated Press journalists around the world contributed.",
    "But they are also suffering economically, Conte said.",
    "They're not used to staying in their homes.",
    "New York remained the worst-hit U.S. city.",
    "People are suffering psychologically.",
    "I'm calling on them to do better.",
    "This is off the charts, she said.",
    "Irvine reported from Chicago.",
    "Two people have died.",
    "And in Florida, Gov.",
    "Illinois Gov.",
    "Gov.",
    "Gov."
  ]
}