{
  "id": 8522,
  "mediaId": 302,
  "date": "d2022-05-29T14:00",
  "headline": "Democratic candidates for Florida governor debate, but focus on DeSantis",
  "image": "https://www.tampabay.com/resizer//_4XFq8H31HtIJF7IV21AJVVXdaM=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/3HEPOKOXIBGLFBUALF6IRKHGIQ.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/29/democratic-candidates-for-florida-governor-debate-but-focus-on-desantis/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    1451,
    1761,
    3992,
    2661,
    2788,
    2790,
    6245
  ],
  "sentences": [
    "The three main people vying for the Democratic nomination  Agricultural Commissioner Nikki Fried, Miami Sen. Annette Taddeo and Crist  had little sunlight between them on issues from affordable housing to abortion and the environment during the forum, moderated by CBS 4s Jim DeFede.",
    "But in a state where Republicans have made historic gains on voter registration and incumbent DeSantis has topped a staggering $100 million in campaign contributions for his reelection bid, the candidates focused most of their time on drawing contrasts to DeSantis' record.",
    "DeFede also asked the candidates about their positions on addressing affordable housing and the state's property insurance crisis, following a special legislative session this week in which lawmakers passed new legislation to address rising property insurance rates.",
    "Taddeo, who represents a Miami-Dade district that cast more votes for former President Donald Trump than President Joe Biden, said that she believed it was important for Democrats to invest in Hispanic voters all across the state but especially in South Florida.",
    "I really know that for this to work, we have to get back those percentages that we have lost, specifically right here in Miami-Dade, Taddeo said, referring to the historic margins of victory for Democrats over Republicans in statewide races.",
    "We know that there are so many Republicans in the Legislature today that have no idea what Medicaid expansion even means, Fried said, saying leaders need to meet with their constituents and listen to them and then go against them.",
    "Trading zingers on their connections to the Republican Party and the National Rifle Association, the three leading Democrats running for Florida governor pitched their case for why they're most likely to beat Gov.",
    "We are running against an autocrat who is trying to create an autocracy., U.S. Rep. Charlie Crist told the audience of more than 100 at the forum in North Miami Beach's Julius Littman Performing Arts Theater.",
    "We've got serious issues that are on our plate today, everything from gun violence to abortion to voting rights to health care to our LGBTQ-plus community, Fried said, speaking directly to Crist.",
    "On beating DeSantis, all three candidates agreed that Democrats needed to back the primary winner regardless of who it is, while acknowledging the party's beleaguered position in the state.",
    "Citizens Insurance, known as a last resort insurer run by the state, is sometimes the only option for people who are dropped by another insurer or dropped by one that goes bankrupt.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nAll three candidates also backed the expansion of Medicaid in the state but differed in their approaches.",
    "And so when that happens, other opponents may take shots, but our shots need to be directed at the real problem we're all having in Florida, and his name is Ron DeSantis.",
    "While Crist said he believed an executive order was the way to go, Taddeo said she believed she could work with members of both parties in the Senate to get it done.",
    "And during the discussion on gun violence and banning assault weapons (which all three candidates agreed they would do, if elected), Fried put Crist in the hot seat.",
    "The candidates all alluded to the shooting at Robb Elementary School in Uvalde, Texas, where 19 children and 2 adults were killed by an 18-year-old gunman.",
    "Taddeo slammed the Legislature for not going far enough on certain proposals made by Democrats and not addressing Citizens insurance.",
    "In response, Crist touted his own campaigning: Things are going well in this primary for me, I'll admit it.",
    "As insurance rates are rising and more insurers are going bankrupt, Citizens is growing at a rapid rate.",
    "He's taking away your civil rights, your voter rights, your women's rights, your minority rights.",
    "Charlie Crist, Nikki Fried and Annette Taddeo faced off Saturday night in North Miami Beach.",
    "The issues that we are fighting for today, your past record is what got us here, Fried said.",
    "He talks about us being the freest state in the country, it's exactly the reverse.",
    "The people of our nation are relying on us to take down Ron DeSantis, Fried said.",
    "In this special session, they didn't even touch Citizens Insurance, Taddeo said.",
    "Seven points, eight points in Miami-Dade, that will never do it.",
    "We are the most unfree state in America because of Ron DeSantis.",
    "Ron DeSantis during a Saturday night forum in South Florida.",
    "You were the NRA's candidate for most of your career.",
    "We don't have the luxury of getting this wrong.",
    "These are all issues that you fought for.",
    "What are you talking about?",
    "I fought for gun violence?",
    "It's appalling.",
    "Crist replied.",
    "I know that."
  ]
}