{
  "id": 8525,
  "mediaId": 302,
  "date": "5/29/2022 12:00:00 AM",
  "headline": "Florida embraced social-emotional learning after Parkland. Not any more.",
  "image": "https://www.tampabay.com/resizer//mCghK_7ZUaoxT9m4CkP0d9CuunQ=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/YGIEXLTMKJBJJCGKMJMCIKD6CA.jpg",
  "link": "https://www.tampabay.com/news/education/2022/05/29/florida-embraced-social-emotional-learning-after-parkland-not-any-more/?itm_source=parsely-api",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    4706,
    6198,
    3279,
    2582,
    2661,
    2851,
    2934,
    5086
  ],
  "sentences": [
    "For us, it's about creating the right mindset for students, one that students, when they walk into the room, they feel comfortable and confident enough not only to attack content, but facilitate the learning every single day and be exemplars for those around them and for themselves, Davis said.",
    "It's incredibly important that mental health and the emotional skills that we are teaching students not be separate from the core mission and vision of the school system, said von der Embse, who's also co-director of the USF/University of Wisconsin School Mental Health Collaborative.",
    "The Republican-led state government poured resources into those efforts, passing laws intended to reduce the likelihood of at-risk students developing social, emotional, or behavioral health problems, depression, anxiety disorders, suicidal tendencies, or substance use disorders.",
    "Florida has invested and will continue to invest in school safety and mental health initiatives for students as the health, safety and welfare of Florida's 2.9 million students is the utmost priority, education department spokesperson Cassie Palelis said via email.",
    "Book challenges: A state education professional practices investigator has ordered the Orange County school district to report which employee authorized the purchase of the graphic novel Gender Queer for school libraries, the Orlando Sentinel reports.",
    "Other hot topics\nSchool security: Pinellas County Sheriff Bob Gualtieri, who led the state's school safety commission after Parkland, says Floridians have placed a higher priority on campus security in the past four years, but more work remains.",
    "She also noted legislation requiring added training on youth mental health issues, more money for mental health assistance in schools and First Lady Casey DeSantis' Hope for Healing initiative on mental health and substance abuse.",
    "As Floridians reflected on the Tuesday shooting that killed 19 children and two teachers at a Texas elementary school, some wondered if the government's move away from these concepts is a step in the wrong direction.",
    "Asked how the DeSantis administration's recent stance on social-emotional learning jibes with school safety and security needs, the Governor's Office focused on the initiatives it said he has backed.",
    "The Texas school shooting, she said, highlights why Florida needs to have risk behavior data, which is collected from surveys of young people and used in deciding where to deploy services.",
    "And it threatened to do the same for the coming round of social studies books, warning publishers to keep their pages free of unsolicited theories that may lead to student indoctrination.",
    "Florida Education Association president Andrew Spar said that, despite touting the need for added mental health supports after Parkland, state government has not backed the effort fully.",
    "Math textbooks: The Lee County School Board made a decision on its math book adoption, after waiting for the fallout to die down over state rejections of several materials, WFTX reports.",
    "A Lee County parent was arrested on accusations of attempting to attend a graduation ceremony with a fake bomb because her child would not graduate, the Fort Myers News-Press reports.",
    "But he questioned the shift against social-emotional learning, which conservative groups like Moms for Liberty have branded as part of a woke political agenda infiltrating schools.",
    "The state hasn't provided funding to place a psychologist in every school to serve students in crisis, he said, or a social worker in every school to connect families to services.",
    "Hillsborough County school superintendent Addison Davis said it's a must that schools meet students' non-academic needs to help them make good decisions and become a better self.",
    "A key to preventing another murderous attack, many argued, was to better identify children's mental health needs and provide services before any problems grew out of control.",
    "Social-emotional learning involves teaching kids life skills that go beyond traditional book learning  for example, how to show empathy, maintain relationships and set goals.",
    "The 18-year-old gunman who attacked Robb Elementary in Uvalde, Texas, was a high school senior who reportedly had trouble finding friends and getting along with classmates.",
    "The crowd at an Okaloosa County high school's graduation provided lighting to end the ceremony after a nearby transformer blew, the Northwest Florida Daily News reports.",
    "Teacher pay: Lee County school employees ratified contract agreements that bring the base teacher salary to $47,500 and provide bonuses up to $5,000, WFTX reports.",
    "More students are feeling sad or hopeless almost every day, said Norn Dollard, director of Florida KIDS COUNT, an initiative that tracks child well-being.",
    "She listed actions such as funding for school guards, support for hardening schools, and systems for emergency alerts and anonymous reporting of threats.",
    "We must continue our efforts and evaluate the processes currently in place to provide all students with access to safe and secure learning environments.",
    "The big story: Florida school districts increasingly are depending on local-option tax referendums to boost their revenue, despite rising state funding.",
    "The Florida Department of Education recently rejected more than 50 math textbooks in part because they contained elements of social-emotional learning.",
    "Ron DeSantis and his allies repeatedly contend that a child's social-emotional development is a responsibility that rests with parents, not educators.",
    "A Collier County hospital is giving about 50 teens the opportunity to get hands-on training in a new summer program, the Naples Daily News reports.",
    "Collecting behavior data alone is not enough, said University of South Florida associate professor of school psychology Nathaniel von der Embse.",
    "Career training: An 11-year-old Pinellas County boy became the nation's youngest student to earn drone industry certification, WFTS reports.",
    "Von der Embse said the core tenets of social-emotional learning have decades of research behind them showing they bolster academic success.",
    "He praised Florida leaders for putting more money into mental health services since Parkland, and for requiring evidence-based practices.",
    "Every Thursday, get the latest updates on what's happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "Growth: The booming St. Johns County school district announced plans to build two more new schools in the next two years, WJXT reports.",
    "Race relations: The Martin County students who were photographed at school spelling out a racial slur have apologized, TC Palm reports.",
    "Every Thursday, get the latest updates on what's happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "The Santa Rosa County school district is looking into implementing a guardian program this fall, the Pensacola News-Journal reports.",
    "Florida instead plans to go it alone with its own program  a decision opposed by more than three dozen advocacy groups.",
    "We're going completely backward, said state Rep. Anna Eskamani, an Orlando Democrat who's been a vocal DeSantis critic.",
    "That happened in Clay and Duval counties in 2019, and surfaced in Broward County earlier this year before fading away.",
    "Two Central Florida sheriffs called for added school guards after this week's Texas school shooting, WOFL reports.",
    "Dollard led an effort this past week to urge the state to resume its participation in the risk behaviors program.",
    "To address problems, these are things that people need to know about their community and their school, she said.",
    "State officials have stressed they intend to keep gathering the information, just not with the federal program.",
    "Subscribe to our free Gradebook newsletter\nThe work of ensuring school safety is never complete, Palelis wrote.",
    "These are all decisions that create risk, and not allow us to provide supports to children who need supports.",
    "Too often, Spar said, providing social services falls to busy classroom teachers, where it does not belong.",
    "School districts complied, submitting detailed plans to bring social-emotional learning into classrooms.",
    "An Orange County teen with cancer was granted his dying wish to graduate from high school, WESH reports.",
    "In addition, the state ended its participation in a federal program that monitors youth risk behaviors.",
    "What goes through a kid's mind when they say, We've got to do a drill,' and then they see it happen?",
    "he asked, referring to the Parkland shooter whose sentencing hearing is ongoing in Broward County.",
    "The state is turning its back on a strategy it once saw as a way to help prevent school shootings.",
    "We have got to not fall for the political theater, and focus on the issues that matter, he said.",
    "In several instances, county commissioners have attempted to change their school boards' plans.",
    "Florida faced a crisis after the 2018 massacre at Marjory Stoneman Douglas High in Parkland.",
    "The ratio of guidance counselors to students remains much lower than recommended, he added.",
    "We do active shooter drills, which by the way put a mental strain on our kids, Spar said.",
    "Now the Hernando County board and commission are at odds over election dates.",
    "Graduation season: Meet Hernando County's valedictorians and salutatorians.",
    "South Florida teacher union leaders panned the concept, WPLG reports.",
    "But it's not always as easy as just putting a question on the ballot.",
    "Here's what the holiday is all about  it's not just another day off.",
    "The move has drawn criticism from at least one School Board member.",
    "The outcome could affect school systems across the state.",
    "Staff writer Marlene Sokol contributed to this report.",
    "The idea to arm classroom teachers has resurfaced.",
    "It is not enough to simply have warning signs.",
    "Have we forgotten the issues of Nikolas Cruz?",
    "Before you go ... Memorial Day comes Monday.",
    "Here's a link to yesterday's roundup.",
    "Sign up for the Gradebook newsletter!",
    "Sign up for the Gradebook newsletter!",
    "We have armed guards in our schools.",
    "We need direct service delivery.",
    "Schools have to prioritize this.",
    "We have fortified our schools.",
    "Click here to sign up.",
    "Four years later, Gov.",
    "Click here to sign up.",
    "Read our story here.",
    "Don't miss a story."
  ]
}