{
  "id": 8528,
  "mediaId": 238,
  "date": "d2022-05-28T16:21",
  "headline": "Florida Republicans beat the gun lobby. Congress hasn't followed.",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/28/florida-gun-laws/",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mike DeBonis",
  "authorUrl": "https://www.washingtonpost.com/people/mike-debonis/",
  "termIds": [
    661,
    1464,
    2305,
    4341,
    6165,
    6195,
    545,
    3508,
    6120,
    2661,
    2926
  ],
  "sentences": [
    "He touted the bill in comments to reporters Tuesday evening, just after the news from Uvalde broke, then described its provisions to his colleagues inside a Senate GOP lunch on Wednesday and spoke to Sen. Chris Murphy (D-Conn.), the lead Democratic negotiator on gun legislation, about the bill on Thursday.",
    "But the talks on Capitol Hill, which kicked off Thursday among a small bipartisan group of senators, appear to be centered on much more limited proposals, such as a modest expansion of criminal background checks for gun buyers or federal grants to encourage states to set up their own red flag systems.",
    "That dynamic played out on the Senate floor Wednesday, when Sen. Ron Johnson (R-Wis.) tried to pass a bill written in the aftermath of the Parkland shooting that would establish a federal clearinghouse on school safety best practices but not spend any new federal money to implement those practices.",
    "Asked whether he would be willing to grant Republicans concessions, such as arming teachers or hardening school facilities, Blumenthal did not rule it out: I'm always in favor of using honey rather than vinegar, he said, so long as the sweeteners advance, not detract, from the effort to save lives.",
    "Rick Scott (R) signed into law a bill that included provisions banning weapons sales to those younger than 21, imposing a three-day waiting period on most long-gun purchases, and creating a red flag law allowing authorities to confiscate weapons from people deemed to constitute a public threat.",
    "In a different political reality, what worked in Florida  a huge center-right state that is often seen as a bellwether of national political trends  might well be seen as a template for a national compromise to address mass acts of gun violence, such as Tuesday's shooting in Uvalde, Texas.",
    "Former GOP state representative Jose R. Oliva  who sponsored the post-Parkland bill in the Florida House  said the parents of the murdered Parkland teens and their fellow students were an early and constant presence in the statehouse and helped personalize the tragedy with lawmakers.",
    "But he also said that confronting Republicans with the reality of the carnage was just as important  whether it was through visits from parents and bused-in students or a trip he organized to show the bullet-ridden, bloodstained Marjorie Stoneman Douglas campus to senior lawmakers.",
    "A few Democrats, including Sen. Richard Blumenthal (D-Conn.), have started pointing to the Florida bill as an example of gun laws that work  particularly the red flag component, which has kept guns out of the hands of nearly 6,000 troubled Floridians since it was first implemented.",
    "But that broadside wasn't entirely accurate: Not long ago, GOP lawmakers bucked ferocious pressure from the National Rifle Association to pass significant new gun restrictions after a deadly school shooting, which were then signed into law by a fiercely conservative Republican.",
    "But people involved in the passage of the Marjory Stoneman Douglas High School Public Safety Act said the bigger issues have to do with what was present in Tallahassee in 2018 and absent for now on Capitol Hill  namely, a combination of trust, activism and political courage.",
    "Pressed on why his state's model legislation wouldn't work on the federal level Thursday, Scott cast matters in the argot of Big Business: best to focus on continuous improvement, he said, where you tackle a specific problem, solve it, and move to the next problem.",
    "Like Scott, several Republicans said in interviews that they see any congressional response to acts of mass gun violence through a lens of federalism and want Congress to focus on helping states deal with issues such as school security and mental health.",
    "The group's lawyers argued to a federal appeals court in Miami earlier this year that banning weapons sales to those between 18 and 20 is flatly unconstitutional  an argument that federal courts in other parts of the country have already embraced.",
    "Former state representative Jared Moskowitz, a Democrat who led the push in Tallahassee to pass the bill, recalled on Friday some conversations he had immediately following the Parkland attack: There's no way Rick Scott is raising the age to 21.",
    "Scott himself  who went on to narrowly defeat incumbent Sen. Bill Nelson (D-Fla.) in 2018, even after his NRA rating was downgraded from an A-plus to a C  said this week that he does not favor passing a federal version of the Florida law.",
    "Other factors were at play that aren't operative in Congress: Florida has relatively strict term limits, so some lawmakers  including the Republican House speaker and Senate president  knew they would not have to face voters again.",
    "Other provisions of the bill included $400 million for mental health and school security programs, and an initiative, fiercely opposed by Democrats, that would allow teachers and school staff to be trained as armed guardians.",
    "Moskowitz, who is now running to succeed retiring Rep. Ted Deutch (D-Fla.) as the House member representing Parkland and its Broward County neighbors, acknowledged bipartisan political relationships were crucial.",
    "After a teenage gunman killed 19 fourth-graders and two teachers inside a Texas elementary school Tuesday, Democrats on Capitol Hill quickly lamented Republican lawmakers' years of intransigence on gun control.",
    "Asked how Florida Republicans managed to stand up to the NRA, Oliva said he and his colleagues essentially decided to hold hands and jump: The funny thing about elected officials is, they have all the power.",
    "And if someone's going to do something on the age at which you can buy an AR or universal background checks in exchange for stupid things that I think won't make a difference, I'm open to that conversation.",
    "Moskowitz said that even if Congress fails once again to act on guns after Uvalde, Florida still has plenty to teach the country from its post-Parkland experience  even if it happens one state at a time.",
    "Scott won election as senator in 2018, Oliva was reelected that year and was chosen as Florida House speaker for his last term, and the law has remained intact under Gov.",
    "We pushed and shoved and went back and forth, and, behind closed doors, there were some difficult moments, but we always had a great respect for each other, Oliva said.",
    "But 75 out of 99 GOP lawmakers voted for it anyway, and Scott  who was preparing to seek a U.S. Senate seat  signed it, calling the bill full of common-sense solutions.",
    "No matter the cause of violence and no matter the cost on the families, Senate Majority Leader Charles E. Schumer (D-N.Y.) said Thursday, nothing seems to move them.",
    "And it included the guardian program, which allowed individual counties to decide whether to allow school staff to receive security training and carry guns.",
    "Moskowitz had to argue passionately in the closing phase of the debate to convince enough Democrats that the perfect could not be the enemy of the good.",
    "It did not include a blanket assault-weapons ban or a proposed moratorium on the sales of AR-type semiautomatic rifles, as parents and students wanted.",
    "And he credited Moskowitz, who attended Douglas, with trying to keep the response to the tragedy as far away from point-scoring politics as possible.",
    "And asked about age limits for rifle purchases, one key GOP negotiator, Sen. Lindsey O. Graham (R-S.C.) said, I don't think that's on the table.",
    "It says nothing at all about guns, prompting Schumer to object, saying it did not constitute a real solution to America's gun violence epidemic.",
    "Interviews this week with Republican senators revealed little stomach for the sort of sprawling bill that Florida Republicans passed in 2018.",
    "The shooting happened in the middle of the state's 60-day legislative session, which created an opportunity and deadline for quick action.",
    "There is little evidence that the sort of sprawling compromise bill that won approval in Florida could come together on Capitol Hill.",
    "Three weeks after 17 people were gunned down in 2018 inside Marjory Stoneman Douglas High School in Parkland, Fla., then-Florida Gov.",
    "Democrats on Capitol Hill, meanwhile, are still sharply skeptical of any initiative to put guns in the hands of teachers.",
    "The NRA's powerful leader in the state, Marion P. Hammer, condemned Republicans backing the bill as betrayers.",
    "Listen, I like states' rights, Johnson said afterward, when asked about adopting Florida's law nationally.",
    "In the end, Oliva said, the expected conservative voter backlash never materialized for Republicans.",
    "I just don't feel a burning desire to have the federal government rule over the land on every issue.",
    "Some are curious about red flag laws but skeptical about their implementation on the federal level.",
    "Still, there is little sign that any Senate Republicans are interested in a wide-ranging trade-off.",
    "It worked in Florida, and so they ought to look at that and say, could that work in their states?",
    "Most Florida Democrats, meanwhile, did not consider the bill a victory  at least, not at first.",
    "Now, he said, the guardian program has become well-accepted, even in more liberal counties.",
    "I think arming teachers is an unusually stupid idea, said Sen. Brian Schatz (D-Hawaii).",
    "But at least some said they are willing to discuss it as part of a larger negotiation.",
    "It seemed like it was going to play in a couple of primaries, but it didn't, he said.",
    "So in the end, if you have the courage, you press the button and damn the torpedoes.",
    "I like states being able to decide these things for people who live in their states.",
    "They knew this was my hometown, and they knew this was my high school, he said.",
    "Greg Abbott up right now and say: Governor, here's what I did after Parkland.",
    "States, he said, were better equipped to move quickly through that process.",
    "He thinks should be up to the states; I disagree, he said about Scott.",
    "When you don't doubt that sincerity, you can get a lot of things done.",
    "The NRA continues to challenge portions of the Florida law in court.",
    "Still, Scott has been promoting Florida's work inside the Senate.",
    "He's someone that can be very forceful but sticks to the facts.",
    "So it was real personal to me, and I made it personal to them.",
    "The lobbyists cannot go on the floor and press that button.",
    "Marion Hammer is the strongest NRA lobbyist in the country.",
    "No way, no way, no way is it going to happen, he said.",
    "None said they are open to a federal waiting period.",
    "Every state's going to be a little bit different.",
    "Ron DeSantis (R) and subsequent GOP legislatures.",
    "It ought to be done at the state level, he said.",
    "But he should call [Republican Texas Gov.]",
    "They're threatening Republican members.",
    "It didn't seem to have an effect.",
    "But is there room for compromise?",
    "You should do the same thing.",
    "These guys are all A-rated.",
    "The obstacles are myriad.",
    "The NRA is opposing it.",
    "And then it happened.",
    "Yet it's not.",
    "It's working.",
    "Sure."
  ]
}