{
  "id": 8530,
  "mediaId": 136,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "Ron Johnson Takes Heat for Linking School Shootings to 'Wokeness'",
  "image": "https://d.newsweek.com/en/full/2047649/johnson-criticized-linking-shootings-wokeness.webp?w=790&f=3b93e9544a48fc3e3d9256676932a553",
  "link": "https://www.newsweek.com/ron-johnson-takes-heat-linking-school-shootings-wokeness-1711136",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Xander Landen",
  "authorUrl": "https://www.newsweek.com/authors/xander-landen",
  "termIds": [
    661
  ],
  "sentences": [
    "Democratic Wisconsin Governor Tony Evers called the senator's comments \"breathtaking\" on Friday according to the Wisconsin State Journal and pointed to a 2019 poll from Marquette University Law School that found 80 percent of Wisconsin residents support expanded background checks for gun sales.",
    "Responding to the interview, Fred Guttenberg, whose daughter was killed in the school shooting in Parkland, Florida, in 2018 tweeted: \"No @SenRonJohnson, My daughter Jaime did not die because of wokeness or CRT.",
    "\"Senile Senator Ron Johnson confuses talking points and blames Critical Race Theory for the Uvalde Massacre,\" John Anthony Castro, a Republican candidate who is running for president for 2024, wrote on Twitter.",
    "During an interview on Fox News, host Neil Cavuto noted that the suspected gunman in the mass shooting in Uvalde, Texas, this week that killed 21 people, including 19 students, legally bought his two guns.",
    "\"For him to say something like that, first of all it is in direct conflict with what the people of Wisconsin want, and frankly it makes no...sense,\" the governor said, according to the newspaper.",
    "We're indoctrinating our children with things like [critical race theory], telling some children they're not equal to others and they're the cause of other peoples' problems. \"",
    "Florida Republican Governor Ron DeSantis has targeted Disney with legislation in recent months after the company opposed what critics dubbed as the \"Don't Say Gay\" bill.",
    "During a speech at a National Rifle Association (NRA) conference in Houston on Friday, South Dakota Governor Kristi Noem defended gun rights, and criticized \"woke mobs.\"",
    "\"I think [critical race theory] has been going on under the radar for quite some time as well, wokeness has been, liberal indoctrination has been.",
    "\"We have seen the same type of radical mob mentality taking place on the streets of American cities that swept Paris in the 1790s,\" she said.",
    "Senator Ron Johnson is facing criticism online after he linked \"wokeness\" and critical race theory (CRT) to school shootings on Thursday.",
    "These are difficult issues, but again the solution lies in stronger families, more supportive communities, I would argue renewed faith.",
    "Your comments may be the dumbest, most pathetic yet trying to explain this...I am Jaime's dad and I will not stop until you are fired.\"",
    "The spokesperson also said that \"the senator has supported a number of common sense improvements to background checks and guns laws.\"",
    "Representative Adam Kinzinger, a Republican from Illinois, tweeted: \"And of course, there is the worst of all: DISNEY.\"",
    "A spokesperson for Johnson told the Wisconsin State Journal that \"the senator did not blame CRT on mass shootings.\"",
    "This is a much larger issue than what a simple new gun lawit's not going to solve it,\" Johnson responded.",
    "Representative Mark Pocan, a Democrat from Wisconsin, called Johnson's remarks on Fox News \"appalling.\"",
    "\"You can't identify all these problems, you can't arrest somebody for a crime they haven't commit yet.",
    "Cavuto then reminded Johnson that school shootings \"have been going on long before CRT and wokeness.\"",
    "The senator added: \"We've stopped teaching values in so many of our schools.",
    "\"No matter what you do, people fall through the cracks,\" Johnson responded.",
    "\"Woke mobs are tearing down statues, and it doesn't matter who they are of.",
    "\"Do you think that that would require maybe stiffer background checks?\"",
    "\"Mass shootings have nothing to do with 'liberal indoctrination.'",
    "Newsweek has reached out to Johnson's office for comment.",
    "Cavuto asked Johnson, who is a Wisconsin Republican.",
    "Our founding fathers, Catholic missionaries.",
    "They even wanted to come after Mt.",
    "Now we're teaching wokeness.",
    "It's about access to guns.",
    "Well not on my watch.\"",
    "Period,\" he tweeted.",
    "We've lost that.\"",
    "Rushmore."
  ]
}