{
  "id": 8535,
  "mediaId": 302,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "Guns, elections and Florida condos make this week's list of highs and lows | Editorial",
  "image": "https://www.tampabay.com/resizer//5dPBlBf3o51oyInG3scc_F28W9M=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/3AKC7VNLTJQMPWI3LGMDNES7SM.jpg",
  "link": "https://www.tampabay.com/opinion/2022/05/28/guns-elections-and-florida-condos-make-this-weeks-list-of-highs-and-lows-editorial/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Secretary of State Cord Byrd, who was at the forefront of some of the most controversial legislation the governor supported, said the state had created enough work for local elections supervisors this election year, but certainly, after the 2022 election, there will be time to contemplate and see what other improvements we can make.",
    "The measure, taken in response to the June collapse of Champlain Towers South in Surfside, north of Miami Beach, which killed 98 people, will better protect the lives and property of more than 2 million condo residents.",
    "This week, the Tampa Bay Rays and the New York Yankees, who have spring training in Tampa, both devoted their Twitter feeds to deploring the violence and calling out the horrific nature of assault weapons.",
    "The slaughter Tuesday of 19 children and two teachers at Robb Elementary School in Texas has sparked a broader awakening in the calls for public safety among several Florida-connected sports teams.",
    "That's why a new report by the Tampa Bay Times showing that just over half of Florida's third-graders performed at or above the passing level on this spring's statewide reading test is so alarming.",
    "The predecessor he succeeded, Laurel Lee, was widely admired for her organizational skills, and the support and lines of communication she maintained with locally-elected supervisors.",
    "The results are essentially the same as a year ago, and to some degree, they reflect the ongoing setbacks from the quarantines and distance-learning forced by the COVID-19 pandemic.",
    "The new law requires that condos three stories or higher be inspected after 30 years, or after 25 years if within 3 miles of the coast, and re-inspected every 10 years thereafter.",
    "If the DeSantis administration is done fighting with the schools over masks and teachings on race and sexual identity, maybe it can outline a strategy for improving reading.",
    "Marco Rubio and Rick Scott, both Florida Republicans, demanding their support for common sense gun laws  and telling them they can make change at the ballot box.",
    "They are the professionals who actually conduct elections, and who know first-hand how voting hurdles imposed from Tallahassee can suppress the electorate.",
    "And having a better picture of the physical condition of these buildings will give buyers, lenders and insurers more certainty, buffering the condo market.",
    "The members of the Editorial Board are Editor of Editorials Graham Brink, Sherri Day, Sebastian Dortch, John Hill, Jim Verhulst and Chairman Paul Tash.",
    "Ron DeSantis signed into law on Thursday, comes only months after the Florida Senate derailed a similar measure in the regular legislative session.",
    "But there also could be sticker-shock in the offing, especially for midlist condos whose residents are stretched from owning a piece of paradise.",
    "Byrd should look, listen and learn, and work to make Florida's elections in 2022 and beyond at least as smooth and orderly as before he got here.",
    "The teams collaborated to use their reach on social media to offer facts on the impacts of gun violence, which they rightly called intolerable.",
    "The Rays also announced a $50,000 donation to Everytown Gun Safety's Support Fund, the largest gun violence prevention organization in America.",
    "Thanks to a well-deserved political backlash, the Florida Legislature reversed course this week and approved a new condominium safety bill.",
    "A child who can't read by third grade faces a challenging time in continuing his or her education, and improving their lot in life.",
    "The Florida Department of Education released the information to school districts Wednesday, and included school-by-school scores.",
    "Ron DeSantis recently appointed as Florida's top elections official said this week that more voting changes may be on the way.",
    "Subscribe to our free Stephinitely newsletter\nEditorials are the institutional voice of the Tampa Bay Times.",
    "Rubio, who is up for re-election this fall, got bent of out shape, lambasting the politicizing of a tragedy.",
    "Statewide, 53% of third-graders scored at or above Level 3, considered a satisfactory or passing mark.",
    "Starting in 2025, condo associations will have to set aside money in reserves to cover future repairs.",
    "This year, 25% of third-graders earned a Level 1 statewide, the lowest score on the five-level range.",
    "The Legislature needs to explore new financing tools to help these condos afford necessary repairs.",
    "Byrd is wholly unqualified for this job, and the more he stays out of the way, the better.",
    "This is a long overdue step in confronting years if not decades of deferred maintenance.",
    "But it shouldn't backtrack on this promising step to improve condo safety statewide.",
    "These sports teams are lending their influential voices to a commendable cause.",
    "In a pre-game announcement Wednesday, the team urged fans to contact U.S. Sens.",
    "Follow @TBTimes_Opinion on Twitter for more opinion news.",
    "Scores were at that level in 2015, but at 58% in 2019.",
    "It's called free speech by people who've had enough.",
    "The Miami Heat had its say earlier this week.",
    "In other words, the problem pre-dates COVID.",
    "After all, what's 58 percent to cheer about?",
    "The Republican partisan that Gov.",
    "That was down from 54% in 2021.",
    "The bill, which Gov.",
    "Making condos safer.",
    "Johnny can't read.",
    "Calling out guns.",
    "Rookie advice.",
    "Improvements?"
  ]
}