{
  "id": 8536,
  "mediaId": 157,
  "date": "5/28/2022 12:00:00 AM",
  "headline": "'Anxious' Trump fears he's losing control of the GOP -- and wants to launch his 2024 campaign this summer",
  "image": "https://www.rawstory.com/media-library/donald-trump.jpg?id=29869608&width=1200&coordinates=0%2C18%2C0%2C36&height=600",
  "link": "https://www.rawstory.com/donald-trump-2024-2657406446/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    661
  ],
  "sentences": [
    "As the Times report states, \"After the first phase of the primary season concluded on Tuesday, a month in which a quarter of America's states cast their ballots, the verdict has been clear: Mr. Trump's aura of untouchability in Republican politics has been punctured.,\" adding, \"The mounting losses have emboldened Mr. Trump's rivals inside the party to an extent not seen since early 2016 and increased the chances that, should he run again in 2024, he would face serious competition.\"",
    "Yet the sense among Republicans that Mr. Trump has lost political altitude is taking hold, including among some of those close to him,\" the Times report continued before adding, \"Numerous Republican strategists have argued that Mr. Trump's continued obsession with the 2020 election is an unwanted distraction in 2022, when Democrats hold the levers of power in Washington and polls show most of the country feels like the nation is moving in the wrong direction.\"",
    "Additionally, the Times reports, Trump's fundraising has slowed with an analysis showing his average daily online contributions have dropped for seven consecutive months\nAs he grows weaker, conservatives are looking for the next horse to bet on with Florida Gov Ron DeSantis (R) leading the pack and former vice president Mike Pence becoming more active.",
    "As the Times' Maggie Haberman and Shane Goldmacher wrote, every time a high profile GOP candidate that the former president endorsed loses, it is a real-time demonstration of his influence waning with conservative voters -- and his enemies within the Republican Party are taking notice.",
    "According to a report from the New York Times, former president Donald Trump is growing increasingly anxious that his grip on the Republican Party is starting to slip away and has begun pushing his aides to be ready to launch his third run for the presidency as early as this summer.",
    "According to the Times, \"...the difficult primary season has added to Mr. Trump's personal anxieties about his standing, after he has sought to fashion himself as something of an old-school party boss in his post-presidency.",
    "What should be concerning to the former president is a former adviser to his first campaign, ex-Rep Jack Kingston (R-GA) admitted to the Times, \"I think a non-Trump with an organized campaign would have a chance.",
    "He has told advisers he wants to declare his candidacy or possibly launch an exploratory committee this summer.\"",
    "\"Most of Mr. Trump's advisers believe he should wait until after the midterm elections to announce a candidacy.",
    "That combination of factors has Trump getting antsy about stealing back the limelight."
  ]
}