{
  "id": 8538,
  "mediaId": 302,
  "date": "5/27/2022 12:00:00 AM",
  "headline": "DeSantis appoints Corcoran to Florida's Board of Governors",
  "image": "https://www.tampabay.com/resizer//uOTn_24MyYMa7MZsrBudA2egeRo=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/B4NDRKTMHBFB5DNOXW5LZBTAOQ.JPG",
  "link": "https://www.tampabay.com/news/florida-politics/2022/05/27/desantis-appoints-corcoran-to-floridas-board-of-governors/",
  "sentiment": "0.0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Like the rest of the nation, Florida's school districts have had to weather some of the greatest difficulties they have ever experienced over the past two years, and I couldn't think of a better governor to serve, Corcoran said in a March 10 statement announcing his resignation from the commissioner post.",
    "During his time at the helm of the state education department, Corcoran was a close ally of DeSantis on contentious issues such as efforts to prevent school districts from enacting mask requirements during the COVID-19 pandemic and to bar critical race theory from public-school curriculums.",
    "The reforms included the state's largest expansion to educational choice opportunities, the Legislature appropriating record funding levels for public education and the launch of a civics and debate initiative for middle and high school students.",
    "Rumors had swirled that Corcoran was angling for a job as president of a state university, as three universities  the University of Florida, Florida International University and Florida Gulf Coast University  currently are seeking new leaders.",
    "The Board of Governors oversees Florida's 12 state universities and is tasked with such responsibilities as adopting regulations designed to carry out state laws related to higher education.",
    "Corcoran also was a key figure in the state's decision to reopen schools in the early days of the pandemic, which DeSantis for the past two years has touted as a major political victory.",
    "Corcoran, a former Republican House speaker, served three years as the state's top education official overseeing Florida's public-school and college systems.",
    "Corcoran's March resignation announcement on the Department of Education's website listed a number of historic education reforms achieved under his tenure.",
    "The firm's website says that it specializes in advising our clients on a wide range of issues, including analyzing U.S. policies in Latin America.",
    "Ron DeSantis on Friday tapped former state education commissioner Richard Corcoran to serve on the state university system's Board of Governors.",
    "Corcoran last summer applied to be president of Florida State University, drawing intense media attention to the school's search for a leader.",
    "In March, Corcoran announced that he would be stepping down as education commissioner at the end of April to return to private life.",
    "DeSantis said the state became an education juggernaut and leader in innovation under the former House speaker's leadership.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nDiaz is set to start as commissioner on Wednesday.",
    "Corcoran, an attorney, is a graduate of Saint Leo University who received his law degree from Regent University.",
    "State Sen. Manny Diaz, a Hialeah Republican, will replace Corcoran as education commission beginning next week.",
    "Corcoran's candidacy drew opposition from faculty members who argued that he was not qualified for the job.",
    "The university ultimately hired Richard McCullough, a former vice provost for research at Harvard.",
    "Since leaving the education post, Corcoran has joined the Continental Strategy lobbying firm.",
    "TALLAHASSEE  Gov."
  ]
}