{
  "id": 8541,
  "mediaId": 136,
  "date": "5/27/2022 12:00:00 AM",
  "headline": "How Police Response Times Compare in School Shootings Since Columbine",
  "image": "https://d.newsweek.com/en/full/2047388/uvalde-school-shooting.webp?w=790&f=3c23e8a14f41a01f1704f866d7f43ac0",
  "link": "https://www.newsweek.com/how-police-response-times-compare-school-shootings-since-columbine-1711038",
  "sentiment": "0.0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Impelli",
  "authorUrl": "https://www.newsweek.com/authors/matthew-impelli",
  "termIds": [
    661
  ],
  "sentences": [
    "Following the timeline laid out by McCraw, Newsweek looked into the time it took police to respond to other school shootings, including Columbine, the 2012 Sandy Hook shooting in Connecticut and the 2018 Marjory Stoneman Douglas High School shooting in Parkland, Florida.",
    "According to reports, the two shooters eventually took their own lives at about 12:08 p.m.\nSandy Hook\nIn 2012, shooter Adam Lanza, 20, killed 20 students and six school employees in Newtown, Connecticut, making it the deadliest school shooting to date.",
    "According to CNN, the report found that officers arrived at the school a little more than two minutes after the initial 911 call was placed at 9:35 a.m. Police were able to enter the school about six minutes after the first officer arrived.",
    "During a press conference on Friday, Texas Department of Public Safety Director Steven McCraw explained that the first 911 call was made at about 11:30 a.m. and Ramos entered the school just a few minutes later at 11:33.",
    "Following Tuesday's shooting, there has been controversy about the response time by police, with some parents indicating that they were angered by the amount of time it took for police to engage Ramos.",
    "Prior to the school shooting this week in Uvalde, Texas, there had been several other similar incidents, such as the 1999 Columbine High School shooting, and the police response has differed in each.",
    "While speaking with KUSA in Denver, Douglas County Sheriff Tony Spurlock, who responded to the Columbine shooting, said this week that some officers addressed the target \"within two minutes.\"",
    "Shortly after the Sandy Hook massacre, many criticized the time it took police to respond, with CNN initially reporting that it took about 20 minutes to arrive after the initial 911 call.",
    "According to McCraw, at about 11:51, a police sergeant arrived and, by 12:03 p.m., there were at least 19 officers in the building, while Ramos barricaded himself in a classroom.",
    "According to a 2018 report from CNN, it took a SWAT team about 47 minutes to enter the high school after the shooting, but several officers were able to respond much quicker.",
    "By 12:15 p.m., officers with the Border Patrol Tactical Unit (BORTAC) arrived at the scene and, by 12:50, officers were able to breach the classroom and fatally shoot Ramos.",
    "However, it was later revealed that the video footage was delayed about 20 minutes, allowing Cruz to escape the school, the South Florida Sun-Sentinel reported in 2018.",
    "Parkland\nOn February 14, 2018, a former student at Marjory Stoneman Douglas High School in Parkland, Florida, 19-year-old Nikolas Cruz, fatally shot 17 people.",
    "However, a report from the Connecticut Police Chiefs Association found that the response by the Newtown Police Department was quicker.",
    "The school's fire alarm was set off at about 2:22 and, by 2:25, the school alerted students of a possible active shooter situation.",
    "The Columbine incident began at about 11:19 a.m. on April 20 and the 13 victims were killed within 13 minutes, according to CNN.",
    "According to the report, the first officer arrived at the scene by 2:32, but Cruz was already attempting to leave the building.",
    "On Tuesday, a mass shooting occurred at Robb Elementary School in Uvalde, leaving 21 victims dead19 children and two teachers.",
    "The report, which was obtained by Police1.com, details the timeline of events, with Cruz firing the first shots at 2:21 p.m.",
    "Following the shooting, a 407-page report and police response was published and presented to Florida Governor Ron DeSantis.",
    "Columbine\nThe 1999 Columbine High School shooting in Littleton, Colorado, left 12 students and one teacher dead.",
    "By 2:38, a team of police entered the school and used video footage to try to find Cruz.",
    "The shooting was carried out by 17-year-old Dylan Klebold and 18-year-old Eric Harris.",
    "All of the victims were killed in a single classroom by 18-year-old Salvador Ramos.",
    "Cruz was eventually apprehended by officers roughly an hour after the killings.",
    "Lanza eventually shot himself after the killings."
  ]
}