{
  "id": 8543,
  "mediaId": 65,
  "date": "d2022-05-27T15:46",
  "headline": "Instagram suspends Libs of TikTok as Big Tech, media continue targeting conservative internet sensation",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/3f770c17-608a-459e-b74f-db051030d8d9/9b2bd40a-7522-4d22-a953-6d8d57b8860c/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/instagram-suspends-libs-tiktok-big-tech-media",
  "sentiment": "0.0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Flood",
  "authorUrl": "https://www.foxnews.com/person/f/brian-flood",
  "termIds": [
    661,
    6167,
    177,
    262,
    525,
    539,
    637,
    3583,
    6128,
    6135
  ],
  "sentences": [
    "The fact that Instagram has no problem with the liberals whose bizarre, often inappropriate and disturbing videos that Libs of TikTok reposted, but they suspend her for drawing attention to those liberals, appears to be another instance of Big Tech censoring those who expose the absurdity of radical progressivism,\" Pushaw told Fox News Digital.",
    "WASHINGTON POST'S TAYLOR LORENZ DOXXES LIBS OF TIKTOK DAYS AFTER DECRYING ONLINE HARASSMENT OF WOMEN\nControversial Washington Post reporter Taylor Lorenz recently came under fire for doxxing Libs of TikTok in a report, revealing her name, occupation, religion and where in the country she lived.",
    "Libs of TikTok has garnered a huge following among conservatives over the past year for sharing videos publicly shared on TikTok showing liberals espousing principles of critical race theory ideology and embracing the broadening spectrums of sexual orientation and gender identity.",
    "\"Considering that LoTT's suspension on Twitter last month earned her a whole boatload of new followers and subscribers, I look forward to even more people seeing what woke ideologues and teachers have to say on a daily basis,\" Not the Bee wrote in a blog post.",
    "\"I have personally been threatened in the past by a leftist account, reported it and nothing has happened  then seen instances where some of my followers will lose their accounts for using the wrong pronouns to describe someone,\" Young continued.",
    "Liberal media outlets and Big Tech platforms have come after the Libs of TikTok accounts, which are on multiple social media platforms  when not suspended  including Facebook, Rumble and YouTube, in addition to Twitter and Instagram.",
    "Many of the people highlighted by Libs of TikTok claim to be teachers who touted their various woke beliefs to their students, which has drawn condemnation from the political right and has fueled the national education debate.",
    "The Libs of TikTok account holder  who plans to appeal Instagram's decision  tweeted a message from Instagram declaring the account was suspended on May 27 and there was a 30-day window to \"disagree with the decision.\"",
    "Internet sensation Libs of TikTok, which often shares videos of left-wing individuals making eyebrow-raising comments, has been suspended from Instagram as the media and Big Tech's war on the account continues.",
    "Radio host Tim Young, who has also used social media to gain prominence and has roughly 600,000 followers between Twitter and Instagram, agrees that social media platforms are biased against conservatives.",
    "\"You never hear about major liberal or Democratic accounts being suspended on social media, only conservatives, which really is the tale of the tape on any story like this,\" Young told Fox News Digital.",
    "LIBS OF TIK TOK RESPONDS TO SECOND TWITTER SUSPENSION HOURS AFTER REINSTATEMENT: 'THE LEFT FEELS THREATENED'\n\"Your account is not visible to people on Instagram, and you can't use it,\" the message said.",
    "\"Big Tech has a tendency to censor those who challenge Silicon Valley dogma, but we hope this was an honest mistake on Instagram's part, and they will restore her account,\" Pushaw continued.",
    "Libs of TikTok has also been repeatedly suspended by social media giant Twitter, where it has 1.2 million followers, and the account holder has also been doxxed by the Washington Post.",
    "Ron DeSantis' press secretary Christina Pushaw, a fan of the account who has publicly defended it, feels Instagram's accounts are simply the latest example of big tech and media bias.",
    "\"There's very clearly a left-leaning bias on social media, anyone with common sense  or even just any level of paying attention sees it  even Elon Musk has recently noted this bias.\"",
    "Not The Bee, the conservative satirical site Babylon Bee's sister publication that posts real news, feels the suspension will only boost Libs of TikTok's profile.",
    "Instagram stated Libs of TikTok's account violated the social media platform's Community Guidelines but didn't elaborate on how the rules were broken.",
    "\"Let's be clear: Libs of TikTok, as the name suggests, simply reposts content that liberals voluntarily and publicly share on social media.",
    "Conservatives panned Lorenz for doxxing Libs of TikTok, arguing none of the details from the report have news value.",
    "Radio host Joe Pagliarulo wrote, \"You are posting unedited videos that are already available to the public.",
    "It appears Instagram is the latest juggernaut to find an issue with the popular social media personality.",
    "If they aren't suspending those who make the originals, how can they suspend you?",
    "Instagram's parent company did not immediately respond to a request for comment.",
    "The @Libsoftiktokofficial Instagram account was not visible on Friday morning.",
    "The person who runs Libs of TikTok said no further explanation was provided.",
    "Fox News' Joseph A. Wulfsohn and Charles Creitz contributed to this report.",
    "We will be appealing,\" the account holder told Fox News Digital.",
    "\"They just said we violated their community guidelines.",
    "However, members of the legacy media defended Lorenz.",
    "Am I missing something?\"",
    "Florida Gov."
  ]
}