{
  "id": 8544,
  "mediaId": 223,
  "date": "d2022-05-27T14:15",
  "headline": "Libs of Tik Tok Kicked Off Instagram",
  "image": "https://media.townhall.com/townhall/reu/ha/2018/296/cc647d59-5fa6-4044-9ed6-f0c34d91b643.jpg",
  "link": "https://townhall.com/tipsheet/madelineleesman/2022/05/27/libs-of-tiktok-kicked-off-instagram-n2607905",
  "sentiment": "0.0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Leesman",
  "authorUrl": "https://townhall.com/tipsheet/madelineleesman/",
  "termIds": [
    661,
    262,
    539,
    3508,
    3583
  ],
  "sentences": [
    "The fact that Instagram has no problem with the liberals whose bizarre, often inappropriate and disturbing videos that Libs of TikTok reposted, but they suspend her for drawing attention to those liberals, appears to be another instance of Big Tech censoring those who expose the absurdity of radical progressivism,\" Pushaw said.",
    "Source: AP Photo/Marcio Jose Sanchez, File\nInternet sensation Libs of Tik Tok, which reposts alarming videos and other content circulated by left-wing individuals, was suspended from the social media platform Instagram this week.",
    "pic.twitter.com/ktRnYDxbly\n Greg Price (@greg_price11) April 24, 2022\n\"And I think it's incredibly important, you know, as someone that covers the influencer industry to know who is exerting influence in this way.",
    "Last month, Townhall covered how Washington Post writer Taylor Lorenz doxxed the owner of the Libs of Tik Tok account, including sharing her full name, location, religion and real estate license.",
    "Ron DeSantis' press secretary Christina Pushaw told Fox News Digital that Libs of Tik Tok's suspension from Instagram is another example of bias from Big Tech.",
    "Taylor Lorenz says that one of the reasons she revealed @libsoftiktok's identity is because \"for all we knew, this could have been a foreign actor.\"",
    "In an interview with CNN shortly after, Lorenz defending doxxing Libs of Tik Tok, claiming that the individual could have been a foreign actor.",
    "\"Let's be clear: Libs of TikTok, as the name suggests, simply reposts content that liberals voluntarily and publicly share on social media.",
    "I mean, for all we knew, this could have been a foreign actor, right, or someone -- we just didn't know,\" Lorenz claimed.",
    "Libs of Tik Tok shared a screenshot of its suspension from Instagram on Twitter to its 1.2 million followers.",
    "Accounts that do not follow Instagram's Community Guidelines are suspended from the platform.",
    "pic.twitter.com/vnUi6rOJYB\n Libs of TikTok (@libsoftiktok) May 27, 2022\nFlorida GOP Gov.",
    "The account's owner had kept their identity anonymous.",
    "BREAKING: @instagram just suspended our account."
  ]
}