{
  "id": 8547,
  "mediaId": 129,
  "date": "d2022-05-27T10:09:42",
  "headline": "The White House pushes to get Paxlovid pills into more Covid patients' hands.",
  "image": "https://static01.nyt.com/newsgraphics/2021/coronavirus-tracking/images/svg/timeseries/USA/USA-cases-two-weeks.svg",
  "link": "https://www.nytimes.com/live/2022/05/27/world/covid-19-mandates-vaccine-cases",
  "sentiment": "0.0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    91,
    133,
    196,
    6093,
    2707,
    2881,
    2945,
    6246
  ],
  "sentences": [
    "The pandemic leveled the playing field with the big monsters that relied more on foot traffic and occasional readers, says Luis Mey, an author who spent years as a bookseller, partly at El Ateneo Grand Splendid, arguably the city's most famous bookstore, which appears regularly in rankings of the world's most beautiful bookstores and is a required stop for tourists.",
    "Ms. Jones had made allegations against four officials: Courtney Coppola, the former chief of staff; Shamarial Roberson, the former deputy secretary; Dr. Carina Blackmore, the director of medical and health services for the division of disease control and health protection; and Patrick Scott Pritchard, a biological administrator.",
    "At ChristianaCare, a Delaware-based hospital group, the supply depletion problem emerged in mid-May, and became a serious issue very quickly, said Dr. Kirk Garratt, the medical director for the group's heart and vascular health center and a former president of the Society for Cardiovascular Angiography and Interventions.",
    "The federal government will start reimbursing a clinic in Providence, R.I., for evaluating patients who test positive and immediately prescribing Paxlovid to those eligible for it  the first of what the White House said would be a series of federally supported sites, with others set to open in New York and Illinois.",
    "Even though the number of books sold in the country has not bounced back to what it was before the recession, according to Fernando Zambra, director of Promage, a consulting firm that tracks the country's editorial sector, the small stores are helping keep publishers and writers in business  and readers in books.",
    "Health officials and doctors worry that the low supply and prolonged waits for tests will exacerbate earlier delays in care caused by the pandemic, when hospitals were overrun with Covid patients, they were facing sizable backlogs to get tests and elective procedures were canceled or postponed for months.",
    "What worries me is that as this virus spreads into other parts of the country that are both less boosted and so far have been using less Paxlovid  whether this phenomenon that we're seeing, of infections not leading to a lot of hospitalizations and deaths, whether that will hold up or not, Dr. Jha said.",
    "Hospitals generally rely on a single supplier for their contrast agents, and many facilities may have only a week or two of supply on hand, says Dr. Matthew Davenport, vice chair of the commission on quality and safety for the American College of Radiology and a professor at Michigan Medicine.",
    "Dr. Jha attributed the more modest death rate to a combination of immunity in part conferred from vaccines, and the success of Paxlovid, which has been found to substantially reduce the chances of severe forms of Covid-19 in high-risk people if it is started early in the course of infection.",
    "WASHINGTON  White House officials said on Thursday that they were introducing new models for distributing Paxlovid, the Covid-19 oral medication made by Pfizer, in an effort to get the treatment to more people and keep coronavirus death rates relatively low even as cases increase.",
    "Because of vague eligibility guidelines that are open to broad interpretation  the medication is authorized for people 12 and older with mild-to-moderate Covid-19 who are at risk of severe illness  some doctors are hesitant to prescribe the pill, or require extensive consultation.",
    "Budget-minded vintage car collectors, competing with Americans who took an interest in the vehicles as a pastime over the last couple of years, have found themselves increasingly priced out of the market for cars that were once considered cheap fun and are now in high demand.",
    "Many locations in the government's test-to-treat program are CVS MinuteClinics with in-house nurse practitioners and physician assistants who can prescribe the drug, a service that requires appointments and can be prohibitively expensive for those without health insurance.",
    "Bracco Imaging, the other producer based in Milan, said in a statement that it was working to deliver supplies even to hospitals that were not customers to shore up use for critical emergency procedures, according to Fulvio Renoldi Bracco, the company's chief executive.",
    "Along the Liangma River, those who still show up to enjoy a few quiet moments under the willow trees are greeted by the ear-piercing blare of security guards and urban-management officers armed with loudspeakers reminding them not to gather and to keep their masks on.",
    "It's true that you can find absolutely everything online, but you're only going to find what you know you're going to look for, explains Vctor Malumin, an editor at Godot, a small publishing house, and co-founder of a popular book fair for independent publishers.",
    "Nancy Foster, the vice president of quality and patient safety policy for the American Hospital Association, a trade group in Washington, likened the situation to the short supply of oxygen, among other treatment machines and remedies, during the pandemic.",
    "Rick Johnson, a lawyer for Ms. Jones, noted that the inspector general could not prove or disprove her two main allegations: that Dr. Roberson directed falsification of data and that Ms. Coppola pressured Ms. Jones to falsify coronavirus positivity rates.",
    "Significant obstacles persist in getting Paxlovid to everyone who could benefit from it; more than a million courses of Paxlovid purchased by the government are still available, according to data collected by the Department of Health and Human Services.",
    "Yet even though GE Healthcare said this week that the situation was improving now that the plant had reopened, the shortages and patient delays could persist well into the summer because of a lag in how quickly replenished supplies could be distributed.",
    "Many patients are still handling the sometimes-cumbersome steps on their own: locating a virus test, then securing a Paxlovid prescription from a health provider, then finding a pharmacy that carries the pill, all within days of first showing symptoms.",
    "It's slow up hills, but it's a total mountain goat off-road, Ms. Woodward said, noting that the tagline in 1980s advertisements called the Montero the urban gorilla, effectively presaging the transition of S.U.V.s from off-roaders to grocery getters.",
    "Every year when she was growing up, Carime Morales's family would take two days from their winter holidays in Buenos Aires and go shopping for books, largely on Corrientes Avenue, where bookstores, theaters and cafes created a vibrant cultural scene.",
    "Without stringent reporting requirements, the federal government is struggling to understand who is receiving Paxlovid, data that could be key to knowing whether the most at-risk Americans, such as those in nursing homes, are getting the medication.",
    "And her store, Malatesta, became a hit  part of a boom in neighborhood bookstores, which are multiplying and thriving even through Argentina's rigorous pandemic lockdown and a yearslong recession that has ravaged publishing and much of the economy.",
    "Fundamentally, what we're trying to do is get to a point where Covid deaths are largely preventable, and I think we're pretty close to there, Dr. Ashish K. Jha, the White House Covid-19 response coordinator, said in an interview Wednesday evening.",
    "Some simply regarded working from home as a holiday; they went for a stroll, an outdoor workout, or camping in the park, The Beijing Center for Disease Control and Prevention said in an article published on its official WeChat account on Sunday.",
    "Nurit Kasztelan, who in 2009 opened a small bookstore in her home in the Villa Crespo neighborhood (called, fittingly, Mi Casa, or My House), accepts customers only by appointment and prides herself on being able to obtain hard-to-find titles.",
    "In order to get the customer of the big chains interested in something you need to carry out large marketing campaigns, explains Damin Ros, who co-founded the publishing house Blatt y Ros in 2010 and now releases two to three books per month.",
    "On Thursday, the inspector general for the Florida Department of Health, where Ms. Jones used to work, released a 27-page investigative report that found three allegations by Ms. Jones against several health officials were unsubstantiated.",
    "Cory Wade, a classic car dealer in Traverse City, Mich., is also on the hunt for a vintage Montero, and he's finding that the prices of cars in average condition, once around $3,000 to $5,000, have roughly doubled over the last two years.",
    "Based upon an analysis of the available evidence, there is insufficient evidence to clearly prove or disprove the alleged conduct, as described by the complainant, occurred, says the report from Michael J. Bennett, the inspector general.",
    "Dr. Jha said federal officials should begin to get a more detailed picture in the coming weeks from some groups tracking who has received the drug, from the Department of Veterans Affairs, Kaiser Permanente and certain hospital systems.",
    "This hunger for fresh material has been an advantage for the neighborhood booksellers, which have an almost symbiotic relationship with the small publishing houses that have also been cropping up in Buenos Aires in the past two decades.",
    "Michael Ganio, the senior director of pharmacy practice and quality at the American Society of Health-System Pharmacists, said the test-to-treat system was suffering from a lack of federal funding for Covid-19 care for the uninsured.",
    "In the wealthiest nation on Earth, there should be no reason doctors are forced to ration lifesaving medical scans to compensate for a shortage of material, Representative Rosa DeLauro, Democrat of Connecticut, said in a statement.",
    "For a truly fantastic, low-mileage example, the sky is probably the limit at this point, Mr. Wade said, noting that the three-door Montero with a manual transmission is the version that now has the highest demand among collectors.",
    "The small shops are sprouting where their readers are, in residential areas, keeping alive the rich literary scene that made Buenos Aires, Argentina's capital, one of the cities with the most bookstores per capita in the world.",
    "The appeal of the Defender is broad  typically, Barbour-jacket-wearing millennial binge watchers of The Crown seem to want one as much as boomers who remember the zebra-stripe Land Rovers from the corny 1960s TV show Daktari.",
    "As scenes of people relaxing along the river  which Chinese state media has compared to Paris's Seine  began to get attention from social media, passers-by and city officials, new restrictions emerged to snuff out the fun.",
    "The 91-inch and 109-inch wheelbases effectively mimicked the proportions of the classic Land Rover Defender, and the Montero gained significant fame in the 1980s, with seven consecutive wins in the brutal Dakar Rally.",
    "The shortage of a vital imaging agent is the latest example of the country's vulnerability to disruptions in the global supply chain and its overreliance on a small number of manufacturers for such critical products.",
    "But a nationwide shortage of the imaging agents needed for the procedure  the result of the recent lockdown in Shanghai to quell a Covid outbreak  has prompted hospitals to ration these tests except in emergencies.",
    "In addition to using contrast with a CT angiogram to determine whether patients have a blood clot or internal bleeding, doctors often rely on CT scans with contrast to spot infections, bowel blockages or cancers.",
    "If one needs any more confirmation that the ship has sailed for Montero seekers, it's the fact that a professional trend watcher, Brian Rabold, vice president of vehicle intelligence for Hagerty, just bought one.",
    "After having to close our Shanghai manufacturing facility for several weeks due to local Covid policies, we have been able to reopen and are utilizing our other global plants wherever we can, the statement read.",
    "The scene on Corrientes Avenue, which peaked in the mid-1980s and 1990s, after the end of Argentina's military dictatorship, lost more of its luster as the downtown emptied and several larger bookstores closed.",
    "The median value of a collector car in good condition soared 20 percent in January from a year earlier, and another 4 percent in the first three months of this year, according to Hagerty, a specialty insurer.",
    "His doctors recommend using a CT scan with contrast, imaging that relies on a special dye often injected into patients to better visualize their blood vessels, intestines and organs like the kidney and liver.",
    "In 2020, a former health data analyst in Florida became something of a cause clbre when she claimed that she had been fired from her government job for refusing to suppress coronavirus data from the public.",
    "The small operations have found they can thrive in Buenos Aires despite the hard times, because Argentina's capital concentrates a mass of readers that those in the industry say is unique in Latin America.",
    "After city officials earlier this month ordered residents of the upscale Chaoyang district not to venture to the other parts of the city, crowds began to gather along the river to picnic, drink and dance.",
    "But if a patient enters the emergency room and is sweating, with severe chest pain, an angiogram requiring contrast dye is immediately ordered to determine whether the person is suffering a heart attack.",
    "We continue to be concerned about the impact of the delayed, deferred or ignored screening over the last few years, said Dr. William Dahut, the chief scientific officer for the American Cancer Society.",
    "Epidemiologists familiar with the state's statistics have not found evidence of widespread problems with Florida's numbers, despite the sometimes confusing changes in how the data was being reported.",
    "It's a tongue-in-cheek response to the question of what to buy when a coveted car has appreciated beyond reach, an all-too-frequent occurrence during this period of wild appreciation in their hobby.",
    "And once word gets out, as it inevitably does quickly in the old-car world, spikes in demand for the second-stringer send prices sailing, which starts the substitute-seeking process all over again.",
    "But recently, even gathering outdoors has been restricted, and the indoor spaces that remain open, like supermarkets and convenience stores, require proof of a recent health screening before entry.",
    "Until recently, vintage Montero owners could steal the look and appeal of a classic Land Rover, and get an arguably better vehicle, for less than 10 percent of the price of the cheapest Defender.",
    "The company also said it was distributing the dye to hospitals based on their historical supply needs, which doctors said could prevent large hospital systems from stockpiling excessive amounts.",
    "Dr. Jha said Northeastern states, places that already had higher rates of vaccination, were using more Paxlovid, and acknowledged that other places in the country could have different outcomes.",
    "But the classic Jeep CJs, Land Rovers and vintage Mercedes G-Class, or Gelndewagen, had become frightfully expensive once her spare time and disposable income reached some kind of equilibrium.",
    "The hits just keep on coming in this pandemic in the supply chain, said Dr. Jamie McCarthy, the chief physician executive at Memorial Hermann Health System, a large hospital group in Houston.",
    "As of Wednesday, the United States was averaging more than 110,000 new coronavirus cases each day, according to a New York Times database, about a 30 percent increase over the last two weeks.",
    "He said that while the federally supported test-to-treat idea was limited in its reach, it could function as an important example for state and local officials to implement similar programs.",
    "We have the same books as everybody else, but the key is we don't display the same books, said Ana Lpez, who runs Suerte Maldita, a 400-square-foot bookstore in the neighborhood of Palermo.",
    "Earlier this month, when officials closed gyms and shopping malls, banned dining in restaurants and ordered people in some parts of the capital to work from home, residents moved outside.",
    "Testifying before a Senate committee on Thursday, Dr. Robert Califf, the commissioner of the U.S. Food and Drug Administration, said the shortage of contrast media was just unbelievable.",
    "GE Healthcare said in a statement on Monday that its supply of iodinated contrast media products was increasing, although it did not provide an estimate for when the shortage would end.",
    "The shortage does not affect people undergoing mammograms and screenings for lung cancer because they do not require the imaging agents, and some patients may be able to have an M.R.I.",
    "The report also exonerated officials whom Ms. Jones had accused of directing her to restrict public access to some virus data, though no criminal conduct was alleged to have occurred.",
    "Bookstores just keep opening, said Cecilia Fanti, who opened the Cspedes Libros bookstore in August 2017 and expanded it to a larger location three years later to keep up with demand.",
    "And those stores  with their smaller staffs, cheaper rents and nimble social media presence  suddenly found themselves with a distinct comparative advantage over larger chain stores.",
    "Still, with confirmed cases surging and more awareness and availability of Paxlovid, prescriptions have exploded in recent weeks, with 25,000 to 30,000 written daily, Dr. Jha said.",
    "The latest example in that cycle of substitutes is the first-generation Mitsubishi Montero, which has become a stand-in for people priced out of buying an old Land Rover Defender.",
    "Explaining why elective procedures were being delayed, he added: We feel we have to make this change now to ensure we have a supply so we can keep doing the urgent care we need.",
    "Although online book sales also soared during the lockdown, the small neighborhood bookstores offered something point-and-click retailers couldn't: thoughtful recommendations.",
    "Beijing residents may be in for even tighter restrictions, with Vice Premier Sun Chunlan calling on Monday for tougher measures, according to the state-run Xinhua News Agency.",
    "Argentina may always be in crisis but there are a lot of readers, said Cristian De Npoli, author and owner of Otras Orillas, a small bookstore in the Recoleta neighborhood.",
    "The monthslong saga eventually led to a criminal charge against Ms. Jones, who is accused of accessing a state computer system and downloading a file without authorization.",
    "A patient who fails an exercise stress test that may indicate a heart problem but is not in imminent danger is likely to wait for a scan and be treated with medications.",
    "The Shanghai plant shuttered by the lockdown is operated by GE Healthcare, a unit of General Electric and one of two major suppliers of the iodinated contrast materials.",
    "An estimated 50 million exams with contrast agents are performed each year in the United States, and as many as half the nation's hospitals are affected by the shortage.",
    "But Dr. Jha said the current gulf between infection and death rates across the country amounted to a promising moment in the pandemic, when Covid-19 can be less deadly.",
    "For old-car enthusiasts now priced out of the vintage Montero market, Mr. Wade, the car dealer, has advice on a potential substitute: I really like early Toyota RAV4s.",
    "But for now, said Zambra, the editorial consultant, the rise of small bookstores shows that the book can still be a prosperous business, particularly in Buenos Aires.",
    "Senator Patty Murray, Democrat of Washington, is pressing the agency to see what steps it is taking to address the shortage, according to a statement from her office.",
    "She is running for Congress as a Democrat in Florida's First Congressional District, in the Panhandle, where the incumbent is Representative Matt Gaetz, a Republican.",
    "Ms. Woodward, who has spent more than a few hours in classic Defenders, said that the Montero was their equal off-road and that there's the added fun of reliability.",
    "We are working around the clock to expand production and return to full capacity as soon as possible and in line with local authorities in China, the company said.",
    "Noting that some members of Congress had recently suffered serious illnesses, he added: Someone with a stroke or heart attack wouldn't be able to get an angiogram.",
    "Three hundred more locations now qualify as test-to-treat sites than a month ago, and nearly 40,000 pharmacies and other locations now carry the antiviral pills.",
    "Federal health officials have continued to warn of the risks to especially vulnerable people, pleading with older Americans to stay up-to-date on vaccinations.",
    "It also said it had taken other steps like increasing production of the products at its plant in Cork, Ireland, and flying some shipments to the United States.",
    "Nearly every flavor of classic Defender is valuable in the United States, but those made for the American market in 1995 and 1997 can be worth up to $200,000.",
    "On Thursday, the Beijing CDC sent a message to people's phones: From now on, residents who work from home, please don't gather, visit, travel or get together.",
    "It's a financial term that has been appropriated, and somewhat inaccurately applied, by entry-level vintage car shoppers  those with about $25,000 to spend.",
    "The growth in the number of small bookstores has thus facilitated the emergence of even smaller publishing houses, which may have print runs as low as 300.",
    "The tightening measures in Beijing are intended to prevent the embarrassment of a second Chinese megacity enduring a full-blown lockdown, as Shanghai has.",
    "Sure, if someone asks for the latest best seller I can get it for them, but it isn't what I choose to display, which includes a lot from small publishers.",
    "But that is believed to be a significant undercount, since Americans are increasingly relying on at-home tests and their cases are often going unreported.",
    "Then about two years ago, while walking in the Los Angeles area, she encountered an appealingly rectilinear 1987 Mitsubishi Montero parked in a driveway.",
    "Not coincidentally, the Montero's abilities and more-than-passing resemblance now make it the target of collectors who can no longer afford a Defender.",
    "For health care workers, for whom supply shortages and the pandemic have been so relentlessly taxing, it feels like a never-ending marathon, she said.",
    "After more than a decade in the business, she said, she felt necessary again when the country went on lockdown and sales in her tiny bookstore soared.",
    "We are seeing supply chains break down because of consolidated industries experiencing manufacturing shortages and offshoring American jobs to China.",
    "The lack of contrast dye in an exam can make it more difficult to diagnose cancer, he said, and can make it harder to see if a treatment is working.",
    "To their surprise, buyers are finding that the cheaper substitute can, in many ways, turn out to be the equal of the more established collectible.",
    "The pandemic hurt economies around the world, but Argentina was already deep in crisis when it hit: 2020 was its third straight year of recession.",
    "Publishing, like other industries, had been suffering for years, and took a further hit when Argentines went into a severe lockdown in March 2020.",
    "Federal workers are also being sent to state-run testing sites in Minnesota, transforming them into test-to-treat locations, the White House said.",
    "Whether Buenos Aires's reading culture is strong enough to sustain the current boom of small bookstores, and publishers, is an open question.",
    "At Memorial Hermann, the system has throttled back its use of contrast for elective procedures, Dr. McCarthy said, to preserve its supplies.",
    "The print runs for independent publishers usually range from 500 to 2,000 copies, compared with upward of 10,000 for the larger publishers.",
    "Patients who overlooked troubling new symptoms or could not get follow-up appointments have suffered deteriorating health in many cases.",
    "More than 182,000 prescriptions for oral antiviral medications were filled last week, the White House said in a news release Thursday.",
    "Dr. Jha described being frustrated by physician colleagues who have told him they still limit Paxlovid to patients 65 years and older.",
    "Morales's store was such a success she had to give up her work as a freelance editor to dedicate herself to selling books full time.",
    "Pharmacists still cannot prescribe the medication themselves, a step that would cut the time it takes patients to secure the drug.",
    "I don't think it's possible for the federal government to stand up enough of these to ensure equitable access nationwide, he said.",
    "Less plush and less powerful, 1980s Defenders built for the European market had been available for under $20,000 until recently.",
    "She dropped a case she had filed against the state after police officers raided her home during their criminal investigation.",
    "We need to figure out how to really create a much more robust, not as lean, supply system that has some give to it, she said.",
    "She has also introduced legislation, with Senator Richard Burr, Republican of North Carolina, to strengthen the supply chain.",
    "Wooden platforms where people had congregated along the riverbanks were cordoned off with lengths of steel and security tape.",
    "Some are reserving much of their supply on hand for use in emergency rooms  where quick, accurate assessments are most dire.",
    "He has been hospitalized, and his doctors have tried everything including antibiotics, antacids, even removing his appendix.",
    "He likens the situation to the current scarcity of baby formula, where only a handful of companies serve a critical market.",
    "A small store can curate its offerings more narrowly, booksellers said, and feature books that don't make it to big stores.",
    "The city of 22 million reported a couple of dozen Covid cases on Friday, and the number has been declining for a few days.",
    "My hope is that we're going to see a lot of data in the next couple of weeks from a bunch of these organizations, he said.",
    "Conditions appear to be stabilizing in some Northeastern states that were among the first to see a spring surge in cases.",
    "GE Healthcare said the plant was operating at 60 percent capacity and would be at 75 percent within the next two weeks.",
    "The inspector general's report does not address those claims, made after Ms. Jones had left the Department of Health.",
    "Monteros, on the other hand, wear their Japanese ruggedness and engineering on their comically oversize door mirrors.",
    "Ms. Jones had said she had refused to manipulate data to show that rural counties were ready to end virus lockdowns.",
    "cited rising cases and hospitalizations in strengthening its second booster recommendation for people 50 and older.",
    "The Liangma River, a final refuge for people who want to spend time outside their homes, has become a battleground.",
    "For bookish Porteos, as the residents of Buenos Aires are known, that personal connection makes all the difference.",
    "earlier this month, and it said it was working closely with manufacturers to help minimize the impact on patients.",
    "In the months after her firing for insubordination, Ms. Jones at times claimed that Florida hid Covid death data.",
    "Patients could be in a situation where clinical decisions are going to be negatively impacted, Dr. Dahut said.",
    "But with Porteos confined to their neighborhoods for much of 2020, they turned to the small bookstores nearby.",
    "Now, entering popular sections along the river requires scanning health codes that reveal people's Covid risk.",
    "The analyst, Rebekah D. Jones, filed a formal whistle-blower complaint and turned into a vocal critic of Gov.",
    "for the potential importation of an equivalent agent that had not been approved for use in the United States.",
    "Though still high, case rates have started to level off or decline in New Jersey, New York and Rhode Island.",
    "Beijing, unlike Shanghai, is not under an official Covid-19 lockdown, but it's hard to find anywhere to go.",
    "They devoured noodles on the street, picnicked on sidewalks and played mahjong outside apartment complexes.",
    "But when it came time for Morales to open her own bookstore last year, she didn't even consider Corrientes.",
    "Instead, she opted for Parque Chas, the leafy, residential neighborhood of winding streets where she lives.",
    "Mr. Wade added that Chrysler briefly marketed its own version of this S.U.V., calling it the Dodge Raider.",
    "The daily volume of CT scans being performed with contrast is about half of what it normally is, he says.",
    "Shortly before the for-sale sign on the car sagged out of visibility, she bought the Montero for $2,400.",
    "That could send the message that the government's zero-Covid policies have failed to contain the virus.",
    "There really is an oversaturation of bookstores, particularly in certain neighborhoods, Kasztelan said.",
    "Researchers are also examining cases of symptoms apparently rebounding after taking Paxlovid, he said.",
    "Like most classic British vehicles, old Defenders aren't exactly known for bulletproof dependability.",
    "When other area hospitals began running out of dye, they started sending patients to ChristianaCare.",
    "Lyn Woodward, an automotive journalist, grew up dreaming of boxy, small, off-road-capable S.U.V.s.",
    "It's definitely causing more stress for patients, said Dr. Shikha Jain, an oncologist in Chicago.",
    "I didn't even have time to read, she said, as people started buying four or five books per month.",
    "Like thousands of others in recent weeks, Mr. Quintos cannot get an exam using the contrast dye.",
    "Scarcely remembered by most, the first-generation Montero came in three- and five-door styles.",
    "Unfortunately, this neutral finding is labeled unsubstantiated,' Mr. Johnson said in an email.",
    "We either fix that now, or in a few hours it will be too late to save you, Dr. Garratt said.",
    "Whether they're going to make a change, when and how, etc., is totally in their wheelhouse.",
    "How long and to what extent the shortage will affect patient care is difficult to predict.",
    "So small publishing companies rely on booksellers to get the word out about a new release.",
    "The Food and Drug Administration is looking at this and thinking about it, Dr. Jha said.",
    "The fact you can't figure it out tells me you need more tools to figure it out, he said.",
    "Ms. Woodward put up a brave but ultimately futile resistance to the charms of the S.U.V.",
    "And they aren't just any readers, but readers who are always in search of what's new.",
    "In fact, its off-road reputation is nearly as large as that of the classic Defender.",
    "Predictably, the newfound buzz around Monteros has ratcheted up demand considerably.",
    "There are patients who are getting frustrated because scans are delayed or canceled.",
    "Such behavior, the agency said, increased the difficulty of preventing an outbreak.",
    "New deaths have been at an average of fewer than 400 a day over the past two weeks.",
    "Collectors of average means who want a quirky, fun, Serengeti-ready vintage S.U.V.",
    "Some doctors report more cancer patients with advanced-stage disease as a result.",
    "A few days after people moved on to nearby lawns, that area was blocked off too.",
    "And like Defenders and Monteros, they come in three- and five-door body styles.",
    "The company supplies its dyes, Omnipaque and Visipaque, for the United States.",
    "In a statement, he said that Bracco had also submitted a request to the F.D.A.",
    "Undeterred, however, many buyers are determined to find the next best thing.",
    "Pharmacies can also now order Paxlovid directly from the federal government.",
    "And an alternative may not be enough to determine how to treat his illness.",
    "The neighbors go to buy lettuce and then stop by the store to buy a book.",
    "Small bookstores help you find what you don't know you're looking for.",
    "When they were built, Toyota quality was maybe at its peak, he said.",
    "It is small bookstores that in some way put order to that euphoria.",
    "There is not a lot of redundancy in the system, Dr. Davenport said.",
    "But a neutral finding from DeSantis' own team is as good as a win.",
    "in place of a CT scan or have the exam performed without contrast.",
    "Lawmakers expressed concern about the scarcity of imaging agents.",
    "Deaths from this disease really should become increasingly rare.",
    "Ron DeSantis, a Republican, as the virus surged two summers ago.",
    "I'd expect to get upwards of $25,000 for a really great Montero.",
    "Mr. Quintos, 53, a Chicago resident, has constant stomach pain.",
    "On a recent night, the lights along one bank were switched off.",
    "A nearby security guard said that was meant to limit traffic.",
    "There's really no upper limit to how many miles they'll go.",
    "Malatesta is in the heart of the neighborhood, she said.",
    "Doctors are also delaying some cardiac catheterizations.",
    "But for many others, the shortage leaves them in limbo.",
    "That's something that we, small publishers, don't do.",
    "They're boxy and light, but still relatively rugged.",
    "There is an enormous number of books, De Npoli said.",
    "I really don't know if there are that many readers.",
    "Shortages of the dye were reported to the F.D.A.",
    "The agency declined to comment on the request.",
    "to share more information about the shortage.",
    "The felony case against Ms. Jones is pending.",
    "that she deems as capable as it is adorable.",
    "We're really worried here, Dr. Garratt said.",
    "I still don't feel good, Mr. Quintos said.",
    "Enter the principle of substitution.",
    "It impacted our burn rate, he said.",
    "It was first reported by NBC News.",
    "Their activity didn't decrease.",
    "are out of luck  or are they?",
    "Then a fence was erected.",
    "The group has urged G.E.",
    "Last week, the C.D.C.",
    "No longer."
  ]
}