{
  "id": 8729,
  "mediaId": 136,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Which U.S. States Have Suspended Gas Taxes? Full List",
  "image": "https://d.newsweek.com/en/full/2049544/petrol.webp?w=790&f=709805a219ea8d6767b050a8537d1097",
  "link": "https://www.newsweek.com/which-u-s-states-have-suspended-gas-taxes-full-list-1712027",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darragh Roche",
  "authorUrl": "https://www.newsweek.com/authors/darragh-roche",
  "termIds": [
    661,
    2095
  ],
  "sentences": [
    "The price of gas has reached new record highs in recent weeks, and on Monday, Memorial Day, the cost of a gallon of regular gasoline reached $4.62 - 44 cents higher than the previous month and $1.57 higher than the $3.05 per gallon average on Memorial Day 2021.",
    "Several states have taken steps to suspend their gas taxes as the price per gallon has continued to climb amid the highest inflation rate in nearly 40 years and the Russian invasion of Ukraine.",
    "There have previously been similar efforts or proposals in other states, including Alaska, Illinois, Minnesota and Virginia, but no legislative steps have yet been taken on the issue.",
    "The American Automobile Association (AAA) reported that the average national price for a gallon of gas was more than $4.67 on Tuesday, with prices higher in some states than others.",
    "Georgia\nGovernor Brian Kemp signed a new bill on March 18 that suspended the state's excise on the sale of motor fuels including gasoline, diesel and some other forms of fuel.",
    "California Governor Gavin Newsom has proposed issuing debit rebate cards worth $400 each for each vehicle that a person owns, with a limit of two per person.",
    "The Michigan state senate approved four bills last week that would suspend gas taxes this summer, beginning on June 15 and continuing until September 15.",
    "State lawmakers approved a budget in April that will suspend an 8 cents per gallon motor fuel tax and an 8 cents per gallon sales tax.",
    "Connecticut\nConnecticut lawmakers approved a bill to suspend the state's 25 cents per gallon gas tax for retail customers on March 23.",
    "That legislation suspended the state's 36.1 cents tax per gallon on gasoline and the 36.85 cents per gallon tax on diesel.",
    "Florida\nGovernor Ron DeSantis signed a budget in May that includes a one-month fuel tax holiday beginning on October 1.",
    "Maryland\nMaryland was the first state to suspend its gas tax via emergency legislation that took effect on March 18.",
    "Those cards could begin to be distributed as early as July if the state legislature approves the plan.",
    "Plans in Other States\nSeveral other states are considering measures to tackle high gas prices.",
    "Georgia taxes gasoline at 29.1 cents per gallon and diesel at 32.6 cents per gallon.",
    "The tax suspension will take effect on Wednesday, June 1 and run until December 31.",
    "New York\nNew York will soon become the latest state to suspend its gas tax.",
    "The measure was supported by Governor Ned Lamont and began in April.",
    "The measures will now go to the state's House of Representatives.",
    "The action will lower the price of gas by 25.3 cents per gallon.",
    "Here is the list of states that have taken action on gas taxes.",
    "The tax suspension will last until mid-June.",
    "However, the tax suspension ended on May 31.",
    "The suspension lasted 30 days."
  ]
}