{
  "id": 8773,
  "mediaId": 195,
  "date": "6/3/2022 12:00:00 AM",
  "headline": "DeSantis vetoes funds for Tampa Bay Rays practice facility after team tweets on gun control",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/05/164f0667fde647ad96e37a2a558b05a7.jpg?w=2560&h=1440&crop=1",
  "link": "https://thehill.com/news/3510701-desantis-vetoes-funds-for-tampa-bay-rays-practice-facility-after-team-tweets-on-gun-control/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    6382,
    6448,
    176,
    5629,
    6316,
    2661,
    2934,
    6069
  ],
  "sentences": [
    "Ron DeSantis (R) approved a new state budget Thursday, but vetoed funds for a Pasco County baseball practice facility that was to be used by the Tampa Bay Rays, a move that comes shortly after the MLB organization tweeted in support of gun control last week.",
    "DeSantis, an avid supporter of gun rights, vetoed the funding proposed by state Sen. Danny Burgess (R) that was widely expected to be signed into the states budget a week after the Rays showed support for gun control measures.",
    "The team posted about gun control over social media channels on May 26, in the wake of deadly shootings in Uvalde, Texas, and Buffalo, N.Y., in lieu of covering its game against the New York Yankees.",
    "When an assault weapon is used in a mass shooting, it results in six times as many people shot than when other guns are used, the Rays tweeted, citing Everytown, among other facts.",
    "Rays pitcher Brooks Raley is from Uvalde, a town of just 16,000, where 19 elementary school students and two teachers were killed by an 18-year-old gunman.",
    "The Rays partnered with Everytown for Gun Safety, a nonprofit that advocates for gun control and education, to share facts about gun violence.",
    "Obviously growing up there and going to that school, it kind of hits home, Raley said last week, according to The Associated Press.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "DeSantis has not spoken publicly about his decision to veto funding for the practice facility.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Its small and a close-knit community, so its obviously tough.",
    "The Hill has reached out to his office for comment.",
    "Its just a tragedy.",
    "Florida Gov."
  ]
}