{
  "id": 8774,
  "mediaId": 195,
  "date": "6/3/2022 12:00:00 AM",
  "headline": "DeSantis seeks to block transgender youths from transition-related therapies",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/desantisron_022422ap-john-raoux_desantis-1.jpeg?w=980&h=551&crop=1",
  "link": "https://thehill.com/news/state-watch/3510609-desantis-seeks-to-block-transgender-youths-from-transition-related-therapies/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Ron DeSantis this week encouraged the states board of doctors to follow guidance from the DeSantis administration on transition-related therapies for transgender minors, which would limit or eliminate various hormonal, surgical and other procedures.",
    "Available medical literature provides insufficient evidence that sex reassignment through medical interventions is a safe and effective treatment for gender dysphoria, the Agency for Health Care Administration wrote.",
    "DeSantis, a rising conservative star with possible 2024 White House ambitions, has taken a number of actions against transition-related therapies in the months leading up to his run for reelection in November.",
    "The current standards set by numerous professional organizations appear to follow a preferred political ideology instead of the highest level of generally accepted medical science, wrote Lapado in the letter.",
    "Lapado asked the board to review the agencys findings to inform its establishment of a standard of care for transgender minors, emphasizing that surgical and hormonal therapies are complex and irreversible.",
    "State Surgeon General Joseph A. Ladapo told the Florida Board of Medicine in a letter obtained by NBC News that his office found the science supporting these therapies extraordinarily weak.",
    "The same day, DeSantis Agency for Health Care Administration released a report denying Medicaid coverage for puberty blockers, hormone therapies or transgender-related surgeries.",
    "Meanwhile, Alabama passed a law in early May that criminalized hormone therapy and other transition-related therapies for minors who identify as transgender.",
    "During a time when people should be turning to their state health departments for meaningful, science-driven advice, Floridas Department of Health and Gov.",
    "Texas Supreme Court ruled weeks ago that parents in the state could be investigated for the transition-related therapies they provide to their children.",
    "The truth still matters and the evidence is clear: denying trans youth the ability to transition is dangerous, abusive, and life-threatening.",
    "Transgender advocacy organizations like the Human Rights Campaign have criticized the Florida Department of Healths research as inaccurate.",
    "Bill Lee (R) signed a bill in early May to block transgender people from playing on sports teams corresponding to their gender identities.",
    "The agency referred to these procedures as experimental and investigational with the potential for harmful long term affects.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "Ron DeSantis have used it as a mouthpiece for dangerous disinformation, the organization wrote.",
    "Transgender health care has become a contentious topic, particularly in red states.",
    "Florida must do more to protect children from politics-based medicine.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The office of Florida Gov.",
    "Tennessee Gov."
  ]
}