{
  "id": 8776,
  "mediaId": 302,
  "date": "6/3/2022 12:00:00 AM",
  "headline": "DeSantis vetoes several education items before approving Florida budget",
  "image": "https://www.tampabay.com/resizer//0JQk4L1nGgvOlAhTEJeITiwHPds=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/Z3FX32WR2VJQPEWN6J3TL4LM64.jpg",
  "link": "https://www.tampabay.com/news/education/2022/06/03/desantis-vetoes-several-education-items-before-approving-florida-budget/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "In an emailed statement, Hillsborough County school superintendent Addison Davis said he appreciated the decision by DeSantis to ensure that teachers, support staff, and school-based leaders who demonstrate academic improvements within their schools through the states school recognition criteria will not be penalized due to our districts decision to protect our community.",
    "They said the $200 million in funds for schools that meet grading benchmarks would be limited to those in districts that put parents first and complied with the health departments emergency orders on facial coverings.",
    "He instructed the Department of Education to ignore language that would have left schools in 12 districts unable to receive a portion of $200 million in recognition funding based on their student test scores.",
    "The governor reiterated his stance in a Thursday letter to education commissioner Manny Diaz Jr., which was unusual because it was essentially a line item veto of wording rather than an appropriation.",
    "Lawmakers used their budget implementing bill to penalize a dozen school districts that imposed mask mandates in fall 2021 against the rules and guidelines set forth by the DeSantis administration.",
    "The letter cited state law, saying the recognition money is intended for schools, and that those that have earned it should not be denied the funds because of a decision their district made.",
    "Ron DeSantis took up Floridas largest spending bill in history on Thursday, touting its inclusion of more money for teacher raises, per-student funding and other education-related measures.",
    "Coronavirus concerns: Volusia and Flagler county schools ended the academic year with 176% more reported COVID-19 cases as the year before, the Daytona Beach News-Journal reports.",
    "Security: The Palm Beach County school district is looking into adding a new emergency alert system that gives all employees quick access to panic buttons, WPTV reports.",
    "Race relations: Three Duval County families said they plan to sue their school over allegations of racial discrimination against their children, WTLV reports.",
    "A Nassau County high school will get a new principal after the previous leader was criticized for his handling of a race-related incident, WJXT reports.",
    "Arts education: More than 4,000 Miami-Dade County students participated in a two-year pilot project designed to teach them more about music.",
    "Every Thursday, get the latest updates on whats happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "Every Thursday, get the latest updates on whats happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "Student discipline: The Jackson County school district is adjusting its rules on students who bring alcohol to school, WMBB reports.",
    "During session, he said he did not support punishing schools, but agreed with holding administrators accountable for their actions.",
    "Hillsborough County was among those that stood to lose millions, most of which usually goes toward teacher and staff bonuses.",
    "They included programs aimed at recruiting new teachers to low-income communities and projects throughout the Tampa Bay area.",
    "DeSantis also took the unusual step of striking wording from the Legislatures budget implementation bill that he questioned.",
    "DeSantis said teachers across the state did an admirable job under unprecedented circumstances and should not be excluded.",
    "DeSantis did not fund recognition awards for schools in 2020, when the state did not test students or issue school grades.",
    "Stormy weather: School goes on in South Florida despite threats of the first storm of hurricane season, WFOR reports.",
    "DeSantis instructed the Department of Education, which administers the recognition funds, to ignore the legislation.",
    "At the same time, though, he targeted several school spending items as he announced billions of dollars in vetoes.",
    "After years of problems, Broward County schools appear to be getting security right, the Sun-Sentinel reports.",
    "The State Board of Education levied financial penalties against school board members in the dozen counties.",
    "Ron DeSantis on Thursday rejected the Florida Legislatures approach to school recognition awards this year.",
    "The idea started during World War I, when the Salvation Army sent volunteers to bring meals to the troops.",
    "But Pasco County schools superintendent Kurt Browning wanted everyone to know he wont seek a fourth term.",
    "Lawmakers had sought to penalize those districts because they flouted the states emergency mask rules.",
    "Officials talked about lessening the penalty for a first-time offense, but principals objected.",
    "Additional reports from Tallahassee Democrat, Politico Florida, Florida Politics.",
    "Before you go ... Did you know the first Friday of June is National Donut Day?",
    "Other hot topics\nSuperintendent turnover: The election is two years away.",
    "Times Staff Writer Marlene Sokol contributed to this report.",
    "Now they can jam, the Miami Herald reports.",
    "Along with billions in budget vetoes, Gov.",
    "Yesterdays roundup is just a click away.",
    "Sign up for the Gradebook newsletter!",
    "Donut Day became established in 1938.",
    "Sign up for the Gradebook newsletter!",
    "Read more about the budget here.",
    "Lawmakers pushed for more.",
    "Click here to sign up.",
    "Click here to sign up.",
    "The big story: Gov.",
    "Dont miss a story.",
    "Mmmmmm, donuts."
  ]
}