{
  "id": 8777,
  "mediaId": 169,
  "date": "6/3/2022 12:00:00 AM",
  "headline": "\"Disturbing\" GOP blitz: DeSantis orders trans care ban, Ohio GOP wants genital inspectors in school",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2021/08/ron-desantis-0817211.jpg",
  "link": "https://www.salon.com/2022/06/03/disturbing-blitz-desantis-orders-trans-care-ban-ohio-wants-genital-inspectors-in-school/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    661,
    6365,
    6438,
    348,
    379,
    428,
    6252,
    2661,
    2845
  ],
  "sentences": [
    "\"Across our country, female athletes are currently losing championships, scholarship opportunities, medals, education and training opportunities and more to discriminatory policies that allow biological males to compete in girls' sports,\" said state Rep. Jena Powell, a Republican who pushed the measure.",
    "\"Even as they've shrunk as part of the population, [white evangelicals] are still showing up to vote in disproportionate numbers,\" Geoff Wetrosky, campaign director for the Human Rights Campaign, told the outlet, \"in much higher numbers of their proportion of the population.\"",
    "\"While some professional organizations, such as the American Academy of Pediatrics and the Endocrine Society, recommend these treatments for 'gender affirming' care, the scientific evidence supporting these complex medical interventions is extraordinarily weak,\" he wrote.",
    "\"It's unconstitutional for the government to step in and deprive youth  and especially trans youth  of getting the necessary medical care they need,\" Tampa psychologist Gary Howell told NBC News, arguing the directive \"interferes with the rights of parents.\"",
    "The Florida Health Department directed the state Board of Medicine, which regulates doctors, to effectively ban certain \"pharmaceutical, non-pharmaceutical, and surgical treatments for gender dysphoria\" for children and adolescents.",
    "The state Agency for Health Care Administrators also issued a 46-page report hours earlier justifying banning Medicaid coverage for transgender youth and adults for puberty blockers, hormone therapies or gender-reassignment surgery.",
    "The moves signaled the latest push in the Republican assault on trans health care and allow DeSantis, a rumored 2024 Republican presidential contender, to ramp up his state's crackdown without having to go through the legislature.",
    "Florida Surgeon General Joseph Ladapo in his letter questioned the science and safety of hormone therapies, puberty blockers and gender-assignment surgery and asked the Board of Medicine to \"establish a standard of care.\"",
    "A federal judge last month blocked an Alabama law that banned puberty blockers and hormones for minors, though he left in place a ban on gender-affirming surgeries, which doctors have not performed in the state.",
    "\"This is truly bizarre medically and nonsensical, but looking at it practically, this bill means that if anyone decides to question a child's true gender, that child must undergo a sensitive exam,\" she added.",
    "The Republican-dominated Ohio House late Wednesday night approved a measure requiring genital inspections to prevent transgender female athletes from participating in girls' sports, according to WEWS-TV.",
    "Experts told The 19th that Republicans attacking trans rights are trying to appeal to evangelical voters ahead of a critical midterm cycle even as a majority of voters oppose anti-trans GOP legislation.",
    "A group of 300 Florida health professionals slammed the surgeon general, accusing him of cherry-picking and misreading data to \"come to the wrong conclusions and endanger transgender youth.\"",
    "Republicans at the last minute inserted language into an unrelated bill that requires a \"verification process\" of inspecting genitals of those \"accused\" or \"suspected\" of being trans.",
    "But the Texas Supreme Court allowed state officials to investigate parents and doctors for potential child abuse if their children receive transition-related medical treatment.",
    "A group of Congressional Republicans last month introduced what they called a \"women's bill of rights,\" that defines \"man\" and \"woman\" on the basis of biological sex.",
    "DeSantis, who also signed the controversial \"Don't Say Gay\" bill earlier this year, said in April that he aims to sign a ban on transition-related care for minors.",
    "Kevin Stitt last month signed into law a ban requiring K-12 students to use bathrooms and locker rooms that match the gender listed on their birth certificates.",
    "At least 21 candidates and political committees have spent at least $4.5 million on ads in 16 states attacking transgender rights, according to NBC News.",
    "There is only one transgender girl in the state that is participating in high school sports, according to the Ohio High School Athletic Association.",
    "Howell said that doctors are not prescribing hormones or puberty blockers without safeguards in place and surgeries for minors are incredibly rare.",
    "Ron DeSantis' administration on Thursday moved to ban transition-related care for transgender minors, according to a letter obtained by NBC News.",
    "Ladapo previously issued guidance last month contradicting federal recommendations and advising against transgender treatments for minors.",
    "\"There's a concerted effort in society to push these kids in to do some type of medical intervention,\" he claimed in a podcast interview.",
    "Florida was also one the first states to ban transgender women and girls from participating in women's sports.",
    "\"This is not a real problem,\" state Rep. Rich Brown, a Democrat, said during a debate on the bill.",
    "\"I struggle to understand why we keep discussing bills focusing on children's genitals,\" she said.",
    "Rep. Beth Liston, a Democrat and a physician, said the genital inspections were \"disturbing.\"",
    "Eric Holcomb's veto to ban transgender women and girls from participating in girls' sports.",
    "A growing number of states have targeted transgender athletes, including Ohio Republicans.",
    "Republican-led states have repeatedly passed legislation targeting transgender students.",
    "Republican candidates running in 2022 have also focused on the issue in campaign ads.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "\"This is a made-up, 'let's feed red meat to the base' issue.\"",
    "Indiana Republicans last month overrode Republican Gov.",
    "Subscribe to our morning newsletter, Crash Course.",
    "Health professionals pushed back on the guidance.",
    "Oklahoma Gov.",
    "Florida Gov.",
    "Read more:"
  ]
}