{
  "id": 8780,
  "mediaId": 18,
  "date": "6/3/2022 12:00:00 AM",
  "headline": "Judge rules against Florida on felons paying fines to vote",
  "image": "https://www.bostonherald.com/wp-content/uploads/2020/05/AP20146009238981.jpg?w=1024",
  "link": "https://www.bostonherald.com/2020/05/25/judge-rules-against-florida-on-felons-paying-fines-to-vote/",
  "sentiment": "0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.bostonherald.com/author/associated-press/",
  "termIds": [
    661,
    4563,
    428,
    3122,
    2661,
    2926
  ],
  "sentences": [
    "The case, Kelvin Jones vs. Ron DeSantis, consolidates five lawsuits filed by advocates of disenfranchised felons, including the American Civil Liberties Union, the Brennan Center and the National Association for the Advancement of Colored People.",
    "TALLAHASSEE, Fla.  A Florida law requiring felons to pay legal fees as part of their sentences before regaining the vote is unconstitutional for those unable to pay, or unable to find out how much they owe, a federal judge ruled.",
    "Hinkle ordered the state to require election officials to allow felons to request an advisory opinion on how much they owe  essentially placing the burden on elections officials to seek that information from court systems.",
    "A further complication is determining the exact amount in fines and other kinds of legal fees owed by felons seeking the vote  by some estimates it would take elections officials several years for those pending now.",
    "The case could have deep ramifications in the crucial electoral battleground given that Florida has an estimated 774,000 disenfranchised felons who are barred because of financial obligations.",
    "The judge called the Florida rules a pay to vote system that is unconstitutional when applied to felons who are otherwise eligible to vote but are genuinely unable to pay the required amount.",
    "It involves a state law to implement a 2016 ballot measure approved by voters to automatically restore the right to vote for many felons who have completed their sentence.",
    "The Republican-led legislature stipulated that fines and legal fees must be paid as part of the sentence, in addition to serving any prison time.",
    "This is a tremendous victory for voting rights, Julie Ebenstein, senior staff attorney with ACLUs Voting Rights Project, said in a statement.",
    "If theres no response within three weeks, then the applicant should not be barred from registering to vote, the ruling said.",
    "Hinkle has acknowledged he is unlikely to have the last word in the case, expecting the administration of Republican Gov.",
    "The court recognized that conditioning a persons right to vote on their ability to pay is unconstitutional.",
    "The 125-page ruling was issued by U.S. District Court Judge Robert Hinkle in Tallahassee.",
    "Ron DeSantis to launch an appeal."
  ]
}