{
  "id": 8786,
  "mediaId": 18,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "Disney, SeaWorld announce plans for Florida parks to reopen",
  "image": "https://www.bostonherald.com/wp-content/uploads/2020/05/AP20142788454889.jpg?w=1024",
  "link": "https://www.bostonherald.com/2020/05/27/disney-seaworld-announce-plans-for-florida-parks-to-reopen/",
  "sentiment": "0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.bostonherald.com/author/associated-press/",
  "termIds": [
    661
  ],
  "sentences": [
    "We are developing a series of know before you go communication vehicles and our objective is to reinforce our health and safety messages to guests before they arrive on our property so they are aware and prepared for the new environment, Disneys senior vice president of operations, Jim McPhee told the task force.",
    "FORT LAUDERDALE, Fla.  SeaWorld and Walt Disney World will reopen in Orlando, Fla., in June and July after months of inactivity because of the coronavirus pandemic, according to plans a city task force approved Wednesday.",
    "When Disney Springs, a complex of restaurants and shops near Disney World, reopened, the company formed social distancing squads, which McPhee said have been popular with guests.",
    "He said they are a dedicated team of highly energetic and informative cast members who are committed to engaging and inspiring our guests to follow the appropriate guidelines.",
    "DeSantis has said hes eager to get businesses reopened and is expected to approve plans to reopen the theme parks, which are major pieces of Floridas tourism industry.",
    "Both parks said they will require guests and employees to wear face coverings and social distancing will be enforced throughout their properties.",
    "Disney plans a tiered reopening, with Magic Kingdom and Animal Kingdom opening on July 11, followed by Epcot and Hollywood Studios on July 15.",
    "SeaWorld is planning an employee appreciation event on June 10 before opening to the public the next day, said interim CEO Marc Swanson.",
    "He also said the parks would open with limited capacity, but he didnt specify the number of guests who would be allowed in initially.",
    "In a statement, the company said attendance will be managed through a new system that requires advance reservations for park entry.",
    "Earlier this month most of Floridas counties entered a modified Phase 1, reopening restaurants and retail at a limited capacity.",
    "Fireworks shows, character meet-and-greets and parades will be suspended to meet social distancing requirements, McPhee said.",
    "That plan also has been approved by the Orlando task force, which sent its recommendation to the governor.",
    "South Florida, which has been hardest-hit by coronavirus cases, was added to Phase 1 earlier this week.",
    "Disney World also plans smaller, soft openings prior to July 11, but no specifics were provided.",
    "Disney employees will be required to do temperature checks before heading to work, McPhee said.",
    "Guests and employees will also undergo temperature checks before entering the parks.",
    "Last week, Universal Orlando presented its plan to reopen on June 5.",
    "The plan calls for SeaWorld to open to the public on June 11.",
    "The proposals will now be sent to Florida Gov.",
    "Ron DeSantis for final approval."
  ]
}