{
  "id": 8792,
  "mediaId": 302,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "DeSantis overrules lawmakers, rejects penalties for school mask mandates",
  "image": "https://www.tampabay.com/resizer//pyHDmYhsn_dplTdPVriI90R83jg=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/H6WAGDGQ5VAIHCA47OOUW6KANM.JPG",
  "link": "https://www.tampabay.com/news/education/2022/06/02/desantis-overrules-lawmakers-rejects-penalties-for-school-mask-mandates/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "In an emailed statement, Hillsborough County school superintendent Addison Davis said he appreciated the decision by DeSantis to ensure that teachers, support staff, and school-based leaders who demonstrate academic improvements within their schools through the states school recognition criteria will not be penalized due to our districts decision to protect our community.",
    "They said the $200 million in funds for schools that meet grading benchmarks would be limited to those in districts that put parents first and complied with the health departments emergency orders on facial coverings.",
    "The governor reiterated his stance in a Thursday letter to education commissioner Manny Diaz Jr., which was unusual because it was essentially a line item veto of wording rather than an appropriation.",
    "Lawmakers used their budget implementing bill to penalize a dozen school districts that imposed mask mandates in fall 2021 against the rules and guidelines set forth by the DeSantis administration.",
    "The letter cited state law, saying the recognition money is intended for schools, and that those that have earned it should not be denied the funds because of a decision their district made.",
    "Every Thursday, get the latest updates on whats happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "During session, he said he did not support punishing schools, but agreed with holding administrators accountable for their actions.",
    "Hillsborough County was among those that stood to lose millions, most of which usually goes toward teacher and staff bonuses.",
    "DeSantis said teachers across the state did an admirable job under unprecedented circumstances and should not be excluded.",
    "DeSantis did not fund recognition awards for schools in 2020, when the state did not test students or issue school grades.",
    "DeSantis instructed the Department of Education, which administers the recognition funds, to ignore the legislation.",
    "The State Board of Education levied financial penalties against school board members in the dozen counties.",
    "Ron DeSantis on Thursday rejected the Florida Legislatures approach to school recognition awards this year.",
    "Times Staff Writer Marlene Sokol contributed to this report.",
    "Along with billions in budget vetoes, Gov.",
    "Sign up for the Gradebook newsletter!",
    "Lawmakers pushed for more.",
    "Click here to sign up."
  ]
}