{
  "id": 8793,
  "mediaId": 302,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "DeSantis cuts GOP priorities as he approves $110B budget",
  "image": "https://www.tampabay.com/resizer//Ynlt2YCVrLyfLvqK8n4b9hL00kk=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/MEWVDQ647XRLNWY7GYE7SORNZU.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/06/02/desantis-cuts-gop-priorities-as-he-approves-110b-budget/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lawrence Mower",
  "authorUrl": "https://www.tampabay.com/author/lawrence-mower",
  "termIds": [
    661,
    3889,
    4288,
    4577,
    428,
    571,
    3638,
    2851,
    2926
  ],
  "sentences": [
    "In asking the Supreme Court to essentially override the appeals courts stay, however, attorneys for the plaintiffs wrote that the case presents issues of exceeding public importance, implicates provisions of both the Florida and Federal Constitutions, and will evade this (Supreme) Courts jurisdiction if that jurisdiction is not invoked now.",
    "As for Senate President Wilton Simpsons priorities, DeSantis cuts included more than $300 million for land acquisition for water projects intended to help the agriculture industry and seven new positions at the Department of Agriculture and Consumer Services, which Simpson is hoping to lead this year.",
    "Here petitioners (the plaintiffs) ask this (Supreme) Court to intervene in the First District Court of Appeals ongoing consideration of an appeal of an order imposing a temporary injunction, the ruling by Justices Ricky Polston, Carlos Muniz, John Couriel and Jamie Grosshans said.",
    "We exercise that (veto) power very robustly in this budget, not because of legislators necessarily putting pork  there was some pork  but I think it was just because we dont want to be in a situation where were repeating the mistakes of Washington by overspending, DeSantis said.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nThe plaintiffs have scrambled to block the DeSantis-backed plan, as candidate-qualifying for this years elections will be held June 13 to June 17 and primaries will be held Aug. 23.",
    "Smith, who was appointed as a circuit judge by DeSantis, wrote that the plaintiffs had shown a substantial likelihood of proving that the enacted plan (passed by the Legislature) violates the non-diminishment standard of the Fair Districts amendment.",
    "The one-paragraph ruling Thursday came as part of a thicket of legal moves as voting rights groups and other plaintiffs challenge the constitutionality of the DeSantis-backed plan, which lawmakers passed during an April special legislative session.",
    "At stake here is the mandate of 62.9% of Florida voters who voted in 2010 for one of what are commonly known as the Fair Districts Amendments to the Florida Constitution  by any measure of comparison, 62.9% of the vote is an overwhelming margin.",
    "Given this (Supreme) Courts history of considering congressional redistricting cases, I cannot forecast that we will lack jurisdiction to review the district courts merits decision (on the underlying injunction), Labarga wrote.",
    "TALLAHASSEE  The Florida Supreme Court on Thursday declined to jump into a congressional redistricting fight, leaving in place a lower-court decision that would clear the way for using a controversial plan that Gov.",
    "But Smith ruled that the plan violated a 2010 state constitutional amendment  known as the Fair Districts amendment  that barred diminishing the ability of minority voters to elect representatives of their choice.",
    "Ron DeSantis took a red pen to the states budget on Thursday, slashing some of the top priorities of Republican lawmakers on the way to approving a record $109.9 billion budget for the states upcoming fiscal year.",
    "With the states top Republican leaders standing behind him on a stage in The Villages, DeSantis derided some of their spending as pork while announcing more than $3 billion in vetoes.",
    "The cuts came despite the states booming budget, and despite Republican lawmakers delivering on a number of controversial DeSantis priorities this year, from immigration to voting.",
    "Three of those vetoes were of spending projects for LGBTQ Floridians, including $150,000 in mental health services for survivors of the 2016 Pulse nightclub massacre in Orlando.",
    "In his dissent Thursday, Labarga alluded to heavy voter support of Fair Districts and said the Supreme Court ultimately will be asked to rule on Smiths temporary injunction.",
    "Smiths temporary injunction ordered use of a map that would keep the current sprawling shape of the district, which stretches from Jacksonville to west of Tallahassee.",
    "DeSantis argued that continuing with such a district would involve racial gerrymandering and violate the Equal Protection Clause of the U.S. Constitution.",
    "Leon County Circuit Judge Layne Smith sided with the plaintiffs and issued a temporary injunction to block the plan and require use of a different map.",
    "The case centers on Congressional District 5, a sprawling North Florida district that was drawn in the past to help elect a Black member of Congress.",
    "But in explaining its stay, a three-judge panel of the appeals court sharply criticized the temporary injunction, calling it patently unlawful.",
    "The plan is expected to increase the number of Republicans in the states congressional delegation from 16 to 20, based on past voting patterns.",
    "$75 million for an oceanographic science center at the University of South Florida that was a top priority of the House speaker, Chris Sprowls?",
    "While the 1st District Court of Appeal put the injunction on hold, it has not issued a ruling on the underlying issues in the injunction.",
    "Muniz, Couriel and Grosshans were appointed to the Supreme Court by DeSantis, while Polston and Labarga were appointed by former Gov.",
    "That appeals court decision effectively would allow the DeSantis plan to be used in this years elections as legal battles continue.",
    "District 5 is currently held by U.S. Rep. Al Lawson, a Black Democrat, but the revamped district likely would flip to Republicans.",
    "The justices, in a 4-1 ruling, rejected a request by voting rights groups to stay a decision by the 1st District Court of Appeal.",
    "That leaves an appeals court decision that effectively would allow DeSantis map to be used in this years midterm elections.",
    "During Thursdays bill-signing, DeSantis said his decision to make deep cuts was because of overspending in Washington.",
    "The voting rights groups then asked the Supreme Court to impose a stay of the 1st District Court of Appeal decision.",
    "In 2020, as the state was experiencing the first months of the coronavirus pandemic, DeSantis cut about $1 billion.",
    "$50 million for a new appellate courthouse desired by the states powerful Senate budget chair, Kelli Stargel?",
    "The Legislature approved DeSantis proposal to revamp the district, condensing it in the Jacksonville area.",
    "Justice Jorge Labarga dissented, while Chief Justice Charles Canady and Justice Alan Lawson were recused.",
    "Last year, DeSantis cut just $54 million in local projects before approving a $100 billion spending plan.",
    "The 1st District Court of Appeal, however, issued a stay of Smiths temporary injunction.",
    "The vetoes still leave the state with the largest spending plan in the states history.",
    "At this time, this (Supreme) Court does not have jurisdiction over that matter.",
    "The court did not explain why Canady and Lawson stayed out of the case.",
    "That decision would allow the use of the DeSantis-backed plan.",
    "Using that map also would affect some other districts.",
    "But the Supreme Court majority declined to do so.",
    "Ron DeSantis pushed through the Legislature.",
    "By Jim Saunders, News Service of Florida",
    "This is a developing story.",
    "Check back for updates.",
    "TALLAHASSEE  Gov.",
    "Charlie Crist.",
    "Adios.",
    "Gone."
  ]
}