{
  "id": 8801,
  "mediaId": 195,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "Florida Supreme Courts decision leaves DeSantis congressional map in place",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/article_images-desantisron_060721getty_florida.jpeg?strip=1&w=640",
  "link": "https://thehill.com/news/campaign/3509716-florida-supreme-courts-decision-leaves-desantis-congressional-map-in-place/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood/",
  "termIds": [
    661,
    1587,
    428,
    478,
    482,
    562,
    5169,
    2661
  ],
  "sentences": [
    "The state Supreme Courts announcement came in response to a lawsuit filed by several outside groups alleging that the map approved by the state legislature violated the states Fair Districts amendments by diminishing the ability of Black voters to elect a representative of their choice.",
    "It argues that under the new map, Black voters will face a harder time electing a congressman of their choice, even though nearly half of the districts residents are Black.",
    "The GOP-controlled state legislature passed a different set of maps earlier this year, but DeSantis vetoed them and instead introduced his own maps.",
    "The legislature eventually signed off on those lines, infuriating Democrats, who have accused the governor of mounting a political power grab.",
    "The courts announcement means that the map, which heavily favors Republicans, will likely remain in place for the 2022 midterm elections.",
    "Under the new map, Republicans stand to gain four new GOP-leaning seats, meaning that 20 of the states 28 districts favor Republicans.",
    "The lawsuit focused on the redrawn 5th Congressional District, which is currently represented by Rep. Al Lawson (D).",
    "The Florida Supreme Court declined on Thursday to hear a challenge to the new congressional map crafted by Gov.",
    "It also means that Floridas 1st District Court of Appeal will have the final say on the map.",
    "That court previously threw out a circuit court decision to redraw the map.",
    "DeSantis has defended the new congressional map, calling it race-neutral.",
    "Ron DeSantis (R) and approved by the GOP-controlled state legislature."
  ]
}