{
  "id": 8806,
  "mediaId": 881,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "Moms for Liberty has allied with Republicans across the U.S. to change what public school libraries are allowed to offer.",
  "image": "https://video-images.vice.com/articles/62968532c933c60094da950c/lede/1654032327875-gettyimages-1397759767.jpeg?crop=1xw:0.84375xh;center,center&resize=20:*",
  "link": "https://www.vice.com/en_us/article/qjbg9v/the-group-banning-lgbt-books-wants-to-replace-them-with-anti-gay-propaganda",
  "sentiment": "0",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Claire Woodcock",
  "authorUrl": "https://www.vice.com/en/contributor/claire-woodcock",
  "termIds": [
    661
  ],
  "sentences": [
    "According to the American Library Associations Access to Library Resources and Services for Minors interpretation of the Library Bill of Rights, a guiding principle public school librarians follow, Librarians and governing bodies should maintain that parentsand only parentshave the right and the responsibility to restrict the access of their childrenand only their childrento library resources.",
    "I just think its ironic that theyre now trying to get propaganda into our school libraries by way of donating them and circumventing the processes in place that are meant to protect our children from propaganda, Katie Paris, founder of Red, Wine & Blue, a nonprofit made up of suburban women advocating for progressive political causes told Motherboard.",
    "A conservative group behind the recent push to ban books on LGBTQ+ topics from public libraries has recently entered the next phase of their mission: pushing public school libraries across the country to accept book donations from conservative publishing companies that promote white supremacist, homophobic, and transphobic ideologies.",
    "[Moms for Liberty] has positioned themselves with all these things that have been passing in certain legislatures, and now they feel in control with the power to manipulate what goes into the libraries and what books students can read, Jabari Hosey, the president of the organization Families for Safe Schools, told Motherboard.",
    "A lot of the people from Moms for Liberty, MassResistance, Purple for Parents are starting at the school board yelling at people and are just totally skipping over the steps of the policy by going to the highest level and complaining about how were taking away parents rights, to create a panic, Lucas told Motherboard.",
    "Formed in 2021, Moms for Liberty has offered a $500 bounty for anyone who catches a teacher teaching so-called critical race theory, or CRT, a collection of scholarship that is often used as an alarmist shorthand for any historical discussions of racist discrimination in American schools.",
    "an area where the number of book challenges has crossed into the hundreds  says that between committee review sessions after school to address book challenges and constantly worrying about abrasive interactions with parents outside of work, people worry who will be targeted next.",
    "But the new state law has backed school librarians (also called media specialists in some districts) into a corner, requiring them to obtain a new certification in order to legally make decisions on whether a book is purchased, donated, or otherwise made available to students.",
    "In March, Florida signed into law HB1467, a book ban bill that librarians say will make it easier for parents to challenge books and instructional materials they dont approve of and replace them with books from publishers working with the Moms for Libraries campaign.",
    "Moms for Liberty, a group known for intimidating school officials and engaging in aggressive behavior at school board meetings, recently began its Moms for Libraries campaign, which promises to stock school libraries with conservative and anti-LGBT books.",
    "In the meantime, members are posting publicly on social media about finding other ways to circumvent the processes, including challenging individual books, campaigning for school board seats, and other deceptive techniques like this book rating system.",
    "It doesnt help [...] when your governor encourages parents to reach out to him if they feel that theres sexually explicit books or what he would call pornography, and a parent says Im going to send this to the governor, Calzada told Motherboard.",
    "Jennisen Lucas with the AASL says the hostile culture Moms for Liberty and other groups are creating for librarians is just another way that the organization is undermining its responsibilities to students and their communities.",
    "Theyre trying to have their point of view, theyre trying to have their perspective and trying to have that for everyone where there is no diverse thought, there is no representation that is everyone [...] just their ideology.",
    "In April, scholar Christopher Rhodes wrote for Al Jazeera that in less than two years, Moms for Liberty has been able to gain mainstream acceptance in ways that other fringe elements of the Republican Party cannot.",
    "Jennisen Lucas, president of the American Association of School Librarians and a school district librarian in Wyoming, says that while the policies may vary, the process to ask for considerations doesnt vary much.",
    "By signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "When a student comes to a library, nobodys forcing a child to check out a book, and if a parent came and said, I would like my child to only have these kinds of books, thats perfectly fine.",
    "Most of the media specialists, from the ones that have spoken to us, just feel pressured and uncomfortable because these parents keep coming after them, threatening lawsuits and whatever.",
    "Regardless of how many propaganda books have or have not yet made it onto library shelves, Halsey says the constant activity and fear mongering is where Moms for Liberty sees its success.",
    "Each public school district has its own policies and procedures around book donations, which vary by district and by state based on the interests and needs of different communities.",
    "In Florida, a Brevard Public School District school board member claims to have received threats and accusations of child abuse last year over a vote to maintain the mask mandate.",
    "The campaign has received support from anti-LGBTQ+ publishers like BRAVE Books, which has been widely criticized for its anti-transgender picture book Elephants Are Not Birds.",
    "The titles then must be made publicly available for parents to review and then must undergo approval from a school board hearing before they can be shelved for student use.",
    "It puts the [school districts] in fear, especially the media specialists and librarians that feel like theyre either going to lose their job or cause a lawsuit, said Hosey.",
    "The group has also tried to ban books about Martin Luther King Jr. and has promoted an author who opposes desegregation and claimed that slavery is not a racial problem.",
    "That is one of the most frustrating parts of being in this profession is the number of people [who] think that they know what we do, Lucas told Motherboard.",
    "The group has also effectively advocated for several pieces of legislation that were signed into law this year, including Floridas Dont Say Gay bill.",
    "Moms for Liberty co-founder Tina Descovich contested the idea that the organization has had no success, but refused to give Motherboard any details.",
    "Ben Carsons American Cornerstone Institute has also pledged to donate 500 copies of his Christian childrens book Why America Matters to the group.",
    "Jenkins partially blamed the harassment on Moms For Liberty and its co-founder Descovich, whom she ousted from her position on the school board.",
    "Motherboard has found no evidence that any school districts have formally accepted books from Moms for Liberty as of the time of this writing.",
    "Weve had that shared in an email and a librarian is in tears and it takes about an hour to calm them down  you cant unsee something like that.",
    "Parents have the absolute last right to guide what their children read and their education and weve always had that in place.",
    "In Florida, Governor Ron DeSantis appointed Ester Byrd, a prominent Moms for Liberty member, to Floridas Board of Education.",
    "The legislation also emboldens parents to sue the school district if librarians and other district members dont comply.",
    "Its unlikely that Moms For Liberty will see the books they want on school library shelves until legislation is passed.",
    "If you have a list, we can put a note on the childs record that says they're not allowed to have this kind of book.",
    "These are either called selection policies or development policies and are made public on school district websites.",
    "People seem to think, If I buy books and I can use the self-checkout at Walmart, why cant I just run a library?",
    "Becky Calzada, a librarian coordinator for the Leander Independent School District located near Austin, Tex.",
    "Moms For Liberty has been accused of contributing to the harassment of school officials in some states.",
    "Some Republican politicians have taken notice and have aligned themselves with the Moms For Liberty.",
    "Theres a narrative being shared that there isnt or they dont have that right, and thats not true.",
    "Theyre always trying to find something to scare people and drum up some sort of fear, Hosey said.",
    "The stress it puts on people is taking a toll on librarians, Calzada told Motherboard.",
    "And theres a lot more contemplation that means our biases are checked at the door.",
    "With 195 chapters in 37 states, interest in Moms for Liberty has exploded.",
    "Its not that parents have never had this right, Calzada explains.",
    "Its a double standard, but what else is new?",
    "Lets have a conversation, she added.",
    "Paris said."
  ]
}