{
  "id": 8807,
  "mediaId": 223,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "Pro-Abortion Organizations Will Challenge Floridas 15-Week Abortion Law",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/129/78791fa9-e553-4fb7-b4d5-a8a56b397c19.jpg",
  "link": "https://townhall.com/tipsheet/madelineleesman/2022/06/02/pro-abortion-organizations-will-challenge-floridas-15-week-abortion-law-n2608083",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madeline Leesman",
  "authorUrl": "https://townhall.com/tipsheet/madelineleesman/",
  "termIds": [
    661,
    6441,
    400,
    478,
    482,
    2661,
    2798
  ],
  "sentences": [
    "No European nation allows elective abortion through all nine months of pregnancy, as is effectively permitted in several U.S. states, and America is one of only a small handful of nations, along with China and North Korea, to permit any sort of late-term elective abortion, associate scholar and author of the study Angelina B. Nguyen said in its findings.",
    "Ron DeSantis signed a bill into law that restricts abortions to 15 weeks of pregnancy, similar to legislation in Mississippi that is currently under review by the United States Supreme Court in the case Dobbs v. Jackson Womens Health Organization.",
    "The Florida Supreme Court has long held that their state constitution protects the right to end a pregnancy, said Nancy Northup, president of the pro-abortion Center for Reproductive Rights, in a statement this week.",
    "It will deny Floridians autonomy over their own bodies and undermine their ability to make deeply personal decisions about their lives, families, and health care free of government interference.",
    "Townhall reported last July, ahead of the Dobbs hearings, how a study conducted by the Charlotte Lozier Institute found that abortion laws in Europe are typically 12 to 15 weeks gestation.",
    "Despite Floridas history of protecting the right to abortion, the Florida legislature recently engaged in a brazen attempt to override the will of the Florida people, the lawsuit reads.",
    "The legislature passed House Bill 5, a law the criminalizes pre-viability abortions in direct violation of Floridians fundamental privacy rights guaranteed by the Florida Constitution.",
    "Source: AP Photo/Gemunu Amarasinghe\nAbortion providers in Florida filed a lawsuit this week to block a state law that prohibits most abortions after 15 weeks gestation.",
    "Early last month, an unprecedented leaked draft opinion from the Supreme Court showed the Justices poised to overturn Roe v. Wade.",
    "Some of the groups involved in the case are Planned Parenthood, the Center for Reproductive Rights and the ACLU of Florida.",
    "Fifteen week abortion bans in states like Florida and Mississippi are in line with abortion laws across the globe.",
    "That means even if Roe falls, abortion should remain protected in Florida, and this ban should be blocked.",
    "The Act will unlawfully intrude upon the fundamental privacy rights of Florida women, it continued.",
    "In the lawsuit in Florida, the plaintiffs argue that abortion falls under a broad right to privacy.",
    "Mississippis law brings the United States a small step closer both to European and global norms.",
    "Protesters dressed up as The Handmaids Tale showed up outside the homes of the Justices.",
    "The decision, published in Politico, sent liberal pro-abortion activists into a frenzy.",
    "The law is scheduled to go into effect next month.",
    "Townhall reported in April that GOP Florida Gov."
  ]
}