{
  "id": 8811,
  "mediaId": 1546,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "US Teachers Debate Guns in the Classroom",
  "image": "https://gdb.voanews.com/0f590000-0aff-0242-465e-08da4490a78b_w1023_r1_s.jpg",
  "link": "https://www.voanews.com/a/us-teachers-debate-guns-in-the-classroom/6600141.html",
  "sentiment": "0",
  "mediaOutlet": "VOA",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matt Haines",
  "authorUrl": "https://www.voanews.com/author/matt-haines/yibyi",
  "termIds": [
    661
  ],
  "sentences": [
    "While Democratic lawmakers and their allies are calling for legislation that would restrict access to certain firearms and better scrutinize gun purchasers, some Republicans and gun rights advocates suggest putting guns in the hands of teachers and other school staff who volunteer for that responsibility.",
    "The solution is to reduce the number of guns circulating in our country, to reduce the ability for Americans to purchase high-powered automatic weapons, and to increase criminal charges against those found with illegal weapons in their possession.\"",
    "In the wake of last week's school shooting in Uvalde, Texas, which left 19 students and two teachers dead, Americans across the political spectrum are once again clamoring for solutions to the country's ongoing gun violence epidemic.",
    "Silver Spring, Maryland, middle school music teacher Jonah Rabinowitz-Buchanan noted that many schools already had armed personnel tasked with protecting students and staff, yet the slaughter continued.",
    "Since then, he's become an activist, attempting to make schools safer by supporting legislation allowing teachers to voluntarily carry a gun in school if they are trained and certified to use it.",
    "The rationale for arming teachers has been summed up by Wayne LaPierre, CEO of America's best-known gun rights lobbying group, the National Rifle Association.",
    "I can't speak for everyone, but a firearm in my hand will be a lot more effective at stopping someone trying to harm my kids than us hiding in a corner.\"",
    "\"At the end of the day, we all just want to go home to our families, for our families to come home to us, and for us all to live to see another day.\"",
    "Sergeant Keith Mott, a 15-year veteran of the Los Angeles Police Department, agrees that operating a firearm should not be a priority for teachers.",
    "Solutions\nRyan Petty's daughter, Alaina, was one of 14 students killed in the 2018 Stoneman Douglas High School shooting in Parkland, Florida.",
    "\"In a 2019 report by the U.S. Secret Service, only 1 out of 42 school attacks were stopped by responding off-campus law enforcement,\" he said.",
    "\"We already have more guns than any other nation on the planet,\" Allegra said, \"and have more gun deaths than any other nation on the planet.",
    "Nationwide problem\nAccording to federal data, since 1970, every state in the U.S. has had at least one incident of school gun violence.",
    "The average attack takes just over five minutes, he said, but it takes law enforcement an average of five to seven minutes to respond.",
    "\"We need to pay better attention to that,\" he told VOA, \"and pass red flag laws that deal with threatening language on social media.",
    "The Giffords Law Center listed nearly 100 publicly reported instances of guns being mishandled at schools in the past five years.",
    "\"Last week showed us again that teachers can't rely on others to save us and our students in a threatening situation,\" she said.",
    "At the very least, Garcia says, schools should have more nonteaching personnel armed and ready to intervene during an emergency.",
    "But, she adds, teachers who volunteer to be trained and to carry a gun would ideally be present in every wing of the school.",
    "Thomas Cotter teaches middle school band in South Carolina and a member of his school district's safety and procedures team.",
    "\"I've heard many law enforcement officers say two guns are better than one, and three are better than two,\" he said.",
    "New Orleans \n\"My first thought was that this is not at all what I signed up for,\" Jenna Whitesell Carson told VOA.",
    "\"Having an armed resource officer and other armed staff members gives schools the best chance to save lives.\"",
    "Other teachers say the focus should be on diagnosing mental illness and/or keeping school buildings secure.",
    "LaPierre has long insisted that \"the only thing that stops a bad guy with a gun is a good guy with a gun.\"",
    "If need be, I want to protect them, not just to sit there with a stapler in my hand like a sitting duck.\"",
    "\"Imagine your oldest teacher when you were in school firing a gun several times within feet of 25 kids.",
    "The tragedy in Uvalde was one of more than two dozen school shootings in America so far this year.",
    "\"The goal is to make sure our children feel safe, but also to ensure they are safe,\" Garcia said.",
    "He mentioned the shooting at a Parkland, Florida, high school in 2018 that left 17 people dead.",
    "\"It's not about being a hero, and it's not about seeking out an active shooter,\" Winder said.",
    "\"And it's not like children should see the gun or know teachers are carrying one,\" she noted.",
    "In 2020, conservative Governor Ron DeSantis appointed him to the Florida Board of Education.",
    "A 2018 Gallup poll found that 73% of American teachers did not want to carry guns in school.",
    "She said she was appalled by the idea of arming teachers to prevent future school shootings.",
    "The proposed solutions, however, depend on the side of the political divide they come from.",
    "That's their goal, and there's no reason they should be armed in the pursuit of that goal.\"",
    "Jason Winder has been teaching high school history for five years in Uintah County, Utah.",
    "She believes having responsible teachers and staff carrying guns will make schools safer.",
    "Most have had dozens, with California and Texas each suffering well over 100 incidents.",
    "\"Teachers, on the other hand, have enough to do just trying to educate our children.",
    "A locked school, not an armed one, is one that is safe and can make kids feel safe.",
    "Carson has worked at a public high school in rural South Carolina for four years.",
    "But despite their many differences in opinion, most teachers share an end goal.",
    "He said a resource officer should monitor that entrance to maintain security.",
    "Allegra, who has taught in New Orleans, Louisiana, K-12 schools for 15 years.",
    "\"They had a resource officer who had a gun, and he fled the scene,\" he said.",
    "Rather, he thinks the focus should be on the failures of resource officers.",
    "He believes the U.S. is too hesitant to diagnose and treat mental illness.",
    "\"It's about giving me the best tools to keep my students and myself safe.",
    "\"My second thought was that they definitely don't pay us enough for this.",
    "\"I became a school librarian to educate young minds, not to carry a gun.\"",
    "\"Children, teachers and education belong in schools  not guns,\" said A.J.",
    "He carries a concealed firearm at school, which is legal in the state.",
    "\"I'd rather them worry about locking a door than chambering a round.",
    "You don't have a right to a gun when you're making illegal threats.\"",
    "\"I think of this all from the perspective of being a father of two.",
    "Cotter also advocates for a single public entrance at all schools.",
    "New Orleans teacher Allegra sees guns as the root of the problem.",
    "Teachers aren't allowed to carry guns, but she wishes she could.",
    "Now Republicans want to take away our right to not carry a gun?\"",
    "\"The resource officer is the first line of defense,\" Mott said.",
    "Isn't the connection between those statistics a little obvious?",
    "Angelica Garcia works at schools in Saginaw County, Michigan.",
    "\"You need them nearby to prevent the loss of life,\" she said.",
    "Robb Elementary School in Uvalde also had a resource officer.",
    "\"I care about my students like they are my own children.",
    "\"No one came to the aid of those students or teachers.\"",
    "\"How does that equate to schools needing more guns?\"",
    "The image is as preposterous as the idea,\" he said.",
    "Garcia, the ESL teacher, doesn't completely agree.",
    "But some educators want an extra line of defense.",
    "\"The Uvalde officer wasn't even in the building.",
    "Violations should result in weapon confiscation.",
    "In school shootings, seconds count, Petty said.",
    "How do I want my children's teachers to act?\"",
    "Teachers have so much on our plates already.",
    "Some teachers see it differently, however.",
    "Most teachers aren't convinced.",
    "Many teachers reject that idea.",
    "Rabinowitz-Buchanan said.",
    "What good are they?\"",
    "That's important.\"",
    "Cotter asked."
  ]
}