{
  "id": 8822,
  "mediaId": 25,
  "date": "6/2/2022 12:00:00 AM",
  "headline": "All 50 states have finished their congressional maps - what do they say about the 2022 election?",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/05/26/78151de5-6ea7-4a02-9d32-1a5f61ee708c/thumbnail/140x90/3e9a2047b57ccbfe46938df1b7c967eb/gettyimages-1239187103.jpg",
  "link": "https://www.cbsnews.com/news/redistricting-2022-election-takeaways/",
  "sentiment": "0",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron Navarro",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "2022 Midterm Elections\n More\n What the new congressional maps tell us about the 2022 election\n Vermont likely to elect its first woman to Congress this year\n 5 Republican candidates for Michigan governor barred from ballot over invalid signatures\n Pennsylvania Senate GOP primary recount begins\n Georgia, Alabama, Arkansas, Texas and Minnesota primary results\n More\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "Here's what the maps tell us about what to expect in the 2022 midterm elections:\nDemocrats made up some ground\nCompared to the maps used in the 2020 U.S. House elections, Democrats are expected to see a net gain of ten seats that will favor their party by at least 5 points, according to a CBS News analysis of election data from Dave's Redistricting App.",
    "While Republican states like Texas and Georgia effectively took competitive seats off the board by drawing more rural areas into suburban districts, moderate Republican members of Congress such as Adam Kinzinger of Illinois and John Katko of New York were also forced to retire because of the Democratic maps in their respective states.",
    "Michael McDonald, a redistricting data expert at the University of Florida, said if the conservative-majority court chips away at the Voting Rights Act (VRA) in that Alabama case, it will be pivotal to the future of voting rights and result in a lack of racial voting protections in federal statute or law.",
    "Adam Kincaid, president of the National Republican Redistricting Trust, said that Democratic legislators \"overextended themselves\" in Nevada, Illinois, Oregon and New Mexico by drawing districts that may have voted more Democratic in past elections, but are well within Republican reach this November.",
    "New Hampshire on Tuesday became the last state to fully enact its map, and while Florida, Texas, Alabama and a few other states are still waging legal battles over partisan and racial gerrymandering, the maps they've enacted will remain in place for this year's midterm elections.",
    "Minority communities may have been responsible for population growth that added seats, but it's not reflected in the new maps\nDespite the growth in minority and biracial citizens shown in the 2020 Census, their representation was not reflected in many of the new maps.",
    "Republicans show gains in heavily pro-Trump seats\nThe NRRT's numbers also showed that in the 18 states where Republicans had control, they increased the number of seats that heavily favored former President Donald Trump (by at least 10 points in 2020) by 17 seats.",
    "Reapportionment, the process that determines which states gain or lose congressional districts based on their census data, also resulted in more Democratic states that lost a seat (New York, Illinois, California) than Republican states (West Virginia, Ohio).",
    "Though Democrats had the power to redraw fewer seats than Republicans (187 seats to 75 seats), they were still able to make up some ground by aggressively pressing their advantage in states like Oregon and Illinois, where they control the legislature.",
    "But when a heavy Democratic gerrymander was thrown out in New York at the same time Republicans in Florida successfully mapped a gerrymander that aims to give them four more seats in Congress, Democrats saw their edge from redistricting shrink.",
    "We've said from the beginning that we needed great candidates, a winning message and enough resources to make history and fire Nancy Pelosi,\" said National Republican Congressional Committee spokesperson Michael McAdams.",
    "In the map drawn by Republican legislators, the number of Latino-majority Congressional districts stayed the same, despite the state being rewarded with two new Congressional seats from their population gain.",
    "Tim Persico, executive director of the Democratic Congressional Campaign Committee, said while their numbers show a decline of competitive seats, \"cycle over cycle, what is competitive changes all the time.\"",
    "In Nevada, the Democratic majority \"unpacked\" or siphoned off some voters from the heavily Democratic 1st District in order to shore up the 3rd and 4th Districts, which both have Democratic incumbents.",
    "\"You could see some of these states go back and decide that they're going to redraw their districts now that they know that they don't have to worry about section two of the Voting Rights Act.\"",
    "Illinois has both a Democratic matchup (Reps. Sean Casten and Marie Newman in Illinois' 6th District) and a Republican one (Reps. Mary Miller and Rodney Davis in Illinois' 15th District).",
    "In total, 181 seats lean toward Democrats, 173 seats lean toward Republicans and 81 seats are considered competitive (within 5 points for both parties), according to a CBS News analysis.",
    "All 50 states have finalized their congressional map to use for elections this November, a major checkpoint in the once-a-decade process of redrawing lines for political representation.",
    "Ron DeSantis advanced a map that dismantled Florida's 5th District, a sprawling Democratic district that ran from Jacksonville to Tallahassee and had a predominantly Black population.",
    "\"We entered into this cycle with the objective of coming out of redistricting with a map that we can win on, and I think we feel pretty good that we have a map that we can win on.\"",
    "Texas, Arkansas, Louisiana, South Carolina, Georgia and Alabama are all Republican-led states that have racial gerrymandering cases expected to be settled after the 2022 election.",
    "In New York, some Democratic lawmakers claimed the court-adopted Congressional map targeted Black members of Congress by drawing several Democratic incumbents into the same seat.",
    "They were able to do that through states like Texas, which shored up its incumbent Republicans by drawing more rural areas into their districts, at the cost of competitive seats.",
    "Two have already played out: Alex Mooney, a Trump-backed Republican, beat David McKinley in West Virginia's 2nd District, and McBath beat Bourdeaux in Georgia's 7th District.",
    "While the cases were brought up early in the 2022 election cycle, multiple state and federal court decisions ruled that it was too close to the primaries to change the map.",
    "Incumbent vs. incumbent primaries\nFor the first time in modern history, the Upper East Side and Upper West Side in New York City will be in the same Congressional district.",
    "Kelly Ward Burton, president of the National Democratic Redistricting Committee, thinks the party has a clear advantage on the map that can last the rest of the decade.",
    "\"Quote-unquote competitive can mean different things in different cycles, but largely it's the same number of seats so our work doesn't change all that much,\" he said.",
    "Democrat Carolyn Bouredeaux of Georgia, seen as a centrist Democrat, was forced into an incumbent vs. incumbent matchup in the state's now reliably blue 7th District.",
    "Kincaid said that raises the floor for House Republicans and that it enables them to focus and spend more money on offensive targets and less on defending incumbents.",
    "The union means there will be an incumbent vs. incumbent matchup between longtime Democratic Reps. Jerrold Nadler and Carolyn Maloney in New York's 12th District.",
    "In Alabama, the U.S. Supreme Court will hear a case after the November elections over whether the Republican-led state should have two majority-Black districts.",
    "Competitive seats decline\nThe number of competitive districts (those that have a +/- 5 point partisan lean) decreased by ten, according to a CBS News analysis.",
    "Redistricting experts and analysts warn that the steady decline of competitive House races in recent decades creates an outsized role for primary elections.",
    "Kincaid added that their numbers show the states with an independent or bipartisan commission were a \"wash\" for both parties, which he said was a \"big win.\"",
    "Legal victories in North Carolina's and Pennsylvania's Supreme Courts and independent commissions in California and Michigan also helped them gain an edge.",
    "McAdams added that regardless of the new maps, the current political environment \"has created a tremendous amount of opportunities for Republicans to win.",
    "Only one out of the state's six districts has a majority-Black population, though 26.8% of the state's population is Black, according to the 2020 Census.",
    "I think that all we've done is we've given ourselves the ability to build on our coalition while they're hoping their Biden coalition sticks together.",
    "She said their numbers show 215 districts on the new map where Biden won more than 52% of the vote, compared to 196 seats where he had less than 48%.",
    "But when you pull out and look at the map in the full landscape of the decade, I think that map is going to be fine for Democrats,\" Burton said.",
    "Democrats can get it right back in a presidential year, and in a better cycle, because the voters get to decide the outcome of those elections.",
    "\"Everything in much of the country comes down to the primary now and primary electorates are a tiny share of the general election electorate.",
    "The NDRC found just 31 seats that fit their definition of competitive, which is within two points of 50% on a generic partisan scale.",
    "When you're looking at Joe Biden's performance and his numbers with independents, there's a tremendous opportunity for Republicans.\"",
    "In Michigan, Democrats Andy Levin and Haley Stevens are locked into an incumbent vs. incumbent primary in the state's 11th District.",
    "\"At the DCCC, I understand how difficult that [New York] map may be for 2022 incumbents and the work that has to be done in 2022.",
    "On the whole map, the NRRT's numbers show an increase of 11 strong Trump seats compared to an increase of 2 strong Biden seats.",
    "The NRRT said there is a decrease of 13 seats that were within 10 points in 2020 for Trump or President Biden in the new map.",
    "There are at least five other primary matchups throughout the country with incumbents of the same party due to redistricting.",
    "\"Republicans have a much better shot at regaining votes in the suburbs than Democrats do in regaining votes in rural areas.",
    "In Texas, Hispanic or Latino residents closed their gap with White residents to 0.5%, according to the 2020 Census data.",
    "And any gains Democrats made may not be readily apparent, especially if Republicans take the House by a large margin.",
    "It's now roughly a third of its original size, is solidly Republican and has a 12.8% Black voting age population.",
    "California and Illinois were able to increase their amount of Asian-majority and Latino-majority seats.",
    "\"From the outset, Republicans were never going to rely on redistricting to win the majority.",
    "She lost to Rep. Lucy McBath, a more progressive Democrat and advocate against gun violence.",
    "And those are the deciders,\" said Michael Li, a redistricting expert at the Brennan Center.",
    "The result is the fairest map the party believes it has seen in the last three decades.",
    "\"Let's accept the premise that they do [win those Nevada seats],\" responded Burton.",
    "\"Democrats were trying to draw as many seats they could at Biden +8 to Biden +12.",
    "He pointed to Nevada in particular, and called it the \"dummymander\" of the cycle.",
    "And I don't see any signs of that happening right now on their side,\" he said.",
    "Both states lost a Congressional district after the census data was released.",
    "That map is the map for '22, it's also the map for '24 and '26,\" she added.",
    "Because the thing about redistricting is setting the table for the decade.",
    "And that could result in an even more partisan and polarized U.S. House.",
    "\"There will be a lot less competition for the foreseeable future.\"",
    "\"It's more than just a vote, it's how effective your vote is.",
    "And I don't see those seats holding up this fall,\" he said.",
    "\"The redistricting story is different than the 2022 story.",
    "One of those is through gerrymandering,\" he said.",
    "There are ways to make your vote less effective.",
    "By definition, that's how it should be.\"",
    "In Florida, Republican Gov.",
    "\"Say it's a bad cycle.",
    "Twitter"
  ]
}