{
  "id": 8839,
  "mediaId": 238,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Florida abortion providers seek to block states new 15-week ban",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/06/01/florida-abortion-states-roe/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ann E. Marimow",
  "authorUrl": "https://www.washingtonpost.com/people/ann-e-marimow/",
  "termIds": [
    661,
    4265,
    4706,
    400,
    478,
    2661,
    2798,
    2851,
    5039,
    6460
  ],
  "sentences": [
    "That means even if Roe falls, abortion should remain protected in Florida, and this ban should be blocked, said Nancy Northup, president of the Center for Reproductive Rights, one of the groups behind the lawsuit, which also includes the ACLU of Florida and Planned Parenthood on behalf of health centers in the state.",
    "John Stemberger, president of the Florida Family Policy Council, an antiabortion organization, characterizes to the states abortion protections as an artificial superpowered abortion right, more expansive than the rights guaranteed by the U.S. Supreme Court in Roe and subsequent decisions.",
    "The constitutional challenge in Florida comes as Republican-led states have moved to restrict abortion access and weeks before the U.S. Supreme Court is slated to issue a major abortion ruling that is expected to undermine if not overturn the landmark Roe v. Wade decision.",
    "Like Florida, courts in Alaska, Minnesota and Montana have also issued rulings emphasizing that the government may not intrude into certain private decisions, including whether to terminate a pregnancy, according to a report by the Center for Reproductive Rights.",
    "The state Supreme Court in 1989 invalidated a law requiring minors to obtain parental consent to get an abortion based on the provision that states that every person has the right to be let alone and free from governmental intrusion into his private life.",
    "If all abortion decisions go back to the states, I would hate for our state to be seen as a place to have more opportunity for abortions than others, said Stargel, a Republican from central Florida now running for an open congressional seat.",
    "The case filed Wednesday in Leon County will test the strength of the states protections embedded in the constitution and a decades-old state Supreme Court decision at a time when Floridas highest court has become more conservative.",
    "The outcome of the Mississippi case and the state case filed Wednesday will influence future legislative efforts in Florida to restrict abortion access, said state Sen. Kelli Stargel, the lead sponsor of the 15-week ban.",
    "In their filing Wednesday, lawyers for Florida abortion providers and abortion rights advocates urged the circuit court for Leon County to issue an injunction to prevent the 15-week ban from taking effect July 1.",
    "Despite Floridas history of protecting the right to abortion, the Florida legislature recently engaged in a brazen attempt to override the will of the Florida people, the attorneys wrote in the 33-page filing.",
    "State supreme courts have the unique privilege of looking at the constitution with fresh eyes, said Stemberger, who served on the judicial nominating commission for former Republican governor Jeb Bush.",
    "It will deny Floridians autonomy over their own bodies and undermine their ability to make deeply personal decisions about their lives, families, and health care free of government interference.",
    "State Rep. Anna V. Eskamani, a Democrat from Orlando, said the new law is at odds with the Florida value around privacy, around personal medical decisions, including someones pregnancy.",
    "Florida and 10 other states have already recognized and protected abortion access independently from the U.S. Supreme Court, through state constitutions and past state court decisions.",
    "If the constitutional challenge filed Wednesday makes its way to the state Supreme Court, he said the newly configured, seven-member court is likely to reexamine past decisions.",
    "Abortion providers in Florida filed a lawsuit Wednesday to try to block the states new law banning abortion after 15 weeks of pregnancy, which is slated to take effect July 1.",
    "In April, a lower court judge upheld the constitutionality of a 2015 law that requires a woman to wait 24 hours after consulting with a doctor before having an abortion.",
    "Floridas high court, he added, has already shown in the past year in multiple cases, its willingness to do this and to say, the previous Supreme Court got it wrong.",
    "If the justices roll back the fundamental right to abortion established nearly 50 years ago, the legal battle over reproductive rights will shift to state courts.",
    "A draft majority opinion made public last month by Politico showed that five justices had tentatively voted to overturn the right to abortion established in Roe.",
    "The courts ruling stated that it could conceive of few more personal or private decisions concerning ones body that one can make in the course of a lifetime.",
    "For more than three decades in Florida, courts have interpreted a voter-backed privacy provision of the state constitution to include the right to abortion.",
    "Despite Floridas constitutional protections, the legal landscape in the state has changed as DeSantis has appointed new, more-conservative judges.",
    "Theres an understanding that it is not a politicians place to get involved, said Eskamani, who began her career as an abortion rights advocate.",
    "The state has allowed abortion up to 24 weeks, the standard established by Roe, which protects access until a fetus is viable outside the womb.",
    "Clinics and health-care providers could face criminal penalties and disciplinary action for performing abortions after the 15-week mark.",
    "The Florida law includes exceptions to save the life of the mother and for fatal fetal abnormalities but does not for rape or incest.",
    "At the U.S. Supreme Court in December, the conservative majority at oral argument appeared likely to uphold Mississippis 15-week ban.",
    "In Kansas, the states highest court has held that natural rights protect personal autonomy, including the right to abortion.",
    "The legislature, they said, passed a law that will unlawfully intrude upon the fundamental privacy rights of Florida women.",
    "The Florida Supreme Court has long held that their state constitution protects the right to end a pregnancy.",
    "Ron DeSantis (R) in April  is modeled on the Mississippi law under review by the U.S. Supreme Court.",
    "The 15-week ban  passed by the Republican-controlled legislature in March and signed by Gov.",
    "A final decision is expected before the term ends in late June or early July.",
    "Florida has some of the least restrictive abortion laws in the southeast.",
    "We are a pro-life state and we want to protect the unborn.",
    "Thats disturbing to me."
  ]
}