{
  "id": 8849,
  "mediaId": 558,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Mallory McMorrow, rising Democratic star, says its time to answer conservative culture war attacks",
  "image": "https://s.yimg.com/uu/api/res/1.2/5Lc3XMSrnBPwMqh2ZAF3EA--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/os/creatr-uploaded-images/2022-05/5f11a600-d7b4-11ec-bf59-0e0e9aaff162",
  "link": "https://sg.news.yahoo.com/amphtml/mallory-mc-morrow-rising-democratic-star-says-its-time-to-answer-conservative-culture-war-attacks-172126744.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexander Nazaryan",
  "authorUrl": "https://www.yahoo.com/author/alexander-nazaryan",
  "termIds": [
    661
  ],
  "sentences": [
    "The four-minute broadside immediately roused Democrats who had been huddled in a defensive crouch for months; one circulating version has been viewed more than 15 million times\nIm going to start talking that way, Democratic consultant James Carville told the Washington Post.",
    "There was a hesitancy to want to talk about things, at least for me, McMorrow told Yahoo News during a recent visit to Washington, D.C.\nThat changed on April 13, when Republican state Sen. Lana Theis gave an arresting invocation to open the Michigan State Senate session.",
    "She describes herself as wanting to speak for other suburban moms: perhaps the ones who put up Black Lives Matter and in their yards, but have, in the last two years, grown successively more exhausted with school closures, reports of rising crime and inflation.",
    "The speech came after months of charges from politicians like Ron DeSantis, the ambitious Republican Florida governor, that teachers who wanted to discuss sexuality and gender were, in fact, trying to indoctrinate children.",
    "In Virginia, helped power the Republican business executive Glenn Youngkin to an upset victory over Democratic candidate and former governor Terry McAuliffe in that states gubernatorial race last fall.",
    "Progressive social media trolls like Senator Mallory McMorrow (D-Snowflake) who are outraged they ... cant groom and sexualize kindergarteners or that 8-year-olds are responsible for slavery.",
    "That changed on April 19, when she delivered an impassioned speech countering Republican accusations that Democrats like she were groomers for supporting the rights of gay and trans students.",
    "Democrats in Washington have found their messages about a post-pandemic economic renewal unconvincing to a suburban and rural electorate uneasy about social issues like education and crime.",
    "Suburban moms who have left the Republican Party in big numbers came back, a jubilant Bob McDonnell  Virginias last Republican governor before Youngkin  told the Washington Post .",
    "It was less a realistic ticket than a recognition that many Democrats feel that they need new people to say new things  and to say them more bluntly than their party elders have.",
    "McMorrow walked out of the legislative chamber along with two other Democrats, seeing Theiss concern as a thinly disguised reference to the grooming line of attack.",
    "She did not think much of her response to what had seemed like intentional political provocation, a local Republican trying to replicate the rhetoric of Fox News.",
    "The signs are a wonderful signal and reminder of who we are and what kind of community and country we want our kids to grow up in, McMorrow told Yahoo News of .",
    "She addressed not only Republican attacks on gay and trans kids but also charges that schools were imposing divisive racial justice ideas that are .",
    "WASHINGTON  It is fair to say that until last month, Michigan state Sen. Mallory McMorrow was not a figure of national political prominence.",
    "She likes my truck, adds her husband , who accompanied McMorrow to Washington and is the former editor of automotive website Jalopnik.",
    "But the devastating reality is that Republicans are actively trying to dismantle that vision, and a sign isn't enough without action.",
    "Even before the new message, liberal commentator Keith Olbermann , positing a run with Texas gubernatorial candidate Beto ORourke.",
    "The suburbs hugging the Potomac  the same ones that had voted for Biden only months before  provided the crucial difference.",
    "That there are forces that desire things for them other than what their parents would have them see and hear and know.",
    "The charges were baseless but effective, and books like Gender Queer suddenly became the targets of national bans.",
    "The video garnered hundreds of thousands of views, more evidence that McMorrow was hitting raw political nerves.",
    "Dear Lord, across the country were seeing in the news that our children are under attack, Theis said.",
    "Dear Lord, I pray for Your guidance in this chamber to protect the most vulnerable among us.",
    "When you saw the photo of the four men and guns, what you don't see is I'm right below them.",
    "Five days later, Theis sent out a fundraising email that seemed to confirm as much.",
    "Its the school, They need you to come down to give a DNA sample, .",
    "A role model for the midterms, read a headline in the New Yorker.",
    "So mutilated that they dont even know how many kids there are.",
    "(Theis did not answer a request for comment from Yahoo News.)",
    "I guess she took offense to that, McMorrow said of Theis.",
    "In McMorrows Michigan and across the Midwest, .",
    "These are the people we are up against, .",
    "The bodies are too mutilated to identify.",
    "Because they'll win unless we stop them.",
    "They were above our heads, taunting us.",
    "You know, fingers on triggers.",
    "Your phone rings.",
    "Like literally, ."
  ]
}