{
  "id": 8851,
  "mediaId": 558,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "States rush to expand gun rights despite calls for stricter laws",
  "image": "https://s.yimg.com/uu/api/res/1.2/ysHmZuMFXwGilgAYvUQyxg--~B/Zmk9ZmlsbDtweW9mZj0wO3c9MjYwO2g9MTQ0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://s.yimg.com/hd/cp-video-transcode/production/9fcab237-0b7f-30be-9c09-be4c90b8746f/2022-05-31/17-00-20/85c7fe29-6c4d-56ea-952d-d4a52bf69427/stream_1080x1920x0_v2_3_0.jpg",
  "link": "https://sg.news.yahoo.com/amphtml/states-rush-to-expand-gun-rights-despite-calls-for-stricter-laws-162304769.html",
  "sentiment": "0",
  "mediaOutlet": "Yahoo News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexander Nazaryan",
  "authorUrl": "https://www.yahoo.com/author/alexander-nazaryan",
  "termIds": [
    661,
    1600,
    297,
    2590,
    2661,
    2845,
    2851,
    2934
  ],
  "sentences": [
    "Put your trust in the good guys, a school superintendent said in support of the bill in March, echoing the rhetoric that the National Rifle Association has used since the 2012 mass shooting at Sandy Hook Elementary School in Newtown, Conn., that arming teachers would make schools safer.",
    "WASHINGTON  Even as Democrats and some Republicans in Washington work to forge a consensus on modest gun control measures following last weeks school shooting in Uvalde, Texas, state legislatures across the country are continuing to undo existing regulations.",
    "You basically have Republican primary candidates trying to explain to Republican primary voters that they are going to be on their side when it comes to the cultural cold civil war thats being fought right now, a to the New York Times last week.",
    "Two of the most high-profile mass shootings in the nation  at Pulse nightclub in Orlando in 2016 and at Marjory Stoneman Douglas High School in Parkland in 2018  took place in Florida (DeSantis did not become governor until 2019).",
    "I cant tell you if its going to be next week, six months, but I can tell you that before I am done as governor, we will have a signature on that bill, DeSantis said of the proposal, known as permitless or constitutional carry.",
    "We need to erect a complete barrier against any government official anywhere from treading on gun rights in Texas,  another Republican with rumored presidential ambitions  said in early 2021.",
    "Floridians don't need another law to make it even easier to put deadly weapons in the wrong hands, stated, deeming the proposal the latest political sop to the far-right fringe by DeSantis.",
    "The bills they pass can expect swift endorsement from Republican governors, some of whom have national ambitions that likely would not survive the opposition of gun activists and groups.",
    "Speaking on MSNBC last week,  a recent viral sensation  argued that Democrats had lost ground on both abortion and gun rights by not tending more carefully to state-level races.",
    "Ron DeSantis, a Republican who is widely expected to seek the presidency in 2024, vowed to undo permitting requirements for gun owners wishing to carry their weapons in public.",
    "Two years later, with Democrats in control of the White House and both chambers of Congress, the pro-gun message has become even more central to Republicans political identity.",
    "Although mass shootings with assault rifles, especially in schools, understandably garner outsize public attention, assault rifles are used in only 3% of all gun killings.",
    "Monday saw a state Senate committee in Ohio debate a measure, already passed by the state House, that would make it easier for teachers to bring guns into the classroom.",
    "The federal government could send out ATF or the FBI or whatever, to enforce that law, but the state enforcement agents would not be able to assist in that, .",
    "Proponents of gun control wonder why expanding gun rights is necessary when the fundamental right to bear arms is enshrined in the Second Amendment.",
    "said Rusty Bowers, the speaker of the Arizona House, as he and other Republicans stymied a new Democratic in a state where a 2011 mass shooting .",
    "How is it that as a culture our reactions are so violent that we seek and worship and pay for and be entertained by violence to such a degree?",
    "The killings in Uvalde focused new attention on the proposal, even though the suspect in that shooting bought his weapons legally.",
    "Americans in favor of gun control are looking longingly to Canada, where Prime Minister Justin Trudeau has proposed severe new .",
    "Polls show that most Americans, including conservatives, support imposing new restrictions on purchasing and carrying weapons.",
    "But the states most likely to adopt stricter gun control measures, like New York, already have strict measures in place.",
    "Even as bipartisan efforts at gun control proceed in Washington, wide swaths of the U.S. are loosening restrictions.",
    "Yet public outcry and opposition from law enforcement groups may not make a difference in Ohio, or elsewhere.",
    "In New Hampshire, Republicans have proposed a bill that would make it illegal to enforce federal gun laws.",
    "Across much of the Midwest and Southeast, Republicans have complete control of state legislatures.",
    "For gun control activists, the model is California, which has implemented strict controls and .",
    "In 2020, Lauren Boebert won a Colorado congressional election for her defiant pro-gun stance.",
    "And a majority of gun deaths in the United States result not from crime but from suicide.",
    "Servers at the restaurant she owns, Shooters Grill, as they sling burgers and pints.",
    "When California moves, other states move in the same direction, California Gov.",
    "The work will not be easy, as Republicans now control across the country.",
    "They are the good guys wanting to protect others from the bad guys.",
    "There are also 23 states in which , all but ensuring passage.",
    "Louisiana is also , despite having some of the in the nation.",
    "Permitless carry actually substantially, research has found.",
    "By contrast, there are only 14 such fully Democratic states.",
    "Handguns are used in a majority of gun crimes, .",
    "Democrats need to work from the bottom up, .",
    "Texas enacted permitless carry last year.",
    "Florida is already a gun-friendly state.",
    "Six people died in that attack, .",
    "The Legislature will get it done.",
    "In late April, Florida Gov.",
    "."
  ]
}