{
  "id": 8853,
  "mediaId": 302,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Americans have other rights, too. Among them: life and liberty | Letters",
  "image": "https://www.tampabay.com/resizer//ky8pr_nlOAAMRZTWiH3-EM-jiyc=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/G26FY4JC4SEW7Q43A6FCWCLICI.jpg",
  "link": "https://www.tampabay.com/opinion/2022/06/01/the-constitution-has-other-rights-too-among-them-life-and-liberty-letters/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Steve Yerrid, Tampa\nThe writer, a Tampa attorney, took the lead in the State of Floridas case against Big Tobacco, successfully defended the harbor pilot on the freighter that struck the Sunshine Skyway and has handled more than 250 cases that resulted in settlements of more than $1 million.",
    "Other rights Americans have: life and liberty\nChildren begged for help | May 28\nAs a lawyer, I have made my career standing up for individuals, so I am the first to acknowledge that the Second Amendment certainly provides liberties and protections.",
    "Maryhelen Clague, Zephyrhills\nThis will happen again\nBiden visits grieving town | May 30\nI understand the outrage of parents when their children may have been injured and dying while the onsite police waited for the tactical team.",
    "I have taught in Florida, and the reality is that many students do not come from homes where they are parented to learn self-acceptance and personal responsibility, much less empathy toward their classmates.",
    "| May 30\nHistory and research show that elementary teachers and school social workers are most likely to identify detached, alienated, and nihilistic individuals prone to indiscriminate violence.",
    "They would be reluctant to admit it, maybe even to themselves, but they likely doubted that they would be able to kill the shooter before many of them were badly wounded or killed.",
    "Nothing will happen to mitigate the same thing occurring again because most Republicans in Congress will never vote for any kind of sensible control of guns in this country.",
    "At risk youth are routinely denied meaningful treatment interventions because of the mental health bureaucracy (confidentiality, no crisis services, no follow-up).",
    "You bet theyre angry\nLet not our hearts grow numb | Column, May 30\nPeggy Noonan rails at the Democrats for being full of rage over the school shooting in Texas.",
    "To ensure effective early intervention, when parents and students are most receptive, it is imperative to remove needless mental health blockades to service.",
    "Partisan agendas and personal attacks threaten to paralyze the Congress, despite the overwhelming will of the American people to stop these mass shootings.",
    "But Americas founders recognized even more fundamental rights, bestowed by the Creator himself: the right to life, liberty and the pursuit of happiness.",
    "Regardless of what TV and the movies show, military veterans and police know that superior firepower usually prevails, at least initially.",
    "Ron DeSantis is pandering to the lowest common denominator, he and his acolytes are failing to lead, failing to protect our kids.",
    "There are a lot of people who think they are brave until faced with superior firepower and a high likelihood of injury or death.",
    "If we cannot move ourselves to act now, hard upon the murder of those innocents and their teachers, may God have mercy upon us.",
    "DeSantis and his venerators in the Legislature must stop stoking fear and ignorance, and instead model courage and wisdom.",
    "The officers had reportedly been trained to put on their protective vests and immediately seek to neutralize the shooter.",
    "We need open communication and service collaboration between schools, law enforcement, community programs and families.",
    "Since our beginnings, America and its courageous people have shown the strength and solutions to make our world better.",
    "Those rights have been horribly taken from 19 beautiful children, their teachers and their families in Uvalde, Texas.",
    "As more indiscriminate violence occurs, it demonstrates, how barriers to mental health service serves no purpose.",
    "All teens in Florida need and deserve a fulsome education, which includes regard for oneself and ones community.",
    "Bruce Tabashneck, Fort Myers\nThe writer has been a social worker in metropolitan Detroit for over 35 years.",
    "They knew that their handguns were no match for an assault rifle designed to efficiently kill humans.",
    "When the team with shields and assault rifles arrived, action was taken and the shooter was killed.",
    "Each state needs to clear impediments for youth and their families to get help quickly and easily.",
    "When I was a student at Georgetown Law School, I had the privilege of working in the U.S. Senate.",
    "Facing a shooter with an assault rifle in a classroom with a single point of access is another.",
    "Democrats are full of rage and bitterness at yet another dreadful shooting tragedy in a school.",
    "Their hearts are breaking along with everyone elses in this country at such a needless horror.",
    "Doing nothing would represent a tortured view of our nations values and true American grit.",
    "As long as homicidal shooters have assault rifles, this scenario is likely to repeat.",
    "Robert H. More, Riverview\nWe know the next shooter\nHow do red flag orders work?",
    "Lessons unlearned\nFlorida backs off Parkland lessons | May 29\nWhile Gov.",
    "But their anger is great because they know nothing will be done.",
    "Getting mental health intervention is usually not available.",
    "It is not going to occur unless the barriers are removed.",
    "It must begin in preschool and elementary school.",
    "Drills with no danger of injury are one thing.",
    "So turn your railing where it belongs, Peggy.",
    "As a Vietnam veteran, I understand the fear.",
    "He recently retired to Florida.",
    "Patricia Blair, St. Petersburg",
    "Now that would be leadership.",
    "Much has changed since then.",
    "At your Republican Party.",
    "They should have tried.",
    "Were they all cowards?",
    "But they did not act.",
    "Well, she is right.",
    "I doubt it.",
    "Why not?"
  ]
}