{
  "id": 8860,
  "mediaId": 223,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Texas Soft",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2018/276/94dfdd23-4a29-4a65-89b2-1ebc91b3d218.jpg",
  "link": "https://townhall.com/columnists/kurtschlichter/2022/06/01/texas-soft-n2607975",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kurt Schlichter",
  "authorUrl": "https://townhall.com/columnists/kurtschlichter/",
  "termIds": [
    661
  ],
  "sentences": [
    "I would have had the Texas Rangers  the FBI of Texas, except they are not corrupt and incompetent  in that department in about 30 seconds with orders to secure every bit of evidence and to perform a brutal autopsy of the incompetence and cowardice that led to so many deaths.",
    "Instead, John Cornyn, who damn well should know better, comes out with a series of tweets railing at us for pointing out the manifest failures: The second guessing and finger pointing among state and local law enforcement is destructive, distracting, and unfair.",
    "I like to make spaghetti at Christmas (or, actually, the day before, on my birthday  dont ask) and its taken years for abuela to accept that her guest will be cooking for even one day when we are visiting Houston over the holidays.",
    "The bottom line is that if you were a kid and in Stockholm and went over to your friend Olafs house to play, at dinner time Olaf would ditch you in his bedroom, go off and eat, and you would not be invited to join in.",
    "Yeah, Texas is prosperous, but even if it stays that way under Grandpa Badfinger, prosperous people soon forget why  and apparently so do Republican leaders who cannot imagine a Texas without themselves in command.",
    "I dont understand how the members of the Texas gentry GOP let those lame Uvalde cops, led by what is reported to be a Beto donor, lie to them and yet have still not unleashed their righteous retribution.",
    "We just had a lot of the old gang from San Mateo (where I grew up) over for my dads service (BTW  kudos to the outstanding Navy honors team for a powerful final sendoff to LCDR Stephen L. Schlichter).",
    "And we were cracking up about how my mom could not keep ice cream or other goodies in the house because we and the neighborhood kids would descend like locust and eat her out of house and home.",
    "The Twitter thread that unleashed this mind-blowing Viking 411 is the highest and best use of the bird service  it teaches you something new and gives you the ability to bitch about it.",
    "That noxious furry Beto came within a few points of knocking off Ted Cruz (in his defense, the GOP establishment seems to dislike him), and the left is constantly targeting the state.",
    "Greg Abbott was publicly disrespected by the failed leadership of the Uvalde Uniformed Passive Observer Department when they lied to him and got him enlisted in their cover-up.",
    "Maybe when you run everything you do not want to be seen as upsetting the apple cart, but the apple cart is going to get upset hard if you allow failure to go unaddressed.",
    "Then Senator John Cornyn  or maybe the intern who runs his Twitter account  got ratioed hard for telling us to back off the cops who had to make split-second decisions.",
    "Lets Talk About Guns, National Divorce, Civil War, and Other Scary Stuff\nMy new book is coming out July 12th and it covers the worst-case scenarios we might face.",
    "They inherited a red state, and they do not seem to appreciate their political trust fund any more than some Adderall-addled heiress appreciates hers.",
    "The latest is The Split, but get all these action-packed bestsellers, including People's Republic, Indian Country, Wildfire, Collapse, and Crisis!",
    "My new book is dropping soon and you should check it out because its all about the current chaos  and how it can get much, much worse.",
    "Ron DeSantis turned Florida red, but the current Lone Star State mandarins did not win over Texas from the Democrats themselves.",
    "The problem was way too many splitable seconds passed before the Border Patrol got tired of toobining and iced that scumbag.",
    "The Texas GOP is getting soft and it needs to tighten the hell up before it gets its Stetson shoved up its Beto-hole.",
    "That cold snap crisis was bad enough  Id love to pass the blame onto the Dems but there are none in statewide office.",
    "Well Be Back: The Fall and Rise of America talks about all sorts of terrible scenarios that America might well face.",
    "And its not like Scotch-Germans are a particularly giving people, but the idea of starving guests is just bizarre.",
    "I am obsessed with the revelation that Swedes and other Nordic people do not routinely offer to feed their guests.",
    "The Problem with Texas Republicans\nIm baffled about why the Texas GOP is composed of so many squishy puffs.",
    "Where is the Welcome Wagon program for new Texans that Glenn Instapundit Reynolds has long been advocating?",
    "Luckily, my Townhall VIP column provides a forum to share the insane stuff I come across, political or not.",
    "And to everyone else without a horn helmet, but a lot of people claim thats how it works in the arctic.",
    "Check out this thread (Caution: NSFW because people are freaking out because it is so weird).",
    "The Cuban in-laws force feed me empanadas every time I show up (which is fine with me).",
    "Its soft, and if Ron DeSantis was not setting a potent example it would be even softer.",
    "Its pretty amusing even as it is scary as hell  particularly because it is non-fiction.",
    "Now Cornyn is playing footsie with the enemy, talking about compromising our rights.",
    "Yeah, it is easy to criticize  because the local yokels so obviously screwed up.",
    "Unfortunately, they seem to be coming true before the book can even come out.",
    "Sit back and rely on having a less-miserable economy than the blue states?",
    "How the hell do you not take the lead on demanding accountability here?",
    "And dont forget my Kelly Turnbull series of conservative action novels.",
    "Easy to criticize with 20-20 hindsight, his social media intern wrote.",
    "Well, you guys better  because if you keep up this way its coming.",
    "I dont know where to go with that except to shake my damn head.",
    "My super-secret email address is kurt.schlichter@townhall.com.",
    "Okay, Twitter is hell but occasionally you learn something.",
    "Look, its not like Id want their Nordic cuisine  herring?",
    "There will be soon, if these people do not get motivated.",
    "Maybe the Texas GOP is spoiled, and thats why its soft.",
    "So are most of the people responding to the thread.",
    "Complex scenarios require split second decisions.",
    "But Im just totally weirded out by this.",
    "Where are the party-building activities?",
    "Whats With These Stingy Viking Weirdos?",
    "Of course whoever was around got fed.",
    "And I did, about Nordic people.",
    "It seems they dont feed guests.",
    "The whole thing is nuts to me.",
    "What does the Texas GOP do?",
    "Where is the leadership?",
    "This is insane to me.",
    "Twiddle its thumbs.",
    "Barren wine women.",
    "National divorce.",
    "Pre-order it now.",
    "Whats the plan?",
    "What the hell?",
    "Count me out.",
    "Its so weird.",
    "Civil war.",
    "But no."
  ]
}