{
  "id": 8861,
  "mediaId": 223,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "A 2024 Trump-Biden Death Match?",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/207/72c54906-3664-4a33-a892-5367e3d37973.jpg",
  "link": "https://townhall.com/columnists/byronyork/2022/06/01/a-2024-trumpbiden-death-match-n2608031",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Byron York",
  "authorUrl": "https://townhall.com/columnists/byronyork/",
  "termIds": [
    661
  ],
  "sentences": [
    "On the Democratic side, the results were 23% for Biden, while 9% named Vice President Kamala Harris, 8% named Sen. Bernie Sanders, 7% support 2016 nominee Hillary Clinton and 5% back Transportation Secretary Pete Buttigieg.",
    "When there is a relatively new president, still before his first midterms, it is assumed that 1) he will run for re-election, and 2) he will easily secure his party's nomination, almost always without opposition.",
    "There were a few other names lower down -- Sen. Marco Rubio, Sen. Tim Scott, former Secretary of State Mike Pompeo -- and a fairly large percentage, 28%, who said they were unsure or would choose someone else.",
    "A new poll from Mark Penn, the former Clinton strategist who runs the Harvard-Harris Poll, suggests President Joe Biden's support among Democrats is significantly weaker than Trump's support among Republicans.",
    "For all the speculation that goes on around Donald Trump and the 2024 Republican presidential nomination race, it's possible, even likely, that the more intense battle will be among Democrats.",
    "\"He has said in private that he sees himself as the only thing standing between the country and the Trumpian abyss and has instructed his aides to redouble their planning for a rematch.\"",
    "It says that even in his weakened condition -- old, slowing down, job approval rating stuck around 40% -- Biden is probably the Democrats' best hope of keeping the White House in 2024.",
    "Biden's obsession with Trump, and Trump's obsession with avenging his loss in 2020, could lock the two men -- one 82 years old, the other 78 -- into a sort of political death match.",
    "A recent article in New York magazine detailed the party's agonizing search for an alternative to the president -- and the fear that there might be no good alternative.",
    "View Cartoon\nThe result is stunning for Biden -- only 23% of Democrats said they would vote for the sitting president of their party if the primary were today.",
    "But even at that, of course, Biden is stronger than the rest of the Democratic field, if a Democratic field can be said to exist at this moment.",
    "And when Penn then asked voters about a Biden-Trump general election matchup, Trump won, but it was close -- 45% to 42%, with 13% unsure.",
    "The president does not seem to realize, or does not seem to care, that many Americans do not believe he should run again at age 82.",
    "And to Democrats, he asked, \"If the Democratic presidential primary for the 2024 election was held today, who would you vote for?\"",
    "To Republicans, he asked, \"If the Republican presidential primary for the 2024 election was held today, who would you vote for?\"",
    "Biden, the article reported, is convinced that 1) Trump must be stopped, and 2) the only person who can stop him is Joe Biden.",
    "This content originally appeared on the Washington Examiner at washingtonexaminer.com/opinion/a-2024-trump-biden-death-match.",
    "\"Biden is sustained by his contempt for Trump and the imperative of keeping him out of office,\" Debenedetti continued.",
    "\"As far as Biden's camp is concerned, there isn't any ambiguity about 2024 at all,\" author Gabriel Debenedetti wrote.",
    "In comparison, Trump is a more powerful presence in the Republican race than Biden is in the Democratic contest.",
    "\"Facing a country dubious that he will run, Biden just gets more convinced that he must,\" Debenedetti wrote.",
    "The vice president won, but narrowly -- 41% to 38%, with a large contingent, 20%, unsure.",
    "Another fairly large number of people, 31%, said they were unsure or named someone else.",
    "The results: Forty-one percent of Republicans named Trump, while 12% named Florida Gov.",
    "The strongest believer in the no-alternative view, of course, is the president himself.",
    "Ron DeSantis, 7% named former Vice President Mike Pence, and 4% each named former U.N.",
    "(Byron York is chief political correspondent for The Washington Examiner.)",
    "Unless one or both parties' voters decide it should not come to that.",
    "\"'If Trump is alive,' one veteran adviser says, 'Biden is running.'\"",
    "Then Penn asked about one last contest: Harris versus DeSantis.",
    "It might not be a good hope, but it is the party's best hope.",
    "This is a subject of intense discomfort among many Democrats.",
    "Then Penn asked about another matchup: Harris versus Trump.",
    "Of course, there shouldn't be a Democratic field at all.",
    "There shouldn't even be a race on the Democratic side.",
    "Trump won more handily -- 47% to 40%, with 13% unsure.",
    "And that could lead to chaos on the Democratic side.",
    "In Joe Biden's case, neither is guaranteed.",
    "Ambassador Nikki Haley and Sen. Ted Cruz.",
    "Penn's question was very simple.",
    "So what does all this say?",
    "That is weak, weak, weak."
  ]
}