{
  "id": 8868,
  "mediaId": 157,
  "date": "6/1/2022 12:00:00 AM",
  "headline": "Who would Jesus exclude?: Marco Rubio mocked for kicking off Pride Month with bizarre claim",
  "image": "https://www.rawstory.com/media-library/senator-marco-rubio-plans-to-announce-something-at-miami-freedom-tower-report.jpg?id=24485808&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.rawstory.com/marco-rubio-lgbtq-issues/",
  "sentiment": "0",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Badash",
  "authorUrl": "https://www.rawstory.com/u/david_badash_the_new_civil_rights_movement",
  "termIds": [
    661
  ],
  "sentences": [
    "\"Biden will be cutting off Pell Grants,school lunches & billions of other federal education dollars to any school or college that refuses to follow his new & radical transgender & LGBT policies,\" Sen. Rubio tweeted, apparently unaware the \"T\" in LGBT stands for transgender.",
    "In a separate statement dated three days prior, Secretary Cardona warned Governor Ron DeSantis over the Florida Republican's \"Don't Say Gay\" bill, saying, \"we will be monitoring this law upon implementation to evaluate whether it violates federal civil rights law.",
    "Senator Marco Rubio (R-FL) kicked off LGBTQ Pride month Wednesday morning claiming President Joe Biden has a \"radical\" LGBTQ policy and will cut off federal funding to schools that refuse to follow it.",
    "Rubio might be referring to a March 31 press release from U.S. Secretary of Education Miguel Cardona, who traveled to Rubio's home state of Florida to observe the annual Transgender Day of Visibility.",
    "\"On Transgender Day of Visibility and every day, the Biden-Harris administration is proud of our nation's transgender students and educators,\" said Secretary Cardona in the press release.",
    "The executive branch has the constitutional responsibility to enforce federal laws, including civil rights laws, and the authority to set and enforce policy and tie it to federal funds.",
    "We know while many transgender students experience valuable support at school, many others face significant challenges because of hostility directed at them by others.",
    "To transgender students everywhere, I want you to know that we see you, we hear you, we recognize what is happening, and we're here to support you.\"",
    "Rubio's tweet generated thousands of responses, including these:\nI am tired of paying your salary as you continue to violate the Constitution.",
    "https://t.co/4JO4HGmtIP\n Florida Chris (@chrislongview) June 1, 2022\nTreating all people equally isnt radical - it humane and moral.",
    "Jan Marie  (@i_am_jan_marie) June 1, 2022\nNice job Little Marco, especially on the first day of the celebration of LGBTQ pride.",
    "https://t.co/aHWhgBLoNu\n Hedy Salazar (@queeniema52) June 1, 2022\nThats what happens when you violate the civil rights act.",
    "Irishrygirl (@irishrygirl) June 1, 2022\nBiden wants humans to be treated like humans, and you call that radical.",
    "Homosexuality and Transgendered people were well known in the ancient world, yet Jesus said nothing about that.",
    "This includes a growing number of state laws that bully and intimidate LGBTQI+ students and their families.",
    "It's unclear if that is what Sen. Rubio was referring to, but Secretary Cardona made clear the U.S. Dept.",
    "You work for us, stop proselytize your religious beliefs which violate the separation of church & State.",
    "You mean our tax dollars will no longer support schools that openly discriminate against children?",
    "Whats radical is not allowing people to live their lives free from discrimination and hate.",
    "His press secretary was unavailable and did not immediately return a phone call to NCRM.",
    "anderson (@RobAnderson2018) June 1, 2022\nIt's a weird feeling hearing your U.S.",
    "https://t.co/6mINs95GGD\n Josh Moon  (@Josh_Moon) June 1, 2022\nLets see Marco.",
    "\"Transgender students should have every opportunity to thrive in school.",
    "Are you sure youre not worshiping a god created in your own image?",
    "You spew hate, venom & encourage people to discriminate.",
    "Frank Giugliano (@nyccookies) June 1, 2022\nOh noooo.",
    "Senator Rubio offered nothing to support his claim.",
    "of Education enforces federal civil rights laws.",
    "Well I am... actually pretty pleased about that.",
    "Live your life like the Bible versus you quote.",
    "What kind of fuking 'Christian' are you?",
    "Senator say he hates you out loud.",
    "What is wrong with you, seriously?",
    "Abortion either, for that matter.",
    "(@LayneDarlin) June 1, 2022",
    "God must really love you.",
    "Who would Jesus exclude?",
    "Layne Democracy Matters.",
    "Love thy neighbor.",
    "U.S."
  ]
}