{
  "id": 8874,
  "mediaId": 18,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "The Latest: India announces easing of lockdown restrictions",
  "image": "https://www.bostonherald.com/wp-content/uploads/2020/04/Virus_Outbreak_China_53311-1-1.jpg?w=1569",
  "link": "https://www.bostonherald.com/2020/04/25/the-latest-india-announces-easing-of-lockdown-restrictions/",
  "sentiment": "0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.bostonherald.com/author/associated-press/",
  "termIds": [
    661
  ],
  "sentences": [
    "China says no new deaths from virus for 10th straight day\nSouth Korea reports only 10 new cases of virus and no new deaths\nNEW DELHI  India announces easing of a stringent lockdown for 1.3 billion people by allowing opening of neighborhood and standalone shops with restrictions such as 50% of workers with face masks and social distancing.",
    "While a slowing caseload has allowed South Korea to relax its social distancing guidelines over the past week, Prime Minister Chung Sye-kyun raised concern over possible transmissions by quiet spreaders and instructed officials to conduct antibody tests in Daegu and nearby towns to learn how widespread the coronavirus is.",
    "UNITED NATIONS  The president of the worlds largest humanitarian network is urging governments to start thinking about something like the Marshall Plan that helped countries recover after World War II to help nations tackle the impact of the coronavirus pandemic.",
    "SEOUL, South Korea  South Korea has reported 10 fresh cases of the new coronavirus, the eighth day in a row its daily jump came below 20, as its outbreak slows amid tightened border controls and waning infections in the worst-hit city of Daegu.",
    "WASHINGTON  Officials say the top Navy officer has recommended the reinstatement of the aircraft carrier captain fired for sending a fraught email to commanders pleading for faster action to protect his crew from a coronavirus outbreak.",
    "Francesco Rocca, who leads the International Federation of Red Cross and Red Crescent Societies which operates in 192 countries, also warned of the risk that the COVID-19 crisis will lead to social unrest, hunger and starvation.",
    "The health department estimates that 2% of Louisianans who contract COVID-19 are dying from it, based on modeling of the number of residents presumed to have been infected, said Jeanie Donovan, policy director for the agency.",
    "Before work on the projects can resume, all contractors must develop and post a plan at each site that addresses use of the personal protective equipment like masks and gloves, on-site social distancing and sanitation.",
    "Just 838 people remain hospitalized with COVID-19 while another 1,000 people are undergoing isolation and monitoring for being either suspected cases or having tested positive for the virus while showing no symptoms.",
    "Twelve new cases were reported on Saturday, 11 of them brought from overseas and one local transmission in the northeastern province of Heilongjiang bordering on Russia, according to the National Health Commission.",
    "Chung also called for stronger financial tools to ease the epidemics economic shock, which has caused severe cashflow problems for airlines while also hurting major exporters such as carmakers and shipbuilders.",
    "ROME  Opposition lawmakers in Italy are demanding that the justice minister tell Parliaments anti-Mafia commission how a convicted organized crime boss was given house arrest due to the COVID-19 outbreak.",
    "Amid positive trends in Louisianas coronavirus outbreak, officials are grappling with a death rate from the virus that appears higher than other states while outpacing Louisiana officials own modeling.",
    "The government is looking to create a 40 trillion won ($32 billion) fund through bonds issued by state-run banks to protect jobs in key industries, but the plan needs parliamentary approval.",
    "Earlier Friday, French authorities said France wont reopen its restaurants, bars and cafes before June, as they announced reinforced financial support for the sector amid the virus crisis.",
    "Justice, a billionaire coal and agricultural businessman without previous government experience, said the state will take baby steps in lifting virus restrictions to avoid a jump in cases.",
    "Pharmacy test sites would be part of efforts to expand testing to broader categories of people, including those with no symptoms but who believe they may have been exposed, DeSantis said.",
    "TALLAHASSEE, Fla.  Floridas governor says his administration plans to let pharmacists administer tests for the new coronavirus to expand availability of testing for the general public.",
    "Ron DeSantis says the state surgeon general would authorize pharmacists under emergency regulations, but he did not elaborate or say when this kind of testing might be rolled out.",
    "WILLMAR, Minn.  A Hormel Foods subsidiary says its halting production at a pair of Minnesota turkey-processing facilities after some employees tested positive for the coronavirus.",
    "Rocca said COVID-19 is also going to have a great social impact in every part of the world and we need to plan together with institutions a social response before it is too late.",
    "In addition, a site-specific supervisor will be designated to enforce the safety plan to monitor the health of employees, and employees will undergo training on the new policies.",
    "South Koreas economy shrank 1.4% during the first three months of the year, the worst contraction since late-2008, as the pandemic hit both domestic consumption and exports.",
    "Gilday met with Gen. Mark Milley, chairman of the Joint Chiefs of Staff, on Tuesday and with Defense Secretary Mark Esper on Friday morning to lay out his recommendations.",
    "Residents can seek testing through their doctors and private clinics, or go to one of the states seven drive-through and six walk-up sites  if they meet certain criteria.",
    "PARIS  A French hotel executive predicts his business will remain catastrophic for the rest of this year and is counting on government help to survive the virus crisis.",
    "Jim Justice has rolled out aggressive steps to reopen daycare places and restaurants without setting specific benchmarks on testing, equipment and coronavirus tracking.",
    "But after the ward was converted to care for inmates with coronavirus infections, that treatment wasnt available and he was transferred to temporary house arrest.",
    "One week later, most shops will be given the green light to reopen at the same time, though close-contact professions like barbers will have to wait another week.",
    "The Louisiana Department of Health offered reporters a first detailed look at the states modeling of deaths from the COVID-19 disease caused by the coronavirus.",
    "Last week, the government allowed resumption of manufacturing and farming activities in rural areas as millions of daily wage-earners were left without work.",
    "Jay Inslee has announced a plan that allows existing construction projects to resume as long as strict coronavirus social distancing protocols are followed.",
    "Serge Cachan, president of the Astotel chain of Paris hotels, tells The Associated Press: Zero percent in April, probably in May and probably in June.",
    "The figures released from South Koreas Centers for Disease Control and Prevention on Saturday brought national totals to 10,718 cases and 240 deaths.",
    "The department is trying to determine why the death rate is double what was expected and varies considerably among regions of the state, she said.",
    "A home ministry statement issued late Friday says that shops in single and multi-brand malls would not be allowed to open anywhere in the country.",
    "Thats according to officials who spoke on condition of anonymity to discuss the results of an investigation that have not yet been made public.",
    "More than 1,600 Louisiana residents have died from COVID-19, about 6% of all positive tests for the coronavirus announced so far in the state.",
    "Speaking in broad strokes, the Republican governor said he wanted daycares and outdoor seating at restaurants to open as soon as possible.",
    "The conditions vary, with some sites focused on front-line responders, the elderly or people already showing some symptoms of COVID-19.",
    "Follow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak",
    "Italian state TV said Pasquale Zagaria had been receiving cancer treatment at a hospital ward for prisoners on the island of Sardinia.",
    "The worst-hit states are Maharashtra with 6,817 positive cases, Gujarat with 3,815 cases, New Delhi 2,514 and Rajasthan 2,034 cases.",
    "Jennie-O Turkey Store Inc. says 14 employees have tested positive at two plants in Willmar, in western Minnesota, as of Thursday.",
    "After May 3, hospitals will progressively open to some non-essential tasks and textile shops also will be allowed to reopen.",
    "Construction was halted under the stay-at-home order and closure of non-essential businesses that Inslee ordered last month.",
    "The plants are the latest to close nationally as meat processing plants wrestle with coronavirus infections among workers.",
    "Jennie-O President Steve Lykken says the facilities will be deep cleaned while the company figures out a plan to reopen.",
    "He says the company has taken steps to protect workers, including physical distancing and personal protective equipment.",
    "China, widely believed to be the source of the global pandemic, has reported a total of 4,632 deaths among 82,816 cases.",
    "For some, especially older adults and people with existing health problems, it can cause more severe illness or death.",
    "Also, as of May 18, the government will allow internal travel to the coast and the hilly, wooded Ardennes forests.",
    "State TV said the justice minister had ordered an administrative investigation into Pasquale Zagarias transfer.",
    "An official says Esper has asked for a delay in any public announcement while he considers the recommendation.",
    "The relaxation also would not be applicable in hundreds of hotspots and containment zones across the country.",
    "The strategy comes days after he announced hospitals will resume elective procedures as early as next week.",
    "But that testing data doesnt reflect those who never develop symptoms and never get tested for the virus.",
    "The company didnt immediately respond to a question about how many turkeys the plants process daily.",
    "The Home Ministry said the rise in number of positive cases in India is linear, not exponential.",
    "India imposed a lockdown for its 1.3 billion people on March 25 and it is due to end on May 3.",
    "India has so far reported more than 24,500 positive new coronavirus cases and 775 deaths.",
    "While Louisianas falling hospitalization rate is tracking the projected results for Gov.",
    "When you have no theaters, and when you have no planes, and when you close the borders.",
    "BEIJING  For the 10th straight day, China reported no new deaths from the coronavirus.",
    "BRUSSELS  Belgium is taking its first serious steps to relax its coronavirus lockdown.",
    "Bar and restaurants will be allowed to start reopening as of June 8, as will be zoos.",
    "The country also on Saturday reported no new deaths for the second straight day.",
    "John Bel Edwards stay-at-home order, the death rate is higher than expected.",
    "TOP OF THE HOUR:\n Navy recommends reinstatement of fired carrier captain.",
    "The new coronavirus causes mild or moderate symptoms for most people.",
    "By The Associated Press\nThe Latest on the coronavirus pandemic.",
    "Protective masks will be mandatory on public transportation.",
    "Other tourist sites like museums will also remain closed.",
    "Why should a hotel be open when you have no clients?",
    "Adm. Mike Gilday has recommended that Navy Capt.",
    "Travel authorizations will also be expanded.",
    "Lolita C. Baldor and Robert Burns reported.",
    "He forecasts losses this year of 60-70%.",
    "Brett Crozier be returned to his ship.",
    "The plants employ about 1,200 workers.",
    "CHARLESTON, W.Va.  West Virginia Gov.",
    "OLYMPIA, Wash.  Washington Gov.",
    "When you have no restaurants.",
    "Why should the people come?",
    "BATON ROUGE, La.",
    "No museums.",
    "he asked.",
    "Gov."
  ]
}