{
  "id": 8875,
  "mediaId": 65,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "Media darling Rebekah Jones' claims of Florida COVID data manipulation 'did not occur,' IG says",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/3cda1584-23c6-4530-b0af-d5f460ba2f64/49d71fce-5ecd-47a0-99c3-73a96ce62f29/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/media-darling-rebekah-jones-florida-covid-data",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Flood",
  "authorUrl": "https://www.foxnews.com/person/f/brian-flood",
  "termIds": [
    661,
    2161,
    6231,
    6399,
    106,
    3280,
    3410,
    6263,
    2661
  ],
  "sentences": [
    "Jones was officially fired for insubordination; her personnel files, uploaded by National Review, revealed repeated infractions documented by her superiors, including posting on \"social media regarding data and web product owned by the Department that she works on without permission of management or communications,\" and potentially exposing personnel data on the geographic information system (GIS) dashboard she managed.",
    "CNN'S JAKE TAPPER RETWEETS CRITICISM OF REBEKAH JONES AFTER PROMOTING HER FAKE CONSPIRACIES ON-AIR\nCornell Law School professor and media critic William A. Jacobson believes mainstream media coverage of Jones \"continued the tradition of treating incredible people as credible based on how damaging their accusations would be to a Republican\" in power.",
    "\"The manipulation of COVID data in the early stages of the pandemic was surely a news story needing full coverage from multiple perspectives, but the media found it too easy to support Jones without fully considering context or even what her motivations might have been,\" McCall continued.",
    "CNN HEAVILY PROMOTED REBEKAH JONES' FAKE CONSPIRACY ACCUSING DESANTIS ADMIN OF ALTERING COVID DATA\nFrom May 2020 to December 2020, Jones made at least nine separate on-air appearances on CNN shows, most often on \"Cuomo Prime Time.\"",
    "Rebekah Jones, the fired Florida health official who became a media darling in 2020 after she accused the Ron DeSantis administration of pressuring her to fudge the state's COVID data, saw her claims quietly fall apart last week.",
    "CRITICS BASH MEDIA FOR HAVING ELEVATED REBEKAH JONES AMID NEW REVELATIONS OF HER ABUSIVE BEHAVIOR IN REPORT\nMedia Research Center contributing writer Clay Waters wrote that the \"sordid saga\" of Jones is officially closed.",
    "National Review senior writer Charles C. W. Cooke didnt appreciate the Heralds coverage, either, and responded to a tweet sent by a reporter for the paper after the inspector generals report was unveiled.",
    "Jones, who channeled her media fame into becoming a Democratic candidate for Congress challenging Rep. Matt Gaetz, R-Fla., spent two years making public claims that DeSantis administration falsified data.",
    "Waters wrote that the Herald also published \"provocative articles in support of Jones, while minimizing the disturbing charges of Jones cyberstalking a former boyfriend, and other run-ins with the law.\"",
    "DePauw University journalism professor Jeffrey McCall said the establishment media's boosting of Jones had less to do about getting COVID data correct than it did about trying to discredit DeSantis.",
    "The Jones saga fit that narrative nicely, so she became the media darling, with outfits like CNN promoting Jones's allegations with insufficient support or vetting,\" McCall told Fox News Digital.",
    "She is also a conspiracy theorist hyped in the press, appearing as a DeSantis basher on CNN with disgraced former host Chris Cuomo, and hailed by lefty host Joy Reid on MSNBC,\" Waters continued.",
    "Jones has long claimed the Florida Department of Health manipulated coronavirus numbers at the Republican governor's behest to allow the state to reopen at the height of the pandemic.",
    "The status is available to anyone who works or worked at a Florida state agency and makes claims of criminal wrongdoing, and prevents retaliation for advancing those claims.",
    "However, her story was declared to be bogus by an internal report by Inspector General Michael J. Bennett, who investigates whistleblower complaints in the Sunshine State.",
    "\"The media narrative on DeSantis was that he was recklessly mismanaging Covid while trying to reopen his state, and thus, stories had to be pushed to support that theme.",
    "Other outlets, including MSNBC, Miami Herald, The Washington Post and NBC News helped build Jones profile, and she received an adoring profile in Cosmopolitan.",
    "Now that the story has been exposed as a fable, CNN and other media who hyped the accusations have mostly moved on,\" Jacobson told Fox News Digital.",
    "\"Based upon an analysis of the available evidence, the alleged conduct, as described by the complainant, did not occur,\" the report said.",
    "\"Our office feels that the report speaks for itself so we arent adding further comments,\" a DeSantis spokesperson told Fox News Digital.",
    "Jones initial claims were bolstered by the mainstream media, and the glowing coverage elevated her profile on a national level.",
    "\"It will be interesting now to see how much traction this inspector general's report gets from the establishment media.",
    "Critics blasted the Herald for the editorial, and that was before the inspector generals report debunked her claims.",
    "\"Jones is not a scientist, as some press coverage stated, but a data mapper with a masters degree in geography.",
    "Former CNN star Chris Cuomo made Jones a semi-regular on the show, speaking to her on at least five occasions.",
    "Odds are it will get little visibility, lest the media have to scrape some egg off of its collective face.\"",
    "\"She claimed she was told to falsify data and was fired for not doing so -- data she never had access to.",
    "A year ago, the Miami Herald was pounded for an editorial hailing Jones receiving \"whistleblower\" status.",
    "\"But perhaps most disappointing was Jones hagiographic treatment in the news pages of the Miami Herald.\"",
    "At the time, the title was unremarkable and did not bestow any additional credibility upon her claims.",
    "But the Herald celebrated her status anyway, calling it \"a win over state secrecy for the rest of us.\"",
    "\"In this case, the target was Republican star Governor Ron DeSantis, so anything went.",
    "And a new state report shows Jones wasnt told to falsify data at all,\" Waters wrote.",
    "Fox News David Rutz and Joseph A. Wulfsohn contributed to this report.",
    "It laundered her lies about the whistleblower process,\" Cooke wrote.",
    "\"Your paper spent two years laundering Joness lies.",
    "\"Its been a disgraceful performance.\"",
    "It laundered her lies about lying.",
    "It laundered her initial lies."
  ]
}