{
  "id": 8876,
  "mediaId": 302,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "If property values are soaring, why do school districts need more money?",
  "image": "https://www.tampabay.com/resizer//lTBC2424Px8vO-IBOmSmNTxsEGc=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/HOS33OUK2BG37JKICM4LPC6OUQ.jpg",
  "link": "https://www.tampabay.com/news/education/2022/05/31/if-property-values-are-soaring-why-do-school-districts-need-more-money/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Hot topics\nPublic comment: The Brevard County sheriff has told the School Board his deputies will not enforce the boards policy of removing speakers who make comments deemed out of order by the chairperson, Florida Today reports.",
    "Backers in both counties will have to explain that rising property values have not created a windfall for the public schools, but understanding that point requires a foray into the byzantine world of public school funding.",
    "As with Hillsborough, even if the school district increases their rate, its still not going to be as much as it was in 2015-16, said Linda Cobbe, a retired Pasco district spokesperson who is campaigning to pass the tax.",
    "In a year of sticker shock for homeowners and renters, school leaders in two Tampa Bay counties are pitching a product that could be a tough sell: Higher property taxes to support public schools.",
    "Beth Brown, a retired Pasco principal who is chairperson of the Lift Up group, did not argue either point, but insisted Pasco has little choice if it wants to hold onto a skilled teaching force.",
    "Subscribe to our free Gradebook newsletter\nFor example, its taxing formula once gave districts $2 for every $1,000 of assessed value to spend on capital needs, like new schools and renovations.",
    "Career education: Plans for a new collegiate high school in Bay County were bolstered with a $7.6 million grant from Deepwater Horizon recovery funds, the Panama City News Herald reports.",
    "Gender issues: A Broward County parent group accused the school district of supporting students who want to hide their transgender identity from their families, Fox News reports.",
    "But the support for social-emotional learning gave way to a strong disdain among many, who lumped it in with other unsolicited theories that may lead to student indoctrination.",
    "The state determines how much money each district will receive based largely on how many students are expected to enroll, and the needs of those with disabilities.",
    "Theres nothing in the modern era in America that has anything to do with violence that would be funny in a school environment, Martin Sheriff William Snyder said.",
    "Taxes: The Clay County school district is seeking renewal of its four-year local-option property tax that supports safety and security measures, WKMG reports.",
    "The idea is to give each district enough money to run their schools and support their staff, whether they live in pricey Miami Beach or rural Gadsden County.",
    "Part of the pitch is the fear that teachers will leave for higher salaries offered by districts that already have the tax  or leave teaching altogether.",
    "As happened with the Florida Lottery, he said, the Legislature could continue to cut school funding as school districts collect more local taxes.",
    "In addition, school funding is set by the Legislature in a holistic way that does not reward individual districts for rising property values.",
    "They have also held informational sessions with staff, although Connor acknowledged they cannot pressure employees to campaign for the tax.",
    "It is very humbling because I love teaching and I love bringing what I bring to the classroom, Greg Lyon told the Panama City News Herald.",
    "Central Ridge Elementary is one of 24 schools across the nation to receive a grant for the program, the Citrus County Chronicle reports.",
    "Every Thursday, get the latest updates on whats happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "Over the weekend, a Hillsborough County teen was arrested on accusations of suggesting he was armed and headed to the nearest school.",
    "In Hillsborough, the state-allowed taxation rate fell over the past decade from $5.63 per $1,000 in assessed home value to $3.60.",
    "Special voter-approved taxes are how many Florida schools are plugging gaps as state allocations have not kept up with inflation.",
    "A Lee County 10-year-old was arrested for text messages saying he was going to shoot up a school, the Associated Press reports.",
    "But in reality, districts are locked in a kind of arms race, with some passing new taxes and others following suit to keep up.",
    "In Pasco, a political action committee called Lift Up Pasco Schools has gone public with fundraising and community events.",
    "Thats a challenge in Hillsborough, long criticized by investment analysts and state leaders for chronic spending deficits.",
    "The big story: After Parkland, Floridas state government leaders made a big show of focusing on social-emotional learning.",
    "Corcoran left the DeSantis administration a month ago and has joined a lobbying firm, the News Service of Florida reports.",
    "Former education commissioner Richard Corcoran is the newest appointee to the State University System Board of Governors.",
    "Voters will wonder: If my house doubled in value over the past five years, arent the schools getting twice as much money?",
    "Like the lowering of taxing rates, Save Our Homes exists to make sure Floridians are not priced out of their own houses.",
    "The answer: Under Florida law, a sales tax can be used only for capital purchases, not ongoing expenses such as payroll.",
    "Ron DeSantis signed into law two measures that will make it easier for charter schools to operate, reimaginED reports.",
    "Her efforts will bring free feminine hygiene products to girls restrooms in several Hillsborough County high schools.",
    "For the first times in years, the Hillsborough district predicts it will end this fiscal year with a small surplus.",
    "Other school news\nA Hillsborough County teen started a nonprofit organization aimed at alleviating period poverty.",
    "In Martin County, a teen boarded a school bus wearing a Scream costume and carrying a fake knife, TC Palm reports.",
    "The student was not arrested for what was determined to be a poor year-end prank, but will face school discipline.",
    "Audience members asked why the district doesnt impose a sales tax so everyone will pay, not just property owners.",
    "Pinellas County voters have renewed a local-option property tax every four years since 2004, and by wide margins.",
    "But this year could be different as the Hillsborough and Pasco County schools go for higher property tax rates.",
    "Revenues from the 67 Florida school districts are essentially combined, then redistributed based on a formula.",
    "The campaigns in both counties include assurances that the districts are responsible with the money they have.",
    "I heard from a lot of neighbors and friends who had long-term subs (substitute teachers) all year, she said.",
    "The main one is that state government decides what tax rate school districts can impose on property owners.",
    "Before you go ... Depeche Mode keyboardist and co-founder Andy Fletch Fletcher passed away late last week.",
    "It was a way, they said, to tackle the mental health problems that might afflict a future school shooter.",
    "When property values increase, the state lowers the taxing rate to protect homeowners from runaway costs.",
    "A Palm Beach County private school reached a deal to continue operations in its current church location.",
    "A Bay County elementary school paraprofessional was named Florida school-related employee of the year.",
    "The question looms large as Hillsborough and Pasco ask voters for a tax to improve teacher, staff pay.",
    "Also, a law called Save Our Homes caps tax assessment increases for homesteaded owners to 3% a year.",
    "And the private sector is saying, We can pay you more than what youre getting paid in the classroom.",
    "A Citrus County elementary school will participate in a national effort to protect native plants.",
    "As time passed, the talk about keeping schools safe and improving services to students remained.",
    "For a $325,000 house with a $25,000 homestead exemption, that would work out to $300 every year.",
    "I have to figure out, how can I say this in the most layman terms so people can figure this out?",
    "said Terry Connor, deputy superintendent in Hillsborough and a point person on the tax effort.",
    "The two districts each want to raise as much as $1 for every $1,000 of taxable property value.",
    "The state lowered that amount to $1.50 after the 2008 financial crisis and never restored it.",
    "Addressing such concerns was more important than restricting access to guns, they contended.",
    "One of the first questions asked  and answered  was the one about rising property values.",
    "Even if voters approve the additional $1, the total rate will still be below 2012 levels.",
    "Maybe this is a losing battle because its rewarding the state for bad behavior, he said.",
    "What were trying to do is be competitive in attracting certified, qualified teachers.",
    "Three days later, Lift Up met with homeowners in Wesley Chapels Seven Oaks community.",
    "If districts want their share of state funding, they must abide by those rates.",
    "In Pasco, the rate dropped from $5.60 in 2015-16 to the current rate of $4.30.",
    "We are losing bus drivers to surrounding counties, because can you blame them?",
    "Nikki Smith wanted to know if it is safe to assume the tax will be permanent.",
    "And maybe youre working three days a week at home and two days in the office.",
    "In this post-pandemic market youve got a shift in the workforce, Connor said.",
    "But if those collections are high, the state kicks in less money.",
    "The only increase we get is from what the state says we will get.",
    "We will never be able to get enough of the iconic New Wave band.",
    "The school and church continue to feud in court, WPEC reports.",
    "Weve done what it takes to get right internally, Johnson said.",
    "District leaders so far have met with business organizations.",
    "said Romaneir Johnson, Hillsboroughs chief financial officer.",
    "After Uvalde, that conversation began getting a closer look.",
    "The state has held down school funding in other ways, too.",
    "Jonathan Lockwood said the whole process seems illogical.",
    "Such taxes, by law, are up for renewal after four years.",
    "More adjustments are made for an areas cost of living.",
    "Local tax collections become part of the calculation.",
    "Dozens of these measures have passed successfully.",
    "Hillsborough is rolling out its campaign quietly.",
    "A virtual town hall meeting took place on May 23.",
    "Ive never seen a tax that goes away, she said.",
    "If they are low, the state contributes more.",
    "You have teachers with a certain skill set.",
    "The measures are on the Aug. 23 ballot.",
    "The local tax can go through the roof.",
    "Sign up for the Gradebook newsletter!",
    "Meanwhile, school threats continued.",
    "Blue-collar workers are leaving too.",
    "Theres just nothing funny about it.",
    "The percentage can go up or down.",
    "There are several explanations.",
    "It is to create equity.",
    "Click here to sign up.",
    "Charter schools: Gov.",
    "Read more here.",
    "she said."
  ]
}