{
  "id": 8889,
  "mediaId": 169,
  "date": "5/31/2022 12:00:00 AM",
  "headline": "EXCLUSIVE: Now the far right is coming for college too  with taxpayer-funded \"classical education\"",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/04/statue-of-socrates-0413221.jpg",
  "link": "https://www.salon.com/2022/05/31/exclusive-now-the-far-right-is-coming-for-college-too--with-taxpayer-funded-classical-education/",
  "sentiment": "0",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kathryn Joyce",
  "authorUrl": "https://www.salon.com/writer/kathryn_joyce",
  "termIds": [
    661
  ],
  "sentences": [
    "Writing in the Washington Post, Matthew Garcia, the former director of the school's historical, philosophical and religious studies department, argued that what had once been two conservative centers subject to the normal process of faculty oversight and hiring procedures became an unaccountable institution exempt from normal governance, which spent lavishly on first editions of \"foundational\" books and subsidized international trips for its students, and where a university official allegedly said the program \"would never hire anyone that Koch doesn't approve.\"",
    "\"A late-stage example of corporate capture of the state\"\nThat's largely what happened in Arizona five years ago, when the state's right-wing legislature poured millions of dollars into transforming two \"freedom schools\" at Arizona State University, initially created with funding from the Koch network, into a new program, the School of Civic and Economic Thought and Leadership, which was deemed necessary because, according to a group of conservatives hired to develop the program, ASU suffered from \"conformity of opinion\" and \"lack of debate.\"",
    "According to the legislation, the center would be tasked, along with two other schools  the Florida Institute of Politics at Florida State University in Tallahassee and the Adam Smith Center for the Study of Economic Freedom at Florida International University in Miami  with helping create materials for the state's recently overhauled K-12 civics curriculum, whose stated aim is now to create patriotic, \"upright and desirable\" citizens.",
    "Ryan Girdusky, founder of the 1776 Project PAC, which campaigns against CRT, suggested in the early months of the pandemic that conservatives should seize the opportunity of disrupted classrooms to remake education along classical lines, since that approach alone could offer \"a perspective on history that doesn't teach [children] that the American system of government is inherently evil.\"",
    "It didn't help that one Flagler trustee perceived as being a key driver of the proposal, John Rood, a former ambassador under George W. Bush, also chairs the governing board of the Jacksonville Classical Academy  part of the nationwide charter school network created by Hillsdale College, a private Christian college in Michigan that has become a major player in America's culture wars.",
    "Hillsdale College's classical education offerings, for instance, include its \"1776 Curriculum,\" a right-wing answer to the \"1619 Project\" that declares the U.S. \"an exceptionally good country,\" casts slave-owning founding fathers as covert abolitionists and calls progressivism \"a rejection of the principles of the Declaration of Independence as well as the form of the Constitution.\"",
    "Wilson began researching the impact of the Koch network on education years ago while a student at Florida State, which made an unsavory deal with Koch donors, taking their money in exchange for allowing them a say in hiring and curriculum decisions, and, at one point, having a Koch-funded economics program create pro-capitalism lesson plans for both college and K-12 instruction.",
    "All this, of course, takes place against the larger backdrop of Florida's ongoing attacks on public education: Within the last year or two, DeSantis and the GOP-led legislature have enacted broad bans on teaching about racism and LGBTQ issues, barred numerous materials from classroom use and empowered citizens to sue schools they believe are \"indoctrinating\" students.",
    "To that end, Lee announced, he was budgeting $6 million to create a new \"Institute of American Civics\" at the University of Tennessee, Knoxville, which he said would serve as \"a flagship for the nation  a beacon celebrating intellectual diversity at our universities and teaching how a responsible, civic-minded people strengthens our country and our communities.\"",
    "Also included in Florida's proposed 2022-23 budget  or, more specifically, in an education bill attached to the budget, which details how Florida's new restrictions on teaching about racism in higher education should be enforced  is a similar proposal to create a think tank at the University of Florida in Gainesville, the state's flagship higher-ed institution.",
    "Last fall, UF sparked tremendous backlash after first blocking three political science professors from testifying in a lawsuit about Florida's new voting restrictions  their testimony, the university suggested, was contrary to the interests of the state  and then demanding that a professor revise a course that had the words \"critical\" and \"race\" in its title.",
    "\"A separate patronage system\" for right-wing thinkers and activists\nIn early April, Christopher Rufo, the right-wing activist and Manhattan Institute fellow widely credited with driving the right's crusade against \"critical race theory\" (CRT), delivered a speech at Hillsdale College, calling on conservatives to \"lay siege to the institutions.\"",
    "Much of the faculty uncertainty or apprehension isn't about what Flagler administrators have actually proposed but rather the context surrounding it: the coded meanings of \"classical ed,\" the updated model of state-funded university infiltration and the overall atmosphere of hostility to public education in Florida and around the country.",
    "While the most headline-grabbing aspect of his speech was Rufo's admission that the best way for conservatives to lure people away from public schools was to surround them with endless controversy  over CRT, pandemic health measures, LGBTQ students and whatever else  a brief aside during the Q&A session was arguably just as important.",
    "Dan Patrick, allocated an initial $6 million to create a think tank at the University of Texas at Austin, \"dedicated to the study and teaching of individual liberty, limited government, private enterprise and free markets\" and envisioned as a $100 million public-private partnership modeled on Stanford University's Hoover Institution.",
    "Then there was the promise to promote \"a balanced world-view,\" \"the value and responsibilities of citizenship,\" or what the college's president characterized as classical education without an \"ideological slant,\" which sounded like potentially coded language for the sorts of measures DeSantis and his allies had been promoting.",
    "(One product of that agreement, Wilson noted, was a K-12 curriculum called \"Common Sense Economics,\" which included, incredibly, a paper titled \"Sacrificing Lives for Profit,\" which argued, \"Corporations routinely sacrifice the lives of some of their customers to increase profits, and we are all better off because they do.\")",
    "Last fall, when professors at Flagler College, a private liberal arts school in St. Augustine, Florida, gathered for a faculty senate meeting, they learned that the college administration had worked with their local legislator to propose a new academic center on campus, the Flagler College Institute for Classical Education.",
    "Taylor said he personally believed that \"teaching the history, philosophy and religion of the so-called Western world is something we should be doing, and doing well,\" and worried that certain traditional subjects had fallen so far out of fashion that students might graduate without a strong grounding in basic civics.",
    "When eight professors, including Butler, Johnson and Bracewell, brought a resolution before the faculty senate in April, affirming that the center would remain \"under the jurisdiction and control of the faculty,\" it passed unanimously, with senior administrator Art Vanden Houten and the college president in support.",
    "A 2018 report by the progressive organization Unkoch My Campus describes Charles Koch's conviction that right-wing donors should focus less on targeting unreliable politicians to enact a pro-business agenda and more on building support for their ideas through donations that could trigger a long chain of outcomes.",
    "In April, after students at Yale Law School protested a speaker from the anti-LGBTQ legal firm Alliance Defending Freedom, Lee released a statement saying that his new Institute for American Civics was designed \"to be the antidote to the cynical, un-American behavior we are seeing at far too many universities.\"",
    "At a number of prominent colleges and universities around the country, big-money conservative interests are proposing and creating a roster of educational centers dedicated to conservative ideology or laissez-faire economics, often wrapped in the language of \"classical education,\" \"civics\" or \"freedom.\"",
    "Flagler's administration has taken pains to distinguish their proposed center from the larger swirl of polarization, saying that any hiring or curriculum decisions would go through the traditional process of faculty oversight, not outside interests from either the board of trustees or state government.",
    "What \"liberty\" and \"free society\" mean in this context may be clarified by the involvement of private donor Bud Brigham, a libertarian oil tycoon who blames academics for fostering the \"global warming scam\" and funded the production of not one but two movie adaptations of Ayn Rand's \"Atlas Shrugged.\"",
    "In a 1974 pamphlet, \"Anti-Capitalism and Business,\" Koch wrote that conservative philanthropy should aim to achieve a \"multiplier effect,\" and that for that purpose, \"education programs are superior to political action, and support of talented free market scholars is preferable to mass advertising.\"",
    "\"They see it as this industrial process where they fund all four stages and the end product is social change,\" said Ralph Wilson, founder of the progressive watchdog group Corporate Genome Project and coauthor of the recently-released \"Free Speech and Koch Money: Manufacturing a Campus Culture War.\"",
    "Among the classical public charter schools Hillsdale has helped found, some proclaim their unapologetic focus on the works of white men, which are said to represent the best of Western thought and the foundational heritage of any American student, no matter their racial or ethnic background.",
    "Specifically, these centers will help develop a series of \"oral history resources\" called Portraits in Patriotism that will include, for example, videos of Florida immigrants who fled countries like Cuba and Venezuela, to impress upon students \"the evil of communism and totalitarianism.\"",
    "To administrators, it was an exciting prospect: the chance to receive $5 million from the state to shore up their \"first year seminar,\" a universal core curriculum for incoming freshmen intended to help students, particularly first-generation students, prepare for the rigors of college.",
    "Read more on the American right's latest wave of assaults on education:\nKathryn Joyce is an investigative reporter at Salon, and the author of two books: \"The Child Catchers: Rescue, Trafficking and the New Gospel of Adoption\" and \"Quiverfull: Inside the Christian Patriarchy Movement.\"",
    "Other recent measures require faculty to undergo new reviews every five years to fight \"indoctrination,\" effectively ending the tenure system, and also require extensive documentation of resources used in course instruction and complicated new procedures for university accreditation.",
    "These could serve multiple purposes, he said, acting as \"magnets\" for conservative professors, creating right-leaning academic tracks that would influence incoming generations of students and, not least, founding \"a separate patronage system\" for conservative thinkers and activists.",
    "This flagship program, nurtured by the vision of right-wing economist James Buchanan and then fattened with Koch foundation funds, helped inspire conservative funding of academic departments, endowed chairs and standalone centers at more than 300 universities in the decades since.",
    "Institutes like George Mason's Mercatus Center today serve as \"nerve centers\" for conservative policy agendas, said MacLean, and also as talent pipelines, allowing funders to boast that they are rearing the next generation of staff for conservative think tanks and advocacy groups.",
    "Bill Lee delivered his \"state of the state\" address in late January, the biggest headlines were reserved for his announcement that Tennessee would partner with Hillsdale College to roll out more \"classical education\" charter schools, funded with taxpayer dollars, across the state.",
    "The enshrinement of a core \"Western canon\" to represent classical education, she notes, is not some timeless tradition, but a relatively recent creation born in the 20th century with the goal of assimilating new demographics of university students into a common national culture.",
    "\"But it's also the case that in an institution that's supposed to be run by faculty governance, you end up with administrators whose status and prestige interests are served by raising money, and the donors then can exercise undue influence on the priorities of the university.\"",
    "As that pattern has become more widely known, efforts to build or expand Koch-related centers at numerous schools have encountered pushback from students and staff, as with a recent effort to build a free-market Center for Philosophy, Politics and Economics at Brown University.",
    "That one position has since been transformed, with the help of private donations from the network of right-wing libertarian mega-donor Charles Koch, into a full-scale institution, the L. Charles Hilton Jr. Center for the Study of Economic Prosperity and Individual Opportunity.",
    "In February, the institute came into the news again in the aftermath of Patrick's angry vow to eliminate tenure at Texas' public universities following a resolution passed by UT Austin's faculty council supporting scholars' academic freedom to teach critical race theory.",
    "And the further you remove education from democratic oversight, the more likely it is that freestanding institutes like this become a way to have what they always dreamed of: a university without the disruptive forces of actual thought, contestation and new knowledge.\"",
    "One such document describes the institute's mission as educating students \"on the moral, ethical, philosophical and historical foundations of a free society\" and included plans to create a related civics course for high school students, much as in Florida and Arizona.",
    "Right-wing publications like the Washington Examiner, National Review and the American Conservative have all rolled out the phrase to mean the most conservative model of education or \"the natural replacement\" for \"critical race theory and other liberal curricula.\"",
    "The largest classical charter school network in the country, the Texas- and Arizona-based Great Hearts America, was engulfed in scandal in 2018 after one of its public charters directed students to balance the \"positive\" and \"negative\" aspects of slavery.",
    "\"What they're trying to do is stop the clock on what counts as 'canon,'\" said Bethany Moreton, a historian at Dartmouth College who has written extensively about the right and is author of the forthcoming \"Perverse Incentives: Economics as Culture War.\"",
    "But for most of those who've turned \"classical education\" into a buzzword or a franchise in recent years, it basically means exalting Western civilization, American exceptionalism and the notion that America was founded on \"Judeo-Christian\" principles.",
    "That work, in turn, would inspire advocacy organizations (either grassroots or astroturf), which create the appearance of broad public support, which ultimately leads politicians to pass laws that deregulate capitalism or defund the welfare state.",
    "The documents obtained by Texas Tribune also suggest that some of the project's supporters called for the institute to be exempt from the university's normal governance process, with its own budget and the power to appoint its own faculty.",
    "While the outcome at Flagler is still unclear on multiple levels, there were legitimate reasons for faculty to be alarmed, given the range of recent conservative assaults on public education, particularly but not exclusively in Florida.",
    "In more explicit terms than the Flagler proposal, the \"Hamilton Center for Classical and Civics Education\" at UF would be dedicated to \"the ideas, traditions, and texts that form the foundations of western and American civilization.\"",
    "Headed by former Trump official Carlos Daz-Rosilla, the center's stated mission includes studying \"the effect of government and free market economies on individual freedom and human prosperity,\" especially in the Americas.",
    "Documents obtained by the Texas Tribune made clear that university administrators worked closely with Republican lawmakers and school donors who saw the center as a means of bringing \"intellectual diversity\" to the campus.",
    "He doesn't think Flagler's proposal is a \"Trojan horse\" for a particular political project, he said, and if the state wants to support the school's efforts to retain first-generation college students, that's a good thing.",
    "Responding to the widespread conservative belief that liberals are winning the culture war, no matter what happens in Washington, Rufo suggested that the right should fight back by staging its own institutional takeover.",
    "Back at Flagler College, religious studies professor Timothy Johnson said that if Flagler's proposal had been framed with such an explicit emphasis on Western civilization, there would have been even stronger pushback.",
    "Within that process, Wilson said, \"the university is recognized as the key first stage of investment for social change, so the more they can capture universities, the more successful their political program will be.\"",
    "At the Jacksonville Classical Academy (overseen by one of Flagler's trustees), the mission statement emphasizes a vision to \"train students to be stewards of the Western Tradition and the pillars of a free society.\"",
    "\"So they become a willing audience, and in some ways even accomplices, to this expansion of right-wing influence in higher education that has not been earned on the merits of any intellectual argument or research.\"",
    "Ron DeSantis, a Trump-style Republican with his eyes on the White House, has imposed gag orders and mandates on K-12 schools and described universities as \"hotbeds of stale ideology\" and \"indoctrination factories.\"",
    "That perspective was elaborated by Koch's key adviser, Richard Fink, then the president of the Charles G. Koch Charitable Foundation, in a much-referenced paper from 1996 entitled \"The Structure of Social Change.\"",
    "For decades, right-wing donors have sought to establish beachheads in colleges and universities across the nation, from which they hoped to create an academic foundation for conservative or libertarian policies.",
    "In her 2017 book \"Democracy in Chains,\" Duke University historian Nancy MacLean chronicled the creation of the first such center, founded at the University of Virginia and later moved to George Mason University.",
    "Flagler's vice president of academic affairs, Arthur Vanden Houten, said in an interview that while Rood had \"enthusiastically responded\" to plans for the institute, he wasn't its only supporter or inspiration.",
    "The Liberty Institute at UT Austin was controversial from its inception, with student government calling on administrators to reject the offer and faculty expressing frustration with the lack of transparency.",
    "This spring, Florida's public universities began conducting annual surveys of students and faculty to ensure that campuses contain sufficient \"viewpoint diversity,\" in accordance with a law passed last year.",
    "Neither Sitharam nor two other faculty members at the university said they had been told much of anything about UF's proposed Hamilton Center, but from the little they had learned, they also had concerns.",
    "\"It's tricky to know what's going on because classical or liberal arts education is not merely an ideological project adopted by the American right,\" said Lorna Bracewell, a political theorist at Flagler.",
    "A key adviser to Charles Koch argued decades ago that donations to fund right-wing scholarship could achieve a \"multiplier effect\" that was far more effective than giving money to unreliable politicians.",
    "In states like Arizona, Texas and Florida where far-right donors have amassed considerable political influence, \"they have so much control that they can start implementing their agenda from the top down.",
    "\"It's not that the faculty suspect the administration is scheming or duplicitous in any way,\" said Flagler history professor Michael Butler, director of the school's African American studies program.",
    "Another document noted that the center was necessary because a \"growing proportion of our population lacks a basic understanding of the role liberty and private enterprise play in their well-being.\"",
    "DeSantis' combative spokesperson, Christina Pushaw, has called it an important part of the administration's crusade to foster \"intellectual freedom and viewpoint diversity within higher education.\"",
    "\"As these donors are trying to gain intellectual and cultural influence for their ideology, they've been frantically trying to set up shop in universities that will help legitimize their movement.\"",
    "If the proposal is ultimately funded, Vanden Houten said  it was approved by the legislature in March but still awaits DeSantis' review  it will only help Flagler continue the work it already does.",
    "It also seems these centers may become training grounds for Florida's K-12 instructors; DeSantis has previously offered $3,000 grants to teachers who undergo training in the new civics standards.",
    "Look at Pinochet, look at Argentina  there's been more than enough right-wing authoritarianism in Latin America, even if we're restricting ourselves to Latin America for some reason,\" she said.",
    "Flagler's institute would, the proposal said, promote \"free inquiry\" and \"critical thinking,\" which struck some faculty members as a confusing restatement of what was already their primary job.",
    "This move came in the wake of pressure from Tennessee Republicans to drop plans to address diversity at several state universities, including both UT Knoxville and the University of Memphis.",
    "If, however, he said, \"the state of Florida wants to give $5 million to the college and dictate the concept and content of 'classical education,' then I completely oppose the initiative.\"",
    "Whatever ultimately happens at Flagler, versions of this model, and the accompanying controversy, are certain to be replicated elsewhere, in schools with less supportive administrations.",
    "\"It's funny\" that the right claims a need to create a separate patronage system for conservative academics, said Bethany Moreton, \"because they've been doing this since the mid-1970s.\"",
    "\"The whole dynamic has to be understood in the broader context of what's happening in Florida with regards to education and how people interpret that,\" said Flagler's Timothy Johnson.",
    "The Republican state legislature \"basically held Arizona State hostage\" to force the creation of tenure-track jobs for right-wing professors, outside normal university governance.",
    "Fink argued that grants to universities to support the work of economists committed to radical free-market capitalism could inform policy proposals from conservative think tanks.",
    "At the University of Florida, Malini Johar Schueller said the school's failure to solicit faculty input about its proposed center was \"quite in keeping with this administration.\"",
    "The last measure, in a strange way, is seen as an attempt to shield the University of Florida from the consequences of its own defensive moves to crack down on academic freedom.",
    "The public universities, the [diversity, equity, inclusion] departments, the public school bureaucracies are, at the end of the day, patronage systems for left-wing activists.",
    "\"There's always this Damoclean sword hanging over the university, that if you stray from their political agenda, you'll be looked at disfavorably when it comes to budgets.\"",
    "When DeSantis discussed the project with Fox News' Laura Ingraham in 2021, he suggested that this project would also serve as Florida's response to \"critical race theory.\"",
    "But these days, the model has been adopted by Republican-led legislatures too, effectively using taxpayer dollars to implant conservative ideology in public institutions.",
    "Educational centers funded by right-wing donors are nothing new  but now Republicans are using taxpayer dollars to implant conservative ideology in public institutions.",
    "Those incidents prompted investigations by both Congress and the Southern Association of Colleges and Schools Commission on Colleges, which provides UF's accreditation.",
    "In January, Arizona Republicans proposed their own \"Portraits in Patriotism\" oral history series, much like Florida's, as a requirement for high school graduation.",
    "Ron DeSantis and the response to \"critical race theory\"\nWhen Flagler faculty pictured what they didn't want the institute to become, they didn't have to look far.",
    "Earlier this year, Flagler historian Michael Butler was supposed to deliver a training seminar on the civil rights movement to Florida elementary school teachers.",
    "\"In many states, colleges and universities have become centers of anti-American thought, leaving our students not only ill-equipped but confused,\" Lee continued.",
    "Patrick responded by writing on Twitter, \"I will not stand by and let looney Marxist UT professors poison the minds of young students with Critical Race Theory.",
    "Both ASU's new center and another Koch-backed \"freedom\" center at the University of Arizona have been called upon to develop the state's K-12 civics curricula.",
    "\"Using state legislatures as an avenue for the creation of these centers seems to be a new tactic,\" said Wilson, which can expedite the entire enterprise.",
    "But some faculty members felt concerned, reading between the lines in a state that has become ground zero for the nation's education debates  where Gov.",
    "Specifically, he said, Republican state lawmakers should dedicate public funds to establish \"conservative centers\" within flagship public universities.",
    "But Lee also said that the \"informed patriotism\" that characterized that endeavor \"should stretch beyond the K-12 classroom and into higher education.\"",
    "Under current conditions at UF, he said, \"DeSantis doesn't have to say, 'If you do X, we'll cut your funding,'\" because administrators already know.",
    "But Wilson added that the program at ASU now receives so much direct state funding that the Koch network has largely been able to drop its support.",
    "In 2020, the Florida legislature also created the Adam Smith Center for the Study of Economic Freedom at Florida International University in Miami.",
    "\"The legislature basically held the university hostage to force them to create tenure-track faculty lines for the freedom center,\" said MacLean.",
    "For the last 10 years, Wilson, who previously helped found Unkoch My Campus, has focused attention on academic centers funded by private donors.",
    "Malini Johar Schueller, an English professor who joined UF's Coalition for Academic Freedom after last fall's controversies, was more emphatic.",
    "When he tells people he's a historian these days, he said, they increasingly respond by asking him whether he teaches history \"the right way.\"",
    "At Flagler College in St. Augustine, it's still not clear where the proposed Institute for Classical Education fits into this complex picture.",
    "Flagler's new Institute for Classical Education would promote \"free inquiry and \"critical thinking,\" which struck some faculty members as odd.",
    "\"There's nothing particularly wrong with saying there should be more Western canon and classical liberalism in the classroom,\" said Sitharam.",
    "\"I think it's thoroughly shameful of UF to accept an educational endeavor, if you can call it that, which is so blatantly racist,\" she said.",
    "\"The right was thinking long-term when they started doing this in the '70s, thinking ahead to a moment like this one,\" said Bethany Moreton.",
    "By strict definition, \"classical education\" refers to a series of liberal arts emphases on subjects like grammar, logic, rhetoric and math.",
    "While the first wave of that assault was largely directed at public K-12 schools, it's increasingly expanding to higher education as well.",
    "That plan has gotten little attention so far, beyond approving mention in conservative publications like Campus Reform or the College Fix.",
    "\"As taxes are driven down by the same [conservative] elected officials, school administrators are just desperate for funds,\" said MacLean.",
    "\"The concern is that the culture wars of 2022 are moving into higher education, and we're not sure what that means for Flagler College.",
    "And as long as there's going to be a patronage system, wouldn't it be good to have some people representing the public within them?\"",
    "Since the changes at ASU, there has been a flurry of similar proposals for new conservative centers at flagship public universities.",
    "\"There's no decision-making process that involves a faculty legislature\" if state governors and lawmakers are making the decisions.",
    "When it comes to terms like \"Western civilization\" and \"American exceptionalism,\" she continued, \"We all know what those are about.",
    "\"Not because we're not in favor of Western education,\" he said, \"but because that comes nowadays with certain ideological baggage.\"",
    "\"But, in Tennessee, there's no reason why our institutions of higher learning can't be an exceptional part of America at Its Best.\"",
    "\"It removes any avenue for students, faculty or administrators, for that matter, to have a say in the creation of these centers.\"",
    "Six years earlier, in 2014, Florida's legislature also funded a professorship at Florida State focused on \"economic prosperity.\"",
    "The concept in itself isn't new; right-wing philanthropists have been creating academic programs in their own image for decades.",
    "But to a certain extent, added Butler, the Flagler history professor, \"classical education\" has become an equally loaded term.",
    "And yet, because there has been this concerted effort by the American right to appropriate that language, it makes one wary.\"",
    "\"I understand myself to be involved in classical and liberal arts education, and I'm basically an anti-fascist lesbian.",
    "\"Our university is well known for anticipatory obedience,\" said Meera Sitharam, vice president of UF's faculty union.",
    "Or does it mean teaching young people that America is an exceptional nation founded on \"Judeo-Christian\" principles?",
    "She expressed similar concerns with the plan for the institute to curate DeSantis' Portraits in Patriotism series.",
    "To some faculty, the proposed institute felt like an attempt to \"make Flagler College the Hillsdale of the South.\"",
    "When schools like Hillsdale use the term, he said, \"they make no bones about what they're trying to accomplish.\"",
    "But he said he also believed that outside funding with strings attached could distort the educational mission.",
    "It was canceled by local officials who feared it might fall afoul of new prohibitions on teaching about race.",
    "\"All we can do at the university level is not be cowed down, do what we have to do and put up a good battle.\"",
    "Those are code words for people who feel they've had enough of books teaching the histories of minorities.\"",
    "That same law also granted students broad permission to record their professors during classes or lectures.",
    "That model, added MacLean, works in tandem with the steady defunding of higher education over many years.",
    "\"You can teach what the problems of authoritarian regimes are, but why single out the communist ones?",
    "They're always seeing it from one side, then claiming they are the ones who are critically thinking.\"",
    "\"They do not support education as a good in itself, but as a means to an end that they should define.",
    "They do not support education as an end in itself, but as a means to an end that they should define.\"",
    "Schools that appear to lack conservative viewpoints, DeSantis has suggested, may lose state funding.",
    "At the University of Florida, religious studies professor Bron Taylor recognized that pattern.",
    "\"When big money comes into a university, of course the university tends to welcome that.",
    "But now the right has a new playbook: Leveraging direct funding from state governments.",
    "Multiple approaches to classical education exist, from varied ideological perspectives.",
    "But in recent years in the U.S., the term has been freighted with additional meaning.",
    "Today's renewed conservative focus on the model, Moreton continued, has similar aims.",
    "We banned it in publicly funded K-12 and we will ban it in publicly funded higher ed.",
    "So does \"classical education\" mean an emphasis on grammar, logic, rhetoric and math?",
    "\"Is the purpose of 'classical education' to teach the classic works of literature?\"",
    "\"This is not an innocent selection of the greatest that was ever said and thought.",
    "\"This is a late-stage example of the corporate capture of the state,\" said Wilson.",
    "It's one of the ways they accomplish things they want to accomplish,\" he said.",
    "\"The right was thinking long-term when they started doing this in the '70s.",
    "MORE FROM Kathryn Joyce  FOLLOW kathrynajoyce\nTrending Articles from Salon",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "\"In this kind of case the devil's in the details,\" Taylor continued.",
    "\"Some people don't like thinking about it that way,\" Rufo continued.",
    "In Texas last year, a new state initiative, championed by Lt. Gov.",
    "\"Who is going to decide the shape and priority of this institute?",
    "That may be a fair description of UF's proposed Hamilton Center.",
    "They can use the state to help them further capture the state.\"",
    "Will the donors have any say in who is appointed to lead it?\"",
    "She expressed little optimism that things would improve soon.",
    "\"What I'm against is the idea that this should replace CRT.",
    "So I don't think it's only code, or only a dog whistle.",
    "\"This is going to continue, unfortunately,\" she said.",
    "Similar plans have also arisen recently in Tennessee.",
    "That's why we created the Liberty Institute at UT.\"",
    "Subscribe to our morning newsletter, Crash Course.",
    "I don't know what one has to do with the other.\"",
    "Garcia resigned, and now teaches at Dartmouth.",
    "What does \"classical education\" mean, anyway?",
    "\"Is it to return to 'Western traditions'?\"",
    "\"The one-sidedness is what's problematic.",
    "This proposal does not come in a vacuum.\"",
    "Are you teaching history \"the right way\"?",
    "This is an identity project in itself.\"",
    "But it's not the only example.",
    "And that's by explicit design.",
    "Wasn't that already their job?",
    "\"But guess what?",
    "he asked.",
    "When Gov.",
    "Gov."
  ]
}