{
  "id": 8945,
  "mediaId": 151,
  "date": "6/5/2022 12:00:00 AM",
  "headline": "POLITICO Playbook: Democracy week in Washington",
  "image": "https://www.politico.com/dims4/default/55d260a/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fe2%2F9e%2F871e655d43b6a416effd874ab449%2F220526-liz-cheney-ap-773.jpg",
  "link": "https://www.politico.com/newsletters/playbook/2022/06/05/democracy-week-in-washington-00037266",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    3094
  ],
  "sentences": [
    "SPOTTED at a party for Jamie Kirchicks new book, Secret City: The Hidden History of Gay Washington ($38) at the Jefferson Hotel on Saturday night hosted by George Stephanopoulos, Meghan McCain, Juleanna Glover, Larry Milstein, Stuart Kurlander, David Martin and Javelin: Josef Palermo, Mark Leibovich, Danielle Crittenden, Leon Wieseltier, Jim Kolbe, Thomas Mallon, Walter Olson, Rick Klein, David and Danielle Frum, Keith Urbahn and Kerri Kupec, Ben Jacobs, Michael Hirsh, Francesca Craig, Michael Crowley, Shadi Hamid, John Hudson, Eliana Johnson, John McConnell, Josh Rogin, Emily Domenech, Mike Isikoff, Matt Kaminski, Ben Pauker, Alex Thompson, Michael Schaffer, Daniel Lippman and Sophia Narrett.",
    "The fact that Fetterman, 52, and his campaign won the nomination without fully disclosing the extent of his physical maladies has raised concerns among Democrats that there may be more bad news to come, potentially endangering the partys hopes for retaining Senate control this fall,\nWhat the campaign said on primary day about the insertion of a defibrillator: It should be a short procedure that will help protect his heart and address the underlying cause of his stroke, atrial fibrillation (A-fib), by regulating his heart rate and rhythm.",
    "TRUMPS NEW YORK TEST: New Yorks GOP gubernatorial primary is June 28, and Joseph Spector writes from Albany that Trump is being pulled all directions by Rep. LEE ZELDIN, ANDREW GIULIANI and ROB ASTORINO: As Trump looks to play kingmaker across the country by boosting GOP candidates with his coveted endorsement among GOP candidates, perhaps no race is as personal and as vexing for him as the Republican primary in New York  a battle that will test Trumps loyalties and friendships..",
    "I mean, if you're having meetings within the White House  If you're pushing this sort of lie even on Twitter and social media, which is very important, which I think the committee is going to concentrate on, if you look at what's happening and the message that's being pushed by President Trump himself on social media and other individuals, you start to see this pipeline of information that's very damaging and is pushing things like Stop the Steal.",
    "MORE SUNDAY MIDTERM READING:\n GOPS 2022 STRATEGY: MAGA IN THE PRIMARY, UNITY IN THE GENERAL: NYTs Catie Edmondson writes from Tucson about the GOPs 2022 strategy to aggressively [recruit] people of color with powerful personal stories to tell, betting that compelling candidates, equipped with disciplined messages that focus on kitchen table issues like inflation and public safety, will deliver them control of the House.",
    "The Jan. 6 select committee goes primetime on Thursday at 8 p.m.\nIts only Sunday, but on the airwaves and online, the media is already flooded with news about the attack on the Capitol and its fallout \n Rep. TOM RICE (R-S.C.) on his vote to impeach Trump, on ABCs This Week: Defending the Constitution is a bedrock of the Republican platform, defend the Constitution, and that's what I did.",
    "Follow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "More from David Cohen\n Former Rep. DENVER RIGGLEMAN (R-Va.), a former top adviser to the Jan. 6 committee, previewed what the committee has learned:\nOn whether theres proof that Trump knew what would happen on Jan. 6 beforehand: When you look at the totality of the evidence, it's pretty apparent that, at some points, President Trump knew what was going on, obviously, right?",
    "More from Brianna Crummy\n Transportation Secretary PETE BUTTIGIEG on mass shootings, on ABCs This Week: The idea that us, being the only developed country where this happens routinely, especially in terms of the mass shootings, is somehow a result of the design of the doorways on our school buildings is the definition of insanity, if not the definition of denial.",
    "ANOTHER POLLING SIREN FOR DEMS: Black voters support for Biden has cooled, poll finds, by WaPos Cleve Wootson Jr., Scott Clement, Matthew Brown and Emily Guskin\n WATCH: Inside The Forecast: If GOP wants to flip the House, California is crucial, Steve Shepard breaks down the key Golden State races to watch this fall (video by Renee Klahr)\n5.",
    "BREAKING OVERNIGHT \n IN PHILADELPHIA: Three people were killed and 11 others wounded in a mass shooting late Saturday night on South Street amid chaos that erupted on legendary blocks that have long been among the regions most popular gathering places, the Philly Inquirers Anthony Wood, Ximena Conde, Max Marin and Robert Moran report.",
    "BIRTHWEEK: Steve Champlin (was Saturday)\nHAPPY BIRTHDAY: Rep. Chrissy Houlahan (D-Pa.)  Megan Beyer  Mike Heimowitz  White Houses Todd Zubatkin  Rob Engstrom  Elan Kriegel of BlueLabs  Jordan Dickinson of Rep. Dan Kildees (D-Mich.) office  Kara Hauck of March of Dimes  Carol Guensburg  Mary Kirchner of Sen. John Kennedys (R-La.)",
    "POLITICO Playbook: Democracy week in Washington\nBy RYAN LIZZA, EUGENE DANIELS and RACHAEL BADE\n06/05/2022 12:33 PM EDT\nPresented by\nWith help from Eli Okun and Garrett Ross\nDRIVING THE DAY\nMUST-READ  Two Washington Post writers who decided not to tweet chaotically today: Woodward and Bernstein thought Nixon defined corruption.",
    "Cheney on what her father, DICK CHENEY, said to her during the Jan. 6 commemoration at the Capitol: You know, it's one thing to sort of watch the news and to read about what's happened to our party  It is really another thing to be here, and to look, and see all these empty seats and not see another Republican here.",
    "A sample: DONALD TRUMP not only sought to destroy the electoral system through false claims of voter fraud and unprecedented public intimidation of state election officials, but he also then attempted to prevent the peaceful transfer of power to his duly elected successor, for the first time in American history.",
    "IN UKRAINE: Russia struck Ukraine's capital Kyiv with missiles early on Sunday for the first time in more than a month, while Ukrainian officials said a counter-attack on the main battlefield in the east had retaken half of the city of Sievierodonetsk, Reuters Natalia Zinets and Pavel Polityuk report from Kyiv.",
    "The decision is likely between Zeldin or Giuliani, and the working theory among those who speak to Trump is that hell probably sit out the primary and help the candidate who wins to try to retake the governors mansion in Albany  a seat Trump himself seriously considered running for in 2014.",
    "Rep. ADAM SCHIFF (D-Calif.) on the DOJ declining to prosecute MARK MEADOWS and DAN SCAVINO for refusing to cooperate with the committee, on CBS Face the Nation: When the statute requires the Justice Department to present those cases to the grand jury, and they don't, it is deeply troubling.",
    "The convention will draw some 1,500 Republican leaders, officials, activists and supporters in the state that has long played a crucial role in choosing the two major parties standard-bearers, as its caucuses for half a century have kicked off the presidential nominating calendar.",
    "JOHN PODESTA: Bidens instincts will be to  as the campaign begins for November  help unpack the story for the American people, but in a way that doesnt indicate that they are trying to influence the law enforcement decisions that [A.G. MERRICK] GARLAND and his team need to make.",
    "Ciscomani is campaigning on inflation, border security and unity, while other GOP congressmen in Arizona, such as Paul Gosar and Andy Biggs, both of whom participated Trumps Stop the Steal campaign, focus on hardcore MAGA issues, including election fraud conspiracy theories.",
    "SUNDAY BEST \n Sen. CHRIS MURPHY (D-Conn.) on gun legislation negotiations, on CNNs State of the Union: On the table is red flag laws, changes to our background check system to improve the existing system, a handful of other items that will make a difference.",
    "Instead, a White House official said the plan is to add the presidents voice only when appropriate, and that usually means in emphasizing the importance of protecting democracy and holding accountable those who would seek to undermine or destroy it.",
    "office  Rob Kelly of Sen. Bob Menendezs (D-N.J.) office  POLITICOs Katie Schneider  Matt Vasilogambros of Pew Trusts Stateline  Equatorial Guinean President Teodoro Obiang Nguema Mbasogo  Abeer Al Otaiba\nDid someone forward this email to you?",
    "At least one person was hospitalised but there were no immediate reports of deaths from the strike - a sudden reminder of war in a capital where normal life has largely returned since Russian forces were driven from its outskirts in March.",
    "Taken together, those four measures might have changed the course of at least 35 mass shootings  a third of such episodes in the United States since the massacre at Columbine High School in Colorado, a New York Times analysis has found.",
    "2024 WATCH:Fox News Paul Steinhauser scoops that four potential GOP White House hopefuls in the next cycle have placed paid ads in the Iowa GOPs state convention tabloid  which lists the agenda for the state partys June 11th gathering.",
    "And therefore he is embracing those in our party who are anti-Semitic; he is embracing those in our party who are white nationalists; he is lying about what happened on January 6; and he's turned his back on the Constitution.",
    "The fear inside the White House is that if Biden appears to be influencing the committee or the Justice Department, it would unnecessarily give Trump and his allies more fodder as they try to delegitimize the findings.",
    "Like a president facing election during a bad economy, Mr. Boudin finds himself a vessel for residents pandemic angst and their frustrations over a wave of burglaries and other property crimes in well-to-do areas.",
    "On whether the committee will uncover a smoking gun: Well, that probably is going to be very difficult to even find, based on the limited authorities of Congress ... as far as getting data and things like that.",
    "Janet Yellenissued a carefully worded statement in response to Bloombergs report on a new book about the Treasury Secretary that reports Yellen wanted a smaller stimulus in early 2021 over inflation concerns.",
    "What cardiology expert CHRISTIAN THOMAS RUFF told WaPo: You would never use a defibrillator to treat atrial fibrillation  The defibrillator is used to treat dangerous heart rhythms from the bottom ventricles.",
    "More from David Cohen\nBIDENS SUNDAY  The Bidens returned to the White House from Rehoboth Beach, Del., at 9:55 a.m.\nVP KAMALA HARRIS SUNDAY  The VP is in Los Angeles and has nothing on her public schedule.",
    "We hope to get more insight from the Justice Department, but it's a, I think, a grave disappointment, and could impede our work if other witnesses think they can, likewise, refuse to show up with impunity.",
    "If the key gun control proposals now being considered in Congress had been law since 1999, four gunmen younger than 21 would have been blocked from legally buying the rifles they used in mass shootings.",
    "Some highlights:\n On the hearings: Costa: Are you confident that what you have found as a committee will somehow grab the American people by the lapels and say, Wake up: You have to pay attention.?",
    "In it, the panels vice chair touched on why the public should care about the hearings, her latest assessment of her own party and her ongoing feud with House Minority Leader KEVIN MCCARTHY.",
    "I never urged adoption of a smaller American Rescue Plan package, and I believe that ARP played a central role in driving strong growth throughout 2021 and afterwards, Yellen said Saturday.",
    "But as late as last night, we were engaged in conversations about trying to put a package together, because I think Republicans realize how scared parents and kids are across this country.",
    "Pic  Another pic\nWEEKEND WEDDING  Loren Merchan, president and partner of Authentic Campaigns, and Taylor Harper, geographer at the U.S. Census, got married on Saturday in Moseley, Va.",
    "ENGAGED  Brian Wanglin, a lawyer with FP1 Strategies, and Justice Gilpin-Green, a producer for Meet the Press, got engaged on Saturday at Katama Beach on Marthas Vineyard.",
    "And 20 might not have been allowed to legally purchase the large-capacity magazines that they used to upgrade their guns, helping them kill, on average, 16 people each.",
    ":NYTs Quoctrung Bui, Alicia Parlapiano and Margot Sanger-Katz look at how some of the congressional proposals regulating firearms might have affected recent tragedies.",
    "by APs John Leicester and Hanna Arhirova in Zhytomyr, Ukraine  American spy agencies review their misses on Ukraine, Russia, by APs Nomaan Merchant and Matthew Lee\n2.",
    "Joe ManchintextedSteve Richetti in December: Steve, the statement you all put out tonight targeting me and my family was unconscionable and extremely dangerous.",
    "I don't know that we're going to vote this coming week, but we need to make decisions on whether or not we have a sustainable package in the next five days.",
    "TERRIFYING READ  A gunman suspected of fatally shooting [retired Juneau County Judge JOHN ROEMER] at a Wisconsin home had a list that included Michigan Gov.",
    "populist, but his lack of candor about his health could undermine that reputation and he now faces the challenge of explaining the confusion to voters.",
    "On whether he would consider voting for Trump again: If he came out and said, Im sorry I made a huge mistake on Jan. 6, then I might consider it.",
    ":WaPos Michael Scherer and Hannah Knowles write that JOHN FETTERMANs advisers have pitched him as an authentic, straight-talking, no-B.S.",
    "Playbook couldnt happen without our editor Mike Zapler, deputy editor Zack Stanton and producers Setota Hailemariam and Bethany Irvine.",
    "Drop us a line and tell us what Washington Post reporters Twitter feed you like the best: Rachael Bade, Eugene Daniels, Ryan Lizza.",
    "Officials had not released the identities of the dead, saying only that one was a 25-year-old man and another a 22-year-old woman.",
    "At least four other assailants would have been subject to a required background check, instead of slipping through a loophole.",
    "PLAYBOOKERS\nOliver Darcyunpacked the details of a major correction to a recent story in the Washington Post by Taylor Lorenz.",
    "I think that he has decided that, you know, the most important thing to him is to attempt to be speaker of the House.",
    "And I think that, you know, the majority of Republicans across the country don't want to see our system unravel.",
    "People must watch, and they must understand how easily our democratic system can unravel if we don't defend it.",
    "Ten might have been unable to steal their weapons because of efforts to require or encourage safer gun storage.",
    "TONY EVERS, Whitmers office and a law enforcement source said Saturday, per APs Dave Kolpack and Mike Balsamo.",
    "CHESA BOUDIN which has echoes of the partys larger split over how to handle matters of crime and punishment.",
    "DEMS MUGGED BY REALITY: NYTs Tim Arango and Thomas Fuller look at San Franciscos recall effort against D.A.",
    "Later, she expanded: Let me say it this way: I have not learned anything that has made me less concerned.",
    "On whether Biden getting involved would help the talks: I think the Senate needs to do this ourselves.",
    "The ceremony was officiated by the brides father, New York County Supreme Court Justice Juan Merchan.",
    "Law enforcement official: Roemer was found zip-tied to a chair in his home and had been fatally shot.",
    "Can we get there by the end of next week, as [Senate Majority Leader CHUCK] SCHUMER has requested?",
    "DOUG DUCEY who is running in Arizona for the seat left open by Rep. Ann Kirkpatricks retirement.",
    "Did she want a smaller package initially but once the ARP was set in stone, she backed it fully?",
    "More from CBS\nTHE VIEW FROM 1600 PENN: Whats the White House strategy for the Jan. 6 hearings?",
    "Dont expect insta-commentary from the White House briefing room when hearings start on June 9.",
    "Did she want more of the ARP devoted to long-term spending, rather than short-term stimulus?",
    "That statement doesnt necessarily contradict the reporting that Yellen wanted less stimulus.",
    "Hopefully Owen Ullmanns forthcoming Yellen book, Empathy Economics, will have some answers.",
    "Two related reads from the AP: As Ukraine loses troops, how long can it keep up the fight?",
    "Cheney: Well, I think the extent, the expanse, how broad this multi-pronged effort was.",
    "sat down with CBS Robert Costa for an interview that aired on CBS Sunday Morning today.",
    "JAN. 6 HEARINGS PREVIEW  Its infrastructure week  the infrastructure of our democracy.",
    "The couple met at a dinner party in 2019 hosted by Daniel Strauss and Claire Tonneson.",
    "I have talked to the White House every single day since these negotiations began.",
    "Dont hold your breath waiting for Biden to convey his shock and disappointments.",
    "RON DESANTIS has edged Trump at the Western Conservative Summit 2024 straw poll.",
    "I mean, I think there is absolutely a cult of personality around Donald Trump.",
    "For the full backstory, listen to our Deep Dive podcast with Steve Clemons.",
    "GRETCHEN WHITMER, Senate Minority Leader MITCH MCCONNELL and Wisconsin Gov.",
    "Send Playbookers tips to playbook@politico.com or text us at 202-556-3307.",
    "SPOTTED: Mike Nellis, Gabrielle and Brad Rizzo and Ginger and Travis Burk.",
    "I think, this week, we need to have concepts to present to our colleagues.",
    "She spotlights the campaign of JUAN CISCOMANI, a senior adviser to Gov.",
    "Cheney: I think that large segments of it have certainly become that.",
    "PHOTO OF THE DAY\nPLAYBOOK READS\nWHAT ELSE YOU SHOULD READ TODAY \n1.",
    "I think they realize that the answer this time cannot be nothing.",
    "But, right now, the Senate needs to handle these negotiations.",
    "On the GOP: Costa: Is the Republican Party a personality cult?",
    "On McCarthy: Costa: What keeps Kevin McCarthy close to Trump?",
    "Another good nugget: For a second straight year, Florida Gov.",
    "Then came Trump, by Bob Woodward and Carl Bernstein.",
    "The four ads come from Trump, MIKE POMPEO and Sens.",
    "Not much, Laura Barrn-Lpez reports this morning.",
    "Those 35 shootings killed a combined 446 people.",
    "I did it then, and I would do it again tomorrow.",
    "I think it's also craven political calculation.",
    "Costa: Well, what's made you more concerned?",
    "RICK SCOTT (R-Fla.) and TIM SCOTT (R-S.C.).",
    "I took an oath to protect the Constitution.",
    "Costa: Do you believe it was a conspiracy?",
    "WOULD NEW GUN LAWS HAVE MADE A DIFFERENCE?",
    "PA DEMS NEW FEAR: WHAT ELSE DONT WE KNOW?",
    "There will be no further negotiations.",
    "Cheney: I think some of it is fear.",
    "That was the conservative vote.",
    "Its extremely well-organized.",
    "Thanks for reading Playbook.",
    "People must pay attention.",
    "I am livid today about it.",
    "Rep. LIZ CHENEY (R-Wyo.)",
    "It is extremely broad.",
    "Its really chilling.",
    "Good Sunday morning.",
    "Or something else?",
    "Cheney: I do.",
    "I don't know.",
    "Sign up here.",
    "Cheney: I am.",
    "I was livid.",
    "Fear?",
    "Yeah.",
    "S.F.",
    "4.",
    "3."
  ]
}