{
  "id": 9000,
  "mediaId": 129,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "There Has to Be a Tipping Point on Guns, Right?",
  "image": "https://static01.nyt.com/images/2022/06/06/opinion/06conversation_2/06conversation_2-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/06/06/opinion/guns-2024-nba-finals.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661,
    2095
  ],
  "sentences": [
    "Will move on instead to the championship-contender Boston Celtics and my theory that professional sports, while cheesy in many ways, are an extremely useful part of the culture, not only providing diversion but also uniting folks who would otherwise have absolutely nothing in common.",
    "Gail: And our colleague Maggie Haberman recently posted a story from her upcoming book, about the vice presidents security being warned that Trump was going to turn on Pence before Pence went on to accurately record the results of the presidential election.",
    "Lets open a conversation about what kind of guns are good for hunting and target shooting and separate them from the ones that are ideal for mowing down students or shoppers or whoever turn out to be the next heartbreaking mass murder victims.",
    "But not for this guy  followed by a picture of the Tucson, Ariz, mass murderer Jared Lee Loughner, or this guy  a picture of Aurora, Colo., mass murderer James Holmes, or this guy  a picture of Newtown, Conn., mass murderer Adam Lanza.",
    "Bret: I dont see how a man whose political theme song might as well have been the Meat Loaf classic, I Would Do Anything For Love (But I Wont Do That) can sell himself as any kind of hero, much less as a plausible Republican nominee.",
    "We can protect your guns while keeping them out of the hands of crazy and dangerous people by using common-sense background checks, 21-years-of-age purchasing requirements, three-day waiting periods, and mental-health exams.",
    "Id also argue that every would-be gun buyer should be required to purchase a gun safe while also passing a criminal-background check, a psychiatric evaluation, a three-day waiting period and an extensive gun-safety course.",
    "Bret: Well, the performance of the police in Uvalde was shameful and I hope the episode lives on as an example to cops everywhere of how not to act when the lives of children and teachers are at risk.",
    "Bret: You have to admire the ideological flexibility of self-described conservatives who are for free speech, until they arent, and who think corporations have speech rights, until they dont.",
    "When hyper-progressives say abolish the police, they are tacitly encouraging people  especially in low-income communities  to purchase weapons as a logical means of self-defense.",
    "Frankly, Trumps only serious opponent for the nomination at this point is Ron DeSantis, who seems to be beating the former president in the straw polls, at least in some states.",
    "But not for this  a picture of the scene outside the Uvalde school, or this  a picture of the scene from the Buffalo grocery store, or this  scenes from the Parkland massacre.",
    "Our news-side colleague Nate Cohn had an eye-opening analysis last week on the wide disparity between the way gun-control measures poll and how people actually vote on them.",
    "On Election Day, Americans breathe a little easier knowing that none of the candidates is out to destroy the Constitution, and were back to politics as it was before Trump.",
    "When coastal elites denigrate gun culture, they foster precisely the kinds of cultural resentments that lead people to cling to guns, to use Barack Obamas famous phrase.",
    "Gail: Well DeSantis made a trademark move last week when he canceled funding for a Tampa Bay Rays training facility because the team issued an anti-mass-shooting tweet.",
    "Bret: Which sort of brings us to the nub of the problem: Conservatives want policies that dont work in practice and liberals want policies that dont work in politics.",
    "Bret: Imagine a TV ad from a moderate Democrat like Ohios Tim Ryan or Virginias Abigail Spanberger that goes something like this:\nI believe in the Second Amendment.",
    "Gail: Just looking forward, Im imagining an election this fall where either the Republicans win everything or the whole process gets blocked from even taking place.",
    "Bret: Im hardly the first person to suggest that no one should be able to legally buy a gun in the United States who cant legally buy a beer in the United States.",
    "Did you see the story in Politico about Republican poll workers being prepared to contest the Election-Day process rather than making it work properly?",
    "Roy Cooper of North Carolina for the Democratic nomination, and then chooses the widely respected retired Admiral Jim Stavridis as her running mate.",
    "Gail: Can I also say how it drives me crazy when lawmakers respond to these gun crises by ranting about police efficiency or school construction?",
    "Kemp won his primary over David Perdue by more than 50 points, which was a very satisfying humiliation of one of Trumps favorite bootlickers.",
    "Gail: However, when it comes to betting on the Senate, God help us, I guess you need to look for ways to celebrate minimal achievement.",
    "Perhaps a few of the conservatives who argue that school shootings are part of a mental-health crisis might be persuaded to sign on.",
    "Kemp was perhaps Donald Trumps top target  he hates him for allowing the states presidential vote to go, accurately, to Joe Biden.",
    "And how important it is to have good social services for those folks and \nBret: And a timely prescription of Paxlovid, I presume.",
    "I know well talk about Joe Bidens gun-control proposals, but I wanted to ask how Dan is feeling  about Covid and the Celtics.",
    "I can imagine them passing a bill to raise the age for buying an assault rifle to 21, but dont expect me to throw a party.",
    "Hes too close to Trump not to be tainted by his presidency and too alienated from Trump not to be diminished by his wrath.",
    "When Jimmy Kimmel makes a moving plea for gun control, he is preaching to the converted, but he isnt moving the needle.",
    "And kinda amazed by the idea of eliminating entrances to reduce the chance of a murderer sneaking into a school.",
    "And it could conclude: Justice Robert Jackson once told us that the Bill of Rights cannot become a suicide pact.",
    "Gail: Sports-wise, I dont like the idea of betting on whether some team will score over X points or under.",
    "When Beto ORourke says, Hell yes, were going to take your AR-15s, it just encourages people to buy them.",
    "Gail: As someone who is in favor of getting rid of every assault weapon in the world, I have to protest.",
    "It would continue: I also believe in the right to own firearms responsibly for hunting and self-defense.",
    "Gail: Of course you want well-trained security officers, but thats not going to stop all these horrors.",
    "He didnt have a major Covid case, but it was a reminder of how any illness can really lay a family low.",
    "Gail: Well, my first idea would be to  ask an extremely talented communicator with ties to the right.",
    "Though, considering what we saw over the weekend in Philadelphia or Chattanooga, it may not be long.",
    "And I have a feeling well be talking about this much, much more as this election year goes on.",
    "But he doesnt have nearly as much of that raise-the-rafters-split-the-country creepy charisma.",
    "Gretchen Whitmer, the governor of Michigan, beats Senator Amy Klobuchar of Minnesota and Gov.",
    "Especially in an era when people are being encouraged to doubt the whole electoral system.",
    "The major barrier is the profit-making gun manufacturers and the culture they subsidize.",
    "Turns out, gun control just isnt as popular at the ballot box as many liberals contend.",
    "Glenn Youngkin of Virginia with Senator Tim Scott of South Carolina as his veep choice.",
    "Biden realizes he has to announce he isnt running in 2024 so that a savior can appear.",
    "Bret: Heres what my crystal ball tells me: Democrats get hammered in the midterms.",
    "Are we looking at Pence as a hero in a possible primary with his old boss in 2024?",
    "When Biden pleads do something, he merely invites the question: do what, exactly?",
    "I can now march around with a little badge saying My husbands testing negative!",
    "Gail: OK, not gonna try to lure you into an activist-government argument today.",
    "I was fascinated when Mike Pence made a very public endorsement of Georgia Gov.",
    "Gail: Lets take a rest and talk about politics in the old, non-profound sense.",
    "Could pose a problem if youre down to one door and the building catches fire.",
    "The Times is committed to publishing a diversity of letters to the editor.",
    "And what a disaster it must be for, say, single mothers or poor seniors.",
    "Bret: This is the mental infection Trump has unleashed on the republic.",
    "Meanwhile, Republicans split acrimoniously between DeSantis and Trump.",
    "The notion that elections are a case of heads I win, tails you lose.",
    "Wed like to hear what you think about this or any of our articles.",
    "A brokered convention produces a compromise ticket headed by Gov.",
    "Or your bet on Biden getting anything passed on gun legislation?",
    "And every time theres a gun massacre, gun sales go up, not down.",
    "Not only does God root for them, He also used to play for them.",
    "Hes horrible, and his advantage is that hes smarter than Trump.",
    "Bret: At least Pence has better political acumen than Trump.",
    "Liberals need to reconsider the way they make their case.",
    "But I understand Im not exactly moving many AR-15 owners.",
    "Whats your over-under on the series, now that its tied?",
    "Bret: Lets hope its not after the next school shooting.",
    "Between those two, who would you prefer as the G.O.P.",
    "Its not about denying your Constitutional rights.",
    "Its so your children come home from school alive.",
    "(They dared to say: This cannot be normal.)",
    "Just tell me who you think is going to win.",
    "And heres our email: letters@nytimes.com.",
    "Gail: Not quite sure who scares me more.",
    "Gail Collins: Thanks for asking, Bret.",
    "That includes the Second Amendment.",
    "Still, DeSantis is very effective.",
    "Can I start with what doesnt work?",
    "OK, Im being way too negative.",
    "Bret: The Celtics, of course.",
    "Give me a better strategy.",
    "Anybody youre rooting for?",
    "Brian Kemp in the primary.",
    "Be a pal and cheer me up.",
    "Bret Stephens: Hi, Gail.",
    "Bret: The Men in Green.",
    "Here are some tips.",
    "What do you think?",
    "Glad hes better.",
    "Take it, Bret!",
    "Your thoughts?",
    "Gail: Im sold.",
    "Sorry, go on.",
    "Bret: Hmmm.",
    "candidate?",
    "Or both."
  ]
}