{
  "id": 9007,
  "mediaId": 195,
  "date": "6/7/2022 12:00:00 AM",
  "headline": "Jack Flaherty rips Tampa Rays players who didnt wear Pride patch: Absolute joke",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/06/f3d4105893ba49768a4dc7687a3b9a68.jpg?strip=1&w=640",
  "link": "https://thehill.com/blogs/blog-briefing-room/3513888-jack-flaherty-rips-tampa-rays-players-who-didnt-wear-pride-patch-absolute-joke/",
  "sentiment": "0",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Olafimihan Oshin",
  "authorUrl": "https://thehill.com/author/olafimihan-oshin/",
  "termIds": [
    661
  ],
  "sentences": [
    "Flahertys response comes as a group of Rays players such as pitchers Jason Adam, Jalen Beeks, Brooks Raley, Jeffrey Springs, and Ryan Thompson decline to wear an LGBTQ patch on their uniforms during the teams annual Gay Pride Night celebration, citing it as a faith-based decision, according to Sports Illustrated.",
    "In a statement, Rays manager Kevin Cash said that players opinions on the issue will affect them negatively, adding that the team has had discussions on the matter and emphasized valuing the different perspectives, SI.com reported.",
    "The browser does not support the specified video codec\nSt. Louis Cardinals pitcher Jack Flaherty has publicly called out the Tampa Bay Rays players who have opted out of wearing an LGBTQ Pride month patch during a game.",
    "Ron DeSantis (R) on Thursday vetoed funds for the MLB teams new practice facility in Pasco County in response to the team publicly supporting gun control legislation in the wake of recent mass shootings in the U.S.",
    "I cant speak for everyone whos in here, obviously, but this is a family-friendly environment here at a big-league ball field  We just want everyone to feel welcomed and included and cheer us on.",
    "Its one of those things, my parents taught me to love everyone as they are, go live your life, whatever your preferences are, go be you, Kiermaier the newspaper.",
    "Rays outfielder Kevin Kiermaier, who wore the patch during the game, told the Times that creating an environment of inclusivity was important to him.",
    "But again, we love these men and women, we care about them, and we want them to feel safe and welcome here, Adams added.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "[A]bsolute joke, Flaherty wrote in a tweet on Sunday, quoting a tweet from TMZ Sports on the matter.",
    "Its just what we believe the lifestyle hes encouraged us to live, for our good, not to withhold.",
    "Rays pitcher Jason Adam told the Tampa Bay Times the decision was not judgemental.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "No matter what your views on anything are.",
    "Its not looking down.",
    "Its not judgmental.",
    "Florida Gov."
  ]
}