{
  "id": 9008,
  "mediaId": 223,
  "date": "6/7/2022 12:00:00 AM",
  "headline": "How Tim Scott Rose From Poverty to Become Our Only Black GOP Senator",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/124/ad563392-4a5f-4152-b8bc-0a427706c62e.jpg",
  "link": "https://townhall.com/columnists/salenazito/2022/06/07/how-tim-scott-rose-from-poverty-to-become-our-only-black-gop-senator-n2608309",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Salena Zito",
  "authorUrl": "https://townhall.com/columnists/salenazito/",
  "termIds": [
    661
  ],
  "sentences": [
    "The GOP has \"championed causes for underserved communities and minority communities that have been really hammered under President Biden,\" he said, before pointing to rising inflation and how the average person can barely afford to put gas in the car, use energy in their house, pay for their health care and take care of any other expenses.",
    "Scott admits he struggled in high school, but his life took a turn for the better when he met John Moniz -- an Air Force veteran who owned the Chick-fil-A restaurant across from the movie theater where Scott worked as a high schooler.",
    "His longtime friend and fellow conservative Maurice Washington -- the first black chair of the Charleston County Republican Party -- said that if Scott ran for president, he would bring a more worldly perspective to the White House.",
    "I don't really care whether you're a white person in rural South Carolina or whether you are someone living on the border in Texas, a Hispanic, or someone living ... in one of the inner cities and you're black,\" he said.",
    "The Seacoast Church in nearby Mount Pleasant is \"the most powerful force in my adult life,\" added Scott of the Christian congregation that had less than 1,000 members when he joined in 1997 and now boasts over 25,000.",
    "There's something on the inside of you that is more powerful than the circumstances around you and that really is the basis of my happy warrior approach,\" said Scott, 56, who is not married and has no kids of his own.",
    "\"Contrast that against what happened when we were in the majority for 2016 to 2020, where we saw African American unemployment go to the lowest level ever recorded in the history of the country,\" he said.",
    "\"And the fact that he brings such a grassroots background into politics starting at a county council level, then to the state House level, then to House and Senate, that's a pretty impressive resume.",
    "\"My grandmother who cleaned houses taught me the importance of a work ethic and individual responsibility, and my mom, who is my true ultimate American hero ... she taught me the dignity of work.\"",
    "Scott attended college, ran and won a seat on the Charleston County Council, lost a state Senate seat, briefly considered becoming a minister, and eventually won a state House seat in 2008.",
    "Nothing remains of the place his family called home except the dirt and gravel from the old road, but poverty still remains in the neighborhood -- and the crime that goes along with it.",
    "Even though he was illiterate, his grandfather would hold up the newspaper to \"read\" in front of his young grandsons just to instill the importance of knowledge and education in them.",
    "He toyed with the idea of running for lieutenant governor in 2010 only to change his mind and run and win the House seat in the same congressional district where the Civil War began.",
    "Recently \"The View\" host Sunny Hostin said that being a black Republican is an oxymoron, and Scott, who is the only black Republican in the U.S. senate, just shook his head.",
    "Ron DeSantis, former Secretary of State Mike Pompeo, former Ambassador to the United Nations Nikki Haley, former Vice President Mike Pence and former President Donald Trump.",
    "\"Yet all three of them were always laughing and joyful, even in the midst of poverty as if to suggest that your circumstances don't determine your outcome.",
    "Scott said his mother worked double shifts as a nursing assistant at a Charleston hospital, and his grandfather left school in third grade to pick cotton.",
    "As for being the only black Republican in the U.S. Senate, Scott deadpans, \"Let's not forget that the Democrats only have two black senators.",
    "Despite having risen to become the most prominent elected black Republican in the country, Tim Scott has never forgotten where he came from.",
    "Tim Scott's name is in the top tier of those being mentioned as potential Republican presidential candidates in 2024, including Florida Gov.",
    "After his parents separated when he was a child, he grew up sharing a single bedroom with his mother and older brother in North Charleston.",
    "\"He has seen the best side and the worst side of America and he could speak to that with authority and experience,\" said Washington.",
    "\"My mission statement is to positively impact the lives of a billion people with a message of open opportunity,\" Scott said.",
    "Nikki Haley appointed him to replace retiring Sen. Jim DeMint, making him the first black U.S. senator from South Carolina.",
    "Coming home and the electricity is not always on, coming home and sometimes being hungry with no food coming that night.",
    "\"Not just because I'm black but because (of) my lived experience as a person in poverty, living paycheck to paycheck.",
    "Trending\nCHARLESTON, South Carolina -- Tim Scott knows the hassle that comes with being both black and conservative.",
    "Scott now sees himself as a mentor -- like John Moniz was to him -- for other young people with untapped potential.",
    "But I keep telling people the presidency of my homeowner association is not open for another two years,\" he jokes.",
    "\"That experience ... is now one of the reasons why I fight the way I do for people living in tough communities.",
    "The opinions expressed by columnists are their own and do not necessarily represent the views of Townhall.com.",
    "View Cartoon\n\"I don't think that there's a day that goes by that I haven't been asked for the last two months.",
    "He ran and won the seat for the full term in 2016 and is seeking reelection to the Senate this year.",
    "\"The one thing all three of those powerful people had in common was the importance of faith.",
    "\"And then I put myself in those different shoes so that I know that the answer is yes.",
    "Which is why Scott said he always keeps his mind on \"people who live on the edges.\"",
    "\"The only question I have for those pundits on TV is why aren't they conservative?\"",
    "I think at the right moment, he would make an excellent presidential candidate.",
    "\"My grandfather ... had a passion for progress that was palpable,\" Scott said.",
    "His home -- which was little more than a shack -- was located on a dirt road.",
    "He's the full package: clear-eyed, clear head, likable guy, scandal-free.",
    "In 2019, he said this would be his last run for the Senate office.",
    "Every day, he asks himself: Is the American dream real for him?",
    "Let's not pretend our margins are drastically different.\"",
    "More importantly, he would make an excellent president.\"",
    "He's not saying, but he admits he gets asked that a lot.",
    "\"It will be the genesis of that decision,\" he said.",
    "Whatever happens, faith will guide his choice.",
    "Through faith, all things were possible.\"",
    "Two years later then-South Carolina Gov.",
    "\"The comments are ridiculous,\" he said.",
    "Coming home and the phone not working.",
    "So, is he planning to run in 2024?",
    "Moniz became an instant mentor.",
    "And that's my responsibility.\"",
    "he asked."
  ]
}