{
  "id": 9009,
  "mediaId": 151,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Taddeo drops out of Florida governor's race",
  "image": "https://www.politico.com/dims4/default/16c7025/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fb8%2Fa6%2F84acd6544ea58fe9e865e0e0be42%2Felection-2022-florida-83261.jpg",
  "link": "https://www.politico.com/news/2022/06/06/taddeo-drops-out-of-florida-governors-race-00037562",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Taddeo has trailed primary challengers Rep. Charlie Crist (D-Fla.) and Democratic Agriculture Commissioner Nikki Fried by wide margins in both fundraising and public polling, and was never able to get any real momentum after becoming the third well-known Democrat to get in the race to challenge Gov.",
    "Taddeos campaign initially mocked the unexpected statement from Higgins, saying we cant control what Higgins says or does, then doubling down by saying, lets hope there arent rumors Annette is going to play for the Buccaneers, it may for [Tom] Brady to retire again.",
    "Because the 2022 midterms are widely expected to be a wave year for Republicans, the seat is still likely to be a difficult flip for Democrats, who have struggled to recruit candidates in the region, which historically has been their home political turf.",
    "| Wilfredo Lee/AP Photo\nBy Matt Dixon\n 06/06/2022 06:09 PM EDT\nTALLAHASSEE, Fla.  Florida Sen. Annette Taddeo (D-Miami) is dropping out of the states gubernatorial race to challenge Rep. Maria Elvira Salazar (R-Fla.) for her South Florida seat.",
    "She had very little path to victory, but said her decision to drop out of the race and instead run for Miamis nationally-watched 27th Congressional District had to do with mass shootings in Buffalo and Uvalde, Texas.",
    "Taddeo lost a 2008 run against former Republican Rep. IIeana Ros-Lehtinen, a 2010 bid for Miami-Dade County Commission, a 2014 run for lieutenant governor with Crist and a 2016 primary against former Rep. Joe Garcia.",
    "The third wheel of the Florida Democratic primary for governor, Annette Taddeo just lost her fourth race in Florida, said Republican National Committee spokeswoman Julia Friedland.",
    "Last month, Miami-Dade County Commissioner Eileen Higgins dropped out of the race against Salazar because she did not want to run against Taddeo in a primary.",
    "The Democratic Congressional Campaign Committee has seen Taddeo as the best possible candidate for the seat, and had been quietly encouraging her to run.",
    "But less than a month later, Taddeo is out of the gubernatorial race, which is another in a line of attempts for higher office that have failed.",
    "And frankly, I am not going to stand on the sidelines and not go in there and fight, especially after what we saw in Buffalo and Uvalde.",
    "But voters went for Democrat Andrew Gillum with more than 53 percent of the vote in his 2018 gubernatorial race against DeSantis.",
    "We are at a critical point in our country, Taddeo told CBS Miami, which first reported her exit from the race.",
    "Florida Sen. Annette Taddeo (D-Miami) dropped out of the governor's race Monday.",
    "Rumors that Taddeo would end her meddling campaign have swirled for weeks.",
    "It was won by former President Donald Trump in 2020 49.9-49.7.",
    "Taddeo won her Florida Senate seat in a 2017 special election.",
    "It wont be long until Charlie Crist follows suit.",
    "Salazars district itself is a toss-up on paper.",
    "Ron DeSantis."
  ]
}