{
  "id": 9010,
  "mediaId": 65,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "DeSantis campaign hits back at Soros-funded election 'manipulation' with ad buy on Hispanic radio network",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/c744f2bb-21d9-4b2d-8e2c-0ff7156f02c7/26eb4186-9407-407c-9f17-e5704133df66/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/desantis-campaign-soros-funded-election-manipulation-ad-buy-hispanic-radio-network",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brandon Gillespie",
  "authorUrl": "https://www.foxnews.com/person/g/brandon-gillespie",
  "termIds": [
    661
  ],
  "sentences": [
    "Jess Morales Rocketto, a former Hillary for America and AFL-CIO employee, and Stephanie Valencia, a former White House staffer during the Obama administration, are heading the venture, and say their purchase across the multitude of media markets will give them \"access to one-third of the Hispanic population\" within the U.S, according to an interview conducted by Axios.",
    "\"Governor Ron DeSantis is taking [on] Soros on his own turf with a Spanish language ad buy on the Soros network, serving as a PSA to Hispanic Floridians to warn of the pro-socialism, radical agenda behind The Latino Media Network,\" read a statement the DeSantis campaign provided to Fox News Digital.",
    "Ron DeSantis' reelection campaign is hitting back at attempts by liberal billionaire George Soros to \"manipulate\" the midterm elections by purchasing an ad buy on two Miami radio stations being acquired by a new left-wing radio network targeted toward Hispanic Americans.",
    "The formation of the Latino Media Network, a new network set to be made up of 18 Hispanic radio stations across 10 different markets, was announced last week, and was partially financed by Lakestar Finance, an investment group affiliated with Soros Fund Management.",
    "In April, a poll from Quinnipiac University showed President Biden's approval among Hispanics sitting at just 26%, appearing to solidify earlier polls showing Hispanic support sharply slipping from Democrats and increasing toward Republicans.",
    "HISPANIC LEADERS BLAST THE LEFT'S PORTRAYAL OF LATINO ELECTORATE: A DEGRADATION TO WHO WE ARE\nThe investment project comes as concern from Democrats continues to grow over the party's loss in support from large swaths of Hispanic voters.",
    "The new DeSantis ad, which will air on WAQI-AM and WQBA-AM, warns voters about the media purchase and touts his stance against \"leftist disinformation\" as he continues the \"fight against socialism in America.\"",
    "Billionaire George Soros, known for financing extreme leftist causes, is now financing the purchase of Hispanic radio stations right here in Miami,\" the translated version of the ad says.",
    "In Florida, we reject the professional Left and their attempt to infiltrate our state and will always stand for truth and freedom,\" DeSantis said.",
    "In an exclusive statement provided to Fox News Digital, DeSantis pushed back on what he described as the Left's \"attempt to infiltrate\" Florida.",
    "\"The Soros-funded radical Left is running a scheme to manipulate local media in Florida to push their Marxist agenda on voters.",
    "Under Governor Ron DeSantis leadership Florida is standing against the corporate media and leftist disinformation.\"",
    "\"Soros and his minions know what this community represents in the fight against socialism in America.",
    "\"They are coming with their ideological agenda,\" it continues.",
    "The Left is taking control of our local media.",
    "This community will not get confused.",
    "Republican Florida Gov.",
    "\"Warning, voters!"
  ]
}