{
  "id": 9016,
  "mediaId": 238,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Opinion A new low in anti-trans bills: Genital exams for female athletes",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/06/06/ohio-bill-transgender-athletes-gender-confirmation-exams/",
  "sentiment": "0",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alyssa Rosenberg",
  "authorUrl": "https://www.washingtonpost.com/people/alyssa-rosenberg/",
  "termIds": [
    661
  ],
  "sentences": [
    "Ohios measure requires that if a participants sex is disputed, the athlete in question must provide a doctors note confirming their physical sex on the basis of the participants internal and external reproductive anatomy, the participants normal endogenously produced levels of testosterone or an analysis of the participants genetic makeup.",
    "Last week in Ohio, this nasty-minded moment reached a new nadir: If a measure passed by Republican state legislators becomes law, anyone could force girls and young women to submit to invasive gender-verification tests if they want to stay on their high school and college sports teams.",
    "And the experience of Caster Semenya, a South African Olympian, demonstrates that natural variations in genetics or testosterone levels could be used to shift children and young adults from one sex category to another  or leave them in a kind of undetermined zone.",
    "The proposal also gives anyone  whether a parent eager to eliminate their childs competition or a national activist looking to make local trouble  the standing to challenge an athletes gender, and provides no disincentives for making false reports.",
    "Ron DeSantis (R) signing legislation that allows parents to sue schools if they suspect their children are being taught critical race theory, a specific academic discipline that has been transformed into a catchall boogeyman.",
    "Republicans in Ohios statehouse intended to draw more rigid gender boundaries  in a place where only five transgender athletes are competing in school sports this year, according to the Ohio High School Athletic Association.",
    "Beyond the ways in which the measure would harm young trans athletes, there is no check on the vicious ways in which hypercompetitive parents might use this bill to hurt not just trans girls but any young women.",
    "In Texas, this has meant not just giving people the right to sue anyone who helps a woman obtain an abortion beyond six weeks but also providing financial bounties for successful lawsuits as an incentive.",
    "Greg Abbott (R) asking members of the general public to report parents who provide gender-affirming medical care to their transgender children, so the state can investigate those parents for child abuse.",
    "In plain language: Verifying someones gender through an examination of the participants internal and external reproductive anatomy means a doctor must look at a young athletes genitals.",
    "Asking a student to choose between an unnecessary medical exam and a desire to keep playing sports is vicious; morally, if not legally, its a kind of medical rape.",
    "Wanda Holloway notoriously hired a hit man to knock off her daughters rival for a slot on the school cheerleading squad, as well as the girls mother.",
    "It has morphed into a broader movement and mind-set encouraging people to tattle on one another to the courts or the state  with grave consequences.",
    "And a standard pelvic exam involves a physician putting their fingers inside a patients vagina while pushing on the pelvis with their other hand.",
    "Disastrous as this bill is, it feels like a logical conclusion to a wave of legislation encouraging ordinary citizens to police their neighbors.",
    "But it appears inevitable that some aggrieved adult could use the Ohio law to even more devious ends than those for which it is intended.",
    "But this bill opens the door to something worse: using weaponized genital exams to expose an imagined invasion of transgender girls.",
    "That means, as one parent pointed out on Twitter, that children could be judged based on the size and shape of their genitals.",
    "Instead, theyve set the stage for widespread gender confusion and sexualized intervention into childrens sense of themselves.",
    "In a sane world, even the most meddlesome and ardent opponents of trans female athletes would pause at the thought.",
    "And in California, it means an effort to give citizens the ability to sue gun manufacturers and distributors.",
    "The fad for private rights of action started as a fiendishly clever attempt to work around Roe v. Wade.",
    "The legislation also doesnt define what normal genitals, testosterone or genetic makeup are.",
    "It would be cruel enough merely to ban transgender students from girls and womens athletics.",
    "Mike DeWine (R) still have a chance to pull children and young adults back from this abyss.",
    "Theyve subjected opposing teams to racial abuse in an effort to rattle them.",
    "Parents have sued after their children were cut from varsity teams.",
    "The latest trend in American politics is to encourage snitching.",
    "The potential to damage children doesnt end there.",
    "And we know those ruthless parents are out there.",
    "But sane is apparently a lot to ask these days.",
    "Yes, those cases might sound extreme.",
    "In Florida, that means Gov.",
    "Lets hope they take it.",
    "Ohios senators and Gov.",
    "It means Texas Gov."
  ]
}