{
  "id": 9018,
  "mediaId": 18,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Biden on Kimmel no joke as presidents poll numbers plummet",
  "image": "https://www.bostonherald.com/wp-content/uploads/2022/06/both.jpg?w=853",
  "link": "https://www.bostonherald.com/2022/06/06/biden-on-kimmel-no-joke-as-presidents-poll-numbers-plummet/",
  "sentiment": "0",
  "mediaOutlet": "Boston Herald",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Dwinell",
  "authorUrl": "https://www.bostonherald.com/author/joe-dwinell/",
  "termIds": [
    661
  ],
  "sentences": [
    "Biden is struggling with swing voters, particularly Independents and suburban voters; majorities of Independent voters at 55% and suburban voters at 53% disapprove of the job Biden is doing as President, Spencer Kimball, executive director of Emerson College Polling, said in a statement that went with that poll.",
    "Whats working in Bidens favor are both Supreme Court decisions  especially over abortion  that are due out this summer along with the Jan. 6 hearings, which start Thursday, in Congress that will make June a make-or-break month.",
    "Political access to young voters, getting his message out ahead of anything the U.S. Supreme Court may rule any day and trying to blunt former President Donald Trump all qualify as good reasons, Carville said.",
    "The summit is for leaders from across the hemisphere to discuss economic prosperity, climate change, the migration crisis and the COVID-19 pandemic, the White House told the Associated Press.",
    "President Bidens approval rating continues to sink  dropping to 39%  so hes pivoting to the comedy circuit in a calculated attempt to woo dissatisfied young voters, a political wonk says.",
    "Former VP Mike Pence does look like a GOP candidate in 2024 as do a few governors, including New Hampshires Chris Sununu, Floridas Ron DeSantis and Virginias Glenn Youngkin.",
    "This all comes as Bidens window of political revival is closing, according to Politico, with the president looking more like Jimmy Carter than Barack Obama 2.0.",
    "Lots of things happen on your watch but it doesnt mean there is a magic wand to fix it, Robert Gibbs, a press secretary under Obama, told Politico.",
    "It also comes on the same night and ABC channel as the Celtics and Warriors Game 3 tilt at Bostons TD Garden with the series knotted up 1-1.",
    "Biden has said he intends to seek re-election in 2024; Trump has hinted but has yet to say definitively if hes all in for another campaign.",
    "Hes got to get his voter share up, James Carville, a longtime go-to Democratic political consultant, told the Herald Monday.",
    "The economy, crimes, health care, Americas place in the world and Bidens overall leadership are all pulling at his numbers.",
    "The war in Ukraine and a pandemic thats still lingering are also dogging his administration, numerous pollsters say.",
    "But one pollster shows Trump was at 49% at this stage in his presidency, while Biden is at 41%.",
    "Biden heads to Hollywood for the Kimmel show as he hosts the ninth Summit of the Americas.",
    "Both are at 42%, Carville says of Biden halfway into the second year of his tenure.",
    "Biden is set to welcome attendees with an opening address scheduled for Thursday.",
    "Plus, Bidens poll numbers have slipped below Trumps  a figure Carville disputes.",
    "The responsibility of the president is greater than the tools he has to fix it.",
    "Biden has even slipped to 38% in an Emerson College poll from last month.",
    "There are good strategic reasons to do things like going on Jimmy Kimmel.",
    "Jimmy Kimmel is tweeting Bidens appearance Wednesday is no malarkey.",
    "Its something that has bedeviled quite a few previous presidents.",
    "Kimmel, a fan favorite of Democrats and liberals, tapes in L.A.",
    "The limits of the presidency are not well grasped.",
    "Thats according to Rasmussen Polls."
  ]
}