{
  "id": 9020,
  "mediaId": 302,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "In letter, Crist asks federal government to safeguard Floridas voting rights",
  "image": "https://www.tampabay.com/resizer//sha18cfasYAfBSD3vOIXFIpk6Ew=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/KVDID47LJ5DNHLU35CYFCXEPCM.JPG",
  "link": "https://www.tampabay.com/news/florida-politics/2022/06/06/in-letter-crist-asks-federal-government-to-safeguard-floridas-voting-rights/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Along with the new election force, Crist said a 2021 Florida law that cracked down on third-party voter registration, ballot drop boxes and mail ballot requests would disproportionately affect seniors and people with disabilities.",
    "U.S. Rep. Charlie Crist on Friday sent a letter to the U.S. Attorney General asking for the resources of the Department of Justice to help ensure Floridians voting rights are protected in the upcoming elections.",
    "Crists office said he sent the letter because it is the Department of Justices job to protect voting rights under the Civil Rights Division and monitor for evidence of politically motivated voter intimidation.",
    "In the letter to Attorney General Merrick Garland, Crist wrote that Floridas laws have disenfranchised citizens and created a hostility around the constitutional right to vote.",
    "But a federal appeals court panel later reinstated it, saying the federal judges ruling came too close to the November election and had flaws in its argument.",
    "Byrd recently publicly dodged a question about whether President Joe Biden won the 2020 election, saying that there were irregularities in other states.",
    "America has come a long way from poll taxes, literacy tests, and open intimidation and suppression of minority groups, Crist said in his letter.",
    "Crist wrote that the responsibilities of the election force have been made intentionally vague so that anyone can be investigated at any time.",
    "Parts of the 2021 election law were found unconstitutional by a federal judge, who blocked the provisions he deemed unconstitutional.",
    "But he said that effort was curtailed by the Legislature, which passed a law requiring that all financial obligations be paid first.",
    "Crist also pointed to Amendment 4 in 2018, a voter-approved amendment that would reinstate the right to vote to many former felons.",
    "The governors office did not immediately return two emailed requests for comment sent Monday morning about Crists letter.",
    "Ron DeSantis, pointed to the newly created Office of Election Crimes and Security within the Secretary of States office.",
    "Crist also raised questions about Byrds wife, who has drawn criticism for a tweet about the Jan. 6 insurrection.",
    "But in the Sunshine State, what were whispers of Jim Crow-era voter suppression have become a foreboding roar.",
    "He said that the office gives the governor virtually no guardrails  even a Governor who is on the ballot.",
    "Crist noted concerns as well with Cord Byrd, DeSantis pick for Secretary of State.",
    "The office was a DeSantis priority during this years legislative session.",
    "Crist, a Democrat running with the hope of unseating Gov.",
    "A poll tax by another name, Crist said in the letter."
  ]
}