{
  "id": 9025,
  "mediaId": 302,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "500,000 Floridians could lose health coverage without tax credits, study warns",
  "image": "https://www.tampabay.com/resizer//sUL4SpRIvquRgeKilTht9bfvHJU=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/ZMPSPIXWYPSLGI6VYMRZ3TE6UY.jpg",
  "link": "https://www.tampabay.com/news/health/2022/06/06/500000-floridians-could-lose-health-coverage-without-tax-credits-study-warns/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "People who previously turned away and looked at alternative options like short term insurance were able to reconsider and saw a really affordable rate, said Katie Roders Turner, executive director of the Family Healthcare Foundation, a Tampa nonprofit set up to help families and individuals in Hillsborough, Pinellas, Pasco and Polk counties find insurance.",
    "First, it developed a professional readiness exam for aspiring medical school students, called PREview, designed to assess an applicants cultural competence, social skills, and listening skills, as well as their ability to think through situations they may encounter in medical school and clinical settings.",
    "All but four of the countrys 128 M.D.-granting medical schools reported covering content related to obesity and bariatric medicine in the 2020-21 academic year, according to curriculum data provided to KHN by the Association of American Medical Colleges, which does not represent osteopathic schools.",
    "Families without health insurance typically forego critical preventative and early treatment of health issues until their condition forces them to seek emergency room care  the same strain on hospital resources and budgets that the Affordable Care Act was intended to relieve.",
    "This is going to happen not only those seeking preventative care, but folks getting treatment for chronic health conditions, said Jodi Ray, executive director of Florida Covering Kids & Families, a navigator program based at the University of South Florida.",
    "To counter that, the Association of American Medical Colleges plans to roll out in June new diversity, equity, and inclusion standards aimed at teaching doctors, among other things, about respectful treatment of people diagnosed as overweight or obese.",
    "She said a family of four that her group helped find insurance had just been hit with a $6,000 emergency room bill after their child developed a high fever because their short-term insurance policy included a large deductible.",
    "Since it took effect in 2014, the Affordable Care Act  often called Obamacare  has made health insurance affordable to more Americans by creating health insurance marketplaces and subsidizing the cost of premiums.",
    "Florida is one of only 13 states that continues to reject a provision of the Affordable Care Act  passed over a decade ago  that would expand Medicaid eligibility to more than 400,000 of the poorest Floridians.",
    "Meanwhile, half of the medical schools surveyed reported that expanding obesity education was a low priority or not a priority, wrote the authors of a 2020 journal article that describes the surveys results.",
    "Even so, research suggests that many physicians havent been sufficiently trained to address weight issues with patients and that obesity education in medical schools across the world is grossly neglected.",
    "But the fate of that program and many others depends on negotiations between President Joe Biden and West Virginia Sen. Joe Manchin to get the presidents social spending bill through the Senate.",
    "But that year, the American Rescue Plan Act increased the amount of the subsidies and made them available to many more Americans to help mitigate the economic effects of the COVID-19 pandemic.",
    "Research has long shown that doctors are less likely to respect patients who are overweight or obese, even as nearly three-quarters of adults in the U.S. now fall into one of those categories.",
    "When he trained and taught at Harvard Medical School for several years, Butsch said, students received no more than nine hours of obesity education spread over three days in four years.",
    "Second, the medical college association will roll out new competency standards for existing medical students, residents, and doctors related to diversity, equity, and inclusion in June.",
    "We call them softer skills, but theyre really the harder ones to learn, said Lisa Howley, an educational psychologist and senior director of strategic initiatives at the association.",
    "In 2021, Florida lawmakers did pass legislation to make Medicaid available for for mothers and babies, extending their coverage from 60 days to a full year following childbirth.",
    "Obesity, which characterizes patients whose body mass index is 30 or higher, is pervasive in the South and Midwest, according to the Centers for Disease Control and Prevention.",
    "After the source of Melissa Boughtons pelvic pain was discovered, the OB-GYN who had recommended diet and exercise to ease her symptoms told Boughton the tumor was no big deal.",
    "And although the surgery to remove it was considered successful, Boughton has since had trouble conceiving and is undergoing fertility treatment as she tries to have a baby.",
    "Doctors often approach the practice of medicine with an anti-fat bias and struggle to communicate with patients whose weight exceeds whats considered the normal range.",
    "More than 500,000 Floridians could lose their health insurance if Congress fails to extend tax credits passed through the American Rescue Plan Act, a new report warns.",
    "Parents and medical providers need to take special care when talking to children who have been diagnosed with obesity about their weight, psychologists have warned.",
    "But Floridians who earn less than the federal poverty level of $13,590 are not eligible for Medicaid as they would be in states that have fully expanded Medicaid.",
    "Dr. David Cole, president of the Medical University of South Carolina, said plenty of topics should be covered more comprehensively in medical school but arent.",
    "More than a dozen medical schools now recommend or require that applicants submit their PREview test scores with their Medical College Admission Test scores.",
    "Temple Terrace resident Graciela Lopez said subsidies in the Affordable Care Act enabled her to afford the coverage she needs to cover life-saving treatment.",
    "The tax credits dramatically lowered premiums for millions of Florida families who this year obtained their health insurance through the Affordable Care Act.",
    "The bigger issue, he said, is that medicine has historically been taught to emphasize memorization and has failed to emphasize culturally competent care.",
    "Thats not happening for many patients, said Dr. Scott Butsch, director of obesity medicine at the Cleveland Clinics Bariatric and Metabolic Institute.",
    "Their household income was $130,000 per year, but they were still eligible for tax credit subsidies under the new criteria included in the Rescue Act.",
    "Until 2021, those subsidies were only available to those who made up to 400% of the federal poverty level, roughly $53,000 for a single wage earner.",
    "A survey completed by leaders at 40 U.S. medical schools found that only 10% felt their students were very prepared to manage patients with obesity.",
    "Those standards will address racism, implicit bias, and gender equality and will aim to teach doctors how to talk with people who are overweight.",
    "The way parents and providers talk to kids about their weight can have lifelong consequences and in some cases trigger unhealthy eating habits.",
    "There are many different forms of obesity, but were treating them like were giving the same chemotherapy to all kinds of cancer, Butsch said.",
    "Boughton  who describes herself as someone who doesnt fit into the BMI box  said the experience taught her to choose her doctors differently.",
    "Butsch wants Congress to pass a resolution insisting that medical schools incorporate substantive training on nutrition, diet, and obesity.",
    "Obesity is a common, treatable condition linked to a long list of health risks, including Type 2 diabetes, heart disease, and some cancers.",
    "You have these physicians or clinicians  whoever they are  relating everything to the patients obesity without investigation, Butsch said.",
    "When Melissa Boughton complained to her OB-GYN about dull pelvic pain, the doctor responded by asking about her diet and exercise habits.",
    "If lawmakers cannot reach an agreement, premiums could rise by 53% in 2023, forcing millions of Americans to go without health insurance.",
    "Theres this massive tome  its about this big, Cole said, raising his hand about a foot off the top of a conference table in Charleston.",
    "Insurance also pays for a substantial portion of the daily medication she takes to lower hormone levels that could trigger her cancer.",
    "Florida would be one of the states hardest hit, according to a study by the Robert Wood Johnson Foundation and the Urban Institute.",
    "Together with Policy Analysis and Polling, KHN is one of the three major operating programs at KFF (Kaiser Family Foundation).",
    "Extending them would increase the federal deficit by $25.3 billion in 2023 and by $305 billion over 10 years, the study says.",
    "U.S. Rep. Charlie Crist, D-St. Petersburg, has joined local health advocates in calling for an extension of the tax credits.",
    "He acknowledged, though, that the medical school curriculum is already packed with subject matter deemed necessary to cover.",
    "That doctor referred Boughton to a surgical oncologist, who removed the tumor, her left ovary, and part of a fallopian tube.",
    "Every time I was in there, shed talk about diet and exercise, said Boughton, who is 34 and lives in Durham, North Carolina.",
    "The likely impact, the study warns, is the number of uninsured in Florida could rise by 25%, from 2 million to 2.5 million.",
    "Roughly 96% of the 2.7 million Floridians enrolled in the Affordable Care Act were eligible for the tax credits this year.",
    "There are 2.7 million Floridians covered under the Affordable Care Act, and most could also face higher premiums in 2023.",
    "Most of the cost is covered through a marketplace plan offered by Blue Cross Blue Shield, which costs her $169 per month.",
    "Doctors are less likely to respect patients who are overweight or obese, research shows, which affects medical treatment.",
    "It helped the program add 2.5 million more Americans this year, expanding nationwide enrollment to a record 14.4 million.",
    "Any opportunity to reduce the burden on American citizens and, in particular Floridians, is essential for us to pursue.",
    "Without them, a household of four with an income of $111,000 will pay hundreds of dollars more in premiums next year.",
    "They could face an average increase of about $2,000 per year in premiums if they have to purchase private insurance.",
    "On this occasion, three years ago, the OB-GYN told Boughton that losing weight would likely resolve the pelvic pain.",
    "The ultrasound revealed the source of her pain: a 7-centimeter tumor filled with fluid on Boughtons left ovary.",
    "But those subsidies will expire at the end of this year as attempts by Congress to extend them have stalled.",
    "Boughton sought a second opinion from a doctor who marketed her practice as a Healthy at Every Size office.",
    "The question seemed irrelevant, considering the type of pain she was having, Boughton thought at the time.",
    "KHN (Kaiser Health News) is a national newsroom that produces in-depth journalism about health issues.",
    "A 53% increase on premiums could be very painful for a whole lot of families in the state of Florida.",
    "House Democrats can extend the credits via a reconciliation bill to clear Republican opposition.",
    "That was valid 100 years ago, if you were supposed to be the fount of all knowledge, Cole said.",
    "The problem, Butsch argued, is that too little attention is paid to obesity in medical school.",
    "KFF is an endowed nonprofit organization providing information on health issues to the nation.",
    "I hate that doctor for the way she treated me  like my pain was no big deal, Boughton said.",
    "Crist was critical of DeSantis on a call with reporters focused on health care in late May.",
    "The stereotypes and misperceptions around this disease just bleed into clinical practice.",
    "The Association of American Medical Colleges is trying to tackle the problem in two ways.",
    "The state with the highest rate is Mississippi, where 4 in 10 adults qualify as obese.",
    "The physician brought up diet and exercise at least twice more during the appointment.",
    "For children who are obese, obesity experts agree, weight loss isnt always the goal.",
    "She is also on daily medication that would cost $1,000 per month without insurance.",
    "In 2013, the American Medical Association voted to recognize obesity as a disease.",
    "She was diagnosed with breast cancer three years ago and had a double mastectomy.",
    "Families that earn above that limit would no longer be eligible for the program.",
    "She sees an oncologist every three months and another specialist twice a year.",
    "But, Butsch said, doctors often approach it with a one-size-fits-all approach.",
    "Some obesity experts blame a lack of focus on the subject in medical schools.",
    "The cost we have to pay for health care in America is absurd, Crist said.",
    "If I change my insurance, I have to find different oncologists, she said.",
    "She seemed to make a decision about me based off of a very cursory look.",
    "She acted like it was the most normal thing in the world, Boughton said.",
    "The doctor said shed order an ultrasound to put Boughtons mind at ease.",
    "She is worried she wont be able to afford a substantial premium hike.",
    "He is one of six Democratic candidates vying to unseat Florida Gov.",
    "Any more than that, and she starts shopping for a different doctor.",
    "Opposition to extending the tax credits has focused on the cost.",
    "The bias toward those individuals is way too high, Howley said.",
    "You can ask me if I diet and exercise like once, she said.",
    "Despite obesitys prevalence, it carries a unique stigma.",
    "The topic is: Things I never learned in medical school.",
    "Eat less, move more doesnt work for everyone, he said.",
    "I feel very young at 34 to be going through this.",
    "But it wasnt unusual coming from this doctor.",
    "I have to keep my insurance as long as I can.",
    "We have a lot more work to do in this space.",
    "The tumor was large, but it wasnt cancerous.",
    "Its an emotional roller coaster, she said.",
    "This is almost like malpractice.",
    "Others blame a lack of empathy.",
    "Thats just not valid anymore.",
    "Ron DeSantis in November."
  ]
}