{
  "id": 9027,
  "mediaId": 302,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "DeSantis budget vetoes hit school, university priorities of his allies",
  "image": "https://www.tampabay.com/resizer//18iWcPoarKp67bNjgtDBJFO2xu8=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/7UK4K6F6TXIFI3O4YXYM7O7RZE.jpg",
  "link": "https://www.tampabay.com/news/education/2022/06/06/desantis-budget-vetoes-hit-school-university-priorities-of-his-allies/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Teacher pay: Miami-Dade County voters will decide in November whether to increase their local property taxes to help give school teachers and other employees a raise, the Miami Herald reports.",
    "DeSantis said that he didnt necessarily disapprove of the projects he axed, but rather that the state needed to keep the spending plan below $110 billion, just in case.",
    "The big story: A day after Gov Ron DeSantis signed what he called Floridas biggest state budget ever, much talk remained focused on his extensive vetoes.",
    "Book challenges: Some of the Floridians calling for the removal of books from schools are not parents and have not read all the materials, WFTS reports.",
    "Several observers couldnt help noticing the governor eliminated items that had broad community and legislative support, without offering explanation.",
    "One example was a major science center for the University of South Florida St. Petersburg campus, highly touted by House Speaker Chris Sprowls.",
    "Envisioned as a centerpiece for the waterfront campus, DeSantis killed the $75 million appropriation as Sprowls stood behind him with a smile.",
    "Two teen brothers were arrested on accusations of carrying guns and ammunition to a different Broward County charter school, WPLG reports.",
    "Other school news\nA Palm Beach County School Board member called the police shooting of a man who crashed into a school campus a murder.",
    "Every Thursday, get the latest updates on whats happening in Tampa Bay area schools from Times education reporter Jeffrey S. Solochek.",
    "Hot topics\nCampus safety: The Broward County school district banned backpacks for the final three days of classes, WSVN reports.",
    "Brevard County teacher contract negotiators have run into differences over recurring pay raises, Florida Today reports.",
    "Candidates for Sarasota County School Board positions squared off during a moderated forum, the Herald-Tribune reports.",
    "Doctors told a Lake County teen she would never walk again after an accident that left with traumatic brain injury.",
    "DeSantis signed into law new measures aimed at improving Floridas school security laws, the Sun-Sentinel reports.",
    "Guns at school: Officers found a box with loaded guns on the campus of a Broward County charter school.",
    "She walked across the stage for her high school graduation ceremony, WKMG reports.",
    "School board elections are heating up, as candidate qualifying approaches.",
    "Some were the priorities of key lawmakers who had served as loyal allies.",
    "Now backers are left hoping for better results next year.",
    "Police groups took offense, the Palm Beach Post reports.",
    "It belonged to the principal, WSVN reports.",
    "Agree or disagree with these Top 25 goals?",
    "Sign up for the Gradebook newsletter!",
    "The Premiere League season is ended.",
    "Before you go ... OK, soccer fans.",
    "Click here to sign up."
  ]
}