{
  "id": 9028,
  "mediaId": 151,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "Florida's gun law and D.C. dysfunction",
  "image": "https://static.politico.com/d3/05/ba68c9f5400bbef72003544b41ba/fineoutlogo.jpg",
  "link": "https://www.politico.com/newsletters/florida-playbook/2022/06/06/floridas-gun-law-and-d-c-dysfunction-00037333",
  "sentiment": "0",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Tampas Ann Turner Cook, the original Gerber baby, dies at 95, by The Associated Press\n Investors say Miami crypto whiz kid took them to the cleaners, by Miami Heralds Allie Pitchon\n Broward School District banning backpacks for final three days of school year, by South Florida Sun-Sentinels Wells Dusenbury\n Miami-Dade schools to ask voters to pay more for teachers and school safety, by Miami-Heralds Sommer Brugal\n Fences dramatically cut suicide at Tampa Bays Skyway Bridge, by Bradenton Heralds Jessica De Leon\nODDS, ENDS AND FLORIDA MEN\n Most, but not all, Rays show their LGBTQ+ support, by Tampa Bay Times Marc Topkin: In an effort to make their commitment more visible, the Rays this year decided to follow the lead of the Giants and add rainbow-colored logos to their Pride Night uniforms, to the 'TB' on their caps and a sunburst on their right jersey sleeves.",
    "Jeanette Nez  former Rep. Allen Boyd  former state Sen. Paula Dockery  Cathy Schroeder, deputy staff director for Florida Senate Democratic office\nFollow us on Twitter\nGary Fineout @fineout\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our political and policy newsletters\nFollow Us",
    "Trump loses to DeSantis in 2024 straw poll at Conservative Summit  again, by Newsweeks Jason Lemon\nMEANWHILE  Look whos placing ads to support Iowa GOP: Trump and other potential 2024 contenders, by Fox News Paul Steinhauser: At the top of the list is former President Donald Trump, who 16 months removed from the White House remains the most popular and influential politician in the GOP as he repeatedly flirts with making another national run in 2024.",
    "PENINSULA AND BEYOND\nFLORIDA MAN  Palm Beach County lib accused of threatening to use second amendment tool against conservative Congresswoman Boebert, by South Florida Sun-Sentinels Rafael Olmeda: A Palm Beach County man is facing federal charges for making online threats against Colorado Congresswoman Lauren Boebert, a conservative darling known for her unwavering support of the Second Amendment and the 45th president.",
    "SIGNALS  Radio Mambi is sold to new media group with ties to national Democrats, by Miami Heralds Bianca Padr Ocasio: Two Latina entrepreneurs  backed by a slew of investors  have negotiated a $60 million deal with TelevisaUnivision to buy 18 Spanish-language radio stations across 10 U.S. cities, including Miamis Radio Mambi, a fixture of South Floridas conservative Cuban community.",
    "COVID Comeback: Much of Florida at high risk of straining hospitals; indoor masks urged, by Palm Beach Posts Chris Persaud: The latest wave of COVID-19 infections, driven by omicron subvariants of the coronavirus, has surged so much that the U.S. Centers for Disease Control and Prevention recommends that people in most of central and southern Florida should mask up while indoors.",
    "DeSantis expected to name Renatha Francis to Florida Supreme Court after 2020 bid was derailed, by Palm Beach Posts Jane Musgrave: Two years after Florida Supreme Court justices blocked Palm Beach County Circuit Judge Renatha Francis from joining their ranks, she is widely viewed as a shoo-in for the latest opening on the states highest court.",
    "MOST PEOPLE HAVE HAD IT BY NOW  Special Olympics reverses vaccine requirement after Florida threatens $27.5 million fine, by POLITICOs Arek Sarkissian: The Special Olympics reversed its Covid-19 vaccine mandate for upcoming competitions in Orlando after Florida threatened event organizers with a $27.5 million fine over the requirement.",
    "Murphy calls Florida gun law the right one as senators negotiate federal legislation, by POLITICOs Brianna Crummy: The senators at the helm of negotiating gun legislation are looking to the Florida law passed in 2018 after the school shooting in Parkland as a potential blueprint for the nation, Sen. Chris Murphy said Sunday.",
    "What it did The legislation from 2018 was multifaceted, but it raised the age to buy a rifle to 21, created a three-day waiting period on purchases, and put in place a red flag measure that allows law enforcement to ask a judge for permission to temporarily seize guns from someone deemed a danger to themselves or others.",
    "Florida law cited Sen. Chris Murphy, the Connecticut Democrat involved in negotiations over a possible federal bill, on Sunday name-checked the four-year old Florida law passed in the aftermath of the horrific shooting at Marjory Stoneman Douglas High School where 17 people  including 14 students  were killed.",
    "The CDC's COVID-19 Community Levels system says the disease has a high risk of straining hospitals in much of Florida, including its east coast south of St. Johns County; Alachua County; counties along Interstate 4; and the parts of Interstate 75 stretching from Tampa Bay through Sarasota County.",
    "BUT WAIT, WAIT DeSantis tops Trump overall, gets close among Republicans only: Nevada poll, by Newsweeks Natalie Colarossi: A new poll asking Nevada voters to rate prominent politicians found that Florida Republican Governor Ron DeSantis is generally favored over former President Donald Trump.",
    "by NBC News Jonathan Allen: Former President Donald Trump is bored at Mar-a-Lago and anxious to get back in the political arena  as a candidate, not a kingmaker  according to his advisers, who are divided over whether he should launch a third bid for the presidency as early as this summer.",
    "While many Trump confidants believe he should wait until after November's midterm elections  and caution that he has not yet made a final decision about running  some say he could move more quickly to harness supporters and deny fuel to the busload of GOP hopefuls in his rearview mirror.",
    "Going to the scene Jared Moskowitz, a former Democratic state legislator deeply involved in the push for the law, said in an interview that a key part in getting legislation passed was making sure Republican leaders realized the scope of the Parkland tragedy.",
    "We believe that Charlie Crist is the only candidate in this race that can defeat Ron DeSantis, take action to protect our environment and confront the ongoing climate crisis, Luigi Guadarrama, political director of Sierra Club Florida, said in a statement.",
    "The massive buy is the first for the newly created Latino Media Network, a Latina-owned and operated media company that has raised close to $80 million, a figure the group says amounts to the largest capital raised by a Latina-led startup in U.S. history.",
    "HMM  Rick Scott says rich kid Joe Biden doesnt understand inflation, by Florida Politics A.G. Gancarski: U.S. Sen. Rick Scott took questions from the Fox and Friends weekend crew Sunday, revisiting inflation with some new material to hammer the President.",
    "by Palm Beach Posts Katherine Kokal: This dearth of support is playing out in Jupiter, where an adopted 14-year-old and the teen's siblings are now in the custody of the state as their parents face aggravated child abuse and false imprisonment charges.",
    "The survey, conducted by the University of Nevada-Reno, asked voters to rate politicians such as Trump, DeSantis, President Joe Biden, and Vice President Kamala Harris on a scale of zero to 100, with a higher number reflecting a more favorable opinion.",
    "CAMPAIGN ROUNDUP  Rep. Charlie Crist, the Democratic frontrunner in the governors race, on Monday picked up the endorsement of the Florida Chapter of the Sierra Club, the environmental advocacy group that has 240,000 members in the state.",
    "The bill barely cleared the state Senate, and while it passed the state House by a wider margin, the measure was opposed by Democrats who said it was too weak of a response and Republicans who considered it an infringement on gun rights.",
    "Cava praised Moskowitz for his work pushing gun legislation in the aftermath of the shooting at Marjory Stoneman Douglas High School and his work as Floridas emergency management director when he was part of the DeSantis administration.",
    "Beans move sets up whats likely to be a bruising primary with state Rep. Jason Fischer (R-Jacksonville), who has already filed to run for the 4th Congressional District, which includes portions of Clay, Duval and Nassau counties.",
    "THE NEXT STEPS  Jan. 6 committees private divide, by Axioss Jonathan Swan and Hans Nichols: Jan. 6 committee members have privately discussed other potential legislative recommendations, though nothing has been decided.",
    "JUMPING IN Bean officially launches bid for Congress, by POLITICOs Matt Dixon: Republican Florida Sen. Aaron Bean on Friday announced his long-anticipated bid for a newly-drawn Jacksonville-area congressional district.",
    "While a judicial nominating commission Monday will begin interviewing the 17 candidates who applied to replace retiring Justice Alan Lawson, most legal observers agree that the exercise is just window-dressing.",
    "Rep. Stephanie Murphy (D-Fla.) has argued for legislation to improve coordination among intelligence and security agencies, similar to what happened after 9/11, according to a source with direct knowledge.",
    "He added that even though Scott didnt agree with everything in the bill he too realized that even if it wasnt good for him politically, how was he going to tell 17 families we are not going to do anything?",
    "Adam, chosen by team officials to speak for the players who opted out, said it was primarily a matter of religious beliefs and not wanting to encourage the 'behavior' of those in the LGBTQ+ community.",
    "The Special Olympics issued a statement on Friday saying it will lift its mandate as directed by state officials on May 27 based upon the Florida Department of Healths interpretation of Florida law.\"",
    "Whats happened More than 8,000 final risk protection aka \"red flag\" orders have been issued by judges since the 2018 law went into effect, according to the state courts administrators office.",
    "Rick Scott has elements that senators are considering as they look to pass gun legislation following a school shooting that took place in Uvalde, Texas, killing 19 children and two teachers.",
    "Fish swam: Scenes from South Florida neighborhoods after the heavy rain, by Miami Heralds Joey Flechas and Jimena Tavel: Cars were marooned in the middle of Brickells waterlogged streets.",
    "But tonights headliner, Brooks and Dunn, wasnt the biggest name there, Governor Ron DeSantis made an appearance for the second year in a row speaking to the crowd for a few minutes.",
    "Brown\n Florida mayors urge Senate to pass gun safety bills after Uvalde, Buffalo mass shootings, by USA Today Network-Florida\nCAMPAIGN MODE\nCOMING ATTRACTIONS Trump on the brink?",
    "Also paying to have their ads appear in the tabloid, which can be found on the Iowa GOPs website, are former Trump Secretary of State Mike Pompeo, through his CAVPAC; and Sens.",
    "Pitchers Jason Adam, Jalen Beeks, Brooks Raley, Jeffrey Springs and Ryan Thompson were among those who did not, electing to peel off the burst logo and wear the standard hat.",
    "Legislators also poured in money for mental health and school resource officers, as well as create a guardian program that allows armed individuals to be on school campuses.",
    "Timothy and Tracy Ferriter were arrested Feb. 8 after police found evidence they locked their adopted child in an 8-by-8-foot garage room for up to 18 hours at a time.",
    "They saw what it looked like when there were bullet holes in the windows, there were backpacks stacked outside, there was pools of blood outside the doors, he said.",
    "Floridas Democratic gubernatorial candidates are debating how many debates to have, by Steve Bosquet for WFSU\n... DATELINE TALLAHASSEE ...\nSECOND CHANCE Gov.",
    "That can change very quickly with each of these elections so what I want to ask all of you to do is join our efforts this November to keep this state free.",
    "His real name was Howard Farley Jr., and law enforcement alleged that hed been the leader of one of the largest drug-trafficking rings in Nebraska history.",
    "Scott  the richest man in the U.S. Senate  posited that rich kid Joe Biden doesnt understand inflation because hes out of touch with the working class.",
    "A tropical disturbance has dumped nine to 11 inches of rain across South Florida, flooding neighborhoods from the coast to the edge of the Everglades.",
    "The soggier side of this hurricane seasons first potential tropical cyclone started to soak the region Friday and continued through a dreary Saturday.",
    "Miami-Dade County Mayor Daniella Levine Cava on Sunday endorsed former state Rep. Jared Moskowitz in his bid for Floridas 23rd Congressional District.",
    "The Fugitive Next Door, by Greg Donahue for The Atavist Magazine: For the previous 35 years, Tim Brown had been living a carefully constructed lie.",
    "Murphy (D-Conn.) said on CNNs State of the Union that the bill passed by a Republican legislature and signed into law by then-Republican Gov.",
    "The family had adopted the teen, who told police they were physically assaulted by their parents, just before the child turned 2 years old.",
    "Gun control advocates call on Marco Rubio to join their fight to end gun violence, by South Florida Sun-Sentinels Brooke Baitinger\n Gov.",
    "Murphy has also argued the committee should explore strengthening sentencing and punishment for seditious conspiracy and insurrection.",
    "However, the Florida governor trailed Trump when it came to just Republican voters, receiving a score of 69, versus Trump's 73.",
    "DeSantis finally comments at length on Buffalo, Uvalde, Parkland and Columbine mass shootings, by Florida Phoenixs Danielle J.",
    "A county worker stayed up all night filling trash bags with debris collected from clogged storm drains in west Miami-Dade.",
    "Ron DeSantis visits last night of Gulf Coast Jam, by WMBBs Jake Holter: Over 20,000 people a day attended the festival.",
    "Officials say Matthew Lee Comiskey made several posts on Twitter last summer threatening violence against Boebert.",
    "Lots of no votes It is important to note that the legislation passed by Florida Republicans was not an easy lift.",
    "DeSantis vetoes slash Senates sprinkle list, goes light on Houses, by Florida Politics Gray Rohrer\nDATELINE D.C.",
    "Florida's gun law and D.C. dysfunction\nBy GARY FINEOUT\n06/06/2022 06:59 AM EDT\nHello and welcome to Monday.",
    "The Sunshine way Could Florida be the model for a bipartisan solution on gun violence in Washington D.C.?",
    "Ron DeSantis, back when he was running for governor, said he would not have signed the bill into law.",
    "GOP backed Murphy noted that the law was passed by a Republican Legislature and signed by then-Gov.",
    "He also added that \"we have to make the case for Republicans right now that this is good politics.\"",
    "Ron DeSantis) doesnt pick her, said Robert Jarvis, a law professor at Nova Southeastern University.",
    "Rick Scott of Florida and Tim Scott of South Carolina, through their Senate reelection committees.",
    "It's not clear that Scott or Sen. Marco Rubio would vote for a bill modeled after the Florida law.",
    "I got my second amendment tool all ready to destroy Laurens face, he allegedly wrote in one post.",
    "Have a tip, story, suggestion, birthday, anniversary, new job, or any other nugget for Playbook?",
    "No exact breakdown was provided, but well more than half the players appeared to participate.",
    "He told CNNs Jake Tapper that it is the kind of passage that I think can pass the Senate.",
    "He added that if it can happen in Florida, it can happen in Texas, it can happen in D.C.",
    "Did Floridas adoption system fail Jupiter teen forced to live in a locked garage room?",
    "This state is free because weve led and weve made the decisions to keep it free, Gov.",
    "Fish swam up through the a parking garages storm drain at a condo near Miami Shores.",
    "It didnt save their Tampa Bay priorities, by Tampa Bay Times Emily L. Mahoney\n Gov.",
    "Trumps Save America PAC placed their large ad in the tabloids centerfold position.",
    "And weve got people who moved to Florida to enjoy the beach going back to work.",
    "When it happened, with men pointing guns at me, the only thing to do was smile.",
    "Moskowitz said enough legislators put aside politics and a consensus emerged.",
    "Top legislators visited the site in person within days of the mass shooting.",
    "In doing so, the team learned that not all players wanted to be included.",
    "I had mentally prepared myself for being caught, he would later say.",
    "Neighbors in Pompano Beach cruised down the street on paddleboards.",
    "Overall DeSantis received a score of 48, compared to Trump with 42.",
    "Its the 78th anniversary of D-Day, the Allied invasion of Normandy.",
    "Two GOP legislators who voted no are now sitting in the U.S. House.",
    "It requires Democrats and Republicans to figure out whats possible.",
    "Get in touch: gfineout@politico.com\nDRIVING THE DAY\nA PATH FORWARD?",
    "As he was placed under arrest, a wry grin spread across his face.",
    "He wasnt just an aging retiree with a passion for aviation.",
    "Weve got Biden at the beach, he complained.",
    "Top lawmakers passed DeSantis priorities.",
    "In fact, he wasnt Tim Brown at all.",
    "Nothing official announced for Gov.",
    "CORONAVIRUS UPDATES\nA SUMMER WAVE?",
    "I would be very surprised if (Gov.",
    "Hopefully in front of her kids.",
    "Both have pleaded not guilty.",
    "You cant make this stuff up.",
    "SWAMPED  Cars stalled.",
    "WHATS GOING ON HERE?",
    "WEEKEND OUTING Gov.",
    "BIRTHDAYS: Lt. Gov.",
    "DeSantis said.",
    "A compromise?",
    "WHERE'S RON?",
    "Rick Scott.",
    "DeSantis."
  ]
}