{
  "id": 9031,
  "mediaId": 409,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "BREAKING: Ilya Shapiro Resigns from Georgetown Law School",
  "image": "https://www.nationalreview.com/wp-content/uploads/2021/09/ilya-shapiro-cpac-2016.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/breaking-ilya-shapiro-resigns-from-georgetown-law-school/",
  "sentiment": "0",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan McLaughlin",
  "authorUrl": "https://www.nationalreview.com/author/dan-mclaughlin/",
  "termIds": [
    661
  ],
  "sentences": [
    "As I noted on Thursday, Ilya Shapiros reinstatement at Georgetowns law school may have been a victory for outside pressure against the forces of cancel culture, but it also sent an unambiguous signal that Georgetown would have caved to the mob and fired Shapiro if it was at liberty to do so, and would lie in wait for the first instant that a student found it politically useful to claim offense at Shapiro in order to make that happen once his defenders had let down their vigilance.",
    "Shapiro also notes the egregious double standard applied by Georgetown to belligerent, malicious, and bigoted tweets by faculty on the left side of the political spectrum:\n In 2018, Georgetown protected this tweet from Professor Carol Christine Fair during Justice Kavanaughs confirmation process: Look at this chorus of entitled white men justifying a serial rapists arrogated entitlement.",
    "She went on to reference Ron DeSantis, Ted Cruz, and Mitch McConnell and say, The only ethically and politically responsible stance to take toward the Republican party is to consistently point out that it is no longer a legitimate participant in U.S. constitutional democracy.",
    "Its a complete miscomprehension to read what I said to suggest that the best Supreme Court nominee could not be a Black woman, as you did in your very first statement back on January 27, or that I considered all black women to be lesser than everyone else .",
    "The problem is endemic: The proliferation of IDEAA-style offices (more typically styled Diversity, Equity, and Inclusion) enforce an orthodoxy that stifles intellectual diversity, undermines equal opportunity, and excludes dissenting voices.",
    "Just last month, law professor Josh Chafetz tweeted: The protest at the Supreme Court, not at the justices houses line would be more persuasive if the Court hadnt this week erected fencing to prevent protesters from coming anywhere near it.",
    "By allowing any student to claim offense without proving that offense was intended or that comments were objectively offensive, all sorts of comments that someone  anyone  could find offensive would subject me to disciplinary action.",
    "He also notes the absurdity of suspending him for four months simply to read a tweet and conclude that it was written before he started the job: a sham investigation that apparently couldve been resolved by looking at a calendar.",
    "In 2020, Georgetown took no action when law professor Heidi Feldblum tweeted law professors and law school deans should not support applications from our students to clerk for judges appointed by President Donald Trump.",
    "As Shapiro notes in his resignation letter, his original tweet was not offensive, it was merely poorly worded: No reasonable person acting in good faith could construe what I tweeted to be objectively offensive.",
    "On the IDEAA theory, this pattern of remarks certainly created a hostile educational environment for our Republican students, who are a protected class under D.C. antidiscrimination law.",
    "When Prof. Fair advocated mass murder and castration based on race and gender, Georgetown did not initiate an investigation, but instead invoked Georgetowns free-expression policy.",
    "These comments have the potential to threaten the careers of all of our conservative and libertarian students, or indeed anyone who clerks for duly confirmed Article III judges.",
    "Moreover, as he notes, any harm done by my tweet was done by those seeking that Georgetown fire me  mainly, Mark Joseph Stern of Slate, who labored to stoke the controversy.",
    "That makes an obvious mockery of the universitys supposed commitment to the sort of robust free speech we associate with academic freedom when the speaker is left-of-center.",
    "Youve made it impossible for me to fulfill the duties of my appointed post, he writes; youve painted a target on my back such that I could never do the job I was hired for.",
    "Yet no investigation of these tweets was instigated after they were brought to your attention, after the precedent of investigating my tweets had already been established.",
    "It was they, not I, who intentionally and knowingly caused any harm to any student who later came to learn of and read their screen captures of the tweet.",
    "To work for such a judge, Prof. Feldblum continued, indelibly marks a lawyer as lacking in the character and judgment necessary for the practice of law.",
    "Calling out the double standard would shame the university, if it was capable of having principles to which fair-minded people could appeal.",
    "Only those acting in bad faith to get me fired because of my political beliefs would misconstrue what I said to suggest otherwise.",
    "Later, he tagged Georgetown Law in a tweet saying that the law school was not going to fire me over a tweet you dont like.",
    "its meaning that I considered one possible candidate to be best and thus all others to be less qualified is clear.",
    "Screen captures of the tweet were then disseminated by others seeking to harm me because of my political views.",
    "Shapiro is not a fool, and rather than work under such conditions, he submitted his resignation this morning.",
    "National Review has obtained a copy of his letter of resignation, citing the hostile work environment you .",
    "This would be a huge Sword of Damocles over my head as I try to engage in my educational mission.",
    "Instead, a month after they were first published, they were quietly deleted without apology.",
    "The other group is a combination of a cult and an insurrection-supporting crime syndicate.",
    "All of them deserve miserable deaths while feminists laugh as they take their last gasps.",
    "Feldblum tweeted, we have only one political party in this country, the Democrats.",
    "Under a genuine regime of academic free speech, no, and Shapiro says as much.",
    "Because it plainly does not, Ilya Shapiro will not be teaching at Georgetown.",
    "Even a stalwart T-14 law school dean bucks these bureaucrats at his peril.",
    "As you know, unlike me, Prof. Feldblum teaches 1Ls in mandatory courses.",
    "It is they, not I, who are morally culpable for any such resulting harm.",
    "Of course, bad faith is a hallmark of this sort of cancel-culture mob.",
    "I deleted my tweet well before any student was likely to learn of it.",
    "Bonus: we castrate their corpses and feed them to swine?",
    "He added, When the mob is right, some (but not all!)",
    "NR Daily is delivered right to you every afternoon.",
    "In April of this yearwell after my own tweetProf.",
    "But under the standard applied to him, yes.",
    "Should these professors have been punished?",
    "more aggressive tactics are justified.",
    "And therein lies the problem.",
    "have created.",
    "No charge.",
    "Yes.",
    ".",
    ".",
    ".",
    "."
  ]
}