{
  "id": 9040,
  "mediaId": 129,
  "date": "6/6/2022 12:00:00 AM",
  "headline": "A Broken Redistricting Process Winds Down, With No Repairs in Sight",
  "image": "https://static01.nyt.com/images/2022/06/06/multimedia/06redistrict-FL/06redistrict-FL-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/06/06/us/scotus-redistricting-congress-maps.html",
  "sentiment": "0",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "But some frustrated Democrats in states like Texas, Florida and Ohio sounded unconvinced as Republicans, who have controlled the House in 10 of the last 15 elections despite losing the popular vote in seven of them, seemed to fare better than Democrats at tilting political maps decisively in their direction in key states they controlled.",
    "Of the approximately 35 states where politicians ultimately control congressional redistricting  the remainder either rely on independent commissions or have only one House seat  the first maps of House seats approved in some 14 states fit many statistical measures of gerrymandering used by political scientists.",
    "Because those missed residents were concentrated in predominantly blue cities, any additional new urban districts probably would have elected Democrats to both congressional and state legislative seats, said Kimball W. Brace, a demographer who has helped Democratic leaders draw political maps for decades.",
    "Democrats pulled nearly even  in terms of the partisan lean of districts, if not the partys prospects for success in the November midterms  largely by undoing some Republican gerrymanders through court battles and ballot initiatives, and by drawing their own partisan maps.",
    "The state court rulings and smattering of new maps from independent commissions this year were bright spots in an otherwise bleak picture, said Paul M. Smith, the senior vice president of the Campaign Legal Center, an advocacy group involved in redistricting battles.",
    "In the first, the justices will review a ruling issued this spring by a three-judge panel that Alabama Republicans violated the Voting Rights Act by drawing only one of the states six House districts where Blacks might elect their favored candidate, instead of two.",
    "On June 16, the court will decide whether to hear a claim by North Carolina Republicans that their state Supreme Court had no authority to strike down its gerrymandered maps on grounds that drawing political boundaries is a legislative duty beyond court review.",
    "Texas Republicans told a federal judge this spring that a State Senate district in Fort Worth could not have been illegally drawn to weaken Black and Hispanic voters because their true goal was to weaken Democrats  a partisan aim beyond federal courts reach.",
    "At the least, political analysts said, Republicans proved more relentless at shielding such maps from court challenges, through artful legal maneuvers and blunt-force political moves that in some cases challenged the authority of the judicial system.",
    "They not only successfully defied repeated orders by the State Supreme Court to obey it, but suggested that the courts chief justice, a Republican, be impeached for rejecting the maps drawn by the states Republican-dominated redistricting commission.",
    "Weeks later in Florida, where voters approved a ban on partisan maps in 2010, the State Supreme Court, comprising seven Republican justices, declined to stop the implementation of a gerrymander of the states 28 congressional districts.",
    "Blatantly unfair Republican maps in states like Texas, Tennessee and Wisconsin have sailed into law without being challenged in state courts because critics assume that state courts are aligned with the gerrymanders drafters.",
    "The delay game played out most glaringly during the extended process in Ohio, where ballot initiatives approved by voters in 2015 established a bipartisan redistricting commission that Republicans have dominated.",
    "The politicians put in charge of it spent nine months trampling the Ohio constitution, trashing the rule of law and wasting taxpayer dollars, Paul De Marco, a Cincinnati lawyer and gerrymandering critic, said.",
    "In April, the seven Democratic justices on New Yorks highest court blew up an aggressive gerrymander of the states 26 congressional districts that had been expected to net Democrats three new House seats.",
    "The doctrine, named the Purcell principle after a 2006 federal lawsuit, says courts should not change election laws or rules too close to an election  how close is unclear  for fear of confusing voters.",
    "WASHINGTON  The brutal once-a-decade process of drawing new boundaries for the nations 435 congressional districts is limping toward a close with the nations two political parties roughly at parity.",
    "Tony Evers, a Democrat, and the Legislature deadlocked this spring over an equally partisan state legislative map, the Republican-controlled Wisconsin Supreme Court ordered new maps drawn.",
    "And, to many involved in efforts to replace gerrymanders with competitive districts, the vanishing number of truly contested House races indicated that whoever won, the voters lost.",
    "But Democrats also began this redistricting cycle with a built-in handicap: The 2020 census markedly undercounted Democratic-leaning constituencies, like Blacks and Hispanics.",
    "But the strategy at times succeeded too well, as courts struck down Democratic maps in some states, and ballot measures kept party leaders from drawing new ones in others.",
    "The courts replacement map, drawn by an independent expert, pits Democratic incumbents against each other and creates new swing districts that could cost Democrats seats.",
    "Should they prevail, gerrymanders might be exempt from courts control, and this years rulings vetoing unfair maps in North Carolina, Maryland and New York could be moot.",
    "Once the fuel has been added to the fire, its very hard to back away from it, said Kathay Feng, the national redistricting director for the advocacy group Common Cause.",
    "What to Know About Redistricting\nRedistricting, Explained: Here are some answers to your most pressing questions about the process that is reshaping American politics.",
    "But in Ohio, Republicans who gerrymandered congressional and state legislative districts this spring also ignored a voter-approved constitutional ban on partisan maps.",
    "When a State Supreme Court deadline for the commission to submit maps of legislative districts for legal review came due last week, Republicans simply ignored it.",
    "With an extremely slim Democratic margin in the House of Representatives, simply redrawing maps in a few key states could determine control of Congress in 2022.",
    "Alabamas congressional map, drawn by Republicans, will be used in the November election, even though a panel of federal judges ruled it a racial gerrymander.",
    "In New York, Democrats ignored a voter-approved constitutional mandate that districts not be drawn to discourage competition or favor political parties.",
    "But elsewhere, Republicans seized on the Supreme Courts embrace of a once-obscure legal doctrine to keep even blatant gerrymanders from being blocked.",
    "Mapmakers then work to ensure that a states districts all have roughly the same number of residents, to ensure equal representation in the House.",
    "Deepening Divides: As political mapmakers create lopsided new district lines, the already polarized parties are being pulled even farther apart.",
    "The Wisconsin State Legislature has been under Republican control since 2011, in part reflecting one of the nations most extreme gerrymanders.",
    "Many experts expect the justices to further weaken or even strike down a portion of the law dealing with racial disparities in redistricting.",
    "Killing Competition: The number of competitive districts is dropping, as both parties use redistricting to draw themselves into safe seats.",
    "A redistricting cycle that began with efforts to demand fair maps instead saw the two parties in an arms race for a competitive advantage.",
    "The ruling cited procedural issues in allowing the map to take effect, but many experts said there was never much doubt about the result.",
    "But the lessons drawn from how they got there offer little cheer for those worried about the direction of the weary American experiment.",
    "The Democrats seriously overreached, said John J. Faso, a Republican and former New York state assemblyman and U.S. representative.",
    "So might the truly independent redistricting commissions that drafted new maps in Michigan, Colorado and a handful of other states.",
    "maps of Ohio House and Senate districts to be used for this years elections, even though the states high court had rejected them.",
    "One of the most extreme congressional gerrymanders added as many as three new Democratic House seats in staunchly blue Illinois.",
    "Partisan mapmakers often move district lines  subtly or egregiously  to cluster voters in a way that advances a political goal.",
    "Lawsuits in state courts dismantled Republican partisan maps in North Carolina and Democratic ones in New York and Maryland.",
    "Most gerrymanders were drawn by Republicans, in part because Republicans control more state governments than Democrats do.",
    "But it said the guiding principle should be to protect incumbents  effectively guaranteeing continued Republican control.",
    "In 2019, the Supreme Court ruled that the federal courts have no role to play in blocking partisan gerrymanders.",
    "Texas Republicans drew a new map that turned one new House seat and eight formerly competitive ones into G.O.P.",
    "Its governors and state officials and sometimes even courts leaning in to affirm these egregious gerrymanders.",
    "The U.S. Supreme Court could rule next year in two pivotal cases arising from this years gerrymander battles.",
    "However, the court left intact parts of the Voting Rights Act that prohibit racial or ethnic gerrymandering.",
    "No challenge was filed in state court, where all nine justices on the State Supreme Court are Republicans.",
    "And in Republicans view, Democrats sabotaged a bipartisan commission that voters set up to draw fair maps.",
    "The reason, the Supreme Court said in February, is that the decision came too close to primary elections.",
    "But we don't know how consequential they will be until we see how the Supreme Court rules, he said.",
    "Republicans carved up Kansas City, Kan.; Salt Lake City; Nashville; Tampa, Fla.; Little Rock, Ark.",
    "Its the redrawing of the boundaries of congressional and state legislative districts.",
    "According to the 2020 census, a third of Alabama residents are African American.",
    "Democrats moved boundaries in New Mexico and Oregon to dilute Republican votes.",
    "It happens every 10 years, after the census, to reflect changes in population.",
    "Each party has won a handful of state court battles to preserve partisan maps.",
    "Now its not just the operatives in the back room, which is where it started.",
    "To have put them in charge was like letting children set their own bedtime.",
    "Ron DeSantis, a Republican, that could net his party four new House seats.",
    "If state legislators can draw their own districts, wont they be biased?",
    "The census dictates how many seats in Congress each state will get.",
    "Understand Gerrymandering: Can you gerrymander your party to power?",
    "More common, though, is that obvious gerrymanders go unchallenged.",
    "Undoing those gerrymanders has proved a hit-or-miss proposition.",
    "How U.S. Redistricting Works\nCard 1 of 8\nWhat is redistricting?",
    "The bipartisan commission, he added, is what people voted for.",
    "Its not just legislators being shameless about drawing lines.",
    "The two parties each claimed redistricting went its way.",
    "Try to draw your own districts in this imaginary state.",
    "The ruling preserves the new map ordered by Gov.",
    "Federal judges ordered the gerrymandered G.O.P.",
    "; Oklahoma City and more to weaken Democrats.",
    "The end of the story hasnt been written yet.",
    "The other case could be even more momentous.",
    "New York is a particularly glaring example.",
    "Why is it important this year?",
    "This is called gerrymandering.",
    "More upheaval could lie ahead.",
    "Is gerrymandering legal?",
    "Its not just technology.",
    "How does it work?",
    "Yes and no.",
    "bastions.",
    "When Gov.",
    "Yes."
  ]
}