{
  "id": 9053,
  "mediaId": 65,
  "date": "6/5/2022 12:00:00 AM",
  "headline": "DeSantis beats Trump in 2024 straw poll a second time at Colorado conservative summit",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/ebafece9-19e6-4d3c-8fc0-aff25a843351/7f8685d6-9fbc-4a74-af34-432abadde5dc/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/desantis-trump-sarah-sanders-straw-poll-western-conservative-summit",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Thomas Phippen",
  "authorUrl": "https://www.foxnews.com/person/p/thomas-phippen",
  "termIds": [
    661
  ],
  "sentences": [
    "Let me be very clear: The reason that we have to talk about it all, is because every stage of life has value, from every moment starting at conception, to the classroom, to the workplace, to the nursing home, to the end of it's natural conclusion, every [life has value],\" Sanders said.",
    "The attendees of the Western Conservative Summit, organized by the Centennial Institute, a think tank associated with Colorado Christian University, approved of a potential DeSantis candidacy for the Republican presidential nomination at 71%, with Trump coming in at 67%.",
    "TULSI GABBARD SUGGESTS OBAMA BEHIND 'MINISTRY OF TRUTH,' SAYS BIDEN JUST 'FRONT MAN'\nSimilarly, \"getting rid of the First Amendment, banning and censoring so-called hate speech as many of our politicians are advocating now, will not get rid of hate,\" she said.",
    "Former Rep. Tulsi Gabbard, D-Hawaii, spoke at the summit for the first time delivering an impassioned speech about the Bill of Rights and decrying politicians who erode freedoms like the First and Second amendments as \"domestic enemies of the people.\"",
    "Ron DeSantis once again swept a straw poll for 2024 presidential candidates at a Colorado conservative conference Saturday, beating out former former President Donald Trump and other possible contenders.",
    "Speaking to the crowd of hundreds of people at a Denver hotel, Sanders recalled her time in the White House with Trump  particularly bringing her children to work with her at times in the West Wing.",
    "The idea that we blindly follow along with whatever the government or those in power tell us is true, it goes against the very essenceof the Constitution and the Bill of Rights,\" she said.",
    "She discussed the importance of education that provides children with the tools to succeed in life rather than \"indoctrinate\" kids, and the importance of protecting the most vulnerable.",
    "Sarah Huckabee Sanders, Trump's press secretary and current GOP nominee for Arkansas governor who spoke at the event Saturday, claimed the fourth-place spot with 18% support.",
    "\"Yes, our freedoms are being threatened, but that threat is not coming from some far off foreign country, but it's coming from within,\" Gabbard said.",
    "The straw poll was conducted based on an \"approval\" system, which allowed attendees to vote for more than one candidate that they could support.",
    "DeSantis has not declared his candidacy for 2024, and Trump has strongly hinted numerous times that he plans to run for the GOP nomination.",
    "\"We have to make sure that we have strong, Christian conservatives, engaged in making sure we have good leadership,\" Sanders said.",
    "The 2022 audience supported Sen. Ted Cruz, R-Texas, at 29%, and former Housing and Urban Development Secretary Ben Carson at 24%.",
    "The politicians \"claim to want to protect us from misinformation, protect us from that which they claim is not true.",
    "DeSantis won the 2024 straw poll last year at the Western Conservative Summit, narrowly edging out Trump.",
    "The temptations of those in power to abuse power is the purpose of the constitution, Gabbard said.",
    "\"Getting rid of the Second Amendment will not stop these evil acts of violence,\" Gabbard said.",
    "\"So often in our pro-life conversation, we only talk about the womb.",
    "DeSantis received 74% approval to Trump's 71% in 2021.",
    "DENVER  Gov."
  ]
}