{
  "id": 9057,
  "mediaId": 675,
  "date": "6/5/2022 12:00:00 AM",
  "headline": "State challenges the college accreditation empire",
  "image": "https://www.wnd.com/wp-content/uploads/2022/03/graduation-commencement-honor-roll-valedictorian-salutatorian-college-university-high-school-students-whites-girl-blondes-teenagers-pixabay.jpg",
  "link": "https://www.wnd.com/?p=5009889",
  "sentiment": "0",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "WND News Services",
  "authorUrl": "https://www.wnd.com/author/wndnewsservices/",
  "termIds": [
    661,
    2171
  ],
  "sentences": [
    "In 2013, when then-governor Rick Scott suggested that Florida A&M University should suspend its president following a student hazing death, SACSCOC threatened the institutions accreditation status because of what it viewed as Governor Scotts undue influence.",
    "And worse yet, in 2017, as the trade journal Inside Higher Ed reported, The University of North Carolina at Chapel Hill sponsored fake classes for nearly two decades, giving students, many of them athletes, credit for courses never taught by instructors.",
    "Within the legislation is a requirement for the states public colleges and universities to leave their current, regionally assigned accreditor, the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC), and find another.",
    "In the previous year, SACSCOC put the University of Virginia on warning after its Board of Visitorswhich by state statute has complete authority over the hiring and firing of the presidentsought and obtained the presidents resignation.",
    "Industry insiders argue that accreditors deserve their plenipotentiary authority because they provide unique assurance that taxpayers investments only flow to reputable schools that offer a high-quality education.",
    "With their fiefdoms threatened, perhaps individual accreditors will be pushed to compete, specialize, or innovateor be consigned to the dustbin of history, as a better system of quality assurance emerges.",
    "By becoming the first state to require public institutions of higher education to change their accreditor, Florida has a chance to strike a blow against the regional monopolies that accreditors hold.",
    "Since the six regional higher education accreditors currently control access to over $116 billion in student loan funding, for most schools, the accreditors will is a matter of financial survival.",
    "It is not uncommon to find accredited schools that saddle their graduates with crippling debt, graduate less than one in ten students on time, or spend more on marketing than financial aid.",
    "Politics\nHealth\nEducation\nDiversions\nU.S.\nWorld\nMoney\nMORE COMMENTARY\nCraige McMillan\nLt. Col. James Zumwalt\nDaniel Joseph\nMichael Brown\nRead all of today's COMMENTARY...\nNew Section",
    "There are, for example, nearly 50 four-year, nonprofit colleges and universities that have four-year graduation rates of 20% or less and still receive accreditation from SACSCOC.",
    "In the early 2000s, SACSCOC placed Campbell University on probation because it had a standard teaching load of 15 hours per week rather than SACSCOCs mandated 12 hours.",
    "It is an implausible claim that this oversight authority is working as intended when student loan debt has nearly doubled to $1.75 trillion in the past 10 years.",
    "In doing so, the bill upends the longstanding system of regional monopolies that locks schools into the authority of a geographically assigned regulatory agency.",
    "In 2013, when Florida legislators attempted to streamline the states general education requirements, SACSCOC stymied their efforts by demanding final approval.",
    "In reality, accreditors have a long history of frustrating attempts to improve educational quality or have been absent from the oversight that really matters.",
    "Floridas latest efforts will not be enough to correct all the problems with accreditation: It needs a comprehensive overhaul at the federal level.",
    "We are told that without the active oversight of accreditors, predatory institutions will mislead applicants and waste taxpayer money.",
    "Hitherto, schools had no opportunity to leave an accreditor that they found capricious, unfair, or inappropriately controlling.",
    "Paul S. Levy is a founder and managing partner of JLL Partners and served on the University of Pennsylvania Board of Trustees.",
    "This lackluster protection of student success is perplexing, given SACSCOCs willingness to wade into matters of governance.",
    "Campbell was forced to consolidate class sections, with previously small class sizes growing to 60 or more students.",
    "With the element of choice comes pressure on the accreditors to exercise greater fairness or lose market share.",
    "Faith\nCommentary\nPatrice Lewis\nBrent Smith\nBarbara Simpson\nWayne Allyn Root\nRead all of today's COMMENTARY...",
    "By Paul Levy & Kyle Beltramini\nReal Clear Education\nLast month, Florida Governor Ron DeSantis signed S.B.",
    "Higher education accreditation may seem a ho-hum bit of insider baseball dictated at the federal level.",
    "In other words, SACSCOC privileged its own judgment over the authority of state law and the board.",
    "Kyle Beltramini is a policy research fellow for the American Council of Trustees and Alumni.",
    "But given the reluctance Congress has shown, it may be time to look to the states.",
    "But with Governor DeSantiss signature, Florida has done what seemed impossible.",
    "[Editor's note: This story originally was published by Real Clear Education.]",
    "[Editor's note: This story originally was published by Real Clear Education.]",
    "SACSCOCs president boasted, I did write the governor and tell him back off.",
    "It refused to grin and bear this intrusion on state and local governance.",
    "7044, a higher education bill that packs a powerful punch.",
    "But accreditors are unreliable judges of quality.",
    "7044 put an end to this accreditors party.",
    "Governor DeSantiss signature on S.B.",
    "Where was SACSCOC all that time?"
  ]
}