{
  "id": 9059,
  "mediaId": 302,
  "date": "6/5/2022 12:00:00 AM",
  "headline": "Amid abortion battle, DeSantis vetoes birth-control funding  again",
  "image": "https://www.tampabay.com/resizer//l07py6bUs1F7YHjamxh8hwj_DOw=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/YV3IGVT2KSI2RCU6T5T4NVUXRE.jpg",
  "link": "https://www.tampabay.com/news/florida-politics/2022/06/05/amid-abortion-battle-desantis-vetoes-birth-control-funding-again/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jack Evans",
  "authorUrl": "https://www.tampabay.com/author/jack-evans",
  "termIds": [
    661
  ],
  "sentences": [
    "Thats despite the fact that the Legislature passed many of the governors often controversial legislative priorities, including during two recent special sessions DeSantis called thatrequired lawmakers to come back to Tallahassee to tackle property insurance issues, Disneys special taxing status and redistricting.",
    "Low-income people who want to access birth control may not be insured and may otherwise be unable to afford it, said Linsey Grove, whos a doctor of public health at the University of South Florida St. Petersburg and president of the League of Women Voters of the St. Petersburg Area.",
    "Long-acting reversible contraception, the type of birth control Simpsons proposal would have funded, refers to contraceptives such as intrauterine devices, which are commonly known as IUDs and can work for a decade, and the Depo-Provera shot, which lasts about three months.",
    "The move by DeSantis was the latest show of power from a governor who not only is comfortable bucking Tallahassee tradition, but who is also a highly political executive willing to use his national clout to get what he wants, even when other Republicans are in the way.",
    "In Simpsons backyard of Pasco County, DeSantis rejected $600 million over the next 30 years for a new H. Lee Moffitt Cancer Center and Research Institute campus, plus road and water projects and $35 million for a potential Tampa Bay Rays spring training facility.",
    "But providing access to reproductive care cant only be based on the economic argument that we want to make sure that low income women have access to contraception, because if they have children, its a burden on the state.",
    "When you consider we are pro-life, how many lives that may be saved by (long-acting reversible contraception), and remember its the people that cannot afford it is what this moneys for, he told Florida Politics in March.",
    "Ron DeSantis slashed $3 billion from the states budget Thursday, one ill-fated item sounded familiar: Just as he did last year, DeSantis vetoed $2 million meant to help low-income people access long-acting birth control.",
    "Ron DeSantis signed the states $109.9 billion budget Thursday and announced a whopping $3.1 billion in line-item vetoes, he was flanked by smiling Republican leaders whose local projects took some of the heaviest hits.",
    "DeSantis, who is widely seen as eyeing a run for president, cast his vetoes as the inverse of the policies of President Joe Biden, whom he called Brandon and said has been recklessly spending, causing record inflation.",
    "Get insights into Florida politics\nFasano said he has approved of DeSantis job performance, but was shocked by the deep cuts to bread-and-butter local government projects like roads and water treatment facilities.",
    "Both House Speaker Chris Sprowls, R-Palm Harbor, and Senate President Wilton Simpson, R-Trilby, praised DeSantis during the news conference at The Villages on Thursday, with Simpson calling him Americas governor.",
    "Women in Florida use IUDs and hormonal implants, as well as birth control as a whole, at lower rates than the national average, according to a report published in 2020 by the Florida Department of Health.",
    "Sen. Jeff Brandes, a Republican from St. Petersburg, said DeSantis vetoes were responsible, and that he wasnt overly surprised at the cuts when both Sprowls and Simpson are about to leave the Legislature.",
    "April Schiff, a Tampa Republican political consultant who represents Hillsborough County in the state party, said DeSantis vetoes show a continuance of his style thats often departed from the status quo.",
    "For their part, the states legislative leaders offered little public response to the vetoes of some of their pet projects and focused on the broader implications of what they said was a historic budget.",
    "If those things arent being supported by folks that truly want to reduce abortion, then I think the intention behind restricting abortion has nothing to do with women or people with uteruses, she said.",
    "Stephanie Fraim, the president and CEO of Planned Parenthood of Southwest and Central Florida  which includes the organizations Tampa Bay-area clinics  questioned the rationale for the veto.",
    "Even when they can get birth control for free or cheap, she said, they may face unexpected costs, such as examination fees, if a doctor wants to perform an ultrasound before placing an IUD.",
    "The senator, whose district includes part of Pasco, Hernando and Citrus counties, has previously said that his push for contraceptive access and his stance against abortion go hand-in-hand.",
    "Politics aside, she said she was disappointed that in a year when the state is flush with cash from the federal government and high tax revenues, important initiatives got quashed.",
    "It came weeks after a leaked Supreme Court opinion suggested the Court will overturn Roe v. Wade, and less than a month before Floridas new 15-week abortion ban goes into effect.",
    "It is a little unusual, but I also think this governor is unusual in that he does things he thinks is the right thing to do, and theyre not the traditional manner, she said.",
    "Instead, DeSantis on Thursday jokingly acknowledged that his vetoes may not make some of the Republicans on stage with him happy, but thats just the way it goes, he said.",
    "On that last topic in particular, legislative leaders passed a congressional map drawn by the governors office even though they initially questioned his legal rationale.",
    "Rep. Michele Rayner, D-St. Petersburg, celebrated that one of her priorities, The Woodson African American Museum of Florida, will still be getting $500,000.",
    "Ron DeSantis bucked tradition by vetoing projects championed by the Legislatures leaders, which some observers said showed a shocking lack of reciprocity.",
    "Get insights into Florida politics\nSubscribe to our free Buzz newsletter\nThe aid is necessary, Grove said, and she applauded Simpson for pushing for it.",
    "And about half of our population may not (be able to) afford these devices, and so I think that is certainly a tool that should be in the toolbox.",
    "One Sprowls priority that fell victim to DeSantis red ink was $75 million for an oceanographic science center at the University of South Florida.",
    "Some Democratic lawmakers said they were amused at how the projects of the minority party fared the same as those championed by Republicans.",
    "Do I find it unusual that leadership projects got cut in the year they basically have no ability to retaliate because theyre all termed out?",
    "It breaks my heart that this is the framework we have to use to get lawmakers to start paying attention to reproductive choice, she said.",
    "Funding for this sensible investment in the health of our communities enjoys rare bipartisan support, she said in an emailed statement.",
    "Researchers have found long-acting reversible contraception to be far more effective than other birth control methods, such as pills.",
    "But DeSantis did not reciprocate, said Mike Fasano, a former longtime Republican lawmaker who is now the Pasco County tax collector.",
    "I understand the leadership isnt going to say anything ... but I can assure you theyre not happy campers this morning, Fasano said.",
    "What were doing in the budget is ... protecting the state against what very well may be a Biden-induced recession, DeSantis said.",
    "Some of their priority funding still made it through alive, including more than $244 million worth of projects funded at USF.",
    "And, thanks to President Biden, the Legislature was able to pass a balanced budget with plenty of money left in reserves.",
    "It was again Senate President Wilton Simpson, a Pasco County Republican, who included it in the $110 billion budget.",
    "To take away health care from vulnerable people is just another example of his ongoing cruelty to Floridians.",
    "That the funding failed yet again indicates the true goal of measures such as the 15-week ban, Grove said.",
    "Neither Sprowls nor Simpson responded to texts Friday asking if they had further comment on the vetoes.",
    "For a second year, $2 million to help low-income women get contraception fell to the governors pen.",
    "For folks who say, oh, if I just play the game and lay down, hell do this  he doesnt, she said.",
    "You would think the governor would look at that and say, I appreciate it, thank you very much.",
    "Unlike last year, though, this veto landed amid a national reckoning on reproductive rights.",
    "The extension of a road in Pasco County has zero effect on the possibility of a recession.",
    "We dont want to be in a situation where were repeating the mistakes of Washington.",
    "DeSantis spokesperson Christina Pushaw didnt respond to requests for comment.",
    "But she said the many vetoes show how DeSantis didnt negotiate in good faith.",
    "He cut so many projects, even for people who carried his water.",
    "This is a time we could have really helped people, she said.",
    "Simpsons spokesperson said Friday he didnt have a comment.",
    "I had to laugh, myself, said Rep. Dianne Hart, D-Tampa.",
    "He has all the carrots and all the sticks.",
    "Its really about his own prerogative.",
    "It has everything to do with control.",
    "Its led to a lot of his successes.",
    "What can I do for you?",
    "No, he said.",
    "When Gov.",
    "When Gov.",
    "Gov."
  ]
}