{
  "id": 9064,
  "mediaId": 19,
  "date": "6/5/2022 12:00:00 AM",
  "headline": "Some Rays Players Choose Not to Wear LGBTQ Pride Night Patches, Citing Religious Faith",
  "image": "https://media.breitbart.com/media/2022/06/Julio-Aguilar_Getty-Images-6-640x480.jpg",
  "link": "https://www.breitbart.com/sports/2022/06/05/some-rays-players-choose-not-to-wear-lgbtq-pride-night-patches-citing-religious-faith/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "AP",
  "authorUrl": "https://www.breitbart.com/news/source/ap/",
  "termIds": [
    661
  ],
  "sentences": [
    "Tampa Bay Rays manager Kevin Cash addressed it after Sundays game, saying he doesnt think itll negatively impact the clubhouse because discussions among the players over past few weeks were constructive and emphasized the value of differing perspectives.",
    "First and foremost, I think the organization has done a really good thing to have Pride Nights supporting our gay community to come out and have a nice night at the ballpark, Cash said.",
    "A number of Tampa Bay Rays players decided not to wear rainbow-colored logos on their uniforms as part of the teams annual Pride Night on Saturday that recognized the LGBTQ community.",
    "Impressed that our players have had those conversions and we want to support our players that choose to wear or choose not to wear to the best of our capabilities.",
    "Its just what we believe the lifestyle hes (Jesus) encouraged us to live for our good, not to withhold, Adam told the Tampa Bay Times.",
    "Ron DeSantis signed, that forbids classroom instruction on sexual orientation and gender identity in kindergarten through third grade.",
    "Members of the LGBTQ community took part in pregame activities and mini LGBTQ flags were given out to fans.",
    "But we love these men and women, we care about them and we want them to feel safe and welcome here.",
    "Reliever Jason Adam was among those who opted out, and said it was a faith-based decision for him.",
    "Critics argue that the laws true intent is to marginalize LGBTQ people and their families.",
    "The turnout for Sundays series finale against the Chicago White Sox was 11,162.",
    "Saturdays attendance was 19,452, above the season average of 16,868.",
    "Earlier this year, Florida legislators passed a law, which Gov."
  ]
}