{
  "id": 9066,
  "mediaId": 99,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "VICTOR DAVIS HANSON: Trumpology",
  "image": "https://www.reviewjournal.com/wp-content/uploads/2022/06/16531048_web1_web_trump-donald-55.jpg?crop=1",
  "link": "https://www.reviewjournal.com/opinion/opinion-columns/victor-davis-hanson/victor-davis-hanson-trumpology-2587530/",
  "sentiment": "0",
  "mediaOutlet": "Las Vegas Review-Journal ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "All Republican candidates will run on secure borders; energy independence; deregulation; Jacksonian foreign policy; a populist, middle-class, nationalism; and deterrence against China  albeit with much-needed new emphasis on destructive deficit spending.",
    "The recent record of doddering septuagenarian and octogenarian politicians  Biden, Nancy Pelosi, Dianne Feinstein  has warned Americans that ones late 70s certainly are not, as the Baby Boomer generation may try to hype, the new 50s.",
    "In the end, a Republican nominee can win who convincingly promises a secure border, a pathway to a balanced budget, energy independence, a crackdown on crime and a strong, nonpolitical military with a commitment to missile defense.",
    "And the nominee would have to do all that neither with gratuitous insults nor playing by wishy-washy Marquess of Queensberry rules against those whose toxic agendas here and abroad have created the present disaster.",
    "Had President Joe Biden simply plagiarized the successful Trump agenda, there would have followed no border disaster, no energy crisis, no hyperinflation and no disastrous flight from Afghanistan.",
    "Had Biden followed through on his unity rhetoric, he could have lorded over Trumps successful record as his own, while contrasting his Uncle Joe ecumenicalism with supposed Trumps polarization.",
    "Ron DeSantis, former Secretary of State Mike Pompeo and U.S. Sen. Tom Cotton, R-Ark., are all close with or have worked for Trump and would, more or less, carry though the Trump agenda.",
    "They would claim that avoiding cul-de-sac spats while doubling down on the Trump agenda sounds nice  in the fashion that, theoretically, there could be sunshine without the sun.",
    "Given the poverty of alternatives, all sorts of names will arise, from Mike Bloomberg-like billionaires and Michelle Obama to most of those dismal 2020 primary retreads.",
    "The Trump record itself between 2017 and 2021 would be assessed more positively, especially in comparison to what preceded and followed it, and with Trump in retirement.",
    "An otherwise nihilist progressive and media agenda would reawaken solely to destroy Trump  not his policies against which the Left has offered nothing of substance.",
    "Scott Walker was acclaimed as the hands-on pro who ran a purple state, successfully battling public-employee unions and left-wing monied special interests.",
    "Victor Davis Hanson is a distinguished fellow of the Center for American Greatness and a classicist and historian at Stanfords Hoover Institution.",
    "By the sheer numbers of winning primary candidates his stamp of approval is impressive, but in a few of the most important races, not so much.",
    "His pick of a dismal Kamala Harris as vice president has likely ensured, for now, fewer viable Democratic presidential candidates in 2024.",
    "Those two believe that the Biden disaster was not due to his embrace of hard socialism, but to his insufficient embrace of socialism.",
    "Much less would he trust the ossified hierarchy of the FBI, CIA, DIA, CDC, NIH or any of the other alphabetic, deep-state soups.",
    "Former President Donald Trump has signaled he will announce his presidential intentions after the November midterm elections.",
    "Even if he manages to last another two years in office, Democratic grandees know his cognitive faculties are eroding rapidly.",
    "In the end, even if most Republicans would prefer he not run, they will likely vote for him over the hard-left alternative.",
    "The Trump base would add that a non-Trump Trump candidate would never endure, much less brawl against, left-wing madness.",
    "Thus, he was bound to pursue an extremist agenda that could only end as it now has  in disaster and record low polls.",
    "These same interests are just as terrified of Senators Bernie Sanders, I-Vt., and Elizabeth Warren, D-Mass.",
    "A clear but not overwhelming Republican win will likely discourage Trump and empower his critics.",
    "As for the Democratic landscape, it will not be the case that Joe Biden may choose to run.",
    "In addition, Trumps old and new business ventures would take further and greater hits.",
    "They read polls and know what his non compos mentis optics have done to their party.",
    "On the other hand, in 2016 the Republican field was also hailed as a dream team.",
    "Trump supporters would counter that a wiser Trump would hit the ground running.",
    "He would likely not recruit disloyal outliers or Republican Party apparatchiks.",
    "The disaster that is the Biden administration has been a godsend for Trump.",
    "Of course, serious people knew from the start that was utterly impossible.",
    "Still, how ironic that the Biden catastrophe revived a Trump candidacy.",
    "In the end, none of the above considerations will likely matter.",
    "Some logic might dictate that Trump not try a second campaign.",
    "A cognitively challenged Biden was a captive of ideologues.",
    "His family would again be targeted and unfairly maligned.",
    "The Trump MAGA legacy is now largely institutionalized.",
    "Biden likely will cause the Democrats to lose Congress.",
    "Instead, the outcome of the midterms will tell a lot.",
    "He will not run because the decision will not be his.",
    "Yet his record of endorsements is quite mixed.",
    "But a historic blowout will spur Trump.",
    "Contact him at authorvdh@gmail.com.",
    "Candidates such as Florida Gov.",
    "We know how that field ended.",
    "So will Trump run?",
    "He would be 79.",
    "Wisconsin Gov."
  ]
}