{
  "id": 9070,
  "mediaId": 65,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "Floridas Ron DeSantis smeared as authoritarian leader, next Grand Wizard of GOP by MSNBC ReidOut guests",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/df433b85-128b-4e14-ae5a-536edd2b725d/d7dd462f-5e1c-406c-af60-0b6b73ef9c49/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/media/florida-ron-desantis-smeared-authoritarian-leader-next-grand-wizard-gop-msnbc-reidout-guests",
  "sentiment": "0",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "BIDEN SAYS SECOND AMENDMENT IS 'NOT ABSOLUTE' IN CALL TO REINSTATE ASSAULT WEAPONS BAN\nThough he admitted he doesnt believe voting can work anymore in Florida, he added, \"Im not so sure that, even if the will of voters' call to end this madness thats happening in Florida, it would come to pass.",
    "Addressing her guests, Democratic strategist Fernand Amandi and MSNBC contributor Dean Obeidallah, Reid opened the segment by sharing her fears that DeSantis is \"creating essentially a Republican superstate where it doesnt matter how you vote, where its completely controlled by Republicans.\"",
    "The strategist pointed to the fact that Hungary hosted a CPAC event this year, which Orban spoke at, and asserted that \"in Ron DeSantis, they are trying to establish that type of authoritarian leader who will eventually run for President of the United States.\"",
    "LA TIMES COLUMN COMPARES INVOKING GOD AMID TEXAS SCHOOL SHOOTING TO 'FAITH THAT ALLOWED BRUTAL ENSLAVEMENT'\n\"Studies have shown that teens who are transgender, who get hormone therapy, are 40% less likely to commit suicide or a suicide attempt.",
    "Amandi, a frequent MSNBC guest, ran with her doomsday assessment of the DeSantis situation: \"Joy, you asked the most important question, because for 246 years in this country, the answer to that question  is there any way to stop this?",
    "\"Absolutely,\" Reid responded, and then turned the mic over to Obeidallah to comment on how the GOP is using Florida as a model for their plans of running the whole country.",
    "\"I think Florida is truly an authoritarian state modeled after Hungary, Orban,\" Amandi declared, naming the European countrys leader, Viktor Orban.",
    "Obeidallah then accused the GOP base of not being pro-life, \"The base  which talks about being pro-life  doesnt care about the sanctity of life.",
    "Adding to the drama of the conversation, Obeidallah stated, \"Were going to be seeing refugees from Florida seeking freedom coming to New York.",
    "\"Look, theyre making a DeSantistan,\" Obeidallah quipped, adding, \"Its going to be the worst Disney ride ever where he runs it.",
    "He has been banning books, banning Black history, banning saying the word gay, banning hormone therapy for transgender teens.",
    "Ron DeSantis, calling him an \"authoritarian leader\" and claiming he's \"being groomed to be the next Grand Wizard of the GOP.\"",
    "The MSNBC contributor concluded his rant with a swipe equating DeSantis and Republicans with the KKK, stating, \"Im worried.",
    "\"Its the idea  like Trump  the idea, lets prey on those who are vulnerable instead of helping them.\"",
    "I look at Ron DeSantis being groomed to be the next Grand Wizard of the GOP on a national level.",
    "MSNBC host Joy Reid and her guests on Friday tore into Florida Republican Gov.",
    "We should all be alarmed by what, [he's] trying to do in Florida, nationally.",
    "And youre welcome here, wed like to have you here in our state.\"",
    "Because Florida, I dont think, is a democracy anymore.\"",
    "You can stop it at the ballot box this November.\"",
    "she asked before letting her guests speak.",
    "They dont care about people in need.\"",
    "\"Is there any way to stop this?\"",
    "\"100 percent,\" Reid responded.",
    "They dont care about children.",
    "would have been, Well, yes!",
    "Its cruelty,\" he claimed.",
    "Which is just cruelty.\"",
    "I look at Florida.",
    "Very alarming.\"",
    "He doesnt care.",
    "He knows that."
  ]
}