{
  "id": 9071,
  "mediaId": 223,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "Christina Pushaw Tears Newsom Apart After He Accused DeSantis of Bullying the Special Olympics",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/25/f2dabf2d-fea4-4325-a7b4-23a423df8a3b.jpg",
  "link": "https://townhall.com/tipsheet/saraharnold/2022/06/04/poll-young-men-of-both-political-parties-think-feminism-does-more-harm-than-good-n2608227",
  "sentiment": "0",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Arnold",
  "authorUrl": "https://townhall.com/tipsheet/saraharnold/",
  "termIds": [
    661
  ],
  "sentences": [
    "(@ChristinaPushaw) June 4, 2022\nAlso, your wife is a vaccine skeptic, so maybe you should ask her how she feels about people with special needs & complex medical conditions being FORCED to take shots in order to compete in the special Olympics?",
    "Earlier this week, DeSantis announced that Florida would sue the Special Olympics for $27 million if they did not reverse their Wuhan Coronavirus vaccine mandate, to which the olympics then backed down.",
    "The only bullies here are the organizers who tried to force athletes with complex medical needs to take shots, even ignoring medical exemptions.",
    "Source: AP Photo/Phelan Ebenhack\nIts obvious when someone is a threat to the lefts agenda when they will do anything to try and take them down.",
    "https://t.co/jZcog2gRyn\n Gavin Newsom (@GavinNewsom) June 3, 2022\nHowever, DeSantis press secretary Christina Pushaw ripped Newsom a new one.",
    "Newsom also took it upon himself to throw shade at Floridas beloved governor saying Ron DeSantis values on full display: Bullying.",
    "Governor DeSantis stood up to Covidian bullying to ensure that 70 Special Olympians can compete despite not being vaccinated.",
    "Meanwhile  your Covid bullying has driven hundreds of thousands of Californians out of your state, including myself.",
    "Governor DeSantis stepped in to defend the athletes, and now were having an inclusive Special Olympics in Florida!",
    "Liberal media outlets had a field day claiming that DeSantis has reached a new low.",
    "I doubt she would stand for that, if it involved your own family?",
    "Ron DeSantis (R-Fla.) of bullying the Special Olympics.",
    "(@ChristinaPushaw) June 4, 2022\nSit this one out.",
    "Ron DeSantis values on full display: Bullying.",
    "https://t.co/DrVawwqh72\n Christina Pushaw ??",
    "Gavin Newsom (D-CA) accused Gov.",
    "(@ChristinaPushaw) June 4, 2022",
    "In the latest showdown, Gov.",
    "Christina Pushaw ??",
    "Christina Pushaw ??",
    "Olympics.",
    "Olympics.",
    "Special.",
    "Special.",
    "Wrong.",
    "The.",
    "????",
    "????",
    "????",
    "The."
  ]
}