{
  "id": 9073,
  "mediaId": 305,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "Florida Man Ron Desantis Interrupted By Gun Control Activists",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/f447e340c9bd087958e05308c620ae3b.jpg",
  "link": "https://www.theroot.com/florida-man-ron-desantis-interrupted-by-gun-control-act-1849015610",
  "sentiment": "0",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Murjani Rawls",
  "authorUrl": "https://www.theroot.com/author/murjanirawls",
  "termIds": [
    661
  ],
  "sentences": [
    "And instead of taking the opportunity to engage with the constituents, which is an obviously frustrated constituent thats worried about being gunned down in the street, he took the opportunity to bully and make fun of me.",
    "Activist Maxwell Alejandro Frost, a gun control activist running for the Democratic nomination for Floridas 10th Congressional district, asked the governor what action he would take to curb gun violence.",
    "Desantis, who last month promised to allow Floridians to carry concealed guns without a permit, was slated as the featured speaker at an event dubbed Dont Burn This Country on Thursday.",
    "As calls for gun control legislation ring louder in the aftermath of a spate of mass shootings, activists on the issue are getting boldly confronting obstructionist elected officials.",
    "Governor DeSantis, were losing 100 people a day due to gun violence, Frost can be heard telling the Republican governor in a clip the activist shared on his Twitter account.",
    "Republican officials who have been interrupted during events and press conferences have accused the activists of politicizing the deaths of victims of mass shootings.",
    "But many have grown tired of inaction and stonewalling by legislators who in many cases have accepted major financial support from the National Rifle Association.",
    "Ron Desantis was the latest Republican supporter of the gun lobby to be heckled at the podium over his refusal to support new gun legislation, Newsweek reports.",
    "Frost is then apparently escorted out by police as he continues asking for DeSantis to act on gun violence, as people in the crowd start chanting Loser, loser.",
    "In the meantime, activists and election hopefuls like Texas gubernatorial candidate Beto O Rouke have been confronting elected officials directly.",
    "Frost told Newsweek that the activists had planned action at the event after hearing that DeSantis was a guest at Rubins show.",
    "An exasperated President Joe Bidens primetime address yesterday put the spotlight on Congress to pass legislation.",
    "As Frost notes, the demonstration was planned as soon as they found out Desantis was a speaker.",
    "We werent yelling or we werent saying, Screw you to DeSantis or anything like that.",
    "And in five-minute intervals, we stood up and we walked up and we asked questions.",
    "Other activists, including Jack Petocz and Jen Cousins, also spoke at the event.",
    "Floridians are dying, Frost continues shouting over the crowds loud booing.",
    "Petocz specifically asked the governor, why dont you care about my life?",
    "We found folks who were willing to help us get inside the venue.",
    "Why are you making it easier for dangerous people to get guns?",
    "Frost continues telling DeSantis, We need to take action.",
    "Governor, we need you to take action on gun violence.",
    "We need a bill on gun violence, Frost told Newsweek.",
    "His appearance didnt go according to script.",
    "And we waited till Ron DeSantis came up.",
    "We were just simply asking to help us.",
    "We need our leadership right now.",
    "Florida Gov."
  ]
}