{
  "id": 9075,
  "mediaId": 302,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "Pinellas residents rally to save Klosterman Road parcel after DeSantis veto",
  "image": "https://www.tampabay.com/resizer//X6PxFzbWNJF0vAsLGcHVaBcsCgo=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/O7QV6I7MZNDMJOE22SIL72SJBI.JPG",
  "link": "https://www.tampabay.com/news/pinellas/2022/06/04/pinellas-residents-rally-to-save-klosterman-road-parcel-after-desantis-veto/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Adam Peters eventually was arrested at his St. Petersburg apartment around 8 p.m. on May 23, seven hours after the Tampa Bay Times emailed Gulfport Police Chief Robert Vincent and investigating officer Cory Smith asking why they had not been able to locate the son of a Pinellas County elected official for 30 days.",
    "The chief said Smith made five attempts to locate Adam Peters prior to the arrest: once by visiting his apartment the day of the alleged battery, three times by phone in early May and once by asking St. Petersburg Police to visit his home on May 17.",
    "President Tex Carter said the group will continue to work with the Pinellas Community Foundation, a public charity acting as a repository for the effort, to contact large donors who may be motivated by the sudden veto of the state funding.",
    "Prior to her election in 2018 to commission District 6, which represents mid-Pinellas and the southernmost beaches, Kathleen Peters served in the Florida House for six years and as mayor of South Pasadena from 2009 to 2012.",
    "In June 2021, after more than a year of discussions with West Klosterman Preservation Group, Pinellas County Schools entered a contract with the nonprofit to give them until July 2022 to raise $3 million to buy the land.",
    "Now members of the West Klosterman Preservation Group nonprofit have less than a month to raise $2.7 million before the owner of the 14 acres, Pinellas County Schools, potentially markets the land to developers.",
    "That day, Gulfport police issued a probable cause affidavit to arrest Peters, 28, the son of Pinellas County Commissioner and former state representative Kathleen Peters, on felony aggravated battery.",
    "On Friday, associate superintendent Clint Herbic said he needed to meet with the group next week to better understand their fundraising options before confirming whether they will be given more time.",
    "The groups goal is to combine the land with the 76-acre Mariners Point Management Area directly to the north, which is nonpublic access land Pinellas County has conserved for three decades.",
    "At around 1:45 a.m. on April 23, Adam M. Peters allegedly punched someone so hard at a Gulfport bar that the man had to have surgery to repair a broken nose and orbital socket.",
    "At the time of Adam Peters arrest, the Gulfport Police Department had one other felony probable cause affidavit that had been open for more than 30 days, according to Vincent.",
    "When a $3 million appropriation to save 14 acres from development in north Pinellas County passed the Florida Legislature unopposed earlier this year, activists were hopeful.",
    "Stone declined to release the case file citing the open investigation but said nothing in the records indicates police knew Peters relation to a county commissioner.",
    "Brooke Bennett said she was at OMaddys Bar & Grille near closing time the morning of April 23 when she was chatting with Adam Peters about a teacup chihuahua.",
    "But on Thursday, funding for the untouched forest on West Klosterman Road was among $3.1 billion in projects that DeSantis vetoed from the 2023 state budget.",
    "All the remaining habitats, the small pieces and the larger pieces, are really important and have become increasingly valuable as others are disappearing.",
    "Thats when Smith contacted the Pinellas-Pasco State Attorneys Office to schedule a meeting to request a warrant for Adam Peters arrest, Stone said.",
    "Harris said he watched Peters unwanted advances on Bennett and then his argument with Jaworski, so he decided to try to break up the fight.",
    "The School Board first put the land on the market in early 2020 and promptly got four offers from housing developers topping $3.3 million.",
    "Harris underwent surgery at Bayfront Health St. Petersburg on his broken nose and had a titanium rod placed in his left orbital socket.",
    "Read inspiring stories about ordinary lives\nEcologist Don Richardson has called the land an imperiled ecoregion of global importance.",
    "Pinellas County and Dunedin contributed the remaining $5.5 million needed to buy the land from the estate of the late Gladys Douglas.",
    "Harris said he called Smith twice over the next two weeks for an update and was baffled about why Adam Peters had not been arrested.",
    "In a text message to the Times, the commissioner said she had no contact with Gulfport police about the incident involving her son.",
    "Read inspiring stories about ordinary lives\nPeters and Jaworski began arguing and moved to a sidewalk outside, Bennett said.",
    "The insinuation that there was potentially foul play is not only offensive to my family, but to law enforcement, she said.",
    "Pinellas County officials have agreed to assume ownership of the 14 acres if the nonprofit is successful in its purchase.",
    "When one month passed with no arrest, the alleged victim, Kyle Harris, 37, wondered if hed ever get accountability.",
    "But the Carters said the potential for the state appropriation may have resulted in some complacency among donors.",
    "The nonprofit had raised $475,000 as of Friday through direct donor outreach, fundraisers and an online campaign.",
    "Surveillance video captured Peters striking Harris with a closed right fist, according to the arrest affidavit.",
    "Vincent said the department did not know Peters was the son of a county commissioner before the Times inquiry.",
    "Last year, residents raised $4.5 million in private donations to save 44 acres near Dunedin from development.",
    "At a fundraiser for the property in May, Latvala told the crowd he expected the money to come through.",
    "Bennett and Jaworski said they saw Peters punch Harris once in the head, sending him to the ground.",
    "I feel like its an awfully strange coincidence that hes been given all this accommodation, he said.",
    "The 14-acre parcel is some of the last 1 percent of the original scrub left in Pinellas County.",
    "He said they were looking for the suspect and the charge would be felony aggravated battery.",
    "He said Smith was on vacation the week after the incident, which caused an initial delay.",
    "Pinellas County has very, very few undisturbed habitats still in existence, Carter said.",
    "He said hes been unable to work his automotive services technician job as he recovers.",
    "The officer also contacted St. Petersburg Police to attempt to locate Peters, he said.",
    "It made him wonder whether the relationship had to do with why his case had stalled.",
    "It has more than 60 threatened or endangered plant and animal species living there.",
    "The West Klosterman group had hoped their cause would prompt a similar insurgence.",
    "After the Times inquiry on May 23, Stone said he spoke with Smith for an update.",
    "In mid-May, Harris said he learned Peters was the son of a county commissioner.",
    "Harris said Smith, the investigating officer, called him the night of April 23.",
    "By then her boyfriend, Tyler Jaworski, saw what was happening and walked over.",
    "The officer told him he was planning to make more steps to locate this person.",
    "Were going to put all effort into getting it done, treasurer Kay Carter said.",
    "When Peters touched her arm, Bennett said she told him she had a boyfriend.",
    "Harris, of St. Petersburg, is facing $10,000 in medical bills so far.",
    "Ron DeSantis, sponsored the appropriations bill in the House.",
    "Weve got to pull out all the stops and work to the very end.",
    "We dont care who hes related to, said Gulfport Police Cmdr.",
    "Then Peters began to grab her by the waist, Bennett said.",
    "State Rep. Chris Latvala, R-Clearwater, a booster of Gov.",
    "We want to know the victim in a case gets justice.",
    "The site is too precious to let it be bulldozed.",
    "Now, they say, the need is greater than ever.",
    "These things dont get solved in half an hour.",
    "We just feel like it needs to not fail.",
    "The fights not over, Kay Carter said.",
    "Peters was arrested hours later.",
    "But its not like TV.",
    "Joshua Stone."
  ]
}