{
  "id": 9076,
  "mediaId": 233,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "Pride Month events, Queen's Platinum Jubilee, French Open finals: 5 things to know this weekend",
  "image": "https://www.gannett-cdn.com/presto/2022/04/15/USAT/19c009e0-31e4-44ac-8daf-593fb8519edb-AP_Florida_Daily_Life_2.jpg?crop=5999,3375,x0,y400&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/2022/06/04/pride-month-queens-platinum-jubilee-5-things-know-weekend/7470898001/",
  "sentiment": "0",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Editors",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "The change was announced Thursday after the Florida health department notified the Special Olympics that it would be fined $27.5 million for 5,500 violations of state law for requiring proof of coronavirus vaccination for attendees or participants if it kept the mandate in place.",
    "Check out the 5 Things podcast:\nUkraine's national soccer team clinches World Cup spot with a win\nThe Ukraine soccer team's players feel a duty to represent their nation's identity on a global stage and give pride to people back home during Russia's war on their homeland.",
    "Ukraine's players have been encouraged by messages from those fighting the war back home, which have included President Volodymyr Zelenskyy, who posted thanks to the team on social media for \"two hours of happiness\" after their win over Scotland.",
    "Sunday will include the \"Big Jubilee Lunches\" and a pageant called \"The River of Hope\" which will see 200 silk flags, designed by students, flying along The Mall  the street which connects Buckingham Palace to Trafalgar Square.",
    "Friday marked the first public appearance of Prince Harry and Meghan, the Duchess of Sussex, in festivities marking the monarch's 70 years on the throne as they attended the service of thanksgiving at St. Paul's Cathedral.",
    "2022 Special Olympics USA Games lifts vaccine mandate ahead of opening\nThe 2022 Special Olympics USA Games begin Sunday in Orlando, Florida, and competitors will no longer need a COVID-19 vaccine to participate.",
    "Provincetown, Massachusetts, known for decades as a city friendly to the LGBTQ community, holds its annual downtown Pride Rally on Saturday, followed by the Feet Over Front Street 5K event on Sunday.",
    "USA TODAY\nPride Month celebrations kick off across the US\nJune is Pride Month, a celebration of the history and visibility of the LGBTQ community that millions of Americans identify as part of.",
    "Ukraine's unlikely but morale-boosting quest to qualify for the World Cup in Qatar later this year continues Sunday when it takes on Wales in Cardiff, Wales' capital and its largest city.",
    "Queen Elizabeth II's Platinum Jubilee celebrations continue\nQueen Elizabeth II's Platinum Jubilee celebration continues this weekend with more glamorous events and even more fanfare.",
    "\"We do not think it's fair or just to be marginalizing some of these athletes based on a decision that has no bearing on their ability to compete with honor or integrity.\"",
    "The Spaniard advanced to the final Friday after his semifinal opponent, third-seeded Alexander Zverev, had to concede due to a leg injury suffered during the match.",
    "Following her semifinal win, Gauff had a message about the recent series of mass shootings in her home country, writing in marker on a courtside TV camera: \"Peace.",
    "A victory over Wales would give Ukraine a spot in the tournament for just the second time ever and put it in Group B with the United States, England and Iran.",
    "On Saturday, a concert dubbed the \"Platinum Party at the Palace\" featuring the \"world's biggest entertainment stars\" will be held at Buckingham Palace.",
    "Delegates who were registered for the games but not able to compete because of the prior vaccine requirement, are now allowed to attend.",
    "On the men's side, Rafael Nadal, 36, will try to extend his overall Grand Slam and French Open title records when he takes on No.",
    "Ukraine got here after convincingly beating Scotland 3-1 in the World Cup qualifying playoffs on Wednesday in Glasgow.",
    "Philadelphia, the City of Brotherly Love, is celebrating the 50th anniversary of the city's first Gay Pride Day.",
    "Gauff, who turned 18 in March, is the youngest finalist at the clay-court major tennis tournament since 2001.",
    "Nadal has won 21 Grand Slam singles titles with 13 coming in Paris, the most by any man in tennis history.",
    "The lineup includes Elton John, Lin-Manuel Miranda, Alicia Keys and Diana Ross, among other major stars.",
    "This first weekend marks the start of Pride parades and educational events in cities across the country.",
    "Meanwhile, Poland's Swiatek is riding a 34-match winning streak, the second-longest this century.",
    "The palace previously announced she would skip the service due to difficulties getting around.",
    "(Many will enjoy the events in person for the first time in two years due to the pandemic.)",
    "Eyes were even more on the couple since the queen did not attend Friday's event.",
    "Pride events will continue in cities nationwide throughout the month.",
    "The Special Olympics USA games will run for one week, until June 12.",
    "1 Iga Swiatek in the French Open women's final Saturday (9 a.m.",
    "\"In Florida, we want all of them to be able to compete,\" Gov.",
    "Ron DeSantis said at a news conference in Orlando on Friday.",
    "Ukraine's first match would be against the U.S. on Nov. 21.",
    "8 seed Casper Ruud of Norway in the final on Sunday (9 a.m.",
    "French Open finals: Coco Gauff goes for No.",
    "14\nAmerican Coco Gauff will face world No.",
    "Their mission has been fulfilled so far.",
    "Contributing: The Associated Press",
    "1 while Nadal tries for No.",
    "ET, NBC and Peacock).",
    "ET, NBC and Peacock).",
    "End gun violence.\"",
    "Prefer to listen?"
  ]
}