{
  "id": 9083,
  "mediaId": 136,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "DeSantis Being Special Olympics Co-Chair Didn't Stop Threat of $27.5M Fine",
  "image": "https://d.newsweek.com/en/full/2051536/desantis-threatened-fine-special-olympics.webp?w=790&f=f9908a072a5fa68d162ea47c8c9ea1ff",
  "link": "https://www.newsweek.com/desantis-being-special-olympics-co-chair-didnt-stop-threat-275m-fine-1712705",
  "sentiment": "0",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Xander Landen",
  "authorUrl": "https://www.newsweek.com/authors/xander-landen",
  "termIds": [
    661
  ],
  "sentences": [
    "In a statement to Newsweek, a spokesperson for the Special Olympics said: \"Special Olympics, Inc. (SOI) announced on June 2, 2022, that it is lifting the vaccine requirement for delegation members attending the 2022 Special Olympics USA Games being held in Orlando, Florida, June 5-12, as required by state of Florida officials on May 27, based upon the Florida Department of Health's interpretation of Florida law.\"",
    "\"This was a big long-term goal for me and being told that I was able to go in February, and then come just a couple months ago and being told no, and being threatened with email after email that I would have to prove vaccination to go,\" Vernoia said, adding that he wanted to thank Florida officials \"for fighting and standing up for us.\"",
    "In 2021, DeSantis, who has consistently opposed vaccine mandates, issued an executive order and signed legislation prohibiting businesses and government entities from requiring proof of COVID-19 vaccination in Florida.",
    "ABC News reporter Jay O'Brien first reported on Twitter Friday that Florida had assessed the fine against the Special Olympics for requiring proof of vaccination at the Games in Orlando, which begin this weekend.",
    "SOI, Special Olympics North America, and the 2022 Special Olympics USA Games Local Organizing Committee are making best efforts to accommodate eligible individuals,\" the spokesperson added.",
    "The Special Olympics scrapped a COVID-19 vaccine requirement after the administration of Florida Governor Ron DeSantis threatened a $27.5 million fine against the organization this week.",
    "\"To go after Special Olympians, who all they wanted to do is compete, was not consistent with Florida law, and it's not the right thing to dolet them compete,\" DeSantis said.",
    "The letter from the Florida Department of Health said it found the Special Olympics required 5,500 people to provide proof of COVID vaccination to gain access to the Games.",
    "\"Delegates who were registered for the Games but were unable to participate due to the prior vaccine requirement, now have the option to attend.",
    "On Twitter, Brian Cheek, father of a Special Olympian, criticized the decision: \"My son, a special needs Special Olympian, cannot catch covid.",
    "The Florida governor addressed the vaccine mandate, and the Special Olympics' decision to drop it during a Friday press conference.",
    "Frank Vernoia, Special Olympian golfer who spoke during DeSantis' press conference, applauded the decision to drop the mandate.",
    "O'Brien also tweeted out a notice from the Special Olympics on Thursday, stating that it had dropped its vaccine requirement.",
    "O'Brien tweeted out a letter that the state sent the Special Olympics on Thursday, noting the fine had been assessed.",
    "A spokesperson for DeSantis referred Newsweek to the governor's comments at the press conference on Friday.",
    "The threat came despite DeSantis' role as an honorary co-chair of this year's Special Olympics.",
    "This is very disappointing that the Special Olympics do not care for their athlete's health.\"",
    "The decision to drop the mandate was met with mixed responses.",
    "He is triple vaxxed.",
    "It will kill him."
  ]
}