{
  "id": 9090,
  "mediaId": 302,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "DeSantis teaching the Rays a lesson? Thats fake politics.",
  "image": "https://www.tampabay.com/resizer//03P0ToMohr4QwQ64hL4BHFvX9Pw=/900x506/smart/filters:format(webP)/cloudfront-us-east-1.images.arcpublishing.com/tbt/X3HFP22RY5EB7OSYSIGVXCWTWU.JPG",
  "link": "https://www.tampabay.com/sports/rays/2022/06/03/desantis-teaching-the-rays-a-lesson-thats-fake-politics/",
  "sentiment": "0",
  "mediaOutlet": "Tampa Bay Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    661
  ],
  "sentences": [
    "Floridas Republican-controlled Legislature has ceded all kinds of power to DeSantis in recent years  including the responsibility for redrawing congressional maps  and this week lawmakers bent over and took another whack on the rear when their local projects got vaporized to pad the governors resume.",
    "Yet by opening the door to the possibility that the Rays were facing retribution for taking a stance  if grieving for a classroom filled with dead children is considered controversial  you could argue the governor is the one who is interjecting politics into state business.",
    "This was almost entirely a Simpson design, originating first as a workout-only complex during the Montreal/Ybor City plan and then becoming a larger stadium-sized project when Major League Baseball killed the Rays sister-city concept.",
    "And if thats what the governor considers political activism, then he might want to check the list of corporations that have donated millions to his re-election campaign, because its the exact same thing.",
    "This could have been a pivotal moment for growth around here with two of the Legislatures most powerful members  Senate President Wilton Simpson and House Speaker Chris Sprowls  calling Tampa Bay home.",
    "Everything DeSantis does is with an eye toward how it will play to the conservative base around the nation, and he was thrilled to get a budget that allowed him to announce $3.1 billion in vetoes.",
    "By suggesting the Rays were at fault for this doomed project, DeSantis is also suggesting he is allowing his personal feelings dictate whether Pasco County gets a transformative economic boost.",
    "Except the governor took the opportunity to swipe at the political activism of private corporations, giving a wink-wink, nudge-nudge hint that maybe the Rays brought this on themselves.",
    "You can agree or disagree with his philosophy, but he has been very consistent on the topic and has plenty of economic impact studies to support his views.",
    "There are valid reasons to tell franchises to come up with their own construction costs, and as I said earlier, DeSantis has been consistent on that point.",
    "Sign up for the Rays Report weekly newsletter to get fresh perspectives on the Tampa Bay Rays and the rest of the majors from sports columnist John Romano.",
    "The complaint is with the attempt to score political points by portraying the team as a liberal pariah that got its comeuppance from the governors office.",
    "DeSantis has made no secret that he is not a supporter of public money going toward the construction of major-league sports facilities.",
    "I dont support giving taxpayer dollars to professional sports stadiums, period, DeSantis said at a news conference Friday.",
    "The closest the team got to actual political activism was donating $50,000 to a nonprofit that advocates for gun control.",
    "Ron DeSantis vetoed a $35 million budget item for a youth sports/spring training complex for the Rays in Pasco County.",
    "Instead, it suggested the amount of gun violence in this country was unacceptable and needed to be addressed somehow.",
    "The statement did not criticize elected officials, political parties, gun manufacturers or the Second Amendment.",
    "I think the spring facility was doomed from the start, as were a lot of other items in the state budget.",
    "John Romano | There were legitimate reasons to axe a proposed spring training complex in Pasco County.",
    "You see, a week ago, the Rays issued a statement to lament the tragedies of Buffalo and Uvalde.",
    "Never miss out on the latest with the Bucs, Rays, Lightning, Florida college sports and more.",
    "Instead, major projects at USF and Moffitt Cancer Center, and proposed new roads were lost.",
    "The demise of a potential Rays spring training complex in Pasco County is no ordinary tale.",
    "It became nominally tied to a tragedy and is now inextricably linked to a national debate.",
    "So, at the end of the day, that was just a decision that was going to be made.",
    "Certainly not enough to get The Washington Post, CNN and Fox News interested.",
    "Thats a surefire talking point in future stump speeches and campaign debates.",
    "Instead, it was wiped out in a matter of seconds by the governors pen.",
    "It would have been a signature site in a growing area of the county.",
    "Is that really how $35 million decisions should be made in Florida?",
    "You could argue, however, its mostly about the ambition of one man.",
    "The supposed political activism of the Rays was not one of them.",
    "Follow our Tampa Bay Times sports team on Twitter and Facebook.",
    "And least of all, the proposed Rays spring training complex.",
    "It involves politics and behind-the-scenes maneuvering.",
    "John Romano can be reached at jromano@tampabay.com.",
    "By itself, this should not have been a big deal.",
    "And that should have been the end of the story.",
    "Personally, I dont think thats what happened.",
    "Nor did it push for specific legislation.",
    "Im not here to criticize that decision.",
    "Its about money, power and perception.",
    "Thats neither accurate nor admirable.",
    "Its just a politicians ambition.",
    "To set the stage, Florida Gov.",
    "Follow @romano_tbtimes."
  ]
}