{
  "id": 9092,
  "mediaId": 19,
  "date": "6/4/2022 12:00:00 AM",
  "headline": "DeSantis Prioritizes School Safety in Wake of Bidens Anti-Second Amendment Push",
  "image": "https://media.breitbart.com/media/2021/06/ron-desantis-6-14-21-getty-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/06/04/desantis-prioritizes-school-safety-wake-bidens-anti-second-amendment-push/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Hannah Bleau",
  "authorUrl": "https://www.breitbart.com/author/hannah-bleau/",
  "termIds": [
    661
  ],
  "sentences": [
    "I think if you look at these four budget years since Ive been governor, I think were pretty close to three quarters of a billion dollars with school safety initiatives, and thats something very significant, he said, explaining that mental health is also a top priority that needs to be addressed:\nYou also have the issue of mental health and you know, my wife is very good on this and you know, she will always tell me, you know, you have some deranged lunatic that is not necessarily what we mean by mental health.",
    "If you look at our budget  we had another major increase in funding for school safety and for mental health and, you know, when youre talking about school security, the thing is, is for whatever reason  I think going back to Columbine  this has become something where these deranged psychopaths have certain targets and some of them go to schools as a way to kind of maximize the trauma to a community, DeSantis said during Fridays press conference.",
    "And so weve done things like, since Ive been governor, behavioral threat assessment so that if somebodys in school, theyre online posting that theyre going to do some really bad stuff, that you take it seriously, that you understand that there may be people who are going to act against the best interests of the community and that youre not just kind of hope nothing happens, that youd be more aggressive on it.",
    "You know, its not like everyone that needs mental health services is a would-be school assassin, thats not true and I dont want to lump them in together, but I also do think some of these people have so many warning signs and it just gets ignored time and time again.",
    "Im gonna be signing a bill probably within the next week thats going to continue on with the commission, and make some additional improvements, he said, adding that they are gonna figure out for  definitively what happened with this response or not response.",
    "And thats the thing, you could have the best security in the world, but if you dont have folks that, that are out there when it really counts  and which very well may have happened in Texas  then  its not going to amount to much, he said.",
    "DeSantis said one the Parkland families was particularly frustrated that there was not an adequate effort to rescue their kids and that the shooter didnt meet the quick resistance that he should have met.",
    "The governor explained that these very evil people often look for soft targets where they think theyre going to be able to get away with it, using the Buffalo shooter as a prime example.",
    "WATCH:\nHis remarks follow President Bidens primetime gun control address on Thursday, where he called for national red flags laws, an assault weapons ban, gun storage laws, and more.",
    "What I think weve done in Florida since Ive been governor is make sure theres adequate security at schools, make sure that we follow the recommendations of the Parkland Commission.",
    "Maybe there could have been interventions, but you know, we talk about mental health and the schools  a lot of these are just normal kids that are going through difficult times.",
    "I just think as a parent of young kids, thats something thats very sensitive to me and to my wife, and Im happy to say in Florida, weve put our money where our mouth is.",
    "The administration of Florida Governor Ron DeSantis is prioritizing school safety in the wake of national tragedies and the lefts anti-Second Amendment push.",
    "Ron DeSantis (R) on Thursday signed the states Freedom First Budget, which includes an increase in funding for school safety and mental health initiatives.",
    "While DeSantis made it clear he is a strong supporter of law enforcement, he said it is essential to hold them accountable in these situations as well.",
    "Both are significant, as a plurality of voters blame mental health issues for mass shootings, while far-left Democrats continue to focus on guns.",
    "And so when I came in, we decided to do something about that, he said, detailing the actions taken to remove the sheriff of Broward County.",
    "I believe the majority of you will act to turn your outrage, to turn this issue central to your vote, Biden said.",
    "The Parkland shooter clearly was somebody that was a big-time problem in terms of how he was behaving.",
    "You had a lot of folks, that could have been held responsible, and nobody had been held responsible.",
    "And so what we did with Parkland was say, were going to hold law enforcement accountable as well.",
    "Were going to continue to be very strong in terms of our school safety, the governor promised.",
    "Yeah, they probably have some mental problems for sure.",
    "Enough!",
    "Enough!",
    "Enough!",
    "Gov."
  ]
}