{
  "id": 1055,
  "mediaId": 881,
  "date": "3/29/2022 12:00:00 AM",
  "headline": "Former President Donald Trump began the 2022 midterm elections with a flurry of endorsements, seeking to keep his iron grip on the GOP by elevating sycophants and scaring Republicans who might criticize his 2020 election lies into keeping their mouths shut.",
  "image": "https://video-images.vice.com/articles/62430c035f68570095a7e4aa/lede/1648561209818-trumprepublicans2022.png?crop=1xw:0.8473xh;0xw,0.0329xh&resize=20:*",
  "link": "https://www.vice.com/en_us/article/epx784/trump-republicans-struggle",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1636,
    1646,
    2087,
    2095,
    2303,
    2475,
    428
  ],
  "sentences": [
    "But he struggled to gain momentum early on in spite of Trump's endorsementand hurt himself and infuriated Trump when he changed his tune and started pushing for GOP voters to move on from 2020.\nMo Brooks of Alabama made a horrible mistake recently when he went woke' and stated, referring to the 2020 Presidential Election Scam, Put that behind you, put that behind you,' despite the fact that the election was rife with fraud and irregularities.",
    "It's reflective of what we've seen in the presidential primary polls: He's still the favorite, but he's no longer a lock.?\nBy signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "While his candidates didn't always win primariesAlabama Republicans rejected Trump-backed appointed Alabama Sen. Luther Strange for Roy Moore in 2017, and North Carolina Rep. Madison Cawthorn beat a Trump-backed candidate in 2020his overall record was almost spotless when he was in the White House.",
    "In other places, competent candidates like Perdue are finding that just focusing on 2020 isn't enough to win a primaryespecially with voters worried about pocketbook issues like inflation and new culture war hot-button topics pushed on the right like Critical Race Theory.",
    "Former President Donald Trump began the 2022 midterm elections with a flurry of endorsements, seeking to keep his iron grip on the GOP by elevating sycophants and scaring Republicans who might criticize his 2020 election lies into keeping their mouths shut.",
    "Trump spent his Saturday night in Georgia, trying to gin up support for a slate of challengers he's backing against the state's elected Republican officialsa list headlined by former Sen. David Perdue, who's taking on Gov.",
    "Trump un-endorsed Alabama Rep. Mo Brooks' Senate campaign last Wednesday, pulling his support from the first congressman who'd endorsed his plans to stop Congress from certifying President Biden's election win on Jan. 6.",
    "And while Trump's overall standing with Republican voters has slipped a bit since he left office, he remains the prohibitive frontrunner for the 2024 GOP nomination should he run again, according to recent polling.",
    "Idaho Republican Party Chairman Tom Luna told VICE News that Trump's endorsement can be a game-changer? and helped McGeachinbut said ultimately there are other factors? that determine whether a candidate will win.",
    "And as the 2020 election recedes, Trump-backed candidates fixated solely on his election lies and demands that he be put back in office seem to be increasingly struggling to gain traction in Republican primaries.",
    "Tennessee Republicans are pushing a bill that would bar candidates from running for Congress if they just moved into the statean effort squarely targeted at blocking Trump-backed House candidate Morgan Ortagus.",
    "In West Virginia, Trump-backed Rep. Alex Mooney is in a dogfight against Rep. David McKinley, who was among the few House Republicans who voted to create a bipartisan committee to investigate the Jan. 6 riots.",
    "Georgia Republicans expect Trump-backed Rep. Jody Hice will beat Secretary of State Brad Raffensperger, and Trump's endorsement helped clear the Georgia Senate field for Herschel Walker, for instance.",
    "While Trump's support remains helpful in a Republican primary, candidates still need to run a functional campaign focused on the issues voters actually care about to win.",
    "Trump backed Sean Parnell for Senate in Pennsylvania last year, only to see Parnell drop out of the race after his wife accused him of abusing her and their children.",
    "The longtime Trump ally and former campaign surrogate said he'll be with Trump if he runs again in 2024but is backing Kemp over Perdue in spite of Trump's wishes.",
    "Janice McGeachin, a candidate with militia ties and a penchant for extremist statements, gave her a surge of attention in her campaign against Republican Gov.",
    "Pat McCrory has hung in against Trump's endorsed candidate, Rep. Ted Budd, even though McCrory rejected Trump's claim the 2020 election was stolen from him.",
    "Alaska Republican Sen. Lisa Murkowski voted to impeach Trump after Jan. 6, but she appears to have the upper hand over Trump-backed Kelly Tshibaka.",
    "But it's no guaranteeand its potency seems to be waning the longer Trump is out of office, a sign that his grip on the party is slipping over time.",
    "I don't think the majority of Republicans are going to vote for any candidate just because President Trump or anybody endorses somebody,? he said.",
    "But she's failed to capitalize, plagued by a series of major missteps, including a speech to a white supremacist conference earlier this month.",
    "Trump's endorsement remains unquestionably helpful, however, and Republicans who dare publicly criticize him haven't done nearly as well.",
    "But from Georgia to Idaho, Alabama to North Carolina, Trump-backed candidates are showing the limits his endorsements offer.",
    "If we forget, the Radical Left Democrats will continue to Cheat and Steal Elections,? Trump said in a statement last week.",
    "In some races, Trump has simply backed weak candidates, fringe figures who even hardcore Trump fans aren't so sure about.",
    "The poll results show that there's a waning power of the Trump endorsement,? said Republican pollster Patrick Ruffini.",
    "Trump has endorsed more than 120 candidates ahead of the 2022 elections, and most will likely win their primaries.",
    "But the size of the crowd was paltry compared to some of Trump's earlier rallies, according to local reporters.",
    "Plain and simple, people have moved on,? former Georgia Republican Rep. Jack Kingston told VICE News on Monday.",
    "It's still valuable, but it's a diminishing asset the further and further we get from the Trump presidency.",
    "Perdue doubled down on Trump's election lies on Saturday, one of many candidates who fixated on the past.",
    "Trump's other endorsement against a sitting Republican governor doesn't look like it'll pan out, either.",
    "Public and private polls show that Trump's endorsement does indeed give GOP candidates a primary boost.",
    "But his endorsement track record is a far cry from what things looked like when Trump was president.",
    "Other candidates Trump had endorsed are seeing his support doesn't guarantee them the nomination.",
    "And a Trump-backed candidate lost a special election for Congress in Texas last spring as well.",
    "When you're paying $5 a gallon for gas, nobody wants to talk about 2020,? Kingston warned.",
    "Perdue trails Kemp by a double-digit margin in recent polls ahead of their May primary.",
    "But most are incumbents who would have sailed to reelection with or without his help.",
    "In the state of Georgia, thanks to Brian Kemp, our elections were absolutely stolen.",
    "And a number of challengers he's backed in other states aren't faring much better.",
    "Brooks spoke at Trump's rally that preceded the Capitol riot that day.",
    "Little has a wide lead over McGeachin in private polling of the race.",
    "And the percentages won't look too bad this year either.",
    "Two factors are likely contributing to this dynamic.",
    "His endorsement of Idaho Republican Lt. Gov.",
    "In North Carolina, former Republican Gov.",
    "He sold us out,? Perdue said onstage.",
    "It seemed to workfor a while.",
    "Brad Little.",
    "Brian Kemp."
  ]
}