{
  "id": 149,
  "mediaId": 147,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "GOP's McCarthy and Greene are confronted by their own words after Jan. 6",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/assets/images/placeholder.jpg",
  "link": "https://www.pbs.org/newshour/show/gops-mccarthy-and-greene-are-confronted-by-their-own-words-after-jan-6",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lisa Desjardins",
  "authorUrl": "https://www.pbs.org/newshour/author/lisa-desjardins",
  "termIds": [
    1147,
    1147,
    1039,
    1039,
    652,
    652,
    1609,
    1609,
    1668,
    1668,
    1248,
    1311,
    1311,
    1212,
    1212,
    1248,
    2325,
    2325,
    428,
    428
  ],
  "sentences": [
    "Amy Steigerwalt:\nThis is an administrative law judge who is hearing all the evidence, will then make a determination and a recommendation to the secretary of state, Brad Raffensperger, who is also facing his own reelection and a very strong primary challenge and, to be perfectly blunt, needs many of the same voters who would potentially be voting for Representative Greene in her election to also support him, so that he can continue to be secretary of state.",
    "And they're relying on a clause in the 14th Amendment to the Constitution that says: \"No person shall be a senator or representative in Congress who, having previously taken an oath as a member of Congress, shall have engaged in insurrection or rebellion or given aid or comfort to the enemies thereof.\"",
    "And it shows you something important here, which is that President Trump, as he was holding on to power, there were others that were also part of this idea of election fraud looking it for everywhere they could, even though there was no evidence.",
    "Amna Nawaz:\nIn related January 6 news, facing a challenge to her candidacy for reelection, Georgia Republican Congresswoman Marjorie Taylor Greene took the stand today in an Atlanta courtroom to say she did not participate in the insurrection.",
    "Read the Full Transcript\nAmna Nawaz:\nWell, new audio reveals that House Republican Leader Kevin McCarthy told Republican colleagues he would urge President Trump to resign in the days following the January 6 attacks on the Capitol.",
    "Rep. Marjorie Taylor Greene:\nI was asking people to come for a peaceful march, which is what everyone is entitled to do under their First Amendment, but I was not asking them to actively engage in violence or any type of action.",
    "And I think this also tells us something about Republicans and the fact that President Trump really is still driving the train and deciding the future of even potential speakers of the House like Kevin McCarthy.",
    "They point to comments like this that Greene made the night before the insurrection:\nRep. Marjorie Taylor Greene:\nWe're going to send our favorite president right back where he belongs, in the White House!",
    "Lisa Desjardins:\nWell, first of all, this is the exact opposite of what Kevin McCarthy's own spokesperson said just yesterday, said he never said he would ask the president, President Trump, to resign.",
    "But one of these texts on January 3, he wrote: \"I know this will end badly for the president unless we have the Constitution on our side and unless states submit new slates of Trump electors.\"",
    "Rep. Marjorie Taylor Greene, facing disqualification from running for reelection over alleged support for the insurrection, was forced to confront her own incendiary remarks in court.",
    "Kevin McCarthy, on January 13, went to the House floor and said that the president, President Trump, was responsible, but just a couple of weeks later, where did he go?",
    "Leaked audio refuted House Minority Leader Kevin McCarthy's claim that he never considered asking President Trump to resign after the Jan. 6 insurrection.",
    "There was this moment where Republican leaders were wondering and talking about maybe pushing President Trump out of leadership for good, and it passed.",
    "(CHEERING AND APPLAUSE)\nGeoff Bennett:\nA similar challenge to North Carolina Republican Madison Cawthorn was blocked by a federal judge last month.",
    "And talking to sources today, I don't think there is going to be a political problem for Kevin McCarthy because of this within his own party.",
    "Amna, that idea is about having separate slates of electors that might run counter to what the popular vote in the states were at the time.",
    "Even if they can't convene, it might be enough for a majority of state legislators to sign a statement indicating how they would vote.\"",
    "We don't know if Kevin McCarthy actually ever did ask him to resign or if he just told that to the Republican leadership there.",
    "And the readout from that reported by others  and I have one source on this  is that President Trump is OK with what he heard.",
    "And his team says he ended up not finding evidence, he was really looking for it, but he never found it, and he backed down.",
    "Geoff Bennett:\nA group of Georgia voters and the organization Free Speech for People filed the legal challenge last month.",
    "He wrote to Mark Meadows, the chief of staff to President Trump: \"I have been calling state legislators for hours today.",
    "But I want to talk about something broader, what this reveals and what this means sort of on a more pervasive level.",
    "When I talk to Republican sources, they were waiting to see what the president, the former president would do.",
    "Another thing benefiting Kevin McCarthy is he is now the top fund-raiser ever in the House Republican ranks.",
    "But those have included some texts from lawmakers, including people like Republican Senator Mike Lee, right?",
    "But in a 73-page ruling earlier this week, a different judge in Georgia cleared the way for today's hearing.",
    "It was uncovered by two New York Times journalists, we should mention, Alex Burns and Jonathan Martin.",
    "The outcome could be felt beyond Georgia, since other Republican officials face similar challenges.",
    "Geoff Bennett:\nElection officials in Georgia can begin mailing absentee ballots on Monday.",
    "We have been seeing many more details about January 6 coming out in different reports.",
    "To sort through all of this, I'm joined by our Capitol Hill reporter, Lisa Desjardins.",
    "Amna Nawaz:\nLisa, you have been talking with Republican sources, including lawmakers.",
    "She says voters should decide when whether she gets a second term, not the courts.",
    "And talking to Senator Lee's office, they have not said that these are incorrect.",
    "Again, the only discussion I would have with him is that I think this will pass.",
    "Somehow, Kevin McCarthy was able to convince him: I'm still on board with you.",
    "Amna Nawaz:\nSo, the audio we are talking about, it is a private conversation.",
    "Donald Trump, Former President of the United States: Don't mess with her.",
    "I can report that he and Kevin McCarthy spoke at least twice yesterday.",
    "But, here, I want to read a couple of them, what the senator was doing.",
    "Behind the scenes, that push was happening for many political reasons.",
    "You  we have  we should note this is all in the days after January 6.",
    "I'm seriously thinking of having that conversation with him tonight.",
    "Geoff Bennett:\nAnd urging her supporters to fight for Donald Trump.",
    "With Greene on the stand today, the clock is ticking for a ruling.",
    "But what  what I think I'm going to do is, I'm going to call him.",
    "From what I know of him  I mean you guys know all know him, too.",
    "Ultimately, Senator Lee did not vote to object to the election.",
    "He raised more than $30 million just in the last three months.",
    "They say Greene should not be eligible to run for reelection.",
    "But this is different than what we heard from in the public.",
    "It is a conversation between Kevin McCarthy and Liz Cheney.",
    "I'm trying to figure out a path I can persuasively defend.",
    "And Senator Mike Lee was kind of walking both sides there.",
    "But I will tell you, there's a couple of layers to this.",
    "What are they telling you about this and what it means?",
    "And it will be my recommendation you should resign.",
    "You have been following it all, continue to do so.",
    "He says he was looking for rationale and evidence.",
    "And that  this is what we're learning from these.",
    "This shows what was going on behind the scenes.",
    "Is there any reason to think that might happen?",
    "Lisa Desjardins:\nI've had a few discussions.",
    "I haven't talked to him in a couple of days.",
    "Let's just take a listen to what they said.",
    "These are texts that were obtained by CNN.",
    "For the \"PBS NewsHour,\" I'm Geoff Bennett.",
    "Lisa Desjardins and Geoff Bennett report.",
    "Rep. Liz Cheney (R-WY) : Yes, I'm here.",
    "Mar-a-Lago, to talk to President Trump.",
    "They're talking about President Trump.",
    "Are you hearing that he might resign?",
    "Do you think he would ever back away?",
    "But I don't think he would take it.",
    "Amna Nawaz:\nThat is so interesting.",
    "Going to spend hours more doing it.",
    "You have been following them all.",
    "What can you tell us about this?",
    "They have tried to explain them.",
    "Lisa Desjardins, thanks so much.",
    "Rep. Kevin McCarthy (R-CA):\nLiz?",
    "I mean, that would be my take.",
    "So that helps him politically.",
    "Geoff Bennett has our report.",
    "The first is the political.",
    "Let's look at another text.",
    "That conversation unfolded.",
    "Such an important story.",
    "Lisa Desjardins:\nRight.",
    "Amna Nawaz:\n in public.",
    "Lisa, good to see you.",
    "What should we know?",
    "Don't mess with her.",
    "My gut tells me no.",
    "But I don't know.",
    "You on the phone?",
    "President Trump.",
    "Thanks, Kevin.",
    "Why?"
  ]
}