{
  "id": 1910,
  "mediaId": 238,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "The Trailer: The pandemic planner, the crypto billionaire and a bunch of angry Democrats",
  "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://palomaimages.washingtonpost.com/prod/ScreenShot2022-04-26at1.30.36PM_tstmp_1651000960.png&w=916",
  "link": "https://www.washingtonpost.com/politics/2022/04/26/trailer-pandemic-planner-crypto-billionaire-bunch-angry-democrats/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Weigel",
  "authorUrl": "https://www.washingtonpost.com/people/david-weigel/",
  "termIds": [
    2442,
    2442,
    914,
    914,
    2120,
    2120,
    1809,
    1809,
    1289,
    1289,
    146,
    146,
    2796,
    2796,
    2873,
    2873,
    2946,
    2946,
    2850,
    2850
  ],
  "sentences": [
    " seven days until primaries in Indiana and Ohio\n 14 days until primaries in Nebraska and West Virginia\n 21 days until primaries in Kentucky, Oregon, North Carolina and Pennsylvania\n 28 days until Texas runoffs and the special primary in Minnesota's 1st Congressional District\n 46 days until the special House primary in Alaska\n 63 days until the special election in Nebraska's 1st Congressional District\n 79 days until the special election in Texas's 34th Congressional District\n 190 days until the midterm elections",
    "As was first reported by Oregon Public Broadcasting, Mecrow-Flynn worked at the Center for Effective Altruism when Bankman-Fried was its development director; the candidate told OPB that if she's met him she hasn't said anything.?\nThe number of donors who had maxed out to Flynn, and had not given to other candidates, also surprised his opponents  most of whom had substantial political profiles in the district.",
    "Carrick's candidacy and story are clearly resonating with voters  recent polling has found Carrick leading in this race.?\nProtect Our Future's first endorsements went to a mix of challengers and incumbents, including Rep. Shontel M. Brown (D-Ohio), who was facing a rematch with left-wing challenger and former state lawmaker Nina Turner, and Rep. Ritchie Torres (D-N.Y.), who has no opponent at all.",
    "Our right to hold our leaders accountable and to vote for or against them and have a peaceful transition of power is essential for liberty and justice in America.?\nEvery public poll has shown Lee well ahead of McMullin, but most recent polls included Democrat Kael Weston, who kept running for the nomination even as some party leaders rejected him in favor of the independent.",
    "Soros is an investor in the company; therefore, Kemp's crooked deal cost Georgians but made Soros even richer.?\nMcSwain for Governor, Bill McSwain Will Oppose All Mandates.? To stop Pennsylvania state Sen. Doug Mastriano (R) from capturing Trump voters and winning the GOP primary, his opponents have been hitting him from the right  mostly on his vote to expand mail voting.",
    "doesn't really care about border enforcement  when he does, he mouths empty words to get him reelected.?\nDave McCormick for Senate, Oz Loves Masks.? The campaign to knock the post-Trump-endorsement shine off TV personality Mehmet Oz continues, with this supercut of clips that show the Republican U.S. Senate candidate talking about the protective value of face masks.",
    "I've deported thousands.?\nIf the Democratic primary for the U.S.House of Representatives were held today, who would you support for the Democratic nomination?? (Green Mountain Poll, April 14-18, 278 likely Democratic primary voters)\nThe left flank of the Democratic Party gained ground in 2018 and 2020, replacing or unseating more moderate Democrats in safe seats.",
    "The goal, said PAC president Michael Sadowsky, was electing members of Congress who'd give our nation the best shot at ensuring the devastation that has occurred as a result of the covid-19 pandemic never happens again.? Bankman-Fried was a believer in effective altruism,? maximizing the benefits of philanthropy through careful analysis and directed donations.",
    "That's the story behind this seven-figure buy, some in English and some in Spanish, which displays photos of migrants at the U.S.-Mexico border and says that Kelly voted for measure after measure to make an immigration crisis happen, including his votes against GOP poison pill amendments that are designed  well, designed to create material for ads like this.",
    "On Feb. 5, a grant-maker at Open Philanthropy named Andrew Snyder-Beattie posted on the Effective Altruism Forum, telling like-minded altruists that there was a rare opportunity for smaller donors to make a large impact,? by giving the maximum  $2900 for the primary, $2900 for the general  to Flynn, who he knew, had worked with, and trusted.",
    "In the weeks since it ran, the PAC has poured roughly $7 million into the race, another new PAC was founded to help elect Flynn to Congress, and the House Democrats' own super PAC, to the horror of the other Democrats running in this new seat, had endorsed Flynn, a 35-year lawyer and policy analyst with no political experience.",
    "In 2022, Cruz argues that this mind-set can help tackle Biden's inflation.?\nNational Republican Senate Committee, Against Arizona.? The GOP's Senate campaign arm has a lot of ground to make up in Arizona  Sen. Mark Kelly (D-Ariz.) is one of the best fundraisers in politics, and the Republicans running to challenge him are not.",
    "Roughly speaking, you should donate if you think Carrick winning the election would produce more good things in the world than $50 million worth of donations.?\nNone of the Democrats running for the new seat expected this, and none built their campaigns expecting millions of dollars to flow to someone they'd never heard of.",
    "A month ago, in Washington, paperwork was filed to create Justice Unites Us PAC, which called itself a data-driven organization that uses research to drive grass-roots engagement in the Asian American community?  and shared few other details, with no further disclosure required until three days after the primary.",
    "Like six hours later, Biden's citing my paper, and I think: Oh, they did need it urgently.? He decided to run for Congress, he says, after ideas that he says made sense to the White House never made it into a pandemic preparedness bill, and after 15 or 20 people I respected? told him to go for it.",
    "She's terrible, and she just got reelected today.? State Rep. Ryan Berman (R), one of the candidates who lost to DePerno, said that he would remain in the race to be ready if an ongoing investigation into DePerno's effort to overturn the 2020 election ends with the suspension of his law license.",
    "Ron DeSantis (R) approved a map he'd sent to the Republican-led legislature, Florida's Secretary of State moved to dismiss a March lawsuit from Common Cause and other voting rights groups, arguing that it was now moot, as their concerns about representation were based on a non-existent map.",
    "We were watching a YouTube video together, a tutorial about something,? said Flynn, sitting with his wife, Kathryn Mecrow-Flynn, after a U.S. Chamber of Commerce breakfast last week, where he and other Democratic congressional candidates heard a presentation on suburban crime.",
    "Advertisement\nAs a conservative lower bound, I think instantly hitting the fundraising target would free up over 250 hours of work from Carrick, and I think those 250 hours would increase the chances of him winning the election by more than 2 percent,? Snyder-Beattie wrote.",
    "A district that stretches from suburban Portland into Salem, and which a Democratic nominee is likely to win, attracted a diverse field of candidates, including two Latina state legislators and a veteran pouring his own crypto wealth into an outsider campaign.",
    "And he won an election that nobody thought he could.?\nCarnahan's support hovered between 14 and 16 percent, however, and she was eliminated from the last rounds of voting, as a rump of delegates continued to pick no endorsement? over either Munson or Benda.",
    "She doesn't have conservative credentials.?\nSeven Republican candidates made it to the vote in Mankato, Minn.  Munson, Carnahan, state Rep. Nels Pierson, ex-state Rep. Brad Finstad, USMC veteran Kevin Kocina, activist Ken Navitsky, and attorney Matt Benda.",
    "This is the latest of a few polls that finds Kemp moving ahead anyway, even as other Trump-endorsed candidates down the ballot coast (like U.S. Senate challenger Herschel Walker) or prepare to force a runoff (like Secretary of State candidate Jody Hice).",
    "Trump-backed candidates who insist that the ex-president won the 2020 election triumphed over the weekend, as Republicans in Grand Rapids, Mich., endorsed attorney Matthew DePerno for attorney general and activist Kristina Karamo for secretary of state.",
    "As the clear leader on each ballot, last night's process was a win for my campaign,? Munson said in a statement on Sunday, after hours of voting  and $300 charges to the party committee, for each hour they went over their reserved time.",
    "Born in the district and educated at Yale Law School, Flynn had spent years studying the risks of artificial intelligence and pandemics, culminating with a 2021 paper that, he says, helped shape the White House's pandemic response.",
    "I am happy to see our party avoid creating a self-inflicted disaster by endorsing a general election candidate before the primary,? said ex-party chair Jennifer Carnahan, after being knocked out of contention by the third ballot.",
    "On Saturday, after a rowdy state convention, 57 percent of party delegates opted not to endorse a challenger to Sen. Mike Lee (R-Utah), supporting the independent coalition that former Republican Evan McMullin is trying to build.",
    "This spot invokes Cawthorn's claim that he was invited to drug and sex parties with respected Washington leaders, and reminds voters that the congressman, in his 2020 campaign, falsely said that his dream of attending the U.S.",
    "Flynn had voted in just two federal elections in Oregon, in 2008 and 2016, and was far more comfortable talking about building a health system robust enough to quickly smother a new outbreak than he was about the competition.",
    "Pierson was eliminated quickly, announcing that he'd simply run in the May 24 primary instead, and the choice quickly came down to Munson, Benda, and Carnahan, with the former chair telling delegates that she'd been smeared.",
    "State Rep. Jeremy Munson got the most support in each round, while the 300-odd delegates revealed some antipathy toward Carnahan  the widow of the late Rep. Jim Hagedorn (R-Minn.), whose death prompted the special election.",
    "With a Trump endorsement off the table, it returns to a selling point from Mandel's two previous Senate campaigns  his work as state treasurer, and how he made information collected by his office easily accessible online.",
    "They talk tough about immigration, but none of them have locked up or deported a single violent criminal,? Lombardo says, after images of ex-Sen. Dean Heller (R-Nev.) and North Las Vegas Mayor John Lee play on a laptop.",
    "Republicans, who also met over the weekend, set up two intraparty challenges  primaries in the 1st and 3rd Congressional Districts, forced by conservative candidates who got enough convention votes to get on the ballot.",
    "In Ohio, the League of Women Voters asked the Ohio Supreme Court to hold Republican members of the redistricting commission in contempt, arguing that they had repeatedly flouted this court's express orders.?\nMichigan.",
    "We were thinking of spending, like a hundred thousand.?\nFor Flynn's competitors, the final straw was the announcement, this month, that the House Majority PAC would spend nearly $1 million to help him win the primary.",
    "The relentless spending has transformed the May 17 Democratic primary for Oregon's 6th Congressional District into one of the most expensive races in the country  not what Democrats expected when they drew the lines.",
    "It doesn't seem to matter how many fines he has to pay or the threat of losing his law license, if Trump asks DePerno to jump, he asks how high,? said Michigan Democratic Party chair Lavora Barnes in a statement.",
    "Next, a super PAC aligned with Tillis started running this spot, which goes after Cawthorn's main vulnerability  his habit of telling lies that make him look good and other Republicans look like crooked sellouts.",
    "Republicans in Minnesota's 1st Congressional District opted not to endorse a special election candidate on Saturday, gaveling out their convention after seven rounds of voting and a decent amount of backbiting.",
    "The whole point of me running and me self-funding was not being beholden to these interests.?\nFlynn said that he, too, felt conflicted about what happened after the effective altruists started writing checks.",
    "This spot, which went into rotation weeks ago, links Kemp directly to George Soros, not through the billionaire's funding of election reform but through a deal that brought an electric car company to Georgia.",
    "Bill McSwain, a former U.S. Attorney, takes another tack here, reminding Republicans that Mastriano favored lifting HIPAA regulations to make it easier for people to find out who'd contracted the coronavirus.",
    "Either Gray or Hinsdale, if elected, would be Vermont's first millennial member of Congress; Balint, a Generation X-er, laps the field with voters under 35 and voters who have a high school education or less.",
    "Advertisement\nThis election is a referendum on our democracy, our values, and whether or not this district can be bought,? said Matt West, a scientist running for the seat, at a candidate forum last week.",
    "Most of the other Democrats in the race came together for a news conference, organized by one of the candidates, West, with each candidate reading a section of a statement condemning the D.C. super PAC.",
    "One big problem for Perdue is that he's simply less-well-liked after months of attacks from Kemp; just 57 percent of likely GOP voters view the senator favorably, while 71 percent view Kemp favorably.",
    "His pitch: A democracy-focused nonpartisan campaign could compete with Lee, especially after the revelation, by the Jan. 6 committee, of text messages he wrote about challenging the 2020 election.",
    "Last week's candidate forum was conducted over Zoom, with each candidate staying in place for two hours, and several taking time to condemn the PAC money that had so dramatically altered the race.",
    "This one features Sabine Durden, who has talked about the killing of her son everywhere from committee hearings to the 2016 Republican National Convention, saying that Sen. John Boozman (R-Ark.)",
    "In this edition: The crypto cash that's turned an Oregon campaign upside down, a bitter GOP convention in Minnesota, and stop-the-steal battles shape party nominations in Utah and Minnesota.",
    "In January, Protect Our Future launched with a short list of endorsements  not including Flynn  and an initial $10 million investment in candidates who focused on pandemic preparedness.",
    "Advertisement\nI think it's disrespectful, and it's wrong,? said Loretta Smith, a former Multnomah County commissioner who would be the state's first Black member of Congress if elected.",
    "The Perdue campaign was willed into existence by Donald Trump, who urged the ex-senator to challenge Kemp and unseat him over his inability to reverse Joe Biden's 2020 Georgia victory.",
    "Lombardo for Governor, Keyboard Cowboys.? Clark County, Nev., Sheriff Joe Lombardo has competition for the GOP's gubernatorial nomination, and he wants you to know that it's pathetic.",
    "Chuck Edwards for Congress, Instagram.? Ad by ad, North Carolina state Sen. Chuck Edwards (R) has gotten more direct and sarcastic with his mockery of Rep. Madison Cawthorn (R-N.C.).",
    "Some of the contenders, like Reynolds, had thought for years about how to run and win; some had worked through way through local politics, passing bills and meeting countless voters.",
    "But there's going to be a part of me that's not thrilled to have beaten out two Latina candidates and a Black candidate if I win.?\nThey weren't particularly thrilled, either.",
    "It's been irritating, to say the least,? said Kathleen Harder, a physician and the chair of the state medical board, who entered the race a few months before Flynn did.",
    "I don't care if you're a Democrat or an independent or a Republican or a member of the United Utah Party,? McMullin told Democratic delegates near Salt Lake City.",
    "Nobody really knows what their motivation is.?\nNot every donor has been identified, but Flynn and other Democrats have a good idea of what Bankman-Fried wants.",
    "Edwards didn't mention Cawthorn by name in his first spot, but he does here, flipping through blown-up Instagram images of Cawthorn partying and working out.",
    "Advertisement\nWe need a champion for pandemic prevention in Congress, and we believe Carrick can be that leader,? Sadowsky told The Trailer in a statement.",
    "Advertisement\nThe voice was coming from an ad, one of the very first from Protect Our Future, a PAC funded by cryptocurrency billionaire Sam Bankman-Fried.",
    "We have a wealth of candidates, four of whom are women, three women of color.?\nNone of them had been ready to compete with millions of dollars in spending.",
    "Vermont's sole House seat hasn't been held by a Republican since 1990, and every Democrat now in the race leads any Republican nominee by a 2-1 margin.",
    "Jennifer created a toxic work environment at the party, which doesn't bode well in a general election,? Munson told the Trailer before the convention.",
    "But Balint's positioned herself as the most left-wing candidate, and her coalition looks the most like the one built by Sen. Bernie Sanders (I-Vt.).",
    "Arkansas Patriots Fund, Sabine.? Mothers of people killed by undocumented immigrants have been appearing in a number of GOP ads, in multiple states.",
    "Perdue for Governor, Soros.? There's not a whole lot in the campaign messaging of ex-Sen. David Perdue (R-Ga.) beyond criticism of Georgia Gov.",
    "Most of their defeated opponents  Republicans with elected experience, but no support from Trump  left the convention unready to endorse them.",
    "I didn't know this one in particular; I'd heard of Sam Bankman-Fried, but I'd never met him or talked to him.?\nFlynn's opponents don't buy it.",
    "Flynn is a strong, forward looking son of Oregon who is dedicated to delivering for families in the 6th District,? HMP spokesman C.J.",
    "The delegates left energized and ready to keep our district in conservative hands.?\nThe Democrats running for the seat, which Gov.",
    "Carnahan left her party role last year after a friend and party donor was charged with crimes related to federal sex trafficking.",
    "Cody Reynolds, a veteran who had run for a different House seat 10 years ago, had spent the intervening decade executing a plan.",
    "Voters who say a Trump endorsement would make them more likely? to support a candidate break for Perdue, but only by 25 points.",
    "Democrats condemned results that gave them, as LaFave suggested, improved chances of victory in a rough year for their party.",
    "Advertisement\nI had at least $2 million to spend, so I did it,? said Reynolds, after a tour of a local bioscience facility.",
    "At the halfway point, the candidates participated in a lightning round, with a little time to write their answers on paper.",
    "He would file for other races as a third-party candidate, making sure his positions were sent on official mail to voters.",
    "We got this message, saying: Carrick, this is urgent, can you answer this question about supply chains?? Flynn recalled.",
    "It didn't emphasize pandemic preparedness as much as it highlighted Social Security  a better-polling Democratic issue.",
    "It worked, and Reynolds made enough money in the cryptocurrency industry to outspend the field  until Flynn showed up.",
    "A full 30 percent of Republicans who say they can be moved by Trump also say he's not doing it for them in this race.",
    "House Majority Whip James E. Clyburn (D-S.C.) will head to Texas next week to rally with Rep. Henry Cuellar (D-Tex.",
    "The last state gerrymandering battles of the 2022 cycle are heading where they were destined to end up  to court.",
    "Nobody really knows who's funding this,? said state Rep. Andrea Salinas (D), who picked up endorsements from Gov.",
    "That's it  the entire ad is just out-of-context moments of Oz, before he left his TV gigs, talking about masks.",
    "Kate Brown, Planned Parenthood, and a number of labor unions before the heavy spending started boosting Flynn.",
    "I can't believe we now live in a world where billionaires own media companies, but this is still The Trailer.",
    "I would love to see that, and I haven't in the stuff that he's put out.?\nAdvertisement\nThe money kept coming.",
    "Look what the Democrats, the liberal press, and so-called Republicans did to President Trump,? Carnahan said.",
    "Results for NC, Madison Cawthorn's Lies.? First, Sen. Thom Tillis (R-N.C.) endorsed Edwards over Cawthorn.",
    "Like a number of recent ads, it uses imagery of riots in 2020 to portray the country in turmoil in 2022.",
    "I'm disappointed that Jocelyn Benson will be the Secretary of State for the next four years,? state Rep.",
    "TUALATIN, Ore.  Carrick Flynn can't remember what he was drinking, but he remembers why he spilled it.",
    "By the end of this race, our opponent will have spent at least $10 million, when you add up the PACs.",
    "And then we see this newspaper article: Justice Unites Us going to spend $800,000 on a ground game.",
    "Democrats won't have a nominee of their own for U.S. Senate, and they couldn't be happier about it.",
    "But the donations started coming before the rest of the field realized exactly what was happening.",
    "stars in one of the final ads for Josh Mandel's U.S. Senate Republican primary campaign in Ohio.",
    "Flynn answered them all, even breaking down the housing insecurity answer into subcategories.",
    "Flynn's opponents didn't use their time to talk about what had happened, but they'd noticed.",
    "Tim Walz (D) held until Hagedorn won it four years ago, will meet at a forum on Sunday.",
    "In perpetual support of celebrity, Cawthorn will lie about anything,? a narrator says.",
    "But when the candidates were asked where they voted in 2020, his camera went dark.",
    "And this man wants to be the top law enforcement officer in Michigan.?\nUtah.",
    "I still haven't heard exactly what his stance is on pandemic preparedness.",
    "We were in the process of setting up a ground operation,? Flynn recalled.",
    "Perdue has taken every chance he's gotten to pin Kemp down on that issue.",
    "Naval Academy was ended by the car accident that partially paralyzed him.",
    "Video ads and direct mail introduced Flynn as a hometown kid made good.",
    "Oregonians are so nice and forgiving,? Salinas said the next morning.",
    "We see through [it].?\nRaw thoughts from the days around Jan. 6, 2021.",
    "He would raise as much money as it took to self-fund a campaign.",
    "Once again, said Flynn, the help seemed to come out of nowhere.",
    "), who'll face challenger Jessica Cisneros in a May 24 runoff.",
    "While they post online, America falls apart,? says Edwards.",
    "I think that overall, I'm the best candidate,? Flynn said.",
    "How many Oregonians were affected by housing insecurity?",
    "Beau LaFave (R) told Bridge Michigan's Jonathan Oosting.",
    "Citizens for Josh Mandel, Ted.? Sen. Ted Cruz (R-Tex.)",
    "Brian Kemp (R) for how he handled the 2020 election.",
    "So we're like: Uh, do we still do our ground game?",
    "Advertisement\nPeople care about this,? Flynn said.",
    "(Cawthorn had been rejected before the accident.)",
    "When the round was over, the light came back on.",
    "I know that people with money care about this.",
    "Why was this decision made?? asked Salinas.",
    "Warnke told The Trailer last week.",
    "None got as much support as Flynn.",
    "She doesn't have a voting record.",
    "I didn't know that was coming.",
    "What was Oregon's state bird?",
    "Days after Florida Gov.",
    "Who was behind it?",
    "Not one.",
    "Texas."
  ]
}