{
  "id": 1978,
  "mediaId": 112,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Marjorie Taylor Greene testifies in constituent suit seeking to disqualify her from re-election to Congress",
  "image": "https://images.mktw.net/im-530023?width=700&size=1.5005861664712778&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/marjorie-taylor-greene-testifies-at-hearing-challenging-her-candidacy-01650650419",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.marketwatch.com/column/associated-press",
  "termIds": [
    2087,
    2087,
    2203,
    2203,
    1596,
    1596,
    883,
    883,
    1147,
    1147,
    2358,
    2358,
    428,
    545,
    545,
    428,
    43,
    43,
    2672,
    2672
  ],
  "sentences": [
    "Voters in the Georgia congresswoman's district have said Greene helped facilitate the Jan. 6, 2021, insurrection that disrupted for several hours the certification of President Biden's Electoral College victory, making her ineligible for re-election under a section of the 14th Amendment dealing with insurrection or rebellion.?\nAlso (June 2021): Twenty-one Republicans objected as House voted to honor Capitol Police and D.C. officers for Jan. 6 heroism\nGreene is set to appear on the Republican primary ballot in Georgia on May 24 and has been endorsed by former President Donald Trump.",
    "Associated Press\nThe first-term Georgia Republican has repeatedly denied aiding or engaging in an insurrection and has filed a lawsuit alleging that the law the voters are using to challenge her eligibility is itself unconstitutional\nATLANTA (AP)  U.S. Rep. Marjorie Taylor Greene claimed to lack clear recollection of numerous remarks and events surrounding the January 2021 attack on the U.S. Capitol and was at turns hostile during testimony Friday in a hearing on her eligibility to run for re-election.",
    "Unlike past insurrections, like the Civil War, that involved military uniforms and tactics, he said, The leaders of this insurrection were among us, on Facebook FB, -2.11%, on Twitter TWTR, +3.93%, on corners of social media that would make your stomach hurt.?\nGreene testified that she and other congressional Republicans were initially given to believe that the people storming the chamber were, in fact, Black Lives Matter or antifa protesters disguised as Trump supporters.",
    "The voters' complaint says Greene helped plan the riot and/or the demonstration and march on the Capitol that preceded it, knowing that it was substantially likely to lead to the attack, and otherwise voluntarily aided the insurrection.?\nGreene filed a federal lawsuit earlier this month asking a judge to declare the law allowing voters to challenge a candidate's qualifications unconstitutional and to prohibit state officials from enforcing it.",
    "The 14th Amendment says no one can serve in Congress who, having previously taken an oath, as a member of Congress  to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same.? Ratified shortly after the Civil War, it aimed to keep representatives who had fought for the Confederacy from returning to Congress.",
    "Celli played a clip of an interview Greene did the day before the Capitol riot in which she said this is our 1776 moment.? When Celli asked if she was aware that some Trump supporters used that reference as a call to violence, Greene said that was not her intention and that she was talking about her plans to object to the certification of electoral votes.",
    "Brian Kemp, also a Republican, for allowing the challenge against Greene, saying she is going through hell in their attempt to unseat her.?\nIn fact, the challenge to Greene's eligibility to run for re-election was filed by five voters who live in her district, and the procedure for such a challenge is outlined in Georgia law.",
    "The hearing Friday is not the ultimate determinant of Greene's candidacy since the administrative law judge overseeing the proceeding must present his findings to Secretary of State Brad Raffensperger, who then must decide whether Greene, a fellow Republican, is qualified.",
    "Greene, a freshman Republican from north Georgia, was engaged in legitimate political speech? when she called for a response to Democrat Joe Biden's presidential victory prior to last year's Capitol attack, her lawyer argued.",
    "Greene testified that she and other congressional Republicans were initially given to believe that the people storming the chamber were, in fact, Black Lives Matter or antifa protesters disguised as Trump supporters.",
    "A federal judge last month blocked the challenge against Cawthorn from moving forward, writing that laws approved by Congress in 1872 and 1898 mean the 14th Amendment section can't apply to current House members.",
    "Whenever Celli suggested that she had endorsed the use of violence to interrupt the certification of the electoral votes, Greene asserted that she does not support violence and was encouraging peaceful protest.",
    "Greene  who, the day before the Capitol riot, proclaimed on TV that this is our 1776 moment?  testified that she has never endorsed violence and has repeatedly denied aiding or engaging in an insurrection.",
    "James Bopp, a lawyer for Greene, said his client did not engage in the attack on the Capitol,? and the challengers are making a very serious charge with significant ramifications.",
    "She said she did not remember liking and making various social-media posts surrounding the Capitol siege and accused a plaintiff's lawyer of speculating and twisting her words.",
    "The group filed a similar challenge on behalf of voters in western North Carolina against Republican U.S. Rep. Madison Cawthorn, who spoke at the rally that preceded the riot.",
    "Andrew Celli, a lawyer for the voters, cross-examined Greene about posts on her social-media accounts and other statements she made around the time of the Capitol riot.",
    "Raffensperger and Kemp both attracted Trump's wrath shortly after the 2020 election when they refused to take steps to overturn Trump's narrow loss in the state.",
    "While Greene wasn't on the steps of the Capitol, she nevertheless played an important role in stoking Republican fury ahead of the Jan. 6 attack, Fein said.",
    "They want to deny the right to vote to the thousands of people living in the 14th District of Georgia by removing Greene from the ballot,? he said.",
    "U.S. District Judge Amy Totenberg in Atlanta on Monday declined a request from Greene to halt the challenge process while the lawsuit plays out.",
    "Greene was a victim of this attack,? Bopp said, adding that the congresswoman was scared and confused and believed her life could be in danger.",
    "The law says any voter who's eligible to vote for a candidate can challenge that candidate's qualifications by filing a written complaint.",
    "From the archives (December 2021): For some, the phrase Joe Biden won the election' remains political kryptonite\nMarketWatch contributed.",
    "But Ron Fein, a lawyer for the voters who filed the challenge, said Greene took an oath and then broke it by engaging in an insurrection.",
    "The Georgia complaint was filed on the voters' behalf by Free Speech for People, a national election and campaign-finance reform group.",
    "At the time of the riot, she was in a dark hallway at the Capitol urging people via social media to be safe and remain calm, he said.",
    "Greene met with Trump about making objections to certain states' electoral votes because of concerns about voter fraud, Bopp said.",
    "Dozens of Greene supporters attended the hearing, including U.S. Rep. Matt Gaetz, a Florida Republican and frequent Greene ally.",
    "She has filed a lawsuit alleging that the law the voters are using to challenge her eligibility is itself unconstitutional.",
    "The secretary of state then has to request a hearing before an administrative law judge.",
    "In a statement Thursday, Trump incorrectly blamed Raffensperger and Georgia Gov.",
    "I was talking about the courage to object,? she said.",
    "Greene repeatedly said she didn't recall them.",
    "Greene is appealing that ruling.",
    "Rep."
  ]
}