{
  "id": 1987,
  "mediaId": 147,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "WATCH: Rep. Marjorie Taylor Greene fights court challenge to her reelection",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2021/06/cropped_2021-06-14T222826Z_1912301408_RC2M0O9ZYOFJ_RTRMADP_3_USA-CONGRESS-GREENE-1024x683.jpg",
  "link": "https://www.pbs.org/newshour/politics/watch-live-rep-marjorie-taylor-greene-fights-court-challenge-to-her-reelection",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Brumback",
  "authorUrl": "https://www.pbs.org/newshour/author/kate-brumback-associated-press",
  "termIds": [
    883,
    1147,
    1335,
    1596,
    2095,
    2303,
    2358,
    146,
    428,
    2555,
    2672,
    2945
  ],
  "sentences": [
    "Voters in the Georgia congresswoman's district have said Greene helped facilitate the Jan. 6, 2021, insurrection that disrupted certification of President Joe Biden's victory, making her ineligible for reelection under a rarely cited section of the 14th Amendment dealing with insurrection or rebellion.?\nBut Greene  who, the day before the Capitol riot, proclaimed on TV that this is our 1776 moment?  testified that she has never endorsed violence.",
    "READ MORE: Rep. Greene apologizes for comparing safety mask requirements to Holocaust\nUnlike the Civil War and other insurrections that involved military uniforms and tactics, he said, The leaders of this insurrection were among us, on Facebook, on Twitter, on corners of social media that would make your stomach hurt.?\nAndrew Celli, a lawyer for the voters, cross-examined Greene about posts on her social media accounts.",
    "The 14th Amendment says no one can serve in Congress who, having previously taken an oath, as a member of Congress  to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same.? Ratified shortly after the Civil War, it aimed to keep representatives who had fought for the Confederacy from returning to Congress.",
    "Politics\nATLANTA (AP)  U.S. Rep. Marjorie Taylor Greene was hostile during testimony Friday in a hearing on her eligibility to run for reelection, saying she did not remember liking and making various social media posts surrounding the attack on the U.S. Capitol last year and accusing an opposing lawyer of speculating and twisting her words.",
    "Celli played a clip of an interview Greene did Jan. 5, 2021, in which she said this is our 1776 moment.? When Celli asked if she was aware that some Trump supporters used that reference as a call to violence, Greene said that wasn't her intention and that she was talking about her plans to object to the certification of electoral votes.",
    "Brian Kemp, both Republicans, for allowing the challenge against Greene, saying she is going through hell in their attempt to unseat her.?\nIn fact, the challenge to Greene's eligibility to run for reelection was filed by five voters who live in her district, and the procedure for such a challenge is outlined in Georgia law.",
    "The group filed similar challenges on behalf of voters in Arizona, where a judge on Friday ruled to keep the Republicans on the ballot, and in North Carolina against Republican U.S. Rep. Madison Cawthorn, who spoke at the rally that preceded the riot.",
    "When asked about the fact that her Facebook account had, in 2019, liked? a post calling for Democratic House Speaker Nancy Pelosi to be shot in the head, Greene said she had no memory of doing that and said someone else could have been responsible.",
    "The administrative law judge overseeing the hearing is not the ultimate decider of Greene's candidacy since he must present his findings to Republican Secretary of State Brad Raffensperger, who then must determine whether Greene is qualified.",
    "Whenever Celli suggested that she'd endorsed the use of violence to interrupt the certification of the electoral votes, Greene asserted she doesn't support violence and was encouraging peaceful protest.",
    "A federal judge last month blocked the challenge against Cawthorn, writing that laws approved by Congress in 1872 and 1898 mean the 14th Amendment section can't apply to current House members.",
    "Greene has repeatedly denied aiding or engaging in an insurrection and has filed a lawsuit alleging that the law the voters are using to challenge her eligibility is itself unconstitutional.",
    "James Bopp, a lawyer for Greene, said his client did not engage in the attack on the Capitol,? and the challengers are making a very serious charge with significant ramifications.",
    "Raffensperger and Kemp both attracted Trump's wrath shortly after the 2020 election when they refused to take steps to overturn Trump's narrow loss in the state.",
    "Greene filed a federal lawsuit earlier this month asking a judge to declare the law allowing voters to challenge a candidate's qualifications unconstitutional.",
    "While Greene wasn't on the steps of the Capitol, she nevertheless played an important role in stoking Republican fury ahead of the attack, Fein said.",
    "They want to deny the right to vote to the thousands of people living in the 14th District of Georgia by removing Greene from the ballot,? he said.",
    "The law says any voter who's eligible to vote for a candidate can challenge that candidate's qualifications by filing a written complaint.",
    "But Ron Fein, a lawyer for the voters who filed the challenge, said Greene took an oath and then broke it by engaging in an insurrection.",
    "The Georgia complaint was filed on the voters' behalf by Free Speech for People, a national election and campaign finance reform group.",
    "Greene is set to appear on the Republican ballot for Georgia's May 24 primary and has been endorsed by former President Donald Trump.",
    "At the time of the riot, she was in a dark hallway at the Capitol urging people via social media to be safe and remain calm, he said.",
    "Greene met with Trump about making objections to certain states' electoral votes because of concerns about voter fraud, Bopp said.",
    "Dozens of Greene supporters attended the hearing, including U.S. Rep. Matt Gaetz, a Florida Republican and staunch Greene ally.",
    "Celli appeared to grow frustrated at times when she didn't directly answer his questions and said he was speculating.",
    "U.S. District Judge Amy Totenberg in Atlanta on Monday declined a request from Greene to halt the challenge process.",
    "Greene was a victim of this attack,? Bopp said, adding that she believed her life could be in danger.",
    "Associated Press writer Gary Robertson in Raleigh, North Carolina, contributed reporting.",
    "The secretary of state then has to request a hearing before an administrative law judge.",
    "In a statement Thursday, Trump incorrectly blamed Raffensperger and Georgia Gov.",
    "I was talking about the courage to object,? she said.",
    "Greene, I'm just asking questions,? he said.",
    "Watch the proceedings in the player above.",
    "I'm just answering,? she responded.",
    "Greene is appealing that ruling.",
    "Rep.",
    "Ms."
  ]
}