{
  "id": 2024,
  "mediaId": 129,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Democratic Dollars Flow Once Again to Likely Lost Causes",
  "image": "https://static01.nyt.com/images/2022/04/19/multimedia/19pol-challengers-chambers/19pol-challengers-chambers-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/04/19/us/politics/democratic-midterm-fundraising.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    815,
    815,
    1136,
    1136,
    2303,
    1951,
    1951,
    1362,
    1362,
    428,
    146,
    146,
    428,
    2766,
    2766,
    2672,
    2672,
    2942,
    2942
  ],
  "sentences": [
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering, though this year's map is poised to be surprisingly fair\nGovernors' Races: Georgia's contest will be at the center of the political universe, but there are several important races across the country.",
    "Chambers, he said, is taking a page from Ms. Abrams, who energized Georgia voters of color, urban liberals and the scatterings of rural Democrats to nearly win the governorship four years ago, build a political organization and set herself up for a rematch this year with the Republican governor, Brian Kemp.",
    "Her advantage two years later comes from disenchantment with Mr. Cawthorn, whose antics  he has called Ukraine's president a thug and most recently said his colleagues had invited him to cocaine-filled orgies  have prompted seven Republicans to challenge him in the upcoming primary.",
    "As people walk away from Cawthorn, our job is to meet them,? she said, adding, For those who don't know what to make of a gay Christian minister, what is very clear with them is I'm being honest with them from the start.?\nIn Senator John Kennedy, Republican of Louisiana, Mr.",
    "Some Democrats say such races are draining money from more winnable campaigns, but the candidates insist that even in losing, they are helping the party by pulling voters in for statewide races, bolstering the Democratic brand and broadening the party's appeal.",
    "His campaign is based on his irreverent appeal  an outspoken Black progressive voice willing to smoke weed in a commercial, burn a Confederate flag and call white school board members racist to their faces for defending a school named after Robert E. Lee.",
    "Flowers the maximum allowable contribution, said support was not necessarily about winning the seat but holding Ms. Greene in check and using his run to elevate her profile as the face of the Republican Party in suburban districts that are more winnable.",
    "Every election year in recent cycles, celebrity Democratic candidates have emerged  either on the strength of their personalities, the notoriety of their Republican opponents or both  to rake in campaign cash, then lose impossible elections.",
    "Democrats across the country dumped hundreds of millions of dollars into the Senate campaigns of Jaime Harrison in South Carolina and Amy McGrath in Kentucky, when the money could have been spent on more winnable local races, he said.",
    "A married lesbian mother of three, Ms. Beach-Ferrara insists her unlikely life story will help her in a district where an influx of politically active outsiders in the Asheville area could change the region's direction.",
    "The man who created Mr. Chambers's marijuana and Confederate flag ads, Erick Sanchez, helped run Andrew Yang's presidential campaign and also hawks Fouch on the Couch? throw pillows of Dr. Anthony Fauci for $40 a pop.",
    "Flowers has proved remarkably adept at raising small-dollar donations with a barrage of emails  sometimes multiple emails each day  that capitalize on the behavior of the far-right congresswoman he is running against.",
    "Flowers can build name recognition for future runs and might energize the Democrats who live in Northwest Georgia to come out and vote for him, Mr. Warnock and the Democratic candidate for governor, Stacey Abrams.",
    "Senator Ron Johnson of Wisconsin, a Republican widely viewed as vulnerable this year, was criticized six years ago for anemic fund-raising; this time around, he raised nearly $8.7 million in the first quarter.",
    "And for Marcus Flowers, a cowboy-hat-wearing veteran in Georgia who raised $2.4 million just in the first three months of the year to try to dislodge Marjorie Taylor Greene from a heavily Republican district.",
    "Flowers, whose $2.4 million haul in the first quarter easily topped Ms. Greene's $1.1 million, in a Northwest Georgia district that has given Republicans 75 percent of the vote since it was created in 2012.",
    "We are asking folks to join us, join us in winning this race and doing the organizing we need,? Ms. Beach-Ferrara said in an interview, and to say we can't look at the map and say we aren't running there.",
    "Now, he has captured the hearts and wallets of young liberals with a video for his improbable Senate campaign that shows him smoking a large joint and calling for the legalization of marijuana.",
    "An Army veteran who served in combat, he has emphasized his military service, talking tough while attacking Ms. Greene's sympathy for the Jan. 6 rioters and far-right conspiracy theories.",
    "Senator Raphael Warnock, a Georgia Democrat facing a difficult re-election, raised $13.6 million against the $5.2 million raised by his main Republican opponent, Herschel Walker.",
    "Jasmine Beach-Ferrara, a gay minister who has raised $1.4 million to oust Representative Madison Cawthorn, the far-right Republican, from his North Carolina seat.",
    "Embittered by the experience, Mr. Ojeda moved to North Carolina to leave a home state he describes with the same epithet Mr. Trump used for developing countries.",
    "Mr. Ojeda, a trash-talking Bronze Star winner, sought to remake his party's image in his emerging Republican stronghold as more muscular and more working class.",
    "Mr. Jones ran the campaign of another celebrity Democrat, Richard Ojeda of West Virginia, whose House campaign in 2018 was instructive in other ways.",
    "She said Mr. Trump still would have won it by 10 percentage points but the state's Democratic governor, Roy Cooper, would have lost by only 4 points.",
    "He uses his political notoriety to lift his group No Dem Left Behind, which promotes candidates in rural Republican areas, as he builds a new house.",
    "Gary Chambers Jr. burst onto the national scene in 2020 with a viral video of him castigating the racism of the East Baton Rouge school district.",
    "North Carolina's 11th House district, with new lines, is slightly less Republican than it was in 2020, when Mr. Cawthorn was first elected.",
    "Representative Val Demings, Democrat of Florida, raised more than $10 million to challenge Senator Marco Rubio, who raised $5.8 million.",
    "In West Virginia, all you can do as a Democrat is stand up, fight the battle so it's recorded and say, You guys are full of'? it.",
    "Ms. Beach-Ferrara is similarly buoyed by her opponent, Mr. Cawthorn, the young face of far-right conservatism in the Trump era.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycle's defining topics.",
    "When you do that you get a Madison Cawthorn in office.?\nAs first-quarter fund-raising numbers roll in, the stars are emerging.",
    "Critics say such campaigns are more about building the brand of Democratic consultants than making a play for a Senate seat.",
    "West Virginia is going to have to burn to the ground before it will ever rise from the ashes  that's it,? Mr. Ojeda said.",
    "Even as he defended his campaign, Mr. Ojeda criticizes the party in ways that echo criticism of his own effort.",
    "The average contribution was $41, many of those small-dollar donors youthful and excited, the campaign said.",
    "She can't be free to travel around the country and spew her lies and disinformation,? Mr. Soltz said.",
    "Jon Soltz, the co-founder and chairman of VoteVets.org, a liberal veterans organization that gave Mr.",
    "But Randy Jones, one of Mr. Chambers's campaign chiefs, said the candidate should not be discounted.",
    "But he also sees no point in ever trying again in a state so thoroughly Republican in the Trump era.",
    "He has almost no paths to victory over a sitting Republican senator in a red state like Louisiana.",
    "He insisted he could have won if Mr. Trump hadn't come to his corner of West Virginia twice.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "Chambers does not have the villain that Democrats have made nationally of Ms. Greene.",
    "Midterms Begin: The Texas primaries officially opened the 2022 election season.",
    "He raised $800,000 in the first three months of the year from 18,500 donors.",
    "He raised nearly $3 million, then lost by nearly 13 percentage points.",
    "We're making her spend her money.?\nIn the process, Mr.",
    "Competitive races are already awash in money.",
    "Here are the four incumbents most at risk.",
    "The biggest bucks belong to incumbents.",
    "The same most likely goes for the Rev.",
    "But he has raised $1.2 million.",
    "See the full primary calendar.",
    "Then there's Mr.",
    "Mr.",
    "Mr."
  ]
}