{
  "id": 2141,
  "mediaId": 233,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "Ukraine evacuations, Trump rally, weekend at the Masters: 5 things to know this weekend",
  "image": "https://www.gannett-cdn.com/presto/2022/04/04/USAT/648cfb04-5625-4509-9eb6-fcf8c34b7245-bucha_bug.png?crop=1911,1075,x4,y0&width=1911&height=1075&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/2022/04/09/ukraine-evacuations-trump-rally-5-things-know-weekend/9506363002/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Editors",
  "authorUrl": "",
  "termIds": [
    1147,
    1501,
    2095,
    2303,
    2320,
    2647,
    2742,
    2888,
    2942
  ],
  "sentences": [
    "USA TODAY\nOperations halted at Ukraine station, but evacuations continue\nA rocket strike targeting a train station in the eastern Ukrainian city of Kramatorsk Friday killed at least 50 people and injured dozens who were attempting to flee amid Russia's new focus on the region, Ukrainian officials said.",
    "They include Rep. Ted Budd, a little-known congressman running for a Senate seat who won a surprise endorsement from Trump, and Rep. Madison Cawthorn, who continues to have Trump's support even though he has faced backlash from members of his own party over various recent incendiary comments.",
    "2 seed in the East is open among three teams (the Milwaukee Bucks, Boston Celtics and Philadelphia 76ers) and the standings are so tight, there's a scenario where the 76ers fall to the fifth seed if they lose their remaining two games and the Toronto Raptors win their final two games.",
    "Only the top 50 players, including ties, made the cut to play this weekend and on that list is five-time champion Tiger Woods, who is playing in his first professional golf tournament since he was involved in a devastating auto accident in February 2021.",
    "Check out the 5 Things podcast:\nCawthorn among the speakers to appear at Trump's North Carolina rally\nFormer President Donald Trump will return to North Carolina Saturday for a rally in the town of Selma in rural Johnston County.",
    "Also, Trump's efforts to shape Georgia's race for governor has not been going according to plan as his candidate for the Republican primary, former Sen. David Perdue, is trailing incumbent Brian Kemp in at least one recent poll.",
    "Rob Fleming, minister of transportation and infrastructure, said in a release that British Columbia celebrates the return of cruise ships and their passengers while the region works to rebuild its tourism economy.",
    "Holland America Line's Koningsdam ship will be the first ship to dock in Victoria, Canada, on Saturday in 905 days since the onset of the coronavirus pandemic, the cruise line said in a news release.",
    "Teams are also jockeying for position for the play-in tournament that begins Tuesday and features the 7-10 seeds in both the Eastern and Western conferences fighting for two spots in the playoffs.",
    "The leader going into the weekend is American Scottie Scheffler who shot a 5-under-par Friday and will begin the third round five strokes ahead of four golfers tied for second place.",
    "Iryna Vereshchuk, Ukraine's Deputy Prime Minister, added Saturday that 10 humanitarian corridors for civilian evacuations will open in the eastern area of the nation.",
    "Ukraine's railway operator said Saturday operations are halted at the Kramatorsk station, but civilian evacuations will continue through other stations.",
    "The ban, which applied to cruise ships with more than 100 passengers, first went into effect in March 2020 and had been set to run through Feb. 28.",
    "The Masters wraps up Sunday as all eyes remain on Tiger Woods\nThe 86th Masters golf tournament continues with the third round on Saturday (3 p.m.",
    "Ukrainian President Volodymyr Zelenskyy called the strike another Russian war crime and said Ukraine expects a tough global response.",
    "Cruising returns to Canada after two years\nCruise ships will once again make port calls in Canada after two years starting Saturday.",
    "Candidates Trump has endorsed competing in contested Republican primaries across the state are expected to speak at the event.",
    "Last month, he withdrew his endorsement of Rep. Mo Brooks, who was struggling to gain traction in Alabama's Senate primary.",
    "The 12 playoff berths and eight play-in spots have all been determined, but several teams are still jockeying for position.",
    "Saturday's rally comes amid questions over whether Trump's influence is fading amid stumbles in other states.",
    "Woods shot a 2-over 74 in his second round Friday despite his worst start ever at Augusta National Golf Club.",
    "Nearly six months later, there is still a lot to be decided on the final day of the regular season Sunday.",
    "Remnants of a rocket with the words \"For the children\" painted on it in Russian were also seen in photos.",
    "Currently tied for 19th at 1 over for the tournament, Woods is scheduled to tee off Saturday at 1 p.m.",
    "Scheffler's five-shot advantage is tied for the largest lead in Masters history after 36 holes.",
    "A lot to be determined on final day of NBA season\nThe NBA season began on Oct. 19.",
    "Five children were among those killed, the regional governor of Donetsk said.",
    "Photos from the scene showed bodies covered in tarps, surrounded by blood.",
    "About 4,000 civilians were inside and around the station when it was hit.",
    "Hideki Matsuyama, the 2021 Masters winner, is among those at 3 under.",
    "ET, CBS) and wraps up with the final round Sunday (2 p.m.",
    "ET alongside fellow American Kevin Kisner.",
    "Contributing: The Associated Press",
    "Prefer to listen?",
    "ET, CBS).",
    "The No."
  ]
}