{
  "id": 2181,
  "mediaId": 43,
  "date": "4/5/2022 12:00:00 AM",
  "headline": "Morning Digest: Maryland's Republican governor and Democratic legislature reach redistricting deal",
  "image": "https://images.dailykos.com/images/1055921/story_image/New.png?1649107056",
  "link": "https://www.dailykos.com/story/2022/4/5/2090082/-Morning-Digest-Maryland-s-Republican-governor-and-Democratic-legislature-reach-redistricting-deal",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1796,
    1796,
    428,
    146,
    146,
    428,
    2669,
    2669,
    2560,
    2560,
    2546,
    2782,
    2782,
    2690,
    2690,
    2546
  ],
  "sentences": [
    "1Q Fundraising\nAZ-Sen: Blake Masters (R): $1.1 million raised\nRI-Gov: Dan McKee (D-inc): $400,000 raised; Ashley Kalus (R): $500,000 self-funded\nCA-40: Asif Mahmood (D): $1.4 million raised\nFL-13: Anna Paulina Luna (R): $400,000 raised\nIL-03: Delia Ramirez (D): $303,000 raised\nRI-02: Seth Magaziner (D): $1.4 million raised (in two months); Sarah Morgenthau (D): $500,000 raised (in five weeks; may include self-funding); David Segal (D): $252,000 raised; Allan Fung (R): $500,000 raised (in seven weeks), additional $50,000 self-funded\nNY-03: Robert Zimmerman (D): $900,000 raised (in 10 weeks)\nSenate\n? AL-Sen: Rep. Mo Brooks is airing his first new commercial since he lost Donald Trump's \"Complete and Total\" endorsement for the May 24 GOP primary nearly two weeks ago.",
    "Legislatures\n? Special Elections: We have a total of eight special legislative elections on Tuesday in California, Pennsylvania, and Georgia, but only the all-party primary for Georgia's 45th House District is being held on competitive turf:\nGA HD-45: Three Republicans and one Democrat are running to succeed Matt Dollar, a Republican who resigned in February to take a post at the state's Technical College System, in a longtime conservative stronghold that moved hard to the left during the Trump era.",
    "Peters, who is shown firing his gun at a target practice, is campaigning to take on Democratic Rep. Steven Horsford in a seat that Biden would have won 53-45.\n? OH-09: State Rep. Craig Riedel's new ad for the May 3 Republican primary begins with him saying of the Democratic incumbent, \"It's not enough to just defeat Marcy Kaptur: Northwest Ohio needs a conservative congressman.\"",
    "She further used the Big Lie to attack Lamborn, saying, \"The El Paso County Republican Party will not be lectured about election integrity by Doug Lamborn, especially when he supported the continued use of Dominion Voting Systems counting Republican primary ballots by forcing our Party to stay in a rigged open primary system controlled by Democrats.\"",
    "None of the three Republicans, by contrast, are running for a full term: Team Red's lineup consists of former state Rep. Mitch Kaye, who left office in 2002 to wage an unsuccessful campaign for state superintendent; party activist Pamela Alayon; and Darryl Wilson, another conservative activist who was the 2006 Democratic nominee against Dollar.",
    "? NC-04: Durham County Commissioner Nida Allam launched her opening commercial for the May 17 Democratic primary during Saturday's UNC-Duke game (the archrival schools are both located in in the 4th District), and it emphasizes her work in office raising the minimum wage for county workers and helping implement \"property tax relief.\"",
    "? CA-22 (special): Tuesday's all-party primary for the soon-to-be-junked version of California's 22nd Congressional District may end up answering one of the biggest questions in American politics: Will former Rep. Devin Nunes still have his job at Donald Trump's social media company by the time his successor takes office?",
    "Lamborn continued by alleging he'd \"witnessed a shocking lack of transparency and basic competence in the handling of the delegate and alternate list for the 5th CD Assembly,\" and said that \"[p]articipants can't have confidence in the process if there is concern that the list has been tampered with.\"",
    "? NC-11: While state Sen. Chuck Edwards' new spot avoids directly mentioning freshman incumbent Madison Cawthorn, the person he's trying to unseat in next month's GOP primary, there's no question whom Edwards is comparing himself to when he says, \"If you want a celebrity, go watch the Kardashians.",
    "Four Republicans and two Democrats will compete on one ballot for a Central Valley seat Trump carried 52-46; if no one earns a majority, the top two vote-getters, regardless of party, would compete in the June 7 general election that would take place the same day as the regular statewide primary.",
    "Business owner Andrew Heaton, who is still waiting to learn if he submitted enough petitions before last month's deadline, similarly complained to Luning, \"Although we respect the assembly process, my campaign has requested the most recent delegate list three times, yet never received a list.\"",
    "? CO-05: State Rep. Dave Williams, who is challenging Rep. Doug Lamborn for renomination in the 5th District, won Saturday's Republican convention with the support of 74% of the delegates, which earns him the top spot on the June primary ballot in this safely red Colorado Springs seat.",
    "Navy veteran Rebecca Keltie, who also collected enough signatures to qualify for the primary ballot without going through the convention, told her supporters she'd likewise decided not to attend the assembly after it \"degraded into an absolute circus by those who disregard the rules.\"",
    "That College Park protrusion, a feature of the previous decade's map as well, had very likely been maintained at the behest of powerful Rep. Steny Hoyer: By cynically preventing the district from becoming majority Black, the incumbent would be shielded from a Black primary challenger.",
    "Colorado Politics' Ernest Luning writes that \"[n]umerous Republican candidates\" have also leveled similar complaints against Tonkins, charging that she and her allies, including Williams, \"have been hoarding lists of Republicans who attended precinct caucuses and party assemblies.\"",
    "? IL-Gov: The DGA recently began an ad campaign attacking Aurora Mayor Richard Irvin in order to weaken him ahead of the June GOP primary, and Irvin is responding with a spot arguing that this shows he's the candidate Democratic incumbent J.B. Pritzker is most afraid of.",
    "A spokesperson for the state GOP responded to Tonkins' missive by saying, \"Even if a candidate criticizes the county party, the county party chairman has an obligation to run the operation he or she is entrusted with in a way that every candidate and voter can trust.\"",
    "? IN-01: Former LaPorte Mayor Blair Milo, who is the favorite to win the May 3 GOP nod to take on Democratic Rep. Frank Mrvan, uses her first TV ad to portray herself as a conservative Navy veteran who is running because \"Biden and Pelosi threaten all we hold dear.\"",
    "The chair also reminded recipients that the congressman is under investigation by the nonpartisan Office of Congressional Ethics for allegedly misusing official resources by having congressional staff perform personal and campaign-related tasks for him and his wife.",
    "The new arrival who got the most attention Friday in the hours before Palin filed was North Pole City Council member Santa Claus, a self-described \"independent, progressive, democratic socialist\" who previously had his name changed from Thomas O'Connor.",
    "Larry Hogan on Monday: In exchange for Hogan signing the legislature's new congressional map, Democrats agreed to drop their appeal of a state court ruling that had struck down their original set of districts, ending litigation over the matter.",
    "It's also possible that another dissatisfied party could file a new suit challenging the latest map, though with the candidate filing deadlinewhich has already been delayed twice by the courtscoming up on April 15, there's little time left.",
    "Meanwhile, Anchorage Assembly member Chris Constant kicked off a campaign against Young back in February; Constant would be the state's first gay member of Congress, while Sattler and Notti would be the first Alaska Natives to serve there.",
    "? MD-Gov, MD-AG: The Maryland State Education Association, which is the state's largest teachers union, has backed former nonprofit head Wes Moore in the July Democratic primary for governor and Rep. Anthony Brown for attorney general.",
    "Attorneys General\n? TX-AG: Incumbent Ken Paxton's allies at Defend Texas Liberty PAC have released a survey from CWS Research that shows him beating state Land Commissioner George P. Bush 59-30 in the May 24 Republican primary runoff.",
    "? NV-04: Air Force veteran Sam Peters is spending $51,000 on his first ad for the June Republican primary, which touts his endorsements from Arizona Reps. Andy Biggs and Paul Gosar, two of the far-right's loudest members of Congress.",
    "The Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Lamborn, who, unlike Williams, decided to collect signatures in order to advance to the primary (we explain Colorado's ballot access laws here), had also planned to compete at the convention, also known as the party assembly.",
    "Among independents, the most notable new arrival was former state Rep. Andrew Halcro, an ex-Republican who last took a close third in the 2015 race for mayor of Anchorage; like Notti, Halcro is only running in the special.",
    "The filing deadline for the regular election is June 1, so anyone who wants to replace Young for more than just a few months will need to file before they learn how they did in the first round of the special election.",
    "The 1st has traditionally been based on the state's conservative Eastern Shore, but Democrats sought to make it bluer by having it leap over the Chesapeake Bay to take in some areas around the capital of Annapolis.",
    "House\n? AK-AL: Candidate filing closed Friday for the June 11 top-four primary to succeed the late Republican Rep. Don Young, which will make this the first election in American history to use this voting system.",
    "The ad highlights the wretched condition of the state's economy four years ago, with the narrator describing, \"A reckless tax experiment left Kansas with huge budget deficits and dangerously underfunded schools.\"",
    "The one Democrat in the running is businessman Dustin McCormick, who likewise faces no intra-party opposition in the regular May primary to take on Republican state Rep. Sharon Cooper in the new version of HD-45.",
    "The GOP side also includes businessmen Matt Stoll and Michael Maher, as well as businesswoman Elizabeth Heng, who challenged Democratic Rep. Jim Costa in the 2018 race for the old 16th District and lost 58-42.",
    "Howey Politics reported last week that former Rep. Mike Sodrel has spent $81,000 on TV so far while Army veteran Stu Barnes-Israel has dropped $58,000, but there's no word yet on how much Houchin is spending.",
    "The now-discarded map, by contrast, would have created seven Democratic seats and one Republican district that might have been competitive in future years but would likely have stayed in GOP hands this fall.",
    "Those sorts of parochial interests, rather than purely partisan gerrymandering, were the key reason why Maryland's districts were so distorted for so long, making them the target of endless national mockery.",
    "The 8th in particular is far more compact: The previous version ran from the northern edge of the District all the way to the Pennsylvania border; now it's wholly within Montgomery County, just outside D.C.",
    "\"However, as the Party Chairwoman, I will not let any person besmirch our Party's good name nor attack the tireless volunteers who have served so honorably to ensure our efforts are successful in November.\"",
    "For Maryland's six other Democrats, their chances of being re-elected remain unchanged, since Biden would have won all of their seats by anywhere from 20 points (the 2nd) to more than 80 points (the 4th).",
    "And in a true blast-from-the-past, Friday also saw the return of Emil Notti, who lost a tight special election to Young in 1973; Notti, who is 89, said he would only run in the special election, though.",
    "Mayors\n? Milwaukee, WI Mayor: Milwaukee holds its nonpartisan special election Tuesday to succeed longtime Mayor Tom Barrett, who resigned late last year to become Joe Biden's ambassador to Luxembourg.",
    "Acting Mayor Cavalier Johnson took first place in the first round in February with 37%, while former Alderman Bob Donovan, who is the rare conservative politician in this blue municipality, earned 27%.",
    "The 5th, meanwhile, abandons the contorted fist it jabbed into the College Park area but still retains a less flagrant northern extension into whiter portions of Anne Arundel County around Fort Meade.",
    "The Downballot\nFollowShare\n0:0042:30\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\n? MD Redistricting: Democratic lawmakers in Maryland struck a deal on redistricting with Republican Gov.",
    "Several notable names entered the race on the final day of qualifying including, to our surprise, Sarah Palin, who earned an endorsement Sunday from fellow former reality TV show star Donald Trump.",
    "As a result, the state will use a map this year featuring six safely Democratic seats, one safely Republican district, and one Democratic-leaning constituency that could be vulnerable in November.",
    "John Carney has signed a bill that lawmakers recently passed making minor adjustments to Delaware's new legislative maps that officials say will improve the efficiency of election administration.",
    "Previously, for many decades, these three districts all shared pieces of the city of Baltimore, Baltimore's northern suburbs, and Baltimore's southern suburbs, in various tortured configurations.",
    "However, that event was overshadowed by ugly intra-party fighting in the days before between Lamborn and El Paso County party chair Vickie Tonkins, whose county makes up most of the 5th District.",
    "The four candidates who take the most votes regardless of party will face off in an instant-runoff general election on Aug. 16, which is the same day as the state's regularly scheduled primary.",
    "? NV-Sen: Army veteran Sam Brown, who is the underdog in Nevada's Republican Senate primary, emphasizes his biography in his newest commercial, including how \"a Taliban bomb nearly killed me.\"",
    "Garcia is going up against 2020 nominee Sandra Whitten, while Democrats have a far more high-profile duel that same day between conservative Rep. Henry Cuellar and attorney Jessica Cisneros.",
    "? IN-09: State Sen. Erin Houchin uses her opening spot for the May 3 Republican primary to tell the audience, \"After the 2020 election, I wrote the bill to require voter ID for everyone.",
    "Biden took this seat, which includes part of Cobb County in the Atlanta suburbs, 50-49 four years after Trump carried it 54-42; however, Dollar himself won his final term 55-45 in 2020.",
    "It's interesting, then, that the new 5th is considerably whiter: 44% of residents are white and 40% are Black, while under the struck-down map, the district was 41% Black and 36% white.",
    "Meanwhile, Sodrel's trio of ads (here, here, here) tout his \"experience\" in the military and business, though they don't actually mention his one term in the House from 2005 to 2007.",
    "However, he told delegates last week that he wouldn't take part in the assembly because he'd heard about \"troubling irregularities\" that showed that party officials favored Williams.",
    "The ultra-blue 4thone of two Black-majority districts, along with the 7thalso gets much more condensed, squeezed largely into Prince George's County to the city's east and south.",
    "Consequently, Biden's margin would fall from 60-37 to 54-44and Hillary Clinton would have carried this version of the 6th just 47-46, versus 54-40 under the rejected boundaries.",
    "Maher, Stoll, and Garcia are all seeking to challenge Costa for a full term in the new 21st District, while Heng and Hubbard, like Conway, are only competing in this special.",
    "But it was Lamborn's message that brought a furious response from Tonkins, who denied she favored any candidate while also making it clear how little she likes the incumbent.",
    "The field now includes state Sen. Josh Revak and former Interior Department official Tara Sweeney, who each had been co-chairing Young's re-election campaign before he died.",
    "Homebuilder Max Sumner, who had the misfortune of filing at the same time as Palin at the Wasilla branch of the state Division of Elections, is running for Team Red as well.",
    "\"When a politician breaks their word to voters in this way, the Party would normally stay silent and let the campaigns settle the matter,\" she emailed local Republicans.",
    "\"Since 2010, Mo Brooks has been one of the most conservative guys in Washington,\" says the narrator, \"Weak, big spending, open border Republicans, Mo's fought them all.\"",
    "Had Democrats set aside these interests to draw their first map, it may well have survived judicial scrutiny; instead, it took an adverse ruling to get them to do so.",
    "But while none change much politically, almost all shift dramatically in terms of geography, in the service of creating a more compact map that splits fewer counties.",
    "? WI-Sen: Opportunity Wisconsin says it's spending nearly $1 million on a new TV and digital buy that once again portrays Republican Sen. Ron Johnson as self-serving.",
    "The paper described her as \"nearly invisible within the state\" and \"almost entirely absent from Alaska politics\" since her failed turn as John McCain's running mate.",
    "Last year, the Anchorage Daily News sought to figure out what Palin had been up to lately but was rebuffed by the ex-chief executive and everyone in her circle.",
    "The congressman, of course, still doesn't dare criticize Trump on the air, and the spot instead casts him as an enemy of Senate Minority Leader Mitch McConnell.",
    "The 2nd concentrates on Baltimore's northern suburbs, in Baltimore County, while the 3rd is in Baltimore's southern suburbs in Howard and Anne Arundel Counties.",
    "Democratic Rep. David Trone bluntly acknowledged his change in fortunes, saying, \"I don't disagree\" that the new map \"endangers my chance of being re-elected.\"",
    "The GOP field already included former state Sen. John Coghill and businessman Nick Begich III, who was challenging Young before the incumbent died last month.",
    "The race will also feature one of the longest ballots we've seen in quite some time, as 48 candidates will be competing to become Alaska's only House member.",
    "The closest the ad comes to alluding to Trump dumping Brooks is the line, \"But there's a cost of being a true conservative, and the swamp hates Mo Brooks.\"",
    "The prior iteration (just like the one used in the previous decade) reached deep into the liberal D.C. suburbs in Montgomery County, as far as Rockville.",
    "Joe Biden would have narrowly carried this earlier version of the 1st by a 49-48 margin, but the newest map eliminates the arm into the Annapolis region.",
    "But while Palin is still a household name almost 13 years after she resigned as governor, she may have to reintroduce herself to her former constituents.",
    "(Palin, by contrast, did not enjoy a good relationship with the congressman when she was in office: In 2008, she supported the campaign of then-Lt. Gov.",
    "That looming deadline might also impact litigation over the state's legislative maps, which have also been challenged as improper partisan gerrymanders.",
    "To make up the missing population, it absorbs conservative Baltimore exurbs in Harford and Baltimore counties, giving Donald Trump a 56-42 advantage.",
    "Democrats, meanwhile, are fielding Marine veteran Eric Garcia and Lourin Hubbard, who is an official at the California Department of Water Resources.",
    "He continues, \"I promise: I'll join Ohio's own Jim Jordan and other true conservatives in the House Freedom Caucus to fight for what we believe.\"",
    "? TX-28: House Minority Leader Kevin McCarthy has endorsed Cassy Garcia, a former aide to Sen. Ted Cruz, in the May 24 Republican primary runoff.",
    "Laura Kelly aired her first TV spot Saturday during the University of Kansas's Final Four game, and her team says it's part of a six-figure buy.",
    "AdImpact says that Irvin has now spent a total of $13 million, which is far more than the $7.2 million it had tracked through the previous week.",
    "The frontrunner appears to be Republican Connie Conway, a former state Assembly minority leader who is not running for a full term in Congress.",
    "? UT-Sen: Donald Trump has endorsed Sen. Mike Lee, a former critic who reinvented himself as a MAGA lackey, in the June Republican primary.",
    "Barnes-Israel, for his part, declares, \"In Congress today, we have too many career politicians who won't fight and can't fix anything.\"",
    "Already in the race were Al Gross, who was the Democrats' Senate nominee in 2020 and sports an endorsement from former Democratic Gov.",
    "Houchin's commercial comes a few weeks after two of her intra-party foes in this safely red open seat began their own ad campaigns.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "The revamped district doesn't stretch quite so far, instead grabbing up the whole of Frederick County, which had been split.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "I authored the ban on critical race theory and have been the state's number-one defender of our law enforcement officers.\"",
    "Governors\n? GA-Gov: The Atlanta Journal-Constitution reports that the RGA has reserved a total of $5 million to help Gov.",
    "Revak is an Army veteran and former Young staffer, while Sweeney would be the first Alaska Native to serve in Congress.",
    "The voiceover then touts how Kelly was elected and \"brought together Democrats and Republicans to balance the budget.",
    "This is the first survey we've seen here since the first round of voting in early March, when Paxton led Bush 43-23.",
    "The one potentially at-risk Democratic seat, meanwhile, is the 6th District, based in the state's western panhandle.",
    "Brown, whose face remains scarred, continues, \"After 30 surgeries, years of recovery, turns out I'm hard to kill.\"",
    "Another instant-runoff race will take place in November, this time for a full two-year term in the next Congress.",
    "His brother, Jesse Sumner, also put his name forward only to drop out and say his bid was an April Fool's joke.",
    "Sean Parnell, who fell just over 300 votes short of denying Young renomination under the old primary system.)",
    "That lone Republican seat is the 1st District, currently held by Rep. Andy Harris, a leading election denier.",
    "On the Democratic side, the new candidates include state Rep. Adam Wool and former state Rep. Mary Sattler.",
    "(Also, at least in the YouTube version of his spots, his narrator has quite the distracting booming voice.)",
    "Tony Knowles, and Jeff Lowenfels, a former oil executive who is a longtime gardening columnist for the ADN.",
    "Altogether there are 16 Republicans, six Democrats, and 26 hopefuls unaffiliated with either major party.",
    "Meanwhile, state Sen. Valerie Foushee has earned an endorsement from 1st District Rep. G.K. Butterfield.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nWe open our mailbag and answer your questions!",
    "But Palin, who announced only an hour before filing closed, was far from the only new GOP arrival.",
    "But if you want a proven conservative that will fight and win, then I'm your man.\"",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Most notably, almost all of the city of Baltimore is now concentrated in the 7th.",
    "Brian Kemp fend off former Sen. David Perdue in the May 24 Republican primary.",
    "If no one wins a majority of the vote, a runoff would take place on May 3.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "The 2nd, 3rd, and 7th in the Baltimore area all undergo major surgery.",
    "Fully funding our schools, fighting for a tax cut for every Kansan.\"",
    "The campaign says the spot is running as part of a six-figure buy.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "The winner will be up for a full four-year term in 2024.",
    "The D.C.-centric 4th, 5th, and 8th also get a makeover.",
    "Larry Hogan (R) and legislative Democrats agreed on.",
    "You can find the very long list of contenders here.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Redistricting\n? DE Redistricting: Democratic Gov.",
    "The new congressional map that Maryland Gov.",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "(Sorry, Kerry Bentivolio fans.)",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "? KS-Gov: Democratic Gov.",
    "Daily Kos is different.",
    "(Hilarious, we know.)",
    "Please read it."
  ]
}