{
  "id": 233,
  "mediaId": 33,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Obama and Romney are back, and show how American politics have changed for the worse",
  "image": "https://www.i.cdn.cnn.com/.a/2.287.3/assets/video_pinned_white_bg.jpg",
  "link": "https://www.cnn.com/2022/04/06/politics/barack-obama-mitt-romney-washington/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Stephen Collinson",
  "authorUrl": "https://www.cnn.com/profiles/stephen-collinson",
  "termIds": [
    805,
    1147,
    1577,
    2087,
    2303,
    2371,
    2429,
    2465,
    3094,
    428,
    2957
  ],
  "sentences": [
    "But as much as anyone might want to believe it, with Russia's atrocities in Ukraine and the Republican Party fully signed up to ex-President Donald Trump's democracy threatening authoritarianism, the good old days are far from back -- and they weren't that great anyway, as anyone who remembers the fierce feuds over passing Obamacare and government shutdowns of that era will remember.",
    "Proving that the bar can always be lowered in Washington, Arkansas Sen. Tom Cotton -- one of several senators who used the Jackson hearings to highlight his potential presidential ambitions -- suggested the first Black woman nominated to serve on the nation's top bench would have been lenient on Nazis.",
    "Obama's faith in the American system seemed a little archaic at a time when that democracy is under mortal threat from Trump's lies about election fraud -- and the ex-President's apparent new campaign for a second term that would surely be even more authoritarian and unhinged than his first.",
    "In another sign of its twisted sense of right and wrong, the House GOP is already threatening to use its possible new majority next year to kill the Select Committee probing a far greater transgression, Trump's incitement of the Capitol insurrection on January 6, 2021.",
    "On Tuesday, Trump acolyte Republican Rep. Matt Gaetz of Florida berated Defense Secretary Lloyd Austin, warning that the chaos of the Afghan withdrawal and Russia's invasion of Ukraine happened because the US military studied \"wokeism\" instead of strategy.",
    "Obama made his first post-presidential trip to the White House Tuesday and showed he'd not lost a political step, telling demoralized Democrats -- worried about a possible midterm election shellacking -- to buck up and remember what political power is for.",
    "Former President Barack Obama and ex-Republican presidential nominee Mitt Romney -- two old rivals who waged a tough election campaign that year -- are creating a fleeting vision of what even a marginally functioning Washington might look like.",
    "\"It feels like the good old days,\" beamed President Joe Biden in the East Room of the White House, where cheers for Obama lifted the gloom of Democrats at an event promoting the current White House's expansion of the Affordable Care Act.",
    "Now, he might just be their best Republican friend in Washington -- and the fact that in the space of 10 years he could go from leading his party to being a dissident from its Trump-era extremism shows just how much the GOP has changed.",
    "Gaetz's histrionics were a classic example of a new breed of lawmaker who uses their platform to create viral media moments designed to animate the unhinged theories of conservative news, rather than to build a legislative career.",
    "Washington is meanwhile still reverberating with a bizarre episode triggered by Republican North Carolina Rep. Madison Cawthorn's claim he was invited to an orgy and saw leaders in the nation's anti-drug fight snorting cocaine.",
    "Like Rep. Liz Cheney of Wyoming and Rep. Adam Kinzinger of Illinois, the former GOP nominee is also one of the few in his party to call out Trump's extremism, in the knowledge that he is ostracizing himself from his own party.",
    "Misinformation, conspiracy theories, lies, culture wars and barely concealed racism now dominate Washington -- and, judging by recent events, are seen by an increasing number of lawmakers as a ladder to power.",
    "He recalled the struggles the pair had fought together to finally pass the Affordable Care Act, which secured health insurance for millions of Americans for the first time after it was signed into law in 2010.",
    "His outburst came in a week when Republican senators re-upped their slander of Jackson, painting her as an enabler of sex offenders, despite a sentencing record as a judge that is well within the mainstream.",
    "While she's almost certain to be confirmed, Jackson's treatment highlighted how the process of installing a new associate justice on the Supreme Court has become a vicious political play for base voters.",
    "The ex-President seemed to be talking directly to his party, which has been riven by divides among progressives and moderates that have stalled Biden's ambitious social spending and climate change plan.",
    "When Romney was running to deprive Obama of a second White House term in 2012, Democrats lambasted the Republican nominee and former venture capitalist as a heartless corporate raider with no soul.",
    "Romney -- whom no one would mistake for a liberal -- explained that after spending time with Jackson, he changed his mind about her ahead of her expected confirmation vote in the Senate this week.",
    "He added, \"If you're persistent -- if you stay with it and are willing to work through the obstacles and the criticism and continually improve where you fall short, you can make America better.",
    "But two people close to Obama later told CNN's Jeff Zeleny it had been a slip of the tongue, and not how Obama had intended to begin his remarks touting the legacy of the Affordable Care Act.",
    "The presidential burden of responding to Vladimir Putin's atrocities, the raging tempest of rising inflation and a likely midterm election hammering by Republicans, now rests with Biden.",
    "As was often the case while he was president, Obama's eloquence framed the choices for his party in simple but compelling language as he laid out a mission statement for the midterms.",
    "In a Senate speech, Cotton referenced former Supreme Court Justice Robert Jackson who was the top prosecutor at the Nuremberg trials of Adolf Hitler's subordinates after World War II.",
    "Ivanka Trump was testifying to the House committee, as members try to establish how much she knows about her father's thwarting of the US tradition of peaceful transfers of power.",
    "He is leading a compromise drive to secure $10 billion in funds for a new Covid-19 relief plan that the White House believes is needed to stave off any future wave of the virus.",
    "\"But what the Affordable Care Act shows is that if you are driven by the core idea that, together, we can improve the lives of this generation and the next,\" Obama said.",
    "Obama, instantly at ease back behind the presidential seal on Biden's podium, gently mocked his former vice president over his aviator sunglasses and love of ice cream.",
    "He plans to break with most of his GOP colleagues and vote for Supreme Court nominee Judge Ketanji Brown Jackson based on the throwback rationale that she's qualified.",
    "But the moral courage that Romney is demonstrating late in his career is showing that the caricature Democrats created of a man without a soul was deeply unfair.",
    "That a former first daughter's appearance before such a body is now considered perfectly routine is a sign of how mind-bogglingly warped Washington has become.",
    "And given Trump's racist birtherism campaign against his predecessor, there's even less of a chance that Obama would have shown up to any such event.",
    "But Romney is the administration's best hope for getting the Republican support that would be needed to force any eventual deal through the Senate.",
    "Obama's swipe at his rival in a presidential debate that \"the 1980s are now calling to ask for their foreign policy back\" dripped with sarcasm.",
    "Romney is also in the thick of a bid to forge a compromise on Covid-19 funding, for which he's earned some rare praise from the White House.",
    "His support for Jackson recalled a time -- not too long ago -- when presidents could expect broad support for their Supreme Court nominees.",
    "The House GOP declined to censure members for attending white supremacist rallies or for whitewashing Trump's coup attempt from history.",
    "\"I'm outside the arena, and I know how discouraged people can get with Washington -- Democrats, Republicans, independents,\" Obama said.",
    "Romney's corporate conservatism and rich man's ethos were fair game for the Obama campaign in rough and tumble politics a decade ago.",
    "Obama used that experience as a parable to urge Democrats not to give up on reform -- even if it falls short of initial aspirations.",
    "He began his speech by addressing his host as \"Vice President Biden\" before quickly correcting himself, saying, \"That was a joke!\"",
    "There was never a chance that Trump would have had him back for the traditional unveiling of a former president's portrait.",
    "Yet Obama also had the luxury Tuesday of walking out of the White House and taking off the tie he said he now rarely wears.",
    "\"You know, the last Judge Jackson left the Supreme Court to go to Nuremberg and prosecute the case against the Nazis.",
    "Meanwhile, Romney -- now a Utah senator -- is suddenly turning into an old school Capitol Hill powerbroker.",
    "But subsequent events, especially the invasion of Ukraine, showed that Moscow remains a top US adversary.",
    "He said that while he doesn't expect to agree with Jackson on everything, he will join Republicans Sens.",
    "The congressman earned a rebuke because he embarrassed his colleagues in front of their constituents.",
    "It had been more than five years since he walked out the front door under the North Portico.",
    "Obama was not the only White House powerbroker back on Washington's center stage on Tuesday.",
    "The plan strips funding for global vaccination drives that could snuff out future variants.",
    "Romney has also been getting kudos lately for warning in 2012 that Russia was America's No.",
    "Democrats and Republicans argue about who put ideology at the center of the process.",
    "She's also a highly qualified, intelligent, capable person,\" Romney told reporters.",
    "Susan Collins of Maine and Liza Murkowski of Alaska in supporting her nomination.",
    "In his own way, Romney is also standing up for a functional brand of politics.",
    "And in a country as big and as diverse as ours, consensus never comes easily.\"",
    "Obama is set to speak about misinformation in a Chicago speech on Wednesday.",
    "This Judge Jackson might have gone there to defend them,\" Cotton said.",
    "Still, if things were bad back then, they are indisputably worse now.",
    "But the process has become so politicized that's no longer the case.",
    "But it has now become the primary driver of confirmation hearings.",
    "Romney also delivered another gift to the White House this week.",
    "\"I became convinced that she's within the mainstream.",
    "You can have an impact on millions of lives.\"",
    "\"Progress feels way too slow sometimes.",
    "But it did draw the line at Cawthorn.",
    "Victories are often incomplete.",
    "Romney once led his party.",
    "1 \"geopolitical foe.\"",
    "Now he's an outlier."
  ]
}