{
  "id": 2380,
  "mediaId": 124,
  "date": "3/1/2022 12:00:00 AM",
  "headline": "Biden's State of the Union checklist expands from economy to Covid and war in Europe",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_05/3533520/220204-joe-biden-cs.jpg",
  "link": "https://www.nbcnews.com/politics/meet-the-press/biden-s-state-union-checklist-expands-economy-covid-war-europe-n1290351",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2426,
    2426,
    2087,
    2087,
    428,
    428,
    143,
    143,
    600,
    600,
    2959,
    2959,
    2942,
    2942,
    2862,
    2862
  ],
  "sentences": [
    "Jobs for Our Future PAC dropped a new ad on the airwaves in Pennsylvania yesterday, where a narrator claims, Political tourists are parachuting into Pennsylvania, pretending to be conservative, but there's only one real conservative in this race who actually lives here.?\nThey applaud Bartos for helping small businesses survive the pandemic and claim, We can trust Jeff Bartos to stand up to China, take on Biden and crack down on illegal immigration.?\nThe group has so far spent over $565,000 in the state on radio and TV ads, according to AdImpact.",
    "NEW: WH is updating its own COVID protocols, ending mask requirement for fully-vaccinated employees starting Tuesday, per internal email obtained by @nbcnews\n Mike Memoli (@mikememoli) February 28, 2022\nThat's the number of times that Biden mentioned Russia in last year's address to Congress (not including an additional passing reference), noting his retaliation for Russian election interference and cyberattacks, while also adding the administration can cooperate when it's in our mutual interest.\"",
    "That is perhaps the president's biggest challenge heading into his first State of the Union address  with Biden facing low approval ratings, trying to reboot his domestic agenda, touting positive economic numbers but also responding to rising inflation, and attempting to galvanize the democratic world against Russia's invasion of Ukraine.",
    "Democrats tried and failed to pass legislation on Monday that would codify abortion rights into federal law, raising the stakes for the Supreme Court as it weighs the future of Roe vs. Wade and adding to the likelihood the issue looms large over the midterms.",
    "TV personality Mehmet Oz and former hedge fund manager Dave McCormick are still throwing punches in the Republican primary for Senate in Pennsylvania, but now they're facing attacks from another front  an outside group backing businessman Jeff Bartos.",
    "Biden State of the Union address to focus on Ukraine, US economy, pandemic\nMarch 1, 202203:23\nWe get why Biden appears to be opting to deliver a more traditional State of the Union instead of one more targeted to speak to what's happening in Ukraine.",
    "Texas-35: Former Austin City Councilmember Greg Casar (a member of the Democratic Socialists of America), state Rep. Eddie Rodriguez and former San Antonio City Councilmember Rebecca Viagran are the top Dem candidates in this safe Dem district.",
    "Texas-8: Eleven Republicans are vying to replace retiring Rep. Kevin Brady, R-Texas, but the two main ones are veteran Morgan Luttrell (twin of the Lone Survivor, Marcus Luttrell) and conservative activist Christian Collins.",
    "Other numbers you need to know today:\n$1 million: How much the Biden-aligned Building Back Together group is spending on an ad campaign aimed at boosting the administration's economic message around the State of the Union.",
    "Ohio Republican Matt Dolan is shaking up the state's crowded GOP Senate primary with his deep pockets and refusal to join other candidates trying to cozy up to former President Donald Trump, NBC's Henry Gomez reports.",
    "Texas-15: In this potential GOP pick-up district, the Republican race is between Trump-backed Monica de la Cruz and Mauro Garza, while the top Dem candidates are Ruben Ramirez, Eliza Alvarado and Michelle Vallejo.",
    "31: The number of Democratic members of the House who aren't running for re-election, after Florida Rep. Ted Deutch announced Monday he will resign in the fall to lead the American Jewish Committee.",
    "Elsewhere on the campaign trail, two top Democratic governors called on the party to move past process debates and focus on empathizing with voters and touting their accomplishments.",
    "But the risk of trying to doing it all  with the pomp and circumstance that a State of the Union address provides  is that it feels out of touch with the war in Ukraine.",
    "Greg Abbott has faced a challenge from his right, but polling (as well as Abbott's considerable war chest) suggests he'll clear the 50 percent needed to avoid a runoff.",
    "Texas-28: It's Democratic incumbent Rep. Henry Cuellar (who's had to deal with an FBI raid on his home) versus progressive challenger Jessica Cisneros in South Texas.",
    "North Carolina Republican Rep. Madison Cawthorn is back to running in the 11th District (his home district) after previously planning to run in a different district.",
    "His campaign says it will be staying up on TV through the May 17 primary,? although early reports from AdImpact show just $16,000 booked as of Tuesday morning.",
    "And there are plenty of Democratic constituency groups who want the president to press ahead with the agenda formerly known as Build Back Better.",
    "A reminder: If no primary candidate gets a majority of the vote (50 percent +1), then the Top 2 finishers will compete in a May 24 runoff.",
    "14: The number of Republican House members who are retiring, after Pennsylvania Rep. Fred Keller announced he won't run for re-election.",
    "The earliest that NBC News' Decision Desk will make a call is when all polling places in that jurisdiction are closed  so at 9:00 p.m.",
    "During a wide-ranging conversation at the Democratic Governors Association's meeting in Florida, DGA vice chair and New Jersey Gov.",
    "GOP leaders denounced Reps. Marjorie Taylor Greene, R-Ga., and Paul Gosar, R-Ariz.  for speaking to a group of white nationalists.",
    "A new poll from Milwaukee Bucks executive and Democratic Senate candidate Alex Lasry shows he's catching up to Wisconsin Lt. Gov.",
    "His top opponents are George P. Bush (Jeb's son), former state Supreme Court Justice Eva Guzman and Rep. Louie Gohmert.",
    "Roy Cooper said that when you're frustrated and angry, you blame the guy at the top.? Read more on the MTP Blog.",
    "If Ukraine has changed Biden's presidency, will we be able to look back on this speech as reflecting the moment?",
    "WASHINGTON  If it's Tuesday ... President Biden delivers his State of the Union address beginning at 9:00 p.m.",
    "Attorney General: But will Trump-endorsed incumbent Attorney General Ken Paxton escape a runoff?",
    "... Cities in Ukraine come under intense shelling as Russian military convoy moves toward Kyiv.",
    "Phil Murphy said the party was late on inflation,? while DGA chairman and North Carolina Gov.",
    "One other dynamic to watch in the Lone Star State: the impact of the state's new voting law.",
    "Keller was redistricted into a member-on-member primary against Republican Rep. Dan Meuser.",
    "The Atlantic profiles Arizona Secretary of State and gubernatorial candidate Katie Hobbs.",
    "Americans say they're more worried about inflation and the economy, according to polls.",
    "The GOP primary for the open Pennsylvania Senate seat is turning into a battle royale.",
    "Mandela Barnes, though Barnes still has an advantage, NBC's Natasha Korecki reports.",
    "NBC's Jane C. Timm reports that thousands of ballots are at risk of being rejected.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "ET for all statewide races and 8:00 pm ET in most congressional districts.",
    "ET in most of the state that's in the Central Time Zone, and at 9:00 p.m.",
    "Also, polling places in Texas close at 7:00 p.m. local  so at 8:00 p.m.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Expect Russia to come up quite a few more times Tuesday night.",
    "Covid is still here, despite the declining Omicron cases.",
    "Among the races we're watching today:\nGovernor: GOP Gov.",
    "And rise to the moment of the war playing out in Europe?",
    "ET in the sliver of the state that's in Mountain Time.",
    "Pennsylvania Democratic Senate hopeful and Lt. Gov.",
    "John Fetterman is launching his first TV ad.",
    "...  Texas holds its primary contests.",
    "Kim Reynolds gives the GOP response.",
    "That's Biden's tall order tonight.",
    "But first: Can Biden do it all?",
    "... And it's Fat Tuesday.",
    "In a single speech?",
    "... Iowa Gov.",
    "...",
    "ET."
  ]
}