{
  "id": 245,
  "mediaId": 43,
  "date": "4/2/2022 12:00:00 AM",
  "headline": "DKos Asheville Open Thread: He just can't stop",
  "image": "https://images.dailykos.com/images/1055020/story_image/DKCawthornorgysnark.jpg?1648862691",
  "link": "https://www.dailykos.com/story/2022/4/2/2089604/-DKos-Asheville-Open-Thread-He-just-can-t-stop",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    821,
    1039,
    1197,
    1248,
    1609,
    2303,
    2341,
    3085,
    3094,
    2834,
    2903
  ],
  "sentences": [
    "Madison Cawthorn vows to keep talking about Republican cocaine use and orgies\nDaily Kos, Hunter, 3/31/2022\nRepublican lawmakers have pointedly defended all manner of grotesque behavior from their leaders and each other in the past year, from international extortion to open white nationalism to calls for violence to intentional hoax-premised propaganda to showing up to a House hearing fiddling with a handgun to the outright attempt to stage a government-toppling coup.",
    "Daily Kos coverage\nAs Republicans fret over Cawthorn's drugs and orgies revelation, Trump gives him a platform\nDaily Kos, Kerry Eleveld, 4/1/2022\nAfter sleeping through four years of Donald Trump, a raft of colleagues cozying up to white nationalists, and a homegrown coup attempt directed at the U.S. seat of government, Republicans finally found something to care about when one of their own cast their party as a drug-laden, orgy-hungry group of scoundrels.",
    "Morning Digest: Why GOP leaders finally want to boot Madison Cawthorn (it's not really about orgies)\nDaily Kos Staff, 4/1/2022\n? NC-11: Sen. Thom Tillis announced Wednesday that he was endorsing state Sen. Chuck Edwards' campaign to defeat freshman Rep. Madison Cawthorn in the May 17 Republican primary, saying the next day that the incumbent \"has fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics\nCNN, Melanie Zanona, Manu Raju and Alex Rogers, 3/31/2022\nSen. Thom Tillis of North Carolina is throwing his weight behind a primary opponent to freshman Rep. Madison Cawthorn  an extraordinary broadside against a fellow Republican from his home state, as internal frustration with the controversial MAGA firebrand reaches a boiling point.",
    "Embattled Madison Cawthorn lands 'special guest speaker' slot at Trump rally as NC GOP tries to oust him\nRaw Story, Brad Reed, 4/1/2022\nEmbattled Rep. Madison Cawthorn (R-NC), who drew a rebuke from multiple members of his own party this week after he leveled baseless allegations that they regularly held cocaine-fueled orgies, is getting a lifeline from former President Donald Trump.",
    "Madison Cawthorn ridiculed by GOP lawmakers behind his back at fundraiser: report\nRaw Story, Tom Boggioni, 4/1/2022\nRep. Madison Cawthorn (R-NC), who is already reeling from a public rebuke from House Minority Leader Kevin McCarthy (R-CA) over his tales of cocaine-fueled orgies among Beltway conservatives, is now reportedly being mocked behind his back by some of his GOP colleagues.",
    "He has lied about getting accepted into the United States Naval Academy; he's lied about his own friend's responses to the car accident that left him without use of his legs; he's lied about training for the Paralympics; he's lied about running a racist websitethere are only so many semicolons one can use before running out of runway with Madison Cawthorn's lies.",
    "Chris Burns, the treasurer and public relations contact for Friends of the Ecusta Trail, said they were alerted by attendees of a March 22 meeting of the Buncombe County Republican Men's Club, that Cawthorn \"called the Rails-to-Trails Conservancy with reference to the Ecusta Trail as a communist activity, or communist project, is what it was called.\"",
    "During last week's confirmation hearing for Ketanji Brown Jackson, the first Black woman nominated to the Supreme Court, the nation bore witness to a grotesque display of Senate Republicans openly pandering to QAnon, a large and growing cult of Donald Trump fanatics who claim that Democrats are blood-drinking pedophiles who worship Satan.",
    "Other GOP lawmakers who are at their wits' end with Cawthorn are considering endorsing one of his primary foes, according to multiple sources familiar with the discussions, amid growing concerns that the North Carolina Republican is dragging down the entire party with his problematic behavior.",
    "'He's lost my trust': Kevin McCarthy implies Madison Cawthorn lied about salacious tales  and warns of consequences\nRaw Story, Sarah K. Burris, 3/30/2022\nRep. Madison Cawthorn (R-NC) didn't comply with President Ronald Reagan's 11th Commandment about never speaking ill of his own party.",
    "It comes down to focus on the district, producing results for the district, and in my opinion, Mr. Cawthorn hasn't demonstrated much in the way of results over the last 18 months,? Tillis told CNN, describing why he is backing state Sen. Chuck Edwards in his primary against Cawthorn.",
    "Matthew Chapman, 3/30/2022\nOn Wednesday, Axios Raleigh's Lucille Sherman reported that Rep. Madison Cawthorn (R-NC) appears to have lost the institutional support of two of North Carolina's most powerful Republican officials  who are now backing a primary challenger.",
    "His most recent claims, made on a video podcast called Warrior Poet Society, is that Washington, D.C. operatives he has looked up to? his whole life are morally bankrupt, doing key bumps? of cocaine in front of him, as well as inviting him to orgies at their homes.",
    "Republicans freaking out about Madison Cawthorn'sallegations of 'cocaine' and 'orgies'\nDaily Kos, Walter Einenkel, 3/29/2022\nOver the weekend, Rep. Madison Cawthorn made news once again for saying something relatively egregious about his fellow members of Congress.",
    "This news comes just after Cawthorn was chastised by GOP leader Kevin McCarthy (R-CA) called him out for falsely accusing his fellow Republicans of inviting him to orgies, and after Sen. Thom Tillis (R-NC) openly endorsed Cawthorn primary opponent Chuck Edwards.",
    "Ecusta Trail advocates 'shocked' at Rep. Cawthorn's alleged 'communist' comments\nWLOS Asheville, Anjali Patel, 3/30/2022\nA spokesperson for the Friends of the Ecusta Trail says they are \"shocked\" by comments allegedly made by Rep. Madison Cawthorn recently.",
    "This time, instead of slandering Speaker Nancy Pelosi, or lying about himself and his own (lack of) achievements, Rep. Cawthorn made the claim, in a recorded interview, that people he had looked up to? invited him to sexual get together[s]? at their homes.",
    "According to a report from Politico, the freshman lawmaker has already alienated Republicans in his home state by jumping from district to district in an effort to get re-elected and now, after he made his orgy claims, has few defenders in Congress.",
    "Madison Cawthorn turns his slander onto the Republican Party\nDaily Kos, Walter Einenkel, 3/28/2022\nAny story written about Republican Rep. Madison Cawthorn of North Carolina must begin with the continent-sized caveat that Cawthorn is a liar.",
    "On Wednesday, Axios Raleigh's Lucille Sherman reported that Rep. Madison Cawthorn (R-NC) appears to have lost the institutional support of two of North Carolina's most powerful Republican officials  who are now backing a primary challenger.",
    "As Politico's Olivia Beavers wrote, Cawthorn showed up at a fundraiser on Wednesday night for Harriet Hageman, who is opposing Rep. Liz Cheney (R-WY) for the GOP nomination for Wyoming's one House seat after being endorsed by Donald Trump.",
    "Meanwhile, Moore's candidacy for Congress was thwarted after Cawthorn decided he was jumping over to run in the newly drawn 13th District, where Moore was running, even though it doesn't share much territory with his current district.",
    "Madison Cawthorn changes cocaine and orgy allegations in heated meeting with GOP leader McCarthy\nDaily Kos, 3/30/2022\nOver the last week, Rep. Madison Cawthorn of North Carolina has made waves by making some pretty outrageous claims.",
    "The two most powerful North Carolina Republicans in the state legislature  Senate leader Phil Berger and House speaker Tim Moore  are headlining a fundraiser for Edwards on Thursday, according to the Edwards campaign.",
    "House Minority Leader Kevin McCarthy (R-CA) announced that he would be speaking with Cawthorn after his tell-all conversation about \"orgies\" and officials fighting the drug war while also \"doing a bump of cocaine.\"",
    "GOP gets a taste of its own medicine as Madison Cawthorn's cocaine-and-orgies brouhaha blows up their QAnon plan\nSalon, Amanda Marcotte, 3/31/2022\nIt would be funny if it weren't so deeply evil.",
    "As reported by journalist Ben Jacobs, Cawthorn on Friday was announced as a \"special guest speaker\" during a Trump rally that's scheduled to take place next week in Selma, North Carolina.",
    "Even for those who had no doubt that the GOP is a party of shameless liars and bullies, their behavior at Jackson's confirmation hearing was gross to the point of shocking.",
    "\"But in our view, if you attack the Rails-to-Trails Conservancy, you're attacking the organization that does nothing but advocate for rail banking and Rails-to-Trails.\"",
    "\"Whether you make reference to his comments were specifically about the Rails-to-Trails Conservancy or Friends of the Ecusta Trail, that's to be decided,\" Burns said.",
    "We offer this space every weekend to share what we're up to in Western North Carolina and to give readers a variety of links to local and regional news of interest.",
    "DKos Asheville and other local and state groups can give us all a better sense of connection, a better understanding of who we stand with, work with and share with.",
    "Daily Kos fights for a progressive America by empowering its community and allies with information and tools to directly impact the political process.",
    "McCarthy said Wednesday that Madison \"has lost my trust is gonna have to earn it back,\" Axios congressional reporter Alayna Treene quoted on Twitter.",
    "Instead, Cawthorn yucked it up with an associate on camera about how Washington, D.C., is nothing more than a over-sexed version of \"House of Cards.\"",
    "In the process, they subjected Jackson to a vicious smear campaign implying that she has some special fondness for child molesters.",
    "Another blow for Madison Cawthorn as NC GOP officials will join fundraiser for his primary challenger\nRaw Story.",
    "But Rep. Madison Cawthorn's claims of cocaine use and orgies in the Republican halls of power have set them off.",
    "Oh, without taking a breath, he also claimed some Congressperson did a key bump of cocaine? in front of him.",
    "As is his special talent, Cawthorn has been recorded saying these things with his own mouthevery time.",
    "I have a feeling there will be a lot of news from both of these characters in the foreseeable future.",
    "We hope this local and wider community can help leverage our orange passion for progressive politics.",
    "x\nAs Sherman notes, both of these officials have obvious reasons to support Cawthorn's opponent.",
    "But, like all bullies, Republicans proved themselves to be incredibly thin-skinned this week.",
    "#CocaineOrgy stories follow, but before we get started, Madison hates everything.",
    "This is the weekly DKos Asheville Open Thread for Saturday, April 2nd, 2022.",
    "Digby's Hullabaloo- April 1, 2022\nGood day and welcome to DKos Asheville.",
    "Please jump the fold for links to weekly stories I hope you find useful.",
    "Burns said they verified the congressman's comments with several people.",
    "Madison Cawthorn takes the spotlight back this week from Mark Meadows.",
    "Thanks for reading and contributing, I hope your weekend is safe.",
    "\"And I laid out to everything that I find is unbecoming.\"",
    "Republicans can dish it out but really can't take it.",
    "(This, needless to say, is absolutely false.)",
    "Edwards is a Senate colleague of Berger.",
    "And Tillis may not be alone.",
    "He's a pathological liar.",
    "It's a fool.",
    "It's April.",
    "It's both."
  ]
}