{
  "id": 246,
  "mediaId": 881,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "T.W.I.S. Notes",
  "image": "https://video-images.vice.com/articles/62470a604a7f38009cb04beb/lede/1648827309302-ap17215667534036.jpeg?crop=1xw:0.8444096950742768xh;center,center&resize=20:*",
  "link": "https://www.vice.com/en_us/article/wxdaqq/the-call-logs-the-cover-ups-and-the-smoke-swirling-around-trump",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1609,
    1609,
    1237,
    1237,
    1147,
    1434,
    1434,
    2155,
    2155,
    1147,
    830,
    830,
    376,
    376,
    2672,
    2672
  ],
  "sentences": [
    "If Dr. Eastman and President Trump's plan had worked, it would have permanently ended the peaceful transition of power, undermining American democracy and the Constitution.? - U.S. District Judge David O. Carter, ruling that Eastman's emails must be turned over to the January 6 Committee.",
    "I can see a scenario where violence erupts on January 6 and those around Trump say, This is bad; we better stay off the official phones.? It's bad, but it doesn't necessarily say they knew the violence was coming.",
    "POLITICO\nBy signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "It says that odds are these were all destroyed or circumvented, and that we somehow have to be able to track exactly what Trump was doing during those hours, who he was talking to, where all this was happening.",
    "This week's GOP Senate primary debate in Wilberforce, Ohio, was a cavalcade of stolen-election nonsense as former state treasurer Josh Mandel, Yale-educated, venture capitalist-funded populism enthusiast J.D.",
    "But for 457 minutesmore than 7 hours in the late morning and afternoonwhile a violent mob raged on Capitol Hill seeking to overturn the election on Trump's behalf, the White House call logs contain nothing.",
    "The main issue (in addition to a lot of other ethical gripes about Thomas' failure to report income from Ginni's conservative advocacy) is that he didn't recuse himself from Jan. 6related rulings.",
    "Navarro has refused to answer his subpoena, even though he's written a book and is doing near-constant media appearances, where he's more than happy to talk about his Green Bay Sweep? coup plan.",
    "And U.S. District Judge David O. Carter ruled that Trump more likely than not? committed felony obstruction and led a conspiracy in trying to disrupt Capitol Hill proceedings on Jan. 6.",
    "Look at Peter Navarro's statement that, yes, they were trying to get Mike Pence to overturn the election but they were not happy about the violence because it created problems for them.",
    "Because if you have a grand jury subpoena these people, they have one of three choices: Either they tell the truth, take the Fifth, or they go to jail for not cooperating at all.",
    "The Justice Department's criminal investigation of Jan. 6 appears to be expanding beyond just the rioters who stormed the Capitol and those who allegedly conspired with them.",
    "What does an investigator say to themselves when a witness not only threatens other potential witnesses but is also included in the period of time that we're talking about?",
    "Because Rep. Liz Cheney voted for impeachment and is investigating Jan. 6, more than 50 of her House GOP colleagues attended a D.C. fundraiser for her primary opponent.",
    "VICE News' Liz Landers ran into Cruz Thursday and asked if he spoke to his old pal John Eastman about the outcome of 2020. Call the press office? is all Cruz would say.",
    "Shouting Thomas!?\nA handful of Democrats are calling for Justice Clarence Thomas to resign after reports of his wife's text-based coup cheerleading surfaced last week.",
    "Scavino and Navarro made This Week in Subpoenas news by each getting slapped with a criminal contempt citationa TWISSY Award, if you willfrom the January 6 committee.",
    "You try and trace it through that means, you talk to the people around them to find out what he was doing, and who he was talking to and how he was talking to people.",
    "The DOJ investigation has also broadened to people involved in the scheme to produce and submit fake elector slates from seven swing states to the National Archives.",
    "And what the evidence from the January 6 committee shows is that what he did in Georgia was part of the bigger piece, trying to overturn a free and fair election.",
    "Roger Stone is in close touch and coordination with Oath Keepers, some of whom are indicted for sedition now, with a couple of them cooperating, I'd remind you.",
    "We talked potential cover-ups, burner phones, and why Akerman believes that the key to prosecuting Trumpif it ever happenslies not in Washington but in Georgia.",
    "The Trumpist Republican Party is an institution built on respect for the rule of law, defense of democratic values, and, above all, the sanctity of elections.",
    "The governor there is expected to sign a bill that makes threatening or intimidating election workers punishable by up to a year in jail and $6,200 in fines.",
    "Wilberforced to choose  Just ask Mo Brooks: If Trump's primary endorsement is up for grabs, jumping through the Big Lie hoop is the only stunt that matters.",
    "Look at Trump's tweet from December 19 that's getting more attention now, where he says Jan. 6 is going to be wild? and the guys on the far right light up.",
    "This is the broader coup plot beyond the riot, and that could be bad news for former Trump aides like Navarro, Dan Scavino, Mark Meadows, and many others.",
    "That's why that is the best chance any prosecutor has at this point in time, given the state of the evidence, to convict Trump beyond a reasonable doubt.",
    "I wanted to know what the gap in the Trump White House's phone records says about ongoing investigations into the attempt to overturn the 2020 election.",
    "It's obvious that not having these people put into a grand jury is a big downside here, where witnesses, including lawmakers, can be forced to testify.",
    "The January 6 committee hasn't talked to Cruz yet, but he fostered the plan every step of the way, including while violence was raging on the Capitol.",
    "Meanwhile, a grand jury has issued subpoenas for information from at least one organizer of the rally that preceded the Jan. 6 attack on the Capitol.",
    "How 'bout some good news  While election workers face threats and intimidation by the thousands, a few states are trying to do more to protect them.",
    "You've got Trump on tape trying to interfere with that election, and trying to importune people in power to basically make up another 11,780 votes.",
    "Now, investigators are gathering evidence pointing to government officials and others who may have conspired to obstruct the electoral vote count.",
    "Protect ya tech  Hackers tried to breach the email accounts of election officials in at least nine states last October, the FBI warned this week.",
    "Speaker Nancy Pelosi made some folks mad this week when she said it's on Thomas to decide his own recusals, which, short of impeachment, is true.",
    "Read up on the clutch of Michigan conspiracists who showed uppacking gunsat a tiny rural township office and got access to its voting tabulators.",
    "Read David Gilbert's great VICE News coverage on how busy Dan Scavino was, and still is, stoking QAnon support as Trump's social media director.",
    "In September 1973, Watergate investigators were stunned that tapes from a secret Oval Office recording system had an 18-and-a-half-minute gap.",
    "You received the White House call logs, you look at them, and oh gosh, there's nothing from 11:17 a.m. to 6:54 p.m. What does that say?",
    "I think part of the problem that the public hasand it's partly fueled by the pressis that these things are looked at through blinders.",
    "Nick Akerman's wishfor a grand jury in Washington to look at members of Trump's orbit who helped plan the coupmight be coming true.",
    "Apparently none of the attempts had much impact, but the FBI is concerned enough to issue an alert in advance of the 2022 midterms.",
    "The feds are asking state officials to get their guard up for phishing attacks and other attempts to compromise election security.",
    "Read up on just how far Sen. Ted Cruz went to aid Trump's coup plot, along with a lawyer he's known for 27 years one John Eastman.",
    "You think that's a more important case than a potential federal conspiracy-to-obstruct charge other former prosecutors talk about.",
    "New bills in Maine, New Mexico, Minnesota, and Washington are looking to increase protections, while Oregon has gone the furthest.",
    "But the idea that Justice Thomas should recuse himself from any future Jan. 6 or presidential election cases has broader support.",
    "I never thought I'd be investigating a president of the United States trying to orchestrate obstruction of justice in Watergate.",
    "The committee also wants to ask about a bonkers Oval Office meeting where Kraken? figures like Sidney Powell, Michael Flynn.",
    "It would, as an investigator, make me dig in that much more knowing that there's a good likelihood of something to uncover.",
    "I'm not the first to say that this gap in the Trump White House phone records all feels very 18 and a half minutes? to me.",
    "I called up Nick Akerman, a former assistant U.S. Attorney who helped prosecute Watergate conspirators from 1973 to 1975.",
    "Meanwhile, Trump son-in-law and Qatar national lottery winner Jared Kushner met remotely with the committee yesterday.",
    "Insult Heidi Cruz, and her husband may work tirelessly to keep you in power despite losing a presidential election.",
    "Speaking of Kevin McCarthy, last year he publicly threatened companies that cooperate with the January 6 committee.",
    "It's worth remembering that Carter issued his ruling after reading the 100 or so of Eastman's emails in question.",
    "And that's what shows his criminal intent in Georgia and obliterates any kind of defense about his state of mind.",
    "Armed and confused  A lot of people, including me, missed this insane story when it came out a couple weeks ago.",
    "There's a lot of smoke there that Donald Trump knew about the violence, that he knew it was going to be violent.",
    "And that's the kind of stick that ought to be behind this thing, because now we're at a pretty critical point.",
    "Navarro dressed down an aide for admitting the gang, including Overstock.com CEO Patrick Byrne, into the Oval.",
    "I never thought I'd be talking about burner phones and the president of the United States with a prosecutor.",
    "It's possible Trump officials caused the gap through incompetence and recklessness and not corruption alone.",
    "Whether the widening scope includes nongovernmental plotters like Rudy Giuliani or Steve Bannon is unclear.",
    "John and Ted's bogus journey\nInsult Jada Pinkett Smith, and her husband might smack you on live television.",
    "Eastman was Donald Trump's attorney, but privilege doesn't apply if a crime or fraud is being planned.",
    "John Eastman's long battle to hide his coup-oriented emails behind attorney-client privilege is over.",
    "The resignation demands won't go anywhere, nor will the handful of calls for Thomas to be impeached.",
    "And you're right, they're just gonna argue Oh, we didn't make any calls.? But we know he made calls.",
    "Given how batshit the stuff is, this otherwise unlikely cross-species appeal is probably accurate.",
    "Nick Akerman said it best: There's a lot more that's going to be uncovered before we're finished.",
    "Remember, this DOJ investigation is separate from the one the January 6 committee is conducting.",
    "If the gap in the phone records was the only thing we had, that would be a crazy thing to say.",
    "Let's look at the context and what other things they've done to create the violent situation.",
    "The committee is reluctant to subpoena lawmakers who were talking to Trump during this time.",
    "There ought to be a grand jury investigation being conducted by the Department of Justice.",
    "Vance, and a field of others hoped to boost Trump's disinformation enough to get his nod.",
    "Gilbert writes that Scavino's posts are both catnip and dog whistles for the QAnon cult.",
    "And that feels a lot more important now that McCarthy's own calls are in the gap period.",
    "It's all to cover up Trump's involvement in the violence that occurred on Capitol Hill.",
    "And the people around Trump are doing everything they can to keep him away from that.",
    "Take me inside the mind of an investigator, Watergate-style, or even January 6-style.",
    "Navarro's claiming executive privilege that the executive branch says doesn't exist.",
    "FRONTLINE / PROPUBLICA\nInside Pence-world's preparation for a Jan. 6 legal showdown.",
    "It looks like the criminal contempt citations will be on the House floor next week.",
    "The problem is once you destroy the records, you don't know what's on there, right?",
    "There's no better evidence for a prosecutor than having your defendant on tape.",
    "Phones could be a big factor in the Fulton County, Georgia, investigation too.",
    "That comes pretty close to trying to intimidate witnesses in an investigation.",
    "Former President Donald Trump made a lot of calls on the morning of Jan. 6.",
    "And there's a lot more that's going to be uncovered before we're finished.",
    "That person's got something to hide and they're trying to keep it hidden.",
    "Attendees included Rep. Madison Cawthorn and GOP leader Kevin McCarthy.",
    "All of what I just described works with people who have phone numbers.",
    "This is why the subpoenas of telecom company records are so important.",
    "But once you know who those people were, you get their phone records.",
    "It really comes up to the point of whether it's witness-tampering.",
    "Cover-up? is a heavy term, especially coming from a guy like you.",
    "So now the January 6 committee knows whatever Carter read there.",
    "The whole point of a burner phone is that it's not traceable.",
    "What he's doing is providing an excuse, an alibi for Trump.",
    "To put this in context of everything else that's going on.",
    "So there's a history that as an investigator you look at.",
    "And we know he also has a history of destroying records.",
    "The guy is very purposeful about covering his tracks.",
    "That's where this is going, if you put it in context.",
    "It's not just an isolated incident of phone records.",
    "And this brings me back to another important point.",
    "We know he's ripped up records in the White House.",
    "WASHINGTON POST\nThe plot to overturn the election.",
    "Then it's on to the DOJ for possible prosecution.",
    "So what does the public really need to know here?",
    "I think the committee already knows some of that.",
    "and others urged Trump to seize voting machines.",
    "That's why I think there's a lot more to this.",
    "Biden delivers a clarion call for democracy.",
    "Our conversation has been edited for length.",
    "Because we know he talked to Kevin McCarthy.",
    "And he called some other people in Congress.",
    "Sign up your friends for Breaking the Vote!",
    "But I think it's all for the same purpose.",
    "He also made a lot of calls that evening.",
    "We know he put stuff down the toilet.",
    "But you have to view it in context.",
    "It's a lot more than 18 minutes!",
    "But Akerman doesn't think so.",
    "Why had the tape been erased?",
    "That's the case I'd go with.",
    "History does repeat itself.",
    "So we know he made calls.",
    "So what can I tell ya?",
    "It says the obvious.",
    "Now bring it home.",
    "How did he do it?",
    "He was helpful?!",
    "That's a crime.",
    "April Fools!!!",
    "It's not easy.",
    " Just what?",
    "What?"
  ]
}