{
  "id": 248,
  "mediaId": 151,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Cloud of notoriety builds over Cawthorn after sex-and-drugs claims",
  "image": "https://www.politico.com/dims4/default/92a5f38/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fd1%2Fd2%2F137123c94624802f271b95d44d1a%2Fcongress-divided-republicans-53919.jpg",
  "link": "https://www.politico.com/news/2022/03/31/cloud-of-notoriety-builds-over-cawthorn-builds-as-sex-and-drugs-comment-00022162",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2341,
    2341,
    821,
    821,
    1147,
    2303,
    2303,
    1501,
    1501,
    1147,
    1248,
    1248,
    1609,
    1609,
    428,
    428
  ],
  "sentences": [
    "I'm looking at somebody who is going to best represent [Western North Carolina], and I've concluded Mr. Cawthorn is not that person,? Sen. Thom Tillis (R-N.C.) said in a brief interview, adding that he's endorsed an incumbent's primary challenger for the first time in my political career  because I feel that strongly about it.?\nIt's rare for Republican lawmakers, particularly from the other side of the Capitol, to repudiate a member from their own party.",
    "Not everyone in the GOP is prepared to turn on Cawthorn, despite a string of recent missteps that range from charges for driving with a revoked license to describing Ukrainian President Volodymyr Zelenskyy as a thug.? Some Republican colleagues privately express sympathy for a younger man they believe is beginning to crack, citing his recent divorce and personal struggles, including the car accident that left him using a wheelchair.",
    "In one email to supporters, he began: I will never bow down to the mob.?\nAnd he published a new campaign ad on Thursday, claiming: The radical left, the establishment, and the media want to take me down  I'm not going anywhere.?\nIn this case, of course, those taking shots at him are members of his own party.",
    "Among the Cawthorn statements and decisions McCarthy took issue with in private, according to one Republican, were the freshman's false claim that McCarthy gave Cawthorn the green light to roll out his own New Contract with America? legislation even as the full conference works on its own policy platform.",
    "| Andrew Harnik/AP Photo\nBy Olivia Beavers\n 03/31/2022 06:44 PM EDT\nUpdated: 03/31/2022 08:27 PM EDT\nRep. Madison Cawthorn showed up in person for a primary challenger to one of his House GOP colleagues Wednesday night  just as fellow Republicans started suggesting he's the next incumbent under threat.",
    "One North Carolina Republican, addressing the Cawthorn scandal on condition of anonymity, said it is unclear if his constituents will even see -- let alone believe -- media reports on the matter, noting that the primary is weeks away and that it will likely take money to inform district voters.",
    "But when you're in Congress, you should respect the institution, and you should focus on the work that you should do.?\nMcCarthy met with Cawthorn in his office on Wednesday morning for roughly 30 minutes, POLITICO first reported, along with House Minority Whip Steve Scalise (R-La.)",
    "And my cringes are no different from your cringes when your members suggest that members of Congress  and particularly on your side, the implied suggestion is [members] are engaged in sex orgies and cocaine doing.?\nSo we got [cringes] on both sides,? he concluded.",
    "Publicly, McCarthy blasted Cawthorn to a group of reporters, citing some of the same antics that Tillis did and warning that the North Carolinian could lose his committee assignments or face other punishments, like getting moved to less-desirable panels.",
    "He has attracted a host of primary challengers, including Edwards and Michele Woodhouse, yet could prove hard to beat  he has high name ID in the district and enough grassroots support that he was able to overcome a Trump-backed opponent in 2020.",
    "During a House Judiciary subcommittee hearing Thursday on qualified immunity for law enforcement, Rep. Steve Cohen (D-Tenn.) sought to undercut GOP attacks that Democrats support defunding the police by subtly invoking Cawthorn.",
    "Two Republicans familiar with what was discussed at the meeting, speaking candidly on condition of anonymity, said McCarthy didn't limit his dressing-down of Cawthorn to the podcast interview behind the latest controversy.",
    "After riding out multiple waves of mini-controversies over past comments and behavior, he now seems doused by a political tsunami after alleging on a podcast that some of his colleagues attend orgies and use cocaine.",
    "The sit-down followed complaints among colleagues that Cawthorn unfairly maligned the entire conference as sexual deviants after making his wild claims of witnessing cocaine use and getting orgy invitations.",
    "A third person familiar with the discussion said Cawthorn tried to claim he didn't use the word orgy,? upon which the GOP leaders in the room pointed to the tape where he in fact used the word.",
    "According to that Republican, Cawthorn clarified that multiple members were not involved in orgies but did maintain that one member of Congress invited him to a sex party with his wife.",
    "That Republican said McCarthy pressed Cawthorn on his allegations  saying that if he had made such statements under oath, he would have treaded into even more dangerous waters.",
    "The former president and Cawthorn are close and have attended fundraisers together, though Trump has yet to offer a statement revealing his position on this latest scandal.",
    "House Minority Leader Kevin McCarthy has already chastised Cawthorn this week, raising real questions about whether the 26-year-old's own party will try to take him down.",
    "The North Carolina conservative appeared alongside other House Republicans at a fundraiser for Harriet Hageman, the Trump-backed opponent of Rep. Liz Cheney (R-Wyo.).",
    "Even so, last quarter he also showed a propensity to burn through campaign funds, spending more than he raised and ending with less than $300,000 cash on hand.",
    "It's not clear if Cawthorn knew how conspicuous that choice was, with Republicans still seething over his claims about sexual perversion? in Washington.",
    "Though it's too early to determine if this is the case with Cawthorn, some Republicans say Trump himself is a wild card who may weigh in on the matter.",
    "But he's unbowed, with one prominent ally who insisted on anonymity saying that old party hands are seizing on Cawthorn's remarks to nudge him out.",
    "And sometimes efforts by the GOP establishment to rebuke a conservative candidate can hand that Republican a rallying cry for the party base.",
    "And Cawthorn's own GOP colleagues spent some of the fundraiser, feet away, quietly joking at his expense, according to people in the room.",
    "If his leaders had hoped Cawthorn would calm the storm by issuing a clarification of his comments, he did the opposite on Thursday.",
    "Republicans have long sought to tie Democrats to that line, while most of them  aside from progressives  have kept their distance.",
    "Realistically, Tillis' endorsement of his GOP opponent aside, it is unclear if Cawthorn's notoriety will hurt him back home.",
    "Tillis also issued a vocal endorsement Thursday of state Sen. Chuck Edwards as the best Republican alternative to Cawthorn.",
    "A spokesperson for Trump, who's set for a North Carolina rally on April 9, did not return a request for comment.",
    "Despite McCarthy and others in the room pressing him to reveal a name, Cawthorn refused, this Republican said.",
    "I cringe  when our members talk about defunding the police,? said Cohen, addressing Republicans on the panel.",
    "The Constitution gives you the age when you can serve in Congress,? McCarthy told reporters on Wednesday.",
    "His district, which includes the western tip of the state, changed only marginally in redistricting.",
    "The GOP consensus is that Cawthorn's behavior, no matter his age or position, remains unacceptable.",
    "Meanwhile, Democrats may be bit players in the Cawthorn drama, but they're certainly tuning in.",
    "Alex Isenstadt, Ally Mutnick, Burgess Everett and Marianne LeVine contributed reporting.",
    "The uncomfortable moment illustrates the awkward position Cawthorn now finds himself in.",
    "), who was assigned to be a mentor to Cawthorn at the start of this Congress.",
    "But none of his colleagues appear willing to defend him publicly, either.",
    "Former President Donald Trump still carried it by 10 points in 2020.",
    "Rep. Madison Cawthorn at the Capitol on May 14, 2021.",
    "and Rep. Mike Johnson (R-La."
  ]
}