{
  "id": 2614,
  "mediaId": 43,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "Majority Savers: Please Support Cheri Beasley!",
  "image": "https://images.dailykos.com/images/1065304/story_image/beasley1.jpg?1651542229",
  "link": "https://www.dailykos.com/story/2022/5/7/2095428/-Majority-Savers-Please-Support-Cheri-Beasley",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    729,
    995,
    1136,
    1569,
    2087,
    2140,
    2226,
    2303,
    2347,
    447,
    2602
  ],
  "sentences": [
    "I stopped by Chavis Community Center this morning with Curt and our son Matthew to cast our ballots (and get a selfie with our stickersgg) pic.twitter.com/9FU8fCtFs4\n Cheri Beasley (@CheriBeasleyNC) April 28, 2022\nYou can also follow her on Facebook at CheriBeasleyNC\nYou can follow him on Instagram at cheribeasleync\nFinally, you can choose to visit her campaign site, cheribeasley.com, which is probably the best way you can volunteer for her campaign at this time!",
    "Smaller cities  Asheville, Piedmont Triad, Fayetteville, Wilmington: These areas lean democratic or are swing areas in the state, and it is important that we either win them or run up the score as high as we can to offset what could easily be a slow motion collapse in the rest of the state.",
    "Elections History\n2016 Senate: Richard Burr (R-inc) 51.0%, Deborah Ross (D) 45.3%\n2020 President: TFG (R-inc) 49.9%, Joe Biden (D) 48.6%\n2022 Race Rating: Leans Republican\nFor a very long time after Reconstruction, North Carolina was an integral part of the Solid South.",
    "Justice for ALL: The very first issue she mentions on her issues page is the fact that she constantly pushes to make sure that marginalized people and communities have access to justice and fairness when compared to the bigwigs who often buy their own justice.",
    "Good news on the fundraising front:\nx\nNBC News: Democrat Cheri Beasley raised more from April 1-27 for the U.S. Senate race in North Carolina than the entire Republican field combined.",
    "Rural Areas Between Charlotte/Piedmont Triad/Research Triangle: These regions of the state abandoned us long ago, and we need to keep down the margins as much as possible.",
    "Eastern Coast: This is retiree country, and also growing ever more conservative as military veterans move here to be near the huge bases in southeastern North Carolina.",
    "City of Charlotte and Mecklenburg County: Again, with a large and diversifying city and suburbs trending our way, it is imperative that we do exceptionally well here.",
    "Through violence, intimidation, and laws such as poll taxes and grandfather clauses, the white ruling class ruled Jim Crow era North Carolina with an iron fist.",
    "Republicans started winning House seats in the 1960's, and the odious and overt racist Jesse Helms came to ensconce himself in a Senate seat starting in 1972.",
    "No doubt the GOP will attack her record as a Justice and especially as a public defender, much like they attacked the record of Justice Ketanji Brown Jackson.",
    "She was elevated to the Supreme Court later on and won re-election in 2014 when most other Democratic candidates in the state were losing their elections.",
    "North Carolina was solidly Republican after that, and through attrition we lost many House seats  though the other Senate seat was salvaged for a while.",
    "In presidential elections, the best way to describe the state is a pink swing state, where we just cannot seem to find enough votes to win each time.",
    "Things began to change in North Carolina when the Yankees invaded (their version, not mine) the Research Triangle and the Charlotte metro area.",
    "Health Care: Beasley supports abortion rights, as well as making sure that people have access to quality health care no matter their zip code.",
    "Thank you for taking the time to read about our challenger for the North Carolina Senate seat, former NC Supreme Court Justice Cheri Beasley!",
    "Perhaps someone more in tune with North Carolina can explain why this region went from decent support for Obama to strong support for Trump.",
    "Research Triangle: We need gangbusters turnout in Raleigh, Durham, and Chapel Hill if we are to have any chance of winning statewide again.",
    " Kyle Griffin (@kylegriffin1) May 6, 2022\nDONATE TO CHERI BEASLEY HERE\nIf social media is more your thing, you can follow her on Twitter.",
    "Lumbee Tribe/Sandhills Region: This area trended sharply to the right under Trump, and I doubt they are coming back to us any time soon.",
    "There was just enough residual conservative Democratic support plus new arrivals for Obama to win the state in 2008 in a mild shock.",
    "Undoubtedly shaped by her experience as a public defender, Beasley will continue this pursuit of fairness and justice as a Senator.",
    "Hagan lost her Senate seat in 2014, and our candidate couldn't keep it in his pants in 2020 in an attempt to recapture that seat.",
    "In Quarter 1, Cheri Beasley raised $3.66 million, which is a decent start but not enough for a larger state like North Carolina.",
    "Sadly, other than with governor Roy Cooper and judicial races, Democratic candidates have not had success statewide since 2008.",
    "Former Chief Justice Cheri Beasley\nCandidate Background\nI do not intend to write her entire biography, which you can read here.",
    "If you want to find my previous entries in this series, I recommend following me or searching for Majority Savers? as a tag!",
    "Her twin sons needed plenty of care at birth, so she personally knows what it is like to wrangle with insurance companies.",
    "But I will make some points that I feel helped shape her to be an excellent candidate for North Carolina's Senate seat.",
    "She wants to expand the ACA and Medicaid, and especially tackle the high cost of prescription drugs in this country.",
    "Luckily, the area is primarily rural, but that just means that the GOP can count on a lot of votes from this region.",
    "There is also a key House race in this area, which I will cover once the primary election has decided the candidate.",
    "Eastern Plains Black Belt: This area has been shrinking in population for decades as rural black voters move away.",
    "We need more positive faith leaders in our country, and maybe religion wouldn't have as bad a name on this site.",
    "The goal of this series is to highlight races that may make or break our current slender majorities in Congress.",
    "That means I will start more with incumbent Senators and House members until some primary elections are settled.",
    "Signature Issues\nCheri Beasley does not have a DW nominate score, as she does not have a Congressional record.",
    "Notice that the faith is a positive one that builds people up instead of a hateful one that tears people down.",
    "She has about $5.14 million cash on hand, which is again a decent start but her GOP rivals combined have more.",
    "It is definitely a difficult race to win, but with everything on the line now we cannot afford to ignore it.",
    "North Carolina has a PVI of R+3, which means it tends to vote three points right of the median vote spread.",
    "Today, I am focusing on a candidate that can go on the offensive for us and win a competitive Senate seat.",
    "I'd ask you all to respect them as best you can, because these are taking me quite a long time to write.",
    "While the state is very slowly diversifying, the legacy of Jim Crow still puts us behind the eight ball.",
    "She did lose in 2020, but by a mere 400 or so votes when other candidates statewide lost by much more.",
    "The Wilmington Insurrection of 1898 is just one example of a bloody suppression history in the state.",
    "Please go below the fold to read all about Cheri Beasley, who is running for North Carolina Senate!",
    "It is important to get the ones remaining to turnout and support Beasley in order to win the state.",
    "When LBJ pushed through Civil Rights legislation, this image of North Carolina started to change.",
    "West of I-85: These areas (other than Asheville) are the core of the GOP support in the state.",
    "Political Tour of the State\nHere's where races are won for us in the state of North Carolina.",
    "At the same time, the Jesse Helms Senate seat was recaptured by Democratic Sen. Kay Hagan.",
    "This led her to go to college herself and dedicate her life to becoming a public defender.",
    "Previous margins haven't been good enough, so we need more votes and higher margins here.",
    "Her mother became a PhD and university dean at a time when males dominated universities.",
    "She is definitely one who will need your donations if you are the donating cash type.",
    "This doesn't even count the dark money that will flood the race to try and smear her.",
    "If these places turnout at a higher rate than the cities, we are in deep trouble.",
    "We need to scour these counties for every transplant and register them to vote.",
    "Biographical details are a little scarce right now because she is a challenger.",
    "If I have time, I will expand it to governors as well in critical swing states.",
    "Here's where we need to keep the margins down, or we will lose North Carolina.",
    "It seemed like the last hurrah for Democrats when Jimmy Carter won in 1976.",
    "If she wins, she will become the black woman in the Senate from the South.",
    "Like Sen. Raphael Warnock, her faith guides her in many of her decisions.",
    "This is where Madison Cawthorn and other odious representatives are from.",
    "What looked to be a promising state for us has stalled, if not regressed.",
    "Beasley will have her work cut out for her in a voter suppression state.",
    "There is always a need for more of them so she can get her message out.",
    "She became an Appellate Court Judge in 2008 by winning in a landslide.",
    "We don't want these areas to turnout as much as others in the state.",
    "The margins keep growing yet we need to find even more votes here.",
    "I see her fitting in as a liberal right next to Raphael Warnock.",
    "This happened when she moved to Fayetteville, North Carolina.",
    "I will run a new article every Tuesday, Friday, and Saturday.",
    "I have six ground rules behind the philosophy of this series.",
    "Beasley has 22.5K followers on Twitter, which is respectable.",
    "Hopefully this diary inspires you to help her in some way!",
    "If they have high turnout, we are in for a world of hurt.",
    "Welcome to my diary series titled Majority Savers?!",
    "Attempts at forcing out Burr also came up short.",
    "She's a challenger in a state that Trump won.",
    "Please help me fill in what I am missing!",
    "That means Cheri Beasley needs our help!",
    "I'd donate as much as possible to her.",
    "x\nHappy first day of early voting!",
    "I'm all tapped out unfortunately.",
    "Activism  Help How You Can!",
    "Here are my ground rules."
  ]
}