{
  "id": 2615,
  "mediaId": 43,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "The Susan Collinsest Susan Collins That Ever Susan Collinsed",
  "image": "https://images.dailykos.com/images/1067067/story_image/9EE23685-E430-412E-988E-88E19A3901AB.jpeg?1651888565",
  "link": "https://www.dailykos.com/story/2022/5/6/2096457/-The-Susan-Collinsest-Susan-Collins-That-Ever-Susan-Collinsed",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    683,
    1577,
    1577,
    1246,
    1246,
    2034,
    2034,
    200,
    200
  ],
  "sentences": [
    "See, Poots wanted the world to spend three weeks watching his cut-rate military fail and fail and fail to capture the Azovstal steel plant; it serves the nifty dual function of providing endless hours of content documenting senseless civilian suffering, which happens to be the fuel that runs the engine that's been delivering that merciless supply of increasingly-powerful western weapons that keep popping up on the other side of the ol' battlefield, AND advertising the inescapable incompetence of his own forces, as if to demonstrate to the entire world that he is helpless to prevent them from kicking him while he's down, so mired is he in this mess of his own making.",
    "Former Turd Reich Defense Secretary Mark Esper's new book is apparently chock-full of anecdotes about Wee Donnie One-Term trying to get the Pentagon to slaughter people for him, be they peacefully protesting American citizens, or whoever might find themselves on the receiving end of the missiles he proposed lobbing into Mexico, believing evading responsibility for this act of war on a neighboring ally would be as simple as blaming a fart on the dog, or Eric probably, now that I think about it.",
    "Wisconsin's Ron Johnson is like that recurring sitcom character who reliably demonstrates a single predictable behavior, and that behavior is uncritically accepting any and all Covid conspiracy theories, however bizarre and/or imbecilic.? In a truly regrettable coincidence, Johnson's lone other significant trait is that he's one of 100 currently serving United States Senators.",
    "Within the snug, padded confines of the wingnut outrage bubble, (Where YOU'RE always the victim, no matter whose neck your boot is crushing!?) the real scandal here isn't a deranged, illegitimate, theocrat court abusing their purloined authority to steal millions of Americans' rights, in vicious defiance of the public will, but ratherthat the opinion leaked.",
    "She should call it, My Struggul.?\nIn such jet-black times, you gotta take the good news wherever you can find it; in this week's case, in the welcome twist at the end of an otherwise unpleasant headline like, GOP candidate who told women to \"enjoy\" rape suffers surprise loss.?\nLotta magic in those last three words, don'tcha think?",
    "Incidentally, the Senator from Moderate Cloud Cuckoo Land has already announced she won't be backing Senate Dems' reproductive rights bill, offering an unusually insulting bit of swiftly-debunked horseshit as justification, because she's Susan Collins, and these are simply the sorts of things one does when one is Susan Collins.",
    "Speaking of Republican primaries, I see the death cult felt like spicing up the expected slate of Q-addled shitwits,nominating a charming fellow who finds himself currently incarcerated for KILLING HIS CANCER-STRICKEN WIFE with a concrete, gallon-sized flower pot.? Andrew Wilhoite, you're gonna fit right in.",
    "The Failing New York Times debuted an experimental new horror section, publishing a three-part deep dive into Tucker Carlson, the throbbing, acid-spewing tumor at the heart of ascendant American fascism, and the apparatus he uses to spread his infection: the tauntingly Orwellian Fox News Channel.",
    "Sergey Lavrov, who is somehow Foreign Minister of a regime that fancies itself a superpower, figured that what this fraught moment called for was a casual, Look, Hitler was basically Jewish,? no doubt earning himself an amusing little sidebar in the diplomacy school textbooks of tomorrow.",
    "And you gotta love the off-the-record-wink-wink victory lap the Biden Administration is taking over providing the intelligence Ukraine has used to take out Russian generals n' warships n' such; Joe's practically playing why're you hitting yourself? with the big, scary KGB man.",
    "I have to say, there's nothing quite so disturbing as a Republican reveling in his own abuse of power; and of course, punishing so many uppity women all at once, conceivably for generations yet to come, is every religious fanatic's wettest dream made reality.",
    "Well, grab yourself a beer, or a whiskey, or a great big slice of cake, or, I dunno, your favorite tentacle porn video, whatever gets you goin', and let's stare this fucker straight in the eye, if only to let it know we're not afraid.",
    "Greg Abbott's sorry bid for his own fifteen MAGA minutes failed to capture the mob's attention, let alone their adoration, and now he's just the guy who gave some undocumented migrants a bus ride to D.C. at Texas taxpayers' expense.",
    "Now, we've all seen this day coming, and we all knew exactly how Susan Collins would behave when it came, but actually sitting through the obscene spectacle of her sputtering, stupid, self-justifying lies made me puke on my shoes.",
    "I understand that rationality isn't really a thing? on the right these days, but they truly seem to expect folks to docilely accept the steady erosion of their rights by a resentment-fueled, kakistocrat minority.",
    "Here in this childishly scatological blog, we've seen Liar Tuck for the assiduous manufacturer of goose-stepping terrorists he is for a while now, but it's nice to see th'paper of record finally catching up.",
    "And of course, various regional cells of the American Taliban have all sorts of additional legislative vileness on tap, eager to test the limits of this mad new majority's tolerance for authoritarianism.",
    "Governor Janice McGeachin has been having the time of her life, wallowing in the white nationalist hog pen she tripped into a few weeks back, at Nick Fuentes' Grievance Gala for the White and Subpar.",
    "And maybe that's because I just really, really hope it's formally written down somewhere that it's illegal to call up an election official and brazenly ask him to fraudulently alter voting results.",
    "Which is precisely the sort of crap that led to America in the first place, if you think about; congratulations on devolving into a tawdry parody of the villains in your own national founding myth.",
    "Well, let's switch to a lighter topic for a minute, like Ukraine, and the War of Misguided Russian Aggression, where Vladimir Putin's multifaceted master plan gallops along with nary a hitch.",
    "Seems Lauren Boebert has written? a book,? and admit it, you're morbidly curious to witness the contortions this poo-flinging fascist dolt undertakes to craft a hero narrative around herself.",
    "Fortunately, I keep a pair for just such occasions; they were still a bit crusty from that gloaty lecture she delivered when she stuck the nation with Kavanaugh in the first place.",
    "Madison Cawthorn has gotten himself into so much unsettlingly weird trouble, and at such a young age, that I'm honestly starting to feel insecure about my own productivity levels.",
    "I know you're not supposed to have favorites, but of all the legal challenges besieging the nitwit cabal that tried to steal my country, this is the one that holds my heart.",
    "Vance, who, as the sort of fellow who willingly associates with violence-inciting maniacs and child molesters, would, I think, make for a very poor Senator indeed.",
    "You never hear a story about Donald Trump asking if the army could like, cut through all the goddamn red tape and just deliver food to hungry children, y'know?",
    "People who attempt things as foolish and ignoble as mimicking Donald Trump's political tactics shouldn't be in charge because they're shitty, hateful people.",
    "(And may I gently suggest it's in the national interest to get this little Nazi creep the fuck out of Congress before he works his way to the bottom?)",
    "I don't imagine we've seen the last wave of fuckery out of Anti Choicey Barrett and her power-drunk gang of thugs, is all I'm saying.",
    "Meanwhile, the Russian diplomatic corps seems determined to equal the self-destructive incompetence of their comrades in the field.",
    "And I believe there're plenty of opportunities to hang those same three words on a whole bunch of aspiring autocrats this November.",
    "Matt Gaetz and Marjorie Taylor Greene are not, I'm sad to report, behind bars where they belong, but actively campaigning for J.D.",
    "And because we're absolutely going to beat the fuckers, no matter how long it takes, and you're gonna want to be there for that.",
    "Which is why I certainly wish Fulton County District Attorney Fani Willis well with that shiny, new grand jury over in Georgia.",
    "People who make the attempt, and fail as spectacularly as Abbott shouldn't be in charge because they're fucking idiots.",
    "So, I'm guessing by now you've heard about Sammy Alito's little Guess Whose Rights I'm Taking Away This Summeressay.",
    "Congrats on your big primary victory,? J.D., though I imagine that painting in your attic is in rough shape by now.",
    "One obvious thought here is that trigger-happy? is maybe not the best quality for a Commander in Chief.",
    "Wooooooorough one this week, even by the weary, battered standards of the year two thousand twenty-two.",
    "Like, this kid's bucket list is deeeeeeply fucked up, yes, but he's certainly checkin' shit off.",
    "It would be funny, I suppose, if it weren't for all the senseless human suffering she's caused.",
    "One is tempted to suggest that Vlad just isn't sending his best, but he totally is, isn't he?",
    "Slide it into the Friday news dump, everybody just shrugs and moves on to whatever's on HBO.",
    "There doesn't appear to be a solitary strong link in the entire Russian chain of command.",
    "I'm sure there's a third reason Abbott shouldn't be in charge, but do you really need it?",
    "Well, may as well sign up for updates over at showercapblog.com, huh?",
    "Let's sneak up on em while they're measuring the drapes, shall we?",
    "The shittier the human the better, as far as Cult45 is concerned.",
    "Till then, stay safe out there, Resisters\nAre you still here?",
    "Because I guess the plan was to keep the whole thing secret.",
    "Suffers surprise loss.? Say em out loudpretty sweet, huh?",
    "Just periodic, sullen stabs at I Can Haz Secret Police?",
    "Justdon't let the bastards grind you down.",
    "Good luck with your speech, though.",
    "So it's pretty gross out there.",
    "Because they're trying to.",
    "Cool friends, Janice.",
    "Real nice work, kid.",
    "God knows Idaho Lt.",
    "Gonna go great.",
    "Fucking hell.",
    "Quiet, like.",
    "Yeesh."
  ]
}