{
  "id": 2616,
  "mediaId": 43,
  "date": "5/7/2022 12:00:00 AM",
  "headline": "DKos Asheville Open Thread: Cawthorn Roundup, yee haw!",
  "image": "https://images.dailykos.com/images/1067174/story_image/DKCawthornfundingscandal.jpg?1651928017",
  "link": "https://www.dailykos.com/story/2022/5/7/2096499/-DKos-Asheville-Open-Thread-Cawthorn-Roundup-yee-haw",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1270,
    2303,
    183,
    562,
    2697,
    2834,
    2882
  ],
  "sentences": [
    "Sharing Local since 2011\nNorth Carolina's 11th Congressional District election, 2022 (May 17 Democratic primary)\nElections in North Carolina, 2022\nPrimary date: May 17, 2022\nEarly voting starts: April 28, 2022\nEarly voting ends: May 14, 2022\nPoll times: 6:30 a.m. to 7:30 p.m.\nAbsentee/mail-in voting deadline: May 17, 2022\nMadison Cawthorn May Have a New Ethics Violation to Handle\nDaily Beast, Roger Sollenberger, 5/5/2022\nRep. Madison Cawthorn (R-NC) has been embroiled in scandal after scandal.",
    "Cawthorn addresses video released by opposition group showing him naked in bed being crass'\nCNN, Mary Kay Mallonee, 5/5/2022\nAn opposition group that is actively campaigning against Rep. Madison Cawthorn has released a video clip appearing to show the North Carolina Republican naked in bed and, as Cawthorn described it, being crass with a friend? and acting foolish.?\nAfter the video appeared on social media, Cawthorn tweeted, A new hit against me just dropped.",
    "He's twice brought guns to airport checkpoints, allegedly drove without a valid license, made dubious claims of cocaine-fueled orgies, called Ukraine President Volodymyr Zelenskyy a \"thug,\" is facing a congressional financial investigation, and, most recently, appeared in a leaked video depicting the conservative lawmaker naked in bed while simulating sex with another man.",
    "Court mulls ruling that blocked NC Rep. Cawthorn challenge\nAssociated Press, GARY D. ROBERTSON, 5/3/2022\nA federal appeals court on Tuesday questioned whether a lower court got it right when it blocked a challenge of North Carolina Rep. Madison Cawthorn's candidacy by voters who cited a section of the Constitution addressing insurrection as disqualifying him.",
    "Court mulls ruling that blocked NC Rep. Cawthorn challenge\nAssociated Press, GARY D. ROBERTSON, 5/3/2022\nA federal appeals court on Tuesday questioned whether a lower court got it right when it blocked a challenge of North Carolina Rep. Madison Cawthorn's candidacy by voters who cited a section of the Constitution addressing insurrection as disqualifying him.",
    "U.S. Rep. Madison Cawthorn gave cousin $141K in campaign and taxpayer funds, records show\nWRAL, Bryan Anderson, 5/6/2022\nA relative and close adviser to U.S. Rep. Madison Cawthorn has pocketed more than $141,000 from taxpayers and campaign donors since 2020, according to congressional and campaign payroll records.",
    "pic.twitter.com/kDqtzsoquT\n Madison Cawthorn (@CawthornforNC) May 4, 2022\nHe went from being the future of the Republican Party to now an embattled member of Congress, a reckless member of Congress, an immature member of Congress,? said Dr. Chris Cooper, a political professor at Western Carolina University.",
    "Every time I think I can't be shocked that another video comes out, another revelation goes out.?\nDaily Kos Coverage\nNew report reveals Madison Cawthorn likely broke ethics rules with chief of staff's salary\nWalter Einenkel, 5/5/2022\nHypocrisy will come back to bite you every time.",
    "Overpaying a staff member hardly seems like Rep. Madison Cawthorn's biggest scandal these days, but a Daily Beast investigation into Cawthorn's compensation for his chief of staff reveals a cut-and-dried ethics violationone his office appears to have tried (and failed) to skirt.",
    "x\nMadison Cawthorn released a new #CincodeMayo campaign ad and you need to see it #madisoncawthornvideo pic.twitter.com/CnzVxakZ7t\n ALT-immigration Puck Futin gg?gg?gg?gg? (@ALT_uscis) May 5, 2022\nThanks as always for reading and contributing, I hope you have a safe weekend",
    "Voters in Madison Cawthorn's North Carolina district have very mixed feelings about the freshman lawmaker as controversies swirl before his May 17 primary\nBusiness Insider, Camila DeChalus, 5/5/2022\nRepublican Rep. Madison Cawthorn is in trouble.",
    "The documents also show a roughly eight-month period during which the 26-year-old North Carolina congressman paid Stephen Smith, his second cousin, simultaneously from Cawthorn's congressional office and campaign.",
    "Circuit Court of Appeals in Richmond, Virginia, heard arguments in a lawsuit that the first-term Republican congressman filed to derail the formal challenge sent to the State Board of Elections from going forward.",
    "Circuit Court of Appeals in Richmond, Virginia, heard arguments in a lawsuit that the first-term Republican congressman filed to derail the formal challenge sent to the State Board of Elections from going forward.",
    "And some voters preparing to cast their ballots in North Carolina's 11th congressional district, which covers much of the state's western region, have decidedly mixed feelings about Cawthorn's run for reelection.",
    "Madison Cawthorn: US lawmaker 'won't back down' after naked tape leak\nBBC, 5/6/2022\nThe United States' youngest congressman has said he won't \"back down\" after a naked video of him in bed was leaked.",
    "Nonetheless, the payments sharpen the focus on the nature of the relationship between Cawthorn and Smith and raise questions from political observers about the perception of family self-dealing.",
    "These and other recent controversies  yes, there are more  have made Cawthorn a target within his own party ahead of a May 17 primary that could determine his future in Congress, if he has one.",
    "Republicans and Democrats take shots at Rep. Cawthorn over latest video\nWLOS, Samiar Nefzi, 5/5/2022\nCongressman Madison Cawthorn has faced a number of scandals during his bid to be reelected.",
    "I've really never seen the swamp launch such a coordinated attack against any individual in politics except for Donald Trump,? North Carolina's 11th District representative said.",
    "U.S. District Judge Richard Myers ruled for Cawthorn in March and prevented the board from formally examining whether he should remain on ballots, and the voters appealed.",
    "U.S. District Judge Richard Myers ruled for Cawthorn in March and prevented the board from formally examining whether he should remain on ballots, and the voters appealed.",
    "According to filings with the Federal Election Commission, Cawthorn's campaign paid Harp a combined $73,237 in direct payments and payments to his LLC, EMP Strategies.",
    "He beat then-President Donald Trump's endorsed candidate in the Republican primary, and went on to roundly defeat his Democratic rival in the general election in 2020.",
    "We offer this space every weekend to share what we're up to in Western North Carolina and to give readers a variety of links to local and regional news of interest.",
    "DKos Asheville and other local and state groups can give us all a better sense of connection, a better understanding of who we stand with, work with and share with.",
    "Daily Kos fights for a progressive America by empowering its community and allies with information and tools to directly impact the political process.",
    "\"He's dangerous,\" said Philip, a longtime resident of Cawthorn's hometown of Hendersonville, North Carolina, who declined to give his last name.",
    "Just hours following his Twitter post, a video was leaked showing the congressman naked in bed with another person  simulating a sex act.",
    "The Republican, who is up for re-election in North Carolina, was first elected aged 25 - the minimum age for US Congress.",
    "It's the latest controversy for the 26-year-old, who is running for reelection with early voting already underway.",
    "Congressional pay data shows that North Carolina Republican paid his chief of staff, Blake Harp, $131,278 in 2021.",
    "House ethics rules stipulate that senior congressional staff can only earn $29,595 in outside income each year.",
    "There's no timetable on when the judicial panel will rule, but the court did accelerate the appeal process.",
    "There's no timetable on when the judicial panel will rule, but the court did accelerate the appeal process.",
    "LimitReached, 5/5/2022\nBREAKING: Video of Madison Cawthorn Apparently Face-F**king His Cousin Surfaces.",
    "Don't let the swamp of Washington dissuade or distract you from sending a warrior back to Washington.",
    "Cawthorn is one of eight candidates on the May 17 primary ballot for the 11th Congressional District.",
    "We hope this local and wider community can help leverage our orange passion for progressive politics.",
    "Cawthorn is one of eight candidates on the May 17 primary ballot for the 11th Congressional District.",
    "On Wednesday, the freshman congressman released a nearly 8-minute video addressing recent headlines.",
    "When he entered the national political arena, he was seen as a rising star in the Republican Party.",
    "Madison Cawthorn, 26, said the video showed him \"being crass with a friend, trying to be funny\".",
    "U.S. House members are prohibited from hiring immediate family members, such as first cousins.",
    "Yes, Really\nToro Blanco, 5/6/2022\nBefore you go..a little fun on Madison's behalf behind.",
    "Please jump the fold for links to weekly stories I hope you find interesting and useful.",
    "That actually ranks Harp at the low end of compensation for chiefs of staff in Congress.",
    "But this one, while much more traditionally Washington, could still be a problem.",
    "But this one, while much more traditionally Washington, could still be a problem.",
    "\"He has got to get out of here  He has lost a lot of respect in this community.\"",
    "The address matches that of Cawthorn's, state voter registration records show.",
    "Photo: Blake Harp and Madison Cawthorn\nGood day and welcome to DKos Asheville.",
    "It's all Cawthorn again today as he continued to have a busy week in the news.",
    "Years ago, in this video, I was being crass with a friend, trying to be funny.",
    "This is the weekly DKos Asheville Open Thread for Saturday, May 7th, 2022.",
    "Rep. Madison Cawthorn (R-NC) has been embroiled in scandal after scandal.",
    "We will.?\nCNN has not been able to independently confirm the video.",
    "But why he was paid that specific amount could be highly relevant.",
    "The payments were addressed to Smith at a Hendersonville address.",
    "But the requirement doesn't extend to second cousins.",
    "I wanted you to know the truth, straight from me.",
    "Don't lose hope, don't listen to the fake news.",
    "I told you there would be a drip drip campaign.",
    "\"I'm NOT backing down...blackmail won't win.\"",
    "CNN has reached out to Cawthorn for comment.",
    "I've only just begun to fight for you.",
    "x\nI'm ready to keep fighting for you.",
    "\"We were acting foolish, and joking.",
    "The primary will be held on May 17.",
    "We were acting foolish, and joking.",
    "Three judges on the 4th U.S.",
    "Three judges on the 4th U.S.",
    "I'm NOT backing down.",
    "\"It is a shock a day.",
    "Blackmail won't win.",
    "That's it,\" he said.",
    "insurrection.\"",
    "That's it.",
    "Really."
  ]
}