{
  "id": 2620,
  "mediaId": 195,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "The Hill's 12:30 Report  Jobs near pre-pandemic levels",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2020/10/restaurant_hiring_08042020_1.jpg?w=980&h=552&crop=1",
  "link": "https://thehill.com/news/1230-report/3479735-the-hills-1230-report-jobs-near-pre-pandemic-levels-what-a-supreme-court-investigation-will-look-like-worries-for-lgbtq-rights-georgia-campaign-yard-sign-looks-like-fox-news/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cate Martel",
  "authorUrl": "https://thehill.com/author/cate-martel/",
  "termIds": [
    992,
    1024,
    1186,
    1223,
    1879,
    2087,
    2303,
    2411,
    2439,
    2888,
    2942
  ],
  "sentences": [
    "https://bit.ly/3siktUB\nWhat Manchin's been up to: Manchin told reporters this week that his focus is on crafting bipartisan energy legislation, which would center on proposals to incentivize green energy technologies and bolster the fossil fuel industry, and not on moving Biden's most ambitious proposals with a budget reconciliation package.?\nYes, but: [T]he talks over the bipartisan energy bill are at the earliest stages, and the chances of getting a deal are small.?\nMore on how this could play out, via The Hill's Alexander Bolton: https://bit.ly/3siktUB\n? WHAT TO EXPECT IN THE INVESTIGATION OF THE SCOTUS LEAK:\nHere's an explainer from NBC's Pete Williams: https://nbcnews.to/38WMQ3Y\nMadison Cawthorn's Google alerts are having an active week:\nVia The Hill's Emily Brooks, Rep.",
    "An example in a suburb of Kyiv: In one clip, Russian journalists noted that clothing on some dead civilians was too clean to have been in the streets for days, implying they could not have been killed during Russia's occupation.?\nRussia's Defense Ministry said in a statement: All that is irrefutable evidence that the photos and videos from Bucha are yet another staging by the Kyiv regime for the benefit of Western mass media.?\nIn Congress\nLive look at Democrats:\nSen. Joe Manchin (D-W.Va.) is putting his attention into an ambitious bipartisan energy bill, which Democrats are questioning as Manchin's way to stall to avoid discussing President Biden's social spending agenda.",
    "When Psaki will officially pass the torch: May 13\ng? Latest with Ukraine\nPsst, Putin's rumored girlfriend may get sanctioned:\nCNN's Luke McGee reports that Alina Kabaeva, a woman who has previously been romantically linked to Russian President Vladimir Putin, is included in the sixth proposed package of European Union sanctions against Russia  according to two European diplomatic sources.? More from CNN\nKeep in mind: At this stage in the process, names can easily be added or removed from the sanctions list, so nothing is definite.",
    "But an anti-Cawthorn PAC's recent release of videos showing the 26-year-old first-term lawmaker engaging in suggestive and vulgar behavior has pushed him to be more vocal.? More on the controversies\n? A QUICK CATCH-UP  HERE ARE THE TOP MOMENTS ON CAPITOL HILL THIS WEEK:\nhttps://bit.ly/3P39Yyb\ng Latest on COVID\n? BY THE NUMBERS\nCases to date: 81,492,170\nDeath toll: 994,187\nCurrent hospitalizations: 13,281\nShots administered: 577 million\nFully vaccinated: 66.3 percent of Americans\ng?Notable tweets\nIt's a bit familiar.",
    "Some of the measures Democrats are proposing seem more symbolic than substantive.? It may not even change anything in November  here's how\n? DEMS WORRY THEY DON'T HAVE A PLAN TO FIGHT BACK:\nVia The Hill's Morgan Chalfant and Amie Parnes: https://bit.ly/3vRirwQ\n? ARE LGBTQ RIGHTS NEXT?':\nVia Vox's Ian Millhiser: https://bit.ly/3KY4gL6\nIn the White House\nKarine, step right up:\nKarine Jean-Pierre, the current principal deputy White House press secretary, will replace Jen Psaki in the role next week.",
    "Madison Cawthorn (R-N.C.) is speaking out more forcefully against a barrage of negative news stories about him as he tries to hang on to political life less than two weeks before a contentious primary vote with top Republicans in his state working against him.?\nHow so: Cawthorn had largely avoided directly addressing allegations of insider trading, twice taking a loaded firearm to the airport, getting speeding tickets and more.",
    ":\nVia The Hill's Niall Stanage, The initial shock is beginning to fade over reports that the Supreme Court is set to strike down the constitutional right to abortion  but the political battle is only beginning.? https://bit.ly/37pjI58\nThe obstacle for Dems: Democrats, horrified by the likely loss of a right that was enshrined almost half a century ago, are plotting a course ahead, yet the path looks uncertain.",
    ":\nThe Huffington Post's Amanda Terkel tweeted, A bunny  which clearly is an escaped pet bunny  has been running around my parents' backyard trying to make friends with all the wild rabbits.? Photos: https://bit.ly/37mINxz\nAnd to get your weekend off to a great start, here's a dog trying to play it cool.",
    "To view past editions of The Hill's 12:30 Report, click here: https://bit.ly/30ARS1U\nTo receive The Hill's 12:30 Report in your inbox, please sign up here: https://bit.ly/3qmIoS9\n> A midday take on what's happening in politics and how to have a sense of humor about it.",
    ": Despite rising inflation, high gas prices, and a first-quarter decline in economic growth, consumer and business spending have continued to groweven when adjusted for inflation.?\nWhat about the unemployment rate?",
    "More on what this means for the economy, via The Hill's Sylvan Lane: https://bit.ly/3vPEofW\n?TIDBIT:\nThe Washington Post's Heather Long pointed out: Wages are not keeping up with inflation.",
    "What Russians are seeing on TV:\nThe New York Times's Stuart A. Thompson pulled together footage of how Russia is covering the invasion of Ukraine.",
    "The Senate's Monday agenda\ngWhat to watch\n12:15 p.m. EDT: White House press secretary Jen Psaki speaks with reporters aboard Air Force One.",
    "NEWS THIS MORNING\nI love sharing good news:\nThe U.S. added a robust 428,000 jobs in April, according to new data from the Labor Department.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "A point of reference: Economists had expected roughly 300,000 jobs to have been created, so this was a great month.",
    "(The Hill)\nThis is historic: Jean-Pierre will be the first openly gay person and first Black woman in the role (!)",
    "It also means almost all the roughly 21 million jobs lost at the beginning of the pandemic have been recovered.",
    "Livestream\n5 p.m. EDT: Former President Trump holds a campaign rally for Dr. Oz's Senate campaign.",
    "I just can't place it  :\nNPR's Steve Inskeep tweeted a photo of a campaign yard sign in Georgia.",
    "Livestream\n3:45 p.m. EDT: President Biden delivers remarks on the Bipartisan Innovation Act.",
    "That's well below 8.5% inflation in the past year.? https://bit.ly/3kNgfQM\nIT'S FRIDAY.",
    "3 p.m. EDT: President Biden meets with manufacturing leaders in Hamilton, Ohio.",
    "Photo: https://bit.ly/37ld8MS\n?On tap\nThe gist: The House and Senate are out.",
    "I'm Cate Martel with a quick recap of the morning and what's coming up.",
    "Wages are up +5.5% in the past year, according to the Labor Department.",
    "That's just 0.1 percentage point above the level in February 2020.",
    "Livestream\ng? In lighter news\nToday is National Crepe Suzette Day.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "5:30 p.m. EDT: President Biden leaves for Delaware.",
    "11:10 a.m. EDT: President Biden left for Ohio.",
    "g? In the Supreme Court\nFirst stage is denial.",
    "Did someone forward this newsletter to you?",
    "How is inflation affecting this good news?",
    ": It remained unchanged at 3.6 percent.",
    "3 p.m. EDT Monday: The Senate returns.",
    "What's the plan for the anger stage?",
    "Habreaks down crying hysterically.",
    "President Biden is in Ohio.",
    "Make sure your sound is on!",
    "A friendly lil' bun!",
    "It's worth watching.",
    "Sign up here.",
    "Sniff.",
    "Hahah.",
    "Sniff.",
    "*\n*Ha.",
    "Haha.",
    "Haha."
  ]
}