{
  "id": 2628,
  "mediaId": 163,
  "date": "5/6/2022 12:00:00 AM",
  "headline": "Nude video latest scandal turning Republicans against U.S. Rep. Cawthorn",
  "image": "https://www.reuters.com/resizer/ADwhFYR2rFjrl-yvML3r-raMfp4=/1200x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/DL4X57IFIJOL5J3XKIFSFL27B4.jpg",
  "link": "https://www.reuters.com/world/us/nude-video-latest-scandal-turning-republicans-against-us-rep-cawthorn-2022-05-05/",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Morgan",
  "authorUrl": "https://www.reuters.com/authors/david-morgan/",
  "termIds": [
    2341,
    2341,
    2303,
    661,
    661,
    1147,
    1147,
    1943,
    1943,
    2303,
    2091,
    2091,
    1201,
    1201,
    1609,
    1609,
    1605,
    1605,
    1501,
    1501,
    562,
    562,
    428,
    410,
    410,
    428,
    2661,
    2661,
    2590,
    2590
  ],
  "sentences": [
    "Saul Loeb/Pool via REUTERS/File Photo\nWASHINGTON, May 5 (Reuters) - A grainy 28-second video showing a naked young man gyrating against someone in bed amid squeals and laughter was the latest in a string of episodes that has turned Republicans against one of their own: the brash U.S. Representative Madison Cawthorn of North Carolina.",
    "These included Cawthorn's claim of being invited to a cocaine-fueled Washington sex orgy by leaders he respected, two attempts to carry a gun onto an airplane and calling Ukrainian President Volodymyr Zelenskiy a \"thug\" in the midst of a Russian invasion.",
    "Jim Davis, a former Republican state senator who ran against Cawthorn in 2020 and ended up voting for him in a runoff election, said: \"A lot of Republicans think that he's an embarrassment, given the things that he's saying and the things that he's done.",
    "Some Republican voters have embraced the combative styles of extreme personalities such as Trump, Florida Governor Ron DeSantis and U.S. Representative Marjorie Taylor Greene as an antidote to what they view as the excesses of liberal Democrats.",
    "Cawthorn's campaign finances are in the red three weeks ahead of the primary, with debts and obligations more than twice as large as his cash position as of April 27, according to documents filed with the Federal Election Commission on Thursday.",
    "But a poll conducted for the Republican GOPAC Election Fund showed Cawthorn's lead among likely primary voters dropping to 38% in late April from 49% in March, while support for Edwards advanced to 21% from 14%.",
    "But pollsters and strategists said there is a chance the attacks could backfire on his opponents by galvanizing support for Cawthorn, a populist who opposes the Republican establishment.",
    "\"It's going to be a very close election,\" said Republican pollster Glen Bolger, whose firm Public Opinion Strategies has also conducted two surveys for the Edwards campaign.",
    "Tillis, who has endorsed state Senator Chuck Edwards' challenge of Cawthorn, added: \"I just want better representation, better results for people out in the district.\"",
    "The 26-year-old political novice on Thursday slammed the video's release as a \"hit\" and \"blackmail\" against him and said it showed him joking with a friend years ago.",
    "It followed other episodes that have led powerful Republicans such as Kevin McCarthy, the top Republican in the House of Representatives, to break with him.",
    "U.S. Representative Madison Cawthorn (R-NC) arrives to the State of the Union address at the U.S. Capitol in Washington, DC, U.S, March 1, 2022.",
    "As the youngest member of Congress, he has adopted the former president's pugilistic style and won his 2022 reelection endorsement.",
    "The American Muckrakers PAC, dedicated to opposing Cawthorn, released the video this week on the website FireMadison.com.",
    "Cawthorn would be forced into a June runoff election if he failed to garner more than 30% of the vote in the primary.",
    "In addition to the two individuals in the bed, the scene included a wheelchair, which Cawthorn uses, nearby.",
    "Senator Tom Tillis, who is actively working against Cawthorn ahead of a May 17 primary, told Reuters.",
    "The group that released the video online said it depicted Cawthorn, who did not dispute the claim.",
    "Polling data showed that 31% of voters had a very favorable opinion of him last month.",
    "Cawthorn beat a Donald Trump-endorsed Republican in 2020 on his way to Congress.",
    "Years ago, in this video, I was being crass with a friend, trying to be funny.",
    "\"It's possible that he could survive his self-inflicted political wounds.",
    "Tillis described the video as \"absurd to embarrassing.\"",
    "But he's put himself in grave political danger.\"",
    "I told you there would be a drip drip campaign.",
    "It's the totality,\" North Carolina U.S.",
    "The poll has a 4.9% margin of error.",
    "Cawthorn brushed it off on Twitter.",
    "\"A new hit against me just dropped.",
    "We were acting foolish, and joking.",
    "That's it,\" Cawthorn tweeted.",
    "\"It isn't any one thing.",
    "\"I'm NOT backing down.",
    "And I'm one of them.\"",
    "Blackmail won't win.",
    "We will.\""
  ]
}