{
  "id": 2634,
  "mediaId": 129,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Tucker Carlson's Influence on America and Its Media",
  "image": "https://static01.nyt.com/images/2022/04/26/reader-center/02evening-carlson/02evening-carlson-articleLarge-v4.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/05/opinion/letters/tucker-carlson-fox.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    1147,
    1558,
    2030,
    2266,
    2303,
    200,
    296,
    517,
    2590,
    2945
  ],
  "sentences": [
    "If Madison Were Omar \nTo the Editor:\nRe Police Accuse Lawmaker of Trying to Fly With Gun? (news article, April 27), about Representative Madison Cawthorn trying to bring a gun through airport security:\nInstead of this ultraright white man, imagine this story being about another professional American man, this one with swarthy skin and named Omar, who was twice caught trying to bring a loaded gun onto a commercial flight.",
    "To the Editor:\nRe How Tucker Carlson Stoked White Fear to Conquer Cable News? and Tucker Carlson Reshaped Fox News, and Became Trump's Heir? (American Nationalist? series, front page, May 1 and 2):\nCongratulations to The New York Times for an exceptional piece of journalism exposing Tucker Carlson for what he is  an insidious infection coursing through the veins of America.",
    "Vance's Victory, With an Assist From Trump\nTo the Editor:\nRe With Trump's Nod, Vance Rallies to Win Senate Primary in Ohio? (front page, May 4):\nDonald Trump and his minions have turned our political system into a twisted version of The Apprentice,? where the path to elected office begins with a trip to Mar-a-Lago to kiss Mr. Trump's ring.",
    "U.S. Help in Targeting Russian Generals in Ukraine\nTo the Editor:\nI can't help but think that the newsworthiness of this information pales in comparison to the potential harm that its disclosure will cause.",
    "We know that many Republicans privately view Mr. Trump with contempt and understand the danger of his norm-busting antics, yet they continue to sacrifice their values to worship at the altar of Trump.",
    "Deborah Weeks\nNorristown, Pa.\nTo the Editor:\nIs Tucker Carlson the problem, or is it the number of insecure Americans willing to accept and act upon his divisive, hate-filled and false commentaries?",
    "The U.S. is trying very hard to avoid direct involvement in the Russia-Ukraine war and the repercussions that Vladimir Putin would insist on enacting against it.",
    "I haven't read a word of any of your articles about Tucker Carlson because I won't spend a moment of my life to learn more about this awful person.",
    "We are well on our way to minority rule in this country, and Democrats still play by rules that don't seem to apply to Republicans any longer.",
    "Glenn P. Eisen\nHastings-on-Hudson, N.Y.\nTo the Editor:\nI tuned in when Tucker Carlson Tonight? premiered on Fox, in November 2016.",
    "Aaron R. Eshman\nSanta Monica, Calif.\nTo the Editor:\nHas The Times learned nothing at all from the election of the former guy?",
    "The amount of free publicity given to him by The Times as well as other mainstream media helped propel him to the presidency.",
    "Who could have imagined some Republicans praising Russia's aggression, or railing against free trade, a generation ago?",
    "I was stunned that it continued inside for several pages, with an additional exhaustive feature on his show's content.",
    "Marc Bloom\nPrinceton, N.J.\nTo the Editor:\nTucker Carlson is smart, he's funny and he speaks in compound sentences.",
    "Republicans appear willing to do and say anything to grab and hold onto power, no matter the costs to the country.",
    "It's time to get rid of the filibuster so Democrats can make the most of what little power they have left.",
    "Helping cause the deaths of Russian generals could certainly be perceived as having crossed that line.",
    "Vance is the latest beneficiary of this deranged process, despite his previous Never Trump? position.",
    "Mary D. Brown\nKirkland, Wash.\nTo the Editor:\nTucker Carlson: laughing all the way to the bank.",
    "I almost never watch Fox News, so I attributed my attention to the know-thine-enemy factor.",
    "It's what the Democrats are going to do to respond in kind with their own evil geniuses.",
    "To the Editor:\nOn Sunday I was surprised to see a front-page story on Tucker Carlson.",
    "Does The New York Times take that into consideration when releasing such information?",
    "It's been said that the demise of America will come not from without but from within.",
    "Fortunately there are more people in America like Mister Rogers than Tucker Carlson.",
    "Earth to The New York Times and my fellow blue state people: Stop whining.",
    "We know he's an evil genius, a master of propaganda, a liar and a con man.",
    "Have you never heard the saying There's no such thing as bad publicity??",
    "He just says out loud what millions and millions of people are feeling.",
    "We have survived Father Coughlin, Joseph McCarthy and others like them.",
    "Stop offering him what he wants more than anything: attention.",
    "Now you are giving free publicity to a Fox News host.",
    "That's why he has more than three million viewers.",
    "Tucker Carlson Tonight? is my one hour of sanity.",
    "Republicans in Congress: Tucker for president.",
    "Tuckered out, I'm flipping straight to Sports.",
    "Wouldn't that guy be put on the no-fly list?",
    "His audience: cheering like never before.",
    "goons: Write down everything Tucker says.",
    "The issue is not how awful this guy is.",
    "You just gave him another million.",
    "And I have watched him ever since.",
    "This man is a breath of fresh air.",
    "Sandy Treadwell\nOjai, Calif.\nJ.D.",
    "I just opened Monday's Times.",
    "Surprisingly, I read it all.",
    "Faith Frankel\nBoonton, N.J.",
    "Vladimir Putin to his P.R.",
    "He will only get stronger.",
    "There's a word for that.",
    "It's called politics.",
    "He is not going away.",
    "There he is again.",
    "Fox: loving it.",
    "In Ohio, J.D.",
    "Yikes!"
  ]
}