{
  "id": 2644,
  "mediaId": 237,
  "date": "5/4/2022 12:00:00 AM",
  "headline": "Meme coin leader's admission could land Madison Cawthorn in more hot water",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/34994cf/2147483647/strip/true/crop/1024x538+0+72/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fb7%2F1e%2Fcfb669524c8da1d4a144f612519a%2Fap22055834359317.jpg",
  "link": "https://www.washingtonexaminer.com/news/house/meme-coin-leaders-admission-could-land-madison-cawthorn-in-more-hot-water",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Kerr",
  "authorUrl": "",
  "termIds": [
    712,
    773,
    815,
    939,
    1134,
    1147,
    1308,
    1801,
    2001,
    2095,
    2137,
    2148,
    2303,
    428,
    489,
    571,
    613,
    2645,
    2672,
    2791,
    2845,
    2875,
    2972
  ],
  "sentences": [
    "The leader of the \"Let's Go Brandon\" cryptocurrency revealed that Rep. Madison Cawthorn (R-NC) traded the meme coin three weeks before NASCAR driver Brandon Brown announced he had struck a sponsorship deal with the coin, heightening suspicion from watchdogs that the beleaguered congressman may have violated insider trading laws.",
    "Jordan Libowitz, a spokesman for Citizens for Responsibility and Ethics in Washington, added: \"We don't know whether Cawthorn bought LGBCoin with advanced knowledge of the deal, but if he did, that seems like a pretty clear cut case of what insider trading laws were meant to prevent.\"",
    "Koutoulas, who was involved in negotiating the deal with Brown, did not disclose how many LGBCoins Cawthorn bought in early December, but he denied in a message to the Washington Examiner on Monday that the lawmaker made the trade with nonpublic information of the pending sponsorship.",
    "When asked for links to Brown's public statements promoting the sponsorship deal in early November, Koutoulas forwarded the Washington Examiner one Instagram picture dated Nov. 6 showing him wearing a shirt with the LGBCoin logo as he posed with the NASCAR driver on a race track.",
    "\"I recommend doing, for no apparent reason or knowledge that I know, I recommend buying it tonight, just saying,\" Florida conservative political pundit Brendon Leslie said, referring to LGBCoin, during a live talk show on Dec. 28 while sitting next to Koutoulas.",
    "Koutoulas has suggested LGBCoin isn't subject to securities regulations because \"it is not technically or legally possible for a decentralized meme coin that exists to promote free speech and charitable giving to be classified or treated as a security.\"",
    "Craig Holman, a government affairs lobbyist for Public Citizen, said Koutoulas's statement strengthens his suspicions that Cawthorn may have had insider knowledge when he traded LGBCoin, which is a reference to the chant mocking President Joe Biden.",
    "Dylan Hedtler-Gaudette, the government affairs manager for the Project on Government Oversight, said Cawthorn may have violated the STOCK Act by failing to report his early December purchase of LGBCoin, if his reported trade was greater than $1,000.",
    "\"The new information that Madison Cawthorn did indeed buy up LGBCoin prior to the public announcement of the NASCAR endorsement adds greater evidence to the suspicions of Cawthorn violating the insider trading laws,\" Holman said.",
    "Koutoulas responded to the report in an Instagram story on Friday, calling it the \"pure definition of a fake news smear job\" and noting that \"Cawthorn's most recent trade was 3 weeks before @nascar approved the sponsorship.\"",
    "Former New York Times reporter Ben Smith, who profiled Brown for the paper, told the Washington Examiner that the NASCAR driver made no mention of his dealings with LGBCoin when communicating with the Times about the story.",
    "\"Koutoulas may perceive his largely unregulated cryptocurrency as a form of free speech, but it is a financial investment at its very core, and the SEC will step in to protect investors from being swindled,\" Holman said.",
    "Libowitz, the CREW spokesman, said the Commodity Futures Trading Commission has defined virtual currencies as commodities, which have been subjected to insider trading laws since the passage of the 2010 Dodd-Frank Act.",
    "No mention of the cryptocurrency's pending sponsorship of his 2022 season appears in his Dec. 19 profile in the New York Times, in which he discussed his struggles securing sponsorships during the 2021 season.",
    "\"By the way, not sure if you're a mathematician  but I said go buy within [the] next 24 hours (because I was just excited to help promote) and the announcement didn't happen until 48 hours later,\" he added.",
    "\"If Cawthorn knew of the nonpublic material information that would radically boost the value of the cryptocurrency, and purchased LGBCoin with that knowledge, this would likely constitute insider trading.\"",
    "\"The House has issued guidance to members that explicitly states that for periodic transaction reporting and annual financial disclosure purposes, they must report crypto assets,\" Hedtler-Gaudette said.",
    "Cawthorn's office did not return multiple requests for comment asking if he purchased LGBCoin in early December with advance, nonpublic knowledge of the pending sponsorship deal with Brown.",
    "The next day, Koutoulas was featured in a statement from Brown announcing that the coin would be the primary sponsor of his 2022 season, causing the cryptocurrency's value to spike by 75%.",
    "When asked about Leslie's comments on Tuesday, Koutoulas told the Washington Examiner the \"Brandon team sponsorship was *public knowledge* an entire month prior to Cawthorn's purchase.\"",
    "Koutoulas also said Brown promoted LGBCoin at several events during a cryptocurrency summit in Puerto Rico from Dec. 6-12, but he didn't provide any records to support the claim.",
    "Holman, the Public Citizen government affairs lobbyist, said Koutoulas's notion that LGBCoins are expressions of \"free speech\" rather than financial investments is \"absurd.\"",
    "\"Again, based off of no knowledge I may or may not have, the time to buy the LGBCoin  again, I'm not a financial adviser  is within the next 24 hours,\" Leslie added.",
    "Another individual close to Koutoulas issued statements on Dec. 28, two days before the sponsorship was made public, that could suggest knowledge of the deal.",
    "Brown told Sports Business Journal on Dec. 23 that the rise of the \"Let's Go Brandon\" phrase mocking Biden made it tough for him to secure sponsorship deals.",
    "The trade also came amid teases from LGBCoin as early as Nov. 11 that it was working on a \"major national sponsorship deal\" with an undisclosed party.",
    "Experts previously told the Washington Examiner that Cawthorn may have implicated himself in an insider trading scheme when he wrote, \"LGB legends ...",
    "Leslie told the Washington Examiner his Dec. 28 comments \"are nothing more than me loving freedom of speech and a coin that represents that.\"",
    "The Washington Examiner was unable to find any public mentions from Brown about the LGBCoin sponsorship deal before its Dec. 30 announcement.",
    "Cawthorn's reported LGBCoin trade took place around the same time Koutoulas posted a picture on Twitter of himself posing with the lawmaker.",
    "The Instagram post made no mention or suggestion of a formal business or sponsorship deal between LGBCoin and Brandon Brown.",
    "\"He was publicly promoting the sponsorship at crypto and public events and on social in early November,\" Koutoulas said.",
    "\"Incredible spending back to back nights with the affable Patriot @CawthornforNC,\" Koutoulas tweeted on Dec. 5.",
    "Sports Business Journal noted in its story that Brown \"was not prepared to reveal his '22 sponsors yet.\"",
    "\"Theoretically, Cawthorn could be in violation of three distinct sets of rules,\" Hedtler-Gaudette said.",
    "in response to a Dec. 29 Instagram picture of himself posing with LGBCoin ringleader James Koutoulas.",
    "\"You can absolutely be prosecuted for insider trading with commodities,\" Libowitz said.",
    "Brown gave a shout-out to his sponsors in a lengthy Twitter thread posted on Dec. 18.",
    "Cawthorn has filed no disclosures relating to his reported purchase of LGBCoin.",
    "\"So cool to hang out with @brandonbrown_68 before tonight's race!",
    "\"Do a real story, my lawyers will be waiting for your hit piece.\"",
    "\"I don't know what may or may not happen, but now is the time.\"",
    "House rules around avoiding the appearance of impropriety.\"",
    "STOCK Act periodic transaction reporting requirements; 3.",
    "The NASCAR driver did not identify LGBCoin in the thread.",
    "Brown did not return a request for comment.",
    "#letsgobrandon,\" the post stated.",
    "\"That was old news on Dec 30th.\"",
    "Tomorrow we go to the moon!\"",
    "\"1. Insider trading laws; 2.",
    "Just In..."
  ]
}