{
  "id": 2654,
  "mediaId": 65,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "Lawmakers behaving badly",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/dc66470f-a103-4856-89a3-c39530f21902/29e464ce-5d87-46b0-9178-2979ae122ebf/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/lawmakers-behaving-badly",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    722,
    821,
    977,
    1317,
    2303,
    2308,
    2421,
    545,
    560,
    562
  ],
  "sentences": [
    "In 2007, undercover police officers arrested former Sen. Larry Craig, R-Idaho, in the Minneapolis-St. Paul International Airport on charges of disorderly conduct in a bathroom stall.",
    "HARRIS TESTS NEGATIVE FOR COVID, WILL RETURN TO WHITE HOUSE\nHere are some of the \"characters\" who seized the congressional tableau long before Cawthorn came on the scene.",
    "Former Rep. Cynthia McKinney, D-Ga., punched a U.S. Capitol Police officer after she was stopped avoiding a magnetometer entering the Longworth House Office Building.",
    "Lawmakers are generally exempt from passing through security on Capitol Hill  although everyone must now walk through magnetometers to enter the House chamber.",
    "Cawthorn is right about the supposition that many lawmakers would suffer from the same problems he has now if iPhones and Snapchat were around decades ago.",
    "The information emanates from a filing submitted to the quasi-official \"Office of Congressional Ethics\" (OCE) by the political group Fire Madison Cawthorn.",
    "In another tweet, the congressman observed, \"Many of my colleagues would be nowhere near politics if they had grown up with a cell phone in their hands.\"",
    "House Speaker Nancy Pelosi, D-Calif., questioned whether authorities twice-afforded Cawthorn special treatment after bringing a firearm to the airport.",
    "He told a gaggle of reporters in the Speaker's Lobby off the House floor that the photo in the boxers may have shown \"the tip of al-Qaida's spear.\"",
    "In 2018, former Rep. Blake Farenthold, R-Texas, faced a torrent of criticism from multiple former aides about inappropriate comments and conduct.",
    "In other words, why does one branch of government  the executive branch  have the right to execute a raid on the legislative branch of Congress?",
    "In 2006, explicit text messages materialized that former Rep. Mark Foley, R-Fla., sent to teenage pages in the House of Representatives.",
    "DESANTIS ACCUSES DISNEY OF COZYING UP TO CCP, MAKING A FORTUNE' WITHOUT MENTIONING ATROCITIES\nSome of these are full-blown scandals.",
    "(Bill Clark/Roll Call/Getty Images)\nThe FBI raided the Congressional office of former Rep. William Jefferson, D-La., in May 2006.",
    "It is extremely rare to have a sitting senator support someone else in the primary of a home state congressman of the same party.",
    "In fact, Shakespeare thought so highly of Falstaff that he appears in three plays, and his death is even eulogized in a fourth.",
    "Like in Shakespeare's plays, congressional veterans have seen similar characters facing allegations and problems like Cawthorn.",
    "Cawthorn then bragged on Twitter that he \"gained 43,000 followers since the coordinated assault against me and my re-election.",
    "An investigation found that hundreds of lawmakers wrote hot checks with insufficient funds in their accounts for years.",
    "The House Ethics Committee launched a probe into Massa after male aides accused the congressman of sexual harassment.",
    "Cawthorn recently claimed that fellow lawmakers invited him to drug-infused parties with all sorts of debauchery.",
    "But we have been here before on Capitol Hill when an avalanche of allegations and troubles cascade onto a member.",
    "(AP Photo/Chris Seward, File)\nEach of these tales merited daily news coverage by the congressional press corps.",
    "Farenthold conceded when he won in an upset in 2010 that he didn't know \"how to run a congressional office.\"",
    "Most of Cawthorn's troubles stem from questionable social media posts  especially for a member of Congress.",
    "The House Judiciary Committee even held a hearing looking into the constitutionality of the FBI's actions.",
    "The tiger suit photo wasn't great for Wu  and had nothing to do with the sexual assault allegations.",
    "Former Rep. David Wu, D-Ore., faced allegations of sexual assault with an 18-year-old woman in 2011.",
    "Sen. Thom Tillis, R-N.C., is now backing GOP North Carolina state Sen. Chuck Edwards in the primary.",
    "Ellis sentenced Jefferson to 13 years in prison  the longest sentence ever given to a congressman.",
    "In 2011, Weiner sent lewd photos of himself in his underwear to a woman following him on Twitter.",
    "A statue of Puck from A Midsummer Night's Dream points generally in the direction of the Capitol.",
    "His aides said that Garrett and his wife required them to run errands and take care of their dog.",
    "However, Cawthorn is far from the first scandal-plagued lawmaker to darken the doors of Congress.",
    "It's notable that Cawthorn crowed that he \"built my staff around comms rather than legislation.",
    "I tickled him until he couldn't breathe, and then four guys jumped on top of me,\" said Massa.",
    "FBI agents posed as Arab sheikhs and offered bribes to politicians in exchange for favors.",
    "Chad Pergram currently serves as a congressional correspondent for FOX News Channel (FNC).",
    "A picture and video surfaced of a congressional aide younger than Cawthorn, groping him.",
    "Shakespearean scholars describe Falstaff as perhaps the Bard's most complex character.",
    "Craig's foot allegedly touched the foot of an undercover officer in the other stall.",
    "On Fox, Massa described what had been characterized as \"tickle fights\" with an aide.",
    "Rep. Madison Cawthorn, R-N.C., may not have appeared in any of Shakespeare's shows.",
    "And Shakespeare often employed a court jester or comic to speak truth to power.",
    "(Mario Tama/Getty Images)\nAnd then there was former Rep. Anthony Weiner, D-N.Y.",
    "He joined the network in September 2007 and is based out of Washington, D.C.",
    "The FBI probed multiple House and Senate members for bribery and conspiracy.",
    "After the latest dustup, Cawthorn tweeted that \"only fighters are attacked.\"",
    "Cawthorn has been married and divorced during his short tenure in Congress.",
    "Former Rep. Eric Massa, D-N.Y., didn't even make it through his first term.",
    "Weiner claimed he could not say \"with certitude\" that the photos were his.",
    "But he certainly shows up just as frequently in media reports as Falstaff.",
    "Former Rep. Tom Garrett, R-Va., left Congress after problems with alcohol.",
    "Police arrested Radel in a sting and charged him with possessing cocaine.",
    "Not a lot of people remember much about the sexual assault allegations.",
    "Cawthorn's had his run-ins with the law on the road and at the airport.",
    "Weiner resigned after a pressure campaign by House Democratic leaders.",
    "These are just a handful of misdeeds that sent Congress into a tizzy.",
    "Cawthorn is the youngest Republican to ever to become a House member.",
    "Pelosi claimed there seemed to be a \"double standard\" with Cawthorn.",
    "Rarely a day passes without some new story emerging about Cawthorn.",
    "The group is angling for Cawthorn to lose his primary on March 17.",
    "Then citing him again for driving while his license was revoked.",
    "But word about Craig's arrest never filtered out until August.",
    "Weiner even tried humor to deflect attention from the scandal.",
    "The House Bank scandal rocked Capitol Hill in the early 1990s.",
    "The officer didn't recognize McKinney as a Member of Congress.",
    "Feste in \"Twelfth Night\" or Touchstone in \"As You Like It.\"",
    "Cawthorn has been a member of Congress for just 16 months.",
    "Social media doesn't do wonders for lawmakers and ethics.",
    "I have never been gay,\" said Craig after pleading guilty.",
    "But Weiner refused an inquiry by the U.S. Capitol Police.",
    "It's just that he's the one in the catbird seed now.",
    "It's a host of sagas that played out under the Dome.",
    "Craig told the officer that he \"has a wide stance.\"",
    "There are political leaders who struggle for power.",
    "Former Rep. Trey Radel, R-Fla., didn't last a term.",
    "Near the Capitol is the Folger Shakespeare Library.",
    "Members of Congress are human like everyone else.",
    "Radel became known as the \"Cocaine Congressman.\"",
    "Craig remained in the Senate until January 2009.",
    "Sages like Friar Laurence in \"Romeo and Juliet.\"",
    "But then a photo emerged of Wu in a tiger suit.",
    "The inscription: \"What fools these mortals be.\"",
    "Allegations of cryptocurrency insider trading.",
    "Craig rescinded his decision a few days later.",
    "The Feds later charged Jefferson with bribery.",
    "And it's augmented in the era of social media.",
    "Congress is kind of like a Shakespearean play.",
    "Such is the case today with Madison Cawthorn.",
    "We have all of these archetypes in Congress.",
    "A flawed, boastful, yet intelligent figure.",
    "Bringing a loaded gun to the airport again.",
    "Wu later said the encounter was consensual.",
    "Pictures of Cawthorn in women's lingerie.",
    "There were hints his account was hacked.",
    "Congress has characters like this, too.",
    "Police citing him for driving 87 mph.",
    "Bringing a loaded gun to the airport.",
    "One must be 25 to serve in the House.",
    "At first, Craig said he would resign.",
    "Craig's arrest unfolded in June 2007.",
    "And generally, too many shenanigans.",
    "Duke Frederick in \"As You Like It.\"",
    "And then there is a laughingstock.",
    "The early 1980s featured \"Abscam.\"",
    "But that's what everyone recalls.",
    "Heroes like Othello and Hamlet.",
    "But others are just strange.",
    "\"Not only did I grope them.",
    "Someone like John Falstaff.",
    "Foley immediately resigned.",
    "There are too many videos.",
    "Too many college parties.",
    "Lawmakers behaving badly.",
    "Where do we even start?",
    "But we're not through.",
    "Claudius in \"Hamlet.\"",
    "Scandals and foibles.",
    "He quickly resigned.",
    "Too many pictures.",
    "Federal Judge T.S.",
    "And bad judgment.",
    "\"I am not gay.",
    "He's just 26.",
    "Wu resigned.",
    "King Lear."
  ]
}