{
  "id": 2658,
  "mediaId": 238,
  "date": "5/2/2022 12:00:00 AM",
  "headline": "The many controversies surrounding Madison Cawthorn",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/02/madison-cawthorn-controversies-explained/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    2341,
    2341,
    883,
    883,
    1147,
    1147,
    2303,
    1609,
    1609,
    428,
    456,
    456,
    562,
    562,
    545,
    545,
    428,
    2957,
    2957
  ],
  "sentences": [
    "The voters, led by a campaign finance group, called Free Speech for People, argued in court that Cawthorn and Greene are ineligible for office because they had violated a Civil War-era rule that says a member of Congress can't serve if they engaged in insurrection or rebellion.?\nCawthorn attended the rally that preceded the Jan. 6 riot and has endorsed Trump's false voter-fraud claims.",
    "In a March podcast, Cawthorn said people he looked up to? in Washington used cocaine and invited him to orgies: I mean, being kind of a young guy in Washington, where the average age is probably 60 or 70  you know, I look at all these people, a lot of them that I've always looked up to through my life, always paid attention to politics, guys that, you know.",
    "You should come.?\nThis, more than anything else, seems to have broken Republicans from Cawthorn: Without naming names or providing any proof, Cawthorn cast his colleagues as characters out of House of Cards.? Some Republicans said they heard from constituents wondering whether their lawmaker had participated in these alleged gatherings.",
    "The Washington Examiner published a photo of Cawthorn from December with the creator of a cryptocurrency that Cawthorn owns and reported that in an Instagram comment the next day, he predicted the currency would go to the moon.? It did, raising questions of whether Cawthorn illegally used his knowledge and connections to make money.",
    "During his campaign, Cawthorn traveled to the border with Mexico and said without any evidence that children were being sold on a sex slave market.? On social media, he shared photos of himself featuring symbols associated with such far-right groups as the Oath Keepers.",
    "(See House Minority Leader Kevin McCarthy (R-Calif.) after audio caught him in a lie about whether he was going to ask Donald Trump to resign after the Jan. 6, 2021, attack on the Capitol.",
    "In Congress, he has closely aligned himself with the right wing of the party, protesting House mask mandates alongside Reps. Marjorie Taylor Greene (R-Ga.) and Lauren Boebert (R-Colo.).",
    "Remember that the Ukrainian government is incredibly corrupt, and it is incredibly evil, and it has been pushing woke ideologies,? Cawthorn told supporters in North Carolina in March.",
    "State troopers just released footage of them pulling over Cawthorn and taking his license: Is that so?? he says, after police tell him it had previously been revoked.",
    "It rankled at least one Republican lawmaker, who told The Hill that they were caught off guard to see someone running for Congress trying to chat with them.",
    "A federal judge sided with Cawthorn on a technicality but didn't offer a judgment whether there was a reasonable suspicion that he helped the insurrection.",
    "Cawthorn has also claimed that he had a weapon in the Capitol on Jan. 6, 2021, during the insurrection, though it is unclear whether this broke any rules.",
    "Not so much for Cawthorn, whose words and actions have spurred some Washington Republicans to try to oust him from his deep-red seat in a May primary.",
    "She alleges that Cawthorn refused to let her take leave during a family medical crisis, which included her husband having a heart attack.",
    "A PAC trying to oust Cawthorn has leaked audio of this former employee saying he is just a bad person,? Smoky Mountain News reports.",
    "The House of Representatives has strict rules about who can be on the House floor  limiting it mostly to the lawmakers themselves.",
    "Cawthorn's comments irritated Republicans: It's not the time to toss accusations around like that,? Rep. Roger Williams (R-Tex.)",
    "Then all of the sudden you get invited to, like, Oh, hey, we're going to have kind of a sexual get-together at one of our homes.",
    "Here are the major controversies he has been involved in, roughly in order of what has been most offensive to Republicans.",
    "He was cited in October for speeding  driving 89 mph in a 65-mph zone  and in January for going 87 mph in a 70-mph zone.",
    "McCarthy indicated Cawthorn acknowledged he was exaggerating, but Cawthorn has yet to publicly walk back his comments.",
    "Last week, Cawthorn was cited by Charlotte police for trying to bring a loaded gun  in the photo above  onto a plane.",
    "Tillis called on the House Ethics Committee last week to investigate Cawthorn over an allegation of insider trading.",
    "He's got a lot of members very upset,? McCarthy said, publicly lecturing him and calling Cawthorn's claims a lie.",
    "In March, police pulled Cawthorn over in rural North Carolina and found he was driving with a revoked license.",
    "Naval Academy when he was not and misrepresenting details of the car accident that left him in a wheelchair.",
    "Republicans in Congress regularly push the Biden administration to offer Zelensky more military assistance.",
    "He got elected in 2020 to a very conservative seat in North Carolina after emulating Trump's politics.",
    "But we do know he's been cited twice for speeding in recent months (and other times in past years).",
    "He faces a Friday court date for driving without a license; he has a June court date for speeding.",
    "He had the gun in his carry-on bag, and Transportation Security Administration agents caught it.",
    "Cawthorn has repeatedly lied about his personal history, saying he was accepted into the U.S.",
    "Rep. Madison Cawthorn (R-N.C.) is far from the only House lawmaker to invite controversy.",
    "Zelensky addressed a joint session of Congress in March and received bipartisan applause.",
    "One of Cawthorn's biggest critics has been from his own state: Sen. Thom Tillis (R-N.C.).",
    "(A federal judge let Greene's case proceed, and she had to testify in court last week.)",
    "But lawmakers typically tend to close ranks around their own when controversy erupts.",
    "He was charged with the same thing in 2017, reports the Asheville Citizen Times.",
    "He has denied any involvement in planning the rally, either by him or his aides.",
    "The Hill reports Cawthorn lied to security and said this person was a staffer.",
    "This was the second time in recent months that Cawthorn has tried to do this.",
    "But in December, Cawthorn brought someone running for Congress on the floor.",
    "House GOP leaders met with Cawthorn to address his remarks.",
    "Multiple women have accused him of sexual misconduct.",
    "It's not clear why his license had been revoked.",
    "At 26, he is the youngest member of Congress.",
    "(Trump, notably, has stood by Cawthorn.)",
    "Republicans are largely behind him.)",
    "Remember that Zelensky is a thug.",
    "First, who is Cawthorn?",
    "told CNN."
  ]
}