{
  "id": 2663,
  "mediaId": 136,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "Madison Cawthorn Is Under Attack from the Right",
  "image": "",
  "link": "https://www.newsweek.com/madison-cawthorn-under-attack-right-republicans-1702177",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Darragh Roche",
  "authorUrl": "https://www.newsweek.com/authors/darragh-roche",
  "termIds": [
    742,
    821,
    2303,
    367,
    562,
    571,
    613
  ],
  "sentences": [
    "The video featuring Smith was released following the publication of photos of Cawthorn in lingerie by Politico on April 22 and on Tuesday, he was cited for possession of a 9-millimeter handgun while attempting to bring it through a security checkpoint at Charlotte Douglas International Airport in North Carolina.",
    "Tillis has endorsed one of Cawthorn's primary opponents, state Senator Chuck Edwards, and a super PAC connected to Tillis has spent $300,000 on an ad campaign that accused Cawthorn of \"lying about conservatives\" and dubbed him an \"attention-seeking embarrassment.\"",
    "News outlets that are generally considered conservative-leaning have recently published articles that are unflattering to Cawthorn, who represents North Carolina's 11th congressional district, while Senator Thom Tillis (R-NC) has openly criticized the 26-year-old.",
    "The recent headlines may have had an effect on Cawthorn's re-election hopes as support for him in his district is falling, with polling from Differentiators Data showing he enjoys 38 percent support there among GOP voters, down from 49 percent in March.",
    "Ethics Complaint\nOn Thursday, DailyMail.com published an exclusive featuring a video of Cawthorn with his 23-year-old aide, Stephen Smith, that appeared to show Smith touching Cawthorn's leg and reaching toward his crotch.",
    "Representative Madison Cawthorn appears to be under attack from the right as a series of damaging news stories have been published about the young Republican and a senior member of his own party has taken aim at him.",
    "Those comments earned him a meeting with House Minority Leader Kevin McCarthy, who publicly rebuked Cawthorn after the meeting, calling the remarks \"unacceptable\" and saying the young congressman had lost his trust.",
    "Addressing his endorsement of Edwards, Tillis said: \"I want a delegation that works together, I don't want a delegation that gets togetherminus oneand talks about the challenges that member is causing.\"",
    "On Tuesday, The Washington Examiner reported that Cawthorn may have have violated federal insider trading laws in December, 2021 by allegedly promoting a so-called \"pump and dump\" cryptocurrency scheme.",
    "The Washington Examiner is widely regarded as a conservative publication and its report led Senator Tillis to call for a bipartisan ethics probe into the allegations against Cawthorn.",
    "That is likely a reference to Cawthorn's previous claim that he had been invited to an orgy by unnamed individuals in Washington, D.C. and seen people use cocaine in front of him.",
    "\"Insider trading by a member of Congress is a serious betrayal of their oath, and Congressman Cawthorn owes North Carolinians an explanation,\" Tillis tweeted on Wednesday.",
    "The video they obtained is part of an ethics complaint filed against Cawthorn by political group Fire Madison Cawthorn, which is operated by the American Muckrakers PAC.",
    "Personal Attacks\nNewsweek asked Cawthorn's office about the apparent conservative attacks on him, including from right-leaning media and Senator Tillis.",
    "\"A campaign based on nothing but slander and personal attacks is a campaign that lacks a true sense of how to save the country from the leftists.\"",
    "Tillis also recently criticized Cawthorn for touting a broadband measure included in an infrastructure bill Cawthorn had voted against.",
    "A Primary Challenge\nThe congressman faces seven challengers in the upcoming GOP primary for North Carolina's 11th district on May 17.",
    "I can understand the establishment attacking those beliefs, but just digging stuff up from my early 20s to smear me is pathetic.\"",
    "\"There needs to be a thorough and bipartisan inquiry into the matter by the House Ethics Committee,\" the senator said.",
    "DailyMail.com and its associated newspaper, The Daily Mail, are widely understood to be conservative outlets.",
    "Thursday's story is the latest in a series of salacious headlines that are potentially damaging to Cawthorn.",
    "That complaint alleges, in part, that Cawthorn has given Smith thousands of dollars in gifts and loans.",
    "However, he still holds a double-digit lead over Edwards, whose support stands at 21 percent.",
    "\"At least be consistent with your attack instead of changing the focus every time,\" he said.",
    "\"I believe in some pretty aggressive government reforms,\" the congressman wrote.",
    "Luke Ball, a spokesperson for Cawthorn, said the complaint was \"ridiculous.\"",
    "A spokesperson pointed to a Twitter thread Cawthorn had written on Friday.",
    "\"I want to change the GOP for the better, and I believe in America First.",
    "\"The PAC that filed the complaint did no research.\"",
    "\"Stephen is his cousinthey're family,\" Ball said."
  ]
}