{
  "id": 2664,
  "mediaId": 409,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "Some Additional Section 3 Disqualification Puzzles",
  "image": "https://www.nationalreview.com/wp-content/uploads/2021/05/marjorie-taylor-greene-capitol-hill.jpg?w=1592",
  "link": "https://www.nationalreview.com/corner/some-additional-section-3-disqualification-puzzles/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Dan McLaughlin",
  "authorUrl": "https://www.nationalreview.com/author/dan-mclaughlin/",
  "termIds": [
    883,
    1065,
    1090,
    1147,
    2303,
    545,
    571,
    2945
  ],
  "sentences": [
    "Even without Congress passing a procedure in advance, of course, there is a second way to do this, which formed the basis for the examples I cited from the scholarship on the history of Section 3: Article I, Section 5 provided, even before the Fourteenth Amendment, that each House shall be the Judge of the Elections, Returns and Qualifications of its own Members.? Unlike the Article I, Section 5 requirement for a two-thirds vote to expel a member, or the Fourteenth Amendment, Section 3 requirement of a two-thirds vote to remove the disability for insurrection, the Constitution requires only a majority vote for the House or Senate to decide that a prospective member is disqualified.",
    "The text of Section 3 would appear to make disqualification automatic:\nNo person shall be a Senator or Representative in Congress, or elector of President and Vice President, or hold any office, civil or military, under the United States, or under any State, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.",
    "I agree with our editorial, with Rich and Kevin, that the efforts to kick Marjorie Taylor Greene, Madison Cawthorn, Paul Gosar, and Andy Biggs off the ballot under Section 3 of the Fourteenth Amendment are ill-considered and dangerous to democracy because these efforts ask courts to apply a standard lower than what Section 3 has historically required.",
    "Therefore, even if it was a proper reading of Section 3 (as it is not) to disqualify them for inflammatory rhetoric in advance of January 6, they may not be properly disqualified for anything they said during November or December 2020, because neither of them had yet taken an oath of office.",
    "As law professor Daniel Hemel detailed last January, however, the procedures used in the 1860s and 1870s did not require a criminal prosecution:\n[In 1870,] Congress passed the First Ku Klux Klan Act, which established procedures for enforcing Section 3.",
    "Of course, that would be a dangerous power to use without adhering scrupulously to the substantive requirements of Section 3, and it has the additional disadvantage that Congress doesn't get into the picture until after the candidate has been elected.",
    "This was the basis on which courts threw out the Arizona cases, while the North Carolina case against Cawthorn was thrown out on the theory that the 1872 Amnesty Act rendered Section 3 ineffective unless and until Congress restores it.",
    "Finally, there is a legal wrinkle that makes it even more difficult to go after Greene or Cawthorn, but which does not apply to the cases against Gosar and Biggs, and would not apply to a hypothetical disqualification of Donald Trump.",
    "Whenever a former Confederate occupied federal or state office in violation in Section 3, the Ku Klux Klan Act called on federal prosecutors to bring an action in federal court to remove the officeholder.",
    "So, Congress may well have  and has exercised in the past  the power to authorize courts to hear Section 3 challenges as civil proceedings without requiring a criminal trial or a jury trial.",
    "There remains, in fact, a vigorous legal debate over whether Congress must prescribe a procedure for disqualification under Section 3 in order to effectuate it.",
    "The upshot was that courts  not Congress  would make the final decision as to whether an individual should be subject to the 14th Amendment's lifetime ban.",
    "The statute also made it a misdemeanor for any person to knowingly accept, hold, or attempt to hold any office for which he is ineligible under Section 3.",
    "Section 3 applies only to those who engage in insurrection, or give one aid and comfort, having previously taken an oath? of office.",
    "Without one, it is a more dubious question whether a state court or administrative agency can apply Section 3 of its own force.",
    "But I must add a bit of context to Kevin's argument about what is needed in order for Section 3 to apply.",
    "But that assumes that such a Congressionally-authorized procedure exists, and presently, it doesn't.",
    "Anyway, we still have an adequate remedy: Republican primary voters should get rid of both of them.",
    "But Greene and Cawthorn were both first-time public officials sworn into Congress on January 3.",
    "But Congress may by a vote of two-thirds of each House, remove such disability.",
    "Now, in a nation of laws, nothing is automatic  somebody has to decide.",
    "There is no requirement for a trial or other due process."
  ]
}