{
  "id": 2665,
  "mediaId": 195,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "Mounting scandals fuel uncertainty over Cawthorn's reelection",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/03/cawthornmadison_033022gn3_lead.jpg",
  "link": "https://thehill.com/news/3472093-mounting-scandals-fuel-uncertainty-over-cawthorns-reelection/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod/",
  "termIds": [
    2303,
    2341,
    2341,
    2470,
    2470,
    641,
    641,
    821,
    821,
    1147,
    1147,
    2303,
    2095,
    2095,
    2087,
    2087,
    2027,
    2027,
    1501,
    1501,
    428,
    428,
    2834,
    2834,
    2862,
    2862
  ],
  "sentences": [
    "The incumbent has not backed won accusing the establishment? of launching a coordinated drip campaign? against him and saying this week, They're going to drop an attack article every one or two days just to try and kill us with a death by 1,000 cuts.?\nA Republican poll released Thursday showed Cawthorn's support dropping  but still 17 points higher than Edwards and above the 30 percent he needs to avoid a runoff.",
    "The North Carolinian has seemingly been in news headlines weekly since then, drawing rebukes for driving with a revoked license; two attempts to bring a loaded gun through airport security; allegations of sexual harassment; calling Ukrainian President Volodymyr Zelensky a thug;? reportedly denying a staffer leave when two family members passed away within the same week and more.",
    "It's famously difficult to unseat an incumbent in a primary, and in a district as geographically sprawling as Cawthorn's one in the western North Carolina mountains, Edwards and Woodhouse face an uphill climb in maximizing voters' awareness of the scandals with just over two weeks left to go.",
    "I'd rather go buy a lottery ticket and hope to retire at the end of week.?\nCawthorn first shook up his primary race last year when he announced he would switch districts to run elsewhere only to return to campaign for his original seat after redistricting.",
    "News\nThe flood of controversies surrounding Rep. Madison Cawthorn (R-N.C.) shows no sign of ceasing just weeks before his May 17 primary, raising questions as to whether he can avoid a runoff despite being one of the highest-profile freshmen in the House.",
    "Cawthorn in the past week alone has been hit with a slew of bad headlines and is now facing calls for an ethics investigation into alleged insider trading by Republican Sen. Thom Tillis (N.C.), who is also backing a primary challenge against Cawthorn.",
    "On top of that, Edwards and Woodhouse have profiles that pale in comparison to the national one that Cawthorn boasts, and dragging Cawthorn's name through the mud may have limited impact if they're unable to get their own name identifications higher.",
    "So, I think some of this stuff, they might take with a grain of salt because they just assume that's who he is.?\nOn top of that, Cawthorn is close with former President Donald Trump  an invaluable ally who remains the de facto leader of the GOP.",
    "While Cawthorn boasts broad name recognition and the advantage of incumbency, he's consistently handed his critics ammunition  albeit with a limited runway for them to saturate voters' minds with the controversies and make themselves known.",
    "Lots of rhetoric, lots of immaturity, really bad decision-making, breaking the law knowingly while driving on a revoked driver's license for three years, the gun through the airport, not once but twice,? Woodhouse told The Hill.",
    "If this week is any indication, buckle in,? Bitzer said, because it could be a bumpy ride.?\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "And so, finding time and name recognition is the biggest challenge here.?\nCawthorn's bombast is also not new, and at a certain point highlighting his scandals may bring diminishing returns to his detractors.",
    "A super PAC that's affiliated with Tillis is dumping $300,000 in ads against Cawthorn, and Edwards's campaign itself is expected to spend upwards of $400,000 on ads in a district where airtime is cheap.",
    "If you would have asked me eight months ago could Congressman Cawthorn be in this situation, if he would have never left, he would have had an easy path to victory, I think, sans all these headlines.",
    "On top of that, a political action committee opposing Cawthorn filed an ethics complaint against him on Wednesday focusing on several issues, including loans to a staffer who he says is his cousin.",
    "Operatives say the unceasing drip-drip-drip of scandals may not be enough to sink Cawthorn's reelection hopes given that voters may not be plugged in  but they certainly put him on the defensive.",
    "Cawthorn this week was also hit with an allegation of insider trading, first reported in the conservative Washington Examiner, for advertising the Let's Go Brandon? cryptocurrency setup.",
    "But uncertainty over his electoral prospects spiked earlier this year after he spoke of sexual perversion? in Congress and claimed other lawmakers invited him to cocaine-fueled orgies.",
    "Cawthorn allegedly had insider knowledge that the digital coin, named after the anti-Joe Biden chant, would support NASCAR driver Brandon Brown before that news was made public.",
    "You don't really know how many of the voters in his district are seeing stories about that or reading about it or seeing it on TV, you just don't know at this point,? he added.",
    "The big question in my mind is how much of that Trump endorsement will override the embarrassment, the negative fatigue that Cawthorn has brought upon himself?? Bitzer asked.",
    "It's hard to say how big the impact is, but it's got to be a negative.?\nMeanwhile, as news of the controversies seeps into the public, Cawthorn's opponents are pouncing.",
    "Tillis further escalated the criticism of Cawthorn this week by calling for the House Ethics Committee to launch an investigation into the insider trading allegations.",
    "Cawthorn's two main opponents are state Sen. Chuck Edwards (R), considered the so-called establishment pick, and Michele Woodhouse, a former GOP district chair.",
    "Edwards has been racking up endorsements, including from Tillis, a level of involvement from a home-state senator that's unusual against a sitting congressman.",
    "I think that's the biggest question, is whether these voters who are going to show up in a permanent election even know about all of it,? the source said.",
    "I'm not real sure anybody's got a clear crystal ball to make a prediction one way or the other,? said Catawba College political scientist Michael Bitzer.",
    "The committee declined to comment when reached by The Hill, and a spokesperson for Cawthorn did not immediately respond to requests for comment.",
    "The mounting scandals put Cawthorn's reelection bid on increasingly uneven footing and have fueled uncertainty over how voters will break.",
    "And I think mistakes sort of compound as Cawthorn continues to make them,? said North Carolina GOP strategist Carter Wrenn.",
    "But regardless, the unceasing news about Cawthorn will likely keep the race stuck in the headlines  and in ambiguity.",
    "And others are just starting to spend a lot of money,? said one seasoned North Carolina political observer.",
    "I just think that there are so many moving parts to this drama that will play out on May 17.",
    "I don't know if that stuff resonates with the hardcore primary electorate in the mountains.",
    "The easy money tells you that all of this is such a big deal, a candidate's going to lose.",
    "But I don't know what's going on with Madison.?\nStill, Cawthorn is no dead man walking.",
    "We understand.' But if you make seven in a row, then they start to wonder about you.",
    "I think they know he's a young hothead that has ambitions to be known nationwide.",
    "But I think some of these candidates, many of them are still completely unknown.",
    "What I think may be potentially negating is the Trump endorsement in the state.",
    "Voters are getting exposed to the fact that it's a mile wide and an inch deep.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Suppose you build houses and you make a series of mistakes.",
    "It is clear as mud, as we say down here,? he added.",
    "One mistake, people might say, Okay, we'll fix it.",
    "I would not try and venture a guess either way.",
    "Incumbents don't lose very often."
  ]
}