{
  "id": 2669,
  "mediaId": 136,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "'Pathetic': Madison Cawthorn Responds to Ethics Complaint Over Conduct",
  "image": "https://d.newsweek.com/en/full/2028900/madison-cawthorn-ethics-complaint-pathetic-republican-congress.webp?w=790&f=ccdb17cc0a3e9acad0dfdc76d15b430d",
  "link": "https://www.newsweek.com/pathetic-madison-cawthorn-responds-ethics-complaint-over-conduct-1702369",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aila Slisco",
  "authorUrl": "https://www.newsweek.com/authors/aila-slisco",
  "termIds": [
    1270,
    2303,
    378,
    428,
    558,
    562,
    2834
  ],
  "sentences": [
    "Other recent scandals involving the North Carolina Republican include an allegation of insider cryptocurrency trading, attempting to bring a gun past airport security checkpoints multiple times, and enraging fellow Republicans by claiming that he had been invited to orgies by colleagues who encouraged him to use cocaine.",
    " Madison Cawthorn (@CawthornforNC) April 29, 2022\nCawthorn, 26, went on to maintain that he \"looked damn good on that cruise ship,\" apparently referring to now-viral photos of him wearing women's lingerie on a cruise ship that were leaked to the press last week.",
    "Cawthorn took to Twitter on Friday to dismiss the ethics complaint and comments about the video, insisting in a series of tweets that a \"smear\" campaign had been launched against him by those opposed to his \"America First\" values.",
    "A video of Cawthorn appearing to be groped on the groin by his staff member Stephen Smith was included in the filing, prompting a new round of backlash for the embattled congressman when the video was shared on social media.",
    "The ethics complaint from the American Muckrakers PAC alleges inappropriate and undisclosed payments and gifts from Cawthorn to Smith, who the group said lives with and has a close \"personal relationship\" with Cawthorn.",
    "\"What's pathetic is a 26 year old Congressman that believes the rules don't apply to him,\" American Muckrakers PAC President David B. Wheeler said in a statement to Newsweek when asked about Cawthorn's tweet.",
    "Representative Madison Cawthorn of North Carolina has denounced a \"pathetic\" ethics complaint made against him as scandals involving the first-term Republican continue to pile up.",
    "The group Fire Madison Cawthorn, which is operated by the American Muckrakers PAC, submitted an ethics complaint to the Office of Congressional Ethics on Wednesday.",
    "\"The House Ethics Committee complaint we filed relates to Cawthorn's short tenure in Congress not his early 20's which was only 2 years ago,\" he added.",
    "\"A campaign based on nothing but slander and personal attacks is a campaign that lacks a true sense of how to save the country from the leftists.\"",
    "The complaint also references the airport incidents and Cawthorn allegedly brining \"daggers\" to North Carolina schools on multiple occasions.",
    "I can understand the establishment attacking those beliefs, but just digging stuff up from my early 20s to smear me is pathetic.\"",
    "I can understand the establishment attacking those beliefs, but just digging stuff up from my early 20s to smear me is pathetic.",
    "We hope the voters share our belief that Cawthorn's time in Congress is over and vote against him in this primary.\"",
    "\"What's pathetic is a lawmaker that never owns up to his mistakes or takes responsibility for his actions.\"",
    "\"At least be consistent with your attack instead of changing the focus every time,\" he continued.",
    "\"I believe in some pretty aggressive government reforms,\" Cawthorn tweeted.",
    "\"I want to change the GOP for the better, and I believe in America First.",
    "I want to change the GOP for the better, and I believe in America First.",
    "Irresponsible and immature people don't belong in Congress.",
    "I believe in some pretty aggressive government reforms.",
    "Daggers don't belong in schools.",
    "\"Guns don't belong in airports."
  ]
}