{
  "id": 2671,
  "mediaId": 43,
  "date": "4/30/2022 12:00:00 AM",
  "headline": "DKos Asheville Open Thread: Mad",
  "image": "https://images.dailykos.com/images/1064293/story_image/DKCawthornElephant.jpg?1651317910",
  "link": "https://www.dailykos.com/story/2022/4/30/2094888/-DKos-Asheville-Open-Thread-Mad-Madison-Guns-Girls-Dictators-and-Crypto-Republicans-had-enough",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    2347,
    2347,
    1609,
    1609,
    2303,
    378,
    378,
    617,
    617,
    2553,
    2553,
    2834,
    2834,
    2945,
    2945
  ],
  "sentences": [
    "Madison Cawthorn is a 'monster of Republicans' own creation' -- and he won't be the last: columnist\nRaw Story, Tom Boggioni, 4/29/2022\nAccording to the Washington Post's Dana Millbank, the leadership of the Republican Party would like to see Rep. Madison Cawthorn (R-NC) go away so they won't have to answer for his almost daily antics including repeatedly being stopped for speeding while driving on an expired license to trying to take guns on planes to blurting out stories about drug-fueled conservative orgies in Washington D.C.\nAs the longtime political observer notes, even if voters in Cawthorn's district oust him -- there will be more Cawthorn's coming down the pike in the upcoming midterm election and elections beyond November.",
    "Sharing Local since 2011\nNorth Carolina's 11th Congressional District election, 2022 (May 17 Democratic primary)\nElections in North Carolina, 2022\nPrimary date: May 17, 2022\nMail-in registration deadline: April 22, 2022\nOnline registration deadline: April 22, 2022\nIn-person registration deadline: April 22, 2022\nEarly voting starts: April 28, 2022\nEarly voting ends: May 14, 2022\nPoll times: 6:30 a.m. to 7:30 p.m.\nAbsentee/mail-in voting deadline: May 17, 2022\nGroup accuses Rep. Cawthorn of misconduct, files ethics complaint\nWLOS, Samiar Nefzi, 4/29/2022\nCongressman Madison Cawthorn is now facing a complaint, accusing him of several ethical violations.",
    "Daily Kos Stories\nIt looks like Madison Cawthorn tried to get on plane with a loaded gun\nDaily Kos, Walter Einenkel, 4/26/2022\nOn Tuesday, WSOC-TV Channel 9 reported that three sources tell them Rep. Madison Cawthorn was cited for having a gun at Charlotte Douglas International Airport Tuesday morning.? The outlet says that they were given a photo that shows a loaded Staccato C2,? a 9 mm handgun that was taken away from Cawthorn during a TSA check inside of Charlotte Douglas International Airport.",
    "REP. MADISON CAWTHORN CALLS UKRAINIAN PRESIDENT A 'THUG' & GOVERNMENT 'EVIL' IN VIDEO\nFellow Republican calls for investigation into Madison Cawthorn's alleged 'pump and dump' crypto scheme\nRaw Story, Sky Palma, 4/27/2022\nIn the wake of news that North Carolina GOP Rep. Madison Cawthorn may have violated insider trading laws for hyping a so-called \"pump and dump\" crypto scheme, North Carolina GOP Sen. Thom Tillis fired off a tweet this Wednesday calling out his fellow Republican.",
    "Cawthorn's troubles began last month when he claimed that people he admired had invited him to an orgy and used cocaine in front of him, and House minority leader Kevin McCarthy turned against the North Carolina congressman and damaging leaks started coming out as he faces a primary battle against establishment candidates, reported Independent correspondent Eric Garcia.",
    "While the cocaine orgies make for a lurid topic for gossip, the truth is that Republicans never really liked Cawthorn in the first place and were saddled with him because Mark Meadows resigned from that congressional seat to become Donald Trump's chief of staff and got the former president to endorse family friend Lynda Bennett, who flopped.",
    "#ncpol https://t.co/3s1UJMk1tj\n Senator Thom Tillis (@SenThomTillis) April 27, 2022\nThis Tuesday, the Washington Examiner reported that Cawthorn \"posed at a party with James Koutoulas, a hedge fund manager and the ringleader of the Let's Go Brandon cryptocurrency, a meme coin set up in the wake of the chant mocking President Joe Biden.\"",
    "[He's] not being held accountable.?\nRepublicans never liked Madison Cawthorn  and now they're trying to destroy him: report\nRaw Story, Travis Gettys, 4/29/2022\nRepublicans have had enough of first-term Rep. Madison Cawthorn (R-NC) and are ready to send him packing after just two years.",
    "With Cawthorn vying for media attention with fellow freshman House members Marjorie Taylor Greene and Lauren Boebert, Millbank suggested that North Carolina Republican's extracurricular activities are proving to be more than mainstream lawmakers are willing to put up with.",
    "News 13 Investigates: A look at Rep. Cawthorn's work, record in the US House\nWLOS, Ty Rusell, 4/27/2022\nASHEVILLE, N.C. (WLOS)  Across the nation, North Carolina 11th District Rep. Madison Cawthorn is mostly known for what comes out of his mouth.",
    "Madison Cawthorn busted -- again -- for carrying a handgun through airport security\nRaw Story, Travis Gettys, 4/26/2022\nRep. Madison Cawthorn (R-NC) was cited for possession of a handgun at Charlotte Douglas International Airport.",
    "Three sources told WSOC-TV the Republican congressman's 9-millimeter handgun was discovered Tuesday morning at a security checkpoint, but the Transportation Security Administration declined to identify the person who had the gun.",
    "No tally whacker,? the congressman said, discussing his definition of a woman following the most recent Supreme Court Senate justice hearings in which Judge Ketanji Brown Jackson replied, \"I can't,\" after she was asked by a U.S.",
    "Madison Cawthorn's latest misadventure points up the hypocrisy (and inadequacy) of our gun laws\nDaily Kos, Aldous J Pennyfarthing, 4/27/202\nThanks to Republicans, you can bring guns just about anywhere these days.",
    "\"But the real question is why Cawthorn is the target, particularly given there are equally controversial members in the caucus, including some who, like him, helped incite a literal insurrection.\"",
    "On Wednesday, April 27, 2022, the group Fire Madison Cawthorn filed a complaint with the Office of Congressional Ethics against the congressman, listing seven allegations of misconduct.",
    "It's not clear whether Cawthorn will face criminal charges in the incident, and neither Charlotte-Mecklenburg police nor Cawthorn's office responded to a request for comment.",
    "With the fast driving, the guns, the odd Russian-connection-short-lived-marriage and all the intrigue surrounding January 6th, Madison needs a good screenwriter, stat.",
    "We offer this space every weekend to share what we're up to in Western North Carolina and to give readers a variety of links to local and regional news of interest.",
    "DKos Asheville and other local and state groups can give us all a better sense of connection, a better understanding of who we stand with, work with and share with.",
    "TSA agents previously discovered a 9-millimeter handgun in Cawthorn's carry-on bag at Asheville Regional Airport in February 2021, but the lawmaker was not charged.",
    "However, those same lawmakers are the same ones who not only made a \"monster\" like Cawthorn possible in the first place but eased the path to him winning in 2020.",
    "It's the Hypocrisy\nDaily Kos, imobannon, 4/28/2022\nI think nobody on kos has brought this up yet, because we don't care if someone is exploring their sexuality.",
    "\"Insider trading by a member of Congress is a serious betrayal of their oath, and Congressman Cawthorn owes North Carolinians an explanation,\" Tillis tweeted.",
    "Daily Kos fights for a progressive America by empowering its community and allies with information and tools to directly impact the political process.",
    "x\nInsider trading by a member of Congress is a serious betrayal of their oath, and Congressman Cawthorn owes North Carolinians an explanation.",
    "David Wheeler, with Fire Madison Cawthorn, said his organization filed the complaint after receiving information of alleged insider trading.",
    "This is not politics as usual,? said political expert, Chris Cooper, a political science professor at Western Carolina University.",
    "And dudes in windowless white vans who'll give you a discount on a George Foreman grill if you'll have just one beer with them.",
    "When they go so far as to ridicule or shame or demean people who are maybe doing the same things as him, but are not hiding it.",
    "The Ukrainian government is incredibly corrupt and is incredibly evil,? Cawthorn was recorded saying on cell phone video.",
    "However, while making an appearance at a Macon County GOP event earlier this year, he didn't express the same beliefs.",
    "\"The opposition research about him now falling off the back of the GOP truck is prodigious,\" Garcia wrote.",
    "We hope this local and wider community can help leverage our orange passion for progressive politics.",
    "\"There needs to be a thorough and bipartisan inquiry into the matter by the House Ethics Committee.\"",
    "There needs to be a thorough and bipartisan inquiry into the matter by the House Ethics Committee.",
    "Please jump the fold for links to weekly stories I hope you find interesting and useful.",
    "He has made comments about being invited to sex and drug parties in Washington, D.C.",
    "The lawmaker has even flip-flopped on his stance on the Jan. 6, 2021, Capitol riot.",
    "While in Asheville at a campaign stop, he also shared his thoughts on Ukraine.",
    "\"I feel like I don't have any responsibility with them attacking the Capitol.",
    "A photo obtained by the TV station shows a loaded Staccato C2 at the airport.",
    "This is the weekly DKos Asheville Open Thread for Saturday, April 30th, 2022.",
    "But we do care when a bigot openly contradicts their own professed morals.",
    "It's all Cawthorn today as he continued to have a busy week in the news.",
    "We actually don't know where all the political prisoners are,? he said.",
    "Thanks for reading and contributing, hope you have a safe weekend.",
    "Good guys? with guns are ubiquitous, as are bad guys with guns.",
    "I think it was despicable,? he said in January 2021.",
    "We're tired of all the violations,? Wheeler said.",
    "This is not dismissed as another campaign slam.\"",
    "I'm about to define what a woman is for you.",
    "And maybe just a skosh of black tar heroin.",
    "Senator how to define the word \"woman.\"",
    "Good day and welcome to DKos Asheville.",
    "And morally ambiguous guys with guns.",
    "Remember that Zelensky is a thug.",
    "Come on, you know you want to.",
    "Take note Madam Speaker.",
    "Is Cawthorn Gay?",
    "XX chromosomes.",
    "And teenagers.",
    "And toddlers.",
    "Who Cares."
  ]
}