{
  "id": 2675,
  "mediaId": 136,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Madison Cawthorn Losing GOP Support Despite Keeping Large Primary Lead",
  "image": "https://d.newsweek.com/en/full/2028479/madison-cawthorn.webp?w=790&f=5ecc4854f62419af3890225fdb8ed7fd",
  "link": "https://www.newsweek.com/madison-cawthorn-polling-republican-primary-north-carolina-1702169",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    2341,
    2341,
    2303,
    1147,
    1147,
    742,
    742,
    689,
    689,
    2303,
    2095,
    2095,
    1501,
    1501,
    1697,
    1697,
    1646,
    1646,
    1421,
    1421,
    562,
    562,
    428,
    428,
    146,
    146,
    2537,
    2537,
    2672,
    2672,
    2834,
    2834
  ],
  "sentences": [
    "In early March, the Republican congressman drew backlash after he called Ukraine's President Volodymyr Zelensky a \"thug\" and his government \"incredibly evil\" shorty after Russia's full-scale invasion of the Eastern European country began.",
    "The North Carolina Republican argued that the popular Netflix show House of Cards, which presents the fictional story of a corrupt political couple in Washington, is largely representative of reality in the nation's capital.",
    "While the scandals appear to have had an impact, according to new polling released Thursday by Differentiators Data, Cawthorn still maintains a double-digit lead in his Republican primary for North Carolina's 11th District.",
    "The Republican lawmaker has endured numerous scandals in recent weeks, with the number ramping up rapidly as opponents could be spreading dirt on the Trump-backed freshman incumbent in an effort to oust him from office.",
    "Although the new polling was conducted beforehand, the Daily Mail first reported on Thursday that an ethics complaint had been filed against Cawthorn due to an allegedly inappropriate relationship with a male staffer.",
    " Madison Cawthorn (@CawthornforNC) April 28, 2022\nCawthorn later tweeted a screenshot of an article from The Epoch Times titled \"Rep. Cawthorn Says 'Establishment' Targeting Him With 'Coordinated Drip Campaign.'\"",
    "In what appeared to be a reference to the Daily Mail report, Cawthorn tweeted on Thursday evening: \"Many of my colleagues would be nowhere near politics if they had grown up with a cell phone in their hands.\"",
    "Representative Madison Cawthorn, a North Carolina Republican, appears to be losing substantial support from GOP voters while still maintaining a lead over his chief primary challenger, new polling shows.",
    "House Minority Leader Kevin McCarthy, a California Republican, told reporters days later that Cawthorn had admitted in a private conversation that the claims were \"exaggerated.\"",
    "Cawthorn, who has been endorsed by former President Donald Trump, faces opposition from Republican leaders in his state, including North Carolina's GOP Senator Thom Tillis.",
    "The April results have a margin of error of plus or minus 4.9 percentage points, whereas the March data had a margin of error of plus or minus 4.5 percentage points.",
    "Critics argued that the photos demonstrated the conservative lawmaker's hypocrisy, as he has been highly critical of progressive views on gender and sexuality.",
    "Then in late March, Cawthorn faced even greater Republican anger after controversial claims he made during an interview with the Warrior Poet Society podcast.",
    "The incumbent congressman is still supported by 38 percent of GOP voters, compared to 21 percent who back his top rival, state Senator Chuck Edwards.",
    "The dip in his polling numbers came as Cawthorn has faced substantial criticism from prominent Republicans over a slew of scandals in recent weeks.",
    "The report included a video of Cawthorn and the staffer, Stephen Smith, making sexual jokes before Smith gropes his crotch area in a vehicle.",
    "The Republican lawmaker said that leaders he \"looked up to\" invited him to an \"orgy\" and did a \"key bump of cocaine\" while he looked on.",
    "In March, nearly two-thirds (64 percent) of Republicans viewed the incumbent favorably whereas only 29 percent held an unfavorable view.",
    "The latest polling also demonstrates that Cawthorn's favorability has declined while more voters now view him unfavorably.",
    "The Daily Mail also included suggestive Venmo messages included with payments from Cawthorn to Smith dating back to 2018.",
    "The April polling also shows a dramatic decline in support for Cawthorn however, and a surge in support for Edwards.",
    "In March, Differentiators Data's survey results had Cawthorn with the backing of 49 percent of Republican voters.",
    "Six other GOP contenders were included in the March and April polling, but none registered above single digits.",
    "Many of my colleagues would be nowhere near politics if they had grown up with a cell phone in their hands.",
    "Now, Cawthorn's favorability has fallen to 51 percent with 44 percent saying they view him unfavorably.",
    "The GOP congressman later said that he supported the Ukrainian people and criticized Russia's actions.",
    "The GOP congressman dismissed the reporting however, describing the images as \"goofy vacation photos.\"",
    "Those comments said things such as \"getting naked for me in Sweden\" and \"the quickie at the airport.\"",
    "Other Republicans slammed the remarks, as did some Democrats, arguing that they were inaccurate.",
    "He also strongly criticized the North Carolina Republican, saying he'd lost his trust.",
    "Then last Friday, Politico first reported images of Cawthorn wearing lingerie.",
    "(RINO is an acronym signifying \"Republican in name only.\")",
    "Newsweek reached out to Cawthorn and Smith for comment.",
    "The congressman wrote, \"We see through it, RINOs.\"",
    "The new survey was carried out on April 25 and 26.",
    "Edwards stood at just 14 percent last month.",
    "Tillis endorsed Edwards at the end of March."
  ]
}