{
  "id": 2678,
  "mediaId": 169,
  "date": "4/29/2022 12:00:00 AM",
  "headline": "Why Madison Cawthorn triggers Republicans",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/04/madison-cawthorn-0429221.jpg",
  "link": "https://www.salon.com/2022/04/29/why-madison-cawthorn-triggers/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Amanda Marcotte",
  "authorUrl": "https://www.salon.com/writer/amanda_marcotte",
  "termIds": [
    870,
    1073,
    1680,
    1836,
    1839,
    2303,
    2331,
    428
  ],
  "sentences": [
    "As New York Times opinion columnist Jamelle Bouie references in that tweet, the reason that Republicans are apparently pulling out all the stops to destroy Cawthorn has nothing to do with his flirtations with Nazism, his regular run-ins with the law or his unsubtle incitement language.",
    "There's little he can say to mainstream reporters that could damage the Republican brand, but there's a real and present danger that his need for attention could cause him to blow up their spot on the only media outlets they care about, these unknown-to-outsiders right-wing sources.",
    "Inside that bubble, the image of Republican politicians is very different: They're all pious, clean-living Christians who spend their Saturday nights in prayerful reflection instead of sucking down overpriced cocktails at the bar in Trump's D.C. hotel.",
    "pic.twitter.com/YNKB0qyivd\n No Lie with Brian Tyler Cohen (@NoLieWithBTC) April 22, 2022\nWhen he blew that off, another bit of blackmail was leaked to the Daily Mail, this time a video of one of Cawthorn's male staffers patting him near the crotch.",
    "Considering that breathless urban legend-style stories are the lingua franca of right-wing media, one would think that Republicans would just blow this one off as Cawthorn doing what he usually does, which is talking smack to get attention.",
    "In other words, as silly as all this is, there's actually a substantive takeaway: This story shows just how much more Republicans depend on an elaborate and often subterranean conservative media system than they do on mainstream media.",
    "In just the past week, the efforts to destroy Cawthorn have included GOP-funded attack ads against him, a push to have his alleged financial crimes exposed, and, what's most fun of all, an \"oppo dump\" of embarrassing photographs.",
    "Imagine how much worse that effect is for the millions of Republicans  the most energized and active members of the base  whose media diet is largely made up of YouTube shows and right-wing podcasts and Facebook personalities.",
    "The neologism that connects New Agers and Madison Cawthorn, explained\nRepublicans are plenty media-savvy, especially around dirt-flinging, so there's little doubt that they understand the dangers of the Streisand effect.",
    "True, neither sex workers nor cocaine was mentioned in the article, but a reader walks away with a strong sense that Republican parties can get pretty wild, especially by the standards of their Midwest Christian voters.",
    "But it also speaks to the darker truth about how much Republicans depend on voters who self-insulate from reality  and what lengths they will go to in order to keep their voters inside that right-wing media bubble.",
    "Indeed, the image Cawthorn was trying to construct of himself on the \"Warrior Poet Society\" podcast was that of a teetotaling naf who simply could not believe the deviance he was exposed to in the big city.",
    "None of that information will penetrate the information bubble Republican voters have constructed for themselves, of fundamentalist YouTubers and Facebook personalities like Ben Shapiro and Candace Owens.",
    "Nah, it's because he went on a podcast run by something called the \"Warrior Poet Society\" and declared that Republican congressmen in their 60s and 70s invite him to orgies and do cocaine in front of him.",
    "they are coming down so hard on this guy that i half wonder if the cocaine orgies are real https://t.co/TaWXLR3Jz9\n b-boy bouiebaisse (@jbouie) April 29, 2022\nWant more Amanda Marcotte on politics?",
    "This anti-Cawthorn campaign suggests that they are willing to make a trade-off, however: Keep the story alive in the mainstream media in order to destroy Cawthorn's reputation in right-wing media.",
    "They're way more worried about cocaine-and-orgies talk on a Christian podcast  one that few people in the legacy media had ever heard of until last week  than what's printed in the New York Times.",
    "This anti-Cawthorn campaign suggests that they are willing to make a trade-off, however: Keep the story alive in the mainstream media in order to destroy Cawthorn's reputation in right-wing media.",
    "And boy, it couldn't be happening to a nicer guy: Rep. Madison Cawthorn of North Carolina, part of the freshman class of Republicans who work more as full-time trolls than traditional lawmakers.",
    "In a world where so much news is just plain depressing, it's an unexpected delight to watch the Republican establishment pull out their bag of dirty tricks and ratf**k one of their own.",
    "And on the rare occasion when right-wingers do interact with mainstream media sources, they've been inoculated in advance by being told, over and over again, that it's all \"fake news.\"",
    "Conservative media consumers are embedded in a seemingly infinite swirl of smaller and often independent outlets that fly under the radar of most people who aren't inside the bubble.",
    "The supposed crotch-touching video is really more of a leg-touching video, only really scandalous to men so homophobic they think any physical contact between men will make them gay.",
    "The GOP has been incredibly successful at convincing their voters to reject all forms of reality-based information in favor of a contained bubble of right-wing disinformation.",
    "Instead, the party has gone all-out to destroy him, which only has the effect  as Bouie noted  of making the story seem more plausible by dint of their extreme defensiveness.",
    "That's why the GOP is intensely worried about what their politicians say on YouTube shows, and don't especially care what they say on cable news or to the Washington Post.",
    "But as soon as they returned to Fox News, they slipped right back under the waves, into a world of right-wing fiction that has no relationship to reality.",
    "New York Magazine published photos and details in 2017 of one of the infamous parties at the Washington townhouse of former Trump adviser Steve Bannon.",
    "For those folks, Fox News is the \"mainstream\" source that they watch to validate the even more delusional crap they get off their internet buddies.",
    "Berkeley researchers showing that, if Fox News viewers are paid to switch to CNN, their engagement with reality dramatically increases.",
    "Worse, that bubble isn't even primarily composed of media outlets that ordinary news consumers have at least heard of, like Fox News.",
    "But outlets like that are the primary media diet of many people on the right: That show has more than a million YouTube subscribers!",
    "It isn't a huge shock news to consumers of mainstream media to hear reports that Republicans on Capitol Hill like to tie one on.",
    "The Republican goal here is clearly to get Cawthorn out of Congress and, more crucially, out of the right-wing media ecosystem.",
    "But for people who live inside the conservative media bubble, this sort of stuff could easily be read as Satanic decadence.",
    "All this suggests that he isn't the wide-eyed Christian ingenue who is shocked that people stay out past 10 p.m.",
    "Keeping those people ignorant and fired up about nonsense is the backbone of Republican political strategy.",
    "JUST IN: New photos obtained by @politico appear to show Madison Cawthorn wearing women's lingerie.",
    "Paying them to watch CNN makes them less gullible\nRecently, a study was released by Yale and U.C.",
    "The Cawthorn scandal is a hilarious good time, and no one should feel bad about laughing over it.",
    "The Cawthorn scandal is a hilarious good time and no one should feel bad about laughing over it.",
    "They rapidly got better at understanding scientific information and more cognizant of facts.",
    "They prefer stuff like \"Warrior Poet Society\" because it flatters their basest instincts.",
    "First, Politico published photos of Cawthorn at a party, drinking and wearing lingerie.",
    "That's why the leakers of these photos and video believe they will damage Cawthorn.",
    "Until this scandal, the \"Warrior Poet Society\" was totally unknown to outsiders.",
    "Cawthorn recently accused fellow Republicans of attending cocaine orgies.",
    "None of which is to deny that Republican voters have agency and autonomy.",
    "They want to be ignorant, and their leaders want them to stay that way.",
    "They actively choose to live in the world of right-wing fantasy.",
    "Even more telling is how tame the content of the oppo dump is.",
    "They could turn on CNN or read a newspaper if they wanted to.",
    "The lingerie photos clearly are clearly just a goof.",
    "Subscribe to her newsletter Standing Room Only.",
    "Subscribe to her newsletter Standing Room Only.",
    "RELATED: Can Fox News viewers be deprogrammed?",
    "But neither Bannon nor his guests cared much.",
    "Want more Amanda Marcotte on politics?",
    "Man, Republicans really hate this guy.",
    "RELATED: What is a \"warrior poet\"?",
    "Why should they?",
    "But no!"
  ]
}