{
  "id": 2695,
  "mediaId": 237,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Thom Tillis continues attacks on fellow North Carolina Republican Madison Cawthorn",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/e2e136f/2147483647/strip/true/crop/1024x538+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fc8%2Fc4%2F533d06e04fbebb73dad7c112233b%2Fap22100566302724.jpg",
  "link": "https://www.washingtonexaminer.com/news/house/thom-tillis-continues-attacks-on-fellow-north-carolina-republican-madison-cawthorn",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Kerr",
  "authorUrl": "",
  "termIds": [
    821,
    894,
    1383,
    1553,
    1609,
    1647,
    2087,
    2303,
    2341,
    337,
    428,
    558,
    571,
    2590,
    2710,
    2834
  ],
  "sentences": [
    "Multiple government watchdog groups told the Washington Examiner on Tuesday that Cawthorn's statements surrounding his ownership of the Let's Go Brandon cryptocurrency meme coin, combined with his close relationship with the coin's ringleader, suggest that the lawmaker may have had advanced, nonpublic knowledge of a Dec. 30 announcement that caused the coin's value to swell upward by 75%.",
    "Tillis said Cawthorn has no right to tout an amendment to President Joe Biden's $1.2 trillion infrastructure bill that brought broadband internet to western North Carolina, noting that the freshman representative ultimately voted against the legislation.",
    "The senator also addressed his decision to endorse one of Cawthorn's primary challengers, state Sen. Chuck Edwards, and suggested that other North Carolina Republican lawmakers share his concerns about the freshman representative.",
    "\"He's made comments at the worst possible time with respect for [Ukraine's] President Zelensky, called him a thug, now he apparently has this insider trading thing which just needs to be handled like everyone else,\" Tillis said.",
    "When I say a drip campaign, it's where they're going to drop an attack article every one or two days just to try and kill us by death by a thousand cuts, and that is really their main strategy,\" he said.",
    "Cawthorn referred to Tillis in a video statement Tuesday evening in which he said establishment Republicans were trying to quash his reelection bid through a coordinated smear campaign.",
    "\"Insider trading by a member of Congress is a serious betrayal of their oath, and Congressman Cawthorn owes North Carolinians an explanation,\" Tillis said in a tweet Wednesday.",
    "\"Don't go out in western North Carolina and say you brought broadband there when you voted against the very bill he criticized me for to get there,\" Tillis told Politico.",
    "\"I want a delegation that works together, I don't want a delegation that gets together  minus one  and talks about the challenges that member is causing,\" he said.",
    "\"They are putting hundreds of thousands of dollars, millions of dollars, to be able to defeat me, and they're starting to say these ridiculous, salacious things.\"",
    "Despite facing a flurry of embarrassing headlines, Cawthorn is favored to win his primary, Republican insiders told the Washington Examiner on Wednesday.",
    "\"We have the North Carolina political establishment and one [Republican in name only] senator who have really targeted me and are coming hard,\" he said.",
    "Also on Tuesday, Cawthorn was cited for having a handgun as he attempted to cross a security checkpoint at Charlotte Douglas International Airport.",
    "Just In...\nSen. Thom Tillis has unleashed a fresh round of attacks on his fellow North Carolina Republican lawmaker, Rep. Madison Cawthorn.",
    "Tillis called on the House Ethics Committee on Wednesday to investigate allegations that Cawthorn engaged in an insider trading scheme.",
    "It marked the second time Cawthorn has been cited for having a handgun at an airport since being sworn into Congress 15 months ago.",
    "\"There have only been two times in my brief political career where I've endorsed a challenger to a sitting Republican.",
    "One was Chuck Edwards, the other one was me when I challenged a two-term Republican in the statehouse,\" Tillis said.",
    "Tillis also said Cawthorn, who faces seven challengers in his May 17 primary, has \"temperament and judgment issues.\"",
    "\"There needs to be a thorough and bipartisan inquiry into the matter by the House Ethics Committee.\"",
    "\"If there's no problem there, there won't be any problem with having transparency in it.\"",
    "\"We're starting to see this coordinated drip campaign."
  ]
}