{
  "id": 2697,
  "mediaId": 21,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "North Carolina GOP senator calls for Madison Cawthorn's cryptocurrency purchases to be investigated by House Ethics Committee",
  "image": "https://i.insider.com/626a08627f0c1c0018904c19?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/gop-senator-calls-for-madison-cawthorns-crypto-purchases-investigated-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Cheryl Teh",
  "authorUrl": "https://www.businessinsider.com/author/cheryl-teh",
  "termIds": [
    2303,
    2341,
    2341,
    2303,
    558,
    558,
    545,
    545,
    562,
    562,
    428,
    367,
    367,
    428,
    2834,
    2834
  ],
  "sentences": [
    "Republican Senator Thom Tillis has called for Congress to conduct a bipartisan investigation of his House colleague, Rep. Madison Cawthorn, over the latter's undeclared cryptocurrency purchases.",
    "Tillis, who also represents North Carolina, said on Wednesday that Cawthorn's possible violation of congressional insider-trading laws needs to be looked into by the House Ethics Committee.",
    "Tillis was also one of the Republican leaders who chastised Cawthorn after the lawmaker claimed he had witnessed \"sexual perversion\" and drug use among his Congress colleagues.",
    "Besides his orgy claims, he was also the subject of a recent Politico article that ran photos showing him decked out in lingerie, which he dismissed as \"goofy vacation photos.\"",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Responding to Cawthorn's allegations, Tillis said the congressman had demonstrated \"a consistent pattern of juvenile behavior, outlandish statements, and untruthfulness.\"",
    "The Washington Examiner reported on Tuesday that Cawthorn publicly declared that he had purchased a meme coin called \"Let's Go Brandon,\" named after an anti-Biden chant.",
    "This was the second time Cawthorn had been found with a gun in his carry-on luggage, having also been cited at the Asheville Regional Airport in February last year.",
    "The following day, Brandon Brown, the NASCAR driver for whom the coin was named, said that the cryptocurrency would sponsor him, causing its value to skyrocket.",
    "For one, a super PAC tied to Tillis spent $300,000 on an advertising campaign against Cawthorn, pushing the message that the Cawthorn \"lies for the limelight.\"",
    "\"Insider trading by a member of Congress is a serious betrayal of their oath, and Congressman Cawthorn owes North Carolinians an explanation,\" Tillis tweeted.",
    "Cawthorn is suspected of possibly violating a federal conflict-of-interest law called the Stop Trading on Congressional Knowledge Act (STOCK).",
    "A senator from Rep. Madison Cawthorn's home state has called for the congressman to be investigated for his undeclared crypto purchases.",
    "Congress members must, by law, publicly declare their cryptocurrency trades worth more than $1,000 in their transaction reports.",
    "On December 29, Cawthorn was seen at an event with James Koutoulas, one of the people behind the crypto coin, per the outlet.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Chris Seward/AP\nRepublican Senator Thom Tillis has called for Rep. Madison Cawthorn to be investigated.",
    "Despite representing the same party in the same state, Tillis has come out strongly to oppose Cawthorn.",
    "In the same statement, Tillis threw his weight behind Cawthorn's primary challenger, Chuck Edwards.",
    "Tillis said that Cawthorn \"owes North Carolinians an explanation\" about his crypto investments.",
    "Tillis previously chastised Cawthorn for embarrassing the state with \"juvenile behavior.\"",
    "Cawthorn was also cited this week for bringing a loaded gun into the Charlotte airport.",
    "However, Cawthorn did not disclose his purchase of the cryptocurrency to Congress.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Cawthorn has been the subject of a series of scandals.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}