{
  "id": 2700,
  "mediaId": 234,
  "date": "4/28/2022 12:00:00 AM",
  "headline": "Madison Cawthorn Keeps Getting Implicated in Possible Crimes",
  "image": "https://media.vanityfair.com/photos/626afea6c79ffab65a2f7cca/master/w_2240,c_limit/GettyImages-1236654133.jpg",
  "link": "https://www.vanityfair.com/news/2022/04/madison-cawthorn-possible-crimes",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Caleb Ecarma",
  "authorUrl": "https://www.vanityfair.com/contributor/caleb-ecarma",
  "termIds": [
    2341,
    2341,
    2303,
    821,
    821,
    2303,
    2052,
    2052,
    1609,
    1553,
    1553,
    1609,
    1738,
    1738,
    428,
    533,
    533,
    428
  ],
  "sentences": [
    "More Great Stories From Vanity Fair\n Inside the Virus-Hunting Nonprofit at the Center of the Lab-Leak Controversy\n Jared Kushner and Donald Trump Probably Won't Be Splitting a Milkshake Anytime Soon\n CNN Leaves the Drama Behind With Focus on War in Ukraine\n Trump's Truth Social Is an Even Bigger Humiliation Than Previous Business Failures\n The Clock Is Ticking on the January 6 Investigation\n The Washington Post Checks In, Finds Trump Is Still a Lying Sociopath\n A Ukrainian Woman Explains the War to Europe's Skeptics\n From the Archive: How Playboy Imran Khan Became the Prime Minister of Pakistan\n Not a subscriber?",
    "The freshman lawmaker warned his Instagram followers on Tuesday that the establishment? is targeting him in a coordinated drip campaign,? adding, They're going to drop an attack article every one or two days just to try and kill us with a death by 1,000 cuts, and that is really their main strategy.? Cawthorn is up for reelection in North Carolina's 11th Congressional District.",
    "This all comes after Cawthorn was given a stern talking to from Republican leader Kevin McCarthy last month for feigning moral outrage over allegations that Republican lawmakers were snorting cocaine in front of him and inviting him to orgiesclaims Cawthorn later admitted he largely made up.",
    "(NASCAR reportedly shut down the sponsorship agreement in early January, and by February the coin's value had taken a nosedivea decline that Let's Go Brandon's James Koutoulas claimed was also caused by some of the coin's top owners dumping their holdings en masse, the Examiner noted.)",
    "The following day, the racing team for Brandon Browna NASCAR driver who incidentally inspired the let's go, Brandon? sayingannounced Brown was partnering with the Let's Go Brandon coin for the 2022 season, which led to a 75% spike in the coin's value, per the Examiner.",
    "You can't effectively Drain the Swamp without firing all RINOs,? he wrote, before retweeting a supporter's post claiming that the Swamp [is] so desperate to takeout [Cawthorn].? (Cawthorn's office did not immediately respond to Vanity Fair's request for comment.)",
    "In a letter Wednesday, Democrats Bennie Thompson and Bonnie Watson Coleman asked the Transportation Security Administration to use the full extent? of its enforcement actions against people like Cawthorn, who on Tuesday was caught (for the second time!)",
    "As reported by Insider, Cawthorn also seemingly ran afoul of federal conflict-of-interest statutes by failing to report his investment in the coin; lawmakers have a 30-day window to submit transaction reports on their stake in a given cryptocurrency.",
    "There needs to be a thorough and bipartisan inquiry into the matter by the House Ethics Committee.?\nCawthorn has yet to respond to the insider trading allegations, but he did appear to lash out at Republicans like Tillis in a Thursday morning tweet.",
    "It appears both Democrats and Republicans are ready for Representative Madison Cawthorn, who has been on a truly remarkable scandal spree in recent months, to be held accountable forone of his many potential crimes.",
    "Cawthorn became the latest congressional member to face insider trading accusations for promoting an alleged pump-and-dump cryptocurrency scheme, according a report from the Washington Examiner.",
    "The same day, North Carolina's Republican senator Thom Tillis, who is backing Cawthorn's primary challenger, called for an investigation into Cawthorn for insider trading.",
    "A Tillis-linked super PAC has already spent more than $300,000 on an anti-Cawthorn attack ad in preparation for the race's May 17 primary, Axios reported last week.",
    "Cawthorn has continued to advertise the cryptocurrency on social media and made promotional appearances at Let's Go Brandon coin events, according to the Examiner.)",
    "Tillis threw his support behind Cawthorn's primary challenger, North Carolina state senator Chuck Edwards, in the aftermath of the cocaine? and orgy? controversy.",
    "In December the 26-year-old publicly flaunted his stake in the Let's Go Brandon cryptocurrencya meme coin that derives its name from a slogan mocking Joe Biden.",
    "At its height, the combined value of every Let's Go Brandon coin reportedly surpassed $570 million.",
    "(Though, Insider also noted that Cawthorn may have lied about investing in Let's Go Brandon coin.",
    "If Cawthorn is found to have violated the ethics rule, he could be required to pay a small fine.",
    "Insider trading by a member of Congress is a serious betrayal of their oath,? Tillis tweeted.",
    "(Just last week Politico released leaked party photos of him wearing women's lingerie.)",
    "Join Vanity Fair to receive full access to VF.com and the complete online archive now.",
    "bringing a loaded firearm through an airport security checkpoint."
  ]
}