{
  "id": 2706,
  "mediaId": 63,
  "date": "4/27/2022 12:00:00 AM",
  "headline": "A Time Line Of Madison Cawthorn's MisstepsFrom Visiting Nazi Retreat To Wild Orgy Claims",
  "image": "https://imageio.forbes.com/specials-images/imageserve/62697c45d9f94eb3715a6d84/Cawthorn-Gun-At-Airport/0x0.jpg?fit=crop&format=jpg&crop=3408,1917,x0,y0,safe",
  "link": "https://www.forbes.com/sites/nicholasreimann/2022/04/27/a-timeline-of-madison-cawthorns-missteps-from-visiting-nazi-retreat-to-wild-orgy-claims/",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicholas Reimann",
  "authorUrl": "https://www.forbes.com/sites/nicholasreimann/",
  "termIds": [
    2303,
    1147,
    1147,
    919,
    919,
    1332,
    1332,
    1501,
    1501,
    1769,
    1769,
    2303,
    545,
    545,
    2553,
    2553,
    2834,
    2834
  ],
  "sentences": [
    "Comments Cawthorn made about orgies and cocaine in particular got a lot of members very upset,? McCarthy said, adding, You can't make statements like that as a member of Congress.? McCarthy also said he urged Cawthorn to make life choices to turn himself around.? His comments about Zelensky also drew backlash from many Republicans, like Rep. Tom Rice (R-S.C.), who told CNN he thinks Cawthorn is living in a dream land? and is not a serious legislator.?\nCawthorn is a staunch Trump supporter, and his squabbles with top congressional Republicans don't seem to bother the former president.",
    "August 10, 2020Reports surface of 2017 photos Cawthorn posted on Instagram showing him visiting Eagle's Nest, the Alpine retreat of Nazi dictator and mass murderer Adolf Hitler, along with his comment that visiting the vacation house of the Fuhrer? had been on his bucket list for awhile.? Cawthorn, then a candidate in North Carolina's 11th District House race, deletes the photos that day.",
    "Topline\nA wave of controversy hitting right-wing firebrand Rep. Madison Cawthorn (R-N.C.) shows no signs of letting up, with a Republican senator on Wednesday calling for an investigation into potential insider trading by the youngest member of Congresshere are the many other troubles he has faced since launching a congressional bid two years ago.",
    "October 18, 2020Several of Cawthorn's former Patrick Henry College classmates release a letter saying he frequently took women to secluded areas to forcefully engage in unwanted sexual advances? and also took part in a well-documented case of vandalism? while he was a student there.",
    "He also accuses Zelensky of pushing woke ideologies.?\nMarch 27, 2022Cawthorn says on the Warrior Poet Society? podcast that D.C. political figures invited him to a sexual get-together,? and he witnessed drug control advocates doing key bumps? of cocaine in front of him.",
    "He taunts his Democratic opponent after being declared the winner, tweeting, Cry more, lib.?\nJanuary 6, 2021Cawthorn speaks at former President Donald Trump's Stop the Steal? rally in Washington, just three days after being seated in Congress.",
    "August 12, 2020The Asheville, North Carolina, news outlet AVL Watchdog reports that Cawthorn said in a 2017 deposition he was rejected from the Naval Academy before a 2014 car crash left him partially paralyzed and requiring a wheelchair.",
    "Thom Tillis (R-N.C.) calls on the House Ethics Committee to investigate Cawthorn after the Washington Examiner reported that Cawthorn could be implicated in an insider trading scheme involving the Let's Go Brandon cryptocurrency.",
    "July 29, 2021Cawthorn gets into a shouting match with Rep. David McKinley (R-W.Va.) and reportedly berates McKinley's staff over being named a cosponsor of a bill to which he didn't want to attach his name.",
    "Cawthorn later claimed the images were goofy vacation photos during a game on a cruise.?\nApril 26, 2022Cawthorn is cited for having a gun in a carry-on bag at Charlotte Douglas International Airport.",
    "April 22, 2022Politico publishes photos showing Cawthorn wearing women's lingerie and drinking while attending a party, in sharp contrast with his self-proclaimed traditional Christian values.",
    "March 10, 2022Video surfaces of Cawthorn calling Ukrainian President Volodymyr Zelensky a thug? in charge of an incredibly evil? government following the Russian invasion of Ukraine.",
    "House Minority Leader Kevin McCarthy (R-Calif.) told reporters following a 30-minute meeting with Cawthorn last month that the freshman congressman had lost his trust.",
    "April 19, 2022A North Carolina judge releases dashcam footage showing Cawthorn being pulled over at a traffic stop and cited for driving with a revoked license.",
    "Cawthorn's antics have drawn sharp criticism from both the left and the right, and seem to have particularly roiled his party's leadership.",
    "Trump's supporters went on to storm the U.S. Capitol in rioting that left five dead and more than 100 police officers injured.",
    "February 15, 2021Cawthorn is questioned for attempting to bring a handgun and a loaded magazine onto an airplane in Asheville.",
    "Cawthorn dropped out of the small Christian college after one semester, where he earned mostly D's, according to AVL Watchdog.",
    "November 3, 2020At the age of 25, Cawthorn becomes the youngest person elected to Congress since Jed Johnson Jr. in 1964.",
    "Kevin McCarthy's Awful Few Days: Embarrassing LeaksAnd More Unwanted Cawthorn And Marjorie Taylor Greene Stories (Forbes)",
    "House Minority Leader Kevin McCarthy (R-Calif.) later said Cawthorn admitted he made up or exaggerated the allegations.",
    "A member of McKinley's staff responds by filing an ethics complaint against Cawthorn.",
    "The revelation contradicted Cawthorn's claims that he was rejected after the crash.",
    "Trump featured Cawthorn as a speaker at his April 9 rally in North Carolina.",
    "Cawthorn had two previous speeding violations in the six months prior.",
    "Cawthorn faces seven Republican challengers in his reelection bid.",
    "The GOP primary is May 17, and early voting starts Thursday.",
    "Cawthorn has yet to earn a college degree.",
    "It's not clear whether he faces a fine.",
    "He is not criminally charged or fined.",
    "April 27, 2022Sen."
  ]
}