{
  "id": 2717,
  "mediaId": 129,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Madison Cawthorn Again Brought a Loaded Gun to the Airport, Officials Say",
  "image": "https://static01.nyt.com/images/2022/04/26/us/politics/26pol-cawthorn/26pol-cawthorn-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/04/26/us/politics/madison-cawthorn-gun-airport.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    2303,
    1501,
    1501,
    428,
    92,
    92,
    42,
    42,
    428,
    533,
    533,
    2602,
    2590,
    2590,
    2602,
    2834,
    2834,
    2942,
    2942
  ],
  "sentences": [
    "Representative Madison Cawthorn was briefly detained by the police on Tuesday after trying to bring a loaded gun through airport security in Charlotte, N.C., in his carry-on bag, the second time in a little more than a year that the North Carolina Republican has been stopped from flying with a firearm.",
    "Mr. Cawthorn, the youngest member of the House, was passing through Security Checkpoint D at Charlotte Douglas International Airport around 9 a.m. when a Transportation Security Administration agent saw the image of a gun on an X-ray machine, the authorities said.",
    "The situation recalled a previous encounter between airport security agents and Mr. Cawthorn in February 2021, when officials said that he tried to bring a loaded Glock pistol through a checkpoint at Asheville Regional Airport in North Carolina.",
    "Representative Kevin McCarthy of California, the House minority leader, told reporters that he had confronted Mr. Cawthorn over the false account and told him that he had lost trust in him and that he needed to turn his life around.",
    "The Charlotte-Mecklenburg Police Department confirmed the details of the latest episode involving Mr. Cawthorn, 26, a pro-Trump congressman whose bizarre antics and missteps had already threatened to derail his re-election bid.",
    "Some Republicans appeared to be growing weary of the drama surrounding Mr. Cawthorn after he called President Volodymyr Zelensky of Ukraine a thug? and his country incredibly evil? amid the Russian invasion.",
    "The civil penalties for trying to bring a gun through airport security average about $2,000 for an unloaded gun and $4,000 for a loaded one, with a maximum fine of $13,900, according to the T.S.A.",
    "Police officers were called to the checkpoint, where law enforcement officials said that Mr. Cawthorn acknowledged that the gun, a loaded Staccato 9-millimeter pistol, belonged to him.",
    "And in a lurid tale that he later acknowledged was not true, Mr. Cawthorn claimed last month that people he looked up to? in Washington had invited him to orgies and used cocaine.",
    "At the time, a spokesman for Mr. Cawthorn said that the lawmaker regularly used the same carry-on bag to stow his gun when he brought it to a shooting range.",
    "Mr. Cawthorn, 26, a pro-Trump North Carolina congressman, was cited for possession of a dangerous weapon on city property, police in Charlotte said.",
    "Describing Mr. Cawthorn as cooperative, the police said they cited the congressman with possession of a dangerous weapon on city property.",
    "That candidate, Jay Carey, posted pictures on Twitter of what he contended was a knife tucked into the back of Mr. Cawthorn's wheelchair.",
    "The Charlotte-Mecklenburg Police Department did not immediately provide a copy of its full report about the potential security breach.",
    "Last year, Mr. Cawthorn was accused by a Democratic opponent of bringing a knife with him to a school board meeting in North Carolina.",
    "A spokesman for Mr. Cawthorn did not respond to Mr. Carey's allegation, and the incident did not result in a criminal charge.",
    "regulations, unloaded firearms are only allowed in checked baggage, and must be stowed in a locked, hard-sided container.",
    "A spokesman for Mr. Cawthorn, who is in his first term, did not immediately respond to requests for comment on Tuesday.",
    "It was not clear where Mr. Cawthorn was traveling or if he later continued to his destination after he was released.",
    "Mr. Cawthorn, who is from western North Carolina, was charged in March with driving with a revoked license.",
    "The police in Charlotte, N.C., said that they took possession of the gun, which is standard practice.",
    "Mr. Cawthorn has used a wheelchair since being injured in an automobile accident when he was 18.",
    "Several Republicans are challenging him in next month's primary, on May 17.",
    "He has a May court date on the misdemeanor count, which carries jail time.",
    "Mr. Cawthorn was fined over that potential breach, Mark Howell, a T.S.A.",
    "The agency does not disclose individual fine amounts, he said.",
    "spokesman, said on Tuesday.",
    "Under T.S.A."
  ]
}