{
  "id": 2720,
  "mediaId": 165,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Madison Cawthorn Caught Trying to Bring a Gun Through Airport Security  Again",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/AP21174671534140c.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-news/madison-cawthorn-caught-trying-to-bring-a-gun-through-airport-security-again-1343160/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Bort",
  "authorUrl": "",
  "termIds": [
    1609,
    2303,
    42,
    533
  ],
  "sentences": [
    "Transportation Security Administration found the gun  a loaded Staccato 9mm handgun  at a security checkpoint around 9 a.m. and called the police, who gave Cawthorn a criminal misdemeanor citation for possessing a dangerous weapon on city property.",
    "Madison Cawthorn tried to bring a loaded gun through an airport in Charlotte on Tuesday, the latest in a string of unflattering headlines that has trailed the conspiracy theorist as he tries to withstand a slew of Republican primary challengers.",
    "The congressman doing coke in front of him was, actually, maybe a staffer in a parking garage from 100 yards away.?\nCawthorn was in the news last week, too, after Politico published photos of him partying in lingerie.",
    "House Minority Leader Kevin McCarthy summoned Cawthorn for a conversation to figured out exactly to what he was referring, only to discover, he claims, that Cawthorn was wildly exaggerating what he saw.",
    "A few weeks after he was cited for reckless driving in March, Cawthorn ruffled feathers by claiming that he's been invited to congressional orgies and seen his colleagues do cocaine in front of him.",
    "TSA found one in his carry-on bag at the Asheville Regional Airport in February of 2021, barely a month after he was sworn into Congress.",
    "There's nothing wrong with this, of course, so long as Cawthorn also allows others to enjoy their lives as they see fit.",
    "He was charged with driving with a revoked license in March, which came on top of two previous citations for speeding.",
    "Cawthorn's office did not immediately reply to a request for comment about the gun citation Tuesday morning.",
    "Cawthorn also has claimed he was strapped during the attack on the Capitol that Jan. 6.",
    "He delivered a rant against transgender rights on the House floor earlier this month.",
    "This isn't the first time he's been caught with a gun at an airport, either.",
    "He'd also been charged with driving with a revoked license in 2017.",
    "It's been a rough few months for the 26-year-old representative.",
    "So far, however, he's been largely unwilling to do so."
  ]
}