{
  "id": 2722,
  "mediaId": 21,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Madison Cawthorn is cited for bringing a loaded gun into the Charlotte Airport",
  "image": "https://i.insider.com/62655cdd9f6566001906635f?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/madison-cawthorn-cited-for-having-a-loaded-gun-in-charlotte-airport-2022-4",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brent D. Griffiths",
  "authorUrl": "https://www.businessinsider.com/author/brent-d-griffiths",
  "termIds": [
    1609,
    2303,
    42,
    92,
    93,
    428,
    533,
    562,
    2602,
    2834
  ],
  "sentences": [
    "The first-term North Carolina lawmaker was publicly rebuked by House Minority Leader Kevin McCarthy after suggesting on a podcast that he'd seen Washington Republicans use cocaine and been asked to engage in an orgy.",
    "Officers cited Rep. Madison Cawthorn on Tuesday for carrying a loaded gun inside of Charlotte Douglas International Airport, the latest in a string of controversies Cawthorn has found himself in.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "He was also previously cited, but not charged, in February 2021 for trying to bring a gun onto a plane in his carry-on luggage at Asheville Regional Airport.",
    "The department said it was \"standard procedure\" for its Airport Division to cite someone in lieu of arrest unless there are aggravating circumstances.",
    "Law enforcement said the Republican congressman was cooperative with officers and cited for \"possession of a dangerous weapon on city property.\"",
    "\"Mr. Cawthorn was released, and the CMPD took possession of the firearm, which is normal procedure,\" the department wrote in a series of tweets.",
    "On Friday, Politico published photos of Cawthorn wearing women's lingerie, which the lawmaker later said were \"goofy vacation photos.\"",
    "Fed up with his antics, Republican Sen. Thom Tillis of North Carolina has gone so far as to endorse one of Cawthorn's GOP challengers.",
    "The top House Republican had already previously admonished Cawthorn for calling Ukrainian President Volodymyr Zelenskyy a \"thug.\"",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Chris Seward/AP\nGOP Rep. Madison Cawthorn on Tuesday reportedly carried a loaded gun into the Charlotte airport.",
    "The Charlotte-Mecklenburg Police Department confirmed WSOC-TV's reporting that the gun belonged to Cawthorn.",
    "\"I just told him he's lost my trust, he's gonna have to earn it back,\" McCarthy told reporters on March 30.",
    "Last year, Cawthorn was cited for having a gun in his carry-on luggage at Asheville Regional Airport.",
    "TSA officers discovered a 9-millimeter handgun at approximately 9 a.m. on Tuesday.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "TSA officers discovered a 9-millimeter handgun at a security checkpoint.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Cawthorn is facing a tough primary challenge to hold on to his seat.",
    "Cawthorn has been the center of controversy in recent weeks.",
    "Rep. Madison Cawthorn, a Republican from North Carolina.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}