{
  "id": 2723,
  "mediaId": 409,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "Madison Cawthorn Stopped by Police from Taking Gun on Flight",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/04/madison-cawthorn.jpg?w=1592",
  "link": "https://www.nationalreview.com/news/madison-cawthorn-stopped-by-police-from-taking-gun-on-flight/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Arjun Singh",
  "authorUrl": "",
  "termIds": [
    2303,
    1609,
    1609,
    1501,
    1501,
    2303,
    42,
    42,
    93,
    92,
    92,
    93,
    562,
    562,
    2590,
    2590,
    2888,
    2888
  ],
  "sentences": [
    "According to Randall & Stump, a local criminal defense law firm, a conviction may bring up to 120 days in jail, fines, and a permanent criminal record.? These are separate from federal penalties levied by the TSA, which may be up to $13,090 per violation.",
    "Cawthorn was not charged for the offense and claimed the gun had been brought by mistake.? In a separate matter, Cawthorn is scheduled to appear in court in May on a misdemeanor charge of driving with a revoked license.",
    "The incident follows another case in February 2021, when Cawthorn was stopped at Asheville Regional Airport in North Carolina for possession of a firearm and loaded magazine in his carry-on bag.",
    "A statement released by the CMPD said that Cawthorn was issued citation for Possession of a Dangerous Weapon on City Property,? which is a Class 1 criminal misdemeanor charge.",
    "He was also widely criticized for claiming that he had been invited to orgies? in Washington, D.C. and that he had witnessed cocaine use by his Congressional colleagues.",
    "Cawthorn faced bipartisan criticism for calling Ukrainian president Volodymyr Zelensky a thug? in February, during the onset of Russia's invasion of the country.",
    "Meanwhile, Senator Thom Tillis (R., N.C.) has endorsed Cawthorn's primary opponent, State Senator Chuck Edwards, in an election scheduled to be held on May 17.",
    "House minority leader Kevin McCarthy (R., Calif.) said that he had lost his trust? in Cawthorn after the orgies and cocaine comments.",
    "Representative Madison Cawthorn (R., N.C.) was stopped by police on Tuesday after trying to bring a loaded handgun on board a flight.",
    "TheCMPD statement also read that Cawthorn was cooperative with CMPD officers? and acknowledged the firearm was his.",
    "Cawthorn was stopped at a checkpoint by Transportation Security Administration agents, who discovered the weapon.",
    "Per the CMPD, it is standard procedureto cite in lieu of arrest,? and Cawthorn was issued a citation.",
    "The incident occurred this morning at Charlotte Douglas International Airport in Charlotte.",
    "Officers from the Charlotte-Mecklenburg Police Department (CMPD) were called to the scene.",
    "Cawthorn, a first-term member of Congress, has elicited much controversy over his tenure.",
    "Cawthorn's office declined to comment on the matter when reached by National Review.",
    "Per reporting from CNN, the weapon was a Staccato C2 9-mm handgun.",
    "It is unclear whether Cawthorn has faced any of these penalties."
  ]
}