{
  "id": 2725,
  "mediaId": 237,
  "date": "4/26/2022 12:00:00 AM",
  "headline": "TSA confiscates gun from embattled Rep. Madison Cawthorn at airport: Report",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/ba12c8f/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F8f%2F66%2Fbfb476b14750af110f08bad3b9d6%2Fmadison-cawthorn-gun.jpg",
  "link": "https://www.washingtonexaminer.com/news/tsa-confiscates-gun-from-embattled-rep-madison-cawthorn-at-airport-report",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Virginia Aabram",
  "authorUrl": "https://www.washingtonexaminer.com/author/virginia-aabram",
  "termIds": [
    2303,
    93,
    428,
    533
  ],
  "sentences": [
    "Cawthorn, at 26 the youngest House member, has had several run-ins with the law regarding traffic violations in the past several months for speeding and driving under a revoked license.",
    "Cawthorn was first elected in 2020 and faces several Republican primary challengers in the newly redrawn 11th Congressional District, in the state's far-western tier.",
    "The North Carolina Republican allegedly tried to bring a 9 mm handgun past security at Charlotte Douglas International Airport, according to WSOC TV.",
    "The Transportation Security Administration confirmed it confiscated a gun, and other sources confirmed to the outlet that it belonged to Cawthorn.",
    "This would be the second time Cawthorn has tried to bring a gun past security, the first being at the Asheville Regional Airport in February 2021.",
    "He did not face any charges in that instance, though the offense could carry up to a $10,000 fine for a loaded weapon and a criminal referral.",
    "His legal troubles may also now extend to insider trading implications regarding a cryptocurrency.",
    "Authorities cited Rep. Madison Cawthorn for trying to bring a handgun aboard a flight Tuesday.",
    "Cawthorn's office did not immediately return the Washington Examiner's request for comment.",
    "But Cawthorn only needs 30% to win renomination, per North Carolina election rules.",
    "Cawthorn had a court date earlier this month as well as two more in May."
  ]
}