{
  "id": 2740,
  "mediaId": 169,
  "date": "4/25/2022 12:00:00 AM",
  "headline": "Madison Cawthorn called out for \"lying\" in new ad funded by Republican senator's super PAC",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/04/madison-cawthorn-0425222.jpg",
  "link": "https://www.salon.com/2022/04/25/madison-cawthorn-called-out-for-lying-in-new-ad-funded-by-senators-super-pac/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Skolnik",
  "authorUrl": "https://www.salon.com/writer/jon-skolnik",
  "termIds": [
    2303,
    2341,
    2341,
    821,
    821,
    2303,
    1851,
    1851,
    1882,
    1882,
    1609,
    1609,
    571,
    571,
    428,
    101,
    101,
    428,
    2590,
    2590
  ],
  "sentences": [
    "The ad, which reportedly cost the senator $310,000, was released on YouTube last Thursday, and references a number of the freshman congressman's dubious claims about his past  most notably that he was accepted into the Naval Academy before becoming paralyzed in a 2014 car accident.",
    "\"Madison Cawthorn has fallen well short of the most basic standards Western North Carolina expects from their representatives, and voters now have several well-qualified candidates to choose from who would be a significant improvement,\" Tillis said last month.",
    "Tillis has endorsed Cawthorn's primary opponent, state Sen. Chuck Edwards, who has also been backed by a number of other Republicans, including North Carolina state Sen. Phil Berger and House Speaker Tim Moore.",
    "RELATED: \"He's just a bad person\": Ex-staffer caught on tape blasting \"habitual liar\" Madison Cawthorn\nAfter the pictures were released, Cawthorn suggested that they were part of a left-wing smear campaign.",
    "The ad also suggests Cawthorn \"lied about conservatives,\" an apparent allusion to the congressman's recent allegations that he'd been invited to orgies by several of his GOP role models.",
    "A super PAC associated with Sen. Thom Tillis, R-N.C. accused Rep. Madison Cawthorn, R-N.C., of \"lying\" about his past in a new political ad released just last week.",
    "Last week, Cawthorn, staunch religious conservative, took a beating over recently-surfaced photos of him wearing lingerie in what appeared to be a party setting.",
    "\"I guess the left thinks goofy vacation photos during a game on a cruise (taken waaay before I ran for Congress) is going to somehow hurt me?\"",
    "\"Madison Cawthorn lied about being accepted to the Naval Academy to get elected,\" the 30-second spot, first reported by Axios, narrated.",
    "Last month, House Minority Leader Kevin McCarthy, R-Calif., firmly claimed that Cawthorn had \"lost my trust.\"",
    "\"They're running out of things to throw at me  Share your most embarrassing vacay pics in the replies.\"",
    "Cawthorn is facing a crowded field of re-election opponents, with seven GOP candidates in the running.",
    "Lying about conservatives, stolen valor, Madison Cawthorn lies for the limelight,\" it added.",
    "Those remarks earned the young conservative much scorn from much of his party.",
    "\"An attention-seeking embarrassment, Cawthorn's antics help him but hurt us.",
    "Want a daily wrap-up of all the news and commentary Salon has to offer?",
    "In perpetual pursuit of celebrity, Cawthorn will lie about anything.\"",
    "\"Now, Cawthorn's been caught lying about conservatives.",
    "Subscribe to our morning newsletter, Crash Course.",
    "The photos were first reported by Politico.",
    "he tweeted."
  ]
}