{
  "id": 2745,
  "mediaId": 43,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "Odds & Ends: News/Humor (with a \"Who Lost the Week?\" poll)",
  "image": "https://images.dailykos.com/images/1061051/story_image/Goats.png?1650402256",
  "link": "https://www.dailykos.com/story/2022/4/24/2092889/-Odds-amp-Ends-News-Humor-with-a-Who-Lost-the-Week-poll",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    845,
    845,
    850,
    850,
    1049,
    1049,
    1242,
    1242,
    1446,
    1446,
    2019,
    2019,
    1876,
    1876,
    2057,
    2057,
    500,
    500,
    2819,
    2819
  ],
  "sentences": [
    "Media outlet InfoWars, filing for bankruptcy in the face of mounting legal pressure over remarks by founder and conspiracy theorist Alex Jones, that the 2012 Sandy Hook shootings were a hoax\n Johnson & Johnson, forced to pay $99m to settle a lawsuit alleging that the company fuelled West Virginia's opioid epidemic (as it was not part of the $5bn settlement the company previously made with other states)\n Former state Department press secretary Morgan Ortagus, removed from this year's congressional primary ballot by the Tennessee GOP (despite her endorsement from 45) as she only moved to the state in 2021\n 45's fundraising campaign, ordered to pay $1.3 million in legal fees to former White House aide and The Apprentice? star Omarosa Manigault Newman, as an arbitrator ruled the NDA she was forced to sign was too vague to enforce\n The town of Tiburon, California, having to pay a $150k to a couple who were racially profiled by police (while working inside their own store) and must institute new police training\n Rep. Marjorie Taylor Greene, fumbling badly in a televised deposition (over whether she should be disqualified from running for re-election) to avoid committing perjury\n House GOP leader Kevin McCarthy, denying that he ever said (to colleagues) he was going to recommend a 45 resignation, only to have audiotapes showing  that he did\n Brian Kolfage and Andrew Badolato, former Steve Bannon aides, pleading guilty to pocketing hundreds of thousands of dollars solicited from donors while promising all donations would pay for the border wall\n Dion Marsh, facing life in prison if convicted of federal hate crimes in violently attacking four Orthodox Jewish men and hitting three of them with a car in a violent one-day spree in New Jersey\n Netflix, whose shares lost 35% in a day by reporting its first drop in subscribers for more than a decade, blaming the 100m households that share their passwords with freeloaders, but also competition from Disney+\n Oklahoma corrections officer Matthew Ware, convicted of allowing white supremacists to attack two Black pretrial detainees and placing a Black detainee to be stretched in restraints for criticizing how Ware ran the center\n Rep. Madison Cawthorn (R-NC), revealed as having being stopped once again by police for driving with a revoked license  and revealed as having partied in women's lingerie (after scolding liberals on transgender rights)\n Streaming subscription service CNN + (with hires such as Chris Wallace, Kasie Hunt.",
    "Jemele Hill and Audie Cornish), closing down just weeks after its debut\n Ex-Honduran president Juan Orlando Hernndez, who stepped down in January, losing his legal battle against extradition to the US to face charges of to face charges of drug trafficking, money laundering and machine gun usage\n Barry Ramey, affiliated with the Proud Boys and suspected of pepper spraying officials on January 6th and also threatening an FBI agent investigating his role in the riot  arrested by that very same FBI agent\n Former WH chief of staff Mark Meadows, previously having been suspected of being registered to vote in both Virginia and North Carolina (and just removed by NC officials)  now revealed as also being registered in South Carolina\n Jeremy Hanson, arrested for targeting Merriam-Webster with threats to commit anti-LGBTQ violence over the dictionary's use of language denoting gender\n Bill O'Reilly, caught on video cursing at and threatening a JetBlue worker  then denying he did that and attempting to blame the worker  at JFK Airport in New York after his flight was delayed by several hours\n Online giants (such as Google and Facebook) after the EU passed its Digital Services Act calling for them to do more to police illegal content on their platforms  and if they don't, risking fines of billions of dollars\n Multiple names listed - or a write-in - either way, please elaborate in a comment\n 151 votes Vote Now!",
    "3%\n4 votes\nRep. Marjorie Taylor Greene, fumbling badly in a televised deposition (over whether she should be disqualified from running for re-election) to avoid committing perjury\n 13%\n20 votes\nHouse GOP leader Kevin McCarthy, denying that he ever said (to colleagues) he was going to recommend a 45 resignation, only to have audiotapes showing  that he did\n 42%\n63 votes\nBrian Kolfage and Andrew Badolato, former Steve Bannon aides, pleading guilty to pocketing hundreds of thousands of dollars solicited from donors while promising all donations would pay for the border wall\n .",
    "1%\n2 votes\nFormer state Department press secretary Morgan Ortagus, removed from this year's congressional primary ballot by the Tennessee GOP (despite her endorsement from 45) as she only moved to the state in 2021\n 0%\n 0 votes\n45's fundraising campaign, ordered to pay $1.3 million in legal fees to former White House aide and The Apprentice? star Omarosa Manigault Newman, as an arbitrator ruled the NDA she was forced to sign was too vague to enforce\n .",
    "Snickers the Cat\nTHE OTHER NIGHT yours truly hosted the Top Comments diary with a closer look at one of my Your Weekend Reads  which a reader felt was an award-winning story of how our criminal justice system failed to stop a predator, saying He would become perhaps the most dangerous person to ever play college football\"  yet with all of the sordid aspects: there was an act of heroism that didn't involve a victim  instead, a teammate of the predator.",
    "All rescued safely, reunited w/families\nFILM NOTES  an upcoming biography will tell the story of the first actor of South Asian origin to be nominated for an Oscar, Merle Oberon (1911-1979)  who starred in such films as The Dark Angel and Wuthering Heights  but who passed as an Englishwoman (her father was English, yet her mother was part-Sinhalese and part-Maori) and she even threatened to sue a nephew late in her life who wanted to publicize this.",
    "3%\n5 votes\nJeremy Hanson, arrested for targeting Merriam-Webster with threats to commit anti-LGBTQ violence over the dictionary's use of language denoting gender\n 0%\n 0 votes\nBill O'Reilly, caught on video cursing at and threatening a JetBlue worker  then denying he did that and attempting to blame the worker  at JFK Airport in New York after his flight was delayed by several hours\n .",
    "Lou Reed (1942 -2013)\nHAIL and FAREWELL to the late thoroughbred horse Zippy Chippy  obtained by his owner in a trade for a Ford truck, yet never won any of his 100 races (even banned from several racetracks for such antics as refusing to leave the starting gate)  who has died at the age of nearly thirty-one.",
    "YOUR WEEKEND READ is the weekly column from The American Prospect essayist Eric Alterman  on how the new executive editor of the NY Times (Joseph Kahn) will inherit a successful enterprise .. yet will face a daunting task in ending the paper's both-sideism that has fueled the rise of the right wing.",
    "ART NOTES  an exhibition entitled The Andy Warhol Screen Tests  twenty short films (and photographs) of some famous names (Salvador Dali, Dennis Hopper, Bob Dylan, Allen Ginsberg), while others are part of Andy's world  is at the Currier Museum of Art in Manchester, New Hampshire to July 3rd.",
    "In 1989, Bonnie Raitt had been left-for-dead by the music business  and rolled-the-dice by recording with Don Was (of Was Not Was fame) to produce Nick of Time  with only two original songs, and a step away from her traditional blues-rock  yet which won Album of the Year at the Grammy Awards.",
    "3%\n5 votes\nFormer WH chief of staff Mark Meadows, previously having been suspected of being registered to vote in both Virginia and North Carolina (and just removed by NC officials)  now revealed as also being registered in South Carolina\n .",
    "1%\n2 votes\nEx-Honduran president Juan Orlando Hernndez, who stepped down in January, losing his legal battle against extradition to the US to face charges of to face charges of drug trafficking, money laundering and machine gun usage\n .",
    "1%\n2 votes\nOklahoma corrections officer Matthew Ware, convicted of allowing white supremacists to attack two Black pretrial detainees and placing a Black detainee to be stretched in restraints for criticizing how Ware ran the center\n .",
    "1%\n1 vote\nRep. Madison Cawthorn (R-NC), revealed as having being stopped once again by police for driving with a revoked license  and revealed as having partied in women's lingerie (after scolding liberals on transgender rights)\n .",
    "1%\n1 vote\nOnline giants (such as Google and Facebook) after the EU passed its Digital Services Act calling for them to do more to police illegal content on their platforms  and if they don't, risking fines of billions of dollars\n .",
    "5%\n7 votes\nJohnson & Johnson, forced to pay $99m to settle a lawsuit alleging that the company fuelled West Virginia's opioid epidemic (as it was not part of the $5bn settlement the company previously made with other states)\n .",
    "1%\n2 votes\nNetflix, whose shares lost 35% in a day by reporting its first drop in subscribers for more than a decade, blaming the 100m households that share their passwords with freeloaders, but also competition from Disney+\n .",
    "Mychal Kendricks (born 1990), Drake Graham (born 1986)\n...... and finally, for a song of the week ........................... a busy week (along with the writing of last night's Top Comments) left me no time for a full profile.",
    "South African wine\nI post a weekly diary of historical notes, arts & science items, foreign news (often receiving little notice in the US) and whimsical pieces from the outside world that I often feature in \"Cheers & Jeers\".",
    "1%\n1 vote\nBarry Ramey, affiliated with the Proud Boys and suspected of pepper spraying officials on January 6th and also threatening an FBI agent investigating his role in the riot  arrested by that very same FBI agent\n .",
    "FRIDAY's CHILD is named Snickers the Cat  a Cape Cod kitteh who has been at a Petsmart location too long in the estimation of one new area resident  who decided to pay the adoption fee for whomever wants to adopt her.",
    "1%\n1 vote\nDion Marsh, facing life in prison if convicted of federal hate crimes in violently attacking four Orthodox Jewish men and hitting three of them with a car in a violent one-day spree in New Jersey\n .",
    "3%\n4 votes\nThe town of Tiburon, California, having to pay a $150k to a couple who were racially profiled by police (while working inside their own store) and must institute new police training\n .",
    "Media outlet InfoWars, filing for bankruptcy in the face of mounting legal pressure over remarks by founder and conspiracy theorist Alex Jones, that the 2012 Sandy Hook shootings were a hoax\n .",
    "CHEERS to Bill and Michael in PWM, our Laramie, Wyoming-based friend Irish Patti and ...... well, each of you at Cheers and Jeers.",
    "BRAIN TEASER  try this Quiz of the Week's News from the BBC ... and the usually easier, less UK-centered New York Times quiz.",
    "SEPARATED at BIRTH  NFL star Mychal Kendricks (who says too many people?) confuse him with Canadian rap star Drake.",
    "7%\n10 votes\nStreaming subscription service CNN + (with hires such as Chris Wallace, Kasie Hunt.",
    "5%\n7 votes\nMultiple names listed - or a write-in - either way, please elaborate in a comment\n .",
    "Cry on My Shoulder (written by songwriter Michael Ruff) is my favorite song on the album.",
    "OK, you've been warned - here is this week's tomfoolery material that I posted.",
    "THURSDAY's CHILD is among a group rescued from a Milwaukee electrical fire.",
    "Jemele Hill and Audie Cornish), closing down just weeks after its debut\n .",
    "x\nx\nx\n Poll\n 151 votes Show Results\n Who Lost the Week ?!?!?",
    "Have a fabulous weekend .... and week ahead.",
    "Who Lost the Week ?!?!?",
    "9%\n14 votes"
  ]
}