{
  "id": 2746,
  "mediaId": 43,
  "date": "4/24/2022 12:00:00 AM",
  "headline": "North Carolina Open Thread: Lisa Sorg, coal ash, Meadows and Cawthorn",
  "image": "https://images.dailykos.com/images/1062412/story_image/DK-Coalash.png?1650818388",
  "link": "https://www.dailykos.com/story/2022/4/24/2093733/-North-Carolina-Open-Thread",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    782,
    876,
    1497,
    2099,
    2303
  ],
  "sentences": [
    "In lifting up Sorg's reporting, judge Debbie Elliott of NPR said She followed the money, uncovered government failure at every level, and she also got the human story.? Elliott described the work as a fascinating piece of accountability journalism.?\nChapel Hill's plan to build offices and housing atop a coal ash disposal site\nNC Policy Watch, Lisa Sorg, 4/18/2022\n This 2017 photo from the NC Department of Environmental Quality shows coal ash that had escaped from a former structural fill site at 828 MLK Blvd.",
    "'The end of men': Photos of 'family values' Republican Madison Cawthorn in women's lingerie draw instant ridicule\nRaw Story, Sarah K. Burris, 4/22/2022\nThe dirt on Rep. Madison Cawthorn (R-NC) continues to come out and the latest is a series of photos of the young Republican partying with a group of ladies while wearing a black lace brassiere, large sterling silver hoop earrings, and a silver necklace he held seductively between his teeth.",
    "Exclusive: Madison Cawthorn photos reveal him wearing women's lingerie in public setting\nPolitico, Michael Kruse, 4/22/2022\nPhotographs obtained by POLITICO appear to show Madison Cawthorn, the embattled Republican congressman from North Carolina who recently accused his GOP colleagues of inviting him to orgies, wearing lingerie in what appears to be a party setting.",
    "Sorg, long one of the nation's premiere reporters on environmental issues, was recognized for her remarkable two-part story from September of 2021, Clear and present danger? (click here and here), which shined a spotlight on hazardous contamination at a former missile plant in Burlington that threatens a predominantly Black and Latinx neighborhood.",
    "'It's incredibly ironic': Meadows found registered to vote in third state, this time in SC\n Click story title for video\nWLOS, MEG KINNARD Associated Press; WLOS staff, 4/22/2020\nCOLUMBIA, S.C. (AP)  Former Trump chief of staff Mark Meadows was reportedly registered to vote simultaneously in three states, including South Carolina.",
    "NC Policy Watch investigative reporter Lisa Sorg claims prestigious national journalism award\nNC Policy Watch, Rob Schofield, 4/22/2022\n NC Policy Watch investigative reporter Lisa Sorg is a 2021 winner of the National Press Foundation's Thomas L. Stokes Award for excellence in reporting on energy and the environment.",
    "State trooper took Rep. Madison Cawthorn's license during March traffic stop, video shows\nWLOS, Hannah Mackenzie, 4/20/2022\n Madison Cawthorn and friend on the dash-cam\nRecently released video shows the night U.S. Representative Madison Cawthorn (NC-11) was pulled over for a traffic violation in Cleveland County.",
    "His comments about the sexual perversion? in Washington made on a podcast, which he later admitted were exaggerated, drew the public disapproval and disavowal of Minority Leader Kevin McCarthy as well as other Republican leaders including those in his North Carolina congressional caucus.",
    "Numbers below listed on 4/24/22\nUSA\n NC\nTotal\n Cases\nNew\n Cases\nTotal\n Deaths\nNew\n Deaths\nTotal\n Recovered\nActive\n Cases\n4-24-22 2,647,650 23,363 2,613,027 11,260\n Track NC Covid Data Track NC Vaccine Data\nPlease jump the fold for links to stories I found interesting and useful.",
    "If you get caught for anything, we've got to take it from you.?\nGOP civil war: conservative outlet reports Madison Cawthorn's outrageous spending of taxpayer money\nDaily Kos, Walter Einenkel, 4/18/2022\nRepublican Rep. Madison Cawthorn has been a busy bee these past few weeks.",
    "The National Press Foundation announced today that NC Policy Watch investigative environmental reporter Lisa Sorg has won the prestigious Thomas L. Stokes Award, which is presented each year to a U.S.-based journalist for reporting excellence on energy and the environment.",
    "The following stories are from the DKos Asheville Open Thread on Saturday\nMadison Cawthorn having fun with alcohol and lingerie\nrandallt for DKos Asheville, 4/22/2022\nOnce again, Madison becomes the gift that keeps giving Republicans headaches.",
    "Cawthorn, 26, was raised in a conservative Baptist community in Henderson County, North Carolina, and has staked his political persona on arch-traditional Christian principles and the insistence of the importance of a kind of hypermasculinity.",
    "We hope this weekly platform gives readers interested in North Carolina politics a place to share their knowledge, insight and inspiration as we work on taking back our state from some of the most extreme Republicans in the nation.",
    "Again, here's somebody who is pedaling theories of voter fraud and has been the face of Donald trump's voter fraud investigation and here he is registering an address he never lived in, rented, owned in North Carolina.",
    "Colorado: Mondays, 7:00 PM Mountain\n Michigan: Wednesdays, 6:00 PM Eastern\n North Carolina: Sundays, 1:00 PM Eastern\n Missouri: Wednesday Evenings\n Kansas: Monday Evenings\nSomething you want to highlight?",
    "FORMER NC REP. MARK MEADOWS REMOVED FROM MACON COUNTY VOTER ROLLS\nThis definitely looks bad,? said political expert Dr. Chris Cooper, a professor of political science at Western Carolina University.",
    "We know that Cawthorn's hypermasculinity, wrapped in the cloth of Republican Jesus, has been one of his shining features for the White Evangelical communities of Western North Carolina and beyond.",
    "Recently, the youngest GOP fiscal conservative hypocrite has been under the microscope after his FEC campaign filings revealed his finances to be what economists would call piss poor.",
    "Soil and groundwater testing showed elevated levels of toxic chemicals associated with coal ash: mercury, Chromium 6 arsenic, barium, lead, beryllium, cobalt, vanadium and selenium.",
    "I keep an eye out for a variety of sources, but often find investigative stories from Lisa Sorg, at NC Policy Watch, to be the most compelling and important when it comes to safety.",
    "The revelation of the two photos is the latest in a series of unflattering headlines for the freshman member of Congress in the run-up to the primary in his first re-election bid.",
    "It is given annually for the best reporting in the independent spirit of Tom Stokes? on subjects of interest to him including energy, natural resources and the environment.",
    "According to the requirements for the state's Brownfields program, which oversees redevelopment of polluted sites  all of the apartments must be above the first floor.",
    "In the 1960s and 1970s, when coal was still king, the UNC power plant in Chapel Hill generated millions of tons of ash, the byproduct of burning the fuel for energy.",
    "The blaring drone of his misinformation madness machine (aka his mouth), usually reserved for simply telling vacuous lies, has been cranked up to slander of late.",
    "The video, provided to News 13 by The News & Observer, shows a North Carolina state trooper pulling Cawthorn over at 10:30 p.m. on March 3 in Cleveland County.",
    "The award was established in the spring of 1959 by friends and admirers of the late Thomas L. Stokes, a syndicated Washington columnist on national affairs.",
    "The moment comes as Republicans like Cawthorn and others are going after the rights of LGBTQ+ Americans, and especially parents of LGBTQ+ youth.",
    "Revelations about his behavior, from speeding, driving with a revoked driver's license, and more, are starting to take its toll on his approval.",
    "At the same time, conversations about masculinity have become a key part of the conversation from Fox host Tucker Carlson as well as Cawthorn.",
    "There were few rules or records regarding the use of coal ash as fill prior to 1987, according to the NC Department of Environmental Quality.",
    "His relentless pathological need to say anything and everything in order to glorify himself has led him to slander his own political party.",
    "On Sunday, the Washington Examiner published a report on the North Carolina teller of untruths and his extravagant use of taxpayer money.",
    "That is impossible to explain away as just an administrative detail.?\nThanks for reading and contributing, I hope you have a safe week.",
    "State officials said Friday, April 22 that the former congressman and his wife registered to vote in South Carolina earlier this year.",
    "According to the report, Cawthorn spent just under $5,000 on \"legislative planning food and beverage? expenses over a week in August.",
    "(Map: NCDEQ)\nNORTH CAROLINA OPEN THREAD Sunday, April 24, 2022\n362nd Weekly Edition\nThis is a weekly feature of North Carolina Blue.",
    "Twitter: @randallt\nPOSTED COVID data 4/24/2022 1:00pm EDT\nClick here for Covid-19 data from Worldometer Real Time World Statistics.",
    "Now town officials are proposing to build 80,000 square feet of office space and 175 to 250 apartments on top of the ash.",
    "The Fox documentary, \"The End of Men,\" alleges that liberalism is leading to the severe reduction in testosterone in men.",
    "The traffic stop resulted in the Republican congressman being issued a violation for driving with a revoked license.",
    "My process for putting this weekly news collection together includes looking for environmental news and opinion.",
    "Whether these moves by Rep.Cawthorn are a desperate attempt at boosting fundraising numbers remains to be seen.",
    "Coal ash used as structural fill was not required to be reported to the state environmental agency until 1994.",
    "Maybe something as abhorrent as dressing in lingerie while partying with happy women will be the final straw.",
    "If you are interested in starting your own state blog, weekly to occasionally, we will list your work below.",
    "The trooper then explains to Cawthorn why he had to confiscate the District 11 incumbent's driver's license.",
    "Although the audio is distorted, the trooper can also be heard telling Cawthorn his tags were expired.",
    "It's a series of unfortunate facts when you put them together.?\nIt's incredibly ironic,? said Cooper.",
    "Also during that week, he took a trip to the Skylaranna luxury mountain resort in North Carolina.",
    "So I was pleased to know that a wider audience agrees and that she is receiving worthy acclaim.",
    "Many Republicans are using allegations of \"grooming\" and pedophilia to attack LGBTQ+ people.",
    "Some of the ash was removed, but thousands of tons remain, encased below the parking lot.",
    "Some of that ash had to go somewhere, and that somewhere was 828 Martin Luther King Blvd.",
    "Portions of slopes leading to Bolin Creek and the greenway had eroded, exposing the ash.",
    "Because no recordkeeping was required before 1994, the true number of sites is unknown.",
    "Pretty much, if your license is suspended, they'll have a pickup order on it,? he said.",
    "Cawthorn also was quoted just this week saying that there's \"one God and two genders.\"",
    "His right hand appears to be circling his nipple while trying to appear alluring.",
    "The trooper reportedly pulled Cawthorn over for driving left of the center line.",
    "Unfortunately, I've got to take your license,? the trooper can be heard saying.",
    "In 1980, the town unknowingly built its police headquarters on that property.",
    "You can also join the discussion in four other weekly State Open Threads.",
    "Some of the exposed ash ran down an embankment and into Bolin Creek.",
    "But not until 2013 did town officials realize that ash was present.",
    "I don't know if it's surprising or not, but it's incredibly ironic.",
    "Cawthorn has seven Republican opponents who see him as vulnerable.",
    "Some of the units would be reserved as affordable housing.",
    "The fact that it was three states and not two states.",
    "Known locations of coal ash used as structural fill.",
    "kosmail or email at randalltdkos at gmail.",
    "By then, some of it had already escaped.",
    "The primary in North Carolina is May 17.",
    "Particularly coming from him.",
    "But then again, maybe not.",
    "on the north side of town.",
    "Please join us every week.",
    "in Chapel Hill."
  ]
}