{
  "id": 2757,
  "mediaId": 195,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Photos show Cawthorn wearing lingerie at apparent party: Politico",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/cawthornmadison_010421gn2_lead.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/house/3460514-photos-show-cawthorn-wearing-lingerie-at-apparent-party-politico/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lexi Lonas",
  "authorUrl": "https://thehill.com/author/lexi-lonas/",
  "termIds": [
    2303,
    2325,
    2325,
    652,
    652,
    1039,
    1039,
    1147,
    1147,
    1248,
    1248,
    1311,
    1311,
    1212,
    1212,
    1609,
    1609,
    1668,
    1668,
    2303,
    571,
    571,
    428,
    403,
    403,
    428,
    562,
    562,
    545,
    545,
    2590,
    2590,
    2942,
    2942
  ],
  "sentences": [
    "The photos also come after Cawthorn took to the House floor earlier this month to share his definition of a woman, alleging Democrats were waging a war on biology.?\nCawthorn defined a woman as having XX chromosomes, no tallywhacker.?\nIt is unclear when the pictures were taken, according to Politico.",
    "Cawthorn is facing a primary against several Republicans, with Sen. Thom Tillis (R-N.C.) throwing his endorsement behind Cawthorn's opponent, state Sen. Chuck Edwards (R).",
    "Two pictures of Republican Rep. Madison Cawthorn (N.C.) shared with Politico show the embattled congressman at what appears to be a party in women's lingerie.",
    "I guess the left thinks goofy vacation photos during a game on a cruise (taken waaay before I ran for Congress) is going to somehow hurt me?? Cawthorn said.",
    "Zelensky has been hailed internationally for his leadership amid the crisis in Ukraine, and he has vowed to remain in the country fighting with his people.",
    "The accusations caused a harsh response from his own party, with House Minority Leader Kevin McCarthy (R-Calif.) chastising him for the comments.",
    "Cawthorn acknowledged the photos in a tweet Friday, saying they were from a vacation on a cruise and were taken before he ran for Congress.",
    "Cawthorn told Warrior Poet Society? podcast host John Lovell that lawmakers have invited him to orgies and done cocaine in front of him.",
    "The political news outlet reported that it obtained the photos from a person who was preivously close to Cawthorn, and his campaign.",
    "However, the outlet did not that the pictures were most likely shot after 2014, because Cawthorn appears to be in a wheelchair.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "He also recently called Ukrainian President Volodymyr Zelenksy a thug? amid the Russian invasion of Ukraine.",
    "He has used a wheelchair since he got into a car accident and was paralyzed from the waist down.",
    "Another person who was formerly close with Cawthorn confirmed the pictures.",
    "He previously accused congressional colleagues of inviting him to orgies.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "Cawthorn is controversial figure in the Republican Party.",
    "They're running out of things to throw at me? he added."
  ]
}