{
  "id": 2759,
  "mediaId": 165,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Madison Cawthorn Partying in Lingerie May Be the Least Offensive Thing He's Done",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/04/madison-cawthorn-pictures.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-news/madison-cawthorn-lingerie-photos-1342044/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ryan Bort",
  "authorUrl": "",
  "termIds": [
    1609,
    2303,
    438,
    2834
  ],
  "sentences": [
    "They're running out of things to throw at me?\nCawthorn pins the leak on the left,? but as Politico noted, the photos came from someone formerly close to Cawthorn, who is currently trying to fend off slew of conservative challengers in what is shaping up to be a hotly contested Republican primary to represent his North Carolina district.",
    "Have a look:\nPolitico could not independently verify the photos, but notes that they are a screenshot of original images provided by a person formerly close to Cawthorn and his campaign, and that a second person formerly close with Cawthorn and his campaign verified the photos.",
    "They're running out of things to throw at me\n Madison Cawthorn (@CawthornforNC) April 22, 2022\nCawthorn looks like he's having a good time in the photos, and there's absolutely nothing wrong with a man putting on some lingerie.",
    "It's unclear when the photos were taken, but Politico notes that they appear to show Cawthorn sitting in a wheelchair, indicating they were taken after the 2014 accident that left him partially paralyzed.",
    "Rolling Stone reported in October that Cawthorn was one of several lawmakers who participated in the planning of the rally near the White House that preceded the riot at the Capitol last Jan. 6.",
    "He's since repeatedly pushed false claims about fraud in the 2020 election, and even warned that bloodshed? could result if Republicans should feel any future elections are stolen.",
    "House Minority Leader Kevin McCarthy said Cawthorn also admitted he lied about his recent comments about congressional orgies and cocaine use among his colleagues.",
    "Cawthorn has also been an opponent of transgender rights, and he scolded Democrats earlier this month about what he claims is the only true way to define a woman.",
    "But while Cawthorn is free to do his thing and be himself, it would be nice if he, a lawmaker, would stop trying to make it harder for others to do the same.",
    "I guess the left thinks goofy vacation photos during a game on a cruise (taken waaay before I ran for Congress) is going to somehow hurt me?? he wrote.",
    "I guess the left thinks goofy vacation photos during a game on a cruise (taken waaay before I ran for Congress) is going to somehow hurt me?",
    "pic.twitter.com/kPlUV2FALi\n CSPAN (@cspan) April 4, 2022\nCawthorn has a body of behavior inside and outside of Congress that is despicable.",
    "Politico obtained photos that appear to show Cawthorn partying in racy attire and wearing hoop earrings.",
    "He's lied about his car accident, his academic record, and his opponent in his 2020 congressional race.",
    "You can't just have it your waytake notes Madame Speaker, I'm about to define what a woman is for you.\"",
    "Rep. Madison Cawthorn (@RepCawthorn): \"You might amend a bill, but you'll never amend biology.",
    "The lawmaker does, however, have a lengthy rap sheet of offensive behavior and comments.",
    "Throwing on some lingerie and having a good time is not part of it.",
    "Madison Cawthorn apparently has a thing for donning lingerie.",
    "Cawthorn has been accused of sexual misconduct.",
    "Cawthorn responded in a tweet on Friday.",
    "Science is not Burger King."
  ]
}