{
  "id": 2760,
  "mediaId": 151,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Exclusive: Madison Cawthorn photos reveal him wearing women's lingerie in public setting",
  "image": "https://www.politico.com/dims4/default/13e2cac/2147483647/legacy_thumbnail/1200x805%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F8c%2Faa%2Fa5725b3b4c43a1185c2d75d73a18%2Funknown.jpg",
  "link": "https://www.politico.com/news/2022/04/22/madison-cawthorn-photos-00027286",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    1501,
    1501,
    1609,
    1609,
    1335,
    1335,
    2303,
    545,
    545,
    403,
    403,
    2696,
    2696,
    2834,
    2834
  ],
  "sentences": [
    "I also cling to a lot of traditional values and a lot of traditional ideas, because they've worked in the past.?\nI think that we have bred a generation of soft men and that generation has created a lot of problems in our society and our culture,? he said in March 2021 on a podcast designed to reclaim and restore masculinity in a society that is ever more dismissive of what it means to be a man.?\nThere's only one God and two genders,? he said in a tweet earlier this week.",
    "Cawthorn, who was paralyzed from the waist down as a passenger in a car accident in Florida in 2014, in recent months has called Ukrainian president Volodymyr Zelenskyy a thug,? suggested teetotaling Speaker of the House Nancy Pelosi has a drinking problem, and racked up a collection of traffic transgressions including speeding, driving with expired tags and driving with a revoked license.",
    "Photos obtained by POLITICO\nBy Michael Kruse\n 04/22/2022 04:47 PM EDT\nUpdated: 04/22/2022 06:00 PM EDT\nPhotographs obtained by POLITICO appear to show Madison Cawthorn, the embattled Republican congressman from North Carolina who recently accused his GOP colleagues of inviting him to orgies, wearing lingerie in what appears to be a party setting.",
    "His comments about the sexual perversion? in Washington made on a podcast, which he later admitted were exaggerated, drew the public disapproval and disavowal of Minority Leader Kevin McCarthy as well as other Republican leaders including those in his North Carolina congressional caucus.",
    "They're running out of things to throw at me... Share your most embarrassing vacay pics in the replies.?\nI was raised on Proverbs and pushups,? Cawthorn said in a podcast in September 2020.\nI subscribe to Judeo-Christian beliefs,? he continued.",
    "Cawthorn, 26, was raised in a conservative Baptist community in Henderson County, North Carolina, and has staked his political persona on arch-traditional Christian principles and the insistence of the importance of a kind of hypermasculinity.",
    "I think if you think about my political ideology, where it really stems from, you know, my ethics and my morals and what I think is right and wrong, you look to ancient Jerusalem, you got ancient Judeo-Christian values.",
    "The revelation of the two photos is the latest in a series of unflattering headlines for the freshman member of Congress in the run-up to the primary in his first re-election bid.",
    "The date the photos were taken is unclear, though they appear to show Cawthorn sitting in a wheelchair, indicating the event happened after his accident.",
    "I guess the left thinks goofy vacation photos during a game on a cruise (taken waaay before I ran for Congress) is going to somehow hurt me?",
    "After this story published, Cawthorn tweeted that the photos were taken of him during a game on a cruise before he was elected to Congress.",
    "In the photos, he is wearing a distinctive pendant necklace that has appeared in other images and videos of Cawthorn.",
    "A second person formerly close to Cawthorn and his campaign confirmed the origin of the photos.",
    "POLITICO could not independently verify the photos, which are screenshots of original images.",
    "They were provided to POLITICO by a person formerly close to Cawthorn and his campaign.",
    "Cawthorn spokesman Luke Ball did not respond to multiple requests for comment.",
    "Cawthorn has seven Republican opponents who see him as vulnerable.",
    "The photos have started to circulate among political rivals.",
    "I have a personal relationship with Jesus Christ.",
    "The primary in North Carolina is May 17.",
    "He has court dates in May and June.",
    "So right and wrong,? he continued."
  ]
}