{
  "id": 2766,
  "mediaId": 151,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "POLITICO Playbook PM: McCarthy gets a lifeline (and another leak)",
  "image": "https://www.politico.com/dims4/default/1ea34f6/2147483647/legacy_thumbnail/1200x799%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F43%2F23%2Fef5235de45a2b73b88ed173b87c2%2Fcapitol-riot-contempt-83692.jpg",
  "link": "https://www.politico.com/newsletters/playbook-pm/2022/04/22/mccarthy-gets-a-lifeline-and-another-leak-00027196",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2358,
    2358,
    883,
    883,
    1147,
    1147,
    2203,
    2203,
    2095,
    2095,
    2087,
    2087,
    2073,
    2073,
    1839,
    1839,
    1765,
    1765,
    1668,
    1609,
    1668,
    1609,
    1577,
    1596,
    1596,
    1577,
    1494,
    1494,
    1311,
    1311,
    54,
    54,
    428,
    403,
    403,
    428,
    2672,
    2672,
    2555,
    2555,
    2942,
    2942,
    2945,
    2945
  ],
  "sentences": [
    "But they didn't immediately ask for a stay, indicating there might be more here than meets the eye, NYT's Charlie Savage and Sharon LaFraniere suggest: Legal specialists raised another possibility on Thursday: The administration may instead be buying time and thinking about trying to erase the ruling  a move that would allow it to protect the powers of the Centers for Disease Control and Prevention to respond to a future crisis  but without reviving a mask mandate.?\nAFTERNOON READ  For POLITICO Magazine, Kathy Gilsinan has a big feature looking at why Nebraska handled the pandemic so much better than many other states, emerging with little economic damage, barely any student learning loss and a low per-capita death toll.",
    "As a result, lawmakers put new focus on voting restrictions: They ultimately passed laws tightening voter ID, requiring 24-hour surveillance at ballot drop boxes and making it easier for people to opt out of mail voting, but rejected more drastic proposals, including one to end universal vote by mail altogether.?\nDO THE MATH  After Florida's decision to reject dozens of math textbooks kicked up a political firestorm, NYT's Dana Goldstein and Stephanie Saul went through 21 of them to investigate further.",
    "BONUS BIRTHDAY: Yasmina Vinci of the National Head Start Association\nFollow us on Twitter\nRachael Bade @rachaelmbade\nEugene Daniels @EugeneDaniels2\nRyan Lizza @RyanLizza\nEli Okun @eliokun\nGarrett Ross @garrett_ross\nSubscribe to the POLITICO Playbook family\n Playbook Playbook PM California Playbook Florida Playbook Illinois Playbook Massachusetts Playbook New Jersey Playbook New York Playbook Ottawa Playbook Brussels Playbook London Playbook\n View all our politics and policy newsletters\nFollow Us",
    "With a combination of pre-existing medical infrastructure and efficient state government, Nebraska used its geographical head start to prepare better and then move faster than many other states to contain the pandemic and its economic fallout.?\nTHE BIDEN ADMINISTRATION\nMARK YOUR CALENDARS  VP KAMALA HARRIS will give the commencement address at Tennessee State University on May 7, CBS' Tim Perry scooped.",
    "But the AJC doesn't mince words: Greene's assertion during the legal hearing that she hasn't condoned violence on social media runs counter to a background that includes racist, xenophobic and anti-Semitic remarks and a past belief in the deranged QAnon conspiracy theory.?\nALL POLITICS\nAN UNDER-THE-RADAR PRIMARY TO WATCH  Arkansas' JOHN BOOZMAN is a reliable conservative in the Senate GOP Conference.",
    "Trump liked the original JMart/Burns story bc he felt like it made him look strong bc McCarthy and McConnell said all these terrible things about him around Jan 6 and now he sees McCarthy as a supplicant and McConnell said he'll back him in 2024 if he's the nominee.?\nStill, a lot of House Republicans know Trump can go hot and cold on people fast, forgiving one minute and furious the next.",
    "The textbooks that Florida rejected are filled with references to character traits like perseverance and cooperation.?\nWAR IN UKRAINE\nLATEST DEVELOPMENTS \n A top Russian commander said the country wants much more than just the Donbas, seeking to capture an entire swath of southern Ukraine that would constitute a bigger fight than the current focus in the east, per NYT's Marc Santora.",
    "They also report that inside the White House, Biden's advisers are divided over? whether he should cancel some student loan debt en masse, and the president hasn't yet made a decision on how to proceed.?\nMTG LATEST  Rep. MARJORIE TAYLOR GREENE (R-Ga.) is in court today to try to fend off a challenge that seeks to remove her from the ballot for her Jan. 6 role.",
    "JUDICIARY SQUARE\nSCOTUS WATCH  Biden may have his hands full dealing with the political fallout of reversing one Trump immigration policy, but he could soon face another: The Supreme Court on Tuesday is taking up the question of whether the Biden administration can end Trump's remain in Mexico? policy, Bloomberg's Greg Stohr and Jordan Fabian report.",
    "The Trump-McCarthy call followed the explosive revelation from Jonathan Martin and Alex Burns' new book, This Will Not Pass,? that McCarthy and Senate GOP Leader MITCH MCCONNELL had privately called for Trump to go following the Capitol insurrection  which McCarthy denied, only for the reporters to offer audio proof.",
    "Nobody can defend that, and nobody should defend it.?\nHere's McCarthy the next day, sounding much more conciliatory while talking to the full House GOP Conference: Let me be very clear to all of you, and I am very clear to the president: He bears responsibilities for his words and actions, no [ifs], ands or buts.",
    "But he's scrambling to swat away a primary challenge from veteran and pro footballer JAKE BEQUETTE, who's riding a wave of money from billionaire donor RICHARD UIHLEIN and trying to paint Boozman as insufficiently MAGA for saying, accurately, that the 2020 election was legitimate, Alex Isenstadt reports.",
    " Related: Treasury Secretary JANET YELLEN said today that rolling back Trump China tariffs is worth considering.?\nTABLE-SETTER  As Congress comes back next week, WSJ's Eliza Collins and Andrew Restuccia preview Democrats' attempts to breathe life into an often moribund agenda.",
    "A Musk-led Twitter could further sap the appeal of Mr. Trump's beleaguered start-up as it faces a regulatory investigation that could decide its future.?\nPLAYBOOKERS\nMEDIA MOVES  Shane Goldmacher is moving up to be national political correspondent at the NYT.",
    "CONGRESS\nEVERYTHING EVERYWHERE ALL AT ONCE  President JOE BIDEN's push for Congress to pass more aid to Ukraine next week looks set to collide with lawmakers' other ongoing squabbles over Covid aid and the Title 42 border policy, Andrew Desiderio reports.",
    "The ad\nCLIMATE FILES  Worried and disappointed climate activists are staging a series of Fight for Our Future? rallies around the country, pegged to Earth Day, to push for government action to avert climate catastrophe, NYT's Lisa Friedman reports.",
    "CASH DASH  The Pennsylvania Senate GOP primary pitting DAVID MCCORMICK against MEHMET OZ is drawing massive infusions of Wall Street cash on both sides, making for one of the country's most expensive races this year, CNBC's Brian Schwartz reports.",
    "WaPo's Jacqueline Alemany and Marianna Sotomayor, citing two sources, report that McCarthy talked with DONALD TRUMP on Thursday night and Trump was not upset? about new audio that revealed McCarthy said Trump should resign after Jan. 6.",
    "AD WARS  Sen. THOM TILLIS isn't letting up in his opposition to fellow North Carolina Republican Rep. MADISON CAWTHORN: A Tillis-aligned super PAC is putting up $310,000 to air an ad attacking Cawthorn, per Axios' Lachlan Markay.",
    "But there is plenty of social-emotional learning content,? a formerly uncontroversial method that has proven successful but has become a recent target for conservatives who call it a Trojan horse for social radicalism.",
    "YOU CAN'T HANDLE THE TRUTH SOCIAL  If Musk succeeds, and changes Twitter's rules in a way conservatives like, he could undercut the raison d'etre for Truth Social, NYT's Matthew Goldsten, Ken Vogel and Ryan Mac report.",
    "But in the wake of Trump's lies about the 2020 election and voter fraud, the red state is seeing increased opposition from conservative voters and chaos for election workers, AP's Sam Metz reports from Provo.",
    "GOP RE-FINDS RELIGION ON TRADE  Now that Trump is out of office, Republican senators are seeking to reverse some China tariffs and setting up a battle with more protectionist Democrats, Gavin Bade reports.",
    "The Atlanta Journal-Constitution's Tia Mitchell and Greg Bluestein report that Greene testified, None of my words, never ever, mean anything for violence.? Her attorneys argued the case was just political.",
    "They're drawing on their respective hedge fund and entertainment connections to rake in the dough, with McCormick a particular business-world favorite: Almost 60 Goldman Sachs leaders have donated to him.",
    "A ruling against the administration would further complicate Biden's handling of immigration,? and the conservative court has already refused to pause a lower-court ruling against Biden in the case.",
    "MEANWHILE  This morning, Martin and Burns presented more snippets of leaked audio of McCarthy in the days after Jan. 6, though some of its contents were previously reported, albeit without audio.",
    "Instead, the former president was pleased that McCarthy reneged and started backing him again, which Trump saw as a sign of his continued grip on the Republican Party,? they report.",
    " At a moment when House Minority Leader KEVIN MCCARTHY's shot at the speakership looked more in danger than ever, he may have saved himself Thursday night  at least for now.",
    "Now it's Senate Majority Leader CHUCK SCHUMER who could tie up Ukraine aid  even though it has bipartisan backing  by pushing to combine it with the Covid funding bill.",
    "The site of the debate is the China competitiveness/semiconductor manufacturing bill that has passed both chambers in different forms, which now need to be reconciled.",
    "But not everyone in Trump world is mollified:\nOn his show this morning, STEVE BANNON called it a cardinal sin? for McCarthy to deny comments that were caught on tape.",
    "Uihlein's involvement illustrates how a single free-spending billionaire can alter the contours of an election and put a once-safe incumbent on edge,? Alex writes.",
    "But then again, McCarthy has also strategically  and smartly  hired a bunch of former Trump staffers, who could theoretically play peacemakers on his behalf.",
    "POLITICO Playbook PM: McCarthy gets a lifeline (and another leak)\nBy RACHAEL BADE and ELI OKUN\n04/22/2022 12:46 PM EDT\nPresented by\nREPRIEVE FOR MY KEVIN'?",
    " An intense and grinding fight continued in the east, as Russia assaulted a series of small towns and villages that Ukraine sought to defend or recapture.",
    " House Judiciary Republicans put Twitter on notice, formally asking the company to preserve all records regarding ELON MUSK's attempted takeover.",
    "Martin, who's having quite the book rollout, teased: More tapes to come.?\nHE'S NOT THE ONLY ONE DANGLING BIG NEWS  Rep. JAMIE RASKIN (D-Md.)",
    "), many of its members are threatening not to support the entire bill unless their trade language wins out  and they have the upper hand.",
    "Republicans bogged down negotiations over pandemic response funding weeks ago by linking them to criticism of Biden's immigration moves.",
    "And he [needed] to acknowledge that.? CNN's Melanie Zanona breaks it down  (But we already knew the gist of this one)\nWHO'S THE LEAKER?",
    "THE PANDEMIC\nPULLING BACK THE CURTAIN  The Biden administration appealed a judge's ruling striking down the CDC's transit mask mandate.",
    "Raskin also said those hearings will happen in June  we'd previously heard May, though the committee's timeline has been squishy.",
    "Boozman is still the favorite, but if Bequette can push him into a runoff after next month's primary, it could be a tough fight.",
    "said the Jan. 6 committee hearings will tell a story that will really blow the roof off the House,? per NBC's Rebecca Shabad.",
    "Appearing on CNN, they had the tapes:\nMcCarthy talking to House GOP leadership on Jan. 10, 2021: I know this is not fun.",
    "There are a lot of Trump allies who are not fans of McCarthy, so expect these types to try to stir the pot against him.",
    "Meanwhile, trips by several lawmakers to Eastern Europe during this recess will up the pressure to act fast on Ukraine.",
    "PETE RICKETTS and Nebraska's other leaders got right down to simple institutional competence,? Kathy writes.",
    "She most recently had the top policy job at the International Committee of the Red Cross Washington office.",
    "And BORIS EPSHTEYN warned that Kevin McCarthy's got a big problem? in his speakership bid now, per Nick Wu.",
    "She most recently was press assistant and confidential assistant to Covid-19 response at the White House.",
    "YELLEN SPEAKIN'  Yellen said on CNBC that she thinks inflation may have peaked (we've heard that before!",
    "She also called the American economy very resilient? so far and said she didn't foresee a recession.",
    "They're still awaiting an official public response from Trump before figuring out how to proceed.",
    "While the Senate GOP retains a few Trumpist holdouts who back the tariffs, like JOSH HAWLEY (Mo.",
    "Notable context: The administration has been steadily increasing its use of the program lately.",
    "STAFFING UP  Marcia Wong will be deputy assistant USAID administrator for humanitarian affairs.",
    "Notably, our understanding is that staff for a lot of these top members were also on this call.",
    " Kelsey Fitzpatrick is now special assistant to the administrator of the U.S. Digital Service.",
    "More from Reuters\nBEYOND THE BELTWAY\nTHE POWER OF PARTISANSHIP  Utah has long voted by mail.",
    "TRANSITIONS  Brittney Dickerson is now comms director for Rep. Diana Harshbarger (R-Tenn.).",
    "He most recently was comms director in Fairfax County Supervisor James Walkinshaw's office.",
    "Latest updates from CNN\n Defense Secretary LLOYD AUSTIN will go to Germany next week.",
    "The takeaway: Beyond all the nation's pitched political battles over Covid, GOP Gov.",
    "He currently covers the White House and Congress for the Miami Herald and McClatchy.",
    "Announcement  Bryan Lowry will return to The Kansas City Star as politics editor.",
    "But what I want to do, especially through here, is I don't want to rush things.",
    "In perpetual pursuit of celebrity, Cawthorn will lie about anything,? it says.",
    " ICYMI: New evidence of possible mass graves near Mariupol shocked the world.",
    "I asked him personally today: Does he hold responsibility for what happened?",
    "And both men are close to Bridgewater's RAY DALIO, who's stayed neutral.",
    "She most recently was press secretary for Rep. Steven Palazzo (R-Miss.).",
    " Brian Garcia is now press secretary for Rep. Sylvia Garcia (D-Texas).",
    "They find hardly anything about race (let alone critical race theory).",
    "He told me he does have some responsibility for what happened.",
    "spokesman said he didn't leak it, nor did anyone on his team.",
    "Axios' Jonathan Swan confirmed the WaPo take, tweeting: Yep.",
    "The battles made it impossible to evacuate civilians today.",
    "I want everybody to have all the information needed.",
    "), though prices will likely stay high for a while.",
    ": Per the WaPo story, Rep. LIZ CHENEY's (R-Wyo.)",
    "More from the AP\nVALLEY TALK\nPREVIEW OF 2023?",
    "Oz also has plenty of Wall Street supporters.",
    "House Minority Whip STEVE SCALISE's (R-La.)",
    "Good Friday afternoon, and happy Earth Day.",
    "spokesman said she didn't leak the audio.",
    "Does he feel bad about what happened?",
    "So it could have been an aide.",
    "What he did is unacceptable.",
    "I've had it with this guy.",
    "I know this is very tough.",
    "I know this is not great.",
    "They won't be the last."
  ]
}