{
  "id": 2769,
  "mediaId": 163,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Firebrand U.S. Republican Marjorie Taylor Greene faces 'insurrectionist' challenge",
  "image": "https://www.reuters.com/resizer/00xTijEF0PsAFYN3hOXaqBpeaJQ=/728x0/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/UVOICXGRURO4PFTP4M7B6SEXEY.jpg",
  "link": "https://www.reuters.com/world/us/firebrand-us-republican-marjorie-taylor-greene-faces-insurrectionist-challenge-2022-04-22/",
  "mediaOutlet": "Reuters",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jan Wolfe",
  "authorUrl": "https://www.reuters.com/authors/jan-wolfe/",
  "termIds": [
    883,
    1147,
    1335,
    1596,
    2087,
    2303,
    2358,
    146,
    428,
    2555,
    2672,
    2834,
    2945,
    2959
  ],
  "sentences": [
    "WASHINGTON, April 22 (Reuters) - Republican U.S. Representative Marjorie Taylor Greene will face a challenge in a Georgia court on Friday by a group of voters trying to block her from the ballot, citing a post-Civil War policy aimed at keeping insurrectionists from serving in office.",
    "In a novel legal challenge filed with the office of the Georgia secretary of state, the voters said Greene, a supporter of former President Donald Trump, has violated a provision of the U.S. Constitution known as the \"Insurrectionist Disqualification Clause.\"",
    "During media interviews, Greene has downplayed and justified the Jan. 6, 2021, assault on the U.S. Capitol by Trump supporters in their failed bid to block congressional certification of President Joe Biden's 2020 election victory.",
    "The clause, passed after the U.S. Civil War in the 1860s, prohibits politicians from running for Congress if they have engaged in \"insurrection or rebellion\" or \"given aid or comfort\" to the nation's enemies.",
    "Greene is expected to testify under oath during Friday's hearing, and to argue that removing her from the ballot would be both unfair to her and to voters in her conservative-leaning district.",
    "\"I can't believe this judge has not thrown this case out and seen this case for what it is: nothing but a big, funded scam for the Democrats trying to control our elections,\" Greene said.",
    "A similar challenge backed by the same group against Republican U.S. Representative Madison Cawthorn failed when a federal judge in North Carolina dismissed that suit on March 4.",
    "\"This is about ensuring that any elected official who takes an oath to defend our Constitution and then engages in insurrection is barred from holding public office again.\"",
    "In a recent court filing, Greene's lawyers said she \"vigorously denies that she aided and engaged in insurrection to obstruct the peaceful transfer of presidential power.\"",
    "Greene is expected to appeal any ruling against her, and has already brought parallel litigation in U.S. federal court seeking to halt the administrative proceeding.",
    "The voter challenge is being spearheaded by a group called Free Speech for People that advocates for campaign finance reform.",
    "Greene is seeking re-election this year, with the Republican primary scheduled for May 24 and the general election on Nov. 8.",
    "U.S. District Judge Amy Totenberg on Monday ruled that the challenge to Greene's fitness for office can proceed.",
    "Greene this month said Democrats and journalists have pushed an \"over-dramatization\" of that day's events.",
    "An administrative judge in Atlanta, Charles Beaudrot, is scheduled to begin the hearing at 9:30 a.m.",
    "Greene has asked a federal appeals court to reverse that ruling and effectively end the dispute.",
    "\"This hearing is about more than just Marjorie Taylor Greene,\" Free Speech for People said.",
    "Greene on the conservative TV outlet Newsmax on Wednesday rejected that claim.",
    "It is unclear if Beaudrot will rule in the case on Friday.",
    "Absentee ballots will start to be mailed on April 25.",
    "ET (1330 GMT)."
  ]
}