{
  "id": 2771,
  "mediaId": 881,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Insurrectionist' Marjorie Taylor Greene Goes Under Oath Today",
  "image": "https://video-images.vice.com/articles/6262b273f71975009d66f21b/lede/1650635606873-gettyimages-1238864046.jpeg?crop=1xw:0.84375xh;center,center&resize=1000:*",
  "link": "https://www.vice.com/en_us/article/wxd354/marjorie-taylor-greene-insurrectionist-barred-ballot",
  "mediaOutlet": "Vice",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Todd Zwillich",
  "authorUrl": "https://www.vice.com/en/contributor/todd-zwillich",
  "termIds": [
    883,
    926,
    1065,
    1090,
    1147,
    1302,
    2087,
    2095,
    2203,
    2303,
    2358,
    428,
    545,
    562,
    2555,
    2672
  ],
  "sentences": [
    "I think the idea that we would face an insurrection against the United States that would result in the Capitol falling under an attack that successfully prevented the electoral votes for president being certified, and resulted in a substantial delay of the peaceful transfer of power, and nearly resulted in the execution of members of Congress and maybe the vice president... that was an action that was hard to fathom until it happened.",
    "Our senator was bragging about spending 14 hours a day' over many weeks, calling state lawmakers and otherwise trying to ferret out a way for the Jan. 6 joint session of Congress to be pushed from a constitutional formality to a constitutional crisis.?\nThe text messages establish that Lee was not being truthful when he said he was only made aware of the plan four days before Jan. 6,? the Salt Lake Tribune's editorial board wrote.",
    "Had events gone that way, the United States government might have been overthrown, the Constitution that Lee claims to revere left in tatters.?\nOne stroke of fortune for Lee and fellow coup-texter Rep. Chip Roy is that the messages were laid bare while Congress was on recess.",
    "The day before, she shared a code word that was understood by violent extremists as a signal for storming the Capitol and understood that it was a term for The plan is on, let's go.?\nThere were 147 Republicans who voted against certifying electors in the House or the Senate.",
    "If you look at the statements given by those senators who voted to acquit former President Trump in that impeachment vote, most of them said that it was for jurisdictional reasons, hat they didn't believe that an ex-president could be convicted in an impeachment proceeding.",
    "These are trial runs, and they really want to try to disqualify Trump for 2024.?\nIf Donald Trump chooses to run for office in 2024, we will absolutely file disqualification challenges in multiple states as we've done against these members of Congress and other officials.",
    "The candidates that we've brought these cases against all distinguish themselves by going above and beyond, or perhaps you would say below and beyond, that type of involvement by helping to facilitate the events that led to the violent attack on the Capitol.",
    "Honor among skeeves  Various extremist militia groupsincluding those whose members are now charged with seditious conspiracyhad a lot of contact with each other in the days before Jan. 6, according to a big cache of texts released this week.",
    "Textual relationship  Ginni Thomas didn't just repeatedly text White House chief of staff Mark Meadows, egging him on to reverse the election while definitely not discussing her conspiracy theories with her best friend husband, Clarence.",
    "Also, the House and Senate passed resolutions awarding Congressional Gold Medals to Capitol Police officers for their efforts in resisting insurrectionists.? I don't see how you can have insurrectionists without an insurrection.",
    "On Jan. 10, 2021, House Minority Leader Kevin McCarthy was ready to recommend to Donald Trump that he resign with 10 days remaining in his presidency, because of Trump's role in inciting the insurrection mob four days before.",
    "We talked about the Greene case, the cases against other members of Congress who boosted the coup, and Fein's pledge that his group will go 14A to try to bar Donald Trump from the ballot if he runs for president in 2024.",
    "DAILY BEAST\nBy signing up, you agree to the Terms of Use and Privacy Policy & to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.",
    "Leading up to Jan. 6, Marjorie Taylor Greene told her supporters that they couldn't allow a peaceful transfer of power, and that Joe Biden and Nancy Pelosi, the Speaker of the House, should be executed for treason.",
    "So if you add those who voted to convict plus those who said that they voted no? based on jurisdiction, there were more than enough who found him to be guilty of the charge of incitement of insurrection.",
    "Guilfoyle'd Again\nFormer Fox News person and future Don Jr. spouse Kimberly Guilfoyle made a second visit to the January 6 committee this week, the latest member of Trump's loyalty circle to testify.",
    "This content comes from the latest installment of our weekly Breaking the Vote newsletter out of VICE News' D.C. bureau, tracking the ongoing efforts to undermine the democratic process in America.",
    "A Jackson spokesperson has since said the congressman does not know nor has ever spoken to? any of the extremists, which, of course, does not necessarily preclude texting or emailing with them.",
    "Trump's political strength remains an open question, but his intentions are clear: to install loyalists who will help him undermine a fair 2024 election, and punish those who refuse to commit.",
    "One is the impeachment vote, which was passed by a bipartisan majority in the House and by a bipartisan, simple majority in the Senate, although it didn't rise to the level needed to convict.",
    "CNN revealed this week that Thomas talked about Hair in her hair-on-fire texts to Meadows, all while Gohmert was participating in election lawsuits t hat Justice Thomas would soon rule on.",
    "The texts show leaders of the Proud Boys, Oath Keepers, 1st Amendment Praetorian, and others kibitzing about providing security for right-wing luminaries like Roger Stone and Alex Jones.",
    "Recall that Waldron authored the famous PowerPoint deck pointing out Trump's path to stealing power, and gets credit from his peers for originating the plan to seize voting machines.",
    "That would be a lot easier to accept in a state that hadn't undertaken a campaign of voter suppression and potential subversion while Trumpist candidates try to take over elections.",
    "Section 3 of 14A bars anyone from federal office who's previously pledged an oath to the Constitution then gone on to engage in insurrection or rebellion? against the United States.",
    "One Trib reporter who tried got the body block from Lee's people, which of course raises interesting questions for the Capitol Hill press corps when Congress returns next week.",
    "So Madison Cawthorn, Marjorie Taylor Greene, Paul Gosar, Andy Biggs, and [Arizona State Rep.] Mark Finchem are all involved in more than just a vote inside the House chamber.",
    "Does the fact the Senate acquitted Trump affect how the Constitution might apply on the question of whether Trump himself fomented an insurrection or should be disqualified?",
    "Make sure you read this insider's account of how McCarthy and McConnell went from appalled leaders ready to boot an authoritarian to supine servants of Trump's reelection.",
    "A Lee spokesperson finally commented Wednesday, only after Utah's largest newspaper called Lee out for helping coach the nascent coup, then lying about it later.",
    "They appear to show that Lee was cheerleading and advising the attempt to overturn the election for weeks, before eventually turning sour on the whole thing.",
    "We think it is very important that Marjorie Taylor Greene will be forced for the first time under oath to answer questions about her involvement in Jan. 6.",
    "There are three elements under the insurrectionist disqualification clause of the 14th Amendment: One, that she took an oath to support the Constitution.",
    "That means she voluntarily gave the insurrection anything useful, any service or assistance whatsoever, voluntarily, and that's what we're going to show.",
    "Then that decision can be challenged in Superior Court in Fulton County, Georgia, and that can potentially be appealed to the Georgia Supreme Court.",
    "We hope she tells the truth, but if she chooses to perjure herself, or for that matter if she pleads the Fifth, that will have its own consequences.",
    "Senate GOP Leader Mitch McConnell was convinced Trump would be convicted and barred from ever holding office again, and he was ready to participate.",
    "Ya Brn't  Arizona Attorney General Mark Brnovich tried and tried to impress Donald Trump with claims of election irregularities that didn't exist.",
    "Today GOP Rep. Marjorie Taylor Greene will become the first member of Congress to testify under oath about their role in the Jan. 6 insurrection.",
    "Leaders Privately Blasted Trump After Jan. 6 NEW YORK TIMES\nAre Jan. 6 Inmates Being Forced to Suck Up to a Neo-Nazi for Patriot Freedom? Cash?",
    "The department says nothing's wrong and that the abrupt drop in signups is due to a sudden, drastic change in Georgians' desire to register.",
    "Several Georgia voters along with the group Free Speech for People are suing to keep Greene off the 2022 ballot under the 14th Amendment.",
    "Whether or not Greene is barred, today is important because she has to answer questions truthfully, presumably under penalty of perjury.",
    "Fuck those guys.?- Rep. Reuben Galego, describing how he offered snap self-defense training to fellow lawmakers during the Jan. 6. riot.",
    "Turns out the lady Thomas has a yearslong friendship with is Connie Hair, the chief of staff to Trump ally Rep. Louie Gohmert of Texas.",
    "But he also went on tour, pumping state legislatures in Arizona, Georgia, Michigan, and elsewhere full of election-night conspiracies.",
    "Guilfoyle is under subpoena, with investigators especially interested in her organizing and fundraising for Jan. 6adjacent events.",
    "We'll present witnesses and evidence in support of the challenge, and then Rep. Greene will have an opportunity to defend herself.",
    "Guilfoyle's last remote visit got cut short because her lawyers freaked out when lawmakers they didn't like appeared on the call.",
    "Trump lashed out and trashed Brnovich this week, not-endorsing him for failing to prosecute his perceived enemies ahead of 2022.",
    "When you do, you'll be all the more incensed that McCarthy lied to everyone about the episode as soon as NYT's story came out.",
    "At first glance, it seems like keeping a sitting member of Congress like Rep. Greene from running for office is a long shot.",
    "There's been no grand jury that we know of, and so far no members of Congress have had to testify under penalty of perjury.",
    "But it's firmly nestled in his ongoing effort to obstruct the Jan. 6 investigation and intimidate companies that cooperate.",
    "She also roped in the top aide of a lawmaker involved in election lawsuits that would land on the Supreme Court's docket.",
    "A federal court in North Carolina is hearing an appeal on May 3 on a similar effort to bar Rep. Madison Cawthorn in 2022.",
    "Afterward, at some point, I expect that the administrative judge will issue his findings of fact and conclusions of law.",
    "If that sounds conflict-of-interest-y to you, you're the kind of ethics-forward person judicial recusals were made for.",
    "McCarthy brazenly lying on his quest to become speaker of a House GOP ruled by Trumpists may seem, well, unsurprising.",
    "People also noticed the texts suggesting GOP Rep. Ronny Jackson was in touch with Oath Keepers during the Jan. 6 riot.",
    "Then she met with the planners of some of the events of Jan. 6, and helped them plan those events right before Jan. 6.",
    "Would it help your cases if Congress had passed a resolution or bill declaring that Jan. 6 was indeed an insurrection?",
    "We all read late last week about his apparent interest and involvement in overturning the election from very early on.",
    "Under Georgia procedure, his report is sent to Secretary of State Brad Raffensperger, who can adopt it or reject it.",
    "So it's not of interest to us whether political party leadership in either party thinks this is a good idea or not.",
    "She'll be able to cross-examine our witnesses, and she'll certainly have an opportunity to present any of her own.",
    "Identifying and minimizing the risk of election subversion and stolen elections in the contemporary United States.",
    "It sounds like this latest appearance was substantive: Guilfoyle was apparently with investigators for nine hours.",
    "Something stinks  What's happening to automatic voter registration at Georgia's Department of Driver Services?",
    "Do Greene's tweets, statements, and meetings in support of insurrectionists amount to a 14A disqualification?",
    "We're a nonpartisan organization and we haven't been in contact with any political leadership from any party.",
    "But a lot of people look and they say, This isn't about somebody named Andy Biggs, who I've never heard of.",
    "Actually, Congress has, on multiple occasions, taken affirmative votes that declare it is an insurrection.",
    "Utah Republican Sen. Mike Lee is doing some explaining a week after news outlets put his texts on blast.",
    "Waldron's under subpoena because he appears to have put a foot in several different buckets of the plot.",
    "It's especially troubling since early voting for Georgia's May 24 primary begins a week from Tuesday.",
    "Please clap for yours truly in this primer on Section 3 of the 14th Amendment from VICE News Tonight.",
    "Merely voting in the House against certifying electors does not rise to the level of insurrection.",
    "Historically, the secretary of state adopts the judge's opinion, but he can reject it in writing.",
    "Greene, for her part, says the hearing is a scam? even though a judge ruled it could go forward.",
    "It was all he could do in his quest for Trump's endorsement in the upcoming GOP Senate primary.",
    "I was teaching (my colleagues) how to stab (the rioters) in the neck and stab them in the eye.",
    "That makes it harder for reporters who take democracy seriously to demand some accountability.",
    "And so we're using a provision of the Constitution that hasn't been used for a very long time.",
    "But that's precisely because this type of insurrection hasn't happened for a very long time.",
    "She also met with Trump and fam on the morning of the 6th, so that convo would be important.",
    "That's vital, given the extent of Republicans' efforts to obstruct the January 6 committee.",
    "This will be a hearing in a courtroom in front of an administrative law judge, but no jury.",
    "But by the end of the month, he was broadcasting fealty at Trump's Florida country club.",
    "Georgia has a voting-friendly system that registers DDS customers unless they opt out.",
    "Two, that there was an insurrection on January 6, and no serious person debates that.",
    "What do you have to show here in order to keep Rep. Taylor Greene off the ballot?",
    "Hey, remember the last time McCarthy got caught on tape talking shit about Trump?",
    "Retired Army Col. Phil Waldron became the latest member of the Coup Crew (nice!)",
    "I reached out to her office to talk about the hearing, but they didn't respond.",
    "And it was popular: Nearly 80 percent of customers registered to vote in 2020.",
    "We'll seenothing like this has happened since the aftermath of the Civil War.",
    "But as is so often the case with Trump, no amount of loyalty is ever enough.",
    "The January 6 committee is reluctant to subpoena other members of Congress.",
    "We've read about that, but I'm afraid I can't talk any further about that.",
    "So I chatted with Ron Fein, the legal director for Free Speech for People.",
    "Like, I would have killed all those motherfuckers to save this democracy.",
    "If this isn't impeachable, I don't know what is,? he said of Jan. 6.",
    "The setup has registered more than 1 million new voters since 2016.",
    " Piers Morgan belly-bumps with Donald Trump over the 2020 election.",
    "What's different about Marjorie Taylor Greene or Madison Cawthorn?",
    "How important is it to get these members of Congress under oath?",
    "HARVARD LAW REVIEW Review\nI've Had It With This Guy?: G.O.P.",
    "Whatever it is, voting advocates say it doesn't smell right.",
    "Are Democratic leaders taking this effort seriously enough?",
    "Lauren Boebert tweeted at least in support of the rioters.",
    "to sue to keep the committee away from his phone records.",
    "Then, last year, that number plummeted to 39 percent.",
    "Each state has its own legal framework and timetable.",
    "I'm not going to get into specific names or numbers.",
    "Sign up here to get it in your inbox every Friday.",
    "So what's the procedure in your hearing Friday?",
    "In both cases, the term insurrection was used.",
    "We know that thanks to the magic of recording.",
    "Each member of Congress has their own facts.",
    "Because they haven't specifically done that.",
    "And three, that she engaged in insurrection.",
    "Our conversation has been edited for length.",
    "How can you show she materially helped?",
    "(Turns out Trump didn't storm out.)",
    " We had pens  I don't give a fuck.",
    "This is about Donald Trump.",
    "That's not in dispute.",
    "What about Mike Lee?",
    "What about others?",
    "Sure, why not?"
  ]
}