{
  "id": 2781,
  "mediaId": 129,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Marjorie Taylor Greene Denies Insurrectionist' Charge in Court",
  "image": "https://static01.nyt.com/images/2022/04/22/us/politics/22dc-greene/merlin_205807167_03e53afa-1f1e-4a14-94f0-6874e45e4ba0-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/04/22/us/politics/marjorie-taylor-greene-jan-6-insurrectionist.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    883,
    1147,
    1577,
    1596,
    1616,
    2087,
    2203,
    2303,
    2525,
    539,
    562,
    2555,
    2672,
    2959
  ],
  "sentences": [
    "That section declares that no person shall? hold any office, civil or military, under the United States, or under any state, who, having previously taken an oath? to support the Constitution,? had then engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.?\nSimilar cases have suffered setbacks in North Carolina, where a federal judge blocked a challenge against Representative Madison Cawthorn, another far-right Republican, and in Arizona, where the Superior Court in Maricopa County ruled on Thursday that it did not have the authority to block the re-elections of two other conservative Republicans, Representatives Paul Gosar and Andy Biggs, and the candidacy for secretary of state of a state representative, Mark Finchem.",
    "This is a serious case that the voters who we represent have brought in order to offer proof that their United States representative seeking re-election, Marjorie Taylor Greene, having taken the oath to support the Constitution, then broke that oath and engaged in insurrection.?\nMr. Bopp dismissed the case as precisely the opposite, asserting that the law was on the side of his client, who, far from engaging in insurrection, had been a victim during the riot  scared, confused, and fearing for her life as Mr. Trump's supporters swarmed through the Capitol, where she was present just to do her job.",
    "At the heart of the case against Ms. Greene is the plaintiffs' claim that the congresswoman is disqualified from seeking re-election because her support of the rioters who attacked the Capitol made her an insurrectionist? under the Constitution, and therefore barred her under the little-known third section of the 14th Amendment, which was adopted during the Reconstruction years to punish members of the Confederacy.",
    "Judge Beaudrot will make a recommendation on whether to bar Ms. Greene from the ballot, but the final decision will fall to Georgia's secretary of state, Brad Raffensperger  the same official who resisted pressure from Mr. Trump to change the presidential election results in the state, and who faces a Trump-backed challenger, Representative Jody Hice, in the coming Republican primary.",
    "WASHINGTON  Representative Marjorie Taylor Greene, Republican of Georgia, on Friday repeated false claims of widespread fraud in the 2020 presidential election as she defended her actions surrounding the Jan. 6, 2021, attack on the U.S. Capitol, in an extraordinary hearing that asked whether she should be labeled an insurrectionist? and barred from office under the Constitution.",
    "She was accompanied to the hearing by Representative Matt Gaetz, Republican of Florida, and secured a statement from the far-right House Freedom Caucus declaring, The left's attempts to politicize the courts to achieve what they cannot at the ballot box puts America on a dangerous path.? As she entered the hearing, supporters cheered her.",
    "While under oath at an administrative law hearing in Atlanta, Ms. Greene insisted that a tremendous amount of fraudulent activity? had robbed former President Donald J. Trump of his re-election, an assertion that has been soundly refuted by multiple courts, Republican-led recounts and Mr. Trump's own attorney general, William P. Barr.",
    "More than a year after they tried and failed to use Congress's final count of electoral votes on Jan. 6 to overturn the election, some Trump allies are pushing bogus legal theories about decertifying? the 2020 vote and continuing to fuel a false narrative that has resonated with Mr. Trump's supporters.",
    "At one point, she snapped at Mr. Celli, You sound like you have as many conspiracy theories as QAnon at this point.?\nHe returned, Well you believe in QAnon,? an assertion that she denied, though she previously espoused pieces of the sprawling QAnon conspiracy theory, later saying she had moved on.",
    "I was not asking them to actively engage in violence.?\nThe contentious hearing unfolded after a group of constituents from her Northwest Georgia district, supported by liberal lawyers, filed suit to block Ms. Greene, a vigorously right-wing lawmaker, from appearing on the ballot for re-election.",
    "The legal case appeared to be on shaky ground as the administrative law judge, Charles R. Beaudrot, repeatedly sided with Ms. Greene's lawyer, the prominent conservative election attorney James Bopp Jr., who maintained that much of the questioning violated his client's right of free speech.",
    "And Ms. Greene said neither she nor members of her staff had offered anyone tours of the Capitol complex before Jan. 6, 2021, nor had they provided anyone with a map of the complex, refuting tales of a conspiracy promoted by some Democrats that she had helped the rioters plan their attack.",
    "The ruling by Amy Totenberg, who was appointed to the U.S. District Court for the Northern District of Georgia by President Barack Obama, provided a rare victory to those seeking to hold members of Congress accountable for the attack on the Capitol to forge ahead with that legal effort.",
    "But despite her exhortations on social media to #FightForTrump,? she said she had possessed no knowledge that protesters intended to invade the Capitol on Jan. 6, or disrupt the congressional joint session called to count the electoral votes and confirm Joseph R. Biden Jr.'s victory.",
    "And she repeatedly said she did not remember speaking to Mr. Gosar, Mr. Biggs or White House officials about a large protest gathering on Jan. 6, nor did she remember saying the protest could get violent  though press reports said all of those things had happened.",
    "Pat A. Cipollone and Patrick F. Philbi, two of Mr. Trump's top White House lawyers, met with the Jan. 6 House committee, while Ali Alexander, a prominent organizer of pro-Trump events after the 2020 election, said he would assist in the federal investigation.",
    "She also said she never advocated violence against her political opponents, though her personal Twitter account liked? a post that advocated a bullet to the head of Nancy Pelosi.? She said she did not recall? advocating that Mr. Trump impose martial law.",
    "They charged that she had exhorted rioters to take up arms to block the certification of Mr. Biden's election, and helped organize the assembly behind the White House on Jan. 6, 2021, that turned into a violent mob.",
    "The Justice Department has brought in a well-regarded new prosecutor to help run the inquiry, while a high-profile witness  the far-right broadcaster Alex Jones  is seeking an immunity deal to provide information.",
    "The House panel has grown divided over whether to make a criminal referral of former President Donald J. Trump to the Justice Department, even though it has concluded that it has enough evidence to do so.",
    "The proceedings on Friday came four days after a federal judge in Georgia denied Ms. Greene's request for a preliminary injunction and a temporary restraining order to block the case from moving forward.",
    "In February 2021, the House voted, largely along party lines, to strip her of her committee assignments for endorsing the executions of Democrats and spreading dangerous and bigoted misinformation.",
    "Mr. Bopp, the lawyer for Ms. Greene, said on Friday that allowing the case to proceed would cause irreparable harm for her re-election prospects and to the will of voters in her district.",
    "He maintained that the entire Free Speech for People effort was designed to deny Georgia voters their rights, because the plaintiffs could not defeat Ms. Greene at the ballot box.",
    "The proceedings were broadcast on C-SPAN, live-streamed on YouTube, Twitter and Facebook and revealed a House Republican that was often peevish and sometimes on the defensive.",
    "But the proceeding afforded lawyers pressing the case against Ms. Greene to maintain their pressure and keep attention on her role on Jan. 6, and compel her to answer for it.",
    "The law currently gives presidents the authority to deploy the military to respond to a rebellion, and some fear it could be abused by a president trying to stoke one.",
    "Ms. Greene denied calling Speaker Nancy Pelosi a traitor to her country,? though the plaintiffs' lawyer, Andrew Celli, produced a quotation from her saying just that.",
    "Some lawmakers on the Jan. 6 House committee have begun discussions about rewriting the Insurrection Act in response to the events that led to the Capitol riot.",
    "This is a solemn occasion,? Ron Fein, the lead lawyer bringing the case against Ms. Greene with the group Free Speech for People, told Judge Beaudrot.",
    "I was asking people to come for a peaceful march, which is what everyone is entitled to do under their First Amendment,? Ms. Greene testified.",
    "Though her lawyer tried to keep the arguments dry and legal, Ms. Greene marshaled the support of others in her wing of the party.",
    "Ms. Greene has proved to be a headache for Republican leaders, with her taunting antics against Democrats and Republicans alike.",
    "The debate centers on whether a referral would backfire by politically tainting the expanding federal investigation.",
    "It also created a potential distraction for Ms. Greene ahead of the May 24 primaries in Georgia.",
    "A separate effort is pending against Republicans, including Senator Ron Johnson, in Wisconsin.",
    "The federal investigation into the Jan. 6 attack appears to be gaining momentum.",
    "Amid that drama, several Republicans have stepped forward to challenge her.",
    "Capitol Riot's Aftermath: Key Developments\nCard 1 of 5\nSigns of progress.",
    "But so far, only the case against Ms. Greene has been allowed to proceed.",
    "She said she did not recall meeting with any of the instigators.",
    "And on Friday, she was forced to answer questions under oath.",
    "This is not a place for political hyperbole.",
    "Weighing changes to the Insurrection Act.",
    "This is not a place for political smear.",
    "It's a court of law,? Mr. Bopp said.",
    "This is not a candidate debate.",
    "Cooperating with investigators.",
    "Debating a criminal referral.",
    "Continuing election doubts.",
    "This is not politics.",
    "This is not theater."
  ]
}