{
  "id": 2784,
  "mediaId": 43,
  "date": "4/22/2022 12:00:00 AM",
  "headline": "Madison Cawthorn having fun with alcohol and lingerie",
  "image": "https://images.dailykos.com/images/1061911/story_image/DK-CawthornCrossDresser.jpg?1650664967",
  "link": "https://www.dailykos.com/story/2022/4/22/2093517/-Madison-Cawthorn-as-alcohol-fueled-cross-dresser",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    782,
    1609,
    2303,
    428,
    2696,
    2834
  ],
  "sentences": [
    "Madison Cawthorn photographed wearing women's lingerie at wild-looking party\nExclusive: Madison Cawthorn photos reveal him wearing women's lingerie in public setting\nPolitico, Michael Kruse, 4/22/2022\nPhotographs obtained by POLITICO appear to show Madison Cawthorn, the embattled Republican congressman from North Carolina who recently accused his GOP colleagues of inviting him to orgies, wearing lingerie in what appears to be a party setting.",
    "His comments about the sexual perversion? in Washington made on a podcast, which he later admitted were exaggerated, drew the public disapproval and disavowal of Minority Leader Kevin McCarthy as well as other Republican leaders including those in his North Carolina congressional caucus.",
    "Cawthorn, 26, was raised in a conservative Baptist community in Henderson County, North Carolina, and has staked his political persona on arch-traditional Christian principles and the insistence of the importance of a kind of hypermasculinity.",
    "We know that Cawthorn's hypermasculinity, wrapped in the cloth of Republican Jesus, has been one of his shining features for the White Evangelical communities of Western North Carolina and beyond.",
    "Tomorrow's diary will continue to focus on the Democrats that are running in the May 17th primary for the opportunity to challenge him in November for the NC-11 congressional seat.",
    "The revelation of the two photos is the latest in a series of unflattering headlines for the freshman member of Congress in the run-up to the primary in his first re-election bid.",
    "Revelations about his behavior, from speeding, driving with a revoked driver's license, and more, are starting to take its toll on his approval.",
    "For weekly Cawthorn news, please check out DKos Asheville Open Thread on Saturdays and North Carolina Open Thread on Sundays.",
    "Maybe something as abhorrent as dressing in lingerie while partying with happy women will be the final straw.",
    "Once again, Madison becomes the gift that keeps giving Republicans headaches.",
    "Cawthorn has seven Republican opponents who see him as vulnerable.",
    "***11:05 pm***\n Thanks for the Recs and the comments!",
    "The primary in North Carolina is May 17.",
    "Trending is a rare treat for me.",
    "Thanks for reading, go blue!",
    "But then again, maybe not."
  ]
}