{
  "id": 2793,
  "mediaId": 136,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Donald Trump Could Lose One of His Most Loyal Supporters in Congress",
  "image": "https://d.newsweek.com/en/full/2024100/marjorie-taylor-greene.webp?w=790&f=25f65c9efcd884aa90b47fc66cecefef",
  "link": "https://www.newsweek.com/donald-trump-could-lose-one-his-most-loyal-supporters-congress-1699796",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Jackson",
  "authorUrl": "https://www.newsweek.com/authors/jon-jackson",
  "termIds": [
    883,
    883,
    1147,
    1147,
    428,
    366,
    366,
    562,
    562,
    545,
    545,
    428,
    2672,
    2672,
    2624,
    2624,
    2834,
    2834
  ],
  "sentences": [
    "\"The same nasty people in Washington who think they're better than you, that hate every single one of you because they hated President Trump and they hate me, they're trying to take away your right to vote in my district because now they're coming after me to remove my name off the ballot,\" Greene told the crowd.",
    "Should the legal challenge prevail and Greene is deemed ineligible to seek reelection, Trump would find himself without a major ally who has also been one of the biggest proponents of his policies, as well as his baseless claims of voter fraud in 2020's presidential race.",
    "The result of the proceeding, which was triggered following a legal challenge from voters who argue Greene should be removed from the ballot, could mean former President Donald Trump stands to lose one of his staunchest supporters in Congress.",
    "GOP Representative Marjorie Taylor Greene of Georgia is scheduled to appear before a state administrative law judge on Friday for a hearing about whether she should be disqualified from seeking reelection in November's midterms.",
    "Greene attempted to block the challenge by filing a lawsuit earlier this month that argued that the provision the voters are citing is unconstitutional and that state officials should be prevented from enforcing it.",
    "In arguing that Greene should not be able to hold office, the suit cites a provision in the Constitution's 14th Amendment that was added to prevent former Confederates from seeking office after the Civil War.",
    "\"I'm honored and grateful to have such a strong endorsement from my favorite President and the greatest President of my lifetime,\" Greene said in a statement later the same day.",
    "James Bopp Jr., the attorney representing Greene, has called the case against his client \"50 pages of newspaper articles, hearsay and political hyperbole,\" according to CNN.",
    "Following Greene's hearing on Friday, the state administrative law judge will present his findings to the secretary of state, who will then decide her fate on the ballot.",
    "If Greene is removed from this year's ballot in Georgia, her seat would likely go to another Republican, Georgia-based political consultant Jay Williams told Newsweek.",
    "But during a recent interview with online publication The Dispatch, she stopped short of fully endorsing the \"stolen election\" narrative other Trump supporters push.",
    "On Monday, a federal judge ruled the group of voters can proceed with their legal efforts, but Greene filed an appeal Tuesday against that ruling.",
    "\"I think there's no chance of a Democrat winning that seat,\" Williams said, speaking about the largely conservative 14th Congressional District.",
    "Another Trump loyalist, North Carolina Representative Madison Cawthorn, is similarly facing a legal challenge from voters to his reelection.",
    "They filed a lawsuit to have her barred from the election over her alleged involvement in the U.S. Capitol riot on January 6, 2021.",
    "Last month, Greene denounced the legal challenge against her while speaking at a rally held by Trump in Commerce, Georgia.",
    "Jennifer Strahan, a health care consultant running against Greene in the Republican primary, has said she supports Trump.",
    "More recently, he called Greene \"a warrior in Congress\" when he formally endorsed her reelection campaign on April 6.",
    "At a rally last summer, he called the congresswoman \"brilliant,\" \"incredible\" and one of his \"favorite people.\"",
    "\"She doesn't back down, she doesn't give up, and she has ALWAYS been with 'Trump,'\" Trump said in a statement.",
    "She even wore \"Stop the Steal\" and \"Trump Won\" masks on the House floor in the months following the election.",
    "However, the other GOP candidates for the seat aren't perceived to be as devoted to Trump as Greene is.",
    "She said that while there may have been \"issues\" with the count, \"Joe Biden is our current president.\"",
    "They point to statements he made that have been construed as supportive of the January 6 Capitol riot.",
    "Trump has expressed his fondness and admiration for Greene, publicly describing her in glowing terms.",
    "Marjorie is running for re-election to Congress, and has my Complete and Total Endorsement!\"",
    "Greene, on the other hand, has long contended Trump was the rightful winner in 2020.",
    "The group of voters involved with the case is from Greene's congressional district.",
    "For now, Greene is set to answer questions under oath at Friday's hearing.",
    "\"She loves our Country and MAGA, its greatest ever political movement.",
    "Newsweek reached out to Greene and Trump for comment.",
    "\"America and the entire world misses him dearly.\""
  ]
}