{
  "id": 2794,
  "mediaId": 43,
  "date": "4/21/2022 12:00:00 AM",
  "headline": "Marjorie Taylor Greene Facing Questions Under Oath Over January 6 Role, by Steven Rosenfeld",
  "image": "https://images.dailykos.com/images/1061617/large/greene.png?1650582770",
  "link": "https://www.dailykos.com/story/2022/4/21/2093290/-Marjorie-Taylor-Greene-Facing-Questions-Under-Oath-Over-January-6-Role-by-Steven-Rosenfeld",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Steven Rosenfeld",
  "authorUrl": "",
  "termIds": [
    2358,
    2358,
    1147,
    1147,
    1090,
    1090,
    883,
    883,
    895,
    895,
    683,
    683,
    1596,
    1596,
    1575,
    1575,
    2095,
    2095,
    2203,
    2203,
    2277,
    2277,
    2087,
    2087,
    571,
    571,
    428,
    539,
    539,
    428,
    200,
    200,
    2550,
    2550,
    2555,
    2555,
    2672,
    2672,
    2826,
    2826,
    2934,
    2945,
    2945,
    2934
  ],
  "sentences": [
    "The events of January 6, 2021, amounted to an insurrection or a rebellion under Section Three: a violent, coordinated effort to storm the Capitol to prevent the Vice President of the United States and the United States Congress from fulfilling their constitutional roles by certifying President Biden's victory, and to illegally extend then-President Trump's tenure in office, including by illegally introducing illegitimate electors as alternate slates' for Congress to vote on.?\nWhether Greene is ineligible to be a 2022 candidate for federal office is not the only issue at stake, according to Free Speech for People's 14 Point 3 Campaign.? Their candidate challenges are seeking to defend the laws, rules, and guardrails governing American democracy  starting with the foundational charter, the U.S. Constitution.",
    "Plans for violenceand specifically occupying the Capitol to prevent the certification vote or violently influence its outcomewere so prevalent that one reporter has remarked that [a]nyone with a Twitter account and an hour of time to kill could have warned about the potential for violence on Jan. 6and many did.? Furthermore, the insurrection was in part motivated by a desire to prevent the certification in order to send false electoral slates to Congressan effort Greene endorsed and promoted.?\nGreene, whose belligerence defending Trump and attacking Democrats is well known, is among a handful of federal and state lawmakers whose 2022 candidacies have been challenged under the Constitution  which she swore to uphold when taking office days before the uprising.",
    "That Greene would deny that she ever supported the riot that sought to block Congress from ratifying the 2020 Electoral College votes that certified Joe Biden's presidential election victory is contradicted by her public actions and statements on and after January 6, according to the factual documentation in a lawsuit that is seeking to disqualify her candidacy under the U.S. Constitution's 14th Amendment, which bars anyone from holding a federal or state elected office if they have engaged in insurrection or rebellion against the same.?\nRepresentative Greene promoted the demonstration ahead of time, declaring that it was our 1776 moment' on an interview the day before.",
    "Given the propaganda and serial lying by Greene about the insurrection  first denying Trump's 2020 loss, then encouraging the attempted coup, then accusing her political opponents of inciting the violence that ensued, then denying her involvement in any of these events  the media coverage of Friday's hearing is likely to be intense and circus-like, and possibly obscure the constitutional questions raised under the 14th Amendment's Section Three.",
    "It is absurd to claim that a sitting member of the United States Congress advocated for the overthrown of the United States government,? said Arizona attorney Alexander Kolodin, who represents Rep. Paul Gosar (R-AZ), whose public support of the insurrection is also well-known, during an April 20 state court hearing in Phoenix where the group's lawsuit challenging the candidacy of Gosar and two other pro-insurrection candidates was heard.",
    "You know, if you can challenge any representative's candidacy or elected office holder, then I bet you we could round up some Republican voters who didn't like [Vice-President] Kamala Harris funding rioters, criminal rioters out of jail, or [Reps.] Ilhan Omar or Cori Bush or Maxine Waters inciting riots.?\nFactually, no Democratic woman officeholder Greene mentioned incited the January 6 riot.",
    "Their biggest target is not lawmakers like Greene or Gosar in this year's elections, but Trump and his plans for 2024.\nTrump is preparing to run for president again in 2024, holding rallies across the country to activate his base However, Trump's incitement of the January 6th insurrection makes him ineligible for any future run for office,? the organization said.",
    "In the short run, however, it is notable that Free Speech for People's legal team, suing on behalf of a handful of voters in each state, will accomplish on Friday what the U.S. House's Select Committee to Investigate the January 6th Attack on the United States Capitol has failed to do thus far: interrogate a member of Congress about her role in the riot.",
    "On Friday, April 22, when Georgia Republican Rep Marjorie Taylor Greene becomes the first member of Congress to be interrogated before a court that must decide if her support for Donald Trump's attempted coup on January 6, 2021, disqualifies her candidacy for federal office, Greene will likely do what she's always done since the insurrection.",
    "Free Speech For People urge[s] Secretaries of State and chief election officials across the country to follow the mandate of Section 3 of the Fourteenth Amendment and bar insurrectionists from any future ballot.?\nSteven Rosenfeld is the editor and chief correspondent of Voting Booth, a project of the Independent Media Institute.",
    "This is how far it's going, these leftists, these progressives who would rather want  they'd rather have the judge or bureaucrats making decisions instead of voters, they want to hand that over to them and not let the people in my district to even have the right to vote for me,? she told Carlson.",
    "On March 10, U.S. District Court Judge Richard Myers ruled that Cawthorn's candidacy could not be challenged because his support of the insurrection was absolved by an 1872 federal law granting amnesty to former Confederates  southern supporters of the Civil War.",
    "An insurrection' or rebellion' under the Disqualification Clause includes actions against the United States with the intent to overthrow the government of the United States or obstruct an essential constitutional function,? the complaint against Greene said.",
    "But the legal challenge drew a cold reception from Maricopa County Superior Court Judge Christopher Coury, who repeatedly said that the group's legal team had misread the Arizona law they claimed allowed candidates to be removed from the ballot.",
    "But her attack on her political opponents  accusing them and the FBI of igniting the insurrection  and her denial of any involvement in the failed coup has become a common refrain among the 2022 candidates challenged by Free Speech for People.",
    "Furthermore, the planners of the January 6 demonstration report that she met with them beforehand,? said the lawsuit seeking to bar Greene's candidacy filed by Free Speech for People, a progressive public interest law firm.",
    "I have to go to court on Friday and actually be questioned about something I've never been charged with and something I was completely against,? Greene told Fox News Channel's pro-Trump host, Tucker Carlson, on April 18.",
    "He has reported for National Public Radio, Marketplace, and Christian Science Monitor Radio, as well as a wide range of progressive publications including Salon, AlterNet, the American Prospect, and many others.",
    "In contrast, the group's legal action against Greene has taken a different course from its lawsuit against North Carolina Rep. Madison Cawthorn, who also faces a Republican primary in mid-May.",
    "The stated goal of the organizers was to pressure Vice President Pence into disregarding the electoral votes from several states and declaring Trump the winner of the 2020 election.",
    "The likelihood of violence during the implementation of this plan was plain to bystanders and probably more so to those intimately involved,? the legal complaint continued.",
    "We just haven't started shooting yet.'?\nLike the suit against Greene, Free Speech for People's lawsuit extensively documented Gosar's pro-insurrection actions.",
    "In fact, he's [Gosar] not alleged to have called for violence except in some speech before that Capitol riot where he said, A civil war is coming.",
    "A forthcoming ruling raising procedural issues would delay hearing the 14th Amendment case, although Arizona's primary is not until August.",
    "In fact, there are not even any specific allegations as to Congressman Gosar to that effect,? Kolodin continued.",
    "By Steven Rosenfeld\nThis article was produced by Voting Booth, a project of the Independent Media Institute.",
    "But Greene, like Trump, has pretended nothing happened and called her critics criminals.",
    "You know, there is something that I have learned, and I think this is really important.",
    "Before the demonstration, violent groups announced they were going to attend it.",
    "But no, the Republican Party needs to fight harder, Tucker.",
    "That ruling has been appealed.",
    "She will lie."
  ]
}