{
  "id": 2801,
  "mediaId": 136,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "Trump's Power Dealt a Blow After Tennessee GOP Turns on Him",
  "image": "https://d.newsweek.com/en/full/2023062/donald-trump.webp?w=790&f=07f50b28ce70beddf83e719791797c9f",
  "link": "https://www.newsweek.com/trumps-power-dealt-blow-after-tennessee-gop-turns-him-1699337",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jon Jackson",
  "authorUrl": "https://www.newsweek.com/authors/jon-jackson",
  "termIds": [
    1147,
    1147,
    2303,
    2137,
    2137,
    1816,
    1816,
    1336,
    1336,
    1653,
    1653,
    2303,
    428,
    428,
    492,
    492,
    2672,
    2672,
    2932,
    2932
  ],
  "sentences": [
    "Meanwhile, voters have filed complaints with state elections officials to disqualify Georgia Representative Marjorie Taylor Greene and North Carolina Representative Madison Cawthornboth high-profile Trump alliesfrom seeking reelection for statements they made that have been construed as supportive of the January 6 capitol riot.",
    "Others include Sean Parnell, who earned the former president's support in this year's Pennsylvania U.S. Senate race before he ended his campaign after losing custody of his children in a divorce case that included allegations of past domestic abuse (Trump has since endorsed celebrity physician Mehmet Oz in the race).",
    "Morgan Ortagus, the candidate favored by Trump, was taken off the ballot for the 5th Congressional District along with two others, Baxter Lee and Robby Starbuck, by the party's executive committee, Tennessee Republican Chairman Scott Golden confirmed to multiple local outlets.",
    "In his endorsement of her in January, he said she was \"fantastic in her role\" as the spokesperson at the U.S. Department of State during his administration and called her \"an absolute warrior for America First and MAGA.\"",
    "The Tennessee Republican Party on Tuesday dealt a blow to former President Donald Trump's standing as the leader of the GOP when it voted to remove a congressional candidate he endorsed from the state's primary ballot.",
    "I'm further disappointed that the party insiders at the Tennessee Republican Party do not seem to share my commitment to President Trump's America First policies.\"",
    "\"I am deeply disappointed in the SEC's decision,\" Ortagus said in a statement about the action from the state party's State Executive Committee.",
    "In Ortagus' case, Republican state legislators and party officials pushed for her removal because she had only moved to Tennessee last year.",
    "A party bylaw requires candidates to have voted in three of the last four GOP primaries and to participate in local Republican parties.",
    "Republican State Senator Frank Niceley sponsored the recent bill that included the residency requirement.",
    "In an interview with NBC last month, he discussed the motivation behind the legislation.",
    "Newsweek reached out to Trump, Ortagus and the Tennessee Republican Party for comment.",
    "Ortagus is the latest Trump-backed candidate to meet resistance this year.",
    "\"I'm a bonafide Republican by their standards, and frankly, by any metric.",
    "But I don't want him coming out here to tell me who to vote for.\"",
    "Official challenges had been filed against all three candidates.",
    "Trump has not commented on Ortagus' removal from the ballot.",
    "\"I'll vote for Trump as long as he lives.",
    "I supported him,\" Niceley said.",
    "\"I voted for Trump."
  ]
}