{
  "id": 2802,
  "mediaId": 151,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "House Dems try to ward off GOP attacks on crime",
  "image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg",
  "link": "https://www.politico.com/newsletters/huddle/2022/04/20/house-dems-try-to-ward-off-gop-attacks-on-crime-00026531",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1764,
    1764,
    1230,
    1230,
    1799,
    1799,
    1940,
    1940,
    2087,
    2087,
    2062,
    2062,
    428,
    562,
    562,
    428,
    146,
    146
  ],
  "sentences": [
    "QUICK LINKS\nFor David McCormick, the Christmas Tree Farm Is a Fraction of His Wealth, by the New York Times' Blake Hounshell\nTrump tests the power of the anti-endorsement, by the Washington Examiner's David Drucker\nTennessee GOP kicks Trump-backed Morgan Ortagus, Baxter Lee and Robby Starbuck out of primary, by the Tennessean's Adam Friedman and Melissa Brown\nTech mogul on his quixotic Senate bid: It's not just about eviscerating Elon Musk, by POLITICO's Christopher Cadelago\nRetired conservative judge willing to publicly testify about Jan. 6 and his counsel to Pence, by CBS News' Robert Costa\nTRANSITIONS\nSean McClintock is now national security advisor for Sen. Catherine Cortez Masto (D-Nev.).",
    "In their letter, Moran and Daines write that opening the embassy will enhance cooperation with a democratic partner as it wages an existential defense and symbolically affirm our nation's commitment to Ukraine's territorial sovereignty.? The two GOP senators noted that the United States has previously maintained its embassies in countries facing war and suggested that keeping the U.S. embassy closed signals a lack of confidence in Ukraine's ability to defend itself and the diplomatic missions under its protection.? Read the letter here.",
    "House Dems try to ward off GOP attacks on crime\nBy MARIANNE LEVINE\n04/20/2022 07:11 AM EDT\nPresented by Connected Commerce Council\nWith Andrew Desiderio, Burgess Everett and Daniel Lippman\nDEMS TRY TO PREEMPT GOP ATTACKS ON CRIME: Rep. Abigail Spanberger (D-Va.), a Democratic frontliner, anticipates Republicans will attack her record on crime come November-- and she's trying to get out in front of it now, Nicholas and Sarah report.",
    "Puck's Theodore Schleifer, meanwhile, reports that Thiel personally lobbied Trump to back Vance but that Tucker Carlson and Rep. Matt Gaetz (R-Fla.) were much more involved in securing the endorsement.?\nLONGSHOT DEMS RAKE IN CAMPAIGN MONEY: Gary Chambers Jr. has almost no path to beating Republican Sen. John Kennedy (R-La.)",
    "JAN. 6 COMMITTEE CONSIDERS CHANGES TO INSURRECTION ACT': As the Jan. 6 panel puts together its final report, members of the select committee are discussing whether to recommend revisions to the 1807 Insurrection Act, which grants presidents broad authority to deploy troops domestically in response to a rebellion.",
    "Burgess and Holly Otterbein wrote earlier this week about growing opposition to the decision from vulnerable Senate Democrats as well as Democratic candidates in key Senate races, who don't want to see Title 42 ended without a longer term plan for an anticipated increase in border crossings.",
    "After describing the defund the police? slogan as voters' top issue in her 2020 race, Spanberger is growing worried that GOP efforts to pin rising violent crime rates on Democrats could lead to more political casualties in what's already expected to be a tough midterm year for the party.",
    "Billionaire tech investor Peter Thiel, who backed Vance early, donated an additional $3.5 million to Protect Ohio Values, a super PAC supporting the Hillbilly Elegy? author, POLITICO's Alex Isenstadt scoops.That brings Thiel's total donations to the super PAC to $13.5 million.",
    "Welcome to Huddle, the play-by-play guide to all things Capitol Hill, on this Wednesday, April 20, where your fill-in Huddle host is using recess to watch The Dropout? and is decidedly creeped out by how much Amanda Seyfried resembles Elizabeth Holmes.",
    "MORE UKRAINE ACTION  When lawmakers return from recess next week, they could send a significant piece of legislation to President Joe Biden's desk that would fast-track the delivery of weapons and other critical supplies to Ukraine.",
    "President Joe Biden's advisers are considering postponing his repeal of pandemic-era border restrictions, known as Title 42, amid sharp blowback from members of his own party, Axios' Hans Nichols and Jonathan Swan report.",
    "Jasmine Beach-Ferrara and Marcus Flowers, exemplify a trend of Democratic celebrity candidates who are prolific fundraisers despite their longshot congressional bids, writes the New York Times' Jonathan Weisman.",
    "Former President Donald Trump never actually invoked the Insurrection Act, but threatened to in 2020, in response to large protests following the murder of George Floyd in Minneapolis by a white police officer.",
    "Delaying the decision, announced earlier this month by the Centers for Disease Control and Prevention, would almost certainly lead to blowback from progressives in the party who want to see the policy revoked.",
    "The New York Times' Luke Broadwater reports that among the potential changes under discussion would be to raise the bar for a president to send the military, including a requirement to consult with Congress.",
    "So why are you going to just say you want to do something that you actually, maybe, don't want to do??\nHer approach is part of a broader Democratic strategy for 2022: Respond to Republican attacks directly.",
    "(It was The Blind Side.?)\nTODAY'S QUESTION, from Lauren: What Florida county, sharing its name with a U.S. President, contains part of the Everglades and all of the Florida Keys including the Dry Tortugas?",
    "So Spanberger, after a recent tour of the Culpeper, Virginia, police department, offered an example for how to respond, speaking to more than a dozen officers and touting legislation to assist officers.",
    "According to a senior Democratic aide, the Senate-passed bill establishing a World War II-style Lend-Lease program for Ukraine is being discussed as a possible suspension bill on the floor next week.",
    "Through the end of March, Vance's campaign had just $1.6 million in the bank, a fraction of the amount reported by two of Vance's closest competitors, Josh Mandel and Mike Gibbons,? Isenstadt writes.",
    "TRIVIA\nTUESDAY'S WINNER: Lauren Reamy was the first to correctly guess that Tommy Tuberville was the sitting senator who had a cameo in a 2009 movie starring Sandra Bullock.",
    "You should not be afraid to talk about it,? said Rep. Josh Gottheimer (D-N.J.), another swing-district Democrat promoting work to support law enforcement.",
    "And in the aftermath of the 2020 election, hard-right advisers suggested Trump declare martial law and send troops to take control of voting machines.",
    "are urging Secretary of State Antony Blinken to re-open the U.S. embassy in Kyiv, citing Russian withdrawal from surrounding areas of the capital.",
    "(A bipartisan group of lawmakers in the Senate, led by Sen. Susan Collins (R-Maine), is also working on a proposal to reform the 1887 law.)",
    "Critics, however, lament that the influx of campaign cash should go toward races where Democrats have a more realistic chance of winning.",
    "Beach-Ferrara is seeking to oust Rep. Madison Cawthorn (R-N.C.), while Flowers is vying to replace Rep. Marjorie Taylor Greene (R-Ga.).",
    "The discussions surrounding reforms to the law come as the panel is expected to also recommend changes to the Electoral Count Act.",
    "Some battleground members acknowledge that some of their colleagues have shied away from talking about immigration and policing.",
    "Here's some background on Lend-Lease, what it does, and why it's so significant given the historical context.",
    "There's loud voices on the extremes on both sides that make it like you can't actually have smart policy.",
    "The Ohio primary is scheduled for May 3 and the latest infusion of Thiel money could go a long way.",
    "What we need to do is show people there's a way to do both.? More from Nicholas and Sarah here.",
    "Vance is already seeing a financial return on Trump's recent endorsement of his Senate bid.",
    "He most recently was Chief of Senate Affairs at the U.S. European Command at the Pentagon.",
    "Flowers raised $2.4 million in the first quarter, more than double Greene's $1.1 million.",
    "Josh Bowlen has been promoted to be legislative director for Sen. Richard Burr (R-N.C.).",
    "And they know the world is on fire,? the Virginia Democrat said after the police visit.",
    "The first person to correctly guess gets a mention in the next edition of Huddle.",
    "(Passing it on suspension would require support from two-thirds of the chamber.)",
    "FIRST IN HUDDLE: MORAN, DAINES URGE BLINKEN TO REOPEN US EMBASSY IN KYIV: Sens.",
    "Laura Keller is now digital press secretary for the Senate Judiciary Committee.",
    "She most recently was communications director for Rep. Kurt Schrader (D-Ore.).",
    "The Senate passed the Lend-Lease bill unanimously before the two-week recess.",
    "The Biden administration is currently slated to end the restrictions May 23.",
    "Molly Prescott is now Oregon press secretary for Sen. Jeff Merkley (D-Ore.).",
    "If your words are defund the police,' they're going to think you mean that.",
    "He most recently was Burr's senior policy adviser, a role he retains.",
    "She most recently was a press fellow for Sen. Jacky Rosen (D-Nev.).",
    "CAMPAIGN CORNER\nVANCE CASHES IN ON TRUMP NOD: Ohio Republican J.D.",
    "They know they're afraid, they know there's a pandemic.",
    "Follow Marianne on Twitter: @marianne_levine\nFollow Us",
    "Send your answers to ktullymcmanus@politico.com.",
    "in November, but he's still raised $1.2 million.",
    "Jerry Moran (R-Kan.) and Steve Daines (R-Mont.)",
    "TODAY IN CONGRESS\nThe House and Senate are out.",
    "GET HUDDLEemailed to your phone each morning.",
    "But they warn that could help the GOP.",
    "WILL BIDEN DELAY TITLE 42 DECISION?",
    "They know things are upside down.",
    "AROUND THE HILL\nZzzzzzz.",
    "He, along with Rev.",
    "GOOD MORNING!"
  ]
}