{
  "id": 2805,
  "mediaId": 169,
  "date": "4/20/2022 12:00:00 AM",
  "headline": "Tennessee GOP kicks Trump-backed candidate who sparked MAGA civil war off the ballot",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/04/morgan-ortagus-0420221.jpg",
  "link": "https://www.salon.com/2022/04/20/tennessee-kicks-backed-candidate-sparked-maga-civil-off-the-ballot/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.salon.com/writer/igor-derysh",
  "termIds": [
    1048,
    1048,
    1147,
    1147,
    1746,
    1746,
    1477,
    1477,
    1816,
    1816,
    428,
    492,
    492,
    428,
    2932,
    2932
  ],
  "sentences": [
    "The Tennessee GOP's State Executive Committee voted to boot Ortagus, a former Fox News commentator and Trump State Department spokesperson, from the August primary ballot in the state's 5th District after months of Republican infighting over her campaign bid, according to NBC News.",
    "The state GOP in recent years has booted numerous candidates off the ballot for not adhering to the party's bylaws, which include a requirement to have voted in three of the last four Republican primaries and to actively participate in state or local Republican parties.",
    "\"President Donald Trump believes I'm the best person to fight for his America First agenda and Middle Tennessee in Congress, and I'm working hard to ensure that my fellow Tennesseans, including TNGOP SEC members, understand why,\" she said in a statement before the vote.",
    "\"That is a dirty lie, which should not surprise anyone, given there are RINOs in Tennessee trying to quietly pull strings and illegally remove President Trump's endorsed candidate, Morgan Ortagus, from the ballot,\" Trump spokesman Taylor Budowich told the outlet.",
    "The Tennessean earlier this week reported that Republican National Committee member Beth Campbell had circulated an email claiming that \"RNC sources\" told her that \"Trump is OK\" with the state GOP booting Ortagus from the ballot, which Trump's team denied.",
    "\"Not allowing me on the ballot would disenfranchise a huge segment of our voters in Tennessee, discourage people from engaging in the process and most of all it would reek of the dirty politics that makes so many distrust our elections.\"",
    "Niceley, who sparked outrage last week after invoking Adolf Hitler as an example for homeless people turning their life around, suggested that Trump was only supporting Ortagus because she is Jewish like members of Trump's family.",
    "Prominent Trump allies like Rep. Madison Cawthorn, R-N.C., and Candace Owens revolted over the endorsement, criticizing Trump for not backing MAGA favorite Robby Starbuck, a former music video producer and conservative influencer.",
    "Republicans had clamored to jump into the crowded field after the Republican-dominated state legislature carved up longtime Rep. Jim Cooper's, D-Tenn., blue Nashville-area district to expand their partisan majority.",
    "State lawmakers earlier this year passed a bill requiring Congressional candidates to live in the state for three years to qualify for primary ballots, which would have disqualified Ortagus from the ballot.",
    "We need conservative leadership and there are other voices out there that can provide that leadership,\" Tom Zawistowski, the president of the Tea Party group We the People Convention, told local media.",
    "Trump allies raged over his endorsement of Dr. Mehmet Oz in Pennsylvania's Senate primary last week, calling it \"horrible\" and \"inexcusable\" because they don't view Oz as not right-wing enough.",
    "The Tennessee Republican Party on Tuesday voted to remove Trump-backed House candidate Morgan Ortagus and two others from the primary ballot for failing to adhere to the party's bylaws.",
    "Her critics cited her past criticism of Trump, who she called \"disgusting\" during the 2016 campaign before joining his administration, and her support for Jeb Bush's presidential bid.",
    "Ortagus' campaign argued that she had voted in enough recent Republican primaries and has been involved in Republican women's groups and donated to the state's Republican Party.",
    "I'm further disappointed that the party insiders at the Tennessee Republican Party do not seem to share my commitment to President Trump's America First policies,\" she said.",
    "The Tennessee GOP on Tuesday also removed another candidate, Baxter Lee, for failing to meet the primary voting requirement, leaving few prominent candidates in the race.",
    "\"While we were working hard in Ohio to support you and Make America Great Again, JD Vance was actively working against your candidacy,\" the GOP leaders wrote in a letter.",
    "Trump in February gave Ortagus his \"complete and total endorsement\" even though she had just moved to the state last year and only moved into the district in March.",
    "\"My whole life I've only been registered with one party and I've only ever donated to Republican candidates,\" he said in a statement last month before the vote.",
    "But Starbuck was ultimately booted from the ballot too because he did not meet the party's primary voting requirement, which he attributed to a \"simple mixup.\"",
    "Trump allies like Owens and Cawthorn had hoped Trump would support Starbuck, who has drawn numerous endorsements from far-right allies of the former president.",
    "After the vote on Tuesday, Starbuck tweeted a video of Breitbart founder Andrew Breitbart saying \"war\" as ominous music plays in the background.",
    "\"As I have said all along, I believe that voters in Middle Tennessee should pick their representative  not establishment party insiders.",
    "Trump's endorsement of Ortagus riled Republicans in the state, who argued that she was not far-right enough for the party's nomination.",
    "Bill Lee did not sign the bill before the April 7 filing deadline, allowing Ortagus to remain on the ballot before Tuesday's vote.",
    "Trump's recent endorsements have drawn blowback from the far-right, raising questions about his sway over the party's base.",
    "Cooper announced he would retire from Congress after redistricting, accusing the legislature of \"dismembering Nashville.\"",
    "After the endorsement, Trump's supporters in Ohio criticized him for listening to \"RINOs,\" or Republicans in Name Only.",
    "Others criticized her for having her wedding officiated by the late liberal Supreme Court Justice Ruth Bader Ginsburg.",
    "His work has also appeared in the Los Angeles Times, Chicago Tribune, Boston Herald and Baltimore Sun.",
    "Dozens of Republican leaders also tried to block Trump from endorsing \"Hillbilly Elegy\" author J.D.",
    "I supported him,\" Republican state Sen. Frank Niceley, who sponsored the bill, told NBC last month.",
    "Ortagus said in a statement that Niceley \"should be ashamed of his repeated anti-Semitic rhetoric.\"",
    "\"Senator Niceley's repulsive words could not be more clear in disparaging the Jewish people.",
    "\"I think Jared Kushner  he's Jewish, she's Jewish  I think Jared will be upset.",
    "\"Gerrymandering is an extinction event for the political life of Nashville.\"",
    "\"Trump has this completely wrong,\" Owens tweeted after Trump's endorsement.",
    "The Tennessee GOP voted on Tuesday to boot Starbuck off the ballot as well.",
    "\"I'm a bonafide Republican by their standards, and frankly, by any metric.",
    "\"I will condemn anyone who traffics in this hate-mongering,\" she added.",
    "Vance in the Ohio Senate primary, citing his past criticism of Trump.",
    "Ortagus told NBC News she was \"deeply disappointed\" in the decision.",
    "Igor Derysh\nIgor Derysh is Salon's Deputy News and Politics Editor.",
    "But I don't want him coming out here to tell me who to vote for.\"",
    "\"This is a crisis for Nashville,\" Cooper said earlier this year.",
    "\"I don't think Trump cares one way or the other,\" he said.",
    "Our team is evaluating the options before us.\"",
    "\"I'll vote for Trump as long as he lives.",
    "We don't need President Trump.",
    "I don't think Trump cares.\"",
    "This racism cannot stand.\"",
    "\"President Trump needs us.",
    "Ivanka will be upset.",
    "MORE FROM Igor Derysh",
    "\"I voted for Trump.",
    "But Republican Gov."
  ]
}