{
  "id": 281,
  "mediaId": 195,
  "date": "3/25/2022 12:00:00 AM",
  "headline": "Five takeaways from the House GOP's annual retreat",
  "image": "https://cdn.jwplayer.com/v2/media/B9pkdDi0/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/599777-five-takeaways-from-the-house-gops-annual-retreat",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1101,
    1147,
    1248,
    1609,
    2087,
    2214,
    2303,
    3085,
    3094,
    428,
    562,
    571
  ],
  "sentences": [
    "Republican leaders keep Trump at arm's length\nAfter years of strict adherence to former President Trump and his agenda-setting grievances, House Republican leaders used their retreat to plan out a more traditional conservative strategy, one that hinges on issues like government spending, inflation and national security.",
    "There was also plenty of talk about what they described as a crisis at the U.S.-Mexico border, with members repeatedly lamenting the number of people crossing into the U.S. illegally and blaming the Biden administration's approach to border security for allowing drugs like fentanyl to pass into the country.",
    "GOP looks to recreate 1994 Republican Revolution'\nFrom the get-go, House Republican leaders sought to draw parallels between 2022 and 1994, when the GOP recaptured unified control of Congress for the first time in more than four decades after netting 54 seats in the House and eight in the Senate.",
    "They're not going to change the coach between the playoff and the Super Bowl.?\nQuestions remain over GOP's ability to govern\nThroughout the retreat, House Republicans hammered home the point that they will be ready to govern if they recapture the majority this year.",
    "For one, while most members are unified around the message from conference leaders, House Republicans will still have to face potential pushback from a handful of outspoken members, like Greene, who's already shown a willingness to confront her own party.",
    "The primary focus of this year's retreat was to hash out key parts of McCarthy's Commitment to America? agenda  a nod to former House Speaker Newt Gingrich's (R-Ga.) Contract with America? that helped guide the GOP's campaign messaging in 1994.",
    "What's more, House GOP leaders made clear that far-right members like Reps. Marjorie Taylor Greene (R-Ga.) and Madison Cawthorn (R-N.C.), who recently called Ukrainian President Volodymyr Zelensky a thug,? did not speak for the conference.",
    "PONTE VEDRA BEACH, Fla.  House Republicans wrapped up their annual retreat in this coastal Florida resort town on Friday, capping off a three-day event in which they sought to project unity ahead of the 2022 midterm elections.",
    "Deepening the connection to 1994 was Gingrich himself, who addressed Republican lawmakers in a closed-door session at the retreat this week, during which he advised them to focus on policy and government accountability.",
    "McCarthy, meanwhile, projected confidence in his path to the Speakership should Republicans win control of the House this year, suggesting that he believes he won't face any serious challenge for the House's top job.",
    "Conference leaders rarely mentioned his name in their remarks to reporters, nor did they discuss issues like the 2020 presidential election or voter fraud  issues that have become central to Trump's political brand.",
    "We're going to pass legislation out of the House and send as much as we can to President Biden's desk, and we hope that he will work with us,? House Republican Conference Chairwoman Elise Stefanik (R-N.Y.) said.",
    "The rhetoric underscores just how deeply Trump's political brand has penetrated the GOP's rank and file, even as conference leaders look to rebrand  at least somewhat  in the run up to the midterm elections.",
    "The idea is to present a more policy-focused GOP for the midterms; a party less focused on the intraparty divisions and controversies of the past several years and more concerned with kitchen table? issues.",
    "Instead, Republican lawmakers worked to cobble together key parts of their proposed policy agenda in a bid to show voters that they will be ready to govern should they retake the House majority in November.",
    "Don't wait until that problem comes up  how do you pass appropriations bills, what do you do on the debt ceiling??\nThen there's the issue of working with a Democratic president for at least two years.",
    "Since then, members like Cheney and Rep. Adam Kinzinger (R-Ill.), who voted to impeach Trump in the wake of the Capitol riot, have largely been sidelined within the House Republican Conference.",
    "It was an about-face from last year's retreat, when fallout from the 2020 elections and the Jan. 6, 2021, riot at the U.S. Capitol exposed lingering divisions among Republicans.",
    "House Minority Leader Kevin McCarthy (R-Calif.) revealed that more than 100 House Republicans had signed on to host a fundraiser later this month for Rep. Liz Cheney's (R-Wyo.)",
    "House GOP closes ranks after 2021 infighting\nSince even before they kicked off their retreat on Wednesday, House Republican leaders sought to portray a unified GOP conference.",
    "If you're a minority leader the day of the election, you win, and you win the majority, you're probably going to be the Speaker,? McCarthy told Punchbowl News on Thursday.",
    "If you notice, we don't have many speakers here on purpose because we want the engagement from the members themselves coming up with this,? McCarthy told reporters.",
    "While members repeatedly said they were optimistic that they could find a way to work with President Biden, they haven't yet conveyed a clear strategy for doing so.",
    "At the same time, many Republican members in their first or second terms in the House haven't yet had the experience of serving in the majority.",
    "Instead, House Republicans hammered home the point that they will be prepared to govern when  and if  they recapture the majority in November.",
    "Members have lined up en masse behind Cheney's primary challenger, while Kinzinger is not seeking reelection this year.",
    "1, I wanted to have Newt.?\nIf we're successful and we win 18 seats, that's the same as the 1994 revolution,? he added.",
    "But his influence is still clear\nWhile Trump may have taken a back seat, his presence within the party was still felt.",
    "Likewise, House GOP leaders have made tackling woke? culture a key part of their budding policy agenda.",
    "The retreat was largely free of the divisions and infighting that characterized last year's meeting.",
    "Trump himself didn't attended the retreat, despite living just a few hours south in Palm Beach.",
    "You have challenges of certain things that are going to come up,? he told reporters on Friday.",
    "That could complicate more routine legislative tasks like avoiding government shutdowns.",
    "McCarthy himself leaned in to the comparisons to the Republican Revolution.",
    "But there's a few speakers we wanted to make sure we have, and No.",
    "Here are five takeaways from this year's House Republican retreat.",
    "But despite that optimism, they're still facing a few obstacles.",
    "McCarthy acknowledged some of those challenges on Friday.",
    "Trump-backed primary challenger, Harriet Hageman."
  ]
}