{
  "id": 2812,
  "mediaId": 675,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "No more taxpayer dollars to leftist politicians in Ukraine",
  "image": "https://www.wnd.com/wp-content/uploads/2019/10/Zelensky_screen_capture.jpg",
  "link": "https://www.wnd.com/?p=4999216",
  "mediaOutlet": "WND",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andy Schlafly",
  "authorUrl": "https://www.wnd.com/author/aschlafly/",
  "termIds": [
    1115,
    1147,
    1501,
    1801,
    2027,
    2087,
    2303,
    2942
  ],
  "sentences": [
    "The latest request by Ukrainian President Volodymyr Zelensky, who was elected after a 2014 leftist revolution there and supported by a media oligarch billionaire, is for $50 billion in new funding from the West and a personal visit by Joe Biden.",
    "She stunningly made the final runoff for the presidency of France, and cautions against pushing Russia into a closer alliance with Communist China, which already opposes the liberal cultural influence of Hollywood.",
    "A recent grim story about how smugglers, called \"coyotes,\" left a woman to die ensnared in rope while trying to climb over a border wall in Arizona demonstrates how ruthless the immigration smuggling operation is.",
    "But Zelensky is back, asking for more than three times that much this week in the form of grants or loan guarantees by the United States, with no end in sight for how much this will ultimately cost Americans.",
    "By sending weapons to Ukraine, Biden has wrongly put our country and Americans at risk of deadly retaliation by Russia, as Russian President Vladimir Putin recently warned could happen in unexpected ways.",
    "Not even the wealthiest man in the world, Elon Musk, can stop the censorship imposed by the liberals who control Twitter as its board of directors adopted a poison pill to thwart his takeover bid.",
    "China recently ordered a movie studio to delete pro-LGBTQ dialog from the children's animation \"Fantastic Beasts: Secrets of Dumbledore,\" and the studio dutifully pandered to the Communists.",
    "Many immigrants from Ukraine settled in Ohio, beginning around 1900, but most have assimilated into American culture as other waves of European immigrants from that period have done.",
    "A Marine veteran endorsed earlier by Sen. Josh Hawley, R-Mo., Vance campaigns on rejuvenating manufacturing in Ohio, which once had thriving automobile parts and steel industries.",
    "Vance is a conservative populist like several other candidates Trump has endorsed, and Trump proves again that he's not interested in backing only the leaders in polls.",
    "Both Reps. Madison Cawthorn, R-N.C., and Marjorie Taylor Greene, R-Ga., have been leaders in opposing Biden's senseless entanglement in the Russia-Ukraine war.",
    "Several congressmen, also in contested primaries, have been outspoken against giving leftist politicians in Ukraine a blank check at the expense of Americans.",
    "Vance stands in contrast with rival candidate Mike Gibbons, who declared last year that the middle class is somehow not paying its fair share of taxes.",
    "Once marginalized as \"far right,\" Marine Le Pen has skyrocketed in French popularity by urging against an escalation in hostilities with Russia.",
    "He appeared on the \"Today\" show Monday to declare that he wants the United States to accept 100,000 Ukrainian refugees, \"to start off with.\"",
    "That approach could lead to the United States taking in upwards of a million refugees, particularly if Dems think they will vote their way.",
    "Vance responded by saying that Republicans should defend \"middle-class people being able to raise a family and do it on a single income.\"",
    "This contrasts with how Disney today aggressively undermines American cultural norms, unlike the patriotism of its founder, Walt Disney.",
    "In an interview with Steve Bannon on Feb. 19, Vance stated, \"I think it's ridiculous that we're focused on this border in Ukraine.\"",
    "Vance, was just endorsed by President Trump for a pivotal open U.S. Senate seat in Ohio, which has its primary in a mere two weeks.",
    "Some Republican candidates for office in upcoming primary elections are not supporting this as entrenched politicians in D.C. are.",
    "Politics\nHealth\nDiversions\nMoney\nWorld\nMORE COMMENTARY\nDennis Prager\nLarry Tomczak\nRead all of today's COMMENTARY...\nNew Section",
    "Trump's endorsement of Vance was gutsy, as he trails in third place by a polling average of 7 points behind the front-runner.",
    "Vance fully supports Trump's platform to end the illegal immigration streaming over our southern border, and to build a wall.",
    "A crowded Republican group of many talented candidates compete for Portman's seat amid the worsening Russia-Ukraine war.",
    "Vance wants to break up Big Tech, which would help end the suffocating censorship that emanates from the Left Coast.",
    "It seems doubtful that there are many Republican primary voters who support Biden's mishandling of this conflict.",
    "Biden and Congress have already granted the liberal Ukrainian politicians 13.6 billion American dollars.",
    "Biden has entangled the United States in this conflict far worse than Congress ever authorized him to.",
    "Both are ravaged by the phony policies of free trade that have also devastated its neighboring states.",
    "Education\nCommentary\nJerry Newcombe\nAndy Schlafly\nJohn Stossel\nRead all of today's COMMENTARY...",
    "The anti-Trump candidate, state Sen. Matt Dolan, is polling in a distant fourth in this race.",
    "Poland has accepted more than 2.5 million Ukrainian refugees and seeks to relocate them.",
    "The White House responded \"no,\" but only to the part about Biden visiting.",
    "Vance, who has criticized Biden for spending so much time on Ukraine.",
    "Rob Portman, R-Ohio, is co-chair of the Senate Ukraine Caucus.",
    "Last Friday Trump enthusiastically endorsed J.D.",
    "One of the skeptics, J.D.",
    "The retiring Sen.",
    "Faith\nU.S."
  ]
}