{
  "id": 2818,
  "mediaId": 124,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Challenge to Rep. Marjorie Taylor Greene's re-election bid can proceed, judge rules",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220228-Marjorie-Taylor-Greene-al-0718-cfbdbd.jpg",
  "link": "https://www.nbcnews.com/politics/congress/challenge-rep-marjorie-taylor-greenes-re-election-can-proceed-judge-ru-rcna24958",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    713,
    2303,
    2358,
    2429,
    428,
    2672,
    2945,
    2959
  ],
  "sentences": [
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nTotenberg, an appointee of former President Barack Obama, wrote that after \"a thorough analysis of the evidentiary and legal issues presented in this complex matter involving unsettled questions of law, the court finds plaintiff has not carried her heavy burden to establish a strong likelihood of success on the legal merits in this case.\"",
    "Marjorie Taylor Greene hit with four new fines over anti-mask stance\nNov. 2, 202100:24\nGreene sought to derail the effort with her own lawsuit this month, saying she vigorously denies that she aided and engaged in insurrection to obstruct the peaceful transfer of presidential power.'?\nGreene also argued that the litigation would not be resolved in time for the primary election on May 24.",
    "\"It's rare for any conspirator, let alone a member of Congress, to publicly admit that the goals of their actions are preventing a peaceful transfer of power and the death of the president-elect and Speaker of the House, but that's exactly what Marjorie Taylor Greene did,? Free Speech For People's legal director, Ron Fein, said in a statement.",
    "Pointing to the 14th Amendment's prohibition on anyone who \"engaged in insurrection or rebellion\" from running for federal or state office, the suit alleges Greene is ineligible to run because she engaged in obstructing the transfer of presidential power, in part through her rhetoric challenging the election results.",
    "Free Speech for People, an election and campaign finance reform organization, filed the lawsuit last month on behalf of a group of the state's voters, alleging Greene facilitated the Jan. 6 attack on the Capitol.",
    "\"The Constitution disqualifies from public office any elected officials who aided the insurrection, and we look forward to asking Representative Greene about her involvement under oath.\"",
    "U.S. District Judge Amy Totenberg on Monday denied the Georgia Republican's request for a temporary restraining order and preliminary injunction to block the suit.",
    "WASHINGTON  A federal judge in Georgia is allowing a lawsuit challenging Rep. Marjorie Taylor Greene's qualifications to run for re-election to move forward.",
    "The group filed a similar challenge on behalf of voters against Rep. Madison Cawthorn, R-N.C, which a federal judge in that state blocked last month.",
    "The ruling will allow a state administrative judge to hear the challenge against Greene on Friday.",
    "Greene's office and her attorney did not immediately return requests for comment Tuesday.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories."
  ]
}