{
  "id": 2821,
  "mediaId": 34,
  "date": "4/19/2022 12:00:00 AM",
  "headline": "Judge Rules Effort to Bar Marjorie Taylor Greene From Office Over Jan. 6 Can Proceed",
  "image": "https://www.commondreams.org/sites/default/files/styles/social_share_image/public/2022-04/GettyImages-1237580156-greene.jpg?h=2ba5f71d&itok=8XpgM9y5",
  "link": "https://www.commondreams.org/news/2022/04/19/judge-rules-effort-bar-marjorie-taylor-greene-office-over-jan-6-can-proceed",
  "mediaOutlet": "Common Dreams",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jake Johnson",
  "authorUrl": "https://www.commondreams.org/author/jake-johnson",
  "termIds": [
    713,
    883,
    2087,
    2303,
    2429,
    545,
    554,
    2672
  ],
  "sentences": [
    "Ron Fein, the legal director of Free Speech for People, said Monday that \"it's rare for any conspirator, let alone a member of Congress, to publicly admit that the goals of their actions are preventing a peaceful transfer of power and the death of the president-elect and speaker of the House, but that's exactly what Marjorie Taylor Greene did.\"",
    "The group continued:\nSpecifically, the evidence shows that she either helped to plan the attack on January 6, or alternatively helped to plan the pre-attack demonstration and/or march on the Capitol with knowledge that it was substantially likely to lead to the attack, and otherwise voluntarily aided the insurrection.",
    "A federal judge ruled Monday that a lawsuit aiming to disqualify GOP Rep. Marjorie Taylor Greene from congressional office over her role in the January 6 Capitol insurrection can proceed, a decision that allows Georgia voters to challenge the Republican's reelection bid under the 14th Amendment.",
    "Free Speech for People went on to cite Greene's statement ahead of the formal certification of President Joe Biden's victory that \"you can't allow it to just transfer power 'peacefully' like Joe Biden wants and allow him to become our president because he did not win this election.\"",
    "Ratified in the wake of the Civil War, Section 3 of the 14th Amendment of the U.S. Constitution bars from public office any member of Congress who, after swearing to support the Constitution, engages in \"insurrection or rebellion\" or gives \"aid or comfort\" to insurrectionists.",
    "Free Speech for People, the organization representing a group of Georgia voters in the lawsuit, argued in a press release Monday that \"the publicly available evidence establishes that Greene helped facilitate the insurrection, before, during, and after January 6, 2021.\"",
    "\"The novelty of the factual and historical posture of this caseespecially when assessed in the context of a preliminary injunction motion reviewed on a fast trackhas made resolution of the complex legal issues at stake here particularly demanding.\"",
    "\"Everything I've read says Rep. Greene was involved in the Jan. 6th insurrection that was trying to override everything I believe inour Constitution, how we run elections, and how our government is set up,\" said Georgia voter Michael Rasbury.",
    "As the New York Times reported, \"the ruling angered lawyers in the case who argued that the 1872 law applied only to Civil War confederates, not any insurrectionist in the future, and that a law could not usurp a constitutional amendment.\"",
    "In the weeks leading up to January 6, Greene publicly stated that violence might be necessary to keep Trump in power, calling the date 'our 1776 moment' (a codeword used by violent extremists to refer to an attack on government buildings).",
    "Greene sought a preliminary injunction and temporary restraining order against the lawsuit, but Judge Amy Totenberg of the U.S. District Court for the Northern District of Georgiaan Obama appointeerejected the lawmaker's request.",
    "\"The Constitution disqualifies from public office any elected officials who aided the insurrection,\" Fein added, \"and we look forward to asking Representative Greene about her involvement under oath.\"",
    "\"The Constitution disqualifies from public office any elected officials who aided the insurrection, and we look forward to asking Representative Greene about her involvement under oath.\"",
    "Five voters in Georgia's 14th Congressional District, which Greene represents, are taking part in the legal effort to remove her from the ballot ahead of the midterm elections.",
    "The Atlanta judge's ruling came a month after a Trump-appointed judge dismissed a similar effort to disqualify Rep. Madison Cawthorn (R-N.C.) from running for reelection.",
    "Much of this evidence is in the public record and has been widely reported by numerous media outlets, including reports citing organizers of the pre-attack demonstration.",
    "U.S. District Judge Richard Myers ruled that the Amnesty Act of 1872 nullified the ban imposed by Section 3 of the 14th Amendment.",
    "\"This case involves a whirlpool of colliding constitutional interests of public import,\" Totenberg wrote in her 73-page order.",
    "They are doing everything they can to defend the status quo, squash dissent and protect the wealthy and the powerful.",
    "Thousands of small donations fund our newsroom and allow us to continue publishing.",
    "The section is known as the Insurrectionist Disqualification Clause.",
    "Georgia's primary contests are scheduled to take place on May 24.",
    "Our work is licensed under Creative Commons (CC BY-NC-ND 3.0).",
    "\"It's a crime punishable by death is what treason is.",
    "[House Speaker] Nancy Pelosi is guilty of treason.\"",
    "\"She should not be on the ballot,\" he added.",
    "\"He's guilty of treason,\" Greene continued.",
    "The Common Dreams media model is different.",
    "The 1% own and operate the corporate media.",
    "We cover the news that matters to the 99%.",
    "Feel free to republish and share widely.",
    "To ignite change for the common good.",
    "We can't do it without you.",
    "No selling of your data.",
    "With no advertising.",
    "Free to republish.",
    "Reader-supported.",
    "We've had enough.",
    "Can you chip in?",
    "Free to share.",
    "Free to read.",
    "Independent.",
    "No paywalls.",
    "Our mission?",
    "To inspire.",
    "To inform.",
    "Nonprofit.",
    "Thank you.",
    "How?"
  ]
}