{
  "id": 2822,
  "mediaId": 129,
  "date": "4/18/2022 12:00:00 AM",
  "headline": "Effort to Remove Marjorie Taylor Greene From Ballot Can Proceed, Judge Says",
  "image": "https://static01.nyt.com/images/2022/04/11/us/politics/00pol-mjt-greene/merlin_204564921_da7e9373-fa60-4803-90c2-4fbe4149b875-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/04/18/us/politics/marjorie-taylor-greene-jan-6.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2429,
    2429,
    2303,
    713,
    713,
    1147,
    1147,
    1997,
    1997,
    2303,
    1596,
    1596,
    1237,
    1237,
    1374,
    1374,
    545,
    545,
    428,
    296,
    296,
    428,
    427,
    427,
    2672,
    2826,
    2826,
    2672,
    2834,
    2834
  ],
  "sentences": [
    "This is fundamentally antidemocratic,? Mr. Bopp said, maintaining that Ms. Greene had publicly and vigorously condemned the attack on the Capitol.?\nHe called the effort to remove her from the ballot part of a well-funded nationwide effort to strip voters of their right to vote for candidates of their choice, with elections determined by bureaucrats, judges, lawyers and clever legal arguments.?\nIn her request for an injunction, Ms. Greene argued that it would be impossible to fully resolve the case before Georgia holds its primary elections on May 24.",
    "The novelty of the factual and historical posture of this case  especially when assessed in the context of a preliminary injunction motion reviewed on a fast track  has made resolution of the complex legal issues at stake here particularly demanding.?\nJames Bopp Jr., a lawyer for Ms. Greene, said on Monday night that the ruling was flawed and minimized the adverse effect that the disqualification effort was having on Ms. Greene's right to run for office.",
    "At the hearing on Friday, we look forward to questioning Greene under oath about her involvement in the events of Jan. 6, and to demonstrating how her facilitation of the insurrection disqualifies her from public office under the United States Constitution.?\nLast year, the House removed Ms. Greene from the Education and Budget Committees for endorsing the executions of Democrats and spreading dangerous and bigoted misinformation.",
    "That section says that no person shall? be a member of Congress or hold civil office if they had engaged in insurrection or rebellion after having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State.?\nCapitol Riot's Aftermath: Key Developments\nCard 1 of 3\nDebating a criminal referral.",
    "More than a year after they tried and failed to use Congress's final count of electoral votes on Jan. 6 to overturn the election, some Trump allies are pushing bogus legal theories about decertifying? the 2020 vote and continuing to fuel a false narrative that has resonated with Mr. Trump's supporters.",
    "The constitutional challenge to Ms. Greene's candidacy, filed last month with Georgia's secretary of state, argued that Ms. Greene had helped to plan the attack on the Capitol or knew that a demonstration organized by Mr. Trump and his supporters on the National Mall would escalate into violence.",
    "A federal judge cleared the way on Monday for a group of Georgia voters to move forward with legal efforts seeking to disqualify Representative Marjorie Taylor Greene from running for re-election to Congress, citing her role in the Jan. 6, 2021, attack on the Capitol.",
    "Pat A. Cipollone and Patrick F. Philbi, two of Mr. Trump's top White House lawyers, met with the Jan. 6 House committee, while Ali Alexander, a prominent organizer of pro-Trump events after the 2020 election, said he would assist in the federal investigation.",
    "Judge Totenberg's well-reasoned opinion explains why the Georgia voters who filed this challenge against Greene have the right to have their challenge heard, and why none of Greene's objections to the Georgia state challenge have any merit,? Mr. Fein said.",
    "Ms. Greene had tweeted falsehoods about extremely high amounts of Covid vaccine deaths.?\nMore recently, Ms. Greene filed a threat report with the Capitol Police after the late-night television show host and comedian Jimmy Kimmel mocked her in a monologue.",
    "The judge, Amy Totenberg, who was appointed to the U.S. District Court for the Northern District of Georgia by President Barack Obama, denied Ms. Greene's request for a preliminary injunction and temporary restraining order in the high-profile legal feud.",
    "In blocking that disqualification effort, U.S. District Judge Richard E. Myers II, an appointee of Mr. Trump, ruled that the 14th Amendment of the Constitution narrowly applied to members of the Confederacy after the Civil War.",
    "The group pursuing the case is represented by Free Speech for People, a nonpartisan, nonprofit legal advocacy organization with constitutional law expertise, which was also involved in the case involving Mr. Cawthorn.",
    "The Jan. 6 House committee has grown divided over whether to make a criminal referral of former President Donald J. Trump to the Justice Department, even though it has concluded that it has enough evidence to do so.",
    "When Mr. Kimmel mentioned Ms. Greene's barbs toward three Republican senators who voted to confirm Judge Ketanji Brown Jackson to the Supreme Court, he said, Wow, where is Will Smith when you really need him??",
    "Ms. Greene, 47, who is known for her unflinching loyalty to former President Donald J. Trump and for her clashes with Democrats, has steadfastly denied that she aided and engaged in the attack on the Capitol.",
    "Ms. Greene's critics have said that she frequently referred to efforts to challenge the 2020 presidential election results as our 1776 moment? in public comments that led up to the riot at the Capitol.",
    "In the 73-page ruling, Judge Totenberg wrote that Ms. Greene had failed to meet the burden of persuasion? in her request for injunctive relief, which she called an extraordinary and drastic remedy.",
    "In the ruling, Judge Totenberg determined that Ms. Greene had failed to prove that there was a strong likelihood that she would prevail on the merits of her legal claims.",
    "They contend that the phrase was a code used to incite violence, and point to the third section of the 14th Amendment in their argument to drop her from the ballot.",
    "The decision by Judge Totenberg stood in stark contrast with a recent ruling in a similar case involving Representative Madison Cawthorn in North Carolina.",
    "It mirrors several other cases involving Republican members of Congress, whose roles leading up to and during the deadly riot have drawn intense criticism.",
    "The disqualification effort is based on a constitutional provision adopted after the Civil War that barred members of the Confederacy from holding office.",
    "In January, Twitter permanently suspended Ms. Greene's personal account after the company said she had violated its Covid-19 misinformation policies.",
    "The move  supported by the majority of Democrats and opposed nearly unanimously by Republicans  diminished Ms. Greene's influence in the chamber.",
    "Ron Fein, the legal director for Free Speech for People, heralded the ruling on Monday night in an email to The New York Times.",
    "The debate centers on whether a referral would backfire by politically tainting the expanding federal investigation.",
    "This case involves a whirlpool of colliding constitutional interests of public import,? Judge Totenberg wrote.",
    "Absentee ballots will start to be mailed on April 25, Ms. Greene's motion said.",
    "A state administrative judge is scheduled to hear the case on Friday.",
    "Cooperating with investigators.",
    "Continuing election doubts."
  ]
}