{
  "id": 2824,
  "mediaId": 237,
  "date": "4/16/2022 12:00:00 AM",
  "headline": "Madison Cawthorn spent taxpayer funds at luxury resort",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/1bdbb84/2147483647/strip/true/crop/1024x538+0+73/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F4a%2Ffa%2F69136e714455a12bce0c1075ea1c%2Fap22100069676695.jpg",
  "link": "https://www.washingtonexaminer.com/news/house/madison-cawthorn-spent-taxpayer-funds-at-luxury-resort",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Andrew Kerr",
  "authorUrl": "",
  "termIds": [
    2303,
    2341,
    2341,
    2303,
    2226,
    2226,
    428,
    183,
    183,
    428,
    545,
    545,
    613,
    613,
    2697,
    2697,
    2834,
    2834
  ],
  "sentences": [
    "That same week, from Aug. 6-10, Cawthorn billed taxpayers $556 for four separate trips to Fresh Market and Ingles grocery stores, $491 for a trip to Papa's and Beer Mexican Restaurant, two visits to Chick-fil-A totaling $382, a meal at Joey's NY Bagels for $53, a trip to Bojangles for $47, and two undescribed payments totaling $455 to his Citibank government card service.",
    "North Carolina Republican Sen. Thom Tillis made the rare move of publicly endorsing Cawthorn's primary opponent, state Sen. Chuck Edwards, saying in a statement that Cawthorn has \"fallen well short of the most basic standards Western North Carolina expects from their representatives.\"",
    "Lawmakers are allowed to use their allowance to pay for up to two legislative planning sessions in their home states each year with their staff, but the funds cannot be used to finance any events that are \"primarily social in nature,\" according to the House Committee on Ethics.",
    "Cawthorn spent $2,950 from his taxpayer-funded members representational allowance at Skylaranna, a resort based in his hometown of Hendersonville, North Carolina, that boasts luxury accommodations for romantic dinners, weddings, and corporate events.",
    "\"NC-11 is sick and tired of our hard-earned tax dollars being spent on these trillion-dollar socialist monstrosities,\" he tweeted on Aug. 8, just one day before he billed taxpayers for his visit to the luxury mountain resort.",
    "Cawthorn sparked fury among his GOP colleagues in March for calling Ukrainian President Volodymyr Zelensky a \"thug\" and for baselessly alleging on a podcast that unnamed politicians have invited him to cocaine-fueled orgies.",
    "Every member of the House received a taxpayer-funded allowance averaging $1.5 million in 2021 to pay for staff, rent offices in their districts, and any other expenses necessary to carry out their duties as lawmakers.",
    "Just In...\nTaxpayers footed the bill for Rep. Madison Cawthorn's visit to a luxury riverside mountain resort in August 2021, according to House disbursement records reviewed by the Washington Examiner.",
    "Cawthorn's comments earned him a scolding from Minority Leader Kevin McCarthy and House Minority Whip Steve Scalise, who told the firebrand during a closed-door meeting to \"straighten his life out.\"",
    "Only one representative spent more than Cawthorn for legislative planning events in 2021: Republican Rep. Kay Granger of Texas, who reported spending $6,000 for legislative planning that year.",
    "Richard Burr, North Carolina's senior Republican senator, said Cawthorn has \"been an embarrassment at times\" to the GOP but declined to endorse any candidates in the primary.",
    "The freshman lawmaker's campaign spent more than it raised in the first quarter of 2022 and entered April with just $242,000 cash on hand and debts of $127,000.",
    "\"Democratic politicians certainly love wasting your hard-earned tax dollars while forcing your businesses to shut down,\" Cawthorn tweeted on Aug. 6.",
    "Also between Aug. 6 and 10, the firebrand conservative issued multiple tweets railing against Democrats in Congress for wasting taxpayer funds.",
    "Nearly every office on Capitol Hill has a district retreat and a budget specifically designated for one,\" Ball told the Washington Examiner.",
    "The freshman Republican lawmaker categorized his Aug. 9 payment to the luxury resort as a \"legislative planning food and beverage\" expense.",
    "Cawthorn's reelection campaign is hemorrhaging money, according to a filing submitted to the Federal Election Commission on Friday.",
    "The 149 representatives that did pull from their allowance to pay for legislative planning expenses spent $1,170 on average.",
    "A representative for Skylaranna told the Washington Examiner the resort cannot disclose any information about its guests.",
    "About 286 representatives reported spending $0 for legislative planning events in 2021, House disbursement records show.",
    "\"Our district retreat occurred on those dates; those expenses were for the district and D.C. staff on the retreat.",
    "Cawthorn can secure renomination for a second term in the House if he wins 30% of the vote in his May 17 primary.",
    "In total, Cawthorn spent just shy of $5,000 from his allowance for the Aug. 6-10 legislative planning event.",
    "The 26-year-old lawmaker classified all the payments as \"legislative planning food and beverage\" expenses.",
    "Cawthorn's legislative planning expenses far exceeded what the average member of the House spent in 2021.",
    "Cawthorn spokesman Luke Ball said the lawmaker's district retreat took place from Aug. 6 - 10.",
    "Any unused funds are eventually returned to the Treasury.",
    "\"They're OUR dollars, not the socialists.\""
  ]
}