{
  "id": 2825,
  "mediaId": 43,
  "date": "4/16/2022 12:00:00 AM",
  "headline": "WANNABE KINGMAKER Donald Trump's Latest Endorsement Reveals His Big Fat Flaming Ego",
  "image": "https://images.dailykos.com/images/610713/story_image/trump-dictator.jpg?1541964561",
  "link": "https://www.dailykos.com/story/2022/4/16/2092387/-WANNABE-KINGMAKER-Donald-Trump-s-Latest-Endorsement-Reveals-His-Big-Fat-Flaming-Ego",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    683,
    781,
    1110,
    1147,
    1448,
    1538,
    1692,
    1801,
    2087,
    2303,
    2845
  ],
  "sentences": [
    "Such as his recent declaration on Steve Bannon's \"War Room\" where he said that I gotta be honest with you, I don't really care what happens to Ukraine one way or the other.?\nx\nOhio Senate candidate JD Vance in February: I gotta be honest with you, I don't really care what happens to Ukraine one way or the other.? #ohsen #ohleg\n pic.twitter.com/SpdqQKjKmJ\n Shannon Watts (@shannonrwatts) April 15, 2022\nWhich makes this a good time to remind people that Vance, or whoever the GOP nominee is, has a Democratic opponent, Tim Ryan, who can use your help.",
    "Rob Portman (OH), Rep. Elise Stefanik (NY), Kellyanne Conway\nVance himself has already been endorsed by the QAnon brain trust: Sen. Josh Hawley (MO), Rep. Marjorie Taylor Greene (GA), Rep. Matt Gaetz (FL), Sebastian Gorka, Tucker Carlson (Fox News), and Donald Trump Jr.\nWhat's more, Vance fulfills another Trump prerequisite by being a TV celebrity whose platform is wafer thin.",
    "Among them...\nJosh Mandel: Endorsed by Michael Flynn, Sen. Ted Cruz (TX), Sen. Mike Lee (UT), Rep. Madison Cawthorn (NC), Jenna Ellis (Trump Lawyer), Mark Levin (Fox News)\nJane Timken: Endorsed by Kristi Noem (governor of South Dakota), Sen. Shelley Moore Capito (WV), Sen Joni Ernst (IA), Sen. Deb Fischer (NE), Sen.",
    "For the most part he's done that by whining about having lost to Joe Biden, someone he characterized as a \"mentally deficient socialist\"; relentlessly lying about the election being rigged; and holding cult rallies populated by his glassy-eyed disciples.",
    "According to Trump, here's why...\n\"This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race  they've said great things about Trump' and, like me, they love Ohio and love our country.\"",
    "Click here to Tweet this article\nAnother dull tool in Trump's shed is his ability to hand out cheap endorsements for Republican candidates who adoringly kiss his ... let's say ring.",
    "I never liked him [...] As somebody who doesn't like Trump, I might have to hold my nose and vote for Hillary Clinton [...] I didn't vote for Trump because I can't stomach Trump.",
    "Since being evicted from the White House by the American people fourteen months ago, Donald Trump has desperately struggled (and failed) to maintain some sort of relevance.",
    "Rush a donation now: https://t.co/qzkuU333fM\n Tim Ryan (@TimRyan) April 15, 2022\nNOTE: Twitter suspended the News Corpse account after 11 years without giving a reason.",
    "The endorsements are all nearly identical pronouncements that the candidate loves guns, hates immigrants, and is devoted to his anti-American \"America First\" agenda.",
    "So Trump is affirming that the primary requirement for earning a Trump endorsement is that the candidates say \"great things about Trump' and, like me.\"",
    "And his statement outlining why he chose to back this particular candidate in a crowded Republican primary says more about Trump than Vance.",
    "Trump's endorsement of Vance included a swipe at Ryan calling him a \"defective candidate\" who is somehow both \"weak\" and \"dangerous.\"",
    "The field of GOP senate candidates in Ohio is a buzzing hive of Trump-fluffers, all vying for his notoriously short attention span.",
    "Meanwhile he won't donate any of the millions of dollars he has collected from his gullible followers to help those candidates.",
    "x\nx\nx\nThe ad goes on to display tweets that Vance has since deleted saying that Trump is \"reprehensible,\" and \"an idiot.\"",
    "Vance may have said some not so great things about me in the past, but he gets it now, and I have seen that in spades.\"",
    "That won't surprise anyone with even the slightest familiarity with Trump and his malignant narcissism.",
    "What Vance said was compiled nicely in an anti-Vance ad in 2021 by the conservative \"Club for Growth.\"",
    "So if anyone wants to tweet articles from my website, please feel free to do so often and repeatedly.",
    "This week Trump announced in a tweet (of course) that he is endorsing \"Hillbilly Elegy\" author, J.D.",
    "We can win this race and flip Ohio blue, but only if we have the resources to fight back.",
    "Trump is being gentle when saying that Vance said \"some not so great things\" about him.",
    "But we're expecting this endorsement to bring a new wave of outside money and attacks.",
    "It is easy, however, to see why he might have had trouble settling on Vance.",
    "I think that he's noxious [...] Him being really outrageous and offensive.\"",
    "Be sure to visit and follow News Corpse\n on Facebook and Instagram.",
    "For instance, Trump said that...\n\"Like some others, J.D.",
    "The ad merely reported Vance's own words about Trump.",
    "He does this frequently because it costs him nothing.",
    "x\nWe're beating JD Vance in the polls by one point.",
    "And check out my books on Amazon:\nFox Nation vs.",
    "As usual, to Trump everything is about Trump.",
    "That is, when it isn't downright repulsive.",
    "Reality:\n The Fox News Cult of Ignorance.",
    "And yet, Trump is now endorsing Vance.",
    "Such as...\nI'm a Never Trump guy.",
    "Thanks so much for your support.",
    "Vance, for the Senate in Ohio."
  ]
}