{
  "id": 2834,
  "mediaId": 43,
  "date": "4/13/2022 12:00:00 AM",
  "headline": "Cheers and Jeers: Wednesday",
  "image": "https://images.dailykos.com/images/1016107/story_image/CheersandJeerssharpedgelogo.jpg?1639234149",
  "link": "https://www.dailykos.com/story/2022/4/13/2091400/-Cheers-and-Jeers-Wednesday",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bill",
  "authorUrl": "/users/bill in portland maine",
  "termIds": [
    2345,
    2345,
    1094,
    1094,
    1594,
    1594,
    1653,
    1653,
    1785,
    1785,
    76,
    76,
    2710,
    2772,
    2772,
    2710,
    2888,
    2888
  ],
  "sentences": [
    "Days 'til Arbor Day: 11\nDays 'til 420 Day: 7\nPercent of Americans polled by ABC News/Ipsos who mostly blame Putin and/or oil companies for price hikes at the pump: 70%\nPercent chance that Russia just defaulted on its foreign debt, according to Standard & Poors: 100%\nNumber of K-Mart stores that'll be left (down from over 2,000) when the one in Avenel, NJ closes this week: 3\nRank of Atlanta, Dallas-Fort Worth, and Denver on the latest list of busiest airports in the world: #1, #2, #3\nYear Baskin-Robbins, which saw an 11% spike in ice cream sales last year, was founded: 1945\n-\nMid-week Rapture Index: 187 (including 5 \"Liberalisms\" and 2 days 'til the Big Event).",
    "It's perfectly normal to be in favor of fire departments.?\nLibrarians, not famous for their physical strength or their powerful political connections or their great wealth, who, all over this country, have staunchly resisted anti-democratic bullies who have tried to remove certain books from their shelves and have refused to reveal to thought police the names of persons who have checked out the titles.?\nThose who believe in telekinetics, raise my hand.?\n\"As for preparing this country against an attack from anti-missile anti-missile anti-missiles.",
    "Cormac O'Brien's book Secret Lives of the U.S. Presidents sums up the \"Sage of Monticello\" rather well (although we're quick to do a facepalm over his ownership and treatment of slaves which was, shall we say, deplorable):\nThomas Jefferson was the walking, talking embodiment of the Enlightenment, a polymath whose list of achievements is as long as it is incredibly varied.",
    "A good time to remind ourselves below the fold why he waswellKurt Vonnegut:\nContinued...\nThe big trouble with dumb bastards is that they are too dumb to believe there is such a thing as being smart.?\nBeing a Humanist means trying to behave decently without expectation of rewards or punishment after you are dead.?\n Kurt made the world safe for bed heads everywhere.",
    "Madison Cawthorn is in trouble because \"11th-District voters say Cawthorn should be disqualified from running for office again because he violated Section 3 of the U.S. Constitution's 14th Amendment  [which] prohibits a government official from running if they previously swore an oath to the Constitution and subsequently engaged in an insurrection.\"",
    "Last week we highlighted for-profit weather forecasting company AccuWeather's Atlantic hurricane season predictions: 16-20 named storms5 sponsored by Nabisco, 6 sponsored by Nike, and 9 sponsored by various drugs you should ask your doctor if they're right for you because YES, YES, YES THEY ARE HERE TAKE A FISTFUL AND COME BACK FOR MORE!!!",
    "52 years ago this week, en route to the moon, Apollo 13 commander Tom Hanks Jim Lovell Are you sure it was Jim Lovell and not Tom Hanks, I think it was Tom Hanks Jim Lovell announced, \"Houston, we've got a problem\" after Richard Nixon used his Sith powers to cause an oxygen tank to explode.",
    "As if penning the Declaration of Independence, sitting as governor of Virginia during the Revolution, and serving as Secretary of State in George Washington's first term weren't enough, he went on to do much morearchitecture, linguistics, agriculture, philosophy, music, prose, you name it.",
    "Jefferson was an avowed abolitionist whose fortune relied on a large population of slaves, a forward-thinking humanist whose opinions on minorities such as Native Americans could be truly alarming; a man whose awkwardness around women stood in stark contrast to his legendary romances.",
    "To that end\nMarjorie Taylor Greene is in trouble because \"A federal judge seems likely to rule that a lawsuit seeking to bar conspiracy theory-pushing Rep. Marjorie Taylor Greene, R-Ga., from running for re-election [because of her aid to the Jan. 6 insurrection] can go forward.\"",
    "And Dr. Oz is in trouble because when the previous Republican presidentaka Captain Insurrectionendorsed him, the MAGA cult exploded in outrage because they think he's Oprah in a rubber Dr. Oz suit and not, as some believe, JFK Jr. in a rubber Dr. Oz suit.",
    "But more important, check to see if your name is on the 2022 storm list:\nAlex, Bonnie, Colin, Danielle, Earl, Fiona, Gaston, Hermine, Ian, Julia, Karl, Lisa, Martin, Nicole, Owen, Paula, Richard, Shary, Tobias, Virginie, and Walter.",
    "A survey by the financial data group FactSet had predicted that the inflation reading for March would come in at 8.4 percent year-over-yearthe highest rate since December 1981 and an increase from February's 7.9 percent.",
    "By developing an anti-missile anti-missile anti-missile anti-missile, I may be in the minority, but I think the American people should spend the money on hospitals and housing and schools and Ferris wheels instead.\"",
    "I'm under no illusions that these hiccups will go anywhere, but it's still nice to see citizens who love their country press the case that those trying to tear it down should be kept from being leaders in it.",
    "-\nToday's Shameless C&J Testimonial\n\"At the U.S. Department of Justice, we will be tireless in our efforts to put an end to the plague of Cheers and Jeers and save the sanity of those we love.\"",
    "Attorney General Merrick Garland\n-\n Poll\n 369 votes Show Results\n Do you support the growing movement in the Republican party, led by Sen. Rick Scott, to impose severe tax hikes on poor people?",
    "Holy shit:\nU.S. inflation data hit a multidecade high last month amid surging gas prices and skyrocketing rents, climbing to 8.5 percent, the Bureau of Labor Statistics reported Tuesday.",
    "With a blend of vernacular writing, science fiction, jokes and philosophy, he also wrote about the banalities of consumer culture, for example, or the destruction of the environment.",
    "Wednesday Morning Vonnegut Blogging\nIndiana-born Kurt Vonnegut, who balanced his time between this universe and the alternate ones of his creation, died 15 years ago this week.",
    "And my favorite, which remains my personal motto for the 57th consecutive year:\nI tell you, we are here on Earth to fart around, and don't let anybody tell you different.",
    "Wrote Dinitia Smith in her New York Times obituary:\nLike Mark Twain, Mr. Vonnegut used humor to tackle the basic questions of human existence: Why are we in this world?",
    "After promising that it would only be a blip on the economic radar, it's now poised to do to Democrats in November what Ukraine is now doing to Russia's tank convoys.",
    "What kind of asshole feels such animosity and suspicion of someone that they would disregard that order, stalk a kid, and get in a scuffle that results in a homicide?",
    "If you ring our doorbell tonight, I'll treat ya to a free reenactment with a bonus spritz of Cheez Whiz..\n-\nBRIEF SANITY BREAK\n-\nx\nMaster of visual effects!",
    "He left behind a vast collection of essays and correspondence, which reveal a mind of stunning complexity and apparent contradictions.",
    "(Remember kids: no biting, kicking, or stuffing other children in trash binsand that goes for you, too, not just your parents.)",
    "Do you support the growing movement in the Republican party, led by Sen. Rick Scott, to impose severe tax hikes on poor people?",
    "They're predicting a more active year than last year: 19 named storms (up from 17 in 2021) and 9 hurricanes...4 of them major.",
    "Is there a presiding figure to make sense of all this, a god who in the end, despite making people suffer, wishes them well?",
    "Now, with just 49 days to go, the meteorological elves at Colorado State University are out with their 2022 forecast (pdf).",
    "Jefferson, by the way, was also \"fond of greeting ambassadors in his pajamasa practice that most of them found appalling.\"",
    "The souvenir wooden Easter Egg Roll eggs that I've collected since I was knee-high to a grasshopper are effing SOLD OUT.",
    "This year the child who finds the golden egg wins the most coveted prize in all the land: a tank of gas at 2020 prices.",
    "The good earthwe could have saved it, but we were too damn cheap and lazy.?\nIt's perfectly ordinary to be a socialist.",
    "g?ggpic.twitter.com/7UZNdj8dYl\n Figen (@TheFigen) April 10, 2022\n-\nEND BRIEF SANITY BREAK\n-\nCHEERS to happy endings.",
    "Two months before the Oscar for best actor and actress went to Henry Fonda and Katherine Hepburn for On Golden Pond.",
    "And now, our feature presentation...\n-\nCheers and Jeers for Wednesday, April 13, 2022\nNote: Please don't say \"gay.\"",
    "I'm sure they'll devote whatever time and resources they need to bully their way out of their respective jams.",
    "And for the first time since the Trump Plague enveloped the land, the White House Easter Egg Roll is back on.",
    "I have come up with a solution that takes advantage of EXCLUSIVE CHEERS AND JEERS CUTTING EDGE TECHNOLOGY.",
    "I guess we'll find out when Zimmerman goes before a jury of his peers on charges of second-degree murder.",
    "Believe it or not, I looked it up and this effing thing is the root cause of all the inflation right now.",
    "Through sheer brilliance on the part of NASA's team and the crew, they returned safely four days later.",
    "Don't forget: if a hurricane with your name on it causes any damage, it's up to you to pay for it.",
    "(But, of course, already available via the vultures on eBay for five times the original price.)",
    "Soul Protection Factor 16 lotion is recommended if you'll be walking amongst the heathen today.",
    "You got yourself a set of collector's eggs worth a cool $250,000 on the crypto market.",
    "But when I label it a \"Non Fungible Token\" and you print it out for your very own?",
    "(They begged him to buy Geico exploding-oxygen-tank insurance, but did he listen?",
    "Only 709 monthly payments to go and Jim Lovell will have paid for the damage.",
    "Don't blame me, I don't make the rules, I just[pats baseball bat]enforce em.",
    "[Nancy Grace cartwheels past Bill in Portland Maine, shouting \"Wheeee!!!!\"]",
    "-\nTen years ago in C&J: April 13, 2012\nCHEERS to getting his day in court.",
    "Happy 279th birthday to founding father and President #3 Thomas Jefferson.",
    "-\nAnd just one more\nCHEERS and JEERS to hippity-hoppin' back to normalcy.",
    "Also: she apparently has a strong primary challenger and is a' scared.",
    "Cheers and Jeers is a weekday post from the great state of Maine.",
    "-\nPuppy Pic of the Day: That's the spot...\n-\nJEERS to inflation.",
    "Floor's open...What are you cheering and jeering about today?",
    "Here's a pic of this year's eggs:\nWorthless on its own, yes.",
    "Yell it through a bullhorn like a proper lady or gentleman.",
    "Lauren Boebert is in trouble because she's Lauren Boebert.",
    "Yes\n No\n Hell no\n Not sure/No opinion\n 369 votes Vote Now!",
    "That's what I keep asking myself: What was he thinking???",
    "A \"successful failure\" is what they called that mission.",
    "1%\n4 votes\nHell no\n 95%\n352 votes\nNot sure/No opinion\n .",
    "George Zimmerman was told by police to stay in his van.",
    "And as soon I find out what it is, I'll let you know.",
    "[]\nNot all Mr. Vonnegut's themes were metaphysical.",
    "Or as it's also known: \"a typical day at Fox News.\"",
    "It's the most Paaserrific time of the yearEaster!",
    "Noooo...)\nCHEERS to the calm before the storms.",
    "Gee, I hope this doesn't turn into a circus.",
    "I mean, it's not like they work or anything.",
    "While others dabbled, Jefferson mastered.",
    "But there is a bright side to all this.",
    "Gone within hours of going on sale.",
    "But you know what sucks this year?",
    "CHEERS to trouble in Gooper Land.",
    "-\nBy the Numbers:\n 7 days.",
    "Thank you and good night!",
    "They're taking it well.",
    "Pay your respects here.",
    "Ah yes, December 1981.",
    "Have a happy humpday.",
    "Sawdust in the wind.",
    "And that's no yolk!",
    "3%\n10 votes\nNo\n .",
    "Nice digs, Tom.",
    "CHEERS to #3.",
    "But fear not.",
    "Look it up!)",
    "So it goes.",
    "Thank you.",
    "1%\n3 votes",
    "(Did too!",
    "Yes\n .",
    "Poof.",
    "P.S.",
    "U.S."
  ]
}