{
  "id": 2840,
  "mediaId": 233,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Who is Josh Mandel? What to know about the ex-Ohio state treasurer in his third senate run",
  "image": "https://www.gannett-cdn.com/-mm-/08a3b98d279006f8dac6506aa588b469bcb2b01d/c=0-172-3300-2028/local/-/media/2019/11/14/USATODAY/usatsports/B9338462836Z.1_20191114044247_000_GJJPLUB3S.2-0.jpg?width=3200&height=1800&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.usatoday.com/story/news/politics/2022/04/12/who-is-josh-mandel-ohio-gop/9513252002/",
  "mediaOutlet": "USA Today",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Orlando Mayorquin",
  "authorUrl": "https://www.usatoday.com/staff/6610183001/orlando-mayorquin/",
  "termIds": [
    689,
    781,
    946,
    1147,
    1710,
    2303,
    2466,
    571,
    2614,
    2845
  ],
  "sentences": [
    "Part of his campaign promise echoes Trump's 2016 calls to drain the swamp.? Mandel has decried establishment? Republicans who he said he would take on as much as the radical left.?\nHe recently said, for example, that Utah Sen. Mitt Romney should be eradicated from the Republican Party? after he supported Biden's Supreme Court justice nominee Ketanji Brown Jackson.",
    "Mandel's campaign lays out 10 issues, but front and center on the campaign's website are Pro-God,? Pro-Gun,? and Pro-Trump.?\nHe joins the chorus of GOP midterm contenders parroting the Trump America First? agenda, which takes a hardline approach to immigration and international trade policy.",
    "The northeast , Ohio, native, who scored the endorsement of Texas Sen. Ted Cruz, takes on a field of candidates that includes businessman Mike Gibbons, ex-Ohio GOP chair Jane Timken, venture capitalist JD Vance and others in the Republican primary on May 3.\nWho is Josh Mandel?",
    "He said he does not believe in the separation of church and state and promised to protect the Judeo-Christian bedrock of America.? Mandel has said on the campaign trail that no issue is more important than stopping abortion.",
    "The senate hopeful has been a loud proponent of cryptocurrencies (as Ohio treasurer, he allowed taxpayers to pay their taxes in Bitcoin) and backed efforts to eliminate critical race theory? from school curriculums.",
    "Like many in GOP midterm races, he is styling himself as the \"Trump\" candidate\nFormer Ohio Treasurer Josh Mandel is among the candidates running in the wide-open Republican race for Senate in Ohio.",
    "Like several of the candidates in the GOP contest, he is banking on winning the vote of former President Donald Trump's supporters by touting himself as the former president's strongest advocate.",
    "They join Trump's former National Security Adviser Michael Flynn and Colorado attorney Jenna Ellis, who led Trump's legal effort to overturn the 2020 election.",
    "But his first and most successful run for the national seat came in 2012, when he won the Republican nomination and lost in the general election to Brown.",
    "He held in his early days a reputation as a moderate Republican who championed bi-partisanship, The New York Times reported.",
    "They penned a letter published in a local news outlet denouncing Mandel for his stance against same-sex marriage equality.",
    "He was elected to the Lyndhurst City Council before he was called up for deployment in Iraq, where he served two tours.",
    "Mandel graduated with a bachelor's degree in 2000 from Ohio State University, where he headed the student government.",
    "A few GOP congress members have thrown their support behind Mandel, the most prominent endorsement coming from Cruz.",
    "That is when he was elected state treasurer, a position he would keep until he launched his failed 2018 Senate bid.",
    "He has loudly pronounced on the campaign trail the false claim that the 2020 election was stolen from Trump.",
    "He already has run two unsuccessful campaigns for U.S. Senate, most recently withdrawing from the 2018 race.",
    "North Carolina Rep. Madison Cawthorn, Utah Sen. Mike Lee and Wyoming Sen. Cynthia Lummis are backing Mandel.",
    "The political friction between Mandel and his former in-laws was well-publicized during his 2012 senate run.",
    "But he drifted further right with the emergence of the Tea Party movement and then the election of Trump.",
    "Mandel graduated in 1996 from Beachwood High School, where he played quarterback on the football team.",
    "Mandel has been a fixture in Ohio politics for years, but he hasn't held elected office since 2019.",
    "He received a law degree from Case Western Reserve University's School of Law in Cleveland in 2003.",
    ":What to know about the Democratic congressman running for senate in Ohio\nHow old is Josh Mandel?",
    "Former Rep. Jim Renacci, now a Republican candidate for Ohio governor, ran in Mandel's place.",
    "But Mandel, more than other candidates, has made religion a central tenet of his campaign.",
    "His dad, Bruce Mandel, is an attorney and active member of the local Jewish Federation.",
    "He had been state treasurer just over a year before he launched his first senate bid.",
    "In his time out of office, he served on several corporate boards and joined startups.",
    "In 2006, a 29-year-old Mandel ascended to the Ohio House, where he served until 2010.",
    "Much has been written in the press over the years about Mandel's political ambition.",
    "Mandel is the former treasurer of Ohio\nThe 44-year-old is in his third senate run.",
    "Shafran belongs to a prominent Ohio family that made their wealth in real estate.",
    "Mandel was raised in Beachwood, a majority Jewish community outside Cleveland.",
    "The former U.S. Marine is making his third run for the seat.",
    "Mandel has three children with his ex-wife Ilana Shafran.",
    "They divorced in 2020 after nearly 12 years of marriage.",
    "He lost to incumbent Sen. Sherrod Brown, a Democrat.",
    "Mandel first entered public office in 2003.",
    "Mandel was born on September 27,1977.",
    "Where did Josh Mandel go to school?",
    "What is Josh Mandel's platform?",
    "Who has endorsed Josh Mandel?",
    "Where is Josh Mandel from?",
    "Is Josh Mandel married?",
    "He is 44 years old.",
    "Who is Tim Ryan?"
  ]
}