{
  "id": 2842,
  "mediaId": 43,
  "date": "4/12/2022 12:00:00 AM",
  "headline": "Trump's North Carolina \"rally\" on Saturday was a total bust. Here's why.",
  "image": "https://images.dailykos.com/images/1058193/story_image/rally.jpeg?1649699013",
  "link": "https://www.dailykos.com/story/2022/4/12/2091371/-Trump-s-North-Carolina-rally-on-Saturday-was-a-total-bust-Here-s-why",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    1147,
    1147,
    1404,
    1404,
    2303,
    2729,
    2729,
    2835,
    2835,
    2834,
    2834,
    2876,
    2876,
    2903,
    2903
  ],
  "sentences": [
    "The major media outlets proceeded to covered a medium-sized political rally in Johnston County with wall-to-wall live coverage approximating that of September 11th:\nThe next morning, literally every story on the Raleigh News & Observer's website was about the Trump rally:\nThough reporters did fact-check? Trump's speech (which was, as usual, chock-full of gibberish), they also provided him (as well as Tedd Budd, Madison Cawthorn, Bo Hines, Dan Bishop and a litany of fellow travelers) a bonanza of free advertising.",
    "The Media's Coverage Was an Embarrassment\nThe North Carolina media has hyped the Selma rally with constant coverage for over two weeks, treating Trump's upcoming political rally as news.? Most have helpfully directed their readers to how to find tickets to the event in a manner suggesting more of a copy-and-paste of organizers' press releases than anything else.",
    "In an eerie parallel to a similar conversation the former president would have with Georgia state officials after losing the 2020 election, Trump called up the head of the National Park Service and demanded he find new photos supporting Trump's own crowd estimate.",
    "The paltry size of Saturday's rally seems particularly odd given its intensive, statewide marketing push  much of which, neither Trump nor the Republican Party even had to pay for.",
    "The Art Pope-John Locke Foundation, the very definition of the NCGOP's party establishment, did not even acknowledge the rally's existence in its mouthpiece, the Carolina Journal.",
    "Cross-posted from the Carolina Forward blog g\nLast Saturday, the disgraced former President Donald Trump held one of his signature rallies at a venue in Selma in Johnston County.",
    "The media appears to have learned precisely no lessons about its role in hollowing out American civil society and its shared understanding of what is true, and what is not.",
    "One early sign of Trump's boorishness came after the crowd at his inauguration fell far short of his hopes (at about one-third the size of Obama's 2008 inauguration).",
    "The rally was also a major embarrassment for North Carolina's media, who demonstrated absolutely nothing learned from four (or five) years of Trumpian chaos.",
    "The two highest-ranking Republicans in the state  Senate Leader Phil Berger and House Speaker Tim Moore  were no where to be seen, and weren't even invited.",
    "Here's Spectrum News reporter Kyleigh Panetta:\nx\nHAPPENING NOW: Here's a look at the crowd at former president Donald Trump's Save America? rally in Selma.",
    "For some  like Republican Reps. Ted Budd and Madison Cawthorn, as well as the NC-13 Republican primary candidate Bo Hines  the rally was a great success.",
    "To state the obvious, no other political rally, let alone protest, would garner anywhere close to this much coverage by North Carolina's media outlets.",
    "In May 2021, between 1,000 and 3,000 people (estimates vary) gathered in downtown Raleigh to protest Israeli aggression towards Palestinian civilians.",
    "Observers estimated Saturday's rally at not even 2,000, with significant video footage  including that from hard-right outlets  supporting that claim.",
    "@SpecNews1RDU pic.twitter.com/h3kVNepCUv\n Kyleigh Panetta (@KyleighPanetta) April 9, 2022\nCertainly, 1,000-2,000 people is a respectable crowd.",
    "In Cawthorn, Robinson and Budd's appearance with Donald Trump, it is clear which wing of the NCGOP is ascendant, and which is just hanging on.",
    "Significant photographic evidence, as well as testimony by reporters at the event, supported that estimate.",
    "In 2016, Trump held a rally at the same venue in Selma where attendance was widely estimated at 15,000.",
    "Its paltry attendance was a testament to his waning popularity outside the hardcore Republican base.",
    "They all landed very public endorsements from the former President, as well as from Lt.",
    "For Trump and his candidates, one might even say it was  excuse the expression  a coup.",
    "They streamed their speeches live and uncut, with any number of reporters on the scene.",
    "Size Matters\nTrump has a well-known and long-running obsession with crowd sizes.",
    "It's set to start at 5 PM and Trump is expected to make a speech at 7 PM.",
    "There are the heroic images splashed across screens all over the state.",
    "But it's hardly unusual for political events around North Carolina.",
    "(A protest which registered barely a blip on the media's radar.)",
    "It was also a body blow to the state's Republican establishment.",
    "For others, like Trump himself, the rally was more of a bust.",
    "Last weekend's rally fell far short of that standard.",
    "How successful the event was depends on who you ask.",
    "Governor Mark Robinson, for their respective races.",
    "The media  who was happy to do it for free.",
    "The final loser of Saturday's Trump rally?",
    "Raleigh's Republican establishment.",
    "This is plainly a failure.",
    "Who did?"
  ]
}