{
  "id": 2849,
  "mediaId": 136,
  "date": "4/10/2022 12:00:00 AM",
  "headline": "Trump Crowds 'Getting Smaller,' Base 'Shrinking,' Says GOP Strategist",
  "image": "https://d.newsweek.com/en/full/2017914/gop-strategist-says-trump-crowds-getting-smaller.webp?w=790&f=1ad5a24d8b14512398ee19d01d8e3f8f",
  "link": "https://www.newsweek.com/trump-crowds-getting-smaller-base-shrinking-says-gop-strategist-1696751",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fatma Khaled",
  "authorUrl": "https://www.newsweek.com/authors/fatma-khaled",
  "termIds": [
    2303,
    1147,
    1147,
    1059,
    1059,
    1954,
    1954,
    2303,
    1404,
    1404,
    545,
    545,
    428,
    428,
    2945,
    2945,
    2834,
    2834
  ],
  "sentences": [
    "MSNBC host Cori Coffin asked the GOP strategist about the \"warm welcome\" that North Carolina Republican Representative Madison Cawthorn received during Trump's Saturday rally in Selma, North Carolina, and whether or not the congressman is the \"future of the GOP.\"",
    "Trump arrived at the rally to endorse Ted Budd for North Carolina's Senate race in the GOP primary and to promote the reelection bid for Cawthorn, who was heavily criticized recently over his claims of orgies and cocaine use among his fellow Republicans.",
    "Attendees at the \"Save America\" rally gave Trump a round of applause after he said that he will seek \"justice for the January 6 prisoners,\" in an apparent reference to his supporters who stormed the U.S. Capitol on January 6, 2021.",
    "I'm not saying that the Republican Party is going to come out of Donald Trump in two, four, even six years, but even this Congress member is being shunned by members of his own party.\"",
    "Cawthorn criticized Republicans during the rally where he said party leaders are \"weakening, cheapening our platform\" and are going after \"non-existent middle-ground voters.\"",
    "GOP campaign strategist Susan Del Percio said Sunday that the number of rally-goers for former President Donald Trump is decreasing because conservatives \"want to move on.\"",
    "Yes, he can bring out those people, but those crowds are getting smaller and people aren't buying into it, mostly because Republicans want to move on.",
    "Like was received by ANTIFA and Black Lives Matter, who murdered people throughout our country,\" the former president told the crowd.",
    "Over 750 individuals have been arrested for attacking the Capitol including around 70 people who have received criminal sentences.",
    "\"We will, while we're at it, demand justice for the January 6 prisoners and full protection of their civil rights.",
    "\"He's the future of Donald Trump and his shrinking base and that is what you saw there.",
    "\"Absolutely not,\" Del Percio responded during an interview on Weekends with Alex Witt.",
    "\"The people of this country don't want to hear about it anymore.\"",
    "They don't want to talk about the big lie,\" Del Percio added.",
    "Newsweek reached out to Donald Trump's office for comments.",
    "\"Donald Trump?"
  ]
}