{
  "id": 2856,
  "mediaId": 147,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "Trump's endorsement power tested in North Carolina Senate race",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2022/04/2018-10-26T223449Z_212451792_RC1D25E58450_RTRMADP_3_USA-TRUMP-1200x807.jpg",
  "link": "https://www.pbs.org/newshour/politics/trumps-endorsement-power-tested-in-north-carolina-senate-race",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gary D. Robertson",
  "authorUrl": "https://www.pbs.org/newshour/author/gary-d-robertson-associated-press",
  "termIds": [
    2429,
    2429,
    1147,
    1147,
    1878,
    1878,
    571,
    571,
    428,
    428,
    368,
    368,
    2672,
    2729,
    2729,
    2672,
    2876,
    2876,
    2834,
    2834
  ],
  "sentences": [
    "The group's ads heavily feature Trump's endorsement, casting Budd as a reliable conservative while highlighting McCrory's past criticism of the former president and slamming him as a disloyal, liberal loser.?\nMcCrory became governor in 2013 but lost reelection after he signed a bathroom bill? targeting transgender people that cost the state billions.",
    "READ MORE: Manhattan district attorney says Trump criminal investigation is continuing despite leadership shakeup\nAs aides have warned that he is setting himself up for failure by offering too many endorsements, Trump has held off picking sides in several competitive Senate contests, including in Missouri and Ohio, where early voting is underway.",
    "Whether it's grassroots, trend lines in polling or fundraising, we think we're in a very good place.?\nBudd's candidacy will serve as an early test of whether Trump's backing is powerful enough to lift someone from relative obscurity to the GOP nomination for a critical Senate seat.",
    "RALEIGH, N.C. (AP)  When Ted Budd won a surprise endorsement from former President Donald Trump last year, he was a little-known congressman running for a Senate seat in North Carolina against some of the state's most recognizable Republicans, including a former governor.",
    "READ MORE: Trump endorses challenger against Georgia elections chief Brad Raffensperger\nDemocrats have made inroads across the South in recent years, winning a presidential election in Georgia in 2020 for the first time in 28 years and picking up two Senate seats.",
    "Budd credited Trump's endorsement as the single biggest factor to help advance and get attention on this campaign.? He has also benefited from millions of dollars in super PAC spending on his behalf, including from the Club for Growth's political wing.",
    "It's neck and neck right now, and it's amazing that we're even in that position, considering $7 to $8 million have been spent against us from a special interest group in D.C.,? McCrory said in an unnamed reference to Club for Growth Action.",
    "The race will be a test of the Trump effect on North Carolina among North Carolina Republicans, I think not just for North Carolina but nationally,? said Mike Rusher, a political consultant who previously worked for the state GOP.",
    "As he enters the final stretch before the state's May 17 primary, Budd is again hoping for a boost, banking on the power of Trump's endorsement to put him on top of a field that includes a dozen other Republicans.",
    "He was a boon to North Carolina Republicans in the 2020 campaign, boosting turnout so that GOP candidates  with few exceptions  won races up and down the ballot even as Trump himself only narrowly eked out a win.",
    "And in this particular incident, he has hitched his wagon to the wrong horse.?\nMcCrory, meanwhile, dismissed polling out this week suggesting he had lost his early edge, saying there's time for a counterattack.",
    "Look, we appreciate President Trump and the work that he did for our country, but it doesn't mean that he makes the right decisions and sometimes he gets bad counsel,? Walker said in an interview.",
    "Seeing Walker as a potential spoiler, Trump has tried to no avail to pressure him to leave the race  a tactic he has used successfully in other contests to bolster his favored candidates' chances.",
    "A strong showing by Budd could provide clues about how Trump-backed candidates in other states, including Georgia, that vote in quick succession after North Carolina, will fare.",
    "While McCrory entered the race as its best-known candidate, Budd and his advisers are increasingly optimistic that his position is strengthening in the race's final weeks.",
    "Now, Trump is returning the favor, featuring him as a rally speaker and endorsing him for reelection even as Cawthorn has faced backlash over recent incendiary comments.",
    "Barack Obama was the last Democratic presidential contender to carry North Carolina in 2008, and a Democrat hasn't won a Senate seat since Kay Hagan the same year.",
    "The winner is expected to take on presumptive Democratic nominee Cheri Beasley, a former state Supreme Court chief justice, in November's general election.",
    "Like nearly all statewide races, the general election should be close, and a Democratic victory could thwart GOP hopes of retaking the Senate majority.",
    "A dozen other Republicans are also seeking the nomination, including former U.S. Rep. Mark Walker, who has resisted Trump's entreaties to drop out.",
    "Trump says I don't represent his values,? McCrory said, referencing the former president's words when he endorsed Budd 10 months ago.",
    "Last year, his endorsed candidate in Pennsylvania's Senate race, Sean Parnell, dropped out amid allegations of abuse by his ex-wife.",
    "North Carolina has experienced similar demographic changes, driven by an influx of new residents to the Raleigh and Charlotte areas.",
    "But Trump soon embraced Cawthorn, who won the general election at age 25 and became one of the ex-president's strongest supporters.",
    "McCrory said he's got his own political events Saturday and wouldn't share the stage with Budd, Cawthorn or Trump even if offered.",
    "Last month, he withdrew his endorsement of Rep. Mo Brooks, who was struggling to gain traction in Alabama's Senate primary.",
    "Billy Shomaker, a retired commercial pilot from Beech Mountain, said he supports Budd regardless of Trump's endorsement.",
    "John Dismukes, 48, of Carolina Beach describes himself as 100% undecided.? I'm looking at all three of them,? he said.",
    "Pat McCrory, who is viewed as a moderate and has kept some distance from Trump while backing his economic policies.",
    "In 2020, political newcomer Madison Cawthorn comfortably won a GOP congressional primary runoff over Trump's pick.",
    "Saturday's rally comes amid questions over whether Trump's influence is fading amid stumbles in other states.",
    "But for now, Democrats have struggled to make the same progress in the state's presidential and Senate races.",
    "Trump will return to the state on Saturday for a rally in rural Johnston County, just southeast of Raleigh.",
    "Many voters have yet to make up their minds, with early in-person voting beginning April 28.",
    "But yeah, we maybe have different opinion on values.?\nColvin reported from New York.",
    "Budd is running for retiring Republican Sen. Richard Burr's seat against former Gov.",
    "Trump's preferred candidates in North Carolina haven't always been successful.",
    "The top vote-getter must garner more than 30% of the vote to avoid a runoff.",
    "We feel we've got strong momentum,? Budd told The Associated Press.",
    "Otherwise, the top two finishers advance to a runoff in late July.",
    "I don't like everything he does,? said Shomaker, 68.",
    "This race is going to be a dead heat.",
    "I agree with the policies of Trump.",
    "I like President Trump."
  ]
}