{
  "id": 2861,
  "mediaId": 33,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "Judge appears likely to allow January 6-related candidacy challenge against Marjorie Taylor Greene",
  "image": "https://www.cnn.com/media/sites/cnn/video-placeholder.svg",
  "link": "https://www.cnn.com/2022/04/08/politics/marjorie-taylor-greene-candidacy-challenge-lawsuit/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marshall Cohen",
  "authorUrl": "https://www.cnn.com/profiles/marshall-cohen",
  "termIds": [
    713,
    1596,
    2087,
    2203,
    2303,
    428,
    2555,
    2672
  ],
  "sentences": [
    "You have an ongoing proceeding that is in compliance with state law, and we would argue in compliance with federal law,? Russell Willard of the Georgia attorney general's office said Friday, urging Totenberg to allow the ongoing, and pending, state proceeding to continue to fruition.?\nA hearing in the underlying disqualification case is scheduled for Wednesday in Atlanta, where a state administrative judge will determine if Greene is qualified to appear on the GOP primary ballot.",
    "He noted on Friday that no one has been charged with insurrection related to January 6, despite all the resources of the Justice Department and FBI.? He also said removing Greene from the ballot would be akin to stripping voters of their right to vote and upending democracy right before an election.?\nThe GOP firebrand filed the suit against Republican Georgia Secretary of State Brad Raffensperger, whose office oversees parts of the candidacy challenge process.",
    "James Bopp Jr., a conservative lawyer who is representing Greene, said the challenge was 50 pages of newspaper articles, hearsay and political hyperbole.? He warned during the court hearing that if the challenge is allowed to proceed, it will embolden liberal groups to try to disqualify former President Donald Trump from running for reelection in 2024.",
    "They cited Greene's own comments, including one video where she explicitly said she opposed the peaceful transfer of power to President Joe Biden because he did not win this election.?\nLawyers for Greene say she isn't an insurrectionist and that disqualifying her would violate her First Amendment rights.",
    "The hearing Friday was the latest chapter in the seemingly elusive efforts to hold prominent GOP officials responsible for January 6, which are playing out in a major congressional inquiry, a federal criminal probe that has largely focused on the rioters themselves and civil litigation.",
    "Washington CNN \nA federal judge signaled Friday that she'll likely allow a group of Georgia voters to move forward with their constitutional challenge against GOP Rep. Marjorie Taylor Greene, which claims she can't run for reelection because she aided the January 6 insurrectionists.",
    "Federal Judge Amy Totenberg of the Northern District of Georgia said during a lengthy hearing that she has significant questions and concerns? about a recent ruling in a similar case, which blocked the same challenge against Rep. Madison Cawthorn, a North Carolina Republican.",
    "Bryan Sells, attorney for the challengers, who are backed by the legal advocacy group Free Speech For People, piled on, saying, The absurdity of his argument shines through like a beacon.?\nGreene hired the same lawyer, Bopp, who prevailed in the Cawthorn case.",
    "The challengers also demanded that she turn over a wide array of documents related to the 2020 election and January 6, including any emails she may have exchanged with rally organizers or members of extremist groups that were involved in the attack.",
    "The challengers claim that Greene can't run for reelection because she aided? the January 6 insurrection, allegedly planned with protest organizers and encouraged? the violence that disrupted the Electoral College certification.",
    "A Trump-appointed federal judge shut down that challenge, ruling that a Civil War amnesty law passed in 1872 still applies and therefore shielded Cawthorn from being disqualified over his role in the January 6 insurrection.",
    "That's two days before a state judge is scheduled to hold a hearing on the underlying question of whether Greene engaged in or aided the January 6, 2021, insurrection and whether that disqualifies her from office.",
    "I don't think that the Amnesty Act likely was prospective,? Totenberg said, siding with the challengers, who said the 1872 law was retrospective and didn't protect future insurrectionists.",
    "A group of Georgia voters, backed by a coalition of constitutional scholars and liberal activists, lodged the challenge against Greene last month with state election officials.",
    "High-stakes showdown\nThe anti-Greene challenge was brought by the same groups that unsuccessfully tried to remove Cawthorn from the GOP primary ballot in North Carolina.",
    "The state officials want the judge to dismiss Greene's lawsuit, which would allow the candidacy challenge to proceed in front of a state administrative judge next week.",
    "She previously told CNN that she had never encouraged political violence and never will.? A spokesman said she wasn't involved in planning any protests on January 6.",
    "Raffensperger was infamously on the receiving end of a phone call where Trump pressured him to find? enough votes to undo Joe Biden's victory in Georgia.",
    "The 14th Amendment of the US Constitution prohibits officeholders from returning to elected positions if they supported an insurrection.",
    "In the federal case, Raffensperger is represented by Georgia Attorney General Chris Carr, who is also a Republican.",
    "Some of the leading experts on the Constitution's disqualification clause? criticized that judge's conclusion.",
    "Greene then filed her own lawsuit in federal court, asking Totenberg to shut down the state-level proceedings.",
    "Cawthorn has denied any wrongdoing regarding January 6 and says he isn't an insurrectionist.",
    "The election is May 25, and counties will start mailing absentee ballots later this month.",
    "The administrative judge already rejected a request for Greene to testify at a deposition.",
    "And on Friday, so did Totenberg, the Obama-appointed judge in Greene's case.",
    "Totenberg said she will issue a ruling next week, likely on Monday.",
    "Raffensperger refused to go along.",
    "Greene opposes these efforts."
  ]
}