{
  "id": 2862,
  "mediaId": 43,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "DKos Asheville Open Thread: Your weekly Cawthorn, packed full of (your words here). And bears!",
  "image": "https://images.dailykos.com/images/1057580/story_image/DKBrentBrownBears.jpg?1649521494",
  "link": "https://www.dailykos.com/story/2022/4/9/2090993/-DKos-Asheville-Open-Thread-Your-weekly-Cawthorn-packed-full-of-your-words-here-And-bears",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    1878,
    1878,
    2303,
    428,
    337,
    337,
    370,
    370,
    101,
    101,
    428,
    2589,
    2589,
    2834,
    2834
  ],
  "sentences": [
    "Madison Cawthorn refuses Acosta's questions on controversial comments\nCNN, Jim Acosta, 4/4/2022\nx\nx\nx\nRep. Madison Cawthorn facing GOP backlash\nCBS News, 4/4/2022\nx\nx\nx\nRepublican goes off on Madison Cawthorn allegations for almost 10 minutes: 'You should name them'\nRaw Story, Sarah K. Burris, 4/3/2022\nFormer Rep. Trey Gowdy (R-SC) is so furious with Rep. Madison Cawthorn (R-NC) that he was spitting fire on the Fox network Sunday.",
    "pic.twitter.com/kPlUV2FALi\n CSPAN (@cspan) April 4, 2022\nJohn Oliver to Kevin McCarthy: You 'raised the monster' that is Madison Cawthorn and 'it's your effing problem'\nRaw Story, Sarah K. Burris, 4/4/2022\nRep. Kevin McCarthy (R-CA) revealed this week that he no longer has \"trust\" in Rep. Madison Cawthorn (R-NC), the young official who outed GOP members for having \"sexual get-togethers\" and snorting cocaine.",
    "What's new in food: Asheville City Market returns to downtown\nMountain Express, Kay West, 4/5/2022\nOn April 2, farmers, makers and bakers unloaded their vehicles and set up their vendor booths on North Market Street, as Asheville City Market resumed operations at its popular open-air downtown location for the first time since mid-December 2019.",
    "x\nx\nx\nStudent-led activism: Make a difference locally\nMountain Express, Justin McGuire, 4/9/2022\nThere is a degree of distress among some of today's college students who consider climate change a top issue facing the world, especially amid the lack of meaningful national or international efforts to address the crisis.",
    "Saturday Weather Update: Snowy spring day for some across the mountains\nWLOS, 4/9/2022\nASHEVILLE, N.C. (WLOS)  WINTER WEATHER ADVISORY (above 3,500 ft.): Graham, Swain, Jackson, Haywood, Madison, Yancey, Mitchell & Avery Counties until 2 a.m. Sunday\nWINTER STORM WARNING: Graham & Swain Counties until 2 a.m. Sunday.",
    "Buncombe considers affordable housing partnership with UNC\nMountain Express, Daniel Walton, 4/7/2022\nBuncombe County leaders have already flagged four sets of county-owned property as potential fits for affordable housing, including a 137-acre parcel off Ferry Road and three downtown Asheville locations.",
    "Madison Cawthorn's support for fellow Republicans dries up as he becomes a party pariah\nRaw Story, Timothy Evans, 4/8/2022\nFreshman congressman Madison Cawthorn has a knack for generating headlines, but the North Carolina Republican seems to have lost his touch when it comes to fundraising.",
    "x\nx\nx\n'I'm about to define what a woman is': Madison Cawthorn gives 'Tallywacker' speech on House floor\nRaw Story, David Edwards, 4/4/2022\nThe North Carolina Republican made the remarks after Judge Ketanji Brown Jackson declined to define \"woman\" in her Supreme Court confirmation hearings.",
    "A series of inflammatory statements from Cawthorn  who will appear at a Trump rally in North Carolina on Saturday  led some fellow Republicans to criticize him, and it's testing whether voters will turn to one of seven GOP candidates who are challenging him in next month's state primary.",
    "x\nx\nx\nNew dashcam footage shows a shocked Madison Cawthorn after officer informs him his car is registered to his father\nAlterNet, Meaghan Ellis, 4/5/2022\nRep. Madison Cawthorn (R-N.C.) is facing intense scrutiny following the release of footage from his recent traffic stops.",
    "Graphic courtesy of Buncombe County\nAs outlined in an April 5 presentation to the Board of Commissioners by Tim Love, Buncombe's director of economic development and governmental relations, the county would contract with the school's Development Finance Initiative.",
    "WATCH: North Carolina Republicans are now using Madison Cawthorn to attack each other\nRaw Story, Sarah K. Burris, 4/6/2022\nRepublican North Carolina congressman Madison Cawthorn has such a toxic political brand that Republicans are now using it to trash each other.",
    "A new campaign finance filing from Cawthorn's joint fundraising account with the National Republican Congressional Committee  called Cawthorn Triumph?  shows zero dollars in receipts for the first three months of the year, according to The Daily Beast.",
    "I believe that higher education, and college campuses in particular, have such a unique opportunity to be leading the way.?\nBelow, Xpress speaks with Wingate about her campus initiatives and how her generation is tackling the climate crisis.",
    "Over the previous two years, amid COVID-19 restrictions and safety measures, Appalachian Sustainable Agricultural Project, the nonprofit that runs the Asheville City Market, relocated the weekly happening to the A-B Tech campus.",
    "We knew farmers and vendors had things to sell and customers who wanted to buy, so we needed to continue operating in the safest way possible.?\nAs COVID protocols changed, the ASAP Farmers Market at A-B Tech did as well.",
    "A new campaign finance filing from Cawthorn's joint fundraising account with the National Republican Congressional Committeecalled Cawthorn Triumph?shows zero dollars in receipts for the first three months of the year.",
    "While many other Republicans have been caught promoting white supremacists, klan ideology or using anti-Semitic imagery, it was Cawthorn that drew a stern warning from House Minority Leader Kevin McCarthy (R-CA).",
    "To make matters worse, another new filing shows that Cawthorn's leadership PAC  Making A Difference In Service to Our Nation? (MADISON PAC)  also has gone almost dormant, reporting only $2,000 in contributions.",
    "To make matters worse, another new filing shows that Cawthorn's leadership PACMaking A Difference In Service to Our Nation? (MADISON PAC)has also cooled its activity, reporting only $2,000 in contributions.",
    "For Buncombe County, the DFI would work to determine what projects might be feasible at each location, create financial models for public-private partnerships and arrange agreements with private developers.",
    "Madison Cawthorn's GOP Colleagues Have a New Reason to Hate Him\nThe Daily Beast, Roger Sollenberger, 4/8/2022\nRep. Madison Cawthorn (R-NC) isn't exactly making friends in Congress these days.",
    "SITE TO SEE: Previous consulting work by Equinox Environmental has established broad outlines for the potential development of a county-owned property off Ferry Road for affordable housing.",
    "While I am passionate about issues on a larger scale, I am currently in a position where I can make the most impact by dedicating my efforts to sustainability on my campus,? she says.",
    "There are so many things that have been amazing about A-B Tech through the pandemic and many things we will miss about it, but we are really excited to be back downtown,? she says.",
    "Speaking about it Sunday, Gowdy said that the people he was around, while in Congress, did none of what Cawthorn described, explaining that he was never invited to the orgy.",
    "Over the last several days, the North Carolina Highway Patrol has released dashcam clips for two of three traffic stops involving Cawthorn following his most recent stop.",
    "\"I never imagined that one of my sacred duties in this hallowed chamber would be explaining to the House Speaker the difference between a man and a woman,\" he continued.",
    "BLACK BEAR GETS TRAPPED IN CAR, DESTROYS IT BEFORE ESCAPING THROUGH WINDSHIELD\nThe chaotic event took place on Old Haw Creek Road, just outside Asheville city limits.",
    "We offer this space every weekend to share what we're up to in Western North Carolina and to give readers a variety of links to local and regional news of interest.",
    "DKos Asheville and other local and state groups can give us all a better sense of connection, a better understanding of who we stand with, work with and share with.",
    "A handful of fundraising blitzes last year fueled $673,000 in donations, but the well went dry in October, and Cawthorn Triumph hasn't raised any money since.",
    "He's my Representative so I feel an obligation to continue rounding up his news stories through the week so I can offer them and archive them for reference.",
    "Its previous local work includes the Grey Hosiery Mill reuse project in Hendersonville, which created 35 units of workforce and moderate-income housing.",
    "You don't notice them unless you're looking for them.?\nBut Thursday's event gained national attention after McGowin caught the bear escaping on camera.",
    "Daily Kos fights for a progressive America by empowering its community and allies with information and tools to directly impact the political process.",
    "Accumulating snow looks possible for higher elevations, with highest spots along the North Carolina-Tennessee state line seeing a chance for 2-6\".",
    "Scroll past him for some interesting local stories on other subjects, like student activism and bears breaking into cars in quiet neighborhoods.",
    "He said there would be \"bloodshed\" if the next election was stolen, and he called those arrested during the Jan. 6 attack \"political hostages.\"",
    "Cawthorn has come under fire in recent weeks after he appeared on a video podcast where he said that he was invited to \"sexual get-togethers.\"",
    "Love emphasized that the consultant would be hired at risk,? meaning it wouldn't receive full payment until those agreements had been reached.",
    "4/9/2022 (includes 4 min audio)\nLike former President Donald Trump, first-term North Carolina Congressman Madison Cawthorn has tested voters.",
    "(That $2,000 came from the PAC's own treasurer, Thomas Datwyler, who donated in February and also runs the books for the Cawthorn campaign.)",
    "(That $2,000 came from the PAC's own treasurer, Thomas Datwyler, who donated in February and also runs the books for the Cawthorn campaign.)",
    "A wildlife expert at the Western North Carolina Nature Center said events like that involving black bears are not common but not unheard of.",
    "While speaking to the officer, Cawthorn claimed the vehicle was his, but the officer said otherwise after checking the vehicle registration.",
    "Buncombe now seeks to partner with UNC's Development Finance Initiative to secure an agreement for the property with a private developer.",
    "How to avoid an incident as the furry animals emerge for spring\nWLOS, Samiar Nefzi, 4/8/2022\n A black bear in Asheville, North Carolina.",
    "Winter Weather Alerts have been issued for the Tennessee border where travel may become difficult with accumulating and blowing snow.",
    "Rain is mixing with snow through the day for parts of the mountains in Western North Carolina, especially elevations over 2,500 feet.",
    "But now, as the divisive first-termer suddenly feels the heat ahead of a contentious primary, those accounts are drawing goose eggs.",
    "Last year, Rep. Madison Cawthorn (R-NC) pulled hundreds of thousands of dollars in support of Republican congressional incumbents.",
    "The DFI functions like a consulting firm for municipal and county governments to help them carry out creative development efforts.",
    "Other Republicans, Cawthorn said, spend their time and efforts fighting the drug war, meanwhile, he witnessed them doing cocaine.",
    "Leslie Morris, who has lived in the neighborhood for nearly 20 years, said bears have become increasingly common in the area.",
    "But to turn those plans into reality, the county is considering nearly $221,000 in advice from the UNC School of Government.",
    "Cawthorn \"has lost my trust,\" said McCarthy after the meeting, claiming that the young Republican is known for being a liar.",
    "\"The left has ripped away the pin of truth from the author of life,\" Cawthorn opined during a House floor speech on Monday.",
    "He said that the orgies were one thing and people \"leading on trying to remove addiction in our country\" are doing cocaine.",
    "Oliver began by noting that no one uses the term \"key bump\" when referring to doing cocaine without knowing what it means.",
    "According to Queen City News of Charlotte, N.C., the first clip is from a traffic stop in Buncombe County back in October.",
    "Wildlife leaders said bear encounters can happen more frequently as the animals come out of hibernation this time of year.",
    "Both men are running in a Republican primary to take over the seat being vacated by retiring Sen. Richard Burr (R-NC).",
    "The interview went viral, landing Cawthorn in House GOP Minority Leader Kevin McCarthy's office for a talking to.",
    "What's more, after collecting $673,000 in donations last year Cawthorn Triumph hasn't raised any money since.",
    "He also noted that people doing coke-fueled orgies don't generally refer to them as \"sexual get-togethers.\"",
    "For Cora Wingate, a junior at Warren Wilson College, the answer is to focus on making a difference locally.",
    "You can't just have it your way...take notes Madame Speaker, I'm about to define what a woman is for you.\"",
    "Cawthorn, who at 26 is the youngest member of Congress, has in the past been accused of sexual misconduct.",
    "Cawthorn's inflammatory comments have some Republicans in his district tiring of him\nNPR, Steve Harrison.",
    "Cawthorn got in trouble this week when he announced that members of his party invited him to sex parties.",
    "We hope this local and wider community can help leverage our orange passion for progressive politics.",
    "But as John Oliver explained Sunday night, Cawthorn is essentially the monster that McCarthy built.",
    "x\nRep. Madison Cawthorn (@RepCawthorn): \"You might amend a bill, but you'll never amend biology.",
    "Sustainable is part of our name,? says ASAP's manager of communications Sarah Hart with a laugh.",
    "Hart says ASAP is grateful for how A-B Tech partnered with and responded to the market's needs.",
    "Ashely McGowin said her SUV was totaled after she woke to find a mama bear inside the vehicle.",
    "On Thursday, a Buncombe County woman's vehicle was destroyed by a bear was trapped inside.",
    "Pat McCrory is using comments from Rep. Ted Budd (R-NC) about Cawthorn in a new attack ad.",
    "Since Gowdy was in office, 29 new Republican members of Congress have entered the House.",
    "The officer who facilitated the stop confirmed Cawthorn was pulled over for speeding.",
    "He also explained that he watched Republicans fighting the \"drug war\" doing cocaine.",
    "\"They've exchanged natural science for party platform and declared war on biology.\"",
    "It's unclear that he meant the two events were linked together at the same time.",
    "The vibe of the City Market is embedded in the city.?\nIs that a bear in the car?",
    "So how do they stay motivated to keep fighting in the face of such frustration?",
    "He suggested that Cawthorn was simply \"hanging around with the wrong people.\"",
    "Cawthorn appeared to separate the two out, when doing the interview, however.",
    "During that stop, the lawmaker was cited for driving 89 mph in a 65 mph zone.",
    "This is the weekly DKos Asheville Open Thread for Saturday, April 9th, 2022.",
    "We have seen more and more bears around throughout the years,? Morris said.",
    "\"Take notes, Madame Speaker, I'm about to define what a woman is for you.\"",
    "Please jump the fold for links to weekly stories I hope you find useful.",
    "It looks like it's registered to, I guess, your dad,? the officer said.",
    "Thanks form reading and contributing, I hope you have a safe weekend.",
    "All showers should taper off Saturday evening and end Saturday night.",
    "This week's collection covers stories I've been saving since Sunday.",
    "His new stance on raising money for the party isn't going to help.",
    "Cawthorn also did not have a valid driver's license at the time.",
    "The bear eventually broke through the windshield to escape.",
    "We were all scrambling from home trying to figure it out.",
    "Once again, I get to have to feature Madison Cawthorn.",
    "The interview has been condensed and lightly edited.",
    "\"So, you're already telling on yourself there.\"",
    "Is it really?? Cawthorn could be heard asking.",
    "They're quiet, and you don't notice them.",
    "Good day and welcome to DKos Asheville.",
    "Science is not Burger King.",
    "Too tired of the weirdo?",
    "Ousted Republican Gov.",
    "How far is too far?"
  ]
}