{
  "id": 2865,
  "mediaId": 19,
  "date": "4/9/2022 12:00:00 AM",
  "headline": "Trump Calls on Republicans to Remove DHS Secretary Mayorkas",
  "image": "https://media.breitbart.com/media/2022/04/DHS-Secretary-Alejandro-Mayorkas-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/04/09/trump-calls-on-republicans-to-remove-dhs-secretary-mayorkas/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jordan Dixon-Hamilton",
  "authorUrl": "https://www.breitbart.com/author/jdixonhamilton/",
  "termIds": [
    1147,
    2066,
    2087,
    2303,
    428,
    549,
    2834
  ],
  "sentences": [
    "Biden is willfully opening the floodgates to a tidal wave of illegal immigration the likes of which the world has never seen before.?\nTitle 42 is a pandemic-era law Trump implemented that makes it easier for the federal government to deport border hoppers and illegal aliens.",
    "Former President Donald Trump blasted President Joe Biden for ending Title 42 and called on Republicans to remove Department of Homeland Security Secretary Alejandro Mayorkas from office during a rally in North Carolina on Saturday.",
    "Trump's remarks came at a rally in Selma, North Carolina, in support of Rep. Ted Budd (R-NC), who seeks a U.S. Senate seat in North Carolina; congressional hopeful Bo Hines, and first-term Rep. Madison Cawthorn (R-NC).",
    "After we win this November, Republicans should immediately vote to remove Biden's Secretary of Homeland Security from office for his blatant acts of sabotage against the laws of the United States,? Trump said.",
    "With last week's announcement that the Biden administration will rescind the crucial Title 42 protections I put into place to quickly remove illegal aliens,? Trump said.",
    "During his speech, Trump also called on Republicans to remove Mayorkas from office if they regain control of Congress after the November midterm elections.",
    "Biden announced last week that the Title 42 restrictions would end on May 23.",
    "And then, we should continue to work hard until the borders are sealed.",
    "North Carolina's primary elections will take place on May 17."
  ]
}