{
  "id": 2872,
  "mediaId": 151,
  "date": "4/6/2022 12:00:00 AM",
  "headline": "Marjorie Taylor Greene's comments on \"Nazis in Ukraine\" have been cited by Russian media. They're using them to help justify their invasion of Ukraine.",
  "image": "https://www.politico.com/interactives/uploads/image-service/2022/4/6/05424cbf70-1200.jpeg",
  "link": "https://www.politico.com/minutes/congress/04-6-2022/",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1501,
    2087,
    2231,
    2303,
    2523,
    346,
    2888,
    2942
  ],
  "sentences": [
    "She's not alone: A similar situation unfolded when freshman Rep. Madison Cawthorn (R-N.C.) called Ukrainian President Volodymyr Zelenskyy a thug.? And it goes to show that the words of any lawmaker  even if they don't represent the majority of views in the party  can be weaponized by malign actors in an already gruesome war.",
    "Tap, click or scroll to read more g\nWhat happened: More than five dozen House Republicans voted against a bipartisan resolution expressing \"unequivocal support for the North Atlantic Treaty Organization as an alliance founded on democratic principles\" and urging the creation of a center to protect democracy around the world.",
    "Rep. Mike Rogers (R-Mich.), who experienced a gunman's attack on Republican baseball practice in 2016: \"A catastrophic event is just around the corner every day and it can subvert the constitutional powers of Congress ... We've dodged a bullet in the past, so to speak, but who knows when our luck will run out?\"",
    "Rep. Shelia Jackson Lee (D-Texas), presiding over the chamber during the protest, got pretty good at the script blocking the request: \"The chair understands that the gentleman from Maryland has not yielded for that purpose, therefore the unanimous consent request cannot be entertained.\"",
    "Tap, click or scroll to read more g\nThe takeaway: From long-time GOP official, Arthur Culvahouse, who's made recommendations as part of an American Enterprise Institute commission: \"Our enemies foreign and domestic can be assured we'll always have a president,\" he said.",
    "Tap, click or scroll to read more g\nAn agreement formed between Majority Leader Chuck Schumer and Sen. Mitt Romney (R-Utah) was upended as Republicans demanded a vote on an amendment that would limit immigration due to the pandemic, called Title 42.",
    "\"I think all of us should be careful and try to understand: we don't want to help Vladimir Putin.?\nAlso being weaponized: Jennifer Strahan, who is challenging Greene for her ruby red seat, has pointed to this problem on her website.",
    "Tap, click or scroll to read more g\nWhat happened: Dozens of House Republican lawmakers flocked to the floor today seeking to call up legislation barring the relaxation of Covid-related public health restrictions at the border.",
    "The chamber will consider two suspension bills, along with a bill that would provide relief to restaurants and other small businesses, and another bill that would find Navarro and Scavino in contempt of Congress.",
    "Tap, click or scroll to read more g\nThe world is literally watching: Russian state media are using Rep. Marjorie Taylor Greene's words to aid their argument that their invasion of Ukraine was warranted.",
    "Northwest Georgians are wondering why Biden hasn't spent a dime to protect ours.?\nScores of House GOP lawmakers tried to call up a bill keeping the pandemic-related border health rules in place.",
    "Without unanimous agreement on the bill this week, the Senate won't be able to move on the package until late April or early May, despite White House assertions that the aid is urgent.",
    "In this particular circumstance, members have to recognize that Russia is brilliant about taking U.S. leaders' own words and turning it to their own purposes, their own propaganda.",
    "Both Ukraine  and the Georgia Republican's primary challenger  are trying to push back on this propaganda that paints some U.S. lawmakers as sympathetic to the Kremlin aggressor.",
    "The House: The chamber will vote today on holding former Trump advisers Peter Navarro and Dan Scavino in contempt of Congress for ignoring subpoenas from the Jan. 6 committee.",
    "There's real Nazis in Ukraine,? Greene said in an interview that aired in late March on Real America's Voice.? Then this week, a Russian broadcast called POCCNR ran the clip.",
    "She shows a series of translations of Russian media, which cite Greene's remarks, plus the countering positions from other international outlets, including ones from Ukraine.",
    "Rep. Gerry Connolly (D-Va.), the bill's author along with Rep. Mike Turner (R-Ohio), said the language was meant to be all-inclusive and not targeting any particular country.",
    "A number of Democrats might vote for such an amendment, if it came to the floor, with at least six breaking with President Joe Biden on border restrictions.",
    "And it plays really well to the Russian people when they do that,? warned Rep. Chris Stewart (R-Utah), a senior member of the House Intelligence Committee.",
    "He said the inclusion of language referencing \"internal threats from proponents of illiberalism\" within democracies was a knock on Hungary and Poland.",
    "The chamber will convene at 10 a.m., and resume consideration of nominations, including Judge Ketanji Brown Jackson's to the Supreme Court.",
    "A House panel examined a really grim scenario: What should happen if a mass attack kills or incapacitates a whole bunch of lawmakers?",
    "Rep. Donna Shalala (D-Fla.): \"It's a decision that ought to be made quickly, because the possibility is certainly in front of us ...",
    "management of debate over a resolution holding two former Trump officials  Peter Navarro and Dan Scavino  in contempt of Congress.",
    "If approved, lawmakers will make a formal referral to the Justice Department, which will then determine whether to file charges.",
    "Other comments that she made on Fox News that President Joe Biden \"wants war\" are also getting play in different state media.",
    "Under certain cataclysmic, catastrophic scenarios you could result in not having a functioning House of Representatives.\"",
    "If the losses are concentrated to the majority party, can you prevent the minority party from installing its own speaker?",
    "Could any of these changes be done without a constitutional amendment, which would likely take many years to enact?",
    "Asked about Greene's comments, her campaign sent a statement: \"Joe Biden spent $16 billion on Ukraine's border.",
    "Guy Reschenthaler (R-Pa.) called up his colleagues one-by-one to make the same immigration-related request.",
    "The move came during rule debate over whether to hold two former Trump officials in contempt of Congress.",
    "How would you structure mass special elections or fill the vacancies to allow continuity of government?",
    "Check out our archive for previous minutes, or sign up for Huddle our morning Capitol Hill newsletter.",
    "63 House Republicans voted against a non-binding, bipartisan resolution expressing support for NATO.",
    "Andy Harris, the lone GOP member to speak against it, said he had a problem with certain wording.",
    "\"That is a progressive, left-wing dog whistle for Poland and Hungary,\" he said of the language.",
    "What would happen in the worst-case scenario of all members being killed or incapacitated?",
    "The chamber will meet at 10 a.m., with votes scheduled for 2:45-4 p.m. and 5:15-6:15 p.m.",
    "The lone Republican to explain his concerns on the floor was Rep. Andy Harris (R-Md.).",
    "\"Why in the world in a preamble, would we appear to attack one of our NATO allies?",
    "If a Designated Survivor-esque situation happened, how could Congress keep going?",
    "Where would the body convene in the event of the loss of the Capitol complex?",
    "Here's what's driving the congressional calendar on Wednesday, April 6, 2022.",
    "How would you create ballots in the event of widespread loss of electricity?",
    "State media has also cited her saying that President Joe Biden \"wants war.\"",
    "At 11:45 a.m., there will be a roll-call vote for another nomination.",
    "A vote to hold former Trump advisers in contempt of Congress.",
    "In the near future, we simply have to make these decisions.\"",
    "Other Democrats took note of the GOP defections as well.",
    "Democrats blocked the move, ruling it out of order.",
    "Check back later today for updates from the Hill.",
    "Pushback on Covid aid relating to immigration.",
    "It interrupted Rep. Jamie Raskin's (D-Md.)",
    "Additional roll-call votes are possible.",
    "Press conferences on Iran negotiations.",
    "\"The same is not true of Congress.",
    "Would there be primaries?",
    "Democrats blocked it.",
    "That's all for now.",
    "Want to see more?",
    "It's unnecessary.",
    "It's unwise.\"",
    "Rep."
  ]
}