{
  "id": 289,
  "mediaId": 195,
  "date": "3/24/2022 12:00:00 AM",
  "headline": "House GOP keeps Trump at arm's length as it hones midterm strategy",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/mccarthykevin_030922gn12_lead.jpg?itok=8takdPzy",
  "link": "https://thehill.com/homenews/campaign/599658-house-gop-keeps-trump-at-arms-length-as-it-hones-midterm-strategy",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1095,
    1147,
    2087,
    2303,
    3085,
    3094,
    146,
    422,
    428,
    562,
    2590
  ],
  "sentences": [
    "The American people gave the Democrats a chance, and what we have seen very clearly now is that they just simply cannot govern.?\nWhile Trump remains the most influential and popular Republican in the country, many in the GOP have both publicly and privately sought to distance themselves from him, at least somewhat, fearing that too much involvement by the former president in shaping the party's agenda could isolate many of the Americans who voted him out of office in 2020.\nI think the strategy is: keep him close, but not too close,? one Republican strategist who works on House campaigns said.",
    "House Republicans have never been more united in our efforts to earn the majority so that we can deliver results for the American people.?\nRepublicans need to flip just about half a dozen seats this year to win back the majority, and given President Biden's lackluster approval rating and the fact that the party in power tends to lose ground in Congress in midterm elections, the GOP appears well-positioned to do so.",
    "In an effort to get buy-in from the competing factions within the House Republican Conference, House Minority Leader Kevin McCarthy (R-Calif.) said that the retreat was intended to solicit input from all of its members as he marches forward with his plan to release a policy agenda before midterm campaigning begins in earnest this fall.",
    "An internal poll from the House GOP's campaign arm, the National Republican Congressional Committee (NRCC), which was presented to members during the retreat in Florida, found Republicans with a 4-point advantage over Democrats on the generic ballot in 77 battleground House districts.",
    "Stefanik called Russian President Vladimir Putin a war criminal? and accused him of committing genocide? in Ukraine, but stopped short of directly criticizing Cawthorn or another far-right member, Rep. Marjorie Taylor Greene (R-Ga.), who has echoed Cawthorn's comments on Zelensky.",
    "In another instance of that balancing act, Stefanik demurred on Thursday when asked if remarks from one far-right member, Rep. Madison Cawthorn (R-N.C.) describing Ukrainian President Volodymyr Zelensky as a thug? could prove damaging to House Republicans' midterm efforts.",
    "The party seems to be moving in a direction, at least nominally, away from Trump, but still on his good side, and away from these extreme issues that don't resonate with voters anyway.?\nTo be sure, there are still signs of Trump's influence in the conference.",
    "While they are hoping to pull in swing voters, including those who voted for Biden in 2020, House GOP leaders also know that they can't afford to completely sideline the more extreme elements within their conference or isolate their most conservative voters.",
    "Talk is cheap, and Republican leadership in the House has repeatedly walked away from holding white supremacists and Putin sympathizers in the caucus accountable,? Chris Taylor, a spokesperson for the Democratic Congressional Campaign Committee (DCCC), said.",
    "PONTE VEDRA BEACH, Fla.  House Republicans are honing their midterm message at their annual retreat in Florida, previewing a campaign strategy that has little to do with former President Donald Trump and the grievances that animate his hardline base.",
    "Instead, House Republican leaders have sought to stake out a more traditionally conservative message ahead of the 2022 midterms, one that pivots on campaign staples like government spending and the rising cost of living.",
    "You will see a unified Republican Party and a laser focus on issues that matter to every American,? said House Republican Conference Chair Elise Stefanik (R-N.Y.), who is in charge of her conference's messaging.",
    "Another survey from Pew Research Center released on Thursday, however, showed voters evenly split on the generic ballot question, with 43 percent choosing Democrats and another 43 percent choosing Republicans.",
    "The retreat was a show of discipline for a conference that less than a year ago was bogged down by internal divisions in the wake of the 2020 presidential election and subsequent riot at the U.S. Capitol.",
    "While Democrats have overseen unprecedented job growth in the past year Republicans are recycling their disastrous economic agenda  higher taxes for the middle class and gutting access to healthcare.?",
    "We're going to have our own message.?\nWhat you're looking at is a conference that is 99 percent united and that's what always gets lost in the headlines,? Doug Heye, a Republican strategist, said.",
    "Conference leaders have also placed a premium on fighting alleged censorship by tech companies and combating so-called wokeness,? echoing one of Trump's most oft repeated grievances.",
    "But in another finding from that poll, 70 percent of Republican voters said that they believe which party controls Congress is important, while 60 percent of Democrats said the same.",
    "Still, Democrats have signaled that they'll try to tie Republicans to the most extreme voices in their conference as they look to hold onto their paper-thin House majority this year.",
    "They have also hammered the idea of unity within the conference in hopes of avoiding a repeat of the infighting that plagued House Republicans in the wake of the 2020 election.",
    "He has to be involved, I think to a certain extent, but what you hear Republicans saying now too is effectively, you know, we're going to run our own campaigns.",
    "We don't have many speakers here on purpose because we want the engagement from the members themselves coming up with that,? McCarthy said.",
    "Trump's name has been notably absent at the meeting, as has any mention of his claims of widespread voter fraud and election integrity.",
    "And despite the emphasis on unity, the retreat also highlighted the balancing act that Republicans will have to perform this year.",
    "Can we afford the Democratic policy when it comes to our border??\nThe real answer is we cannot afford it,? McCarthy added.",
    "That's a marked difference from 2018, when Democrats and Republicans were almost evenly split on the question.",
    "More than 100 House Republicans are set to host a fundraiser later this month for Rep. Liz Cheney's (R-Wyo.)",
    "There's one truth really that stands out here and it's really simple and clear for everybody to see.",
    "1 question every American is asking is can we afford it?? McCarthy said at a news conference.",
    "House Minority Leader Kevin McCarthy (R-Calif.) previewed that message on Wednesday.",
    "Can we afford the Democrats' policy when it comes to crime that continues to rise?",
    "There is going to be a big contrast,? said Rep. Mike Johnson (R-La.",
    "), the vice chair of the House Republican Conference.",
    "Trump-backed primary challenger Harriet Hageman.",
    "Can we afford the gasoline costs?",
    "Can we afford the food costs?",
    "The No."
  ]
}