{
  "id": 2901,
  "mediaId": 237,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Cawthorn defends 'calling out corruption' with orgy and cocaine claims",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/1e40436/2147483647/strip/true/crop/2811x1476+0+53/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F2e%2F2e%2F80a3e70341eebfec4c0eea8de031%2Fap21007273497086.jpg",
  "link": "https://www.washingtonexaminer.com/news/house/cawthorn-defends-calling-out-corruption-with-orgy-and-cocaine-claims",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Juliegrace Brufke",
  "authorUrl": "https://www.washingtonexaminer.com/author/juliegrace-brufke",
  "termIds": [
    1609,
    2226,
    2267,
    2303,
    2341,
    146,
    428,
    2834,
    2959
  ],
  "sentences": [
    "Instead, in a statement he released Friday, Cawthorn accused Democrats and the media of attempting to use his words to divide the GOP.?\nCawthorn, 26, made the controversial remarks during an appearance on the Warrior Poet Society podcast with host John Lovell after he was asked if the Netflix series House of Cards was realistic in its portrayal of Washington politics.",
    "If you don't think that's true, you've not witnessed the Swamp,? he said in the statement, My comments on a recent podcast appearance calling out corruption have been used by the left and the media to disparage my Republican colleagues and falsely insinuate their involvement in illicit activities,? he continued.",
    "I will continue fighting for many years to come.?\nMcCarthy on Wednesday did not rule out the possibility of disciplinary action over his comments, such as removing him from his committee assignments, and would not confirm whether he would continue to back him in his race.",
    "North Carolina Sen. Thom Tillis, a Republican, opted to endorse one of his seven primary opponents, and Republican Sen. Richard Burr, also from North Carolina, told reporters this week that he believes Cawthorn has \"been an embarrassment at times.\"",
    "Embattled North Carolina Rep. Madison Cawthorn refused to retract his accusations that orgies and cocaine use take place among politicians in Washington despite coming under fire from his Republican colleagues.",
    "While leaders called on him to walk back the comments, Cawthorn said he took his time to weigh how to best handle the controversy since it first erupted.",
    "Minority Leader Kevin McCarthy pressed the freshman congressman to make things right? and told reporters Cawthorn admitted to exaggerating his claims.",
    "If you want someone who will throw the entire DC swamp into a meltdown because I call out corruption  send me back,\" he said.",
    "His comments were met with fury within the GOP conference, leading to a meeting with House Republican leadership Wednesday.",
    "It was announced on Friday that Cawthorn will appear at a rally alongside former President Donald Trump on April 9.",
    "Compromising activities occur because when other people can place you in compromising positions, they control you.",
    "They are terrified of Republicans taking back the House and seeing Leader McCarthy become Speaker McCarthy.",
    "It's all about power  but my colleagues and I are fighting that corruption,\" he added.",
    "He continued, \"The left and the media want to use my words to divide the GOP.",
    "If you want Washington to operate without accountability, send someone else.",
    "Cawthorn, who faces a heated primary, asserted he has no plans to step down.",
    "Western North Carolina, you sent me to Washington to change the culture.",
    "I've considered for several days how best to address this controversy.",
    "I will not back down to the mob, and I will not let them win.",
    "Corruption and unethical activities exist in Washington.",
    "It's an indisputable fact,\" Cawthorn said.",
    "Their efforts to divide us will fail.",
    "The culture in Washington is corrupt.",
    "It's an indisputable fact.",
    "Human nature is fallen."
  ]
}