{
  "id": 2904,
  "mediaId": 237,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Fresh off McCarthy tongue-lashing, Cawthorn says he'll rally with Trump next week",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/594c7af/2147483647/strip/true/crop/2520x1323+235+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F62%2Fa2%2F4ae6a3324f33ae3ef6cc3c3d839b%2Fap22007795857114.jpg",
  "link": "https://www.washingtonexaminer.com/news/fresh-off-mccarthy-tongue-lashing-cawthorn-says-hell-rally-with-trump-next-week",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Scanlon",
  "authorUrl": "https://www.washingtonexaminer.com/author/kate-scanlon",
  "termIds": [
    1147,
    1404,
    1501,
    1609,
    1877,
    2303,
    254,
    428,
    2834
  ],
  "sentences": [
    "House Minority Leader Kevin McCarthy and House Minority Whip Steve Scalise met with Cawthorn this week about his claims, with the California Republican saying afterward that Cawthorn needs to earn back his trust and to straighten his life out.?\nCawthorn admitted in the meeting that his claim was exaggerated,? McCarthy said this week.",
    "Embattled Rep. Madison Cawthorn will speak at a rally with former President Donald Trump in North Carolina later this month after the freshman lawmaker set many in his own party against him with claims his colleagues engage in orgies and use cocaine.",
    "Cawthorn also recently faced criticism for calling Ukrainian President Volodymyr Zelensky a \"thug\" despite Russian President Vladimir Putin's invasion of Ukraine, and he was recently charged with driving with a revoked license.",
    "Despite being one of a group of House Republicans known for controversial comments, the scandal seemed to push Cawthorn into previously uncharted territory for his first term in Congress.",
    "Cawthorn outraged many of his Republican colleagues by claiming in a recent podcast interview that members of Congress invited him to an orgy and that he has seen lawmakers using cocaine.",
    "The rally will also feature Rep. Ted Budd, who is running in the state's Senate race, and Bo Hines, who is running in the newly redrawn 13th Congressional District.",
    "The show of support from Trump comes as Cawthorn finds himself increasingly at odds with members of his own party, many of whom condemned his comments as untrue.",
    "Tillis said in a statement that Cawthorn has \"fallen well short of the most basic standard western North Carolina expects from their representatives.\"",
    "Cawthorn wrote on Twitter that he is excited? for the April 9 rally in Selma, North Carolina.",
    "North Carolina Republican Sen. Thom Tillis this week endorsed Cawthorn's primary challenger.",
    "Some members even said their offices received calls from constituents about the claims."
  ]
}