{
  "id": 2917,
  "mediaId": 43,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "As Republicans fret over Cawthorn's drugs and orgies revelation, Trump gives him a platform",
  "image": "https://images.dailykos.com/images/921508/story_image/GettyImages-1304245882.jpg?1614365490",
  "link": "https://www.dailykos.com/story/2022/4/1/2089555/-As-Republicans-fret-over-Cawthorn-s-drugs-and-orgies-revelation-Trump-gives-him-a-platform",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    1147,
    1147,
    1862,
    1862,
    2087,
    2087,
    2303,
    2226,
    2226,
    1609,
    1609,
    428,
    428,
    2661,
    2661,
    2834,
    2851,
    2851,
    2834
  ],
  "sentences": [
    "Let's talk about Ukraine, midterm elections, and Biden's recovering approval ratings\nDaily Kos' The Brief\nFollowShare\n0:001:00:59\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nMeanwhile, top Republicans in North Carolina are maligning Cawthorn as an \"embarrassment\" (Sen. Richard Burr) who has demonstrated \"a consistent pattern of juvenile behavior, outlandish statements, and untruthfulness\" (Sen. Thom Tillis).",
    "After sleeping through four years of Donald Trump, a raft of colleagues cozying up to white nationalists, and a homegrown coup attempt directed at the U.S. seat of government, Republicans finally found something to care about when one of their own cast their party as a drug-laden, orgy-hungry group of scoundrels.",
    "Perhaps Rep. Madison Cawthorn's revelation about GOP sex parties and cocaine use hit a little too close to home, because this is apparently where the rubber meets the road for Republicans.",
    "x\nTrump, whose rallies have been a little low energy these days, decided a little youthful zip from Cawthorn might add some spunk to his April 9 rally in Selma, North Carolina.",
    "Trump, of course, can't wait to give Cawthorn a platform in the state, virtually guaranteeing that any Republican who hasn't heard about the controversy will now.",
    "Rep. Madison Cawthorn (R-NC) addresses the Conservative Political Action Conference being held in the Hyatt Regency on February 26, 2021 in Orlando, Florida.",
    "Minority Leader Kevin McCarthy quickly gave him a stern talking to, and his fellow North Carolina lawmakers are suddenly searching for primary opponents.",
    "Listen and subscribe to Daily Kos' The Brief podcast with Markos Moulitsas and Kerry Eleveld\nx\nx\nYou need to enable JavaScript to run this app.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Regardless of what Cawthorn says at the rally, Republicans are desperate to put this seedy episode behind them.",
    "x\nCawthorn implicated fellow Republicans, resulting in members getting questions from spouses and constituents.",
    "There is one person, however, who isn't concerned one bit about Cawthorn ratting out his colleagues: Trump.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "But not Trumphe's having a gay old time as GOP lawmakers reap what they sowed.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\n58.",
    "Here's what really has congressional Republicans ruffled.",
    "This is a short blurb about Daily Kos.",
    "But let's get down to brass tacks.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it.",
    "Kerry's back!",
    "Perfect."
  ]
}