{
  "id": 2918,
  "mediaId": 151,
  "date": "4/1/2022 12:00:00 AM",
  "headline": "Why Cawthorn got more GOP blowback than MTG",
  "image": "https://www.politico.com/dims4/default/03ef18b/2147483647/legacy_thumbnail/1200x800%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fbf%2Ff7%2Fd3eda08947818515883aca6b06d0%2Fgettyimages-1368471453-1.jpg",
  "link": "https://www.politico.com/newsletters/politico-nightly/2022/03/31/why-cawthorn-got-more-gop-blowback-than-mtg-00021909",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1090,
    1324,
    2087,
    2185,
    2303,
    2464,
    146,
    428,
    2942
  ],
  "sentences": [
    "That stance, which was first reported by POLITICO, led omnibus negotiators to keep the provision out of the bill that Congress passed earlier this month, which funds the government for the rest of fiscal 2022.\n LGBTQ advocates sue over Florida's Don't Say Gay' bill: A group of LGBTQ advocates, including organizations, students, parents and a teacher, sued Florida and the DeSantis administration in federal court today over recently passed parental rights legislation branded as the Don't Say Gay? bill by opponents.",
    "When with Trump, she was known to discuss news of the day, offer him a pep talk, the former official said, and basically kiss his ass and tell him he was doing a great job and was the greatest president.?\nThe question of just how influential Thomas actually is has taken on heightened significance in the wake of revelations about her messages to Meadows, Meridith McGraw and Daniel Lippman write.",
    "His own conference leader told reporters Wednesday that Cawthorn had climbed down in private, connecting his coke-sniffing talk to a faraway staffer in a parking garage.? Yet unless and until Cawthorn names names, as POLITICO was the first to report that some of his fellow Republicans want him to do, he is politically victimizing his entire party.",
    "The lawsuit contends that the legislation, which has sparked an uproar with opponents like The Walt Disney Co. and the Biden administration, is an unlawful attempt to stigmatize, silence and erase LGBTQ people in Florida's public schools.? It marks the first legal challenge for the high-profile measure that Republican Gov.",
    "After getting challenged by Regina, the high school queen bee played by Rachel McAdams, Tina Fey's teacher character, Ms. Norbury, asks the entire class: How many of you have been personally victimized by Regina George?? Nearly every student raises their hands, showing the damage done by Regina's gossiping.",
    " Treasury hits Russia with new sanctions targeting evasion networks, tech: The Biden administration announced new sanctions today aimed at major Russian technology companies and sanctions-evasion networks, and expanded its ability to level penalties on the aerospace, marine and electronics sectors.",
    "He will continue to perform his duties? from home and plans to return to the office after isolating for five days and testing negative.? Burns most recently saw Biden in a socially distanced meeting on Wednesday morning, during which Burns was wearing an N-95 mask, according to the CIA.",
    " Biden to tap oil reserves, press oil sector to hike production: Biden ordered the release of 1 million barrels of oil per day from the nation's strategic reserves and urged Congress to press the oil industry to increase drilling on federal lands in a bid to tame high gasoline prices.",
    "But as the rocket maker gears up for the new competition, it's also working behind the scenes to combat the Vermont Independent's assault on its possible role in NASA's public-private partnership to land on the moon by 2025, according to Blue Origin officials and congressional staff.",
    "When Cawthorn told a podcast interviewer that Washington is riddled with sexual perversion,? suggesting that some of his own colleagues have invited him to an orgy? and used cocaine in front of him, he did more than implicate the entire GOP conference in possible immorality.",
    "That's in part because of her own implication in broad, nefarious allegations by a few House Democrats, who have raised the explosive charge that some of their GOP colleagues may have conducted reconnaissance tours? of the Capitol before the Jan. 6 insurrection.",
    "Why Cawthorn got more GOP blowback than MTG\nBy ELANA SCHOR\n03/31/2022 08:00 PM EDT\nPresented by\nSTOP TRYING TO MAKE KEY BUMPS' HAPPEN  Near the end of the millennial classic Mean Girls,? there's a scene that tells us a lot about House GOP politics right now.",
    "The sanctions, which follow penalties on Russia's defense industry last week, are part of a broader administration effort to restrict the country's access to resources it needs to supply and finance its invasion of Ukraine, the Treasury Department said.",
    "When news broke last week that Virginia Ginni? Thomas had texted White House chief of staff Mark Meadows, imploring him to overturn the 2020 election results to keep Donald Trump in power, it sent shockwaves through Washington, D.C.",
    "And depending on who you talk to in Trumpworld, she was the type of over-eager, well-connected D.C type that every administration must deal with, or a serious player who helped maintain the political coalition that elevated Trump.",
    " Sanders looks to shoot down Bezos' moon plans: Jeff Bezos' space company is back in the running to return NASA astronauts to the moon, but Sen. Bernie Sanders wants him to do it without using taxpayer money.",
    "After all, he's not the only conservative whose antics off the floor have distracted from House Republicans' attempts to project unity and substance as they prepare for a likely takeover of the chamber.",
    "She noted that lawmakers from both sides of the aisle on the Senate Agriculture Committee, which she chairs, were surprised by the minority leader's stiff opposition in the final days of omnibus talks.",
    "The move comes after Republican leadership objected to extending the flexibility in a recent spending bill  a surprise move that enraged school leaders and anti-hunger advocates across the country.",
    "Rep. Marjorie Taylor Greene (R-Ga.) harassed a Democratic lawmaker during debate over an LGBTQ rights bill and likened Covid public health requirements to the Holocaust, among other behavior.",
    "While he's hardly the most popular guy in the Capitol  in fact, he's nearly the opposite  26-year-old Rep. Madison Cawthorn (R-N.C.) is having a Regina-like effect on his party right now.",
    "The move is the latest attempt by the White House and Democrats to temper the volatile oil markets that drove gasoline prices to all-time highs in the weeks since Russia invaded Ukraine.",
    "Among them were friends of the couple, members of her right-wing network of activists and operatives at Groundswell, and people Thomas believed would be unfailingly loyal to Trump.",
    "I put her in the category of her husband is a big deal and she can't be doing too much damage,'? said one former senior White House official, who recalled seeing Thomas with Trump.",
    " CIA director tests positive for Covid-19: William Burns, who is fully vaccinated and boosted? against the virus, has experienced mild symptoms,? the CIA said in a news release.",
    "Even so, we should remember what happens to the victimizer Regina at the end of ?Mean Girls?: She's welcomed back and given a piece of the heroine's Spring Fling Queen tiara.",
    "Greene and Gosar should be much easier intra-party targets, having appeared at a conference organized by white nationalists in addition to their other objectionable forays.",
    "The problem: Democrats have already dealt that duo the harshest punishment that Republican leaders could effectively apply, by stripping them of their committee spots.",
    "Depending on who you ask in Washington, Thomas is either a political powerhouse or a harmless busybody with too much time on her hands and access to too big a Rolodex.",
    "Part gadfly, part name dropper, and a major D.C. fixture, she was known by Trump officials for sharing the names of people she wanted hired and fired by the president.",
    "Debbie Stabenow (D-Mich.) and Lisa Murkowski (R-Alaska) introduced a bill that would allow the nation's schools to serve free meals to all students for another year.",
    "Sure, House Minority Leader Kevin McCarthy could have been louder and angrier than he was in public about Greene and Gosar's flirtation with white nationalists.",
    "More than anything, she was eager to help connect people in the White House with her vast conservative network, according to multiple former White House aides.",
    "But when it came to specific punishment, Democrats' decision to take Greene and Gosar's committee spots left the GOP leader with no real arrows in his quiver.",
    "If Cawthorn can survive his own colleagues' support for his primary challenger and get reelected, he'll hang onto his own small piece of the House GOP crown.",
    "And the day of open debate over whether Cawthorn could claim to not know what cocaine was while using the drug-savvy term key bump? will be a distant memory.",
    "The Regina factor is the chief reason Cawthorn is on the outs with his party right now, while his three lightning-rod colleagues are seen differently.",
    "Blue Origin got a second chance last week to compete for a contract to develop a lunar lander after it lost out to rival Elon Musk's SpaceX last year.",
    "Thomas, a conservative activist and the wife of Supreme Court Justice Clarence Thomas, was a familiar name among staffers in the Trump West Wing.",
    "Boebert is an easier-to-defend figure for some of her colleagues, as Islamophobic as her past comments were and as much as Democrats despise her.",
    "He also made it in bounds for reporters and voters to ask his colleagues tense questions about how they spend their evenings in Washington.",
    "Follow us on Twitter\nChris Suellentrop @suellentrop\nTyler Weyant @tweyant\nRenuka Rayasam @renurayasam\nMyah Ward @myahward\nFollow Us",
    "Greene has occasionally slammed her own in the GOP, but she reserves her harshest rhetoric for Democrats, as do Boebert and Gosar.",
    "It was notable, then, to hear McCarthy warn on Wednesday that a loss of committee assignments wasn't off the table for Cawthorn.",
    "The intensity of the Republican outcry against Cawthorn has come as something of a surprise to even keen observers of Congress.",
    "Rep. Lauren Boebert (R-Colo.) suggested on video, twice, that a Muslim Democratic lawmaker was a terrorist.",
    "She occasionally visited with Trump at the White House, officials say, and would offer words of flattery.",
    "Rep. Paul Gosar (R-Ariz.) posted an anime video showing himself killing yet another Democratic lawmaker.",
    "Except that no evidence has emerged so far to support a claim that implicates Boebert by association.",
    "Those Democrats' remarks were seen as alluding to Boebert  who led a Jan. 5 tour of the building.",
    "Greene, Boebert and Gosar don't antagonize their fellow Republicans as broadly and directly.",
    "The Republican Jewish Coalition is backing her GOP primary challenger, Jennifer Strahan.",
    " Senators revive school lunch debate with bill to extend universal free meals: Sens.",
    "Few people in the Capitol believe Cawthorn is telling anything close to the truth.",
    "Also notable: Greene is not getting a free intraparty pass to reelection, either.",
    "Or contact tonight's author at eschor@politico.com, or on Twitter at @eschor.",
    "Senator [Mitch] McConnell said no,'? Stabenow recounted in an interview.",
    "But not quite as much so for veterans of the Trump administration.",
    "Reach out with news, tips and ideas at nightly@politico.com.",
    "Nightly Number\nParting Words\nPOWERHOUSE OR GADFLY?",
    "Did someone forward this email to you?",
    "Ron DeSantis signed into law Monday.",
    "But finding an answer isn't easy.",
    "Welcome to POLITICO Nightly.",
    "What'd I Miss?",
    "Sign up here."
  ]
}