{
  "id": 2921,
  "mediaId": 237,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "Roger Stone defends Madison Cawthorn, claims orgies and drug abuse not uncommon in DC",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/cbc44b5/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F60%2F2e%2F32af0b964a989d6808135e90e2c8%2Fap-19032095169802.jpg",
  "link": "https://www.washingtonexaminer.com/politics/roger-stone-defends-madison-cawthorn-says-orgies-and-drug-abuse-not-uncommon-in-dc",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Juliegrace Brufke",
  "authorUrl": "https://www.washingtonexaminer.com/author/juliegrace-brufke",
  "termIds": [
    1147,
    1237,
    1609,
    1877,
    2226,
    2303,
    2341,
    68,
    428,
    2834
  ],
  "sentences": [
    "Kevin McCarthy has no sway over him  take away committee assignments,\" Stone continued, \"but if they did so over this, all they'd be doing is underscoring the fact that these parties and drug abuse do happen, and they are desperate to cover it up.?\nTwo sources familiar with House GOP leadership's conversation with Cawthorn told the Washington Examiner that the North Carolina Republican admitted the accusation of cocaine use among lawmakers was exaggerated but stood by his accusation that a member invited him to partake in an orgy, though he would not name names.",
    "Cawthorn's comments  which were made during an appearance on the Warrior Poet Society podcast, where he was asked if Congress was similar to the Netflix hit House of Cards  sparked fury within the House GOP conference, leading House Minority Leader Kevin McCarthy and other members of leadership to meet with the 26-year-old lawmaker Wednesday.",
    "Stone, a longtime adviser to former President Donald Trump, said he plans to campaign against Tillis in response to his rebuke of Cawthorn and believes McCarthy's calls for Cawthorn to retract his claims could have a negative effect in terms of support for his speaker bid with conservative hardliners.",
    "Now I have to go to North Carolina and campaign for Thom Tillis's primary opponent because Donald Trump and Madison Cawthorn are more popular with the grassroots in North Carolina than Thom Tillis will ever be, never mind the other RINO there, Richard Burr.",
    "Just In...\nRoger Stone defended embattled Rep. Madison Cawthorn, who has come under fire from his GOP colleagues for alleging that lawmakers engage in orgies and use cocaine, noting that the North Carolina Republican has not publicly walked back his claims.",
    "Multiple GOP lawmakers said they are highly skeptical of Cawthorn's claims, noting he has been embroiled in multiple other controversies since taking office and voiced frustrations about constituents calling with concerns in the wake of his remarks.",
    "Stone said he spoke with Cawthorn after the controversy emerged, adding that he believes if leaders opt to pursue disciplinary action against the freshman lawmaker over his claims, it could lead to negative political repercussions for McCarthy.",
    "We don't know how large the swing group is, so if they take control of the House by 10 votes, then all you need is 11 people to hang together and say, 'No, we're not voting for Kevin McCarthy under any circumstance,'\" Stone added.",
    "Republican Sen. Richard Burr told reporters he believes Cawthorn has \"been an embarrassment at times\" to the party, and Republican Sen. Thom Tillis went as far as endorsing one of Cawthorn's primary opponents.",
    "I mean, let Cawthorn speak for himself  not Kevin McCarthy or Steve Scalise,? Stone said in an interview, adding that he witnessed similar conduct to what Cawthorn alleged during his time in Washington.",
    "\"And I can see why Washington elites would now be scrambling to try to deny it because maybe the voters back home won't like what they're hearing.?\nDoes anyone really believe that that doesn't happen?",
    "Now then, when he comes to tell me, he says no  he thinks he saw maybe a staffer in a parking garage from 100 yards away and tells me that he doesn't know what cocaine is,? McCarthy said.",
    "As someone who lived in Washington, D.C., for 41 years, who was once part of the Washington elite system, everything Madison Cawthorn says is absolutely true,\" Stone said.",
    "But Stone asserted that the North Carolina Republican is standing by his story despite calls for his removal from committees and support for primary challenges.",
    "Few GOP lawmakers have been willing to defend Cawthorn amid the controversy, with both North Carolina senators publicly speaking out against his claims.",
    "I know for a fact these things happened when I lived there prior to  and this is important  prior to the reaffirmation of my belief in Jesus Christ.",
    "He told me he was not backing down from his claims, as I reported that on social media, so I take him at his word.",
    "Following the meeting, McCarthy told reporters Cawthorn admitted to leaders that he embellished his allegations.",
    "All we have is McCarthy's version of the conversation, and nothing Kevin McCarthy says can be believed.",
    "I could identify 25 House candidates today who won't vote for Kevin McCarthy under any circumstances.",
    "I predict that Republicans will take the House, but Kevin McCarthy will not be speaker,? he said.",
    "The elites are circling the wagons  the people who are attacking him are the elites.",
    "I would, first of all, recognize he works for the people back in North Carolina.",
    "That doesn't mean they will all get elected, but some subset of them will.?",
    "But I know firsthand that what Cawthorn says is true  it's true,? he added.",
    "I'm a different person than I was when I lived in Washington.",
    "In the interview, he claims he watched people do cocaine.",
    "\"So a minority within the majority could drive the train.",
    "In Washington, in Hollywood, in New York, among elites?",
    "He does not work for Kevin McCarthy,? he said.",
    "I mean, it is  it defies logic.",
    "I saw these things up close.",
    "We communicated only once.",
    "Why would we believe him?",
    "..."
  ]
}