{
  "id": 2925,
  "mediaId": 195,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "The Hill's 12:30 Report  Cawthorn creates headaches for Republicans",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/03/Cawthorn_01072021_AP-House.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/3068996-the-hills-1230-report-cawthorn-creates-headaches-for-republicans/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    933,
    1223,
    1501,
    1609,
    2303,
    428,
    511,
    2782,
    2942
  ],
  "sentences": [
    ": The protest failed to accomplish any of its stated demands and recently saw dwindling numbers, fractures among supporters, pushback from local residents and activists and road blockages from D.C. police.?\nThe full story: https://wapo.st/3NCdpve\nINTERESTING READ\nFlooring the immigration process for some:\nVia The Hill's Rebecca Beitsch, The Russian invasion of Ukraine has shown the extent the U.S. can marshal its immigration resources to be a safe haven for those in need  when it wants to.? https://bit.ly/3qSDzjv\nThe situation: In the month since the Russian invasion began, the U.S. has offered Temporary Protected Status (TPS) to Ukrainians, allowing those already here to remain without fear of deportation  The U.S. government also waived the Title 42 prohibition on seeking asylum for Ukrainians who present themselves at the border.",
    "Livestream: https://bit.ly/36NPnN4\nIN WASHINGTON, D.C.\nDMV residents, you may have your roads back:\nVia The Washington Post's Ellie Silverman, The group of truckers calling themselves the People's Convoy,' which protested vaccine mandates and other right-wing grievances by driving around the D.C. region for more than three weeks, left its Western Maryland home base Thursday morning to head across the country to challenge proposed coronavirus vaccine and health-related bills in California.? https://wapo.st/3NCdpve\nWas it successful?",
    "And President Biden has pledged to take in 100,000 Ukrainians over the next several years.?\nThe double standard critics see: https://bit.ly/3qSDzjv\nBORDER SURGE SPELLS TROUBLE FOR BIDEN, DEMOCRATS':\nRead Niall Stanage's full column in The Hill: https://bit.ly/3DtbVPp\nLATEST WITH COVID-19\nCASE NUMBERS:\nCoronavirus cases in the U.S.: 80,058,164\nU.S. death toll: 979,879\nBreakdown of the numbers: https://cnn.it/2UAgW3y\nVACCINATION NUMBERS:\nTotal number of vaccinations administered in the U.S.: 560 million shots have been given.",
    "Also says Cawthorn admitted his orgy & cocaine allegations were exaggerated/untrue.?\nMadison Cawthorn has been a big headache for his party:\n[Rep. Madison Cawthorn (R-N.C.),] the 26-year-old first-term lawmaker has been a minor irritation to some Republicans since he joined the House in 2021, but the most recent remarks have put tempers at the boiling point for House Republicans.?\nOh and: Cawthorn is also facing an eight-way Republican primary for his seat.",
    "On Tuesday, White House communications director Kate Bedingfield had her turn at the mic and then came back for a second day on Wednesday.?\nMore on who could potentially replace Psaki: https://bit.ly/3uGPguM\nBREAKING  Biden hits the release' button:\nVia The Hill's Rachel Frazin and Morgan Chalfant, The White House just announced that it will release 1 million barrels of oil a day from the U.S.'s strategic reserve.",
    ":\nVia The Hill's Amie Parnes and Alex Gangitano, When White House press secretary Jen Psaki and her deputy Karine Jean-Pierre tested positive for COVID-19 in recent days, a number of other staffers suddenly had the chance to effectively audition for the post.? https://bit.ly/3uGPguM\nWhy this is worth mentioning: Psaki has said she would only serve as press secretary for about a year.",
    "Screenshots of the clip, via @sarahccaldwell  it has more than 373,000 likes so far: https://bit.ly/3DsudQv\n^ If you're nosey like me: Here's the full Architectural Digest house tour: https://bit.ly/3u3PrS1 g\nThese emails always make me feel so special:\nThe Washington Post's Dave Jorgenson tweeted a screenshot of a reporter's ~favorite~ type of personalized pitch email.",
    "The Hill's 12:30 Report: Cawthorn creates headaches for Republicans\nIN CONGRESS\nIf you've seen references to orgies on social media and are wondering what happened with your algorithm:\nIn a recent interview, Rep. Madison Cawthorn (R-N.C.) claimed that lawmakers have invited him to orgies  and that he has seen lawmakers do cocaine in front of him.",
    "More on how Cawthorn's antics miff the GOP, via The Hill's Emily Brooks: https://bit.ly/3tWyVmM\n^ IT ISN'T JUST THE ORGY & COCAINE COMMENTS  CAWTHORN HAS BEEN SKATING ON THIN ICE WITH HIS PARTY:\nRemember when Cawthorn called Ukrainian President Volodymyr Zelensky a thug? amid the Russian invasion of Ukraine?",
    "Video: https://bit.ly/3Dz4vdh\nCawthorn met with House Minority Leader Kevin McCarthy (R-Calif.) yesterday: Via CNN's Melanie Zanona, McCarthy says he told Madison Cawthorn  that the freshman has lost his trust and he needs to take steps to turn his life around, or else there could be consequences.",
    "To view past editions of The Hill's 12:30 Report, click here: https://bit.ly/30ARS1U\nTo receive The Hill's 12:30 Report in your inbox, please sign up here: https://bit.ly/3qmIoS9\n> A midday take on what's happening in politics and how to have a sense of humor about it.",
    "Who else has had a chance: Deputy press secretary Chris Meagher stepped up to the podium on March 22, minutes after it was announced that Psaki had been sidelined by the virus.?\n^ Plus: Days later, deputy press secretary Andrew Bates appeared before reporters.",
    ": https://bit.ly/38aHwJT\n[EM1]As an avid reader and hoarder of books, this causes me physical pain\nThe Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "President Biden and Vice President Harris are in Washington, D.C.\n10:15 a.m. EDT: President Biden and Vice President Harris received the President's Daily Brief.",
    "Sign up here to receive The Hill's 12:30 Report in your inbox daily: https://bit.ly/3qmIoS9\nIN THE WHITE HOUSE\nOpen mic night at the podium!",
    "Remember that the Ukrainian government is incredibly corrupt and is incredibly evil and has been pushing woke ideologies.?\nIt's Thursday.",
    "Send comments, story ideas and events for our radar to cmartel@thehill.com  and follow along on Twitter @CateMartel and Facebook.",
    "Seven-day average of doses administered: An average of 78,746 doses\nFor context: The U.S. population is roughly 331 million.",
    "Livestream: https://bit.ly/36NPnN4\n3 p.m. EDT: White House communications director Kate Bedingfield holds a press briefing.",
    "WHAT TO WATCH:\n1:30 p.m. EDT: President Biden delivers remarks on energy prices amid the Russian-Ukrainian conflict.",
    ": For six months\nWhy: To offset the skyrocketing oil and gasoline prices amid the Russian invasion of Ukraine.",
    "Watch the clip that started the controversy: From Cawthorn's appearance on the Warrior Poet Society? podcast.",
    "Happening at 1:30 p.m. EDT: Biden is scheduled to deliver remarks this afternoon to discuss energy prices.",
    "The House's full agenda today: https://bit.ly/3qTKLfh\n1:45 p.m. EDT: A cloture vote in the Senate.",
    "https://bit.ly/3Lr09aU\nCawthorn said at the time in a video: Remember that Zelenskyy is a thug.",
    "The Senate's full agenda today: https://bit.ly/35q74le\n1:15 p.m. EDT: First votes in the House.",
    "She explains how she filled the floor-to-ceiling bookshelves in a short period of time.",
    "Keep in mind: This is the largest-ever release from the U.S.'s strategic oil reserve.",
    "Breakdown of the numbers: https://bloom.bg/3iVTPLH\nNOTABLE TWEETS:\nWait, wait, what?!",
    ":\nActor and singer Ashley Tisdale gave a tour of her house to Architectural Digest.",
    "Livestream: https://bit.ly/3uLM5C0\nIN LIGHTER NEWS:\nToday is National Clam Day.",
    "I'm Cate Martel with a quick recap of the morning and what's coming up.",
    "Political operatives are starting to think he could lose his seat.",
    "Photo: https://bit.ly/35rxt2d\nON TAP:\nThe House and Senate are in.",
    "11:45 a.m. EDT: Two judicial confirmation votes in the Senate.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "The gist: She and her husband bought 400 books at once.",
    "https://bit.ly/3qRDYCU\nHow long will this last?",
    "And because you read this far, here is nothing.",
    "4 p.m. EDT: Last votes in the House.",
    "Habreaks down crying hysterically.",
    "Did someone forward this to you?",
    "Want your own copy?",
    "Just keep driving.",
    "Nothing to see.",
    "Sniff.",
    "Hahah.",
    "Sniff.",
    "*\n*Ha.",
    "Haha.",
    "Haha."
  ]
}