{
  "id": 2932,
  "mediaId": 195,
  "date": "3/31/2022 12:00:00 AM",
  "headline": "The Hill's Morning Report  Some brighter news for Biden?",
  "image": "https://i0.wp.com/thehill.com/wp-content/uploads/sites/2/2022/03/mr_bidenjoe-outbreak_033022_ap-patrick-semansky.jpg?w=2000&ssl=1",
  "link": "https://thehill.com/news/morning-report/3011962-the-hills-morning-report-some-brighter-news-for-biden/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger/",
  "termIds": [
    2347,
    2347,
    2087,
    2087,
    2030,
    2034,
    2034,
    2030,
    1765,
    1765,
    1464,
    1464,
    1026,
    1026,
    812,
    812,
    571,
    571,
    577,
    577
  ],
  "sentences": [
    "Separately in the Senate (and less upbeat for Democrats), Senate Minority Leader Mitch McConnell (R-Ky.) defended Justice Clarence Thomas, who is being urged by the left to recuse himself from any future decisions involving the Jan. 6 Capitol attack because his wife, Ginni Thomas, lobbied the White House after Biden's election victory to try to keep former President Trump in office.",
    "When asked about the remarks, Grahamrepeated that oft-made opinion that Putin needs to go.? Pressed further about Trump's statement and whether it was appropriate, the ally of the former president added, That would not be something that I would do, no.?\nTrump was referencing a 2020 Senate GOP report on the president and his son that resulted in little proof of wrongdoing.",
    "That story has repeated itself again as House Minority Leader Kevin McCarthy (R-Calif.) told reporters on Wednesday that he may take further action to condemn Rep. Madison Cawthorn (R-N.C.), who conceded that he exaggerated? in saying recently that GOP members invited him to orgies and that he saw them doing cocaine regularly (The Hill).",
    "ELSEWHERE\n? CORONAVIRUS: Total U.S. coronavirus deaths each morning this week: Monday, 976,704; Tuesday, 977,688; Wednesday, 978,692; Thursday, 979,870.  COVID-19 deaths last week were up 40 percent worldwide even as cases of infection fell (potentially because of less testing), according to the World Health Organization (The Hill).",
    "? PRETEND SECURITY: Bloomberg News reported on Wednesday that hackers impersonating law enforcement with requests for data not requiring court orders succeeded in getting Apple and Facebook's parent Meta to turn over requested customer data last year that included personal details such as addresses, phone numbers and IP addresses.",
    "A number of White House and administration officials made that point on Wednesday, pointing to declassified U.S. intelligence, saying that there appears to be increased tension between Putin and the Russian Defense Ministry, which includes some who used to be considered key members of the Russian president's inner circle.",
    "Senate Budget Committee Chairman Bernie Sanders (I-Vt.) may yearn to boost the nondefense side of the federal ledger, but Biden is worried about a high-stakes war in Ukraine and U.S. commitments to NATO, midterm elections and related advice to move to the political center, reports The Hill's Alexander Bolton.",
    "Mother of the Bride?\nMaid in Manhattan?\nMonster-in-Law?\nThe Wedding Planner?\nCaptain Jack Sparrow, played by Johnny Depp, receives more than one face slap in 2003's Pirates of the Caribbean: The Curse of the Black Pearl.? His slurred retort as a prostitute sends his head spinning with a fierce whack: ______.",
    "With regard to President Putin, look, what I can tell you is this, and I said this before, one of the Achilles' heel of autocracies is that you don't have people in those systems who speak truth to power or who have the ability to speak truth to power,? Secretary of State Antony Blinken said in Algiers.",
    " The administration on Wednesday launched COVID.gov, a new one-stop locator website first described by Biden during his State of the Union address to help Americans find COVID-19 vaccines, tests, treatments and masks as well as updates about COVID-19 infections detected in their areas (NPR).",
    "In her statement, Collins criticized the contemporary Supreme Court confirmation process as broken? by what she called the disturbing trend? of bowing to politics and ideology, rejecting deference to presidents, and an underemphasis on nominees' experience, qualifications and integrity.",
    "Not sure I deserved that.?\nI meant to write.?\nI missed you, too.?\nOuch.?\nIn a 1980 film gag, a traveler begins to panic during an impending disaster while everyone nearby joins the get-a-hold-of-yourself? responses with slaps, shakes, baseball bats, boxing gloves and weapons.",
    "That's progress, but it's also less than the $15.6 billion that was yanked out of this month's government funding law because of partisan differences with House Democrats over whether appropriations for COVID-19 remained unspent and could be tapped to trim the price tag.",
    " The Los Angeles City Council voted on Wednesday to end its mandate for many indoor businesses and the operators of large outdoor events to verify COVID-19 vaccination among customers, joining a wave of large U.S. cities that have done the same (The Associated Press).",
    "Lindsey Graham (R-S.C.) and Lisa Murkowski (Alaska) backed Jackson for previous judicial positions, but Graham has all but said he will be a no for the high court, and Murkowski, who is seeking reelection and faces a primary contest, appears to be on the fence.",
    "As The Hill's Julia Manchester notes, the topic is growing in GOP discussions, with University of Pennsylvania swimmer Lia Thomas's NCAA Division 1 national championship, the first won by an openly transgender athlete, serving as a flashpoint for the party.",
    "IN FOCUS/SHARP TAKES\nPOLITICS: Once again, Trump has members of his own party on their heels after he pleaded for Putin to release damaging information about Hunter Biden and the Biden family for the purported political benefit of the ex-president.",
    "The president today will speak about pump prices and may describe his decision to release up to 1 million barrels of oil per day from the U.S. Strategic Petroleum Reserve, a technique to try to temporarily depress prices (The Associated Press).",
    "The latest set of comments, which Trump made in an interview with a discredited far-right commentator, created a variation of that situation, creating yet another headache for the GOP as they seek to retake control of Congress later this year.",
    "Several energy company chief executives will testify next week to House committees about disparities between rising gasoline prices at the pump and petroleum prices on the world market, which have eased from earlier peaks (The Hill).",
    "CVS will pay $484 million, Teva will pay about $177 million and Allergan will pay more than $134 million to resolve claims of their alleged roles in the opioid epidemic, according to state Attorney General Ashley Moody (The Hill).",
    "And you can't just say You can't do this again.' I mean, he's got a lot of members very upset.?\nThe California Republican added that Cawthorn admitted that some of his remarks were untrue during a recent interview on a podcast.",
    "Throughout Trump's presidency, nothing annoyed Republicans on Capitol Hill more than questions involving the phrase, the president tweeted this today,? with reporters seeking comment on the most recent presidential craziness.",
    "The remarks by the cadre of administration officials come as hopes for a negotiated cease-fire between the two sides fade rapidly following Moscow's decision to strike areas where it said it would scale back military efforts.",
    "LEADING THE DAY\nUKRAINE CRISIS: The Biden administration on Wednesday said that intelligence shows that Putinis being misled? by his advisers and the Russian military over their struggles to make further inroads in Ukraine.",
    "As The Hill's Morgan Chalfant and Brett Samuels report, the White House viewed the Russian declarations with a hefty dose of skepticism and was not surprised at all by the fresh attacks reported near Kyiv and Chernihiv.",
    " And so the fact that he may not have all the context  that he may not fully understand the degree to which his forces are failing in Ukraine, that's a little discomforting, to be honest with you? (The New York Times).",
    "Second, tension is evident between Russian President Vladimir Putin and his defense advisers over Ukraine, according to U.S. intelligence, and Putin comprehends the impact of global sanctions Biden helped put in place.",
    "Kristi Noem (R), a potential 2024 candidate, has also focused on the issue, having rolled out an ad of her own promoting legislation that would block transgender girls from playing on female sports teams at school.",
    "Forget about it.?\nSnap out of it.?\nYou're dead to me.?\nCall me Saturday.?\nJennifer Lopez's character gets into a slapfest with her soon-to-be mother-in-law, played by Jane Fonda, in the 2005 romantic comedy ______.",
    "And I think that is something that we're seeing in Russia.?\nKate Bedingfield, the White House communications director, and John Kirby, the Pentagon's press secretary, made similar points on Wednesday (The Hill).",
    "? CITY WATCH: America's largest cities registered a surprisingly big population decline in the last year, and even cities that still added residents, such as Phoenix and Houston, saw their growth rates plummet.",
    "Ukrainian President Volodymyr Zelensky said in his nightly address on Wednesday that Russia's invasion has reached a turning point,? featuring increased fighting in the Donbas region and other locales (Axios).",
    "Sen. Susan Collins (R-Maine) told The New York Times in a Tuesday interview and a Wednesday statement that she will back Jackson to succeed Justice Stephen Breyer, who will retire this summer.",
    "All Senate Democrats are expected to vote to confirm Jackson, the first Black woman nominated to the high court, as the Senate Judiciary Committee speeds ahead with a planned vote next week.",
    "Taken aback by Sunday's ugly hand-to-face strike during the Oscars, we're eager for some smart guesses (or YouTube research) about some vintage scripted cinematic slaps that made their mark.",
    "The Hill's Reid Wilson writes that the latest population drops in cities were more directly attributable to the fallout from COVID-19, raising the question: Is the era of the big city over?",
    "In a huge win for the president and an end to spring suspense, Supreme Court nominee Ketanji Brown Jackson can count on at least one vote from a Senate Republican for her confirmation.",
    "On Capitol Hill, the administration has worked for weeks to get additional COVID-19 funding through Congress to pay for vaccines, treatments and other costs as the pandemic continues.",
    "? LEGAL CORNER: Florida announced on Wednesday a $860 million settlement agreement with CVS, Teva and Allergan, ending the state's opioid lawsuit against the pharmaceutical companies.",
    "? Trouble in paradise: It's an age-old tale: a House Republican leader having trouble corralling the furthest-right members of their caucus for saying stuff considered out of bounds.",
    "And when I sit down with him  I told him you can't make statements like that, as a member of Congress, that affects everybody else and the country as a whole,? McCarthy said(Axios).",
    "And finally, there's nothing like being 79, president, not testing positive for COVID-19 and receiving a second booster vaccine dose, which Biden did with a big smile on Wednesday.",
    "? 2022 watch Republicans are revving up the culture wars debate, specifically over transgender women in sports in a bid to animate base voters ahead of the midterm elections.",
    " U.S. states have opted to close mass testing and vaccination sites, although coronavirus infections in the U.S. are predicted to surge again this year (The New York Times).",
    "The Organization of Petroleum Exporting Countries and suppliers such as Russia meet today by teleconference to discuss the global petroleum situation (The New York Times).",
    "The White House daily press briefing is scheduled at 3 p.m. Bedingfield will once again fill in for White House press secretary Jen Psaki, who is sidelined with COVID-19.",
    "Biden is under fire from his left for trying to increase defense spending next year when money for social and environmental programs favored by liberals remains in limbo.",
    "That $5 billion piece could be easily part of the package, but they are just reluctant to repurpose funds, and there's a whole pile of them sitting out there,? he added.",
    "But Democrats, according to a new Quinnipiac University Poll, point to the war in Ukraine and international sanctions as well as the pricing policies of oil companies.",
    "The House Budget Committee will hear testimony at 10 a.m. from Health and Human Services Secretary Xavier Becerra about the president's fiscal 2023 budget blueprint.",
    "Kirby added that the Department of Defense believes that Putin has not been shown a true, detailed layout of the Russian army's failures in the neighboring nation.",
    "The Hill's Jordain Carney reports that $10 billion is the operative figure going back and forth today between the parties, according to Sen. John Thune (R-S.D.",
    "https://bit.ly/3IRMmsk\nWHERE AND WHEN\nThe House meets at 10 a.m. Speaker Nancy Pelosi (D-Calif.) will answer reporters' questions at 10:45 a.m. in the Capitol.",
    "What is being lost, to the detriment of the nation, Collins said, is confidence in the independence and integrity of the judiciary.?\nCollins, and GOP Sens.",
    "We would concur with the conclusion that Mr. Putin has not been fully informed by his Ministry of Defense, at every turn over the last month,? Kirby said.",
    "Ohio Senate candidate Jane Timken invoked Thomas in a campaign ad critical of rules allowing transgender women being allowed to compete in women's sports.",
    "The Senate Finance Committee at 10 a.m. will question U.S. Trade Representative Katherine Tai about the administration's China and Russia trade policies.",
    "As The Associated Press notes, the comments were made with the hope that Putin will reassess the situation in Ukraine and reconsider his options.",
    "It appears his Supreme Court nominee will be confirmed by the Senate with a fig leaf of bipartisanship, thanks to at least one pledged GOP vote.",
    "In the 1987 romantic comedy Moonstruck,? the character played by Cher famously says ______ when she slaps the character played by Nicholas Cage.",
    "The president and Vice President Harris receive the President's Daily Brief at 10:15 a.m. Biden will deliver remarks on gas prices at 1:30 p.m.",
    "The data may have been used by the hackers to engage in financial fraud schemes or harassment campaigns, according to Bloomberg (The Hill).",
    "There's a lot of different things that can happen,? McCarthy told reporters following a meeting with the 26-year-old far-right lawmaker.",
    "As The Hill's Emily Brooks writes, Cawthorn's comments are only the latest instance of him becoming a thorn in the side of leadership.",
    "The Senate convenes at 10 a.m. and will resume consideration of the motion to proceed to the legislative vehicle for COVID-19 funding.",
    "Poseidon Adventure?\nClue?\nWeekend at Bernie's?\nAirplane!?\nMorning Report is created by journalists Alexis Simendinger and Al Weaver.",
    "After a decade of rural population shrinkage, urban decline is startling, but it actually became evident years before the pandemic.",
    "g Hill.TV's Rising? program features news and interviews at http://thehill.com/hilltv, on YouTube and on Facebook at 10:30 a.m.",
    "He drilled further down on his comments on Wednesday, saying that Russia may be willing to give that information? (The Hill).",
    "If Mr. Putin is misinformed or uninformed about what's going on inside Ukraine, it's his military, it's his war, he chose it.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "I just told him he's lost my trust, he's gonna have to earn it back, and I laid out everything I find is unbecoming.",
    "Email your responses to asimendinger@thehill.com and/or aweaver@thehill.com, and please add Quiz? to subject lines.",
    "I have decided to support the confirmation of Judge Jackson to be a member of the Supreme Court,? Collins said.",
    "McConnell described the criticism of the justice as clumsy bullying from the political branches? (The Hill).",
    "The Hill: Ukraine's supporters lean on cryptocurrency to help fund its defense and aid humanitarian efforts.",
    "OPINION\nBorder surge spells trouble for Biden Democrats, by Niall Stanage, White House columnist, The Hill.",
    "But Western officials warn that Russian actors could use cryptocurrency to try to weaken global sanctions.",
    "We get you up to speed on the most important developments in politics and policy, plus trends to watch.",
    "https://bit.ly/3wRr77E\nBiden's budget won't save Democrats, by Liz Peek, opinion contributor, The Hill.",
    "We have very little control over what the former president says, obviously,? Thune told reporters.",
    "McConnell will speak in person with Punchbowl News journalists during a newsmaker event at 9 a.m.",
    "THE CLOSER\nAnd finally  It's Thursday, which means it's time for this week's Morning Report Quiz!",
    "We invite you to share The Hill's reporting and newsletters, and encourage others to SUBSCRIBE!",
    "Winners who submit correct answers will enjoy some richly deserved newsletter fame on Friday.",
    "The reserve exists to address supply shortages and disruptions; drawdowns are not frequent.",
    "So it's dropped down to the size that they were willing to pay for,? Thune told The Hill.",
    "The New York Times: Toll on civilians and global economy grows as war enters sixth week.",
    "I don't think the Dems would agree to offsets that would allow them to cover that.",
    "The Wall Street Journal: Russia plays down peace talks, steps up eastern assault.",
    "g Introducing NotedDC: The Hill's curated commentary on the beat of the Beltway.",
    "Please recommend the Morning Report to friends and let us know what you think.",
    "Only weeks prior, he labeled Zelensky a thug,? another remark he walked back.",
    "Whether other Republicans join the Maine moderate remains unclear.",
    "Republicans and independents think Biden's policies are to blame.",
    "The Hill: Trevor Reed's parents meet with Biden at White House.",
    "Readers can find us on Twitter @asimendinger and @alweaver22.",
    "In Asia, cases of COVID-19 now surpass 100 million (Reuters).",
    "We invite you to join the discussion on Facebook and Twitter.",
    "President Biden saw a few things go his way on Wednesday.",
    "Email: asimendinger@thehill.com and aweaver@thehill.com.",
    "What's behind sky-high inflation and rising gas prices?",
    "Alexis Simendinger and Al Weaver are the co-creators.",
    "Click here to subscribe to our latest newsletter.",
    "Thune said Democrats still balk at that idea.",
    "There's no evidence behind his statements.",
    "Also, check out the Rising? podcast here.",
    "Welcome to The Hill's Morning Report.",
    "We want to hear from you!",
    "CLICK HERE to subscribe!",
    "The last day of March!",
    "It's just frustrating.",
    "What was the movie?",
    "South Dakota Gov.",
    "It is Thursday!",
    "2 Republican.",
    "), the No.",
    "ET."
  ]
}