{
  "id": 2947,
  "mediaId": 165,
  "date": "3/30/2022 12:00:00 AM",
  "headline": "Turns Out Noted Liar Madison Cawthorn May Have Also Been Lying About Getting Invited to a Congressional Orgy",
  "image": "https://www.rollingstone.com/wp-content/uploads/2022/03/madison-cawthorn-may-2021.jpg?resize=1800,1200&w=1200",
  "link": "https://www.rollingstone.com/politics/politics-news/madison-cawthorn-kevin-mccarthy-orgies-cocaine-1330202/",
  "mediaOutlet": "Rolling Stone",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "William Vaillancourt",
  "authorUrl": "",
  "termIds": [
    2303,
    1147,
    1147,
    1609,
    1780,
    1780,
    1609,
    2303,
    428,
    562,
    562,
    545,
    545,
    428,
    525,
    525,
    2834,
    2834
  ],
  "sentences": [
    "And, you can't just say, You can't do this again.' I mean, he's, he's got a lot of members very upset.?\nCawthorn had made the comments on a podcast earlier this week, claiming Washington is rife with sexual perversion? and that he was invited to a sexual get together? at the home of a fellow lawmaker.",
    "Rep. Madison Cawthorn (R-N.C.) admitted claims he had made about his colleagues inviting him to orgies and doing cocaine in front of him were exaggerated,? House Speaker Kevin McCarthy (R-Calif.) said after admonishing the freshman congressman, according to multiple reports.",
    "He also was untruthful when describing the circumstances of the crash itself, having claimed he was declared dead? while an accident report obtained by The Washington Post said he was incapacitated.?\nThat's not all.",
    "Some of the people that are leading on the movement to try to remove addiction in our country, then you watch them do a key bump of cocaine in front of you,? he said on the podcast.",
    "During his 2020 campaign, Cawthorn accused his primary opponent, Lynda Bennett, of being a Never Trumper after an edited audio clip of Bennett circulated online.",
    "Some Republicans reportedly wondered if Cawthorn's intent was to make himself look better by being above the allegedly debauched behavior of his colleagues.",
    "Then when he comes in he tells me, he says he thinks he saw maybe a staffer in a parking garage from 100 yards away,? McCarthy said, according to Axios.",
    "Bennett claimed she was merely mimicking someone who disliked then-candidate Trump as part of a role-play exercise at a gathering of local Republicans.",
    "For instance, he claimed that he was set to attend the Naval Academy before getting into the car crash that paralyzed him from the waist down in 2014.",
    "Then you realized they're asking you to come to an orgy.?\nCawthorn also claimed he's seen members of Congress to cocaine in front of him.",
    "I just told him he's lost my trust, he's gonna have to earn it back, and I laid out everything I find is unbecoming,? McCarthy added.",
    "This is wild.?\nMany Republicans expressed displeasure with Cawthorn's comments, emphasizing that their reputations are at stake.",
    "Cawthorn's office has not responded to a request for comment from Rolling Stone about his meeting with McCarthy.",
    "), for instance, said in a closed-door conference meeting that many of his colleagues are in bed by 9 p.m.",
    "The North Carolina congressman has a history of making things up.",
    "I'm like, What did you just ask me to come to?'? Cathworn said.",
    "The full context of the audio appears to support that claim.",
    "Cawthorn's exaggerations this week shouldn't be surprising.",
    "In the interview, he claims he watched people do cocaine.",
    "(Cawthorn has been accused of sexual misconduct before.)",
    "(The institution had rejected him before the crash.)",
    "Rep. Steve Womack (R-Ark."
  ]
}