{
  "id": 2957,
  "mediaId": 43,
  "date": "3/28/2022 12:00:00 AM",
  "headline": "Morning Digest: Nebraska Republican to resign after being convicted of campaign finance fraud",
  "image": "https://images.dailykos.com/images/1052192/story_image/Jefffortenberry.jpeg?1648230424",
  "link": "https://www.dailykos.com/story/2022/3/28/2088108/-Morning-Digest-Nebraska-Republican-to-resign-after-being-convicted-of-campaign-finance-fraud",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    676,
    769,
    1101,
    1147,
    1163,
    1248,
    1299,
    1609,
    1670,
    1960,
    2087,
    2214,
    2303,
    428,
    562,
    571,
    2757,
    2816
  ],
  "sentences": [
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nThe battle for state legislatures in 2022, with Jessica Post\nThe Downballot\nFollowShare\n0:0046:23\n15301xMar 24, 2022\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nLeading Off\n? NE-01: Republican Rep. Jeff Fortenberry said Saturday that he would resign from Congress on March 31, an announcement that came two days after he was convicted of concealing illegal campaign funds he received from a foreign nationalLebanese-Nigerian billionaire Gilbert Chagouryand for lying to federal investigators about those funds.",
    "However, House Minority Leader Kevin McCarthy pressured him to depart the following day, arguing, \"I think when someone's convicted, it's time to resign.? Had Fortenberry not listened, it would take a two-thirds majority of the House to vote to expel him from office: The last time this happened was 2002, when Democratic Rep. James Traficant of Ohio was ejected by his colleagues three months after he was found guilty on corruption charges.",
    "? GA-14: A group of voters in northwest Georgia's 14th Congressional District have filed a challenge to Republican Rep. Marjorie Taylor Greene's candidacy with the secretary of state's office, arguing that she's ineligible to hold office under the 14th Amendment because she \"voluntarily aided and engaged in an insurrection to obstruct the peaceful transfer of presidential power\" on Jan. 6.",
    "Federal investigators say that the other three candidates quickly disposed of Chagoury's contributions after they were informed that they'd come from an illegal source, but the Nebraskan instead kept the money for two-and-a-half years and \"repeatedly chose to conceal the violations of federal law to protect his job, his reputation and his close associates,\" according to prosecutors.",
    "Prosecutors argued that Chagoury had used straw donors to illegally funnel $180,000 to four different Republican candidates, including $30,000 to Fortenberry's 2016 campaign; Chagoury, who became close to Fortenberry because of their mutual support for oppressed Christians in the Middle East, agreed to pay a $1.8 million fine in 2021 but avoided jail time.",
    "Until his indictment, Fortenberry was best known nationally for a 2018 incident in which his chief of staff tried to threaten the job of a local professor who in 2018 \"liked\" a Facebook post featuring a photo of a campaign sign that had been doctored to give the candidate googly eyes and rename him \"Fartenberry.\"",
    "Nebraska Rep. Jeff Fortenberry was convicted Thursday in federal court\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Under the new lines, it would have given Joe Biden a narrow 49-48 win; Democrats could have easily made the 1st solidly blue, but didn'tlikely because the parochial interests of incumbent Democratic congressmen in neighboring districts held them back.",
    "Fortenberry had been seeking re-election to Nebraska's 1st Congressional District, a constituency in the Lincoln area that Donald Trump would have carried 54-43, and because candidate filing closed weeks ago, it's too late for anyone else to run.",
    "House\n? FL-20: Former Broward County Commissioner Barbara Sharief announced Friday that she would challenge state Senate Minority Leader Lauren Book in the Democratic primary rather than seek a rematch against Rep. Sheila Cherfilus-McCormick.",
    "Redistricting\n? MD Redistricting: A state court judge struck down Maryland's new congressional map on Friday, ruling that the Democratic-drawn plan was an impermissible partisan gerrymander that violated the state constitution.",
    "They said Fortenberry had falsely told them that he'd ended that call with Ayoub after he'd made a \"concerning comment,\" when in fact he'd continued the conversation by asking Ayoub to hold another fundraiser on his behalf.",
    "Prosecutors also played a recording of a 2018 call secretly taped by the FBI in which Ayoub was heard telling the congressman that he'd received the money from Baaklini and believed that it \"probably came from Chagoury.\"",
    "The complaint is similar to one targeting North Carolina Rep. Madison Cawthorn and says that Republican Secretary of State Brad Raffensperger must call a hearing to determine Greene's eligibility.",
    "In arguments to the jury, prosecutors said that Chagoury placed $30,000 in cash in a bag and gave it to an ally named Toufic Baaklini, who passed it to Los Angeles doctor Eli Ayoub.",
    "The nine-term congressman, who plans to appeal, is scheduled to be sentenced in June, and each of the three charges he was found guilty of carries a maximum of five years in prison.",
    "Senate\n? AR-Sen: Sen. John Boozman's latest spot for the May Republican primary stars home state colleague Tom Cotton, who praises the incumbent as \"our conservative fighter.\"",
    "Nebraska Secretary of State Bob Evnen also says that a special election must take place before the end of June for the final months of Fortenberry's current term.",
    "Ayoub, they argued, then distributed that cash to his relatives and had them write checks to Fortenberry's campaign in order to conceal the money's true origin.",
    "As part of our celebration, we're reviving an old site tradition and awarding \"Koscars\" to honor the very best content to appear here, in multiple categories.",
    "The only notable changes affected the state's lone Republican-held seat, the 1st District on the Eastern Shore, which previously voted 59-39 for Donald Trump.",
    "Right now, nominations are open for a category that will be of special interest to Daily Kos Elections readers: Outstanding Story by a Downballot Candidate.",
    "Despite being told of the funds' questionable origin, prosecutors pointed out, Fortenberry didn't disclose this information to the authorities afterward.",
    "Judge Lynne Battaglia ordered lawmakers \"to develop a new Congressional Plan that is constitutional\" and gave them a Wednesday deadline to do so.",
    "Fortenberry had always decisively won re-election, and he appeared to be on track for another easy victory until he was indicted in October.",
    "That contest would take place using the congressional map that has been in place since 2012, and Trump won the existing 1st District 56-41.",
    "Instead, investigators charged that Fortenberry \"lied to and misled authorities\" twice during their probe that unfolded the following year.",
    "Over the years, many candidates for office at all levels have dropped by Daily Kos to share their thoughts and interact with the community.",
    "However, Democratic state Attorney General Brian Frosh, whose office defended the map in court, said a decision had not yet been made.",
    "? PA-12: Attorney Steve Irwin has earned the backing of the Laborers' District Council of Western PA for the May Democratic primary.",
    "Dave Heineman, should now have no trouble winning the May GOP primary against Fortenberry, whose name will remain on the ballot.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Fortenberry initially responded to his conviction by saying he would consider whether to continue his re-election campaign.",
    "(Traficant tried to regain his seat that year from prison by running as an independent but ended up taking third with 15%.)",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "State Sen. Mike Flood, a former speaker of the state's unicameral legislature who is backed by Gov.",
    "State party leaders, rather than primary voters, will choose the nominees for the special election.",
    "Grab Bag\n? Site News: This May, Daily Kos willif you can believe itcelebrate its 20th anniversary!",
    "If there's a favorite post that's always stuck with you, please nominate it in the comments here!",
    "Larry Hogan's veto in December, but while it was indeed a gerrymander, it was a half-hearted one.",
    "It's not clear what a remedial map might look like, but it's likely that Democrats will appeal.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Democrats, meanwhile, are fielding state Sen. Patty Pansing Brooks.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Democrats in the legislature passed a map over Republican Gov.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "Pete Ricketts and former Gov.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}