{
  "id": 2960,
  "mediaId": 43,
  "date": "3/25/2022 12:00:00 AM",
  "headline": "Good News! On Biden's Economy and Trump's Insurrectionists: 'BradCast' 3/24/2022",
  "image": "https://images.dailykos.com/images/1052018/story_image/BradCast_MarjorieTaylorGreen-MoBrooks-ClarenceGinniThomas_032422.jpg?1648174376",
  "link": "https://www.dailykos.com/story/2022/3/24/2087992/-Good-News-On-Biden-s-Economy-and-Trump-s-Insurrectionists-BradCast-3-24-2022",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    812,
    1039,
    1095,
    1147,
    1335,
    1351,
    1387,
    2087,
    2303,
    2475,
    146,
    422,
    428,
    562,
    2590,
    2834
  ],
  "sentences": [
    "FSFP cites Greene's participation in the January 6, 2021 insurrection, including her pre-Jan 6 video-taped message urging supporters to block the peaceful transfer of power after Biden's 2020 Electoral College victory (\"You can't allow it to just transfer power 'peacefully,'\") and her charge that Biden and House Speaker Nancy Pelosi were \"guilty of treason\", which she described as \"a crime punishable by death\".",
    "And, speaking of the apparently ailing and clearly corrupt Clarence Thomas, his far-right activist wife Ginni Thomas -- according to breaking news this afternoon from Bob Woodward and Robert Costa at Washington Post -- sent dozens of insane text messages to then White House Chief of Staff Mark Meadows, encouraging him to somehow steal the 2020 election in November of that year.",
    "Finally, Desi Doyen joins us for our latest Green News Report, in which -- aside from more climate-fueled disasters in Texas and Louisiana, and nuclear concerns rising at Chernobyl -- she manages to find a whole bunch of surprising silver linings in the response to Putin's war on Ukraine, which is resulting in Europe speeding up their move away from fossil fuels...",
    "Greene, like Cawthorn, is accused of violating Section 3 of the 14th Amendment which bars those who have taken a federal oath to defend the Constitution from running again if they have subsequently \"shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.\"",
    "After being admitted to the hospital last Friday with an \"infection\" and \"flu-like symptoms\", the Supreme Court finally disclosed the hospitalization of the 73-year old Justice on Sunday, announcing \"his symptoms are abating\" after intravenous antibiotic treatment and that he'll be released \"in a day or two\".",
    "* * *\nWhile we post The BradCast here every day, and you can hear it across all of our great affiliate stations and websites, to automagically get new episodes as soon as they're available sent right to your computer or personal device, subscribe for free at iTunes, Stitcher, TuneIn or our native RSS feed!",
    "But in response to getting dumped, Brooks put out an extraordinary statement last night claiming Trump asked him to \"rescind the 2020 elections, immediately remove Joe Biden from the White House, immediately put President Trump back in the White House, and hold a new special election for the presidency.\"",
    "But, because they tend to amount to good news and/or news that may help Dems and/or hurt Republicans, you haven't heard as much about them as you should from corporate media outlets where bad news leads or on social media, where rightwing outrage is monetized and weaponized.",
    "While stories about inflation tend to dominate headlines, stories about Joe Biden's economy -- firing on all pistons, even amid both inflation and war in Europe -- quickly disappear off the front pages (if they showed up there in the first place.)",
    "But on today's BradCast, we've got plenty of good news amid the bad...some of which is interrupted by breaking, bizarre, though hardly surprising news (at least when it comes to the corrupt Clarence and Ginni Thomas!)",
    "She was encouraging the Trump White House to find ways to overturn the results of a Presidential election while her husband was often the lone vote at SCOTUS in favor of absurd MAGA lawsuits challenging the election.",
    "Far-right Congressional loon Marjorie Taylor Greene's eligibility to run for re-election is being officially contested today by Georgia voters and the Constitutional law experts at Free Speech for People (FSFP).",
    "Lowest jobless numbers since 1969\nMTG faces ballot disqualification in GA;\nrump dumps Brooks, Brooks turns on seditionist Trump\nGinni Thomas texted Meadows to steal 2020\nAnd, again, where is Clarence?",
    "But, after urging the MAGA mob last year to turn their disappointment about 2020 into efforts to win in 2022 and 2024, Trump pretended he didn't like Brooks anymore and unendorsed him yesterday.",
    "Today, four days later, The Hill reports a friend says Thomas is \"resting\" and \"going to be just fine\", but won't disclose whether he's \"resting\" in the hospital or at home, for some reason.",
    "Little wonder the President's approval ratings remain low, despite a booming economy and huge majorities of Americans (of all parties) supporting his response to Russia's war on Ukraine.",
    "The non-partisan group previously filed a separate challenge against the Constitutional eligibility of North Carolina Rep. Madison Cawthorn to run in 2022 on the same basis.",
    "The real reason he dumped him, of course, is because Brooks is currently running third in the GOP primary and Trump doesn't want to be seen as backing yet another loser.",
    "Brooks stood by the claim during a local TV interview last night, saying that Trump asked him repeatedly to remove Biden and restore Trump, even recently.",
    "Under Georgia law, MTG will now have the burden of proving she isn't an insurrectionist, and FSFP will be able to depose her under oath in the process.",
    "Moreover, FSFP Co-Founder and President John Bonifaz tells The BRAD BLOG today: \"There will be more such challenges to be filed this year.\"",
    "That, before her supporters went on to attack the U.S. Capitol to block the peaceful transfer of power while calling for death of Pelosi.",
    "Alabama Rep. Mo Brooks, running to win the GOP nomination for U.S. Senate in the state, was unendorsed by Trump on Wednesday.",
    "According to the Commerce Dept., via Reuters, weekly jobless claims last week hit their lowest level since 1969!",
    "Brooks, a top \"Stop the Stealer\", spoke at Trump's January 6th Insurrection Day rally near the White House.",
    "Ya know, subpoenas that resulted in Meadows turning over text messages from his wife Ginni Thomas!",
    "He even voted in favor of challenges regarding the January 6 House Select Committee's subpoenas.",
    "Do you think you might have heard more about that if Trump was President instead of Biden?",
    "This is a remarkable amount of corruption inside of corruption inside of corruption.",
    "Speaking of insurrectionists, one of Trump's favorite ones just got dumped by him.",
    "Almost all of these stories deserve more attention than they've been getting.",
    "Then, as we did yesterday, we have to ask again: Where is Clarence Thomas?",
    "The Thomases have long been corrupt, but this incident may take the cake.",
    "If the news of late has ya down, today's show may offer a brief respite.",
    "TPM's Josh Marshall describes it as \"definitional sedition.\"",
    "(If he is ever released from the hospital, in any event.)",
    "CLICK HERE TO LISTEN OR DOWNLOAD TODAY'S SHOW!...",
    "[Audio link to full show follows this summary.]",
    "Is it finally time to impeach Clarence Thomas?",
    "The Court has had no update since Sunday.",
    "There's plenty of bad news out there.",
    "[Cross-posted from The BRAD BLOG...]",
    "Among our many stories today...",
    "(Yeah, we needed it too!)",
    "You're welcome!",
    "But who knew?",
    "We discuss.",
    "Seriously.",
    "Why not?"
  ]
}