{
  "id": 2966,
  "mediaId": 33,
  "date": "3/24/2022 12:00:00 AM",
  "headline": "Groups try to disqualify Rep. Marjorie Taylor Greene's candidacy over January 6",
  "image": "https://www.i.cdn.cnn.com/.a/2.287.3/assets/video_pinned_white_bg.jpg",
  "link": "https://www.cnn.com/2022/03/24/politics/marjorie-taylor-greene-candidacy-challenge/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marshall Cohen",
  "authorUrl": "https://www.cnn.com/profiles/marshall-cohen",
  "termIds": [
    2303,
    2347,
    2347,
    1147,
    1147,
    1095,
    1095,
    1090,
    1090,
    933,
    933,
    2303,
    2214,
    2214,
    2087,
    2087,
    2044,
    2044,
    2030,
    2030,
    1609,
    1501,
    1501,
    1710,
    1710,
    1609,
    1448,
    1448,
    1168,
    1168,
    1248,
    1248,
    562,
    562,
    428,
    422,
    428,
    422,
    427,
    427,
    346,
    346,
    146,
    146,
    106,
    106,
    100,
    100,
    2672,
    2672,
    2661,
    2661,
    2590,
    2590
  ],
  "sentences": [
    "\"She was involved in either planning the attack on January 6, or alternatively the planning of the pre-attack demonstration and/or march on the Capitol with knowledge that it was substantially likely to lead to the attack, and otherwise voluntarily aided the insurrection,\" the challengers wrote in a 42-page filing, citing Greene's social media posts and news reports about her alleged meetings with January 6 rally organizers.",
    "There are now three prominent efforts underway to disqualify GOP officeholders based on the \"disqualification clause\" of the 14th Amendment, which states that officeholders are prohibited from returning to elected positions if they supported an insurrection against the United States.",
    "Free Speech For People, a legal advocacy organization, and Our Revolution, a left-wing activist group, filed the challenge against Greene and also led the unsuccessful effort to block Cawthorn from the GOP primary ballot in North Carolina.",
    "An official from the secretary of state's office confirmed to CNN that the challenge was filed on Thursday and said an administrative judge will be assigned, according to state law, to \"evaluate the merits of the allegations.\"",
    "In one video, she explicitly said she opposed the transfer of power from then-President Donald Trump to then-President-elect Joe Biden because Biden \"did not win this election\" and is \"guilty of treason.\"",
    "(CNN)Rep. Marjorie Taylor Greene, a Georgia Republican running for reelection, is the latest lawmaker to face a candidacy challenge over her actions before the January 6, 2021, attack on the US Capitol.",
    "In a statement to CNN on Thursday, Greene said she has \"never encouraged political violence and never will,\" and pointed out that a federal judge recently blocked a similar challenge against Cawthorn.",
    "A spokesman for Greene previously said that on January 6, 2021, she was solely focused on objecting to Biden's electoral votes on the House floor and \"had nothing to do with planning of any protest.\"",
    "The challenge was filed by the same coalition of constitutional scholars and liberal activists who unsuccessfully tried to block Rep. Madison Cawthorn from the GOP primary ballot in North Carolina.",
    "Some of the county election officials in his district told CNN that their ballots are already printed with Cawthorn among the candidates, and the first mail ballots will be sent out Monday.",
    "A government watchdog group, Citizens for Responsibility and Ethics in Washington, has filed a lawsuit in New Mexico seeking to remove Couy Griffin, a county commissioner, from office.",
    "The new challenge against Greene, which was filed this week with the Georgia secretary of state, could potentially force Greene to testify under oath about the Capitol riot.",
    "\"This is the same evil playbook the dishonest Communist Democrats use against President Trump and his family,\" Greene said in the statement.",
    "Griffin was found guilty by a federal judge this week in Washington, DC, of trespassing on Capitol grounds during the riot.",
    "The groups can continue trying to disqualify Cawthorn after the primary, but it will be an uphill fight.",
    "Cawthorn says he isn't an insurrectionist and denies any wrongdoing related to the Capitol insurrection.",
    "In their legal challenge, the groups zeroed in on many of Greene's comments before January 6, 2021.",
    "\"Now they are using it on me, because they know I'm effective and will not bow to the DC machine.\"",
    "His conviction could give momentum to the disqualification attempt.",
    "CNN's Jason Morris contributed to this report."
  ]
}