{
  "id": 2973,
  "mediaId": 25,
  "date": "3/21/2022 12:00:00 AM",
  "headline": "Missouri GOP Senate candidate Eric Greitens' ex-wife accuses him of domestic violence",
  "image": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/04/11/6a745f7f-79a8-4d9e-8fa2-5671349053ea/thumbnail/620x392/15f48598d595064a41f161cf05a0703f/greitens.png",
  "link": "https://www.cbsnews.com/news/eric-greitens-wife-senate-candidate-abuse-allegations/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron Navarro",
  "authorUrl": "",
  "termIds": [
    2365,
    2365,
    749,
    749,
    571,
    571,
    319,
    319,
    320,
    320,
    468,
    468,
    2799,
    2799,
    2934,
    2934
  ],
  "sentences": [
    "\"Missouri court rules governing divorced parties' conduct toward one another provide a strong incentive for spouses to timely disclose to the court any fact-based and genuine concerns regarding the issues such as the allegations contained in Mother's unsolicited affidavit at the earliest opportunity before a divorce decree is entered,\" Eric Greitens' attorney Gary Stamper said in a statement emailed to CBS News.",
    "After news of the affidavit broke, Stamper filed a request to seal the case's records and proceedings, claiming the documents would cause \"irreparable harm\" to Greitens reputation and that his \"interest in protecting his reputation and standing in the community in the face of such inflammatory allegations outweigh the public's interest in favor of openness of state and county records.\"",
    "Greitens was once seen as a rising star in the party and had served just over one year as Missouri's governor before he resigned in 2018 after allegations of sexual misconduct and blackmail for allegedly taking a picture of his former hairdresser with whom he was having an affair, as well as an ethics investigation and a computer data tampering criminal charge.",
    "KMOV-TV\nSheena Greitens has pushed for jurisdiction of the case to be moved to Travis County court in Texas because she said their children have spent most of their time in recent years in Austin, and she said she fears Eric Greitens would utilize his platform as a Senate candidate in Missouri to attack her, according to the affidavit.",
    "\"When I told Eric about my plans, he threatened to come to the airport and have me arrested for kidnapping and child abuse, saying that because of his authority as a former governor who had supported law enforcement, the police would support him and not believe me, and I would lose our children,\" the affidavit alleges.",
    "2022 Midterm Elections\n More\n Senate candidate Eric Greitens accused of domestic violence by ex-wife\n McCarthy says Madison Cawthorn is \"wrong\" about Zelenskyy\n House Democrats raised $19.3 million in February, a committee record\n Trump's EPA chief Scott Pruitt weighing Senate run in Oklahoma\n New Hampshire Gov.",
    "\"A neutral observer might conclude that Mother's admitted silence through the discord common to failing marriages, while simultaneously concocting an advantageous strategy to circumvent a previously agreed upon court order, suggests her motivation might be less than honorable,\" he added.",
    "\"After Eric admitted to me in late January 2021 that he had taken the photo that resulted in the invasion of privacy charge, he threatened that I would be exposed to legal jeopardy if I ever disclosed that fact to anyone, even family members or a therapist,\" the affidavit says.",
    "The ethics investigation ended in 2020, concluding that while Greitens bears responsibility for his campaign's errors for not reporting two large campaign donations, the investigation found \"no evidence of any wrongdoing on the part of Eric Greitens, individually.\"",
    "\"Prior to our divorce, during an argument in late April 2018, Eric knocked me down and confiscated my cell phone, wallet, and keys so that I was unable to call for help or extricate myself and our children from our home,\" the affidavit says.",
    "Also in the field are Missouri Attorney General Eric Schmitt, Representatives Billy Long and Vicky Hartzler, as well as Mark McCloskey, a St. Louis injury lawyer most known for waving guns at protestors near his home in the summer of 2020.",
    "Sununu to veto congressional map passed by own party\n More\n Aaron Navarro\nAaron Navarro is an associate producer for the political unit at CBS News, focusing on House and gubernatorial campaigns as well as the census and redistricting.",
    "The woman told a Missouri House special committee that she believed Greitens had photographed her naked without her consent before he was elected governor and threatened to blackmail the woman if she spoke about the affair.",
    "Also in 2018, St. Louis circuit attorney Kim Gardner charged Greitens with computer data tampering due to an accusation that he used a donors list from a charity organization he founded for his 2016 campaign for governor.",
    "It also says Eric called her \"hateful, disgusting, nasty vicious\" and a \"lying b****\" while accusing her of providing information to prosecutors who were investigating him and to the St. Louis Post-Dispatch.",
    "After Eric Greitens allegedly refused to disclose the location of the weapon in June 2018, Sheena said in the affidavit that she \"started sleeping in my children's room simply to try to keep them safe.\"",
    "The ex-wife of Eric Greitens, Missouri's former governor and a current Republican candidate for U.S. Senate, alleged he was physically abusive and \"unstable,\" according to court records filed on Monday.",
    "Sheena Greitens has been part of an ongoing child custody battle with Eric Greitens and filed a sworn affidavit Monday that accuses the former governor of abuse toward her and their children.",
    "\"I will continue to love and care for my beautiful sons with all of my being, and that includes fighting for the truth and against completely fabricated, baseless allegations,\" Greitens said.",
    "Their divorce was finalized in May 2020 and a county court decision said the marriage was \"irretrievably broken\" and that a joint parenting plan is \"in [the] best interest of minor children.\"",
    "This behavior included physical violence toward our children, such as cuffing our then three-year-old son across the face at dinner in front of me and yanking him around by his hair.\"",
    "Sheena Greteins' affidavit also alleged that during the early summer of 2018, \"Eric repeatedly threatened to kill himself unless I provided specific public support to him.\"",
    "In her affidavit, Sheena Greitens alleged that \"Eric's behavior also included threats in order to coerce me to do or to refrain from saying or doing certain things.\"",
    "Some Republicans have expressed concerns that if Greitens wins the GOP nomination, it could make the seat more competitive in an otherwise likely Republican state.",
    "\"In early June 2018, I became afraid for my safety and that of our children at our home, which was fairly isolated, due to Eric's unstable and coercive behavior.",
    "The affidavit also says that Eric Greitens threatened to accuse Sheena of child abuse if she did not delete emails sent to her therapist about Eric's behavior.",
    "Sheena Greitens also said that in November 2019, their son Joshua returned from a visit with Eric \"with a swollen face, bleeding gums, and loose tooth.\"",
    "Hartzler called for Eric Greitens to drop out of the U.S. Senate race and \"seek immediate professional help,\" according to the St. Louis Post-Dispatch.",
    "\"I am seeking full custody of my sons, and for their sake, I will continue to pray for their mother and hope that she gets the help that she needs.\"",
    "This attack is nothing more than a sad attempt to force a father to yield custody of his children to a deranged individual,\" the campaign said.",
    "Following that call, Sheena Greitens said that she tried to take their children to her parents' home \"out of continued fear for our safety.\"",
    "\"The recent filing confirms the wisdom of Mark Twain: \"A lie can travel half way around the world while the truth is putting on its shoes.\"",
    "\"His children deserve a father who will speak the truth and stand up against malicious attacks that are clearly politically motivated.",
    "Joshua \"said Dad had hit him\" while Eric \"said they were roughhousing and it had been an accident,\" according to the affidavit.",
    "Eric Greitens admitted to the affair and called it consensual, but denied taking the photograph and the blackmail accusation.",
    "\"The behavior described in this affidavit is cause for Eric Greitens to be in prison, not on the ballot for U.S. Senate.",
    "She said that she and others tried to limit Eric's access to firearms \"on at least three separate occasions\" in 2018.",
    "Schmitt, Long and Lucas Kunce, a Marine and Democratic candidate in the race, also called for Greitens to step down.",
    "The only audience that matters now is the judge who approved the parties' agreement and has the power to change it.\"",
    "Eric Greitens is part of a crowded field of Republicans looking to succeed retiring Republican Senator Roy Blunt.",
    "In a statement, Eric Greitens slammed his ex-wife's accusations and said \"ultimately truth will always prevail.\"",
    "A late February poll from the Republican-leaning Trafalgar Group showed Greitens leading the GOP primary field.",
    "Republican Senator Josh Hawley, who has endorsed Hartzler, also called on Greitens to drop out of the race.",
    "Greitens' campaign said in a statement that the affidavit is part of a \"politically-motivated attack.\"",
    "In that motion, Stamper denied the truth of the allegations presented in Sheena Greitens' affidavit.",
    "Prosecutors dropped an invasion of privacy charge related to the alleged incident in May 2018.",
    "She accepted a position as an associate professor at the University of Texas in 2020.",
    "\"I agree with Vicky Hartzler that he needs to immediately drop out of the race.\"",
    "However, now, Eric Greitens says he wants full custody of the two children.",
    "The deadline for candidates to file for the primary is March 29, 2022.",
    "Former President Donald Trump won the state by over 15 points in 2020.",
    "Eric Greitens delivers a statement on Wednesday, April 11, 2018.",
    "Greitens announced he would be running for Senate in March 2021.",
    "He should end his campaign immediately,\" Schmitt tweeted.",
    "The tooth was surgically removed in May 2020.",
    "No photograph was found on his cell phone.",
    "Missouri's primary is slated for August 2.",
    "That charge was dropped in May 2018.",
    "\"He's unfit to serve,\" said Kunce.",
    "Missouri Gov.",
    "Twitter"
  ]
}