{
  "id": 2980,
  "mediaId": 21,
  "date": "3/17/2022 12:00:00 AM",
  "headline": "Here are the 8 House Republicans who voted against suspending normal trade relations with Russia and Belarus",
  "image": "https://i.insider.com/62339472683ded0019d22b00?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/8-republicans-vote-against-suspending-trade-relations-with-russia-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Bryan Metzger",
  "authorUrl": "https://www.businessinsider.com/author/bryan-metzger",
  "termIds": [
    1129,
    1129,
    1501,
    1501,
    1433,
    1433,
    2185,
    2185,
    2087,
    2087,
    428,
    428,
    562,
    562,
    2888,
    2888,
    2567,
    2567
  ],
  "sentences": [
    "00:11\nOur Russia-Ukraine roundup\n00:06\nA theater full of children hit\n00:25\nPutin's self-cleansing?\n00:21\nStar Russian ballerina quits over war\n00:24\nKoch Industries NOT boycotting Russia\n00:22\nUkraine joins Europe's power grid\n00:24\nZelenskyy's show available on Netflix\n00:22\nNew COVID wave to hit US\n00:31\nComing up: the disappearance of Brittney Griner\n00:10\nWebex by Cisco\n00:12\nGeneric Pfizer COVID pill\n00:23\nAmazon acquires MGM\n00:29\nModerna starts HIV vaccine trials\n00:23\nMyPillow CEO's social media apps\n00:29\nChinese spies target US figure skater\n00:36\nNetflix cracks down on account sharing\n00:23\nA new Selena album is coming out!",
    "Here are the eight Republicans who voted against the bill on Thursday:\nRep. Marjorie Taylor Greene of Georgia\nRep. Matt Gaetz of Florida\nRep. Lauren Boebert of Colorado\nRep. Thomas Massie of Kentucky\nRep. Andy Biggs of Arizona\nRep. Dan Bishop of North Carolina\nRep. Glenn Grothman of Wisconsin\nRep. Chip Roy of Texas\nMost are on the right flank of the Republican Party, and are among the most loyal supporters of former President Donald Trump.",
    "Roy told Insider via email that he would've supported the bill if targeting Russia and Belarus were the sole focus, but he took issue with the legislation because it would \"permanently empower the President with the unilateral authority to issue sanctions against anyone who he deems responsible for an undefined 'serious human rights abuse.'\"",
    "Boebert told Insider in an email that Congress \"keeps focusing on distractions abroad and not our own challenges brought on by Joe Biden at home,\" adding that she believed the bill had \"bad language\" that could empower Biden to sanction people who \"simply hold traditional views of life and family and restrict access to abortion.\"",
    "The Suspending Normal Trade Relations with Russia and Belarus Act, which passed by a 424-8 margin, allows President Joe Biden to increase tariffs on products coming from the two countries and requires the US Trade Representative to seek suspension of Russia's participation in the World Trade Organization.",
    "Greene, for her part, bemoaned in a Thursday floor speech that \"all we're hearing on the news is Ukraine\" and claimed that \"Washington seems to care more about sending our sons and daughters to a potential war\" than more pressing domestic issues.",
    "This move comes one day after Ukrainian President Volodymyr Zelenskyy's address to Congress, and a week after the House also voted to enact tougher sanctions on Russia and ban the importation of oil from the country.",
    "Massie told Insider in an email that \"this bill allows Biden and future Presidents to sanction virtually anyone they choose anywhere on the globe without Congressional approval,\" which he later tweeted about as well.",
    "While Congress has been relatively unified in calling for Russia to be punished and for the US to support Ukraine, some on the right flank of the party have adopted a different tactic.",
    "Belarus, though not the primary aggressor in the current conflict, is a close ally of Moscow and has allowed its territory to be used by Russian troops for staging invasions.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Rep. Madison Cawthorn of North Carolina faced criticism from members of the GOP after he called Zelenskyy a \"thug\" at an event with constituents.",
    "The House of Representatives passed a bill on Thursday to suspend normal trade relations with both Russia and Belarus amid the war in Ukraine.",
    "From left: Republican Reps. Lauren Boebert of Colorado, Matt Gaetz of Florida, Marjorie Taylor Greene of Georgia, Thomas Massie of Kentucky.",
    "Anna Moneymaker/Getty Images\nThe House of Representatives passed a bill to suspend normal trade relations with Russia and Belarus.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Reps. Marjorie Taylor Greene, Matt Gaetz, Lauren Boebert, and Thomas Massie were among them.",
    "You may download the file here: The Refresh from Insider\nThe Refresh from Insider\nWelcome!",
    "The legislation must now pass the Senate and be signed by Biden to be enacted into law.",
    "Seventeen members of Congress, overwhelmingly Republicans, voted against that measure.",
    "Insider has reached out to the other House Republicans' offices for comment as well.",
    "Hosts Rebeca Ibarra and Dave Smith bring you realtime news...\n00:00\n12:25\nWelcome!",
    "Subscribe to push notifications\nYour browser does not support the audio element.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Biden has repeatedly pledged not to send Americans troops to Ukraine.",
    "00:08\nSpooler\n Close icon Two crossed lines that form an 'X'.",
    "Eight House Republicans voted against the bill on Thursday.",
    "00:35\nWhere is WNBA's biggest star, Brittney Griner?",
    "Stay up to date with what you want to know.",
    "All voted against the Russia trade bill.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "05:00\nCheck back tomorrow!",
    "For Mar 17."
  ]
}