{
  "id": 2999,
  "mediaId": 43,
  "date": "3/10/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 3/10",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/3/10/2083921/-Daily-Kos-Elections-Live-Digest-3-10",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    858,
    858,
    1925,
    1925,
    1891,
    1891,
    2030,
    2030,
    1622,
    1622,
    1619,
    1619,
    442,
    442,
    2912,
    2912,
    2834,
    2834,
    2972,
    2972
  ],
  "sentences": [
    "The full list of candidates making the DCCC's initial roster are below:\nCA-22: Assemblyman Rudy Salas\nCA-45: community college trustee Jay Chen\nCO-07: state Sen. Brittany Pettersen\nIA-01: state Rep. Christina Bohannan\nIA-02: state Sen. Liz Mathis\nIL-13: former Biden administration official Nikki Budzinski\nMI-03: 2020 nominee Hillary Scholten\nNM-02: Las Cruces City Councilor Gabe Vasquez\nNY-01: 2020 NY-02 nominee Jackie Gordon\nNY-11: former Rep. Max Rose\nOH-01: Cincinnati City Councilman Greg Landsman\nOH-13: state Rep. Emilia Sykes\nMost of these candidates don't face any serious intra-party opposition in their primaries.",
    "(The legislative maps also failed to clear two-thirds in either chamber, but the governor evidently decided they weren't worth the fight: He explained his decision not to veto them by saying, I do not believe the Legislature has the ability to draw new state House and Senate maps during this upcoming legislative session without the process halting the important work of the state of Louisiana.?)\nSuccessful veto overrides are beyond rare in the Bayou State: Indeed, as far as anyone can tell, the only two that ever succeeded happened in 1991 and 1993.",
    "Jacobs added that he believed that \"[n]ot every one of the contenders right now\" could win, and while he didn't elaborate at the time, he now tells Newsday that former Hempstead Town Supervisor Laura Gillen would have a very tough time winning in this congressional seat, given what I know about the voters and the opposition that she would have.? He didn't elaborate on what he felt Gillen's drawbacks were, though Jacobs says that he'd also unsuccessfully encouraged her to seek an open state Senate seat.",
    "Schexnayder said at the time he felt comfortable 100%? that he had the votes to prevail, but as Miguez made sure to point out, he was very wrong: Lawmakers sustained all of Edwards' vetoes, with the governor saying afterwards he'd been very, very light on threats? but not so light on promises.? None of that legislation concerned redistricting, but observers at the time saw the override session as an important test for whether the governor would be able to block GOP gerrymanders in 2022.",
    "The congressman also made sure to broadcast a statement from Coburn, who was ostensibly neutral, condemning the ads against Lankford while praising him as a man of absolute integrity.?\nPolls showed Lankford ahead but not close to the majority he needed to avoid a runoff, but he ended up prevailing by a surprisingly strong 57-34 margin, a showing fellow Sooner State politicians attributed to his extensive connections with the state's large Baptist community.",
    "North Carolina, South Korea, and why you should Run For Something, with Amanda Litman\nThe Downballot\nFollowShare\n0:0042:43\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nWe also spend time exploring a trio of different stories out of North Carolinaone concerning Madison Cawthorn, one about redistricting, and one, believe it or not, about Vladimir Putinand bring you up to speed on the just-concluded presidential election in South Korea.",
    "Ettinger, who has not been politically active before, is campaigning as a moderate, saying, I think solutions that come from the middle stick, and are accepted by people more.?\nThursday, Mar 10, 2022  1:12:45 PM Pacific Standard Time  Jeff Singer\nNC-11: The media reported Wednesday that the North Carolina State Highway Patrol had charged Republican Rep. Madison Cawthorn days before with driving on a revoked license.",
    "Jacobs praised both the mayor and another contender, Nassau County Legislator Siela Bynoe, saying, Between the two of them will come a candidate that'll win.?\nThe chair himself made news last week when he emailed party donors and told them that they should \"HOLD OFF on making ANY contributions to ANY of the candidates until we have had an opportunity to discuss the complexities of the race.\"",
    "Our best chance to beat the Republicans this fall, Lamb has defeated the Trump machine three elections in a row.?\nThursday, Mar 10, 2022  12:27:33 PM Pacific Standard Time  Jeff Singer\nWI-Sen: Republican Sen. Ron Johnson, who has up till now run ads showcasing him as a hardline conservative warrior, uses his newest spots (here and here) to depict him as a caring person.",
    "Thompson previously defied the governor last year when he was the one Democrat to participate in the unsuccessful attempt to override Edwards' veto on a bill banning trans girls and women from participating in sports consistent with their identity; the governor responded afterwards by ejecting the representative from his seat on the Southern Regional Education Board.",
    "The Times-Picayune explained, Edwards' veto threw the Legislature's budget for the year out of whack by $3 million, which [was] one of the reasons the state lawmakers went through with the override.? Few people, though, seemed to care much: Multiple lawmakers told the paper two decades later that they didn't even remember that override, despite its historic nature.",
    "Not only is the fate of Edwards' veto in doubt, it's not even clear when the override attempt will happen: Hilburn explains that lawmakers themselves are unsure whether they can try to hold and override vote during their regularly scheduled legislative session that is set to start Monday, or whether they'll \"have to convene is a separate, but parallel session.\"",
    "They weren't angry at me, but more angry at him.?\nThursday, Mar 10, 2022  12:55:45 PM Pacific Standard Time  Jeff Singer\nCA-41: On Thursday, one day ahead of the filing deadline, pastor Brandon Mosely announced that he was ending his campaign against Republican incumbent Ken Calvert and endorsing his fellow Democrat, former federal prosecutor Will Rollins.",
    "The constituents might learn it could go away because of a vote on reapportionment, an issue they couldn't care less about.?\nLast year, though, the legislature tried to defy Edwards when it convened the first veto override session in state history in an attempt to enact several conservative bills, with that anti-trans bill attracting the most attention.",
    "Thursday, Mar 10, 2022  8:06:44 AM Pacific Standard Time  David Nir\nOn this week's episode of The Downballot, we talk with Amanda Litman, the co-founder of Run for Something, an organization she formed in the wake of the 2016 elections to help young, diverse progressives run for office across the country at all levels of the ballot.",
    "Thursday, Mar 10, 2022  1:38:02 PM Pacific Standard Time  Jeff Singer\nDCCC: On Thursday, the DCCC unveiled the first round of its \"Red to Blue\" program for the 2022 election cycle, highlighting candidates whom the committee thinks has the strongest chance of picking up GOP-held districts or defending competitive open seats.",
    "John Bel Edwards announced Wednesday evening that he'd vetoed the new congressional map that Louisiana's Republican-controlled state legislature passed last month because it did not create a second majority-Black seat, though he said he'd allow new state House and Senate lines to take effect without his signature.",
    "Thursday, Mar 10, 2022  1:50:51 PM Pacific Standard Time  Jeff Singer\nCA-03, CA-49: The state Republican Party on Thursday endorsed Assemblyman Kevin Kiley, who is running in the open 3rd District, and 2020 nominee Brian Maryott, who is waging another campaign against Democratic Rep. Mike Levin in the 49th.",
    "Five Democrats and four Republicans didn't vote (one safely blue Democratic-held seat is also vacant), so if all the absent members sided with their party's leadership, the GOP would still need to convince two opponents to switch their votes in order to implement the map over Edwards' objections.",
    "Thursday, Mar 10, 2022  1:06:41 PM Pacific Standard Time  Jeff Singer\nMN-01: Jeff Ettinger, who served as CEO of the food processing giant Hormel from 2005 through 2016, announced Thursday that he would run as a Democrat in the special election to succeed the late Republican Rep. Jim Hagedorn.",
    "He made sure I had everything that I need.?\nThursday, Mar 10, 2022  12:32:38 PM Pacific Standard Time  Jeff Singer\nIA-Gov: Deidre DeJear, who is the only Democrat in the race with just over a week to go before the filing deadline, has earned an endorsement from 2018 nominee Fred Hubbell.",
    "Thursday, Mar 10, 2022  11:35:04 AM Pacific Standard Time  Jeff Singer\nAR-Sen: Former NFL player Jake Bequette, who is challenging Sen. John Boozman in the May Republican primary, centers his new spot around [b]abies, borders, bullets.? The narrator doesn't mention the fourth B, Boozman.",
    "Republicans have long ignored calls to create a second seat where Black voters could elect their preferred candidate, despite the fact that African Americans make up about a third of the state's population, because they know such a district would likely send a Democrat to Washington.",
    "Thursday, Mar 10, 2022  12:21:38 PM Pacific Standard Time  Jeff Singer\nPA-Sen: Rep. Conor Lamb is spending at least $198,000 on his first TV ad for the May Democratic primary, a commercial that highlights his background in the Marines and as a federal prosecutor.",
    "Altogether three RepublicansGabe Firment, Beryl Amedee, and caucus chair Blake Miguezvoted no on the congressional map, along with Roy Adams, who is one the chamber's three independents, while Francis Thompson was the lone Democrat to support the map.",
    "Thursday, Mar 10, 2022  11:34:19 AM Pacific Standard Time  David Nir\nWI Redistricting: Wisconsin Republicans have asked the U.S. Supreme Court to overturn a ruling by the state Supreme Court adopting a new congressional map proposed by Democratic Gov.",
    "Shannon announced Thursday that he would enter the special election to succeed outgoing Sen. Jim Inhofe, a campaign that will take place eight years after Shannon lost the Republican nomination for Oklahoma's other seat to now-Sen. James Lankford.",
    "Courts prevented that bill from ever going into effect, but that veto alienated anti-abortion Republicans and almost certainly contributed to Roemer's third-place finish in the all-party primary a few months later; former Democratic Gov.",
    "The caucus chair, who functions as the chamber's majority leader, who reiterated his unhappiness about how the 3rd District had been altered following Edwards' veto and argued that Rep. Clay Higgins was treated poorly? by his own party.",
    "Thursday, Mar 10, 2022  1:27:56 PM Pacific Standard Time  Jeff Singer\nOK-02: State Rep. Dustin Roberts announced that he was entering the June primary to succeed Rep. Markwayne Mullin, a fellow Republican who is running for the Senate.",
    "Shannon also likely suffered because his allies, who incorrectly believed there would be a second round of voting, focused their resources on an unsuccessful attempt that same day to deny renomination to Mississippi Sen. Thad Cochran.",
    "Thursday, Mar 10, 2022  1:41:44 PM Pacific Standard Time  Jeff Singer\nTX-AG: Civil rights attorney Lee Merritt on Thursday conceded last week's Democratic primary and endorsed former ACLU attorney Rochelle Garza in the May runoff.",
    "Thursday, Mar 10, 2022  1:22:54 PM Pacific Standard Time  Jeff Singer\nNY-04: Malverne Mayor Keith Corbett announced Wednesday that he was joining the June primary to succeed his fellow Democrat, retiring Rep. Kathleen Rice.",
    "Litman tells us about the resources they offer to first-time candidates, some of Run for Something's biggest success stories, and her favorite obscure post that you might not even know is an elected position in many states.",
    "Shannon made history in 2013 when he became the first African American or Chickasaw Nation member to lead the state House, and he got the chance to set another milestone when Sen. Tom Coburn resigned the following year.",
    "GOP leaders have already made it clear that they'll attempt what would be only the third veto override in at least a centuryand possibly in state historyas they seek to implement their congressional gerrymander.",
    "The congressman had been similarly charged in a 2017 case that was later dismissed, though the police, citing privacy law, would not comment on what he had done to get his license revoked in the first place.",
    "The battle, as we'll discuss, will be in the lower chamber, where Republicans would need to appease a few angry members of their own caucus in order to obtain the necessary two-thirds supermajority.",
    "The primary may get another candidate soon as Rep. Kevin Hern has confirmed he's considering, though he acknowledged he would need to give up his coveted spot on the House Ways and Means Committee.",
    "The Democrat previously explained he was crossing party lines because he feared a second Black majority seat would endanger 5th District GOP Rep. Julia Letlowwho happens to be a constituent of his.",
    "They also say Evers' plan violates the doctrine of \"one person, one vote\" because its smallest and largest districts differ by two people, rather than the mathematical minimum of one person.",
    "Last time we were in a veto override session he expressed confidence that he could but was unsuccessful.? (That session last year was indeed a huge failure for the GOPmore on that in a bit.)",
    "One big reason why governors so rarely lose is that they have wide discretion over which projects do or don't get funded, which gives them a powerful tool for pressuring wavering lawmakers.",
    "The disputed map maintains the status quo, preserving a single Black district stretching from New Orleans to the capital of Baton Rouge alongside five predominantly white constituencies.",
    "The three GOP naysayers were angry that the new congressional lines would divide their communities, though they didn't seem to have any problem with partisan or racial gerrymandering.",
    "Legislators said at the time that the governor could have sustained his veto if he'd tried if he'd made use of his office's power to entice members, but he didn't make the attempt.",
    "Garza took first place with 43% while former Galveston Mayor Joe Jaworski, who is the grandson of Watergate special prosecutor Leon Jaworski, edged out Merritt 20-19 for second.",
    "Buddy Roemer, who only months before had defected from the Democratic Party, gave the thumbs down to what would have been the most extreme anti-abortion law in the nation.",
    "We're waiting to see if Firment still feels that way, but Miguez now tells the Lafayette Daily Advertiser's Greg Hilburn that he's unsure if he'll support an override.",
    "The party's other congressional endorsements went to incumbents, candidates who face no serious intra-party opposition, and people seeking safely blue constituencies.",
    "Firment was particularly furious, saying right after the map passed that he hoped Edwards would issue a veto and that he'd seriously consider? voting to sustain it.",
    "Both Roberts and the congressman are citizens of Native American nations: Roberts is a member of the Choctaw Nation while Mullin is part of the Cherokee Nation.",
    "Edwards, who died last year, was likewise blithe in his recollections, saying in 2015, The attorney general had some kind of controversy with the Legislature.",
    "Shannon went on to co-chair Black Voices for Trump and to lead Chickasaw Community Bank, but this is the first time he's sought office since that 2014 defeat.",
    "In their petition, Republicans claim that the Wisconsin court changed the criteria it said it would use to evaluate maps submitted by the parties mid-stream.",
    "Shannon earned endorsements from anti-establishment groups, which spent $1.7 million on his behalf, but he faced a tough contest against then-Rep. Lankford.",
    "Shannon and his allies tried to portray his opponent as too close to D.C. leaders, while Lankford fought back by emphasizing his own conservative record.",
    "Edwin Edwards (no relation to the current governor) went on to win back the office in the notorious Race from Hell? against former KKK leader David Duke.",
    "Those two occasions when an override did succeed back in the early 1990s both took place at a time when conservative Democrats dominated each chamber.",
    "The stakes were far lower two years later when Edwards rejected a bill that would have cost the attorney general's office $3 million in funding.",
    "The Des Moines Register writes that Hubbell's support could help encourage donors to contribute to DeJear, who struggled to raise money in 2021.",
    "Miguez also threw some shade at his boss, Speaker Clay Schexnayder, saying, The real question is whether the speaker can bring Democrats along.",
    "Corbett, who leads a village with a population of about 8,500, is close to Jay Jacobs, who chairs both the state and Nassau County parties.",
    "(The Times-Picayune wrote in 2015 that reliable records only go back to 1921, but it could find no evidence of any overrides before then.)",
    "By contrast, the NRCC often will add multiple candidates running in the same race, as well as people running in safely red open seats.",
    "Rose also has to get past Army veteran Brittany Ramos DeBarros in his own June primary, but he looks like the overwhelming favorite.",
    "As one former legislator told The Advocate recently, A road project is a big deal, especially if there's a terrible traffic problem.",
    "When the DCCC adds a candidate to Red to Blue, it is declaring that this contender is the national party's choice in a key race.",
    "And when a mob stormed the Capitol on Jan. 6,? continues the narrator, Lamb stood up to the Republicans, calling out their lies.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "The DCCC's counterparts at the NRCC have a similar program called Young Guns, but there are some key differences between them.",
    "Astonishingly, the GOP's brief cites Dr. Seuss's 1, 2, 3 in support of this argument, and we are not joking in the slightest.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Thursday, Mar 10, 2022  12:16:52 PM Pacific Standard Time  Jeff Singer\nOK-Sen-B: Former state House Speaker T.W.",
    "However, it cleared the House only 64-31six votes below the 70 needed for an override in the 105-seat chamber.",
    "The most notable exception is Gordon, who faces two Suffolk County legislators, Bridget Fleming and Kara Hahn.",
    "Amedee, the third Republican \"nay,\" doesn't appear to have said anything about her thinking since last month.",
    "Thursday, Mar 10, 2022  12:42:08 PM Pacific Standard Time  Jeff Singer\nLA Redistricting: Democratic Gov.",
    "Smith in one commercial says of the senator, When I lost my husband, he made sure he reached out to me.",
    "The map passed the Senate on a 27-10 vote, which is one more than the 26 needed to undo Edwards' veto.",
    "You can listen to The Downballot on all major podcast platforms, and you can find a transcript here.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "However, Thompson told Hilburn Thursday that he was a yes for override.",
    "Both spots star Markeitha Smith, the widow of a late Milwaukee pastor.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "It's also a place to discuss elections, not policy.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "Subscribe to our new podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "New episodes every Thursday morning.",
    "Now his ultimate trial is here.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "In 1991, Republican Gov.",
    "Daily Kos is different.",
    "Please read it.",
    "Tony Evers.",
    "P.S."
  ]
}