{
  "id": 3006,
  "mediaId": 237,
  "date": "3/8/2022 12:00:00 AM",
  "headline": "Elise Stefanik builds GOP female candidate crew with 10 more endorsements",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/968451.png",
  "link": "https://www.washingtonexaminer.com/news/campaigns/elise-stefanik-builds-gop-female-candidate-crew-with-10-more-endorsements",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Brooks",
  "authorUrl": "https://www.washingtonexaminer.com/author/emily-brooks",
  "termIds": [
    888,
    888,
    1147,
    1147,
    1095,
    1095,
    1551,
    1551,
    1509,
    1509,
    1761,
    1761,
    1335,
    1335,
    2025,
    2025,
    428,
    428,
    2707,
    2707
  ],
  "sentences": [
    "Stefanik's PAC also added a number of names to their women to watch? in 2022 House races: Jan Kulmann and Barbara Kirkmeyer in Colorado's 8th District, Catalina Lauf and Cassandra Tanner Miller in Illinois's 11th District, Regan Deering in Illinois's 13th District, Theresa Gavarone in Ohio's 9th District, Jessica de la Cruz in Rhode Island's 2nd District, Kalena Bruce and Sarah Walsh in Missouri's 4th District, and Yesli Vega in Virginia's 7th District.",
    "The other eight candidates whom Stefanik has previously endorsed are: Esther Joy King in Illinois's 17th District, Amanda Adkins in Kansas's 3rd District, Karoline Leavitt in New Hampshire's 1st District, April Becker in Nevada's 3rd District, Lisa Scheller in Pennsylvania's 7th District, Monica De La Cruz in Texas's 15th District, Jen Kiggans in Virginia's 2nd District, and Jeanine Lawson in Virginia's 10th District.",
    "GOP women made history in 2020, and in 2022, Republican women are leading the Red Tsunami to Fire Nancy Pelosi once and for all.?\nIn this cycle, E-PAC has raised and donated more than $600,000 directly to female candidates, including through WinRed, a GOP fundraising platform, according to the PAC.",
    "It's clear there is no shortage of all-star Republican women this cycle  we have a record-shattering 260+ Republican women who are already running for Congress, which surpasses our record in 2020 during the historic Year of the Republican Woman,'? Stefanik said in a statement.",
    "Bringing the total number of Republican women she has endorsed this cycle to 18, Stefanik's endorsements announced Tuesday through E-PAC, built to back women, adds to her history of supporting women in a move to make the Republican conference and House as a whole more female.",
    "The winner of the primary will face either incumbent Democratic Rep. Henry Cuellar, whose house was recently raided as part of an FBI investigation, or his left-wing primary challenger Jessica Cisneros, an immigration attorney.",
    "Stefanik endorsed Contreras Wheeless in the Republican primary over businessman and Marine Corps veteran Kelly Cooper, who had a cash advantage over Wheeless as of the end of 2021 but has self-funded his campaign.",
    "The Republican nominee in the competitive Phoenix-area seat is likely to take on incumbent Democratic Rep. Greg Stanton, who represents the 9th District but was redrawn into new 4th District boundaries.",
    "Stefanik endorsed the following candidates for Congress on Tuesday:\nTanya Contreras Wheeless, a small business owner and former aide to former Sen. Martha McSally, for Arizona's new 4th District.",
    "Trump-endorsed candidate Max Miller had previously announced a Republican bid for the seat but, after redistricting, switched to the neighboring 7th District, which is more Republican-leaning.",
    "3 Republican in the House, is adding to her slate of favored female candidates by endorsing 10 more Republican women in House races, some of whom are competitive in Republican primary races.",
    "The current Clearwater-area district is competitive and being vacated by incumbent Democratic Rep. Charlie Crist, who is running for governor, but new district lines have not been finalized.",
    "Current Republican Rep. Trey Hollingsworth, whom Houchin finished second to in a 2016 primary for the seat, is forgoing reelection in the heavily Republican-leaning seat.",
    "Ortagus is also endorsed by Trump and will face music video producer and director Robby Starbuck, who is backed by North Carolina Rep. Madison Cawthorn, in the primary.",
    "Current Democratic Rep. Jim Cooper is retiring from the district, which swung from a Democratic-leaning seat to a Republican-leaning seat due to redistricting.",
    "Mayra Flores, the daughter of Mexican immigrants and a respiratory care practitioner who just won the Republican nomination for Texas's 34th District.",
    "Her primary opponent, Sam Peters, a businessman and veteran, raised half a million dollars last year before Black joined the race in January.",
    "Current Democratic Rep. Kurt Schrader faces a primary challenge for the seat, which is expected to be competitive in the general election.",
    "She is the top-raising candidate in the Republican primary field as of the end of 2021, but opponent Amanda Makki led her in cash on hand.",
    "Redistricting made it tilt a few points more Democratic, but it is still within the realm of possibility that Republicans can win it.",
    "Joy is seeking a rematch against Democratic incumbent Rep. Paul Tonko in a Democratic-leaning district in the Albany area.",
    "I look forward to supporting these Rising Stars across the finish line in both their primaries and general elections.",
    "Cassy Garcia, a former Trump appointee and staffer for Texas Republican Sen. Ted Cruz, for Texas's 28th District.",
    "Lori Chavez-DeRemer, former mayor of Happy Valley, a suburb of Portland, Oregon, for the state's 5th District.",
    "Morgan Ortagus, former State Department spokeswoman under Trump, for Tennessee's 5th Congressional District.",
    "Anna Paulina Luna, Air Force veteran and former Turning Point USA staff member, for Florida's 13th District.",
    "Madison Gesiotto Gilbert, conservative commentator and former Miss Ohio, for the state's 13th District.",
    "Republican Rep. Anthony Gonzales, who currently holds the seat, is not running for reelection.",
    "She will face Democratic Rep. Vicente Gonzalez in the Democratic-leaning South Texas district.",
    "The sizable rural district is currently held by Democratic Rep. Steven Horsford.",
    "Erin Houchin, an Indiana state senator, for Indiana's southeastern 9th District.",
    "She will face conservative activist Sandra Whitten in a primary runoff May 24.",
    "The new endorsements bring Stefanik's PAC endorsements in House races to 18.",
    "The 13th District is expected to be competitive in the general election.",
    "Annie Black, a Nevada state assemblywoman, for Nevada's 4th District.",
    "Liz Joy, a conservative activist, for New York's 20th District.",
    "Former President Donald Trump has also endorsed Paulina Luna.",
    "New York Rep. Elise Stefanik, the No."
  ]
}