{
  "id": 3011,
  "mediaId": 43,
  "date": "3/6/2022 12:00:00 AM",
  "headline": "North Carolina Open Thread: Republicans for Putin, NC Candidates, Thom Tillis, Cawthorn's Corner",
  "image": "https://images.dailykos.com/images/1045655/story_image/DKBudd.jpg?1646588128",
  "link": "https://www.dailykos.com/story/2022/3/6/2084245/-North-Carolina-Open-Thread-Republicans-for-Putin-NC-Candidates-Thom-Tillis-Cawthorn-s-Corner",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2341,
    2341,
    2409,
    2409,
    1147,
    1147,
    1404,
    1404,
    2030,
    2030,
    1813,
    1813,
    428,
    428,
    2661,
    2661,
    2834,
    2834
  ],
  "sentences": [
    "The attorneys behind the legal effort cited the 14th Amendment, which reads: No person shall be a Senator or Representative in Congress, or elector of President and Vice-President, or hold any office, civil or military, under the United States, or under any State, who, having previously taken an oath, as a member of Congress, or as an officer of the United States, or as a member of any State legislature, or as an executive or judicial officer of any State, to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.",
    "Former President Donald Trump reiterated his praise of the Russian dictator's genius.? Just a few days earlier Michael Pompeo, Trump's former Secretary of State, complimented Putin as very shrewd? and very capable.?\nHow far this now fringe branch of the Republican party has fallen from the days when late President Ronald Reagan addressed them in 1981. We've heard in our century far too much of the sounds of anguish from those who live under totalitarian rule,? Reagan said.",
    "Before the fire, Weaver Fertilizer plant was storing more than 4.5 million pounds of chemicals onsite\nNorth Carolina Policy Watch, Lisa Sorg, 3/4/2022\nBefore a massive blaze erupted at the Weaver Fertilizer plant in late January, it was storing more than 2,000 tons  roughly 4.5 million pounds  of chemicals every day at its facility in Winston-Salem, according to the company's most recent chemical inventory filed with state emergency management officials.",
    "Had Bush acted more creatively and ambitiously to champion a JFK-like message of ask not what your country can do for you  ask what you can do for your country,? it's at least conceivable that the 9/11 attacks might have spurred a rebirth of public-spirited patriotism and sacrifice, and perhaps even a more honest assessment of the often less-than-heroic way that U.S power is sometimes viewed and felt in other parts of the world.",
    "Take your families and enjoy life the way we want it to be enjoyed.?\nNow, in fairness, a big part of what Bush was trying to do was to prevent a potentially paralyzing panic that threatened the U.S. economy in the wake of the attacks, but it's also true that he never seized the golden opportunity that presented itself to build on the groundswell of solidarity Americans were experiencing to unite the nation in common purpose.",
    "But Congress may by a vote of two-thirds of each House, remove such disability.?\nBeat him at the ballot box\nBlueNC/News&Observer, 3/4/2022\nTRUMP JUDGE BLOCKS CHALLENGE TO MADISON CAWTHORN'S CONGRESSIONAL RUN: Cawthorn's opponents say the Jan. 6 attack was an attempted insurrection  a word that top GOP Sen. Mitch McConnell of Kentucky has also used to describe that day that resulted in several deaths and injuries.",
    "The message Americans need to hear at a critical moment in history (and that too many are unwilling to receive)\nNorth Carolina Policy Watch, Rob Schofield, 3/1/2022\nIn the aftermath of the terrorist attacks of Sept. 11, 2001, then-President George W. Bush famously prescribed a somewhat surprising course of action for Americans looking to do their part to combat the dark forces behind the terror: consumerism.",
    "'Pretty gross but also very stupid': Madison Cawthorn blasted for bill blocking aid to Ukraine over Mexico border\nNew Civil Rights Movement, David Badash, 3/2/2022\nRepublican Congressmen Madison Cawthorn (NC) and Matt Rosendale (MT) are being blasted for bills they introduced as it became clear Russian President Vladimir Putin was intent on waging war against Ukraine.",
    "FILING FOR NC'S 2022 ELECTION ENDED TODAY, TOO MANY GOOD DEM CANDIDATES TO COVER\nBlue NC, 3/4/2022\n Sen. Valerie Foushee's congressional run opened a seat in Orange, Person and Caswell counties, and a pair of high-profile Democrats will fight for the nomination in Senate District 23, which is considered a safe Democratic seat.",
    "Today, those who claim to have inherited Reagan's legacy are deaf to those sounds of anguish.?\nBudd Doubles Down On Putin Praise: He's A Very Intelligent Actor?\nNCDP, 3/1/2022\nSince attending a fundraiser in Mar-a-Lago with Donald Trump, where Trump called Putin smart,? Ted Budd has refused to stand up to the former president.",
    "We seek here the imposition of that remedy.?\nAccording to the two voters, Cawthorn is not eligible to run for reelection because he violated a portion of a post-Civil War amendment to the Constitution pertaining to insurrections due to his participation in the rally that preceded the riot at the U.S. Capitol on Jan. 6, 2021.",
    "As WRAL points out, the challenge is essentially the same one filed against Cawthorn in January, \"but that one was deemed moot after a court-ordered redistricting process reworked North Carolina's congressional districts, shifting the boundaries of the district Cawthorn initially filed to run in.\"",
    "https://www.newsobserver.com/article259059118.html\nGOP's Madison Cawthorn hit with new voter challenges\nRaw Story, Sky Palma, 3/3/2022\nCawthorn must be held accountable for his actions which have threatened our democracy,? said Raleigh attorney John Wallace, according to the Associated Press.",
    "Numbers below listed on 3/6/22\nUSA\n NC\nTotal\n Cases\nNew\n Cases\nTotal\n Deaths\nNew\n Deaths\nTotal\n Recovered\nActive\n Cases\n3-6-22 2,598,014 22,763 2,534,052 41,199\n Track NC Covid Data Track NC Vaccine Data\nPlease jump the fold for links to stories I hope you find interesting and useful.",
    "Trump-appointed judge shuts down effort to block Madison Cawthorn from the NC ballot\nRaw Story, Sky Palma, /2022\nAn effort to keep U.S. Rep. Madison Cawthorn off North Carolina ballot this year was blocked by a federal judge this Friday, WRAL reports.",
    "However, just a month into 2022, when the fire erupted on Jan. 31, Winston-Salem Fire Chief Trey Mayo publicly announced that nearly 600 tons of ammonium nitrate had ignited; that's 10 to 20 times greater than amounts listed in the report.",
    "We hope this weekly platform gives readers interested in North Carolina politics a place to share their knowledge, insight and inspiration as we work on taking back our state from some of the most extreme Republicans in the nation.",
    "It's one of the most powerful economic policy posts in the country, meeting every six weeks to set our country's interest rate policy and decide how to keep inflation low, and our economy growing for everyone's benefit.",
    "The challenge was filed by attorneys who say Cawthorn is an insurrectionist who should be legally barred from the ballot due to his participation in events that led up to the riot at the U.S. Capitol on Jan. 6, 2021.",
    "After putting Florida fundraisers ahead of this weekend's debate, it's clear: Ted Budd is too weak to stand up to Trump and too chicken to show up for North Carolinians,? said NCDP spokesperson Kate Frauenfelder.",
    "Rather than lifting up concepts like shared sacrifice, self-reflection, or God forbid, slightly higher taxes to pay for the multi-trillion-dollar war he was about to launch, Bush told Americans to Get on board.",
    "Colorado: Mondays, 7:00 PM Mountain\n Michigan: Wednesdays, 6:00 PM Eastern\n North Carolina: Sundays, 1:00 PM Eastern\n Missouri: Wednesday Evenings\n Kansas: Monday Evenings\nSomething you want to highlight?",
    "Conservatives at the annual CPAC event and up the road at the America First gathering, praised China's totalitarian regime for its values and boosted Vladimir Putin amid his armed attack on the Ukraine.",
    "Yesterday, he doubled down, telling CBS17 that Putin is a very intelligent actor.?\nNORTH CAROLINA OPEN THREAD Sunday, March 6, 2022\n355th Weekly Edition\nThis is a weekly feature of North Carolina Blue.",
    "Rep. Graig Meyer, who has been in the House since 2013, and in recent years was heavily involved in candidate recruiting and fundraising for the Democratic caucus, is looking for a move to the Senate.",
    "But Cawthorn had argued that a pro-Confederate law passed during Reconstruction allowed many ex-insurrectionists to run for office, despite the 14th Amendment, and that it should apply to him too.",
    "https://www.wral.com/candidate-filing-closes-stage-set-for-legislative-primary-battles/20171004/\nWhy is Thom Tillis blocking a Black North Carolinian from the Federal Reserve's leadership?",
    "The opponents say the 14th Amendment to the U.S. Constitution bans those who have engaged in insurrection against the government from holding federal office like a seat in Congress.",
    "But, the fact is, Sen. Tillis blocked the historic appointment of a Black North Carolinian to the powerful Board of Governors of the Federal Reserve System in the same month.",
    "He'll have competition from Jamie DeMent Holcomb, a venture capitalist and farmer who has published two cookbooks and runs, among other things, an online farmers' market.",
    "It's called scorched-earth politics,? where one party's loss is always the other party's gain, and he doesn't seem to care if a worthy North Carolinian gets burned.",
    "On Instagram Cawthorn \"referred to Hitler as 'the Fuhrer,'\" which the Times of Israel says is a term of reverence, \"and said the spot was on his 'bucket list.'\"",
    "Yesterday, he doubled down, telling CBS17 that Putin is a very intelligent actor.?\nTed Budd's blind loyalty to Donald Trump is reaching new lows  even for him.",
    "https://t.co/9jC4PnpysN pic.twitter.com/rWSsjv6uqN\n GovTrack.gg (@govtrack) March 1, 2022\nCawthorn's extremism has grown in the 14 months he's been a U.S.",
    "The recent inventory shows that on a typical day in 2021 the plant had an average of 30 tons of ammonium nitrate on hand, with a daily maximum of 60 tons.",
    "Since attending a fundraiser in Mar-a-Lago with Donald Trump, where Trump called Putin smart,? Ted Budd has refused to stand up to the former president.",
    "Congressman, but he may be best known for his trip to Hitler's vacation home, the Eagle's Nest in Bavaria, when he was still a GOP candidate.",
    "During #BlackHistoryMonth, we recognize the experiences and contributions of Black North Carolinians to our state.?\nThose are easy words.",
    "Here's the story: President Biden nominated a slate of three people to fill vacant seats on the Federal Reserve's Board of Governors.",
    "Editorial: Troubling emergence of support for Putin\nWRAL, 3/2/2022\nThere was lots of rhetoric about freedom last weekend in Orlando.",
    "Twitter: @randallt\nPOSTED COVID data 3/6/2022 1:00pm EDT\nClick here for Covid-19 data from Worldometer Real Time World Statistics.",
    "North Carolina Policy Watch, 3/2/2022\nEarlier this past month, Sen. Thom Tillis tweeted something that no one could disagree with.",
    "Michael Spence, who filed the report on behalf of Weaver Fertilizer, told Policy Watch today that there was a typographical error.",
    "x\nIntroduced 2/8 and 2/9, @RepRosendale and @RepCawthorn introduce bills to ban aid to Ukraine until Mexico border is secured.",
    "Weaver Fertilizer didn't submit a chemical inventory to the state in 2020, in violation of federal reporting law.",
    "You've got two really strong candidates.? There are a bunch of good Dems who have filed for Congressional races.",
    "Cawthorn spoke to the Jan. 6 rally crowd and voted against certifying Democrat Joe Biden's presidential victory.",
    "If you are interested in starting your own state blog, weekly to occasionally, we will list your work below.",
    "While the brave people of Ukraine fight for their country and democracy, Budd is publicly praising Putin.",
    "He's got a bruising Primary brewing right now, so hopefully he won't even be on the ballot in November.",
    "His actions are wrong for our country, wrong for our state, and offensive to Black North Carolinians.",
    "Federal district court judge Richard Myers, a Trump appointee, agreed and ruled in Cawthorn's favor.",
    "Unfortunately, there was little support for those whose lives are on the line defending it.",
    "The bills, as GovTrack explains, \"ban aid to Ukraine until Mexico border is secured.\"",
    "You can also join the discussion in four other weekly State Open Threads.",
    "That's one to watch,? Morgan Jackson, a key political consultant to Gov.",
    "He's borrowing a favorite tactic out of the obstruction playbook.",
    "The daily maximum was, in fact, 600 tons, or 1.2 million pounds.",
    "Wisely, the Constitution provides a remedy for our protection.",
    "Fly and enjoy America's great destination spots.",
    "I hope you have a safe week, the floor is yours.",
    "The deadline for the 2021 report was March 1.",
    "As it turned out, the opportunity was missed.",
    "kosmail or email at randalltdkos at gmail.",
    "Thank you for reading and contributing.",
    "Here's the list, and it's a long one.",
    "Roy Cooper and other Democrats, said.",
    "Get down to Disney World in Florida.",
    "Do your business around the country.",
    "Please join us every week.",
    "So why is he doing it?",
    "Fingers crossed."
  ]
}