{
  "id": 3016,
  "mediaId": 43,
  "date": "3/3/2022 12:00:00 AM",
  "headline": "Tennessee hearing on book bans goes completely sideways",
  "image": "https://images.dailykos.com/images/1044287/story_image/ScreenShot2022-03-03at10.29.27AM.png?1646332177",
  "link": "https://www.dailykos.com/story/2022/3/3/2083651/-Tennessee-hearing-on-book-bans-goes-completely-sideways",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2496,
    2496,
    1062,
    1062,
    1222,
    1222,
    1158,
    1158,
    1336,
    1336,
    428,
    428,
    2932,
    2932
  ],
  "sentences": [
    "As Sharon Edwards, president of the Tennessee Library Association, attempted to explain to the subcommittee during the hearing, \"If the intent behind HB 1944 is to keep obscenity out of the hands of minors, then our current Tennessee code and the sound professional judgment of our school libraries and school boards are already doing this.? The testimony supporting the bill is bananas cocoa puffs ridiculous and the fact that the lawmakers listening to this tripe voted 7-3 in favor of advancing the bill out of a House subcommittee is a sad statement about that subcommittee.",
    "The closest translation I can get to what Jackson decided to paraphrase in the Bible she clearly believes is inerrant is from the old King James Version, which goes a little something like: For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places.? You know, if you really believe this is the inerrant word of God, publicly botching it is akin to blasphemy, but maybe this is Victoria Jackson's exegesis?",
    "It's had developmental harm, emotional harm done to them.?\nYou might remember Starbuck as the guy that monumental pathological liar and North Carolina Republican Rep. Madison Cawthorn brought onto the House floor, violating House rules without a doubt.? Starbuck's wife also spoke and claimed that the plan with these mysterious pornographic books is to lower the age of consent for pedophilia.",
    "The fact that there are already so-called obscenity? laws that regulate public libraries from offering up pornographic magazines and such seems not to matter to these folks, because what they really want is to redefine the word obscenity? to mean anything they would rather pretend didn't exist, or wish their powerless God could actually eradicatelike the LGBTQ+ community and Black folks.",
    "Just so you know I'm not being hyperbolic, her exact quote is: And the real agenda is to lower the age of consent and promote pedophilia.?\nAnother Republican candidate for a school board seat, Mark Woodward, explained how powerful pornography was: \"Pornography, it causes powerful chemicals to be released in the brain.",
    "In Tennessee, a group of concerned folks including former Saturday Night Live cast member Victoria Jackson spoke at a hearing in support of HB 1944, a bill that would ban obscene material? that is harmful to minors? from public school premises.? The bill's architects are trying to attack school libraries.",
    "But what was interesting to watch was the same Republican, Mark Woodward, almost lose his senses to hysterical laughter after another person made the monotone joke: How many adults have mastered critical thinking while horny?? Woodward, as you will see below, barely contained himself.",
    "x\nWATCH: The real agenda is to lower the age of consent and promote pedophilia.? g?gg\nBook banning zealots (including ex-SNL'er @VictoriaJackson) attack teachers & librarians with WILD, OFFENSIVE claims in support of @CepickyTn64's library censorship bill.",
    "First up are some bullet point statements that Jackson made:\nWe are in a spiritual battle, Ephesians 6:12, We wrestle not against flesh and blood, but against powers principalities, spiritual wickedness in high places.'?\nDid you get that?",
    "The book banning brigades, astro-turfed by big GOP donors and organized by activist groups with folksy names that are headed by Koch-funded right-wing think tanks, have stretched out across the country attacking schools and libraries.",
    "Concerned parent,? Robby Starbuck and his wife wanted everyone to know that while their kids are not in Tennessee public schools, they would like to decide how everybody else's children should learn about Christianity.",
    "She's also repeatedly called people like Hillary Clinton a socialist? and said President Barack Obama wants to be [Fidel] Castro.? So, you can probably guess at the tone of some of the quotes you are about to read.",
    "The hope is to whitewash literature in the hopes of immunizing generations of young conservatives from questioning the problems that conservative parents and elected officials refuse to try and solve.",
    "As The Tennessean pointed out, all of this scintillating talk about the boatloads of pornography on school library shelves did not come with a single example of such pornographynot a single example.",
    "She could also take a look over here at the votes the Communist Party in the U.S. got at the height of its popularity in our countryback when it wasn't even allowed on the ballot in many states.",
    "\"Thank God that we did pull our kids out of school, because I know our oldest child who's 13 now, her peers in public school have been exposed to this material.",
    "Here are some of Jackson's remarks, filled with the vapid and clunky stage performance that was her signature on the late-night sketch comedy show.",
    "The Communist Party USA, their goals are happening.?\nThat was her second stated reason, after the biblical spiritual battle? situation.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "There's also the general political ideology of implementing a conservative Christian theocracy into power in our country.",
    "pic.twitter.com/78PZbVZhEI\n The Tennessee Holler (@TheTNHoller) March 2, 2022\nThis is a short blurb about Daily Kos.",
    "Victoria Jackson's post-SNL career has consisted of saying a lot of unintelligent things concerning politics.",
    "Oh, almost forgot to mention, this parent is running in the GOP primary in Tennessee's 5th District.",
    "I won't mention that there's a good chance that Paul didn't actually write Ephesians at all.",
    "My innocence was never stolen, that's why I am the way I am.?\nLet's agree to disagree.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "I mean, so far, they haven't been nearly as successful as they might want to be.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "She's been an outspoken advocate for bad conservative talking points.",
    "x\nx\nx\nHere is a supercut with commentary from The Tennessee Holler.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "In the late Don Pardo's voice: \"On the left, Victoria Jackson!\"",
    "Would we leave heroin needles or meth out in schools?\"",
    "People are stealing the innocence of children.",
    "It's a substance that can be very addictive.",
    "You can read about CPUSA's plan here.",
    "Then came more political operatives.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "It moved to committee.",
    "Please read it.",
    "But what to do?"
  ]
}