{
  "id": 3018,
  "mediaId": 195,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "Five takeaways from the Texas primaries",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/article_images/abbottgreg_orourkebeto_ap_photos.jpeg?itok=Ubfwy35V",
  "link": "https://thehill.com/homenews/campaign/596468-five-takeaways-from-the-texas-primaries",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester",
  "termIds": [
    704,
    800,
    1253,
    1609,
    2135,
    2217,
    2250,
    2303,
    428,
    2934
  ],
  "sentences": [
    "While Luttrell came from a more traditional military background, Collins founded the Texas Youth Summit, which promoted speakers who tout the Judeo-Christian principles this country was founded upon.?\nShould Luttrell be elevated to the House next year, it could be a major boon to McCarthy's expected speakership bid if Republicans retake the House.",
    "Luttrell has indicated that he'll support McCarthy's ascension to speaker, but Collins has been cagier, saying only that he would follow the recommendation of the hardline House Freedom Caucus, a coalition of rabble rousers that has grown closer to McCarthy but already tanked a previous speakership bid in 2015.",
    "Morgan Luttrell, a former Navy SEAL running with the endorsement of House Minority Leader Kevin McCarthy, thrashed Christian Collins, a former staffer to Sen. Ted Cruz (R-Texas) who was endorsed by conservative firebrands like Reps. Marjorie Taylor Greene (R-Ga.) and Madison Cawthorn (R-N.C.).",
    "But the race between Rep. Henry Cuellar (D-Texas) and progressive favorite Jessica Cisneros, seen as a key bellwether for the left, appeared headed for a runoff, as neither candidate had reached 50 percent of the vote as of early Wednesday morning.",
    "Still, Paxton's failure to hit the 50 percent mark  even with Trump's support  is likely to raise further questions about just how far Republican primary voters are willing to go when it comes to taking directions from the former president.",
    "Abbott, a two-term governor, won the GOP gubernatorial primary with roughly 68 percent of the vote and kept his two main challengers, former state Sen. Don Huffines and former Texas GOP Chair Allen West, hovering at around 12 percent.",
    "Greg Abbott (R) and Beto O'Rourke (D) predictably won their parties' primaries for the gubernatorial nomination, while progressives saw a major win in the 35th House district and Republican Hispanic women saw victories in South Texas.",
    "Huffines in his concession took credit for pushing Abbott further to the right, saying he forced? Abbott to pay attention to issues like immigration and vaccine mandates and hinted he would remain a thorn in the governor's side.",
    "I will always fight to defend the God-given rights and liberties of Texans.?\nA crucial Trump endorsement falls short\nFor Texas Attorney General Ken Paxton, former President Donald Trump's endorsement was a blessing.",
    "The beleaguered state attorney general finished Tuesday with a significant lead over his three primary rivals, but he still fell short of the 50 percent threshold needed to clinch the Republican nomination outright.",
    "While it was still possible for Collins to gain enough ground to bring Luttrell's total to under 50, and thus trigger a runoff, Luttrell will still end the night with a sprawling lead.",
    "Among the criticism Abbott faced were claims that he waited too long to reopen the state from coronavirus restrictions and failed to curb unauthorized migration at the southern border.",
    "A runoff would indicate that Cuellar, who's ensnared in an FBI investigation into ties between Azerbaijan and U.S. businessmen, is on shaky ground after serving nine terms in the seat.",
    "Paxton is facing a host of legal and ethical challenges, including an indictment in state court for securities fraud and allegations of bribery and abuse of office.",
    "Mixed night for progressives\nProgressives scored a major win in the 35th district, where Austin City Councilmember Greg Casar glided to a relatively easy victory.",
    "Big night for Hispanic GOP women\nHispanic Republican women appeared to make gains in at least two South Texas districts in the early hours of Tuesday morning.",
    "Establishment Republicans score key win\nThe establishment wing of the GOP scored a major win over the party's far-right flank in a Houston-area GOP primary.",
    "The GOP's far-right flank had come out swinging against Abbott, accusing him of being insufficiently conservative and supportive of former President Trump.",
    "Meanwhile, in the Republican primary for the 28th Congressional District, Cassy Garcia appeared to be headed toward a runoff with Sandra Whitten.",
    "While Republicans widely expect him to emerge victorious in that runoff, the primary was still seen as a test of Trump's endorsement power.",
    "With over 85 percent of ballots casted, Luttrell was leading with over 53 percent of the vote, while Collins trailed with about 22 percent.",
    "The first primaries of the 2022 midterm election season took place in Texas on Tuesday, shaping the field for November's general election.",
    "Casar's win was badly needed for the progressive flank of the Democratic Party, which has seen a slew of defeats in recent elections.",
    "The ultimate nominee in the race will be the heavy favorite to win the deep-red seat being vacated by retiring Rep. Kevin Brady (R).",
    "Republicans made gains in South Texas in the 2020 presidential election due in large part to support from Hispanic men and women.",
    "But Abbott pushed forward in the most recent legislative session with a staunchly populist agenda with an eye on his right flank.",
    "Greg Abbott (R) flexed his political muscle Tuesday, pummeling two prominent primary challengers who were running to his right.",
    "He also allowed Texans to carry handguns without a permit and prohibited private businesses from instituting vaccine mandates.",
    "Republican Monica De La Cruz won her primary in the state's 15th Congressional District, defeating eight other GOP opponents.",
    "Results show Cisneros outperformed her 2020 primary performance when she lost to Cuellar by just under four points.",
    "Flores will take on Rep. Vicente Gonzalez, who currently represents the 15th Congressional District, in November.",
    "Casar was seen as a progressive favorite in the primary and is expected to coast to victory in November.",
    "Those policies, along with Trump's endorsement, helped Abbott blow by his conservative challengers.",
    "Though I will not be contesting the outcome of this election, I will not be going away,? he said.",
    "He will now face off against former Rep. Beto O'Rourke (D) in the November general election.",
    "Republicans in and out of Texas have since worked to recruit and message to Hispanic women.",
    "and Bernie Sanders (I-Vt.), along with progressive Rep. Alexandria Ocasio-Cortez (D-N.Y.).",
    "He will face Texas state Land Commissioner George P. Bush in the runoff later this year.",
    "He pushed for stringent abortion limits, instituted sprawling election restrictions.",
    "The Democratic primary in the 15th district appeared to be headed for a runoff.",
    "The bios of Luttrell and Collins underscored the shifting dynamics of the GOP.",
    "At the end of the night, however, it wasn't enough to save him from a runoff.",
    "Here are five takeaways from Tuesday's primaries in the Lone Star State.",
    "The victories point to the GOP's growing strength with Hispanic voters.",
    "Mayra Flores won her GOP primary in the 34th Congressional District.",
    "He touted support from major progressive figures including Sens.",
    "Abbott remains political force\nTexas Gov.",
    "Elizabeth Warren (D-Mass.)",
    "It's just one race.",
    "Gov."
  ]
}