{
  "id": 3020,
  "mediaId": 129,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "Cisneros forces Cuellar into a runoff, a sign of liberal strength in a key Texas congressional race.",
  "image": "https://static01.nyt.com/images/2022/03/01/multimedia/01texas-live-cong/01texas-live-cong-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/03/01/us/elections/texas-congress-28th-liberals-republicans.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    753,
    1459,
    2303,
    562,
    2557,
    2672,
    2703,
    2894,
    2934
  ],
  "sentences": [
    "Tonight's results show voters want elected officials who will take on corporate interests and deliver bold progressive policies for the American people,? said the leaders of the Congressional Progressive Caucus's political action committee, Representatives Pramila Jayapal of Washington, Mark Pocan of Wisconsin and Jamie Raskin of Maryland.",
    "In the race to replace retiring Representative Kevin Brady in Texas's eighth district, former Navy SEAL Morgan Luttrell, who was backed by House Republican leadership, had a wide lead over Christian Collins, the hard-right candidate backed by Representatives Marjorie Taylor Greene of Georgia and Madison Cawthorn of North Carolina.",
    "In Texas's 28th district, which stretches from San Antonio to the border region around Laredo, Jessica Cisneros, the immigration lawyer, was narrowly outpaced by Mr. Cuellar, one of the most conservative Democrats left in the House, after losing to him by 3.6 percentage points in the primaries in 2020.",
    "And a newly drawn, heavily Republican district south of Houston will send to Congress Wesley Hunt, an Army veteran with degrees from West Point and Cornell, and the backing of Representative Kevin McCarthy of California, the House Republican leader who aspires to be speaker.",
    "A 28-year-old liberal immigration lawyer was headed for a runoff in May with Representative Henry Cuellar, South Texas's 17-year incumbent, after neither candidate on Tuesday was able to muster 50 percent of the vote in the state's most closely watched House primary.",
    "But rather than run the issues-focused campaign she ran in 2020, Ms. Cisneros struck a narrative that after 17 years in Washington, the incumbent had become corrupt and captive to special interests, losing touch with the poor community that she personified.",
    "Ms. Cisneros was backed by the faces of progressive activism, Senator Bernie Sanders and Representative Alexandria Ocasio-Cortez, as well as Justice Democrats, the insurgent group that has pressed liberals to challenge established House incumbents.",
    "Mr. Crenshaw, an outspoken conservative, had nonetheless drawn a right-wing challenger, Jameson Ellis, after Mr. Crenshaw denounced the lie that the 2020 election was stolen from former President Donald J. Trump.",
    "Republicans were also facing a runoff to decide their standard-bearer in the district, but the top vote-getter on Tuesday, Cassy Garcia, was considered one of the best candidates available to face Ms. Cisneros.",
    "Greg Casar, another progressive activist, easily won the Democratic primary in a strongly liberal district that stretches from Austin to San Antonio, all but guaranteeing his election to the House in November.",
    "For Republican leaders eager to win control of the House, the congressional results were a promising sign that the party establishment can still beat back challenges from the far right.",
    "Mr. Ellis tried to label Mr. Crenshaw, a combat veteran who lost an eye in Afghanistan, a Republican in name only,? or RINO, but mustered only about 15 percent of the vote.",
    "In Texas' third district, north of Dallas, Representative Van Taylor remained at risk of being forced into a runoff by challengers on his right flank early Wednesday.",
    "Ms. Cisneros has said the Trump swing was an indication that South Texas voters were open to an outside voice after so many years with Mr. Cuellar's machine.",
    "She was the deputy state director for Senator Ted Cruz, Republican of Texas, and a regional field representative for the Texas agriculture commissioner.",
    "For Democrats, another lesson emerged  progressive activists could pull the party leftward next year, whether or not Democrats still control the House.",
    "Mr. Cuellar, perhaps the last remaining House Democrat who opposes abortion, has run to the right of his party on immigration and border security.",
    "Ms. Clinton's 60-point margin in Starr County, which is 96 percent Latino, shriveled to a five-point advantage for Joseph R. Biden Jr. in 2020.",
    "Governors' Races: Georgia's contest will be at the center of the political universe, but there are several important races across the country.",
    "It appeared that she was held below 50 percent because another liberal in the race, Tannya Benavides, had just under 5 percent of the vote.",
    "Representative Dan Crenshaw won three quarters of the vote in his redrawn district in the suburbs of Houston, despite far-right opposition.",
    "Those opponents castigated him for his vote to create an independent commission to examine the Jan. 6, 2021, attack on the Capitol.",
    "But with a young liberal as the potential Democratic nominee, Republicans would no doubt make a play for the district in November.",
    "With the race too close to call for much of the evening, Ms. Cisneros had told supporters who gathered in Laredo to not give up.",
    "Key Issues: Inflation, the pandemic, abortion and voting rights are expected to be among this election cycle's defining topics.",
    "In the House: Republicans and Democrats are seeking to gain an edge through redistricting and gerrymandering.",
    "The first primaries in what promises to be a grueling midterm season gave indications of battles to come.",
    "Hillary Clinton won heavily Latino Zapata County in the district's south by more than 30 points in 2016.",
    "We don't let that hope die, because we know we deserve so much better,? she said late Tuesday night.",
    "In the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "The 28th district shocked both parties in 2020 when it swung dramatically toward Mr. Trump.",
    "launched a still-unexplained raid on Mr. Cuellar's campaign headquarters and Laredo home.",
    "Mr. Hunt will fortify the House Republicans' small but growing number of Black members.",
    "For Democrats, a victory by Ms. Cisneros would have real repercussions.",
    "Her story was bolstered in January when the F.B.I.",
    "The Republican story was about the establishment.",
    "Then it went to Mr. Trump by about five points.",
    "Here are the four incumbents most at risk."
  ]
}