{
  "id": 3021,
  "mediaId": 43,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "Jon Stewart dares Republicans to water down PACT Act for veterans' health care benefits",
  "image": "https://images.dailykos.com/images/1043985/story_image/ScreenShot2022-03-02at2.07.34PM.png?1646260394",
  "link": "https://www.dailykos.com/story/2022/3/2/2083475/-Jon-Stewart-dares-Republicans-to-water-down-PACT-Act-for-veterans-health-care-benefits",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1108,
    1108,
    1397,
    1397,
    2038,
    2038,
    600,
    600,
    545,
    545,
    428,
    428,
    387,
    387
  ],
  "sentences": [
    "Stewart explained that while things were looking up and the veterans who planned on speaking with Congress over the next couple of days were feeling hopeful that something historic could happen, Make no mistake, we are at Congress.? Stewart's point was that Congress is a place where what is necessary becomes what they can get away with.? Stewart went on: There is going to be an amendment, and that amendment from ranking member Bost is going to say, Hey, all these military veterans' organizations and all these active military members have come together, with chairman [Rep.] Takano and Speaker Pelosi and the President of the United States, and they have designed a bill that will comprehensively address the urgent need in the veterans' community.? But ...\nAnd ranking member Bost's amendment is going to say, Damn, that's good work.",
    "What Naughton did add was that The PACT Act has a number of serious policy flaws, would cost taxpayers more than $300 billion, and is unlikely to pass the Senate in its current form.?\nBost and others would like to kick the can down the road, cut the costs of treating our veterans (since most of that tax money goes to making veterans instead of treating them), and are angling for the less comprehensive Health Care for Burn Pit Veterans Act to be the stand-in instead of the PACT Act.",
    "And as you know they are excellent at killing things that are necessary.?\nDeadline reports that Bost's spokesperson, Alexandra Naughton, said, Ranking Member Bost completely disagrees with Mr. Stewart's false characterization of his efforts but appreciates, and shares, his passion for the men and women who have served.? Of course, what was allegedly false? in this characterization of Bost's efforts? has been omitted.",
    "After saying that veterans have been fighting for these kinds of rights and humane treatment for decades and after saying that a bill like the Honoring Our PACT Act was more than long overdue, Stewart singled out the ranking Republican member of the House Veterans' Affairs Committee, Rep. Mike Bost (R-IL), after reports that Bost was looking at a way to undercut the bill's more comprehensive aspects.",
    "For Stewart it began by trying to get first responders to the 9/11 attacks the compensation they so thoroughly deserve, and has led to his advocacy for similar actions to be taken by Congress toward our military service members who have been exposed to terrible illnesses as a result of their proximity to burn pits and other toxic military practices.",
    "These men and women need better, deserve better, earned better, and you failed them!?\nConsidering that Rep. Bost's history is strewn with very dubious statements regarding disappearing guns and histrionic paper-punching, I'm going to say that I think Jon Stewart is a more reliable witness to the events unfolding.",
    "On Wednesday, comedian and veterans' activist Jon Stewart joined veterans and veteran organizations to speak out in support of the Honoring Our PACT Act, which would pay for benefits and primary care for veterans who have been exposed to toxic chemicals while serving overseas.",
    "Stewart has been an outspoken critique of the embarrassing lack of action on the part of our government to provide the basic level of health care reform to our veterans suffering from chronic issues caused by their exposure to toxic substances while serving our country.",
    "At a press conference in Washington, D.C., flanked by veterans and the families of veterans who have been directly affected by long-term health issues as a result of their military service to our country, Stewart made the bullet points very easy to understand.",
    "As advocate for burn pit benefits organizer John Feal said about the paltry GOP-supported legislation, You are putting a band aid on an open sucking chest wound with your bullshit legislation.",
    "Not happening.?\nStewart went on to warn that the Senate will also attempt the same shenanigans,? but that this was, is, and will always be unacceptable.",
    "You may remember Rep. Madison Cawthorn playing pretend Army and disrespectfully cleaning his gun during one such hearing earlier this year.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Stewart has worked behind the scenes to try and help veterans in their professional lives after serving their country.",
    "PACT stands for Promise to Address Comprehensive Toxics? and it sounds exactly like what it is.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "So, why don't we just switch that out for five more years of health care?",
    "We don't have corporate backers that are only in it for the bottom line.",
    "So once this is done, make no mistake, the battle shifts to the Senate.",
    "Committee hearings on this bill have been going on for some time.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "x\nx\nx\nThis is a short blurb about Daily Kos.",
    "Thanks, guys, we're good.' Fuck that!",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "It was worth a watch.",
    "Please read it.",
    "We good?"
  ]
}