{
  "id": 3022,
  "mediaId": 33,
  "date": "3/2/2022 12:00:00 AM",
  "headline": "Ken Paxton and George P. Bush will advance to May runoff in Texas attorney general primary, CNN projects",
  "image": "https://www.cnn.com/media/sites/cnn/video-placeholder.svg",
  "link": "https://news.google.com/__i/rss/rd/articles/CBMiWGh0dHBzOi8vd3d3LmNubi5jb20vMjAyMi8wMy8wMS9wb2xpdGljcy8yMDIyLXRleGFzLXByaW1hcnktZWxlY3Rpb24ta2V5LXJhY2VzL2luZGV4Lmh0bWzSAQA?oc=5/",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gregory Krieg",
  "authorUrl": "https://www.cnn.com/profiles/gregory-krieg",
  "termIds": [
    800,
    984,
    2233,
    2250,
    2303,
    106,
    2692,
    2934
  ],
  "sentences": [
    "Later that night, Harris County election officials said that this was merely a preliminary discussion? of a possible delay, and on Wednesday, they were confident they would meet the deadline to count votes while disputing earlier reports of damaged ballots.?\nThe primaries brought some poll worker shortages and other glitches, but Election Day itself was mostly calm  with the scramble to fix the unusually high number of faulty mail-in ballots emerging as the biggest challenge from this first round of voting.",
    "Afghanistan veteran Ruben Ramirez, a lawyer and former high school teacher backed by Gonzalez, has secured his spot, CNN projects, but it remains unclear whether John Villarreal Rigney, an attorney and owner of a South Texas construction firm, or Michelle Vallejo, a progressive small business owner endorsed by Massachusetts Sen. Elizabeth Warren, will be joining him.",
    "Crenshaw is one of the most conservative members in the GOP conference, and was a signatory to Paxton's 2020 election lawsuit, but he has occasionally sparred with the former President's closest allies, including Georgia Rep. Marjorie Taylor Greene, most recently criticizing her for speaking at a White nationalist conference over the weekend.",
    "Russian President Vladimir Putin's troops were camped out on the Ukrainian border when early voting began in Texas on February 14, and while the conflict appears unlikely to influence Tuesday night's elections, quick-moving events at home and abroad underscore the challenges facing candidates as the 2022 midterms begin in earnest.",
    "Republicans, including Trump, outperformed expectations with Latino voters in the 2020 elections and Cuellar has argued that his harder line on immigration issues, in a district that runs from the San Antonio suburbs down to the Rio Grande Valley and along the border to Laredo, is the only path for Democrats in the region.",
    "Despite the uncertainty surrounding the Cuellar-Cisneros race, another progressive backed by Sanders and Ocasio-Cortez, former Austin City Council Member Greg Casar, will advance to November, CNN projects, after earning a comfortable majority in the Democratic primary for the 35th District, a safe blue seat.",
    "Monica De La Cruz, who pulled off a surprising finish when she came within 3 points of dispatching Democratic Rep. Vicente Gonzalez in 2020, will win the GOP nomination for the newly redrawn 15th District, CNN projects, bolstered by the endorsement of both Trump and House Minority Leader Kevin McCarthy.",
    "Texas was the first of a number of Republican-led states to hold major elections after passing legislation, on the back of a political wave set off by Trump's long campaign to sow doubt over his loss in 2020, that complicates mail-in voting and outlaws other efforts to make the ballot more accessible.",
    "For Democrats, those contrasts have been on vivid display in the 28th Congressional District, where Rep. Henry Cuellar, one of the most conservative Democrats remaining in the House, and progressive challenger Jessica Cisneros will advance to a runoff, CNN projected Wednesday.",
    "CNN \nTexas Republicans will need a May runoff to decide their nominee for state attorney general after incumbent Ken Paxton fell short of clinching a majority in Tuesday's primary, setting up a showdown with Texas Land Commissioner George P. Bush in May, CNN projects.",
    "The pair clashed in a recent debate, which saw Guzman question Bush's qualifications and Bush denounce Guzman as a gutter politician.? More troubling for Paxton, though, was been the candidacy of Gohmert, whose ideological and geographic base overlaps with Paxton's.",
    "While Cuellar's bid for survival captured the most attention, Republicans were also closely watching GOP turnout in other parts of South Texas after stepping up their recruitment of candidates to run in a region that has been dominated by Democrats for decades.",
    "Bush, the latest in a political dynasty that, even with the Republican Party now in thrall to former President Donald Trump, maintains a considerable stature in Texas political circles and this campaign amounted a referendum on the future of that dynasty.",
    "But as the results came in, Texas shared the spotlight with President Joe Biden's State of the Union address on Capitol Hill and the rapidly escalating crisis in Ukraine, where invading forces from Russia are moving in on major cities across the country.",
    "Greg Abbott, a two-term incumbent, will defeat a crowded field of GOP challengers to secure the gubernatorial nomination, while Beto O'Rourke, a former congressman and Senate and presidential candidate, will win the Democratic nomination, CNN projects.",
    "Crenshaw, who ran unopposed in the 2020 GOP primary, triumphed over multiple challengers in the 2nd District attacking him from the right  a consequence, in part, of Texas Republicans' gerrymandering of the district to make it a safe red seat.",
    "The banner contest on Tuesday revolved around Paxton, the two-term incumbent who filed a failed lawsuit seeking to effectively overturn the 2020 election and ran under a cloud of legal issues, with the possibility of more on the horizon.",
    "Former Navy SEAL Morgan Luttrell is the national party's choice, but far-right opponent Christian Collins had the backing of Greene, Cawthorn, Cruz, and Joe Arpaio, the former Maricopa County, Arizona, sheriff who was pardoned by Trump.",
    "With a new congressional map designed to further reduce the number of contested seats on the map, most of both parties' nominees can expect that their primaries will be more fiercely fought than the contests that await in November.",
    "Votes are being counted in Texas in the first primaries of the 2022 midterms, with contests on both sides of the aisle poised to set the landscape for elections in November that could swing control of Congress to Republicans.",
    "In a cruel twist for the left, however, progressive candidate Tannya Benavides, who earned nearly 5% of the vote, may have siphoned enough support from Cisneros to prevent her from securing the 50% needed to avoid a runoff.",
    "As polls closed, Harris County officials warned of delays in reporting results, due to damaged ballot sheets that need to be duplicated,? according to a press release issued by state election officials late Tuesday.",
    "CNN projected that Taylor would advance to a May runoff against former Collin County Judge Keith Self, but the congressman suspended his reelection bid on Wednesday after admitting to an extra-marital affair.",
    "Cisneros' backbone of support came from the San Antonio suburbs, while Cuellar dominated in the border counties  a breakdown that will give both flanks of the party reason to celebrate and cause to fret.",
    "Cisneros, a 28-year-old immigration attorney backed by New York Rep. Alexandria Ocasio-Cortez and Vermont Sen. Bernie Sanders, nearly ousted the congressman from the South Texas seat in 2020.",
    "The leading problem, said Isabel Longoria, who presides over elections in populous Harris County, was voters did not include identifying numbers on the return ballot envelopes under the flap.",
    "But victory for Cisneros in May  and, should she win, the makeup of her coalition  will provide new insight into what the shifting margins from two years ago portend for the fall elections.",
    "Paxton led the four-candidate field by a comfortable margin, despite feisty and well-funded challenges from Bush, former state Supreme Court Justice Eva Guzman and Rep. Louie Gohmert.",
    "But his district is modestly more Democratic this time around, and Cisneros had received a late boost in the race when it was revealed that Cuellar is under investigation by the FBI.",
    "By contrast, fewer than 1% of mail-in ballots  or about 8,300 ballots statewide  were rejected in the 2020 general election, according to the US Election Assistance Commission.",
    "Some larger Texas counties have reported spikes in ballot rejections because would-be voters did not meet beefed-up and, to many, confusing new identification requirements.",
    "The Republican primary for the 28th District was not decided Tuesday, with Cassy Garcia, a former staffer to Texas GOP Sen. Ted Cruz, advancing to the runoff, CNN projects.",
    "Taylor's opponents in the 3rd District had attacked him over his vote to establish an independent commission to investigate the January 6 insurrection at the US Capitol.",
    "He will win his primary outright to move on the general election where he will face Mayra Flores, who will best three other candidates in the GOP primary, CNN projects.",
    "The diminishing number of swing districts means there has been an even greater focus on campaigns that cast opposing flanks of the parties against one another.",
    "Polling ahead of Election Day showed Paxton with a commanding lead but suggested he would fall short of the majority he needed to win the nomination outright.",
    "Greene and North Carolina Rep. Madison Cawthorn were also opposing GOP leadership in the race to replace retiring GOP Rep. Kevin Brady in Texas' 8th District.",
    "Hanging over the primary were concerns  at least among Democrats and voting rights advocates  about the effect of the state's restrictive new voting rules.",
    "On the Republican side, a perceived lack of fealty to Trump was among the factors that endangered incumbent Reps. Van Taylor and Dan Crenshaw.",
    "I guess what I'd say is, clearly, to the establishment: they got what they wanted,? Paxton said in a speech to supporters late Tuesday.",
    "The panel was rejected by Senate Republicans and effectively replaced by a select committee created by House Speaker Nancy Pelosi.",
    "His GOP challengers, led by Bush and Guzman, argued he could endanger the GOP's effort to yet again sweep statewide offices.",
    "The tally of potential ballot rejections as of Monday would represent 30% of the mail-in-ballots submitted in the county.",
    "Gonzalez is now running in the neighboring 34th District, which became more favorable for Democrats after redistricting.",
    "Even in this first round of voting, the divisions in the party were clear from early in the night.",
    "Like Bush, Guzman, who spent more than a decade on the state's high court, is a relative moderate.",
    "The decennial redistricting process has also added to primary night uncertainty  and intrigue.",
    "Allegations of Taylor's infidelity surfaced in right-wing media days before Tuesday's primary.",
    "Cuellar has denied any wrongdoing, and the specifics of the probe largely remain a mystery.",
    "But Taylor's vote riled some Trump supporters, which fueled the opposition against him.",
    "The second spot for that May contest had not yet been called as of midday Wednesday.",
    "The crowded Democratic race to face off with De La Cruz will be decided in a runoff.",
    "The Democratic primary for attorney general will also go to a runoff, CNN projected.",
    "This story has been updated with additional developments.",
    "The race was undecided as of Wednesday morning.",
    "They got me in a runoff.?\nTexas Gov."
  ]
}