{
  "id": 3026,
  "mediaId": 33,
  "date": "3/1/2022 12:00:00 AM",
  "headline": "Texas attorney general's race and other state primaries offer early tests for 2022",
  "image": "https://www.i.cdn.cnn.com/.a/2.285.4/assets/video_pinned_white_bg.jpg",
  "link": "https://www.cnn.com/2022/03/01/politics/2022-texas-primary-election-key-races/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Gregory Krieg",
  "authorUrl": "https://www.cnn.com/profiles/gregory-krieg",
  "termIds": [
    2416,
    2416,
    800,
    800,
    984,
    984,
    1459,
    1459,
    2233,
    2233,
    2250,
    2250,
    428,
    428,
    2934,
    2934
  ],
  "sentences": [
    "Two Latina GOP candidates -- Monica De La Cruz, who is running for the open seat in Texas' 15th District anchored by McAllen, and Mayra Flores, who is vying for Texas' 34th District, which runs north along the Gulf Coast from Brownsville -- have captured national attention as they have argued that Democrats are losing ground with Hispanic voters in the region because they have failed to adequately address their concerns about illegal immigration and the dangers posed by Mexican cartels.",
    "While Cuellar's bid for survival in the 28th District has captured the most attention, Republicans are also closely watching GOP turnout in other parts of South Texas, including in the populous areas along the border in Cameron and Hidalgo Counties, after stepping up their recruitment of candidates to run in a region that has been dominated by Democrats for decades.",
    "Crenshaw is one of the most conservative members in the GOP conference, and was a signatory to Paxton's 2020 election lawsuit, but he has occasionally sparred with the former President's closest allies, including Georgia Rep. Marjorie Taylor Greene, most recently criticizing her for speaking at a White nationalist conference over the weekend.",
    "Russian President Vladimir Putin's troops were camped out on the Ukrainian border when early voting began in Texas on February 14, and while the conflict appears unlikely to influence Tuesday night's elections, quick-moving events at home and abroad underscore the challenges facing candidates as the 2022 midterms begin in earnest.",
    "For Democrats, those contrasts have been on vivid display in the 28th Congressional District, where Rep. Henry Cuellar, one of the most conservative Democrats remaining in the House, is once again trying to fend off Jessica Cisneros, the 28-year-old immigration attorney who nearly ousted him from the South Texas seat in 2020.",
    "Republicans, including Trump, outperformed expectations with Latino voters in the 2020 elections and Cuellar has argued that his harder line on immigration issues, in a district that runs from the San Antonio suburbs down to the Rio Grande Valley and along the border to Laredo, is the only path for Democrats in the region.",
    "Some of the top candidates include Afghanistan veteran Ruben Ramirez, a lawyer and former high school teacher backed by Gonzalez; Michelle Vallejo, a progressive small business owner endorsed by Massachusetts Sen. Elizabeth Warren; and John Villarreal Rigney, an attorney and owner of a South Texas construction firm.",
    "Texas will be the first of a number of Republican-led states to hold major elections after passing legislation, on the back of a political wave set off by Trump's long campaign to sow doubt over his loss in 2020, that complicates mail-in voting and outlaws other efforts to make the ballot more accessible.",
    "The two-term incumbent, who filed a failed lawsuit seeking to effectively overturn the 2020 election, is running under a cloud of legal issues, with the possibility of more on the horizon, that his GOP challengers have argued could endanger the GOP's effort to yet again sweep statewide offices.",
    "(CNN)The first primaries of the 2022 midterms on Tuesday in Texas, headlined by a feisty Republican scramble in the attorney general's race, are poised to reverberate through both parties and set the landscape for elections in November that could swing control of Congress to Republicans.",
    "And Cisneros, who has been endorsed by New York Rep. Alexandria Ocasio-Cortez and Vermont Sen. Bernie Sanders, and was, like Ocasio-Cortez, recruited to run by the progressive group Justice Democrats, got a late boost when it was revealed that Cuellar is under investigation by the FBI.",
    "Democrats can restore their dominance in the Rio Grande Valley, he argues, by more effectively explaining to voters how the party's social programs have improved their lives: \"I think we need to get back to bread-and-butter issues as a party and not get caught up on extremes.\"",
    "The narrow favorite to set a spring date with Paxton is Texas Land Commissioner George P. Bush, the latest in a political dynasty that, even with the Republican Party now in thrall to former President Donald Trump, maintains a considerable stature in Texas political circles.",
    "But even as the results begin to filter in, Texas will share the spotlight with President Joe Biden's State of the Union address on Capitol Hill and the rapidly escalating crisis in Ukraine, where invading forces from Russia are moving in on major cities across the country.",
    "Former Navy SEAL Morgan Luttrell is the national party's choice, but far-right opponent Christian Collins has the backing of Greene, Cawthorn, Texas Sen. Ted Cruz, and Joe Arpaio, the former Maricopa County, Arizona, sheriff who was pardoned by Trump.",
    "The Democratic left will be closely watching returns from the state's 35th District, a safe blue seat, where former Austin City Councilman Greg Casar, a progressive, is hoping to secure the nomination in a crowded field with a primary night majority.",
    "Crenshaw, who ran unopposed in the 2020 GOP primary, is also facing multiple challengers in the 2nd District attacking him from the right -- a consequence, in part, of Texas Republicans' gerrymandering of the district to make it a safe red seat.",
    "He attributes the GOP's gains in the region to Democrats' decision to pause most in-person campaigning during the pandemic in 2020 but has also been open about his concerns that his party's drift to the left has alienated some voters.",
    "With a new congressional map designed to further reduce the number of contested seats on the map, most of both parties' nominees can expect that their primaries will be more fiercely fought than the contests that await in November.",
    "She is running again in the newly redrawn 15th District, bolstered by the fact that new lines have made the district more favorable to Republicans, and with the endorsement of both Trump and House Minority Leader Kevin McCarthy.",
    "Greg Abbott is well-positioned to see off a crowded field of GOP challengers and Democrat Beto O'Rourke, a former congressman and Senate and presidential candidate, is the overwhelming favorite to win the Democratic nomination.",
    "The bigger question now: If Paxton falls short of the threshold, which of his opponents -- all estimable candidates with broad followings and significant resources -- will advance to a potential one-on-one contest in late May?",
    "De La Cruz pulled off a surprising finish when she came within 3 points of dispatching Democratic Rep. Vicente Gonzalez in 2020, despite spending less than half as much as he did and lacking institutional support.",
    "Recent polling shows Paxton with a commanding lead in the four-way primary, but he's likely to fall short of the majority needed to clinch the nomination, which would send the race to a runoff.",
    "Gonzalez is now running in the neighboring 34th District, which became more favorable for Democrats after redistricting and where he could face Flores if she survives her four-way GOP primary.",
    "Victory for Cisneros -- and, should she win, the makeup of her coalition -- will provide new insight into what the shifting margins from two years ago portend for the fall elections.",
    "Of more concern to Paxton, at least as this first primary round shakes out, is the candidacy of US Rep. Louie Gohmert, whose ideological and geographic base overlaps with Paxton's.",
    "Some larger Texas counties have already reported spikes in ballot rejections because would-be voters did not meet beefed-up and, to many, confusing new identification requirements.",
    "The signal to national Democrats from the South Texas showdown may be more clear, especially if Cuellar is able to overcome his legal concerns and defeat Cisneros again.",
    "Hanging over it all, though, are concerns -- at least among Democrats and voting rights advocates -- about the effect of the state's restrictive new voting rules.",
    "The diminishing number of swing districts means there has been an even greater focus on campaigns that cast opposing flanks of the parties against one another.",
    "Greene and North Carolina Rep. Madison Cawthorn are also opposing GOP leadership in the race to replace retiring GOP Rep. Kevin Brady in Texas' 8th District.",
    "Taylor's opponents in the 3rd District have attacked him over his vote to establish an independent commission to investigate the January 6 insurrection.",
    "It would also reinvigorate a progressive movement that was put on the backfoot when Biden's signature social spending bill flopped in the Senate.",
    "Like Bush, former Texas Supreme Court Justice Eva Guzman, who spent more than a decade on the state's high court, is a relative moderate.",
    "The pair clashed in a recent debate, which saw Guzman question Bush's qualifications and Bush denounce Guzman as a \"gutter politician.\"",
    "The panel was rejected by Senate Republicans and effectively replaced by a select committee created by House Speaker Nancy Pelosi.",
    "Cuellar's district is modestly more Democratic this time around, but the race is, once again, expected to go down to the wire.",
    "On the Republican side, a perceived lack of fealty to Trump has endangered incumbent Reps. Van Taylor and Dan Crenshaw.",
    "The decennial redistricting process has also added to primary night uncertainty -- and intrigue.",
    "Cuellar has denied any wrongdoing and the specifics of the probe largely remain a mystery.",
    "The banner contest on Tuesday revolves around Texas Attorney General Ken Paxton.",
    "But Taylor's vote riled some Trump supporters and helped seed his current race.",
    "The six-way race on the Democratic side is viewed by most as a toss-up.",
    "Casar, like Cisneros, was endorsed by Sanders and Ocasio-Cortez.",
    "The primaries for governor figure to provide less drama.",
    "Two-term incumbent Republican Gov."
  ]
}