{
  "id": 3027,
  "mediaId": 43,
  "date": "3/1/2022 12:00:00 AM",
  "headline": "Fanatical Republican Extremist of the Day: Dan Bishop",
  "image": "https://images.dailykos.com/images/1043444/story_image/Bishop-Dan.jpg?1646132106",
  "link": "https://www.dailykos.com/story/2022/3/1/2083092/-Fanatical-Republican-Extremist-of-the-Day-Dan-Bishop",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1078,
    1078,
    1147,
    1147,
    813,
    813,
    2250,
    2250,
    2277,
    2277,
    1812,
    1812,
    1792,
    2087,
    2087,
    1459,
    1454,
    1459,
    1454,
    1299,
    1299,
    1723,
    1723,
    1670,
    1792,
    1670,
    1560,
    1560,
    428,
    254,
    254,
    181,
    181,
    428,
    498,
    498,
    2934,
    2934,
    2942,
    2942,
    2834,
    2834,
    2557,
    2557,
    2703,
    2703
  ],
  "sentences": [
    "Or, y'know, maybe someone can file the same kind of lawsuit that Madison Cawthorn has been hit with to block this seditious bigot from getting to run for any office in North Carolina, ever again.|\nClick Here for Full FRED Archive\nOne Year Ago, February 21st, 2021: Mike Hubbard (AL)\n Two Years Ago, February 21st, 2020: Michele Presnell (NC)\n Three Years Ago, February 21st, 2019: Omar Navarro (CA)\n Four Years Ago, February 21st, 2018: Rayne Brown (NC)\n Five Years Ago, February 21st, 2017: Isaac Latterell (SD) 2017 Update\n Six Years Ago.",
    "Welcome to what is the 1079th original profile here at Fanatical Republican Extremist of the Day?, where we'll be discussing the sitting U.S. House Representative from North Carolina's 9th Congressional District, Dan Bishop, who has served in that role after winning office in a special election in September of 2019, and prior to that, Bishop cut his teeth in the North Carolina state legislature for five years.",
    "Well, of course he falls into the category best summarized as seditious prick?:\nDecember 18th, 2019: Rep. Bishop ignores his Congressional duty to hold a president who has been proven to commit high crimes and misdemeanors accountable and votes against the first impeachment of Donald Trump for trying to deny Congressionally approved military aid to Ukraine in exchange for a political favor.",
    "And the fact that Bishop emerged out of the GOP primary for the seat in Congress that was never given to Mark Harris due to his being caught cheating to win that election well, it was hard to celebrate, given that Dan Bishop was the guy who is such a brilliant legislator that at the state level he had sponsored the transphobic bathroom bill, North Carolina's HB 2.",
    "During early protests over the bill that included people following North Carolina Governor Pat McCrory at the time to heckle him by chanting Shame? again and again, Bishop decided to let everyone know he'd rather not allow you to have the First Amendment right to protest against any of his terrible ideas, offering a bill to try to criminalize such behavior.",
    "March 17th, 2021: Rep. Bishop votes against the re-authorization of the Violence Against Women Act, likely because they feel the 2nd Amendment remaining absolute is more important than preventing people with a history of domestic abuse from owning a firearm (which statistics show, makes them more likely to use those firearms against women in their lives).",
    "Subsequent investigations into Dan Bishop's e-mails in the state legislature by public records laws looking for his motivations in harassing transgendered citizens showed him shrugging off criticisms from LGBTQ activists in the wake of HB 2, and agreeing with a constituent who compared them to the Taliban.",
    "Should it surprise anyone that this fanatic also was discovered to have been one of the financial backers of the Gab platform that was created in the wake of Charlottesville by white nationalists so they could continue to be awful and plot domestic terror attacks online without being moderated.",
    "Yes, when you're such a moron that you come up with ideas that can cost a state about 3 or 4 billion dollars in lost revenue, that's a level of extremist that everyone should grimace at the thought of failing up to do things in Washington DC that can impact the whole nation.",
    "February 4th, 2021: Dan Bishop votes to keep Marjorie Taylor Greene's committee assignments, because he wouldn't want her to be accountable for all the bigoted remarks and conspiracy theories she's spread online (probably because she's a kindred spirit).",
    "January 6th, 2021: After a group of Trump-supporting, fascist domestic terrorists spend a day terrorizing the Capitol Building, upset over the results that Trump lost the election, Dan Bishop votes against certifying the electoral college results.",
    "Dan Bishop is currently fretting that after redistricting, he no longer feels as safe running for North Carolina's 9th District, so instead, he's choosing to run in North Carolina's 8th, instead even though he doesn't live there.",
    "North Carolina Congressman Dan Bishop, from NC-9, who somehow failed up into a seat in the U.S. House even though he produced a piece of transphobic, failed legislation so stupid it cost the Tar Heel State between $3-4 BILLION.",
    "When the rest of the North Carolina state legislature hustled to repeal HB 2 in early 2017 so they could stop being boycotted for their bigotry, he called it a betrayal of principle?.",
    "March 3rd, 2021: Rep. Bishop votes against HR 1, a bill created to prevent the corruption of money in politics, and protect voter access to the ballot box.",
    "February 25th, 2021: Bishop votes against HR 5, the latest version of the Equality Act, that would provide workplace protections for LGBTQ Americans.",
    "March 10th, 2021: Bishop votes against the American Rescue Plan Act of 2021, because he feels people deserve to die in poverty during a pandemic.",
    "May 15th, 2020: Bishop votes against the HEROES Act, to further support the healthcare industry and citizens affected by the Covid-19 pandemic.",
    "December 10th, 2020: Bishop signs his name to an amicus brief to the Supreme Court, begging them to overturn the results of the 2020 election.",
    "January 13th, 2021: Bishop votes against the second impeachment of Donald Trump, Because accountability is anathema to the GOP.",
    "*]May 19th, 2021: Rep. Bishop votes against HR 3233, the creation of a commission to investigate the Capitol Attack.",
    "February 21st, 2016: Isaac Latterell (SD) Original Profile\n Seven Years Ago, February 21st, 2015: Scott Beason (AL)",
    "Because if there's anything the Taliban is known for, it's their tolerance of gay and transgendered people.",
    "November 5th, 2021: Dan Bishop votes against HR 3684, the Infrastructure Investment and Jobs Act.",
    "March 3rd, 2021: Dan Bishop votes against the George Floyd Justice in Policing Act of 2021.",
    "How has his voting record been since hitting the Capitol?",
    "The same election that he won re-election in.",
    "And goddamn, is he dedicated to his idiocy."
  ]
}