{
  "id": 3030,
  "mediaId": 151,
  "date": "2/28/2022 12:00:00 AM",
  "headline": "6 House races to watch in Texas",
  "image": "https://static.politico.com/dd/46/bfad657b4ec29695b5b2f12ac846/https-delivery.gettyimages.com/downloads/1331494999",
  "link": "https://www.politico.com/news/2022/02/28/house-races-texas-00012422",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1459,
    1515,
    1846,
    1994,
    2168,
    2303,
    2350,
    562,
    2557,
    2894,
    2934
  ],
  "sentences": [
    "On the Republican side, there's no shortage of primary challengers running in former President Donald Trump's image, slamming incumbent lawmakers as Republicans-In-Name-Only for appearing disloyal to the former president in the wake of the 2020 election and the Jan. 6 attack on the Capitol.",
    "Greene and Rep. Madison Cawthorn (R-N.C.) recently traveled to Texas to boost far-right activist Christian Collins, hoping to force him into a runoff against former Navy SEAL Morgan Luttrell, who's backed by the McCarthy-aligned Congressional Leadership Fund.",
    "| Kevin Dietsch/Getty Images\nBy Stephanie Murray\n 02/28/2022 02:42 PM EST\nThe 2022 midterm elections officially kick off Tuesday in Texas, which will feature 38 congressional races, in addition to a handful of contested primaries for statewide office.",
    "But there's still plenty to watch in the state, starting with Texas' 28th District where progressives are trying to oust Democratic Rep. Henry Cuellar in one of the biggest tests of how strong the party's left wing will be this election season.",
    "Texas 8th District: The crowded race to replace retiring Rep. Kevin Brady has attracted the attention of some of the GOP's biggest names, including House Minority Leader Kevin McCarthy and Rep. Marjorie Taylor Greene (R-Ga.).",
    "Two, we need to bolster the ranks of the Congressional Progressive Caucus.? Our Revolution, an offshoot of Sen. Bernie Sanders ' (I-Vt.) presidential campaign, has more than 50 volunteers involved in these three contests.",
    "Redistricting made Taylor more vulnerable to a primary challenge: Under the old lines, Trump won Taylor's district by 1 percentage point in 2020, but carried it by nearly 15 percentage points on the new map.",
    "Texas 3rd District: Rep. Van Taylor is defending his seat against a group of GOP challengers, including businessperson Suzanne Cassimatis Harp and former Collin County Judge Keith Self.",
    "CLF has spent more than a half-million dollars on TV ads boosting Luttrell  an unusual move for the group, which typically does not get involved in safe Republican seat primaries.",
    "While Cuellar has outraised his challenger, Justice Democrats, a progressive group, has spent more than $420,000 on TV, mail and digital ads via its independent expenditure arm.",
    "Protect Our Future PAC and Web3 Forward have each pledged to spend $1 million, although it's not clear whether Crockett will be able to escape a runoff in the crowded race.",
    "One is take out corporate Democrats, Democrats who are not 100 percent behind the Democratic platform,? Our Revolution Executive Director Joseph Geevarghese said.",
    "Super PACs linked to cryptocurrency moguls have pledged to spend $2 million to boost Crockett  by far the most significant spending in the primary contest.",
    "Crenshaw's primary challengers, like Jameson Ellis, are slamming him as a neocon? and a RINO? for his defections from Trump's election conspiracy theories.",
    "Progressives are trying to oust Democratic Rep. Henry Cuellar in one of the biggest tests of how strong the party's left wing will be this election season.",
    "Texas 35th District: National progressives have rallied around Democrat Greg Casar, a former member of the Austin City Council, in this open-seat primary.",
    "Crenshaw has emerged as one of his state's top fundraisers, pulling in $11.2 million last year, and he's cultivated his own army of youth activists.",
    "Texas 2nd District: GOP Rep. Dan Crenshaw isn't in danger of losing reelection, but he's still an interesting candidate to watch on Tuesday night.",
    "Texas 28th District: In the 2020 Democratic primary, Cuellar narrowly defeated progressive challenger Jessica Cisneros by fewer than 3,000 votes.",
    "Harp bashed Taylor as one of the worst RINOs of all? in a recent video, while Self deemed him an elitist politician? on his campaign website.",
    "Texas 30th District: Rep. Eddie Bernice Johnson opened up a crowded Democratic primary in this seat when she opted to retire from the House.",
    "The high-profile Crenshaw is a Trump ally, though not exactly a loyalist, having called out false claims that the 2020 election was rigged.",
    "The longtime incumbent has endorsed a successor: state Rep. Jasmine Crockett, who is backed by Our Revolution, the Sanders-inspired group.",
    "Both candidates are running to Taylor's right and weaponizing his vote for a commission to investigate the Jan. 6 attack on the Capitol.",
    "But it's a nine-way race, which includes an alum of President Joe Biden's Texas campaign, a former state lawmaker and a Navy veteran.",
    "Here's a roundup of six key House races, three in each party, that could tell us the direction the midterms are headed.",
    "Also running are Democratic state Rep. Eddie Rodriguez and former San Antonio City Council member Rebecca Viagran.",
    "(The seat became open after Rep. Lloyd Doggett swapped districts to run in the newly created 37th District).",
    "Cisneros is back for a rematch this year in what will be the most-watched House race on the ballot tomorrow.",
    "This time around, Cisneros and her allies have seized on a recent FBI raid of Cuellar's home in Laredo.",
    "The former president has been more focused on statewide races for governor and state attorney general.",
    "One thing to remember: Crenshaw's seat became significantly more conservative during redistricting.",
    "Not all of those elections are competitive: 14 House incumbents have no primary opposition at all.",
    "His role is very limited and hard to even pin down,? Travis County GOP chair Matt Mackowiak said.",
    "Rep. Alexandria Ocasio-Cortez (D-N.Y.) recently visited Texas to boost both Casar and Cisneros.",
    "But Trump hasn't backed any GOP primary challengers to Texas congressional incumbents.",
    "The deep blue district encompasses parts of Austin and stretches to San Antonio.",
    "Trump won the district by 23 percentage points under the new lines.",
    "What has he really done to involve himself in these primaries?",
    "We have to do two things."
  ]
}