{
  "id": 3036,
  "mediaId": 43,
  "date": "2/25/2022 12:00:00 AM",
  "headline": "Highlights from The Downballot: A Texas primary preview with Jeff Singer",
  "image": "https://images.dailykos.com/images/1026569/story_image/GettyImages-1349469731.jpg?1642186718",
  "link": "https://www.dailykos.com/story/2022/2/25/2082136/-Highlights-from-The-Downballot-A-Texas-primary-preview-with-Jeff-Singer",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1882,
    2268,
    2277,
    2303,
    2497,
    146,
    371,
    2602,
    2834,
    2934
  ],
  "sentences": [
    "<iframe title=\"Libsyn Player\" style=\"border: none\" src=\"//html5-player.libsyn.com/embed/episode/id/22238255/height/90/theme/custom/thumbnail/yes/direction/forward/render-playlist/no/custom-color/000000/\" height=\"90\" width=\"100%\" scrolling=\"no\" allowfullscreen webkitallowfullscreen mozallowfullscreen oallowfullscreen msallowfullscreen></iframe>\n The Downballot\nTexas primary preview, with Jeff Singer\n 30\n 00:00:00 / 00:44:16\n 30\nIn North Carolina, the state's supreme court drew a new set of maps that Beard considers to be generally rather fair.",
    "The pair also discussed Texas Lieutenant Governor Dan Patrick, who has led the charge on passing very aggressive voter suppression bills in Texas and ironically sent a mass mailing to thousandsprobably tens of thousands, or even hundreds of thousandsof Republican voters in Texas telling them that they're eligible for mail-in ballots, which is true because it was sent to senior citizens, and telling them that all they to do was send their application to the secretary of state's office.",
    "So while we're still stuck with them, I like to think that they both lost in this situation,? Beard added, which makes me happy.?\nNir reminded the audience that Cawthorn is being investigated over his involvement in the Jan. 6 insurrection: We also shouldn't forget about the fact that there is still a pending challenge to Madison Cawthorn's eligibility to even appear on the ballot because of his involvement around the Jan. 6 insurrection and invasion of the Capitol.",
    "<iframe title=\"Libsyn Player\" style=\"border: none\" src=\"//html5-player.libsyn.com/embed/episode/id/22238255/height/90/theme/custom/thumbnail/yes/direction/forward/render-playlist/no/custom-color/000000/\" height=\"90\" width=\"100%\" scrolling=\"no\" allowfullscreen webkitallowfullscreen mozallowfullscreen oallowfullscreen msallowfullscreen></iframe>\n The Downballot\nTexas primary preview, with Jeff Singer\n 30\n 00:00:00 / 00:44:16\n 30\nThis is a short blurb about Daily Kos.",
    "As Beard elaborated,\n[On] all the previous maps, there was only one Democratic district centered on Charlotte, and this new map has a Democratic district covering the northern half of the city, which is together with Mecklenburg County, into the county north of it, and then a second district covering the southern half of the city, going west into Gastonia.",
    "Texas Republicans engaged in a widespread defensive gerrymander with their new congressional map, meaning that rather than try to draw lines to jeopardize Democratic control over Democratic seats, they took extreme steps to shore up vulnerable Republican seats, in many cases moving them 10 to 20 or more points to the right.",
    "Gonzalez, he's supporting army veteran Ruben Ramirez in a crowded race where no one has really raised much money or really stood out  We'll see if his endorsement is enough to help Ramirez, but given that there are several people on the ballot, it's probably going to be hard for anyone to win a majority of the vote here.",
    "North Carolina law forbids insurrectionists from running for office, so this challenge remains pending.?\nIn Oregon, former New York Times columnist Nicholas Kristof decided he wanted to run for governor in his home state this yearthe only problem being that he was not eligible to run.",
    "And at the time in the Morning Digest, someone ... wrote that he's refusing to step down so far, but it's hard for a state's top law enforcement official to continues serving while he's accused of breaking his own state laws.?\nTX-15 is another one to keep an eye on.",
    "Nir wasn't a fan of how Kristof, who claimed that the failing political establishment in Oregon [has] chosen to protect itself,? reacted to the situation:\nWhen the state supreme court ruling came down, Kristof, as I said, was very demure, very deferential.",
    "The results are particularly interesting in terms of both U.S. Rep. Madison Cawthorn, who is jumping into the 14th District from his current, the 11th, and North Carolina House Speaker Tim Moore, who has essentially lost his seat due to the redistricting.",
    "[Moore] hates this map, and he has made a big show that he's going to go appeal this to the North Carolina Supreme Court [and] probably the federal courts because he wants, by all accounts, his congressional seat that he drew himself back.",
    "Joining them was Daily Kos elections editor Jeff Singer, who, as Nir said, has an encyclopedic knowledge of every downballot race? and helped guide listeners through the most interesting contests on the statewide and congressional levels.",
    "With the gubernatorial election, which will see Beto O'Rourke face off against incumbent Greg Abbott, Democrats may have more of an uphill battle, Singer said:\nTexas has not elected a Democrat to statewide office since 1994.",
    "Singer touched on Jessica Cisneros' challenge to incumbent Henry Cuellar in the 28th District, where this time around, a third candidate is running that may prevent either candidate from winning a majority in the primary.",
    "If no one gets a majority on that day, and it's incredibly likely that no one will, then the top two vote-getters, regardless of party, will run on June 7, which is also the day of California's normal statewide primary.",
    "But just on Wednesday, the courts that were going to be reviewing these remedial mapsthey decided that the congressional map, where they drew a number of competitive but Republican-leaning seats, was not acceptable.",
    "This week on The Downballot, cohosts David Beard and David Nir took a deep dive into Tuesday's primaries in Texas, which will be the first of the year and can be considered the official start of the 2022 midterms.",
    "I think that Democrats simply cannot put forward candidates who are going to engage in the same kinds of attacks on election officials that we have seen Republicans at every level, from Trump on down, engage in.",
    "When he filed for the ballot, Secretary of State Shemia Faganalso a Democratsaid that he did not meet a requirement under Oregon law, that he be a \"resident of the state for three years prior to the election.\"",
    "In CA-22, where there is a special election for Devin Nunes' now-vacant seat, things are complicated as the old district got chopped up between four other districts in the new map.",
    "Singer's personal favorite race on the ballot on Tuesday is one in which Ken Paxton, the Republican attorney general of Texas, is running for reelection: He was elected in 2014.",
    "So as a result, most, though not all, of the races that we're going to be talking about, most of these primaries are for seats that are safely in one party's hands or the other.",
    "He's running for a different district that's become much bluer from redistricting, the 34th, which is open because a different Democratic congressman, Filemon Vela, is retiring.",
    "It's always possible that if, say, one candidate gets 49.9%, the trailing candidate will just say, I'm not going to win this,' and they can specifically request no runoff ...",
    "Moore, who thought that he got his seat back, now doesn't have a seat again because it's way too Democratic for him to possibly win this seat.",
    "Nir explained,\nSo whoever wins is going to spend a very brief time in Congress, and perhaps they'll parlay that into something in the future.",
    "Beard and Nir also discussed a rundown of interesting or under-covered issues that have popped up in the land of elections in the past week.",
    "At this point, Nir and Beard welcomed Singer onto the show to talk about the Texas primaries, where runoffs may feature front and center.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "And this new map is really a very fair map for North Carolina's overall partisan [makeup], where it's a very close state.",
    "Whichever way that this race for Oregon's governorship goes, it's going to be a competitive, open-seat race this fall.",
    "It's maybe slightly Republican-leaning, but that included a second Charlotte district that is as Democratic-leaning.",
    "Of course, Texas just went up two districts, from 36 to 38, so that increases the odds for more runoffs,? Nir added.",
    "And if 2022 shapes up to be a tough year for Democrats nationally, it's going to be very hard to break that trend.",
    "Democrats also lost the governorship that year when incumbent Ann Richards lost to none other than George W. Bush.",
    "In 2020, there were 15 house primaries that went to runoffs; a similar number, 17, the cycle before that in 2018.",
    "If no one receives a majority of the vote, then the two candidates with the most votes proceed to a May runoff.",
    "The 15th has been represented by Democratic Congressman Vicente Gonzlez since 2017, but he's not running there.",
    "But I wouldn't be surprised if turnout is extremely low as folks focus on the actual elections for full terms.",
    "It doesn't look like Madison Cawthorn is going to get some sort of uber-red Charlotte area district to run in.",
    "Singer replied:\nThis is another seat in the Rio Grande Valley, an area that swung hard to the right in 2020.",
    "But one real exception to that rule is the first one on our list, which is the 15th congressional district.",
    "Trump won it by a few points, potentially competitive, especially if Trump's 2020 gains were temporary.",
    "Under Texas law, individuals must send all mail and ballot requests to their local county officials.",
    "In Texas primaries, candidates must receive a majority of the vote to win the nomination outright.",
    "So we'll see some action in May, no doubt.?\nAnd runoffs are something we can definitely expect.",
    "You can listen to the full episode below:\nx\nx\n  \n This content requires a premium subscription.",
    "Several strong Democratic candidates have run since then, but they've all fallen well short ...",
    "And they substituted a map drawn by some special masters that the court had appointed.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Some races though, the field is just too large for that to reasonably happen.",
    "That special election, by the waythere is an all-party primary on April 5.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "That's a pretty good chunk of all of the House races out there.",
    "You can find The Downballot wherever you get your podcasts.",
    "And so both of these districts are Democratic-leaning.",
    "x\nx\n  \n This content requires a premium subscription.",
    "But it doesn't look like he's going to get that.",
    "And she really lit into him, and deservedly so.",
    "That means we have an open race for the 15th.",
    "He was indicted in 2015 for securities fraud.",
    "So candidates, they want to win a majority.",
    "Singer, what's going on there?? Nir asked.",
    "So I say to Nick Kristof, good riddance.",
    "Please log in or subscribe to continue.",
    "Please log in or subscribe to continue.",
    "New episodes come out every Thursday!",
    "Both parties have large fields there.",
    "But that's pretty rare,? Singer said.",
    "And Fagan held a press conference.",
    "Gonzalez is running there instead.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "It's a hard state.",
    "Please read it."
  ]
}