{
  "id": 3037,
  "mediaId": 21,
  "date": "2/24/2022 12:00:00 AM",
  "headline": "Rep. Madison Cawthorn says petitioners are 'very close' to getting him barred from running for re-election this year",
  "image": "https://i.insider.com/61c3d9931f3fca0018a53278?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/madison-cawthorn-very-close-to-being-barred-from-election-2022-2",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Loh",
  "authorUrl": "https://www.businessinsider.com/author/matthew-loh",
  "termIds": [
    2222,
    2303,
    261,
    428,
    2834
  ],
  "sentences": [
    "\"Now what's going on in North Carolina is that the State Board of Election, a panel of five people, is asserting that they have the ability to bar 740,000-plus Americans in my district from being able to elect me, to send me to Washington to be their weapon to fight against the deep state,\" Cawthorn said.",
    "Madison Cawthorn (@CawthornforNC) February 22, 2022\nIn January, a group of North Carolina voters filed a complaint with their state's Board of Election, asking that it disqualify Cawthorn from running for Congress under Section 3 of the 14th Amendment.",
    "Their case largely hinges on whether Cawthorn directly promoted the riot by telling supporters of former President Donald Trump that \"It's time to fight\" during a \"Stop The Steal\" rally held just prior to the attack on the Capitol.",
    "A successful disqualification for Cawthorn \"might provide a model for banning Trump from holding office again,\" wrote Princeton politics professor Jan-Werner Mueller in an opinion piece published by The Guardian.",
    "Earlier this month, the North Carolina elections board ruled that it has the power to block Cawthorn from running for office, dismissing a lawsuit he filed to counter the petition, The Hill reported.",
    "Speaking to Carlson on Monday, Cawthorn accused his detractors of labeling the January 6 rioters \"insurrectionists\" so they could later set up petitions to block him from running for office.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "North Carolina congressman Madison Cawthorn said on Monday that a petition filed against him is close to successfully blocking him from running for office this year.",
    "Under the amendment, a person can be barred from holding office if they \"engaged in insurrection or rebellion\" after taking an oath to support the Constitution.",
    "\"They are actually very close,\" Cawthorn said when asked on \"Tucker Carlson Tonight\" about the possibility of his disqualification from the upcoming primary.",
    "Cawthorn further accused the petitioners of trying to set a precedent with his case so they can move on to other targets who share his political beliefs.",
    "The petitioners accused Cawthorn of breaching the amendment by inciting the January 6 Capitol riot, which has been widely described as an insurrection.",
    "North Carolina Rep. Madison Cawthorn on Monday said his detractors are \"actually very close\" to blocking him from running for office.",
    "Brandon Bell/Getty Images\nGOP Rep. Madison Cawthorn says a petition to stop him from running in 2022 is close to succeeding.",
    "\"Make no mistake, Tucker, this is not just about a 26-year-old from western North Carolina in a wheelchair.",
    "Cawthorn said his detractors are trying to use him as a precedent to block other politicians from office.",
    "The complaint filed against Cawthorn accuses him of engaging in an insurrection on January 6, 2021.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "Carlson described the petition as an effort towards \"ending democracy.\"",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "This is about the future of our very nation,\" he said.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}