{
  "id": 3040,
  "mediaId": 43,
  "date": "2/24/2022 12:00:00 AM",
  "headline": "Texas primary preview, with Jeff Singer (transcript)",
  "image": "https://images.dailykos.com/images/1040825/story_image/GettyImages-1235382339.jpg?1645553625",
  "link": "https://www.dailykos.com/story/2022/2/24/2082084/-Texas-primary-preview-with-Jeff-Singer-transcript",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1159,
    1480,
    1882,
    2277,
    2303,
    428,
    2553,
    2602,
    2834,
    2934
  ],
  "sentences": [
    "David Beard:\nSo one of the interesting things about how this race has played out is that there's these two different lanes where you can see a couple of the candidates are running off to the far right, to see as far right as they can possibly get and trying to really appeal to the Trumpist faction, while you see another lane that's trying to appeal more to establishment Republicans, but without doing anything to anger Trump or get on his radar in a negative way, sort of a wink and a nod, like how Glenn Youngkin helped win in Virginia by keeping Trump happy, keeping him off stage, letting everyone think he was a very establishment, normal Republican.",
    "David Beard:\nBut it was recently revealed that he sent a mass mailing to thousands, probably tens of thousands, or even hundreds of thousands of Republican voters in Texas, telling them that they're eligible for mail and ballots, which is true because it was sent to senior citizens, and telling them that all they to do was send their application in to the Secretary of State's office.",
    "David Nir:\nAnd in fact, we saw one of the most remarkable examples of a Republican desperately trying to keep Trump happy when George P. Bush, who, by the way, is the son of former Florida Governor, Jeb Bush, the brother of former President George W. Bush, when George P. Bush offered some beer koozies to supporters that had some remarkable clip art on them, Singer.",
    "David Beard:\nBut Madison Cawthorn, who is a relatively new representative from the far western part of North Carolina, representing Asheville and the mountain areas, he didn't like his new district because it was still pretty safely Republican, but slightly less so, where you could imagine in a really bad Republican year that he might be at some sort of risk.",
    "David Beard:\nAnd the lieutenant governor's campaign is going so far to say that they intended to do this, that they intentionally told people the wrong place to mail it because Republican voters trust the Secretary of State's office and they might not trust their county officials' office, which is clearly after the fact cover for just getting it wrong.",
    "It's still not quite final, so we'll wait to go into any more of a deeper dive into the map, but what I want to talk about is the story of one specific area and one specific Republican Congressman, and the Republican House Speaker who have decided to go back and forth over who's running where and become sort of enemies of themselves for who knows why.",
    "David Beard:\nSo for all the previous maps, there was only one Democratic district centered on Charlotte, and this new map has a Democratic district covering the northern half of the city, which is together with Mecklenburg County, into the county north of it, and then a second district covering the southern half of the city, going west into Gastonia.",
    "David Beard:\nNow, Lieutenant Governor Patrick has been one of the leaders in very aggressive voter suppression bills that have been passed into law in Texas, that have made it harder for people to vote by mail, that have made it a crime for county officials to send unsolicited mailings, letting people know that they're eligible to vote by mail.",
    "And for someone like Kristof, a long time, liberal columnist who's devoted his career to pointing out injustice, for him to baselessly attack selfless Oregon officials for keeping him off the ballot, just because he didn't like their decision, without any evidence whatsoever, that was really wrong.",
    "So the new map that the legislature drew, which had a number of competitive seats that were still somewhat Republican leaning, but was an attempt to meet the courts halfway, it had a district still in sort of west of Charlotte area, but it included some of Charlotte and was much more competitive.",
    "David Beard:\nAnd so he, of course, hates this map and he has made a big show that he's going to go appeal this to the North Carolina Supreme Court, by all means probably the federal courts, because he wants, by all accounts, his Congressional seat that he drew himself back.",
    "David Beard:\nAnd while this is still the early days of the podcast, we would love if you could subscribe to The Downballot, wherever you listen to podcast, tell your friends about us, who you think might like it, leave us a five-star rating and a review if you'd like.",
    "Co-host David Beard also recounts how North Carolina's powerful Republican House speaker got screwed by Madison Cawthorn, then tried to screw Cawthorn back, only for them to both get screwed when the courts rejected the GOP's congressional map a second time.",
    "David Nir:\nSo we should note that the heart of this district really is still in the Austin area, and Casar has been endorsed by the Democratic Socialists of America, which is one of the more notable groups that have been trying to push Democrats to the left.",
    "So we'll see if this is the kind of thing that winds up hampering her in November, or if the climate and the possible ongoing swing that Beard just mentioned is enough to insulate her from what had been some really ugly headlines and a really ugly story.",
    "We've seen a couple of candidates in other states come out of nowhere, seemingly self-funding based on crypto fortunes, mostly on the Democratic side, which is maybe a little bit surprising, but we're obviously going to keep a close eye on that though.",
    "Long time Democratic Rep, Lloyd Doggett, he represented the prior version of this seat, but Republicans decided to, again, as part of this defensive gerrymander, create another safely blue seat that's actually in the heart of Austin, the 37th district.",
    "Joining us for that part of the show will be Daily Kos Elections Editor, Jeff Singer, who has an encyclopedic knowledge of every down ballot race and will be running us through the most interesting contests on the statewide and congressional levels.",
    "David Beard:\nBut the original map that was passed by the North Carolina legislature included a new safe Republican district west of Charlotte, that everyone expected the House Speaker, Republican Tim Moore, to run in and become a new Congressman.",
    "And at the time in the Morning Digest, someone, I believe it was me who wrote that he's refusing to step down so far, but it's hard for a state's top law enforcement official to continue serving while he's accused of breaking his own state laws.",
    "The roster includes progressive Jessica Cisneros' second attempt at booting conservative Democratic Rep. Henry Cueller in the 28th District, plus the absolutely gonzo GOP primary targeting still-under-indictment Attorney General Ken Paxton.",
    "David Beard:\nAll because the lieutenant governor, who has so earnestly insisted about voter security and all of this fraud that can be done, can't even bother to let his own voters know where to send in their mail-in ballot applications.",
    "And we also shouldn't forget about the fact that there is still a pending challenge to Madison Cawthorn's eligibility to even appear on the ballot because of his involvement around the Jan 6th insurrection and invasion of the Capitol.",
    "Meaning that rather than try to draw lines to jeopardize Democratic control over Democratic seats, they took extreme steps to shore up vulnerable Republican seat eats, in many cases, moving them 10 to 20 or more points to the right.",
    "David Beard:\nBut just on Wednesday, the courts who were going to be reviewing these remedial maps, they decided that the Congressional map where they drew a number of competitive but Republican leaning seats, was not acceptable.",
    "Though, in many respects, while this primary does have some familiar ideological echoes, there are of course, the local concerns that Singer was just running down, in terms of the district split between Austin and San Antonio.",
    "Really, neither of them is going to vote differently, but it has become a very expensive proxy war between what passes for the GOP leadership in Luttrell's corner, and the more outside freedom caucus-like Ted Cruz's faction.",
    "If no one gets a majority on that day, and that's incredibly likely that no one will, then the top two vote-getters, regardless of party, will run on June 7th, which is also the day of California's normal statewide primary.",
    "He had Trump support because he's very close with Trump, and basically just kicked Moore out of any opportunity to run for Congress, because there was no real way, given where Moore is, that he could run for the west seat.",
    "And when he filed for the ballot, the Secretary of State Shemia Fagan, also a Democrat, said that he did not meet a requirement under Oregon law, that he be a \"resident of the state for three years prior to the election.\"",
    "Jeff Singer:\nIn November 2020, the Associated Press reported that the FBI was looking into him for allegedly doing favors for a wealthy ally of his, who also allegedly hired a woman Paxton was having an affair with.",
    "I think that Democrats simply cannot put forward candidates who are going to engage in the same kinds of attacks on election officials that we have seen Republicans at every level, from Trump on down, engage in.",
    "And so despite all of this, you'd think that then he would be at the utmost security and always getting all of his campaign materials to a T, because it's so important to him that all of this is done correctly.",
    "The 2022 election season officially gets underway on Tuesday with Texas' primaries, so we're previewing all of the key races with Daily Kos Elections editor Jeff Singer on this week's episode of The Downballot.",
    "Now, of course, the Republican Secretary of State, that's come down off the website now, and now they're saying they're happy to forward along any incorrectly mailed ballot requests to the appropriate county.",
    "There's a fourth Austin based candidate who hasn't raised much money or got any endorsements, so there's always a chance Viagran consolidates enough support in the San Antonio area to at least make a runoff.",
    "David Beard:\nAnd then his main two opponents are Texas Land Commissioner, George P. Bush, of the famous Bush family, of course, and Congressman Louie Gohmert, who's leaving his Congressional office to run.",
    "We have been talking about the Texas primaries with Daily Kos Elections Editor, Jeff Singer, who has run us through all of the major statewide and Congressional races that are on the ballot on Tuesday.",
    "David Nir:\nSo regardless of the results, it'll probably be tempting for a lot of pundits to try to read this as the latest fight between the Bernie and Hillary or Bernie and Biden wings of the party.",
    "For those of you just checking us out for the first time, The Downballot is a weekly podcast dedicated to the thousands of elections that take place below the presidency, from Senate to city council.",
    "David Beard:\nOne of the things that we have seen a time or two, is candidates who have run both to fill out a term and for the following term, when the term is relatively late in the two-year cycle.",
    "And that is the democratic primary between conservative blue dog, longtime incumbent, Henry Cuellar and human rights attorney, Jessica Cisneros, in Texas' 28th congressional district in South Texas.",
    "David Nir:\nSo as a result, most, though not all, but most of the races that we're going to be talking about, most of these primaries are for seats that are safely in one party's hands or the other.",
    "But then the North Carolina Supreme Court, as we know, struck down those gerrymandered maps, which gave this House Speaker a second chance, now knowing that Cawthorn was planning this little jump.",
    "If Cuellar wins and he's still in an ethical black cloud and that gives them an opening, and like Cuellar has been arguing, they're going to try to portray Cisneros as too liberal for this area.",
    "David Beard:\nAnd so we've had candidates who have won and only spent a few weeks in Congress because of the fact that they only won the special election for the last couple months of the term.",
    "But before that, it is time for our weekly hits, where we discuss a few of the bigger or more interesting or undercovered issues that have popped up in the land of elections in the last week.",
    "We'll see if his endorsement is enough to help Ramirez, but given that there are several people on the ballot, it's probably going to be hard for anyone to win a majority of the vote here.",
    "And certainly not a district that Madison Cawthorn would jump into, given that the furthest western district that covers the bounds of Asheville is more Republican than this new district.",
    "David Nir:\nOnce again, we are pleased to have back with us, Daily Kos Elections Editor, Jeff Singer, who's encyclopedic knowledge of elections up and down the ballot is simply unmatched.",
    "David Nir:\nWe are going to be taking a deep dive into Tuesday's primaries in Texas, which are the first of the year, and really can be considered the official start of the 2022 midterms.",
    "So now that we're done gawking at George P. Bush on the sad sack primary for Texas attorney general, we want to delve into the various house races that are on the schedule for Tuesday.",
    "It's very common for new districts to become safe seats designed for a powerful state house member or state Senator, so that was the expectation when the map was originally passed.",
    "David Beard:\nAnd one of the interesting questions will look long term for both Texas' 15th and Texas' 28th, like you mentioned, is how durable were those gains Trump made in 2020?",
    "Do Democrats really want to take a chance on going into the general election with a guy who's under investigation, when we still don't know what that investigation is even about?",
    "Texas primary preview, with Jeff Singer\nThe Downballot\nFollowShare\n0:0044:16\n15301xFeb 24, 2022\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nDavid Beard:\nHello and welcome.",
    "He's running for a different district that's become much bluer from redistricting, the 34th, which is open because a different Democratic Congressman, Filemon Vela, is retiring.",
    "Jeff Singer:\nBush seems to agree that Guzman is his biggest obstacle to making a runoff if there is one, and he's recently been attacking her as too weak on border security.",
    "David Nir:\nFormer New York Times columnist Nick Kristof quit his job not all that long ago and decided he would run for governor in his home state of Oregon, as a Democrat.",
    "Jeff Singer:\nThere was a poll taken recently by Casar's allies that showed about 42% of the vote, pretty close to majority, but not there yet, while Rodriguez was that 13%.",
    "It's always possible that if say, one candidate gets 49.9%, the trailing candidate will just say, \"I'm not going to win this,\" and they can specifically request no runoff.",
    "David Beard:\nAnd when I think of New York Times columnists, I always think of antiestablishment figures, so I'm not surprised at all that he said something like that.",
    "Ramsey is a former member of the state party leadership, but Hunt released a poll a few weeks ago that showed him taking 54% of the vote, above the majority he needs.",
    "David Beard:\nSo he decided that he would just jump on over to the new district, the 14th, where some of his current constituents were, but by no means the majority.",
    "So the special election is held at the same time as the general election, which often is the same districts, but in certain instances it's been different districts.",
    "And so I think that's something we're going to see play out, not only in this race, but in a lot of races throughout these Republican primaries throughout the year.",
    "Compared to some of those short timers, like the notorious Shelley Sekula-Gibbs, who long time election watchers may remember, she had about six weeks in office.",
    "David Beard:\nSo Moore, I think, could still expect to win the seat in 2022, assuming it's a Republican leaning year, but it's certainly a competitive district.",
    "Jeff Singer:\nOn the Democratic side, Beto O'Rourke, who was the 2018 nominee for Senate against Ted Cruz and then ran for president for a little while in 2020.",
    "Of course, if the value of Bitcoin continues to tumble, then who knows if these guys will keep on wanting to blow their own fortunes on Congressional races?",
    "Now, we're going to go all the way deep into Texas in our deep dive later on, but I want to talk about a mass mailing that the Lieutenant governor sent out.",
    "David Beard:\nAnd so the Secretary of State's office has been getting thousands of mail ballot requests from Republican voters that were sent incorrectly.",
    "And so anyone running in this special election, which is only for the final six months of Nunes' term, really doesn't have a district to run in November.",
    "Jeff Singer:\nSo he's been running ads, portraying Louie Gohmert, who has been an infinite source of right wing quotes for about a decade, as too liberal.",
    "David Beard:\nSo then a little further west, out in the excerpts of Dallas, we've got Texas 3rd congressional district, where Van Taylor is the incumbent.",
    "David Nir:\nOne thing we talked about last week was how Texas Republicans engaged in a widespread defensive gerrymander with their new congressional map.",
    "He does have two notable primary opponents, former State Party Chair, Allen West, who way back in 2010, he was elected in Florida on the Tea Party wave.",
    "Now, of course, the one problem is that under Texas law, you're not supposed to send your mail and ballot request to the Secretary of State's office.",
    "David Nir:\nThat would put it at November of 2019, given that the election for the seat is this fall, Kristof just lost a challenge to Fagan's ruling.",
    "David Beard:\nWe'll mark this down as part one of our multi-part series on explaining incredibly obscure and hard to understand local elected offices.",
    "They've all been saying we'll be a more ethical alternative to Paxton, but in the last few weeks though, they haven't entirely been focusing on him.",
    "There's a small part around El Paso in the Mountain Time Zone that closes an hour later, but the real action starts 8:00 PM Eastern, 7:00 Central.",
    "He's attacked him for voting to raise the debt ceiling, which most members of Congress have done at one point or another, and for missed votes.",
    "So the result of all this is thousands of voters, Republican voters, are going to get their ballots late or get their ballots too late to vote.",
    "David Nir:\nHe said that her move was representative of the \"failing political establishment in Oregon,\" which has, \"chosen to protect itself.\"",
    "Moore, who thought that he got his seat back, now doesn't have a seat again because it's way too Democratic for him to possibly win this seat.",
    "Jeff is going to walk us through all of the major races that are on tap in Texas primary that's coming up on March 1st, this coming Tuesday.",
    "And to probably his immortal regret, he accepted a $5,000 contribution from Illinois Congressman Adam Kinzinger, who voted to impeach Trump.",
    "There are four Democrats on the ballot, Austin City Councilman Greg Casar, he's attracted some endorsements from outside progressive groups.",
    "David Nir:\nThe reason is because the old 22nd District got chopped up between four other districts in the new map, really just eviscerated.",
    "The primary, as I just said, is on Tuesday, but it's exceedingly likely that we won't know the results of all of those races after Tuesday.",
    "And that brings me to another candidacy challenge and eligibility challenge on the other side of the country, that also did not go so well.",
    "But I'm going to take us now to a figure who is probably not going to get what he deserves the way that Kristof did, but it is what it is.",
    "So we'll find out Tuesday, if maybe they're seeing that Taylor, despite his huge money advantage, maybe isn't as popular as he used to be.",
    "David Nir:\nSo whoever wins is going to spend a very brief time in Congress, and perhaps they'll parlay that into something in the future.",
    "And when we come back, we will be talking with Daily Kos Elections Editor, Jeff Singer, about the Texas primaries coming up this Tuesday.",
    "There are several others, so this is another one where it might be just by numbers alone, tough for anyone to get a majority of the vote.",
    "David Nir:\nOne thing I should note here is that Daily Kos endorsed Cisneros, both in this election and in her first race against Cuellar.",
    "David Nir:\nOne thing we should add though, is that de la Cruz was accused by her ex-husband of having abused the ex-husband's daughter.",
    "David Nir:\nAnd so George P. Bush crapped on his own family in trying to please Donald Trump, and it got him exactly zero endorsements.",
    "He hasn't raised much money, but he's been attacking Taylor over his initial, at least initial support for the January 6th commission.",
    "Gonzalez, he's supporting army veteran Ruben Ramirez in a crowded race where no one has really raised much money or really stood out.",
    "David Nir, meanwhile, says good riddance to Nick Kristof and wonders, \"What happens if you held a special election and nobody came?\"",
    "The Republican primary has attracted far less attention than the Democratic one, but Republicans are going to want to make a play.",
    "We really don't know, so that's really something to watch, both in terms of turnout for the primary and going forward to November.",
    "This is the seat held by the notorious Devin Nunes, who resigned a few months ago to run Donald Trump's new social media company.",
    "Hasn't attracted much money or attention, but she could be enough to keep either candidate from winning a majority of the votes.",
    "Jeff Singer:\nHe, in 2020, spearheaded the thankfully unsuccessful group of attorneys general who tried to overturn the election.",
    "And it's got a pretty favored candidate, somebody who ran last cycle in a different seat, but who is facing a challenge as well.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "He has some opponents, none who hold elected office, but there's been no polling, really no indication of what's going on here.",
    "David Beard:\nSo while we're still stuck with them, I like to think that they both lost in this situation, which makes me happy.",
    "But the thing that I want to folk on is how he actually responded when Fagan initially said that he couldn't be on the ballot.",
    "Probably the most important thing is about a month ago, there was an FBI raid on Cuellar's home and his campaign headquarters.",
    "David Beard:\nAnd let's look further down into some of the other are statewide races that are going to be happening on Tuesday.",
    "She has a few opponents, but this is another one where this one, it would be surprising if she didn't win outright on Tuesday.",
    "The Congressional Leadership Fund, which is the main super PAC run by the house leadership, they've spent about $150,000 here.",
    "They still haven't announced what's up, but it believes to have something to do with the congressman's ties to as Azerbaijan.",
    "So it seemed like Moore had gotten his seat back that he was going to run for and he was going to become a Congressman again.",
    "But Crockett has just so much support in and out of the district that it's hard not to see her at least getting to a runoff.",
    "And this new map is really a very fair map for North Carolina's overall partisan boundaries, where it's a very close state.",
    "And I want to call it an Austin seat, but it is one of the most egregiously gerrymandered districts you will find anywhere.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "David Beard:\nAnd obviously, one flaw of accepting some money from somebody Trump doesn't like is enough often to doom you.",
    "David Nir:\nAnd amazingly, Henry Cuellar is not the only candidate under an investigation we're going to talk about today.",
    "Redistricting didn't really change the picture very much, but it's not the same safe district everyone expects it to be.",
    "It extends a thin tendril down an interstate to gather up more Democratic voters in the San Antonio region, a ways away.",
    "Cisneros ran against him on the left, actually said, \"We should have a Democrat who believes in Democratic principles.\"",
    "That's going really, really poorly, unsurprisingly, but the special election to succeed him has been extremely strange.",
    "Several of Paxton's now former top aides say that they spoke to the FBI and that he retaliated against them afterwards.",
    "David Beard:\nAnd so it's entirely possible that sticks and that's really bad news for Democrats in those two districts.",
    "Whichever way that this race for Oregon's governorship goes, it's going to be a competitive, open seat race this fall.",
    "Biden won it by about seven points, so still Democratic leaning, but Republicans in a good year, they could take this.",
    "This is another one where the Republican nominee, whoever they are, they're going to easily win the general election.",
    "They're both people who love Trump, but Luttrell is closer to the DC leadership, as evidenced by the CLF endorsement.",
    "There's never a simple answer when it comes to questions like this, but join us for our live blog at 8:00 PM Eastern.",
    "Jeff Singer:\nThere's also another candidate worth mentioning, former San Antonio City Councilwoman, Rebecca Viagran.",
    "David Nir:\nAnd when the state Supreme Court ruling came down, Kristof, as I said, was very demure, very deferential.",
    "It's maybe slightly Republican leaning, but that included a second Charlotte district that is as Democratic leaning.",
    "Johnson, she made history as the first Black woman to represent the Dallas area in the legislature, and in Congress.",
    "Jeff Singer:\nTrump won it by a few points, potentially competitive, especially if Trump's 2020 gains were temporary.",
    "The Republicans drew up Fletcher's district to be safely Democratic, so they can make more areas safely Republican.",
    "Jeff Singer:\nHis opponent is a former campaign manager for the retiring Congressman Kevin Brady, Christian Collins.",
    "Collins has the backing of Ted Cruz and probably more importantly, a really wealthy Ted Cruz friend, Robert Marley.",
    "So unlike some of the primaries we're talking about, this one really has not seen much action from outside groups.",
    "In Texas, a county judge is the equivalent of what other states might call their county executive or county mayor.",
    "Democrats also lost the governorship that year when incumbent Ann Richards lost to none other than George W. Bush.",
    "And if 2022 shapes up to be a tough year for Democrats nationally, it's going to be very hard to break that trend.",
    "And interestingly, two groups that are aligned with the crypto industry, they've spent a massive amount of money.",
    "And according to what the Secretary of State used to have on their website, those ballots would've been rejected.",
    "So the winner of this race they'll have months to make their name in Congress before the district gets broken up.",
    "And in fact, the front runner for this seat, which leans Republican, is a former state assembly minority leader.",
    "The 15th has been represented by Democratic Congressman Vicente Gonzlez since 2017, but he's not running there.",
    "Paxton might think that Gohmert's people are more likely to go to him if they don't vote for their Congressman.",
    "But first, why don't we stretch out a little bit and look at the statewide races that we have on tap on Monday?",
    "So there are 11 candidates on the Republican primary ballot, but there are only two who've generated attention.",
    "If you haven't already, please like and subscribe to The Downballot and leave us a five-star rating and review.",
    "But I wouldn't be surprised if turnout is extremely low as folks focus on the actual elections for full terms.",
    "It doesn't look like Madison Cawthorn is going to get some sort of uber red Charlotte area district to run in.",
    "A unanimous decision by the Oregon Supreme Court upheld Fagan's decision, and Kristof has kind of slunk off.",
    "David Nir:\nNow, is this fellow a judge, like a guy in a robe who sits on a bench and issues legal decisions?",
    "But one real exception to that rule is the first one on our list, which is the 15th congressional district.",
    "So in Texas primaries, the rule is you need to get a majority of the vote to win the nomination outright.",
    "Of course, Texas just went up two districts, from 36 to 38, so that increases the odds for more runoffs.",
    "Her name is Connie Conway, and she actually says, she's not going to run for any other office this fall.",
    "North Carolina law forbids insurrectionists from running for office, so this challenge remains pending.",
    "So disagreement on how close he is to winning majority on Tuesday and avoiding a runoff, but we'll see.",
    "Lieutenant Governor Dan Patrick, who we mentioned earlier, unfortunately will probably win comfortably.",
    "That'll be one where the expectation, I think, is that he'll make the win without the need of a runoff.",
    "Another important open seat on the Republican leaning side is Texas 8th, where Kevin Brady is retiring.",
    "He also has support from several colleagues on the Austin City council, as well as the mayor of Austin.",
    "She's attracted very little outside attention, but she's the only candidate from the San Antonio area.",
    "There have been several polls that show O'Rourke well ahead, should be an easy win for him on Tuesday.",
    "So the few polls we've seen have shown that Bush is in second place, but not too far behind is Guzman.",
    "You can listen to The Downballot on all major podcast platforms, and you can find a transcript below.",
    "Jeff Singer:\nThat's given Collins a really easy way to just portray Luttrell as some crypto Democrat.",
    "We can start where Louie Gohmert has vacated his seat, as we mentioned, to run for attorney general.",
    "He represented a Dallas district that used to be really conservative, but flipped in the Trump era.",
    "So Paxton is involved in two very serious, completely unrelated scandals, but he's far from doomed.",
    "David Nir:\nMaybe an easy win for O'Rourke on Tuesday, but the general election looks a lot harder.",
    "Really rare for them to back candidates in Republican primaries, but they're doing it this cycle.",
    "Two years ago, he was a top tier Republican recruit against Lizzie Fletcher in the 7th district.",
    "David Beard:\nLet's look now at some GOP leaning seats that also have some competitive primaries.",
    "Gohmert responded by trying to go after Paxton's ethics also, but interesting race we're having.",
    "Whoever will have this post will have six months to make a huge splash and then they'll go away.",
    "His main opponent looks like State Representative Eddie Rodriguez, who also hails from Austin.",
    "But if he does need a runoff, that'll certainly be news and something to watch going forwards.",
    "Because the Texas Rio Grande Valley area was one of Trump's strongest areas compared to 2016.",
    "This is another seat in the Rio Grande Valley, an area that swung hard to the right in 2020.",
    "Several strong Democratic candidates have run since then, but they've all fallen well short.",
    "And this one has a primary that's sort of falling along some now familiar ideological lines.",
    "If you like following these races as closely as we do, come join us at Daily Kos Elections.",
    "This time, Republicans are taking much more of an interest in her than they were last time.",
    "Jeff Singer:\nJohnson has endorsed State Representative Jasmine Crockett, who is a freshman.",
    "And who do you think is more likely to make a runoff, if he does get forced into a runoff?",
    "Jeff Singer:\nThis area has for a long time, been safely Democratic turf, but it's changed.",
    "He's endorsed by former Governor Rick Perry, as well as the Congressional Leadership Fund.",
    "David Nir:\nSo Doggett's running there, leaving the 35th district again, safely blue open.",
    "David Nir:\nAnd of course, runoffs can happen at every level, not just at the house level.",
    "David Nir:\nWe're going to wrap up with an election that may have very few voters at all.",
    "Paxton, meanwhile, he's been running ads in Gohmert's East Texas congressional district.",
    "It's gone into two different directions, Bush versus Guzman, and Gohmert versus Paxton.",
    "The first one at Texas 30 in the Dallas area, where Eddie Bernice Johnson is retiring.",
    "No other outside groups for anyone has spent anywhere near this much in this district.",
    "And they substituted a map drawn by some special masters that the court had appointed.",
    "And this isn't one where the divisions between the two candidates are really that big.",
    "Collin County, which includes Plano, it makes up the vast majority of this district.",
    "It was in the Charlotte media market, which is a lot bigger than the Asheville area.",
    "That's more or less what's going on in California's old 22nd congressional district.",
    "So Singer, why don't you talk about that race and tell us what the stakes are there?",
    "David Nir:\nThe crypto factor is also something to keep an eye on in general in 2022.",
    "So I know last week, we talked about the state of redistricting there a little bit.",
    "Back in Texas, there is one other safely blue open seat that we want to talk about.",
    "Jeff Singer:\nHunt's the favorite to win the nomination, but he has a few opponents.",
    "He came unexpectedly close to winning, even as Trump was dragging down the ticket.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "But as always, the story is probably going to be a lot more complicated than that.",
    "If you don't, then the two candidates with the most votes proceed to a May runoff.",
    "David Nir:\nAnd what would this district look like in a possible general election?",
    "The one who has the endorsement of Ted Cruz is his former staffer, Cassy Garcia.",
    "David Nir:\nAnd do Republicans have any notable candidates running in their side?",
    "He's allied with Republicans on you name it, but until 2020, he was very secure.",
    "Because it's maybe not exactly how you'd expect, particularly on Gohmert's side.",
    "Haven't seen any numbers from Rodriguez's side, so don't know what he's seeing.",
    "But that would indicate Casar could win out right, but it's going to be tough.",
    "He got reelected in 2018 in a pretty close race against a Democratic opponent.",
    "That special election, by the way, there is an all party primary on April 5th.",
    "Jeff Singer:\nConservative groups, they funded outside groups to help Cuellar.",
    "Some races though, the field is just too large for that to reasonably happen.",
    "Jeff Singer:\nPolls close in most of Texas at 7:00 Central Time, 8:00 Eastern.",
    "Or is this one of those Texas judges that means something totally different?",
    "There's a few other candidates, but none of them have much name recognition.",
    "But it's also possible that it recedes a little or a lot, given its history.",
    "Jeff Singer:\nYeah, it showed outlines of Trump and George P. Bush together.",
    "But the attorney general's race on the Republican side is very interesting.",
    "Jeff Singer:\nThere's a long time Democratic operative, Jane Hope Hamilton.",
    "Cuellar has long been one of the most conservative Democrats in the house.",
    "And of course, it's been a week, so a bunch of things have happened there.",
    "Jeff Singer:\nThis is a Texas judge that means something totally different.",
    "There's a fourth Austin based candidate who just hasn't raised much money.",
    "Jeff Singer:\nSo this is another one that's gotten some national attention.",
    "Whether it works or not, we'll see, but that's what they're going to try.",
    "David Beard:\nLet's look now at a couple of Democratic leaning open seats.",
    "Jeff Singer:\nThis is my personal favorite race on the ballot on Tuesday.",
    "The only problem is he hadn't lived in Oregon in an extremely long time.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's a pretty safe Republican seat, in and around the Houston suburbs.",
    "Jeff Singer:\nThis one, national Republicans, they've come in recently.",
    "So there's actually a third candidate or third challenger, Eva Guzman.",
    "Jeff Singer:\nThe Governor, Greg Abbott, he's running for a third term.",
    "For two years, he was one of the biggest Tea Party names in Congress.",
    "That was straight up Trumpist language and that really pissed me off.",
    "But it is a house race that is really the marquee contest on Tuesday.",
    "This, of course, did not stop Trump at all from rallying around her.",
    "He's since moved to Texas, became chair of the state party briefly.",
    "So Texas has not elected a Democrat to statewide office since 1994.",
    "We'll be covering all of these races and any surprises that pop up.",
    "Thanks also to our producer, Cara Zelaya and editor, Tim Einenkel.",
    "This time, neither Hunt or Fletcher is in a competitive district.",
    "They're both interesting names, but we've seen quite a few polls.",
    "One news report even suggested he appeared stunned by the ruling.",
    "This is a situation without much in the way of recent precedent.",
    "Cisneros is back and this time there are a few things different.",
    "Far more time than some of these candidates who only have weeks.",
    "The Democratic primary winner should have absolutely no problem.",
    "And a Trump quote reading, \"This is the only Bush that likes me.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "But if Moran doesn't at least make a runoff, we'd be surprised.",
    "The front runner looks like Smith County judge Nathaniel Moran.",
    "Jeff Singer:\nThere's also a former State Senator, Don Huffines.",
    "That's a pretty good chunk of all of the house races out there.",
    "David Nir:\nYou are, and it will certainly not be the last time.",
    "David Nir:\nAnd runoffs are something we can definitely expect.",
    "And of course, the biggest of them all is the governor's race.",
    "The Republican Monica de la Cruz, she was the nominee in 2020.",
    "David Nir:\nAnd I'm David Nir, Political Director of Daily Kos.",
    "Jeff Singer:\nBut there's quite a lot of outside spending here.",
    "I'm David Beard, Contributing Editor for Daily Kos Elections.",
    "So Ken Paxton, he's the Republican Attorney General of Texas.",
    "So if this is at all close, we're in for a massive surprise.",
    "In 2020, there were 15 house primaries that went to runoffs.",
    "One of the Republicans is retired Navy SEAL Morgan Luttrell.",
    "This super PAC has boatloads of money, but it's not nothing.",
    "The most prominent is former Collin County judge Keith Self.",
    "Self left office in 2018, so he's probably still well known.",
    "So, who are the two main candidates fighting it out there?",
    "It's a deep red seat in East Texas, and it's an open seat.",
    "This district in the Northern Houston area, it's very red.",
    "That's elections.dailykos.com on Tuesday when polls close.",
    "There's far less outside spending on his behalf this time.",
    "You're supposed to send it to your local county officials.",
    "Ken Paxton is still under indictment for securities fraud.",
    "He's almost certainly going to be the Democratic nominee.",
    "Jeff Singer:\nThis district around Laredo, Texas, is 28th.",
    "It's been held by Democrat Henry Cuellar for a long time.",
    "I'm looking forward to Tuesday, which is also Mardi Gras.",
    "Oil and gas engineer Mark Ramsey looks like his main foe.",
    "In 2020, Trump did unexpectedly well with Latino voters.",
    "So, what if you held a special election and no one came?",
    "David Beard:\nThat seemed to stop Moore in his ambitions.",
    "It's a very red area, full of Republican primary voters.",
    "David Beard:\nI'm taking us right back to North Carolina.",
    "And so both of these districts are Democratic leaning.",
    "He won in 2004 by beating an incumbent in the primary.",
    "Jeff Singer:\nSo the favorite candidate is Wesley Hunt.",
    "But he does have a bit of a primary challenge, right?",
    "Tell us what the race to replace her is looking like.",
    "Jeff Singer:\nSo this is a very safely blue district.",
    "Jeff Singer:\nRepublicans do have several candidates.",
    "A similar number, 17, the cycle before that in 2018.",
    "It's the official start of the 2022 election season.",
    "David Nir:\nBeard, what are you starting us off with?",
    "The Downballot comes out every Thursday, everywhere.",
    "I'd love to know where that terminology comes from.",
    "David Nir:\nThat is the 35th congressional district.",
    "And on Tuesday, he's almost certainly going to win.",
    "There's a former legislative aide, Abel Mulugheta.",
    "Jeff Singer:\nThere's also one other notable thing.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "No one has released any numbers contradicting him.",
    "So we'll see if he's able to overcome that or not.",
    "He's a bit of a celebrity in conservative circles.",
    "But let's go ahead and dive into today's episode.",
    "David Nir:\nBut we are not going away, not at all.",
    "This is a district with a large Black population.",
    "Neither of his opponents is getting any traction.",
    "David Nir:\nAnd what about on the Democratic side?",
    "Paxton, in every poll we've seen, has been ahead.",
    "One recent poll showed him with 39% of the vote.",
    "They each announced they're spending $1 million.",
    "But like I said, just something to take note of.",
    "Trump and Kevin McCarthy are both in her corner.",
    "But it doesn't look like he's going to get that.",
    "So he decided that he would just jump in there.",
    "Lieutenant Governor Dan Patrick, down in Texas.",
    "And she really lit into him, and deservedly so.",
    "Jeff, thank you so much for being back with us.",
    "It's got pretty much everything you could want.",
    "And that's not the only scandal involving him.",
    "Jeff Singer:\nThe GOP side is a lot more clear.",
    "That means we have an open race for the 15th.",
    "Still, under indictment for securities fraud.",
    "He was indicted in 2015 for securities fraud.",
    "In 2020, it was just Cisneros versus Cuellar.",
    "She came unexpectedly close to winning here.",
    "Last seat we want to talk about, Texas 38th.",
    "And it's open for sort of an unusual reason.",
    "So, who's going to be succeeding him there?",
    "We'll be back next week with a new episode.",
    "So candidates, they want to win a majority.",
    "So we'll see some action in May, no doubt.",
    "They've disagreed on how close Gohmert is.",
    "David Beard:\nThat's all from us this week.",
    "David Nir:\nWell, you heard it right there.",
    "Jeff Singer:\nYes, he has a few opponents.",
    "He had little, if any primary opposition.",
    "That one was settled in the first round.",
    "We are just going to take a short break.",
    "So I say to Nick Kristof, good riddance.",
    "Jeff Singer:\nThis is an interesting one.",
    "Jeff Singer:\nOh, you sweet summer child.",
    "Some very talented candidates have lost.",
    "I think you raised a good point, Singer.",
    "Republicans just seem to be ignoring it.",
    "Haven't seen any big endorsements here.",
    "Jeff, thank you so much for joining us.",
    "So tell us about what's going on there.",
    "Now, they've all been stressing ethics.",
    "David Nir:\nThat makes me happy as well.",
    "I believe I'm the first two-time guest.",
    "This time, there is a third candidate.",
    "You've got a scandal tarred incumbent.",
    "He could be around a while if he wins.",
    "This is a short blurb about Daily Kos.",
    "Thanks to Jeff Singer for joining us.",
    "They filed a whistleblower's lawsuit.",
    "Both parties have large fields there.",
    "So, how are they going after Paxton?",
    "Jeff Singer:\nHe's raised more money.",
    "He has a geographic base of support.",
    "David Nir:\nSign me up for that one.",
    "You've got a far-right Congressman.",
    "They all show Abbott well over 50%.",
    "This is the Bush that got it right.",
    "Gonzalez is running there instead.",
    "This is a heavily Latino district.",
    "So we could see this going to May.",
    "And Fagan held a press conference.",
    "This is the seat north of Houston.",
    "So they're both very conservative.",
    "And that's really changed things.",
    "Didn't work, but Trump loves him.",
    "We haven't seen too much lately.",
    "There are some other candidates.",
    "What are we covering today, Nir?",
    "He's the top guy in his county.",
    "Singer, what's going on there?",
    "Jeff Singer:\nGreat to be back.",
    "She hasn't raised much money.",
    "So, happy Mardi Gras primary.",
    "Click here to donate $3 now.",
    "Not confusing at all, right?",
    "But they've generated a lot.",
    "Can you tell us why that is?",
    "He lost narrowly in Florida.",
    "Donate $3\nDonate $5 monthly",
    "David Nir:\nIndeed, we will.",
    "So tell us about that seat.",
    "It's one of the new seats.",
    "Has not gone to trial yet.",
    "Texas has no term limits.",
    "There's other candidates.",
    "No one else coming close.",
    "Want to keep it that way?",
    "He has than anyone else.",
    "One showed him with 47%.",
    "He was elected in 2014.",
    "So let's dive right in.",
    "But that's pretty rare.",
    "This seat was more red.",
    "Daily Kos is different.",
    "We'll see what happens.",
    "It's been seven years.",
    "What's going on there?",
    "That changed, though.",
    "He's an army veteran.",
    "When is that, Singer?",
    "She's running again.",
    "No third candidate.",
    "David Beard:\nGreat.",
    "Jeff Singer:\nGreat.",
    "Jeff Singer:\nYeah.",
    "Jeff Singer:\nYeah.",
    "David Beard:\nYeah.",
    "Jeff Singer:\nYeah.",
    "Jeff Singer:\nYeah.",
    "It's a hard state.",
    "Jeff Singer:\nYeah.",
    "You've got a Bush.",
    "Jeff Singer:\nYeah.",
    "Let's jump to it.",
    "He endorsed him.",
    "David Nir:\nYeah.",
    "He won 52 to 48.",
    "David Nir:\nYeah.",
    "Please read it.",
    "He's an author.",
    "He's a banker.",
    "Not that much.",
    "He's running.",
    "I like him.\"",
    "He runs it.",
    "I'm done."
  ]
}