{
  "id": 3042,
  "mediaId": 238,
  "date": "2/23/2022 12:00:00 AM",
  "headline": "Is North Carolina congressman and Trump acolyte Madison Cawthorn exposing the limits of the new celebrity politics?",
  "image": "https://www.washingtonpost.com/pb/resources/img/washingtonpost_black_32.png",
  "link": "https://www.washingtonpost.com/magazine/2022/02/23/his-attempt-switch-districts-north-carolinas-madison-cawthorn-may-be-exposing-limits-new-celebrity-politics/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lisa Rab",
  "authorUrl": "",
  "termIds": [
    2303,
    1147,
    1147,
    1039,
    1039,
    2303,
    2176,
    2176,
    2080,
    2080,
    617,
    617,
    2697,
    2697,
    2553,
    2553,
    2834,
    2834
  ],
  "sentences": [
    "He's an embarrassment that we need to defeat.?\nJohn Hood, the chairman of the conservative John Locke Foundation, wrote an editorial calling Cawthorn a callow and appallingly ignorant young man who regularly embarrasses conservatives and Republicans.? In early January, a group of 11 voters in the 13th District filed a challenge with the state board of elections, arguing he should be disqualified as a candidate because of his role in the Jan. 6 insurrection.",
    "Cawthorn spoke at Trump's Save America rally in front of the White House, telling the assembled crowd, The Democrats, with all the fraud they have done in this election, the Republicans hiding and not fighting, they are trying to silence your voice.? Hours later, a violent mob stormed the Capitol, forcing lawmakers to postpone their vote to certify Joe Biden's election and injuring about 140 police officers.",
    "In her view, the mask requirement was tied to larger problems, such as an indoctrinating? school curriculum that had kids covering their faces and complying.? She also thought White children were being told that the color of your skin is a problem and [you should] apologize for who you are.?\nUnlike Greathead and Erwin, Campbell admires Cawthorn's national profile.",
    "Greathead first met Cawthorn in 2020 at Cherokee Guns, a shop decorated with signs such as Come & Take it Joe? and Warning: Does Not Play Well With Liberals.? Like many Republicans in the area, Greathead is a strong Second Amendment supporter and was impressed by Cawthorn's antiabortion, pro-veteran constitutional conservative? ideas.",
    "More than 150 former students there signed a letter accusing him of being a sexual predator, saying his time at the school was marked by gross misconduct towards our female peers? and public misrepresentation of his past.?\nNevertheless, any Republican would have been favored to win the general election.",
    "On the phone from her home at the far western edge of the North Carolina mountains, the former head of the Cherokee County GOP is seething because Rep. Madison Cawthorn  the youngest member of the headline-grabbing Trump acolytes on Capitol Hill  has disappointed her once again.",
    "They're supposed to be representing us.?\nAs for Cawthorn, Wiggins thinks he won because he got on the Trump train.? Given the congressman's track record, Wiggins doesn't know if his affiliation with the former president will be enough to elect him a second time.",
    "Their immaturity for what really matters, it showed.?\nGreathead and her husband live on a fixed income because of her disabilities  she has had a heart attack in addition to five major spinal surgeries  and she feels every cent of a recent local tax increase.",
    "We don't have a congressman.?\nIt's mid-November, and Cawthorn, 26, has just announced a highly unusual decision: After less than a year in office, he's leaving Greathead's congressional district to run in a newly redrawn, more conservative district next door.",
    "He's flown to Mar-a-Lago to plot endorsements with former president Donald Trump and keeps up a steady stream of commentary on Twitter and Facebook, admitting in an email obtained by Time magazine that his staff focuses more on communication than legislation.",
    "If our election systems continue to be rigged and continue to be stolen,? he said, it's going to lead to one place  and it's bloodshed.?\nErwin worries about rising grocery and gas prices, and the local businesses that are facing staffing shortages.",
    "I hope the people in the 13th District will be smarter than the people in the 11th District were,? Wiggins says, and see him for what he is.?\nLisa Rab is a freelance journalist whose work has appeared in Harper's Magazine and Politico Magazine.",
    "He stoked fears about election fraud in a speech in front of the White House before the Capitol insurrection and showed up at a school board meeting with a knife tucked beneath his wheelchair, railing against mask mandates for students.",
    "His failure to come through and failure to come back and be that servant is what's broken the trust of the people here in Cherokee County.? (Cawthorn's spokesman did not respond to repeated requests for an interview.)",
    "Cooper disagrees with this assessment, arguing that if Cawthorn, who's already spent more than $2.6 million on his campaign, was endangered in the 11th he would have attracted more high-profile primary challengers.",
    "That focus has left some constituents feeling abandoned, says Chris Cooper, a political science professor at Western Carolina University who's writing a book about North Carolina's 11th Congressional District.",
    " In my heart, I represent North Carolina as a whole, not some arbitrary line that some politician drew this cycle.? (The majority of registered voters in North Carolina are Democrats and Independents.)",
    "You have to sacrifice to live here.?\nSeventy percent of the county's land belongs to the federal government, Wiggins says, leaving a small tax base to cover resources like ambulances, parks and police.",
    "Today there's a casino run by the Eastern Band of Cherokee Indians 10 minutes from downtown Murphy and a giant depiction of the Ten Commandments on a mountainside near the county's western border.",
    "People like Madison, it's the pretty face, the comments that enrage and infuriate.?\nCherokee supported Cawthorn by a high margin  he won 76 percent of the vote in a county of nearly 29,000 people.",
    "At a time when defund the police? became a rallying cry for some on the left, Cawthorn presented himself as pro-environment and talked about the need for Republicans to appeal to younger voters.",
    "There's been a lot of kids getting sick from wearing masks,? she contended, adding that kids were being threatened? by teachers and administrators if they didn't wear their masks appropriately.",
    "A week before the event, Cawthorn was in New Hampshire fundraising for a congressional candidate, and also in Asheville speaking at a GOP fundraiser with Sen. Marsha Blackburn of Tennessee.",
    "Coronavirus infection rates spiked, nurses at the largest hospital in Asheville protested their working conditions, and many families struggled through the long months without child care.",
    "Cherokee County was once the Wild West of North Carolina, a place where European settlers crossed onto Cherokee land and built a fort to hold Native Americans during the Trail of Tears.",
    "In his complaint, he denies that he engaged in insurrection or rebellion? against the United States and argues the state statute used to challenge his candidacy is unconstitutional.",
    "Then there's the drug trafficking and the cryto-currency mine, which nearby residents say keeps them up at night with the noise of roaring fans needed to cool the computer servers.",
    "Bennett won the Republican primary that March with the endorsement of both Trump and Meadows, but she didn't win more than 30 percent of the vote, and Cawthorn called for a runoff.",
    "In his 13 years as a Graham County commissioner, he has advocated for Medicaid expansion, supported the federal infrastructure bill and maintained a belief in unions and vaccines.",
    "It's a difficult pill to swallow.?\nOn a bright, windy morning in late October, roughly a hundred people gathered in front of the historic courthouse in downtown Hendersonville.",
    "Many of them still have moderate to conservative views.?\nHe's seen derisive comments on Twitter from people who live out of state that conflate Cawthorn with his constituents.",
    "Our country is an embarrassment on the world stage.?\nLess than eight months later, Cawthorn made another reference to violence in a speech to Republicans in Franklin, N.C.",
    "As the midterm elections approach, Cawthorn will join other high-profile freshman lawmakers  including Lauren Boebert and Marjorie Taylor Greene  in a bid for reelection.",
    "He was not a fan of Trump's bombastic style?  he preferred Carly Fiorina  but voted for him because they shared the same views on the border, taxes and law enforcement.",
    "There's a gun shop next door to the courthouse, and the local news frequently reports on heroin and meth trafficking in this county that borders Georgia and Tennessee.",
    "In December 2019, Meadows waited until the day before the filing deadline to announce he would not seek reelection  he was preparing to become Trump's chief of staff.",
    "Four of the rural hospitals have closed their maternity wards since 2015, and 40 percent of people in the district rely on some form of public health-care coverage.",
    "In Transylvania County, next door to Hendersonville, three county commissioners resigned from the Republican Party in December 2019, the month Trump was impeached.",
    "That's a reference to state Rep. Tim Moore, the speaker of the North Carolina House of Representatives, who's generally viewed as a staunch pro-Trump conservative.",
    "In early February, the North Carolina Supreme Court struck down the district map that heavily favored Republicans and created the district Cawthorn is running in.",
    "The March for Freedom rally took aim at three issues the congressman often rails against: mask mandates in schools, vaccine mandates and critical race theory.",
    "We don't give them away to just anybody.?\nGriggs was elected to the county commission, while Cawthorn was appointed to the House Veterans' Affairs Committee.",
    "Former Henderson County sheriff George Erwin Jr., an early Cawthorn supporter, came to see Cawthorn as caring more about himself than about his constituents.",
    "They haven't had a member of Congress who held town halls in every part of the district since Republican Charles Taylor left office in 2007, Wiggins says.",
    "In 2011, the Republican-dominated state legislature redrew the district lines to remove most of Asheville and leave its more conservative suburbs intact.",
    "[The making of Madison Cawthorn: How falsehoods helped propel the career of a new pro-Trump star of the far right]\nHer interest was more than political.",
    "After recovering from his injuries, he briefly attended the evangelical Patrick Henry College in Virginia, dropping out after a semester of low grades.",
    "If you commit yourself to something, you should stand by it.?\nFor Shannon Greathead, it wasn't just the missed event; it was the misplaced priorities.",
    "Cawthorn hasn't met with the county commissioners since he took office, Wiggins says, but if he had, he might have heard about some of these issues.",
    "Cawthorn was a political novice  he'd never run for office  and his most relevant job experience was a part-time stint in Meadows's district office.",
    "Cawthorn is set to leave the congressional district that encompasses Hendersonville to run in a newly redrawn, more conservative district next door.",
    "Meanwhile, many of the surrounding rural areas have lost manufacturing jobs, causing an exodus of young people and a strain on dwindling tax bases.",
    "The new territory, the 13th Congressional District, does not include his hometown or the counties where Campbell, Greathead, Griggs and Erwin live.",
    "One man's T-shirt said, We the People Know Trump Won.?\nThis is Cawthorn's home turf, where 59 percent of voters elected both him and Trump in 2020.",
    "Timber sales used to fund the schools, but as logging has declined there's now a fight in Congress every year to secure funding for rural schools.",
    "Cawthorn surrounded himself with bros? who had no legislative experience, Erwin says, and seemed to care more about himself than his constituents.",
    "In the center is liberal, tourist-friendly Asheville, which has boomed in recent years, earning the city the highest cost of living in the state.",
    "Charles Jeter, a Republican former state representative who lives in the 13th, tweeted that Cawthorn's move was ambitious cowardice at its worst.",
    "Meanwhile, the political divide between urban and rural areas widened, and Cooper watched the areas outside of Asheville grow more conservative.",
    "If he wins, it could be seen as a victory for a new kind of politics, one that values celebrity over governance and self-promotion over service.",
    "One afternoon in early December, the temperature dropped nearly 20 degrees as I drove into the misty cliffs of the Nantahala National Forest.",
    "Erwin was known as a kingmaker in local Republican circles; his county just south of Asheville is considered the GOP heart of the district.",
    "Cawthorn's campaign signs sprouted on lawns during the first summer of the pandemic, just as tourists descended on western North Carolina.",
    "Yet when their local American Legion lost its building, Greathead couldn't get him to raise money to keep that space for veterans open.",
    "It makes no difference if the person is a Democrat or a Republican; Graham County generates too few votes to warrant their attention.",
    "Cawthorn added that he feared another establishment, go along to get along Republican? would win in the 13th if he didn't run there.",
    "Cawthorn sees himself as part of a new right-wing wave, but many conservatives in his district don't recognize the party he joined.",
    "She wore a black-and-white T-shirt that read We the People of WNC? and silver cross earrings that highlighted her long brown hair.",
    "In August, board members voted to start the school year without the requirements but quickly changed course when covid cases rose.",
    "It's highly unusual for an incumbent congressman to abandon his district unless a redrawn map threatens his chances of reelection.",
    "There's no logical explanation for this move other than trying to give the finger to the Republican establishment,? Cooper says.",
    "Until more incumbent Republicans speak out against them, Cooper thinks we will see more, not less, of politicians like Cawthorn.",
    "By 2020, Asheville had been added back to the 11th District, but the area remained solidly conservative and pro-law enforcement.",
    "In August 2020, the investigative news site Asheville Watchdog revealed that one of his campaign's central assertions was false.",
    "A car accident several years earlier had left him partially paralyzed, and he conducted the meet-and-greet from his wheelchair.",
    "In debates, he played the role of idealistic outsider running against Democrat and former Guantnamo Bay prosecutor Moe Davis.",
    "I was inspired by him, that he was going beyond his disabilities to do something for other people,? Greathead, 49, tells me.",
    "The new district puts him in the higher-profile Charlotte media market and presents an easier win than his current district.",
    "He wishes Cawthorn would focus on those issues rather than speaking at school board meetings on the other side of the state.",
    "She found Cawthorn to be a very motivational speaker? and was pleased to discover that his father, Roger, had been a Marine.",
    "I was a huge supporter of Madison, and I'm very disappointed,? says the former firefighter and certified nursing assistant.",
    "Some of them were hesitant, concerned about Cawthorn's age and inexperience, but they told Erwin they trusted his judgment.",
    "But two weeks before the event, a staffer notified her that Cawthorn had a scheduling conflict and could no longer attend.",
    "In October, Campbell spoke at a meeting and threatened civil and criminal? action if the board didn't remove the mandate.",
    "As The Washington Post has reported, the holes in his origin story didn't come to light until after he'd won the primary.",
    "Your words can incite or calm,? he wrote on Facebook, apologizing to the people he had encouraged to vote for Cawthorn.",
    "This corner of southern Appalachia has contributed two stars to the Trump universe: Mark Meadows and Madison Cawthorn.",
    "He's always wanted more young people to get involved in politics, and here was one with a Hollywood-worthy backstory.",
    "They're judging us by him,? Erwin says, and he represents a small group of people.?\nThat's not how we are,? he adds.",
    "Campbell knew her views weren't popular locally, and she was thrilled that Cawthorn spoke against the mask mandates.",
    "As chair of the local GOP, Greathead tried to invite him to events last summer but could never reach him personally.",
    "Refugees from New York and Louisiana pitched tents in the forest, depleting the sparse resources of the remote town.",
    "Some pundits said Cawthorn switched districts because internal polling showed he could win more easily in the 13th.",
    "Heath Shuler, a former NFL quarterback and Blue Dog Democrat, was the last member of his party elected to the seat.",
    "Graham County's population dropped in the most recent Census because it's so hard to find jobs, Wiggins explains.",
    "At one Republican event, she presented Cawthorn with a commemorative military coin that she and her husband made.",
    "Greathead also runs a political watch page on Facebook and has apologized for persuading people to vote for him.",
    "They were a study in contrasts: one petite and dark-haired with glasses, the other blond, muscular and grinning.",
    "The conservative, Georgia-based super PAC Protect Freedom spent more than $570,000 to boost Cawthorn's campaign.",
    "After retiring as sheriff in 2006, Erwin ran the North Carolina Association of Chiefs of Police for nine years.",
    "That was very frustrating because now we're two weeks away from our event and had no guest speaker,? she says.",
    "George Erwin Jr., the former sheriff of Henderson County, received a call from Cawthorn asking for a meeting.",
    "In the presidential election of 2012, the 11th became the most Republican district in the state, Cooper says.",
    "When she saw him at the state Republican convention in June, he didn't remember who she was, Greathead says.",
    "Dale Wiggins, 70, met me at the county administrative office wearing denim overalls and a camouflage shirt.",
    "Meanwhile, Cawthorn has built a national reputation for touting some of the most extreme right-wing ideas.",
    "Several autoimmune disorders and successive spinal surgeries had left her bedridden for more than a year.",
    "I told him the most important thing for me is taking care of the people in this district,? Erwin recalls.",
    "This angered many local conservatives, who didn't appreciate Meadows's attempt to handpick his successor.",
    "It was a big celebration at the local airport  the previous year, 4,000 people had attended, Griggs says.",
    "People like Cawthorn and Boebert and [Matt] Gaetz aren't about a place as much as a brand,? Cooper says.",
    "The evening they met, Cawthorn posed for a photo at the local GOP headquarters with his arm around her.",
    "Until a dozen years ago, the 11th was the most competitive congressional district in this purple state.",
    "Of the district's 768,600 residents, 18 percent of families with children live below the poverty level.",
    "Within hours, Lynda Bennett, a real estate agent and friend of Meadows's wife, declared her candidacy.",
    "After Greathead was elected chair of the local party in March 2021, she saw less and less of Cawthorn.",
    "Afterward, a video clip circulated that made Bennett look like a Never Trumper? (a charge she denied).",
    "I will not vote for a Republican candidate simply because he or she is a Republican,? Wiggins told me.",
    "They had redrawn the district lines to favor one of their own  Moore  and Cawthorn blew up that plan.",
    "He is fighting very hard, not just for our district but for our state and for our country,? she said.",
    "When he visited the county, she says, he didn't give enough public notice for constituents to attend.",
    "During Meadows's tenure, the counties that contain Asheville and Hendersonville grew and diversified.",
    "Jan Griggs was campaigning for Cherokee County commissioner while Cawthorn was running for his seat.",
    "Cawthorn had attended a board meeting in September and argued against keeping the mandate in place.",
    "He has said he wants to be governor one day, and this high-profile grab for more voters could help.",
    "Cawthorn's district covers most of the mountain towns that make up North Carolina's western border.",
    "Hendersonville is one of western North Carolina's largest cities and Madison Cawthorn's hometown.",
    "Stanley Furniture had a manufacturing plant here that employed 400 people, but it closed in 2014.",
    "But as soon as Cawthorn entered the race, Moore told colleagues he would not seek higher office.",
    "The nonpartisan Henderson County Board of Public Education had debated mask mandates at length.",
    "By her calculations, he visited the area three times without inviting constituents to join him.",
    "A retired U.S. Marine, she had worked as the county's veterans service officer for seven years.",
    "A campaign ad said he planned on serving his country in the Navy, with a nomination to the U.S.",
    "He agreed to help Cawthorn and began making calls to county commissioners and police officials.",
    "The nearest hospital is an hour away, and residents couldn't afford a deluge of sick tourists.",
    "When she was in the Marines, she was required to respond promptly to congressional inquiries.",
    "We want the right to choose for our kids,? said Beth Campbell, a 33-year-old mother of three.",
    "Less than three weeks later, on Veterans Day, Cawthorn announced he was switching districts.",
    "So she reached out to Cawthorn's scheduler and received emails confirming his participation.",
    "The conservative Carolina Journal reported he was polling residents there in early November.",
    "Yet Cawthorn admitted in a deposition that the academy rejected him before the car accident.",
    "What Cawthorn's done has been successful from Madison Cawthorn's perspective,? Cooper says.",
    "She worries about people from Atlanta and Florida buying up mountain property around her.",
    "(In an interview in New York Magazine, he said he always has his hunting knife with him.)",
    "Erwin considers himself a Reagan Republican and mourns the loss of civility in politics.",
    "Cooper, the Western Carolina professor, could not find any other example in the country.",
    "The next year, Shuler announced he wouldn't run again, and Mark Meadows took his place.",
    "When covid first hit, caravans from Georgia and Tennessee emptied the store's shelves.",
    "She invited him to be the guest speaker at Cherokee's annual veterans event last fall.",
    "He urged the audience to stock up on ammunition and defend themselves against tyranny.",
    "One officer died of a stroke, and two others died by suicide shortly after the riot.",
    "It was not the same level of vitriol that is in his current rhetoric,? Cooper says.",
    "With support from those key players, You'll win this runoff,? Erwin told Cawthorn.",
    "I'm not about all the hate.?\nJan Griggs at a veterans memorial in downtown Murphy.",
    "She was disappointed when Cawthorn pulled out of an appearance at a local event.",
    "The mandate was briefly lifted in November, but by January it was back in place.",
    "Moore had been widely expected to run for Congress in the newly drawn district.",
    "A lot of folks are disgruntled, and they feel disenfranchised,? Erwin tells me.",
    "I don't see anything getting accomplished,? she says of her elected officials.",
    "That June, Cawthorn won the runoff with nearly twice as many votes as Bennett.",
    "He was missing the next-to-last day of deer hunting season to speak with me.",
    "To my knowledge, national Republicans don't have a platform,? Wiggins says.",
    "When he first visited Cawthorn's home in Hendersonville, he was impressed.",
    "It's hard to believe he and Cawthorn belong to the same political party.",
    "If you commit yourself to something, you should stand by it,? she says.",
    "Deserters from both sides hid in these mountains during the Civil War.",
    "There's only one grocery store to sustain this county of 8,000 people.",
    "Many residents travel out of town every week to work in construction.",
    "It was easy to overlook the unknown 24-year-old running for Congress.",
    "I'm having to eat my words and say I made a huge mistake,? she says.",
    "I can't think of one thing he's done for our district,? Erwin says.",
    "I can't think of one thing he's done for our district,? Erwin says.",
    "Why couldn't Cawthorn extend her the same courtesy, she wondered.",
    "That kind of stuff right there was the kicker for me,? she says.",
    "But all that changed  ? when he was partially paralyzed in 2014.",
    "Erwin refused an offer to serve as Cawthorn's district director.",
    "But many people here don't believe they have returned the favor.",
    "My father worked like that most of his life,? Wiggins tells me.",
    "Indeed, Republicans in Raleigh seemed taken aback by the move.",
    "This move is not an abandonment,? he said in a Facebook video.",
    "Robbinsville, N.C., is even more remote than Cherokee County.",
    "But Erwin's confidence in the new congressman eroded quickly.",
    "She is a U.S. Marine Corps veteran and a county commissioner.",
    "But all of this outcry may play right into Cawthorn's hands.",
    "Cawthorn responded by suing members of the elections board.",
    "It flip-flopped from Democrat to Republican for 36 years.",
    "Lord have mercy, what do you do?? she says despairingly.",
    "I saw no calming words and people died and were injured.",
    "It's not a local issue; it's a global issue,? she said.",
    "When they do this during hard times  that bothers me.",
    "(I moved to a small town south of Asheville in 2018.)",
    "Griggs was shocked that no one had told her sooner.",
    "Wiggins considers himself an Eisenhower Republican.",
    "Meeting Cawthorn inspired her to reenter politics.",
    "As of press time, no new map had been approved.",
    "Some waved flags and wore America First? hats.",
    "Now the economy is mainly driven by tourism.",
    "That's a very personal thing,? Griggs says.",
    "Shannon Greathead is trying not to cuss.",
    "But that's no consolation to Greathead.",
    "But Cawthorn had a different narrative.",
    "Only one board member agreed with her.",
    "So Graham County closed its borders.",
    "That was the last straw for Erwin.",
    "In fact, it's quite the opposite.",
    "I'm a penny pincher,? she says.",
    "He served from 2007 until 2013.",
    "Naval Academy in Annapolis.",
    "Reach her at lisarab.com.",
    "Then came Jan. 6, 2021.",
    "And he was right."
  ]
}