{
  "id": 3043,
  "mediaId": 65,
  "date": "2/22/2022 12:00:00 AM",
  "headline": "Madison Cawthorn unveils new Republican Party platform, the 'New Contract with America'",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/e0ae43c5-6f80-407f-8f2f-1e0e7ef5268c/8f054771-4bb5-4c6d-b1fd-b64910ab0fa1/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/madison-cawthorn-unveils-republican-platform",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marisa Schultz",
  "authorUrl": "https://www.foxnews.com/person/s/marisa-schultz",
  "termIds": [
    2303,
    1101,
    1101,
    2303,
    600,
    600,
    428,
    428,
    562,
    562,
    545,
    545,
    2787,
    2787,
    2945,
    2945
  ],
  "sentences": [
    "MADISON CAWTHORN SAYS EFFORTS TO KEEP HIM OFF THE BALLOT FOR JAN. 6 ACTIONS HAVE 'SNOWBALL'S CHANCE IN HELL'\nIn the highly-produced video made by his campaign team, Cawthorn markets his pledge as the opposite of the Green New Deal, the progressive climate and jobs plan authored by New York Democratic Rep. Alexandria Ocasio-Cortez, who was previously the youngest member in Congress when she was sworn in at age 29.",
    "The contract also calls for abolishing the Department of Education, making English the official language of the United States, banning federal funding for critical race theory teachings, and enacting school choice on the federal level so federal dollars follow the students to their school of choice, including private religious schools.",
    "GOP REP. MADISON CAWTHORN LAUNCHES CAMPAIGN TO IMPOSE TERM LIMITS ON CONGRESS: 'DRAIN THE SWAMP'\nGingrich, the former Republican House speaker, was an architect of the 1994 legislative agenda called the Contract with America that detailed actions Republicans would take if they won the majority in Congress.",
    "Cawthorn's contract calls for legislation to impose term limits on members of Congress and on federal career employees, paying for a study of \"decades of failed governance\" at urban centers, while banning federal funding for cities that defund the police or provide sanctuary to undocumented immigrants.",
    "EXCLUSIVE: Rep. Madison Cawthorn, R-N.C., unveiled a new Republican Party platform designed after former House Speaker Newt Gingrich's \"Contract with America\" that he hopes conservatives around the country will pledge to enact should the GOP retake Congress in the midterm elections.",
    "The New Contract for America reads like a conservative wish list, including slashing federal funds, replacing the income tax, abolishing the Department of Education and stating that life begins at conception and therefore affording legal protections to fertilized eggs and fetuses.",
    "The New Contract with America outlines 10 overarching \"pillars\" for the GOP: government spending, economy, government reform, health care, education, culture and family unit, energy and environment, immigration, technical innovation and defense and veterans.",
    "Cawthorn, 26, revealed his \"New Contract with America\" legislation to Fox News Digital along with a video trailer that he'll circulate on social media to rally support for what he calls the \"America First\" doctrine for the next generation of conservatives.",
    "Other provisions include abolishing the 1934 National Firearms Act that taxes guns, finishing former President Trump's border wall with Mexico, breaking up Big Tech monopolies, and demanding China compensate the United States for the COVID-19 pandemic.",
    "\"[Gingrich] really had to rely on convincing 218 members of Congress to do this, whereas we found a lot of success in just being able to go directly to the people through social media and all the other means we have available now,\" Cawthorn said.",
    "\"I personally find it easier to convince 30 million Americans rather than 218 members of the Congress to back this piece of legislation, and then use those 30 million Americans to then leverage their own representatives in these primaries.\"",
    "Among the major changes: slashing government spending by a third by 2031; enacting a balanced budget amendment; and abolishing the income tax and finding a replacement flat tax or consumption tax by 2026.",
    "But in a big departure from the 1994 original, this New Contract with America is authored by the youngest member of Congress, and he's rolling it out without explicit support from leadership.",
    "Candidates signed the pledge during former President Bill Clinton's first midterm election and the movement was credited with helping Republicans win back both the House and Senate.",
    "\"You look at every primary in the country right now, everyone's running on the idea of America First,'\" Cawthorn said, \"but so few people can actually give that a definition.",
    "In a sign of how campaigning has changed, Cawthorn wants to collect endorsements from the public, which he hopes will then compel members of Congress to sign on.",
    "AOC, SQUAD UNDER FIRE AS DEMS REJECT THEIR 'DEEPLY PROBLEMATIC' AGENDA\nThe legislation then offers 52 major policy changes to address those pillars.",
    "\"I think this is a definitive roadmap  for my generation to reclaim our country,\" Cawthorn told Fox News Digital in an exclusive interview.",
    "\"I think the Green New Deal is much less of a climate plan and much more of a Communist manifesto,\" Cawthorn told Fox News Digital.",
    "And so I wanted to give an actual definition of a way that my generation, if we enact these policies, can reclaim our country.\"",
    "I believe that this is the plan the American people can really coalesce around because this is one that puts people first.\"",
    "Cawthorn said he talked to Gingrich about his updated \"contract\" and he hopes the former speaker would endorse his plan.",
    "Cawthorn says he'll follow up with more specific and separate legislation that will go into more detail.",
    "Cawthorn said this agenda should become a metric by which to measure GOP candidates.",
    "Gingrich was not immediately available for comment.",
    "\"So this is really a retort to that.\"",
    "\"..."
  ]
}