{
  "id": 3054,
  "mediaId": 43,
  "date": "2/16/2022 12:00:00 AM",
  "headline": "Morning Digest: Longtime Democratic power player on Long Island will not seek",
  "image": "https://images.dailykos.com/images/1038323/story_image/GettyImages-1151033475.jpg?1644965846",
  "link": "https://www.dailykos.com/story/2022/2/16/2080535/-Morning-Digest-Longtime-Democratic-power-player-on-Long-Island-will-not-seek-re-election-to-House",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1119,
    1248,
    1299,
    1308,
    1335,
    1404,
    1454,
    1611,
    1670,
    1801,
    1835,
    1878,
    2087,
    2214,
    2303,
    2494,
    2497,
    2524,
    177,
    461,
    571,
    2550,
    2634,
    2789,
    2814,
    2825,
    2834,
    2885
  ],
  "sentences": [
    "Country * Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cabo Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Cte d'Ivoire Croatia Cuba Curaao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Runion Romania Russian Federation Rwanda Saint Barthlemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia ZimbabweUnited States\nAttribution: Stephen Wolf / Daniel Donner\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "The results are below, with the firm's February 2021 numbers in parentheses:\n51-43 vs. Rep. Charlie Crist (52-41)\n53-42 vs. state Agriculture Commissioner Nikki Fried (51-42)\n53-37 vs. state Sen. Annette Taddeo\nThe only other poll we've seen here this year was a late January offering from Suffolk University that showed the incumbent leading Crist and Fried 49-43 and 51-40, respectively.",
    "Gordon faces two Suffolk County legislators, Bridget Fleming and Kara Hahn, in the June primary for an open seat that would have backed Joe Biden 55-44.\n? NY-16: Westchester County Legislator Vedat Gashi filed FEC paperwork last week for a potential Democratic primary bid against freshman Rep. Jamaal Bowman, and the Yonkers Times says that he is \"expected to formally announce by Feb.",
    "The Colorado Sun explains that Peters, who has been one of the far-right's most prominent election deniers, is currently \"under grand jury investigation for a security breach of her county's election system after she allegedly allowed an unauthorized person to attend a sensitive Dominion Voting Systems software update and facilitate the digital copying of her election system.\"",
    "Secretaries of State\n? CO-SoS: Mesa County Clerk Tina Peters announced Monday evening that she would seek the Republican nomination to challenge Democratic Secretary of State Jena Griswold, a declaration that came days after the Grand Junction Police Department charged the nationally infamous Peters with obstructing an officer when she refused to turn over her iPad.",
    "? MN Redistricting: A special panel of five appellate and trial court judges tasked by the Minnesota Supreme Court with drawing new congressional and legislative maps completed its work on Tuesday, after the Democratic-controlled state House and the GOP-run state Senate could not agree on new redistricting plans (data files can be found here).",
    "She joined the Democratic Party in 2005 the same year party leaders recruited her to challenge Nassau County District Attorney Denis Dillon, whose political trajectory went in the opposite direction: He first won this office in 1974 as a Democrat but became a Republican in 1989 over his opposition to abortion rights.",
    "? PA-Gov: While state Senate President Pro Tempore Jake Corman ended 2021 with more cash on hand than any of his many rivals in the May Republican primary, the Philadelphia Inquirer's Andrew Seidman reports that his three-month-old campaign has been burdened by major staff turnovers and internal disappointments.",
    "However, Democrats will want to still keep an eye on this contest following last year's Republican wins in Nassau County's local elections; indeed, one of those victors was Bruce Blakeman, who was narrowly elected county executive seven years after losing an open-seat race for the 4th District to Rice.",
    "Leading Off\n? NY-04: New York Rep. Kathleen Rice, a Long Island Democrat who spent years as an intra-party critic of House Speaker Nancy Pelosi, declared Tuesday that she would not seek a fifth term representing the 4th Congressional District, which is located entirely within Nassau County.",
    "Meanwhile, freshman Republican Rep. Andrew Garbarino, who was elected last cycle after longtime Rep. Peter King retired, should have no trouble winning now that his 2nd District has become considerably more conservativewhich would actually make him the area's most senior congressman.",
    "Dillon had convincingly won re-election in 2001 by a 56-44 margin, but Rice campaigned on charges that the incumbent had treated his office as \"his birthright,\" offered too many plea bargains, and done a poor job investigating abuse allegations involving the local Catholic Church.",
    "Redistricting\n? LA Redistricting: Louisiana's Republican-run state House and Senate each approved new maps for their own chambers by veto-proof majorities on Monday, though the Senate plan passed on a virtually party-line vote while 12 Democrats voted in favor of the House map.",
    "The commercial comes at a time when the 11-term congresswoman faces her first-ever serious primary foe since she first won this safely blue district in the form of Amane Badhasso, a member of Saint Paul's Department of Human Rights and Equal Economic Opportunity.",
    "And while the candidate raised $3 million from donors during 2021far more than anyone else brought in, not including self-fundingan unnamed source says his team initially believed they could have raised $2 million more during this time than they ultimately did.",
    "New York Rep. Kathleen Rice (D)\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Almost everyone had expected Moore to run in the 13th District under the map that has since been struck down, but he decided not to after Rep. Madison Cawthorn surprised everyone by announcing he'd run for that constituency rather than the neighboring 14th.",
    "Senate\n? PA-Sen: The super PAC Honor Pennsylvania's new commercial against TV personality Mehmet Oz uses footage from his show to argue he's a \"Republican in name only,\" including a 2013 clip of him enthusiastically jumping up and down with Michelle Obama.",
    "Rice also took part in the disorganized attempt to keep Pelosi out of the speaker's chair in 2019 after Democrats regained control of the chamber, to which Nassau County Legislator Siela Bynoe responded by threatening to challenge her for renomination.",
    "Rice won the Democratic primary for the open 4th District 57-43 against Abrahams, who ran to her left but raised little money, and she spent most of the cycle looking like the favorite against Blakeman in a seat Barack Obama had carried 56-43 in 2012.",
    "Rice, however, went on to win her final term without any serious intra-party or GOP opposition, and Pelosi soon awarded her old critic a slot on the House Committee on Energy and Commerce that fellow New York Rep. Alexandria Ocasio-Cortez had wanted.",
    "State Sen. Eric Schneiderman made Rice's background as a Republican an issue, and he ended up beating her 34-32; self-funding attorney Sean Coffey scored 16%, with much of his support coming from upstate counties where Rice otherwise performed well.",
    "Opt in to email updates from Daily Kos Elections\nSponsored by: Daily Kos Elections\nAs for possible Democratic successors, City & State reports that former Nassau County Executive Laura Curran, who lost that race to Blakeman, is considering a bid.",
    "Rice's announcement also means that Long Island's House delegation will get almost a complete refresh, since two other local representatives, 1st District Republican Lee Zeldin and 3rd District Democrat Tom Suozzi, are both running for governor.",
    "State Sen. Todd Kaminsky, who lost last year's special election for Nassau County district attorney, also has been talked about, but Jacobs says that, based on their recent conversations, he thinks Kaminsky \"would not be inclined to run.\"",
    "Rice ran statewide for attorney general in 2010 when Andrew Cuomo left the post to successfully run for governor, though the crowded primary for this powerful office generated little attention until the final weeks before Election Day.",
    "The court-drawn map released Tuesday (see our MN Redistricting item above) moves about 13,000 of McCollum's constituents to other seats without adding any new areas, so the incumbent already represents the entire new 4th District.",
    "Mayors\n? Louisville, KY Mayor: Developer Craig Greenberg, who is one of the leading Democrats competing in the May primary, was shot at Monday in his campaign headquarters, but neither the candidate nor anyone else was injured.",
    "Corman earlier this month hired his third campaign manager after already cycling through two others, and Seidman adds that he's also parted ways with his \"political director, finance director, a fund-raiser, and scheduler.\"",
    "Rice, though, decisively won a third term at home in 2013 in what was an otherwise horrible night for Nassau County Democrats, which made her a compelling recruit when Rep. Carolyn McCarthy retired early the next year.",
    "Cuellar, just like in 2020, uses the type of language you'd normally expect to find in a Republican commercial, with a narrator arguing that Cisneros' agenda would result in \"open borders that would make us less safe.\"",
    ": When State House Speaker Tim Moore was asked Tuesday if he would take a new look at running for the U.S. House now that the state Supreme Court has ordered new congressional maps, he didn't rule out the idea.",
    "Rice won her next term with ease, and while she considered another run for attorney general in 2018 when Schneiderman resigned after multiple women accused him of physical abuse, she opted to stay in the House.",
    "Rice, who got her start as a prosecutor in Queens before taking a post in the U.S. attorney's Philadelphia office, registered to vote as a Republican in 1984, though she never cast a ballot until 2002.",
    "The story also says that, while Executive Councilor Cinde Warmington has been talked about as a possible Democratic contender, she \"does not appear to be taking any steps toward a campaign.\"",
    "The congressional map makes limited changes to existing boundaries and therefore maintains the status quo, with four districts that would have voted for Joe Biden and four for Donald Trump.",
    "The local district attorney's office is also investigating whether Peters illegally recorded the court hearing of one of her deputies with the iPad that the police tried to seize last week.",
    "? TX-28: Conservative Rep. Henry Cuellar is going up with his first negative campaign ad of the cycle against attorney Jessica Cisneros two weeks ahead of their Democratic primary rematch.",
    "However, a Republican organization called the Independent Majority Group launched a $450,000 buy in the final days to boost Blakeman, who held her to a 53-47 win during that GOP wave year.",
    "Jay Jacobs, who chairs both the state and county Democratic parties, also mentioned former Hempstead Supervisor Laura Gillen and Nassau County Legislator Carri Solages as possibilities.",
    "Rice also argued that Dillon, who had run for governor in 1986 as the nominee of the Right to Life Party, allowed his anti-abortion views to interfere with his ability to do his job.",
    "On the other side, J Street, which describes itself as a \"pro-Israel, pro-peace group\" is spending $100,000 on digital ads running in English and Spanish in support of Cisneros.",
    "House\n? MN-04: Rep. Betty McCollum's first TV spot for the August Democratic primary touts her work in Congress and progressive record; there is no word on the size of the buy.",
    "? NY-01: EMILY's List has endorsed Jackie Gordon, who was the 2020 Democratic nominee in the old 2nd District, for the new 1st District in the northeastern part of Long Island.",
    "? NM-Gov: The RGA has launched what the Santa Fe New Mexican describes as a \"six-figure ad buy\" caricaturing Democratic incumbent Michelle Lujan Grisham as soft on crime.",
    "(Veteran Democratic Rep. Gregory Meeks also represents a small portion of Nassau County, but almost 90% of his safely blue 5th District is made up of his Queens base.)",
    "On the GOP side, businessman Bill Staniford generated very little attention when he launched his campaign last quarter and has primarily been self-funding his effort.",
    "Political observers are still very much treating Corman like a viable contender, though some suggested to Seidman he \"may have been overly confident at the outset.\"",
    "The decision was a surprise, as the congresswomanwho turned 57 the day she made her announcementhad given no obvious indication she was looking to leave the House.",
    "The Senate map, just by raw numbers, would appear to move slightly in the GOP's favor, since Biden's existing edge in districts would get cut from 37-30 to 36-31.",
    "Badhasso outraised McCollum $306,000 to $218,000 during her opening quarter, though the incumbent ended 2021 with a $553,000 to $250,000 cash-on-hand lead.",
    "The Senate leader reportedly predicted in October that he could clear the field, something Corman himself acknowledged this month very much didn't happen.",
    "\"I probably thought there was an opportunity to sort of coalesce around someone,\" he told the Inquirer, adding, \"So, if I said that, it didn't happen.\"",
    "Staniford raised a mere $52,000 during the fourth quarter but self-funded $200,000, which left him with $233,000 on hand at the end of December.",
    "The congresswoman, though, had an acrimonious relationship with Pelosi, whom she'd publicly called on to step down as Democratic leader.",
    "Griswold went on to prevent Peters from overseeing the 2021 elections in Mesa County, and she's seeking the same sanction for this year.",
    "Governors\n? FL-Gov: Mason-Dixon has released its first general election poll of Florida in nearly a year, and it shows Republican Gov.",
    "Mason-Dixon also takes a look at the August Democratic primary and shows Crist ahead of Fried 44-27, with just 3% going to Taddeo.",
    "The clerk was arrested and filmed being restrained by the cops, with one officer telling her, \"Do not kick, do you understand?\"",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "(Suffolk did not test Taddeo; Mason-Dixon's earlier poll also did not include her, but she hadn't launched her campaign yet.)",
    "The redrawn version of Rice's constituency, which barely changed after redistricting, would have supported Joe Biden 55-43.",
    "Quintez Brown, a 21-year-old candidate for the Metro Council, was arrested minutes later and charged with attempted murder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Finally, Newsday name-drops Nassau County Legislature Minority Leader Kevan Abrahams, who lost the 2014 primary to Rice.",
    "Rice's retirement, though, will likely entice more Republicans to take a look ahead of the early April filing deadline.",
    "The Democrat, who proved to be a strong fundraiser, ultimately ended up unseating Dillon in a tight 51-49 contest.",
    "The spot concludes with the sound of a siren as the narrator describes the challenger as \"a risk we can't afford.\"",
    "The House, meanwhile, would go in the opposite direction, from a 72-62 Biden advantage to a wider 77-57 gap.",
    "A number of these seats, however, are extremely close, so the legislature will remain a major battleground.",
    "Rice is the 30th House Democrat who is retiring or running for another office, compared to 13 Republicans.",
    "? NH-Gov: WMUR asked state Sen. Tom Sherman if he was near to deciding if he'd challenge Republican Gov.",
    "A few other Republicans are already running, including former Jefferson County Clerk Pam Anderson.",
    "Pelosi, for her part, blocked Rice from taking a spot on the House Judiciary Committee.",
    "Both bodies must still pass one another's maps before they can go to Democratic Gov.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Chris Sununu, prompting the Democrat to reply that he was \"very close.\"",
    "Ron DeSantis decisively beating each of his three Democratic foes.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "\"I'm not even considering that right now,\" said the Republican.",
    "Get the Daily Kos Elections Morning Digest over email\n Sign up!",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "Redistricting, though, will not be much of a factor here.",
    "? NY-Gov: Sen. Kirsten Gillibrand has endorsed Gov.",
    "\"I'm just focused on getting these maps approved.\"",
    "Kathy Hochul in the June Democratic primary.",
    "Authorities have not yet ascribed a motive.",
    "Check out our new podcast, The Downballot!",
    "This is a short blurb about Daily Kos.",
    "You may unsubscribe at any time.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Here's our privacy policy.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "John Bel Edwards.",
    "Please read it.",
    "Sign up!",
    "? NC-??",
    "18.\""
  ]
}