{
  "id": 3060,
  "mediaId": 65,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "Arkansas super PAC spends $900K on ads supporting GOP Senate candidate Jake Bequette",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/41caeb17-b842-49f7-be67-ab0cfbfe8a95/d11f0ec6-0bd1-46cf-9b18-240a3b320ed6/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/arkansas-super-pac-senate-jake-bequette-ad-buy",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brooke Singman",
  "authorUrl": "https://www.foxnews.com/person/s/brooke-singman",
  "termIds": [
    1051,
    1051,
    1218,
    1218,
    571,
    428,
    101,
    101,
    36,
    36,
    37,
    37,
    428,
    571,
    2551,
    2551,
    2760,
    2760
  ],
  "sentences": [
    "\"No one has more respect for President Trump than me, and that endorsement came before I got into the race,\" Bequette said in an interview with Fox News last month, vowing to \"stand unafraid and unapologetically\" for pro-American policies and traditional American values if elected.",
    "ARKANSAS SENATE CANDIDATE JAKE BEQUETTE SLAMS CORPORATE AMERICA, PRO SPORTS LEAGUES FOR 'UNPATRIOTIC STANCES'\nPolitico first reported in October that Dick Uihlein, a conservative mega donor, gave $1 million to the Arkansas Patriots Fund super PAC in support of Bequette.",
    "FIRST ON FOX: The super PAC aligned with Arkansas Republican Senate candidate Jake Bequette purchased nearly $900,000 in broadcast and cable ads in the state in support of the former NFL player and U.S. Army veteran's campaign, Fox News has learned.",
    "Too many Republicans are too weak to stop them,\" the ad says, showing an image of incumbent Arkansas GOP Sen. John Boozman with the words \"RINO Republicans\" blaring on the screen.",
    "ARKANSAS SENATE RACE: BEQUETTE CHARGES BOOZMAN, GOP ESTABLISHMENT HAVE 'NOT BEEN LEADING FROM THE FRONT'\nThe super PAC put $561,000 toward ads on broadcast and $332,367 on cable.",
    "ARMY VETERAN, SENATE CANDIDATE JAKE BEQUETTE SAYS AFTER 9/11, HE 'FELT THE CALL TO WEAR THE UNIFORM'\n\"Now, Bequette is volunteering for duty in the U.S. Senate,\" the ad says.",
    "But Boozman enjoys an endorsement from former President Trump, who threw his support behind the candidate in March 2021, months before Bequette launched his campaign.",
    "Bequette enlisted in the U.S. Army in August 2017, completed Army Ranger school in October 2018 and became part of the 101st Airborne Division deployed to Iraq.",
    "Meanwhile, according to Federal Election Commission data as of Dec. 31, 2021, Boozman is far ahead of his primary challengers, with $3.5 million cash on hand.",
    "The ad highlights Bequette's college football career, his time playing professionally for the New England Patriots and his decision to join the military.",
    "At the time, Bequette's campaign reported having $411,000 cash on hand, with Jan Morgan reporting just over $59,000.",
    "This week, the Arkansas Patriots Fund spent $893,367 in pro-Bequette ads, which began airing on Tuesday night.",
    "Bequette has recently seen endorsements from Reps. Madison Cawthorn, R-N.C., and Burgess Owens, R-Utah.",
    "Neither the Bequette campaign nor the Boozman campaign have purchased ad time yet.",
    "\"Conservative, God-fearing, Arkansas Razorback, American patriot.\"",
    "(Wesley Hitt/Getty Images)\nThe size of the ad buy is striking.",
    "\"Democrats are destroying our country."
  ]
}