{
  "id": 3077,
  "mediaId": 43,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Cawthorn Facing Ballot Removal for Role in Insurrection (So May Trump, Others): 'BradCast' 2/1/2022",
  "image": "https://images.dailykos.com/images/1033123/story_image/BradCast_MadisonCawthorn-Jan6-Ellipse_020122.jpg?1643771562",
  "link": "https://www.dailykos.com/story/2022/2/1/2078108/-Cawthorn-Facing-Ballot-Removal-for-Role-in-Insurrection-So-May-Trump-Others-BradCast-2-1-2022",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1147,
    1090,
    1090,
    1487,
    1487,
    428,
    545,
    545,
    428,
    2672,
    2621,
    2621,
    2672,
    2834,
    2834,
    2945,
    2945
  ],
  "sentences": [
    "We're joined today by longtime Constitutional law expert JOHN BONIFAZ, co-founder and President of the non-partisan, non-profit Free Speech for People, to discuss this rather amazing and actually quite serious challenge to Cawthorn's candidacy and perhaps additional challenges to other insurrectionist candidates such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, Paul Gosar of Arizona, Lauren Boebert of Colorado and potentially even one Donald J. Trump.",
    "NC state law requires that candidates must meet all requirements for office as detailed in the U.S. Constitution and further requires potential candidates to disprove any challenges to those qualifications, such as their age, legal residency, citizenship status or, in this case, whether or not they've \"engaged in insurrection or rebellion\" against the U.S. Constitution.",
    "And if Cawthorn is, in fact, disqualified from running in North Carolina based on restrictions in the U.S. Constitution, what will that mean for other such insurrectionist candidates in other states in 2022 and, indeed, for Trump himself, if and when he attempts to become a candidate on the ballot again in the critical and closely divided swing-state in 2024?",
    "Once the maps are settled, however, Bonifaz says the Board's \"longstanding process by which voters can bring these kinds of challenges\" includes creating a panel that will have 20 days to hear the case in which Cawthorn will have to defend himself, before the matter goes to the full Board and then, potentially, to state court on appeal.",
    "The freshman Congressman reportedly participated in planning meetings for the rallies in advance of the deadly attack on the U.S. Capitol on January 6th, 2021 and spoke at the rally on the Eclipse in front of the White House prior to Donald Trump's speech directing supporters to head to the Capitol and \"fight like hell\".",
    "Guest: Constitutional attorney John Bonifaz of Free Speech for People\nAlso: Trump more involved in 2020 gambit to seize voting machines than previously known...\nOn today's BradCast: Self-declared Republican \"Constitutionalists\" may not turn out to be huge fans of the written text of the U.S. Constitution after all.",
    "Also today, speaking of insurrectionist Trump, new exclusives late last night from both CNN and the New York Times suggest that the disgraced, twice-impeached former President was much more personally involved in the attempt to seize the nation's voting machines following the 2020 election than previously reported.",
    "* * *\nWhile we post The BradCast here every day, and you can hear it across all of our great affiliate stations and websites, to automagically get new episodes as soon as they're available sent right to your computer or personal device, subscribe for free at iTunes, Stitcher, TuneIn or our native RSS feed!",
    "Particularly Section 3 of the 14th Amendment which bars from federal office those \"who, having previously taken an oath, as a member of Congress, or as an officer of the United States...to support the Constitution of the United States...engaged in insurrection or rebellion against the same.\"",
    "But, he explains, \"the Framers of the 14th Amendment were clear that if you take an oath of office to defend and protect the Constitution, and then you turn around and engage in insurrection or give aid and comfort to it, then you are prohibited from holding future public office.",
    "\"It's a 'novel' challenge in the sense that it's the first such challenge since the Reconstruction Era,\" Bonifaz tells me, while noting that \"during that time, Section 3 of the 14th Amendment was applied to many Confederates who remained in positions of government power.\"",
    "\"Instead of complying with the process that is laid out under state law, he has now rushed to federal court with his attorney to try to completely declare the whole process by which candidate qualifications are brought to be unconstitutional\" Bonifaz contends.",
    "Cawthorn also joined dozens of other members of the House and Senate that day in voting against Joe Biden's Electoral College victory, despite the lack of evidence of fraud that might have changed the certified results of the election in any state.",
    "Finally today, Desi Doyen joins us for our latest Green News Report with bad news for fans of winter sports and good news for opponents of more deadly oil and gas drilling in the Gulf of Mexico...\nCLICK HERE TO LISTEN OR DOWNLOAD TODAY'S SHOW!...",
    "\"If Madison Cawthorn were ten years old and seeking to be on the ballot in North Carolina, there'd be no question that he's ineligible to be placed on the ballot because he doesn't meet the age qualification for a member of Congress.",
    "Barr, to his credit, is said to have immediately shot down the idea, telling the desperate loser that, since there was no evidence of fraud on the systems, the DoJ had no probable cause to believe they had been used in any crime.",
    "But the very fact that he's doing an end run around the state process and rushing into federal court ought to tell you a lot about whether Madison Cawthorn wants to appear before the State Board of Elections to defend himself.\"",
    "It could also turn out to be bad news in the not too distant for other members of the MAGA Caucus in Congress and even our disgraced former President -- even if that might be good news for the rest of the nation.",
    "Last month, an official complaint [PDF] was filed by voters with NC's State Board of Elections, charging that Cawthorn must be disqualified from running for re-election this year in the Tar Heel State.",
    "This is another qualification requirement -- you cannot take an oath of office, as Madison Cawthorn did on Jan. 3, 2021, and then turn around and engage in insurrection and hold public office again.\"",
    "But the Times offers new details on a third effort, which included a personal appeal by Trump in the Oval Office to his then Attorney General Bill Barr to have DOJ impound the voting systems.",
    "He charges that the last part of Section 3 states that \"Congress may by a vote of two-thirds of each House, remove such disability\" and that the Amnesty Act of 1872 declared just that.",
    "The effort to block Cawthorn's candidacy in NC is the first official volley in the 14Point3.org campaign created by good government groups Free Speech for People and Our Revolution.",
    "Now, we have the second insurrection in our nation's history and those who incited the insurrection or gave aid or comfort to it must also face accountability under that mandate.\"",
    "For the moment, while there is a separate legal challenge to NC's newly gerrymandered Congressional maps, the qualifications process for all candidates in the state is on hold.",
    "\"If it's so hard for him to prove that he's not an insurrectionist, maybe the real question is why Section 3 of the 14th Amendment should not be applied to him.\"",
    "\"If he's really nervous about appearing before the State Board of Elections, that may be a real indication that the Board needs to act in the voters' favor.",
    "Bonifaz explains why he believes that conviction for sedition or insurrection in a court of law is not necessary to trigger the Constitutional clause.",
    "The challenge is serious enough that, on Monday, Cawthorn filed a federal lawsuit in hopes of quashing the inquiry into his role on January 6th.",
    "It has resulted in a fascinating conversation among Constitutional law experts on the matter of what it means to \"engage\" in an insurrection.",
    "Yes, Cawthorn is relying on the dispensation given specifically to former Confederate rebels in 1872 to try and remain on the ballot in 2022.",
    "Team Trump was reportedly told by DHS that the federal agency lacked the authority to impound the voting systems.",
    "That's turning out to be very bad news right now for North Carolina's Republican Rep. Madison Cawthorn.",
    "One way or another, the matter must be settled in a few months before the state's primary election.",
    "CNN reports that there were actually two different Executive Orders drafted up for Trump's use.",
    "Bonifaz explains on today's program why he is less than impressed with that defense.",
    "His lawsuit claims that the State Board has no authority to keep him off the ballot.",
    "The other order would have directed the Department of Homeland Security to do so.",
    "That one would have ordered the Department of Defense to seize the machines.",
    "One was recently obtained by Politico, which we discussed last week.",
    "Also, that his efforts were far broader than previously known.",
    "Cawthorn's attorney has also offered another unique defense.",
    "[Audio link to full show is posted at end of this summary.]",
    "All of that, and much more is discussed on today's program.",
    "Trump's A.G. tendered his resignation shortly thereafter.",
    "Bonifaz describes the claim as absurd.",
    "[Cross-posted from The BRAD BLOG...]"
  ]
}