{
  "id": 3079,
  "mediaId": 209,
  "date": "1/30/2022 12:00:00 AM",
  "headline": "The GOP might retake Congress in the midterms. Then what?",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-desktop@1/v1643406145/gop%20house%20control.jpg",
  "link": "https://theweek.com/republicans/1009445/the-gop-might-retake-congress-in-the-midterms-then-what",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Grayson Quay",
  "authorUrl": "https://theweek.com/authors/grayson-quay",
  "termIds": [
    2465,
    2465,
    1448,
    1448,
    1341,
    1341,
    1427,
    1427,
    1609,
    1609,
    2087,
    2087,
    1801,
    1801,
    428,
    545,
    545,
    571,
    428,
    571
  ],
  "sentences": [
    "Sure, a right-wing CTC expansion will be designed to incentivize marriage and stay-at-home parenting, and it certainly won't include free pre-K, but a few blue lawmakers  especially some, like Manchin, in otherwise red states  may nevertheless defect for the sake of the kids.",
    "Get the latest news from The Week\nSign up for our free newsletter\nWhen it comes to these proposals, we could see moderate Republicans balk at such a bare-knuckle approach to politics, while the libertarians fret about setting a dangerous precedent for federal overreach.",
    "Republicans are expected to gain control of the House of Representatives after the 2022 midterms and could even reclaim the Senate if they hold vulnerable seats in Ohio, Pennsylvania, North Carolina, and Wisconsin and flip seats in Arizona, Georgia, or Nevada.",
    "On other mainstays of the GOP campaign trail in 2022  like banning critical race theory, defunding universities, punishing Big Tech and woke capital, finishing Trump's wall, and rolling back transgender acceptance  expect a slew of bills on Capitol Hill.",
    "The libertarians and establishment types will dig in their heels, but even among the more post-Trumpian segments of the GOP, some lawmakers might find their nerve failing them as they wade out into the unknown waters beyond Fusionist Island.",
    "When Vance suggested seizing the assets of the Ford Foundation to penalize the nonprofit for its pro-immigration advocacy, leading libertarian magazine Reason said the idea was based on \"anti-conservative, anti-liberty, authoritarian logic.\"",
    "Those hesitations are unlikely to stop a plurality if not majority of congressional Republicans from forging ahead, but as the Democrats so painfully learned over the past year, a single holdout can wreck an entire agenda.",
    "On some issues, such as voter ID and (if the Supreme Court overturns Roe v. Wade) abortion, Republicans in Congress can get what they want by standing by and letting red-state legislatures do their thing.",
    "And if a GOP candidate wins the White House in 2024, there's no guarantee Republicans won't squander their period of unified control even more thoroughly than Democrats are currently squandering theirs.",
    "Despite being a leading advocate for \"common-good capitalism,\" for example, Rubio joined libertarian-leaning Sen. Mike Lee (R-Utah) last February in denouncing Romney's child benefit as \"welfare.\"",
    "Senate Majority Leader Chuck Schumer (D-N.Y.), who aired the party's divisions before the whole country by forcing a futile vote on changing the filibuster, didn't lift a finger to defend them.",
    "It's hard to blame him when he has to deal with GOP troublemakers like Reps. Lauren Boebert (Colo.), Marjorie Taylor Greene (Ga.), Madison Cawthorn (N.C.), and Paul Gosar (Ariz.).",
    "But where Senate GOP leader Mitch McConnell (R-Ky.) is a master of keeping his caucus in line, McCarthy can't quite muster the same gravitas when his reps get rowdy.",
    "Sen. Bernie Sanders (I-Vt.) has suggested he might vote against whatever watered-down version of the Build Back Better agenda Biden manages to sell Manchin on.",
    "Democrats have achieved little in their first year of unified control of Congress, and intra-party spats between moderates and progressives are to blame.",
    "Still, that lack of control will make a newly Republican House the place to watch for an answer to Biden's recent question: \"What are Republicans for?\"",
    "McConnell won't allow such tomfoolery in the Senate, and respectable, establishment Republicans and Trump skeptics like Sen. John Thune (R-S.D.)",
    "Perhaps by January 2024, Republicans will be calling for the head of Sen. Mitt Romney (R-Utah) while Manchin lounges on his yacht.",
    "A big part of the agenda for any Republican-controlled Congress will be performative, Trumpian trolling of the left.",
    "(We saw a hint of the potential alliance between the trolls and the culture warriors when Ohio Senate candidate J.D.",
    "To that end, Vance, Arizona Senate candidate Blake Masters, Sen. Marco Rubio (R-Fla.), and Sen. Josh Hawley (R-Mo.)",
    "Someone will almost certainly read the lyrics to Kid Rock's new anti-Biden anthem into the congressional record.",
    "Cracks in the Republican faade will begin to appear once they've taken back the House, Senate, or both.",
    "Joe Manchin (D-W.Va.) and Kyrsten Sinema (D-Ariz.) have stymied President Biden's legislative agenda.",
    "By next January, Rep. Kevin McCarthy (R-Calif.) will probably be the one holding the gavel in House.",
    "Why risk antagonizing several of the party's biggest headline-grabbers over mere symbolic gestures?",
    "The up-and-coming trend goes by the name of \"pro-worker conservatism\" or \"common-good capitalism.\"",
    "What a new Republican agenda almost certainly won't hinge on is another round of tax cuts.",
    "But McCarthy might feel as though he has no choice but to cut the pranksters some slack.",
    "Railing against big government, all the rage in 2010, is now firmly out of style.",
    "He also floated the idea of campaigning for Sinema's primary challenger in 2024.",
    "The good  and bad  news for Democrats is that this mess likely won't last.",
    "Joe Rogan could be invited testify before the House's health subcommittee.",
    "Vance said Tuesday that he was \"honored\" to accept Greene's endorsement.)",
    "Hawley and Romney have both proposed expanded child tax credits (CTC).",
    "And this is an issue that could attract support from some Democrats.",
    "Various members of The Squad will face censure for no good reason.",
    "will almost certainly turn up their noses at most of these stunts.",
    "Perhaps first and foremost, Republicans are for owning the libs.",
    "Of course, there is a more concrete side to lib-owning, too.",
    "It's easy to maintain a unified front while in opposition.",
    "An attempt will be made to ban masks on the House floor.",
    "What do they want to do with power once they've got it?",
    "The pro-worker contingent might well need those votes.",
    "have all called for a re-shoring of American industry.",
    "Big corporations have become the bad guys.",
    "Sens."
  ]
}