{
  "id": 3089,
  "mediaId": 178,
  "date": "1/25/2022 12:00:00 AM",
  "headline": "Cawthorn challenge raises the question: Who is an 'insurrectionist'?",
  "image": "https://chorus.stimg.co/22720320/merlin_63205932.jpg?w=525&h=600&format=auto%2Ccompress&cs=tinysrgb&auto=compress&crop=faces&dpr=1",
  "link": "https://www.startribune.com/cawthorn-challenge-raises-the-question-who-is-an-insurrectionist/600139631/",
  "mediaOutlet": "Star Tribune ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jonathan Weisman New York Times",
  "authorUrl": "",
  "termIds": [
    1147,
    1596,
    2303,
    2467,
    2475,
    2667,
    2709,
    2834,
    2959
  ],
  "sentences": [
    "Nation 600139631\nWASHINGTON  A group of lawyers is working to disqualify from the ballot a right-wing House Republican who cheered on the Jan. 6 rioters unless he can prove he is not an \"insurrectionist,\" disqualified by the Constitution from holding office, in a case with implications for other officeholders and potentially former President Donald Trump.",
    "While the House committee investigating the assault on the Capitol has been unsuccessful in its effort to force key members of Congress to cooperate with the inquiry, the North Carolina case has already prompted a legal discussion  one that is likely to land in court  about what constitutes an insurrection and who is an insurrectionist.",
    "That section declares that \"no person shall\" hold \"any office, civil or military, under the United States, or under any state, who, having previously taken an oath\" to \"support the Constitution,\" had then \"engaged in insurrection or rebellion against the same, or given aid or comfort to the enemies thereof.\"",
    "\"I don't think we can have those persons who have engaged in acts of insurrection elected to office and serving in office in violation of their constitutional duties and oath,\" said John R. Wallace, the lead lawyer in the case and a campaign finance and election law expert in Raleigh, North Carolina.",
    "Bopp also said the Constitution clearly granted each chamber of Congress  not a board of elections  the power to determine eligibility for office, an assertion that Ron Fein, legal director of Free Speech for People, a nonpartisan interest group that is participating in the challenge, dismissed.",
    "North Carolina's new House district map, heavily gerrymandered by the Republican Legislature, is currently stuck in court, and the state's Board of Elections has frozen the candidacy qualifications case against Cawthorn until he can determine which district he intends to be a candidate in.",
    "Bopp declared the matter \"the most frivolous case I've ever seen\" but allowed that what he called an \"unethical\" exploitation of North Carolina law by \"competent\" lawyers could pose a real threat to Cawthorn  and by extension, to others labeled \"insurrectionists\" by liberal lawyers.",
    "Other Republican House members, such as Marjorie Taylor Greene of Georgia, Mo Brooks of Alabama, Paul Gosar of Arizona, and Lauren Boebert of Colorado face similar accusations, but their state's election laws present higher hurdles for challenges to their candidate qualifications.",
    "The novel challenge to the reelection bid of Rep. Madison Cawthorn, one of the House's brashest supporters of Trump and the lie that the 2020 election was stolen, could set a precedent to challenge other Republicans who swore to uphold the Constitution, then encouraged the attack.",
    "Michael J. Gerhardt, a constitutional law professor at the University of North Carolina, said such disputes were weighty ones for a board of elections, and he predicted that Cawthorn would seek to force the courts to decide whether he is or is not an insurrectionist.",
    "This case revolves around the little-known third section of the 14th Amendment, adopted during Reconstruction to punish members of the Confederacy who were streaming back to Washington to reclaim their elective offices  and infuriating unionist Republicans.",
    "The lawyers challenging Cawthorn's eligibility are using an amendment last invoked in 1920, when Rep. Victor L. Berger, an Austrian American socialist, was denied his seat representing Wisconsin after criticizing the U.S.' involvement in World War I.",
    "Cawthorn, 26, who is in his first term in Congress, has denounced the case as an egregious misreading of the 14th Amendment, but he has retained James Bopp Jr., one of the most prominent conservative campaign lawyers in the country, as counsel.",
    "Cases challenging the legitimacy of a candidate before election boards usually hinge on a candidate's age, legal residency, place of birth or citizenship status, or the legitimacy of signatures in a candidacy petition.",
    "If nothing else, the lawyers, including two former justices of the North Carolina Supreme Court, want to depose Cawthorn as part of discovery to question his actions before, during and after the attack on the Capitol.",
    "Congress did just that, he said, with the Amnesty Act of 1872 that declared that \"all political disabilities imposed by the third section\" of the 14th Amendment were \"hereby removed from all persons whomsoever.\"",
    "Section Three of the 14th Amendment concludes with a key phrase that refers to the insurrectionist disqualification, or disability: \"Congress may by a vote of two-thirds of each House, remove such disability.\"",
    "He promoted the \"Save America\" rally behind the White House on Jan. 6, writing on Twitter, \"the future of this Republic hinges on the actions of a solitary few,\" then adding, \"It's time to fight.\"",
    "Whether it makes Cawthorn an \"insurrectionist\" would have to be determined by North Carolina's Board of Elections or, more likely, by the state's courts, where the board might punt the matter.",
    "Ultimately, those involved in the case could use Cawthorn's example to try to keep Trump off the ballot in North Carolina, a key swing state, should he try for a presidential comeback in 2024.",
    "Gerard N. Magliocca, an expert witness for the complainants and a law professor at Indiana University who has written on the constitutional section in question, said Bopp was wrong.",
    "Congress did not discuss what would happen in the future when it debated granting amnesty to confederates in 1872, nor did it have the power to grant prospective pardons, he said.",
    "\"If he's right, then a 9-year-old could show up with enough signatures and qualify for the ballot, because only Congress could disqualify him after the election,\" Fein said.",
    "Weeks after the 2020 election, Cawthorn told a conservative gathering to \"call your congressman\" to protest the results, adding, \"You can lightly threaten them.\"",
    "Once someone establishes a \"reasonable suspicion or belief\" that a candidate is not qualified, the burden shifts to the office seeker to prove otherwise.",
    "Berger, the sole officeholder denied reelection after Reconstruction because of the amendment, tried to make the same argument, but Congress rejected it.",
    "He later called those jailed for storming the Capitol \"political hostages\" and \"political prisoners\" that he would like to \"bust\" out of prison.",
    "North Carolina's election statute offers challengers a remarkably low bar to question a candidate's constitutional qualifications for office.",
    "\"There is, of course, much that we don't know, and the statute allows discovery by deposition and the production of records,\" Wallace said.",
    "With North Carolina's Republican primary scheduled for June, the delays could jeopardize his ability to even get his name on a ballot.",
    "\"If our election systems continue to be rigged and continue to be stolen, then it's going to lead to one place, and it's bloodshed.\"",
    "If one of their colleagues is disqualified for his role in encouraging the rioters, those hurdles might become easier to clear.",
    "Besides, Magliocca said, the section at issue remains in the Constitution; Congress does not have the power to repeal it.",
    "The Second Amendment was written so that we can fight against tyranny,\" he would later say in Franklin, North Carolina.",
    "For Cawthorn, that would be a problem beyond the spectacle of him having to answer whether he is an insurrectionist.",
    "And for the first time, a lawmaker who embraced the rioters may have to answer for his actions in a court of law.",
    "\"Just by bringing the complaint, they might jeopardize a member of Congress running for reelection.",
    "\"The Second Amendment was not written so that we can go hunting or shoot sporting clays.",
    "If Cawthorn is labeled an \"insurrectionist,\" that could have broader ramifications.",
    "At the rally, he riled the crowd from the stage with talk of election \"fraud.\"",
    "\"There's an old saying in law school: 'Does it pass the straight-face test?'",
    "\"It should not be difficult to prove you are not an insurrectionist.",
    "\"It just so happens that Madison Cawthorn is the tip of the spear.\"",
    "\"We are definitely going to file other challenges,\" Fein said.",
    "\"We have no specific names or dates to divulge just yet.\"",
    "\"This is the real threat to our democracy,\" he said.",
    "It only seems to be difficult for Madison Cawthorn.\"",
    "\"And I think they pass the straight-face test.\"",
    "He did not agree that the case was frivolous.",
    "Bopp said all of that was beside the point.",
    "\"They have multiple targets,\" he added.",
    "There is much that is known.",
    "\" he said."
  ]
}