{
  "id": 3099,
  "mediaId": 209,
  "date": "1/11/2022 12:00:00 AM",
  "headline": "Former American Idol star Clay Aiken is running for Congress again",
  "image": "https://mediacloud.theweek.com/image/upload/f_auto,t_primary-image-continuous-scroll-mobile@1/v1641835597/GettyImages-885071396.jpg",
  "link": "https://theweek.com/news/1008819/former-american-idol-star-clay-aiken-is-running-for-congress-again",
  "mediaOutlet": "The Week",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brendan Morrow",
  "authorUrl": "https://theweek.com/authors/brendan-morrow",
  "termIds": [
    814,
    1442,
    2303,
    2452,
    545,
    562,
    2834
  ],
  "sentences": [
    "According to The Washington Post, Aiken is seeking a seat in a congressional district that was redrawn and is more liberal than the one he previously ran in, though he's jumping into what's likely to be a competitive Democratic primary after Rep. David E. Price (D-N.C.) announced he wouldn't seek re-election.",
    "Aiken in his announcement video criticzed \"backwards a--\" policies in North Carolina, including \"the voter suppression bills and the bigoted bathroom bill,\" and said that \"it seems like the loudest voices in North Carolina politics are white nationalists\" and \"hateful homophobes.\"",
    "He closed his announcement video by showing images of Cawthorn and the state's lieutenant governor, Mark Robinson, as he said, \"Just think how excited these guys are gonna be when we elect the South's first gay congressman.\"",
    "Another difference between this new campaign and Aiken's first is that he's now \"emphasizing his bid to become the first openly gay member of Congress from the South,\" NBC News wrote.",
    "He previously ran for a North Carolina congressional seat in 2014 and secured a victory in the Democratic primary, but he was defeated in the general election.",
    "\"As Democrats, we have gotta get better about speaking up and using our voices, because those folks ain't quieting down anytime soon,\" he said.",
    "Aiken, the singer best known for placing second on American Idol in 2003, announced Monday he's running for Congress in North Carolina again.",
    "On his campaign website, Aiken praised Price as a \"legendary legislator\" who leaves \"big shoes to fill.\"",
    "Incumbent Republican Renee Elmers won re-election with 59 percent of the vote, according to NBC News.",
    "He specifically criticized Rep. Madison Cawthorn (R-N.C.), placing him in the former category.",
    "Former American Idol star Clay Aiken's congressional campaign is getting an encore."
  ]
}