{
  "id": 3108,
  "mediaId": 63,
  "date": "1/10/2022 12:00:00 AM",
  "headline": "American Idol' Star Clay Aiken Running For Congress In North Carolina",
  "image": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F61dc592c06c5bc1e4a034eaa%2F0x0.jpg%3FcropX1%3D0%26cropX2%3D2301%26cropY1%3D127%26cropY2%3D1423",
  "link": "https://www.forbes.com/sites/alisondurkee/2022/01/10/american-idol-star-clay-aiken-running-for-congress-in-north-carolina/",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alison Durkee",
  "authorUrl": "https://www.forbes.com/sites/alisondurkee/",
  "termIds": [
    1442,
    2303,
    2452,
    146,
    545,
    2603,
    2649,
    2834,
    2953
  ],
  "sentences": [
    "As Democrats, we have got to get better at speaking up and using our voices,? Aiken said in a video announcing his candidacy, noting that far-right figures like Reps. Madison Cawthorn (R-N.C.) and Marjorie Taylor Greene (R-Ga.) ain't quieting down anytime soon.? If the loudest and most hateful voices think they're gonna speak for us, just tell them I'm warming up the old vocal chords.?\nIf elected, Aiken would be the first openly gay congressman from the South, he said in his campaign video.",
    "The celebrity then went on to launch his first run for Congress in 2014, winning the Democratic primary in North Carolina's 2nd congressional districtagainst a candidate who died days after the primary electionbut then losing the general election to the Republican incumbent with 41% of the vote.",
    "Aiken said in 2017 the then-president was a nice guy? and he always liked him,? but apologized for defending Trump after the Unite the Right rally in Charlottesville, Virginia, later that year, saying that Trump was actually racist? and Aiken was a dumb-ass? for defending him.",
    "Aiken suggested after his 2014 run that he was open to running for office again, telling TIME in 2015, I think it'll happen.?\nIn addition to American Idol, Aiken also finished as the runner-up on Celebrity Apprentice, former President Donald Trump's reality program, in 2012.",
    "Aiken is running in North Carolina's recently redrawn 6th congressional district, which includes Durham and is rated a solidly Democratic? seat by FiveThirtyEight, after incumbent Rep. David E. Price (D-N.C.) announced he would not run for reelection.",
    "Topline\nFormer American Idol runner-up Clay Aiken launched a run for Congress in North Carolina Monday, marking the second time the singer has run for Congress after previously losing a general election in the state in 2014.",
    "The website said Aiken is in favor of progressive policies? on issues like climate change, systemic racism, income inequality, gun violence, voting rights, abortion and healthcare.",
    "Key Facts\nAiken is a strong Democrat? who wants to give a voice to those who want to bring sanity and civility back to the political conversation,? his campaign website notes.",
    "Aiken will join a crowded Democratic primary that includes at least ten other candidates, local outlet CBS 17 reports, including multiple state senators.",
    "Aiken, 43, became a music star in 2003 when he came in second place to Ruben Stoddard in the second season of American Idol.",
    "His run was filmed for a documentary television series about his candidacy."
  ]
}