{
  "id": 3110,
  "mediaId": 237,
  "date": "1/10/2022 12:00:00 AM",
  "headline": "Former American Idol contestant Clay Aiken launches second bid for Congress",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/937307.png",
  "link": "https://www.washingtonexaminer.com/news/former-american-idol-contestant-clay-aiken-launches-second-bid-for-congress",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kate Scanlon",
  "authorUrl": "https://www.washingtonexaminer.com/author/kate-scanlon",
  "termIds": [
    2452,
    2452,
    760,
    760,
    1442,
    1442,
    2303,
    2303,
    2232,
    2232,
    254,
    254,
    428,
    428,
    2834,
    2834,
    2876,
    2876
  ],
  "sentences": [
    "This time, he will seek to represent the state's new 6th Congressional District, a district more friendly to Democrats but still subject to changes from court challenges to the Tar Heel State's maps.",
    "In a video announcing his candidacy, Aiken said he intends to use his voice for more than singing, hitting what he called backwards-ass policies? pushed by Republicans in the state.",
    "Aiken also took aim at controversial Republican lawmakers by name, including North Carolina Rep. Madison Cawthorn, whom he called a white nationalist.",
    "As a loud and proud Democrat, I intend to use my voice to deliver real results for North Carolina families,? Aiken said on his campaign website.",
    "Aiken, a Raleigh, North Carolina, native, previously ran for a U.S. House seat in 2014 but was defeated in the general election that year.",
    "The district's current incumbent, Rep. David Price, is among the growing ranks of House Democrats who will retire at the end of his term.",
    "Former American Idol contestant Clay Aiken announced Monday that he will seek a congressional seat in North Carolina for the second time.",
    "\"As Democrats, we have got to get better about speaking up and using our voices because those folks ain't quieting down any time soon.\"",
    "Aiken is one of several Democrats looking to replace Price in a crowded primary that also includes state Sens.",
    "These folks are taking up all the oxygen in the room, and I've got to tell you, I am sick of it,? Aiken said.",
    "He competed on the television show American Idol in 2003, where he came in second place to Ruben Studdard.",
    "Aiken called his campaign historic and said he would be the first gay congressman from the South.",
    "He was also a contestant on The Celebrity Apprentice, hosted by Donald Trump.",
    "The singer will be the most well-known contender in the Democratic primary.",
    "Valerie Foushee and Wiley Nickel and Durham County Commissioner Nida Allam.",
    "But that wasn't the extent of Aiken's reality television career."
  ]
}