{
  "id": 3114,
  "mediaId": 112,
  "date": "1/9/2022 12:00:00 AM",
  "headline": "Toeing of party line outweighs deliverables for constituents for many of today's congressional Republicans",
  "image": "https://images.mktw.net/im-464585?width=700&size=1.5005861664712778&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/toeing-of-party-line-outweighs-deliverables-for-constituents-for-many-of-todays-congressional-republicans-01641773487",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.marketwatch.com/column/associated-press",
  "termIds": [
    659,
    1077,
    1609,
    2087,
    2303,
    2389,
    428,
    545,
    562,
    571,
    2590,
    2620,
    2672,
    2715,
    2894,
    2934,
    2945
  ],
  "sentences": [
    "Trump called for party primary challenges for the 13 GOP House members who backed the infrastructure bill, just as he's sought to end the careers of Republicans who voted to convict him in his impeachment trials or joined the bipartisan select committee investigating the attack on the Capitol last Jan. 6 by Trump supporters seeking to disrupt congressional certification of Joe Biden's victory over Trump in the November 2020 presidential election.",
    "Associated Press\nThe old all-politics-are-local axiom has been significantly eclipsed by one that says all politics are national,' observes a veteran congressional staffer who now teaches legislative strategy at American University\nDAVENPORT, Iowa (AP)  Davenport's 81-year-old Centennial Bridge across the Mississippi River creaks under the weight of tens of thousands of cars and trucks every day.",
    "As they continue to press, alongside a prioritized suite of voting-rights measures in the early days of 2022, for passage of a nearly $2 trillion social-safety-net package, following the bipartisan $1 trillion infrastructure bill, they're hoping voters punish lawmakers like Miller-Meeks for opposing major new investments in health care, climate change mitigation and child care.",
    "Related (May 2021): Kevin McCarthy, Elise Stefanik and even Madison Cawthorn are among Republican members of the House boasting of the Biden pandemic relief package's benefits to constituents\nBut even vulnerable lawmakers like Miller-Meeks  who was elected in 2020 with a winning margin of just six votes  don't appear worried about paying a price.",
    "While the larger social spending package troubles? him a bit, Infrastructure funding is unique because that's one piece I don't mind having money spent on because it directly creates jobs.?\nTennant said he would have to have a conversation with the congresswoman to understand her position better.?",
    "Miller-Meeks and others are offering the procedural explanation, when really they are following the national trend of party loyalty, demonstrating the shift from the time-honored politics of bringing home the bacon, GOP observers said.",
    "The old all-politics-are-local axiom has been significantly eclipsed by one that says all politics are national,? said Tom Kahn, a 33-year Capitol Hill staff veteran who teaches congressional strategy at American University.",
    "Washington Watch (November 2021): 40% of America's trucking capacity is left on the table every day, MIT expert tells Congress\nThis city's aging landmark is among more than 1,000 structurally deficient bridges in the area.",
    "The Republican, who describes himself as very conservative,? says he voted for Trump twice, knows Miller-Meeks well and that she's done a good job.? But he doesn't understand why she voted against the infrastructure bill.",
    "And the Quad Cities is certainly one of those places that has long-term needs.?\nPlanners are eyeing a new Mississippi River bridge at Interstate 80, a 3,000-mile femoral artery linking metro New York with San Francisco.",
    "Behind Centennial as the most traveled structurally deficient bridge is the 50-year-old Mississippi crossing on Interstate 280, a Davenport bypass that links to Interstate 80, one of the nation's busiest freight routes.",
    "Valadao voted against the bill, which passed the House before it stalled in the Senate when conservative Democrat Joe Manchin stunned many in his caucus by announcing last month that he would not support the bill as is.",
    "In her written statement issued publicly after the vote, she said she would have supported an infrastructure bill that was not tied to the larger spending package, as Democrats for months worked to move them in tandem.",
    "So, it struck some Iowans as strange when the district's Rep. Mariannette Miller-Meeks voted against a bill that would pour more than $100 million in federal money to repair and replace bridges into southwest Iowa.",
    "In California's Central Valley, Rep. David Valadao could have told families of 194,000 children he supported expanding a middle-to-lower-income child tax credit in the Biden administration's sweeping spending bill.",
    "The bridges lace Davenport and Bettendorf, Iowa, and Rock Island and Moline, Illinois, a national crossroads of river, rail and highway commerce struggling to maintain its status as a farm machinery hub.",
    "Defectors who joined Democrats in voting for the infrastructure bill were blasted as traitors? and socialists? by some House GOP colleagues, such as right-wing Georgia Rep. Marjorie Taylor Greene.",
    "In June, the Interstate 280 bridge and the 55-year-old Interstate 80 bridge up river near Davenport were partially closed for repair, pushing westbound traffic back into Illinois for miles.",
    "She was among 38 House members from Mississippi River states who wrote to the U.S. Army Corps of Engineers on Dec. 9 asking it to prioritize $2.5 billion for modernizing locks and dams.",
    "The American Road and Transportation Builders Association diagnosed 1,064 of the bridges  20%  in Iowa's agricultural and industrial 2nd district as structurally deficient.",
    "There's probably still room for people who are making their cases on local issues,? said John Ashbrook, a former aide to Sen. Mitch McConnell, the Senate Republican leader.",
    "Valadao's agricultural-heavy district has more children whose parents fit the requirements for the monthly $300 per child than that of any Republican targeted by Democrats.",
    "Having a long-term predictable federal infusion of funding is helpful so that we can get out of this day-to-day maintenance and think about long-term needs,? Rumler said.",
    "Miller-Meeks objected to majority Democrats' handling of the bill, never mentioning its contents, a common refrain from the minority that overwhelmingly opposed it.",
    "In New Mexico, Rep. Yvette Herrell, a GOP freshman, voted against the infrastructure bill and its $100 million per state for improving broadband internet access.",
    "Strategists and onetime party leaders note it's become so common for lawmakers to prioritize their party's line over district needs that it's hardly mentioned.",
    "It used to be I brought back a number of things for my district.' ? Now Republican lawmakers are likelier to boast of having held firm against the opposition.",
    "Two of them, including Davenport's Centennial, cross the Mississippi in the Quad Cities, a mid-sized, industrial metro area of about 475,000 people.",
    "This month, after six years under construction, a new bridge opened connecting the town of Bettendorf, Iowa, and Moline, Illinois, on Interstate 74.",
    "Your fate is in the hands of the national mood.?\nMiller-Meeks had previously asked for money to improve Mississippi River infrastructure.",
    "I've seen that by others,? said former New York Rep. Tom Reynolds, a former chairman of the National Republican Congressional Committee.",
    "The tally gives Iowa's 2nd congressional district the dubious distinction of having the second most troubled bridges in the country.",
    "If anyone in Iowa was surprised that the Republican would oppose money for a glaring local priority, few in Washington were.",
    "Paul Rumler, president of the Quad Cities Chamber of Commerce, lobbied Miller-Meeks to support the infrastructure bill.",
    "See: It's not just those 13 House Republicans facing backlash for breaking party ranks with infrastructure votes.",
    "Aaron Tennant owns trucking and shipping companies on both the Iowa and Illinois sides of the Mississippi.",
    "Michigan Republican Rep. Fred Upton received a voicemail wishing death to him, his family and staff.",
    "That's due in part to former President Donald Trump's still-heavy sway over the Republican Party.",
    "Rust shows through its chipped silver paint, exposing the steel that needs replacing.",
    "But there is so much national pressure shaping your image if you're a House member.",
    "It frustrated commuters and added extra stress to older bridges such as Centennial.",
    "Commerce slows dramatically during the annual repairs on multiple bridges, he said.",
    "A quarter of the homes in Herrell's rural district lacked internet as of 2019.",
    "Miller-Meeks's office did not respond to requests to discuss her vote.",
    "That is, provisionally safe but with chronic repair needs.",
    "Democrats are banking on voter backlash to this trend.",
    "These New York Democrats are also getting an earful.",
    "But last summer's delays cost Tennant productivity.",
    "That's a company line, as I would call it.",
    "Things have changed."
  ]
}