{
  "id": 3121,
  "mediaId": 43,
  "date": "1/2/2022 12:00:00 AM",
  "headline": "Wrap  Political Economy  January 2, 2022",
  "image": "",
  "link": "https://www.dailykos.com/story/2022/1/2/2071370/-Week-end-Wrap-Political-Economy-January-2-2022",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tony Wikrent",
  "authorUrl": "",
  "termIds": [
    2475,
    2475,
    1026,
    1026,
    1147,
    1147,
    2087,
    2087,
    2095,
    2095,
    1595,
    1595,
    1248,
    1310,
    1310,
    1248,
    637,
    637,
    428,
    428,
    523,
    523,
    2537,
    2537,
    2538,
    2538,
    2672,
    2672,
    2945,
    2944,
    2944,
    2945,
    2914,
    2914,
    2863,
    2863,
    2976,
    2976
  ],
  "sentences": [
    "The Selective Sovietization of American Capitalism\nAmar Bhide [Project Syndicate, via Naked Capitalism 1-1-2022]\nAs Prices Rise, Biden Turns to Antitrust Enforcers\n[New York Times, via Naked Capitalism 12-26-2021]\nHow Public Workers Can Stop The Privatization of Everything\n[Counterpunch, via Naked Capitalism 12-27-2021]\nGreen New Deal - An opportunity too big to miss\nElectrify Everything in Your Home Guide\n[Rewiring America, via The Big Picture 12-28-2021]\nThe best advice on how to electrify everything is a guide to replacing all of your fossil-fueled appliances with modern electric ones.",
    "In a comprehensive report, Alliance for Justice has highlighted the many firsts among this crop of judges: the first openly lesbian judge on the Court of Appeals (Beth Robinson); the first Korean American to sit on the Court of Appeals (Lucy Koh); the first Muslim federal judge (Zahid Quraishi); the first Black judge on the U.S. Court of Appeals for the Federal Circuit (Tiffany Cunningham); the first woman of color to serve on the U.S. District Court in Maryland (Lydia Griggsby); the first Native American federal judge in Washington state (Lauren J.",
    "And what's happening is that a group of deep-pocketed Hispanic right-wingers, mostly Cuban exiles, have been renting radio stations around the country, the best estimate is there might be 200 or 300 of them now, where they're running some syndicated and some local Spanish language, right-wing talk radio, and in some cases, they're playing music, but they're hiring DJs who are delivering right-wing political messages, you know, snarky comments and things between songs.",
    "That this is happening at the same time that multiple electoral bills enabling a Republican state legislature majority to overturn their state's election have been enacted suggests that the true aim of bills criminalizing protest is to have a response in place to expected protests against the stealing of a future election (as a reminder of fascism's historical connection to big business, some of these laws criminalize protest near gas and oil lines).",
    "Back around what must have been 2006 or thereabouts, Randi Rhodes and me and a bunch of other people from Air America went to DC to talk with a bunch of Senators, Democratic Senators, about talk radio, and we tried to convince them that that, you know, they're raising billions of dollars every four years for elections, and with a fraction of that money, they could buy 400 or 500 radio stations or even 50 radio stations around the country.",
    "The Critique of Apocalyptic Profit-Seeking in \"Don't Look Up\" Hits Close to Home\nTony Norman, January 2, 2022 [Pittsburgh Post-Gazette, via Common Dreams]\nThe movie is a parable about an existential threat to the planet and the inability of political leaders to deal with the looming crisis except through a prism of self-interestboth personal and corporatethat ultimately endangers all of humanity..",
    "Climate and environmental crises\nThe Real Culprits\nDave Schuler [Glittering Eye, via Mike Norman Economics 12-28-2021]\nHow surprising is it, really, that those tasked with formulating policy miraculously come up with [climate] policies that barely touch themselves at all while falling most heavily on those who have practically no ability to effect the change notionally intended?",
    "Hartmann: On another occasion, there's a another very large radio network with over 900 stations, and I met with the one of the two billionaires who owned that network in the offices of a United States Senator, and said Why don't you put?and he had hundreds of right wing stationsand I said Why don't you put some left-wingers on?? I would offer myself, but just generically.",
    "And I put together a one-day seminar for sales staff in radio stations and took it on the road and traveled all around the country visiting all these radio stations that we run, saying here's how you sell progressive talk radio.? First of all, you have to have one person on your sales staff who is completely devoted to it, and who understands the politics of it.",
    "Republicans have stoked opposition to the Democrats by feeding the culture wars, skipping negotiations on the American Rescue Plan, for example, to complain that the toymaker Hasbro was introducing a gender-neutral Potato Head toy, and that the estate of Dr. Seuss was ceasing publication of some of his lesser-known books that bore racist pictures or themes.",
    "According to the article, the bedrock idea uniting right-wing communities who condone violence is that white Christian men in the United States are under cultural and demographic threat and require defending  and that it is the Republican Party and Donald Trump, in particular, who will safeguard their way of life.?\nWe are now in fascism's legal phase.",
    "Strategic Political Economy\nThe collapse of the USSR thirty years ago helped to undermine the Cold War democracy that opposed it?\nHeather Cox Richardson, December 26, 2021 [Letters from an American]\n...the collapse of the USSR gave the branch of the Republican Party that wanted to destroy the New Deal confidence that their ideology was right.",
    "And this time, the other team doesn't have nuclear weapons.?\nIn the 1990s, they turned their firepower on those they considered insufficiently committed to free enterprise, including traditional Republicans who agreed with Democrats that the government should regulate the economy, provide a basic social safety net, and promote infrastructure.",
    "Just look at the number of bank CEOs who faced criminal charges after the 2008 financial collapse (zero), or the number of Sackler family members who were criminally charged after their company, Purdue Pharma, started the opioid epidemic with OxyContin (also zero), or the number of billionaires who avoid paying income taxes (lots of them).",
    "The U.S. Military Is a Machine of Impunity\nPeter Maass, December 26 2021 [Intercept, via Naked Capitalism 12-28-2021]\nWe tend to associate barbarism with the kind of things I saw in Bosnia: close-quarters violence in which the perpetrators look into the eyes of their victims and leave the fatal encounter with drops of blood on their boots.",
    "Many labs just disintegrated during the lockdown and have not been able to reconstitute themselves because it has been wave after wave of disruption ever since, collaboration networks have been disrupted, there is little of the vibrant exchange of ideas that happened in the hallways back in the days because people are scattered, etc.",
    "Biden's Agenda Is on Its Death Bed Because the Interests of the Rich and Poor Are Irreconcilable\nBranko Marcetic [Jacobin, via Mike Norman Economics 12-29-2021]\nJoe Biden's rationale for his own presidency was that he could bring oligarchs and working people together and hammer out a compromise that worked for both.",
    "And outside of Bernie Sanders, who totally understood what I was talking about, because for 11 years he had been on my show every Friday for an hour taking calls from listenersoutside of Bernie, we just got blown off, including by somebody who later became a candidate for president of the United States and lost.",
    "An electorate that knows about persisting racial injustice in the United States along all its dimensions, from the racial wealth gap to the effects of over-policing and over-incarceration, will be unsurprised by mass political rebellion in the face of persistent refusal to face up to these problems.",
    "He is the author of How Fascism Works\nThe contemporary American fascist movement is led by oligarchical interests for whom the public good is an impediment, such as those in the hydrocarbon business, as well as a social, political, and religious movement with roots in the Confederacy.",
    "Academic research is falling apart in slow motion over the last two years?\nYves Smith [Naked Capitalism 12-28-2021]\nAn NC regular wrote Yves:\nI have watched how academic research is falling apart in slow motion over the last two years with increasing desperation and silent horror.",
    "Attacks on the courts, education, the right to vote and women's rights are further steps on the path to toppling democracy\nJason Stanley, December 22, 2021 [The Guardian, via The Big Picture 12-26-2021]\nJason Stanley is Jacob Urowsky professor of philosophy at Yale University.",
    "As the media covered the riot, the canvassing board voted to shut down the recount because of the public perception that the recount was not transparent, and because the interference meant the recount could not be completed before the deadline the court had established.",
    "As Representative Tom Malinowski (D-NJ) noted last year, [I]t's illegal for foreigners to contribute to our campaigns, but if you launder your money through a front company with anonymous ownership there is very little we can do to stop you.?\n.",
    "And it's much more politically effective to have somebody 24/7 singing your praises on the radio in a way that has high credibility because people feel like they've built a relationship with you, than it is to buy ads every advertising cycle.",
    "It began decades before Trump\nHeather Cox Richardson, December 29, 2021 [Letters from an American]\nSince the 1990s, Republicans have used violence and the news coverage it gets to gain through pressure what they could not gain through votes.",
    "pic.twitter.com/DAzOn7RgSe\n ChicagoTeachersUnion (@CTULocal1) December 28, 2021\nCorporate Profits Drive 60% of Inflation Increases\nMatt Stoller [BIG, via Naked Capitalism 12-30-2021]\n[Twitter, via Naked Capitalism 1-1-2022]\nExcellent thread!",
    "we were doing just fine in Portland, for example, because the local management in Portland hired a separate guy to sell KPOJ who built his own networks and played golf with the local liberals and got in tight with the Democratic Party.",
    "The Biden Transition and the Fight for Real Hope and Change\nThe 10 races that will decide the Senate majority\n[The Hill, via Naked Capitalism 12-27-2021]\nFederal judiciary: The remarkable speed with which Joe Biden is seating judges.",
    "a Chinese wife is a typical cases, but expect that to change over time as the realization slowly sets in about what the future holds and especially if the Chinese make some efforts to make the process of cultural adjustment smoother.",
    "I laughed out loud enough times to recommend it, even though it isn't nearly as subversive as \"Dr. Strangelove\" or as razor-sharp a critique of the unholy symbiosis of politics and media in this era as \"Network\" was about the 1970s.",
    "This lie has justified the passage in 19 Republican-dominated states of 33 new laws to suppress voting or to take the counting of votes out of the hands of non-partisan officials altogether and turn that process over to Republicans.",
    "In July, Biden required federal workers and contractors to be vaccinated; in November, the administration said that workers at businesses with more than 100 employees and health care workers must be vaccinated or frequently tested.",
    "The place essentially stopped being what it once was prior to March 2020  it is now a collection of fancy shiny buildings and (some of) the people are still there, but that intangible factor that made it great is no longer present.",
    "A police militarized to address the wounds of racial inequities by violence, and a recent history of unsuccessful imperial wars have made us susceptible to a narrative of national humiliation by enemies both internal and external.",
    "As WEB Du Bois showed in his 1935 masterwork Black Reconstruction, there is a long history of business elites backing racism and fascism out of self-interest, to divide the working class and thereby destroy the labor movement.",
    "We are now well into the repercussions of this latter process  where fascist lies, for example, the big lie? that the 2020 election was stolen, have begun to restructure institutions, notably electoral infrastructure and law.",
    "Even after the January 6 attack on the Capitol, 147 Republican members of Congress voted to challenge at least one of the certified state electoral votes, propping up the Big Lie that Trump won the 2020 presidential election.",
    "Most notably, though, as Biden's coronavirus vaccination program appeared to be meeting his ambitious goals, Republicans suggested that government vaccine outreach was overreach, pushing the government into people's lives.",
    "The financial deregulation that made the US a good bet for oligarchs to launder money got a boost when, after the September 11 attacks on the US, Congress in 2001 passed the PATRIOT Act to address the threat of terrorism.",
    "That demonization is escalating now as Republican radicals who were born after the collapse of the USSR and who therefore see their primary enemies as Democrats, are moving the Republican Party even further to the right.",
    "John Ehrlichman, one of Nixon's top advisers, said that Nixon's campaign and administration had two enemies: the anti-war left and Black people?, and invented the drug war to target both:\nYou understand what I'm saying?",
    "If an intelligence analyst or drone operator or fighter pilot follows orders and procedures for an airstrike that kills dozens of civilians in a wedding party  which has happened  they need to be excused of wrongdoing.",
    "With the evil empire,? as President Ronald Reagan had dubbed the Soviet Union, no longer a viable enemy, Movement Conservatives, aided by new talk radio hosts, increasingly demonized their domestic political opponents.",
    "In the 1990s, as well-connected businessmen began to gather wealth and power in the former Soviet republics, that deregulation made the US and the UK attractive places for these oligarchs to place their illicit money.",
    "The dark side\nThe disloyal opposition is deadly\nHeather Cox Richardson, December 30, 2021 [Letters from an American]\nBiden and the Democrats have had to face an opposition that is working to undermine the government.",
    "[Roger] Stone engineered a crucial moment for that dynamic when he helped to drive the so-called Brooks Brothers Riot that shut down the recounting of ballots in Miami-Dade County, Florida, during the 2000 election.",
    "According to the nonprofit organization Airwars, the U.S. has conducted more than 91,000 airstrikes in seven major conflict zones since 2001, with at least 22,000 civilians killed and potentially as many as 48,000.",
    "And let's not forget the politicians and pundits who goaded America into an illegal invasion of Iraq in 2003 and suffered no consequences....\nMilitary impunity is somewhat unique because it stretches downward, too.",
    "Believing that their ideology of radical individualism had destroyed the USSR, these so-called Movement Conservatives very deliberately set out to destroy what they saw as Soviet-like socialist ideology at home.",
    "This means that Republicans are three times more likely than Democrats to die of Covid, and as the new Omicron variant rages across the country, Republicans are blaming Biden for not stopping the pandemic.",
    "As anti-tax crusader Grover Norquist wrote in the Wall Street Journal: For 40 years conservatives fought a two-front battle against statism, against the Soviet empire abroad and the American left at home.",
    "According to the International Center for Not for Profit Law, 45 states have considered 230 bills criminalizing protest, with the threat of violent leftist and Black rebellion being used to justify them.",
    "Still, \"Don't Look Up,\" written by Mr. McKay and David Sirota, is close enough to both to merit a large audience, beyond what you might expect given the plurality of critics dinging it for didacticism.",
    "x\nA short thread on the magnitude of public maladministration in Australia in the past 50 years, driven by libertarian populists in more recent times and more general neoliberal ideas prior to that.",
    "And they are actually attracting talent, exactly the opposite of what is claimed  a lot of world class Chinese researchers who worked in US universities just went back home and they will stay there.",
    "Defending a fictional glorious and virtuous national past, and presenting its enemies as deviously maligning the nation to its children, is a classic fascist strategy to stoke fury and resentment.",
    "They created a firestorm over Critical Race Theory, an advanced legal theory, insisting that it, and the teaching of issues of race in the schools, was teaching white children to hate themselves.",
    "Of course it matters what kind of talent? you care about  do you want to attract actually productive scientists and engineers, or does your definition of talent? center on financial parasites?",
    "That demonization has also helped to justify the deregulation of our economy and then the illicit money from the rising oligarchs it attracted, money that has corrupted our democratic system.",
    "As the recount showed the count swinging to Gore, Republican operatives stormed the station where the recount was taking place, insisting that the Democrats were trying to steal the election.",
    "And to the best of my knowledge, none of those stations ever took me up on that outside of the one here in Portland.\nHartmann:\nThey're preaching a message of tax cuts and deregulation.",
    "That's an inadequate understanding because it excludes the killing-from-a-distance that is now central to America's forever wars, which have increasingly moved away from ground combat.",
    "The study concerns the UK alone, but since the UK and US are by far the world's top exporters of financial services, many of the report's findings are suggestive for the US as well.",
    "He has nominated 21 public defenders, 14 civil rights attorneys, 10 plaintiff-side lawyers, three former legal aid lawyers, three consumer protection lawyers, and one labor lawyer.",
    "[Current Affairs, October 6, 2021]\nAmerica's leading progressive talk show host, Thom Hartmann, discusses how leftists can effectively counter the conservative talk radio behemoth.",
    "Fascist propaganda takes place in the US in already fertile ground  decades of racial strife has led to the United States having by far the highest incarceration rate in the world.",
    "Movement Conservatives called these traditional Republicans Republicans in Name Only? or RINOs and said that, along with Democrats, such RINOs were bringing socialism? to America.",
    "[Twitter, via Naked Capitalism 12-29-2021]\nx\nThese are two FedEx Drop Boxes on the Southwest Side, sites where CPS families are expected to leave completed COVID testing kits.",
    "The idea we were putting out there was that this was a left-wing power grab by Gore, the same way Fidel Castro did it in Cuba,? Stone later told legal analyst Jeffrey Toobin.",
    "Using the bogeyman of critical race theory, 29 states have introduced bills to restrict teaching about racism and sexism in schools, and 13 states have enacted such bans.",
    "Often, those who employ fascist tactics do so cynically  they do not really believe the enemies they target are so malign, or so powerful, as their rhetoric suggests.",
    "And he simply said straight up, he said, I'm never gonna put somebody on the air who's gonna argue for raising my taxes.? This is a guy who owned 900 radio stations.",
    "And I'm preaching a message of raise taxes on rich people.? And I don't know how many rich people are therefore going to go out and buy a radio station to put me on.",
    "We knew we couldn't make it illegal to be either against the war or black, but by getting the public to associate the hippies with marijuana and blacks with heroin.",
    "The chair of the county's Democratic Party noted, Violence, fear and physical intimidation affected the outcome of a lawful elections process.? Blakeman's response?",
    "At long last, courageous attorneys who stick their necks out to promote progressive values are being rewarded rather than punished by the Democratic establishment.",
    "For too long, Democratic and Republican presidents (including Obama) have elevated a disproportionate number of prosecutors and corporate lawyers to the bench.",
    "Several of his nominees previously fought for voting rights (Myrna Prez and Dale Ho), marriage equality (Beth Robinson), and death row inmates (Holly Thomas).",
    "The law took on money laundering and the illicit funding of terrorism, requiring financial institutions to inspect large sums of money passing through them.",
    "I saw an article like two weeks ago saying Democrats can't figure out why the Hispanic vote has moved 7% towards the Republican Party in the last two years.",
    "And then they need to insert themselves into the local Democratic Party, and they need to get involved with local businesses that have progressive values.",
    "As in all fascist movements, these forces have found a popular leader unconstrained by the rules of democracy, this time in the figure of Donald Trump.",
    "No American general has been disciplined for overseeing the catastrophic wars in Afghanistan and Iraq, nor for lying to Congress about these disasters.",
    "As they strengthened their hold on the Republican Party, Movement Conservatives cut taxes, slashed the social safety net, and deregulated the economy.",
    "Vaccination rates began to drop off, and Biden's July 4 goal went unmet just as the more contagious Delta variant began to rage across the country.",
    "The novel development is that a ruthless would-be autocrat has marshalled these fascist forces and shaped them into a cult, with him as its leader.",
    "We can do it from a technology point of view, but I think policymakers, political leaders and society as a whole have failed over and over again.",
    "Once you electrify: your home will be more comfortable, your indoor and outdoor air quality will be healthier, your monthly bills will be lower.",
    "Meanwhile I see all the time papers from China that do things we had planned to do at some point but could not because of the whole disruption.",
    "[Slate, via Naked Capitalism 12-28-2021]\nThere are two defining features of Biden's push to remake the federal judiciary: speed and diversity.",
    "An electorate ignorant of these facts will react not with understanding, but with uncomprehending fear and horror at Black political unrest.",
    "We had to fight in the courts, in the recount centers and in the streetsin public opinion,? Bush campaign operative Brad Blakeman said.",
    "According to Alliance for Justice, nearly 75 percent of Biden's judicial nominees are women, and nearly 65 percent are people of color.",
    "Now turn to the other extraordinary aspect of Biden's judicial nominees: their unprecedented demographic and professional diversity.",
    "I can imagine that R&D in the tech companies has been hit hard too from all the WFH but that too is not being widely understood yet.",
    "In the past thirty years, we have torn ourselves apart as politicians adhering to an extreme ideology demonized their opponents.",
    "We could arrest their leaders, raid their homes, break up their meetings, and vilify them night after night on the evening news.",
    "How do you promote the general welfare and safeguard public health if private enterprise is allowed to run / ruin everything?",
    "According to a fascinating new study from Chatham House about the UK, that investment ultimately weakened the rule of law.",
    "The pandemic\n[Twitter, via Naked Capitalism 1-1-2022]\nx\nI lost faith in our ability to stop pandemics and pandemic waves.",
    "We scared the crap out of them when we descended on them,? Blakeman later told Michael E. Miller of the Washington Post.",
    "That recount would decide whether Florida's electoral votes would go to Democrat Al Gore or Republican George W. Bush.",
    "Rachel Kleinfeld, in an October 2021 article, documents the rise of the legitimation of political violence in the US.",
    "You only understand that once you have been at that board past midnight and have seen the fruits of such exchanges.",
    "In some ways, the collapse of the USSR thirty years ago helped to undermine the Cold War democracy that opposed it.",
    "There is no substitute for two or more very smart people brainstorming in front of the whiteboard around midnight.",
    "For comparison, only 24 percent of Trump's judicial nominees were women, and just 16 percent were people of color.",
    "Their commitment to these controversial causes was not a deal-breaker for the White House; it was a selling point.",
    "We won.?\nAmerica is now in fascism's legal phase: The history of racism in the US is fertile ground for fascism.",
    "But the Financial Crimes Enforcement Network (FinCEN) exempted many real estate deals from the new regulations.",
    "Many of them continue to plug that lie, convincing 68% of Republicans that Biden is an illegitimate president.",
    "And so, of course, the very, very wealthy and very powerful are going to be pouring money down their throats.",
    "Eleven of Biden's judges sit on the powerful U.S. Court of Appeals, where most federal cases are resolved.",
    "For President Barack Obama, that number was 13; for Presidents George W. Bush and Bill Clinton, it was 28.",
    "Because boxes are overflowing, families are scrambling to find safe and secure places to leave their kits.",
    "By early December, fewer than 10% of adult Democrats were unvaccinated, compared with 40% of Republicans.",
    "Biden, by contrast, has seen 40 of his judges confirmed alreadythe most since President Ronald Reagan.",
    "Donald Trump and the party that is now in thrall to him have long been exploiting fascist propaganda.",
    "In the years since, the United States has become one of the money-laundering capitals of the world.",
    "Many people still don't notice it, but if you are actually paying attention it is inescapable.",
    "Week-end Wrap  Political Economy  January 2, 2022\n by Tony Wikrent\n[Youtube,\nHappy new year!",
    "(For comparison, Obama placed just three judges on the Court of Appeals in his first year.)",
    "Already, he has doubled the number of former public defenders on the U.S. Court of Appeals.",
    "In his first year, just 19 of Trump's judicial nominees had received Senate confirmation.",
    "The carnage of mainstream neoliberal economics\nTW: A service economy without the service.",
    "The apparent death of his legislative agenda proves what a laughable fantasy that was....",
    "Recently, I watched Adam McKay's apocalyptic cautionary tale \"Don't Look Up\" on Netflix.",
    "The fascist movement in the Republican party has turned to critical race theory instead.",
    "Under pressure from court reform groups like Demand Justice, Biden bucked this custom.",
    "Experts say that hundreds of billions of dollars are laundered in the US every year.",
    "Fascism feeds off a narrative of supposed national humiliation by internal enemies.",
    "But that was not the case to the best of my knowledge on any of the other stations.",
    "\"We were very explicitly drawing that analogy.? It had to be a three-legged stool.",
    "And I think they lost because right-wing talk radio just destroyed that candidacy.",
    "Rejecting the vaccine became a badge of opposition to the Biden administration.",
    "North Carolina representative Madison Cawthorn, for example, was born in 1995.",
    "/1 #COVID19Aus #auspoll\n gg Dr Henry Madison (@RageSheen) December 31, 2021\n.",
    "Nevertheless, there comes a tipping point, where rhetoric becomes policy.",
    "And I'm yelling at the web page going, It's the freakin' radio, you know?",
    "And then criminalizing both heavily, we could disrupt those communities.",
    "For now it is cases of people who have some connection, e.g.",
    "Now the Soviet Union is gone and conservatives can redeploy.",
    "The Nazis used Judeo-Bolshevism as their constructed enemy.",
    "I am starting to see even non-Chinese people going there.",
    "We are a society that excels in elite unaccountability.",
    " Florian Krammer (@florian_krammer) December 31, 2021\n.",
    "And talk about undemocratic!\nIt's the super-consumers.",
    "And how Covid throws this disaster into stark relief.",
    "And they are not about to change their lifestyle.",
    "Covid has now killed more than 800,000 Americans.",
    "They are now inscribing it into fascist policy.",
    "The key to democracy is an informed electorate.",
    "We got some blowback afterwards, but so what?",
    "Did we know we were lying about the drugs?",
    "Especially in 'developed' countries.",
    "Impunity tends to begin at the top.",
    "The deadline for return is today.",
    "Loss for the US, gain for China.",
    "Why Is Talk Radio So Right-Wing?",
    "(And How Can The Left Compete?)",
    "Really, really depressing.",
    "Let's start with speed.",
    "King)the list goes on.",
    "Of course we did.",
    "x\nx\nx\n."
  ]
}