{
  "id": 3252,
  "mediaId": 169,
  "date": "5/11/2022 12:00:00 AM",
  "headline": "A new wave of politicians are shedding the misconception that cooking and politics don't mix",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/05/american-flag-cake-berries-0504221.jpg",
  "link": "https://www.salon.com/2022/05/11/a-new-wave-of-politicians-are-shedding-the-misconception-that-cooking-and-dont-mix/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashlie D. Stevens",
  "authorUrl": "https://www.salon.com/writer/ashlie_d_stevens",
  "termIds": [
    3030,
    3002,
    2429,
    2303,
    2272,
    1667,
    2952
  ],
  "sentences": [
    "However, as the Washington Post reported, Harris has actively made cooking a part of her public persona, \"talking in interviews about her favorite cookbooks by California farm-to-table pioneer Alice Waters, schooling her colleague Sen. Mark R. Warner, D-Va., via Instagram video on the finer points of crafting a tuna-melt sandwich (her secrets include a bit of fresh parsley and a dash of lemon juice) and cooking masala dosas in a video she filmed with actress and writer Mindy Kaling.\"",
    "Sometimes the embarrassment is the kind of low-level cringe that some felt when former Democratic presidential candidate Kirsten Gillibrand danced with a glass of whiskey after working a shift at an Iowa gay bar (whiskey is her favorite \"comfort food\") or when Andrew Yang attempted to display some New York City know-how during his run for mayor.",
    "While early women's rights activists attempted to demonstrate that domesticity and politics could coexist by releasing suffrage-themed cookbooks, more contemporary female politicians have carefully distanced themselves from traditionally \"feminine\" homemaking activities, including cooking and baking.",
    "While early women's rights activists attempted to demonstrate that domesticity and politics could coexist by releasing suffrage-themed cookbooks, more contemporary female politicians have carefully distanced themselves from traditionally \"feminine\" homemaking activities, including cooking and baking.",
    "Though she had to do her fair share of cookie baking and tea-making during her tenure as first lady, when Clinton eventually ran for president herself in 2016, her campaign swag included a pillow cross-stitched with the phrase \"a woman's place is in the White House.\"",
    "Yang waxed poetic about the \"original Madison Square Park location\" of Shake Shack and posted videos of himself in a very sleek Midtown \"bodega,\" which prompted disagreements among observers about what differentiates a bodega from a convenience store or a deli.",
    "In the image, Cawthorn  who has generated headlines for partying in lingerie and visiting a Nazi retreat despite pushing government officials to \"uphold Christian values\"  is seen stationed at an unlit grill, balancing a fully grilled beef patty on a spatula.",
    "As speculation about the next presidential election begins to heat up and the country appears more divided than ever, it seems likely that more candidates for higher office will join Harris and Ocasio-Cortez in using cooking as a form of political outreach.",
    "It's tough to fake, which makes the way that a new generation of female politicians  including Vice President Kamala Harris and Rep. Alexandria Ocasio-Cortez, D-N.Y.  are advertising their expertise in the kitchen particularly interesting.",
    "Maybe 2024 will be the election where we see growing numbers of male politicians step away from the grill and into the kitchen alongside their female counterparts who are shedding the misconception that politics and cooking don't mix.",
    "But as America's relationship with cooking has markedly changed over the last several decades, could spending time in the kitchen increasingly become a strategy used by politicians to cultivate relationships with voters?",
    "As America's relationship with cooking has markedly changed over the last several decades, could spending time in the kitchen increasingly become a strategy used by politicians to cultivate relationships with voters?",
    "\"I tried to make salmon spinach pasta but got carried away about how jacked up our Covid response is and how badly we need stimulus checks and healthcare that all I did was zest a lemon,\" Ocasio-Cortez replied.",
    "The Food Network, which was launched in 1993, helped herald in 24/7 food programming, ranging from traditional stand-and-stir instructional programs to wild reality series like \"Worst Cooks in America.\"",
    "However, I also wonder if politicians are beginning to recognize that their constituents' relationships with cooking have likely changed, as well, presenting an additional opportunity for connection.",
    "As the first woman and woman of color to be vice president, Harris without question demonstrates that the age of having to adhere to a strict separation between domesticity and politics is waning.",
    "Ocasio-Cortez signed off that video before showing the final dish, prompting her colleague Rep. Ilhan Omar, D-Minn., to tweet: \"@AOC you forgot to tell us what you were making tonight sis.\"",
    "Increasingly, it serves as an avenue for authentic political engagement, with organizations like Bakers Against Racism and Protest Cakes continuing to gain national prominence.",
    "Thanks as well to pandemic-era supply chain issues, food functions as a lens through which more and more Americans view topics like workers' rights and minimum wage.",
    "Despite the fact that Cawthorn was supposedly a grillmaster at a Donald Trump rally in April, it doesn't appear as though he actually knows how to grill a burger.",
    "Very rarely does an elected official achieve the level of distinct coolness that Barack Obama did when sitting across the table from Anthony Bourdain in Vietnam.",
    "Other times, the embarrassment could prove more consequential, such as when former President Gerald Ford bit into a still-husked tamale and choked on live TV.",
    "\"I wanna be able to visit my friends without being scared, and I wanna be able to hang out with my friends when it's cold outside and not have to be outside.\"",
    "However, that doesn't deter politicians from trying to capture similar magic while attempting to bond with constituents over food, often with fickle results.",
    "Since then, the prevalence of food media has continued to explode, especially amid the pandemic when many Americans took up cooking as an at-home hobby.",
    "It looked phony, and he received pushback for it, which may be a primary reason that politicians have steered clear of cooking as a campaigning tool.",
    "Instead of simply being a daily obligation or a hobby for a few dedicated culinarians, cooking has become a form of entertainment and competition.",
    "In any given election cycle, it's almost a given that someone will embarrass themselves somewhere on the campaign trail while eating or drinking.",
    "Politicians can step behind the barbecue, cook a quick steak or a few hot dogs, smile for the camera, then hand the tongs off to someone else.",
    "Read more commentary on food and gender:\nFrom country music to \"Kevin Can F**k Himself,\" the politics of pop culture's meat and potatoes man",
    "It's an everyman activity; whether that means suburban dad in the backyard or cowboy in the American West is dependent on the audience.",
    "Unlike eating on the campaign trail, cooking has never seen widespread utilization as a tool for connecting with one's constituents.",
    "For several years, the congresswoman has hosted social media livestreams in which she answers viewers' questions while cooking.",
    "On the burger is a single slice of cold, unmelted cheese one quick movement away from falling and slipping between the grates.",
    "Grilling is the one type of cooking that politicians  male politicians, in particular  have reliably \"performed\" in public.",
    "She's talked about Medicare while making chicken tikka masala; in 2020, she discussed the pandemic while slicing lemons.",
    "At the time, The Guardian reported: \"AOC's cooking live streams perfect the recipe for making politics palatable.\"",
    "Part of this can be attributed to the fact that Americans' perceptions about who can be a politician are shifting.",
    "In fact, there are multiple online collections of images of every president since Johnson shown behind the grill.",
    "In a culture steeped in sexism, it was imperative that they be recognized as politicians first and women second.",
    "In a culture steeped in sexism, it was imperative that they be recognized as politicians first and women second.",
    "Looking back, former President Lyndon B. Johnson is credited with ushering in an age of \"barbecue diplomacy.\"",
    "Unlike certain other types of cooking, grilling also has the benefit of being a pretty expeditious activity.",
    "After sharing a meal with the former president, the celebrity chef tweeted out a photo of the viral moment.",
    "Johnson frequently invited global political leaders to cookouts at both the LBJ Ranch and the White House.",
    "As Politico wrote, these events were meant \"to evoke the American West and make his guests feel welcome.\"",
    "Related: A number of Democrats running for president are kind of weird about food\n\"Why the scare quotes?\"",
    "\"I haven't seen my family in a year, like many of you all,\" she said, while leaning on her cutting board.",
    "It makes sense: Grilling has been traditionally coded as both accessible and particularly masculine.",
    "Mike Huckabee is convinced the latter gaffe cost Ford the state of Texas, and thus his re-election.",
    "Recently, a photograph circulated online of Rep. Madison Cawthorn, R-N.C., \"grilling a burger.\"",
    "The caption simply read, \"Low plastic stool, cheap but delicious noodles, cold Hanoi beer.\"",
    "That said, politicians' relationships with cooking have traditionally been less variable.",
    "For that reason, it's also tougher to mess up than, say, baking and decorating a cake.",
    "It was a small moment, but one that seemed to resonate with those who watch politics.",
    "Over the last several decades, the bounds of what cooking represents have shifted.",
    "Then, as so many Americans do, she posted a photograph of that night's dinner.",
    "This is something that Ocasio-Cortez seems to innately recognize.",
    "On the grill are five haphazardly scattered, untoasted buns.",
    "This isn't true across the board, of course.",
    "Want more great food writing and recipes?",
    "Subscribe to Salon Food's newsletter.",
    "Hilary Clinton serves as an example.",
    "\"I'll post my meal when it's done.\"",
    "Former Arkansas Gov.",
    "you may ask."
  ]
}