{
  "id": 3266,
  "mediaId": 367,
  "date": "5/9/2022 12:00:00 AM",
  "headline": "Congressional candidate Derrick Van Orden fined for having a loaded gun in an airport. He calls the incident a mistake.",
  "image": "https://www.gannett-cdn.com/presto/2020/09/25/PMJS/021301bb-16d1-46db-a2c3-0567d5c730e8-Derrick_Van_Orden2.jpg?width=1320&height=716&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.jsonline.com/story/news/politics/elections/2022/05/09/congressional-candidate-derrick-van-orden-fined-gun-airport/9678273002/",
  "mediaOutlet": "Milwaukee Journal Sentinel ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Patrick Marley",
  "authorUrl": "https://www.jsonline.com/staff/2646637001/patrick-marley/",
  "termIds": [
    1089,
    2303,
    533,
    571,
    562,
    545,
    428,
    146,
    2972
  ],
  "sentences": [
    "Van Orden, a Republican running to fill the seat being vacated by Democratic U.S. Rep. Ron Kind of La Crosse, was cited in August for having a loaded 9mm Sig Sauer handgun in his bag at the security screening checkpoint at the Cedar Rapids, Iowa airport, according to court records.",
    "Democrats running for the seat are Eau Claire small business owner Rebecca Cooke, U.S. Navy veteran Brett Knudsen, retired CIA officer Deb McGrath and state Sen. Brad Pfaff of Onalaska.",
    "MADISON  Congressional candidate Derrick Van Orden was found with a gun in his carry-on bag at an Iowa airport last year, netting him two fines for what he called a mistake.",
    "\"Derrick Van Orden is a decorated Navy SEAL veteran with 5 deployments to combat zones who is an expert with firearms and firearm safety,\" the campaign statement said.",
    "He fully cooperated and apologized to TSA for adding to the stress of their job, thanked them for the work they do keeping us safe, and it has been fully adjudicated.\"",
    "Van Orden declined to be interviewed, but his campaign released a statement that said he brought the gun to the airport checkpoint by mistake.",
    "Details about the incident are emerging soon after U.S. Rep. Madison Cawthorn (R-N.C.) was cited for having a gun in a carry-on bag.",
    "The campaign and TSA did not provide details on the size of that fine, but TSA typically charges $4,100 for first offenses.",
    "Separately, Van Orden was fined by the Transportation Security Administration, according to his campaign.",
    "He filed paperwork in April showing he had taken a class for a Wisconsin concealed weapons permit.",
    "It hit a 20-year record as of the fall with three months left in the year, according to TSA.",
    "Kind announced he is not running in August, about three weeks before Van Orden was fined.",
    "Van Orden lost to Kind in 2020 and soon after launched his bid for the 2022 election.",
    "A magistrate ordered him to pay $360 and show he had taken a firearms safety course.",
    "\"Derrick was traveling with his family and this situation was purely accidental.",
    "Van Orden, of Prairie du Chien, entered a guilty plea in December.",
    "TSA found 5,972 guns at checkpoints across the country last year.",
    "The winner of the Aug. 9 primary will face Van Orden in November.",
    "Contact Patrick Marley at patrick.marley@jrn.com.",
    "Follow him on Twitter at @patrickdmarley."
  ]
}