{
  "id": 3267,
  "mediaId": 169,
  "date": "5/8/2022 12:00:00 AM",
  "headline": "Frozen food and feminism: Madison Cawthorn's dog whistle about microwave meals isn't new",
  "image": "https://mediaproxy.salon.com/width/1200/https://media.salon.com/2022/04/madison-cawthorn-0425222.jpg",
  "link": "https://www.salon.com/2022/05/08/frozen-and-feminism-madison-cawthorns-dog-whistle-about-microwave-meals-isnt-new/",
  "mediaOutlet": "Salon",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashlie D. Stevens",
  "authorUrl": "https://www.salon.com/writer/ashlie_d_stevens",
  "termIds": [
    3046,
    3039,
    3004,
    2399,
    2303,
    76
  ],
  "sentences": [
    "RELATED: Real women are still expected to cook: From sitcoms to the Food Network, the \"angel in the kitchen\" pressure on women prevails\nOnly last week, perpetually disgraced Rep. Madison Cawthorn, R-N.C., tweeted, \"How many of the women rallying against overturning Roe are over-educated, under-loved millennials who sadly return from protests to a lonely microwave dinner with their cats, and no bumble matches?\"",
    "In the foreword to a re-release of the book, Bracken's daughter, Johanna, wrote that her mother's book was \"written in a time when women were expected to have full, delicious meals on the table for their families every night\" and offered women \"who didn't revel in this obligation an alternative: quick, simple meals that took minimal effort but would still satisfy.\"",
    "Even beloved food writer Michael Pollan once wrote for the New York Times Magazine that \"The Feminine Mystique\" was \"the book that taught millions of American women to regard housework, cooking included, as drudgery, indeed as a form of oppression.\"",
    "Times may have changed since the \"I Hate to Cook Book\" was first published, but there are still those who would prefer women to be culturally obligated to the kitchen  all while they perpetuate the myth that feminism killed cooking.",
    "In one heavily-circulated meme, the \"tradwife\" is depicted as having a \"slim figure from her healthy homemade meals and active lifestyle,\" while the feminist is \"chubby from her diet of fast food and microwave meals.\"",
    "When right-wing men bemoan the loss of the traditional mid-century housewife, they ignore the fact that until World War II, middle-class American families typically had one or more servants to help around the house.",
    "During an age when the United States' culinary godfather James Beard was ascending as an evangelist of sorts for \"fresh, wholesome, American ingredients,\" Bracken's book was subversive  and it was successful for it.",
    "More accurately, they supported women's ability to have that choice because, in addition to changing cultural attitudes about gender equality, they didn't have to spend hours getting dinner on the table.",
    "And for as long as there have been modern kitchens, there have been men worried women are planning to leave them  ostensibly for acts of civil disobedience and an Amy's broccoli and cheddar bake.",
    "However, this connection between a perceived rejection of home-cooking and feminism flattens both the history of so-called convenience foods and what \"traditional domesticity\" actually entailed.",
    "The production of canned choices and frozen foods only continued to ramp up following the war, which did dovetail with an increased number of women continuing to seek work outside the home.",
    "This connection between a perceived rejection of home-cooking and feminism flattens both the history of so-called convenience foods and what \"traditional domesticity\" actually entailed.",
    "A wartime ad for Shredded Ralston whole wheat cereal, which featured both men and women, emphasized that the meal was \"ready-to-eat when I'm ready\" and was punctuated with patriotism.",
    "As Eater reported, the mid-century transition to cooking with frozen ingredients or relying on full frozen meals was actually sparked by war  not \"The Feminine Mystique.\"",
    "Among the alt-right, it's become standard fodder for memes comparing \"The Tradwife\" (shorthand for the \"traditional wives\" alt-right men seek) to \"Liberated Feminists.\"",
    "The \"cat lady\" is a now a standard, if softer, clichd stand-in for the \"bra-burning feminist\" who trades in a potential husband and children for feline companionship.",
    "As the New York Times reported in the wake of Bracken's death in 2007, more than 3 million copies of the \"I Hate to Cook Book\" had been sold in various editions.",
    "Our cultural understanding of what food is has largely shifted from a backbreaking responsibility to an optional form of leisure, fun and entertainment.",
    "For a very long time, women didn't have the choice to step away from the stove unless they possessed a certain type of financial or social privilege.",
    "In 1960, three years before the publication of Betty Friedan's seminal feminist text \"The Feminine Mystique,\" Peg Bracken published her own book.",
    "And while Friedan and other feminists of her era didn't kill home cooking, she certainly would have appreciated the idea that it was optional.",
    "It's not a particularly inventive attempt at slamming women who are concerned about their access to reproductive healthcare being torpedoed.",
    "The aptly named \"I Hate to Cook Book\" was built on convenience foods  crushed cornflakes, frozen vegetables, powdered soup mixes and Spam.",
    "Whether it's actually their wife or a servant doing the work, it doesn't matter  as long as they aren't the one having to pick up a whisk.",
    "Frozen also used fewer ration points than canned, according to the National Frozen & Refrigerated Foods Association's (NFRA) website.\"",
    "If they wanted to, that was their choice  a simple statement that gets glossed over in discussions about \"traditional\" gender roles.",
    "It's a convenient narrative to regurgitate: this notion that feminism is responsible for the perceived downfall of American cooking.",
    "As such, I recognize that my view of cooking is borne from a certain kind of privilege  one that many, many Americans also possess.",
    "During World War II, canned goods \"were sent to soldiers overseas and Americans were encouraged to purchase frozen foods.",
    "So what are Cawthorn or men in search of a \"tradwife\" really saying when they toss out the \"microwave meal\" dog whistle?",
    "During this time, women were encouraged to pitch into the war effort and seek employment outside the home.",
    "In 1940, the Bureau of Labor Statistics counted 2.6 million domestic servants, or almost one job in 20.",
    "The advent of convenience foods simply made the ability to shed that responsibility more accessible.",
    "They want to return to a time where they personally don't have to have a stake in domestic labor.",
    "Who cares if you need to microwave that potato to fully experience the world outside the kitchen?",
    "Before there was canned soup or bags of frozen peas, there were live-in cooks and servants.",
    "After all, Freidan wrote that \"a baked potato is not as big as the world.\"",
    "\"No wonder Uncle Sam says, 'Eat foods like this every day,'\" it said.",
    "This was even reflected in advertisements for convenience foods.",
    "It began like this: \"Some women, it is said, like to cook.",
    "Subscribe to \"The Bite,\" Salon Food's newsletter.",
    "Did convenience foods spark that transition?",
    "Want more great food writing and recipes?",
    "Read more commentary on food and gender:",
    "It's both my work and my primary hobby.",
    "Now, as a food writer, I love to cook.",
    "This book is not for them.\""
  ]
}