{
  "id": 3322,
  "mediaId": 136,
  "date": "5/13/2022 12:00:00 AM",
  "headline": "Madison Cawthorn Chances of Beating Chuck Edwards, According to Polls, Odds",
  "image": "https://d.newsweek.com/en/full/2037142/madison-cawthorn-primary-odds.webp?w=790&f=eed9d707d19a4212a27a18cd24561387",
  "link": "https://www.newsweek.com/madison-cawthorn-chuck-edwards-primary-north-carolina-odds-polls-1706392",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ewan Palmer",
  "authorUrl": "https://www.newsweek.com/authors/ewan-palmer",
  "termIds": [
    821,
    2303
  ],
  "sentences": [
    "The slew of negative stories that have appeared about Cawthorn came after he said that he had seen his colleagues in Washington D.C. do cocaine in front of him, and that others had invited him to orgies\nThe remarks resulted in fierce rebuttal from the GOP, with House Minority Leader Kevin McCarthy saying the 26-year-old had \"lost my trust [and] he's going to have to earn it back.\"",
    "These concerned being stopped by police three times since Octoberfor alleged speeding and driving with a revoked licensebeing caught for the second time with a gun at airport security and accusations he was involved in illegal insider trading in relation to his ties to a \"Let's Go Brandon\" cryptocurrency.",
    "The poll also found half of potential voters agreed with the statement that it \"may be better for another candidate to win the Republican Primary for Congress\" because of the constant news about Cawthorn's personal and professional life.",
    "According to a survey by the Republican GOPAC Election Fund published in April, Cawthorn's approval rating in North Carolina fell 13 percentage points from 64 to 51 compared to the previous month following the string of controversies.",
    "Cawthorn addressed the allegations his own party is plotting to get him voted out of Congress in an Instagram video after he was caught with a gun at a security checkpoint at Charlotte Douglas International Airport on April 26.",
    "Embattled North Carolina Rep. Madison Cawthorn still has a good chance of getting re-elected into office despite the number of controversies that have dogged the freshman Republican in recent months.",
    "Despite his approval ratings falling in the GOPAC Election Fund survey, Cawthorn was still ahead of his nearest rival, state Senator Chuck Edwards, who was polling a distant second at 21 percent.",
    "\"We're starting to see this coordinated drip campaign where they're going to drop an attack article every one or two days, just trying to kill us with a death by a thousand cuts,\" Cawthorn said.",
    "The timings of the negative press has led to speculation that there is a GOP-led attempt to oust Cawthorn from the party that might believe he is too damaging and volatile to stay in office.",
    "When asked whether they would vote to elect the freshman congressman again, 39 percent said they would in the April survey, compared to 54 percent who said they would back him in March.",
    "\"Negative stories about his personal behavior have seriously undermined Cawthorn's standing with GOP primary voters in all the most important image and job performance measures.\"",
    "Cawthorn, who is the youngest member of Congress at 26 years of age, has seen his approval ratings take a plunge as his personal and professional life keeps making headlines.",
    "But a lot has changed in the past six weeks,\" Jim Blaine, of the consulting firm The Differentiators, said in a memo to David Avella, chair of GOPAC, about the polling.",
    "Chris Cooper, a political science professor at Western Carolina University, believes that there is now too much dirt on Cawthorn for him to save his political career.",
    "\"I'm very proud of my constituents who are seeing through these kind of political shenanigans, and I'm very confident that we're going to be able to win reelection.\"",
    "A spokesperson for Betfair told Newsweek that despite recent \"slip-ups,\" Cawthorn is still at 2/5 odds to be re-elected in the North Carolina in November's midterms.",
    "Bookmakers have also suggested the political firebrand could power through the controversies and not only win the primary but go on to gain another term in office.",
    "It appears that the controversy surrounding Cawthorn is damaging his chances ahead of the May 17 GOP primary in North Carolina's 11th District.",
    "\"There's enough drips now where it's created a lake big enough to drown [in],\" Cooper told The Charlotte Observer.",
    "Another leaked video appeared to show him naked in bed thrusting against another person.",
    "(The cryptocurrency is named after a catchphrase used to attack President Joe Biden.)",
    "\"Our early March survey showed Cawthorn well-positioned for re-election.",
    "Images have also been leaked of him wearing women's lingerie.",
    "Newsweek has contact Cawthorn and the GOP for comment.",
    "Cawthorn said he was being \"crass with a friend.\"",
    "Newsweek has contacted GOPAC for comment.",
    "\"And I think he's feeling the heat.\""
  ]
}