{
  "id": 3416,
  "mediaId": 147,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "2022 North Carolina Primary Election Results",
  "image": "https://d3i6fh83elv35t.cloudfront.net/static/2022/05/2020-11-03T150502Z_1629427110_RC2RVJ9EJD5U_RTRMADP_3_USA-ELECTION-NORTH-CAROLINA-1200x800.jpg",
  "link": "https://www.pbs.org/newshour/politics/2022-north-carolina-primary-election-results",
  "mediaOutlet": "PBS NewsHour",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Marc Levy",
  "authorUrl": "https://www.pbs.org/newshour/author/marc-levy-associated-press",
  "termIds": [
    821,
    2303
  ],
  "sentences": [
    "Trump, in a post on his social media site Truth Social overnight Monday, urged voters to give Cawthorn a second chance,? acknowledging the candidate had recently made some foolish mistakes.?\nIn two Democratic-leaning districts, Democrats are holding robust primaries for the nominations to succeed the retiring Rep. David Price in the 4th District and Rep. G.K. Butterfield in the 1st District.",
    "READ MORE: Oath Keeper from North Carolina pleads guilty to seditious conspiracy during Jan. 6 insurrection\nTrump endorsed Republican Rep. Ted Budd for the Senate seat being vacated by retiring Republican Richard Burr, surprising many at last year's state GOP convention.",
    "In North Carolina, which is holding primary elections Tuesday, former President Donald Trump is trying to sway races for the U.S. Senate and House in a state he won twice with narrow victories.",
    "In congressional races, Trump's endorsement of Rep. Madison Cawthorn in the 11th District didn't stop establishment figures from opposing the 26-year-old first-term Republican congressman.",
    "Pat McCrory, who is considered a moderate in the race, but is best known nationally for signing a bathroom bill? targeting transgender people in 2016 that cost the state billions.",
    "Cawthorn  a speaker at the Stop the Steal? rally before the Jan. 6 insurrection at the U.S. Capitol  has become vulnerable in recent weeks in an eight-candidate GOP primary.",
    "On the Democratic side, Cheri Beasley, the former chief justice of the North Carolina Supreme Court, has appeared to clear her 11-person field of significant rivals.",
    "Tuesday's primary may not be the final word for would-be nominees: First-place candidates must get more than 30 percent of the vote to avoid a July 26 runoff.",
    "In the open 13th District, considered a toss-up in November, the Republican field includes Bo Hines, a former college football player endorsed by Trump.",
    "Budd's top competitors in the 11-way primary are former U.S. Rep. Mark Walker, who had actively sought Trump's support, and former Gov.",
    "Former American Idol? star Clay Aiken is among the Democratic candidates running for Price's seat.",
    "She would be North Carolina's first Black U.S. senator if she wins in November.",
    "Sen. Thom Tillis has endorsed state legislator Chuck Edwards in the race."
  ]
}