{
  "id": 3429,
  "mediaId": 234,
  "date": "5/16/2022 12:00:00 AM",
  "headline": "Alyssa Farah Griffin, the Ex-Trump Aide, Wants to Be America's Household Conservative",
  "image": "https://media.vanityfair.com/photos/627e8374c869e30568428353/master/w_2240,c_limit/vf-522-ALYSSA_FARAH_001.jpg",
  "link": "https://www.vanityfair.com/news/2022/05/alyssa-farah-griffin-the-ex-trump-aide-americas-household-conservative",
  "mediaOutlet": "Vanity Fair",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303
  ],
  "sentences": [
    "For most politiciansnot Trumpleadership tends to drive them toward moderation,? she says, a DeSantis in the White House would look very different than a DeSantis governing Florida in a time when Florida's very red, thinking about running for president.?\nFarah Griffin can't see herself running for anything at this time, only because she's not someone who could win a Republican primary right now,? but wants to be part of the discussion when we do course correct.? For now, though, she says she's not actively soliciting political work, or being paid to advise any Republicans (though she does so in an unofficial, unpaid capacity).",
    "After exiting the administration, Farah Griffin advised the Georgia GOP ahead of the January 2021 Senate runoff elections, and did a few Fox News hits, during which she fearmongered about a far-left attempted takeover? and told people to get out and vote if you don't want a rigged election.? When I asked her about these comments, Farah Griffin, after some pushback, admitted, I was at that period doing what a lot of the Republican Party still is,? which is dancing around the crazy and trying to use the language to appeal to the electorate.? It kept her in Trumpworld's good graces.",
    "Meadows ultimately earned a formal sanction from the House Ethics Committee over his mishandling of the situation (he kept the aide on his payroll even after learning of the allegations, which the aide has denied), but Farah Griffin maintained that the way it was originally covered was not fair to him.? She paints him as father-like, telling me she'll always be grateful to him? for sitting her down with tears in his eyes,? and promising, I will always protect you? and you will always have a safe place with me.? I remind her that she keeps telling me that they no longer speak.",
    "She translated that job into one for Mike Pence, who, she assured me, was much more of a traditionalist.? One D.C. reporter who worked with Farah Griffin called Pence an ideological soulmate, so to speak, for her.? And then another job in the Pentagon under Secretary of Defense Mark Esper, where she remained relatively inoculated from turmoil in the White House (Esper, out promoting a new book about his tenure, is also now making headlines with revelations he waited two years to share).",
    "I've realized I'm the furthest thing from a populist,? said Farah Griffin, who identifies as an old-school, free minds, free markets, globalization is not a bad thing? kind of Republican and would be a libertarian except that I'm so hawkish on foreign policy.? On January 6, Farah Griffin denounced Trump, and in doing so joined a very small contingent of Republicans: those ex-officials with no home in the party, but a robust public life on TV.",
    "(Farah Griffin's: For a while, I decided I didn't like milk so I'd have cereal with water.?) She then dove into a recent Atlantic article in which Trump supporters explained why they believe the election was stolenthe goal being to get the students to see, contrary to what their perceptions may be, what in fact drives Trump voters,? a topic that, along with tangents about vaccine hesitancy, took up most of the 90 minutes.",
    "She explained herself before a panel that didn't hold back, and made enough headlines, apparently, to be invited back in February (by which time she'd been hired by CNN as a paid contributor), Marchwhen she proclaimed, during a segment about Volodymyr Zelenskyy, that she's never been more proud to be a Ukrainian,? despite only finding that out from a 23andMe test mere weeks beforeApril, and May.",
    "(Not Farah Griffin's first choice, which was closed, but one she concluded, as her stilettos clicked against the cobblestone streets, was actually much more my vibe.?)\nSitting across from her in that basement rathskeller I found myself wondering who Farah Griffin, after making all these headlines proclaiming she'd never vote for Trump again, will attach herself to in the future.",
    "The people I'm most hoping to reach and convince that Trump is terrible for our country, are people who, like I once did, support him.?\nReporters remember Farah Griffin as one of a handful of people in the administration who I think everyone would agree was a baseline professional and competent person at her job,? as one White House reporter who worked with her put it.",
    "I thought it would've been a bit cheap,? she'd explain later, to ask such a question without giving Owens time to properly answer.? The moment falls flat as she asks how Biden intends to work with the GOP over the next two years in such a divided time.? Owenswho'd been warned during a commercial of what Farah Griffin intended to askappears unprepared for the soft ball.",
    "She looked visibly emotional comprehending how the same man who encouraged me to be, like, bold and break with the party when it made sense to, break with leadership, not to be afraid to ruffle feathers if you think you're doing what's rightdidn't do that in the moment that mattered most.? Her voice went up as she finished the thought, as if to ask a question.",
    "It was a crisp autumn-like day and, as we walked to Healy Hall, Farah Griffin cautioned that she had no idea how many students would show up for the final meeting of her discussion group, The Future of America's Democracy in the Midst of the MAGA' Movement.? She'd applied for the Fellows Program last year but didn't get it; this year, Georgetown reached out.",
    "You're rewarding mediocrity.?\nIn November 2020, Fox News reported that Farah Griffin had been interviewing with TV agents since before the election? and was actively looking for a job in a post-Trump world.? (Farah Griffin denies meeting with any prospective employers prior to leaving the administration, or TV agents at that time.)",
    "I basically set my world on fire, doing what I thought was right,? she told me, and was just surprised to be met with, like, additional condemnation from a person close to me.?\nThe easiest thing in the world would've been for me to keep my mouth shut, stay in one of the dozens and dozens of Trump-aligned operations,? she says.",
    "I would be lying if I said my father's company and role in the current state of right-wing media wasn't a factor in me feeling, um, convicted and compelled to knock down disinformation,? said Farah Griffin, who revealed on The View that her father didn't come to her wedding because she spoke out against the former president.",
    "Meadowswhose alleged deep involvement in plans to overturn the 2020 election results and knowledge of the threat of violence ahead of the January 6 riot, as well as his simultaneous voter registration in three states, has dominated headlines in recent weekstaught me to, like, lead with the human side,? said Farah Griffin.",
    "Having someone who can talk his talk, understand what this chess move is or that? may, she hopes, help it not happen again.?\nIn the back of a near-empty Jonathan Waxman joint in Midtown a few weeks ago, Farah Griffin sipped tea, and then Sauvignon Blanc, her hair and makeup still intact from that day's taping of The View.",
    "She told him to make her communications director instead, promising to turn the press shop into a well-oiled machine? where reporters' emails or calls are returned.? Meadows eventually accepted, but not before asking her who she thought should be press secretary: POTUS is interested in Kayleigh McEnany or Jenna Ellis.",
    "Who do you think?? Farah Griffin recalls Meadows asking, to which she responded, McEnany by a mile.?\nIt's over guacamole and spiced nuts when Farah Griffin, riffing about what a great leader Meadows was, stumbles upon a story that goes a long way to explain why it's difficult for her to let go of the Trump ally.",
    "She told me multiple times that she declined Jason Miller's offer to join the Trump campaign (Miller couldn't seem to remember this one way or another, but did say he regretfully? passed her resume to Pence's office), didn't vote for Trump in 2016, and passed up an early opportunity to work in the White House.",
    "The notion that Farah Griffin's rehabilitation campaign as a common sense anti-Trump conservative is a grift to get on TV is an incredible oversimplification that really ignores her career arc,? one of Farah Griffin's former colleagues at the White House says, before adding: There are some realities on ground.",
    "Starting in spring 2014, she worked for Meadows in some capacity on the Hill for more than three years, during which time she also ran the communications team for the House Freedom Caucus, Congress's infamous gang of arch-conservatives that gained notoriety for accelerating John Boehner's ouster.",
    "The Washington Post called her resignation from the White House a tacit nod to Trump's loss?; she told me she'd hoped it would set an example for her staff that we're not miraculously winning this thing.? Though, notably, she opted against saying so publicly on her way out.",
    "On her cue card was a clear window to make headlines: She was expected to ask her about Hunter Biden, Joe Biden's scandal-plagued younger son who has long been the subject of a right-wing fever dream (one that Farah Griffin, in her past life, personally helped amplify).",
    "Farah Griffin appears to be making a similar case: I do believe that media is the way I can have the most influence in the shortest period of time,? she says, especially ahead of the midterms, as she hopes to bring down the temperature of the current political climate.",
    "I am telling my truth and I have never really shied away in doing it and, frankly, I have had a lot of personal loss.?\nIn this telling, she weaves in and out of a checkered history working for some of the most notorious right-wing figures of the last decade.",
    "Critics have slammed both outlets for giving Farah Griffin a platformpart of a running debate about the perceived rehabilitation of ex-Trump officials by mainstream media outlets, one recently reignited by CBS bringing on Mick Mulvaney as a paid pundit.",
    "There was a brief period where I, you know, I drank the Kool-Aid,? she admitted when I asked her about the clip, which was taken in spring 2020a low point, in the sense that that was probably when I was buying what I was selling the most,? she said.",
    "Stephanie Grisham, the Trump press secretary who never held a press conference and resigned on January 6, is also vying for the conservative seat on The Viewher next stop on a brand rehabilitation tour that's certainly drawn attention.",
    "But as one former colleague who worked with her in the Trump administration put it, When the conservative movement calls, you have to answer.? And by 2020, when Meadows called asking her to take a job in the West Wing, she took it.",
    "I feel like the core of the country is a lot closer to where I am right now.?\nFarah Griffin, by her own admission, was raised in the right-wing media,? by one of the early, kind of godfathers? of conservative conspiracy sites.",
    "As the cofounder of WorldNetDaily, Joseph Farah paved the way for far-rightquote, unquotenews outlets such as Breitbart and Infowars, and is largely synonymous with the so-called birther movement he helped make mainstream.",
    "As she rebrands herself outside the Trump administration, some things have come back to haunt her, including a video of her gushing about Trump, which the former president cited as sellout evidence in a recent email blast.",
    "With The View, they are looking for someone who was pro-Trump but is also anti-Trump, who has credibility with Trumpworld but also rejects January 6that is a constituency of one,? said one reporter who has worked with her.",
    "I mean, I still disagree with her, but I think she's incredible.?\nAfter class, Farah Griffin and I found a booth at The Tombs, that dimly-lit, brick-walled Georgetown haunt that inspired the titular bar in St. Elmo's Fire.",
    "On a rainy Tuesday morning on the Upper West Side, an ebullient studio audience of mostly middle-aged women is instructed to dance as the regular hosts of The ViewJoy Behar, Sunny Hostin, and Sara Hainesenter stage right.",
    "Famous last words.?\nIn October, as The View was making its way through a list of potential McCain replacements, they tried out Farah Griffinwhose agent, Babette Perry, previously represented Hasselbeckfor the first time.",
    "Then, Fox just stopped asking,? and I also wasn't reaching back out.? A few months later, the network hired Kayleigh McEnany, Trump's final White House press secretary, who spent much of her tenure lying to reporters.",
    "Um, my position is this: Like, the phone works both ways, but I don't know what I have to say.?\nThe text Farah Griffin sent Meadows on January 6If someone doesn't say something, people will die?may well be the last.",
    "But whether it's even possible to speak to liberal and conservative viewers on the same show isn't a question The View appears all that interested in, even if Grisham and Farah Griffin see it as their raison d'tre.",
    "At this point, Farah Griffin may like you to know that she wrote in Paul Ryan? for president in 2016.\nIt was like a homecoming,? Farah Griffin says of walking into Meadows's White House office to discuss her job.",
    "I attribute a lot of, um, talents I developed to him.? A central tension in Farah Griffin's life seems to be how to construct a career separate from the right-wing ecosystem that gave her one in the first place.",
    "Farah Griffin guest-cohosted the show on five different weeks throughout the season, more than anyone else, while Grisham was recently welcomed back for her second stint (and is set to return later this month).",
    "In Farah Griffin's day, members might not have been defending insurrections, but they were still shit stirrers against the GOP establishment? with a burn-it-all-down ethos,? as one White House reporter put it.",
    "Basically, if you were working for Mark Meadows or the Freedom Caucus, you were more or less a Bolshevik inside the revolution here,? according to one reporter who worked with Farah Griffin on Capitol Hill.",
    "I was just shocked toward the end that at every turn I felt like he did the wrong thing.?\nBy the main gates of Georgetown University last month, Farah Griffin emerged from her Uber in a scarlet pantsuit.",
    "She considers her full-time job to be at Merrimack Potomac + Charles, the strategy advising firm where she's a senior adviser (and where her father-in-law, Patrick Griffin, is founding partner and CEO).",
    "Hostin mouths to her, It's ok.?\nThe conservative seat on The View, first held by Elisabeth Hasselbeck (who lasted nearly a decade before being fired), has had famously high turnover in recent years.",
    "But just from coming to a few of her discussions?including the one where she brought Jake Shermanshe was struck by Farah Griffin's focus on humanity rather than political identification,? she says.",
    "Its lone conservative panelist, who became known for her passionate spats with Goldberg in particular, departed in August, the latest in a long line of Republican cohosts to exit ABC Studios.",
    "Never Trumpers don't accept me because they think I was in his administration too long, I don't expect the Democrats to, just in general, and then Trumpworld, I'm alienated from,? she says.",
    "Fox got Kayleigh McEnany, so she had to adapt to some extent.?\nI'm not somebody who drank the Kool-Aid for five years and then magically found Jesus on January 6,? Farah Griffin tells me.",
    "I'd say I lost a lot of friends.?\nAfter she spoke out, she did MSNBC, CNN, and Fox News, which Farah Griffin said at one point was asking for her as much as five to seven times a week.",
    "That the competition for McCain's seat has, at least on the surface, come down to two former Trump officials who are both trying to reframe their history is hardly a coincidence.",
    "Farah Griffin resigned from the Trump administration on December 3, 2020that is to say, at the end of Trump's presidency but prior to a violent mob storming the Capitol.",
    "It was a somewhat shocking nonanswer about a character in the Republican Party seemingly as dedicated as Trump is to raising the temperature of conservative politics.",
    "She thought, maybe, that that job could take her to corporate America?a Boeing or a Lockheed or something?and, eventually, back into government in a more senior role.",
    "While working for Meadows on the Hill, she and other members of the then congressman's office informed him of sexual harassment allegations against one of his aides.",
    "There's also the CNN gig, two paid speaking bureaus she's signed with, and whatever episodes of The View she's asked to guest-cohost until they come to a decision.",
    "The next breath she'd reminisce about her time working for Meadows in Congress, days she says she'll always cherish.? Meadows declined to comment for this story.",
    "I never caught her in a major lie, like I did others in the building, though she did spin a lotas was her job,? another reporter who interacted with her said.",
    "A freshman named Ava told me on her way out that she'd learned more from Farah Griffin than any other felloweven, she revealed in hushed tones, as a Democrat.",
    "TV people like what's easy and there's often a lowest common denominator,? said one Hollywood talent executive with knowledge of the show's inner workings.",
    "As roughly a dozen students trickled in, Farah Griffin put out a bag of assorted candies and added her copy of Valerie Biden Owens's book to a bookshelf.",
    "I know I for sure said to my husband multiple times, I want to stay off TV because I don't wanna forever be seen as a Trump spokesperson,'? she recalls.",
    "She was good at her job and very good compared to many others in the White House, when it came to dealing with reporters.? A low bar, as many point out.",
    "It's the 144th episode of the 25th season of the series, which ended last season as the most-watched daytime talk show (a first in the show's history).",
    "If the show were merely looking to fill the role with any conservative, they could just put Ana Navarro, a regular recurring guest host, in the chair.",
    "And I think that's what all the networks other than Fox have struggled with.?\nWhat Farah Griffin struggles with, she tells me, is finding a lane.",
    "(For what it's worth, the Hollywood talent executive nearly spit out their drink when they heard Farah Griffin was talking to me for this piece.",
    "The View is a platform having its own reckoning, one that gives Farah Griffin an opportunity to put her experience to use for the time being.",
    "Republican but not delusional' is an interesting kind of rubric for all of this, which is really sad, but true,? one CNN employee told me.",
    "Yet the seat has become a crucial part of the show's dynamic; it's less about offering political balance than about injecting drama.",
    "Figuring out a way to sell her own history might be a good place to start; to that end, The View and CNN have proved indispensable.",
    "I just felt like something needed to be said, and I wasn't gonna wait to see if someone else was gonna say anything,? she said.",
    "She remembers Meadows texting her something like, you're doing great,? after he saw her on Fox News parroting the party line.",
    "Former Republican cohost Abby Huntsman said the pressure to produce such controversy was one of the reasons she left in 2020.",
    "One of Farah Griffin's TV-anchor friends told me the job is like being the drummer in the parody heavy metal band Spinal Tap.",
    "On stage is a potential replacement: Alyssa Farah Griffin, the former White House communications director under Donald Trump.",
    "I didn't really think twice about like, How is this gonna affect relationships with people that I do genuinely care about?",
    "Some media executives have defended these hires as ways to secure access? with Republicans, or diversify their audiences.",
    "Farah Griffin told me she was offered a Newsmax contract within a few days of leaving the White House and turned it down.",
    "But it could be a decade until she has another opportunity to serve in a senior role in government, Farah Griffin admits.",
    "Producers are looking for someone who could generate the kind of high-drama moments (read: ratings) that McCain inspired.",
    "She previously worked as the Pentagon press secretary, and before that, as press secretary to Vice President Mike Pence.",
    "A song off of Vampire Weekend's latest album played faintly in the restaurant while she parsed through the memories.",
    "Grisham and Farah Griffin are seen as the top contenders to replace McCain, who declined to comment for this story.",
    "Today, Freedom Caucus is home to MAGA extremists like representatives Marjorie Taylor Greene and Madison Cawthorn.",
    "Inside the GU Politics office, CNN legal analyst and Farah Griffin's colleague Elliot Williams was wrapping up.",
    "That motivation for both former Trump officials seems constantly at odds with those of a show like The View.",
    "Where both parties find common ground, though, is the need to stay relevant in a merciless media landscape.",
    "I'd have a very hard time saying no to any program that reaches the number of viewers that that show does.?",
    "And something about this era of politics seems to have narrowed the brand of woman that can fill the spot.",
    "She was just on the show last week, when Hostin dragged her on-air for defending Esper's \"apology tour.\"",
    "Everyone who had COVID, welcome back,? Farah Griffin announced, kicking things off with an ice-breaker.",
    "Political strategist Valerie Biden Owens, the president's sister, is there to promote her new memoir.",
    "(Her mother-in-law had texted her in the middle of yesterday's, telling her to pull down her skirt.)",
    "She would leave the White House on very good terms? with Trump's final chief of staff, Mark Meadows.",
    "But apparently, a former GOP strategist turned Biden supporter isn't what producers have in mind.",
    "Her opportunity comes, as does a 30 seconds remaining? warning, but Farah Griffin doesn't do it.",
    "Photos of notable people GU Politics has hostedMark Zuckerberg, Paul Ryanadorned the walls.",
    "She's among the many people who we now know texted Meadows as rioters stormed the Capitol.",
    "At no point in my entire life was my goal to be on TV and be a talking head,? she said.",
    "I guess you could argue she was White House communications directoryeah, for a despot.",
    "I'd have to see where his policies come down,? she said over a glass of pinot grigio.",
    "Then January 6 happened, and she publicly and privately implored Trump to intervene.",
    "I got the worst of it,? Farah Griffin said of the allegedly inappropriate conduct.",
    "Farah Griffin, 32, had already deliberated her interview strategy with a producer.",
    "She talks a lot about her commitment to public service; daytime TV is not that.",
    "At the next commercial break, Farah Griffin looks rattled by her own audible.",
    "This week's, What's your serial-killer trait,? went on for about 15 minutes.",
    "She's the only person who fits in that Venn diagram.?\nWell, there's another.",
    "Whoopi Goldber the show's popular moderator, is out, filming a new series.",
    "But as of last season, The View is permanently without Meghan McCain.",
    "I understand people writing us off, being angry,? Grisham tells me.",
    "She was rewarded with a CNN contract, and The View came calling.",
    "Many of those who did now say as much only behind closed doors.",
    "Well she can basically kiss The View goodbye,? they scoffed.)",
    "Hours later, she texted me to say she'd had another thought.",
    "(I had her sign it to Georgetown,? she explained later.)",
    "It's Farah Griffin's second day of taping this week.",
    "It looks like we're experiencing playback issues.",
    "I am fundamentally, ideologically opposed to her.",
    "I asked her whether she'd vote for Ron DeSantis.",
    "But he's not going anywhere,? she says of Trump.",
    "Farah Griffin, though, they keep inviting back.",
    "She adjusts her canary yellow dress discreetly.",
    "What about the positions he's already taken?",
    "At first it was like, she worked for Trump.",
    "Now in 2022 I watch that video and cringe.",
    "Maybe just a few sips every now and then.",
    "I think I could be helpful,? she said.",
    "But I'm actually glad he put it out.",
    "He wanted her to be press secretary.",
    "There are some palpable absences.",
    "With a smiley face, she notes.",
    "Like, that is Alyssa Farah.",
    "He mentored me,? she says.",
    "The moment made headlines.",
    "She'll be back.",
    "It depends.",
    "Our bad!"
  ]
}