{
  "id": 3439,
  "mediaId": 21,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Opponents of Madison Cawthorn are hoping his 'lapses in judgment' will help them beat the freshman congressmen in the GOP primary",
  "image": "https://i.insider.com/6280f7369147a30018b47c5f?width=1300&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/madison-cawthorn-opponents-bet-his-lapses-in-judgement-help-win-2022-5",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Sarah Al-Arshani",
  "authorUrl": "https://www.businessinsider.com/author/sarah-al-arshani",
  "termIds": [
    821,
    2303
  ],
  "sentences": [
    "Despite this, NBC News reported that because of the large number of GOP candidates, the Trump-backed incumbent could still win the primary, as North Carolina only requires a candidate to win more than 30% of the vote, but opponents told the outlet they are optimistic about efforts to oust him.",
    "\"What folks are concerned with here is they don't feel that they have a voice in Washington, D.C., because our congressman has been jet-setting around the country, getting involved in other races, going to other events,\" state Sen. Chuck Edwards, the most prominent challenger, told NBC News.",
    "Former campaign volunteers have since refused to support Cawthorn, saying he's \"turned his back\" on his district and values ahead of the May 17 primaries where he's facing off against a number of GOP candidates.",
    "Opponents of GOP Rep. Madison Cawthorn are hoping the freshman congressman's public image following a number of controversies will help them beat him in the upcoming primary, NBC News reported.",
    "He defended rioters who stormed the US Capitol during the January 6 insurrection and called Ukrainian President Volodymyr Zelenskyya a \"thug\" and said the Ukrainian government was \"evil.\"",
    "He's been cited for bringing a loaded gun into the Charlotte airport  for which he apologized  and accused of violating the STOCK Act by not declaring cryptocurrency purchases.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Several individuals told Buzzfeed News that Cawthorn would take women on \"fun drives\" where he'd corner them with sexual advances.",
    "The 26-year-old freshman congressman from North Carolina has faced a number of controversies and scandals since taking office.",
    "For now, some constituents who voted for Cawthorn in 2020 also told NBC News they're not impressed with his first term.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "Camila DeChalus\nRep. Madison Cawthorn is running in a close GOP primary for re-election in North Carolina.",
    "former campaign volunteers say Cawthorn was acting\"irresponsibly\" bringing a loaded gun to a airport.",
    "\"I really don't see him doing anything in the district  and he just keeps getting in trouble.\"",
    "Images of Cawthorn in lingerie also surfaced online, which he called \"goofy vacation photos.\"",
    "His GOP challengers are hoping his public image will help them oust him, NBC News reported.",
    "A nude video of the congressman has also been leaked, amongst several other controversies.",
    "A representative for Cawthron did not immediately return Insider's request for comment.",
    "\"He fooled the hell out of everybody,\" Bruce Rose told Insider's Camila DeChalus.",
    "Cawthorn was accused of sexual harassment by former college classmates last year.",
    "Cawthorn's first term in office has been riddled with scandals and controversies.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "He has also been charged with driving with a revoked license.",
    "Seven candidates running in North Carolina's GOP primary.",
    "\"He's a hot mess,\" Susan Newman, 53, a teacher said.",
    "\"I despise him  he is a criminal and a performer.\"",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading."
  ]
}