{
  "id": 3444,
  "mediaId": 129,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "In Madison Cawthorn's District, Strong Opinions of Him, For and Against",
  "image": "https://static01.nyt.com/images/2022/05/13/multimedia/00pol-cawthorn-signs-photo/00pol-cawthorn-signs-photo-articleLarge-v2.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/05/15/us/politics/madison-cawthorn-hendersonville-nc.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    641,
    821,
    2303
  ],
  "sentences": [
    "There is a trend line of missteps and indiscipline,? Mr. Honeycutt said, adding: It's really a distraction right now when we should be focused on kitchen-table issues like the cost of gas, or inflation, or what is going on with the war in Ukraine.?\nAt Bethany Bible Church, Christine Tuttle, 61, a bookkeeper, and her daughter, Lizzie, 20, said they remembered Mr. Cawthorn as respected, outgoing and popular among the home-school families.",
    "In interviews with more than 30 voters in Mr. Cawthorn's 11th Congressional District, including nearly two dozen registered Republicans, it was clear that his support had weakened, even among hard-right Trump followers who said Mr. Cawthorn's immaturity and lack of focus on his constituents had led them to disregard his endorsement by the former president and give one of his rivals their vote.",
    "And there are eye-rolls and shrugs from his die-hard supporters, America First? conservatives after the fashion of Donald J. Trump, who chalk up Mr. Cawthorn's controversies to youthful indiscretion and instead reserve their opprobrium for the liberal media, Democrats, his Republican opponents and political groups with deep pockets.",
    "Perhaps the most frequently cited objections to Mr. Cawthorn, however, were his track record of missing important votes in Congress and reports that he had moved into a newly-drawn conservative district nearby before deciding to run for re-election to his seat in the 11th District.",
    "I am not voting for him to be my best friend or date my daughter.?\nLess easily brushed away were Mr. Cawthorn's attempts to bring guns through airport security and his traffic violations, which many saw as irresponsible considering the crash that left him in a wheelchair.",
    "In this southwestern corner of the state, a largely working-class and Republican stronghold set against the Blue Ridge and Smoky Mountains, it seems as if nearly everyone has made up his or her mind on the young firebrand once seen as the future of the Republican Party.",
    "He hasn't really done anything for this district that I can think of,? said Scott Tekavec, 59, a maintenance technician who said he did not usually vote Republican but decided to cast a ballot for Mr. Edwards as an expression of his disdain for Mr. Cawthorn.",
    "From the very start, we have been focused on firing Cawthorn, but firing him in a way that was factual and honest,? said David Wheeler, a Democrat who co-founded the group, American Muckrakers Inc., with Mr. Cawthorn's 2020 Democratic opponent, Moe Davis.",
    "HENDERSONVILLE, N.C.  When Representative Madison Cawthorn's name comes up in this city of 14,000, where he was born and raised and it is not difficult to bump into someone who knew him from his home-schooling days, there tends to be a visceral reaction.",
    "Elected in 2020 as the youngest member ever to serve in the House, he helped spread Mr. Trump's stolen-election lies and aligned himself with other incendiary far-right representatives, Marjorie Taylor Greene of Georgia and Lauren Boebert of Colorado.",
    "There are sighs from Republicans who elected him to his first term in November 2020 and met his meteoric rise in Washington with the praise and excitement reserved for a hometown hero  only to be disappointed by his behavior and bad press ever since.",
    "They are led by Chuck Edwards, a state senator who has the endorsements of most members of the Legislature from his district, and Michele Woodhouse, the elected Republican chair of Mr. Cawthorn's district who once was among his staunch supporters.",
    "But a super PAC created to oust Mr. Cawthorn, which has held itself out as a clearinghouse of damaging information about him, said the tips it has received have largely come from Mr. Cawthorn's former aides and supporters.",
    "There are groans and looks of utter disgust from people with Democratic and independent leanings  some of whom have chosen to cast a ballot in a Republican primary for the first time in hopes of removing him from office.",
    "In Henderson, Transylvania and Haywood counties, many voters recalled how Mr. Cawthorn won the seat  replacing Mark Meadows, who became chief of staff in the Trump White House  by modeling himself after Mr. Trump.",
    "But his re-election campaign has been marred by a seemingly endless series of embarrassing reports  beginning when he claimed that people he looked up to? in Washington had invited him to orgies and used cocaine.",
    "Mr. Cawthorn, 26, who was injured in a car crash at 18, has seldom been out of the headlines since making his first run for Congress in 2020, when it emerged that he had made up parts of his autobiography.",
    "If I was a young kid with a cellphone, I wouldn't have a job either,? said David Roberts, 33, an engineer and unaffiliated voter in Hendersonville who planned to cast a ballot for Mr. Cawthorn on Tuesday.",
    "I don't care what he's done,? said Moiena Gilbert, 77, a retired certified nursing assistant who pulled up in an old Ford pickup to cast an early vote this week at Henderson County's Board of Elections.",
    "Electability Concerns: Starting with Pennsylvania, the coming weeks will offer a window into the mood of Democratic voters who are deeply worried about a challenging midterm campaign environment.",
    "I think there is a lot of support for Madison  they just may be afraid to tell you,? said one Baptist deacon leaving the Bethany Bible Church after a Wednesday night Bible study.",
    "Hard-Liners Gain: Republican voters appear to be rallying behind far-right candidates in two pivotal races, worrying both parties about what that could mean in November.",
    "And nude photos and videos have circulated showing him in sexually suggestive antics, in what appeared to be attempts to raise questions about Mr. Cawthorn's sexuality.",
    "Understand the Pennsylvania Primary Election\nThe crucial swing state will hold its primary on May 17, with key races for a U.S. Senate seat and the governorship.",
    "And Rodd Honeycutt, a retired Army colonel, said he had voted for Mr. Cawthorn in 2020 but felt the need to challenge him this year over his lack of leadership.",
    "Only a handful of seats will determine if Democrats maintain control of the House over Republicans, and a single state could shift power in the 50-50 Senate.",
    "He isn't doing his job,? Lynn Cagle, 47, a truck driver in Haywood County, said of Mr. Cawthorn as he left a senior center after voting for Mr. Edwards.",
    "Senate Race: Kathy Barnette, a conservative commentator, is making a surprise late surge against big-spending rivals, Dr. Mehmet Oz and David McCormick.",
    "The revelations ranged from traffic violations, like driving with a revoked license, to two incidents in which he brought a loaded gun to an airport.",
    "Whether Mr. Cawthorn can dodge a runoff has been a constant source of debate in his hometown among friends, co-workers and in Christian circles.",
    "This year's races could tip the balance of power in Congress to Republicans, hobbling President Biden's agenda for the second half of his term.",
    "Abortion Battleground: Pennsylvania is one of a handful of states where abortion access hangs in the balance with midterm elections this year.",
    "Mr. Cawthorn needs to garner only 30 percent of the vote on Tuesday to avoid a runoff in a crowded field split among seven other challengers.",
    "The Washington Examiner reported his involvement in a cryptocurrency scheme and suggested it may have violated federal insider trading laws.",
    "Many compared his brashness to Mr. Trump's and brushed away the photos of him partying or goofing off as the digressions of a young man.",
    "He falsely claimed his injuries had kept him from attending the Naval Academy, but admitted in court that it had already rejected him.",
    "This year, a lot of seats are up for grabs, including all 435 House seats, 35 of the 100 Senate seats and 36 of 50 governorships.",
    "At a Hendersonville rally, Ms. Woodhouse presented herself as a true America First? conservative and Mr. Cawthorn as unelectable.",
    "They said their image of him was tainted when young women came forward with accusations that he had forcibly kissed them.",
    "Midterms take place two years after a presidential election, at the midpoint of a presidential term  hence the name.",
    "Young women at the conservative Christian college he attended before dropping out accused him of sexual harassment.",
    "Chip Worrell, 62, a charter member of the same church and a woodworker who helped erect its building, disagreed.",
    "Writing on Twitter, he told supporters that he and a friend had simply been joking around crassly.",
    "Mr. Cawthorn's opponents lack his ability to draw attention, but they see an opening nonetheless.",
    "Here are 10 races to watch in the House and Senate, as well as several key governor's contests.",
    "Supporters in Mr. Cawthorn's district see the leaks as the work of his opponents or of G.O.P.",
    "Democratic Senate Race: Representative Conor Lamb had all the makings of a front-runner.",
    "Understand the 2022 Midterm Elections\nCard 1 of 6\nWhy are these midterms so important?",
    "Mrs. Tuttle said she still voted for him in 2020. He had so much promise,? she said.",
    "We will.?\nDemocrats have criticized some of the attacks for stirring homophobia.",
    "(The remark drew a scolding from the House Republican leader, Kevin McCarthy.)",
    "She and her daughter said they would not be voting for Mr. Cawthorn this time.",
    "I am going to vote for the man.?\nWhat there is not a lot of is indifference.",
    "They will also test former President Donald J. Trump's role as a G.O.P.",
    "Mr. Cawthorn's campaign did not respond to requests for comment.",
    "Disgrace,? immature? and embarrassment? were common refrains.",
    "I told you there would be a drip drip campaign,? he wrote.",
    "Politico published photos of Mr. Cawthorn in lingerie.",
    "I don't think he is going to be re-elected,? he said.",
    "Here's what to know:\nWhat are the midterm elections?",
    "But they said they knew plenty of people who would.",
    "Some believed them to be fake.",
    "It hasn't worked out that way.",
    "What are the races to watch?",
    "leaders like Mr. McCarthy.",
    "Blackmail won't win.",
    "He's broken the law.",
    "kingmaker.",
    "G.O.P."
  ]
}