{
  "id": 3445,
  "mediaId": 238,
  "date": "5/15/2022 12:00:00 AM",
  "headline": "Midterm primaries live updates Voters to pick key nominees in Pa., N.C., three other states",
  "image": "",
  "link": "https://www.washingtonpost.com/politics/2022/05/17/midterm-primary-elections-north-carolina-pennsylvania/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mariana Alfaro",
  "authorUrl": "https://www.washingtonpost.com/people/mariana-alfaro/",
  "termIds": [
    821,
    2303
  ],
  "sentences": [
    "But the race is seeing a last-minute insurgency from a relatively unknown candidate, Kathy Barnette, who has said MAGA does not belong to President Trump.?\nTrump tried to strike a balance in a recent statement, while dismissing her chances of winning in a general election: She has many things in her past which have not been properly explained or vetted, but if she is able to do so, she will have a wonderful future in the Republican Party  and I will be behind her all the way.?\nOn the Democratic side, the state's lieutenant governor, John Fetterman is leading in the polls.",
    "Ron DeSantis (R) (who urged Americans to put on the full armor of God? to fight coronavirus restrictions and anti-racism education in schools) and U.S. Rep. Marjorie Taylor Greene (R-Ga.) (who said said when the Catholic Church aids migrants, Satan's controlling the church?), Mastriano represents a brand of conservative Christian politics that is different from Jerry Falwell Sr.'s Moral Majority of the 1980s or George W. Bush's compassionate conservatism of the 2000s, and has gained momentum since the Trump presidency.",
    "He ran an ad aimed at the Republican primary, casting Mastriano as the front-runner and calling him one of Donald Trump's strongest supporters.?\nReturn to menu\nFormer president Donald Trump is trying to push his preferred candidate across the finish line in the high-stakes Republican primary for U.S. Senate in Pennsylvania, while a surging rival declined Monday to endorse her main opponents if she does not win the nomination.",
    "Trump, though, stands by him, writing: Recently, he made some foolish mistakes, which I don't believe he'll make again  let's give Madison a second chance!?\nReturn to menu\nAn onetime rock-solid alliance between Trump and the influential conservative group the Club for Growth cracked wide open after they backed different contenders in the Ohio senate primary two weeks ago.",
    "And we have to protect that at all costs.?\nThe 26-year-old former college football player has the support of the former president, conservative firebrands Rep. Marjorie Taylor Greene (R-Ga.) and Rep. Madison Cawthorn (R-N.C.), and the influential Club for Growth in his quest to fill the seat vacated by Rep. Ted Budd (R-N.C.), who is running for a U.S. Senate seat.",
    "Return to menu\nTrump picked the underdog in North Carolina's open Senate race: He endorsed lesser-known Republican member of Congress Ted Budd over candidates like North Carolina's former governor, Pat McCrory, who lost the governor's mansion a few years ago after championing controversial bathroom legislation that targeted transgender people.",
    "With his motto Free indeed!?  an excerpt from scripture that says freedom from sin is found in Jesus  Mastriano is a hero to some in this swing state who say they are fed up with church leaders as well as political parties they perceive as weak-willed, and with debates about religious liberty and the advantages of a diverse democracy.",
    "I'm experiencing some mild symptoms and will continue serving the people of Pennsylvania as I isolate at home.?\nReturn to menu\nAt an elementary school in Cobbs Creek, a historically Black neighborhood in West Philadelphia, everyone voted Democratic, but voters were divided between establishment Democrats and far-left candidates.",
    "In 2016, he called Donald Trump unfit for office.? He survived primary challenges after that, but following the Jan. 6, 2021, breach of the U.S. Capitol by a pro-Trump mob, Simpson voted for a commission to investigate it  something for which Trump has attacked other Republicans.",
    "Today, voters in five states will pick nominees in some of the most consequential primaries of the year, signaling the direction of both major political parties and revealing more about the strength of the hold that former president Donald Trump retains over Republicans.",
    "Fueled by a generation of religious leaders arguing that Christianity is persecuted in America, the new movement wants to see a more explicit, constitutionally approved dominance of Christianity?  which to them means conservative politically, theologically and socially.",
    "Return to menu\nIn Pennsylvania, Doug Mastriano, a state senator who leads the polls going into Tuesday's GOP gubernatorial primary, is emblematic of the rising intensity of Christian nationalism that has rooted itself firmly in the Republican Party.",
    "Biden endorsed Schrader, his first nod of the primary season, saying in a statement: We don't always agree, but when it has mattered most, Kurt has been there for me.?\nReturn to menu\nIn Republican primaries, Trump voters seem to have long memories.",
    "Until recently, McIntosh would meet Trump at Mar-a-Lago to coordinate endorsements in Republican primaries and even urge others to leave races, and the Club for Growth backed up the decisions by spending millions of dollars on campaign ads.",
    "In May, with Little at a Republican Governors Association conference in Nashville, McGeachin used her temporary authority as acting governor to do something Little had refused to do: banning mask mandates in schools and public buildings.",
    "Now, it has divided further as the Club for Growth has doubled down by pumping millions into Tuesday's Pennsylvania primary to boost late-surging Kathy Barnette against Trump's candidate, physician and television personality Mehmet Oz.",
    "Among the marquee races is the GOP Senate primary in Pennsylvania, where Trump is all-in for celebrity turned politician Mehmet Oz, who faces insurgent conservative candidate Kathy Barnette and businessman David McCormick.",
    "The Charlotte native, who said he eventually wants to be president, transferred from North Carolina State University to Yale University because he thought the Ivy League would better prepare him for a political career.",
    "He called the latter an insider who absolutely sold us out to China? and hit Barnette over a proposal she made during her losing 2020 campaign for a U.S. House seat to erect a statue of the Obama family in Washington.",
    "While Greene praised him as the best person to come to Washington, D.C. and help us fight the good fight,? Hines has been criticized by his opponents of making a number of moves primarily out of political expediency.",
    "Dave and Josh write:\nTrump, who supports celebrity-turned-politician Mehmet Oz in the Republican primary, on Monday criticized insurgent candidate Kathy Barnette, alleging that she has not been fully scrutinized.",
    "Return to menu\nPennsylvania Attorney General Josh Shapiro (D), who is running for governor in his state, has stepped off the campaign trail because of a positive coronavirus test, he said in a tweet Tuesday.",
    "In Oregon, liberal leaders are trying to oust moderate Rep. Kurt Schrader, who had to apologize last year after comparing Trump's second impeachment to a lynching.?\nSen. Elizabeth Warren (D-Mass.)",
    "The only clue we have about Trump's reasoning is that McGeachin tried to remove coronavirus restrictions when Little left the state, only to have Little reverse the decision when he returned.",
    "More moderate Democrats like Rep. Conor Lamb and state Rep. Malcolm Kenyatta have tried and failed to cut into Fetterman's lead by arguing they're better suited to win in a general election.",
    "The Post's David Weigel and Josh Dawsey report that the developments underscored the chaotic finish to the Republican primary in one of the most closely watched Senate races in the country.",
    "She issued an executive order banning state officials from requiring vaccine passports?  or proof of vaccination  from employees and sought to ban employers from requiring vaccinations.",
    "State Sen. Doug Mastriano rose to prominence in 2020 by urging Pennsylvania state lawmakers to throw out election results, and he was subpoenaed by the congressional Jan. 6 committee.",
    "Return to menu\nWith the Democratic governor in Pennsylvania term-limited, Republicans have a good chance of winning back the governor's mansion in this all-important swing state.",
    "Finally, Simpson has angered conservatives in his district for supporting a compromise with environmentalists on a dam, according to David Wasserman of the Cook Political Report.",
    "As voters head to the polls in five states, President Biden is visiting Buffalo to meet with grieving families in the wake of Saturday's racist massacre that left 10 people dead.",
    "After Cawthorn alleged that D.C. leaders used cocaine and invited him to an orgy, top Republicans started actively supporting one of his challengers, state Sen. Chuck Edwards.",
    "Brad Little, is perhaps best known for seizing on Little's absences from the state to enact her own policy agenda  only to have her orders reversed by Little upon his return.",
    "Return to menu\nGOP congressional candidate Bo Hines hopes a number of high-profile endorsements will help him become the newest member of the House's most conservative wing.",
    "David McIntosh, head of the Club for Growth, used to fly on Air Force One, get personal shout-outs from Trump and boast to friends about his access to the former president.",
    "And while Idaho just passed a copycat law to Texas's controversial near-total abortion ban, McGeachin wants Idaho to go further by banning exceptions for incest or rape.",
    "Return to menu\nThe ranks of centrist Democrats are dwindling in Congress  especially this year, as the number of competitive districts plummets because of redistricting.",
    "Fetterman, a Bernie Sanders supporter who stumps in pro-Trump communities, has a distinctive style: He's six-foot-nine, bald and campaigns in a hoodie and gym shorts.",
    "But establishment Republicans are anxious over a far-right candidate who they think is too radical to win in a general election  and who is surging in the polls.",
    "McGeachin, who is backed by former president Donald Trump, has also promoted Trump's false claim that the 2020 election was stolen from him through voter fraud.",
    "Polls close in Kentucky at 7 p.m., in North Carolina at 7:30 p.m., in Pennsylvania at 8 p.m., in Idaho at 10 p.m. and in Oregon at 11 p.m. (all times Eastern).",
    "And months after announcing plans to run in North Carolina's 5th Congressional District, Hines decided to switch districts after Budd announced his Senate run.",
    "The governor's veto pen is the only thing protecting abortion rights in this state.?\nIt's Shapiro's centrist stance that makes him appealing to Anthony Faulk.",
    "Hopefully we get the most progressive candidate to win so that folks are motivated to come out and vote in the fall,? said Sergio Cea of the Senate race.",
    "North Carolina will provide another test of Trump's influence, as he backs scandal-tarnished Rep. Madison Cawthorn (R-N.C.) in a hotly contested primary.",
    "He campaigned in Nebraska for Charles Herbster, who has been accused of sexual assault and lost his primary last week to a more traditional candidate.",
    "But moderate Democrats fear that if she wins, Democrats will lose this seat  one of the rare congressional districts drawn to be more competitive.",
    "And that could mean trouble this year for longtime Rep. Mike Simpson (R), who is running for his 13th term in a Republican stronghold in Idaho.",
    "He claimed on a radio show that Trump asked him to run  while echoing the fraud claims of election-denying secretary of state candidates.",
    "Last night, after taking a precautionary test before heading to Johnstown and Pittsburgh, I tested positive for COVID-19,? Shapiro said.",
    "Libby will anchor coverage from The Washington Post newsroom, with reporting and analysis from an array of Post reporters and analysts.",
    "A former state legislator and business owner from Idaho Falls, McGeachin the first woman elected as Idaho lieutenant governor, in 2018.",
    "The Post presents at a Midterm Special Report with Libby Casey at 7:30 p.m. Eastern on Tuesday as results come in from primary races.",
    "I will not stand for cowardly RINO Republicans that seek to dismantle the America First' movement,? he said at Trump rally in April.",
    "That worries me.?\nReturn to menu\nTrump has backed TV doctor Mehmet Oz, skipping over former hedge fund manager David McCormick.",
    "Return to menu\nIt's extraordinarily difficult to beat a sitting governor, but former president Donald Trump is going to try.",
    "As the gubernatorial race goes, Cea said that he's voting, reluctantly, for Josh Shapiro  the only Democrat on the ticket.",
    "Trump also recorded a robocall in support of Oz that disparaged Barnette and another rival, businessman David McCormick.",
    "But he has received his share of criticisms from some who question his ties to the people he is competing to represent.",
    "Despite his reservations, Cea said it is crucial that a Democrat is elected in the fall to succeed term-limited Gov.",
    "Those factors combined could make Simpson one of a handful of members of Congress to lose their jobs in a primary.",
    "(In October), with Little visiting the U.S.-Mexico border in Texas, McGeachin again wielded her temporary powers.",
    "Trump took that away from us.?\nTo him, former president Donald Trump looms large in the Republican Senate race.",
    "The endorsements put two of the most influential forces in the GOP, Trump and the Club for Growth, at odds.",
    "To Cea, a 37-year-old community organizer and the son of Chilean immigrants, this could be either Lt. Gov.",
    "John Fetterman, said he will not attend a primary-night rally Tuesday after suffering a stroke last week.",
    "and other powerful liberals have backed a credible challenger, school board member Jamie McLeod-Skinner.",
    "Janice McGeachin, who is running in the state's Republican gubernatorial primary against incumbent Gov.",
    "On the Democratic side, Pennsylvania Attorney General Josh Shapiro will be the party's nominee.",
    "If you know anything about politics, you know you need to work across the aisle,? Faulk said.",
    "The move is both bold and surprising: Little has taken no public stand against Trump.",
    "Her clashes over covid policy served to elevate her political profile in the state.",
    "I think he can do that.?\nFaulk, 65, is a retired City Hall maintenance worker.",
    "Trump endorsed him in the final days of the primary, in a nine-person field.",
    "But Trump's riskier endorsement is for Rep. Madison Cawthorn's reelection.",
    "Shapiro is the state attorney general and part of the establishment.",
    "The Post's Michelle Boorstein reports that along with Florida Gov.",
    "So far, Trump's record in GOP gubernatorial primaries isn't good.",
    "I remember when politicians worked across the aisle,? he said.",
    "Roe versus Wade has made the stakes really clear,? Cea said.",
    "Trump has endorsed 27 candidates in Tuesday's primaries.",
    "Brad Little in today's Republican gubernatorial primary.",
    "(They already control both chambers of the legislature.)",
    "On the Democratic side, the leading contender, Lt. Gov.",
    "They see themselves in a spiritual battle with Satan.",
    "I'm going to throw down for whoever wins,? Cea said.",
    "People need to work together and stop fighting.",
    "Cawthorn's scandals seem to add up by the week.",
    "John Fetterman or state Rep. Malcolm Kenyatta.",
    "Mastriano also supports a total abortion ban.",
    "Attorney Bryan Smith is trying to unseat him.",
    "He knows how to keep them in line,? he said.",
    "Janice McGeachin, to challenge Idaho's No.",
    "Trump knows how to pull their chain.",
    "President Trump set forth an agenda.",
    "It was the America First' agenda.",
    "Return to menu\nIdaho Lt. Gov.",
    "Trump could lose here, too.",
    "He has endorsed Idaho's No.",
    "Tom Wolf (D).",
    "2, Lt. Gov.",
    "1, Gov."
  ]
}