{
  "id": 459,
  "mediaId": 43,
  "date": "2/18/2022 12:00:00 AM",
  "headline": "Daily Kos Elections Live Digest: 2/18",
  "image": "https://images.dailykos.com/images/673098/story_image/LiveDigestorange.png?1557167434",
  "link": "https://www.dailykos.com/story/2022/2/18/2079871/-Daily-Kos-Elections-Live-Digest-2-18",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2422,
    2422,
    2364,
    2364,
    1681,
    1681,
    1147,
    2213,
    2213,
    2069,
    2069,
    1832,
    1832,
    1931,
    1931,
    1147,
    75,
    75
  ],
  "sentences": [
    "Doug Ducey is still keeping everyone guessing about whether or not he'll launch a bid ahead of the April filing deadline, and Politico reports, Three people familiar with Ducey's thinking said he is unlikely to enter the crowded Republican Senate primary, but has still not completely ruled it out.?\n Friday, Feb 18, 2022  11:03:23 AM Pacific Standard Time  Jeff Singer\nOH-Sen: Former state party chair Jane Timken's new ad features her standing with photos of four of her opponents in the May Republican primary, all of whom are men (only state Sen. Matt Dolan isn't included), and saying, We all know guys who overcompensate for their inadequacies, and that description fits the guys in the Senate race to a T.? She then shows a photo of her grinning next to Donald Trump and proclaiming herself Well, I'm different.",
    "Mike DeWine in the May primary, which cleveland.com says will make him the only candidate with access to the state party's voter data, campaign services, field staff support, and bulk-mail permit, among other perks.?\n Friday, Feb 18, 2022  11:28:53 AM Pacific Standard Time  Jeff Singer\nPA-Gov, PA-06: The Philadelphia Inquirer's Jonathan Tamari tweets that a number of prominent Republicans are encouraging? Guy Ciarrocchi, who is the former president of the Chester County Chamber of Business and Industry, to drop out of the GOP primary for governor in favor of taking on Democratic Rep. Chrissy Houlahan.",
    "Friday, Feb 18, 2022  10:18:09 AM Pacific Standard Time  David Jarman\nNC Redistricting: A three-judge panel has until Feb. 23 to decide whether the new North Carolina congressional and legislative maps passed late on Thursday meets the standards the state Supreme Court set when it rejected the GOP's original plans as unlawful partisan gerrymanders? and ordered new ones, and as we'll discuss, the new congressional plan remains something of a Republican-friendly gerrymander while still creating several potential battlegrounds.",
    "Tamari adds, It's unclear how seriously Ciarrocchi is considering any move to a House campaign.?\n Friday, Feb 18, 2022  11:34:45 AM Pacific Standard Time  Jeff Singer\nTX-Gov: Climate Nexus, in partnership with climate change communication departments at Yale and George Mason University, has conducted a Texas survey that includes a general election question, and it finds Republican Gov.",
    "New York City Public Advocate Jumaane Williams took 12.5% even though Politico reports that he was actively working? to get the requisite quarter of the vote, while Rep. Tom Suozzi did not submit his name for consideration; both of Hochul's opponents can still qualify for the ballot as long as they turn in 15,000 valid signatures by the April 7 filing deadline.",
    "https://t.co/ashk8zvZCa\n Post Politics (@postpolitics) February 18, 2022\nFriday, Feb 18, 2022  8:30:41 AM Pacific Standard Time  Jeff Singer\nMN-01: Republican Rep. Jim Hagedorn, who was elected in 2018 to represent Minnesota's 1st Congressional District in the southern part of the state, died Friday at the age of 59 after a two-year battle with kidney cancer.",
    "Friday, Feb 18, 2022  12:18:25 PM Pacific Standard Time  Jeff Singer\nWY-AL: House Minority Leader Kevin McCarthy has joined Donald Trump in backing attorney Harriet Hageman's August primary challenge to Rep. Liz Cheney, who began the 117th Congress as the third-ranking Republican in the leadership but was ousted months after she voted for impeachment.",
    "It's extremely rare for a party leader to side against one of their own incumbents, and CNN says McCarthy reached this point after he convinced the nihilistic Freedom Caucus, whose support he'd need to become speaker, that it would be better to concentrate on denying Cheney renomination rather than ejecting her from the Republican conference.",
    "Friday, Feb 18, 2022  11:06:49 AM Pacific Standard Time  Jeff Singer\nAK-Gov: While a media report over the summer said that state Sen. Natasha von Imhof was considering an intra-party challenge to Republican incumbent Mike Dunleavy, she said Tuesday that she wouldn't run for anything, including re-election, in 2022.",
    "Hagedorn's constituency used to be very competitive territory in presidential elections, but Donald Trump carried it 54-44 in 2020 as Hagedorn was winning re-election by a considerably smaller 49-46 spread; the special election will be held under the congressional lines that have been in place for a decade.",
    "There is the light-blue 1st in eastern North Carolina where Rep. G.K. Butterfield is retiring, which joins towns like Greenville, Rocky Mount, and Wilson and would have favored Biden 53-46; this district has the highest African American percentage in the state, though it still has a 49-42 white plurality.",
    "Friday, Feb 18, 2022  12:05:24 PM Pacific Standard Time  Jeff Singer\nTX-34: Army veteran Ruben Ramirez has earned an endorsement from Rep. Vicente Gonzalez, who represents over two-thirds of this new constituency but is running in the neighboring 34th District, in the March 1 Democratic primary.",
    "However, this map has a surprisingly high number of competitive seats: In an especially good Democratic year, this could potentially turn into a map where each party holds seven districtsor, if absolutely every card gets played right, an outright eight-to-six Democratic majority.",
    "Based on Dave's Redistricting App data for the newly-passed map, Democrats start with three very safe Democratic seats: Deborah Ross' 2nd District in Raleigh; the open 4th in Durham and Chapel Hill, where David Price is not seeking re-election; and Alma Adams's 12th in Charlotte.",
    "Friday, Feb 18, 2022  11:40:08 AM Pacific Standard Time  Jeff Singer\nIL-15: The Illinois Farm Bureau has endorsed Republican Rep. Rodney Davis in this sprawling rural seat even though fellow Rep. Mary Miller, his opponent in the June incumbent vs. incumbent primary, is a farmer.",
    "However, while this 50-48 Obama district looked competitive in paper, especially as Team Blue's fortunes continued to suffer nationwide, national Republicans showed little interest in aiding the underfunded Hagedorn against Walz, who had proven to be a strong vote-getter.",
    "In another case, they sought to shore up Senate President Dominick Ruggerio, a reactionary who has stymied many progressive priorities, against another bid from nurse Lenny Cioe, who held him to a 55-45 win in the 2020 primary, by stripping out turf where Cioe did well.",
    "The Minnesota Reformer first reported that Hagedorn used $110,000 in taxpayer money to pay a company owned by one of his staffers to print constituent mailers, and that his office had also given $340,000 to another firm called Abernathy West for a similar job.",
    "The Minnesota Reformer writes that state law requires that a special general election take place Aug. 9, which is the same day as the statewide primary, for the remaining months of Hagedorn's term, with a special primary occurring 11 weeks prior on May 24.",
    "Friday, Feb 18, 2022  11:51:36 AM Pacific Standard Time  Jeff Singer\nTX-08: The Congressional Leadership Fund is spending what Fox says is $600,000 on its first-ever TV ad campaign in a Republican primary in support of Navy SEAL veteran Morgan Luttrell.",
    "Friday, Feb 18, 2022  11:45:06 AM Pacific Standard Time  Jeff Singer\nMI-10: Macomb County Judge Carl Marlinga said Thursday that he would step down from the bench in a few weeks as he considers a bid for the Democratic nomination in this open seat.",
    "A recent poll from local firm Target Insyght gave Marlinga a 48-45 lead over Army veteran John James, who was the GOP's two-time Senate candidate, in a hypothetical general election, which is almost the same as the 46-43 edge it found last month.",
    "Kathy Hochul won 86% of the weighted vote at Thursday's state Democratic convention, which both got her the party endorsement and prevented any of her opponents from taking the 25% needed to earn an automatic place on the June primary ballot.",
    "The Republican's allies ran one of the most xenophobic campaigns of the cycle against the Democrat, and the NRCC ran anti-Semitic ad after anti-Semitic ad tying Feehan, who is not Jewish, to philanthropist and Holocaust survivor George Soros.",
    "This area, which is home to a large working class white electorate, proved to be very amenable to Trump, though, and his coattails were almost enough to put Hagedorn over the top: Trump carried the 1st 53-38, and Walz only won 50.3-49.7.",
    "That leaves one other member of the Democratic caucus: Kathy Manning, who will most likely run in the new 6th District, which covers Greensboro but also rural areas to its south, and would have gone for Trump by a tiny 49.4-49.2.",
    "The other remaining Republicans all keep their dark-red districts: Greg Murphy in the 3rd; Virginia Foxx in the 5th; Richard Hudson in the 8th; Dan Bishop in the 9th; Patrick McHenry in the 10th; and Madison Cawthorn in the 11th.",
    "He ended his campaign before the primary, though, when he failed to secure the party endorsement at GOP District Convention, which marked the end of the first of what would be three unsuccessful bids for the House.",
    "Hagedorn was the son of Tom Hagedorn, who was elected to the House himself in 1974 and lost in 1982, and he got his start in 1984 working as a congressional aide for another Minnesota Republican, Arlan Stangeland.",
    "The commercial, which goes on to praise Luttrell as a pro-Trump conservative who will crush the woke mob,? does not mention political operative Christian Collins, his main intra-party rival in the March 1 contest.",
    "Republican Rep. David Rouzer represents just over half this new seat, but since he's never had to win in turf this blue, it's possible he'll instead barge into the adjacent 13th in Raleigh's southern suburbs.",
    "Democrats currently control only five of the state's 13 congressional districts, and even with the state gaining a 14th seat, a bad midterm could leave Team Blue with even fewer members than they have now.",
    "The GOP originally tried to make this seat much more vulnerable to a pickup: Biden won the old 1st 54-45, while the now-defunct GOP map (which renumbered this the 2nd District) dropped his margin to 51-48.",
    "Hagedorn, after stints in the Treasury Department and Bureau of Engraving and Printing, decided to run for Congress himself for the first time in the 2010 cycle against Democratic Rep. Tim Walz.",
    "Plenty of Republicans were still unhappy with their two-time nominee (the conservative Washington Examiner published an op-ed titled, \"Jim Hagedorn: The worst Republican candidate in America?",
    "As we've noted before, though, lawmakers did seek to protect a number of conservative Democrats from progressive opponents by drawing those challengers out of the districts they were seeking.",
    "Hagedorn tried again in 2014, and while he again dropped out after losing the endorsement again, this time he got back in and went on to defeat businessman Aaron Miller 54-46 in the primary.",
    "Feehan sought a rematch for 2020, and Democrats were encouraged by polls showing Biden in position to return this district to the blue corner and by bad headlines for the new congressman.",
    "Hagedorn quickly announced his fourth bid, and his prospects improved after Walz decided to launch what turned out to be a successful campaign for governor rather than seek re-election.",
    "Friday, Feb 18, 2022  11:37:34 AM Pacific Standard Time  Jeff Singer\nWI-Gov: Republican Tommy Thompson says he'll decide by the end of April whether he'll run against Democratic Gov.",
    "Two Republicans have announced bids here: former Rep. Renee Elmers and former North Carolina State University football player Bo Hines, who has the backing of the Club for Growth.",
    "The House Ethics Committee announced last year that it was probing Hagedorn, and the investigation appeared to be related to the stories that broke during his last campaign.",
    "The new 7th, which he would have won 49.4-49.0, joins together the odd combination of coastal college town/resort town Wilmington and inland military outpost Fayetteville.",
    "And weeks before Election Day, Politico brought the bizarre story detailing how Hagedorn hadn't paid rent on a mysterious office whose owner said didn't actually exist.",
    "Friday, Feb 18, 2022  11:26:04 AM Pacific Standard Time  Jeff Singer\nOH-Gov: The Ohio Republican Party's state central committee voted 36-26 on Friday to endorse Gov.",
    "The incumbent raised $2 million in the final three months of 2021a quarterly haul that few other members have ever hit anywherewhile Hageman brought in $443,000.",
    "Ramirez campaigned for the old 15th District when it was last open in 2016 but took only 6% of the vote in the primary that was ultimately won by Gonzalez.",
    "Make that 10 after we send Morgan Luttrell to Congress.? (Yes, the GOP leadership's super PAC is really likening serving in Congress to serving in war.)",
    "Hagedorn's general election opponent for 2018 was Army veteran Dan Feehan, and this time, both parties quickly identified this as a major battleground.",
    "The unaccounted-for Republican member is Senate candidate Ted Budd, who would have been double-bunked with Hudson had he instead run for re-election.",
    "Hagedorn had to run in a hostile national political climate, but this time, the area's move to the right was enough to give him a 50.1-49.7 victory.",
    "The final competitive district is the new 14th, which includes Gastonia and Charlotte's western suburbs and would have supported Trump 49.4-49.1.",
    "However, while Hagedorn did run behind the top of the ticket, Trump's 54-44 win here was enough to get the incumbent to a 49-46 victory.",
    "There's no Republican incumbent, and state House Speaker Tim Moore would likely run here if he seeks a promotion to Congress in 2022.",
    "Manning, for her part, said Friday she'd wait for the courts to rule on the constitutionality of the map before making any decisions.",
    "Hagedorn launched another campaign the next cycle, but major donors and outside groups once again believed that Walz was secure.",
    "It didn't help the challenger when his old offensive writings began to circulate (in one 2002 post, he labeled Washington Sens.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "The 13th has no incumbent running there, though unfortunately for Rouzer, it's still potentially competitive at 50-48 Trump.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Dan McKee has signed the new congressional and legislative lines, which make minimal changes to the U.S. House map.",
    "The horserace numbers came after a series of questions about energy and last year's devastating power outage.",
    "\"), but he defeated state Sen. Carla Nelson first at the party convention and then 60-32 in the primary.",
    "Friday, Feb 18, 2022  10:52:51 AM Pacific Standard Time  Jeff Singer\nRI Redistricting: Democratic Gov.",
    "I'm the MAGA conservative with a backbone.? Her team tells Fox the spot is part of a six-figure buy.",
    "No serious Democrats, though, had shown any public interest in taking on the congressman this cycle.",
    "Welcome to the Daily Kos Elections Live Digest, your liveblog of all of today's campaign news.",
    "Patty Murray and Maria Cantwell undeserving bimbos in tennis shoes?), and he soon lost 54-46.",
    "Cheney also ended last year with a lopsided $4.7 million to $381,000 cash-on-hand advantage.",
    "Please note: The Live Digest is a 2016 and 2020 Democratic presidential primary-free space.",
    "Sign up here to receive the Daily Kos Elections Morning Digest in your inbox each weekday.",
    "The narrator says the candidate [f]ought bravely in two of them nine combat deployments.",
    "The governor also picked up an endorsement from Hillary Clinton at that same event.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Finally, there is one other district that Biden would have carried, but only just.",
    "Friday, Feb 18, 2022  11:16:31 AM Pacific Standard Time  Jeff Singer\nNY-Gov: Gov.",
    "Friday, Feb 18, 2022  10:54:51 AM Pacific Standard Time  Jeff Singer\nAZ-Sen: Gov.",
    "If Cheney loses this summer, though, it won't be because of a lack of money.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Tony Evers to reclaim the office he gave up over 20 years ago.",
    "It's also a place to discuss elections, not policy.",
    "He had been receiving treatment for kidney cancer.",
    "Greg Abbott leading Democrat Beto O'Rourke 45-40.",
    "MN-01:\nx\nRep. Jim Hagedorn (R-Minn.) dies at 59.",
    "This is a short blurb about Daily Kos.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it.",
    "Sens."
  ]
}