{
  "id": 504,
  "mediaId": 43,
  "date": "2/13/2022 12:00:00 AM",
  "headline": "North Carolina Open Thread: McCrory love story, Lumber River, Book banning, Redistricting, Cawthorn",
  "image": "https://images.dailykos.com/images/1037561/story_image/DKMcRoryvalentine.jpg?1644767156",
  "link": "https://www.dailykos.com/story/2022/2/13/2080100/-North-Carolina-Open-Thread-McCrory-love-story-Lumber-River-Book-banning-Redistricting-Cawthorn",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1248,
    1248,
    1404,
    1404,
    2214,
    2214,
    1878,
    1878,
    2087,
    2087,
    571,
    461,
    461,
    571,
    2885,
    2885,
    2834,
    2834
  ],
  "sentences": [
    "Book banning battles hit North Carolina schools\nNC Policy Watch, Greg Childress, 2/10/2022\nParents of sixth graders in a gifted language-arts class at Marvin Ridge Middle School received an email from their children's teacher last month warning them that a book selected for the class's unit on African American literature would at times be uncomfortable.?\nThe teacher at the Union County school, Cason Treharn, was confident, however, that her academically advanced students were mature enough to handle Melba Pattillo Beals's autobiographical account of the Little Rock Nine's integration of Central High School in Arkansas in 1957.",
    "https://t.co/09DGDndoBE\n Marc E. Elias (@marceelias) February 8, 2022\nNorth Carolina elections board says it has power to disqualify Rep. Cawthorn from running over January 6\nCNN, Marshall Cohen and Ethan Cohen, 2/9/2022\nThe North Carolina State Board of Elections said on Monday that it has the power to block GOP Rep. Madison Cawthorn from running for reelection over his role in the January 6 insurrection -- an open legal question at the center of liberal-backed efforts to disqualify him from future office.",
    "These school districts need to be put on notice, and I really do want them to be listening to us right now.?\n Madison Cawthorn\nMadison Cawthorn ripped for 'egging on' MAGA rioters: 'Real consequences could be on the horizon'\nRaew Story, Mark Chapman, 2/10/2022\nOn Thursday, the St. Louis Post-Dispatch editorial board tore into Rep. Madison Cawthorn (R-NC) for his role in encouraging the January 6 attack on the U.S. Capitol  and analyzed the legal case that could block him from running for office again.",
    "NC's Rep. Ted Budd: Jan. 6 committee is in the way of freedom-loving Americans'\nNews&Observer, DANIELLE BATTAGLIA, 2/12/2022\nU.S. Rep. Ted Budd called his House colleagues Liz Cheney and Adam Kinzinger divisive? Wednesday and said their work on the Jan. 6 committee is getting in the way of freedom-loving Americans.? His comments came during a segment on a conservative talk radio show about whether President Joe Biden is using a back-door plan to influence elections.",
    "Winston-Salem fertilizer fire reveals regulatory loopholes, spurs hard questions about building and workplace safety\nNC Policy Watch, Lisa Sorg, 2/8/2022\nOwners of the Weaver Fertilizer plant in Winston-Salem failed to submit a required chemical inventory to the NC Department of Public Safety in 2020, a key piece of information for state and local emergency officials  and a symptom of the lack of oversight of facilities nationwide that handle ammonium nitrate.",
    "Legal notice alleges Active Energy discharging PFAS into Lumber River; Commerce Dept concerned over wood pellet company viability\nNC Policy Watch, Lisa Sorg, 2/11/2022\nActive Energy Renewable Power, a wood pellet company beset by regulatory, legal, and operational troubles, is allegedly discharging high levels of toxic PFAS into the Lumber River, a drinking water supply for 25,000 people in Robeson County.",
    "'This is only going to lead to one place': Madison Cawthorn foreshadows violence over ballot disqualification\nRaw Story, David Edwards, 2/9/2022\nRep. Madison Cawthorn (R-NC) warned officials in North Carolina that they could face \"dangerous\" consequences if he is removed from the ballot for his role in inciting a failed insurrection on Jan. 6, 2021.",
    "x\nx\nMadison Cawthorn is having a bad week\nNew Civil rights Movement, David Badash, 2/8/2022\nToday news broke that the North Carolina State Board of Elections filed a motion Monday declaring it indeed does have the legal authority to determine if candidates should be disqualified for violations of the Fourteenth Amendment (more on that in a moment).",
    "Valentine-themed attack ad in US Senate race will interrupt NC's Bachelor' night\nNews&Observer, DANIELLE BATTAGLIA and FRANCESCA CHAMBERS, 2/11/2022\nTed Budd wants the final rose in his primary campaign for U.S. Senate, and a political group that's pumping millions into his bid is launching a Valentine's Day attack ad to help him win it.",
    "When it comes to gerrymandering, there simply must be a limit\nNC Policy Watch, Bob Schofield, 2/8/2022\nLast week, the North Carolina Supreme Court struck down as unconstitutional the most recent batch of egregiously gerrymandered legislative and congressional maps fashioned by Republican majorities at the General Assembly.",
    "NC Senate hopeful tweets in Waffle House, and gets covered and smothered on social media\nNews&Observer, DANIELLE BATTAGLIA, 2/5/2022\nSome are calling it Wafflegate?: A seemingly innocent tweet about breakfast food that led to a social media firestorm reminiscent of a past North Carolina Senate campaign dining controversy.",
    "Cawthorn is currently suing to challenge the power of the North Carolina Board of Elections, which is being asked by voters in the district to bar him from running under the 14th Amendment, which states that people who have \"given aid or comfort to the enemies\" of the United States is ineligible for office.",
    "https://www.newsobserver.com/news/politics-government/article258138283.html\nTIMELINE: The fight over North Carolina's district lines\nWLOS, Staff, 2/8/2022\nNOV. 4, 2021 - Asheville and much of far Western North Carolina will now be included in the newly created 14th Congressional District.",
    "Numbers below listed on 2/13/22\nUSA\n NC\nTotal\n Cases\nNew\n Cases\nTotal\n Deaths\nNew\n Deaths\nTotal\n Recovered\nActive\n Cases\n2-13-22 2,525,734 21,665 2,313,159 190,910\n Track NC Covid Data Track NC Vaccine Data\nPlease jump the fold for links to stories I hope you find interesting and useful.",
    "News&Observer, T. KEUNG HUI, 2/11/2022\nA legal strategy promoted by a QAnon supporter is being used by some parents across North Carolina and the United States to try to force school districts to end face mask mandates and to remove books the parents say are obscene.",
    "It was an ugly time in America but also a seminal moment in the struggle for civil rights, coming as it did in the aftermath of Brown v. Board of Education, the landmark U.S. Supreme Court ruling that deemed separate but equal? schools unconstitutional.",
    "x\n\"No person shall be a Senator or Representative in Congress,...who, having previously taken an oath, as a member of Congress...to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same.\"",
    "The court found that the maps were unconstitutional because of the way the lines minimized the influence of Democratic voters, notably by guaranteeing Republicans would likely still win large majorities even if most voters voted for Democrats.",
    "Active Energy did not produce the PFAS, also known as perfluorinated and polyfluoroalkyl compounds, but SELC alleges that the company has run afoul of the Clean Water Act, since 2019, when it purchased the property on Alamac Road in Lumberton.",
    "The Bonds For the Win website tells parents they can threaten to file surety bond claims? against school board members and superintendents accusing them of violating multiple laws unless they make changes such as drop mask requirements.",
    "Their argument revolves around the little-used \"disqualification clause\" of the US Constitution, which was ratified after the Civil War to prevent Confederate officials and those who supported \"insurrection\" from returning to office.",
    "We hope this weekly platform gives readers interested in North Carolina politics a place to share their knowledge, insight and inspiration as we work on taking back our state from some of the most extreme Republicans in the nation.",
    "About the same time that news broke, Senate Republican Minority Leader Mitch McConnell broke with Donald Trump and almost the entire Republican Party, declaring January 6 was a violent insurrection?  yes, he used those very words.",
    "\"Increasing numbers of Republicans are joining Democrats in Congress condemning last week's Republican National Committee statement defending the Jan. 6, 2021, insurrection as 'legitimate political discourse,'\" wrote the board.",
    "Filed on Feb. 2, 2009, by a group that included current Senate President Pro Tem Phil Berger, Senate Bill 25 would have asked North Carolina voters to approve the establishment of an independent redistricting commission.",
    "But at the same time, they're contemplating appealing their loss in a nationally watched gerrymandering at the state Supreme Court to the only court that could overturn the ruling  the U.S. Supreme Court.",
    "Colorado: Mondays, 7:00 PM Mountain\n Michigan: Wednesdays, 6:00 PM Eastern\n North Carolina: Sundays, 1:00 PM Eastern\n Missouri: Wednesday Evenings\n Kansas: Monday Evenings\nSomething you want to highlight?",
    "It complicates matters that the court hasn't given exact details on their ruling to help determine what a fair map is, Moore said, but he and other legislative leaders are hoping for those details soon.",
    "NC HOUSE SPEAKER BELIEVES CAWTHORN MAKES VALID POINT IN LAWSUIT (Of course he does)\nNC STATE BOARD OF ELECTIONS SAYS CHALLENGE TO REP. CAWTHORN'S CANDIDACY SHOULD PROCEED\nx\nPierce has Cawthorn's number.",
    "Madison Cawthorn has constitutional right to run for office, attorney says\nWLOS, Staff, 2/10/2022\nCongressman Madison Cawthorn isn't talking about the challenge to his candidacy, but his attorney is.",
    "Cawthorn's opponents have pushed for the congressman to be disqualified by the NC Board of Elections based on an \"insurrection\" clause that was added to the U.S. Constitution following the Civil War.",
    "We have people all over the world obtaining these bonds, all over the world,? Miki Klann, who helped create Bonds For the Win, said in a January YouTube video highlighting efforts in North Carolina.",
    "Whether Weaver Fertilizer is also required to file an emergency response plan hinges on that inventory, according to Keith Acree, public information officer with the NC Department of Public Safety.",
    "Unfortunately, Democrats who then ran both houses of the General Assembly, could not get their act together to take up the legislation and they have been regretting that decision ever since.",
    "It happened the moment Republican U.S. Senate candidate Mark Walker made the decision around 10 p.m. Thursday to walk into a Waffle House at an undisclosed location, order and take a photo.",
    "The bipartisan election board made the assertion in a court filing in a case Cawthorn brought against the board, hoping to shut down the constitutional challenge to his candidacy.",
    "National Review covered the awkward embrace, writing that Biden pulled the then-governor into the hug because Biden was insecure that McCrory wouldn't give him so much as a smile.",
    "(Photo credit: North Carolina Legislature)\nAfter North Carolina's Supreme Court struck down newly drawn district lines, candidates and voters are left to wonder -- What's next?",
    "\"That's the reason we have filed a suit in federal court to enjoin this unconstitutional effort to, really, undermine democracy by preventing people from running for office.\"",
    "JAN. 19, 2022  North Carolina House and Senate vote to delay 2022 primary election a second time to June 7 to allow time to react to a Supreme Court decision on the maps.",
    "\"States have long enforced age and residency requirements, without question and with very few if any legal challenges,\" the Board of Elections wrote in a court filing.",
    "The Clean Water Act prohibits facility owners from discharging any pollutants  including PFAS  from their property into rivers and streams without a federal permit.",
    "After the GOP swept to power in the 2010 wave election, it seized control of the map drawing process and has clung tenaciously and hypocritically to it ever since.",
    "Previous property owners, including a dry cleaning facility and a textile plant, left behind large plumes of groundwater contamination that could be the source.",
    "Find someone who loves you as much as Pat McCrory loves liberals,? the ad's narrator declares to a visual of McCrory backslapping former President Barack Obama.",
    "The agency has not actually determined Cawthorn is ineligible, and this would be an unprecedented step  but, argued the editorial board, this would have merit.",
    "The risk of explosion was so great that Winston-Salem officials asked people to evacuate within a mile radius, temporarily displacing 6,000 residents.",
    "@JudgeBobOrr https://t.co/0dVJIf2TzI\n TheseKeystrokesKillFascists (@Agt00Soul) February 11, 2022\nx\nAs a candidate for #NC14 , I was present that day.",
    "LOOKING AHEAD\nFEB. 18, 2022  New district maps must be redrawn by 5 p.m.\nFEB. 23, 2022  Deadline for courts to make a decision on newly drawn maps.",
    "\"Exasperation and frustration are growing on both sides of the aisle over the lack of accountability for lawmakers who cheered on the insurrection.",
    "Thirteen years ago this month, Republican senators introduced a bill that would have easily prevented the necessity of such a controversial ruling.",
    "His friendly hello to Obama is from the former president's Jan. 15, 2014 visit to North Carolina to tour a Raleigh-based manufacturing institute.",
    "Beals was one of nine Black students who stared down angry mobs of white racists and segregationists to attend the previously all-white school.",
    "\"The State has the same authority to police which candidates should or should not be disqualified per Section 3 of the Fourteenth Amendment.\"",
    "EXTREME SUPREME COURT\nBlueNC, 2/8/2022\nNorth Carolina lawmakers will start redrawing new political maps quickly, possibly even this week.",
    "A screenshot from a Club for Growth ad attacking U.S. Senate candidate Pat McCrory that will run during The Bachelor? on ABC on Feb. 14.",
    "pic.twitter.com/VeMBy8qIcp\n Travis Fain (@TravisFain) February 4, 2022\nA new strategy is being used to try to end school mask mandates.",
    "But they don't all agree with what Senate Minority Leader Mitch McConnell said about Jan. 6, which Budd was asked about on Wednesday.",
    "Twitter: @randallt\nPOSTED Covid data 2/13/2022 1:00pm EDT\nClick here for Covid-19 data from Worldometer Real Time World Statistics.",
    "DEC. 6, 2021  A legal challenge to North Carolina's new district maps halts candidate filing, which was scheduled to begin at noon.",
    "The board also said it has the power to disqualify candidates based on constitutional considerations, not just based on state laws.",
    "All four have said they do not support the violence that occurred when a mob of pro-Trump supporters stormed into the Capitol.",
    "A group of voters claims the congressman violated part of the 14th Amendment, saying he took part in the Jan. 6 insurrection.",
    "This approach has been used in multiple states, including in North Carolina in Catawba, Iredell, Johnston and Wake counties.",
    "Budd is currently seeking North Carolina's open U.S. Senate seat in the 2022 election and is facing off against former Gov.",
    "The students were taunted by classmates and their parents, threatened by mobs and attacked with lighted sticks of dynamite.",
    "NORTH CAROLINA OPEN THREAD Sunday, February 13, 2022\n352nd Weekly Edition\nThis is a weekly feature of North Carolina Blue.",
    "Cawthorn, who has denied any wrongdoing regarding January 6, filed a federal lawsuit last week to shut down the challenge.",
    "FEB. 4, 2022  Supreme Court rules 4-3 against the new district maps, saying they violated the North Carolina Constitution.",
    "The history of the site, led us to be concerned about possible discharges? of PFAS, said SELC attorney Heather Hillaker.",
    "If you are interested in starting your own state blog, weekly to occasionally, we'll be sure your work is listed here.",
    "The claims were detailed in a Notice of Intent to Sue? sent to the company by the Southern Environmental Law Center.",
    "Without the chemical inventory, it's unknown if an emergency response plan is required,? Acree wrote in an email.",
    "JAN. 3, 2022  A trial begins to determine if North Carolina's new district maps violate the state's constitution.",
    "But as of Monday afternoon there was still no detailed opinion with guidance on how better maps should be drawn.",
    "It happened in July 2014 during the National Governors Association meeting, where Biden was a guest speaker.",
    "Pat McCrory to President Joe Biden and other liberal leaders during The Bachelor? on ABC on Monday evening.",
    "The company is also allegedly discharging the compounds into Jacob Branch, a tributary of the Lumber River.",
    "pic.twitter.com/eEvFbnKLBY\n Wendy Nevarez (@WendyforWNC) February 10, 2022\nThanks again, have a good week!",
    "FEB. 2, 2022  North Carolina Supreme Court hears arguments from both sides of the district maps lawsuit.",
    "Nearly 600 tons of ammonium nitrate caught fire at the Weaver plant on Jan. 31 and burned for four days.",
    "Active Energy's outdated permit does not include PFAS in the list of pollutants that can be discharged.",
    "Residents are now allowed back into their homes, although on Feb. 6, the ruins were still smoldering.",
    "And he missed that many North Carolinians wouldn't think to step into a Waffle House before midnight.",
    "Congressman or Senator if they have engaged in insurrection or rebellion against? the United States.",
    "The hug between McCrory and Biden is shown frequently in attack ads against the Senate candidate.",
    "Budd-backing conservative group Club for Growth plans to run an ad linking former Republican Gov.",
    "It seems all but certain that voters would have said yes? had the measure made it to the ballot.",
    "The elections board, in its court filing, said his lawsuit is premature and should be dismissed.",
    "NOV. 4, 2021  North Carolina legislature finalizes three new redistricting maps for the state.",
    "NOV. 10, 2021  Rep. Madison Cawthorn announces plans to run in another district, District 13.",
    "Here's a breakdown of the events that led to the ruling and what is scheduled to happen next.",
    "The 14th Amendment in part states that no one who has taken the oath of office can be a U.S.",
    "FEB. 24, 2022  Candidate filing for 2022 primary elections is set to resume, ending March 4.",
    "Challengers say the maps unfairly dilute the minority vote and heavily favor Republicans.",
    "And there was another issue: Walker wasn't holding a fork to eat his breakfast-dinner.",
    "Cawthorn appeared on Steve Bannon's War Room podcast on Wednesday and vowed to fight.",
    "Textiles treated with stain-, water- or grease-resistant coatings often contain PFAS.",
    "Pat McCrory, former U.S. Rep. Mark Walker and political newcomer Marjorie Eastman.",
    "McDowell, Polk and Rutherford counties have been moved to the 13th District.",
    "JAN 11, 2022  Three-judge panel rules in favor of the Republican-drawn maps.",
    "No, it was his order: A plate of beige-colored food and a hamburger patty.",
    "Did he forget to have them scrambled the way only Waffle House can do it?",
    "You can also join the discussion in four other weekly State Open Threads.",
    "MAY 17, 2022  North Carolina primary election scheduled to take place.",
    "The below clip is what happened directly before the bloodshed comment.",
    "McCrory greeted Obama at the airport and gave him a slap on the back.",
    "Roy Cooper vetoes plans to delay North Carolina's primaries to June.",
    "But his attorney James Bopp Jr. said it is a matter of free speech.",
    "Liberal activists filed the challenge to his candidacy last month.",
    "A portion of Watauga County will also now be in the 14th District.",
    "You have to understand that as a leader, or you simply aren't one.",
    "He repeated the complaint at least three times during his speech.",
    "The freedom of association is protected by the First Amendment.",
    "McCrory is also shown hugging Biden at the beginning of the ad.",
    "He was overdressed for the occasion, wearing a suit jacket.",
    "At long last, real consequences could be on the horizon.\"",
    "It protects the right to run for office,\" Bopp told CNN.",
    "McCrory's campaign declined to comment on the attack ad.",
    "x\nIs that a two egg omelet with  nothing else in it?",
    "Former President Donald Trump has endorsed Budd.",
    "I hope you have a safe week, the floor is yours.",
    "No one is quite sure what to make of the eggs.",
    "But that wasn't the part everyone focused on.",
    "kosmail or email at randalltdkos at gmail.",
    "Maybe maps that aren't 1000:1 outliers?",
    "NC'S REPUBLICAN LEGISLATORS PONDER U.S.",
    "Was it an omelet with nothing in it?",
    "It should not have been necessary.",
    "\"It's in the First Amendment.",
    "Toast, hash browns and eggs.",
    "Hash browns just scattered?",
    "Please join us every week.",
    "JAN. 6, 2022  Trial ends.",
    "Where is the hot sauce?",
    "He was holding a pen.",
    "People had questions.",
    "JAN. 28, 2022  Gov.",
    "It has QAnon ties.",
    "3, 14th Amendment.",
    "Or at least salt?",
    "A lot of them.",
    "Words matter!",
    "Sec."
  ]
}