{
  "id": 659,
  "mediaId": 238,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Opinion: A party that censures its defenders of the Constitution has lost its way",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/02/05/what-the-cheney-censure-tells-us-about-republican-party/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2303,
    1147,
    1248,
    1147,
    1248,
    2214,
    2214,
    2303,
    428,
    427,
    427,
    146,
    146,
    428,
    545,
    545
  ],
  "sentences": [
    "Cawthorn, by the way, is finding himself in an uncomfortable spot with regard to language that actually is contained in the third section of the 14th Amendment, which states that no one can serve in Congress who, having previously taken an oath, as a member of Congress  to support the Constitution of the United States, shall have engaged in insurrection or rebellion against the same.? Democrats in his home state have gone to the North Carolina State Board of Elections seeking to bar him from running for reelection, noting that he spoke at a pro-Trump rally that took place immediately before Trump supporters headed toward Capitol Hill.",
    "In a speech Friday to the Federalist Society near Orlando, Pence said Trump was wrong? to assert that the vice president had the legal authority to declare Trump the winner when electoral college votes were counted on Jan. 6. I had no right,\" Pence said, to overturn the election.?\nSen. Mitt Romney (R-Utah), who was the GOP's presidential standard-bearer in 2012, had the most apt description of how far Republicans have strayed from their principles as supposed constitutional conservatives.",
    "Even more shockingly, the RNC declared that the Jan. 6, 2021, attack on the U.S. Capitol that then-President Donald Trump unleashed was merely a situation in which ordinary citizens engaged in legitimate political discourse.?\nThe discourse? in question included threatening to hang those who were performing their constitutional duty to certify the electoral college count, trashing the building and smearing feces on the walls.",
    "As for the party's supposed values,? they are spelled out a bit later in the resolution: Winning back the majority in Congress, including the United States House of Representatives, in 2022 must be the primary goal of the House Republican Conference  and requires all Republicans working together to accomplish the same.?\nWell, at least that part of the resolution was clear.",
    "Honor attaches to Liz Cheney and Adam Kinzinger for seeking truth even when doing so comes at great personal cost.?\nNot mentioned in that tweet, however, was the name of the party in question or the fact that the RNC chairwoman who engineered the resolution was Romney's own niece Ronna McDaniel.",
    "The primary mission of the Republican Party is to elect Republicans who support the United States Constitution and share our values.?\nSo began the almost laughably hypocritical resolution with which the Republican National Committee on Friday censured Reps. Liz Cheney (R-Wyo.)",
    "Rep. Madison Cawthorn (R-N.C.) has argued, for instance, that you actually have a constitutionally protected right to free, unrestricted travel within the United States,? which would prevent airlines from requiring passengers to be vaccinated against the coronavirus.",
    "and Adam Kinzinger (R-Ill.)  who are among the all-too-few elected officials in their party standing up for the Constitution against a former president who was willing to overturn the result of a legitimate election and who continues to hold the party in his grip.",
    "With the RNC's resolution censuring Cheney and Kinzinger, and its embrace of the rioters who ransacked the halls of Congress at Trump's behest, the party has now formally cast its lot with those in its ranks who can no longer be dismissed as fringe actors.",
    "What doesn't seem to bother the self-proclaimed party of the Constitution? is the mounting evidence of how far Trump was willing to go to subvert the clear will of the American people as they expressed it at the ballot box in November 2020.",
    "The heresy committed by Cheney and Kinzinger, at least in the eyes of their party, has been their effort to get to the bottom of what happened leading up to and on the day that Trump supporters attempted to stage a coup at the Capitol.",
    "In the imaginations of those who currently animate the Republican base, the Constitution is written in erasable ink, and filled with fanciful language to suit the passions of the moment.",
    "There might be a way back for Republicans  to conservative principles, and to sanity  but having wandered this far, it is increasingly hard to imagine how they will find it.",
    "The two lawmakers have joined the select House committee investigating the insurrection, giving it a claim to being a bipartisan endeavor.",
    "Shame falls on a party that would censure persons of conscience, who seek truth in the face of vitriol,? he wrote on Twitter.",
    "How he entertained a proposal to have the Department of Homeland Security seize voting machines in swing states that he lost.",
    "How he claims that then-Vice President Mike Pence could and should have rejected the electoral college vote tally.",
    "How he says he will consider pardoning the Jan. 6 rioters if he gets back into the Oval Office.",
    "How he continues to foment the lie that the election was tainted by massive voter fraud.",
    "The Constitution, of course, contains no such right, or anything approximating it.",
    "The only thing Republicans believe they should care about is regaining power.",
    "Which is perhaps the best argument for why they shouldn't.",
    "But Cawthorn and his ilk are not outliers."
  ]
}