{
  "id": 97,
  "mediaId": 195,
  "date": "5/5/2022 12:00:00 AM",
  "headline": "Cawthorn ramps up defense as crass videos add to mountain of bad press",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2022/04/cawthornmadison_102721gn_lead.jpg?strip=1&w=640",
  "link": "https://thehill.com/news/house/3479047-cawthorn-ramps-up-defense-as-crass-videos-add-to-mountain-of-bad-press/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Emily Brooks",
  "authorUrl": "https://thehill.com/author/emily-brooks/",
  "termIds": [
    641,
    821,
    1201,
    1501,
    1605,
    1609,
    1943,
    2091,
    2303,
    2341,
    3094,
    2590
  ],
  "sentences": [
    "I don't want to waste my time fighting the fake news media and every single narrative they put out, but I feel that I am honor-bound to dispel some of their lies.?\nHe lashed out at rival campaigns accusing him of wanting to cut Social Security and military spending by 33 percent, saying that misrepresents a portion of his New Contract with America? plan to cut government spending by a third.",
    "But Cawthorn did not address a number of statements that led to headlines and public rebukes from Republicans like House Minority Leader Kevin McCarthy (Calif.), including calling Ukrainian President Volodymyr Zelensky a thug,? claiming that he had been invited to an orgy in Washington and seeing those who advocate against addiction doing key bumps of cocaine.?\nThis is unacceptable.",
    "And he denied having insider knowledge by promoting a Let's Go Brandon? cryptocurrency, calling claims reported in the Washington Examiner shallow.?\nA video showing him being suggestive with a distant relative, who is also his congressional office scheduler, was just stupid locker room talk between two cousins that grew up like brothers,? Cawthorn said.",
    "We have to protect the seat with a strong America first candidate, and Madison has put this seat in great risk.?\nDemocrats hoping to challenge Cawthorn in the general election include Jasmine Beach-Ferrara, an LGBTQ activist and county commissioner, and auto repair shop owner Katie Dean.",
    "Rep. Madison Cawthorn (R-N.C.) is speaking out more forcefully against a barrage of negative news stories about him as he tries to hang on to political life less than two weeks before a contentious primary vote with top Republicans in his state working against him.",
    "Woodhouse worries that having Cawthorn as the GOP nominee for North Carolina's 11th District would put it at risk of flipping to Democratic control, despite it tilting toward Republicans by about 14 points, according to FiveThirtyEight.",
    "I think these last few videos and pictures have been, for many people here, has just been the final straw,? said primary opponent Michele Woodhouse, a longtime Republican activist in the Western North Carolina district.",
    "Cawthorn, however, needs to win just 30 percent of the vote in a May 17 primary in order to avoid a runoff, putting him in a position to potentially keep his nominee status despite the negative press.",
    "But an anti-Cawthorn PAC's recent release of videos showing the 26-year-old first-term lawmaker engaging in suggestive and vulgar behavior has pushed him to be more vocal.",
    "An April 25-26 poll commissioned by the Republican GOPAC showed that Cawthorn had lost ground in his primary race, dropping from 49 percent in March to 38 percent.",
    "Cawthorn had largely avoided directly addressing allegations of insider trading, twice taking a loaded firearm to the airport, getting speeding tickets and more.",
    "One of the most recent high-profile examples of a member being forced out of office in connection with salacious images was former Rep. Katie Hill (D-Calif.).",
    "Hill, who was also a first-term lawmaker, resigned from office in 2019 amid allegations of having inappropriate sexual relationships with her staff members.",
    "Sen. Thom Tillis (R-N.C.) has endorsed another GOP challenger, state Sen. Chuck Edwards, who has knocked Cawthorn in ads for his frequent social media use.",
    "Cawthorn did acknowledge making some mistakes when he was ticketed for speeding and when he brought a loaded firearm to a TSA checkpoint  twice.",
    "You know, no one in Washington, D.C., is going to work with him on legislation.?\nCongressman Cawthorn takes no responsibility for his actions.",
    "Photos published by Politico showing him wearing lingerie, he said, were from a goofy game on a cruise ship? and taken before he took office.",
    "Honestly, I was told that I looked pretty good in these pictures, and I think there should be some bipartisan agreement on that,? he said.",
    "Last year, Trump endorsed Cawthorn's reelection bid to the seat, which was previously held by his White House chief of staff Mark Meadows.",
    "Before that, Cawthorn released a seven-minute, 41-second video directly addressing and brushing off a number of controversies.",
    "Edwards also has the backing of state Senate President Pro Tempore Phil Berger and state Senate Majority Whip Jim Perry.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "A video released Wednesday night in which Cawthorn could be seen nude was blackmail,? he tweeted, calling it years old.",
    "I'm sure that many of you still have questions that are reasonable,? Cawthorn said in the video posted Wednesday.",
    "Conservative commentator Meghan McCain pointed to a double standard for men, saying that Rep. Liz Cheney (R-Wyo.)",
    "He did not tell the truth.?\nThe consistent drip of negative information is fueling campaigns against him.",
    "The salacious videos have also put a spotlight on professional standards for House members.",
    "Cawthorn does have one very powerful Republican in his corner: former President Trump.",
    "The scandal was heightened by a messy divorce and the release of nude photos.",
    "And that's a character issue, and that's a maturity issue,? Woodhouse said.",
    "That's my bad, and I have to own that one,? he said of the TSA incident.",
    "It will affect every down-ballot race in this congressional district.",
    "His office did not respond to a request for comment for this story.",
    "We will lose the seat to a very liberal Democrat,? Woodhouse said.",
    "I was being crass with a friend, trying to be funny,? he said.",
    "Cawthorn spoke at a Trump rally in North Carolina last month.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "would be politically dead if a nude video of her circulated.",
    "I mean, we're talking about layers and layers of things.",
    "There's no evidence to this,? McCarthy said at the time.",
    "Long live the patriarchy,? McCain wrote on Twitter.",
    "So great Cawthorne [sic] wasn't born a woman!",
    "That's not becoming of a congressman.",
    "But hey, boys will be boys, right?",
    "Cawthorn said he forgot to disarm."
  ]
}