[
  {
    "id": 1907,
    "mediaId": 2537,
    "date": "2022-02-09",
    "sentence": "Rob Portman, Rep. Thomas Massie, the Republican from Garrison who represents Northern Kentucky, and Rep. <span class='selected-term'>Warren Davidson</span>, a Republican who represents Butler County just north of Cincinnati, responded with a statement.",
    "author": "Scott Wartman",
    "title": "Portman sides with McConnell against censure of Cheney, Kinzinger. Where local delegation stands on censure, Jan. 6 fights"
  },
  {
    "id": 12669,
    "mediaId": 8313,
    "date": "2022-03-03",
    "sentence": "Former Cincinnati City Councilman Phil Heimlich announced Thursday he will challenge U.S. Rep. <span class='selected-term'>Warren Davidson</span> in a Republican Primary.",
    "author": "Scott Wartman",
    "title": "Phil Heimlich to challenge Ohio's Rep. Warren Davidson for Congress; attacks Trump"
  },
  {
    "id": 9505,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "#DoNotComply https://twitter.com/MayorBowser/status/1480956796395216900\\u00a0\\u2026pic.twitter.com/pHeeNPVhlP\n— <span class='selected-term'>Warren Davidson</span> (@Warren Davidson) 1641984463\nHeimlich says, “I’m willing to follow Liz Cheney and Anthony Gonzalez, people like that who have stood up for what’s right.",
    "author": "Timothy Evans",
    "title": "His father helped save people from choking – now he is trying to save the GOP from Trump"
  },
  {
    "id": 5646,
    "mediaId": 2641,
    "date": "2022-04-11",
    "sentence": "While Democrats are complaining Republicans are seeking to pass legislation to keep public schools from teaching sex education to elementary school kids, Rep. <span class='selected-term'>Warren Davidson</span>, R-Ohio, told Newsmax it is \"mind blowing\" such laws are even needed.",
    "author": "Eric Mack",
    "title": "Rep. Warren Davidson to Newsmax: Calls for K-3 Sex Ed 'Mind Blowing'"
  },
  {
    "id": 6646,
    "mediaId": 8285,
    "date": "2022-04-15",
    "sentence": "Representatives, including Steve Chabot of Cincinnati and <span class='selected-term'>Warren Davidson</span> of West Chester, voted last year to overturn the results of a free and fair election for president.",
    "author": "Jim DeBrosse",
    "title": "The Chaos Theory Behind Ohio’s Redistricting Fiasco"
  }
]