[
  {
    "id": 3627,
    "mediaId": 8475,
    "date": "2022-01-17",
    "sentence": "Steve Gaynor and Karrin Taylor Robson are sitting on millions for their gubernatorial campaigns as they prepare to hit the airwaves, while <span class='selected-term'>Katie Hobbs</span> and Kari Lake offset strong fundraising numbers with big spending.",
    "author": "Jeremy Duda",
    "title": "As first campaign finance reports are filed, Arizona governor’s race comes into focus"
  },
  {
    "id": 3657,
    "mediaId": 2578,
    "date": "2022-01-19",
    "sentence": "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State <span class='selected-term'>Katie Hobbs</span> for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General Mark Brnovich for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "author": "Jordan Conradson",
    "title": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022"
  },
  {
    "id": 4263,
    "mediaId": 2748,
    "date": "2022-01-20",
    "sentence": "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State <span class='selected-term'>Katie Hobbs</span> for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General Mark Brnovich for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "author": "",
    "title": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022"
  },
  {
    "id": 3688,
    "mediaId": 8475,
    "date": "2022-01-21",
    "sentence": "Once she receives the maps, Secretary of State <span class='selected-term'>Katie Hobbs</span> will send them to the counties so election officials can update their voter registration information to incorporate the new districts.",
    "author": "Jeremy Duda",
    "title": "Arizona Redistricting Commission gives final certification to new election maps"
  },
  {
    "id": 3630,
    "mediaId": 2664,
    "date": "2022-01-24",
    "sentence": "Ducey appeared to have missed reports in Dec. 2020, Secretary of State <span class='selected-term'>Katie Hobbs</span> sent a cease-and-desist letter to the so-called sovereign citizens' group saying that the state requires people to get permission to \"use, display or otherwise employ any facsimile, copy, likeness, imitation or other resemblance\" to the state seal.",
    "author": "Sarah K. Burris",
    "title": "Arizona governor swears he never knew about the fake Trump electors despite Republican involvement"
  },
  {
    "id": 3920,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "",
    "author": "",
    "title": "Arizona bill would allow legislature to overturn election results"
  },
  {
    "id": 3548,
    "mediaId": 2664,
    "date": "2022-01-28",
    "sentence": "MSNBC's Rachel Maddow did not mince words when she criticized Arizona Attorney General Mark Brnovich (R) for his failure to look into the fake electors' scandal after the case was forwarded to his office from the Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Meaghan Ellis",
    "title": "Maddow lays out a damning timeline as she slams Arizona's attorney general for ignoring phony electors scandal"
  },
  {
    "id": 3023,
    "mediaId": 2512,
    "date": "2022-01-28",
    "sentence": "MSNBC's Rachel Maddow did not mince words when she criticized Arizona Attorney General Mark Brnovich (R) for his failure to look into the fake electors' scandal after the case was forwarded to his office from the Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Meaghan Ellis",
    "title": "Rachel Maddow slams Arizona AG for failure to deal with electors scandal"
  },
  {
    "id": 2888,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "In 2020, Secretary of State <span class='selected-term'>Katie Hobbs</span>—a Democrat—was Arizona's top \"vote counter.\"",
    "author": "",
    "title": "Now every day in Arizona is January 6"
  },
  {
    "id": 2797,
    "mediaId": 2578,
    "date": "2022-02-03",
    "sentence": "Unfortunately, it is likely that Arizona won’t get out of using ERIC as long as the current Secretary of State, <span class='selected-term'>Katie Hobbs</span>, is in office.",
    "author": "Joe Hoft",
    "title": "Representative Mark Finchem Calls for Arizona to End Participation in the Electronic Registration Information Center (ERIC) Like Louisiana Just Did"
  },
  {
    "id": 1980,
    "mediaId": 2748,
    "date": "2022-02-04",
    "sentence": "Unfortunately, it is likely that Arizona won’t get out of using ERIC as long as the current Secretary of State, <span class='selected-term'>Katie Hobbs</span>, is in office.",
    "author": "STATION GOSSIP",
    "title": "Representative Mark Finchem Calls for Arizona to End Participation in the Electronic Registration Information Center (ERIC) Like Louisiana Just Did"
  },
  {
    "id": 1969,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Doug Ducey refused to help him try to overturn his loss and election officials like Georgia Secretary of State Brad Raffensperger (a Republican) and Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> (a Democrat) repeatedly discredited his baseless claims of fraud.",
    "author": "Igor Derysh",
    "title": "More than 80 Trump truthers are aiming for a power grab"
  },
  {
    "id": 2078,
    "mediaId": 2512,
    "date": "2022-02-07",
    "sentence": "Doug Ducey refused to help him try to overturn his loss and election officials like Georgia Secretary of State Brad Raffensperger (a Republican) and Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> (a Democrat) repeatedly discredited his baseless claims of fraud.",
    "author": "",
    "title": "'Clear line for election subversion': More than 80 Trump-truther candidates are running for key state offices"
  },
  {
    "id": 1856,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "Brnovich announced Friday he had reached agreements with the State Bar of Arizona, which licenses and regulates attorneys, stemming from two ethics complaints filed against him and attorney general lawyers by Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat vying for her party’s gubernatorial nomination, and the Arizona Board of Regents.",
    "author": "Yvonne Wingett Sanchez",
    "title": "McGuire calls on Brnovich to release records related Bar complaints"
  },
  {
    "id": 1824,
    "mediaId": 8326,
    "date": "2022-02-08",
    "sentence": "Earlier on Monday, one of his rival candidates, former Arizona National Guard leader Mick McGuire, called on Brnovich to release records from the State Bar’s investigation of the complaints filed by Secretary of State <span class='selected-term'>Katie Hobbs</span> and the Arizona Board of Regents.",
    "author": "Laurie Roberts",
    "title": "AG Mark Brnovich wants to send troops to the border (and himself to the Senate)"
  },
  {
    "id": 2158,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "PHOENIX — Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> is suing Attorney General Mark Brnovich after he threatened to prosecute her if she temporarily shuts down for a required update to an online system that allows election candidates to collect the signatures they need to qualify for the ballot.",
    "author": "Bob Christie",
    "title": "Arizona elections chief sues AG over prosecution threat"
  },
  {
    "id": 1197,
    "mediaId": 2520,
    "date": "2022-02-13",
    "sentence": "Karrin Taylor Robson and Aaron Lieberman offer vague references to water on their websites, while Matt Salmon, <span class='selected-term'>Katie Hobbs</span> and Marco Lopez don’t mention it.",
    "author": "Joanna Allhands",
    "title": "What should Arizona governor and legislative candidates be saying about water?"
  },
  {
    "id": 1363,
    "mediaId": 2664,
    "date": "2022-02-14",
    "sentence": "The group, which called themselves 'the Sovereign Citizens of the State of Arizona,' never sought that permission, Secretary of State <span class='selected-term'>Katie Hobbs</span>' office said.\"",
    "author": "Bob Brigham",
    "title": "Trump's fake electors illegally used state seal — but GOP attorney general has done nothing: report"
  },
  {
    "id": 1647,
    "mediaId": 2662,
    "date": "2022-02-15",
    "sentence": "AZGOP Chairwoman Dr. Kelli Ward urges patriots to get involved and notify her if they aren’t accepted by radical leftist Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Jordan Conradson",
    "title": "Here’s an Opportunity to Participate: Arizona Secretary of State And Maricopa County HIRING NOW – Walk-In Interviews Tomorrow"
  },
  {
    "id": 100,
    "mediaId": 8475,
    "date": "2022-02-21",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span>, the Democratic frontrunner, called on the Senate to raise the limit and save K-12 schools from \"this manufactured funding crisis.\"",
    "author": "Jeremy Duda",
    "title": "No Republican candidates for Arizona governor are calling for school cuts to be stopped"
  },
  {
    "id": 718,
    "mediaId": 8428,
    "date": "2022-02-22",
    "sentence": "Republican Kari Lake, a former news anchor, is the only candidate who can defeat Democrat <span class='selected-term'>Katie Hobbs</span> in Arizona’s gubernatorial race this November, a new poll found.",
    "author": "Alex Caldwell",
    "title": "Kari Lake is the only Republican AHEAD of Dem. Katie Hobbs in Arizona governor’s race, new poll finds"
  },
  {
    "id": 282,
    "mediaId": 2520,
    "date": "2022-02-24",
    "sentence": "Karrin Taylor Robson, the other major GOP candidate for governor, and Democrat <span class='selected-term'>Katie Hobbs</span> have thus far been silent, which might have been a good strategy for Lake.",
    "author": "Laurie Roberts",
    "title": "No, Kari Lake, what is going on at the border isn't remotely like what is going on in Ukraine"
  },
  {
    "id": 646,
    "mediaId": 8475,
    "date": "2022-02-24",
    "sentence": "An attorney for Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> urged a judge Wednesday to stop state Attorney General Mark Brnovich from pursuing a criminal action against her for planning to take a candidate signature-gathering system offline for maintenance.",
    "author": "Michael McDaniel",
    "title": "Arizona secretary of state urges judge to halt AG prosecution threat over election system maintenance"
  },
  {
    "id": 119,
    "mediaId": 8475,
    "date": "2022-02-25",
    "sentence": "Local\nSecretary of State <span class='selected-term'>Katie Hobbs</span> will temporarily shut down Arizona's online signature-gathering portal for candidates next month, despite a judge's refusal to preemptively block Attorney General Mark Brnovich from taking legal action against her for it.",
    "author": "Jeremy Duda",
    "title": "Hobbs will shut down, update Az online election petitions after judge denies GOP court move"
  },
  {
    "id": 17048,
    "mediaId": 8345,
    "date": "2022-02-26",
    "sentence": "PHOENIX – A judge this week declined Secretary of State <span class='selected-term'>Katie Hobbs</span>' request for an order blocking Arizona's attorney general from prosecuting her if she temporarily shuts down a candidate signature portal for a required update.",
    "author": "Associated Press",
    "title": "Arizona judge declines Katie Hobbs’ request to block Brnovich threats"
  },
  {
    "id": 17065,
    "mediaId": 2641,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "",
    "title": "GOP Lawsuit Looks to Throw Out Absentee Voting in Arizona"
  },
  {
    "id": 17019,
    "mediaId": 2590,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona Republicans File Lawsuit To Throw Out Absentee Voting"
  },
  {
    "id": 17355,
    "mediaId": 8350,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "ASSOCIATED PRESS",
    "title": "GOP lawsuit looks to throw out absentee voting in Arizona"
  },
  {
    "id": 17268,
    "mediaId": 2746,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "Jonathan J. Cooper",
    "title": "Republicans file lawsuit to end vote-by-mail absentee voting in Arizona"
  },
  {
    "id": 17216,
    "mediaId": 2594,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "Via AP news wire",
    "title": "GOP lawsuit looks to throw out absentee voting in Arizona"
  },
  {
    "id": 13196,
    "mediaId": 2694,
    "date": "2022-02-28",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span> might wind up the only person standing between Arizona and the triumph of the Big Lie.",
    "author": "Elaine Godfrey",
    "title": "She Defended Democracy. Do Voters Care?"
  },
  {
    "id": 17035,
    "mediaId": 8345,
    "date": "2022-03-01",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "Associated Press",
    "title": "GOP lawsuit looks to throw out absentee voting in Arizona"
  },
  {
    "id": 17324,
    "mediaId": 2745,
    "date": "2022-03-03",
    "sentence": "She is now general counsel for the Arizona secretary of state, Democrat <span class='selected-term'>Katie Hobbs</span>.",
    "author": "",
    "title": "Opinion Arizona Republicans keep churning out new election legislation targeting voting access"
  },
  {
    "id": 17172,
    "mediaId": 8475,
    "date": "2022-03-04",
    "sentence": "Democratic gubernatorial frontrunner <span class='selected-term'>Katie Hobbs</span> is calling for a handful of new tax credits and sales tax exemptions aimed at helping working families, including child care assistance and a state-level version of a recently expired federal child tax credit.",
    "author": "Jeremy Duda",
    "title": "Hobbs: Arizona should have state child tax credit, more help for working families"
  },
  {
    "id": 12682,
    "mediaId": 2662,
    "date": "2022-03-04",
    "sentence": "With her commanding position in recent primary surveys and her strong performance against Democrat <span class='selected-term'>Katie Hobbs</span>, Kari Lake is the Republican frontrunner in the Arizona Gubernatorial race.”\nThis poll of 1,000 likely general election voters was conducted through a live survey that collected 50.7% of the results from landlines and 49.3% from cell phones.",
    "author": "Jordan Conradson",
    "title": "POLL: Trump-Endorsed Arizona Gubernatorial Candidate Is The ONLY Republican Who Can Beat Radical Leftist Soros Funded Katie Hobbs"
  },
  {
    "id": 15261,
    "mediaId": 2520,
    "date": "2022-03-05",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span>, the Democratic frontrunner, declined to comment.",
    "author": "Stacey Barchenger",
    "title": "Marco López, Democratic candidate for Arizona governor, linked to bribery scheme in Mexico"
  },
  {
    "id": 12855,
    "mediaId": 2662,
    "date": "2022-03-06",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe Gateway Pundit recently reported on a new poll showing Trump-endorsed Kari Lake is the only candidate who can win the general election against Soros-funded socialist frontrunner <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “I’m The ONLY Candidate Who’s Vowing To And Will Get To The Bottom Of What Happened In 2020.” (VIDEO)"
  },
  {
    "id": 15290,
    "mediaId": 2662,
    "date": "2022-03-07",
    "sentence": "We were told that the Party supported the bill, which has proven to be false and that this was intended to fix the utter mess <span class='selected-term'>Katie Hobbs</span> has made of our election procedures for 2022.",
    "author": "Jordan Conradson",
    "title": "UPDATE: Arizona Republicans Look To Repeal Language In Bill Changing Precinct Committeemen Election Rules"
  },
  {
    "id": 10887,
    "mediaId": 2662,
    "date": "2022-03-08",
    "sentence": "This bill would not have been necessary if <span class='selected-term'>Katie Hobbs</span> would have taken appropriate measures to be prepared for redistricting during a major election.",
    "author": "Jordan Conradson",
    "title": "Arizona Legislature Working To Repeal PC Purge Bill – Anti-Precinct Committeemen Elections HB2839"
  },
  {
    "id": 15347,
    "mediaId": 8475,
    "date": "2022-03-10",
    "sentence": "\"As governor, I would not only veto this extremist bill, I would also trust Arizona women to make health care decisions alongside doctors, not politicians,\" said Democratic gubernatorial candidate and current Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Michael McDaniel",
    "title": "Transgender and abortion bills highlight growing division of Arizona lawmakers"
  },
  {
    "id": 10757,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "Brnovich also was on the receiving end of separate ethics complaints from Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> and the Arizona Board of Regents, which oversees the state universities.",
    "author": "",
    "title": "The Arizona Republican Caught in a Vise by Trump’s Big Lie"
  },
  {
    "id": 15344,
    "mediaId": 8260,
    "date": "2022-03-13",
    "sentence": "I think that is part of the reason why she is able to work with others on the other side of the aisle because she doesn’t burn the bridges that way.”\nDesai has been a critical part of the legal teams that defended the Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat, and the Arizona Democratic Party in multiple cases that all were unsuccessful in reversing the election.",
    "author": "",
    "title": "‘I don’t have a lot of fear about speaking truth to power’: Roopali Desai honored by USA TODAY"
  },
  {
    "id": 11105,
    "mediaId": 2520,
    "date": "2022-03-16",
    "sentence": "Now, it’ll be left to Secretary of State <span class='selected-term'>Katie Hobbs</span>, the Democrats’ likely pick for governor, to defend our right to vote from the comfort of our kitchen table.",
    "author": "Laurie Roberts",
    "title": "The Arizona GOP has a genius plan to sabotage the Arizona GOP"
  },
  {
    "id": 11413,
    "mediaId": 2660,
    "date": "2022-03-17",
    "sentence": "Lake is one of many Republicans running in Arizona’s Aug. 2 Republican primary, while the best known Democrat running is Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Amy Sherman",
    "title": "Jan. 6 defendants “are being held in prison without being charged.”"
  },
  {
    "id": 11173,
    "mediaId": 2660,
    "date": "2022-03-17",
    "sentence": "The lawsuit names as defendants both the state and Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat running for governor.",
    "author": "Amy Sherman",
    "title": "Voting by mail has been popular in Arizona for decades. Now the state GOP wants to ban it"
  },
  {
    "id": 11474,
    "mediaId": 8428,
    "date": "2022-03-17",
    "sentence": "A recent survey showed that Lake, a former news anchor, is the only Republican candidate expected to be able to defeat Secretary of State <span class='selected-term'>Katie Hobbs</span>, D-Ariz., in this crucial gubernatorial race.",
    "author": "Timothy Frudd",
    "title": "Kari Lake easily qualifies for the August primary"
  },
  {
    "id": 13419,
    "mediaId": 8475,
    "date": "2022-03-18",
    "sentence": "Rep. Richard Andrade has withdrawn his endorsement of Democratic gubernatorial frontrunner <span class='selected-term'>Katie Hobbs</span> over her role in the firing of former Senate staffer Talonya Adams and is now backing Marco Lopez, one of her rivals in the primary elections.",
    "author": "Jeremy Duda",
    "title": "Arizona Rep. Andrade un-endorses Hobbs, switches to Lopez"
  },
  {
    "id": 9100,
    "mediaId": 2578,
    "date": "2022-03-19",
    "sentence": "The Gateway Pundit recently reported that the Arizona Attorney General Mark Brnovich rejected <span class='selected-term'>Katie Hobbs</span>’ proposed 2022 Elections Procedures Manual after she failed to correct the outlined law violations.",
    "author": "Jordan Conradson",
    "title": "Soros-Backed Secretary of State Katie Hobbs Violates Arizona State Election Law by Shutting Down Election Petition System for Certain Candidates"
  },
  {
    "id": 9111,
    "mediaId": 2664,
    "date": "2022-03-24",
    "sentence": "Despite all of this, and despite Republican officials in Maricopa County agreeing the election was conducted fairly, Trump allies running for office in Arizona have continued to assert Democrats somehow stole the election, with gubernatorial candidate Kari Lake even calling for the arrest of Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Matthew Chapman",
    "title": "Trump's 'Big Lie' demolished again as new audit of Arizona vote shows no fraud: report"
  },
  {
    "id": 12463,
    "mediaId": 2629,
    "date": "2022-03-25",
    "sentence": "\"Hello, I just got a confirmation from Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> [D] that I am the first congressional candidate certified for the 2022 ballot in Arizona's Congressional District Number 2,\" the conspiracy theorist told his followers.",
    "author": "Brandon Gage",
    "title": "QAnon Founder Will Appear On Arizona GOP Primary Ballot"
  },
  {
    "id": 10239,
    "mediaId": 2532,
    "date": "2022-03-30",
    "sentence": "Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> called the legislation \"a giant step backward for reproductive freedom and women's equality.\"",
    "author": "Tori B. Powell",
    "title": "Arizona Governor Doug Ducey signs series of bills limiting abortion access and transgender rights"
  },
  {
    "id": 9135,
    "mediaId": 2662,
    "date": "2022-03-30",
    "sentence": "In a letter sent Tuesday, Attorney General Mark Brnovich delegated his powers to enforce criminal action against crooked <span class='selected-term'>Katie Hobbs</span> for shutting down the online candidate petition portal and intentionally violating the law.",
    "author": "Jordan Conradson",
    "title": "JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State Katie Hobbs For Election Crimes"
  },
  {
    "id": 10001,
    "mediaId": 8350,
    "date": "2022-03-30",
    "sentence": "“Election integrity means counting every lawful vote and prohibiting any attempt to illegally cast a vote,” Ducey said in a letter to Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "KTAR.COM",
    "title": "Gov. Doug Ducey signs legislation stiffening citizenship proof to vote"
  },
  {
    "id": 9988,
    "mediaId": 8345,
    "date": "2022-03-31",
    "sentence": "Ducey's signing letter was sent to Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, an abortion rights supporter who is seeking her party's nomination in November's election to replace Ducey, who is term-limited.",
    "author": "",
    "title": "Arizona Gov. Doug Ducey signs bills limiting abortion, trans rights"
  },
  {
    "id": 10282,
    "mediaId": 2730,
    "date": "2022-03-31",
    "sentence": "The reason is simple, and common sense – this is a decision that will dramatically affect the rest of an individual’s life, including the ability of that individual to become a biological parent later in life,” Ducey wrote in a letter to Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Madeline Leesman",
    "title": "Arizona Gov. Ducey Signs Bills Limiting Abortion and Protecting Women’s Sports"
  },
  {
    "id": 7145,
    "mediaId": 2662,
    "date": "2022-03-31",
    "sentence": "JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State <span class='selected-term'>Katie Hobbs</span> For Election Crimes\nDue to Katie Hobbs’ deliberate malfeasance, candidates now struggle to meet the signature requirement before the Monday, April 4th deadline.",
    "author": "Jordan Conradson",
    "title": "WATCH: Arizona State Rep. Mark Finchem on Katie Hobbs’ Potential Prosecution: “She Knowingly Did This. I Don’t See How This Doesn’t End Up In Some Kind of a Conviction”"
  },
  {
    "id": 7494,
    "mediaId": 4418,
    "date": "2022-03-31",
    "sentence": "Advertisement – story continues below\nJUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State <span class='selected-term'>Katie Hobbs</span> For Election Crimes\nDue to Katie Hobbs’ deliberate malfeasance, candidates now struggle to meet the signature requirement before the Monday, April 4th deadline.",
    "author": "Jake Lambert",
    "title": "WATCH: Arizona State Rep. Mark Finchem on Katie Hobbs’ Potential Prosecution: “She Knowingly Did This. I Don’t See How This Doesn’t End Up In Some Kind of a Conviction”"
  },
  {
    "id": 9948,
    "mediaId": 2578,
    "date": "2022-04-01",
    "sentence": "— Secretary <span class='selected-term'>Katie Hobbs</span> (@SecretaryHobbs) March 30, 2022\nThe Democrats will likely utilize lawfare to repeal this measure because they cannot win without illegal and fraudulent votes.",
    "author": "Jordan Conradson",
    "title": "HUGE: Arizona Republicans Pass HB2492 Requiring ALL Voters To Provide Proof Of Citizenship Upon Registering To Vote"
  },
  {
    "id": 10017,
    "mediaId": 8475,
    "date": "2022-04-01",
    "sentence": "Well, to hear Ducey say it in a letter he sent to Secretary of State <span class='selected-term'>Katie Hobbs</span> on signing the measure: \"The reason is simple and common sense — this is a decision that will dramatically affect the rest of an individual's life, including the ability of that individual to become a biological parent later in life.\"",
    "author": "Blake Morlock",
    "title": "Time of the season for hatred: Transgender kids are in Arizona's legislative crosshairs"
  },
  {
    "id": 8768,
    "mediaId": 8251,
    "date": "2022-04-05",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "",
    "title": "Arizona court declines GOP request to invalidate mail voting"
  },
  {
    "id": 8804,
    "mediaId": 2680,
    "date": "2022-04-05",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona court declines GOP request to invalidate mail voting"
  },
  {
    "id": 8508,
    "mediaId": 2526,
    "date": "2022-04-05",
    "sentence": "The Democrat frontrunner for governor in Arizona, <span class='selected-term'>Katie Hobbs</span>, did not say if she would support any time limits on abortion when asked.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Arizona Democrat Gov. Candidate Wants No Limits on Abortion"
  },
  {
    "id": 8560,
    "mediaId": 2631,
    "date": "2022-04-05",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "",
    "title": "Arizona Supreme Court rejects GOP request to invalidate mail voting"
  },
  {
    "id": 8542,
    "mediaId": 2664,
    "date": "2022-04-06",
    "sentence": "\"Today, the Arizona Supreme Court dismissed a dangerous lawsuit that threatened early voting in the state and challenged provisions of the Elections Procedures Manual,\" tweeted <span class='selected-term'>Katie Hobbs</span>, Arizona's Democratic secretary of state.",
    "author": "Jon Skolnik",
    "title": "GOP-led Arizona Supreme Court shuts down Republican bid to ban early voting"
  },
  {
    "id": 8324,
    "mediaId": 2548,
    "date": "2022-04-06",
    "sentence": "Democratic Arizona gubernatorial candidate <span class='selected-term'>Katie Hobbs</span> refused to answer Sunday whether abortions conducted in Arizona should have a time limit based on the baby’s gestational age.",
    "author": "Mary Rooke",
    "title": "Arizona Democratic Gubernatorial Candidate Wants No Limits On Abortion"
  },
  {
    "id": 8422,
    "mediaId": 2888,
    "date": "2022-04-06",
    "sentence": "Earlier this week, Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the lawsuit, condemned the state GOP’s attempt to eradicate mail-in voting.",
    "author": "Chris Walker",
    "title": "Arizona Supreme Court Rejects State GOP Lawsuit to Eliminate Mail-In Voting"
  },
  {
    "id": 8012,
    "mediaId": 8345,
    "date": "2022-04-06",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "",
    "title": "Arizona court declines GOP request to invalidate mail voting"
  },
  {
    "id": 7052,
    "mediaId": 2512,
    "date": "2022-04-06",
    "sentence": "Arizona voters will still be able to vote early, access drop boxes, and make their voices heard.pic.twitter.com/awWo5A6PF3\n— Secretary <span class='selected-term'>Katie Hobbs</span> (@Secretary Katie Hobbs) 1649203544\nHobbs is currently seeking the Democratic gubernatorial nomination.",
    "author": "Brandon Gage",
    "title": "'Petitioners have not persuaded the Court': Arizona Supreme Court tosses GOP lawsuit to eliminate early voting"
  },
  {
    "id": 8685,
    "mediaId": 2784,
    "date": "2022-04-07",
    "sentence": "Democratic Arizona gubernatorial candidate <span class='selected-term'>Katie Hobbs</span> refused to answer Sunday whether abortions conducted in Arizona should have a time limit based on the baby’s gestational age.",
    "author": "",
    "title": "Arizona Governor Candidate Katie Hobbs Supports Killing Babies in Abortions Up to Birth"
  },
  {
    "id": 7529,
    "mediaId": 8428,
    "date": "2022-04-08",
    "sentence": "In a poll released on Thursday, Lake was reported as “out-polling” every Republican and Democrat gubernatorial candidate in the Grand Canyon State, leaving Democrat opponent <span class='selected-term'>Katie Hobbs</span> in the dust.",
    "author": "Summer Lane",
    "title": "Trump holds fundraiser for Kari Lake at Mar-a-Lago"
  },
  {
    "id": 6506,
    "mediaId": 2701,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Alasdaire Fleitas",
    "title": "Democrat Candidate For Arizona Governor Supports Abortion Until Birth"
  },
  {
    "id": 5386,
    "mediaId": 2664,
    "date": "2022-04-12",
    "sentence": "The newly released emails show that top CISA officials reviewed Finchem's request, which was sent through a standard online form, six days after the Oval Office meeting, and the request made its way up the chain of command over the following days and an employee whose name was redacted noted the agency conducted fact-finding on the issue with Arizona's secretary of state <span class='selected-term'>Katie Hobbs</span> and the state election director.",
    "author": "Travis Gettys",
    "title": "Trump allies secretly pushed DHS to help change the results of the 2020 election: report"
  },
  {
    "id": 5681,
    "mediaId": 2528,
    "date": "2022-04-12",
    "sentence": "She is the only Republican in the race more popular than Democratic candidate <span class='selected-term'>Katie Hobbs</span> — Arizona's current secretary of state.",
    "author": "Matthew Loh",
    "title": "Trump-endorsed Arizona gubernatorial candidate Kari Lake says she would fine airlines $1,000 for making passengers wear masks"
  },
  {
    "id": 5705,
    "mediaId": 4091,
    "date": "2022-04-12",
    "sentence": "According to the report, Democratic strongholds received nearly $8 million in private, non-governmental grant money under the direction of Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat, during the 2020 election.",
    "author": "Cassie B.",
    "title": "Criminal prosecutions for Maricopa County election fraud are coming, according to Arizona AG’s interim report"
  },
  {
    "id": 5805,
    "mediaId": 5296,
    "date": "2022-04-18",
    "sentence": "In his 12-page April 6 “interim” report to Fann, Brnovich stated that his office found “serious vulnerabilities that must be addressed and raises questions about the 2020 election in Arizona.”\nThose conclusions appear to contradict mainstream news reports claiming Brnovich uncovered “no evidence of mass fraud in Maricopa County 2020 election results.”\nAlthough Brnovich reported that chain-of-custody procedures were violated, including by Secretary of State <span class='selected-term'>Katie Hobbs</span> (D), Arizona Republic reported, “Attorney general’s report on election in Maricopa County questions procedures, doesn’t allege wrongdoing.”\n“Our review uncovered multiple violations of ballot transportation procedures,” Brnovich wrote on page 7.",
    "author": "",
    "title": "Trump Hints against Endorsement of Brnovich"
  },
  {
    "id": 4703,
    "mediaId": 8475,
    "date": "2022-04-19",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span> became the face of Democratic opposition to GOP efforts to question the election during the partisan election “audit” in 2021, appearing regularly on national news shows where she criticized the state Senate’s review of Maricopa County’s election.",
    "author": "Jim Small",
    "title": "Election lies boost the bottom lines of prominent Arizona Republican candidates"
  },
  {
    "id": 5701,
    "mediaId": 4091,
    "date": "2022-04-21",
    "sentence": "“The report found that almost $8 million in private, non-governmental grant money was given to targeted counties (Democrat strongholds) under the direction of Democrat Secretary of State <span class='selected-term'>Katie Hobbs</span> in the 2020 election.",
    "author": "JD Heyes",
    "title": "Arizona AG Brnovich sends notice to state Senate, says criminal prosecutions coming in relation to 2020 election"
  },
  {
    "id": 5125,
    "mediaId": 2548,
    "date": "2022-04-22",
    "sentence": "She doesn’t care about working-class people.”\nListen to that and much more in this week’s unmissable Deep Dive podcast interview: https://t.co/Bw5mBA7LkA\n— POLITICO Playbook (@playbookdc) April 22, 2022\nGallego went on to accuse Sinema of not caring about other Democrats or her constituents, as evidenced by her lack of appearances on the campaign trail for Kelly or gubernatorial candidate <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Michael Ginsberg",
    "title": "Rep. Ruben Gallego Trashes Sen. Sinema, Says ‘She’s All About Herself’"
  },
  {
    "id": 4931,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The defendants are Lake’s Democrat opponent in the gubernatorial race <span class='selected-term'>Katie Hobbs</span>, the Maricopa County Board of Supervisors, and the Pima County Board of Supervisors.",
    "author": "Summer Lane",
    "title": "Kari Lake files injunction to STOP voting machines in Arizona"
  }
]