[
  {
    "id": 4580,
    "mediaId": 2590,
    "date": "2022-01-12",
    "sentence": "Fear that the GOP might use secretary of state positions to more aggressively suppress votes — or to influence and potentially overturn future elections in ways secretaries like Benson, Raffensperger and Arizona’s <span class='selected-term'>Katie Hobbs</span> (D) prevented in 2020 — has also driven a fundraising boom on the Democratic side.",
    "author": "Travis Waldron",
    "title": "GOP Election Deniers Are On Pace To Raise Record Sums For Secretary Of State Races"
  },
  {
    "id": 3630,
    "mediaId": 2664,
    "date": "2022-01-24",
    "sentence": "Ducey appeared to have missed reports in Dec. 2020, Secretary of State <span class='selected-term'>Katie Hobbs</span> sent a cease-and-desist letter to the so-called sovereign citizens' group saying that the state requires people to get permission to \"use, display or otherwise employ any facsimile, copy, likeness, imitation or other resemblance\" to the state seal.",
    "author": "Sarah K. Burris",
    "title": "Arizona governor swears he never knew about the fake Trump electors despite Republican involvement"
  },
  {
    "id": 3920,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "",
    "author": "",
    "title": "Arizona bill would allow legislature to overturn election results"
  },
  {
    "id": 3023,
    "mediaId": 2512,
    "date": "2022-01-28",
    "sentence": "MSNBC's Rachel Maddow did not mince words when she criticized Arizona Attorney General Mark Brnovich (R) for his failure to look into the fake electors' scandal after the case was forwarded to his office from the Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Meaghan Ellis",
    "title": "Rachel Maddow slams Arizona AG for failure to deal with electors scandal"
  },
  {
    "id": 2888,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "In 2020, Secretary of State <span class='selected-term'>Katie Hobbs</span>—a Democrat—was Arizona's top \"vote counter.\"",
    "author": "",
    "title": "Now every day in Arizona is January 6"
  },
  {
    "id": 2896,
    "mediaId": 8350,
    "date": "2022-02-03",
    "sentence": "Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat, said it’s imperative that harassers face prosecution.",
    "author": "ASSOCIATED PRESS",
    "title": "States seek to protect election workers amid growing threats"
  },
  {
    "id": 1969,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Doug Ducey refused to help him try to overturn his loss and election officials like Georgia Secretary of State Brad Raffensperger (a Republican) and Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> (a Democrat) repeatedly discredited his baseless claims of fraud.",
    "author": "Igor Derysh",
    "title": "More than 80 Trump truthers are aiming for a power grab"
  },
  {
    "id": 2078,
    "mediaId": 2512,
    "date": "2022-02-07",
    "sentence": "Doug Ducey refused to help him try to overturn his loss and election officials like Georgia Secretary of State Brad Raffensperger (a Republican) and Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> (a Democrat) repeatedly discredited his baseless claims of fraud.",
    "author": "",
    "title": "'Clear line for election subversion': More than 80 Trump-truther candidates are running for key state offices"
  },
  {
    "id": 2453,
    "mediaId": 2605,
    "date": "2022-02-08",
    "sentence": "Rogers said the group is focused on protecting incumbent election officials in Michigan, Colorado, Minnesota and New Mexico, holding on to the open seat in Arizona — where another high-profile Democratic secretary of state, <span class='selected-term'>Katie Hobbs</span>, is running for governor — and on potentially flipping Nevada and Georgia.",
    "author": "Arit John",
    "title": "State election officials survived Trump’s attacks. Will they survive the ballot box?"
  },
  {
    "id": 1890,
    "mediaId": 2618,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Morgan Phillips & Rob Crilly",
    "title": "Commander in charge of Kabul evacuation slams the White House and Jill Biden for being a 'distraction' during chaos: Claims high-profile pestering for special favors to get allies out slowed military down"
  },
  {
    "id": 1939,
    "mediaId": 2618,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Anthony",
    "title": "Trump Warns Biden Backed DHS Is Calling “Conspiracy Theorists” Terrorists"
  },
  {
    "id": 1363,
    "mediaId": 2664,
    "date": "2022-02-14",
    "sentence": "The group, which called themselves 'the Sovereign Citizens of the State of Arizona,' never sought that permission, Secretary of State <span class='selected-term'>Katie Hobbs</span>' office said.\"",
    "author": "Bob Brigham",
    "title": "Trump's fake electors illegally used state seal — but GOP attorney general has done nothing: report"
  },
  {
    "id": 718,
    "mediaId": 8428,
    "date": "2022-02-22",
    "sentence": "Republican Kari Lake, a former news anchor, is the only candidate who can defeat Democrat <span class='selected-term'>Katie Hobbs</span> in Arizona’s gubernatorial race this November, a new poll found.",
    "author": "Alex Caldwell",
    "title": "Kari Lake is the only Republican AHEAD of Dem. Katie Hobbs in Arizona governor’s race, new poll finds"
  },
  {
    "id": 296,
    "mediaId": 2699,
    "date": "2022-02-23",
    "sentence": "But to stand out, it helps to fall off the edge of the world, like Josh Mandel, in Ohio, who calls for all public schools to be replaced by religious ones or news anchor Kari Lake in Arizona who wants Secretary of State <span class='selected-term'>Katie Hobbs</span> to be imprisoned for presiding over the stolen election.",
    "author": "Margaret Carlson",
    "title": "Trump Hates Losers But He’s Surrounding Himself With Them in the 2022 Midterms"
  },
  {
    "id": 17216,
    "mediaId": 2594,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "Via AP news wire",
    "title": "GOP lawsuit looks to throw out absentee voting in Arizona"
  },
  {
    "id": 12682,
    "mediaId": 2662,
    "date": "2022-03-04",
    "sentence": "With her commanding position in recent primary surveys and her strong performance against Democrat <span class='selected-term'>Katie Hobbs</span>, Kari Lake is the Republican frontrunner in the Arizona Gubernatorial race.”\nThis poll of 1,000 likely general election voters was conducted through a live survey that collected 50.7% of the results from landlines and 49.3% from cell phones.",
    "author": "Jordan Conradson",
    "title": "POLL: Trump-Endorsed Arizona Gubernatorial Candidate Is The ONLY Republican Who Can Beat Radical Leftist Soros Funded Katie Hobbs"
  },
  {
    "id": 12855,
    "mediaId": 2662,
    "date": "2022-03-06",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe Gateway Pundit recently reported on a new poll showing Trump-endorsed Kari Lake is the only candidate who can win the general election against Soros-funded socialist frontrunner <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “I’m The ONLY Candidate Who’s Vowing To And Will Get To The Bottom Of What Happened In 2020.” (VIDEO)"
  },
  {
    "id": 10887,
    "mediaId": 2662,
    "date": "2022-03-08",
    "sentence": "This bill would not have been necessary if <span class='selected-term'>Katie Hobbs</span> would have taken appropriate measures to be prepared for redistricting during a major election.",
    "author": "Jordan Conradson",
    "title": "Arizona Legislature Working To Repeal PC Purge Bill – Anti-Precinct Committeemen Elections HB2839"
  },
  {
    "id": 10757,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "Brnovich also was on the receiving end of separate ethics complaints from Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> and the Arizona Board of Regents, which oversees the state universities.",
    "author": "",
    "title": "The Arizona Republican Caught in a Vise by Trump’s Big Lie"
  },
  {
    "id": 11413,
    "mediaId": 2660,
    "date": "2022-03-17",
    "sentence": "Lake is one of many Republicans running in Arizona’s Aug. 2 Republican primary, while the best known Democrat running is Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Amy Sherman",
    "title": "Jan. 6 defendants “are being held in prison without being charged.”"
  },
  {
    "id": 11474,
    "mediaId": 8428,
    "date": "2022-03-17",
    "sentence": "A recent survey showed that Lake, a former news anchor, is the only Republican candidate expected to be able to defeat Secretary of State <span class='selected-term'>Katie Hobbs</span>, D-Ariz., in this crucial gubernatorial race.",
    "author": "Timothy Frudd",
    "title": "Kari Lake easily qualifies for the August primary"
  },
  {
    "id": 9111,
    "mediaId": 2664,
    "date": "2022-03-24",
    "sentence": "Despite all of this, and despite Republican officials in Maricopa County agreeing the election was conducted fairly, Trump allies running for office in Arizona have continued to assert Democrats somehow stole the election, with gubernatorial candidate Kari Lake even calling for the arrest of Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Matthew Chapman",
    "title": "Trump's 'Big Lie' demolished again as new audit of Arizona vote shows no fraud: report"
  },
  {
    "id": 9239,
    "mediaId": 2618,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Zeke Miller & Josh Boak",
    "title": "Biden planning to tap oil reserve to control gas prices"
  },
  {
    "id": 8926,
    "mediaId": 2618,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Rob Crilly",
    "title": "'Where do I get my reputation back?' Trump celebrates as FEC FINES Hillary Clinton and the DNC over the way it paid firm to produce the Steele dossier claiming links between his campaign and Russia"
  },
  {
    "id": 7236,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "One prominent gubernatorial candidate, Kari Lake in Arizona, has even called for arresting her opponent, Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Matthew Chapman",
    "title": "New ad begs Trump to rescind endorsement of 'grifting loser' AG candidate in Michigan"
  },
  {
    "id": 8804,
    "mediaId": 2680,
    "date": "2022-04-05",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona court declines GOP request to invalidate mail voting"
  },
  {
    "id": 8012,
    "mediaId": 8345,
    "date": "2022-04-06",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "",
    "title": "Arizona court declines GOP request to invalidate mail voting"
  },
  {
    "id": 8698,
    "mediaId": 8408,
    "date": "2022-04-06",
    "sentence": "https://t.co/kKoc3g02Io\n— Secretary <span class='selected-term'>Katie Hobbs</span> (@SecretaryHobbs) May 7, 2021\nThe incident was serious enough that Governor Doug Ducey ordered the Arizona Department of Public Safety to provide protection for Hobbs and her family.",
    "author": "Elias Weiss",
    "title": "Alt-Right Fake News 'Journalist' Jailed in Phoenix Assault"
  },
  {
    "id": 7529,
    "mediaId": 8428,
    "date": "2022-04-08",
    "sentence": "In a poll released on Thursday, Lake was reported as “out-polling” every Republican and Democrat gubernatorial candidate in the Grand Canyon State, leaving Democrat opponent <span class='selected-term'>Katie Hobbs</span> in the dust.",
    "author": "Summer Lane",
    "title": "Trump holds fundraiser for Kari Lake at Mar-a-Lago"
  },
  {
    "id": 5681,
    "mediaId": 2528,
    "date": "2022-04-12",
    "sentence": "She is the only Republican in the race more popular than Democratic candidate <span class='selected-term'>Katie Hobbs</span> — Arizona's current secretary of state.",
    "author": "Matthew Loh",
    "title": "Trump-endorsed Arizona gubernatorial candidate Kari Lake says she would fine airlines $1,000 for making passengers wear masks"
  },
  {
    "id": 5386,
    "mediaId": 2664,
    "date": "2022-04-12",
    "sentence": "The newly released emails show that top CISA officials reviewed Finchem's request, which was sent through a standard online form, six days after the Oval Office meeting, and the request made its way up the chain of command over the following days and an employee whose name was redacted noted the agency conducted fact-finding on the issue with Arizona's secretary of state <span class='selected-term'>Katie Hobbs</span> and the state election director.",
    "author": "Travis Gettys",
    "title": "Trump allies secretly pushed DHS to help change the results of the 2020 election: report"
  },
  {
    "id": 6196,
    "mediaId": 2658,
    "date": "2022-04-12",
    "sentence": "On Dec. 28, 2020, four days after CISA’s acting director requested the call on Finchem’s voting machines request, the emails show another person — whose name is redacted — flagging that CISA had conducted fact-finding on the issue with the sitting Arizona secretary of state, <span class='selected-term'>Katie Hobbs</span>, and the state elections director at the time.",
    "author": "",
    "title": "How a Trump ally got his unfounded voting-machine audit push in front of federal cyber agency"
  },
  {
    "id": 6104,
    "mediaId": 2676,
    "date": "2022-04-12",
    "sentence": "The newly released emails show that top CISA officials reviewed Finchem's request, which was sent through a standard online form, six days after the Oval Office meeting, and the request made its way up the chain of command over the following days and an employee whose name was redacted noted the agency conducted fact-finding on the issue with Arizona's secretary of state <span class='selected-term'>Katie Hobbs</span> and the state election director.",
    "author": "Travis Gettys",
    "title": "New emails reveal Trump allies’ effort to get DHS to conduct “forensic” probe of voting machines"
  },
  {
    "id": 6007,
    "mediaId": 2634,
    "date": "2022-04-15",
    "sentence": "Governor: Doug Ducey, a Republican, is term-limited; the next election is in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: All seven justices were appointed by Republican governors\nElections administered by Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat\nOther key players: Kelli Ward, state GOP chair\nCan they steal it?",
    "author": "Matt Ford",
    "title": "The Six States That Could Determine Whether Republicans Steal the 2024 Election"
  },
  {
    "id": 5805,
    "mediaId": 5296,
    "date": "2022-04-18",
    "sentence": "In his 12-page April 6 “interim” report to Fann, Brnovich stated that his office found “serious vulnerabilities that must be addressed and raises questions about the 2020 election in Arizona.”\nThose conclusions appear to contradict mainstream news reports claiming Brnovich uncovered “no evidence of mass fraud in Maricopa County 2020 election results.”\nAlthough Brnovich reported that chain-of-custody procedures were violated, including by Secretary of State <span class='selected-term'>Katie Hobbs</span> (D), Arizona Republic reported, “Attorney general’s report on election in Maricopa County questions procedures, doesn’t allege wrongdoing.”\n“Our review uncovered multiple violations of ballot transportation procedures,” Brnovich wrote on page 7.",
    "author": "",
    "title": "Trump Hints against Endorsement of Brnovich"
  },
  {
    "id": 5103,
    "mediaId": 8296,
    "date": "2022-04-24",
    "sentence": "",
    "author": "",
    "title": "Yavapai County GOP, Brnovich to file claim against Hobbs"
  }
]