[
  {
    "id": 4518,
    "mediaId": 2658,
    "date": "2022-01-03",
    "sentence": "That’s the sort of compromise we’re trying to do.”\nBALLOT BATTLE — Arizona state Attorney General Mark Brnovich and Secretary of State <span class='selected-term'>Katie Hobbs</span> are at odds over a new elections manual, Arizona Republic’s Mary Jo Pitzl wrote.",
    "author": "",
    "title": "Campaign season starts now"
  },
  {
    "id": 4580,
    "mediaId": 2590,
    "date": "2022-01-12",
    "sentence": "Fear that the GOP might use secretary of state positions to more aggressively suppress votes — or to influence and potentially overturn future elections in ways secretaries like Benson, Raffensperger and Arizona’s <span class='selected-term'>Katie Hobbs</span> (D) prevented in 2020 — has also driven a fundraising boom on the Democratic side.",
    "author": "Travis Waldron",
    "title": "GOP Election Deniers Are On Pace To Raise Record Sums For Secretary Of State Races"
  },
  {
    "id": 3920,
    "mediaId": 2748,
    "date": "2022-01-27",
    "sentence": "",
    "author": "",
    "title": "Arizona bill would allow legislature to overturn election results"
  },
  {
    "id": 2888,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "In 2020, Secretary of State <span class='selected-term'>Katie Hobbs</span>—a Democrat—was Arizona's top \"vote counter.\"",
    "author": "",
    "title": "Now every day in Arizona is January 6"
  },
  {
    "id": 1969,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Doug Ducey refused to help him try to overturn his loss and election officials like Georgia Secretary of State Brad Raffensperger (a Republican) and Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> (a Democrat) repeatedly discredited his baseless claims of fraud.",
    "author": "Igor Derysh",
    "title": "More than 80 Trump truthers are aiming for a power grab"
  },
  {
    "id": 2078,
    "mediaId": 2512,
    "date": "2022-02-07",
    "sentence": "Doug Ducey refused to help him try to overturn his loss and election officials like Georgia Secretary of State Brad Raffensperger (a Republican) and Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> (a Democrat) repeatedly discredited his baseless claims of fraud.",
    "author": "",
    "title": "'Clear line for election subversion': More than 80 Trump-truther candidates are running for key state offices"
  },
  {
    "id": 1939,
    "mediaId": 2618,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Anthony",
    "title": "Trump Warns Biden Backed DHS Is Calling “Conspiracy Theorists” Terrorists"
  },
  {
    "id": 1890,
    "mediaId": 2618,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Morgan Phillips & Rob Crilly",
    "title": "Commander in charge of Kabul evacuation slams the White House and Jill Biden for being a 'distraction' during chaos: Claims high-profile pestering for special favors to get allies out slowed military down"
  },
  {
    "id": 1825,
    "mediaId": 2618,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Bonchie",
    "title": "Joe Biden Leaves Nothing but Questions After Ditching His Presidential Duties Again"
  },
  {
    "id": 1830,
    "mediaId": 2618,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Kristina Wong",
    "title": "Exclusive: Sen. Ron Johnson Demands Answers from DOD on Medical Database"
  },
  {
    "id": 13196,
    "mediaId": 2694,
    "date": "2022-02-28",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span> might wind up the only person standing between Arizona and the triumph of the Big Lie.",
    "author": "Elaine Godfrey",
    "title": "She Defended Democracy. Do Voters Care?"
  },
  {
    "id": 12855,
    "mediaId": 2662,
    "date": "2022-03-06",
    "sentence": "TRENDING: Newsmax Host Greg Kelly: \"Kevin McCarthy Is a Swamp Snake and We Don't Like Him - In a Moment of Crisis He Wet His Pants\" (VIDEO)\nThe Gateway Pundit recently reported on a new poll showing Trump-endorsed Kari Lake is the only candidate who can win the general election against Soros-funded socialist frontrunner <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Jordan Conradson",
    "title": "EXCLUSIVE: Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake: “I’m The ONLY Candidate Who’s Vowing To And Will Get To The Bottom Of What Happened In 2020.” (VIDEO)"
  },
  {
    "id": 10757,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "Brnovich also was on the receiving end of separate ethics complaints from Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> and the Arizona Board of Regents, which oversees the state universities.",
    "author": "",
    "title": "The Arizona Republican Caught in a Vise by Trump’s Big Lie"
  },
  {
    "id": 15344,
    "mediaId": 8260,
    "date": "2022-03-13",
    "sentence": "I think that is part of the reason why she is able to work with others on the other side of the aisle because she doesn’t burn the bridges that way.”\nDesai has been a critical part of the legal teams that defended the Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat, and the Arizona Democratic Party in multiple cases that all were unsuccessful in reversing the election.",
    "author": "",
    "title": "‘I don’t have a lot of fear about speaking truth to power’: Roopali Desai honored by USA TODAY"
  },
  {
    "id": 11413,
    "mediaId": 2660,
    "date": "2022-03-17",
    "sentence": "Lake is one of many Republicans running in Arizona’s Aug. 2 Republican primary, while the best known Democrat running is Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Amy Sherman",
    "title": "Jan. 6 defendants “are being held in prison without being charged.”"
  },
  {
    "id": 11173,
    "mediaId": 2660,
    "date": "2022-03-17",
    "sentence": "The lawsuit names as defendants both the state and Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat running for governor.",
    "author": "Amy Sherman",
    "title": "Voting by mail has been popular in Arizona for decades. Now the state GOP wants to ban it"
  },
  {
    "id": 9111,
    "mediaId": 2664,
    "date": "2022-03-24",
    "sentence": "Despite all of this, and despite Republican officials in Maricopa County agreeing the election was conducted fairly, Trump allies running for office in Arizona have continued to assert Democrats somehow stole the election, with gubernatorial candidate Kari Lake even calling for the arrest of Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Matthew Chapman",
    "title": "Trump's 'Big Lie' demolished again as new audit of Arizona vote shows no fraud: report"
  },
  {
    "id": 9269,
    "mediaId": 2618,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Morgan Phillips",
    "title": "Biden tears into 'political attacks' on transgender children: Slams bills stopping them getting puberty blockers, stopping biological boys playing sport against girls and Florida's 'Don't Say Gay Bill' for 'damaging mental health'"
  },
  {
    "id": 9239,
    "mediaId": 2618,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Zeke Miller & Josh Boak",
    "title": "Biden planning to tap oil reserve to control gas prices"
  },
  {
    "id": 9849,
    "mediaId": 4045,
    "date": "2022-03-30",
    "sentence": "",
    "author": "",
    "title": "Arizona governor signs bills limiting abortion, trans rights"
  },
  {
    "id": 7398,
    "mediaId": 2690,
    "date": "2022-03-31",
    "sentence": "of State <span class='selected-term'>Katie Hobbs</span> in Hot Water!-Posted on Rumble.com-By Bannons War Room-On March 31, 2022:\nhttps://rumble.com/vz6qxd-az-sec.-of-state-katie-hobbs-in-hot-water.html\nJudge Holds Wisconsin Speaker in Contempt Over Election Records!-Posted on The Epoch Times-By Jack Phillips-On March 31, 2022:\nhttps://www.theepochtimes.com/judge-holds-wisconsin-speaker-in-contempt-over-election-records_4374695.html\nVideo: Elderly Forced to Vote, 100 Percent Voter Turnout in Nursing Homes in 2020 Election | Larry Elder!-Posted on The Epoch Times-By Larry Elder, Larry Elder With Epoch Times-On March 30, 2022:\nhttps://www.theepochtimes.com/elderly-forced-to-vote-100-percent-voter-turnout-in-nursing-homes-in-2020-election-larry-elder_4372302.html\nVideo: WarRoom Battle Ground Ep 19: The World Government Summit In Dubai And Your Future Here In America!-Posted on Rumble.com-By Bannons War Room-On March 31, 2022:\nhttps://rumble.com/vz8zh5-warroom-battle-ground-ep-19-the-world-government-summit-in-dubai-and-your-f.html\nVideo: Episode 1,748 - Biden Approves Instant Asylum At Border For Title 42 Invasion; 500k/Month, 6m/yr!-Posted on Rumble.com-By Bannons War Room-On March 31, 2022:\nhttps://rumble.com/vz70p1-episode-1748-biden-approves-instant-asylum-at-border-for-title-42-invasion-.html\nVideo: Ep 1,749 - Rudy’s Racketeering Charges Against Biden Crime Family Embedded In The Laptop From Hell!-Posted on Rumble.com-By Bannons War Room-On March 31, 2022:\nhttps://rumble.com/vz74p7-ep-1749-rudys-racketeering-charges-against-biden-crime-family-embedded-in-t.html\nFEC Fines Hillary and DNC … Sort Of: The fine is both minuscule and misdirected, but what it stands for is much more important!-Posted on The Patriot Post-By Douglas Andrews-On March 31, 2022:\nhttps://patriotpost.us/articles/87330-fec-fines-hillary-and-dnc-dot-dot-dot-sort-of-2022-03-31\nTrump: Fines Paid by Clinton Campaign, DNC Show Corruption!-Posted on Epoch Times-By Zachary Stieber-On March 31, 2022:\nhttps://www.theepochtimes.com/trump-fines-paid-by-clinton-campaign-dnc-show-corruption_4374089.html\nVideo: SOCOM SECRET SHADOWNET STOLEN!-Posted on JeffreyPrather.com-By Jeffrey Prather, MAJ, USA (Ret)-On March 31, 2022:\nhttps://jeffreyprather.com/socom-secret-shadownet-stolen/\nVideo: Ep.",
    "author": "Jake Martinez",
    "title": "Brainwashed the DocuMovie Part One (Part 89)!"
  },
  {
    "id": 8560,
    "mediaId": 2631,
    "date": "2022-04-05",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "",
    "title": "Arizona Supreme Court rejects GOP request to invalidate mail voting"
  },
  {
    "id": 7529,
    "mediaId": 8428,
    "date": "2022-04-08",
    "sentence": "In a poll released on Thursday, Lake was reported as “out-polling” every Republican and Democrat gubernatorial candidate in the Grand Canyon State, leaving Democrat opponent <span class='selected-term'>Katie Hobbs</span> in the dust.",
    "author": "Summer Lane",
    "title": "Trump holds fundraiser for Kari Lake at Mar-a-Lago"
  },
  {
    "id": 6916,
    "mediaId": 3987,
    "date": "2022-04-11",
    "sentence": "Hay ayuda legal y clases de inglés gratis\nBy Isabel Olmos\nApril 10, 2022\nEl Diario-La Prensa (NY) USCIS facilita la ‘green card’ para ciertos inmigrantes\nBy Jesús García\nApril 10, 2022\nEl Nuevo Herald (FL) A pocos le importa que una nueva generación de cubanos muere en el Estrecho de Florida\nBy Fabiola Santiago\nApril 10, 2022\nUnivision “Responsabilidad, transparencia y resultados”: esto promete <span class='selected-term'>Katie Hobbs</span> candidata a gobernadora de Arizona\nBy Paula Díaz\nApril 10, 2022\nLa Opinión (CA) Trump sobre fin del Título 42: “Habrá una oleada de inmigración ilegal como nunca se ha visto en el mundo”\nBy Jesús García\nApril 10, 2022\nUnivision Ahora será más fácil eliminar las condiciones que imponen a algunos residentes para obtener la ‘green card’\nBy Jorge Cancino\nApril 08, 2022\nLa Opinión (CA) Biden propone un pacto migratorio en la agenda de la Cumbre de las Américas\nBy María Ortiz\nApril 08, 2022\nLa Opinión (CA) ‘La Migra’ dará celulares a ciertos inmigrantes indocumentados\nApril 10, 2022",
    "author": "Zachary Mueller",
    "title": "Immigration Reform News April 11, 2022 / Qué Pasa En Inmigración"
  },
  {
    "id": 5681,
    "mediaId": 2528,
    "date": "2022-04-12",
    "sentence": "She is the only Republican in the race more popular than Democratic candidate <span class='selected-term'>Katie Hobbs</span> — Arizona's current secretary of state.",
    "author": "Matthew Loh",
    "title": "Trump-endorsed Arizona gubernatorial candidate Kari Lake says she would fine airlines $1,000 for making passengers wear masks"
  },
  {
    "id": 6196,
    "mediaId": 2658,
    "date": "2022-04-12",
    "sentence": "On Dec. 28, 2020, four days after CISA’s acting director requested the call on Finchem’s voting machines request, the emails show another person — whose name is redacted — flagging that CISA had conducted fact-finding on the issue with the sitting Arizona secretary of state, <span class='selected-term'>Katie Hobbs</span>, and the state elections director at the time.",
    "author": "",
    "title": "How a Trump ally got his unfounded voting-machine audit push in front of federal cyber agency"
  }
]