[
  {
    "id": 100,
    "mediaId": 8475,
    "date": "2022-02-21",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span>, the Democratic frontrunner, called on the Senate to raise the limit and save K-12 schools from \"this manufactured funding crisis.\"",
    "author": "Jeremy Duda",
    "title": "No Republican candidates for Arizona governor are calling for school cuts to be stopped"
  },
  {
    "id": 15344,
    "mediaId": 8260,
    "date": "2022-03-13",
    "sentence": "I think that is part of the reason why she is able to work with others on the other side of the aisle because she doesn’t burn the bridges that way.”\nDesai has been a critical part of the legal teams that defended the Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat, and the Arizona Democratic Party in multiple cases that all were unsuccessful in reversing the election.",
    "author": "",
    "title": "‘I don’t have a lot of fear about speaking truth to power’: Roopali Desai honored by USA TODAY"
  },
  {
    "id": 5705,
    "mediaId": 4091,
    "date": "2022-04-12",
    "sentence": "According to the report, Democratic strongholds received nearly $8 million in private, non-governmental grant money under the direction of Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat, during the 2020 election.",
    "author": "Cassie B.",
    "title": "Criminal prosecutions for Maricopa County election fraud are coming, according to Arizona AG’s interim report"
  },
  {
    "id": 5805,
    "mediaId": 5296,
    "date": "2022-04-18",
    "sentence": "In his 12-page April 6 “interim” report to Fann, Brnovich stated that his office found “serious vulnerabilities that must be addressed and raises questions about the 2020 election in Arizona.”\nThose conclusions appear to contradict mainstream news reports claiming Brnovich uncovered “no evidence of mass fraud in Maricopa County 2020 election results.”\nAlthough Brnovich reported that chain-of-custody procedures were violated, including by Secretary of State <span class='selected-term'>Katie Hobbs</span> (D), Arizona Republic reported, “Attorney general’s report on election in Maricopa County questions procedures, doesn’t allege wrongdoing.”\n“Our review uncovered multiple violations of ballot transportation procedures,” Brnovich wrote on page 7.",
    "author": "",
    "title": "Trump Hints against Endorsement of Brnovich"
  },
  {
    "id": 5701,
    "mediaId": 4091,
    "date": "2022-04-21",
    "sentence": "“The report found that almost $8 million in private, non-governmental grant money was given to targeted counties (Democrat strongholds) under the direction of Democrat Secretary of State <span class='selected-term'>Katie Hobbs</span> in the 2020 election.",
    "author": "JD Heyes",
    "title": "Arizona AG Brnovich sends notice to state Senate, says criminal prosecutions coming in relation to 2020 election"
  }
]