[
  {
    "id": 4476,
    "mediaId": 8475,
    "date": "2022-01-13",
    "sentence": "That’s what Secretary of State <span class='selected-term'>Katie Hobbs</span> told them in new guidance that wasn’t among the instructions she issued just two weeks ago to candidates.",
    "author": "Jeremy Duda",
    "title": "Arizona candidates won’t be able to collect online signatures in their new districts at all in 2022"
  },
  {
    "id": 1840,
    "mediaId": 8475,
    "date": "2022-02-09",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span> is going to court against Attorney General Mark Brnovich, asking a Maricopa County judge to bar him from bringing what she argues would be baseless criminal charges against her over a scheduled, temporary shutdown of the state’s online signature-gathering website for congressional and legislative candidates.",
    "author": "Jeremy Duda",
    "title": "Katie Hobbs takes Arizona AG Mark Brnovich to court over E-Qual threat"
  },
  {
    "id": 1647,
    "mediaId": 2662,
    "date": "2022-02-15",
    "sentence": "AZGOP Chairwoman Dr. Kelli Ward urges patriots to get involved and notify her if they aren’t accepted by radical leftist Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Jordan Conradson",
    "title": "Here’s an Opportunity to Participate: Arizona Secretary of State And Maricopa County HIRING NOW – Walk-In Interviews Tomorrow"
  },
  {
    "id": 13196,
    "mediaId": 2694,
    "date": "2022-02-28",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span> might wind up the only person standing between Arizona and the triumph of the Big Lie.",
    "author": "Elaine Godfrey",
    "title": "She Defended Democracy. Do Voters Care?"
  },
  {
    "id": 10887,
    "mediaId": 2662,
    "date": "2022-03-08",
    "sentence": "This bill would not have been necessary if <span class='selected-term'>Katie Hobbs</span> would have taken appropriate measures to be prepared for redistricting during a major election.",
    "author": "Jordan Conradson",
    "title": "Arizona Legislature Working To Repeal PC Purge Bill – Anti-Precinct Committeemen Elections HB2839"
  },
  {
    "id": 10757,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "Brnovich also was on the receiving end of separate ethics complaints from Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> and the Arizona Board of Regents, which oversees the state universities.",
    "author": "",
    "title": "The Arizona Republican Caught in a Vise by Trump’s Big Lie"
  },
  {
    "id": 11105,
    "mediaId": 2520,
    "date": "2022-03-16",
    "sentence": "Now, it’ll be left to Secretary of State <span class='selected-term'>Katie Hobbs</span>, the Democrats’ likely pick for governor, to defend our right to vote from the comfort of our kitchen table.",
    "author": "Laurie Roberts",
    "title": "The Arizona GOP has a genius plan to sabotage the Arizona GOP"
  },
  {
    "id": 11173,
    "mediaId": 2660,
    "date": "2022-03-17",
    "sentence": "The lawsuit names as defendants both the state and Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat running for governor.",
    "author": "Amy Sherman",
    "title": "Voting by mail has been popular in Arizona for decades. Now the state GOP wants to ban it"
  },
  {
    "id": 9111,
    "mediaId": 2664,
    "date": "2022-03-24",
    "sentence": "Despite all of this, and despite Republican officials in Maricopa County agreeing the election was conducted fairly, Trump allies running for office in Arizona have continued to assert Democrats somehow stole the election, with gubernatorial candidate Kari Lake even calling for the arrest of Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Matthew Chapman",
    "title": "Trump's 'Big Lie' demolished again as new audit of Arizona vote shows no fraud: report"
  },
  {
    "id": 10001,
    "mediaId": 8350,
    "date": "2022-03-30",
    "sentence": "“Election integrity means counting every lawful vote and prohibiting any attempt to illegally cast a vote,” Ducey said in a letter to Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "KTAR.COM",
    "title": "Gov. Doug Ducey signs legislation stiffening citizenship proof to vote"
  },
  {
    "id": 9948,
    "mediaId": 2578,
    "date": "2022-04-01",
    "sentence": "— Secretary <span class='selected-term'>Katie Hobbs</span> (@SecretaryHobbs) March 30, 2022\nThe Democrats will likely utilize lawfare to repeal this measure because they cannot win without illegal and fraudulent votes.",
    "author": "Jordan Conradson",
    "title": "HUGE: Arizona Republicans Pass HB2492 Requiring ALL Voters To Provide Proof Of Citizenship Upon Registering To Vote"
  },
  {
    "id": 5705,
    "mediaId": 4091,
    "date": "2022-04-12",
    "sentence": "According to the report, Democratic strongholds received nearly $8 million in private, non-governmental grant money under the direction of Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat, during the 2020 election.",
    "author": "Cassie B.",
    "title": "Criminal prosecutions for Maricopa County election fraud are coming, according to Arizona AG’s interim report"
  },
  {
    "id": 6104,
    "mediaId": 2676,
    "date": "2022-04-12",
    "sentence": "The newly released emails show that top CISA officials reviewed Finchem's request, which was sent through a standard online form, six days after the Oval Office meeting, and the request made its way up the chain of command over the following days and an employee whose name was redacted noted the agency conducted fact-finding on the issue with Arizona's secretary of state <span class='selected-term'>Katie Hobbs</span> and the state election director.",
    "author": "Travis Gettys",
    "title": "New emails reveal Trump allies’ effort to get DHS to conduct “forensic” probe of voting machines"
  },
  {
    "id": 5805,
    "mediaId": 5296,
    "date": "2022-04-18",
    "sentence": "In his 12-page April 6 “interim” report to Fann, Brnovich stated that his office found “serious vulnerabilities that must be addressed and raises questions about the 2020 election in Arizona.”\nThose conclusions appear to contradict mainstream news reports claiming Brnovich uncovered “no evidence of mass fraud in Maricopa County 2020 election results.”\nAlthough Brnovich reported that chain-of-custody procedures were violated, including by Secretary of State <span class='selected-term'>Katie Hobbs</span> (D), Arizona Republic reported, “Attorney general’s report on election in Maricopa County questions procedures, doesn’t allege wrongdoing.”\n“Our review uncovered multiple violations of ballot transportation procedures,” Brnovich wrote on page 7.",
    "author": "",
    "title": "Trump Hints against Endorsement of Brnovich"
  },
  {
    "id": 5701,
    "mediaId": 4091,
    "date": "2022-04-21",
    "sentence": "“The report found that almost $8 million in private, non-governmental grant money was given to targeted counties (Democrat strongholds) under the direction of Democrat Secretary of State <span class='selected-term'>Katie Hobbs</span> in the 2020 election.",
    "author": "JD Heyes",
    "title": "Arizona AG Brnovich sends notice to state Senate, says criminal prosecutions coming in relation to 2020 election"
  },
  {
    "id": 4931,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The defendants are Lake’s Democrat opponent in the gubernatorial race <span class='selected-term'>Katie Hobbs</span>, the Maricopa County Board of Supervisors, and the Pima County Board of Supervisors.",
    "author": "Summer Lane",
    "title": "Kari Lake files injunction to STOP voting machines in Arizona"
  }
]