[
  {
    "id": 3729,
    "mediaId": 8475,
    "date": "2022-01-19",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span> will be breaking the law if she shuts down the system that allows congressional and legislative candidates to collect signatures online so they can qualify for the ballot, the Attorney General’s Office warned Tuesday.",
    "author": "Jeremy Duda",
    "title": "Arizona AG’s Office: Hobbs can’t legally shut down online signature portal"
  },
  {
    "id": 3657,
    "mediaId": 2578,
    "date": "2022-01-19",
    "sentence": "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State <span class='selected-term'>Katie Hobbs</span> for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General Mark Brnovich for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "author": "Jordan Conradson",
    "title": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022"
  },
  {
    "id": 4263,
    "mediaId": 2748,
    "date": "2022-01-20",
    "sentence": "Senate Majority Leadership Applauds AG Brnovich for Once Again Calling Out Secretary of State Hobbs for Failing to Comply with Elections Law\nIn response to numerous complaints on Secretary of State <span class='selected-term'>Katie Hobbs</span> for warning that the electronic system E-Qual will be shut down in March, the Senate Majority Leadership commends Attorney General Mark Brnovich for taking action and issuing the letter regarding “Availability of E-Qual for 2022 Legislative & Congressional Candidates,” concerning her absurd violations of state statute.",
    "author": "",
    "title": "AZ Attorney General Mark Brnovich Threatens To Prosecute Soros-Funded Secretary of State Katie Hobbs For Rigging 2022"
  },
  {
    "id": 3548,
    "mediaId": 2664,
    "date": "2022-01-28",
    "sentence": "MSNBC's Rachel Maddow did not mince words when she criticized Arizona Attorney General Mark Brnovich (R) for his failure to look into the fake electors' scandal after the case was forwarded to his office from the Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Meaghan Ellis",
    "title": "Maddow lays out a damning timeline as she slams Arizona's attorney general for ignoring phony electors scandal"
  },
  {
    "id": 3023,
    "mediaId": 2512,
    "date": "2022-01-28",
    "sentence": "MSNBC's Rachel Maddow did not mince words when she criticized Arizona Attorney General Mark Brnovich (R) for his failure to look into the fake electors' scandal after the case was forwarded to his office from the Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Meaghan Ellis",
    "title": "Rachel Maddow slams Arizona AG for failure to deal with electors scandal"
  },
  {
    "id": 1856,
    "mediaId": 2520,
    "date": "2022-02-07",
    "sentence": "Brnovich announced Friday he had reached agreements with the State Bar of Arizona, which licenses and regulates attorneys, stemming from two ethics complaints filed against him and attorney general lawyers by Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat vying for her party’s gubernatorial nomination, and the Arizona Board of Regents.",
    "author": "Yvonne Wingett Sanchez",
    "title": "McGuire calls on Brnovich to release records related Bar complaints"
  },
  {
    "id": 1824,
    "mediaId": 8326,
    "date": "2022-02-08",
    "sentence": "Earlier on Monday, one of his rival candidates, former Arizona National Guard leader Mick McGuire, called on Brnovich to release records from the State Bar’s investigation of the complaints filed by Secretary of State <span class='selected-term'>Katie Hobbs</span> and the Arizona Board of Regents.",
    "author": "Laurie Roberts",
    "title": "AG Mark Brnovich wants to send troops to the border (and himself to the Senate)"
  },
  {
    "id": 2158,
    "mediaId": 2746,
    "date": "2022-02-08",
    "sentence": "PHOENIX — Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> is suing Attorney General Mark Brnovich after he threatened to prosecute her if she temporarily shuts down for a required update to an online system that allows election candidates to collect the signatures they need to qualify for the ballot.",
    "author": "Bob Christie",
    "title": "Arizona elections chief sues AG over prosecution threat"
  },
  {
    "id": 1840,
    "mediaId": 8475,
    "date": "2022-02-09",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span> is going to court against Attorney General Mark Brnovich, asking a Maricopa County judge to bar him from bringing what she argues would be baseless criminal charges against her over a scheduled, temporary shutdown of the state’s online signature-gathering website for congressional and legislative candidates.",
    "author": "Jeremy Duda",
    "title": "Katie Hobbs takes Arizona AG Mark Brnovich to court over E-Qual threat"
  },
  {
    "id": 1363,
    "mediaId": 2664,
    "date": "2022-02-14",
    "sentence": "The group, which called themselves 'the Sovereign Citizens of the State of Arizona,' never sought that permission, Secretary of State <span class='selected-term'>Katie Hobbs</span>' office said.\"",
    "author": "Bob Brigham",
    "title": "Trump's fake electors illegally used state seal — but GOP attorney general has done nothing: report"
  },
  {
    "id": 282,
    "mediaId": 2520,
    "date": "2022-02-24",
    "sentence": "Karrin Taylor Robson, the other major GOP candidate for governor, and Democrat <span class='selected-term'>Katie Hobbs</span> have thus far been silent, which might have been a good strategy for Lake.",
    "author": "Laurie Roberts",
    "title": "No, Kari Lake, what is going on at the border isn't remotely like what is going on in Ukraine"
  },
  {
    "id": 646,
    "mediaId": 8475,
    "date": "2022-02-24",
    "sentence": "An attorney for Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> urged a judge Wednesday to stop state Attorney General Mark Brnovich from pursuing a criminal action against her for planning to take a candidate signature-gathering system offline for maintenance.",
    "author": "Michael McDaniel",
    "title": "Arizona secretary of state urges judge to halt AG prosecution threat over election system maintenance"
  },
  {
    "id": 119,
    "mediaId": 8475,
    "date": "2022-02-25",
    "sentence": "Local\nSecretary of State <span class='selected-term'>Katie Hobbs</span> will temporarily shut down Arizona's online signature-gathering portal for candidates next month, despite a judge's refusal to preemptively block Attorney General Mark Brnovich from taking legal action against her for it.",
    "author": "Jeremy Duda",
    "title": "Hobbs will shut down, update Az online election petitions after judge denies GOP court move"
  },
  {
    "id": 17048,
    "mediaId": 8345,
    "date": "2022-02-26",
    "sentence": "PHOENIX – A judge this week declined Secretary of State <span class='selected-term'>Katie Hobbs</span>' request for an order blocking Arizona's attorney general from prosecuting her if she temporarily shuts down a candidate signature portal for a required update.",
    "author": "Associated Press",
    "title": "Arizona judge declines Katie Hobbs’ request to block Brnovich threats"
  },
  {
    "id": 17064,
    "mediaId": 8345,
    "date": "2022-03-03",
    "sentence": "Republican Sen. Vince Leach introduced the bill after Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> filed a bar complaint against Republican Attorney General Mark Brnovich.",
    "author": "Associated Press",
    "title": "Bill would make it harder for bar to discipline lawyers"
  },
  {
    "id": 17337,
    "mediaId": 8350,
    "date": "2022-03-03",
    "sentence": "Republican Sen. Vince Leach introduced the bill after Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> filed a bar complaint against Republican Attorney General Mark Brnovich.",
    "author": "ASSOCIATED PRESS",
    "title": "Arizona Senate approves bill that would make it harder for bar to discipline lawyers"
  },
  {
    "id": 10757,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "Brnovich also was on the receiving end of separate ethics complaints from Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> and the Arizona Board of Regents, which oversees the state universities.",
    "author": "",
    "title": "The Arizona Republican Caught in a Vise by Trump’s Big Lie"
  },
  {
    "id": 15976,
    "mediaId": 8347,
    "date": "2022-03-12",
    "sentence": "PHOENIX (AP) — Republican Attorney General Mark Brnovich and Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> both urged the state Supreme Court not to accept a petition filed by the Arizona Republican Party asking to strike down early voting laws used by 90% of voters.",
    "author": "Associated Press",
    "title": "Brnovich, Hobbs urge court to reject GOP early ballot suit"
  },
  {
    "id": 9682,
    "mediaId": 2601,
    "date": "2022-03-30",
    "sentence": "In a letter sent Tuesday, Attorney General Mark Brnovich delegated his powers to enforce criminal action against crooked <span class='selected-term'>Katie Hobbs</span> for shutting down the online candidate petition portal and intentionally violating the law.",
    "author": "MJA",
    "title": "Arizona AG Mark Brnovich Refers Criminal Action Against AZ Secretary of State For Election Crimes"
  },
  {
    "id": 9135,
    "mediaId": 2662,
    "date": "2022-03-30",
    "sentence": "In a letter sent Tuesday, Attorney General Mark Brnovich delegated his powers to enforce criminal action against crooked <span class='selected-term'>Katie Hobbs</span> for shutting down the online candidate petition portal and intentionally violating the law.",
    "author": "Jordan Conradson",
    "title": "JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State Katie Hobbs For Election Crimes"
  },
  {
    "id": 9440,
    "mediaId": 4418,
    "date": "2022-03-31",
    "sentence": "FOX News reports:\nTRENDING: JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State <span class='selected-term'>Katie Hobbs</span> For Election Crimes\nFlorida’s registered Republican voters outnumber Democrats by over 100K for first time\nA red wave is brewing in Florida as registered Republican voters now outnumber Democrats by over 100,000 for the first time in the state’s history, according to data obtained by Fox News Digital.",
    "author": "Jake Lambert",
    "title": "REPORT: Registered Republican Voters Now Outnumber Democrats In Florida By Over 100,000"
  },
  {
    "id": 7494,
    "mediaId": 4418,
    "date": "2022-03-31",
    "sentence": "Advertisement – story continues below\nJUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State <span class='selected-term'>Katie Hobbs</span> For Election Crimes\nDue to Katie Hobbs’ deliberate malfeasance, candidates now struggle to meet the signature requirement before the Monday, April 4th deadline.",
    "author": "Jake Lambert",
    "title": "WATCH: Arizona State Rep. Mark Finchem on Katie Hobbs’ Potential Prosecution: “She Knowingly Did This. I Don’t See How This Doesn’t End Up In Some Kind of a Conviction”"
  },
  {
    "id": 7145,
    "mediaId": 2662,
    "date": "2022-03-31",
    "sentence": "JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State <span class='selected-term'>Katie Hobbs</span> For Election Crimes\nDue to Katie Hobbs’ deliberate malfeasance, candidates now struggle to meet the signature requirement before the Monday, April 4th deadline.",
    "author": "Jordan Conradson",
    "title": "WATCH: Arizona State Rep. Mark Finchem on Katie Hobbs’ Potential Prosecution: “She Knowingly Did This. I Don’t See How This Doesn’t End Up In Some Kind of a Conviction”"
  },
  {
    "id": 5705,
    "mediaId": 4091,
    "date": "2022-04-12",
    "sentence": "According to the report, Democratic strongholds received nearly $8 million in private, non-governmental grant money under the direction of Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat, during the 2020 election.",
    "author": "Cassie B.",
    "title": "Criminal prosecutions for Maricopa County election fraud are coming, according to Arizona AG’s interim report"
  },
  {
    "id": 5805,
    "mediaId": 5296,
    "date": "2022-04-18",
    "sentence": "In his 12-page April 6 “interim” report to Fann, Brnovich stated that his office found “serious vulnerabilities that must be addressed and raises questions about the 2020 election in Arizona.”\nThose conclusions appear to contradict mainstream news reports claiming Brnovich uncovered “no evidence of mass fraud in Maricopa County 2020 election results.”\nAlthough Brnovich reported that chain-of-custody procedures were violated, including by Secretary of State <span class='selected-term'>Katie Hobbs</span> (D), Arizona Republic reported, “Attorney general’s report on election in Maricopa County questions procedures, doesn’t allege wrongdoing.”\n“Our review uncovered multiple violations of ballot transportation procedures,” Brnovich wrote on page 7.",
    "author": "",
    "title": "Trump Hints against Endorsement of Brnovich"
  },
  {
    "id": 5701,
    "mediaId": 4091,
    "date": "2022-04-21",
    "sentence": "“The report found that almost $8 million in private, non-governmental grant money was given to targeted counties (Democrat strongholds) under the direction of Democrat Secretary of State <span class='selected-term'>Katie Hobbs</span> in the 2020 election.",
    "author": "JD Heyes",
    "title": "Arizona AG Brnovich sends notice to state Senate, says criminal prosecutions coming in relation to 2020 election"
  },
  {
    "id": 6047,
    "mediaId": 2822,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "BOB CHRISTIE - Associated Press",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  },
  {
    "id": 5511,
    "mediaId": 2680,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "BOB CHRISTIE",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  },
  {
    "id": 4691,
    "mediaId": 8350,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "ASSOCIATED PRESS",
    "title": "Republican Arizona AG Brnovich suing Democratic Sec. Hobbs over election procedures manual"
  },
  {
    "id": 4702,
    "mediaId": 8251,
    "date": "2022-04-22",
    "sentence": "PHOENIX — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "",
    "title": "Brnovich sues Secretary of State in dispute over election procedures"
  },
  {
    "id": 4824,
    "mediaId": 8347,
    "date": "2022-04-22",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is suing Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "Associated Press",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  },
  {
    "id": 5103,
    "mediaId": 8296,
    "date": "2022-04-24",
    "sentence": "",
    "author": "",
    "title": "Yavapai County GOP, Brnovich to file claim against Hobbs"
  }
]