[
  {
    "id": 4580,
    "mediaId": 2590,
    "date": "2022-01-12",
    "sentence": "Fear that the GOP might use secretary of state positions to more aggressively suppress votes — or to influence and potentially overturn future elections in ways secretaries like Benson, Raffensperger and Arizona’s <span class='selected-term'>Katie Hobbs</span> (D) prevented in 2020 — has also driven a fundraising boom on the Democratic side.",
    "author": "Travis Waldron",
    "title": "GOP Election Deniers Are On Pace To Raise Record Sums For Secretary Of State Races"
  },
  {
    "id": 3688,
    "mediaId": 8475,
    "date": "2022-01-21",
    "sentence": "Once she receives the maps, Secretary of State <span class='selected-term'>Katie Hobbs</span> will send them to the counties so election officials can update their voter registration information to incorporate the new districts.",
    "author": "Jeremy Duda",
    "title": "Arizona Redistricting Commission gives final certification to new election maps"
  },
  {
    "id": 3638,
    "mediaId": 2550,
    "date": "2022-01-24",
    "sentence": "On the Democratic side, Secretary of State <span class='selected-term'>Katie Hobbs</span> brought in close to $3 million and had $1.5 million to spend.",
    "author": "",
    "title": "Morning Digest: GOP establishment rallies behind challenger to indicted Nebraska congressman"
  },
  {
    "id": 3630,
    "mediaId": 2664,
    "date": "2022-01-24",
    "sentence": "Ducey appeared to have missed reports in Dec. 2020, Secretary of State <span class='selected-term'>Katie Hobbs</span> sent a cease-and-desist letter to the so-called sovereign citizens' group saying that the state requires people to get permission to \"use, display or otherwise employ any facsimile, copy, likeness, imitation or other resemblance\" to the state seal.",
    "author": "Sarah K. Burris",
    "title": "Arizona governor swears he never knew about the fake Trump electors despite Republican involvement"
  },
  {
    "id": 2888,
    "mediaId": 2512,
    "date": "2022-01-31",
    "sentence": "In 2020, Secretary of State <span class='selected-term'>Katie Hobbs</span>—a Democrat—was Arizona's top \"vote counter.\"",
    "author": "",
    "title": "Now every day in Arizona is January 6"
  },
  {
    "id": 1969,
    "mediaId": 2664,
    "date": "2022-02-07",
    "sentence": "Doug Ducey refused to help him try to overturn his loss and election officials like Georgia Secretary of State Brad Raffensperger (a Republican) and Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> (a Democrat) repeatedly discredited his baseless claims of fraud.",
    "author": "Igor Derysh",
    "title": "More than 80 Trump truthers are aiming for a power grab"
  },
  {
    "id": 1945,
    "mediaId": 2618,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Nick Arama",
    "title": "Capitol Police Issue an Unbelievable Statement After Accusations of Spying on Congress"
  },
  {
    "id": 1363,
    "mediaId": 2664,
    "date": "2022-02-14",
    "sentence": "The group, which called themselves 'the Sovereign Citizens of the State of Arizona,' never sought that permission, Secretary of State <span class='selected-term'>Katie Hobbs</span>' office said.\"",
    "author": "Bob Brigham",
    "title": "Trump's fake electors illegally used state seal — but GOP attorney general has done nothing: report"
  },
  {
    "id": 100,
    "mediaId": 8475,
    "date": "2022-02-21",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span>, the Democratic frontrunner, called on the Senate to raise the limit and save K-12 schools from \"this manufactured funding crisis.\"",
    "author": "Jeremy Duda",
    "title": "No Republican candidates for Arizona governor are calling for school cuts to be stopped"
  },
  {
    "id": 718,
    "mediaId": 8428,
    "date": "2022-02-22",
    "sentence": "Republican Kari Lake, a former news anchor, is the only candidate who can defeat Democrat <span class='selected-term'>Katie Hobbs</span> in Arizona’s gubernatorial race this November, a new poll found.",
    "author": "Alex Caldwell",
    "title": "Kari Lake is the only Republican AHEAD of Dem. Katie Hobbs in Arizona governor’s race, new poll finds"
  },
  {
    "id": 17065,
    "mediaId": 2641,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "",
    "title": "GOP Lawsuit Looks to Throw Out Absentee Voting in Arizona"
  },
  {
    "id": 17019,
    "mediaId": 2590,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona Republicans File Lawsuit To Throw Out Absentee Voting"
  },
  {
    "id": 17268,
    "mediaId": 2746,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "Jonathan J. Cooper",
    "title": "Republicans file lawsuit to end vote-by-mail absentee voting in Arizona"
  },
  {
    "id": 17216,
    "mediaId": 2594,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "Via AP news wire",
    "title": "GOP lawsuit looks to throw out absentee voting in Arizona"
  },
  {
    "id": 17355,
    "mediaId": 8350,
    "date": "2022-02-28",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "ASSOCIATED PRESS",
    "title": "GOP lawsuit looks to throw out absentee voting in Arizona"
  },
  {
    "id": 17035,
    "mediaId": 8345,
    "date": "2022-03-01",
    "sentence": "“I look forward to once again defending the voters of Arizona and defeating this ridiculous attempt to undermine our elections,” said Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the case.",
    "author": "Associated Press",
    "title": "GOP lawsuit looks to throw out absentee voting in Arizona"
  },
  {
    "id": 17337,
    "mediaId": 8350,
    "date": "2022-03-03",
    "sentence": "Republican Sen. Vince Leach introduced the bill after Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> filed a bar complaint against Republican Attorney General Mark Brnovich.",
    "author": "ASSOCIATED PRESS",
    "title": "Arizona Senate approves bill that would make it harder for bar to discipline lawyers"
  },
  {
    "id": 17064,
    "mediaId": 8345,
    "date": "2022-03-03",
    "sentence": "Republican Sen. Vince Leach introduced the bill after Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> filed a bar complaint against Republican Attorney General Mark Brnovich.",
    "author": "Associated Press",
    "title": "Bill would make it harder for bar to discipline lawyers"
  },
  {
    "id": 17324,
    "mediaId": 2745,
    "date": "2022-03-03",
    "sentence": "She is now general counsel for the Arizona secretary of state, Democrat <span class='selected-term'>Katie Hobbs</span>.",
    "author": "",
    "title": "Opinion Arizona Republicans keep churning out new election legislation targeting voting access"
  },
  {
    "id": 12682,
    "mediaId": 2662,
    "date": "2022-03-04",
    "sentence": "With her commanding position in recent primary surveys and her strong performance against Democrat <span class='selected-term'>Katie Hobbs</span>, Kari Lake is the Republican frontrunner in the Arizona Gubernatorial race.”\nThis poll of 1,000 likely general election voters was conducted through a live survey that collected 50.7% of the results from landlines and 49.3% from cell phones.",
    "author": "Jordan Conradson",
    "title": "POLL: Trump-Endorsed Arizona Gubernatorial Candidate Is The ONLY Republican Who Can Beat Radical Leftist Soros Funded Katie Hobbs"
  },
  {
    "id": 15290,
    "mediaId": 2662,
    "date": "2022-03-07",
    "sentence": "We were told that the Party supported the bill, which has proven to be false and that this was intended to fix the utter mess <span class='selected-term'>Katie Hobbs</span> has made of our election procedures for 2022.",
    "author": "Jordan Conradson",
    "title": "UPDATE: Arizona Republicans Look To Repeal Language In Bill Changing Precinct Committeemen Election Rules"
  },
  {
    "id": 10887,
    "mediaId": 2662,
    "date": "2022-03-08",
    "sentence": "This bill would not have been necessary if <span class='selected-term'>Katie Hobbs</span> would have taken appropriate measures to be prepared for redistricting during a major election.",
    "author": "Jordan Conradson",
    "title": "Arizona Legislature Working To Repeal PC Purge Bill – Anti-Precinct Committeemen Elections HB2839"
  },
  {
    "id": 15347,
    "mediaId": 8475,
    "date": "2022-03-10",
    "sentence": "\"As governor, I would not only veto this extremist bill, I would also trust Arizona women to make health care decisions alongside doctors, not politicians,\" said Democratic gubernatorial candidate and current Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Michael McDaniel",
    "title": "Transgender and abortion bills highlight growing division of Arizona lawmakers"
  },
  {
    "id": 10757,
    "mediaId": 2658,
    "date": "2022-03-10",
    "sentence": "Brnovich also was on the receiving end of separate ethics complaints from Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> and the Arizona Board of Regents, which oversees the state universities.",
    "author": "",
    "title": "The Arizona Republican Caught in a Vise by Trump’s Big Lie"
  },
  {
    "id": 15976,
    "mediaId": 8347,
    "date": "2022-03-12",
    "sentence": "PHOENIX (AP) — Republican Attorney General Mark Brnovich and Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> both urged the state Supreme Court not to accept a petition filed by the Arizona Republican Party asking to strike down early voting laws used by 90% of voters.",
    "author": "Associated Press",
    "title": "Brnovich, Hobbs urge court to reject GOP early ballot suit"
  },
  {
    "id": 11105,
    "mediaId": 2520,
    "date": "2022-03-16",
    "sentence": "Now, it’ll be left to Secretary of State <span class='selected-term'>Katie Hobbs</span>, the Democrats’ likely pick for governor, to defend our right to vote from the comfort of our kitchen table.",
    "author": "Laurie Roberts",
    "title": "The Arizona GOP has a genius plan to sabotage the Arizona GOP"
  },
  {
    "id": 11474,
    "mediaId": 8428,
    "date": "2022-03-17",
    "sentence": "A recent survey showed that Lake, a former news anchor, is the only Republican candidate expected to be able to defeat Secretary of State <span class='selected-term'>Katie Hobbs</span>, D-Ariz., in this crucial gubernatorial race.",
    "author": "Timothy Frudd",
    "title": "Kari Lake easily qualifies for the August primary"
  },
  {
    "id": 11173,
    "mediaId": 2660,
    "date": "2022-03-17",
    "sentence": "The lawsuit names as defendants both the state and Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat running for governor.",
    "author": "Amy Sherman",
    "title": "Voting by mail has been popular in Arizona for decades. Now the state GOP wants to ban it"
  },
  {
    "id": 13419,
    "mediaId": 8475,
    "date": "2022-03-18",
    "sentence": "Rep. Richard Andrade has withdrawn his endorsement of Democratic gubernatorial frontrunner <span class='selected-term'>Katie Hobbs</span> over her role in the firing of former Senate staffer Talonya Adams and is now backing Marco Lopez, one of her rivals in the primary elections.",
    "author": "Jeremy Duda",
    "title": "Arizona Rep. Andrade un-endorses Hobbs, switches to Lopez"
  },
  {
    "id": 12463,
    "mediaId": 2629,
    "date": "2022-03-25",
    "sentence": "\"Hello, I just got a confirmation from Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span> [D] that I am the first congressional candidate certified for the 2022 ballot in Arizona's Congressional District Number 2,\" the conspiracy theorist told his followers.",
    "author": "Brandon Gage",
    "title": "QAnon Founder Will Appear On Arizona GOP Primary Ballot"
  },
  {
    "id": 9440,
    "mediaId": 4418,
    "date": "2022-03-31",
    "sentence": "FOX News reports:\nTRENDING: JUST IN: Arizona Attorney General Mark Brnovich Refers Criminal Action Against AZ Secretary of State <span class='selected-term'>Katie Hobbs</span> For Election Crimes\nFlorida’s registered Republican voters outnumber Democrats by over 100K for first time\nA red wave is brewing in Florida as registered Republican voters now outnumber Democrats by over 100,000 for the first time in the state’s history, according to data obtained by Fox News Digital.",
    "author": "Jake Lambert",
    "title": "REPORT: Registered Republican Voters Now Outnumber Democrats In Florida By Over 100,000"
  },
  {
    "id": 7236,
    "mediaId": 2664,
    "date": "2022-03-31",
    "sentence": "One prominent gubernatorial candidate, Kari Lake in Arizona, has even called for arresting her opponent, Secretary of State <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Matthew Chapman",
    "title": "New ad begs Trump to rescind endorsement of 'grifting loser' AG candidate in Michigan"
  },
  {
    "id": 9948,
    "mediaId": 2578,
    "date": "2022-04-01",
    "sentence": "— Secretary <span class='selected-term'>Katie Hobbs</span> (@SecretaryHobbs) March 30, 2022\nThe Democrats will likely utilize lawfare to repeal this measure because they cannot win without illegal and fraudulent votes.",
    "author": "Jordan Conradson",
    "title": "HUGE: Arizona Republicans Pass HB2492 Requiring ALL Voters To Provide Proof Of Citizenship Upon Registering To Vote"
  },
  {
    "id": 8768,
    "mediaId": 8251,
    "date": "2022-04-05",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "",
    "title": "Arizona court declines GOP request to invalidate mail voting"
  },
  {
    "id": 8804,
    "mediaId": 2680,
    "date": "2022-04-05",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "JONATHAN J. COOPER",
    "title": "Arizona court declines GOP request to invalidate mail voting"
  },
  {
    "id": 8560,
    "mediaId": 2631,
    "date": "2022-04-05",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "",
    "title": "Arizona Supreme Court rejects GOP request to invalidate mail voting"
  },
  {
    "id": 8508,
    "mediaId": 2526,
    "date": "2022-04-05",
    "sentence": "The Democrat frontrunner for governor in Arizona, <span class='selected-term'>Katie Hobbs</span>, did not say if she would support any time limits on abortion when asked.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Arizona Democrat Gov. Candidate Wants No Limits on Abortion"
  },
  {
    "id": 8542,
    "mediaId": 2664,
    "date": "2022-04-06",
    "sentence": "\"Today, the Arizona Supreme Court dismissed a dangerous lawsuit that threatened early voting in the state and challenged provisions of the Elections Procedures Manual,\" tweeted <span class='selected-term'>Katie Hobbs</span>, Arizona's Democratic secretary of state.",
    "author": "Jon Skolnik",
    "title": "GOP-led Arizona Supreme Court shuts down Republican bid to ban early voting"
  },
  {
    "id": 8324,
    "mediaId": 2548,
    "date": "2022-04-06",
    "sentence": "Democratic Arizona gubernatorial candidate <span class='selected-term'>Katie Hobbs</span> refused to answer Sunday whether abortions conducted in Arizona should have a time limit based on the baby’s gestational age.",
    "author": "Mary Rooke",
    "title": "Arizona Democratic Gubernatorial Candidate Wants No Limits On Abortion"
  },
  {
    "id": 8422,
    "mediaId": 2888,
    "date": "2022-04-06",
    "sentence": "Earlier this week, Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat and a defendant in the lawsuit, condemned the state GOP’s attempt to eradicate mail-in voting.",
    "author": "Chris Walker",
    "title": "Arizona Supreme Court Rejects State GOP Lawsuit to Eliminate Mail-In Voting"
  },
  {
    "id": 8588,
    "mediaId": 2730,
    "date": "2022-04-06",
    "sentence": "In a letter to Arizona Secretary of State <span class='selected-term'>Katie Hobbs</span>, Ducey explained that this type of surgery is irreversible and has a lasting impact on a person’s life.",
    "author": "Madeline Leesman",
    "title": "GOP Rep Says People Should Hit a Certain Age Before Making ‘Life-Altering’ Decisions About Gender Identity"
  },
  {
    "id": 7052,
    "mediaId": 2512,
    "date": "2022-04-06",
    "sentence": "Arizona voters will still be able to vote early, access drop boxes, and make their voices heard.pic.twitter.com/awWo5A6PF3\n— Secretary <span class='selected-term'>Katie Hobbs</span> (@Secretary Katie Hobbs) 1649203544\nHobbs is currently seeking the Democratic gubernatorial nomination.",
    "author": "Brandon Gage",
    "title": "'Petitioners have not persuaded the Court': Arizona Supreme Court tosses GOP lawsuit to eliminate early voting"
  },
  {
    "id": 8012,
    "mediaId": 8345,
    "date": "2022-04-06",
    "sentence": "The lawsuit also made two other arguments: that Secretary of State <span class='selected-term'>Katie Hobbs</span> erred by including rules for ballot drop boxes in the election procedures manual and by not including signature verification procedures.",
    "author": "",
    "title": "Arizona court declines GOP request to invalidate mail voting"
  },
  {
    "id": 7529,
    "mediaId": 8428,
    "date": "2022-04-08",
    "sentence": "In a poll released on Thursday, Lake was reported as “out-polling” every Republican and Democrat gubernatorial candidate in the Grand Canyon State, leaving Democrat opponent <span class='selected-term'>Katie Hobbs</span> in the dust.",
    "author": "Summer Lane",
    "title": "Trump holds fundraiser for Kari Lake at Mar-a-Lago"
  },
  {
    "id": 8818,
    "mediaId": 2629,
    "date": "2022-04-08",
    "sentence": "",
    "author": "Chibueze Godwin",
    "title": "Arizona Supreme Court Rejects GOP Move To Abolish Mail Voting"
  },
  {
    "id": 6007,
    "mediaId": 2634,
    "date": "2022-04-15",
    "sentence": "Governor: Doug Ducey, a Republican, is term-limited; the next election is in 2022\nLegislature: Republicans control both chambers\nState Supreme Court: All seven justices were appointed by Republican governors\nElections administered by Secretary of State <span class='selected-term'>Katie Hobbs</span>, a Democrat\nOther key players: Kelli Ward, state GOP chair\nCan they steal it?",
    "author": "Matt Ford",
    "title": "The Six States That Could Determine Whether Republicans Steal the 2024 Election"
  },
  {
    "id": 4703,
    "mediaId": 8475,
    "date": "2022-04-19",
    "sentence": "Secretary of State <span class='selected-term'>Katie Hobbs</span> became the face of Democratic opposition to GOP efforts to question the election during the partisan election “audit” in 2021, appearing regularly on national news shows where she criticized the state Senate’s review of Maricopa County’s election.",
    "author": "Jim Small",
    "title": "Election lies boost the bottom lines of prominent Arizona Republican candidates"
  },
  {
    "id": 5511,
    "mediaId": 2680,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "BOB CHRISTIE",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  },
  {
    "id": 4691,
    "mediaId": 8350,
    "date": "2022-04-21",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is joining with Republican Party officials to sue Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "ASSOCIATED PRESS",
    "title": "Republican Arizona AG Brnovich suing Democratic Sec. Hobbs over election procedures manual"
  },
  {
    "id": 5125,
    "mediaId": 2548,
    "date": "2022-04-22",
    "sentence": "She doesn’t care about working-class people.”\nListen to that and much more in this week’s unmissable Deep Dive podcast interview: https://t.co/Bw5mBA7LkA\n— POLITICO Playbook (@playbookdc) April 22, 2022\nGallego went on to accuse Sinema of not caring about other Democrats or her constituents, as evidenced by her lack of appearances on the campaign trail for Kelly or gubernatorial candidate <span class='selected-term'>Katie Hobbs</span>.",
    "author": "Michael Ginsberg",
    "title": "Rep. Ruben Gallego Trashes Sen. Sinema, Says ‘She’s All About Herself’"
  },
  {
    "id": 4824,
    "mediaId": 8347,
    "date": "2022-04-22",
    "sentence": "PHOENIX (AP) — Republican Arizona Attorney General Mark Brnovich is suing Democratic Secretary of State <span class='selected-term'>Katie Hobbs</span> in an escalation of a dispute over the election procedures manual she is required to complete.",
    "author": "Associated Press",
    "title": "Brnovich sues Hobbs in dispute over election procedures"
  },
  {
    "id": 4931,
    "mediaId": 8428,
    "date": "2022-04-23",
    "sentence": "The defendants are Lake’s Democrat opponent in the gubernatorial race <span class='selected-term'>Katie Hobbs</span>, the Maricopa County Board of Supervisors, and the Pima County Board of Supervisors.",
    "author": "Summer Lane",
    "title": "Kari Lake files injunction to STOP voting machines in Arizona"
  }
]