[
  {
    "id": 5796,
    "mediaId": 2528,
    "date": "2022-02-11",
    "sentence": "At one point during the investigation, Schwab testified to investigators that <span class='selected-term'>Schweikert</span> was \"very adamant that he did not want a whole bunch of dinners in DC showing up on his FECs,\" directing Schwab to pay for those transactions personally and then charge Schweikert's campaign account for \"consulting fees\" to conceal the real purpose.",
    "author": "Bryan Metzger",
    "title": "Arizona GOP Rep. David Schweikert fined $125,000 by Federal Election Commission for repeated campaign finance law violations"
  },
  {
    "id": 5757,
    "mediaId": 2699,
    "date": "2022-02-11",
    "sentence": "The $125,000 FEC fine for the “2020 Fiscal Hero” is more than double the penalty he incurred from the House ethics probe, which, in addition to the financial wrongdoing, also found that <span class='selected-term'>Schweikert</span> impeded congressional investigators.",
    "author": "Roger Sollenberger",
    "title": "GOP Congressman Fined $125,000 For Financial Violations"
  },
  {
    "id": 5871,
    "mediaId": 2512,
    "date": "2022-02-13",
    "sentence": "\"Throughout the course of this investigation, Representative <span class='selected-term'>Schweikert</span> made vague or misleading statements to the (investigative subcommittee) and (the Office of Congressional Ethics) that allowed him to evade the statute of limitations for the most egregious violations of campaign finance laws, his document productions were slow or non-responsive to several of the ISC’s requests for information regarding (Federal Election Commission) errors, and he gave self-serving testimony that lacked candor,\" the report said.",
    "author": "Meaghan Ellis",
    "title": "GOP lawmaker hit with $125K FEC fine for repeated campaign law violations"
  },
  {
    "id": 5381,
    "mediaId": 2676,
    "date": "2022-02-14",
    "sentence": "\"Throughout the course of this investigation, Representative <span class='selected-term'>Schweikert</span> made vague or misleading statements to the (investigative subcommittee) and (the Office of Congressional Ethics) that allowed him to evade the statute of limitations for the most egregious violations of campaign finance laws, his document productions were slow or non-responsive to several of the ISC's requests for information regarding (Federal Election Commission) errors, and he gave self-serving testimony that lacked candor,\" the report said.",
    "author": "Meaghan Ellis",
    "title": "GOP lawmaker fined for campaign law violations"
  },
  {
    "id": 4067,
    "mediaId": 2540,
    "date": "2022-03-01",
    "sentence": "The last member to be reprimanded was Arizona Republican Rep. David <span class='selected-term'>Schweikert</span> in 2020, following a House Ethics Committee investigation found he had committed a series of campaign finance violations.",
    "author": "Chris Cillizza",
    "title": "Is Kevin McCarthy actually going to *do* something about Marjorie Taylor Greene?"
  },
  {
    "id": 1206,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "We just want a good, conservative Republican to win.”\nRep. Ronny Jackson (R-TX) could only offer, \"Sure, why not?” while Rep. David <span class='selected-term'>Schweikert</span> (R-AZ) was outright dismissive, telling the Beast, \"We actually are sort of in the time of the celebrity candidate.",
    "author": "Tom Boggioni",
    "title": "Sarah Palin facing shrugs and 'outright hostility' from Republicans over new political bid: report"
  },
  {
    "id": 344,
    "mediaId": 2831,
    "date": "2022-04-22",
    "sentence": "In 2014, Representative David <span class='selected-term'>Schweikert</span>, a Republican, introduced the Secret Science Reform Act, which would have prohibited the EPA from using any scientific research unless all its underlying data was made public.",
    "author": "James Goodwin",
    "title": "Why Some Conservative Jurists Won’t Follow the Science"
  }
]