[
  {
    "id": 6391,
    "mediaId": 2658,
    "date": "2022-01-21",
    "sentence": "He recently was the senior political and legislative advisor to the United States Air Force Civil Engineers and an alum of Rep. David <span class='selected-term'>Schweikert</span> (R-Ariz.) and former Rep. Mick Mulvaney (R-S.C.).",
    "author": "",
    "title": "Another record year for K Street"
  },
  {
    "id": 6651,
    "mediaId": 2537,
    "date": "2022-01-28",
    "sentence": "Ohio girls swimmer/diver: Melanie <span class='selected-term'>Schweikert</span>, Kings – The junior won the 100 backstroke at the Eastern Cincinnati Swimming and Diving Championship Jan. 22.",
    "author": "Melanie Laughman",
    "title": "Enquirer names Cincinnati high school athletes of week for Jan. 28"
  },
  {
    "id": 6227,
    "mediaId": 2924,
    "date": "2022-02-04",
    "sentence": "Rep. Suzan DelBene, D-Wash., and David <span class='selected-term'>Schweikert</span> R-Ariz., introduced the Virtual Currency Tax Fairness Act, which they said would \"create a workable structure for taxing purchases made with virtual currency.\"",
    "author": "Rob Lenihan",
    "title": "Exempting Some Crypto Deals From IRS Makes Sense, Lawmakers Say"
  },
  {
    "id": 5736,
    "mediaId": 2570,
    "date": "2022-02-05",
    "sentence": "Designed to simplify tax burdens on daily crypto users who must now report even the smallest capital gains, the Virtual Currency Tax Fairness Act—an amendment to the Internal Revenue Service's tax code—was announced this week by crypto-friendly representatives <span class='selected-term'>Schweikert</span>, Suzan DelBene (D-Wash.), Darren Soto (D-Fla.) and Tom Emmer (R-Minn.) and would retroactively apply to all qualifying transactions from December 31, 2021 if the legislation becomes law.",
    "author": "Billy Bambrough",
    "title": "Congress Introduces A Radical Crypto Bill To ‘Unleash Innovation’ As The Price Of Bitcoin And Ethereum Suddenly Soar"
  },
  {
    "id": 5773,
    "mediaId": 2554,
    "date": "2022-02-05",
    "sentence": "This week, congressman David <span class='selected-term'>Schweikert</span> said in a statement: \"Virtual currency is reshaping our everyday lives.",
    "author": "Brian McGleenon",
    "title": "Bitcoin surges by 10%: US crypto-bill to 'unleash innovation' - expert makes $100K claim"
  },
  {
    "id": 6065,
    "mediaId": 2592,
    "date": "2022-02-07",
    "sentence": "The Virtual Currency Tax Fairness Act, introduced by Rep. Suzan DelBene, D-Wash., and Rep. David <span class='selected-term'>Schweikert</span>, R-Ariz., on Thursday with support from Rep. Dareen Soto, D-Fla, and Rep. Tom Emmer, R-Minn, aims to provide a clearer framework for the taxation of cryptocurrencies in the United States.",
    "author": "Aakanksha Chaturvedi",
    "title": "What The Virtual Currency Tax Fairness Act Means For Taxpayers"
  },
  {
    "id": 6119,
    "mediaId": 2740,
    "date": "2022-02-11",
    "sentence": "Supreme Court won't let Arizona voters weigh in on tax cut Brnovich takes election manual fight with Hobbs to court Karrin Taylor Robson drops fundraising tactic after questions AZ House Speaker Rusty Bowers wins award for courage\nThe FEC matter came after a separate investigation of <span class='selected-term'>Schweikert</span>’s operations by the House Ethics Committee concluded with Schweikert admitting to 11 rules violations, accepting a reprimand and agreeing to a $50,000 fine.",
    "author": "Yvonne Wingett Sanchez",
    "title": "Rep. David Schweikert's campaign to pay $125,000 fine for 'knowing and willful' reporting violations"
  },
  {
    "id": 5564,
    "mediaId": 2643,
    "date": "2022-02-11",
    "sentence": "\"No one has been more directly harmed by the malfeasance of Congressman <span class='selected-term'>Schweikert</span>'s former Chief of Staff than Friends of David Schweikert,\" said Chris Baker, a spokesperson for Schweikert's campaign committee, in a statement to Newsweek.",
    "author": "Aaron McDade",
    "title": "Rep. David Schweikert's Campaign Committee Fined $125K For Misusing Funds"
  },
  {
    "id": 5757,
    "mediaId": 2699,
    "date": "2022-02-11",
    "sentence": "The $125,000 FEC fine for the “2020 Fiscal Hero” is more than double the penalty he incurred from the House ethics probe, which, in addition to the financial wrongdoing, also found that <span class='selected-term'>Schweikert</span> impeded congressional investigators.",
    "author": "Roger Sollenberger",
    "title": "GOP Congressman Fined $125,000 For Financial Violations"
  },
  {
    "id": 5796,
    "mediaId": 2528,
    "date": "2022-02-11",
    "sentence": "At one point during the investigation, Schwab testified to investigators that <span class='selected-term'>Schweikert</span> was \"very adamant that he did not want a whole bunch of dinners in DC showing up on his FECs,\" directing Schwab to pay for those transactions personally and then charge Schweikert's campaign account for \"consulting fees\" to conceal the real purpose.",
    "author": "Bryan Metzger",
    "title": "Arizona GOP Rep. David Schweikert fined $125,000 by Federal Election Commission for repeated campaign finance law violations"
  },
  {
    "id": 5871,
    "mediaId": 2512,
    "date": "2022-02-13",
    "sentence": "\"Throughout the course of this investigation, Representative <span class='selected-term'>Schweikert</span> made vague or misleading statements to the (investigative subcommittee) and (the Office of Congressional Ethics) that allowed him to evade the statute of limitations for the most egregious violations of campaign finance laws, his document productions were slow or non-responsive to several of the ISC’s requests for information regarding (Federal Election Commission) errors, and he gave self-serving testimony that lacked candor,\" the report said.",
    "author": "Meaghan Ellis",
    "title": "GOP lawmaker hit with $125K FEC fine for repeated campaign law violations"
  },
  {
    "id": 5381,
    "mediaId": 2676,
    "date": "2022-02-14",
    "sentence": "\"Throughout the course of this investigation, Representative <span class='selected-term'>Schweikert</span> made vague or misleading statements to the (investigative subcommittee) and (the Office of Congressional Ethics) that allowed him to evade the statute of limitations for the most egregious violations of campaign finance laws, his document productions were slow or non-responsive to several of the ISC's requests for information regarding (Federal Election Commission) errors, and he gave self-serving testimony that lacked candor,\" the report said.",
    "author": "Meaghan Ellis",
    "title": "GOP lawmaker fined for campaign law violations"
  },
  {
    "id": 5079,
    "mediaId": 2702,
    "date": "2022-02-14",
    "sentence": "Schwab, the agreement says, submitted false consulting invoices to the <span class='selected-term'>Schweikert</span> campaign to “conceal the true purpose of certain disbursements.”\n“No one has been more directly harmed by the malfeasance of Rep. Schweikert’s former chief of staff than Friends of David Schweikert,” said Chris Baker, a spokesman for the campaign.",
    "author": "",
    "title": "Arizona GOP Rep. David Schweikert agrees to FEC fine"
  },
  {
    "id": 5317,
    "mediaId": 2754,
    "date": "2022-02-18",
    "sentence": "One of the greatest hindrances to bitcoin adoption by the general public is its infeasibility as a currency for routine purchases, as it is more closely treated as a stock or other long-term investment from a tax perspective in the U.S.\nDelBene and <span class='selected-term'>Schweikert</span> aimed to alleviate this bottleneck by providing an exemption from taxes in the use of bitcoin as a currency where capital gains amounted to less than $200.",
    "author": "Tyler Durden",
    "title": "Bitcoin's Political Breakthrough Raises Questions About Its Regulatory Future"
  },
  {
    "id": 4067,
    "mediaId": 2540,
    "date": "2022-03-01",
    "sentence": "The last member to be reprimanded was Arizona Republican Rep. David <span class='selected-term'>Schweikert</span> in 2020, following a House Ethics Committee investigation found he had committed a series of campaign finance violations.",
    "author": "Chris Cillizza",
    "title": "Is Kevin McCarthy actually going to *do* something about Marjorie Taylor Greene?"
  },
  {
    "id": 3692,
    "mediaId": 2658,
    "date": "2022-03-03",
    "sentence": "HAPPY BIRTHDAY: NRCC Chair Tom Emmer (R-Minn.) … Reps. David <span class='selected-term'>Schweikert</span> (R-Ariz.) (6-0), Mike Gallagher (R-Wis.) and Bryan Steil (R-Wis.) … Ira Glass … Alex Smith … George Little (5-0), celebrating in Miami … RGA’s Jesse Hunt … Dan Conston … Marc Short … Susan Zirinsky (7-0) … Mayer Brown’s Andrew Olmem … Tim Morrison … Elaina Plott … Alexa Henning … WHO Director-General Tedros Adhanom … Ron Chernow … Peter Mirijanian … Carlton Carroll … America First Policy Institute’s Steve Smith … Hadar Arazi … Cameron French … Michael Remez … POLITICO’s Lily Mihalik Bhandari and Bryan Jablonski Plescia … Jason Dick … Patrick Gavin … Amanda Crane … Laura Engquist of Rep.",
    "author": "",
    "title": "POLITICO Playbook: How gas prices could crush Biden and the Democrats"
  },
  {
    "id": 3911,
    "mediaId": 2835,
    "date": "2022-03-07",
    "sentence": "We’re keeping the Leadership topic rolling with author Gigi <span class='selected-term'>Schweikert</span>, CEO of Lightbridge Academy.",
    "author": "SIM Radio Network",
    "title": "5 Leadership Basics to Inspire Others with Gigi Schweikert"
  },
  {
    "id": 3630,
    "mediaId": 2546,
    "date": "2022-03-08",
    "sentence": "“Next thing I knew, I came in and I had the best couch, the best chairs.”\n<span class='selected-term'>Schweikert</span> didn’t always get along with his colleagues in Congress, but over the years the disagreements have mellowed, like a good slow roast blend — even though they formally reprimanded him in 2020 for violating ethics rules and misusing campaign funds.",
    "author": "Jim Saksa",
    "title": "‘We all sound like it’s the 1990s,’ says Rep. David Schweikert"
  },
  {
    "id": 3167,
    "mediaId": 2658,
    "date": "2022-03-13",
    "sentence": "Democracy Now plans to pitch the ad to other networks, and has also run the ad in the districts of seven House Republicans: Virginia Foxx (N.C.), Mike Garcia (Calif.), Carlos Giménez (Fla.), Yvette Herrell (N.M.), Nicole Malliotakis (N.Y.), David <span class='selected-term'>Schweikert</span> (Ariz.) and Jeff Van Drew (N.J.).",
    "author": "",
    "title": "POLITICO Playbook: As Russia gets bogged down, negotiations heat up"
  },
  {
    "id": 3209,
    "mediaId": 2932,
    "date": "2022-03-15",
    "sentence": "Perma.cc archive of https://soto.house.gov/media/press-releases/soto-<span class='selected-term'>schweikert</span>-foster-and-emmer-lead-irs-letter-ensure-consumers-can-utilize created on 2022-03-14 22:23:00.680448+00:00.",
    "author": "",
    "title": "5CR6-S57W: Soto, Schweikert, Foster and Emmer Lead IRS Lette…"
  },
  {
    "id": 3427,
    "mediaId": 2644,
    "date": "2022-03-17",
    "sentence": "Illegal immigration tramples the rule of law and leaves communities exposed to not only violent criminal gangs but also what Arizona GOP Rep. David <span class='selected-term'>Schweikert</span> calls “economic violence to the working poor.” On the House floor last year, Schweikert warned that opening up America’s borders to a flood of illegal migrants would drive the wages of US citizens downward.",
    "author": "Carrie Sheffield",
    "title": "Biden cuts border funding as his policies are about to overwhelm it"
  },
  {
    "id": 1970,
    "mediaId": 2699,
    "date": "2022-03-21",
    "sentence": "It earned another $77,205 for providing software-related services to the political action committee backing Rep. David S. <span class='selected-term'>Schweikert</span> (R-AZ), who represents Phoenix suburbs.",
    "author": "Jose Pagliery",
    "title": "The Trump Org Finds a New Way to Play Dirty With NY Investigators"
  },
  {
    "id": 1889,
    "mediaId": 2658,
    "date": "2022-03-22",
    "sentence": "With thorny tax issues popping up around even the smallest crypto transactions, Reps. Suzan DelBene (D-Wash.) and David <span class='selected-term'>Schweikert</span> (R-Ariz.) have introduced legislation that would exempt personal transactions made with virtual currency from taxation if the gains are $200 or less.",
    "author": "",
    "title": "If you thought NFTs were crazy, wait til you see how they’re taxed"
  },
  {
    "id": 2331,
    "mediaId": 6615,
    "date": "2022-03-22",
    "sentence": "“We want to encourage those who want to go into the field of teaching who are interested in working with young children to do so, so we can have more quality employees available.”\nThe Lightbridge Foundation scholarship award earmarks $500 scholarships for high school seniors who desire to pursue a college education, something <span class='selected-term'>Schweikert</span> hopes to be a part of in Sumner County for the 2021-2022 academic school year.",
    "author": "Katie Nixon",
    "title": "$4M private preschool opens in Gallatin, first Lightbridge Academy location to open in Tennessee"
  },
  {
    "id": 2599,
    "mediaId": 2528,
    "date": "2022-03-23",
    "sentence": "More recently, HaystackID provided \"software service\" for pro-Trump US Rep. David <span class='selected-term'>Schweikert</span>, an Arizona Republican whose campaign committee paid the firm more than $77,000 between 2019 and 2020, FEC disclosures show.",
    "author": "C. Ryan Barber",
    "title": "Trump's company hired a Republican-tied firm to help answer subpoenas. New York AG Letitia James says it's not going well."
  },
  {
    "id": 2230,
    "mediaId": 2718,
    "date": "2022-03-30",
    "sentence": "Some are also insisting they’re confused by the whole thing, including Arizona congressman David <span class='selected-term'>Schweikert</span>, who said this:\n“I’ve been here a decade, and besides the fact we’re just cruel to each other, at many levels, it’s one of the most boring places.",
    "author": "Ross A. Lincoln",
    "title": "Colbert Imagines That Boring GOP Cocaine Orgies Would Still Exclude Ted Cruz (Video)"
  },
  {
    "id": 1206,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "We just want a good, conservative Republican to win.”\nRep. Ronny Jackson (R-TX) could only offer, \"Sure, why not?” while Rep. David <span class='selected-term'>Schweikert</span> (R-AZ) was outright dismissive, telling the Beast, \"We actually are sort of in the time of the celebrity candidate.",
    "author": "Tom Boggioni",
    "title": "Sarah Palin facing shrugs and 'outright hostility' from Republicans over new political bid: report"
  },
  {
    "id": 449,
    "mediaId": 2593,
    "date": "2022-04-13",
    "sentence": "Republican Rep. David <span class='selected-term'>Schweikert</span> of Arizona also pointed to rampant federal spending as the cause, saying warnings of what has happened since then were ignored, according to The Hill.",
    "author": "Jack Davis",
    "title": "Wholesale Inflation Shatters Expectations, Hits Highest Level Ever Recorded"
  },
  {
    "id": 334,
    "mediaId": 2550,
    "date": "2022-04-19",
    "sentence": "Here’s our complete target list:\nDistrict\nIncumbent\nLocation\nAZ-01\nDavid <span class='selected-term'>Schweikert</span>\nEastern Phoenix and suburbs\nCA-22\nDavid Valadao\nSouthern Central Valley\nCA-27\nMike Garcia\nNorthern Los Angeles suburbs\nCA-45\nMichelle Steel\nWestern Orange County\nCO-08\nOPEN\nNorthern Denver suburbs\nNC-13\nOPEN\nSouthern Raleigh suburbs\nNE-02\nDon Bacon\nOmaha area\nNY-01\nOPEN\nEastern Long Island\nMI-03\nPeter Meijer\nGrand Rapids area\nNM-02\nYvette Herrell\nSouthern New Mexico\nIf we can win across this battleground, then we can vastly improve our odds of holding our House majority and ensuring that President Biden gets at least two more years to enact his agenda.",
    "author": "",
    "title": "When it comes to protecting the House, the best defense is a good offense"
  },
  {
    "id": 344,
    "mediaId": 2831,
    "date": "2022-04-22",
    "sentence": "In 2014, Representative David <span class='selected-term'>Schweikert</span>, a Republican, introduced the Secret Science Reform Act, which would have prohibited the EPA from using any scientific research unless all its underlying data was made public.",
    "author": "James Goodwin",
    "title": "Why Some Conservative Jurists Won’t Follow the Science"
  }
]