[
  {
    "id": 5796,
    "mediaId": 2528,
    "date": "2022-02-11",
    "sentence": "At one point during the investigation, Schwab testified to investigators that <span class='selected-term'>Schweikert</span> was \"very adamant that he did not want a whole bunch of dinners in DC showing up on his FECs,\" directing Schwab to pay for those transactions personally and then charge Schweikert's campaign account for \"consulting fees\" to conceal the real purpose.",
    "author": "Bryan Metzger",
    "title": "Arizona GOP Rep. David Schweikert fined $125,000 by Federal Election Commission for repeated campaign finance law violations"
  },
  {
    "id": 5871,
    "mediaId": 2512,
    "date": "2022-02-13",
    "sentence": "\"Throughout the course of this investigation, Representative <span class='selected-term'>Schweikert</span> made vague or misleading statements to the (investigative subcommittee) and (the Office of Congressional Ethics) that allowed him to evade the statute of limitations for the most egregious violations of campaign finance laws, his document productions were slow or non-responsive to several of the ISC’s requests for information regarding (Federal Election Commission) errors, and he gave self-serving testimony that lacked candor,\" the report said.",
    "author": "Meaghan Ellis",
    "title": "GOP lawmaker hit with $125K FEC fine for repeated campaign law violations"
  },
  {
    "id": 5381,
    "mediaId": 2676,
    "date": "2022-02-14",
    "sentence": "\"Throughout the course of this investigation, Representative <span class='selected-term'>Schweikert</span> made vague or misleading statements to the (investigative subcommittee) and (the Office of Congressional Ethics) that allowed him to evade the statute of limitations for the most egregious violations of campaign finance laws, his document productions were slow or non-responsive to several of the ISC's requests for information regarding (Federal Election Commission) errors, and he gave self-serving testimony that lacked candor,\" the report said.",
    "author": "Meaghan Ellis",
    "title": "GOP lawmaker fined for campaign law violations"
  }
]