{
  "id": 11716,
  "mediaId": 8463,
  "date": "2022-03-23",
  "headline": "Will Ohio Redistricting Commission's new approach yield better results? Optimism varies",
  "image": "https://www.gannett-cdn.com/presto/2022/01/18/NCOD/4f0c4c34-e64d-4f1b-bdbe-97de227bc6eb-Ohio_Redistricting_Commission_KWR_02.jpg?crop=2499,1406,x0,y0&width=2499&height=1406&format=pjpg&auto=webp",
  "link": "https://www.dispatch.com/story/news/politics/elections/2022/03/22/ohio-redistricting-new-approach-yield-better-maps/7126735001/",
  "mediaOutlet": "thenews-messenger.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jessie Balmert",
  "authorUrl": "https://www.cincinnati.com/staff/4395685002/jessie-balmert/",
  "termIds": [
    4730,
    5186,
    5128,
    2143,
    1710,
    3006,
    1506,
    1126,
    6474
  ],
  "sentences": [
    "Seeking fresh eyes and perspectives, the commission hired two new mapmakers: Michael McDonald, a University of Florida political science professor, and Douglas Johnson, president of the National Demographics Corp. Each consultant will earn up to $49,000 for less than a week of work and collaborate with four mapmakers, two Republicans and two Democrats, who crafted previous plans.",
    "Democrats on the Ohio Redistricting Commission asked the Ohio Supreme Court to delay the primary to June 28 or \"any other date that indisputably allows sufficient time for the Commission to adopt and implement a new, constitutional set of maps.\"",
    "\"I remain skeptical that this is going to yield a workable result, but it's the best possibility that we could get that done,\" Ohio Secretary of State Frank LaRose said of hiring the new consultants to work with currently employed mapmakers.",
    "It's a tack that advocates of redistricting reform had begged them to consider months ago: draw lines in public rather than behind closed doors and use mapmakers who answer to the entire commission rather than legislative leaders alone.",
    "Jessie Balmert is a reporter for the USA TODAY Network Ohio Bureau, which serves the Akron Beacon Journal, Cincinnati Enquirer, Columbus Dispatch and 18 other affiliated news organizations across Ohio.",
    "After three sets of rejected Statehouse maps, a primary in crisis and a brush with contempt of court, the GOP-dominated Ohio Redistricting Commission is taking a different tack to mapmaking.",
    "On Monday, former U.S. Attorney General Eric Holder's National Redistricting Action Fund filed a new lawsuit against Ohio's map – after its last challenge was tossed for technical reasons.",
    "The Ohio Supreme Court's majority had suggested hiring \"an independent map drawer – who answers to all commission members, not only to the Republican legislative leaders.\"",
    "\"It is incredibly frustrating to know that they could have sorted all this out six months ago,\" said Catherine Turcer, executive director of Common Cause Ohio.",
    "A federal panel of three judges could decide to impose the most recent Statehouse maps, which were rejected by the Ohio Supreme Court last week.",
    "For example, judges in North Carolina scrapped Johnson's testimony backing GOP legislative maps after they found his analysis \"unreliable.\"",
    "While most of the attention has focused on state House and Senate maps, the congressional plan is also being challenged in court.",
    "Senate President Matt Huffman, R-Lima, expressed concerns about how the commission would craft maps as a seven-member body.",
    "The new duo has worked for partisans in the past so they aren't strictly independent, but they are new to Ohio's process.",
    "\"Seven of us sitting here with a mouse, moving it around like an Ouija board kind of thing or exactly how that works.\"",
    "Ohio's redistricting saga still facing several court challenges\nMeanwhile, lawsuits loom over the mapmaking process.",
    "Each will be held in room 313 of the Ohio Statehouse and some will allow video conferencing:\n5 p.m. Wednesday.",
    "For a map to last 10 years, at least two Republicans and both Democrats on the commission need to approve it.",
    "\"I think working out how to do something you've never done before in advance is a really good practice.\"",
    "Circuit Court of Appeals to help negotiate final maps that everyone, or almost everyone, can agree on.",
    "That map includes 10 Republican seats, three Democratic seats and two tossups that lean Democratic.",
    "It threatens Rep. Marcy Kaptur, a Toledo Democrat, and Rep. Steve Chabot, a Cincinnati Republican.",
    "The commission set daily meetings until the court's Monday deadline to produce new maps.",
    "\"What we've done before hasn't worked so doing something different makes sense,\" Gov.",
    "\"I think all of us are struggling a little bit with exactly how that works,\" he said.",
    "\"I'm hopeful but I don't think anyone knows how this is going to really turn out.\"",
    "Get more political analysis by listening to the Ohio Politics Explained podcast",
    "\"People behave differently and more appropriately when things are in public.\"",
    "McDonald has criticized Republicans' redistricting process in Florida.",
    "On Tuesday, the commission agreed to use mediators from the 6th U.S.",
    "Both will fill out forms disclosing any conflicts of interest.",
    "Holding more meetings in public should help, Turcer said.",
    "The Ohio primary, slated for May 3, is still in limbo.",
    "But will this new approach yield different results?",
    "Ohio redistricting: Who are the outside mapmakers?",
    "Anything short of that will last for four years.",
    "A hearing on that case is Friday morning.",
    "4 p.m. Saturday and Sunday.",
    "Not everyone is optimistic.",
    "Mike DeWine said.",
    "7 p.m. Thursday.",
    "10 a.m. Monday.",
    "2 p.m. Friday."
  ]
}