{
  "id": 1716,
  "mediaId": 8290,
  "date": "2022-02-15",
  "headline": "Why is a Patriotic American Businessman being harassed by Kuwait?",
  "image": "https://static.wixstatic.com/media/7d0df7_7ec927bb2f2b4c2f8572ea2f6f0d200a~mv2.jpg/v1/fit/w_574%2Ch_332%2Cal_c%2Cq_80/file.jpg",
  "link": "https://www.conservativehq.org/post/why-is-a-patriotic-american-businessman-being-harassed-by-kuwait",
  "mediaOutlet": "conservativehq.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian McNicoll",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Williams and Lazareva, his former colleague and one of the top female business executives in the Middle East, worked together at the Port Fund, which managed investments made by the General Retirement and Social Insurance Authority of Qatar, the Kuwait Ports Authority and other entities that are part of the Gulf Investment Corporation.",
    "There are many reasons to be skeptical of these latest Kuwaiti claims, not least the ever-changing nature of Kuwait’s allegations, the finding of a UN Working Group on Arbitrary Detention concerning Lazareva’s case, and the involvement of Freeh, Blair, Bush, and Heard.",
    "Despite adverse findings against Kuwait by the UN and a bipartisan congressional threat of placing Magnitsky Act sanctions against members of the ruling family – some of whom are among the richest people in the world - Kuwait continues to persist in its actions.",
    "Williams is active in his church, helps people in his community, created jobs for women overseas to pull them out of a life of prostitution and sex trafficking, and together with his wife has donated millions to a variety of charitable causes.",
    "One of the Port Fund’s investments was a mixed-use project near the airport in Manila known as Clark Global City, which the Port Fund sponsored, developed and sold for more than $655 million (more than quadrupling investors’ money).",
    "Descended from a melting pot of Welsh coal miners and farmers and Jewish immigrants from Germany, he is the son of a college professor and a teacher – who each were the first in their families to attend college.",
    "In their latest effort, Kuwaiti authorities have brought proceedings in the Cayman Islands, where the Port Fund is incorporated, to broaden their attacks to include Williams for his role in the Port Fund.",
    "Lazareva and Williams have been respected business executives for decades – Williams’ LinkedIn page has hundreds of endorsements of his work, dozens of which are accompanied by glowing comments.",
    "After more than 15 months of arduous efforts by Mr. Williams and his team, and the direct intervention of the President of the United States, Kuwait finally agreed to release the frozen funds.",
    "Mark Williams\nPort Fund\nMarsha Lazareva\nKuwait\nGeneral Retirement and Social Insurance Authority of Qatar\nKuwait Ports Authority\nClark Global City\nUN Working Group on Arbitrary Detention",
    "This came months after the Dubai Police had concluded following an investigation that the funds were of a legal source and that there was no basis for them to remain frozen.",
    "Bush; Lady Cherie Blair QC, wife of former UK Prime Minister Tony Blair; and actress Amber Heard, Lazareva has found safe haven while the court proceedings drag on.",
    "There is a concerted bipartisan effort in Congress, involving figures from Rep. Madeleine Dean, D-Pa., on the left to Rep. Steve Chabot, R-Ohio, on the right.",
    "Mark Williams is the kind of man American communities depend on and the epitome of the American Dream, but today he is living out a Middle Eastern nightmare.",
    "Lazareva’s son, a US citizen who was 3 at the time of his mother’s arrest, has been unable to return to his home in the US for the past three years.",
    "But before they could be distributed to the fund’s investors and others, the sale proceeds were frozen at the request of the government of Kuwait.",
    "Meanwhile, Kuwait has a history of attacking American citizens and firms who are there to protect the country and advance its interests.",
    "Thanks to assistance from prominent outsiders, including former FBI Director Louis Freeh; Neil Bush, son of former President George H.W.",
    "The Port Fund was highly successful, almost doubling investors’ capital over the life of the fund, which spanned the Great Recession.",
    "The government of Kuwait, a designated major US ally, is trying to make an example of Ms. Lazareva and anyone who comes to her aid.",
    "Once those accusations were disproven, they turned the money Williams earned as investment manager for a highly successful fund.",
    "The government of Kuwait then accused Lazareva and the Port Fund of embezzling the funds rather than paying its investors.",
    "The Kuwaiti authorities originally contended that the Port Fund’s managers had stolen $500 million from the fund.",
    "The Kuwaiti government appears unconcerned that the world is appalled by its efforts to persecute these people.",
    "The government convicted Ms. Lazareva of embezzlement and sentenced her to more than a decade in prison.",
    "But Williams is under attack because of his association with the Port Fund and Marsha Lazareva.",
    "We don’t allow double jeopardy, and we don’t allow malicious prosecutions to wind on for years.",
    "Upon the release of the frozen funds, the Port Fund promptly paid its investors and creditors.",
    "One might have expected that to have been the end of the matter, but Kuwait has not given up.",
    "The net receipts of $496 million were deposited into the fund’s bank account in Dubai.",
    "It is time the US stood up for the rights of US citizens in Kuwait and what is right.",
    "It’s time the administration stood up for this patriotic American.",
    "He’s even been knighted by the Vatican for his service to others.",
    "They instilled in their son the value of education and hard work.",
    "The conviction was overturned on appeal but then reinstated.",
    "There is also the reputation of those involved.",
    "The US needs to demand answers."
  ]
}