{
  "id": 3244,
  "mediaId": 8285,
  "date": "2022-02-01",
  "headline": "The Importance of Being Mayor Aftab",
  "image": "https://cdn2.cincinnatimagazine.com/wp-content/uploads/sites/5/2022/01/FEB22_AftabFindlayMarket-CROP.jpg",
  "link": "https://www.cincinnatimagazine.com/article/the-importance-of-being-mayor-aftab/",
  "mediaOutlet": "cincinnatimagazine.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John Fox",
  "authorUrl": "https://www.cincinnatimagazine.com/author/john-fox/",
  "termIds": [
    0
  ],
  "sentences": [
    "We’re all probably tired of Zoom, which is almost a necessity in this pandemic, but Zoom really did break down barriers for getting candidates out into different communities to talk about our specific policy ideas and the big topics of the day, which in my mind was our economic recovery from this pandemic and putting racial equity at the center of affordable housing, public safety, and environmental and infrastructure concerns.",
    "He’s the city’s first mayor of Asian descent and the first of Asian descent to lead a major city in the Midwest, and he was featured prominently in national media coverage of Asian-American and Pacific Islander (AAPI) candidates who won mayoral races, including Michelle Wu in Boston and Bruce Harrell in Seattle.",
    "I went into city communities without any preconceived notions, but rather with the message of, “I’m here to learn about your challenges and to learn about your vision, your issues, and be a partner in trying to address them and to fix them.” And so it was an incredible learning opportunity.",
    "So it was refreshing to be given time to answer questions not with sound bites but with substance and to spend our time talking about the future of Cincinnati rather than attacking our opponent, which is unfortunately how our national politics are characterized.",
    "In the recent past, you’ve seen the county and the city quarrel about issues like the Metropolitan Sewer District and The Banks, but we need to collaboratively make a very strong pitch to the federal government in cooperation with our corporate partners.",
    "The mayor is the moral conscience of the city, and it’s the one position in our community that’s not just thinking about next year but the next 20 years and how to ensure that my children and your children live in a city that’s thriving and equitable.",
    "Instead of catalyzing economic activity in our wealthiest neighborhoods and giving rich people tax breaks, let’s give more tax breaks to communities that are yearning for economic activity and density, like Price Hill or Bond Hill or Sedamsville.",
    "I would like to partner with the mayors of Dayton and other regional municipalities to create a certification process for Black- and women-owned businesses so that you get certified once and can then compete across the region for contracts.",
    "You know, people in Cincinnati care deeply and personally about reproductive rights, sensible gun reform, and immigration, but they’re also passionate about pets on leashes, pedestrian safety, potholes in their streets, and sewer rates.",
    "So if we want to create a city with dense neighborhoods that are walkable, that have good access to public transportation, and that can recruit and retain diverse workers, we have to start making decisions with racial equity in mind.",
    "So I want a review of that program and a reform as simple as, “Let’s include location as part of the standard for tax breaks.” We can do that either through Census tract data or through focusing on specific geographic areas.",
    "I think what voters were looking for was dynamic change from the chaos at City Hall and the several indictments [of councilmembers], as well as from the uncertainty of the pandemic and the increase in violence in the city.",
    "I loved the idea of the picture.”\nPureval thought he could ride his newfound political momentum to challenge U.S. Rep. Steve Chabot in 2018, but the gerrymandered 1st District wasn’t ready for a fresh-faced Democrat.",
    "The son of immigrants grew up in suburban Dayton and, like many area kids, attended state colleges: Ohio State, where he was elected student body president, and UC for law school, where he volunteered at Legal Aid.",
    "And that has a lot to do with my name.”\nAfter managing an annual budget of $12 million at the county, he’ll now oversee the city of Cincinnati’s $1.5 billion budget, which includes $310 million in capital projects.",
    "Cincinnati has had a lot of wonderful success with the Collaborative Agreement [on police-community relations], wonderful success revitalizing our urban core, and excellent new initiatives like Preschool Promise.",
    "I’ve talked to John Pepper, the former CEO of Procter & Gamble, and his advice on changing cultures is always be direct and over-communicate, tell people exactly what you’re going to do, and then do exactly that.",
    "That’s how we network and how we advance our career.” That really illuminated for me that not only did they believe there wasn’t anything wrong with the status quo, they didn’t understand why it could be wrong.",
    "The mayor’s position is, in my mind, the most important local position we have, because it demands substantive knowledge on a whole host of issues, whether it’s public safety or Water Works or police and fire.",
    "Going back to the earlier part of our conversation about feeling some intimidation when I first considered running for mayor, I think a healthy amount of—what’s the word I’m looking for—trepidation is good.",
    "In our current tax program for incentivizing the creation of more residential housing, the vast majority of our tax incentives are going to the wealthiest neighborhoods in Cincinnati, more than 95 percent.",
    "But his campaign focused on Pureval’s leadership experience, gained from taking on an entrenched political system at the county courthouse and opening up the clerk’s office to new people and new ideas.",
    "He was running against incumbent Tracy Winkler for Clerk of Courts, but also against the Winkler name (her husband and brother-in-law are county judges) and the insider nature of GOP county politics.",
    "The city and county need to work with Northern Kentucky and Indiana officials to make one strong, persuasive argument that the Brent Spence should be the top infrastructure priority in the country.",
    "Aftab Pureval doesn’t shy away from discussing the symbolic meaning of his election win, but he’d rather talk about how an outsider mayor and fresh faces on city council will energize Cincinnati.",
    "I think what really resonated with voters is my leadership experience and a track record of taking on a corrupt organization like the Clerk of Courts, which was known for its patronage system.",
    "And so I was trying to meet people where they were on issues I didn’t necessarily have a great deal of institutional knowledge about, because I was a county official focused on the courthouse.",
    "I remember having a conversation with my employees when I first started, and they asked me, “Why do you keep talking about the fact that a lot of people in the Courthouse are related?",
    "Our national politics are so polarized and so toxic, it was refreshing and inspirational to have a local race that was really defined by issues and not personalities or parties.",
    "So I want to work regionally to discuss how we pitch the region as a place to move your business and why you should choose to live and work here when you can do that anywhere.",
    "I think it’s a really important statement about Cincinnati being the kind of place where no matter what you look like or where you’re from you can achieve your dreams.",
    "It took Barack Obama just five years to rocket from the Illinois State Senate to the presidency, and Donald Trump rose from reality TV host to president even quicker.",
    "He hunkered down to remake the Clerk of Courts office with a focus on transparency and technology, and he won re-election in 2020 with 57 percent of the vote.",
    "Five years ago, Pureval described his motivation for seeking public office as an attempt to speak for those who felt powerless against the county courthouse.",
    "Photograph by Jeremy Kramer\nAmerican history is replete with politicians who have caught the public’s wandering eye and catapulted from obscurity to power.",
    "Getting back to racial equity, I’ve been thinking recently about how to make it easier for Black- and women-owned businesses to compete for city contracts.",
    "It’s the intersection of so much of the country’s cargo traffic, and particularly with the supply chain challenges from the pandemic, we have to fix this.",
    "He convinced city voters weary of corruption—three councilmembers were indicted for bribery in 2020—that he could lead a similar turnaround at City Hall.",
    "PUREVAL: When you look at the City Charter, the mayor has very distinct powers and authority, but I think the real power of the mayor is as a convener.",
    "CM: Fresh faces can also break through organizational malaise and leadership’s tendency to repeat how they do things because they’re used to it.",
    "PUREVAL: I want to be very respectful of the City Charter, which clearly lays out the responsibilities of mayor, city council, and city manager.",
    "Pureval finished first in the open mayoral primary last May, then easily beat City Hall veteran (and fellow Democrat) David Mann in November.",
    "My personal story is I’m the son of a refugee, and my mom, as a young child, moved to India, where she met my father, who was from Punjab.",
    "I started reforming that on my very first day, leading with innovation and talent and delivering wins to the people of Hamilton County.",
    "CM: You were open to learning during your campaign, but on the flip side, as Mann pointed out, you were inexperienced with city issues.",
    "Pureval worked at a law firm in Washington, D.C., returning to Cincinnati to serve in the U.S. Attorney’s office and then joining P&G.",
    "My wife knows Mark better than I do, actually, because they’ve worked together on pedestrian safety issues in Clifton, where we live.",
    "You relied on advice from Mark Mallory, who was well-known in the city when he was elected mayor but still was a political outsider.",
    "I don’t know why he believed I was the best person for the job, but his belief gave me a lot of confidence to take on the challenge.",
    "PUREVAL: City officials right now agree they want economic activity, but I don’t think they’re very intentional about where it goes.",
    "He proudly recalls his parents’ journey to the U.S. from India, where his mother, a refugee from Tibet, met and married his father.",
    "Pureval discusses his emergence as a political leader and his plans and hopes for Cincinnati in an interview conducted in November.",
    "And I’ve been very clear about what those priorities are and very clear about the specifics of how we’re going to accomplish them.",
    "I care very deeply where new economic activity goes, because we need to take a look at these decisions through an equitable lens.",
    "The photograph has me blowing a bubble, just like Robert Redford did on the poster for a movie in the 1970s called The Candidate.",
    "A good first step is what the voters did, which was bring in so many new councilmembers with fresh new progressive perspectives.",
    "That’s why we won with a historical margin but also why so many new councilmembers, eight of whom are Democrats, won as well.",
    "He’s fond of saying I’m the second mayor to be elected without any City Hall experience because, of course, he was the first.",
    "After competing in four political races since then—and winning three of them—he became Cincinnati’s 70th mayor in January.",
    "CM: I’m sure you’d like to be recognized as more than the sum of your background parts and not be reduced to a symbol.",
    "I really do subscribe to the City Charter’s statement that there’s no Republican or Democratic way to fill a pothole.",
    "Five and a half years ago, Aftab Pureval was a Procter & Gamble attorney running for Hamilton County Clerk of Courts.",
    "Unfortunately, in City Hall, particularly on council, there’s a culture of corruption, but it goes deeper than that.",
    "And I’m just so incredibly humble and grateful that the people of Cincinnati have given me this opportunity to lead.",
    "The corruption inside the Clerk of Courts office was different; it was more about ingrained patronage and nepotism.",
    "CM: What was your experience during the mayoral campaign, especially running against a fellow Democrat, David Mann?",
    "“I can’t imagine spending this much time and energy just to get your name out there,” he told Cincinnati Magazine.",
    "Because of that decision, in one generation my family went from being refugees to now the new mayor of Cincinnati.",
    "But we are interested in making more intentional decisions, particularly around racial equity and racial justice.",
    "What I’ve been looking for is someone who believes wholeheartedly in my priorities to move Cincinnati forward.",
    "It’s a huge leap in scale, which Pureval admits “intimidated” him when he first considered running for mayor.",
    "The victory gained national attention for Pureval’s personal background story and quick political ascension.",
    "Despite all of those wins, we remain a very segregated city—segregated as it relates to race and to wealth.",
    "We want to deliver wins for citizens every single day and are fully committed to the future of Cincinnati.",
    "Every day I met local experts and local people passionate about their issues, and every day I got smarter.",
    "But it’s going to take all of us and it’s going to take a little bit of time to change the culture there.",
    "I’m not suggesting that there should be a ban on tax breaks in certain neighborhoods, just the opposite.",
    "CM: What are your thoughts on filling key roles in your administration, starting with the city manager?",
    "I’m interested in the fact that Cincinnati is literally the birthplace of branding and brand marketing.",
    "I want the world to know that Cincinnati is a place where you can be empowered to achieve your dreams.",
    "And so I don’t think I or the new council are interested in just completely turning things inside-out.",
    "Through the primary and the general election, David and I participated in over 40 forums and debates.",
    "PUREVAL: I’ve known Jan-Michelle Kearney for a while and think she’ll do a great job as Vice Mayor.",
    "Mark was instrumental in talking me through what the city requires and what the position requires.",
    "When I first got to the Clerk of Courts office, we did a full review of our systems and processes.",
    "PUREVAL: I learned that changing culture is really hard work and requires intentional leadership.",
    "“I feel like my political career started with that story in Cincinnati Magazine,” Pureval says.",
    "And if anyone said, “Well, this is the way we’ve always done it,” I knew that was a red flag.",
    "PUREVAL: I can tell you no one returns your calls when you’re the Clerk of Courts [laughs].",
    "CM: Is the city capable of being more intentional in these economic development decisions?",
    "We need more market-rate, workforce, affordable, and low-income housing across the board.",
    "I think we need more housing in general, and as a city we need to be incentivizing that.",
    "Cincinnati Magazine introduced our readers to the political newcomer in September 2016.",
    "PUREVAL: I was the first to say that David Mann had more City Hall experience than me.",
    "It’s the city manager’s job to employ those directors and professionals in City Hall.",
    "At the very least, I can promise I will work my heart out to achieve for Cincinnati.",
    "CM: The mayor’s office can be sort of a bully pulpit from which to lead the region.",
    "CM: You say that mayor is the most visible and important local government position.",
    "I do, because I know what it’s like not to fit in, to be an outsider in the system.",
    "That’s the kind of bold, progressive leadership I think the city was looking for.",
    "I think the people of Cincinnati believe the city generally is on the right path.",
    "Liz Keating is a newer relationship, and I’m working to get to know her better.",
    "PUREVAL: I’m very happy to talk about my family story, because I’m proud of it.",
    "They’re often a case of the right person in the right place at the right time.",
    "CM: What did you learn in county government that can help you lead the city?",
    "I will say Scotty Johnson and I have a newer relationship, but a strong one.",
    "I’ve known Greg Landsman, Reggie Harris, Meeka Owens, and Jeff Cramerding.",
    "CM: What are your relationships like with members of the new city council?",
    "We’re just not very good about telling our story and branding ourselves.",
    "“You have to believe in what you’re saying and what you’re running for.",
    "He was really instrumental in me running for mayor in the first place.",
    "So I’m looking for professionals who are passionate about that vision.",
    "I think there are similarities with the culture at City Hall as well.",
    "I’m not sure the city cares where it goes as long as it’s happening.",
    "PUREVAL: Mark is a close professional and personal friend of mine.",
    "We should give more tax breaks to communities that need them.",
    "PUREVAL: It was a lot different [from my earlier campaigns].",
    "But beyond the knowledge and policy, it demands leadership.",
    "First and foremost, we need to fix the Brent Spence Bridge.",
    "He played an outsider and a young guy running for office.",
    "Do you see your role as a leader for the entire region?",
    "Victoria Parks I’ve known from the county, of course.",
    "His comments have been edited for length and clarity.",
    "His margin of victory over Mann was 66 to 34 percent.",
    "People probably return your calls when you’re mayor.",
    "It’s more about providing basic services to people.",
    "So much of what we do at City Hall isn’t partisan.",
    "There’s a culture of transactional relationships.",
    "CM: An outsider can have great appeal to voters.",
    "Frankly, I was a bit intimidated by the office.",
    "Changing cultures is like turning a battleship.",
    "It focuses you and inspires you to work harder.",
    "“No one thought I had a chance in that race.",
    "He beat Winkler with 52 percent of the vote.",
    "They immigrated to this country in 1980.",
    "How many of are new to you as well?",
    "We want to execute with excellence.",
    "I’m certainly an example of that.",
    "PUREVAL: That’s exactly right.",
    "Mark Jeffreys, the same way.",
    "You have to be intentional.",
    "That’s just not equitable.",
    "And that’s intimidating.",
    "That’s just a fact.",
    "Here’s an example."
  ]
}