{
  "id": 3832,
  "mediaId": 2589,
  "date": "2022-01-26",
  "headline": "Democrats running \"defund the police\" fan in Ohio swing district",
  "image": "https://media.townhall.com/townhall/reu/o/2018/225/1f912fcd-7c49-4bbd-a868-de47390de913-1110x740.jpg",
  "link": "https://hotair.com/jazz-shaw/2022/01/26/democrats-running-defund-the-police-fan-in-ohio-swing-district-n444234",
  "mediaOutlet": "Hot Air  ",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jazz Shaw",
  "authorUrl": "https://hotair.com/author/jazz-shaw",
  "termIds": [
    0
  ],
  "sentences": [
    "(Free Beacon)\nA top Democratic Party recruit to run for Congress in an Ohio swing district wrote a proposal to defund Cincinnati police as the city experienced a spike in murders…\nLandsman’s proposal to defund police did not deter the Democratic Congressional Campaign Committee (DCCC) from recruiting the councilman to challenge Ohio Republican congressman Steve Chabot this November.",
    "Committee chairman Sean Patrick Maloney asserted last year that Democrats do not support defunding the police, an accusation that he dismissed as a “Republican talking point.”\nIn this brief clip, you can watch Landsman explaining his defunding plan to a local reporter.",
    "Despite a growing list of recent polls suggesting the approach of a red wave in the midterms, Democrats have been gamely recruiting candidates in an effort to remain competitive and possibly even flip a few GOP seats in their direction, particularly in the House.",
    "Landsman confirmed to the Cincinnati Enquirer in December that national Democrats asked him to run against Chabot in the state’s First Congressional District—a swing seat that the DCCC has identified as a top target—and announced his campaign weeks later.",
    "A recent Q-poll showed that 82 percent of Ohio voters “approve of the way police in their community are doing their job.” That’s largely in keeping with the national average, where the idea of abolishing or defunding the police is quite unpopular.",
    "Chabot will likely be burying Landsman in questions about why he’s so keen to slash police budgets when even Patrick Maloney has tried to write off the idea as a “Republican talking point” and not something that Democrats actually support.",
    "Law and order concerns are quickly rising to the top of the priority list for voters across the country these days, in addition to Bidenflation, the Biden border crisis and too many foreign policy debacles to list here.",
    "He has been a vocal proponent of the “defund the police” movement and even drew up a proposal in 2020 to do precisely that, just as the city was experiencing an uptick in murders and other violent crimes.",
    "Cincinnati isn’t all that large of a city (population 301,000) when compared to places like New York and Chicago, but it’s big enough to experience its fair share of gang activity and violent crimes.",
    "Today, in addition to the crimes taking place in their own back yards, voters in the district are being treated to daily reports of rising violent crime rates across the country on the national news.",
    "Will people really be rallying to Landsman’s banner in the midst of all of this mayhem after being branded as the “defund the police candidate” as soon as came out of the gate?",
    "When Landsman was on the City Council and pitching his defunding proposal in 2020, Cincinnati recorded its highest number of homicides ever, with 94 murders taking place.",
    "One seat that they have their eyes on is in Ohio’s First Congressional District, where Republican Congressman Steve Chabot has been perched for the past ten years.",
    "But if the Democrats want to flip this particular seat blue, they probably should have come up with a less controversial champion to carry their banner.",
    "That’s a natural target for the Democrats to be eyeing since Chabot barely squeaked above 50% in his last two races, making it a tempting opportunity.",
    "Of course, given the current state of the nation, Landsman may have one blotch on his record that could prove disqualifying.",
    "The city also experienced four double homicides that year, something that the locals were definitely not used to seeing.",
    "It’s also worth noting that Landsman isn’t running in a region that’s particularly opposed to the police.",
    "The district covers the lion’s share of Cincinnati and sits in the southwest corner of the state.",
    "It’s not as if the voters in the 1st District haven’t been impacted by rising crime rates.",
    "You can expect this clip to be getting a lot of play this year in campaign ads for Chabot.",
    "It’s a Cincinnati city councilman by the name of Greg Landsman.",
    "So who did the DCCC recruit to run against Chabot this year?",
    "It’s a midterm cycle, so nobody’s seat is absolutely safe."
  ]
}