{
  "id": 9167,
  "mediaId": 2658,
  "date": "2022-03-21",
  "headline": "The new midterm math: How redistricting, Biden and Trump shaped the battle for the House",
  "image": "https://static.politico.com/1f/5f/44e09100444387c954018c0ccf4c/pennsylvania-redistricting-45131.jpg",
  "link": "https://www.politico.com/news/2022/03/21/midterm-election-redistricting-biden-trump-house-00018600",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    4905,
    4982,
    2448,
    2765,
    4557,
    1477,
    1126,
    392,
    329
  ],
  "sentences": [
    "“And so the president’s numbers have to get healthier going into the fall, or there will be a lot of Democrats struggling this year.”\nSo far redistricting has shrunk the number of truly competitive seats — those decided by less than 5 points at the presidential level in 2020 — down to just 31, according to a POLITICO analysis.",
    "All but four states have finalized their political lines, offering the clearest picture yet of a new House battleground that will force Democrats to protect at least five incumbents in districts Trump carried last election — the most politically hazardous place to be for the midterms.",
    "But the political environment is good enough that we should be able to compete in traditional Democrat territory that we couldn’t in a normal election cycle.”\n“Outside of redistricting-created problems, there’s not going to be a lot of defense that will need to be played,” he added.",
    "Part of his strategy: “I know why people voted for Trump in my district and I have never condemned them for doing it.”\nAnd even though Biden’s numbers are sagging, Cartwright said he is still upbeat about his chances against the same GOP candidate he beat in 2020.",
    "With Biden’s approval in the low 40s, Republicans expect their swing-seat incumbents will need less outside help, freeing up party resources and time to target Democratic incumbents in blue-leaning districts and potentially catch them sleeping.",
    "“And we have really, really strong candidates across the country in districts that the president won by a million and districts that the president lost.”\nStill, Democrats have signaled that they will be selective about offensive opportunities.",
    "But I think if you look at his policies, they’ve been pretty disastrous for the community.”\nThe remaining four maps could change these numbers slightly, especially Florida which has not yet finalized its 28 congressional seats.",
    "“It’s mostly about winning in those Biden seats, but not always, not exclusively,” Tim Persico, the executive director of the Democratic Congressional Campaign Committee, said of the Democratic strategy this cycle.",
    "But the new midterm math of the House landscape shows Democrats are in a much tougher spot, grappling with a potentially lethal brew of factors including a contracting battlefield and a diminished president.",
    "Thanks to redistricting, retirements and increased polarization and a decline in ticket splitting, the number of members in a district carried by the opposite party’s presidential nominee is relatively low.",
    "The sitting president’s party has gotten wiped out of most of their “crossover districts” — along with plenty of others where the previous presidential race was close — in each recent midterm election.",
    "Republicans must protect some challenging districts as well, with 15 GOP members in President Joe Biden-won seats, and any Democratic path to another majority involves picking off a number of those.",
    "Three of those seats are open because Reps. Lee Zeldin and John Katko are not seeking reelection in New York and Rep. Rodney Davis decided to run in a redder neighboring district in Illinois.",
    "“I think the general feeling right now is: It’s better to be prepared to go to battle in a larger numbers of districts and not have to do it,” said Dan Sena, a former DCCC executive director.",
    "“It’s hard to run away from an unpopular president, especially in the midterm,” said Democratic Rep. Ron Kind, who is retiring from a rural southwestern Wisconsin seat Trump won by 5 points.",
    "It’s a very difficult act to replicate and when they run garden-variety Republicans against me, they can’t do it.”\nTrump notched a 3-point win in Cartwright’s northeastern Pennsylvania seat.",
    "Democrats have done a decent job recruiting challengers to take on the Biden Republicans, though they notably lack a well-funded candidate against Fitzpatrick in the Philadelphia suburbs.",
    "When the DCCC named a dozen challengers to its Red to Blue program for top-tier candidates, the committee only added two candidates in Trump-won districts, both in swingy Iowa seats.",
    "); Tanya Wheeless, a former Phoenix Suns executive competing against Rep. Greg Stanton (D-Ariz.); and George Logan, an ex-state senator challenging Rep. Jahana Hayes (D-Conn.).",
    "Redistricting has forged a new House map with a small group of Democrats in a perilous place at the center: defending turf that former President Donald Trump carried in 2020.",
    "There’s Jeremy Hunt, a Black Army veteran challenging Rep. Sanford Bishop (D-Ga.); former La Porte Mayor Blair Milo, a Navy veteran running against Rep. Frank Mrvan (D-Ind.",
    "The list of those running consists of: Reps. Tom O’Halleran of Arizona, Jared Golden of Maine, Cindy Axne of Iowa, Marcy Kaptur of Ohio and Matt Cartwright of Pennsylvania.",
    "GOP legislatures also transformed districts in Georgia and Tennessee into deep red seats and automatic pickups that forced Democratic incumbents to retire or run elsewhere.",
    "Democrats have bolstered a number of incumbents’ districts, but they have also seen potential offensive targets disappear, leaving them with less room for error.",
    "Three other top targets — Reps. Mike Garcia (R-Calif.), David Valadao (R-Calif.) and Nicole Malliotakis (R-N.Y.) — all hold seats Biden carried by double digits.",
    "“There really are not very many swing seats left,” said Dan Conston, the president of the Congressional Leadership Fund, the chief House GOP super PAC.",
    "But if history is any indication, it’s also possible that Republicans could take back the House by sweeping away all the Democrats in Trump districts.",
    "But Democrats will have to defend members in Biden-won seats too — especially those in the 14 districts the president carried by 5 points or less.",
    "Adding to their burden, another five Democratic members abandoned Trump-won seats and left them open rather than seek reelection there.",
    "Rep. Vicente Gonzalez (D-Texas) and Andy Levin (D-Mich.) both abandoned districts Trump carried narrowly to run in neighboring seats.",
    "When Democrats won control of the House in 2006, 10 of the 18 Republicans lost reelection in districts carried by John Kerry in 2004.",
    "“I don’t think he’s particularly popular there now,” Chabot said of his Cincinnati district, which backed Biden by nearly 9 points.",
    "But the GOP’s strength is that they’ve landed solid candidates across the map, from the easily won districts to the tougher ones.",
    "), Peter Meijer (R-Mich.), Young Kim (R-Calif.), Michelle Steel (R-Calif.), Brian Fitzpatrick (R-Pa.) and Steve Chabot (R-Ohio).",
    "And four years ago, victorious House Democrats captured all but three of the 25 Republicans districts Hillary Clinton carried.",
    "“It’ll be four times if I’m able to pull it off,” Cartwright said, referencing his previous wins since Trump’s 2016 victory.",
    "GOP strategists believe they can contest seats Biden carried by low double-digit margins if the current environment holds.",
    "Kaptur, meanwhile, saw her northern Ohio seat swing from one of the bluest in the country to one of the most competitive.",
    "They could be joined by Democratic Rep. Chris Pappas of New Hampshire, a state that has not yet completed redistricting.",
    "That group includes: Reps. Susan Wild (D-Pa.), Elissa Slotkin (D-Mich.), Elaine Luria (D-Va.) and Dan Kildee (D-Mich.).",
    "All hold seats Biden won in 2020, but his current standing will determine just how tough their reelections will be.",
    "Cartwright has a special distinction of being the only Democrat to win in a Trump district in 2016, 2018 and 2020.",
    "When the GOP wrested back the gavel in 2010, 36 of the 48 Democrats in John McCain-won seats were defeated.",
    "That gives the Trump-district Democrats the look of an endangered species heading into November 2022.",
    "The number of open, Trump-won seats speaks to the difficulty Democratic incumbents face in 2022.",
    "They are most focused on picking off the 15 Republicans who were drawn into Biden-won districts.",
    "(Levin will have to beat a fellow Democrat incumbent, Rep. Haley Stevens, to return next year.)",
    "The rest lost, retired or were not in a Trump seat for all of the past three elections.",
    "“What was different about Donald Trump was that he was refreshing,” Cartwright said.",
    "O’Halleran was redrawn into a rural Arizona seat that Trump won by 8 points.",
    "New Hampshire, Louisiana and Missouri have also not completed redistricting.",
    "“And if those are not competitive races, you’re still prepared for a fight.”",
    "(There is still a chance Ohio’s map could change due to a court challenge.)",
    "), David Schweikert (R-Ariz.), Yvette Herrell (R-N.M.), Don Bacon (R-Neb.",
    "(Before the redraws, there were about 50 seats decided by that margin.)",
    "“That is forcing us to look at many more Democrat-leaning districts.",
    "And a net loss of just five seats will be enough to flip the House.",
    "And Democrats are bracing for the worst-case scenario.",
    "The DCCC also hopes to oust Reps. Andy Harris (R-Md.",
    "“He didn’t speak like other candidates.",
    "“Although that can always be in flux.",
    "Kind retired rather than run again."
  ]
}