{
  "id": 9650,
  "mediaId": 2537,
  "date": "2022-03-21",
  "headline": "Letter: More pressing issues in Delhi than men in skirts",
  "image": "https://www.gannett-cdn.com/-mm-/c52a34407b04c0753ae2bfc180d4a9230947ab37/c=0-145-2816-1736/local/-/media/2017/07/27/Cincinnati/Cincinnati/636367599735230490-delhi-skirt-53.jpg?width=2816&height=1591&fit=crop&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/03/21/letter-more-pressing-issues-delhi-than-men-skirts/7039738001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Letters to editor",
  "authorUrl": "",
  "termIds": [
    3619,
    3006,
    4905,
    6255,
    6109,
    6163,
    6177,
    6526,
    6569,
    6678
  ],
  "sentences": [
    "Nancy Woods, Blue Ash\nIt's great to see the progress made at CVG\nBeing a lifelong Cincinnatian and formerly working in the air cargo business at CVG, it was a great article by Katherine Nero about the amazing growth of our local airport and the good work that Candace McGraw has accomplished (\"CVG leader reflects on first decade, future of airports,\" March 13).",
    "Although I am in general agreement with most of the actions and sanctions taken by President Biden and Congress against Russia, I am disappointed that I have not heard of any concerted effort by the federal government to bring and settle (at least until the war is over) Ukrainian refugees into the United States.",
    "Mike Hauer, Villa Hills\nLandsman listens to public when making political decisions\nIn reference to Jason Williams commentary \"Soda ban proposal could be campaign issue,\" (March 13), banning high sugar drinks on kids’ menus in restaurants is a good idea in my experience as a parent and grandparent.",
    "The rationale is that side effects of nicotine (e.g., second-hand smoke) and alcohol (e.g., driving while intoxicated) endanger the public at large as well as the individual user, and justifies the added tax to help mitigate some of the consequences.",
    "Further, the added cost, in principle, contributes to reduced consumption in some individuals\nWhy don’t our legislators seriously consider using the same logic to levy additional taxes on the use of fossil fuels, both on individuals and corporations?",
    "I, and my work mate, Tom Voss, worked for nine years in 1970s for Pan Am Cargo operating a small depot that accepted only international airfreight consignments which were then sent to other U.S. hubs where they were loaded on foreign flights.",
    "Richard Asimus, College Hill\nAdded taxes on fossil fuels could stem the rate of climate change\nIn our society, legislators have historically put a tariff on activities of individuals that may cause serious harm to themselves and others.",
    "Adding such a tariff would be consistent with the rationale already being utilized for nicotine and alcohol, and it would be an important step by our legislators to make a statement and start stemming the rate of climate change.",
    "It’s widely accepted that the effects of burning fossil fuels are daunting in terms of polluting the environment, warming the planet and increasing the risk of serious illness and death in the population.",
    "Men may no longer wear dresses,\" (March 9): It's mind boggling to me that all the Delhi Township Board of Trustees has to worry about is men dressing in skirts for a community fundraising event.",
    "I agree with Mr. Williams that Chabot will attack because as a many year congressman, Chabot has a very small record of community improvement to campaign on in this year’s election.",
    "It’s time for Ukraine, NATO and the rest of the free world to offer face-saving concessions that could bring an immediate halt to the death and destruction we see more of every day.",
    "Second, Ukraine must agree to hold free elections in the two Russian-leaning provinces to determine which authority, Ukraine or Russia, the majority of citizens will be ruled by.",
    "Susan Goldrainer, Sayler Park\nUS can only spend so much on foreign aid\nEvery year there are compelling reasons to step up and help other countries with serious problems.",
    "Parents think nothing of a corporation directing them to get a soda pop with their child's happy meal because the profit margin on corn syrup water is through the roof.",
    "So, it is amazing for us to now witness the non-stop flights which originate at CVG and transport their loads to many destinations in Europe, Asia and other countries.",
    "Washington\nU.S. needs to step up and accept Ukrainian refugees\nThe estimated number of Ukrainians fleeing the horrendous Russian invasion is approaching three million.",
    "This relaxation of sanctions will broaden his influence by easing their concerns – either by the return of a billion dollar yacht or just a return to normalcy.",
    "I want Greg Landsman as the new Ohio Representative to Congress in District 1 because he carefully listens to the people when making political decisions.",
    "It is very probable that neither will be used because of the overwhelming complications in Europe (his best customers) and the rest of the free world.",
    "Becoming servile sheep to corporate America\nThe outcry over a City Council proposal to limit soft drink directives on children's menus is mystifying.",
    "The federal government should be working with the states to find temporary housing for these families while permanent accommodations are identified.",
    "I was one of those Ohioans who worked in Kentucky and spent many trips on the Anderson Ferry getting back and forth to home in Delhi at the time.",
    "Williams in his column points out that Steve Chabot will attack Landsman about his proposal in their campaign this year for the U.S. House seat.",
    "That cargo building was built in the 1940s and is still there, but every time I go to CVG I expect to see it gone due to the progress of CVG.",
    "Time to change daylight savings time for good\nYear after year and time after time, we read of the pros and cons of daylight savings time.",
    "Obvious examples include the high taxes mandated on cigarettes and other nicotine-containing products as well as on alcoholic beverages.",
    "Germany, France, Italy and the United Kingdom should be the primary source of funds for the Ukraine as the problem is in their backyard.",
    "The military assistance is needed and appreciated, but the U.S. needs to step up and take a leadership position to assist the refugees.",
    "It is quite apparent that they are bowing to political pressure from for-profit and non-profit organizations within Delhi boundaries.",
    "As the war continues and Putin grows more desperate to subdue Ukraine, the number of refugees will likely significantly increase.",
    "I suspect that thousands of families, including mine, would step up and provide temporary housing and support for these refugees.",
    "This appears as good leadership to me because he listened to the people of the community and was swayed to change by their input.",
    "Apparently, the parent's best hope is for their children to be obese and on five different medications just like mommy and daddy.",
    "To be free in America today one must be at war with a corporate America that directs and dominates over one's every waking hour.",
    "Other Western countries are stepping up and accepting thousands of these refugees from Poland since Poland is being overwhelmed.",
    "If you had a balanced budget requirement, you could total up your funds, deduct your spending programs and see what is left.",
    "This will avoid Russia being hemmed in by the NATO alliance and accomplish his number one objective – at least temporarily.",
    "These fine men were helping those in need long before the so-called \"morality conscience\" decided to make this a priority.",
    "In a nation this large, you'll always have hurricanes, tornadoes and wildfires that happen on a regular basis anymore.",
    "Cincinnati Councilman Greg Landsman brought up a proposal to ban the promotion of sodas on child menus in restaurants.",
    "This will solve the issue of raw feelings between citizens in those two provinces regardless of which power prevails.",
    "This offer will pressure Putin to at least consider his image in a nation already showing signs of political unrest.",
    "Kevin Mohan, Clifton\nEnd sanctions, offer concessions to end war in Ukraine\nThe war atrocities in Ukraine must stop.",
    "I worked for nine years in the old cargo building, which was adjacent to the long gone original passenger terminal.",
    "Our nation would benefit from hardworking people relocating here and ultimately becoming part of our great nation.",
    "It will also have an immediate impact on daily life in Russia that he will interpret as bolstering his reputation.",
    "This is the worst kind of war – a one-sided battle with the outcome measured in days and millions of lives lost.",
    "When children see the soda drink on the menu, they are inclined to clamor for the sugar drink with their meal.",
    "And third, the free world must relax the most onerous sanctions that disrupt life for the Russian people.",
    "After hearing feedback from the community about the proposal, Landsman then withdrew his suggestion.",
    "After Pan Am, I spent another 17 years at CVG as an international freight forwarder/customs broker.",
    "For heaven's sake, Chabot voted against the infrastructure bill to repair the Brent Spence Bridge.",
    "Millions of innocent people will die unless the free world assists Ukraine in a settlement effort.",
    "But when the government portends to act like a nanny for their children, parents howl in protest.",
    "So when Congress wants to send billions elsewhere, the public should have a say on that spending.",
    "What would Delhi do if organizations not palatable to some would join their annual parade?",
    "The belligerence towards government is nothing more than the howling of servile sheep.",
    "Of course, we all know that soda drinks are not good for children’s health and teeth.",
    "I propose we set a one-time change of 30 minutes that would be in effect year-round.",
    "He did object to the promotion of the sugary sodas for children on the menus.",
    "Regarding, \"Officials want to consider change of theme of Delhi Skirt Game.",
    "There is a limit to our spending ability whether Congress knows it or not.",
    "First, I suggest Ukraine offer not to seek NATO membership for five years.",
    "Call or write your elected officials and ask them to make this a priority!",
    "Russian oligarchs and peasants alike are feeling the pain of Putin’s war.",
    "He did not suggest the banning of children drinking sodas in restaurants.",
    "Benjamin Franklin said it: \"There never was a good war or a bad peace.\"",
    "Some like the later sunset and some dislike the dark morning hour.",
    "Putin is “all in” and has mentioned nuclear and chemical weapons.",
    "The U.S. has over four million unfilled jobs which need workers.",
    "There were no international flights from CVG at the time.",
    "Only three miles from work, but separated by the river.",
    "It affects the sleep patterns of young and old alike.",
    "Time is relative, and it is whatever we set it to be.",
    "But either option is – even at long odds – possible.",
    "Most are temporarily being held in Poland.",
    "Even the worst peace is better than that.",
    "It's great to see what CVG has become.",
    "They consider this to be freedom.",
    "Lawrence Lamping, Delhi Twp.",
    "Bob McElroy, Anderson Twp.",
    "It was the best of times.",
    "Ronald Hischak, Evanston",
    "Don't like it…stay home.",
    "Jon Schoettmer, Mt."
  ]
}