{
  "id": 9789,
  "mediaId": 2537,
  "date": "2022-03-21",
  "headline": "Letters: Training teaches how to handle a gun properly",
  "image": "https://www.gannett-cdn.com/presto/2021/11/09/PCIN/e05029d3-f83b-4618-8602-cbe705e15776-DeWine12.JPG?crop=5182,2915,x0,y412&width=3200&height=1801&format=pjpg&auto=webp",
  "link": "https://www.cincinnati.com/story/opinion/2022/03/21/letters-training-teaches-how-handle-gun-properly/7053383001/",
  "mediaOutlet": "cincinnati.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Day Lemmming, Hyde Park\nCongress funds their office budgets while Americans struggle\nAs Americans struggle with higher gas and grocery prices, is it surprising to anyone that in the $1.5 trillion dollar Omnibus Bill that Congress just passed to fund the government, they slipped in a 21% increase for their office budgets?",
    "Use rescue funds on job training\nI read with great interest that during the meeting of the National League of Cities in Georgia on March 1, President Biden was urging city governments to continue to use the $130 billion in funds allocated to them from the American Rescue Plan to help during the pandemic.",
    "I checked out Chabot’s website and found this message under the topic of Military: \"Our military service members and their families make great sacrifices to serve, defend and protect our country and I am deeply grateful for your service.",
    "Giving away free bus rides wasn't part of the tax levy deal\nReferencing the March 16 Enquirer article, \"Metro fares free:\" Where is the logic for offering free Metro rides this week in response to higher gas prices?",
    "It will allow us to partake in thousands of jobs that have been authorized through the historic infrastructure bill to build and repair our much-needed roads and bridges.",
    "Dan O'Connell, Pleasant Ridge\nChabot votes NO on veterans\nLast week, Congress took up a bill to provide health care to veterans who were exposed to burn pit toxins.",
    "Metro hasn't raised their fares as a result of the increase, so why not encourage people to save money by riding Metro at the usual fare?",
    "Many were happy to vote for the recent tax levy to improve bus service and expand routes, but free wasn't part of the deal.",
    "The number of our veterans who have developed serious issues and or have died because of these burn pits is gut-wrenching.",
    "If you need my assistance with a military issue, please print out my Authorization Form and fax or mail it to my office.",
    "I envision walking down the streets of Cincinnati at night; when a stranger walking towards me thinks I am suspicious.",
    "I truly hope that Cincinnati is taking advantage of this opportunity to receive funding to help with job training.",
    "I have a question for Steve Chabot: Why did you vote against getting our veterans the health care they need?",
    "I am not against guns, but please, know how to use it, and please, know if people are stable to use it.",
    "Mike DeWine has signed into law neither training nor background checks in order to make the NRA happy.",
    "Marta Lehman, College Hill\nNew gun law will keep paramedics very busy\nI am very disappointed with Gov.",
    "Dewine's decision to sign the law allowing no training or permit to conceal carry guns.",
    "Getting them the health care they need, as quickly as possible, is the least we can do.",
    "Police officers are required to go through training and yearly recertification.",
    "Not long ago, a police officer shot himself in the leg after recertification.",
    "That’s us, the people he should be serving and defending, not throwing over.",
    "So you go out and buy a gun, no training, no background check then what?",
    "If you have any questions, please feel free to call my office.\"",
    "In order to drive a car that can also kill, you have to learn.",
    "The Second Amendment's first words are \"A well regulated.\"",
    "He’s been on a tear, voting against all kinds of things.",
    "It took me a while before I was able to hit the target.",
    "It’s important for people to know what Chabot is doing.",
    "Listen up Hamilton County and Warren County residents!",
    "What about the other people that live in this state?",
    "Training teaches how to handle the gun accurately.",
    "Chabot should be more than embarrassed by this.",
    "He’s lost touch with the people he represents.",
    "Either I am going to dirty myself or get shot.",
    "The NRA and others seem to ignore that part.",
    "Are we to expect less for ordinary citizens?",
    "Chabot has been in Congress for decades.",
    "It’s called the Honoring our PACT Act.",
    "Shooting a gun accurately is not easy.",
    "One of two things is going to happen.",
    "He should apologize to our veterans.",
    "I still practice from time to time.",
    "I can see EMTs becoming very busy.",
    "Other Ohio Republicans voted yes.",
    "Richard Robinson, Colerain Twp.",
    "Here’s what I couldn’t believe.",
    "Antoinette Asimus, College Hill",
    "After all, we pay his salary.",
    "But health care for veterans?",
    "Marion Shafer, Liberty Twp.",
    "Then he pulls his weapon.",
    "Neither is very pleasant.",
    "Steve Chabot voted no.",
    "Go out and buy a gun.",
    "Term limits anyone?",
    "I learned in 1979.",
    "Then what?",
    "Now, Gov."
  ]
}