[
  {
    "id": 4546,
    "mediaId": 2658,
    "date": "2022-01-15",
    "sentence": "Here’s Sen. BERNIE SANDERS (I-Vt.): “Clearly, the current strategy is failing and we need a major course correction.” And Rep. <span class='selected-term'>TIM RYAN</span> (D-Ohio): “It seems like the Democrats can’t get out of their own way.” And Rep. STEPHANIE MURPHY (D-Fla.): “Leadership set out with a failed strategy, and while I guess, maybe they can message that they tried, it actually isn’t going to yield real laws.” And Rep. CHERI BUSTOS (D-Ill.): “We really kind of need to reset at this point.” All that, and more, from NYT’s Lisa Lerer and Emily Cochrane.",
    "author": "",
    "title": "POLITICO Playbook: Civil rights leaders fume after meeting with Sinema"
  },
  {
    "id": 4306,
    "mediaId": 2550,
    "date": "2022-01-22",
    "sentence": "Rep. <span class='selected-term'>Tim Ryan</span> of Ohio, for instance, is running for the state's open Senate seat and just might make that race competitive if inflation comes down, the pandemic becomes more manageable, and Republicans nominate a pro-Trump extremist who can't moderate for the general election (odds are decent on that part of the equation).",
    "author": "",
    "title": "It's time for Democrats to quit talking about Democrats and do nothing but pillory Republicans"
  },
  {
    "id": 2799,
    "mediaId": 2658,
    "date": "2022-01-31",
    "sentence": "New Joint Fundraisers\nRyan Rose Victory Fund (Rep. <span class='selected-term'>Tim Ryan</span>, Max Rose for Congress)\nTeam McConnell (Sens.",
    "author": "",
    "title": "TheGROUP adds another Republican"
  },
  {
    "id": 3513,
    "mediaId": 2514,
    "date": "2022-01-31",
    "sentence": "",
    "author": "Dylan Wells",
    "title": "Pennsylvania, Arizona, Alabama: the Senate primary races to watch in 2022"
  },
  {
    "id": 2714,
    "mediaId": 2658,
    "date": "2022-01-31",
    "sentence": "Democrats, who have supermajorities in both houses of the Legislature, are poised to control the outcome of the mapmaking process in New York for the first time in generations.”\nAN UPHILL BATTLE IN OHIO — WaPo’s Michael Scherer hits the road to profile Rep. <span class='selected-term'>TIM RYAN</span> (D-Ohio), whose direct appeal to blue-collar voters in the Ohio Senate race has made “him one of the most consequential Democratic candidates of the 2022 cycle, a test case on whether his party has any hope of reclaiming its erstwhile White working-class voting base.”\nGOVS DISH TO ZACH — The nation's governors descended on Washington's Marriott Marquis over the weekend for the National Governors Association's winter meeting, the organization's first in-person meeting since the start of the pandemic.",
    "author": "",
    "title": "POLITICO Playbook: Congress confronts a February deluge"
  },
  {
    "id": 3134,
    "mediaId": 2540,
    "date": "2022-02-03",
    "sentence": "On the Democratic side, Rep. <span class='selected-term'>Tim Ryan</span>, who raised $2.9 million last quarter, has largely consolidated support, but Ohio, which Trump carried by 8 points, remains a tough state for anyone in his party who’s not Sen. Sherrod Brown.",
    "author": "Simone Pathe",
    "title": "The 10 Senate seats most likely to flip in 2022"
  },
  {
    "id": 2278,
    "mediaId": 8322,
    "date": "2022-02-06",
    "sentence": "Democratic U.S. Rep. <span class='selected-term'>Tim Ryan</span> of Ohio said in an ad on social media, according to Newsweek.",
    "author": "",
    "title": "Joe Manchin targeted by millions of dollars in ad buys from all sides"
  },
  {
    "id": 2098,
    "mediaId": 2553,
    "date": "2022-02-08",
    "sentence": "The Democratic front-runner, Rep. <span class='selected-term'>Tim Ryan</span> (D-OH), succeeded former boss Jim Traficant into office and announced that he had abandoned his pro-life views in 2015.",
    "author": "Ben Johnson",
    "title": "These Are The Most Important Races To Watch In 2022"
  },
  {
    "id": 2584,
    "mediaId": 2664,
    "date": "2022-02-09",
    "sentence": "There has not been much polling in Ohio but a poll last fall showed Rep. <span class='selected-term'>Tim Ryan</span>, the likely Democratic nominee, in a tight race with any of the likely Republican nominees in a state that Trump easily carried twice.",
    "author": "Igor Derysh",
    "title": "Republicans in chaos: Conflict with Trump endangers GOP Senate prospects"
  },
  {
    "id": 2596,
    "mediaId": 2512,
    "date": "2022-02-09",
    "sentence": "There has not been much polling in Ohio but a poll last fall showed Rep. <span class='selected-term'>Tim Ryan</span>, the likely Democratic nominee, in a tight race with any of the likely Republican nominees in a state that Trump easily carried twice.",
    "author": "Igor Derysh",
    "title": "Republicans in chaos: Conflict with Trump endangers GOP Senate prospects"
  },
  {
    "id": 892,
    "mediaId": 8322,
    "date": "2022-02-15",
    "sentence": "Rep. <span class='selected-term'>Tim Ryan</span>, D-Ohio, appears to be the front-runner for the Democrat nomination for that seat.",
    "author": "Tyler Olson",
    "title": "Longtime Trump adviser Kellyanne Conway backs Jane Timken in Ohio Senate GOP primary"
  },
  {
    "id": 950,
    "mediaId": 8322,
    "date": "2022-02-16",
    "sentence": "It’s a similar story in Ohio, where moderate hopeful Rep. <span class='selected-term'>Tim Ryan</span> has vastly out-raised his Democratic opponents, while Republican contenders include author J.D.",
    "author": "",
    "title": "Introducing Fox News Power Rankings for 2022"
  },
  {
    "id": 1698,
    "mediaId": 8484,
    "date": "2022-02-17",
    "sentence": "While the Cook Political Report puts the seat as a 'lean Republican,' the GOP is poised to have a far messier primary than Democrats, who likely will pick moderate Rep. <span class='selected-term'>Tim Ryan</span> as their choice, who has a national profile due to a brief presidential run.",
    "author": "Katelyn Caralle",
    "title": "Is this the world's most secure phone? Biden lands back at the White House talking on his iPhone with a case with the Presidential seal with the US warning Putin is on the brink of invasion"
  },
  {
    "id": 13104,
    "mediaId": 2576,
    "date": "2022-03-03",
    "sentence": "More:For Delphi's former salaried workers, retirement has been a long fight for fair treatment\nIn the House, cosponsors include Democratic Reps. Debbie Dingell of Dearborn and <span class='selected-term'>Tim Ryan</span> and Marcy Kaptur of Ohio; and Republican Reps. Michael Turner, Bill Johnson and Warren Davidson of Ohio.",
    "author": "Todd Spangler",
    "title": "Delphi retirees' fix could cost $1 billion, Biden's support for measure unclear"
  },
  {
    "id": 15258,
    "mediaId": 2658,
    "date": "2022-03-14",
    "sentence": "DMFI PAC is backing Rep. <span class='selected-term'>Tim Ryan</span> (D-Ohio) and Rep. Val Demings (D-Fla.) for Senate, House Speaker Nancy Pelosi and Majority Leader Steny Hoyer, and Democratic Reps. Tony Cárdenas of California, Rick Larsen of Washington, Kathy Manning of North Carolina, Brad Sherman and Juan Vargas of California and Susan Wild of Pennsylvania.",
    "author": "",
    "title": "Biden hits the fundraising circuit"
  },
  {
    "id": 10818,
    "mediaId": 2746,
    "date": "2022-03-15",
    "sentence": "The winner of the GOP contest is expected to face off against Democratic Rep. <span class='selected-term'>Tim Ryan</span> in November’s general election.",
    "author": "Seth McLaughlin",
    "title": "Timken pledges to be ‘Trump tough’ on illegal immigration"
  },
  {
    "id": 13484,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "One of the Democrats who appeared most affected by the speech was Rep <span class='selected-term'>Tim Ryan</span>, a centrist Democrat and Senate candidate in Ohio who previously challenged Speaker Nancy Pelosi for leadership of the Democratic House caucus.",
    "author": "John Bowden",
    "title": "Zelensky’s ‘Churchillian’ speech wows Congress – but most still think a no fly zone is a bridge too far"
  },
  {
    "id": 9225,
    "mediaId": 2745,
    "date": "2022-03-21",
    "sentence": "Vance or Josh Mandel winds up as the GOP nominee for Senate in Ohio, pro-democracy Republicans of good will — such as former president George W. Bush, former Ohio governor John Kasich and their donors — should back the moderate Democratic contender, Rep. <span class='selected-term'>Tim Ryan</span>.",
    "author": "",
    "title": "Opinion: How to defeat the MAGA cult: Build a coalition that transcends party"
  },
  {
    "id": 7072,
    "mediaId": 8322,
    "date": "2022-04-05",
    "sentence": "The winner of the GOP primary will likely face Rep. <span class='selected-term'>Tim Ryan</span>, D-Ohio, in the general election.",
    "author": "Tyler Olson",
    "title": "JD Vance hits Biden on immigration in $1 million Ohio ad buy as president set to roll back Title 42"
  },
  {
    "id": 7428,
    "mediaId": 2726,
    "date": "2022-04-05",
    "sentence": "Another ad released by Democratic Representative, <span class='selected-term'>Tim Ryan</span> — who is also running for the open Senate seat — has been called out for stoking anti-Asian sentiment.",
    "author": "DeArbea Walker",
    "title": "Ohio US Senate candidates called out for racist campaign ads: \"Do you hate Mexicans?\""
  },
  {
    "id": 7110,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, former Rep. <span class='selected-term'>Tim Ryan</span> is the expected winner of that primary for the nomination.",
    "author": "Charles Kim",
    "title": "Ohio GOP Senate Candidates Vying for Trump Endorsement"
  },
  {
    "id": 7941,
    "mediaId": 2562,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, former Rep. <span class='selected-term'>Tim Ryan</span> is the expected winner of that primary for the nomination.",
    "author": "NationalWatch",
    "title": "Ohio GOP Senate Candidates Vying for Trump Endorsement"
  },
  {
    "id": 5724,
    "mediaId": 6443,
    "date": "2022-04-11",
    "sentence": "Mandel’s candidacy comes with a bit more baggage, but either man should be favored against the expected Democratic nominee, Rep. <span class='selected-term'>Tim Ryan</span>.",
    "author": "",
    "title": "Biden’s unpopularity drives Democrats’ desperation"
  },
  {
    "id": 5726,
    "mediaId": 2790,
    "date": "2022-04-11",
    "sentence": "Rep. <span class='selected-term'>Tim Ryan</span>, who has spoken to this problem and unsuccessfully challenged Nancy Pelosi for the House speakership, has the state party's endorsement.",
    "author": "Domenico Montanaro",
    "title": "The top 10 Senate seats that are most likely to flip to the other party"
  },
  {
    "id": 5680,
    "mediaId": 2512,
    "date": "2022-04-11",
    "sentence": "\"Democratic front-runner <span class='selected-term'>Tim Ryan</span> would no doubt rather one of them prevail than Matt Dolan, the state senator and part-owner of the Cleveland Guardians, who insists on talking about the issues,\" wrote Rubin.",
    "author": "Brandon Gage",
    "title": "Donald Trump's 'troublemaking' could end up benefitting Democrats: columnist"
  },
  {
    "id": 5365,
    "mediaId": 2557,
    "date": "2022-04-15",
    "sentence": "Rush a donation now: https://t.co/qzkuU333fM\n— <span class='selected-term'>Tim Ryan</span> (@TimRyan) April 15, 2022\nListen to the latest daily DML podcasts below!",
    "author": "DML News App",
    "title": "BREAKING: Trump makes endorsement for GOP candidate in crowded Ohio U.S. Senate race"
  },
  {
    "id": 5653,
    "mediaId": 2746,
    "date": "2022-04-17",
    "sentence": "The winner of the May 3 primary is likely to face Rep. <span class='selected-term'>Tim Ryan</span>, a Democrat, in November for the seat being vacated by Republican Sen.",
    "author": "Jennifer Harper",
    "title": "NRA plans its major national meeting in Houston in May"
  },
  {
    "id": 5232,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "OH-Sen: Despite widespread condemnation of his first TV ad that blamed America's ills on China, Democratic Rep. <span class='selected-term'>Tim Ryan</span> is back to the same theme in his newest spot, telling viewers, \"We've gotta take on China\" and \"be Americans first.\"",
    "author": "",
    "title": "rhetoric despite pleas from Asian Americans"
  },
  {
    "id": 5414,
    "mediaId": 2562,
    "date": "2022-04-18",
    "sentence": "\"This is not an easy endorsement for me to make because I like and respect some of the other candidates in the race – they've said some great things about 'Trump' and, like me, they love Ohio and they love our country,\" he said, adding that Vance is the one candidate most likely to defeat Democrat Rep. <span class='selected-term'>Tim Ryan</span>, who is expected to win his party's nomination in the Senate race.",
    "author": "NationalWatch",
    "title": "JD Vance’s New Ad Campaign Touts Trump Endorsement"
  },
  {
    "id": 5190,
    "mediaId": 8278,
    "date": "2022-04-20",
    "sentence": "The EPA chief was joined by U.S. Sen. Sherrod Brown, U.S. Rep. <span class='selected-term'>Tim Ryan</span> and Youngstown Mayor Tito Brown to tour the community and meet residents.",
    "author": "",
    "title": "EPA Chief, Officials Tour Area Targeted for $1.6M Lead Pipe Project"
  },
  {
    "id": 4747,
    "mediaId": 2700,
    "date": "2022-04-22",
    "sentence": "In Ohio, Rep. <span class='selected-term'>Tim Ryan</span> is well positioned to win the Democratic nomination for an open Senate seat with a message appealing to centrist, blue collar workers that is in line with Biden’s overall approach.",
    "author": "Zeke Miller",
    "title": "Biden’s election year challenge: Blame GOP for nation’s woes"
  },
  {
    "id": 4810,
    "mediaId": 2680,
    "date": "2022-04-22",
    "sentence": "In Ohio, Rep. <span class='selected-term'>Tim Ryan</span> is well positioned to win the Democratic nomination for an open Senate seat with a message appealing to centrist, blue collar workers that is in line with Biden’s overall approach.",
    "author": "WILL WEISSERT and ZEKE MILLER",
    "title": "Biden's election year challenge: Blame GOP for nation's woes"
  },
  {
    "id": 5120,
    "mediaId": 2590,
    "date": "2022-04-22",
    "sentence": "In Ohio, Rep. <span class='selected-term'>Tim Ryan</span> is well positioned to win the Democratic nomination for an open Senate seat with a message appealing to centrist, blue collar workers that is in line with Biden’s overall approach.",
    "author": "",
    "title": "Biden's Election Year Challenge: Blame GOP For Nation's Woes"
  },
  {
    "id": 5130,
    "mediaId": 2594,
    "date": "2022-04-22",
    "sentence": "In Ohio, Rep. <span class='selected-term'>Tim Ryan</span> is well positioned to win the Democratic nomination for an open Senate seat with a message appealing to centrist, blue collar workers that is in line with Biden’s overall approach.",
    "author": "Via AP news wire",
    "title": "Biden's election year challenge: Blame GOP for nation's woes"
  },
  {
    "id": 5092,
    "mediaId": 2550,
    "date": "2022-04-23",
    "sentence": "Democratic Congressman <span class='selected-term'>Tim Ryan</span> is running for Ohio's open Senate seat and he just launched a new ad declaring, \"We've got to take on China and be Americans first.\"",
    "author": "",
    "title": "The Downballot: Why House Democrats' best defense is a good offense (transcript)"
  },
  {
    "id": 4778,
    "mediaId": 2540,
    "date": "2022-04-23",
    "sentence": "Ohio Rep. <span class='selected-term'>Tim Ryan</span>, the leading Democrat in an open-seat Senate race, has co-sponsored a bill that would prevent the Biden administration from what he calls a \"wrong and reckless\" decision to lift the Title 42 restrictions.",
    "author": "Eric Bradner",
    "title": "Swing-state Democrats turn on Biden over Title 42 border decision"
  }
]