[
  {
    "id": 2694,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "",
    "author": "",
    "title": "Republican Bernie Moreno drops out of crowded Ohio Senate primary"
  },
  {
    "id": 2307,
    "mediaId": 2643,
    "date": "2022-02-04",
    "sentence": "The eventual winner of the Republican primary will likely face Democratic Rep. <span class='selected-term'>Tim Ryan</span> in the race for the Ohio seat.",
    "author": "Ewan Palmer",
    "title": "Donald Trump Clears Path for MAGA Ticket in Ohio's GOP Senate Race"
  },
  {
    "id": 1102,
    "mediaId": 2548,
    "date": "2022-02-11",
    "sentence": "Rep. <span class='selected-term'>Tim Ryan</span>, who is fundraising with the help of Hillary Clinton, is the likely Democratic nominee.",
    "author": "Michael Ginsberg",
    "title": "New Ohio Senate Poll Shows More Bad News For JD Vance"
  },
  {
    "id": 12776,
    "mediaId": 2746,
    "date": "2022-03-01",
    "sentence": "The winner of the race is expected to face off in the general election against Democratic Rep. <span class='selected-term'>Tim Ryan</span>.",
    "author": "Seth McLaughlin",
    "title": "Jane Timken rakes in endorsements from former Trump campaign figures in Ohio Senate bid"
  },
  {
    "id": 9250,
    "mediaId": 2658,
    "date": "2022-03-21",
    "sentence": "Paul LePage, a Republican seeking an unprecedented third nonconsecutive term, are now officially on a collision course for the Blaine House this fall after no other candidates qualified to run for their party’s nomination.”\n— “Securing the TikTok Vote,” by Anna Kambhampaty, The New York Times: “If all politics is theater, Rep. <span class='selected-term'>Tim Ryan</span> (D-Ohio) is one of its subtler actors.",
    "author": "",
    "title": "Gibbons and Mandel go for round 2"
  },
  {
    "id": 8819,
    "mediaId": 8497,
    "date": "2022-04-06",
    "sentence": "",
    "author": "WLWT Digital Staff",
    "title": "Ohio US Senate debate: Where candidates stand on second amendment"
  },
  {
    "id": 7775,
    "mediaId": 2540,
    "date": "2022-04-09",
    "sentence": "The likely Democratic nominee in this year’s Senate race, longtime US Rep. <span class='selected-term'>Tim Ryan</span> – who challenged Nancy Pelosi for the House speaker’s gavel in 2016 and briefly ran for the 2020 Democratic presidential nomination – is offering himself as an “all economy all the time” candidate in Brown’s mold.",
    "author": "Eric Bradner",
    "title": "Ohio GOP Senate primary remains all about Trump as candidates hope for late endorsement"
  },
  {
    "id": 7941,
    "mediaId": 2562,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, former Rep. <span class='selected-term'>Tim Ryan</span> is the expected winner of that primary for the nomination.",
    "author": "NationalWatch",
    "title": "Ohio GOP Senate Candidates Vying for Trump Endorsement"
  },
  {
    "id": 7110,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "On the Democratic side, former Rep. <span class='selected-term'>Tim Ryan</span> is the expected winner of that primary for the nomination.",
    "author": "Charles Kim",
    "title": "Ohio GOP Senate Candidates Vying for Trump Endorsement"
  },
  {
    "id": 6075,
    "mediaId": 2919,
    "date": "2022-04-12",
    "sentence": "\"I also think it's a political liability like at the end of the day this is the Republican Primary, we need to send the best Republican to take on <span class='selected-term'>Tim Ryan</span> if you're making gaffes like that it maybe means that you shouldn't be running on the big stage.\"",
    "author": "John Kosich",
    "title": "GOP Senate hopefuls Vance, Gibbons campaign in Northeast Ohio ahead of May primary"
  }
]