[
  {
    "id": 12069,
    "mediaId": 2702,
    "date": "2022-03-29",
    "sentence": "Rep. <span class='selected-term'>Tim Ryan</span>’s (D) Ohio Senate campaign launched a $3.3 million ad buy, marking his first of the campaign cycle.",
    "author": "Julia Manchester",
    "title": "Tim Ryan launches $3.3 million ad buy"
  },
  {
    "id": 10007,
    "mediaId": 2573,
    "date": "2022-03-30",
    "sentence": "It is us versus China, and instead of taking them on, Washington is wasting our time on stupid fights,\" Rep. <span class='selected-term'>Tim Ryan</span>, the clear front-runner in the Democratic Senate primary in Ohio, says in spliced-together clips from the campaign trail in his first TV spot.",
    "author": "Paul Steinhauser",
    "title": "The Senate candidate who spotlights 'It is us versus China' in a new ad is a Democrat"
  },
  {
    "id": 10519,
    "mediaId": 2528,
    "date": "2022-04-02",
    "sentence": "\"Rep. <span class='selected-term'>Tim Ryan</span>'s ad for his Ohio Senate campaign stirs up a racist pedagogy vis-à-vis China and makes Americans of East Asian descent vulnerable to attack,\" Shekar Narasimhan, AAPI Victory Fund chairman and founder, said in the statement.",
    "author": "Hannah Getahun",
    "title": "Democratic Rep. Tim Ryan criticized for 'sinophobic' campaign ad referencing 'Communist China'"
  },
  {
    "id": 9811,
    "mediaId": 2573,
    "date": "2022-04-04",
    "sentence": "Fox News contributor Marc Thiessen defended Democrat Rep. <span class='selected-term'>Tim Ryan</span> on \"America's Newsroom\" Monday after the Ohio Senate candidate received backlash for a campaign ad where he criticizes China and calls for more U.S. manufacturing.",
    "author": "Fox News Staff",
    "title": "Marc Thiessen on Dem candidate being accused of anti-Asian hate for criticizing China: 'What a joke'"
  },
  {
    "id": 7280,
    "mediaId": 2572,
    "date": "2022-04-06",
    "sentence": "The winner of the primary will likely face Rep. <span class='selected-term'>Tim Ryan</span>, D-Ohio, in the general election.",
    "author": "Tyler Olson",
    "title": "Ohio GOP Senate showdown: Gibbons hits Mandel on China in ad that returns to root of combustible feud"
  },
  {
    "id": 5232,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "OH-Sen: Despite widespread condemnation of his first TV ad that blamed America's ills on China, Democratic Rep. <span class='selected-term'>Tim Ryan</span> is back to the same theme in his newest spot, telling viewers, \"We've gotta take on China\" and \"be Americans first.\"",
    "author": "",
    "title": "rhetoric despite pleas from Asian Americans"
  }
]