[
  {
    "id": 3994,
    "mediaId": 2644,
    "date": "2022-01-24",
    "sentence": "Prominent Democratic members who signed on include Rashida Tlaib (D-Mich.), Pramila Jayapal (D-Wash.) Tom Malinowski (D-NJ), Kathleen Rice (D-NY), Andy Kim (D-NJ), Ritchie Torres (D-NY) and <span class='selected-term'>Tim Ryan</span> (D-Ohio).",
    "author": "Juliegrace Brufke",
    "title": "House lawmakers call on Pelosi, McCarthy to pass stock trade ban"
  },
  {
    "id": 3738,
    "mediaId": 2526,
    "date": "2022-01-24",
    "sentence": "Meanwhile, lobbyists for Facebook have recently thrown cash at Rep. Brett Guthrie (R-KY), the National Republican Study Committee (NRSC) which is chaired by Rep. Jim Banks (R-IN), Rep. Kelly Armstrong (R-ND), Sen. Chuck Grassley (R-IA), Sen. John Thune (R-SD), Sen. Lisa Murkowski (R-AK), Sen. Rand Paul (R-KY), Rep. Kevin McCarthy (R-CA), Rep. <span class='selected-term'>Tim Ryan</span> (D-OH), Sen. Jon Ossoff (D-GA), and Rep. Adam Kinzinger (R-IL).",
    "author": "John Binder",
    "title": "Amazon, Facebook Spend Millions Lobbying Congress for More Legal Immigration, Amnesty for Illegal Aliens"
  },
  {
    "id": 2714,
    "mediaId": 2658,
    "date": "2022-01-31",
    "sentence": "Democrats, who have supermajorities in both houses of the Legislature, are poised to control the outcome of the mapmaking process in New York for the first time in generations.”\nAN UPHILL BATTLE IN OHIO — WaPo’s Michael Scherer hits the road to profile Rep. <span class='selected-term'>TIM RYAN</span> (D-Ohio), whose direct appeal to blue-collar voters in the Ohio Senate race has made “him one of the most consequential Democratic candidates of the 2022 cycle, a test case on whether his party has any hope of reclaiming its erstwhile White working-class voting base.”\nGOVS DISH TO ZACH — The nation's governors descended on Washington's Marriott Marquis over the weekend for the National Governors Association's winter meeting, the organization's first in-person meeting since the start of the pandemic.",
    "author": "",
    "title": "POLITICO Playbook: Congress confronts a February deluge"
  },
  {
    "id": 17109,
    "mediaId": 8497,
    "date": "2022-03-02",
    "sentence": "Ohio's one lost congressional seat is subtracted in the Akron area, where the once reliably safe districts of Democratic U.S. Rep. <span class='selected-term'>Tim Ryan</span> and Republican U.S. Rep. Anthony Gonzalez were merged into a single district leaning 4.3% Democratic.",
    "author": "The Associated Press",
    "title": "Ohio mapmakers OK 2nd congressional map over Dem objections"
  },
  {
    "id": 17352,
    "mediaId": 8491,
    "date": "2022-03-04",
    "sentence": "In the past, he has challenged <span class='selected-term'>Tim Ryan</span> in the 13th District, running as a Republican.",
    "author": "Jerica Rogers",
    "title": "Congressional candidates file petitions for May primary"
  },
  {
    "id": 13484,
    "mediaId": 2594,
    "date": "2022-03-16",
    "sentence": "One of the Democrats who appeared most affected by the speech was Rep <span class='selected-term'>Tim Ryan</span>, a centrist Democrat and Senate candidate in Ohio who previously challenged Speaker Nancy Pelosi for leadership of the Democratic House caucus.",
    "author": "John Bowden",
    "title": "Zelensky’s ‘Churchillian’ speech wows Congress – but most still think a no fly zone is a bridge too far"
  },
  {
    "id": 10595,
    "mediaId": 6656,
    "date": "2022-03-30",
    "sentence": "This is clearly a process,\" subcommittee chairman Rep. <span class='selected-term'>Tim Ryan</span>, D-Ohio, said.",
    "author": "Calley Hair",
    "title": "Capitol police ask for $105M budget increase citing understaffing"
  }
]