{
  "id": 6861,
  "mediaId": 8251,
  "date": "2022-04-12",
  "headline": "Arizona town declares victory after SRP loses natural gas expansion bid",
  "image": "https://media.12news.com/assets/KPNX/images/140143ed-09d5-4f84-889f-553b61c0f3b6/140143ed-09d5-4f84-889f-553b61c0f3b6_1140x641.jpg",
  "link": "https://www.12news.com/article/news/politics/arizona-town-declares-victory-after-srp-loses-natural-gas-expansion-bid/75-1fadf3c9-0398-4e62-92b3-a5b0c8f9e96f",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    3530,
    1727,
    5542,
    87,
    1172,
    5949,
    6550,
    6515
  ],
  "sentences": [
    "About two dozen Randolph residents stood alongside environmental advocates Tuesday outside the Arizona Corporation Commission Phoenix facility to ask regulators to deny the proposed expansion of an SRP gas power plant on the outskirts of town.",
    "“And that is something that has not happened very often, not just here but across the country.”\nThe Sierra Club wants SRP to conduct more research into alternative energy options, such as renewables and batteries.",
    "But climate experts warn that expansion of the natural gas industry worldwide is not sufficient enough to avoid climate catastrophe, given current trends laid out in the U.N.’s most recent IPCC report.",
    "SRP board members who voted in favor of the plan said it would help the company meet its long-term decarbonization goals while shoring up the utility’s energy reserves.",
    "Commissioner Justin Olson was the lone vote in favor of SRP, arguing that new natural gas sources are necessary to meet growing electricity demands of the state.",
    "The Arizona Corporation Commission voted 4-1 to reject a proposal by Salt River Project (SRP) to expand a gas power plant just outside the community of Randolph.",
    "RANDOLPH, Arizona — Homeowners of a small Arizona town are celebrating a monumental victory Tuesday against the state’s second largest power company.",
    "According to UtilityDive.com, SRP attempted to work with the community through mailings, door-to-door interactions, phone calls and community events.",
    "“I think we saw environmental justice recognized in denying this certificate,” said Sandy Bahr, director of the Sierra Club’s Grand Canyon Chapter.",
    "The SRP gas expansion takes Arizona in the wrong direction,” said Rhonda Seifert of Arizona Health Professionals for Climate Action.",
    "ACC Commissioner Sandra Kennedy argued SRP rushed the planning process and did not collaborate enough with the Randolph community.",
    "I’m concerned about Arizonans being able to have their air-conditioning turned on during the hot summer months,” Olson said.",
    "About two dozen Randolph residents stood alongside environmental advocates to ask regulators to deny the proposed expansion.",
    "“It is a very inhumane act to allow 28 turbines to operate in our community,” said Mary Turner, a Randolph resident.",
    "As described by NBC News, the unincorporated community is economically depressed and prone to noise and pollution.",
    "Natural gas is considered better for the environment than coal, emitting about half the CO2 into the atmosphere.",
    "Many residents have fled their homes for days to avoid vapors, odors, particulates,” said resident Jeff Jordan.",
    "Black farmworkers, denied opportunities to own land in existing cities, founded the community in the 1920s.",
    "SRP hoped the $1 billion natural gas plant expansion would be a useful addition to its energy portfolio.",
    "Randolph homeowners argued that expanding the natural gas plant would only worsen existing problems.",
    "A spokesperson for the Sierra Club considers Tuesday’s vote an important victory in Arizona.",
    "The Valley is growing and power companies like SRP need new sources of energy to keep up.",
    "During Tuesday’s hearing, commissioners voted 4-1 in favor of the town of Randolph.",
    "“I do not believe it is wise to put further pressure on this community to relocate.",
    "Catch up on the latest news and stories on the 12 News YouTube channel.",
    "“I’m concerned about what is going to be the impact to ratepayers.",
    "I’m concerned about what is going to be the impact to reliability.",
    "“The current system in place has failed the community of Randolph.",
    "The small, rural town sits about 60 miles southeast of Phoenix.",
    "“We have an opportunity to invest in cleaner, cheaper options.",
    "SRP’s board approved the expansion in September of last year.",
    "Their history is important,” said Commissioner Anna Tovar.",
    "Subscribe today."
  ]
}