[
  {
    "id": 1226,
    "mediaId": 2557,
    "date": "2022-04-04",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nDr. <span class='selected-term'>Mehmet Oz</span>, the celebrity doctor now running as a candidate for the Republican nomination for U.S. Senate in Pennsylvania, as recently as 2018 was publicly advocating for amnesty for illegal alien youths.",
    "author": "DML News App",
    "title": "REPORT: Celebrity GOP candidate pushed amnesty for illegal alien youths in 2018"
  },
  {
    "id": 468,
    "mediaId": 2738,
    "date": "2022-04-10",
    "sentence": "On Saturday, as CNN shared, Trump went ahead and gave quack TV doc <span class='selected-term'>Mehmet Oz</span>, who is running for senator in Pennsylvania, his full endorsement.",
    "author": "Jennifer Wood",
    "title": "Donald Trump Endorsing Dr. Oz In The PA Senate Race Has Sparked A Hilarious MAGA Mutiny"
  },
  {
    "id": 322,
    "mediaId": 2526,
    "date": "2022-04-11",
    "sentence": "Host Alex Marlow breaks down the latest news, including President Trump’s endorsement of Dr. <span class='selected-term'>Mehmet Oz</span>, Elon Musk backing off Twitter’s board, the latest trans hysteria, the chaos at our border, France’s presidential election, and Big Joey’s latest effort to dis-unify the country.",
    "author": "Breitbart News",
    "title": "Breitbart News Daily Podcast Ep. 111: Trump Endorses Dr. Oz, Musk Off Twitter Board; Guest: David Mamet"
  },
  {
    "id": 129,
    "mediaId": 2557,
    "date": "2022-04-15",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nCelebrity Doctor <span class='selected-term'>Mehmet Oz</span>, who is running as a tough-on-China candidate in the race to fill Pennsylvania’s Senate seat, is coming under fire again for his long history with the communist country.",
    "author": "DML News App",
    "title": "REPORT: Mehmet Oz’s China Ties Deepen: Financial Disclosures"
  }
]