[
  {
    "id": 5504,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "“This should be a model for other U.S. companies, unlike David McCormick’s track record of exporting jobs to China and India from the dark corners of Wall Street.”\nIn reference to Oz’s connections to China, McCormick campaign spokesperson Jess Szymanski told POLITICO: “<span class='selected-term'>Mehmet Oz</span> — citizen of Turkey, creature of Hollywood — has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,” and that “while Mehmet has been silent on China until he needed to knock down Dave’s credentials, Dave was serving our country and standing up to the [Chinese Communist Party].”\nIn its 2020 annual report filed with the Securities and Exchange Commission, Usana said that China was its “largest market and single largest source of revenue,” making up around 41 percent of net sales and about 38 percent of its active customers.",
    "author": "",
    "title": "Dr. Oz is running as a China hawk. It's a bit of a stretch."
  },
  {
    "id": 4221,
    "mediaId": 6570,
    "date": "2022-03-03",
    "sentence": "Blood sport, it may be, as just this week, Dr. <span class='selected-term'>Mehmet Oz</span>, another Republican running for the Senate, quipped that Mr. McCormick “says he is tough on China, but got rich investing with them.”\nThe New York Times reported late last month that Mr. McCormick’s hedge fund, Bridgewater Associates, was closely linked to China, and cited affectionate comments he had made in the past about the country, though some were from when he served as U.S. Treasury Under Secretary for International Affairs in George W. Bush’s administration.",
    "author": "Julian Routh",
    "title": "David McCormick hawkish on China, punches back at Mehmet Oz in visit to suburban Pittsburgh"
  },
  {
    "id": 3185,
    "mediaId": 2699,
    "date": "2022-03-16",
    "sentence": "A recent attack ad against McCormick’s big rival—pop surgeon Dr. <span class='selected-term'>Mehmet Oz</span>—is spotlighting the talk-show host’s position on transgender issues, slamming him as a “Republican in Name Only” for engaging on the topic in the past.",
    "author": "Roger Sollenberger",
    "title": "Dr. Oz’s PA Senate Rival Sure Was ‘Woke’ While He Was a CEO"
  },
  {
    "id": 679,
    "mediaId": 2619,
    "date": "2022-04-16",
    "sentence": "McCormick left his CEO perch at posh hedge fund Bridgewater Associates to run against Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Lydia Moynihan",
    "title": "Citadel’s Ken Griffin is Republican party’s top donor – with $40 million put toward midterms"
  },
  {
    "id": 333,
    "mediaId": 6570,
    "date": "2022-04-18",
    "sentence": "New financial reports filed Friday reveal in detail how <span class='selected-term'>Mehmet Oz</span> and David McCormick, the leading Republican candidates in Pennsylvania’s U.S. Senate race, have spent a combined $18 million from their own personal fortunes to fuel their campaigns and make it the most expensive primary election in the country.",
    "author": "",
    "title": "Pa. U.S. Senate Republican primary: Now we know how much Mehmet Oz and David McCormick are personally spending on their campaigns"
  },
  {
    "id": 271,
    "mediaId": 5308,
    "date": "2022-04-20",
    "sentence": "He is running for Senate to fight the wokeness that liberals like <span class='selected-term'>Mehmet Oz</span> have pushed on our society.",
    "author": "Cameron Joseph",
    "title": "Senate candidate David McCormick has pledged to “fight the woke mob,” but he once called for “solidarity by denouncing and eradicating structural bigotry.”"
  }
]