[
  {
    "id": 6688,
    "mediaId": 2718,
    "date": "2022-02-01",
    "sentence": "Oz” spinoff, hosted by <span class='selected-term'>Mehmet Oz</span>’s daughter Daphne Oz, debuted to a 0.4 rating.",
    "author": "Tony Maglio",
    "title": "‘Dr. Oz’ Spinoff’s Debut Ratings Down One Third From Final Week of ‘Dr. Oz’"
  },
  {
    "id": 5507,
    "mediaId": 2564,
    "date": "2022-02-11",
    "sentence": "+4\nView gallery\nThe celebrity heart surgeon, who recently ended his daytime TV show to run for office, was captured bending down and kissing the pink and gold star on the famous Los Angeles boulevard\n+4\nView gallery\nThe anti-Hollywood attack ad is being run by a group who supports hedge fund CEO David McCormick (pictured), who has former White House communications director Hope Hicks working for him\n+4\nView gallery\nDr. <span class='selected-term'>Mehmet Oz</span> stands over his new star on the Hollywood Walk of Fame at a ceremony on Friday\nThat same career, however, is being used against him by rivals who are picking apart his TV shows and his past as a self-styled wellness and anti-obesity advocate to fuel doubt about his conservative credentials as a Republican.",
    "author": "Associated Press",
    "title": "Dr Oz's rival in the Pennsylvania Senate race claims he is too 'Hollywood' as he's given a STAR on the Walk of Fame (and bent down to kiss it)"
  },
  {
    "id": 3245,
    "mediaId": 2556,
    "date": "2022-03-09",
    "sentence": "",
    "author": "",
    "title": "‘The Good Dish’ Not Returning For Season 2 In Syndication; Sony Pictures TV Exploring Options"
  },
  {
    "id": 3372,
    "mediaId": 2663,
    "date": "2022-03-15",
    "sentence": "Reality has apparently caught up with Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "David Reddish",
    "title": "Dr. Oz’s disastrous Senate campaign reportedly on “life support” as he eyes TV comeback"
  },
  {
    "id": 2546,
    "mediaId": 2776,
    "date": "2022-03-23",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nThe TV host then denounced Biden for being “petty” and “political” in his action, and assured he had “no intention” of resigning.",
    "author": "Cynthia Cook",
    "title": "Dr. Oz Claps Back After Joe Biden Fires Him From President’s Sports Council: Watch"
  },
  {
    "id": 2193,
    "mediaId": 2584,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the White House sent letters to Dr <span class='selected-term'>Mehmet Oz</span> and former football star Herschel Walker – two Republican Senate candidates in Pennsylvania and Georgia, respectively – asking them to submit their resignations or face termination.",
    "author": "Maya Yang",
    "title": "White House tells Dr Oz and Herschel Walker to resign from fitness council"
  },
  {
    "id": 2090,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "I am proud of my service and will not resign.pic.twitter.com/EP1vHWATp4\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@Dr. Mehmet Oz) 1648071503\nA recent Fox News poll shows Oz trailing David McCormick in the Republican primary, 24-15 percent, after having enjoyed a lead in the race shortly after announcing his candidacy.",
    "author": "Timothy Evans",
    "title": "Dr. Oz faces backlash from 'furious' longtime staffers after laying them off without warning"
  },
  {
    "id": 588,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "| Riccardo Savi/Getty Images for Concordia Summit\nBy Holly Otterbein and Natalie Allison\n 04/09/2022 06:44 PM EDT\nUpdated: 04/09/2022 08:10 PM EDT\nDr. <span class='selected-term'>Mehmet Oz</span> has won the race for Donald Trump’s coveted endorsement in Pennsylvania’s Senate GOP primary.",
    "author": "",
    "title": "Trump endorses Oz in key Senate race"
  },
  {
    "id": 420,
    "mediaId": 2716,
    "date": "2022-04-11",
    "sentence": "Over the weekend, former President Donald Trump endorsed <span class='selected-term'>Mehmet Oz</span> — \"Dr. Oz\" to the many viewers of his longtime syndicated television show — in the Pennsylvania GOP primary for U.S. Senate.",
    "author": "Joel Mathis",
    "title": "Trump's real ideology: fame"
  },
  {
    "id": 20,
    "mediaId": 2557,
    "date": "2022-04-11",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by TheHill.com:\nFrustration is mounting on the GOP’s right flank over former President Trump’s endorsement of <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate race.",
    "author": "DML News App",
    "title": "POLL: After you see THIS, do you support Trump’s endorsement of Dr. Oz for U.S. Senate?"
  },
  {
    "id": 326,
    "mediaId": 2724,
    "date": "2022-04-11",
    "sentence": "pic.twitter.com/XkIE6qV4R0\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 16, 2022\nWe live in a time where too many Republicans try selling their conservative wares just to get elected only to start functioning like barely-disguised left-of-center RINOs once they get into office.",
    "author": "Rusty Weiss",
    "title": "I’m Just Going To Say This: Trump’s Endorsement Of Dr. Oz Is The Wrong Move"
  }
]