[
  {
    "id": 5809,
    "mediaId": 2679,
    "date": "2022-02-11",
    "sentence": "HARRISBURG, Pa. (AP) — <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon who recently ended his daytime TV “Dr.",
    "author": "MARC LEVY",
    "title": "Oz gets Walk of Fame star as rival says he’s too ‘Hollywood’"
  },
  {
    "id": 5960,
    "mediaId": 6518,
    "date": "2022-02-11",
    "sentence": "HOLLYWOOD (CBSLA) — Medical show host Dr. <span class='selected-term'>Mehmet Oz</span> received a star on the Hollywood Walk of Fame Friday afternoon.",
    "author": "",
    "title": "Medical Show Host Dr. Oz Receives Star On Hollywood Walk Of Fame"
  },
  {
    "id": 6088,
    "mediaId": 2736,
    "date": "2022-02-11",
    "sentence": "Pennsylvania Republican Dr. <span class='selected-term'>Mehmet Oz</span> took a break from his Senate campaign to travel to Hollywood and literally get down on all fours to kiss his newly awarded star on the Walk of Fame.",
    "author": "Greg P.",
    "title": "WATCH: PA Senate candidate Dr. Oz kisses his new star on the Hollywood Walk of Fame"
  },
  {
    "id": 5698,
    "mediaId": 2732,
    "date": "2022-02-11",
    "sentence": "HARRISBURG — <span class='selected-term'>Mehmet Oz</span>, the celebrity cardiologist who recently ended his daytime TV “Dr.",
    "author": "Associated Press",
    "title": "Oz gets Walk of Fame star as rival says he's too 'Hollywood'"
  },
  {
    "id": 5676,
    "mediaId": 6526,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Marc Levy",
    "title": "Dr. Oz gets Walk of Fame star as Pennsylvania Senate campaign rivals says he’s too ‘Hollywood’"
  },
  {
    "id": 5569,
    "mediaId": 2746,
    "date": "2022-02-11",
    "sentence": "HARRISBURG, Pa. (AP) — <span class='selected-term'>Mehmet Oz</span>, the celebrity cardiologist who recently ended his daytime TV “Dr.",
    "author": "Marc Levy",
    "title": "Oz gets Walk of Fame star as rival says he’s too ‘Hollywood’"
  },
  {
    "id": 5510,
    "mediaId": 2594,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Via AP news wire",
    "title": "Oz gets Walk of Fame star as rival says he's too 'Hollywood'"
  },
  {
    "id": 5507,
    "mediaId": 2564,
    "date": "2022-02-11",
    "sentence": "+4\nView gallery\nThe celebrity heart surgeon, who recently ended his daytime TV show to run for office, was captured bending down and kissing the pink and gold star on the famous Los Angeles boulevard\n+4\nView gallery\nThe anti-Hollywood attack ad is being run by a group who supports hedge fund CEO David McCormick (pictured), who has former White House communications director Hope Hicks working for him\n+4\nView gallery\nDr. <span class='selected-term'>Mehmet Oz</span> stands over his new star on the Hollywood Walk of Fame at a ceremony on Friday\nThat same career, however, is being used against him by rivals who are picking apart his TV shows and his past as a self-styled wellness and anti-obesity advocate to fuel doubt about his conservative credentials as a Republican.",
    "author": "Associated Press",
    "title": "Dr Oz's rival in the Pennsylvania Senate race claims he is too 'Hollywood' as he's given a STAR on the Walk of Fame (and bent down to kiss it)"
  }
]