[
  {
    "id": 2430,
    "mediaId": 2862,
    "date": "2022-03-20",
    "sentence": "The idea that the laptop story was invented by Russia was also backed by numerous US intelligence officials, both former and current, according to several media reports.One of the leading Republican candidates in a race for a Pennsylvania Senate seat, Dr <span class='selected-term'>Mehmet Oz</span>, also vowed to back the initiative to probe the silencing of the story about Hunter Biden in 2020, if he wins election in the 2022 midterms.",
    "author": "Tim Korso",
    "title": "US Republicans Call for Congressional Probe Into Media, Big Tech Over Silencing Hunter Laptop Story"
  },
  {
    "id": 2051,
    "mediaId": 2641,
    "date": "2022-03-20",
    "sentence": "Republican Pennsylvania Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> told The Post that \"this is just another example of the media being quick to silence anything that would shine a light on the corrupt Biden family.",
    "author": "Brian Freeman",
    "title": "Republicans Demand New Probe Into Hunter Biden Following NYT Story"
  },
  {
    "id": 1203,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "The Centers for Disease Control and Prevention \"wasn't taking advice from doctors\" during the pandemic, so it made little sense to take its advice on schools from the teachers' unions, television's Dr. <span class='selected-term'>Mehmet Oz</span>, a GOP candidate for the U.S. Senate in Pennsylvania, said Thursday on Newsmax.",
    "author": "Sandy Fitzgerald",
    "title": "Dr. Oz to Newsmax: CDC Took School Advice From Unions, Not Doctors"
  },
  {
    "id": 1170,
    "mediaId": 2740,
    "date": "2022-03-31",
    "sentence": "Oz is out: Dr. <span class='selected-term'>Mehmet Oz</span>, a U.S. Senate candidate and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: POTUS seeks to lower gas prices by ordering oil from reserves"
  },
  {
    "id": 576,
    "mediaId": 6746,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Madz Dizon",
    "title": "Hunter Biden's Wealth: How Rich Is the President's Son After Business Dealings Unearthed?"
  }
]