[
  {
    "id": 6826,
    "mediaId": 2716,
    "date": "2022-01-24",
    "sentence": "According to Politico, \"<span class='selected-term'>Mehmet Oz</span>, the celebrity doctor and television host who launched his campaign Nov. 30, has spent $5.4 million on advertisements in less than two months,\" while former hedge fund CEO David McCormick, \"has dropped $3.7 million on ads.\"",
    "author": "Grayson Quay",
    "title": "Millionaire candidates make massive ad buys in Pennsylvania's GOP Senate primary"
  },
  {
    "id": 6694,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "In the Republican field, TV personality Dr. <span class='selected-term'>Mehmet Oz</span> has raised $5.7 million, having donated more than $5 million of his own money to his campaign.",
    "author": "Dave Boyer",
    "title": "Pa. Democrats had vote-counting snag in attempt to endorse Senate candidate"
  },
  {
    "id": 5935,
    "mediaId": 2637,
    "date": "2022-02-05",
    "sentence": "Among the Republicans vying to replace Senator Pat Toomey, who is retiring, are several with ties to the former president: Carla Sands, his former ambassador to Denmark; his friend the celebrity doctor <span class='selected-term'>Mehmet Oz</span>; and hedge fund CEO David McCormick, whose wife served in the Trump administration.",
    "author": "Jarrett Renshaw",
    "title": "With Trump silent, Pennsylvania Republicans decide against endorsing in Senate race"
  },
  {
    "id": 4662,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "TV personality Dr. <span class='selected-term'>Mehmet Oz</span> leads the field for the Republican nomination for Pennsylvania’s U.S. Senate seat, but a large swath of GOP voters is undecided, according to a poll released Monday.",
    "author": "Dave Boyer",
    "title": "Pa. poll finds Dr. Oz leading with GOP voters, but many still undecided in Senate race"
  },
  {
    "id": 4878,
    "mediaId": 2822,
    "date": "2022-02-17",
    "sentence": "",
    "author": "STEVE PEOPLES",
    "title": "'The brand is so toxic': Democrats fear extinction in rural America"
  },
  {
    "id": 4052,
    "mediaId": 2679,
    "date": "2022-03-07",
    "sentence": "Republicans have a wide-open field, featuring three wealthy and well-connected transplants from out of state — including <span class='selected-term'>Mehmet Oz</span>, host of daytime TV’s “The Dr. Oz Show” — who are spending millions of dollars on TV ads.",
    "author": "MARC LEVY",
    "title": "‘We want to win’: Democrats face choice in key Senate race"
  },
  {
    "id": 3128,
    "mediaId": 2732,
    "date": "2022-03-07",
    "sentence": "Republicans have a wide-open field, including three wealthy and well-connected transplants from out of state — including <span class='selected-term'>Mehmet Oz</span>, host of daytime TV’s “The Dr. Oz Show” — who are spending millions of dollars on TV ads.",
    "author": "Associated Press",
    "title": "'We want to win': Democrats face choice in key Senate race in Pennsylvania"
  },
  {
    "id": 3184,
    "mediaId": 2679,
    "date": "2022-03-15",
    "sentence": "Parnell’s exit threw open the doors to McCormick and <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show,” and accelerated spending in what could be this year’s most expensive Senate race.",
    "author": "MARC LEVY",
    "title": "Ex-hedge fund CEO aims to be hometown boy in key Senate race"
  },
  {
    "id": 2059,
    "mediaId": 2732,
    "date": "2022-03-20",
    "sentence": "He called out Republican Senate candidate <span class='selected-term'>Mehmet Oz</span>, former host of the “Dr.",
    "author": "Ryan Deto",
    "title": "Democratic Senate candidates square off in political forum at CMU"
  },
  {
    "id": 1849,
    "mediaId": 2658,
    "date": "2022-03-21",
    "sentence": "It found Fetterman initially leading celebrity doctor <span class='selected-term'>Mehmet Oz</span> by 9 percentage points, while Lamb was ahead by 3.",
    "author": "",
    "title": "Super PAC signals Pennsylvania primary could get rough"
  },
  {
    "id": 2425,
    "mediaId": 2659,
    "date": "2022-03-22",
    "sentence": "While delivering a private speech as part of his “American Freedom” tour in Florida this weekend, Trump asked the crowd what they thought about GOP candidate <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Jason Easley",
    "title": "Trump Is Hinting At Meddling And Handing The Pennsylvania Senate Seat To Democrats By Supporting Dr. Oz"
  },
  {
    "id": 2209,
    "mediaId": 2699,
    "date": "2022-03-23",
    "sentence": "To make matters worse, a poll recently commissioned by Lamb’s own super PAC showed his main Democratic opponent—John Fetterman—not just beating him in a primary where the more liberal candidate often has more traction; polling showed Fetterman as the better candidate in a general election, against potential GOP nominees like Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Ursula Perano",
    "title": "Will Fetterman Silence Lamb in Pennsylvania Senate Face-Off?"
  },
  {
    "id": 2207,
    "mediaId": 2636,
    "date": "2022-03-23",
    "sentence": "On the Republican side, Dr. <span class='selected-term'>Mehmet Oz</span>, who became famous as a health guru on Oprah Winfrey’s show, is running against about a trillion other hopefuls.",
    "author": "",
    "title": "‘You Don’t Know Squat!’ and Other Signs of Our High-Minded Politics"
  },
  {
    "id": 1992,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "\"To make matters worse, a poll recently commissioned by Lamb’s own super PAC showed his main Democratic opponent — John Fetterman — not just beating him in a primary where the more liberal candidate often has more traction; polling showed Fetterman as the better candidate in a general election, against potential GOP nominees like Dr. <span class='selected-term'>Mehmet Oz</span>.\"",
    "author": "Matthew Chapman",
    "title": "Biden-snubbed Conor Lamb says 'the race is wide open' for Pennsylvania Senate — but is that what the numbers say?"
  },
  {
    "id": 1833,
    "mediaId": 2746,
    "date": "2022-04-04",
    "sentence": "The crowded Republican primary includes former hedge fund executive David McCormick and television personality Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Dave Boyer",
    "title": "Front-runner John Fetterman skips Pennsylvania Senate debate while rivals attack"
  },
  {
    "id": 1025,
    "mediaId": 2592,
    "date": "2022-04-09",
    "sentence": "Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican in a closely watched U.S. Senate contest in Pennsylvania.",
    "author": "Moira Warburton and Jan Wolfe",
    "title": "Trump Endorses Celebrity Surgeon Dr. Oz For U.S. Senate Seat In Pennsylvania"
  },
  {
    "id": 872,
    "mediaId": 2937,
    "date": "2022-04-09",
    "sentence": "Article content\nWASHINGTON — Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican in a closely watched U.S. Senate contest in Pennsylvania.",
    "author": "",
    "title": "Trump endorses Dr. Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 474,
    "mediaId": 2637,
    "date": "2022-04-09",
    "sentence": "Article content\nWASHINGTON — Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican in a closely watched U.S. Senate contest in Pennsylvania.",
    "author": "",
    "title": "Trump endorses celebrity surgeon Dr. Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 514,
    "mediaId": 2540,
    "date": "2022-04-11",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" Trump said in a statement announcing the endorsement.",
    "author": "Chris Cillizza",
    "title": "The ridiculous price tag for a Senate race"
  },
  {
    "id": 804,
    "mediaId": 5308,
    "date": "2022-04-11",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nTrump’s endorsement touted Oz’s books and television show, and said that “women, in particular, are drawn to Dr. Oz for his advice and counsel”—portraying this quality as one that would help Oz win the election.",
    "author": "Paul Blest",
    "title": "Trump Endorsed Dr. Oz and Republicans Are Pissed"
  },
  {
    "id": 783,
    "mediaId": 5153,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Dave Goldiner",
    "title": "Dr. Oz boasts Trump endorsement but rivals slam record on abortion, guns and trans rights"
  },
  {
    "id": 721,
    "mediaId": 2659,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Jason Easley",
    "title": "John Fetterman’s Support Grows 13 Points In A Month In PA Senate Primary"
  },
  {
    "id": 484,
    "mediaId": 2752,
    "date": "2022-04-18",
    "sentence": "The Republican primary is a tighter race with Dr. <span class='selected-term'>Mehmet Oz</span> and David McCormick more or less tied, although Oz has more support among the “Trump faction of the party,” which is all that’s left of the GOP.",
    "author": "Stephen Robinson",
    "title": "PA Senate Candidate John Fetterman Leading Race To Convince Voters He’s Better Than Dr. Oz"
  },
  {
    "id": 569,
    "mediaId": 2730,
    "date": "2022-04-22",
    "sentence": "On the GOP side, Dr. <span class='selected-term'>Mehmet Oz</span> is leading in the polls.",
    "author": "Matt Vespa",
    "title": "Democrats Appear to Be Testing Progressive Populism In PA Senate Race"
  }
]