[
  {
    "id": 6832,
    "mediaId": 2784,
    "date": "2022-01-28",
    "sentence": "Television personality and Republican candidate Dr. <span class='selected-term'>Mehmet Oz</span> spoke at Grove City College Wednesday about his run for United States Senate in Pennsylvania.",
    "author": "",
    "title": "Dr. Oz Avoids Question on Abortion to Hide How He Supports Some Abortions"
  },
  {
    "id": 4597,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "The complete poll results:\n<span class='selected-term'>Mehmet Oz</span>: 27.4%\nDavid McCormick: 15.9%\nCarla Sands: 14.8%\nKathy Barnette: 8.9%\nJeff Bartos: 6.6%\nSean Gale: 1.9%\nGeorge Bochetto: 1.6%\nEverett Stern: 1.5%\nThere were still 21.6% of likely GOP Senate primary voters undecided.",
    "author": "Eric Mack",
    "title": "Trafalgar Poll: Dr. Oz Takes Big Lead in Pa. Race"
  },
  {
    "id": 4567,
    "mediaId": 2594,
    "date": "2022-02-22",
    "sentence": "Monday's debate did not include high profile candidates such as the celebrity doctor <span class='selected-term'>Mehmet Oz</span> and former George W Bush official David McCormick, both of whom took flak for skipping the event.",
    "author": "Io Dodds",
    "title": "Republican candidate denounces Michael Flynn as a ‘traitor’ during bad-tempered GOP debate"
  },
  {
    "id": 5356,
    "mediaId": 6526,
    "date": "2022-02-23",
    "sentence": "",
    "author": "Paul Muschick",
    "title": "Dr. Oz, other carpetbaggers insulted Pennsylvania voters by skipping Senate debate"
  },
  {
    "id": 3863,
    "mediaId": 2594,
    "date": "2022-02-28",
    "sentence": "Dr <span class='selected-term'>Mehmet Oz</span>, who is running for one of Pennsylvania’s two senate seats, is being mocked online for his second attempt at challenging Dr Anthony Fauci to debate him, despite the fact that the leading expert in infectious diseases is not opposing him.",
    "author": "Oliver O'Connell",
    "title": "Dr Oz ridiculed for complaining Fauci won’t debate him"
  },
  {
    "id": 1045,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "Businessman David McCormick and celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span> are neck-and-neck in the Republican primary race for U.S. Senate in Pennsylvania, according to a poll released Thursday.",
    "author": "Ashley Oliver",
    "title": "Poll: McCormick and Oz in Dead Heat in Pennsylvania Senate Primary"
  },
  {
    "id": 881,
    "mediaId": 2668,
    "date": "2022-04-10",
    "sentence": "A new WHTM/Emerson College Polling/The Hill Pennsylvania primary poll shows David McCormick and <span class='selected-term'>Mehmet Oz</span> continuing to lead in the Republican race for one of Pennsylvania’s U.S. Senate seats.",
    "author": "Duke",
    "title": "Did Donald Trump Just Burn Some Bridges With His Base Over the Dr. Oz Endorsement?"
  },
  {
    "id": 363,
    "mediaId": 2589,
    "date": "2022-04-10",
    "sentence": "When undecided voters were asked they are leaning towards at this time, McCormick’s lead increased to 27.2%, followed by <span class='selected-term'>Mehmet Oz</span> with almost 20.6%.",
    "author": "Karen Townsend",
    "title": "Why did Trump endorse Dr. Oz? One person's support may hold the answer"
  },
  {
    "id": 783,
    "mediaId": 5153,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Dave Goldiner",
    "title": "Dr. Oz boasts Trump endorsement but rivals slam record on abortion, guns and trans rights"
  },
  {
    "id": 118,
    "mediaId": 2641,
    "date": "2022-04-19",
    "sentence": "One week after Donald Trump endorsed celebrity Dr. <span class='selected-term'>Mehmet Oz</span> for the Senate in Pennsylvania, and one month before the primary, a just-completed poll shows a wide open Republican primary.",
    "author": "John Gizzi",
    "title": "Trafalgar Poll: Pennsylvania GOP Senate Primary Wide Open"
  }
]