[
  {
    "id": 503,
    "mediaId": 2721,
    "date": "2022-04-11",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” he added.",
    "author": "",
    "title": "Trump splits conservatives by endorsing Dr. Oz"
  },
  {
    "id": 604,
    "mediaId": 2718,
    "date": "2022-04-13",
    "sentence": "That might not put Ingraham in rare company, but it is unusual for Fox News hosts to turn on their own — and that’s exactly what “The Ingraham Angle” host did Tuesday night, calling out Hannity and Trump for their endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> as the Republican candidate for Senate in Pennsylvania.",
    "author": "Josh Dickey",
    "title": "Laura Ingraham Turns on Hannity and Trump for Dr. Oz Endorsement: ‘I’m Not Afraid to Say It’"
  },
  {
    "id": 76,
    "mediaId": 2557,
    "date": "2022-04-14",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nFox News host Laura Ingraham called former President Donald Trump and her colleague Sean Hannity’s endorsement of Republican Pennsylvania Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> a “mistake” Tuesday.",
    "author": "DML News App",
    "title": "VIDEO: Laura Ingraham Goes Against Trump And Hannity, Calls Their Latest Move A ‘Mistake’"
  },
  {
    "id": 903,
    "mediaId": 2688,
    "date": "2022-04-14",
    "sentence": "Burned by the backlash that ensued upon former President Trump’s endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the hotly contested Pennsylvania Senate GOP primary, Trumpworld figures are rushing to contain the fallout that has MAGAland in a frenzy.",
    "author": "Matt Shuham",
    "title": "Trumpworld Attempts Damage Control After Oz Endorsement Angers MAGA Crowd"
  },
  {
    "id": 161,
    "mediaId": 2550,
    "date": "2022-04-15",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>\nThe last time we checked in on Donald Trump's endorsement of celebrity healther Dr. Mehmet Oz for Pennsylvania's open Senate seat, right-wingers from Roger Stone to former OANN anchors were blasting the move.",
    "author": "",
    "title": "Strike two: Trump's Oz endorsement quickly turning into his second disaster in Pennsylvania"
  }
]