[
  {
    "id": 6071,
    "mediaId": 2634,
    "date": "2022-02-02",
    "sentence": "He’s running against former television host Dr. <span class='selected-term'>Mehmet Oz</span>, former Republican nominee for lieutenant governor Jeff Bartos, and former Trump administration Ambassador Carla Sands (who saw a major staff exodus among lackluster fundraising numbers).",
    "author": "Daniel Strauss",
    "title": "Democrats Can Win the Pennsylvania Senate Seat—if They Don’t Slaughter One Another First"
  },
  {
    "id": 4672,
    "mediaId": 2643,
    "date": "2022-02-17",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> currently has the greatest name recognition in the race for an open Senate seat in Pennsylvania, but some of Hollywood's biggest stars are lining up behind Democratic candidate Malcolm Kenyatta.",
    "author": "Jon Jackson",
    "title": "Halle Berry, Amy Schumer Among Stars Backing Dr. Oz's Opponent for Senate"
  },
  {
    "id": 3184,
    "mediaId": 2679,
    "date": "2022-03-15",
    "sentence": "Parnell’s exit threw open the doors to McCormick and <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show,” and accelerated spending in what could be this year’s most expensive Senate race.",
    "author": "MARC LEVY",
    "title": "Ex-hedge fund CEO aims to be hometown boy in key Senate race"
  },
  {
    "id": 2059,
    "mediaId": 2732,
    "date": "2022-03-20",
    "sentence": "He called out Republican Senate candidate <span class='selected-term'>Mehmet Oz</span>, former host of the “Dr.",
    "author": "Ryan Deto",
    "title": "Democratic Senate candidates square off in political forum at CMU"
  },
  {
    "id": 1849,
    "mediaId": 2658,
    "date": "2022-03-21",
    "sentence": "It found Fetterman initially leading celebrity doctor <span class='selected-term'>Mehmet Oz</span> by 9 percentage points, while Lamb was ahead by 3.",
    "author": "",
    "title": "Super PAC signals Pennsylvania primary could get rough"
  },
  {
    "id": 1833,
    "mediaId": 2746,
    "date": "2022-04-04",
    "sentence": "The crowded Republican primary includes former hedge fund executive David McCormick and television personality Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Dave Boyer",
    "title": "Front-runner John Fetterman skips Pennsylvania Senate debate while rivals attack"
  },
  {
    "id": 484,
    "mediaId": 2752,
    "date": "2022-04-18",
    "sentence": "The Republican primary is a tighter race with Dr. <span class='selected-term'>Mehmet Oz</span> and David McCormick more or less tied, although Oz has more support among the “Trump faction of the party,” which is all that’s left of the GOP.",
    "author": "Stephen Robinson",
    "title": "PA Senate Candidate John Fetterman Leading Race To Convince Voters He’s Better Than Dr. Oz"
  }
]