[
  {
    "id": 1957,
    "mediaId": 2570,
    "date": "2022-03-22",
    "sentence": "Also in attendance was <span class='selected-term'>Mehmet Oz</span>, the TV personality running for Senate in Pennsylvania.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: Ginni Thomas’ Campaign Contributions, Lawmakers’ Mar-A-Lago Visits"
  },
  {
    "id": 1155,
    "mediaId": 2745,
    "date": "2022-04-07",
    "sentence": "Trump asked Josh whether he should endorse David McCormick — whom he met with later on Wednesday at Mar-a-Lago — or <span class='selected-term'>Mehmet Oz</span> in the Republican primary to replacing retiring Sen. Pat Toomey (R-Pa.).",
    "author": "",
    "title": "The Post's interview with Donald Trump"
  },
  {
    "id": 1408,
    "mediaId": 2658,
    "date": "2022-04-07",
    "sentence": "Trump said he’d make a decision in “about a week” between endorsing McCormick or <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Trump says Secret Service blocked him from joining Jan. 6 march to the Capitol"
  },
  {
    "id": 615,
    "mediaId": 2551,
    "date": "2022-04-09",
    "sentence": "Former President Donald Trump on Saturday evening announced he was endorsing TV surgeon Dr. <span class='selected-term'>Mehmet Oz</span> in the bitter contest to become the Republican nominee for a U.S. Senate seat in Pennsylvania.",
    "author": "",
    "title": "Trump delivers prized endorsement to 'brilliant' Dr Oz in Pennsylvania Senate race - even though the TV surgeon once told the former president to lose weight"
  },
  {
    "id": 880,
    "mediaId": 2631,
    "date": "2022-04-12",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump said in his statement.",
    "author": "",
    "title": "‘Dr. Oz’ bets Trump endorsement can catapult him in Pa. Senate race"
  }
]