[
  {
    "id": 6495,
    "mediaId": 2590,
    "date": "2022-01-05",
    "sentence": "Now, America has to take Dr. <span class='selected-term'>Mehmet Oz</span> seriously as he runs for Senate in Pennsylvania in an already tightly contested race to replace Sen. Pat Toomey, a Republican who is retiring from office.",
    "author": "",
    "title": "How Many Celebrity Politicians Have To Ruin America Before Americans Stop Electing Them?"
  },
  {
    "id": 6387,
    "mediaId": 2658,
    "date": "2022-01-11",
    "sentence": "Several other Washington officials have made financial pledges or shared internal polling to try to convince Hogan that he has a path to victory.”\nOZ’S TURKISH CITIZENSHIP — As celebrity doc <span class='selected-term'>MEHMET OZ</span> runs for Senate, he’s indicating he has no intention of renouncing his Turkish citizenship — and is being challenged repeatedly on the campaign trail to answer why.",
    "author": "",
    "title": "POLITICO Playbook: Biden gets a rude welcome to Georgia"
  },
  {
    "id": 6452,
    "mediaId": 2590,
    "date": "2022-01-12",
    "sentence": "TV doctor-turned-politician <span class='selected-term'>Mehmet Oz</span> has apparently retired from clinical practice and his faculty role at Columbia University since announcing his Senate run in Pennsylvania.",
    "author": "Liz Skalka",
    "title": "Columbia University Quietly Changes Mehmet Oz's Position Amid Senate Run"
  },
  {
    "id": 6978,
    "mediaId": 2636,
    "date": "2022-01-13",
    "sentence": "Whatever might come, this would not be a tenure of earth tones and lethargy and saturnine expressions.” (Debbie Deitcher, Manhattan)\nTaking the measure of <span class='selected-term'>Mehmet Oz</span>, Annaliese Griffin wrote: “He’s rightly understood as a kind of quasi-religious leader, one who has set up his revival tent between a yoga studio and an urgent-care clinic, with the television cameras rolling.” (Scott Williams, Salt Lake City)\nFinally, here’s Charles Blow on his dinner with Sidney Poitier: “His enchantment settled on you, like a soft sweater.",
    "author": "",
    "title": "Trump’s Pride Goeth Before Our Fall"
  },
  {
    "id": 6497,
    "mediaId": 2590,
    "date": "2022-01-13",
    "sentence": "A political action committee supporting another Republican in the race, TV host <span class='selected-term'>Mehmet Oz</span>, launched an ad attacking McCormick’s ties to China, where Bridgewater Associates manages $5 billon of its $150 billion portfolio.",
    "author": "Liz Skalka",
    "title": "Hedge Fund Exec David McCormick Latest To Enter Pennsylvania Senate Race"
  },
  {
    "id": 6379,
    "mediaId": 2658,
    "date": "2022-01-15",
    "sentence": "Philly Inquirer’s Jonathan Tamari breaks down the numbers: <span class='selected-term'>MEHMET OZ</span> has “booked nearly $5 million of ad time” since Nov. 30, DAVID MCCORMICK has spent $3 million on ads since late December, CARLA SANDS has dropped around $2 million since October and a PAC backing JEFF BARTOS has a $2 million ad buy starting next week.",
    "author": "",
    "title": "POLITICO Playbook: Civil rights leaders fume after meeting with Sinema"
  },
  {
    "id": 6361,
    "mediaId": 2658,
    "date": "2022-01-16",
    "sentence": "The first banned “the teaching of critical race theory, an academic framework for examining racism in society that has never been part of the state’s public school curriculum.” The second was “aimed at giving parents the ability to opt out of mask mandates in schools, which Democratic former governor RALPH NORTHAM’s health commissioner had ordered statewide for public and private K-12 schools.”\nALL POLITICS\nOZ LOSES BIG IN PA GOP STRAW POLL — POLITICO national political reporter and resident Pennsylvania expert Holly Otterbein writes in:\n<span class='selected-term'>MEHMET OZ</span> didn’t get a very warm welcome from party activists in Pennsylvania on Saturday.",
    "author": "",
    "title": "POLITICO Playbook: A night at the Trump rally"
  },
  {
    "id": 7052,
    "mediaId": 2889,
    "date": "2022-01-18",
    "sentence": "As part that announcement, Mathur spoke with HealthCorps founder and Chair Emeritus Dr. <span class='selected-term'>Mehmet Oz</span> to reflect on his own personal health journey, which is one of the reasons why he was so interested in partnering with HealthCorps.",
    "author": "Us Weekly Staff",
    "title": "Limitless X Founder and CEO Jas Mathur Teams Up With HealthCorps for Partnership to Empower Youth"
  },
  {
    "id": 7130,
    "mediaId": 2663,
    "date": "2022-01-19",
    "sentence": "McCormick is currently competing against TV doctor <span class='selected-term'>Mehmet Oz</span> for the Republican nomination to U.S. Senate in Pennsylvania.",
    "author": "Graham Gremore",
    "title": "Oh god, another ex-Trump official is rumored to be eyeing a career in reality TV"
  },
  {
    "id": 6649,
    "mediaId": 6526,
    "date": "2022-01-19",
    "sentence": "TV personality <span class='selected-term'>Mehmet Oz</span>, a Republican running for an open Senate seat in Pennsylvania, did not show up as expected for the monthly meeting of the Wyoming County Republican Committee on Tuesday night.",
    "author": "Robert L. Baker",
    "title": "Mehmet Oz absent from appearance before county Republican committee in northeastern Pennsylvania"
  },
  {
    "id": 6743,
    "mediaId": 6571,
    "date": "2022-01-19",
    "sentence": "",
    "author": "",
    "title": "AAA Recommends Periodic Car-Washing To Avoid Expensive Rust Damage"
  },
  {
    "id": 6944,
    "mediaId": 6526,
    "date": "2022-01-20",
    "sentence": "In his first campaign visit to Northeast Pennsylvania, <span class='selected-term'>Mehmet Oz</span> spoke about how he feels the government has failed in its handling of COVID-19, the economy, supply chain disruptions and border protection.",
    "author": "Robert Tomkavage",
    "title": "Mehmet Oz visits Lackawanna County; spokesperson says absence night before was due to ‘miscommunication’"
  },
  {
    "id": 6622,
    "mediaId": 2621,
    "date": "2022-01-21",
    "sentence": "But Sean Hannity is urging him to back celebrity doctor <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Alex Griffing",
    "title": "Trump Reportedly Weighing Double Endorsements in Tight Senate Races: ‘I Get Two Chances to Win’"
  },
  {
    "id": 6880,
    "mediaId": 2732,
    "date": "2022-01-21",
    "sentence": "The good news is the rise of self-funding candidates like Dr. <span class='selected-term'>Mehmet Oz</span>, Carla Sands and David McCormick could once again show how useless the endorsement process is — just like Tom Smith demonstrated when he easily dispatched the establishment’s golden-boy endorsed candidate, Steve Welch, in the 2012 U.S. Senate Primary.",
    "author": "Ryan Shafik",
    "title": "Ryan Shafik: Time to end corrupt endorsement process"
  },
  {
    "id": 6620,
    "mediaId": 2631,
    "date": "2022-01-22",
    "sentence": "",
    "author": "Peter Nicholas",
    "title": "Trump stays on sidelines in Pennsylvania Senate race — for now"
  },
  {
    "id": 6826,
    "mediaId": 2716,
    "date": "2022-01-24",
    "sentence": "According to Politico, \"<span class='selected-term'>Mehmet Oz</span>, the celebrity doctor and television host who launched his campaign Nov. 30, has spent $5.4 million on advertisements in less than two months,\" while former hedge fund CEO David McCormick, \"has dropped $3.7 million on ads.\"",
    "author": "Grayson Quay",
    "title": "Millionaire candidates make massive ad buys in Pennsylvania's GOP Senate primary"
  },
  {
    "id": 6600,
    "mediaId": 2730,
    "date": "2022-01-24",
    "sentence": "Self-funders like Dr. <span class='selected-term'>Mehmet Oz</span> and David McCormick have the cash, but are missing out when it comes to straw polls.",
    "author": "Rebecca Downs",
    "title": "Well Funded, Out of State Candidates Fall Flat with Grassroots Republicans in Pennsylvania"
  },
  {
    "id": 6824,
    "mediaId": 2602,
    "date": "2022-01-24",
    "sentence": "My friend of many years and former colleague from Oprah’s broadcasting days is physician and TV host Dr. <span class='selected-term'>Mehmet Oz</span>, who has attended nearly every one of our galas from the first gala, where he was honored 10 years ago.",
    "author": "SHMULEY BOTEACH",
    "title": "Carnegie Hall event champions the lessons of the Holocaust - opinion"
  },
  {
    "id": 6572,
    "mediaId": 2594,
    "date": "2022-01-25",
    "sentence": "Three, he is relatively unknown to voters, especially considering that his primary rivals include Jeff Bartos, the GOP's endorsed candidate for lieutenant governor in 2018, and <span class='selected-term'>Mehmet Oz</span>, the heart surgeon, wellness author and TV personality who carries unrivaled name recognition as the host of daytime TV’s “Dr.",
    "author": "Via AP news wire",
    "title": "No Trump endorsement? Senate hopeful enlists other GOP stars"
  },
  {
    "id": 6676,
    "mediaId": 2679,
    "date": "2022-01-25",
    "sentence": "Three, he is relatively unknown to voters, especially considering that his primary rivals include Jeff Bartos, the GOP’s endorsed candidate for lieutenant governor in 2018, and <span class='selected-term'>Mehmet Oz</span>, the heart surgeon, wellness author and TV personality who carries unrivaled name recognition as the host of daytime TV’s “Dr.",
    "author": "MARC LEVY",
    "title": "No Trump endorsement? Senate hopeful enlists other GOP stars"
  },
  {
    "id": 6936,
    "mediaId": 2732,
    "date": "2022-01-26",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> enthralled a room full of potential Westmoreland County voters Wednesday as he works to make his mark in a crowded field of candidates vying to represent Pennsylvania in the U.S. Senate.",
    "author": "Megan Tomasic",
    "title": "Dr. Mehmet Oz stumps in Westmoreland County in quest for U.S. Senate"
  },
  {
    "id": 6836,
    "mediaId": 2643,
    "date": "2022-01-26",
    "sentence": "\"Dr. <span class='selected-term'>Mehmet Oz</span> has been advertising heavily—I saw at least two ads during the Eagles game a little more than a week ago—and that's reflected in sizable support in some surveys,\" Hopkins said.",
    "author": "Jon Jackson",
    "title": "Despite High Profile, Dr. Oz Underperforms in GOP Straw Polls Ahead of 2022 Midterms"
  },
  {
    "id": 6780,
    "mediaId": 6598,
    "date": "2022-01-27",
    "sentence": "Added <span class='selected-term'>Mehmet Oz</span>, the Republican Senate hopeful in Pennsylvania: \"Based on the policies of division and control that have marked Joe Biden's first year in office, and the names being floated, I'm worried he will put forth someone who will legislate from the bench with radical ideas.\"",
    "author": "Manu Raju and Lauren Fox",
    "title": "Senate GOP sets high bar to support Biden's Supreme Court pick"
  },
  {
    "id": 6832,
    "mediaId": 2784,
    "date": "2022-01-28",
    "sentence": "Television personality and Republican candidate Dr. <span class='selected-term'>Mehmet Oz</span> spoke at Grove City College Wednesday about his run for United States Senate in Pennsylvania.",
    "author": "",
    "title": "Dr. Oz Avoids Question on Abortion to Hide How He Supports Some Abortions"
  },
  {
    "id": 7213,
    "mediaId": 2934,
    "date": "2022-01-28",
    "sentence": "But Dr. <span class='selected-term'>Mehmet Oz</span>, who has criticized Fauci’s public guidance during the pandemic and called for him to resign, falsely claimed that “Fauci’s never taken care of patients,” while suggesting that Fauci does not approach COVID-19 from the perspective of “patient care.”\n\n“Of course, try to prevent illness but have a strategy, a backup plan,” Oz said in a Jan. 24 Fox News interview, as he discussed what he perceived as a lack of emphasis on using therapeutics to treat COVID-19.",
    "author": "Brea Jones",
    "title": "Dr. Fauci Still Treats Patients, Contrary to Dr. Oz’s Claim"
  },
  {
    "id": 6518,
    "mediaId": 2679,
    "date": "2022-01-28",
    "sentence": "After all, the teapotlike vessel was popularized in the United States by celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who called it a “nose bidet” on “The Oprah Winfrey Show” and has been criticized for promoting unproven supplements and health products.",
    "author": "Alice Callahan",
    "title": "Do neti pots really work?"
  },
  {
    "id": 6418,
    "mediaId": 2590,
    "date": "2022-01-29",
    "sentence": "Stephen Colbert mocked Republican <span class='selected-term'>Mehmet Oz</span>’s run for senator of Pennsylvania, given the celebrity physician’s “tenuous” links to the state and his reported underperforming in straw polls on the race.",
    "author": "Lee Moran",
    "title": "Stephen Colbert Tells Mehmet Oz Exactly Where To Stick His Senate Campaign"
  },
  {
    "id": 6548,
    "mediaId": 2718,
    "date": "2022-01-29",
    "sentence": "Stephen Colbert offered a “miracle” cure to Dr. <span class='selected-term'>Mehmet Oz</span> for his not-so-great Pennsylvania Senate-run poll numbers: a supplement that “makes you more likable and electable while reducing belly fat.”\n“Why is Dr. Oz losing so badly?” Colbert, asked Friday night in his “The Late Show” monologue.",
    "author": "Harper Lambert",
    "title": "Stephen Colbert Has a ‘Miracle’ Cure for Dr. Oz’s Shaky Senate Campaign That’s Rather Tough to Swallow (Video)"
  },
  {
    "id": 6901,
    "mediaId": 2732,
    "date": "2022-01-29",
    "sentence": "When Dr. <span class='selected-term'>Mehmet Oz</span>, who is seeking the Republican nomination in the U.S. Senate race, made a campaign appearance in Westmoreland County last week, it had all the excitement of a celebrity event, with Oz supporters jockeying for selfies with the star-politician.",
    "author": "Joseph Sabino Mistick",
    "title": "Joseph Sabino Mistick: Oz is fun, but the Republic must come first"
  },
  {
    "id": 6532,
    "mediaId": 2641,
    "date": "2022-01-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, who is running for a U.S. Senate seat as a Republican in Pennsylvania, on Saturday rushed to the aid of a man who fell unconscious during a caucus meeting.",
    "author": "Nick Koutsobinas",
    "title": "Dr. Oz Aids Unconscious Man at Pa. Caucus Meeting"
  },
  {
    "id": 6636,
    "mediaId": 2551,
    "date": "2022-01-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, who's looking to trade in his gig as a TV doctor for a seat in the U.S. Senate, put his medical skills to use during an emergency situation at a political meeting on Saturday morning.",
    "author": "Kevin Kayhart For Dailymail.com",
    "title": "Dr. Oz jumps into action to help man who collapsed at a caucus meeting... as he continues his run for U.S Senate seat in Pennsylvania"
  },
  {
    "id": 6356,
    "mediaId": 2572,
    "date": "2022-01-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> aided a man who called out for a doctor and then collapsed at a Pennsylvania Republican event this weekend.",
    "author": "",
    "title": "Dr. Oz rushes to help unconscious man at Pennsylvania GOP event: 'It's my calling'"
  },
  {
    "id": 6635,
    "mediaId": 2557,
    "date": "2022-01-30",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Fox News:\nDr. <span class='selected-term'>Mehmet Oz</span> aided a man who called out for a doctor and then collapsed at a Pennsylvania Republican event this weekend.",
    "author": "DML News App",
    "title": "REPORT: Dr. Oz rushes to help unconscious man at Pennsylvania GOP event"
  },
  {
    "id": 7216,
    "mediaId": 2543,
    "date": "2022-01-31",
    "sentence": "Dr. Oz, whose real name is <span class='selected-term'>Mehmet Oz</span>, is trying to make the leap from television personality to the Senate, and is crisscrossing Pennsylvania to seek Republican support.",
    "author": "Jack Davis, Michael Austin, Elizabeth Stauffer, Contributor, Jack Davis Is A Freelance Writer Who Joined The Western Journal In July, Chronicled The Campaign That Saw President Donald Trump Elected. Since Then, He Has Written Extensively For The Western Journal On The Trump Administration As Well As Foreign Policy, Military Issues., New York City, Languages Spoken",
    "title": "GOP Upstart 'Doctor Oz' Springs Into Action When Man Collapses Right in Front of Him"
  },
  {
    "id": 7217,
    "mediaId": 2720,
    "date": "2022-01-31",
    "sentence": "Dr. Oz, whose real name is <span class='selected-term'>Mehmet Oz</span>, is trying to make the leap from television personality to the Senate, and is crisscrossing Pennsylvania to seek Republican support.",
    "author": "Jack Davis, The Western Journal, C. Douglas Golden, Abliebing, Grant Atkinson, Elizabeth Stauffer, Randy Desoto, Warner Todd Huston",
    "title": "'I'm a Doctor First': GOP Upstart 'Dr. Oz' Springs Into Action When Man Collapses Before His Speech"
  },
  {
    "id": 7153,
    "mediaId": 2753,
    "date": "2022-01-31",
    "sentence": "Dr. Oz, whose real name is <span class='selected-term'>Mehmet Oz</span>, is trying to make the leap from television personality to the Senate, and is crisscrossing Pennsylvania to seek Republican support.",
    "author": "Jack Davis",
    "title": "'I'm a doctor first': GOP upstart 'Dr. Oz' springs into action when man collapses before his speech"
  },
  {
    "id": 6535,
    "mediaId": 2731,
    "date": "2022-01-31",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> is a charismatic surgeon who learned his craft in an exotic land.",
    "author": "Jared Whitley",
    "title": "Who Is Bill Maher In The Anti-Woke Avengers?"
  },
  {
    "id": 7218,
    "mediaId": 2575,
    "date": "2022-02-01",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> is a charismatic surgeon who learned his craft in an exotic land.",
    "author": "",
    "title": "Who Is Bill Maher In The Anti-Woke Avengers?"
  },
  {
    "id": 6694,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "In the Republican field, TV personality Dr. <span class='selected-term'>Mehmet Oz</span> has raised $5.7 million, having donated more than $5 million of his own money to his campaign.",
    "author": "Dave Boyer",
    "title": "Pa. Democrats had vote-counting snag in attempt to endorse Senate candidate"
  },
  {
    "id": 6563,
    "mediaId": 2732,
    "date": "2022-02-01",
    "sentence": "Filings posted online by the Federal Election Commission before Monday night’s deadline showed <span class='selected-term'>Mehmet Oz</span> — best-known as daytime TV’s host of “The Dr. Oz Show” — loaned himself $5.2 million.",
    "author": "Associated Press",
    "title": "Millions follow rich candidates in Pennsylvania Senate race"
  },
  {
    "id": 6688,
    "mediaId": 2718,
    "date": "2022-02-01",
    "sentence": "Oz” spinoff, hosted by <span class='selected-term'>Mehmet Oz</span>’s daughter Daphne Oz, debuted to a 0.4 rating.",
    "author": "Tony Maglio",
    "title": "‘Dr. Oz’ Spinoff’s Debut Ratings Down One Third From Final Week of ‘Dr. Oz’"
  },
  {
    "id": 6932,
    "mediaId": 2630,
    "date": "2022-02-01",
    "sentence": "In particular, Dr. <span class='selected-term'>Mehmet Oz</span>, a Pennsylvania Senate candidate, has made Covid a central theme of his campaign, running two ads that criticize the federal government’s response.",
    "author": "",
    "title": "The GOP’s midterm playbook: Flip the script on Covid"
  },
  {
    "id": 6562,
    "mediaId": 2594,
    "date": "2022-02-01",
    "sentence": "Cash is pouring into Pennsylvania s hotly contested race for U.S. Senate as wealthy and well-connected candidates move in from out of state, followed by millions of dollars going into TV ads and super PACs\nFilings posted online by the Federal Election Commission before Monday night's deadline showed <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV's host of “The Dr. Oz Show” — loaned himself $5.2 million.",
    "author": "Via AP news wire",
    "title": "Millions follow rich candidates in Pennsylvania Senate race"
  },
  {
    "id": 5657,
    "mediaId": 2732,
    "date": "2022-02-02",
    "sentence": "",
    "author": "",
    "title": "Letter to the editor: Words give wrong impression of Dr. Oz event"
  },
  {
    "id": 5782,
    "mediaId": 2570,
    "date": "2022-02-02",
    "sentence": "Who is funding the likely-to-fail campaign of <span class='selected-term'>Mehmet Oz</span>, the celebrity known as Dr. Oz, who promoted unproven medical claims during the pandemic and is now trying to become a U.S. senator from Pennsylvania?",
    "author": "Michela Tindera",
    "title": "Billionaires And Big-Money Families Are Bankrolling Dr. Oz’ Senate Run"
  },
  {
    "id": 6071,
    "mediaId": 2634,
    "date": "2022-02-02",
    "sentence": "He’s running against former television host Dr. <span class='selected-term'>Mehmet Oz</span>, former Republican nominee for lieutenant governor Jeff Bartos, and former Trump administration Ambassador Carla Sands (who saw a major staff exodus among lackluster fundraising numbers).",
    "author": "Daniel Strauss",
    "title": "Democrats Can Win the Pennsylvania Senate Seat—if They Don’t Slaughter One Another First"
  },
  {
    "id": 6094,
    "mediaId": 6571,
    "date": "2022-02-02",
    "sentence": "Filings posted online by the Federal Election Commission before Monday night's deadline showed <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV's host of \"The Dr. Oz Show\" — loaned himself $5.2 million.",
    "author": "",
    "title": "Millions Of Dollars Flowing Into Pennsylvania's Hotly-Contested U.S. Senate Race"
  },
  {
    "id": 5508,
    "mediaId": 2641,
    "date": "2022-02-03",
    "sentence": "Hailing his name recognition, media chops, and medical background to take it to the failed health advisers in Washington, D.C., Dr. <span class='selected-term'>Mehmet Oz</span> told Newsmax he is the Pennsylvania Senate GOP primary candidate who can beat the Democrat in the general election next November.",
    "author": "Eric Mack",
    "title": "Dr. Oz to Newsmax: 'Pennsylvania Deserves a Big Voice, a Strong Voice'"
  },
  {
    "id": 5695,
    "mediaId": 2660,
    "date": "2022-02-03",
    "sentence": "Before you go out and buy CBD gummies that purportedly help to treat diabetes or to quit smoking, please know that these people are not endorsing or selling them: Baptist pastor Charles Stanley, TV evangelists Joel Olsteen and Pat Robertson, former Shark Tank contestants Donna and Rosy Khalife, neurosurgeon and CNN medical correspondent Dr. Sanjay Gupta, actor Kevin Costner, and celebrity surgeon and Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Ciara O'Rourke",
    "title": "No, Dr. Phil and these celebrities are not endorsing CBD gummies"
  },
  {
    "id": 5504,
    "mediaId": 2658,
    "date": "2022-02-03",
    "sentence": "“This should be a model for other U.S. companies, unlike David McCormick’s track record of exporting jobs to China and India from the dark corners of Wall Street.”\nIn reference to Oz’s connections to China, McCormick campaign spokesperson Jess Szymanski told POLITICO: “<span class='selected-term'>Mehmet Oz</span> — citizen of Turkey, creature of Hollywood — has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,” and that “while Mehmet has been silent on China until he needed to knock down Dave’s credentials, Dave was serving our country and standing up to the [Chinese Communist Party].”\nIn its 2020 annual report filed with the Securities and Exchange Commission, Usana said that China was its “largest market and single largest source of revenue,” making up around 41 percent of net sales and about 38 percent of its active customers.",
    "author": "",
    "title": "Dr. Oz is running as a China hawk. It's a bit of a stretch."
  },
  {
    "id": 5755,
    "mediaId": 2687,
    "date": "2022-02-04",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "GOP Senate Race In Pennsylvania Turns Ugly Early"
  },
  {
    "id": 5540,
    "mediaId": 2822,
    "date": "2022-02-04",
    "sentence": "",
    "author": "SAM METZ and MEAD GRUVER",
    "title": "GOP now looks to censure Cheney and Kinzinger, not oust them"
  },
  {
    "id": 5701,
    "mediaId": 2540,
    "date": "2022-02-04",
    "sentence": "\"<span class='selected-term'>Mehmet Oz</span> - citizen of Turkey, creature of Hollywood - has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,\" said Jess Szymanski, referring to the Chinese Communist Party.",
    "author": "Michael Warren",
    "title": "Pennsylvania Senate Republican race between Oz and McCormick turns ugly early"
  },
  {
    "id": 6022,
    "mediaId": 6621,
    "date": "2022-02-04",
    "sentence": "Candidate for U.S. Sentate Dr. <span class='selected-term'>Mehmet Oz</span> spoke with Brian Kilmeade about the latest study out of Johns Hopkins that showed lockdowns were an ineffective policy strategy for reducing COVID mortality rates.",
    "author": "",
    "title": "'AMERICANS SHOULD BE ANGRY': Watch Dr. Oz Blast Ineffective Lockdowns, 'It Didn't Work in 1918'"
  },
  {
    "id": 5529,
    "mediaId": 2641,
    "date": "2022-02-05",
    "sentence": "Among the Republicans vying to replace Sen. Pat Toomey, R-Pa., who is retiring, are several with ties to the former president: Carla Sands, his former ambassador to Denmark; his friend the celebrity doctor <span class='selected-term'>Mehmet Oz</span>; and hedge fund CEO David McCormick, whose wife served in the Trump administration.",
    "author": "",
    "title": "GOP Won't Endorse in Big Primary Fields for Governor, Senate"
  },
  {
    "id": 6110,
    "mediaId": 6571,
    "date": "2022-02-05",
    "sentence": "The Senate field is notable for wealthy and well-connected candidates moving from out of state to run, including <span class='selected-term'>Mehmet Oz</span>, best known as daytime TV's host of \"The Dr. Oz Show,\" and David McCormick, the just-resigned CEO of one of the world's largest hedge funds.",
    "author": "",
    "title": "Pennsylvania Republican Party Decides Against Endorsing Candidates In Senate And Governor Races"
  },
  {
    "id": 5935,
    "mediaId": 2637,
    "date": "2022-02-05",
    "sentence": "Among the Republicans vying to replace Senator Pat Toomey, who is retiring, are several with ties to the former president: Carla Sands, his former ambassador to Denmark; his friend the celebrity doctor <span class='selected-term'>Mehmet Oz</span>; and hedge fund CEO David McCormick, whose wife served in the Trump administration.",
    "author": "Jarrett Renshaw",
    "title": "With Trump silent, Pennsylvania Republicans decide against endorsing in Senate race"
  },
  {
    "id": 5482,
    "mediaId": 2658,
    "date": "2022-02-05",
    "sentence": "Bartos, who has struggled in the polls and been outspent by celebrity physician <span class='selected-term'>Mehmet Oz</span> and former hedge fund CEO David McCormick, needs to shake up the race to overcome his rivals’ financial and name ID advantages.",
    "author": "",
    "title": "Pennsylvania GOP declines to endorse in Senate race"
  },
  {
    "id": 6129,
    "mediaId": 6511,
    "date": "2022-02-06",
    "sentence": "Bartos, quien ha tenido problemas en las encuestas y fue superado por el médico <span class='selected-term'>Mehmet OZ</span> y el ex director general de fondos de cobertura David MacCormick, necesita agitar la carrera para superar las ventajas financieras y de identificación de nombre de sus rivales.",
    "author": "",
    "title": "El Partido Republicano de Pensilvania se niega a respaldar la carrera por el Senado"
  },
  {
    "id": 5982,
    "mediaId": 2641,
    "date": "2022-02-06",
    "sentence": "The COVID-19 pandemic has exposed Washington, D.C., Democrats, and President Joe Biden on every issue important to Pennsylvanians, according to GOP Senate primary candidate Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Eric Mack",
    "title": "Dr. Oz: Biden Got It Wrong on COVID, Giving 'Too Much Pajama Time'"
  },
  {
    "id": 5808,
    "mediaId": 2553,
    "date": "2022-02-06",
    "sentence": "Because of course they are.”\nDr. <span class='selected-term'>Mehmet Oz</span>, U.S. Senate candidate: “This picture encompasses everything wrong with the far left, like Stacey Abrams and the mandates harming our children.”\nBenjamin Weingarten, RealClearInvestigations: “So they have no explanation for why the indefensible masking of children persists while the non-Governor of Georgia—who is more at risk than the kids—gets to breathe freely.”\nScott Walker, former Wisconsin governor: “This will go down as one of the dumbest political moves in history.",
    "author": "Daily Wire News",
    "title": "Abrams Slammed For Being Maskless Next To Masked Children: ‘This Photo Is Catastrophic’ For Democrats"
  },
  {
    "id": 5927,
    "mediaId": 2528,
    "date": "2022-02-07",
    "sentence": "His wealth quickly emerged as an issue in the wide-open Republican primary field, which includes Carla Sands, who served as US ambassador to Denmark during the Trump administration, and <span class='selected-term'>Mehmet Oz</span>, a doctor and TV personality with Trump ties of his own.",
    "author": "C. Ryan Barber",
    "title": "Divorce documents provide a rare glimpse into the wealth of Republican Senate candidate David McCormick"
  },
  {
    "id": 5632,
    "mediaId": 2732,
    "date": "2022-02-07",
    "sentence": "Maybe this doesn’t seem like a big deal when talk show host Dr. <span class='selected-term'>Mehmet Oz</span>, a longtime New Jersey resident, is running for Pennsylvania’s U.S. Senate seat after changing his address to his in-laws’ Philly-area home, per the Philadelphia Inquirer, but it does matter.",
    "author": "",
    "title": "Editorial: Constables have to follow law to enforce it"
  },
  {
    "id": 5792,
    "mediaId": 2630,
    "date": "2022-02-09",
    "sentence": "The former hedge fund manager has praised China in the past, the Philadelphia Inquirer reports, which has already fueled attack ads from celebrity doctor <span class='selected-term'>Mehmet Oz</span> (who has his own ties to China, per Politico).",
    "author": "",
    "title": "The era of big Covid mandates is ending"
  },
  {
    "id": 5705,
    "mediaId": 2528,
    "date": "2022-02-09",
    "sentence": "Trump hasn't yet weighed in again on the Keystone State primary set for May 17, which includes a former ambassador from his administration, Carla Sands, hedge fund CEO David McCormick (who is married to former Trump aide Dina Powell), and <span class='selected-term'>Mehmet Oz</span>, the TV celebrity who also has Trump ties.",
    "author": "Warren Rojas",
    "title": "Trump is on an endorsement spree and has now put his MAGA stamp on more than 100 political candidates since leaving the White House"
  },
  {
    "id": 5559,
    "mediaId": 2641,
    "date": "2022-02-09",
    "sentence": "Senatorial candidate Dr. <span class='selected-term'>Mehmet Oz</span>, R-Pa., told Newsmax on Tuesday night that campaigning has taught him Pennsylvanians know what's needed in Washington.",
    "author": "Charlie McCarthy",
    "title": "Dr. Oz to Newsmax: I'm Listening to Pennsylvanians"
  },
  {
    "id": 5494,
    "mediaId": 2822,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Dave Goldiner",
    "title": "Marjorie Taylor Greene tries to laugh off gazpacho-Gestapo mix-up"
  },
  {
    "id": 5978,
    "mediaId": 2509,
    "date": "2022-02-11",
    "sentence": "HARRISBURG, Pa. -- <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon who recently ended his daytime TV “Dr.",
    "author": "MARC LEVY Associated Press",
    "title": "Oz gets Walk of Fame star as rival says he's too 'Hollywood'"
  },
  {
    "id": 5698,
    "mediaId": 2732,
    "date": "2022-02-11",
    "sentence": "HARRISBURG — <span class='selected-term'>Mehmet Oz</span>, the celebrity cardiologist who recently ended his daytime TV “Dr.",
    "author": "Associated Press",
    "title": "Oz gets Walk of Fame star as rival says he's too 'Hollywood'"
  },
  {
    "id": 6252,
    "mediaId": 6497,
    "date": "2022-02-11",
    "sentence": "Unlike his closest analog, would-be Senate hopeful Dr. <span class='selected-term'>Mehmet Oz</span>, McGraw knows his lane.",
    "author": "Gary Baum",
    "title": "Why ‘Dr. Phil’ Is Bulletproof Despite “Toxic Workplace” Claims"
  },
  {
    "id": 5510,
    "mediaId": 2594,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Via AP news wire",
    "title": "Oz gets Walk of Fame star as rival says he's too 'Hollywood'"
  },
  {
    "id": 5676,
    "mediaId": 6526,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Marc Levy",
    "title": "Dr. Oz gets Walk of Fame star as Pennsylvania Senate campaign rivals says he’s too ‘Hollywood’"
  },
  {
    "id": 5809,
    "mediaId": 2679,
    "date": "2022-02-11",
    "sentence": "HARRISBURG, Pa. (AP) — <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon who recently ended his daytime TV “Dr.",
    "author": "MARC LEVY",
    "title": "Oz gets Walk of Fame star as rival says he’s too ‘Hollywood’"
  },
  {
    "id": 6258,
    "mediaId": 2663,
    "date": "2022-02-11",
    "sentence": "It is becoming increasingly clear that Dr. <span class='selected-term'>Mehmet Oz</span>, who is currently running in the GOP primary for U.S. Senate in Pennsylvania, belongs in the latter category.",
    "author": "Graham Gremore",
    "title": "Dr. Oz is running a more abysmal campaign than Caitlyn Jenner did, if that’s even possible"
  },
  {
    "id": 5569,
    "mediaId": 2746,
    "date": "2022-02-11",
    "sentence": "HARRISBURG, Pa. (AP) — <span class='selected-term'>Mehmet Oz</span>, the celebrity cardiologist who recently ended his daytime TV “Dr.",
    "author": "Marc Levy",
    "title": "Oz gets Walk of Fame star as rival says he’s too ‘Hollywood’"
  },
  {
    "id": 5507,
    "mediaId": 2564,
    "date": "2022-02-11",
    "sentence": "+4\nView gallery\nThe celebrity heart surgeon, who recently ended his daytime TV show to run for office, was captured bending down and kissing the pink and gold star on the famous Los Angeles boulevard\n+4\nView gallery\nThe anti-Hollywood attack ad is being run by a group who supports hedge fund CEO David McCormick (pictured), who has former White House communications director Hope Hicks working for him\n+4\nView gallery\nDr. <span class='selected-term'>Mehmet Oz</span> stands over his new star on the Hollywood Walk of Fame at a ceremony on Friday\nThat same career, however, is being used against him by rivals who are picking apart his TV shows and his past as a self-styled wellness and anti-obesity advocate to fuel doubt about his conservative credentials as a Republican.",
    "author": "Associated Press",
    "title": "Dr Oz's rival in the Pennsylvania Senate race claims he is too 'Hollywood' as he's given a STAR on the Walk of Fame (and bent down to kiss it)"
  },
  {
    "id": 6088,
    "mediaId": 2736,
    "date": "2022-02-11",
    "sentence": "Pennsylvania Republican Dr. <span class='selected-term'>Mehmet Oz</span> took a break from his Senate campaign to travel to Hollywood and literally get down on all fours to kiss his newly awarded star on the Walk of Fame.",
    "author": "Greg P.",
    "title": "WATCH: PA Senate candidate Dr. Oz kisses his new star on the Hollywood Walk of Fame"
  },
  {
    "id": 5960,
    "mediaId": 6518,
    "date": "2022-02-11",
    "sentence": "HOLLYWOOD (CBSLA) — Medical show host Dr. <span class='selected-term'>Mehmet Oz</span> received a star on the Hollywood Walk of Fame Friday afternoon.",
    "author": "",
    "title": "Medical Show Host Dr. Oz Receives Star On Hollywood Walk Of Fame"
  },
  {
    "id": 4662,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "TV personality Dr. <span class='selected-term'>Mehmet Oz</span> leads the field for the Republican nomination for Pennsylvania’s U.S. Senate seat, but a large swath of GOP voters is undecided, according to a poll released Monday.",
    "author": "Dave Boyer",
    "title": "Pa. poll finds Dr. Oz leading with GOP voters, but many still undecided in Senate race"
  },
  {
    "id": 4901,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "Two of the leading Republican candidates in the Pennsylvania Senate race, David McCormick and <span class='selected-term'>Mehmet Oz</span>, have hit each other over a perceived lack of loyalty to former President Donald Trump, who has yet to issue an endorsement in the race.",
    "author": "Theodore Bunker",
    "title": "Pennsylvania GOP Senate Candidates Fight for Trump's Endorsement"
  },
  {
    "id": 4597,
    "mediaId": 2641,
    "date": "2022-02-15",
    "sentence": "The complete poll results:\n<span class='selected-term'>Mehmet Oz</span>: 27.4%\nDavid McCormick: 15.9%\nCarla Sands: 14.8%\nKathy Barnette: 8.9%\nJeff Bartos: 6.6%\nSean Gale: 1.9%\nGeorge Bochetto: 1.6%\nEverett Stern: 1.5%\nThere were still 21.6% of likely GOP Senate primary voters undecided.",
    "author": "Eric Mack",
    "title": "Trafalgar Poll: Dr. Oz Takes Big Lead in Pa. Race"
  },
  {
    "id": 5065,
    "mediaId": 2632,
    "date": "2022-02-15",
    "sentence": "Celebrity doctor <span class='selected-term'>Mehmet Oz</span> is also running in the GOP primary.",
    "author": "Brian Schwartz",
    "title": "Activision CEO Bobby Kotick Quietly Donated to Super PAC Backing Ex-Hedge Fund Chief's Senate Bid"
  },
  {
    "id": 5351,
    "mediaId": 2539,
    "date": "2022-02-15",
    "sentence": "Celebrity doctor <span class='selected-term'>Mehmet Oz</span> is also running in the GOP primary.",
    "author": "Brian Schwartz",
    "title": "Activision CEO Bobby Kotick quietly donated to super PAC backing ex-hedge fund chief’s Senate bid"
  },
  {
    "id": 5393,
    "mediaId": 2621,
    "date": "2022-02-16",
    "sentence": "Television personality Dr. <span class='selected-term'>Mehmet Oz</span> stands a very real chance of winning the GOP primary for the Pennsylvania Senate race, writes Josh Rogin of the Washington Post, but Oz’s ties to the Turkish government are drawing criticism, including from NBA player Enes Kanter Freedom.",
    "author": "Sarah Rumpf",
    "title": "Enes Freedom Claims Dr. Oz is in the ‘Pocket’ of Turkish Dictator: ‘Whatever Erdogan Wants, That’s What Dr. Oz Is Going to Do’"
  },
  {
    "id": 4584,
    "mediaId": 2550,
    "date": "2022-02-16",
    "sentence": "PA-Sen: The super PAC Honor Pennsylvania's new commercial against TV personality <span class='selected-term'>Mehmet Oz</span> uses footage from his show to argue he's a \"Republican in name only,\" including a 2013 clip of him enthusiastically jumping up and down with Michelle Obama.",
    "author": "",
    "title": "Morning Digest: Longtime Democratic power player on Long Island will not seek"
  },
  {
    "id": 4562,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Bob Brigham",
    "title": "Turkey’s autocratic ruler could have leverage over a future GOP senator: report"
  },
  {
    "id": 5130,
    "mediaId": 2574,
    "date": "2022-02-16",
    "sentence": "Basketball star Enes Kanter Freedom is calling foul on Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> over the celebrity doctor’s connections to Turkey.",
    "author": "Chuck Ross",
    "title": "Enes Kanter Freedom’s Dunk on Dr. Oz Could Shake Up Pennsylvania Senate Race"
  },
  {
    "id": 4995,
    "mediaId": 3997,
    "date": "2022-02-16",
    "sentence": "Basketball star Enes Kanter Freedom is calling foul on Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> over the celebrity doctor’s connections to Turkey.",
    "author": "Chuck Ross",
    "title": "Enes Kanter Freedom’s Dunk on Dr. Oz Could Shake Up Pennsylvania Senate Race"
  },
  {
    "id": 4672,
    "mediaId": 2643,
    "date": "2022-02-17",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> currently has the greatest name recognition in the race for an open Senate seat in Pennsylvania, but some of Hollywood's biggest stars are lining up behind Democratic candidate Malcolm Kenyatta.",
    "author": "Jon Jackson",
    "title": "Halle Berry, Amy Schumer Among Stars Backing Dr. Oz's Opponent for Senate"
  },
  {
    "id": 4797,
    "mediaId": 2745,
    "date": "2022-02-17",
    "sentence": "Honor Pennsylvania, “Greatest Hits.” The PAC wars keep escalating between allies of TV personality <span class='selected-term'>Mehmet Oz</span> and former Treasury official David McCormick, the two biggest-spending Republicans running for U.S. Senate.",
    "author": "",
    "title": "The Trailer: In Texas, Republicans battle for room on the right"
  },
  {
    "id": 4878,
    "mediaId": 2822,
    "date": "2022-02-17",
    "sentence": "",
    "author": "STEVE PEOPLES",
    "title": "'The brand is so toxic': Democrats fear extinction in rural America"
  },
  {
    "id": 5123,
    "mediaId": 2732,
    "date": "2022-02-18",
    "sentence": "I felt the need to write this letter to encourage Pennsylvania voters not to vote for Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Letter to the editor: Don't vote for Dr. Oz"
  },
  {
    "id": 4690,
    "mediaId": 2621,
    "date": "2022-02-18",
    "sentence": "Subscribe to\nFormer TV host Dr. <span class='selected-term'>Mehmet Oz</span> called on China to pay the U.S. “reparations” on Friday during an interview on Newsmax TV.",
    "author": "Kipp Jones",
    "title": "Dr. Oz Tells Newsmax China Should Pay U.S. ‘Reparations’ As He Continues MAGA-Like Senate Tour"
  },
  {
    "id": 4940,
    "mediaId": 2641,
    "date": "2022-02-18",
    "sentence": "Television personality and U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> told Newsmax on Friday that energy is ''the big issue'' in Pennsylvania, where he is running, as it is across the country.",
    "author": "Charles Kim",
    "title": "Dr. Oz to Newsmax: Energy Is 'Big Issue' in Pennsylvania Senate Campaign"
  },
  {
    "id": 4667,
    "mediaId": 2732,
    "date": "2022-02-19",
    "sentence": "Frances Weiss, White Oak\nDon’t vote for Dr. Oz\nI felt the need to write this letter to encourage Pennsylvania voters not to vote for Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Sounding off: Biden, Casey, protect our borders first"
  },
  {
    "id": 5083,
    "mediaId": 2732,
    "date": "2022-02-20",
    "sentence": "The vast majority of the Senate ads are coming from or in support of surgeon and television personality Dr. <span class='selected-term'>Mehmet Oz</span> of Montgomery County and former hedge fund CEO and veteran David McCormick, who recently bought a house in Pittsburgh.",
    "author": "Ryan Deto",
    "title": "Pittsburgh market has seen the most ads in high-stakes Senate race"
  },
  {
    "id": 5330,
    "mediaId": 2790,
    "date": "2022-02-20",
    "sentence": "The top Republicans in the race to replace him are a TV personality, Dr. <span class='selected-term'>Mehmet Oz</span>, better known as Dr. Oz, and a former hedge fund manager, David McCormick.",
    "author": "Don Gonyea",
    "title": "Pennsylvania Senate contests will be some of the most closely watched this year"
  },
  {
    "id": 5009,
    "mediaId": 2752,
    "date": "2022-02-21",
    "sentence": "Here’s a depressing update for you: a new poll says Dr. <span class='selected-term'>Mehmet Oz</span> leads the pack of terrible Republicans competing in the GOP Pennsylvania Senate primary.",
    "author": "Stephen Robinson",
    "title": "Dr. Oz Pretty Sure No One Covers Their Body With Cloth Material For Eight Hours Or More"
  },
  {
    "id": 5422,
    "mediaId": 2790,
    "date": "2022-02-22",
    "sentence": "Uncertainty and anxiety\nThe Republican side of the Senate race is just as unsettled as the Democrats', especially after Trump's pick dropped out and celebrity Dr. <span class='selected-term'>Mehmet Oz</span> jumped in.",
    "author": "Don Gonyea",
    "title": "Pennsylvania Democrats are angling to distinguish themselves in a key Senate contest"
  },
  {
    "id": 4711,
    "mediaId": 2644,
    "date": "2022-02-22",
    "sentence": "Pennsylvania: Land of Oz\nA dozen years ago Dr. <span class='selected-term'>Mehmet Oz</span> served me lunch.",
    "author": "Cindy Adams",
    "title": "Dr. Oz has the prescription for a Washington gone wild"
  },
  {
    "id": 4567,
    "mediaId": 2594,
    "date": "2022-02-22",
    "sentence": "Monday's debate did not include high profile candidates such as the celebrity doctor <span class='selected-term'>Mehmet Oz</span> and former George W Bush official David McCormick, both of whom took flak for skipping the event.",
    "author": "Io Dodds",
    "title": "Republican candidate denounces Michael Flynn as a ‘traitor’ during bad-tempered GOP debate"
  },
  {
    "id": 4704,
    "mediaId": 2526,
    "date": "2022-02-22",
    "sentence": "It’s a two-man race In Pennsylvania’s GOP senate primary, with David McCormick surging out in front and <span class='selected-term'>Mehmet Oz</span> sliding down into a distant second place, an internal poll commissioned by McCormick’s campaign shows.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Poll: David McCormick Surges into Lead in Pennsylvania GOP Senate Primary, Mehmet Oz Crashes"
  },
  {
    "id": 5303,
    "mediaId": 6746,
    "date": "2022-02-23",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, one of television's most well-known physicians, who is now running for Senate in Pennsylvania as a Republican, feels that the Biden administration has placed too much emphasis on a vaccine that has failed to deliver on its promises.",
    "author": "Madz Dizon",
    "title": "Dr. Mehmet Oz Says Dr. Anthony Fauci Misleads Americans, Decries COVID-19 Mandates After Chief Adviser Expresses Concern on Taking Off Masks"
  },
  {
    "id": 5356,
    "mediaId": 6526,
    "date": "2022-02-23",
    "sentence": "",
    "author": "Paul Muschick",
    "title": "Dr. Oz, other carpetbaggers insulted Pennsylvania voters by skipping Senate debate"
  },
  {
    "id": 4976,
    "mediaId": 2636,
    "date": "2022-02-23",
    "sentence": "The campaign of <span class='selected-term'>Mehmet Oz</span>, one of his Senate primary rivals, better known as Dr. Oz, has aired an ad accusing him of “selling us out” as a Wall Street executive and criticizing his China ties; Pennsylvania Democrats put up a website, blessedbyChina.com, with a selectively clipped highlight reel of his comments over the years.",
    "author": "",
    "title": "speech at the West Point Society of New York"
  },
  {
    "id": 5008,
    "mediaId": 2732,
    "date": "2022-02-24",
    "sentence": "It has also meant a deluge of ads in Southwestern Pennsylvania as high profile candidates like Dr. <span class='selected-term'>Mehmet Oz</span> and David McCormick take to the airwaves.",
    "author": "",
    "title": "Laurels & lances: Theater, politics and resurgence"
  },
  {
    "id": 5116,
    "mediaId": 2551,
    "date": "2022-02-24",
    "sentence": "+8\nView gallery\n+8\nView gallery\nFormer Democratic Rep. Tulsi Gabbard (left) and Dr. <span class='selected-term'>Mehmet Oz</span> (right) will both be appearing at the Conservative Political Action Conference in Orlando, Florida, where it was moved to get away from strict COVID-19 protocols\n+8\nView gallery\nSo far, former Rep. Tulsi Gabbard is the only prominent Democrat slated to appear at CPAC, a gathering for those on the political right.",
    "author": "",
    "title": "'P***ed off' conservatives gather in Orlando for 'awake not woke' CPAC conference as organizer Matt Schlapp says Americans are tired of being told what to do by the Biden administration"
  },
  {
    "id": 4021,
    "mediaId": 2732,
    "date": "2022-02-25",
    "sentence": "SCRANTON — Dr. <span class='selected-term'>Mehmet Oz</span> leans in to ask a little girl, “Do you remember when your parents thought you were a boy?”\nThe question was but a few seconds of a full 2010 episode of “The Dr. Oz Show” that focused on the experience of raising transgender children.",
    "author": "Associated Press",
    "title": "In trans people, GOP candidates find latest 'wedge issue'"
  },
  {
    "id": 4051,
    "mediaId": 2540,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Gabby Orr and Melanie Zanona",
    "title": "Trump may offer help to Katie Britt in Alabama Senate primary -- even though he's already endorsed Mo Brooks"
  },
  {
    "id": 3961,
    "mediaId": 2594,
    "date": "2022-02-25",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> leans in to ask a little girl, “Do you remember when your parents thought you were a boy?”\nThe question was but a few seconds of a full 2010 episode of “The Dr. Oz Show” that focused on the experience of raising transgender children.",
    "author": "Via AP news wire",
    "title": "In trans people, GOP candidates find latest 'wedge issue'"
  },
  {
    "id": 4284,
    "mediaId": 2560,
    "date": "2022-02-25",
    "sentence": "Associated Press\nScranton, Pa. – Dr. <span class='selected-term'>Mehmet Oz</span> leans in to ask a little girl, “Do you remember when your parents thought you were a boy?”\nThe question was but a few seconds of a full 2010 episode of “The Dr. Oz Show” that focused on the experience of raising transgender children.",
    "author": "Jeff Mcmillan and Marc Levy",
    "title": "In trans people, GOP candidates find latest 'wedge issue'"
  },
  {
    "id": 4086,
    "mediaId": 2679,
    "date": "2022-02-25",
    "sentence": "SCRANTON, Pa. (AP) — Dr. <span class='selected-term'>Mehmet Oz</span> leans in to ask a little girl, “Do you remember when your parents thought you were a boy?”\nThe question was but a few seconds of a full 2010 episode of “The Dr. Oz Show” that focused on the experience of raising transgender children.",
    "author": "MARC LEVY",
    "title": "In trans people, GOP candidates find latest ‘wedge issue’"
  },
  {
    "id": 3882,
    "mediaId": 2523,
    "date": "2022-02-25",
    "sentence": "By JEFF McMILLAN and MARC LEVY | Associated Press\nSCRANTON, Pa. — Dr. <span class='selected-term'>Mehmet Oz</span> leans in to ask a little girl, “Do you remember when your parents thought you were a boy?”\nThe question was but a few seconds of a full 2010 episode of “The Dr. Oz Show” that focused on the experience of raising transgender children.",
    "author": "Associated Press",
    "title": "In trans people, GOP candidates find latest ‘wedge issue’"
  },
  {
    "id": 4095,
    "mediaId": 2728,
    "date": "2022-02-25",
    "sentence": "(AP Photo)\nSCRANTON, Pa. (AP) — Dr. <span class='selected-term'>Mehmet Oz</span> leans in to ask a little girl, “Do you remember when your parents thought you were a boy?”\nThe question was but a few seconds of a full 2010 episode of “The Dr. Oz Show” that focused on the experience of raising transgender children.",
    "author": "Jeff Mcmillan And Marc Levy",
    "title": "In trans people, GOP candidates find latest ‘wedge issue’"
  },
  {
    "id": 3767,
    "mediaId": 2679,
    "date": "2022-02-26",
    "sentence": "NEWTOWN, Pa. (AP) — The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "MARC LEVY",
    "title": "No notes, same logo: Dr. Oz’s campaign is like his TV show"
  },
  {
    "id": 4432,
    "mediaId": 2912,
    "date": "2022-02-26",
    "sentence": "NEWTOWN, Pa. >> The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "",
    "title": "Dr. Oz’s political campaign is like his TV show"
  },
  {
    "id": 3868,
    "mediaId": 2594,
    "date": "2022-02-26",
    "sentence": "The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "Via AP news wire",
    "title": "No notes, same logo: Dr. Oz's campaign is like his TV show"
  },
  {
    "id": 4166,
    "mediaId": 6526,
    "date": "2022-02-26",
    "sentence": "NEWTOWN — The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "MARC LEVY",
    "title": "No notes, same logo: Dr. Oz’s campaign for Pat Toomey’s Senate seat in Pennsylvania is a lot like his TV show, and his strategy is a bit like Trump’s"
  },
  {
    "id": 4511,
    "mediaId": 2509,
    "date": "2022-02-26",
    "sentence": "Dr. Oz is making his way around Pennsylvania as a candidate for U.S. Senate in town hall-style settings that seem very much like the TV studio where he once presided\nNEWTOWN, Pa. -- The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "",
    "title": "No notes, same logo: Dr. Oz's campaign is like his TV show"
  },
  {
    "id": 4066,
    "mediaId": 2732,
    "date": "2022-02-26",
    "sentence": "NEWTOWN — The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>Mehmet Oz</span>, to take up the microphone and become the center of attention for more than an hour.",
    "author": "Associated Press",
    "title": "No notes, same logo: Dr. Oz's campaign is like his TV show"
  },
  {
    "id": 4083,
    "mediaId": 2641,
    "date": "2022-02-26",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> told Newsmax on Saturday that politicians in Washington, D.C., do not hold the same values as Pennsylvania's electorate.",
    "author": "Nick Koutsobinas",
    "title": "Dr. Oz to Newsmax: DC Politicians Lack Values of Their Constituents"
  },
  {
    "id": 3940,
    "mediaId": 2551,
    "date": "2022-02-27",
    "sentence": "+3\nView gallery\nPennsylvania Republican Senate hopeful Dr. <span class='selected-term'>Mehmet Oz</span> made his Conservative Political Action Conference debut Sunday, speaking on a panel about the coronavirus pandemic\n+3\nView gallery\nDr. Mehmet Oz (right) volunteered to moderator Jason Rantz (left) that yes, he had been vaccinated against COVID-19.",
    "author": "",
    "title": "'People hated Donald so much that they began rooting against a COVID solution': Dr. Oz makes CPAC debut where he blasts politicization of Trump-backed 'cure' Hydroxy"
  },
  {
    "id": 3969,
    "mediaId": 6746,
    "date": "2022-02-27",
    "sentence": "Related Article: Dr. <span class='selected-term'>Mehmet Oz</span> Says Dr. Anthony Fauci Misleads Americans, Decries COVID-19 Mandates After Chief Adviser Expresses Concern on Taking Off Masks",
    "author": "Renz Soliman",
    "title": "New York City Mayor Eric Adams Teases Removal of COVID-19 Vaccine Mandate; But Why Will It Happen Next Week?"
  },
  {
    "id": 3724,
    "mediaId": 2658,
    "date": "2022-02-27",
    "sentence": "2022 WATCH — “The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>MEHMET OZ</span>, to take up the microphone and become the center of attention for more than an hour,” reports AP’s Marc Levy from Newtown, Pa. “Welcome to Oz’s campaign for U.S. Senate, where the celebrity heart surgeon and former host of daytime TV’s ‘Dr.",
    "author": "",
    "title": "POLITICO Playbook: Your guide through a blizzard of news in Ukraine"
  },
  {
    "id": 4091,
    "mediaId": 2528,
    "date": "2022-02-27",
    "sentence": "Eller said he also hoped to score endorsements from other CPAC attendees such Carson and as <span class='selected-term'>Mehmet Oz</span>, the TV doctor who is running for Senate in Pennsylvania.",
    "author": "Kimberly Leonard",
    "title": "Inside the nation's most MAGA political boot camp where budding candidates work to build their conservative brand and score a few seconds with Donald Trump"
  },
  {
    "id": 3673,
    "mediaId": 2658,
    "date": "2022-02-28",
    "sentence": "Down the Ballot\nWEEKEND UPDATE — “How Orlando became the center of the universe for GOP Senate hopefuls,” by Natalie Allison, POLITICO: “<span class='selected-term'>Mehmet Oz</span> has less than 90 days left before Pennsylvania Republican voters cast their ballots in one of the most contentious Senate primaries in the nation.",
    "author": "",
    "title": "6 House races to watch in Texas"
  },
  {
    "id": 3782,
    "mediaId": 2590,
    "date": "2022-02-28",
    "sentence": "https://t.co/3A763Mz8Pg\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) February 26, 2022\nFauci hasn’t responded to Oz’s debate offer, but many Twitter users did.",
    "author": "David Moye",
    "title": "Twitter Users Mock Dr. Oz By Turning 'Challenge' To Dr. Fauci Into Brutal Meme"
  },
  {
    "id": 4156,
    "mediaId": 2644,
    "date": "2022-02-28",
    "sentence": "I didn’t do it intentionally.”\nHarris also asked her about a TV interview with Dr. <span class='selected-term'>Mehmet Oz</span> in which she said, “The balls on that guy,” in reaction to Peterson walking into the courtroom.",
    "author": "Marjorie Hernandez",
    "title": "Scott Peterson juror ‘Strawberry Shortcake’ breaks down over misconduct allegations"
  },
  {
    "id": 4387,
    "mediaId": 2663,
    "date": "2022-02-28",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> clearly thinks very highly of himself.",
    "author": "Dan Tracer",
    "title": "Dr. Oz’s latest attempt at relevance backfires spectacularly"
  },
  {
    "id": 3871,
    "mediaId": 2570,
    "date": "2022-02-28",
    "sentence": "",
    "author": "Bruce Y. Lee",
    "title": "Dr. Oz Challenged Dr. Fauci To A Debate, Here’s How Others Responded"
  },
  {
    "id": 4047,
    "mediaId": 2630,
    "date": "2022-02-28",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> leans in to ask a little girl, “Do you remember when your parents thought you were a boy?”\nThe question was but a few seconds of a full 2010 episode of “The Dr. Oz Show” that focused on the experience of raising transgender children.",
    "author": "",
    "title": "In transgender people, GOP candidates find latest 'wedge issue'"
  },
  {
    "id": 3863,
    "mediaId": 2594,
    "date": "2022-02-28",
    "sentence": "Dr <span class='selected-term'>Mehmet Oz</span>, who is running for one of Pennsylvania’s two senate seats, is being mocked online for his second attempt at challenging Dr Anthony Fauci to debate him, despite the fact that the leading expert in infectious diseases is not opposing him.",
    "author": "Oliver O'Connell",
    "title": "Dr Oz ridiculed for complaining Fauci won’t debate him"
  },
  {
    "id": 3866,
    "mediaId": 2522,
    "date": "2022-02-28",
    "sentence": "https://t.co/3A763Mz8Pg\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) February 26, 2022\nIt’s probably pretty safe to say that Fauci isn’t about to go toe-to-toe with Dr. Oz, especially now that Democrats and their media allies have moved on from COVID with the hope that Americans will forget the hellish last two years before they go to the polls in November.",
    "author": "Chris Donaldson",
    "title": "Dr. Oz debuts at CPAC with a bang, ready to go toe-to-toe with Fauci"
  },
  {
    "id": 3844,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "A local candidate wants to transcend party. Does Texas allow that?"
  },
  {
    "id": 3957,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Harris County, home to Houston, warns of delays in counting ballots."
  },
  {
    "id": 3978,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Beto O’Rourke snags the Democratic nomination for Texas governor."
  },
  {
    "id": 3974,
    "mediaId": 2636,
    "date": "2022-03-01",
    "sentence": "",
    "author": "",
    "title": "Gov. Greg Abbott wins the G.O.P. nomination, defeating challengers from the right."
  },
  {
    "id": 4314,
    "mediaId": 2602,
    "date": "2022-03-02",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, a Pennsylvania Senate candidate, said Biden is inviting further aggressions.",
    "author": "DOUGLAS BLOOMFIELD",
    "title": "Russian invasion: Republicans are Putin's 5th column undermining the US - opinion"
  },
  {
    "id": 4221,
    "mediaId": 6570,
    "date": "2022-03-03",
    "sentence": "Blood sport, it may be, as just this week, Dr. <span class='selected-term'>Mehmet Oz</span>, another Republican running for the Senate, quipped that Mr. McCormick “says he is tough on China, but got rich investing with them.”\nThe New York Times reported late last month that Mr. McCormick’s hedge fund, Bridgewater Associates, was closely linked to China, and cited affectionate comments he had made in the past about the country, though some were from when he served as U.S. Treasury Under Secretary for International Affairs in George W. Bush’s administration.",
    "author": "Julian Routh",
    "title": "David McCormick hawkish on China, punches back at Mehmet Oz in visit to suburban Pittsburgh"
  },
  {
    "id": 3858,
    "mediaId": 2514,
    "date": "2022-03-04",
    "sentence": "This is starkly different from the GOP Senate primary, where TV personality <span class='selected-term'>Mehmet Oz</span> and hedge fund manager David McCormick have been battling it out on the airwaves for months.",
    "author": "",
    "title": "Stories that would have rocked the political world in past years now met with yawns"
  },
  {
    "id": 4190,
    "mediaId": 2539,
    "date": "2022-03-04",
    "sentence": "Dalio, who is co-chair of Bridgewater Associates, is personal friends with both Republican candidates vying for Pennsylvania’s Senate seat: Dr. <span class='selected-term'>Mehmet Oz</span> and former Bridgewater CEO David McCormick.",
    "author": "Brian Schwartz",
    "title": "Pivotal Senate GOP race pits billionaire Ray Dalio’s former CEO against his friend Dr. Oz"
  },
  {
    "id": 4404,
    "mediaId": 2574,
    "date": "2022-03-04",
    "sentence": "Elections\nCelebrity doc’s poll numbers drop amid barrage of attack ads\nDavid McCormick has taken a commanding lead over celebrity doctor <span class='selected-term'>Mehmet Oz</span> in Pennsylvania’s Republican Senate primary.",
    "author": "Chuck Ross",
    "title": "Free Beacon Poll: McCormick Overtakes Oz in PA Primary"
  },
  {
    "id": 3921,
    "mediaId": 3997,
    "date": "2022-03-04",
    "sentence": "Elections\nCelebrity doc’s poll numbers drop amid barrage of attack ads\nDavid McCormick has taken a commanding lead over celebrity doctor <span class='selected-term'>Mehmet Oz</span> in Pennsylvania’s Republican Senate primary.",
    "author": "Chuck Ross",
    "title": "Free Beacon Poll: McCormick Overtakes Oz in PA Primary"
  },
  {
    "id": 4397,
    "mediaId": 2574,
    "date": "2022-03-04",
    "sentence": "The poll also found U.S Army veteran and businessman David McCormick with a commanding lead over celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the upcoming Republican primary election.",
    "author": "Patrick Hauf",
    "title": "Free Beacon Poll: 4 Out of 5 GOP Voters Say No to Government Crack Pipes"
  },
  {
    "id": 4390,
    "mediaId": 2553,
    "date": "2022-03-04",
    "sentence": "Republican Pennsylvania senatorial candidate <span class='selected-term'>Mehmet Oz</span> is raising eyebrows with promises to “defend the sanctity of life” in light of past comments he made suggesting he was open to abortions.",
    "author": "Mary Margaret Olohan",
    "title": "Dr. Oz Raises Eyebrows Swearing To ‘Defend The Sanctity Of Life’"
  },
  {
    "id": 4144,
    "mediaId": 2548,
    "date": "2022-03-04",
    "sentence": "“While Mehmet has been silent on China until he needed to knock down Dave’s credentials, Dave was serving our country in combat and the highest levels of government and standing up to the CCP.”\n“Oz spent his entire career cozying up to the Hollywood elite, China and big corporations and his track record on important conservative issues makes it clear that <span class='selected-term'>Mehmet Oz</span> fights for Mehmet Oz – not for Pennsylvania,” she added.",
    "author": "Ailan Evans",
    "title": "Dr. Oz’s Ties To Pharma, Tech Complicate Anti-Corporate Campaign Claims"
  },
  {
    "id": 3451,
    "mediaId": 6443,
    "date": "2022-03-07",
    "sentence": "Pennsylvania: With just over two months left before the Keystone State’s May 17 primary, the relative newcomer to the race, David McCormick, leads celebrity Dr. <span class='selected-term'>Mehmet Oz</span> for the Republican nomination for Senate.",
    "author": "",
    "title": "Rally around Ukraine now; the finger-pointing comes later"
  },
  {
    "id": 3534,
    "mediaId": 2602,
    "date": "2022-03-07",
    "sentence": "(photo credit: Hannah Beier/Reuters)\nIf he wins the Senate race in Pennsylvania this coming November, <span class='selected-term'>Mehmet Oz</span>, famous throughout the world as Dr. Oz, will become the first Muslim ever to hold a United States Senate seat.",
    "author": "SHMULEY BOTEACH",
    "title": "Will first US Muslim senator condemn Iran deal?"
  },
  {
    "id": 3128,
    "mediaId": 2732,
    "date": "2022-03-07",
    "sentence": "Republicans have a wide-open field, including three wealthy and well-connected transplants from out of state — including <span class='selected-term'>Mehmet Oz</span>, host of daytime TV’s “The Dr. Oz Show” — who are spending millions of dollars on TV ads.",
    "author": "Associated Press",
    "title": "'We want to win': Democrats face choice in key Senate race in Pennsylvania"
  },
  {
    "id": 3305,
    "mediaId": 2514,
    "date": "2022-03-07",
    "sentence": "Republicans have a wide-open field, including three wealthy and well-connected transplants from out of state — including <span class='selected-term'>Mehmet Oz</span>, host of daytime TV's “The Dr. Oz Show” — who are spending millions of dollars on TV ads.",
    "author": "",
    "title": "'We want to win': Democrats face choice in key Senate race"
  },
  {
    "id": 3341,
    "mediaId": 2644,
    "date": "2022-03-07",
    "sentence": "Health guru <span class='selected-term'>Mehmet Oz</span> is in the midst of a family feud with his sister, who he claims has swiped millions of dollars from their late father’s estate, according to a new court papers.",
    "author": "Priscilla DeGregory",
    "title": "Dr. Oz accuses sister of stealing millions, forging dad’s will"
  },
  {
    "id": 4052,
    "mediaId": 2679,
    "date": "2022-03-07",
    "sentence": "Republicans have a wide-open field, featuring three wealthy and well-connected transplants from out of state — including <span class='selected-term'>Mehmet Oz</span>, host of daytime TV’s “The Dr. Oz Show” — who are spending millions of dollars on TV ads.",
    "author": "MARC LEVY",
    "title": "‘We want to win’: Democrats face choice in key Senate race"
  },
  {
    "id": 3229,
    "mediaId": 2738,
    "date": "2022-03-08",
    "sentence": "In late 2021, “serial testicle fondler” <span class='selected-term'>Mehmet Oz</span>, a.k.a.",
    "author": "Jennifer Wood",
    "title": "US Senate Candidate/Quack TV Doctor Dr. Oz Is Fighting With His Sister Over Their Father’s Estate"
  },
  {
    "id": 2899,
    "mediaId": 2526,
    "date": "2022-03-08",
    "sentence": "Businessman David McCormick is the frontrunner in Pennsylvania’s Republican U.S. Senate primary, leading celebrity doctor <span class='selected-term'>Mehmet Oz</span> by nine points, according to a recent Fox News poll.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Poll: McCormick Leads Dr. Oz by 9 Points in Pennsylvania Republican Senate Primary"
  },
  {
    "id": 3635,
    "mediaId": 2915,
    "date": "2022-03-09",
    "sentence": "Keeping with the Oz theme, who better to quote than Dr. <span class='selected-term'>Mehmet Oz</span> (no relation to the Wizard)?",
    "author": "Nolan Lewallen",
    "title": "'Toto, We're Not in America Anymore'"
  },
  {
    "id": 3293,
    "mediaId": 2712,
    "date": "2022-03-09",
    "sentence": "DR <span class='selected-term'>MEHMET Oz</span>’s daughter Daphne’s new show has been canceled after she struggled to book A-list guests and failed to bring in high ratings, The Sun can report.",
    "author": "Jessica Finn",
    "title": "Dr Oz’s daughter Daphne’s show The Good Dish canceled as she ‘struggled’ to book A-list guests on ‘doomed’ series"
  },
  {
    "id": 3223,
    "mediaId": 2660,
    "date": "2022-03-09",
    "sentence": "The false Facebook post includes a photo of Winfrey, Dr. <span class='selected-term'>Mehmet Oz</span> and acupuncturist Daniel Hsu, who appeared on Winfrey’s TV show in 2014.",
    "author": "Monique Curet",
    "title": "Oprah Winfrey is not hawking diet pills"
  },
  {
    "id": 3245,
    "mediaId": 2556,
    "date": "2022-03-09",
    "sentence": "",
    "author": "",
    "title": "‘The Good Dish’ Not Returning For Season 2 In Syndication; Sony Pictures TV Exploring Options"
  },
  {
    "id": 3236,
    "mediaId": 2644,
    "date": "2022-03-10",
    "sentence": "In 2018, after years of reflecting, she told Dr. <span class='selected-term'>Mehmet Oz</span> that she felt she subconsciously used weight gain as a defense mechanism to protect herself against potential future harm.",
    "author": "Bernie Zilio",
    "title": "How Marie Osmond has maintained 50-pound weight loss for 15 years"
  },
  {
    "id": 2976,
    "mediaId": 2641,
    "date": "2022-03-11",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> is a heart surgeon, professor emeritus at Columbia University and Republican candidate for the U.S. Senate in Pennsylvania.",
    "author": "Dr. Mehmet Oz",
    "title": "Dr. Oz: Follow The Science For Domestic Energy Policy"
  },
  {
    "id": 3187,
    "mediaId": 2641,
    "date": "2022-03-11",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, a Republican candidate for the U.S. Senate in Pennsylvania, told Newsmax on Friday that the Biden administration is \"getting it wrong\" on energy policy and consistently caving to \"woke radical environmentalists.\"",
    "author": "Luca Cacciatore",
    "title": "Dr. Oz to Newsmax: Biden Is 'Getting It Wrong' on Energy Policy"
  },
  {
    "id": 2967,
    "mediaId": 2540,
    "date": "2022-03-13",
    "sentence": "Perhaps the most notable find was that <span class='selected-term'>Mehmet Oz</span> came in at a mere 15% in the Republican Senate primary in the Keystone State.",
    "author": "Harry Enten",
    "title": "Biden's approval rating rises following Russian invasion of Ukraine"
  },
  {
    "id": 3281,
    "mediaId": 2732,
    "date": "2022-03-14",
    "sentence": "PHILADELPHIA — Wealthy investors and executives supporting Republican Senate candidate David McCormick have helped flood Pennsylvania’s airwaves with ads accusing GOP rival <span class='selected-term'>Mehmet Oz</span> of being too liberal, a RINO — Republican In Name Only.",
    "author": "The Philadelphia Inquirer",
    "title": "The super PAC hammering Mehmet Oz as a RINO is getting money from longtime Democratic donors"
  },
  {
    "id": 3197,
    "mediaId": 2572,
    "date": "2022-03-14",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, a former surgeon and TV personality, has presented a conservative platform in the race for the Republican U.S. Senate nomination in Pennsylvania, but in spite of his conservative platform on social and transgender issues, he repeatedly gave a platform to transgender activists, transgender parents, and a surgeon who performs transgender surgery.",
    "author": "Tyler O'Neil",
    "title": "Dr. Oz, now a GOP Senate candidate, had Jazz Jennings, transgender parents, transgender surgeon on his show"
  },
  {
    "id": 2798,
    "mediaId": 2526,
    "date": "2022-03-14",
    "sentence": "Celebrity Doctor <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican Senate candidate in Pennsylvania, is coming under fire in recent days over his soft history with transgender ideology, giving a platform to those advocating for the left’s radical views.",
    "author": "Hannah Bleau",
    "title": "GOP Senate Candidate Dr. Oz’s Soft History with Transgender Ideology Under Fire in Pennsylvania"
  },
  {
    "id": 3607,
    "mediaId": 2553,
    "date": "2022-03-15",
    "sentence": "Fox News reported:\nMcCormick has a clear advantage in Pennsylvania’s Republican primary for U.S. Senate, including besting television celebrity doctor <span class='selected-term'>Mehmet Oz</span> — although many primary voters remain undecided.",
    "author": "Ryan Saavedra",
    "title": "Dr. Oz In Talks To Return To Television: Report"
  },
  {
    "id": 2780,
    "mediaId": 2594,
    "date": "2022-03-15",
    "sentence": "Parnell's exit threw open the doors to McCormick and <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show, and accelerated spending in what could be this year's most expensive Senate race.",
    "author": "Via AP news wire",
    "title": "Ex-hedge fund CEO aims to be hometown boy in key Senate race"
  },
  {
    "id": 3184,
    "mediaId": 2679,
    "date": "2022-03-15",
    "sentence": "Parnell’s exit threw open the doors to McCormick and <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show,” and accelerated spending in what could be this year’s most expensive Senate race.",
    "author": "MARC LEVY",
    "title": "Ex-hedge fund CEO aims to be hometown boy in key Senate race"
  },
  {
    "id": 3542,
    "mediaId": 2728,
    "date": "2022-03-15",
    "sentence": "Parnell’s exit threw open the doors to McCormick and <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show,“ and accelerated spending in what could be this year’s most expensive Senate race.",
    "author": "Marc Levy",
    "title": "Ex-hedge fund CEO aims to be hometown boy in key Senate race"
  },
  {
    "id": 3372,
    "mediaId": 2663,
    "date": "2022-03-15",
    "sentence": "Reality has apparently caught up with Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "David Reddish",
    "title": "Dr. Oz’s disastrous Senate campaign reportedly on “life support” as he eyes TV comeback"
  },
  {
    "id": 3345,
    "mediaId": 2728,
    "date": "2022-03-16",
    "sentence": "HARRISBURG, Pa. (AP) — <span class='selected-term'>Mehmet Oz</span>, warding off criticism from a key rival in Pennsylvania’s heated Republican primary race for U.S. Senate, said Wednesday that he will renounce his dual citizenship in Turkey if he is elected, as the expensive campaign took on a harder and more personal edge.",
    "author": "Marc Levy",
    "title": "Oz vows to renounce Turkish citizenship if elected senator"
  },
  {
    "id": 3091,
    "mediaId": 2679,
    "date": "2022-03-16",
    "sentence": "HARRISBURG, Pa. (AP) — <span class='selected-term'>Mehmet Oz</span>, warding off criticism from a key rival in Pennsylvania’s heated Republican primary race for U.S. Senate, said Wednesday that he will renounce his dual citizenship in Turkey if he is elected, as the expensive campaign took on a harder and more personal edge.",
    "author": "MARC LEVY",
    "title": "Oz vows to renounce Turkish citizenship if elected senator"
  },
  {
    "id": 3185,
    "mediaId": 2699,
    "date": "2022-03-16",
    "sentence": "A recent attack ad against McCormick’s big rival—pop surgeon Dr. <span class='selected-term'>Mehmet Oz</span>—is spotlighting the talk-show host’s position on transgender issues, slamming him as a “Republican in Name Only” for engaging on the topic in the past.",
    "author": "Roger Sollenberger",
    "title": "Dr. Oz’s PA Senate Rival Sure Was ‘Woke’ While He Was a CEO"
  },
  {
    "id": 3611,
    "mediaId": 2716,
    "date": "2022-03-16",
    "sentence": "Pennsylvania Republican Senate candidate and TV personality Dr. <span class='selected-term'>Mehmet Oz</span> told reporters Tuesday that if elected in November, he would be willing to give up certain security clearances in order to keep his U.S.-Turkish dual citizenship.",
    "author": "Peter Weber",
    "title": "Dr. Mehmet Oz suggests he would give up Senate security clearances to keep Turkish dual citizenship"
  },
  {
    "id": 3225,
    "mediaId": 2532,
    "date": "2022-03-16",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, who is seeking the Republican nomination in Pennsylvania's Senate race, said Wednesday that he would renounce his Turkish citizenship if elected.",
    "author": "Adam Brewster",
    "title": "Dr. Oz says he will renounce his Turkish citizenship if elected to Senate"
  },
  {
    "id": 3023,
    "mediaId": 2732,
    "date": "2022-03-16",
    "sentence": "Parnell’s exit threw open the doors to McCormick and Dr. <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show,” and accelerated spending in what could be this year’s most expensive Senate race.",
    "author": "Associated Press",
    "title": "Ex-hedge fund CEO aims to be hometown boy in Senate race in Pennsylvania"
  },
  {
    "id": 3189,
    "mediaId": 2730,
    "date": "2022-03-16",
    "sentence": "Source: Photo by Evan Agostini/Invision/AP, File\nDr. <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned-Pennsylvania candidate for the United States Senate, has continued to raise eyebrows both for his comments as a Republican primary candidate and in his years of public comments before he decided to make a run at Congress.",
    "author": "Spencer Brown",
    "title": "Dr. Oz Says He'd Forego Security Clearances to Retain Dual US-Turkish Citizenship"
  },
  {
    "id": 3212,
    "mediaId": 2601,
    "date": "2022-03-16",
    "sentence": "Breitbart\nCelebrity doctor <span class='selected-term'>Mehmet Oz</span> is already in talks to return to television if his candidacy for U.S. Senate in Pennsylvania is unsuccessful, according to a recent report.",
    "author": "Dr. Tar",
    "title": "Dr. Oz To Pull The Plug On His Senate Campaign"
  },
  {
    "id": 3496,
    "mediaId": 2748,
    "date": "2022-03-16",
    "sentence": "Celebrity doctor <span class='selected-term'>Mehmet Oz</span> is already in talks to return to television if his candidacy for U.S. Senate in Pennsylvania is unsuccessful, according to a recent report.",
    "author": "Blarp Blog",
    "title": "Report: Oz Looks to Exit Senate Race, Return to Television"
  },
  {
    "id": 3314,
    "mediaId": 2742,
    "date": "2022-03-16",
    "sentence": "Apparently he's planning on carrying his Turkish dual citizenship into the Senate, even if it means that he won't have a Senator's security clearance:\nRepublican U.S. Senate candidate <span class='selected-term'>Mehmet Oz</span> said today that he would forego certain security clearances that are provided to all U.S.",
    "author": "James Fulford",
    "title": "Dr. Oz, The Senate, And Turkish Dual Citizenship"
  },
  {
    "id": 3154,
    "mediaId": 2746,
    "date": "2022-03-16",
    "sentence": "HARRISBURG, Pa. — <span class='selected-term'>Mehmet Oz</span>, warding off criticism from a key rival in Pennsylvania’s heated Republican primary race for U.S. Senate, said Wednesday that he will renounce his dual citizenship in Turkey if he is elected, as the expensive campaign took on a harder and more personal edge.",
    "author": "Marc Levy",
    "title": "Dr. Oz vows to renounce Turkish citizenship if elected senator"
  },
  {
    "id": 2931,
    "mediaId": 6571,
    "date": "2022-03-16",
    "sentence": "HARRISBURG, Pa. (AP) — <span class='selected-term'>Mehmet Oz</span>, warding off criticism from a key rival in Pennsylvania's heated Republican primary race for U.S. Senate, said Wednesday that he will renounce his dual citizenship in Turkey if he is elected, as the expensive campaign took on a harder and more personal edge.",
    "author": "",
    "title": "Dr. Oz Vows To Renounce Turkish Citizenship If Elected Senator In Pennsylvania"
  },
  {
    "id": 3009,
    "mediaId": 2641,
    "date": "2022-03-16",
    "sentence": "",
    "author": "",
    "title": "Oz Vows to Renounce Turkish Citizenship If Elected Senator"
  },
  {
    "id": 3437,
    "mediaId": 2572,
    "date": "2022-03-17",
    "sentence": "When asked about McCormick's position on transgender identity and medical interventions for minors, the spokesperson aimed to contrast McCormick with Dr. <span class='selected-term'>Mehmet Oz</span>, who gave transgender activists and a transgender surgeon a platform on his show before he entered the 2022 Pennsylvania Senate race.",
    "author": "",
    "title": "Pennsylvania Senate candidate David McCormick takes fire for corporate history on transgender activism"
  },
  {
    "id": 3203,
    "mediaId": 2574,
    "date": "2022-03-17",
    "sentence": "Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> said Wednesday he will renounce his Turkish citizenship if elected to the U.S. Senate, reversing an earlier claim that he would maintain dual citizenship even if it meant forgoing classified briefings.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Pledges to Cut All Ties to Foreign Powers, If Elected"
  },
  {
    "id": 3590,
    "mediaId": 3997,
    "date": "2022-03-17",
    "sentence": "Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> said Wednesday he will renounce his Turkish citizenship if elected to the U.S. Senate, reversing an earlier claim that he would maintain dual citizenship even if it meant forgoing classified briefings.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Pledges to Cut All Ties to Foreign Powers, If Elected"
  },
  {
    "id": 3270,
    "mediaId": 2553,
    "date": "2022-03-17",
    "sentence": "Republican Pennsylvania Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> has pledged to renounce his Turkish citizenship if elected to the United States Senate.",
    "author": "John Rigolizzo",
    "title": "Dr. Oz Pledges To Renounce Turkish Citizenship If He Wins Senate Race"
  },
  {
    "id": 3529,
    "mediaId": 2718,
    "date": "2022-03-17",
    "sentence": "I’m blown away most of all by their fun and their eagerness to be taught while still really approaching food with a completely novel, unfiltered experience and perspective.”\nLong before Oz received her culinary degree from The Natural Gourmet Institute, her love of cooking began when she was around the same age as the kids on “MasterChef Junior.”\nOz, who is the daughter of cardiothoracic surgeon and now Republican Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span>, spent much of her childhood in the kitchen with her mother and grandmother, experimenting with meals for the whole family.",
    "author": "Katie Campione",
    "title": "Daphne Oz Talks Taking a Seat at the Judge’s Table for ‘MasterChef Junior’"
  },
  {
    "id": 3389,
    "mediaId": 6526,
    "date": "2022-03-17",
    "sentence": "HARRISBURG — <span class='selected-term'>Mehmet Oz</span>, warding off criticism from a key rival in Pennsylvania’s heated Republican primary race for U.S. Senate, said Wednesday that he will renounce his dual citizenship in Turkey if he is elected, as the expensive campaign took on a harder and more personal edge.",
    "author": "MARC LEVY",
    "title": "Oz vows to renounce Turkish citizenship if elected senator from Pennsylvania"
  },
  {
    "id": 2947,
    "mediaId": 2590,
    "date": "2022-03-17",
    "sentence": "pic.twitter.com/XkIE6qV4R0\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 16, 2022\nOz’s campaign is even denying that he ever voiced any concern about fracking in the first place, claiming that he had no part in any of those earlier columns — even though he is listed as their primary author.",
    "author": "Chris D'Angelo",
    "title": "Dr. Oz's First-Class Flip-Flop On Fracking"
  },
  {
    "id": 3093,
    "mediaId": 2590,
    "date": "2022-03-17",
    "sentence": "",
    "author": "",
    "title": "Dr. Oz Is In"
  },
  {
    "id": 2901,
    "mediaId": 2576,
    "date": "2022-03-17",
    "sentence": "New to the judging lineup is Daphne Oz, a wellness advocate, cookbook author and daughter of Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Susan Selasky",
    "title": "'MasterChef Junior' is back after three years and there's a hometown kid chef competing"
  },
  {
    "id": 3445,
    "mediaId": 2636,
    "date": "2022-03-17",
    "sentence": "",
    "author": "",
    "title": "Will Inflation Fix Itself?"
  },
  {
    "id": 2989,
    "mediaId": 2728,
    "date": "2022-03-18",
    "sentence": "Oz” but as “<span class='selected-term'>Mehmet Oz</span>.” Standing in front of an oversize American flag, McCormick opens the ad by saying, “When Mehmet Oz questions — my — patriotism, he’s crossed the line.”\nThe McCormick campaign has hired influential Trump alumni to guide its effort, including former White House aides Stephen Miller and Hope Hicks, and the McCormicks’ private lobbying has included a separate dinner with Donald Trump Jr., according to people told of the meal.",
    "author": "Shane Goldmacher",
    "title": "Dr. Oz’s heritage is targeted as rivals vie for Trump backing"
  },
  {
    "id": 3188,
    "mediaId": 2679,
    "date": "2022-03-18",
    "sentence": "Late last year, before he had formally entered the Pennsylvania Senate race, David McCormick flew to Florida for a private meeting with Donald Trump, angling to get in the former president’s good graces before a Republican primary that would soon pit him against Dr. <span class='selected-term'>Mehmet Oz</span>, a celebrity surgeon and television personality.",
    "author": "Shane Goldmacher",
    "title": "Dr. Oz’s heritage is targeted as Pennsylvania rivals vie for Trump backing"
  },
  {
    "id": 2915,
    "mediaId": 2716,
    "date": "2022-03-18",
    "sentence": "\"Republican Pennsylvania Senate hopeful Dr. <span class='selected-term'>Mehmet Oz</span> said yesterday that he would renounce his dual Turkish citizenship if he gets elected.",
    "author": "Peter Weber",
    "title": "Late night hosts drink in St. Patrick's Day, spit out Russia's U.S. propagandists, picture Putin sans botox"
  },
  {
    "id": 3382,
    "mediaId": 2716,
    "date": "2022-03-18",
    "sentence": "the other big endorsement\nIt looks like daytime-host-turned-Senate-candidate Dr. <span class='selected-term'>Mehmet Oz</span> has a friend in Melania Trump, sources familiar with the former first lady's thinking told NBC News.",
    "author": "Brigid Kennedy",
    "title": "Melania Trump has reportedly 'let the president know' she likes Senate candidate Dr. Oz"
  },
  {
    "id": 3344,
    "mediaId": 2630,
    "date": "2022-03-18",
    "sentence": "In Pennsylvania’s shadow Republican primary to score a Donald Trump endorsement, celebrity doctor <span class='selected-term'>Mehmet Oz</span> has the support of the ultimate insider: former first lady Melania Trump, according to sources familiar with her views on the race.",
    "author": "",
    "title": "Dr. Oz has a fan at Mar-a-Lago: Melania Trump"
  },
  {
    "id": 3161,
    "mediaId": 3993,
    "date": "2022-03-18",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> continues to show surprisingly strong poll numbers in his bid for the Republican nomination for the U.S. Senate seat currently held by Pat Toomey, especially for a guy who may or may not live in the state and has long taken positions on the Second Amendment that are far more in line with anti-gun activists.",
    "author": "Cam Edwards",
    "title": "Dr. Oz says he didn't write pro-gun control columns bearing his name"
  },
  {
    "id": 2187,
    "mediaId": 2644,
    "date": "2022-03-19",
    "sentence": "They are a disgraceful publication.”\n“This is just another example of the media being quick to silence anything that would shine a light on the corrupt Biden family,” Dr. <span class='selected-term'>Mehmet Oz</span>, a leading GOP Pennsylvania Senate candidate, told The Post.",
    "author": "Jon Levine",
    "title": "Republicans demand new probe into Hunter Biden laptop, coverup"
  },
  {
    "id": 2649,
    "mediaId": 2528,
    "date": "2022-03-20",
    "sentence": "Former President Donald Trump poses for photos with David McCormick at the Trump National Golf Club Bedminster clubhouse, Sunday, Nov. 20, 2016, in Bedminster, N.J. <span class='selected-term'>Mehmet Oz</span> speaks at a town hall-style event at the Newtown Athletic Club, Feb. 20, 2022, in Newtown, Pa. AP Photo/Carolyn Kaster and AP Photo/Marc Levy\nDr. Mehmet Oz and David McCormick are running in Pennsylvania's GOP Senate primary.",
    "author": "Sarah Al-Arshani",
    "title": "Dr. Oz's primary challenger and his wife said in meeting with Trump that Oz's Muslim background was a liability: NYT report"
  },
  {
    "id": 2059,
    "mediaId": 2732,
    "date": "2022-03-20",
    "sentence": "He called out Republican Senate candidate <span class='selected-term'>Mehmet Oz</span>, former host of the “Dr.",
    "author": "Ryan Deto",
    "title": "Democratic Senate candidates square off in political forum at CMU"
  },
  {
    "id": 1937,
    "mediaId": 2522,
    "date": "2022-03-20",
    "sentence": "This includes the media:\n“This is just another example of the media being quick to silence anything that would shine a light on the corrupt Biden family,” GOP Pennsylvania Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> told the Post.",
    "author": "Vivek Saxena",
    "title": "Growing chorus of Republicans say Congress must initiate probe into Hunter Biden laptop, coverup"
  },
  {
    "id": 2430,
    "mediaId": 2862,
    "date": "2022-03-20",
    "sentence": "The idea that the laptop story was invented by Russia was also backed by numerous US intelligence officials, both former and current, according to several media reports.One of the leading Republican candidates in a race for a Pennsylvania Senate seat, Dr <span class='selected-term'>Mehmet Oz</span>, also vowed to back the initiative to probe the silencing of the story about Hunter Biden in 2020, if he wins election in the 2022 midterms.",
    "author": "Tim Korso",
    "title": "US Republicans Call for Congressional Probe Into Media, Big Tech Over Silencing Hunter Laptop Story"
  },
  {
    "id": 2051,
    "mediaId": 2641,
    "date": "2022-03-20",
    "sentence": "Republican Pennsylvania Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> told The Post that \"this is just another example of the media being quick to silence anything that would shine a light on the corrupt Biden family.",
    "author": "Brian Freeman",
    "title": "Republicans Demand New Probe Into Hunter Biden Following NYT Story"
  },
  {
    "id": 2122,
    "mediaId": 2526,
    "date": "2022-03-21",
    "sentence": "In the Senate, Republicans look to retain an open seat with likely Republican primary candidate David McCormick leading in the polls against <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Wendell Husebø",
    "title": "Poll: Joe Biden’s Approval Rating Is 36 Percent, Impacting Battleground States"
  },
  {
    "id": 2281,
    "mediaId": 2602,
    "date": "2022-03-21",
    "sentence": "“American Leadership Action” was established to back the candidacy of <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "author": "RON KAMPEAS/JTA",
    "title": "AIPAC’s pro-democracy ‘super PAC’ does not mention Israel in its mission"
  },
  {
    "id": 2574,
    "mediaId": 4018,
    "date": "2022-03-21",
    "sentence": "“American Leadership Action” was established to back the candidacy of <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "author": "Ron Kampeas",
    "title": "AIPAC’s pro-democracy ‘super PAC’ does not mention Israel in its mission"
  },
  {
    "id": 1849,
    "mediaId": 2658,
    "date": "2022-03-21",
    "sentence": "It found Fetterman initially leading celebrity doctor <span class='selected-term'>Mehmet Oz</span> by 9 percentage points, while Lamb was ahead by 3.",
    "author": "",
    "title": "Super PAC signals Pennsylvania primary could get rough"
  },
  {
    "id": 2425,
    "mediaId": 2659,
    "date": "2022-03-22",
    "sentence": "While delivering a private speech as part of his “American Freedom” tour in Florida this weekend, Trump asked the crowd what they thought about GOP candidate <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Jason Easley",
    "title": "Trump Is Hinting At Meddling And Handing The Pennsylvania Senate Seat To Democrats By Supporting Dr. Oz"
  },
  {
    "id": 1865,
    "mediaId": 2550,
    "date": "2022-03-22",
    "sentence": "PA-Sen: Self-funding attorney George Bochetto's new commercial for the May Republican primary is entirely devoted to attacking TV personality <span class='selected-term'>Mehmet Oz</span> for his \"pro-abortion views.\"",
    "author": "",
    "title": "Morning Digest: The top GOP candidate to run Nevada's elections is an antisemitic Big Lie proponent"
  },
  {
    "id": 1982,
    "mediaId": 2727,
    "date": "2022-03-22",
    "sentence": "“American Leadership Action” was established to back the candidacy of <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "author": "Ron Kampeas",
    "title": "Israel not mentioned in AIPAC’s new pro-democracy project"
  },
  {
    "id": 1957,
    "mediaId": 2570,
    "date": "2022-03-22",
    "sentence": "Also in attendance was <span class='selected-term'>Mehmet Oz</span>, the TV personality running for Senate in Pennsylvania.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: Ginni Thomas’ Campaign Contributions, Lawmakers’ Mar-A-Lago Visits"
  },
  {
    "id": 2642,
    "mediaId": 2771,
    "date": "2022-03-22",
    "sentence": "“American Leadership Action” was established to back the candidacy of <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "author": "Ron Kampeas",
    "title": "Fast ForwardAIPAC’s pro-democracy ‘super PAC’ does not mention Israel in its mission"
  },
  {
    "id": 2495,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "",
    "author": "Adam Wollner",
    "title": "Where Donald Trump went wrong with his 2022 endorsements"
  },
  {
    "id": 2456,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "Herschel Walker and <span class='selected-term'>Mehmet Oz</span>, who are now Republican Senate candidates in Georgia and Pennsylvania, respectively, were appointed in 2018 by President Donald Trump to serve on the council.",
    "author": "Donald Judd and Maegan Vazquez",
    "title": "Biden requests Mehmet Oz and Herschel Walker resign from presidential council or be terminated"
  },
  {
    "id": 2540,
    "mediaId": 2631,
    "date": "2022-03-23",
    "sentence": "The Biden administration threatened Wednesday to remove Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile GOP Senate candidates.",
    "author": "Zoë Richards",
    "title": "White House moves to oust Dr. Oz and Herschel Walker from presidential advisory panel"
  },
  {
    "id": 2733,
    "mediaId": 2702,
    "date": "2022-03-23",
    "sentence": "",
    "author": "",
    "title": "The Hill’s Morning Report – Jackson fends off attacks; Biden to Europe"
  },
  {
    "id": 2522,
    "mediaId": 2621,
    "date": "2022-03-23",
    "sentence": "The White House sent Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker letters demanding their resignations from the President’s Council on Sports, Fitness & Nutrition, and informed the U.S. Senate candidates from Pennsylvania and Georgia respectively that if they do not resign by 6 p.m. Wednesday they will be “terminated.”\nUnder the Hatch Act, Oz and Walker are considered special government employees who “may not be candidates in partisan elections” while engaged in official government business.",
    "author": "Michael Luciano",
    "title": "Joe Biden Just Fired Dr. Oz – Yes, Really"
  },
  {
    "id": 2482,
    "mediaId": 2702,
    "date": "2022-03-23",
    "sentence": "President Biden has asked Republican Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to quit their positions on a presidential council or be removed.",
    "author": "Lexi Lonas",
    "title": "Biden asks Herschel Walker and Mehmet Oz to quit council or be ousted"
  },
  {
    "id": 2278,
    "mediaId": 6497,
    "date": "2022-03-23",
    "sentence": "The Biden administration is seeking the formal resignations of TV personality Dr. <span class='selected-term'>Mehmet Oz</span> and former NFL star Herschel Walker from the President’s Council on Sports, Fitness & Nutrition, warning that failure to quit the posts would lead to termination.",
    "author": "Abid Rahman",
    "title": "Biden Administration Seeks Resignations of Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 1992,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "\"To make matters worse, a poll recently commissioned by Lamb’s own super PAC showed his main Democratic opponent — John Fetterman — not just beating him in a primary where the more liberal candidate often has more traction; polling showed Fetterman as the better candidate in a general election, against potential GOP nominees like Dr. <span class='selected-term'>Mehmet Oz</span>.\"",
    "author": "Matthew Chapman",
    "title": "Biden-snubbed Conor Lamb says 'the race is wide open' for Pennsylvania Senate — but is that what the numbers say?"
  },
  {
    "id": 2276,
    "mediaId": 2934,
    "date": "2022-03-23",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> has been outspoken about opposing defunding the police.",
    "author": "Robert Farley",
    "title": "Misleading ‘Defund the Police’ Attack on Dr. Oz"
  },
  {
    "id": 1902,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "— Geoff Bennett (@Geoff Bennett) 1648065806\nAt the same time, Biden reportedly asked for the resignation of a more controversial member of the council, Dr. <span class='selected-term'>Mehmet Oz</span>, a thoracic surgeon and medical talk show host first appointed to the advisory council by former President Donald Trump in 2018.",
    "author": "Matthew Chapman",
    "title": "Dr. Oz lashes out after Biden boots him off nutrition advisory panel and replaces him with Chef José Andrés"
  },
  {
    "id": 2581,
    "mediaId": 2524,
    "date": "2022-03-23",
    "sentence": "When Donald Trump was elected president by losing the popular vote to Hillary Clinton, he appointed Dr. <span class='selected-term'>Mehmet Oz</span> to the President's Council on Sports, Fitness & Nutrition.",
    "author": "Mark Frauenfelder",
    "title": "Nostrum peddler Dr. Mehmet Oz fired from President's Council on Sports, Fitness & Nutrition"
  },
  {
    "id": 2207,
    "mediaId": 2636,
    "date": "2022-03-23",
    "sentence": "On the Republican side, Dr. <span class='selected-term'>Mehmet Oz</span>, who became famous as a health guru on Oprah Winfrey’s show, is running against about a trillion other hopefuls.",
    "author": "",
    "title": "‘You Don’t Know Squat!’ and Other Signs of Our High-Minded Politics"
  },
  {
    "id": 2209,
    "mediaId": 2699,
    "date": "2022-03-23",
    "sentence": "To make matters worse, a poll recently commissioned by Lamb’s own super PAC showed his main Democratic opponent—John Fetterman—not just beating him in a primary where the more liberal candidate often has more traction; polling showed Fetterman as the better candidate in a general election, against potential GOP nominees like Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Ursula Perano",
    "title": "Will Fetterman Silence Lamb in Pennsylvania Senate Face-Off?"
  },
  {
    "id": 2546,
    "mediaId": 2776,
    "date": "2022-03-23",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nThe TV host then denounced Biden for being “petty” and “political” in his action, and assured he had “no intention” of resigning.",
    "author": "Cynthia Cook",
    "title": "Dr. Oz Claps Back After Joe Biden Fires Him From President’s Sports Council: Watch"
  },
  {
    "id": 2532,
    "mediaId": 2738,
    "date": "2022-03-23",
    "sentence": "pic.twitter.com/EP1vHWATp4\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 23, 2022\n“Clearly, Joe Biden can’t be around anyone who doesn’t completely fall in line with his fear-mongering authoritarian one-size-fits-all COVID handling,” Oz steamed on Twitter.",
    "author": "Matt Prigge",
    "title": "Dr. Oz Is Big Mad That He Was Asked To Quit His Presidential Council Post (Ditto Herschel Walker)"
  },
  {
    "id": 2558,
    "mediaId": 2574,
    "date": "2022-03-23",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> criticized Trump-era trade policies toward Beijing in an interview on Chinese state TV.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Criticized Trump’s China Trade Policy in Interview With CCP Media"
  },
  {
    "id": 1954,
    "mediaId": 3997,
    "date": "2022-03-23",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> criticized Trump-era trade policies toward Beijing in an interview on Chinese state TV.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Criticized Trump’s China Trade Policy in Interview With CCP Media"
  },
  {
    "id": 2577,
    "mediaId": 2695,
    "date": "2022-03-23",
    "sentence": "The doctor he should ask to resign is Dr. Fauci, for a multitude of obvious reasons.pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@Dr. Mehmet Oz) 1648080535\nOz is running for a U.S. Senate seat in Pennsylvania, while Walker is running for a U.S. Senate seat in Georgia — both men are slated to compete in Republican primaries this May.",
    "author": "Alex Nitzberg",
    "title": "White House ousts Dr. Mehmet Oz and Herschel Walker from President's Council on Sports, Fitness & Nutrition"
  },
  {
    "id": 2164,
    "mediaId": 3997,
    "date": "2022-03-23",
    "sentence": "",
    "author": "",
    "title": "Back to CR"
  },
  {
    "id": 2500,
    "mediaId": 6509,
    "date": "2022-03-23",
    "sentence": "The Biden administration on Wednesday threatened to remove <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile Senate GOP candidates.",
    "author": "",
    "title": "White House Moves to Oust Dr. Oz, Herschel Walker From Panel as They Run for Office"
  },
  {
    "id": 2327,
    "mediaId": 2522,
    "date": "2022-03-24",
    "sentence": "(Video Credit: Fox News )\nPresident Joe Biden sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker on Wednesday demanding that they resign from the President’s Council on Sports, Fitness & Nutrition or they would be terminated, citing violations of the Hatch Act because they are running for office.",
    "author": "Terresa Monroe-Hamilton",
    "title": "Joe Biden fires Dr. Oz and Herschel Walker on same day, demands resignation. Here’s the response."
  },
  {
    "id": 2136,
    "mediaId": 2641,
    "date": "2022-03-24",
    "sentence": "U.S. Senate candidates Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker on Wednesday were told to resign from the President's Council on Sports, Fitness and Nutrition or their positions would be \"terminated.\"",
    "author": "Charlie McCarthy",
    "title": "Biden Removes Dr. Oz, Herschel Walker From Fitness Council"
  },
  {
    "id": 1913,
    "mediaId": 2553,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\n“It’s against the Biden administration’s policy for federal candidates to serve on presidential boards, according to a White House official.",
    "author": "Dillon Burroughs",
    "title": "Biden Dropping Dr. Oz From Presidential Council"
  },
  {
    "id": 2367,
    "mediaId": 2543,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the Biden administration notified former football star Herschel Walker and celebrity physician Dr. <span class='selected-term'>Mehmet Oz</span> that they could either resign from the council or be fired, according to NBC News.",
    "author": "Jack Davis",
    "title": "Biden Demands Herschel Walker and Dr. Oz Quit Presidential Advisory Council or Be Ousted"
  },
  {
    "id": 2105,
    "mediaId": 2641,
    "date": "2022-03-24",
    "sentence": "Walker and Dr. <span class='selected-term'>Mehmet Oz</span>, who is running for an open Senate seat in Pennsylvania, received letters Wednesday from Gautam Raghaven, assistant to President Joe Biden, telling them to resign or be fired from the council.",
    "author": "Charlie McCarthy",
    "title": "Herschel Walker: Biden Afraid of My Senate Run"
  },
  {
    "id": 2196,
    "mediaId": 2720,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the Biden administration notified former football star Herschel Walker and celebrity physician Dr. <span class='selected-term'>Mehmet Oz</span> that they could either resign from the council or be fired, according to NBC News.",
    "author": "Jack Davis",
    "title": "Biden Demands Herschel Walker and Dr. Oz Quit Presidential Advisory Council or Be Ousted"
  },
  {
    "id": 2544,
    "mediaId": 2593,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the Biden administration notified former football star Herschel Walker and celebrity physician Dr. <span class='selected-term'>Mehmet Oz</span> that they could either resign from the council or be fired, according to NBC News.",
    "author": "Jack Davis",
    "title": "Biden Demands Herschel Walker and Dr. Oz Quit Presidential Advisory Council or Be Ousted"
  },
  {
    "id": 2115,
    "mediaId": 2748,
    "date": "2022-03-24",
    "sentence": "The White House requested for Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker to resign from the President's Council on Sports, Fitness & Nutrition on Wednesday, or else face termination, according to CNN.",
    "author": "STATION GOSSIP",
    "title": "White House ousts Dr. Mehmet Oz and Herschel Walker from President's Council on Sports, Fitness & Nutrition"
  },
  {
    "id": 2126,
    "mediaId": 2641,
    "date": "2022-03-24",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, who is running for the U.S. Senate in Pennsylvania as a Republican, told Newsmax on Thursday that he was asked a day earlier by the White House to resign or face termination from his position on the President's Council on Sports, Fitness, & Nutrition.",
    "author": "Luca Cacciatore",
    "title": "Dr. Oz to Newsmax: Removal From WH Fitness Council Politically Motivated"
  },
  {
    "id": 2578,
    "mediaId": 2721,
    "date": "2022-03-24",
    "sentence": "In 2018, former President Donald Trump appointed television personality Dr. <span class='selected-term'>Mehmet Oz</span> and professional athlete Herschel Walker to the President’s Council on Sports, Fitness and Nutrition.",
    "author": "",
    "title": "Biden threatened to fire… who!?"
  },
  {
    "id": 2473,
    "mediaId": 2601,
    "date": "2022-03-24",
    "sentence": "Oz has made millions of dollars in China from his television show and his health sponsorship deals\nWFB: Dr. <span class='selected-term'>Mehmet Oz</span> criticized Trump-era trade policies toward Beijing in an interview on Chinese state TV.",
    "author": "MJA",
    "title": "Dr. Oz Criticized Trump’s China Trade Policy in Interview With CCP Media"
  },
  {
    "id": 1899,
    "mediaId": 2724,
    "date": "2022-03-24",
    "sentence": "Recently, Biden asked Republican Senate candidates, former NFL running back Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span>, to step down from the President’s Council on Sports, Fitness & Nutrition or be taken off the Council or be fired.",
    "author": "Becky Noble",
    "title": "Republican Senate Candidate Herschel Walker Ousted From President’s Council On Sports, Fitness & Nutrition"
  },
  {
    "id": 2323,
    "mediaId": 2919,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nOz also used the video to levy an attack against Dr. Anthony Fauci, a White House medical adviser and the director of the National Insitute for Allergies and Infectious Diseases.",
    "author": "Alex Hider",
    "title": "Biden asks Dr. Oz, Herschel Walker to resign from presidential fitness council"
  },
  {
    "id": 2041,
    "mediaId": 2590,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nWalker, the Trump-endorsed front-runner in the GOP contest to challenge Sen. Raphael Warnock (D-Ga.) in November, recently questioned the science of evolution.",
    "author": "Josephine Harvey",
    "title": "White House Removes Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 2614,
    "mediaId": 2528,
    "date": "2022-03-24",
    "sentence": "President Joe Biden's administration sent letters to television personality Dr. <span class='selected-term'>Mehmet Oz</span> and former NFL player Herschel Walker Wednesday, asking them to resign from the President's Council on Sports, Fitness & Nutrition or be terminated by the end of the day.",
    "author": "Lauren Frias",
    "title": "Biden asked Dr. Oz and Herschel Walker to resign from a presidential council or be terminated"
  },
  {
    "id": 2045,
    "mediaId": 2658,
    "date": "2022-03-24",
    "sentence": "The White House asked <span class='selected-term'>Mehmet Oz</span> and Herschel Walkerto resign from the President’s Council on Sports, Fitness & Nutrition.",
    "author": "",
    "title": "POLITICO Playbook: Biden in Europe, WMD fears at center stage"
  },
  {
    "id": 1884,
    "mediaId": 2658,
    "date": "2022-03-24",
    "sentence": "The administration asked <span class='selected-term'>Mehmet Oz</span> to resign from the President’s Council on Sports, Fitness & Nutrition.",
    "author": "",
    "title": "Officials say fourth doses are coming ... if they can buy them"
  },
  {
    "id": 2384,
    "mediaId": 2619,
    "date": "2022-03-24",
    "sentence": "President Joe Biden has cut Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span> from advisory roles with the President’s Council on Sports, Fitness & Nutrition due to their current candidacies for the U.S. Senate.",
    "author": "Charles Passy",
    "title": "Biden brings onboard chef José Andrés after cutting Mehmet Oz and Herschel Walker from presidential fitness council"
  },
  {
    "id": 2153,
    "mediaId": 2740,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, according to reports by several media outlets.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: Should Russia be kicked out of the G-20?"
  },
  {
    "id": 2562,
    "mediaId": 2680,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV's host of “The Dr. Oz Show” — and former football star Herschel Walker from the President's Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "",
    "title": "Herschel Walker, Dr. Oz removed from Biden's sports council"
  },
  {
    "id": 2427,
    "mediaId": 2696,
    "date": "2022-03-24",
    "sentence": "WASHINGTON – The Biden administration requested the resignation of Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span> from the President’s Council on Sports, Fitness & Nutrition Wednesday night, saying they would be fired if they did not do so.",
    "author": "David Epstein",
    "title": "Elena Delle Donne, José Andrés to replace Herschel Walker and Dr. Oz on fitness council"
  },
  {
    "id": 2493,
    "mediaId": 2644,
    "date": "2022-03-24",
    "sentence": "President Biden this week urged Republican Senate candidates Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span> to leave their positions on the President’s Council on Sports, Fitness and Nutrition or face removal.",
    "author": "Callie Patteson",
    "title": "Biden tells GOP Senate candidates Walker, Oz to quit health council or be fired"
  },
  {
    "id": 2592,
    "mediaId": 2518,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "The Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from president’s fitness council"
  },
  {
    "id": 2099,
    "mediaId": 2740,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, a White House official said.",
    "author": "Rick Rouan",
    "title": "Biden asks GOP Senate candidates Mehmet Oz, Herschel Walker to resign from presidential board"
  },
  {
    "id": 2292,
    "mediaId": 2550,
    "date": "2022-03-24",
    "sentence": "Just as President Joe Biden has reportedly asked GOP Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their posts on the President’s Council on Sports, Fitness & Nutrition, Biden has announced his intent to appoint their replacements.",
    "author": "Rebekah Sager",
    "title": "You’re fired! Biden gives Dr. Oz the boot and appoints José Andrés to presidential council"
  },
  {
    "id": 2629,
    "mediaId": 2728,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "The Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 2462,
    "mediaId": 2521,
    "date": "2022-03-24",
    "sentence": "‘Replying to@NoLieWithBTC’\nThis is one of the reasons Walker was fired:\n‘The Biden Admin also asked GA Senate candidate Hershel Walker to resign from the WH fitness and nutrition council as well because it’s against their policy for Federal candidates to serve on presidential boards.’\n‘President Joe Biden has asked Republican Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their respective positions on a presidential council, or face removal.’\n‘[E]ven if he becomes Senator Oz.",
    "author": "Gloria Christie",
    "title": "Joe Biden Shows Dr. Oz & Herschel Walker The Door"
  },
  {
    "id": 2414,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "",
    "title": "The Hill’s Morning Report – Tensions rise at Jackson hearing"
  },
  {
    "id": 2266,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "",
    "title": "NATO summit to address Russia’s invasion of Ukraine underway"
  },
  {
    "id": 2139,
    "mediaId": 2718,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nIf President Biden wants to politicize health, he will have to fire me.",
    "author": "Andi Ortiz",
    "title": "Biden Boots Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 2575,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Brett Samuels",
    "title": "US announces sanctions on Russian lawmakers, defense companies"
  },
  {
    "id": 2388,
    "mediaId": 2640,
    "date": "2022-03-24",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> and former NFL star Herschel Walker were told in emails Wednesday that they would be \"terminated\" if they didn't resign from the President’s Council on Sports, Fitness & Nutrition by the end of the day, NBC reports.",
    "author": "Rob Quinn",
    "title": "White House Orders Dr. Oz to Quit Presidential Panel"
  },
  {
    "id": 2264,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Harper Neidig",
    "title": "Trump lawyer urges appeals court to block House from getting tax returns"
  },
  {
    "id": 2417,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Cate Martel",
    "title": "The Hill’s 12:30 Report – US intensifies Russian sanctions, accepts 100K Ukrainian refugees"
  },
  {
    "id": 1905,
    "mediaId": 2732,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nThe White House on Wednesday posted two new appointments to the council, while a White House official said Oz and Walker were asked to resign because the White House doesn’t permit candidates for federal office to serve on boards.",
    "author": "Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from Biden's sports council"
  },
  {
    "id": 2137,
    "mediaId": 2570,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Derek Saul",
    "title": "Georgia Senate Candidate Herschel Walker Refuses To Resign From Presidential Council"
  },
  {
    "id": 2742,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Alex Gangitano",
    "title": "Biden ‘hopeful’ China won’t help Russia"
  },
  {
    "id": 2370,
    "mediaId": 2592,
    "date": "2022-03-24",
    "sentence": "The White House requested Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, who are now Republican Senate candidates in Pennsylvania and Georgia, respectively, to step down from their positions as the administration forbids federal candidates to be members of presidential boards.",
    "author": "Joseph Gobran",
    "title": "Dr. Oz And Herschel Walker Asked By White House To Step Down Or Be Fired, Both Were Trump Appointees"
  },
  {
    "id": 2566,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Alex Gangitano",
    "title": "Biden has sharp response to reporter: ‘You’re playing a game with me’"
  },
  {
    "id": 2615,
    "mediaId": 2514,
    "date": "2022-03-24",
    "sentence": "HARRISBURG, Pa. (AP) — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV's host of “The Dr. Oz Show” — and former football star Herschel Walker from the President's Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "",
    "title": "Herschel Walker, Dr. Oz removed from Biden's sports council"
  },
  {
    "id": 1901,
    "mediaId": 2594,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to <span class='selected-term'>Mehmet Oz</span>, popularly known as the TV host Dr Oz, as well as Herschel Walker of Georgia; both men are pursuing bids for the Senate in hotly-contested races in their respective states while simultaneously serving as advisers on the largely honorary White House council.",
    "author": "John Bowden",
    "title": "Controversial GOP candidate Mehmet Oz fired after refusing to quit president’s council on sports"
  },
  {
    "id": 1904,
    "mediaId": 6526,
    "date": "2022-03-24",
    "sentence": "HARRISBURG — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV’s host of “The Dr. Oz Show” and a candidate to replace Sen. Pat Toomey of Pennsylvania — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "Associated Press",
    "title": "Pennsylvania Senate candidate Dr. Oz removed from President’s Sports Council; he and Herschel Walker ousted because they are running for office"
  },
  {
    "id": 2580,
    "mediaId": 2560,
    "date": "2022-03-24",
    "sentence": "Harrisburg, Pa. – The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> – best known as daytime TV’s host of “The Dr. Oz Show” – and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "Associated Press",
    "title": "Herschel Walker, Dr. Oz removed from Biden’s sports council"
  },
  {
    "id": 2193,
    "mediaId": 2584,
    "date": "2022-03-24",
    "sentence": "On Wednesday, the White House sent letters to Dr <span class='selected-term'>Mehmet Oz</span> and former football star Herschel Walker – two Republican Senate candidates in Pennsylvania and Georgia, respectively – asking them to submit their resignations or face termination.",
    "author": "Maya Yang",
    "title": "White House tells Dr Oz and Herschel Walker to resign from fitness council"
  },
  {
    "id": 2262,
    "mediaId": 2632,
    "date": "2022-03-24",
    "sentence": "The Biden administration on Wednesday threatened to remove <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile Senate GOP candidates.",
    "author": "",
    "title": "White House Moves to Oust Dr. Oz, Herschel Walker From Panel as They Run for Office"
  },
  {
    "id": 2314,
    "mediaId": 2752,
    "date": "2022-03-25",
    "sentence": "This is truly a smart and good meme, because Dr. <span class='selected-term'>Mehmet Oz</span> sold good patriotic lifesaving snake oil on the Oprah Winfrey show, while Dr. Fauci tyrannically asked Americans to get vaccinated against a deadly pandemic and to wear masks on their faces, which liberty-loving human beings simply cannot do.",
    "author": "Doktor Zoom",
    "title": "Biden Shitcans Jerk GOP Losers From Fitness Council And They Will Not Shut Up"
  },
  {
    "id": 2496,
    "mediaId": 6704,
    "date": "2022-03-25",
    "sentence": "President Joe Biden asked former NFL running back Herschel Walker and TV personality <span class='selected-term'>Mehmet Oz</span>, M.D., to step down from their positions on the President’s Council on Sports, Fitness, and Nutrition.",
    "author": "",
    "title": "Some federal employees can run for political office under the Hatch Act"
  },
  {
    "id": 2285,
    "mediaId": 2518,
    "date": "2022-03-25",
    "sentence": "• The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> -- best known as daytime TV's host of \"The Dr. Oz Show\" -- and former football star Herschel Walker from the President's Council on Sports, Nutrition and Fitness as both men run for U.S. Senate seats.",
    "author": "The Associated Press",
    "title": "Names and faces"
  },
  {
    "id": 2453,
    "mediaId": 2747,
    "date": "2022-03-25",
    "sentence": "President Joe Biden asked former NFL running back Herschel Walker and TV personality <span class='selected-term'>Mehmet Oz</span>, M.D., to step down from their positions on the President’s Council on Sports, Fitness, and Nutrition.",
    "author": "",
    "title": "Some federal employees can run for political office under the Hatch Act"
  },
  {
    "id": 2743,
    "mediaId": 2553,
    "date": "2022-03-25",
    "sentence": "",
    "author": "Amanda Prestigiacomo",
    "title": "Herschel Walker’s Son Rips Biden For Firing His Dad From Fitness Council: Who’s Gonna Replace Him, Lia Thomas?"
  },
  {
    "id": 2109,
    "mediaId": 2641,
    "date": "2022-03-25",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> said Friday that he won't quit fighting over his position on the President's Council on Sports, Fitness, and Nutrition, telling Newsmax that if he is elected to represent Pennsylvania as a senator, he and NFL great Herschel Walker, who was also fired from the council, will fight back against politically-motivated firings.",
    "author": "Sandy Fitzgerald",
    "title": "Dr. Oz to Newsmax: Will Keep Fighting After Dismissal From Fitness Council"
  },
  {
    "id": 2107,
    "mediaId": 2641,
    "date": "2022-03-25",
    "sentence": "“Nearly every city has a weather network or allergy association that monitors the pollen and smog indexes,” says Wylde, who has been featured in interviews with international experts such as Dr. <span class='selected-term'>Mehmet Oz</span> and Dr. Sanjay Gupta.",
    "author": "Lynn Allison",
    "title": "Why Seasonal Allergies Will Be Worse This Spring"
  },
  {
    "id": 2222,
    "mediaId": 2522,
    "date": "2022-03-26",
    "sentence": "(Video: NewsMax)\nHerschel Walker echoed the sentiments of Dr. <span class='selected-term'>Mehmet Oz</span> this week when he responded to President Joe Biden’s demand that he step down from the President’s Council on Sports, Fitness & Nutrition over Hatch Act violation concerns, stating simply, “I’m not a quitter.”\nWalker, a Republican candidate for U.S. Senate from Georgia, has had a storied career in sports competing in the NFL and the Olympics representing the United States.",
    "author": "Kevin Haggerty",
    "title": "Herschel Walker on Biden demanding resignation: ‘I’m not a quitter so you’re gonna have to fire me’"
  },
  {
    "id": 2491,
    "mediaId": 2872,
    "date": "2022-03-27",
    "sentence": "I talked to <span class='selected-term'>Mehmet Oz</span> — a.k.a Dr. Oz, host of The Dr. Oz Show— about how to adopt healthier habits now so you can feel more confident in your body’s ability to fight off colds, flus, and anything else this winter.",
    "author": "Tracey Anne Duncan",
    "title": "5 things you can do right now to strengthen your immune system for winter"
  },
  {
    "id": 2455,
    "mediaId": 2644,
    "date": "2022-03-27",
    "sentence": "Oz road\nBesides Florida’s rotted oranges and potted seniors, Pepe Fanjul gave a fund-raiser at his Palm Beach farm for <span class='selected-term'>Mehmet Oz</span> who’s running off TV and onto Pennsylvania’s Senate race.",
    "author": "Cindy Adams",
    "title": "The aging Oscars showcase talent and major egos"
  },
  {
    "id": 1908,
    "mediaId": 2570,
    "date": "2022-03-27",
    "sentence": "But <span class='selected-term'>Mehmet Oz</span>, MD, still brought up Fauci in response to the Biden Administration asking both him and Herschel Walker to resign from the Council.",
    "author": "Bruce Y. Lee",
    "title": "Dr. Mehmet Oz Asked To Resign From President’s Council, Brings Up Dr. Fauci Again"
  },
  {
    "id": 1936,
    "mediaId": 2822,
    "date": "2022-03-28",
    "sentence": "",
    "author": "JOSH BOAK",
    "title": "Biden's budget plan: Higher taxes on rich, lower deficits, more money for police, education"
  },
  {
    "id": 2443,
    "mediaId": 2890,
    "date": "2022-03-28",
    "sentence": "“Biden’s reckless spending caused inflation,” Republican Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> said in a recent campaign ad.",
    "author": "Li Zhou",
    "title": "What Biden is really saying in his new budget"
  },
  {
    "id": 2241,
    "mediaId": 2641,
    "date": "2022-03-28",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> wrote President Joe Biden to say he would not resign from the President's Council on Sports, Fitness and Nutrition despite being ordered to do so.",
    "author": "Charlie McCarthy",
    "title": "Dr. Oz Refuses to Resign From Fitness Council"
  },
  {
    "id": 2441,
    "mediaId": 6428,
    "date": "2022-03-28",
    "sentence": "Former talk show host Dr. <span class='selected-term'>Mehmet Oz</span> is also in the race and has name recognition.",
    "author": "David Brody",
    "title": "'Grateful to God': Senate Candidate Kathy Barnette's Miraculous Story of Purpose and Value"
  },
  {
    "id": 1947,
    "mediaId": 3997,
    "date": "2022-03-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> coauthored a book touting the benefits of traditional Chinese medicine with the head of a Beijing university controlled by the Chinese Communist Party.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Promoted Controversial Medicine in Book Written With CCP-Backed Academic"
  },
  {
    "id": 2480,
    "mediaId": 2574,
    "date": "2022-03-29",
    "sentence": "On the Republican side, combat veteran and former hedge fund executive David McCormick leads celebrity doctor <span class='selected-term'>Mehmet Oz</span> by 6 points, a March Washington Free Beacon poll shows.",
    "author": "Collin Anderson",
    "title": "‘Moderate’ Conor Lamb Paid BLM-Linked Firm Hundreds of Thousands of Dollars"
  },
  {
    "id": 2466,
    "mediaId": 2574,
    "date": "2022-03-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> coauthored a book touting the benefits of traditional Chinese medicine with the head of a Beijing university controlled by the Chinese Communist Party.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Promoted Controversial Medicine in Book Written With CCP-Backed Academic"
  },
  {
    "id": 2631,
    "mediaId": 2748,
    "date": "2022-03-29",
    "sentence": "Lexi Lonas from The Hill reports, President Biden has asked Republican Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to quit their positions on a presidential council or be removed.",
    "author": "IWB",
    "title": "Biden Tells These Two GOP Senate Candidates To Quit Presidential Council Or Be Fired"
  },
  {
    "id": 1964,
    "mediaId": 2526,
    "date": "2022-03-29",
    "sentence": "#EndTheBan https://t.co/iFDGMG7fI5 pic.twitter.com/lZdMXW5zLC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 14, 2018\nThis latest claim about his columns seems to have been invented by his U.S. Senate campaign when he needed an excuse to get out of the political liability of having written these intensely unpopular views—but when it was convenient to his public image as a celebrity doctor friendly with the American political left, Oz celebrated his column.",
    "author": "Matthew Boyle",
    "title": "Busted: Mehmet Oz’s Claims He Did Not Write Gun Control Columns Disintegrate"
  },
  {
    "id": 1860,
    "mediaId": 2526,
    "date": "2022-03-29",
    "sentence": "Celebrity Doctor <span class='selected-term'>Mehmet Oz</span>, candidate for U.S. Senate in Pennsylvania, reportedly co-authored a book with the head of a university controlled by the Chinese Communist Party (CCP), which touted the benefits of traditional Chinese medicine that has seen pushback in the West over the years.",
    "author": "Jacob Bliss",
    "title": "Report: Mehmet Oz Co-Authored Book Touting Controversial Medicine With CCP-Backed Academic"
  },
  {
    "id": 2590,
    "mediaId": 2701,
    "date": "2022-03-29",
    "sentence": "“Now all of a sudden [it] is the first question in their multiple choice.”\nNo representatives for daytime television star Dr. <span class='selected-term'>Mehmet Oz</span> or Montgomery County real estate developer Jeff Bartos, who are also candidates in the race, responded to The Federalist’s inquiries.",
    "author": "Tristan Justice",
    "title": "5 Pennsylvania GOP Senate Candidates Refuse Philadelphia Inquirer’s Grossly Biased Survey, Torch Paper As A ‘Biased’ ‘Rag’"
  },
  {
    "id": 2090,
    "mediaId": 2664,
    "date": "2022-03-29",
    "sentence": "I am proud of my service and will not resign.pic.twitter.com/EP1vHWATp4\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@Dr. Mehmet Oz) 1648071503\nA recent Fox News poll shows Oz trailing David McCormick in the Republican primary, 24-15 percent, after having enjoyed a lead in the race shortly after announcing his candidacy.",
    "author": "Timothy Evans",
    "title": "Dr. Oz faces backlash from 'furious' longtime staffers after laying them off without warning"
  },
  {
    "id": 2198,
    "mediaId": 2512,
    "date": "2022-03-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> has been a fixture on television for the past 13 years, ever since Oprah began featuring him as a guest on her talk show.",
    "author": "Timothy Evans",
    "title": "Dr. Oz's TV staffers say he 'blindsided everyone' when he abruptly fired them to run for Senate"
  },
  {
    "id": 2744,
    "mediaId": 6704,
    "date": "2022-03-30",
    "sentence": "February 2022 fact-checks from AFP and Politifact identified CBD gummy ads using the names of Baptist pastor Charles Stanley, TV evangelists Joel Olsteen and Pat Robertson, former Shark Tank contestants Donna and Rosy Khalife, neurosurgeon and CNN medical correspondent Dr. Sanjay Gupta, actor Kevin Costner, and celebrity surgeon and U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "No, Mayim Bialik is not endorsing CBD gummies"
  },
  {
    "id": 1870,
    "mediaId": 2550,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> is very famous for monetizing the promotion of dodgy cures—so much so that he got himself hauled in front of a Senate health committee to explain himself, and it didn't go very well.",
    "author": "Hunter\nDaily Kos Staff",
    "title": "Republicans begin to abandon debates, just as they've abandoned moderates (and common sense)"
  },
  {
    "id": 2619,
    "mediaId": 6570,
    "date": "2022-03-30",
    "sentence": "The two Republican frontrunners in the U.S. Senate race in Pennsylvania — <span class='selected-term'>Mehmet Oz</span> and David McCormick — appeared on stage for the first time Wednesday morning alongside two of their opponents, trading jabs and name-dropping in the at-times heated forum.",
    "author": "",
    "title": "Republican frontrunners in Pa.'s U.S. Senate race trade barbs at Erie forum"
  },
  {
    "id": 2387,
    "mediaId": 2680,
    "date": "2022-03-30",
    "sentence": "",
    "author": "MARC LEVY",
    "title": "Forum gets tense in GOP's sharp-elbowed US Senate primary"
  },
  {
    "id": 1965,
    "mediaId": 2644,
    "date": "2022-03-30",
    "sentence": "Republican US Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> was fired from the President’s Council on Sports, Fitness and Nutrition, about a week after the White House asked him to resign.",
    "author": "Jesse O’Neill",
    "title": "It’s Terminal: Dr. Oz fired from presidential council amid GOP Senate run"
  },
  {
    "id": 2086,
    "mediaId": 2740,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, a candidate for U.S. senator and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Chelsey Cox",
    "title": "Senate candidate and TV host Dr. Oz removed from presidential fitness council"
  },
  {
    "id": 2521,
    "mediaId": 2732,
    "date": "2022-03-30",
    "sentence": "",
    "author": "Associated Press",
    "title": "Forum gets tense in GOP's sharp-elbowed U.S. Senate primary"
  },
  {
    "id": 2211,
    "mediaId": 2732,
    "date": "2022-03-30",
    "sentence": "Republican Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> spoke at a campaign event in Canonsburg on Wednesday evening, highlighting his energy policies and taking questions about the legitimacy of the 2020 election.",
    "author": "Ryan Deto",
    "title": "Senate candidate Oz talks fracking support and election fraud at Canonsburg campaign event"
  },
  {
    "id": 2650,
    "mediaId": 2747,
    "date": "2022-03-30",
    "sentence": "February 2022 fact-checks from AFP and Politifact identified CBD gummy ads using the names of Baptist pastor Charles Stanley, TV evangelists Joel Olsteen and Pat Robertson, former Shark Tank contestants Donna and Rosy Khalife, neurosurgeon and CNN medical correspondent Dr. Sanjay Gupta, actor Kevin Costner, and celebrity surgeon and U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "No, Mayim Bialik is not endorsing CBD gummies"
  },
  {
    "id": 2672,
    "mediaId": 3993,
    "date": "2022-03-30",
    "sentence": "#EndTheBan https://t.co/iFDGMG7fI5 pic.twitter.com/lZdMXW5zLC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 14, 2018\nThis latest claim about his columns seems to have been invented by his U.S. Senate campaign when he needed an excuse to get out of the political liability of having written these intensely unpopular views—but when it was convenient to his public image as a celebrity doctor friendly with the American political left, Oz celebrated his column.",
    "author": "Tom Knighton",
    "title": "Dr. Oz's claims he didn't write anti-gun columns falls apart"
  },
  {
    "id": 1995,
    "mediaId": 2557,
    "date": "2022-03-30",
    "sentence": "pic.twitter.com/yLhKsZm9sl\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) November 30, 2021\nEXCLUSIVE: ‘Heartless’ Dr. Oz leaves longtime staffers jobless and depressed https://t.co/27Bq5ocjAR pic.twitter.com/S86qLGnkRK\n— Page Six (@PageSix) March 30, 2022\nTo get more information about this article, please visit Breitbart.",
    "author": "DML News App",
    "title": "REPORT: Dr. Oz longtime staffers say they were ‘blindsided’ after campaign announcement"
  },
  {
    "id": 2116,
    "mediaId": 2641,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, the longtime talk show host who's running for a Senate seat in Pennsylvania, said he's been formally fired by the White House from his role as a member of the President's Council on Sports, Fitness and Nutrition.",
    "author": "Newsmax Staff",
    "title": "Dr. Oz Formally Fired by Biden White House"
  },
  {
    "id": 2026,
    "mediaId": 2641,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for the U.S. Senate in Pennsylvania, told Newsmax on Wednesday that the Democratic Party's Green New Deal agenda is \"a hoax, a fraud\" and \"can't be done in the timeline that's described.\"",
    "author": "Luca Cacciatore",
    "title": "Dr. Oz to Newsmax: 'The Green New Deal Is a Hoax, a Fraud'"
  },
  {
    "id": 1203,
    "mediaId": 2641,
    "date": "2022-03-31",
    "sentence": "The Centers for Disease Control and Prevention \"wasn't taking advice from doctors\" during the pandemic, so it made little sense to take its advice on schools from the teachers' unions, television's Dr. <span class='selected-term'>Mehmet Oz</span>, a GOP candidate for the U.S. Senate in Pennsylvania, said Thursday on Newsmax.",
    "author": "Sandy Fitzgerald",
    "title": "Dr. Oz to Newsmax: CDC Took School Advice From Unions, Not Doctors"
  },
  {
    "id": 1170,
    "mediaId": 2740,
    "date": "2022-03-31",
    "sentence": "Oz is out: Dr. <span class='selected-term'>Mehmet Oz</span>, a U.S. Senate candidate and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: POTUS seeks to lower gas prices by ordering oil from reserves"
  },
  {
    "id": 1061,
    "mediaId": 2570,
    "date": "2022-04-01",
    "sentence": "Two current members are being cut from the squad: Dr. <span class='selected-term'>Mehmet Oz</span> and Hershel Walker.",
    "author": "Lee Igel",
    "title": "Biden White House Dropping Dr. Oz And Hershel Walker From Sports And Fitness Council Is A Healthy Move"
  },
  {
    "id": 1661,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, the celebrity doctor running for the Republican nomination in Pennsylvania’s 2022 Senate race, claims he is “100% pro-life” but has a record indicating otherwise.",
    "author": "Breccan F. Thies",
    "title": "Dr. Oz’s Pro-Life Campaign Branding at Odds with Past Comments"
  },
  {
    "id": 1045,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "Businessman David McCormick and celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span> are neck-and-neck in the Republican primary race for U.S. Senate in Pennsylvania, according to a poll released Thursday.",
    "author": "Ashley Oliver",
    "title": "Poll: McCormick and Oz in Dead Heat in Pennsylvania Senate Primary"
  },
  {
    "id": 1128,
    "mediaId": 2641,
    "date": "2022-04-02",
    "sentence": "Despite weeks of attack salvos – and a reported $15-plus million TV barrage against Dr. <span class='selected-term'>Mehmet Oz</span>, the latest Emerson poll shows the celebrity physician is tied with multimillionaire opponent David McCormick in Pennsylvania's Republican Senate primary.",
    "author": "John Gizzi",
    "title": "Poll Shows Oz, McCormick in Dead Heat for Pennsylvania Senate Primary"
  },
  {
    "id": 1104,
    "mediaId": 2526,
    "date": "2022-04-02",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, the celebrity doctor running as a Republican in Pennsylvania’s 2022 U.S. Senate race, is accused of being a hypocrite after a reportedly lavish “$250,000-a-head fundraiser with [a] Clinton friend and Epstein associate” when he has attacked his most prominent opponent David McCormick for “taking money from [Democrats].”\nDr. Oz in the past has accused McCormick of taking money from “Clinton-loving Democrats” while trying to appear as a strong Republican.",
    "author": "Jacob Bliss",
    "title": "Hypocrisy: ‘Republican’ Dr. Oz Has Lavish Fundraiser with ‘Clinton Friend and Epstein Associate’ After Attacking Opponent for ‘Taking Money from Dems’"
  },
  {
    "id": 1485,
    "mediaId": 2557,
    "date": "2022-04-03",
    "sentence": "… There isn’t a single thing about Oz that doesn’t raise major red flags for republican voters.”\n<span class='selected-term'>Mehmet Oz</span> praised Hillary Clinton and said Obama would make a “superb president” https://t.co/dle6xza1LQ #PAsen\n— Matt Wolking (@MattWolking) March 31, 2022\nListen to the latest daily DML podcasts below!",
    "author": "DML News App",
    "title": "REPORT: Dr Oz called a hypocrite for ‘$250,000-a-head fundraiser’ with Clinton associate"
  },
  {
    "id": 1226,
    "mediaId": 2557,
    "date": "2022-04-04",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nDr. <span class='selected-term'>Mehmet Oz</span>, the celebrity doctor now running as a candidate for the Republican nomination for U.S. Senate in Pennsylvania, as recently as 2018 was publicly advocating for amnesty for illegal alien youths.",
    "author": "DML News App",
    "title": "REPORT: Celebrity GOP candidate pushed amnesty for illegal alien youths in 2018"
  },
  {
    "id": 1110,
    "mediaId": 2526,
    "date": "2022-04-04",
    "sentence": "pic.twitter.com/3k3lWING21\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) June 5, 2019\nOz’s history with immigration is particularly tenuous, as his ownership in a family company that was issued the largest fine ever in the history of Immigration and Customs Enforcement (ICE) for a scheme of hiring and rehiring illegal aliens has been a front-and-center campaign matter.",
    "author": "Matthew Boyle",
    "title": "Mehmet Oz in 2018 Pushed Amnesty for Illegal Alien Youths: ‘I Think the Dreamers Are Being Used as Political Points’"
  },
  {
    "id": 983,
    "mediaId": 2784,
    "date": "2022-04-04",
    "sentence": "Senate candidate and celebrity Dr. <span class='selected-term'>Mehmet Oz</span> once said the government should stay out of a woman’s decision to “terminate a pregnancy.”\nOz, a Republican running for an open U.S. Senate seat in Pennsylvania, now promises to be a pro-life champion who will “always defend the sanctity of life.”\nHis campaign says he has always been pro-life, but a newly uncovered interview casts doubt on this claim, according to a new Daily Wire report.",
    "author": "",
    "title": "Republican Senate Candidate Dr. Oz on Abortion: Don’t Stop Women “Trying to Terminate a Pregnancy”"
  },
  {
    "id": 1833,
    "mediaId": 2746,
    "date": "2022-04-04",
    "sentence": "The crowded Republican primary includes former hedge fund executive David McCormick and television personality Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Dave Boyer",
    "title": "Front-runner John Fetterman skips Pennsylvania Senate debate while rivals attack"
  },
  {
    "id": 997,
    "mediaId": 2732,
    "date": "2022-04-04",
    "sentence": "The Democrat will face the winner of a Republican primary that includes former Bridgewater Associates Chief Executive Officer David McCormick and celebrity television doctor <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Bloomberg News",
    "title": "Lamb, Kenyatta face off — minus Fetterman — in debate of Democratic Senate hopefuls"
  },
  {
    "id": 1825,
    "mediaId": 2540,
    "date": "2022-04-04",
    "sentence": "McCormick's chief attacker at the Republican forum was <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon, who claimed at the conservative Pennsylvania Leadership Conference that scrutiny of McCormick's ties to China are the reason he didn't attend.",
    "author": "Dan Merica and Eric Bradner",
    "title": "Two Pennsylvania Senate candidates become top targets at events they didn't attend"
  },
  {
    "id": 1534,
    "mediaId": 2728,
    "date": "2022-04-05",
    "sentence": "",
    "author": "Edward Keenan",
    "title": "Americans showed the world how to die from COVID-19. Are they about to do it again?"
  },
  {
    "id": 1198,
    "mediaId": 2658,
    "date": "2022-04-06",
    "sentence": "Sen. Debbie Stabenow (D-Mich.) this week said Fetterman is “the kind of populist that I think would do very well in Pennsylvania.”\nRepublicans argue that Fetterman is too liberal to win this fall’s general election against the winner of a GOP field that includes business executive David McCormick and TV surgeon <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "D.C. Dems get out of frontrunner Fetterman's way in Pennsylvania"
  },
  {
    "id": 1468,
    "mediaId": 5308,
    "date": "2022-04-06",
    "sentence": "The oil lobby in the battleground state of Pennsylvania has found an unlikely, but powerful, friend in Dr. <span class='selected-term'>Mehmet Oz</span>, celebrity doctor and host of the Dr. Oz Show and recent advisor on coronavirus to the Trump administration.",
    "author": "Audrey Carleton",
    "title": "Dr. Oz Loves Fracking Now"
  },
  {
    "id": 1125,
    "mediaId": 2526,
    "date": "2022-04-06",
    "sentence": "Businessman David McCormick has been trending upwards in the poll as celebrity doctor <span class='selected-term'>Mehmet Oz</span> appears to be in free fall as the primary election is roughly one month away.",
    "author": "Jacob Bliss",
    "title": "David McCormick Trends Upwards in the Pennsylvania Senate Primary Polls as Mehmet Oz Free Falls"
  },
  {
    "id": 985,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "On the GOP side, a Real Clear Politics poll has David McCormick leading TV star <span class='selected-term'>Mehmet Oz</span> in four of five primary tracking polls.",
    "author": "Jason Clemons",
    "title": "Report: GOP Registration Surge in Pennsylvania Could Be Warning to Dems"
  },
  {
    "id": 1452,
    "mediaId": 4044,
    "date": "2022-04-07",
    "sentence": "The reason we’re telling you this is that a death hoax is going around in text messages with wording such as “America mourns Dr. Oz.” These texts include a link to a Smilz CBD Gummies scam or other fraudulent CBD product page that falsely claims that <span class='selected-term'>Mehmet Oz</span>, Dr. Phil McGraw, and Dr. Sanjay Gupta, as well as actor Sam Elliott and country music star Garth Brooks, all endorsed the product.",
    "author": "Jordan Liles",
    "title": "Dr. Oz Is Not Dead, Nor Did He Endorse Smilz CBD Gummies"
  },
  {
    "id": 1345,
    "mediaId": 2532,
    "date": "2022-04-07",
    "sentence": "Before he gave up his entertainment career to run for U.S. Senate, <span class='selected-term'>Mehmet Oz</span> — the celebrity heart surgeon best known as the host of daytime TV's \"The Dr. Oz Show\" — amassed assets worth more than $100 million, including homes, stock, life insurance and connections to his in-laws' tree-trimming empire.",
    "author": "",
    "title": "Dr. Oz, running for U.S. Senate in Pennsylvania, reports at least $100 million in assets"
  },
  {
    "id": 1650,
    "mediaId": 2570,
    "date": "2022-04-07",
    "sentence": "“I’ve gone to battle with Big Tech,” <span class='selected-term'>Mehmet Oz</span>, the physician and TV personality, said when announcing his Senate campaign in December.",
    "author": "Zach Everson",
    "title": "Dr. Oz Wants To Fight Big Tech In The Senate. He Owns At Least $10 Million In Shares Of Alphabet, Amazon, Apple And Microsoft."
  },
  {
    "id": 1022,
    "mediaId": 2718,
    "date": "2022-04-07",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> was paid roughly $269,000 for a 2-week guest hosting stint on “Jeopardy!,” according to financial disclosure filings he made as a prospective Republican Senate candidate in Pennsylvania.",
    "author": "Natalie Oganesyan",
    "title": "Dr. Oz Was Paid $269,000 for His 2-Week ‘Jeopardy!’ Guest Hosting Gig"
  },
  {
    "id": 1408,
    "mediaId": 2658,
    "date": "2022-04-07",
    "sentence": "Trump said he’d make a decision in “about a week” between endorsing McCormick or <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Trump says Secret Service blocked him from joining Jan. 6 march to the Capitol"
  },
  {
    "id": 1214,
    "mediaId": 2590,
    "date": "2022-04-07",
    "sentence": "pic.twitter.com/8kNil6upn8\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) April 6, 2022\nAlthough inflation — the result of supply chain issues, low interest rates and high consumer spending, among other factors — is making it hard for millions of Americans to make ends meet, Oz likely isn’t among them.",
    "author": "David Moye",
    "title": "Dr. Oz Goes Grocery Shopping And The Twitter Mockery Is Priceless"
  },
  {
    "id": 1322,
    "mediaId": 2679,
    "date": "2022-04-07",
    "sentence": "HARRISBURG, Pa. (AP) — Before he gave up his entertainment career to run for U.S. Senate, <span class='selected-term'>Mehmet Oz</span> — the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show” — amassed assets worth more than $100 million, including homes, stock, life insurance and connections to his in-laws’ tree-trimming empire.",
    "author": "MARC LEVY",
    "title": "Pa. Senate candidate Oz reports at least $100M in assets"
  },
  {
    "id": 1395,
    "mediaId": 2680,
    "date": "2022-04-07",
    "sentence": "HARRISBURG, Pa. (AP) — Before he gave up his entertainment career to run for U.S. Senate, <span class='selected-term'>Mehmet Oz</span> — the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show” — amassed assets worth more than $100 million, including homes, stock, life insurance and connections to his in-laws' tree-trimming empire.",
    "author": "MARC LEVY",
    "title": "Pa. Senate candidate Oz reports at least $100M in assets"
  },
  {
    "id": 1179,
    "mediaId": 2636,
    "date": "2022-04-07",
    "sentence": "The celebrity doctor <span class='selected-term'>Mehmet Oz</span>, whose TV career was given liftoff by Oprah Winfrey and who left it behind to run for the Senate in Pennsylvania, has a personal fortune of $76 million to $300 million, he disclosed Wednesday night in a government filing.",
    "author": "",
    "title": "Wawa Stock and $500,000 in Cattle: Dr. Oz’s Senate Bid Reveals His Wealth"
  },
  {
    "id": 1155,
    "mediaId": 2745,
    "date": "2022-04-07",
    "sentence": "Trump asked Josh whether he should endorse David McCormick — whom he met with later on Wednesday at Mar-a-Lago — or <span class='selected-term'>Mehmet Oz</span> in the Republican primary to replacing retiring Sen. Pat Toomey (R-Pa.).",
    "author": "",
    "title": "The Post's interview with Donald Trump"
  },
  {
    "id": 994,
    "mediaId": 2687,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Dr. Oz Is Worth More Than $100 Million"
  },
  {
    "id": 1598,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "\"Carpet-bagging\" Republican U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> is being mocked for a video that shows him in a supermarket shopping for ingredients for crudité, and complaining that the ingredients – totaling he says about $20 – are too expensive, and President Joe Biden is to blame.",
    "author": "David Badash",
    "title": "‘Grifter’ Dr. Oz mocked for video blaming Biden for $6 salsa as new disclosure puts his wealth at up to $400 million"
  },
  {
    "id": 960,
    "mediaId": 2512,
    "date": "2022-04-07",
    "sentence": "“Carpet-bagging” Republican U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> is being mocked for a video that shows him in a supermarket shopping for ingredients for crudité, and complaining that the ingredients – totaling he says about $20 – are too expensive, and President Joe Biden is to blame.",
    "author": "David Badash",
    "title": "'Grifter' Dr. Oz mocked for video blaming Biden for $6 salsa as new disclosure puts his wealth at up to $400 million"
  },
  {
    "id": 1347,
    "mediaId": 2728,
    "date": "2022-04-07",
    "sentence": "HARRISBURG, Pa. (AP) — Before he gave up his entertainment career to run for U.S. Senate, <span class='selected-term'>Mehmet Oz</span> — the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show” — amassed assets worth more than $100 million, including homes, stock, life insurance and connections to his in-laws’ tree-trimming empire.",
    "author": "Marc Levy",
    "title": "Pa. Senate candidate Oz reports at least $100M in assets"
  },
  {
    "id": 1750,
    "mediaId": 2629,
    "date": "2022-04-07",
    "sentence": "“Carpet-bagging” Republican U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> is being mocked for a video that shows him in a supermarket shopping for ingredients for crudité, and complaining that the ingredients – totaling he says about $20 – are too expensive, and President Joe Biden is to blame.",
    "author": "David Badash",
    "title": "Mockery Greets Dr. Oz’s Hilarious Campaign Video Of Fake Grocery Shopping (VIDEO)"
  },
  {
    "id": 1357,
    "mediaId": 2663,
    "date": "2022-04-07",
    "sentence": "pic.twitter.com/8kNil6upn8\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) April 6, 2022\nOz posted the video shortly after his campaign released his most recent financial disclosure statement that lists his wealth at more than $400 million, which would make him one of the wealthiest Senators if elected (God forbid).",
    "author": "Graham Gremore",
    "title": "Dr. Oz has grocery store meltdown while buying ingredients for crudité, blames Biden for $6 salsa"
  },
  {
    "id": 1064,
    "mediaId": 2550,
    "date": "2022-04-08",
    "sentence": "includes such luminaries as <span class='selected-term'>Mehmet Oz</span>, Ben Carson, Scott Atlas, and Ronny Jackson, the dude who turned a slovenly heap of fly-pocked Crisco into a Greek Adonis through the magic of barmy bullsh*t.\nNow Jackson, who leveraged his unique proximity to Donald Trump’s eminently unkissable bum into a congressional seat, is under investigation by the House Ethics Committee.",
    "author": "",
    "title": "House doc who praised Trump's 'good genes,' is under investigation"
  },
  {
    "id": 1034,
    "mediaId": 5153,
    "date": "2022-04-08",
    "sentence": "One of the more famous residents of Cliffside Park, N.J., across the Hudson River from New York City, is celebrity TV doctor Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Dr. Edward Halperin",
    "title": "Physicians don’t take Dr. Oz seriously: Why should voters?"
  },
  {
    "id": 1806,
    "mediaId": 2619,
    "date": "2022-04-08",
    "sentence": "Random reads\nTV’s Dr. Oz — <span class='selected-term'>Mehmet Oz</span>, running for the U.S. Senate in Pennsylvania — is worth more than $100 million, campaign disclosures show.",
    "author": "Steve Goldstein",
    "title": "Here’s one way to potentially get more from a 60/40 portfolio"
  },
  {
    "id": 1613,
    "mediaId": 2570,
    "date": "2022-04-08",
    "sentence": "“I’ve gone to battle with Big Tech,” <span class='selected-term'>Mehmet Oz</span>, the physician and TV personality, said when announcing his Senate campaign in December.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: Big Oil, Big Tech And Big Fines"
  },
  {
    "id": 1712,
    "mediaId": 2596,
    "date": "2022-04-08",
    "sentence": "Thanks a lot, Joe.pic.twitter.com/8kNil6upn8\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@Dr. Mehmet Oz) 1649281493\nAnd here comes the Biden slam (if you could even call it that)...\n\"We got Joe Biden to thank for this.",
    "author": "",
    "title": "Dr Oz roasted for 'phony' grocery store shopping video"
  },
  {
    "id": 1745,
    "mediaId": 2540,
    "date": "2022-04-08",
    "sentence": "The fiercest ad battle has been between the primary’s two leading candidates and outside groups targeting them: <span class='selected-term'>Mehmet Oz</span>, a surgeon and former television show host, and David McCormick, a former hedge fund chief executive and economic official in the George W. Bush administration.",
    "author": "Daniel Dale",
    "title": "Fact check: Misleading claims in attack ads against Pennsylvania GOP Senate candidates Oz and McCormick"
  },
  {
    "id": 1810,
    "mediaId": 6571,
    "date": "2022-04-08",
    "sentence": "HARRISBURG, Pa. (AP) — Before he gave up his entertainment career to run for U.S. Senate, <span class='selected-term'>Mehmet Oz</span> — the celebrity heart surgeon best known as the host of daytime TV's \"The Dr. Oz Show\" — amassed assets worth more than $100 million, including homes, stock, life insurance and connections to his in-laws' tree-trimming empire.",
    "author": "",
    "title": "Pennsylvania Senate Candidate Dr. Oz Reports At Least $100 Million In Assets"
  },
  {
    "id": 929,
    "mediaId": 2572,
    "date": "2022-04-09",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" a statement from Trump says.",
    "author": "Adam Sabes",
    "title": "Former President Trump endorses Dr. Oz for US Senate in Pennsylvania"
  },
  {
    "id": 1012,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Former President Donald Trump on Saturday endorsed \"the brilliant and well-known\" Dr. <span class='selected-term'>Mehmet Oz</span> in Oz's bid to represent Pennsylvania in the U.S. Senate, saying the \"doctor is smart, tough, and will never let you down; therefore, he has my complete and total endorsement.\"",
    "author": "Sandy Fitzgerald",
    "title": "Trump Tells Newsmax He's Endorsing Dr. Oz"
  },
  {
    "id": 1263,
    "mediaId": 6509,
    "date": "2022-04-09",
    "sentence": "In a statement, Trump described Oz as “Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our Vets, Tax Cuts\" and as someone who would “always fight for and support our under siege Second Amendment.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump wrote.",
    "author": "David Chang",
    "title": "Former President Trump Endorses Dr. Oz in Pa. Senate Primary Race"
  },
  {
    "id": 872,
    "mediaId": 2937,
    "date": "2022-04-09",
    "sentence": "Article content\nWASHINGTON — Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican in a closely watched U.S. Senate contest in Pennsylvania.",
    "author": "",
    "title": "Trump endorses Dr. Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 811,
    "mediaId": 2526,
    "date": "2022-04-09",
    "sentence": "pic.twitter.com/kWJl7ll2vb\n— Taylor Budowich (@TayFromCA) April 9, 2022\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Donald Trump Endorses Mehmet Oz in Pennsylvania U.S. Senate Race"
  },
  {
    "id": 138,
    "mediaId": 2557,
    "date": "2022-04-09",
    "sentence": "pic.twitter.com/yLhKsZm9sl\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) November 30, 2021\nDonald Trump endorsed celebrity physician Mehmet Oz over former Bridgewater CEO David McCormick in the Republican primary for a Pennsylvania Senate seat, providing crucial support that could swing a close race https://t.co/8dsLGek9cS\n— Bloomberg (@business) April 10, 2022\nLeftist media is criticizing Oz, claiming he “has a considerable financial stake in pharmaceutical firms and tech giants,” according to newly released records.",
    "author": "DML News App",
    "title": "BREAKING: Trump announces major US Senate endorsement in battleground state"
  },
  {
    "id": 615,
    "mediaId": 2551,
    "date": "2022-04-09",
    "sentence": "Former President Donald Trump on Saturday evening announced he was endorsing TV surgeon Dr. <span class='selected-term'>Mehmet Oz</span> in the bitter contest to become the Republican nominee for a U.S. Senate seat in Pennsylvania.",
    "author": "",
    "title": "Trump delivers prized endorsement to 'brilliant' Dr Oz in Pennsylvania Senate race - even though the TV surgeon once told the former president to lose weight"
  },
  {
    "id": 38,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Trump also made an exclusive backstage announcement of an official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania GOP Senate primary.",
    "author": "Eric Mack",
    "title": "Donald Trump to Newsmax: Remember, Nancy Pelosi Was in Charge of Security on Jan. 6"
  },
  {
    "id": 379,
    "mediaId": 2548,
    "date": "2022-04-09",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump added.",
    "author": "Michael Ginsberg",
    "title": "Trump Endorses Dr. Mehmet Oz In Pennsylvania GOP Senate Primary"
  },
  {
    "id": 588,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "| Riccardo Savi/Getty Images for Concordia Summit\nBy Holly Otterbein and Natalie Allison\n 04/09/2022 06:44 PM EDT\nUpdated: 04/09/2022 08:10 PM EDT\nDr. <span class='selected-term'>Mehmet Oz</span> has won the race for Donald Trump’s coveted endorsement in Pennsylvania’s Senate GOP primary.",
    "author": "",
    "title": "Trump endorses Oz in key Senate race"
  },
  {
    "id": 218,
    "mediaId": 2746,
    "date": "2022-04-09",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nDuring his speech in North Carolina, Mr. Trump praised Mr. Oz’s career, adding that his success on television will serve him well with voters.",
    "author": "Joseph Clark",
    "title": "Trump endorses Dr. Oz for Senate"
  },
  {
    "id": 1219,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Stumping for North Carolina GOP Senate primary candidate Ted Budd, former President Donald Trump added an official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's hotly contested GOP Senate primary at Saturday's Save America rally.",
    "author": "Eric Mack",
    "title": "Trump: 'Right Now Our Country Is a Laughingstock'"
  },
  {
    "id": 240,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Trump also made an exclusive backstage announcement of an official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania GOP Senate primary.",
    "author": "Eric Mack",
    "title": "Donald Trump to Newsmax: Remember, Nancy Pelosi Was in Charge of Security on Jan. 6"
  },
  {
    "id": 399,
    "mediaId": 2551,
    "date": "2022-04-09",
    "sentence": "'Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.'",
    "author": "",
    "title": "Trump calls for an end to ‘woke war on women’ at North Carolina rally: Former president says 'far-left gender theories' are 'child abuse' and that public schools have replaced 'reading and math with pronouns and gender studies'"
  },
  {
    "id": 1656,
    "mediaId": 2602,
    "date": "2022-04-09",
    "sentence": "Former US President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for US Senate in Pennsylvania.",
    "author": "REUTERS",
    "title": "Trump endorses celebrity surgeon Dr. Oz for US Senate seat in Pennsylvania"
  },
  {
    "id": 858,
    "mediaId": 6656,
    "date": "2022-04-09",
    "sentence": "April 9 (UPI) -- Former President Donald Trump has endorsed television personality Dr. <span class='selected-term'>Mehmet Oz</span> in his campaign to fill the U.S. Senate seat in Pennsylvania vacated by retiring Sen. Patrick Toomey.",
    "author": "Adam Schrader",
    "title": "Trump endorses Dr. Oz's campaign for U.S. Senate"
  },
  {
    "id": 166,
    "mediaId": 2594,
    "date": "2022-04-09",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Via AP news wire",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 495,
    "mediaId": 2713,
    "date": "2022-04-09",
    "sentence": "Share\nNormal text sizeLarger text sizeVery large text size\nWashington: Former US President Donald Trump has endorsed celebrity surgeon Dr <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican in a closely watched US Senate contest in Pennsylvania.",
    "author": "Moira Warburton",
    "title": "Trump endorses celebrity surgeon Dr Oz for US Senate seat"
  },
  {
    "id": 680,
    "mediaId": 2594,
    "date": "2022-04-09",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” he said in a statement.",
    "author": "Eric Garcia",
    "title": "Trump endorses Dr Mehmet Oz in Republican primary for Senate race in Pennsylvania"
  },
  {
    "id": 733,
    "mediaId": 5119,
    "date": "2022-04-09",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" Trump said, in part.",
    "author": "",
    "title": "Former President Donald Trump endorses Dr. Mehmet Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 338,
    "mediaId": 2631,
    "date": "2022-04-09",
    "sentence": "Former President Donald Trump endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's Senate GOP primary.",
    "author": "",
    "title": "Trump endorses Dr. Mehmet Oz in Pennsylvania Senate GOP primary"
  },
  {
    "id": 918,
    "mediaId": 2632,
    "date": "2022-04-09",
    "sentence": "In a statement, Trump described Oz as “Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our Vets, Tax Cuts\" and as someone who would “always fight for and support our under siege Second Amendment.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump wrote.",
    "author": "David Chang",
    "title": "Former President Trump Endorses Dr. Oz in Pa. Senate Primary Race"
  },
  {
    "id": 1839,
    "mediaId": 2637,
    "date": "2022-04-09",
    "sentence": "Article content\nWASHINGTON — Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for U.S. Senate in Pennsylvania.",
    "author": "",
    "title": "Trump endorses celebrity surgeon Dr. Mehmet Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 1235,
    "mediaId": 2592,
    "date": "2022-04-09",
    "sentence": "Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for U.S. Senate in Pennsylvania.",
    "author": "Moira Warburton and Jan Wolfe",
    "title": "Trump Endorses Celebrity Surgeon Dr. Mehmet Oz For U.S. Senate Seat In Pennsylvania"
  },
  {
    "id": 474,
    "mediaId": 2637,
    "date": "2022-04-09",
    "sentence": "Article content\nWASHINGTON — Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican in a closely watched U.S. Senate contest in Pennsylvania.",
    "author": "",
    "title": "Trump endorses celebrity surgeon Dr. Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 309,
    "mediaId": 2509,
    "date": "2022-04-09",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 1025,
    "mediaId": 2592,
    "date": "2022-04-09",
    "sentence": "Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican in a closely watched U.S. Senate contest in Pennsylvania.",
    "author": "Moira Warburton and Jan Wolfe",
    "title": "Trump Endorses Celebrity Surgeon Dr. Oz For U.S. Senate Seat In Pennsylvania"
  },
  {
    "id": 337,
    "mediaId": 4043,
    "date": "2022-04-09",
    "sentence": "Dr <span class='selected-term'>Mehmet Oz</span>, a Turkish-American TV personality who made more than 60 appearances on Winfrey's show before it stopped airing in 2011, is running to replace retiring Republican Pat Toomey in Pennsylvania.",
    "author": "Tom Acres",
    "title": "Donald Trump endorses celebrity surgeon known for guesting on Oprah in crucial Senate race"
  },
  {
    "id": 284,
    "mediaId": 2590,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday, Trump said his decision was “all about winning elections” as he announced his support for the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\nAdvertisement\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Jill Colvin",
    "title": "Trump Endorses Oz In Pennsylvania's Senate Primary Race"
  },
  {
    "id": 637,
    "mediaId": 2528,
    "date": "2022-04-09",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.\"",
    "author": "Hannah Getahun",
    "title": "Trump endorsed Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 290,
    "mediaId": 2679,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "MARC LEVY",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 620,
    "mediaId": 2745,
    "date": "2022-04-09",
    "sentence": "Former president Donald Trump on Saturday jumped into a high-stakes intraparty contest, endorsing fellow television celebrity-turned-politician <span class='selected-term'>Mehmet Oz</span> in the contested Republican primary for the U.S. Senate in Pennsylvania, where the leading candidates jockeyed aggressively for Trump’s support.",
    "author": "",
    "title": "Trump endorses Dr. Oz in Pennsylvania Senate race, a key battleground"
  },
  {
    "id": 580,
    "mediaId": 2680,
    "date": "2022-04-09",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "JILL COLVIN and MARC LEVY",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 520,
    "mediaId": 2636,
    "date": "2022-04-09",
    "sentence": "Wading into a tight Republican Senate primary in Pennsylvania, former President Donald J. Trump endorsed <span class='selected-term'>Mehmet Oz</span> on Saturday, throwing his weight behind the former star of “The Dr. Oz Show,” who has been attacked by rivals as a closet liberal.",
    "author": "",
    "title": "Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 314,
    "mediaId": 2912,
    "date": "2022-04-09",
    "sentence": "Donald Trump endorsed celebrity physician <span class='selected-term'>Mehmet Oz</span> over former Bridgewater Associates executive David McCormick in the Republican primary for a Pennsylvania Senate seat, providing crucial support that could swing a close race.",
    "author": "",
    "title": "Trump backs Dr. Oz in key Senate endorsement for midterms"
  },
  {
    "id": 667,
    "mediaId": 2644,
    "date": "2022-04-09",
    "sentence": "Donald Trump endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in his bid for Pennsylvania’s open Senate seat, the former president announced Saturday.",
    "author": "Patrick Reilly",
    "title": "Trump gives Dr. Oz ‘complete and total endorsement’ in wide-open PA Senate race"
  },
  {
    "id": 272,
    "mediaId": 2685,
    "date": "2022-04-09",
    "sentence": "\"Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "JILL COLVIN and MARC LEVY Associated Press",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 1176,
    "mediaId": 2664,
    "date": "2022-04-09",
    "sentence": "The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" Trump said in a statement emailed to reporters.",
    "author": "Bob Brigham",
    "title": "Trump cites TV while endorsing Dr. Oz for Senate: 'He has lived with us through the screen'"
  },
  {
    "id": 659,
    "mediaId": 2728,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.“\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Jill Colvin And Marc Levy",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 133,
    "mediaId": 2664,
    "date": "2022-04-09",
    "sentence": "Donald Trump's once iron-clad grip on the Republican Party appears to have weakened as prominent conservatives are openly griping about his endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the GOP primary for U.S. Senate in Pennsylvania.",
    "author": "Bob Brigham",
    "title": "Conservatives lash out after Trump endorses Dr. Oz: 'They played him. Again.'"
  },
  {
    "id": 574,
    "mediaId": 2687,
    "date": "2022-04-09",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Trump Endorses Dr. Oz for Senate"
  },
  {
    "id": 24,
    "mediaId": 2687,
    "date": "2022-04-10",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Quote of the Day"
  },
  {
    "id": 808,
    "mediaId": 2672,
    "date": "2022-04-10",
    "sentence": "Former reality TV star and former president Donald Trump endorsed former TV huckster Dr. <span class='selected-term'>Mehmet Oz</span> in a statement on Saturday.",
    "author": "Peter Wade",
    "title": "Fraud Endorses Quack"
  },
  {
    "id": 444,
    "mediaId": 2643,
    "date": "2022-04-10",
    "sentence": "Conservatives lashed out at former President Donald Trump on social media after he endorsed <span class='selected-term'>Mehmet Oz</span> in the GOP Pennsylvania Senate primary.",
    "author": "Andrew Stanton",
    "title": "Trump's Mehmet Oz Endorsement Criticized by Conservatives: 'Romney 2.0'"
  },
  {
    "id": 387,
    "mediaId": 2790,
    "date": "2022-04-10",
    "sentence": "Former President Donald Trump has endorsed fellow TV personality-turned-politician Dr. <span class='selected-term'>Mehmet Oz</span> for the U.S. Senate ahead of the Republican primary in Pennsylvania.",
    "author": "Emma Bowman",
    "title": "Trump endorses Dr. Oz for the U.S. Senate in Pennsylvania"
  },
  {
    "id": 428,
    "mediaId": 2741,
    "date": "2022-04-10",
    "sentence": "Trump Endorses Dr. Oz, Citing His Popularity on TV and Nice Thing He Said About Trump’s Health\nFormer President Donald Trump cited <span class='selected-term'>Mehmet Oz</span>’s “very successful television show” and purported popularity among women in endorsing the celebrity doctor for U.S. Senate in the Republican primary race in Pennsylvania.",
    "author": "",
    "title": "Trump Endorses Dr. Oz, Citing His Popularity on TV and Nice Thing He Said About Trump’s Health"
  },
  {
    "id": 288,
    "mediaId": 2646,
    "date": "2022-04-10",
    "sentence": "Trump: I’ve gotta be the cleanest— I think I’m the most honest human being perhaps that god ever created pic.twitter.com/D98itzA6vi\n— Acyn (@Acyn) April 10, 2022\nIf there was one bit of actual news to be gleaned from Trump’s North Carolina appearance last night, it was his endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> for the Republican nomination for Senator in Pennsylvania.",
    "author": "Vinnie Longobardo",
    "title": "FUTILE RAMBLINGS: Trump’s North Carolina rally provides him with ever diminishing returns"
  },
  {
    "id": 647,
    "mediaId": 2688,
    "date": "2022-04-10",
    "sentence": "Senate Minority Leader Mitch McConnell (R-KY) on Sunday declined to weigh in on former President Trump’s endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the crowded Pennsylvania Senate race just weeks before the GOP primary.",
    "author": "Matt Shuham",
    "title": "McConnell Sidesteps Trump’s Endorsement Of Celebrity Doctor Oz Weeks Before GOP Primary"
  },
  {
    "id": 498,
    "mediaId": 2688,
    "date": "2022-04-10",
    "sentence": "Shortly after former President Trump announced his endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the hotly contested Pennsylvania Senate GOP primary, a slew of Trumpworld figures fired up social media with their apparent disapproval of the former president’s new endorsee to replace retiring Sen. Pat Toomey (R-PA).",
    "author": "Matt Shuham",
    "title": "‘Romney 2.0': Trumpworld Implodes Over Ex-POTUS’ Endorsement Of Dr. Oz"
  },
  {
    "id": 331,
    "mediaId": 2537,
    "date": "2022-04-10",
    "sentence": "The biggest name in Pennsylvania's Senate race – <span class='selected-term'>Mehmet Oz</span> – has secured the endorsement of the GOP's biggest name, Donald Trump.",
    "author": "Katie Wadington",
    "title": "Trump endorses celebrity surgeon Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 252,
    "mediaId": 2740,
    "date": "2022-04-10",
    "sentence": "The biggest name in Pennsylvania's Senate race – <span class='selected-term'>Mehmet Oz</span> – has secured the endorsement of the GOP's biggest name, Donald Trump.",
    "author": "Katie Wadington",
    "title": "Trump endorses celebrity surgeon Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 468,
    "mediaId": 2738,
    "date": "2022-04-10",
    "sentence": "On Saturday, as CNN shared, Trump went ahead and gave quack TV doc <span class='selected-term'>Mehmet Oz</span>, who is running for senator in Pennsylvania, his full endorsement.",
    "author": "Jennifer Wood",
    "title": "Donald Trump Endorsing Dr. Oz In The PA Senate Race Has Sparked A Hilarious MAGA Mutiny"
  },
  {
    "id": 716,
    "mediaId": 2726,
    "date": "2022-04-10",
    "sentence": "On Sunday, Trump also gave his \"total endorsement\" of <span class='selected-term'>Mehmet Oz</span> — also known as the TV personality \"Dr. Oz\" — and called the latter \"brilliant.\"",
    "author": "Cheryl Teh",
    "title": "Republican governor says Trump is backing 'crazy' candidates for the GOP's primary races and is 'going to lose in 2022'"
  },
  {
    "id": 792,
    "mediaId": 2514,
    "date": "2022-04-10",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 203,
    "mediaId": 2732,
    "date": "2022-04-10",
    "sentence": "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Associated Press",
    "title": "Trump endorses Mehmet Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 833,
    "mediaId": 2640,
    "date": "2022-04-10",
    "sentence": "The former president said he's backing <span class='selected-term'>Mehmet Oz</span>—aka the TV celebrity known as Dr. Oz—in Pennsylvania's Republican Senate primary.",
    "author": "John Johnson",
    "title": "Trump Endorses Big Name in a Big Race"
  },
  {
    "id": 727,
    "mediaId": 2556,
    "date": "2022-04-10",
    "sentence": "“The great commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nIn his statement, Trump also said Oz was especially popular with women because of his work in daytime TV, and could do well in Philadelphia and Pittsburgh.",
    "author": "",
    "title": "Dr. Oz Picks Up Donald Trump Endorsement For Republican Nod In Pennsylvania Senate Race"
  },
  {
    "id": 523,
    "mediaId": 2592,
    "date": "2022-04-10",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" the endorsement read.",
    "author": "Ashley Palya",
    "title": "Trump Endorses Dr. Oz In Pennsylvania Senate Race, Says Decision 'All About Winning Elections'"
  },
  {
    "id": 438,
    "mediaId": 2534,
    "date": "2022-04-10",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "Jill Colvin and Marc Levy",
    "title": "Trump backs Dr. Oz: Will Pennsylvania MAGA voters embrace it?"
  },
  {
    "id": 458,
    "mediaId": 2716,
    "date": "2022-04-10",
    "sentence": "Former President Donald Trump announced his endorsement of author, TV star, retired surgeon, and Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> on Saturday, NBC News reported.",
    "author": "Grayson Quay",
    "title": "Trump endorses Dr. Oz for Senate"
  },
  {
    "id": 599,
    "mediaId": 2654,
    "date": "2022-04-10",
    "sentence": "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Jill Colvin",
    "title": "Trump endorses Dr. Oz in Pennsylvania’s Senate race"
  },
  {
    "id": 596,
    "mediaId": 2594,
    "date": "2022-04-10",
    "sentence": "——————————————————-\nWASHINGTON/POLITICS\n——————————————————\nELECTION-2022-SENATE-PENNSYLVANIA-TRUMP-OZ — Former President Donald Trump endorsed <span class='selected-term'>Mehmet Oz</span> in Pennsylvania’s crowded Republican Senate primary, ending months of jockeying for his support.",
    "author": "Via AP news wire",
    "title": "AP News Digest 5:50 a.m."
  },
  {
    "id": 440,
    "mediaId": 2584,
    "date": "2022-04-10",
    "sentence": "“The great commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nAt his rally, Trump called Oz a “great guy, good man … Harvard-educated, tremendous, tremendous career and they liked him for a long time.",
    "author": "Martin Pengelly",
    "title": "‘TV is like a poll’: Trump endorses Dr Oz for Pennsylvania Senate nomination"
  },
  {
    "id": 513,
    "mediaId": 2532,
    "date": "2022-04-10",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he's the farthest thing from America First & he'd be very bad for PA.\"\n2022 Midterm Elections\n More\n A test for Trump as Michigan GOP gathers\n McCarthy considered telling Trump to resign after Jan. 6, recording shows\n Bernie Sanders hasn't ruled out third run for presidency\n Florida governor approves map that could give GOP more U.S. House seats\n Tennessee GOP kicks Trump-backed candidate off congressional primary ballot\n More\nIn:\nPennsylvania\nUnited States Senate\n<span class='selected-term'>Mehmet Oz</span>\nDonald Trump",
    "author": "",
    "title": "Trump endorses Dr. Mehmet Oz in Pennsylvania Senate primary race"
  },
  {
    "id": 97,
    "mediaId": 2594,
    "date": "2022-04-10",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” read Mr Trump’s statement.",
    "author": "John Bowden",
    "title": "Trump allies claim he was ‘played’ after endorsing TV’s Dr Oz for Senate seat"
  },
  {
    "id": 473,
    "mediaId": 2674,
    "date": "2022-04-10",
    "sentence": "Oprah’s TV doc is running for the US Senate seat vacated by a Pennsylvania Republican\nDonald Trump has endorsed TV personality and cardiac surgeon Doctor <span class='selected-term'>Mehmet Oz</span> for a Senate seat in Pennsylvania, his spokesperson announced on Saturday ahead of a rally for the ex-US president in North Carolina.",
    "author": "",
    "title": "Trump endorses Dr. Oz"
  },
  {
    "id": 881,
    "mediaId": 2668,
    "date": "2022-04-10",
    "sentence": "A new WHTM/Emerson College Polling/The Hill Pennsylvania primary poll shows David McCormick and <span class='selected-term'>Mehmet Oz</span> continuing to lead in the Republican race for one of Pennsylvania’s U.S. Senate seats.",
    "author": "Duke",
    "title": "Did Donald Trump Just Burn Some Bridges With His Base Over the Dr. Oz Endorsement?"
  },
  {
    "id": 263,
    "mediaId": 2668,
    "date": "2022-04-10",
    "sentence": "As RedState reported Saturday evening, Trump raised eyebrows across the political spectrum with his “complete and total” endorsement of Dr. <span class='selected-term'>Mehmet Oz</span>, just weeks before the contested Republican primary in Pennsylvania.",
    "author": "Mike Miller",
    "title": "Trump's Endorsement of Dr. Oz Should Surprise No One Who Understands Trump"
  },
  {
    "id": 531,
    "mediaId": 2861,
    "date": "2022-04-10",
    "sentence": "Trump said of Oz “doctor is smart, tough, and will never let you down.”\nFormer President Donald Trump on Saturday endorsed “the brilliant and well-known” Dr. <span class='selected-term'>Mehmet Oz</span> in his bid to represent Pennsylvania in the U.S. Senate, saying the “doctor is smart, tough, and will never let you down.”\nI get paid more than $90 to $100 per hour for working online.",
    "author": "",
    "title": "WATCH: Trump endorses Dr. Oz for Pennsylvania Senate says the “doctor is smart, tough, and will never let you down”"
  },
  {
    "id": 553,
    "mediaId": 6746,
    "date": "2022-04-10",
    "sentence": "Former United States President Donald Trump announced on Saturday that he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span> in the Senatorial race in Pennsylvania.",
    "author": "Quincy Cahilig",
    "title": "Donald Trump Endorses \"Tough\" Celebrity Surgeon Mehmet Oz in US Senate Race in Pennsylvania"
  },
  {
    "id": 41,
    "mediaId": 2557,
    "date": "2022-04-10",
    "sentence": "President Trump vows to ‘demand justice for the Jan. 6 prisoners and full protection of their civil rights like was received by ANTIFA, Black Lives Matter who murdered people throughout our country.’ pic.twitter.com/I9VxV5zpjh\nPresident Trump: ‘We must ensure that every election can be FULLY and quickly audited.’ pic.twitter.com/9sWhOHumo6\nTrump confirmed his endorsement for Dr. <span class='selected-term'>Mehmet Oz</span>, in Pennsylvania, who is running for U.S. Senate.",
    "author": "DML News App",
    "title": "WATCH: Highlights from Trump’s speech at North Carolina rally"
  },
  {
    "id": 529,
    "mediaId": 2597,
    "date": "2022-04-10",
    "sentence": "",
    "author": "",
    "title": "WATCH LIVE: THE MOST CENSORED NEWS BROADCAST IN THE WORLD"
  },
  {
    "id": 363,
    "mediaId": 2589,
    "date": "2022-04-10",
    "sentence": "When undecided voters were asked they are leaning towards at this time, McCormick’s lead increased to 27.2%, followed by <span class='selected-term'>Mehmet Oz</span> with almost 20.6%.",
    "author": "Karen Townsend",
    "title": "Why did Trump endorse Dr. Oz? One person's support may hold the answer"
  },
  {
    "id": 685,
    "mediaId": 6598,
    "date": "2022-04-10",
    "sentence": "",
    "author": "",
    "title": "/news/world/americas/us-politics/trump-interview-today-jan-6-twitter-latest-b2057736.html"
  },
  {
    "id": 819,
    "mediaId": 2736,
    "date": "2022-04-10",
    "sentence": "pic.twitter.com/rBhuW46b4j\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) April 10, 2022\nHedge fund CEO David McCormick, whose wife, Dina Powell, worked in the Trump White House, was also competing for the endorsement but nope:\nSpotted at Mar-a-Lago today: David McCormick on the patio having lunch ahead of a meeting with Trump about the PA senate race.",
    "author": "Greg P.",
    "title": "‘They played him. Again’: Conservatives react to Donald Trump’s endorsement of Dr. Oz"
  },
  {
    "id": 695,
    "mediaId": 2730,
    "date": "2022-04-11",
    "sentence": "In today's episode, Kurt discusses President Trump's latest endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> for the U.S. Senate in Pennsylvania and why he believes the decision is an epic screw-up.",
    "author": "Townhall.com Staff",
    "title": "Schlichter: President Trump Screwed Up Epically"
  },
  {
    "id": 320,
    "mediaId": 2533,
    "date": "2022-04-11",
    "sentence": "Dr. Oz also passionately believes in high-quality education and protecting parent involvement throughout the process.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\n“Women, in particular, are drawn to Dr. Oz for his advice and counsel.",
    "author": "Staff -",
    "title": "Dr. Oz Is Running for Senate and He Just Got Big News From Donald Trump"
  },
  {
    "id": 503,
    "mediaId": 2721,
    "date": "2022-04-11",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” he added.",
    "author": "",
    "title": "Trump splits conservatives by endorsing Dr. Oz"
  },
  {
    "id": 183,
    "mediaId": 2746,
    "date": "2022-04-11",
    "sentence": "Some Republicans are none too pleased with former President Donald Trump’s endorsement of TV celebrity and surgeon Dr. <span class='selected-term'>Mehmet Oz</span> over David McCormick, a former hedge fund executive and spouse of ex-Trump Deputy National Security Adviser Dina Powell, for an open Senate seat in Pennsylvania.",
    "author": "Ramsey Touchberry",
    "title": "GOP flashes warning lights after Trump endorses Mehmet Oz for Pennsylvania Senate seat"
  },
  {
    "id": 589,
    "mediaId": 2593,
    "date": "2022-04-11",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\nThe race is set to be one of the most competitive this November, as GOP Sen. Pat Toomey is retiring.",
    "author": "",
    "title": "Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 57,
    "mediaId": 2720,
    "date": "2022-04-11",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\nThe race is set to be one of the most competitive this November, as GOP Sen. Pat Toomey is retiring.",
    "author": "",
    "title": "Trump Makes Controversial Endorsement in Pennsylvania Senate Race"
  },
  {
    "id": 239,
    "mediaId": 6571,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Ross Guidotti",
    "title": "Police search for man accused of stealing large lawnmower from Home Depot"
  },
  {
    "id": 869,
    "mediaId": 6428,
    "date": "2022-04-11",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> gained a celebrity endorsement from another prominent T.V.",
    "author": "",
    "title": "Trump Endorses Dr. Oz in Pennsylvania's Crowded GOP Senate Primary"
  },
  {
    "id": 322,
    "mediaId": 2526,
    "date": "2022-04-11",
    "sentence": "Host Alex Marlow breaks down the latest news, including President Trump’s endorsement of Dr. <span class='selected-term'>Mehmet Oz</span>, Elon Musk backing off Twitter’s board, the latest trans hysteria, the chaos at our border, France’s presidential election, and Big Joey’s latest effort to dis-unify the country.",
    "author": "Breitbart News",
    "title": "Breitbart News Daily Podcast Ep. 111: Trump Endorses Dr. Oz, Musk Off Twitter Board; Guest: David Mamet"
  },
  {
    "id": 216,
    "mediaId": 6571,
    "date": "2022-04-11",
    "sentence": "",
    "author": "",
    "title": "Pets help manage stress and anxiety, experts say"
  },
  {
    "id": 16,
    "mediaId": 6571,
    "date": "2022-04-11",
    "sentence": "",
    "author": "",
    "title": "CBS News Pittsburgh: Local News, Weather & More"
  },
  {
    "id": 20,
    "mediaId": 2557,
    "date": "2022-04-11",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by TheHill.com:\nFrustration is mounting on the GOP’s right flank over former President Trump’s endorsement of <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate race.",
    "author": "DML News App",
    "title": "POLL: After you see THIS, do you support Trump’s endorsement of Dr. Oz for U.S. Senate?"
  },
  {
    "id": 326,
    "mediaId": 2724,
    "date": "2022-04-11",
    "sentence": "pic.twitter.com/XkIE6qV4R0\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 16, 2022\nWe live in a time where too many Republicans try selling their conservative wares just to get elected only to start functioning like barely-disguised left-of-center RINOs once they get into office.",
    "author": "Rusty Weiss",
    "title": "I’m Just Going To Say This: Trump’s Endorsement Of Dr. Oz Is The Wrong Move"
  },
  {
    "id": 545,
    "mediaId": 6746,
    "date": "2022-04-11",
    "sentence": "",
    "author": "Madz Dizon",
    "title": "President Joe Biden's Sister Valerie Biden Owens Claims Hunter Corruption Allegations Are Political Attack by Ex-POTUS, Republicans"
  },
  {
    "id": 445,
    "mediaId": 2624,
    "date": "2022-04-11",
    "sentence": "Trump’s standing has improved in North Carolina, where he has endorsed Rep. Ted Budd for the state’s open Senate seat, and in Pennsylvania, where he endorsed former television host Dr. <span class='selected-term'>Mehmet Oz</span> for Senate over the weekend as “the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\nIn Ohio, where Trump has also not weighed in on Republican Gov.",
    "author": "Eli Yokley",
    "title": "Trump’s Endorsees May Lose Some Primaries, but He’s Still the GOP’s Dominant Force"
  },
  {
    "id": 297,
    "mediaId": 2781,
    "date": "2022-04-11",
    "sentence": "Shortly after former President Trump announced his endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the hotly contested Pennsylvania Senate GOP primary, a slew of Trumpworld figures fired up social media with their apparent disapproval of the former president’s new endorsee to replace retiring Sen. Pat Toomey (R-PA).",
    "author": "News Editor",
    "title": "Trump Releases Major Senate Endorsement In Key Battleground State; ‘Romney 2.0': Trumpworld Implodes Over Ex-POTUS’ Endorsement"
  },
  {
    "id": 690,
    "mediaId": 4024,
    "date": "2022-04-11",
    "sentence": "PENNSYLVANIA (LifeSiteNews) – Former President Donald Trump disappointed some of his most ardent supporters over the weekend by endorsing TV personality Dr. <span class='selected-term'>Mehmet Oz</span> in the Republican primary for a U.S. Senate seat in Pennsylvania, despite his history of staking out left-wing positions on issues important to conservatives.",
    "author": "",
    "title": "Dr. Oz receives Trump endorsement for Senate despite support for abortion, ‘transitioning’ kids"
  },
  {
    "id": 804,
    "mediaId": 5308,
    "date": "2022-04-11",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nTrump’s endorsement touted Oz’s books and television show, and said that “women, in particular, are drawn to Dr. Oz for his advice and counsel”—portraying this quality as one that would help Oz win the election.",
    "author": "Paul Blest",
    "title": "Trump Endorsed Dr. Oz and Republicans Are Pissed"
  },
  {
    "id": 420,
    "mediaId": 2716,
    "date": "2022-04-11",
    "sentence": "Over the weekend, former President Donald Trump endorsed <span class='selected-term'>Mehmet Oz</span> — \"Dr. Oz\" to the many viewers of his longtime syndicated television show — in the Pennsylvania GOP primary for U.S. Senate.",
    "author": "Joel Mathis",
    "title": "Trump's real ideology: fame"
  },
  {
    "id": 514,
    "mediaId": 2540,
    "date": "2022-04-11",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" Trump said in a statement announcing the endorsement.",
    "author": "Chris Cillizza",
    "title": "The ridiculous price tag for a Senate race"
  },
  {
    "id": 812,
    "mediaId": 2540,
    "date": "2022-04-11",
    "sentence": "That fact was borne out over the weekend when Trump endorsed TV doctor <span class='selected-term'>Mehmet Oz</span> over hedge fund rich guy David McCormick in advance of next month's Republican Senate primary.",
    "author": "Chris Cillizza",
    "title": "The very simple reason why Donald Trump chose Mehmet Oz in Pennsylvania"
  },
  {
    "id": 554,
    "mediaId": 2621,
    "date": "2022-04-11",
    "sentence": "Trump has endorsed both men as he continues to throw his support behind various Republicans running, including recently Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Zachary Leeman",
    "title": "Trump Rally in North Carolina Draws Fewer Than 2,000 People: Report"
  },
  {
    "id": 780,
    "mediaId": 2732,
    "date": "2022-04-11",
    "sentence": "The former president, who backed celebrity surgeon <span class='selected-term'>Mehmet Oz</span> late Saturday in the Republican primary, is undoubtedly the most popular figure in GOP politics.",
    "author": "The Philadelphia Inquirer",
    "title": "What Trump’s Mehmet Oz endorsement means for the Pennsylvania Senate race"
  },
  {
    "id": 51,
    "mediaId": 2658,
    "date": "2022-04-11",
    "sentence": "— Minority Leader Mitch McConnell (R-Ky.)\n\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.",
    "author": "",
    "title": "Donald Trump endorsed Dr. Mehmet Oz over the weekend in the Pennsylvania Senate race. Mitch McConnell didn't follow suit."
  },
  {
    "id": 657,
    "mediaId": 2699,
    "date": "2022-04-11",
    "sentence": "Donald Trump’s recent endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Republican primary race for U.S. Senate in Pennsylvania led to a vocal backlash from the right.",
    "author": "Matt Lewis",
    "title": "The Backlash Over Trump’s Dr. Oz Endorsement Shows His Hold on the GOP Is Slipping"
  },
  {
    "id": 593,
    "mediaId": 2738,
    "date": "2022-04-11",
    "sentence": "Trump’s been feeling some intense backlash for endorsing Dr. <span class='selected-term'>Mehmet Oz</span> in a Senate race out of Pennsylvania.",
    "author": "Kimberly Ricci",
    "title": "Trump’s Poorly-Attended Weekend Rally Included Bragging So Silly That His Own Crowd Began Laughing"
  },
  {
    "id": 308,
    "mediaId": 2688,
    "date": "2022-04-11",
    "sentence": "MAGALand Is Big Mad After Trump Endorsed Dr. Oz\nThe ex-president endorsed fellow TV star Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate race on Saturday, incensing some of Trump’s top supporters in right-wing media and conservative circles.",
    "author": "Cristina Cabrera",
    "title": "Texas Drops Murder Charge Against Woman For Alleged ‘Self-Induced Abortion’"
  },
  {
    "id": 687,
    "mediaId": 2547,
    "date": "2022-04-11",
    "sentence": "The most recent public poll-- last week, by Emerson:\nUndecided- 33%\nDavid McCormick- 18%\n<span class='selected-term'>Mehmet Oz</span>- 17%\nKathy Barnette- 10%\nJeff Bartos- 9%\nCarla Sands- 8%\nGeorge Bochetto- 4%\nSean Gale- 3%\nWhen undecideds were asked to which candidate they were leaning, McComick's lead increased to 6 points.",
    "author": "Howie Klein",
    "title": "The Kiss Of Death-- Trump Endorses Another Loser: Mehmet Oz"
  },
  {
    "id": 400,
    "mediaId": 2643,
    "date": "2022-04-11",
    "sentence": "Trump made headlines over the weekend for endorsing Dr. <span class='selected-term'>Mehmet Oz</span> for Senate ahead of the Republican primary in Pennsylvania.",
    "author": "Alexandra Hutzler",
    "title": "Trump Hugely Popular in States With Key Senate Races"
  },
  {
    "id": 346,
    "mediaId": 2752,
    "date": "2022-04-11",
    "sentence": "Saturday, during his latest coup-coup hate rally, Donald Trump officially endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in the GOP Pennsylvania Senate primary.",
    "author": "Stephen Robinson",
    "title": "Trump Thinks TV Quack Dr. Oz Qualified For Elected Office"
  },
  {
    "id": 300,
    "mediaId": 2634,
    "date": "2022-04-12",
    "sentence": "The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said in his endorsement backing Oz.",
    "author": "Daniel Strauss",
    "title": "Is Trump’s Endorsement Still Gold for Republicans?"
  },
  {
    "id": 351,
    "mediaId": 2688,
    "date": "2022-04-12",
    "sentence": "“Hence, our Country is going to hell.”\nLast weekend, the former president announced his controversial endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the hotly contested GOP primary for Pennsylvania Senate.",
    "author": "Matt Shuham",
    "title": "Trump Refuses To Back His Ex-US Attorney For Not Big Lying Hard Enough"
  },
  {
    "id": 117,
    "mediaId": 2687,
    "date": "2022-04-12",
    "sentence": "Amanda Carpenter: “LOL, if you thought Donald Trump’s endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> for Senate was the worst development in Pennsylvania’s 2022 GOP primaries, wait until you hear about the Republicans running for governor.”\n“Pennsylvania Republicans will nominate a 2020 election conspiracist for governor in the May 17 primary.",
    "author": "Taegan Goddard",
    "title": "Pennsylvania GOP Will Nominate a Crackpot for Governor"
  },
  {
    "id": 783,
    "mediaId": 5153,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Dave Goldiner",
    "title": "Dr. Oz boasts Trump endorsement but rivals slam record on abortion, guns and trans rights"
  },
  {
    "id": 827,
    "mediaId": 2718,
    "date": "2022-04-12",
    "sentence": "Around the middle of his 10-minute opener, Colbert ripped into former President Donald Trump’s recent endorsement of <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Jolie Lash",
    "title": "Colbert Mocks Trump’s Endorsement of Dr. Oz: ‘Grandpa Thinks His TV Friends Are His Real Friends’"
  },
  {
    "id": 401,
    "mediaId": 2640,
    "date": "2022-04-12",
    "sentence": "(Newser) – Over the weekend, former President Trump endorsed <span class='selected-term'>Mehmet Oz</span>—better known to Americans as Dr. Oz—in the GOP Senate primary in Pennsylvania.",
    "author": "John Johnson",
    "title": "Trump's Dr. Oz Endorsement Is Proving Controversial"
  },
  {
    "id": 684,
    "mediaId": 2732,
    "date": "2022-04-12",
    "sentence": "They said Philadelphia and Detroit were two of the most corrupt places in the country, with Georgia being one of the most corrupt states!”\nOver the weekend, Trump endorsed <span class='selected-term'>Mehmet Oz</span> in the GOP primary race for Pennsylvania’s open U.S. Senate seat.",
    "author": "Pennlive.Com",
    "title": "Trump weighs in on Pa. governor’s race, naming candidate he's not endorsing"
  },
  {
    "id": 342,
    "mediaId": 2822,
    "date": "2022-04-12",
    "sentence": "Trump, who has endorsed celebrity surgeon and former TV host <span class='selected-term'>Mehmet Oz</span> in Pennsylvania’s Republican U.S. Senate primary, has yet to make an endorsement in the governor’s race.",
    "author": "",
    "title": "Trump intervenes in Pennsylvania GOP gubernatorial primary"
  },
  {
    "id": 43,
    "mediaId": 2594,
    "date": "2022-04-12",
    "sentence": "",
    "author": "Andrew Naughtie",
    "title": "Trump news: Kevin McCarthy says ex-president accepted responsibility for Jan 6 in new audio"
  },
  {
    "id": 490,
    "mediaId": 2716,
    "date": "2022-04-12",
    "sentence": "And Trump's endorsement of <span class='selected-term'>Mehmet Oz</span>?",
    "author": "Peter Weber",
    "title": "Late night hosts explore Russia's sanctions pains, Don Jr.'s election texts, Trump's Dr. Oz nod"
  },
  {
    "id": 880,
    "mediaId": 2631,
    "date": "2022-04-12",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump said in his statement.",
    "author": "",
    "title": "‘Dr. Oz’ bets Trump endorsement can catapult him in Pa. Senate race"
  },
  {
    "id": 126,
    "mediaId": 2583,
    "date": "2022-04-12",
    "sentence": "",
    "author": "",
    "title": "Flashback: Mehmet Oz Says Renewable Energy ‘Gives You a Long-Term Game Plan’ While Oil Does Not"
  },
  {
    "id": 617,
    "mediaId": 2656,
    "date": "2022-04-12",
    "sentence": "Donald Trump’s recent endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Republican Senate primary shook MAGA world to its core.",
    "author": "Rick Moran",
    "title": "The Silly Talk of Trump's Demise Over Oz Endorsement"
  },
  {
    "id": 19,
    "mediaId": 2746,
    "date": "2022-04-12",
    "sentence": "Trump, who has endorsed celebrity surgeon and former TV host <span class='selected-term'>Mehmet Oz</span> in Pennsylvania’s Republican U.S. Senate primary, has yet to make an endorsement in the crowded and competitive governor’s race.",
    "author": "",
    "title": "Trump slams McSwain, who’d sought his endorsement for gov"
  },
  {
    "id": 86,
    "mediaId": 2557,
    "date": "2022-04-12",
    "sentence": "Perhaps most importantly, I believe the <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\nPromoted Content\nPresident Donald J. Trump announces his endorsement of Dr. Oz pic.twitter.com/k6U7UrkmdC\n— Liz Harrington (@realLizUSA) April 9, 2022\nListen to the latest daily DML podcasts below!",
    "author": "DML News App",
    "title": "REPORT: Trump refuses to endorse ‘coward’ ex-US attorney running for governor"
  },
  {
    "id": 663,
    "mediaId": 6746,
    "date": "2022-04-12",
    "sentence": "On Saturday night, Trump outraged Pennsylvania conservatives by endorsing TV personality Dr. <span class='selected-term'>Mehmet Oz</span>, a more moderate Republican candidate for the state's open Senate seat.",
    "author": "Madz Dizon",
    "title": "Mitch McConnell Warns GOP Could Screw Up Senate Takeover in Midterm Election with \"Unacceptable Candidates\""
  },
  {
    "id": 184,
    "mediaId": 2583,
    "date": "2022-04-12",
    "sentence": "Over the weekend, he weighed in on the political future of charlatan and cater-waiter holding the hors d’oeurves tray with his penis, Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Colbert on Trump Endorsing Dr. Oz: A ‘Con-Man’ Endorsing Another ‘Con-Man’"
  },
  {
    "id": 628,
    "mediaId": 2522,
    "date": "2022-04-13",
    "sentence": "Given Trump’s questionable actions that jeopardize a 2024 run, such as his highly controversial endorsement of <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Republican primary for one of the state’s Senate seats, some believe that Trump doesn’t plan to run at all:\nTrump’s endorsement of Mehmet Oz over McCormick in the Pennsylvania Senate GOP primary has outraged numerous prominent Trump supporters, who now say they’ll support DeSantis in 2024 over Trump.",
    "author": "Joshua Nybo",
    "title": "Mick Mulvaney throws some curve balls on who he believes can derail Trump’s potential reelection"
  },
  {
    "id": 604,
    "mediaId": 2718,
    "date": "2022-04-13",
    "sentence": "That might not put Ingraham in rare company, but it is unusual for Fox News hosts to turn on their own — and that’s exactly what “The Ingraham Angle” host did Tuesday night, calling out Hannity and Trump for their endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> as the Republican candidate for Senate in Pennsylvania.",
    "author": "Josh Dickey",
    "title": "Laura Ingraham Turns on Hannity and Trump for Dr. Oz Endorsement: ‘I’m Not Afraid to Say It’"
  },
  {
    "id": 177,
    "mediaId": 2592,
    "date": "2022-04-13",
    "sentence": "Donald Trump's decision to endorse celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate race has divided local Republican Party officials and stunned close advisers who thought he had decided to stay out of the contest to pick a Republican candidate, two sources familiar with internal deliberations told Reuters.",
    "author": "Jarrett Renshaw",
    "title": "Trump Endorsement Of Dr. Oz In Senate Race Stuns Advisers, Divides Loyalists"
  },
  {
    "id": 625,
    "mediaId": 2699,
    "date": "2022-04-13",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> got a nudge in Pennsylvania’s Republican Senate primary race this weekend after he scored Donald Trump’s coveted endorsement.",
    "author": "The Daily Beast",
    "title": "Trump Fans Found a Way to Be Even Worse at the Airport"
  },
  {
    "id": 754,
    "mediaId": 2752,
    "date": "2022-04-13",
    "sentence": "He’s endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania GOP Senate primary and South Dakota Governor Kristi Noem.",
    "author": "Stephen Robinson",
    "title": "Trump To Ron DeSantis: Just Do Me A Favor Though"
  },
  {
    "id": 839,
    "mediaId": 2629,
    "date": "2022-04-13",
    "sentence": "However, pseudo-science TV host and noted quack Dr. <span class='selected-term'>Mehmet Oz</span> is a pretty close second, which clearly explains why Trump endorsed his run for Senate in Pennsylvania.",
    "author": "Michael Hayne",
    "title": "Endorse This: Colbert Hilariously Explains Why Trump Endorsed Dr. Oz (VIDEO)"
  },
  {
    "id": 162,
    "mediaId": 2687,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "McCormick Raised $4.3 Million in First Quarter"
  },
  {
    "id": 903,
    "mediaId": 2688,
    "date": "2022-04-14",
    "sentence": "Burned by the backlash that ensued upon former President Trump’s endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the hotly contested Pennsylvania Senate GOP primary, Trumpworld figures are rushing to contain the fallout that has MAGAland in a frenzy.",
    "author": "Matt Shuham",
    "title": "Trumpworld Attempts Damage Control After Oz Endorsement Angers MAGA Crowd"
  },
  {
    "id": 721,
    "mediaId": 2659,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Jason Easley",
    "title": "John Fetterman’s Support Grows 13 Points In A Month In PA Senate Primary"
  },
  {
    "id": 349,
    "mediaId": 2549,
    "date": "2022-04-14",
    "sentence": "Dr. Oz’s transformation from beloved television doctor to right-wing politician\nDr. <span class='selected-term'>Mehmet Oz</span> has taken a hard right turn since he was TV’s favorite doctor.",
    "author": "Andrew Wyrich",
    "title": "Newsletter: Dr. Oz’s descent into right-wing politics"
  },
  {
    "id": 375,
    "mediaId": 2569,
    "date": "2022-04-14",
    "sentence": "“The misguided obsession over Donald Trump’s endorsements” via Jon Allsop of the Columbia Journalism Review — On Saturday, after months of local and national media speculation, former TV businessman Trump endorsed former TV doctor <span class='selected-term'>Mehmet Oz</span> for an open U.S. Senate seat in Pennsylvania.",
    "author": "Peter Schorsch",
    "title": "Sunburn — The morning read of what’s hot in Florida politics — 4.14.22"
  },
  {
    "id": 410,
    "mediaId": 6526,
    "date": "2022-04-14",
    "sentence": "I saw the latest campaign commercial for <span class='selected-term'>Mehmet Oz</span> on Wednesday morning.",
    "author": "Paul Muschick",
    "title": "Is the Pennsylvania GOP Senate primary over because Trump endorsed Dr. Oz?"
  },
  {
    "id": 477,
    "mediaId": 2790,
    "date": "2022-04-14",
    "sentence": "GROSS: Pennsylvania's an interesting race, which I just want to refer to briefly here, because Trump decided to endorse Dr. <span class='selected-term'>Mehmet Oz</span>, who is a famous TV personality.",
    "author": "Terry Gross",
    "title": "The midterm elections will show if Trump is still a 'kingmaker'"
  },
  {
    "id": 576,
    "mediaId": 6746,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Madz Dizon",
    "title": "Hunter Biden's Wealth: How Rich Is the President's Son After Business Dealings Unearthed?"
  },
  {
    "id": 582,
    "mediaId": 2597,
    "date": "2022-04-14",
    "sentence": "",
    "author": "",
    "title": "WATCH LIVE: THE MOST CENSORED NEWS BROADCAST IN THE WORLD"
  },
  {
    "id": 76,
    "mediaId": 2557,
    "date": "2022-04-14",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by DAILYCALLER.COM:\nFox News host Laura Ingraham called former President Donald Trump and her colleague Sean Hannity’s endorsement of Republican Pennsylvania Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> a “mistake” Tuesday.",
    "author": "DML News App",
    "title": "VIDEO: Laura Ingraham Goes Against Trump And Hannity, Calls Their Latest Move A ‘Mistake’"
  },
  {
    "id": 777,
    "mediaId": 2781,
    "date": "2022-04-15",
    "sentence": "Elsewhere, Dr. Oz referred to Smollett as “a good friend,” adding, “Jussie, if you’re watching this, the entire audience, all of us, are saying we love you very much, we wish you the best.”\nThe month after Jussie Smollett tried to smear President Trump by faking a racist hate crime against himself, liberal <span class='selected-term'>Mehmet Oz</span> used his TV show to go on and on about how much he \"adores\" and \"loves\" his \"good friend\" Jussie Smollett.",
    "author": "Joe Miller",
    "title": "WATCH: Resurfaced Video Shows Dr. Oz Praising Jussie Smollett After Hoax Attack"
  },
  {
    "id": 461,
    "mediaId": 4091,
    "date": "2022-04-15",
    "sentence": "(Natural News) Dr. <span class='selected-term'>Mehmet Oz</span> is running for the United States Senate in the Commonwealth of Pennsylvania, and former President Donald Trump is endorsing him.",
    "author": "Ethan Huff",
    "title": "Trump officially endorses Dr. Oz, calls him “smart, tough” … but not all conservatives are happy about it"
  },
  {
    "id": 129,
    "mediaId": 2557,
    "date": "2022-04-15",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nCelebrity Doctor <span class='selected-term'>Mehmet Oz</span>, who is running as a tough-on-China candidate in the race to fill Pennsylvania’s Senate seat, is coming under fire again for his long history with the communist country.",
    "author": "DML News App",
    "title": "REPORT: Mehmet Oz’s China Ties Deepen: Financial Disclosures"
  },
  {
    "id": 612,
    "mediaId": 2524,
    "date": "2022-04-15",
    "sentence": "Nostrum peddler and GOP political candidate <span class='selected-term'>Mehmet Oz</span> shared his bizarre thinking about human beings, God, and fracking on Ted Nugent's internet video show, The Nightly Nuge.",
    "author": "Mark Frauenfelder",
    "title": "Dr. Oz says the left thinks human beings are cockroaches and that's why they don't like fracking"
  },
  {
    "id": 161,
    "mediaId": 2550,
    "date": "2022-04-15",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>\nThe last time we checked in on Donald Trump's endorsement of celebrity healther Dr. Mehmet Oz for Pennsylvania's open Senate seat, right-wingers from Roger Stone to former OANN anchors were blasting the move.",
    "author": "",
    "title": "Strike two: Trump's Oz endorsement quickly turning into his second disaster in Pennsylvania"
  },
  {
    "id": 581,
    "mediaId": 2741,
    "date": "2022-04-15",
    "sentence": "Now the ex-president’s weight is once again in the spotlight because, according to him, he’s been advised to slim down—by none other than celebrity doctor <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Bess Levin",
    "title": "Donald Trump Laments Having No Time to Lose Weight"
  },
  {
    "id": 679,
    "mediaId": 2619,
    "date": "2022-04-16",
    "sentence": "McCormick left his CEO perch at posh hedge fund Bridgewater Associates to run against Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Lydia Moynihan",
    "title": "Citadel’s Ken Griffin is Republican party’s top donor – with $40 million put toward midterms"
  },
  {
    "id": 247,
    "mediaId": 2699,
    "date": "2022-04-17",
    "sentence": "On Sunday evening’s edition of Last Week Tonight, John Oliver kicked off the show by addressing former President Donald Trump’s recent endorsement of snake-oil salesman Dr. <span class='selected-term'>Mehmet Oz</span>, who aggressively pushed hydroxychloroquine as a COVID-19 treatment during the pandemic, in the Pennsylvania Senate race.",
    "author": "Marlow Stern",
    "title": "John Oliver Reveals How He’s Been Trolling Dr. Oz for Years"
  },
  {
    "id": 154,
    "mediaId": 2664,
    "date": "2022-04-17",
    "sentence": "\"Last Week Tonight\" host John Oliver opened his Sunday show by talking about former President Donald Trump announcing his support for <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Republican Senate primary.",
    "author": "Sarah K. Burris",
    "title": "John Oliver makes fun of Dr. Oz complaining about the price of crudité a year after 'surfing' in Italy"
  },
  {
    "id": 603,
    "mediaId": 2894,
    "date": "2022-04-17",
    "sentence": "",
    "author": "Bryan Anderson",
    "title": "Smart tactic or missed opportunity? Budd is the latest GOP frontrunner to avoid debates"
  },
  {
    "id": 433,
    "mediaId": 2721,
    "date": "2022-04-17",
    "sentence": "In Pennsylvania, for example, he endorsed Dr. <span class='selected-term'>Mehmet Oz</span> who, like Trump, was a longtime TV personality before entering politics.",
    "author": "",
    "title": "Mitch McConnell openly attacks Trump"
  },
  {
    "id": 92,
    "mediaId": 2592,
    "date": "2022-04-17",
    "sentence": "KEY POINTS\nTrump said he received advice from Dr. Oz to lose weight and observe a healthy lifestyle\nTrump is known for his love of McDonald's and Diet Coke\nTrump can down approximately a dozen Diet Cokes each day\nFormer President Donald Trump recently lamented that he does not have the time to lose weight as he told a crowd about the advice he received from TV personality Dr. <span class='selected-term'>Mehmet Oz</span>, who he recently endorsed for the Pennsylvania Senate Race.",
    "author": "Danielle Ong",
    "title": "Trump Talks About His Weight: 'I Don’t Have Time To Lose Weight'"
  },
  {
    "id": 672,
    "mediaId": 6497,
    "date": "2022-04-18",
    "sentence": "Not surprisingly, Donald Trump’s endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate — and Oz’s campaign itself — aren’t sitting well with John Oliver.",
    "author": "Kimberly Nordyke",
    "title": "John Oliver Takes on Dr. Oz and His “Sh— Show” Senate Campaign on ‘Last Week Tonight’"
  },
  {
    "id": 463,
    "mediaId": 2589,
    "date": "2022-04-18",
    "sentence": "Jim Justice who testifies that “McKinley stands with Trump.” In the Pennsylvania Senate race, where Trump just recently endorsed TV personality Dr. <span class='selected-term'>Mehmet Oz</span>, businessman David McCormick has been running ads in which he pledges to “fight for America First energy policies like Donald Trump” and to “fight for what Trump and Reagan showed us all — the world is safest when America is strongest.” A recent ad for Gov.",
    "author": "Allahpundit",
    "title": "Megadonors at Manchin fundraiser whisper: He should run for president as a Republican in 2024"
  },
  {
    "id": 100,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "“I’m a gambler,” Trump told one aide about wading into the Pennsylvania primary a second time—this time to endorse fellow TV huckster Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Trump's loving every minute of kneecapping Republicans' midterm chances"
  },
  {
    "id": 484,
    "mediaId": 2752,
    "date": "2022-04-18",
    "sentence": "The Republican primary is a tighter race with Dr. <span class='selected-term'>Mehmet Oz</span> and David McCormick more or less tied, although Oz has more support among the “Trump faction of the party,” which is all that’s left of the GOP.",
    "author": "Stephen Robinson",
    "title": "PA Senate Candidate John Fetterman Leading Race To Convince Voters He’s Better Than Dr. Oz"
  },
  {
    "id": 353,
    "mediaId": 2644,
    "date": "2022-04-18",
    "sentence": "The former president and longtime reality TV personality stepped in recently to endorse Dr. <span class='selected-term'>Mehmet Oz</span>, another erstwhile reality personality, in his Republican bid for a Pennsylvania Senate seat.",
    "author": "Kase Wickman",
    "title": "John Oliver Tears Into Dr. Oz’s ‘Sh*t Show’ Senate Campaign"
  },
  {
    "id": 333,
    "mediaId": 6570,
    "date": "2022-04-18",
    "sentence": "New financial reports filed Friday reveal in detail how <span class='selected-term'>Mehmet Oz</span> and David McCormick, the leading Republican candidates in Pennsylvania’s U.S. Senate race, have spent a combined $18 million from their own personal fortunes to fuel their campaigns and make it the most expensive primary election in the country.",
    "author": "",
    "title": "Pa. U.S. Senate Republican primary: Now we know how much Mehmet Oz and David McCormick are personally spending on their campaigns"
  },
  {
    "id": 217,
    "mediaId": 2550,
    "date": "2022-04-19",
    "sentence": "Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span>\nI can think of a million reasons why I wouldn’t support Mehmet Oz to represent Pennsylvania in the U.S. Senate, and now I can add one more.",
    "author": "Rebekah Sager",
    "title": "‘He’s shown us who he is,’ Armenian publisher says of Oz’s refusal to recognize Armenian genocide"
  },
  {
    "id": 144,
    "mediaId": 2720,
    "date": "2022-04-19",
    "sentence": "pic.twitter.com/7gmhZupinr\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) April 10, 2022\nReuters reported that the endorsement has left Pennsylvania Republicans “confused and riled.”\nMark Hrutkay, vice chairman of the Republican Party in Washington County in western Pennsylvania, told the outlet he has been inundated with calls from unhappy voters.",
    "author": "Elizabeth Stauffer",
    "title": "This Video of Dr. Oz on COVID Should Have Trump Rethinking His Endorsement"
  },
  {
    "id": 118,
    "mediaId": 2641,
    "date": "2022-04-19",
    "sentence": "One week after Donald Trump endorsed celebrity Dr. <span class='selected-term'>Mehmet Oz</span> for the Senate in Pennsylvania, and one month before the primary, a just-completed poll shows a wide open Republican primary.",
    "author": "John Gizzi",
    "title": "Trafalgar Poll: Pennsylvania GOP Senate Primary Wide Open"
  },
  {
    "id": 557,
    "mediaId": 2580,
    "date": "2022-04-19",
    "sentence": "The retirement of Sen. Pat Toomey has set up a GOP primary that includes daytime TV personality Dr. <span class='selected-term'>Mehmet Oz</span> as well as wealthy hedge fund CEO David McCormick; real estate developer Jeff Bartos; George Bochetto; military veteran Kathy Barnette; Sean Gale; and former California resident Carla Sands.",
    "author": "",
    "title": "Trump accused of living in Oz after endorsing liberal TV doctor"
  },
  {
    "id": 741,
    "mediaId": 2730,
    "date": "2022-04-20",
    "sentence": "https://t.co/3sTkL1WFTg by @aseitzwald\n— Josh Rogin (@joshrogin) April 19, 2022\nPennsylvania Senate hopeful <span class='selected-term'>Mehmet Oz</span> has faced a barrage of questions and criticism from his Republican primary opponents about his initial refusal to relinquish his dual Turkish citizenship.",
    "author": "Matt Vespa",
    "title": "It Would Seem Dr. Oz Really Needs a History Lesson About This Thing Called Genocide"
  },
  {
    "id": 271,
    "mediaId": 5308,
    "date": "2022-04-20",
    "sentence": "He is running for Senate to fight the wokeness that liberals like <span class='selected-term'>Mehmet Oz</span> have pushed on our society.",
    "author": "Cameron Joseph",
    "title": "Senate candidate David McCormick has pledged to “fight the woke mob,” but he once called for “solidarity by denouncing and eradicating structural bigotry.”"
  },
  {
    "id": 405,
    "mediaId": 2629,
    "date": "2022-04-20",
    "sentence": "Democrats clearly see their best pickup opportunity in Pennsylvania, where Trump recently endorsed fellow TV huckster Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Suddenly GOP Is On Defensive In Senate 2022 Campaign"
  },
  {
    "id": 228,
    "mediaId": 2550,
    "date": "2022-04-20",
    "sentence": "Democrats clearly see their best pickup opportunity in Pennsylvania, where Trump recently endorsed fellow TV huckster Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Senate GOP super PAC playing a lot of defense for a supposed"
  },
  {
    "id": 609,
    "mediaId": 2634,
    "date": "2022-04-21",
    "sentence": "Whoever wins will face either Dr. <span class='selected-term'>Mehmet Oz</span> or former Bridgewater Associates CEO David McCormick.",
    "author": "Daniel Strauss",
    "title": "Is Conor Lamb Collapsing Against John Fetterman in Pennsylvania?"
  },
  {
    "id": 492,
    "mediaId": 2656,
    "date": "2022-04-21",
    "sentence": "— Donald Trump wading into primaries and endorsing candidates who may not be the party’s best choice for the general election, such as television doctor <span class='selected-term'>Mehmet Oz</span> (R) in Pennsylvania.",
    "author": "Stephen Green",
    "title": "Sabato: Republicans 'Favorites' to Take Senate"
  },
  {
    "id": 750,
    "mediaId": 4091,
    "date": "2022-04-21",
    "sentence": "So that’s why I always recommend buying gold and silver and things like that.”\nDornik surprised by Donald Trump’s endorsement of <span class='selected-term'>Mehmet Oz</span>\nCaton also asked Dornik about Dr. Mehmet Oz getting an endorsement from former President Donald Trump.",
    "author": "Kevin Hughes",
    "title": "Jeff Dornik tells Chad Caton: Congress giving itself a pay raise is evidence that America’s financial situation is out of control – Brighteon.TV"
  },
  {
    "id": 845,
    "mediaId": 4091,
    "date": "2022-04-21",
    "sentence": "Although Trump may have helped in the last lockdown, he had proudly given birth to the deadly COVID-19 vaccines and endorsed the candidacy of Dr. <span class='selected-term'>Mehmet Oz</span>, the host of the “Dr.",
    "author": "Kevin Hughes",
    "title": "Forced COVID lockdowns may soon be coming back to America"
  },
  {
    "id": 569,
    "mediaId": 2730,
    "date": "2022-04-22",
    "sentence": "On the GOP side, Dr. <span class='selected-term'>Mehmet Oz</span> is leading in the polls.",
    "author": "Matt Vespa",
    "title": "Democrats Appear to Be Testing Progressive Populism In PA Senate Race"
  },
  {
    "id": 119,
    "mediaId": 2512,
    "date": "2022-04-22",
    "sentence": "One of the Republicans competing in Pennsylvania’s GOP U.S. Senate primary is Dr. <span class='selected-term'>Mehmet Oz</span>, who was more of a moderate conservative in the past but is campaigning on dumb MAGA ideas in 2022 — such as firing Dr. Anthony Fauci from the federal government.",
    "author": "Alex Henderson",
    "title": "Pennsylvania swing voters aren’t necessarily in a hurry to vote Republican this year: report"
  },
  {
    "id": 714,
    "mediaId": 2851,
    "date": "2022-04-22",
    "sentence": "As Trump continues to spread the Big Lie that he didn’t lose the 2020 election, he’s busy doling out endorsements to his favored Republican candidates in this year’s midterm races, particularly the Senate ones—Herschel Walker in Georgia, <span class='selected-term'>Mehmet Oz</span> in Pennsylvania, J. D. Vance in Ohio.",
    "author": "John Cassidy",
    "title": "It’s Not News That McConnell and McCarthy Are Craven Patsies for Trump, but the Danger Has Grown"
  }
]