[
  {
    "id": 6978,
    "mediaId": 2636,
    "date": "2022-01-13",
    "sentence": "Whatever might come, this would not be a tenure of earth tones and lethargy and saturnine expressions.” (Debbie Deitcher, Manhattan)\nTaking the measure of <span class='selected-term'>Mehmet Oz</span>, Annaliese Griffin wrote: “He’s rightly understood as a kind of quasi-religious leader, one who has set up his revival tent between a yoga studio and an urgent-care clinic, with the television cameras rolling.” (Scott Williams, Salt Lake City)\nFinally, here’s Charles Blow on his dinner with Sidney Poitier: “His enchantment settled on you, like a soft sweater.",
    "author": "",
    "title": "Trump’s Pride Goeth Before Our Fall"
  },
  {
    "id": 4704,
    "mediaId": 2526,
    "date": "2022-02-22",
    "sentence": "It’s a two-man race In Pennsylvania’s GOP senate primary, with David McCormick surging out in front and <span class='selected-term'>Mehmet Oz</span> sliding down into a distant second place, an internal poll commissioned by McCormick’s campaign shows.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Poll: David McCormick Surges into Lead in Pennsylvania GOP Senate Primary, Mehmet Oz Crashes"
  },
  {
    "id": 2780,
    "mediaId": 2594,
    "date": "2022-03-15",
    "sentence": "Parnell's exit threw open the doors to McCormick and <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show, and accelerated spending in what could be this year's most expensive Senate race.",
    "author": "Via AP news wire",
    "title": "Ex-hedge fund CEO aims to be hometown boy in key Senate race"
  },
  {
    "id": 3023,
    "mediaId": 2732,
    "date": "2022-03-16",
    "sentence": "Parnell’s exit threw open the doors to McCormick and Dr. <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show,” and accelerated spending in what could be this year’s most expensive Senate race.",
    "author": "Associated Press",
    "title": "Ex-hedge fund CEO aims to be hometown boy in Senate race in Pennsylvania"
  }
]