[
  {
    "id": 5792,
    "mediaId": 2630,
    "date": "2022-02-09",
    "sentence": "The former hedge fund manager has praised China in the past, the Philadelphia Inquirer reports, which has already fueled attack ads from celebrity doctor <span class='selected-term'>Mehmet Oz</span> (who has his own ties to China, per Politico).",
    "author": "",
    "title": "The era of big Covid mandates is ending"
  },
  {
    "id": 4667,
    "mediaId": 2732,
    "date": "2022-02-19",
    "sentence": "Frances Weiss, White Oak\nDon’t vote for Dr. Oz\nI felt the need to write this letter to encourage Pennsylvania voters not to vote for Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Sounding off: Biden, Casey, protect our borders first"
  },
  {
    "id": 4051,
    "mediaId": 2540,
    "date": "2022-02-25",
    "sentence": "",
    "author": "Gabby Orr and Melanie Zanona",
    "title": "Trump may offer help to Katie Britt in Alabama Senate primary -- even though he's already endorsed Mo Brooks"
  },
  {
    "id": 1957,
    "mediaId": 2570,
    "date": "2022-03-22",
    "sentence": "Also in attendance was <span class='selected-term'>Mehmet Oz</span>, the TV personality running for Senate in Pennsylvania.",
    "author": "Zach Everson",
    "title": "Checks & Imbalances: Ginni Thomas’ Campaign Contributions, Lawmakers’ Mar-A-Lago Visits"
  },
  {
    "id": 133,
    "mediaId": 2664,
    "date": "2022-04-09",
    "sentence": "Donald Trump's once iron-clad grip on the Republican Party appears to have weakened as prominent conservatives are openly griping about his endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the GOP primary for U.S. Senate in Pennsylvania.",
    "author": "Bob Brigham",
    "title": "Conservatives lash out after Trump endorses Dr. Oz: 'They played him. Again.'"
  },
  {
    "id": 263,
    "mediaId": 2668,
    "date": "2022-04-10",
    "sentence": "As RedState reported Saturday evening, Trump raised eyebrows across the political spectrum with his “complete and total” endorsement of Dr. <span class='selected-term'>Mehmet Oz</span>, just weeks before the contested Republican primary in Pennsylvania.",
    "author": "Mike Miller",
    "title": "Trump's Endorsement of Dr. Oz Should Surprise No One Who Understands Trump"
  },
  {
    "id": 468,
    "mediaId": 2738,
    "date": "2022-04-10",
    "sentence": "On Saturday, as CNN shared, Trump went ahead and gave quack TV doc <span class='selected-term'>Mehmet Oz</span>, who is running for senator in Pennsylvania, his full endorsement.",
    "author": "Jennifer Wood",
    "title": "Donald Trump Endorsing Dr. Oz In The PA Senate Race Has Sparked A Hilarious MAGA Mutiny"
  },
  {
    "id": 880,
    "mediaId": 2631,
    "date": "2022-04-12",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump said in his statement.",
    "author": "",
    "title": "‘Dr. Oz’ bets Trump endorsement can catapult him in Pa. Senate race"
  },
  {
    "id": 100,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "“I’m a gambler,” Trump told one aide about wading into the Pennsylvania primary a second time—this time to endorse fellow TV huckster Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Trump's loving every minute of kneecapping Republicans' midterm chances"
  }
]