[
  {
    "id": 4878,
    "mediaId": 2822,
    "date": "2022-02-17",
    "sentence": "",
    "author": "STEVE PEOPLES",
    "title": "'The brand is so toxic': Democrats fear extinction in rural America"
  },
  {
    "id": 399,
    "mediaId": 2551,
    "date": "2022-04-09",
    "sentence": "'Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.'",
    "author": "",
    "title": "Trump calls for an end to ‘woke war on women’ at North Carolina rally: Former president says 'far-left gender theories' are 'child abuse' and that public schools have replaced 'reading and math with pronouns and gender studies'"
  },
  {
    "id": 520,
    "mediaId": 2636,
    "date": "2022-04-09",
    "sentence": "Wading into a tight Republican Senate primary in Pennsylvania, former President Donald J. Trump endorsed <span class='selected-term'>Mehmet Oz</span> on Saturday, throwing his weight behind the former star of “The Dr. Oz Show,” who has been attacked by rivals as a closet liberal.",
    "author": "",
    "title": "Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 288,
    "mediaId": 2646,
    "date": "2022-04-10",
    "sentence": "Trump: I’ve gotta be the cleanest— I think I’m the most honest human being perhaps that god ever created pic.twitter.com/D98itzA6vi\n— Acyn (@Acyn) April 10, 2022\nIf there was one bit of actual news to be gleaned from Trump’s North Carolina appearance last night, it was his endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> for the Republican nomination for Senator in Pennsylvania.",
    "author": "Vinnie Longobardo",
    "title": "FUTILE RAMBLINGS: Trump’s North Carolina rally provides him with ever diminishing returns"
  },
  {
    "id": 41,
    "mediaId": 2557,
    "date": "2022-04-10",
    "sentence": "President Trump vows to ‘demand justice for the Jan. 6 prisoners and full protection of their civil rights like was received by ANTIFA, Black Lives Matter who murdered people throughout our country.’ pic.twitter.com/I9VxV5zpjh\nPresident Trump: ‘We must ensure that every election can be FULLY and quickly audited.’ pic.twitter.com/9sWhOHumo6\nTrump confirmed his endorsement for Dr. <span class='selected-term'>Mehmet Oz</span>, in Pennsylvania, who is running for U.S. Senate.",
    "author": "DML News App",
    "title": "WATCH: Highlights from Trump’s speech at North Carolina rally"
  },
  {
    "id": 881,
    "mediaId": 2668,
    "date": "2022-04-10",
    "sentence": "A new WHTM/Emerson College Polling/The Hill Pennsylvania primary poll shows David McCormick and <span class='selected-term'>Mehmet Oz</span> continuing to lead in the Republican race for one of Pennsylvania’s U.S. Senate seats.",
    "author": "Duke",
    "title": "Did Donald Trump Just Burn Some Bridges With His Base Over the Dr. Oz Endorsement?"
  },
  {
    "id": 812,
    "mediaId": 2540,
    "date": "2022-04-11",
    "sentence": "That fact was borne out over the weekend when Trump endorsed TV doctor <span class='selected-term'>Mehmet Oz</span> over hedge fund rich guy David McCormick in advance of next month's Republican Senate primary.",
    "author": "Chris Cillizza",
    "title": "The very simple reason why Donald Trump chose Mehmet Oz in Pennsylvania"
  },
  {
    "id": 804,
    "mediaId": 5308,
    "date": "2022-04-11",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nTrump’s endorsement touted Oz’s books and television show, and said that “women, in particular, are drawn to Dr. Oz for his advice and counsel”—portraying this quality as one that would help Oz win the election.",
    "author": "Paul Blest",
    "title": "Trump Endorsed Dr. Oz and Republicans Are Pissed"
  },
  {
    "id": 554,
    "mediaId": 2621,
    "date": "2022-04-11",
    "sentence": "Trump has endorsed both men as he continues to throw his support behind various Republicans running, including recently Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania.",
    "author": "Zachary Leeman",
    "title": "Trump Rally in North Carolina Draws Fewer Than 2,000 People: Report"
  },
  {
    "id": 617,
    "mediaId": 2656,
    "date": "2022-04-12",
    "sentence": "Donald Trump’s recent endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Republican Senate primary shook MAGA world to its core.",
    "author": "Rick Moran",
    "title": "The Silly Talk of Trump's Demise Over Oz Endorsement"
  },
  {
    "id": 603,
    "mediaId": 2894,
    "date": "2022-04-17",
    "sentence": "",
    "author": "Bryan Anderson",
    "title": "Smart tactic or missed opportunity? Budd is the latest GOP frontrunner to avoid debates"
  },
  {
    "id": 92,
    "mediaId": 2592,
    "date": "2022-04-17",
    "sentence": "KEY POINTS\nTrump said he received advice from Dr. Oz to lose weight and observe a healthy lifestyle\nTrump is known for his love of McDonald's and Diet Coke\nTrump can down approximately a dozen Diet Cokes each day\nFormer President Donald Trump recently lamented that he does not have the time to lose weight as he told a crowd about the advice he received from TV personality Dr. <span class='selected-term'>Mehmet Oz</span>, who he recently endorsed for the Pennsylvania Senate Race.",
    "author": "Danielle Ong",
    "title": "Trump Talks About His Weight: 'I Don’t Have Time To Lose Weight'"
  },
  {
    "id": 228,
    "mediaId": 2550,
    "date": "2022-04-20",
    "sentence": "Democrats clearly see their best pickup opportunity in Pennsylvania, where Trump recently endorsed fellow TV huckster Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Senate GOP super PAC playing a lot of defense for a supposed"
  },
  {
    "id": 405,
    "mediaId": 2629,
    "date": "2022-04-20",
    "sentence": "Democrats clearly see their best pickup opportunity in Pennsylvania, where Trump recently endorsed fellow TV huckster Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Suddenly GOP Is On Defensive In Senate 2022 Campaign"
  }
]