[
  {
    "id": 6497,
    "mediaId": 2590,
    "date": "2022-01-13",
    "sentence": "A political action committee supporting another Republican in the race, TV host <span class='selected-term'>Mehmet Oz</span>, launched an ad attacking McCormick’s ties to China, where Bridgewater Associates manages $5 billon of its $150 billion portfolio.",
    "author": "Liz Skalka",
    "title": "Hedge Fund Exec David McCormick Latest To Enter Pennsylvania Senate Race"
  },
  {
    "id": 6694,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "In the Republican field, TV personality Dr. <span class='selected-term'>Mehmet Oz</span> has raised $5.7 million, having donated more than $5 million of his own money to his campaign.",
    "author": "Dave Boyer",
    "title": "Pa. Democrats had vote-counting snag in attempt to endorse Senate candidate"
  },
  {
    "id": 6071,
    "mediaId": 2634,
    "date": "2022-02-02",
    "sentence": "He’s running against former television host Dr. <span class='selected-term'>Mehmet Oz</span>, former Republican nominee for lieutenant governor Jeff Bartos, and former Trump administration Ambassador Carla Sands (who saw a major staff exodus among lackluster fundraising numbers).",
    "author": "Daniel Strauss",
    "title": "Democrats Can Win the Pennsylvania Senate Seat—if They Don’t Slaughter One Another First"
  },
  {
    "id": 1992,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "\"To make matters worse, a poll recently commissioned by Lamb’s own super PAC showed his main Democratic opponent — John Fetterman — not just beating him in a primary where the more liberal candidate often has more traction; polling showed Fetterman as the better candidate in a general election, against potential GOP nominees like Dr. <span class='selected-term'>Mehmet Oz</span>.\"",
    "author": "Matthew Chapman",
    "title": "Biden-snubbed Conor Lamb says 'the race is wide open' for Pennsylvania Senate — but is that what the numbers say?"
  },
  {
    "id": 2209,
    "mediaId": 2699,
    "date": "2022-03-23",
    "sentence": "To make matters worse, a poll recently commissioned by Lamb’s own super PAC showed his main Democratic opponent—John Fetterman—not just beating him in a primary where the more liberal candidate often has more traction; polling showed Fetterman as the better candidate in a general election, against potential GOP nominees like Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Ursula Perano",
    "title": "Will Fetterman Silence Lamb in Pennsylvania Senate Face-Off?"
  }
]