[
  {
    "id": 6387,
    "mediaId": 2658,
    "date": "2022-01-11",
    "sentence": "Several other Washington officials have made financial pledges or shared internal polling to try to convince Hogan that he has a path to victory.”\nOZ’S TURKISH CITIZENSHIP — As celebrity doc <span class='selected-term'>MEHMET OZ</span> runs for Senate, he’s indicating he has no intention of renouncing his Turkish citizenship — and is being challenged repeatedly on the campaign trail to answer why.",
    "author": "",
    "title": "POLITICO Playbook: Biden gets a rude welcome to Georgia"
  },
  {
    "id": 6379,
    "mediaId": 2658,
    "date": "2022-01-15",
    "sentence": "Philly Inquirer’s Jonathan Tamari breaks down the numbers: <span class='selected-term'>MEHMET OZ</span> has “booked nearly $5 million of ad time” since Nov. 30, DAVID MCCORMICK has spent $3 million on ads since late December, CARLA SANDS has dropped around $2 million since October and a PAC backing JEFF BARTOS has a $2 million ad buy starting next week.",
    "author": "",
    "title": "POLITICO Playbook: Civil rights leaders fume after meeting with Sinema"
  },
  {
    "id": 6361,
    "mediaId": 2658,
    "date": "2022-01-16",
    "sentence": "The first banned “the teaching of critical race theory, an academic framework for examining racism in society that has never been part of the state’s public school curriculum.” The second was “aimed at giving parents the ability to opt out of mask mandates in schools, which Democratic former governor RALPH NORTHAM’s health commissioner had ordered statewide for public and private K-12 schools.”\nALL POLITICS\nOZ LOSES BIG IN PA GOP STRAW POLL — POLITICO national political reporter and resident Pennsylvania expert Holly Otterbein writes in:\n<span class='selected-term'>MEHMET OZ</span> didn’t get a very warm welcome from party activists in Pennsylvania on Saturday.",
    "author": "",
    "title": "POLITICO Playbook: A night at the Trump rally"
  },
  {
    "id": 3724,
    "mediaId": 2658,
    "date": "2022-02-27",
    "sentence": "2022 WATCH — “The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>MEHMET OZ</span>, to take up the microphone and become the center of attention for more than an hour,” reports AP’s Marc Levy from Newtown, Pa. “Welcome to Oz’s campaign for U.S. Senate, where the celebrity heart surgeon and former host of daytime TV’s ‘Dr.",
    "author": "",
    "title": "POLITICO Playbook: Your guide through a blizzard of news in Ukraine"
  },
  {
    "id": 2045,
    "mediaId": 2658,
    "date": "2022-03-24",
    "sentence": "The White House asked <span class='selected-term'>Mehmet Oz</span> and Herschel Walkerto resign from the President’s Council on Sports, Fitness & Nutrition.",
    "author": "",
    "title": "POLITICO Playbook: Biden in Europe, WMD fears at center stage"
  },
  {
    "id": 129,
    "mediaId": 2557,
    "date": "2022-04-15",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nCelebrity Doctor <span class='selected-term'>Mehmet Oz</span>, who is running as a tough-on-China candidate in the race to fill Pennsylvania’s Senate seat, is coming under fire again for his long history with the communist country.",
    "author": "DML News App",
    "title": "REPORT: Mehmet Oz’s China Ties Deepen: Financial Disclosures"
  }
]