[
  {
    "id": 2122,
    "mediaId": 2526,
    "date": "2022-03-21",
    "sentence": "In the Senate, Republicans look to retain an open seat with likely Republican primary candidate David McCormick leading in the polls against <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Wendell Husebø",
    "title": "Poll: Joe Biden’s Approval Rating Is 36 Percent, Impacting Battleground States"
  },
  {
    "id": 2456,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "Herschel Walker and <span class='selected-term'>Mehmet Oz</span>, who are now Republican Senate candidates in Georgia and Pennsylvania, respectively, were appointed in 2018 by President Donald Trump to serve on the council.",
    "author": "Donald Judd and Maegan Vazquez",
    "title": "Biden requests Mehmet Oz and Herschel Walker resign from presidential council or be terminated"
  },
  {
    "id": 2462,
    "mediaId": 2521,
    "date": "2022-03-24",
    "sentence": "‘Replying to@NoLieWithBTC’\nThis is one of the reasons Walker was fired:\n‘The Biden Admin also asked GA Senate candidate Hershel Walker to resign from the WH fitness and nutrition council as well because it’s against their policy for Federal candidates to serve on presidential boards.’\n‘President Joe Biden has asked Republican Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to resign their respective positions on a presidential council, or face removal.’\n‘[E]ven if he becomes Senator Oz.",
    "author": "Gloria Christie",
    "title": "Joe Biden Shows Dr. Oz & Herschel Walker The Door"
  },
  {
    "id": 2370,
    "mediaId": 2592,
    "date": "2022-03-24",
    "sentence": "The White House requested Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, who are now Republican Senate candidates in Pennsylvania and Georgia, respectively, to step down from their positions as the administration forbids federal candidates to be members of presidential boards.",
    "author": "Joseph Gobran",
    "title": "Dr. Oz And Herschel Walker Asked By White House To Step Down Or Be Fired, Both Were Trump Appointees"
  },
  {
    "id": 2453,
    "mediaId": 2747,
    "date": "2022-03-25",
    "sentence": "President Joe Biden asked former NFL running back Herschel Walker and TV personality <span class='selected-term'>Mehmet Oz</span>, M.D., to step down from their positions on the President’s Council on Sports, Fitness, and Nutrition.",
    "author": "",
    "title": "Some federal employees can run for political office under the Hatch Act"
  },
  {
    "id": 2496,
    "mediaId": 6704,
    "date": "2022-03-25",
    "sentence": "President Joe Biden asked former NFL running back Herschel Walker and TV personality <span class='selected-term'>Mehmet Oz</span>, M.D., to step down from their positions on the President’s Council on Sports, Fitness, and Nutrition.",
    "author": "",
    "title": "Some federal employees can run for political office under the Hatch Act"
  },
  {
    "id": 51,
    "mediaId": 2658,
    "date": "2022-04-11",
    "sentence": "— Minority Leader Mitch McConnell (R-Ky.)\n\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.",
    "author": "",
    "title": "Donald Trump endorsed Dr. Mehmet Oz over the weekend in the Pennsylvania Senate race. Mitch McConnell didn't follow suit."
  }
]