[
  {
    "id": 4940,
    "mediaId": 2641,
    "date": "2022-02-18",
    "sentence": "Television personality and U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> told Newsmax on Friday that energy is ''the big issue'' in Pennsylvania, where he is running, as it is across the country.",
    "author": "Charles Kim",
    "title": "Dr. Oz to Newsmax: Energy Is 'Big Issue' in Pennsylvania Senate Campaign"
  },
  {
    "id": 3724,
    "mediaId": 2658,
    "date": "2022-02-27",
    "sentence": "2022 WATCH — “The banners and big red video screen all said Dr. Oz, the host gave a rousing introduction and in strode the candidate, <span class='selected-term'>MEHMET OZ</span>, to take up the microphone and become the center of attention for more than an hour,” reports AP’s Marc Levy from Newtown, Pa. “Welcome to Oz’s campaign for U.S. Senate, where the celebrity heart surgeon and former host of daytime TV’s ‘Dr.",
    "author": "",
    "title": "POLITICO Playbook: Your guide through a blizzard of news in Ukraine"
  },
  {
    "id": 2976,
    "mediaId": 2641,
    "date": "2022-03-11",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> is a heart surgeon, professor emeritus at Columbia University and Republican candidate for the U.S. Senate in Pennsylvania.",
    "author": "Dr. Mehmet Oz",
    "title": "Dr. Oz: Follow The Science For Domestic Energy Policy"
  },
  {
    "id": 2947,
    "mediaId": 2590,
    "date": "2022-03-17",
    "sentence": "pic.twitter.com/XkIE6qV4R0\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 16, 2022\nOz’s campaign is even denying that he ever voiced any concern about fracking in the first place, claiming that he had no part in any of those earlier columns — even though he is listed as their primary author.",
    "author": "Chris D'Angelo",
    "title": "Dr. Oz's First-Class Flip-Flop On Fracking"
  },
  {
    "id": 2430,
    "mediaId": 2862,
    "date": "2022-03-20",
    "sentence": "The idea that the laptop story was invented by Russia was also backed by numerous US intelligence officials, both former and current, according to several media reports.One of the leading Republican candidates in a race for a Pennsylvania Senate seat, Dr <span class='selected-term'>Mehmet Oz</span>, also vowed to back the initiative to probe the silencing of the story about Hunter Biden in 2020, if he wins election in the 2022 midterms.",
    "author": "Tim Korso",
    "title": "US Republicans Call for Congressional Probe Into Media, Big Tech Over Silencing Hunter Laptop Story"
  },
  {
    "id": 2266,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "",
    "title": "NATO summit to address Russia’s invasion of Ukraine underway"
  },
  {
    "id": 2153,
    "mediaId": 2740,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, according to reports by several media outlets.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: Should Russia be kicked out of the G-20?"
  },
  {
    "id": 2742,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Alex Gangitano",
    "title": "Biden ‘hopeful’ China won’t help Russia"
  },
  {
    "id": 1170,
    "mediaId": 2740,
    "date": "2022-03-31",
    "sentence": "Oz is out: Dr. <span class='selected-term'>Mehmet Oz</span>, a U.S. Senate candidate and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Amy Nakamura",
    "title": "OnPolitics: POTUS seeks to lower gas prices by ordering oil from reserves"
  },
  {
    "id": 490,
    "mediaId": 2716,
    "date": "2022-04-12",
    "sentence": "And Trump's endorsement of <span class='selected-term'>Mehmet Oz</span>?",
    "author": "Peter Weber",
    "title": "Late night hosts explore Russia's sanctions pains, Don Jr.'s election texts, Trump's Dr. Oz nod"
  }
]