[
  {
    "id": 588,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "| Riccardo Savi/Getty Images for Concordia Summit\nBy Holly Otterbein and Natalie Allison\n 04/09/2022 06:44 PM EDT\nUpdated: 04/09/2022 08:10 PM EDT\nDr. <span class='selected-term'>Mehmet Oz</span> has won the race for Donald Trump’s coveted endorsement in Pennsylvania’s Senate GOP primary.",
    "author": "",
    "title": "Trump endorses Oz in key Senate race"
  },
  {
    "id": 438,
    "mediaId": 2534,
    "date": "2022-04-10",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "Jill Colvin and Marc Levy",
    "title": "Trump backs Dr. Oz: Will Pennsylvania MAGA voters embrace it?"
  },
  {
    "id": 553,
    "mediaId": 6746,
    "date": "2022-04-10",
    "sentence": "Former United States President Donald Trump announced on Saturday that he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span> in the Senatorial race in Pennsylvania.",
    "author": "Quincy Cahilig",
    "title": "Donald Trump Endorses \"Tough\" Celebrity Surgeon Mehmet Oz in US Senate Race in Pennsylvania"
  },
  {
    "id": 363,
    "mediaId": 2589,
    "date": "2022-04-10",
    "sentence": "When undecided voters were asked they are leaning towards at this time, McCormick’s lead increased to 27.2%, followed by <span class='selected-term'>Mehmet Oz</span> with almost 20.6%.",
    "author": "Karen Townsend",
    "title": "Why did Trump endorse Dr. Oz? One person's support may hold the answer"
  },
  {
    "id": 833,
    "mediaId": 2640,
    "date": "2022-04-10",
    "sentence": "The former president said he's backing <span class='selected-term'>Mehmet Oz</span>—aka the TV celebrity known as Dr. Oz—in Pennsylvania's Republican Senate primary.",
    "author": "John Johnson",
    "title": "Trump Endorses Big Name in a Big Race"
  },
  {
    "id": 401,
    "mediaId": 2640,
    "date": "2022-04-12",
    "sentence": "(Newser) – Over the weekend, former President Trump endorsed <span class='selected-term'>Mehmet Oz</span>—better known to Americans as Dr. Oz—in the GOP Senate primary in Pennsylvania.",
    "author": "John Johnson",
    "title": "Trump's Dr. Oz Endorsement Is Proving Controversial"
  },
  {
    "id": 433,
    "mediaId": 2721,
    "date": "2022-04-17",
    "sentence": "In Pennsylvania, for example, he endorsed Dr. <span class='selected-term'>Mehmet Oz</span> who, like Trump, was a longtime TV personality before entering politics.",
    "author": "",
    "title": "Mitch McConnell openly attacks Trump"
  }
]