[
  {
    "id": 4562,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Bob Brigham",
    "title": "Turkey’s autocratic ruler could have leverage over a future GOP senator: report"
  },
  {
    "id": 4995,
    "mediaId": 3997,
    "date": "2022-02-16",
    "sentence": "Basketball star Enes Kanter Freedom is calling foul on Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> over the celebrity doctor’s connections to Turkey.",
    "author": "Chuck Ross",
    "title": "Enes Kanter Freedom’s Dunk on Dr. Oz Could Shake Up Pennsylvania Senate Race"
  },
  {
    "id": 4711,
    "mediaId": 2644,
    "date": "2022-02-22",
    "sentence": "Pennsylvania: Land of Oz\nA dozen years ago Dr. <span class='selected-term'>Mehmet Oz</span> served me lunch.",
    "author": "Cindy Adams",
    "title": "Dr. Oz has the prescription for a Washington gone wild"
  },
  {
    "id": 3341,
    "mediaId": 2644,
    "date": "2022-03-07",
    "sentence": "Health guru <span class='selected-term'>Mehmet Oz</span> is in the midst of a family feud with his sister, who he claims has swiped millions of dollars from their late father’s estate, according to a new court papers.",
    "author": "Priscilla DeGregory",
    "title": "Dr. Oz accuses sister of stealing millions, forging dad’s will"
  },
  {
    "id": 3229,
    "mediaId": 2738,
    "date": "2022-03-08",
    "sentence": "In late 2021, “serial testicle fondler” <span class='selected-term'>Mehmet Oz</span>, a.k.a.",
    "author": "Jennifer Wood",
    "title": "US Senate Candidate/Quack TV Doctor Dr. Oz Is Fighting With His Sister Over Their Father’s Estate"
  },
  {
    "id": 3345,
    "mediaId": 2728,
    "date": "2022-03-16",
    "sentence": "HARRISBURG, Pa. (AP) — <span class='selected-term'>Mehmet Oz</span>, warding off criticism from a key rival in Pennsylvania’s heated Republican primary race for U.S. Senate, said Wednesday that he will renounce his dual citizenship in Turkey if he is elected, as the expensive campaign took on a harder and more personal edge.",
    "author": "Marc Levy",
    "title": "Oz vows to renounce Turkish citizenship if elected senator"
  },
  {
    "id": 3009,
    "mediaId": 2641,
    "date": "2022-03-16",
    "sentence": "",
    "author": "",
    "title": "Oz Vows to Renounce Turkish Citizenship If Elected Senator"
  },
  {
    "id": 3203,
    "mediaId": 2574,
    "date": "2022-03-17",
    "sentence": "Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> said Wednesday he will renounce his Turkish citizenship if elected to the U.S. Senate, reversing an earlier claim that he would maintain dual citizenship even if it meant forgoing classified briefings.",
    "author": "Chuck Ross",
    "title": "Dr. Oz Pledges to Cut All Ties to Foreign Powers, If Elected"
  },
  {
    "id": 1110,
    "mediaId": 2526,
    "date": "2022-04-04",
    "sentence": "pic.twitter.com/3k3lWING21\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) June 5, 2019\nOz’s history with immigration is particularly tenuous, as his ownership in a family company that was issued the largest fine ever in the history of Immigration and Customs Enforcement (ICE) for a scheme of hiring and rehiring illegal aliens has been a front-and-center campaign matter.",
    "author": "Matthew Boyle",
    "title": "Mehmet Oz in 2018 Pushed Amnesty for Illegal Alien Youths: ‘I Think the Dreamers Are Being Used as Political Points’"
  },
  {
    "id": 741,
    "mediaId": 2730,
    "date": "2022-04-20",
    "sentence": "https://t.co/3sTkL1WFTg by @aseitzwald\n— Josh Rogin (@joshrogin) April 19, 2022\nPennsylvania Senate hopeful <span class='selected-term'>Mehmet Oz</span> has faced a barrage of questions and criticism from his Republican primary opponents about his initial refusal to relinquish his dual Turkish citizenship.",
    "author": "Matt Vespa",
    "title": "It Would Seem Dr. Oz Really Needs a History Lesson About This Thing Called Genocide"
  }
]