[
  {
    "id": 6071,
    "mediaId": 2634,
    "date": "2022-02-02",
    "sentence": "He’s running against former television host Dr. <span class='selected-term'>Mehmet Oz</span>, former Republican nominee for lieutenant governor Jeff Bartos, and former Trump administration Ambassador Carla Sands (who saw a major staff exodus among lackluster fundraising numbers).",
    "author": "Daniel Strauss",
    "title": "Democrats Can Win the Pennsylvania Senate Seat—if They Don’t Slaughter One Another First"
  },
  {
    "id": 3673,
    "mediaId": 2658,
    "date": "2022-02-28",
    "sentence": "Down the Ballot\nWEEKEND UPDATE — “How Orlando became the center of the universe for GOP Senate hopefuls,” by Natalie Allison, POLITICO: “<span class='selected-term'>Mehmet Oz</span> has less than 90 days left before Pennsylvania Republican voters cast their ballots in one of the most contentious Senate primaries in the nation.",
    "author": "",
    "title": "6 House races to watch in Texas"
  },
  {
    "id": 3496,
    "mediaId": 2748,
    "date": "2022-03-16",
    "sentence": "Celebrity doctor <span class='selected-term'>Mehmet Oz</span> is already in talks to return to television if his candidacy for U.S. Senate in Pennsylvania is unsuccessful, according to a recent report.",
    "author": "Blarp Blog",
    "title": "Report: Oz Looks to Exit Senate Race, Return to Television"
  },
  {
    "id": 1992,
    "mediaId": 2664,
    "date": "2022-03-23",
    "sentence": "\"To make matters worse, a poll recently commissioned by Lamb’s own super PAC showed his main Democratic opponent — John Fetterman — not just beating him in a primary where the more liberal candidate often has more traction; polling showed Fetterman as the better candidate in a general election, against potential GOP nominees like Dr. <span class='selected-term'>Mehmet Oz</span>.\"",
    "author": "Matthew Chapman",
    "title": "Biden-snubbed Conor Lamb says 'the race is wide open' for Pennsylvania Senate — but is that what the numbers say?"
  },
  {
    "id": 2264,
    "mediaId": 2702,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Harper Neidig",
    "title": "Trump lawyer urges appeals court to block House from getting tax returns"
  },
  {
    "id": 433,
    "mediaId": 2721,
    "date": "2022-04-17",
    "sentence": "In Pennsylvania, for example, he endorsed Dr. <span class='selected-term'>Mehmet Oz</span> who, like Trump, was a longtime TV personality before entering politics.",
    "author": "",
    "title": "Mitch McConnell openly attacks Trump"
  },
  {
    "id": 492,
    "mediaId": 2656,
    "date": "2022-04-21",
    "sentence": "— Donald Trump wading into primaries and endorsing candidates who may not be the party’s best choice for the general election, such as television doctor <span class='selected-term'>Mehmet Oz</span> (R) in Pennsylvania.",
    "author": "Stephen Green",
    "title": "Sabato: Republicans 'Favorites' to Take Senate"
  }
]