[
  {
    "id": 6387,
    "mediaId": 2658,
    "date": "2022-01-11",
    "sentence": "Several other Washington officials have made financial pledges or shared internal polling to try to convince Hogan that he has a path to victory.”\nOZ’S TURKISH CITIZENSHIP — As celebrity doc <span class='selected-term'>MEHMET OZ</span> runs for Senate, he’s indicating he has no intention of renouncing his Turkish citizenship — and is being challenged repeatedly on the campaign trail to answer why.",
    "author": "",
    "title": "POLITICO Playbook: Biden gets a rude welcome to Georgia"
  },
  {
    "id": 6452,
    "mediaId": 2590,
    "date": "2022-01-12",
    "sentence": "TV doctor-turned-politician <span class='selected-term'>Mehmet Oz</span> has apparently retired from clinical practice and his faculty role at Columbia University since announcing his Senate run in Pennsylvania.",
    "author": "Liz Skalka",
    "title": "Columbia University Quietly Changes Mehmet Oz's Position Amid Senate Run"
  },
  {
    "id": 6497,
    "mediaId": 2590,
    "date": "2022-01-13",
    "sentence": "A political action committee supporting another Republican in the race, TV host <span class='selected-term'>Mehmet Oz</span>, launched an ad attacking McCormick’s ties to China, where Bridgewater Associates manages $5 billon of its $150 billion portfolio.",
    "author": "Liz Skalka",
    "title": "Hedge Fund Exec David McCormick Latest To Enter Pennsylvania Senate Race"
  },
  {
    "id": 6978,
    "mediaId": 2636,
    "date": "2022-01-13",
    "sentence": "Whatever might come, this would not be a tenure of earth tones and lethargy and saturnine expressions.” (Debbie Deitcher, Manhattan)\nTaking the measure of <span class='selected-term'>Mehmet Oz</span>, Annaliese Griffin wrote: “He’s rightly understood as a kind of quasi-religious leader, one who has set up his revival tent between a yoga studio and an urgent-care clinic, with the television cameras rolling.” (Scott Williams, Salt Lake City)\nFinally, here’s Charles Blow on his dinner with Sidney Poitier: “His enchantment settled on you, like a soft sweater.",
    "author": "",
    "title": "Trump’s Pride Goeth Before Our Fall"
  },
  {
    "id": 6649,
    "mediaId": 6526,
    "date": "2022-01-19",
    "sentence": "TV personality <span class='selected-term'>Mehmet Oz</span>, a Republican running for an open Senate seat in Pennsylvania, did not show up as expected for the monthly meeting of the Wyoming County Republican Committee on Tuesday night.",
    "author": "Robert L. Baker",
    "title": "Mehmet Oz absent from appearance before county Republican committee in northeastern Pennsylvania"
  },
  {
    "id": 6620,
    "mediaId": 2631,
    "date": "2022-01-22",
    "sentence": "",
    "author": "Peter Nicholas",
    "title": "Trump stays on sidelines in Pennsylvania Senate race — for now"
  },
  {
    "id": 6572,
    "mediaId": 2594,
    "date": "2022-01-25",
    "sentence": "Three, he is relatively unknown to voters, especially considering that his primary rivals include Jeff Bartos, the GOP's endorsed candidate for lieutenant governor in 2018, and <span class='selected-term'>Mehmet Oz</span>, the heart surgeon, wellness author and TV personality who carries unrivaled name recognition as the host of daytime TV’s “Dr.",
    "author": "Via AP news wire",
    "title": "No Trump endorsement? Senate hopeful enlists other GOP stars"
  },
  {
    "id": 6676,
    "mediaId": 2679,
    "date": "2022-01-25",
    "sentence": "Three, he is relatively unknown to voters, especially considering that his primary rivals include Jeff Bartos, the GOP’s endorsed candidate for lieutenant governor in 2018, and <span class='selected-term'>Mehmet Oz</span>, the heart surgeon, wellness author and TV personality who carries unrivaled name recognition as the host of daytime TV’s “Dr.",
    "author": "MARC LEVY",
    "title": "No Trump endorsement? Senate hopeful enlists other GOP stars"
  },
  {
    "id": 6936,
    "mediaId": 2732,
    "date": "2022-01-26",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> enthralled a room full of potential Westmoreland County voters Wednesday as he works to make his mark in a crowded field of candidates vying to represent Pennsylvania in the U.S. Senate.",
    "author": "Megan Tomasic",
    "title": "Dr. Mehmet Oz stumps in Westmoreland County in quest for U.S. Senate"
  },
  {
    "id": 6836,
    "mediaId": 2643,
    "date": "2022-01-26",
    "sentence": "\"Dr. <span class='selected-term'>Mehmet Oz</span> has been advertising heavily—I saw at least two ads during the Eagles game a little more than a week ago—and that's reflected in sizable support in some surveys,\" Hopkins said.",
    "author": "Jon Jackson",
    "title": "Despite High Profile, Dr. Oz Underperforms in GOP Straw Polls Ahead of 2022 Midterms"
  },
  {
    "id": 6832,
    "mediaId": 2784,
    "date": "2022-01-28",
    "sentence": "Television personality and Republican candidate Dr. <span class='selected-term'>Mehmet Oz</span> spoke at Grove City College Wednesday about his run for United States Senate in Pennsylvania.",
    "author": "",
    "title": "Dr. Oz Avoids Question on Abortion to Hide How He Supports Some Abortions"
  },
  {
    "id": 6636,
    "mediaId": 2551,
    "date": "2022-01-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, who's looking to trade in his gig as a TV doctor for a seat in the U.S. Senate, put his medical skills to use during an emergency situation at a political meeting on Saturday morning.",
    "author": "Kevin Kayhart For Dailymail.com",
    "title": "Dr. Oz jumps into action to help man who collapsed at a caucus meeting... as he continues his run for U.S Senate seat in Pennsylvania"
  },
  {
    "id": 6418,
    "mediaId": 2590,
    "date": "2022-01-29",
    "sentence": "Stephen Colbert mocked Republican <span class='selected-term'>Mehmet Oz</span>’s run for senator of Pennsylvania, given the celebrity physician’s “tenuous” links to the state and his reported underperforming in straw polls on the race.",
    "author": "Lee Moran",
    "title": "Stephen Colbert Tells Mehmet Oz Exactly Where To Stick His Senate Campaign"
  },
  {
    "id": 6563,
    "mediaId": 2732,
    "date": "2022-02-01",
    "sentence": "Filings posted online by the Federal Election Commission before Monday night’s deadline showed <span class='selected-term'>Mehmet Oz</span> — best-known as daytime TV’s host of “The Dr. Oz Show” — loaned himself $5.2 million.",
    "author": "Associated Press",
    "title": "Millions follow rich candidates in Pennsylvania Senate race"
  },
  {
    "id": 6562,
    "mediaId": 2594,
    "date": "2022-02-01",
    "sentence": "Cash is pouring into Pennsylvania s hotly contested race for U.S. Senate as wealthy and well-connected candidates move in from out of state, followed by millions of dollars going into TV ads and super PACs\nFilings posted online by the Federal Election Commission before Monday night's deadline showed <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV's host of “The Dr. Oz Show” — loaned himself $5.2 million.",
    "author": "Via AP news wire",
    "title": "Millions follow rich candidates in Pennsylvania Senate race"
  },
  {
    "id": 6694,
    "mediaId": 2746,
    "date": "2022-02-01",
    "sentence": "In the Republican field, TV personality Dr. <span class='selected-term'>Mehmet Oz</span> has raised $5.7 million, having donated more than $5 million of his own money to his campaign.",
    "author": "Dave Boyer",
    "title": "Pa. Democrats had vote-counting snag in attempt to endorse Senate candidate"
  },
  {
    "id": 6071,
    "mediaId": 2634,
    "date": "2022-02-02",
    "sentence": "He’s running against former television host Dr. <span class='selected-term'>Mehmet Oz</span>, former Republican nominee for lieutenant governor Jeff Bartos, and former Trump administration Ambassador Carla Sands (who saw a major staff exodus among lackluster fundraising numbers).",
    "author": "Daniel Strauss",
    "title": "Democrats Can Win the Pennsylvania Senate Seat—if They Don’t Slaughter One Another First"
  },
  {
    "id": 5701,
    "mediaId": 2540,
    "date": "2022-02-04",
    "sentence": "\"<span class='selected-term'>Mehmet Oz</span> - citizen of Turkey, creature of Hollywood - has spent the last 20 years making his fortune from syndicating his show in China, enriching itself through censorship and CCP propaganda,\" said Jess Szymanski, referring to the Chinese Communist Party.",
    "author": "Michael Warren",
    "title": "Pennsylvania Senate Republican race between Oz and McCormick turns ugly early"
  },
  {
    "id": 5755,
    "mediaId": 2687,
    "date": "2022-02-04",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "GOP Senate Race In Pennsylvania Turns Ugly Early"
  },
  {
    "id": 5935,
    "mediaId": 2637,
    "date": "2022-02-05",
    "sentence": "Among the Republicans vying to replace Senator Pat Toomey, who is retiring, are several with ties to the former president: Carla Sands, his former ambassador to Denmark; his friend the celebrity doctor <span class='selected-term'>Mehmet Oz</span>; and hedge fund CEO David McCormick, whose wife served in the Trump administration.",
    "author": "Jarrett Renshaw",
    "title": "With Trump silent, Pennsylvania Republicans decide against endorsing in Senate race"
  },
  {
    "id": 5482,
    "mediaId": 2658,
    "date": "2022-02-05",
    "sentence": "Bartos, who has struggled in the polls and been outspent by celebrity physician <span class='selected-term'>Mehmet Oz</span> and former hedge fund CEO David McCormick, needs to shake up the race to overcome his rivals’ financial and name ID advantages.",
    "author": "",
    "title": "Pennsylvania GOP declines to endorse in Senate race"
  },
  {
    "id": 5529,
    "mediaId": 2641,
    "date": "2022-02-05",
    "sentence": "Among the Republicans vying to replace Sen. Pat Toomey, R-Pa., who is retiring, are several with ties to the former president: Carla Sands, his former ambassador to Denmark; his friend the celebrity doctor <span class='selected-term'>Mehmet Oz</span>; and hedge fund CEO David McCormick, whose wife served in the Trump administration.",
    "author": "",
    "title": "GOP Won't Endorse in Big Primary Fields for Governor, Senate"
  },
  {
    "id": 6110,
    "mediaId": 6571,
    "date": "2022-02-05",
    "sentence": "The Senate field is notable for wealthy and well-connected candidates moving from out of state to run, including <span class='selected-term'>Mehmet Oz</span>, best known as daytime TV's host of \"The Dr. Oz Show,\" and David McCormick, the just-resigned CEO of one of the world's largest hedge funds.",
    "author": "",
    "title": "Pennsylvania Republican Party Decides Against Endorsing Candidates In Senate And Governor Races"
  },
  {
    "id": 6129,
    "mediaId": 6511,
    "date": "2022-02-06",
    "sentence": "Bartos, quien ha tenido problemas en las encuestas y fue superado por el médico <span class='selected-term'>Mehmet OZ</span> y el ex director general de fondos de cobertura David MacCormick, necesita agitar la carrera para superar las ventajas financieras y de identificación de nombre de sus rivales.",
    "author": "",
    "title": "El Partido Republicano de Pensilvania se niega a respaldar la carrera por el Senado"
  },
  {
    "id": 5559,
    "mediaId": 2641,
    "date": "2022-02-09",
    "sentence": "Senatorial candidate Dr. <span class='selected-term'>Mehmet Oz</span>, R-Pa., told Newsmax on Tuesday night that campaigning has taught him Pennsylvanians know what's needed in Washington.",
    "author": "Charlie McCarthy",
    "title": "Dr. Oz to Newsmax: I'm Listening to Pennsylvanians"
  },
  {
    "id": 5494,
    "mediaId": 2822,
    "date": "2022-02-10",
    "sentence": "",
    "author": "Dave Goldiner",
    "title": "Marjorie Taylor Greene tries to laugh off gazpacho-Gestapo mix-up"
  },
  {
    "id": 5676,
    "mediaId": 6526,
    "date": "2022-02-11",
    "sentence": "",
    "author": "Marc Levy",
    "title": "Dr. Oz gets Walk of Fame star as Pennsylvania Senate campaign rivals says he’s too ‘Hollywood’"
  },
  {
    "id": 5507,
    "mediaId": 2564,
    "date": "2022-02-11",
    "sentence": "+4\nView gallery\nThe celebrity heart surgeon, who recently ended his daytime TV show to run for office, was captured bending down and kissing the pink and gold star on the famous Los Angeles boulevard\n+4\nView gallery\nThe anti-Hollywood attack ad is being run by a group who supports hedge fund CEO David McCormick (pictured), who has former White House communications director Hope Hicks working for him\n+4\nView gallery\nDr. <span class='selected-term'>Mehmet Oz</span> stands over his new star on the Hollywood Walk of Fame at a ceremony on Friday\nThat same career, however, is being used against him by rivals who are picking apart his TV shows and his past as a self-styled wellness and anti-obesity advocate to fuel doubt about his conservative credentials as a Republican.",
    "author": "Associated Press",
    "title": "Dr Oz's rival in the Pennsylvania Senate race claims he is too 'Hollywood' as he's given a STAR on the Walk of Fame (and bent down to kiss it)"
  },
  {
    "id": 6088,
    "mediaId": 2736,
    "date": "2022-02-11",
    "sentence": "Pennsylvania Republican Dr. <span class='selected-term'>Mehmet Oz</span> took a break from his Senate campaign to travel to Hollywood and literally get down on all fours to kiss his newly awarded star on the Walk of Fame.",
    "author": "Greg P.",
    "title": "WATCH: PA Senate candidate Dr. Oz kisses his new star on the Hollywood Walk of Fame"
  },
  {
    "id": 4662,
    "mediaId": 2746,
    "date": "2022-02-14",
    "sentence": "TV personality Dr. <span class='selected-term'>Mehmet Oz</span> leads the field for the Republican nomination for Pennsylvania’s U.S. Senate seat, but a large swath of GOP voters is undecided, according to a poll released Monday.",
    "author": "Dave Boyer",
    "title": "Pa. poll finds Dr. Oz leading with GOP voters, but many still undecided in Senate race"
  },
  {
    "id": 4562,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Bob Brigham",
    "title": "Turkey’s autocratic ruler could have leverage over a future GOP senator: report"
  },
  {
    "id": 4995,
    "mediaId": 3997,
    "date": "2022-02-16",
    "sentence": "Basketball star Enes Kanter Freedom is calling foul on Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> over the celebrity doctor’s connections to Turkey.",
    "author": "Chuck Ross",
    "title": "Enes Kanter Freedom’s Dunk on Dr. Oz Could Shake Up Pennsylvania Senate Race"
  },
  {
    "id": 4878,
    "mediaId": 2822,
    "date": "2022-02-17",
    "sentence": "",
    "author": "STEVE PEOPLES",
    "title": "'The brand is so toxic': Democrats fear extinction in rural America"
  },
  {
    "id": 4672,
    "mediaId": 2643,
    "date": "2022-02-17",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> currently has the greatest name recognition in the race for an open Senate seat in Pennsylvania, but some of Hollywood's biggest stars are lining up behind Democratic candidate Malcolm Kenyatta.",
    "author": "Jon Jackson",
    "title": "Halle Berry, Amy Schumer Among Stars Backing Dr. Oz's Opponent for Senate"
  },
  {
    "id": 4690,
    "mediaId": 2621,
    "date": "2022-02-18",
    "sentence": "Subscribe to\nFormer TV host Dr. <span class='selected-term'>Mehmet Oz</span> called on China to pay the U.S. “reparations” on Friday during an interview on Newsmax TV.",
    "author": "Kipp Jones",
    "title": "Dr. Oz Tells Newsmax China Should Pay U.S. ‘Reparations’ As He Continues MAGA-Like Senate Tour"
  },
  {
    "id": 4940,
    "mediaId": 2641,
    "date": "2022-02-18",
    "sentence": "Television personality and U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> told Newsmax on Friday that energy is ''the big issue'' in Pennsylvania, where he is running, as it is across the country.",
    "author": "Charles Kim",
    "title": "Dr. Oz to Newsmax: Energy Is 'Big Issue' in Pennsylvania Senate Campaign"
  },
  {
    "id": 5083,
    "mediaId": 2732,
    "date": "2022-02-20",
    "sentence": "The vast majority of the Senate ads are coming from or in support of surgeon and television personality Dr. <span class='selected-term'>Mehmet Oz</span> of Montgomery County and former hedge fund CEO and veteran David McCormick, who recently bought a house in Pittsburgh.",
    "author": "Ryan Deto",
    "title": "Pittsburgh market has seen the most ads in high-stakes Senate race"
  },
  {
    "id": 4704,
    "mediaId": 2526,
    "date": "2022-02-22",
    "sentence": "It’s a two-man race In Pennsylvania’s GOP senate primary, with David McCormick surging out in front and <span class='selected-term'>Mehmet Oz</span> sliding down into a distant second place, an internal poll commissioned by McCormick’s campaign shows.",
    "author": "Matthew Boyle",
    "title": "Exclusive — Poll: David McCormick Surges into Lead in Pennsylvania GOP Senate Primary, Mehmet Oz Crashes"
  },
  {
    "id": 4567,
    "mediaId": 2594,
    "date": "2022-02-22",
    "sentence": "Monday's debate did not include high profile candidates such as the celebrity doctor <span class='selected-term'>Mehmet Oz</span> and former George W Bush official David McCormick, both of whom took flak for skipping the event.",
    "author": "Io Dodds",
    "title": "Republican candidate denounces Michael Flynn as a ‘traitor’ during bad-tempered GOP debate"
  },
  {
    "id": 5356,
    "mediaId": 6526,
    "date": "2022-02-23",
    "sentence": "",
    "author": "Paul Muschick",
    "title": "Dr. Oz, other carpetbaggers insulted Pennsylvania voters by skipping Senate debate"
  },
  {
    "id": 4221,
    "mediaId": 6570,
    "date": "2022-03-03",
    "sentence": "Blood sport, it may be, as just this week, Dr. <span class='selected-term'>Mehmet Oz</span>, another Republican running for the Senate, quipped that Mr. McCormick “says he is tough on China, but got rich investing with them.”\nThe New York Times reported late last month that Mr. McCormick’s hedge fund, Bridgewater Associates, was closely linked to China, and cited affectionate comments he had made in the past about the country, though some were from when he served as U.S. Treasury Under Secretary for International Affairs in George W. Bush’s administration.",
    "author": "Julian Routh",
    "title": "David McCormick hawkish on China, punches back at Mehmet Oz in visit to suburban Pittsburgh"
  },
  {
    "id": 4052,
    "mediaId": 2679,
    "date": "2022-03-07",
    "sentence": "Republicans have a wide-open field, featuring three wealthy and well-connected transplants from out of state — including <span class='selected-term'>Mehmet Oz</span>, host of daytime TV’s “The Dr. Oz Show” — who are spending millions of dollars on TV ads.",
    "author": "MARC LEVY",
    "title": "‘We want to win’: Democrats face choice in key Senate race"
  },
  {
    "id": 3128,
    "mediaId": 2732,
    "date": "2022-03-07",
    "sentence": "Republicans have a wide-open field, including three wealthy and well-connected transplants from out of state — including <span class='selected-term'>Mehmet Oz</span>, host of daytime TV’s “The Dr. Oz Show” — who are spending millions of dollars on TV ads.",
    "author": "Associated Press",
    "title": "'We want to win': Democrats face choice in key Senate race in Pennsylvania"
  },
  {
    "id": 2899,
    "mediaId": 2526,
    "date": "2022-03-08",
    "sentence": "Businessman David McCormick is the frontrunner in Pennsylvania’s Republican U.S. Senate primary, leading celebrity doctor <span class='selected-term'>Mehmet Oz</span> by nine points, according to a recent Fox News poll.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Poll: McCormick Leads Dr. Oz by 9 Points in Pennsylvania Republican Senate Primary"
  },
  {
    "id": 3229,
    "mediaId": 2738,
    "date": "2022-03-08",
    "sentence": "In late 2021, “serial testicle fondler” <span class='selected-term'>Mehmet Oz</span>, a.k.a.",
    "author": "Jennifer Wood",
    "title": "US Senate Candidate/Quack TV Doctor Dr. Oz Is Fighting With His Sister Over Their Father’s Estate"
  },
  {
    "id": 2798,
    "mediaId": 2526,
    "date": "2022-03-14",
    "sentence": "Celebrity Doctor <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican Senate candidate in Pennsylvania, is coming under fire in recent days over his soft history with transgender ideology, giving a platform to those advocating for the left’s radical views.",
    "author": "Hannah Bleau",
    "title": "GOP Senate Candidate Dr. Oz’s Soft History with Transgender Ideology Under Fire in Pennsylvania"
  },
  {
    "id": 2780,
    "mediaId": 2594,
    "date": "2022-03-15",
    "sentence": "Parnell's exit threw open the doors to McCormick and <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show, and accelerated spending in what could be this year's most expensive Senate race.",
    "author": "Via AP news wire",
    "title": "Ex-hedge fund CEO aims to be hometown boy in key Senate race"
  },
  {
    "id": 3184,
    "mediaId": 2679,
    "date": "2022-03-15",
    "sentence": "Parnell’s exit threw open the doors to McCormick and <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show,” and accelerated spending in what could be this year’s most expensive Senate race.",
    "author": "MARC LEVY",
    "title": "Ex-hedge fund CEO aims to be hometown boy in key Senate race"
  },
  {
    "id": 3372,
    "mediaId": 2663,
    "date": "2022-03-15",
    "sentence": "Reality has apparently caught up with Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "David Reddish",
    "title": "Dr. Oz’s disastrous Senate campaign reportedly on “life support” as he eyes TV comeback"
  },
  {
    "id": 3496,
    "mediaId": 2748,
    "date": "2022-03-16",
    "sentence": "Celebrity doctor <span class='selected-term'>Mehmet Oz</span> is already in talks to return to television if his candidacy for U.S. Senate in Pennsylvania is unsuccessful, according to a recent report.",
    "author": "Blarp Blog",
    "title": "Report: Oz Looks to Exit Senate Race, Return to Television"
  },
  {
    "id": 3345,
    "mediaId": 2728,
    "date": "2022-03-16",
    "sentence": "HARRISBURG, Pa. (AP) — <span class='selected-term'>Mehmet Oz</span>, warding off criticism from a key rival in Pennsylvania’s heated Republican primary race for U.S. Senate, said Wednesday that he will renounce his dual citizenship in Turkey if he is elected, as the expensive campaign took on a harder and more personal edge.",
    "author": "Marc Levy",
    "title": "Oz vows to renounce Turkish citizenship if elected senator"
  },
  {
    "id": 3212,
    "mediaId": 2601,
    "date": "2022-03-16",
    "sentence": "Breitbart\nCelebrity doctor <span class='selected-term'>Mehmet Oz</span> is already in talks to return to television if his candidacy for U.S. Senate in Pennsylvania is unsuccessful, according to a recent report.",
    "author": "Dr. Tar",
    "title": "Dr. Oz To Pull The Plug On His Senate Campaign"
  },
  {
    "id": 3185,
    "mediaId": 2699,
    "date": "2022-03-16",
    "sentence": "A recent attack ad against McCormick’s big rival—pop surgeon Dr. <span class='selected-term'>Mehmet Oz</span>—is spotlighting the talk-show host’s position on transgender issues, slamming him as a “Republican in Name Only” for engaging on the topic in the past.",
    "author": "Roger Sollenberger",
    "title": "Dr. Oz’s PA Senate Rival Sure Was ‘Woke’ While He Was a CEO"
  },
  {
    "id": 3023,
    "mediaId": 2732,
    "date": "2022-03-16",
    "sentence": "Parnell’s exit threw open the doors to McCormick and Dr. <span class='selected-term'>Mehmet Oz</span>, the celebrity heart surgeon best known as daytime TV’s host of “The Dr. Oz Show,” and accelerated spending in what could be this year’s most expensive Senate race.",
    "author": "Associated Press",
    "title": "Ex-hedge fund CEO aims to be hometown boy in Senate race in Pennsylvania"
  },
  {
    "id": 3009,
    "mediaId": 2641,
    "date": "2022-03-16",
    "sentence": "",
    "author": "",
    "title": "Oz Vows to Renounce Turkish Citizenship If Elected Senator"
  },
  {
    "id": 2649,
    "mediaId": 2528,
    "date": "2022-03-20",
    "sentence": "Former President Donald Trump poses for photos with David McCormick at the Trump National Golf Club Bedminster clubhouse, Sunday, Nov. 20, 2016, in Bedminster, N.J. <span class='selected-term'>Mehmet Oz</span> speaks at a town hall-style event at the Newtown Athletic Club, Feb. 20, 2022, in Newtown, Pa. AP Photo/Carolyn Kaster and AP Photo/Marc Levy\nDr. Mehmet Oz and David McCormick are running in Pennsylvania's GOP Senate primary.",
    "author": "Sarah Al-Arshani",
    "title": "Dr. Oz's primary challenger and his wife said in meeting with Trump that Oz's Muslim background was a liability: NYT report"
  },
  {
    "id": 2059,
    "mediaId": 2732,
    "date": "2022-03-20",
    "sentence": "He called out Republican Senate candidate <span class='selected-term'>Mehmet Oz</span>, former host of the “Dr.",
    "author": "Ryan Deto",
    "title": "Democratic Senate candidates square off in political forum at CMU"
  },
  {
    "id": 2425,
    "mediaId": 2659,
    "date": "2022-03-22",
    "sentence": "While delivering a private speech as part of his “American Freedom” tour in Florida this weekend, Trump asked the crowd what they thought about GOP candidate <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Jason Easley",
    "title": "Trump Is Hinting At Meddling And Handing The Pennsylvania Senate Seat To Democrats By Supporting Dr. Oz"
  },
  {
    "id": 2278,
    "mediaId": 6497,
    "date": "2022-03-23",
    "sentence": "The Biden administration is seeking the formal resignations of TV personality Dr. <span class='selected-term'>Mehmet Oz</span> and former NFL star Herschel Walker from the President’s Council on Sports, Fitness & Nutrition, warning that failure to quit the posts would lead to termination.",
    "author": "Abid Rahman",
    "title": "Biden Administration Seeks Resignations of Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 2209,
    "mediaId": 2699,
    "date": "2022-03-23",
    "sentence": "To make matters worse, a poll recently commissioned by Lamb’s own super PAC showed his main Democratic opponent—John Fetterman—not just beating him in a primary where the more liberal candidate often has more traction; polling showed Fetterman as the better candidate in a general election, against potential GOP nominees like Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Ursula Perano",
    "title": "Will Fetterman Silence Lamb in Pennsylvania Senate Face-Off?"
  },
  {
    "id": 2456,
    "mediaId": 2540,
    "date": "2022-03-23",
    "sentence": "Herschel Walker and <span class='selected-term'>Mehmet Oz</span>, who are now Republican Senate candidates in Georgia and Pennsylvania, respectively, were appointed in 2018 by President Donald Trump to serve on the council.",
    "author": "Donald Judd and Maegan Vazquez",
    "title": "Biden requests Mehmet Oz and Herschel Walker resign from presidential council or be terminated"
  },
  {
    "id": 2540,
    "mediaId": 2631,
    "date": "2022-03-23",
    "sentence": "The Biden administration threatened Wednesday to remove Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile GOP Senate candidates.",
    "author": "Zoë Richards",
    "title": "White House moves to oust Dr. Oz and Herschel Walker from presidential advisory panel"
  },
  {
    "id": 2500,
    "mediaId": 6509,
    "date": "2022-03-23",
    "sentence": "The Biden administration on Wednesday threatened to remove <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile Senate GOP candidates.",
    "author": "",
    "title": "White House Moves to Oust Dr. Oz, Herschel Walker From Panel as They Run for Office"
  },
  {
    "id": 2262,
    "mediaId": 2632,
    "date": "2022-03-24",
    "sentence": "The Biden administration on Wednesday threatened to remove <span class='selected-term'>Mehmet Oz</span> and Herschel Walker from a federal advisory committee if they didn't resign, setting the stage for a public fight with two high-profile Senate GOP candidates.",
    "author": "",
    "title": "White House Moves to Oust Dr. Oz, Herschel Walker From Panel as They Run for Office"
  },
  {
    "id": 2139,
    "mediaId": 2718,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nIf President Biden wants to politicize health, he will have to fire me.",
    "author": "Andi Ortiz",
    "title": "Biden Boots Dr. Oz, Herschel Walker From Presidential Council"
  },
  {
    "id": 2323,
    "mediaId": 2919,
    "date": "2022-03-24",
    "sentence": "pic.twitter.com/fJaVLKVWOC\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 24, 2022\nOz also used the video to levy an attack against Dr. Anthony Fauci, a White House medical adviser and the director of the National Insitute for Allergies and Infectious Diseases.",
    "author": "Alex Hider",
    "title": "Biden asks Dr. Oz, Herschel Walker to resign from presidential fitness council"
  },
  {
    "id": 2370,
    "mediaId": 2592,
    "date": "2022-03-24",
    "sentence": "The White House requested Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, who are now Republican Senate candidates in Pennsylvania and Georgia, respectively, to step down from their positions as the administration forbids federal candidates to be members of presidential boards.",
    "author": "Joseph Gobran",
    "title": "Dr. Oz And Herschel Walker Asked By White House To Step Down Or Be Fired, Both Were Trump Appointees"
  },
  {
    "id": 2099,
    "mediaId": 2740,
    "date": "2022-03-24",
    "sentence": "The White House sent letters to Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker, telling them they would be fired if they did not resign from the President's Council on Sports, Fitness and Nutrition, a White House official said.",
    "author": "Rick Rouan",
    "title": "Biden asks GOP Senate candidates Mehmet Oz, Herschel Walker to resign from presidential board"
  },
  {
    "id": 2137,
    "mediaId": 2570,
    "date": "2022-03-24",
    "sentence": "",
    "author": "Derek Saul",
    "title": "Georgia Senate Candidate Herschel Walker Refuses To Resign From Presidential Council"
  },
  {
    "id": 2136,
    "mediaId": 2641,
    "date": "2022-03-24",
    "sentence": "U.S. Senate candidates Dr. <span class='selected-term'>Mehmet Oz</span> and Herschel Walker on Wednesday were told to resign from the President's Council on Sports, Fitness and Nutrition or their positions would be \"terminated.\"",
    "author": "Charlie McCarthy",
    "title": "Biden Removes Dr. Oz, Herschel Walker From Fitness Council"
  },
  {
    "id": 1904,
    "mediaId": 6526,
    "date": "2022-03-24",
    "sentence": "HARRISBURG — The White House has removed Dr. <span class='selected-term'>Mehmet Oz</span> — best known as daytime TV’s host of “The Dr. Oz Show” and a candidate to replace Sen. Pat Toomey of Pennsylvania — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "author": "Associated Press",
    "title": "Pennsylvania Senate candidate Dr. Oz removed from President’s Sports Council; he and Herschel Walker ousted because they are running for office"
  },
  {
    "id": 1899,
    "mediaId": 2724,
    "date": "2022-03-24",
    "sentence": "Recently, Biden asked Republican Senate candidates, former NFL running back Herschel Walker and Dr. <span class='selected-term'>Mehmet Oz</span>, to step down from the President’s Council on Sports, Fitness & Nutrition or be taken off the Council or be fired.",
    "author": "Becky Noble",
    "title": "Republican Senate Candidate Herschel Walker Ousted From President’s Council On Sports, Fitness & Nutrition"
  },
  {
    "id": 2109,
    "mediaId": 2641,
    "date": "2022-03-25",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> said Friday that he won't quit fighting over his position on the President's Council on Sports, Fitness, and Nutrition, telling Newsmax that if he is elected to represent Pennsylvania as a senator, he and NFL great Herschel Walker, who was also fired from the council, will fight back against politically-motivated firings.",
    "author": "Sandy Fitzgerald",
    "title": "Dr. Oz to Newsmax: Will Keep Fighting After Dismissal From Fitness Council"
  },
  {
    "id": 2441,
    "mediaId": 6428,
    "date": "2022-03-28",
    "sentence": "Former talk show host Dr. <span class='selected-term'>Mehmet Oz</span> is also in the race and has name recognition.",
    "author": "David Brody",
    "title": "'Grateful to God': Senate Candidate Kathy Barnette's Miraculous Story of Purpose and Value"
  },
  {
    "id": 2198,
    "mediaId": 2512,
    "date": "2022-03-29",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> has been a fixture on television for the past 13 years, ever since Oprah began featuring him as a guest on her talk show.",
    "author": "Timothy Evans",
    "title": "Dr. Oz's TV staffers say he 'blindsided everyone' when he abruptly fired them to run for Senate"
  },
  {
    "id": 2590,
    "mediaId": 2701,
    "date": "2022-03-29",
    "sentence": "“Now all of a sudden [it] is the first question in their multiple choice.”\nNo representatives for daytime television star Dr. <span class='selected-term'>Mehmet Oz</span> or Montgomery County real estate developer Jeff Bartos, who are also candidates in the race, responded to The Federalist’s inquiries.",
    "author": "Tristan Justice",
    "title": "5 Pennsylvania GOP Senate Candidates Refuse Philadelphia Inquirer’s Grossly Biased Survey, Torch Paper As A ‘Biased’ ‘Rag’"
  },
  {
    "id": 2631,
    "mediaId": 2748,
    "date": "2022-03-29",
    "sentence": "Lexi Lonas from The Hill reports, President Biden has asked Republican Senate candidates Herschel Walker and <span class='selected-term'>Mehmet Oz</span> to quit their positions on a presidential council or be removed.",
    "author": "IWB",
    "title": "Biden Tells These Two GOP Senate Candidates To Quit Presidential Council Or Be Fired"
  },
  {
    "id": 2211,
    "mediaId": 2732,
    "date": "2022-03-30",
    "sentence": "Republican Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> spoke at a campaign event in Canonsburg on Wednesday evening, highlighting his energy policies and taking questions about the legitimacy of the 2020 election.",
    "author": "Ryan Deto",
    "title": "Senate candidate Oz talks fracking support and election fraud at Canonsburg campaign event"
  },
  {
    "id": 2086,
    "mediaId": 2740,
    "date": "2022-03-30",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, a candidate for U.S. senator and host of the long-running \"The Dr. Oz Show,\" was fired from a presidential council, according to a statement released Wednesday by his campaign.",
    "author": "Chelsey Cox",
    "title": "Senate candidate and TV host Dr. Oz removed from presidential fitness council"
  },
  {
    "id": 1965,
    "mediaId": 2644,
    "date": "2022-03-30",
    "sentence": "Republican US Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> was fired from the President’s Council on Sports, Fitness and Nutrition, about a week after the White House asked him to resign.",
    "author": "Jesse O’Neill",
    "title": "It’s Terminal: Dr. Oz fired from presidential council amid GOP Senate run"
  },
  {
    "id": 1045,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "Businessman David McCormick and celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span> are neck-and-neck in the Republican primary race for U.S. Senate in Pennsylvania, according to a poll released Thursday.",
    "author": "Ashley Oliver",
    "title": "Poll: McCormick and Oz in Dead Heat in Pennsylvania Senate Primary"
  },
  {
    "id": 1661,
    "mediaId": 2526,
    "date": "2022-04-01",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span>, the celebrity doctor running for the Republican nomination in Pennsylvania’s 2022 Senate race, claims he is “100% pro-life” but has a record indicating otherwise.",
    "author": "Breccan F. Thies",
    "title": "Dr. Oz’s Pro-Life Campaign Branding at Odds with Past Comments"
  },
  {
    "id": 1485,
    "mediaId": 2557,
    "date": "2022-04-03",
    "sentence": "… There isn’t a single thing about Oz that doesn’t raise major red flags for republican voters.”\n<span class='selected-term'>Mehmet Oz</span> praised Hillary Clinton and said Obama would make a “superb president” https://t.co/dle6xza1LQ #PAsen\n— Matt Wolking (@MattWolking) March 31, 2022\nListen to the latest daily DML podcasts below!",
    "author": "DML News App",
    "title": "REPORT: Dr Oz called a hypocrite for ‘$250,000-a-head fundraiser’ with Clinton associate"
  },
  {
    "id": 1833,
    "mediaId": 2746,
    "date": "2022-04-04",
    "sentence": "The crowded Republican primary includes former hedge fund executive David McCormick and television personality Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "Dave Boyer",
    "title": "Front-runner John Fetterman skips Pennsylvania Senate debate while rivals attack"
  },
  {
    "id": 1125,
    "mediaId": 2526,
    "date": "2022-04-06",
    "sentence": "Businessman David McCormick has been trending upwards in the poll as celebrity doctor <span class='selected-term'>Mehmet Oz</span> appears to be in free fall as the primary election is roughly one month away.",
    "author": "Jacob Bliss",
    "title": "David McCormick Trends Upwards in the Pennsylvania Senate Primary Polls as Mehmet Oz Free Falls"
  },
  {
    "id": 1179,
    "mediaId": 2636,
    "date": "2022-04-07",
    "sentence": "The celebrity doctor <span class='selected-term'>Mehmet Oz</span>, whose TV career was given liftoff by Oprah Winfrey and who left it behind to run for the Senate in Pennsylvania, has a personal fortune of $76 million to $300 million, he disclosed Wednesday night in a government filing.",
    "author": "",
    "title": "Wawa Stock and $500,000 in Cattle: Dr. Oz’s Senate Bid Reveals His Wealth"
  },
  {
    "id": 1598,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "\"Carpet-bagging\" Republican U.S. Senate candidate Dr. <span class='selected-term'>Mehmet Oz</span> is being mocked for a video that shows him in a supermarket shopping for ingredients for crudité, and complaining that the ingredients – totaling he says about $20 – are too expensive, and President Joe Biden is to blame.",
    "author": "David Badash",
    "title": "‘Grifter’ Dr. Oz mocked for video blaming Biden for $6 salsa as new disclosure puts his wealth at up to $400 million"
  },
  {
    "id": 1650,
    "mediaId": 2570,
    "date": "2022-04-07",
    "sentence": "“I’ve gone to battle with Big Tech,” <span class='selected-term'>Mehmet Oz</span>, the physician and TV personality, said when announcing his Senate campaign in December.",
    "author": "Zach Everson",
    "title": "Dr. Oz Wants To Fight Big Tech In The Senate. He Owns At Least $10 Million In Shares Of Alphabet, Amazon, Apple And Microsoft."
  },
  {
    "id": 1345,
    "mediaId": 2532,
    "date": "2022-04-07",
    "sentence": "Before he gave up his entertainment career to run for U.S. Senate, <span class='selected-term'>Mehmet Oz</span> — the celebrity heart surgeon best known as the host of daytime TV's \"The Dr. Oz Show\" — amassed assets worth more than $100 million, including homes, stock, life insurance and connections to his in-laws' tree-trimming empire.",
    "author": "",
    "title": "Dr. Oz, running for U.S. Senate in Pennsylvania, reports at least $100 million in assets"
  },
  {
    "id": 1395,
    "mediaId": 2680,
    "date": "2022-04-07",
    "sentence": "HARRISBURG, Pa. (AP) — Before he gave up his entertainment career to run for U.S. Senate, <span class='selected-term'>Mehmet Oz</span> — the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show” — amassed assets worth more than $100 million, including homes, stock, life insurance and connections to his in-laws' tree-trimming empire.",
    "author": "MARC LEVY",
    "title": "Pa. Senate candidate Oz reports at least $100M in assets"
  },
  {
    "id": 985,
    "mediaId": 2641,
    "date": "2022-04-07",
    "sentence": "On the GOP side, a Real Clear Politics poll has David McCormick leading TV star <span class='selected-term'>Mehmet Oz</span> in four of five primary tracking polls.",
    "author": "Jason Clemons",
    "title": "Report: GOP Registration Surge in Pennsylvania Could Be Warning to Dems"
  },
  {
    "id": 994,
    "mediaId": 2687,
    "date": "2022-04-07",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "Dr. Oz Is Worth More Than $100 Million"
  },
  {
    "id": 1025,
    "mediaId": 2592,
    "date": "2022-04-09",
    "sentence": "Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican in a closely watched U.S. Senate contest in Pennsylvania.",
    "author": "Moira Warburton and Jan Wolfe",
    "title": "Trump Endorses Celebrity Surgeon Dr. Oz For U.S. Senate Seat In Pennsylvania"
  },
  {
    "id": 918,
    "mediaId": 2632,
    "date": "2022-04-09",
    "sentence": "In a statement, Trump described Oz as “Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our Vets, Tax Cuts\" and as someone who would “always fight for and support our under siege Second Amendment.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump wrote.",
    "author": "David Chang",
    "title": "Former President Trump Endorses Dr. Oz in Pa. Senate Primary Race"
  },
  {
    "id": 929,
    "mediaId": 2572,
    "date": "2022-04-09",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" a statement from Trump says.",
    "author": "Adam Sabes",
    "title": "Former President Trump endorses Dr. Oz for US Senate in Pennsylvania"
  },
  {
    "id": 858,
    "mediaId": 6656,
    "date": "2022-04-09",
    "sentence": "April 9 (UPI) -- Former President Donald Trump has endorsed television personality Dr. <span class='selected-term'>Mehmet Oz</span> in his campaign to fill the U.S. Senate seat in Pennsylvania vacated by retiring Sen. Patrick Toomey.",
    "author": "Adam Schrader",
    "title": "Trump endorses Dr. Oz's campaign for U.S. Senate"
  },
  {
    "id": 872,
    "mediaId": 2937,
    "date": "2022-04-09",
    "sentence": "Article content\nWASHINGTON — Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican in a closely watched U.S. Senate contest in Pennsylvania.",
    "author": "",
    "title": "Trump endorses Dr. Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 733,
    "mediaId": 5119,
    "date": "2022-04-09",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" Trump said, in part.",
    "author": "",
    "title": "Former President Donald Trump endorses Dr. Mehmet Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 811,
    "mediaId": 2526,
    "date": "2022-04-09",
    "sentence": "pic.twitter.com/kWJl7ll2vb\n— Taylor Budowich (@TayFromCA) April 9, 2022\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said.",
    "author": "Jordan Dixon-Hamilton",
    "title": "Donald Trump Endorses Mehmet Oz in Pennsylvania U.S. Senate Race"
  },
  {
    "id": 1235,
    "mediaId": 2592,
    "date": "2022-04-09",
    "sentence": "Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for U.S. Senate in Pennsylvania.",
    "author": "Moira Warburton and Jan Wolfe",
    "title": "Trump Endorses Celebrity Surgeon Dr. Mehmet Oz For U.S. Senate Seat In Pennsylvania"
  },
  {
    "id": 1656,
    "mediaId": 2602,
    "date": "2022-04-09",
    "sentence": "Former US President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for US Senate in Pennsylvania.",
    "author": "REUTERS",
    "title": "Trump endorses celebrity surgeon Dr. Oz for US Senate seat in Pennsylvania"
  },
  {
    "id": 1839,
    "mediaId": 2637,
    "date": "2022-04-09",
    "sentence": "Article content\nWASHINGTON — Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for U.S. Senate in Pennsylvania.",
    "author": "",
    "title": "Trump endorses celebrity surgeon Dr. Mehmet Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 1263,
    "mediaId": 6509,
    "date": "2022-04-09",
    "sentence": "In a statement, Trump described Oz as “Pro-Life, very strong on Crime, the Border, Election Fraud, our Great Military, and our Vets, Tax Cuts\" and as someone who would “always fight for and support our under siege Second Amendment.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump wrote.",
    "author": "David Chang",
    "title": "Former President Trump Endorses Dr. Oz in Pa. Senate Primary Race"
  },
  {
    "id": 1219,
    "mediaId": 2641,
    "date": "2022-04-09",
    "sentence": "Stumping for North Carolina GOP Senate primary candidate Ted Budd, former President Donald Trump added an official endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's hotly contested GOP Senate primary at Saturday's Save America rally.",
    "author": "Eric Mack",
    "title": "Trump: 'Right Now Our Country Is a Laughingstock'"
  },
  {
    "id": 1176,
    "mediaId": 2664,
    "date": "2022-04-09",
    "sentence": "The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" Trump said in a statement emailed to reporters.",
    "author": "Bob Brigham",
    "title": "Trump cites TV while endorsing Dr. Oz for Senate: 'He has lived with us through the screen'"
  },
  {
    "id": 520,
    "mediaId": 2636,
    "date": "2022-04-09",
    "sentence": "Wading into a tight Republican Senate primary in Pennsylvania, former President Donald J. Trump endorsed <span class='selected-term'>Mehmet Oz</span> on Saturday, throwing his weight behind the former star of “The Dr. Oz Show,” who has been attacked by rivals as a closet liberal.",
    "author": "",
    "title": "Trump Endorses Dr. Oz in Pennsylvania Senate Race"
  },
  {
    "id": 474,
    "mediaId": 2637,
    "date": "2022-04-09",
    "sentence": "Article content\nWASHINGTON — Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican in a closely watched U.S. Senate contest in Pennsylvania.",
    "author": "",
    "title": "Trump endorses celebrity surgeon Dr. Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 580,
    "mediaId": 2680,
    "date": "2022-04-09",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "JILL COLVIN and MARC LEVY",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 588,
    "mediaId": 6598,
    "date": "2022-04-09",
    "sentence": "| Riccardo Savi/Getty Images for Concordia Summit\nBy Holly Otterbein and Natalie Allison\n 04/09/2022 06:44 PM EDT\nUpdated: 04/09/2022 08:10 PM EDT\nDr. <span class='selected-term'>Mehmet Oz</span> has won the race for Donald Trump’s coveted endorsement in Pennsylvania’s Senate GOP primary.",
    "author": "",
    "title": "Trump endorses Oz in key Senate race"
  },
  {
    "id": 615,
    "mediaId": 2551,
    "date": "2022-04-09",
    "sentence": "Former President Donald Trump on Saturday evening announced he was endorsing TV surgeon Dr. <span class='selected-term'>Mehmet Oz</span> in the bitter contest to become the Republican nominee for a U.S. Senate seat in Pennsylvania.",
    "author": "",
    "title": "Trump delivers prized endorsement to 'brilliant' Dr Oz in Pennsylvania Senate race - even though the TV surgeon once told the former president to lose weight"
  },
  {
    "id": 667,
    "mediaId": 2644,
    "date": "2022-04-09",
    "sentence": "Donald Trump endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in his bid for Pennsylvania’s open Senate seat, the former president announced Saturday.",
    "author": "Patrick Reilly",
    "title": "Trump gives Dr. Oz ‘complete and total endorsement’ in wide-open PA Senate race"
  },
  {
    "id": 637,
    "mediaId": 2528,
    "date": "2022-04-09",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.\"",
    "author": "Hannah Getahun",
    "title": "Trump endorsed Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 659,
    "mediaId": 2728,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.“\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Jill Colvin And Marc Levy",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 620,
    "mediaId": 2745,
    "date": "2022-04-09",
    "sentence": "Former president Donald Trump on Saturday jumped into a high-stakes intraparty contest, endorsing fellow television celebrity-turned-politician <span class='selected-term'>Mehmet Oz</span> in the contested Republican primary for the U.S. Senate in Pennsylvania, where the leading candidates jockeyed aggressively for Trump’s support.",
    "author": "",
    "title": "Trump endorses Dr. Oz in Pennsylvania Senate race, a key battleground"
  },
  {
    "id": 290,
    "mediaId": 2679,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "MARC LEVY",
    "title": "Trump endorses Oz in Pennsylvania’s Senate primary race"
  },
  {
    "id": 309,
    "mediaId": 2509,
    "date": "2022-04-09",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 272,
    "mediaId": 2685,
    "date": "2022-04-09",
    "sentence": "\"Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "JILL COLVIN and MARC LEVY Associated Press",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 284,
    "mediaId": 2590,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday, Trump said his decision was “all about winning elections” as he announced his support for the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\nAdvertisement\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Jill Colvin",
    "title": "Trump Endorses Oz In Pennsylvania's Senate Primary Race"
  },
  {
    "id": 379,
    "mediaId": 2548,
    "date": "2022-04-09",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump added.",
    "author": "Michael Ginsberg",
    "title": "Trump Endorses Dr. Mehmet Oz In Pennsylvania GOP Senate Primary"
  },
  {
    "id": 338,
    "mediaId": 2631,
    "date": "2022-04-09",
    "sentence": "Former President Donald Trump endorsed Dr. <span class='selected-term'>Mehmet Oz</span> in Pennsylvania's Senate GOP primary.",
    "author": "",
    "title": "Trump endorses Dr. Mehmet Oz in Pennsylvania Senate GOP primary"
  },
  {
    "id": 337,
    "mediaId": 4043,
    "date": "2022-04-09",
    "sentence": "Dr <span class='selected-term'>Mehmet Oz</span>, a Turkish-American TV personality who made more than 60 appearances on Winfrey's show before it stopped airing in 2011, is running to replace retiring Republican Pat Toomey in Pennsylvania.",
    "author": "Tom Acres",
    "title": "Donald Trump endorses celebrity surgeon known for guesting on Oprah in crucial Senate race"
  },
  {
    "id": 218,
    "mediaId": 2746,
    "date": "2022-04-09",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nDuring his speech in North Carolina, Mr. Trump praised Mr. Oz’s career, adding that his success on television will serve him well with voters.",
    "author": "Joseph Clark",
    "title": "Trump endorses Dr. Oz for Senate"
  },
  {
    "id": 138,
    "mediaId": 2557,
    "date": "2022-04-09",
    "sentence": "pic.twitter.com/yLhKsZm9sl\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) November 30, 2021\nDonald Trump endorsed celebrity physician Mehmet Oz over former Bridgewater CEO David McCormick in the Republican primary for a Pennsylvania Senate seat, providing crucial support that could swing a close race https://t.co/8dsLGek9cS\n— Bloomberg (@business) April 10, 2022\nLeftist media is criticizing Oz, claiming he “has a considerable financial stake in pharmaceutical firms and tech giants,” according to newly released records.",
    "author": "DML News App",
    "title": "BREAKING: Trump announces major US Senate endorsement in battleground state"
  },
  {
    "id": 166,
    "mediaId": 2594,
    "date": "2022-04-09",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Via AP news wire",
    "title": "Trump endorses Oz in Pennsylvania's Senate primary race"
  },
  {
    "id": 331,
    "mediaId": 2537,
    "date": "2022-04-10",
    "sentence": "The biggest name in Pennsylvania's Senate race – <span class='selected-term'>Mehmet Oz</span> – has secured the endorsement of the GOP's biggest name, Donald Trump.",
    "author": "Katie Wadington",
    "title": "Trump endorses celebrity surgeon Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 387,
    "mediaId": 2790,
    "date": "2022-04-10",
    "sentence": "Former President Donald Trump has endorsed fellow TV personality-turned-politician Dr. <span class='selected-term'>Mehmet Oz</span> for the U.S. Senate ahead of the Republican primary in Pennsylvania.",
    "author": "Emma Bowman",
    "title": "Trump endorses Dr. Oz for the U.S. Senate in Pennsylvania"
  },
  {
    "id": 252,
    "mediaId": 2740,
    "date": "2022-04-10",
    "sentence": "The biggest name in Pennsylvania's Senate race – <span class='selected-term'>Mehmet Oz</span> – has secured the endorsement of the GOP's biggest name, Donald Trump.",
    "author": "Katie Wadington",
    "title": "Trump endorses celebrity surgeon Dr. Oz in Pennsylvania's Senate race"
  },
  {
    "id": 647,
    "mediaId": 2688,
    "date": "2022-04-10",
    "sentence": "Senate Minority Leader Mitch McConnell (R-KY) on Sunday declined to weigh in on former President Trump’s endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the crowded Pennsylvania Senate race just weeks before the GOP primary.",
    "author": "Matt Shuham",
    "title": "McConnell Sidesteps Trump’s Endorsement Of Celebrity Doctor Oz Weeks Before GOP Primary"
  },
  {
    "id": 599,
    "mediaId": 2654,
    "date": "2022-04-10",
    "sentence": "In a statement Saturday evening, Trump said his decision was “all about winning elections” as he formally backed the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Jill Colvin",
    "title": "Trump endorses Dr. Oz in Pennsylvania’s Senate race"
  },
  {
    "id": 458,
    "mediaId": 2716,
    "date": "2022-04-10",
    "sentence": "Former President Donald Trump announced his endorsement of author, TV star, retired surgeon, and Pennsylvania Senate candidate <span class='selected-term'>Mehmet Oz</span> on Saturday, NBC News reported.",
    "author": "Grayson Quay",
    "title": "Trump endorses Dr. Oz for Senate"
  },
  {
    "id": 438,
    "mediaId": 2534,
    "date": "2022-04-10",
    "sentence": "In his statement, he noted that Oz was a well-known quantity who has “lived with us through the screen and has always been popular, respected, and smart.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,\" he added.",
    "author": "Jill Colvin and Marc Levy",
    "title": "Trump backs Dr. Oz: Will Pennsylvania MAGA voters embrace it?"
  },
  {
    "id": 523,
    "mediaId": 2592,
    "date": "2022-04-10",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" the endorsement read.",
    "author": "Ashley Palya",
    "title": "Trump Endorses Dr. Oz In Pennsylvania Senate Race, Says Decision 'All About Winning Elections'"
  },
  {
    "id": 531,
    "mediaId": 2861,
    "date": "2022-04-10",
    "sentence": "Trump said of Oz “doctor is smart, tough, and will never let you down.”\nFormer President Donald Trump on Saturday endorsed “the brilliant and well-known” Dr. <span class='selected-term'>Mehmet Oz</span> in his bid to represent Pennsylvania in the U.S. Senate, saying the “doctor is smart, tough, and will never let you down.”\nI get paid more than $90 to $100 per hour for working online.",
    "author": "",
    "title": "WATCH: Trump endorses Dr. Oz for Pennsylvania Senate says the “doctor is smart, tough, and will never let you down”"
  },
  {
    "id": 553,
    "mediaId": 6746,
    "date": "2022-04-10",
    "sentence": "Former United States President Donald Trump announced on Saturday that he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span> in the Senatorial race in Pennsylvania.",
    "author": "Quincy Cahilig",
    "title": "Donald Trump Endorses \"Tough\" Celebrity Surgeon Mehmet Oz in US Senate Race in Pennsylvania"
  },
  {
    "id": 513,
    "mediaId": 2532,
    "date": "2022-04-10",
    "sentence": "Oz is the antithesis of everything that made Trump the best president of my lifetime—he's the farthest thing from America First & he'd be very bad for PA.\"\n2022 Midterm Elections\n More\n A test for Trump as Michigan GOP gathers\n McCarthy considered telling Trump to resign after Jan. 6, recording shows\n Bernie Sanders hasn't ruled out third run for presidency\n Florida governor approves map that could give GOP more U.S. House seats\n Tennessee GOP kicks Trump-backed candidate off congressional primary ballot\n More\nIn:\nPennsylvania\nUnited States Senate\n<span class='selected-term'>Mehmet Oz</span>\nDonald Trump",
    "author": "",
    "title": "Trump endorses Dr. Mehmet Oz in Pennsylvania Senate primary race"
  },
  {
    "id": 833,
    "mediaId": 2640,
    "date": "2022-04-10",
    "sentence": "The former president said he's backing <span class='selected-term'>Mehmet Oz</span>—aka the TV celebrity known as Dr. Oz—in Pennsylvania's Republican Senate primary.",
    "author": "John Johnson",
    "title": "Trump Endorses Big Name in a Big Race"
  },
  {
    "id": 727,
    "mediaId": 2556,
    "date": "2022-04-10",
    "sentence": "“The great commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nIn his statement, Trump also said Oz was especially popular with women because of his work in daytime TV, and could do well in Philadelphia and Pittsburgh.",
    "author": "",
    "title": "Dr. Oz Picks Up Donald Trump Endorsement For Republican Nod In Pennsylvania Senate Race"
  },
  {
    "id": 812,
    "mediaId": 2540,
    "date": "2022-04-11",
    "sentence": "That fact was borne out over the weekend when Trump endorsed TV doctor <span class='selected-term'>Mehmet Oz</span> over hedge fund rich guy David McCormick in advance of next month's Republican Senate primary.",
    "author": "Chris Cillizza",
    "title": "The very simple reason why Donald Trump chose Mehmet Oz in Pennsylvania"
  },
  {
    "id": 804,
    "mediaId": 5308,
    "date": "2022-04-11",
    "sentence": "“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.”\nTrump’s endorsement touted Oz’s books and television show, and said that “women, in particular, are drawn to Dr. Oz for his advice and counsel”—portraying this quality as one that would help Oz win the election.",
    "author": "Paul Blest",
    "title": "Trump Endorsed Dr. Oz and Republicans Are Pissed"
  },
  {
    "id": 869,
    "mediaId": 6428,
    "date": "2022-04-11",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> gained a celebrity endorsement from another prominent T.V.",
    "author": "",
    "title": "Trump Endorses Dr. Oz in Pennsylvania's Crowded GOP Senate Primary"
  },
  {
    "id": 514,
    "mediaId": 2540,
    "date": "2022-04-11",
    "sentence": "\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,\" Trump said in a statement announcing the endorsement.",
    "author": "Chris Cillizza",
    "title": "The ridiculous price tag for a Senate race"
  },
  {
    "id": 445,
    "mediaId": 2624,
    "date": "2022-04-11",
    "sentence": "Trump’s standing has improved in North Carolina, where he has endorsed Rep. Ted Budd for the state’s open Senate seat, and in Pennsylvania, where he endorsed former television host Dr. <span class='selected-term'>Mehmet Oz</span> for Senate over the weekend as “the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\nIn Ohio, where Trump has also not weighed in on Republican Gov.",
    "author": "Eli Yokley",
    "title": "Trump’s Endorsees May Lose Some Primaries, but He’s Still the GOP’s Dominant Force"
  },
  {
    "id": 690,
    "mediaId": 4024,
    "date": "2022-04-11",
    "sentence": "PENNSYLVANIA (LifeSiteNews) – Former President Donald Trump disappointed some of his most ardent supporters over the weekend by endorsing TV personality Dr. <span class='selected-term'>Mehmet Oz</span> in the Republican primary for a U.S. Senate seat in Pennsylvania, despite his history of staking out left-wing positions on issues important to conservatives.",
    "author": "",
    "title": "Dr. Oz receives Trump endorsement for Senate despite support for abortion, ‘transitioning’ kids"
  },
  {
    "id": 326,
    "mediaId": 2724,
    "date": "2022-04-11",
    "sentence": "pic.twitter.com/XkIE6qV4R0\n— Dr. <span class='selected-term'>Mehmet Oz</span> (@DrOz) March 16, 2022\nWe live in a time where too many Republicans try selling their conservative wares just to get elected only to start functioning like barely-disguised left-of-center RINOs once they get into office.",
    "author": "Rusty Weiss",
    "title": "I’m Just Going To Say This: Trump’s Endorsement Of Dr. Oz Is The Wrong Move"
  },
  {
    "id": 320,
    "mediaId": 2533,
    "date": "2022-04-11",
    "sentence": "Dr. Oz also passionately believes in high-quality education and protecting parent involvement throughout the process.”\n“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country.”\n“Women, in particular, are drawn to Dr. Oz for his advice and counsel.",
    "author": "Staff -",
    "title": "Dr. Oz Is Running for Senate and He Just Got Big News From Donald Trump"
  },
  {
    "id": 400,
    "mediaId": 2643,
    "date": "2022-04-11",
    "sentence": "Trump made headlines over the weekend for endorsing Dr. <span class='selected-term'>Mehmet Oz</span> for Senate ahead of the Republican primary in Pennsylvania.",
    "author": "Alexandra Hutzler",
    "title": "Trump Hugely Popular in States With Key Senate Races"
  },
  {
    "id": 51,
    "mediaId": 2658,
    "date": "2022-04-11",
    "sentence": "— Minority Leader Mitch McConnell (R-Ky.)\n\"The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate.",
    "author": "",
    "title": "Donald Trump endorsed Dr. Mehmet Oz over the weekend in the Pennsylvania Senate race. Mitch McConnell didn't follow suit."
  },
  {
    "id": 117,
    "mediaId": 2687,
    "date": "2022-04-12",
    "sentence": "Amanda Carpenter: “LOL, if you thought Donald Trump’s endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> for Senate was the worst development in Pennsylvania’s 2022 GOP primaries, wait until you hear about the Republicans running for governor.”\n“Pennsylvania Republicans will nominate a 2020 election conspiracist for governor in the May 17 primary.",
    "author": "Taegan Goddard",
    "title": "Pennsylvania GOP Will Nominate a Crackpot for Governor"
  },
  {
    "id": 663,
    "mediaId": 6746,
    "date": "2022-04-12",
    "sentence": "On Saturday night, Trump outraged Pennsylvania conservatives by endorsing TV personality Dr. <span class='selected-term'>Mehmet Oz</span>, a more moderate Republican candidate for the state's open Senate seat.",
    "author": "Madz Dizon",
    "title": "Mitch McConnell Warns GOP Could Screw Up Senate Takeover in Midterm Election with \"Unacceptable Candidates\""
  },
  {
    "id": 617,
    "mediaId": 2656,
    "date": "2022-04-12",
    "sentence": "Donald Trump’s recent endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Republican Senate primary shook MAGA world to its core.",
    "author": "Rick Moran",
    "title": "The Silly Talk of Trump's Demise Over Oz Endorsement"
  },
  {
    "id": 401,
    "mediaId": 2640,
    "date": "2022-04-12",
    "sentence": "(Newser) – Over the weekend, former President Trump endorsed <span class='selected-term'>Mehmet Oz</span>—better known to Americans as Dr. Oz—in the GOP Senate primary in Pennsylvania.",
    "author": "John Johnson",
    "title": "Trump's Dr. Oz Endorsement Is Proving Controversial"
  },
  {
    "id": 880,
    "mediaId": 2631,
    "date": "2022-04-12",
    "sentence": "“Perhaps most importantly, I believe that <span class='selected-term'>Mehmet Oz</span> will be the one most able to win the General Election against a Radical Left Democrat looking to do unthinkable harm to our Country,” Trump said in his statement.",
    "author": "",
    "title": "‘Dr. Oz’ bets Trump endorsement can catapult him in Pa. Senate race"
  },
  {
    "id": 162,
    "mediaId": 2687,
    "date": "2022-04-13",
    "sentence": "",
    "author": "Taegan Goddard",
    "title": "McCormick Raised $4.3 Million in First Quarter"
  },
  {
    "id": 177,
    "mediaId": 2592,
    "date": "2022-04-13",
    "sentence": "Donald Trump's decision to endorse celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate race has divided local Republican Party officials and stunned close advisers who thought he had decided to stay out of the contest to pick a Republican candidate, two sources familiar with internal deliberations told Reuters.",
    "author": "Jarrett Renshaw",
    "title": "Trump Endorsement Of Dr. Oz In Senate Race Stuns Advisers, Divides Loyalists"
  },
  {
    "id": 410,
    "mediaId": 6526,
    "date": "2022-04-14",
    "sentence": "I saw the latest campaign commercial for <span class='selected-term'>Mehmet Oz</span> on Wednesday morning.",
    "author": "Paul Muschick",
    "title": "Is the Pennsylvania GOP Senate primary over because Trump endorsed Dr. Oz?"
  },
  {
    "id": 903,
    "mediaId": 2688,
    "date": "2022-04-14",
    "sentence": "Burned by the backlash that ensued upon former President Trump’s endorsement of celebrity doctor <span class='selected-term'>Mehmet Oz</span> in the hotly contested Pennsylvania Senate GOP primary, Trumpworld figures are rushing to contain the fallout that has MAGAland in a frenzy.",
    "author": "Matt Shuham",
    "title": "Trumpworld Attempts Damage Control After Oz Endorsement Angers MAGA Crowd"
  },
  {
    "id": 721,
    "mediaId": 2659,
    "date": "2022-04-14",
    "sentence": "",
    "author": "Jason Easley",
    "title": "John Fetterman’s Support Grows 13 Points In A Month In PA Senate Primary"
  },
  {
    "id": 461,
    "mediaId": 4091,
    "date": "2022-04-15",
    "sentence": "(Natural News) Dr. <span class='selected-term'>Mehmet Oz</span> is running for the United States Senate in the Commonwealth of Pennsylvania, and former President Donald Trump is endorsing him.",
    "author": "Ethan Huff",
    "title": "Trump officially endorses Dr. Oz, calls him “smart, tough” … but not all conservatives are happy about it"
  },
  {
    "id": 129,
    "mediaId": 2557,
    "date": "2022-04-15",
    "sentence": "As the most reliable and balanced news aggregation service on the internet, DML News App offers the following information published by Breitbart:\nCelebrity Doctor <span class='selected-term'>Mehmet Oz</span>, who is running as a tough-on-China candidate in the race to fill Pennsylvania’s Senate seat, is coming under fire again for his long history with the communist country.",
    "author": "DML News App",
    "title": "REPORT: Mehmet Oz’s China Ties Deepen: Financial Disclosures"
  },
  {
    "id": 247,
    "mediaId": 2699,
    "date": "2022-04-17",
    "sentence": "On Sunday evening’s edition of Last Week Tonight, John Oliver kicked off the show by addressing former President Donald Trump’s recent endorsement of snake-oil salesman Dr. <span class='selected-term'>Mehmet Oz</span>, who aggressively pushed hydroxychloroquine as a COVID-19 treatment during the pandemic, in the Pennsylvania Senate race.",
    "author": "Marlow Stern",
    "title": "John Oliver Reveals How He’s Been Trolling Dr. Oz for Years"
  },
  {
    "id": 433,
    "mediaId": 2721,
    "date": "2022-04-17",
    "sentence": "In Pennsylvania, for example, he endorsed Dr. <span class='selected-term'>Mehmet Oz</span> who, like Trump, was a longtime TV personality before entering politics.",
    "author": "",
    "title": "Mitch McConnell openly attacks Trump"
  },
  {
    "id": 603,
    "mediaId": 2894,
    "date": "2022-04-17",
    "sentence": "",
    "author": "Bryan Anderson",
    "title": "Smart tactic or missed opportunity? Budd is the latest GOP frontrunner to avoid debates"
  },
  {
    "id": 672,
    "mediaId": 6497,
    "date": "2022-04-18",
    "sentence": "Not surprisingly, Donald Trump’s endorsement of Dr. <span class='selected-term'>Mehmet Oz</span> in the Pennsylvania Senate — and Oz’s campaign itself — aren’t sitting well with John Oliver.",
    "author": "Kimberly Nordyke",
    "title": "John Oliver Takes on Dr. Oz and His “Sh— Show” Senate Campaign on ‘Last Week Tonight’"
  },
  {
    "id": 484,
    "mediaId": 2752,
    "date": "2022-04-18",
    "sentence": "The Republican primary is a tighter race with Dr. <span class='selected-term'>Mehmet Oz</span> and David McCormick more or less tied, although Oz has more support among the “Trump faction of the party,” which is all that’s left of the GOP.",
    "author": "Stephen Robinson",
    "title": "PA Senate Candidate John Fetterman Leading Race To Convince Voters He’s Better Than Dr. Oz"
  },
  {
    "id": 333,
    "mediaId": 6570,
    "date": "2022-04-18",
    "sentence": "New financial reports filed Friday reveal in detail how <span class='selected-term'>Mehmet Oz</span> and David McCormick, the leading Republican candidates in Pennsylvania’s U.S. Senate race, have spent a combined $18 million from their own personal fortunes to fuel their campaigns and make it the most expensive primary election in the country.",
    "author": "",
    "title": "Pa. U.S. Senate Republican primary: Now we know how much Mehmet Oz and David McCormick are personally spending on their campaigns"
  },
  {
    "id": 353,
    "mediaId": 2644,
    "date": "2022-04-18",
    "sentence": "The former president and longtime reality TV personality stepped in recently to endorse Dr. <span class='selected-term'>Mehmet Oz</span>, another erstwhile reality personality, in his Republican bid for a Pennsylvania Senate seat.",
    "author": "Kase Wickman",
    "title": "John Oliver Tears Into Dr. Oz’s ‘Sh*t Show’ Senate Campaign"
  },
  {
    "id": 100,
    "mediaId": 2550,
    "date": "2022-04-18",
    "sentence": "“I’m a gambler,” Trump told one aide about wading into the Pennsylvania primary a second time—this time to endorse fellow TV huckster Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Trump's loving every minute of kneecapping Republicans' midterm chances"
  },
  {
    "id": 118,
    "mediaId": 2641,
    "date": "2022-04-19",
    "sentence": "One week after Donald Trump endorsed celebrity Dr. <span class='selected-term'>Mehmet Oz</span> for the Senate in Pennsylvania, and one month before the primary, a just-completed poll shows a wide open Republican primary.",
    "author": "John Gizzi",
    "title": "Trafalgar Poll: Pennsylvania GOP Senate Primary Wide Open"
  },
  {
    "id": 228,
    "mediaId": 2550,
    "date": "2022-04-20",
    "sentence": "Democrats clearly see their best pickup opportunity in Pennsylvania, where Trump recently endorsed fellow TV huckster Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Senate GOP super PAC playing a lot of defense for a supposed"
  },
  {
    "id": 271,
    "mediaId": 5308,
    "date": "2022-04-20",
    "sentence": "He is running for Senate to fight the wokeness that liberals like <span class='selected-term'>Mehmet Oz</span> have pushed on our society.",
    "author": "Cameron Joseph",
    "title": "Senate candidate David McCormick has pledged to “fight the woke mob,” but he once called for “solidarity by denouncing and eradicating structural bigotry.”"
  },
  {
    "id": 405,
    "mediaId": 2629,
    "date": "2022-04-20",
    "sentence": "Democrats clearly see their best pickup opportunity in Pennsylvania, where Trump recently endorsed fellow TV huckster Dr. <span class='selected-term'>Mehmet Oz</span>.",
    "author": "",
    "title": "Suddenly GOP Is On Defensive In Senate 2022 Campaign"
  },
  {
    "id": 492,
    "mediaId": 2656,
    "date": "2022-04-21",
    "sentence": "— Donald Trump wading into primaries and endorsing candidates who may not be the party’s best choice for the general election, such as television doctor <span class='selected-term'>Mehmet Oz</span> (R) in Pennsylvania.",
    "author": "Stephen Green",
    "title": "Sabato: Republicans 'Favorites' to Take Senate"
  },
  {
    "id": 569,
    "mediaId": 2730,
    "date": "2022-04-22",
    "sentence": "On the GOP side, Dr. <span class='selected-term'>Mehmet Oz</span> is leading in the polls.",
    "author": "Matt Vespa",
    "title": "Democrats Appear to Be Testing Progressive Populism In PA Senate Race"
  }
]