[
  {
    "id": 5508,
    "mediaId": 2641,
    "date": "2022-02-03",
    "sentence": "Hailing his name recognition, media chops, and medical background to take it to the failed health advisers in Washington, D.C., Dr. <span class='selected-term'>Mehmet Oz</span> told Newsmax he is the Pennsylvania Senate GOP primary candidate who can beat the Democrat in the general election next November.",
    "author": "Eric Mack",
    "title": "Dr. Oz to Newsmax: 'Pennsylvania Deserves a Big Voice, a Strong Voice'"
  },
  {
    "id": 5559,
    "mediaId": 2641,
    "date": "2022-02-09",
    "sentence": "Senatorial candidate Dr. <span class='selected-term'>Mehmet Oz</span>, R-Pa., told Newsmax on Tuesday night that campaigning has taught him Pennsylvanians know what's needed in Washington.",
    "author": "Charlie McCarthy",
    "title": "Dr. Oz to Newsmax: I'm Listening to Pennsylvanians"
  },
  {
    "id": 5792,
    "mediaId": 2630,
    "date": "2022-02-09",
    "sentence": "The former hedge fund manager has praised China in the past, the Philadelphia Inquirer reports, which has already fueled attack ads from celebrity doctor <span class='selected-term'>Mehmet Oz</span> (who has his own ties to China, per Politico).",
    "author": "",
    "title": "The era of big Covid mandates is ending"
  },
  {
    "id": 4562,
    "mediaId": 2664,
    "date": "2022-02-16",
    "sentence": "",
    "author": "Bob Brigham",
    "title": "Turkey’s autocratic ruler could have leverage over a future GOP senator: report"
  },
  {
    "id": 2976,
    "mediaId": 2641,
    "date": "2022-03-11",
    "sentence": "Dr. <span class='selected-term'>Mehmet Oz</span> is a heart surgeon, professor emeritus at Columbia University and Republican candidate for the U.S. Senate in Pennsylvania.",
    "author": "Dr. Mehmet Oz",
    "title": "Dr. Oz: Follow The Science For Domestic Energy Policy"
  },
  {
    "id": 2574,
    "mediaId": 4018,
    "date": "2022-03-21",
    "sentence": "“American Leadership Action” was established to back the candidacy of <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "author": "Ron Kampeas",
    "title": "AIPAC’s pro-democracy ‘super PAC’ does not mention Israel in its mission"
  },
  {
    "id": 1982,
    "mediaId": 2727,
    "date": "2022-03-22",
    "sentence": "“American Leadership Action” was established to back the candidacy of <span class='selected-term'>Mehmet Oz</span>, the TV doctor turned Republican running for Senate in Pennsylvania.",
    "author": "Ron Kampeas",
    "title": "Israel not mentioned in AIPAC’s new pro-democracy project"
  },
  {
    "id": 1936,
    "mediaId": 2822,
    "date": "2022-03-28",
    "sentence": "",
    "author": "JOSH BOAK",
    "title": "Biden's budget plan: Higher taxes on rich, lower deficits, more money for police, education"
  },
  {
    "id": 1534,
    "mediaId": 2728,
    "date": "2022-04-05",
    "sentence": "",
    "author": "Edward Keenan",
    "title": "Americans showed the world how to die from COVID-19. Are they about to do it again?"
  },
  {
    "id": 1839,
    "mediaId": 2637,
    "date": "2022-04-09",
    "sentence": "Article content\nWASHINGTON — Former U.S. President Donald Trump on Saturday said he is endorsing celebrity surgeon Dr. <span class='selected-term'>Mehmet Oz</span>, who is running as a Republican for U.S. Senate in Pennsylvania.",
    "author": "",
    "title": "Trump endorses celebrity surgeon Dr. Mehmet Oz for U.S. Senate seat in Pennsylvania"
  },
  {
    "id": 284,
    "mediaId": 2590,
    "date": "2022-04-09",
    "sentence": "In a statement Saturday, Trump said his decision was “all about winning elections” as he announced his support for the celebrity heart surgeon best known as the host of daytime TV’s “The Dr. Oz Show.”\nAdvertisement\n“The Great Commonwealth of Pennsylvania has a tremendous opportunity to Save America by electing the brilliant and well-known Dr. <span class='selected-term'>Mehmet Oz</span> for the United States Senate,” Trump said, in part.",
    "author": "Jill Colvin",
    "title": "Trump Endorses Oz In Pennsylvania's Senate Primary Race"
  }
]