{
  "id": 12897,
  "mediaId": 2540,
  "date": "2022-03-01",
  "headline": "Is Kevin McCarthy actually going to *do* something about Marjorie Taylor Greene?",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/220102092949-marjorie-taylor-greene-092221-file-super-tease.jpg",
  "link": "https://www.cnn.com/2022/03/01/politics/marjorie-taylor-greene-kevin-mccarthy/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Chris Cillizza",
  "authorUrl": "https://www.cnn.com/profiles/chris-cillizza",
  "termIds": [
    5001,
    2443,
    3049,
    4039,
    4066,
    3788,
    1126,
    392,
    300
  ],
  "sentences": [
    "\"Past comments from and endorsed by Marjorie Taylor Greene on school shootings, political violence, and anti-Semitic conspiracy theories do not represent the values or beliefs of the House Republican Conference,\" McCarthy said in a statement at the time.",
    "In fact, Gosar was censured by the House last year following his promotion of a photoshopped video that portrayed him appearing to kill Democratic Rep. Alexandria Ocasio-Cortez and attacking President Joe Biden.",
    "The last member to be reprimanded was Arizona Republican Rep. David Schweikert in 2020, following a House Ethics Committee investigation found he had committed a series of campaign finance violations.",
    "3) McCarthy could decide that Republican campaign committees would not accept contributions from Greene (or Gosar) or use either one of them to raise money for those campaign arms.",
    "On Monday night, McCarthy told CNN's Melanie Zanona that it was \"appalling and wrong\" for Greene and Gosar to speak at an event founded by the far-right activist Nick Fuentes.",
    "(CNN)Over the weekend, Republican Reps. Marjorie Taylor Greene of Georgia and Paul Gosar of Arizona spoke at a conference organized by a prominent White nationalist.",
    "As has been demonstrated repeatedly over the past year, strong words from party leadership don't do much of anything to slow what Greene says and does.",
    "\"Marjorie is wrong, and her intentional decision to compare the horrors of the Holocaust with wearing masks is appalling,\" he said.\"",
    "Eleven Republicans -- not including McCarthy -- voted with House Democrats to remove Greene from her committee assignments.",
    "Go back to early 2021, when a series of past incendiary and violent statements statements made by Greene came to light.",
    "Just a few months later, Greene was again in the news when she compared mask-wearing policies to the Holocaust.",
    "Or, more specifically, what House Minority Leader Kevin McCarthy will do about it.",
    "McCarthy met with Greene, but took no action to punish her for her actions.",
    "If past is prologue, the answer to that question is likely not much.",
    "On Tuesday, McCarthy was noncommittal when questioned about Greene.",
    "To which I would say: Yeah, but what are you going to DO about it?",
    "The fact that this needs to be stated today is deeply troubling.\"",
    "McCarthy added: \"There's no place in our party for any of this.",
    "Will he punt (again) on taking actual steps to punish Greene?",
    "The Holocaust is the greatest atrocity committed in history.",
    "1) McCarthy could sign onto a censure motion in the House.",
    "At this point, McCarthy's scolding of Greene is pointless.",
    "And, again, he took no formal action to reprimand her.",
    "The question now is what Republicans will do about it.",
    "2) McCarthy could push for a formal reprimand.",
    "While censure is not common, it does happen.",
    "So, the ball is in McCarthy's court (again).",
    "\"I understand your job,\" he told reporters.",
    "\"I condemn those comments unequivocally.\"",
    "\"I understand what you're trying to do.",
    "I've already commented on that.\"",
    "Again, McCarthy was not happy.",
    "This is unacceptable.\""
  ]
}