{
  "id": 1297,
  "mediaId": 8350,
  "date": "2022-02-14",
  "headline": "GOP Arizona Rep. Schweikert fined in campaign spending case",
  "image": "https://ktar.com/wp-content/uploads/2022/02/ap_6bc26753b3df46cdafb6fa37f29dbdd2.jpg",
  "link": "https://ktar.com/story/4888934/gop-arizona-rep-schweikert-fined-in-campaign-spending-case/",
  "mediaOutlet": "ktar.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "ASSOCIATED PRESS",
  "authorUrl": "https://ktar.com/story/author/associated-press/",
  "termIds": [
    0
  ],
  "sentences": [
    "Democrats slammed the FEC settlement, with the Democratic Congressional Campaign Committee issuing a statement calling Schweikert a “corrupt politician.”\n“David Schweikert has proven beyond a shadow of a doubt that he can’t be trusted to follow the law, and now he is — or rather, his campaign donors are — paying the price for it,” said committee spokesperson Monica Robinson.",
    "PHOENIX (AP) — Republican Arizona Rep. David Schweikert’s campaign committee has been hit with a $125,000 fine by the Federal Elections Commission for misreporting spending and diverting some campaign funds for personal use.",
    "The decision by the commission came nearly two years after Schweikert agreed to pay a $50,000 fine and admit to 11 violations to settle a long-running investigation by the U.S. House Ethics Committee.",
    "He failed to properly report three loans to his campaign, and the House probe concluded he was aware that some campaign expenses were being mislabeled and misled investigators as to what he knew.",
    "Schweikert beat back a polished Democratic candidate who spent lavishly in 2020 to try to unseat him, with much attention focused on the Ethics Committee report that had been released in July.",
    "“No one has been more directly harmed by the malfeasance of Congressman Schweikert’s former Chief of Staff than Friends of David Schweikert,” consultant Chris Baker said in a statement.",
    "The just-completed redistricting cycle added more of the north Phoenix suburbs to his district, which was renumbered from the 6th Congressional District to the 1st District.",
    "Baker said Schweikert is popular in his district and even with a somewhat smaller GOP voter registration edge after redistricting he’s not worried.",
    "Some of the misfilings were intended to “conceal impermissible or embarrassing disbursements from public view,” the report said.",
    "Schweikert has blamed his former chief of staff for many of the issues, with his campaign consultant repeating that on Monday.",
    "Schweikert has represented parts of north Phoenix, Scottsdale, Fountain Hills and Paradise Valley since 2011.",
    "But the FEC report, citing the House Ethics Committee investigation, said Schweikert had plenty of blame.",
    "Former Chief of Staff Oliver Schwab also agreed to settle the FEC allegations and pay a $7,500 fine.",
    "Schweikert self-reported the issues to the FEC after the Ethics Committee settlement in July 2020.",
    "This material may not be published, broadcast, rewritten or redistributed.",
    "“We feel very confident about 2022,” Baker said.",
    "Copyright © The Associated Press.",
    "Schwab left his job in 2018.",
    "All rights reserved.",
    "Share\nComments"
  ]
}