{
  "id": 13794,
  "mediaId": 8251,
  "date": "2022-03-16",
  "headline": "Arizona Congressional delegation calls for US to do more after Ukrainian President Zelenskyy's speech",
  "image": "https://media.12news.com/assets/KPNX/images/d64018dc-1e2c-41d1-8619-a77df0602206/d64018dc-1e2c-41d1-8619-a77df0602206_1140x641.jpg",
  "link": "https://www.12news.com/article/news/politics/national-politics/arizona-congressional-delegation-calls-us-more-after-ukrainian-president-zelenskyys-speech/75-7c02f9d0-4cc0-466a-9dd8-72010e335265",
  "mediaOutlet": "12news.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "Putin’s political allies must be personally sanctioned to hold them responsible for enabling this carnage\"\nRepresentative David Schweikert:\n\"I had the honor of listening to President Zelensky this morning as he addressed Congress virtually from Kyiv.",
    "pic.twitter.com/Fp115IrCr7\n— Rep. David Schweikert (@RepDavid) March 16, 2022\nRepresentative Ruben Gallego:\n\"Since traveling to Kyiv last December, I have been witness to a Ukrainian people determined to protect their homeland by any means necessary.",
    "PHOENIX — After a bold and unique address to world leaders from Ukrainian President Volodymyr Zelenskyy, members of Arizona's congressional delegation stood in support of providing additional aid to Ukraine during its fight against Russia.",
    "I support the assistance that we continue to deliver and will support additional aid, short of U.S. intervention, to provide the Ukrainian people the means to protect themselves and mitigate the unfolding humanitarian disaster.",
    "The United States should continue providing military equipment and humanitarian support to Ukrainians, increase financial punishments on Putin and his regime, and boost our cyber defense against Russian threats.",
    "Representative Raul Grijalva:\n\"President Zelensky’s address to Congress today was an impassioned speech and direct appeal to President Biden and Congress to put ourselves in the shoes of his citizens.",
    "Zelenskyy showed a graphic video depicting the destruction and devastation his country has suffered in the war with Russia, along with heartbreaking scenes of civilian casualties.",
    "I remain committed to supporting Ukraine with the anti-tank and air defense assets, intelligence, and aid it needs to fight the ruthlessness of Putin and the Russian army.\"",
    "I stand ready to support policies that keep America safe, promote our country’s and our allies’ long-term security, and ensure our servicemembers' safety.\"",
    "Representative Greg Stanton:\n\"President Zelenskyy has exemplified the courage of the Ukrainian people, and his address today was a sobering call to action.",
    "U.S. senators and representatives for Arizona expressed their support of the Ukrainian president's appeal for the country to provide more help to Ukraine.",
    "And, though we have led the world to impose historically strong sanctions to cripple Russia’s economy and slow Putin's war machine, they must be stronger.",
    "Last week, I voted to approve $13.6 billion in aid to Ukraine, including military equipment to strengthen the country's air defense capabilities.",
    "President Zelenskyy’s joint address to Congress showed our unity supporting Ukraine’s efforts as it protects itself against Russia’s invasion.",
    "Senator Kyrsten Sinema:\n\"The world continues to witness Russia’s unprovoked and illegal attacks on a free, democratic, and sovereign Ukraine.",
    "President Zelenskyy has moved nations around the world to understand the Ukrainian struggle, and today’s speech to Congress was no different.",
    "Conflict in Ukraine\nFor the latest updates on the conflict between Ukraine and Russia stay with 12 News online and on our YouTube channel.",
    "But I believe the U.S. can—and must—do more to counter Russia’s unprovoked aggression and indiscriminate attacks on Ukrainian civilians.",
    "On Wednesday, Zelenskyy pleaded with the U.S. Congress \"to do more\" to help during a virtual speech at the Capitol.",
    "I had the honor of listening to President Zelensky this morning as he addressed Congress virtually from Kyiv.",
    "But rather than an enforced no-fly zone, he instead sought other military aid to stop Russian airstrikes.",
    "Putin must return to the negotiating table, stop the human suffering and end this conflict immediately.\"",
    "\"I call on you to do more.”\nZelenskyy said the U.S. must sanction Russian lawmakers and block imports.",
    "His bravery and courage, and that of all Ukrainians, in the face of Russian brutality is remarkable.",
    "His bravery and courage, and that of all Ukrainians, in the face of Russian brutality is remarkable.",
    "The United States must continue to stand with our Ukrainian partners and against Russian aggression.",
    "Lawmakers at the Capitol complex gave him a standing ovation, before and after his short remarks.",
    "Those in the Arizona congressional delegation made statements reacting to Zelenskyy's speech.",
    "It’s time to provide Ukraine with military jets and additional anti-aircraft weapons.",
    "The images we saw of the devastation, despair and death were impossible to ignore.",
    "These funds are critical to helping Ukrainian forces.",
    "The Associated Press contributed to this report.",
    "“We need you right now,” Zelenskyy said.",
    "I stand with the people of Ukraine.\"",
    "I stand with the people of Ukraine.",
    "????????"
  ]
}