{
  "id": 7330,
  "mediaId": 2664,
  "date": "2022-04-07",
  "headline": "Sarah Palin facing shrugs and 'outright hostility' from Republicans over new political bid: report",
  "image": "https://www.rawstory.com/media-library/watch-live-cpac-2015.jpg?id=24711115&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.rawstory.com/sarah-palin-2657113823/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tom Boggioni",
  "authorUrl": "https://www.rawstory.com/u/tom_boggioni",
  "termIds": [
    4992,
    2119,
    2678,
    3788,
    3799,
    3765,
    1126,
    5930,
    6678
  ],
  "sentences": [
    "Pointing out that Palin is facing \"outright hostility,\" the report notes that influential conservative activist Suzanne Downing -- who runs the conservative Must Read Politics blog -- has already taken shots at the former half-term governor by writing, \"We lived through her time in office and we’ve not recovered.”\nThe report adds, \"Some Republicans’ ambivalence toward Palin—or outright hostility—will help define a race that has rapidly become one of the country’s most compelling, and complex, contests in this 2022 midterm election season.\"",
    "We just want a good, conservative Republican to win.”\nRep. Ronny Jackson (R-TX) could only offer, \"Sure, why not?” while Rep. David Schweikert (R-AZ) was outright dismissive, telling the Beast, \"We actually are sort of in the time of the celebrity candidate.",
    "With the death of Rep. Don Young (R-AK) after almost 50 years in Congress, the race to fill his seat has led to a flood of close to fifty hopefuls with Palin -- famous for only serving half of her term as governor -- jumping in at at the last minute.",
    "Sarah Palin's decision to run for Alaska's sole seat in the U.S. House of Representatives has landed with a thud among Republicans in both her home state and in the halls of Congress, according to a report from the Daily Beast.",
    "When asked about a Palin run, high-profile Ohio Rep. Jim Jordan's first response was a less-than-enthusiastic, \"That's fine,\" before qualifying his comment with, \"There are lots of good people, but she would be great.",
    "It's just the nature of the environment.”\nBack in Alaska, Palin is getting more resistance from Republicans who still remember how she quit on the state to become a celebrity.",
    "As the Beast reports, Palin's announcement was met with general disinterest by some House Republicans with one saying her bid is nothing special in today's political climate.",
    "\"In the corners most primed for a Palin comeback, not everyone seemed to be celebrating America’s 'Mama Grizzly' coming out of political hibernation.",
    "\"When The Daily Beast asked their thoughts on Palin’s campaign, for instance, two prominent MAGA lawmakers literally shrugged in response.\"",
    "That responsibility belongs to a group with perhaps the most complicated relationship to Palin: the voters of Alaska,\" the report states.",
    "At times, the reception from Palin’s would-be colleagues has been downright ambivalent,\" the Beast is reporting.",
    "\"It would be one thing if Palin’s ascent were to be decided by her would-be colleagues—or by Trump—but it’s not.",
    "In Alaska, conservative activists have stronger opinions, with some wishing she stay out of it.",
    "Democratic and GOP operatives alike say recent polling shows Palin remains deeply unpopular.\"",
    "In a weird way… I hate to say this… ‘So?’ We have professional football players running.",
    "\"That is not necessarily good news for the former governor.",
    "We have professional athletes.",
    "Former Gov."
  ]
}