{
  "id": 8933,
  "mediaId": 2658,
  "date": "2022-03-22",
  "headline": "If you thought NFTs were crazy, wait til you see how they’re taxed",
  "image": "https://static.politico.com/62/6c/52d35b1e4aa7ab0ddb4e6c886d9b/nfts-65219.jpg",
  "link": "https://www.politico.com/news/2022/03/22/like-grabbing-smoke-crypto-collectibles-confound-taxpayers-00017779",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    5582,
    3821,
    2879,
    3192,
    648,
    857,
    303,
    6678
  ],
  "sentences": [
    "“Many crypto participants don’t think of taxes until long after sales occur and are caught flat-footed when they have to take taxes into account.”\nThe confusion over the tax implications of NFTs comes as policymakers attempt to navigate a dizzying array of online marketplaces and trading platforms where new payment systems have displaced traditional modes of commerce.",
    "Lawmakers have launched a bipartisan effort to mitigate the tax hit from smaller crypto transactions, but as celebrities from Steph Curry to Roger Stone dive into digital collectibles, the booming market is creating new risks that crypto traders might be running up their tax bills without knowing it.",
    "If you’re buying, selling and trading tokens frequently — something that has become common in video game and metaverse applications where users trade crypto for character avatars and digital paraphernalia (often represented as NFTs) — your tax return can become exceedingly complicated.",
    "“This includes purchasing NFTs.”\nIn the meantime, with the IRS now asking Americans to log their virtual currency transactions on the first page of their individual tax forms, the partnerships between crypto companies and tax specialists are intended to help users with their returns.",
    "With thorny tax issues popping up around even the smallest crypto transactions, Reps. Suzan DelBene (D-Wash.) and David Schweikert (R-Ariz.) have introduced legislation that would exempt personal transactions made with virtual currency from taxation if the gains are $200 or less.",
    "“In the absence of any type of software, I would say it’s virtually impossible for anybody who has a couple of wallets — and multiple coins or NFTs — to figure out their taxes,” said Shehan Chandrasekera, who leads tax strategy for the software firm CoinTracker.",
    "Notably, while NFTs represent only a small fraction of crypto’s ecosystem, the IRS is training its sights on digital assets, which Commissioner Chuck Rettig identified as a significant contributor to the government’s estimated $1 trillion in uncollected revenue.",
    "Purchasing an NFT usually doesn’t confer the buyer copyright to the image or artwork — similar to owning an art print or a rare trading card — but sellers can offer a variety of other dividend-like benefits to drive up interest in the digital asset.",
    "“We are definitely seeing a major increase in not only customer counts but also complexity in the customers’ activity,” said Hannum, whose firm has been tapped by the IRS to provide forensic accounting and taxation software around crypto assets.",
    "But while surging demand for NFTs has unlocked new revenue sources for online creators and startups, it has also forced consumers to grapple with a tax code that doesn’t formally address how such tokens can be used to denote digital ownership.",
    "This being the first tax season since the tokens went mainstream, accountants are navigating their clients’ filings by drawing parallels between NFT-linked transactions and situations where there’s clearer IRS guidance.",
    "The market for non-fungible tokens — unique digital assets that are often traded like collectibles — soared to more than $44 billion in 2021 as art houses and sports leagues capitalized on the latest craze in crypto.",
    "“They are surprised at the figures that they’re looking at.”\nMany of these technologies are still in their infancy and it’s unlikely the IRS will offer direct guidance on NFT-related transactions in the near future.",
    "“Because there’s no direct guidance for NFTs, as for much of crypto, you have to sort of do this by analogy,” said Liz Chien, the global head of tax at decentralized research and development firm Protocol Labs.",
    "However, with the IRS unlikely to offer concrete guidance on the new assets anytime soon, accountants say they’re only making an educated guess in determining how the tax code applies to NFT transactions.",
    "“It would be very helpful for the IRS and state tax authorities to clarify how gains and sales of NFTs should be treated,” said Lawrence Zlatkin, the vice president of tax at the crypto exchange Coinbase.",
    "“It’s so ephemeral,” said Robert Tobey, a partner at the accounting firm Grassi Advisors & Accountants and a member of the American Institute of Certified Public Accountants’ Virtual Currency Task Force.",
    "“It’s like grabbing smoke.”\nDepending on the token, the timing and who’s doing the selling, NFT transactions can be taxed as income, short- or long-term capital gains, collectibles or as dividends.",
    "In instances where ownership entitles the holder to other digital assets that are “airdropped” into their digital wallets at a later date, that could be viewed as a dividend or an interest payment.",
    "And since most trading platforms are decentralized, and don’t have access to the transaction data included in each user’s wallet, it’s ultimately on the trader to assess what they owe the IRS.",
    "After exploding into the mainstream last year, NFTs are creating a new class of headaches for accountants seeking clarity on how crypto transactions should be reported to the IRS.",
    "“While the IRS is aware of and monitors developments with digital assets, the IRS has not issued specific guidance on NFTs,” agency spokesperson Bruce Friedland said in an email.",
    "Uneven oversight of these markets prompted President Joe Biden to sign an executive order earlier this month demanding a whole-of-government assessment of U.S. crypto policies.",
    "Coinbase and some trading platforms — including the most widely used NFT marketplace, OpenSea — are partnering with tax specialists to help users determine their obligations.",
    "NFTs are typically purchased using popular cryptocurrencies, most commonly Ether, and the transactions are recorded on decentralized public ledgers known as blockchains.",
    "Depending on the NFT, owners could also wind up on the hook paying more taxes if their new token confers ownership of a physical asset or additional economic benefits.",
    "A fundamental challenge is that most of these transactions are conducted entirely with digital assets, said Dan Hannum of the crypto tax software company ZenLedger.",
    "The process becomes even more difficult if people use multiple self-hosted digital wallets — which are used to hold crypto — to facilitate their trading activity.",
    "If the token has been linked to ownership of a physical asset — anything from a pair of sneakers to a Florida home — those could carry tax obligations as well.",
    "Currently, the burden to report and calculate gains on virtual currency transactions falls on the consumer,” DelBene said in a statement to POLITICO.",
    "“These are platforms — these are not companies that have visibility into what’s going on in your wallet.”\nAaron Lorenzo contributed to this report.",
    "Buying an NFT with digital assets is equivalent to selling your crypto for U.S. dollars, then using those dollars to purchase the token.",
    "Other permutations can occur if the token has been fractionalized — meaning if multiple owners purchase partial shares of the same NFT.",
    "At the most basic level, using crypto to purchase NFTs can trigger a capital gains event for both the buyer and the seller.",
    "| Seth Wenig/AP Photo\nBy Sam Sutton\n 03/22/2022 11:00 AM EDT\nIt’s all fun and games until the taxman comes knocking.",
    "Coinbase and some trading platforms are partnering with tax specialists to help users determine their obligations.",
    "Chandrasekera’s firm has partnered with both Coinbase and OpenSea to assist users with their taxes.",
    "“The digital economy is rapidly evolving, but our tax code is lagging behind.",
    "Each link in that chain is potentially subject to capital gains taxes.",
    "Sussing out those other benefits can complicate an NFT’s tax profile.",
    "Full-time artists who sell NFTs might view their proceeds as income.",
    "So far, his agency has struggled to keep pace with the market.",
    "“This is not like you’re buying a stock,” Chandrasekera said.",
    "The reverse would be true for whoever is making the sale."
  ]
}