{
  "id": 10124,
  "mediaId": 8393,
  "date": "2022-04-02",
  "headline": "Dave McCormick campaigns in Scranton",
  "image": "https://www.pahomepage.com/wp-content/uploads/sites/91/2022/04/web-pic-mm-1.jpg?w=1280",
  "link": "https://www.pahomepage.com/top-stories/dave-mccormick-campaigns-in-scranton/",
  "mediaOutlet": "pahomepage.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Madonna Mantione",
  "authorUrl": "https://www.pahomepage.com/author/madonna-mantione/",
  "termIds": [
    0
  ],
  "sentences": [
    "Dozens of those potential voters filled the Republican Party of Lackawanna County Headquarters in Scranton for a meet-and-greet with Dave McCormick.",
    "McCormick outlined his campaign, promising to protect Second Amendment rights, to establish American energy independence, and to grow the economy.",
    "The Senate hopeful met with potential voters Saturday night in Scranton to answer questions and discuss his stance on hot button issues.",
    "SCRANTON, LACKAWANNA COUNTY (WBRE/WYOU) – The campaign trail is heating up with the Pennsylvania Primary Election nearly six weeks away.",
    "People are worried about the direction of the country, they’re angry, they’re really upset about inflation,” McCormick said.",
    "“I’ve never run for public office and I don’t owe anything to anyone, except the people of Pennsylvania,” McCormick said.",
    "McCormick served in Iraq during the Persian Gulf War in 1991, a veteran who calls himself a political outsider.",
    "I have a family farm that’s located in Bloomsburg and so for me this feels like being home,” McCormick said.",
    "Republican U.S. Senate candidate Dave McCormick made a few stops in northeastern and central Pennsylvania.",
    "“I wanna know differentiates Dave from Oz, from the rest of the crew,” Coccodrilli said.",
    "One of those people is Curt Coccodrilli who’s weighing his voting options.",
    "The questions he answered here are familiar to him on the campaign trail.",
    "“These little towns are very familiar to me and it’s great, I love it.",
    "McCormick is among seven Republican candidates for U.S. Senate.",
    "The Pennsylvania Primary Election is May 17.",
    "“Same themes, over and over again."
  ]
}