{
  "id": 10185,
  "mediaId": 8504,
  "date": "2022-03-30",
  "headline": "Forum between Republican candidates for U.S. Senate gets heated",
  "image": "https://www.yourerie.com/wp-content/uploads/sites/27/2022/03/Forum-between-Republican-candidates-for-U.S.-Senate-gets-heated.jpg?w=1280",
  "link": "https://www.yourerie.com/news/local-news/your-local-election-hq/forum-between-republican-candidates-for-u-s-senate-gets-heated/",
  "mediaOutlet": "yourerie.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Fontaine Glenn",
  "authorUrl": "https://www.yourerie.com/author/fontaine-glenn/",
  "termIds": [
    0
  ],
  "sentences": [
    "“If you travel around the state the way I have, you know that our energy industry is a critical, if not the critical factor to make main streets flourish, and to make sure that our greatest export stops being our children, and starts being natural gas, energy and our great agriculture communities,” said Jeff Bartos, (R), U.S. Senate Candidate.",
    "“If we were to use our natural gas right here from under our feet and use it to replace dirty coal from overseas manufacturers, it would be the equivalent of electrifying every U.S. car, plus putting a solar panel on every roof, plus doubling wind energy production all together, and we’re giving that up,” said Dr. Oz.",
    "For news delivered right to you, subscribe to JET 24/FOX 66/YourErie.com’s breaking, daily news & severe weather email lists\n“I am dubious about the ability to have series of sequential interest rate hikes to be able to control inflation without leading us into a recession,” said Dr. Oz.",
    "The forum was held by the Manufacturer and Business Association (MBA) and gave those candidates the opportunity to address key issues impacting the industry in the commonwealth.",
    "You should all be asking, I think, which senator can take that fight to Washington and make the biggest difference,” said Dave McCormick, (R), U.S. Senate Candidate.",
    "Once tensions cooled down, the candidates discussed their views on a variety of topics affecting the commonwealth, including the soaring gas prices.",
    "(WJET/WFXP/YourErie.com) — Some heated moments took place Wednesday during a forum between four GOP candidates running to replace retiring U.S.",
    "And now they cannot make the necessary decision that they should be making and that is exactly where we find ourselves today,” said Barnette.",
    "“Now, President Biden’s budget that he just put out, his draft budget, wants to raise taxes on everybody, including seniors,” said Bartos.",
    "“The Federal Reserve is primarily responsible for it, and now we’re looking to the Federal Reserve to try to fix it,” said Barnette.",
    "The expected fireworks between candidates McCormick and Oz didn’t go off, but tensions ran high between Oz and Barnette.",
    "“Because over 50% of Germany’s energy comes from Putin, more than 46% of Italy’s energy source comes from Putin.",
    "The four candidates traveled to Erie to speak to business owners on how they will counter the rising inflation.",
    "“You should all ask yourselves why is everyone attacking me?” said Dr. Mehmet Oz, (R), U.S. Senate Candidate.",
    "You have to have a feel for that, and put policies in place to make a real difference,” said McCormick.",
    "The four candidates, Kathy Barnette, Jeff Bartos, Dave McCormick and Dr. Mehmet Oz took the stage.",
    "“Because you’re a liberal,” said Kathy Barnette, (R), U.S. Senate Candidate.",
    "This is the path back to bringing manufacturing jobs back to Pennsylvania.",
    "“This is the long pole in the tent of economic renewal for Pennsylvania.",
    "“When you’re creating jobs, you see the impact this has.",
    "It’s really the key to a vibrant economy.",
    "Senator Pat Toomey."
  ]
}