{
  "id": 10609,
  "mediaId": 8469,
  "date": "2022-04-03",
  "headline": "GOP’s McCormick brings Senate campaign to Wyoming",
  "image": "https://s24526.pcdn.co/wp-content/uploads/2022/04/128370246_web1_McCormick-3-better.jpg.webp",
  "link": "https://www.timesleader.com/news/1548404/gops-mccormick-brings-senate-campaign-to-wyoming",
  "mediaOutlet": "timesleader.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Kevin Carroll kcarroll@timesleader.com",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "“We all need to answer for the lives we’ve lived and the positions we held, and I think Pennsylvanians should demand that.”\nA busy Saturday rush at the Avenue Diner provided McCormick with plenty of hands to shake and people to meet, many of whom came away impressed with their conversation with the Senate candidate.",
    "“I think more candidates should look at coming here.”\nMcCormick was due to make an appearance at the Republican Party of Lackawanna headquarters in Scranton Saturday evening, and he said that he was working on making stops at the handful of Pennsylvania counties he has yet to visit on the campaign trail.",
    "“There are three things that come up a lot — inflation, unlocking our energy and securing our borders … those are the things I’d focus on on day one.”\nMcCormick’s stop in Wyoming comes just over a month out from the May 17 primary elections.",
    "WYOMING — A stop at the Avenue Diner on Saturday afternoon provided U.S. Senate candidate Dave McCormick with a chance to communicate directly with voters as he pursues the Republican party’s nomination in the upcoming primary election.",
    "McCormick stopped by a number of booths and tables to greet customers and talk to them, communicating his message and getting to hear directly from prospective voters about the issues that they’re most concerned with.",
    "In his remarks to reporters, McCormick alluded to his living the “American dream” growing up, and said that one of his reasons for entering the Senate race was to help others achieve their dreams, as well.",
    "While McCormick emphasized that he was running a campaign based on what he brings to the table, as opposed to focusing on the other candidates, he singled out Oz as his main opponent, based on polling.",
    "“We come to places like this, diners, VFWs, fire halls,” McCormick said in an interview held in one of the diner’s corner booths, with “McCormick for Senate” signs hanging in the window.",
    "“This is what you need to do every day to be a senator.”\nThe stop in Wyoming was McCormick’s second of the day, after a fisherman’s breakfast in Clinton County earlier Saturday morning.",
    "McCormick also questioned Oz’s conservative credentials, pointing out many of Oz’s statements in the past that he believed didn’t line up with the platform Oz is running on currently.",
    "“He’s made a series of comments over the last 20 years on gun control, fracking … now he’s holding an entirely different set of positions now that he’s running,” McCormick said of Oz.",
    "Kingston resident Bruce Levy and his wife Bonnie were two of the many customers U.S. Senate candidate Dave McCormick stopped to talk to during his visit to the Avenue Diner.",
    "Other notable candidates running for the Republican nod include Dr. Mehmet Oz, businessman and former lieutenant governor candidate Jeff Bartos and former U.S.",
    "“When you’ve lived the American dream and had all the benefits, when the country is in trouble you feel like you have to do something,” McCormick said.",
    "“The difference between him [Oz] and I is that I’m authentically Pennsylvanian,” said McCormick, born in the Pittsburgh area and raised in Bloomsburg.",
    "“He seems authentic, he doesn’t feel like a politician,” said Exeter native Tom Massara, eating at the counter as McCormick stopped by to say hello.",
    "Bruce made sure to point out the counter chair where, on a visit in 2008, then-Senator Barack Obama sat on his own visit to the Avenue Diner.",
    "“This is the only way to really know what’s going on, it’s the only way to really be effective and it won’t stop if I get elected.",
    "“I like his ads, too.”\nBruce and Bonnie Levy, from Kingston, had just been seated when McCormick stopped by their booth.",
    "“Everywhere I go, diners just like this, I always ask people what issues are on their mind,” McCormick said.",
    "“This is my chance to try and do something, to go to Washington and fight for the people of Pennsylvania.”",
    "He’s running to fill the seat left vacant by U.S. Sen. Pat Toomey, who will not be seeking reelection.",
    "Candidate chats with patrons at Avenue Diner prior to Scranton stop\nTired of ads?",
    "Subscribers enjoy a distraction-free reading experience.",
    "“This place is such a landmark,” Bruce said.",
    "Click here to subscribe today or Login.",
    "Ambassador to Denmark Carla Sands."
  ]
}