{
  "id": 10896,
  "mediaId": 2702,
  "date": "2022-03-16",
  "headline": "Oz says he will renounce Turkish citizenship if elected to Senate",
  "image": "https://thehill.com/wp-content/uploads/sites/2/2021/12/newsletter-oz-120121ap.jpg?w=1280",
  "link": "https://thehill.com/homenews/campaign/598515-oz-says-he-will-renounce-turkish-citizenship-if-elected-to-senate/",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Tal Axelrod",
  "authorUrl": "https://thehill.com/author/tal-axelrod/",
  "termIds": [
    0
  ],
  "sentences": [
    "It is completely disqualifying behavior for anyone aiming to serve in the United States Senate.”\nMcCormick in response suggested Oz’s announcement was insufficient, saying Oz should revoke his citizenship immediately and bringing up past comments on various culture war issues that stand in contrast with GOP orthodoxy.",
    "Senator for Pennsylvania I will only be a U.S. citizen.”\nThe announcement came after former hedge fund manager Dave McCormick, Oz’s biggest primary rival, held a press call with Sen. Dan Sullivan (R-Alaska) on Oz’s dual citizenship.",
    "The announcement Thursday came after Oz faced withering criticism from his primary opponents that his dual citizenship could impact his work in the Senate, particularly on intelligence matters.",
    "Sullivan, a member of the Senate Armed Services Committee, warned that Oz’s Turkish citizenship could curtail the information he would be privy to in the Senate on foreign nations.",
    "Mehmet Oz, the celebrity cardiothoracic surgeon-turned-Senate candidate, said he would renounce his Turkish citizenship if he is elected to represent Pennsylvania in the fall.",
    "“The bigoted attacks my opponent Dave McCormick has made against me as the child of immigrants are reminiscent of slurs made in the past about Catholics and Jews,” he said.",
    "The two candidates are at the top of a crowded primary field, with McCormick leading with 24 percent support in a Fox News poll last week, trailed by Oz at 15 percent.",
    "“I maintained it to care for my ailing mother, but after several weeks of discussions with my family, I’m committing that before I am sworn as the next U.S.",
    "Oz and McCormick have been bashing each other for weeks over ties to foreign countries, policies on social issues and general loyalty to conservatism.",
    "The Hill has removed its comment section, as there are many other forums for readers to participate in the conversation.",
    "He has lied about his position on abortion, the 2nd Amendment, immigration, masks, and Fauci to name a few.",
    "“It is a sign of McCormick’s desperate campaign that he has resorted to this disgraceful tactic.",
    "“My dual citizenship has become a distraction in this campaign,” Oz said in a statement.",
    "Oz berated McCormick, suggesting his criticism over his citizenship was xenophobic.",
    "However, 31 percent of GOP primary voters said they were undecided.",
    "The back-and-forth marks the latest salvo in a brutal GOP primary.",
    "We invite you to join the discussion on Facebook and Twitter.",
    "We won’t be fooled again,” McCormick said.",
    "Renounce your Turkish citizenship now.",
    "Voters can’t trust Mehmet Oz.",
    "“Do it now."
  ]
}