{
  "id": 1122,
  "mediaId": 2730,
  "date": "2022-02-18",
  "headline": "Out of State Candidates Refuse to Show Up for Senate GOP Debate in Key Battleground State",
  "image": "https://media.townhall.com/townhall/reu/s1280x720/2021/334/249e9d4d-bc55-48e5-98d9-1dcca3e733d7.jpg",
  "link": "https://townhall.com/tipsheet/rebeccadowns/2022/02/18/out-of-state-candidates-refuse-to-show-up-for-senate-gop-debate-in-key-battleground-state-n2603487",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebecca Downs",
  "authorUrl": "https://townhall.com/tipsheet/rebeccadowns/",
  "termIds": [
    2164,
    4243,
    2802,
    1489,
    1126,
    6506
  ],
  "sentences": [
    "— Holly Otterbein (@hollyotterbein) February 17, 2022\nPOLITICO's Holly Otterbein tweeted on Thursday that Senatorial candidate Dave McCormick pulled out of a GOP debate for Monday, February 21, after he learned Dr. Mehmet Oz would not be attending.",
    "In a statement for Townhall, Brittany Yanick, communications director for Dr. Oz's campaign explained that \" Dr. Oz communicated to the organizers a few weeks ago he had a scheduling conflict that evening but appreciated them hosting.\"",
    "Since entering the race on November 30 of last year, Dr. Oz has faced scrutiny from all sides, including when it comes to his stance on abortion, as Kurt and I have highlighted, in addition to Roger Sollenberger for The Daily Beast.",
    "She also addressed McCormick dropping out, adding \"I’m not aware of why Dave McCormick decided to back out after committing - he must have been worried about having to defend his deep ties to China against the other candidates.\"",
    "https://t.co/4NZVFifciZ\n— Jeff Bartos (@jeff_bartos) February 17, 2022\nHe specifically highlighted their out-of-state ties, with McCormick having lived in Connecticut before this year and Dr. Oz having lived in New Jersey.",
    "He indicated that \"the only response we received from the Oz campaign was that they had a scheduling conflict,\" but also pointed out there were \"no major GOP events in the state that night which is why we choose the 21st.\"",
    "Nicholas also indicated McCormick's consultant Jeff Roe told him \"directly\" that McCormick had initially agreed to participate but pulled out when they found out Dr. Oz would not be participating.",
    "— Jonathan Tamari (@JonathanTamari) February 18, 2022\nAlso going for Bartos is his frequent wins in straw polls around the commonwealth, including one earlier this month in the southeast region.",
    "— Holly Otterbein (@hollyotterbein) February 17, 2022\nAfaik, this would have been the first public debate or forum McCormick attended with his opponents, and Oz hasn’t gone to any either.",
    "Source: Photo by Evan Agostini/Invision/AP, File\nThe race to replace outgoing Sen. Pat Toomey (R) in the key battleground state of Pennsylvania has been a crowded and closely-watched one.",
    "This seat is particularly crucial in the upcoming November midterms, with Democrats only having a majority in the 50-50 Senate due to Vice President Kamala Harris' tiebreaking vote.",
    "Yet when it comes to voters getting the opportunity to see who the candidates are and what they stand for, via the debate stage, they'll have to wait a little while longer.",
    "Jeff Bartos, a small business owner who was the GOP nominee for lieutenant governor in 2018, blasted his primary opponents' decision to not participate.",
    "Anyways, I’ll be there because unlike my out-of-state opponents I always have and I always will show up for the people of Pennsylvania.",
    "Perhaps if we hosted the debate in New Jersey or Connecticut the commute would be a little easier for @DrOz and @DaveMcCormickPA ?????",
    "A December 2 report from The Philadelphia Inquirer questioned \"Senate candidate Mehmet Oz says he’s a Pennsylvania resident now.",
    "For this particular Senate seat, Cook Political Report regards the race as a toss-up, as does Sabato's Crystal Ball.",
    "He's won four out of the five straw polls reporting results, with McCormick having won for the southwest caucus.",
    "The Hill and The New York Times have both included Pennsylvania in their lists of races to watch this year.",
    "On Friday morning, it also came out that businesswoman Carla Sands was dropping out of the debate as well.",
    "Late last December, the Cook Political Report forecasted Republicans would come to control the House.",
    "Townhall reached out to debate sponsor Christopher Nicholas of Eagle Consulting Group, Inc.",
    "Dr. Oz has missed other debates too, including one held in Lawrence County on January 12.",
    "Spencer also raised questions over Dr. Oz's use of Chinese social media platforms.",
    "Some predictions believe Republicans are likely to take control of the Senate.",
    "The McCormick campaign did not immediately respond to a request for comment.",
    "Sands instead challenged Oz and McCormick to a televised debate.",
    "Bartos, meanwhile, is a lifelong resident of Pennsylvania.",
    "So why’s he still hanging out in his New Jersey mansion?\"",
    "Inside Elections regards it to be \"Tilt Republican.\"",
    "The GOP primary will take place on May 17.",
    "He did attend a PA GOP candidates forum."
  ]
}