{
  "id": 11719,
  "mediaId": 8254,
  "date": "2022-03-24",
  "headline": "Dr. Oz removed from Biden’s sports council",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/03/AP22070090342288.jpg?w=1280",
  "link": "https://www.abc27.com/2022-united-states-senate-election-in-pennsylvania/dr-oz-removed-from-bidens-sports-council/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "George Stockburger",
  "authorUrl": "https://www.abc27.com/author/george-stockburger/",
  "termIds": [
    4905,
    2802,
    2765,
    2016,
    2137,
    6175,
    6506,
    6512
  ],
  "sentences": [
    "“They care much more for what I stand for than where I’m from.”\nDuring the March 6 episode of This Week in Pennsylvania, McCormick highlighted his background as a “seventh-generation Pennsylvanian.”\n“I’ve spent more of my life in Pennsylvania, more than half of my life in Pennsylvania.",
    "HARRISBURG, Pa. (AP) — The White House has removed Dr. Mehmet Oz — best known as daytime TV’s host of “The Dr. Oz Show” — and former football star Herschel Walker from the President’s Council on Sports, Nutrition and Fitness as both men run for U.S. Senate.",
    "The White House on Wednesday posted two new appointments to the council, while a White House official said Oz and Walker were asked to resign because the White House doesn’t permit candidates for federal office to serve on boards.",
    "Oz and Walker — both are Republicans — were appointed by President Joe Biden’s predecessor, Donald Trump, and Oz quickly went to social media to claim that he was being removed for political reasons.",
    "I grew up here in Bloomsburg on the family farm trimming Christmas trees and bailing hay.”\nGet the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "Oz said he had no intention of resigning and “if President Biden wants to politicize health, he’ll have to fire me.” Walker also took to Twitter on Thursday to attribute his removal to politics.",
    "The White House said Chef and founder of World Central Kitchen José Andrés and two-time WNBA MVP and Olympic gold medalist Elena Delle Donne will replace Oz and Walker.",
    "The letter from the White House Office of Presidential Personnel asked the men to resign Wednesday or be removed by the end of the day.",
    "“It’s beyond sad that Joe Biden would politicize such an important issue like health,” Oz said in a video he posted to Twitter.",
    "Oz and McCormick were the only candidates in the poll to receive double-digit support with McCormick taking 24% and Oz at 15%.",
    "In an interview with abc27’s Dennis Owens, Oz said he’s in “good shape” if the biggest criticism against him is his residency.",
    "A Fox News poll released in early March showed Oz second in the Senate race behind former hedge fund CEO Dave McCormick.",
    "Walker announced his candidacy in Georgia on Aug. 25 and Oz announced his candidacy in Pennsylvania on Nov. 30.",
    "Both McCormick and Oz have drawn criticism from others in the race for not recently living in Pennsylvania.",
    "Oz has previously lived in New Jersey but went to school in Philadelphia.",
    "“I’m very proud that I’m a Pennsylvanian,” Oz said.",
    "Sign up here."
  ]
}