{
  "id": 12496,
  "mediaId": 2573,
  "date": "2022-02-27",
  "headline": "Pennsylvania Senate clash: Bartos showcases ‘strongest grassroots army’ in GOP primary race",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/Jeff-Bartos-CPAC-2-25-22.jpg",
  "link": "https://www.foxnews.com/politics/pennsylvania-senate-clash-bartos-showcases-strongest-grassroots-army-in-gop-primary-race",
  "mediaOutlet": "FoxNewsInsider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    2950,
    4243,
    2802,
    1126,
    1489,
    6506,
    6407,
    6512
  ],
  "sentences": [
    "Among his top rivals in the GOP Senate primary are Mehmet Oz, the well-known celebrity physician, cardiac surgeon, author and former longtime host of TV’s popular \"Dr. Oz Show;\" Dave McCormick, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump; and veteran and conservative political commentator Kathy Barnette.",
    "Bartos once again called them \"political tourists\" who he claims \"came to Pennsylvania to serve themselves\"\nOz lived for years in neighboring New Jersey, but his campaign notes he registered to vote as a Republican over a year ago in Pennsylvania’s Montgomery County, using the home of his wife's parents in the Philadelphia suburb of Bryn Athyn as his residence.",
    "\"I’ve been working for five years around the state,\" the real estate developer, philanthropist and the 2018 Republican nominee for lieutenant governor told Fox News Digital in an interview in Orlando at the Conservative Political Action Conference (CPAC), the largest and oldest annual gathering of leaders and activists on the right.",
    "He said voters he speaks to are \"asking candidates ‘where have you been the last two years when the state was shut down and what did you specifically do to help Pennsylvanians who were shut down, whose businesses were closed, whose schools were closed.",
    "ORLANDO, Fla. – In a combustible Republican primary in the most expensive Senate race in the nation this year, candidate Jeff Bartos says he’s got the winning ingredient that his rivals for the GOP nomination in Pennsylvania don’t have.",
    "He pointed to his Pennsylvania 30-day fund, which he highlights raised $3.5 million and helped over 1,000 small businesses stay afloat amid the cratering economy during the coronavirus pandemic.",
    "Bartos, who launched his Senate campaign nearly a year ago, is one of the leading contenders among a number of well-financed candidates in the race to succeed retiring GOP Sen. Pat Toomey.",
    "PENNSYLVANIA GOP SENATE CANDIDATE MCCORMICK CALLS PUTIN A ‘TYRANT’\nPointing to some of his competitors, Bartos argued that \"for $100 million dollars they couldn’t buy what we’ve built.",
    "It's a Senate contest in a key battleground state that could decide whether the Republicans win back the chamber’s majority in November’s midterm elections.",
    "McCormick grew up in Pennsylvania, where his family has deep roots, but had lived in Connecticut in recent years before moving to the Pittsburgh area.",
    "Oz lived in the Keystone State decades ago, as he graduated from the University of Pennsylvania’s medical school and Wharton business school in 1986.",
    "Bartos touted that \"it’s why we won five of the six straw polls\" of party officials and activists that were recently held across the Keystone State.",
    "I just happen to have the most effective story to tell about that because our campaign is based on saving Main Street Pennsylvania.\"",
    "And the candidate, his campaign, and an outside super PAC supporting Bartos have repeatedly taken aim at Oz and McCormick.",
    "And Sands, who also grew up in Pennsylvania, returned to her native state after living for many years in California.",
    "Looking ahead to Pennsylvania’s May 17 primary, Bartos argued that his message is \"connecting with voters.",
    "For months Bartos has continuously touted that his \"whole career has been focused on Pennsylvania.\"",
    "According to election records, he voted twice by absentee ballot in Pennsylvania in 2021.",
    "And they want to know that the candidates were there right beside them helping.",
    "\"Pennsylvanians want to know that you’ve been there,\" Bartos told Fox News.",
    "We have the strongest grassroots army across 67 counties,\" Bartos touted.",
    "Sign up using promo code CPAC to receive a 30-day free trial.",
    "Watch CPAC speeches live and on-demand on Fox Nation.",
    "Fox Nation is the Featuring Sponsor of CPAC 2022.",
    "For us, the message cuts through all the noise.\"",
    "We have the strongest grassroots infrastructure.",
    "Voters want to know you care about them.\"",
    "\"The voters know me and I know them.",
    "And that’s not specific to me.",
    "Voters care that you’re there.",
    "Offer ends April 30, 2022."
  ]
}