{
  "id": 1604,
  "mediaId": 8359,
  "date": "2022-02-14",
  "headline": "Watch: Senate Candidate Airs Brilliant 'Let's Go, Brandon' Ad During the Super Bowl",
  "image": "https://www.louderwithcrowder.com/media-library/image.jpg?id=29331530&width=1200&coordinates=0%2C66%2C0%2C132&height=600",
  "link": "https://www.louderwithcrowder.com/lets-go-brandon-super-bowl",
  "mediaOutlet": "louderwithcrowder.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brodigan",
  "authorUrl": "https://www.louderwithcrowder.com/u/brodigan",
  "termIds": [
    4905
  ],
  "sentences": [
    "McCormick, a veteran, told Fox News he wanted to illustrate all the ways Biden's incompetence has affected voters: \"not being able to afford gas or groceries because of record-high inflation, rampant crime in our cities, a dramatic spike in the trafficking of fentanyl and human exploitation across open borders, and the disgraceful lack of accountability for the death of 13 young service members in Afghanistan.\"",
    "\"Let's Go, Brandon\" became a thing when a reporter thought people chanting \"F*ck Joe Biden\" were chanting \"Let's Go, Brandon.\"",
    "$6.5 million for a thirty-second spot, and I couldn't tell you a single widget or doohickey that was being sold.",
    "US Senate Candidate Dave McCormick aired a \"Let's Go, Brandon\" themed ad that is brilliant in its simplicity.",
    "An extra round of direct mail isn't going to get you the earned media that a \"F*ck Joe Biden\" ad will.",
    "It's since become a catchphrase to summarize all the things Joe Biden has messed up as president.",
    "Whatever they spent, I can think of less effective ways to spend campaign donations.",
    "A sentiment that our puddingheaded president accidentally expressed himself once.",
    "Shout out to the general consultant who places the ad buy for a Super Bowl ad.",
    "One of the few ads that stood out was only in the local Pennsylvania market.",
    "The Super Bowl is a giant commercial interrupted by a few football plays.",
    "If you judge the \"Big Game\" by that, last night was a disappointment.",
    "Local markets cost a considerable amount less than national ones.",
    "The Louder with Crowder Dot Com Website is on Instagram now!",
    "I doubt they spend $6.5 million on the TV spot.",
    "Follow us at @lwcnewswire and tell a friend!",
    "Also, f*ck Joe Biden.",
    "You the real MVP."
  ]
}