{
  "id": 1677,
  "mediaId": 2632,
  "date": "2022-02-17",
  "headline": "Activision CEO Bobby Kotick Spent Big Money to Back GOP Campaigns Through Another LLC",
  "image": "https://media.nbcbayarea.com/2022/02/107016749-1645105145231-gettyimages-814034924-ALLEN__CO_CONFERENCE.jpeg?quality=85&strip=all&resize=1200%2C675",
  "link": "https://www.nbcbayarea.com/news/business/money-report/activision-ceo-bobby-kotick-has-a-second-secret-company-that-spent-big-money-to-back-gop-campaigns/2820114/",
  "mediaOutlet": "nbcbayarea.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Schwartz",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "The group said its researchers confirmed that the personal mailbox \"PMB K,\" which is listed on one of the Norgate FEC filings, corresponds to a single registration known as \"personal mailbox K.\" The watchdog said its research showed that the names of a Kotick foundation, Norgate and Kotick himself are registered to that mailbox.",
    "An Activision Blizzard spokeswoman said at the time that Kotick \"would not have been informed of every report of misconduct at every Activision Blizzard company, nor would he reasonably be expected to have been updated on all personnel issues.\"",
    "The Center for Responsive Politics, a nonpartisan group which tracks political spending, says LLCs can be \"created primarily to conceal the true source of money flowing to super PACs that spend millions of dollars to influence elections.\"",
    "Clarification: This story was updated to reflect that Kotick's donations to organizations supporting Republican Senate candidates were made through limited liability corporations to which his name was not attached, not secret companies.",
    "The latter firm has contributed at least $100,000 funding Republican efforts, including a super PAC backing former Bridgewater CEO Dave McCormick, who is running for Pennsylvania's Senate seat in a GOP primary.",
    "\"His giving and that of the Call of Duty Foundation, which he co-chairs, is with the goal of ensuring all veterans have employment opportunities that reflect the sacrifices they make through their service.\"",
    "The company, Norgate LLC, contributed $500,000 through two separate checks to the Senate Leadership Fund during the 2020 election cycle, according to Federal Election Commission filings reviewed by CNBC.",
    "Mark Herr, a spokesman for Kotick, told CNBC in an emailed statement on Thursday that the video game executive has given almost the same amount to Democrats and Republicans over the past five years.",
    "The Senate Leadership Fund that cycle spent over $270 million against Democrats running for Senate seats that cycle, according to data from the nonpartisan Center for Responsive Politics.",
    "The company, Norgate LLC, contributed $500,000 through two separate checks to the Senate Leadership Fund during the 2020 election cycle, according to federal filings reviewed by CNBC.",
    "Outside of the Democratic victories in Georgia, data shows the super PAC helped Republicans win in North Carolina, Iowa, Montana and South Carolina, among others.",
    "That political action committee is run by allies of Senate Minority Leader Mitch McConnell, R-Ky., and was created to support Republicans running for the Senate.",
    "Bobby Kotick, CEO of video game maker Activision, has another limited liability company that he used to donate big money to Republican campaigns.",
    "His contributions are focused on candidates and causes primarily in support of veterans issues and specifically veterans employment,\" Herr said.",
    "Though Kotick has given to both major political parties, records show that his his bigger individual checks have mainly gone to Republicans.",
    "The second Norgate FEC filing shows an address that is an approximately one minute walk from the other location, according to Google Maps.",
    "While Democrats won a slight edge in the Senate during the 2020 election, Republicans fended off numerous challengers across the country.",
    "The contribution to the Senate Leadership Fund marks the biggest known donation the Activision CEO has made to a political organization.",
    "The Wall Street Journal reported that Kotick was aware of the allegations and sometimes didn't inform the company's board of directors.",
    "Money Report\nDonors often use LLCs to conceal their identity and avoid scrutiny as they finance their preferred candidates for office.",
    "Real estate executive Stephen Rosenberg used a shell company to back then President Donald Trump after years of supporting Democrats.",
    "CNBC had reported Tuesday about another Kotick company, called 807080A LLC, which had given big donations to Republican causes.",
    "CNBC had reported Tuesday about another Kotick company, called 807080A LLC, which had given big donations to Republican causes.",
    "\"Over the past five years, Mr. Kotick has contributed roughly the same amount to Democrats and Republicans.",
    "That representative previously told CNBC that 807080A LLC was used to manage some of Kotick's investments.",
    "Microsoft announced in January that it agreed to buy Activision for a deal worth north of $68 billion.",
    "Activision CEO Bobby Kotick has another LLC that he used to donate big money to Republican campaigns.",
    "Activision has also been the focus of numerous reports detailing accusations of sexual misconduct.",
    "On one of its two FEC filings, Norgate lists an identical California address to 807080A LLC.",
    "CNBC first reported on 807080A and their donation to the pro-McCormick outside group.",
    "Both private companies have matching addresses to two of Kotick's foundations.",
    "The watchdog Campaign Legal Center flagged the Norgate donations to CNBC.",
    "Kotick and Activision have been under the spotlight in recent months.",
    "Microsoft has said it's aiming to close the deal fiscal 2023.",
    "The statement does not give further details on Norgate LLC.",
    "He also pointed out the work of a Kotick-led foundation."
  ]
}