{
  "id": 17,
  "mediaId": 2572,
  "date": "2022-02-26",
  "headline": "Dr. Oz says his celebrity 'a huge advantage' as he runs for Senate; says he's 'aligned' with GOP voters",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2021/12/Dr.-Oz.jpg",
  "link": "https://www.foxnews.com/politics/dr-oz-pennsylvania-senate-celebrity-huge-advantage-aligned-with-gop-voters",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    5905,
    2802,
    1489,
    1126,
    293,
    6488,
    6506
  ],
  "sentences": [
    "Oz is in a crowded GOP race that also includes top rivals such as Dave McCormick, a former hedge fund executive, West Point graduate and Gulf War combat veteran who served as a Treasury Department official in former President George W. Bush's administration; Jeff Bartos, a real estate developer, philanthropist and the 2018 Republican nominee for lieutenant governor; and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under former President Donald Trump.",
    "CLICK HERE TO GET THE FOX NEWS APP\nLooking ahead to Pennsylvania’s May 17 primary, Oz said, \"Here’s the good news: Whoever survives the primary, they’re going to be really well tuned up for the general election, because I don’t know how much more Democrats can throw at us than were already throwing at each other.\"",
    "\"It’s a huge advantage to be known by everybody and not just that 96% of the time that they know me, it’s that they know me in a positive light,\" Oz, well-known celebrity physician, cardiac surgeon, author and former longtime host of TV’s popular \"Dr. Oz Show,\" acknowledged in a Fox News Digital interview.",
    "ORLANDO, Fla. – In a crowded and combative Republican Senate primary that's become the most expensive race in the nation this year, Mehmet Oz has one thing that his rivals for the GOP nomination in Pennsylvania don’t have – massive name recognition.",
    "PENNSYLVANIA GOP SENATE CANDIDATE MCCORMICK CALLS PUTIN A ‘TYRANT’\nThe race turned ugly the past couple of months, with many of the leading candidates, their campaigns and outside super PACs launching attacks and counterattacks.",
    "Oz spoke with Fox News Friday in Orlando at the Conservative Political Action Conference (CPAC), the largest and oldest annual gathering of leaders and activists on the right.",
    "He’s like our village doctor.’ And so when I start to run, and I take positions, I don’t have to say crazy stuff to get noticed because they already know that I’m there.\"",
    "I’m literally in the background as they’re making soup for their loved ones, when they’re not feeling well, wondering what I have to say about that soup,\" Oz noted.",
    "It's a Senate battle in a key battleground state that could decide whether the Republicans win back the chamber’s majority in November’s midterm elections.",
    "Oz is one of the leading contenders among a number of well-financed candidates in the race to succeed retiring GOP Sen. Pat Toomey.",
    "So they’re actually watching us carefully to see how well we’ll defend ourselves and fight for things we believe are important.\"",
    "Well, they’ve witnessed me fight for years on television … so they think I’ll take actions on things I feel strongly about.",
    "He said that people who attend his campaign events \"honestly don’t know if I’m aligned with their values.",
    "And he shared that \"by witnessing me in that context, people say, ‘Well geez, he’s like family to us.",
    "CLICK HERE FOR THE LATEST FOX NEWS REPORTING FROM CPAC\n\"I’m in your own home, your living room.",
    "Oz noted that voters who meet and listen to him want to know whether \"I fight for them.",
    "And I think those are the type of actions that a primary voting population expects.",
    "\"If I fight to protect myself now, then I’ll fight to protect you later on.",
    "And I want to emphasize, daytime television is not like being a movie star.",
    "Those are two huge advantages in addition to being known by everybody.\"",
    "Sign up using promo code CPAC to receive a 30-day free trial.",
    "Watch CPAC speeches live and on-demand on Fox Nation.",
    "Fox Nation is the Featuring Sponsor of CPAC 2022.",
    "And I am aligned, so they like that.\"",
    "\"I never expected it would get ugly.",
    "Certainly not this ugly,\" Oz said.",
    "People don’t see me on a pedestal.",
    "\"But I’m a porcupine,\" he added.",
    "Offer ends April 30, 2022.",
    "I’m in their lives.",
    "That’s the No.",
    "1 challenge.",
    "Period."
  ]
}