{
  "id": 2691,
  "mediaId": 2658,
  "date": "2022-02-03",
  "headline": "The Republican megadonor funding the party’s 2022 hopes",
  "image": "https://static.politico.com/30/6b/7ec39baa4238956d8f6cbc72ba35/gettyimages-187766112.jpg",
  "link": "https://www.politico.com/news/2022/02/03/ken-griffin-donor-midterm-cash-00005052",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1679,
    3146,
    2802,
    4905,
    1126,
    1339,
    278,
    280,
    392,
    329,
    6442
  ],
  "sentences": [
    "“Ken supports candidates from diverse backgrounds who share his views,” Citadel spokesperson Zia Ahmed said in a statement, ticking off education, public safety, fiscal responsibility and economic growth, and entrepreneurship among areas Griffin “cares deeply about.”\nHis donation to CLF, House Republicans’ flagship super PAC, was made specifically to support “high-quality candidates, including women, minority, and veteran candidates running for the House in 2022,” Ahmed said, echoing a point of emphasis for the House GOP’s candidate recruiters this year.",
    "It’s a significant down payment in the future of the party and in broadening our appeal.”\nIn addition to his super PAC gifts, Griffin has also directly given the maximum individual contribution of $5,800 to at least 53 Republican congressional candidates from 27 states, according to data from the Federal Election Commission.",
    "Griffin supported the transition of power, but he’s also contributed to numerous candidates who objected to certifying the election, including Florida Sen. Rick Scott, and Reps. Mike Bost of Illinois, Nicole Malliotakis of New York, Devin Nunes and Darrell Issa from California and Stephanie Bice of Oklahoma.",
    "| Larry Busacca/Getty Images for The New York Times\nBy Shia Kapos and Brittany Gibson\n 02/03/2022 04:30 AM EST\nCHICAGO — The single biggest spender in Republican politics pumped more than $28 million into the GOP in 2021 — and he’s expected to multiply that number leading into the midterms.",
    "The Chicago-based investor’s years-long feud with his Democratic governor — a fellow billionaire, who just gave $90 million to his own reelection effort and Democratic operations in the state — could turn that gubernatorial race into one of the nation’s most expensive campaigns.",
    "More recently, Griffin has hit out at Pritzker about violence in Chicago, especially after civil unrest saw rioters cause millions of dollars in damage to the city’s downtown, including the Magnificent Mile area that’s walking distance from Griffin’s high-rise home.",
    "Ken Griffin, the founder and CEO of the hedge fund Citadel, was the largest individual donor last year to the GOP super PACs aiming to flip control of Congress, contributing $11 million to the Congressional Leadership Fund and $5 million to Senate Leadership Fund.",
    "Ron DeSantis’ PAC and into Honor Pennsylvania, a super PAC backing fellow hedge funder Dave McCormick — and opposing celebrity physician Mehmet Oz — in Pennsylvania’s GOP Senate primary, making Griffin the biggest individual donor to those two groups so far.",
    "Last year, Griffin declared he was “all in” to get Pritzker out of office — a difficult proposition in blue-leaning Illinois, where Pritzker is generally seen as having successfully managed the pandemic while also steering the state to fiscal viability.",
    "Irvin already has the support of high-profile names from Chicago’s business community, including billionaire real-estate developer Sam Zell and Republican insider Ron Gidwitz, who most recently was ambassador to Belgium during the Trump administration.",
    "The massive national investment by Griffin, a longtime Republican megadonor who has sharply increased his political donations in recent years, positions him to be one of the biggest forces in the GOP’s drive to retake Congress in 2022.",
    "Griffin’s donation to Biden’s inaugural committee also sent a message: Though he may have favored Donald Trump’s fiscal policies, Griffin didn’t support the former president’s polarizing message nor his presidential campaign.",
    "Early in the pandemic, he also donated $1 million to Chicago Public Schools and $1.5 million to the Chicagoland Food Pantry, both to help deliver meals to children at home when schools were closed because of the pandemic.",
    "While Griffin is a Republican, he’s been known to endorse Democrats sometimes, including former Chicago Mayor Rahm Emanuel and, more recently, Eric Adams’ and Andrew Yang’s campaigns in the New York City mayoral race.",
    "And while he has a nonconformist streak — writing a big check to President Joe Biden’s inaugural fund, for example — Griffin’s early muscle is helping his party outpace Democrats’ super PAC efforts.",
    "“This kind of investment in us pays dividends for cycles, because these [candidates] are the stand-outs who can win and actually do something meaningful in Congress, and that matters,” Conston said.",
    "Though Pritzker does not have a primary, he is already in full campaign mode knowing that Irvin, a moderate Republican, could wage a fierce campaign with Griffin’s money behind him.",
    "Griffin’s quick start on midterm giving follows $64.9 million in super PAC donations in 2019 and 2020, including $37 million that went to the Senate Leadership Fund.",
    "Pritzker dropped $171.5 million into his campaign that year, winning the race despite the $20 million spent against him by Griffin, and the hostility only grew.",
    "Griffin was also an early donor to efforts to create a vaccine against Covid-19, develop antibody treatments and rapid testing and acquire protective equipment.",
    "Though the GOP race for governor in Illinois is crowded, with five major candidates in the hunt, Griffin is expected to endorse Aurora Mayor Richard Irvin.",
    "For all the largess he’s spreading nationwide, political insiders are anxious to see what the Chicago billionaire puts into the Illinois governor’s race.",
    "Founder and CEO at Citadel LLC Ken Griffin participates in a discussion at the New York Times 2013 DealBook Conference on Nov. 12, 2013 in New York City.",
    "He plans to publicly exhibit it across the country with the first location being the Crystal Bridges Museum of American Art, which has free admission.",
    "“The U.S. Constitution is a sacred document that enshrines the rights of every American and all those who aspire to be,” he said in a statement.",
    "CLF President Dan Conston called Griffin’s donation “a forward-thinking contribution” that will have long-term effects on the Republican Party.",
    "Griffin has leveraged his wealth to keep up a proxy war with Pritzker, having helped defeat a progressive income tax ballot measure in 2020.",
    "It made Griffin the fourth-biggest super PAC donor in the nation for that election cycle, according to the Center for Responsive Politics.",
    "And yet Griffin hasn’t cut a check to date on what’s likely to be his biggest project of the 2022 midterms: trying to oust Illinois Gov.",
    "Pritzker supported the ballot measure to the tune of $58 million, in hopes it could help the state’s fiscal challenges at the time.",
    "They started butting heads back in 2018, when Pritzker first ran for office and Griffin backed incumbent Republican Gov.",
    "Griffin dropped nearly $54 million in opposition, viewing the proposal as a tax burden.",
    "Griffin has a long-running feud with Pritzker about how the state has been run.",
    "Last year, he purchased a rare copy of the U.S. Constitution for $43 million.",
    "Griffin has said he has not made a decision on how he will endorse for 2022.",
    "Griffin has opened his ample wallet for many other purposes, too.",
    "He splashed another $5 million apiece into Florida Gov.",
    "“So it’s not just a significant investment today.",
    "Bruce Rauner, another wealthy investor.",
    "JB Pritzker."
  ]
}