{
  "id": 365,
  "mediaId": 8254,
  "date": "2022-02-20",
  "headline": "Tuskegee Airmen mural unveiled in uptown Harrisburg",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/02/snapshot-2-1.jpg?w=1280",
  "link": "https://www.abc27.com/community/honoring-black-history/tuskegee-airmen-mural-unveiled-in-uptown-harrisburg/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "James Wesser",
  "authorUrl": "https://www.abc27.com/author/james-wesser/",
  "termIds": [
    0
  ],
  "sentences": [
    "“There are other groups like Black Marines who served in segregated units and they served with valor,”\nHickman says despite the long days, It was time well spent, and his most memorable moments were not planned.",
    "“The mural that has been done on the wall, we are going to represent for Black History Month, is my uncle Charles Petty,” Antoine Brown, nephew of Charles Petty Sr. said.",
    "HARRISBURG, Pa. (WHTM) –If you drive along North Sixth Street in Harrisburg, you will see a mural of Charles Petty Sr.",
    "The Tuskegee Airmen served during World War II while Blacks in some states were still fighting against Jim Crow laws.",
    "“It was definitely an experience to have it was hot out here but it was rewarding nonetheless,” Hickman said.",
    "Petty served with an amazing group called the Tuskegee Airmen,” Bryan Wade of Keystones Oral Histories said.",
    "Even in a time when it was segregated and despite those obstacles, they excelled,” Wade said.",
    "Petty was from the Midstate and many of his relatives were part of the mural celebration.",
    "“Putting Black energy back into the community that definitely needs it,” Hickman said.",
    "“During my mural journey, I had kids come up and they didn’t know who is was painting.",
    "Get daily news, weather, breaking news, and alerts straight to your inbox!",
    "So the fact I could use art to teach history was beautiful” Hickman said.",
    "He was one of the country’s first African American military aviators.",
    "That is one thing that I advocate for on the regular,” Hickman said.",
    "Historian Bryan Wade says Charles Petty’s Story is one of many.",
    "Now it is part of the Uptown Harrisburg experience.",
    "Hickman finished the mural in October of 2021.",
    "Hickman had some challenges along the way.",
    "Bryan Hickman is the artist of the mural.",
    "Sign up for the abc27 newsletters here.",
    "“It is about their service in America.",
    "“Black excellence is being celebrated.",
    "He started the project last summer.",
    "“Mr."
  ]
}