{
  "id": 4701,
  "mediaId": 8380,
  "date": "2022-04-22",
  "headline": "Will Trump's Endorsement Push Voters to Oz in Pa. Senate Race? Here's What They Say",
  "image": "https://media.nbcphiladelphia.com/2022/04/oz-trump-split.jpg?quality=85&strip=all&fit=1200%2C675",
  "link": "https://www.nbcphiladelphia.com/decision-2022/will-trumps-endorsement-push-voters-to-oz-in-pa-senate-race-heres-what-they-say/3216252/",
  "mediaOutlet": "nbcphiladelphia.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lauren Mayk",
  "authorUrl": "https://www.nbcphiladelphia.com?s=Author%3A%20%22Lauren%20Mayk%22",
  "termIds": [
    3029,
    2818,
    2765,
    1489,
    6506
  ],
  "sentences": [
    "Dr. Ben Carson, former Republican presidential candidate and secretary of the U.S. Department of Housing and Urban Development\n“The essence of a network talk show is to have both sides be heard,” Oz told the audience, aiming to explain why certain viewpoints were on the show and how they were presented.",
    "At the Bristol event in southern Bucks County, voters asked Oz to clarify his positions on issues, and one attendee specifically cited a scene from Oz’s TV talk show addressing transgender children that was featured in a political ad.",
    "For the town hall, Oz appeared in the center of a circle of chairs with Dr. Ben Carson, a former presidential candidate and secretary of the U.S. Department of Housing and Urban Development during Trump's term.",
    "But we have to hold Mr. Oz accountable if he does win.”\nTrump’s endorsement took some voters and some Trump supporters by surprise, and it hasn’t deterred opponents who have continued their campaigns.",
    "Politics: Decision 2022\nTrump recently rescinded his endorsement of Alabama Rep. Mo Brooks in that state’s senate race, citing comments by Brooks urging voters to put the 2020 election behind them.",
    "Oz and the other candidates for Senate are heading into the final three weeks of the campaign — with some voters likely to vote even earlier than that if they choose to vote by mail.",
    "Tony Hilinski, of Bensalem, said Trump’s endorsement “threw a monkey wrench into my thinking 'cause I ... didn’t think he would really do that.”\nNow that Trump has endorsed Oz?",
    "Some of the other Republican candidates are even still insisting they, and not Oz, are the better choice to carry on the “America First” policies of the former president.",
    "Asked by NBC10 if he and Trump talked about the 2020 election and anything Trump might expect him to do in the senate regarding that election, Oz said they had not yet.",
    "You'll find tools to help you navigate the midterm elections, including when to vote and who will be on your ballots in the primaries and November general elections.",
    "Morrison says former President Donald Trump’s recent endorsement convinced her to come to the Oz campaign event and, by the time she left, Oz had earned her vote.",
    "For all the candidates, issues and important dates that voters should know about in Pennsylvania, New Jersey and Delaware, go to NBC10's Decision 2022 page.",
    "The contest for Pennsylvania’s open Senate seat to replace retiring Republican Sen. Pat Toomey is one of the most closely watch elections in the country.",
    "“He’s got Trump’s support.”\nTrump endorsed Oz earlier this month, picking the TV celebrity doctor over a large field of other Republican candidates.",
    "President Trump’s announcement that he would back Oz comes amid a slew of other endorsements from the former president in races across the country.",
    "“If it’s not a hospitable place to talk and express what you think, then I’m not doing my job right,” Oz said, defending his long-running show.",
    "“President Trump says what he thinks needs to be said and not everyone’s happy with it,” Oz in an interview following the town hall event.",
    "“President Trump was laser-focused on positions I would take that have been brought up today, particularly energy policy was a big deal.",
    "In a flag-themed hat and a sparkly Trump pin, Linda Morrison sat under a “Dose of Reality” sign at a town hall event for Dr. Mehmet Oz.",
    "Other Republicans running for Senate are Kathy Barnette, Jeff Bartos, George Bochetto, Sean Gale, Dave McCormick and Carla Sands.",
    "Some voters at the Oz event this week indicated they had more research to do by comparing Oz with other candidates in the race.",
    "But while Trump is convincing some voters to give Oz a try, he isn’t necessarily getting them all the way to yes.",
    "Oz also pointed to political action committee money from third-party groups funding ads against him in the race.",
    "Some of those ads appear to be landing enough punches that they’ve at least raised questions for some voters.",
    "“To be honest, I think maybe Trump compromised a bit to get someone who he thinks can win.",
    "But we have not talked about events, detailed events around 2020 (or) 2024,” Oz said.",
    "He was really upset about what happened with COVID after Operation Warp Speed.",
    "“His ideas, the things he says — I believe he’s gonna do it,” she said.",
    "That, some say, is up to Oz at events like the one in Bucks County.",
    "Oz said he’s not surprised by the pushback from the endorsement.",
    "\"When Trump endorses, you have to look at it,\" Hilinski said.",
    "Time will tell,” Greg Garber, of Newtown, said.",
    "\"They’re saying Mehmet is not a conservative?",
    "“They’re saying Mehmet is not a conservative?",
    "We talked a lot about education in schools.",
    "“I’m still waiting to see what happens.",
    "The primary in Pennsylvania is May 17.",
    "The general election is in November.",
    "What a bunch of crap,” Carson said.",
    "Carson often came to Oz’s defense.",
    "What a bunch of crap.\"",
    "Pa."
  ]
}