{
  "id": 5752,
  "mediaId": 2539,
  "date": "2022-04-19",
  "headline": "Dr. Oz has close ties to the wealthy du Pont family heirs, and they’re backing his GOP bid for Pennsylvania’s Senate seat",
  "image": "https://image.cnbcfm.com/api/v1/image/107007232-1643287452974-107007232-1643285660253-gettyimages-1238004320-OZ_PA_SENATE.jpg?v=1643287470&w=1920&h=1080",
  "link": "https://www.cnbc.com/2022/04/19/2022-elections-dr-oz-has-close-ties-to-the-du-pont-family-heirs-and-theyre-backing-his-senate-run.html",
  "mediaOutlet": "CNBC",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Brian Schwartz",
  "authorUrl": "",
  "termIds": [
    5614,
    2802,
    2720,
    2765,
    2658,
    1489,
    1126,
    431,
    6191,
    6506
  ],
  "sentences": [
    "CNBC Politics\nRead more of CNBC’s politics coverage:\nRussia declares intent to control Donbas and southern Ukraine; new mass graves found near Mariupol\nBiden announces a new program to help Ukrainian refugees enter the U.S.\nPennsylvania’s GOP Senate primary draws backing from some of Wall Street’s biggest billionaires, making it one of the most expensive midterm races\nOz’s financial disclosure also shows business ties between the two men and Oz’s wife, Lisa.",
    "GOPAC, which was once led by former Republican House Speaker Newt Gingrich, describes itself on its website as a resource for Republican candidates “for coaching and best practices on effective ways to communicate conservative ideas and solutions.”\nGOPAC Executive Director Jessica Curtis told CNBC in an email that the former governor wasn’t involved with arranging Oz’s speaking engagements for the group, but she confirmed that Oz has spoken to them.",
    "While the company’s political action committee has not backed any of the candidates in the Pennsylvania Senate race, individual members of the family have, according to Federal Election Commission records and data from the Center for Responsive Politics, a nonpartisan campaign finance watchdog group.",
    "Nate Smallwood | Bloomberg | Getty Images\nVeteran physician and Pennsylvania Senate candidate Dr. Mehmet Oz has little-known, but close ties to the heirs of the DuPont chemical fortune who are financially backing Oz’s Senate run, according to a review of campaign finance records.",
    "The company spent more than $400,000 lobbying Congress and the White House in the first three months of the year on issues ranging from climate change to the construction of the Keystone Pipeline, according to the corporation’s most recent lobbying disclosure reports.",
    "The du Pont heir has also contributed two $2,900 checks, one earmarked for the primary election and the other directed to the general election, directly to Oz’s campaign — the most an individual can directly give to a campaign in an election, according to FEC records.",
    "Though Ben duPont doesn’t work in the oil and gas business or for the DuPont corporation, a win for Oz in Pennsylvania could be good news for the company founded by his grandfather’s great-great grandfather in 1802 in Wilmington, Delaware.",
    "In this article\nDD-0.08 (-0.12%)\nMehmet Oz, celebrity physician and U.S. Republican Senate candidate for Pennsylvania, speaks during a campaign event at a restaurant in Greensburg, Pennsylvania, U.S., on Wednesday, Jan. 26, 2022.",
    "DuPont, who uses a slightly different spelling of the du Pont family name on his company website and LinkedIn, has donated $70,000 to a political action committee that’s solely dedicated to helping Oz’s run for Senate.",
    "Another sister fund of the now defunct duPont venture capital business listed on the disclosure is “YET2VENTURES NANOPACK INVESTORS.” That asset is marked on Oz’s financial disclosures as a joint holding with his wife.",
    "Oz has become an outspoken advocate on the need for increased hydraulic fracking, a controversial method of extracting oil and gas from difficult-to-drill land that’s long been opposed by climate change activists.",
    "The influential du Pont family has a net worth of $16 billion and some 4,000 heirs to that fortune, which primarily comes from DuPont, one of the oldest chemical companies in the world, according to Forbes.",
    "The closely watched primary race on May 17 and the later general election to succeed retiring Republican Sen. Pat Toomey this fall could play a key role in determining the balance of power in the Senate.",
    "Oz’s wife’s father, cardiology surgeon Dr. Gerald Lemole, who isn’t a du Pont, donated $1 million in January to the American Leadership Action political action committee, a pro-Oz super PAC.",
    "Oz, who amassed his own multimillion-dollar fortune as the host of “The Dr. Oz Show,” is related to Ben duPont by way of the men’s respective marriages to sisters Lisa and Laura Lemole.",
    "Ben duPont, who co-founded the technology consulting firm yet2 and ran the now-defunct venture capital fund yet2Ventures, is one of Oz’s biggest backers from the du Pont family so far.",
    "Oz, who was recently endorsed by former President Donald Trump, is currently in a Republican primary battle for Pennsylvania’s Senate seat with former Bridgewater CEO Dave McCormick.",
    "The World Health Organization strongly recommended doctors against using it to prevent the virus, noting that hydroxychloroquine provided no meaningful benefit to Covid patients.",
    "Though duPont doesn’t directly work for the DuPont company, his advisory firm yet2 lists the corporate giant on its website as one of the original corporate funders of the firm.",
    "According to the firm’s website and its Pitchbook profile, it is the venture capital arm of his advisory firm yet2 and had at least $50 million in assets under management.",
    "He’s teamed up on the campaign trail with the likes of Harold Hamm, chairman of Continental Resources which specializes in natural gas exploration, according to a report.",
    "Oz promoted the use of hydroxychloroquine to combat Covid-19 in one of those GOPAC speeches, according to a link to his talk on the group’s Soundcloud page.",
    "The Food and Drug Administration has cautioned against the use of hydroxychloroquine, which is commonly prescribed for malaria, as a means to combat Covid.",
    "“Since Oprah introduced Dr. Oz to the American public, many have sought his advice and counsel which is why we have invited him to speak in the past.",
    "The two $25,000 payments covered Oz’s fees for two speeches to GOPAC leaders in 2020, according to the Senate candidate’s financial disclosure.",
    "The family ties also overlap with various business ventures founded by Ben duPont, according to Oz’s most recent financial disclosure forms.",
    "DuPont is listed on PitchBook as a founder of at least two of the related venture capital funds that Oz lists on his financial disclosure.",
    "DuPont’s global headquarters are based in Wilmington, but one of its chemical plants is located in the neighboring state of Pennsylvania.",
    "The super PAC has spent more than $1 million opposing McCormick’s campaign for the Senate, according to Center for Responsive Politics.",
    "Ben duPont’s brother, Eleuthere I. du Pont, has an identical name as the company’s founder and sits on the DuPont corporation’s board.",
    "And with the Senate currently split 50-50, the race is a critical one to watch to see which party will control that chamber in 2023.",
    "Yet2Ventures was the predecessor of duPont’s current investment firm, Charline Capital Partners, according to the company’s website.",
    "In January, Ben duPont and his wife Laura co-hosted a massive Oz campaign fundraising event in Wilmington, according to an invite.",
    "HealthCorps 2020 annual report shows GOPAC was among a group of donors that gave between $25,000 and $49,999 to the organization.",
    "Oz has also received $50,000 in speaking fees from a political group founded by Ben duPont’s late father, former Delaware Gov.",
    "GOPAC also previously financed Oz’s nonprofit organization, HealthCorps, Curtis said, declining to provide more details.",
    "Separately, Oz was paid $50,000 in 2020 by GOPAC, a GOP political organization founded by Ben duPont’s late father.",
    "Ben duPont, a yet2 spokesperson and a representative from the Oz campaign did not return requests for comment.",
    "As you noted, Dr. Oz’s remarks are publicly available and can be judged on their own merit,” she said.",
    "Ben duPont’s LinkedIn profile says he was a founder and managing director of yet2Ventures until 2017.",
    "The fund is one of a group affiliated with duPont’s yet2Ventures, according to data from PitchBook.",
    "The disclosure lists the venture capital firm Ben duPont founded as one of Lisa Oz’s assets.",
    "Ben duPont’s “Yet2Ventures Fund II” is repeatedly listed as one of Lisa Oz’s assets.",
    "Ben duPont donated $50,000 to the American Leadership Action PAC in late December.",
    "He then contributed another $20,000 to the same PAC in February, the records show.",
    "The invite says donors were asked to give up to $5,800 per person.",
    "The values of the Ozs’ stakes in those ventures wasn’t disclosed.",
    "A Real Clear Politics poll shows McCormick with an edge over Oz.",
    "Super PACs can spend and raise an unlimited amount of money.",
    "A spokesman for chemical giant DuPont declined to comment.",
    "The Cook Political Report marks the seat as a toss-up.",
    "The super PAC is solely backing Oz’s Senate run.",
    "Pete du Pont, who died last year."
  ]
}