{
  "id": 6116,
  "mediaId": 2629,
  "date": "2022-04-11",
  "headline": "Trump Endorsement Of Dr Oz Enrages ‘MAGA’ Followers",
  "image": "https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTY2NjY1OS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTY5ODAwOTk1Mn0.4LgisuPL6UU2J8QaISSxnWCmc4R3lYT2LAwHiUpi1oI/img.jpg?width=1200&coordinates=0%2C38%2C0%2C39&height=600",
  "link": "https://www.nationalmemo.com/trump-endorsement-of-dr-oz",
  "mediaOutlet": "nationalmemo.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alex Henderson",
  "authorUrl": "https://www.nationalmemo.com/u/alexhenderson",
  "termIds": [
    4905,
    1696,
    2189,
    2751,
    2802,
    2765,
    3374,
    4284,
    6506
  ],
  "sentences": [
    "Oz is the antithesis of everything that made Trump the best president of my lifetime\\u2014he\\u2019s the farthest thing from America First & he\\u2019d be very bad for PAhttps://twitter.com/alexsalvinews/status/1512935809703460865\\u00a0\\u2026\n— Sean Parnell (@Sean Parnell) 1649548432\nThis endorsement could divide MAGA in the only way that matters: he could lose America First conservatives over ithttps://www.breitbart.com/politics/2022/04/09/donald-trump-endorses-mehmet-oz-in-pennsylvania-u-s-senate-race/\\u00a0\\u2026\n— Joel Pollak (@Joel Pollak) 1649560167\nIt\\u2019s pretty hard for me to fully express how disappointed in Trump I am for endorsing Oz.",
    "Oz is the antithesis of everything that made Trump the best president of my lifetime.”\nErick Erickson, the far-right radio host who once claimed that Episcopalians aren’t really Christians, tweeted, “It’s like Donald Trump’s staff is sabotaging Trump by convincing him to make the worst possible endorsements.” And Joel Pollak of Breitbart News complained, “This endorsement could divide MAGA in the only way that matters: he could lose America First conservatives over it.”\nTownhall’s Kurt Schlichter wrote, “It’s pretty hard for me to fully express how disappointed in Trump I am for endorsing Oz.” And Allie Beth Stuckey of Blaze TV wrote, “Wait.",
    "And Petrizzo notes that Trump, by endorsing Oz, has “ignited fury and ridicule among some of the loudest voices in Trumpworld.”\n“At issue among Trump’s most fervent supporters is the belief that Oz, a Turkish-American TV physician who has hobnobbed with Hollywood’s elite and has flip-flopped on the issue of abortion, isn’t a trustworthy’ America First’ Republican candidate, compared to fellow candidate Dave McCormick, who has ex-Trump Administration official Hope Hicks by his side,” Petrizzo explains.",
    "Trump endorses Dr. Mehmet Oz in the Pennsylvania GOP Senate primary.https://twitter.com/tayfromca/status/1512932833114828801\\u00a0\\u2026\n— Alex Salvi (@Alex Salvi) 1649546980\nPennsylvania Republican Sean Parnell, who dropped out of that Senate race, tweeted, “I have enormous respect for President Trump.",
    "Its largest city, Philadelphia, is overwhelmingly Democratic and hasn’t had a Republican mayor since the early 1950s, while Central Pennsylvania is much more GOP-friendly and is the part of the state that Democratic strategist James Carville famously described as a northern equivalent of Alabama.",
    "The social conservatives and evangelical fundamentalists of 2004 praised Toomey was a “rock-ribbed” conservative and viewed Specter as the RINO; now, in 2022, Toomey isn’t seeking reelection because, insanely, the MAGA crowd thinks he is too far to the left.",
    "— Kurt Schlichter (@Kurt Schlichter) 1649548513\nOz is running for the U.S. Senate seat that is presently occupied by Sen. Pat Toomey and was occupied by the late Sen. Arlen Specter for many years.",
    "He wants to fire Dr. Anthony Fauci, President Joe Biden’s top White House medical advisor, from the federal government — and Oz went from being pro-choice to pandering to “pro-life” theocrats..",
    "The Philadelphia Inquirer’s editorial board, at the time, was critical of Toomey’s campaign and argued that he was even more of an extreme culture warrior than then-Sen. Rick Santorum.",
    "Trump Endorsement Of Dr Oz Enrages ‘MAGA’ Followers\nOn Saturday night, April 9, former President Donald Trump endorsed Dr. Mehmet Oz in Pennsylvania’s 2022 GOP U.S. Senate primary.",
    "In 2004, Toomey gave the late Sen. Arlen Specter an aggressive Republican primary challenge in Pennsylvania — insisting that the moderate Specter wasn’t conservative enough.",
    "And some MAGA zealots, journalist Zachary Petrizzo reports in the Daily Beast, have been throwing a major hissy fit — as they believe that Oz’s resumé is much too moderate.",
    "Is there anything conservative about Dr. Oz?”\nIt\\u2019s like Donald Trump\\u2019s staff is sabotaging Trump by convincing him to make the worst possible endorsements.",
    "Toomey, a hard-right conservative, voted “guilty” in Trump’s second impeachment trial and decided not to seek reelection in the 2022 midterms.",
    "In those days, Oz, now 61, was a moderate conservative along the lines of the late Sen. John McCain of Arizona or former Pennsylvania Gov.",
    "Regardless, Oz’s opponents are slamming him as a RINO (Republicans In Name Only) who is only pretending to be MAGA.",
    "But in his 2022 campaign ads in Pennsylvania, Oz is resorting to dumb MAGA talking points.",
    "— Erick Erickson (@Erick Erickson) 1649548881\nI have enormous respect for President Trump.",
    "I was honored to have his endorsement in PA. \\nTwice\\nBut I\\u2019m disappointed by this.",
    "Trumpistas now consider Toomey a RINO, which is ironic in light of his history.",
    "The Oz of the George W. Bush era did not pander to far-right extremists.",
    "I was honored to have his endorsement in PA. Twice.",
    "Pennsylvania is very much a swing state.",
    "Printed with permission from Alternet.",
    "But I’m disappointed by this.",
    "Former Pres.",
    "Tom Ridge.",
    "trump"
  ]
}