{
  "id": 6214,
  "mediaId": 8254,
  "date": "2022-04-14",
  "headline": "Nearly half of voters say they will vote for Republican Congress candidate: Franklin & Marshall poll",
  "image": "https://www.abc27.com/wp-content/uploads/sites/55/2022/04/AP22092680012900-e1649946535873.jpg?w=1280",
  "link": "https://www.abc27.com/news/this-week-in-pennsylvania/pennsylvania-politics/nearly-half-of-voters-say-they-will-vote-for-republican-congress-candidate-franklin-marshall-poll/",
  "mediaOutlet": "abc27.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Lauren Rude",
  "authorUrl": "https://www.abc27.com/author/lauren-rude/",
  "termIds": [
    2765,
    2802,
    1679,
    1126,
    1121,
    392,
    515,
    6159
  ],
  "sentences": [
    "The law’s central language reads: “Classroom instruction by school personnel or third parties on sexual orientation or gender identity may not occur in kindergarten through grade 3 or in a manner that is not age-appropriate or developmentally appropriate for students in accordance with state standards.”\nThe Ohio State House introduced a bill similar to Florida’s law last week.",
    "(WHTM) — The primary election is just around the corner and, to prepare, Franklin & Marshall College conducted a poll to see how Pennsylvania voters feel about the state and economy, discussing sexual orientation in school, repealing property taxes, teaching critical race theory, and the upcoming election.",
    "Nearly 50% of voters strongly opposed a law — being considered by Florida lawmakers at the time of the poll — that gives parents the right to sue public schools if they believe a school is teaching about critical race theory, while nearly 30% strongly supported it.",
    "Primary Election\nSimilar to the March 2022 poll results, voters in the April 2022 poll were mostly frustrated and dissatisfied with President Joe Biden’s performance so far, which could play a role in their voting behaviors.",
    "Survey results were weighted (age, gender, education, geography, and party registration) using an iterative weighting algorithm to reflect the known distribution of those characteristics.",
    "Methodology\nAs described by Franklin and Marshall: “The survey findings presented in this release are based on the results of interviews conducted March 30 – April 10, 2022.",
    "The data included in this release represent the responses of 785 registered Pennsylvania voters, including 356 Democrats, 317 Republicans, and 112 independents.",
    "More than two in five voters say they are not sure who they will vote for, and 66% of those who have chosen a candidate say they could still change their minds.",
    "Surveys that rely on self-reported behaviors and attitudes are susceptible to biases related to the way respondents process and respond to survey questions.”",
    "Additionally, nearly three in four (70%) of the voters favor teaching students in public schools about the history of race and racism in the United States.",
    "According to the release, the data gathering for the poll was nearly finished when former President Donald Trump announced his endorsement of Mehmet Oz.",
    "As of mid-April, 44% of the voters surveyed said they would support a Republican candidate for Congress and 39% said they would vote for a Democrat.",
    "In the Republican primary field, there is no clear front-runner at the moment with Mehmet Oz sitting at 16% and Dave McCormick coming in with 15%.",
    "Estimates for age, geography, and party registration are based on active voters within the PA Department of State’s voter registration data.",
    "Non-response bias is created when selected participants either choose not to participate in the survey or are unavailable for interviewing.",
    "One in four voters remains undecided about their preference and nearly half of the voters said they could change their mind before May 17.",
    "The Franklin & Marshall poll asked voters about passing a similar law in Pennsylvania, and there was a sharp divide in the results.",
    "In the race for Pennsylvania’s open United States Senate seat, John Fetterman’s advantage in the Democratic primary increased.",
    "Ron DeSantis recently signed the “Parental Rights in Education” law, or as opponents referred to it, the “Don’t Say Gay” law.",
    "Overall, the poll found that only about one in four (29%) of the voters believe the state is headed in the right direction.",
    "Oz was leading among voters who identified with the Trump faction of the party, while a majority still remained undecided.",
    "Between March 30 and April 10, a sample of 785 registered voters took a survey asking about this wide range of topics.",
    "“The sample error for this survey is +/- 4.2 percentage points when the design effects from weighting are considered.",
    "It is curriculum that focuses on and teaches students about the causes and symptoms of systematic racism.",
    "Get the latest news on Pennsylvania Politics and the 2022 Election from Your Local Election Headquarters.",
    "Gender and education is estimated using data from the November 2018 CPS Voter Registration Supplement.",
    "In addition to sampling error, this poll is also subject to other sources of non-sampling error.",
    "Interviews were completed over the phone and online depending on each respondent’s preference.",
    "About one in three strongly supported it (35%), while two in five strongly opposed it (42%).",
    "The interviews were conducted at the Center for Opinion Research at Franklin & Marshall.",
    "Response errors are the product of the question and answer process.",
    "Generally speaking, two sources of error concern researchers most.",
    "The sample of voters was obtained from Marketing Systems Group.",
    "All sampled respondents were notified by mail about the survey.",
    "Sexual orientation in schools/critical race theory\nFlorida Gov.",
    "Critical race theory is another highly debated topic.",
    "Fetterman now leads Conor Lamb 41% to 17%.",
    "Sign up here."
  ]
}