{
  "id": 7085,
  "mediaId": 8322,
  "date": "2022-04-07",
  "headline": "Trump suggests he’ll decide on Pennsylvania GOP Senate endorsement in ‘about a week’",
  "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/02/dr-oz-david-mccormick.png",
  "link": "https://www.foxnews.com/politics/trump-pennsylvania-gop-senate-endorsement",
  "mediaOutlet": "Fox Business",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    5851,
    5862,
    3039,
    4958,
    2765,
    748,
    1126,
    1032,
    1489,
    1131,
    6506
  ],
  "sentences": [
    "Sources close to the former president’s political orbit told Fox News that among the leading contenders for the GOP nomination in Pennsylvania, the two at the top of Trump’s list appear to be David McCormick – a former hedge fund executive, a West Point graduate, Gulf War combat veteran and Treasury Department official in former President George W. Bush's administration – and Mehmet Oz, the cardiac surgeon, author and well-known celebrity physician who until the launch of his Senate campaign late last year was host of TV’s popular \"Dr. Oz Show.\"",
    "WHAT THE LATEST FOX NEWS POLL IN PENNSYLVANIA'S SENATE RACE SHOWS\nMcCormick and Oz are the two polling front-runners in the primary race and have vastly outspent the other candidates to run ads across the Keystone State, as they fight to be the Republican nominee in a crucial contest in the general election that’s one of a handful that could determine whether the GOP wins back the chamber’s majority.",
    "Among the other major contenders are Jeff Bartos, a real estate developer, philanthropist and 2018 Republican nominee for lieutenant governor, veteran and conservative political commentator Kathy Barnette, and Carla Sands, a real estate executive and major Republican donor who served as ambassador to Denmark under Trump.",
    "OZ AND MCCORMICK TRADE FIRE AS THEY FACE OFF FOR THE FIRST TIME ON THE SAME STAGE\nA day later, Trump was more specific, telling reporters at his Mar-a-Lago resort in Palm Beach, Florida, that he would be making a decision about whom to endorse in the Pennsylvania Senate showdown in \"about a week.\"",
    "The former president, more than 14 months removed from the White House, remains the most popular and influential politician in the Republican Party, as he continues to play a kingmaker’s role in GOP primaries and repeatedly flirts with making another presidential run in 2024.",
    "With primary day in the crucial battleground state of Pennsylvania just under six weeks away, former President Donald Trump has yet to takes sides in the crowded, divisive, and expensive GOP Senate primary in the race to succeed retiring Republican Sen. Pat Toomey.",
    "CLICK HERE TO GET THE FOX NEWS APP\nEarlier this week, in his interview on Fredericks’ radio program after the host told Trump \"I like Oz,\" the former president said the nationally known celebrity doctor is \"a good man ... he’s a high-quality guy.\"",
    "The two candidates have traded fire for months over a host of issues, including fracking, who is tougher or softer on China, charges that McCormick outsourced Pennsylvania jobs, and over Oz’s dual citizenship in Turkey.",
    "But the candidate he backed, Sean Parnell, ended his bid in November immediately after he lost a bitter fight for custody of his three children to his estranged wife, who in court testimony had accused Parnell of abuse.",
    "And while some of the candidates he’s endorsed in this year’s elections have struggled in polling and with fundraising, Trump’s endorsement remains the most powerful in his party.",
    "Both McCormick and Oz have connections to Trump, with former top Trump White House and presidential campaign officials backing and/or advising both candidates.",
    "\"I’ll be making a decision… maybe fairly soon,\" the former president said Tuesday in an interview with conservative talk radio host John Fredericks.",
    "McCormick was at Mar-a-Lago Wednesday to meet with the former president, as first reported by the Washington Post and confirmed by Fox News.",
    "McCormick has another connection: His wife, Dina Powell McCormick, served as deputy national security adviser in the Trump administration.",
    "Parnell, an Army veteran who saw combat in the Afghanistan War, endorsed McCormick in January, as first reported by Fox News.",
    "A source close to McCormick’s campaign characterized the encounter as a good meeting and said it lasted around an hour.",
    "THIS STATE HAS THE MOST EXPENSIVE SENATE RACE IN THE COUNTRY\nOz has also recently enjoyed some face time with Trump.",
    "A day later, according to the Washington Post, Trump noted that he was torn between endorsing Oz or McCormick.",
    "Oz and his wife dined with the former president and Melania Trump on March 16, as previously reported.",
    "And a source close to the Oz campaign said Trump and Oz talk frequently.",
    "IS DR. OZ'S CELEBRITY A FACTOR IN THE PENNSYLVANIA SENATE RACE?",
    "Trump made an endorsement in the race last year.",
    "But that may change very soon."
  ]
}