{
  "id": 9216,
  "mediaId": 2732,
  "date": "2022-03-19",
  "headline": "Republican U.S. Senate candidate Dave McCormick greets potential voters in Murrysville",
  "image": "",
  "link": "https://triblive.com/local/westmoreland/republican-u-s-senate-candidate-dave-mccormick-greets-potential-voters-in-murrysville/",
  "mediaOutlet": "triblive.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paula Reed Ward",
  "authorUrl": "",
  "termIds": [
    5507,
    4704,
    4540,
    1126,
    1489,
    6417,
    6672
  ],
  "sentences": [
    "This Senate seat could not be more important.”\nMcCormick told the crowd gathered in Murrysville that his mission now is to introduce himself to voters, particularly given that one of his competitors on the Republican slate, Dr. Mehmet Oz, has automatic name recognition.",
    "McCormick took frequent shots at the Biden administration as he spoke, specifically noting what he called Biden’s “socialist economic policies,” the influx of fentanyl across American borders, inflation and the number of illegal immigrants entering the country.",
    "He had just spent about an hour listening to Republican U.S. Senate candidate Dave McCormick as he addressed several dozen people in a private room, talking about his qualifications and what separates him from the rest of the crowded primary field.",
    "Painter, who operates a naval nuclear supplier, said he feels like some of the other candidates in the race to fill Pat Toomey’s seat don’t have the same breadth of experience as McCormick, particularly in international business.",
    "“I believe it in my bones that if we don’t do something, the country we love is going to slip away.”\nHe also touched on reducing America’s dependence on China and continuing Trump policies for fair trade.",
    "“He convinced me his campaign is about more than just the popular issues.”\nMcCormick, who spent five years in the Army, talked about those “popular issues,” among them energy independence and Ukraine.",
    "McCormick spoke briefly about his background before introducing his wife, Dina Powell McCormick, who served in the Trump administration as the deputy national security adviser for strategy.",
    "McCormick told the crowd he is a seventh-generation Pennsylvanian who wrestled and played football at Bloomsburg High School before going on to the U.S. Military Academy at West Point.",
    "He named Sen. Ted Cruz of Texas; former Trump press secretary Sarah Huckabee Sanders, who is running for governor in Arkansas; and former Trump Secretary of State Mike Pompeo.",
    "After graduation, he attended Airborne School and Ranger School and was assigned to the 82nd Airborne Division in Iraq during the Gulf War.",
    "“He has the knowledge, the understanding and the broadness of a campaign to be able to do an adequate job in the Senate,” Painter said.",
    "But he also addressed the Second Amendment, immigration, trade, abortion and China and other conservative talking points.",
    "Sandy Vargo of Scottdale and her two sons, Tucker, 9, and Enzo, 12, were among those to stop and talk to the candidate.",
    "During Saturday’s event, McCormick was asked what current political figures he most closely aligns with.",
    "The boys are home-schooled, Vargo said, and they have been learning about history and citizenship.",
    "After he finished speaking, he greeted dozens of people, posing for pictures and shaking hands.",
    "Most recently, he served as CEO for Bridgewater Associates, a hedge fund based in Connecticut.",
    "David Painter pushed back from his table at North Park Lounge in Murrysville satisfied.",
    "As part of those lessons, she has taken them to as many election events as she can.",
    "“My challenge is, two months ago, no one knew who the hell I was,” McCormick said.",
    "”These are our future voters.”\nPaula Reed Ward is a Tribune-Review staff writer.",
    "“You know you have the most important issues front and center,” McCormick said.",
    "It also helps, he continued, to validate whether he has the right answers.",
    "He said there is no way to be successful in a campaign without doing that.",
    "“We can teach them in a textbook, or we can come out and see,” she said.",
    "Categories: Local | Murrysville Star | Politics Election | Westmoreland",
    "You can contact Paula by email at pward@triblive.com or via Twitter .",
    "“We want to see what they say and see if they’re representing us.",
    "It’s not the America I’ve served and loved,” McCormick said.",
    "“He convinced me,” said Painter, of Ligonier.",
    "“Leadership matters,” he said.",
    "“It’s not the America I know.",
    "“It matters who you pick."
  ]
}