{
  "id": 931,
  "mediaId": 2746,
  "date": "2022-02-14",
  "headline": "‘Let’s Go, Brandon’ ad airs during Super Bowl in Pennsylvania",
  "image": "https://twt-thumbs.washtimes.com/media/image/2022/02/01/election_2022_senate_pennsylvania_mccormick_72034_c0-77-5185-3101_s1200x700.jpg?ade749624edeb1705624bb7effa00620b8779b0e",
  "link": "https://www.washingtontimes.com/news/2022/feb/14/lets-go-brandon-ad-airs-during-super-bowl-in-penns/?utm_source=RSS_Feed&utm_medium=RSS",
  "mediaOutlet": "Washington Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Valerie Richardson",
  "authorUrl": "https://www.washingtontimes.com/staff/valerie-richardson/",
  "termIds": [
    4905,
    1895,
    4080,
    4243,
    3770,
    2540,
    1126,
    6003,
    6506
  ],
  "sentences": [
    "Weighing in against the ad was Pennsylvania Rep. Conor Lamb, a candidate for the Democratic Senate nod who tweeted that Mr. McCormick was “too much of a coward to say ‘Let’s Go Brandon’ himself, but pathetic enough to spend millions on a #SuperBowl ad to say it for him.”\nMr. McCormick, a Gulf War veteran and former hedge fund CEO, is running for the GOP nomination against candidates including television personality Dr. Mehmet Oz, real-estate developer Jeff Bartos, former U.S.",
    "“The frustration and anger we are feeling toward the failures of our current leadership in Washington is what motivated me to run.”\nThe catchphrase took off after an NBC Sports reporter said in October that a NASCAR crowd chanting “F—- Joe Biden” was actually saying “Let’s go, Brandon,” referring to winning driver Brandon Brown.",
    "Dave McCormick, a Republican candidate for the party’s U.S. Senate nomination, used the “Brandon” chant as the backdrop for a 30-second ad blasting inflation, crime, Big Tech censorship, illegal border-crossings and the Biden administration’s botched exit from Afghanistan.",
    "The political spot aired during the NFL championship game Sunday in markets in Pennsylvania, where Mr. McCormick is running in a crowded GOP field to succeed retiring Republican Sen. Pat Toomey.",
    "Watch us stand up to Joe Biden below: #PASen https://t.co/vMqEcQEAqX\n— Dave McCormick (@DaveMcCormickPA) February 14, 2022",
    "The anti-Biden slogan “Let’s Go, Brandon” made its way to the Super Bowl, at least in Pennsylvania.",
    "“The issues we are facing are so much bigger than ‘Brandon,’” Mr. McCormick told Fox News.",
    "Ambassador to Denmark Carla Sands and political commentator Kathy Barnette.",
    "Did you catch my Super Bowl ad?"
  ]
}