{
  "id": 17623,
  "mediaId": 8473,
  "date": "2022-03-01",
  "headline": "Dolan: Biden may bear some responsibility for Russia’s invasion of Ukraine",
  "image": "http://d14e0irai0gcaa.cloudfront.net/www.tribtoday.com/images/2016/10/11191558/fblike.jpg",
  "link": "https://www.tribtoday.com/news/local-news/2022/03/dolan-biden-may-bear-some-responsibility-for-russias-invasion-of-ukraine/",
  "mediaOutlet": "tribtoday.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David Skolnick",
  "authorUrl": "",
  "termIds": [
    0
  ],
  "sentences": [
    "What matters is most people are undecided.”\ndskolnick@tribtoday.com\nNEWSLETTER\nToday's breaking news and more in your inbox\nLocal News\nOn the record: Lordstown\nWHAT: Board of Education meeting April 20 PRESENT: Cheryl Kistler, Jackie Woodward, William Catlin, Niki ...\nRobotics teams end season with awards\nWARREN — FIRST Robotics teams from Warren G. Harding High School and Champion High School finished the season at ...\nVeterans group seeks parade participants\nCortland man guilty in counterfeiting case\nWARREN — A Cortland man Monday pleaded guilty to a charge of attempting counterfeiting connected to an October ...\nWarren man gets 2 years in robbery\nWARREN — A Warren man received a two-year prison sentence Monday for his part in a May 30, 2020, robbery at ...\nUdderly Smooth president, music ed grad to speak at YSU",
    "While saying Russia’s invasion of Ukraine is the responsibility of Vladimir Putin, state Sen. Matt Dolan, a Republican candidate for the U.S. Senate, said President Joe Biden is “responsible” for the factors that “may have influenced that horrific decision.”\nDolan said Biden’s decision to “reduce the supply of oil and gas that we produce gave financial boost to Russia, which allowed (Putin) to have the financial security to build up towards this invasion.”\nDolan, R-Chagrin Falls, said Biden, a Democrat, is making a major error by not moving forward with “crippling” sanctions against Russia for the Ukraine invasion.",
    "Asked about former President Donald Trump, a fellow Republican, saying Putin, Russia’s president, is a “genius” and “very savvy” for declaring a large portion of Ukraine as independent before invading, Dolan said: “I think it’s disgusting.”\nBefore commenting on Trump and Biden, Dolan said: “Make no mistake, this is Putin’s war.",
    "So let me be very clear: this is Russia trying to erase a nation, a culture, a language, a people.”\nDolan, one of seven Republicans running for his party’s nomination for U.S. Senate, was in the Mahoning Valley on Monday to accept the endorsement of Lordstown Mayor Arno Hill.",
    "Lordstown and our region have been well served by (Dolan’s) experience and that will continue to be the case when he becomes our next U.S. senator.”\nDolan joined the Senate race last September, after several other candidates announced.",
    "Besides Mike Gibbons, an investment banker who unsuccessfully ran for a Senate seat in 2018, Dolan has given more of his own money to his campaign than any other candidate in this race.",
    "An Emerson College poll of the U.S. Senate’s Republican primary, released Monday, shows Gibbons in the lead with 22.4 percent and Dolan in fourth with 6.2 percent.",
    "Dolan gave $10.49 million of his personal wealth last year to his campaign, including $7.99 million during the final two weeks of December.",
    "There is a reflection that Mike Gibbons has been on TV for a very long, long period of time so his name recognition is a little high.",
    "He shows up and has a strong record of leadership in our community that also predates his time in the Legislature.",
    "The telephone poll of 410 likely Republican voters, taken Friday and Saturday, had a 4.8 percent margin of error.",
    "Hill, who is also a member of the Trumbull County Board of Elections, said Dolan “understands the Valley.",
    "Gibbons has given $11.4 million to his campaign and has been airing commercials since last August.",
    "Dolan said the poll “shows that a vast majority of voters, almost 40 percent, are undecided.",
    "Hill is the only mayor in Trumbull County elected as a Republican.",
    "The other Republicans elected as mayors ran in nonpartisan races.",
    "Of those polled, 39.4 percent were undecided.",
    "He attacked a sovereign nation.",
    "Polls don’t matter right now."
  ]
}