{
  "id": 5563,
  "mediaId": 2562,
  "date": "2022-04-16",
  "headline": "Mike Gibbons to Newsmax: Trump’s Vance Endorsement ‘Above My Pay Grade’",
  "image": "https://donaldjtrumppolls.com/wp-content/uploads/2022/04/getfile.aspxguid303A1DCA-13AB-44F7-AE90-80754D3ED1DB.jpg",
  "link": "https://donaldjtrumppolls.com/mike-gibbons-to-newsmax-trumps-vance-endorsement-above-my-pay-grade/",
  "mediaOutlet": "donaldjtrumppolls.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "NationalWatch",
  "authorUrl": "https://donaldjtrumppolls.com/author/djpoll22/",
  "termIds": [
    4306,
    2765,
    1215,
    1489,
    910,
    912
  ],
  "sentences": [
    "Mike Gibbons to Newsmax: Trump's Vance Endorsement 'Above My Pay Grade' (Newsmax's \"Spicer & Co.\")\nBy Eric Mack | Saturday, 16 April 2022 09:34 AM\nFormer President Donald Trump's endorsement of JD Vance in the Ohio Senate GOP primary has some \"very upset,\" Ohio Senate candidate Mike Gibbons on Newsmax said the decision was above his \"pay grade\" and, ultimately, the voters will decide.",
    "\"Ultimately, it's going to be the decision of the voters in the state of Ohio,\" Gibbons told Friday's \"Spicer & Co.\" \"I've heard from a lot of sources that a lot of people are very upset at the idea of President Trump endorsing at this point.\"",
    "Trump's endorsing Vance over others was obviously going to disappoint a lot of the other candidates, but Gibbons also suggested to host Lindsay Keith the Senate primary campaigns are crucial to voter turnout in the November midterm election.",
    "277, AT&T TV Ch 349, FUBO and major OTT platforms like Roku, YouTube, Xumo, Pluto and most smart TV's including Samsung+, Sony, LG, Vizio and more – Find All Systems that Carry Newsmax – Click Here\nOriginal Article",
    "\"To have somebody to come in and endorse, particularly the former president to come in and endorse at this stage, it's probably not the greatest thing for trying to draw people into an election in the future.",
    "Gibbons was in the mix for Trump's coveted endorsement, having served as the Ohio state finance co-chair in 2016 presidential election\n\"I've visited with him,\" Gibbons said of competing for the endorsement.",
    "Gibbons added he cannot tell how or why the endorse of Vance came, say it was \"above my pay grade,\" but he remains confident for the May 3 Senate GOP primary.",
    "Note: See Newsmax TV now carried in more than 100 million U.S. homes, on DirecTV Ch.",
    "\"We've had 10 candidates working pretty hard for a year,\" Gibbons told Keith.",
    "\"We like our polling no matter what happens,\" Gibbons concluded.",
    "\"I've supported him, gave speeches for him,\" he continued.",
    "\"I've been very proud of my support for him in the past.",
    "\"I believe in the Trump agenda.",
    "102, Cox cable, Suddenlink Ch.",
    "I believe in America first.\"",
    "1115, Spectrum, U-verse Ch.",
    "\"We've all worked hard.\"",
    "349, Dish Network Ch.",
    "615, Frontier Ch.",
    "102, Mediacom Ch.",
    "115, Optimum Ch.",
    "216, Xfinity Ch.",
    "1220, FiOS Ch."
  ]
}