{
  "id": 8924,
  "mediaId": 2526,
  "date": "2022-03-23",
  "headline": "NBC: Joe Biden Will Import Favored Ukrainians",
  "image": "https://media.breitbart.com/media/2022/03/russia-ukraine-war-refugees-people-wait-board-train-leaving-lviv-ukraine-at-train-station-1-640x335.png",
  "link": "https://www.breitbart.com/economy/2022/03/23/nbc-joe-biden-will-import-favored-ukrainians/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Neil Munro",
  "authorUrl": "https://www.breitbart.com/author/neil-munro/",
  "termIds": [
    5486,
    4905,
    888,
    6177,
    6383,
    6678,
    6672
  ],
  "sentences": [
    "The March 13-14 survey of 1,000 likely voters reported that 45 percent of all voters “strongly support” President Joe Biden’s statement that the United States will welcome Ukrainian refugees “with open arms.”\nBut that “welcome in” principle for Ukrainian refugees loses much support when Americans are asked if the refugees should be allowed to stay in the United States, presumably to compete for jobs, homes, university slots, and other resources.",
    "“The Biden administration is preparing to unveil as early as this week a plan to expedite and streamline the resettlement of some Ukrainian refugees in the U.S., three sources familiar with the plan said,” according to the March 22 report, which continued:\nThe plan would allow vulnerable Ukrainians, specifically activists, journalists and those who are part of the LGBTQ community, to safely enter the U.S. at least temporarily.",
    "For example, on March 15, the New York Times quoted 2013 comments from Mike Gibbons, an investment banker who is running for the GOP nomination in Ohio’s Senate race:\nGibbons, who earned a master’s degree from the Weatherhead School of Management at Case Western Reserve University, described being in a class with “mostly Asians” during graduate school.",
    "https://t.co/7kk2NOQlih\n— NBC News (@NBCNews) March 23, 2022\nBiden’s deputies are already welcoming Ukrainian economic migrants at the southern border, even after the migrants refused to seek refugee protections in Germany, Mexico, and other countries.",
    "The White House is considering both humanitarian parole, a presidential authority that does not guarantee permanent legal status, and the Priority-2 designation program, which has been used for Afghans and others escaping war zones, they said.",
    "The immigration laws are so complex that officials have yet to pick the loopholes, according to the report:\nThe exact authority President Joe Biden would use to speed the passage of Ukrainians remains unclear, the sources said.",
    "The Biden administration is preparing to unveil as early as this week a plan to expedite and streamline the resettlement of some Ukrainian refugees in the U.S., according to three sources familiar with the plan.",
    "Just 25 percent of the likely voters said more than 100,000 Ukrainians should be “granted permanent residency in the United States.” Only 11 percent said 50,000 to 100,000 should be allowed to stay.",
    "Most Americans want to help some Ukrainian refugees, but just one-in-three say they support permanent residency for more than 50,000 refugees, according to a mid-March poll by Rasmussen Reports.",
    "“We’re trying to become the first multiracial, multi-ethnic superpower in the world,” Rep. Ro Khanna (D-CA) told the New York Times on March 21:\nWhy are we so polarized?",
    "Biden’s administration combines progressives and business groups who have a shared interest in extracting many migrants from other countries.",
    "“It was astounding to me how much they studied, how they were incredibly bright, but they memorized formulas,” Gibbons said.",
    "Sixteen percent said 10,000 to 50,000 should be allowed to stay, and 17 percent said less than 10,000 should be welcomed.",
    "The resettlement comes as U.S. government officials are delivering weapons to help Ukrainians fight the Russian invasion.",
    "But few GOP or Democratic legislators resist the political and economic pressure from business and progressive groups.",
    "President Joe Biden’s deputies will import favored groups of Ukrainian migrants, according to an NBC News report.",
    "The business groups want to import more workers, consumers, and renters to help spike their Wall Street wealth.",
    "Meanwhile, the progressives want to import more non-Americans to help them change and rule the United States.",
    "And it’s a tough time, and it’s time we’re with stress with economic dislocation, with jobs going offshore.",
    "It would also expedite the reunification of Ukrainians with U.S.-based family members, the sources said.",
    "When my parents came to the United States, the Immigration and Naturalization Act had just passed.",
    "This is what goes on in downtown Los Angeles on a regular basis…\nThis is your city on liberalism.",
    "Among liberals, just 33 percent favor the permanent resettlement of more than 100,000 refugees.",
    "Many polls show Americans oppose this revolutionary, wealth-shifting political agenda.",
    "“It will be an extraordinary achievement … we will ultimately triumph,” he insisted.",
    "We’re trying to become the first multiracial, multi-ethnic superpower in the world.",
    "And you’re telling me that was going to be some linear line from Obama onwards?",
    "I believe it is that we [progressives] are trying to do something remarkable.",
    "The most popular response was “Not sure,” which received 31 percent support.",
    "So we’re polarized because we’re fighting about different ways of life.",
    "pic.twitter.com/c6i9A7yl88\n— Errol Webber (@ErrolWebber) March 20, 2022",
    "Before that, they didn’t let Indians basically come to America.",
    "We’re a country that is 60 percent white non-Hispanic.",
    "We’re fighting about different cultures.",
    "Today it’s about 15 percent European.",
    "Immigration was 90 percent European.",
    "It is hard, what we’re doing.",
    "What should America be?",
    "Give me a break."
  ]
}