[
  {
    "id": 317,
    "mediaId": 33,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "North Carolina Republican House candidate <span class='selected-term'>Michele Woodhouse</span>, who's running against Cawthorn after supporting him in 2020, told CNN on Friday that people in the district were really upset? about Cawthorn's deplorable comments.?\nWoodhouse claims that if Cawthorn wins the primary, he could put the seat at risk despite the Republican advantage in the district.",
    "author": "Melanie Zanona",
    "title": "Madison is wrong': GOP backlash over Cawthorn grows after Zelensky insult"
  },
  {
    "id": 321,
    "mediaId": 33,
    "date": "3/18/2022 12:00:00 AM",
    "sentence": "North Carolina Republican House candidate <span class='selected-term'>Michele Woodhouse</span>, who's running against Cawthorn after supporting him in 2020, told CNN on Friday that people in the district were \"really upset\" about Cawthorn's \"deplorable comments.\"",
    "author": "Melanie Zanona",
    "title": "'Madison is wrong': GOP backlash over Cawthorn grows after Zelensky insult"
  },
  {
    "id": 2953,
    "mediaId": 33,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "\"We were shocked and disappointed that he yet again made some bizarre comment,\" said <span class='selected-term'>Michele Woodhouse</span>, another GOP primary candidate against Cawthorn, about her opponent's remarks regarding cocaine and orgies in Washington.",
    "author": "Melanie Zanona, Manu Raju and Alex Rogers",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 2665,
    "mediaId": 195,
    "date": "4/30/2022 12:00:00 AM",
    "sentence": "Cawthorn's two main opponents are state Sen. Chuck Edwards (R), considered the so-called establishment pick, and <span class='selected-term'>Michele Woodhouse</span>, a former GOP district chair.",
    "author": "Tal Axelrod",
    "title": "Mounting scandals fuel uncertainty over Cawthorn's reelection"
  }
]