[
  {
    "id": 2946,
    "mediaId": 129,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "People of western North Carolina are tired of the antics,'' said <span class='selected-term'>Michele Woodhouse</span>, the elected Republican chair of Mr. Cawthorn's district and a former staunch supporter.",
    "author": "",
    "title": "House Republicans Tire of Madison Cawthorn's Antics. Some in His District Have, Too."
  },
  {
    "id": 2953,
    "mediaId": 33,
    "date": "3/30/2022 12:00:00 AM",
    "sentence": "\"We were shocked and disappointed that he yet again made some bizarre comment,\" said <span class='selected-term'>Michele Woodhouse</span>, another GOP primary candidate against Cawthorn, about her opponent's remarks regarding cocaine and orgies in Washington.",
    "author": "Melanie Zanona, Manu Raju and Alex Rogers",
    "title": "'He's an embarrassment': Republicans threaten to primary Cawthorn over controversial antics"
  },
  {
    "id": 2945,
    "mediaId": 33,
    "date": "3/31/2022 12:00:00 AM",
    "sentence": "Ahead of the Tar Heel State's May 17 primary, Cawthorn is facing a number of opponents, including: state Sen. Chuck Edwards, whom Tillis said he is endorsing; <span class='selected-term'>Michele Woodhouse</span>, a self-described \"business-woman and political activist\"; Bruce O'Connell, a hotel and restaurant operator; Rod Honeycutt, a retired US Army colonel; Matthew Burril, a businessman and local economic leader; and Wendy Nevarez, a Navy veteran.",
    "author": "Rachel Janfaza",
    "title": "Who is Madison Cawthorn, the freshman congressman causing headline chaos for the GOP?"
  },
  {
    "id": 3259,
    "mediaId": 238,
    "date": "5/10/2022 12:00:00 AM",
    "sentence": "For Tillis, this is personal,? said <span class='selected-term'>Michele Woodhouse</span>, one of seven primary challengers for Cawthorn's seat.",
    "author": "",
    "title": "Inside the Republican campaign to take down Madison Cawthorn"
  },
  {
    "id": 3442,
    "mediaId": 195,
    "date": "5/15/2022 12:00:00 AM",
    "sentence": "GOP candidates for the seat also include Rod Honeycutt, <span class='selected-term'>Michele Woodhouse</span>, Matthew Burril, Wendy Navarez, Bruce O'Connell and Kristie Sluder.",
    "author": "",
    "title": "Madison Cawthorn faces primary voters on Tuesday"
  }
]