[
  {
    "id": 1941,
    "mediaId": 2592,
    "date": "2022-02-07",
    "sentence": "The Virtual Currency Tax Fairness Act, introduced by Rep. Suzan DelBene, D-Wash., and Rep. <span class='selected-term'>David Schweikert</span>, R-Ariz., on Thursday with support from Rep. Dareen Soto, D-Fla, and Rep. Tom Emmer, R-Minn, aims to provide a clearer framework for the taxation of cryptocurrencies in the United States.",
    "author": "Aakanksha Chaturvedi",
    "title": "What The Virtual Currency Tax Fairness Act Means For Taxpayers"
  },
  {
    "id": 11368,
    "mediaId": 2644,
    "date": "2022-03-17",
    "sentence": "Illegal immigration tramples the rule of law and leaves communities exposed to not only violent criminal gangs but also what Arizona GOP Rep. <span class='selected-term'>David Schweikert</span> calls “economic violence to the working poor.” On the House floor last year, Schweikert warned that opening up America’s borders to a flood of illegal migrants would drive the wages of US citizens downward.",
    "author": "Carrie Sheffield",
    "title": "Biden cuts border funding as his policies are about to overwhelm it"
  },
  {
    "id": 8933,
    "mediaId": 2658,
    "date": "2022-03-22",
    "sentence": "With thorny tax issues popping up around even the smallest crypto transactions, Reps. Suzan DelBene (D-Wash.) and <span class='selected-term'>David Schweikert</span> (R-Ariz.) have introduced legislation that would exempt personal transactions made with virtual currency from taxation if the gains are $200 or less.",
    "author": "",
    "title": "If you thought NFTs were crazy, wait til you see how they’re taxed"
  },
  {
    "id": 7330,
    "mediaId": 2664,
    "date": "2022-04-07",
    "sentence": "We just want a good, conservative Republican to win.”\nRep. Ronny Jackson (R-TX) could only offer, \"Sure, why not?” while Rep. <span class='selected-term'>David Schweikert</span> (R-AZ) was outright dismissive, telling the Beast, \"We actually are sort of in the time of the celebrity candidate.",
    "author": "Tom Boggioni",
    "title": "Sarah Palin facing shrugs and 'outright hostility' from Republicans over new political bid: report"
  },
  {
    "id": 6938,
    "mediaId": 8416,
    "date": "2022-04-14",
    "sentence": "Add in the supply chain issues that housing businesses are experiencing and you begin to understand why rents have increased.”\nRep. <span class='selected-term'>David Schweikert</span>, R-Fountain Hills, said he is not surprised by the demand for housing, given the lure of the state to new residents.",
    "author": "Alexia Stanbridge | Cronkite News",
    "title": "U.S. inflation rose at fastest rate in 40 years, Valley grew even faster – Cronkite News"
  }
]