{
  "id": 6470,
  "mediaId": 43,
  "date": "2/15/2022 12:00:00 AM",
  "headline": "Electoral count inaction: GOP likely favors previous guy rerunning his coup attempt in 2024",
  "image": "https://images.dailykos.com/images/905764/story_image/HawleyBB.jpg?1610659502",
  "link": "https://www.dailykos.com/story/2022/2/15/2080267/-GOP-likely-favors-previous-guy-s-rerun-of-his-coup-attempt-in-2024-because-of-ECA-reform-efforts",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1066,
    1147,
    1434,
    1448,
    3102,
    428,
    545,
    3243,
    2799
  ],
  "sentences": [
    "He confirmed as much in a twisted admission of both his past and future intent earlier this month, claiming that congressional efforts to reform the Electoral Count Act actually prove that Mike Pence had the power to overturn the 2020 presidential election because of the alleged irregularities.? The former vice president pushed back forcefully, calling Mr. Trump wrong.?\nThe back-and-forth repudiations by Mr. Trump and Mr. Pence lay bare two very different visions for the Republican Party.",
    "[63][62]\nen.wikipedia.org/\nx\nThe very fact that it was so easy for Trumps backers in Congress to force a debate and a vote is part of the story as to what led to January 6,? said U.S. Sen. @ChrisMurphyCT, who is working to reform the Electoral Count Act of 1887.https://t.co/QJiRzsCkmX\n New England Public Media (@nepublicmedia) February 15, 2022\nDonald Trump is telling us exactly how he intends to rerun his coup attempt, should the conditions align for it in 2024.",
    "The pardons granted by Trump to Michael Flynn, Paul Manafort, and Roger Stone in 2020, which could constitute an additional obstructive act, push the expiration date on the statute of limitations for those instances of obstruction back to 2025.\nwww.lawfareblog.com/...\nx\nYes, these voter suppression bills target Black people, but we cannot call this Jim Crow 2.0,? because this also effects Latinx, native, and poor white people.",
    "Details here:https://t.co/k4cbBOn1xI\nArticle here: https://t.co/pGqnVrxOYd pic.twitter.com/QIeRgIUOi4\n Lawfare (@lawfareblog) February 16, 2022\nThe heat map belowupdated from an earlier version published on Lawfare after the release of the Mueller reportshows how the special counsel evaluated the strength of the three common components of the obstruction statutes in the episodes he reviewed.",
    "The statement read in its entirety:\n\"If the Vice President (Mike Pence) had 'absolutely no right' to change the Presidential Election results in the Senate, despite fraud and many other irregularities, how come the Democrats and RINO Republicans, like Wacky Susan Collins, are desperately trying to pass legislation that will not allow the Vice President to change the results of the election?",
    "As J. Michael Luttig puts it, heres how ECA reform should address those problems:\nCongress should formally give the federal courts, up to and including the Supreme Court, the power to resolve disputes over state electors and to ensure compliance with the established procedures for selecting presidential electors  and require the judiciarys expeditious resolution of these disputes.",
    "The balance of the Republican Party, mystifyingly stymied by Mr. Trump, rejects these lies, but, as if they have fallen through the rabbit hole into Alices Wonderland, they are confused as to exactly how to move on from the 2020 election when their putative leader remains bewilderingly intent on driving the wedge between the believers in his lies and the disbelievers.",
    "The convoluted language in the law gives Congress the power to determine the presidency if it concludes that Electoral College slates representing the winning candidate were not lawfully certified? or regularly given?  vague and undefined terms  regardless of whether there is proof of illegal vote tampering.",
    "After the 2020 election, Republican senators like Ted Cruz of Texas and Josh Hawley of Missouri tried to capitalize on those ambiguities in the law to do Mr. Trumps bidding, mounting a case for overturning the results in some Biden-won states on little more than a wish.",
    "\"More than evincing honor or bravery, Pence's speech served to highlight all the times he stayed quiet while Trump ran roughshod over the Constitution, demeaned the office of the presidency, and weakened the democratic foundations of the American system.",
    "Trump defended rioters' chants of \"Hang Mike Pence\" during the Jan. 6 attack on the Capitol, according to audio www.nbcnews.com/...\nPence's recent speech condemning Trump's claims that he could have overturned the election, wrote Young, were an outlier.",
    "Luttig aims to address the scenario Ive reported on: A single governor in a state poised to decide the election sends sham electors for the losing candidate, in defiance of the states popular vote, and a GOP-controlled House counts them.",
    "The Act was enacted by Congress in 1887, ten years after the disputed 1876 presidential election, in which several states submitted competing slates of electors and a divided Congress was unable to resolve the deadlock for weeks.",
    "Over a year after the election, they continue to cling to these disproved allegations, claiming that these irregularities? were all the evidence Mr. Pence needed to overturn the results, and demanding that the rest of the G.O.P.",
    "[3] Close elections in 1880 and 1884 followed, and again raised the possibility that with no formally established counting procedure in place partisans in Congress might use the counting process to force a desired result.",
    "373,[1] later codified at Title 3, Chapter 1[2]) is a United States federal law adding to procedures set out in the Constitution of the United States for the counting of electoral votes following a presidential election.",
    "(@Satiristas) February 15, 2022\nOne of the strangest things about Donald Trump is that, despite a habit of uncontrollable lying, the Republican has repeatedly  and without any real prompting  disclosed his own misdeeds.",
    "Trump/political allies are prepared to exploit the Electoral Count Act of 1887, law governing the counting of votes for president/vice president and seize presidency in 24 if Trump or anointed candidate not elected.",
    "www.msnbc.com/...\nx\nJan. 6 committee also subpoenas Arizona GOP party chair Kelli Ward, former Michigan House member Laura Cox, Pennsylvania state senator Douglas Mastriano, and Arizona House member Mark Finchem.",
    "The key nuance here is that the threat next time will not be the vice president abusing her powers to count legitimate electors (though ECA reform should further clarify that the veep has no such powers).",
    "Young noted that former Vice President Mike Pence made a \"deal with the devil\" to position himself for the presidency in 2024  only to see those ambitions implode as the Republican base marginalizes him.",
    "He regularly flaunts his view that attempting to overturn his 2020 loss was the correct thing to do, even as he seeks to install loyalists, one by one, in positions of control over the 2024 election.",
    "All will become moot if those obstruction of justice indictments against previous guy get delivered, which as the Lawfare website folks have noted, seems unlikely even in such unprecedented times.",
    "Looking ahead to the next presidential election, Mr. Trump is once again counting on a sympathetic and malleable Congress and willing states to use the Electoral Count Act to his advantage.",
    "[...]\nIt was against this backdrop that the former president decided to issue a written statement... apparently after having heard about negotiations over reforming the Electoral Count Act.",
    "In his famous memo, lawyer John Eastman used the Electoral Count Act to argue that Vice President Mike Pence could reject slates of electors certified by states and signed by governors...",
    "Mr. Trump and his allies insist that the 2020 election was stolen,? a product of fraudulent voting and certifications of electors who were not properly selected.",
    "www.washingtonpost.com/...\nx\n\"The 12th Amendment & Electoral Count Act of 1887 already make it entirely clear that the Vice President merely opens the envelopes.",
    "Then again, VP Harris in 2024 can overturn the electoral college (according to the same Trump-idiots), and previous guy can still be prosecuted as late as 2025.",
    "[4]\nAfter the 2020 United States presidential election, Representative Paul Gosar and Senator Ted Cruz filed an objection to the electoral votes of Arizona.",
    "Congress should then require itself to count the votes of electors that the federal courts have determined to be properly certified under state law.",
    "As a person close to him admitted to CNN, Pence has never wanted to rebuke Trump for any of his many wrongdoings or his numerous character failures.",
    "It is a tour de force of reasoned constitutional analysis, relevant to liberals as well as conservatives, threatening only to autocrats.",
    "Actually, what they are saying, is that Mike Pence did have the right to change the outcome, and they now want to take that right away.",
    "www.nytimes.com/...\nx\nEvery member of Congress needs to read Judge Michael Luttig's conservative case for avoiding a repeat of Jan. 6.",
    "x\nThis Friday, @benjaminwittes will answer your questions about \"Where is the Justice Department on the Trump Obstruction Offenses?\"",
    "\"...But sometimes we want to make laws even clearer so that even semiliterate psychopaths have a chance at understanding them.\"",
    "But sometimes we want to make laws even clearer so that even semiliterate psychopaths have a chance at understanding them.\"",
    "The current GOP shows that you can't reform the 1877 Electoral Count Act (ECA) with a 'pro-riot mug' and a seditious face.",
    "Remember that the act was meant to address a problem that brought the end of Reconstruction in the Hayes-Tilden election.",
    "[62] Representative Scott Perry and Senator Josh Hawley later filed an objection to the electoral votes of Pennsylvania.",
    "These components include an obstructive act, a nexus between the act and an ongoing investigation, and corrupt intent.",
    "updated\nThe columns on the right show when the statutes of limitations expire for the conduct identified by Mueller.",
    "https://t.co/MZoUjAN1e3\n Laurence Tribe (@tribelaw) February 14, 2022\nThe Electoral Count Act of 1887 (ECA) (Pub.L.",
    "The objection was rejected in the Senate (6 Yeas, 93 Nays), and in the House (121 Yeas, 303 Nays, 9 not voting).",
    "Thats because under current law, both chambers must sustain objections to electors for them to be invalidated.",
    "The result that the objection was rejected in the Senate (7 Yeas, 92 Nays) and the House (138 Yeas, 282 Nays).",
    "'But if something is falsely said about him,' the source said of Pence, 'he is going to correct it.'\"",
    "www.rawstory.com/...\nsemiliterate psychopaths\n China critic Josh Hawley's mug is made in China.",
    "Under the current ECA, those electors would count, even if the Senate refused to count them.",
    "Unfortunately, he didn't exercise that power, he could have overturned the Election!\"",
    " Hugo Lowell (@hugolowell) February 15, 2022\nOn Monday, writing for The Week, Neil J.",
    "Instead of showing his integrity, Pence revealed his bald self-interest.",
    "Dr. William J. Barber II (@RevDrBarber) February 15, 2022",
    "Rather, the threat stems from other problems in the ECA.",
    "The two houses withdrew, and debated the objection.",
    "Will enough in Congress do it before 2024?",
    "https://t.co/PhE08ZLc7w\n SATIRISTAS!",
    "This is James Crow, Esquire.?\n Rev.",
    "Heres what this means.",
    "embrace their lies.",
    "published Monday.",
    "4990, 24 Stat."
  ]
}