{
  "id": 1025,
  "mediaId": 43,
  "date": "1/12/2022 12:00:00 AM",
  "headline": "Morning Digest: We're looking back on Harry Reid's long and storied career on the campaign trail",
  "image": "https://images.dailykos.com/images/293676/story_image/GettyImages-585968840.jpg?1472574030",
  "link": "https://www.dailykos.com/story/2022/1/12/2074101/-Morning-Digest-We-re-looking-back-on-Harry-Reid-s-long-and-storied-career-on-the-campaign-trail",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2164,
    2164,
    2022,
    2022,
    2069,
    2069,
    1007,
    1007,
    1454,
    1454,
    1606,
    1606,
    1465,
    1465,
    571,
    571,
    120,
    120,
    2865,
    2865
  ],
  "sentences": [
    "4Q Fundraising\nNC-Sen: Cheri Beasley (D): $2.1 million raised, $2.8 million cash-on-hand\nUT-Sen: Evan McMullin (I): $1 million raised\nWA-Sen: Patty Murray (D-inc): $1.5 million raised, $7 million cash-on-hand\nGA-Gov: Brian Kemp (R-inc): $7 million raised (between July 1 and Jan. 9), $12 million cash-on-hand\nKS-Gov: Laura Kelly (D-inc): $2 million raised (in 2021), $1.9 million cash-on-hand; Derek Schmidt (R): $1.6 million raised (in 2021), $1.3 million cash-on-hand\nMN-Gov: Tim Walz (D-inc): $3.6 million raised (in 2021), $3.6 million cash-on-hand; Paul Gazelka (R): $545,000 raised (since August)\nNV-Gov: Joe Lombardo (R): $3.1 million raised (since late June)\nSC-Gov: Henry McMaster (R-inc): $909,000 raised, $3 million cash-on-hand; Joe Cunningham (D): $343,000 raised, $422,000 cash-on-hand\nIA-02: Ashley Hinson (R-inc): $809,000 raised, $1.6 million cash-on-hand\nKY-06: Andy Barr (R-inc): $538,000, $1.9 million cash-on-hand\nNE-01: Patty Pansing Brooks (D): $210,000 raised (in six weeks)\nNY-24: Francis Conole (D): $202,000 raised, $280,000 cash-on-hand\nSenate\n? AZ-Sen: Ugh.",
    "Commissioners have until Wednesday at 12 PM ET to submit a new map \"or at least report progress,\" per the CT Mirror, while Persily himself must furnish a map to the court by Jan. 18.\n? NY Redistricting: As expected, New York lawmakers have rejected dueling sets of maps put forth by the state's bipartisan redistricting commission after the panel failed to agree on a single group of plans for Congress and the legislature.",
    "Bochetto in the past has talked about running for mayor of his heavily Democratic city plenty of times and even waged a brief campaign in 1999, but he ended up dropping out before the primary; the eventual nominee, Sam Katz, ended up losing the general election 51-49 to Democrat John Street, which is likely to remain Team Red's high-water mark for decades to come.",
    "The majority leader later looked like an all-but-inevitable loser ahead of his 2010 bid for a fifth term, but Reid, in the words of longtime Nevada political chronicler Jon Ralston, displayed a Terminator-like single-mindedness, relentlessness and discipline turned preparation? that helped him upset former Assemblywoman Sharron Angle.",
    "Redistricting\n? CT Redistricting: Stanford Law School professor Nathan Persily, the special master appointed by the Connecticut Supreme Court to assist it in drawing a new congressional map, has asked the state's deadlocked redistricting commission to try to reach a compromise once more.",
    "Gretchen Whitmer well ahead of four potential Republican foes:\n49-39 vs. former Detroit Police Chief James Craig\n50-33 vs. chiropractor Garrett Soldano\n50-33 vs. businessman Kevin Rinke\n50-31 vs. conservative radio host Tudor Dixon\nPolling from reliable firms has been rare here so far.",
    "At a GOP debate in 2007 during his short-lived presidential campaign, Thompson had to apologize repeatedly after saying he thought employers should be allowed to fire gay workers, alternately blaming his response on needing to go to the bathroom and on a malfunctioning hearing aid.",
    "The Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Stephen Wolf, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Pettersen sought this seat once before in 2017 when Perlmutter ran for governor, but after the congressman abandoned his bid and later decided to seek re-election, she dropped out of the primary (as did every other notable Democrat).",
    "As his former colleagues honor his singular career, we've put together an obituary taking a look back at his long electoral historya path that dealt Reid several setbacks on his way to the pinnacle of American politics.",
    "? NJ-11: Lobbyist Rosemary Becchi, who was the GOP's nominee against Democratic Rep. Mikie Sherrill in 2020, has closed her campaign committee with the FEC, a likely signal that she does not intend to seek a rematch.",
    "Reid won elected office for the first time in 1968 when he took a seat in the Nevada state Assembly at the age of 28, and he made the jump to statewide office two years later when he was elected lieutenant governor.",
    "? PA-Sen: George Bochetto, a longtime Republican attorney in Philadelphia who also served as state boxing commissioner from 1995 to 2002, has joined the packed May primary and says he'll self-fund $1 million.",
    "Tommy Thompson, who is resigning as interim president of the University of Wisconsin System in March, declined to rule out running for a fifth term as governor at the age of 80 in a new interview on Tuesday.",
    "House\n? CO-07: State Sen. Brittany Pettersen became the first Democrat to kick off a bid for Colorado's open 7th Congressional District on Tuesday, a day after Rep. Ed Perlmutter announced his retirement.",
    "Meanwhile, the super PAC run by zillionaire Peter Thiel that's supporting another rich guy, Blake Masters, is spending another $1.1 million, per Politico, to run a new spot tying Masters to Donald Trump.",
    "? NH-Sen: Londonderry Town Manager Kevin Smith resigned his post this week, saying that \"it is my intent to formally announce my candidacy for the United States Senate in the not too distant future.\"",
    "Because of that failure, legislators were under no obligation to consider the maps that the commission forwarded to them, one batch of which was produced by Republicans and the other by Democrats.",
    "? MN-03: Businessman Mark Blaxill, a former treasurer for the state GOP, announced a bid for Minnesota's 3rd Congressional District against Democratic Rep. Dean Phillips on Tuesday morning.",
    "The panel failed to settle on a final map last month, despite receiving a three-week extension from the court, prompting the justices to take over the process and tap Persily to help them.",
    "But I'm physically and mentally capable of doing anything,\" insisted Thompson, who served as governor from 1987 to 2001 before stepping down to serve as George W. Bush's HHS secretary.",
    "Bochetto is also the leader in a lawsuit alleging that Mayor Jim Kenney's executive order replacing Columbus Day with Indigenous Peoples' Day discriminates against Italian Americans.",
    "Of course, that was far from the end for Reid, who had several more competitive Senate races ahead of him beginning with his 1986 triumph in the open seat contest to succeed Laxalt.",
    "While Becchi could of course form a new committee, the New Jersey Globe notes she still owes $6,000 to a fundraising consultant, who previously filed a claim over the unpaid debt.",
    "An independent poll from EPIC-MRA for the Detroit Free Press released the previous month had Whitmer ahead of Craig by the same 44-45 spread, while no other matchups were tested.",
    "Governors\n? MA-Gov: Salem Mayor Kim Driscoll, who'd been mentioned as a possible Democratic candidate for governor, instead announced a bid for lieutenant governor on Tuesday.",
    "Rich guy Jim Lamon is dropping a reported $1 million on a TV buy to air the firstbut undoubtedly not the lastad we've seen featuring a candidate bleat, \"Let's go, Brandon!\"",
    "Redistricting has yet to take place but will likely be handled by the courts due to a deadlock between the Republican-run state Senate and the Democratic-held state House.",
    "Even if they were to strike a compromise, though, legislative Democrats would still be able to override the commission thanks to their two-thirds supermajorities.",
    "The Denver Post mentions two other Democrats as possible candidates, state Rep. Chris Kennedy and Jefferson County Commissioner Andy Kerr, who also ran in 2017.",
    "A Strategic National survey for Craig from all the way back in September found him trailing Whitmer 47-46 (Craig and Strategic National have since parted ways).",
    "Reid went on to pull off an extremely tight 1998 win against his future GOP colleague, then-Rep. John Ensign, in a race that took over a month to resolve.",
    "In 2012, Thompson ran for Senate but lost to Democratic Rep. Tammy Baldwin 51-46 after narrowly winning a bruising GOP primary with just 34% of the vote.",
    "Hopkins, who was first elected to his post in 2020, would be the most prominent Republican to enter the race to date should he decide to get in.",
    "? NY-Gov: Rep. Jerry Nadler, who as House Judiciary Committee chair is one of the most senior House Democrats from New York, has endorsed Gov.",
    "? MI-Gov: The Glengariff Group's first survey of this year's contest, conducted on behalf of WDIV and the Detroit News, finds Democratic Gov.",
    "Leading Off\n? Deaths: Former Senate Majority Leader Harry Reid, who died Dec. 28 at the age of 82, is lying in state at the Capitol today.",
    "Candidates for governor and lieutenant governor run in separate primaries but run together on a single ticket in the general election.",
    "? RI-Gov: Cranston Mayor Kenneth Hopkins said Tuesday that he's \"forming an exploratory committee [to] possibly run for governor.\"",
    "In August, he persuaded a judge to stop Philadelphia's city government from removing a prominent Christopher Columbus statue.",
    "Bochetto recently attracted attention when he aided Donald Trump's defense team in his second impeachment trial.",
    "Commissioners have until Feb. 28 to take one more shot at reaching a deal, but such a deal looks unlikely.",
    "Reid's career stalled, though, after he lost an extremely close 1974 Senate race to former Republican Gov.",
    "Paul Laxalt, and he hit his nadir the next year after he failed to win the mayor's office in Las Vegas.",
    "Half our revenue comes from readers like you, meaning we literally couldn't do this work without you.",
    "If for some reason you have no idea what this is all about, consider yourself blessed.",
    "Two upstate representatives, Brian Higgins and Joe Morelle, previously backed Hochul.",
    "Smith sought the GOP nod for governor in 2012 but lost badly in the primary.",
    "Democrats also made the 11th District considerably bluer in redistricting.",
    "Kerr did not respond to a request for comment from Colorado Politics.",
    "We don't have billionaire backers like some right-wing media outlets.",
    "Pettersen is unlikely to be the last contender to emerge, though.",
    "Can you donate $3 right now to help Daily Kos keep fighting?",
    "He joins Navy veteran Tom Weiler in the Republican primary.",
    "We detail all those campaigns and more in our obituary.",
    "Daily Kos relies on readers like you.",
    "Kathy Hochul's bid for a full term.",
    "\"I'm not saying it's in the cards.",
    "Donate $3\nDonate $5 monthly",
    "? WI-Gov: Former Gov."
  ]
}