{
  "id": 1044,
  "mediaId": 195,
  "date": "3/30/2022 12:00:00 AM",
  "headline": "Perdue says he 'misunderstood' Trump supporters' 'lock him up' chants about Kemp",
  "image": "https://cdn.jwplayer.com/v2/media/XLDOf4eD/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/600291-perdue-says-he-misunderstood-trump-supporters-lock-him-up-chants-about-kemp",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell",
  "termIds": [
    1147,
    1646,
    2095,
    2525,
    4325,
    428,
    501,
    2672
  ],
  "sentences": [
    "During the event, Perdue promised to make sure that those people responsible for that fraud in 2020 go to jail? if he wins the gubernatorial race, a statement that elicited applause from the crowd, according to The Atlanta Journal-Constitution.",
    "Former Sen. David Perdue (R-Ga.) said he misunderstood? supporters of former President Trump when they chanted lock him up? during his remarks at a recent rally  comments that were purportedly aimed at Georgia Gov.",
    "Then-Attorney General William Barr in December 2020 said there had been no evidence of widespread voter fraud that would have changed the outcome of thee 2020 presidential election.",
    "Supporters then started chanting lock him up,? referring to Kemp, and Perdue gave them a thumbs-up, according to video captured by The Atlanta Journal-Constitution.",
    "It was what I had said very pointedly in my speech, was the people responsible for this malfeasance should be investigated and are brought to justice.",
    "The governor frustrated Trump when he declined to support the then-president's efforts to overturn the results of the 2020 presidential election.",
    "The winner will likely face former Georgia state Rep. Stacey Abrams, who is the only Democrat running for the party's nomination.",
    "Now, however, the former senator appears to be trying to walk back his reaction, saying that he misunderstood the crowd's chant.",
    "Trump held a rally in Georgia alongside Perdue on Saturday in support of the former senator's bid for the governor's mansion.",
    "Perdue and Kemp are embroiled in a fierce primary race to represent the GOP in Georgia's gubernatorial election.",
    "I really thought they were saying lock them up,'? Perdue said, according to The Atlanta Journal-Constitution.",
    "Trump endorsed Perdue in December with hopes of removing Kemp from his perch in the Peach State.",
    "A Fox News poll conducted in early March found that Kemp had an 11-point lead over Perdue.",
    "Brian Kemp, his opponent in the Peach State's GOP gubernatorial primary race.",
    "So I'm holding the governor accountable,? he added.",
    "The Hill has reached out to Kemp for comment.",
    "Perdue also reportedly smiled at the crowd.",
    "I misunderstood what they were saying.",
    "That's what I said."
  ]
}