{
  "id": 1047,
  "mediaId": 25,
  "date": "3/30/2022 12:00:00 AM",
  "headline": "Trump has endorsed nearly 130 candidates for 2022, testing his influence in the Republican Party",
  "image": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/03/30/d02f69fe-4940-4eaf-9ccd-42e4300a8eef/thumbnail/620x413/f5abdf1a3418f543d3255419de452b98/gettyimages-1239537249.jpg",
  "link": "https://www.cbsnews.com/news/trump-2022-endorsements-republican-party-influence/",
  "mediaOutlet": "cbs news",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    946,
    1147,
    1646,
    2095,
    2466,
    4325,
    296,
    428,
    537,
    2672
  ],
  "sentences": [
    "2022 Midterm Elections\n More\n Trump has endorsed nearly 130 candidates for 2022, testing his influence in the Republican Party\n Florida Governor Ron DeSantis vetoes Congressional map in push for heavier GOP gerrymander\n Republicans try out midterm messages during Jackson hearings\n Supreme Court tosses Wisconsin state maps, keeps congressional maps\n Trump withdraws endorsement of Mo Brooks in Alabama Senate race\n More\n Caitlin Huey-Burns\nCaitlin Huey-Burns is a political reporter for CBS News.",
    "In a Ohio's crowded Republican primary for an open Senate seat, slated for May 3rd, several of the candidates are intensely jockeying for the former president's blessing, positioning themselves as being significantly more \"pro-Trump\" or \"America first\" than their competitors and seeking facetime with him.",
    "But a person familiar with Trump's thinking said that the poor performances and stumbles of some of his chosen candidates, and some bad advice he had received about them, are making him more cautious about throwing his weight behind contenders in some key upcoming primary races.",
    "In Pennsylvania, David McCormick, who is married to Trump's former deputy National Security Adviser Dina Powell, is campaigning on Wednesday with former White House press secretary Sarah Huckabee Sanders and former White House communications director Hope Hicks.",
    "In choosing endorsements, Trump considers the candidate's polling and fundraising, and he keeps a close eye on debates and weighs how well candidates may be able to implement his vision for the GOP, according to people familiar with his decision process.",
    "In Ohio, Timken hired former Trump campaign manager Corey Lewandowksi, who was removed from his position at a pro-Trump super PAC following allegations of unwanted sexual advances toward a donor, and former senior Trump campaign aide David Bossie.",
    "\"President Trump's endorsement is the most powerful force in politics and Save America is committed to ensuring every voter is engaged and educated ahead of these important elections,\" Trump spokesman Taylor Budowich said in a statement.",
    "Former Heisman Trophy winner and candidate for US Senate Herschel Walker (R-GA) speaks to supporters of former U.S. President Donald Trump during a rally at the Banks County Dragway on March 26, 2022 in Commerce, Georgia.",
    "Senator and Republican candidate for Governor of Georgia David Perdue waves to supporters of former U.S. President Donald Trump after speaking at a rally at the Banks County Dragway on March 26, 2022 in Commerce, Georgia.",
    "\"You've got to say, 'let's keep going' because there is now a blueprint out there,\" the operative said, citing McCrory's standing as an example of how to stay competitive in a race where Trump has backed someone else.",
    "\"What you've seen over the last year is Joe Biden reminding Republican voters why they don't like him and his policies, and hitting them in their pocket book,\" said one Georgia GOP consultant aligned with Kemp.",
    "The fact that Trump's endorsement hasn't been clearing the field in races is a sign to some GOP operatives that Trump, while still the most powerful force in Republican politics, has lost some influence.",
    "A sign of Trump's power comes from the visits candidates and political groups have made to Trump's Mar-a-Lago Club in Florida and Trump National Golf Club in New Jersey since he left the White House.",
    "In Georgia, he backed former Senator David Perdue in his challenge to incumbent Governor Brian Kemp, who has become Enemy Number One in Trump's view for certifying the election results in the state..",
    "\"It will take you a long way but you've got to have fundraising, got to have the ground game, and you have to be fighting for what he's fighting for,\" said one former Trump campaign senior official.",
    "\"If you get the endorsement of a guy who the grassroots really like, that is without a doubt a good day for you, but that doesn't mean that you're the next governor, senator or congressman.\"",
    "In the case of Georgia, strategists say Trump underestimated the power of Kemp's incumbency, and the ways in which GOP primary voters there may be more focused on the present than the past.",
    "Former White House senior counselor Kellyanne Conway is also helping Timken as well as Long in his Senate primary and Pennsylvania state Senator Jake Corman in the gubernatorial race.",
    "If a candidate does not earn Trump's endorsement, that operative told CBS News that there's still a path for candidates to continue their campaign rather than shutting it down.",
    "In some cases, the performances have raised questions about the potency of Trump's endorsements and his power over Republican primary voters now that he is no longer in office.",
    "The nearly 130 candidates President Donald Trump has endorsed so far in 2022 cast a wide net  and test the former president's influence at the helm of the Republican party.",
    "Trump's endorsement of Perdue has an effect on the margins, the consultant said, but \"but I don't think they were able to unveil anything new to change the conversation.\"",
    "Billionaire Peter Thiel, who donated large amounts of money to efforts supporting the Trump campaign in 2020, is supporting Vance in Ohio and Blake Masters in Arizona.",
    "In Arizona, a firm started by former Trump campaign manager Bill Stepien and Trump campaign lawyer Justin Clark is helping Arizona Attorney General Mark Brnovich.",
    "\"Do they appreciate what they have in him, a warrior and the first major political leader to say, 'You better get on the Trump Train, it's leaving the station.'\"",
    "\"It's not a problem of Trump's endorsement losing its power; it's the issue of campaigns not capitalizing on the endorsement,\" said another Trumpworld operative.",
    "In the open Senate race in Missouri, the former president released a statement last week asking if voters there have been considering Representative Billy Long.",
    "\"Anyone who gets the endorsement should be happy,\" said one GOP operative working on multiple campaigns, who asked to speak anonymously to speak candidly.",
    "Last week, he pulled his endorsement from Alabama Representative Mo Brooks, who has been trailing two other Republicans for the open Senate race there.",
    "Trump's 2022 got off to a strong start in Texas' primaries, with his 33 endorsed candidates all winning or going into runoff races in strong positions.",
    "Trump likes to tout his endorsement record, and will be eyeing candidates who he believes can win the primary and, ultimately, the general election.",
    "But he acknowledged in an interview Tuesday night with Real America's Voice that he may end up supporting some candidates who lose their races.",
    "In 2021, FEC records indicate that campaigns for federal office and political committees spent at least $750,000 at the two properties.",
    "In Pennsylvania, Trump-endorsed candidate Sean Parnell dropped out of the race after losing a custody battle with his estranged wife.",
    "Campaign operatives on various campaigns and super PACs say that a Trump endorsement gives candidates a significant bump in polling.",
    "Megan Varner / Getty Images\nWith primaries inching ever closer, Trump has been hitting the road to rally for his chosen candidates.",
    "The former president may still offer endorsements for senate and gubernatorial primaries in Pennsylvania and Alabama that month.",
    "The Ohio race marks the first of several that month that will present a significant test for the former president's influence.",
    "Former U.S. President Donald Trump speaks during a rally at the Banks County Dragway on March 26, 2022 in Commerce, Georgia.",
    "This weeked, he's expected to be in Michigan to rally for his chosen candidates for attorney general and secretary of state.",
    "Missouri and Arizona don't hold their elections until August, giving the former president time to weigh his options.",
    "In places like Georgia, North Carolina and Alabama, he wasn't able to clear the field for his favored contender.",
    "Former Ohio GOP state chair Jane Timken is slated to visit Mar-a-Lago next week, according to a source familiar.",
    "Megan Varner / Getty Images\nBut elsewhere, Trump's selectiveness has made his endorsement all the more coveted.",
    "In those states, he is searching for new favorite Senate candidates after his initial choices did not work out.",
    "In addition to Ohio and Pennsylvania, Trump hasn't weighed in on Arizona's highly competitive Senate race.",
    "It's no longer, 'I'm pissed about the last election,' it's 'I'm pissed about what's happening right now.'\"",
    "He went to Georgia last weekend to campaign for Perdue and a slew of other candidates who he is backing.",
    "Megan Varner / Getty Images\nBut securing an endorsement from the former president can only go so far.",
    "In North Carolina, Trump endorsed Representative Ted Budd, who is running for an open Senate seat.",
    "With early voting there beginning next week, candidates are eager for Trump to make a decision.",
    "In some cases, Trump is testing out support of a candidate without an outright endorsement.",
    "\"I could have 100 wins and one loss and they could make it sound like this is humiliating.\"",
    "Candidates for Senate, House, governor, secretaries of state and even state legislators.",
    "Save America is Trump's PAC, which had $110 million cash on hand at the end of February.",
    "Her rivals, Josh Mandel, JD Vance and Mike Gibbons, are also seeking endorsements.",
    "Candidates have also lined up former Trump campaign and administration officials.",
    "Super PACs supporting Vance and Masters have used Trump pollster Tony Fabrizio.",
    "This event is a part of Trump's Save America Tour around the United States.",
    "This event is a part of Trump's Save America Tour around the United States.",
    "Fox News host Sean Hannity, who has advised Trump, is backing Mehmet Oz.",
    "The following week, he will be off to North Carolina to support Budd.",
    "But Budd is in a tight primary race with former Governor Pat McCrory.",
    "They're going to say this was a humiliating experience,\" Trump said.",
    "Trump stated: \"This is not an Endorsement, but I'm just askin'.\"",
    "\"If I lose one along the way, which you have to, right?",
    "But the other races are just a few weeks away.",
    "\"It's not game over.\"",
    "\"That benefits us.",
    "Challengers.",
    "Incumbents.",
    "Former U.S."
  ]
}