{
  "id": 105,
  "mediaId": 223,
  "date": "5/3/2022 12:00:00 AM",
  "headline": "Why Georgia Gov. Kemp Tops the Polls Despite Trump's Bid to Take Him Down",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/10/63ddb566-ba71-4fc4-bbf9-28f47583dd33.jpg",
  "link": "https://townhall.com/columnists/salenazito/2022/05/03/why-georgia-gov-kemp-tops-the-polls-despite-trumps-bid-to-take-him-down-n2606643",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Salena Zito",
  "authorUrl": "https://townhall.com/columnists/salenazito/",
  "termIds": [
    1147,
    1646,
    2087,
    2095,
    3085,
    3094,
    295,
    428,
    2555,
    2624,
    2672
  ],
  "sentences": [
    "Ever since Trump publicly blasted Kemp for refusing to overturn Georgia's 2020 election results  results that were certified following three recounts  many Georgians figured Kemp would be a dead man walking in this year's Republican primary race, especially if Trump backed someone else to run against him.",
    "\"I fall very in line with most Republican policies, especially when they focus on fiscal policies, but I was just unhappy with how all of the candidates on the Republican side focused on social issues and I couldn't get with the Democrats, so I just didn't vote for Senate,\" Sproul explained.",
    "The 33-year-old customer-training manager for a Fortune 500 company who lives in suburban Atlanta voted for Trump in 2016, cast a vote for Biden in 2020, and sat out voting for any of the U.S. Senate candidates  Republican or Democrat  that year.",
    "I knew what was in it,\" he said of the sweeping Republican-sponsored overhaul of state elections that had President Joe Biden repeatedly calling it \"Jim Crow 2.0\" and saw Major League Baseball pull the All-Star Game out of the state.",
    "Many are still angry that Trump encouraged Georgia conservatives not to vote in the 2020 senate runoff election, where two Democrat challengers battled against two Republican incumbents, including Perdue  and both Republicans lost.",
    "\"We took a pounding in the polls right after the election and all of the questioning about the results, but governors go through that with tough issues,\" he said of the initial weeks after the 2020 elections.",
    "The 58-year-old businessman  who jumped into local politics nearly two decades ago because of his frustration over bureaucratic red tape  said his fortunes changed with the voting bill last year.",
    "That's exactly what happened when Trump tapped former U.S. Sen. David Perdue to run against Kemp in the Georgia primary, which many presumed would catapult Purdue ahead of Kemp in the polls.",
    "After Trump called him \"a turncoat, a coward, and a complete and total disaster\" in front of a crowd of supporters at a rally in Commerce, Georgia, last Saturday, Kemp is probably not wrong.",
    "And, in the GOP House primary race in Wyoming, he has backed attorney Harriet Hageman over Rep. Liz Cheney, the most prominent Republican in Congress to vote for Trump's second impeachment.",
    "I pushed back against the Democrats, including the president, the vice president, a lot of woke corporate CEOs and retired CEOs and called them out for lying about the bill,\" he said.",
    "\"I'm worried that Perdue's term as governor would be more stacked towards helping out Trump in his 2024 (presidential) bid instead of trying to run the state of Georgia.\"",
    "Right to his point, Purdue said at the Trump rally on Saturday, \"In the state of Georgia, thanks to Brian Kemp, our elections in 2020 were absolutely stolen, yeah!\"",
    "It is not hard to find Republican voters in Georgia who lean right and have also voted for Trump, Purdue, President Joe Biden and Kemp over a number of years.",
    "Brian Kemp says he is certain one thing won't happen before the Republican gubernatorial primary May 24: an endorsement from former President Donald J. Trump.",
    "We've got the new battery plant, and the Rivian automaker that just announced they're going to be building a $5 billion factory in that same region,\" he said.",
    "\"And even though we lost the All-Star Game to another state, we got poetic justice when the Braves won the World Series,\" Kemp proudly said of his home team.",
    "She reaches the Everyman and Everywoman through shoe-leather journalism, traveling from Main Street to the beltway and all places in between.",
    "\"But I do think that situation gave me the opportunity to let people know that I was still the fighter they elected when I got in office.\"",
    "The upcoming Georgia primary is one of three big contests where Trump has handpicked challengers to upend fellow Republican incumbents.",
    "He will, however, vote in the upcoming Republican gubernatorial primary and he said he is about 90% sure Kemp has earned his vote.",
    "Southard said he's impressed Kemp evaded the controversies that Democratic candidate Stacey Abrams tried to bait him with in 2018.",
    "They see Republican voters as frozen in time in a cultish allegiance with Trump, but in reality, they are much more complicated.",
    "But as the confluence of all three meet in this primary he said he'll be casting his vote in the best interests of his state.",
    "He's batting a thousand against Stacey Abrams and I want the person running who has already beat Abrams to win the primary.",
    "He has transformed Georgia, particularly in my region, and has turned it into an EV (electric vehicle) powerhouse.",
    "In the senate primary race in North Carolina, Trump has backed Rep. Ted Budd over former governor Pat McCrory.",
    "He just needs to meet with voters one-on-one and talk to them about what his administration has accomplished.",
    "But polling for the past few months has steadily shown Perdue trailing Kemp by about 10 percentage points.",
    "Salena Zito is a CNN political analyst, and a staff reporter and columnist for the Washington Examiner.",
    "A lot of the reason has to do with Trump's influence  and not in the way the ex-president intended.",
    "I'm looking for the endorsement of our voters and I believe I'll get that on election day.\"",
    "The most recent Fox News Poll in March shows Kemp now up 11 points over the former senator.",
    "\"It is just offensive for anyone to say, 'You should vote for him because I endorse him.'\"",
    "View Cartoon\nThe media have wildly underestimated Kemp's tenacity and appeal with voters.",
    "Statements like that don't sit well with a lot of Georgia voters who lean center-right.",
    "Voters are more complicated than the way they're framed by reporters or strategists.",
    "\"As much as I agree more with David Perdue's platform, I fear his Trump endorsement.",
    "I fear his Trump alignment and what I would describe as blind loyalty,\" Sproul said.",
    "\"Kemp, most certainly,\" said the 37-year-old entrepreneur and father of four boys.",
    "But if all three challengers lose, that could cause him to rethink a run in 2024.",
    "But, among all three contests, a Kemp loss would be the biggest win for Trump.",
    "Now, four years later, he is a fan  especially as Abrams is running again.",
    "I appreciate what he did for our state,\" Kemp told me in an interview.",
    "They also don't truly know what matters to people when they vote.",
    "Kemp said his job is not to get mired in the endorsement drama.",
    "He also voted for Trump twice and liked his policies.",
    "As a result, the GOP lost its majority in the senate.",
    "Kemp says his emphasis right now is on the present.",
    "\"I've never said a bad word about President Trump.",
    "Jim Southard has voted for both Purdue and Kemp.",
    "I can't control what other people are doing.",
    "\"I don't care who endorses whom,\" he added.",
    "I fear his disagreement with the election.",
    "\"I'm staying focused on what my record is.",
    "\"Kemp has a really good track record.",
    "\"I think he's done a fantastic job.",
    "And he said he is fine with that.",
    "And I don't plan on doing so.",
    "Leland Sproul is one of them.",
    "I stood by our position.",
    "Trending\nGeorgia Gov.",
    "I defended the bill.",
    "\"It was a good bill.",
    "\"I never wavered."
  ]
}