{
  "id": 1053,
  "mediaId": 12,
  "date": "d2022-03-29T17:00",
  "headline": "David Perdue says he misunderstood lock him up' chants about Brian Kemp",
  "image": "https://www.ajc.com/resizer/jNlpkd93ouAcQoG-nLvyCv3Ecec=/814x458/cloudfront-us-east-1.images.arcpublishing.com/ajc/ITLPI2KE4RF5HXLCEO5KHF666U.jpg",
  "link": "https://www.ajc.com/politics/politics-blog/david-perdue-says-he-misunderstood-lock-him-up-chants-about-brian-kemp/HT67WGY7YFFEVDCH24TFVOMFKM/",
  "sentiment": "-0.835",
  "mediaOutlet": "Atlanta Journal-Constitution",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Greg Bluestein",
  "authorUrl": "https://www.ajc.com/staff/greg-bluestein/",
  "termIds": [
    1147,
    2087,
    2095,
    2230,
    4325,
    428,
    2672,
    2945
  ],
  "sentences": [
    "Three separate tallies upheld Biden's narrow victory, an audit of absentee ballot signaturesin Cobb County found no cases of fraud, court challenges by Trump allies were squashed, and bipartisan officials  including Trump's attorney general  have said the election was fair.",
    "Kemp spokesman Cody Hall characterized it as the latest in a string of blunders that included calling a state budget that includes tax refunds and teacher pay hikes disgusting.?\nNow, he's tripping over himself to walk back yet another embarrassing gaffe,? said Hall.",
    "Perdue's clown car campaign just went from sad to downright dangerous.?\nIt was part of a Perdue effort to more tightly embrace Trump's lies about election fraud in Georgia to try to gain ground against Kemp, who is leading in the polls.",
    "The former U.S. senator said Tuesday he thought the Trump demonstrators who erupted into cheers were not chanting lock him up? after he vowed to investigate the 2020 election if he defeats Kemp in the May 24 Republican primary.",
    "But the pro-Trump slate's deepening focus on 2020 mirrors the former president's obsession with overturning his humbling defeat, which made him the first GOP presidential candidate to lose the state since 1992.",
    "It was perhaps the most vivid example of how pro-Trump Republicans are escalating election fraud conspiracy theories to rally conservatives ahead of the primaries, though it wasn't the only one.",
    "When he promised to ensure that those people responsible for that fraud in 2020 go to jail? if elected governor, loud chants of lock him up!? erupted from Trump supporters.",
    "It was what I had said very pointedly in my speech, was the people responsible for this malfeasance should be investigated and are brought to justice.",
    "Perdue responded to the demands to imprison Kemp, his former political ally turned primary rival, by encouraging the crowd to continue the chants.",
    "So I'm holding the governor accountable.?\nHis campaign earlier amplified a tweet from the Saturday rally documenting the lock him up? chant.",
    "And he doubled down on that lie at the Trump rally, claiming that he and Trump were both victims of stolen? elections.",
    "Perdue last week falsely claimed for the first time that he didn't lose to U.S. Jon Ossoff in the 2021 runoffs.",
    "I really thought they were saying lock them up,'? he said after addressing a GOP gathering in Fayette County.",
    "Republican David Perdue said he misunderstood? the Donald Trump supporters who chanted about imprisoning Gov.",
    "Brian Kemp when he smiled and flashed them a thumbs-up sign at the former president's rally.",
    "But he drew the most attention for something that wasn't scripted.",
    "I misunderstood what they were saying.",
    "The election wasn't stolen.",
    "That's what I said."
  ]
}