{
  "id": 1057,
  "mediaId": 237,
  "date": "3/29/2022 12:00:00 AM",
  "headline": "Republicans can run on winning issues or on Trump's election conspiracy theories",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/979568_sd_1648241852.jpg",
  "link": "https://www.washingtonexaminer.com/opinion/republicans-can-run-on-winning-issues-or-on-trumps-election-conspiracy-theories",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Zachary Faria",
  "authorUrl": "",
  "termIds": [
    1646,
    1341,
    1341,
    1335,
    1335,
    1646,
    1758,
    1758,
    1147,
    1147,
    2095,
    2095,
    2087,
    2087,
    428,
    428,
    2953,
    2953
  ],
  "sentences": [
    "The 2022 midterm elections can be about House Speaker Nancy Pelosi and Senate Majority Leader Chuck Schumer chasing dreams of far-left legislation while gas prices soar and inflation takes a toll on people's pocketbooks.",
    "So, Republicans are being given a choice: The next two election cycles can be about President Joe Biden's incompetence and the Democratic Party's failures, or they can be about Trump's temper tantrum.",
    "They can be about Trump being mad that Kemp wouldn't rig an election in his favor (which would have changed nothing because Trump would have lost the Electoral College with or without Georgia).",
    "It will be tough for Republicans to botch the 2022 and 2024 elections, but embracing Trump's conspiracy theories would be the best way to do it.",
    "But it was obvious during the campaign, where Biden hid from the media and stumbled through debates, that this was exactly who Biden was.",
    "Republicans can pull off victories as they did in Virginia, where a ticket led by Glenn Youngkin swept Democrats out of statewide power.",
    "Perdue's campaign has thus far been a dud, which is unsurprising given that his entire campaign is centered on his obedience to Trump.",
    "Trump held a rally in Georgia on Saturday to hype up the campaign of David Perdue, the former senator who is running against Gov.",
    "They can be about Biden's incompetence and the Democratic Party's embrace of teachers unions over students and parents.",
    "Trump overshadowed that with his own erratic campaign, unable to focus on issues such as crime or reopening schools.",
    "He handed Schumer the Senate majority in pursuit of his imaginary election victory, and he'll gladly do it again.",
    "There's a reason Democrats do all they can to keep him in the news and tie him to candidates such as Youngkin.",
    "Or the 2022 midterm elections and the 2024 presidential election can be about Dominion voting machines.",
    "You may recall that Trump reprimanded Kemp for lifting COVID restrictions in Georgia in April 2020.",
    "Trump has nothing more to offer the GOP than more headaches and more losses in winnable races.",
    "Perdue is an empty suit that has nothing to offer outside of being Trump's chosen candidate.",
    "Former President Donald Trump will not quit his incessant whining about the 2020 election.",
    "Biden's job approval has plummeted as he has shown just how terrible he is at the job.",
    "It's a good sign because Trump's war on Kemp gives Republicans two options.",
    "Trump does not care about any of the winning issues Republicans have.",
    "Brian Kemp in Georgia's GOP primary.",
    "So far, voters aren't impressed."
  ]
}