{
  "id": 1063,
  "mediaId": 136,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "Trump Threatens MAGA Boycott of Georgia Midterms if Kemp Is GOP's Candidate",
  "image": "https://d.newsweek.com/en/full/2009397/trump-kemp-georgia-rally.webp?w=790&f=a15ed77dee28a632958bbe56c709fc3a",
  "link": "https://www.newsweek.com/trump-threatens-maga-boycott-georgia-midterms-if-kemp-gops-candidate-1692254",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Natalie Colarossi",
  "authorUrl": "https://www.newsweek.com/authors/natalie-colarossi",
  "termIds": [
    1147,
    1646,
    1951,
    2087,
    2095,
    4325,
    428,
    501,
    2672
  ],
  "sentences": [
    "This is the smallest crowd I've seen at a rally of his in Georgia since he won the 2016 electionsignificantly smaller than the crowd in Perry in September,\" Greg Bluestein, a political reporter at The Atlanta Journal-Constitution tweeted.",
    "Speaking during a rally in Georgia on Saturday, former President Donald Trump suggested that his supporters would boycott the state's midterm election if incumbent Governor Brian Kemp wins the Republican Party's primary race.",
    "\"In the state of Georgia, thanks to Brian Kemp, in 2020 our elections were absolutely stolen,\" Perdue said at the rally, adding that he would make sure that \"whoever was responsible goes to jail\" if he gets elected.",
    "\"David Perdue, who is a wonderful man, and incredible family, and who really got screwed by Kemp, is the only candidate in this race who can beat Stacey 'the hoax' Abrams this November.",
    "However, he told Newsweek that the governor is \"focused on making sure [Democratic gubernatorial candidate] Stacey Abrams is never our governor or the next president.\"",
    "Nonetheless, Trump has showed his contempt for Kemp by calling for his resignation and describing him as an \"obstructionist\" for failing to investigate the election.",
    "At the event, the former president supported several GOP primary candidates, including gubernatorial Republican candidate David Perdue, who is challenging Kemp.",
    "Trump has repeatedly criticized the governor after he refused to cave to pressure to investigate the results of the 2020 presidential election in Georgia.",
    "The former president first honed in on the governor after the 2020 election, when President Joe Biden narrowly beat him in Georgia by nearly 12,000 votes.",
    "Normally, the former president draws tens of thousands of people to his events, but journalists noted that this gathering was comparably underwhelming.",
    "Unlike the governor, the Trump-endorsed candidate has repeatedly made unsubstantiated claims that the 2020 election was stolen due to voter fraud.",
    "Trump and his supporters immediately claimed the results were fraudulent, however multiple audits and recounts have confirmed that to be false.",
    "And you know the reason for that is because Trump voters MAGATrump voters will not go out and vote for Kemp,\" Trump said at the rally.",
    "Perdue, who served one Senate term before losing his reelection bid in January 2021, also issued attacks toward Kemp.",
    "Saturday's rally was reportedly one of the smallest crowds the former president has seen in Georgia since 2016.",
    "Newsweek contacted Kemp's office for additional comment, but did not hear back in time for publication.",
    "Some political analysts viewed the rally as a way for Trump to \"settle a score\" with Kemp.",
    "On Saturday, Kemp spokesperson Cody Hall did not address questions directly about Trump.",
    "\"If Brian Kemp is renominated, he will go down in flames at the ballot box.\"",
    "that were directed at Kemp, according to the Atlanta-Journal Constitution.",
    "Shortly after, parts of the crowd erupted in chants of \"Lock him up!\"",
    "\"I've covered more than two dozen Trump rallies around the nation."
  ]
}