{
  "id": 1064,
  "mediaId": 63,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "Lock Him Up' Chants Break Out At Trump Rally As Perdue Falsely Blames Georgia Gov. Kemp For Voter Fraud",
  "image": "https://imageio.forbes.com/specials-images/imageserve/624073d7d3d40c57a2a8e065/Sen--Perdue-Holds-Campaign-Event-On-First-Day-Of-Early-Voting-For-Georgia-Runoff/0x0.jpg?fit=crop&format=jpg&crop=2800,1576,x0,y290,safe",
  "link": "https://www.forbes.com/sites/nicholasreimann/2022/03/27/lock-him-up-chants-break-out-at-trump-rally-as-perdue-falsely-blames-georgia-gov-kemp-for-voter-fraud/",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicholas Reimann",
  "authorUrl": "https://www.forbes.com/sites/nicholasreimann/",
  "termIds": [
    2095,
    2095,
    2203,
    2203,
    1646,
    1646,
    1147,
    1147,
    501,
    501,
    443,
    443,
    227,
    227,
    2672,
    2672
  ],
  "sentences": [
    "Key Facts\nThe crowd at the rally erupted when Perdue parroted the ex-president's longstanding false claims that widespread fraud robbed Trump of a win in the 2020 presidential election, saying he'd \"make sure that those people responsible for that fraud in 2020 go to jail.\"",
    "Attacks on Kemp's state policies, like the governor's support for the construction of a controversial $5 billion electric vehicle plant in the small city of Rutledge, seemed to draw little reaction from the crowd, according to the Atlanta Journal-Constitution.",
    "Lock him up!' Perdue promotes election conspiracies to boost struggling campaign (Atlanta Journal-Constitution)\nFellas, I Need 11,000 Votes': Trump Pressures Georgia Officials To Overturn Election In Leaked Audio Clip (Forbes)",
    "Many of Trump's fiercest attacks after the election targeted top Georgia GOP officials like Kemp and Secretary of State Brad Raffensperger, whom Trump pressured to \"find\" enough votes to overturn his loss.",
    "Trump last week withdrew his endorsement of Rep. Mo Brooks (R-Ala.), one of his most loyal supporters in Congress, after Brooks decided to focus his campaign on issues other than Trump's fraud claims.",
    "Brian Kemp (R) of enabling voter fraud and suggesting he'd somehow jail \"those people responsible for that fraud,\" as polls show Perdue well behind the incumbent in his Trump-backed bid for governor.",
    "Those attacks have continued as Trump has made ousting Kemp in the upcoming GOP primary a top priority, but the efforts seem to have largely failed to connect with Georgia Republicans.",
    "Trump lost five states he carried in 2016, but he was particularly enraged over failing to win Georgia, where he became the first GOP presidential nominee to lose the state since 1992.",
    "Kemp maintains a solid polling lead over Perdue for the GOP gubernatorial primary, with the latest RealClearPolitics polling average showing Kemp ahead by nine percentage points.",
    "Trump was known as a kingmaker during his presidency, with his endorsements often catapulting little-known GOP candidates to easy victories.",
    "The Georgia GOP primary is May 24, with the winner facing presumptive Democratic nominee Stacey Abrams in the November 8 general election.",
    "According to Atlanta Journal-Constitution, the crowd for Saturday evening's rally appeared smaller than Trump's previous Georgia events.",
    "Topline\nFormer Sen. David Perdue (R-Ga.) riled a crowd of former President Donald Trump's supporters into \"lock him up!\"",
    "But several of his endorsed candidates for the 2022 midterms, including Perdue, are struggling to gather much support.",
    "A Quinnipiac University poll earlier this year found Kemp maintained a 70% approval rating among Georgia GOP voters.",
    "chants at a rally Saturday night after falsely accusing Gov."
  ]
}