{
  "id": 1070,
  "mediaId": 21,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "Trump once again praises authoritarian leaders, calling Putin's soldiers on the border of Ukraine 'a great negotiation'",
  "image": "https://i.insider.com/623722261d30a30019f4f4fb?width=2000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/trump-calls-ukraine-invasion-a-great-negotiation-2022-3",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Katherine Tangalakis-Lippert",
  "authorUrl": "https://www.businessinsider.com/author/katherine-tangalakis-lippert",
  "termIds": [
    2030,
    2030,
    2078,
    2078,
    1941,
    1941,
    1147,
    1147,
    194,
    194,
    2910,
    2910,
    2942,
    2942
  ],
  "sentences": [
    "The campaign event Trump spoke at was in support of former pro football star running back Herschel Walker, who is running in the GOP Senate primary in Georgia, and former Sen. David Perdue, a primary challenger to Republican Gov.",
    "At a campaign rally in Georgia on Saturday, former President Donald Trump once again praised Vladimir Putin's intelligence, calling the Russian president's decision to place troops on the border of Ukraine \"a great negotiation.\"",
    "During his remarks, Trump called Putin's attack on Ukraine \"heinous attacks on a proud and sovereign nation,\" then praised authoritarian leaders Kim Jong-Un, Xi Jinping, and Putin for their intelligence.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Trump added that \"certain things\" \"should never have happened\" and alluded to the idea that the invasion of Ukraine would not have happened if he were in office.",
    "Former US President Donald Trump speaks to the crowd during a rally at the Florence Regional Airport on March 12, 2022 in Florence, South Carolina.",
    "Sean Rayford/Getty Images\nFormer President Donald Trump praised Xi Jinping, Kim Jong-Un, and Vladimir Putin in a campaign event.",
    "Sign up for our weekday newsletter, packed with original analysis, news, and trends  delivered right to your inbox.",
    "\"I think [Putin] made a big mistake, what he's done to so many people, but that was a big mistake,\" Trump said.",
    "Trump called Putin's decision to put troops on the border of Ukraine \"a great negotiation.\"",
    "I said, 'That's a hell of a way to negotiate, put 200,000 soldiers on the border.'\"",
    "That didn't work so well recently in our country,\" Trump said during the rally.",
    "Subscribe to push notifications\n Close icon Two crossed lines that form an 'X'.",
    "Trump has a pattern of praising authoritarian leaders from around the world.",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "And I actually thought he was going to be negotiating.",
    "Stay up to date with what you want to know.",
    "\"But it looked like a great negotiation.\"",
    "Sign up for notifications from Insider!",
    "\"But they ask me, 'Is Putin smart?'",
    "\"The smartest one gets to the top.",
    "Loading Something is loading.",
    "Yes, Putin was smart.",
    "Brian Kemp."
  ]
}