{
  "id": 1073,
  "mediaId": 441,
  "date": "3/27/2022 12:00:00 AM",
  "headline": "Trump Holds Georgia Rally in Effort to Retain GOP Kingmaker Role",
  "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/igkZARsaXLsg/v1/800x-1.jpg",
  "link": "https://www.bloomberg.com/news/articles/2022-03-27/trump-holds-georgia-rally-in-effort-to-retain-gop-kingmaker-role",
  "mediaOutlet": "Bloomberg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mark Niquette",
  "authorUrl": "https://www.bloomberg.com/authors/AQVgYOcI2go/mark-niquette",
  "termIds": [
    815,
    1147,
    1646,
    2087,
    2095,
    2412,
    428,
    2555,
    2672
  ],
  "sentences": [
    "Perdue said in a brief interview before the rally that about half of Republican voters in Georgia don't know that Trump has endorsed him, and tonight will be huge for that.? He also said he doesn't believe the polls showing Kemp with a significant lead are accurate and they don't capture voters' anger and desire for change.",
    "Kemp spokesman Cody Hall didn't directly respond to Trump's comments, saying in a statement, Governor Kemp is focused on making sure Stacey Abrams is never our governor or the next president.?\nThe rally featured speeches by Perdue, Hice, Gordon and the five other GOP statewide candidates Trump has endorsed in Georgia.",
    "Donald Trump tried to rouse Georgia Republican voters to back struggling primary challenger David Perdue against incumbent Republican Governor Brian Kemp in a rally on Saturday night, less than two months before an election that will test the former president's status as GOP kingmaker.",
    "A Kemp loss would help reinforce Trump's kingmaker status, but a victory would provide the strongest incentive yet for segments of the GOP eager to move on from Trump and his false claims about the last election, and likely ease trepidation among 2024 presidential aspirants.",
    "The former president repeated his false election claims about a stolen election in Georgia and said Republicans have to defeat Kemp and other RINOS -- Republicans in name only -- he's targeted and blames for not overturning his loss to Joe Biden in the southern state.",
    "Trump announced on Friday that he'll be holding a rally on April 9 in North Carolina to support Representative Ted Budd, the candidate he's endorsed for the seat being vacated by retiring Senator Richard Burr who's also lagging behind in the polls and fundraising.",
    "Before we can defeat the Democrat socialists and communists, which is exactly what we're running against at the ballot box this fall, we first have to defeat the RINO sellouts and the losers in the primaries this spring,? Trump said.",
    "In his speech before Trump spoke, Perdue said our elections in 2020 were absolutely stolen.? He compared the Georgia primary to the elections in Virginia, where Republican Glenn Youngkin prevailed in last year's governor's race.",
    "I think it bodes very well for any Republican endorsed by Trump.?\nMeanwhile Andra Gillespie, a political science professor at Emory University in Atlanta, said she doesn't expect the rally to affect the primary races much.",
    "Fulton County District Attorney Fani Willis in Atlanta has also convened a special grand jury to investigate Trump's infamous phone call to Raffensperger to find? 11,780 votes -- just enough to reverse the results.",
    "If Kemp runs I think Herschel Walker is going to be very seriously and negatively impacted,? Trump said, adding that his supporters won't bother to vote if Kemp is on the ballot, and that will hurt Walker.",
    "Debbie Dooley, a grassroots conservative activist who attended the rally with Bikers for Trump, said she expects dramatic change in the governor's race as Trump supporters realize he has endorsed Perdue.",
    "Besides backing Perdue over Kemp, Trump has endorsed Representative Jody Hice over Secretary of State Brad Raffensperger and John Gordon against Attorney General Chris Carr.",
    "Senator whom Trump recruited to challenge Kemp, and others he endorsed, including former football star Herschel Walker, who is making a Georgia U.S. Senate seat bid.",
    "High Stakes\nThe former president has especially focused his ire over losing the 2020 election on Georgia and the officials who wouldn't nullify the results.",
    "Trump tried to tie Perdue's fortunes to Walker's, who is polling more competitively in his GOP primary race for the right to challenge Democrat U.S.",
    "Representative Marjorie Taylor Greene, a Republican who represents part of North Georgia and staunch Trump supporter, also spoke.",
    "It's one of more than 130 federal, state and local candidates Trump has endorsed in 34 states since leaving office.",
    "Trump held the rally in North Georgia, a Republican bastion, about 70 miles northeast of Atlanta.",
    "A Fox News poll of Georgia Republicans released March 8 showed Kemp leading Perdue 50% to 39%.",
    "Besides a commanding lead in the polls, Kemp has nearly 15 times as much cash on hand.",
    "But it's the Republican gubernatorial primary that has the highest stakes for Trump.",
    "They're going to rise up in a way that no poll can pick up,? Perdue said.",
    "Trump and Perdue calling Kemp a RINO won't move GOP voters, she said.",
    "There is just such an incredible energy here,? she said.",
    "He is not a RINO and people know that,? Gillespie said.",
    "The event was for Perdue, the former U.S.",
    "Just saying it doesn't make it true.?",
    "It's like a party atmosphere.",
    "Senator Raphael Warnock."
  ]
}