{
  "id": 1078,
  "mediaId": 129,
  "date": "3/26/2022 12:00:00 AM",
  "headline": "In Georgia, a Campaign Fueled by Trump's Revenge Sputters",
  "image": "https://static01.nyt.com/images/2022/03/27/us/politics/27pol-perdue-print1/26pol-perdue1-articleLarge.jpg?quality=75&auto=webp&disable=upscale",
  "link": "https://www.nytimes.com/2022/03/26/us/georgia-governor-trump-perdue-kemp.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    973,
    1147,
    1951,
    2087,
    2095,
    2420,
    428,
    2555,
    2672
  ],
  "sentences": [
    "The group includes Herschel Walker, a former Heisman Trophy winner running for Senate; U.S. Representative Jody Hice, a candidate for secretary of state; Vernon Jones, a former Democrat now running for Congress; and John Gordon, a conservative lawyer who helped Mr. Trump defend his false election claims in court.",
    "The challenge for Mr. Perdue, as well as for other candidates backed by Mr. Trump, is to make a case that goes beyond exacting revenge for 2020.\nWhen you're running against an incumbent governor, it's a referendum on the incumbent,? said Eric Tanenblatt, a chief of staff to former Georgia Gov.",
    "I don't think there is one.?\nMr. Perdue's allies argue that Governor Kemp's track record is forever tainted by his refusal to try to overturn the election results or call a special legislative session to review them, even though multiple recounts confirmed Joe Biden's win.",
    "Although Mr. Perdue's ads, social media pages and campaign website note that he is endorsed by Mr. Trump, Mr. Perdue's campaign aides believe many voters are not yet paying attention and do not know that he has Mr. Trump's support.",
    "At the time, he said, he asked not only for Mr. Kemp to call a special legislative session, but also for the resignation of Georgia's current secretary of state, Brad Raffensperger  remarks received with loud applause.",
    "Mr. Perdue's sputtering start may hint at a deeper flaw in Mr. Trump's plan to punish the governor for refusing to work to overturn Georgia's 2020 election results: Mr. Trump's grievances may now largely be his alone.",
    "ATLANTA  When Donald Trump recruited David Perdue to run for governor of Georgia, Mr. Trump's allies boasted that his endorsement alone would shoot Mr. Perdue ahead of the incumbent Republican governor, Brian Kemp.",
    "He recently campaigned with Representative Marjorie Taylor Greene at a rally in her rural northwest Georgia district, even after the congresswoman appeared at a far-right conference with ties to white supremacy.",
    "He's going to do a great job.?\nMr. Trump hosted a fund-raiser for Mr. Perdue at Mar-a-Lago in early March, shortly after his son, Donald Trump Jr., visited Georgia to stump for the former senator.",
    "After pursuing a deeply conservative legislative agenda, Mr. Kemp has secured support from most of the top state leaders and lawmakers, even those who have, until now, aligned with Mr. Trump.",
    "And folks that may have been upset about that, still, they see that Governor Kemp is a proven conservative leader that we need.?\nOf Mr. Trump's rally, he added: I don't think it does much.",
    "But Mr. Tanenblatt is now among the Republicans worried that Mr. Perdue is merely distracting the party from its top goal: fending off the likely Democratic nominee, Stacey Abrams.",
    "And if the incumbent has a good track record, it's going to be hard to defeat him.?\nMr. Tanenblatt backed David Perdue's past Senate campaigns, including his losing bid last year.",
    "That record, Kemp supporters argue, won over Republican base voters, even those who agree with Mr. Trump that Mr. Kemp did not do enough to fight the election results in Georgia.",
    "He was one of the first governors to roll back Covid-19 restrictions in early 2020, drawing the support of many on the right who were angry about government-imposed lockdowns.",
    "Mr. Perdue also split with Mr. Kemp over his support for a group of residents in the wealthy Buckhead neighborhood north of Atlanta who are seeking to secede from the city.",
    "They are expected to be joined by the six other Georgia candidates Mr. Trump has endorsed in the state, part of his campaign to play kingmaker in this year's election.",
    "The Republican Governors Association has also cut more than $1 million in ads supporting Mr. Kemp  the first time the organization has taken sides in a primary race.",
    "voters believe lies about fraud and irregularities in the 2020 election, there is little evidence that Republicans remain as fixated on the election as Mr. Trump.",
    "And the polls are showing it.?\nIn early March, a Fox News poll of Georgia Republican primary voters showed Mr. Kemp ahead of Mr. Perdue by 11 percentage points.",
    "Mr. Perdue opposed the construction of an electric truck factory in the state, saying that the associated tax incentives would benefit wealthy liberal donors.",
    "The events brought in more than $600,000 for Mr. Perdue's campaign, according to three people familiar with the fund-raising tallies who asked for anonymity.",
    "Mr. Trump saw Mr. Kemp's refusal as disloyal, in part because Mr. Trump endorsed the governor in a 2018 primary, helping to propel him to a decisive win.",
    "Since losing Georgia by fewer than 12,000 votes in 2020, Mr. Trump has tried to turn the state's politics into a proxy war over his election grievances.",
    "Mr. Kemp has amassed a war chest of more than $12.7 million, compared with the $1.1 million Mr. Perdue has raised since entering the race in December.",
    "The former corporate executive has been a Trump ally, but he hardly exuded the bombast of his political benefactor during his one term in the Senate.",
    "The idea gained traction among some who were concerned about rising crime rates in Atlanta, but the effort is now stalled in the state legislature.",
    "At the rally, Mr. Perdue lamented the assault? on Georgia's elections and reminded the crowd that he fought for President Trump? in November 2020.",
    "Georgia Republicans braced for an epic clash, fueled by the former president's personal vendetta against Mr. Kemp, that would divide the party.",
    "That's the wound with the salt in it right now that hasn't healed,? said Bruce LeVell, a former senior adviser to Mr. Trump based in Georgia.",
    "In a video announcement for his Saturday visit, Mr. Trump called Mr. Perdue a great gentleman? and declared, He's going to clean things up.",
    "And in January, the governor backed a law allowing people to carry a firearm without a permit and another banning mailed abortion pills.",
    "Period.?\nMr. Trump will try to reboot Mr. Perdue's effort at a Saturday rally in Commerce, a small city 70 miles northeast of Atlanta.",
    "It comes down to what is the enduring influence of the Trump endorsement,? said Brian Robinson, a Georgia-based political consultant.",
    "He blamed Mr. Kemp for his loss, saying he did not win Georgia because the governor refused to block certification of the results.",
    "I think they've turned the page on the election,? said State Senator Clint Dixon, a Republican representing the Atlanta suburbs.",
    "Republican observers say Mr. Perdue needs to improve his fund-raising  or spend some of his own money  if he wants to compete.",
    "It is personal,? said Martha Zoller, a Georgia-based conservative radio host and former aide to both Mr. Kemp and Mr. Perdue.",
    "President Trump believes that he made Brian Kemp.?\nNow Mr. Perdue's campaign is looking for the same boost from Mr. Trump.",
    "Although Mr. Perdue's campaign has largely focused on the 2020 election, he and Mr. Kemp have split over other issues.",
    "But two months out from the Republican primary election, Mr. Perdue's campaign has been more underwhelming than epic.",
    "The governor has the backing of many of the state's big donors and remains far ahead of Mr. Perdue in fund-raising.",
    "Early polls have steadily shown Mr. Perdue, a former senator, trailing Mr. Kemp by about 10 percentage points.",
    "If David Perdue wins, I mean, we know without a shadow of a doubt that it is  it's still the nuclear button.?",
    "The former governor intends to remain neutral in the primary, according to people familiar with his plans.",
    "(Since December, Ms. Abrams has been raising more than both men, bringing in $9.3 million by January.)",
    "And there has to be a compelling reason why you would vote out an incumbent,? Mr. Tanenblatt said.",
    "Last year, he signed into law new voting restrictions that were popular with the Republican base.",
    "Earlier this month, he appointed Sonny Perdue chancellor of the state's university system.",
    "David Perdue is the only one that can unify the Republican Party in the state of Georgia.",
    "Mr. Kemp has had years to guard himself against a challenge from the party's Trump wing.",
    "Mr. Kemp has worked to line up key Republican leaders  or keep them on the sidelines.",
    "Mr. Trump's attempt to overturn the results is under criminal investigation.",
    "Mr. Trump this week endorsed Mr. Gordon's bid for state attorney general.",
    "Mr. Kemp embraced the deal as a potential economic boon.",
    "Republicans across the country will be watching closely.",
    "Mr. Perdue is now running to the right of Mr. Kemp.",
    "Sonny Perdue, the former senator's cousin.",
    "Donald Trump's not on the ballot.",
    "While polls show many G.O.P."
  ]
}