{
  "id": 1080,
  "mediaId": 136,
  "date": "3/26/2022 12:00:00 AM",
  "headline": "Trump Heads to GeorgiaWhere Grand Jury on 2020 Election Pressure Looms",
  "image": "https://d.newsweek.com/en/full/2009258/donald-trump-georgia.webp?w=790&f=57e76204f2edc1c7ee4bb2582756167c",
  "link": "https://www.newsweek.com/trump-heads-georgiawhere-grand-jury-2020-election-pressure-looms-1692155",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    1147,
    1646,
    2087,
    2095,
    2203,
    4325,
    428,
    2624,
    2670,
    2672
  ],
  "sentences": [
    "\"It's very hard to understand that conversation [between Trump and Raffenspeger] any other way when he says 'you and your lawyer' are going to be in basically criminal trouble if you don't somehow, 'find' one more vote than the number by which I lost to Biden, according to your count,\" Laurence Tribe, a constitutional law professor at Harvard, told MSNBC last year.",
    "In her request for the grand jury, the district attorney explained that her office had \"received information indicating a reasonable probability that the State of Georgia's administration of elections in 2020, including the State's election of the President of the United States, was subject to possible criminal disruptions.\"",
    "\"We realize we are coming to a place where there are enough people that will require a subpoena for us to speak to, for us to be able to get information, and so yes, we are headed into phase two, and phase two I believe starts when we actually start with a special purpose grand jury.\"",
    "Georgia's Fulton County's District Attorney Fani Willis in January got approval from the local Superior Court to seat a special grand jury with subpoena power as her office investigates Trump's effort to interfere in the state's 2020 election.",
    "As former President Donald Trump heads to Georgia for a rally on Saturday, his staunch critics are keeping an eye on an ongoing investigation into his efforts to pressure the southern state's Republican leaders to overturn the 2020 elections.",
    "In the aftermath of Trump's presidential election defeat in Georgia, he pressured the state's Republican leadersGovernor Brian Kemp and Secretary of State Brad Raffenspergerto overturn President Joe Biden's victory.",
    "\"What this Civil Special Grand Jury should be looking into is not my perfect phone call, but the large scale voter fraud that took place in Georgia,\" the former president said in a January statement.",
    "Willis told The Atlanta Journal-Constitution in February that she anticipates the grand jury involved with her probe will likely see a lot of activity over the summer.",
    "CNN reported in mid-March that Willis had brought on Michael Carlson, known as an expert in the rules of evidence, to assist with investigations in Fulton County.",
    "Although Trump and his allies have repeatedly attacked the GOP secretary of state, he voted for the former president and contributed to his campaign.",
    "\"Others obviously thought so, too, because some of Trump's more radical followers have responded as if it was their duty to carry out this threat.\"",
    "Although he is reportedly not focused specifically on the Trump case, his addition would be expected to be a valuable asset to the investigation.",
    "\"I felt thenand still believe todaythat this was a threat,\" Raffensperger wrote in his book Integrity Counts, which was published late last year.",
    "Georgia has been a key focus of those lies, as the traditionally red state flipped blue for Biden by a narrow margin of less than 12,000 votes.",
    "However, those results have been repeatedly reaffirmed by multiple audits and recounts conducted under the supervision of Raffensperger.",
    "Trump's Saturday rally at Banks County Dragway in Commerce, Georgia, which is about an hour northeast of Atlanta, will start at 7 p.m.",
    "The event, which is expected to draw thousands of supporters, will be streamed live on YouTube by the Right Side Broadcasting Network.",
    "In a controversial January 2, 2021 phone call, Trump urged Raffensperger to \"find\" enough votes to flip the election in his favor.",
    "The former president has dismissed the investigation, as well as numerous others, as a \"witch hunt\" and wholly partisan in nature.",
    "There's a possibility that, after week one, that some appellate issue will come and there's a halt,\" the district attorney said.",
    "The secretary declined to cave to Trump's pressure and has repeatedly pushed back against his false claims about the election.",
    "The former president continues to baselessly claim that the 2020 election was \"rigged\" or \"stolen\" in favor of Biden.",
    "In the upcoming Republican primary in Georgia, Trump has backed Kemp's primary rival former Senator David Perdue.",
    "After news of the grand jury broke, Trump doubled-down on his false claims about Georgia's election results.",
    "\"But what I do think is within a year we will have all the information that we need,\" Willis continued.",
    "\"There's a possibility that after two months we'll have all the information we need to press forward.",
    "That's just code for 'give me a victory that I didn't win, or else you're in trouble.'",
    "That probe is slated to seat a grand jury to review and subpoena evidence this spring.",
    "At the center of Willis' probe is the former president's phone call to Raffensperger.",
    "The Republican official has described that conversation with Trump as a \"threat.\"",
    "However, some legal experts see it as one of the stronger cases targeting him.",
    "Whether Willis' probe results in any charges against Trump remains to be seen.",
    "That's really strong-arming extortion, a violation of the election laws.",
    "We heard it happen in real-time and we heard it with our own ears in.",
    "So, it's really hard to wiggle out of that,\" he explained.",
    "Trump also endorsed Raffensperger as well as Kemp in 2018.",
    "The grand jury will be seated on May 2.",
    "\"So, finding one extra vote.",
    "ET."
  ]
}