{
  "id": 1081,
  "mediaId": 136,
  "date": "3/26/2022 12:00:00 AM",
  "headline": "Trump Georgia Rally Takes Aim at Kemp 'to Settle a Score' After 2020 Feud",
  "image": "https://d.newsweek.com/en/full/2009243/donald-trump-brian-kemp.webp?w=790&f=4b59c18d013f34765ef62ea17177faa3",
  "link": "https://www.newsweek.com/trump-georgia-rally-takes-aim-kemp-settle-score-after-2020-feud-1692144",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Jason Lemon",
  "authorUrl": "https://www.newsweek.com/authors/jason-lemon",
  "termIds": [
    1131,
    1147,
    1646,
    2087,
    2095,
    2230,
    2246,
    4325,
    428,
    2672
  ],
  "sentences": [
    "In addition to Perdue for governor, Trump has endorsed former NFL star Herschel Walker in a Senate bid xxagainst Warnock, and former state House Representative Vernon Jones as he seeks the seat being vacated by GOP Congressman Jody Hice's retirement in Georgia's 10th District.",
    "They say that the then-president's baseless claims that the presidential election was \"rigged\" or \"stolen\" deterred Republican voters from turning out to cast ballots in the runoffs, allowing Ossoff and fellow Democratic Senator Raphael Warnock to pull off wins.",
    "\"I think it could be the start of, I don't want to use the word downfall, but it could be the start of his influence waning,\" Eric Tanenblatt, who served as chief of staff to Georgia's former GOP Governor Sonny Perdue, told ABC News.",
    "\"We would have been better off in the runoffs if Trump hadn't come,\" Martha Zoller, a conservative commentator with close ties to both Kemp and Perdue, told The Atlanta Journal-Constitution this week.",
    "While Walker appears to be well-positioned, with several polls showing him beating Warnock if they eventually go head-to-head, Jones is in a crowded GOP primary field against 10 other contenders.",
    "Former President Donald Trump heads to Georgia on Saturday for a large rally in support of GOP gubernatorial candidate David Perduewho is challenging incumbent Republican Governor Brian Kemp.",
    "Perdue served one Senate term but lost his reelection bid in a January 2021 runoff, as his seat flipped blue for Democratic Senator Jon Ossoff, putting him in a similar situation to Trump.",
    "As none of the Senate contenders received more than 50 percent of the vote in the November 2020 election, those races, as per election law in the state, went to runoffs in January 2021.",
    "But they have been reaffirmed by multiple audits and recounts, all of which were overseen by Secretary of State Brad Raffensperger, a Republican who voted for and contributed to Trump.",
    "Unlike Georgia's state Republican leaders, Perdue went all in on supporting the former president's election liesclaiming without evidence that the results were fraudulent.",
    "In the wake of the 2020 election, Trump repeatedly urged Kemp and Georgia's other Republican leaders to overturn President Joe Biden's win in the traditionally red state.",
    "Some Republicans in Georgia have blamed Trump for Perdue's loss, as well as the defeat of GOP Senator Kelly Loeffler, in the runoffs after the 2020 election.",
    "The event, which is expected to draw thousands of supporters, will be streamed live on YouTube by the Right Side Broadcasting Network.",
    "Just 39 percent of Georgia's GOP voters backed Perdue while 50 percent supported Kempan 11 point lead for the incumbent Republican.",
    "\"We're going to see a rally show up that's once again going to confuse Georgians, and who knows what Donald Trump's gonna say.\"",
    "Whether Trump turns out to be the kingmaker in Georgia as he drives a wedge between conservatives there remains to be seen.",
    "That [he's] walking off the plank that Donald Trump has put out there for him here in Georgia,\" Duncan told ABC News.",
    "Trump's rally at Banks County Dragway in Commerce, about an hour northeast of Atlanta, will will kick off at 7 p.m.",
    "Ossoff then beat Perdue by more than 50,000 votes, while Warnock defeated Loeffler by more than 90,000 votes.",
    "Governor Geoff Duncan, a Republican who is not seeking reelection, told ABC News, referring to Trump.",
    "The Georgia primaries will take place on on May 24, with any necessary runoffs scheduled for June 21.",
    "In December, Trump endorsed PerdueGeorgia's former GOP senatorin his primary challenge against Kemp.",
    "\"And he will not be a help to Trump-endorsed candidates when he comes on Saturday,\" Zoller said.",
    "Newsweek reached out to Kemp's campaign for comment but did not immediately receive a response.",
    "A Fox News poll released earlier this month showed Kemp with a wide lead over his rival.",
    "The former president and his supporters immediately called the results fraudulent.",
    "The former president endorsed Raffensperger and Kemp in their 2018 campaigns.",
    "Biden narrowly beat Trump in Georgia by a margin of less than 12,000 votes.",
    "\"He will be negative and backward-lookingand that's not what voters want.\"",
    "Sonny Perdue is the cousin of David Perduebut is backing Kemp.",
    "\"And that's no way to keep conservative leadership in power.\"",
    "They declined to cave to Trump's pressure, drawing his ire.",
    "\"He's out to settle a score,\" Georgia's Lt.",
    "\"You almost feel bad for David Perdue.",
    "ET."
  ]
}