{
  "id": 1082,
  "mediaId": 124,
  "date": "3/26/2022 12:00:00 AM",
  "headline": "Trump's clout tested as he seeks to oust Georgia's GOP governor",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220324-brian-kemp-2021-ac-625p-c632ff.jpg",
  "link": "https://www.nbcnews.com/politics/2022-election/trumps-clout-tested-seeks-oust-georgias-gop-governor-rcna21479",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2087,
    1951,
    1951,
    1794,
    1794,
    2246,
    2246,
    2213,
    2213,
    2355,
    2355,
    2095,
    2095,
    815,
    815,
    1646,
    1646,
    1147,
    973,
    973,
    1147,
    428,
    571,
    571,
    428,
    2672,
    2672
  ],
  "sentences": [
    "Majority of Trump's post-presidency endorsed candidates have questioned 2020 election results\nJan. 14, 202201:55\nWith Trump set to arrive for a Saturday night rally here, and with less than two months left before the May 24 primary, Kemp leads Perdue by nine points in the Real Clear Politics average of recent polls.",
    "Kemp allies say that Perdue's senatorial defeat at the hands of Democrat Jon Ossoff in a 2021 runoff election shows that he would be the weaker candidate against Abrams and that he would have a hard time defending the outsourcing of jobs to China when he was an executive at Sara Lee and president of Reebok.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nPresident Joe Biden defeated Trump by fewer than 12,000 votes out of about 5 million cast in Georgia in 2020, but many Republican voters  even Kemp voters  say they still believe Trump was cheated.",
    "Kemp backers say Republican voters will ultimately nominate him based on a record that includes increasing funding for educators and public-safety officers, imposing new restrictions on voting and pushing for a ban on teaching \"divisive concepts\" in schools.",
    "COMMERCE, Ga.  President Donald Trump's stamp of approval was supposed to turn former Sen. David Perdue of Georgia into the favorite to beat incumbent Brian Kemp for the Republican gubernatorial nomination here.",
    "Noting that billionaire and Republican bogeyman George Soros is invested in Rivian, the company behind the plant, Perdue has accused Kemp of giving away state incentives to benefit himself politically.",
    "The challenge for Perdue, according to supporters of both candidates and longtime state political observers, is to show that Trump's fury over the 2020 election isn't the only reason to vote Kemp out.",
    "The primary reason I think the governor is doing well is because he's done a good job,? said former Republican Sen. Saxby Chambliss, pointing to Kemp's handling of the pandemic, economy and crime.",
    "Ultimately, Perdue is portraying Kemp as a governor who uses his powers to benefit himself politically but refused to exercise them to help Trump and GOP voters following the 2020 election.",
    "The formula was simple: Trump hates Kemp for refusing to try to overturn the 2020 election results, Perdue is his hand-picked challenger and most Republican primary voters still love Trump.",
    "For example, Perdue has opposed a planned electric-car battery plant in this part of the state that Kemp is touting as a $5 billion, 7,500-job boon for economic development.",
    "One thing is for certain: The result will be seen by the political world as an early test of Trump's clout with GOP primary voters during this year's midterms, and for 2024.",
    "\"I don't understand how all of a sudden Georgia has been predominantly Republican and then all of a sudden we're going to go blue, we're Democrat  with no proof of that.\"",
    "Nobody really knows what he's upset about.?\nBoth camps see the end of Georgia's legislative session, on April 4, as a starting gun for the sprint to Election Day.",
    "Some voters inside and outside the Republican Party here credit Kemp for reopening Georgia businesses, in defiance of Trump, early on in the Covid pandemic.",
    "It is often tough to predict outcomes in primaries, in part because candidates from the same party have difficulty differentiating themselves on substance.",
    "That isn't reason enough to switch horses midstream for many voters in this state, especially with Democrat Stacey Abrams looming in the general election.",
    "You take $8 million from one super PAC, another few million from another super PAC, a few $100,000 [contributions] here and it makes a difference.\"",
    "\"It's about the whole package, and that's going to be the battle  both candidates know this  that's going to be the battle for the next 60 days.\"",
    "That's why giving Perdue a boost, as he once did for Kemp in a 2018 primary runoff, will be a high priority for Trump when he arrives Saturday.",
    "Even though the election is approaching, close observers of the state's politics say that many voters are just starting to focus on the race.",
    "Though she plans to support the Republican nominee in the fall, the conflict has \"made it more likely\" that Abrams will win, Watkins added.",
    "\"But when you are running the state, you can't outsource funding for your educators, you can't outsource funding for your law enforcement.",
    "\"It's been divisive,\" Brenda Watkins, 77, a retired schoolteacher from nearby Madison County, said of Trump's push to oust the incumbent.",
    "\"What Kemp had going for him was that it was the legislative session,\" said one person familiar with the Perdue campaign's perspective.",
    "Paula Dyer, 61, who operates an antiques store on Commerce's main drag, said she would either vote for Perdue or write in a candidate.",
    "\"I'm a Trump guy, I'm a big Trump guy, I fully support Trump,\" former Georgia Rep. Lynn Westmoreland, said in a telephone interview.",
    "\"Former Sen. Perdue has a record of outsourcing jobs and products overseas to countries like China,\" Kemp spokesman Cody Hall said.",
    "Kemp has remained neutral as the effort has stalled amid opposition from some business leaders and the Republican-led legislature.",
    "\"If you wanted to curry favor with Trump  and there are lots of groups that want to curry favor with Trump  who do you go after?",
    "There's little question that Trump's anger has put Kemp at risk, but it's less clear whether that will carry Perdue to victory.",
    "This primary is \"probably the most choppy that I've ever seen, in the sense of being hard to get a read on,\" Collins said.",
    "But she said she would probably vote for Kemp, at least in part because \"he stood his ground during the pandemic.\"",
    "Likewise, Perdue backed a move by Buckhead, a wealthy section of Atlanta, to secede from the state's largest city.",
    "\"It will be that plus,\" said former Georgia Rep. Doug Collins, who, like Westmoreland, hasn't made an endorsement.",
    "More important, he will want a loyal ally in the governor's office if he seeks the presidency again in 2024.",
    "The source said donors would start to give more money to saturate the airwaves with anti-Kemp messaging.",
    "To that end, Perdue has picked a handful of local issues on which to differentiate himself from Kemp.",
    "\"What I'm upset with Kemp for is he did not force an audit and all of that for the votes,\" Dyer said.",
    "Those are essential services that the people of our state expect from their state government.\"",
    "\"I appreciate what he did, but I think he changed with the end of his term,\" Watkins said.",
    "That will change quickly, as Kemp has already placed an ad buy for more than $4 million.",
    "\"I do feel like it was rigged,\" said Sonya Thompson, 52, a massage therapist and artist.",
    "For Trump, the stakes go far beyond flexing his muscles in yet another GOP primary.",
    "Some residents are worried about the project's effects on their rural community.",
    "\"When the session ends, the governor's umbrella of earned media goes away.\"",
    "Kemp has taken care of things,\" she said in explaining how she will vote.",
    "Georgia was ground zero in his failed quest to reverse his 2020 defeat.",
    "But things haven't worked out as planned for Perdue  at least not yet.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "\"But I'm not going to let Trump's endorsement sway how I vote.",
    "\"I won't be going to the rally, let's put it that way.\"",
    "But some voters aren't looking to him for cues.",
    "And I think there's a lot of people like that.\"",
    "You go after Brian Kemp,\" the source said.",
    "\"There's a lot of money out there.",
    "David just hasn't gotten traction.",
    "\"I'm satisfied with the way Gov."
  ]
}