{
  "id": 1090,
  "mediaId": 129,
  "date": "3/26/2022 12:00:00 AM",
  "headline": "In Georgia, Trump Tries to Revive a Sputtering Campaign",
  "image": "https://static01.nyt.com/images/2022/03/26/multimedia/26pol-perdue-02x/26pol-perdue-02x-superJumbo.jpg?quality=75&auto=webp",
  "link": "https://www.nytimes.com/2022/03/26/us/politics/georgia-governor-trump-perdue-kemp.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Maya King",
  "authorUrl": "",
  "termIds": [
    1951,
    1951,
    2095,
    2095,
    2420,
    2420,
    1147,
    1147,
    973,
    973,
    428,
    428,
    571,
    571,
    2672,
    2624,
    2624,
    2672,
    2555,
    2555
  ],
  "sentences": [
    "Mr. Kemp, she added, could've done a lot better job.?\nThe candidates endorsed by Mr. Trump include Herschel Walker, a former Heisman Trophy winner running for Senate; U.S. Representative Jody Hice, a candidate for secretary of state; Vernon Jones, a former Democrat now running for Congress; and John Gordon, a conservative lawyer who helped Mr. Trump defend his false election claims in court.",
    "The challenge for Mr. Perdue, as well as for other candidates backed by Mr. Trump, is to make a case that goes beyond exacting revenge for 2020.\nWhen you're running against an incumbent governor, it's a referendum on the incumbent,? said Eric Tanenblatt, a chief of staff to former Georgia Gov.",
    "Mr. Perdue's allies argue that Governor Kemp's track record is forever tainted by his refusal to try to overturn the election results or call a special legislative session to review them, even though multiple recounts confirmed Joe Biden's win.",
    "Although Mr. Perdue's ads, social media pages and campaign website note that he is endorsed by Mr. Trump, Mr. Perdue's campaign aides believe many voters are not yet paying attention and do not know that he has Mr. Trump's support.",
    "Period.?\nMichelle and Chey Thomas, an Athens couple attending the rally, said they were unsure whether they would support Mr. Perdue in the primary or vote to re-elect Mr. Kemp as they knew little of Mr. Perdue before Saturday.",
    "COMMERCE, Ga.,  When Donald Trump recruited David Perdue to run for governor of Georgia, Mr. Trump's allies boasted that his endorsement alone would shoot Mr. Perdue ahead of the incumbent Republican governor, Brian Kemp.",
    "At the time, he said, he asked not only for Mr. Kemp to call a special legislative session, but also for the resignation of Georgia's current secretary of state, Brad Raffensperger  remarks received with loud applause.",
    "Mr. Perdue's sputtering start may hint at a deeper flaw in Mr. Trump's plan to punish the governor for refusing to work to overturn Georgia's 2020 election results: Mr. Trump's grievances may now largely be his alone.",
    "He recently campaigned with Representative Marjorie Taylor Greene at a rally in her rural northwest Georgia district, even after the congresswoman appeared at a far-right conference with ties to white supremacy.",
    "In an effort to boost Mr. Perdue and put his own stamp on the race, Mr. Trump came to Georgia on Saturday for a rally for Mr. Perdue and the slate of candidates the former president has endorsed.",
    "After pursuing a deeply conservative legislative agenda, Mr. Kemp has secured support from most of the top state leaders and lawmakers, even those who have, until now, aligned with Mr. Trump.",
    "And folks that may have been upset about that, still, they see that Governor Kemp is a proven conservative leader that we need.?\nOf Mr. Trump's rally, he added: I don't think it does much.",
    "But Mr. Tanenblatt is now among the Republicans worried that Mr. Perdue is merely distracting the party from its top goal: fending off the likely Democratic nominee, Stacey Abrams.",
    "And if the incumbent has a good track record, it's going to be hard to defeat him.?\nMr. Tanenblatt backed David Perdue's past Senate campaigns, including his losing bid last year.",
    "That record, Kemp supporters argue, won over Republican base voters, even those who agree with Mr. Trump that Mr. Kemp did not do enough to fight the election results in Georgia.",
    "Mr. Perdue also split with Mr. Kemp when Mr. Perdue gave his support to a group of residents in Atlanta's wealthy Buckhead neighborhood who are seeking to secede from the city.",
    "And Mr. Kemp, they believe, did not exercise the full extent of his power in November 2020.\nA lot of candidates say they are going to do something and don't,? Ms. Thomas said.",
    "He was one of the first governors to roll back Covid-19 restrictions in early 2020, drawing the support of many on the right who were angry about government-imposed lockdowns.",
    "Nearly every speaker echoed Mr. Trump's false election claims, placing the blame on Dominion voting machines and Democratic lawmakers for Republicans' 2020 losses in Georgia.",
    "Mr. Perdue opposed construction of a Rivian Automotive electric truck factory in the state, saying that the tax incentives it brings could benefit wealthy liberal donors.",
    "The Republican Governors Association has also cut more than $1 million in ads supporting Mr. Kemp  the first time the organization has taken sides in a primary race.",
    "Before bringing Mr. Perdue onstage later in the evening, he promised supporters that the former senator would champion election integrity and defeat Stacey Abrams.",
    "voters believe lies about fraud and irregularities in the 2020 election, there is little evidence that Republicans remain as fixated on the election as Mr. Trump.",
    "Thousands of Trump supporters turned out in the small city of Commerce, 70 miles northeast of Atlanta and about 20 miles outside of Mr. Kemp's hometown, Athens.",
    "And the polls are showing it.?\nIn early March, a Fox News poll of Georgia Republican primary voters showed Mr. Kemp ahead of Mr. Perdue by 11 percentage points.",
    "Mr. Trump saw Mr. Kemp's refusal as disloyal, in part because Mr. Trump endorsed the governor in a 2018 primary, helping to propel him to a decisive win.",
    "Since losing Georgia by fewer than 12,000 votes in 2020, Mr. Trump has tried to turn the state's politics into a proxy war over his election grievances.",
    "Mr. Kemp has amassed a war chest of more than $12.7 million, compared with the $1.1 million Mr. Perdue has raised since entering the race in December.",
    "The former corporate executive has been a Trump ally, but he hardly exuded the bombast of his political benefactor during his one term in the Senate.",
    "The idea gained traction among some who were concerned about rising crime rates in Atlanta, but the effort is now stalled in the state legislature.",
    "At the rally, Mr. Perdue lamented the assault? on Georgia's elections and reminded the crowd that he fought for President Trump? in November 2020.",
    "Georgia Republicans braced for an epic clash, fueled by the former president's personal vendetta against Mr. Kemp, that would divide the party.",
    "That's the wound with the salt in it right now that hasn't healed,? said Bruce LeVell, a former senior adviser to Mr. Trump based in Georgia.",
    "Just the Beginning: For many Trump supporters who marched on Jan. 6, the day was not a disgraced insurrection but the start of a movement.",
    "And in January, the governor backed a law allowing people to carry a firearm without a permit and another banning mailed abortion pills.",
    "He blamed Mr. Kemp for his loss, saying he did not win Georgia because the governor refused to block certification of the results.",
    "I think they've turned the page on the election,? said State Senator Clint Dixon, a Republican representing the Atlanta suburbs.",
    "It is personal,? said Martha Zoller, a Georgia-based conservative radio host and former aide to both Mr. Kemp and Mr. Perdue.",
    "Power Struggle: Led by Senator Mitch McConnell, a band of anti-Trump Republicans is maneuvering to thwart the ex-president.",
    "Mr. Perdue took things further, however, placing the blame for his Senate campaign loss and Mr. Trump's defeat on Mr. Kemp.",
    "President Trump believes that he made Brian Kemp.?\nNow Mr. Perdue's campaign is looking for the same boost from Mr. Trump.",
    "Although Mr. Perdue's campaign has largely focused on the 2020 election, he and Mr. Kemp have split over other issues.",
    "Midterms Effect: Mr. Trump has become a party kingmaker, but his involvement in state races worries many Republicans.",
    "But two months out from the Republican primary election, Mr. Perdue's campaign has been more underwhelming than epic.",
    "The governor has the backing of many of the state's big donors and remains far ahead of Mr. Perdue in fund-raising.",
    "Early polls have steadily shown Mr. Perdue, a former senator, trailing Mr. Kemp by about 10 percentage points.",
    "The former governor intends to remain neutral in the primary, according to people familiar with his plans.",
    "(Since December, Ms. Abrams has been raising more than both men, bringing in $9.3 million by January.)",
    "Post-Presidency Profits: Mr. Trump is melding business with politics, capitalizing for personal gain.",
    "And there has to be a compelling reason why you would vote out an incumbent,? Mr. Tanenblatt said.",
    "Last year, he signed into law new voting restrictions that were popular with the Republican base.",
    "I don't think there is one.?\nAll seven of Mr. Trump's endorsed candidates spoke at the rally.",
    "Like many attendees, they were unsure if they could trust the results of the 2020 election.",
    "Earlier this month, he appointed Sonny Perdue chancellor of the state's university system.",
    "David Perdue is the only one that can unify the Republican Party in the state of Georgia.",
    "Mr. Kemp has had years to guard himself against a challenge from the party's Trump wing.",
    "Mr. Kemp has worked to line up key Republican leaders  or keep them on the sidelines.",
    "In the state of Georgia, thanks to Brian Kemp, our elections were absolutely stolen.",
    "If Mr. Trump was concerned about the campaign, he didn't show it at the rally.",
    "Mr. Trump's attempt to overturn the results is under criminal investigation.",
    "Mr. Trump this week endorsed Mr. Gordon's bid for state attorney general.",
    ": Mr. Trump remains the most powerful figure in the Republican Party.",
    "He sold us out.?\nHow Donald J. Trump Still Looms\nGrip on G.O.P.",
    "Mr. Kemp embraced the deal as a potential economic boon.",
    "Mr. Perdue is now running to the right of Mr. Kemp.",
    "However, there are signs his control is loosening.",
    "Very clear,? Mr. Perdue said to the crowd.",
    "Sonny Perdue, the former senator's cousin.",
    "That's a big crowd of people,? he said.",
    "Donald Trump's not on the ballot.",
    "And they all love David Perdue.?",
    "While polls show many G.O.P.",
    "Let me be very clear."
  ]
}