{
  "id": 1094,
  "mediaId": 43,
  "date": "3/26/2022 12:00:00 AM",
  "headline": "WOW2: March's Trailblazing Women and Events in Our History",
  "image": "https://images.dailykos.com/images/751237/story_image/MarchforWomensLives-2004-FeministMajorityFoundation.jpeg?1577469109",
  "link": "https://www.dailykos.com/story/2022/3/26/2088081/-WOW2-March-s-Trailblazing-Women-and-Events-in-Our-History-March-25-through-31-2022",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1798,
    1798,
    2095,
    2095,
    2196,
    2196,
    2355,
    2355,
    2380,
    2380,
    815,
    846,
    846,
    815,
    710,
    710,
    768,
    768,
    1455,
    1455,
    1530,
    1530,
    1646,
    1646,
    1147,
    1215,
    1215,
    1143,
    1143,
    1147,
    973,
    973,
    571,
    571,
    428,
    428,
    2672,
    2672,
    2834,
    2834
  ],
  "sentences": [
    "March 27, 1866  President Andrew Johnson vetoed the Civil Rights Act of 1866 (An Act to protect all Persons in the United States in their Civil Rights and liberties, and furnish the Means of their Vindication?), but his veto was overridden by Congress and the bill became law on April 9, the first U.S. federal law to define citizenship and affirm that all citizens are equally protected by the law, mainly intended to protect the civil rights of males of African descent born in or brought to America, in the wake of the American Civil War, a precursor to the 14th Amendment  Though the act declared that all people born in the United States who are not subject to any foreign power are entitled to be citizens, without regard to race, color, or previous condition of slavery or involuntary servitude, the words persons' and citizens' would not be interpreted to include women of any color for some time to come.",
    "Newspaper report  the U.S. House of Representatives in the 1860s\nMarch 27, 1866  Minerva Hamilton Hoyt born, American pioneer in conserving California desert areas, by exhibiting desert plants at lectures she gives across the country, beginning at the 1928 Garden Club of America show in NY City, and lobbying the state of California to create three state parks: Joshua Tree, Death Valley and Anza-Borrego; as the founder of the International Desert Conservation League, she also persuades the Mexican government to set aside 10,000 acres for cactus preservation; in 1936, she moves the Roosevelt administration to designate over 800,000 acres as the Joshua Tree National Park; in 2013, the U.S. Board of Geographic Names designates Mount Minerva Hoyt, which stands within the park, in her honor.",
    "Swiss Defence Minister Viola Amherd and women members of the Swiss Army\n_________________________________\nSources\nhttp://www.nwhp.org/events/march/\nhttp://www.scholastic.com/teachers/article/important-dates-us-womens-history\nwww.historyplace.com/...\nwww.onthisday.com/...\nWomen Trailblazers of California: Pioneers to the Present,  2012 by Gloria G. Harris and Hannah S. Cohen  The History Press\ntodayinsci.com\nA Book of Days for the Literary Year, edited by Neal T. Jones\nThe Music-Lover's Birthday Book, Metropolitan Museum of Art\nThanks to WineRev  www.dailykos.com/\nThe Guardian newspaper  Top Stories and International sections\n_________________________________\nPileated Woodpecker Cooperative Parents\n Sylvia Hunt photo\nAt a prospective nest site, both sexes may tap or drum on wood.",
    "March 31, 1888  The National Council of Women of the United States is organized by Susan B. Anthony, Clara Barton, Julia Ward Howe, and Sojourner Truth, among others, the oldest non-sectarian women's organization in the U.S.\n NCW of the U.S.  Susan B. Anthony, Clara Barton, Julia Ward Howe, and Sojourner Truth were among its founders\nMarch 31, 1889  Muriel Hazel Wright born, Choctaw Indian, teacher, historian, author, editor of The Chronicles of Oklahoma, quarterly journal of the Oklahoma Historical Society (1955-73), co-authored 4-volume history of Oklahoma, textbooks of Oklahoma history, and A Guide to the Indian Tribes of Oklahoma (1951).",
    "March 26, 1900  Maria Autsch born, German Trinitarian Sister known as Angela Maria of the Heart of Jesus, the Angel of Auschwitz'; arrested by the Nazis for saying Hitler is a calamity for Europe; after anti-Hitler sentiments were discovered in her diary, she was sent to the women's camp at Ravensbruck in 1940, then moved to Auschwitz in 1942, where she befriended Margarita Schwalbova, a Jewish doctor, and took care of her and other inmates who were sick, often giving them a share of her rations; in 1943, she was moved to Birkenau where she worked in the infirmary until she was killed during an Allied bombing raid in 1944.",
    "Though restrictive legislation was often called protective,? Ida Slack, a member of the Women's Press Club, disagreed in her testimony at hearings before the New York State Senate and Assembly Committees last year on Labor and Industry: We are being protected' in this manner by the very same influences that protected' us against the suffrage, a college education, and a place in the professions.? The fire a woman / hire a man? philosophy was even more widespread, while women's rights advocates valiantly fought an uphill battle against those who discriminated against women in general and married women in particular.",
    "If particular care and attention is not paid to the Ladies we are determined to foment a Rebellion, and will not hold ourselves bound by any Laws in which we have no voice, or Representation.?\nMarch 31, 1823  Mary Chesnut born, South Carolina American Civil War diarist; notable for her attention to detail, and portrait of South culture, including white planters' fathering mixed-race children with slave women; daughter of a plantation family, she married James Chesnut, a politician who became an aide to Jefferson Davis during the war, enabling her to be an eyewitness to a number of important wartime events.",
    "It is about time we pay these workers properly for the valuable work they do.? Dr Mary-Ann Stephenson, director of the Women's Budget Group, which analyses impacts of policies on women, said: We'd known that workers on the frontline at most risk of Covid-19 were often badly paid and mainly women, but these figures are still a shock  Many will not even qualify for sick pay.?\n Dr Mary-Ann Stephenson  NHS nurses protesting low pay\nMarch 29, 2021  The Generation Equality Forum (GEF) opened a three-day meeting in Mexico City, to develop a coordinated global campaign to advance gender equality.",
    "March 27, 1824  ** Virginia L. Minor born, American suffragist, co-founded the Woman's Suffrage Association of Missouri; she attempted to register to vote in 1872, basing her claim on the 14th Amendment like Susan B. Anthony and others, which grants citizenship to all persons born or naturalized in the United States? including former slaves; when she was turned away, she and her husband, an attorney who completely supported her cause, filed suit against the state of Missouri, but the Missouri Supreme Court and the U.S. Supreme Court ruled in favor of the state of Missouri.",
    "March 25, 1953  Vesna Pusi born, Croatian sociologist and politician; President of the Croatian People's Party (2000-2008 and 2013-2016); First Deputy Prime Minister of Croatia (2012-2016), Minister of Foreign and European Affairs (2011-2016); advocate for women's and LGBT rights; Croatia nominated her as the official Croatian candidate for UN Secretary-General in 2016, but she withdrew her nomination after receiving 11 discourage' votes in the first informal straw poll of the 15-member UN Security Council; all of the UN Secretaries-General to date have been men.",
    "March 30, 1949  Liza Frulla born, Canadian Liberal politician and executive; Executive Director of the Institut de tourisme et d'hotellerie du Qubec since 2015; Minister of Canadian Heritage and Status of Women (2004-2006); Minister of Social Development of Canada (2003-2004); Member of the Canadian Parliament (2002-2006); Minister of Culture and Communications of Quebec (1990-1994); Member of the National Assembly of Quebec for Marguerite Bourgeoys (1989-1998); worked in public affairs for the Montreal Olympics organizing committee (1974-1976).",
    "Janet Browne  Charles Darwin: The Power of Place'\nMarch 30, 1956  Shahka Sherkat born, Persian pioneer of the Iranian Women's Rights movement and feminist author; founder-publisher of Zanan (Women) magazine, considered the most influential women's journal after the Iranian revolution; frequently in hot water with the Iranian government, she was sentenced to four months in prison for attending the 2000 Iran After the Elections Conference in Berlin; honored in 2005 with the International Women's Media Foundation (IWMF) Courage in Journalism Award.",
    "March 28, 1978  The U.S. Supreme Court ruled in Stump v. Sparkman in favor of judicial immunity, overturning the decision by the Seventh Circuit Court of Appeals that held Judge Harold D. Stump had lost his immunity because he had failed to observe elementary principles of due process.? In 1971, Ora Spitler McFarlin of Auburn, Indiana, through her attorney Warren G. Sunday, presented a petition to Judge Harold D. Stump of the DeKalb County Circuit Court asking to have her 15-year-old daughter, Linda Spitler, surgically sterilized.",
    "In the U.S., the Supreme Court granted an appeal by the Trump administration in January 2021, by a 6-3 split along party lines, restoring the controversial abortion rule that requires women wanting medication to end an early pregnancy to travel to a hospital or clinic to pick up the pills, despite the COVID-19 pandemic, setting aside a Maryland judge's nationwide order that waived the in-person pickup rule on the grounds that it was medically unnecessary and posed a health risk for women during the pandemic.",
    "Trailblazing Women and Events in Our History\nNote: All images and audios are below the person or event to which they refer\n_________________________________\nMarch 25, 1347  Catherine of Siena born as Caterina di Jacopo di Benincasa, Italian tertiary (associate) of the Dominican Order, Scholastic philosopher, theologian, and mystic; canonized in 1461, declared patron saint of Rome in 1866; one of the most influential writers in Catholicism, the first of only four women honored as a Doctor of the Church.",
    "Lorna Brown  Napanangka'\nMarch 25, 1958  Susie Bright born, American feminist author, journalist, editor, publisher; regarded as a sex-positive? feminist (sex-positive feminism runs counter to anti- pornography/prostitution feminism in espousing sexual freedom as an essential component of women's freedom); co-founder and editor of the first woman-produced sex-magazine On Our Backs, entertainment for the adventurous lesbian? (1984-1991); founder of Herotica, a women's erotica book series.",
    "March 30, 1947  Marilyn Crispell born, American jazz pianist and composer; member of Anthony Braxton's quarter (1983-1995); has also made numerous solo recordings, including an album of her compositions, Rhythms Hung in Undrawn Sky, in 1983.\nx\nx\nx\nMarch 30, 1948  Naomi Sims born, African-American model, entrepreneur, and author; in November, 1968, she was the first black woman to appear on the cover of the Ladies Home Journal, and in October, 1969, appeared on the cover of LIFE magazine.",
    "Currently, those found in possession of abusive images of children receive a year in prison or a fine of 20m won  a penalty the newspaper described as a slap on the wrist.? In an editorial, the newspaper said, To root out child sex exploitation, sentencing guidelines ought to be set from the standpoint of victims.? In November, 2020, Cho Ju-bin was found guilty of blackmailing at least 74 women, including underage girls, into virtual enslavement,? and sentenced to 40 years in prison.",
    "My goal is to expose rape culture  and eradicate it.?\n Soma Sara  sign on a school railing with memorial ribbons\n_________________________________\nMarch 28, 1515  Teresa of ?vila born, Spanish noblewoman who became a Carmelite nun; prominent Spanish mystic, religious reformer, author, and theologian; canonized in 1622 by Pope Gregory XV; one of the four Roman Catholic women to be declared a Doctor of the Church, over four centuries after her death; Patron Saint of Spain.",
    "March 31, 1969  Nyamko Sabuni born in Burundi, Swedish politician, member of the Liberal People's Party; Minister for Gender Equality (2006-2013), the first person of African descent to be appointed as a Minister in Sweden; her outspoken opinions on genital mutilation, honor killings, and against wearing of the hijab by girls under 15, and her statement that praying five times a day limited opportunities? for Muslims brought accusations of Islamophobia.",
    "Robert Halfon, chair of the House of Commons education select committee, called for an inquiry into safeguarding in schools, calling the allegations horrific? and a national scandal.? Soma Sara said Everyonesinvited stopped publishing the names of institutions because she was concerned that a handful of high-profile independent schools are taking a disproportionate amount of the blame for a culture that is pervasive in both private and state schools.",
    "This spring, Georgians came out in opposition to HB 481 like we've never seen before,? said Staci Fox, president and CEO of Planned Parenthood Southeast, As an abortion provider, a reproductive rights advocate, and a litigator, Planned Parenthood vowed to fight this dangerous ban every step of the way ... we are defending the rights of our patients and we are lifting up the voices of countless Georgians who were ignored this legislative session.",
    "When her son was nominated for a judgeship on the Ninth Circuit, Conservative Republicans, led by Senator Orrin Hatch (R-Utah), claimed a mother and son serving on the same court violated a 1911 federal anti-nepotism law; Judge Fletcher agreed to accept senior status in order clear the way for her son's confirmation, which meant she would serve part time, and only on cases in her home city, Seattle, and would not handle death penalty cases.",
    "Midwife Shrook Khalid Saeed tells UNFPA Executive Director Dr. Natalia Kanem about a harrowing delivery   UNFPA Yemen\nMarch 25, 2022  Opening day of We Got the Beat: Women in Music Summit at the Bearsville Center in Woodstock, NY  a three-day celebration of women's many contributions to the world of music, panels on the rampant discrimination against women in the music industry, and screenings of recent documentaries on women in music.",
    "So, the government told us that women don't need male permission to work, yet in many government jobs HR [human resources departments] were saying: Show us a letter from a man.' Or, passport law says a woman can get her own passport but there have been instances where officials say a father must approve the application.? Begum added, There are no anti-discrimination laws in Qatar, no agency you can go to if you want to complain.",
    "March 30, 2021  In the UK, the Guardian newspaper reported that Amanda Spielman, chief inspector for the Office for Standards in Education, Children's Services and Skills (Ofsted) had warned the Department of Education in 2018 and 2019 that Ofsted was unable to monitor the Independent Schools Inspectorate (ISI), to which the DofE delegated inspections of elite private schools such as Westminster and Dulwich College.",
    "March 26, 1633  Mary Beale born, English Baroque portrait painter, one of the first British women to earn a living as painter, she was the breadwinner for her family; the daughter of a church rector, many of her subjects were clergymen, including John Tillotson, who went on to become Archbishop of Canterbury; her book Observations, though never published, is one of the first instructional books written by a woman.",
    "Terri-Jean Bedford (center)  with Nikki Thomas (left) and Valerie Scott (right)\nMarch 26, 2020  Ruth Michaelson, a Guardian journalist living and working in Egypt since 2014, filed a report based on research by infectious disease specialists at the University of Toronto, as well as public health data, which concluded Egypt probably had a higher rate of coronavirus cases than the number confirmed by the government.",
    "March 29, 1903  Frances Micheles Dean born in Russia; her family fled after the White Revolution of 1917, and came to the U.S., settling in Boston; American political scientist and author, head of research for the Foreign Policy Association; noted for her many reports such as Is Democracy Possible in Africa?? and books like The United States and Russia, published in 1946, one of the first books on the Cold War.",
    "March 26, 1925  Vesta Roy born, Republican politician; first woman to serve as President of the New Hampshire Senate (1982) and as Acting Governor of the state (December 1982, during Governor Hugh Gallen's illness); served in the Royal Canadian Airforce during WWII, named as a Leading Air Woman; member of the New Hampshire House of Representatives (1972-1973) and as a New Hampshire state senator (1978-1986).",
    "Every one of them was killed, everybody who jumped was killed.?\nMarch 25, 1920  Usha Mehta born, Indian freedom fighter and follower of Gandhi, noted for organizing the Congress Radio, an underground radio station, which moved constantly during the Quit India Movement in 1942; she spoke the first words broadcast: \"This is the Congress radio calling on [a wavelength of] 42.34 meters from somewhere in India.\"",
    "March 26, 1926  ** Toni Carabillo born, graphic designer, feminist, women's history preservationist; active member of the National Organization for Women (1966-1987); founded Women's Heritage Corporation in 1969, which published a series of paperbacks on Lucy Stone, Elizabeth Cady Stanton, and other notable feminists, as well as an almanac and calendar; co-author of The Feminist Chronicles 1953-1993.",
    "March 26, 1930  Sandra Day O'Connor born, American lawyer, Republican politician, and judge; first woman appointed to the United States Supreme Court (1981-2006); served as a Judge on the Arizona Court of Appeals (1979-1981) and on the Maricopa County Superior Court (1975-1979); first woman Majority Leader in the Arizona State Senate (serving as a senator for three different districts 1969-1975).",
    "March 30, 1934  Yet-Si-Blue, aka Janet McCloud, born, Native American and indigenous rights activist; she was a leader in the campaign which led to the Boldt Decision'  U.S. v. Washington  in 1974 that re-affirmed the rights of American Indian tribes in the state of Washington to co-manage and continue to harvest salmon and other fish under the terms of various treaties with the U.S. government.",
    "March 28, 1931  The National Woman's Party sent telegrams to all 48 U.S. state governments, part of a campaign to fight discrimination against women workers: National Woman's Party calls your attention to nationwide efforts to throw women out of night work and otherwise handicap them by legislation or regulation restricting their conditions of labor but not those of their male competitors.",
    "Also known for her philanthropy and activism, including donating proceeds from her January 2010 Radio City Music Hall concert as well as that day's profits from her online store to the Haitian reconstruction relief fund, a total of $500,000, and donated $1.5 million from sales of a bracelet she designed to the Japan relief fund after the devastating 2011 T?hoku earthquake and tsunami.",
    "March 25, 1908  Dame Bridget D'Oyly Carte born, head of the D'Oyly Carte Opera Company (1948-1982), and vice-chair of the Savoy Group, which included London's Savoy Hotel; granddaughter of impresario Richard D'Oyly Carte, she inherited the family businesses after the death of her father, and while she oversaw the enterprises, she chose able managers to handle their day-to-day running.",
    "Demonstrators in support of the women victims at Michigan State\nMarch 27, 2020  With cities in lockdown around the world to stop the spread of Covid-19, women and children who live with domestic violence have no escape from their abusers during quarantine, and from Brazil to Germany, Italy to China, activists and survivors say they are already seeing an alarming rise in abuse.",
    "Betty Binns Fletcher (center)  first all-woman panel, with Dorothy W Nelson (left) and Judith N Keep (right)\nMarch 29, 1928 Joan Kelly born, set up a Master of Arts Program in Women's History at Sarah Lawrence with Gerda Lerner, advanced feminist scholarship by calling for a doubled vision? to resolve conflicts inherent in the desire for female inclusion under male dominance.",
    "Instead, just like in high streets, parks and bus stops, they are facing relentless harassment every day and they want it to stop.?\n Amanda Spielman  Rose Caldwell\n_________________________________\nMarch 31, 1425  Bianca Maria Visconti born, Duchess of Milan, active in the administration of the Duchy, known as a warrior woman? for her defense of Cremona against the Venetians.",
    "March 28, 1895  ?ngela Ruiz Robles born, Spanish teacher and inventor; wanting to lighten the weight of textbooks carried by her students, she made a device out of a series of text and illustrations on reels, all under a sheet of magnifying glass with a light for reading in the dark, with spoken descriptions of each topic, mechanical precursor to the electronic book.",
    "Women work because of necessity and should have equal opportunity with men to get and hold a job.? In the midst of increasing attacks on employed women, especially those who are married, the Cotton-Textile Institute in 1930 had urged mill executives to stop employing women for night work as of March 1, 1931, and announced that 83% of the industry had complied.",
    "March 26, 1980  Margaret Brennan born, American journalist; current moderator of the CBS program Face the Nation since 2018; CBS White House correspondent, covered Washington (2012-2018); anchor of InBusiness with Margaret Brennan (2009-2012) for Bloomberg Television; worked at CNBC as a producer and researcher for Louis Rukeyser's Wall Street (2002-2009).",
    "March 27, 1915  Mary Mallon, Typhoid Mary,' a cook whose employers kept falling ill with typhoid fever, the first healthy carrier of disease ever identified in the U.S., is put in quarantine for a second time, where she remains imprisoned until her death, after she refuses to allow removal of her gall bladder, the site of live typhoid bacteria in her body.",
    "March 27, 1862  Dorothea Fairbridge born, South African author of histories, novels, and travel guides, including A History of South Africa for schoolchildren; co-founder of the Guild of Loyal Women, a charitable organization which made sure relatives of British soldiers killed in South Africa were contacted, and their graves properly marked and recorded.",
    "March 28, 1613  Borjigit Bumbutai born, of the Khorchin Mongol Borjigit clan, one of the five consorts of Emperor Hong Taiji of the Qing dynasty; during the reign of her grandson, the Kangxi Emperor, whom she had raised after his mother died, she had significant influence in the imperial court and was respected for her political wisdom and insight.",
    "Though in agreement with Freud on most of his fundamental theories, her work directly with children led her to disagree with some of his ideas concerning children that arose from his work with adult patients, including her belief that aggression was an important force in its own right in children, a theory with which Anna Freud strongly disagreed.",
    "UNESCO chief Audrey Azoulay called upon women worldwide to take control and full leadership in every aspect of life and domain of society to build back a better future for all.?\n_________________________________\nMarch 30, 1820  Anna Sewell born, English author, known for her novel Black Beauty, which inspired anti-animal cruelty legislation.",
    "March 30, 1864  Helen Abbot Merrill born, mathematician, professor, and textbook author, earned Ph.D. from Yale in 1903 with a thesis \"On Solutions of Differential Equations which possess an Oscillation Theorem\"  Wellesley Mathematics Department professor/chair (1915-32), executive council and then VP of Mathematical Association of America.",
    "March 27, 1924  ** Sarah Vaughan born, world renowned American jazz singer and pianist known as the Divine One.?\nMarch 27, 1927  Sylvia Thomas Anderson born, English producer and screenwriter, best known for her collaboration with her husband Gerry Anderson on their 1950s and 1960s television series, Stingray, Fireball XL5 and Thunderbirds.",
    "She wrote dramas, edited a monthly magazine, and also maintained a voluminous correspondence with notable figures of the day, including British actor-manager David Garrick and Benjamin Franklin, who invited her to become the first woman member of the American Philosophical Society  she was also the only woman member for its first 80 years.",
    "Instead, it must secure specific funding for survivors to ensure they are able to access specialist services and safe and suitable accommodation  The reality is that local authorities are unable  and in many cases unwilling  to support and protect women effectively unless the government provides adequate resources, guidance and training.",
    "March 26, 1913  Jacqueline de Romilly born, French philologist, author, and scholar, of Jewish ancestry, is prohibited from teaching during the occupation of France by the Vichy government, later first woman nominated to the Collge de France, second woman in the Acadmie Franaise; known for work on culture and language of Ancient Greece.",
    "March 28, 1906  Dorothy Knowles born in South Africa, British academic and expert on French theatre, author of French Drama of Inter-War Years 1918-39 and The Censor, the Drama and the Film, which was against censorship; also a pioneer and champion in British women's fencing, and founder of the Liverpool University fencing club (1936).",
    "The day after the story was published, Michaelson was called to a three-and-a-half hour meeting with officials including the chairman of the state information service (SIS), Diaa Rashwan, where she says she and another journalist who had tweeted about the research were accused of misreporting an unreliable study and spreading panic.",
    "March 30, 1912  Clementine Churchill sent a letter to The Times responding to a lengthy bombastic letter by eminent bacteriologist and woman-hater Almroth Wright, who argued that women should not be allowed to vote, and should be kept away from politics altogether, due to their supposed psychological and physiological deficiencies.",
    "March 29, 1843  Frances Wisebart Jacobs born, American charity organizer; on 1887, co-founder with four clergymen of the Charity Organization Society in Denver CO, which became the United Way of America, which joined with United Way International in 2009 as United Way Worldwide, the world's largest privately-funded nonprofit.",
    "The government will investigate these cases and prosecute anyone who has broken the law.? The government statement said that women could act as guardians to obtain passports or ID cards for their children, that women did not need permission to accept a scholarship or to work at ministries, government institutions, or schools.",
    "She held that dirt is essentially disorder.?\nMarch 25, 1921  Simone Signoret born as Simone Kaminker; French actress and writer; in a career spanning over 40 years, she won an Oscar for Best Actress and the Cannes Film Festival Award for Best Actress for Room at the Top, three BAFTAS, a Csar Award, and a Primetime Emmy Award.",
    "A new poll by Plan International UK, a children's rights charity, found that 58% of girls and young women, aged 14 to 21, participating in the survey reported they had been publicly sexually harassed at school, including unwanted sexual comments, catcalls, wolf whistles, being groped, or upskirted? by mobile phone or camera.",
    "Frontline key workers are part of the foundations that make our society tick: we rely on them to go to work, to keep basic services running and to care for us  many of these occupations are at a high risk of exposure to the Covid-19 virus, but that are often paid at poverty wages and are carried out overwhelmingly by women.",
    "March 28, 1927  Vina Mazumdar born, Indian academic, feminist, and major figure in India's women's movement; pioneer in women's studies programs in India; secretary of the first Committee on the Status of Women in India, which brought out the first report on the condition of women in the country, Towards Equality (1974).",
    "Ruling favoring the women workers  Susan Harris, GMB  ASDA storefront\n_________________________________\nMarch 27, 1724  Jane Colden born, American botanist, called the \"first botanist of her sex in her country\" by Asa Gray, leading American botanist and Harvard professor; but she was excluded from botanical publications.",
    "During the WWII Nazi occupation of Paris, she used her mother's maiden name, Signoret, to hide her Jewish heritage in order to work as a typist for Les nouveaux temps, a French collaborationist newspaper, as the sole supporter for her mother, her two brothers, and herself, while her father was with General De Gaulle.",
    "March 25, 1958  Sisy Chen born, Taiwanese politician and TV political commentator; worked for the Taiwan Relations Center's office of the UN in the early 1990s; independent member of the Legislative Yuan (2002-2005); host of Qie Ma Chen Wen Qian, which focuses on exposing problems with Taiwan's democratic system.",
    "The district court judge, Jesse E. Eschbach, dismissed the case, holding that the only state action, which was necessary to the federal claims, was Judge Stump's approval of the petition and that he was \"clothed with absolute judicial immunity\", thereby cutting off the claims against the other defendants as well.",
    "Women are still pregnant, still having babies, and they need the care and support of properly resourced maternity services.? A survey carried out by the RCM, covering every region of England, Scotland, Wales and Northern Ireland, found the 10% vacancy rate in midwifery posts before the crisis had doubled to 20%.",
    "She decided to attend classes taught by Josiah Royce at the Harvard Annex, who suggested that she audit the Harvard classes taught by William James, but first both he and James had to persuade Harvard president Charles William Eliot to allow this, as he was opposed to a woman learning in the same room with men.",
    "Abortion is still safe, legal, and available in Georgia, and we plan to keep it that way.? The American Civil Liberties Union, Planned Parenthood Southeast, the Center for Reproductive Rights, and several Georgia abortion providers filed a legal challenge in June, 2019, contending the law is unconstitutional.",
    "March 28, 1956  Susan Ershler born, American mountaineer and public speaker; she was the fourth American woman to climb the Seven Summits; co-author with her husband Phil of Together on Top of the World: The Remarkable Story of the First Couple to Climb the Fabled Seven Summits, which was published in 2007.",
    "At one of the eight UNFPA-supported shelters in Yemen, Dr. Kanem said, I spoke to young girls and pregnant women who had to flee for their lives and seek protection at UNFPA sites, which are among the very few safe spaces for women and girls.? Dr. Kanem urged, The women and girls of Yemen deserve peace.",
    "Maria Tesselschade Visscher: engraved rmer drinking glass  copy after a Hendrick Goltzius portrait of her\nMarch 25, 1723  Kaat Mossel' born as Catharina Mulder; Dutch orangist, the pro-prince faction which fought against the patriots, who opposed the rule of the stadtholder, William V, Prince of Orange.",
    "March 29, 1957  Elizabeth Hand born, American science fiction/fantasy writer and novelist; co-creator of DC Comics series Anima; Waking the Moon (1994) won the Tiptree Award and the Mythopoeic Fantasy Award; The Maiden Flight of McCauley's Bellerophon won the 2011 World Fantasy Award for Best Novella.",
    "There are no functioning women's rights organisations who can monitor how women are treated or hold the government to account.? Some of the women interviewed reported being asked for proof of marriage in order to access women's healthcare, such as antenatal care, vaginal ultrasounds, and smear tests.",
    "March 28, 1976  Ada Limn born, American poet of Mexican American heritage, magazine contributor, and educator; her 2015 poetry collection, Bright Dead Things, was a finalist for the National Book award for Poetry, and in 2018, The Carrying: Poems won the National Book Critics Circle Award for Poetry.",
    "March 27, 1950  Julia Alvarez born, Dominican-American poet, novelist, and essayist; known for her novels, How the Garca Girls Lost Their Accents, and In the Time of the Butterflies; her poetry collections Homecoming and The Woman I Kept to Myself; and her essay compilation, Something to Declare.",
    "March 25, 1942  Aretha Franklin born, American singer-songwriter and pianist, one of the best-selling female artists of all time (over 75 million records), recipient of 18 Grammy Awards, inductee of the Rock and Roll Hall of Fame, the UK Music Hall of Fame, and the GMA Gospel Music Hall of Fame.",
    "Michaelson, who is also a German citizen, was informed by British and German diplomats that Egypt's security services asked that she attend a meeting with authorities about her visa status, which German officials strongly advised her not to attend because she would be under high risk of arrest.",
    "This is a real challenge.?\n Adriana Mello, Brazilian judge  Lella Palladino of EVA Cooperativa in Italy\nMarch 27, 2021  Over 5,000 anonymous testimonies, mostly from teenage girls, were posted on Soma Sara's website everyonesinvited.uk, after discovery of Sarah Everard's body on March 10, 2021.",
    "Following a failed assassination attempt on Joseph in 1759, the Marquis of Pombal, who was the de facto ruler as Secretary of State, ordered the entire Tvora family, considered the plot's ringleaders, executed, but Mariana Victoria persuaded her husband to spare the women and small children.",
    "March 29, 1944  Lynne Segal born in Australia, British-based socialist feminist, academic and author; co-author of the influential 1979 book Beyond the Fragments, advocating broader alliances among trade unionists, feminists, and leftist political groups, and author of Is the Future Female?",
    "The GMB union, which is backing the case, called the supreme court ruling a massive victory.? Susan Harris, the GMB legal director, said: Asda has wasted money on lawyers' bills chasing a lost cause, losing appeal after appeal, while tens of thousands of retail workers remain out of pocket.",
    "March 25, 2021 The UN Population Fund (UNFPA) reported in Yemen a woman died in childbirth every two hours, almost always from preventable causes, because of war, a humanitarian crisis, a health system verging on collapse, the deepening impact of the Covid-19 pandemic, and a looming famine.",
    "Girl selling radishes at a Cincinnati produce market which stays open until 11 PM  A a woman and girls working in a textile factory\nMarch 29, 1885  Frances Payne Bolton born, American Republican politician, the first woman elected to the U.S. House of Representatives (1940-1969) from Ohio.",
    "Her letter was signed C.S.C.? and it was sometime later that she was revealed to be the author of the witty satire Ought women not be abolished altogether??\nMarch 30, 1917  Else Aarne born, Estonian composer, pianist, and teacher; noted for chamber music, but also composed two symphonies.",
    "This is what happens when politicians, not doctors, practice medicine.? Planned Parenthood, another plaintiff in the case, appealed the ruling, and a three-judge panel of the 9th Circuit Court issued an injunction to block the new rules while the lawsuit continued in the federal courts.",
    "Grace Hartigan  LIFE Magazine, May 1957\nMarch 28, 1924  Byrd Baylor born, American novelist, essayist, author of children's books and text for picture books, including four Caldecott Honor books: The Desert is Theirs; Hawk, I'm Your Brother; When Clay Sings and The Way to Start a Day.",
    "She had cited a study accepted for publication in the Lancet Infectious Diseases journal, which analyzed flight records, traveller data and infection rates to estimate that Egypt could have had 19,310 coronavirus cases by early March, with the lower end of the range about 6,000 cases.",
    "March 25, 1594  Maria Tesselschade Visscher born, Dutch poet and glass engraver; her father was the poet and humanist Roemer Visscher; she and her sister Anna were the only women who were members of the Muiderkring, a group of Dutch Golden Age intellectuals who met at Muiden Castle.",
    "Justice Byron White wrote, A judge is absolutely immune from liability for his judicial acts even if his exercise of authority is flawed by the commission of grave procedural errors.? The decision has been called one of the most controversial decisions in U.S. Supreme Court history.",
    "March 27, 1950  Maria Ewing born, African-American opera singer who has sung both soprano and mezzo-soprano roles; she made her Metropolitan Opera debut in 1976 in Mozart's The Marriage of Figaro, and her European debut at La Scala in Milan, starring in Debussy's Pellas et Mlisande.",
    "March 27, 1862  Jelena Dimitrijevi born, Serbian short story writer, novelist, poet, traveller, social worker, feminist, and polyglot; author of novel Nove (New Women), numerous travel books, and studies of Muslim women from 1881-1898, including gaining access to a Turkish harem.",
    "March 29, 1918  Pearl Bailey born, jazz and blues singer, sang with Cab Calloway (1945), starred in movies; received a 1969 USO award for her WWII tour entertaining U.S troops; was a goodwill ambassador for United Nations (1979), and awarded a 1988 Presidential Medal of Freedom.",
    "Army spokesperson Kaj-Gunnar Sievert told the Swiss news site Watson: The old generation of uniforms was not geared enough to the specific needs of women.? Other pieces of clothing and equipment, including combat clothing, backpacks, and protective vests were being re-evaluated.",
    "The orthodox Indian community censured her for wanting to go to college in the West, but she addressed them in a meeting in the hall at Serampore College, stressing the need for women doctors in India, saying that a Hindu woman doctor could better serve the needs of Hindu women.",
    "March 29, 1949  Pauline Marois born, public servant and politician; leader of the Parti Qubcois (20072014), and Premier of Quebec (20122014); chief of staff for the Ministry of State for the Status of Women (19791981), promoted to Minister when her former boss left (1981-1982).",
    "March 28, 1915  ** Selma Rubin born, pioneering American environmental activist; after the 1969 Santa Barbara Channel oil spill, which polluted the channel with almost 100,000 barrels of crude oil, she was one of thousands of volunteers trying to save seabirds smothered in oil.",
    "She won more acclaim for her portrayal of a weary madam in Madame Rosa (1977) and as an unmarried sister who unknowingly falls in love with her paralyzed brother via anonymous correspondence in Chr inconnue (1980  released with English subtitles as I Sent a Letter to My Love).",
    "March 26, 1942  The first women prisoners arrive at Auschwitz in German-occupied Poland, sent from the camps at Ravensbruck in Germany and Pored in Slovakia, some were kept for slave labor, but many were sent directly to the gas chambers without being registered as prisoners.",
    "Human Rights Watch  Rothna Begum, women's rights researcher in Qatar\n_________________________________\nMarch 29, 1831  Amelia Huddleston Barr born in Ulverston, England; British-American writer; after her marriage to wool merchant Robert Barr, in 1850 they moved to the U.S.",
    "March 25, 1939  D.C. Fontana born, American TV script writer, story editor, author, and associate producer; notable for her work on original Star Trek and Star Trek: The Next Generation, but also wrote episodes of several TV Westerns, including Bonanza and The Big Valley.",
    "Police took the unusual step of naming the man who allegedly ran an online network that lured at least 58 women and 16 girls of middle-school age into virtual enslavement? by blackmailing them into sending degrading and, in some cases, violent sexual images of themselves.",
    "Such economic models prioritize both care for people, and care for our planet.? In June, 2021, the GEF reconvened in Paris to lay out ambitious investment and policy action plans aimed at reaching their goals by 2030, especially equal education for girls and young women.",
    "David Brown, a staff attorney for the Center for Reproductive Rights, said, This law serves no purpose other than to prevent Arizona women from using a safe alternative to surgical abortion and force their doctors to follow an outdated, riskier and less effective method.",
    "Police also investigated users who paid up to 1.5m won (US$1,200) in cryptocurrency payments to view the abusive images allegedly uploaded by Cho, who allegedly approached women seeking part-time work and offered them payment in return for nude photographs, Yonhap said.",
    "March 25, 2020  In South Korea, a sexual blackmail ring that operated on the app Telegram and targeted dozens of women, including underage girls, has rocked the country and triggered demands for authorities to crack down on the rising number of sexual offences online.",
    "March 25, 1982  Danica Patrick born, American professional racing driver (2005-2018); her 2008 Indy Japan 300 win is the only IndyCar Series race won by a woman, and her third-place finish in the 2009 Indianapolis 500 was the best performance by a woman in that race.",
    "March 28, 2020  The UK had a shortage of midwives on National Health Service maternity units even before the coronavirus outbreak, but now one in five midwifery posts is unfilled, raising concerns about the safety of pregnant women, new mothers, and newborn babies.",
    "We need to stay calm in order to tackle this difficulty we are now facing.? In Spain  where lockdown rules are extremely strict, and many people are being fined for breaking them  the government told women they will not be fined if they leave home to report abuse.",
    "She also served as a Trustee of the Metropolitan Museum of Art and chaired the Visiting Committee of the Metropolitan's Department of Far Eastern Art; she is credited with the idea for a Chinese garden courtyard, called the Astor Court, at the Metropolitan Museum.",
    "It's a global issue,? said Sara, age 22. And I think it's so important that we don't narrow our focus to private schools, because it risks making these cases seem like they're rare or anomalies, or that these patterns of abuse can only happen in certain places.",
    "Cecile Richards  Pro-Choice demonstrators at Arizona Capitol\nMarch 31, 2020  A letter sent to the UK Ministry of Housing, Communities and Local Government called for action and funding to cope with increases in domestic violence during the coronavirus lockdown.",
    "March 25, 1934  ** Gloria Steinem born, American journalist, feminist, and women's rights activist: the founding editor of Ms. Magazine, and helped found the National Women's Political Caucus, the Women's Action Alliance, and the Coalition of Labor Union Women.",
    "March 26, 1940  Nancy Pelosi born, first woman Speaker of the U.S. House of Representatives (2007-2011, and since 2019), U.S. House Minority Leader (2011-2019); House Minority Whip (2002-2003); Democratic U.S. Representative for California from 1987 to present.",
    "March 27, 1897  Effa Manley born, co-owner and manager with husband Abe of the Negro League baseball team the Brooklyn Eagles (1935-46), supported integration working with the NAACP, worked hard to get Negro League players included in the Baseball Hall of Fame.",
    "We regret that the Egyptian authorities have chosen to revoke accreditation from a reporter working for a trusted, independent media organisation like the Guardian.? The British Foreign Office issued a statement: The UK supports media freedom around the world.",
    "When her husband and four of her children died of yellow fever, she moved with her three remaining daughters to New Jersey in 1868, but after she sold a story to a magazine, she moved the family to New York, and began contributing stories to Harpers magazine.",
    "Sarah Lawrence College  Joan Kelly's book Women, History, and Theory'\nMarch 29, 1929  Sheila Kitzinger born, British social anthropologist, pregnancy and childbirth author; natural childbirth and breastfeeding advocate; National Childbirth Trust board member.",
    "The discrepancy was noticed as part of a report by the Government Accountability Office which found that some female recruits spent more than $8,000 of their own money on clothing over the course of their careers, while men sometimes had leftover allowances.",
    "After the war, she worked in the Naval Reactors Division of Argonne National Laboratory, making calculations for physicists designing a prototype submarine reactor, then later worked on AVIDAC, an early computer developed at the Reactor Engineering Division.",
    "Three women brought the case to court: Terri-Jean Bedford, a dominatrix, who argued that Canada's sex trade laws force workers from the safety of their homes to face violence on the streets, sex worker Nikki Thomas, and Valerie Scott, a former prostitute.",
    "March 29, 1923  Betty Binns Fletcher born, American lawyer and federal judge on the Ninth Circuit Court of Appeals (1979- 2012); one of the first women to become a partner in a major U.S law firm, and the second woman appointed to the Ninth Circuit bench.",
    "Otto-Peters wrote for Der Wandelstern (The Wandering Star), under the pen name Otto Stern for the Schsische Vaterlandsbltter (Saxon Fatherland Pages), and founded the women's publications Frauen-Zeitung (Women's Newspaper) and Neue Bahnen (New Tracks).",
    "March 25, 1939  Toni Cade Bambara born, challenged masculine assumptions in black radical discourse of the Sixties, her short fiction Gorilla, My Love? (1972) won the Black Rose Award, and The Salt Eaters? (1981) won the Langston Hughes Society Award.",
    "March 29, 1951  Tina Monzon-Palma born, Filipina broadcast journalist and anchorwoman; worked for GMA Networks (1976-1992), and was GMA's first woman news presenter, then pioneered its Public Affairs department during her term as GMA News executive.",
    "She is co-founder in 2005 with her husband of Iguana, a Spanish language educational magazine for children ages 7-12, which won the 2009 Multicultural Children's Publication Award from the National Association for Multicultural Education, and YO S!",
    "The Royal College of Midwives is urging NHS leaders to ringfence' maternity services so midwives will not be redeployed to care for people with Covid-19, fall sick themselves, or be forced to self-isolate because of illness within their household.",
    "Instead, in November 2019, Lord Agnew, Schools Minister at the time, wrote to Spielman that Ofsted's oversight of ISI would be taken over by the Department of Education, and Ofsted's would only have an academic part in overseeing private schools.",
    "Unless and until this happens, survivors will continue to suffer.?\n Nicole Jacobs and Isabella Mulholland\nMarch 31, 2021  The Swiss armed forces, in a bid to recruit more women, announced they will begin issuing women recruits women's underwear.",
    "Wan Fei, a retired police officer who founded a charity campaigning against abuse, said, The epidemic has had a huge impact on domestic violence.? In Brazil, a state-run drop-in centre saw a surge in cases it attributes to coronavirus isolation.",
    "March 29, 2020  A study by the economic think-tank Autonomy plotted 273 different occupations in the UK by number employed in each, level of physical proximity that each job requires, and exposure to diseases or infections that each job entails.",
    "March 27, 1976  Roberta Anastase born, Romanian Democratic Liberal Party politician; President of Chamber of Deputies of Romania (2008-2012); became a member of the EU Parliament (2007-2009) with the accession of Romania to the European Union.",
    "She asked for greater powers to monitor independent schools over potential safeguarding issues,? including conducting unannounced on-site monitoring visits? and verifying that safeguarding issues were followed up and reported on appropriately.",
    "March 31, 1995  Selena, the Mexican-American singer-songwriter and philanthropist, dubbed the Queen of Tejano Music,? was murdered by her fan club's president Yolanda Saldvar, after Saldvar was accused of embezzling money from the fan club.",
    "Gill Walton\nMarch 28, 2021  Human Rights Watch (HRW) researchers reviewed 27 laws in Qatar on male guardianship covering work, accommodation, and status, then interviewed Qatari women, to determine how the system actually works in practice.",
    "She was also on the World Health Organization's expert committee on smoking, working on international campaigns for increasing regulation of tobacco, educating people on its harmful effects, and in favor of banning smoking in public places.",
    "x\nx\nx\nMarch 26, 1985  Keira Knightly born, English stage and film actress; came to worldwide prominence in the first Pirates of the Caribbean movie, after making a breakthrough co-starring in the 2002 independent film Bend It Like Beckham.",
    "Yekaterina Vorontsova-Dashkova (1784)  by Dmitry Levitsky\nMarch 28, 1873  Anne Douglas Sedgwick born in America, British author, New York Times best-selling author; two of her novels were made into films, Tante and The Little French Girl.",
    "The world must act now.? In 2022, the conflict in Yemen was still ongoing, with almost 24 million people facing famine, 4 million people forced from their homes by the violence, and international aid was decreasing instead of increasing.",
    "March 25, 1958  sa-Britt Torstensson born, Swedish Centre Party politician; member of the Riksdag (Swedish legislature) for Vstra Gtaland from 1998-2002, Minister for Infrastructure (2006-2010), then returned to the Riksdag (2010-2014).",
    "March 28, 1968  ** Iris Chang born, daughter of Taiwanese emigrants, American journalist and historical nonfiction author; Thread of the Silkworm, The Rape of Nanking: The Forgotten Holocaust of World War II, and The Chinese in America.",
    "March 31, 1934  Kamala Suraiyya born, Indian author in Malayalam of short stories and her autobiography, while publishing poetry in English, often under the pen names; syndicated columnist who often wrote on women's issues and politics.",
    "Her clothes were ripped off, she was raped by their hands, then dragged along the square until a group of women camped by a fence closed ranks around her and the men with them threw water at the crowd until a group of soldiers arrived.",
    "As a Representative, she strongly supported the UN, especially UNICEF, and campaigned for the federal government to purchase land across the Potomac facing Mount Vernon to preserve its appearance as it was when Washington lived there.",
    "The petition alleged that the daughter was \"somewhat retarded,\" was associating with \"older youth and young men,\" and that it would be in the daughter's best interest to undergo a tubal ligation \"to prevent unfortunate circumstances.\"",
    "And they can happen to anyone.? She was inspired to set up everyonesinvited after speaking to friends and discovering that her own experiences of abuse and rape culture as a young woman were far more commonplace than she had realised.",
    "Today, she is most remembered for her performance as Norma Desmond in the 1950 film Sunset Boulevard, for which she won a Golden Globe as Best Actress, in the Motion Picture Drama category, and was nominated for another Academy Award.",
    "The supreme court backed a 2016 employment tribunal decision that the supermarket's retail staff, who are mostly women, can compare their work to those in warehouse distribution centres, which could lead to a 500m compensation claim.",
    "March 28, 1743  Yekaterina Vorontsova-Dashkova born, Russian courtier, academic, author, and art patron; major figure of the Russian Enlightenment, and part of a coup d'etat that put Empress Catherine the Great on the throne in 1762.",
    "March 28, 1922  Grace Hartigan born, American Abstract Expressionist painter of the New York School.' She was noted for her exploration of what she called empty rituals' including a series based on mannequins dressed in bridal gowns.",
    "March 27, 1878  Kathleen Bruce Scott born, Baroness Kennet by her second marriage, British sculptor; mostly noted for sculptures of her first husband, arctic explorer Robert Falcon Scott, and of Edward Smith, captain of the Titanic.",
    "In 1871, Perk was a founding member of Algemeene Nederlandsche Vrouwenvereeniging Arbeid Adelt (General Dutch Women's Association 'Labor Ennobles'), and helped start and wrote for the women's magazines Onze Roeping and Ons Streven.",
    "The U.S. Supreme Court unanimously holding \"that the Constitution of the United States does not confer the right of suffrage upon any one\" and that the decision of who should be entitled to vote was left to the legislative branch.",
    "Lawless is also a fundraiser and member of the board of trustees of the StarShip Foundation, which provides additional equipment and support to staff, patients, and families of the Starship Children's Health Hospital in Auckland.",
    "March 27, 1955  Susan Neiman born, American philosopher, academic, cultural commentator, and essayist; anti-war activist during the Vietnam War before earning her Ph.D. from Harvard, and studied at the Free University of Berlin.",
    "She's been honored with many awards, including the 1974 Lamont Prize from the Academy of American Poets, the 1991 PEN Oakland/Josephine Miles Literary Award, and the 2009 Fitzgerald Award for Achievement in American Literature.",
    "We now call on Asda to sit down with us to reach agreement on the back pay owed to our members.? The win is the first major stage of the long-running court battle that has implications for workers in all the major supermarkets.",
    "Rhum from Skye'  by Mary Neill Armour\nMarch 27, 1904  Union organizer, hell-raiser' and public speaker Mother' Jones is ordered by Colorado state authorities to leave the state, accused of stirring up? the striking coal miners.",
    "They started the agency when Jerry came home after serving in the U.S. Navy during WWII, and by 1949, they were vying for business with the two biggest modeling agencies in New York, Huntington Hartford and John Robert Powers.",
    "Thousands of retired nurses were being urged by the government to return from retirement to help in the NHS fight against Covid-19, and care homes were desperate to fill vacancies left by workers either self-isolating or sick.",
    "An investigation by Schools Week , an online magazine, found that over 400 testimonies name private schools, but many accounts were from pupils of grammar schools [state-funded selective schools], and state secondary schools.",
    "Minerva Hamilton Hoyt  Joshua Tree National Park\nMarch 27, 1868  Patty Smith Hill born, America composer, teacher and advocate for nursery schools, co-author, with her sister Mildred Hill, of the tune \"Happy Birthday to You.\"",
    "She is best known as the founder in 1865 of Allgemeiner Deutscher Frauenverein in 1865, now called Deutscher Staatsbrgerinnen-Verband (German Association of Women Citizens), the oldest women's rights organization in Germany.",
    "March 26, 1974  Gaura Devi leads a group of 27 women of Reni village of the Garhwal Himalayas, to prevent the cutting of trees; they resort to hugging the trees to protect them and give rise to the Chipko Movement in India.",
    "Cecile Richards of Planned Parenthood, vowed to continue to fight for Arizona women.? The rules never took effect due to two successful challenges in court filed by the Center for Reproductive Rights and Planned Parenthood.",
    "On the title page is a quote from Aristophanes: What do you want a poet for??/ To save the City, of course.? Porter was an open lesbian and in 1993 moved to Melbourne to be with her partner, fellow writer Andrea Goldsmith.",
    "In 2009, she co-founded a production company, Pretty Matches, with Alison Benson, which has produced the TV series Divorce since 2016, and employs more women than men behind the camera, especially as directors and writers.",
    "Her career declined in the 1930s, and she moved to New York City in 1938, then founded Multiprises, a company to make inventions, but designed to rescue Jewish scientists and inventors, helping many escape from the Nazis.",
    "A Department of Health and Social Care spokesperson confirmed it was updating its guidance to help women who need an abortion, but cannot access a clinic because of measures put in place to stem the spread of coronavirus.",
    "March 28, 1977  Lauren Weisberger born, American author; best known for her 2003 bestseller, The Devil Wears Prada, largely based on her 10-month experience as an assistant to Vogue magazine editor-in-chief Anna Wintour.",
    "March 31, 1920  Deborah Cavendish born, Duchess of Devonshire, sister of Nancy and Jessica Mitford; primarily non-fiction author, many of them about the seat of the Dukes of Devonshire, Chatsworth House, and its history.",
    "March 31, 1718  Mariana Victoria of Spain born; married at age 11 to Infante Jos, son of John V of Portugal, who was 15, then became Queen consort of Portugal in 1750 when her husband was crowned as Joseph I of Portugal.",
    "March 30, 1950  Janet Browne born, British science historian, noted for work on 19th century biology and a two-volume biography of Charles Darwin; currently Aramont Professor of History of Science at Harvard University.",
    "The outcome of the landmark case  the biggest-ever equal pay claim in the UK private sector  will have repercussions for about 8,000 workers at other supermarkets also engaged in equal pay disputes with their employers.",
    "March 26, 1941  Lella Lombardi born, Italian Formula One driver, first woman to have a top six finish in a World Championship race, at the 1975 Spanish Grand Prix, and the second woman to qualify for a Formula One race.",
    "Still from musical Love Me Tender'  Karen Bruce\nMarch 25, 1965  Sarah Jessica Parker born, American actress and producer; best known for her Emmy Award-winning role on the television series Sex in the City (1998-2004).",
    "March 30, 1882  Melanie Klein born in Austria, British psychoanalyst in developmental psychology; devised new techniques for working with children, and developed a highly influential training program in psychoanalysis.",
    "She was later blacklisted from the clothing industry for her labor union work, so she joined the Communist Party USA, and founded the Wage Earner's Suffrage League in 1911 to fight for the vote for working-class women.",
    "Rebellious Silence' (1994)  by Shirin Neshat\nMarch 26, 1966  Lillian Greenwood born, British Labour politician; Chair of the Transport Select Committee since 2017; Member of Parliament for Nottingham South since 2010.",
    "Her Pisma iz Nia o haremima (Letters from Ni Regarding Harems), a semi-historical novel about Turkish harems in the early 19th century, was the first Serbian prose book written and published by a Serbian woman author.",
    "The ambiguous relationship between Xena and her traveling companion Gabrielle led to Lawless becoming a lesbian icon, and she is a strong supporter of LGBTQ rights, including her public support for same-sex marriage.",
    "UNESCO committed to supporting gender-transformative learning for 28 million learners in over 80 countries, to closing the digital gender divide, to empower women economically in fields with expanding opportunities.",
    "March 28, 1708  Hannah Glasse born, English cookery author; noted for The Art of Cookery Made Plain and Easy, a bestseller which was originally published anonymously but remained in print well into the 19th century.",
    "Her music was banned by the Chinese government as the work of a hostile foreign force' after she appeared with the Dalai Lama at the 2016 U.S. Conference of Mayors to talk about the power of kindness and compassion.",
    "Despite her exceptional education for a girl from a poor family, and no French laws explicitly barring women from attending university, her applications for admittance were rejected by numerous French universities.",
    "March 26, 1876  Kate Richards O'Hare born, American socialist, editor, orator, and activist; arrested in 1919 and sentenced to 5 years in prison after giving an anti-war speech during WWI; she is pardoned in 1920.",
    "She co-founded both the Community Environmental Council (1974), and the Environmental Defense Center (1977),\nMarch 28, 1919  Eileen Crofton born, British physician and author; known for her anti-smoking campaigns.",
    "March 28, 1959  Laura Chinchilla born, Costa Rican politician; first woman President of Costa Rica (2010-2014); Vice President and Minister of Justice (2006-2008); National Assembly Deputy for San Jos (2002-2006).",
    "When she was offered a position at Wellesley to teach psychology, a new subject for the college's Philosophy Department, she accepted on the contingency that she would be able to study psychology for a year first.",
    "What the whole world experiences now, this is normal life for girls in Qatar.? A spokesperson for the Qatari government responded: Gender equality and female empowerment are central to Qatar's success and vision.",
    "The young birds leave the nest 26-28 days after hatching, but remain with parents, often for 2-3 months, who teach them how to forage, mainly by probing, prying, and excavating in dead wood searching for insects.",
    "It is heartbreaking to see fellow members of the human family in such dire conditions.? Families have been arranging younger and younger child marriages, trying to cope with increasing poverty and food shortages.",
    "March 25, 1881  Mary G. Webb born, English Romantic novelist and poet, most of her work is set in Shropshire, where she was born and grew up; known for Gone to Earth; Precious Bane; and Armour Wherein He Trusted.",
    "Cho Ju-bin, age 25, faces charges of violating the child protection act, the privacy act and the sexual abuse act, as well as abuse, threats, and coercion, after he was identified as the blackmail ring's leader.",
    "She has campaigned for women' rights, against domestic violence, and was a signatory on Amnesty International's letter to Prime Minister David Cameron as part of their campaign for women's rights in Afghanistan.",
    "March 25, 1922  Eileen Ford born as Eileen Ottensoser, American fashion stylist and fashion reporter who built the Ford Modeling Agency with her husband Jerry, one of the earliest international known agencies.",
    "March 29, 1961  Amy Sedaris born, American comedian, writer and playwright; among numerous credits, appeared in the Comedy Central series, Strangers With Candy, and the 2010 movie, The Best and the Brightest.",
    "Georgia appealed the ruling to the 11th U.S Circuit Court of Appeals, where a panel signaled in September, 2021, they were waiting for a ruling from the U.S. Supreme Court on a similar bill from Mississippi.",
    "Beginning in the 1970s, increasing costs, and the refusal of the Arts Council to provide a grant led to the closing of the opera company in 1982, but it was later revived, and mounted productions until 2003.",
    "\"We are deeply sorry for the unintended offensive and hurtful tweets from Tay, which do not represent who we are or what we stand for, nor how we designed Tay,\" wrote Peter Lee, head of Microsoft Research.",
    "One message was from a woman who had locked herself in the bathroom and wrote to ask for help,? said Lella Palladino, from EVA Cooperativa, an activists' group for the prevention of violence against women.",
    "March 31, 1914  Maria Lange born as Dagmar Lange, Swedish crime fiction author, one of the first mystery writers in the Swedish language, whose 40 detective novels helped make the genre popular in Sweden.",
    "Isabella Mulholland, Public Interest Law Centre domestic violence caseworker, said: We are concerned about the disproportionate impact that lockdown measures are having on survivors of domestic violence.",
    "March 27, 1988  Jessie J born as Jessica Ellen Cornish, English singer-songwriter who identifies as a feminist, because being a woman includes \"being confident and not standing down for any ego or suit.\"",
    "In China's Hubei province, heart of the initial coronavirus outbreak, domestic violence reports to police more than tripled in one county alone during February's lockdown, from 47 in 2019 to 162 in 2020.",
    "As many as a million of those workers  who are considered to be at highest risk because they normally work closely with the public and people with diseases and infections  are also among the lowest paid.",
    "She was a founder of the object relations theory, concerning an individual's interaction with others, how those interactions are internalized, and how they affect an individual's psychological framework.",
    "March 30, 1902  Brooke Astor born, American author and philanthropist; noted for her novels, The Bluebird is Home, and The Last Blossom on the Plum Tree; and her memoirs, Patchwork Child, and Footprints.",
    "She was refused admittance to Harvard, which was the closest university to where she lived that offered classes in the subject, in spite of a letter sent by the president of Wellesley pleading her case.",
    "Although Indiana statute law permitted the sterilization of institutionalized persons under certain circumstances, it provided for the right to notice, the opportunity to defend and the right to appeal.",
    "The vast majority (78%) of midwifery leaders who responded to the survey said routine face-to-face antenatal and postnatal visits had ended, with a further 9% restricting face-to-face postnatal visits.",
    "Domestic Abuse Commissioner Nicole Jacobs also said the government must provide support to charities now facing major financial strain which provide lifeline services for victims of domestic violence.",
    "Maria Victoria traveled to Spain in 1777 to meet with her older brother, King Carlos III, and his advisers, continuing her diplomatic mission in spite of severe rheumatism leaving her unable to walk.",
    "Though she was married at age nine to Gopalrao Joshi, a postal clerk who was twenty years older, she was fortunate that her husband believed in education for women, and encouraged her in her studies.",
    "In 2011, she gave an interview on 60 Minutes about being sexually assaulted by Egyptian men in the crowd celebrating Hosni Mubarak's resignation, after someone falsely shouted she was an Israeli Jew.",
    "March 30, 1957  Martina Cole born, British crime novelist, noted for strong women characters and gritty realism; her first book, Dangerous Lady, was made into a highly-rated four-part TV mini-series.",
    "UK ministers have raised this case with the Egyptian authorities.?\n Ruth Michaelson\nMarch 26, 2021  In the UK, shop workers for ASDA Stores Ltd won the latest key stage in their fight for equal pay.",
    "March 26, 1954  Dorothy Porter born, Australian poet; her innovative noir mystery novel written in verse, The Monkey's Mask, was a surprise hit and revitalized the publication of Australian poetry.",
    "March 26, 1907  Mahadevi Verma born, one of the four major Hindi poets of the Chhayavaad Neo-romantic movement in modern Hindi literature, author, illustrator, Indian freedom fighter, and educator.",
    "The correspondence of her fellow members describes her as musically talented, a skilled translator of French and Italian, and also talented at painting, carving, tapestry work, and glass engraving.",
    "Mazumdar was the founding director of the Centre for Women's Development Studies (CWDS), an autonomous organisation established in 1980, under the Indian Council of Social Science Research (ICSSR).",
    "While attending a medical conference at Royaumont, a former Cistercian abbey in France, she found a plaque commemorating a Scottish women's hospital which operated out of the Abbey during the WWI.",
    " 1985(3) for alleged deprivation of Linda Sparkman's civil rights against Ora McFarlin, her attorney, Judge Stump, the doctors who performed the operation, and the hospital where it was performed.",
    "The letter was signed by 30 civil society organizations and lawyers, including Women's Aid, one of the UK's oldest and largest non-profits campaigning to end domestic abuse of women and children.",
    "March 25, 1958  Lorna Brown born, Canadian artist, former director and curator of Artspeak (1999-2004), an artist-run centre in Vancouver, and author of essays, reviews and exhibition catalogs.",
    "After she was diagnosed with CIU (chronic idiopathic urticaria, a severe form of hives), she became the spokesperson for the CUI & You? campaign of the Asthma and Allergy Foundation of America.",
    "She began her career in 1944 as a statistician at the U.S. Bureau of Statistics, and also taught math at the U.S. Department of Agriculture Graduate School, then joined the U.S. Army Air Force.",
    "The drug possession conviction caused her to lose her New York City Cabaret Card, preventing her working anywhere that sold alcohol; thereafter, she performed in concert venues and theaters.",
    "March 27, 1939  Ruth Ashton born, UK midwife and health visit community nurse who became a Royal College of Midwives Senior Tutor, and then served as the RCM's General Secretary (1977-1992).",
    "The purpose of WOW2 is to learn about and honor women of achievement, including many who've been ignored or marginalized in most of the history books, and to mark moments in women's history.",
    "School girls and young women told of being harassed, groped, sexually assaulted, raped at parties and then photos of their naked bodies shared in messaging groups to shame or blackmail them.",
    "The arrest of Strampel, 70, ignited fresh criticism against the school's board of trustees, which for a year resisted calls to investigate Nassar for molesting girls and women for decades.",
    "In 1880, Gopalrao wrote a letter to Royal Wilder, an American missionary, about his wife's interest in studying medicine in the U.S. and inquiring about a suitable post for himself there.",
    "March 31, 1982  Audrey Kawasaki born, Japanese-American artist based in Los Angeles; noted for her paintings of young women, often combining elements from Art Nouveau with Japanese Manga.",
    "Over 44,000 shop workers say they should be paid the same as the predominantly male staff who work in the chain's depots, and who receive 1.50-3 an hour more in pay than the shop workers.",
    "Kathleen Bruce Scott  statue of Robert Falcon Scott\nMarch 27, 1883  Marie Under born, regarded as one of Estonia's greatest poets, nominated for the Nobel Prize in literature eight times.",
    "March 26, 1833  Betsy Perk born, Dutch writer, journalist, suffragist, and pioneer of the Dutch women's movement; she wrote under the pen names Philemon, Liesbeth van Altena, and Spirito.",
    "March 26, 1908  Betty MacDonald born, American humor writer, best known for her humorous memoir, The Egg and I, based on her attempts as a newlywed to run a chicken farm with her husband.",
    "Maria I relied on her mother as an adviser, and Mariana Victoria helped bring about a treaty which ended conflict between Spain and Portugal over territorial possessions in the Americas.",
    "In 1929, she launched the United Council of Working Class Women, which grew to have multiple branches in New York, Philadelphia, Chicago, Detroit, Seattle, San Francisco and Los Angeles.",
    "After her marriage in 1911, she focused on raising a family, but also organized homemakers to protest against high food prices and rents, evictions, and for better housing and schools.",
    "These alarming figures log only cases where women are able to seek help; many cannot make calls because they fear being overheard by abusive partners, or are stopped from leaving home.",
    "March 27, 1963  Xuxa born as Maria da Graa Meneghel, Brazilian actress, television host, singer, and businesswoman; two-time winner of the Latin Grammy Award for Best Children's Album.",
    "The national domestic abuse helpline, run by the charity Refuge, reported a 65% increase in calls to their helpline on Saturday, March 28, compared with the same day the previous week.",
    "March 31, 2014  Federal Judge David C. Bury declined to halt new rules approved by Arizona's legislature to restrict medication-induced abortions in the first seven weeks of pregnancy.",
    "March 31, 1833  Mary Abigail Dodge born, who wrote under the pen name Gail Hamilton, American writer and essayist, noted for promotion of women's equality in education and occupation.",
    "On the 8th through the 10th floors of the building, the doors to the exits and stairwells had been locked by the employers to prevent workers taking unauthorized breaks or stealing.",
    "March 25, 1897  Sweet Emma? Barrett, also called Bell Gal,? born in New Orleans; African-American self-taught jazz pianist and singer with the Original Tuxedo Orchestra (1923-1936).",
    "March 25, 1963  Karen Bruce born, British choreographer and director in theatre and television; won an Olivier Choreography Award for a 2004 London production of Pacific Overtures.",
    "March 31, 2009  International Transgender Day of Visibility is launched by Transgender activist Rachel Crandall of Michigan, now spearheaded by Trans Student Educational Resources.",
    "She made the first records of about 30 plants in Warwickshire, and amassed an extensive collection of minerals, now part of the collection at the Natural History Museum in London.",
    "Principal creator, then director (1972-1991) of the National Energy Software Center at the Argonne National Laboratory, and the first woman fellow of the American Nuclear Society.",
    "March 28, 1959  Chiaki Morosawa born, Japanese anime screenwriter; creator of the fictional universe Cosmic Era.? She died in 2016, at the age of 56, from aortic dissection (AD).",
    "March 29, 1968  Lucy Lawless born as Lucille Ryan, New Zealand actress and singer, best known for playing the title character in the TV series Xena: Warrior Princess (1995-2001).",
    "March 30, 2018  Nobel Peace Prize winner Malala Yousafzai returned to her hometown in Pakistan for the first time since she was shot in the head by the Taliban at the age of 12.",
    "Gill Walton, chief executive of the RCM, said: While other areas of the health service can postpone and cancel procedures, there is still an ongoing need for maternity services.",
    "The court finds that the injunction is not in the public interest,? the judge ruled, while acknowledging that the ruling would make it difficult for some women to get abortions.",
    "Wilder published the letter in his Princeton's Missionary Review, where it was read by Theodicia Carpenter, who wrote to Anandi, the beginning of what became a close friendship.",
    "In 2008, she was the face of an Amnesty International campaign to support human rights, marking the 60th anniversary of the United Nations Universal Declaration of Human Rights.",
    "Shew as widowed in 1623, and became regent for her son Frdric Maurice (1623-1626), and while he served as a general in the French army (1635-1637) during the Franco-Spanish War.",
    "March 31, 1942  Ulla Hoffmann born, Swedish Vnsterpartiet (Left Party) politician; member of the Riksdag (1994-2006); she briefly served as interim leader of her party in 2003.",
    "March 30, 1855  Charlotte Johnson Baker born, first woman physician to practice medicine in San Diego, California; practiced obstetrics and gynecology at St. Joseph's Hospital.",
    "She created an endowment to build a school of nursing at Western Reserve in 1933 after working with the Visiting Nurse Association and seeing the homes of the desperately poor.",
    "She was the first woman in the world to head a national academy of sciences and helped to found the Russian Academy, where she oversaw the compilation of a Russian dictionary.",
    "March 26, 1888  Elsa Brndstrm born, Swedish nurse, philanthropist, and aid worker, known as the Angel of Siberia? by German and Austrian prisoners of war in Russia during WWI.",
    "March 27, 1948  Billie Holiday appears at her sold-out concert at Carnegie Hall, just 11 days after she leaves prison, where she served a sentence for possession of narcotics.",
    "An estimated 1.2 million pregnant and breastfeeding women were already acutely malnourished, and that number would double if humanitarian funding weren't radically increased.",
    "Member of Parliament for Vaishali (1980-1989), the first woman elected to represent this district; member of the All India Women's Council, and active in Upliftment of Women.",
    "March 25, 1921  Dame Mary Douglas born, English anthropologist who was one her era's most influential anthropologists and scholars of classification systems and institutions.",
    "They had been holding on until that time, standing in the windowsills, being crowded by others behind them, the fire pressing closer and closer, the smoke closer and closer.",
    "The Guardian offered the Egyptian authorities the chance to write a letter for publication rebutting its report or the Canadian study, but received no response to the offer.",
    "In the 1960s, she founded the United Council of Aboriginal and Islander Women, and in 1964, she was the first indigenous appointee to the Victorian Aborigines Welfare Board.",
    "Strampel was Michigan State University's dean and supervisor of former USA gymnastics team doctor Larry Nassar, charged with sexually abusing athletes and child pornography.",
    "She is a member of Artists Against Fracking, donated $1 million to the American Red Cross for victims of Hurricane Sandy, and raised over $202 million to fight HIV and AIDS.",
    "In 1962, she was a research assistant in medical epidemiology, and in 1963 she became the county medical officer for the Midlothian branch of the British Red Cross Society.",
    "Her other books, The Servants' Directory, and The Compleat Confectioner, were not as successful, and her dressmaking enterprise after her husband died ran deeply into debt.",
    "Co-author with her brother David Sedaris of the plays Stump the Host, Stitches, One Woman Shoe, Incident at Cobblers Knob, The Little Frieda Mysteries, and The Book of Liz.",
    "This species became rare in eastern North America with the clearing of forests in centuries past, but has gradually increased in numbers again since the early 20th century.",
    "March 31, 1983  Marsha Norman's 'night, Mother premieres in NYC; winner of the 1983 Pulitzer Prize for Drama; the original production ran for 380 performances on Broadway.",
    "The Frances Wisebart Jacobs window at the Colorado State Capitol\nMarch 29, 1852  Ohio makes it illegal for children under 18 and women to work more than a 10-hour workday.",
    "March 28, 1886  Clara Lemlich born, American labor organizer, leader of the Uprising of 20,000, a massive shirtwaist workers strike in New York's garment industry in 1909.",
    "At the same time, the court said concerns about the nuisance created by street prostitution were real, so has upheld the ban on soliciting for the purposes of selling sex.",
    "March 26, 1873  Dorothea Bleek born in South Africa, German anthropologist, philologist, and author; studied the Bush people; Mantis and His Hunter and Bushman Dictionary.",
    "And you will still flirt and paint your nails, dress up and party, because, as I think Emma Goldman said, \"If I can't dance, I don't want to be part of your revolution.\"",
    "_________________________________\nMarch 26, 1577  Countess Elizabeth of Orange-Nassau born, Duchess of Bouillon upon her marriage to in 1594 Henri de La Tour d'Auvergne.",
    "In 2020, she announced that she had been diagnosed with Mnire's disease, which affects the inner ear, causing tinnitus, and can lead to severe dizziness or hearing loss.",
    "\"What I want is for people to support my purpose of education and think about the daughters of Pakistan who need an education,\" she said in an interview during the trip.",
    "March 30, 2020  In the UK, leading healthcare providers welcomed the government's decision to allow women to take abortion pills at home without travelling to a clinic.",
    "Earlier in March, the U.S. Marine Corps announced that it would remove an underwear replacement allowance previously given only to male recruits, Military.com reported.",
    "Suzanne Collin's trilogy of novels sold 15 million print books and 12.7 million e-books in 2017, after selling a total of 13.5 million copies in the previous two years.",
    "In 1844, she earned a teacher's certificate of ability, and studied zoology at the Museum of Natural History in Paris with the naturalist tienne Geoffroy Saint-Hilaire.",
    "Gloria Swanson as Norma Desmond, and on the screen as Sadie Thompson\nMarch 27, 1902  Mary Neill Armour born, Scottish landscape and still life painter, and art teacher.",
    "She was first recorded in 1956, when she and her father met folksinger Paul Clayton, who, impressed by her playing, used a tape recording of her playing several songs.",
    "There is more desperation as women can't go out.? It happens in all crisis situations,? said Marcy Hersh, a senior manager for humanitarian advocacy at Women Deliver.",
    "She was the first head-mistress of Allahabad (Prayag) Mahila Vidyapeeth in 1933, a private Hindi cultural and literary school for girls, and was later its chancellor.",
    "Elsie MacGill was the first Canadian woman to earn a bachelor's degree in engineering, and the first woman in the world to earn a degree in aeronautical engineering.",
    "We think there has been a rise of 40% or 50%, and there was already really big demand,? said Adriana Mello, a Rio de Janeiro judge specialising in domestic violence.",
    "March 30, 1979  Norah Jones born, American singer-songwriter; she has won a total of 9 Grammy Awards, including five Grammys in 2003 for her album Come Away With Me.",
    "After working at ABC-5 (1992-1997), she has been at ABS-CBN, heading a public service campaign against child abuse, and anchoring the news program The World Tonight.",
    "March 31, 1936  Marge Piercy born, American poet, novelist, anthology editor and social activist; associate of the Women's Institute for Freedom of the Press (WIFP).",
    "She served as Regent of Portugal from 1776 until Joseph's death in 1777, when the eldest of their four daughters became Maria I, the first queen regnant of Portugal.",
    "March 28, 1971  Christianne Meneses Jacobs born, Nicaraguan writer, publisher, editor, and bi-lingual teacher; her family came to America when she was 17 years old.",
    "In the 1950s Butler wrote software, reactor applications, mathematical subroutines, and utilities for three other Argonne computers, the ORACLE, GEORGE, and UNIVAC.",
    "However, she disagreed his associating of purity with the sacred? and impurity with the profane,? which she questioned concerning the busy scrubbings? of housework.",
    "March 25, 1932  Penelope Gilliatt born, British author, screenwriter, and critic; won an Oscar for Best Original Screenplay for the 1971 film, Sunday Bloody Sunday.",
    "In 2016, she wrote A Mother's Reckoning about Columbine, and has donated all the profits from the book to mental health charities, research, and suicide prevention.",
    "March 25, 1760  Louisa Finch born, Countess of Aylesford, English naturalist and botanical illustrator, noted for studies and paintings of plants, algae, and fungi.",
    "The next day a tubal ligation was performed on her by Dr. John H. Hines, M.D., assisted by Dr. Harry M. Covell, M.D., and anesthesiologist Dr. John C. Harvey, M.D.",
    "Five of her solos were used on Instrumental Music of the Southern Appalachians, one of the first commercially released recordings of African American banjo music.",
    "Self-Portait'  Mary Beale\nMarch 26, 1819  Louise Otto-Peters born, German women's and human rights activist, suffragist, essayist, novelist, journalist, and poet.",
    "March 26, 1949  Vicki Lawrence born, American comedian, actress, and singer; best known for the many characters she played on The Carol Burnett Show (1967-1978).",
    "Prostitution itself is not illegal in Canada, but communicating for the purposes of prostitution, pimping, and operating a brothel were considered criminal acts.",
    "In 1944, the USSR reoccupied Estonia, and Under fled with her family to Sweden, where they spent a year in a refugee camp before moving to a suburb of Stockholm.",
    "She is an activist for the education of young children in Brazil's poorest communities, and an end of exploitation and violence against children and adolescents.",
    "She went bankrupt in 1754 and was forced to sell the copyright of The Art of Cookery to a booksellers' syndicate, which held the rights for the next fifty years.",
    "March 28, 1912  Marina Raskova born, Russian navigator, instrumental in the formation of combat regiments of women who were pilots, support staff, and engineers.",
    "A boycott of butcher shops to protest high meat prices spread nation-wide, and won support outside the Jewish and African-American communities where it started.",
    "What we worry about is just as rates of violence are on the rise, the accessibility of services and the ability of women to access these services will decrease.",
    "UN Women Executive Director Phumzile Mlambo-Ngcuka said, We want to look to the future beyond the crisis, rather than doubling down on the mistakes of the past.",
    "Some were forced to carve the word slave? on their bodies and pose in a way that would prove to chatroom users that they belonged? to Cho, according to reports.",
    "March 29, 1993  Catherine Callbeck becomes Premier of Prince Edward Island, the first woman to win a general election for a premiership of a Canadian province.",
    "After the devastating Lisbon earthquake of 1755 killed 100,000 people, her husband became extremely claustrophobic, and took less interest in affairs of state.",
    "After a three-day visit to Yemen, UNFPA Executive Director Dr. Natalia Kanem declared, I've been in many maternity wards, and they are usually a place of joy.",
    "He then allegedly threatened to reveal the women's identities unless they sent clips of themselves performing sexual acts, including those involving violence.",
    "She is the mother of Dylan Klebold, one of the shooters in the Columbine High School massacre in April, 1990, in which 12 students and a teacher were killed.",
    "She published her memoir, Nostalgia Isn't What It Used To Be, in 1978, and a novel, Adieu Volodya, in 1985, the year she died of pancreatic cancer at age 64.",
    "She considered these did not merely establish hygienic conditions but went further to establish order with rules of behaviours; rituals bind people together.",
    "Judge Bury claimed the new regulations would not put an undue burden? on women seeking abortions because they still have a surgical option available to them.",
    "Women interviewed for the report described how their guardians denied them permission to drive, travel, study, work, or marry someone of their own choosing.",
    "Neither the petition nor the order was filed with the clerk of the circuit court, nor did the order cite any statutory authority for the action being taken.",
    "March 29, 1940  Astrud Gilberto born, Brazilian samba and bossa nova singer-songwriter; honored with the Latin Jazz Award for Lifetime Achievement in 1992.",
    "There are so many more phenomenal women than I ever dreamed of finding, and all too often their stories are almost unknown, even to feminists and scholars.",
    "After he died in 1634, she declined marriage proposals from poet-composer Constantijn Huygens and polymath Caspar Balaeus, both members of the Muiderkring.",
    "March 26, 1944  Diana Ross born, American singer, record producer and actress, founding member of The Supremes, inductee of the Rock and Roll Hall of Fame.",
    "Linda Spitler Sparkman\nMarch 28, 1986  Lady Gaga born as Stefani Germanotta, American singer-songwriter, one of the best-selling music artists in history.",
    "March 30, 1957  Marie-Christine Kounja born, Chadian diplomat and first published Chadian woman author; First Secretary at the Chadian Embassy in Nigeria.",
    "March 30, 2006  American reporter Jill Carroll, a freelancer for The Christian Science Monitor, is released after an 82-day ordeal as a hostage in Iraq.",
    "March 28, 1927  Marianne Fredriksson born, Swedish author and journalist; noted for The Book of Eve; Simon and the Oaks and According to Mary Magdalene.",
    "In 1917, she was forcibly removed from her mother, and sent to the Cootamundra Domestic Training Home for Aboriginal Girls, where she was badly treated.",
    "She also exhibited with the Royal Society of Painters in Watercolour, the Scottish Society of Artists, and the Royal Glasgow Institute of the Fine Arts.",
    "The court said prostitutes should be allowed to work more safely indoors, and gave the Ontario government one year to rewrite the law if it chooses to.",
    "March 25, 2012  The Hunger Games takes in $155 million at the U.S. box office its opening weekend, a record opening for the first film in a new series.",
    "But in Yemen, I witnessed the devastation of malnutrition and hunger, with newborn babies on feeding tubes and mothers weakened by fear and exhaustion.",
    "Four medical students came forward to say Strampel, who led the university's medical school from 2002 to 2017, had sexually assaulted or harassed them.",
    "The Court of Appeals found no basis in statutory or common law for a court to order the sterilization of a minor child simply upon a parent's petition.",
    "Elvira Pablo of the Generation Equality Youth Task Force put it bluntly: \"We youth are tired of hearing words and commitments without immediate action.",
    "Caputova campaigned to end corruption in Slovakia, where a journalist who investigated high profile fraud cases and his fianc were murdered last year.",
    "March 27, 1911  Veronika Tushnova born, Soviet poet and member of the Soviet Union of Writers, who became a medical doctor at her father's insistence.",
    "March 28, 1904  Isabel Cuch Coll born, journalist and author, director of the \"Sociedad de Autores Puertorriqueos\" (Society of Puerto Rican Authors).",
    "March 31, 1950  Sandra Morgen born, American feminist anthropologist; director of the University of Oregon Center for the Study of Women in Society.",
    "Tushnova published her first works in 1944 and 1945, but is noted for her later collections, Memory of the Heart and One Hundred Hours of Happiness.",
    "March 27, 1922  Meg Stacey born, sociologist, pioneer in study of gendered social divisions, University of Warwick Women's Studies Department Chair.",
    "She founded the D'Oyly Carte Charitable Trust in 1972 to support charitable causes in the fields of the arts, medical welfare, and the environment.",
    "She is an active supporter and fundraiser for Children in Need and the UK charity Believe in Magic, which grants wishes to terminally ill children.",
    "She co-founded Women of All Red Nations (WARN) in 1974, and the first convening of the Indigenous Women's Network was held in her backyard in 1985.",
    "Beginning in April, 2021, the Swiss Army said women will be issued two sets of female underwear  one for warmer months, and one for colder months.",
    "THIS WEEK IN THE WAR ON WOMEN\nis up, so be sure to go there next, and\n catch up on the latest dispatches from the frontlines:\nwww.dailykos.com/...",
    "She was a second-generation feminist, the daughter of Helen Gregory McGill, noted women's rights advocate and one of Canada's first women judges.",
    "Her untitled manuscript describing the flora of the New York area contains 340 ink drawings of different species compiled between 1753 and 1758.",
    "The change is limited to two years, or until the coronavirus crisis is over, and applies to medical abortions up to the tenth week of pregnancy.",
    "She worked to establish the first support groups in Britain for women cancer patients - profiled in a television documentary Alive and Kicking.",
    "Armour exhibited regularly at the Royal Academy in London and the Royal Scottish Academy in Edinburgh, where she won the Guthrie Prize in 1937.",
    "March 27, 1899  Gloria Swanson born, American silent film star, who also produced her films The Love of Sunya (1927) and Sadie Thompson (1928).",
    "March 26, 1824  Julie-Victoire Daubi born, French feminist, author, scholar, and journalist; first woman to graduate from a French university.",
    "Returning to India, the princely state of Kolapur appointed her as physician-in-charge of the female ward of the local Albert Edward Hospital.",
    "She was awarded the Jane Addams Medal for Distinguished Service in 1954 and the Ordre national de la Lgion d'honneur (French Legion of Honor).",
    "Her victory runs counter to trends in Europe, which has seen populist, Euro-skeptic parties increasingly make gains throughout the continent.",
    "March 31, 1929  Liz Claiborne born in Belgium, American fashion designer, the first woman to found and serve as CEO of a Fortune 500 company.",
    "March 26, 1981  Anas Mitchell born, American singer-songwriter and playwright; known for Hadestown, winner of the 2019 Tony for Best Musical.",
    "March 26, 1992  Former heavyweight boxing champion Mike Tyson is sentenced to six years in prison for raping a Miss Black America contestant.",
    "Only 50% of the country's healthcare facilities were functioning, and only 20% of those could provide any maternal or child health services.",
    "Their report says that women must get permission from male guardians  fathers, brothers, uncles, or husbands  to exercise many basic rights.",
    "In 1973, she and her husband, a professor of tuberculosis and lung disease, were founding members of ASH Scotland, an anti-smoking charity.",
    "She painted over 2,800 botanical watercolours for correspondence with botanists like Englishman William Withering and the Scot George Don.",
    "March 26, 1957 Shirin Neshat born, Iranian visual artist based in New York City; known primarily for work in film, video, and photography.",
    "She researched the story, and published a book on the hospital called Angels of Mercy: A Woman's Hospital on the Western Front 1914-1918.",
    "After two years of training in white domestic practices, in 1919 she was sent to work for a white family in Sydney, where she was abused.",
    "So if laws are changed, the government don't inform women and when they introduce restrictions they don't tell them that clearly, either.",
    "March 30, 1863  Mary Whiton Calkins born, philosopher and psychologist, first woman president of the American Psychological Association.",
    "March 28, 1911  Myfanwy Piper born, Welsh art critic and opera librettist who worked with composers Benjamin Britten and Alun Hoddinott.",
    "), a Spanish language children's magazine featuring pop culture and young Latinos making a difference in society, which debuted in 2008.",
    "Winner of two Olivier Awards for Best Costume Design in 1995 and 2005, and a BAFTA Award for her costumes for the 1997 movie Mrs. Brown.",
    "After graduation, she continued to write about the conditions faced by women, and set up an embroidery shop, which was run by her niece.",
    "She won the Fawcett Prize as co-author of Women, Power And Politics (1981), and was active in Women in Black, a peace workers' movement.",
    "A Guardian spokesperson said, The Guardian is a global news organisation that strives to report with clarity and integrity at all times.",
    "March 25, 1949  Lillian Elaine Fishburne born, first African American woman to hold the rank of Rear Admiral in the United States Navy.",
    "March 29, 1964  Catherine Cortez Masto born, American attorney and Democratic politician; became the first woman and first Latina U.S.",
    "In 11 cases, midwife-led maternity units had closed in order to increase facilities for assessing or caring for coronavirus patients.",
    "Women will be sent the two pills required for an early termination in the post following a telephone or e-consultation with a doctor.",
    "The Catalan regional government in Spain said that calls to its helpline rose by 20% in the first few days of the confinement period.",
    "In the 1980s, she was elected an honorary president of the Glasgow School of Art and of the Royal Glasgow Institute of the Fine Arts.",
    "In 1861, she was the first woman to present herself at the baccalaureate exams, and became the first female baccalaureate in France.",
    "In January, 2020, the government had lifted the requirement that women must have a guardian's permission to obtain driving licences.",
    "In July, 2020, U.S. District Court Judge Steve Jones ruled the law could not take effect because it violates the U.S. Constitution.",
    "In the 1930s, she began campaigning for Indigenous rights, and in 1932, was a founding member of the Australian Aborigines' League.",
    "March 26, 2012  In Canada, Ontario's court of appeal ruled that a ban on brothels puts prostitutes at risk and is unconstitutional.",
    "Siruru was founded in 1917, an expressionistic and neo-romantic movement that ran counter to the Young Estonia formalist tradition.",
    "March 27, 1734  Lady Diana Beauclerk born, English artist, illustrator, and designer of bas-reliefs for Josiah Wedgwood's company.",
    "The Rijksmuseum Amsterdam has a rmer drinking glass she engraved with the motto Sic Soleo Amicos (this is how I treat my friends).",
    "One alleged victim said she \"was not surprised Nassar had been able to victimize so many women under the supervision of Strampel.\"",
    "She also set up the first women's psychology lab there, and developed the paired-associate procedure for studying verbal memories.",
    "March 31, 1776  Abigail Adams writes to her husband John, who is helping to frame the Declaration of Independence, and cautions: .",
    "Nest site is a cavity in a dead tree or in dead branch of a live tree, more rarely in a utility pole, usually 15-80' above ground.",
    "She was only fourteen when she lost her first baby because of the lack of medical care, which inspired her to become a physician.",
    "March 28, 1970  Jennifer Weiner born, American screenwriter, television producer, humorist, and novelist; noted for In Her Shoes.",
    "She was one of the actresses who were the first nominees in 1929 for an Academy Award for Best Actress, but lost to Janet Gaynor.",
    "She was one of the celebrities in a video from the United Nations refugee agency to raise awareness of the global refugee crisis.",
    "The study found that out of 3.2 million workers employed in the jobs determined to be highest-risk, about 2.5 million are women.",
    "Sims retired from modeling in 1973, and started a successful wig business, expanded it into a multimillion-dollar beauty empire.",
    "Even as her health deteriorated, she continued to campaign for improved services, lobbying Parliament and speaking at meetings.",
    "Female Conditions and Resources,? detailing professional and academic exclusion for women, wage inequality, and other travails.",
    "In 1967, she suffered a stroke that paralyzed her left side, but she continued to play music until her death at age 85 in 1983.",
    "March 25, 1911  In New York City, the Triangle Shirtwaist Factory fire kills 146 garment workers, 123 of them women and girls.",
    "Signoret was never concerned with glamour, ignored sexist and ageist insults, and continued giving finely etched performances.",
    "She has campaigned for No Kid Hungry, and took part in an awareness campaign for COPD (chronic obstructive pulmonary disease).",
    "March 27, 1770  Sophie Schubart Mereau born, German novelist, short story writer, and poet associated with German Romanticism.",
    "The supreme court backed the 2016 employment tribunal ruling, which was also previously upheld by the court of appeal in 2019.",
    "After their father's death when she was a toddler, her brother helped her study Latin, Greek, German, history, and geography.",
    "Rose Caldwell, head of Plan International UK, said: School, college and university should be a safe space for girls to learn.",
    "Anna Freud's influence remained largely predominant in the U.S., while some British analysts were more open to Klein's ideas.",
    "March 29, 1936  Judith Guest born, American novelist and screenwriter; Ordinary People, Second Heaven, and The Tarnished Eye.",
    "March 27, 2018  William Strampel was charged with criminal sexual misconduct and other crimes, after four women came forward.",
    "In 1970, she led a successful voter campaign to defeat a proposal to build 1,535 condos on the Gaviota Coast of California.",
    "She taught midwifery at the University of West London, and lectured on the social anthropology of birth and breastfeeding.",
    "The company took the bot offline the day after its launch, due to its xenophobic, sexist, and racist comments on Twitter.",
    "March 25, 2016  Microsoft apologized for offensive comments made by Tay, the company's artificially intelligent chatbot.",
    "March 25, 1925  Flannery O'Connor born, American Southern and Roman Catholic novelist, short story writer, and essayist.",
    "In 1963, she was recorded both singing and playing piano on her second album, The Bell Gal and Her Dixieland Boys Music.",
    "She appeared briefly singing and playing piano with the Preservation Hall Jazz Band in the 1965 film The Cincinnati Kid.",
    "These laws exist in a nefarious way and women have to base decisions on an assumption that they must be obedient to men.",
    "We want an opportunity to build a new, feminist economic model that works for women, and a world that is safe for women.",
    "In Italy activists said calls to helplines dropped sharply, but they were receiving desperate text messages and emails.",
    "The Thorborns, an American couple who were doctors, suggested she apply to the Woman's Medical College of Pennsylvania.",
    "March 25, 1985  Natalia Anciso born, American Chicana-Tejana contemporary artist noted for visual and installation art.",
    "The D'Oyly Carte Opera Company controlled the copyrights to the Gilbert and Sullivan works until they expired in 1961.",
    "Any remaining mistakes are either mine, or uncaught computer glitches in transferring the data from his emails to DK5.",
    "It is unacceptable for the government to simply point to a general fund which has been allocated to all those in need.",
    "Calkins was interested in a wide variety of research topics, including perception, personality, emotion, and dreaming.",
    "Now 20, Yousafzai had not visited Mingora or anywhere in Pakistan since her family moved to Britain after her attack.",
    "Other restrictive measures were passed in 2015 and 2016, but the Arizona legislature repealed those measures in 2016.",
    "March 31, 1865  Anandibai Anandi' Gopal Joshi born, the first Indian woman to become a doctor of Western medicineian.",
    "In 2018, Pretty Matches produced the film Here and Now, from a screenplay by Laura Eason, with music by Amie Doherty.",
    "However, the case was widely reported in the newspapers, and brought more attention to the woman's suffrage campaign.",
    "In Purity and Danger (1966), she made a cross-cultural study of ritual systems of cleanliness, pollution, and taboo.",
    "While working on a biography of James Blaine, she had a stroke, leaving her in a coma that lasted for several weeks.",
    "and Slow Motion: Changing Masculinities, Changing Men; member of the Virago (publishing) Advisory Board (1984-1993).",
    "She is the author of Costume since 1945: Couture, street style and anti-fashion, and co-author of Colonial America.",
    "And at last you'll know with surpassing certainty that only one thing is more frightening than speaking your truth.",
    "And that is not speaking.?  Audre Lorde\nWOW2 is a four-times-a-month sister blog to This Week in the War on Women.",
    "Under was involved in the influential Siruru literary movement, named after a fire-bird in Finno-Ugrian mythology.",
    "In 1883, Anandi travelled to New York by ship, chaperoned by two Englishwomen missionaries known by the Thorborns.",
    "She wrote Woman's Wrongs: A Counter-irritant (1868), and A Battle of the Books (1870), among several other titles.",
    "This pandemic has exposed deep inequalities at the heart of our economy,? said Will Stronge, director of Autonomy.",
    "Rothna Begum, women's rights researcher at HRW, said, The government in Qatar don't want women to know the rules.",
    "Anandi began to have health problems, and Gopalrao decided to send her to America on her own as soon as possible.",
    "During WWII, she called for desegregation of military nursing units, which helped remove color lines in nursing.",
    "The Indian Government conferred the Padma Vibhushan on her in 1998, the nation's second-highest civilian award.",
    "We have offered the Egyptian government opportunity to comment and respond to our reporting in the normal way.",
    "Women cannot be primary carers of their children, even if they are divorced or the children's father has died.",
    "More than a fifth  22%  of survey respondents also reported that local midwife-led maternity units had closed.",
    "March 28, 2013  Pope Francis becomes the first Pope to wash the feet of women in the Maundy Thursday service.",
    "I wanted to create a safe, permanent platform for survivors to share their stories without any repercussions.",
    "Mariana Victoria went through eight pregnancies, but four of them were stillbirths, including all their sons.",
    "March 25, 1925  Kishori Sinha born, Indian politician, social activist, and advocate for women's empowerment.",
    "From the late 1950s to early 1960s she led Argonne's Applied Mathematics Division's Application Programming.",
    "She wrote books on modeling, beauty, and health, including Beauty for the Black Woman; and All About Health.",
    "In 1945, Dean was one of the advisors to the American delegation during the founding of the United Nations.",
    "March 25, 1949  Sue Klebold born, American author, mental health advocate, and suicide prevention activist.",
    "And you will find you have fallen in love with your own vision, which you may never have realized you had.",
    "March 27, 1905  Elsie MacGill born, Canadian aeronautical engineer, world's first woman aircraft designer.",
    "Women are often asked to have permission from a male guardian even if it's not written in the regulations.",
    "The Human Rights Watch report inaccurately portrays Qatar's laws, policies and practices related to women.",
    "Astor was also a major supporter of the New York Public Library and the Animal Medical Center in New York.",
    "The Sparkmans appealed to the U.S. Court of Appeals for the Seventh Circuit, which reversed the dismissal.",
    "she wrote liberal opinions on employment discrimination, environmental protection, and the death penalty.",
    "When she was diagnosed in 1994 with advanced breast cancer, it had already spread to her bones and liver.",
    "March 25, 1977  Natalie Clein born, British classical cellist who also works with contemporary composers.",
    "The Swiss hope to increase the percentage of women in their ranks from 1% to 10% within the next decade.",
    "March 29, 2019  Legislators in Georgia pass a bill to ban abortion after a fetal heartbeat? is detected.",
    "She is noted for her research on dreams and memory, while she was teaching at Wellesley for forty years.",
    "The Aborigines Protection Board intervened, and she was given another placement from which she ran away.",
    "Georgia is one of 11 states that introduced \"heartbeat bills\" in 2019; the legislation narrowly passed.",
    "She is also known for her novel, Wise Blood, and her collection, Mystery and Manners: Occasional Prose.",
    "Between 1967 and 1970, she was a commissioner on the Royal Commission on the Status of Women in Canada.",
    "March 27, 1924  Margaret K. Butler born, American mathematician and early computer software programmer.",
    "She won the 1972 National Book Award for Fiction for her short story collection, The Complete Stories.",
    "March 31, 1938  Sheila Dikshit born, Indian politician, served as Chief Minister of Delhi (19982013).",
    "March 31, 1988  ** Toni Morrison is awarded the Pulitzer Prize for Literature for her novel Beloved.",
    "Egyptian officials demanded the story be retracted or that the Guardian publish an official apology.",
    "March 26, 1942  Erica Jong born, American author and poet; best known for her novel, Fear of Flying.",
    "She has also traveled to Ethiopia on behalf of Comic Relief, and to South Sudan on behalf of Oxfam.",
    "At age 27, she was diagnosed with lupus, the same disease that had caused her father's early death.",
    "March 31, 1943  Deirdre Clancy born, British costume designer for theatre, ballet, opera, and film.",
    "She shared her knowledge with famous musicians like Bob Dylan, Taj Mahal, and Kenny Wayne Shepherd.",
    "The defence minister, Viola Amherd, welcomed the move, saying compatibility? needed to be improved.",
    "She wrote her novel, Jan Vedder's Wife, in 1885, which was followed by over two dozen more novels.",
    "Noted for her memoir Slow Fire: Jewish Notes from Berlin, and The Unity of Reason: Rereading Kant.",
    "Linda Sparkman also asserted pendent state claims for assault and battery and medical malpractice.",
    "Almost a third (32%) stopped offering home births, and a further 4% limited the home birth option.",
    "She has been the artistic director of the Purbeck International Chamber Music Festival since 2009.",
    "She worked in assistance services for the disabled for many years before the Columbine massacre.",
    "March 28, 1904  Margaret Lilardia Tucker born, pioneering Australian Aboriginal rights activist.",
    "Republican Governor Brian Kemp signed the bill in May, 2019, to go into effect January 1, 2020.",
    "March is National Women's History Month\n How many of these trailblazing women do you recognise?",
    "These trailblazers have a lot to teach us about persistence in the face of overwhelming odds.",
    "In her later years, due to poor health, she turned to writing historical novels and painting.",
    "The accounts mentioned in the report are not aligned with our constitution, laws or policies.",
    "After graduation from Smith College, she worked in the Greek department of Wellesley College.",
    "They have been issuing loose-fitting men's underwear, often in larger sizes? to all recruits.",
    "Caputova, who has been called a liberal, said she views her election as a signal for change.",
    "Failing to become pregnant, she learned from Dr. Hines in 1975 that she had been sterilized.",
    "In 1859, the Imperial Academy of Science and Fine Letters of Lyon held an essay competition.",
    "Cabinet as Secretary of Labor, was a witness: People had just begun to jump as we got there.",
    "She had a steady job in the 1940s and 50s at the Happy Landing club in Pecaniere, Louisiana.",
    "She also began to get bit parts in films, but first attracted attention in La Ronde in 1950.",
    "The Korea Herald said the Cho case proved sexual crime penalties needed to be strengthened.",
    "A lower court judge ruled in 2010 that the prostitution-related laws were unconstitutional.",
    "They were coincidentally both shortlisted for the 2003 Miles Franklin Award for literature.",
    "In this instance we reported on scientific findings by credible infectious disease experts.",
    "On July 15, Linda Spitler entered DeKalb Memorial Hospital, just four blocks from her home.",
    "Judge Stump signed the requested order ex parte the same day that he received the petition.",
    "Bridget D'Oyly Carte never married, so the D'Oyly Carte line ended with her death in 1985.",
    "She worked in military hospitals during WWII, but found little satisfaction in medicine.",
    "The Egyptian government's official count for that time period was three infected people.",
    "If the child has no male relative to act as guardian, the government takes on this role.",
    "Calkins returned to Wellesley in 1891 and began her work as an instructor of psychology.",
    "Where unmolested, they even live in parks and woodlots around the edges of large cities.",
    "By the time she returned to Portugal in 1778, she was also suffering from heart disease.",
    "Her family heritage was a mix of African-American, Native American, and mixed European.",
    "Leo Sparkman asserted a pendent claim under state law for loss of potential fatherhood.",
    "She left Egypt on a flight ferrying stranded tourists and foreign nationals to Germany.",
    "Virginia Minor testified in support of women's suffrage before the U.S. Senate in 1889.",
    "No guardian ad litem was appointed to represent her interest, and no hearing was held.",
    "March 29, 1971  Lara Logan born, South African media journalist and war correspondent.",
    "Incubation is by both sexes (male incubating at night and part of day), about 18 days.",
    "She worked for racial equality and equal pay, but not for the Equal Rights Amendment.",
    "She got her nickname because she sold mussels (Kaat Mossel/Cate Mussel) in Rotterdam.",
    "But often the girls were then worse off, facing domestic violence as well as hunger.",
    "Since 2004 she has been an independent curator for public art and research projects.",
    "Environmental lawyer and government critic Zuzana Caputova won with 58% of the vote.",
    "But in 1887, only a few months after her return, she died of tuberculosis at age 21.",
    "remember the ladies, and be more generous and favorable to them than your ancestors.",
    "The case was filed in the U.S. District Court for the Northern District of Indiana.",
    "She is a vocal critic of gender bias in both the publishing industry and the media.",
    "By 1966, they were booking 70% of the modeling jobs in New York, and 30% worldwide.",
    "Michaelson was the last full-time British newspaper correspondent working in Egypt.",
    "Even women who had jobs were usually working for about half the wages paid to men.",
    "She died of complications from diabetes and high blood pressure at age 69 in 2003.",
    "For too long, they have been caught up in a conflict that is not of their making.",
    "March 29, 2014  The first same-sex marriages are performed in England and Wales.",
    "March 31, 1935  Judith Rossner born, American novelist; Looking for Mr. Goodbar.",
    "They generally make a new cavity each year, with both sexes helping to excavate.",
    "The Swiss army is not the only military correcting policies that gender biased.",
    "After Joseph suffered a series of strokes, he named his wife to take his place.",
    "Kemp and state Republicans were vocal in their support for gutting Roe v. Wade.",
    "Author of The Good Birth Guide, The Politics of Birth, and Rediscovering Birth.",
    "Indiana repealed all laws concerning sterilization of the mentally ill in 1974.",
    "She organized and led orangist riots in 1784 against the patriots in Rotterdam.",
    "One of her main findings was that repeated pairings of words increased memory.",
    "March 31, 1913  Etta Baker born, American singer and Piedmont blues guitarist.",
    "Porter died after a four-year battle with breast cancer, at age 54, in 2008.",
    "She was previously the chair of the California Democratic Party (1981-1983).",
    "I hope you will find reclaiming our past as much of an inspiration as I do.",
    "And you will lose some friends and lovers, and realize you don't miss them.",
    "This edition covers trailblazing women and events from March 24 through 31.",
    "She married Lee Baker, a piano player, in 1936, and they had nine children.",
    "When her speech was publicized, contributions came in from all over India.",
    "The window was too crowded and they would jump and they hit the sidewalk.",
    "Frances Perkins, who would become the first woman appointed to the U.S.",
    "Daubi wrote a nearly-300-page work, The Poor Woman in the 19th Century.",
    "She was also one of the founders of the Estonian Writers' Union (1922).",
    "Logan was Chief Foreign Affairs Correspondent for CBS News (2006-2018).",
    "March 31, 1950  Alison McCartney born, British ophthalmic pathologist.",
    "She also edited three literary journals, and was a notable translator.",
    "She began playing when she was three years old, taught by her father.",
    "Qatar is an outspoken advocate for women's rights at home and abroad.",
    "Senator from Nevada in 2017; Attorney General of Nevada (2007-2015).",
    "She is now considered one of the most influential LGBTQ Australians.",
    "She had a special interest in the rights of minorities and the poor.",
    "She gave birth to nine children, six of whom survived to adulthood.",
    "Many, many thanks to libera nos, intrepid Assistant Editor of WOW2.",
    "Her autobiography, All the Days of My Life, was published in 1913.",
    "March 28, 1944  Astrid Lindgren begins writing Pippi Longstocking.",
    "During WWII, she joined the Royal Army Medical Corps as a Captain.",
    "Crofton was awarded an MBE for services in public health in 1984.",
    "She was one of the first highly successful black American models.",
    "Eileen Ford also published two books of modeling and beauty tips.",
    "In 1871, at Lyon, she became the first woman literature graduate.",
    "She also wrote the Mrs. Piggle-Wiggle series of children's books.",
    "Several of her works are now included in the Hindi core syllabus.",
    "The essay took first prize, and the academy gave her admittance.",
    "Her poem They don't renounce loving became the lyrics of a song.",
    "They will interrupt you, put you down and suggest it's personal.",
    "She made her recording debut with an instrumental album in 1961.",
    "Theodicia Carpenter welcomed her, and Anandi stayed in her home.",
    "Do not put such unlimited power into the hands of the Husbands.",
    "I don't want any favor, or I don't want everyone to accept me.",
    "In the 1960s, she played with the Preservation Hall Jazz Band.",
    "She published her autobiography, If Everybody Cared, in 1977.",
    "It contained the first known curry recipe written in English.",
    "All I care about is that they accept education as an issue.\"",
    "She developed tuberculosis, but still graduated with an M.D.",
    "In social anthropology, she was influenced by mile Durkheim.",
    "The next WOW2 edition will post\n on Saturday, April 2, 2022.",
    "In 1925, the Board released her and she moved to Melbourne.",
    "We urge you to oppose every such effort in your own State.",
    "March 30, 2019  Slovakia elects its first woman president.",
    "The climate did was too cold, and the food was unfamiliar.",
    "It also serves as a reference archive of women's history.",
    "In 1623, she married a ship's officer, Allard Crombalch.",
    "The Sparkmans brought action for damages under 42 U.S.C.",
    "She was told that she was to have her appendix removed.",
    "She died just before her 46th birthday, in March, 1996.",
    "Her work as been translated into at least 26 languages.",
    "We have urged Egypt to guarantee freedom of expression.",
    "And much thanks to wow2lib, WOW2's Librarian Emeritus.",
    "For sure there is an overwhelming emergency right now.",
    "Girls are [constantly] in quarantine,? said one woman.",
    "She died of a cerebral hemorrhage at age 63, in 1896.",
    "She continued studying while working as a governess.",
    "Her family was poor, and there were eight children.",
    "They lived in Chicago briefly, then moved to Texas.",
    "She died of breast cancer in 2009 at the age of 61.",
    "She served as the charity's first medical director.",
    "Her original seat was then filled by a Republican.",
    "Both parents feed the nestlings, by regurgitation.",
    "On March 17, her press accreditation was revoked.",
    "Once you start to speak, people will yell at you.",
    "Remember all Men would be tyrants if they could.",
    "89% of nurses and 84% of care workers are women.",
    "She was not allowed to be a registered student.",
    "The U.S. Supreme Court overturned the decision.",
    "She dropped out of school after the 10th grade.",
    "Since 1997, she has performed only in concert.",
    "Caputova said the crime sparked her candidacy.",
    "But no, they happen everywhere, all the time.",
    "Honored as Grand Empress Dowager Xiaozhuang.",
    "In 1973, Linda Spitler married Leo Sparkman.",
    "She is an ardent advocate for animal rights.",
    "And the speaking will get easier and easier.",
    "And new ones will find you and cherish you.",
    "She also coined the name Yorkshire pudding.",
    "Spielman's pleas were ignored by ministers.",
    "They want men to have power and control.",
    "She died there in 1980 at the age of 97.",
    "Her death was mourned throughout India.",
    "Author of Memories of a Rolling Stone.",
    "Everard was reported missing March 3.",
    "She died at age 50 of tuberculosis.",
    "They are starred ** below in WOW2.",
    "She died at the age of 91 in 2010.",
    "The daughter had no notice of it.",
    "Baker died of a stroke at age 93.",
    "GEF was launched by UN Women.",
    "Barr died in 1918 at age 87.",
    "This is a universal problem.",
    "She died at age 97 in 2021.",
    "She died in 2012 at age 89.",
    "She is a supporter of PETA.",
    "She died at age 62 in 1781.",
    "She died at age 55 in 1649.",
    "She died at age 39 in 1964.",
    "She died at age 80 in 2019.",
    "She died at age 65 in 1642.",
    "She died at age 73 in 1906.",
    "Died from cancer at age 50.",
    "She died in 1894 at age 70.",
    "This is the time to act.\"",
    "And the world won't end.",
    "\"Don't think about me.",
    "She was 37-years-old.",
    "They began to jump.",
    " 1983 and 42 U.S.C.",
    "She died in 1798.",
    "(I Know!",
    "in 1886.",
    ".",
    "."
  ]
}