{
  "id": 1108,
  "mediaId": 43,
  "date": "3/25/2022 12:00:00 AM",
  "headline": "'Black Donald Trump' actually voted Dem in 2020 primaries",
  "image": "https://images.dailykos.com/images/1052125/story_image/GettyImages-1304413657.jpg?1648219707",
  "link": "https://www.dailykos.com/story/2022/3/25/2088062/-Georgia-GOP-candidate-and-self-proclaimed-Black-Donald-Trump-actually-voted-Dem-in-2020-primaries",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rebekah Sager",
  "authorUrl": "/users/rebekah sager",
  "termIds": [
    1147,
    2095,
    2347,
    2355,
    146,
    428,
    501,
    562,
    2672
  ],
  "sentences": [
    "RELATED STORY: What I see as a Black woman watching Judge Ketanji Brown Jackson's confirmation hearings\nx\nBut here's the thing: Knowing how petty and resentful Trump can be, Jones' voting record likely won't bode well for him and the support he's betting on from the former, failed president.",
    "I had the courage to support Donald Trump and contribute to him every time he was on the ballot since 2016before it was politically expedient.?\nWhich Democratic candidate Jones voted for remains a secret, but which party ballot a voter requests is open for public record.",
    "Trump's endorsing him for a Congressional seat in Georgia\nAJC pulled public election records and discovered that Jones, who is now a Republican congressional candidate in Georgia, couldn't have voted for Trump in the primary because he was only on the Republican ballot.",
    "Former Democratic state Rep. Vernon Jones calls himself the Black Donald Trump.? I'd like to just leave it at that, but of course, as with any story about the people who swim in Donald Trump's swamp, there's more slime to wade through than you'd imagine.",
    "x\nJones' political career has been a hot mess of controversies and criticism, from campaign contribution violations to accusations of threats, bullying, and a rape accusation in 2005 when he served as the DeKalb County chief executive officer.",
    "As Daily Kos reported last month, with Trump's blessing, Jones bolted from his gubernatorial race against Brian Kemp to try his hand at the 10th Congressional District race in Dekalb Countya district he doesn't even live in.",
    "Jones is either excessively hopeful that his voting record won't matter, or he's hoping that sharing the kinds of sniveling sentiments like this one recently posted on his Facebook pagewhich claims that he's Trump-vetted.",
    "During Trump's 2020 campaign, Jones proudly parted ways with the Democratic Party, choosing instead to lick Trump's boots and crap on the party he'd been a member of for decades.",
    "But, according to reporting from the Atlanta Journal-Constitution, Jones actually ended up casting a Democratic Party ballot in Georgia's presidential primary.",
    "Mike Collins, one of eight Republican candidates battling in the May 24 primary, didn't waste time seizing on the recent discovery of Jones' voting record.",
    "Trump-endorsed? and proud to be the only candidate in this race to have President Trump's COMPLETE & TOTAL ENDORSEMENT!?will save him.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Just this week, he went to Twitter to post a video criticizing Judge Ketanji Brown Jackson during her Supreme Court Hearings.",
    "Old habits die hard for carpetbagging Vernon Jones, who chose Democrats over Donald Trump,? Collins said, according to AJC.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "As a Black man, I care about QUALIFICATION, not Identity, when it comes to deciding our next Supreme Court Justice.",
    "And any nominee who refuses to define the word woman? and enables child predators is simply DISQUALIFIED.",
    "So what better party for the self-proclaimed Black MAGA man? to join than the GOP's Trumpverse?",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Georgia GOP congressional candidate Vernon \"not sure who I am\" Jones.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "There were 12 Democratic candidates in the presidential primary.",
    "Related Story: On Jan. 6 Vernon Jones switched parties.",
    "In other words, he's a turncoat times two.",
    "Jones is pushing hard with his GOP agenda.",
    "Try calling ME a racist,? Jones wrote.",
    "This is a short blurb about Daily Kos.",
    "We'll see, Black Trump, we'll see.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Please read it."
  ]
}