{
  "id": 1109,
  "mediaId": 19,
  "date": "3/25/2022 12:00:00 AM",
  "headline": "Donald Trump to Headline Rally in Georgia with 7 Endorsed Primary Candidates",
  "image": "https://media.breitbart.com/media/2022/03/GettyImages-1229968793-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/25/donald-trump-to-headline-rally-in-georgia-with-7-endorsed-primary-candidates/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    2412,
    2412,
    2172,
    2172,
    2095,
    2125,
    2125,
    2095,
    1951,
    1951,
    2087,
    2087,
    815,
    815,
    1078,
    1078,
    1127,
    1127,
    1147,
    1248,
    1248,
    1147,
    1646,
    1646,
    545,
    545,
    584,
    584,
    428,
    428,
    427,
    427,
    68,
    68,
    155,
    155,
    183,
    183,
    2672,
    2624,
    2624,
    2672,
    2945,
    2945
  ],
  "sentences": [
    "In his announcement, Gordon zoned in on 2020, saying, Georgia's last election was rife with fraud, fraud that cost President Trump his victory.? A week later, Trump announced his endorsement of Gordon and bashed Carr for doing absolutely nothing to stop the 2020 Presidential Election Fraud.?\nWitt and Gordon are also scheduled to speak at Trump's rally on Saturday.",
    "In the span of a week, Patrick Witt dropped out of the Tenth Congressional District race to instead run for Insurance Commissioner, placed his support in the district's packed primary race behind Jones  who had chosen to run in that district instead of running for governor, and then received an endorsement from Trump three days later.",
    "Trump, who endorsed Perdue in December almost immediately after Perdue launched his campaign, has repeatedly charged that the 2020 election in Georgia was stolen? and rigged? and has taken aim at Kemp for leading a state in which he believes an unfair and fraud-ridden voting process played out.",
    "Trump's son Donald Trump Jr. appeared on the campaign trail on behalf of Perdue at the beginning of the month, and the former president held a high-dollar fundraiser for Perdue at Mar-a-Lago last week, from which Perdue's campaign said it expected to raise more than half a million dollars.",
    "The rally is scheduled to begin at 4:00 p.m., and Trump is expected to deliver remarks at 7:00 p.m.\nKemp, who is wrapping up this year's legislative session, which concludes March 31, is planning to spend Saturday morning speaking at a breakfast for the Columbia County Republican Party.",
    "Along with Trump's seven endorsed candidates, Reps. Marjorie Taylor Greene (R-GA) and Andrew Clyde (R-GA) are also slated to speak at the rally, as well as former Trump U.S. Immigration and Customs Enforcement Acting Director Tom Homan and conservative commentator Todd Starnes.",
    "In addition to Perdue, Walker, Jones, Witt, and Gordon, Trump-backed state Rep. Burt Jones, who is competing against Senate President Pro Tempore Butch Miller for lieutenant governor, will also speak, as will Trump-backed Rep. Jody Hice (R-GA).",
    "The former president is now betting heavily on Perdue, persistently putting out public statements in support of his candidacy and throwing his weight behind other Georgia candidates who align with his mission to overthrow Kemp and Kemp allies.",
    "A vote for David Perdue is a vote to save Georgia from the Radical Left!? Trump stated, referencing the Democrat voting rights activist Abrams, who just barely lost to Kemp in Georgia's 2018 gubernatorial contest and is now running again.",
    "Perdue, who has so far been trailing Kemp in primary polls, has united with Trump in his stance about 2020 and made Trump's backing a prominent feature of his campaign as he seeks to energize Trump's base to turn out for the primary.",
    "Kemp has become one of Trump's most sought-after targets since the 2020 election, which Trump narrowly lost  by a whisker,? as Trump says  after two recounts in the closest race of any state in 2020.",
    "Jones exited the gubernatorial contest in early February, just after Fox News reported that Jones had met with Trump and that Trump had offered him his endorsement if Jones instead ran for Congress.",
    "Former President Donald Trump is heading to the Peach State Saturday to campaign at a rally for the seven candidates he has endorsed in Republican primary races ahead of the state's May 24 election.",
    "Raffensperger served as chair of the five-member State Elections Board when the board changed various voting procedures in 2020 because of coronavirus surging and legal pressure from Democrats.",
    "Trump was successful, however, in convincing Jones to drop out of that race and instead jump into a congressional race, a move that was expected to consolidate support behind Perdue.",
    "As for Jones, the avid Trump supporter who officially converted from Democrat to Republican in 2021 initially planned to run in the gubernatorial primary against Perdue and Kemp.",
    "The rally will take place at Banks County Dragway in Commerce, Georgia, which is situated in a solid red county in northeast Georgia that Trump won by nearly 60 points in 2020.",
    "Hice is challenging Secretary of State Brad Raffensperger, who drew perhaps the most ire of any Georgia official after 2020 over concerns of election fraud and mismanagement.",
    "Walker is also endorsed by Trump and is gearing up for a competitive and expensive general election battle with incumbent Sen. Raphael Warnock (D-GA).",
    "Walker, a former University of Georgia football star and Heisman Trophy winner, appears easily positioned in polls to win his Senate primary race.",
    "In a lengthy statement following the fundraiser, Trump released a bulleted list of his grievances with Kemp, all relating to the 2020 election.",
    "Brian Kemp (R), will speak at the event, as will Senate candidate Herschel Walker, former state Rep. Vernon Jones, and several other guests.",
    "A lawyer named John Gordon announced on March 16 a late challenge to Attorney General Chris Carr, who is a supporter of Kemp.",
    "Two of Trump's more recent and lesser-known endorsees followed similar patterns timing-wise.",
    "A vote for RINO Brian Kemp in this primary is a vote for Governor Stacey Abrams.",
    "Former Sen. David Perdue (R-GA), who is hoping to unseat Gov.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "Hice will also be present at that event.",
    "Follow her on Twitter at @asholiver."
  ]
}