{
  "id": 1121,
  "mediaId": 43,
  "date": "3/24/2022 12:00:00 AM",
  "headline": "The Downballot: The battle for state legislatures in 2022, with Jessica Post (transcript)",
  "image": "https://images.dailykos.com/images/1051846/story_image/GettyImages-1230690070.jpg?1648135820",
  "link": "https://www.dailykos.com/story/2022/3/24/2087853/-The-Downballot-The-battle-for-state-legislatures-in-2022-with-Jessica-Post-transcript",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2475,
    2475,
    2145,
    2145,
    2399,
    2399,
    1147,
    1147,
    1598,
    1598,
    571,
    571,
    2537,
    2537,
    2791,
    2791,
    2972,
    2972
  ],
  "sentences": [
    "Last month, the Arizona Republic reported that Adel who had recently been in rehab for alcoholism had missed many meetings that she was supposed to attend and failed to weigh in on major legal issues that concerned her office, including you may recall that recent bogus attempt by Republicans to 'audit the vote' in Maricopa County, that a lot of people refer to as a fraudit.' She also allegedly called a staffer 'after hours' while she was drunk and was slurring her words.",
    "So that's one unique role of the legislature, in addition to certifying presidential elections, which the Republicans really tried to undermine and folks may or may not have followed this, but the Republican speaker at the time was flown into the Trump hotel and wined and dined to try to go with Trump's view of what happened in the election in Michigan.",
    "David Nir:\nYou know, maybe the funniest part of that whole thing, Beard is that Trump in pulling his endorsement said that Brooks had gone, 'woke' The idea that one of the ring leaders of the Jan. 6 Stopped the Steal rally preceded the attack on the capital could possibly be part of the 'woke' world is completely hilarious, but I think you're right.",
    "So, because I understood the impact of state legislatures and because I understood the impact on funding for mental health and so many other things I started managing state legislative race right out of college through those college Democrat connections also in rural, Missouri, a town so small that they called the Applebee's, the Applebee's.",
    "David Beard:\nTrump argued that he was abandoning Brooks because the Congressman had told an August rally that basically, they needed to move past the 2020 election, where even if there was all this voter fraud and election theft that Trump and all of the others are so insistent on, that the rally goers really needed to move past it.",
    "And so that allows us to provide a lot more money to state programs, to do things like candidate recruitment, to build campaign infrastructure, to raise digital funds themselves, to raise individual money themselves, to try to really get our level of the ballot funded appropriately to take out Republican majorities.",
    "So I'm going to take us now down to the deep south, all the way, the opposite from Wisconsin down to Alabama, where Donald Trump announced that he was withdrawing his endorsement of representative Mo Brooks ahead of the May Republican Senate primary to succeed retiring Senator Richard Shelby.",
    "And then he also claims that Trump has been influenced by Mitch McConnell, which also doesn't make any sense because Trump and Mitch McConnell are not friends, even if, obviously they've worked together to do some terrible things, they are not two people who really work together well.",
    "And so in response to this, the Congressman himself responded with a statement basically admitting that Trump had asked him to rescind the 2020 elections to remove Joe Biden from the White House to put Trump back in the White House and hold a new special election for the presidency.",
    "Co-hosts David Nir and David Beard also discuss yet another shameful redistricting ruling from the Supreme Court, Donald Trump pulling the plug on Mo Brooks' Senate campaign in Alabama, and a brand-new special election for the top prosecutors post in America's fourth-largest county.",
    "Jessica Post:\nSo in this case, let's say we wanted that person to run for state house, we'd work with the Minnesota House speaker, Melissa Hortman in the majority and we'd go out and see if they wanted to run for this specific district, working with her and the staff on the ground.",
    "That's sort of why they've taken that arrangement instead of trying to go into the, sort of full coalition, which also involves a lot more complexities in terms of sharing all the priorities, instead of very specific agreements, having NDP actually run portions of the government.",
    "In return for support in these key votes that keeps the government running and functioning, the liberals agreed to move forward some key priorities of the New Democratic Party, specifically a dental care program for low income Canadians and a national prescription drug program.",
    "So like Michigan and Minnesota, we need to do everything we can to win it in 2022, because the next bite at the apple is 2026 for both the Michigan and Minnesota State Senates\nDavid Nir:\nYou mentioned in Minnesota Democrats control the House, Republicans control the Senate.",
    "What the Supreme Court struck down today were the state legislative maps, specifically the map for the state assembly, because the Evers map that the Wisconsin Supreme Court picked increased the number of black majority districts in the Milwaukee area from six to seven.",
    "So those are maybe seemingly, I guess, healthcare to that many Virginians is pretty big, but it wasn't necessarily running on the accomplishments of the incumbent caucus, it was more running on their specific individual accomplishments and the storytelling of that.",
    "Jessica Post:\nI think the first thing is to just talk about, here are the challenges of this environment, and only midterm election, I think where the president's party has gained seats that's of recent time is George W. Bush and the Republicans in 02 after 9/11.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nThe battle for state legislatures in 2022, with Jessica Post\nThe Downballot\nFollowShare\n0:0046:23\n15301xMar 24, 2022\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nThis is a short blurb about Daily Kos.",
    "David Nir:\nSo they did this on their so-called shadow docket, meaning there was minimal briefing, no oral argument, essentially the equivalent of doing something in the dark of night by the Supreme Court, all in the service of basically undermining the VRA.",
    "So those two group of state legislative Democrats come together, pool their campaign funds, working with a legislative leader to create a shared strategy with staff and with us to count up to the seats that are needed to win a state legislative majority.",
    "David Beard:\nThen up in Canada, we actually had a general election that occurred last fall that returned a minority liberal government led by prime minister, Justin Trudeau, which is the exact same government that had been in place before the election.",
    "In terms of the why, what the far right majority on the Supreme Court is trying to do, is undermine the Voting Rights Act [VRA], specifically a requirement that you can't simply cut up populations of minorities and try to dilute their voting strength.",
    "0:00\n/ 0:00\nPlay\nFullscreen\nDownload\nMute\nCast\nCaptions\nThe battle for state legislatures in 2022, with Jessica Post\nThe Downballot\nFollowShare\n0:0046:23\n15301x\n image/svg+xml\nPowered by Libsyn\nPowered by Libsyn\nDavid Beard:\nHello and welcome.",
    "David Nir:\nSo, speaking of midterm cycles, one topic that has been a constant for us on this podcast is the difficulty that the party in power by which we mean the, really the party that controls the White House typically has in midterm years.",
    "Jessica talks with us about how the DLCC picks its targets and helps candidates; the impact of freshly un-gerrymandered maps in Michigan and Pennsylvania; and how Democrats are protecting vulnerable seats in a challenging midterm environment.",
    "And in that decision, staying that ruling, Brett Kavanaugh wrote this concurring opinion, saying it was simply too close to the election for a court to interfere and tell a state that it had to change the maps that it was currently using.",
    "If you think of Angie Craig in Minnesota too, or if you think of some of the other races in Minnesota, there's quite a lot of overlap in some of those targeted races, including the Southern Minnesota seat with the passing of Jim Hagedorn.",
    "The Michigan State Capitol\nJoining us on The Downballot this week is Jessica Post, the president of the Democratic Legislative Campaign Committeethe official arm of the Democratic Party dedicated to winning state legislatures nationwide.",
    "David Nir:\nShifting gears, I want to talk about a story that definitely has not gotten very much attention, but ought to, in Maricopa county, Arizona, which is home of Phoenix and also the fourth largest county in the entire country.",
    "The left-wing New Democratic Party and the minority governing liberals just this week announce what's called a confidence and supply agreement, that's going to help sustain the government through the full four-year term until 2025.",
    "Then coming up in the second half of the show, we will be talking with Jessica Post, who is president of the DLCC, the arm of the Democratic Party that helps candidates win elections for state legislative office around the country.",
    "The confidence and supply arrangement is not something that's happened a lot at the federal level, but there's been a number of cases at the provincial level, where parties have gone into these confidence and supply agreements.",
    "And a lot of what I saw at Emily's List was robust digital fundraising programs, more in depth candidate tracking and providing a lot of funds to individual campaigns through their ability to raise through their donor network.",
    "In states like Michigan, where Democrats win the popular vote, in the state house seats every year, the Republicans really designed those seats and gerrymandered those seats for them not to be a subject to trends and whims.",
    "The Supreme Court struck down new legislative maps that the Wisconsin Supreme Court picked earlier this month because the democratic governor, Tony Evers, and the Republican legislature in Wisconsin, couldn't agree on maps.",
    "The spotlight races it's not a comprehensive target list, because there will probably be about 600 to 700 races that are considered state legislative targets all across the country, even in our tier one and two chambers.",
    "There's some deep constitutional principle here that says that you can get involved when it's five months away, but you can't get involved if it's four months away, that is complete and utter bullshit if I might say so.",
    "A confidence and supply agreement is where an outside party, in this case the NDP, agrees to support the minority liberal government on certain key votes, specifically on budget votes and on any no confidence votes.",
    "And I think that's certainly something that we want to change and that's why we've always been so appreciative of all the coverage from Daily Kos Elections, on state legislative races, it's always been appreciated.",
    "And in Pennsylvania, a similar phenomenon happened with the redistricting commission there finally having a fair minded tie break or appointed by the state Supreme Court, which is in turn controlled by Democrats.",
    "The folks that were able to win their seats in Virginia, if you think of delegate Dan Helmer, Delegate Wendy Gooditis, in both of those races, the delegates made an incredible commitment to constituent services.",
    "And while our democratic donors were giving significant funds at the U.S. Senate, at the congressional level, they weren't as focused on unseating state legislative Republican incumbents and incumbent chambers.",
    "That's the nature of parliamentary politics, but in the optimistic sense, the goal is obviously for this confidence and supply arrangement to last until 2025 and bring some stability to the Canadian government.",
    "So down in Australia, the Labor Party, the center-left party in the country, won the South Australia state election in a pretty convincing victory and now controls all but two Australian states and territories.",
    "When you're talking about obviously 50 states, 7,000 some odd state legislators across the country, you're not working on every single race or every single state, of course, but how do you guys do what you do?",
    "Jessica Post:\nSo often it's the state house leader in partnership with us reaching out to that candidate and then talking about the services that we can provide to that candidate and establishing expectations.",
    "If you can think of, for folks that aren't as familiar, there's a small [Democratic Congressional Campaign Committee] DCCC in every state that's responsible for winning the majority in each state legislature.",
    "Jessica Post:\nSo I sat down with her, it's midnight and she slipped a box with slips of paper and all sorts of business cards across the bench to me, and asked if we could put together a fundraising database.",
    "David Beard:\nAnd just as a reminder, please subscribe to The Downballot wherever you listen to podcasts and leave us a five star rating and review, but let's go ahead and get to the meat of today's episode.",
    "And for Mo Brooks, I would just observe that it's not terribly impressive to come out after Donald Trump withdrew his endorsement of you and accuse Trump of doing these things to overturn the election.",
    "We beat back a Republican recall successfully and in the 2019 cycle, when they tried to take out three of our state senators, but while the maps have improved, the chamber numbers are still very close.",
    "We will be talking with Jessica Post, President of the Democratic Legislative Campaign Committee (DLCC), the official arm of the Democratic Party that helps Democrats win legislative races nationwide.",
    "The coalition government is not something that we've really ever seen in Canada, I believe potentially outside of wartime, but it's not something that any of the parties would go to as a first choice.",
    "And so having the opportunity for a full four years to replenish those funds and to be ready for this 2025 election really sets up the NDP a lot better than if another early election had been called.",
    "In the case of Wendy Gooditis, it was about her compelling healthcare story with the untimely, unfortunate death of her brother and what motivated her to deliver healthcare to more Virginia families.",
    "David Nir:\nSo Jessica, before we go, we would love it if you would tell our listeners how they, as individuals can get involved and support the DLCC's work and state legislative Democrats in general.",
    "Now, minority governments are not uncommon in Canada, particularly because they have more than two parties that win a significant number of seats, but they also often don't last the full four years.",
    "Either by, as we've seen in Georgia or the incumbent governor, Brian Kemp is running a strong campaign against Trump endorsed primary opponent, former Senator David Perdue just going right at them.",
    "But today the U.S. Supreme Court ruled that: Yeah, hell yeah, we can totally interfere in the way that a state conducts its elections, even though it's only five months to the primary in Wisconsin.",
    "And the NDP, obviously they've gotten some really important progressive legislation that's really going to help a lot of Canadian citizens, but this also allows them to replenish their funds.",
    "Well, first of all, it allows the liberals to govern for four years without fear of the opposition parties getting together and forcing an election on them when they don't want to have one.",
    "In February, the Supreme Court stayed a ruling by a lower court that said that Alabama had to draw a second congressional district where black voters could elect their candidate of choice.",
    "If you think about progress on racial justice issues after George Floyd or progress on climate, all of those things have been held up by the Republican controlled Minnesota State Senate.",
    "And his own reluctance and even fear to go out on a limb for somebody shows you that you can run it in a GOP primary against a Trump endorsed candidate, and you can still find success.",
    "And we'll finish up with a couple of quick hits in two Commonwealth countries, one election in Australia, and an interesting development in the governance of our neighbor to the north.",
    "So I think about that a lot at DLCC, a lot about that candidate, Pat Yaeger, who served several terms in the Missouri House, when I think about what state legislative candidates need.",
    "We are also going to discuss on a much funnier note, Donald Trump yanking his 'complete and total endorsement' from the guy who was his supposed favorite Senate candidate in Alabama.",
    "So please send us your questions about Downballot elections or any races you'd like to hear us discuss by email at thedownballot@dailykos.com or via Twitter by tweeting @DKElections.",
    "It's not a coalition, which is where the NDP would also be a part of the government where they would have some of the ministries and they would really share power with the liberals.",
    "David Nir:\nSo, Beard, I'm curious, why would two parties like this enter into a confidence and supply arrangement instead of the coalition arrangement that you are also discussing?",
    "Jessica Post:\nAnd so it takes a lot of individual funds and resources that are not involved in the business of state government to help flip a legislative chamber from red to blue.",
    "Jessica Post:\nSo we really dug in and I think doing that work, helping folks in the party at a really desperate moment under Trump, so I see the way back, that's how we help build.",
    "And so that's a sobering reminder, I think to a lot of our legislative leaders that even if we do have improved maps, we need to do everything we can to show up at risk incumbents.",
    "We look at historical data history in partnership with some of the Daily Kos Elections district level data that's been produced, that some of your listeners may be familiar with.",
    "I was the deputy caucus director there in 2006, which seems like a long time ago, now that I say that loud, but there's a huge opportunity for us to flip that state legislature.",
    "David Beard:\nAnd we all certainly hope that Adel gets the help that she needs, but obviously that's not a person in a position to hold an elected office, like district attorney.",
    "David Beard:\nNow, unlike our elections that are scheduled, of course, for every November, the parliament will set the exact date of the election among a number of restrictions.",
    "David Beard:\nSo it's a very strange situation over in GOP primary world, which is not the first time that's been the case, but something definitely we want to keep an eye on.",
    "And then when she would come home, after working the night shift at Schnucks and sleep, and then someone needed to have a walk packet ready for her to go out and knock doors.",
    "David Beard:\nAfter two federal campaigns in three years, the NDP up in Canada historically has a lot less money than either the liberal party or the conservative party.",
    "Like I said, the implications are big because the Voting Rights Act is going to be neutered by the Supreme Court and they're going to do it however they possibly can.",
    "And this just allows them to keep running the government and only have to make policy concessions instead of having to really change the way the government is set up.",
    "If we are able to do that would give us a democratic trifecta in Minnesota, if we can, of course, hold onto the governor and the existing DFL controlled state house.",
    "As opposed to a number of European countries that have parliamentary politics, where it's very common to have coalition government, it's not common at all in Canada.",
    "David Beard:\nSo really some important expansions of healthcare in Canada is what the New Democratic Party ensured that would happen by entering into disagreements.",
    "One big place that we're really interested in flipping is the Minnesota state Senate, the Minnesota State Senate is the last state legislative chamber I worked at.",
    "And as a result now, having some of these new open seats gives us an ability potentially to pull some of the long serving house members over into the state Senate.",
    "You know, we might summarize it as, as Beard did at the top of the show as, the organization that helps elect Democrats to state legislatures across the country.",
    "David Beard:\nSo let's say that I'm, I don't know, a prominent city counselor somewhere, and there's a competitive state house or state Senate race where I live.",
    "And we think that we have a great opportunity between the suburban nature of the districts and some of these other areas like Rochester home of the Mayo clinic.",
    "And so if, as Roe falls with this conservative U.S. Supreme Court, we'll see these historic laws or trigger bans that have been put into place, go into effect.",
    "Jessica Post:\nThe first time that I went into take a workout class, they told me that I needed to like rewind the video and just like put it back into the VCR.",
    "And then in a state like Wisconsin, we're constantly trying to keep the Dems out of going to the super minority so they can prevent an override of Tony Evers.",
    "And the seats that are Democrat favored are up in 2024, while the seats that are more of a swing seats have been allocated to be up in the midterm elections.",
    "So, this creates a new and earlier opportunity for Democrats to try to win back one of the most important local prosecutors offices in the country this fall.",
    "And there's a real sense that almost anything, almost any conservative argument that some conservative lawyer comes up with could be accepted by this court.",
    "There's the new independent redistricting commission, which put in place much fairer maps than the previous GOP gerrymanders that had been used for decades.",
    "And we know that we can flip a few seats in Pennsylvania this cycle, and then the hope is that going to 2024, we can flip enough seats to flip the chamber.",
    "It's certainly something that's trickled down to state legislative races in difficult midterm in the past, such as 1994, and you talked about 2010 earlier.",
    "The folks who listen to this show are definitely interested in the nitty gritty of sort of how politics comes together and where the rubber meets the road.",
    "Jessica Post:\nThey also went out and integrated what they were doing with constituent services inside the state capital with their campaigning strategies.",
    "We wanted to make sure that, and I think this is sort of going back and forth, but that John Bel Edwards's veto of the Republican maps would be sustained.",
    "And you're wrong in such a way that basically makes it extremely difficult to prevail on future Voting Rights Act claims under this provision of the law.",
    "So how are you working with candidates and your partners in the states, the various caucuses to face what looks like could be another tough environment?",
    "And that's, we think, the playbook going into 2022, we had a lot of success with local messaging in 18 about our cycle, but we're working on that again.",
    "And now everyone sort of knows what's happening with choice in Missouri, where they're even trying to outlaw women leaving the state to have abortions.",
    "That if you can draw a district where in this case, black voters have the ability to elect their candidate of choice, then you are obligated to do so.",
    "And so working to triage those funds across those races to win the state legislative majority, because that's when you have power and can do things.",
    "And like you said, that could also be places where you're looking to break a super majority or something like that, like you mentioned in Louisiana.",
    "David Beard:\nSpeaking of Democrats, gaining power, why don't we dive into some of the specific states that are going to be on the ballot this year.",
    "And eventually I realized as I was working with these candidates that I was recruiting women to run for Congress in districts that were unwinnable.",
    "So, I started working there, then I worked at the Missouri House caucus, looking at the whole battlefield, really the races in Eastern, Missouri.",
    "He told me the other day, and the data supports this, that they could win 18 seats so a near path to the majority in the Michigan state Senate.",
    "One is army veteran, Mike Durant, who Trump has previously not been crazy about because he was a surrogate for John McCain way back in the day.",
    "That replacement also has to be a Republican, but we're going to have a special election this November for the final two years of Adel's term.",
    "David Beard:\nThe Liberals have been running the government for a number of years now, and I think they're pretty happy to continue to do so.",
    "And in all of these races, they could have fallen victim to running on other messages, but they really stayed true to their local messaging.",
    "And we unfortunately lost controlled the Missouri state house in 2002, but I started managing a state legislative race right out of college.",
    "So that's something we'll be keeping a close eye on, and we'll definitely be discussing more once the election is set and as we get closer.",
    "David Nir:\nBut worst of all her office during her tenure had to drop 180 cases, because her staff had waited too long to bring any charges.",
    "But instead, it's pretty clear to every who followed Trump, that he dumped Brooks because Brooks was losing and Trump doesn't like losers.",
    "David Nir:\nWe're going to start out with a truly outrageous ruling by the Supreme Court that struck down Wisconsin's redistricting plans.",
    "This was in fact reported to the Maricopa County board of supervisors, the body that will be responsible for picking Adel's replacement.",
    "So, for example, when I was growing up in Missouri, there was access to a number of Planned Parenthoods that provided abortion services.",
    "So we'd go out and we would knock doors to try to win control of the Missouri state Senate or hold control of the Missouri state house.",
    "And I know even before state legislative races became more cool, I know that Daily Kos Elections was on the forefront of covering them.",
    "You might get a little talk of governor's races, but state legislative races really find themselves under the radar a lot of the time.",
    "The Downballot is a weekly podcast dedicated to the many elections that take place below the presidency, from Senate to city council.",
    "And we used to go all around the state, our little College Democrats chapter and knock doors in state legislative special elections.",
    "The Michigan state house maps still have a slight Republican bias even though they came out of this nonpartisan commission process.",
    "Does the fact that you're on offense in one chamber and on defense in the other chamber, does that affect your strategy in any way?",
    "David Beard:\nJessica Post, the President of the Democratic Legislative Campaign Committee, thank you so much for joining us today.",
    "In the first quarter of this year, or I should say last year, the Republicans raised 33 million, not the first quarter going back.",
    "And so in Minnesota, in the House it's called the House DFL caucus, which is the Democratic Farmer Labor Party, Democratic caucus.",
    "David Nir:\nAnd I want to point out that at the time the court ruled in the Alabama case, it was four months away from the primary.",
    "And if you can show that you're doing better than whoever he endorsed, there's a good chance he'll just switch over to your side.",
    "So what do you see going on in Pennsylvania and Michigan in terms of the opportunities these redistricting reforms have unlocked?",
    "Jessica Post:\nSo I worked on campaigns all across the country, after working at the Missouri House at all levels of the ballot.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Certainly there are about 12 more seats that Hillary Clinton won, and that's certainly one way that we kind of judge the data.",
    "This week we'll be starting off with Wisconsin where a recent Supreme Court decision has affected the state legislative lines.",
    "David Beard:\nSo beyond Michigan and Pennsylvania, are there other states where the DLCC is looking to play off fence in 2022?",
    "Jessica Post:\nWell, let me start with Michigan first, because we are definitely thrilled with the Michigan state Senate maps.",
    "We wanted to start with some offensive opportunities that have opened up thanks to huge changes in redistricting in Michigan.",
    "We don't sit in Washington, D.C., and say, this is the candidate that you need to recruit, this Hopkins city council member.",
    "And that's like, they still have a significant financial advantage and we're doing everything we can to kind of overcome it.",
    "Also on tap is a special election that will be coming up for the top prosecutor position in America's fourth largest county.",
    "So, people accused of domestic violence simply got off a hook due to total incompetence and mismanagement by Allister Adel.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "We just saw a poll the other day that had him coming in third in the GOP primary, meaning he wouldn't even make a runoff.",
    "So lastly, I want to take us quickly to a couple of international quick hits, one down in Australia and one up in Canada.",
    "So how does an organization like the DLCC construct itself to be able to make a difference on such a large playing field?",
    "David Beard:\nSo now let's turn to some of the states where Democrats are going to be looking to hold onto the majorities.",
    "Talking with the leader in Michigan who's a friend and just a wonderful duty, represents Flint in the state legislature.",
    "Adel was appointed to fill a vacancy in 2019 and then won a full four-year term the following year by just 51-49 margin.",
    "The Labor Party there is leading in opinion polls, which would be really good news for the center-left in that country.",
    "I mean, first I should just say, look, the way we pick which states we engage in, we look at all of the data analytics.",
    "David Nir:\nWhat's so infuriating about what the Supreme Court did is not just the what, but also the why and the when.",
    "Jessica Post:\nWhen I came back from Emily's List, I realized we needed to scale the organization pretty tremendously.",
    "And so now, we'll be at maybe 70 plus staff at the end of this cycle and we'll raise hopefully more than $60 million.",
    "And so we first hone in on which states could be flippable from red to blue, or which states do we need to protect.",
    "One of the things that we would do, there was a targeted state legislative district, and I was a college Democrat.",
    "And I know there's been back and forth over the state legislative maps, but that might create another opportunity.",
    "We ultimately think we'll hold the card out of Senate, but we're going to do everything we can to make sure of it.",
    "The state Senate, there was just a major retirement that happened in a seat that we almost won by about 87 votes.",
    "And then the other thing I'll just say, we provide funding for individual races through our spotlight races site.",
    "And in the 2017 and 2018 cycles, we flipped hundreds of seats, red to blue and eight state legislative chambers.",
    "David Nir:\nIn that race key plank for Gunnigle was the county's very harsh charging and incarceration practices.",
    "The DLCC is the arm of the Democratic Party that focuses on winning state legislative races across the country.",
    "And when Republicans took control of the legislature in Missouri, we went down to just one clinic in St. Louis.",
    "If you haven't already, please like and subscribe to The Downballot and leave us a five star rating and review.",
    "But you really know the impact of state legislatures when you're in a state that has flipped from blue to red.",
    "David Beard:\nJoining us today is Jessica Post, the President of the Democratic Legislative Campaign Committee.",
    "So redistricting fell to the state Supreme Court and they wound up choosing maps that Evers himself submitted.",
    "So at the very least, there's a very good chance we won't have to hear about Mo Brooks any longer, very soon.",
    "We were kind of a campus team for the state party that would get called in and then we'd go around the state.",
    "And of course, these are also major swing states that were very close in the last few presidential elections.",
    "Minnesota is interesting because their state house districts are nested within their state Senate districts.",
    "We also have, and will continue to have local volunteer opportunities for folks to get involved on our site.",
    "If something were to happen that forced one or the other party's hand, we could still see an early election.",
    "So this is the way that they found to bring some stability to their government and keep it going until 2025.",
    "And so that got me into it, but the first door that I knocked for a candidate was a state legislative race.",
    "So let's say you're on the city council in Hopkins, Minnesota, which is in a western suburb of Minnesota.",
    "So we see, in states that has staggered terms like in Pennsylvania, that's how we look at state senates.",
    "And so let's say you are on the city council in, let me use a Minnesota example so folks can follow it.",
    "Often what happens is the PAC and lobby money around a state capital that goes to the majority chamber.",
    "The executive director of DLCC had left and some of the board started to recruit me to go back to DLCC.",
    "Jessica Post:\nWhen I graduated from college in 02, Democrats controlled the Missouri state house still.",
    "David Beard:\nOne, Trump remains a powerful force in GOP politics for sure, but not an all powerful one.",
    "I would meet with one candidate at midnight on the bench in a St. Louis grocery store called Schnucks.",
    "And the Republicans were running multimillion dollar races and tons of funds through their committee.",
    "So in cycles like this, like a midterm cycle, we will watch that really closely, the Minnesota House.",
    "And that makes everything around elections districts, all of this really, really difficult and scary.",
    "And so there's a lot of resistance to that concept where the parties are a lot more clearly defined.",
    "Only half the state Senate in Pennsylvania have, so as a result, we'll have a hard time flipping it.",
    "One state that we're watching for that is Ohio, where the Democrats are still in the super minority.",
    "The other thing that I would just add is, the congressional races, that'll be really hot this year.",
    "I think it looked like a lot of folks did not start their careers knocking doors in rural Missouri.",
    "David Nir:\nWell, we're going to migrate back south of the border from Canada to the United States.",
    "Jessica Post:\nMichigan's a state where they have a 1938 post or pre-Roe abortion ban on the books.",
    "We write some direct checks to candidates, but it's much more in the strategy to win the majority.",
    "So check that out and then you can also follow us on Instagram @DLCC, on Twitter and on Facebook.",
    "He was happy to listen to Trump, tell him to do all these things right up until Trump dumped him.",
    "And then he comes out and admits all of this and says that there's all these problems with Trump.",
    "David Beard:\nAnd I think you're totally right there, Nir, where the real fear is what comes next.",
    "This decision from the U.S. Supreme Court came down today and I felt sick and furious reading it.",
    "Governor Whitmer has been trying to get the law off the books, but she's been unable to do that.",
    "And so I thought we have to do everything we can to build an infrastructure to meet this moment.",
    "And the Democratic Party is interested in me running, and I'm like, maybe I'll give this a shot.",
    "So races that will decide control of state legislatures across the country, on our site as well.",
    "They went out, and they door knocked, which was an asset that we didn't have enough of in 2020.",
    "The district lines did improve in New Mexico, but it's definitely a place that we lost in 2014.",
    "So there are two other remaining candidates in the GOP primary that Trump might end up backing.",
    "So we don't know the exact date of the election yet, but we do expect it to be sometime in May.",
    "Now, why do these two parties do this when it's not terribly common to have happened in Canada?",
    "I know, particularly in [Washington,] D.C., federal races really dominate everyone's thinking.",
    "And I think that really informs how folks think through issues, but that's how I got started.",
    "And Helmer talked about expanding school meals, to about 25,000 additional Virginia children.",
    "And then eventually we elevate some of the individual candidates to our DLCC spotlight races.",
    "Their top prosecutor, Republican Allister Adel, just resigned under very sorry circumstances.",
    "What's going to happen now, as I mentioned, the board of supervisors will pick a replacement.",
    "And this would be the first Labor government if they're able to win in Australia since 2013.",
    "Jessica Post:\nAnd then of course we'll watch the Minnesota House like we just talked about.",
    "They themselves called an early election in 2021 to try to get back a majority and failed.",
    "And then Richard Shelby's choice, former Business Council of Alabama head Katie Boyd Brit.",
    "Jessica Post:\nHaving a split legislature really doesn't change the way we look at things.",
    "In 2017, we won a lot of special elections, and I think it really exciting for the party.",
    "But what exactly does that mean on a practical day to day and also more strategic basis?",
    "So the 2021 election was really a status quo reelection of what had taken place in 2019.",
    "Because the districts lines are fairly drawn, it has flipped back and forth many times.",
    "In some of the key races nationally, as the cycle goes on, we'll have spotlight races.",
    "They're in the majority right now, and so you need to win the majority of those seats.",
    "And so if turnout sort of craters again, it's a place that could be more competitive.",
    "The maps that came out of the nonpartisan districting commission did a couple things.",
    "I left, I went to Emily's List where I advised candidates running for federal office.",
    "David Nir:\nSo how did you go from knocking doors in rural Missouri then to the DLCC?",
    "David Beard:\nNow, let me define for you what a confidence and supply arrangement is.",
    "This is a really good sign for the Labor Party going into the next general election.",
    "And that made me realize I wanted to go back to my original passion in the states.",
    "So we also did do a lot to build the awareness of state legislatures in the space.",
    "In addition to that, we have the staggers, not the way that we would've wanted it.",
    "Like, oh, that's the teacher whose brother passed away, who fought for healthcare.",
    "The Michigan state senate maps haven't been drawn in a fair way in about 40 years.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "So, it's been all rebuilding from there and we've had some great election cycles.",
    "And this really informs everything that I know state legislative candidates need.",
    "In other words, the statute of limitations ran out and these weren't minor cases.",
    "And we've decided that this is a district that we need to win based on the data.",
    "So we're just thrilled to see the improvement in the Michigan state senate maps.",
    "Jessica Post:\nSo there's huge opportunity now in the State Senate in Rochester.",
    "Jessica Post:\nSo the Colorado State Senate is certainly at the top of the list.",
    "We were a $16 million organization, and there were only about 12 staff members.",
    "And so we were running uphill to try to flip these state legislative chambers.",
    "And that's how I really understood the impact of state legislatures on policy.",
    "Half of the legislatures are up this year, the either half will be up in 2024.",
    "It's not like the large districts that we see in Washington State and Arizona.",
    "And Michigan's a place where winning the state legislature could prevent that.",
    "So we did that there, we went in and we tried to break other super minorities.",
    "Jessica Post:\nAnd then Pennsylvania: huge improvements in the state house map.",
    "We also will look at things like keeping Democrats out of the super minority.",
    "The district lines and the House, so we think are a little more competitive.",
    "So it's a lot more seen as a more acceptable solution for those two parties.",
    "But what the U.S. Supreme Court said was no, you're wrong about all of that.",
    "The Downballot comes out every Thursday, everywhere you listen to podcasts.",
    "David Beard:\nSo how did you end up in the world of state legislative races?",
    "But that's one way that we raise resources for those individual candidates.",
    "David Nir:\nSo let's talk specifically about the DLCC and what you guys do.",
    "We also saw Hispanic males trend away from us, specifically in New Mexico.",
    "Maricopa County has an incarceration rate well above the national average.",
    "What sort of the step by step process from the new candidate perspective?",
    "We unveiled our flip gif, which if you haven't seen it, it's on Twitter.",
    "And so running a federal election campaign takes a lot out of the party.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Jessica Post:\nThe other states that we'll watch closely are New Mexico.",
    "As a reminder, you can reach us by email at thedownballot@dailykos.com.",
    "So that's a great possibility for us to flip that chamber red to blue.",
    "The Republican legislature has held up a ton of progress in Minnesota.",
    "Or by sort of going around and reaching out to Trump's fear of losing.",
    "And Brooke sort of says, that's not something that could ever happen.",
    "Next week, we're going to be doing our inaugural Downballot mail bag.",
    "We did that in Louisiana to try to support the Governor of Louisiana.",
    "Jessica Post:\nSo in Minnesota, there are 134 state legislative seats.",
    "(And I say Hispanic, because that's the preferred term in the state.)",
    "So power by different definitions, but always oriented around power.",
    "It's a incumbency advantage, but for the entire legislative chamber.",
    "So he will much rather dump them rather than stick it out with them.",
    "And so the maps there also broke a long string of GOP gerrymanders.",
    "So we'll do everything we can to count up to that majority number.",
    "It's just like a moving flipping gif that shows the seat flipping.",
    "I think back on the doors that I've knocked throughout my career.",
    "And it's just so clearly, not something he seriously cares about.",
    "So I sort of got to know the impacts of candidate door knocking.",
    "And of course there is a more modern version of all of that now.",
    "I recruited women to run for office at all levels of the ballot.",
    "So this will create a tougher electoral environment in Colorado.",
    "You can also send those questions via Twitter, via @DKElections.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "The Nevada state Senate's been on knife's edge for a long time.",
    "I went to college in rural Missouri at Truman State University.",
    "I think this is probably the last we're going to see of Brooks.",
    "She's the one who held Adel to that two point win back in 2020.",
    "David Nir:\nAnd I'm David Nir, political director of Daily Kos.",
    "And Republicans control both chambers in both of these states.",
    "That sort of split is incredibly unusual in this day and age.",
    "Jessica Post:\nWe'd love it if folks would check out dlcc.org.",
    "And then I was recruited to come to DLCC as a junior staffer.",
    "I was the national field director and the political director.",
    "I'm David Beard, contributing editor for Daily Kos Elections.",
    "Thanks to our producer, Cara Zelaya and editor, Tim Einenkel.",
    "There'll be an election for the full four-year term in 2024.",
    "And so I spent time in about 20 of them in Eastern Missouri.",
    "We work with in-state partners who do candidate recruitment.",
    "Fortunately, we have a really good playbook from Virginia.",
    "We've seen this before, Trump doesn't like backing losers.",
    "That was all just a very strange situation that occurred.",
    "It's expected to take place sometime in May of this year.",
    "There's an A side and a B side to districts in Minnesota.",
    "We've moved most states out of the super minority status.",
    "I'm also aging myself, I think, through these anecdotes.",
    "That's not something we know about in American politics.",
    "And they just don't care about looking like hypocrites.",
    "Please send in those questions for next week's mailbag.",
    "And in addition to that, they also worked really hard.",
    "So huge opportunity is to change the face of Michigan.",
    "I was the field director for the coordinated campaign.",
    "And that next general election is happening very soon.",
    "But the really galling thing is the timing of it all.",
    "And that is what the Wisconsin Supreme Court thought.",
    "We like to call it the Harvard of Northeast Missouri.",
    "We're going to take a short break, but stick with us.",
    "So there's a lot of very clearly overlapping targets.",
    "And they messaged on their specific accomplishments.",
    "The State Senate has always been a perennial target.",
    "So we fund a lot of that state based infrastructure.",
    "We also had only, I think, 31 democratic majorities.",
    "So that is what Trump has sort of laid his claim on.",
    "A number of them included domestic violence charges.",
    "Originally, I was like, no, I'm not going to do it.",
    "Some of it's simply timeline, some of it's funding.",
    "The Republicans were out-spending us tremendously.",
    "So they really wanted to keep things as they were.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "x\nx\nYou need to enable JavaScript to run this app.",
    "David Beard:\nI think there's a couple of reasons.",
    "They don't really want to bring in other parties.",
    "Obviously, either party could withdraw from this.",
    "What are we going to be covering on today's show?",
    "What are the DLCC's top priorities on that front?",
    "So the Minnesota House, it's a volatile chamber.",
    "Everything that we do is with in-state partners.",
    "David Nir:\nWell, Beard, I am hot about this one.",
    "David Beard:\nAll of which, of course, is insane.",
    "And then there's the Senate DFL caucus as well.",
    "And then eventually I decided that I'd go back.",
    "And I knew that things really needed to change.",
    "The maps are slightly worse for us in Colorado.",
    "Minnesota doesn't have legislative term limits.",
    "So we were certainly on the knife's edge there.",
    "And so those are three at the top of the list.",
    "And then in Nevada, we'll watch both chambers.",
    "The minority government first started in 2019.",
    "But her term in office went very, very poorly.",
    "We were being outspent quite a bit in states.",
    "We instead work with the state house leader.",
    "How does the DLCC interact with that person?",
    "Mo Brooks was clearly fine with all of this.",
    "So I think it's going to be bye bye Brooks.",
    "So you can engage with us in multiple ways.",
    "We'll be back next week with a new episode.",
    "We see Pennsylvania as a multi-cycle play.",
    "Jessica Post:\nWell, it was a long journey.",
    "There's just not enough seats up to flip.",
    "The entire state Senate is on the ballot.",
    "Democrat Julie Gunnigle is running again.",
    "There's nothing legally binding about it.",
    "He was happy to take Trump's endorsement.",
    "David Nir:\nThat's all from us this week.",
    "It's a service to everyone in the party.",
    "Jessica Post:\nI'm so happy to join you.",
    "She was a night manager at a Schnucks.",
    "And we lost a lot of chambers in 2010.",
    "Thanks to Jessica Post for joining us.",
    "And I'm also @Jessica Post on Twitter.",
    "The districts are sort of cut in half.",
    "And the situation is really appalling.",
    "They obviously suffered through that.",
    "And to me, that was really important.",
    "I did the Franken race in Minnesota.",
    "And so for me, I think back on that.",
    "And I think that was really helpful.",
    "But I take two observations from it.",
    "It's a public liberal arts college.",
    "Missouri has 163 state house seats.",
    "So that creates a huge opportunity.",
    "We hold some of those house seats.",
    "Nir, what's going on in Wisconsin.",
    "Oh, Dan Helmer, he's the veteran.",
    "They raised 33 million last year.",
    "So it's an open Republican seat.",
    "We did that actually on our own.",
    "We raised 22 million last year.",
    "Thanks for being here, Jessica.",
    "Four months versus five months?",
    "It was a long winding journey.",
    "I did some advocacy campaigns.",
    "How do they bring them along?",
    "And that includes messaging.",
    "So I'll try to summarize it.",
    "Thanks so much, David Beard.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Jessica Post:\nOh, for sure.",
    "And help run the committee.",
    "So it's a huge improvement.",
    "We'd love to hear from you.",
    "It used to be the opposite.",
    "It's very straightforward.",
    "Evers vetoed the GOP maps.",
    "Thank you for doing that.",
    "I did ballot initiatives.",
    "Want to keep it that way?",
    "And we need to do a lot.",
    "Jessica Post:\nThank you.",
    "So that's the situation.",
    "So, are you kidding me?",
    "We'll also watch Maine.",
    "Daily Kos is different.",
    "So that's really huge.",
    "So I was in college...",
    "So I appreciate that.",
    "Jessica Post:\nYeah.",
    "So that's Michigan.",
    "Jessica Post:\nYeah.",
    "David Beard:\nGreat.",
    "Let's get started.",
    "One is tradition.",
    "Please read it.",
    "It's not that."
  ]
}