{
  "id": 1127,
  "mediaId": 63,
  "date": "3/23/2022 12:00:00 AM",
  "headline": "GOP Rep. Mo Brooks Claims Trump Asked Him To Reinstate Trump Presidency",
  "image": "https://imageio.forbes.com/specials-images/imageserve/623b7112b9b1803163ac893b/Former-President-Donald-Trump-Holds-A-Rally-In-Alabama/0x0.jpg?fit=crop&format=jpg&crop=2649,1490,x0,y27,safe",
  "link": "https://www.forbes.com/sites/joewalsh/2022/03/23/gop-rep-mo-brooks-claims-trump-asked-him-to-reinstate-trump-presidency/",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Joe Walsh",
  "authorUrl": "https://www.forbes.com/sites/joewalsh/",
  "termIds": [
    1147,
    2087,
    2095,
    2475,
    428,
    545,
    562,
    571
  ],
  "sentences": [
    "Brian Kemp (R) is leading Trump-endorsed primary challenger David Perdue in the polls, Texas Attorney General Ken Paxton (R)another Trump endorseewas unable to stave off a primary runoff against George P. Bush, and Trump-backed candidate Sean Parnell dropped out of the Pennsylvania Senate race last year following abuse allegations from his ex-wife.",
    "In a statement issued hours after Trump un-endorsed Brooks in a Senate race, Brooks claimed Trump has asked him to rescind? his election loss, return him to the White House and hold a new special election for the presidency?an unprecedented set of proposals that Congress has no legal or constitutional authority to follow through on.",
    "Most elected Republicans also have not backed the idea, including Brooks, a staunch backer of Trump's unsubstantiated voter fraud allegations who infamously told the former president's supporters to start taking down names and kicking ass? during a raucous speech near the White House just hours before the January 6 Capitol riot.",
    "Some of Trump's fringe alliesincluding lawyer Sidney Powell and MyPillow CEO Mike Lindellbegan floating the idea that Trump could somehow be reinstated as president last year, after Trump's zealous attempts to overturn the results of the 2020 election failed to stop President Joe Biden from being inaugurated.",
    "Topline\nRep. Mo Brooks (R-Ala.) said Wednesday he rejected a request from former President Donald Trump to immediately? put him back in the White House after President Joe Biden's victory was certified by Congressa stunning admission about Trump's post-election behavior.",
    "The congressman says he told Trump this request was unconstitutional since any recourse to reverse the results of the 2020 election disappeared after Congress certified the Electoral College results on January 6, 2021, which angered the former president.",
    "Trump claimed Wednesday he rescinded his endorsement of Brooks in this year's open Alabama Senate race because Brooks went woke,? telling a crowd at a Trump rally last year to put [the 2020 election]\nbehind you? and focus on future races.",
    "Trump also told people he believed he could be reinstated by August 2021, the New York Times' Maggie Haberman reported last year, and some internet conspiracy theorists landed on a specific reinstatement date: August 13.",
    "Brooks didn't specify when Trump made this request or offer any further details (Forbes has reached out to his Senate campaign and his House office for additional comment).",
    "Trump has endorsed candidates in several high-profile races this year, often backing candidates who have echoed his false voter fraud claims.",
    "The idea has been roundly rejected by legal experts who note there is no legal mechanism for reinstating a former president.",
    "But I took a sworn oath to defend and protect the U.S. Constitution,? Brooks wrote in a statement from his Senate campaign.",
    "I've told President Trump the truth knowing full well that it might cause President Trump to rescind his endorsement.",
    "Trump's office did not immediately respond to a request for comment on Brooks' claims.",
    "Results have been mixed: Georgia Gov."
  ]
}