{
  "id": 1131,
  "mediaId": 112,
  "date": "3/23/2022 12:00:00 AM",
  "headline": "Trump rescinds endorsement of Alabama Republican Mo Brooks in U.S. Senate race",
  "image": "https://images.mktw.net/im-510414?width=700&size=1.5005861664712778&pixel_ratio=3",
  "link": "https://www.marketwatch.com/story/trump-rescinds-mo-brooks-endorsement-in-alabama-senate-race-01648052750",
  "mediaOutlet": "Marketwatch",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Associated Press",
  "authorUrl": "https://www.marketwatch.com/column/associated-press",
  "termIds": [
    800,
    815,
    984,
    997,
    1147,
    1149,
    1646,
    1765,
    2087,
    2095,
    2137,
    2280,
    2475,
    428,
    571,
    2537,
    2858
  ],
  "sentences": [
    "The Margin (May 2020): Trump reaffirms endorsement of Tuberville in Alabama, and a day-long back-and-forth with Sessions ensues\nTrump invited Britt and her husband, Wesley Britt, a former lineman for the New England Patriots, to visit with him at his Palm Beach, Florida, estate last month, according to a person who was familiar with the visit but not authorized to speak about it publicly.",
    "Associated Press\nBrooks was a vigorous Trump backer who called on Jan. 6, 2021, rally attendees to start taking down names and kicking ass'\nMONTGOMERY, Ala. (AP)  Former President Donald Trump on Wednesday rescinded his endorsement of Rep. Mo Brooks in Alabama's U.S. Senate race in a major blow to the Republican congressman's campaign.",
    "From the archives (February 2021): McConnell: Trump is still liable for everything he did'  read full speech\nWhile Trump's endorsement withdrawal is a major loss to the Brooks campaign, the former president's backing hasn't always guaranteed success even in red state Alabama.",
    "Brooks has since found himself in a primary battle with two formidable opponents: Katie Britt, the former head of a state business group, and Mike Durant, a businessman best known as the helicopter pilot shot down and held prisoner in the 1993 Black Hawk Down? incident.",
    "Trump had backed Brooks since last April, more than a year ahead of the upcoming May 24 primary, rewarding the conservative firebrand and ally who whipped up a crowd of Trump supporters at the Jan. 6, 2021, rally that preceded the Capitol insurrection.",
    "Trump said he will be making another endorsement announcement in the near future.?\nVery sad but, since he decided to go in another direction, so have I, and I am hereby withdrawing my Endorsement of Mo Brooks for the Senate,? Trump said in a statement.",
    "That statement ultimately indicated that Trump had asked Brooks to rescind the November 2020 election result and return Trump to the White House, despite, according to Brooks, there being no legal mechanism to achieve those ends beyond Jan. 6, 2021.",
    "In a statement, Trump cited Brooks's performance in the race, poor campaign staffing and what Trump perceived as Brooks's attempt to move Republicans beyond the former president's false 2020 election-fraud claims.",
    "I don't think the great people of Alabama will disagree with me.?\nTrump has been frustrated for months by Brooks's performance as he has failed to gain traction in the race.",
    "Trump has since become more cautious and held back endorsements in several high-profile races, including contests in Ohio, Missouri, Arizona and Pennsylvania.",
    "Trump, who often brags about his endorsement record, takes his tally seriously, seeing it as a reflection of his power as he mulls another presidential run.",
    "Trump, in his Wednesday statement, cited remarks Brooks had made during an August rally with Trump in Alabama that briefly resulted in jeers from the crowd.",
    "Trump and his allies have continued to cling to the false claims that the voting was rigged in the 2020 election, claims that have been thoroughly debunked.",
    "Trump told the Washington Examiner last week that he was disappointed in Brooks's performance and suggested he was open to backing another candidate.",
    "Mo Brooks was the only one in this race to stand with him on January 6th,? Brooks campaign spokesman Will Hampson said in a statement last week.",
    "By dropping the endorsement, the former president is trying to stave off the embarrassment of backing a losing candidate in a high-profile race.",
    "The candidate he originally endorsed in Pennsylvania's Senate race, Sean Parnell, dropped out amid allegations of abuse from his ex-wife.",
    "Trump has fumed at McConnell and repeatedly called for his replacement since McConnell criticized the then-president's conduct on Jan. 6.",
    "A Brooks campaign spokesman said Wednesday morning that the congressman was working on a statement about Trump's endorsement withdrawal.",
    "When I heard his statement, I said, Mo, you just blew the Election, and there's nothing you can do about it,' ? Trump said Wednesday.",
    "The campaign last week blamed Britt for circulating bogus? poll numbers after Trump's remarks about Brooks being disappointing.",
    "Brooks had tried to salvage the endorsement by pledging not to back McConnell as Senate Republican leader if he wins the seat.",
    "In 2017, Trump endorsed Luther Strange in the GOP primary for Jeff Sessions's former Senate seat, but he lost to Roy Moore.",
    "His campaign signs refer to him as MAGA Mo? in reference to the former president's Make America Great Again? slogan.",
    "In North Carolina, his endorsed candidate for an open Senate seat, Rep. Ted Budd, has failed to make a splash.",
    "Brooks told the crowd it was time to move on from the 2020 presidential race and focus on upcoming elections.",
    "The Alabama Senate race will decide who replaces retiring U.S. Sen. Richard Shelby, a fellow Republican.",
    "It's a very tight race between the three of them right now, and I'm not particularly happy,? he said.",
    "Trump backed Moore, who was plagued by sexual-misconduct allegations and lost to Democrat Doug Jones.",
    "Durant has loaned his campaign $4 million, while Brooks has reported $2.1 million in contributions.",
    "And in Georgia, his pick for governor, David Perdue, is trailing incumbent Republican Gov.",
    "Brooks suggested Trump had been duped by Senate Minority Leader Mitch McConnell.",
    "He appeared with a life-size poster of Trump at one recent campaign stop.",
    "It's not the only race in which Trump's pick has been struggling.",
    "The remark resulted in some rallygoers briefly booing him.",
    "Britt and Durant each have a cash advantage over Brooks.",
    "Britt previously served as Shelby's chief of staff.",
    "Brooks has leaned heavily on the Trump connection.",
    "Brian Kemp, one of his top 2022 targets.",
    "Britt has raised nearly $5 million.",
    "MarketWatch contributed."
  ]
}