{
  "id": 1134,
  "mediaId": 124,
  "date": "3/23/2022 12:00:00 AM",
  "headline": "Trump withdraws endorsement of Mo Brooks in Alabama Senate race",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220323-mo-brooks-jm-0835-1b683f.jpg",
  "link": "https://www.nbcnews.com/politics/elections/trump-withdraws-endorsement-mo-brooks-alabama-senate-race-rcna21153",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    2049,
    2095,
    2137,
    2475,
    12,
    428,
    571,
    2537,
    2630
  ],
  "sentences": [
    "By pulling his endorsement of Brooks, Trump is at least temporarily giving a boost to both of the other two GOP candidates in the race to succeed retiring Republican Sen. Richard Shelby, Katie Britt and Mike Durant, before the May 24 primary.",
    "In remarks at the Jan. 6 rally in Washington that preceded the riot at the Capitol, he said, Today is the day American patriots start taking down names and kicking ass.?\nGet the Morning Rundown\nGet a head start on the morning's top stories.",
    "Hostile Trump mob sends GOP Rep. Brooks into panicked backpedal on moving on from 2020\nAug. 23, 202102:17\nBut the former president had a pile of qualms that had been mounting for months, according to people familiar with the dynamic.",
    "I understand she wishes Donald Trump Sr. and Jr. liked her and will endorse, but they won't.?\nTrump said Brooks' lead in polling \"totally evaporated all based on his '2020' statement made at our massive rally in Cullman, Alabama.\"",
    "\"Mo Brooks of Alabama made a horrible mistake recently when he went 'woke' and stated, referring to the 2020 Presidential Election Scam, 'Put that behind you, put that behind you,'\" Trump said in a statement Wednesday.",
    "After tapping Sessions to be his attorney general in 2017, Trump supported the appointed replacement, Luther Strange, in a failed bid for the GOP nomination in a special election to finish the term.",
    "And in South Carolina, where Trump is desperate to unseat GOP Rep. Nancy Mace, the former president's endorsement of Katie Arrington has not given the challenger as much traction as he had hoped.",
    "That's a smart campaign tactic on the Britt campaign's part that has no substance,? Brooks told Alabama.com in February, noting the former president's son and namesake supports him as well.",
    "Former President Donald Trump took back his endorsement of Republican Rep. Mo Brooks in the Alabama Senate race, citing the candidate's appeal to voters to move past the 2020 election.",
    "At the August rally, Brooks was booed by the crowd when he said from the podium: There are some people who are despondent about the voter fraud and election theft of 2020.",
    "The Alabama race is one of a handful across the country in which Trump's vaunted endorsement has not proved to be a fast train to victory in Republican primaries.",
    "Mo called him one of the best senators we ever had.?\nTrump called Brooks disappointing? in an interview with the Washington Examiner last week.",
    "Shelby has pledged to route millions of dollars from his campaign and super PAC coffers into electing Britt, who is his former chief of staff.",
    "But soon after, Trump began having reservations, and people close to Britt's campaign predicted he would rescind the endorsement.",
    "Beat them in 2024!?\nBrooks, a staunch Trump ally, was at the forefront of calls to challenge the 2020 presidential election.",
    "He said he will make a new endorsement \"in the near future,\" but did not specify whether he would do so before the primary.",
    "In Pennsylvania, Trump-endorsed candidate Sean Parnell dropped out of the Senate race amid domestic-abuse allegations.",
    "Brooks, whose Twitter handle still boasts of being endorsed by Trump, also noted that Donald Trump Jr. supported him.",
    "While he is wildly popular there, this is the third time one of his Senate endorsements in the state has backfired.",
    "If no Republican wins at least 50 percent May 24, the top two vote-getters move on to a runoff for the nomination.",
    "You still look at the scoreboard  it's Donald Trump Jr. and Donald Trump Sr. with two endorsements (for Brooks).",
    "In neighboring Georgia, for example, Trump-backed former Sen. David Perdue is trailing in his bid to deny Gov.",
    "Then, Trump backed Roy Moore, the Republican who won that nomination, when he lost to Democrat Doug Jones.",
    "When Trump endorsed Brooks, it looked like the third time might be his charm in Alabama.",
    "In February, Brooks lashed out at Britt, saying it was false that Trump had cold feet.",
    "It's not just the voter fraud stuff that pissed off Trump,\" one Trump adviser said.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "\"I am hereby withdrawing my Endorsement of Mo Brooks for the Senate.\"",
    "And he fired his Alabama staff and hired some Never Trump advisers.",
    "Alabama has proved one of the most vexing states for Trump.",
    "And to Trump, that's a sign you're not working hard.",
    "Durant, an Army veteran, is a newcomer to politics.",
    "Mo fell behind in the polls as a result.",
    "And then there's [Jeff] Sessions.",
    "Trump has met with both of them.",
    "Folks, put that behind you.",
    "Brian Kemp re-nomination.",
    "He wasn't raising money.",
    "Put that behind you.",
    "Yes, look forward!",
    "Katie Britt, zero.",
    "Beat them in 2022!",
    "Look forward!",
    "Look forward!",
    "\"Mo was lazy."
  ]
}