{
  "id": 1138,
  "mediaId": 129,
  "date": "3/23/2022 12:00:00 AM",
  "headline": "Trump Rescinds Endorsement of Mo Brooks for Senate in Alabama",
  "image": "https://static01.nyt.com/images/2022/03/23/us/politics/23pol-endorse-trumpbrooks/23pol-endorse-trumpbrooks-facebookJumbo.jpg",
  "link": "https://www.nytimes.com/2022/03/23/us/politics/trump-mo-brooks-senate.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1765,
    2049,
    2095,
    2280,
    2475,
    428,
    571,
    2537,
    2672
  ],
  "sentences": [
    "Former President Donald J. Trump retracted his endorsement of Representative Mo Brooks's bid for Senate in Alabama on Wednesday, abandoning one of his staunchest allies after months of simmering frustration and as polls showed Mr. Brooks falling behind in the state's Republican primary.",
    "Mr. Trump still accused him on Wednesday of going woke.?\nMr. Trump is obsessed with the success rate of his endorsement in Republican primaries, and after issuing dozens of endorsements across the country in the last year, his power will be tested in a series of tough races.",
    "Mr. Brooks said in a statement that, even knowing full well that it might cause President Trump to rescind his endorsement,? he has told Mr. Trump that the 2020 election results as certified by Congress cannot be overturned.",
    "He has privately met with both of the other leading candidates: Katie Britt, a former top aide to Senator Richard Shelby, and Mike Durant, who was in one of the Black Hawk helicopters that were shot down in Somalia in 1993.",
    "While Mr. Trump framed his decision to rescind his endorsement through his continued false claims that the 2020 election was stolen, the move appeared as much about preserving his political capital in 2022 and beyond.",
    "It's disappointing that, just like in 2017, President Trump lets Mitch McConnell manipulate him again,? Mr. Brooks said in a statement, blaming Mr. McConnell and his allies for negative ads run against his campaign.",
    "In a last-ditch effort to keep Mr. Trump in his corner, Mr. Brooks, who spoke at the rally that preceded the Jan. 6 attack on the Capitol in 2021, used footage from that speech in a new television ad last week.",
    "Very sad but, since he decided to go in another direction, so have I.?\nMr. Brooks sharply disagreed with the decision and blamed Senator Mitch McConnell, the Republican leader, for Mr. Trump's change of heart.",
    "Mr. Shelby recently told Politico that he planned to use his leftover campaign funds  as much as $6 million  to help Ms. Britt, a financial infusion that further narrowed Mr. Brooks's pathway to victory.",
    "On Tuesday evening, Mr. Trump announced the endorsement of another Republican challenger in Georgia: John Gordon, who is running against the state's attorney general, Chris Carr.",
    "Looking straight into the camera, Mr. Brooks said in the ad, On January 6th, I proudly stood with President Trump in the fight against voter fraud.?\nBut it was not enough.",
    "Mr. Trump again cited the postelection period in 2020 and accused Mr. Carr of doing absolutely nothing? to support the former president's baseless claims of voter fraud.",
    "In a sign of Mr. Trump's continued focus on the 2020 election, he cited Mr. Brooks's remarks at a rally last summer urging voters to move on from Mr. Trump's defeat.",
    "When I heard his statement, I said, Mo, you just blew the election, and there's nothing you can do about it,'? Mr. Trump said in a statement on Wednesday.",
    "The Trump endorsement has been so central to the Brooks candidacy that his official campaign logo included the fact that Mr. Trump had endorsed him.",
    "Just the Beginning: For many Trump supporters who marched on Jan. 6, the day was not a disgraced insurrection but the start of a movement.",
    "In 2020, Mr. Trump was more successful, backing Tommy Tuberville over the former president's onetime attorney general, Jeff Sessions.",
    "I wish President Trump wouldn't fall for McConnell's ploys, but, once again, he has.?\nHow Donald J. Trump Still Looms\nGrip on G.O.P.",
    "Power Struggle: Led by Senator Mitch McConnell, a band of anti-Trump Republicans is maneuvering to thwart the ex-president.",
    "Mr. Durant was in Mar-a-Lago for a meeting with Mr. Trump this week, according to a person with knowledge of the meeting.",
    "This Saturday, Mr. Trump will campaign in Georgia, where he is backing former Senator David Perdue's challenge to Gov.",
    "Midterms Effect: Mr. Trump has become a party kingmaker, but his involvement in state races worries many Republicans.",
    "In 2017, he endorsed Senator Luther Strange, who was defeated by Roy S. Moore in a special election primary.",
    "I break my sworn oath for no man.?\nMr. Trump has seen his preferred candidate in Alabama defeated before.",
    "Post-Presidency Profits: Mr. Trump is melding business with politics, capitalizing for personal gain.",
    "Period.?\nI took a sworn oath to defend and protect the U.S. Constitution,? Mr. Brooks said.",
    "When I endorsed Mo Brooks, he took a 44-point lead and was unstoppable,? Mr. Trump claimed.",
    "Mr. Brooks has struggled to raise money and has seen his support in the contest evaporate.",
    "Brian Kemp, who angered Mr. Trump by certifying the state's 2020 election results.",
    "Neither the U.S. Constitution nor the U.S. Code permit what President Trump asks.",
    "Alabama has long been seen as one of the places he was most vulnerable to defeat.",
    "Mr. Trump then endorsed Mr. Moore, who was defeated by Doug Jones, a Democrat.",
    "Mr. Trump said he would endorse another candidate in the near future.",
    ": Mr. Trump remains the most powerful figure in the Republican Party.",
    "Some private surveys had Mr. Brooks sagging to third place.",
    "However, there are signs his control is loosening.",
    "Mr. Tuberville won in a landslide.",
    "He pledged to stay in the race.",
    "That is the way I am.",
    "I honor my oath."
  ]
}