{
  "id": 1143,
  "mediaId": 43,
  "date": "3/23/2022 12:00:00 AM",
  "headline": "Mo Brooks, Less previous guy, plus insurrection body armor",
  "image": "https://images.dailykos.com/images/1051554/story_image/FOjNUsYWYAEWAzD1?1648055535",
  "link": "https://www.dailykos.com/story/2022/3/23/2087634/-Mo-Brooks-Less-previous-guy",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1404,
    2095,
    2137,
    2475,
    2672,
    2799,
    2834,
    2862
  ],
  "sentences": [
    "\"Trump invited Katie Britt and her husband, Wesley Britt, a former lineman for the New England Patriots, to visit with him at his Palm Beach, Florida, estate last month, according to a person who was familiar with the visit but not authorized to speak about it publicly.\"",
    "Brooks has since found himself in a primary battle with two formidable opponents: Katie Britt, the former head of a state business group, and Mike Durant, a businessman best known as the helicopter pilot shot down and held prisoner in the 1993 Black Hawk Down? incident.",
    "Trump had backed Brooks since last April, more than a year ahead of the upcoming May 24 primary, rewarding the conservative firebrand and ally who whipped up a crowd of Trump supporters at the January 6, 2021, rally that preceded the Capitol insurrection.",
    "Trump has been frustrated for months by Brooks' performance as he has failed to gain traction in the race.?\nx\nIt's not the only race in which Trump's pick has been struggling.",
    "Trump has since become more cautious and held back endorsements in several high-profile races, including contests in Ohio, Missouri, Arizona, and Pennsylvania.",
    "The candidate he originally endorsed in Pennsylvania's Senate race, Sean Parnell, dropped out amid allegations of abuse from his ex-wife.",
    "Perhaps he'd like to share a few insights with the Select Committee about the insurrection aside from wearing body armor on that day.",
    "In North Carolina, his endorsed candidate for an open Senate seat, Rep. Ted Budd, has failed to make a splash.",
    "The Alabama Senate race will decide who replaces retiring U.S. Sen. Richard Shelby, a fellow Republican.",
    "And in Georgia, his pick for governor, David Perdue, is trailing incumbent Republican Gov.",
    "Hard to make McConnell the villain in this piece, Giant Orange just hates losers'.",
    "altoday.com/...\nx\n Wednesday, Mar 23, 2022  9:06:40 PM +00:00  annieli\nx",
    "Mo' rebranding, mo' trouble in the GOP Senate primary.",
    "Britt previously served as Shelby's chief of staff.",
    "Previous guy kicks Mo Brooks to the curb.",
    "Brian Kemp, one of his top 2022 targets."
  ]
}