{
  "id": 1144,
  "mediaId": 238,
  "date": "3/23/2022 12:00:00 AM",
  "headline": "Opinion: Trump's un-endorsement of Mo Brooks hurts Trump more than it hurts Brooks",
  "image": "",
  "link": "https://www.washingtonpost.com/opinions/2022/03/24/trump-un-endorsement-mo-brooks-shows-weakness/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    997,
    1147,
    1332,
    1671,
    2087,
    2095,
    2475,
    2510,
    428,
    2537,
    2672
  ],
  "sentences": [
    "Trump did better there in the 2016 GOP primary than in most other Southern states, and Trump-backed political neophyte Tommy Tuberville routed Jeff Sessions, who had previously served as senator there for three terms, in the 2020 Republican Senate primary.",
    "It's one thing to believe, as many Republicans wrongly do, that the 2020 election was stolen; it's quite another thing to believe that Congress can simply declare an election null by majority vote, unseat a duly inaugurated leader and reseat Trump.",
    "But it's also yet another demonstration that the former president's personal influence is waning and that Republican voters don't care about re-litigating the 2020 election as much as he does.",
    "Brian Kemp, one of Trump's punching bags for refusing to back his specious election fraud claims, consistently leads Trump's preferred candidate, former senator David Perdue of Georgia.",
    "It would have been rank malpractice to ignore the voters' main concern, especially since both Durant and Britt were largely unknown to voters when they launched their campaigns.",
    "Neither has run away from Trump, but their campaign ads struck conservative themes such as opposition to President Biden's vaccine mandates and fidelity to Christian values.",
    "More worrying for Trump, only 55 percent said they would definitely or probably vote for him in a 2024 GOP primary, his lowest mark since just after the Jan. 6 riot.",
    "The fact that neither candidate sought to tie themselves to the mast of the rigged election? canard speaks volumes about what Alabama Republicans really prioritize.",
    "Armed with Trump's backing and a high name recognition role in advancing Trump's specious Stop the Steal? effort, Brooks began with a strong lead in the polls.",
    "Donald Trump's decision this week to revoke his endorsement of Rep. Mo Brooks (R-Ala.) for Alabama's Senate seat is a body blow to the struggling candidate.",
    "In a typically bizarre statement, Trump ascribed Brooks's decline to the candidate's alleged failure to tie himself closely enough to the former president.",
    "Trump added that a recent statement from Brooks that Republicans should put the 2020 election behind them was why Republicans were abandoning his campaign.",
    "Rep. Alex Mooney, whom Trump supports for West Virginia's newly redrawn 2nd Congressional District, has touted that endorsement in his television ads.",
    "He has also attacked his primary opponent, Rep. David B. McKinley, for voting to establish an independent commission to investigate the Jan. 6 riot.",
    "National Journal analyst Josh Kraushaar recently looked at how Trump's endorsed candidates are faring and found they are regularly falling behind.",
    "Echelon Insights' March poll found that only 40 percent of Republican voters say they are primarily a supporter of Trump rather than the party.",
    "Despite that, Brooks went from having a 23-point lead in a poll last summer to running a poor third in three polls released earlier this month.",
    "Political consultants are experts at uncovering what voters really care about and then associating their clients with those beliefs.",
    "Brooks contends that Trump asked him after Sept. 1 last year to overturn the 2020 election results and reinstall him as president.",
    "Two serious Republicans, Katie Britt and Mike Durant, entered the primary race and quickly established themselves as contenders.",
    "If Trump's analysis were correct, both Durant and Britt would have tried to embrace Trump's election fraud conspiracy claims.",
    "Other Trump-endorsed candidates are finding that the former president's backing is not a golden ticket to office.",
    "Meanwhile, the Club for Growth ran television ads for Brooks that featured nothing but Trump's endorsement.",
    "Brooks himself also recently ran an ad featuring his speech at the rally preceding the Jan. 6 Capitol riot.",
    "Strikingly, neither has featured opposition to the 2020 election or voter fraud in their mass advertising.",
    "Only Trump's most fanatical supporters would possess such a manifestly undemocratic and unhinged view.",
    "As Trump's candidates continue to lag in the polls, his influence will only atrophy as time goes on.",
    "Statements from Brooks in response to Trump's about-face could drive down his old friend further.",
    "If election denialism and Trump sycophancy were really the GOP's future, Brooks was a lock.",
    "Alabama also appeared to be fertile ground for a Trump-endorsed ultraconservative.",
    "Opposition to a 2024 Trump candidacy is now at 37 percent, the highest level ever.",
    "Despite this, a recent poll puts McKinley ahead of Mooney by five points.",
    "Trump's withdrawal of Brooks's endorsement shows weakness, not strength.",
    "Republican voters, it seems, just aren't that into Trump's fantasies.",
    "This, as Brooks noted, would be both illegal and unconstitutional.",
    "National polling also points to Trump's fading influence.",
    "Brooks started his race as the heavy favorite.",
    "Trump, of course, doesn't see it that way.",
    "But neither of those things are true.",
    "So much for Trump's star power.",
    "That's not an isolated finding.",
    "This is simply delusional.",
    "Even Georgia Gov."
  ]
}