{
  "id": 1153,
  "mediaId": 195,
  "date": "3/21/2022 12:00:00 AM",
  "headline": "Republicans ramp up support for candidates snubbed by Trump",
  "image": "https://thehill.com/sites/all/themes/thehill/images/redesign/thehill-logo-big.png",
  "link": "https://thehill.com/homenews/campaign/599091-republicans-ramp-up-support-for-candidates-snubbed-by-trump",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1147,
    1160,
    1513,
    1563,
    2095,
    2195,
    2475,
    428,
    571
  ],
  "sentences": [
    "But it's important to note that, in general, endorsing a candidate doesn't necessarily mean you're going to determine who the winner is.?\nThey still have to be credible candidates, they still have to run good campaigns, they still have to raise the money and do what they need to do to win,? he added.",
    "While Trump remains the most coveted endorser among Republicans, his picks in some races have stirred concern and frustration within some corners of the GOP, with some Republicans questioning whether the former president is picking the strongest candidates in potentially competitive races.",
    "Republicans are playing offense in this year's midterm elections after losing control of both chambers and the White House; they need to win just five seats in the House and only one in the Senate in November to recapture their congressional majorities.",
    "An NBC News poll released in late January found that most Republican voters  56 percent  see themselves as more supportive of the GOP overall than Trump, while 36 percent said that they see themselves as more supporters of Trump than the party itself.",
    "You look at a lot of the candidates he's endorsed, some of them are struggling now.?\nIn most cases, Trump has prioritized a candidate's loyalty and willingness to back up his claim that the 2020 election was stolen when deciding whom to endorse.",
    "I think there's a sense among a lot of folks that some of these people that the president has endorsed  he's using his own, very specific criteria that's not always in line with what a good candidate looks like,? one Republican strategist said.",
    "Trump has continued to insist upon the strength of his endorsement, arguing that he's almost unblemished in the victory count.? Still, there are signs that his influence over GOP voters may be loosening, at least a little bit.",
    "In a break with Trump, the Republican Governors Association launched an ad in support of Kemp last month  the first time in its history that the group has financed a TV buy boosting a GOP incumbent facing a primary challenge.",
    "The former president also drew criticism from some of his most ardent allies after he endorsed Morgan Ortagus, a former State Department spokesperson, in the Republican primary in Tennessee's 5th Congressional District.",
    "The endorsements are seen as a test of his ability to maintain control over the GOP and its conservative base in his post-presidency, especially as he eyes a potential comeback bid for the White House in 2024.",
    "Likewise, retiring Sen. Richard Shelby (R-Ala.) is preparing to transfer as much as $6 million to a super PAC supporting one of his former aides, Katie Britt, in the GOP primary to succeed him in the Senate.",
    "Other pro-Trump figures, like Rep. Marjorie Taylor Greene (R-Ga.) and conservative commentator Candace Owens, had thrown their support behind another candidate, conservative filmmaker Robby Starbuck.",
    "Kemp, meanwhile, has been singled out for particularly aggressive criticism from the former president for rejecting his pleas to toss out his electoral loss in the 2020 presidential race in Georgia.",
    "His preferred candidate in the GOP Senate primary in Pennsylvania, Sean Parnell, suspended his campaign in November after losing custody of his children amid allegations of past domestic abuse.",
    "His former ambassador to the United Nations, Nikki Haley, recently headlined a fundraiser for Rep. Nancy Mace (R-S.C.), who is facing a Trump-backed primary challenge from Katie Arrington.",
    "By comparison, a similar poll from 2020 found that 54 percent of Republicans and Republican-leaning independents considered themselves more supportive of Trump than the party as a whole.",
    "That's his money and he wants to reserve it for himself.?\nIn fact, several of Trump's preferred candidates have struggled to keep up with their top primary rivals in the money race.",
    "Britt, for instance, raised more than three times as much as Brooks in the final three months of 2021 and has more than twice as much money in the bank as the Alabama congressman.",
    "While Save America, the former president's leadership PAC, ended February with more than $110 million in the bank, it didn't make any donations to the candidates he is supporting.",
    "He held another rally earlier this month in South Carolina to promote Arrington and Republican Russell Fry, who's challenging Rep. Tom Rice (R-S.C.) for his seat.",
    "I think people are, rightfully so, paying attention to who he's endorsing,? said Saul Anuzis, a longtime Republican strategist and former Michigan GOP chairman.",
    "Republicans are growing increasingly bold in their support for a handful of candidates snubbed by former President Trump in hotly contested GOP primaries.",
    "Keith Naughton, a veteran Republican strategist, also noted that Trump has been reluctant to spend money backing up his endorsed candidates.",
    "Trump is set to headline a rally in Georgia on Saturday  the latest in a series of events intended to boost his preferred candidates.",
    "Trump is backing Rep. Mo Brooks (R-Ala.) in that primary, though he has recently expressed disappointment with Brooks's performance.",
    "Naughton said that any losses by Trump's preferred candidates could prove damaging for his future political ambitions.",
    "If his endorsed candidates start losing, it really dents his aura as a winner  with voters, with Republican donors.",
    "And while Republicans acknowledge that the former president's support matters, his endorsement also has its limits.",
    "But for Trump, the success or failure of his preferred candidates may have implications beyond 2022.",
    "It's like his TV show The Apprentice.' After a while, people stop watching because it gets boring.?",
    "In Georgia's GOP gubernatorial primary, former Sen. David Perdue has routinely trailed Gov.",
    "Brian Kemp in public polling and fundraising despite having Trump's support.",
    "Trump's endorsement also hasn't always translated to success in the polls.",
    "Trump's endorsements have, at times, been the subject of controversy.",
    "It's a trend that's not limited to Trump's Republican critics.",
    "The bottom line is he's getting stale,? Naughton said.",
    "A big part of his aura is that he's a winner.",
    "He's not spending it,? Naughton said.",
    "He's not offering anything new.",
    "This is a big problem for him.",
    "1 thing,? Naughton said.",
    "That's his No."
  ]
}