{
  "id": 1154,
  "mediaId": 136,
  "date": "3/21/2022 12:00:00 AM",
  "headline": "Stacey Abrams Files Federal Lawsuit to Start Unlimited Fundraising Early",
  "image": "https://d.newsweek.com/en/full/2005318/stacey-abrams-georgia-brian-kemp-fundraising.webp?w=790&f=2aadae93e2c339bfbde8c87aecb937ec",
  "link": "https://www.newsweek.com/stacey-abrams-lawsuit-fundraising-limits-1690143",
  "mediaOutlet": "Newsweek",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Aaron McDade",
  "authorUrl": "https://www.newsweek.com/authors/aaron-mcdade",
  "termIds": [
    1389,
    1646,
    1951,
    2087,
    2095,
    4325,
    146,
    147,
    501,
    2672
  ],
  "sentences": [
    "In addition to arguing the law violates the First and Fourteenth Amendments, allegedly violating Abrams' free speech rights by limiting how her campaign can use the money, the lawsuit seeks a temporary restraining order be placed on enforcement of the law, which would lead to all qualified candidates in the race operating under the same fundraising limits.",
    "\"Whether a candidate has been elected as a party's nominee prior to any votes being cast or elections certified is a decision to be made by the secretary of state in consultation with the Department of Law and we are awaiting guidance from them on that matter,\" David Emadi, executive secretary of Georgia's ethics commission, said in an email to Newsweek.",
    "Financial disclosures from the campaigns have reported just over $9 million raised by Abrams since she announced her candidacy in December, along with about $2.3 million raised by Kemp's leadership committee in addition to the $12 million he has reported as existing funds, according to the Journal-Constitution.",
    "Abrams' lawsuit claims that because she does not have an opponent and the chair of the state Democratic Party has filed an affidavit declaring her the nominee, she should be allowed to use the funds being raised by that leadership committee now, rather than be forced to wait until after the primary.",
    "Under the original wording, the law gives incumbents an advantage because they can raise funds with no limits over any period of time, while candidates for the opposing party are restricted until they win a primary and become the official nominee, according to The Atlanta Journal-Constitution.",
    "Abrams, who ran against Kemp in the 2018 Georgia gubernatorial race after serving in the Georgia House, has risen to prominence as a voting rights activist widely credited with increasing Democratic turnout that led to the state voting for Joe Biden in the 2020 presidential election.",
    "Last month, a judge ruled partially in Perdue's favor, stating that Kemp cannot use money from the leadership committee that is allowed to raise unlimited funds in ways that would specifically help him win the Republican primary, the Journal-Constitution reported.",
    "Abrams' suit accuses Kemp of signing a law that was \"transparently motivated by the desire of the incumbent Governor and his allies to leverage his legal advantage against those who would challenge his continued reign,\" the campaign press release stated.",
    "Georgia's state ethics commission, the body responsible for enforcing campaign finance laws, has said that declaring who is or is not the official nominee and should be allowed to use certain funds is not a distinction they can make.",
    "Abrams' lawsuit says that considering she does not have an opponent in the Democratic primary, her fundraising limits should be removed now rather than until after she's officially named the nominee in Georgia's May 24 primary.",
    "Nikema Williams, a U.S. House Representative for Georgia and chairwoman of the state's Democratic Party, stated that as the only Democratic candidate to qualify, Abrams should be recognized as the nominee already.",
    "\"When only one Democratic candidate qualifies to run for a specific office the Democratic Party of Georgia customarily declares that candidate as the Party nominee,\" Williams said in a Friday tweet.",
    "Stacey Abrams, the Democratic candidate running to unseat Georgia Governor Brian Kemp, has filed a lawsuit to allow her campaign to increase fundraising by using a law passed by Kemp himself.",
    "After qualifying for the race last week, Abrams and her campaign registered One Georgia, their own leadership committee, with the state to rival Kemp's Georgians First Leadership Committee.",
    "Current state law places limits on how much money one candidate can raise from an individual or group, but those limits do not exist for \"leadership committees.\"",
    "The law states that the current governor, the nominee for the opposing party, and certain legislative caucuses are allowed to fundraise without limits.",
    "\"Brian Kemp signed legislation giving himself exclusive access to a special fundraising committee, and he's already raised millions of dollars into it.",
    "The law has also been challenged by David Perdue, the Trump-endorsed Republican who is running against Kemp in the Republican primary.",
    "ET: This story was updated with additional information, comment from the Abrams campaign, and comment from David Emadi.",
    "Our campaign should have that same access,\" the Abrams campaign said in a press release shared with Newsweek.",
    "Perdue previously filed a lawsuit that also said the law gave the incumbent governor an unfair advantage.",
    "\"As the single qualified Democratic candidate for Governor @staceyabrams is THE Democratic nominee!\"",
    "ET: This story was updated with additional information and background.",
    "Newsweek has also reached out to Governor Kemp's campaign for comment.",
    "Update 03/21/22, 3:04 p.m.",
    "Update 03/21/22, 1:54 p.m."
  ]
}