{
  "id": 1163,
  "mediaId": 33,
  "date": "3/19/2022 12:00:00 AM",
  "headline": "'I did the work and now I want the job': Stacey Abrams kicks second bid for Georgia governor into high gear",
  "image": "https://cdn.cnn.com/cnnnext/dam/assets/211201154226-stacey-abrams-1017-exlarge-169.jpg",
  "link": "https://www.cnn.com/2022/03/19/politics/stacey-abrams-one-georgia-gubernatorial-bid/index.html",
  "mediaOutlet": "CNN",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Eva McKend",
  "authorUrl": "https://www.cnn.com/profiles/eva-mckend-profile",
  "termIds": [
    1216,
    1951,
    2087,
    2095,
    571,
    614,
    2555,
    2672,
    2832,
    2953
  ],
  "sentences": [
    "When Abrams was asked by CNN if she was concerned the inability of Washington Democrats to pass signature legislation on voting rights and police reform would impact her bid for governor, she suggested Democrats had to explain to voters how long these policies take to advance and shouldn't be faulted for having ambitious goals.",
    "And voters statewide will soon experience the provisions laid out in the elections law passed by Republican state lawmakers last year, from limited drop boxes and shortened runoffs to changes to absentee voting and the restriction of offering food and drinks to people waiting in line to vote.",
    "While the former senator continues to run a failing campaign, Governor Kemp will remain focused on uniting Republicans behind a record of results and beating Abrams this fall,\" said Cody Hall, Kemp's director of communications and senior adviser, in a statement earlier this month.",
    "The crowd -- which included a school administrator, a teacher and several veterans listened as Abrams praised the work of a nearby prominent homeless shelter and asked for a moment of silence to show solidarity with the people of Ukraine.",
    "Last year, the Fair Fight Political Action Committee, under Abrams leadership, announced they donated more than $1 million dollars to the organization RIP Medical Debt to eliminate medical bills owed by thousands across the South.",
    "Though Democrats are anticipated to face a tough midterm election year battle -- historically, the party in power suffers losses -- Abrams has honed in on local issues, offering a roadmap for what she thinks is a winning playbook.",
    "Her pitch to voters includes little mention of the last election and instead focuses primarily on her plan to expand Medicaid, recover from the Covid pandemic, shore up broadband in rural communities and invest in education.",
    "And Abrams' action after that loss -- when she acknowledged Kemp would be certified as governor but refused to concede, attributing her defeat to voter suppression -- has become something she's had to address as well.",
    "She's best known throughout the country for being the strategic mastermind behind the sustained voter engagement strategy that ultimately led to those Democratic victories in January 2021's Georgia runoffs.",
    "\"Stacey Abrams may see the Governor's Mansion as the next stepping stone on her way to the White House, but Georgians won't be fooled,\" Kemp press secretary Tate Mitchell said in a statement this month.",
    "While now-President Joe Biden won the state narrowly four years ago -- followed by two Senate runoff victories that rewarded Democrats control of the Senate -- the state remains in play.",
    "Warner Robins, Georgia (CNN)On a sunny Monday afternoon on the deck of a lakeside restaurant in central Georgia, a packed crowd of Stacey Abrams supporters eagerly awaited her arrival.",
    "Trump erroneously argues Kemp did not do enough to overturn the 2020 presidential election results and by extension the issue has become definitive of Perdue's campaign.",
    "Though Kemp enjoys the power of incumbency, he is facing a formidable primary challenger in Perdue who is endorsed by former President Donald Trump.",
    "Though Abrams is deliberately aiming to keep the race state focused, Republicans will use her national aspirations and celebrity status against her.",
    "Abrams's second bid for governor kicked into high gear this week with a slew of rallies and meet-and-greets as part of her \"One Georgia\" tour.",
    "In addition to the gubernatorial race, it will host one of the marquee Senate races in the fall, with Sen. Raphael Warnock defending his seat.",
    "And with the benefit of not having to face a primary challenger, she can begin crafting her message for the general election early.",
    "She also touted her voter engagement efforts and her advocacy to ensure marginalized communities were counted in the 2020 Census.",
    "But even as the GOP primary poses a challenge for the sitting governor, Kemp seems to spend more time attacking Abrams directly.",
    "\"We should do the big things, the tough things, the hard things but we should also be honest about how long it's going to take.",
    "She's confident the strength of her own brand in Georgia can overcome the national landscape her party must confront.",
    "\"I want us to be one Georgia where your zip code and your income don't determine your quality of life,\" said Abrams.",
    "\"I think she started this race four years ago and she's been building a career and a value system all this time.",
    "I did not win,\" Abrams answered before steering the conversation back to the central themes of her campaign.",
    "She was robbed pretty much,\" said Stacey Rice, a 62-year-old retired veteran at the event in Warner Robins.",
    "That sentiment was later echoed by a woman in the crowd during a question-and-answer session with Abrams.",
    "\"At this point, David Perdue's campaign is nothing more than an in-kind contribution to Stacey Abrams.",
    "\"When you apply for a job, and you very publicly don't get it, it can be a little hard,\" Abrams said.",
    "In the years since the 2018 gubernatorial election, Abrams never stopped running for the job.",
    "When Abrams strode in with her powder blue jacket, the crowd leapt to their feet and cheered.",
    "Still, the 48-year-old's narrow 2018 loss against Kemp still haunts many of her backers.",
    "My responsibility as I run for governor is not to distance myself from the hard things.",
    "Later this month, Trump will travel to Georgia to hold a rally for Perdue in Commerce.",
    "Brian Kemp, who is engaged in a bitter primary contest with former Sen. David Perdue.",
    "She's right on schedule,\" said Donata Defilippi, a supporter at her Atlanta rally.",
    "And we should be led by the example of the atrocities that are happening there.\"",
    "Abrams was also candid about her interest in being Biden's running mate in 2020.",
    "As she tells it, she's spent the time doing the work for the people of Georgia.",
    "Her second candidacy comes at a time when much will be on the line in Georgia.",
    "As for Abrams, she could end up in a historic rematch against Republican Gov.",
    "The election is over and when that election was over, I was not the governor.",
    "\"The issue of preserving democracy is one of scale and of intent,\" she said.",
    "Abrams met with Georgians up and down the state, from Cuthbert to Atlanta.",
    "\"I did the work and now I want the job,\" she told a crowd in Atlanta.",
    "It's to talk about how we get the hard things done,\" she responded.",
    "\"Through no fault of your own, it was stolen,\" the woman replied.",
    "\"And we are responsible for doing our small part here.",
    "The woman asked why Abrams decided to run again.",
    "\"I'm not concerned about that,\" she added.",
    "Ya'll are just trying to start trouble.",
    "\"I believe it was really unfair.",
    "We're not going to do that.",
    "Stop it.",
    "\"No."
  ]
}