{
  "id": 1175,
  "mediaId": 237,
  "date": "d2022-03-17T23:00",
  "headline": "The many trials of Brian Kemp",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/f48c8f9/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F33%2F80%2F8da3a37f4b7eb3bd12ee6b4d7830%2Fwb.campign.jpg",
  "link": "https://www.washingtonexaminer.com/news/campaigns/the-many-trials-of-georgia-gov-brian-kemp",
  "sentiment": "-0.472",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haisten Willis",
  "authorUrl": "https://www.washingtonexaminer.com/author/haisten-willis",
  "termIds": [
    1147,
    1951,
    2095,
    2471,
    4325,
    295,
    2672,
    2888,
    2942,
    2945
  ],
  "sentences": [
    "\"The economy in Georgia has fared better than expected these last two years, and that has allowed him to make good on a promise to deliver a $5,000 raise to Georgia teachers and a raise for the rest of the state employees,\" said Nathan Price, a political science professor at the University of North Georgia.",
    "Due to the 2021 election integrity law and the tendency of Trump and Abrams to shout fraud, Kemp may continue to be labeled a cheater at least into 2023, marking the sixth straight year of election controversy swirling around a relatively mild-mannered politician.",
    "\"They don't care about jobs, they don't care about our communities, and they certainly don't care about access to the ballot box, because if they did, MLB would've announced it was moving its headquarters from New York,\" Kemp said.",
    "Andrew Cuomo\nImagine being the disgraced former Governor of New York, who lied about the number of people who died in nursing homes and covered it up as well as getting accused of sexual harassment going on about \"cancel culture.\"",
    "Well, that's what the older Brother Cuomo did when defending his brother Chris, the disgraced former CNN host who got fired after misleading CNN executives about the coordination with Andrew about the allegations against him.",
    "Recent disclosures show less than $900,000 in his campaign coffers, compared to $12.7 million for Kemp, while a Trafalgar poll showed Kemp with 49% support from likely Republican voters, compared to 40% for Perdue.",
    "Well, Greene threw that advice aside and in a tweet, accused NATO of \"supplying the neo-Nazis in Ukraine with powerful weapons and extensive training on how to use them,\" finishing off with the hashtag #NATONazis.",
    "\"He was also the first governor to open up [from lockdowns] in 2020 when even Trump said it was too early, so I expect him to continue to make that point to a public that's ready to move on from the pandemic.\"",
    "\"From my perspective, he's doing exactly what he should do, which is charting a course based on his record as governor,\" said Bob Barr, a former Georgia congressman and the chairman of Liberty Guard.",
    "Just In...\nFew politicians have drawn as much ire from opposite corners of the political spectrum as Brian Kemp, the forever embattled Georgia governor seeking a second term in office this year.",
    "\"Rhetoric about stolen elections, whether it comes from a Donald Trump or a Stacey Abrams, could hasten an unraveling we could have in the country, which is belief in our elections.\"",
    "Barr said he doesn't feel like Perdue's heart is in the race, in sharp contrast to the 2014 senate campaign that sent him to Washington over a host of more experienced challengers.",
    "Abrams cried voter suppression during the campaign and never conceded defeat afterward, riding her claims of a stolen election to national prominence in progressive circles.",
    "During the same interview, Kemp criticized MLB itself, noting that the organization is headquartered in New York, which has seven fewer days of early voting than Georgia.",
    "Riding a Donald Trump endorsement to win the 2018 Republican primary, Kemp defeated Democrat Stacey Abrams to win his first term in the governor's mansion.",
    "No matter what happens the rest of 2022 and the rest of his career, Kemp's constant trials represent an outlandish chapter in Georgia's political history.",
    "The bill prompted Major League Baseball to move its All-Star Game from Atlanta to Denver and placed Georgia and Kemp back in the national spotlight.",
    "No one expects 100% solidarity with what the United States and NATO are doing to assist Ukraine as the country continues to get besieged by Russia.",
    "But despite the constant controversy, or perhaps because of how he's handled it, Kemp looks to be sitting pretty his primary race against Perdue.",
    "We're starting to see more and more that just because Donald Trump has endorsed the candidate, that doesn't mean he's a shoo-in to win.",
    "\"It's based on actual policies, facts, and evidence and not allowing himself to be drawn into arguments about Trump or past elections.\"",
    "\"Our republic has always been predicated on everyone playing by and agreeing to the same rules,\" said Republican strategist Doug Heye.",
    "\"What has happened is not so much about Brian Kemp as it is about the sorry state of politics generally in the country,\" said Barr.",
    "The challenger's only bright spot: About 40% of voters did not know Trump had endorsed Perdue, but those who did know favored him.",
    "But Kemp is well liked in Georgia, Barr argues, leading many voters to question why Perdue is running in the first place.",
    "He's now facing both rivals, aiming to defeat the Trump-endorsed David Perdue before a November rematch with Abrams.",
    "Kemp's supporters praise the steady course he has kept despite the headwinds, and they hope he'll stay on it.",
    "Vladimir Putin exaggerates the number of fringe groups within Ukraine as propaganda to justify his invasion.",
    "Dim Bulbs\nRep. Marjorie Taylor Greene\nGeorgia Rep. Marjorie Taylor Greene is getting familiar around here.",
    "In 2021 Kemp signed an election integrity bill that critics slammed as designed to suppress turnout.",
    "\"They actually call your name out before you go vote in the precinct so people could challenge you.",
    "Those fraud claims might say more about the state of American politics than they do about Kemp.",
    "Yours and your brother's miscreant and unethical behavior cost you both, not \"cancel culture.\"",
    "Most of the people criticizing him don't have any idea what they're criticizing him about.\"",
    "Despite the once-bulletproof Trump endorsement, Perdue's campaign seems to be floundering.",
    "In 2020, Kemp became a Trump target for refusing to entertain claims of a stolen election.",
    "President Joe Biden attacked the move, though once again, Kemp was having none of it.",
    "\"Look at his own state of Delaware,\" Kemp said on Fox Business's Mornings with Maria.",
    "\"Obviously, Perdue has been struggling a little bit despite having Trump's support.",
    "Thus, a late theoretical surge of campaigning from Trump could make a difference.",
    "Still, it helps to maintain some sense of reason when discussing these matters.",
    "Chris too faced allegations of sexual misconduct before his departure.",
    "He needs to focus on his own state and not worry about Georgia.\"",
    "\"Kemp seems to have put himself in a good position,\" Heye said.",
    "The cycle is unlikely to end, even if Kemp wins a second term.",
    "If Kemp emerges from the primary, he should win in the fall.",
    "And that record, at least to Republican voters, is vital.",
    "Kemp's trial by fire blazes even in odd-numbered years.",
    "Thankfully, NATO hasn't given Ukraine any space lasers.",
    "I mean, the world would be falling apart right now.",
    "Could you imagine if we had that in our law?",
    "It looks to be a strong Republican year.\"",
    "\"It has become so skewed and so bizarre.",
    "Really, Andrew?"
  ]
}