{
  "id": 1181,
  "mediaId": 43,
  "date": "3/17/2022 12:00:00 AM",
  "headline": "'It's time for a history lesson': Georgia Democrat refuses to idly let GOP suppress the vote",
  "image": "https://images.dailykos.com/images/1033487/story_image/GettyImages-1237667060.jpg?1643902141",
  "link": "https://www.dailykos.com/story/2022/3/17/2086523/--It-s-time-for-a-history-lesson-Georgia-Democrat-refuses-to-idly-let-GOP-suppress-the-vote",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2087,
    2087,
    2032,
    2032,
    812,
    812,
    428,
    428,
    215,
    215,
    103,
    103,
    2555,
    2581,
    2581,
    2555,
    2672,
    2672
  ],
  "sentences": [
    "After the activity requiring the handling of ballots is completed, such ballots shall be resealed in ballot boxes or other secure containers which shall be recorded and witnessed on chain of custody documentation forms as specified by the Secretary of State and shall be signed by the persons having custody of such ballots.?\nShannon asked what the word handled? means and offered a dictionary definition as to feel or manipulate with hands,? or to manage a situation or a problem.?\nSo what are we talking about here?? Shannon asked.",
    "Are we saying that you've got to have a poll official available if you touch a ballot, if you move a ballot??\nShe even asked the committee if the majority of really important activities are already supervised by an election official, then, What additional activities would you like to see supervised?? Her question didn't get an answer.",
    "This is another attack on the right to vote.?\nRELATED: Georgia Republicans make mockery of democracy after new voter suppression law\nShannon spoke before her peers on Tuesday's Crossover Daya legislative deadline for bills to pass one chamber before they can be decided in the other chamber this session.",
    "In a party-line vote, Georgia's House Republicans passed an elections bill on Tuesday that would allow the Georgia Bureau of Investigation, a state agency supporting criminal investigations, to look into claims of fraud and election crimes, inspect paper ballots, and regulate nonprofit funding.",
    "When Nancy Dennard started working for Brooks County schools in 2000, African Americans had no representatives in key county positions, and she felt that some school board members seemed more interested in preventing property tax increases than providing schools with sufficient resources.",
    "The bill would provide the Georgia Bureau of Investigation with original jurisdiction to investigate election fraud and election crimes? and provide the Georgia Bureau of Investigation with subpoena power to further such investigations,? according to language in the proposed legislation.",
    "Let's talk about the Quitman 10, which was actually the Quitman 12, and how involving the GBI in Georgia's elections in 2010 [...] destroyed the lives of many and had the effect of suppressing Black voter turnout even though no one was ever convicted of any wrongdoing.",
    "Shannon said, quoting Yahoo News and the Equal Justice Initiative:\nWhen Black women flipped the majority-white school board in the small town of Quitman, the State of Georgia arrested them and charged them with 120 separate felony counts of voter fraud.",
    "This country as well as this state has had a history of using law enforcement to suppress, to basically do voter suppression.? This works by making those in Black and brown communities scared to exercise their political power, Shannon said.",
    "She read this section:\nNo ballots shall be handled without a poll official being present and without documentation on the chain of custody documentation forms of who is handling such ballots and when and why such ballots are being handled.",
    "Republicans unfamiliar with or perhaps unaffected by voter suppression tactics used to intimidate and scare Black voters from exercising their constitutional right to vote may see no problem with the legislation.",
    "Demonstrators chant outside of the Atlanta University Center Consortium, part of both Morehouse College and Clark Atlanta University, ahead of a speech by President Joe Biden on Jan.11, 2022 in Atlanta.",
    "x\nx\nx\nShe told the story of the Quitman 10, noting it should be referred to as the Quitman 12 to accurately represent the number of those arrested in the city about 230 miles south of Atlanta.",
    "Six weeks later, state law enforcement officials under the authority of then-Secretary of State Brian Kemp arrested Miss Dennard at her home four days before Christmas.",
    "The Republican-controlled state legislaturethat's ushad made it easier to use absentee ballots in 2005, and Republicans were regularly relying on this voting tactic.",
    "Eleven of her political allies were also arrested, including Linda Troutman, Diane Thomas, and Thomas' sister, Lula Smart, who was an active campaign volunteer.",
    "I knew we had done nothing wrong.'\nThe arrests created an impression in the Black community that vigorously exercising the right to vote would be punished.",
    "Black turnout tripled from the previous two midterm elections and both women prevailed, flipping the board from a majority-white to a Black majority.",
    "She then recruited two other Black womenmiddle-school math teacher Diane Thomas and lifelong educator Linda Troutmanto run for school board in 2010.",
    "The use of threat of law enforcement in elections is not something new and is not conjecture,? Mallow told The Atlanta Journal-Constitution.",
    "Shannon moved to the section of the bill that would give the Georgia Bureau of Investigation (GBI) authority to investigate elections.",
    "\"As Republican legislators across the country work to ban the accurate teaching of history, it's time for a history lesson,? she said.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "[...]\nMiss Dennard told Yahoo News that she and her allies were arrested because they had upset the racial hierarchy.",
    "They thought they could make an example out of me, and that would kill the spirit of this movement,' she said.",
    "They broadcast repeatedly on local TV and news and also used on the Fox News station talked about voter fraud.",
    "She said language in the elections bill is so poor? there's really no way to know you're complying with it.",
    "Most voters, Black and white, voted Democratic in Brooks County, so the July primary was the key race.",
    "They took her away in handcuffs, placed her in a squad car, and walked her into the police station.",
    "This story is something that sounds like it's out of the 1960 civil rights movement, but it's not.",
    "Mug shots of them in orange jumpsuits were plastered all across the newspaper front pages.",
    "After losing campaigns in 2004 and 2008, Miss Dennard began to focus on absentee voters.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "There's a big reason why we should not be involving the GBI in our elections.",
    "But Democrats like Rep. Renitta Shannon and Rep. Derek Mallow know better.",
    "Not enough people know this story, but it is relevant and recent history.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Members of the majority party are doubling down on voter suppression ...",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "The Quitman 12 were charged with 120 separate felonies.",
    "Sound familiar??\nThis is a short blurb about Daily Kos.",
    "So she decided to run for a seat on the school board.",
    "In a special election in 2009, Miss Dennard won.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "This is from 2010.",
    "Please read it."
  ]
}