{
  "id": 1185,
  "mediaId": 19,
  "date": "3/17/2022 12:00:00 AM",
  "headline": "Trump Fundraises for David Perdue, Rips Georgia Gov. Kemp as Horrible RINO' over 2020 Election",
  "image": "https://media.breitbart.com/media/2022/03/GettyImages-1238124584-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/17/trump-fundraises-for-david-perdue-rips-georgia-gov-kemp-as-horrible-rino/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1011,
    1147,
    1506,
    1646,
    2095,
    68,
    296,
    501,
    2672
  ],
  "sentences": [
    "As governor, Brian Kemp has repeatedly surrendered to Stacey Abrams and the Radical Left.?\nTrump then proceeded to bullet point reasons why Kemp was a RINO,? all of which were related to the 2020 election, which Trump lost after two recounts in Georgia by a razor-thin margin of around 12,000 votes out of nearly five million cast:\nKemp allowed himself to be bullied into a disastrous consent decree that effectively abolished signature verification and allowed massive voter fraud to occur throughout the state of Georgia.",
    "Kemp, for his part, sought to address election fraud concerns after 2020 by passing the sweeping Election Integrity Act of 2021, a high-profile bill that led the influential Heritage Foundation to dub Georgia's elections the most secure in the country after the bill was signed into law.",
    "Trump's bullet points also referenced the election integrity group True the Vote's investigation into alleged ballot harvesting, as well as the tens of millions of dollars that two Zuckerberg-funded nonprofits spent on an array of election administration activities in Georgia in 2020.",
    "Trump, who has been a vocal critic of Kemp since the 2020 election, said in a statement after the fundraiser that he believes Perdue is the only? candidate able to defeat Stacey Abrams, the Democrat voting rights activist who is also running for governor.",
    "Trump's high-dollar fundraising, public statements, and upcoming rally  which is slated for March 26  indicate the former president is doubling down and investing heavily in unseating Kemp in the final two months of the race.",
    "Under Kemp, Georgia officials took $45 million dollars from Facebook's Mark Zuckerberg to fund election-related activitiesover 90 percent of which was given to blue areas of the state to bolster Democrat turnout.",
    "The Atlanta Journal-Constitution's Greg Bluestein shared a copy of the event invitation, which showed attendance cost $3,000 per person and a photo with Trump and Perdue required raising or donating $24,200.",
    "True the Vote released bombshell evidence revealing a gigantic illegal ballot harvesting schemeinvolving more than 2,000 ballot traffickersthat took place on Kemp's watch, and he does not even care.",
    "Former President Donald Trump held an expensive fundraiser at Mar-a-Lago in Palm Beach, Florida, on Wednesday night on behalf of former Sen. David Perdue (R-GA), who is challenging Georgia Gov.",
    "The settlement also specified the timeframe within which a voter must be notified of their rejected absentee ballot so that the voter had a reasonable opportunity to cure? the signature issue.",
    "Perdue acknowledged in an interview with Breitbart News in December that Kemp did not sign the settlement, but he argued the governor was complacent in the pre-election signature fight.",
    "Trump has repeatedly targeted Kemp over the consent decree, which was a legal settlement made between the Georgia Democrat Party and Secretary of State Brad Raffensperger in March 2020.",
    "Trump also reiterated his disapproval of Kemp Wednesday night, calling the incumbent governor a horrendous RINO who has betrayed the people of Georgia, and betrayed Republican voters.",
    "The gubernatorial primary takes place on May 24, and so far Perdue has trailed Kemp in polls by ten points or more, meaning Perdue has about two months to turn the tide in his favor.",
    "The settlement was published on the website of Mark Elias's then-law firm, Perkins Coie, a firm heavily involved nationally in fighting to loosen election laws in 2020.",
    "David is a fearless and outstanding conservative leader, and he is the ONLY candidate who can beat Stacey The Hoax' Abrams this November,? Trump stated.",
    "The former president concluded in his statement Wednesday night, A vote for RINO Brian Kemp in this primary is a vote for Governor Stacey Abrams.",
    "He allowed a left-wing organization to mail out 2.2 million absentee ballot applications and place unsecured drop boxes throughout the state.",
    "The settlement required a total of three election officials to sign off on absentee ballots that could not be signature verified.",
    "A vote for David Perdue is a vote to save Georgia from the Radical Left!?\nWrite to Ashley Oliver at aoliver@breitbart.com.",
    "The decree elaborated on the state's process of signature verification on absentee ballots.",
    "By the way, the governor actually didn't sign the consent decree.",
    "Perdue shared photos of the evening in a press release Thursday.",
    "Brian Kemp (R) in the gubernatorial primary in May.",
    "My argument with the governor is he didn't stop it.",
    "They didn't make this open,? Perdue said.",
    "Follow her on Twitter at @asholiver.",
    "They didn't bring it public.",
    "They didn't."
  ]
}