{
  "id": 1199,
  "mediaId": 151,
  "date": "3/15/2022 12:00:00 AM",
  "headline": "Stacey Abrams kicks off next phase of campaign with Atlanta rally",
  "image": "https://static.politico.com/4c/7e/796fdd0f42abb41ebfbad45a9fab/election-2022-georgia-governor-46003.jpg",
  "link": "https://www.politico.com/news/2022/03/14/stacey-abrams-campaign-atlanta-rally-00017191",
  "mediaOutlet": "Politico",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1646,
    1951,
    2095,
    4325,
    2555,
    2672
  ],
  "sentences": [
    "Those dollars that are coming to Georgia, that are going to be infrastructure dollars and health care dollars and education dollars and future-making dollars, are the credit of Democrats who voted for our future, not Republicans who refuse to see the future and believe in us,? Abrams said.",
    "And by God, as governor of Georgia, I am going to fix it.?\nThe 48-year-old Abrams, a former state lawmaker, had little name recognition outside of the state before her 2018 run for governor against Kemp, where she sought to become the state's first Black and first female governor.",
    "Of one Georgia.?\nThe One Georgia Tour,? which will take Abrams to a handful of cities throughout the state, also commenced the night before she is set to launch her first television advertising campaign, according to AdImpact, an ad-tracking service.",
    "Less than eight months until Georgia voters select their next governor in the general election, it's another indication Abrams will take advantage of a so-far-unopposed primary while Republican Gov.",
    "Now the top Democratic voice, known for her voting rights work and credited with turning Georgia blue in 2020, could potentially be in a rematch with Kemp in her run for the governor's mansion.",
    "But Abrams, who officially qualified to run for governor last week, suggested on Monday that these past four years had fueled her  and that she didn't need a title to work for Georgians.",
    "The event follows a quiet few months since Abrams announced her bid for governor in December, when she set into motion one of the most anticipated campaigns of the 2022 midterms.",
    "Based on her kick-off event, it appears Abrams will use the tour to home in on her calls to boost education funding, pass new voting rights protections and expand Medicaid.",
    "Abrams is benefiting from the Kemp-Perdue face-off, at least for now, as former President Donald Trump has created an internal GOP rift by backing Perdue.",
    "| Brynn Anderson/AP Photo\nBy Myah Ward\n 03/14/2022 08:03 PM EDT\nStacey Abrams' campaign for the Georgia governor's mansion has officially hit the road.",
    "She spent the most time during Monday's speech talking about health care, which will likely top Abrams' campaign priorities, just as it did in 2018.",
    "It makes no sense that in the state of Georgia, if he'd been a few miles away or a few counties away, my father would not be with us here today.",
    "Abrams' father, who had prostate cancer 15 years ago, had to have a surgery recently, and her mother noticed something felt off about his skin.",
    "He was able to get the care he needed, and when he ended up being back in the hospital for eight days, he had the support he needed.",
    "She touted this work and what she said it resulted in today  the election of President Joe Biden and Democratic Sens.",
    "Her rise to stardom has made her a GOP target the past four years, from television ads to campaign rallies.",
    "That doesn't mean the Georgia Democrat isn't facing her own challenges in this period of the campaign.",
    "Four years ago, when I applied for this job of governor, I had my application declined,? Abrams said.",
    "Stacey Abrams kicked off the next phase of her campaign with a rally in Atlanta on Monday evening.",
    "The Democrat kicked off the next phase of her campaign with a rally in Atlanta on Monday evening.",
    "Because in November of 2022, we're going to become the governor of the great state of Georgia.",
    "She told a story about her parents, who moved in with her during the pandemic.",
    "I want you to join with me to make joy for Georgia,? Abrams said to the crowd.",
    "Brian Kemp and former Sen. David Perdue battle it out leading up to May 24.",
    "I was able to get him to a world-class hospital,? Abrams said.",
    "I want you to run with me, and I want you to win with me.",
    "You see, I was able to pick up the phone and call.",
    "Abrams, meanwhile, doesn't mention Trump's name.",
    "It's OK. I've had four years to work on things.?",
    "To make opportunity for Georgia.",
    "Raphael Warnock and Jon Ossoff.",
    "He was on the verge of sepsis.",
    "To bring success to Georgia.",
    "I want you to stand with me.",
    "That is a solvable problem."
  ]
}