{
  "id": 1202,
  "mediaId": 1576,
  "date": "3/15/2022 12:00:00 AM",
  "headline": "Stacey Abrams says she's more ready to be Georgia governor",
  "image": "https://www.wabe.org/app/uploads/2022/02/AP22039244868934-1-336x189.jpg",
  "link": "https://www.wabe.org/stacey-abrams-says-shes-more-ready-to-be-georgia-governor/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    947,
    1226,
    1951,
    2087,
    2095,
    2416,
    145,
    146,
    403,
    428,
    600,
    2555,
    2590,
    2632,
    2672,
    2834,
    2862,
    2956
  ],
  "sentences": [
    "I've had four years to live up to what I told folks I would do when I was running for office.?\nAbrams pointed to her work not only in establishing Fair Fight, her voting rights group, but also to the group's purchase and forgiveness of medical debt and work to overcome hesitancy against the COVID-19 vaccine.",
    "Four years later, she is entering the contest as a national political titan widely credited for helping swing Georgia to the Democratic column in the presidential election for the first time since 1992 and for shifting control of the Senate to Democrats after two runoff victories.",
    "Kemp faces a serious primary challenge from former U.S. Sen. David Perdue, leaving it uncertain who will be the GOP nominee on Nov. 8.\nFour years ago when I applied for this job as governor, I had my application declined,? Abrams told a crowd of about 200 near downtown Atlanta.",
    "Abrams also talked about some other parts of her platform, saying she would seek statewide policies on what should be done to help schoolchildren recover from what they missed during the COVID-19 pandemic and do more to promote economic opportunity for all.",
    "Democrat Stacey Abrams is telling Georgia voters that I did the work and now I want the job,? arguing that the last four years since she narrowly lost the 2018 governor's race to Brian Kemp have left her better prepared to govern as she runs again in 2022.",
    "She called the initiative the biggest economic development project in history? saying it would infuse money and jobs into the state's economy, but said at its base, Medicaid expansion is about a society that takes care of everyone.",
    "Abrams launched a statewide tour on Monday with stops in Cuthbert, Warner Robins and Atlanta, unveiling a new stump speech after qualifying last week left her unopposed in the May 24 Democratic primary.",
    "The 48-year-old Abrams was a state lawmaker with little profile outside Georgia when she began her 2018 race for governor, looking to become the state's first Black and first female governor.",
    "We need a governor who doesn't leave it to every school system to decide what should be done because he's too lazy or too inept to decide what should be done,? she said of COVID-19 recovery.",
    "Because the thing of it is, if you are a childless adult in Georgia, no matter how poor you are, you're not poor enough for Georgia to look out for,? Abrams said.",
    "In the southwest Georgia town of Cuthbert, Abrams spoke in front of a rural hospital that closed in 2020, saying that Medicaid expansion could have saved it.",
    "Kemp has deferred to local districts on most instructional policy, part of a long history of local control in Georgia's 180 school districts.",
    "Expanding the Medicaid health insurance program to cover uninsured adults remains the central plank of Abrams' platform.",
    "Abrams' focus was clearly on Republican Brian Kemp, who edged her in 2018.",
    "Follow Jeff Amy on Twitter at http://twitter.com/jeffamy.",
    "It's OK. I've had four years to work on things."
  ]
}