{
  "id": 1212,
  "mediaId": 124,
  "date": "3/13/2022 12:00:00 AM",
  "headline": "Pence fine tunes a message for 2024: Pro-Trump, to a point",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-03/220311-mike-pence-al-0957-fdf6a2.jpg",
  "link": "https://www.nbcnews.com/politics/elections/pence-fine-tunes-message-2024-trump-point-rcna19657",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    803,
    1147,
    1434,
    2030,
    2087,
    2095,
    2807,
    2888,
    2942,
    2959
  ],
  "sentences": [
    "Pence's argument, this person said is, If you like the policies of the Trump administration but not the rest of the stuff, then I'm the guy who's going to fight for it.?\nPence has been giving speeches across the country since leaving office, mixing pointed attacks on President Joe Biden with a defense of the Trump administration's efforts to cut taxes, reduce regulations and safeguard the southern border.",
    "Speaking to Republican donors last weekend as Russian President Vladimir Putin's unprovoked attack on Ukraine ravaged the democratic nation, Pence said, There is no room in this party for apologists for Putin.? That unmistakable swipe at Trump  who had recently called Putin's tactics leading up to the invasion genius?  came after an even more direct condemnation.",
    "As for Russia, Trump still faces criticism for an interview he gave last month in which he said Putin showed genius? and savvy? for recognizing two Moscow-backed breakaway regions in the eastern part of Ukraine as independent, a step that was quickly followed by troops moving into those regions ahead of a full-scale invasion.",
    "It's a marked shift from Pence's deferential posture as vice president, when he was so wary of appearing out of step with his boss that he'd review speech drafts submitted by his aides and edit in Trump's name with a Sharpie to be sure the president was getting enough credit, according to a former administration official.",
    "But it will also pull back the curtain on the many successes the Trump-Pence administration had, and his involvement in them.?\nOther ex-officials who ran afoul of Trump, such as former Attorney General William Barr and former press secretary Stephanie Grisham, have come out with books that have had a retaliatory flavor.",
    "The presidency is not something that he's thinking about, but if that time comes, then he's said he and Karen will consider it and will pray on it,? said an aide for Advancing American Freedom, an issue advocacy group Pence founded, speaking on condition of anonymity.",
    "He's doing a good job of highlighting the successes of the [Trump] administration and, when it comes to Jan. 6, and, more recently, comments on Putin, he's drawing that line,? a person close to Pence said, requesting anonymity to discuss private deliberations.",
    "A Quinnipiac poll last month suggested that 52 percent of Republicans believed that Pence's view that he had no authority to overturn the 2020 election results was closer to their own view than Trump's, which was that Pence did have such power.",
    "\"President Harry Truman said, Don't ever pass up the opportunity to use the restroom.'? At the same time, he's drawn his sharpest contrasts with Trump yet over Russia and a 2020 election the ex-president continues to falsely insist he won.",
    "Still, Pence's positions of late show he is moving inexorably toward running in 2024 and maybe has already made that decision,? John Bolton, former national security adviser who served with Pence in the White House, said in an interview.",
    "Anyone who associates themselves with any positive comments about Putin isn't being very smart, if you look at how everyone is aghast at what's going on in Ukraine,? said John Kelly, Trump's longest-serving White House chief of staff.",
    "Under Trump, the GOP took a different turn as the former president courted authoritarian leaders and considered withdrawing from NATO, the military alliance that has been a bulwark against Russia for decades.",
    "His advocacy group announced last week it was pumping $10 million into an ad campaign aimed at 16 different Democratic House members that urges them to expand domestic oil production, among other actions.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service\nMaking repeated appearances in early presidential primary states, Pence looks and sounds like a candidate-in-waiting.",
    "South Carolina's large evangelical population is a natural constituency for the former vice president, who describes himself as a Christian first, a conservative second and a Republican third.",
    "WASHINGTON  In the past five weeks, former Vice President Mike Pence has broken with former President Donald Trump in more ways and more times than at any point in the previous five years.",
    "President Trump is wrong,? he said in a speech last month, responding to Trump's argument that Pence could have overturned the 2020 election results by refusing to certify the electors.",
    "Pence is scheduled to give a commencement address in the state at the end of April and return in the first week in May to deliver a keynote speech at a Christian pregnancy center.",
    "It's not something that people are assuming is going to be there.?\nTrump has made a slew of endorsements as he looks to oust sitting Republican officials he has deemed disloyal.",
    "In a Republican National Committee podcast, chair Ronna McDaniel asked Trump what he planned to do to help Republicans recapture the House and Senate in the midterm elections.",
    "Some Pence allies say, and his recent moves suggest they're right, that Pence is settling on an a la carte approach: embracing parts of Trump's record while rejecting others.",
    "Firming up his foreign policy credentials, Pence last week met with Israeli Prime Minister Naftali Bennett and also toured the Poland-Ukraine border with his wife, Karen.",
    "It's not Pence's style to write a tell-all, but the person who could give Donald Trump the most headaches could be Mike Pence,? a third person close to him said.",
    "Nearly three-quarters said the U.S. and its allies should set up a no-fly zone in Ukraine, an escalatory step that the Biden administration has refused to take.",
    "Another way Pence may differentiate himself in a presidential race is by reverting to a more traditional Republican platform, a second person close to him said.",
    "In the Georgia governor's race, for example, Trump has endorsed former Sen. David Perdue, who's running against incumbent Brian Kemp in the Republican primary.",
    "The midterm elections in November present a fresh opportunity for Pence to move out from under Trump's huge shadow and expand his own political network.",
    "But if Pence enters the 2024 presidential race, he'd need a rationale that distinguishes him from others, including Trump, a possible candidate himself.",
    "A Reuters/Ipsos poll earlier this month found the vast majority of Americans favored aggressive measures to help Ukraine fend off the Russian attack.",
    "He got a laugh from an audience at Stanford University last month when, as a prank, a student asked him about the location of the nearest bathroom.",
    "By contrast, Pence has vowed to support all incumbent Republican governors, even if they're challenged by candidates Trump has endorsed.",
    "Praise for Putin appears out of step with both American voters and Republican Party leaders who sympathize with Ukraine's plight.",
    "The once loyal number two has been carefully uncoupling himself from Trump as he girds for a potential presidential bid in 2024.",
    "No one is banking on that $120 million coming in,? the strategist said, speaking on condition of anonymity to talk more freely.",
    "Pence seldom revealed his thinking in meetings and waited instead until he was alone with Trump, former officials have said.",
    "It is unclear how much money Trump plans to invest in midterm campaigns from the $120 million-plus war chest he's amassed.",
    "Pence is making decisions completely separate from what Trump is doing,? the second person close to Pence told NBC News.",
    "South Carolina, which typically holds the first presidential primary in the South, is becoming something of a home base.",
    "One will focus on his work in the conservative movement over the years; another will be devoted to his vice presidency.",
    "Pence would champion more classic GOP positions while stressing the value of democratic governance, this person said.",
    "\"It's going to be OK,\" Pence told a Ukrainian refugee carrying a small child, according to a video of his comments.",
    "The ad buy could help him win the gratitude of Republican lawmakers in tough re-election fights.",
    "Kemp angered Trump by upholding the 2020 election result in which Trump lost the state.",
    "Now he is writing two books that will help reintroduce himself to voters on his terms.",
    "I'm sure it will tell stories previously untold,? the Pence advocacy group aide said.",
    "But he appears to be on the right side of public opinion, including among the GOP.",
    "\"He was wrong, pretty obviously,\" Sen. Mitt Romney, R-Utah, said in an interview.",
    "The gambit has the potential to backfire if his endorsed candidates don't win.",
    "In doing so he risks making a permanent enemy of Trump, if he hasn't already.",
    "One national GOP strategist worried that it would be too little, too late.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Trump mentioned that he would be holding rallies  his favorite forum.",
    "A spokesman for Trump did not respond to a request for comment.",
    "Kemp was leading Perdue by 11 points in a recent Fox News poll.",
    "More ads will be coming, the aide to the group said.",
    "\"Hey, this is a real thing,? Pence said.",
    "That's no coincidence."
  ]
}