{
  "id": 1227,
  "mediaId": 1576,
  "date": "3/10/2022 12:00:00 AM",
  "headline": "Kemp qualifies for reelection, says he's focused on Abrams",
  "image": "https://www.wabe.org/app/uploads/2022/03/AP21266659872036-336x189.jpg",
  "link": "https://www.wabe.org/georgias-kemp-qualifies-for-reelection-in-show-of-strength/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1287,
    1646,
    1951,
    2095,
    2444,
    4325,
    146,
    428,
    2672
  ],
  "sentences": [
    "Brian Kemp turned his reelection qualifying on Thursday into a political rally, with cheers of Four more years!? ringing in the state Capitol's marble halls as the Republican tries to brush off GOP challenger David Perdue and look toward a rematch with Democrat Stacey Abrams.",
    "But our sights are focused on who the real opponent is going to be.?\nKemp's campaign pitch is that he has kept his promises, advocating a mix of business-friendly and socially conservative policies, with a pay raise for teachers and state employees thrown in.",
    "I'm proud to say that by working together, we have done exactly that.?\nLike Perdue, he's trying to appeal to Republicans' fear of Abrams, whose narrow 2018 loss to Kemp vaulted her to national prominence and turned her into a fundraising juggernaut.",
    "Perdue says Kemp can never reach a faction of Donald Trump-adoring Republicans angry at Kemp for not trying to do more to overturn President Joe Biden's 2020 victory in Georgia.",
    "1 for business and prioritize economic development in rural parts of our state, that we would fight for our values and ignore those who wanted to play politics,? Kemp said.",
    "We've been waiting for this day for three years,? Kemp told reporters after he spoke to hundreds of supporters, including a number of prominent state lawmakers.",
    "Kemp, 58, is an Athens native and real estate developer who served a term as state senator before losing a 2006 GOP primary for agriculture commissioner.",
    "Democrats attacked Kemp for using the secretary of state's office to investigate opponents and leaving voter information vulnerable to being hacked.",
    "Sonny Perdue rescued Kemp from political obscurity in 2010 by naming him secretary of state, with Kemp winning two terms in the office.",
    "Casey Cagle as Trump endorsed Kemp and Cagle got mired in a scandal over a recording in which he disparaged Republican primary voters.",
    "We have already beat her once and we're in the fight to make sure Stacey Abrams is never our governor or your president,? Kemp said.",
    "I can't control what other people are doing in politics, whether it's my opponent, whether it's people that are endorsing him.",
    "One example from Georgia history is Zell Miller's failed Democratic primary challenge to U.S. Sen. Herman Talmadge in 1980.",
    "But the former U.S. senator still hopes Trump's support will help him close the gap before the May 24 party primaries.",
    "Recent polls have shown Kemp with an edge on Perdue, with fewer than 11 weeks remaining before the May 24 primary.",
    "We promised that we would raise teacher pay, invest in our schools, crack down on gangs, keep our state No.",
    "Even if Kemp wins, the rare serious primary challenge to a sitting governor could leave Kemp weakened.",
    "Mattingly was the first Republican elected senator or governor in Georgia in more than 100 years.",
    "But Kemp is arguing that his 2018 victory proves he is the best Republican to take on Abrams.",
    "What we're going to have to overcome to win the nomination, we're not taking for granted.",
    "Kemp ran an insurgent conservative campaign for governor in 2018, defeating GOP Lt. Gov.",
    "Kemp, for his part, pledged to outwork Perdue but said he is not obsessing over Trump.",
    "Talmadge beat Miller, but lost to Republican Mack Mattingly in the general election.",
    "But Kemp eked out a victory over Abrams in 2018 despite a Democratic surge.",
    "Kemp's campaign has also raised far more money than Perdue thus far.",
    "I've said this about 500,000 times over the last two years.",
    "I'm focused on doing what Georgians want.?",
    "I've been focused on Stacey Abrams.",
    "Georgia Gov.",
    "Gov."
  ]
}