{
  "id": 1235,
  "mediaId": 124,
  "date": "3/9/2022 12:00:00 AM",
  "headline": "War in Ukraine ushers in more pragmatic politics back at home",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2022_10/3539700/220309-biden-mb-1349.jpg",
  "link": "https://www.nbcnews.com/politics/meet-the-press/war-ukraine-ushers-more-pragmatic-politics-back-home-n1291293",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1878,
    1878,
    1312,
    1312,
    1147,
    1147,
    2870,
    2870,
    2862,
    2862,
    2959,
    2959,
    2942,
    2942
  ],
  "sentences": [
    "That's a consequence of the two-week war in Ukraine, including here in the U.S. Just consider these moving parts:\nIn announcing the ban on Russian oil imports, Biden boasted about the record level of domestic oil and gas production in the United States  while at the same time saying he's still focused on clean-energy investments.",
    "\"McDonald's Establishes No-Fry Zone\" is a very strong headline contender that I don't yet see on the internet\n Shane Goldmacher (@ShaneGoldmacher) March 8, 2022\nFox News released a flurry of polls Tuesday evening, focused on contested GOP Senate and gubernatorial primaries.",
    "A dual citizen has been charged with acting as a Russian agent in the U.S.\nOklahoma Republican Sen. James Lankford is raising concerns about domestic violence allegations against the administration's pick to lead Immigration and Customs Enforcement.",
    "Gas prices jump in wake of Biden's ban on Russian oil\nMarch 9, 202202:15\nSo an all-of-the-above energy policy, a return to realpolitik, rallying around the flag and NATO  this is a different political environment than what existed just a month ago.",
    "Rep. Lou Barletta gets support from 19 percent of those surveyed , followed by state Sen. Doug Mastriano at 18 percent, former Councilman Dave White at 14 percent and attorney Bill McSwain at 11 percent.",
    "(After the Wall Street Journal reported that leaders of those countries declined calls with the U.S., American/Saudi/Emirati sources told NBC News they rejected the characterization of that story.)",
    "In Pennsylvania, former hedge fund manager David McCormick leads the GOP Senate field at 24 percent among GOP primary voters, followed by celebrity doctor Mehmet Oz with 15 percent, former Lt. Gov.",
    "Former football star Herschel Walker holds a commanding lead in the GOP Senate primary, garnering support from 66 percent of those surveyed, with Agriculture Commissioner Gary Black at 8 percent.",
    "Now, outside groups in all three states are highlighting candidates' relationships with Trump, with hopes that closeness (or perceived closeness) with the former president could sway voters.",
    "Case in point: Republicans cheer Russian oil ban and jeer Biden for rising gas prices.?\nThat's the final amount of Ukrainian aid Congress is looking to pass, per NBC's Leigh Ann Caldwell.",
    "And, in Pennsylvania, the Commonwealth Leaders Fund highlights gubernatorial candidate Bill McSwain's time as Trump's U.S. Attorney,? while featuring a photo of the two men together.",
    "Other numbers you need to know today:\n107: How many years it's been since the ship Endurance, which was finally found off the coast of Antarctica, had been lost after it sank.",
    "And, in Pennsylvania, the Commonwealth Leaders Fund highlights Bill McSwain's time as Trump's U.S. Attorney,? while featuring a photo of the two men together.",
    "And it raises this question: Can Biden, who campaigned on pragmatism in 2019-2020, capitalize on this patriotism and new pragmatic political environment?",
    "Elsewhere on the campaign trail:\nNevada Democratic Sen. Catherine Cortez Masto dropped her first TV ads, touting her role in delivering pandemic relief.",
    "And the Democratic Socialists of America, whose influence within progressive circles is growing, is facing backlash for calling to withdraw from NATO.",
    "Facing record-high gas prices, the U.S. has begun reaching out to oil-rich Venezuela (and the country released at least two imprisoned Americans).",
    "Pat McCrory is hitting the airwaves ahead of the Senate primary in May with an ad knocking Trump-backed GOP Rep. Ted Budd's comments about Putin.",
    "Brian Kemp enjoys an 11-point lead, 50 percent to 39 percent, over former Sen. David Perdue, who has former President Donald Trump's endorsement.",
    "The aid will be a part of the $1.5 trillion omnibus spending bill that congressional leadership is working on passing before Friday's deadline.",
    "And in the Ohio Senate primary, investment banker Mike Gibbons is at 22 percent, followed by former state Treasurer Josh Mandel at 20 percent.",
    "In Ohio, a local GOP Chairman tells viewers, You're going to get a true Trump conservative  in Jane Timken,? in an ad run by WFW Action Fund.",
    "79,545,412: The number of confirmed cases of coronavirus in the United States, per the most recent data from NBC News and health officials.",
    "nominee Jeff Bartos and conservative activist Kathy Barnette both at 9 percent, and former Ambassador Carla Sands at 6 percent.",
    "In Missouri, Save Missouri Values highlights America-first conservative? Eric Schmitt alongside a photo of Schmitt with Trump.",
    "And former President Donald Trump held a fundraiser for Matthew DePerno, his pick in the Michigan attorney general's race.",
    "Former President Donald Trump has endorsed over 100 candidates for all levels of office in this year's midterm elections.",
    "Vance follows at 11 percent, while former GOP Chairwoman Jane Timken gets 9 percent and state Sen. Matt Dolan 7 percent.",
    "Even as the opposition party  the GOP  calls for pragmatism but tries to score political points against the White House?",
    "Sen. Bernie Sanders, I-Vt., endorsed state Rep. Jasmine Crockett in the primary runoff in Texas' 30th District.",
    "But there are still candidates across the country vying for his endorsement, particularly in some key races.",
    "It's a figure that's a dramatic increase from the $6.4 billion the Biden administration initially asked for.",
    "... Vice President Harris heads to Poland as the U.S. rejects Poland's offer for fighter jets to Ukraine.",
    "President Biden is issuing an executive order calling on the government to look closer at cryptocurrency.",
    "He also hasn't endorsed any of the current candidates running for governor or Senate in Pennsylvania.",
    "... Fox News releases new polls of key GOP primaries in Georgia, Ohio and Pennsylvania.",
    "(Politico is out with a new story on how Budd, has struggled to vanquish McCrory.)",
    "The invasion of Ukraine retraumatizes Holocaust survivors in N.Y.'s Little Odessa.",
    "Trump has yet to endorse in the Ohio and Missouri Republican Senate primaries.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "The GOP primary for governor is even more crowded  with 25 percent undecided.",
    "McCrory's campaign is spending $111,000 on Fox News airtime, per AdImpact.",
    "... President Biden holds an event on competitiveness at the White House.",
    "966,280: The number of deaths in the United States from the virus so far.",
    "The surveys had margins of error of plus or minus 3 percentage points.",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "David Ige announced that he will let that mandate expire on March 25.",
    "NBC looks at the administration's messaging shift on gas prices.",
    "But first: Pragmatism is in, while being a true believer is out.",
    "Nearly one-third of those surveyed  31 percent  are undecided.",
    "1: How many states currently have a mask mandate  Hawaii.",
    "... and a jury finds Jan. 6 rioter guilty on all charges.",
    "The Russian invasion of Ukraine enters Day 14.",
    "(That's 31,817 more since yesterday morning.)",
    "(That's 1,433 more since yesterday morning.)",
    "WASHINGTON  If it's Wednesday ...",
    "Ditto Saudi Arabia and the UAE.",
    "Former North Carolina GOP Gov.",
    "Ten percent were undecided.",
    "In Georgia, GOP Gov.",
    "At least for now.",
    "Gov.",
    "J.D."
  ]
}