{
  "id": 1242,
  "mediaId": 223,
  "date": "3/8/2022 12:00:00 AM",
  "headline": "Poll: Brian Kemp Leads David Perdue By Double Digits in Georgia Republican Primary",
  "image": "https://media.townhall.com/townhall/reu/ha/2019/14/2bee452a-a5b3-4128-9427-6399ea61f301.png",
  "link": "https://townhall.com/tipsheet/landonmion/2022/03/08/poll-brian-kemp-leads-david-perdue-by-double-digits-in-georgia-republican-primar-n2604310",
  "sentiment": "0.275",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Landon Mion",
  "authorUrl": "https://townhall.com/tipsheet/landonmion/",
  "termIds": [
    815,
    1147,
    1312,
    2095,
    4325,
    146,
    428,
    600,
    2672
  ],
  "sentences": [
    "Meanwhile, the poll found that the Republican primary race for Georgia Sen. Raphael Warnock's (D) Senate seat has former Georgia Bulldogs running back Herschel Walker winning the GOP nomination with ease, garnering 66 percent support.",
    "Of the remaining 11 percent of voters, six percent said they are unsure who they would support, four percent said they would vote for another candidate and one percent vowed not to vote.",
    "The Georgia governor has been at odds with Trump ever since he refused to back efforts to overturn the 2020 presidential election results in Georgia in favor of the 45th president.",
    "And of the respondents who had a \"strongly favorable\" view of Trump, the GOP primary numbers flipped, with Perdue receiving 52 percent support and Kemp garnering just 39 percent.",
    "Kemp and Perdue will battle for the Republican nomination, with the winner facing off against Stacey Abrams, the only Democrat running to be the next governor of the Peach State.",
    "Kemp received 68 percent favorability compared to 28 percent unfavorability while Perdue had 66 percent of voters seeing him favorably and 26 percent viewing him unfavorably.",
    "The poll also found that 79 percent viewed former President Donald Trump favorably, with 57 percent saying they view the former president as \"strongly favorable.\"",
    "The remaining three candidates received a total of six percent support while 16 percent of Georgia voters are undecided on who they will vote for in the primary.",
    "The Fox News poll was conducted between March 2 and March 6, surveying 914 Georgia Republican primary voters and with a margin of error of 3 percentage points.",
    "Brian Kemp beats out former Georgia Republican Sen. David Perdue by 11 points in the state's GOP gubernatorial primary, a new poll finds.",
    "According to a new Fox News poll, 50 percent of Georgia voters support Kemp while only 39 percent favor Trump-endorsed Perdue.",
    "Georgia Agriculture Commissioner Gary Black came in at a distant second place with just eight percent of the vote.",
    "Perdue received Trump's endorsement in December after the former president sought a GOP candidate to unseat Kemp.",
    "In the subgroup of voters who had a negative view of Trump, Kemp received an overwhelming majority of votes.",
    "Among these voters, the Georgia governor won with 70 percent support compared to Perdue's 15 percent.",
    "The survey also concluded that Georgia voters had a slightly more favorable view of Kemp than Perdue.",
    "Nineteen percent of respondents have an unfavorable view of Trump.",
    "Trump endorsed Walker for Georgia's Senate seat back in September.",
    "The Republican primary election is set to take place on May 24.",
    "Source: AP Photo/John Bazemore\nGeorgia Republican Gov."
  ]
}