{
  "id": 1243,
  "mediaId": 65,
  "date": "3/8/2022 12:00:00 AM",
  "headline": "Fox News Poll: Kemp leads Perdue in Georgia's GOP primary race for governor",
  "image": "https://a57.foxnews.com/cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/496f0650-1d8b-4193-b9c3-1a2bee20f7a1/2904d5e1-7580-4d85-8001-0ba1679ff215/1280x720/match/931/524/image.jpg?ve=1&tl=1",
  "link": "https://www.foxnews.com/official-polls/kemp-leads-perdue-georgias-gop-primary-race-governor",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2095,
    815,
    815,
    1147,
    1147,
    1312,
    1312,
    1646,
    1646,
    200,
    200,
    428,
    428,
    2672,
    2672
  ],
  "sentences": [
    "Conducted March 2-6, 2022 under the joint direction of Beacon Research (D) and Shaw & Company Research (R), this Fox News Poll includes telephone interviews (landline and cellphone) with live interviewers among 914 Georgia Republican primary voters and has a margin of sampling error of plus or minus three percentage points.",
    "CLICK HERE FOR TOPLINE AND CROSSTABS RESULTS\nWhen it comes to what issues are important to voters regarding their Senate pick, most say economic issues (93% extremely or very important), followed by immigration issues (86%), social issues (75%), and in a distant last place are COVID-19 policies (54%).",
    "\"There is more energy and interest in the election among voters who are favorable towards Trump, but that does not appear to be enough to propel Perdue to victory,\" says Democrat Chris Anderson who conducts the Fox News poll with Republican Daron Shaw.",
    "\"When you look at the issues and the vote preferences, there is a slight wrinkle in Georgia: Republican primary voters are focused on the economy and immigration, which should benefit candidates from the Trump wing of the party,\" says Shaw.",
    "GEORGIA GOP GUBERNATORIAL CLASH: KEMP USES TRUMP'S PAST WORDS TO TARGET PERDUE\nInterest in the election is high: Over 8 in 10 GOP primary voters are \"extremely\" (54%) or \"very\" (28%) interested.",
    "Most demographic groups break for Kemp, although support splits among very conservative voters (45% Kemp vs. 45% Perdue), White evangelical Christians (47%-44%), and rural voters (45%-45%).",
    "Roughly two-thirds of each candidate's supporters are certain they will back their candidate in the May primary (65% for Kemp and 63% for Perdue), while a third might change their mind.",
    "Last September, Trump backed Walker in the Georgia Senate race and voters with a favorable view of Trump are twice as likely to support Walker as those with an unfavorable opinion.",
    "Among Republican primary voters who have a strongly favorable opinion of Trump, 87% plan to definitely vote in the May 24 primary and 65% are extremely interested in the election.",
    "Randomly selected from a statewide voter file of registered Georgia voters, respondents were screened to identify potential participants in the Republican primary elections.",
    "However, that isn't because women are supporting other candidates -- twice as many women (21%) as men (11%) are undecided about their pick in the Senate primary.",
    "Senator is clearer: Herschel Walker, 1982 Heisman trophy-winning running back from the University of Georgia, is far ahead of his opponents with 66% support.",
    "Among the subgroup of those with a strongly favorable opinion of the former president, sentiments shift in Perdue's favor: 39% to Kemp and 52% for Perdue.",
    "Current Agriculture Commissioner of Georgia, Gary Black, comes in a distant second at 8%, and all other candidates receiving 6% combined.",
    "Over a year after narrowly losing re-election to the U.S. Senate from Georgia, David Perdue finds himself trailing Gov.",
    "Kemp receives 50%, while Perdue, whom former President Donald Trump endorsed, garners 39% among GOP primary voters.",
    "Almost 7 in 10 GOP primary voters view both Kemp (68% favorable-28% unfavorable) and Perdue (66%-26%) favorably.",
    "While Walker has a wide lead, there is a gender gap: 60% of women prefer the gridiron star vs. 73% of men.",
    "\"And you see this with Walker, but Kemp -- so far -- is holding off Perdue in the gubernatorial contest.\"",
    "He trails far behind, however, among those who view Trump unfavorably: 70% Kemp vs. 15% Perdue.",
    "That's according to a new Fox News Poll of Georgia Republican primary voters, released Tuesday.",
    "Trump is more popular, but he has not been able to leverage his standing to diminish Kemp's.\"",
    "Eight in ten view Trump favorably (79%) with 57% having a \"strongly\" favorable opinion.",
    "Extremely interested voters break for Perdue by 7 points (49% Perdue-42% Kemp).",
    "\"The problem for Perdue, and Trump, is that Kemp remains broadly popular.",
    "Brian Kemp by 11 points in the Republican gubernatorial primary contest.",
    "Ten percent are unsure or would vote for someone else.",
    "The picture in the Republican primary for U.S.",
    "Two in ten view him negatively (19%).",
    "Sixteen percent are unsure."
  ]
}