{
  "id": 1254,
  "mediaId": 1576,
  "date": "3/8/2022 12:00:00 AM",
  "headline": "Stacey Abrams qualifies for 2022 run for governor in Georgia",
  "image": "https://www.wabe.org/app/uploads/2022/03/AP22067719242402-336x189.jpg",
  "link": "https://www.wabe.org/?p=244194",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    815,
    1646,
    1951,
    2095,
    4325,
    146,
    428,
    2672
  ],
  "sentences": [
    "Four years later, she is entering the contest as a national political titan widely credited for helping swing Georgia to the Democratic column in the presidential election for the first time since 1992 and for shifting control of the Senate to Democrats after two runoff victories.",
    "Sadly, those are still the issues we need to focus.?\nAbrams mentioned Medicaid seven times in her brief remarks, underlining the proposed expansion of health insurance coverage as the centerpiece of her and most other Georgia Democrats' platforms in 2022.",
    "When I ran for governor in 2018, I ran on a platform of opportunity for all wanting to ensure that we expand Medicaid, that we fully and permanently fund education, that we build economic development plans that work for every Georgian,? she said.",
    "Democrat Stacey Abrams became the biggest name so far to qualify to run for Georgia governor Tuesday, saying she is trying again to do what's right for Georgia? after losing narrowly to Republican Brian Kemp in 2018.",
    "Among Republicans, football great Herschel Walker tops a field of contenders including Agriculture Commissioner Gary Black, Navy veteran and banker Latham Saddler, contractor Kelvin King and state Rep. Josh Clark.",
    "Kemp spokesperson Tate Mitchell said government mandates would rule the everyday lives of Georgia families? if Abrams had won in 2018 and pledged that Kemp would block her ambitions to be governor or president.",
    "The 48-year-old Abrams was a state lawmaker with little profile outside Georgia when she began her 2018 race for governor, looking to become the state's first Black and first female governor.",
    "Kemp is seeking an expansion that would cover fewer people, which President Joe Biden's administration has refused to approve in part because it requires recipients to work or attend school.",
    "Kemp is approaching the conversation on Medicaid should not be sustainable and it should be rejected by every Georgia who believes in the people of Georgia,? Abrams said.",
    "Seven other statewide offices, two Public Service Commission posts, 14 congressional seats, 56 state Senate seats and 180 state House seats are also on the ballot.",
    "Republican Butch Miller of Gainesville is running for lieutenant governor while Democrat Jen Jordan of Sandy Springs is running for attorney general.",
    "On the federal level, U.S. Sen. Raphael Warnock so far has only little-known Democratic primary opposition as he seeks to win a full six-year term.",
    "The party primary election is May 24, with party runoffs on June 21 if needed, followed by the general election on Nov. 8.",
    "But Abrams told reporters after signing her qualifying papers that the issues she is focusing on haven't changed.",
    "Kemp's reelection is being challenged in his own party by former U.S. Sen. David Perdue and other Republicans.",
    "Abrams announced her run in December and does not yet have any declared Democratic opposition.",
    "Kemp and Perdue plan to qualify later this week, before ballots are set Friday.",
    "Others qualifying Tuesday included two state senators seeking statewide office.",
    "The meanness and callousness with which Gov."
  ]
}