{
  "id": 1273,
  "mediaId": 195,
  "date": "3/3/2022 12:00:00 AM",
  "headline": "Kemp drops millions on ad buy ahead of Georgia primary",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/article_images/kempbrian_120419_ap_elijah_nouvelage.jpeg?itok=yMoh3pXD",
  "link": "https://thehill.com/homenews/campaign/596688-kemp-drops-millions-on-ad-buy-ahead-of-georgia-primary",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1646,
    1951,
    2095,
    4325,
    428,
    2672
  ],
  "sentences": [
    "This initial ad buy will allow our campaign to share Governor Kemp's strong, conservative record of fighting  and winning  for hardworking Georgians with voters across our state, while also making sure [Democratic candidate] Stacey Abrams will never be our next governor or our next president,? Kemp's campaign manager Bobby Sparrow said in a statement.",
    "Perdue launched his campaign in December at the urging of Trump, who committed himself to campaigning against Kemp after the Georgia governor rebuffed the former president's pleas to overturn the results of the 2020 presidential election in the Peach State.",
    "The Republican primary brawl has raised concerns among some in the GOP that the fighting could leave the eventual nominee damaged and drained heading into the general election campaign later this year.",
    "The seven-figure ad buy is the largest yet in the GOP primary for Georgia governor, a bitter race that is seen as a key test of former President Trump's sustained influence over Republican voters.",
    "Brian Kemp is dropping $4.2 million on television ads ahead of his May 24 primary against former Sen. David Perdue (R-Ga.), his campaign announced on Thursday.",
    "What's more, Kemp's campaign is billing the investment as an initial buy, holding out the possibility that it could spend even more before the primary.",
    "Put in context, Kemp's campaign is spending more than four times the amount that Perdue's campaign had on hand at the end of January.",
    "Kemp responded in kind, putting out his own ad spot accusing Perdue of offshoring American jobs throughout his business career.",
    "In his first campaign ad, Perdue brought in Trump to tout his endorsement of the former Georgia senator and attack Kemp.",
    "Abrams was previously the party's nominee in 2018, when she narrowly lost the general election to Kemp.",
    "The first spots will begin running statewide on March 30, according to the campaign.",
    "Democrats, meanwhile, have coalesced around Abrams as their gubernatorial nominee.",
    "Since then, Perdue and Kemp have sparred mercilessly for the GOP nod.",
    "The ad buy is enormous.",
    "Georgia Gov."
  ]
}