{
  "id": 1274,
  "mediaId": 237,
  "date": "d2022-03-03T11:08",
  "headline": "Brian Kemp places $4.2 million ad buy in bid to fend off challenger David Perdue",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/171d1ef/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2F64%2F41%2Fa0080964490e80d6a7d553f4b8fe%2Fap-18164753054862.jpg",
  "link": "https://www.washingtonexaminer.com/news/campaigns/brian-kemp-places-4-2-million-ad-buy-in-bid-to-fend-off-challenger-david-perdue",
  "sentiment": "-0.316",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-m-drucker",
  "termIds": [
    1147,
    2087,
    2095,
    2230,
    4325,
    146,
    428,
    2672
  ],
  "sentences": [
    "\"The polls, fundraising, and grassroots support all make it abundantly clear that Brian Kemp is the only Republican candidate for governor who can win in May and again this November,? Kemp campaign manager Bobby Saparow said in a statement.",
    "But recent polling in the primary contest suggests that Kemp is getting the better of that debate, possibly because there does not appear to be evidence to support the claims made by Trump and Perdue.",
    "Perdue similarly claims Kemp is responsible for his defeat, asserting that the governor did not take actions to clamp down on voter fraud in Georgia that he claims swung the last election.",
    "Brian Kemp unveiled what his reelection campaign is calling an initial? advertising buy as the Republican incumbent moves to fend off a primary challenge from former Sen. David Perdue.",
    "The Kemp campaign announced Tuesday the governor would blanket Georgia airwaves with a $4.2 million ad buy beginning March 30 and running through the state's May 24 primary election.",
    "The governor has amassed more resources than Perdue, helping him to weather the opposition of former President Donald Trump, who has endorsed the ex-senator  at least so far.",
    "The former senator said he expects Trump to help him turn the campaign around when he visits the state for a campaign rally anywhere from late April to mid-May.",
    "Perdue recently told the Washington Examiner that making sure Republican primary voters know that Trump has endorsed him is critical to his prospects.",
    "The governor is certainly raising more money for his campaign and locking down more support from the Republican establishment in Georgia than Perdue.",
    "Trump, who blames Kemp for his loss to President Joe Biden in Georgia in 2020, recruited Perdue to challenge the governor in the midterm elections.",
    "The purchase was described in a press release as an initial placement,? suggesting more advertising forthcoming.",
    "Perdue was ousted by current Sen. Jon Ossoff, a Democrat, in a Jan. 5, 2021, runoff.",
    "We're trying to get that message out around the state right now.",
    "1 challenge, is to make sure everybody knows that.?",
    "The day I announced, he endorsed us.",
    "That's the huge part,? Perdue said.",
    "That's our No.",
    "Georgia Gov."
  ]
}