{
  "id": 1276,
  "mediaId": 1576,
  "date": "3/3/2022 12:00:00 AM",
  "headline": "Georgia cityhood push divides: White flight or self-rule?",
  "image": "https://www.wabe.org/app/uploads/2022/03/AP22061590898068-336x189.jpg",
  "link": "https://www.wabe.org/?p=241982",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1344,
    1470,
    1656,
    1899,
    1951,
    2095,
    2555,
    2617,
    2672
  ],
  "sentences": [
    "Cobb County and other nearby suburban areas owe their massive population growth in part to an exodus of white residents from the city of Atlanta during the 1960s and '70s over concerns about the civil rights movement and desegregation, Princeton University historian Kevin Kruse writes in his book White Flight.? The newcomers opposed low-income housing and transit initiatives such as MARTA that they feared would connect them to Atlanta and its minority populations, Kruse says.",
    "State Rep. Ed Setzler, a Republican sponsor of the East Cobb and Lost Mountain cityhood referendums, pushed back on demographic concerns, saying at a legislative hearing in January that he would also support a referendum on cityhood for Mableton, another area of Cobb County that is mostly Black and Hispanic.",
    "Ehrhart has touted western Cobb County as a place where there are still horse farms.?\nThose arguments appear neutral on issues of race, but they have racial implications in metro Atlanta, said Michan Connor, a scholar at George Washington University who has studied cityhood efforts in the region.",
    "I think people equally oppose it because they see it as something that is a response to the changes in leadership and the party shift in the county and because our district commissioner is a young accomplished Black woman, our district chair is an accomplished Black woman,? she said.",
    "But the history of racism in Atlanta is a material factor in all of those identities.?\nCobb County has become more diverse in recent decades, with non-Hispanic white residents making up just over 51% of the population today, compared with more than 85% in 1990.",
    "Certainly some things don't quite add up.?\nGeorgia catapulted into the U.S. political spotlight in 2020 with President Joe Biden's victory in the state and the election of two Democratic senators weeks later that gave the party control of Congress.",
    "Cobb  home to the Atlanta Braves' stadium  lies about 20 miles (32 kilometers) northwest of Atlanta and is one of the most populous counties in the state, with more than 760,000 residents stretching over 340 square miles (880 square kilometers).",
    "This year's midterm elections are sure to sustain the attention, with one of the Senate seats up for grabs, former President Donald Trump roiling the GOP gubernatorial primary and Democrat Stacey Abrams running again for governor.",
    "Now, the Republican-controlled state Legislature has passed bills that would give three largely white parts of the county a chance to form their own governments during Georgia's primary elections ahead of the midterms.",
    "Many Democrats have also opposed the legislation to hold referendums on creating the three cities in Cobb  Vinings, East Cobb and Lost Mountain  and carving out the tony Buckhead area from Atlanta.",
    "Two of the cityhood efforts reflect a pattern of backlash against the election of three Black women to the Cobb commission,? said State Rep. Mary Frances Williams, a Cobb County Democrat.",
    "The county's population has grown too much to be adequately represented by a five-member commission, said Republican State Rep. Ginny Ehrhart, a sponsor of the Lost Mountain legislation.",
    "In the 2020 election, Jerica Richardson and two other Black women gave Democrats control of the commission overseeing this affluent suburban Atlanta county for the first time in decades.",
    "Maintaining the suburban character of those areas means continuing housing and transportation policies that have traditionally excluded Black people and other minorities, Connor said.",
    "Over the objections of Democrats, the state Legislature has overridden local officials to redraw district maps for county school boards and commissions, including in Cobb County.",
    "Lost Mountain in western Cobb County would have a six-member City Council for roughly 76,000 people  a population figure that would make it the 12th largest city in the state.",
    "In my conversations one-on-one, there is a deep concern about how much information is available for residents to be able to come to a decision.?\nFeb 10, 2022\nTrending",
    "On a recent Monday morning, shoppers trickled into The Avenue, an outdoor mall with a Williams Sonoma and Pottery Barn in the proposed East Cobb boundaries.",
    "Cobb County has long resisted an extension of the region's commuter train system, MARTA, with some residents citing concerns it will lead to urban growth.",
    "Supporters of the Vinings, East Cobb and Lost Mountain efforts have similarly argued that they want to preserve the suburban character of their areas.",
    "The cityhood effort there preceded the new county commission, said Cindy Cooperman, part of a group of local residents advocating for the new city.",
    "A few miles away, a sign urging voters to form the city stood on a lawn in a subdivision of million-dollar homes along the Chattahoochee River.",
    "But in the area that would become East Cobb, white residents would represent more than 70% of the population, according to county estimates.",
    "Two of them would be in Richardson's district, which GOP lawmakers have also reconfigured in a way that draws her out of her seat.",
    "Since 2005, voters have approved more than a half-dozen new cities in the region, many of them in those majority-white suburbs.",
    "Vinings and Lost Mountain would also have a significantly higher percentage of white residents than the county as a whole.",
    "Proponents of the cityhood measures say local residents need adequate representation and greater control over development.",
    "The three cities would each take over planning and zoning, code enforcement and parks and recreation from the county.",
    "Supporters of the three Cobb County city proposals say race and politics have nothing to do with their efforts.",
    "The Vinings and Lost Mountain proposals have also been signed by the governor and are set for May referendums.",
    "A bill for Mableton is pending at the state Capitol but has yet to be voted on by the full House or Senate.",
    "The county commissioner for the area represents a population of 200,000 people, according to Ehrhart.",
    "East Cobb and Vinings would also have a much smaller ratio of population to elected representatives.",
    "County officials say their $1 billion budget would take a $41 million hit if all four cities formed.",
    "Those two cities' median incomes would exceed $110,000, compared with $78,000 for the county.",
    "Seger said she thinks politics and race are factors in some people's support for a new city.",
    "I can't speak to the hearts and minds of my peers,? she said in a recent phone interview.",
    "It really is about bringing an idea to the table whose time has really come,? she said.",
    "It's a solution looking for a problem,? said Mindy Seger, with the East Cobb Alliance.",
    "The underlying principle is that people want representation close to home,? she said.",
    "Brian Kemp signed the East Cobb bill into law Feb. 15, setting up a May referendum.",
    "We would all agree that we believe in the people having a choice,? Richardson said.",
    "The new cities would take over key parts of the county's decision-making power.",
    "Opponents worry it will raise costs and reduce the quality of fire service.",
    "We want to preserve the kind of community we live in,'? he said.",
    "East Cobb would also create its own police and fire departments.",
    "But she said that reaction is also galvanizing opponents.",
    "They can say, We're homeowners, taxpayers.",
    "Some critics see race as a driving factor.",
    "But the fight for Georgia runs deeper.",
    "Richardson was more circumspect.",
    "Gov."
  ]
}