{
  "id": 1278,
  "mediaId": 1576,
  "date": "3/3/2022 12:00:00 AM",
  "headline": "Kemp says he'll spend millions against Perdue in Georgia",
  "image": "https://www.wabe.org/app/uploads/2022/03/AP22062776522879-336x189.jpg",
  "link": "https://www.wabe.org/?p=242111",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1646,
    1731,
    1951,
    2095,
    4325,
    428,
    2661,
    2672
  ],
  "sentences": [
    "Kemp's leadership committee, called Georgians First, raised $2.3 million and spent $1.7 million before the judge shut the tap with a preliminary injunction after Perdue sued, claiming it was unfair because Perdue didn't have access to such a committee.",
    "Earned media is just like gold.?\nPerdue has argued that he's better positioned to beat Abrams because there's a faction of Republicans angry at Kemp for not doing enough to overturn Democratic President Joe Biden's 2020 victory in Georgia.",
    "The polls, fundraising, and grassroots support all make it abundantly clear that Brian Kemp is the only Republican candidate for governor who can win in May and again this November,? Campaign Manager Bobby Saparow said in a statement.",
    "A legal challenge did even the score somewhat when a federal judge ordered Kemp not to spend money from a special leadership committee, which under state law can collect unlimited contributions even during the legislative session.",
    "That's the maximum combined contribution for up to four elections in Georgia this year, including $7,600 for both the party primary and general election and $4,500 for potential primary and general election runoffs.",
    "Both Kemp and Perdue have been trying to position themselves as the Republican most likely to beat Democrat Stacey Abrams, who has no declared opposition in her party.",
    "Perdue has been trying to capitalize on that plan in part by amplifying Trump's unfounded accusations that Georgia's 16 electoral votes were stolen from him.",
    "The incumbent reported having $12.7 million in his main campaign account as of Jan. 31, while Perdue had less than $1 million in cash on hand.",
    "An invitation posted online shows attendees must pay $3,000 a head, while anyone who wants a photo with Trump must donate $24,200.",
    "Brian Kemp's campaign says it will spend at least $4.2 million on TV ads until his May 24 GOP primary against former U.S.",
    "Incumbents are barred from raising money for their personal campaign accounts while the General Assembly is meeting.",
    "The announcement underlines how far ahead Kemp is in raising funds seeking to block Perdue from unseating him.",
    "Perdue is betting that his support from former President Donald Trump can overcome his monetary disadvantage.",
    "Senator David Perdue and others, bidding to leverage his financial advantage against his top challenger.",
    "He argues that news coverage of Trump's advocacy for Perdue can overcome any financial disadvantage.",
    "Randy Evans, an Atlanta lawyer and Trump's former ambassador to Luxembourg, is backing Perdue.",
    "She raised $9.25 million after entering the race only a few days ahead of Perdue in December.",
    "Trump has scheduled a March 16 fundraiser for Perdue at Trump's Mar-A-Lago club in Florida.",
    "He called the money to be spent now and until the primary an initial? ad buy.",
    "A Perdue spokesperson did not respond Thursday to a request for comment.",
    "The earned media from Trump just changes the dynamic,? Evans said.",
    "Georgia Gov."
  ]
}