{
  "id": 1279,
  "mediaId": 19,
  "date": "3/3/2022 12:00:00 AM",
  "headline": "Georgia Poll: Kemp Holds Lead over Perdue in Governor's Race; Herschel Walker Dominates Senate Primary",
  "image": "https://media.breitbart.com/media/2022/02/GettyImages-1058497456-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/03/03/georgia-poll-kemp-holds-lead-perdue-governors-race-herschel-walker-dominates-senate-primary/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    815,
    984,
    1147,
    1154,
    1435,
    1462,
    1646,
    2095,
    2250,
    2355,
    2389,
    3082,
    182,
    600,
    2557,
    2672,
    2894,
    2934
  ],
  "sentences": [
    "Walker, who is currently in a comfortable position to win his primary, recently spoke out about the contentious gubernatorial primary battle, saying he was mad at both? Kemp and Perdue and concerned that bitter campaign fighting could prove so divisive that it ends up thwarting Republicans' chances of defeating the Democrat candidate, voting rights activist Stacey Abrams, in the general election.",
    "Trump quickly announced his endorsement of Perdue when Perdue entered the race in December and sought to strengthen Perdue's position in the race by urging Democrat-turned-Republican Vernon Jones, a former state representative, to drop out of the gubernatorial primary and instead compete in a congressional race.",
    "Usually, that signals a potential upset for the incumbent.?\nThe poll also weighed the primary field for the Senate race, which is poised to become an expensive battleground general election contest between incumbent Sen. Raphael Warnock (D-GA) and the leading Republican candidate, Herschel Walker.",
    "While Perdue appears to be lagging at this stage of the primary, with a little under three months to go until race day, InsiderAdvantage noted that the one bit of good news for Perdue is that Kemp, as an incumbent governor, continues to remain under fifty percent in the polls.",
    "The primary race is being closely watched across the country largely because former President Donald Trump has drawn attention to it by repeatedly voicing his desire to unseat Kemp because of Trump's disapproval of Georgia's 2020 election process.",
    "While Walker's lead has seen a reduction from roughly 80 percent to 70 percent to now 63 percent in the InsiderAdvantage poll, Black continues to poll in the single digits, receiving six percent in the latest poll.",
    "A Quinnipiac poll conducted in January showed Kemp with a seven-point edge over Perdue, and a Trafalgar survey taken in February had the governor at a ten-point advantage over his opponent.",
    "Three percent of respondents backed right-wing candidate Kandiss Taylor, who remains in a distant third place, and another 15 percent said they were undecided or had no opinion.",
    "Brian Kemp continues to hold a modest lead over former Sen. David Perdue in the heated Republican primary race for governor in Georgia, according to a poll published Thursday.",
    "Walker, a former football legend and household name in Georgia, has continued to hold outsize leads over his closest Republican opponent, Agriculture Commissioner Gary Black.",
    "The poll, conducted February 28 to March 1 by Fox5 Atlanta/InsiderAdvantage, showed Kemp leading Perdue by nine points, 44 percent to 35 percent.",
    "It's time for you to stop having sour grapes and think about this party.?\nWrite to Ashley Oliver at aoliver@breitbart.com.",
    "We've got to bring this party together,? Walker said during a recent appearance at the University of North Georgia.",
    "Jones did so on February 7 and received Trump's coveted endorsement for his congressional bid just two days later.",
    "What has happened now is some people get sour grapes, and they don't get out and vote,? Walker continued.",
    "Kemp or Sen. Perdue, he needs to tell his people to go out and vote for the other.",
    "Kemp's lead is consistent with that of two other recent polls.",
    "And I want to say whoever loses that race, whether it's Gov.",
    "Follow her on Twitter at @asholiver.",
    "Gov."
  ]
}