{
  "id": 1289,
  "mediaId": 1576,
  "date": "3/1/2022 12:00:00 AM",
  "headline": "Judge allows new Georgia political maps to be used this year",
  "image": "https://www.wabe.org/app/uploads/2020/11/voters.111020-scaled.jpg",
  "link": "https://www.wabe.org/judge-upholds-new-georgia-political-maps-for-this-year/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    964,
    2058,
    2095,
    428,
    2537,
    2672
  ],
  "sentences": [
    "In his order, Jones cautioned that this is an interim, non-final ruling that should not be viewed as an indication of how the Court will ultimately rule on the merits at trial.?\nUnder the specific circumstances of this case, the Court finds that proceeding with the Enacted Maps for the 2022 election cycle is the right decision.",
    "U.S. District Judge Steve Jones' ruling came late Monday after a hearing last month that lasted six days in three lawsuits challenging the newly drawn districts that were crafted by state lawmakers and signed into law last year by Republican Gov.",
    "In a similar challenge to new maps in Alabama, the U.S. Supreme Court last month put on hold a lower court ruling that said the state must redraw its congressional districts before the 2022 elections to increase Black voting power.",
    "The three-judge lower court said in its unanimous ruling in late January that the groups of voters who had sued over Alabama's maps were likely to succeed in showing the state had violated the Voting Rights Act.",
    "The lawsuits, filed by African American organizations and individual voters, allege the maps weaken the growing electoral strength of communities of color in violation of the federal Voting Rights Act.",
    "A federal judge has ruled Georgia's new congressional and state legislative maps can be used for this year's election cycle, saying there is not enough time to make changes before the primary.",
    "In halting that ruling, Justices Brett Kavanaugh and Samuel Alito, part of the conservative majority, said the lower court's order for a new map came too close to the 2022 election cycle.",
    "The plaintiffs had filed motions for preliminary injunction seeking, among other things, to keep the state from using the new maps during any elections, including this year's midterms.",
    "And it is a decision the Court did not make lightly,? Jones wrote.",
    "Alabama's primary is set for May 24, like Georgia's.",
    "But it is a difficult decision.",
    "Brian Kemp."
  ]
}