{
  "id": 1301,
  "mediaId": 1576,
  "date": "2/28/2022 12:00:00 AM",
  "headline": "Georgia Senate passes bill ending gun license requirement",
  "image": "https://www.wabe.org/app/uploads/2022/02/AP22059715672382-336x189.jpg",
  "link": "https://www.wabe.org/?p=240773",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    674,
    1646,
    2095,
    2313,
    4325,
    232,
    428,
    600,
    2555,
    2672
  ],
  "sentences": [
    "But we're doing the opposite.?\nSen. Nan Orrock, an Atlanta Democrat, suggested those who voted for the bill would have blood on their hands because the legislation would continue the bloody trail of people injured and killed with gun violence here in our state.?\nThe bill would do away with the need for a license to carry a handgun in public  either openly or concealed on one's body.",
    "Republican Sen. Chuck Payne of Dalton, another bill sponsor, recalled flashing his pistol when his family was approached by men who appeared high during a camping trip in eastern Georgia and wondered what would have happened if he had been unable to afford the fee for a gun permit.",
    "Georgia currently requires people to obtain a license to carry a loaded handgun outside their own homes, businesses or cars, although people can carry rifles and shotguns in many places without a permit and carry unloaded guns in cases.",
    "Rep. Rick Jasperse, a Republican from Jasper, said churches would be treated like other private property owners, meaning they would have to post signs to keep people from carrying in guns and ask people who had guns to leave.",
    "The measure would also allow probate judges to renew weapons carry licenses online and by mail and would let people sue if anyone created a multi-county database of people who apply for weapons carry licenses.",
    "The Georgia Senate passed a Republican-backed bill Monday that would do away with the need for a license to carry a handgun in public  eliminating a current background check requirement.",
    "Democratic Sen. Elena Parent of Atlanta said the bill advanced the agenda of extremist gun groups? and was among a slew of measures on wedge issues? that were being pushed this year.",
    "Convicted felons and people who have been hospitalized for mental health problems or received treatment for drugs or alcohol in the years preceding the application are not eligible.",
    "Sen. Jason Anavitarte of Dallas, a Republican sponsor of the so-called constitutional carry legislation, said criminals were unlikely to go through the state's permit process.",
    "It would not protect crime victims, she said, citing the school shooting in Parkland, Florida, and last year's slayings at three Atlanta-area massage businesses.",
    "He says Georgia residents should have their constitutional rights protected and be able to protect themselves and their families amid a spike in violent crime.",
    "Democrats said the measure would fuel gun deaths and proposed an amendment that would expand background checks, but the GOP-controlled Senate defeated it.",
    "Democratic Sen. Michelle Au of Johns Creek proposed an amendment that would extend background checks to more gun sales, including those at gun shows.",
    "More than 20 other states allow concealed weapons in public without a permit, according to Stateline, an initiative of the Pew Charitable Trusts.",
    "Also Monday, a House Public Safety & Homeland Security subcommittee passed House Bill 1358, its version of the Senate bill, with little debate.",
    "To obtain a weapons license, state residents must submit an application and fee and undergo fingerprinting in addition to a background check.",
    "Republicans have argued the bill would remove an unnecessary burden on people seeking to exercise their Second Amendment rights.",
    "The subcommittee also passed House Bill 1378, which would remove Georgia's legal prohibition against carrying guns in churches.",
    "It would require counties and cities to sell seized guns at least once a year, and let people sue if they didn't.",
    "Monday's vote was preceded by a lengthy debate that included familiar arguments about gun rights and safety.",
    "It would also prevent authorities from barring the sale of guns and ammunition during a state of emergency.",
    "Officials also couldn't close gun-related businesses during an emergency unless they closed all businesses.",
    "Other Republicans pushed back on concerns of violence, saying the guns themselves were not to blame.",
    "Facing a primary challenge from Republicans including former U.S. Sen. David Perdue, Georgia Gov.",
    "Ask yourselves, What would a Ukrainian citizen say about their right to take up and bear arms?",
    "Current requirements limit such checks to transactions at federally licensed gun dealers.",
    "Opponents and supporters also cited recent violence, including the invasion of Ukraine.",
    "Senate Bill 319 passed 34-22 along party lines and now goes to the state House.",
    "Today, we empower good people, law-abiding people,? Anavitarte said.",
    "Republican Sen. Matt Brass of Newnan cited the invasion of Ukraine.",
    "We know what we need to do to protect our communities,? she said.",
    "What would have been the outcome that day?? he asked.",
    "The amendment was also rejected by a vote of 34-22.",
    "Associated Press writer Jeff Amy contributed.",
    "Violators could be charged with trespassing.",
    "Brian Kemp has backed the revocation.",
    "'? Brass said."
  ]
}