{
  "id": 1309,
  "mediaId": 237,
  "date": "2/24/2022 12:00:00 AM",
  "headline": "The devolution of David Perdue",
  "image": "https://mediadc.brightspotcdn.com/dims4/default/9de7498/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=http%3A%2F%2Fmediadc-brightspot.s3.amazonaws.com%2Fba%2F21%2F133f9bfb4a7fa34eba2f8aeeb1af%2Fwb.campaign.jpg",
  "link": "https://www.washingtonexaminer.com/politics/the-devolution-of-david-perdue",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Haisten Willis",
  "authorUrl": "https://www.washingtonexaminer.com/author/haisten-willis",
  "termIds": [
    973,
    1147,
    1391,
    1636,
    1646,
    1951,
    1957,
    2095,
    4325,
    501,
    2672
  ],
  "sentences": [
    "CNN's John Harwood\nThe hot takes trying to pin the blame on former President Donald Trump for Vladimir Putin and Russia's invasion of Ukraine are bad enough, but shouldn't we expect a little more from the organization that bills itself \"the most trusted name in news?\"",
    "Now, the American Civil Liberties Union pushing for a government mandate is dim enough, but where was the ACLU when schools were actually closed, leaving vulnerable students in the lurch causing untold damage to students most at-risk without in-person instruction?",
    "and U.S. Secretary of Agriculture Sonny Perdue, branded himself a \"political outsider,\" besting Rep. Jack Kingston and five other challengers in the Republican primary before defeating Michelle Nunn to win a Georgia U.S. Senate seat.",
    "His latest disclosures show less than $900,000 in the campaign's coffers, compared to $12.7 million for Kemp, while a Trafalgar poll showed Kemp with 49% support from likely Republican voters, compared to 40% for Perdue.",
    "Now out of office and running for Georgia governor, Perdue is placing his hopes on an endorsement from former President Donald Trump, arguably the man most responsible for his Senate reelection defeat two years ago.",
    "Perdue owes his challenger status in part to Trump's actions in the 2020 cycle, when Trump wouldn't stop claiming the election was stolen, even while Perdue fought a runoff against Jon Ossoff.",
    "On Twitter, Harwood said, \"The Russian thug now attacking Ukraine helped Donald Trump become president because he thought that would some day make this kind of attack easier to pull off.",
    "\"It was somewhat of an amazing experience, the right candidate at the right time running for the right office,\" said Alec Poitevint, who chaired Perdue's 2014 and 2020 Senate bids.",
    "It's all a far cry from the 2014 Perdue, who knifed through a seven-person primary field that included four members of Congress with his \"outsider\" messaging and a down-home look.",
    "On his first day of office, Youngkin signed an executive order doing just that and after some legal challenges, signed a law passed by the legislature removing the mandate.",
    "Given the vast differences between 2014 and 2022 in Georgia, the nation, and Perdue personally, that magic may prove impossible to recapture ahead of the May 24 primary.",
    "Dim Bulbs of The Week\nThe ACLU of Virginia\nWhen Glenn Youngkin was a candidate for Governor in Virginia, he promised to make masking in public schools, optional.",
    "The ACLU filed suit on behalf of parents of children with cancer, cystic fibrosis, asthma, Down syndrome, and diabetes, saying the lack of a mandate hurts them.",
    "Harwood would have us believe that it was all part of Putin's plan, starting in 2015, to get Trump elected, thereby making it easier to invade Ukraine in 2022.",
    "\"I had thought better of him, that he would not allow himself to be used,\" said Bob Barr, a former congressman from Georgia and the chairman of Liberty Guard.",
    "\"Going against a well-liked governor in Brian Kemp, who has by all objective accounts done a great job for Georgia, it strikes people as odd,\" said Barr.",
    "Most of Georgia's state Legislature and GOP establishment, as well as the Republican Governors Association, have also thrown their support behind Kemp.",
    "Perdue and Abrams have teamed up to fight a Kemp-backed bill that would prevent them from fundraising during the state's 40-day legislative session.",
    "We had competition from some very fine candidates, and somehow, we were fortunate to make the runoff, win it, and win the general election.\"",
    "\"Perdue can't change who he is, how he campaigns, what he thinks, why he's running, the doubts that people have in their minds,\" said Barr.",
    "Well, I got outspent in 2014 by the same amount,\" he said during a recent campaign stop, according to the Atlanta Journal-Constitution.",
    "Perdue was the CEO of Reebok and Dollar General before entering politics but is slumping through a primary challenge to Georgia Gov.",
    "Instead, the race may be the ultimate test of Trump's continued GOP influence and how much voters back his 2020 election grievance.",
    "The challenger's only bright spot: About 40% of voters did not know Trump had endorsed Perdue, but those who did know favored him.",
    "Last fall, Trump mused during a rally near Perdue's hometown that Abrams \"might be better than having your existing governor.\"",
    "The other reason is that Perdue doesn't seem to have his heart in it, Barr argues, in sharp contrast to his 2014 Senate run.",
    "Even Sonny Perdue has remained neutral, as has Georgia football legend and Republican Senate candidate Herschel Walker.",
    "Trump remains furious at Kemp for refusing to entertain his election fraud claims, spurring the Perdue endorsement.",
    "Kemp owes his incumbent status mainly to a 2018 Trump endorsement that pushed him past former Georgia Lt. Gov.",
    "Just In...\nA jean jacket and a clever message helped carry a very different David Perdue to victory in 2014.",
    "\"He had a vision, could perform the duties of the office, and had the background that I thought was right.",
    "I elected to support Brian, and I believe he will win the primary and be elected to governor of Georgia.\"",
    "The latter needs to hold off the challenge and defeat Democratic star Stacey Abrams to win a second term.",
    "\"The big unknown is whether or not Trump's presence or endorsement will help him late in the campaign.",
    "As a result, Ossoff triumphed, becoming the first Democrat to win a Georgia Senate seat in 20 years.",
    "The ACLU said that without universal masking, Youngkin \"effectively barred the schoolhouse door.\"",
    "\"It's almost as if he was pushed into this against his better judgment by the former president.\"",
    "Despite the once-bulletproof Trump endorsement, Perdue's campaign seems to be floundering.",
    "\"David and [his wife] Bonnie Perdue remain very good friends of my wife and family.",
    "That's part of the reason his campaign doesn't seem to be getting much traction.\"",
    "Thus, a theoretical late surge of campaigning from Trump could make a difference.",
    "\"They said, 'Oh, we've got $13 million, and David's only got $1 million.'",
    "\"I saw no reason for David to be running for governor,\" said Poitevint.",
    "Perdue's critics say Abrams will be the biggest beneficiary of his run.",
    "\"When you start a campaign and people say, 'Why are you running?'",
    "Perdue will have a tough time selling himself as an outsider.",
    "Perdue himself cites his 2014 success in attacking critics.",
    "That's a level of chess even Gary Kasparov couldn't win.",
    "\"This is an election about people versus politicians.\"",
    "This is something in which I had a different opinion.",
    "Perdue, the first cousin of former Georgia Gov.",
    "But Poitevint is backing Kemp this time out.",
    "Casey Cagle in that cycle's GOP primary.",
    "I don't see it being a game changer.\"",
    "The dynamics are twisted all around.",
    "He was right in the short term.\"",
    "it doesn't make sense.",
    "The tangle continues.",
    "They are fine people.",
    "Or maybe not.",
    "Brian Kemp.",
    "Nowhere.",
    "Wow."
  ]
}