{
  "id": 1312,
  "mediaId": 237,
  "date": "2/24/2022 12:00:00 AM",
  "headline": "Republican primaries shaping up as big test for Trump clout",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/960317.png",
  "link": "https://www.washingtonexaminer.com/news/republican-primaries-shaping-up-as-big-test-for-trump-clout",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "",
  "termIds": [
    2095
  ],
  "sentences": [
    "A loss in any number of primaries would be a sign that Trump is not as omnipotent as once thought, which might give those Republican activists and elected officials interested in creating some distance between the former president and the party the confidence they have been lacking to push back  which brings us back to the GOP gubernatorial primary in Georgia.",
    "Even if the former president's endorsement record did take a hit this year and several Republicans with his backing ran aground, few, if any, GOP operatives believe such a development would materially diminish his authority inside the party, in part because of his strong relationship with conservative voters.",
    "The former president is not just endorsing in races for the House, the Senate, and governor's mansions  he also is active in campaigns for seats in state legislatures and state constitutional offices, such as secretary of state and state attorney general.",
    "Trump has made it personal,? said a Republican media consultant in Washington who, like most others interviewed for this story, requested anonymity to speak candidly for fear of incurring the former president's wrath or causing problems for their clients.",
    "The former president has made his unsupported claims about the last election the centerpiece of his pitch to oust the governor in the next election, going so far as to cut a television advertisement talking straight to the camera for Perdue.",
    "The culprits, this operative said, are the various Republican professionals in Trump's inner circle who used their relationship with him to secure his endorsement for their clients or candidates they are otherwise supporting.",
    "If he survives, I think you'll see a lot of other Republicans being more willing to stand up to Trump.?\nA Trump spokesman acknowledged a request for comment by the Washington Examiner but had not provided one at press time.",
    "Just In...\nFormer President Donald Trump is sure to emerge from the 2022 primary season with a winning record among the dozens of Republicans he has endorsed for elective office in nominating contests across the country.",
    "In Arizona, Trump endorsed Kari Lake for governor, but her leading opponents are not positioning themselves as anti-Trump.? But not every GOP primary offers Trump an easy way out should his preferred contender lose.",
    "At worst, say some Republican insiders critical of Trump's endorsement strategy, the defeat of his candidates would reflect a sloppy endorsement process? on the part of the former president and his political team.",
    "If Kemp pulls it off, I think that would embolden the time to move on' part of the party and would cause Trump some real pain,? said a Republican strategist based in a Rust Belt battleground state.",
    "For example, Trump is on a mission to oust House Republicans who voted to impeach him in January 2021 and is targeting others who voted for Biden's bipartisan infrastructure bill later that year.",
    "That's what might unfold in the race for the Republican nomination for Senate in Alabama, where candidate Katie Britt has been courting Trump despite his early endorsement of Rep. Mo Brooks.",
    "It won't matter a lick if the challenger Trump is backing for governor in Georgia, former Sen. David Perdue, falls to incumbent chief executive Brian Kemp in the state's May 24 primary.",
    "Lose this one, and Republicans inclined to stiff-arm Trump will feel emboldened to do so, leaving him a less influential figure in the party  even if he runs the table everywhere else.",
    "People are going to continue to seek his endorsement no matter how those races go because he still has Midas touch with low-dollar donors,? a veteran Republican strategist explained.",
    "There, as in many other states selecting nominees for local, state, and federal office over the next six months, several Republicans are running under Trump's banner.",
    "If a pro-Trump candidate defeats an endorsed-Trump candidate, it would hardly represent a rejection of the former president, who will likely declare victory anyway.",
    "Trump-endorsed candidates have lost nominating contests before without costing the former president the least bit of the immense prestige he enjoys inside the GOP.",
    "Few, if any, Republican insiders expect Trump's near pristine record of endorsing winning primary candidates to be upended with massive losses in these contests.",
    "For example, should Trump run for president again in 2024, he will be the clear favorite to win the nomination, regardless of his 2022 endorsement record.",
    "The former president has made some primary campaigns personal, branding the candidates he opposes as GOP apostates who oppose him personally.",
    "Ditto for those senators, like Alaska's Lisa Murkowski, who later voted to convict him on impeachment charges at trial in the Senate.",
    "Pat McCrory, who is running for Senate in the Tar Heel State against Rep. Ted Budd, who has the former president's backing.",
    "Trump recruited Perdue to take on Kemp, whom he blames for his loss in Georgia at the hands of President Joe Biden in 2020.",
    "As strong as President Trump is, there's this side of him that will trust some people too much,? the operative explained.",
    "There are people close to him worried he has extended himself too much on these endorsements,? a GOP operative said.",
    "Besides, even many of the candidates Trump spurned are supporters and running as carriers of his legacy and agenda.",
    "Still others Trump simply does not like and has labeled unacceptable, like former North Carolina Gov.",
    "This Republican strategist explained, No Republican has endured more Trump attacks than Kemp.",
    "Georgia will be Trump's most important test case because it's more than just about politics.",
    "If Kemp wins his primary, Trump's standing will take a huge hit.?\nBut why this time?",
    "Voting in the 2022 Democratic and Republican primaries begins Tuesday in Texas.",
    "For that reason in particular, Trump's backing would still be sought after.",
    "Why this primary?"
  ]
}