{
  "id": 1327,
  "mediaId": 157,
  "date": "2/22/2022 12:00:00 AM",
  "headline": "Stacey Abrams and David Perdue in unlikely alliance after Brian Kemp changes election rules again",
  "image": "https://www.rawstory.com/media-library/federalist-reporter-claims-stacy-abrams-is-dangerous-for-promoting-voting.png?id=28028337&width=1200&coordinates=0%2C18%2C0%2C19&height=600",
  "link": "https://www.rawstory.com/stacey-abrams-david-perdue-in-unlikely-alliance-after-brian-kemp-changes-election-rules-again/",
  "mediaOutlet": "Raw Story",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Igor Derysh",
  "authorUrl": "https://www.rawstory.com/u/iasdsadsa",
  "termIds": [
    1008,
    1151,
    1646,
    1951,
    2095,
    2230,
    4325,
    146,
    428,
    2672
  ],
  "sentences": [
    "Abrams acknowledged that Kemp was the \"legal\" winner but refused to concede after the election was marred by a lack of voting machines in certain precincts, an unknown number of mail-in and provisional ballots that were rejected due to a lack of uniform standards, and Kemp's suspension of 53,000 voter registrations after early voting had already begun in a race Abrams lost by fewer than 55,000 votes.",
    "The bill was introduced by state Senate Rules Committee Chairman Jeff Mullis, a powerful Kemp ally, after a federal judge ruled that the governor can't use funds from a new leadership fund he signed into law without any public notice last year for his primary battle against Perdue, the former Republican senator who lost his seat to Democratic Sen. Jon Ossoff in January 2021.",
    "\"I could not in good conscience say that in order to protect my political future I'm going to be silent about the political present, which is that we have a system under a leader that sought to keep people from casting their ballot, that threw those ballots out, that said that voter suppression was a viable tactic for winning elections,\" Abrams said in a recent interview.",
    "\"It's no surprise that David Perdue and Stacey Abrams are joining forces to maintain the blatantly unfair status quo and continue raising money for their campaigns when the Governor is prohibited by law from doing so, solely because he is the incumbent during a legislative session,\" Cody Hall, a spokesman for the campaign, said in a statement to Salon.",
    "U.S. District Judge Mark Cohen ruled earlier this month that Kemp's leadership fund cannot spend money to back his bid during the Republican primary, writing that the new law \"effectively negates the contribution limit upon which all candidates for Governor in the primary election are bound for just one person: Governor Kemp, the incumbent.\"",
    "Kemp, Georgia's former secretary of state, has been repeatedly accused of abusing his power to aid his election chances, and is now backing a bill that would ban challengers to incumbents from raising money while the state legislature is in session, according to the Atlanta Journal-Constitution.",
    "\"This is clearly a naked election-year ploy,\" Abrams campaign manager Lauren Groh-Wargo said on a press call this week, adding that \"if there is a campaign finance law change that protects incumbency and is clearly unconstitutional, we are ready to fight it.\"",
    "Democrat Stacey Abrams and former Republican U.S. Sen. David Perdue found themselves in an unlikely alliance last week after Georgia's Republican governor, Brian Kemp, backed a rule change that could benefit his election chances  and not for the first time.",
    "That law, which was also sponsored by Kemp's legislative ally Mullis, allowed leadership committees run by Kemp and legislative leaders to circumvent limits on political contributions and the restriction on raising money during the legislative session.",
    "\"Kemp and his colleagues who are running the state are facing primary challenges up and down the ballot, they're facing strong Democratic opponents up and down the ballot, and appear to be hell-bent on preserving their power and abusing their power.\"",
    "The legislative session is scheduled to conclude in April, but critics have raised concerns that the legislation could allow Kemp to shut down fundraising by calling a special legislative session, possibly right ahead of the election.",
    "Abrams' campaign warned that Kemp could also call a special session of the legislature whenever he wants, or even extend it through November's election, giving him sole discretion over when his opponents may raise money.",
    "I don't think it's just because you are an incumbent, you can raise (more) money,\" Mullis said during a state Senate hearing, even though Kemp has raised about 18 times more than his Republican challenger.",
    "Kemp and his allies to again use the power of his office to rewrite campaign finance laws to his advantage after a judge put the brakes on their corrupt gubernatorial 'leadership PAC' scheme.\"",
    "Another draft provision would block PACs affiliated with candidates from raising money during the legislative session, which could limit fundraising by the Abrams-founded Fair Fight Action.",
    "Perdue, who has drawn former President Donald Trump's support in his campaign against Kemp, called the new leadership fund that Kemp planned to use to help fund his campaign a \"slush fund.\"",
    "Kemp last year also signed a sweeping new voting law that restricts absentee voting, early voting and ballot drop boxes, and could make it easier for state lawmakers to subvert elections.",
    "Critics previously accused Kemp of trying to tilt the scale in his favor when he signed a new law giving a handful of state leaders the ability to raise unlimited funds from big donors.",
    "Abrams accused the Republican-led legislature of seeking to \"suppress\" predominantly Black voters, who tend to vote Democratic, and called the new law \"nothing less than Jim Crow 2.0.\"",
    "\"One thing I agree with Perdue on: the corrupt 'leadership committee' slush fund law is bad,\" tweeted state Sen. Elena Parent, the chairwoman of the state Senate Democratic Caucus.",
    "\"It's unfortunately not surprising from a party that is more interested in retaining power through voter suppression than through free and fair elections,\" she said in an email.",
    "\"In the dark of night, Brian Kemp signed a shady backroom deal to try and rig this race in his favor, and the people of Georgia aren't going to let him get away with it.",
    "The bill was introduced just days after new campaign finance reports showed that Abrams had raised nearly four times as much as Kemp since entering the race in December.",
    "The campaign also questioned why Kemp had not pushed for such a ban during his 15 years in state office, or at least not until he faced Abrams' fundraising behemoth.",
    "Perdue has filed suit over the new law, accusing Kemp of giving \"himself power to raise unlimited campaign funds, while challengers have to play by different rules.\"",
    "Groh-Wargo argued that \"Kemp has a long history of abusing his power\" and warned that the fundraising ban could also hurt challengers in downballot races.",
    "\"This attempt by incumbents to shut down their challengers' ability to raise money is politics at its worst,\" the Perdue campaign said in a statement.",
    "Mullis said his bill would level the playing field for state lawmakers and officials who are barred from raising money during the legislative session.",
    "Abrams similarly accused Kemp of voter suppression in 2018, when he oversaw his own gubernatorial election while still serving as secretary of state.",
    "\"And it's absolutely anathema to our democracy and our constitution to have two candidates for the same race who have different fundraising limits.\"",
    "\"This could be another tool in that same toolbox, but hopefully the appearance of blatant corruption will cause this proposal to die in committee.\"",
    "Cohen's ruling indicated that Kemp would be able to use the funds against his Democratic opponent in the general election if he wins the primary.",
    "The court's ruling goes to show that a 20-year career politician like Kemp will do anything to try and save himself,\" Perdue said in a statement.",
    "Perdue has found unusual common ground with Abrams on this issue, who is seeking the Democratic nomination after narrowly losing to Kemp in 2018.",
    "Kemp has been supportive of the legislation and his aides recently met with state Senate leaders to discuss the proposal, according to AJC.",
    "\"In the middle of the night last year on the last day of session, he gave himself a leadership committee,\" Groh-Wargo said.",
    "The new leadership fund rules also allow Kemp to continue raising money for his committee despite the ban on fundraising.",
    "Abrams' campaign noted that Kemp had 29 months to raise money before any of his opponents launched their campaigns.",
    "The draft version in the chamber would bar anyone with \"outstanding taxes\" from being eligible to run for office.",
    "Perdue's campaign claimed that the proposal was coming from Kemp, calling it an \"incumbent protection act.\"",
    "While Republican lawmakers have generally supported the legislation, Democrats roundly voted against it.",
    "Even prior to the election, the state under Kemp purged more than 1.4 million voters from the rolls.",
    "In 2018, Abrams owed $55,000 in back taxes to the IRS, but she repaid it in 2019.",
    "An early draft of the legislation appeared to be aimed directly at Abrams.",
    "\"The surprising part is that they are being so open and honest about it.\"",
    "Parent told Salon that the new bill is an \"obvious attempt by Gov.",
    "Kemp's campaign hit back at his challengers' complaints.",
    "\"This brings parity and makes fairness for all.",
    "\"It's not just us,\" she said.",
    "Stories Chosen For You"
  ]
}