{
  "id": 1333,
  "mediaId": 19,
  "date": "2/20/2022 12:00:00 AM",
  "headline": "Exclusive  David Perdue: Halting Buckhead City Bill Is Height of Corruption' in Georgia Statehouse",
  "image": "https://media.breitbart.com/media/2022/02/GettyImages-1230130435-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/20/exclusive-david-perdue-halting-buckhead-city-bill-is-height-of-corruption-in-georgia-statehouse/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1646,
    1646,
    1178,
    1178,
    2095,
    2095,
    2246,
    2246,
    215,
    215,
    600,
    600,
    2672,
    2586,
    2586,
    2555,
    2555,
    2672
  ],
  "sentences": [
    "I'm running against a governor who most people don't realize has been in office for 20 years, and this is what you get, when people try to protect their own destiny.?\nDuncan, the Senate president, has openly opposed the Buckhead cityhood effort, telling the Atlanta Journal-Constitution this month that too many planning questions remain unanswered, including how bond ratings would affect city development and state taxpayers once the affluent neighborhood is carved out of Atlanta.",
    "Kemp, who ultimately oversees both chambers of government, detailed his opinion on the bill during his own interview with Breitbart News Saturday, saying he wants to see a healthy debate in the state legislature play out and that it will allow the new Atlanta mayor, Andre Dickens (D), to feel pressure? to stem Atlanta crime, which is the driving reason for the Buckhead separation movement.",
    "They're so afraid of the connection between big business and the politics of that city that they don't want to take a chance on that.?\nListen:\nPerdue has consistently backed the bill, which would allow for a ballot referendum that asks Buckhead residents if they want their wealthy suburb to deannex from Atlanta and become its own city with its own police department.",
    "Brian Kemp (R) in a contentious primary battle happening May 24, lambasted his Republican opponent on the issue, saying Kemp has been complacent about the bill, which a Trafalgar Group poll recently found a vast majority, or 75 percent, of Georgians support.",
    "pic.twitter.com/Lzv47oFovK\n Bill White Buckhead City GA (@BWBuckheadCity) September 23, 2021\nThe fact that these elected officials in the Statehouse are denying those people the right to vote for their own destiny is un-American,? Perdue said.",
    "Perdue expressed pessimism over Dickens because of his history of voting to withhold $73 million from the Atlanta Police Department when he was a councilman in 2020, and also said Kemp should not be free from blame for surging crime.",
    "People around the rest of the state are fed up with this, and this is being protected by the political elite, the politically connected in the Statehouse, and those powerful people that are connected to the governor.?",
    "Former Sen. David Perdue (R-GA), who is running for governor of Georgia, denounced state lawmakers for tabling the popular Buckhead City proposal, providing his remarks during an interview on Breitbart News Saturday.",
    "Geoff Duncan (R) moved to a Democrat-controlled Senate committee last month  effectively shelving it indefinitely  was a result of political corruption.",
    "House Speaker David Ralston (R) has been more passive on the matter, saying he respect[s]? the Senate's decision to table the bill.",
    "There are things that this governor can do to shine light on this absolutely ridiculous situation in Atlanta, Georgia.",
    "They have the GBI [Georgia Bureau of Investigations], they have state patrol, they have the National Guard.",
    "This is the height of corruption that you see under the Gold Dome in Atlanta, Georgia,? Perdue said.",
    "I said right up front, back in December, that the people should have a right to the vote.",
    "We have a mayor that has literally voted to defund the police,? Perdue said.",
    "The city of Atlanta has tied with Chicago as the murder capital of America.",
    "We're short some several hundred police officers [in] the city of Atlanta.",
    "This is nothing but corrupt politicians trying to protect their careers.",
    "Perdue said the stalled bill, which Lt. Gov.",
    "I mean we do live in a democratic republic.",
    "They should have that vote,? Perdue said.",
    "Where's our governor been on this thing?",
    "There are things the governor can do.",
    "Perdue, who is facing incumbent Gov.",
    "Coming soon to an event near you!!",
    "This is all on Brian Kemp's watch.",
    "This is what gets people elevated.",
    "I trust the people of Buckhead.",
    "That's what gets me elevated.",
    "I've said it repeatedly.",
    "And I'll tell you this.",
    "@BuckheadCityGA NOW!!"
  ]
}