{
  "id": 1353,
  "mediaId": 409,
  "date": "2/17/2022 12:00:00 AM",
  "headline": "David Perdue Is Scuffling",
  "image": "https://www.nationalreview.com/wp-content/uploads/2022/02/beijing-2022-olympics-training-47.jpg?zoom=2&resize=380%2C220",
  "link": "https://www.nationalreview.com/corner/david-perdue-is-scuffling/",
  "mediaOutlet": "National Review",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Rich Lowry",
  "authorUrl": "",
  "termIds": [
    689,
    689,
    819,
    819,
    1342,
    1342,
    1646,
    1646,
    1147,
    1147,
    2087,
    2087,
    1903,
    1903,
    2420,
    2420,
    2250,
    2250,
    2095,
    2095,
    227,
    227,
    428,
    428,
    2672,
    2672
  ],
  "sentences": [
    "A key quote from this CNN story:\nI'm sure that President Trump still has the expectation that when he endorses someone, they are going to win by 30 points, but we might be moving into a time when that doesn't happen anymore,? said the person close to Perdue.",
    "It may not be a fair test, since dethroning a well-entrenched incumbent governor isn't easy in any circumstance, but the state of David Perdue's Trump-endorsed primary challenge of Brian Kemp suggests that Trump isn't quite the kingmaker people think.",
    "It's very obvious former President Trump has an issue with the governor, but that's not a really compelling reason.?\nKemp, meanwhile, has done nothing to try to play nice with Trump to appeal to his die-hard supporters.",
    "A Trump endorsement doesn't guarantee a runaway victory anymore.?\nAnd the state of play:\nDavid Perdue kicked off his campaign for governor of Georgia with an emphatic endorsement from former President Donald Trump.",
    "In a recent interview with a local radio talk show host, Kemp dismissed a question that Trump's animus could be a factor in his reelection bid.",
    "But since then, his primary challenge to unseat Brian Kemp  the Republican governor Trump loves to hate  has been a big flop.",
    "Very few Republican elected officials, operatives, donors and activists in Georgia have abandoned Kemp in favor of Perdue.",
    "A lot of Republicans don't understand why you would challenge an incumbent Republican governor,? said Tanenblatt.",
    "Perdue, a former US senator, has so far raised a fraction of what Kemp has in his campaign war chest.",
    "I can't worry about a bunch of noise from, you know, people in other states,? Kemp said.",
    "And limited public polling hasn't been promising, either.",
    ".",
    ".",
    "."
  ]
}