{
  "id": 1355,
  "mediaId": 43,
  "date": "2/17/2022 12:00:00 AM",
  "headline": "This Week in Statehouse Action: Halftime, But For Nerds edition",
  "image": "https://images.dailykos.com/images/1038932/story_image/sadfromsport.jpeg?1645146957",
  "link": "https://www.dailykos.com/story/2022/2/17/2077175/-This-Week-in-Statehouse-Action-Halftime-But-For-Nerds-edition",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2558,
    2561,
    2712,
    2733,
    2745,
    2759,
    2784,
    2817,
    2841,
    2860
  ],
  "sentences": [
    "Country * Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cabo Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Cte d'Ivoire Croatia Cuba Curaao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Runion Romania Russian Federation Rwanda Saint Barthlemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia ZimbabweUnited States\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "First, a little background:\nIn many states (especially in states without full-time legislatures), lawmakers and constitutional officeholders (statewide elected officials like governors, LGs, and the like whose roles, duties, and funding are tightly tied to legislative goings-on) are prohibited from raising money during legislative sessionsin some cases just from lobbyists, but in about 15 states (this list is woefully out of date, so the number may have changed), electeds can't raise money from anyone.",
    "Keep Their Heads Ringin': Anyway, since all this started in Virginia for me (and for most other folks, too, in a sense, since Virginia's legislature is the oldest continuous legislative body in the Western Hemisphere), and the General Assembly just enjoyed its own crossover fun, let's take a quick peek at how are things going as lawmakers cross the halfway point of the 60-day session (known as a long session?in odd-numbered years, the legislature meets for just 45 days).",
    "But when you're not using your time and energy on being cool? (part of which, I'm convinced, is just figuring what's cool at any given point in time, since that definition seems to change rapidly), you can use it on stuff like long fantasy sagas and playing in the school band and comic books (I'm so old I remember when they were extremely not cool, but apparently they  are now?",
    "Anyway, Lucas stayed mum about the episode for the better part of a week, until Youngkin's Republican allies in the legislature threatened to unseat 1,000 Democratic appointees because the Democratic-majority Senate wouldn't confirm former Trump EPA head Andrew Wheeler as Virginia's secretary of natural resources (yeah, that guy).",
    "But a little distance from the nuts and bolts of those machinations is important for a number of reasons, including\nAlleviating some urgent, immediate pressure on lawmakers from folks with big checkbooks, letting those lawmakers, like, actually do their job, and\nPromoting public trust in the political and legislative processes.",
    "I'm sure someone with academic with qualifications far superior to mine has actually researched why some states came to have crossover dates built into their legislative rules and procedures while others did not, but I haven't come across such a publication yet (if you know of one, please point me to it!).",
    "A lot of Republicans and white people cling to this notion of opportunity? as a goal, maybe because it's easier, maybe because their personal frame of reference doesn't allow them to conceptualize why that wouldn't work out for someone who does everything right,? or maybe because they just suck.",
    "It's certainly worth noting that this bill to prohibit all candidate fundraising during session hit the House hopper just a few days after Abrams' campaign announced outraising Kemp in December and January ($9.2 million in December and January vs. $2.5 million for Kemp during the same period).",
    "Opt in to email updates from This Week In Statehouse Action\nSponsored by: This Week In Statehouse Action\nIt's also how I first learned about the crucial concept of crossover?the date by which a bill originating in one chamber must pass to be considered in the other chamber.",
    "Given Wheeler's actual track record as head of an environmental agency, Democrats have a strong and legitimate case here, instead of, as was the case in 2006, merely trying to remind a governor from the other party who wears the legislative pants in the statehouse.",
    "This is essentially a session's halftime, except instead of a star-filled musical performance, we skip straight to the back half of a prescribed time period during which lawmakers have their last chances to put points on the scoreboard  so to speak.",
    "Arguably all this started when Youngkin leaned into old racist tropes and stoked white people's fears to victory on the campaign trail last yeara strategy he's doubled down on, in a sense, as governor of a state with a divided legislature.",
    "An incumbent governor has an awful lot of power (one of the many reasons Kemp shouldn't have to struggle with fundraising tbh), though, and should this bill become law before session ends, well  guess what Kemp has the power to do?",
    ": If you, Rep. Supergreat, introduced a bill in the state House but it's still stuck in committee or doesn't come up for a final floor vote by the crossover date, that's it; it's effectively dead for that legislative session.",
    "His refusal to fold to Trump's 2020 demands that he somehow give the then-president a win in the Peach State (Biden won it by over 12,000 votes) earned the governor the ire of the MAGA faithfulnot to mention Trump himself.",
    "In the end, Republicans booted 11 Democratic appointees from various boardsa dick move that only seems slightly non-dickish because Republicans have us comparing it to their original, outrageous threat of 1,000 ejections.",
    "Pro tip: Never tell a Virginian that anything about the Commonwealth is average?\nAnyway, this is all to say that lawmakers of all stripes in Virginia are extremely busy right now, but that hasn't stopped Republican Gov.",
    "And that's not to say that lobbyists don't give donations right before sessions start with that same goal in mind, or don't keep track of those votes so they can cut a check to a  deserving lawmaker when sessions end.",
    "The measure itself sailed through the state House and looked to be moving through the Senate with similar speeduntil national attention stirred by the Abrams and Perdue camps (appears to have) slowed it down.",
    "Also the old website for the renamed office is gone, and more than a month into his tenure, the DOI site remains a mere shell with nothing more than a mission statement, two press releases, and contact info.",
    "I mean, a check from an energy company to a legislator that changes hands right before that legislator casts their vote to, say, deregulate or remove rate caps from energy companies would look super sus.",
    "Many states have limits on the number of bills that can be introduced before and/or during session, but on average, over 109,000 pieces of legislation are introduced across the country each year.",
    "Highest-ranking Black Democrat in Virginia and Senate president pro tempore Louise Lucas knows exactly where they are, though it seems she did give Youngkin a chance straighten up and fly right.",
    "A younger, chronically uncool me also got her start in state politics in Virginia, which resulted in it being a sort of lens through which I began to learn about other state legislatures.",
    "It's no wonder a former hedge fund hotshot like Youngkin is more interested in papering over something to make it look good instead of investing in making something actually good.",
    "This, I think pretty obviously, is to avoid the perception of obvious quid pro quo between lawmakers and the lobbyists who want those lawmakers to support or oppose certain bills.",
    "By the by, declining to confirm a gubernatorial cabinet appointment isn't ordinary political jockeying in Richmond; the last time a Virginia cabinet nominee was rejected was 2006.",
    "But this prohibition on fundraising during session can really cramp one's style if, say, you're running for an office not impacted by this prohibition (federal offices, e.g.)",
    "Most of the full-time legislatures in the country don't have set crossover dates, but a lot of legislatures that only convene for a few months out of the year don't, either.",
    "Nuthin' but a G? Thang: In Georgia, the Republicans who control that state's legislature remain discomfited by notion that Stacey Abrams could be the state's next governor.",
    "In the process of doing so, however, they may also disadvantage a member of their own party: former U.S. Sen. and current Trump-loving gubernatorial candidate David Perdue.",
    "Equity is much harder to achieve, because it requires more effort past just giving someone an opportunity? and shoving them out into the world to succeed or fail.",
    "Thus, Kemp found himself facing not one, but two formidable opponents who, unlike him, aren't prohibited from fundraising for almost four whole months this year.",
    "For the rest of session, you can only vote on bills that have already passed your state's Senate (or vice versa if you're a member of the upper chamber).",
    "Of course, by points? I mean bills,? and by scoreboard? I mean the governor's desk for their signature,? but I think you get the tortured metaphor.",
    "So Trump turned to his buddy David Perdue, who was suddenly jobless after losing reelection to Democrat Jon Ossoff, and urged him to primary Kemp.",
    "The former cleaves to the myth that if everyone has the same chances ( opportunities, dare I say), everyone has a similar shot at succeeding.",
    "In just a month, lawmakers worked through more than 2,000 bills and are poised to take up hundreds more in the second half of session.",
    "Republicans refused to let a former state AFL-CIO head become secretary of the commonwealth because argle bargle labor or something.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Georgia GOPers are so trouble by this possibility, in fact, that they're actively pursuing ways to hamstring her candidacy.",
    "There was no reason to eject these Democratic appointees but for the fact that they're Democrats and Youngkin was Big Mad.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Youngkin apologized, though he did try to blame his casual racist confusion on multitasking, essentially, which  no.",
    "Early in February, Youngkin texted Lucas to congratulate her on her great floor speech about Black History Month.",
    "Kemp faces a challenging journey to reelection in a rematch against Abrams  but he has to get there first.",
    "or if you're a sitting elected official facing challengers who don't face these contribution limitations.",
    "But in many legislatures, crossover has just happened or will happen in the next two weeks or so.",
    "Across all 50 states, average session length is about twice a Virginia long session? (120 days).",
    "Extend session or call additional sessions to keep his opponents pockets' empty for even longer.",
    "Obviously, Nebraska doesn't, because there's no other chamber there for bills to cross over to.",
    "One of the first things Youngkin did was demonstrate that he thinks equity? is a dirty word.",
    "Ralph Northam has been transformed to the Office of Diversity, Opportunity, and Inclusion.",
    "After Republicans' petty punishment of those appointees, Lucas was done playing nice.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "It also focuses on just giving people that shot and is unconcerned with outcomes.",
    "When I learn how to read minds, I'll figure out which it is, and for which ones.",
    "The Office of Diversity, Equity, and Inclusion started by former Democratic Gov.",
    "Virginia is a little on the low end in terms of session length, not shockingly.",
    "I dunno, I just keep reading them) and complicated games (board, card, etc.)",
    "We don't have corporate backers that are only in it for the bottom line.",
    "Equity work is extremely hard, because it involves real accountability.",
    "The page merely has the bio of the office's Youngkin-appointed leader.",
    "Divided by 50, that actually puts Virginia at about about the average.",
    "Too bad Lucas' colleague Sen. Mamie Locke gave that speech, not Lucas.",
    "Either you fucked up and you're sorry, or you're not actually sorry.",
    "Equity looks at that success and failure and tries to figure it out.",
    "Glenn Youngkin from flexing his white fragility as hard as he can.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "and diving deep into esoteric topics like, say, state politics.",
    "You know, in case you were wondering where his priorities are.",
    "She took to Twitter to blow Youngkin up in truly epic fashion.",
    "Oh, it does link to a staff? page \n except there is no staff.",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "See, now isn't 11 perfectly reasonable in light of that?",
    "Kemp's desk  well, of course he's going to sign it.",
    "For all the Bengals fans out there\nI am  not cool.",
    "Opportunity and equity are NOT the same thing.",
    "Don't miss a single Statehouse Action update!",
    "Outcomes are where equity comes into play.",
    "This is a short blurb about Daily Kos.",
    "And then she did it again, and HARDER.",
    "Not all states have crossover dates.",
    "So, yeah, one might call that  sus.",
    "You may unsubscribe at any time.",
    "Don't plan on getting that way.",
    "He blew it, so she blew him up.",
    "Like, say, current Georgia Gov.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Here's our privacy policy.",
    "Want to keep it that way?",
    "But if this reaches Gov.",
    "Because it doesn't work.",
    "Daily Kos is different.",
    "Tim Kaine was governor.",
    "But it doesn't matter.",
    " and 1,000% deserved.",
    "Never have been.",
    "Please read it.",
    "Words matter.",
    "Just BRUTAL.",
    "Brian Kemp.",
    "They do!",
    "Sign Up!",
    "Sign Up!",
    "E.g.",
    "No!!",
    "Fun!"
  ]
}