{
  "id": 1356,
  "mediaId": 43,
  "date": "2/17/2022 12:00:00 AM",
  "headline": "gubernatorial candidate in Georgia is flopping",
  "image": "https://images.dailykos.com/images/879598/story_image/AP20269714203100.jpg?1604696613",
  "link": "https://www.dailykos.com/story/2022/2/17/2080745/-More-bad-news-for-Trump-His-hand-picked-gubernatorial-candidate-in-Georgia-is-flopping",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    973,
    1147,
    1646,
    1951,
    1957,
    2095,
    227,
    428,
    2672
  ],
  "sentences": [
    "Related articles:\nTrump's endorsement ad of David Perdue is perfectly divisive and comically awful\nTrump looking less invincible and inevitable all the time\nPerdue confirms he would do anything Trump wanted him to do to cheat his way to victory\nPerdue's only real campaign pledge to Georgians was that he will gladly cheat for Trump in 2024\nGeorgia GOP lawmakers urged Perdue to avoid divisive primary against Kemp.",
    "Friendships, very long friendships, will be ruined and never recovered over this.?\nSurely that was among Trump's greatest ambitions: to break apart the Georgia GOP, defeat Kemp in the process, and then rebuild the state in his likeness with sycophants running amok.",
    "Since he launched his campaign in December, Perdue -- who lost a runoff last year to Democrat Jon Ossoff -- has struggled to bring aboard the network of political donors and operatives that have supported him and his cousin, former Gov.",
    "Republican operatives in the state expected the entire race to be filled with divisive attacks and cutting reprisals\nThis will be the ugliest, nastiest race this state has ever seen,? one Georgia Republican told The Washington Post.",
    "One such figure is Alec Poitevint, a former Georgia Republican Party chairman during Sonny Perdue's governorship and a national party activist who chaired David Perdue's successful US Senate bid in 2014.",
    "Asked if he would have certified the state's 2020 election results, Perdue responded, \"Not with the information that was available at the time and not with the information that has come out now.\"",
    "Perdue's cash-on-hand deficit is also pretty stunning, with just under $900,000 in the bank compared to Kemp's $12.7 million and Abrams, the Democratic candidate, sitting on $7.7 million.",
    "Donald Trump greeted then-Sen. David Perdue as he arrived at Dobbins Air Reserve Base for a campaign event at the Cobb Galleria Centre, Friday, Sept. 25, 2020, in Atlanta, Georgia.",
    "He said Kemp had \"caved to [Democratic rival Stacey] Abrams and cost us two Senate seats\"one of which was the one Perdue himself had lost in a special election early in 2021.",
    "The Georgia GOP primary may be far from over, but it's just the latest example of a Trump endorsee underperforming expectations after being tapped by the supposed kingmaker.",
    "If the guy who promises to steal an election for Trump can't generate enough energy to prevail in a GOP primary, it suggests that Trump's mojo is seriously suffering.",
    "That's particularly bad news for \"strongman\" Trump, whose supposed invincibility depends on an air of invincibility that's taking hits left and right.",
    "Donald Trump went out of his way to lure former Sen. David Perdue of Georgia into a Republican gubernatorial primary that was sure to be contentious.",
    "Brian Kemp, came out swinging immediately upon entering the race, charging that Kemp had \"failed all of us\" and could not win in November.",
    "But in the first couple months since Perdue announced, Kemp has raised twice as much as his rival: $2.5 million to Perdue's $1.2 million.",
    "A Quinnipiac University poll late last month found that 43% of likely Republican voters supported Kemp, while just 36% favored Perdue.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "But that poll also included Republican Vernon Jones, who has since abandoned the governor's race for a congressional bid.",
    "Perdue quickly followed up that performance by effectively promising to cheat for Trump if need be in the next election.",
    "Despite Poitevint's close ties to the Perdue family, he is supporting Kemp's reelection campaign.",
    "\"I think Perdue is on life support and knows it,\" one neutral GOP operative told CNN.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "In his 2020 reelection bid for Senate, Perdue raised more than $100 million.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "What limited polling is out there has also favored Kemp in the primary.",
    "They're going to outspend us five or six or seven times,\" Perdue said.",
    "Except, hold on, it's not going exactly as planned, according to CNN.",
    "Another poll this week found Kemp leading Perdue by about 10 points.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "\"The country,\" Perdue added, \"is paying the price today.\"",
    "It didn't go well\nThis is a short blurb about Daily Kos.",
    "Perdue, an erstwhile ally of sitting GOP Gov.",
    "\"I'm going up against an incumbent governor.",
    "Even Perdue himself seems on the defensive.",
    "\"But we're not getting out of this race.\"",
    "It is hyper-personal on both sides.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "I'm a big boy, I knew that.",
    "Sonny Perdue, in the past.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "This is no surprise.",
    "Please read it.",
    "Yikes."
  ]
}