{
  "id": 1387,
  "mediaId": 305,
  "date": "2/11/2022 12:00:00 AM",
  "headline": "Former ATL Dem turned MAGA Mascot Vernon Jones Runs for Congress",
  "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fit,f_auto,g_center,pg_1,q_60,w_1600/2a11864a27a24e136db5744adbcea12c.jpg",
  "link": "https://www.theroot.com/former-atl-dem-turned-maga-mascot-vernon-jones-runs-for-1848521635",
  "mediaOutlet": "The Root",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Keith Reed",
  "authorUrl": "https://www.theroot.com/author/kreed3110",
  "termIds": [
    2095,
    2355,
    45,
    146,
    428,
    562,
    2555,
    2672
  ],
  "sentences": [
    "With the baggage of accusations of intimidation of women and even rapehe was never charged or convictedduring his time as Dekalb County CEO, and after flipping parties from Democrat to a Black mascot on the Trump MAGA team, it's not like Jones can go home again politically.",
    "But none of that panned out for him, so now Jones is back in his trick bag, stumping for a Congressional seat representing a deep-red, predominantly white swatch of Trumplandia that he's never lived in, with the support of the insurrectionist-in-chief himself.",
    "Trumpism is hardcore in those parts, which, as you can imagine, might just complicate things for a Black man from the A who was a Democrat not all that long ago, even when that guy has Trump's support.",
    "Almost a dozen Republican candidates are already in the race for the 10th District, which stretches from the outskirts of Henry County in metro Atlanta to the border of South Carolina.",
    "And many longtime local Republicans have already lined up behind a familiar face: Mike Collins, a pro-Trump local businessman who narrowly lost to U.S. Rep. Jody Hice in a 2014 runoff.",
    "Jones is running in a crowded May 24 primary for Georgia's 10th Congressional district slot, which stretches from the far eastern burbs of ATL to the South Carolina border.",
    "He used to be the top elected official in municipal government in the diverse Atlanta suburbs of DeKalb County, but he quit after deciding to endorse Trump.",
    "Jones is an excellent speaker, but he'll say anything to get elected.?\nSo even with Trump's support, Jones is a long-shot to say the least.",
    "Vernon Jones was a Democrat until last year's Jan. 6 riot, choosing that infamous day to switch parties.",
    "Until a few days ago, he was running as a Republican in a primary challenge to Republican Georgia Gov.",
    "How do we trust him?? said Flip Johns, a retiree from Monticello who backs Collins.",
    "From the Atlanta Journal-Constitution\nJones faces a difficult political path.",
    "Incumbent Rep. Jodie Hice, also a Republican, isn't running for re-election.",
    "But in, uh, fairness, what else does the guy have to do?",
    "It's an uphill climb for Vernon Jones here.",
    "He was a Democrat up until last year.",
    "He's from DeKalb.",
    "Brian Kemp."
  ]
}