{
  "id": 1394,
  "mediaId": 237,
  "date": "2/10/2022 12:00:00 AM",
  "headline": "Republican governors buy ads in Georgia to help Brian Kemp",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/953882.png",
  "link": "https://www.washingtonexaminer.com/news/rga-begins-effort-to-shore-up-brian-kemp-with-georgia-ad-buy",
  "sentiment": "0.0",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-m-drucker",
  "termIds": [
    2095
  ],
  "sentences": [
    "The RGA affiliate RGA Georgia 2022 PAC this week went on the air statewide with Fight Back,? a positive, 30-second spot extolling Kemp's accomplishments and juxtaposing his leadership in Atlanta against President Joe Biden's out of control spending, skyrocketing inflation? and invasion on the Southern border.?\nThe RGA touted its fresh investment in Georgia as reinforcements for Kemp versus putative Democratic nominee Stacey Abrams.",
    "Georgia voters know that unlike political opportunist and woke leftist Stacey Abrams, Brian Kemp shares their values and works for them.?\nThe RGA air cover for Kemp came within days of Vernon Jones dropping out of the Georgia GOP gubernatorial primary, giving Perdue an unobstructed opportunity to oust Kemp.",
    "The national group also comes on the heels of a federal judge ordering the governor to halt the use of a state-sanctioned super PAC that under Georgia law made such political organizations available only to incumbents and party nominees.",
    "Brian Kemp, with the Republican Governors Association ponying up $500,000 for a television advertising campaign that is just the beginning of its effort to help the incumbent fend off a primary challenge and in a second term.",
    "But Republican insiders say the infusion is also part of the group's effort to help the governor beat back a GOP primary challenge from former Sen. David Perdue, who has been endorsed by former President Donald Trump.",
    "Brian Kemp has been a conservative, results-driven fight for all Georgians throughout his time in office,? RGA Executive Director Dave Rexrode said in a statement.",
    "Now it appears as if the RGA is prepared to fill that resources void  through Georgia's May 24 primary and beyond.",
    "Perdue sued to block the governor's use of Georgians First, arguing it was unfair and unconstitutional.",
    "Trump endorsed the former senator because he blames the governor for his loss in Georgia in 2020.",
    "The cavalry is coming to rescue Georgia Gov.",
    "Gov."
  ]
}