{
  "id": 1397,
  "mediaId": 124,
  "date": "2/10/2022 12:00:00 AM",
  "headline": "'Completely off the rails': Trump's latest endorsement roils Georgia's GOP",
  "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2022-02/220209-vernon-jones-donald-trump-rally-se-451p-48112b.jpg",
  "link": "https://www.nbcnews.com/politics/elections/completely-rails-trumps-latest-endorsement-roils-georgias-gop-rcna15590",
  "mediaOutlet": "NBC News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    2095,
    2095,
    2279,
    2279,
    2087,
    2087,
    1646,
    1646,
    1147,
    1147,
    146,
    146,
    428,
    428,
    2672,
    2672
  ],
  "sentences": [
    "The day before Trump's endorsement, Collins unleashed a website full of opposition research called realvernonjones.com and unloaded on him in a brutal online ad that called Jones a conman, a carpetbagger and a Democrat with a rap sheet.?\nIf no candidate can get more than 50 percent of the vote in Georgia, the top two vote-getters have a runoff race.",
    "On its face, Trump's \"complete and total endorsement\" of Vernon Jones in Georgia's 10th Congressional District looked like another case of the former president rewarding an 'America First' fighter.? Jones, a former Democrat and former state legislator, spoke at the 2020 Republican National Convention officially nominating Trump.",
    "But I know there's gonna be a lot more eyeballs on this congressional primary than before.?\nFew political observers had expected Jones to win the gubernatorial contest because he raised little money, didn't have Trump's endorsement and had a controversial past as a lawmaker that could prove problematic in a primary.",
    "For months, advisers in Trump's orbit privately tried to nudge Jones to leave the gubernatorial race after Trump recruited Perdue in December to run against Kemp, who earned Trump's enmity because he refused to help overturn the 2020 election results in Georgia, which helped seal Joe Biden's presidential win.",
    "That combination of factors, Cahaly said, probably won't affect the congressional race because the district is so heavily Republican, but it could have had major implications in the May 24 gubernatorial primary if Jones had stayed in the race and forced a Kemp-Perdue runoff.",
    "Robert Cahaly, a Georgia-based pollster with the Trafalgar Group, agreed with Lake's assessment and pointed to a recent poll he took of the 10th Congressional District that showed 41 percent of Republican voters would be more likely to support a candidate endorsed by Trump.",
    "One Trump adviser, who was not authorized to speak about strategy on the record, said they were still bracing for the race to go to a runoff, but Jones' absence could make it easier for Perdue to lead Kemp in the initial round of votes, giving him momentum.",
    "But Jones earned his endorsement in another way, as well: Two days earlier, he dropped out of Georgia's high-stakes GOP race for governor  making it easier for Trump's preferred candidate, former Sen. David Perdue, to beat Republican Gov.",
    "The race for the seat being vacated by Republican Rep. Jody Hice, who is challenging Republican and Trump foe Secretary of State Brad Raffensperger, already featured 11 candidates before Jones jumped in.",
    "Donald Trump roiled Georgia Republicans with an endorsement in a crowded House primary Wednesday as the former president molds the political landscape in an effort to defeat the state's GOP governor.",
    "Jones' decision to switch races capped on-and-off discussions with Trump advisers and allies who described the discussions as friendly, according to three Republicans with knowledge of the talks.",
    "The poll suggested that one of Jones' 11 Republican opponents, Mike Collins, was the early front-runner, pulling more than a third of the vote, three times more than the second-place candidate.",
    "In the 10th Congressional District, Jasper County GOP Chair Mary Patrick said she couldn't figure out why Trump was getting involved in the primary, aside from the gubernatorial race.",
    "But Jones was already running  and siphoning pro-Trump, anti-Kemp votes from Perdue, according to polls that showed him with little traction statewide.",
    "Jones' critics shared an extensive opposition-research file with Trump's team behind the scenes, two sources with knowledge of the matter said.",
    "\"Any Trump endorsement is probably going to put the person he endorses  in this case Vernon Jones  into first or second place,\" Cahaly said.",
    "She said a group of party chairmen from the district emailed each other over the weekend and said they didn't see much support for Jones.",
    "The Republican Governors Association announced Wednesday it would officially back Kemp, which could further his financial advantage.",
    "With Trump's coveted endorsement in hand, Lake said, Jones is going to have an opportunity to at least compete? in the House race.",
    "Compared to Kemp, Perdue posted relatively lackluster fundraising numbers prior to Jones' decision to leave the race.",
    "But that poll was taken before Jones made his announcement and secured Trump's endorsement, Cahaly told NBC News.",
    "Trump needed him to leave the race, which Jones did Monday while simultaneously announcing his bid for Congress.",
    "The state also has open primaries, which could allow Democrats and independents to vote in GOP primaries.",
    "There was no sense that this was a good thing,? Patrick said of Jones' congressional candidacy.",
    "Most were running as Trump Republicans in the heavily conservative district in eastern Georgia.",
    "And now it's completely off the rails,? Chip Lake, a Republican strategist in Georgia, said.",
    "Sign Up\nThis site is protected by recaptcha Privacy Policy | Terms of Service",
    "Jones endorsed Perdue, who in turn called Jones a \"conservative patriot.\"",
    "Get the Morning Rundown\nGet a head start on the morning's top stories.",
    "Georgia 10 was a deep and chaotic primary before Vernon Jones' entry.",
    "I don't have a crystal ball to know what will happen.",
    "Jones' opponents appeared to understand the stakes.",
    "Brian Kemp in a one-on-one primary matchup.",
    "\"It's that powerful.\""
  ]
}