{
  "id": 1401,
  "mediaId": 43,
  "date": "2/10/2022 12:00:00 AM",
  "headline": "Morning Digest: Daily Kos Elections is launching",
  "image": "https://images.dailykos.com/images/1036238/story_image/GettyImages-1236298954.jpg?1644462725",
  "link": "https://www.dailykos.com/story/2022/2/10/2079502/-Morning-Digest-Daily-Kos-Elections-is-launching-a-brand-new-podcast-The-Downballot",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1299,
    1454,
    1588,
    1670,
    1862,
    2095,
    2277,
    428,
    571,
    2672
  ],
  "sentences": [
    "Eric Greitens: $460,000 raised, $290,000 cash-on-hand\nState Attorney General Eric Schmitt: $455,000 raised, $1.3 million cash-on-hand\nRep. Vicky Hartzler: $425,000 raised, $1.8 million cash-on-hand\nRep. Billy Long: $220,000 raised, additional $250,000 self-funded, $575,000 cash-on-hand\nState Senate President Pro Tem Dave Schatz: $170,000 raised, additional $1 million self-funded, $1.2 million cash-on-hand\nAttorney Mark McCloskey: $85,000 raised, $100,000 cash-on-hand\nMcCloskey, who has also taken last place in every released poll that's even included him, also had his law license placed on a one-year probation by the Missouri Supreme Court on Tuesday for having committed a misdemeanor offense involving moral turpitude.? The state's highest court didn't elaborate, though it likely was related to a 2020 incident where McCloskey and his wife, a fellow lawyer who received the same sanction, confronted peaceful Black Lives Matter protestors with guns.",
    "Prosecutors\n? Suffolk County, MA District Attorney: Boston City Councilor Ricardo Arroyo, whom the Boston Globe characterizes as \"a former public defender who is known as a police reform stalwart,\" announced Tuesday that he was entering the September Democratic primary for district attorney of solidly blue Suffolk County, which includes Boston and three nearby communities.",
    "? WI-Gov: State Rep. Tim Ramthun, who is one of the Big Lie's biggest promoters in Wisconsin, tells Rolling Stone that he's thinking about entering the Republican primary for governor, and WISC-TV says that \"an advertisement circulating online for Kewaskum High School promises he has a 'special announcement' to come this weekend.\"",
    "Boozman hasn't begun airing TV commercials himself yet, but AdImpact reports that his first buy is set to begin Feb. 26.\n? CT-Sen: Republican fundraiser Leora Levy, who served as Donald Trump's ambassador to Chile, announced Tuesday that she would take on Democratic Sen. Richard Blumenthal in this very blue state.",
    "? Milwaukee, WI Mayor: The Republican firm Remington Research Group, polling Tuesday's nonpartisan special election primary on behalf of a pro-charter schools group called Leaders for a Better Milwaukee, finds Acting Mayor Cavalier Johnson and former Alderman Bob Donovan advancing to the April 5 general election.",
    "Senate\n? AR-Sen: Arkansas Patriots Fund, a super PAC that received $1 million back in October from conservative megadonor Richard Uihlein, is spending close to $900,000 on an opening ad campaign attacking Sen. John Boozman and promoting former football player Jake Bequette ahead of the May Republican primary.",
    "Attorneys General\n? NV-AG: Tisha Black, whom the Nevada Independent says is a recent head of \"the state's premier cannabis industry trade group,\" on Monday became the second Republican to launch a bid against Democratic incumbent Aaron Ford in what will be a closely watched race for state attorney general.",
    "? GA-10: As expected, Donald Trump has given his backing to former state Rep. Vernon Jones' brand-new bid for Congress, an enticement Trump reportedly dangled to encourage Jones to drop his campaign for governor in order to boost the prospects of former Sen. David Perdue, another Trump favorite.",
    "The court's decision prohibits Georgians First from spending in the primary, but the Atlanta Journal-Constitution's James Salzer notes that the group isn't required to \"give back the money it previously spent or has committed to spend on things such as advertising to win the Republican race.\"",
    "House\n? CA-06: California-based data analyst Rob Pyers flags that Courtney Bailey-Kanelos, the registrar of voters in Sacramento County, has filed paperwork for a possible bid in the redrawn 6th Congressional District, a solidly blue seat where Democratic Rep. Ami Bera will seek re-election.",
    "What follows are eight seconds of silence from the governor as she taps her fingers and aimlessly looks around (at least she doesn't drink from any coffee cups) before, after some brief commentary from a narrator about how conservative Ivey is, she concludes, \"Poor Joe  Bless his heart.\"",
    "You'll need to decide for yourself if that line was also intended as a shot at Josh Hawley, who ran ads during his 2016 bid for attorney general decrying \"career politicians just climbing the ladder, using one office to get another\" two years before he won Missouri's other Senate seat.",
    "And to avoid making the neighboring 2nd District (which absorbed part of the KC region) any bluer, Republicans extricated the liberal college town of Lawrence and grafted it onto the sprawling 1st District, deep-red rural turf that stretches all the way to the Colorado border.",
    "? GA-07: The Atlanta Journal-Constitution reports that Protect Our Future, a new super PAC co-founded by crypto billionaire Sam Bankman-Fried, plans to spend $2 million to aid Rep. Lucy McBath in her battle in the May Democratic primary against fellow Rep. Carolyn Bourdeaux.",
    "Smith used the occasion to denounce how \"many politicians are trying to climb their way up the ladder instead of making real change,\" though the congressman himself had devoted close to a year towards mulling whether he wanted to get higher on that ladder himself.",
    "Importantly, these new committees can accept donations during the legislative session, when the governor and state lawmakers are otherwise forbidden from fundraising, and they're also allowed to coordinate directly with the campaigns they're supporting.",
    "? CA-15: Redwood City Councilmember Alicia Aguirre, who'd been mentioned as a possible candidate for California's open 15th Congressional District, instead endorsed Democratic Assemblyman Kevin Mullin for the job at an event she hosted late last month.",
    "Ford ended 2021 with a huge $1.5 million to $335,000 cash-on-hand lead over Chattah, but there's little question that national Republicans will spend heavily in this swing state at a time when AG races are attracting more and more outside interest.",
    "A committee in the House has also approved a Republican-drawn map for the body's own districts, which Democrats have criticized for not increasing the number of Black and Latino seats despite the state becoming less white over the previous decade.",
    "Brian Kemp\nThe Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "The Oregon Capital Chronicle reports that state Sen. Dallas Heard, who serves as state party chair \"tried and failed to get other state party officials to support him as a candidate for governor during a party meeting over the weekend.\"",
    "? GA-Sen: While former Sen. Kelly Loeffler expressed interest last year in trying to reclaim her old seat, the Republican's team now says, in the words of the Atlanta Journal-Constitution, that she's \"not a candidate for any office.\"",
    "Perdue, for his part, is airing a spot of his own that spends a full 15 seconds zooming in on a recent picture of an unmasked Abrams seated smiling in front of a classroom full of masked children, an action she later apologized for.",
    "? NY-23: Republican Rep. Claudia Tenney on Wednesday publicized an endorsement from Donald Trump in her bid for the new 23rd Congressional District, a constituency in southwestern upstate New York that would have backed Trump 59-39.",
    "Ford already faced opposition from Sigal Chattah, an attorney who has sued to try to undermine the state's pandemic measures and who has insisted that the attorney general has done a poor job investigating voter fraud allegations.",
    "Kemp ended January with a massive $12.7 million to $1 million cash-on-hand lead over Perdue, and while the RGA's ad campaign gives him another boost, his side had an even bigger financial advantage before Monday's court order.",
    "? OR-Gov: In a true blast-from-the-past, Bill Sizemore, the longtime anti-tax crusader who lost the 1998 governor's race in a landslide, announced Monday that he would seek the Republican nomination for this open seat race.",
    "The intervention comes days after a federal judge issued an order barring Kemp's allied PAC from getting involved in his May primary battle with former Sen. David Perdue; there is no word yet if the governor will appeal.",
    "Levy joins an August primary that includes former state House Minority Leader Themis Klarides, who may have thought she'd avoid a serious nomination fight when she decided to run for the Senate rather than for governor.",
    "? MN-Gov: Radio host Cory Hepola, who stepped down as weekend TV anchor in 2018 for Minneapolis' NBC affiliate, tells Minnesota Public Radio's Brian Bakst he'll spend four to six weeks thinking about a run for governor.",
    "In this format, we'll be able to delve into issues in ways that simply aren't possible in printand give activists, campaign professionals, and election junkies like yourselves a new and enjoyable way to engage with us.",
    "? MO-Sen: Rep. Jason Smith, who was the last major Republican who still appeared to be undecided about entering the race to succeed retiring Sen. Roy Blunt, announced Wednesday that he would instead stay in the House.",
    "He reached a plea agreement the next year where he pleaded guilty to not filing state tax returns for three years and went to jail for 30 days, but he showed no contrition when he launched his new campaign this week.",
    "Every week, political director David Nir and contributing editor David Beard will highlight some of the key stories in the world of downballot electionsespecially those that don't always generate the big headlines.",
    "? CA-37: Former Los Angeles City Councilwoman Jan Perry, who'd filed paperwork ahead of a possible bid last month, kicked off a campaign for California's open (and deep blue) 37th Congressional District this week.",
    "? IL-01: Businessman Jonathan Swain, who owns a liquor store and runs a local beer festival, has entered the crowded Democratic primary for Illinois' open 1st Congressional District, a safely blue seat in Chicago.",
    "? PA Redistricting: Pennsylvania's Supreme Court has stayed the state's March 8 filing deadline for all races as it adjudicates a case that will decide what congressional map the state uses for the coming decade.",
    "House Republicans even dragged in a member who'd been absent the entire session because of an unspecified illness, Rep. Michael Houser, who voted yes \"while hooked to oxygen,\" reported the Kansas City Star.",
    "Her only prior run for office appears to have been last year, when Levy sought the GOP nod in a special election for a state Senate seat, but the party's nominating convention selected another candidate.",
    "Indeed, an arm of the Republican Attorneys General Association, which spends millions in AG races, called the Rule of Law Defense Fund promoted the infamous rally that came just before the Jan. 6 attack.",
    "Sizemore, who has spent decades promoting anti-tax ballot measures, scored perhaps his biggest success in 1996 with Measure 47, which Willamette Week says restricts \"property tax increases to 3% a year.\"",
    "Charlie Baker appointed last month after Rachael Rollins left to become U.S. attorney for Massachusetts, has not yet revealed his plans, but the new incumbent said last week he was \"very likely\" to run.",
    "? TX-28: Democratic Rep. Henry Cuellar doesn't refer to his opponent in next month's primary, Jessica Cisneros, in his new ad, nor does he mention the federal investigation he's apparently a target of.",
    "Texas Rep. Colin Allred, a Democrat whose time with the Tennessee Titans included a stint on their practice squad, diplomatically said, \"Practice squad players are considered a full member of the team.",
    "After competing in a mere eight games total over two seasons, he was put on the practice squad in 2014 and didn't play in the 2015 Super Bowl, though he still got a ring after his team won the game.",
    "That's because Kemp signed a state law last year that allows the governor and certain other statewide candidates to create so-called \"leadership committees\" that can receive unlimited contributions.",
    "That's because the Kansas Supreme Court has a moderate reputation and has often acted as a check on GOP excesses, so much so that Republicans tried to oust four justices at the ballot box in 2016.",
    "Ramthun claims that Donald Trump contacted him in early December and offered to endorse him in a future election, though it's not clear if this would apply to the race to take on Democratic Gov.",
    "The narrator then highlights Bequette's time playing for the University of Arkansas and as a \"championship-winning Patriot,\" before praising his subsequent service in Iraq as an Army Ranger.",
    "John Kitzhaber, but while reports of what the Associated Press characterized as his \"trail of debt\" didn't stop him from decisively prevailing in the primary, he fell 64-30 in the general.",
    "Too often, however, these crucial elections are ignored, which is why Daily Kos Elections has spent almost two decades elevating these races to help them get the attention they deserve.",
    "Sizemore says he decided to run again after another candidate, Sandy Mayor Stan Pulliam, acknowledged last week that he and his wife \"explored mutual relationships with other couples.\"",
    "We'll start with the RGA ad, which doesn't mention the Trump-endorsed Perdue but instead portrays Kemp as a \"proven conservative leader\" who is standing up to the Biden administration.",
    "Nathan Gonzales recently wrote a piece taking a look at whether Bequette (and by extension his allies) really had the right to say he won the championship, but found little agreement.",
    "Only 9% of the seat's residents live within the boundaries of Tenney's existing 22nd District, but the congresswoman doesn't currently face any serious opposition in the June primary.",
    "But when Allred was asked if he'd call himself a Super Bowl winner if he was in Bequette's position, the congressman responded, \"I wouldn't say that if I was on the practice squad.\"",
    "Last month, both Johnson's campaign and an unaffiliated group released surveys showing him in first but with Donovan and Taylor locked in a close race for the second general spot.",
    "3: Nir and Beard talk about redistricting in Alabama and the GOP primary for governor in Georgia before exploring the world of online polling with Civiqs co-founder Drew Linzer.",
    "By contrast, Perdue and the all-but-certain Democratic nominee, Stacey Abrams, won't be able to create their own leadership committee unless and until they win their primaries.",
    "Black, who unsuccessfully ran for a seat on the Clark County Commission in 2018, also launched her bid by decrying \"unnecessary\" mask mandates and \"soft on crime legislation.\"",
    "2: Daily Kos Elections editor Jeff Singer, whose knowledge of elections is unparalleled, gives us an exceptionally thorough overview of the top contests in the 2022 midterms.",
    "\"It was all politics from beginning to end,\" he argued, adding, \"It was Democrats militarizing the Department of Justice and using it to persecute their political enemies.\"",
    "Regular statewide campaign committees, by contrast, can only receive $7,600 each for the primary and general elections from individual donors, plus $4,500 for any runoffs.",
    "Earlier in the week, GOP leaders in the Senate failed to corral enough support for an override but were able to muster the necessary two-thirds supermajority the next day.",
    "Click here to subscribe on your favorite podcasting platform, and once you've given us a listen, please come back so that you can like us and leave us a five-star review.",
    "Mayors\n? Los Angeles, CA Mayor: Central City Association head Jessica Lall announced Tuesday that she was dropping out of the June nonpartisan primary for this open seat.",
    "? GA-Gov: The Republican Governors Association for the first time ever is airing TV ads to support an incumbent in a primary by launching a $500,000 campaign to aid Gov.",
    "Kathy Hochul in the June Democratic primary; the WFP has long been a force in New York progressive politics, but several unions have withdrawn support in recent years.",
    "On the Democratic side, Marine veteran Lucas Kunce outraised former state Sen. Scott Sifton $705,000 to $156,000 and held a $810,000 to $156,000 cash-on-hand lead.",
    "A similar plan was recently approved by a committee in the state House, but if the two chambers pass different versions, they'll have to hammer out a compromise.",
    "The map is chiefly aimed at making the 3rd District, held by Democratic Rep. Sharice Davids, more favorable for Republicans by splitting up the Kansas City area.",
    "Ford won this post by a narrow 47.2-46.8 margin during the 2018 blue wave, a victory that made him the first Black person elected to statewide office in Nevada.",
    "Bequette did very much have a successful stint as a defensive end in college through the 2011 season, but his time with New England was far from illustrious.",
    "The incumbent outraised Bequette $1.2 million to $275,000 during the fourth quarter, and he ended December with a $3.5 million to $410,000 cash-on-hand lead.",
    "Ivey, who is seated behind her desk, tells the audience, \"Growing up, my mom and dad told us, 'If you can't say something nice, don't say anything at all.'",
    "Laura Kelly's veto of their new congressional map on Wednesday in another chaotic set of votes that saw multiple lawmakers repeatedly flip their positions.",
    "She went on to endorse Eric Garcetti in the second round, who named her head of his administration's Economic Development Department following his victory.",
    "Johnson leads with 41% while Donovan, who is the rare conservative politician in this heavily blue city, outpaces state Sen. Lena Taylor 24-10 for second.",
    "Perry stepped down in 2018 and ran for a seat on the Los Angeles County Board of Supervisors two years later, but she took a distant third with just 12%.",
    "While the announcer doesn't mention Boozman by name, that claim is followed with a picture of the incumbent with the caption \"RINO REPUBLICANS TOO WEAK.\"",
    "As the Associated Press detailed this week, Republicans are looking to put into power attorneys general who would empower Donald Trump's election lies.",
    "We'll also bring on a guest to lead us in a deep dive of a major topic that will make you, our listeners, the best-informed political consumers around.",
    "Perdue's narrator, though, spends more time attacking Kemp for having \"folded\" and letting \"radical Democrats set their own rules, all over Georgia.\"",
    "Kemp's allies at Georgians First Leadership Committee made full use of these new rules to raise $2.3 million through Jan. 31 and air anti-Perdue ads.",
    "Democrats have said they plan to file a legal challenge to the new map, and they might receive a favorable reception if they proceed in state court.",
    "No doubt the FBI will be glad to know that the man whose home they raided last month has helped ensure they have the resources they needed to do so.",
    "In so doing, the revamped district would have voted for Joe Biden by a 51-47 marginconsiderably redder than Biden's 54-44 win under the old lines.",
    "1: We chat with Daily Kos founder Markos Moulitsas about the history of both Daily Kos and Daily Kos Elections, and why we do the work that we do.",
    "The leadership committee is also still allowed to keep raising money though the legislative session, which isn't set to end until early April.",
    "While Black didn't mention Chattah in her launch, Chattah labeled her new foe a \"progressive plant\" who has donated to Democrats in the past.",
    "Missouri backed Donald Trump 57-41, but Democrats are hoping they'll have an opening especially if the disgraced Greitens is their opponent.",
    "Governors\n? AL-Gov: The May Republican primary, unsurprisingly, is turning into a referendum on who hates national Democrats more, and Gov.",
    "The second half pledges that Perdue will \"stop the mandate madness on day one\" and obligatorily reminds the audience that he's Trump's man.",
    "Kristi Noem, which is probably the closest he'll ever come to acknowledging that she won't be challenging Sen. John Thune for renomination.",
    "It's also why we decided to create this new show, which is the only podcast devoted to downballot elections from a progressive perspective.",
    "? HI-Gov: Rep. Kai Kahele says he'll spend \"the next month and a half\" considering whether he should enter the August Democratic primary.",
    "? LA Redistricting: Louisiana's Republican-run state Senate passed the GOP's new congressional map on a party-line vote on Wednesday.",
    "We're also eager for your feedback and input on topics you'd like to hear us discuss, so please leave a comment or drop us a line.",
    "\"Kemp cut taxes, creating one of America's fastest growing economies and good-paying jobs,\" the narrator says, adding, \"And Gov.",
    "While Smith is staying out of the August primary, plenty of others have been raising money for what will be an expensive fight.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "? NY-Gov: The Working Families Party on Tuesday endorsed New York City Public Advocate Jumaane Williams' campaign against Gov.",
    "Sizemore ran again in 2010 but he received just 7% of the vote in the primary months after he was indicted for tax evasion.",
    "However, a spokesperson for the Administrative Office of Pennsylvania Courts says that the May 17 primary date remains set.",
    "? IL-03: EMILY's List has endorsed state Rep. Delia Ramirez in the June Democratic primary for this safely blue open seat.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "But he does talk about the importance of bipartisanship and, without any hint of irony, \"fully funding law enforcement.\"",
    "Hepola didn't specify which party he'd run with, though Bakst says it sounds like he was eyeing a third-party candidacy.",
    "One unidentified \"former Super Bowl-winning player\" who Gonzales said was \"not involved in politics\" was nicer, though.",
    "Leading Off\n? Daily Kos Elections is extremely excited to announce the launch of our brand-new podcast, The Downballot!",
    "Noem faces primary opposition of her own in June from state Rep. Steve Haugaard, but he's raised little money so far.",
    "\"Practice squad guys get rings,\" this player said, adding, \"He was a part of it even though he wasn't on the field.\"",
    "Each year, Americans elect tens of thousands of officials at all levels of the ballot, from Senate to city council.",
    "At the same gathering, Mullin also received the backing of Rep. Anna Eshoo, who represents a neighboring district.",
    "? IA-Gov: Democratic state Rep. Chris Hall tells Bleeding Heartland that he's decided against a run for governor.",
    "You can keep track of all the changes to key dates for the 2022 elections with our bookmarkable primary calendar.",
    "She joins a Democratic primary that includes Culver City Vice Mayor Daniel Lee and state Sen. Sydney Kamlager.",
    "Perdue's team argued in court that the legislation gives Kemp an unfair edge, and the judge agreed in part.",
    "What's not up for debate, however, is that Boozman went into the new year with a huge financial advantage.",
    "Perry ran for the city's top job in 2013 and ultimately placed fourth in the nonpartisan primary with 16%.",
    "Several other Republicans are already competing in the May primary to succeed termed-out Democratic Gov.",
    "We always provide a transcript, which you can find linked in each episode description or at this tag.",
    "A Senate committee has likewise advanced a map for itself that has been attacked on similar grounds.",
    "Kemp sent the National Guard to the border to help stop the illegal drugs flooding our communities.\"",
    "Our first three episodes are already live, and you can find them wherever you enjoy podcasts:\nEp.",
    "(Despite that Trumpesque not-sentence, the senator is actually Trump's endorsed candidate.)",
    "The effort failed, and today, five of the court's seven members are Democratic appointees.",
    "Kate Brown, and the field could still grow in the month to go before the filing deadline.",
    "Before Republicans can focus on Ford, though, they have a messy June primary to sort out.",
    "Redistricting\n? KS Redistricting: Kansas Republicans managed to override Democratic Gov.",
    "Bailey-Kanelos, a registered independent, does not appear to have commented publicly.",
    "He tried for an even bigger win two years later when he challenged Democratic Gov.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "The spot begins with a narrator bemoaning, \"Democrats are destroying our country.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "The GOP candidates' fourth quarter numbers are below:\nformer Gov.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Kay Ivey is going with a less-is-more strategy in her new ad.",
    "(Houser previously said he was not vaccinated against COVID.)",
    "? SD-Gov: Donald Trump on Wednesday endorsed Republican Gov.",
    "Swain says he's already raised $200,000 for his bid.",
    "Well, here is what I have to say about Joe Biden.\"",
    "Too many Republicans are too weak to stop them.\"",
    "Kevin Hayden, a Democrat whom Republican Gov.",
    "New episodes come out every Thursday morning.",
    "Despite the override, the story isn't over.",
    "This is a short blurb about Daily Kos.",
    "We can't wait to hear what you think!",
    "That's something to be proud of.\"",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Don't have time to listen?",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "He was on the team.",
    "Please read it.",
    "Georgia Gov.",
    "Tony Evers.",
    "Brian Kemp.",
    "P.S.",
    "Ep.",
    "Ep."
  ]
}