{
  "id": 1403,
  "mediaId": 1576,
  "date": "2/10/2022 12:00:00 AM",
  "headline": "Kemp: Let parents opt students out of masks in Georgia",
  "image": "https://www.wabe.org/app/uploads/2022/02/AP22041006223196-336x189.jpg",
  "link": "https://www.wabe.org/kemp-let-parents-opt-students-out-of-masks-in-georgia/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1147,
    1646,
    1951,
    2095,
    2230,
    4325,
    2555,
    2642,
    2672,
    2686
  ],
  "sentences": [
    "Parents are beyond frustrated in a very, very small number of districts in our state, about young children, especially, being masked.?\nThe state Department of Education doesn't track how many districts statewide require masks to prevent the spread of COVID-19, but some metro Atlanta districts do.",
    "Brian Kemp says he will propose a measure that would let parents opt their children out of school mask mandates, following a flap in which GOP primary rival David Perdue attacked Kemp for not doing more to end masking in schools.",
    "20-year career politicians like Kemp only care in an election year.?\nPerdue lost his U.S. Senate seat in a 2021 runoff to Democrat Jon Ossoff, only to be implored by former President Donald Trump to enter the governor's race.",
    "Abrams' campaign initially said she wore a mask to the school and only removed it to be better heard by students watching remotely  and for pictures on the condition that everyone around her kept theirs on.",
    "In an interview Tuesday on CNN, Abrams said, Protocols matter and protecting our kids is the most important thing, and anything that can be perceived as undermining that is a mistake and I apologize.?",
    "The controversy spun out of Republican attacks on likely Democratic gubernatorial nominee Stacey Abrams for not wearing a mask when she spoke at a suburban Atlanta school Friday.",
    "Brian Kemp only does the right thing when we spell it out first,? Perdue said in a statement Wednesday after Kemp made his announcement.",
    "Kemp's aides said they are drafting a bill and that the governor's legislative floor leaders would introduce it in coming days.",
    "Kemp had earlier discouraged masks, but said he would ultimately leave the decision up to Georgia's 180 local school districts.",
    "Trump has vowed to beat Kemp, saying Kemp didn't do enough to overturn Democratic President Joe Biden's victory in Georgia.",
    "Both numbers are far above the roughly 1,000 cases in school-age children that Georgia was recording in early November.",
    "Perdue, in addition to attacking Abrams, attacked Kemp for not doing enough to prevent masks from being required.",
    "That was the first week in 2022 that infections had declined, dipping from 16,242 in the last week of January.",
    "I've been a local control governor, but this has gone on for too long,? Kemp told reporters Wednesday.",
    "Some districts in other parts of the state also require them, including Savannah-Chatham County.",
    "Pictures show all the students and faculty at the elementary school wearing masks around Abrams.",
    "On Wednesday Kemp argued that falling infections from the omicron wave means it's time to act.",
    "That's in keeping with a generally decentralized public education culture in the state.",
    "Why didn't Kemp stand up for parents' rights two years ago when this pandemic began?",
    "The state last week recorded 13,418 COVID-19 cases in children ages 5-17.",
    "They include Gwinnett County, DeKalb County, Clayton County and Atlanta.",
    "I've been very patient.",
    "Georgia Gov."
  ]
}