{
  "id": 1410,
  "mediaId": 195,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "GOP governor's group launches ad for Kemp against Trump-backed primary challenge",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/kempbrian_110619getty.jpg?itok=mnm98QP6",
  "link": "https://thehill.com/homenews/campaign/593483-gop-governors-group-backs-kemp-in-ad-buy-against-trump-backed-primary",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1147,
    1951,
    2087,
    2095,
    425,
    428,
    501,
    2672
  ],
  "sentences": [
    "\"The race has gone from bickering to an all-out brawl, and as it continues to devolve, Georgians are hearing nothing from Kemp or Perdue on pressing issues facing families across our state, like upholding public safety, expanding access to affordable health care, and protecting the freedom to vote,\" Max Flugrath, a spokesperson for the Georgia Democratic Party, said in a statement.",
    "Kemp sent the National Guard to the border to help stop the illegal drugs flooding into our communities.?\nWhile the RGA typically backs incumbent GOP governors, the spot for Kemp marks the first time that the group is financing a TV ad in a primary to support an incumbent facing a Republican challenger.",
    "The 30-second spot talks up Kemp's record on the economy and border security, while avoiding any mention of David Perdue, the former senator who is challenging Kemp in the GOP primary with the support of former President Trump.",
    "Perdue jumped into the race at the urging of Trump, who turned on Kemp last year after the Georgia governor rebuffed the former president's pleas to help him overturn the 2020 election results in the Peach State.",
    "The Republican Governors Association (RGA) on Wednesday unveiled a new pro-Kemp ad to the tune of roughly $500,000, The Atlanta Journal-Constitution reported.",
    "Under Joe Biden, out of control spending, skyrocketing inflation and invasion on the southern border,? a narrator says in the 30-second spot.",
    "Democrats pounced on the RGA's ad buy on Wednesday, arguing that it \"underscores just how brutal and chaotic the GOP primary has become.\"",
    "Kemp's leadership committee responded with an ad of its own hammering Perdue for outsourcing American jobs during his business career.",
    "Brian Kemp.?\nKemp cut taxes, creating one of America's fastest-growing economies and good-paying jobs,? the narrator continues.",
    "Perdue rolled out his first campaign ad earlier this month, featuring Trump himself touting his support for the former senator.",
    "Whoever emerges from the GOP primary will go on to face Democrat Stacey Abrams in the November general election.",
    "Abrams, who was also the Democratic gubernatorial nominee in 2018, isn't facing any primary opposition.",
    "The main group dedicated to electing Republican governors is rushing to the support of Georgia Gov.",
    "The Georgia gubernatorial primary is shaping up to be one of the most competitive in the country.",
    "Both Kemp and Perdue have launched ads of their own in recent weeks.",
    "But Georgia has a proven conservative leader fighting back: Gov.",
    "Brian Kemp against a difficult primary challenge.",
    "--Updated at 1:32 p.m.",
    "And Gov."
  ]
}