{
  "id": 1413,
  "mediaId": 238,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "Stacey Abrams apologizes for posing maskless with elementary students: That was a mistake'",
  "image": "",
  "link": "https://www.washingtonpost.com/nation/2022/02/09/stacey-abrams-mask-photo-apology/",
  "mediaOutlet": "Washington Post",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1004,
    1394,
    1646,
    1951,
    2095,
    4325,
    428,
    439,
    2590,
    2641,
    2672
  ],
  "sentences": [
    "Brian Kemp, who is running for reelection, in a Saturday tweet said that while Abrams wants state government mask mandates for Georgians and their children,? it looks like they wouldn't apply when she's attending a photo op.? Former senator David Perdue, who is challenging Kemp in the Republican primary, tweeted that Abrams's hypocrisy knows no bounds.?\nAbrams is the latest in a long line of Democratic politicians to be criticized for bucking the coronavirus restrictions they've supported or implemented.",
    "She said she kept her mask on until she reached the lectern and took it off only because she was reading to students who were listening remotely, as well.? Abrams added that she was socially distanced from the students and said she told them she would take off her mask for the reading.",
    "Abrams added that the issue of masking in school is complicated, and we cannot make this about politics or scoring political points.?\nCoronavirus: What you need to read\nThe latest: California joins growing numbers of states saying mask mandates will end in coming weeks.",
    "Georgia Democratic gubernatorial candidate Stacey Abrams said Tuesday night that excitement? prompted her to pose maskless for a photo last week with a group of elementary schoolchildren  a move that has generated a rash of mostly Republican criticism.",
    "Last week, Los Angeles Mayor Eric Garcetti, a nominee to become the U.S. ambassador to India, was criticized for not wearing a mask in a photo at a football game, in defiance of Los Angeles County rules for big events.",
    "Newsom announced Monday that California's mask mandate would expire Feb. 15, while New Jersey, Connecticut, and Delaware have announced plans to end statewide mask mandates in schools, The Washington Post reported.",
    "If elected, Abrams said, she would look at the science? and follow the protocols.? About 53 percent of people in Georgia are fully vaccinated, according to Post tracking, compared with about 64 percent nationally.",
    "And I apologize.?\nAfter posting the photo, Abrams received intense backlash from right-wing critics who oppose mask mandates in schools, including her Republican opponents in the November governor's race.",
    "Citing plans to ease mask mandates in New Jersey, Burnett asked Abrams on Tuesday night whether she would recommend Georgia schools relax mask rules if she were elected governor.",
    "And then the excitement after I finished  because it was so much fun working with those kids  I took a picture, and that was a mistake,? Abrams told host Erin Burnett.",
    "Abrams, citing Georgia's vaccination rates, said her state is not ready to have a conversation? about dropping mask requirements in certain school districts.",
    "On CNN's OutFront,? Abrams explained that she was in the Decatur, Ga., elementary school classroom for a Black History Month reading event on Friday.",
    "Protocols matter, and protecting our kids is the most important thing, and anything that can be perceived as undermining that is a mistake.",
    "Some districts have continued requiring masks, while others have begun to ease their rules, the Atlanta Journal-Constitution reported.",
    "The firestorm around Abrams's photo comes as several states have committed to relaxing mask mandates as soon as next week.",
    "Vaccines: Pfizer and BioNTech have sought emergency authorization of the first coronavirus vaccine for children under 5.",
    "At-home tests: Medicare to offer free at-home tests from pharmacies, starting in early spring.",
    "Here's how to use at-home covid tests, where to find them and how they differ from PCR tests.",
    "Mask guidance: The CDC has recommended better masks to protect against the omicron variant.",
    "Georgia school districts have been allowed to decide whether to impose mask mandates.",
    "Oregon plans to end its mask mandate for indoor public places by the end of March.",
    "Here's why N95s are so effective and how to safety reuse your N95 and KN95 masks.",
    "He defended himself by saying he wasn't breathing while he posed for the photo.",
    "Gavin Newsom, have drawn criticism for dining out during shutdowns.",
    "Other California Democrats, including Gov.",
    "See the latest coronavirus numbers.",
    "FDA says it will review.",
    "Republican Gov."
  ]
}