{
  "id": 1417,
  "mediaId": 1576,
  "date": "2/9/2022 12:00:00 AM",
  "headline": "Bill banning 'divisive concepts' on race advances in Georgia",
  "image": "https://www.wabe.org/app/uploads/2022/01/GoldDome.021119-e1575903082217-1-336x189.jpg",
  "link": "https://www.wabe.org/bill-banning-divisive-concepts-on-race-advances-in-georgia/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1012,
    2095,
    122,
    228,
    2640,
    2672
  ],
  "sentences": [
    "Banned concepts would include claims that the United States is fundamentally or systematically racist,? that any people, are inherently racist or oppressive, whether consciously or unconsciously? and that no one should feel discomfort, guilt, anguish, or any other form of psychological distress because of his or her race.? Bills using identical language have been proposed in dozens of states, backed by the Center for Renewing America, a think tank led by former Trump administration officials.",
    "No matter what authors have built into these bills intend for them to do, their obvious outcome is going to be to further whitewash what is taught to our Georgia children about race and minimize the painful and violent oppression that Black Georgians and indigenous peoples have experienced at the hands of their white neighbors,? said Stephanie Jackson Ali, policy director for the New Georgia Project.",
    "Conservative efforts to regulate what Georgia schools can teach about race are advancing in the General Assembly after the public got its first chance to comment on the proposed ban on teaching divisive concepts.?\nA House Education subcommittee sent a revised version of House Bill 1084 ahead to the full committee on a split voice vote, where it awaits further action.",
    "His measure now says subjects must be taught in a professionally and academically appropriate manner and without espousing personal political beliefs.? It originally said people must teach in an objective manner,? prompting complaints that teachers couldn't say slavery or the Holocaust were wrong.",
    "Then we're in he-she said situation when no amount of appealing will settle it.?\nAndrea Young, executive director of the American Civil Liberties Union of Georgia, suggested that disciplining a teacher for a violation would violate their constitutional right to due process.",
    "What it does is empower parents to ensure that kids and children in our schools of all races are not pitted against each other.?\nBut many opponents say the measure would frighten teachers away from an honest classroom discussion of race in history and the present day.",
    "The point is to prevent telling elementary school age children that they're inherently racist, no matter their actions or intentions, to basically avoid those kind of conversations,? Sen. Jason Anavitarte, a Republican from Dallas, said Monday.",
    "Republicans are reacting against critical race theory, a term stretched from its original meaning as an examination of how societal structures perpetuate white dominance to a broader indictment of diversity initiatives and teaching about race.",
    "It's too vague for any educator to fully understand whether or not they will be punished for teaching or saying something about race or racism that falls into what can be considered by someone to be a divisive concept,? Young said.",
    "No matter how well the teacher or other officials respond, there are likely to be complaints that one or more of the divisive concepts were taught, acted upon, promoted or encouraged,? Pauly said.",
    "Committees were also taking up measures to limit obscene materials, bar transgender girls from playing school sports, and give parents new rights to demand to see teaching materials.",
    "Brian Kemp, after attacks from Republican gubernatorial primary rival David Perdue, announced he was working on legislation that would bar schools from mandating masks in classrooms.",
    "Justin Pauly of the Georgia School Boards Association said his group appreciated Wade's changes, but suggested the measure would still result in complaints.",
    "Supporters say they're getting many complaints from parents and that students need to be taught that they are individuals first, not part of racial groups.",
    "Wade made some changes after discussions, including lengthening the time that principals have to investigate and rule on whether violations have occurred.",
    "Wade's measure bans teaching a list of divisive concepts? originally listed in a now-repealed 2020 executive order by former President Donald Trump.",
    "The measure was just one of multiple bills considered Wednesday in a broad conservative attack on how schools are run and who should be in charge.",
    "The bill's sponsor, Republican Rep. Will Wade of Dawsonville, told members the measure is needed to stop people from fomenting racial division.",
    "A similar measure, Senate Bill 377, was discussed but not voted on Monday in a Senate committee.",
    "This bill does not limit an educator,? Wade told the committee.",
    "Follow Jeff Amy on Twitter at http://twitter.com/jeffamy.",
    "Feb 7, 2022\nFeb 3, 2022\nTrending",
    "Gov."
  ]
}