{
  "id": 1432,
  "mediaId": 1576,
  "date": "2/8/2022 12:00:00 AM",
  "headline": "Perdue lags Kemp in fundraising in Georgia governor's race",
  "image": "https://www.wabe.org/app/uploads/2022/02/AP22039241726773-336x189.jpg",
  "link": "https://www.wabe.org/perdue-lags-kemp-in-fundraising-in-georgia-governors-race/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    807,
    896,
    1116,
    1147,
    1182,
    1248,
    1274,
    1434,
    1460,
    1646,
    1951,
    2040,
    2087,
    2095,
    4325,
    428,
    2672,
    2686
  ],
  "sentences": [
    "While Brian Kemp collects checks from lobbyists and special interest groups, David Perdue is traveling around the state and connecting with thousands of everyday Georgians.?\nA legal challenge did help even the score somewhat when a federal judge preliminarily ordered Kemp on Monday not to spend money from a special leadership committee, which under state law can collect unlimited contributions even during the legislative session.",
    "His campaign also noted that Republican primary challenger Vernon Jones dropped out of the governor's race and endorsed Perdue Monday,\nAs the only Trump-endorsed candidate in this race, David Perdue has the message, the momentum, and the grassroots network to win in May and defeat Stacey Abrams in November,? Perdue spokesperson Jenni Sweat said.",
    "LABOR COMMISSIONER\nRepublican State Sen. Bruce Thompson of White raised $71,000 for his primary challenge against Republican Labor Commissioner Mark Butler, boosting his cash pile to $197,000, while Butler raised $14,000 and ended with nearly $106,000 in cash.",
    "SECRETARY OF STATE\nCongressman Jody Hice, running with Trump's backing, raised more than $1 million in his primary challenge against fellow Republican and incumbent Brad Raffensperger, who spurned Trump's efforts to overturn Joe Biden's victory in Georgia.",
    "Here's a look at fundraising for other offices:\nLIEUTENANT GOVERNOR\nState Sen. Burt Jones, a Jackson Republican, outraised his main rival during the seven month period, collecting $1.7 million to Senate President Pro Tem Butch Miller's $1.4 million.",
    "STATE SCHOOL SUPERINTENDENT\nTwo suburban Democratic school board members began their campaigns strongly, with Cobb County's Jaha Howard raising $117,000 and Gwinnett County's Everton Blair raising $106,000.",
    "Kemp's leadership committee, called Georgians First, raised $2.3 million and spent $1.7 million before the judge shut the tap with a preliminary injunction after Perdue sued claiming it was unfair.",
    "Former Milledgeville Mayor Floyd Griffin raised almost $67,000 and had $21,000 in cash, while former Cobb County Democratic Party chair Michael Owens raised $59,000 and had $24,000 on hand.",
    "Perdue raised $1.1 million by Jan. 31 after entering the race in early December, while Kemp banked $7.4 million in the seven months ended Jan. 31, according to their reports filed Monday.",
    "Kemp spokesperson Cody Hall called Perdue's total embarrassing.? He said Perdue's ego driven campaign is down in the polls? and can't raise money.?\nIt is abundantly clear Gov.",
    "Miller has raised more overall from contributors since starting his campaign, but Jones loaned his campaign $2 million of his own money, boosting his cash on hand past Miller.",
    "On the Democratic side, new entrant Charlie Bailey raised $527,000 in the three weeks after jumping from the attorney general's race to the lieutenant governor's race.",
    "AGRICULTURE COMMISSIONER\nState Sen. Tyler Harper of Ocilla, the only Republican declared for the open seat, raised $417,000 and ended the period with $824,000 in cash.",
    "Christian Wise Smith, an Atlanta lawyer also running in the Democratic primary, started his campaign after the Jan. 31 filing deadline and didn't have to report.",
    "On the Democratic side, state Rep. Winfred Dukes of Albany raised more than $64,000, while 2018 Democratic nominee Willie Fred Swann raised almost $21,000.",
    "INSURANCE COMMISSIONER\nRepublican John King, appointed by Kemp after previous commissioner Jim Beck was indicted, raised $217,000, with $316,000 banked.",
    "Kemp is the only Republican with the grassroots support, conservative record and resources to beat Stacy Abrams this November,? Hall said.",
    "Democratic state Sen. Jen Jordan of Sandy Springs took in nearly $655,000, concluding the period with more than $1 million in the bank.",
    "The incumbent reported having $12.7 million in his main campaign account, while Perdue had less than $1 million in cash on hand.",
    "Democratic state Sen. Lester Jackson of Savannah and state Rep William Boddie of East Point hadn't filed as of Tuesday morning.",
    "ATTORNEY GENERAL\nRepublican incumbent Chris Carr raised $825,000 during the period and had $1.5 million in the bank.",
    "Democrat Stacey Abrams, by comparison, raised $9.25 million after entering the race only a few days ahead of Perdue.",
    "Incumbents are barred from raising money for their personal campaign accounts while the General Assembly is meeting.",
    "State Rep Renitta Shannon of Atlanta collected $74,000 while state Rep. Derrick Jackson of Tyrone raised $64,000.",
    "Among Democrats, state Rep. Bee Nguyen of Atlanta raised $691,000 and ended the period with $944,000 in the bank.",
    "While Perdue had much less time than Kemp, he raised far less than his rivals in his campaign's first 56 days.",
    "Perdue is betting that his support from former President Donald Trump can overcome his monetary disadvantage.",
    "But Hice is spending money almost as fast as he raises it, ending the period with $648,000 on hand.",
    "Incumbent Superintendent Richard Woods raised $14,000 in the period, ending with $15,7000 on hand.",
    "Former Alpharetta mayor and Republican David Belle Isle raised $212,000 and had $112,000 on hand.",
    "Brian Kemp is far outraising his main Republican primary challenger, former Sen. David Perdue.",
    "Among Democrats, state Rep. Matthew Wilson raised $120,000 and had $99,000 in cash.",
    "Democrat Nicole Horn of Atlanta raised $122,000 and ended with $79,000 in cash.",
    "Former Lithonia mayor and U.S. Senate candidate Deborah Jackson raised $2,400.",
    "Raffensperger raised $322,000 and ended the period with $513,000 in the bank.",
    "State Rep. Erick Allen of Smyrna collected $192,000 and had $172,000 banked.",
    "His Republican challenger John Barge raised $51,000 and had $5,000 in cash.",
    "Janice Laws raised more than $32,000 and had $21,000 remaining.",
    "Nakita Hemingway, a Gwinnett County Democrat, raised $28,000.",
    "Jones has $3 million in cash, while Miller has $2.6 million.",
    "Manswell Peterson hadn't filed as of Tuesday morning.",
    "Carr has no announced primary challenger.",
    "Geoff Duncan is not seeking another term.",
    "Lt. Gov.",
    "Trending",
    "Gov."
  ]
}