{
  "id": 1442,
  "mediaId": 195,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "The Memo: Stacey Abrams faces growing furor over mask-free photo",
  "image": "https://thehill.com/sites/all/themes/thehill/images/redesign/thehill-logo-big.png",
  "link": "https://thehill.com/homenews/campaign/593187-the-memo-stacey-abrams-faces-growing-furor-over-mask-free-photo",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Niall Stanage",
  "authorUrl": "https://thehill.com/author/niall-stanage",
  "termIds": [
    661,
    787,
    1550,
    1611,
    1646,
    1951,
    2095,
    4325,
    2641,
    2672
  ],
  "sentences": [
    "Both Republicans seized on Abrams's error, with Kemp spokesman Tate Mitchell saying, This kind of hypocrisy is exactly why Georgians see her campaign for governor for what it truly is: a quest for more power.? Perdue released a video featuring the photo and the slogan Unmask our kids.?\nAbrams's campaign shot back with a statement castigating her opponents for continuing to look for opportunities to distract from their failed records when it comes to protecting public health during the pandemic.?\nIt's clear that Abrams has delivered a gift to her opponents.",
    "DeSantis's refusal to say whether he has received a booster shot drew implicit criticism from Trump himself, who last month told One America News that politicians who take that stance are gutless.?\nTrump added, You gotta say it, whether you had it or not.?\nThe former president and former first lady Melania Trump were vaccinated in January 2021, but that did not become publicly known for two months.",
    "The controversy reached ABC's The View? on Monday, with even liberal co-host Joy Behar declaring that Abrams had kind of slipped up.?\nOn the same show, Ana Navarro, an anti-Trump Republican strategist, opined that it was a stupid thing to do.?\nThe furor could have the most far-reaching electoral consequences, both in terms of Abrams's own race and other contests across the country.",
    "The image is especially potent because it hits upon three of the most emotive topics within the broader discussion of COVID-19 restrictions: masking, education and whether excessive restrictions are being placed upon very young children, for whom the statistical probability of becoming seriously ill with COVID-19 is very small.",
    "What opponents are trying to say is that there is a tremendous amount of hypocrisy from lawmakers who say, Masks for thee but not for me.' In this case, it is a very stark image that crystallizes all of her opponents' criticisms of her,? Republican strategist Kevin Madden told this column.",
    "Gavin Newsom (D) gave impetus to a recall effort against him when he was photographed dining out in a large group at a lobbyist's birthday party when he was advising his state's residents not to socialize beyond their immediate family.",
    "Abrams, a Democratic icon and voting rights activist who is making her second bid to become governor of Georgia, retweeted and then deleted a tweet that showed her visit to an elementary school in Decatur, Ga.",
    "But he, Los Angeles Mayor Eric Garcetti (D) and San Francisco Mayor London Breed (D), sparked new controversy recently when they were photographed maskless with NBA great Magic Johnson at an NFL game.",
    "That said, it's not as if Democrats are the only ones who have been accused of hypocrisy  or at least a discordance between their public stances and their personal actions  during the pandemic.",
    "The photograph, with the smiling and maskless Abrams sitting cross-legged amid a group of elementary school students, seems virtually tailor-made for her opponents in Georgia.",
    "British Prime Minister Boris Johnson is fighting for his political life after it was revealed that he attended parties at a time when Britons were under strict lockdown rules.",
    "Abrams is beloved among the Democratic base for her efforts on voting rights, but she cannot afford another defeat, having already lost one gubernatorial bid to Kemp in 2018.",
    "While the political back-and-forth continues, independent observers are left scratching their heads as to how a seasoned politician could make such an elementary error.",
    "Critics say that Republicans further afield will pounce on it as the perfect illustration of what they see as Democratic double standards and high-handedness.",
    "Brian Kemp (R), who has incurred the wrath of former President Trump, is trying to beat back a primary challenge from former Sen. David Perdue (R-Ga.).",
    "But her misstep is far from the first prominent instance of politician getting caught in a COVID-19-related row that could easily have been avoided.",
    "I want to apologize to you because I need to preach and practice, not just preach and not practice,? a penitent Newsom said in November 2020.",
    "The deletion did nothing to quell the row, which has become a talking point beyond the limited confines of the political world.",
    "It's a bit puzzling,? said Grant Reeher, a political science professor at Syracuse University, reflecting on the Abrams photo.",
    "It is not going to just define one Georgia race.?\nThe row did resonate more deeply in Georgia than anywhere else, of course.",
    "Stacey Abrams is caught in a deepening storm after being photographed maskless amid a group of masked schoolchildren.",
    "Whoever wins that fight is near-certain to face Abrams, who is the only major Democratic candidate running.",
    "Garcetti's explanation that he had held his breath while the photo was being taken drew widespread mockery.",
    "Greg Abbott, Republicans in the vanguard of opposition to vaccine mandates, are both themselves vaccinated.",
    "It's their job to make sure this stuff doesn't happen.?\nThe Memo is a reported column by Niall Stanage.",
    "Polls suggest a tight general election race no matter which Republican wins the nomination.",
    "For the moment, however, it is Abrams who is under the harshest spotlight.",
    "The gubernatorial race is one of the most closely watched in the county.",
    "... That photo will show up in other campaigns all across the country.",
    "Madden added, It is one image that tells a thousand stories.",
    "Back in the first year of the pandemic, California Gov.",
    "The question of COVID-19 hypocrisy has gone global too.",
    "You wonder, what is going through that person's head?",
    "In the end, he easily beat back the recall effort.",
    "And what is going through their staffers' heads?",
    "Purdue was endorsed by Trump in December.",
    "Ron DeSantis and Texas Gov.",
    "Incumbent Gov.",
    "Florida Gov."
  ]
}