{
  "id": 1448,
  "mediaId": 195,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "Vernon Jones drops bid for Georgia governor to run for Congress",
  "image": "https://cdn.jwplayer.com/v2/media/yuK7fQDN/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/593141-vernon-jones-drops-bid-for-georgia-governor-to-run-for-congress",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1147,
    1646,
    1951,
    2095,
    2203,
    2355,
    4325,
    545,
    2672,
    2858
  ],
  "sentences": [
    "I will always stand with President Trump in anywhere I serve.?\nJones didn't say which House seat he would run for, though the Atlanta Journal-Constitution reported that he is expected to mount a bid for Georgia's 10th Congressional District, which is currently represented by Rep. Jody Hice (R-Ga.).",
    "Jones's announcement came days after he met with Trump at the former president's Mar-a-Lago resort in Palm Beach, Fla. Fox News reported last week that during that meeting, Trump promised to support Jones if he ran for Congress or another statewide office.",
    "\"I believe that strong conservative voices need to be heard as we lead America into the future.?\nIn announcing his withdrawal from the race, Jones, a former Democrat who mounted an early primary challenge to Georgia Gov.",
    "After that meeting, Jones said that he was still focused on ousting Kemp, a onetime Trump ally who ran afoul of the former president after he refused to overturn the results of the 2020 presidential election in Georgia.",
    "After much prayer & consideration I have decided that I can best serve the people of Georgia in the Congress of the United States,\" Jones said in a statement posted to Twitter.",
    "While a handful of Republicans are challenging Kemp for the GOP nomination, the primary is effectively a two-way race between the incumbent governor and Perdue.",
    "Hice is not seeking reelection to his House seat this year and is instead challenging Georgia Secretary of State Brad Raffensperger (R) in a GOP primary.",
    "My priority is  and has been since Day One  is to do whatever it takes to defeat Brian Kemp who's cowardice nearly cost us our country,? Jones tweeted.",
    "Former Georgia state Rep. Vernon Jones (R) announced on Monday that he would drop out of the race for governor to instead pursue a bid for Congress.",
    "Like Kemp, Raffensperger ended up on Trump's target list for rebuffing the former president's pleas to reverse his 2020 electoral loss in Georgia.",
    "Abrams, who ran for Georgia governor in 2018 and lost to Kemp by only about 55,000 votes, is not facing any primary competition.",
    "I appreciate Vernon's willingness to serve and look forward to working together to get big things done for Georgia.\"",
    "In a statement of his own, Perdue praised Jones as a conservative patriot? and thanked him for his endorsement.",
    "Brian Kemp (R) but routinely polled well behind him, endorsed former Sen. David Perdue (R-Ga.) for governor.",
    "The eventual winner will likely go on to face Democrat Stacey Abrams in November.",
    "I'm proud to have his support of our Trump-endorsed campaign,? Perdue said.",
    "Conservatives are united and ready to beat Stacey Abrams."
  ]
}