{
  "id": 1451,
  "mediaId": 195,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "Perdue rolls out video hitting Abrams over maskless photo",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/perduedavid_020520bc_lead.jpg?itok=wY_dAH59",
  "link": "https://thehill.com/homenews/campaign/593098-perdue-turns-maskless-abrams-photo-into-campaign-ad",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Julia Manchester",
  "authorUrl": "https://thehill.com/author/julia-manchester",
  "termIds": [
    1646,
    1951,
    2095,
    4325,
    2672
  ],
  "sentences": [
    "Georgia gubernatorial candidate and former Sen. David Perdue (R) rolled out a campaign video on Monday hitting Democratic hopeful Stacey Abrams over a photo showing her maskless in front of a group of masked school children.",
    "The school's principal as well as Abrams tweeted the picture but later deleted the posts after the backlash surfaced, according to the Atlanta Journal-Constitution.",
    "Abrams faced backlash over the weekend for the photo, which was taken at a Black History Month event at Glennwood Elementary School in Decatur, Ga.",
    "\"This kind of hypocrisy is exactly why Georgians see her campaign for governor for what it truly is: a quest for more power,\" Mitchell said.",
    "Additionally, they said that she removed the mask for pictures with the knowledge that everyone around her was wearing masks.",
    "Abrams's team said she wore a mask to the school's event and took it off so students tuning in remotely could hear her.",
    "Her campaign also called the Republican attacks \"shameful,\" noting the event was honoring Black History Month.",
    "The development comes as the debate over masks, particularly in schools, intensifies.",
    "Brian Kemp (R) over his handling of masking within the state's public schools.",
    "Kemp's spokesman Tate Mitchell also criticized Abrams over the picture.",
    "\"This is the reality Brian Kemp has allowed,\" the ad says.",
    "\"This is the Georgia Stacey Abrams wants,\" the ad says.",
    "The ad also hit Perdue's primary rival, incumbent Gov.",
    "\"Unmask our kids.\""
  ]
}