{
  "id": 1452,
  "mediaId": 237,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "David Perdue gets clear shot at Georgia Gov. Brian Kemp with Vernon Jones primary exit",
  "image": "https://cdn.brid.tv/live/partners/19383/snapshot/952233.png",
  "link": "https://www.washingtonexaminer.com/news/david-perdue-gets-clear-shot-at-georgia-gov-brian-kemp-with-vernon-jones-primary-exit",
  "mediaOutlet": "Washington Examiner",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "David M. Drucker",
  "authorUrl": "https://www.washingtonexaminer.com/author/david-m-drucker",
  "termIds": [
    2455,
    2455,
    2087,
    2087,
    1951,
    1951,
    2355,
    2355,
    2186,
    2186,
    2095,
    2095,
    1646,
    1646,
    1394,
    1394,
    1147,
    1147,
    428,
    428,
    2672,
    2672,
    2945,
    2945,
    2813,
    2813,
    2834,
    2834
  ],
  "sentences": [
    "The former Democrat and former state legislator, who is black, was a strong Trump supporter in the 2020 presidential race and was the first Republican to jump into the 2022 primary against Kemp, making his decision to leave the race and endorse Perdue predictable.",
    "The move excited Perdue supporters, who appeared to relish the chance for a one-on-one matchup with Kemp and expressed confidence their candidate would scoop up Jones's presumably anti-incumbent supporters as the May 24 nominating contest nears.",
    "Perdue, endorsed by former President Donald Trump, is running primarily on the former president's claims that the governor facilitated election fraud in 2020 and delivered Georgia's electoral votes to President Joe Biden.",
    "I'm proud to have his support of our Trump-endorsed campaign.?\nJones, trailing badly in most primary polls, dropped out of the governor's race on Monday and plans to run for Congress in the midterm elections instead.",
    "The best shot they had of beating Brian Kemp was to get him into a runoff.?\nStacey Abrams, who lost to Kemp narrowly in 2018, is running again this year and is considered the putative Democratic nominee.",
    "We need his voice and we need him in the fight,? Perdue said in a statement, welcoming the endorsement Jones delivered with his withdrawal from the gubernatorial primary.",
    "Indeed, at first glance, Jones's move would appear to benefit Perdue, in that the possibility of the anti-Kemp vote dividing itself in the primary has evaporated.",
    "Vernon Jones exited the race for the Republican nomination for Georgia governor, leaving former Sen. David Perdue with an unobstructed opportunity to oust Gov.",
    "Weeks later, in a Jan. 5, 2021, runoff, Ossoff topped Perdue and was elected to a six-year term in the Senate, where he now serves.",
    "With Jones out of the race, Kemp can focus his energy on defeating Perdue and will avoid a June 21 runoff if he finishes on top.",
    "In November 2020, the then-senator finished ahead of Democratic challenger Jon Ossoff but failed to clear 50% of the vote.",
    "The calculus on behalf of David Perdue to get Vernon Jones out of the race is absolutely absurd,? a Kemp booster said.",
    "In Georgia, the first-place candidate must finish with 50% of the vote, or a runoff contest ensues.",
    "\"Vernon Jones is a conservative patriot who cares deeply about Georgia.",
    "But Kemp supporters believe the pro-Trump forces have miscalculated.",
    "He has trailed Kemp in recent public opinion polls.",
    "Perdue found that out the hard way.",
    "Brian Kemp."
  ]
}