{
  "id": 1462,
  "mediaId": 19,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "Exclusive David Perdue Slams Stacey Abrams and Brian Kemp in Unmask Our Kids' Ad",
  "image": "https://media.breitbart.com/media/2022/02/Georgia-gubernatorial-candidate-David-Perdue-Feb1-2022-getty-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/07/david-perdue-slams-stacey-abrams-brian-kemp-unmask-kids-ad/",
  "sentiment": "0",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Matthew Boyle",
  "authorUrl": "https://www.breitbart.com/author/matthew-boyle/",
  "termIds": [
    2095
  ],
  "sentences": [
    "Governor Kemp will continue fighting to put students and parents first.?\nSubsequently, Abrams' campaign manager blasted out a nasty statement accusing Republicans of racism for criticizing her appearance at a Black History Month event for school kids:\nOur opponents took a brief break from licking Trump's boots this weekend to issue baseless attacks, and it's more of their typical dishonest, wannabe tough guy fodder to distract from their failures.",
    "She wore a mask to the event, and removed it at the podium so she could be heard by students watching remotely and for photos, but only with folks who were masked https://t.co/nbl2aJRqo0\n Lauren Groh-Wargo (@gwlauren) February 6, 2022\nThe governor's race in Georgia is sure to be a barnburner this year, with former President Donald Trump openly backing Perdue in his primary bid against the sitting governor, Kemp.",
    "See the @staceyabrams campaign response here g pic.twitter.com/zOoTvkKKQg\n Lauren Groh-Wargo (@gwlauren) February 6, 2022\nIn a second tweet, Abrams' campaign manager incredulously argued that Stacey trusts science? and cited CDC guidelines for students in school  which currently recommend masks  even though Abrams herself clearly violated said recommendations in the photograph in question.",
    "In the ad, provided to Breitbart News exclusively ahead of its public release, text appears on screen first slamming Abrams: This is the Georgia Stacey Abrams wants.?\nThen, Perdue turns his sights on his GOP primary opponent for not outlawing masks on children in schools.",
    "It's time to empower parents and rein in these power-hungry career politicians.?\nDuring the entire ad, the backdrop is the photo of Abrams egregiously not wearing a mask while all the children in the school classroom behind her are wearing one.",
    "Perdue's campaign on Monday morning will release a 15-second digital ad featuring the photograph of Abrams not wearing a mask while every child in a classroom she spoke to was forced to wear one.",
    "Perdue has, alongside the ad, launched a microsite, http://unmaskourkids.gop  a sign he intends to make this a centerpiece of his campaign both in the primary and the general election.",
    "But it looks like they wouldn't apply when she's attending a photo op,? Kemp spokesman Tate Mitchell said in a statement provided to Breitbart News over the weekend.",
    "Then the ad says, Unmask our kids.?\nWe all know Stacey Abrams' hypocrisy knows no bounds,? Perdue said in a statement provided exclusively to Breitbart News.",
    "Liberals' thirst for power during this pandemic has caused enormous damage to our kids, while the elite like Stacey continue living their lives.",
    "Whichever one of them emerges from the primary will likely face Abrams, who by far has the highest profile of several Democrats running.",
    "This 15-second ad will start on digital platforms on Monday, and it is as of yet unclear if it will be expanded to television buys.",
    "Abrams had originally tweeted the photo but removed it from her Twitter feed when she realized how hypocritical it made her look.",
    "This kind of hypocrisy is exactly why Georgians see her campaign for governor for what it truly is: a quest for more power.",
    "Georgia gubernatorial candidate former Sen. David Perdue (R-GA) is slamming both Democrat Stacey Abrams and Republican Gov.",
    "Brian Kemp in a new Unmask Our Kids? digital ad campaign in the Peach State, Breitbart News has learned exclusively.",
    "Kemp has failed students and parents by allowing liberal school districts to force mask mandates upon them.",
    "What is even worse is that this is a classroom in Brian Kemp's Georgia, not New York or California.",
    "Stacey trusts science and supports masking in schools as it's the current CDC recommendation.",
    "Stacey Abrams wants state government mask mandates for Georgians and their children.",
    "Both Perdue and Kemp have ripped Abrams for the photo in the immediate aftermath.",
    "This is the reality Brian Kemp has allowed,? the text on screen says.",
    "Many Georgia kids are facing this mask nonsense every day.",
    "Abrams narrowly lost to Kemp in the 2018 general election.",
    "The exact amount of the opening buy is also unclear.",
    "It's a disgrace and it needs to end."
  ]
}