{
  "id": 1464,
  "mediaId": 1576,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "Judge: Kemp can't use leadership committee funds for primary",
  "image": "https://www.wabe.org/app/uploads/2022/01/AP22021753005767-336x189.jpg",
  "link": "https://www.wabe.org/judge-kemp-cant-use-leadership-committee-funds-for-primary/",
  "mediaOutlet": "WABE",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    861,
    1646,
    2095,
    4325,
    2672,
    2945
  ],
  "sentences": [
    "The law, passed by state legislators last year and signed by Kemp, allows certain top elected officials, including the governor and party nominees, to create leadership committees that can raise campaign funds without limits, including during a legislative session.",
    "Perdue and his campaign allege that the law gives Kemp a significant and unfair fundraising and spending advantage in the primary and asked the judge to declare it unconstitutional.",
    "Georgia law says candidates for statewide office can't collect more than $7,600 from an individual donor for a primary or general election and $4,500 for a runoff election.",
    "It immediately prohibits Georgians First from spending money to advocate for Kemp's reelection or his opponent's defeat during the primary and any primary runoff.",
    "Brian Kemp under a new state law must stop spending money to get the governor reelected during the Republican primary, a federal judge ruled Monday.",
    "U.S. District Judge Mark Cohen found that Perdue's lawsuit was likely to succeed and issued an order granting a preliminary injunction.",
    "Former U.S. Sen. David Perdue, who's challenging Kemp in the primary, last month filed a lawsuit challenging the new law.",
    "Just after the law took effect in July, Kemp created the Georgians First Leadership Committee.",
    "But leadership committees created under the new law are free from both of those restrictions.",
    "Incumbent officeholders also may not accept contributions during the legislative session.",
    "A leadership committee? created by Georgia Gov."
  ]
}