{
  "id": 1465,
  "mediaId": 19,
  "date": "2/7/2022 12:00:00 AM",
  "headline": "Vernon Jones Drops Out of Georgia Governor's Race, Endorses David Perdue",
  "image": "https://media.breitbart.com/media/2022/02/AP21005080050987-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/07/vernon-jones-drops-georgia-governors-race-endorses-david-perdue/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1147,
    1646,
    2095,
    2355,
    227,
    234,
    2672,
    2864,
    2945
  ],
  "sentences": [
    "Jones, a former Democrat who switched parties and became a Republican in 2021, said he plans to support former Sen. David Perdue (R-GA) in the governor's race moving forward, calling Perdue a good man who loves our state and loves our Country.?\nAfter much prayer & consideration I have decided that I can best serve the people of Georgia in the Congress of the United States,? Jones wrote in a statement Monday.",
    "#gapol (2/3)\n Cody Hall (@CodyHallGA) February 7, 2022\nIt remains to be seen if Trump will weigh in on Jones's congressional race, and the Democrat-turned-Republican has not revealed which district he plans to run in, the Tenth District or the Sixth District, both of which are solid Republican open seats, according to Georgia's newly drawn congressional maps.",
    "Kemp's campaign responded to Perdue's new endorsement pickup by highlighting controversies plaguing Jones's past, including sexual assault allegations from the early 2000s, which Jones has denied, and pro-abortion votes Jones cast in 2019 while serving as a Democrat in the state legislature.",
    "Hice, as well as Rep. Andrew Clyde (R-GA) and several other House Freedom Caucus members, have joined in on endorsing state Rep. Tim Barr in the race to replace Hice, while trucking business executive Mike Collins has proven to be a strong contender in early polls.",
    "Jones was polling at about ten percent in a recent Quinnipiac poll, in a distant third place behind Kemp and Perdue, and Perdue will likely annex much of Jones's voter support now that Jones has left the primary picture.",
    "In addition to sexual assault, Vernon's record includes voting against the Heartbeat Bill, vetoing a pay raise for law enforcement, and voting in the 2020 Democratic primary for President of the United States.",
    "I'm proud to have his support of our Trump-endorsed campaign.?\nFormer President Donald Trump has endorsed Perdue after repeatedly targeting Kemp over Georgia's 2020 election process.",
    "Former Georgia Rep. Vernon Jones announced on Monday he is no longer running for governor and will instead run for U.S. Congress in the Peach State in a district to be determined.",
    "Because of this decision I am officially withdrawing my candidacy for Governor effective today and will be supporting David Perdue for Governor.?\nStraight from the horse's mouth!",
    "In the Sixth District, physician and military veteran Rich McCormick, who narrowly lost to Rep. Carolyn Bourdeaux (D-GA) in 2020, is making a second run for office.",
    "Now Jones, an avid Trump supporter who made election fraud concerns central to his brief campaign for governor, has aligned himself with Trump and Perdue.",
    "Several others in that race also remain viable candidates, and Jones's entrance would make for a significant shakeup should he enter the field.",
    "pic.twitter.com/GUrqu4CR3t\n Vernon Jones For Governor (@RepVernonJones) February 7, 2022\nPerdue, who is vying to unseat incumbent Gov.",
    "In the Tenth District, Trump-backed Rep. Jody Hice (R-GA) is forgoing his congressional seat to run for Georgia secretary of state.",
    "Vernon Jones is a conservative patriot who cares deeply about Georgia,? Perdue said in response to Jones's announcement.",
    "Challenging McCormick in that district are attorney Jake Evans, former state Rep. Meagan Hanson, and multiple others.",
    "I believe that strong conservative voices need to be heard as we lead America into the future,? Jones continued.",
    "Brian Kemp (R) in an already-heated Republican primary race, welcomed Jones's support.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "We need his voice and we need him in the fight.",
    "Follow her on Twitter at @asholiver."
  ]
}