{
  "id": 1474,
  "mediaId": 195,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Kemp invokes Trump in ad after former president slams him in ad for Perdue",
  "image": "https://cdn.jwplayer.com/v2/media/X0FsKMA2/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/592881-kemp-invokes-trump-in-ad-after-former-president-slams-him-in-ad-for-perdue",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1147,
    1646,
    1951,
    2095,
    4325,
    415,
    2672,
    2863,
    2945
  ],
  "sentences": [
    "President Trump worked hard putting America first,? a narrator says in the ad before flashing a clip of the former president vowing to bring jobs back from China.?\nBut David Perdue sent American jobs to China over and over again, by the thousands, and made millions,? the narrator continues.",
    "But Kemp's spot, which was paid for by the governor's leadership committee, looks to turn the tables on Perdue, accusing him of outsourcing jobs to China throughout his lengthy business career despite Trump's campaign promise to bring back jobs that were sent overseas.",
    "The dueling ads underscore the bitter nature of the primary fight between Perdue and Kemp, a onetime Trump ally who drew the former president's ire after he refused to help overturn the results of the 2020 presidential election in Georgia.",
    "A Quinnipiac University survey released last week found Kemp notching 43 percent support among likely Republican voters in Georgia, while Perdue finished second with 36 percent.",
    "The 30-second spot comes just a few days after former Sen. David Perdue (R-Ga.), whom Trump has endorsed to replace Kemp, unveiled the first ad of his gubernatorial campaign.",
    "Brian Kemp (R) is responding to an ad from his chief primary rival that heavily features Donald Trump with a spot of his own invoking the former president.",
    "Abrams, who previously faced Kemp in the 2018 race for governor, isn't facing any primary opposition, giving her a glide path to the Democratic nomination.",
    "Despite Trump's efforts to oust Kemp, the incumbent governor has pushed on with his campaign, and recent polling shows him with a clear lead over Perdue.",
    "The eventual nominee will likely go on to face Democrat Stacey Abrams in the November general election.",
    "The ad then features a clip of Perdue saying that he was proud? to outsource jobs.",
    "That ad features Trump himself hammering Kemp and touting his support for Perdue.",
    "Still, there's plenty of time between now and the May 24 primary.",
    "Georgia Gov."
  ]
}