{
  "id": 1477,
  "mediaId": 65,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Georgia GOP gubernatorial clash: Kemp uses Trump's past words to target Perdue",
  "image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/db3703bb-0088-48a1-b1c5-c4a014dff861/37a7e217-98d2-442f-9334-4e096cf2f252/1280x720/match/image.jpg",
  "link": "https://www.foxnews.com/politics/georgia-gop-gubernatorial-clash-kemp-trump-past-words-target-perdue",
  "mediaOutlet": "FOX News",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Paul Steinhauser",
  "authorUrl": "https://www.foxnews.com/person/s/paul-steinhauser",
  "termIds": [
    2095,
    2095,
    2087,
    2087,
    1951,
    1951,
    1147,
    1147,
    1646,
    1646,
    428,
    428,
    146,
    146,
    227,
    227,
    2672,
    2672
  ],
  "sentences": [
    "And the most recent poll in the Georgia GOP gubernatorial primary indicates Kemp with the edge with four months to go until the May 24 primary\nAccording to a Quinnipiac University survey conducted Jan. 19-24, Kemp was supported by 43% of likely Republican primary voters, with 36% backing Perdue and former state lawmaker Vernon Jones, a Democrat turned Republican who was one of Trump's top Black surrogates in Georgia in the 2020 White House race, at 10%.",
    "TRUMP WORLD SEVERS TIES WITH LEWANDOWSKI\nJones, after meeting with Trump last week, is expected to announce in the coming days that he's dropping his gubernatorial bid and running for Congress or state insurance commissioner with the former president's endorsement.",
    "The spot includes a clip from Trump from a 2016 GOP presidential primary debate saying, \"I'm going to bring jobs back from China\" before the narrator charges that \"David Perdue sent American jobs to China, over and over again, by the thousands, and made millions.\"",
    "ENCOURAGED BY TRUMP, PERDUE LAUNCHES PRIMARY CHALLENGE AGAINST KEMP\n\"It shocks no one that a guy who sided with Democrats over President Trump is now telling lies about a Trump-endorsed candidate,\" the Perdue campaign told Fox News.",
    "Brian Kemp of Georgia is using former President Trump's own words in a new TV ad to take aim at former Sen. David Perdue, the Trump-backed candidate who is primary challenging the conservative governor.",
    "The voting rights organizer, former state Democratic legislative leader and rising national star in her party launched her second straight run for governor a week before Perdue jumped into the race.",
    "Democrat Raphael Warnock edged Republican Sen. Kelly Loeffler in the other contest, handing the Democrats the Senate majority\nKemp has built a formidable war chest as he runs for re-election.",
    "But the governor earned Trump's ire starting in late 2020, after he certified now President Biden's narrow victory in Georgia in the presidential election, following two recounts of the vote.",
    "Perdue was first elected to the Senate in 2014 but was defeated in his bid for a second term by a razor-thin margin by Democrat Jon Ossoff in Georgia's twin Jan. 5, 2021, runoff elections.",
    "Trump, who had unsuccessfully urged Kemp and other top Republican officials in the state to overturn the results, has repeatedly vowed to return to Georgia to campaign against Kemp.",
    "As first reported by Fox News a month ago, the governor hauled in over $7 million during the second half of 2021 and started the new year with over $12 million cash on hand.",
    "This isn't the first time Georgians First Leadership Fund has attacked Perdue, a former corporate chief executive officer, over the issue of outsourcing jobs to China.",
    "Georgians First Leadership Fund told Fox News it's spending in the low six figures to run the commercial on statewide TV and on digital starting this weekend.",
    "Trump for months urged Perdue to primary challenge the governor, and late last year he endorsed Perdue a day after the former senator launched his bid.",
    "The ad, which was shared first nationally with Fox News, ends with the narrator claiming that Perdue is \"putting himself first and America last.\"",
    "Perdue's move set up an epic GOP primary battle with Kemp in a one-time solidly red state that's become a top general election battleground.",
    "\"President Trump worked hard, putting America first,\" the narrator in a TV commercial by Georgians First Leadership Fund says.",
    "He has my complete and total endorsement,\" Trump says to camera in the spot, which is also running statewide on TV.",
    "Four years ago, with the support of Trump, Kemp narrowly defeated Democrat Stacey Abrams to win the governorship.",
    "\"Georgia needs a governor who won't bow down to the woke mob and who's willing to make waves to get things done.",
    "The Kemp-allied group went up with a similar themed ad in December, soon after Perdue declared his candidacy.",
    "At the time, Perdue's campaign hit back, accusing Kemp of \"using recycled lies from Democrats.\"",
    "Earlier this week, Trump took aim at Kemp in the Perdue campaign's first TV commercial.",
    "The winner of the GOP gubernatorial primary will face off in November with Abrams.",
    "The other candidates all polled in the lower single digits, with 5% undecided.",
    "Kemp's also facing primary challenges from two other lesser-known candidates.",
    "EXCLUSIVE: An outside group aligned with Republican Gov.",
    "David Perdue will be our next governor.\"",
    "\"David Perdue is an outstanding man.",
    "Brian Kemp failed Georgia.",
    "He's tough.",
    "He's smart."
  ]
}