{
  "id": 1478,
  "mediaId": 43,
  "date": "2/4/2022 12:00:00 AM",
  "headline": "Morning Digest: New House fundraising reports shed light on",
  "image": "https://images.dailykos.com/images/1033624/story_image/WV-02.png?1643927599",
  "link": "https://www.dailykos.com/story/2022/2/4/2078467/-Morning-Digest-New-House-fundraising-reports-shed-light-on-incumbent-vs-incumbent-races",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1332,
    1454,
    2095,
    2277,
    2510,
    2558,
    2579,
    2593,
    2618,
    2712,
    2745
  ],
  "sentences": [
    "Country * Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia, Plurinational State of Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cabo Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Cte d'Ivoire Croatia Cuba Curaao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia, the former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Runion Romania Russian Federation Rwanda Saint Barthlemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia ZimbabweUnited States\nAttribution: Stephen Wolf / Daniel Donner\nBy signing up for this newsletter, you may also receive other updates from Daily Kos.",
    "Mayors\n? Los Angeles, CA Mayor: Los Angeles Magazine has summarized fundraising reports spanning the second half of 2021, which show Rep. Karen Bass went into the new year with a sizable financial edge over her many opponents in the June nonpartisan primary to lead this very blue city:\nRep. Karen Bass: $1.9 million raised, $1.6 million cash-on-hand\nCity Councilmember Kevin de Len: $1.2 million raised, $1.2 million cash-on-hand\nCentral City Association head Jessica Lall: $405,000 raised, $265,000 cash-on-hand\nCity Councilmember Joe Buscaino: $375,000 raised, $575,000 cash-on-hand\nCity Attorney Mike Feuer: $245,000 raised, $525,000 cash-on-hand\nBusinessman Ramit Varma: $180,000 raised, additional $1.5 million self-funded, $1.7 million cash-on-hand\nReal estate broker Mel Wilson: $141,000 raised, $37,000 cash-on-hand\nPerhaps the biggest question looming over the race ahead of the Feb. 12 filing deadline is whether real estate developer Rick Caruso, who has flirted with running before, gets in this time.",
    "Pete Ricketts:\nUniversity of Nebraska Regent Jim Pillen: $4.4 million raised, additional $1 million self-funded, $4.2 million cash-on-hand\nState Sen. Brett Lindstrom: $1.6 million raised, $1.4 million cash-on-hand\nAgribusinessman Charles Herbster: $200,000 raised, additional $4.7 million self-funded, $637,000 cash-on-hand\nformer state Sen. Theresa Thibodeau: $106,000 raised, additional $7,000 self-funded, $87,000 cash-on-hand\nAmusingly, Ricketts, who poured $12 million of his money into his unsuccessful 2006 campaign against Democratic Sen. Ben Nelson, pooh-poohed Herbster's personal investment to the Examiner, saying that self-funding looks like \"you're trying to buy the race.\"",
    "Their fourth quarter fundraising numbers are below:\nTimken: $595,000 raised, additional $1.5 million self-funded, $3.6 million cash-on-hand\nVance: $530,000 raised, $1.1 million cash-on-hand\nMandel: $370,000 raised, $6 million cash-on-hand\nDolan: $360,000 raised, additional $10.5 million self-funded, $10.4 million cash-on-hand\nGibbons: $70,000 raised, additional $3.5 million self-funded, $6.4 million cash-on-hand\nThings are far less chaotic on the Democratic side, where Rep. Tim Ryan is the likely nominee.",
    "Moreno, who kicked off a $4 million TV ad campaign in December, said, After talking to President Trump we both agreed this race has too many Trump candidates and could cost the MAGA movement a conservative seat.?\nThe development came one day after another Republican contender, former state Treasurer, Josh Mandel, released a WPA Intelligence poll arguing that he has the lead in this extremely expensive primary.",
    "The results are below, with the firm's earlier numbers in parentheses:\n43-40 vs. former state Sen. Scott Jensen (48-36)\n42-37 vs. state Sen. Paul Gazelka (47-34)\n45-37 vs. state Sen. Michelle Benson (47-35)\n43-35 vs. healthcare executive Kendall Qualls\n44-35 vs. Lexington Mayor Mike Murphy (47-36)\n45-34 vs. physician Neil Shah (48-31)\nThe earlier numbers did not include Qualls, who launched his bid last month.",
    "? TX-08: The March 1 Republican primary to succeed retiring Rep. Kevin Brady has turned into what the Texas Tribune's Patrick Svitek characterizes as an expensive \"proxy war\" between retired Navy SEAL Morgan Luttrell, who has the House GOP leadership in his corner, and Christian Collins, a former Brady campaign manager backed by Sen. Ted Cruz and his allies in the nihilistic House Freedom Caucus.",
    "James, who launched his House bid on Monday, currently is the only notable Republican seeking this suburban Detroit seat, which Donald Trump would have carried 50-49.\n? OR-06: Carrick Flynn, who has worked as a University of Oxford associate researcher, announced Tuesday that he was entering the Democratic primary for Oregon's brand-new 6th District.",
    "The congressional plan, if it works as Democrats intend, could bump their advantage in the state's delegation from 19-8 to 22-4.\n? WA Redistricting: Washington's Democratic-run state House approved congressional and legislative maps drawn by the state's bipartisan redistricting commission with minor tweaks in a wide bipartisan vote on Wednesday.",
    "Josh Green: $775,000 raised, $1.1 million cash-on-hand\nBusinesswoman Vicky Cayetano: $475,000 raised, additional $350,000 self-funded, $655,000 cash-on-hand\nformer Honolulu Mayor Kirk Caldwell: $345,000 raised, $720,000 cash-on-hand\nNone of the Republicans currently in the race have reported raising a notable amount.",
    "NC-11: This solidly red district in the Greensboro region is the only one that's lumped together members of opposite parties: Democrat Kathy Manning, who raised $280,000 and had $1.1 million left over, and Republican Virginia Foxx, who took in $231,000 and finished with $957,000 in her war chest.",
    "? IA-Gov: The Des Moines Register's Brianne Pfannenstiel relays that some Iowa Democrats are seeking an alternative to Deidre DeJear, the 2018 secretary of state nominee who ended last year with less than $10,000 on-hand, though there's no sign anyone else is looking to take on Republican Gov.",
    "The story notes that the two leading candidates for this safely red suburban Houston district don't seem to actually disagree on anything substantive, but Collins has been trying hard to frame the race as a battle between D.C. power players and \"those who are the tip of the spear.\"",
    "Pfannenstiel writes that some of \"the names being floated\" are 2018 nominee Fred Hubbell, state Treasurer Michael Fitzgerald, and state Reps. Chris Hall and Todd Prichard, but none of them have shown any obvious interest in getting in ahead of the March 18 filing deadline.",
    "Senate\n? AZ-Sen: The radical anti-tax Club for Growth has endorsed Blake Masters, a top aide to conservative megadonor Peter Thiel who also has the support of a super PAC funded by his boss, in the crowded August Republican primary to face Democratic Sen. Mark Kelly.",
    "Kemp, however, will have to spend much of that money in his already bitter primary feud with former Sen. David Perdue, who has yet to say how much he's raised and \"has tried to downplay expectations,\" according to the Atlanta Journal Constitution's Greg Bluestein.",
    "Renacci has filled his coffers with millions from his own wallet, though skeptical Republicans remember that he barely used any of the money he loaned himself for his 2018 Senate campaign, which ended in a 53-47 loss to Democratic incumbent Sherrod Brown.",
    "Ramirez's main intra-party opponent is Chicago Alderman Gilbert Villegas, who outraised her $385,000 to $115,000 during the fourth quarter of 2021 (the first in the race for both candidates) and ended December with a $375,000 to $110,000 cash-on-hand.",
    "That's not a surprise, though: In September, Donald Trump blasted the state senator, who co-owns Cleveland's Major League Baseball team, over its plans to change its name, snarling, \"I know of at least one person in the race who I won't be endorsing.\"",
    "? MI-10: Eric Esshaki, who was the 2020 Republican nominee in the old 11th District, announced Thursday that he was dropping out of the August primary for the new (and open) 10th District and would instead endorse two-time Senate nominee John James.",
    "Collins, however, is getting some serious reinforcements: Svitek reports that three super PACs almost entirely funded by a Cruz ally, banker Robert Marling, have spent $800,000 for Collins while Luttrell has yet to benefit from any outside money.",
    "Attorney Shay Hawkins, a Republican who last year announced a bid for the 13th District, filed Tuesday for a seat in the legislature and said he'd make an ultimate decision about which office to seek once congressional districts are in place.",
    "Dan Cox, a Trump-endorsed candidate who played a role in the Jan. 6 insurrection at the Capitol by organizing a busload of people to attend the rally that preceded it, is well-positioned in the June Republican primary in this dark blue state.",
    "Here's how things stack up in the other half-dozen similarly situated races:\nGA-07: Lucy McBath beat out Carolyn Bourdeaux $736,000 to $400,000 and had $3.2 million on-hand versus $2.4 million in this safely blue seat in the Atlanta suburbs.",
    "Whatever the justices decide, litigation is likely, as critics have charged that the maps fail to adequately increase representation for communities of color even though most of the state's growth has come from Black and Latino residents.",
    "MI-04: This matchup hasn't yet firmed up: Bill Huizenga, a Trump loyalist, has said he'll seek re-election in this red-tilting district in southwestern Michigan, but Fred Upton, who voted for impeachment, has yet to announce his plans.",
    "The toplines are below, with the numbers from an early January WPA survey for Mandel's allies at the Club for Growth in parenthesis:\nformer state Treasurer Josh Mandel: 28 (26)\nBusinessman Mike Gibbons: 17 (14)\nVenture capitalist J.D.",
    "? TX-15: Insurance agent Monica De La Cruz's newest TV ad for the March 1 Republican primary features her flying over the border with Mexico as she bemoans how \"socialists are ruining our border security, our values, and our economy.\"",
    "Opt in to email updates from Daily Kos Elections\nSponsored by: Daily Kos Elections\nMcKinley, however, has an important advantage: He currently represents two-thirds of the new district, with Mooney representing the remaining third.",
    "The Daily Kos Elections Morning Digest is compiled by David Nir, Jeff Singer, Daniel Donner, and Carolyn Fiddler, with additional contributions from David Jarman, Steve Singiser, James Lambert, David Beard, and Arjun Jaikumar.",
    "Kevin Stitt outraised Superintendent of Public Instruction Joy Hofmeister, a Republican-turned-Democrat, $1.2 million to $540,000 during the fourth quarter, and he ended 2021 with a $2.3 million to $435,000 cash-on-hand lead.",
    "Meanwhile, congressional redistricting is now paused as DeSantis has asked the Supreme Court for an advisory opinion as to whether a new map can legally dismantle the plurality-Black 5th District, held by Democrat Al Lawson.",
    "That's because candidates for district-level office file with the county that makes up the largest proportion of their district rather than with the state, so lists of contenders can only be found on county election sites.",
    "Team Blue's eventual nominee will face a tough task in November in a longtime swing state that lurched hard to the right in the Trump era, but Democrats are hoping that a bloody GOP primary will give them a larger opening.",
    "Governors\n? FL-Gov: Rep. Charlie Crist has released a GBAO Strategies survey giving him a 54-28 lead over state Agriculture Commissioner Nikki Fried in the August Democratic primary, with state Sen. Annette Taddeo at 7%.",
    "The state's highest court likewise threw out the GOP's legislative maps last month, and Republicans on Ohio's bipartisan redistricting commission approved new ones on Jan. 22just eight days before the filing deadline.",
    "? OH-Sen: On Thursday evening, one day after candidate filing closed, wealthy businessman Bernie Moreno announced that he was dropping out of what's now an eight-person Republican primary to succeed retiring GOP Sen.",
    "Dolan is trying to better his fortunes by using personal wealth to go on TV, but he's far from alone: The Republican firm Medium Buying reports that close to $24 million has already been spent or reserved to air ads.",
    "Vance: 13 (10)\nformer state party chair Jane Timken: 9 (15)\nBusinessman Bernie Moreno: 6 (7)\nState Sen. Matt Dolan: 5 (4)\nThree other Republicans are also in, but none of them have been making a serious effort.",
    "Luttrell distanced himself from the congressman in January, saying he \"didn't know the check was cashed,\" but a Kinzinger spokesperson told the Tribune that the donation was made \"because it was solicited.\"",
    "He's also been seeking to use Luttrell's connections against him, including the $5,000 donation the SEAL veteran received from the PAC of Illinois Rep. Adam Kinzinger, who voted to impeach Donald Trump.",
    "That delay came about because the state Supreme Court struck down the Republican-drawn congressional map as an illegal partisan gerrymander in mid-January, and new boundaries have yet to be approved.",
    "IL-15: Rodney Davis, the more moderate of the two Republicans running in this deep red district in central Illinois, raised $410,000 compared to $164,000 for Mary Miller, who has Trump's endorsement.",
    "He faces Morgan Harper, a former advisor to the Consumer Financial Protection Bureau who unsuccessfully challenged Rep. Joyce Beatty for renomination in 2020, as well as two little-known candidates.",
    "Kathy Hochul signed new congressional and legislative maps on Thursday evening, just hours after lawmakers in the Democratic-run legislature completed work on new districts for their own chambers.",
    "? GA-Gov: Democrat Stacey Abrams announced she raised a massive $9.2 million in the month since she kicked off her second bid for governor and says she ended January with $7.2 million in the bank.",
    "? Ohio: Candidate filing closed on Wednesday for most of the offices that will be on Ohio's May 3 primary ballot, but the legislature previously moved the deadline for U.S. House races to March 4.",
    "Dan Patrick, who is one of the most powerful far-right politicians in Texas, as well as 13th District Rep. Ronny Jackson, who was Trump's failed nominee for secretary of veteran's affairs in 2018.",
    "A list of statewide candidates can be found at the secretary of state's site, but anyone looking for a list of legislative candidates won't be able to find them all from a single official source.",
    "Nine other candidates are on the ballot, and while none of them have attracted much attention, they could keep Luttrell or Collins from winning the majority of the vote needed to avert a runoff.",
    "However, she also faces an ethics investigation into charges she sought to keep a potential primary opponent out of the race when she ran in 2020 by offering him a job as a top aide if she won.",
    "A map that ignored DeSantis' wishes and left the 5th largely intact passed the state Senate last month, but the House says it will wait until the justices rule before proceeding further.",
    "Leading Off\n? Fundraising: Daily Kos Elections is pleased to present our comprehensive roundups of fundraising data for the final three months of 2021 for both the House and the Senate.",
    "MI-11: Haley Stevens outraised Andy Levin $627,000 to $335,000 in this blue district in the Detroit suburbs, and also has much more money to spend: $2.6 million versus $1.3 million.",
    "The number of intramural battles could grow or shrink in the coming months as the remapping process continues to unfold and various members settle on their plans or alter them.",
    "The court has said it would \"retain jurisdiction for the purpose of reviewing the new plan adopted by the commission,\" so no one knows yet if these new districts will be final.",
    "However, the state constitution requires the new maps to first be reviewed by the state's conservative Supreme Court to determine their \"validity\" before they can become law.",
    "Upton certainly keeps bringing in the bucks like he expects to run again, though: He raised $719,000 to Huizenga's $396,000 and has a $1.6 million to $1.2 million cash edge.",
    "But because Mooney had stockpiled much more money prior to the start of most recent fundraising period, he still finished with a cash lead of $2.4 million to $1.6 million.",
    "House\n? IL-03: State Rep. Delia Ramirez has picked up the support of the Illinois Federation of Teachers in the June Democratic primary for this safely blue open seat.",
    "Also in the running are farmer Joe Blystone and former state Rep. Ron Hood, who badly lost last year's special election primary for the 15th Congressional District.",
    "Manning, however, hasn't yet said whether she'll seek re-election, likely because a lawsuit challenging the GOP's new map is pending before the state Supreme Court.",
    "Even though SurveyUSA shows Walz losing ground since December, he still posts a 45-37 favorable rating, which is the same margin as his 47-39 score from last time.",
    "? VA-07: Spotsylvania County Supervisor David Ross said this week that he was joining the June Republican primary to take on Democratic Rep. Abigail Spanberger.",
    "Renacci, who has spent his time trashing DeWine's handling of the pandemic, last week dropped a poll showing him leading the incumbent 46-38 in a two-way race.",
    "With redistricting underwayand complete in many statesmany sitting representatives have now found themselves paired with colleagues in redrawn House districts.",
    "Janet Mills, whom Saviello backed in 2018.\n? MD-Gov: The Democratic Governors Association is out with new numbers from Public Policy Polling arguing that Del.",
    "? HI-Gov: Hawaii News Now has gathered the fundraising reports for the second half of 2021, and the numbers for the three major Democrats are below:\nLt. Gov.",
    "The Democratic primary is a duel between two former mayors who each left office at the start of the year: Cincinnati's John Cranley and Dayton's Nan Whaley.",
    "? NE-Gov: The Nebraska Examiner has collected all the 2021 fundraising numbers for the Republicans competing in the May primary to succeed termed-out Gov.",
    "Rick Perry, has been focusing far more on his own military background, with his first ad talking about his recovery after a devastating helicopter crash.",
    "How these factors will all balance out is hard to say, though, as the two sides have released competing polls showing them each with fairly modest leads.",
    "Thanks to the loss of a seat in reapportionment, two Republicans, Alex Mooney and David McKinley, got thrown together in the northern half of the state.",
    "Some legislative candidates responded to the uncertainty by simply ending their campaigns, though one congressional contender tried something different.",
    "His many opponents, by contrast, remain pretty anonymous: Even Jensen, who comes the closest in the head-to-heads, only sports a 18-12 favorable image.",
    "Luttrell far outraised Collins during the fourth quarter, $1.2 million to $335,000, and ended 2021 with a $1.6 million to $290,000 cash-on-hand lead.",
    "The first to come online was the contest in the deeply conservative 2nd District in West Virginia, which completed the remapping process in October.",
    "In the meantime, you can dig deeper into all of these numbers and many, many more for both the House and the Senate by checking out our new charts.",
    "We haven't seen any other surveys of the contest to face Republican incumbent Ron DeSantis since well before Taddeo entered the race last October.",
    "Redistricting\n? FL Redistricting: Both chambers of Florida's Republican-run legislature have passed new legislative maps, which Republican Gov.",
    "Timken, Moreno, and Gibbons have themselves released polls this year, each arguing that neither Mandel nor anyone else has a decisive lead.",
    "McKinley swamped Mooney in the fourth quarter, outraising him $599,000 to $199,000 and self-funding another half-million for good measure.",
    "These new reports are the first to give us insight into these incumbent-vs.-incumbent matchups, which at the moment number seven in total.",
    "The GOP primary will likely get far more expensive still, as all six of these contenders ended 2021 with at least $1 million in the bank.",
    "Manning represents 42% of the redrawn 11th and Foxx 30%, but it would have voted 57-42 for Trump, making Foxx the overwhelming favorite.",
    "Mooney, conversely, won Donald Trump's seal of approval in November  but he's under investigation for allegedly misusing campaign funds.",
    "Caruso recently changed his voter registration from unaffiliated to Democratic, a move that came almost a decade after he left the GOP.",
    "However, Trump did endorse him when he was running one-on-one against Upton, who represents 64% of this seat; Huizenga represents 25%.",
    "Tim Walz against six different Republican foes, and it finds things considerably closer than when it went into the field in December.",
    "The only poll we've seen was a Whaley internal she publicized last week giving her a 33-20 edge, but with a 48% plurality undecided.",
    "Ryan outraised Harper $2.9 million to $335,000 in the most recent quarter, and he held a $5 million to $435,000 cash-on-hand edge.",
    "Mike DeWine faces three intra-party foes, but only former Rep. Jim Renacci appears to have the resources to make trouble for him.",
    "? RI-02: State Rep. Teresa Tanzi said Thursday that she would not compete in the September Democratic primary for this open seat.",
    "Brian Kemp, who brought in $7.4 million in the second half of 2021, though he has a considerably larger $12.7 million war chest.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "The ad goes on to exalt Zeldin as a veteran who has \"won seven tough elections\" and a \"tax-fighting, trusted conservative.\"",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Levin could still change course and run in the open 10tha much swingier seat, but one he already represents two-thirds of.",
    "? NY-Gov: Rep. Lee Zeldin's first TV spot ahead of the June Republican primary features several photos of Democratic Gov.",
    "Ricketts, who is backing Pillen, added, \"You want to engage Nebraskans across the state to invest in your campaign.",
    "Kathy Hochul with her disgraced predecessor, Andrew Cuomo, as the narrator argues that the state is in poor shape.",
    "Former Hennepin County Sheriff Rich Stanek, who announced this week, was also not asked about in either poll.",
    "A third candidate, state Rep. Steve Carra, recently switched districts to run here but raised just $129,000.",
    "But the situation is also unclear for candidates for the state legislature, who still had to file Wednesday.",
    "Both are encountering a lot of new turf, though: Miller represents 31% of the new district and Davis 28%.",
    "IL-06: Sean Casten more than doubled up fellow Democrat Marie Newman, taking in $699,000 to her $337,000.",
    "(Though Moreno's subsequent departure indicates that he didn't feel good about his own path to victory.)",
    "The only notable Democrat in the race, state Sen. Carol Blood, took in $76,000 and had $37,000 to spend.",
    "Below we'll run down the fields in the Buckeye State's marquee statewide races for Senate and governor.",
    "A Renacci win would represent a major upset, but no one else has responded with contradictory numbers.",
    "But after respondents are told that Trump is supporting Cox while Schulz is backed by termed-out Gov.",
    "But Newman represents 41% of this solidly blue seat in the Chicago area while Casten represents 23%.",
    "? ME-Gov: Former state Sen. Tom Saviello said this week that he would not run as an independent.",
    "? MN-Gov: SurveyUSA, polling on behalf of a trio of Minnesota TV stations, tests Democratic Gov.",
    "(The poll did not include Robin Ficker, a perennial candidate who has self-funded $1.1 million.)",
    "The developer now describes himself as a \"pro-centrist, pro-jobs, pro-public safety Democrat.\"",
    "A third candidate in the Democratic primary, state Rep. Donna McLeod, raised just $22,0000.",
    "Davis also has $1.8 million saved up while Miller had just $783,000 at her disposal.",
    "Flynn filed FEC paperwork on Jan. 21 and said he had $430,000 banked after 10 days.",
    "And clearly Charles Herbster is not getting Nebraskans to invest in his campaign.\"",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Polling for McBath and her allies has found her leading by about 10 to 20 points.",
    "What every survey we've seen agrees on, however, is that Dolan is in last place.",
    "Cox leads former state Commerce Secretary Kelly Schulz, who has termed-out Gov.",
    "In addition, Stevens represents 45% of the district while Levin represents 25%.",
    "He also has almost twice the bankroll: $1.9 million to $1 million for Newman.",
    "The former mayors both ended 2021 with close to $2 million to spend apiece.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "The primary is May 24, with a June 21 runoff if no one takes a majority.",
    "It'll all get settled soon enough, though, as the primary is on May 10.",
    "(Based on state deadlines, that might not be until March or later.)",
    "Larry Hogan's backing, 20-12, with a huge 68% majority undecided.",
    "The plans now head to the state Senate, which must act by Feb. 8.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Get the Daily Kos Elections Morning Digest over email\n Sign up!",
    "Bourdeaux represents 57% of the district and McBath just 12%.",
    "Ron DeSantis does not have the power to either sign or veto.",
    "First Name\nLast Name\nEmail *\nZip/Postal Code *\n Not in US?",
    "She concludes by pledging to \"finish what Trump started.\"",
    "This is the very first poll we've seen of this primary.",
    "Larry Hogan, the delegate's margin balloons to 52-18.",
    "A recent Stevens internal showed her up 7 points.",
    "That's probably welcome news for Democratic Gov.",
    "Her red-hot pace outstripped Republican Gov.",
    "Luttrell also enjoys the backing of Lt. Gov.",
    "Luttrell, who is a close ally of former Gov.",
    "There is no word on the size of the buy.",
    "This is a short blurb about Daily Kos.",
    "? NY Redistricting: Democratic Gov.",
    "The two will face off on June 28.",
    "You may unsubscribe at any time.",
    "The primary is not until Aug. 2.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "Here's our privacy policy.",
    "Want to keep it that way?",
    "? OH-Gov: Republican Gov.",
    "? OK-Gov: Republican Gov.",
    "Daily Kos is different.",
    "Please read it.",
    "Kim Reynolds.",
    "Rob Portman.",
    "Sign up!"
  ]
}