{
  "id": 1495,
  "mediaId": 43,
  "date": "2/2/2022 12:00:00 AM",
  "headline": "Abrams astounds in two months of fundraising. She's going to need every penny, and so much more",
  "image": "https://images.dailykos.com/images/1010505/story_image/staceyabrams.jpg?1637691113",
  "link": "https://www.dailykos.com/story/2022/2/2/2078244/-Abrams-astounds-in-two-months-of-fundraising-She-s-going-to-need-every-penny-and-so-much-more",
  "mediaOutlet": "Daily Kos",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1951,
    1951,
    2087,
    2087,
    2095,
    2230,
    2230,
    2095,
    1646,
    1646,
    428,
    428,
    2672,
    2672
  ],
  "sentences": [
    "#gapol\nBe a founding donor to my campaign:https://t.co/gk2lmBINfW pic.twitter.com/z14wUlo8ls\n Stacey Abrams (@staceyabrams) December 1, 2021\nPlease give $3 now so Stacey Abrams can finish the job she started and win in Georgia!",
    "This is some damned impressive momentum: Stacey Abrams has raised more than $9.2 million since entering the race for governor in December, setting a blistering fundraising pace that eclipsed Republican Gov.",
    "While Kemp and Perdue battle it out, having to focus much of their campaign war chests on that primary, Abrams has the opportunity to keep building up hers for the long haul.",
    "She came too close for Kemp's comfort back in 2018, when Kemp managed to earn the narrowest margin the state had seen in a governor's race in half a centuryjust over 1%.",
    "With federal legislation to restore free and fair elections sidelined by two treacherous Democrats in the Senate, Abrams is going to need every penny she can raise.",
    "They're still stinging over the fact that Joe Biden, Jon Ossoff, and Raphael Warnock won the state in 2020, and they will do everything in their power to stop her.",
    "Here's what's different this time\nTrump's endorsement ad of David Perdue is perfectly divisive and comically awful\nThis is a short blurb about Daily Kos.",
    "Here's some inspiration:\nx\nI'm running for Governor because opportunity in our state shouldn't be determined by zip code, background or access to power.",
    "Now, with a state that's grown younger and even more diverse, and managed to elect both Ossoff and Warnock, Abrams has every advantage.",
    "While he's got about $12.7 million cash on hand, he has to be looking at Abrams' performance since Dec. 1 and quaking in his shoes.",
    "Advertising dollars have been gobbled up by Big Tech and cash-strapped outlets are being bought and sold to the highest bidder.",
    "Perdue has not released fundraising figures yet, but has tried to lower expectations, saying the status quo? is afraid of him.",
    "More good news for Abrams is that the Republicans are in a bruising and bloody Republican primary full of Trumpian nonsense.",
    "She's going to need a massive get-out-the-vote operation and she's going to need the funds to start putting it together now.",
    "We are primarily accountable to readers like you because donations from readers like you are our biggest source of income.",
    "Abrams is reporting about $7.2 million cash on hand and has received contributions from more than 100,000 donors.",
    "That was after Kemp used every tool he had available as Secretary of State to rig the system on his own behalf.",
    "It's going to take months of planning to make sure every eligible Abrams voter gets to the polls.",
    "So he's endorsing former Sen. David Perdue, the guy who lost to Ossoff in last year's run-off.",
    "Sen. Raphael Warnock, who is running again to retain the seat he got in a special election.)",
    "That is, of course, if he's not entirely consumed with Trump and Perdue and that fight.",
    "Please give $3 now so Stacey Abrams can finish the job she started and win in Georgia!",
    "Related stories:\n Stacey Abrams wants to finish the job she started four years ago.",
    "That's not just journalists, but fact-checkers, editors, and administrative staff.",
    "Because the one thing that will unite Georgia Republicans will be defeating her.",
    "That fight is ugly and bruising and will be very expensive for the Republicans.",
    "She's going to need every bit of that and more to defeat the GOP in this state.",
    "Every advantage, that is, except the tools of the state to suppress the vote.",
    "We don't have corporate backers that are only in it for the bottom line.",
    "It's important:\n Media outlets shed 28,637 jobs last year alone.",
    "Trump is carrying a big grudge against incumbent Republican Gov.",
    "Kemp raised just $7.4 million in the final six months of 2021.",
    "You can help keep Abram's phenomenal momentum going.",
    "Brian Kemp.?\nThat's $9.2 million in just two months.",
    "Brian Kemp for his refusal to help with his coup.",
    "Help keep the momentum for Abrams going.",
    "(That, by the way, will help Rev.",
    "Click here to donate $3 now.",
    "Donate $3\nDonate $5 monthly",
    "In a midterm election year.",
    "Want to keep it that way?",
    "Daily Kos is different.",
    "Over the holidays.",
    "Please read it."
  ]
}