{
  "id": 1496,
  "mediaId": 19,
  "date": "2/2/2022 12:00:00 AM",
  "headline": "Exclusive: Kemp Announces Georgia Parents' Bill of Rights' to Codify Parental Access to School Curriculums",
  "image": "https://media.breitbart.com/media/2019/12/Georgia-Gov-Brian-Kemp-Sept12-19-AP-640x480.jpg",
  "link": "https://www.breitbart.com/politics/2022/02/02/exclusive-kemp-announces-georgia-parents-bill-of-rights-to-codify-parental-access-to-school-curriculums/",
  "mediaOutlet": "Breitbart",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Ashley Oliver",
  "authorUrl": "https://www.breitbart.com/author/ashley-oliver/",
  "termIds": [
    1448,
    2095,
    428,
    2550,
    2661,
    2672,
    2686
  ],
  "sentences": [
    "I also look forward to working with the House and Senate to pass, and sign, a parental bill of rights in our education system and other pieces of legislation that I strongly support to ensure fairness in school sports and address obscene materials online and in our school libraries.?\nThe new legislation comes a day after state lawmakers introduced a bill that would prohibit Georgia public schools from being able to operate, sponsor, or facilitate? sports that allow an athlete who identifies as transgender to compete in sports designated for that athlete's opposite sex.",
    "This will ensure that there is transparency for parents while upholding best practices for those who work hard to prepare students for the jobs of tomorrow.?\nBonner added in his own statement that parents have the primary responsibility for educating their children.?\nKemp alluded to the Parents' Bill of Right initiative in his State of the State address in January as he condemned critical race theory-related teachings.",
    "As the parents of three daughters, Marty and I know students do best when their parents have a seat at the table and their voices are heard and respected.?\nThis bill is the product of a months-long, information-gathering campaign which includes the input of superintendents, teachers, parents, and other education stakeholders,? Kemp added.",
    "At its core, it is about transparency, access, and promoting an engaged partnership between the parent and educators to the ultimate benefit of the student.?\nTwo versions of the bill are being introduced on Wednesday, one by Sen. Clint Dixon (R-Gwinnett) in the Senate and one by Rep. Josh Bonner (R-Fayetteville) in the House.",
    "A forthcoming press release from Kemp's office will detail the purpose of the bill as it relates to Georgia, including to affirm a parent's ability to request information?:\nThese bills codify parental rights when it comes to their child's education into law, including the right to access instructional material.",
    "A copy of the House bill proposal reviewed by Breitbart News also provides an avenue for parents to appeal any denied requests for information to the local school board, and if the parent is unsatisfied by the school board's appeal decision, the parent can then file an appeal with the State Board of Education.",
    "The bill, which aims to make certain that contents of school curriculums are accessible to parents in all school districts, is part of a growing trend of Republicans across the country seeking to root out divisive racial messages or other inappropriate contents being infused into school teachings.",
    "At a time when our nation is more divided than ever, we're leading the fight to ensure parents do not have any barriers which prevent them from playing an active role in their child's education,? Kemp said in a statement first provided to Breitbart News.",
    "I look forward to working with members of the General Assembly this legislative session to protect our students from divisive ideologies  like critical race theory  that pit kids against each other,? Kemp said in his address.",
    "Variations of parents' bills of rights have been passed or introduced in Republican-controlled states like Florida, Arizona, and Texas, and one has also been introduced at the federal level by Sen. Josh Hawley (R-MO).",
    "Brian Kemp (R) is moving forward with his promise for a Parents' Bill of Rights,? announcing on Wednesday that legislation is being introduced into the Georgia legislature to begin the process of passing the bill.",
    "If the principal or superintendent is unable to share the information within that timeframe, they must provide the parent with a description of the material and a timeline for its delivery, not to exceed 30 days.",
    "Dixon, who is introducing the Senate version of the bill, said in a statement, I'm honored to be carrying the governor's legislation to protect Georgia's students and the rights of their parents.",
    "The bills affirm a parent's ability to request information from a principal or superintendent and requires that they provide the requested information within 3 working days.",
    "Write to Ashley Oliver at aoliver@breitbart.com.",
    "Follow her on Twitter at @asholiver.",
    "Gov."
  ]
}