{
  "id": 1499,
  "mediaId": 195,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "Trump appears in Perdue's first Georgia gubernatorial ad: 'Kemp let us down'",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/article_images/trumpdonald_092521ap-ben-gray_scope.jpg?itok=hlNQvBLh",
  "link": "https://thehill.com/homenews/campaign/592300-trump-appears-in-perdues-first-georgia-gubernatorial-ad-kemp-let-us-down",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell",
  "termIds": [
    1147,
    1646,
    1951,
    2095,
    4325,
    428,
    2555,
    2672
  ],
  "sentences": [
    "He formally endorsed Perdue in December, arguing the former senator will eliminate the Income Tax, secure the Elections, defend the Second Amendment, support our great Farmers, get crime in Atlanta and other places under control, take care of our great Vets, and put parents back in charge of the schools.?\nThe ad comes as the GOP primary for Georgia's gubernatorial race is heating up.",
    "He has my complete and total endorsement.?\nTrump had urged Perdue to challenge Kemp after the governor refused to help Trump in his efforts to overturn the results of the 2020 presidential election.",
    "A Quinnipiac University poll conducted late last month found that Kemp is leading Perdue by seven percentage points among likely Republican voters.",
    "The winner of the GOP primary will likely take on former Georgia gubernatorial candidate and voting rights activist Stacey Abrams.",
    "Former President Trump appeared in former Sen. David Perdue (R-Ga.) first campaign ad as part of his bid to unseat incumbent Gov.",
    "He also said RINOs?  an acronym for Republicans in name only?  had run all over him on Election Integrity, and more.?",
    "While other Republicans are vying for the party's nomination, they remain significantly behind Perdue and Kemp.",
    "In the ad released on Tuesday, Trump says Kemp let us down.?\nThe Democrats walked all over Brian Kemp.",
    "The former president called Kemp a very weak Governor? in his endorsement of Perdue.",
    "The former president called Perdue an outstanding man,? adding He's tough.",
    "We can't let it happen again,? Trump said in the ad.",
    "She lost to Kemp by roughly 55,000 votes in 2018.",
    "He was afraid of Stacey The Hoax' Abrams.",
    "Brian Kemp let us down.",
    "Brian Kemp (R).",
    "He's smart."
  ]
}