{
  "id": 1502,
  "mediaId": 195,
  "date": "2/1/2022 12:00:00 AM",
  "headline": "The Hill's 12:30 Report: Trump sought control of voting machines",
  "image": "https://media1.giphy.com/media/ZYWN1vsJaTuRmVubxk/giphy.webp?cid=dda24d50559cfaaa9e934db5f650b301fef240adbdc7df65&rid=giphy.webp&ct=g",
  "link": "https://thehill.com/homenews/1230-report/592277-the-hills-1230-report-Trump-voting-machines-children-vaccines-COVID-19",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Reid Wilson",
  "authorUrl": "",
  "termIds": [
    1035,
    1145,
    1147,
    1341,
    1434,
    1834,
    1888,
    2095,
    2525
  ],
  "sentences": [
    "https://is.gd/5hxmLY\nHuge news for our friends with kids under 5: The FDA has urged Pfizer and BioNTech to submit an application for an emergency use authorization for COVID-19 vaccines for children between 6 months and 5 years old, and the two-shot regimen could be on the market before the end of the month.",
    "Angus King (I-Maine), Amy Klobuchar (D-Minn.) and Judiciary Committee chair Dick Durbin (D-Ill.) makes clear that the vice president's role in the count is ceremonial, and it increases the number of representatives and senators necessary to support an objection to a state's votes.",
    "To view past editions of The Hill's 12:30 Report, click here: http://bit.ly/1M1mIfw\nTo receive The Hill's 12:30 Report in your inbox, please sign up here: http://bit.ly/1Tt4hqN\n--> A midday take on what's happening in politics and how to have a sense of humor about it.",
    "The star of the show: Trump himself, who blames Kemp for Biden's victory in Georgia in 2020. https://is.gd/xMhWeu\nWe've said it before, we'll say it again: The tenor of Perdue's campaign, blaming Kemp for his own loss and Trump's, is unlike anything we've ever seen.",
    "https://is.gd/jeJuUk\nCASE NUMBERS:\nCoronavirus cases in the U.S.: 74,944,584\nU.S. death toll: 886,727\nBreakdown of the numbers: https://cnn.it/2UAgW3y\nVACCINATION NUMBERS:\nTotal number of vaccinations administered in the U.S.: 539 million shots have been given.",
    "https://is.gd/LXFbqU\nVia The Hill's Jordain Carney, Senate Democrats this morning rolled out legislation to reform the Electoral Count Act, the 1887 law governing the ceremonial ratification of presidential election results every 4 years.",
    "https://is.gd/Dni1oq\nFormer White House press secretary Kayleigh McEnany has turned over her text messages to the Jan. 6 committee, and former Vice President Mike Pence's chief of staff Marc Short testified before the panel last week.",
    "The House's full agenda today: https://bit.ly/3ofSh2J\nWHAT TO WATCH:\n10 a.m. EST: The Senate Health, Education, Labor and Pensions Committee held a hearing on mental health and substance abuse during the COVID-19 pandemic.",
    "Via The Hill's Mychael Schnell, Sen. Mark Kelly (D-Ariz.) runs just four points ahead of a generic Republican, 42 percent to 38 percent, in the latest AZ POP survey from our friends at OH Predictive Insights.",
    "Breakdown of the numbers: https://bloom.bg/3iVTPLH\nNOTABLE TWEETS:\nTheresa May's dagger:\nHow much would you pay to watch an American president suffer through the equivalent of Prime Minister's Question Time?",
    "Big bucks rolling in:\n''\nCandidates, parties and PACs filed their year-end reports with the Federal Election Commission last night, giving us a sneak peek at the fundraising fight for control of Congress.",
    "Then-President Trump ordered Rudy Giuliani to call the Department of Homeland Security to ask whether the agency could take control of voting machines in key swing states, The New York Times reports.",
    "https://is.gd/nSOhHu\nSenate Majority Leader Chuck Schumer plans to sit down with Democratic negotiators later this week to check in on the state of negotiations over an omnibus funding package.",
    "Attorney General Mark Brnovich (R) leads the GOP primary at 25 percent, with 11 percent backing retired Maj. Gen. Michael McGuire (R) and the rest of the crowded field in single digits.",
    "https://is.gd/gD00Z1 https://is.gd/PR1NZP\nHouse and Senate super PACs pulled in huge sums, and Republicans are moving into an early lead as they seek to reclaim the majority.",
    "Trump had also asked then-Attorney General Bill Barr whether the Justice Department could do so, and he rejected a proposal to force the Defense Department to swoop in.",
    "2:30 p.m. EDT: The Senate Budget Committee holds confirmation hearings for Biden's nominees for director and deputy director of the Office of Management and Budget.",
    "President Biden and Vice President Harris host Senate Judiciary Committee chair Dick Durbin and ranking member Chuck Grassley (R-Iowa) for a SCOTUS chat.",
    "Look to Ohio, where two Republicans  Michael Gibbons (R) and Matt Dolan (R)  have each loaned or donated more than $10 million to their own campaigns.",
    "Some highlights:\nThe RNC and the DNC both raised almost $160 million last year, while the DCCC and the NRCC each topped $140 million.",
    "The National Archives has handed the draft order aimed at DOD over to the House committee investigating the Jan. 6 insurrection.",
    "Seven-day average of doses administered: An average of 490,810 doses\nFor context: The U.S. population is roughly 331 million.",
    "https://is.gd/7ffx2u\nAnd because you made it this far, here's a baby elephant discovering his trunk: https://bit.ly/3oe6zRy",
    "https://is.gd/mKNPrJ\nTrump advisors drafted two executive orders requiring DHS and DOD to seize voting machines.",
    "The top House Republican outside groups pulled in $110 million, twice as much as their Democratic equivalents.",
    "TRUMP STARS IN PERDUE AD:\nFormer Sen. David Perdue (R) is up with his first ad as he challenges Georgia Gov.",
    "Sign up here to receive The Hill's 12:30 Report in your inbox daily: http://bit.ly/2kjMNnn\nIT'S FEC DAY!",
    "Doug Ducey (R) to join the race, Ducey would lead with 35 percent, ahead of 13 percent for Brnovich.",
    "Livestream: https://bit.ly/3GamTcc\nNOW FOR THE FUN STUFF...:\nToday is National Dark Chocolate Day.",
    "Filings made last night show the NRSC has raised $104 million, ahead of the DSCC's $91 million.",
    "If any election reform gets through Congress this year, it'll be some form of ECA overhaul.",
    "Stay tuned to TheHill.com for our full takeaways from the end-of-year reports later today.",
    "Bernie Moreno (R) and Jane Timken (R) have loaned themselves more than $3.5 million each.",
    "Susan Collins (R-Maine) and Joe Manchin (D-W.Va.) is working on their own version.",
    "The Collins-Manchin group shares some goals with the King-Klobuchar-Durbin gang.",
    "Lawmakers have until Feb. 18 to reach a spending deal to avoid another shutdown.",
    "Ducey has said many times he's not running, but we'll be sure to ask him again.",
    "https://is.gd/H9JYp3, https://is.gd/VEKyeX\nDid someone forward this to you?",
    "Check out these surfers hitting the beach to ride the cold, cold waves.",
    "And/but: If Senate Majority Leader Mitch McConnell (R) convinces Gov.",
    "2 p.m. EDT: White House press secretary Jen Psaki briefs the media.",
    "https://bit.ly/3ofYImo\nON TAP:\nThe House and Senate are in.",
    "6:30 p.m. EST: First and last votes in the House.",
    "A bipartisan group of 16 senators led by Sens.",
    "https://is.gd/Yc098i\nLooking for self-funders?",
    "Brian Kemp (R) in the GOP primary.",
    "Couldn't pay us enough to do that.",
    "The House gavels into session.",
    "The proposal from Sens.",
    "Want your own copy?"
  ]
}