{
  "id": 1528,
  "mediaId": 223,
  "date": "1/28/2022 12:00:00 AM",
  "headline": "Defeat From the Jaws of Victory?",
  "image": "https://media.townhall.com/townhall/reu/ha/2022/6/c6e66fbb-d44f-4c9d-890c-899051b5d8c5.jpg",
  "link": "https://townhall.com/columnists/erickerickson/2022/01/28/defeat-from-the-jaws-of-victory-n2602489",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Erick Erickson",
  "authorUrl": "https://townhall.com/columnists/erickerickson/",
  "termIds": [
    886,
    991,
    1147,
    1284,
    1646,
    1951,
    2095,
    146,
    2550,
    2672
  ],
  "sentences": [
    "Though the governor is constitutionally prohibited from playing any role in elections, Trump blames Kemp for a supposedly stolen election in Georgia.",
    "View Cartoon\nPerdue claimed he would unite the GOP in Georgia, but he has divided the party with nonstop attacks on Kemp over election integrity.",
    "Catherine Cortez Masto may be the most vulnerable Democrat in the Senate as a result against Laxalt, who has statewide popularity.",
    "In Pennsylvania, Trump's pick, Sean Parnell, dropped out of the race, and TV's Dr. Mehmet Oz joined the race as a Republican.",
    "They lead on questions of empathy, handling the economy, handling the border and pretty much every issue voters care about.",
    "In states like Arizona, incumbent Democratic Sen. Mark Kelly is regularly beaten in polls by generic unnamed Republicans.",
    "The race has gotten crowded and the noise of the Republican primary risks luring independent voters to the Democrats.",
    "In Arizona, while Kelly loses to a generic Republican, the actual Republicans in the race are all having a hard time.",
    "In Georgia, Biden has a disapproval rating of 61%, according to the Atlanta Journal-Constitution's (AJC) polling.",
    "All the public polling has Perdue, at best, in a statistical tie with Abrams even as Kemp decisively beats her.",
    "It is a sad commentary on a candidate that he only just discovered this about the people he hoped to represent.",
    "Ducey may be the best shot at picking up the Arizona Senate seat and handing control of the Senate to the GOP.",
    "Polling in Georgia shows general election voters are 49% less likely to vote for a candidate Trump supports.",
    "But the former president's interference could risk candidates who are radioactive in the general election.",
    "Last week, in a self-filmed clip at a market, Dr. Oz said he had discovered Pennsylvanians were patriotic.",
    "President Joe Biden's unpopularity is, in some polls, worse than former President Donald Trump's ever was.",
    "Between Biden's unpopularity and redistricting, the House of Representatives should be a sure thing.",
    "The public polling shows Kemp is having trouble uniting the GOP but would still win the primary.",
    "Doug Ducey might enter the race, but Trump is already railing on Ducey, promising to hurt him.",
    "Never underestimate the Republican Party's ability to snatch defeat from the jaws of victory.",
    "Brian Kemp, the incumbent Republican governor, beats Stacey Abrams in multiple public polls.",
    "Unfortunately, it will cost him money he could otherwise spend in the general election.",
    "But the GOP needs the Senate and needs to hold and gain governor's mansions as well.",
    "In the AJC's polling, Kemp beats Abrams by a statically significant seven points.",
    "Republicans are ahead in most generic polls asking \"who should control Congress?\"",
    "As a result, Trump convinced former Sen. David Perdue to run for Kemp's seat.",
    "Adam Laxalt in Nevada has locked down Republican support across the board.",
    "He has the backing of both the Trump wing and non-Trump wing of the party.",
    "The GOP has multiple paths to gain the Senate with Democrats on defense.",
    "Vance are both forcefully engaged in performance for Trump's supporters.",
    "Midterm elections historically favor the party against the president.",
    "While unemployment is low, businesses are struggling to find workers.",
    "The stock market has had its worst-performing January since 1929.",
    "Meanwhile, Abrams has a clear path to the Democratic nomination.",
    "This may be a wave year where even not-great candidates can win.",
    "The attorney general of Arizona is struggling at fundraising.",
    "Trending\nThings are really bad for the Democrats right now.",
    "But the GOP has an annoying habit of sabotaging itself.",
    "Redistricting gives Republicans a slight edge as well.",
    "Republicans have a shot at sweeping the nation.",
    "But Trump intends to interfere for vengeance.",
    "Masks are everywhere, along with the virus.",
    "Ohio is a Republican seat they must hold.",
    "Inflation is at its highest since 1982.",
    "It has fractured the Republican Party.",
    "Others are struggling at credibility.",
    "The GOP does have one bright spot.",
    "Things should be good for the GOP.",
    "Unfortunately, Trump hates Kemp.",
    "Schools are still shuttering.",
    "In Ohio, John Mandel and J.D.",
    "That could help Democrats.",
    "Store shelves are empty.",
    "Gov."
  ]
}