{
  "id": 1529,
  "mediaId": 129,
  "date": "1/28/2022 12:00:00 AM",
  "headline": "What Mattered This Week",
  "image": "https://static01.nyt.com/images/2022/01/29/us/politics/29on-politics/29on-politics-facebookJumbo-v2.jpg",
  "link": "https://www.nytimes.com/2022/01/28/us/politics/what-mattered-this-week.html",
  "mediaOutlet": "New York Times",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "",
  "authorUrl": "",
  "termIds": [
    1796,
    1796,
    2087,
    2087,
    815,
    815,
    1147,
    1147,
    571,
    571,
    482,
    482,
    2672,
    2672,
    2661,
    2661,
    2550,
    2550,
    2819,
    2819
  ],
  "sentences": [
    "The ad, paid for by Senate Republicans, accuses Hassan of voting to give stimulus checks to voters in jail.?\nGlenn Kessler, the chief writer of The Fact Checker at The Washington Post, has examined that line of attack and notes that it's misleading, because the previous stimulus bills passed last year under GOP control also did not bar payments to prisoners.? Hassan, her campaign points out, has also written to the Treasury Department to clarify that state and local law enforcement could seize those checks and use them to compensate victims.",
    "Graham Bowley interviewed W. Kamau Bell, who said his new documentary, We Need to Talk About Cosby,? was really a story about two runaway forces of oppression in America.?\nIn Ohio, two wildly different candidates clashed onstage at a debate that illuminated both would-be senators' hunger for attention, Trip Gabriel reports.",
    "And what's typical is not really a concern to me.?\nWhat to read\nThe congressional panel investigating the Jan. 6 attack on the Capitol subpoenaed a group of 14 people who falsely presented themselves as electors for Trump, Luke Broadwater and Alan Feuer report.",
    "2022 is a stage for 2024\nA number of Republican governors have been downright ornery in expressing their lack of interest in running for Senate seats this year: Larry Hogan in Maryland, Chris Sununu in New Hampshire, Doug Ducey in Arizona.",
    "But we want to draw your attention to some recent polling that affirms that Biden is struggling, and also complicates the conventional wisdom: Georgia's Democratic senator up for re-election seems significantly more popular than Biden.",
    "After alluding to a tweet from Bette Midler  she had referred to West Virginia as Poor, illiterate and strung out?  he lifted Babydog into his arms and showed her rear end to the audience in the House of Delegates and watching at home.",
    "Take Representative Mo Brooks of Alabama, whose endorsement from Trump didn't stop Katie Britt from entering the Senate primary there, nor did it prevent retiring Senator Richard Shelby from promoting Britt, his former chief of staff.",
    "In the Atlanta paper's poll, Warnock landed himself in a statistical tie  he was behind by a few points, but within the poll's margin of error  against Herschel Walker, the leading Republican candidate.",
    "President Biden got some rare good news this week, with Justice Stephen Breyer announcing his retirement from the Supreme Court and economic data showing rising wages and booming G.D.P.",
    "Trump can't get people to stop running\nEven if Trump's endorsement can help Republicans stand out in a primary, some candidates who haven't gotten his blessing aren't giving up.",
    "What caught our eye this week was a digital ad running in New Hampshire, ostensibly attacking Senator Maggie Hassan, the incumbent Democrat who is up for re-election in 2022.",
    "It's highly unusual for the head of a campaign committee to appear in attack ads  especially in New Hampshire, one of the early stops for aspiring presidential candidates.",
    "If Democratic senators who are up for re-election can replicate that model in Arizona, Nevada and New Hampshire, the party just might be able to keep its majority intact.",
    "But what's noteworthy to us is the appearance in the ad of Senator Rick Scott, the ambitious former Florida governor who chairs Senate Republicans' campaign arm.",
    "Months ago, Pat McCrory, a former governor of North Carolina, also made clear that he would not exit the Senate race just because Trump had endorsed his rival.",
    "And while inflation is still rising fast, a few new polls suggest that Biden's slump might not doom Democrats' chances of hanging onto the Senate after all.",
    "Two separate polls released this week  one from The Atlanta Journal-Constitution, the other from Quinnipiac  found Biden's approval rating in the mid-30s.",
    "Governors' Races: Georgia's race will be at the center of the political universe this year, but there are several important contests across the country.",
    "David Jolly, formerly a Republican member of the House from Florida who is now registered as an independent voter, said he wasn't surprised by the move.",
    "Weeks after traveling to Florida to discuss his options with Trump, Walker announced at a rally on Thursday that he was staying in the Senate race.",
    "Trump, who endorsed Representative Ted Budd in that state's primary, encouraged Walker to abandon his Senate bid and return to the House instead.",
    "There's a silver lining for Democrats\nWe know you're tired of us repeating that Biden is a drag on Democrats ahead of the 2022 midterm elections.",
    "If supporters of President Trump want his agenda to be supported in the US Senate, they should not vote for Ted Budd,? McCrory tweeted in June.",
    "In the House: Republicans are already poised to capture enough seats to take control, thanks to redistricting and gerrymandering alone.",
    "What that suggests to us: A major share of Georgia voters disapproved of Biden's job performance but were still on board with Warnock.",
    "Brian Kemp of Georgia, whose refusal to throw out his state's election results in 2020 earned him a top spot on Trump's enemies list.",
    "When we emailed Chris Hartline, a spokesman for Scott, asking whether the ad was unusual, he wrote back: I don't know what's typical.",
    "Likewise, in the Quinnipiac poll, while 59 percent disapproved of Biden's job performance, just 40 percent disapproved of Warnock's.",
    "As for Republicans, one theme we're watching is the tug of war between Donald Trump and candidates who aren't bending to his will.",
    "It's a reminder that while Trump might be the most important person in the Republican Party, he doesn't have universal control.",
    "Babydog,? he said, tells Bette Midler and all of those out there  kiss her hiney.?\nIs there anything you think we're missing?",
    "The slightest improvement in Biden's approval rating could put Warnock on even ground with Walker, or even slightly ahead.",
    "Les Miserables: The percentage of Americans saying they are not too happy? is at historic levels, new survey data shows.",
    "Even though Biden's approval rating was just 34 percent in that poll, Warnock had consolidated 44 percent of the vote.",
    "Rick Scott is someone who is desperately seeking a lane to run for president, and he hasn't found it,? Jolly told us.",
    "Sununu, who has been dismissive of Republican senators, said he didn't want to just be a roadblock? in Washington.",
    "Midterm Elections\nIn the Senate: Democrats have a razor-thin margin that could be upended with a single loss.",
    "The latest example is Mark Walker, a former House lawmaker who is running for the Senate in North Carolina.",
    "Given those numbers, it's not surprising that Senator Raphael Warnock, a Democrat, isn't in the lead.",
    "Key Issues: Both parties are preparing for abortion rights and voting rights to be defining topics.",
    "He can elevate candidates, but that doesn't mean that he alone can get them over the finish line.",
    "What's noteworthy is that despite Biden's poor rating, Warnock isn't necessarily behind, either.",
    "Jim Justice of West Virginia beckoned to a trusted aide  Babydog, the state's First Dog.",
    "Trump persuaded another Republican, former Senator David Perdue, to challenge Kemp.",
    "And the Georgia polling indicates that Kemp still enjoys an edge in the primary.",
    "And finally, it's never too early to think about the next presidential election.",
    "For many ambitious politicians, 2022 is just a speed bump on the road to 2024.",
    "As he wrapped up his State of the State address on Thursday, Gov.",
    "One more thing \nHere's a dogged way to end a 125-minute speech.",
    "Hogan said he had no interest whatsoever? in the job.",
    "And Ducey has repeatedly said he's not running.",
    "The governor sat his bulldog on the podium.",
    "President of the United States of America.",
    "Email us at onpolitics@nytimes.com.",
    "The job none of them has ruled out?",
    "Anything you want to see more of?",
    "A Look Ahead to the 2022 U.S.",
    "Here are 10 races to watch.",
    "We'd love to hear from you.",
    "Then things got weird.",
    "And there's Gov.",
    "growth."
  ]
}