{
  "id": 1532,
  "mediaId": 223,
  "date": "1/27/2022 12:00:00 AM",
  "headline": "Georgia: Biden Approval Tanks, Republicans Lead in Major Statewide Races",
  "image": "https://media.townhall.com/townhall/reu/ha/2021/5/925860eb-4543-4eab-b52e-7dbd6d1d85e5.jpg",
  "link": "https://townhall.com/tipsheet/guybenson/2022/01/27/georgia-biden-approval-tanks-republicans-lead-in-major-statewide-races-n2602453",
  "mediaOutlet": "Townhall",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Guy Benson",
  "authorUrl": "https://townhall.com/tipsheet/guybenson/",
  "termIds": [
    2087,
    2087,
    1784,
    1784,
    1951,
    1951,
    1700,
    1700,
    571,
    571,
    146,
    146,
    428,
    428,
    2555,
    2555,
    2672,
    2672,
    2945,
    2945
  ],
  "sentences": [
    "And in Georgia, home to last January's disastrous Republican meltdown, a possible resurgence is underway, per two new polls:\nNew Quinnipiac poll of GEORGIA:\nSenate\nWarnock (D-inc) 48\nWalker (R) 49\nGov\nAbrams (D) 47\nKemp (R-inc) 49\nAbrams (D) 48\nPerdue (R) 48\nGOP Gov Primary\nKemp 43\nPerdue 36\n(1702 RVs, 666 GOP LVs, 1/19-24)https://t.co/uj7gnjGH7H\n Jacob Rubashkin (@JacobRubashkin) January 26, 2022\nThis would be more daunting if the same poll didn't have Biden at 33 (-28/50% strongly disapprove) https://t.co/fQFeZbOpZ0\n Liam Donovan (@LPDonovan) January 27, 2022\n2022 #GAGov General Election Poll:\nBrian Kemp (R-Inc) 48% (+7)\nStacey Abrams (D) 41%\n.",
    "The average:\nAll-cycle highs for Republicans in the Generic Ballot average tracked by both RCP and 538 today... pic.twitter.com/YpolZIVzj7\n Logan Dobson (@LoganDobson) January 26, 2022\nAnd here are some demographic breakdowns from Monmouth, which puts Republicans ahead by eight nationally -- which would mean a bloodbath if it proves anywhere close to accurate when the voting happens:\nWho do you want to see control Congress Republicans/Democrats in 2022?",
    "David Perdue (R) 47% (+4)\nStacey Abrams (D) 43%@universityofga/@AJC ~ 872 RV ~ 1/13-1/24https://t.co/8hbfAv4UId\n PollTracker (@PollTrackerUSA) January 27, 2022\n71% wrong track\nKemp +7\nWalker +3 https://t.co/qU6AG20q1y\n Guy Benson (@guypbenson) January 27, 2022\nI guess the recent demagogic Biden/Harris event in Atlanta, snubbed by Stacey Abrams, didn't do the trick, huh?",
    "Biden won 53% of the vote in NH in 2020, a notch higher than his national vote share.https://t.co/YyeO96MxTJ\n Josh Kraushaar (@HotlineJosh) January 26, 2022\nNew Hampshire has a gubernatorial race and a critical Senate race this cycle, featuring a key GOP pickup opportunity.",
    "Overall: 51/43\nGOP: 92/5\nIndie: 48/39\nDem: 4/94\nMen: 55/38\nWomen: 45/47\nWhite: 57/36\nNon-white: 36/54\nWhite no degree: 66/27\nWhite w/ degree: 41/56\n Ryan James Girdusky (@RyanGirdusky) January 26, 2022\nIndies and men are a real problem for the Democrats in this data.",
    "With Biden's numbers the way they are in Georgia, Republicans should be in good position to win in 2022 -- unless internal divisions once again lead to lower-than-needed turnout, handing Democrats victories.",
    "He may regain some ground with a likely SCOTUS confirmation victory, and thanks to the reassertion of tribalism ahead of an election, but it's still dangerous territory.",
    "Out in some key battleground states, it's also pretty dreary for POTUS:\nBiden approval (NEW HAMPSHIRE), per new UNH poll:\nApproval: 39%\nDisapproval: 60% (!)",
    "In fairness, he's not literally the only person willing to say this; a whopping five percent of respondents in the latest NBC News poll agreed.",
    "Joe Biden may be the only person in the country who believes he's 'outperforming' expectations, as he asserted last week.",
    "The same Monmouth survey also finds than fewer than 1-in-4 American voters (24%) see passing BBB as a major priority.",
    "Nationally, Republicans have now bounced out to their largest average 2022 'generic ballot' lead of the cycle.",
    "Remember, the GOP usually does quite well if they're tied or even slightly trailing on this metric.",
    "And don't look now, but that's another national poll pegging Biden's approval below 40 percent.",
    "We've been tracking the president's abysmal polling week, and the hits just keep on coming.",
    "Some of that is base erosion, which is a disaster for an unpopular president.",
    "Total unity, even if everyone isn't perfectly thrilled, is what's needed.",
    "I'll leave you with this:\n Guy Benson (@guypbenson) January 27, 2022",
    "One would hope conservatives have learned their lesson in Georgia.",
    "Georgia isn't an automatic red state anymore, by any stretch.",
    "The bill should stay dead.",
    "Adjust accordingly."
  ]
}