{
  "id": 1536,
  "mediaId": 441,
  "date": "1/27/2022 12:00:00 AM",
  "headline": "Biden's Economy Gives GOP Governors Money to Burn",
  "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i1MLReADCUe0/v1/800x-1.jpg",
  "link": "https://www.bloomberg.com/opinion/articles/2022-01-27/biden-s-economy-gives-gop-governors-money-to-burn",
  "mediaOutlet": "Bloomberg.com",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Conor Sen",
  "authorUrl": "https://www.bloomberg.com/opinion/authors/ATA2uaN4m4A/conor-sen",
  "termIds": [
    661,
    661,
    1462,
    1462,
    2533,
    2533,
    2456,
    2456,
    146,
    146,
    428,
    428
  ],
  "sentences": [
    "And second, to the extent governors impact the national thinking of political parties, governors will be looking to tout their economic performance, arguing that they've managed both to cut taxes  popular with their conservative bases  and also increase investments into areas like infrastructure and state employees, which is popular with independents and Democrats alike.",
    "For voters who are culturally conservative but also rely on and value public spending  arguably the types of non-college white voters who swung to former President Donald Trump in Midwestern states like Michigan and Wisconsin in 2016  there are now Republican governors with the budgets to run their states in such a way that could appeal to those voters down the road.",
    "The new Republican governor in Virginia, Glenn Youngkin, has promised both investments in education as well as lowering taxes; so far he's put forth one-time tax refunds, raising the state's standard deduction for filers, suspending a recent gasoline tax increase, and eliminating the state's grocery tax.",
    "So expect Republican governors to put forward a mix of both tax cuts and spending increases to shore up voter support in this election year, which will mean a different outcome both for the economy over the next couple years as well as the GOP.",
    "Governors like Louisiana's Bobby Jindal, Kansas's Sam Brownback, and Wisconsin's Scott Walker epitomized leaders who became extremely unpopular in their states by cutting spending, which in turn dashed their hopes of one day becoming president.",
    "Georgia governor Brian Kemp, also up for re-election in 2022, has proposed a $2,000 pay increase for teachers, a $5,000 pay increase for state employee, and income tax refunds of $250 for single filers and $500 for joint filers.",
    "Similar to the 2010 midterms, there's a sitting first-term Democratic president with low approval ratings coming out of an economic crisis and Republicans angling to take advantage of the poor mood of the country.",
    "This may have pleased Republican primary voters in the abstract, but it didn't work out very well for the economies of their states or the political futures of the governors who implemented the spending cuts.",
    "But don't look for Republicans to run on the same economic message they used 12 years ago, when they emphasized spending cuts to address states' economic problems states following the 2008 financial crisis.",
    "The budget surpluses mean the money is there, and there are roughly three times as many job openings for state and local government employees today as there were at this point in the 2010 election cycle.",
    "Florida Governor Ron DeSantis, up for re-election in 2022 and touted as a future presidential hopeful, has proposed a gasoline tax cut, bonuses for teachers and money for infrastructure projects.",
    "In the five years after the 2008 recession, state governments cut 118,000 employees, and that doesn't account for the negative impact that reduced government spending had on the private sector.",
    "Republican governors in 2022, thanks in part to hundreds of billions of dollars of aid passed by Democrats in the American Rescue Plan, have more money than they know what to do with.",
    "To contact the author of this story:\nConor Sen at csen9@bloomberg.net\nTo contact the editor responsible for this story:\nSusan Warren at susanwarren@bloomberg.net",
    "The 2008 recession had wrecked the budgets of most states, but proposing large tax increases to plug the hole wasn't going to be an election- winning strategy.",
    "The differing approaches of Republican governors over the next couple years versus the approach in the early 2010's should play out differently in two ways.",
    "The Republican gubernatorial class of 2010 found themselves deeply unpopular and ruining their careers by implementing their economic agendas.",
    "Today, state coffers are flush with cash and a more pressing concern for many are disruptions to daily life caused by labor shortages.",
    "In the five years after the end of the 2001 recession, state governments added 123,000 employees nationwide.",
    "This column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.",
    "The Republican push to cut spending in 2010 was politically logical even if it was bad economic policy.",
    "The successors of all three are Democrats in large part due to the unpopularity of this approach.",
    "The tax cuts make sense given Republican ideology, and so do the investments in public employees.",
    "First, it should mean that state governments will boost, rather than hold back, economic growth.",
    "So a new crop of GOP governors emerged who saw spending cuts as the answer to economic problems.",
    "The prospective class of 2022 has every reason to believe their futures will play out better.",
    "This year's midterm elections will bring the governor seats of 36 states into focus.",
    "Cutting spending also meant a slower economic recovery at the national level.",
    "More From Other Writers at Bloomberg Opinion:\nWant more Bloomberg Opinion?",
    "Don't look for a repeat this time around.",
    "Terminal readers head to OPIN <GO>.",
    "Web readers click here."
  ]
}