{
  "id": 1537,
  "mediaId": 195,
  "date": "1/27/2022 12:00:00 AM",
  "headline": "The Hill's Morning Report - Who will replace Justice Breyer?",
  "image": "https://thehill.com/sites/default/files/newsletter-open_012722ap.jpg",
  "link": "https://thehill.com/homenews/morning-report/591576-the-hills-morning-report",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Alexis Simendinger",
  "authorUrl": "https://thehill.com/author/alexis-simendinger",
  "termIds": [
    1026,
    1341,
    1464,
    1865,
    1916,
    2034,
    2087,
    2095,
    2347,
    482,
    577
  ],
  "sentences": [
    "Chairman Jerome Powell told reporters the Fed wants its tightening process to be orderly and predictable,? believing the central bank can move assertively without harming its goal of another long expansion,? noting that risks continue to be COVID-19's impacts, a tight labor market, emerging tensions in Eastern Europe and especially inflation-aggravating supply chain bottlenecks, which Powell said emphatically are not making much progress.?\nI think there's quite a bit of room to raise interest rates without threatening the labor market,? he added.",
    "Elections have consequences, and that is most evident when it comes to fulfilling vacancies on the Supreme Court.?\nBoth Biden and Vice President Harris in the past have expressed their shared ambition to see the makeup of the high court gain the diversity of a Black woman, and leading candidates include former Breyer law clerk Judge Ketanji Brown Jackson, 51, who was confirmed to D.C.",
    "News Wednesday of a decision by liberal Supreme Court Justice Stephen Breyer to retire by summer unleashed reminders that President Biden aspires to nominate a Black female to the high court and that Senate Democrats will race to confirm a successor ahead of the November elections  by a party-line vote if necessary.",
    "Breyer, nominated by former President Clinton in 1994, has defended the Supreme Court as independent of politics even as he was repeatedly and publicly encouraged by progressives to retire to give Biden an opening to seat a young successor while Senate Democrats still control the confirmation process.",
    "Contrary to the false statements put out by the White House and congressional Democrats, this is absolutely NOT a bipartisan bill and will likely garner no Republican support,? Rep. Michael McCaul (Texas), the top GOP member on the House Foreign Affairs Committee, said in a statement.",
    "Blinken said the response to Russian demands reiterates what we said publicly for many weeks and in a sense for many, many years,? rejecting the Kremlin's insistence that NATO close its doors to future applicants, in particular Ukraine and other former Soviet Union countries.",
    "Biden, a former chairman of the Senate Judiciary Committee who played a prominent role in opposing the nomination of Clarence Thomas in 1991, is expected today at the White House to hail Breyer's judicial career while announcing the justice's decision to depart.",
    "President Biden's nominee will receive a prompt hearing in the Senate Judiciary Committee and will be considered and confirmed by the full United States Senate with all deliberate speed,? Senate Majority Leader Charles Schumer (D-N.Y.) said in a statement.",
    "LEADING THE DAY\nECONOMY: The Federal Reserve on Wednesday gave every indication it will soon raise interest rates for the first time in more than three years as part of a broader tightening of historically easy monetary policy to combat inflation (CNBC).",
    "We made clear that there are core principles that we are committed to uphold and defend, including Ukraine's sovereignty and territorial integrity and the right of states to choose their own security arrangements and alliances,? Blinken said (The Hill).",
    "As The Hill's Mike Lillis and Cristina Marcos note, the massive package is designed to boost national innovation, promote the production of scarce computer chips within the U.S. and ease the supply chain that's led to skyrocketing inflation.",
    "IN FOCUS/SHARP TAKES\nCONGRESS: House Republicans on Wednesday poo-pooed the Democrats' bill unveiled a day earlier to deal with China competitiveness, panning it as a one-sided, partisan proposal that will go nowhere with their caucus.",
    "Sen. Lindsey Graham (R-S.C.), a member of the Judiciary Committee, tweeted, If all Democrats hang together  which I expect they will  they have the power to replace Justice Breyer in 2022 without one Republican vote in support.",
    "Brian Kemp, frequently the target of former President Trump's wrath, leads former Sen. David Perdue (R-Ga.), who lost a runoff in 2021 and has been endorsed by Trump, according to a new Quinnipiac University poll (The Hill).",
    "ELSEWHERE\n? CORONAVIRUS: The U.S. has shared 400 million COVID-19 vaccine doses with 112 countries for free, with no strings attached the world,? more than any other nation, the Biden administration announced Wednesday.",
    "It was hastily thrown together behind closed doors in a process with no Republican input and is being jammed through the House.?\nThe House is expected to vote on the legislation when members return next week.",
    "The central bank's policy making leaders said a quarter-point increase to its benchmark short-term borrowing rate is likely forthcoming, and analysts said they expect a series of rate hikes to begin in March.",
    "Secretary of State Antony Blinken announced the promised U.S. written response to Russia, which has amassed more than 100,000 troops on Ukraine's border while denying it has intentions to invade its neighbor.",
    "Additional possibilities include California Supreme Court Justice Leondra Kruger, 45 and South Carolina U.S. District Judge J. Michelle Childs, 55, a favorite of House Majority Whip James Clyburn (D-S.C.).",
    "The secretary added that the U.S. reiterated its openness to discussions with Russia on a reciprocal? basis to address security concerns in Moscow but also those in Washington and among European allies.",
    "? STATE WATCH: Governors this month are telling voters they're determined to work with legislatures to reduce or pause all kinds of taxes, in part because many states are flush with cash (Forbes).",
    "> Jan. 6 latest: Ben Williamson, a top aide and adviser to former White House chief of staff Mark Meadows, met on Tuesday with the House select committee probing the Jan. 6 attack on the Capitol.",
    "Grammy Award\nGolden Globe Award\nAcademy Award\nNobel Peace Prize\nDuring the past 30 NBA seasons, how many players have topped Bryant's 2005-06 single-season scoring high of 35.4 points per game?",
    "Breyer's successor would not change the 6-3 conservative divide on a court, now in the midst of a potentially consequential term on issues including abortion rights, religion and guns.",
    "Economic indicators: The Bureau of Economic Analysis at 8:30 a.m. will release its advance report on gross domestic product in the fourth quarter of 2021 and growth for the year.",
    "The White House daily press briefing is scheduled at 12:30 p.m.\nHill.TV's Rising? program features news and interviews at http://thehill.com/hilltv or on YouTube at 10:30 a.m.",
    "He reportedly wants to leave at the end of this term, which for practical purposes occurs when all court opinions have been issued, which means by June or perhaps early July.",
    "*****\nADMINISTRATION: The U.S. and NATO on Wednesday told Russian officials in separate written responses they reject Moscow's call to bar Ukraine from joining the alliance.",
    "Charlie Baker (R), who is leaving office instead of pursuing a third term, is another example (tax relief for renters, low-income workers, seniors) (The Boston Globe).",
    "Pete Ricketts (R) is appealing to legislators to slash taxes on corporations and high earners, which would reduce state coffers by $179 million (The Associated Press).",
    "However, that wasn't good enough for the minority party, which called the package a creation of Speaker Nancy Pelosi (D-Calif.) and pointed to poison-pill? provisions.",
    "Inspired by Wednesday's second anniversary since Kobe Bryant's death in an airplane crash at age 41, we're looking for some smart guesses about his basketball career.",
    "Reuters: A South Carolina man (jailed since April) who attacked police on Jan. 6 at the Capitol, received a 44-month sentence from a federal judge on Wednesday.",
    "The president will receive the President's Daily Brief at 9:30 a.m. Biden will get a weekly economic briefing at 3:30 p.m. with advisers in the Roosevelt Room.",
    "Breyer, 83, reportedly conveyed his plans to the president last week (scooped by NBC News), and now gives Biden the first Supreme Court pick of his presidency.",
    "In a bid to win support from GOP corners, the blueprint includes a number of bills that have already passed the lower chamber with wide bipartisan support.",
    "They said allied troop deployments in Eastern Europe are not up for negotiation and that NATO's open-door policy for membership will stand as is.",
    "The chairman said the Fed had not made decisions about the size and frequency of rate hikes ahead, adding that those discussions are to come.",
    "In addition, Graham has backed most of Biden's judicial nominees and supported the confirmations of Justices Sonia Sotomayor and Elena Kagan.",
    "Total U.S. coronavirus deaths reported each morning this week: Monday, 866,540; Tuesday, 868,512; Wednesday, 872,126; Thursday, 876,066.",
    "LeBron James\nKareem Abdul-Jabbar\nMichael Jordan\nAll of the above\nAfter his basketball career ended, which accolade was Bryant awarded?",
    "Meadows, in contrast, has opted to halt his initial cooperation with the panel, which could result in contempt of Congress charges.",
    "Jeff Zients, the White House's COVID-19 response coordinator, revealed the figure during a public health briefing (The Hill).",
    "The court's next term starts in October, a month before the midterm elections, which could hand Senate control to the GOP.",
    "ABC News: What to know about Jackson (pictured below), one of just 39 active Black female federal judges out of 793 total.",
    "Harris will hold a bilateral meeting with Castro at 2 p.m. CST and depart in the early evening to return to Washington.",
    "Email your responses to asimendinger@thehill.com and/or aweaver@thehill.com, and please add Quiz? to subject lines.",
    "The Hill's Sylvan Lane reports the Fed, as expected, keeps interest rates unchanged with hikes expected this year.",
    "The vice president will be in Honduras for the inauguration of President Xiomara Castro at 11 a.m. CST (The Hill).",
    " Washington D.C., Mayor Muriel Bowser (D) on Wednesday extended the district's indoor mask mandate until Feb. 28.",
    "Blinken said the president made personal edits to the document delivered in Moscow but declined to be specific.",
    "The winner of the GOP primary will likely face former Georgia state Rep. Stacey Abrams in the general election.",
    "Graham, Susan Collins (Maine), and Lisa Murkowski (Alaska) (The Associated Press, The Washington Post and CNN).",
    "Michelle Lujan Grisham (D), vying for reelection, wants tax cuts for low-wage earners (The Associated Press).",
    "https://bloom.bg/3ADRT3g\nThe year of American disappointment, by Ross Douthat, columnist, The New York Times.",
    "Stephen Breyer testifies\" width=\"580\" height=\"396\" data-delta=\"2\" />\nWelcome to The Hill's Morning Report.",
    "OPINION\nBreyer's Supreme Court pragmatism will be missed, by Noah Feldman, columnist, Bloomberg Opinion.",
    "We get you up to speed on the most important developments in politics and policy, plus trends to watch.",
    " The Labor Department will release claims for unemployment insurance filed in the week ending Jan. 22.",
    "Moscow officials have warned of retaliatory measures? if demands are not met (The Associated Press).",
    "https://nyti.ms/3r5RR0A\nWHERE AND WHEN\nThe House meets on Friday at 9 a.m. for a pro forma session.",
    "Russia's spokesman said the government will take its time before responding (The Washington Post).",
    "THE CLOSER\nAnd finally  It's Thursday, which means it's time for this week's Morning Report Quiz!",
    "All told, it sets out a serious diplomatic path forward, should Russia choose it,? Blinken said.",
    "The Wall Street Journal: What Russia wants and what the U.S. is proposing in the Ukraine crisis.",
    "We invite you to share The Hill's reporting and newsletters, and encourage others to SUBSCRIBE!",
    "Winners who submit correct answers will enjoy some richly deserved newsletter fame on Friday.",
    "The meeting with the committee was held virtually and lasted between six and seven hours.",
    "The New York Times: Republican rift on Ukraine could undercut U.S. appeals to allies.",
    "The New York Times: Breyer's departure will leave the court younger and more divided.",
    "The New York Times and The Hill: Here's how Senate Democrats plan to move quickly.",
    "Kemp defeated Abrams in the gubernatorial contest in 2018 by roughly 55,000 votes.",
    "Niall Stanage, The Memo: Breyer delivers circuit breaker gift to embattled Biden.",
    "The Associated Press: Breyer: a pragmatic approach searching for a middle ground.",
    "As CNN notes, Williamson was in the West Wing while the deadly riot was ongoing.",
    "Glenn Youngkin (R) wants to cut grocery and gas taxes (Richmond Times-Dispatch).",
    "The Morning Report is created by journalists Alexis Simendinger and Al Weaver.",
    "Please recommend the Morning Report to friends and let us know what you think.",
    "Circuit Court of Appeals last year with support from three Republicans, Sens.",
    "The directive was set to expire at the end of January (The Washington Post).",
    "This outlook is quite uncertain and we're going to have to adapt,? he noted.",
    "None\nBryant never endorsed which product/company during his lengthy career?",
    "? POLITICS: In the closely watched Georgia GOP gubernatorial primary, Gov.",
    "The Wall Street Journal: Political risks, opportunities for Democrats.",
    "The Hill: Justice's retirement throws a curveball into the midterms.",
    "The Kremlin seeks to limit how the U.S. military engages globally.",
    "The Hill: Progressives see Breyer retirement as cold comfort.",
    "Readers can find us on Twitter @asimendinger and @alweaver22.",
    "Email: asimendinger@thehill.com and aweaver@thehill.com.",
    "The Senate convenes at 10 a.m. for a pro forma session.",
    "Alexis Simendinger and Al Weaver are the co-creators.",
    "The Wall Street Journal: Fed tees up March increase.",
    "It would be the first rise since December 2018.",
    "The New York Times: What to know about Kruger.",
    "Bryant was named to 18 NBA All-Star teams.",
    "Who is the only player named more often?",
    "Senators will return to work on Monday.",
    "In Virginia, newly inaugurated Gov.",
    "Adidas\nMcDonald's\nGatorade\nSprite",
    "We want to hear from you!",
    "ET at Rising on YouTube.",
    "CLICK HERE to subscribe!",
    " Massachusetts Gov.",
    " New Mexico Gov.",
    "It is Thursday!",
    " Nebraska Gov."
  ]
}