{
  "id": 1539,
  "mediaId": 195,
  "date": "1/27/2022 12:00:00 AM",
  "headline": "Kemp leading Perdue in Georgia gubernatorial primary: poll",
  "image": "https://cdn.jwplayer.com/v2/media/lZ0OUpZQ/poster.jpg?width=640",
  "link": "https://thehill.com/homenews/campaign/591568-kemp-leading-perdue-by-7-points-in-georgia-gubernatorial-primary-poll",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Mychael Schnell",
  "authorUrl": "https://thehill.com/author/mychael-schnell",
  "termIds": [
    1646,
    1664,
    1951,
    2095,
    2355,
    3082,
    4325,
    415,
    428,
    2672
  ],
  "sentences": [
    "Trump in his endorsement said that Kemp has been a very weak Governor? and that RINOs?  an acronym for Republicans in name only?  had run all over him on Election Integrity, and more.?\nKemp raised more than $7 million between July 1 and Jan. 9, leaving his campaign with more than $12 in the bank as he heads into the election year.",
    "Perdue's campaign announced on Tuesday that the former senator tested positive for a COVID-19 breakthrough case and would quarantined but said that he looks forward to being back out on the campaign trail as soon as possible.?\nThe poll, conducted between Jan. 19 and Jan 24, surveyed 666 likely Republican voters.",
    "Former Georgia state Rep. Vernon Jones (R) received 10 percent support in the survey, while educator Kandiss Taylor and human resources professional Catherine Davis polled in single digits.",
    "The GOP primary is shaping up to be a competitive race, with some Republicans worrying that the internal battle could hurt the party when the race proceeds to the general election.",
    "Trump had been looking for a formidable candidate to take on Kemp after the governor refused to support Trump's effort to overturn his loss in the 2020 presidential election.",
    "The winner of the GOP primary will likely face former Georgia state Rep. Stacey Abrams in the general election, as no other Democrats are running for the party's nomination.",
    "An affiliated leadership campaign,? however, is allowed to raise funds during the session, according to a law passed by the GOP-led state legislature last year.",
    "The poll, conducted by Quinnipiac University, found that 43 percent of likely Republican voters are backing Kemp, while 36 percent favor Perdue.",
    "Kemp's campaign also filed an ethics complaint last week arguing that Perdue's campaign had illegally worked with a new fundraising committee.",
    "Brian Kemp is leading former Sen. David Perdue (Ga.) in the GOP primary for the Peach State's gubernatorial race, according to a new poll.",
    "Perdue has filed a lawsuit targeting that law, contending that it gives Kemp an unjust advantage because of his status as an incumbent.",
    "The governor and Georgia state lawmakers are banned from raising money during the legislative session, which started on Jan. 10.",
    "Abrams ran for governor against Kemp in 2018, a race she lost by roughly 55,000 votes.",
    "Five percent of respondents said they remain undecided.",
    "Former President Trump endorsed Perdue last month.",
    "The margin of error is 2.4 percentage points.",
    "Georgia Gov."
  ]
}