{
  "id": 1547,
  "mediaId": 63,
  "date": "1/26/2022 12:00:00 AM",
  "headline": "75% Of Georgia Voters Aren't Very Confident' 2022 Election Will Be Fair, Poll Suggests",
  "image": "https://imageio.forbes.com/specials-images/imageserve/61f1b1acbbfc1c315f11a111/Coronavirus-Pandemic-2020-Presidential-Election-Georgia/0x0.jpg?fit=crop&format=jpg&crop=4434,2494,x0,y267,safe",
  "link": "https://www.forbes.com/sites/nicholasreimann/2022/01/26/75-of-georgia-voters-arent-very-confident-2022-election-will-be-fair-poll-suggests/",
  "mediaOutlet": "Forbes",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Nicholas Reimann",
  "authorUrl": "https://www.forbes.com/sites/nicholasreimann/",
  "termIds": [
    2095,
    2095,
    2203,
    2203,
    1951,
    1951,
    815,
    815,
    1646,
    1646,
    1147,
    1147,
    571,
    571,
    428,
    428,
    2672,
    2672
  ],
  "sentences": [
    "Key Facts\nThe poll of 1,702 registered voters found only 25% are very confident? the results will be counted fairly, while 37% are just somewhat confident,? 21% are not so confident? and 15% are not confident at all.?\nConcerns are spread across party lines, though Republicans appear more skeptical of the potential results than Democrats31% of Democratic respondents said they're very confident the count will be accurate, while only 15% of Republicans share that assessment.",
    "Topline\nOnly a quarter of Georgia voters feel very confident? the state will accurately count votes in the upcoming U.S. Senate and gubernatorial elections, according to a Quinnipiac University poll, setting the stage for potentially significant controversy given the contentious political climate, how tight the races are expected to be and how much is at stake.",
    "A series of recounts affirmed President Joe Biden won the state by around 12,000 votes, making Trump the first GOP nominee to lose Georgia since 1992, but in March, Republican lawmakers passed a bill enacting a sweeping new set of voting restrictions, such as shortening the early voting period and making it more difficult to vote by mail.",
    "In the GOP gubernatorial primary, the poll shows Kemp holding a seven-point lead over Perdue, with Kemp holding a 70% favorability rating among Republicans, despite Trump continually attacking him for not helping overturn the 2020 presidential election results.",
    "Georgia was again the center of the nation's political attention in January 2021, when Warnock and Sen. Jon Ossoff (D-Ga.) defeated GOP incumbents in runoff elections to win both of Georgia's U.S. Senate seats, flipping control of the chamber to Democrats.",
    "Trump has a strong track record of endorsing candidates that go on to win elections, but only 44% of likely Georgia GOP primary voters said Trump's endorsement makes it \"more likely\" they'd vote for a candidate.",
    "The poll shows a tight race in the gubernatorial general election between likely Democratic nominee Stacey Abrams and either of her probable Republican challengers, with Abrams trailing incumbent Gov.",
    "The Senate contest is expected to be a similar nail-biter, with the poll showing likely Republican nominee Herschel Walker leading Democratic incumbent Sen. Raphael Warnock 49% to 48%.",
    "Trump repeatedly called on Kemp to overturn the election results, and begged Georgia Secretary of State Brad Raffensperger (R) to \"find\" 11,000 votes after the election.",
    "Audio of the conversation between Raffensperger and Trump was leaked and spawned an ongoing criminal investigation into possible election interference on Trump's part.",
    "Brian Kemp by two percentage points and holding a 48% to 48% tie with former Sen. David Perdue, who's been endorsed by former President Donald Trump.",
    "Among Republicans, 47% said they're not confident the results will be counted fairly, while 38% of Democratic respondents said the same.",
    "Georgia has been a national focal point in the debate over election security and voting rights since the 2020 presidential election.",
    "Fifty percent said it makes no difference and 5% said they'd be less likely to vote for a candidate with Trump's endorsement.",
    "Trump fixated on Georgia after the election, baselessly claiming that widespread fraud kept him from carrying the state.",
    "Fellas, I Need 11,000 Votes': Trump Pressures Georgia Officials To Overturn Election In Leaked Audio Clip (Forbes)",
    "She accused Kemp of voter suppression in the contest, a claim the governor has continually denied.",
    "Abrams lost to Kemp in the 2018 gubernatorial election by about 55,000 votes but never conceded."
  ]
}