{
  "id": 1558,
  "mediaId": 195,
  "date": "1/25/2022 12:00:00 AM",
  "headline": "Perdue tests positive for COVID-19, campaign says",
  "image": "https://thehill.com/sites/default/files/styles/thumb_small_article/public/perduedavid_111820gn_lead.jpg?itok=v-ehWgrG",
  "link": "https://thehill.com/homenews/campaign/591245-perdue-tests-positive-for-covid-19-campaign-says",
  "mediaOutlet": "The Hill",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "Max Greenwood",
  "authorUrl": "https://thehill.com/author/max-greenwood",
  "termIds": [
    1646,
    2095,
    4325,
    571,
    2672
  ],
  "sentences": [
    "He will be quarantining and following the updated guidance from the CDC, and he looks forward to being back out on the campaign trail as soon as possible.?\nDozens of candidates and members of Congress have tested positive for the coronavirus in recent weeks as the highly contagious omicron variant makes its way through the country.",
    "Abrams, who came within 55,000 votes of beating Kemp in the 2018 race for Georgia governor, is so far unchallenged for the Democratic nomination.",
    "Brian Kemp in a hotly contested GOP primary, has been vaccinated against COVID-19 and has received a booster shot, his campaign said.",
    "Former President Trump has endorsed Perdue, who lost his Senate seat last year in a runoff election against Sen. Jon Ossoff (D-Ga.).",
    "Former Sen. David Perdue (R-Ga.) has tested positive for COVID-19, his gubernatorial campaign said in a statement.",
    "The eventual winner of the primary will likely face Democrat Stacey Abrams in the November general election.",
    "Yesterday afternoon, during routine COVID-19 testing, David Perdue tested positive,? the campaign said.",
    "The primary fight between Perdue and Kemp is among the most closely watched in the country.",
    "Perdue doesn't have a fever and isn't experiencing symptoms at this time.",
    "He isn't currently experiencing any symptoms.",
    "Perdue, who is challenging Georgia Gov.",
    "He is vaccinated and boosted."
  ]
}