{
  "id": 1567,
  "mediaId": 21,
  "date": "1/23/2022 12:00:00 AM",
  "headline": "Georgia Republican gubernatorial candidate David Perdue proposes an election police force to investigate voter fraud",
  "image": "https://i.insider.com/61ed7d8f2b43ff00185e2e88?width=1000&format=jpeg&auto=webp",
  "link": "https://www.businessinsider.com/david-perdue-georgia-election-police-force-voter-integrity-kemp-trump-2022-1",
  "mediaOutlet": "Business Insider",
  "biasRatingId": 1,
  "wordCount": 0,
  "author": "John L. Dorman",
  "authorUrl": "https://www.businessinsider.com/author/john-l-dorman",
  "termIds": [
    661,
    1646,
    2095,
    428,
    2661,
    2672
  ],
  "sentences": [
    "Georgia Republican gubernatorial candidate David Perdue on Thursday pledged to create a new police unit that would probe voter fraud, forging ahead with a direct appeal to supporters of former President Donald Trump who continue to question the validity of the 2020 presidential election, according to The Atlanta Journal-Constitution.",
    "After three presidential ballot counts in Georgia and the failure of multiple lawsuits initiated by Trump campaign attorneys in court  along with conspiracy theories centered on illegal ballots in suitcases and deceased voters participating in the election  no evidence of mass voter fraud has surfaced in the critical swing state.",
    "Last year, the Republican-controlled legislature passed the Election Integrity Act of 2021, or SB 202, the highly-controversial voting law which restricts ballot drop boxes to early voting sites and limits their usage to voting hours, and narrows the window for requesting an absentee ballot, among other measures.",
    "The proposal from Perdue comes as the Republican candidate has continued to rail against Georgia's election administration, calling for absentee ballots to be inspected in Democratic-heavy Fulton County and insisting that he would have declined to certify the state's election results if he had been governor.",
    "Trump has relentlessly inserted himself into Georgia politics  even pushing for Republican Secretary of State Brad Raffensperger to \"find\" votes to overturn Biden's statewide victory  and backed Perdue's candidacy after Kemp refused to entertain the former president's election-related pressure campaign.",
    "Kemp  a onetime ally of Trump  has been castigated by the former president for over a year for certifying the 2020 presidential election results in Georgia, which the governor was required to officiate by law after now-President Joe Biden's victory in the former Republican stronghold.",
    "In November, the winner of the Republican gubernatorial primary will face former Democratic state House Minority Leader Stacey Abrams  one of the nation's most prominent voting-rights activists and the party's gubernatorial nominee in 2018.",
    "DeSantis has asked state lawmakers to provide $5.7 million for the new unit, which would give the state's executive branch increased power over election investigations, according to a CNN report.",
    "It is unclear how the new police unit would be structured, but Perdue said that it would look into election crimes and give Georgia voters a sense of security regarding the integrity of the vote.",
    "In 2020, Biden defeated Trump in Georgia by 11,779 votes out of nearly 5 million ballots cast; the president received 2,473,633 votes, or 49.5%, while Trump earned 2,461,854 votes, or 49.2%.",
    "\"His proposal recognizes that governors have no legal authority in the oversight, administration or investigation of elections under current state law and constitution,\" he said.",
    "Email address\n By clicking Sign up', you agree to receive marketing emails from Insider as well as other partner offers and accept our Terms of Service and Privacy Policy.",
    "Brian Kemp last December with the support of Trump  said that the law enforcement unit would \"give Georgians confidence that only legal votes will be counted.\"",
    "\"Leave it to a 20-year career politician like Kemp to sit on his hands when we needed him most,\" Perdue said on Thursday in criticizing the governor.",
    "Jessica McGowan/Getty Images\nGOP gubernatorial nominee David Perdue proposed a new election police unit in Georgia, per the AJC.",
    "Kemp spokesman Cody Hall last week told the Journal-Constitution that Perdue's plan shows that \"his entire campaign is a lie.\"",
    "Perdue's push to establish an \"Election Law Enforcement Division\" in Georgia came during the same week that Republican Gov.",
    "Ron DeSantis of Florida unveiled details for a election police force, which elicited broad opposition from Democrats.",
    "Perdue also said that he would push for state election results to be \"independently audited\" before certification.",
    "Perdue  who served in the US Senate from 2015 until January 2021 and launched an intraparty campaign against Gov.",
    "Perdue, who has backed Trump's debunked election claims, is following the lead of Florida Gov.",
    "That year, Kemp narrowly defeated Abrams by a 50.2%-48.8% margin, or 1.4 percentage points.",
    "The results produced the smallest margin in a Georgia gubernatorial election since 1966.",
    "Subscribe to push notifications\n Deal icon An icon in the shape of a lightning bolt.",
    "Perdue has made election integrity a key part of his intraparty challenge to Gov.",
    "Get a daily selection of our top stories based on your reading preferences.",
    "\"He failed us, and Georgians lost confidence that their vote would count.\"",
    "It indicates a way to close an interaction, or dismiss a notification.",
    "Georgia Republican gubernatorial candidate David Perdue.",
    "For you\n Close icon Two crossed lines that form an 'X'.",
    "Stay up to date with what you want to know.",
    "Sign up for notifications from Insider!",
    "Loading Something is loading.",
    "Ron DeSantis.",
    "Brian Kemp."
  ]
}